{
  "Charmander": {
    "sets": [
      {
        "name": "Sun Wallbreaker",
        "description": "<p>Charmander's only viable set is as a sun attacker; under sun, Charmander's Solar Power-boosted Fire-type moves deal massive damage. Weather Ball is Charmander's most spammable STAB attack in sun, while Overheat and Fire Blast allow it to clean weakened teams even without sun. Finally, because Charmander does not have any coverage moves and sun teams often struggle to fit a Spore absorber, Sleep Talk allows it to fulfill the role of a sleep absorber. Choice Scarf allows Charmander to outspeed the entire unboosted metagame and common Choice Scarf users like Mudbray, Porygon, and Magnemite. Charmander requires sun support from from Vulpix. It can break down shared checks for other Fire-types and benefit from other sun sweepers like Ponyta weakening Water-types like Frillish and Mareanie, which are challenging Pokemon to chip down. Fighting-types that lure Mareanie and remove its Eviolite, like Mienfoo and Timburr, also help Charmander. Diglett helps trap Pokemon like the aforementioned Mareanie, Ponyta, and Staryu.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 416460, "username": "yellowfin"}]}
  },
  "Sandshrew-Alola": {
    "sets": [{"name": "Hail Sweeper", "description": "<p>Alolan Sandshrew finds a niche in LC as a hail sweeper due to the sheer power of Triple Axel, which lets it power through Pokemon like Mienfoo, Koffing, and Natu. Earthquake threatens Ice-resistant foes such as Mareanie, Ponyta, and Pawniard. With Rapid Spin and Swords Dance, Alolan Sandshrew can capitalize on setup opportunities and quickly snowball out of control. Wide Lens significantly improves Triple Axel's accuracy. Hail support from Snover or Amaura is necessary to facilitate a sweep. Trappers such as Wynaut and Diglett can help remove threats to hail teams; Wynaut deals with Timburr and its pesky Mach Punch, while Diglett can remove Mareanie and Fire-types like Ponyta and Vulpix.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Vulpix": {
    "overview": "<p>Thanks to Drought, Vulpix has incredibly strong Fire-type attacks that make it a rather potent offensive pick, threatening several Pokemon such as Ferroseed and Grookey. At 17 Speed, Vulpix is just fast enough to threaten the likes of Vullaby without a Choice Scarf while being rather easy to revenge kill with unboosted Speed. There is an appeal to doubling up on Fire-type attackers with the support of Drought for dedicated wallbreakers, though a shallow movepool leaves Vulpix unable to do much to overcome its own checks and counters. Vulpix is consigned to being a one dimensional wallbreaker, but very few Pokemon can tank hits from the Fire- and Grass-type coverage that it brings to a team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Flame Charge is a nice option on non-Choice item sets for boosting Vulpix's Speed to outspeed the unboosted tier. Eject Pack allows Vulpix to use Overheat and immediately switch out to bring in Diglett to trap the likely Fire-resistant Pokemon on the field. Heat Rock gives additional turns of Sun, turning Vulpix into a niche support Pokemon for unorthodox picks such as Solar Blade Ponyta and Choice Scarf Charmander. This is not generally recommended, though, as these teams end up with large defensive gaps and heavily rely on being able to win with these fast Fire-types. Heavy-Duty Boots allows Vulpix to avoid taking entry hazard damage, but the benefits of Heat Rock often outweigh the advantages of it. Memento can be used in conjunction with a setup sweeper, such as Woobat or Shellder.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: As Water-types with Recover, Staryu, Mareanie, Shellos, and Frillish are all rather sturdy answers to Vulpix's sun-boosted attacks. Mareanie is particularly resilient owing to its ability Regenerator. Staryu does need to beware Choice Scarf Vulpix hitting it with Energy Ball on the switch, but this is not too troublesome.</p> <p><strong>Ponyta: As the main other Fire-resistant Pokemon in the tier with recovery, Ponyta is a major issue for Vulpix. Drought powers up Ponyta, making it more difficult to switch into while also causing Morning Sun to heal Ponyta for another quarter of its health. Ponyta may run Flash Fire to absorb Fire-type attacks and completely wall Vulpix, though Ponyta is still a sufficient check without it.</p> <p><strong>Priority and Entry Hazards</strong>: Vulpix is frail enough that taking a quarter of its health upon switching in greatly limits its potential. Onix is a common Stealth Rock setter and is able to switch into Vulpix's Fire-type attacks somewhat well. Chip damage in general is how more offensive teams will overcome Vulpix generally, as Fake Out or Sucker Punch with entry hazards up is enough to keep Vulpix from cleaning up teams throughout the game.</p> ",
    "sets": [
      {
        "name": "Choice Item",
        "description": "<h1>Moves</h1> <p>Weather Ball is Vulpix's strongest accurate STAB move when sun is up, but it requires sun to actually be useful. Overheat is incredibly strong and can be used to break through several Pokemon, such as scoring the OHKO on Vullaby. Energy Ball is chiefly for Onix and Staryu and the only coverage option worth running. Hypnosis allows for Vulpix to try to put a Pokemon to sleep on a forced switch, which can be valuable when facing teams with Mareanie or Ponyta. Fire Blast is a powerful attack, but it should be used in situations where you do not want to be locked into Overheat or Weather Ball, such as sun disappearing or having the need to switch out. That being said, running three Fire-type attacks can be cumbersome.</p> <h1>Set Details</h1> <p>The EV spread simply makes Vulpix as fast and powerful as possible. With a Timid nature, Vulpix reaches 17 Speed, outspeeding Vullaby and Speed tying with Mienfoo. The remaining EVs go into HP in order to give Vulpix one more switch into Stealth Rock. With Choice Scarf, Vulpix becomes one of the better revenge killers in the tier, outspeeding Dragon Dance Scraggy and Choice Scarf Pawniard. Choice Scarf also allows Vulpix to assume the role of a late-game cleaner. Choice Specs instead doubles down on Vulpix's threatening Fire-type attacks in order to make it a ferocious wallbreaker.</p> <h1>Usage Tips</h1> <p>Vulpix is too frail to switchin on any neutral attack and is weak to entry hazards, which consequently means that getting it into play is a challenge. Intelligent double switches or pivoting moves such as U-turn are key components to getting Vulpix in. From there, it is often as straightforward as using the appropriate Fire-type attack while occasionally using Energy Ball to catch Staryu or Onix on the switch. Vulpix can also catch common switch-ins, such as Ponyta and Mareanie, and cripple them severely with Hypnosis. Do be mindful of Drought turns, as Vulpix without sun in play is no threat at all. Vulpix is easily threatened by all faster Pokemon and priority attacks and therefore should usually be switching out of these matchups.</p> <h1>Team Options</h1> <p>Vulpix's success is determinant on coming in safely, making bulky Mienfoo one of the best partners for it available in the tier, as it can cripple Mareanie with Knock Off and force Onix out. Due to its ability to trap and remove all of the hard stops to Vulpix available in the tier, such as Ponyta and Mareanie, Diglett is often a very important teammate. Hazard removal is absolutely necessary, leading Vullaby and Staryu to be highly recommended teammates. As Vulpix will struggle with opposing Water-types and make great use of Stealth Rock, Ferroseed is highly recommended. Pawniard assists with Stealth Rock and Knock Off support as a more offensive option. Ponyta and Choice Scarf Charmander pair with Vulpix well, as they both are capable attackers with sun support. Choice Specs Vulpix specifically does well with Thunder Wave support, making Slowpoke and Porygon worthy teammates as well.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 255030, "username": "San Tomas"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 150971, "username": "Coconut"}]}
  },
  "Diglett": {
    "comments": "<h1>Other Options</h1> <p>Focus Sash Diglett is an option on hyper offense teams as a lead that can guarantee Stealth Rock and Memento. Focus Sash Diglett can also run a set of Protect + Sludge Bomb with full Special Attack investment and a Timid nature, which can surprise and trap opposing Grookey and serve as an emergency safeguard against other sweepers, but the set is weak and struggles to make progress against foes it does not hit for super effective damage. Choice Scarf Diglett outspeeds the entire metagame, including +2 Porygon, +1 Tyrunt, and +1 Ponyta, and can be used as a backstop against opposing Diglett and other fast threats with Final Gambit.</p> <h1>Checks and Counters</h1> <p><strong>Grookey: Grookey only fears the rare Sludge Bomb and can punish Diglett's presence with its hard-hitting STAB moves, Knock Off, U-turn, and Swords Dance, all of which can grant momentum and force difficult predictions. Grassy Terrain also severely weakens Earthquake and can make trapping difficult.</p> <p><strong>Opposing Arena Trap Users</strong>: Opposing Diglett and Trapinch can take out Diglett before it traps its main target, and thus it must be deployed carefully when facing them to maximize its value.</p> <p><strong>Bulky Pokemon: Bulky threats like healthy Mienfoo, Porygon, and Staryu can take advantage of Diglett after a trap, tolerating its attacks to garner momentum and force hard predictions.</p> ",
    "sets": [
      {
        "name": "Air Balloon",
        "description": "<p>Air Balloon Diglett can guarantee the removal of dangerous threats and defensive stalwarts like Ponyta, Focus Sash Abra, and Mareanie while eluding opposing Arena Trap users with Air Balloon. Air Balloon also allows it to trap opposing Diglett. Final Gambit is a powerful option that sacrifices Diglett to guarantee KOs on low-health foes. Beat Up KOes Focus Sash Abra with five hits and hits Galarian Ponyta and Natu hard while Diglett's teammates are healthy. Protect blocks Mienfoo's Fake Out and Trapinch's First Impression, letting Diglett preserve its Air Balloon. Substitute can be used to more reliably trap Pawniard, while Sucker Punch provides priority to teams that lack it. Diglett can run Stealth Rock, but it will rarely find turns to set it up due to its frailty.</p> <p>Air Balloon Diglett works best with teammates that fear opposing Diglett like Ponyta and Abra without Shed Shell, and, against non-Air Balloon Diglett, it can punish the opponent for trapping one of these threats by counter-trapping their Diglett. Diglett removing important defensive Pokemon like Pawniard and Mareanie is also beneficial to Abra, Porygon, and Mienfoo. Mienfoo can force in targets like Mareanie and bring in Diglett safely to trap them with U-turn. Arena Trap means Diglett does not have traditional counters, but Grookey can heavily punish Diglett after it traps a foe, and Shed Shell Abra can evade Arena Trap. Bulky Poison-types like Koffing and Foongus, as well as Natu, can cover the Grookey matchup, while Frillish, Ferroseed, and Pawniard can slow down Abra.</p> "
      },
      {
        "name": "Eviolite",
        "description": "<p>Eviolite Diglett trades the flexibility of Air Balloon and the power of Life Orb for bulk and reliability, as Eviolite lets it take a hit from foes like Mareanie, Pawniard, and non-Life Orb Abra and Diglett to secure a KO. Final Gambit trades Diglett for a KO or major damage against bulky foes like Ferroseed. Beat Up KOes Focus Sash Abra with five hits and threatens Galarian Ponyta and Natu while Diglett's teammates are healthy. Stealth Rock is an option for role compression, and Diglett's ability to trap its foes prevents Natu from blocking Stealth Rock. Memento can aid setup sweepers, especially Salac Berry Magnemite. Earth Power helps Diglett trap foes like Mareanie and Ponyta while Grassy Terrain is active. The given investment in Special Defense helps Diglett more reliably trap threats like Abra.</p> <p>Eviolite Diglett works well with teams that want to guarantee a KO against a foe that other sets cannot reliably defeat, including Pawniard for hard hitters like Abra, Porygon, and Calm Mind or Cosmic Power Natu. This set works in tandem with Salac Berry Magnemite, as it reliably sets Stealth Rock while being able to switch into Ferroseed's Giga Drain, letting it use Memento to secure Magnemite's trap and setup. This set is vulnerable to Grookey, which does heavy damage to Diglett and forces it out, and to opposing Arena Trap users, especially Trapinch. Bulky Poison-types like Koffing and Foongus, along with Natu, cover the matchup against Grookey while Grookey itself or Staryu can take advantage of Trapinch.</p> "
      },
      {
        "name": "Life Orb",
        "description": "<p>Life Orb Diglett accepts maximum frailty in return for maximum power, and its sheer strength allows it to trap a wide array of enemies without Eviolite, even including chipped Mienfoo and Foongus. Earthquake is very powerful with Life Orb, while Beat Up KOes Focus Sash Abra in four hits and threatens Galarian Ponyta, Natu, and Frillish while Diglett's teammates are healthy. Substitute allows Diglett to avoid Pawniard's Sucker Punch to reliably trap it. Rock Slide hits Natu and the rare Larvesta, while Sucker Punch can KO Grookey and Choice Scarf users like Porygon and Vulpix at low health. Protect blocks Mienfoo's Fake Out and Trapinch's First Impression, and hitting Trapinch with Earthquake before fainting can be invaluable to limiting the threat it poses to the rest of the team.</p> <p>Life Orb Diglett can threaten almost any defensive core with its power, but teammates like Mienfoo, Porygon, Abra, and Natu especially benefit from its ability to remove Mareanie and Pawniard. This set can also support teams weaker against Mienfoo because Diglett can trap and remove it after Knock Off and chip damage. Trapinch and Air Balloon Diglett are the main roadblocks for this set, as they will always trap and KO Diglett after it gets its own KO. Grookey also punishes Diglett, but it must be wary of Sucker Punch when at low health. Grookey and Staryu can take advantage of Trapinch and Diglett, while Koffing, Foongus, and Natu check Grookey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Meowth": {
    "overview": "<p>Meowth is a niche revenge killer with the combination of Technician-boosted Fake Out + Feint to handle Choice Scarf users like Vulpix, Porygon, and Mienfoo offensively. It can also check frail fast threats like Abra and Grookey. It also has a great matchup against hyper offense teams like sun, Spikes-stack, and dual screens due to its ability to waste turns and cripple frail sweepers. Meowth can threaten bulkier Pokemon such as Koffing and Staryu with Fake Out into Double-Edge, if these have been chipped or hit with Knock Off beforehand, allowing it to threaten bulky offense teams. However, Meowth is extremely frail and vulnerable to fainting if it cannot KO the foe, and priority users like Grookey can easily revenge kill it if they survive Feint. Pokemon with Regenerator such as Mareanie and Foongus, as well as Steel-types like Pawniard and Ferroseed, can play around Meowth to negate progress. Most importantly, however, Meowth is almost entirely outclassed as a revenge killer by Grookey, which has much stronger priority in Grassy Glide and can opt to run Fake Out if necessary.</p> ",
    "comments": "<h1>Other Options</h1> <p>Aerial Ace gives Meowth a better matchup against Fighting-types like Mienfoo and Timburr. A Naive or Jolly nature can be run to hit 19 Speed. However, Meowth already has a good matchup against 19 and 18 Speed Pokemon with Fake Out and Feint, and it misses out on the power of an Attack-boosting nature.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Since Pawniard, Ferroseed, and Magnemite resist Meowth's STAB moves and aren't weak to Water Pulse, they use it as a free turn for entry hazards, setup, or Volt Switch.</p> <p><strong>Bulky Priority Users: Pokemon like Pawniard and Trapinch can tank Fake Out + Feint and retaliate with their own priority, so Meowth cannot use Double-Edge. Because Meowth often gets worn down quickly, even weak priority like Mienfoo's Fake Out can threaten it late-game.</p> <p><strong>Fighting-types: Timburr and Mienfoo can survive or prevent Fake Out + Double-Edge and OHKO or hit it with Mach Punch. Less common Fighting-types such as Croagunk can also force it out. Fighting-types must be wary of Aerial Ace, however.</p> <p><strong>Choice Scarf Users: Choice Scarf users like Mienfoo, Porygon, and Vulpix can threaten Meowth out after it has used Fake Out.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<h1>Moves</h1> <p>Fake Out helps to soften up Pokemon and revenge kill most weakened foes without Protect. If it is not enough to KO these, Feint can finish the job. Fake Out also breaks Sturdy and Focus Sash reliably, as well as helping against opposing priority users, such as weakened Timburr. Double-Edge is Meowth's strongest move; combined with Fake Out, it turns Meowth into a powerful wallbreaker, but it should be used sparingly due to the large amounts of recoil it can rack up. Water Pulse hits Onix, Dwebble, and Archen. With Fake Out, Meowth can beat SturdyJuice Onix and Dwebble as well. U-turn can be run over Water Pulse to escape bad matchups against Pokemon like Pawniard and Ferroseed. Additionally, not many Pokemon can tank Fake Out into Double-Edge, so Meowth can force many switches. It can take advantage of this to maintain momentum with U-turn. Knock Off can be run to weaken its checks, as Meowth can lure in Fighting- and Steel-types like Timburr and Ferroseed, which don't appreciate losing their Eviolite. Knock Off also prevents Regenerator cores from blocking Meowth.</p> <h1>Set Details</h1> <p>Technician increases the power of Meowth's low BP moves, and Life Orb is used to boost its otherwise lacking power. 36 SpA EVs allow Meowth to KO Archen after Fake Out chip damage, and 19 HP IVs are used to limit Life Orb recoil. A Naughty nature strengthens Meowth's STAB moves and doesn't weaken Water Pulse, but U-turn variants should run an Adamant nature and an EV spread of 236 Atk / 76 Def / 196 Spe.</p> <h1>Usage Tips</h1> <p>Meowth is extremely frail, so it shouldn't switch into attacks. Instead, aim to get it into the field through slow U-turns, double switches, or revenge killing opportunities. Faster Pokemon like Abra can run Protect—try to scout their sets to use Meowth's priority effectively. Feint can break through Protect, leaving them vulnerable to another Feint. Meowth can take the most advantage of its toolkit mid- or late-game when the opposing team is sufficiently weakened, so take care to preserve it until then. Always try to scout Onix and Dwebble to ensure you don't hit Weak Armor sets with Fake Out or Sturdy sets with Water Pulse. Making the right choice can potentially mean eliminating an entry hazard lead. U-turn variants should try to predict when Steel- and Fighting-types that wall Meowth, such as Pawniard and Timburr, might come in to maintain momentum.</p> <h1>Team Options</h1> <p>Entry hazard setters like Dwebble, Ferroseed, and Onix synergize well with Meowth chipping the opponent's team, especially if it carries U-turn. Knock Off users like Pawniard and Mienfoo allow Meowth to threaten even bulky teams, as few itemless Pokemon can take Fake Out into Double-Edge after entry hazards. Meowth appreciates having pivots such as Mienfoo and Grookey to guarantee a safe switch-in, chip foes, and maintain offensive momentum. If running Water Pulse, try pairing it with Pokemon that appreciate the removal of Rock-types like Ponyta to form wallbreaking cores. Meowth is entirely walled by Steel-types such as Pawniard, Ferroseed, and Magnemite, so partners like Mienfoo, Timburr, and Trapinch can take care of these.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 195129, "username": "Nineage"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 410251, "username": "zizalith"}]}
  },
  "Abra": {
    "comments": "<h1>Other Options</h1> <p>Energy Ball OHKOes Onix and targets other problematic foes like Staryu, Frillish, Diglett, and Trapinch. Abra can opt to run a dual screens set, consisting of Reflect, Light Screen, Thunder Wave, and Teleport with Light Clay, but it is outclassed by Natu in this role. Knock Off is a niche option to cripple checks such as Ferroseed, Frillish, and Munchlax on the switch. Dazzling Gleam is an option to hit both Fighting-types and Pawniard, easing prediction, but it is generally outclassed by other coverage options.</p> <h1>Checks and Counters</h1> <p><strong>Pawniard: Pawniard is one of the best checks to Abra thanks to its immunity to Psychic and ability to threaten Abra with Sucker Punch. It can force out Abra and use that opportunity to set Stealth Rock. However, Pawniard should be wary of Abra's coverage options.</p> <p><strong>Ferroseed</strong>: Ferroseed resists Psychic and threatens Abra with Thunder Wave and Knock Off. However, Ferroseed should be wary of Fire Punch.</p> <p><strong>Priority Attacks</strong>: Priority attacks are often the best ways to handle Abra, as they prevent it from getting a hit off. Strong priority like Grookey's Grassy Glide and Pawniard's Sucker Punch can KO, while weaker priority like Timburr's Mach Punch can break Abra's Focus Sash, leaving it vulnerable to faster attackers.</p> <p><strong>Choice Scarf Users: Choice Scarf users like Vulpix, Porygon, and Mienfoo outspeed and KO Abra. Choice Scarf Magnemite is notable, as it resists Psychic and doesn't enable Counter. However, Abra is able to check some of these Choice Scarf users with an intact Focus Sash; it also does not give Download Porygon a Special Attack boost, which makes it harder for Porygon to sweep.</p> <p><strong>Trappers: Diglett, especially Eviolite Diglett, can trap and eliminate Abra with Beat Up or Earthquake. Trapinch can take a hit from Abra and KO it in return while also potentially breaking Focus Sash with Feint. However, they are less reliable against Shed Shell Abra.</p> ",
    "sets": [
      {
        "name": "Shed Shell",
        "description": "<p>Shed Shell mitigates one of the most effective ways to remove Abra in trappers, making it a fearsome offensive threat. Shadow Ball hits Psychic-types like Galarian Ponyta, Natu, and opposing Abra and Frillish. Both Focus Punch and Fire Punch target Steel-types; Focus Punch OHKOes Pawniard, while Fire Punch heavily dents Ferroseed. Substitute takes advantage of Abra forcing switches to give it an extra layer of protection while also making it easier to use Focus Punch. Alternatively, Abra can forgo Substitute and fit both Focus Punch and Fire Punch to be less prediction reliant. Inner Focus helps Abra in the lead matchup by preventing it from flinching due to Mienfoo's Fake Out and letting it potentially set up with Substitute.</p> <p>Abra is best utilized as an early- and mid-game wallbreaker and late-game cleaner. Shed Shell allows Abra to be played more aggressively, as it doesn't have to fear getting trapped. It also lets Abra be utilized as a lead to beat lead Mienfoo, giving insurance if Mienfoo pivots to a trapper. Fighting-types such as Mienfoo and Timburr pressure Steel-types like Pawniard and Ferroseed; in return, Abra handles Poison-types like Foongus, Mareanie, and Koffing. Knock Off support from Mienfoo, Ferroseed, and Pawniard allows Abra to KO foes like Foongus and Mareanie with Psychic; Ferroseed and Pawniard also help check problematic foes like Choice Scarf Porygon. Trappers such as Diglett and Trapinch can remove Pawniard, Ferroseed, and opposing Diglett.</p> "
      },
      {
        "name": "Focus Sash",
        "description": "<p>Shadow Ball hits opposing Psychic-types and Frillish. Protect blocks Fake Out from Mienfoo and First Impression from Trapinch, preserving Focus Sash and preventing the latter from KOing Abra. Counter synergizes with Focus Sash to potentially revenge kill fearsome setup sweepers like Swords Dance Grookey,Belly Drum Magby, and Pawniard, while Thunder Wave cripples switch-ins like Pawniard and serves as a safety net against Choice Scarf users and setup sweepers.</p> <p>Abra is best utilized as an early- and mid-game wallbreaker and late-game cleaner. It is very important that Focus Sash is preserved until the late-game, as Abra often will be the best option to revenge kill setup sweepers. Fighting-types such as Mienfoo and Timburr complement Abra really well, pressuring Steel-types like Pawniard and Ferroseed; in return, Abra is able to handle Poison-types like Foongus, Mareanie, and Koffing, which limit the effectiveness of the Fighting-types. The aforementioned Poison-types are also solid partners, absorbing priority attacks such as Grookey's Grassy Glide and Timburr's Mach Punch and preserving Abra's Focus Sash. Knock Off support from Mienfoo, Timburr, and Pawniard allows Abra to KO foes like Foongus and Mareanie with Psychic. Trappers such as Diglett and Trapinch can remove Pawniard, Ferroseed, and opposing Diglett. Abra synergizes well with other special attackers like Galarian Ponyta and Porygon to overwhelm opposing Steel-types.</p> "
      },
      {
        "name": "Life Orb",
        "description": "<p>Life Orb Psychic severely damages most targets. Shadow Ball hits Frillish and opposing Psychic-types. Submission is used with 116 Attack EVs to let Abra lure in and OHKO Pawniard, while Fire Punch 2HKOes Ferroseed with 36 Attack EVs. Substitute allows Abra to take advantage of a forced switch and fire off an extra attack while also letting it avoid Pawniard's Sucker Punch. Alternatively, Protect blocks Mienfoo's Fake Out and Trapinch's First Impression and bluffs Abra's Focus Sash set. Inner Focus is a notable alternative over Magic Guard that lets Abra ignore flinch from Mienfoo's Fake Out in the lead matchup and KO it.</p> <p>Life Orb Abra is best utilized as an early- and mid-game wallbreaker, taking advantage of its incredible damage output to weaken opposing defensive cores. However, it should be played carefully, especially against teams with trappers, as Life Orb Abra is incredibly vulnerable to being trapped and removed. Abra fits on Spikes-stacking offense teams, taking advantage of Dwebble's and Ferroseed's Spikes weakening foes into KO range of its powerful attacks. Trappers such as Diglett and Trapinch can eliminate the troublesome Pawniard and Ferroseed, as well as opposing trappers. On less offensive team structures, playing Abra more passively and bluffing Focus Sash can be beneficial, as it causes the opponent to be more cautious. Knock Off absorbers such as Timburr and Mienfoo, as well as defensive cores like Ferroseed + Mareanie and Staryu + Foongus, can help Abra handle opposing Dark-types and Choice Scarf users like Porygon and Vulpix. Grass-resistant foes like Foongus, Koffing, and Ponyta are also appreciated, helping Abra against Grookey. Abra has good synergy with other special attackers like Porygon and Staryu due to their ability to wear down shared checks like Ferroseed and Frillish.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 192841, "username": "dave"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Tentacool": {"sets": [{"name": "Defensive Utility"}]},
  "Ponyta": {
    "comments": "<h1>Other Options</h1> <p>Solar Blade is run on sun teams for its excellent coverage against Water-types and Onix. Hypnosis can completely cripple a single foe, but it is unreliable and Ponyta cannot usually spare a moveslot for it.</p> <h1>Checks and Counters</h1> <p><strong>Trappers: Ponyta is extremely vulnerable to trappers due to its Ground weakness and only decent bulk. Diglett naturally outspeeds and OHKOes Ponyta, but it is unable to revenge kill if Ponyta has boosted its Speed with Flame Charge. Trapinch survives any one attack and can OHKO Ponyta in return but fears Will-O-Wisp.</p> <p><strong>Onix: Onix can survive a High Horsepower, takes little from Ponyta's other attacks, and can retaliate with super effective STAB attacks. However, it cannot repeatedly switch into High Horsepower, is crippled by Will-O-Wisp, and does not check Ponyta on sun teams, where it carries Solar Blade.</p> <p><strong>Bulky Water-types</strong>: Water-types such as Staryu, Mareanie, and Frillish are some of the few Fire-resistant foes in the metagame and can force Ponyta out with their super effective STAB attacks. However, all three fear Wild Charge, and Mareanie fears High Horsepower.</p> <p><strong>Chip Damage: Even with Berry Juice, Ponyta is worn down quickly by a combination of recoil from its attacks, Stealth Rock damage, and priority attacks such as Mienfoo's Fake Out.</p> ",
    "sets": [
      {
        "name": "Berry Juice Attacker",
        "description": "<p>Berry Juice Ponyta is a dangerous wallbreaker with its combination of power, Speed, and coverage. Wild Charge hits Water-types like Staryu, Frillish, and Mareanie for super effective damage. Flame Charge lets Ponyta clean late-game and avoid being revenge killed by Diglett. High Horsepower hits Rock-types such as Onix and Tyrunt, as well as opposing Fire-types. Berry Juice is used to increase Ponyta's longevity, as it is worn down quickly by Stealth Rock and recoil from its attacks. Flash Fire provides Ponyta with a useful Fire immunity that boosts the power of its STAB moves, and it gives an excellent matchup against sun teams. Flame Body is a viable alternative to punish priority from foes such as Mienfoo and Grookey and to avoid being walled by Trace Porygon.</p> <p>This Ponyta set can be used to wallbreak mid-game or clean late-game, with the latter role mitigating its vulnerability to chip damage. Grookey makes a good partner, as it can check Water- and Ground-types for Ponyta and weaken Diglett's and Trapinch's Earthquakes; it also appreciates Ponyta's breaking through common defensive cores such as Ferroseed + Mareanie. Fast Water-types have good offensive synergy with Ponyta, which handles Grookey for them; Carvanha can lure in exploitable foes such as Ferroseed and safely bring Ponyta in with Flip Turn, while Staryu can threaten foes like Mareanie and Onix and provide Rapid Spin support. Knock Off support from teammates like Mienfoo, Pawniard, and Ferroseed softens checks like Mareanie to help Ponyta sweep late-game. Ponyta is often seen on sun teams together with Vulpix and Charmander, where Ponyta helps to break through the three Fire-types' shared counters with its power and strong coverage. A teammate capable of counter-trapping opposing Diglett, such as Trapinch, Air Balloon Diglett, or Trace Porygon, gives Ponyta much more flexibility against teams using Diglett; an ally Diglett can also trap Staryu and Mareanie. Finally, Natu is a good teammate for its ability to deny Stealth Rock.</p> "
      },
      {
        "name": "Eviolite",
        "description": "<p>This set combines bulk and Speed to check a variety of threats such as Grookey and Mienfoo. Will-O-Wisp lets Ponyta cripple these foes, as well as common switch-ins like Onix and revenge killers like Trapinch. Morning Sun keeps Ponyta healthy so it can outlast its checks once they have been burned. Flame Charge makes Ponyta difficult to check offensively and neutralizes the threat of Diglett. High Horsepower is an alternative that provides well-rounded coverage against threats like Mareanie and Onix. Flame Body is preferred to punish physical attacks like Mienfoo's Fake Out or U-Turn or Grookey's Grassy Glide.</p> <p>Eviolite Ponyta is one of the metagame's most effective Grookey counters; thus, it pairs well with Grookey-weak teammates like Staryu, Carvanha, and Abra. Grookey takes advantage of the Water- and Ground-types that threaten Ponyta. Staryu can also handle these foes in addition to providing Rapid Spin support. Teammates such as Tyrunt and offensive Porygon appreciate Ponyta spreading burns against foes such as Mienfoo, Grookey, and Onix. Natu helps keep Stealth Rock off the field for Ponyta. Counter-trappers such as Trapinch, Air Balloon Diglett, and Trace Porygon can remove opposing Diglett.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 107567, "username": "gali"}]}
  },
  "Ponyta-Galar": {
    "comments": "<h1>Other Options</h1> <p>Substitute can be used to avoid Sucker Punch and status moves from the likes of defensive Porygon. Berry Juice works well with it, and it removes the need to run Morning Sun. Galarian Ponyta can also make use of its decent Attack stat with powerful moves like Wild Charge, Zen Headbutt, Play Rough, Low Kick, and High Horsepower. Wild Charge targets foes like Natu and Frillish. High Horsepower and Low Kick target Steel-types, OHKOing the troublesome Pawniard after Stealth Rock. However, Play Rough, as well as Dazzling Gleam, provide redundant coverage in practice, with moves like Low Kick covering relevant Dark-Types better.</p> <h1>Checks and Counters</h1> <p><strong>Pawniard: Pawniard is a serious threat to Galarian Ponyta, as it can eliminate it with either Sucker Punch or Knock Off. Galarian Ponyta can deal with Pawniard with its coverage moves like High Horsepower, Low Kick, and Mystical Fire; however, Mystical Fire does activate Pawniard's Defiant.</p> <p><strong>Carvanha</strong>: Carvanha can easily switch into Calm Mind Galarian Ponyta, as it is immune to Psychic, threatens it offensively, and can pivot with Flip Turn.</p> <p><strong>Trappers</strong>: Diglett can trap Galarian Ponyta and threaten it with Earthquake and Beat Up, though it cannot switch in. Trapinch can threaten Galarian Ponyta using priority in First Impression, and its bulk lets it survive most hits from Galarian Ponyta.</p> <p><strong>Special Walls: Frillish and Munchlax can keep Galarian Ponyta in check and give it a hard time setting up with Calm Mind. Frillish can cripple it with Will-O-Wisp and threaten it with Hex, while Munchlax can set up with Curse and paralyze it with Body Slam.</p> <p><strong>Slowpoke: Slowpoke resists both of Galarian Ponyta's listed attacks, taking them well even after Calm Mind boosts. Slowpoke can paralyze it with Thunder Wave or pivot to a threat using Teleport.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Thanks to its great Speed and Calm Mind, Galarian Ponyta is a decent special setup sweeper. Calm Mind helps Galarian Ponyta set up on foes like Koffing. Mystical Fire hits Steel-types such as Ferroseed and Pawniard hard, and it also helps Galarian Ponyta set up on special attackers like Natu by lowering their Special Attack. Morning Sun gives Galarian Ponyta good longevity and allows it to set up Calm Mind more easily. Pastel Veil eases set up, especially against Poison-types.</p> <p>Calm Mind Galarian Ponyta is best used late-game as a cleaner. However, its physical bulk isn't good, and therefore it can get easily trapped by the likes of Diglett or removed by strong physical attackers like Grookey. Trapinch is a solid partner, as it can deal with opposing trappers and eliminate troublesome Pawniard. Fighting-types like Mienfoo and Timburr can lure in Poison-types for Galarian Ponyta to eliminate and force out foes like Pawniard, as well as absorb Knock Off for it. Walls like Ferroseed can deal with Dark-types such as Carvanha. Grookey and Pawniard synergize well with Galarian Ponyta by dealing with checks like Frillish, and in return, Galarian Ponyta can pressure Fighting- and Poison-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}]}
  },
  "Slowpoke": {
    "overview": "<p>Slowpoke's typing and bulk allow it to act as a blanket check to many Pokemon, such as Onix and Staryu, as well as check Psychic- and Fire-types effectively. Moreover, Slowpoke sports a handful of great utility moves. These include Teleport, which synergizes well with Regenerator and allows a teammate to be brought in safely, and Slack Off, which gives it reliable healing, as well as Scald, Thunder Wave, and Fire Blast. However, Slowpoke is very slow, and its typing leaves it with weaknesses to STAB attacks from common presences such as Vullaby, Pawniard, Grookey, and Magnemite as well as common coverage from Pokemon Slowpoke tends to soft check throughout a match, such as Staryu's Thunderbolt, Timburr's and Mienfoo's Knock Off, and U-turn from a number of threats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Wave can be used to cripple opposing Pokemon, which a slower teammate can take advantage of. Fire Blast threatens Ferroseed and Pawniard, and it eases prediction against teams carrying both Foongus and Pawniard. Zap Cannon super effectively hits the likes of Flying- and Water-types, but its inconsistent accuracy often makes it a poor choice.</p> <h1>Checks and Counters</h1> <p><strong>Knock Off and U-turn: Knock Off and U-turn are widespread moves that hit Slowpoke super effectively. Knock Off hinders Slowpoke in the long run and can be used quite easily on Slowpoke, since it is slow. Pokemon Slowpoke soft checks such as Mienfoo, Timburr, and Mareanie can pack Knock Off. U-turn makes gaining momentum against Slowpoke by forcing it out a breeze, which can prove detrimental to teams needing the momentum Slowpoke could offer.</p> <p><strong>Dark-types: Vullaby, Pawniard, and Scraggy are immune to Slowpoke's Psychic-type moves and can take advantage of it being on the field. Pawniard can freely set Stealth Rock, and Nasty Plot Vullaby and Scraggy can set up on Slowpoke. Furthermore, Dark-types tend to pack a dreaded STAB Knock Off, threatening Slowpoke with an OHKO, and Vullaby can pack U-turn. However, these Dark-types dislike Scald burns and Thunder Wave, and Pawniard must beware of Fire Blast.</p> <p><strong>Grass-types: Ferroseed can take the free turns Slowpoke gives it to stack entry hazards, remove items with Knock Off, or spread paralysis. Grookey threatens Slowpoke with Grassy Glide and Wood Hammer, and it can set a Swords Dance up upon forcing Slowpoke out, which makes it an even bigger threat. Foongus can 2HKO Slowpoke with Giga Drain, but it struggles against Slowpoke's Psychic. Slowpoke's Grass-type switch-ins must, however, be wary of the rare Fire Blast, and Grookey and Ferroseed also dislike Scald burns.</p> <p><strong>Electric-types: Magnemite can come in and use Volt Switch on Slowpoke very freely, although it dislikes being burned by Scald. It must also account for Fire Blast. Chinchou isn't bothered by these but dislikes switching in repeatedly, especially on Psychic-type moves.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<h1>Moves</h1> <p>Scald threatens common switch-ins such as Pawniard, Vullaby, and Ferroseed with a burn. Future Sight is Slowpoke's main way of applying offensive pressure to foes, taking advantage of Slowpoke forcing Pokemon such as Foongus, Koffing, Mareanie, and Ponyta out and Psychic-resistant Pokemon in, which can be taken advantage of by teammates. Psychic is an alternative to Future Sight that allows it to hit foes directly. Teleport synergizes with Future Sight and Regenerator and can allow a threatening teammate to get on the field safely.</p> <h1>Set Details</h1> <p>Regenerator allows Slowpoke to repeatedly switch into the likes of Abra, Vulpix, and Ponyta and check them throughout the game. 116 HP EVs give Slowpoke 27 HP, which means it will recover 9 HP with Regenerator. Both defenses reach even numbers to get the most out of Eviolite's boosts. The maximized Special Defense patches up Slowpoke's low natural special bulk. The EVs dumped into Special Attack ensure it can 2HKO Foongus with Psychic or deal decent damage to most targets with Future Sight. A spread more focused on physical bulk of 116 HP / 236 Def / 116 SpA / 36 SpD can be used, which allows Slowpoke to check Mudbray and Onix better at the cost of compromising special bulk. Slowpoke's Eviolite is very important to maintain its bulk in order to check threats throughout the game.</p> <h1>Usage Tips</h1> <p>Slowpoke should be switched in against Pokemon it checks or soft checks when it is healthy. It should focus on finding room to launch Future Sight if running this attack and making good use of Teleport, taking advantage of forced switches to bring in threatening Pokemon safely. When its health is low, Slowpoke should be switched out to recover HP thanks to Regenerator. It can also use Slack Off when up against Pokemon it checks to keep itself healthy. Slowpoke should be wary of Knock Off, since it can reduce its effectiveness for the remainder of the game. As such, switching it in on Pokemon that oftentimes carry Knock Off such as Timburr and Mienfoo isn't a wise decision, even if Slowpoke resists their STAB moves and could otherwise freely switch in to be eligible for Regenerator. Scald should be used to threaten its usual switch-ins in Pawniard, Vullaby, and Ferroseed and when firing off a Future Sight isn't needed.</p> <h1>Team Options</h1> <p>As Slowpoke is very weak to Knock Off, Knock Off absorbers such as Mienfoo, Timburr, and Spritzee are great teammates. They like Slowpoke's ability to handle Psychic-, Fire-, and Poison-types and can handle the Dark-types Slowpoke tends to invite in. Fighting-types like Mienfoo and Timburr also provide Knock Off support and can handle the Steel-types that Slowpoke often invites in well. Mienfoo and Slowpoke form a fairly good Regenerator core due to their pivoting moves, whereas Timburr can provide hazard removal to a team. Poison-types such as Foongus and Koffing handle Grookey and can remove Toxic Spikes from the field, which Slowpoke greatly appreciates. In turn, Slowpoke can handle threatening Psychic- and Fire-types for them. Ponyta can also check Grookey for Slowpoke and likes Slowpoke soft checking Water-types. Pokemon such as Grookey, Magnemite, and Vullaby form a VoltTurn core with Slowpoke and can cover some of its weaknesses. Strong attackers such as Choice item Mienfoo and Vulpix like Teleport support and Future Sight preventing common checks from stomaching an attack. Lastly, trappers such as Diglett and Trapinch can remove troublesome foes for Slowpoke, such as Magnemite and Pawniard, and like Teleport support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410251, "username": "zizalith"}, {"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 438243, "username": "PyProd"}]}
  },
  "Magnemite": {
    "comments": "<h1>Other Options</h1> <p>Magnemite can run a bulky Magnet Pull set that effectively removes both Ferroseed and Pawniard. This set holds an Eviolite and runs Iron Defense, Charge Beam, Flash Cannon, and Rest. However, it is not very useful outside of this specific role and is usually outclassed by Trapinch.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-types are immune to Magnemite's Electric-type STAB moves, blocking its Volt Switch pivoting, and can OHKO it with their STAB attacks. Diglett and Trapinch can both trap Magnemite while outspeeding it or surviving an attack and OHKOing in return. Mudbray can come in on an Electric-type attack and threaten Magnemite's team with its powerful attacks.</p> <p><strong>Fighting-types: Fighting-types such as Mienfoo and Timburr OHKO Magnemite with their STAB attacks. They are especially threatening to Berry Juice variants due to Knock Off. However, they don't like taking a hit from Magnemite.</p> <p><strong>Ponyta: Ponyta outspeeds and OHKOes Berry Juice sets and outspeeds Choice Scarf sets after a Flame Charge. However, it is hit hard by Magnemite's Electric-type STAB attacks.</p> <p><strong>Grass-types</strong>: Grass-types are often an opponent's primary checks to Magnemite thanks to their Electric resistance. Ferroseed resists all of Magnemite's attacks and can force it out with Knock Off, Foongus can put it to sleep with Spore, and Grookey outspeeds and threatens it with Drain Punch. However, Magnemite resists their STAB attacks and can threaten Foongus and Grookey with Steel-type attacks.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Magnemite is a powerful hit-and-run attacker that outspeeds almost the entire metagame. Volt Switch punishes opposing switch-ins with chip damage and grabs momentum. Steel Beam is Magnemite's most powerful attack, OHKOing most neutral targets after minimal prior damage. A Timid nature is preferred to ensure Magnemite outspeeds Choice Scarf Porygon. A Modest nature is a viable alternative that increases many of Magnemite's damage rolls. Analytic helps Magnemite punish the switches it forces, especially with Volt Switch.</p> <p>Staryu is a great partner for Magnemite that can switch into Ponyta, Onix, and Mudbray and help wear down shared checks like Ferroseed. Fighting- and Poison-types are already present on most teams and can reliably switch into Magnemite's checks. Frail attackers like Ponyta and Abra appreciate Volt Switch to soften up foes and bring them in safely. This set is very easy to trap with Diglett or Trapinch, especially if it is locked into an Electric-type attack, so be very careful when facing teams with one of these Pokemon; a trapper of your own like Air Balloon Diglett or Trace Porygon thus makes a good partner.</p> "
      },
      {
        "name": "Berry Juice",
        "description": "<p>Berry Juice Magnemite is a powerful offensive pivot that checks threats such as Porygon and Abra. Volt Switch lets Magnemite escape unfavorable matchups and generate momentum using its survivability and the switches it forces. Flash Cannon doesn't force Magnemite out and prevents Ground-types from freely switching in. Recycle in tandem with Berry Juice allows Magnemite to fully heal continually, giving it nearly unmatched longevity. Endure lets it survive any hit when chip damage deactivates Sturdy. Reaching 1 HP with either Endure or Sturdy activates Berry Juice, fully healing Magnemite and reactivating Sturdy. Recycle lets these cycles be used continually. Steel Beam is Magnemite's strongest attack, OHKOing almost everything that doesn't resist it, and its recoil can be mitigated by Berry Juice. Thunderbolt gives Electric-type coverage without forcing a switch and is slightly stronger than Flash Cannon.</p> <p>Fighting- and Poison-types such as Mienfoo and Koffing are mandatory in order to absorb Knock Off for Magnemite, which makes Recycle fail. Staryu checks Ponyta and Mudbray and can remove Stealth Rock. Grookey is an excellent partner; it shares several Magnemite checks such as Ferroseed and Ponyta, can keep its Sturdy intact with Grassy Terrain, and can check Ground-types. Frail attackers such as Ponyta and Abra appreciate Magnemite getting them in safely with Volt Switch.</p> "
      },
      {
        "name": "Trapper",
        "description": "<p>This Magnemite set traps and sets up on the common Ferroseed, serving as a wincon. Substitute allows it to safely activate Salac Berry. Charge Beam boosts Magnemite's Special Attack and is weak enough to boost all the way to +6 before KOing Ferroseed. Flash Cannon provides almost perfect neutral coverage and OHKOes anything that doesn't resist it when boosted to +6. Rest allows Magnemite to PP stall Ferroseed and stay healthy for an eventual sweep.</p> <p>Pokemon that can lure in Ferroseed, such as Porygon, Abra, and Water-types, are essential partners for setting up a Magnemite sweep; even if it is unable to fully sweep, these Pokemon appreciate Ferroseed being removed. Eviolite Diglett can reliably switch into Ferroseed, provide Memento support to ensure Ferroseed cannot break Magnemite's Substitute, break opposing Abra's Focus Sash, and guarantee Stealth Rock against teams with Natu. This set struggles against Pawniard teams, so your team should prepare to handle Pawniard by bringing a Fighting-type such as Mienfoo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 107567, "username": "gali"}]}
  },
  "Onix": {
    "comments": "<h1>Other Options</h1> <p>Body Press hits Ferroseed harder than Onix's other moves, as well as Porygon on sets without Dragon Dance, but beware that it does not pair well with Weak Armor's Defense drops. Taunt completely shuts down Koffing and certain setup sweepers like Shellos. Protect lets Onix use Grassy Terrain to heal off Stealth Rock damage and also helps the matchup against Mienfoo by punishing High Jump Kick.</p> <h1>Checks and Counters</h1> <p><strong>Trappers: Trapinch and Diglett trap and KO Onix effectively, and Trapinch especially has enough bulk to switch into it. Diglett can run Earth Power to avoid triggering Weak Armor. However, neither can OHKO Onix with Earthquake, and Diglett loses to +1 Dragon Dance Onix.</p> <p><strong>Staryu: Staryu outspeeds Onix, OHKOes it easily, and removes Stealth Rock with Rapid Spin. However, Staryu is not quite bulky enough to switch into Onix without Eviolite consistently, and it can be overpowered by Dragon Dance Head Smash sets.</p> <p><strong>Fighting-types</strong>: Bulky Fighting-types like Mienfoo and Timburr give Onix trouble by switching into its moves well and threatening with a super effective STAB move or Knock Off. Timburr additionally can revenge kill a weakened Onix with Mach Punch. Both can be worn down without Eviolite, though, and broken through by Dragon Dance sets.</p> <p><strong>Bulky Grass-types: Ferroseed and Foongus are bulky Grass-types that can switch into Onix with relative ease and OHKO it with Giga Drain. Both can take advantage of forcing Onix out by setting hazards and spreading status with Thunder Wave and Spore, respectively. However, both Grass-types can be worn down and overwhelmed, especially by Dragon Dance sets, without their Eviolite.</p> <p><strong>Grookey: Grookey can almost always revenge kill Onix with Grassy Glide and can take advantage of a forced switch with Knock Off, U-turn, and Swords Dance. Grassy Terrain also significantly weakens Onix's Earthquake. However, Grookey cannot reliably switch in to Onix, as it takes heavy damage from Onix's Rock-type moves.</p> <p><strong>Strong Special Attackers</strong>: Though foes like Porygon and Abra cannot switch into Onix well, both threaten to KO it with their powerful attacks. Porygon especially can OHKO with Ice Beam and use Onix to reliably boost its Special Attack with Download.</p> ",
    "sets": [
      {
        "name": "SturdyJuice",
        "description": "<p>Onix is both a reliable Stealth Rock setter and an excellent safety net against threatening foes like Ponyta and Tyrunt. High Horsepower is the STAB move of choice when Onix is paired with Grookey. Onix is an excellent Stealth Rock user because of its Speed, bulk, and ability to threaten Natu. Explosion does major damage to neutral foes and can be used to prevent setup from the likes of Porygon and Grookey or recovery from Timburr's Drain Punch. Endure lets Onix guarantee recovery with Berry Juice after it has taken chip damage. Sturdy and Berry Juice pair excellently, allowing Onix to take powerful hits and heal to full.</p> <p>Onix pairs well with teammates that want to guarantee Stealth Rock against Natu. Ferroseed is a valuable partner that can switch into Water-types, Abra, and Porygon, while Onix can switch into Ponyta and Koffing and allow it to run Spikes. Grookey is a strong teammate because it needs Stealth Rock support to beat Natu and benefits from Onix handling Ponyta, though it does necessitate the use of High Horsepower over Earthquake. Frillish handles threatening attackers like Staryu and Porygon well. Bulky Poison-types like Koffing and Mareanie handle Fighting-types well, and Koffing and Foongus check Grookey. Natu reliably switches into Grass-types and Mudbray.</p> "
      },
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance Onix is a dangerous sweeper that outspeeds most common Choice Scarf users at +1 and uses its bulk to set up on common foes like Koffing and Choice-locked Porygon. Head Smash can overwhelm even bulky foes like Staryu at +1. High Horsepower should be used if paired with Grookey. Explosion lets Onix heavily damage foes it cannot OHKO, such as Timburr. This set can run Stealth Rock for role compression, as Onix is still an effective setter.</p> <p>This set wants teammates that can handle the foes it cannot reliably break through, such as Ferroseed, Foongus, Timburr, and Grookey. Koffing can check both Grass-types and Fighting-types and deny Regenerator recovery for Foongus and Mienfoo, wearing them down. Trapinch and Focus Sash Diglett can sometimes trap Grookey, though Grookey often runs Protect to deny Trapinch's First Impression. Knock Off support from Mienfoo, Ferroseed, Mareanie, and Pawniard helps soften foes into KO range at +1. This set is still bulky and can form a solid defensive core with Frillish and Ferroseed.</p> "
      },
      {
        "name": "Weak Armor",
        "description": "<p>Weak Armor Onix is a defensive stalwart that reliably sets Stealth Rock while also checking Koffing and Ponyta well. High Horsepower is the STAB move of choice when paired with Grookey. Onix is a great Stealth Rock setter because of its ability to threaten Natu, which might otherwise deny hazards with Magic Bounce. Explosion lets Onix deal heavy damage, especially against bulky foes like Timburr and Foongus. Weak Armor lets Onix switch into physical threats like Ponyta and outspeed them after taking a hit.</p> <p>This set is beneficial to teammates that need reliable Stealth Rock setting, especially against Natu. Grookey and Abra appreciate this, as Stealth Rock lets both handle Natu more reliably, though the former necessitates the use of High Horsepower. Ferroseed appreciates Onix handling Koffing, Ponyta, and Natu, and it in turn handles Staryu, Porygon, and Frillish for Onix. Onix's Stealth Rock also allows Ferroseed to run Spikes. Frillish also handles special attackers like Staryu and Porygon well. Foongus and Koffing check Grookey and Fighting-types, and Koffing can also threaten Ferroseed and Foongus. Natu can switch into Mudbray, Ferroseed, and Foongus reliably.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 107567, "username": "gali"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Lickitung": {"sets": [{"name": "Defensive"}]},
  "Koffing": {
    "comments": "<h1>Other Options</h1> <p>Flamethrower is a viable alternative to Fire Blast that trades power for reliability. Memento on offense teams allows Koffing to support teammates such as Magby and Tyrunt. Clear Smog prevents setup sweepers like Galarian Ponyta from setting up on Koffing. Levitate is a niche option on teams that are weak to Ground-types, but it is almost never worth sacrificing the ability to force progress against Mienfoo.</p> <h1>Checks and Counters</h1> <p><strong>Chip Damage: Koffing's lack of reliable recovery leaves it vulnerable to being worn down throughout a match by Stealth Rock damage and repeatedly switching into foes such as Mienfoo and Grookey. Pain Split partially mitigates this weakness, but it is unreliable at healing Koffing.</p> <p><strong>Mudbray: Mudbray forces Koffing out with the threat of Earthquake, taking a chunk out of a teammate or setting Stealth Rock; the RestTalk set can switch in with near impunity. However, Mudbray can be worn down with Fire Blast and is crippled by Will-O-Wisp.</p> <p><strong>Psychic-types</strong>: Abra, Natu, and Galarian Ponyta force Koffing out with the threat of Psychic; the latter can also set up on Koffing. However, none of them can safely switch into Koffing, and Neutralizing Gas breaks Abra's Focus Sash if Stealth Rock is up.</p> <p><strong>Rock-types: Onix and Tyrunt resist all of Koffing's attacks and threaten it with Earthquake and Psychic Fangs. They can both set up with Dragon Dance, and Onix can set Stealth Rock. However, both can be crippled with Will-O-Wisp.</p> <p><strong>Porygon: Porygon can OHKO Koffing with Psychic and severely dent it with its other attacks. Agility sets can also set up on Koffing. However, Neutralizing Gas prevents Porygon's Download from activating, and it will not activate if Porygon KOes Koffing.</p> <p><strong>Frillish</strong>: Frillish shrugs off Koffing's attacks and can heal off any damage or chip Koffing with its STAB attacks. However, Koffing can 2HKO with Thunderbolt if Frillish has been chipped or had its Eviolite removed.</p> ",
    "sets": [
      {
        "name": "Tank",
        "description": "<p>Koffing is Little Cup's premier physical tank. It can counter dangerous threats like Mienfoo and Grookey with its combination of good bulk, useful defensive typing, and Neutralizing Gas while opening up holes in opposing teams with its excellent coverage. Sludge Bomb is a powerful and reliable STAB move that can further chip foes with its high poison chance. Fire Blast is often Koffing's best midground attack, hitting Steel-types such as Ferroseed and Pawniard super effectively and doing decent damage to Ground-types like Mudbray and Eviolite Diglett. Thunderbolt hits common switch-ins like Mareanie, Staryu, and Natu for super effective damage. Pain Split allows Koffing to stay healthy enough to repeatedly check foes like Mienfoo, and it's often the most reliable way of damaging bulky foes like Frillish. Thief instead allows it to recover its Eviolite if it takes Knock Off and make progress against checks like Frillish and Natu. Lastly, Will-O-Wisp cripples many of Koffing's best answers, such as Mudbray and Onix. Neutralizing Gas denies Regenerator recovery from foes such as Mienfoo and Mareanie, allowing it to consistently make progress, while also making it immune to trapping. 156 Speed EVs allow Koffing to outspeed opposing Mareanie. Koffing can viably run a range of EV spreads, like a bulkier spread with HP investment or maximum Speed to tie Pawniard.</p> <p>Koffing's ability to make progress against Mienfoo is invaluable to a wide range of teammates, from Steel-types such as Pawniard and Ferroseed to sweepers like Carvanha and Swords Dance Grookey. Grookey in particular makes an excellent partner for Koffing; it handles opposing Ground-types and Frillish while providing passive recovery, while Koffing can check opposing Poison-types and wallbreak. Steel-types like Ferroseed and Pawniard are important teammates for switching into opposing Psychic-types and Porygon. Natu can switch into opposing Natu and Mudbray and serve as a secondary Grookey check. Pokemon that can check Ground- and Rock-types, such as Staryu, also make great teammates. Onix has good defensive synergy with Koffing and can sweep teams when opposing Mienfoo are weakened.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 107567, "username": "gali"}]}
  },
  "Staryu": {
    "comments": "<h1>Other Options</h1> <p>Staryu can run a Life Orb set to take advantage of its power and coverage, but it is extremely frail and vulnerable to being trapped by Diglett. Flip Turn or Teleport can be used to pivot out of unfavorable matchups; Flip Turn deals chip damage, while Teleport ensures that Staryu's teammate gets in unscathed. Finally, Staryu can serve as a dual screens setter on hyper offense, taking advantage of its higher Speed than other common setters like Natu.</p> <h1>Checks and Counters</h1> <p><strong>Ferroseed: Ferroseed resists all of Staryu's attacks bar Ice Beam and can set up Stealth Rock on it or cripple a teammate with Thunder Wave. However, it can be worn down throughout a match, especially if paired with a powerful special attacker like Abra or Porygon.</p> <p><strong>Grookey: Grookey threatens to OHKO Staryu with Grassy Glide and can set up Swords Dance while forcing it out. However, it is severely damaged by Ice Beam and fears being burned by Scald.</p> <p><strong>Foongus</strong>: Foongus freely switches into Staryu's STAB attacks, heals off any damage with Regenerator, and can deal heavy damage with Giga Drain or cripple one of Staryu's teammates with Spore. However, Analytic Staryu can 2HKO it with Ice Beam or Psychic.</p> <p><strong>Frillish</strong>: Frillish shrugs off most of Staryu's attacks and can heal off any damage or threaten Staryu with Will-O-Wisp + Hex. It can completely shut down Staryu with Cursed Body. However, it can be 2HKOed with prior damage or if it switches into an Analytic-boosted Thunderbolt with Stealth Rock up.</p> <p><strong>Electric-type Attacks</strong>: Electric-type STAB attacks from foes such as Magnemite can OHKO Staryu, while coverage moves such as Ponyta's Wild Charge and opposing Staryu's Thunderbolt can make it tough for Staryu to check these foes.</p> <p><strong>Diglett: Diglett can trap and remove a weakened Staryu with Earthquake, or it can guarantee an OHKO with Final Gambit and minimal prior damage. However, it cannot switch into Staryu safely and cannot revenge kill if it has a Rapid Spin Speed boost.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Staryu is one of Little Cup's few viable offensive Water-types thanks to its high Speed, good coverage, and reliable recovery. Thunderbolt hits Water-types like Mareanie, Frillish, and opposing Staryu, as well as Natu, for super effective damage. Ice Beam hits opposing Grass-types and is Staryu's best option against Ferroseed, while Psychic instead hits opposing Mienfoo and Poison-types super effectively. This set can run Rapid Spin over one of its coverage attacks, letting Staryu support its teammates with entry hazard control or act as a cleaner. Analytic lets Staryu deal extra damage to switch-ins, most notably netting a 2HKO on Foongus, as well as Frillish after Stealth Rock.</p> <p>Offensive Staryu is a useful soft check to a wide range of foes, from passive special attackers like Natu and Mareanie to dangerous offensive threats like Mudbray and Ponyta. A reliable answer to bulky Grass-types like Ferroseed and Foongus is important for Staryu to be effective; Natu is a great teammate because it handles both of these threats. Ponyta has great offensive and defensive synergy with Staryu; it handles Grass-types, while Staryu takes care of Water-types and Onix. Trapinch can trap and remove Ferroseed. Fire-weak teammates like Ferroseed and Pawniard appreciate Staryu's ability to switch into opposing Ponyta. Poison-types like Koffing and Foongus can handle Grookey, while Staryu checks opposing Ground-types. If running Rapid Spin, Larvesta makes an ideal teammate, handling Grass-types and benefitting from Staryu keeping Stealth Rock off the field.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Defensive Staryu is a reliable entry hazard remover and answer to opposing Water- and Ground-types. If teammates adequately handle Water-types, Thunder Wave can be run over Thunderbolt to cripple threats like opposing Staryu and Abra. 116 HP EVs let Staryu more reliably check threats such as Natu if Stealth Rock is up, as well as avoid the OHKO from Diglett's Final Gambit. Natural Cure gives Staryu a pseudo-immunity to status from foes like Frillish and from attacks like Scald and Sludge Bomb.</p> <p>This set removing Stealth Rock helps teammates like Ponyta. Larvesta in particular makes a fantastic teammate; it needs Stealth Rock off the field to be effective and is one of the best counters to Grass-types in the metagame, while Staryu can handle opposing Water-types. Koffing checks Grass-types and Mienfoo while benefiting from Staryu spinning and checking Ground-types. Natu works in tandem with Staryu to keep entry hazards off the field and can check Ferroseed, Foongus, and Grookey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 107567, "username": "gali"}]}
  },
  "Porygon": {
    "comments": "<h1>Other Options</h1> <p>Shadow Ball hits Psychic-types and Frillish hard while dealing decent damage to Ferroseed. Teleport lets defensive sets use their bulk to safely pivot offensive threats in.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-types like Pawniard, Ferroseed, and Magnemite resist Porygon's best moves and threaten it back with some combination of Knock Off, Thunder Wave, and offensive pressure. Berry Juice Pawniard and Magnemite are especially effective at absorbing hits. However, Pawniard and Ferroseed can be worn down, especially by the right coverage moves and given their lack of reliable recovery, and Magnemite is frail without Berry Juice. All three also must be wary of trappers.</p> <p><strong>Frillish: Frillish is immune to Tri Attack, does not fear Ice Beam or Psychic, has tremendous special bulk, and cannot be trapped, giving it an excellent matchup against offensive Porygon. It can be beaten by Thunderbolt, though, if it has lost its Eviolite.</p> <p><strong>Munchlax</strong>: Munchlax easily tanks Porygon's attacks, outheals its damage with Recycle and Berry Juice, and threatens it back with Body Slam and Curse. It cannot check Porygon if it loses Berry Juice to Knock Off, though, and Trapinch can remove it.</p> <p><strong>Denying Download Boosts: Often, the most effective way to limit offensive Porygon is by using EV spreads providing higher Special Defense than Defense, which make Download give useless Attack boosts. Several offensive threats such as Abra, Diglett, Ponyta, and Galarian Ponyta do this by default. Though not standard, some bulky Pokemon like Foongus, Ferroseed, and Ponyta can afford such an EV spread to reduce Porygon's effective points of entry.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Porygon is the tier's most effective Choice Scarf user because of its great damage output and coverage moves, which let it effectively clean up weakened teams. Tri Attack is Porygon's strongest choice, while Ice Beam is often most spammable, dealing a chunk of damage to Ferroseed and hitting other neutral targets hard with a Download boost. Both attacks carry a status chance, which sometimes lets Porygon bypass its checks. Thunderbolt is Porygon's best option to hit Pawniard and Frillish. Psychic threatens Mienfoo and Poison-types, OHKOing the former's standard set at +1. Trick is an alternative that trades Porygon's Speed to limit defensive checks like Ferroseed and Frillish in certain matchups.</p> <p>This set has tremendous synergy with other fast special attackers like Abra, Natu, and Galarian Ponyta by pressuring their shared checks like Pawniard and, in Abra's case, Ferroseed. Mienfoo is an effective partner because it can freely use Knock Off to weaken bulky foes into OHKO range and, with U-turn, can pivot on exploitable Poison-types it lures in like Koffing. Mienfoo also switches into and threatens defensive Porygon checks like Pawniard, Frillish, and the special sponges Ferroseed and Munchlax. Trapinch and Diglett can trap Steel-types and Munchlax, although foe Trapinch and Diglett deter and punish Porygon's Thunderbolt. Grookey can effectively punish Frillish.</p> "
      },
      {
        "name": "Agility",
        "description": "<p>Agility Porygon trades immediate offense for sweeping prowess. Porygon's bulk allows it to set up against weaker foes like Mareanie and Natu. Eviolite + Recover strengthens this ability, though offensive support is mandatory to cover for the reduced coverage. Ice Beam hits Ferroseed and most of the tier for strong neutral damage while hammering bulky foes like Mudbray and Onix. Psychic cleans through Mienfoo and weakened Poison-types. Berry Juice frees Recover's moveslot for another coverage move, like Thunderbolt, which stops healthy Pawniard and Frillish from preventing a sweep. However, it makes Porygon more vulnerable to Knock Off from Mareanie and strong priority from Grookey. Maximum Speed investment lets Porygon outspeed Choice Scarf Mienfoo and Vulpix after Agility.</p> <p>This set pairs well with special attackers like Abra, Natu, and Galarian Ponyta, which pressure Pawniard and Ferroseed, and it often relies on them wearing down its checks early- and mid-game. Knock Off users like Mienfoo, Pawniard, and Mareanie can remove Eviolite and bring important targets like Mienfoo and Poison-types into OHKO range. Pawniard, Ferroseed, and Frillish make sweeping difficult by taking Porygon's attacks well. Trapinch and Diglett can weaken or eliminate the Steel-types, while Grookey can make progress against Frillish teams. Diglett can also use Memento to guarantee a safe Agility for Porygon.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Trace and great natural bulk allow Porygon to serve as one of the tier's best walls. The choice of coverage move depends on what you prefer to check; Ice Beam hits a wider swath of the tier for neutral damage and hits Diglett and Trapinch super effectively, while Psychic threatens Poison-types. Thunder Wave shuts down would-be threats, almost none of which can OHKO Porygon, including opposing Porygon, Galarian Ponyta, and Abra. Trace lets Porygon shut down Flash Fire Ponyta, switch into Regenerator users like Mareanie and Foongus consistently, and counter-trap Diglett and Trapinch. The given defensive investment lets Porygon take hits from powerful threats like Life Orb Abra, Download Porygon, and Flame Body Ponyta.</p> <p>This set is a defensive jack-of-all-trades that can soft check many threats. Abra and Ponyta appreciate it counter-trapping Arena Trap users. Both Cosmic Power and Calm Mind Natu appreciate Porygon's ability to spread paralysis, especially against Pawniard. Porygon is vulnerable to Fighting-types like Mienfoo and Timburr and thus partners well with Poison-types like Koffing and Mareanie. Pawniard and other Knock Off users can also limit Porygon's effectiveness, but they fear Thunder Wave and can be pivoted into by Mienfoo or trapped by Trapinch and Diglett.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 107567, "username": "gali"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Omanyte": {
    "overview": "<p>Omanyte is a powerful setup sweeper in LC thanks to Shell Smash and a very good movepool that allows it to hit almost every Pokemon super effectively. It also works very well as an entry hazard setter, providing Stealth Rock and Spikes support. Omanyte's typing and bulk allow it to switch into prominent metagame forces like Choice-locked Vulpix and boost its stats or set entry hazards. However, Omanyte's viability is severely hindered by the presence of Grookey and Timburr, which can easily remove it with strong priority moves.</p> ",
    "comments": "<h1>Other Options</h1> <p>Omanyte can run Rock Blast on the Shell Smash set with a different EV spread of 36 Atk / 36 Def / 196 SpA / 236 Spe and a Rash nature to deal with Focus Sash Abra; however, dropping a less niche coverage move is not ideal. Scald is an option on the entry hazard set to potentially burn switch-ins such as Staryu and Ferroseed, although it is inconsistent and significantly weaker than Hydro Pump. Substitute helps Shell Smash Omanyte avoid status and provides safer opportunities to set up, while Protect allows Omanyte to ignore Fake Out and First Impression and punish High Jump Kick from Mienfoo.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grassy Glide from Grookey is Omanyte's greatest threat, and Foongus can prevent the Shell Smash set from setting up while also threatening the entry hazard set; however, both of them dislike Ice Beam or Blizzard on the switch. Ferroseed, on the other hand, can live any hit from Omanyte after Shell Smash and recover all the damage with Giga Drain while also being able to safely switch in against the entry hazard set, making it a very effective counter.</p> <p><strong>Abra: With Focus Sash, Abra can survive a hit from the Shell Smash set and KO Omanyte thanks to the Special Defense drop. However, Abra needs to be careful of Knock Off.</p> <p><strong>SturdyJuice Users</strong>: Sturdy Magnemite and the rare SturdyJuice Onix can tank any attack from Shell Smash Omanyte at full HP and revenge kill it with super effective attacks. However, they fail to counter it if entry hazards are on the field, unless they're running Endure and have Berry Juice intact. They also can't safely switch into Omanyte due to the threat of Knock Off.</p> <p><strong>Priority Users: Grookey, Timburr, Pawniard, and Trapinch can easily revenge kill or heavily damage Omanyte after Shell Smash.</p> ",
    "sets": [
      {
        "name": "Shell Smash Sweeper",
        "description": "<h1>Moves</h1> <p>Shell Smash makes Omanyte threatening, doubling both its Special Attack and Speed. Hydro Pump KOes most non-Water-resistant targets and has a high chance to KO foes like Mienfoo after Shell Smash. Surf is an alternative that's more accurate but requires notably more prior damage to get KOs. Ice Beam hits Grass-types like Foongus and Grookey, and it's the best move to hit Ferroseed, as well as being a safer option to hit Natu and Ground-types. Earth Power allows Omanyte to OHKO Mareanie and hit Staryu.</p> <h1>Set Details</h1> <p>A Modest nature is preferred for damage output, as Omanyte does not need a Timid nature to outspeed Choice Scarf users like Mienfoo after Shell Smash. Eviolite and Shell Armor give it more opportunities to set up.</p> <h1>Usage Tips</h1> <p>Omanyte should be used as a late-game sweeper that sets up after its checks and counters are damaged or removed. In particular, Ferroseed, Grookey, and Timburr should be removed, as they can survive a hit and revenge kill Omanyte after Shell Smash. Omanyte's typing doesn't allow it to set up in front of many common Pokemon, but the best ones are Choice-locked Vulpix and Choice-locked Porygon.</p> <h1>Team Options</h1> <p>Trapinch is the best partner on balance teams because it traps and removes Omanyte's strongest counters in Grookey and Ferroseed, as well ass being able to deal with Pawniard. Ponyta is another option to remove these counters. Fighting-resistant foes like Koffing and Foongus, or the more niche Spritzee, help against Mienfoo and especially Timburr with its threatening Mach Punch. Ferroseed is a good counter to Focus Sash Abra and SturdyJuice Magnemite and can cripple them with Knock Off, which is a good move to have on various team members to weaken Staryu and opposing Ferroseed. Omanyte can also fit on dual screens hyper offense teams, usually using Natu as a dual screens setter; common partners on this team structure are Swords Dance Grookey, Belly Drum Magby, and Pawniard.</p> "
      },
      {
        "name": "Entry Hazard Setter",
        "description": "<h1>Moves</h1> <p>Hydro Pump is Omanyte's best offensive move, being able to threaten any neutral target after a Speed boost. Knock Off weakens switch-ins that might come in to stop the Shell Smash set, especially bulky ones like Mareanie, Staryu, and Ferroseed. Spikes in combination with Stealth Rock can be very effective at forcing passive damage on the opposing team, especially if Omanyte's partners can prevent or punish entry hazard removal. Blizzard hits Grass-types like Grookey and Foongus on the switch, while Ice Beam is a safer but considerably weaker option. Toxic Spikes helps against hyper offense teams, which rarely use Poison-types.</p> <h1>Set Details</h1> <p>Defense investment with Eviolite allows Omanyte to more easily switch in multiple times, avoiding the OHKO from strong super effective attacks like Earthquake from Life Orb Diglett and High Jump Kick from Eviolite Mienfoo. 13 Speed is enough to outspeed the entire unboosted metagame after a Weak Armor boost, as well as most common Choice Scarf users. The Speed boost provided by Weak Armor allows it to generate offensive pressure or set multiple layers of entry hazards. Another possible EV spread alongside Grookey is 156 HP / 196 SpA / 156 Spe with a Timid nature; it allows Omanyte to survive all the needed hits, like Earthquake from Diglett and Mudbray, under Grassy Terrain while also getting an extra point in Special Attack.</p> <h1>Usage Tips</h1> <p>Omanyte is a common pick on entry hazard-stacking hyper offense teams as a dedicated lead, setting at least Stealth Rock and a layer of Spikes against most opposing leads. It is best utilized early- and mid-game by safely switching into common Pokemon like Choice-locked Vulpix and Porygon to set entry hazards. Omanyte should always get on the field through a pivot move or by switching into a resisted hit, preferably physical attacks to get the Weak Armor boost. If the matchup is not favorable and the opponent can KO Omanyte before it can do anything, the main goal is to try and set one or two layers of Spikes before it's removed from the game.</p> <h1>Team Options</h1> <p>On hyper offense teams, good sweepers and wallbreakers like Grookey, Choice Scarf Mudbray, and Life Orb Abra appreciate Omanyte's ability to set entry hazards and weaken their targets. On balance teams, it needs teammates that can switch into Grookey, so Foongus, Koffing, and Ponyta are good picks. Omanyte also benefits from pivot moves that allow it to come on the field safely, like U-turn from Mienfoo and Volt Switch from Magnemite. Pawniard punishes Defog attempts, while Magnemite, Tyrunt, and Grookey pressure common entry hazard control measures like Natu and Staryu; also, Diglett can trap the latter.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410251, "username": "zizalith"}, {"user_id": 449990, "username": "DC"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 490348, "username": "Albinson"}, {"user_id": 449990, "username": "DC"}]}
  },
  "Kabuto": {"sets": [{"name": "Support"}]},
  "Chinchou": {"sets": [{"name": "Offensive Pivot"}]},
  "Natu": {
    "comments": "<h1>Other Options</h1> <p>Shadow Ball lets Natu hit opposing Psychic-types super effectively, but it is more situational than Natu's other options. Giga Drain OHKOes the uncommon Onix and is Natu's best option for damaging Mudbray and Staryu. Substitute is a viable option on setup sets, easing prediction and getting around Pawniard's Sucker Punch. Natu can run a Life Orb set on hyper offense teams, but it is usually outclassed by Abra due to the latter's greater Speed and power.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Opposing Natu are one of the best switch-ins to Natu, blocking Thunder Wave and taking little from its attacks. Abra and Galarian Ponyta can threaten Natu with super effective coverage but fear Thunder Wave. All of these Pokemon are also hit hard by Shadow Ball.</p> <p><strong>Stealth Rock: Stealth Rock cripples Natu and makes it much harder to switch into opposing threats. However, Magic Bounce allows Natu to prevent foes such as Ferroseed from setting Stealth Rock.</p> <p><strong>Knock Off: Most Knock Off users can 2HKO Natu, with Pokemon such as Mienfoo and Grookey threatening to OHKO with prior chip damage. Pokemon such as Mareanie and Ferroseed that Natu is supposed to check can deal significant damage with Knock Off.</p> <p><strong>Porygon: Offensive Porygon outspeeds and OHKOes Natu with its Download-boosted attacks, but it is crippled by Thunder Wave. Defensive Porygon takes little from any of Natu's attacks and copies Magic Bounce with Trace to bounce its Thunder Wave back.</p> <p><strong>Pawniard</strong>: Pawniard OHKOes Natu with its Dark-type STAB attacks and can set up Stealth Rock as it forces Natu out. However, it doesn't like being paralyzed and is 2HKOed by Heat Wave.</p> <p><strong>Onix</strong>: Onix can shrug off Natu's attacks with Berry Juice, force it out with its Rock-type STAB attacks, and set Stealth Rock. However, it must watch out for the uncommon Giga Drain.</p> <p><strong>Electric-type Attacks</strong>: Thunderbolt from foes such as Koffing and Staryu can severely damage Natu, while Electric-types such as Magnemite can OHKO it outright.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<p>Natu's good typing, decent bulk, and excellent coverage make it one of Little Cup's premier offensive pivots. Psychic hits Little Cup's myriad of Fighting- and Poison-types for super effective damage. Heat Wave OHKOes Grookey and hits Steel-types like Pawniard and Ferroseed. Roost provides reliable recovery, making it a more effective answer to threats such as Koffing. U-turn helps Natu gain momentum off of the switches it forces, while Thunder Wave cripples common switch-ins like Pawniard and Porygon. Eviolite lets Natu stomach powerful neutral attacks such as Mudbray's Heavy Slam. Magic Bounce blocks Stealth Rock and allows Natu to safely switch into the likes of Ferroseed and Foongus. This set's EVs maximize Natu's Speed and physical bulk; an alternative EV spread of 36 HP / 76 Def / 116 SpA / 76 SpD / 196 Spe trades physical bulk for increased offensive presence.</p> <p>While an effective soft check to Fighting- and Poison-types, Natu is not a great switch-in to them, as they can threaten it with Knock Off or, in the case of the latter, poisoning from Sludge Bomb. Poison-types such as Mareanie and Koffing can safely switch into these attacks, while Natu can soft check Psychic-types and Mudbray for them. Steel-types such as Ferroseed and Pawniard can switch into threats such as Porygon and Abra and set up Stealth Rock. Special attackers that struggle to break through Ferroseed such as Abra and Staryu appreciate Natu's ability to switch into it. Fighting-types such as Mienfoo can absorb Knock Off and force out Pawniard and Porygon for Natu.</p> "
      },
      {"name": "Setup Sweeper", "description": "<p>This Natu set sets up on passive foes such as Foongus to sweep the opposing team. Calm Mind gives Natu immediate offensive presence, while Cosmic Power greatly increases its bulk. Stored Power should be used with Cosmic Power for more damage output, but it makes Natu passive without several boosts. Heat Wave 2HKOes Steel-types that resist Psychic. Roost provides recovery, allowing Natu to set up on foes such as Mareanie that cannot 2HKO it.</p> <p>This Natu set greatly appreciates Pawniard and fast Knock Off users such as Mienfoo being removed; Diglett and Trapinch thus make great partners. Mienfoo can absorb Knock Off and lure in opposing Poison-types that Natu can set up on, and it can pivot into Natu with U-turn. Steel-types such as Ferroseed handle opposing Porygon and Abra and support a Natu sweep with Stealth Rock and Thunder Wave. Poison-types such as Koffing and Mareanie handle Mienfoo, ensuring Natu can set up safely.</p> "},
      {"name": "Dual Screens Support", "description": "<p>This Natu set supports its teammates by setting Reflect and Light Screen. Teleport ensures one of Natu's teammates can get into play unscathed after dual screens are set. Thunder Wave cripples opposing setup sweepers trying to take advantage of Natu's passivity. Psychic is a viable option in this moveslot if offensive presence is desired. The given EV spread allows Natu to survive Mienfoo's Knock Off from full health.</p> <p>A suicide lead that can set Stealth Rock, paralyze the foe, and sacrifice itself to get Natu in safely makes a great teammate, as Natu can then ensure dual screens get up. Steel Beam Pawniard and Memento Diglett are good examples of this. Setup sweepers such as Magby and Tyrunt that appreciate the extra bulk Natu's screens provide make ideal teammates.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 107567, "username": "gali"}]}
  },
  "Elekid": {"sets": [{"name": "Offensive"}]},
  "Magby": {
    "overview": "<p>Magby is one of the premier Belly Drum sweepers in the tier with its combination of a good Speed tier, solid coverage, and priority. However, it is outclassed outside of hyper offense builds by Vulpix and Ponyta, and it can end up being useless if Belly Drum fails to go off, meaning that Magby must be played carefully and supported.</p> ",
    "comments": "<h1>Other Options</h1> <p>Magby can run a mixed Life Orb set with Fire Blast, Psychic, Thunder Punch, and Mach Punch with 15/15 attacking stats; this set, however, is heavily outclassed by Ponyta as a 19 Speed Fire-type and by Vulpix as a Fire-type wallbreaker. This set is also worn down very quickly by Life Orb recoil and entry hazards. Magby struggles to run any moves not already listed on its main set. Brick Break is an option to get past bulky checks like Onix without prior chip damage, but the cost of dropping Thunder Punch or Mach Punch is too high. Dual Chop allows Magby to break the Focus Sashes of Pokemon like Abra; however, Dual Chop is otherwise useless. Protect can be used to avoid the damage from Fake Out, but giving up a coverage move entirely is ill-advised, especially when considering Flame Body can also punish Fake Out.</p> <h1>Checks and Counters</h1> <p><strong>Priority: Priority in the form of Fake Out from Mienfoo or Grookey, or from Pokemon bulky enough to survive +6 Mach Punch, like Timburr, can chip Magby and knock it out before a sweep can happen.</p> <p><strong>19-20 Speed Pokemon: Healthy 19 Speed Pokemon like Staryu and Galarian Ponyta can put an end to Magby's sweep by winning the Speed tie. Eviolite Diglett can survive a +6 Mach Punch from full and OHKO back with Earthquake. Abra is of special note, as it often carries a Focus Sash, which guarantees that it will be able to survive one hit and OHKO with Psychic.</p> <p><strong>Onix: Onix is incredibly bulky and can survive a Mach Punch even after Magby has set up. However, Magby teams can chip Onix or remove its Eviolite to make a sweep possible.</p> ",
    "sets": [
      {
        "name": "Belly Drum Sweeper",
        "description": "<h1>Moves</h1> <p>Fire Punch hits for big damage at +6, OHKOing all neutral targets in the tier and even some resistant targets. Thunder Punch serves as Magby's best coverage move, allowing it to hit Water-types like Mareanie and Frillish, which would otherwise stop a sweep. Mach Punch hits Rock-types that resist Fire Punch like Onix and Tyrunt; it also allows Magby to beat slower priority users like Pawniard and faster Pokemon like Choice Scarf Porygon.</p> <h1>Set Details</h1> <p>29 HP IVs drop Magby's HP to an even number so that Belly Drum activates Berry Juice, restoring Magby back to full HP. The given EVs and nature maximize Magby's Speed and Attack, letting it reach a high 19 Speed. Vital Spirit allows Magby to absorb Spore and set up on Foongus. Alternatively, Flame Body gives it a chance to burn priority users, which means that a Fake Out from Mienfoo or Grookey might stop them from interrupting Magby's sweep.</p> <h1>Usage Tips</h1> <p>Magby should be brought in on double switches, after a sacrifice, with Teleport after dual screens have been set, or after a Memento, as it is incredibly frail and will not be able to take advantage of Belly Drum if it is chipped. Magby excels at cleaning weakened teams, so Magby teams should actively search for opportunities to sweep once checks like Onix and Staryu have been weakened. After Magby has a clear path to winning the game, carefully select a chance to use Belly Drum, as it can only use Belly Drum once. Magby's Speed can also let it force out foes to get a setup opportunity.</p> <h1>Team Options</h1> <p>Natu or another dual screens setter is almost a must-bring; without one, Magby's chances to set up are severely limited. Magby also enjoys not getting chipped when it switches in, meaning that Teleport support from the aforementioned Natu or Memento support from Diglett greatly helps it. Magby also synergizes well with other common dual screens sweepers that are also checked by Onix, like Tyrunt; this is because they each weaken Onix for the others to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 410251, "username": "zizalith"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 416460, "username": "yellowfin"}]}
  },
  "Treecko": {"sets": [{"name": "Sweeper"}]},
  "Carvanha": {
    "comments": "<h1>Other Options</h1> <p>Liquidation is stronger than Flip Turn for hyper offense teams, where Carvanha doesn't need to pivot as much. Waterfall can be used over Liquidation for the chance to flinch. Aqua Jet picks off weakened threats without needing a Speed boost. Destiny Bond over Protect lets Carvanha eliminate a counter such as Ferroseed and Foongus, letting a teammate like Grookey sweep teams. However, losing out on Protect leaves it extremely vulnerable to First Impression and Fake Out. Substitute can ease up prediction, but it forces Carvanha to lose out on coverage. Carvanha can run a special moveset to have a better matchup against Pawniard, but it has to use Hydro Pump for STAB, making it unreliable.</p> <h1>Checks and Counters</h1> <p><strong>Priority: Priority attacks such as Timburr's Mach Punch and Grookey's Grassy Glide force Carvanha out without letting it use Flip Turn. Other priority users such as First Impression Trapinch and Fake Out Mienfoo forces Carvanha to use Protect, letting smart opponents double switch on the Protect into a teammate that threatens Carvanha out.</p> <p><strong>Ferroseed and Pawniard: Ferroseed can take a few hits from Carvanha and weaken it down with Iron Barbs. Pawniard can take Carvanha's hits but can be worn down by repeated Flip Turns.</p> <p><strong>Bulky Foes</strong>: Mienfoo, Foongus, and Mareanie have high physical bulk and take on Carvanha well, but they must worry about Psychic Fangs and are OHKOed without Eviolite. They also have to worry about Flip Turn into Koffing, which blocks their recovery from Regenerator.</p> ",
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<p>Carvanha is a good wallbreaker and late-game cleaner thanks to its high Attack, Speed Boost, and almost unresisted STAB combination, outspeeding fast Pokemon like Abra, Diglett, and Choice Scarf Porygon after a Speed boost. Flip Turn lets Carvanha pivot out against Pokemon it can't OHKO like Mienfoo, Pawniard, and Porygon while still wearing its foes down. Crunch hits a majority of the metagame for at least neutral damage. Psychic Fangs is important coverage against Mienfoo and Poison-types like Foongus and Koffing, allowing Carvanha to OHKO them after Knock Off or prior chip damage. Protect guarantees a Speed Boost activation and blocks Fake Out and First Impression from Pokemon like Mienfoo and Trapinch. 9 HP IVs give Carvanha 1 HP recoil from Life Orb and 36 Special Defense EVs make Porygon's Download boost its Attack rather than its Special Attack.</p> <p>Carvanha's frailty means that it benefits greatly from teammates that switch into its checks well. Koffing is a fantastic partner, as it switches very well into Mienfoo's and Grookey's attacks, and its Neutralizing Gas negates Mienfoo's Regenerator, helping Carvanha wear it down. Larvesta is also a great switch-in to both, punishing them with Flame Body, and can pivot Carvanha in safely with a slow U-turn. It also helps against Ferroseed and Pawniard. Trapinch traps and revenge kills non-Protect Grookey with First Impression, and it can take out Pawniard or a weakened Ferroseed with Superpower. Natu checks Ferroseed, Foongus, and Mareanie, forcing them out and pivoting Carvanha in safely. Knock Off support from Mienfoo, Ferroseed, and Pawniard can remove Eviolite from Mienfoo and Poison-types to let Carvanha OHKO those threats. Entry hazard support from Dwebble and Ferroseed wears down Pokemon that can usually take a hit from Carvanha, like Mienfoo, Foongus, and Ferroseed, with the latter also checking Porygon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 524894, "username": "avg"}]}
  },
  "Trapinch": {
    "overview": "<p>Trapinch's rather good bulk and access to Arena Trap allow it to switch into, trap, and KO specific Pokemon. Notably, Trapinch is guaranteed to remove Onix and has great odds to remove Pawniard thanks to its ability to switch into these Pokemon, something Diglett cannot do. However, due to its slow Speed, Trapinch fears Scald burns and Iron Head flinches far more than Diglett does. First Impression gives Trapinch some extra utility against many faster Pokemon, though many of the move's targets often run Protect for this specific reason. Trapinch will often be at low HP after it has trapped its target, and due to its low Speed, it will likely only attack again with a priority move.</p> ",
    "comments": "<h1>Other Options</h1> <p>There are no viable other options for Trapinch.</p> <h1>Checks and Counters</h1> <p>It should be noted that Trapinch cannot be countered directly, as its ability Arena Trap prevents switching out if the Pokemon is grounded. With the ability to pick its matchups, Trapinch often needs to be dealt with after it has picked up a KO. Fortunately, Trapinch will frequently take significant damage in the process, which can leave it vulnerable to almost any strong attacker in the tier.</p> <p><strong>Water-types</strong>: Staryu and Wingull can punish Trapinch with relatively few downsides. Both are rather difficult to switch into outside of specific counters, which often forces Trapinch to stay in and be KOed. Mareanie is threatened by a healthy Trapinch, but it can often burn Trapinch with Scald, allowing it to stall out Earthquake with Recover.</p> <p><strong>Grass-types: With the exception of Ferroseed, Grass-types fear little from Trapinch after its first turn. Grookey and Foongus are solid examples of capable revenge killers, though Grookey does need to be mindful of First Impression.</p> <p><strong>Porygon: Porygon is incredibly bulky and can Trace Arena Trap, locking Trapinch on the field. If Porygon is unable to KO Trapinch immediately, it can stall out Superpower with Recover. Alternatively, Download Porygon can often KO Trapinch reliably and make use of this relatively free turn.</p> ",
    "sets": [
      {
        "name": "Trapper",
        "description": "<h1>Moves</h1> <p>Earthquake is mandatory in order for Trapinch to threaten the likes of Ponyta and Pawniard. Superpower allows Trapinch to greatly damage Ferroseed and OHKO Pawniard. First Impression offers some marginal utility to Trapinch once its primary targets have been KOed; it is potentially useful against a foe like Galarian Ponyta or Grookey. Feint is useful for picking off a low health Pokemon; it can be particularly useful against Abra, which will often use Protect to avoid First Impression.</p> <h1>Set Details</h1> <p>The Speed EVs let Trapinch hit 8 Speed to outspeed Ferroseed. The remaining EVs are tailored to trap and remove Pawniard as efficiently as possible. A Careful nature is desirable to give Trapinch a better chance to survive attacks from Porygon and Abra.</p> <h1>Usage Tips</h1> <p>It is most important to prioritize Trapinch's targets in any given game, and such targets will vary depending on your team's structure regardless of team archetype, with the biggest priorities tending to be Onix and Diglett. Trapinch is a support Pokemon and thus will seek to trap the counters of its teammates. Typically, Trapinch is able to switch directly into what it is meant to remove and can use the appropriate move without issue. In some cases, preserving Trapinch to nail a revenge killer like Abra or Grookey with First Impression later in the game can be particularly useful.</p> <h1>Team Options</h1> <p>Ponyta love Trapinch's ability to switch into and remove two of its best checks in Pawniard and Onix, and Ponyta also appreciates Trapinch counter trapping Diglett. Ferroseed also shares good type synergy with Trapinch, as it acts as a solid answer to Staryu and Grass-types, which prove to be troublesome for teams built around Trapinch. Offensive Porygon appreciates the removal of Steel-types and is a useful teammate due to its good bulk.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 175616, "username": "Empress"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 208173, "username": "Fiend"}]}
  },
  "Munchlax": {"sets": [{"name": "CurseLax"}]},
  "Croagunk": {
    "sets": [{"name": "Nasty Plot", "description": "<p>Croagunk finds a niche in LC as a specially-attacking Fighting-type with useful resistances to Grookey and opposing Fighting-types like Mienfoo and Timburr. However, its middling bulk and lack of recovery make Croagunk susceptible to getting chipped and render it unable to check these Pokemon multiple times, especially if it gets hit by Knock Off. Croagunk is also vulnerable to trappers such as Diglett and Trapinch. Dry Skin allows Croagunk to switch in safely on threats such as Mareanie and non-Psychic Staryu and use them as setup fodder with Nasty Plot. Vacuum Wave gives Croagunk a way to finish off weakened foes while also allowing it to avoid risking the powerful but inaccurate Focus Blast. The best partners for Croagunk include Pawniard and Ferroseed, which help deal with Psychic-types, and countertrappers such as Air Balloon Diglett and Trace Porygon.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 536936, "username": "Afdvsc"}]}
  },
  "Snover": {"sets": [{"name": "Hail Setter"}]},
  "Timburr": {
    "overview": "<p>Timburr's strong offensive typing, high Attack stat, and decent bulk make it a terrific glue Pokemon on a variety of team styles. It has an excellent movepool, including a strong STAB priority move in Mach Punch, semi-reliable recovery with Drain Punch, and a variety of coverage options including Knock Off, Ice Punch, and Thunder Punch. Furthermore, Defog makes Timburr one of the best entry hazard removers in the tier, especially since it resists Stealth Rock and can check common hazard setters such as Ferroseed and Onix. Timburr has two excellent abilities, allowing it to perform different roles on a team. Iron Fist increases immediate wallbreaking potential, while Guts allows Timburr to act as a status absorber. However, it is commonly walled by Poison-types, as Timburr cannot carry all the necessary coverage. It is also limited by a mediocre Speed stat and has to run significant investment to attempt to outspeed its checks at the cost of offensive power or bulk.</p> ",
    "comments": "<h1>Other Options</h1> <p>There are no viable other options for Timburr.</p> <h1>Checks and Counters</h1> <p><strong>Poison-types</strong>: Koffing, Mareanie, and Foongus are all able to switch into Timburr. Koffing completely walls Timburr regardless of coverage, while Mareanie and Foongus wall Timburr depending on its coverage options.</p> <p><strong>Psychic-types: Psychic-types such as Galarian Ponyta and Natu are particularly threatening because they can switch into Timburr and threaten to KO it with their STAB attacks. However, they should be wary of switching into Knock Off. Abra, as well as strong Psychic-type coverage from foes like Porygon and Staryu, can also demolish Timburr.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<h1>Moves</h1> <p>Drain Punch's recovery is important for keeping Timburr healthy and allowing it to face foes such as Onix and Ferroseed one-on-one. Mach Punch revenge kills faster threats. Knock Off allows Timburr to weaken all foes by removing their items while also hitting Psychic-types like Natu and Galarian Ponyta. Defog is used to remove all entry hazards on the field, helping teammates to switch in more easily. Thunder Punch hits Mareanie, Natu, and Frillish. Ice Punch can be run to hit Foongus and Natu super effectively.</p> <h1>Set Details</h1> <p>The EV spread gives Timburr the ability to better perform in a on-on-one scenario against foes like Mienfoo. It is worth noting that Timburr's Speed is also somewhat customizable. Running 156 Speed EVs allow Timburr to outspeed standard Mareanie. Iron Fist is typically used on this set to improve the damage output of Drain Punch, Mach Punch, and coverage punches. Guts is an alternative option that allows Timburr to fare better against potential status from Ponyta, Ferroseed, and other status users.</p> <h1>Usage Tips</h1> <p>Timburr is an excellent switch-in to Ferroseed, Onix, and Pawniard and can generate offensive momentum by forcing them to switch out. It is good to keep the opponent guessing Timburr's moveset, since a Knock Off into a suitable coverage move can help make huge progress in a game. Early-game, Timburr should attempt to punish expected switches by using Knock Off. This can soften the opponent's team up for teammates to take advantage of late-game. Alternatively, it should use Defog on expected switches to remove entry hazards. If the team is weak to setup sweepers, Timburr should be preserved to prevent a late-game sweep and should avoid having its item removed by Knock Off. If Guts is being used, Timburr can switch into expected Will-O-Wisp from Ponyta or Frillish to gain an Attack boost.</p> <h1>Team Options</h1> <p>Natu appreciates Timburr's ability to remove Stealth Rock and switch into Steel- and Rock-types such as Pawniard and Onix. Other Fighting-types, particularly Mienfoo, can work with Timburr to break through their shared checks. Pawniard helps Timburr against Psychic-types like Natu, Abra, and Galarian Ponyta. These Psychic-types also make great partners, pressuring Poison-types like Koffing, Foongus, and Mareanie.</p> "
      },
      {
        "name": "Bulk Up",
        "description": "<h1>Moves</h1> <p>Bulk Up turns Timburr into a powerful sweeper that many teams will struggle to deal with. Drain Punch is the primary attack for this set, recovering health and boosting longevity. Mach Punch provides revenge killing utility, regardless of whether Timburr is boosted or not. Knock Off allows Timburr to weaken all foes by removing their items while also hitting Psychic-types super effectively. It also hits Poison-types like Mareanie and Koffing neutrally, making them more susceptible to Drain Punch. Thunder Punch can be used to hit Mareanie and Natu very hard. Ice Punch is a potential option if Foongus is an issue.</p> <h1>Set Details</h1> <p>236 Special Defense EVs with a Careful nature and Eviolite prevent Timburr from being easily worn down by special attackers. Guts is the preferred ability, since the boost from burns allows Timburr to take Mareanie one-on-one. The EV spread can be customized to help Timburr set up on different foes. For example, it can forgo Special Defense investment in favor of Attack or Speed investment if the team otherwise handles special attackers very well.</p> <h1>Usage Tips</h1> <p>This set is best used as a late-game sweeper when its checks have been sufficiently weakened. Try to weaken and pressure Timburr's checks, primarily Mareanie, Koffing, and Natu, by removing their items and keeping them at low health. Timburr can use Knock Off early-game to make a late-game sweep easier. It can also still act as a check to Rock- and Steel-types, primarily Onix and Pawniard. However, it should be used sparingly against them so that it can retain its item and stay close to full health to help a late-game sweep. It is worth noting that Timburr can use them as setup opportunities. It is best to use Bulk Up on expected switches and foes that struggle to deal significant damage to Timburr, such as Ferroseed. The uncommonness of the Bulk Up set means that Timburr can bluff a standard bulky attacker set and catch the opponent off guard by setting up later in the game.</p> <h1>Team Options</h1> <p>Pawniard pressures Psychic-types and weakens Poison-types with Knock Off. Porygon and Psychic-types like Abra and Galarian Ponyta appreciate Timburr pressuring Steel-types. In return, they are able to force out Poison-types like Koffing, Mareanie, and Foongus.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Cottonee": {
    "sets": [{"name": "Memento", "description": "<p>Cottonee has good support moves and Prankster, which allows it to provide opportunities for setup sweepers on hyper offense teams with Memento. Cottonee's typing lets it check some of the biggest issues for hyper offense teams in Mienfoo and Grookey. It also enables Zigzagoon by luring and crippling Ferroseed and Pawniard with Knock Off. Encore and Defog give Cottonee a bit more flexibility by allowing it to provide additional setup opportunities for teammates and help teammates such as Magby switch in safely. Cottonee pairs well with Memento Diglett as a secondary Memento user; together, they can provide setup opportunities for multiple setup sweepers. The best teammate for Cottonee is Zigzagoon, which is almost always the setup sweeper it facilitates, but it can also be used for other sweepers like Magby and Tyrunt.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 536936, "username": "afdvsc"}]}
  },
  "Dwebble": {
    "overview": "<p>With access to Stealth Rock and Spikes, along with the ability to beat the tier's most common Defogger, Dwebble is one of the leading entry hazard stackers in the tier. Shell Smash coupled with a decent Attack stat also allows it to become a dangerous sweeper; these two sets require significantly different counterplay, which can trip an unprepared opponent up. Sturdy gives Dwebble opportunities to set entry hazards or use Shell Smash. However, its mediocre defensive typing gives it very few resistances, and its reliance on its item leaves it susceptible to Knock Off. Additionally, it faces competition from Ferroseed, which can also set the same entry hazards while offering more defensive utility, although it lacks the offensive presence that Dwebble's Shell Smash set provides. It also faces competition from Onix, which is faster and has a better offensive typing. Onix can run Sturdy sets too, though it tends not to, leaving Dwebble as the tier's best Sturdy user.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Weak Armor set can be run with a spread of 36 HP / 156 Atk / 76 Def / 236 Spe alongside a Jolly nature and Eviolite. This functions similarly to the suicide lead set, but it finds it easier to set hazards against Knock Off users while being able to check Vullaby. Dwebble can choose to run a Bug-type STAB move; this offers no meaningful coverage, however. The Shell Smash set can run Aerial Ace to hit Timburr and Mienfoo, but this still doesn't KO them at +2 and generally isn’t worthwhile.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: While Timburr and Mienfoo don't like getting hit by Knock Off, they can counter all Dwebble sets - Eviolite sets survive any move from Dwebble even at +2. Timburr is particularly threatening, as it can heal back up with Drain Punch, remove entry hazards with Defog, and KO Dwebble with priority Mach Punch. Mienfoo can break its Sturdy with Fake Out and then KO Dwebble with High Jump Kick.</p> <p><strong>Water-types</strong>: Staryu is able to remove Dwebble's entry hazards with Rapid Spin, gaining a Speed boost while doing so, while taking any hit from the Shell Smash set and OHKO it in return. Corphish has access to Knock Off and Aqua Jet, allowing it to easily beat Dwebble one-on-one.</p> <p><strong>Multi-hit moves: Multi-hit moves hinder all Dwebble sets, as they can break through Sturdy and potentially OHKO it. Onix with Rock Blast is particularly threatening, as it outspeeds Dwebble and hits it super effectively.</p> <p><strong>Ground-types: Ground-types are threatening, since Dwebble lacks the coverage to hit them super effectively. Mudbray is particularly threatening because it gains Defense boosts from each hit.</p> <p><strong>Ferroseed: Ferroseed can take any hit from the Shell Smash set, even at +2, and use Knock Off and Thunder Wave to hinder both Dwebble sets.</p> <p><strong>Grookey</strong>: While it is unable to switch directly into Dwebble, Grookey can revenge kill Dwebble with Grassy Glide.</p> ",
    "sets": [
      {
        "name": "Suicide Lead",
        "description": "<h1>Moves</h1> <p>Stealth Rock damages and wears down every Pokemon in the metagame. Spikes is useful to damage all grounded foes. Knock Off allows Dwebble to remove the foe's item to help its teammates. Counter can be used to OHKO a physical foe such as Timburr if it chooses to attack. Rock Blast is a terrifying multi-hit STAB attack, threatening to OHKO foes like Berry Juice Vullaby and frail threats like Abra and Dewpider that have a Focus Sash. Alternatively, Earthquake can be used to deal more damage to Rock-resistant foes.</p> <h1>Set Details</h1> <p>Maximum EVs and a Speed-boosting nature are used to get out as many entry hazards as possible before being KOed. Maximum Attack is used because Dwebble relies on Sturdy and Berry Juice for longevity, meaning it has no need for defensive investment. There are enough remaining EVs to increase its HP stat, but this is avoided so that Berry Juice is guaranteed to fully restore its health and reactivate Sturdy. Sturdy guarantees that Dwebble can take a hit from full HP, giving it an extra turn to set entry hazards. Another option is to run a Hasty nature with 0 Defense IVs, which allows Dwebble to OHKO Timburr and offensive Mienfoo with Counter if they use Knock Off.</p> <h1>Usage Tips</h1> <p>As the name of this set indicates, Dwebble is used as a lead. The main objective of this set is to put up multiple entry hazards before being KOed. However, preserving Dwebble can be advantageous in some situations where it can be sacrificed later in the game to provide offensive momentum. Typically, Dwebble will rarely be using its offensive moves, since the utility of stacking entry hazards is preferable to the utility of Knock Off or other offensive moves.</p> <h1>Team Options</h1> <p>Offensive teams benefit most from Dwebble, as they can pressure the opponent and make it difficult for them to find an opportunity to remove entry hazards. Setup sweepers like Dragon Dance Scraggy and Nasty Plot Vullaby appreciate entry hazards breaking Sturdy on their foes and wearing down their checks. Pawniard can punish Defog with Defiant and therefore makes for a good partner. Frillish is immune to Rapid Spin and is able to switch in against the most prominent user of the move, Staryu, making it a good pick on entry hazard-stacking teams. Having a Rapid Spin user on the team is useful for removing entry hazards from your side of the field. Offensive threats such as Grookey, Abra, and Choice Scarf Mienfoo appreciate hazard support, as it helps to put their checks in range of an OHKO.</p> "
      },
      {
        "name": "Shell Smash Sweeper",
        "description": "<h1>Moves</h1> <p>Shell Smash raises Dwebble's Attack and Speed by 2 stages, drastically increasing its power and allowing it to outspeed the entire unboosted metagame. Rock Blast is generally the preferred STAB move, as it is the most accurate Rock-type move with good power and will often hit at least as hard as Rock Slide due to Little Cup's low HP totals. It also breaks through Focus Sash and Sturdy users. Alternatively, Stone Edge can be chosen for more consistent damage, if it hits, and to bypass Berry Juice on foes like Weak Armor Vullaby. Earthquake is Dwebble's best coverage move, hitting the Rock-resistant Pawniard and Onix super effectively, and it gets a neutral hit against other foes like Timburr and Mudbray. Knock Off provides good neutral coverage, with the utility of removing the foe's Eviolite and weakening them. Counter and Stealth Rock are niche alternative moves.</p> <h1>Set Details</h1> <p>Maximum Attack EVs and an Attack-boosting nature are used to optimize Dwebble's sweeping power. Maximum Speed EVs allow Dwebble to outspeed the entire metagame after a Shell Smash boost, only tying with the rare Choice Scarf Diglett. There is no HP investment to ensure that Berry Juice reactivates Sturdy. Sturdy guarantees that Dwebbles survives one hit when at full health, allowing it to take a hit while setting up. Berry Juice restores its HP to full, which reduces Dwebble’s susceptibility to being picked off by weak priority moves.</p> <h1>Usage Tips</h1> <p>Try to avoid switching Dwebble into entry hazards at all costs, since this will stop Sturdy from activating and will prevent a safe setup with Shell Smash. Avoid being hit by Knock Off as well, since Dwebble's item is important to give it setup opportunities. Dwebble should be used as a late-game sweeper, setting up when its checks are sufficiently weakened. Try to bring Dwebble in on a free switch, such as after a Pokemon has fainted or via a slow U-turn, so it doesn't lose its Berry Juice early by switching into an attack. Weaken or remove bulky Pokemon like Mudbray, Spritzee, and Timburr before attempting to sweep with Dwebble, because they can take even a boosted hit and retaliate for lots of damage. Try to remove priority move users, as they can easily pick off Dwebble after its defenses are lowered by Shell Smash. With Sturdy intact, Dwebble can also act as a countermeasure for opposing sweepers that don't have multi-hit moves.</p> <h1>Team Options</h1> <p>Entry hazards from Pokemon like Ferroseed and Pawniard wear down opposing Pokemon, allowing Dwebble to KO more foes. A teammate that provides entry hazard removal such as Staryu, Defog Timburr, or Vullaby, is essential for helping to preserve Dwebble's Sturdy. Pokemon that can bring Dwebble in safely like U-turn Mienfoo and Vullaby are good partners. Pokemon like Giga Drain Ferroseed and Staryu that deal with bulky Ground-types are helpful. Mareanie and Spritzee are good team choices as well because they can deal with Timburr. Trappers such as Diglett and Wynaut help Dwebble by removing or weakening its defensive checks. Knock Off support from Pokemon like Timburr and Mareanie is appreciated, since very few Pokemon will be able to take Dwebble's boosted moves without an Eviolite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 195129, "username": "Nineage"}, {"user_id": 150971, "username": "Coconut"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 315003, "username": "Kipkluif"}, {"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Tirtouga": {"sets": [{"name": "Defensive"}, {"name": "Shell Smash"}]},
  "Archen": {
    "overview": "<p>Archen is a classic glass cannon with its huge Attack stat and high-powered STAB moves. With a solid Speed tier and dangerous STAB combination that threatens common Pokemon like Mienfoo and Foongus, Archen can provide strong offensive pressure and capitalize on its ability to force switches. It also has a wide range of coverage moves to beat its checks and utility options like Stealth Rock, Defog, Knock Off, and U-turn to support its team. However, Archen is frail, has a crippling ability that forces it to always remain above 50% HP to deal consistent damage, and has a mediocre typing. Its Speed tier also makes Archen vulnerable to faster threats like Staryu and Abra as well as Choice Scarf users like Porygon and Mienfoo. All these traits make Archen difficult to use and fit on many teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>U-turn lets Archen pivot against checks like Mudbray and bring in a teammate. Archen can function as either a Stealth Rock setter or entry hazard remover, but it is threatened by the prevalent Staryu, which makes it unable to set Stealth Rock effectively, and forced out by common Stealth Rock setters like Mudbray and Pawniard. Knock Off provides helpful utility, allowing Archen to cripple its checks or assist in breaking down opposing Pokemon for its teammates. Substitute blocks status, helps activate Berry Juice, and provides a free opportunity for Archen to attack. Choice Scarf turns Archen into a revenge killer and late-game cleaner, but it limits Archen's opportunities to switch in.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Rock-, Steel-, and Ground-types: Pokemon such as Onix, Pawniard, and Mudbray can switch into Archen's STAB moves and KO it, but they must be wary of its coverage options.</p> <p><strong>Priority Users: Priority users such as Grookey, Timburr, and Pawniard can limit Archen's effectiveness by putting it into Defeatist range. Grookey in particular threatens to OHKO Archen with Grassy Glide.</p> <p><strong>Faster Offensive Threats: Naturally faster Pokemon such as Abra, Staryu, and Diglett, as well as Choice Scarf users like Mienfoo and Porygon, outspeed and threaten Archen.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Moves</h1> <p>Acrobatics synergizes with Berry Juice and threatens Grass- and Fighting-types like Foongus, Mienfoo, and Timburr. Dual Wingbeat is a more consistent option that breaks Focus Sash from Abra and does more damage before Berry Juice is consumed. Head Smash is Archen's most powerful STAB attack but inflicts recoil; this recoil damage can be useful for activating Berry Juice, but it may also put Archen into Defeatist range. Rock Blast breaks Focus Sash from Abra and Sturdy from Dwebble while also not having recoil. Earthquake deals solid damage to checks like Pawniard and Onix. Heat Wave allows Archen to beat Ferroseed while maintaining coverage for Pawniard and Magnemite. Aqua Tail can be used to lure and surprise Ground- and Rock-type switch-ins, OHKOing non-Sturdy Onix and punishing Mudbray. Roost synergizes with Eviolite and provides helpful recovery to avoid dropping into Defeatist range.</p> <h1>Set Details</h1> <p>Defeatist is Archen's only ability and forces it to remain above 50% HP in order to deal consistent damage. Berry Juice provides recovery and helps Archen stay out of Defeatist range while also synergizing with Acrobatics. Eviolite is an option on Dual Wingbeat sets for extra bulk. A Naive nature can be used over a Jolly nature to boost the power of Heat Wave.</p> <h1>Usage Tips</h1> <p>Archen is ideally brought onto the field safely by a slow pivot, double switch, or after a teammate has fainted to wreak havoc against metagame staples like Timburr and Foongus. It is difficult for teams to check Archen that has not been scouted, as using the correct coverage move can result in the loss of a check, so make sure to utilize the amount of switches it forces. Stealth Rock should be removed before Archen switches in to prevent being put into Defeatist range. Archen has to try to play around priority as well as faster threats that can inflict heavy damage like Staryu, Abra, and Choice Scarf Mienfoo, so it is important to try to scout as best as possible before bringing it in against these Pokemon.</p> <h1>Team Options</h1> <p>Entry hazard removal from Staryu and Defog Timburr is crucial to keeping Archen healthy. Entry hazard setters like Pawniard and Ferroseed put foes into KO range, with Pawniard also helping check threats like Abra and Galarian Ponyta and Ferroseed checking Staryu. Knock Off support from Mienfoo, Timburr, and Pawniard weaken bulky foes like Mudbray and Ferroseed; they also help absorb Knock Off. Pivots such as Mienfoo, Magnemite, and U-turn Grookey help bring Archen in safely. Trappers like Diglett and Trapinch can eliminate Stealth Rock setters and opposing Rock- and Ground-types. Koffing and Foongus are helpful teammates for Archen, as they are able to switch into strong Fighting-type attacks and function as a check to Grookey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 410251, "username": "zizalith"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 519108, "username": "zeroouttathere"}, {"user_id": 449990, "username": "DC"}]}
  },
  "Foongus": {
    "comments": "<h1>Other Options</h1> <p>Foongus can run more Speed EVs to outspeed foes like Timburr and Mareanie while helping in the Foongus mirror. 124 HP EVs make it easier to deal with threats like Mudbray. Foongus's movepool isn't good, and it is usually limited to the four listed moves. Stun Spore and Clear Smog can be used as alternative move options, but they are extremely situational; Stun Spore cripples multiple foes, and Clear Smog prevents setup sweepers like Galarian Ponyta from setting up on Foongus.</p> <h1>Checks and Counters</h1> <p><strong>Ferroseed: Ferroseed is probably the most effective check against Foongus, as it resists Giga Drain and is immune to Sludge Bomb and Spore. It can easily switch into Foongus and start setting its entry hazards or remove Foongus's Eviolite with Knock Off. Ferroseed paired with Mienfoo can be very difficult for Foongus to make progress against.</p> <p><strong>Other Steel-types: Steel-types like Magnemite and Pawniard resist both of Foongus's listed attacks, and Pawniard also threatens it with Knock Off. However, none of them appreciate Spore.</p> <p><strong>Natu: Natu is a troublesome check to Foongus, as it is immune to Spore due to Magic Bounce and can hit Foongus with super effective moves. Cosmic Power and Calm Mind Natu can also set up on Foongus. However, Natu can be worn down by Sludge Bomb, and it doesn't appreciate getting poisoned by it.</p> <p><strong>Koffing</strong>: Koffing resists both Foongus's STAB moves, does a lot of damage in return, and wears down Foongus with Neutralizing Gas.</p> <p><strong>Psychic-types</strong>: Psychic-types such as Abra, Galarian Ponyta, and Psychic coverage from Staryu threaten Foongus, but they dislike Spore.</p> <p><strong>Fire-types: Fire-types such as Ponyta, Vulpix, and Charmander threaten Foongus offensively but have a difficult time switching into Spore and Sludge Bomb.</p> ",
    "sets": [
      {
        "name": "Tank",
        "description": "<p>Foongus is one of the best walls in LC, being able to take on dangerous threats like Mienfoo, Diglett, and Grookey with its combination of decent bulk, amazing typing, and Spore. Spore cripples a non-Grass-type foe, preventing setup sweepers like Tyrunt from performing their role, and it gives Foongus's teammates a chance to switch in safely. Giga Drain and Synthesis provide recovery and both increase Foongus's longevity. Regenerator lets it pivot into opposing threats like Mienfoo and Mareanie repeatedly. The given EV spread denies Porygon from getting a Special Attack boost from Download.</p> <p>Foongus forms a great defensive core with bulky Water-types such as Frillish and Staryu, as it checks physical threats like Grookey for them; in return, they check Fire-types like Ponyta and Vulpix. Frillish also checks the troublesome Natu. Mienfoo forms a great Regenerator core with Foongus, and it can eliminate annoying Steel-types like Pawniard and Ferroseed. Fire-types like Ponyta are also a solid choice for dealing with Steel-types. Natu and Trapinch are both reliable partners to deal with the troublesome Ferroseed; Natu punishes its entry hazards and status moves with Magic Bounce, while Trapinch can trap and eliminate it. Foongus struggles against Psychic-types like Abra, so Pawniard makes a great teammate for it. Pawniard in return benefits from Foongus's ability to deal with Fighting-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}]}
  },
  "Frillish": {
    "sets": [
      {
        "name": "Special Tank",
        "description": "<p>Frillish is a tank that can shrug off powerful special hits and take physical hits decently well. Frillish's typing makes it a deterrent for Porygon and Mienfoo, preventing them from spamming Tri Attack and Ice Beam or High Jump Kick. Its Fire resistance causes issues for sun teams as well. Scald's chance to inflict burn makes even physical attackers with good matchups such as Pawniard and Ferroseed hesitant to switch in. Even on other Pokemon, burns are helpful to empower Hex. Will-O-Wisp is a more consistent way to spread burns. Cursed Body, together with this mixed EV spread, lets it sometimes win one-on-one against lesser offensive threats like Foongus by disabling their super effective moves.</p> <p>Pokemon that appreciate Frillish's presence include Grookey and Steel-types such as Pawniard and Ferroseed since they are weak to Fire-types, which Frillish can switch into repeatedly. Fighting-types such as Mienfoo and Timburr appreciate Frillish's ability to deal with Psychic-types like Abra and Natu. They return the favor by dealing with Steel-types that cause Frillish trouble. Fire-types like Ponyta and Poison-types like Koffing and Foongus are the best ways to deal with Grookey and Ferroseed, which force Frillish out.</p> <h1>Other Options</h1> <p>Shadow Ball is an option for instant pressure over Hex. A Choice Scarf set with Water Spout is an option, but the presence of Grassy Glide Grookey and better Choice Scarf users such as Porygon make it inconsistent. Trick is an option on Choice Scarf sets to deal with defensive checks such as Ferroseed.</p> <h1>Checks and Counters</h1> <p><strong>Ferroseed: Ferroseed is an effective Frillish check, thanks to its Water resistance and general bulk. It also threatens Frillish with Knock Off and Giga Drain, taking turns spent on Recover to set entry hazards. However, it has to be careful of being burned by Scald or Will-O-Wisp, which strengthens Hex.</p> <p><strong>Grookey</strong>: Grookey is the best offensive check to Frillish. However, its frailty and fear of burns mean it cannot switch in easily.</p> <p><strong>Pawniard</strong>: Pawniard is one of the biggest threats to Frillish with Knock Off. Although it must be generally wary of Will-O-Wisp and Scald, it can still cause issues for Frillish when burned.</p> <p><strong>Super Effective Coverage</strong>: Frillish needs to be careful even against threats it is supposed to check. Ponyta and Psychic-types like Galarian Ponyta, Abra, and Natu can have Wild Charge or Shadow Ball. It should also be cautious of Knock Off from other Pokemon it checks, such as Mareanie. Pokemon like Koffing, Staryu, and Porygon also pose a threat with Thunderbolt.</p> <p><strong>Magnemite: Magnemite threatens Frillish with its super effective Electric-type attacks and can preserve momentum with Volt Switch.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 536936, "username": "Afdvsc"}]}
  },
  "Ferroseed": {
    "comments": "<h1>Other Options</h1> <p>Ferroseed can use an alternative EV spread that drops bulk to reach 9 Speed. 9 Speed beats paralyzed 17 Speed Pokemon, which is especially useful against Mienfoo. Revenge is an option to beat Salac Berry Magnet Pull Magnemite; it 2HKOes, overcoming Rest. Revenge Ferroseed also beats Pawniard, LC's only other Stealth Rock setter. Explosion Ferroseed can be used on teams that need a last resort option to KO threats like paralyzed Mienfoo and Natu. Bullet Seed helps Ferroseed beat Magnet Pull Magnemite, and it can do more damage to neutral targets like Natu after Roost, but it leaves Ferroseed without Giga Drain's recovery.</p> <h1>Checks and Counters</h1> <p><strong>Natu: Natu can switch into Ferroseed's status moves with Magic Bounce and threaten massive damage with Heat Wave. Ferroseed users must be careful of allowing Natu to impede progress; however, it doesn't appreciate Knock Off.</p> <p><strong>Fire- and Fighting-types</strong>: Mienfoo, a tier staple, can heavily damage Ferroseed with High Jump Kick, and Fire-type hits from Ponyta and Vulpix cleanly OHKO Ferroseed. These Pokemon do not appreciate being paralyzed by Thunder Wave or getting their items removed by Knock Off, however.</p> <p><strong>Coverage: Galarian Ponyta, Abra, and Koffing can run Mystical Fire, Fire Punch, or Fire Blast to heavily damage Ferroseed and prevent it from checking them over the course of a game. Mareanie's Knock Off compromises Ferroseed's walling ability.</p> ",
    "sets": [
      {
        "name": "Defensive Support",
        "description": "<p>Ferroseed is one of the LC metagame's best walls, being able to sponge neutral hits from strong threats like Staryu, Abra, and Porygon and then spread Thunder Wave. Ferroseed checks two of LC's three prominent Poison-types, Foongus and Mareanie, with resistance or immunity to their STAB attacks and Foongus's Spore. Ferroseed's Knock Off takes advantage of forcing out the Pokemon it checks, supporting teammates by removing Eviolite from common checks like Natu and Mienfoo. Ferroseed is one of the few viable Stealth Rock setters and can also be used to set Spikes.</p> <p>Ferroseed creates an effective defensive core with Poison-types like Koffing and Mareanie, checking the strong special attackers that threaten them while also benefitting from them checking strong Fighting-type attackers, like Mienfoo. Frillish and the aforementioned Mareanie also help Ferroseed by checking Fire-types like Ponyta and Vulpix. Frillish and Natu help deal with opposing Natu, which has Magic Bounce and Heat Wave to very effectively deal with Ferroseed. Ferroseed can struggle to check Fire Punch Abra and Trick Porygon, and Mareanie's Knock Off can also weaken it. Partners like Diglett and Porygon can help check or remove them. Magnet Pull Magnemite traps and sets up on Ferroseed; Ground-type teammates like Diglett, Trapinch, and Mudbray can deter these sweeps.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 416460, "username": "yellowfin"}]}
  },
  "Mienfoo": {
    "comments": "<h1>Other Options</h1> <p>Choice Band sets dole out absurd amounts of damage, as Reckless High Jump Kick 2HKOes Foongus and Mareanie without Eviolite. Acrobatics is an option to threaten Foongus and opposing Mienfoo after losing Eviolite. Swords Dance boosts Mienfoo's power to extreme heights, but Mienfoo lacks the Speed to sweep.</p> <h1>Checks and Counters</h1> <p><strong>Koffing: Koffing takes little damage from any of Mienfoo's attacks, threatens with Will-O-Wisp, and can wear it down over the course of the match, as Neutralizing Gas blocks Regenerator. Koffing can be whittled down by repeated hits and its lack of reliable healing, though.</p> <p><strong>Mareanie</strong>: Mareanie resists High Jump Kick and U-turn, can switch in repeatedly with Regenerator, and can make progress with Knock Off and Scald burns. It must be wary of U-turn bringing in Diglett or special attackers like Abra and Porygon.</p> <p><strong>Foongus: Foongus resists High Jump Kick, stays healthy with Regenerator, and punishes Mienfoo's team with Spore. However, Foongus can struggle mightily to make progress when Mienfoo is paired with Ferroseed or, to a lesser extent, Natu.</p> <p><strong>Flame Body: Flame Body users like Larvesta and Eviolite Ponyta can burn Mienfoo for using moves recklessly. However, both are threatened by U-turn bringing in Diglett.</p> <p><strong>Psychic-type Pokemon and Coverage: While Abra, Galarian Ponyta, and Choice Scarf Porygon cannot switch into Mienfoo, they outspeed and OHKO it. Natu fears Knock Off but can force uncomfortable turns with STAB Psychic. Staryu sometimes carries Psychic as well, and it can severely threaten Mienfoo that lack Eviolite.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<p>Mienfoo is an extremely versatile and durable Pokemon that can serve as a lead, defensive pivot, and offensive wallbreaker over the course of a game. U-turn lets Mienfoo take advantage of the switches it forces while maintaining offensive momentum and healing itself with Regenerator. Knock Off softens up switch-ins like Mareanie and Koffing and hits Natu and Frillish hard. Fake Out is valuable for wearing down Choice Scarf users and sweepers while also providing free chip damage against most foes. Taunt is an alternative that blocks Poison-type checks from recovering while also shutting down defensive sweepers like Shellos and status moves from Foongus and Koffing. While the given EV spread is reliable for its physical bulk and its guarantee of a Speed tie with opposing Mienfoo and Natu, Mienfoo's versatility allows a wide variety of investments. These include a spread with 236 Attack EVs instead of Defense for wallbreaking power and running no Speed investment to use U-turn after other Mienfoo.</p> <p>Mienfoo fits well on virtually every team, but it pairs especially well with Diglett, which benefits from U-turn to trap checks like Mareanie, and Koffing, which can wear down Regenerator users with Neutralizing Gas. Mienfoo is an invaluable partner for Pokemon that are forced out by Pawniard like Abra, Porygon, and Natu. Abra and Natu also punish Mienfoo's Poison-type checks like Foongus and Koffing after U-turn.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Mienfoo is a major threat that outspeeds most of the tier while dealing severe damage and offering sweeping potential. Reckless High Jump Kick will OHKO or 2HKO any neutral target. U-turn lets Mienfoo scout the opposing team and allows teammates to punish the Poison-types it forces in. Knock Off wears down those Poison-types to set up for a later sweep, and it also hits Galarian Ponyta, Natu, and Frillish hard. Close Combat should be used when the additional power of High Jump Kick is not needed and the stat drops are not a concern.</p> <p>Choice Scarf Mienfoo pairs well with Timburr, which can perform the duties of a bulky Fighting-type while both Pokemon overwhelm the opposing Poison-type. Diglett is a valuable partner for its ability to trap Poison-types. Beyond the usual checks, this set is vulnerable to Natu and Frillish, as they punish its STAB moves and thus make it extremely difficult for Mienfoo to operate offensively. Pawniard is a valuable partner, as it checks both. Knock Off Grookey and Shadow Ball Abra can also pressure them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Pawniard": {
    "comments": "<h1>Other Options</h1> <p>Pawniard can run a set with Eviolite and more Speed investment, but it is less effective at handling the special attackers Pawniard checks. Choice Scarf is an option to catch faster foes like Abra and Galarian Ponyta unaware, and, as a Choice Scarf user, Pawniard has the advantage of outspeeding common Choice Scarf users like Porygon and Mudbray while resisting Grookey's Grassy Glide. A suicide lead set with Inner Focus, Focus Sash, Thunder Wave, and Steel Beam can be run on hyper offense teams to reliably set Stealth Rock. Thunder Wave is also an option on bulky sets to paralyze Mienfoo on the switch. Swords Dance is an option to overwhelm foes like bulky Poison-types at +2, though Pawniard's middling Speed limits its sweeping potential. Low Sweep beats other Pawniard and slows Mienfoo on the switch.</p> <h1>Checks and Counters</h1> <p><strong>Mienfoo: Mienfoo is the most common Pokemon in the tier and also one of most reliable switch-ins to Pawniard, as it resists Knock Off, outspeeds Pawniard, and OHKOes it easily. After forcing Pawniard out, Mienfoo can take advantage with Knock Off and U-turn, and it can maintain its longevity with Regenerator. However, Mienfoo can be worn down by repeatedly switching into Iron Head and is vulnerable to Thunder Wave. Inner Focus Pawniard can also punish Mienfoo for using Fake Out when it is at low health.</p> <p><strong>Timburr</strong>: Timburr has the physical bulk to switch into Pawniard with little fear and reliably OHKOes it with Mach Punch. It can also heal off damage from Pawniard with Drain Punch and take advantage of forcing a switch by using Knock Off and its coverage. However, Timburr can be worn down by repeated switches into Iron Head, and it may struggle to recover enough health with Drain Punch.</p> <p><strong>Fighting-type Coverage</strong>: Abra, one of Pawniard's most important foes to check, can turn the tables and OHKO it with Focus Punch or Submission. Galarian Ponyta and opposing Pawniard can also run Fighting-type coverage to surprise it. Psychic-types must make risky predictions or use Substitute to safely attack Pawniard, though.</p> <p><strong>Trappers</strong>: Diglett and especially Trapinch can trap Pawniard on a double switch or after a KO. Trapinch is sometimes bulky enough to hard switch into Pawniard, though it can still lose to Iron Head flinches and frailer sets must beware switching into Knock Off. Life Orb Diglett runs Substitute to avoid the threat of Sucker Punch and safely trap. Both must beware losing too much health from trapping it, though, as this may limit their effectiveness against more threatening targets later.</p> <p><strong>Fire-type Pokemon and Coverage: Ponyta, Vulpix, and Charmander outspeed and easily OHKO Pawniard, though they must fear Sucker Punch. Koffing, Natu, and Galarian Ponyta run Fire-type coverage to wear down Pawniard, though Berry Juice helps it avoid 2HKOs from these moves, and Mystical Fire also triggers Defiant.</p> ",
    "sets": [
      {
        "name": "Berry Juice",
        "description": "<p>Pawniard is one of Little Cup's best Stealth Rock setters, and it fills an invaluable role as a defensive Steel-type, checking powerful special attackers like Porygon and Abra. STAB Knock Off provides invaluable team support by removing Berry Juice and Eviolite and bringing foes into KO range of Pawniard's teammates. Iron Head is important for hitting Fighting-types hard on the switch, and it can sometimes bypass Pawniard's checks with its flinch chance. Berry Juice, a Careful nature, and the given EV spread help Pawniard avoid 2HKOs from hard hitters like Porygon and Staryu. Defiant lets Pawniard take advantage of stat drops from Galarian Ponyta's Mystical Fire and Abra's Shadow Ball, while Inner Focus prevents flinches from opposing Pawniard and weakened Mienfoo using Fake Out for chip damage.</p> <p>Pawniard is a great switch-in into dangerous special attackers like Porygon, Abra, and Galarian Ponyta, and thus it pairs well with bulky Poison-types and Mienfoo, which fear OHKOs from them. It is also the most reliable Stealth Rock setter against Natu, which fears Knock Off, thus helping offensive threats like Abra and Grookey that need Stealth Rock to reliably beat Natu. Pawniard needs a partner that can handle Mienfoo and Timburr, and bulky Poison-types like Koffing, Mareanie, and Foongus do this well. Frillish and Diglett help against Fire-types like Ponyta and Vulpix while also providing backup against Abra that carry Fighting-type coverage. Pawniard is vulnerable to Diglett and Trapinch, so a partner like Grookey or Staryu that takes advantage of these trappers is recommended.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Larvesta": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Larvesta shines as a pivot in the current metagame due to serving as a check to both Grookey and Fighting-types, which is made easier by its ability to spread burns with Flame Body and Will-O-Wisp. Flare Blitz is a hard-hitting STAB move, while U-turn lets Larvesta pivot against counters such as Staryu and Mareanie and bring in teammates to force progress. Morning Sun provides Larvesta much needed recovery, since it is getting worn down from Flare Blitz recoil and taking hits. Larvesta's physical bulk is maximized by this EV spread, and it hits 16 Speed, letting it outspeed foes such as Koffing and non-Choice Scarf Mudbray. However, Larvesta's 4x weakness to Stealth Rock limits its ability as a defensive pivot, so it appreciates being paired with entry hazard control such as Staryu and Natu. A Grass-type such as Ferroseed, Foongus, or Grookey help check opposing Water-types. Larvesta also forms a VoltTurn core with Mienfoo and benefits from it wearing down shared checks such as Mareanie and Frillish with Knock Off. Psychic-types appreciate Larvesta taking on Steel-types and safely bringing them onto the field with U-turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 438243, "username": "PyProd"}]}
  },
  "Bunnelby": {"sets": [{"name": "Wallbreaker"}]},
  "Skrelp": {"sets": [{"name": "Special Attacker"}]},
  "Tyrunt": {
    "comments": "<h1>Other Options</h1> <p>A set with Berry Juice and Sturdy can create easier setup opportunities, but the power drop of Psychic Fangs and Fire Fang is noticeable. Crunch can be used to beat Frillish and Slowpoke, but Tyrunt usually can't afford to fit it. Thunder Fang can hit all bulky Water-types decently hard, but its low power makes it miss out on KOs after one boost.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Ground-types: Trapinch, Mudbray, and Onix survive any move of +1 Tyrunt and threaten to KO it with Earthquake. Trapinch in particular is painful, as Arena Trap prevents Tyrunt from switching out and First Impression can take out a weakened Tyrunt before it can inflict damage.</p> <p><strong>Priority: Pokemon with strong priority moves, like Grookey, Pawniard, and Timburr, can take Tyrunt out if it gets too chipped while setting up and/or lowers its defenses by using Close Combat.</p> <p><strong>Bulky Water-types: Pokemon like Staryu, Frillish, and Slowpoke will almost always survive Rock Blast from full health. The first can hit Tyrunt with Ice Beam, while the other two can cripple it with status.</p> ",
    "sets": [
      {
        "name": "Dragon Dance Sweeper",
        "description": "<p>Tyrunt aims to sweep late-game with Dragon Dance after its checks have been weakened. Rock Blast KOes Natu after a boost with three hits or more, and it's Tyrunt's strongest option against most neutral targets. After one boost, Psychic Fangs KOes Mienfoo and Foongus, as well as bulky variants of Koffing and Mareanie after Stealth Rock damage. Close Combat KOes Pawniard and Porygon after a boost, and it hits Ferroseed and Onix hard. Fire Fang KOes Ferroseed after one boost while still hitting Pawniard, and it has the added benefit of not lowering Tyrunt's defensive stats, making it less susceptible to priority revenge killers.</p> <p>Tyrunt appreciates entry hazard support from Pokemon like Pawniard, Dwebble, and Diglett to break through bulkier foes. Memento Diglett also helps Tyrunt set up safely. Pawniard can lure in a Trapinch, sacrificing itself to weaken Trapinch with Knock Off, preventing it from beating Tyrunt later in the game. Grassy Terrain from Grookey weakens Earthquake from Diglett and Trapinch. Pokemon that deal with Timburr, like Koffing and Mareanie, are necessary to switch into Mach Punch for Tyrunt. Carvanha appreciates Tyrunt forcing the opponent to keep their Grookey and Staryu at high HP, which allows it to better damage the opposing team with Flip Turn. Dual screens Natu can be used to grant even safer setup opportunities.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 315003, "username": "Kipkluif"}]}
  },
  "Amaura": {"sets": [{"name": "Choice Scarf"}, {"name": "Screens Setter"}]},
  "Mareanie": {
    "overview": "<p>Mareanie has great bulk, decent movepool and typing, and a great ability in Regenerator, which make it a great wall that can switch into attacks from Mienfoo, Timburr, and Vulpix. Mareanie can also inflict status and wear down the opposing team with Scald burns and Sludge Bomb poisons. However, it has many weaknesses and is vulnerable to common Pokemon such as Abra, Mudbray, and Thunderbolt Staryu. Mareanie's Grass neutrality also causes it to fit awkwardly on many teams, as it cannot switch into Grookey's attacks, unlike fellow Poison-types like Foongus and Koffing. Mareanie is also vulnerable to getting trapped by Diglett and Trapinch, which is detrimental when trying to handle foes like Vulpix and Charmander.</p> ",
    "comments": "<h1>Other Options</h1> <p>Gunk Shot is an option to better threaten foes like Foongus and Staryu. Iron Defense allows Mareanie to function as a wincon and set up on physical attackers such as Mienfoo, Timburr, and Pawniard. However, this requires team support, as Mareanie cannot beat strong special attackers like Abra and Porygon. Toxic Spikes is an option on offensive teams to wear down foes, but it is rather lackluster due to the prevalence of Poison-types. A faster EV spread of 36 HP / 12 Atk / 100 Def / 12 SpA / 100 SpD / 236 Spe with a Timid nature allows Mareanie to outspeed key threats like Koffing, but it reduces Mareanie's physical bulk drastically. Covet is an option to take Eviolite from Foongus, Mienfoo, and Ferroseed after Mareanie has been hit by Knock Off, although it is less reliable than Knock Off.</p> <h1>Checks and Counters</h1> <p><strong>Strong Special Attackers: Powerful special attackers like Abra, Galarian Ponyta, and Magnemite outpace Mareanie and threaten it with their STAB attacks. Other special attackers such as Porygon, Koffing, and Staryu carry coverage for Mareanie.</p> <p><strong>Arena Trap Users: Diglett can OHKO Mareanie with Earthquake after it loses its Eviolite. Trapinch can also trap and OHKO Mareanie with Earthquake, but it is unreliable due to being slower and risking a Scald burn. It should be noted that neither of these trappers can switch into Scald, but they are able to come in on Mareanie thanks to Mienfoo's U-turn.</p> <p><strong>Grass-types: Bulky Grass-types like Foongus and Ferroseed can tank any of Mareanie's attacks, force it out, and use Spore or set up entry hazards; however, both of these Grass-types hate Knock Off. Grookey can pressure Mareanie with Grassy Terrain-boosted attacks but cannot switch in directly due to Sludge Bomb and Scald burns.</p> ",
    "sets": [
      {
        "name": "Wall",
        "description": "<h1>Moves</h1> <p>Scald threatens common Pokemon like Ponyta and Archen and potentially burns physical attackers like Mienfoo, Timburr, and Pawniard. Sludge Bomb OHKOes Grookey, threatens Spritzee, and is also useful to weaken bulkier Pokemon that try to switch into Mareanie's attacks, like Frillish and Natu. Knock Off removes items from switch-ins like Ferroseed, Frillish, and Staryu.</p> <h1>Set Details</h1> <p>The given EV spread along with a Bold nature and Eviolite lets Mareanie come in on physical attacks from Pawniard, Mienfoo, and Timburr and survive super effective hits from Staryu and Porygon. Regenerator lets Mareanie gain recovery on switches, which makes it less reliant on Recover and allows it to switch into threats repeatedly.</p> <h1>Usage Tips</h1> <p>Mareanie should come in against physical attacks from Mienfoo, Timburr, and Pawniard, as it can tank the attack and fish for a burn with Scald. It can also use Knock Off on bulky Pokemon like Frillish, Ferroseed, and Foongus to soften them up for its teammates. Be careful about switching into U-turn from Mienfoo, which allows trappers such as Diglett and Trapinch to trap and OHKO Mareanie, and super effective coverage from foes like Ponyta and Koffing.</p> <h1>Team Options</h1> <p>Ferroseed and Pawniard can switch into threatening special attackers like Abra, Porygon, and Staryu and set entry hazards, which help chip down foes in conjunction with Mareanie's ability to inflict status. Mienfoo and Timburr handle troublesome Pokemon like Magnemite and Onix and provide additional Knock Off support. Grookey is able to take care of problematic foes like Thunderbolt Staryu, revenge kill threats like Abra and Galarian Ponyta, and provide Grassy Terrain to weaken trappers like Diglett. Trappers like Diglett and Trapinch can remove Abra, opposing Diglett, and Magnemite. Trapinch is also useful for trapping Grookey and OHKOing it with First Impression.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 195129, "username": "Nineage"}, {"user_id": 107567, "username": "gali"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}, {"user_id": 449990, "username": "DC"}]}
  },
  "Mudbray": {
    "comments": "<h1>Other Options</h1> <p>Counter, which should be used alongside Berry Juice, trades a coverage move for a surprise KO on physical attackers like Mienfoo. Facade is an option, usually on Choice Scarf Mudbray, to maintain offensive pressure after Mudbray has been burned by an attack like Koffing's Will-O-Wisp.</p> <h1>Checks and Counters</h1> <p><strong>Grookey: With its ability to set up Grassy Terrain, which reduces the power of Earthquake, and deal massive damage with Grassy Glide, Grookey is easily one of the biggest checks to Mudbray. However, Grookey cannot switch in multiple times, as it take a lot of damage from Heavy Slam and Close Combat.</p> <p><strong>Natu</strong>: While it takes considerable damage from Heavy Slam, Natu can outlast Mudbray with Roost and prevent it from setting Stealth Rock and using Earthquake.</p> <p><strong>Water-types</strong>: Bulky Water-types such as Staryu, Frillish, and Slowpoke can switch into Mudbray and punish it with Scald, although they take a lot of damage from Earthquake if they lose their Eviolite. Offensive Water-types such as Carvanha and Life Orb Staryu can bypass Mudbray's ability to tank hits and OHKO it.</p> <p><strong>Air Balloon Diglett: Air Balloon Diglett can exploit Choice Scarf Mudbray if it is locked into a Ground-type attack by trapping and subsequently KOing it.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Mudbray's natural bulk allows it to safely set Stealth Rock against many different Pokemon. Close Combat threatens Ferroseed, while Heavy Slam covers Natu and Grookey. Alternatively, Rock Slide can hit Natu harder, but it is weaker against Grookey. High Horsepower can be used instead of Earthquake to do more damage in Grassy Terrain, but it is less accurate than Earthquake and can be unreliable at times. Eviolite is usually preferred to maximize Mudbray's bulk, but Berry Juice can provide it with much-needed recovery.</p> <p>Stealth Rock Mudbray is amazing on certain offensive teams, as it allows Steel-types like Pawniard and Ferroseed to forgo Stealth Rock for other utility options. Furthermore, its ability to switch into Koffing is appreciated by certain defensive cores such as Mareanie + Ferroseed. Mudbray greatly struggles against Grookey and should be paired with partners such as Koffing, Natu, and Foongus that handle it. It also has difficulty beating Natu one-on-one consistently, so checks such as Frillish and your own Natu are good options.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Mudbray is one of LC's best Choice Scarf users, as it outspeeds another popular Choice Scarf user in Porygon. This allows Mudbray to threaten KOs on fast, offensive threats like Abra, Ponyta, and Diglett. Mudbray's coverage moves seek to pave the way for its late-game sweep with Earthquake. Close Combat greatly damages Ferroseed and prevents Mudbray from being taken advantage of by Air Balloon Diglett. Heavy Slam provides great neutral coverage against foes like Natu and Grookey, while Rock Slide can be used to deal slightly more damage to Natu and for a useful flinch chance.</p> <p>Choice Scarf Mudbray fits well with other threats like Porygon to overwhelm shared checks like Ferroseed or to take advantage of Mudbray's checks like Grookey and Natu. Mudbray is relatively frail and appreciates pivot support from Mienfoo and Natu, as they can provide it a free switch into Pokemon like Koffing and Pawniard. It is imperative that Mudbray be played carefully around Air Balloon Diglett, as recklessly using Earthquake or High Horsepower to KO a foe like Mareanie can leave Mudbray trapped.</p> "
      },
      {"name": "RestTalk", "description": "<p>A RestTalk set greatly improves Mudbray's longevity, allowing it to beat several Pokemon, such as Mienfoo and Natu, one-on-one. It can even survive hits from threatening special attackers such as Abra thanks to its Special Defense investment and retaliate with a powerful hit. Heavy Slam is the best coverage to hit Flying-types and Ground-immune foes like Air Balloon Diglett.</p> <p>RestTalk Mudbray usually finds itself on more offensive teams like Fighting spam as a way to keep offensive momentum and provide a much-needed defensive backbone. Grookey is still a terror for Mudbray, so pairing it with Koffing, Foongus, and Natu is recommended. RestTalk Mudbray also struggles against Water-types such as Frillish and Staryu because they can take advantage of it using Rest or force it out. As such, partners like Pawniard and Ferroseed are recommended; they also help it by checking threats like Abra and Porygon.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 481831, "username": "wesh papillon"}]}
  },
  "Grookey": {
    "overview": "<p>Grookey cements itself as a powerful offensive presence in LC, capable of tearing through opposing teams with Grassy Terrain-boosted Wood Hammer and Grassy Glide and pressuring common foes like Staryu, Diglett, and Onix. Furthermore, Grookey's access to Swords Dance, along with coverage moves like Drain Punch and Acrobatics, makes it difficult to properly check, as even checks like Foongus and Pawniard can fall to its sheer power. Grookey can also function as a blanket check to many setup sweepers, as they fear being revenge killed by Grassy Glide. Grassy Terrain also provides great utility for Grookey's teammates, enabling setup sweepers and making Grookey a Pokemon that can fit on many teams. However, Grookey is unable to fit all of its coverage moves, meaning that it can be checked by common walls such as Foongus and Koffing when properly scouted.</p> ",
    "comments": "<h1>Other Options</h1> <p>Grookey can run Berry Juice or Eviolite over Life Orb, trading damage for recovery or bulk to help it function as an offensive pivot. Acrobatics, in combination with consumable items like Berry Juice and Grassy Seed or with no item at all, can be utilized to lure in and heavily damage Foongus. Mega Kick is an option to hit all both Koffing and Foongus in one moveslot, but its inaccuracy makes it unreliable. Taunt prevents foes such as Foongus and Ferroseed from crippling Grookey's teammates with status.</p> <h1>Checks and Counters</h1> <p><strong>Foongus: Foongus resists Grookey's STAB moves and Drain Punch and can repeatedly switch into Grookey thanks to Regenerator. It can also force out Grookey with Sludge Bomb and use that opportunity to potentially cripple one of Grookey's teammates with Spore. However, Foongus should be wary of being hit by Knock Off and U-turn.</p> <p><strong>Koffing</strong>: Thanks to its typing, Koffing takes minimal damage from Grookey's STAB moves and Drain Punch. It can KO Grookey with a strong Sludge Bomb or burn it with Will-O-Wisp. However, Koffing lacks recovery and can be worn down after repeatedly switching in.</p> <p><strong>Steel-types</strong>: Steel-types such as Pawniard, Magnemite, and Ferroseed resist both Wood Hammer and Grassy Glide. Pawniard and Magnemite can retaliate with a strong attack, while Ferroseed can cripple Grookey with Thunder Wave and limit its effectiveness. However, all three Steel-types should be wary of Drain Punch.</p> <p><strong>Trapinch: Trapinch's First Impression outprioritzes Grassy Glide and OHKOes Grookey. However, Protect renders Trapinch useless.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Moves</h1> <p>Grassy Glide turns into a priority move under Grassy Terrain and lets Grookey revenge kill weakened foes and faster threats such as Wingull, Abra, and Staryu. Knock Off weakens checks such as Koffing, Foongus, and Ferroseed. Drain Punch provides Grookey with coverage against Steel-types like Ferroseed, Pawniard, and Magnemite. Protect is an option to block priority like Fake Out from Mienfoo and First Impression from Trapinch, invalidating the latter as a check. U-turn can be used to pivot away from checks such as Foongus and Koffing. Wood Hammer is Grookey's strongest move and allows it to break through bulky foes such as Mienfoo and Pawniard. Fake Out is a notable mention that improves Grookey's revenge killing capabilities and lets it weaken and beat problematic foes such as Vulpix.</p> <h1>Set Details</h1> <p>Grassy Surge sets up Grassy Terrain, which empowers Wood Hammer and Grassy Glide, turns Grassy Glide into a priority move, and provides residual healing for Grookey and its teammates. Maximum Attack and Speed investment with a Jolly nature allows Grookey to reach 17 Speed, outspeeding Pawniard while Speed tying with fast Mienfoo. If running Fake Out, Grookey should opt for an Adamant nature. Life Orb provides an additional damage boost, allowing Grookey to garner crucial KOs on common threats like Abra.</p> <h1>Usage Tips</h1> <p>Grookey is best utilized as a revenge killer and sweeper, taking advantage of a teammate safely pivoting into it or entering on a double switch to pressure foes with a strong Grassy Glide. It is capable of forcing foes like Staryu and Mareanie out to potentially sweep past the opposing team. Often, it is pivotal to preserve Grookey for as long as possible, since Grassy Glide is able to revenge kill boosted setup sweepers like Porygon and Tyrunt and clean late-game. Grassy Terrain from Grookey can also be utilized as a support tool to heal teammates. Be wary of Trapinch, as Grookey without Protect can be trapped and OHKOed by First Impression.</p> <h1>Team Options</h1> <p>Knock Off users like Mienfoo, Ferroseed, and Pawniard can weaken problematic foes like Koffing and Foongus, as well as Ferroseed and opposing Mienfoo and Pawniard. Psychic-types such as Abra and Galarian Ponyta help threaten checks like Koffing and Foongus. On a set with U-turn, Koffing is good to pressure common foes that switch into U-turn like Foongus and Ferroseed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410251, "username": "zizalith"}, {"user_id": 255030, "username": "San Tomas"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Scorbunny": {
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>This set seeks to take advantage of Scorbunny's ability to single-handedly take down one of LC's most prominent defensive cores in Ferroseed + Spritzee while also maintaining the ability to pivot out of common switch-ins, such as Mareanie, and give Scorbunny's teammates more opportunities for advantageous matchups. Bring Scorbunny in on Grass- and Steel-types and use the pressure of its super effective STAB moves due to Libero to use U-Turn to pivot out of the opponent's switch-in to control momentum and keep exerting pressure on the opponent. High Jump Kick gives Scorbunny the ability to hit incoming Rock-types, though it does not possess the raw power to OHKO them in most cases. As a result, it's generally better to hold off on using High Jump Kick until the foe takes enough chip damage via U-turn and hazard damage. Sucker Punch is also an option if your team already has sufficient Rock-type answers elsewhere to provide Scorbunny with a way of getting off some damage against faster Pokemon such as Diglett and Galarian Ponyta. Berry Juice is the preferred item for Scorbunny, as it provides greater longevity by allowing Scorbunny to combat being worn down by hazards as it pivots in and out of the fight.</p> <p>Pokemon who appreciate Scorbunny's ability to deal with Ferroseed and Spritzee, such as Shellder or Onix synergize quite well with Scorbunny. Additionally, Pokemon that can capitalize off of the free switch in opportunities that Scorbunny provides, such as Corphish or Mudbray, are quite appealing teammates. Trappers like Diglett and Trapinch are often able to easily remove common answers to Scorbunny, such as Mareanie. Other pivots like Vullaby and Chinchou are also great options to form a nice VoltTurn core. Chinchou, in particular, can pile the pressure on Frillish and other Water-type Scorbunny switch-ins that aren't opposing Chinchou. Ferroseed and other hazard setters are great teammates, as the chip damage provided via their hazards can be crucial in wearing down and ultimately busting through opposing teams. Lastly, hazard removal from the likes of Vullaby or Staryu, for example, will allow Scorbunny to not be worn down as easily and remain a threat, thus being able to apply pressure throughout a match.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 410251, "username": "zizalith"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 242047, "username": "Joltage"}]}
  },
  "Sobble": {
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>This set takes advantage of Sobble's access to both Reflect and Light Screen combined with its decent Speed stat to support its team. Light Clay is the preferred item due to extending the duration of dual screens, though Eviolite can be used as well to make setting them a little easier. U-turn allows Sobble to bring in a teammate, ideally a sweeper after setting dual screens, while Surf works as a decently strong STAB move in a pinch. The EVs are used to boost Sobble's Speed and bulk to give it an easier time to set dual screens. Keep in mind that Sobble isn't particularly bulky, so avoid switching it into powerful attacks, and that relying on dual screens tactics is somewhat unreliable and matchup-dependent, which makes Sobble a mediocre pick.</p> <p>Setup sweepers that can take advantage of dual screens support such as Scraggy, Corphish, and Nasty Plot Vullaby are ideal teammates for Sobble. Sobble struggles against Grass- and Electric-type Pokemon such as Oddish and Chinchou, which makes Ferroseed a useful teammate, as it can handle such threats. Using Natu over Sobble as a dual screens setter should be considered as it has a useful ability in Magic Bounce. Also, note that Memento users like Diglett and Cottonee can be more consistent in supporting setup sweepers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 410251, "username": "zizalith"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 456766, "username": "Muksu"}]}
  },
  "Arrokuda": {
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>Arrokuda is primarily a revenge killer, using its vast movepool and coverage options to check a variety of threats. Close Combat is able to 2HKO Ferroseed and Cufant as well as OHKO Pawniard. Aqua Jet lets Arrokuda deal with more offensive teams by picking off their faster weakened Pokemon. Psychic Fangs destroys Croagunk and 2HKOes Mareanie, while Drill Run can also be run to deal super effective damage to Chinchou at the cost of only 2HKOing Croagunk. Lastly, Poison Jab is also an option to check and OHKO Cottonee and Morelull. This simple EV spread paired with a Jolly nature maximizes Arrokuda's Speed and offensive potential, while the 17 HP IVs ensure that Arrokuda only takes 1 HP of Life Orb recoil every attack by being at maximum 19 HP. However, if Berry Juice is opted for instead, make sure to have perfect IVs and add the remaining 28 EVs into HP for a little bit more longevity.</p> <p>Entry hazard setters such as Ferroseed, Onix, and Pawniard benefit Arrokuda's ability to score more KOs thanks to the chip damage dealt to the foes by entry hazards throughout the game; with one layer of Spikes up, Mareanie often drops to Psychic Fangs after a Liquidation, while Ferroseed usually drops to Close Combat after a Liquidation. VoltTurn users like Vullaby and Chinchou allow for Arrokuda to switch in safely due to its poor bulk, while Arrokuda benefits these three users in particular by checking Onix and other Rock- or Ground-types to more easily spam a singular move.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 264307, "username": "crusty"}]}
  }
}