{
  "Clefable": {
    "comments": "<h1>Other Options</h1> <p>Wish can be used in the last slot on Unaware Clefable in order to heal its teammates . Teleport can also be run on Unaware Clefable to provide pivoting to Clefable's teammates, allowing offensive wallbreakers to come in more safely. Clefable can choose to run an alternative EV spread of 252 HP / 120 Def / 136 Spe with a Bold nature in order to outspeed threats such as Conkeldurr, Rhyperior and Melmetal; however, this does hamper Clefable's ability to take physical hits somewhat.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Threats such as Landorus-T, Garchomp, Ground / Flying Mew, and Water / Ground Salamence are immune to Thunderbolt and can all hit Clefable super effectively with their strong physical Ground-type STAB attacks, potentially OHKOing it in the majority of cases. However, none of the aforementioned threats easily switch in into offensive Clefable's Fairy-type STAB.</p> <p><strong>Physical Attackers: Strong physical wallbreakers such as Landorus-T, Lycanroc-D, Urshifu, and Dracovish can all heavily threaten Clefable. Lycanroc-D and Urshifu in particular can usually switch into Unaware Clefable quite safely and threaten to heavily dent it in return, though both struggle to break offensive Clefable.</p> <p><strong>Specially Defensive Walls: Although they cannot do that much in return, walls such as opposing Unaware Clefable, Chansey, and Assault Vest Galarian Slowking can take on Magic Guard Clefable's boosted attacks and pivot into powerful breakers that can threaten it in return.</p> <p><strong>Poison- and Steel-Types: Poison- and Steel-types have ample opportunity to switch in via Unaware Clefable's Toxic or offensive Clefable's Moonblast. Those that resist Knock Off such as Steel / Fighting Melmetal, Dark / Poison Toxapex, and Dark / Poison Tornadus-T do particularly well against Unaware Clefable, while Poison / Electric Latias and Steel / Ground Melmetal are able to switch into offensive sets safely.</p> <p><strong>Opposing Calm Mind Sweepers: Calm Mind users such as Electric / Poison Latias, Cresselia, and Magearna can boost alongside Clefable and potentially outdamage it and beat it one-on-one.</p> ",
    "sets": [
      {
        "name": "Unaware Wall",
        "description": "<p>Clefable is an incredible specially defensive wall that can check a wide array of special attackers and setup threats, such as Volcarona and Tornadus-T, due to its nice bulk, ability in Unaware, and reliable recovery options. With Knock Off and Toxic, Clefable can cripple various opposing threats, and it utilizes an amazing defensive typing with only one weakness. Clefable can be used as a dedicated Stealth Rock setter, since it can annoy common Defog users such as Tornadus-T, Mew, and Salamence by statusing them and removing important items such as Heavy-Duty Boots via Knock Off. Seismic Toss is a more consistent damaging option that lets Clefable effectively wear down opposing threats that either resist Knock Off or are immune to Toxic such as Cresselia, Latias, and opposing Clefable. Aromatherapy is another option that enables Clefable to cure itself and its teammates from status, which can be crucial on more defensive teams. Black Sludge provides Clefable with passive recovery, which can enable it to better survive hits from stronger threats such as Fleur Cannon Magearna and Choice Specs Tapu Lele. Heavy-Duty Boots is an alternative item option that enables Clefable to switch in more proficiently without needing to take entry hazard damage.</p> <p>Clefable appreciates teammates that can handle physically offensive threats such as Landorus-T, Pheromosa, and Lycanroc-D. Thus, partners such as Mew, Slowbro, and Landorus-T all make great choices. Mew and Landorus-T in particular can provide Clefable with entry hazard support, enabling it to wear down targets more quickly in tandem with Knock Off + Toxic. Offensive teammates such as Tornadus-T, Garchomp, and Rillaboom also pair well with Clefable, as Clefable can help wear down their checks and enable them to break through the opposing team more easily. Entry hazard removal is also crucial for Clefable due to its susceptibility to both Stealth Rock and Spikes if it does not run Heavy-Duty Boots. Partners such as Latias, Defog Mew, and Avalugg all pair well with Clefable in this regard.</p> "
      },
      {
        "name": "Offensive Setup",
        "description": "<p>Offensive Clefable is geared to act as a wincon that can terrorize common defensive cores thanks to its incredible STAB coverage and ability to forego passive damage thanks to Magic Guard, which makes it difficult to stop once it begins to set up. Thunderbolt compliments Moonblast well by targeting threats that resist Fairy like Steel / Flying Mew, Water / Poison Latias, and Fire / Flying Tornadus-T. Flamethrower can be used as a secondary STAB option over Thunderbolt, enabling Clefable to target checks such as Ferrothorn and Steel / Ground Garchomp. Life Orb boosts Clefable's power without the drawback of recoil thanks to its ability. As Calm Mind already boosts Clefable's Special Defense, a Bold nature and investment in HP and Defense enable it to sponge as many physical moves as possible.</p> <p>Thunderbolt Clefable struggles against specially defensive walls like Ferrothorn, Steel / Ground Kommo-o, and Assault Vest Galarian Slowking. Thus, partners such as Swords Dance Garchomp, Lycanroc-D, and Heracross all make amazing teammates. Flamethrower Clefable struggles with Steel / Ground Pokemon immune to Fire-type attacks such as Coalossal and Heatran; thus, partners that can threaten them out like Landorus, Pheromosa, and Water / Dragon Hydreigon are very valuable additions alongside it. Due to the more offensive nature of this set, backup defensive pivots such as Mew, Blissey, and Buzzwole are much appreciated to keep opposing wallbreakers such as Haxorus and Melmetal in check. Clefable also appreciates entry hazard support from the likes of Ferrothorn, Kommo-o, and Landorus-T to help wear down switch-ins more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "In The Hills"}, {"user_id": 410702, "username": "a loser"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": []}
  },
  "Arcanine": {
    "comments": "<h1>Other Options</h1> <p>Normal / Fairy Arcanine can opt to run a more offensive set with Flare Blitz over Morning Sun to help patch its weakness to Steel-types. An alternative spread of 80 HP / 252 Atk / 176 Spe can be used to slightly increase Arcanine's bulk while ensuring it still outspeeds threats like Rillaboom and offensive Magearna. Leftovers can be used to increase Arcanine's longevity, though Life Orb's immediate power is generally preferred. Normal / Fighting Arcanine with Close Combat can be used to hit Steel-types without recoil, though this set needs Crunch to hit Ghost-types. Wild Charge can be used to hit bulky Water-types such as Mew, Slowbro, and Galarian Slowking, though the recoil makes this option riskier.</p> <h1>Checks and Counters</h1> <p><strong>Heatran: Steel / Ground Heatran is the most reliable check to Arcanine, as it has high bulk, is Normal-resistant, and can threaten to KO Arcanine; even Normal / Fire Arcanine is unable to threaten Heatran due to Flash Fire.</p> <p><strong>Ghost-types</strong>: Both offensive and defensive Ghost-types are a massive threat to Arcanine. Defensive Ghost-types such as Slowbro, Galarian Slowking, and Cresselia are able to wall Arcanine well, though they can be vulnerable to Normal / Dark Arcanine. On the other hand, offensive Ghost-types like Latios, Alakazam, and Heracross are able to take advantage of Arcanine's Speed tier and their Ghost immunity to threaten it.</p> <p><strong>Toxapex: Toxapex threatens Arcanine with Toxic, walls all of its sets, and prevents it from setting up with Haze.</p> <p><strong>Defensive Steel-types</strong>: Defensive Steel-types like Mew, Reuniclus, and Salamence are able to check Normal / Fairy Arcanine well and threaten to KO it with their STAB attacks, though they are vulnerable to Arcanine's Normal / Fire sets.</p> <p><strong>Bulky Water-types: Bulky Water-types such as Slowbro, Salamence, and Mew make great checks to Normal / Fire Arcanine and threaten to KO it with their STAB attacks while also being passable checks to other Arcanine sets as well.</p> <p><strong>Residual Damage</strong>: Fire-type Arcanine is prone to residual damage from Life Orb and Flare Blitz, and often wears itself down throughout the match, making it easier to revenge kill or even causing itself to faint.</p> ",
    "sets": [
      {
        "name": "Extreme Speed",
        "description": "<p>Arcanine is a powerful attacker that utilizes STAB Extreme Speed to threaten a large portion of offensive Pokemon. Play Rough is a powerful secondary STAB attack that allows Arcanine to OHKO threats such as Fighting / Flying Tornadus-T, Spectrier, and Lycanroc-D. Flare Blitz can be used to provide Arcanine with a Normal / Fire typing, which lets it break Steel-types such as Mew, Reuniclus, and Magearna. Flare Blitz should be used in conjunction with Heavy-Duty Boots and Intimidate to eliminate Arcanine's weakness to entry hazards. Crunch lets Arcanine hit Ghost-types; this option can be used as either a STAB option that grants it a Normal / Dark typing or a coverage option on Normal / Fire sets. Morning Sun provides Arcanine with recovery and increases its longevity as a wallbreaker. Arcanine becomes a powerful setup sweeper with Howl; this allows it to break past walls and sweep offensive threats with ease. Life Orb increases the power of Arcanine's attacks and increases its wallbreaking power. Toxic is another option to hinder its bulkier checks such as Slowbro and Salamence. While Flash Fire is primarily used for an immunity to Will-O-Wisp, Arcanine's immunity to Fire-type attacks can be beneficial against threats such as Victini and Hydreigon.</p> <p>Hydreigon, Latias, and offensive Clefable appreciate Arcanine's ability to pressure specially defensive walls, namely Unaware Clefable and Blissey; in return, they are able to pressure physical walls such as Salamence, Cresselia, and Toxapex. Dark-types like Spectrier, Lycanroc-D, and Tornadus-T are particularly good partners to Normal / Fairy and Normal / Fire Arcanine, as they heavily pressure Arcanine's Ghost-type checks. Normal / Fairy Arcanine is vulnerable to bulky Steel-types such as Mew, Reuniclus, and Melmetal, so Fire-type partners like Volcarona, Hydreigon, and Victini are useful to cover this weakness. Normal / Fire Arcanine appreciates Grass- and Electric-types such as Rillaboom, Naganadel, and Latias that can pressure bulky Water-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410702, "username": "a loser"}, {"user_id": 466267, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 324242, "username": "in the hills"}]}
  },
  "Alakazam": {
    "comments": "<h1>Other Options</h1> <p>Fairy / Fighting typing with Dazzling Gleam and Focus Blast is an option with good STAB coverage to hit Dragon- and Fighting-types, but it leaves Alakazam open to revenge killing from Extreme Speed users like Entei and Arcanine. Paired with Tapu Lele, Alakazam is threatening in Psychic Terrain with Expanding Force and Focus Blast as well as immunity to Extreme Speed. However, Psychic Terrain-based teams require a lot of support to perform well. Alakazam can use Recover over Taunt or Encore to shake off any damage taken, but it is generally too frail to see much benefit from reliable recovery. Other team support options for the last move include Knock Off, Toxic, and Thunder Wave. Teleport is another option that allows Alakazam to pivot as its checks switch in, but Alakazam lacks the bulk to be a reliable pivot. Focus Sash sets can run Counter as the last move in order to revenge kill setup sweepers and faster threats like Haxorus and Rillaboom, but it is prediction reliant and misses out on Ghost-type attackers.</p> <h1>Checks and Counters</h1> <p><strong>Faster Foes: Alakazam is quite frail and can be KOed by faster offensive threats like Dragapult, Pheromosa, Spectrier, and Naganadel. Focus Sash sets can beat these foes one-on-one, though, if Alakazam is still at full health.</p> <p><strong>Priority Attacks: While Alakazam is immune to Extreme Speed, users of other priority moves like Rillaboom, Scizor, and Lycanroc-D can OHKO it.</p> <p><strong>Poison / Dark Walls: Ghost / Fairy sets can struggle to break past specially defensive Poison / Dark types like Unaware Clefable, Toxapex, and RegenVest Tornadus-T. Clefable and Toxapex are vulnerable to Taunt, which prevents recovery moves and Haze, but they can use Knock Off to remove Alakazam's Life Orb to reduce its damage output.</p> <p><strong>Blissey: Blissey's massive special bulk and common typings like Normal / Ghost and Normal / Fairy allow it to check Alakazam fairly well, although Normal / Fairy variants can be 2HKOed by +2 Focus Blast, and Blissey is generally vulnerable to Taunt.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Alakazam's high Special Attack and Speed along with access to Nasty Plot make it a dangerous setup sweeper in the metagame. Shadow Ball is great for Alakazam, as it hits a lot of the metagame neutrally and makes it immune to revenge killing from Extreme Speed users. Focus Blast complements Shadow Ball well, allowing Alakazam to 2HKO Dark / Poison Clefable and hit other Dark-types like Lycanroc-D and Hippowdon, although Alakazam has to watch out for Sucker Punch from the former. While Focus Blast provides a strong yet inaccurate secondary STAB move, Dazzling Gleam has less power but lets Alakazam hit Normal / Ghost types like Blissey and more reliably hit threats like Normal / Dark Arcanine and Heracross. Nasty Plot allows Alakazam to 2HKO specially defensive checks like RegenVest Galarian Slowking and Tornadus-T with Focus Blast. Taunt prevents checks like Blissey and Clefable from healing or using status moves, which can allow Alakazam to break past them with boosted attacks. Encore is a less reliable option that locks foes into recovery or status moves, which gives Alakazam an opportunity to set up with Nasty Plot. Life Orb benefits from Magic Guard nullifying its recoil damage. Focus Sash is another option on more offensive teams, as it gives Alakazam an opportunity to revenge kill setup sweepers or use Nasty Plot.</p> <p>Other special setup sweepers like Latias, Galarian Slowking, and Volcarona appreciate Focus Blast Alakazam's ability to break past Unaware Clefable and certain RegenVest users like Slowking and Galarian Slowking, as this gives them opportunities to set up and sweep as well. These teammates also benefit from Alakazam's ability to absorb Toxic, which would otherwise put them on a timer. Alakazam is outsped by threats like Tornadus-T, Naganadel, and Pheromosa, so defensive teammates like Clefable, Mew, and Salamence can help check these threats while controlling entry hazards to support the team. Alakazam is prone to revenge killing from priority users like Rillaboom, Scizor, and Sucker Punch Lycanroc-D; Mew and Salamence can also help check these threats. Bulletproof Kommo-o counters Ghost / Fighting Alakazam and can check Dazzling Gleam variants with its typing, but Clefable, Mew, and Salamence can check it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Slowbro": {
    "comments": "<h1>Other Options</h1> <p>Slowbro has a few setup options like Calm Mind and Iron Defense that can be used in place of Teleport, but they come at the cost of sacrificing momentum as a pivot. Calm Mind makes up for Slowbro's lower Special Defense and makes it threatening with a boosted Shadow Ball or Scald. Iron Defense doubles the power of Body Press and makes Slowbro even more physically bulky. When running Scald, Toxic can be used over Body Press to provide a solid defensive typing and help Slowbro avoid being poisoned itself, but this makes Slowbro very passive and vulnerable to Taunt. Slowbro makes a good Trick Room setter thanks to its longevity from multiple recovery methods, but such a set only fits on the rare Offensive Trick Room archetype. Slowbro's incredible movepool includes moves like Fire Blast, Ice Beam, and Psychic, which allow it to take on different typings depending on what the team needs.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types</strong>: Flying is one of Slowbro's most exploitable weaknesses, leaving it vulnerable to common Flying-type threats like Hurricane Tornadus-T, Dual Wingbeat Scizor, and Buzzwole.</p> <p><strong>Special Attackers: Slowbro's below average Special Defense combined with its two main typings leaves it unable to stomach strong, neutral or super effective special attacks from threats like Thunderbolt Porygon-Z, Choice Specs Dragapult, and Hydreigon.</p> <p><strong>Fairy-type Pokemon: Both physical and special Fairy-type attackers, such as Play Rough Lycanroc-D and Moonblast Clefable, are bad news for Slowbro, as they both hit hard with super effective damage and can set up on it as well or gain momentum by setting entry hazards.</p> ",
    "sets": [
      {
        "name": "Physical Regenerator",
        "description": "<p>Slowbro's nice physical bulk paired with a pivot move and multiple recovery options make it a great defensive wall with longevity in battle. Colorful coverage options allow for Slowbro to have several usable typings, but Ghost / Fighting and Water / Fighting typings offer it the most defensive utility. Shadow Ball Slowbro gains two great immunities to Fighting-type attacks like Close Combat and strong Normal-type moves like Extreme Speed, Facade, and Boomburst, allowing it to switch into attacks from threats like Entei, Heracross, and Kommo-o to scout and heal with Regenerator. Scald offers no immunities but gives Slowbro a number of useful resistances to Fire, Ice, and Water, which allow it to check physical threats such as Triple Axel Pheromosa, Fire-type Entei, and Aqua Tail Garchomp. Body Press takes advantage of Slowbro's naturally high defense and makes for a powerful attack that requires no offensive investment. Slack Off lets Slowbro recover without needing to switch out, which comes in handy against passive Pokemon like Blissey. Rocky Helmet lets Slowbro punish physical attackers by chipping away at their health, after which Slowbro just heals as it switches out. Leftovers is another option, but it is not as useful as Rocky Helmet because Slowbro already has two methods of healing. Heavy-Duty Boots is a third item option that allows Slowbro to pivot while Spikes and Toxic Spikes are on the field and reduces chip damage. A Relaxed nature with full defensive investment maximizes Slowbro's physical bulk and increases the power of Body Press, while minimum Speed lets Slowbro deal with Trick Room attackers and have the slowest possible Teleport for momentum.</p> <p>Slowbro appreciates specially defensive teammates such as Dark / Poison Unaware Clefable and Toxapex to handle the special attackers that force it out. These teammates also cover Slowbro's weaknesses to Ghost- and Psychic-type attacks and vulnerability to being poisoned and can help it gain momentum with Stealth Rock or Teleport from Clefable and Regenerator from Toxapex. Opposing Dark / Poison Clefable and Toxapex can also cripple Slowbro with Toxic and Knock Off, so physical wallbreakers like Garchomp and Melmetal make great offensive teammates that can pressure them. These wallbreakers also appreciate Slowbro's Teleport allowing them to safely switch into battle.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Mew": {
    "comments": "<h1>Other Options</h1> <p>Water-type defensive sets can run Volt Switch in the second slot alongside Scald for a Water / Electric typing to serve as a pivot and a Flying-resistant Pokemon, but this makes Mew vulnerable to Ground-types, as they can hit it super effectively and are immune to Volt Switch. Nasty Plot Mew can run various moves in its second slot to fit team needs, like Earth Power, Flamethrower, Scald, and many more. Outside of Earth Power variants, these sets also are dependent on Heavy-Duty Boots for more reliable longevity. Steel-type Mew can run an alternate EV spread of 252 HP / 4 Def / 252 SpD with a Careful nature to maximize its specially defensive capabilities, which allows it to check Cresselia, Tapu Lele, and Ghost / Fairy Alakazam. While maximum Special Defense investment does help it check those threats more properly, Mew fits the role of a physical wall better. Teleport is an option over U-turn for slower pivoting, though U-turn is generally preferred because it can damage foes and still works if under Taunt. Dazzling Gleam can be used as a secondary STAB option to provide Mew with a Steel / Fairy defensive typing, allowing it to check threats such as Heracross and Rillaboom. This option has some major drawbacks however; it requires Mew to run Roost in another slot and reduces its support options while gaining a weakness to Ground-type attacks. Either Scald or Flip Turn can be used for a Water / Steel typing, which grants Mew alternatives to Will-O-Wisp and U-turn, respectively.</p> <h1>Checks and Counters</h1> <p><strong>Clefable: Unaware Clefable ignores Nasty Plot Mew's boosts and can cripple it with Knock Off and Toxic while gaining momentum with moves like Stealth Rock and Teleport. Offensive Thunderbolt Clefable resists Mew's STAB moves and can set up with Calm Mind to force Mew out.</p> <p><strong>Rillaboom</strong>: Rillaboom's Terrain-boosted Grass-type STAB moves heavily threaten bulky Water-type Mew, even Water / Flying set variants, as a Life Orb-boosted Wood Hammer cleanly 2HKOes it.</p> <p><strong>Latios</strong>: Electric-type variants of Latios such as Electric / Water and Electric / Dragon can easily switch into both Water-type and Nasty Plot Mew, resisting all of its STAB moves bar Dazzling Gleam and threatening it out with Draco Meteor, Surf, and Thunderbolt. These variants can also use Mew as setup fodder to accumulate Calm Mind boosts while healing off any chip with Recover.</p> <p><strong>Special Attackers</strong>: With Mew investing in physical bulk, strong special attackers like Latios, Porygon-Z, and Spectrier all threaten it with strong boosted attacks and can also cripple Mew with moves like Trick and Taunt.</p> <p><strong>Victini: Fire / Electric Victini is undoubtedly the best counter to Mew, as it threatens to OHKO with both of its STAB attacks while Mew's Iron Head does minimal damage against it.</p> <p><strong>Fire-types</strong>: Offensive Fire-types such as Entei, Arcanine, and Heatran make for solid checks to Mew because they threaten it with their Fire-type attacks while being resistant to Steel. Fire-types can be vulnerable to Mew's entry hazards unless running Heavy-Duty Boots, so it is important to keep them healthy against it. Additionally, these threats are immune to Mew's Will-O-Wisp, so it cannot hinder them throughout the battle.</p> <p><strong>Electric-types: Electric-types such as Latios, Clefable, Naganadel, and Magearna can threaten Mew with their STAB attacks; Clefable in particular is a solid check to Mew due to its immunity to entry hazards.</p> <p><strong>Setup Sweepers: Setup sweepers like Latias, Hydreigon, Volcarona, and Tornadus-T are able to take advantage of Mew's passive nature to set up and heavily threaten it and its teammates. Mew is able to pivot with U-turn into checks to these threats, but it runs the risk of being greatly weakened by their attacks in the process.</p> ",
    "sets": [
      {
        "name": "Bulky Water-type",
        "description": "<p>Water-type Mew can select several great defensive typings that allow it to check various metagame threats and serve a valuable support role. Mew gets its Water typing from Flip Turn, which is a fairly weak move but allows it to be an effective pivot. Scald is another option that makes Mew less passive and can threaten foes with burns. In order to take on threats like Victini, Mew can run Earth Power for a Water / Ground typing to gain Electric-type immunity. This typing lets Mew resist Stealth Rock, which helps it stay healthy and check more offensive threats. Mew can opt for Dazzling Gleam so that it can take on certain Dragon-types like Garchomp and Salamence, as well as Dark / Fighting Lycanroc-D and Urshifu-S, but this opens it up to an Electric-type weakness, meaning it can't check Victini. Roost is a third option, granting Mew a Water / Flying typing to check Ground-types like Excadrill, Haxorus, and Landorus-T while still having a useful typing to resist Fighting. Mew has a plethora of support moves to choose from, and the best options are Spikes and Stealth Rock to chip the opposing team or Defog if the team needs entry hazard removal. Flying-type Mew can opt for Will-O-Wisp for its last move if not running Scald, or Volt Switch if not running Flip Turn. Leftovers are best for the Ground- and Fairy-type sets for passive recovery, while the Flying-type set needs Heavy-Duty Boots in order to come in on Stealth Rock reliably.</p> <p>Setup sweepers such as Latias, Lycanroc-D, and Spectrier appreciate entry hazard support from Mew, as it allows them to break past threats more easily. Mew can also bring them in safely when pivoting with Flip Turn. Special wallbreakers like Dragapult and Spectrier appreciate Earth Power Mew's ability to pressure their checks like Unaware Clefable and Dark / Poison RegenVest Tornadus-T. Water-type Mew is highly threatened by Rillaboom's Grass-type STAB moves, so teammates like Poison / Fairy Cresselia and Steel / Flying Salamence help by easily switching into its attacks. Other Salamence variants like Dragon / Ghost can also help Mew's Fairy- and Flying-type sets by checking threats like Victini and Rillaboom.</p> "
      },
      {
        "name": "Bulky Steel-type",
        "description": "<p>Bulky Steel-type Mew is a potent wall in the metagame that utilizes its Steel / Flying typing to check threats such as Cresselia and Landorus-T. Iron Head is Mew's primary STAB attack and allows it to hit Calm Mind users such as Cresselia for consistent damage. Roost provides Mew with its Flying typing and complements this solid defensive typing by providing Mew with recovery. Mew is able to utilize U-turn to pivot on switch-ins such as Victini and Hydreigon and bring in a check. Will-O-Wisp is an alternative that allows Mew to check Swords Dance users such as Lycanroc-D, Scizor, and Excadrill properly. Whirlwind can be used to phaze setup sweepers and pairs nicely with Mew's entry hazard options. For the last slot, Mew has quite a few team support options to choose from, but Spikes is the most coveted and useful option that it can utilize well to complement its solid defensive presence. Defog is another support option that can be used to remove entry hazards and dual screens. Mew can utilize Stealth Rock as an entry hazard option that can hit Levitate and Flying-type Pokemon. Leftovers increases Mew's longevity by providing passive recovery, though Rocky Helmet can be used to weaken physical attackers such as Rillaboom, Landorus-T, and Heracross.</p> <p>Setup sweepers such as Latias, Lycanroc-D, and Spectrier appreciate entry hazard support from Mew, as it allows them to break past threats more easily. Fighting-types such as Lycanroc-D, Landorus-T, and Pheromosa typically require a partner that can check Cresselia, and Mew is able to fill this role. Water / Ground Pokemon such as Hydreigon and Garchomp appreciate Mew's ability to switch into Rillaboom's Grassy Glide; in return, they are able to check Victini. Mew struggles with offensive Electric-types such as Latias, Clefable, and Naganadel, so it appreciates Ground-type teammates such as Hydreigon, Garchomp, and Slowking. Fire-resistant or Fire-immune partners are a must for Mew; Heatran, Garchomp, and Salamence fill this role the best. Since Mew generally runs Spikes, Rapid Spin users such as Pheromosa and Excadrill can provide entry hazard control support without removing your own entry hazards.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Mew takes advantage of its solid bulk, offenses, and great longevity to become a threatening setup sweeper and late-game cleaner. Hurricane and Thunderbolt give Mew a great Flying / Electric typing and allow it to pressure various threats in the metagame. Hurricane has unreliable accuracy but is worth using due to its great Base Power and ability to hit threats like Landorus-T, Rillaboom, and Tornadus-T. Thunderbolt hits the Steel-types that resist Hurricane, like Magearna, opposing Mew, Reuniclus, and Scizor. Nasty Plot makes Mew extremely threatening even to specially defensive Pokemon like Blissey and RegenVest Slowking, as Mew can easily set up in front of them while healing away any damage it takes with Soft-Boiled. Soft-Boiled is chosen over Roost to prevent slower Ground-types like Hydreigon and Haxorus from hitting Mew while it has landed.</p> <p>Physical attackers like Entei, Rillaboom, and Lycanroc-D appreciate Mew's ability to pressure their physically defensive checks, like Salamence, Slowbro, and Buzzwole. Both Magic Guard and Unaware Clefable have various means of punishing Mew and forcing it out, so Mew appreciates strong physical attackers like Garchomp and Heracross that threaten Clefable. These teammates can also set entry hazards to open up opportunities for Mew later. Water-types like Hydreigon and Latias are also good teammates, as they pressure bulky Ground-types like Garchomp and Heatran that resist Mew's attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in The hills"}, {"user_id": 475804, "username": "The Number Man"}, {"user_id": 410702, "username": "a loser"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}, {"user_id": 324242, "username": "in the hills"}]}
  },
  "Slowking": {
    "comments": "<h1>Other Options</h1> <p>Depending on the team's needs, Slowking's deep movepool allows it to run various coverage moves like Ice Beam, Seismic Toss, and Foul Play in place of Dragon Tail or Future Sight. Slowking can hold Leftovers or Heavy-Duty Boots to allow for utility options like Slack Off and Teleport, but this leaves it unable to reliably check Choice Specs Porygon-Z and sweepers like Spectrier and Hydreigon that have boosted.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Water-types like Water / Poison Latias and Water-type Mew check Slowking well, as they resist or are immune to its STAB moves. They also threaten Water / Ground Slowking with neutral damage from their Water-type STAB moves, can punish it with moves like Toxic and Knock Off, and set entry hazards against it. Fire / Ground Slowking is heavily threatened by Water-type attacks.</p> <p><strong>Item Removal: Slowking depends on its Assault Vest to better check special attackers, but Knock Off is common in the metagame, and certain special attackers like Latios and Porygon-Z can remove Slowking's Assault Vest with Trick while giving it undesirable items like Choice Scarf and Choice Specs.</p> <p><strong>Physical Attackers: Slowking's low Defense leaves it vulnerable to strong physical attackers like Garchomp, Heracross, and Lycanroc-D, which can 2HKO Slowking and force it out, using that opportunity to set up or set entry hazards.</p> ",
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>Slowking's good Special Defense combined with Assault Vest allows it to check Choice Specs users like Dragapult and Porygon-Z and Nasty Plot users like Hydreigon, Spectrier, and Tornadus-T. Water / Ground and Fire / Ground are Slowking's most useful type combinations due to their few weaknesses and useful immunities and resistances. Scald pressures opposing teams with its high burn chance and keeps Slowking from being passive. Although Slowking's Attack is below average, Earthquake gives it a useful Ground typing, allows it to 2HKO Dark / Poison Clefable, and pressures Magic Guard Clefable. Flamethrower can be used in place of Scald to better pressure Ground-immune foes like Steel / Dragon Hydreigon and Steel / Flying Mew and Salamence. Flamethrower also allows Slowking to check Fairy-type attackers like Magic Guard Clefable and Tapu Koko, both of which can pressure Water-type Slowking. Dragon Tail forces out special setup sweepers like Spectrier and Hydreigon. Future Sight pairs well with Dragon Tail, as Slowking can phaze Dark-type switch-ins and support offensive teammates.</p> <p>Slowking pairs well with Electric-type attackers like Latios, Victini, and Naganadel, as they can pressure the Water- and Flying-types like Mew, Latias, and Garchomp that check it. In return, Slowking's Future Sight can create opportunities to punch holes in the opposing team. Slowking is vulnerable to physical attackers like Entei and Garchomp, so it appreciates physically defensive teammates like Salamence and Landorus-T that can check them. These physically bulky teammates can also help Slowking by absorbing Knock Off, letting Slowking keep its added bulk from Assault Vest. Entry hazards like Spikes and Toxic Spikes make it harder for Slowking to check setup sweepers like Porygon-Z, Hydreigon, and Tornadus-T, so Defoggers like Latias and Mew are helpful. Slowking struggles with Fairy-type Calm Mind users like Cresselia, which is immune to Earthquake and Dragon Tail and can cripple Slowking with Toxic, and Electric / Fairy Clefable, which can beat Slowking one-on-one and is only 3HKOed by Earthquake. Therefore, Slowking appreciates Steel-type teammates like Excadrill, Garchomp, and Hydreigon that can take on these threats.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "In The Hills"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Slowking-Galar": {
    "comments": "<h1>Other Options</h1> <p>Hex is an option over Shadow Ball on Water / Ghost sets that pairs well with Scald's burn chance but is inconsistent. Water / Ghost sets can run Trick in the last moveslot over Substitute along with Choice Specs to cripple switch-ins like Blissey while giving Galarian Slowking more power without setting up. On RegenVest sets, Eerie Spell is a niche alternative over Future Sight that can punish foes by depleting their PP for recovery moves, but it is prediction reliant and has too few PP itself to be used often. Calm Mind is an option for Poison / Water sets in place of Future Sight, but Galarian Slowking faces competition from Latias in this role. Galarian Slowking's very low Speed and reliable recovery options make it a decent user and setter of Trick Room; Trick Room-setting sets can run various typings based on team needs, but lacking Teleport makes them slightly worse at the role than Slowking and Slowbro. Sweeping with Nasty Plot or Calm Mind is also possible, with moves like Flamethrower, Focus Blast, Ice Beam, and Shadow Ball allowing for good offensive typings.</p> <h1>Checks and Counters</h1> <p><strong>Physical Attackers: Galarian Slowking's average physical bulk leaves it vulnerable to many physical attackers such as Lycanroc-D and Rillaboom. Galarian Slowking can potentially burn these threats, but it is unable to switch into most physical threats without having an appropriate defensive typing, such as Water / Ghost for Pheromosa.</p> <p><strong>Knock Off: Water / Ghost Galarian Slowking fears Knock Off because it is weak to it, but other sets like RegenVest especially dislike losing their items.</p> <p><strong>Clefable</strong>: Unaware Clefable walls Calm Mind Galarian Slowking and can threaten it with Knock Off and Toxic or set up Stealth Rock. Substitute and Scald can mitigate these threats, but Scald can only 4HKO a burned Clefable. Magic Guard Clefable with Thunderbolt also threatens Calm Mind Galarian Slowking and can set up alongside it while ignoring burn damage. RegenVest Galarian Slowking has a more favorable matchup with Magic Guard Clefable, as it hits it super effectively with Sludge Bomb, but Clefable can set up with Calm Mind and heal away any damage taken.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Galarian Slowking takes advantage of its solid bulk and incredible longevity with Regenerator to become a bulky setup sweeper. Scald is a STAB move that spreads burns, which can help in wearing down foes like Unaware Clefable and RegenVest Tornadus-T. Shadow Ball provides Galarian Slowking with a secondary Ghost typing that gives it immunities to common powerful moves, such as Extreme Speed, Close Combat, and Boomburst, and lets it hit opposing Water-types like Latias and Mew. Calm Mind notably helps Galarian Slowking threaten special checks such as RegenVest Reuniclus and Tornadus-T. Substitute gives Galarian Slowking safe opportunities to set up and blocks crippling status moves like Toxic from Cresselia and Toxapex. Leftovers and Regenerator also mitigate health lost from using Substitute. Slack Off instead of Substitute gives more reliable and immediate recovery than Regenerator that comes in handy against opposing Calm Mind users like Magearna and Reuniclus. Future Sight works well in conjunction with Regenerator, as Galarian Slowking can switch out to both heal and create opportunities for its teammates, forcing the opponent to decide what Pokemon takes the hit. Leftovers is needed on Substitute sets to have more chances to use Calm Mind, but Heavy-Duty Boots is an alternative for sets without Substitute. 44 Speed EVs allow Galarian Slowking to outspeed Toxapex, and 212 Defense EVs with a Bold nature let it survive two Triple Axels from Choice Band Pheromosa after Stealth Rock damage.</p> <p>Frail wallbreakers like Dragapult, Lycanroc-D, and Pheromosa appreciate Galarian Slowking's ability to spread burns with Scald as it allows them to better take hits from their defensive checks. When not behind a Substitute, Galarian Slowking is vulnerable to Knock Off and Toxic from threats like Unaware Clefable, Toxapex, and Tornadus-T, so it appreciates teammates like Bug / Fighting Landorus-T to take Knock Off and Steel-type partners like Mew and Salamence that block poison and can punish Knock Off with Rocky Helmet damage. Galarian Slowking is unable to break through Unaware Clefable, so teammates that pressure it like Ground / Steel Garchomp and Hydreigon can give it effective setup opportunities.</p> "
      },
      {
        "name": "Bulky Poison-type",
        "description": "<p>Galarian Slowking's good Special Defense combined with Assault Vest allows it to check numerous special threats in the metagame like Choice Specs Porygon-Z, Spectrier, and Nasty Plot Tornadus-T. Sludge Bomb and Foul Play grant Galarian Slowking a Poison / Dark defensive typing which has only one weakness and several key resistances and immunities. Sludge Bomb has a high poison chance that can punish switch-ins like Earth Power Mew and Water / Ground Salamence. Foul Play punishes physical attackers and keeps them from freely setting up in front of Galarian Slowking. Scald can be used in place of Foul Play for a Water / Poison typing set that spreads burns and better checks Fighting-type threats but has a slightly worse typing overall and makes Spectrier more threatening with Nasty Plot. Flamethrower hits switch-ins such as Bug / Fighting Landorus-T and Steel-types. Future Sight is a team support option that forces opponents to make tough decisions when paired with offensive threats that can target Dark-types. Assault Vest with a Sassy nature maximizes Galarian Slowking's special bulk and allows it to comfortably check Choice Specs users like Dragapult, Latios, and Porygon-Z, although the latter two can use Trick to cripple it. Galarian Slowking can pass on the extra special bulk for Black Sludge, which gives it passive recovery while enabling utility moves like Slack Off and Trick.</p> <p>RegenVest Galarian Slowking pairs well with Ground-type attackers like Garchomp and Hydreigon, as they target the Poison- and Steel-types that normally force it out. These two teammates benefit from Galarian Slowking's Future Sight support, as they pressure the ubiquitous Dark / Poison types that hope to absorb the Future Sight hit. Offensive teammates in general appreciate Galarian Slowking's ability to status opposing teams, which makes it easier for wallbreakers to get KOs. Poison / Dark Galarian Slowking likes Levitate or Flying-type teammates such as Cresselia, Latias, Mew, and Tornadus-T that cover its one weakness. Besides Cresselia, each of these teammates provide Defog support, and Mew can also set entry hazards However, most of these teammates share a weakness to Electric with Poison / Water variants of Galarian Slowking, so these benefit from Electric-immune or resistant partners like Water / Ground Salamence and Earthquake Landorus-T.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "In The Hills"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Scizor": {
    "comments": "<h1>Other Options</h1> <p>Scizor can opt for items other than Life Orb to increase its defensive capabilities at the cost of some power; Rocky Helmet can damage physical attackers such as Lycanroc-D and Rillaboom, while Leftovers provides Scizor with passive recovery. Scizor can run U-turn for a pivoting option. This option can either provide Scizor with a Steel / Bug typing, or it can maintain its Steel / Flying typing with Roost in the second moveslot at the cost of not benefiting from Technician. Defog is an option on more defensively oriented sets over Swords Dance as a Defogger with priority, though these sets are outclassed by other defensive Steel / Flying types like Mew and Salamence. Superpower can be used as a coverage option to hit Steel-type switch-ins like Magnezone and Garchomp. Another niche option is Knock Off to hit Ghost-types such as Heracross, Reuniclus, and Latias and remove opposing items. A Choice Band can provide more immediate power to Scizor's Bullet Punch and allows it to pressure its usual checks with U-turn and Knock Off at the cost of Swords Dance and Roost.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Electric-types like Victini, Mew, and Latias resist both of Scizor's STAB moves and are able to OHKO it. Victini and Latias in particular are especially strong checks, as they take minimal damage from Bullet Punch. Electric / Fairy Clefable is still able to OHKO Scizor, though it is more prone to its Bullet Punch. Magnezone is another particularly threatening Electric-type check, as it can trap and OHKO Scizor.</p> <p><strong>Offensive Fire-types: Offensive Fire-types like Heatran, Hydreigon, Volcarona, and Tornadus-T are solid offensive checks, as they outspeed Scizor and resist its Bullet Punch. However, they usually cannot switch into Scizor without the risk of taking massive damage from its Dual Wingbeat.</p> <p><strong>Mew: Mew is a great defensive check to Scizor with both its bulky Water- and Steel-type sets. Water-type Mew is able to check Scizor more effectively than other bulky Water-types, as it is faster than Scizor and can more properly threaten it with Scald or Will-O-Wisp. Steel-type Mew resists both of Scizor's STAB moves but is reliant on Will-O-Wisp to properly beat it.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Scizor is a solid priority revenge killer with STAB Bullet Punch to hit faster threats such as Heracross, Pheromosa, and Spectrier. Dual Wingbeat provides Scizor with a Steel / Flying typing, which is a solid defensive typing to maximize its setup opportunities, and allows it to hit bulky Water-types like Mew, Toxapex, and Latias. Additionally, Dual Wingbeat Scizor is able to check threats such as Rillaboom and Landorus-T by threatening to OHKO them. Swords Dance allows Scizor to break past walls like Mew and Toxapex. Roost keeps Scizor healthy against its bulkier checks and allows it to properly check Fairy / Poison Cresselia. Life Orb is used to boost Scizor's power even further and works well in conjunction with Roost. Technician boosts both of Scizor's STAB attacks, which allows it to 2HKO the majority of the unresisted metagame.</p> <p>Scizor is able to threaten faster threats like Pheromosa, Spectrier, and Tornadus-T, so slower Pokemon like Latias, Hydreigon, and offensive Mew appreciate its speed control. Ground-type partners like Garchomp and Hydreigon pressure some Electric-types that threaten Scizor; it should be noted though that Ground-immune Electric-types like Latias and offensive Mew require these partners to have strong secondary STAB attacks to properly beat them. Scizor is able to complement Ground-types by being a solid offensive check to Rillaboom, though it cannot switch in safely to Superpower variants. While Scizor is able to break past bulky Water-types, they are often able to threaten it out with Scald or coverage options; specially attacking Dragon-type partners like Latias, Latios, and Dragapult are able to switch into these threats without being hindered by Scald burns.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410702, "username": "a loser"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 324242, "username": "In The Hills"}]}
  },
  "Heracross": {
    "comments": "<h1>Other Options</h1> <p>Feint is a solid option for Heracross's third moveslot that allows it to take down faster offensive threats, and even some Extreme Speed users at +2, though the lack of coverage moves makes Heracross easier to wall. A Fighting-type Heracross with Close Combat as its main STAB move is an option, with a Fighting / Dark typing being used the most. Dark / Fighting Heracross has less breaking capability than Heracross's main sets, as it doesn't have the powerful STAB Facade at its disposal. Normal / Fighting Heracross is an option as well for Fighting-type Heracross, though this set is starkly worse against Ghost-types. Spikes is a strong option on any Heracross set over Swords Dance to offer team support and chip potential switch-ins, though losing Swords Dance limits its breaking capability.</p> <h1>Checks and Counters</h1> <p><strong>Salamence</strong>: Defensive Steel / Flying Salamence is a reliable check to Heracross's sets since it resists Facade, can tank any of Heracross' coverage moves comfortably, and generally runs Rocky Helmet to further chip Heracross. Additionally, Salamence is able to remove hazards that either Heracross or its teammates set with Defog, which can make it even more difficult for Heracross to make progress.</p> <p><strong>Buzzwole</strong>: Similarly to Salamence, a bulky Steel / Flying Buzzwole is able to wall Heracross, and Buzzwole is able to more reliably check Swords Dance sets compared to Salamence by virtue of Bulk Up.</p> <p><strong>Bulky Ghost-type Pokemon</strong>: Bulky Ghost-type Pokemon such as Ghost / Fairy Cresselia and Ghost / Fighting Slowbro are some of the best checks to some of Heracross's sets, though both of these Pokemon lose to Normal / Ghost Heracross.</p> <p><strong>Tornadus-T: Tornadus-T is a huge offensive threat to Heracross and any of its sets are able to stop Heracross from sweeping, though it cannot reliably switch into any of Heracross's moves. Even if Heracross has Sticky Web support, Flying-type Tornadus-T sets are solid offensive checks to Heracross.</p> <p><strong>Latios</strong>: Latios is another great offensive check to Heracross by virtue of its Speed tier and immunity to Sticky Web via Levitate. Every variant of Latios is able to cleanly OHKO Heracross, and Ghost-type variants of Latios are also able to switch into Heracross's Facade, though this is risky given Latios is OHKOed by the rest of Heracross's coverage.</p> <p><strong>Dragapult</strong>: Dragapult an offensive check to Heracross that fits onto many teams. It has multiple options to OHKO Heracross and gains momentum on switch-ins by pivoting out. As with other offensive checks, Dragapult cements itself as a reliable check as it can nullify Sticky Web with Clear Body.</p> ",
    "sets": [
      {
        "name": "Guts Attacker",
        "description": "<p>Heracross is a devastating physical attacker in the Camomons metagame that utilizes Guts and STAB Facade to 2HKO the majority of neutral metagame. Shadow Claw and Knock Off both allow Normal-type Heracross to break through Pokemon resistant or immune to Normal. STAB Shadow Claw is able to hit common defensive Ghost-types, such as Ghost / Fighting Slowbro, and a Normal / Ghost typing makes Heracross immune to Fighting- and Normal-type attacks such as Boomburst, Close Combat, and Extreme Speed, each of which is threatening to Heracross's other sets. Knock Off is the main coverage choice for Ghost-type Heracross, as it hits opposing Normal / Ghost Pokemon and offers great support by removing items. On the other hand, Close Combat is the coverage option of choice on Dark-type Heracross to hit Steel / Fairy Pokemon such as Magearna and Reuniclus, and it heavily damages Pokemon resistant to Normal that have already had their items removed. Swords Dance allows Heracross to break opposing teams much more effectively and break past walls it normally could not.</p> <p>Heracross has limited defensive counterplay, but against offensive teams, it generally relies on extensive support from teammates like Latios and Dragapult, which are much faster and able to dismantle most of Heracross's offensive checks effectively. Clefable and Dragon / Fairy Necrozma can act as defensive switch-ins to Heracross's offensive checks such as Dragapult, Latios, and Fighting / Flying Tornadus-T. Additionally, Sticky Web support from Araquanid is a highly effective strategy to weaken Heracross's offensive checks considerably. For the few defensive Pokemon that give Heracross a hard time, strong special attackers such as Electric / Fairy Clefable and Fighting / Flying Tornadus-T are able to break past them. They also provide support with Stealth Rock and pivoting, respectively, both of which increase Heracross' breaking capabilities. It's important to note that, in any game, Heracross is constantly losing HP due to the effects of Flame Orb, so it's important to make the most of every turn it's on the field.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 466276, "username": "Dragonillis"}, {"user_id": 410702, "username": "a loser"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 324242, "username": "In The Hills"}]}
  },
  "Blissey": {
    "comments": "<h1>Other Options</h1> <p>Shadow Ball is another option for Blissey, as a Normal / Ghost typing gives Blissey useful immunities to Fighting-, Ghost-, and Normal-type attacks. Dazzling Gleam grants Blissey a Normal / Fairy typing, making it one of the best checks to Nasty Plot Spectrier, which otherwise can threaten Blissey with Dark Pulse. Thunder Wave is an option to hinder attackers such as Garchomp, Tornadus-T, and Latias, although Toxic is generally the more reliable status move for Blissey. 8 HP / 252 Def / 248 SpD is an alternative EV spread that allows Blissey to more reliably wall special attackers at the cost of some physical bulk. Blissey can run Aromatherapy and Toxic to gain a Grass / Poison typing, which allows it to wall metagame threats such as Latias, Cresselia, and Electric / Fairy Clefable. However, outside of walling these threats, that typing is not a desirable defensive typing.</p> <h1>Checks and Counters</h1> <p><strong>Knock Off: Knock Off users such as Tornadus-T, Landorus-T, and Heracross as well as Clefable and Toxpex can threaten Blissey. On top of Psychic-type variants being weak to Dark-type attacks, Blissey generally relies on Heavy-Duty Boots to remain healthy while entry hazards are on the field, so it fears Knock Off from any Pokemon.</p> <p><strong>Poison- and Steel-type Pokemon: Poison- and Steel-type setup sweepers with recovery such as Latias, Cresselia, Buzzwole, and Hydreigon make it difficult for Blissey to make progress, as it cannot cripple them with Toxic or do enough damage to stop these threats with Seismic Toss.</p> <p><strong>Lycanroc-D: Lycanroc-D is able to threaten Blissey with Tough Claws-boosted STAB Crunch and has a variety of typings that can make it difficult for Blissey's partners. Even pure Normal-type Blissey is vulnerable to STAB Close Combat from some Lycanroc-D.</p> <p><strong>Strong Physical Attackers</strong>: Strong physical attackers such as Lycanroc-D, Pheromosa, and Scizor can all break through Blissey with ease.</p> <p><strong>Taunt: Since Blissey is passive and heavily reliant on chipping foes with Toxic and pivoting with Teleport, Taunt is a strong option to exploit it.</p> ",
    "sets": [
      {
        "name": "Teleport",
        "description": "<p>Blissey is a potent wall in the metagame thanks to its high HP stat and access to recovery and Teleport. Teleport allows Blissey to safely pivot into other teammates and makes it more difficult for opposing Pokemon to take advantage of its passive nature. Soft-Boiled is Blissey's main form of recovery and allows it to stay healthy while checking threats such as Volcarona and Latias. These two move options give Blissey a Normal / Psychic typing, which grants it an immunity to Ghost-type attacks and causes it to take neutral damage from Focus Blast. Heal Bell is another option that gives Blissey a pure Normal typing, provides a neutrality to U-turn and Knock Off, and lets it act as a cleric. Seismic Toss provides valuable chip damage against offensive Pokemon such as Dragapult, Landorus-T, and Pheromosa. Toxic is used to to put foes on a timer while allowing Blissey to check setup sweepers with recovery such as Volcarona, Mew, and Tornadus-T. Stealth Rock is an alternate option that allows Blissey to fill the role of a entry hazard setter. On pure Normal-type Blissey sets, Teleport is used in the last move slot to ensure Blissey can still pivot against foes. Natural Cure, in conjunction with Heavy-Duty Boots, keeps Blissey healthy from status and entry hazards throughout the match.</p> <p>Physically defensive Pokemon like Slowbro, Cresselia, and Clefable appreciate Blissey's ability to wall strong special attackers such as Dragapult and Latias. In return, these physical walls are able to check physical attackers that threaten Blissey such as Lycanroc-D, Arcanine, and Landorus-T. Strong attackers such as Lycanroc-D, Dragapult, and Latios appreciate Blissey's ability to pivot them in safely with Teleport, which allows them to capitalize on their wallbreaking capabilities. Dark-resistant partners such as Clefable and Dark-type Toxapex are necessary, as Blissey is vulnerable to Knock Off.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410702, "username": "a loser"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 324242, "username": "In The Hills"}]}
  },
  "Entei": {
    "comments": "<h1>Other Options</h1> <p>Silk Scarf boosts the power of Extreme Speed and prevents Entei from being Choice locked. Flare Blitz has more power than Sacred Fire and has perfect accuracy, but the recoil and lower burn chance make it a more risky option. Double-Edge can be used for immediate power, although the recoil is a downside that reduces Entei's already poor longevity. Stomping Tantrum is an option, either as a coverage move or a STAB attack to provide a Normal / Ground typing, that allows Entei to hit checks with Flash Fire such as Heatran, although this option is significantly weaker than Sacred Fire. Facade is a stronger option than Double-Edge if Entei is statused, but it otherwise lacks immediate power.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Bulky Water-types such as Slowbro, Mew, Galarian Slowking, and Toxapex are the most widespread check to Entei, as they resist Entei's strongest STAB attack, comfortably tank Extreme Speed, and threaten to KO back.</p> <p><strong>Salamence: Despite Entei's Intimidate immunity, Salamence is still a solid check to it with Dragon / Ghost and Water / Ground typings; however, Entei's Howl sets can be problematic for Dragon / Ghost Salamence.</p> <p><strong>Hippowdon</strong>: Rock-type Hippowdon is one of the most reliable switch-ins to Entei in the metagame, although it doesn't appreciate being inflicted with status through Sacred Fire and especially Toxic.</p> <p><strong>Flash Fire Steel-types</strong>: Flash Fire users such as Heatran and Coalossal are solid check to Entei thanks to their resistance to Normal and immunity to Fire-type attacks. These two threats typically run a Ground / Steel typing or coverage moves to KO Entei.</p> ",
    "sets": [
      {
        "name": "Extreme Speed",
        "description": "<p>Entei is a powerful attacker that utilizes STAB Extreme Speed to threaten a large portion of offensive Pokemon. Sacred Fire is Entei's secondary STAB attack and allows it to hit Steel-types such as Mew, Reuniclus, and Magearna. Additionally, Sacred Fire's high burn chance can hinder switch-ins and deter physical attackers from directly switching in. Crunch helps against Fire-resistant Ghost-types such as Slowbro, Galarian Slowking, and Salamence. Stone Edge is useful coverage that hits Fire-types like Latias, Arcanine, and Volcarona, although its low accuracy can be a hindrance. Alternatively, Toxic can be used as the last slot on Choice Band sets, as it allows Entei to inflict poison on foes such as Slowbro, Mew, and Salamence. Choice Band is prefered for immediate power, although Entei can also run Heavy-Duty Boots in conjunction with Howl to act as a setup sweeper. Inner Focus grants Entei an immunity to Intimidate, allowing it to deal normal damage to Landorus-T and Salamence.</p> <p>Latios, Tornadus-T, and Hydreigon appreciate Entei's ability to pressure specially defensive walls like Unaware Clefable and Blissey; in return, they are able to pressure physical walls such as Mew and Toxapex. Spectrier in particular is a great partner to Entei, as it heavily pressures Entei's Ghost-type checks. Rillaboom, Volcarona, and Zarude can utilize their Grass typing to break past bulky Water-types that threaten Entei, particularly Mew, Galarian Slowking, and Salamence. Entei is vulnerable to Stealth Rock, so it is important to have some form of entry hazard control; offensive Defoggers such as Tornadus-T and Landorus-T are some of the best options to fill this role.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410702, "username": "a loser"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 324242, "username": "in the hills"}]}
  },
  "Salamence": {
    "comments": "<h1>Other Options</h1> <p>Salamence can run Aqua Tail and Shadow Claw together to have a useful Water / Ghost typing that can handle Fighting-, Fire-, and Normal-type attacks like Close Combat, V-create, and Facade, but this typing leaves it vulnerable to Electric-type attacks from Victini. An alternative spread of 252 HP / 4 Def / 252 Spe with a Jolly nature can be used to outspeed foes like Haxorus, Porygon-Z, and Urshifu-S to attack and potentially KO them first, but it comes at the cost of losing valuable bulk and the ability to switch into high-powered attacks like Heracross's Facade as easily.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers: Salamence has decent bulk, but investment in Defense leaves it open to big hits from strong special attackers like Hydreigon, Latios, and Porygon-Z.</p> <p><strong>Latias: Latias outspeeds Salamence, can threaten most of its sets with Toxic, has Levitate to avoid Earthquake, and has good Special Attack to pressure it. Latias commonly runs a Water / Poison typing, which resists Salamence's best STAB options when aided by Levitate.</p> <p><strong>Exceptionally Strong Physical Attackers</strong>: Although Intimidate helps to check most physical attackers, already strong foes with high-powered moves like Facade Heracross and Close Combat Lycanroc-D can potentially threaten Salamence if it takes neutral damage from them, especially if they have a chance to boost their Attack with Swords Dance.</p> ",
    "sets": [
      {
        "name": "Bulky Utility",
        "description": "<p>Salamence's decent bulk and access to Intimidate, Defog, and reliable recovery make it a solid physical wall in the metagame. Aqua Tail and Earthquake grant Salamence a Water / Ground typing, which helps it check wallbreakers like Entei and Victini. A part-Ground typing lets Salamence resist Stealth Rock and serve as a solid Defog user. Wish is another utility option that takes advantage of Salamence's ability to force switches with Intimidate and heals its teammates. Dragon Tail + Shadow Claw can be run instead of Aqua Tail + Earthquake; the resulting Dragon / Ghost typing lets Salamence play a similar role but has a few different resistances and immunities, allowing it to better check threats like Extreme Speed users, Cinderace, and Rillaboom while remaining an Electric- and Fire-resistant Pokemon. Dragon Tail offers good utility and keeps Salamence from being set up on. The Dragon / Ghost set is less threatening offensively due to its lower Base Power moves, but Salamence's Attack keeps it from being passive, even without investment. Rocky Helmet is Salamence's most effective item, as it punishes the physical attackers it aims to keep in check.</p> <p>Fast, frail attackers like Dragapult, Naganadel, and Pheromosa are vulnerable to being revenge killed by Extreme Speed users, so they appreciate having Salamence as a teammate to check these threats and chip them with Rocky Helmet. Water / Ground Salamence pairs well with specially attacking setup threats like Latias and Volcarona, as it can pressure Unaware Clefable with Earthquake and open up setup opportunities. Entry hazard setters like Garchomp and Mew benefit from Dragon / Ghost Salamence phazing and further chipping foes with passive damage. Salamence's defenses and Intimidate drops can be overcome by Pokemon like Swords Dance Garchomp, Heracross, and Lycanroc-D. Therefore, Salamence benefits from physically defensive teammates like Steel / Flying Buzzwole, Ghost / Fairy Cresselia, and Ghost / Fighting Slowbro to help keep these threats in check.</p> "
      },
      {
        "name": "Defensive Steel-type",
        "description": "<p>Iron Tail and Roost grant Salamence a Steel / Flying typing and allow it to take on physical threats like Garchomp, Facade Heracross, and Rillaboom. Iron Tail is Salamence's primary STAB attack; it has high Base Power with unreliable accuracy, which is somewhat patched up by Defog lowering foes' evasion. Roost is needed to keep Salamence healthy. Being neutral to Stealth Rock and immune to Spikes makes Salamence a solid Defogger, but Dual Wingbeat is another option if a teammate can clear entry hazards to give it a more reliable attack option with its secondary STAB type. Dragon Tail forces out setup threats like Swords Dance Heracross, Lycanroc-D, and Rillaboom. Wish can also be used to help keep Salamence's teammates healthy. Rocky Helmet punishes the physical attackers that Salamence aims to check, but Leftovers can be used for passive recovery as well.</p> <p>Fast, frail attackers like Dragapult, Naganadel and Pheromosa are vulnerable to being revenge killed by Extreme Speed users, so they appreciate having Salamence as a teammate to check these threats and chip them with Rocky Helmet. Entry hazard setters like Garchomp and Mew benefit from Dragon Tail Salamence phazing and further chipping foes with passive damage. With only two weaknesses in Electric and Fire, Salamence appreciates bulky resistant Pokemon like Fairy / Electric Clefable and Water / Ground Mew to cover these weaknesses and check threats like Victini. Salamence is prone to strong neutral attacks from special attackers like Porygon-Z and Spectrier; therefore, specially defensive teammates like Blissey and RegenVest Tornadus-T are helpful.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "In The Hills"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Latias": {"sets": [{"name": "Calm Mind"}, {"name": "Bulky Defog"}]},
  "Latios": {"sets": [{"name": "Calm Mind"}]},
  "Garchomp": {
    "comments": "<h1>Other Options</h1> <p>Garchomp can run Poison Jab in combination with Aqua Tail for a Water / Poison typing, which gives it a better matchup against Fighting-types such as Landorus-T and Lycanroc-D. Steel / Dark Garchomp with Crunch can be run as well for an option to hit Ghost-types like Latias, Blissey, and Slowbro, though this option is highly susceptible to Fighting-type attacks. An alternative EV spread of 252 HP / 252 Def / 4 SpD is an option to maximize Garchomp's capabilities as a physical wall, though it loses a lot of offensive utility in the process. Scale Shot can be used as an alternative to Outrage on Dragon-type sets so that it can boost its Speed and potentially sweep.</p> <h1>Checks and Counters</h1> <p><strong>Rillaboom: Rillaboom is able to heavily pressure Garchomp's Ground-type sets with Grassy Glide, though it struggles more against Dragon / Steel Garchomp.</p> <p><strong>Bulky Water-types</strong>: Bulky Water-types like Mew, Slowbro, and Salamence are able to switch into Garchomp comfortably, though they may be susceptible to Swords Dance. Salamence is especially well suited to beat Garchomp, as it has access to Defog.</p> <p><strong>Latias: Water / Poison Latias is a solid check to Garchomp, as it resists both of its STAB options on most sets, and can pressure it with either Surf or Toxic. Latias can also run Water / Dragon sets, which pressure Garchomp's sets as well. Latias does struggle a good deal with Dragon / Steel Garchomp however, as this set resists Surf and is immune to Toxic.</p> <p><strong>Faster Attackers</strong>: Faster attackers are generally the most common way to beat Garchomp, though they may not be able to switch into it. Pokemon such as Latios, Spectrier, and Tornadus-T, as well as many others, are able to threaten to revenge kill Garchomp, though most cannot OHKO it.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Garchomp is a powerful physical attacker that is able to set entry hazards and pressure opposing Defog users with its high Attack stat and wide array of STAB options. Water / Ground Garchomp is the most prevalent set and utilizes Aqua Tail and Earthquake for this typing; this typing allows it to beat Victini and check Electric-types like Clefable. Aqua Tail enables it to hit Ground-immune Fire-types such as Hydreigon, Latias, and Tornadus-T. Iron Head can be used for a Ground / Steel typing to provide Garchomp with an immunity to Toxic, which allows it to beat bulkier setup sweepers, particularly Cresselia. Outrage can be used on both Steel / Dragon and Water / Dragon Garchomp to allow it to break past Water-types like Slowbro, Mew, Toxapex, and Latias once it has set up on them with Swords Dance, though this move should be used in combination with Lum Berry to prevent being inflicted with confusion. Swords Dance allows Garchomp to break past threats like Slowbro and Salamence and threaten Defog users like Mew, Tornadus-T, and Latias. Stealth Rock allows Garchomp to further pressure teams with chip damage. Garchomp is a particularly potent Stealth Rock user due to its ability to pressure the aforementioned Defog users and keep its entry hazards on the field. Rocky Helmet is used in conjunction with Rough Skin on most sets to deal massive damage to physical attackers like Landorus-T, Pheromosa, and Lycanroc-D. A Jolly nature is used to outspeed Pokemon such as Volcarona, offensive Mew, and Hydreigon.</p> <p>Garchomp is able to pressure Fire-types like Heatran, Hydreigon, and Victini, which benefits bulky Steel-type partners. Steel / Flying Mew is a particularly good partner for Garchomp, as the two can form an entry hazard core with Garchomp's Stealth Rock and Mew's Spikes. Garchomp is highly susceptible to Rillaboom and appreciates partners that can handle it such as Tornadus-T and Landorus-T; these two are able to provide Defog support for the team as well. Special attackers such as Latias, Spectrier, and Tornadus-T appreciate Garchomp's ability to pressure Poison / Dark Clefable, Toxapex, and opposing Tornadus-T, as they struggle to break past these specially defensive walls. In return, they are able to pressure Garchomp's checks as well, like Slowbro and Salamence.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410702, "username": "a loser"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 324242, "username": "in the hills"}]}
  },
  "Lucario": {"sets": [{"name": "Extreme Speed"}]},
  "Heatran": {"sets": [{"name": "Offensive Rocks"}]},
  "Cresselia": {
    "comments": "<h1>Other Options</h1> <p>Cresselia can pass on a more useful defensive typing by running Stored Power to capitalize on Calm Mind boosts. However, this set is very slow and opens Cresselia up to crippling status moves like Toxic. Cresselia can also forego Calm Mind and use Trick instead to cripple opposing defensive Pokemon with its Black Sludge and provide counterplay to opposing Trick users. However, this is inconsistent, since many defensive threats hold Black Sludge as well, and an incorrect timing of the move could result in Cresselia holding undesirable items like a Choice Scarf. Cresselia's great bulk and access to recovery also make it a reliable Trick Room setter to support slower offensive teammates like Glastrier and Melmetal.</p> <h1>Checks and Counters</h1> <p><strong>Mold Breaker Ground-types and Thousand Arrows: Earthquake Haxorus and Excadrill are big threats to Cresselia, as their ability Mold Breaker allows them to hit with a super effective STAB move. Thousand Arrows from Zygarde-10% also bypasses Levitate. However, none of these threats are able to OHKO Cresselia without boosting to at least +2 Attack.</p> <p><strong>Steel-types: Cresselia is walled and forced out by offensive and defensive Steel-types like Mew, Hydreigon, Garchomp, and Melmetal. They are immune to Toxic, resist Cresselia's main STAB move, and can punish it with their Steel-type STAB attacks.</p> <p><strong>Psychic-types: Psychic-type attackers like Tapu Lele and Psychic Volcarona threaten out Cresselia's Toxic set and can hit other sets for strong neutral damage.</p> <p><strong>Clefable: Cresselia is forced out by all versions of Clefable. Dark / Poison Unaware Clefable ignores Calm Mind boosts and can't be poisoned, while offensive Magic Guard Clefable can set up with Calm Mind and quickly use up Cresselia's Moonlight PP.</p> ",
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<p>Cresselia's impressive bulk and useful ability in Levitate along with access to reliable recovery, status, and setup moves make it a defensive behemoth that is difficult to wear down and break through. Its Poison typing from Toxic pairs nicely with Levitate, making it immune to both the poison status and Ground-type attacks while leaving it with only two weaknesses. Toxic puts offensive threats like Fire / Grass Volcarona and Hydreigon on a timer to prevent them from using setup moves effectively. Moonblast is a spammable attack that grants Cresselia a Fairy typing, which gives it an immunity and stacks useful resistances with its Poison typing. Moonlight is Cresselia's reliable recovery and keeps it healthy. Calm Mind keeps Cresselia from being overly passive and allows it to set up on other passive Pokemon like Blissey and Slowbro, or boost alongside opposing Calm Mind users like Electric / Dragon Latios, wearing all the aforementioned Pokemon down with Toxic as it sets up. Thunder Wave is another option that punishes offensive threats that Toxic can't, like Poison-type Garchomp, Latias, and Naganadel. It provides a great defensive typing with only one weakness thanks to Levitate and useful resistances to Flying- and Electric-type attacks that Toxic variants take neutral damage from. Shadow Ball gives Cresselia another unique typing with multiple immunities, mainly to high-powered Normal-type attacks like Extreme Speed, Facade, and Boomburst. It also allows Cresselia to have more coverage when it sets up with Calm Mind, but it makes Cresselia vulnerable to Ghost-type STAB moves like Shadow Claw and Shadow Ball, which are commonly seen on Facade and Boomburst users like Heracross and Noivern. Black Sludge is the item of choice for Poison-type Cresselia, as it increases Cresselia's longevity and punishes Trick users, while other Cresselia sets opt for Leftovers. A Bold nature with full investment in HP and Defense allows Cresselia to take on numerous physical attackers like Landorus-T, Lycanroc-D without Iron Head, and most unboosted Extreme Speed users outside of Zygarde-10% with Thousand Arrows.</p> <p>While Cresselia is bulky, it is still vulnerable to high-powered neutral attacks like Guts-boosted Facade from Heracross and Triple Axel from Choice Band Pheromosa. Each of these attacks can 2HKO Cresselia with prior damage, so it is important to pair Cresselia with teammates that can stomach these hits like defensive Water / Poison Slowbro and Normal-resistant Pokemon such as Steel-type Buzzwole. These teammates also help cover Cresselia's few remaining weaknesses to types like Poison, Psychic, or Steel, depending on Cresselia's typing. Magnezone can pair with Cresselia to trap and eliminate Steel-types like Buzzwole and Scizor. While Cresselia can use Calm Mind to combat certain opposing setup threats, others like Psychic Volcarona and Taunt Spectrier can quickly overwhelm it. Defensive Dark / Poison Pokemon such as Unaware Clefable and Toxapex make great partners for Cresselia to handle the setup threats that can break past it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Victini": {
    "comments": "<h1>Other Options</h1> <p>Calm Mind Victini with Fire / Electric, Fire / Fighting, or Fire / Fairy typing is an alternative to Choice item sets, though it is generally outclassed by other special Fire-types like Volcarona, Clefable, and Latias. Special sets have a wide array of coverage as well that can fit most teams, and utility options like Taunt, Encore, and Substitute can be used as well.</p> <h1>Checks and Counters</h1> <p><strong>Dragon-types: Dragon-types like Dragapult, Latios, and Dragon / Fairy Necrozma are all solid checks to Victini, as they resist both of Victini's STAB attacks and can threaten to KO in return.</p> <p><strong>Flash Fire Pokemon: Flash Fire Pokemon such as Heatran and Coalossal are able to hinder Victini's progress substantially; both of these Pokemon generally run a Ground typing, making them immune to both of Victini's STAB attacks, and can threaten to OHKO in return.</p> <p><strong>Water / Ground Pokemon: Pokemon with a Water / Ground typing, such as Mew, Garchomp, Hydreigon, and Volcanion, all are able to check Victini, and Garchomp in particular is a potent offensive check due to its Speed stat and residual damage from Rough Skin and Rocky Helmet.</p> ",
    "sets": [
      {
        "name": "Choiced Attacker",
        "description": "<p>With solid Attack and Speed stats along with access to strong attacks and pivoting, Victini acts as a strong Choice item breaker in the metagame. V-create is extremely strong and allows Victini to break through the majority of non-resisted targets. Bolt Strike is Victini's secondary STAB attack that enables it to hit Pokemon resistant to Fire such as Toxapex, Poison / Water Latias, and Fire / Flying Tornadus-T super effectively. U-turn is a utility option that allows Victini to gain momentum against switch-ins. Trick is used to hinder walls like Mew, Toxapex, and Latias, though it runs the risk of recieving Black Sludge in return. Final Gambit is an option on Choice Scarf Victini that allows it to quickly remove walls like Heatran and Coalossal, though an alternative spread of 252 HP / 4 Atk / 252 Spe is recommended with this move option. Toxic can be used to status checks such as Mew and Necrozma and make it easier for Victini to break them. Choice Band is the primary item choice for Victini to maximize its breaking power, though Choice Scarf let's it outspeed the metagame's faster threats like Latias, Dragapult, and Naganadel. A Jolly nature and maximum Speed are necessary for Choice Scarf Victini to outspeed these threats; similarly, Choice Band runs the same spread to outpace threats such as Hydreigon, Urshifu-S, and Tapu Lele.</p> <p>Victini is able to capitalize on its few switch-ins with U-turn, so strong special attackers like Latios, Dragapult, and Tornadus-T are able to pressure Victini's checks; physical walls such as Water / Ground Mew and Ground / Steel Heatran are OHKOed by these partners. Rillaboom is another partner that can capitalize on Victini's Ground-type checks, while Victini can threaten Rillaboom's checks in return. Victini is great at breaking Steel-types, so it pairs well with breakers that struggle against those, such as Tapu Lele and Cresselia. Victini is able to apply a lot of pressure with the support of entry hazards, so Mew, Lycanroc-D, and Garchomp are good partners. It's important to pair Victini with some form of hazard control, so partners like Latias, Excadrill, Mew, and Tornadus-T fill that role. Choice Band Victini is vulnerable to faster threats like Lycanroc-D, Latios, and Dragapult, so having checks for those is important; Fairy / Dragon Necrozma in particular checks a large portion of Victini's offensive checks and is able to provide Stealth Rock support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410702, "username": "a loser"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 324242, "username": "In The Hills"}]}
  },
  "Haxorus": {"sets": [{"name": "Choice Band"}]},
  "Hydreigon": {
    "comments": "<h1>Other Options</h1> <p>Nasty Plot sets can run Dark Pulse and Flash Cannon for a Steel / Dark typing, which allows Hydreigon to check Ghost-types like Spectrier. Hydreigon can run Hydro Pump as a STAB move for more power, though the lower accuracy and PP make Surf the preferable. Focus Blast allows Hydreigon to hit Normal-type Blissey super effectively, though its low accuracy makes it an inconsistent choice. Taunt can be used over Roost for a stallbreaker set; this allows Hydreigon to restrict Pokemon like Mew, Blissey, and Unaware Clefable.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Hydreigon's Speed tier is rather low, so faster Pokemon such as Latios and Lycanroc-D are able to pressure Hydreigon and prevent it from sweeping.</p> <p><strong>Rillaboom: Rillaboom's Grassy Glide easily and stop Hydreigon from sweeping, though Dragon / Steel sets resist it. However, Dragon / Steel sets are unable to switch into Rillaboom because it generally runs a Grass / Fighting typing.</p> <p><strong>Latias</strong>: Latias checks the majority of Hydreigon's sets with its high special bulk, solid defensive typings, and Levitate, though Dragon / Steel Hydreigon is able to beat it.</p> <p><strong>Blissey</strong>: Blissey is a solid switch-in to most Hydreigon sets, though it needs Toxic to chip it or Teleport to pivot to an offensive check to actually beat Hydreigon. Additionally, Toxic Blissey is setup fodder for Steel-type Hydreigon.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Hydreigon is a powerful setup sweeper that is able to utilize strong STAB attacks, primarily Earth Power, to break through teams. Hydreigon usually complements Earth Power with Fire Blast, granting it a Ground / Fire typing and allowing it to beat Steel / Flying types such as Mew, Scizor, and Salamence. Surf is another option for a better matchup against Water-types like Garchomp and Mew. Flash Cannon grants Hydreigon an immunity to Toxic, which makes breaking past Blissey and Cresselia much easier. Draco Meteor is another option for Hydreigon's primary STAB move and pairs well with Surf and Flash Cannon; Steel / Dragon Hydreigon in particular is a great check to Water / Poison Latias and Water / Ground Garchomp. Roost allows Hydreigon to make use of its decent bulk and stay healthy against bulkier threats such as Mew and Latias. Nasty Plot is a tool to break past special walls such as Blissey and Assault Vest Slowking. Fire / Dragon Hydeigon can be used, though it requires Heavy-Duty Boots to nullify Stealth Rock damage. Life Orb further boosts Hydreigon's power at the cost of recoil, so it's important to keep Hydreigon healthy throughout the match; alternatively, Leftovers can be used for passive recovery. Levitate makes Hydreigon immune to Ground-type attacks, which complements the majority of its typings.</p> <p>Hydreigon has a wide array of typings it can run, so physical attackers such as Lycanroc-D and Rillaboom appreciate its ability to cover nearly every physical wall in the metagame, particularly Mew, Electric / Fairy Clefable, and Slowbro. Bulky Steel-types appreciate Hydreigon's ability to check Fire-types like Victini, Heatran, and Clefable. Faster attackers like Lycanroc-D, Dragon-type Garchomp, and Latios can be threatening to Hydreigon, so it's important to have a switch-in to these threats or revenge killers like Arcanine, Rillaboom, and Choice Scarf Landorus-T. Most Hydreigon sets are vulnerable to Toxic damage, so Steel- and Poison-types like Latias, Tornadus-T, Mew, and Reuniclus make for great partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475804, "username": "The Number Man"}, {"user_id": 410702, "username": "a loser"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 324242, "username": "In The Hills"}]}
  },
  "Volcarona": {"sets": [{"name": "Quiver Dance"}]},
  "Tornadus-Therian": {
    "comments": "<h1>Other Options</h1> <p>Tornadus-T can run a Dark / Poison typing with Black Sludge on Defog sets, but this misses out on added bulk from Assault Vest and loses offensive presence that Hurricane and Heat Wave offer. Both Defog and RegenVest sets can make good use of Steel / Bug, Fighting / Bug, and Fighting / Dark typings by utilizing Tornadus-T's vast physical movepool and solid Attack. Iron Tail has unreliable accuracy but gives Tornadus-T a great defensive type in Steel. U-turn in the first two slots gives it slightly more power as a pivot, but a Bug typing is generally less useful than a Flying typing. Superpower is Tornadus-T's strongest viable physical move and can heavily dent foes expecting Focus Blast, but it is inconsistent due to the drops in Attack and Defense after using it. RegenVest sets can run a fully defensive spread of 252 HP / 4 Def / 252 SpD and a Calm nature to better check special attackers and offer a slower pivot, but these sets are left outpaced by threats like Hydreigon, Porygon-Z, and Tapu Lele. Nasty Plot sets can run a Fighting / Fire typing with Focus Blast and Heat Wave, but these sets lose out on the defensive utility that Hurricane's Flying typing offers. Nasty Plot sets can also run Taunt to cripple and break past typical checks like Unaware Clefable and Blissey, or Knock Off to punish Blissey and other special walls. Another set option that handles fast threats is Choice Scarf Tornadus-T with Superpower and Knock Off, with Choice Scarf helping it outspeed threats like Swift Swim Drednaw and Kingdra as well as other Choice Scarf users like Latios. However, being locked into a move makes Tornadus-T harder to use as a pivot in most other situations.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Faster foes including Dragapult, Pheromosa, and Spectrier each have methods of threatening Tornadus-T's various sets. Dragapult can heavily damage even RegenVest Tornadus-T with its Choice Specs sets. Pheromosa's Ice-type STAB move of choice can KO Flying-type sets. Spectrier can cripple Tornadus-T with Will-O-Wisp and Taunt while threatening non-RegenVest sets with its Ghost- and Dark-type STAB moves.</p> <p><strong>Unaware Clefable: Tornadus-T is unable to break past specially defensive Clefable and risks losing its held item or being poisoned via Toxic if it stays in or uses Defog in front of it.</p> <p><strong>Stealth Rock</strong>: Although Flying-type Tornadus-T uses Heavy-Duty Boots to avoid Stealth Rock damage, it is prone to Knock Off opening up its crippling Stealth Rock weakness that can severely limit its performance.</p> ",
    "sets": [
      {
        "name": "Defog Pivot",
        "description": "<p>Tornadus-T's great Speed, incredible ability in Regenerator, and deep movepool make it a highly versatile and useful threat in the metagame. Heat Wave and Hurricane combine for a great offensive and defensive typing that threatens a majority of the defensive metagame. Focus Blast is another option that gives Tornadus-T a great offensive typing but leaves it with more weaknesses and two inaccurate STAB moves. Defog paired with Regenerator makes Tornadus-T one of the best entry hazard removers available. U-turn turns Tornadus-T into a powerful pivot that helps its teammates gain momentum. Heavy-Duty Boots patches up Heat Wave Tornadus-T's huge weakness to Stealth Rock and allows it to be an effective Defogger and pivot. Focus Blast sets can opt for Rocky Helmet to chip foes, since they are neutral to Stealth Rock. A Timid nature with full investment in Speed is needed to outspeed threats like Alakazam, Lycanroc-D, and Latios.</p> <p>Tornadus-T is generally walled by specially defensive Pokemon like Blissey, Clefable, and RegenVest Reuniclus, so strong physical attackers like Lycanroc-D and Pheromosa are good teammates that can pressure them. Losing Heavy-Duty Boots heavily cripples Tornadus-T and affects its role as a Defogger, so a Knock Off sponge like Clefable, Dark-type Toxapex, or Garchomp that can brush off the hit and, in Garchomp's case, punish the user with Rocky Helmet and Rough Skin, is useful. Faster foes like Choice Band Pheromosa can 2HKO Tornadus-T with a resisted Close Combat or OHKO it with Triple Axel, so a physically defensive teammate like Water / Ghost Slowbro or Salamence can check Pheromosa and chip it with Rocky Helmet. Other fast Pokemon like Dragapult threaten Tornadus-T with super effective STAB moves like Thunderbolt and Hydro Pump, and Dragapult OHKOes it with a Choice Specs-boosted Draco Meteor; partners like Blissey and Dark / Poison Toxapex can easily switch into Dragapult's attacks to scout its set and potentially punish it with status moves or set entry hazards.</p> "
      },
      {
        "name": "RegenVest Pivot",
        "description": "<p>Assault Vest and Regenerator combine to make Tornadus-T into a bulky pivot with great longevity, while Knock Off and Sludge Bomb give it an incredible Dark / Poison defensive typing that leaves it with only one weakness. Knock Off offers great utility that punishes common Tornadus-T switch-ins like Blissey, Mew, and RegenVest Reuniclus, leaving them more vulnerable to chip damage and its teammates. Sludge Bomb has solid power and a high chance to poison foes like Mew and Salamence that don't appreciate added residual damage. U-turn allows Tornadus-T to serve as a pivot and bring teammates in while healing with Regenerator. Since Tornadus-T's STAB moves are walled by most Steel-types, Heat Wave targets foes like Steel / Flying Buzzwole and Steel / Fairy Magearna, while Focus Blast covers Flash Fire Steel-types like Coalossal and Heatran. Assault Vest allows Tornadus-T to better check special attackers like Choice Specs Dragapult and Volcarona. A Timid nature is needed to outspeed Alakazam and Latios and Speed tie with Naganadel.</p> <p>Physical attackers like Lycanroc-D, Victini, and Garchomp appreciate Tornadus-T removing foes' Rocky Helmets to increase their chances to do damage over a long battle. Entry hazard setters like Mew and Toxapex benefit from Knock Off removing Heavy-Duty Boots, as it allows their entry hazards to chip the opposing team's entry hazard remover. Although Tornadus-T's bulk is increased from its Assault Vest, certain special attackers can 2HKO it on favorable rolls, like Choice Specs Dragapult with Draco Meteor, so another specially defensive teammate like Blissey or Slowking can help check these threats. With Ground being its only weakness, Tornadus-T benefits from Levitate and Flying-type teammates like Cresselia, Hydreigon, Latias, and Buzzwole to take on Ground-type foes.</p> "
      },
      {
        "name": "Nasty Plot Pivot",
        "description": "<p>Nasty Plot adds another dimension to Tornadus-T's versatility, allowing it to rapidly boost its Special Attack to break past foes that normally check it, like Blissey and RegenVest Slowking. Using its deep movepool, Tornadus-T can make great use of Fire / Flying and Dark / Poison typings to have solid offensive and defensive presence and still act as a pivot with U-turn when needed. Nasty Plot makes Tornadus-T very threatening to slower foes like Cresselia, Latias, and Mew that normally can handle its unboosted attacks. Heavy-Duty Boots keeps Flying-type variants healthy and allows Tornadus-T to appear like the usual Defog set before revealing Nasty Plot. Black Sludge is an option on Sludge Bomb sets to give Tornadus-T passive recovery alongside Regenerator. A Timid nature with full investment in Speed lets Tornadus-T outspeed Latios, Lycanroc-D, and Cinderace.</p> <p>Bulky teammates like Clefable, Mew, and Toxapex appreciate Nasty Plot Tornadus-T's ability to pressure and threaten the slower offensive wallbreakers that can give them trouble, like Hydreigon, Latios, and Choice Band Victini. In return, these Pokemon can set entry hazards, remove items, and cripple the opposing team with status moves to give Tornadus-T more opportunities to set up and do damage. These teammates also help check the foes that outspeed and threaten Tornadus-T like Dragapult and Spectrier.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475804, "username": "The Number Man"}, {"user_id": 324242, "username": "In The Hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 57429, "username": "Finland"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Landorus-Therian": {
    "comments": "<h1>Other Options</h1> <p>Choice Scarf Landorus-T has the option of running Stone Edge to hit Flying- and Fire-types like Mew, Latias, and Arcanine. Landorus-T can opt to run an offensive Swords Dance set with a Ground / Dark typing to break through a large portion of the metagame; while this set makes Landorus-T a terrifying wallbreaker, it usually needs extensive team support to sweep effectively. Defensive Landorus-T can run a Steel / Flying typing with Iron Tail and Defog for the immunity to Ground-type attacks, although this set is mostly outclassed by Steel / Flying Mew and Salamence.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Flying-types like Tornadus-T and Mew are the most reliable checks to Landorus-T, as they take minimal damage from its STAB attacks and threaten to OHKO almost all of its variants.</p> <p><strong>Poison-types: Bulky Poison-types such as Latias, Cresselia, Galarian Slowking, and Toxapex are able to switch into Landorus-T with minimal risk, but they must be wary of Choice Scarf Landorus-T if they are weakened.</p> <p><strong>Fire-types: Fire-types like Victini, Hydreigon, and Heatran are able to threaten Landorus-T with an OHKO, though Choice Scarf Landorus-T can threaten them if chipped.</p> <p><strong>Fairy-types: Defensive Fairy-types like Clefable and Mew are able to wall Landorus-T easily, while offensive Fairy-types like Lycanroc-D and Alakazam can threaten to KO it.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Landorus-T is a versatile wall that utilizes STAB U-turn to damage foes and provide momentum for its team. Superpower completes its Bug / Fighting typing, which allows it to check threats such as Rillaboom and Lycanroc-D. Iron Tail is an alternative that gives Landorus-T a Bug / Steel typing; this option allows it to properly check Heracross and Cresselia, although it cannot properly check the aforementioned threats that Bug / Fighting sets can. Knock Off acts as both a solid coverage option that hits Ghost-types like Latias, Blissey, and Reuniclus, and a support tool that removes items. Stealth Rock is an option to damage foes on the switch in and pairs well with Knock Off removing Heavy-Duty Boots. Landorus-T does struggle against some common Defoggers such as Latias, Mew, and Salamence, so Defog can be used instead if you have another Stealth Rock user on your team. Rocky Helmet is useful for chipping down foes like Rillaboom, Lycanroc-D, and Heracross, while Leftovers can be used for passive recovery. 16 Speed EVs ensure that Landorus-T can outspeed maximum Speed neutral-natured threats like Tyranitar, Clefable, and Aegislash.</p> <p>Strong special wallbreakers such as Latias, Latios, Hydregion, and Tornadus-T appreciate Landorus-T's entry hazards and U-turn support; Landorus-T can pivot against checks like Slowbro and Mew and bring in these partners to threaten them. Landorus-T is a solid check to Rillaboom, so bulky Water-types like Mew, Slowbro, Salamence, and Latias make good partners and check Fire-types that threaten Landorus-T in return. Landorus-T is weak to Flying- and Fairy-types such as Tornadus-T and Cresselia, so it appreciates support from Steel-types like Heatran, Reuniclus, and Mew. Even with Leftovers, Landorus-T is prone to being worn down, so partners with Wish such as Latias, Salamence, and Vaporeon are able to keep it healthy.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Landorus-T is a solid revenge killer that is able to OHKO offensive threats like Lycanroc-D and Pheromosa with its STAB attacks. Superpower is Landorus-T's main STAB attack and, in combination with U-turn, allows it to switch into and beat offensive threats like Rillaboom and Lycanroc-D, while Earthquake lets it beat Naganadel, Electric / Fairy Clefable, and Dark / Poison Tornadus-T. U-turn allows Landorus-T to gain momentum on potential switch-ins and chip them heavily. Knock Off is a useful coverage option that can remove items and allows Landorus-T to OHKO Ghost-type Latios and Heracross. Explosion is a useful tool that can OHKO a wide range of Pokemon in a pinch, but losing Landorus-T in the process makes this a risky option. Defog and Stealth Rock can also be useful options to control entry hazards on the field against faster teams, but they run the risk of losing momentum in the process. Maximum Speed investment and a Jolly nature in combination with a Choice Scarf are required to outspeed threats such as Spectrier and Pheromosa.</p> <p>Slower attackers such as Hydreigon, Heracross, and Choice Band Victini appreciate Landorus-T's ability to remove faster threats like Latios, Lycanroc-D, and Spectrier. In return, these partners act as strong wallbreakers that can get past physical walls that can easily switch into Landorus-T, namely Slowbro and opposing Landorus-T. Fighting-type Landorus-T is highly susceptible to defensive Poison-types, especially Latias, Cresselia, and Water / Poison Toxapex, so Psychic-types like Volcarona, Tapu Lele, and Reuniclus can help patch this weakness.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410702, "username": "a loser"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 324242, "username": "in the hills"}]}
  },
  "Lycanroc-Dusk": {
    "comments": "<h1>Other Options</h1> <p>Lycanroc-D can increase its damage output by running Iron Tail instead of Iron Head, but this has the cost of having unreliable accuracy. Drill Run is another coverage option that allows Lycanroc-D to hit defensive Steel- and Fire-types, but it is not as useful in a metagame where Flying-types and Levitate are common. A Rock-type Lycanroc-D with Accelerock provides alternate Tough Claws-boosted priority that can hit foes more reliably than Sucker Punch, but its power is much weaker and it leaves Lycanroc-D running Stone Edge, which isn't boosted by its ability and has shaky accuracy. Psychic Fangs allows Lycanroc-D to hit Poison-type walls like Cresselia and Latias reliably, but the prevalence of Dark-types in the metagame makes using this move harder to justify.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Poison-types: Bulky Poison-type Pokemon like Toxapex, Latias, and Cresselia each have methods of checking and stalling Lycanroc-D thanks to their access to recovery, useful abilities, and status-inflicting moves like Scald from Toxapex and Toxic from each.</p> <p><strong>Passive Damage: With Life Orb being its best item, Lycanroc-D is constantly chipping its own health. Outside of Steel-type variants, Lycanroc-D is open to chip damage from every entry hazard, and running contact moves to take advantage of Tough Claws means Rocky Helmet effectively punishes it. Too much chip damage over a battle can severely limit Lycanroc-D's opportunities to cause damage.</p> <p><strong>Extreme Speed</strong>: Although Steel-type Lycanroc-D resists Extreme Speed, all other variants take neutral damage from it and are easily 2HKOed by unboosted hits. +1 or Choice Band-boosted Extreme Speed from Adamant Entei or Lucario can OHKO Lycanroc-D with a favorable roll or after minor chip damage.</p> ",
    "sets": [
      {
        "name": "Physical Wallbreaker",
        "description": "<p>Lycanroc-D's good Attack is boosted even further by its great ability in Tough Claws. Combine this with its nice Speed, a plethora of strong physical contact moves, and access to priority, setup, and Stealth Rock, and it becomes one of the scariest wallbreakers in the metagame. Crunch grants Lycanroc-D a Dark typing and STAB on Sucker Punch. Iron Head notably covers the Fairy-types aiming to wall Dark-type moves while Play Rough covers the Dark- and Fighting-types hoping to check Dark-type attacks. Close Combat is a third option for the secondary STAB move that provides a much higher Base Power and hits Normal- and Steel-types even harder, but it leaves Lycanroc-D unable to hit Pokemon with Fairy and Poison typings, like Cresselia, as easily. Sucker Punch provides Lycanroc-D with powerful priority to take on faster offensive threats like Dragapult, Tornadus-T, and Naganadel. Lycanroc-D is a great Stealth Rock setter thanks to its breaking potential forcing the opponent to switch often. Swords Dance is another option that quickly makes Lycanroc-D even more threatening and can potentially lead to sweeps with a stronger Sucker Punch. Life Orb provides Lycanroc-D with the most immediate power, but it wears it down over longer battles and can put it in range of even resisted hits like Extreme Speed due to its poor bulk. Focus Sash is an option, particularly if you're running Lycanroc-D as a lead, to allow it to use Stealth Rock or Swords Dance safely. A Jolly nature is needed to outspeed threats like Garchomp, Hydreigon, and Terrakion and Speed tie with Latios and Latias.</p> <p>While Lycanroc-D has various methods of breaking through walls, team support is very important to optimize its damage output and opportunities to come in. Lycanroc-D's most common typings are able to hit most defensive typings at least neutrally, but they can struggle to break past certain combinations like Water / Poison, Dark / Poison, and certain Fairy and Flying typings. Strong special attackers like Dragon / Electric Latios and Ground / Steel Hydreigon can help Lycanroc-D pressure threats like Toxapex, Latias, and Cresselia. Lycanroc-D is able to target certain faster threats with Sucker Punch, but it is unable to take on most Extreme Speed users, since its defenses are frail. Bulky Normal-type checks like Ghost / Dragon Salamence and Ghost / Fighting Slowbro can take on Extreme Speeds aimed at Lycanroc-D and chip their users with Rocky Helmet. Lycanroc-D also appreciates teammates like Tornadus-T and Dark-type Heracross that can remove opposing Rocky Helmets and, in Tornadus-T's case, remove entry hazards with Defog to cut down on the residual damage Lycanroc-D takes.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "In The Hills"}, {"user_id": 50586, "username": "Euphonos"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Toxapex": {
    "comments": "<h1>Other Options</h1> <p>Rocky Helmet on Water / Poison Toxapex accumulates extra chip on physical attackers, particularly Extreme Speed and U-turn users such as Scizor, Entei, Pheromosa, and Arcanine. Water / Poison Toxapex can also utilize Knock Off over Haze, but without Haze it fails to check Calm Mind Clefable and Latias.</p> <h1>Checks and Counters</h1> <p><strong>Ground-type Attackers: Ground-type attackers such as Landorus-T, Melmetal, and Heatran easily break past Toxapex. However, Scald from Water / Poison Toxapex can somewhat deter physical Ground-types.</p> <p><strong>Tapu Lele: Tapu Lele is a huge threat to Water / Poison Toxapex due to its powerful Psychic-type attacks. Choice Specs Tapu Lele is especially threatening, as it's also difficult for Toxapex's partners to deal with, and it can even break Dark / Poison Toxapex in some cases.</p> <p><strong>Garchomp</strong>: Garchomp breaks past Toxapex with little effort. Offensive Stealth Rock sets, such as Ground / Steel and Dragon / Steel, are generally immune to Toxic, and some run Lum Berry to avoid a burn from Scald as well. After just one Swords Dance, any Garchomp set can 2HKO either Toxapex set.</p> <p><strong>Heracross</strong>: Heracross can break past either Toxapex set easily with STAB Guts Facade. Additionally, thanks to Guts, Heracross doesn't care about burns from Scald. It can fear Knock Off if Flame Orb hasn't activated yet, but otherwise it is a solid check to Toxapex.</p> <p><strong>Hydreigon</strong>: Most of Hydreigon's type configurations do not struggle with Toxapex at all. While Hydreigon generally runs Ground-type, it sets itself apart from other Ground-type attackers, as its Water / Dragon set breaks Toxapex as well. Ground / Steel Hydreigon in particular is able to threaten Toxapex without fear of being poisoned.</p> <p><strong>Electric-type Attackers</strong>: Electric-type attackers such as Tapu Koko, Latios, and Clefable are all able to threaten Toxapex in some way, though they can struggle to break past Dark / Poison Toxapex in some cases. Clefable is less secure, as it can't break past Dark / Poison Toxapex reliably and runs the risk of Toxapex using Knock Off. Choice Specs Tapu Koko can 2HKO Toxapex if Stealth Rock is up or gain momentum with Volt Switch.</p> <p><strong>Substitute and Taunt: Since Toxapex is passive, relying heavily on chipping opponents with Toxic damage and usually needing mulitple hits to break Substitutes, Substitute and Taunt are both strong tools to exploit it.</p> ",
    "sets": [
      {
        "name": "Specially Defensive Wall",
        "description": "<p>With high bulk and only one weakness, Dark / Poison Toxapex is a potent defensive Pokemon in the metagame. Its typing allows it to be one of the most effective walls to strong special attackers such as Tapu Lele, Magearna, Alakazam, Volcarona, and Spectrier. Regenerator and Recover give it multiple tools to increase its longevity. Knock Off gives Toxapex its Dark typing while providing valuable team support. Toxapex's Poison-type moveslot is flexible, with Toxic Spikes providing the most team support. Toxic is a secondary option that more immediately poisons foes like Heavy-Duty Boots Volcarona and affects Flying-type and Levitate foes. Baneful Bunker is a less common option that allows Toxapex to scout moves from Choice item users and physical attackers or stall another turn of burn or poison damage. Haze is necessary to effectively stop special attackers such as offensive Clefable, Steel-type Magearna, and Poison-type Latias from setting up, as each is immune to Toxic damage. Haze also allows Toxapex to check a number of setup sweepers in a pinch, though it has to be cautious to not lose too much HP in the process.</p> <p>Toxapex fits on most playstyles, but it truly thrives on balance and bulky offense teams, providing crucial support for both. Physically defensive Steel / Flying Pokemon such as Salamence and Buzzwole are great partners for Toxapex because they cover Ground-type Pokemon, which are easily the biggest threats to Toxapex. Offensive Flying-type and Levitate Pokemon like Tornadus-T, Latios, and Hydreigon can threaten defensive Ground-types that threaten Toxapex, such as Heatran, Landorus-T, and Coalossal. Offensive Pokemon that appreciate Toxic Spikes support, such as Victini, Garchomp, and Ground-type Hydreigon, are very valuable partners to Toxapex on bulky offense, as they can force opposing teams into difficult positions and capitalize on Toxic damage.</p> "
      },
      {
        "name": "Physically Defensive Wall",
        "description": "<p>Water / Poison Toxapex is a pivot and wall that checks a various offensive Pokemon such as Entei, Arcanine, Pheromosa, and Latias. Scald is spammable thanks to its high burn chance, which threatens physical attackers such as Landorus-T, Garchomp, and Lycanroc-D. Toxic Spikes gives Toxapex a support option that prevents defensive Pokemon from coming in safely, which can greatly benefit Toxapex's teammates. Toxic is a secondary option that more immediately poisons foes like Heavy-Duty Boots Volcarona and affects Flying-type and Levitate foes. Baneful Bunker allows Toxapex to scout moves or stall another turn of burn or poison damage. Recover increases Toxapex's longevity and allows it to check threats more readily. For the last slot, Haze allows Toxapex to check a plethora of setup sweepers such as Fire / Fairy Clefable, Water / Poison Latias, and Cresselia.</p> <p>Psychic-type attackers such as Tapu Lele and Volcarona can be huge threats to Toxapex, so it's important to have switch-ins to these attacks; bulky Steel-type Pokemon, namely Heatran, Hydreigon, Coalossal, and Magearna, are good examples. Additionally, Ground-type Heatran, Hydreigon, and Coalossal double as checks to offensive Electric-types such as Clefable, Tapu Koko, Latios, and Dragapult that Toxapex struggles to deal with. Similarly to specially defensive Toxapex, this set benefits greatly from offensive Pokemon that appreciate Toxic Spikes support such as Entei, Hydreigon, and Victini.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410702, "username": "a loser"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 324242, "username": "In The Hills"}]}
  },
  "Buzzwole": {"sets": [{"name": "Bulk Up"}]},
  "Pheromosa": {
    "comments": "<h1>Other Options</h1> <p>Pheromosa can hold Heavy-Duty Boots to be a slightly more reliable spinner and avoid entry hazard damage, but Protective Pads blocks a bigger source of residual damage in Rocky Helmet. Pheromosa can run Ice Beam as its coverage move to hit physically bulky neutral switch-ins like Steel / Flying and Water / Ground Pokemon while their Rocky Helmets, but it is generally weaker than and not as useful as its main coverage options. Throat Chop is another option for coverage that hits Water / Ghost types like Salamence and Slowbro but is not very useful outside of this.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers: Pheromosa's pitiful bulk leaves in prone to revenge killing from priority attacks like Extreme Speed and Grassy Glide as well as neutral hits from Choice Scarf users.</p> <p><strong>Residual Damage</strong>: Pheromosa is damaged by all entry hazards, often damaged by Life Orb, and very vulnerable to Rocky Helmet without Protective Pads.</p> <p><strong>Bulky Water-types</strong>: Water-types resist Triple Axel and can use secondary typings such as Fairy, Ghost, and Poison to counter Close Combat as well. Pheromosa has to rely on coverage moves to meaningfully damage these foes.</p> <p><strong>Bulky Ghost-types</strong>: Ghost / Steel and Ghost / Water types like Reuniclus, Magearna, and Galarian Slowking resist Pheromosa's STAB move and U-turn, and they can spinblock it as well. Pheromosa can threaten Ghost / Steel types with Drill Run, but only after they have been weakened, since they threaten to KO in return.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>Pheromosa makes use of its near unmatched Speed and good Attack to become a threatening wallbreaker with almost unresisted STAB coverage. Though somewhat inconsistent, Triple Axel gives Pheromosa a 120 Base Power STAB move that complements its secondary STAB attack in Close Combat. Triple Axel targets Flying and Ground typings on foes such as Mew, Salamence, and Tornadus-T, while Close Combat covers the Ice-resistant Pokemon like Heatran and Melmetal. U-turn allows Pheromosa to pivot out on physically bulky switch-ins like Water / Fairy Mew and Water / Ghost Slowbro and bring in a check. Poison Jab as coverage hits checks such as Water / Fairy Mew, Fire / Fairy Clefable, and others that resist its STAB moves, potentially poisoning them. Drill Run is another option that specifically hits Water / Poison types like Garchomp and Toxapex. Rapid Spin is a final option for entry hazard removal in a pinch, but Pheromosa is much too frail to be a reliable entry hazard remover. Life Orb gives Pheromosa a nice increase in power without a Choice lock, but it greatly reduces its longevity alongside potential damage from opposing Rocky Helmet users. Therefore, Protective Pads is an option to ignore Rocky Helmet damage from common users such as Steel / Flying Mew and Salamence or Water-type Slowbro hoping to heavily punish Triple Axel. Choice Band is a final item option to boost Pheromosa's power at the cost of risking momentum loss. A Jolly nature and maximum Speed EVs are needed to outspeed Dragapult.</p> <p>Pheromosa pairs well with bulky setup sweepers like Clefable and Magearna, as it can eliminate the Ground- and Steel-types that normally check them. In return, these setup sweepers can pressure the physically bulky foes hoping to check Pheromosa. Pheromosa is incredibly frail and prone to revenge killing via priority attacks, so teammates with Intimidate such as Landorus-T and Salamence can check Rillaboom and Extreme Speed users and wear them down with Rocky Helmet damage. Pheromosa is also outsped by Choice Scarf users like Landorus-T, Porygon-Z, and Victini, so priority options like Extreme Speed from Arcanine and Entei or Grassy Glide Rillaboom can keep pressure on them. Rillaboom also threatens Pheromosa's bulky Water-type checks like Mew, Slowbro, and Toxapex. Pivots with entry hazard control like Mew and Tornadus-T can help Pheromosa stay healthy by clearing the field of entry hazards and bringing it in safely. Rapid Spin Pheromosa fits well on offensive teams that stack Spikes from setters like Mew, as it clears entry hazards only on your side of the field.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "In The Hills"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Magearna": {"sets": [{"name": "Choice Specs"}, {"name": "CM Split"}]},
  "Naganadel": {"sets": [{"name": "Nasty Plot"}]},
  "Melmetal": {"sets": [{"name": "Choice Band"}]},
  "Rillaboom": {
    "comments": "<h1>Other Options</h1> <p>Life Orb sets can opt for a Grass / Dark typing via Knock Off, but this doesn't offer as nice coverage and makes Rillaboom extremely weak to U-turn. Life Orb sets also have various status moves to choose from in place of Swords Dance, like Bulk Up, Leech Seed, and Taunt, and can opt for a Fighting-type STAB move without drawbacks in Drain Punch. Each of these options takes away from its immediate breaking power, however. On Swords Dance sets, Rillaboom can hold a Grassy Seed in conjunction with Acrobatics in place of Knock Off to boost its Defense and nail its common checks like Bug / Fighting Landorus-T and Tornadus-T. This again reduces its power, though.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Rillaboom's primary STAB type, Grass, is checked by almost all Flying-types, and these checks threaten to KO Rillaboom with their own STAB moves. Rillaboom's best way to hit many Flying-types is neutral damage, either the stronger Superpower or Knock Off to remove Heavy-Duty Boots.</p> <p><strong>Fire-types</strong>: Fire-types like Arcanine, Cinderace, and Volcarona also resist Rillaboom's Grass-type attacks and threaten to KO it in return. However, Rillaboom is able to threaten most Fire-types with its secondary STAB moves like High Horsepower and Superpower.</p> <p><strong>Tornadus-T: Tornadus-T is commonly seen with Fighting / Flying and Fire / Flying typings, both of which check Rillaboom's STAB and coverage moves well and threaten it offensively with super effective moves like Hurricane, Heat Wave, and Superpower. Tornadus-T can also revenge kill Rillaboom with its Dark / Poison set via Sludge Bomb.</p> <p><strong>Intimidate</strong>: Intimidate users such as Bug / Fighting Landorus-T and various Salamence sets can counter, or at least check, Rillaboom depending on its coverage thanks to dropping its Attack on the switch and heavily resisting its moves. Grassy Seed Acrobatics sets give Rillaboom an option to hit Landorus-T, while Superpower and Knock Off variants can hit the Salamence sets.</p> <p><strong>Cresselia: Cresselia's primary Poison / Fairy set easily walls Rillaboom's STAB and coverage moves and forces it out with the threat of Moonblast and setting up with Calm Mind. However, Cresselia's other sets, like Ghost / Fairy, are 2HKOed by Choice Band Wood Hammer.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Rillaboom is a unique wallbreaker given its terrain-boosted priority in Grassy Glide and strong secondary STAB move options that complement its primary attack well. Grassy Glide's priority in Grassy Terrain makes Rillaboom immediately threatening to faster, frail offensive threats like Lycanroc-D and Pheromosa. Physically defensive Steel-types easily take Grassy Glide, which is where Superpower comes in handy to threaten them. High Horsepower is another secondary STAB option to hit Grass-resistant foes like Heatran and Arcanine, but it leaves Rillaboom unable to threaten Steel / Flying types like Mew and Salamence. Knock Off provides nice coverage and a means to hit Ghost-types that resist Grass like Magearna, Reuniclus, and Salamence. Swords Dance makes Rillaboom extremely threatening to both offensive and defensive threats, letting Superpower easily 2HKO neutral targets like Steel / Flying Buzzwole. Life Orb gives Rillaboom's moves more power, and its recoil is slightly mitigated by terrain recovery.</p> <p>Rillaboom's Grassy Terrain provides its teammates passive recovery and temporarily patches up weaknesses to Earthquake, so Ground-weak partners like Clefable and Coalossal can survive Earthquake in a pinch to set entry hazards, or recover instead in Clefable's case. Slower offensive teammates like Hydreigon and Latios appreciate Rillaboom's ability to pressure faster threats like Lycanroc-D and Pheromosa with Grassy Glide. Most Flying- and Bug-types threaten and wall Rillaboom, so teammates that can take these on like Thunderbolt or Flamethrower Magic Guard Clefable and Hurricane Tornadus-T are helpful.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Rillaboom trades potential to set up for immediate power that. Wood Hammer in Grassy Terrain hits extremely hard, 2HKOing neutral targets such as Mew, Ground / Flying Buzzwole, defensive Ground / Bug Landorus-T, and Ghost / Fairy Cresselia. Superpower threatens Grass-resistant foes like Arcanine, Heatran, and Steel / Flying types like Mew and Salamence. High Horsepower also targets Steel-types as well as Fire-types, but it leaves Rillaboom unable to meaningfully damage Flying-types. Knock Off is a third option for the secondary STAB move that mainly targets walls like Dragon / Ghost Salamence but also hits and cripples neutral targets like defensive Mew. Grassy Glide provides Rillaboom with strong terrain-boosted priority to pick off faster, frail offensive foes like Dragapult and Pheromosa. U-turn lets Rillaboom pivot out and scout the opposing team for potential switch-ins while bringing in its teammates.</p> <p>Rillaboom's Grassy Terrain provide its teammates passive recovery and temporarily patches up weaknesses to Earthquake, so Ground-weak partners like Clefable, Coalossal, and Heatran can survive in a pinch to set entry hazards, or recover instead in Clefable's case. Slower offensive teammates like Hydreigon and Latios appreciate Rillaboom's ability to pressure faster threats like Lycanroc-D, Pheromosa, and Spectrier with Grassy Glide. Most Flying- and Bug-types threaten and wall Rillaboom, so teammates that can take these on like Thunderbolt or Flamethrower Magic Guard Clefable and Hurricane Tornadus-T are helpful, especially because Rillaboom may be locked into a resisted move. Rillaboom can bring these teammates in with U-turn to take on its defensive checks. Rillaboom's strongest attack also deals significant recoil damage, so teammates that can pass Wishes like Latias and Salamence can come in handy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 324242, "username": "in the hills"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Drednaw": {
    "comments": "<h1>Other Options</h1> <p>Drednaw can run Superpower as its secondary STAB move for a Water / Fighting typing, but this leaves typing it unable to hit Water / Poison types like Toxapex well and is better run by Barraskweda. Stone Edge can also be used as Drednaw's secondary STAB move, but it is more unreliable and gives worse coverage overall.</p> <h1>Checks and Counters</h1> <p><strong>Rillaboom: Rillaboom is able to resist both of Drednaw's STAB attacks, weaken Earthquake with Grassy Terrain, and OHKO it with Grassy Glide.</p> <p><strong>Opposing Weather</strong>: Drednaw heavily relies on rain support to perform, so opposing weather setters like Torkoal and Hippowdon hamper its ability to sweep and take on faster threats.</p> <p><strong>Bulky Water-types: Bulky Water-types like Mew, Latias, and Hydreigon can beat Drednaw, as they resist or are immune to its STAB moves. However, they fail to check Drednaw in rain after a Swords Dance.</p> ",
    "sets": [
      {
        "name": "Rain Sweeper",
        "description": "<p>Drednaw is a potent physically attacking Swift Swim user thanks to its fair Speed and access to Swords Dance. Rain-boosted Liquidation is Drednaw's strongest STAB move and pairs well with Earthquake, as they allow Drednaw to 2HKO Water-resistant foes as well as Flying-types and Levitate Fire-types like Mew and Hydreigon, respectively. Swords Dance makes Drednaw extremely threatening in rain, allowing it to 2HKO bulky Water-types like Mew, Slowbro, and Latias. Stone Edge lets Drednaw cover its defensive checks like Water / Flying Mew and Pelipper and Water / Dragon Hydreigon and Latias. Superpower is another coverage option that allows Drednaw to hit Levitate users like Steel / Dragon Hydreigon without relying on rain. Stealth Rock is another option to wear down Drednaw's checks through the battle. Max Speed EVs are needed to outspeed Choice Scarf Victini and +1 Volcarona while rain is active.</p> <p>Drednaw's special attacking partners on rain teams like Kingdra, Latios, and Tornadus-T appreciate its ability to pressure specially defensive foes like RegenVest Slowking and Blissey. Drednaw needs rain support in order to perform, so Pelipper is required. Pelipper can also safely bring Drednaw in via U-turn and support it with other moves like Defog and Knock Off. Drednaw can struggle to break past Water / Flying Mew and is threatened by its rain-boosted STAB moves, so a Water-resistant partner like Dragon / Ghost Salamence makes a great teammate. Salamence can also check priority attackers like Rillaboom and Entei that can threaten to revenge kill Drednaw.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475804, "username": "The Number Man"}, {"user_id": 324242, "username": "in the hills"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 410702, "username": "a loser"}]}
  },
  "Dragapult": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Band"}]},
  "Spectrier": {
    "comments": "<h1>Other Options</h1> <p>Calm Mind is an alternative to Nasty Plot that trades off immediate power for some extra bulk; in particular, this option works well with Substitute sets. Mud Shot can be used as one of Spectrier's STAB attacks to grant it either a Ground / Dark or Ground / Ghost typing. This option gives Spectrier an option to hit Poison / Dark Pokemon, but it is significantly weaker and overall gives Spectrier a worse defensive typing. Ground / Dark Spectrier should opt for Substitute, while Ground / Ghost sets prefer Will-O-Wisp.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types with Regenerator</strong>: Dark-types with Regenerator such as Tornadus-T, Galarian Slowking, and Toxapex resist both of Spectrier's STAB attacks while healing back most of the damage it inflicts with Regenerator.</p> <p><strong>Clefable: Clefable is a solid check to Spectrier, as both its offensive and defensive sets can threaten Spectrier. Poison / Dark Unaware Clefable is the most reliable wall to Nasty Plot Spectrier in the metagame, while offensive Clefable is able to threaten Spectrier with super effective Moonblast.</p> <p><strong>Fast Physical Attackers</strong>: Fast physical attackers such as Pheromosa and Choice Scarf Landorus-T are able to outpace Spectrier and deal heavy damage to it, but all of these threats are susceptible to Will-O-Wisp.</p> <p><strong>Arcanine: Arcanine is a solid check to Spectrier with its Normal / Fairy and Normal / Dark sets, as it is immune to Spectrier's Ghost-type STAB attack and is resistant to Dark. In addition, it has an immunity to Will-O-Wisp with Flash Fire and threatens to KO Spectrier with either Play Rough or Crunch.</p> ",
    "sets": [
      {
        "name": "Dark Horse",
        "description": "<p>Spectrier is a powerful special attacker that is able to threaten a large portion of the metagame with its powerful STAB moves, primarily Hex, which is able to capitalize on its ability to spread status. Shadow Ball can be used as Spectrier's Ghost-type STAB attack for more immediate power, although it doesn't have as much damage potential as Hex. Dark Pulse is Spectrier's secondary STAB attack and grants it a Ghost / Dark typing; this typing only has one weakness and provides Spectrier with an important immunity to Extreme Speed. Nasty Plot increases its wallbreaking power. Will-O-Wisp boosts the power of Hex and hinders physical attackers such as Lycanroc-D, Landorus-T, and Rillaboom. Taunt can be used, either as an alternative to or in conjunction with Nasty Plot, and it allows Spectrier to exploit passive switch-ins such as Clefable and Toxapex by preventing them from recovering HP and using status moves. Substitute is an option that Spectrier can use to take advantage of offensive checks such as Rillaboom. 112 HP EVs help Spectrier avoid an OHKO from Grassy Glide from Life Orb Rillaboom and Moonblast from offensive Clefable, while the remaining EVs are put into Speed and Special Attack to maximize its offensive capabilities.</p> <p>Extreme Speed users such as Arcanine, Entei, and Lucario appreciate Spectrier's ability to threaten bulky Ghost-types; in return, these Pokemon are able to threaten its offensive checks such as Pheromosa. Spectrier can support Rillaboom by threatening Pokemon such as Fire / Psychic Volcarona, Fighting / Flying Tornadus-T, and Bug / Fighting Landorus-T. Spectrier mainly struggles with Dark-types, so Fighting-types such as Landorus-T, Rillaboom, and Lycanroc-D are able to threaten these checks. Poison / Dark types such as Tornadus-T, Toxapex, and Clefable in particular are able to stop Spectrier from sweeping, so Ground-type attackers like Hydreigon, Landorus-T, and Garchomp can cover this weakness.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410702, "username": "a loser"}, {"user_id": 475804, "username": "The Number Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 324242, "username": "In The Hills"}]}
  }
}