{
  "Charmander": {
    "sets": [
      {
        "name": "Sun Wallbreaker",
        "description": "<p>Charmander's only viable set is as a sun attacker; under sun, Charmander's Solar Power-boosted Fire-type moves deal massive damage. Weather Ball is Charmander's most spammable STAB attack in sun, while Overheat and Fire Blast allow it to clean weakened teams even without sun. Finally, because Charmander does not have any coverage moves and sun teams often struggle to fit a Spore absorber, Sleep Talk allows it to fulfill the role of a sleep absorber. Choice Scarf allows Charmander to outspeed the entire unboosted metagame and common Choice Scarf users like Mudbray, Porygon, and Magnemite. Charmander requires sun support from from Vulpix. It can break down shared checks for other Fire-types and benefit from other sun sweepers like Ponyta weakening Water-types like Frillish and Mareanie, which are challenging Pokemon to chip down. Fighting-types that lure Mareanie and remove its Eviolite, like Mienfoo and Timburr, also help Charmander. Diglett helps trap Pokemon like the aforementioned Mareanie, Ponyta, and Staryu.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 416460, "username": "yellowfin"}]}
  },
  "Sandshrew-Alola": {
    "sets": [{"name": "Hail Sweeper", "description": "<p>Alolan Sandshrew finds a niche in LC as a hail sweeper due to the sheer power of Triple Axel, which lets it power through Pokemon like Mienfoo, Koffing, and Natu. Earthquake threatens Ice-resistant foes such as Mareanie, Ponyta, and Pawniard. With Rapid Spin and Swords Dance, Alolan Sandshrew can capitalize on setup opportunities and quickly snowball out of control. Wide Lens significantly improves Triple Axel's accuracy. Hail support from Snover or Amaura is necessary to facilitate a sweep. Trappers such as Wynaut and Diglett can help remove threats to hail teams; Wynaut deals with Timburr and its pesky Mach Punch, while Diglett can remove Mareanie and Fire-types like Ponyta and Vulpix.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Vulpix": {
    "overview": "<p>Thanks to Drought, Vulpix has incredibly strong Fire-type attacks that make it a rather potent offensive pick, threatening several Pokemon such as Ferroseed and Grookey. At 17 Speed, Vulpix is just fast enough to threaten the likes of Vullaby without a Choice Scarf while being rather easy to revenge kill with unboosted Speed. There is an appeal to doubling up on Fire-type attackers with the support of Drought for dedicated wallbreakers, though a shallow movepool leaves Vulpix unable to do much to overcome its own checks and counters. Vulpix is consigned to being a one dimensional wallbreaker, but very few Pokemon can tank hits from the Fire- and Grass-type coverage that it brings to a team.</p> ",
    "comments": "<h1>Other Options</h1> <p>Flame Charge is a nice option on non-Choice item sets for boosting Vulpix's Speed to outspeed the unboosted tier. Eject Pack allows Vulpix to use Overheat and immediately switch out to bring in Diglett to trap the likely Fire-resistant Pokemon on the field. Heat Rock gives additional turns of Sun, turning Vulpix into a niche support Pokemon for unorthodox picks such as Solar Blade Ponyta and Choice Scarf Charmander. This is not generally recommended, though, as these teams end up with large defensive gaps and heavily rely on being able to win with these fast Fire-types. Heavy-Duty Boots allows Vulpix to avoid taking entry hazard damage, but the benefits of Heat Rock often outweigh the advantages of it. Memento can be used in conjunction with a setup sweeper, such as Woobat or Shellder.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: As Water-types with Recover, Staryu, Mareanie, Shellos, and Frillish are all rather sturdy answers to Vulpix's sun-boosted attacks. Mareanie is particularly resilient owing to its ability Regenerator. Staryu does need to beware Choice Scarf Vulpix hitting it with Energy Ball on the switch, but this is not too troublesome.</p> <p><strong>Ponyta: As the main other Fire-resistant Pokemon in the tier with recovery, Ponyta is a major issue for Vulpix. Drought powers up Ponyta, making it more difficult to switch into while also causing Morning Sun to heal Ponyta for another quarter of its health. Ponyta may run Flash Fire to absorb Fire-type attacks and completely wall Vulpix, though Ponyta is still a sufficient check without it.</p> <p><strong>Priority and Entry Hazards</strong>: Vulpix is frail enough that taking a quarter of its health upon switching in greatly limits its potential. Onix is a common Stealth Rock setter and is able to switch into Vulpix's Fire-type attacks somewhat well. Chip damage in general is how more offensive teams will overcome Vulpix generally, as Fake Out or Sucker Punch with entry hazards up is enough to keep Vulpix from cleaning up teams throughout the game.</p> ",
    "sets": [
      {
        "name": "Choice Item",
        "description": "<h1>Moves</h1> <p>Weather Ball is Vulpix's strongest accurate STAB move when sun is up, but it requires sun to actually be useful. Overheat is incredibly strong and can be used to break through several Pokemon, such as scoring the OHKO on Vullaby. Energy Ball is chiefly for Onix and Staryu and the only coverage option worth running. Hypnosis allows for Vulpix to try to put a Pokemon to sleep on a forced switch, which can be valuable when facing teams with Mareanie or Ponyta. Fire Blast is a powerful attack, but it should be used in situations where you do not want to be locked into Overheat or Weather Ball, such as sun disappearing or having the need to switch out. That being said, running three Fire-type attacks can be cumbersome.</p> <h1>Set Details</h1> <p>The EV spread simply makes Vulpix as fast and powerful as possible. With a Timid nature, Vulpix reaches 17 Speed, outspeeding Vullaby and Speed tying with Mienfoo. The remaining EVs go into HP in order to give Vulpix one more switch into Stealth Rock. With Choice Scarf, Vulpix becomes one of the better revenge killers in the tier, outspeeding Dragon Dance Scraggy and Choice Scarf Pawniard. Choice Scarf also allows Vulpix to assume the role of a late-game cleaner. Choice Specs instead doubles down on Vulpix's threatening Fire-type attacks in order to make it a ferocious wallbreaker.</p> <h1>Usage Tips</h1> <p>Vulpix is too frail to switchin on any neutral attack and is weak to entry hazards, which consequently means that getting it into play is a challenge. Intelligent double switches or pivoting moves such as U-turn are key components to getting Vulpix in. From there, it is often as straightforward as using the appropriate Fire-type attack while occasionally using Energy Ball to catch Staryu or Onix on the switch. Vulpix can also catch common switch-ins, such as Ponyta and Mareanie, and cripple them severely with Hypnosis. Do be mindful of Drought turns, as Vulpix without sun in play is no threat at all. Vulpix is easily threatened by all faster Pokemon and priority attacks and therefore should usually be switching out of these matchups.</p> <h1>Team Options</h1> <p>Vulpix's success is determinant on coming in safely, making bulky Mienfoo one of the best partners for it available in the tier, as it can cripple Mareanie with Knock Off and force Onix out. Due to its ability to trap and remove all of the hard stops to Vulpix available in the tier, such as Ponyta and Mareanie, Diglett is often a very important teammate. Hazard removal is absolutely necessary, leading Vullaby and Staryu to be highly recommended teammates. As Vulpix will struggle with opposing Water-types and make great use of Stealth Rock, Ferroseed is highly recommended. Pawniard assists with Stealth Rock and Knock Off support as a more offensive option. Ponyta and Choice Scarf Charmander pair with Vulpix well, as they both are capable attackers with sun support. Choice Specs Vulpix specifically does well with Thunder Wave support, making Slowpoke and Porygon worthy teammates as well.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 255030, "username": "San Tomas"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 150971, "username": "Coconut"}]}
  },
  "Oddish": {"sets": [{"name": "Defensive"}]},
  "Diglett": {
    "comments": "<h1>Other Options</h1> <p>Focus Sash Diglett is an option on hyper offense teams as a lead that can guarantee Stealth Rock and Memento. Focus Sash Diglett can also run a set of Protect + Sludge Bomb with full Special Attack investment and a Timid nature, which can surprise and trap opposing Grookey and serve as an emergency safeguard against other sweepers, but the set is weak and struggles to make progress against foes it does not hit for super effective damage. Choice Scarf Diglett outspeeds the entire metagame, including +2 Porygon, +1 Tyrunt, and +1 Ponyta, and can be used as a backstop against opposing Diglett and other fast threats with Final Gambit.</p> <h1>Checks and Counters</h1> <p><strong>Grookey: Grookey only fears the rare Sludge Bomb and can punish Diglett's presence with its hard-hitting STAB moves, Knock Off, U-turn, and Swords Dance, all of which can grant momentum and force difficult predictions. Grassy Terrain also severely weakens Earthquake and can make trapping difficult.</p> <p><strong>Opposing Arena Trap Users</strong>: Opposing Diglett and Trapinch can take out Diglett before it traps its main target, and thus it must be deployed carefully when facing them to maximize its value.</p> <p><strong>Bulky Pokemon: Bulky threats like healthy Mienfoo, Porygon, and Staryu can take advantage of Diglett after a trap, tolerating its attacks to garner momentum and force hard predictions.</p> ",
    "sets": [
      {
        "name": "Air Balloon",
        "description": "<p>Air Balloon Diglett can guarantee the removal of dangerous threats and defensive stalwarts like Ponyta, Focus Sash Abra, and Mareanie while eluding opposing Arena Trap users with Air Balloon. Air Balloon also allows it to trap opposing Diglett. Final Gambit is a powerful option that sacrifices Diglett to guarantee KOs on low-health foes. Beat Up KOes Focus Sash Abra with five hits and hits Galarian Ponyta and Natu hard while Diglett's teammates are healthy. Protect blocks Mienfoo's Fake Out and Trapinch's First Impression, letting Diglett preserve its Air Balloon. Substitute can be used to more reliably trap Pawniard, while Sucker Punch provides priority to teams that lack it. Diglett can run Stealth Rock, but it will rarely find turns to set it up due to its frailty.</p> <p>Air Balloon Diglett works best with teammates that fear opposing Diglett like Ponyta and Abra without Shed Shell, and, against non-Air Balloon Diglett, it can punish the opponent for trapping one of these threats by counter-trapping their Diglett. Diglett removing important defensive Pokemon like Pawniard and Mareanie is also beneficial to Abra, Porygon, and Mienfoo. Mienfoo can force in targets like Mareanie and bring in Diglett safely to trap them with U-turn. Arena Trap means Diglett does not have traditional counters, but Grookey can heavily punish Diglett after it traps a foe, and Shed Shell Abra can evade Arena Trap. Bulky Poison-types like Koffing and Foongus, as well as Natu, can cover the Grookey matchup, while Frillish, Ferroseed, and Pawniard can slow down Abra.</p> "
      },
      {
        "name": "Eviolite",
        "description": "<p>Eviolite Diglett trades the flexibility of Air Balloon and the power of Life Orb for bulk and reliability, as Eviolite lets it take a hit from foes like Mareanie, Pawniard, and non-Life Orb Abra and Diglett to secure a KO. Final Gambit trades Diglett for a KO or major damage against bulky foes like Ferroseed. Beat Up KOes Focus Sash Abra with five hits and threatens Galarian Ponyta and Natu while Diglett's teammates are healthy. Stealth Rock is an option for role compression, and Diglett's ability to trap its foes prevents Natu from blocking Stealth Rock. Memento can aid setup sweepers, especially Salac Berry Magnemite. Earth Power helps Diglett trap foes like Mareanie and Ponyta while Grassy Terrain is active. The given investment in Special Defense helps Diglett more reliably trap threats like Abra.</p> <p>Eviolite Diglett works well with teams that want to guarantee a KO against a foe that other sets cannot reliably defeat, including Pawniard for hard hitters like Abra, Porygon, and Calm Mind or Cosmic Power Natu. This set works in tandem with Salac Berry Magnemite, as it reliably sets Stealth Rock while being able to switch into Ferroseed's Giga Drain, letting it use Memento to secure Magnemite's trap and setup. This set is vulnerable to Grookey, which does heavy damage to Diglett and forces it out, and to opposing Arena Trap users, especially Trapinch. Bulky Poison-types like Koffing and Foongus, along with Natu, cover the matchup against Grookey while Grookey itself or Staryu can take advantage of Trapinch.</p> "
      },
      {
        "name": "Life Orb",
        "description": "<p>Life Orb Diglett accepts maximum frailty in return for maximum power, and its sheer strength allows it to trap a wide array of enemies without Eviolite, even including chipped Mienfoo and Foongus. Earthquake is very powerful with Life Orb, while Beat Up KOes Focus Sash Abra in four hits and threatens Galarian Ponyta, Natu, and Frillish while Diglett's teammates are healthy. Substitute allows Diglett to avoid Pawniard's Sucker Punch to reliably trap it. Rock Slide hits Natu and the rare Larvesta, while Sucker Punch can KO Grookey and Choice Scarf users like Porygon and Vulpix at low health. Protect blocks Mienfoo's Fake Out and Trapinch's First Impression, and hitting Trapinch with Earthquake before fainting can be invaluable to limiting the threat it poses to the rest of the team.</p> <p>Life Orb Diglett can threaten almost any defensive core with its power, but teammates like Mienfoo, Porygon, Abra, and Natu especially benefit from its ability to remove Mareanie and Pawniard. This set can also support teams weaker against Mienfoo because Diglett can trap and remove it after Knock Off and chip damage. Trapinch and Air Balloon Diglett are the main roadblocks for this set, as they will always trap and KO Diglett after it gets its own KO. Grookey also punishes Diglett, but it must be wary of Sucker Punch when at low health. Grookey and Staryu can take advantage of Trapinch and Diglett, while Koffing, Foongus, and Natu check Grookey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Meowth": {
    "overview": "<p>Meowth is a niche revenge killer with the combination of Technician-boosted Fake Out + Feint to handle Choice Scarf users like Vulpix, Porygon, and Mienfoo offensively. It can also check frail fast threats like Abra and Grookey. It also has a great matchup against hyper offense teams like sun, Spikes-stack, and dual screens due to its ability to waste turns and cripple frail sweepers. Meowth can threaten bulkier Pokemon such as Koffing and Staryu with Fake Out into Double-Edge, if these have been chipped or hit with Knock Off beforehand, allowing it to threaten bulky offense teams. However, Meowth is extremely frail and vulnerable to fainting if it cannot KO the foe, and priority users like Grookey can easily revenge kill it if they survive Feint. Pokemon with Regenerator such as Mareanie and Foongus, as well as Steel-types like Pawniard and Ferroseed, can play around Meowth to negate progress. Most importantly, however, Meowth is almost entirely outclassed as a revenge killer by Grookey, which has much stronger priority in Grassy Glide and can opt to run Fake Out if necessary.</p> ",
    "comments": "<h1>Other Options</h1> <p>Aerial Ace gives Meowth a better matchup against Fighting-types like Mienfoo and Timburr. A Naive or Jolly nature can be run to hit 19 Speed. However, Meowth already has a good matchup against 19 and 18 Speed Pokemon with Fake Out and Feint, and it misses out on the power of an Attack-boosting nature.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Since Pawniard, Ferroseed, and Magnemite resist Meowth's STAB moves and aren't weak to Water Pulse, they use it as a free turn for entry hazards, setup, or Volt Switch.</p> <p><strong>Bulky Priority Users: Pokemon like Pawniard and Trapinch can tank Fake Out + Feint and retaliate with their own priority, so Meowth cannot use Double-Edge. Because Meowth often gets worn down quickly, even weak priority like Mienfoo's Fake Out can threaten it late-game.</p> <p><strong>Fighting-types: Timburr and Mienfoo can survive or prevent Fake Out + Double-Edge and OHKO or hit it with Mach Punch. Less common Fighting-types such as Croagunk can also force it out. Fighting-types must be wary of Aerial Ace, however.</p> <p><strong>Choice Scarf Users: Choice Scarf users like Mienfoo, Porygon, and Vulpix can threaten Meowth out after it has used Fake Out.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<h1>Moves</h1> <p>Fake Out helps to soften up Pokemon and revenge kill most weakened foes without Protect. If it is not enough to KO these, Feint can finish the job. Fake Out also breaks Sturdy and Focus Sash reliably, as well as helping against opposing priority users, such as weakened Timburr. Double-Edge is Meowth's strongest move; combined with Fake Out, it turns Meowth into a powerful wallbreaker, but it should be used sparingly due to the large amounts of recoil it can rack up. Water Pulse hits Onix, Dwebble, and Archen. With Fake Out, Meowth can beat SturdyJuice Onix and Dwebble as well. U-turn can be run over Water Pulse to escape bad matchups against Pokemon like Pawniard and Ferroseed. Additionally, not many Pokemon can tank Fake Out into Double-Edge, so Meowth can force many switches. It can take advantage of this to maintain momentum with U-turn. Knock Off can be run to weaken its checks, as Meowth can lure in Fighting- and Steel-types like Timburr and Ferroseed, which don't appreciate losing their Eviolite. Knock Off also prevents Regenerator cores from blocking Meowth.</p> <h1>Set Details</h1> <p>Technician increases the power of Meowth's low BP moves, and Life Orb is used to boost its otherwise lacking power. 36 SpA EVs allow Meowth to KO Archen after Fake Out chip damage, and 19 HP IVs are used to limit Life Orb recoil. A Naughty nature strengthens Meowth's STAB moves and doesn't weaken Water Pulse, but U-turn variants should run an Adamant nature and an EV spread of 236 Atk / 76 Def / 196 Spe.</p> <h1>Usage Tips</h1> <p>Meowth is extremely frail, so it shouldn't switch into attacks. Instead, aim to get it into the field through slow U-turns, double switches, or revenge killing opportunities. Faster Pokemon like Abra can run Protect—try to scout their sets to use Meowth's priority effectively. Feint can break through Protect, leaving them vulnerable to another Feint. Meowth can take the most advantage of its toolkit mid- or late-game when the opposing team is sufficiently weakened, so take care to preserve it until then. Always try to scout Onix and Dwebble to ensure you don't hit Weak Armor sets with Fake Out or Sturdy sets with Water Pulse. Making the right choice can potentially mean eliminating an entry hazard lead. U-turn variants should try to predict when Steel- and Fighting-types that wall Meowth, such as Pawniard and Timburr, might come in to maintain momentum.</p> <h1>Team Options</h1> <p>Entry hazard setters like Dwebble, Ferroseed, and Onix synergize well with Meowth chipping the opponent's team, especially if it carries U-turn. Knock Off users like Pawniard and Mienfoo allow Meowth to threaten even bulky teams, as few itemless Pokemon can take Fake Out into Double-Edge after entry hazards. Meowth appreciates having pivots such as Mienfoo and Grookey to guarantee a safe switch-in, chip foes, and maintain offensive momentum. If running Water Pulse, try pairing it with Pokemon that appreciate the removal of Rock-types like Ponyta to form wallbreaking cores. Meowth is entirely walled by Steel-types such as Pawniard, Ferroseed, and Magnemite, so partners like Mienfoo, Timburr, and Trapinch can take care of these.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 195129, "username": "Nineage"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 410251, "username": "zizalith"}]}
  },
  "Abra": {
    "comments": "<h1>Other Options</h1> <p>Energy Ball OHKOes Onix and targets other problematic foes like Staryu, Frillish, Diglett, and Trapinch. Abra can opt to run a dual screens set, consisting of Reflect, Light Screen, Thunder Wave, and Teleport with Light Clay, but it is outclassed by Natu in this role. Knock Off is a niche option to cripple checks such as Ferroseed, Frillish, and Munchlax on the switch. Dazzling Gleam is an option to hit both Fighting-types and Pawniard, easing prediction, but it is generally outclassed by other coverage options.</p> <h1>Checks and Counters</h1> <p><strong>Pawniard: Pawniard is one of the best checks to Abra thanks to its immunity to Psychic and ability to threaten Abra with Sucker Punch. It can force out Abra and use that opportunity to set Stealth Rock. However, Pawniard should be wary of Abra's coverage options.</p> <p><strong>Ferroseed</strong>: Ferroseed resists Psychic and threatens Abra with Thunder Wave and Knock Off. However, Ferroseed should be wary of Fire Punch.</p> <p><strong>Priority Attacks</strong>: Priority attacks are often the best ways to handle Abra, as they prevent it from getting a hit off. Strong priority like Grookey's Grassy Glide and Pawniard's Sucker Punch can KO, while weaker priority like Timburr's Mach Punch can break Abra's Focus Sash, leaving it vulnerable to faster attackers.</p> <p><strong>Choice Scarf Users: Choice Scarf users like Vulpix, Porygon, and Mienfoo outspeed and KO Abra. Choice Scarf Magnemite is notable, as it resists Psychic and doesn't enable Counter. However, Abra is able to check some of these Choice Scarf users with an intact Focus Sash; it also does not give Download Porygon a Special Attack boost, which makes it harder for Porygon to sweep.</p> <p><strong>Trappers: Diglett, especially Eviolite Diglett, can trap and eliminate Abra with Beat Up or Earthquake. Trapinch can take a hit from Abra and KO it in return while also potentially breaking Focus Sash with Feint. However, they are less reliable against Shed Shell Abra.</p> ",
    "sets": [
      {
        "name": "Shed Shell",
        "description": "<p>Shed Shell mitigates one of the most effective ways to remove Abra in trappers, making it a fearsome offensive threat. Shadow Ball hits Psychic-types like Galarian Ponyta, Natu, and opposing Abra and Frillish. Both Focus Punch and Fire Punch target Steel-types; Focus Punch OHKOes Pawniard, while Fire Punch heavily dents Ferroseed. Substitute takes advantage of Abra forcing switches to give it an extra layer of protection while also making it easier to use Focus Punch. Alternatively, Abra can forgo Substitute and fit both Focus Punch and Fire Punch to be less prediction reliant. Inner Focus helps Abra in the lead matchup by preventing it from flinching due to Mienfoo's Fake Out and letting it potentially set up with Substitute.</p> <p>Abra is best utilized as an early- and mid-game wallbreaker and late-game cleaner. Shed Shell allows Abra to be played more aggressively, as it doesn't have to fear getting trapped. It also lets Abra be utilized as a lead to beat lead Mienfoo, giving insurance if Mienfoo pivots to a trapper. Fighting-types such as Mienfoo and Timburr pressure Steel-types like Pawniard and Ferroseed; in return, Abra handles Poison-types like Foongus, Mareanie, and Koffing. Knock Off support from Mienfoo, Ferroseed, and Pawniard allows Abra to KO foes like Foongus and Mareanie with Psychic; Ferroseed and Pawniard also help check problematic foes like Choice Scarf Porygon. Trappers such as Diglett and Trapinch can remove Pawniard, Ferroseed, and opposing Diglett.</p> "
      },
      {
        "name": "Focus Sash",
        "description": "<p>Shadow Ball hits opposing Psychic-types and Frillish. Protect blocks Fake Out from Mienfoo and First Impression from Trapinch, preserving Focus Sash and preventing the latter from KOing Abra. Counter synergizes with Focus Sash to potentially revenge kill fearsome setup sweepers like Swords Dance Grookey,Belly Drum Magby, and Pawniard, while Thunder Wave cripples switch-ins like Pawniard and serves as a safety net against Choice Scarf users and setup sweepers.</p> <p>Abra is best utilized as an early- and mid-game wallbreaker and late-game cleaner. It is very important that Focus Sash is preserved until the late-game, as Abra often will be the best option to revenge kill setup sweepers. Fighting-types such as Mienfoo and Timburr complement Abra really well, pressuring Steel-types like Pawniard and Ferroseed; in return, Abra is able to handle Poison-types like Foongus, Mareanie, and Koffing, which limit the effectiveness of the Fighting-types. The aforementioned Poison-types are also solid partners, absorbing priority attacks such as Grookey's Grassy Glide and Timburr's Mach Punch and preserving Abra's Focus Sash. Knock Off support from Mienfoo, Timburr, and Pawniard allows Abra to KO foes like Foongus and Mareanie with Psychic. Trappers such as Diglett and Trapinch can remove Pawniard, Ferroseed, and opposing Diglett. Abra synergizes well with other special attackers like Galarian Ponyta and Porygon to overwhelm opposing Steel-types.</p> "
      },
      {
        "name": "Life Orb",
        "description": "<p>Life Orb Psychic severely damages most targets. Shadow Ball hits Frillish and opposing Psychic-types. Submission is used with 116 Attack EVs to let Abra lure in and OHKO Pawniard, while Fire Punch 2HKOes Ferroseed with 36 Attack EVs. Substitute allows Abra to take advantage of a forced switch and fire off an extra attack while also letting it avoid Pawniard's Sucker Punch. Alternatively, Protect blocks Mienfoo's Fake Out and Trapinch's First Impression and bluffs Abra's Focus Sash set. Inner Focus is a notable alternative over Magic Guard that lets Abra ignore flinch from Mienfoo's Fake Out in the lead matchup and KO it.</p> <p>Life Orb Abra is best utilized as an early- and mid-game wallbreaker, taking advantage of its incredible damage output to weaken opposing defensive cores. However, it should be played carefully, especially against teams with trappers, as Life Orb Abra is incredibly vulnerable to being trapped and removed. Abra fits on Spikes-stacking offense teams, taking advantage of Dwebble's and Ferroseed's Spikes weakening foes into KO range of its powerful attacks. Trappers such as Diglett and Trapinch can eliminate the troublesome Pawniard and Ferroseed, as well as opposing trappers. On less offensive team structures, playing Abra more passively and bluffing Focus Sash can be beneficial, as it causes the opponent to be more cautious. Knock Off absorbers such as Timburr and Mienfoo, as well as defensive cores like Ferroseed + Mareanie and Staryu + Foongus, can help Abra handle opposing Dark-types and Choice Scarf users like Porygon and Vulpix. Grass-resistant foes like Foongus, Koffing, and Ponyta are also appreciated, helping Abra against Grookey. Abra has good synergy with other special attackers like Porygon and Staryu due to their ability to wear down shared checks like Ferroseed and Frillish.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 192841, "username": "dave"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Tentacool": {"sets": [{"name": "Defensive Utility"}]},
  "Ponyta": {
    "overview": "<p>Ponyta is a great offensive Pokemon thanks to its versatility, bulk, and high Speed stat allowing it to outpace most of the unboosted metagame and dent most teams. It also has great coverage options in High Horsepower and Wild Charge, can use Flame Charge to outpace Diglett and most Choice Scarf users, and has utility options like Will-O-Wisp and Morning Sun. Furthermore, its ability Flame Body gives a chance to cripple physical attackers like Mienfoo and Pawniard. However, Ponyta's weakness to entry hazards, especially Stealth Rock, makes it easier to wear down. Ponyta suffers from trappers such as Diglett and Trapinch, as Diglett traps, outpaces, and revenge kills non-Flame Charge Ponyta while Trapinch can take care of Ponyta at the cost of most of its health.</p> ",
    "comments": "<h1>Other Options</h1> <p>Sunny Day + Solar Blade can be used in order to lure in and take out Water-types such as Staryu and Ground-types such as Onix; however, the turn needed to set up Sunny Day makes this unreliable.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Pokemon like Staryu, Frillish, and Mareanie take care of Ponyta with Scald.</p> <p><strong>Earthquake: Onix, Archen, Tyrunt, and Mudbray can give Ponyta trouble due to Earthquake OHKOing it. Weak Armor Onix can outpace Ponyta after coming in on Flare Blitz and take care of it with Earthquake.</p> <p><strong>Trappers: Diglett revenge kills Ponyta. Trapinch can also trap Ponyta and take care of it with Earthquake, but only at the cost of much of its health.</p> <p><strong>Porygon: Porygon gives Ponyta trouble due to its high bulk withstanding Ponyta's attacks and Tri Attack or Thunder Wave doing major damage to Ponyta or slowing it down.</p> ",
    "sets": [
      {
        "name": "Eviolite",
        "description": "<h1>Moves</h1> <p>Flare Blitz does decent damage to any Pokemon that does not resist it and takes care of Steel- and Grass-types such as Pawniard, Ferroseed, and Foongus. High Horsepower is able to hit common switch-ins to Ponyta super effectively, like Mareanie and Onix. Flame Charge can be run over High Horsepower or Will-O-Wisp to avoid being trapped by Diglett after a KOing a Pokemon. Alternatively, Wild Charge gives Ponyta a way to hit Water-types such as Wingull, Staryu, and Mareanie. Will-O-Wisp cripples physical attackers such as Pawniard, Trapinch, Mienfoo, and Onix. Morning Sun allows Ponyta to keep itself healthy and outlast a burned Trapinch's Earthquake.</p> <h1>Set Details</h1> <p>Ponyta runs 196 Speed EVs to outpace Onix and Mienfoo and Speed tie Wingull, Staryu, and Abra. 76 Attack EVs make Ponyta's attacks a bit stronger. 156 Defense EVs with Eviolite make Ponyta able to take physical attacks from Mienfoo, Pawniard, and a burned Onix. Flame Body gives Ponyta a chance to burn physical attackers such as Mienfoo and Pawniard when they use contact moves.</p> <h1>Usage Tips</h1> <p>Be wary about leaving Ponyta in or double switching to it if the opponent has a Diglett, because it can trap Ponyta and take care of it. Use Ponyta early-game to status Pokemon and cripple physical foes like Mienfoo and Trapinch with Will-O-Wisp. However, be wary about using Will-O-Wisp on Timburr, as Guts variants can use the Attack boost to KO Ponyta. Switch Ponyta into contact moves like Pawniard's Iron Head and Mienfoo's Fake Out to try to get a burn from Flame Body. Ponyta can also switch into predicted attacks from Grookey, Ferroseed, and Foongus, as their attacks do not do much to it, and it can use the opportunity to do major damage to these with Flare Blitz or predict a switch and use High Horsepower or Will-O-Wisp. Make sure that entry hazards are not on the field before Ponyta tries to switch in, as they will cripple it. Use High Horsepower on a predicted switch to Onix or Mareanie. If running Flame Charge, use it on a predicted switch or on a weakened Pokemon to avoid Diglett coming in, trapping Ponyta, and taking care of it with Earthquake.</p> <h1>Team Options</h1> <p>Grass-types such as Foongus, Grookey, and Ferroseed are good to pair with Ponyta because they check Ground- and Water-types like Onix, Mudbray, and Staryu. Foongus can also use Spore to force switches and sponges attacks from Mienfoo, while Grookey provides passive recovery with Grassy Terrain. Ferroseed can use Thunder Wave to cripple Mareanie and opposing Ponyta or use Knock Off to make it easier for Ponyta to KO them. Stealth Rock and Spikes setters like Onix and Ferroseed help Ponyta sweep late-game. Onix's Rock / Ground typing is especially useful to check opposing Ponyta; Ferroseed is able to come in on Water-type attacks from Staryu. Defog and Rapid Spin users such as Timburr and Staryu remove Stealth Rock, which greatly hinders Ponyta from freely switching in; Timburr can also use Knock Off to soften Pokemon like Mareanie and Mienfoo. Staryu can also take care of Mudbray and Onix with its Water STAB moves and has Thunderbolt to help with opposing Water-types like Mareanie and opposing Staryu. Trapinch traps Pokemon that usually check Ponyta, like Onix and Diglett, while Trace Porygon is a great option to counter-trap Trapinch and Diglett, making it easier for Ponyta to drop Flame Charge in favor of one of its coverage moves.</p> "
      },
      {
        "name": "Berry Juice",
        "description": "<h1>Moves</h1> <p>Flare Blitz is the main way to do damage and can take care of Pawniard, Foongus, and Ferroseed. Flame Charge allows Ponyta to outspeed and beat Diglett that try to trap it. High Horsepower hits Mareanie and Onix. Wild Charge is used to let Ponyta better take on Water-types like Staryu, Frillish, and Wingull.</p> <h1>Set Details</h1> <p>236 Attack EVs allow Ponyta to wallbreak better. 196 Speed EVs with a Jolly nature make Ponyta outpace Onix and Mienfoo while Speed tying Wingull, Staryu, and Abra. Berry Juice makes Ponyta recover more easily from recoil and Stealth Rock damage, going particularly well with Wild Charge. Flash Fire allows Ponyta to absorb opposing Ponyta's STAB attacks, as well as moves like Natu's Heat Wave and Galarian Ponyta's Mystical Fire.</p> <h1>Usage Tips</h1> <p>Do not switch Ponyta in on strong attacks like Abra's Psychic and Mienfoo's High Jump Kick, as it cannot take these attacks well. Switch Ponyta into predicted attacks from Ferroseed and Grookey, as it takes their attacks well. Use Flame Charge on forced switches to allow Ponyta to outpace all of the unboosted metagame and most Choice Scarf users; this also stops Diglett from trapping it. Use Flare Blitz to do decent damage to most Pokemon, especially when Pokemon that resist it are KOed or have low HP. Use High Horsepower on predicted switches to Onix and Mareanie, and, if running Wild Charge, use it to do major damage to Staryu and Frillish. Be wary about switching into Knock Off users such as Pawniard, as Ponyta will lose its only way to recover HP, becoming easier to take care of. Ponyta can be kept until late-game to clean up weakened teams once trappers such as Trapinch and Diglett and Water-types like Mareanie and Staryu are gone. Be careful about attacking with Ponyta when Diglett or Trapinch is present, as both can trap Ponyta and take care of it with Earthquake.</p> <h1>Team Options</h1> <p>Counter-trappers like Trace Porygon and trappers like Trapinch are good to pair with Ponyta to get rid of Diglett. Fighting-types such as Timburr and Mienfoo go well with Ponyta because they can use Knock Off to get rid of items and make it easier to sweep. Defog and Rapid Spin users like Timburr and Staryu are needed in order to prevent Ponyta from taking extra damage. Timburr can also help against Onix, while Staryu can help with Ground-types like Mudbray and Drilbur. Onix, Mudbray, and Ferroseed help Ponyta sweep by setting entry hazards to wear down opposing Pokemon. Ferroseed can also help with Water-types like Staryu, while Mudbray can come in on opposing Onix's attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Ponyta-Galar": {
    "overview": "<p>Galarian Ponyta is a good special attacker because of its Psychic typing, good coverage options, and good Speed stat. It can also use Calm Mind to boost its Special Attack stat and turn into a dangerous sweeper. However, Galarian Ponyta struggles with taking physical attacks because of its low Defense stat and is weak to Knock Off. Galarian Ponyta has additional problems with Diglett and Trapinch trapping and OHKOing it due to its low Defense stat. It also struggles with Pawniard, as Sucker Punch OHKOes it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Double Kick is an option with Life Orb to do significant damage to Pawniard. Substitute gives Galarian Ponyta more opportunities to fire off attacks and can be useful in Sucker Punch mindgames against Pawniard. A physical set with Zen Headbutt, Wild Charge, and Double Kick can potentially surprise a foe and hit major checks like Natu and Pawniard.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Pawniard is able to threaten Galarian Ponyta with Sucker Punch or Knock Off. However, Pawniard should be wary of Mystical Fire.</p> <p><strong>Ghost-types</strong>: Frillish gives Galarian Ponyta a problem because of its bulk, allowing it to take attacks from Galarian Ponyta and use Will-O-Wisp + Hex to take care of it.</p> <p><strong>Arena Trap: Arena Trap users like Diglett and Trapinch give Galarian Ponyta trouble, as they can take care of it with Sucker Punch, Earthquake, or First Impression.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<h1>Moves</h1> <p>Psychic allows Galarian Ponyta to do major damage to Mareanie and Mienfoo. Mystical Fire makes Galarian Ponyta able to OHKO Steel-types such as Ferroseed as well as 2HKO Pawniard. Protect is mainly used to avoid getting OHKOed by Trapinch's First Impression and block Mienfoo's Fake Out, but it can also serve as a way to play mind games with Sucker Punch users such as Pawniard. Morning Sun allows Galarian Ponyta to keep itself healthy while setting up with Calm Mind. Calm Mind allows Galarian Ponyta to be a fearsome mid- to late-game sweeper once its checks like Diglett and Pawniard are gone.</p> <h1>Set Details</h1> <p>Pastel Veil is used to avoid getting poisoned by Sludge Bomb from Foongus and Mareanie. Running 196 Speed EVs and a Timid nature allows Galarian Ponyta to Speed tie with Abra. Eviolite is the preferred item so Galarian Ponyta can set up with Calm Mind more easily and take attacks from Natu and Abra.</p> <h1>Usage Tips</h1> <p>Make sure that Diglett and Trapinch are KOed before trying to sweep, as these two can trap Galarian Ponyta and OHKO it with Earthquake or, in the latter's case, First Impression if Galarian Ponyta is not running Protect. Use Protect to avoid being OHKOed by Trapinch's First Impression and play mind games with Pawniard's Sucker Punch. Galarian Ponyta should try to set up mid- to late-game to sweep once threats such as Pawniard and Frillish are gone. It can also set up on Pokemon that do not threaten it like Mareanie and Foongus. Be careful around priority users such as Pawniard and Grookey, as these will either heavily chip or OHKO Galarian Ponyta. Avoid taking physical attacks from Pokemon such as Ponyta due to Galarian Ponyta's poor Defense stat.</p> <h1>Team Options</h1> <p>Stealth Rock and Spikes setters like Onix and Ferroseed can set  entry hazards for Galarian Ponyta to make it easier to sweep late-game. Galarian Ponyta also appreciates having Stealth Rock up to help wear down Natu. Mudbray can also be used for its ability to take care of Pawniard and Onix while also setting up Stealth Rock. Galarian Ponyta struggles against Pawniardy, so Pokemon such as Trapinch  make great partners. Galarian Ponyta also struggles against Frillish, so having a Dark-type such as Pawniard is great to take care of it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 240933, "username": "tazz"}, {"user_id": 195129, "username": "Nineage"}, {"user_id": 420389, "username": "Stoward"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Slowpoke": {
    "overview": "<p>Slowpoke's typing and bulk allow it to act as a blanket check to many Pokemon, such as Onix and Staryu, as well as check Psychic- and Fire-types effectively. Moreover, Slowpoke sports a handful of great utility moves. These include Teleport, which synergizes well with Regenerator and allows a teammate to be brought in safely, and Slack Off, which gives it reliable healing, as well as Scald, Thunder Wave, and Fire Blast. However, Slowpoke is very slow, and its typing leaves it with weaknesses to STAB attacks from common presences such as Vullaby, Pawniard, Grookey, and Magnemite as well as common coverage from Pokemon Slowpoke tends to soft check throughout a match, such as Staryu's Thunderbolt, Timburr's and Mienfoo's Knock Off, and U-turn from a number of threats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Wave can be used to cripple opposing Pokemon, which a slower teammate can take advantage of. Fire Blast threatens Ferroseed and Pawniard, and it eases prediction against teams carrying both Foongus and Pawniard. Zap Cannon super effectively hits the likes of Flying- and Water-types, but its inconsistent accuracy often makes it a poor choice.</p> <h1>Checks and Counters</h1> <p><strong>Knock Off and U-turn: Knock Off and U-turn are widespread moves that hit Slowpoke super effectively. Knock Off hinders Slowpoke in the long run and can be used quite easily on Slowpoke, since it is slow. Pokemon Slowpoke soft checks such as Mienfoo, Timburr, and Mareanie can pack Knock Off. U-turn makes gaining momentum against Slowpoke by forcing it out a breeze, which can prove detrimental to teams needing the momentum Slowpoke could offer.</p> <p><strong>Dark-types: Vullaby, Pawniard, and Scraggy are immune to Slowpoke's Psychic-type moves and can take advantage of it being on the field. Pawniard can freely set Stealth Rock, and Nasty Plot Vullaby and Scraggy can set up on Slowpoke. Furthermore, Dark-types tend to pack a dreaded STAB Knock Off, threatening Slowpoke with an OHKO, and Vullaby can pack U-turn. However, these Dark-types dislike Scald burns and Thunder Wave, and Pawniard must beware of Fire Blast.</p> <p><strong>Grass-types: Ferroseed can take the free turns Slowpoke gives it to stack entry hazards, remove items with Knock Off, or spread paralysis. Grookey threatens Slowpoke with Grassy Glide and Wood Hammer, and it can set a Swords Dance up upon forcing Slowpoke out, which makes it an even bigger threat. Foongus can 2HKO Slowpoke with Giga Drain, but it struggles against Slowpoke's Psychic. Slowpoke's Grass-type switch-ins must, however, be wary of the rare Fire Blast, and Grookey and Ferroseed also dislike Scald burns.</p> <p><strong>Electric-types: Magnemite can come in and use Volt Switch on Slowpoke very freely, although it dislikes being burned by Scald. It must also account for Fire Blast. Chinchou isn't bothered by these but dislikes switching in repeatedly, especially on Psychic-type moves.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<h1>Moves</h1> <p>Scald threatens common switch-ins such as Pawniard, Vullaby, and Ferroseed with a burn. Future Sight is Slowpoke's main way of applying offensive pressure to foes, taking advantage of Slowpoke forcing Pokemon such as Foongus, Koffing, Mareanie, and Ponyta out and Psychic-resistant Pokemon in, which can be taken advantage of by teammates. Psychic is an alternative to Future Sight that allows it to hit foes directly. Teleport synergizes with Future Sight and Regenerator and can allow a threatening teammate to get on the field safely.</p> <h1>Set Details</h1> <p>Regenerator allows Slowpoke to repeatedly switch into the likes of Abra, Vulpix, and Ponyta and check them throughout the game. 116 HP EVs give Slowpoke 27 HP, which means it will recover 9 HP with Regenerator. Both defenses reach even numbers to get the most out of Eviolite's boosts. The maximized Special Defense patches up Slowpoke's low natural special bulk. The EVs dumped into Special Attack ensure it can 2HKO Foongus with Psychic or deal decent damage to most targets with Future Sight. A spread more focused on physical bulk of 116 HP / 236 Def / 116 SpA / 36 SpD can be used, which allows Slowpoke to check Mudbray and Onix better at the cost of compromising special bulk. Slowpoke's Eviolite is very important to maintain its bulk in order to check threats throughout the game.</p> <h1>Usage Tips</h1> <p>Slowpoke should be switched in against Pokemon it checks or soft checks when it is healthy. It should focus on finding room to launch Future Sight if running this attack and making good use of Teleport, taking advantage of forced switches to bring in threatening Pokemon safely. When its health is low, Slowpoke should be switched out to recover HP thanks to Regenerator. It can also use Slack Off when up against Pokemon it checks to keep itself healthy. Slowpoke should be wary of Knock Off, since it can reduce its effectiveness for the remainder of the game. As such, switching it in on Pokemon that oftentimes carry Knock Off such as Timburr and Mienfoo isn't a wise decision, even if Slowpoke resists their STAB moves and could otherwise freely switch in to be eligible for Regenerator. Scald should be used to threaten its usual switch-ins in Pawniard, Vullaby, and Ferroseed and when firing off a Future Sight isn't needed.</p> <h1>Team Options</h1> <p>As Slowpoke is very weak to Knock Off, Knock Off absorbers such as Mienfoo, Timburr, and Spritzee are great teammates. They like Slowpoke's ability to handle Psychic-, Fire-, and Poison-types and can handle the Dark-types Slowpoke tends to invite in. Fighting-types like Mienfoo and Timburr also provide Knock Off support and can handle the Steel-types that Slowpoke often invites in well. Mienfoo and Slowpoke form a fairly good Regenerator core due to their pivoting moves, whereas Timburr can provide hazard removal to a team. Poison-types such as Foongus and Koffing handle Grookey and can remove Toxic Spikes from the field, which Slowpoke greatly appreciates. In turn, Slowpoke can handle threatening Psychic- and Fire-types for them. Ponyta can also check Grookey for Slowpoke and likes Slowpoke soft checking Water-types. Pokemon such as Grookey, Magnemite, and Vullaby form a VoltTurn core with Slowpoke and can cover some of its weaknesses. Strong attackers such as Choice item Mienfoo and Vulpix like Teleport support and Future Sight preventing common checks from stomaching an attack. Lastly, trappers such as Diglett and Trapinch can remove troublesome foes for Slowpoke, such as Magnemite and Pawniard, and like Teleport support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410251, "username": "zizalith"}, {"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 438243, "username": "PyProd"}]}
  },
  "Magnemite": {"sets": [{"name": "SturdyJuice"}, {"name": "Choice Scarf"}]},
  "Farfetch’d-Galar": {
    "overview": "<p>Galarian Farfetch'd is a very threatening wallbreaker in LC thanks to its decent Attack stat and Speed tier. Powerful attacks in Close Combat and Brave Bird combined with its ability Scrappy also provide it with perfect neutral coverage. It also has impressive coverage options in Knock Off and Poison Jab; the former allows it to remove items, and the latter allows it to effectively pressure Spritzee. Its Speed tier also allows it to outspeed a good portion of the unboosted metagame and act as an effective Choice Scarf user, as it's able to most notably outspeed Choice Scarf Vullaby and +1 Corphish. However, Galarian Farfetch'd is greatly threatened by Pokemon that naturally outspeed it such as Ponyta, Galarian Ponyta, and Wingull, which can all either dish out heavy damage to it or cripple it with burns from Will-O-Wisp or Scald. Furthermore, Galarian Farfetch'd faces competition from Timburr, which offers better role compression and a semi-reliable recovery with Drain Punch, while Galarian Farfetch'd boasts access to Swords Dance and a better Speed tier.</p> ",
    "comments": "<h1>Other Options</h1> <p>Galarian Farfetch'd tends to have few other viable options available due to the brilliant coverage that the combination of Close Combat, Brave Bird, and Knock Off offers. A set running Life Orb and Substitute can be run, typically on Sticky Web offense teams to fully utilize Galarian Farfetch'd's Speed tier and allow it to always get a free attack in thanks to Substitute. Berry Juice can be used in place of Eviolite, giving Galarian Farfetch'd a form of passive recovery in exchange for extra bulk. An all-out attacking set can be used, forgoing Swords Dance for Poison Jab or Quick Attack, making Farfetch'd more of a standard wallbreaker rather than a sweeper. Quick Attack is a viable option on the Swords Dance set, allowing it to pick off faster, weakened foes; especially at +2; such as Ponyta, Galarian Ponyta, and Diglett. Defog could be used in place of Swords Dance or in place of Poison Jab on the Choice Scarf set if the role compression requires it. However, Timburr heavily outclasses Galarian Farfetch'd as a Fighting-type Defogger due to it having better bulk and recovery in Drain Punch. Eject Pack can be used as a way to use Close Combat on Mareanie or Spritzee and then trap them with Diglett or Trapinch.</p> <h1>Checks and Counters</h1> <p><strong>Spritzee: Spritzee takes minimal damage from an unboosted Brave Bird and can recover it off with Wish and Protect while dishing out heavy damage with Moonblast. It does, however, have to be wary of Knock Off and Poison Jab.</p> <p><strong>Faster Wallbreakers</strong>: While it doesn't enjoy switching in on Knock Off, Galarian Ponyta naturally outspeeds Galarian Farfetch'd. Life Orb sets are able to OHKO Galarian Farfetch'd with Psychic, while Eviolite sets do a minimum of 81%. Wingull also KOes Galarian Farfetch'd with Hurricane or can cripple it with burns from Scald. None of them appreciate switching into Knock Off, though.</p> <p><strong>Vullaby: Vullaby is able to survive any unboosted attack, gain a +2 Speed boost thanks to Weak Armor, and OHKO Galarian Farfetch'd in return with Brave Bird.</p> <p><strong>Mareanie</strong>: Mareanie can shrug off any attack from Galarian Farfetch'd and recover off the damage. While it doesn't appreciate a boosted Brave Bird, it can set up with Iron Defense, leaving it unfazed by the boosts, as well as potentially burn it with Scald.</p> <p><strong>Koffing</strong>: Koffing has enough natural bulk to take little damage from Brave Bird and is able to cripple Galarian Farfetch'd with Will-O-Wisp.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Moves</h1> <p>Swords Dance turns Galarian Farfetch'd into a powerful sweeper. Close Combat is Galarian Farfetch'd's main attacking move, dishing out heavy damage to neutral targets, while Brave Bird hits common Fighting-resistant Pokemon such as Oddish as well as Fighting-types like Timburr and opposing Galarian Farfetch'd for super effective damage. Knock Off is used to remove items from opposing Pokemon, making it easier to break through them.</p> <h1>Set Details</h1> <p>Maximum Attack and Speed EVs alongside a Jolly nature ensure that that Galarian Farfetch'd Speed ties threats such as Vullaby and Pawniard and hits them as hard as possible. The remaining EVs are placed in HP alongside an Eviolite to provide Galarian Farfetch'd with extra bulk and give it more opportunities to use Swords Dance. Scrappy enables Galarian Farfetch'd to hit Ghosts-types such as Frillish with Close Combat, allowing it to use the move with little drawback.</p> <h1>Usage Tips</h1> <p>While there are a large number of foes that Galarian Farfetch'd is able to beat one-on-one, it doesn't really appreciate switching in on most of the foes that beat it, as they can remove its Eviolite with Knock Off or cripple it with status from Body Slam or Thunder Wave. Bringing it in after a teammate has been KOed, through U-turn from Vullaby, or on a well-predicted double switch is recommended to avoid having Galarian Farfetch'd be in undesirable situations. Galarian Farfetch'd is better off attacking foes early-game, as using a single attack to break through teams can also bluff Choice Scarf sets. Early-game, Knock Off should be used to remove items from opposing Pokemon to make it easier for Galarian Farfetch'd to sweep. Once everything is in range of Galarian Farfetch'd's boosted attacks, it should try to look for an opportunity to set up on a Pokemon that matches up poorly against it, such as Munchlax, Ferroseed, or Pawniard, and proceed to sweep through the opposing team.</p> <h1>Team Options</h1> <p>Swords Dance Farfetch'd does well on a variety of teams due to most of its checks and counters generally having a difficult time actively switching into it. Sticky Web support from Dewpider is fantastic for Galarian Farfetch'd, as it allows it to outspeed the entire unboosted tier, making it incredibly difficult to switch into. Ferroseed is an especially useful partner, as it's able to potentially offer Spikes support while also being one of the most consistent checks to Spritzee and potentially immobilizing faster threats such as Ponyta and Galarian Ponyta with Thunder Wave. Pawniard's and Onix's resistance to Flying-type attacks is also incredibly appreciated by Galarian Farfetch'd, as they provide the team with a much-needed switch-in to Vullaby. VoltTurn support from Chinchou and Vullaby is very useful to make it easier for Galarian Farfetch'd to enter the battlefield. Trapping support from Diglett is also greatly appreciated by Galarian Farfetch'd, as they can both assist each other in removing Mareanie, and Diglett is also able to utilize its Speed tier to trap and remove faster threats such as Ponyta and Galarian Ponyta, making Galarian Farfetch'd harder to revenge kill.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Moves</h1> <p>Poison Jab allows Farfetch'd to dish out heavy damage to Spritzee. Final Gambit can be used as a suicide option, allowing Galarian Farfetch'd to trade with an opposing Pokemon. Defog is also a viable option over Poison Jab, allowing Galarian Farfetch'd to act as an entry hazard remover.</p> <h1>Set Details</h1> <p>Maximum Attack and Speed EVs alongside a Jolly nature ensure that Galarian Farfetch'd outspeeds the entire unboosted tier with a Choice Scarf, as well as neutral-natured Choice Scarf Vullaby, while hitting as hard as possible. The remaining EVs are placed in HP to provide Galarian Farfetch'd with extra bulk. Scrappy is the ability of choice, giving Galarian Farfetch'd perfect neutral coverage with Close Combat and Brave Bird.</p> <h1>Usage Tips</h1> <p>Choice Scarf Galarian Farfetch'd is used primarily as a revenge killer. It is important that Galarian Farfetch'd avoids switching in directly on attacks and is instead brought in once its teammates are KOed or with VoltTurn support from Chinchou or Vullaby. It's especially important to consider what moves Choice Scarf Galarian Farfetch'd is locking itself into, as Close Combat has low PP, and Galarian Farfetch'd is quite vulnerable to being KOed in return if it fails to land a KO with Close Combat due to the drops in Defense and Special Defense, while the recoil damage from Brave Bird can result in Galarian Farfetch'd being worn down rather quickly. Poison Jab should only really be used against Spritzee, as being locked into the move can result in Galarian Farfetch'd giving away free opportunities for Steel-types such as Ferroseed and Pawniard to set entry hazards while also providing Pawniard with the opportunity to set up with Swords Dance freely.</p> <h1>Team Options</h1> <p>Vullaby and Chinchou are useful partners for Galarian Farfetch'd, as their VoltTurn support makes it easier for it to switch into the battlefield, while both partners can appreciate Galarian Farfetch'd's ability to remove Ferroseed and Pawniard as well as Onix after some chip damage. Vullaby is an especially noteworthy partner, as its Knock Off makes Galarian Farfetch'd's job easier by removing additional bulk from Mareanie, Koffing, and Spritzee. Ferroseed is especially useful as well, as it's able to potentially offer Spikes support while also being one of the most consistent checks to Spritzee. Furthermore, it provides the team with a more reliable answer to Oddish and additional Knock Off support, which makes it easier for Galarian Farfetch'd to break through teams. Wallbreakers such as Corphish and Timburr are valuable partners, as they provide teams with more offensive presence while also having access to priority moves, assisting Galarian Farfetch'd with revenge killing faster foes, which can be especially useful for dealing with Dragon Dance Onix, which outspeeds Galarian Farfetch'd at +1 and is able to KO it with Earthquake.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 150971, "username": "Coconut"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 420389, "username": "Stoward"}]}
  },
  "Shellder": {
    "overview": "<p>Shellder can transform into a fearsome sweeper with its access to Shell Smash and Skill Link backed up by a good Attack stat and Speed tier. Skill Link-assisted multi-hit moves are what separates Shellder from other sweepers in the tier, as LC's damage mechanics make multi-hit moves very powerful, and they can break through Substitute and Focus Sash with ease, which other sweepers have trouble against. Shellder can also find ample opportunities to set up and stay on the field thanks to its great Defense stat and good defensive typing. However, Shellder's poor Special Defense leaves it vulnerable to even weaker special attackers like Mareanie and Spritzee. Shellder is also quite reliant on Shell Smash boosts to be a threat, and with the set's lack of utility, it can be hard to fit on teams not built around it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rapid Spin lets Shellder perform the role of an entry hazard remover, which can be useful for preserving the longevity of many entry hazard-vulnerable teammates. Life Orb allows Shellder to OHKO a wider variety of bulky Pokemon after a Shell Smash; however, the lack of bulk and the HP reduction for every attack means more intensive support is required for Shellder to set up and tank priority moves. Choice Scarf's immediate Speed jump means Shellder can revenge kill faster Pokemon such as Wingull and Diglett, but Shellder will be outsped by faster Choice Scarf users, will not have the immediate power to clean like those other Choice Scarf users, and will struggle dealing against bulkier Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Pokemon: Ferroseed is bulky enough to survive a +2 Icicle Spear and can often KO Shellder with Bullet Seed in return or paralyze it with Thunder Wave if a teammate can more reliably take care of Shellder. Munchlax is resistant to Icicle Spear thanks to Thick Fat and can tank Rock Blast to then KO with Double-Edge if Shellder has sustained chip damage. Spritzee is also just inherently bulky, being able to tank Icicle Spear well and KO with Moonblast after chip damage. Water-types like Mareanie and Frillish are resistant to Icicle Spear, with the latter also being immune to Water, can tank a +2 Rock Blast at full health, and can KO Shellder with their STAB moves; Frillish can even inflict a burn with Will-O-Wisp or reduce Shellder's Attack and heal itself with Strength Sap.</p> <p><strong>Revenge Killers: Shell Smash's Defense drops make Shellder more susceptible to being picked off by priority users like Timburr, Pawniard, and Trapinch. Timburr can also tank a +2 Icicle Spear at full health and retaliate with Drain Punch followed up by Mach Punch. Pawniard poses a huge threat, as it resists both of Shellder's multi-hit moves, can survive a +2 Liquidation at full, and can dent Shellder with Knock Off before finishing it off with Sucker Punch. Croagunk is immune to Water and can target Shellder's far lower Special Defense with Vacuum Wave. Diglett can pose a threat, as it carries Sucker Punch; furthermore, Choice Scarf variants are able to outspeed +2 Speed Shellder and revenge kill it either way. Choice Scarf Wingull, although rare, outspeeds non-Jolly variants and can revenge kill with Hurricane; meanwhile, the seldom-used Sand Rush Drilbur outspeeds Shellder under sand and can KO it with Earthquake.</p> ",
    "sets": [
      {
        "name": "Shell Smash",
        "description": "<h1>Moves</h1> <p>Shell Smash is what turns Shellder into a dangerous sweeper, doubling both offense and Speed stats at the cost of lowering defenses. Icicle Spear and Rock Blast are both multi-hit moves, which are quite unique in LC because each hit is deceptively strong on its own due to the lower level of Pokemon, and the fact that each hit has its own damage roll means there is a greater chance that one of those hits will be a high damage roll. This causes the multi-hit moves to do more damage than Shellder's STAB Liquidation against most threats. Icicle Spear is the go-to move against most Pokemon, as it has perfect accuracy, taking care of Vullaby, Onix, and Trapinch with ease and OHKOing neutral targets like Wingull and Galarian Farfetch'd after Shell Smash. Rock Blast is used to target foes that resist Ice such as Thick Fat Munchlax, Ponyta, and Water-types like Corphish and Mareanie. For the last slot, STAB Liquidation rounds out Shellder's coverage, as it is the best way to hit Pawniard and Mudbray and is the most reliable way to not activate Berry Juice on users such as Munchlax. Ice Shard is useful to avoid being revenge killed by fast Choice Scarf users like Diglett and to set up against and beat both Onix and Vullaby after a Weak Armor boost. Protect is also an option to primarily block First Impression from Trapinch as well as Fake Out from Meowth and can be used to stall out the sun or poisoned Pokemon if necessary.</p> <h1>Set Details</h1> <p>Eviolite gives Shellder extra bulk, so it has an easier time setting up. The EV spread maximizes Shellder's offenses stats, allowing it to outspeed +1 Speed Onix and Drilbur after Shell Smash, with the remaining EVs going into HP and Defense for more survivability. With a Jolly nature, Shellder can outspeed Adamant Corphish before Shell Smash, and after a Shell Smash, Shellder can outspeed the entire unboosted metagame under Sticky Web and up to 19 Speed Choice Scarf users normally. An Impish nature makes it easier to set up on physical Pokemon like Onix and to tank priority moves after setting up such as Mach Punch from Timburr or Sucker Punch from Diglett. Lastly, an Adamant nature is an option that gives Shellder an easier time to get past Berry Juice Onix and 15 Defense Eviolite users like Timburr.</p> <h1>Usage Tips</h1> <p>When attempting a sweep, it is best to remove or weaken any Pokemon Shellder has a hard time beating, such as Ferroseed and Mareanie, and also to remove threatening Pokemon such as Chinchou. Pokemon with access to priority moves like Timburr and Pawniard should also be removed as to not risk ending a sweep prematurely. If it is necessary to set up before these checks are removed, be mindful of the damage you take, as every extra bit of damage taken means Shellder will have a harder time setting up or tanking priority moves. Although it should not switch into them directly, physically inclined Pokemon, most notably Onix and Vullaby, are prime setup fodder for Shellder, as its high Defense stat allows it to tank their hits well. It also helps if the Pokemon Shellder sets up on is initially faster as to not take extra damage due to Shell Smash dropping defenses. Shellder could also be sent in early- or mid-game if it wants to weaken any checks, as they still take a great deal from its multi-hit moves; however, it should try to avoid any damage, as that can give it difficulties setting up later on.</p> <h1>Team Options</h1> <p>Pokemon with Knock Off make for great teammates, as they can soften up walls like Mareanie, Spritzee, and Ferroseed by removing their Eviolite and Berry Juice. Vullaby is a great teammate because it has Knock Off, can lure in threats like Onix that Shellder can set up on and pivot it in safely thanks to U-turn, and can remove troublesome entry hazards with Defog. Galarian Farfetch'd and Timburr too carry Knock Off and Defog, and they can deal with Ferroseed and Munchlax easily while functioning as good wallbreakers. Entry hazard support from Onix, Ferroseed, and Pawniard is great at chipping away the opponent's Pokemon, which can aid Shellder tremendously with achieving KOs it would otherwise narrowly miss out on, with Ferroseed and Pawniard also able to carry Knock Off. Trappers like Trapinch and Diglett can remove troublesome Pokemon like Mareanie, Pawniard, and Chinchou, with Diglett being able to provide Memento support to greatly help Shellder upon setting up. Since Shellder is vulnerable to all entry hazards, Pokemon that can remove them such as the aforementioned Vullaby and Galarian Farfetch'd as well as Drilbur are well appreciated to give Shellder more longevity when attempting to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 55063, "username": "Corporal Levi"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 384270, "username": "martha"}]}], "writtenBy": [{"user_id": 264307, "username": "crusty"}]}
  },
  "Onix": {
    "overview": "<p>Onix is an LC staple thanks to its diverse set of abilities, key resistances, and role as a Stealth Rock setter. Its part Rock typing and high natural Speed and Defense make it a solid check to major threats like Vullaby and Ponyta. Its suite of abilities lets it wear many hats; with Weak Armor, it can be a potent revenge killer and force fast threats like Ponyta out, and with Rock Head alongside Dragon Dance, it can harness the power of Head Smash and become a devastating sweeper. Additionally, Sturdy and Berry Juice can make Onix a blanket check to threats in the metagame due to its durability. Despite these many great qualities, though, the metagame is rife with Onix checks, and Onix must beware the ever-present Arena Trap users, Trapinch and Diglett, as well as common Fighting-, Water-, Grass-, and Ground-types. Onix can also be a difficult team fit as an entry hazard setter that does not deal well with the tier's special attackers while struggling with the ubiquitous Mienfoo.</p> ",
    "comments": "<h1>Other Options</h1> <p>Stone Edge is an option on Weak Armor and Sturdy Onix to more reliably OHKO standard Vullaby, though it falls short against Eviolite variants. Life Orb allows Rock Head Onix to hit hard enough to surprise and overwhelm would-be checks, though it greatly sacrifices durability.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: Mienfoo's exceptional physical bulk and Regenerator allow it to come into Onix repeatedly and threaten it out with High Jump Kick or make progress with Knock Off or U-turn. Timburr resists Rock Blast and Head Smash, can KO Onix with Drain Punch while keeping itself healthy, and can remove Stealth Rock with Defog. Mach Punch also threatens weakened Dragon Dance and Weak Armor Onix. Timburr can be worn down by repeatedly switching into Earthquake, though, and Onix can both KO a weakened Timburr and deny Defog with Explosion. Scraggy can set up on Onix with Dragon Dance, though it must be wary of Body Press.</p> <p><strong>Arena Trap Users: Diglett and especially Trapinch can trap and KO Onix. Onix must beware switching into Vullaby's U-turn if either Arena Trap user is on the opposing team, although Weak Armor can prevent Diglett from KOing Onix. Trapinch switches into any attack from Onix with relative ease and can both keep itself healthy and KO Onix with Giga Drain.</p> <p><strong>Grookey: Grookey weaks Onix's Earthquake with Grassy Terrain while threatening a OHKO with Grassy Glide. It can also force Onix out and set up for a sweep with Swords Dance. However, Grookey is frail and cannot switch into Onix's Rock-type moves well.</p> <p><strong>Bulky Grass-, Water-, and Ground-types</strong>: A variety of bulky Pokemon take hits from Onix well while threatening to KO it with their own STAB moves, including Foongus, Ferroseed, Staryu, Frillish, and Mudbray. Each of these Pokemon, however, can be overwhelmed through switching into Onix repeatedly, having their Eviolites removed, and Dragon Dance boosts. Staryu can remove Onix's entry hazards and outspeed and KO it with ease.</p> ",
    "sets": [
      {
        "name": "Weak Armor",
        "description": "<h1>Moves</h1> <p>Earthquake is Onix's most reliable move, threatening common Ground-weak Pokemon like Pawniard, Ponyta, and Mareanie while dealing decent damage to neutral foes. High Horsepower should be run on teams with Grookey as its damage is not reduced by Grassy Terrain, though it is slightly less reliable. Rock Blast is the best Rock-type move thanks to the way the damage of multi-hit moves is calculated in LC, and it deals heavy damage to Vullaby and breaks Focus Sash and Sturdy on Pokemon like Abra and Dwebble. Stealth Rock provides crucial entry hazard support. Explosion doles out a massive hit and maintains offensive momentum in situations after Stealth Rock has been set when Onix is likely to be KOed, such as against Eviolite Diglett and Trapinch. Taunt is a niche option that can prevent sweepers like Scraggy and Nasty Plot Vullaby from setting up.</p> <h1>Set Details</h1> <p>Weak Armor paired with Eviolite allows Onix to take a physical hit and threaten back with its boosted Speed. This Speed boost even allows it to beat some Choice Scarf and Shell Smash users, outspeed Ponyta after switching into a hit, and prevent Diglett trapping Onix following an opposing Vullaby's U-turn. Maximum Speed and Attack investment with a Jolly nature bolsters Onix's otherwise lackluster offensive presence while allowing it to always outspeed Vullaby and Pawniard and Speed tie with 17 Speed Pokemon like Mienfoo, Grookey, and Natu.</p> <h1>Usage Tips</h1> <p>Weak Armor Onix should be used to set Stealth Rock while being strategically deployed to check faster physical threats with Weak Armor boosts. This set is among the most effective offensive checks to Ponyta and physically offensive Vullaby, as it outspeeds Ponyta after taking an attack and Diglett after an opposing Vullaby U-turn; however, beware Ponyta's Will-O-Wisp.</p> <h1>Team Options</h1> <p>Weak Armor Onix fits well on many teams thanks to its ability to reliably check threats like Vullaby and Ponyta while providing revenge killing utility and entry hazard support. It partners well with Foongus and Ferroseed, as they switch into Water- and Ground-types well while Onix checks Vullaby and Ponyta for them. Mareanie, Koffing, and Spritzee check Fighting-types like Mienfoo, Timburr, and Scraggy. Finally, Vullaby can switch into bulky Ground-types like Mudbray and Grass-types like Foongus. Grookey's Grassy Terrain can lessen Diglett's ability to trap Onix.</p> "
      },
      {
        "name": "Sturdy",
        "description": "<h1>Moves</h1> <p>Earthquake reliably damages Ponyta, Pawniard, and other Ground-weak Pokemon while hitting neutral foes for decent damage. High Horsepower is the alternative STAB of choice for teams with Grookey. Rock Blast takes advantage of the power of multi-hit moves in LC, hits Vullaby hard, and breaks Focus Sash and Sturdy on Pokemon like Abra and Dwebble. Stealth Rock supports offensive teams by pressuring and wearing down the opposing team's switch-ins. Explosion allows Onix to generate momentum after its Berry Juice has been used and heavily damages checks like Trapinch and Timburr while preventing them from healing. Against Mienfoo, Onix can use Explosion to prevent it from pivoting with U-turn and facilitate a Diglett trap. Dragon Dance is an option in tandem with Sturdy, as the ability makes Onix difficult to KO while it sets up, though it is limited by need to run Rock Blast over Head Smash. Endure is an option that lets Onix survive a hit and consume its Berry Juice, bringing it back to full health and reactivating Sturdy, which can be useful for revenge killing sweepers and stalling out sun turns. Taunt is an option to prevent foes from setting entry hazards or setting up.</p> <h1>Set Details</h1> <p>The combination of Sturdy and Berry Juice grants Onix multiple guaranteed turns of survivability to set Stealth Rock and potentially check offensive threats late-game. Maximum Attack and Speed investment with a Jolly nature allows Onix to hit as hard as possible and outpace Vullaby and Pawniard, and the remaining investment in HP allows Onix to heal the maximum amount from Berry Juice.</p> <h1>Usage Tips</h1> <p>Sturdy Onix should be deployed early-game when opposing entry hazards are not set to best maintain its durability. This set can set guaranteed Stealth Rock against most opposing leads apart from hazard removers and should do so early and aggressively. Strong entry hazard control of your own can be used to preserve Onix as a check against opposing sweepers that may struggle to break though the combination of Berry Juice and Sturdy while Onix wears them down with its own attacks.</p> <h1>Team Options</h1> <p>Sturdy Onix fits best on team archetypes that need guaranteed Stealth Rock support such as offensive Sticky Web, sun, dual screens. Due to its weakness to Knock Off, Onix appreciates teammates like Foongus and Mareanie that can switch into common Knock Off users like Mienfoo and Timburr. Staryu removes opposing hazards and allows Onix to preserve its Sturdy while also leaving your own entry hazards up. This set is especially vulnerable to Vullaby's U-turn paired with an Arena Trap user, so it pairs well with another Flying-resistant Pokemon like Pawniard, although a second Fighting-weak Pokemon may strain your defensive core.</p> "
      },
      {
        "name": "Rock Head",
        "description": "<h1>Moves</h1> <p>Head Smash is an incredibly powerful move that can obliterate frail neutral foes and OHKO most Vullaby. Earthquake is a reliable STAB move that hits Pawniard and Mareanie hard. Stealth Rock provides crucial entry hazard support and punishes foes for switching. Dragon Dance turns Onix into a threatening sweeper, taking advantage of the power of its STAB moves to beat teams without hefty checks. Explosion can be used to maintain offensive momentum in situations after Stealth Rock is set where Onix is likely to be KOed, such as against Eviolite and Air Balloon Diglett and Trapinch, and in tandem with Dragon Dance can be used to break physically defensive checks like Timburr and Mudbray for another sweeper. Body Press hits Porygon and Ferroseed, and it can limit Ferroseed's ability to check Onix when running Dragon Dance.</p> <h1>Set Details</h1> <p>Rock Head allows Onix to use the incredibly powerful Head Smash without taking recoil damage, making it a stout check to Vullaby and a potent setup sweeper with Dragon Dance. Full investment in Attack and Speed maximizes Onix's offensive presence, and a Jolly nature ensures that Onix will always outspeed Pawniard and Vullaby.</p> <h1>Usage Tips</h1> <p>Rock Head Onix can check a variety of physically offensive threats and set Stealth Rock if running it, but it must be wary of switching into Ponyta, as High Horsepower will 2HKO it. This set should be used to aggressively check Nasty Plot Vullaby, as it can switch into any move and OHKO it with Head Smash. When running Dragon Dance, you should generally avoid setting up too early while checks like Trapinch, Grookey, and Timburr are healthy; instead, Onix can use Earthquake to wear down Timburr as it switches in to make a later sweep easier. Onix can set up with Dragon Dance well on Pokemon it forces out or that do not threaten it like Vullaby. Onix can use Explosion to damage Trapinch when trapped, but it must be wary of Protect.</p> <h1>Team Options</h1> <p>Rock Head Onix fits best on teams that need a hard Vullaby check or that enable it to sweep with Dragon Dance. Dragon Dance variants appreciate teammates that will pressure and wear down checks like Mudbray, Timburr, and Trapinch; Pawniard can draw in these Pokemon and remove their item with Knock Off. Mienfoo can remove items from bulky Pokemon like Foongus and Spritzee that Onix otherwise struggles to break through. Foongus and Ferroseed switch well into Ground-types, Staryu, and Grookey, which threaten Onix. Removing Grookey and Timburr is critical for Onix to sweep, as they will otherwise revenge kill it with Super Effective priority. Trapinch can trap and KO Grookey with First Impression.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Krabby": {
    "overview": "<p>Krabby carves a niche for itself in LC as a good wallbreaker, boasting a high Attack stat, good coverage, and an acceptable Speed tier. The combination of its ability Sheer Force and Life Orb provides Krabby the additional power necessary to tear through many of LC's premier threats. However, it is hindered by its mediocre bulk, leaving it susceptible to opposing threats that are able to take advantage of its poor HP and Special Defense stat. Furthermore, Krabby faces competition from Corphish, a fellow wallbreaker that has access to priority.</p> ",
    "comments": "<h1>Other Options</h1> <p>A set with Swords Dance and Eviolite trades the immediate power of Life Orb for additional physical bulk, allowing Krabby to set up on opposing physical attackers such as Onix and Corphish and further increase its wallbreaking capabilities. Krabby can also opt for a Choice Scarf set, trading damage for Speed in order to outspeed otherwise dangerous threats such as Galarian Ponyta and Chinchou.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-resistant Pokemon: Oddish and Mareanie both resist Krabby's STAB attacks. Fast variants of Mareanie are able to outspeed and beat Krabby by poisoning it with Sludge Bomb or setting up Iron Defense, while Oddish is able to pressure Krabby with both Giga Drain and Strength Sap.</p> <p><strong>Faster Special Attackers: Fast special attackers like Galarian Ponyta and Chinchou are able to outspeed Krabby and exploit its weak Special Defense.</p> <p><strong>Croagunk</strong>: Croagunk is immune to Krabby's STAB moves thanks to Dry Skin and capable of OHKOing it due to its low special bulk.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<h1>Moves</h1> <p>Sheer Force-boosted Liquidation is preferred as the main STAB move on Krabby because it is able to OHKO opposing Ground-types, Vullaby, and Ponyta while 2HKOing bulky Pokemon such as Timburr and Spritzee. Knock Off is able to cripple switch-ins to Krabby such as Mareanie, Oddish, and Frillish. Superpower serves as coverage for Ferroseed while also OHKOing Pawniard and Munchlax. Body Slam is Krabby's best neutral move to hit Mareanie, Oddish, Chinchou, and Croagunk, ensuring KOs on the former two after a successful Knock Off. Agility provides an alternative to Body Slam that gives Krabby the potential to function as a late-game sweeper.</p> <h1>Set Details</h1> <p>The EVs maximize Attack and Speed to help Krabby's wallbreaking potential. Having 19 HP ensures that Krabby will only take 1 HP of Life Orb recoil instead of 2 when using Superpower or Knock Off. An Adamant nature is preferred over Jolly to provide crucial damage rolls, ensuring that Liquidation will always OHKO Vullaby and that Knock Off into Body Slam will KO Oddish and Mareanie. Life Orb synergizes well with Sheer Force, providing additional power and not inflicting recoil damage when using a Sheer Force-boosted move.</p> <h1>Usage Tips</h1> <p>Krabby's wallbreaking abilities should be utilized early- to mid-game, crippling opposing walls that switch into it with Knock Off or threatening KOs on Vullaby and opposing Stealth Rock users such as Onix, Mudbray, and Drilbur with Liquidation. Krabby should be removing key walls on the opposing team to allow sweepers on its team to eventually clean late-game. If Krabby is running Agility over Body Slam, its health should be preserved until late-game, where it is able to set up and clear through opposing foes. Krabby should not switch into battle directly due to its mediocre bulk and should be wary of status, especially burns, that may reduce its offensive capabilities.</p> <h1>Team Options</h1> <p>Krabby forms an amazing wallbreaking core with Corphish, pressuring Water-resistant Pokemon like Mareanie and Oddish together. In addition, Krabby's breaking capabilities support Corphish's ability to function as a late-game cleaner thanks to the latter's strong STAB moves and priority. Galarian Ponyta and Diglett can support Krabby by taking advantage of common Water-resistant and -immune Pokemon such as Oddish, Mareanie, and Croagunk that have a secondary Poison typing. Vullaby is able to provide Knock Off support against opposing walls while serving as a secondary check to Oddish. In return, Krabby is able to help Vullaby deal with opposing Ground-types. Steel-types like Ferroseed and Pawniard are able to neutralize Oddish due to their typing and provide utility with Knock Off and Thunder Wave to assist Krabby. Late-game sweepers like Shellder and Dwebble benefit from Krabby's ability to weaken walls. Lastly, entry hazard support from Ferroseed and Dwebble allows Krabby to better break down defensive Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 110102, "username": "jake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 228482, "username": "kt3"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Lickitung": {"sets": [{"name": "Defensive"}]},
  "Koffing": {
    "overview": "<p>Koffing is a naturally bulky defensive Pokemon that checks common Pokemon such as Mienfoo, Grookey, and Foongus. In fact, many physical attackers have a difficult time switching into Koffing due to its offensive versatility. Neutralizing Gas prevents Koffing from being trapped by Arena Trap users such as Diglett and Trapinch and also negates Regenerator from Pokemon like Mienfoo and Foongus, making it an even better defensive Pokemon. On the offensive side, Koffing has useful coverage moves in Thunderbolt and Fire Blast that let it threaten common bulky cores like Mareanie and Ferroseed. However, Koffing's poor base Special Defense makes it very susceptible to special attackers and means it often gets OHKOed by a STAB Psychic-type attack from the likes of Abra. This weakness is exacerbated by its lackluster Speed tier. Koffing also doesn't have a consistent way to recover HP, which limits its role as a defensive check.</p> ",
    "comments": "<h1>Other Options</h1> <p>Koffing can run a plethora of other moves. Thief can be used to steal back an item, since Koffing is a common Knock Off target. Toxic Spikes can wear down bulky walls such as Spritzee and Shellos. Levitate can be used so Earthquake from Mudbray, Trapinch, and Diglett doesn't OHKO Koffing, preventing Arena Trap, and being unaffected by Spikes. However, it makes it a far less effective Mienfoo check, as it will lose the long term game without recovery.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Psychic-types such as Galarian Ponyta, Abra, and Natu have a really easy time KOing Koffing with their super effective STAB special attacks. However, even though neither Galarian Ponyta nor Natu is scared of being poisoned, they wouldn't like taking a Sludge Bomb.</p> <p><strong>Special Attackers: Special attackers such as Porygon, Staryu, and Magnemite significantly pressure Koffing with their attacks. However, they are unable to switch into it.</p> <p><strong>Ground-types: Koffing doesn't have any coverage moves to deal significant damage to Mudbray, especially against RestTalk Mudbray. Diglett and Trapinch can switch into Koffing and pressure it with Earthquake. However, Koffing can wear them down with Fire Blast and Pain Split.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Moves</h1> <p>Sludge Bomb does good damage against neutral targets and threatens Pokemon like Grookey and Mienfoo. Fire Blast complements Sludge Bomb, hitting targets that tank the latter such as Pawniard, Foongus, and Ferroseed. Thunderbolt pressures Natu and Water-types such as Frillish and Mareanie. Pain Split provides Koffing with much needed recovery; Will-O-Wisp is a notable alternative that lets Koffing cripple switch-ins like Mudbray, but it is mostly outclassed.</p> <h1>Set Details</h1> <p>Maximum Special Attack EVs are invested to get comfortable 2HKOs on Pokemon such as Pawniard, Mareanie, and Spritzee. Eviolite allows Koffing to be even more tanky and helps absorbs Knock Off from the likes of Mienfoo and Pawniard. Neutralizing Gas significantly lowers Mienfoo's longevity and prevents Koffing from being trapped by Diglett and Trapinch.</p> <h1>Usage Tips</h1> <p>Koffing can easily switch in to many common unboosted attackers such as Mienfoo  and Grookey. Koffing should stay away from counters like Galarian Ponyta and Mudbray, and they should be removed from the game as soon as possible. Koffing's amazing coverage moves allows it to deal serious damage to very common walls in the tier such as Ferroseed, Mienfoo, and Mareanie.</p> <h1>Team Options</h1> <p>Koffing is best used as a soft answer to many Pokemon and is valuable on a team that needs to check many Pokemon with one slot. Its coverage also works a lot better with Knock Off support from teammates. Teammates  Pawniard appreciates Koffing because it checks Fighting-types and Grookey; Pawniard deals with Psychic-type threats for Koffing. On the offensive side, Koffing's amazing coverage moves are able to put pressure on checks to common wallbreakers and setup sweepers such as Porygon and Staryu. Furthermore, Koffing appreciates an entry hazard setter as a single layer of Spikes will let Koffing OHKO Pawniard and Ferroseed. That being said, as opposing hazards also deal a ton of damage to Koffing especially with the constant switching that it has to do and its lack of a consistent form of recovery, having hazard removal is also appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 110102, "username": "jake"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 91628, "username": "GatoDelFuego"}]}], "writtenBy": [{"user_id": 205691, "username": "ForgottenOnes"}]}
  },
  "Staryu": {
    "overview": "<p>Staryu is an excellent Rapid Spin user due to its good Speed stat and ability to handle Stealth Rock setters like Pawniard and Mudbray. It also has a very diverse movepool, with options like Psychic, Ice Beam, and Thunderbolt to threaten metagame staples like Mienfoo, Foongus, and Mareanie. Analytic allows Staryu to punish its switch-ins with a powerful attack, while Natural Cure makes it a good status absorber and defensive Pokemon. However, Staryu struggles to break through bulky checks like Ferroseed and Foongus without careful prediction, and it is also forced out by offensive threats like Grookey and Magnemite.</p> ",
    "comments": "<h1>Other Options</h1> <p>Life Orb is an option on offensive teams to garner powerful rolls, such as 2HKOing Porygon with Hydro Pump and OHKOing fast Mienfoo with Psychic; however, this jeopardizes Staryu's bulk and longevity and makes it a less reliable Rapid Spin user. Flip Turn can be used on defensive Staryu to gain momentum, but it is outclassed by Scald's and Thunder Wave's utility. Light Clay is an option to give setup sweepers such as Shellder, Tyrunt, Magby, and Grookey an easier time setting up, but Staryu is more useful as a Rapid Spin user and offensive threat.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Ferroseed and Foongus can tank attacks from Staryu and threaten it with their STAB attacks, while Grookey revenge kills Staryu with Grassy Glide.</p> <p><strong>Electric-type Pokemon and Coverage: Electric-types like Magnemite OHKO Staryu with their STAB attacks. Pokemon like Porygon and Koffing carry Thunderbolt and force Staryu out.</p> <p><strong>Knock Off: Knock Off from Mienfoo, Timburr, and Pawniard cripples Staryu, leaving it vulnerable to foes like Diglett and Abra.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Moves</h1> <p>Hydro Pump, especially when boosted by Analytic, deals heavy damage to neutral targets like Pawniard and Mienfoo. Thunderbolt targets Water- and Flying-types like Mareanie, Frillish, and Natu. Psychic 2HKOes Poison- and Fighting-types like Foongus, Mareanie, Mienfoo, and Timburr. Ice Beam handles Grass-types like Foongus and Grookey and serves as Staryu's best method to hit Ferroseed. Recover helps Staryu remain healthy to apply offensive pressure. Rapid Spin enables Staryu to remove troublesome entry hazards and gain a Speed boost to outspeed foes like Diglett and Choice Scarf Porygon, as well as avoiding a Speed tie with Ponyta and Abra.</p> <h1>Set Details</h1> <p>156 Defense EVs with Eviolite improve Staryu's physical bulk, letting it handle foes like Pawniard and Mudbray. 236 Speed EVs with a Timid nature let Staryu outspeed Mienfoo, Pawniard, and Vulpix and Speed tie with Ponyta and Abra. Analytic provides Staryu with a power boost, allowing it to 2HKO threats like Foongus, Mareanie, and Mienfoo on the switch with proper prediction.</p> <h1>Usage Tips</h1> <p>Staryu is best utilized as an early- and mid-game wallbreaker, utilizing its Analytic-boosted attacks to decimate defensive cores. Once troublesome Pokemon like Ferroseed and Frillish has been worn down, it can become even more threatening. Take advantage of Staryu forcing out threats like Mudbray and Koffing to unleash a strong Analytic-boosted attack on the incoming switch-in. Try to bring Staryu in via U-turn from Mienfoo or good double switches, as it must preserve as much HP as possible to handle strong neutral attacks.</p> <h1>Team Options</h1> <p>Fighting-types such as Mienfoo and Timburr handle Ferroseed, pressure shared checks like Foongus with Knock Off, and absorb Knock Off; Mienfoo also provides U-turn to help Staryu safely enter the battle, while Timburr provides Defog for secondary entry hazard removal. Diglett also makes a good partner, as it can trap Steel-types such as Pawniard and Magnemite, which makes it easier for Staryu to fire off Analytic-boosted attacks. Trapinch is an option over Diglett that can use First Impression to OHKO Grookey. On more offensive teams, Dwebble's entry hazard support allows Staryu to decimate defensive cores, especially in conjunction with teammates like Life Orb Abra and Choice Scarf Mudbray.</p> "
      },
      {
        "name": "Defensive",
        "description": "<h1>Moves</h1> <p>Scald is a great neutral attack to threaten Pokemon like Ponyta and Diglett and potentially cripple Pokemon such as Pawniard and Mienfoo. Thunderbolt targets Water- and Flying-types such as Frillish, Mareanie, and Natu. Thunder Wave is an option to cripple Pokemon like Abra, Galarian Ponyta, and Porygon, which Staryu cannot sufficiently pressure offensively. Rapid Spin gets rid of entry hazards and gives Staryu a Speed boost to outpace Diglett and avoid Speed tying with Abra, Ponyta, and opposing Staryu.</p> <h1>Set Details</h1> <p>Staryu runs 236 Speed EVs with a Timid nature to outpace Mienfoo, Mudbray, and Pawniard and Speed tie with Ponyta and Abra. With Eviolite, 116 HP EVs, and 156 Defense EVs, Staryu is able tank physical attacks from Mienfoo, Diglett, and Timburr and Stealth Rock setters like Mudbray and Pawniard. Natural Cure is the preferred ability to allow Staryu to absorb status from foes such as defensive Ponyta and Will-O-Wisp Koffing.</p> <h1>Usage Tips</h1> <p>Staryu is great in the early-game, utilizing Scald and Thunder Wave to cripple potent offensive threats like Mienfoo and Abra, but it can be preserved for mid- and late-game to soft check foes. It should try to come in on attacks from Onix and Choice Scarf Vulpix, as it can threaten them out with Scald or potential Thunder Wave. Staryu should be wary of Knock Off users such as Timburr, Mienfoo, and Pawniard, as they cripple its bulk and make it vulnerable to threats it can normally handle, like Diglett and Mudbray.</p> <h1>Team Options</h1> <p>Stealth Rock-weak partners like Ponyta, Vulpix, and Archen appreciate Rapid Spin; in return, they pressure foes like Grookey and Foongus. Fighting-types such as Timburr and Mienfoo pair well with Staryu, as they can absorb Knock Off and threaten Magnemite, Ferroseed, and Porygon. Poison-types like Foongus and Koffing are great checks to Grookey, with Foongus also checking opposing Staryu and Koffing pressuring Ferroseed. Trappers such as Diglett and Trapinch can remove Pawniard and Magnemite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 195129, "username": "Nineage"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}, {"user_id": 449990, "username": "DC"}]}
  },
  "Porygon": {
    "overview": "<p>Porygon is a threatening bulky attacker because of its boosted Tri Attack being difficult to switch into, great coverage options such as Psychic and Ice Beam, and ability to threaten prominent Pokemon. It can also run a defensive set that allows it to counter trappers like Diglett with Trace and gain momentum with Teleport or spread paralysis with Thunder Wave. However, Porygon struggles with Fighting-type Pokemon such as Mienfoo and Timburr. Additionally, Porygon cannot take on Steel-types like Ferroseed, Magnemite, and Pawniard because they can tank any of Porygon's attacks and cripple it with Thunder Wave or Knock Off. Porygon also struggles to take Knock Off as well, as losing Eviolite makes it unable to sponge attacks from Focus Sash Abra, Grookey, and Ponyta, leaving it vulnerable to being KOed.</p> ",
    "comments": "<h1>Other Options</h1> <p>Recover can be used on Download sets to allow Porygon to stay healthy throughout the match. Berry Juice is an option on Download sets, with or without Agility, to give Porygon an extra moveslot to fit a coverage option.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types</strong>: Fighting-types like Mienfoo and Timburr are able to take care of Porygon using their Fighting-type STAB attacks, but they should be careful about switching into Tri Attack or being heavily damaged by Psychic.</p> <p><strong>Steel-types: Steel-types like Ferroseed, Pawniard, and Magnemite can take any attack from Porygon because of their resistance to its attacks. Pawniard and Ferroseed can also use Knock Off to make Porygon easier to take care of. Ferroseed can also use Thunder Wave to cripple Porygon so it can't outpace Timburr.</p> <p><strong>Knock Off: Knock Off users like Pawniard and Ferroseed hinder Porygon through removing its Eviolite, making it unable to tank attacks from Ponyta and Abra.</p> <p><strong>Priority Attacks: Priority attacks like Mienfoo's Fake Out, Pawniard's Sucker Punch, and Grookey's Grassy Glide can revenge kill Porygon because of its lack of recovery.</p> ",
    "sets": [
      {"name": "Choice Scarf"},
      {
        "name": "Download",
        "description": "<h1>Moves</h1> <p>Tri Attack hits targets that don't resist it hard after a Special Attack boost from Download. Psychic allows Porygon to take care of Mienfoo, Foongus, and Mareanie. Ice Beam is Porygon's best move against Ferroseed. Agility makes Porygon a good mid- or late-game sweeper when most of its checks are significantly weakened.</p> <h1>Set Details</h1> <p>Maximum Special Attack and Speed investment with a Timid nature allows Porygon to hit as hard as possible, while the remaining EVs go into Defense to help it take physical attacks.</p> <h1>Usage Tips</h1> <p>Porygon should be saved for mid- or late-game once most of its threats are weakened or KOed so it can set up with Agility and sweep. Porygon should come in on a predicted switch, Stealth Rock from Onix, or after a teammate is knocked out to keep it healthy. Porygon can also be used on slower threats to soften them up for mid- or late-game, but be careful about switching it into a powerful attack, as, if it takes too much damage, it will be unable to set up with Agility and sweep. Make sure that Steel-types are weakened or KOed; once they are, Porygon can freely use its attacks. Do not allow Porygon to be chipped by entry hazards, as this makes it easier to take care of.</p> <h1>Team Options</h1> <p>Porygon appreciates entry hazard support from Onix, Ferroseed, Pawniard, and Mareanie because it makes it easier for Porygon to sweep; it especially goes well with Ferroseed for its Spikes support to wear down Pokemon like opposing Ferroseed, Pawniard, and Mienfoo. Pawniard also threatens Abra, which could otherwise hinder Porygon, with Sucker Punch. Mienfoo, Diglett, and Ponyta are also good to pair with Porygon in order to help with taking down Steel-types like Ferroseed, Pawniard, and Magnemite that resist Porygon's attacks. Pokemon like Mienfoo, Pawniard, and Ferroseed can soften up Pokemon with Knock Off to make it easier for Porygon to sweep. Mareanie and Foongus are great to pair with Porygon due to them being able to switch into Fighting-type attacks from Mienfoo and Timburr.</p> "
      },
      {
        "name": "Trace",
        "description": "<h1>Moves</h1> <p>Tri Attack is a good STAB move to use against any Pokemon that does not resist it, such as Staryu and Mienfoo, with the added benefit of a small chance to inflict status. Ice Beam is used to OHKO Diglett and hit Ferroseed. Psychic can be used for Mareanie and on a predicted switch to Mienfoo or Timburr. Recover allows Porygon to keep itself healthy throughout the game. Thunder Wave is used to hinder switch-ins like Mienfoo, Pawniard, and Frillish. Teleport can be used over Thunder Wave to keep momentum for the team.</p> <h1>Set Details</h1> <p>Running 236 HP EVs with 76 Special Defense EVs with a Calm nature allows Porygon to take hits from special attackers like Abra and Natu. Using 236 HP EVs with 196 Defense EVs allows Porygon to tank physical attacks from Onix and Diglett. Trace allows Porygon to copy Regenerator from Foongus and Mienfoo, Flash Fire from Ponyta, and Arena Trap from trappers like Trapinch and Diglett.</p> <h1>Usage Tips</h1> <p>Porygon can be used early-game to use Thunder Wave against Pokemon like Mienfoo or Teleport on predicted switches into checks like Pawniard and Mienfoo to safely get in a teammate to take care of them. Teleport can also be used to allow Porygon to take an attack and bring in frail Pokemon like Abra and Carvanha safely. However, Porygon should be careful about staying in against Knock Off users like Ferroseed and Mienfoo, as losing Eviolite will make it unable to withstand attacks from Ponyta, Staryu, and Abra. It should switch in on a passive attack from Mareanie or Foongus, a predicted switch, or an attack from Ponyta or Onix. It should use Tri Attack early-game to get off decent damage against most Pokemon that do not resist it with a small chance of statusing Pokemon like Pawniard and Mienfoo that will try to switch into Porygon's attacks. If Porygon is running Psychic, try to use it on predicted switches into Mienfoo and Mareanie.</p> <h1>Team Options</h1> <p>Stealth Rock setters such as Pawniard and Onix are great to pair with Porygon; Pawniard is also able to come in on Knock Off from Ferroseed. Bulky Pokemon like Mareanie and Foongus can come in on Fighting-type attacks from Mienfoo and Timburr. Offensive Pokemon like Abra and Galarian Ponyta are also good to pair with Porygon to check the aforementioned Fighting-types. Fighting-types like Mienfoo and Timburr can force out Steel-types like Pawniard and Ferroseed; in return, Porygon can wall special attackers such as Wingull, Abra, and Mareanie. Setup sweepers and wallbreakers such as Tyrunt, Salac Berry Magnemite, and Grookey appreciate Porygon's Teleport getting them in safely.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 410251, "username": "zizalith"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Omanyte": {
    "overview": "<p>Omanyte is a powerful setup sweeper in LC thanks to Shell Smash and a very good movepool that allows it to hit almost every Pokemon super effectively. It also works very well as an entry hazard setter, providing Stealth Rock and Spikes support. Omanyte's typing and bulk allow it to switch into prominent metagame forces like Choice-locked Vulpix and boost its stats or set entry hazards. However, Omanyte's viability is severely hindered by the presence of Grookey and Timburr, which can easily remove it with strong priority moves.</p> ",
    "comments": "<h1>Other Options</h1> <p>Omanyte can run Rock Blast on the Shell Smash set with a different EV spread of 36 Atk / 36 Def / 196 SpA / 236 Spe and a Rash nature to deal with Focus Sash Abra; however, dropping a less niche coverage move is not ideal. Scald is an option on the entry hazard set to potentially burn switch-ins such as Staryu and Ferroseed, although it is inconsistent and significantly weaker than Hydro Pump. Substitute helps Shell Smash Omanyte avoid status and provides safer opportunities to set up, while Protect allows Omanyte to ignore Fake Out and First Impression and punish High Jump Kick from Mienfoo.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grassy Glide from Grookey is Omanyte's greatest threat, and Foongus can prevent the Shell Smash set from setting up while also threatening the entry hazard set; however, both of them dislike Ice Beam or Blizzard on the switch. Ferroseed, on the other hand, can live any hit from Omanyte after Shell Smash and recover all the damage with Giga Drain while also being able to safely switch in against the entry hazard set, making it a very effective counter.</p> <p><strong>Abra: With Focus Sash, Abra can survive a hit from the Shell Smash set and KO Omanyte thanks to the Special Defense drop. However, Abra needs to be careful of Knock Off.</p> <p><strong>SturdyJuice Users</strong>: Sturdy Magnemite and the rare SturdyJuice Onix can tank any attack from Shell Smash Omanyte at full HP and revenge kill it with super effective attacks. However, they fail to counter it if entry hazards are on the field, unless they're running Endure and have Berry Juice intact. They also can't safely switch into Omanyte due to the threat of Knock Off.</p> <p><strong>Priority Users: Grookey, Timburr, Pawniard, and Trapinch can easily revenge kill or heavily damage Omanyte after Shell Smash.</p> ",
    "sets": [
      {
        "name": "Shell Smash Sweeper",
        "description": "<h1>Moves</h1> <p>Shell Smash makes Omanyte threatening, doubling both its Special Attack and Speed. Hydro Pump KOes most non-Water-resistant targets and has a high chance to KO foes like Mienfoo after Shell Smash. Surf is an alternative that's more accurate but requires notably more prior damage to get KOs. Ice Beam hits Grass-types like Foongus and Grookey, and it's the best move to hit Ferroseed, as well as being a safer option to hit Natu and Ground-types. Earth Power allows Omanyte to OHKO Mareanie and hit Staryu.</p> <h1>Set Details</h1> <p>A Modest nature is preferred for damage output, as Omanyte does not need a Timid nature to outspeed Choice Scarf users like Mienfoo after Shell Smash. Eviolite and Shell Armor give it more opportunities to set up.</p> <h1>Usage Tips</h1> <p>Omanyte should be used as a late-game sweeper that sets up after its checks and counters are damaged or removed. In particular, Ferroseed, Grookey, and Timburr should be removed, as they can survive a hit and revenge kill Omanyte after Shell Smash. Omanyte's typing doesn't allow it to set up in front of many common Pokemon, but the best ones are Choice-locked Vulpix and Choice-locked Porygon.</p> <h1>Team Options</h1> <p>Trapinch is the best partner on balance teams because it traps and removes Omanyte's strongest counters in Grookey and Ferroseed, as well ass being able to deal with Pawniard. Ponyta is another option to remove these counters. Fighting-resistant foes like Koffing and Foongus, or the more niche Spritzee, help against Mienfoo and especially Timburr with its threatening Mach Punch. Ferroseed is a good counter to Focus Sash Abra and SturdyJuice Magnemite and can cripple them with Knock Off, which is a good move to have on various team members to weaken Staryu and opposing Ferroseed. Omanyte can also fit on dual screens hyper offense teams, usually using Natu as a dual screens setter; common partners on this team structure are Swords Dance Grookey, Belly Drum Magby, and Pawniard.</p> "
      },
      {
        "name": "Entry Hazard Setter",
        "description": "<h1>Moves</h1> <p>Hydro Pump is Omanyte's best offensive move, being able to threaten any neutral target after a Speed boost. Knock Off weakens switch-ins that might come in to stop the Shell Smash set, especially bulky ones like Mareanie, Staryu, and Ferroseed. Spikes in combination with Stealth Rock can be very effective at forcing passive damage on the opposing team, especially if Omanyte's partners can prevent or punish entry hazard removal. Blizzard hits Grass-types like Grookey and Foongus on the switch, while Ice Beam is a safer but considerably weaker option. Toxic Spikes helps against hyper offense teams, which rarely use Poison-types.</p> <h1>Set Details</h1> <p>Defense investment with Eviolite allows Omanyte to more easily switch in multiple times, avoiding the OHKO from strong super effective attacks like Earthquake from Life Orb Diglett and High Jump Kick from Eviolite Mienfoo. 13 Speed is enough to outspeed the entire unboosted metagame after a Weak Armor boost, as well as most common Choice Scarf users. The Speed boost provided by Weak Armor allows it to generate offensive pressure or set multiple layers of entry hazards. Another possible EV spread alongside Grookey is 156 HP / 196 SpA / 156 Spe with a Timid nature; it allows Omanyte to survive all the needed hits, like Earthquake from Diglett and Mudbray, under Grassy Terrain while also getting an extra point in Special Attack.</p> <h1>Usage Tips</h1> <p>Omanyte is a common pick on entry hazard-stacking hyper offense teams as a dedicated lead, setting at least Stealth Rock and a layer of Spikes against most opposing leads. It is best utilized early- and mid-game by safely switching into common Pokemon like Choice-locked Vulpix and Porygon to set entry hazards. Omanyte should always get on the field through a pivot move or by switching into a resisted hit, preferably physical attacks to get the Weak Armor boost. If the matchup is not favorable and the opponent can KO Omanyte before it can do anything, the main goal is to try and set one or two layers of Spikes before it's removed from the game.</p> <h1>Team Options</h1> <p>On hyper offense teams, good sweepers and wallbreakers like Grookey, Choice Scarf Mudbray, and Life Orb Abra appreciate Omanyte's ability to set entry hazards and weaken their targets. On balance teams, it needs teammates that can switch into Grookey, so Foongus, Koffing, and Ponyta are good picks. Omanyte also benefits from pivot moves that allow it to come on the field safely, like U-turn from Mienfoo and Volt Switch from Magnemite. Pawniard punishes Defog attempts, while Magnemite, Tyrunt, and Grookey pressure common entry hazard control measures like Natu and Staryu; also, Diglett can trap the latter.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410251, "username": "zizalith"}, {"user_id": 449990, "username": "DC"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 490348, "username": "Albinson"}, {"user_id": 449990, "username": "DC"}]}
  },
  "Kabuto": {"sets": [{"name": "Support"}]},
  "Chinchou": {"sets": [{"name": "Offensive Pivot"}]},
  "Natu": {"sets": [{"name": "Defensive"}, {"name": "Setup Sweeper"}, {"name": "Dual Screens"}]},
  "Elekid": {"sets": [{"name": "Offensive"}]},
  "Magby": {
    "overview": "<p>Magby is one of the premier Belly Drum sweepers in the tier with its combination of a good Speed tier, solid coverage, and priority. However, it is outclassed outside of hyper offense builds by Vulpix and Ponyta, and it can end up being useless if Belly Drum fails to go off, meaning that Magby must be played carefully and supported.</p> ",
    "comments": "<h1>Other Options</h1> <p>Magby can run a mixed Life Orb set with Fire Blast, Psychic, Thunder Punch, and Mach Punch with 15/15 attacking stats; this set, however, is heavily outclassed by Ponyta as a 19 Speed Fire-type and by Vulpix as a Fire-type wallbreaker. This set is also worn down very quickly by Life Orb recoil and entry hazards. Magby struggles to run any moves not already listed on its main set. Brick Break is an option to get past bulky checks like Onix without prior chip damage, but the cost of dropping Thunder Punch or Mach Punch is too high. Dual Chop allows Magby to break the Focus Sashes of Pokemon like Abra; however, Dual Chop is otherwise useless. Protect can be used to avoid the damage from Fake Out, but giving up a coverage move entirely is ill-advised, especially when considering Flame Body can also punish Fake Out.</p> <h1>Checks and Counters</h1> <p><strong>Priority: Priority in the form of Fake Out from Mienfoo or Grookey, or from Pokemon bulky enough to survive +6 Mach Punch, like Timburr, can chip Magby and knock it out before a sweep can happen.</p> <p><strong>19-20 Speed Pokemon: Healthy 19 Speed Pokemon like Staryu and Galarian Ponyta can put an end to Magby's sweep by winning the Speed tie. Eviolite Diglett can survive a +6 Mach Punch from full and OHKO back with Earthquake. Abra is of special note, as it often carries a Focus Sash, which guarantees that it will be able to survive one hit and OHKO with Psychic.</p> <p><strong>Onix: Onix is incredibly bulky and can survive a Mach Punch even after Magby has set up. However, Magby teams can chip Onix or remove its Eviolite to make a sweep possible.</p> ",
    "sets": [
      {
        "name": "Belly Drum Sweeper",
        "description": "<h1>Moves</h1> <p>Fire Punch hits for big damage at +6, OHKOing all neutral targets in the tier and even some resistant targets. Thunder Punch serves as Magby's best coverage move, allowing it to hit Water-types like Mareanie and Frillish, which would otherwise stop a sweep. Mach Punch hits Rock-types that resist Fire Punch like Onix and Tyrunt; it also allows Magby to beat slower priority users like Pawniard and faster Pokemon like Choice Scarf Porygon.</p> <h1>Set Details</h1> <p>29 HP IVs drop Magby's HP to an even number so that Belly Drum activates Berry Juice, restoring Magby back to full HP. The given EVs and nature maximize Magby's Speed and Attack, letting it reach a high 19 Speed. Vital Spirit allows Magby to absorb Spore and set up on Foongus. Alternatively, Flame Body gives it a chance to burn priority users, which means that a Fake Out from Mienfoo or Grookey might stop them from interrupting Magby's sweep.</p> <h1>Usage Tips</h1> <p>Magby should be brought in on double switches, after a sacrifice, with Teleport after dual screens have been set, or after a Memento, as it is incredibly frail and will not be able to take advantage of Belly Drum if it is chipped. Magby excels at cleaning weakened teams, so Magby teams should actively search for opportunities to sweep once checks like Onix and Staryu have been weakened. After Magby has a clear path to winning the game, carefully select a chance to use Belly Drum, as it can only use Belly Drum once. Magby's Speed can also let it force out foes to get a setup opportunity.</p> <h1>Team Options</h1> <p>Natu or another dual screens setter is almost a must-bring; without one, Magby's chances to set up are severely limited. Magby also enjoys not getting chipped when it switches in, meaning that Teleport support from the aforementioned Natu or Memento support from Diglett greatly helps it. Magby also synergizes well with other common dual screens sweepers that are also checked by Onix, like Tyrunt; this is because they each weaken Onix for the others to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 410251, "username": "zizalith"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 416460, "username": "yellowfin"}]}
  },
  "Treecko": {"sets": [{"name": "Sweeper"}]},
  "Wingull": {
    "overview": "<p>Wingull is one of the fastest Pokemon in LC, and its STAB combination of Water and Flying has almost perfect coverage. It is able to weaken bulky Pokemon in the beginning of the game with U-turn, Knock Off, and Scald and can use its excellent Speed tier and powerful attacks to tear through weakened teams later in the game. Defensive Pokemon such as Mareanie, Ferroseed, and Spritzee cannot comfortably switch into Wingull's attacks, especially if they have lost their Eviolite to Knock Off from Wingull or a teammate. U-turn lets Wingull pivot into a trapper like Trapinch or Diglett to eliminate Ground-weak checks like Chinchou and Mareanie or build momentum. Wingull has some glaring flaws, however. Its awful bulk makes it crippled if it switches into any non-Ground-type attack, and it is quickly weakened by Life Orb recoil and Stealth Rock. Additionally, its primary attack, Hurricane, has only 70% accuracy, meaning Wingull will often fail to get important KOs.</p> ",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<h1>Moves</h1> <p>Hurricane is Wingull's most powerful attack. Despite its shaky accuracy, the extra power is essential for important KOs like OHKOing Eviolite Oddish. Scald complements Hurricane as Wingull's other STAB attack; many Pokemon that resist Hurricane, like Onix and Pawniard, are KOed or severely damaged by Scald and do not appreciate its 30% chance to burn. Substitute lets Wingull take advantage of the many switches it forces; if Wingull uses Substitute as the opponent sends in a weakened Pokemon as KO fodder, it cannot easily be revenge killed, giving it the chance to freely launch attacks and decimate the opponent's team. Substitute also lets Wingull evade Pawniard's Sucker Punch. Air Slash gives Wingull a more reliable Flying-type STAB attack to consistently KO weakened Pokemon such as Mareanie and Corphish. This is particularly helpful due to Wingull's fragility; if Wingull misses Hurricane, the opposing Pokemon can typically KO Wingull back. Alternatively, U-turn lets Wingull build momentum. After weakening opposing Pokemon with its powerful STAB attacks, it can switch out to a teammate to trap or otherwise take advantage of its switch-ins. Knock Off is an additional option that can cripple walls; after they lose their Berry Juice or Eviolite, they become much worse at switching into Wingull and its teammates. However, Knock Off's low damage output means that if the foe stays in on Knock Off, they will lose their item but almost always withstand it to KO Wingull back. Knock Off can be effective if Wingull forces a switch, but the other moves are generally more consistent. Life Orb significantly boosts Wingull's power, letting it use its good STAB combination and Speed tier to tear through the opponent's team every time it comes in. However, Berry Juice can be used to give Wingull more opportunities to switch in.</p> <h1>Set Details</h1> <p>A Timid nature and 236 Speed EVs let Wingull reach 19 Speed, which lets it Speed tie with Jolly Ponyta and Timid Galarian Ponyta and leaves Diglett as the only unboosted Pokemon faster than it. Although Wingull may use some physical attacks, those attacks are used for their utility rather than their power, so a Timid nature is used to avoid reducing Wingull's bulk. The remaining 36 EVs are invested in Defense to help Wingull better survive physical priority attacks such as Timburr's Mach Punch and Pawniard's Sucker Punch. 0 HP IVs drop Wingull's HP to 19, which increases its longevity by making it only lose 1HP from Life Orb recoil. If using Berry Juice, however, Wingull should run the usual 31 HP IVs.</p> <h1>Usage Tips</h1> <p>Due to Wingull's poor bulk, it should avoid switching into attacks directly. It is better to bring it in once a teammate has been KOed or through U-turn support from teammates such as Vullaby. Wingull also does not like to take Stealth Rock damage, so keeping entry hazards off the field is very helpful for Wingull. If the opponent does not have any good switch-ins to Wingull, Wingull can use its powerful STAB attacks right away. If there are specially bulky Pokemon that are able to switch into Wingull, however, Wingull should spend the beginning of the game using Knock Off to remove their items or U-turn to gain momentum or pivot into a teammate to trap them. Mid- to late-game, once its switch-ins have been weakened, Wingull should be brought in safely and then spam its powerful STAB attacks to KO anything that switches in.</p> <h1>Team Options</h1> <p>Due to Wingull's fragility and Life Orb recoil, entry hazard removal is necessary for Wingull to safely switch in multiple times during a match. Thus, Wingull appreciates the hazard control provided by Rapid Spin Drilbur or a Defog user such as Vullaby or Timburr. Wingull's U-turn works excellently alongside trappers such as Diglett and Trapinch, since Wingull can lure in defensive Pokemon such as Chinchou and Mareanie and pivot to a trapper to eliminate them. Wingull also appreciates teammates such as Vullaby, which can use U-turn to help Wingull switch in without taking damage. Since Wingull is often revenge killed by Choice Scarf users, it benefits from bulky teammates that are able to switch into their attacks, such as Onix and Spritzee. Other Water-types, such as Corphish and Krabby, appreciate Wingull's ability to weaken Water-type switch-ins such as Ferroseed, Oddish, and Mareanie with Hurricane and Knock Off.</p> <h1>Other Options</h1> <p>Rain Dance guarantees that Wingull's Hurricane will hit and powers up its Water-type attacks. Wingull would typically prefer to spend a turn attacking than setting up Rain Dance, but the additional power and accuracy can be very useful. Protect lets Wingull scout Choice item users and avoid being revenge killed by Trapinch's First Impression, although Substitute is typically more effective at dealing with these tactics. Roost gives Wingull a solution to its durability problem; however, Wingull already struggles to choose its four moves and would rather spend a turn attacking than healing, so Berry Juice is more effective at keeping it healthy.</p> <h1>Checks and Counters</h1> <p><strong>Stealth Rock: Wingull is extremely susceptible to chip damage. The combination of Stealth Rock and Life Orb recoil can prevent Wingull from being effective beyond KOing one Pokemon, as a weakened Wingull loses to any form of priority. Even resisted attacks such as Timburr's Mach Punch deal 30%, which may KO if Wingull has switched into Stealth Rock and attacked twice.</p> <p><strong>Specially Defensive Walls</strong>: Although bulky Pokemon such as Mareanie, Spritzee, and Ferroseed take a significant amount of damage from Life Orb Hurricane and do not appreciate having their Eviolite removed, they are able to take any one attack from Wingull even without Eviolite and do enough damage to KO Wingull or prevent it from switching in again.</p> <p><strong>Choice Scarf Users</strong>: Choice Scarf users such as Vullaby and Galarian Farfetch'd are able to outspeed and OHKO Wingull, although they cannot switch in to Knock Off or Wingull's STAB attacks.</p> <p><strong>Priority: Wingull's Speed advantage is neutralized by priority attacks such as Pawniard's Sucker Punch, which can KO it before it can attack. Wingull can often be revenge killed by weak priority attacks because it is easily worn down.</p> <p><strong>Chinchou</strong>: Chinchou is the only Pokemon in LC with a typing that resists both of Wingull's STAB attacks, and its typing and impressive bulk let it reliably switch into Wingull multiple times in a match. Wingull can cripple Chinchou with Knock Off or pivot to a teammate to trap it, but it is unable to defeat Chinchou by itself.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 208173, "username": "Fiend"}, {"user_id": 110102, "username": "jake"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 202058, "username": "Expulso"}]}
  },
  "Carvanha": {
    "overview": "<p>Speed Boost Carvanha can quickly outpace almost any threat and punch holes with powerful STAB attacks. With a nice STAB combination and Psychic Fangs for almost everything not hit by it, Carvanha can be a significant offensive threat. Its shortcomings are subpar defenses, a rather niche role, and no means to boost damage output. The prevalence of Grookey, Timburr, and Focus Sash Abra limits Carvanha's usefulness in the tier.</p> ",
    "comments": "<h1>Other Options</h1> <p>Waterfall is is a useable STAB move for its flinch chance. Carvanha can attempt a special set with Hydro Pump, Ice Beam, and Dark Pulse, which makes it slightly better against Pawniard. However, it is largely outclassed by Staryu and Wingull. Aqua Jet allows Carvanha to finish off weakened priority users such as Timburr and Pawniard. Destiny Bond has merit, especially when paired with Focus Sash to take down an opponent's counter. This works well when removing shared checks to other offensive threats like Shellder.</p> <h1>Checks and Counters</h1> <p><strong>Priority: Even weaker priority moves can be threatening to Carvanha. Timburr's Mach Punch, Grookey's Grassy Glide, and the rarer Croagunk's Vacuum Wave pose serious threats, and their users should be removed before attempting to sweep. However, Protect can be used to block First Impression and Fake Out.</p> <p><strong>Grass-types: Ferroseed's defenses and typing allow it to shrug off Carvanha's attacks and easily dispose of it or set entry hazards. Foongus is similar to Ferroseed but must take caution against Psychic Fangs, which it cannot take without Eviolite. Grookey isn't bothered by Aqua Jet and can hit Carvanha with Grassy Glide. Protect can stall out the last turn of Grassy Terrain, however.</p> <p><strong>SturdyJuice: Onix, Magnemite, and Dwebble are threats to Carvanha with Sturdy and Berry Juice—Magnemite especially so with Recycle. While all of them take significant damage from Carvanha's attacks, they will be able to hit back and remove Carvanha. Their threat is mitigated if they lose Berry Juice.</p> <p><strong>Focus Sash: Focus Sash users can take a hit from Carvanha and KO back; Abra is the most common user and runs Counter.</p> <p><strong>Fighting-types: Eviolite Timburr has the bulk to withstand Psychic Fangs from full HP and take Aqua Jet well. Mienfoo is a threat as well, but Protect can turn the tables against High Jump Kick variants, which are then vulnerable to Liquidation or Psychic Fangs.</p> ",
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<h1>Moves</h1> <p>Liquidation and Crunch provide nearly universal coverage. Liquidation has a chance to lower Defense, which can force bulkier switch-ins out. Flip Turn is a notable alternative that synergizes with Neutralizing Gas Koffing to chip Mienfoo in the lead matchup. Psychic Fangs takes care of Fighting-types like Mienfoo and common Poison-types such as Foongus, Koffing, and Mareanie. Protect ensures that Carvanha will almost always get a Speed boost and can be used to stall out attacks such as High Jump Kick and Grassy Glide.</p> <h1>Set Details</h1> <p>Maximum Speed and Attack ensure that Carvanha can do as much damage as possible. The leftover EVs into Special Defense keep Download Porygon from gaining a Special Attack boost. Life Orb substantially improves damage output. 9 HP IVs give Carvanha 19 HP, causing it to lose only 1 HP per turn from Life Orb.</p> <h1>Usage Tips</h1> <p>Carvanha's low defenses limit its chances to switch in, so it benefits greatly from pivots and lures. It operates best when switched in to revenge kill and when its checks have been worn down. Once Pokemon like Mienfoo and Spritzee have been weakened and lost items to Knock Off, Carvanha can quickly become overwhelming. Even if Carvanha is unable to pull off a sweep, it will put holes in the opponent's defensive backbone for another sweeper to exploit.</p> <h1>Team Options</h1> <p>Thanks to Carvanha's pretty good coverage, there aren't many Pokemon that can switch in freely. Ferroseed is probably the biggest threat to Carvanha thanks to strong defenses and typing. As such, it benefits from teammates like Ponyta and Timburr. Knock Off is a great asset on teammates for beating Sturdy + Berry Juice users like Onix and Magnemite. Ferroseed is a good teammate for weakening Water-types like Staryu, spreading status, and setting entry hazards. Carvanha is very susceptible to priority attacks from the likes of Grookey and Timburr. Ponyta and Koffing are good counters to them and can help keep up the offensive pressure that Carvanha thrives on. Trapinch is able to trap Grookey and Ferroseed, although Ferroseed should be weakened first. Pivots like Mienfoo and Larvesta help make up for its poor defenses and are generally good team options.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 410251, "username": "zizalith"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 43880, "username": "alan"}, {"user_id": 449990, "username": "DC"}]}
  },
  "Trapinch": {
    "overview": "<p>Trapinch's rather good bulk and access to Arena Trap allow it to switch into, trap, and KO specific Pokemon. Notably, Trapinch is guaranteed to remove Onix and has great odds to remove Pawniard thanks to its ability to switch into these Pokemon, something Diglett cannot do. However, due to its slow Speed, Trapinch fears Scald burns and Iron Head flinches far more than Diglett does. First Impression gives Trapinch some extra utility against many faster Pokemon, though many of the move's targets often run Protect for this specific reason. Trapinch will often be at low HP after it has trapped its target, and due to its low Speed, it will likely only attack again with a priority move.</p> ",
    "comments": "<h1>Other Options</h1> <p>There are no viable other options for Trapinch.</p> <h1>Checks and Counters</h1> <p>It should be noted that Trapinch cannot be countered directly, as its ability Arena Trap prevents switching out if the Pokemon is grounded. With the ability to pick its matchups, Trapinch often needs to be dealt with after it has picked up a KO. Fortunately, Trapinch will frequently take significant damage in the process, which can leave it vulnerable to almost any strong attacker in the tier.</p> <p><strong>Water-types</strong>: Staryu and Wingull can punish Trapinch with relatively few downsides. Both are rather difficult to switch into outside of specific counters, which often forces Trapinch to stay in and be KOed. Mareanie is threatened by a healthy Trapinch, but it can often burn Trapinch with Scald, allowing it to stall out Earthquake with Recover.</p> <p><strong>Grass-types: With the exception of Ferroseed, Grass-types fear little from Trapinch after its first turn. Grookey and Foongus are solid examples of capable revenge killers, though Grookey does need to be mindful of First Impression.</p> <p><strong>Porygon: Porygon is incredibly bulky and can Trace Arena Trap, locking Trapinch on the field. If Porygon is unable to KO Trapinch immediately, it can stall out Superpower with Recover. Alternatively, Download Porygon can often KO Trapinch reliably and make use of this relatively free turn.</p> ",
    "sets": [
      {
        "name": "Trapper",
        "description": "<h1>Moves</h1> <p>Earthquake is mandatory in order for Trapinch to threaten the likes of Ponyta and Pawniard. Superpower allows Trapinch to greatly damage Ferroseed and OHKO Pawniard. First Impression offers some marginal utility to Trapinch once its primary targets have been KOed; it is potentially useful against a foe like Galarian Ponyta or Grookey. Feint is useful for picking off a low health Pokemon; it can be particularly useful against Abra, which will often use Protect to avoid First Impression.</p> <h1>Set Details</h1> <p>The Speed EVs let Trapinch hit 8 Speed to outspeed Ferroseed. The remaining EVs are tailored to trap and remove Pawniard as efficiently as possible. A Careful nature is desirable to give Trapinch a better chance to survive attacks from Porygon and Abra.</p> <h1>Usage Tips</h1> <p>It is most important to prioritize Trapinch's targets in any given game, and such targets will vary depending on your team's structure regardless of team archetype, with the biggest priorities tending to be Onix and Diglett. Trapinch is a support Pokemon and thus will seek to trap the counters of its teammates. Typically, Trapinch is able to switch directly into what it is meant to remove and can use the appropriate move without issue. In some cases, preserving Trapinch to nail a revenge killer like Abra or Grookey with First Impression later in the game can be particularly useful.</p> <h1>Team Options</h1> <p>Ponyta love Trapinch's ability to switch into and remove two of its best checks in Pawniard and Onix, and Ponyta also appreciates Trapinch counter trapping Diglett. Ferroseed also shares good type synergy with Trapinch, as it acts as a solid answer to Staryu and Grass-types, which prove to be troublesome for teams built around Trapinch. Offensive Porygon appreciates the removal of Steel-types and is a useful teammate due to its good bulk.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 175616, "username": "Empress"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 208173, "username": "Fiend"}]}
  },
  "Corphish": {
    "overview": "<p>Corphish is one of the best wallbreakers in LC thanks to its ability Adaptability and its Water typing, allowing it to take care of Pokemon like Onix and Ponyta. It also has access to priority with Aqua Jet, letting it take down faster Pokemon such as Vullaby after a Swords Dance and Stealth Rock damage, and coverage moves such as Knock Off and Superpower that allow it to threaten Frillish and Ferroseed. Crabhammer is one of its best neutral moves, as it can get off decent damage on most Pokemon and become even more threatening after a Swords Dance or Dragon Dance. However, Corphish struggles with Grass-types like Oddish, Electric-types like Chinchou, and especially Croagunk because of its ability Dry Skin, rendering Corphish's Water-type attacks useless, and resistances to with Superpower and Knock Off. Corphish also has trouble with special attackers like Wingull, Spritzee, and Galarian Ponyta due to its subpar Special Defense stat.</p> ",
    "comments": "<h1>Other Options</h1> <p>Life Orb can be used to enable Corphish to OHKO Galarian Ponyta with Aqua Jet and 2HKO most of the metagame, but it is not worth the drop in bulk and recoil. A Choice Scarf or Choice Band set can look appealing thanks to Corphish's strong STAB moves and ability to cripple walls with Switcheroo, but the Choice lock and the drop in bulk make it not worthwhile.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Oddish gives Corphish trouble, as it can use its STAB attacks or Strength Sap to take care of it. If Corphish is not running Superpower, Ferroseed can also wall it, as it can take a boosted Knock Off and greatly weaken Corphish with its Grass-type STAB attacks.</p> <p><strong>Croagunk: Corphish falls short against Croagunk thanks to its typing and its ability Dry Skin, allowing it to absorb Corphish's STAB attacks.</p> <p><strong>Chinchou</strong>: Chinchou can use its Electric-type attacks to OHKO Corphish.</p> <p><strong>Mareanie</strong>: Mareanie is able to wall Corphish thanks to its resistance to Crabhammer and ability to tank any attack from it after using Iron Defense.</p> <p><strong>Timburr and Spritzee</strong>: Pokemon like Timburr and Spritzee are both able to take a Crabhammer from Corphish and severely damage it back with Drain Punch or Moonblast, respectively.</p> <p><strong>Special Attackers</strong>: Corphish is more vulnerable to special attacks because of its low Special Defense stat, so Galarian Ponyta and Spritzee can check Corphish because of their ability to either outpace or take a hit from Corphish.</p> <p><strong>Status</strong>: Will-O-Wisp users like Frillish can cripple Corphish for the rest of the game. Thunder Wave will cripple it and leave it unable to outpace most Pokemon. Poison from Toxic Spikes will also put Corphish on a timer and eventually take care of it.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<h1>Moves</h1> <p>Crabhammer is Corphish's main way to do major damage to Spritzee, Timburr, and Galarian Farfetch'd while also OHKOing Vullaby after Stealth Rock damage, Ground-types such as Onix, and Fire-types such as Ponyta. Swords Dance-boosted Aqua Jet lets Corphish net KOs on faster Pokemon like Vullaby after Stealth Rock damage. Knock Off is great for getting rid of Eviolite on switch-ins such as Spritzee and Ferroseed. Swords Dance lets Corphish become a fearsome wallbreaker to take care of walls such as Mareanie and Spritzee. Alternatively, Dragon Dance allows it to outpace Pokemon it could not unboosted, such as Galarian Ponyta, Galarian Farfetch'd, and Vullaby. Superpower can be used over Knock Off in order to OHKO Ferroseed after a Swords Dance.</p> <h1>Set Details</h1> <p>Adaptability boosts Corphish's STAB attacks, which makes it a powerful attacker right off the bat. An Adamant nature with maximum Attack EVs further helps its wallbreaking abilities. 236 Speed EVs allow it to outpace Pokemon such as Timburr and Frillish.</p> <h1>Usage Tips</h1> <p>Corphish can force out Onix and Vullaby, so use Knock Off on incoming foes to remove their items. Use Swords Dance or Dragon Dance on Pokemon it can force out such as Ponyta and Drilbur. Use Corphish mid-game once its checks are weakened to use Swords Dance or Dragon Dance to sweep. Corphish can also be used early-game to remove items with Knock Off from the opposing team, assisting it and its teammates throughout the game. Be careful around special attackers such as Spritzee, Mareanie, and Galarian Ponyta, as Corphish cannot take their attacks well, and Will-O-Wisp users like Frillish and Ponyta, because Corphish cannot OHKO these without setting up with Swords Dance or Dragon Dance and can be crippled for the rest of the game.</p> <h1>Team Options</h1> <p>Onix and Mudbray are able to support Corphish with Stealth Rock to chip Pokemon on the switch and take care of Mareanie and Croagunk. Spikes users such as Ferroseed are great to use to wear down Pokemon and threaten Chinchou. Dewpider is useful for setting up Sticky Web, allowing Corphish to outpace Pokemon it could not before, and also greatly chip down Pokemon like Timburr with a Water Bubble-boosted Scald. Krabby goes well with Corphish to form a wallbreaking duo, as both can help take care of each other's threats. Timburr and Galarian Farfetch'd are great teammates due to their ability to take on Ferroseed and take Knock Off from Pawniard and Ferroseed well. Galarian Farfetch'd appreciates Corphish for being able to check Dragon Dance Onix and cripple Oddish and Mareanie with Knock Off, making it easier for Galarian Farfetch'd to take care of them. Ponyta is a great partner for Corphish, as it is able to take down Grass-types such as Oddish and Ferroseed. Corphish also appreciates Ponyta due to Will-O-Wisp crippling physical attackers such as Galarian Farfetch'd and Vullaby. Vullaby is a great partner to take care of Grass-types that Corphish struggles with such as Oddish and Ferroseed. Diglett is helpful for trapping and OHKOing Chinchou and Croagunk with Earthquake. Pawniard helps Corphish by pressuring Pokemon such as Spritzee as well as Shellder and Galarian Ponyta with Sucker Punch. Spritzee can deal with troubling Fighting-types that threaten an unboosted Corphish such as Timburr and Galarian Farfetch'd, making it easier for Corphish to set up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 110102, "username": "jake"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Wynaut": {
    "overview": "<p>As the only Pokemon with the ability Shadow Tag in LC, Wynaut is able to trap all non-Ghost type Pokemon. An impressive base HP stat of 95 lets Wynaut absorb a hit and almost always KO the trapped attacker with Counter or Mirror Coat. However, Wynaut suffers from a shallow movepool that lacks any offensive moves, making it a reactive trapper that relies on good predictions. Its mediocre Speed and lack of recovery outside Berry Juice jeopardize its longevity and ability to trap consistently. Additionally, Wynaut faces competition from other trappers such as Diglett and Trapinch that offer more reliable, flexible, and proactive trapping.</p> ",
    "comments": "<h1>Other Options</h1> <p>Safeguard can be used over Destiny Bond to protect Wynaut from status moves such as Shellos's Toxic and Foongus's Spore, helping Wynaut better trap them. Tickle can also be used over Destiny Bond to make trapping easier or weaken targets enough for an incoming sweeper. A bulkier EV spread of 236 HP / 52 Def / 52 SpD can be utilized to improve Wynaut's bulk but lets it be outsped by Timburr and Shellos, making it unable to use Encore first. Eviolite can be utilized instead of Berry Juice to bolster Wynaut's defenses to let it handle more hits, but it makes Wynaut lose out on its only reliable source of recovery.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Dark-types such as Pawniard, Vullaby, and Scraggy are able to outspeed and KO Wynaut with Knock Off. Furthermore, they serve as a switch-in from Volt Switch users since they are immune to Mirror Coat.</p> <p><strong>Ghost-types: Ghost-types such as Frillish are not affected by Shadow Tag and pressure Wynaut with their STAB moves. Also, they can function as switch-ins from U-turn users due to their immunity to Counter.</p> <p><strong>Knock Off Users: Knock Off users such as Pawniard, Vullaby, and Mienfoo can limit Wynaut's effectiveness by KOing it or removing its only source of recovery in Berry Juice.</p> <p><strong>Taunt Users: Taunt users such as Onix and Mienfoo outspeed Wynaut and force it to only use Counter or Mirror Coat. In the case of Onix, it is able to create prediction battles between Stealth Rock and Rock Blast that favor it because Counter only doubles the damage of the last hit of Rock Blast.</p> <p><strong>VoltTurn Users: U-turn and Volt Switch users such as Vullaby, Mienfoo, and Chinchou are able to avoid getting trapped by Wynaut and switch into a Ghost- or Dark-type that is immune to Counter or Mirror Coat.</p> <p><strong>Spritzee: Spritzee is able to ignore Encore due to its ability in Aroma Veil. Furthermore, its Nasty Plot set is able to boost on Wynaut, leading to prediction battles between Destiny Bond and Mirror Coat.</p> ",
    "sets": [
      {
        "name": "Trapper",
        "description": "<h1>Moves</h1> <p>Counter and Mirror Coat allow Wynaut to OHKO most attackers after taking a hit. Encore guarantees that you will choose correctly between Counter or Mirror Coat, depending on the type of move, or can switch to a Pokemon that is able to better exploit the move to preserve Wynaut for later usage. Destiny Bond gives Wynaut one last opportunity to KO an unsuspecting revenge killer or pivot.</p> <h1>Set Details</h1> <p>76 HP EVs, along with 52 Defense and 52 Special Defense EVs, help Wynaut reach 27 HP / 12 Def / 12 SpD, helping it tank both physical and special hits. 252 EVs in Speed with a Jolly nature allow Wynaut to reach 13 Speed, outspeeding defensive trapping targets such as Shellos, Timburr, Ferroseed, and Foongus. Berry Juice is the preferred item, as it provides Wynaut with a source of recovery to help it better absorb damage.</p> <h1>Usage Tips</h1> <p>When using Wynaut to trap certain defensive targets, it should not be sent into strong attacking moves, especially Knock Off, to preserve Berry Juice. Instead, Wynaut should enter the battle after a switch from an offensive pivot or as a revenge killer against slow, passive, and bulky walls. It is able to switch in on resisted attacks like Timburr's Drain Punch or on weak offensive moves like Shellos's Scald and use Encore for a more reliable KO with Counter or Mirror Coat. Wynaut can also utilize Encore to lock foes into a setup or non-damaging move in order to safely bring in a check or counter. Likewise, Wynaut can freely revenge kill Choice Scarf users such as Galarian Farfetch'd when they are locked into resisted attacks such as Close Combat.</p> <h1>Team Options</h1> <p>Wynaut appreciates the removal of Pawniard and Vullaby, as both Dark-types threaten Wynaut's effectiveness and ability to switch in. Timburr, Ponyta, and Onix serve as key checks to them. Wynaut is able to complement these checks by removing bulky Water-types like Shellos and Mareanie. Entry hazard setters such as Pawniard, Onix, and Ferroseed benefit from Wynaut's ability to trap Timburr. Setup sweepers such as Nasty Plot Vullaby, Agility Porygon, and Shellder relish an opportunity to boost and sweep after the removal of certain walls or by exploiting an Encore-locked foe. Lastly, offensive pivots such as Vullaby and Mienfoo assist Wynaut by providing more scenarios for it to come into play and trap foes.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 110102, "username": "jake"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Shellos": {
    "overview": "<p>Shellos is one of the bulkiest Pokemon in LC thanks to its high HP, reliable recovery, and Sticky Hold ability, which prevents its Eviolite from being removed. Its physical bulk and lack of weaknesses means it can often stonewall physical attackers and sweepers, and even special sweepers struggle to break Shellos before it removes their boosts with Clear Smog. It can sometimes function as a wincon, owing to the rarity of strong Grass- and Electric-type moves and its ability to outlast most foes. However, Shellos is also relatively passive and can be smothered by a prepared team, especially ones that spread poison or carry Taunt, and it struggles mightily against the common bulky Grass-types, Foongus and Ferroseed. Shellos's lack of resistances can also lead to it being worn down by the tier's most powerful breakers, like Grookey, Abra, and Reckless Mienfoo. Nonetheless, it is a sturdy Pokemon that can find a home in many defensive cores.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ice Beam is an option over Clear Smog or Toxic to hit Foongus, but dropping either move sacrifices some defensive capability. Earth Power is an option to hit Mareanie. Mirror Coat lets Shellos surprise and KO special attackers like Porygon, and Counter does the same to physical attackers like Timburr, both owing to Shellos's tremendous bulk and HP and the difficulty of OHKOing it. Shellos can run a variety of boosting moves to more directly serve as a wincon, including a set of Curse, Amnesia, Facade, and Rest; this set needs extensive team support, though, and is unable to beat Taunt users and Ghost-types. An investment of 68 HP / 132 Def / 20 SpD / 244 Spe with a Bold nature can be run with Amnesia and Acid Armor as a wincon that sets up on physical attackers.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grookey can break Shellos with its extremely powerful Grassy Glide and Wood Hammer. Foongus can outlast Shellos by healing while hitting it with Giga Drain, in addition to resisting Scald and being immune to Toxic. Foongus also can generate momentum by using Spore. Ferroseed walls Shellos while threatening it with Giga Drain or Bullet Seed, but must be wary of Shellos stalling out Giga Drain PP with Recover. Foongus must be wary of the rare Ice Beam.</p> <p><strong>Electric-types: Magnemite can KO Shellos with its powerful Thunderbolt or pivot with Volt Switch, though it cannot switch into Scald well.</p> <p><strong>Poison: Poison, especially Toxic, can invalidate Shellos's ability to wall threats. Running Toxic on unusual Pokemon that Shellos likes to come in against, such as Ponyta, Timburr, and Diglett, can surprise and inhibit it. Shellos also must fear being forced onto the field when Toxic Spikes are up. Shellos often appreciates its own burn to prevent being poisoned.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<h1>Moves</h1> <p>Scald deals reliable damage to neutral foes while spreading invaluable burns to render physical attackers useless. Recover keeps Shellos healthy enough to deal with multiple foes or outstall Pokemon that cannot break it like physical Vullaby. Clear Smog helps to check Pokemon that would otherwise try to set up on Shellos, like Nasty Plot Vullaby, and can prevent a sweep in motion if Shellos is healthy enough to survive a hit. Toxic lets Shellos outlast most foes and threaten bulky walls like Spritzee and Porygon, spreading chip damage so that a bulkier team can win a longer game.</p> <h1>Set Details</h1> <p>Eviolite, in tandem with Sticky Hold, makes Shellos incredibly bulky and one of the few Pokemon not threatened by Knock Off. A Bold nature and the given defensive investment give Shellos even Defense and Special Defense to take advantage of Eviolite. Maximum HP investment gives Shellos a sky-high 27 HP and reduces the threat from Final Gambit users like Diglett. The remaining investment in Speed lets Shellos Speed tie with standard Timburr and outspeed standard Spritzee.</p> <h1>Usage Tips</h1> <p>Shellos functions as a wet blanket to smother offensive momentum and checks potent threats like Ponyta, Timburr, physical Vullaby, and Dragon Dance Onix. You should prioritize using Recover and keeping Shellos's health high so that it can repeatedly take heavy hits. Against setup sweepers like Nasty Plot Vullaby, maintaining enough health to survive a hit and then use Clear Smog is crucial. Shellos should generally not stay in against Pokemon that can poison it, such as Mareanie. Beware Mold Breaker Pancham, which is the only Pokemon able to remove Shellos's Eviolite with Knock Off.</p> <h1>Team Options</h1> <p>Shellos fits well on teams that need a blanket answer to physical attackers, especially Ponyta and Ground-types like Onix and Mudbray. In turn, it appreciates Pokemon that can switch into Foongus, Grookey, and Ferroseed, and it partners well with its own Ferroseed. Teammates that can set up on Foongus make for great partners, such as Ferroseed with Spikes. Diglett can trap and remove Magnemite, and Trapinch can trap Grookey. Shellos appreciates a Poison-type teammate that can absorb Toxic Spikes, like Foongus and Mareanie; it can also take advantage of its own Toxic Spikes set by Mareanie and Koffing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208173, "username": "Fiend"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 150971, "username": "Coconut"}]}, {"name": "Grammar checked by", "members": [{"user_id": 216033, "username": "Winry"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Munchlax": {"sets": [{"name": "CurseLax"}]},
  "Croagunk": {
    "sets": [{"name": "Nasty Plot", "description": "<p>Croagunk finds a niche in LC as a specially-attacking Fighting-type with useful resistances to Grookey and opposing Fighting-types like Mienfoo and Timburr. However, its middling bulk and lack of recovery make Croagunk susceptible to getting chipped and render it unable to check these Pokemon multiple times, especially if it gets hit by Knock Off. Croagunk is also vulnerable to trappers such as Diglett and Trapinch. Dry Skin allows Croagunk to switch in safely on threats such as Mareanie and non-Psychic Staryu and use them as setup fodder with Nasty Plot. Vacuum Wave gives Croagunk a way to finish off weakened foes while also allowing it to avoid risking the powerful but inaccurate Focus Blast. The best partners for Croagunk include Pawniard and Ferroseed, which help deal with Psychic-types, and countertrappers such as Air Balloon Diglett and Trace Porygon.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 536936, "username": "Afdvsc"}]}
  },
  "Snover": {"sets": [{"name": "Hail Setter"}]},
  "Drilbur": {
    "overview": "<p>Drilbur's decent Speed tier combined with its access to fantastic coverage in Earthquake and Rock Slide and boosting moves in Swords Dance and Rapid Spin allows it to be a niche sweeper in LC. Furthermore, Drilbur is one of the only viable spinners and makes for a decent support Pokemon, being able to set up entry hazards while also removing opposing entry hazards. However, Drilbur finds it hard to break through teams without Swords Dance, and if it did, it would find it hard to set up due to its low bulk. Furthermore, it is easily beaten by common threats such as Mienfoo, Grookey, and Staryu.</p> ",
    "sets": [
      {
        "name": "Offensive Rapid Spin",
        "description": "<h1>Set Description</h1> <p>Rapid Spin allows Drilbur to remove entry hazards and gives it a +1 Speed boost, allowing it to outpace threats that would outspeed or Speed tie with Drilbur otherwise, such as Abra, Mienfoo, and Staryu. Earthquake is Drilbur's best STAB move, allowing it to deal decent damage to every Pokemon that doesn't resist it. Rock Slide gives Drilbur perfect neutral coverage, hitting Pokemon that are immune to Earthquake such as Vullaby and Wingull. Swords Dance can be used to increase Drilbur's Attack and pairs well with Rapid Spin, making Drilbur a threatening setup sweeper. Alternatively, Stealth Rock allows Drilbur to deal chip damage to opposing Pokemon switching in.</p> <h1>Set Details</h1> <p>Maximum Speed investment in addition to a Jolly nature makes Drilbur as fast as possible, allowing it to outspeed Pawniard and Vullaby. 76 EVs in Attack allow Drilbur to 2HKO most Vullaby sets after Stealth Rock. The rest of the EVs are placed into Defense and Special Defense to allow Drilbur to take hits from Diglett, Vullaby, and Mudbray. Berry Juice is the preferred item in order for Drilbur to have access to recovery, but Eviolite allows Drilbur to tank hits non-Eviolite sets would not be able to take, such as +2 Dark Pulse from Vullaby, High Jump Kick from Mienfoo, and Psychic from Abra. Mold Breaker is used to help surpass abilities like Sturdy from Onix and Levitate from Koffing.</p> <h1>Usage Tips</h1> <p>Drilbur's access to a powerful Earthquake can force Pokemon such as Pawniard and Onix to switch out. This gives Drilbur the opportunity to remove entry hazards with Rapid Spin, set Stealth Rock to support its teammates, or boost its Attack with Swords Dance. Pokemon that are faster or capable of revenge killing Drilbur, such as Staryu, Wingull, and Grookey, should be removed from the game early to help Drilbur either get a Rapid Spin off for other Pokemon to sweep or act as a late-game sweeper itself. When you know a Flying-type is going to potentially switch into Earthquake, use Rock Slide to catch them off guard.</p> <h1>Team Options</h1> <p>Flying-types such as Vullaby and Wingull make for good partners for Drilbur, since they can threaten Grass-types like Foongus and Grookey as well as Fighting-types like Timburr and Mienfoo. Vulpix and Ponyta in particular make for good teammates because they can break through Ferroseed, and in return, Drilbur can remove entry hazards and weaken Mareanie. Finally, checks to Water-types are appreciated by Drilbur, making Grass-types like Ferroseed, Foongus, and Grookey good partners.</p> <h1>Other Options</h1> <p>Sand Rush is an alternative over Mold Breaker to outspeed foes in sand, but it requires additional support from Hippopotas and Drilbur will lose out on Mold Breaker being able to bypass Levitate. Life Orb can be used over Berry Juice to hit bulky Pokemon like Spritzee and Ferroseed harder, but it is not worth getting rid of the recovery Berry Juice provides. A set with Stealth Rock, Swords Dance, Rapid Spin, and Earthquake can be used, but keep in mind that this will omit Drilbur's ability to cover Flying-types.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Offensive Water-types such as Staryu and Wingull can outspeed and easily OHKO Drilbur with their STAB moves. Bulky Water-types like Frillish and Shellos render Drilbur useless and force it out, with Frillish also functioning as a spinblocker.</p> <p><strong>Grass-types: Grookey can OHKO Drilbur with Grassy Glide. Ferroseed and Foongus shrug off Drilbur's attacks pretty easily and can dish a lot of damage with Giga Drain and Bullet Seed.</p> <p><strong>Fighting-types</strong>: Both Timburr and offensive Mienfoo can tank an Earthquake from Drilbur. Timburr can then beat Drilbur with a combination of Drain Punch and Mach Punch, while Mienfoo can OHKO it with High Jump Kick.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 195129, "username": "Nineage"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 323515, "username": "seo."}, {"user_id": 506687, "username": "ImperialGamer517"}]}
  },
  "Timburr": {
    "overview": "<p>Timburr's strong offensive typing, high Attack stat, and decent bulk make it a terrific glue Pokemon on a variety of team styles. It has an excellent movepool, including a strong STAB priority move in Mach Punch, semi-reliable recovery with Drain Punch, and a variety of coverage options including Knock Off, Ice Punch, and Thunder Punch. Furthermore, Defog makes Timburr one of the best entry hazard removers in the tier, especially since it resists Stealth Rock and can check common hazard setters such as Ferroseed and Onix. Timburr has two excellent abilities, allowing it to perform different roles on a team. Iron Fist increases immediate wallbreaking potential, while Guts allows Timburr to act as a status absorber. However, it is commonly walled by Poison-types, as Timburr cannot carry all the necessary coverage. It is also limited by a mediocre Speed stat and has to run significant investment to attempt to outspeed its checks at the cost of offensive power or bulk.</p> ",
    "comments": "<h1>Other Options</h1> <p>There are no viable other options for Timburr.</p> <h1>Checks and Counters</h1> <p><strong>Poison-types</strong>: Koffing, Mareanie, and Foongus are all able to switch into Timburr. Koffing completely walls Timburr regardless of coverage, while Mareanie and Foongus wall Timburr depending on its coverage options.</p> <p><strong>Psychic-types: Psychic-types such as Galarian Ponyta and Natu are particularly threatening because they can switch into Timburr and threaten to KO it with their STAB attacks. However, they should be wary of switching into Knock Off. Abra, as well as strong Psychic-type coverage from foes like Porygon and Staryu, can also demolish Timburr.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<h1>Moves</h1> <p>Drain Punch's recovery is important for keeping Timburr healthy and allowing it to face foes such as Onix and Ferroseed one-on-one. Mach Punch revenge kills faster threats. Knock Off allows Timburr to weaken all foes by removing their items while also hitting Psychic-types like Natu and Galarian Ponyta. Defog is used to remove all entry hazards on the field, helping teammates to switch in more easily. Thunder Punch hits Mareanie, Natu, and Frillish. Ice Punch can be run to hit Foongus and Natu super effectively.</p> <h1>Set Details</h1> <p>The EV spread gives Timburr the ability to better perform in a on-on-one scenario against foes like Mienfoo. It is worth noting that Timburr's Speed is also somewhat customizable. Running 156 Speed EVs allow Timburr to outspeed standard Mareanie. Iron Fist is typically used on this set to improve the damage output of Drain Punch, Mach Punch, and coverage punches. Guts is an alternative option that allows Timburr to fare better against potential status from Ponyta, Ferroseed, and other status users.</p> <h1>Usage Tips</h1> <p>Timburr is an excellent switch-in to Ferroseed, Onix, and Pawniard and can generate offensive momentum by forcing them to switch out. It is good to keep the opponent guessing Timburr's moveset, since a Knock Off into a suitable coverage move can help make huge progress in a game. Early-game, Timburr should attempt to punish expected switches by using Knock Off. This can soften the opponent's team up for teammates to take advantage of late-game. Alternatively, it should use Defog on expected switches to remove entry hazards. If the team is weak to setup sweepers, Timburr should be preserved to prevent a late-game sweep and should avoid having its item removed by Knock Off. If Guts is being used, Timburr can switch into expected Will-O-Wisp from Ponyta or Frillish to gain an Attack boost.</p> <h1>Team Options</h1> <p>Natu appreciates Timburr's ability to remove Stealth Rock and switch into Steel- and Rock-types such as Pawniard and Onix. Other Fighting-types, particularly Mienfoo, can work with Timburr to break through their shared checks. Pawniard helps Timburr against Psychic-types like Natu, Abra, and Galarian Ponyta. These Psychic-types also make great partners, pressuring Poison-types like Koffing, Foongus, and Mareanie.</p> "
      },
      {
        "name": "Bulk Up",
        "description": "<h1>Moves</h1> <p>Bulk Up turns Timburr into a powerful sweeper that many teams will struggle to deal with. Drain Punch is the primary attack for this set, recovering health and boosting longevity. Mach Punch provides revenge killing utility, regardless of whether Timburr is boosted or not. Knock Off allows Timburr to weaken all foes by removing their items while also hitting Psychic-types super effectively. It also hits Poison-types like Mareanie and Koffing neutrally, making them more susceptible to Drain Punch. Thunder Punch can be used to hit Mareanie and Natu very hard. Ice Punch is a potential option if Foongus is an issue.</p> <h1>Set Details</h1> <p>236 Special Defense EVs with a Careful nature and Eviolite prevent Timburr from being easily worn down by special attackers. Guts is the preferred ability, since the boost from burns allows Timburr to take Mareanie one-on-one. The EV spread can be customized to help Timburr set up on different foes. For example, it can forgo Special Defense investment in favor of Attack or Speed investment if the team otherwise handles special attackers very well.</p> <h1>Usage Tips</h1> <p>This set is best used as a late-game sweeper when its checks have been sufficiently weakened. Try to weaken and pressure Timburr's checks, primarily Mareanie, Koffing, and Natu, by removing their items and keeping them at low health. Timburr can use Knock Off early-game to make a late-game sweep easier. It can also still act as a check to Rock- and Steel-types, primarily Onix and Pawniard. However, it should be used sparingly against them so that it can retain its item and stay close to full health to help a late-game sweep. It is worth noting that Timburr can use them as setup opportunities. It is best to use Bulk Up on expected switches and foes that struggle to deal significant damage to Timburr, such as Ferroseed. The uncommonness of the Bulk Up set means that Timburr can bluff a standard bulky attacker set and catch the opponent off guard by setting up later in the game.</p> <h1>Team Options</h1> <p>Pawniard pressures Psychic-types and weakens Poison-types with Knock Off. Porygon and Psychic-types like Abra and Galarian Ponyta appreciate Timburr pressuring Steel-types. In return, they are able to force out Poison-types like Koffing, Mareanie, and Foongus.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 420389, "username": "Stoward"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Cottonee": {
    "sets": [{"name": "Memento", "description": "<p>Cottonee has good support moves and Prankster, which allows it to provide opportunities for setup sweepers on hyper offense teams with Memento. Cottonee's typing lets it check some of the biggest issues for hyper offense teams in Mienfoo and Grookey. It also enables Zigzagoon by luring and crippling Ferroseed and Pawniard with Knock Off. Encore and Defog give Cottonee a bit more flexibility by allowing it to provide additional setup opportunities for teammates and help teammates such as Magby switch in safely. Cottonee pairs well with Memento Diglett as a secondary Memento user; together, they can provide setup opportunities for multiple setup sweepers. The best teammate for Cottonee is Zigzagoon, which is almost always the setup sweeper it facilitates, but it can also be used for other sweepers like Magby and Tyrunt.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 536936, "username": "afdvsc"}]}
  },
  "Darumaka-Galar": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>With one of the highest Attack stats in LC combined with Hustle, Galarian Darumaka can make a potent Choice Scarf wallbreaker, although Hustle's inaccuracy can make it a double-edged blade. This set capitalizes on its good movepool; Ice Punch is its main STAB move, hitting Flying-types like Vullaby. Superpower OHKOes Munchlax, while Zen Headbutt 2HKOes Mareanie after Stealth Rock. U-turn can put pressure on the opponent and helps maintain momentum. This EV spread allows Galarian Darumaka to hit its maximum Attack; combined with a Choice Scarf, this allows Darumaka to put on pressure right away. Teams that struggle with defensive walls like Ferroseed and Munchlax benefit from Galarian Darumaka's presence, as its power and speed with a Choice Scarf allow it to punch through and pressure defensive teams. However, it takes a hefty amount from Timburr's Mach Punch and can't outspeed Choice Scarf Galarian Farfetch'd. Because of this, teammates that can deal with Fighting-types are useful, like Spritzee and Oddish. Since Darumaka is weak to Stealth Rock, it also appreciates entry hazard control from Pokemon like Vullaby and Drilbur.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 110102, "username": "jake"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 202097, "username": "Gummy"}]}
  },
  "Dwebble": {
    "overview": "<p>With access to Stealth Rock and Spikes, along with the ability to beat the tier's most common Defogger, Dwebble is one of the leading entry hazard stackers in the tier. Shell Smash coupled with a decent Attack stat also allows it to become a dangerous sweeper; these two sets require significantly different counterplay, which can trip an unprepared opponent up. Sturdy gives Dwebble opportunities to set entry hazards or use Shell Smash. However, its mediocre defensive typing gives it very few resistances, and its reliance on its item leaves it susceptible to Knock Off. Additionally, it faces competition from Ferroseed, which can also set the same entry hazards while offering more defensive utility, although it lacks the offensive presence that Dwebble's Shell Smash set provides. It also faces competition from Onix, which is faster and has a better offensive typing. Onix can run Sturdy sets too, though it tends not to, leaving Dwebble as the tier's best Sturdy user.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Weak Armor set can be run with a spread of 36 HP / 156 Atk / 76 Def / 236 Spe alongside a Jolly nature and Eviolite. This functions similarly to the suicide lead set, but it finds it easier to set hazards against Knock Off users while being able to check Vullaby. Dwebble can choose to run a Bug-type STAB move; this offers no meaningful coverage, however. The Shell Smash set can run Aerial Ace to hit Timburr and Mienfoo, but this still doesn't KO them at +2 and generally isn’t worthwhile.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: While Timburr and Mienfoo don't like getting hit by Knock Off, they can counter all Dwebble sets - Eviolite sets survive any move from Dwebble even at +2. Timburr is particularly threatening, as it can heal back up with Drain Punch, remove entry hazards with Defog, and KO Dwebble with priority Mach Punch. Mienfoo can break its Sturdy with Fake Out and then KO Dwebble with High Jump Kick.</p> <p><strong>Water-types</strong>: Staryu is able to remove Dwebble's entry hazards with Rapid Spin, gaining a Speed boost while doing so, while taking any hit from the Shell Smash set and OHKO it in return. Corphish has access to Knock Off and Aqua Jet, allowing it to easily beat Dwebble one-on-one.</p> <p><strong>Multi-hit moves: Multi-hit moves hinder all Dwebble sets, as they can break through Sturdy and potentially OHKO it. Onix with Rock Blast is particularly threatening, as it outspeeds Dwebble and hits it super effectively.</p> <p><strong>Ground-types: Ground-types are threatening, since Dwebble lacks the coverage to hit them super effectively. Mudbray is particularly threatening because it gains Defense boosts from each hit.</p> <p><strong>Ferroseed: Ferroseed can take any hit from the Shell Smash set, even at +2, and use Knock Off and Thunder Wave to hinder both Dwebble sets.</p> <p><strong>Grookey</strong>: While it is unable to switch directly into Dwebble, Grookey can revenge kill Dwebble with Grassy Glide.</p> ",
    "sets": [
      {
        "name": "Suicide Lead",
        "description": "<h1>Moves</h1> <p>Stealth Rock damages and wears down every Pokemon in the metagame. Spikes is useful to damage all grounded foes. Knock Off allows Dwebble to remove the foe's item to help its teammates. Counter can be used to OHKO a physical foe such as Timburr if it chooses to attack. Rock Blast is a terrifying multi-hit STAB attack, threatening to OHKO foes like Berry Juice Vullaby and frail threats like Abra and Dewpider that have a Focus Sash. Alternatively, Earthquake can be used to deal more damage to Rock-resistant foes.</p> <h1>Set Details</h1> <p>Maximum EVs and a Speed-boosting nature are used to get out as many entry hazards as possible before being KOed. Maximum Attack is used because Dwebble relies on Sturdy and Berry Juice for longevity, meaning it has no need for defensive investment. There are enough remaining EVs to increase its HP stat, but this is avoided so that Berry Juice is guaranteed to fully restore its health and reactivate Sturdy. Sturdy guarantees that Dwebble can take a hit from full HP, giving it an extra turn to set entry hazards. Another option is to run a Hasty nature with 0 Defense IVs, which allows Dwebble to OHKO Timburr and offensive Mienfoo with Counter if they use Knock Off.</p> <h1>Usage Tips</h1> <p>As the name of this set indicates, Dwebble is used as a lead. The main objective of this set is to put up multiple entry hazards before being KOed. However, preserving Dwebble can be advantageous in some situations where it can be sacrificed later in the game to provide offensive momentum. Typically, Dwebble will rarely be using its offensive moves, since the utility of stacking entry hazards is preferable to the utility of Knock Off or other offensive moves.</p> <h1>Team Options</h1> <p>Offensive teams benefit most from Dwebble, as they can pressure the opponent and make it difficult for them to find an opportunity to remove entry hazards. Setup sweepers like Dragon Dance Scraggy and Nasty Plot Vullaby appreciate entry hazards breaking Sturdy on their foes and wearing down their checks. Pawniard can punish Defog with Defiant and therefore makes for a good partner. Frillish is immune to Rapid Spin and is able to switch in against the most prominent user of the move, Staryu, making it a good pick on entry hazard-stacking teams. Having a Rapid Spin user on the team is useful for removing entry hazards from your side of the field. Offensive threats such as Grookey, Abra, and Choice Scarf Mienfoo appreciate hazard support, as it helps to put their checks in range of an OHKO.</p> "
      },
      {
        "name": "Shell Smash Sweeper",
        "description": "<h1>Moves</h1> <p>Shell Smash raises Dwebble's Attack and Speed by 2 stages, drastically increasing its power and allowing it to outspeed the entire unboosted metagame. Rock Blast is generally the preferred STAB move, as it is the most accurate Rock-type move with good power and will often hit at least as hard as Rock Slide due to Little Cup's low HP totals. It also breaks through Focus Sash and Sturdy users. Alternatively, Stone Edge can be chosen for more consistent damage, if it hits, and to bypass Berry Juice on foes like Weak Armor Vullaby. Earthquake is Dwebble's best coverage move, hitting the Rock-resistant Pawniard and Onix super effectively, and it gets a neutral hit against other foes like Timburr and Mudbray. Knock Off provides good neutral coverage, with the utility of removing the foe's Eviolite and weakening them. Counter and Stealth Rock are niche alternative moves.</p> <h1>Set Details</h1> <p>Maximum Attack EVs and an Attack-boosting nature are used to optimize Dwebble's sweeping power. Maximum Speed EVs allow Dwebble to outspeed the entire metagame after a Shell Smash boost, only tying with the rare Choice Scarf Diglett. There is no HP investment to ensure that Berry Juice reactivates Sturdy. Sturdy guarantees that Dwebbles survives one hit when at full health, allowing it to take a hit while setting up. Berry Juice restores its HP to full, which reduces Dwebble’s susceptibility to being picked off by weak priority moves.</p> <h1>Usage Tips</h1> <p>Try to avoid switching Dwebble into entry hazards at all costs, since this will stop Sturdy from activating and will prevent a safe setup with Shell Smash. Avoid being hit by Knock Off as well, since Dwebble's item is important to give it setup opportunities. Dwebble should be used as a late-game sweeper, setting up when its checks are sufficiently weakened. Try to bring Dwebble in on a free switch, such as after a Pokemon has fainted or via a slow U-turn, so it doesn't lose its Berry Juice early by switching into an attack. Weaken or remove bulky Pokemon like Mudbray, Spritzee, and Timburr before attempting to sweep with Dwebble, because they can take even a boosted hit and retaliate for lots of damage. Try to remove priority move users, as they can easily pick off Dwebble after its defenses are lowered by Shell Smash. With Sturdy intact, Dwebble can also act as a countermeasure for opposing sweepers that don't have multi-hit moves.</p> <h1>Team Options</h1> <p>Entry hazards from Pokemon like Ferroseed and Pawniard wear down opposing Pokemon, allowing Dwebble to KO more foes. A teammate that provides entry hazard removal such as Staryu, Defog Timburr, or Vullaby, is essential for helping to preserve Dwebble's Sturdy. Pokemon that can bring Dwebble in safely like U-turn Mienfoo and Vullaby are good partners. Pokemon like Giga Drain Ferroseed and Staryu that deal with bulky Ground-types are helpful. Mareanie and Spritzee are good team choices as well because they can deal with Timburr. Trappers such as Diglett and Wynaut help Dwebble by removing or weakening its defensive checks. Knock Off support from Pokemon like Timburr and Mareanie is appreciated, since very few Pokemon will be able to take Dwebble's boosted moves without an Eviolite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 195129, "username": "Nineage"}, {"user_id": 150971, "username": "Coconut"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 315003, "username": "Kipkluif"}, {"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Tirtouga": {"sets": [{"name": "Defensive"}, {"name": "Shell Smash"}]},
  "Archen": {
    "overview": "<p>Archen is a classic glass cannon with its huge Attack stat and high-powered STAB moves. With a solid Speed tier and dangerous STAB combination that threatens common Pokemon like Mienfoo and Foongus, Archen can provide strong offensive pressure and capitalize on its ability to force switches. It also has a wide range of coverage moves to beat its checks and utility options like Stealth Rock, Defog, Knock Off, and U-turn to support its team. However, Archen is frail, has a crippling ability that forces it to always remain above 50% HP to deal consistent damage, and has a mediocre typing. Its Speed tier also makes Archen vulnerable to faster threats like Staryu and Abra as well as Choice Scarf users like Porygon and Mienfoo. All these traits make Archen difficult to use and fit on many teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>U-turn lets Archen pivot against checks like Mudbray and bring in a teammate. Archen can function as either a Stealth Rock setter or entry hazard remover, but it is threatened by the prevalent Staryu, which makes it unable to set Stealth Rock effectively, and forced out by common Stealth Rock setters like Mudbray and Pawniard. Knock Off provides helpful utility, allowing Archen to cripple its checks or assist in breaking down opposing Pokemon for its teammates. Substitute blocks status, helps activate Berry Juice, and provides a free opportunity for Archen to attack. Choice Scarf turns Archen into a revenge killer and late-game cleaner, but it limits Archen's opportunities to switch in.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Rock-, Steel-, and Ground-types: Pokemon such as Onix, Pawniard, and Mudbray can switch into Archen's STAB moves and KO it, but they must be wary of its coverage options.</p> <p><strong>Priority Users: Priority users such as Grookey, Timburr, and Pawniard can limit Archen's effectiveness by putting it into Defeatist range. Grookey in particular threatens to OHKO Archen with Grassy Glide.</p> <p><strong>Faster Offensive Threats: Naturally faster Pokemon such as Abra, Staryu, and Diglett, as well as Choice Scarf users like Mienfoo and Porygon, outspeed and threaten Archen.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Moves</h1> <p>Acrobatics synergizes with Berry Juice and threatens Grass- and Fighting-types like Foongus, Mienfoo, and Timburr. Dual Wingbeat is a more consistent option that breaks Focus Sash from Abra and does more damage before Berry Juice is consumed. Head Smash is Archen's most powerful STAB attack but inflicts recoil; this recoil damage can be useful for activating Berry Juice, but it may also put Archen into Defeatist range. Rock Blast breaks Focus Sash from Abra and Sturdy from Dwebble while also not having recoil. Earthquake deals solid damage to checks like Pawniard and Onix. Heat Wave allows Archen to beat Ferroseed while maintaining coverage for Pawniard and Magnemite. Aqua Tail can be used to lure and surprise Ground- and Rock-type switch-ins, OHKOing non-Sturdy Onix and punishing Mudbray. Roost synergizes with Eviolite and provides helpful recovery to avoid dropping into Defeatist range.</p> <h1>Set Details</h1> <p>Defeatist is Archen's only ability and forces it to remain above 50% HP in order to deal consistent damage. Berry Juice provides recovery and helps Archen stay out of Defeatist range while also synergizing with Acrobatics. Eviolite is an option on Dual Wingbeat sets for extra bulk. A Naive nature can be used over a Jolly nature to boost the power of Heat Wave.</p> <h1>Usage Tips</h1> <p>Archen is ideally brought onto the field safely by a slow pivot, double switch, or after a teammate has fainted to wreak havoc against metagame staples like Timburr and Foongus. It is difficult for teams to check Archen that has not been scouted, as using the correct coverage move can result in the loss of a check, so make sure to utilize the amount of switches it forces. Stealth Rock should be removed before Archen switches in to prevent being put into Defeatist range. Archen has to try to play around priority as well as faster threats that can inflict heavy damage like Staryu, Abra, and Choice Scarf Mienfoo, so it is important to try to scout as best as possible before bringing it in against these Pokemon.</p> <h1>Team Options</h1> <p>Entry hazard removal from Staryu and Defog Timburr is crucial to keeping Archen healthy. Entry hazard setters like Pawniard and Ferroseed put foes into KO range, with Pawniard also helping check threats like Abra and Galarian Ponyta and Ferroseed checking Staryu. Knock Off support from Mienfoo, Timburr, and Pawniard weaken bulky foes like Mudbray and Ferroseed; they also help absorb Knock Off. Pivots such as Mienfoo, Magnemite, and U-turn Grookey help bring Archen in safely. Trappers like Diglett and Trapinch can eliminate Stealth Rock setters and opposing Rock- and Ground-types. Koffing and Foongus are helpful teammates for Archen, as they are able to switch into strong Fighting-type attacks and function as a check to Grookey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 410251, "username": "zizalith"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 519108, "username": "zeroouttathere"}, {"user_id": 449990, "username": "DC"}]}
  },
  "Foongus": {
    "overview": "<p>Foongus's good defensive typing, bulk, and access to Regenerator make it one of the best defensive Pokemon in LC. Regenerator helps Foongus with longevity, allowing it to repeatedly switch into opposing threats. It can check common Fighting- and Water-types such as Mienfoo and Mareanie. It is one of the few Pokemon in LC with Spore, making it one of the best status users in the tier. However, its typing leaves it weak to common Fire- and Psychic-types like Ponyta and Abra. It also struggles to make progress in games against Ferroseed and has difficulty with Pawniard if another foe has been put to sleep.</p> ",
    "comments": "<h1>Other Options</h1> <p>It is worth noting that outside of the four moves listed above, Foongus's movepool is very limited. Therefore, alternative moves should only be used in specific matchups. Stun Spore can be used to paralyze multiple foes. Clear Smog can be used to prevent setup sweepers from setting up. Foongus can run more Speed EVs to outspeed opposing Foongus and Timburr, helping it in the one-on-one matchup.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-types such as Ferroseed and Pawniard resist both of Foongus's STAB attacks. While Pawniard does not appreciate Spore, Ferroseed is particularly problematic because it can switch into Foongus and safely set entry hazards, while Foongus can barely do anything to it.</p> <p><strong>Psychic-types: Psychic-types such as Abra and Galarian Ponyta are able to threaten Foongus offensively with their STAB attacks. Galarian Ponyta is particularly threatening, as the Eviolite set can switch into Foongus's attacks. Natu blocks Spore with Magic Bounce and has the bulk to consistently switch into Foongus.</p> <p><strong>Fire-types: Fire-types such as Vulpix and Ponyta threaten Foongus offensively with their powerful STAB attacks. However, neither of them wants to be put to sleep with Spore.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<h1>Moves</h1> <p>Spore temporarily disables a foe, potentially creating a 6v5 scenario. Giga Drain is a STAB attack that increases Foongus's longevity. Sludge Bomb is a more powerful STAB attack that allows Foongus to hit Grass-resistant foes that switch into it and potentially poison them. Synthesis gives Foongus recovery and increases its longevity.</p> <h1>Set Details</h1> <p>The given EV spread gives Foongus good mixed bulk. With Eviolite, It hits 25 HP and 21 in Defense and Special Defense. This allows it to avoid the 2HKO from Reckless non-Choice Band Mienfoo's High Jump Kick, take on Eviolite Staryu in a one-on-one situation, and even survive a Psychic from Focus Sash Abra at full HP. Regenerator allows it to switch in and out freely, recovering a significant amount of health each time it does so.</p> <h1>Usage Tips</h1> <p>Foongus can be brought in on common Fighting- and Water-types such as Mienfoo and Mareanie, as well as against Grass-types such as Grookey. Try to keep its health high with Regenerator and Synthesis so that it can continue to pivot in on offensive threats throughout the match. Be careful when using Spore, since certain foes may be switched in to absorb it once their role in the match has been fulfilled. Foongus's ability to shut down opposing threats decreases greatly when a foe has been put to sleep. Aggressive plays are recommended if the foe has a healthy Ferroseed, such as double switching into a Fighting- or Fire-type teammate.</p> <h1>Team Options</h1> <p>Onix and Foongus have good synergy because Foongus can check Grass-, Water-, and Fighting-types that threaten Onix, while Onix can check Flying- and Fire-types that threaten Foongus. Pawniard appreciates Foongus being able to check Fighting-types, while Pawniard helps by switching into Psychic-types that threaten Foongus. Mienfoo and Mareanie can form a Regenerator core with Foongus that can be difficult to deal with if their checks have been removed. Grounded teammates appreciate Foongus's ability to switch into and remove Toxic Spikes. Fire-types such as Ponyta and Vulpix can pressure Steel-types that can wall Foongus. Fighting-types such as Timburr and Mienfoo make good teammates, as they can switch into and threaten Ferroseed and Pawniard.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 381336, "username": "EnzoLapras"}]}
  },
  "Frillish": {
    "sets": [
      {
        "name": "Special Tank",
        "description": "<p>Frillish is a tank that can shrug off powerful special hits and take physical hits decently well. Frillish's typing makes it a deterrent for Porygon and Mienfoo, preventing them from spamming Tri Attack and Ice Beam or High Jump Kick. Its Fire resistance causes issues for sun teams as well. Scald's chance to inflict burn makes even physical attackers with good matchups such as Pawniard and Ferroseed hesitant to switch in. Even on other Pokemon, burns are helpful to empower Hex. Will-O-Wisp is a more consistent way to spread burns. Cursed Body, together with this mixed EV spread, lets it sometimes win one-on-one against lesser offensive threats like Foongus by disabling their super effective moves.</p> <p>Pokemon that appreciate Frillish's presence include Grookey and Steel-types such as Pawniard and Ferroseed since they are weak to Fire-types, which Frillish can switch into repeatedly. Fighting-types such as Mienfoo and Timburr appreciate Frillish's ability to deal with Psychic-types like Abra and Natu. They return the favor by dealing with Steel-types that cause Frillish trouble. Fire-types like Ponyta and Poison-types like Koffing and Foongus are the best ways to deal with Grookey and Ferroseed, which force Frillish out.</p> <h1>Other Options</h1> <p>Shadow Ball is an option for instant pressure over Hex. A Choice Scarf set with Water Spout is an option, but the presence of Grassy Glide Grookey and better Choice Scarf users such as Porygon make it inconsistent. Trick is an option on Choice Scarf sets to deal with defensive checks such as Ferroseed.</p> <h1>Checks and Counters</h1> <p><strong>Ferroseed: Ferroseed is an effective Frillish check, thanks to its Water resistance and general bulk. It also threatens Frillish with Knock Off and Giga Drain, taking turns spent on Recover to set entry hazards. However, it has to be careful of being burned by Scald or Will-O-Wisp, which strengthens Hex.</p> <p><strong>Grookey</strong>: Grookey is the best offensive check to Frillish. However, its frailty and fear of burns mean it cannot switch in easily.</p> <p><strong>Pawniard</strong>: Pawniard is one of the biggest threats to Frillish with Knock Off. Although it must be generally wary of Will-O-Wisp and Scald, it can still cause issues for Frillish when burned.</p> <p><strong>Super Effective Coverage</strong>: Frillish needs to be careful even against threats it is supposed to check. Ponyta and Psychic-types like Galarian Ponyta, Abra, and Natu can have Wild Charge or Shadow Ball. It should also be cautious of Knock Off from other Pokemon it checks, such as Mareanie. Pokemon like Koffing, Staryu, and Porygon also pose a threat with Thunderbolt.</p> <p><strong>Magnemite: Magnemite threatens Frillish with its super effective Electric-type attacks and can preserve momentum with Volt Switch.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 536936, "username": "Afdvsc"}]}
  },
  "Ferroseed": {
    "comments": "<h1>Other Options</h1> <p>Ferroseed can use an alternative EV spread that drops bulk to reach 9 Speed. 9 Speed beats paralyzed 17 Speed Pokemon, which is especially useful against Mienfoo. Revenge is an option to beat Salac Berry Magnet Pull Magnemite; it 2HKOes, overcoming Rest. Revenge Ferroseed also beats Pawniard, LC's only other Stealth Rock setter. Explosion Ferroseed can be used on teams that need a last resort option to KO threats like paralyzed Mienfoo and Natu. Bullet Seed helps Ferroseed beat Magnet Pull Magnemite, and it can do more damage to neutral targets like Natu after Roost, but it leaves Ferroseed without Giga Drain's recovery.</p> <h1>Checks and Counters</h1> <p><strong>Natu: Natu can switch into Ferroseed's status moves with Magic Bounce and threaten massive damage with Heat Wave. Ferroseed users must be careful of allowing Natu to impede progress; however, it doesn't appreciate Knock Off.</p> <p><strong>Fire- and Fighting-types</strong>: Mienfoo, a tier staple, can heavily damage Ferroseed with High Jump Kick, and Fire-type hits from Ponyta and Vulpix cleanly OHKO Ferroseed. These Pokemon do not appreciate being paralyzed by Thunder Wave or getting their items removed by Knock Off, however.</p> <p><strong>Coverage: Galarian Ponyta, Abra, and Koffing can run Mystical Fire, Fire Punch, or Fire Blast to heavily damage Ferroseed and prevent it from checking them over the course of a game. Mareanie's Knock Off compromises Ferroseed's walling ability.</p> ",
    "sets": [
      {
        "name": "Defensive Support",
        "description": "<p>Ferroseed is one of the LC metagame's best walls, being able to sponge neutral hits from strong threats like Staryu, Abra, and Porygon and then spread Thunder Wave. Ferroseed checks two of LC's three prominent Poison-types, Foongus and Mareanie, with resistance or immunity to their STAB attacks and Foongus's Spore. Ferroseed's Knock Off takes advantage of forcing out the Pokemon it checks, supporting teammates by removing Eviolite from common checks like Natu and Mienfoo. Ferroseed is one of the few viable Stealth Rock setters and can also be used to set Spikes.</p> <p>Ferroseed creates an effective defensive core with Poison-types like Koffing and Mareanie, checking the strong special attackers that threaten them while also benefitting from them checking strong Fighting-type attackers, like Mienfoo. Frillish and the aforementioned Mareanie also help Ferroseed by checking Fire-types like Ponyta and Vulpix. Frillish and Natu help deal with opposing Natu, which has Magic Bounce and Heat Wave to very effectively deal with Ferroseed. Ferroseed can struggle to check Fire Punch Abra and Trick Porygon, and Mareanie's Knock Off can also weaken it. Partners like Diglett and Porygon can help check or remove them. Magnet Pull Magnemite traps and sets up on Ferroseed; Ground-type teammates like Diglett, Trapinch, and Mudbray can deter these sweeps.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 416460, "username": "yellowfin"}]}
  },
  "Mienfoo": {
    "comments": "<h1>Other Options</h1> <p>Choice Band sets dole out absurd amounts of damage, as Reckless High Jump Kick 2HKOes Foongus and Mareanie without Eviolite. Acrobatics is an option to threaten Foongus and opposing Mienfoo after losing Eviolite. Swords Dance boosts Mienfoo's power to extreme heights, but Mienfoo lacks the Speed to sweep.</p> <h1>Checks and Counters</h1> <p><strong>Koffing: Koffing takes little damage from any of Mienfoo's attacks, threatens with Will-O-Wisp, and can wear it down over the course of the match, as Neutralizing Gas blocks Regenerator. Koffing can be whittled down by repeated hits and its lack of reliable healing, though.</p> <p><strong>Mareanie</strong>: Mareanie resists High Jump Kick and U-turn, can switch in repeatedly with Regenerator, and can make progress with Knock Off and Scald burns. It must be wary of U-turn bringing in Diglett or special attackers like Abra and Porygon.</p> <p><strong>Foongus: Foongus resists High Jump Kick, stays healthy with Regenerator, and punishes Mienfoo's team with Spore. However, Foongus can struggle mightily to make progress when Mienfoo is paired with Ferroseed or, to a lesser extent, Natu.</p> <p><strong>Flame Body: Flame Body users like Larvesta and Eviolite Ponyta can burn Mienfoo for using moves recklessly. However, both are threatened by U-turn bringing in Diglett.</p> <p><strong>Psychic-type Pokemon and Coverage: While Abra, Galarian Ponyta, and Choice Scarf Porygon cannot switch into Mienfoo, they outspeed and OHKO it. Natu fears Knock Off but can force uncomfortable turns with STAB Psychic. Staryu sometimes carries Psychic as well, and it can severely threaten Mienfoo that lack Eviolite.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<p>Mienfoo is an extremely versatile and durable Pokemon that can serve as a lead, defensive pivot, and offensive wallbreaker over the course of a game. U-turn lets Mienfoo take advantage of the switches it forces while maintaining offensive momentum and healing itself with Regenerator. Knock Off softens up switch-ins like Mareanie and Koffing and hits Natu and Frillish hard. Fake Out is valuable for wearing down Choice Scarf users and sweepers while also providing free chip damage against most foes. Taunt is an alternative that blocks Poison-type checks from recovering while also shutting down defensive sweepers like Shellos and status moves from Foongus and Koffing. While the given EV spread is reliable for its physical bulk and its guarantee of a Speed tie with opposing Mienfoo and Natu, Mienfoo's versatility allows a wide variety of investments. These include a spread with 236 Attack EVs instead of Defense for wallbreaking power and running no Speed investment to use U-turn after other Mienfoo.</p> <p>Mienfoo fits well on virtually every team, but it pairs especially well with Diglett, which benefits from U-turn to trap checks like Mareanie, and Koffing, which can wear down Regenerator users with Neutralizing Gas. Mienfoo is an invaluable partner for Pokemon that are forced out by Pawniard like Abra, Porygon, and Natu. Abra and Natu also punish Mienfoo's Poison-type checks like Foongus and Koffing after U-turn.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Mienfoo is a major threat that outspeeds most of the tier while dealing severe damage and offering sweeping potential. Reckless High Jump Kick will OHKO or 2HKO any neutral target. U-turn lets Mienfoo scout the opposing team and allows teammates to punish the Poison-types it forces in. Knock Off wears down those Poison-types to set up for a later sweep, and it also hits Galarian Ponyta, Natu, and Frillish hard. Close Combat should be used when the additional power of High Jump Kick is not needed and the stat drops are not a concern.</p> <p>Choice Scarf Mienfoo pairs well with Timburr, which can perform the duties of a bulky Fighting-type while both Pokemon overwhelm the opposing Poison-type. Diglett is a valuable partner for its ability to trap Poison-types. Beyond the usual checks, this set is vulnerable to Natu and Frillish, as they punish its STAB moves and thus make it extremely difficult for Mienfoo to operate offensively. Pawniard is a valuable partner, as it checks both. Knock Off Grookey and Shadow Ball Abra can also pressure them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 255030, "username": "San Tomas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 32350, "username": "KSG"}]}
  },
  "Pawniard": {
    "overview": "<p>Pawniard's powerful STAB Knock Off allows it to be a defining force in the LC metagame. Having access to a strong Knock Off is valued, as it removes items for its teammates and can help break through bulky threats. Its fantastic offensive typing allows it to check a multitude of Pokemon such as Abra, Galarian Ponyta, and Porygon. Sucker Punch allows Pawniard to threaten offensive teams and revenge kill faster threats. A downside to Pawniard is that it is heavily threatened and forced out by common threats such as Timburr, Mienfoo, Onix, and Mudbray and can also find itself getting trapped by Trapinch and Diglett.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Wave can be used to cripple any potential switch-ins to Pawniard. Choice Scarf Pawniard can catch opponents off guard and therefore outpace and OHKO Pokemon such as Abra, Galarian Ponyta, and Diglett.</p> <h1>Checks and Counters</h1> <p><strong>Timburr: Timburr is the biggest threat to Pawniard, as it is able to switch into Pawniard fairly easily and OHKO it. Timburr is also able to use Defog on Pawniard very easily despite Defiant.</p> <p><strong>Other Fighting-types</strong>: Other Fighting-types such as Mienfoo and Croagunk all resist Pawniard's Dark-type attacks and can OHKO it in return.</p> <p><strong>Ground-types: Ground-types such as Diglett, Trapinch, Onix, and Mudbray are all able to OHKO Pawniard with Ground-type moves. Trapinch and Diglett specifically are able to trap and KO Pawniard with Earthquake after a free switch. Mudbray can constantly switch into Pawniard's moves due to its high bulk backed by its ability in Stamina and threaten it out with Earthquake.</p> <p><strong>Status: Status problems, especially burns from Ponyta's, Koffing's, and Frillish's Will-O-Wisp, can cripple Pawniard and should be avoided at all costs. Pawniard should also be wary of switching into potential Scald burns from Mareanie, defensive Staryu, and Wingull.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<h1>Moves</h1> <p>Knock Off is Pawniard's strongest and most useful STAB move and provides it utility in item removal, which is invaluable team support. Iron Head allows Pawniard to threaten foes like Foongus by making them flinch. Sucker Punch allows Pawniard to pick off weakened threats and revenge kill faster foes such as Galarian Ponyta and Choice Scarf Porygon. Sucker Punch can also force a mind game when Diglett traps Pawniard. Pawniard is also a great Stealth Rock user, as it matches up well against Natu.</p> <h1>Set Description</h1> <p>Maximum Speed investment alongside a Jolly nature allows Pawniard to reach a benchmark of 16 Speed. Defiant is Pawniard's most useful ability. Berry Juice provides Pawniard with recovery and lets it better check foes like Porygon.</p> <h1>Usage Tips</h1> <p>Pawniard should be utilizing Knock Off often throughout the match, punishing switch-ins such as Timburr, Mudbray, Mareanie, and Ferroseed by removing their Eviolite. Pawniard also should be used early- to mid-game to set up Stealth Rock and can do so on a multitude of occasions when switching in on Pokemon such as Foongus and Ferroseed. Sucker Punch should be used to revenge kill faster and weakened threats. Pawniard's HP should also be preserved if the opponent possesses late-game setup sweepers such as Shellder and Calm Mind Natu.</p> <h1>Team Options</h1> <p>Fighting-type checks such as Koffing, Mareanie, and Foongus are fantastic partners for Pawniard. Pokemon such as Grookey are able to punish Diglett and Trapinch for revenge killing Pawniard. Trappers such as Trapinch and Diglett can successfully remove Pokemon such as Onix, Mareanie, and Ponyta. Water-types such as Staryu and Frillish can also threaten Ground-types. Mienfoo and Timburr appreciate Pawniard switching into Psychic-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 420389, "username": "Stoward"}, {"user_id": 150971, "username": "Coconut"}, {"user_id": 32350, "username": "Ksg"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 437289, "username": "Splash"}]}
  },
  "Larvesta": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Larvesta shines as a pivot in the current metagame due to serving as a check to both Grookey and Fighting-types, which is made easier by its ability to spread burns with Flame Body and Will-O-Wisp. Flare Blitz is a hard-hitting STAB move, while U-turn lets Larvesta pivot against counters such as Staryu and Mareanie and bring in teammates to force progress. Morning Sun provides Larvesta much needed recovery, since it is getting worn down from Flare Blitz recoil and taking hits. Larvesta's physical bulk is maximized by this EV spread, and it hits 16 Speed, letting it outspeed foes such as Koffing and non-Choice Scarf Mudbray. However, Larvesta's 4x weakness to Stealth Rock limits its ability as a defensive pivot, so it appreciates being paired with entry hazard control such as Staryu and Natu. A Grass-type such as Ferroseed, Foongus, or Grookey help check opposing Water-types. Larvesta also forms a VoltTurn core with Mienfoo and benefits from it wearing down shared checks such as Mareanie and Frillish with Knock Off. Psychic-types appreciate Larvesta taking on Steel-types and safely bringing them onto the field with U-turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 438243, "username": "PyProd"}]}
  },
  "Bunnelby": {"sets": [{"name": "Wallbreaker"}]},
  "Spritzee": {
    "overview": "<p>Spritzee has decent boosting moves in Nasty Plot and Calm Mind, which lets it explore offensive options. It also has solid bulk and typing, which makes it a good defensive option on many teams, as it's able to check many common Pokemon such as Vullaby, Mienfoo, and Timburr and absorb Knock Off. In fact, Spritzee is one of the best checks to Mienfoo because Diglett cannot reliably trap and KO it. Spritzee has fantastic utility moves such as Wish, which not only gives it longevity but also allows it to heal its teammates. Spritzee's shortcomings are its low Speed, passivity, and weakness to common Poison-types such as Mareanie and Foongus and Steel-types such as Pawniard and Ferroseed.</p> ",
    "comments": "<h1>Other Options</h1> <p>Spritzee can use Encore to stop setup attackers such as Nasty Plot Vullaby. On the defensive set, Calm Mind synergizes with Wish, allows Spritzee to become even bulkier, and lets it function as a wincon late-game. That being said, Spritzee wouldn't be able to weaken opposing walls with Covet or hit Poison-types with Psychic. Finally, Spritzee can also run a speedy Nasty Plot set maximizing Speed and running Draining Kiss for longevity; this set would work especially well with a Sticky Web user.</p> <h1>Checks and Counters</h1> <p><strong>Ferroseed: Ferroseed hard walls Spritzee and can use those free turns to status foes with Thunder Wave, set entry hazards such as Stealth Rock and Spikes, and use Knock Off to remove foes' items.</p> <p><strong>Pawniard</strong>: Pawniard threatens Spritzee with Iron Head. Spritzee's Moonblast may also trigger Pawniard's Defiant if its Special Attack drop activates. Spritzee will typically switch out against Pawniard, which lets it freely use Knock Off.</p> <p><strong>Poison-types</strong>: Spritzee is threatened by Poison-types such as Foongus, Mareanie, and Koffing. They take little damage from Moonblast but should be wary of switching into Psychic.</p> <p><strong>Fire-types: Fire-types such as Ponyta and Vulpix resist Spritzee's Moonblast and are able to overpower it.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<h1>Moves</h1> <p>Trick Room and Nasty Plot work together to allow Spritzee to become a powerful sweeper, as Trick Room reverses Spritzee's poor Speed and lets it be a countermeasure to Sticky Web. Moonblast does a good amount of damage to neutral foes, even when unboosted. Psychic is Spritzee's coverage move for Poison-types such as Mareanie, Foongus, and Koffing that check it, and it also neutrally hits Ponyta.</p> <h1>Set Details</h1> <p>The HP, Defense, and Special Defense EV investment is to ensure that Spritzee is bulky enough to take an attack or two so it can use Nasty Plot. Offensively, the maximum Special Attack investment and Modest nature make Spritzee hit as hard as possible. Berry Juice is used to heal Spritzee up if it gets hit a couple times, though Eviolite can be used so it can take more hits. Aroma Veil is the ability of choice to ensure Taunt and Encore users don't prevent Spritzee from setting up.</p> <h1>Usage Tips</h1> <p>Spritzee's goal is to set up Nasty Plot and have Trick Room active so it can sweep, so switch Spritzee in on a Pokemon that can't do much damage to it like Timburr or Mienfoo. Avoid Knock Off, as Spritzee's item is very important to its ability to set up. Also, be careful of setting up Trick Room if the foe is slower than Spritzee. In that case, simply setting up with Nasty Plot and attacking is better. If you have two or more free turns, make sure to set up Nasty Plot first, as you want Trick Room to last as long as possible. Late-game, if the opposing Pokemon are weakened, Spritzee can sweep just by setting up Trick Room without Nasty Plot. Finally, you can try bluffing a defensive set by constantly switching in and out to soak up resisted attacks from the likes of Timburr and Mienfoo, and, when late-game comes, you can start setting up and surprise your opponent.</p> <h1>Team Options</h1> <p>Spritzee appreciates entry hazard setters such as Ferroseed and Pawniard so it can sweep more effectively. Furthermore, it appreciates Knock Off support from the likes of Mienfoo and Vullaby, which is necessary so that it can reliably KO Pokemon such as Foongus and Mareanie. Unfortunately, Spritzee cannot do much damage to Ferroseed, so teammates like Ponyta, Mienfoo, and Timburr are appreciated. Diglett is also a great option, as it can wear Ferroseed down or use Final Gambit against it. And, although Mudbray isn't the best Spritzee check, Spritzee still appreciates teammates such as Staryu and Wingull to deal with it.</p> "
      },
      {
        "name": "Defensive",
        "description": "<h1>Moves</h1> <p>Moonblast threatens Dark- and Fighting-types such as Vullaby, Mienfoo, and Timburr. Wish, one of the moves that gives defensive Spritzee its niche, provides Spritzee and its teammates recovery. Protect complements Wish, ensuring that Spritzee gets healed. Furthermore, Protect lets Spritzee scout for moves on Choice-locked Pokemon such as Choice Scarf Mienfoo. Covet is a good utility move in the Knock Off-heavy LC tier. It allows Spritzee to steal the foe's item, typically Berry Juice or Eviolite, and can be useful to maintain its bulk after taking Knock Off while weakening a foe. Spritzee can use it against the likes of Ferroseed, Mareanie, and Foongus. Psychic can be used instead of Covet to deal good damage to Poison-types such as Foonguss, Mareanie, and Koffing.</p> <h1>Set Details</h1> <p>The Eviolite, Bold nature, HP EVs, and Defense EVs allow Spritzee to switch into as many physical attackers, such as Onix, Mienfoo, Timburr, and Vullaby, as it can. The HP EVs also maximize Wish recovery for both itself and its teammates. The leftover EVs are used to increase Spritzee's other stats. Aroma Veil is the preferred ability so Spritzee can ignore Encore and Taunt, letting it employ its many utility moves.</p> <h1>Usage Tips</h1> <p>Spritzee is very bulky, so it can switch into common physical attackers in the tier and isn't afraid to take a Knock Off, especially as it can regain an item by using Covet. Since Spritzee is a cleric, make sure it survives for as long as possible to ensure your entire team, especially walls like Ferroseed, stays healthy through Wish passing. To not lose momentum and get good matchups against Poison- and Steel-types that check Spritzee, switch in Spritzee strategically and then double switch to a teammate. Be careful of letting foes take advantage of Spritzee's lackluster offensive capabilities to set up or set entry hazards on it.</p> <h1>Team Options</h1> <p>Ferroseed appreciates Spritzee because it checks common threats such as Timburr, Vullaby, and Mienfoo, and Ferroseed checks Mareanie and Foongus for it. Ferroseed also appreciates Wish as a way to counteract opposing teams chipping it down. On the flip side, Spritzee appreciates teammates such as Timburr, Mienfoo, and Ponyta, which can KO its checks such as Pawniard and Ferroseed. Galarian Ponyta, Abra, and Diglett can KO Spritzee's counters. Also, since Spritzee is constantly switching in and out to ensure the best matchups, entry hazards can wear it down; therefore, Defog users such as Vullaby and Timburr and Rapid Spin users such as Staryu are appreciated. Finally, Spritzee appreciates entry hazard setters such as Ferroseed, Onix, and Pawniard, as it can often force Pokemon such as Timburr to switch out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "DC"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 205691, "username": "ForgottenOnes"}]}
  },
  "Skrelp": {"sets": [{"name": "Special Attacker"}]},
  "Tyrunt": {
    "overview": "<p>Tyrunt finds a distinct niche in LC as a fearsome Dragon Dance sweeper. Close Combat and Strong Jaw-boosted Psychic Fangs allow it to neutrally damage a majority of the tier and punish checks such as Ferroseed, Pawniard, and Mienfoo. However, Tyrunt's typing and mediocre Speed stat leave it vulnerable to common threats like Grookey, Mienfoo, and Pawniard, especially if it has not gotten the opportunity to set up. Furthermore, Tyrunt often takes significant damage when setting up, which makes it difficult to sweep without extensive support from Sticky Web or dual screens.</p> ",
    "comments": "<h1>Other Options</h1> <p>Iron Head allows Tyrunt to damage Spritzee super effectively, but it is generally outclassed by both Close Combat and Psychic Fangs against other targets. Fire Fang is an option against Steel-types that does not drop Tyrunt's defenses and does significantly more to Ferroseed; however, it requires more support from Trapinch and Air Balloon Diglett and is usually outclassed by Close Combat against other targets. Sturdy + Berry Juice can be utilized to surprise the opponent and give Tyrunt a source of recovery; however, the loss of Eviolite makes Tyrunt even more susceptible to priority moves, and the loss of damage output without Strong Jaw is noticeable.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Pawniard and Magnemite can OHKO Tyrunt, while Ferroseed can cripple it with both Thunder Wave and Knock Off. Furthermore, Pawniard can weaken or revenge kill a boosted Tyrunt with Sucker Punch. However, all three Steel-types should fear Close Combat.</p> <p><strong>Grookey and Timburr: Grookey can KO Tyrunt with Wood Hammer into Grassy Glide and even revenge kill a boosted Tyrunt with Grassy Glide. Likewise, Timburr can revenge kill Tyrunt with Mach Punch.</p> <p><strong>Spritzee</strong>: Spritzee tanks all of Tyrunt's moves, even after Dragon Dance, and retaliates with a strong Moonblast.</p> <p><strong>Ground-types</strong>: Due to their natural bulk, Onix, Trapinch, and Mudbray can soft check Tyrunt. Onix is capable of surviving +1 Close Combat from Tyrunt if healthy, while Trapinch and Mudbray are able to live any one hit from Tyrunt and fire back with a super strong Earthquake.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<h1>Moves</h1> <p>Dragon Dance lets Tyrunt outspeed the entire unboosted metagame after a boost. Rock Blast is the preferred STAB move, enabling Tyrunt to break Focus Sash from foes like Dewpider and Abra. Close Combat hits Steel-types like Ferroseed, Pawniard, and Magnemite while also allowing Tyrunt to OHKO Scraggy. Psychic Fangs OHKOes bulky Mienfoo after a Dragon Dance boost and nails foes like Foongus and Mareanie. Furthermore, Psychic Fangs is Tyrunt's best neutral attack against targets like Mudbray due to Close Combat dropping its defenses, making it more susceptible to priority from foes such as Grookey and Timburr.</p> <h1>Set Details</h1> <p>Strong Jaw boosts Psychic Fangs's power, allowing it to decimate Mienfoo and Poison-types like Foongus and Mareanie. Maximum Attack and Speed investment with a Jolly nature enables Tyrunt to outspeed the entire unboosted metagame after a Dragon Dance boost, with the remaining EVs invested in Special Defense to achieve optimal Eviolite numbers. Eviolite helps Tyrunt consistently set up.</p> <h1>Usage Tips</h1> <p>Tyrunt is best utilized mid- and late-game after its checks have been weakened so it can safely enter the battle and set up with Dragon Dance. Its natural bulk also helps it take advantage of weak offensive threats such as Foongus that has already used Spore and Vulpix to boost up, and it can help Tyrunt soft check an opposing threat, aiding its teammates. Usually, dual screens or Sticky Web should be established before Tyrunt switches in, as they greatly ease setup directly or by letting it force out more foes. Be wary of priority from foes like Grookey, Pawniard, and Timburr, as they can revenge kill Tyrunt even after setting up.</p> <h1>Team Options</h1> <p>Screens support from Natu or Amaura or Sticky Web from Dewpider is pivotal to Tyrunt's success. Natu also provides additional utility, with Thunder Wave slowing down foes and Teleport safely bringing Tyrunt into play. Besides helping setup, Sticky Web lets Tyrunt outspeed faster threats like Pawniard, fast Mienfoo, and Abra before a boost and hit them with its powerful attacks. Knock Off support from partners such as Mareanie and Pawniard can weaken foes like Ferroseed and Onix into the range of Tyrunt's coverage moves. Psychic-types like Abra and Galarian Ponyta appreciate Tyrunt's ability to threaten Natu; in return, they can take advantage of Fighting-types like Mienfoo and Timburr, which trouble Tyrunt. Grookey can pivot into Tyrunt as well as set Grassy Terrain, which helps Tyrunt better survive against opposing Ground-types. Fellow late-game setup sweepers and cleaners like Scraggy and Belly Drum Magby synergize well with Tyrunt's wallbreaking capabilities. Staryu can weaken a shared check in Ferroseed, enabling Tyrunt to KO it later with Close Combat.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410251, "username": "zizalith"}, {"user_id": 208173, "username": "Fiend"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Amaura": {"sets": [{"name": "Choice Scarf"}, {"name": "Screens Setter"}]},
  "Mareanie": {
    "overview": "<p>Mareanie has great bulk, decent movepool and typing, and a great ability in Regenerator, which make it a great wall that can switch into attacks from Mienfoo, Timburr, and Vulpix. Mareanie can also inflict status and wear down the opposing team with Scald burns and Sludge Bomb poisons. However, it has many weaknesses and is vulnerable to common Pokemon such as Abra, Mudbray, and Thunderbolt Staryu. Mareanie's Grass neutrality also causes it to fit awkwardly on many teams, as it cannot switch into Grookey's attacks, unlike fellow Poison-types like Foongus and Koffing. Mareanie is also vulnerable to getting trapped by Diglett and Trapinch, which is detrimental when trying to handle foes like Vulpix and Charmander.</p> ",
    "comments": "<h1>Other Options</h1> <p>Gunk Shot is an option to better threaten foes like Foongus and Staryu. Iron Defense allows Mareanie to function as a wincon and set up on physical attackers such as Mienfoo, Timburr, and Pawniard. However, this requires team support, as Mareanie cannot beat strong special attackers like Abra and Porygon. Toxic Spikes is an option on offensive teams to wear down foes, but it is rather lackluster due to the prevalence of Poison-types. A faster EV spread of 36 HP / 12 Atk / 100 Def / 12 SpA / 100 SpD / 236 Spe with a Timid nature allows Mareanie to outspeed key threats like Koffing, but it reduces Mareanie's physical bulk drastically. Covet is an option to take Eviolite from Foongus, Mienfoo, and Ferroseed after Mareanie has been hit by Knock Off, although it is less reliable than Knock Off.</p> <h1>Checks and Counters</h1> <p><strong>Strong Special Attackers: Powerful special attackers like Abra, Galarian Ponyta, and Magnemite outpace Mareanie and threaten it with their STAB attacks. Other special attackers such as Porygon, Koffing, and Staryu carry coverage for Mareanie.</p> <p><strong>Arena Trap Users: Diglett can OHKO Mareanie with Earthquake after it loses its Eviolite. Trapinch can also trap and OHKO Mareanie with Earthquake, but it is unreliable due to being slower and risking a Scald burn. It should be noted that neither of these trappers can switch into Scald, but they are able to come in on Mareanie thanks to Mienfoo's U-turn.</p> <p><strong>Grass-types: Bulky Grass-types like Foongus and Ferroseed can tank any of Mareanie's attacks, force it out, and use Spore or set up entry hazards; however, both of these Grass-types hate Knock Off. Grookey can pressure Mareanie with Grassy Terrain-boosted attacks but cannot switch in directly due to Sludge Bomb and Scald burns.</p> ",
    "sets": [
      {
        "name": "Wall",
        "description": "<h1>Moves</h1> <p>Scald threatens common Pokemon like Ponyta and Archen and potentially burns physical attackers like Mienfoo, Timburr, and Pawniard. Sludge Bomb OHKOes Grookey, threatens Spritzee, and is also useful to weaken bulkier Pokemon that try to switch into Mareanie's attacks, like Frillish and Natu. Knock Off removes items from switch-ins like Ferroseed, Frillish, and Staryu.</p> <h1>Set Details</h1> <p>The given EV spread along with a Bold nature and Eviolite lets Mareanie come in on physical attacks from Pawniard, Mienfoo, and Timburr and survive super effective hits from Staryu and Porygon. Regenerator lets Mareanie gain recovery on switches, which makes it less reliant on Recover and allows it to switch into threats repeatedly.</p> <h1>Usage Tips</h1> <p>Mareanie should come in against physical attacks from Mienfoo, Timburr, and Pawniard, as it can tank the attack and fish for a burn with Scald. It can also use Knock Off on bulky Pokemon like Frillish, Ferroseed, and Foongus to soften them up for its teammates. Be careful about switching into U-turn from Mienfoo, which allows trappers such as Diglett and Trapinch to trap and OHKO Mareanie, and super effective coverage from foes like Ponyta and Koffing.</p> <h1>Team Options</h1> <p>Ferroseed and Pawniard can switch into threatening special attackers like Abra, Porygon, and Staryu and set entry hazards, which help chip down foes in conjunction with Mareanie's ability to inflict status. Mienfoo and Timburr handle troublesome Pokemon like Magnemite and Onix and provide additional Knock Off support. Grookey is able to take care of problematic foes like Thunderbolt Staryu, revenge kill threats like Abra and Galarian Ponyta, and provide Grassy Terrain to weaken trappers like Diglett. Trappers like Diglett and Trapinch can remove Abra, opposing Diglett, and Magnemite. Trapinch is also useful for trapping Grookey and OHKOing it with First Impression.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 195129, "username": "Nineage"}, {"user_id": 107567, "username": "gali"}, {"user_id": 32350, "username": "KSG"}, {"user_id": 449990, "username": "DC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}, {"user_id": 449990, "username": "DC"}]}
  },
  "Mudbray": {
    "comments": "<h1>Other Options</h1> <p>Counter, which should be used alongside Berry Juice, trades a coverage move for a surprise KO on physical attackers like Mienfoo. Facade is an option, usually on Choice Scarf Mudbray, to maintain offensive pressure after Mudbray has been burned by an attack like Koffing's Will-O-Wisp.</p> <h1>Checks and Counters</h1> <p><strong>Grookey: With its ability to set up Grassy Terrain, which reduces the power of Earthquake, and deal massive damage with Grassy Glide, Grookey is easily one of the biggest checks to Mudbray. However, Grookey cannot switch in multiple times, as it take a lot of damage from Heavy Slam and Close Combat.</p> <p><strong>Natu</strong>: While it takes considerable damage from Heavy Slam, Natu can outlast Mudbray with Roost and prevent it from setting Stealth Rock and using Earthquake.</p> <p><strong>Water-types</strong>: Bulky Water-types such as Staryu, Frillish, and Slowpoke can switch into Mudbray and punish it with Scald, although they take a lot of damage from Earthquake if they lose their Eviolite. Offensive Water-types such as Carvanha and Life Orb Staryu can bypass Mudbray's ability to tank hits and OHKO it.</p> <p><strong>Air Balloon Diglett: Air Balloon Diglett can exploit Choice Scarf Mudbray if it is locked into a Ground-type attack by trapping and subsequently KOing it.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Mudbray's natural bulk allows it to safely set Stealth Rock against many different Pokemon. Close Combat threatens Ferroseed, while Heavy Slam covers Natu and Grookey. Alternatively, Rock Slide can hit Natu harder, but it is weaker against Grookey. High Horsepower can be used instead of Earthquake to do more damage in Grassy Terrain, but it is less accurate than Earthquake and can be unreliable at times. Eviolite is usually preferred to maximize Mudbray's bulk, but Berry Juice can provide it with much-needed recovery.</p> <p>Stealth Rock Mudbray is amazing on certain offensive teams, as it allows Steel-types like Pawniard and Ferroseed to forgo Stealth Rock for other utility options. Furthermore, its ability to switch into Koffing is appreciated by certain defensive cores such as Mareanie + Ferroseed. Mudbray greatly struggles against Grookey and should be paired with partners such as Koffing, Natu, and Foongus that handle it. It also has difficulty beating Natu one-on-one consistently, so checks such as Frillish and your own Natu are good options.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Mudbray is one of LC's best Choice Scarf users, as it outspeeds another popular Choice Scarf user in Porygon. This allows Mudbray to threaten KOs on fast, offensive threats like Abra, Ponyta, and Diglett. Mudbray's coverage moves seek to pave the way for its late-game sweep with Earthquake. Close Combat greatly damages Ferroseed and prevents Mudbray from being taken advantage of by Air Balloon Diglett. Heavy Slam provides great neutral coverage against foes like Natu and Grookey, while Rock Slide can be used to deal slightly more damage to Natu and for a useful flinch chance.</p> <p>Choice Scarf Mudbray fits well with other threats like Porygon to overwhelm shared checks like Ferroseed or to take advantage of Mudbray's checks like Grookey and Natu. Mudbray is relatively frail and appreciates pivot support from Mienfoo and Natu, as they can provide it a free switch into Pokemon like Koffing and Pawniard. It is imperative that Mudbray be played carefully around Air Balloon Diglett, as recklessly using Earthquake or High Horsepower to KO a foe like Mareanie can leave Mudbray trapped.</p> "
      },
      {"name": "RestTalk", "description": "<p>A RestTalk set greatly improves Mudbray's longevity, allowing it to beat several Pokemon, such as Mienfoo and Natu, one-on-one. It can even survive hits from threatening special attackers such as Abra thanks to its Special Defense investment and retaliate with a powerful hit. Heavy Slam is the best coverage to hit Flying-types and Ground-immune foes like Air Balloon Diglett.</p> <p>RestTalk Mudbray usually finds itself on more offensive teams like Fighting spam as a way to keep offensive momentum and provide a much-needed defensive backbone. Grookey is still a terror for Mudbray, so pairing it with Koffing, Foongus, and Natu is recommended. RestTalk Mudbray also struggles against Water-types such as Frillish and Staryu because they can take advantage of it using Rest or force it out. As such, partners like Pawniard and Ferroseed are recommended; they also help it by checking threats like Abra and Porygon.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 32350, "username": "KSG"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 481831, "username": "wesh papillon"}]}
  },
  "Grookey": {
    "overview": "<p>Grookey cements itself as a powerful offensive presence in LC, capable of tearing through opposing teams with Grassy Terrain-boosted Wood Hammer and Grassy Glide and pressuring common foes like Staryu, Diglett, and Onix. Furthermore, Grookey's access to Swords Dance, along with coverage moves like Drain Punch and Acrobatics, makes it difficult to properly check, as even checks like Foongus and Pawniard can fall to its sheer power. Grookey can also function as a blanket check to many setup sweepers, as they fear being revenge killed by Grassy Glide. Grassy Terrain also provides great utility for Grookey's teammates, enabling setup sweepers and making Grookey a Pokemon that can fit on many teams. However, Grookey is unable to fit all of its coverage moves, meaning that it can be checked by common walls such as Foongus and Koffing when properly scouted.</p> ",
    "comments": "<h1>Other Options</h1> <p>Grookey can run Berry Juice or Eviolite over Life Orb, trading damage for recovery or bulk to help it function as an offensive pivot. Acrobatics, in combination with consumable items like Berry Juice and Grassy Seed or with no item at all, can be utilized to lure in and heavily damage Foongus. Mega Kick is an option to hit all both Koffing and Foongus in one moveslot, but its inaccuracy makes it unreliable. Taunt prevents foes such as Foongus and Ferroseed from crippling Grookey's teammates with status.</p> <h1>Checks and Counters</h1> <p><strong>Foongus: Foongus resists Grookey's STAB moves and Drain Punch and can repeatedly switch into Grookey thanks to Regenerator. It can also force out Grookey with Sludge Bomb and use that opportunity to potentially cripple one of Grookey's teammates with Spore. However, Foongus should be wary of being hit by Knock Off and U-turn.</p> <p><strong>Koffing</strong>: Thanks to its typing, Koffing takes minimal damage from Grookey's STAB moves and Drain Punch. It can KO Grookey with a strong Sludge Bomb or burn it with Will-O-Wisp. However, Koffing lacks recovery and can be worn down after repeatedly switching in.</p> <p><strong>Steel-types</strong>: Steel-types such as Pawniard, Magnemite, and Ferroseed resist both Wood Hammer and Grassy Glide. Pawniard and Magnemite can retaliate with a strong attack, while Ferroseed can cripple Grookey with Thunder Wave and limit its effectiveness. However, all three Steel-types should be wary of Drain Punch.</p> <p><strong>Trapinch: Trapinch's First Impression outprioritzes Grassy Glide and OHKOes Grookey. However, Protect renders Trapinch useless.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<h1>Moves</h1> <p>Grassy Glide turns into a priority move under Grassy Terrain and lets Grookey revenge kill weakened foes and faster threats such as Wingull, Abra, and Staryu. Knock Off weakens checks such as Koffing, Foongus, and Ferroseed. Drain Punch provides Grookey with coverage against Steel-types like Ferroseed, Pawniard, and Magnemite. Protect is an option to block priority like Fake Out from Mienfoo and First Impression from Trapinch, invalidating the latter as a check. U-turn can be used to pivot away from checks such as Foongus and Koffing. Wood Hammer is Grookey's strongest move and allows it to break through bulky foes such as Mienfoo and Pawniard. Fake Out is a notable mention that improves Grookey's revenge killing capabilities and lets it weaken and beat problematic foes such as Vulpix.</p> <h1>Set Details</h1> <p>Grassy Surge sets up Grassy Terrain, which empowers Wood Hammer and Grassy Glide, turns Grassy Glide into a priority move, and provides residual healing for Grookey and its teammates. Maximum Attack and Speed investment with a Jolly nature allows Grookey to reach 17 Speed, outspeeding Pawniard while Speed tying with fast Mienfoo. If running Fake Out, Grookey should opt for an Adamant nature. Life Orb provides an additional damage boost, allowing Grookey to garner crucial KOs on common threats like Abra.</p> <h1>Usage Tips</h1> <p>Grookey is best utilized as a revenge killer and sweeper, taking advantage of a teammate safely pivoting into it or entering on a double switch to pressure foes with a strong Grassy Glide. It is capable of forcing foes like Staryu and Mareanie out to potentially sweep past the opposing team. Often, it is pivotal to preserve Grookey for as long as possible, since Grassy Glide is able to revenge kill boosted setup sweepers like Porygon and Tyrunt and clean late-game. Grassy Terrain from Grookey can also be utilized as a support tool to heal teammates. Be wary of Trapinch, as Grookey without Protect can be trapped and OHKOed by First Impression.</p> <h1>Team Options</h1> <p>Knock Off users like Mienfoo, Ferroseed, and Pawniard can weaken problematic foes like Koffing and Foongus, as well as Ferroseed and opposing Mienfoo and Pawniard. Psychic-types such as Abra and Galarian Ponyta help threaten checks like Koffing and Foongus. On a set with U-turn, Koffing is good to pressure common foes that switch into U-turn like Foongus and Ferroseed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 410251, "username": "zizalith"}, {"user_id": 255030, "username": "San Tomas"}, {"user_id": 208173, "username": "Fiend"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Scorbunny": {
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>This set seeks to take advantage of Scorbunny's ability to single-handedly take down one of LC's most prominent defensive cores in Ferroseed + Spritzee while also maintaining the ability to pivot out of common switch-ins, such as Mareanie, and give Scorbunny's teammates more opportunities for advantageous matchups. Bring Scorbunny in on Grass- and Steel-types and use the pressure of its super effective STAB moves due to Libero to use U-Turn to pivot out of the opponent's switch-in to control momentum and keep exerting pressure on the opponent. High Jump Kick gives Scorbunny the ability to hit incoming Rock-types, though it does not possess the raw power to OHKO them in most cases. As a result, it's generally better to hold off on using High Jump Kick until the foe takes enough chip damage via U-turn and hazard damage. Sucker Punch is also an option if your team already has sufficient Rock-type answers elsewhere to provide Scorbunny with a way of getting off some damage against faster Pokemon such as Diglett and Galarian Ponyta. Berry Juice is the preferred item for Scorbunny, as it provides greater longevity by allowing Scorbunny to combat being worn down by hazards as it pivots in and out of the fight.</p> <p>Pokemon who appreciate Scorbunny's ability to deal with Ferroseed and Spritzee, such as Shellder or Onix synergize quite well with Scorbunny. Additionally, Pokemon that can capitalize off of the free switch in opportunities that Scorbunny provides, such as Corphish or Mudbray, are quite appealing teammates. Trappers like Diglett and Trapinch are often able to easily remove common answers to Scorbunny, such as Mareanie. Other pivots like Vullaby and Chinchou are also great options to form a nice VoltTurn core. Chinchou, in particular, can pile the pressure on Frillish and other Water-type Scorbunny switch-ins that aren't opposing Chinchou. Ferroseed and other hazard setters are great teammates, as the chip damage provided via their hazards can be crucial in wearing down and ultimately busting through opposing teams. Lastly, hazard removal from the likes of Vullaby or Staryu, for example, will allow Scorbunny to not be worn down as easily and remain a threat, thus being able to apply pressure throughout a match.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 410251, "username": "zizalith"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 242047, "username": "Joltage"}]}
  },
  "Sobble": {
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>This set takes advantage of Sobble's access to both Reflect and Light Screen combined with its decent Speed stat to support its team. Light Clay is the preferred item due to extending the duration of dual screens, though Eviolite can be used as well to make setting them a little easier. U-turn allows Sobble to bring in a teammate, ideally a sweeper after setting dual screens, while Surf works as a decently strong STAB move in a pinch. The EVs are used to boost Sobble's Speed and bulk to give it an easier time to set dual screens. Keep in mind that Sobble isn't particularly bulky, so avoid switching it into powerful attacks, and that relying on dual screens tactics is somewhat unreliable and matchup-dependent, which makes Sobble a mediocre pick.</p> <p>Setup sweepers that can take advantage of dual screens support such as Scraggy, Corphish, and Nasty Plot Vullaby are ideal teammates for Sobble. Sobble struggles against Grass- and Electric-type Pokemon such as Oddish and Chinchou, which makes Ferroseed a useful teammate, as it can handle such threats. Using Natu over Sobble as a dual screens setter should be considered as it has a useful ability in Magic Bounce. Also, note that Memento users like Diglett and Cottonee can be more consistent in supporting setup sweepers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 410251, "username": "zizalith"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 456766, "username": "Muksu"}]}
  },
  "Arrokuda": {
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>Arrokuda is primarily a revenge killer, using its vast movepool and coverage options to check a variety of threats. Close Combat is able to 2HKO Ferroseed and Cufant as well as OHKO Pawniard. Aqua Jet lets Arrokuda deal with more offensive teams by picking off their faster weakened Pokemon. Psychic Fangs destroys Croagunk and 2HKOes Mareanie, while Drill Run can also be run to deal super effective damage to Chinchou at the cost of only 2HKOing Croagunk. Lastly, Poison Jab is also an option to check and OHKO Cottonee and Morelull. This simple EV spread paired with a Jolly nature maximizes Arrokuda's Speed and offensive potential, while the 17 HP IVs ensure that Arrokuda only takes 1 HP of Life Orb recoil every attack by being at maximum 19 HP. However, if Berry Juice is opted for instead, make sure to have perfect IVs and add the remaining 28 EVs into HP for a little bit more longevity.</p> <p>Entry hazard setters such as Ferroseed, Onix, and Pawniard benefit Arrokuda's ability to score more KOs thanks to the chip damage dealt to the foes by entry hazards throughout the game; with one layer of Spikes up, Mareanie often drops to Psychic Fangs after a Liquidation, while Ferroseed usually drops to Close Combat after a Liquidation. VoltTurn users like Vullaby and Chinchou allow for Arrokuda to switch in safely due to its poor bulk, while Arrokuda benefits these three users in particular by checking Onix and other Rock- or Ground-types to more easily spam a singular move.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213064, "username": "Merritt"}, {"user_id": 195129, "username": "Nineage"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 264307, "username": "crusty"}]}
  },
  "Cufant": {
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<p>Cufant's role in the metagame is as a bulky attacker, mainly used to check Fairy-types. Sheer Force-boosted attacks like Iron Head coming off a respectable base 80 Attack make it a decent threat, and with a good defensive typing in Steel, Cufant can switch into common Pokemon like Spritzee and Ferroseed. This EV spread lets Cufant hit 18 Attack and maintain a good 24/14/12 bulk. Cufant's additional moves can provide extra coverage or set up entry hazards to support its teammates; Power Whip can hit Water-types and Onix, Play Rough hits Fighting-types, and so on. However, Cufant is very slow, so it should be used with Pokemon that can take care of its checks; for example, Vullaby and Wingull can beat Fighting-types, and Chinchou can beat Fire-types as well as provide a slow VoltTurn to pivot Cufant in. A Wish passer like Spritzee can keep Cufant's health up since it lacks reliable recovery itself. Pokemon that struggle with Fairy-types, like Scraggy and Galarian Farfetch'd, benefit from Cufant's presence on the team.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 150971, "username": "Coconut"}, {"user_id": 213064, "username": "Merritt"}]}, {"name": "Grammar checked by", "members": [{"user_id": 122460, "username": "Mafeking"}]}], "writtenBy": [{"user_id": 202097, "username": "Gummy"}]}
  }
}