{
  "Nidoqueen": {"sets": [{"name": "Sheer Force (SpA)"}]},
  "Clefable": {"sets": [{"name": "Unaware (HP, Def)"}, {"name": "Magic Guard (HP, Def, SpA)"}]},
  "Ditto": {
    "comments": "<h1>Other Options</h1> <p>Since Ditto needs Choice Scarf to ensure its ability to revenge kill, it shouldn't run any other item.</p> <h1>Checks and Counters</h1> <p><strong>Substitute Sweepers</strong>: Ditto can't copy foes behind a Substitute, completely failing to threaten them.</p> <p><strong>Choice Scarf Users</strong>: Pokemon with Choice Scarf force a coinflip against Ditto, making it less reliable.</p> <p><strong>Bulky Setup Pokemon with Recovery</strong>: Ditto struggles to revenge kill bulky foes like Iron Defense Skarmory and Calm Mind Kyogre without critical hits.</p> <p><strong>Item Removal: Without Choice Scarf, Ditto risks losing the Speed tie against Pokemon it's supposed to check.</p> ",
    "sets": [
      {
        "name": "Revenge Killer (Any)",
        "description": "<p>Ditto is an effective revenge killer in the Godly Gift metagame thanks to its unique ability in Imposter, which, when combined with a Choice Scarf, allows it to outspeed any Pokemon without Choice Scarf or Unburden. Transformation copies donated stats, allowing Ditto to still outspeed Speed receivers and hit as hard as Attack receivers. Imposter's also useful against stall teams by effectively giving infinite PP and copying recovery moves. Ditto prefers having its Choice Scarf removed against stall teams to switch moves and maximize its PP stall capabilities. 252 HP EVs boost the only stat Ditto retains after Imposter activates, while 252 Special Attack EVs and a Quiet nature boost its Future Sight after transforming into a Pokemon like Slowking.</p> <p>Ditto almost exclusively finds its place on stall teams to handle offensive setup threats that its teammates struggle to handle. It struggles to switch in directly against most foes, so slow pivot moves make for great support. Examples include Teleport from Slowbro or Slowking and U-turn from Corviknight. Entry hazards prevent Ditto from switching in repeatedly, so teammates that can reliably remove them such as Mandibuzz and Ho-Oh are appreciated. Unaware users like Pyukumuku, Quagsire, and Clefable or Clear Smog users like Gastrodon and Amoonguss can handle bulky setup Pokemon with recovery, such as Calm Mind Galarian Slowking and Bulk Up Buzzwole, which outlast Ditto one-on-one. An ally with Regenerator, such as the aforementioned Slowbro or Ho-Oh, in tandem with Ditto can outstall defensive Regenerator Pokemon, effectively forcing them out. A defensive god with a high HP stat like Giratina theoretically complements Ditto well, but Ditto is able to go in any teamslot, especially the Attack and Special Attack slots, which stall teams don't benefit from much anyway. While the HP increase is beneficial, another bulky Pokemon can often take better advantage of it, usually Skarmory.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Skarmory": {"sets": [{"name": "Physical Wall (HP)"}]},
  "Tyranitar": {"sets": [{"name": "Specially Defensive (SpD)"}, {"name": "Dragon Dance (Spe)"}]},
  "Ho-Oh": {"sets": [{"name": "Physically Defensive"}, {"name": "Choice Band"}]},
  "Kyogre": {"sets": [{"name": "Choice Attacker"}, {"name": "Calm Mind"}]},
  "Garchomp": {
    "comments": "<h1>Other Options</h1> <p>Garchomp can forgo Scale Shot or one of its coverage moves for Stealth Rock. Fire Blast and a Special Attack donation threaten some of its checks like Skarmory and Corviknight better. A defensive set with a Defense donation and Rocky Helmet is possible, but the reliance on Wish and cleric support makes it hard to justify. Life Orb can increase its damage output, although it makes Garchomp more prone to priority moves such as Grassy Glide. Similarly, an Adamant nature leaves it outsped by more offensive Pokemon post-donation, like Tapu Koko and Noivern, but is an option on Scale Shot sets.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Pokemon: Hippowdon, Buzzwole, Skarmory, Tangrowth, and Corviknight can switch in and sponge any attack from Garchomp if it hasn't set up. They can then disrupt its sweep attempt with Whirlwind, Toxic, Stun Spore, or setup of their own.</p> <p><strong>Unaware Walls: Pyukumuku, Clefable, and Quagsire have no trouble handling Garchomp thanks to ignoring its boosts and healing its damage.</p> <p><strong>Ice-type Coverage: Ice Beam from Tyranitar or Ice Punch from Buzzwole can surprise Garchomp and heavily damage it, if not outright OHKO.</p> <p><strong>Faster Pokemon and Priority Users: Pokemon with Choice Scarf like Tapu Lele or a Speed-boosting ability like Arctozolt can outspeed and revenge kill Garchomp before Scale Shot, but only then. Alternatively, priority moves such as Ice Shard from Mamoswine and Weavile and Grassy Glide from Rillaboom can take advantage of the Defense drops from Scale Shot.</p> <p><strong>Status: Garchomp struggles to do its job properly if it is statused. Burn cuts its damage in half, paralysis from Tangrowth or Amoonguss makes it far easier to outspeed and revenge kill, and poison puts its sweep on a timer.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Speed)",
        "description": "<p>Garchomp is a dangerous setup sweeper with a better Speed stat under its belt. Swords Dance allows it to break past sturdy walls such as Corviknight and Landorus-T. Earthquake is strong and reliable, threatening common Pokemon such as Heatran and Galarian Slowking. Scale Shot allows Garchomp to attack while further raising its Speed, making it more difficult to revenge kill. Fire Fang targets Grass-type foes that can handle Earthquake like Tangrowth and Ferrothorn, as well as others like Skarmory and Corviknight, providing perfect neutral coverage alongside Earthquake and Scale Shot. Stone Edge can be used instead to heavily damage Yveltal, Mandibuzz, and Ho-Oh, with the former two heavily threatening Garchomp with Foul Play and the latter with a burn from Sacred Fire. Leftovers provides longevity as Garchomp sets up.</p> <p>Garchomp best fits on bulky offense teams as a late-game sweeper or hyper offense ones as a wallbreaker. A Speed donation from Zamazenta, Pheromosa, or Mewtwo helps it force more offensive Pokemon out such as Zygarde-10% and Noivern, allowing it to get a Swords Dance up more easily. Entry hazards, like Ferrothorn's Spikes and Heatran's Stealth Rock, compound damage throughout the game, putting Pokemon like Buzzwole and Slowking in Garchomp's KO range late-game. Magnezone can trap and eliminate Corviknight and Skarmory, making it a great partner. Special attackers that invite Heatran and Galarian Slowking in, especially those with a pivot move like Tapu Koko or Tornadus-T, are also great options. Pokemon such as Weavile and Kartana work with Garchomp to overwhelm shared checks, allowing one to sweep. The latter can also break past physically defensive Unaware walls like Clefable and Quagsire, which Garchomp can't get past. Dual screens support from the likes of Alolan Ninetales and Grimmsnarl helps Garchomp set up safely and remedies its Defense drop from Scale Shot. Scale Shot's inconsistency can make bulky Flying-type Pokemon, namely Ho-Oh and Landorus-T, troublesome, making teammates that can take advantage of them like Urshifu-R and Cloyster valuable. Psychic Surge from Tapu Lele can prevent priority attacks like Weavile's Ice Shard from exploiting Scale Shot's Defense drop.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Weavile": {"sets": [{"name": "Swords Dance (Atk)"}]},
  "Rotom-Heat": {"sets": [{"name": "Pivot (HP)"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot (HP)"}]},
  "Heatran": {"sets": [{"name": "Specially Defensive (HP, Spe)"}, {"name": "Offensive (Spe)"}]},
  "Victini": {"sets": [{"name": "Choice Attacker (Atk)"}, {"name": "Mixed Boots (Atk)"}]},
  "Excadrill": {"sets": [{"name": "Sand Rush (Atk, Spe)"}, {"name": "Bulky Removal (SpD)"}]},
  "Ferrothorn": {"sets": [{"name": "Specially Defensive (HP)"}]},
  "Bisharp": {
    "comments": "<h1>Other Options</h1> <p>Bisharp can opt to hold a Choice Band to increase its wallbreaking ability, but it is a tough trade-off, as it means Bisharp can no longer run Swords Dance. Beat Up can be run with Choice Band to increase its damage output further. Low Kick threatens Steel-type Pokemon like Cobalion, which otherwise check Bisharp.</p> <h1>Checks and Counters</h1> <p><strong>Fast Offensive Pokemon: Bisharp is threatened by many offensive Pokemon that either Speed tie or outspeed it post-donation, such as Tapu Koko and Zeraora. However, many of these Pokemon are threatened by a boosted Sucker Punch.</p> <p><strong>Fighting-types: Fighting-types such as Zamazenta, Buzzwole, Urshifu-R, and Cobalion resist Bisharp's Dark-type attacks and are not threatened by Iron Head, and they force Bisharp out by threatening a KO.</p> <p><strong>Physical Walls: Physically defensive Pokemon such as Hippowdon, Quagsire, and Corviknight take very little damage from Bisharp's attacks and commonly carry moves such as Body Press or Earthquake that threaten it.</p> <p><strong>Psychic Surge: Psychic Surge removes Bisharp's ability to check faster Pokemon with Sucker Punch, so Pokemon such as Choice Scarf Tapu Lele can threaten it.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Speed)",
        "description": "<p>A Speed donation from its god makes Bisharp a threatening sweeper and wallbreaker. Bisharp's high base Attack and Swords Dance let it threaten 2HKOs against a large portion of the metagame after a boost, including Landorus-T and Corviknight. Its Steel type helps it set up by giving switch-ins against Grass- and Psychic-type moves, which, combined with Defiant, gives it a niche over other common physical wallbreakers such as Kartana. Bisharp's dual STAB moves, Knock Off and Iron Head, hit most Pokemon for at least neutral damage. Sucker Punch gives it strong priority, allowing it to revenge kill weakened. foes. Black Glasses boosts most of Bisharp's attacks, and Life Orb's slight power upgrade isn't usually worth the recoil. However, Life Orb powers up Iron Head, notably guaranteeing a 2HKO against physically defensive Tangrowth. Defiant lets Bisharp benefit from opposing Intimidate users, including the ubiquitous Landorus-T, and also threaten opposing Defoggers and Sticky Webs teams. A Jolly nature and Attack investment are used to make the most of Bisharp's new Speed tier, but an Adamant nature can be used to increase its damage output, especially if receiving a less valuable Speed tier.</p> <p>Bisharp works best when paired with fast gods such as Mewtwo, Pheromosa, and Zamazenta. It appreciates slow pivots such as Slowbro and Corviknight to bring it in safely, as it can be worn down slowly over the course of a game. Although Bisharp is able to threaten Pokemon such as Skarmory and Corviknight, both of them can run Body Press, which OHKOes it. Thus, Bisharp appreciates Pokemon like Magnezone and Nidoking, which threaten Skarmory, Corviknight, and other checks to Bisharp such as Tapu Fini. Other fast offensive Pokemon such as Tapu Koko can force Bisharp out, so it pairs well with strong defensive Pokemon such as Ferrothorn and Landorus-T. These Pokemon can also provide entry hazards, which weaken Bisharp's checks and synergize with Defiant punishing Defoggers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 525446, "username": "DuckeryDoodle"}]}
  },
  "Volcarona": {"sets": [{"name": "Bulky Quiver Dance (Def)"}, {"name": "Offensive Quiver Dance (Def, SpA)"}]},
  "Tornadus-Therian": {"sets": [{"name": "Defog (HP, Def, SpD)"}, {"name": "Nasty Plot (SpA)"}]},
  "Landorus-Therian": {"sets": [{"name": "Defensive (HP, Def, SpD)"}, {"name": "Offensive (Spe)"}]},
  "Kyurem-White": {"sets": [{"name": "Choice Attacker"}, {"name": "Special Attacker"}]},
  "Yveltal": {"sets": [{"name": "Specially Offensive"}, {"name": "Choice Scarf"}, {"name": "Hone Claws"}]},
  "Mimikyu": {"sets": [{"name": "Swords Dance (Atk, Spe)"}]},
  "Tapu Koko": {"sets": [{"name": "Offensive Pivot (SpA)"}]},
  "Tapu Lele": {"sets": [{"name": "Choice Attacker (Spe)"}]},
  "Buzzwole": {"sets": [{"name": "Defensive (SpD)"}, {"name": "Choice Attacker (Spe)"}]},
  "Kartana": {"sets": [{"name": "Paper Airplane (Spd, Spe)"}, {"name": "Swords Dance (SpD)"}]},
  "Necrozma-Dusk-Mane": {"sets": [{"name": "Dragon Dance"}, {"name": "Specially Defensive"}]},
  "Zeraora": {"sets": [{"name": "Offensive Pivot (Atk)"}, {"name": "Choice Band (Atk)"}]},
  "Corviknight": {"sets": [{"name": "Defog (SpD)"}, {"name": "Bulk Up (SpD)"}]},
  "Dracozolt": {"sets": [{"name": "Sand Rush (Atk)"}]},
  "Calyrex-Ice": {"sets": [{"name": "Substitute Leech Seed"}, {"name": "Choice Band"}, {"name": "Swords Dance"}]}
}