{
  "Venusaur": {"sets": [{"name": "Chlorophyll Sweeper"}]},
  "Charizard": {"sets": [{"name": "Choice Specs"}]},
  "Nidoking": {
    "overview": "<p>Nidoking is equipped with an incredible STAB combination that is amplified by its ability Sheer Force and a Life Orb, allowing it to operate as a powerful special wallbreaker despite its mediocre base Special Attack. In addition, it boasts phenomenal coverage options such as Thunderbolt, Flamethrower, and Ice Beam that allow it to reliably pressure switch-ins to its STAB attacks such as Slowking, Corviknight, Ferrothorn, and Landorus-T. Nidoking's defensive typing is solid as well, letting it take advantage of Pokemon like Tapu Koko and Clefable for wallbreaking opportunities as well as providing it with a handy Toxic and Thunder Wave immunity. However, its bulk and Speed tier leave much to be desired. It is very prone to being revenge killed by faster threats like offensive Landorus-T, Garchomp, and Tapu Lele and struggles to find natural wallbreaking opportunities due to its frailty, relying on pivoting allies that can switch it in safely. Despite its good defensive typing, Nidoking's fragility also makes it difficult to utilize consistently, especially if it sustains prior chip damage. On top of this, Nidoking is reliant on its item to do damage due to its mediocre Special Attack, making it susceptible to Knock Off. This can be particularly troublesome against Clefable, which Nidoking can otherwise take advantage of. Special walls such as Blissey and Slowking are problematic as well, having no qualms switching into most of its attacks and gaining momentum on its escape with Teleport.</p> ",
    "comments": "<h1>Other Options</h1> <p>Taunt allows Nidoking to exploit its small subset of switch-ins by incapacitating most forms of progress, such as Teleport and entry hazard removal, or hazard setup. Taunt mainly punishes Blissey, greatly limiting its utility and providing the Nidoking user with an opportunity to capitalize on it. However, Taunt is a move that needs to be used aggressively to get value, which can conflict with Nidoking's role as a wallbreaker. Alternatively, Focus Punch can be used for the luring and dispatching of Blissey, putting it in range of a subsequent STAB move. This can open Nidoking for more wallbreaking opportunities against teams that are overreliant on Blissey as their special backbone; however, Focus Punch is extremely matchup reliant and has little to no utility against other Pokemon. Lastly, Stealth Rock can be used on teams lacking a Stealth Rock setter, enabling Nidoking to set the hazard on forced switches. Though, using the move limits Nidoking's wallbreaking potential greatly.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Nidoking is extremely susceptible to revenge killing from a wide range of offensive Pokemon like Landorus-T, Rillaboom, Dragapult, and Urshifu-R that can take advantage of its mediocre bulk and Speed tier to force it out and create progress with options such as Stealth Rock, Knock Off, and U-turn.</p> <p><strong>Ground-types: Landorus-T and Garchomp can scare out Nidoking with their greater Speed and super effective STAB attacks. Landorus-T, particularly, is not bothered by Nidoking's STAB attacks but can easily be overwhelmed by its coverage if utilized recklessly. Gastrodon and Swampert, additionally, are willing to take on Nidoking and scare it out with their respective STAB moves; the latter, however, can also be overwhelmed due to its lack of reliable recovery.</p> <p><strong>Specially Defensive Pokemon: Blissey is a counter to most Nidoking variants that can reliably switch into any one of its special attacks, being only somewhat deterred by Taunt and the situational Focus Punch. Galarian Slowking, Slowking, and Tyranitar are also capable of taking its hits if healthy.</p> <p><strong>Item Removal: Nidoking is reliant on its Life Orb for its damage output; for this reason, Nidoking losing its Life Orb to Knock Off or Trick greatly mitigates the threat of its power. Additionally, given Knock Off's prevalence, Nidoking's susceptibility to the move allows Knock Off users to safely force progress using it against the Nidoking user's team.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Nidoking uses Thunderbolt as its most consistent coverage option, super effectively damaging Slowking and Corviknight. Thunder is an alternative that applies much more pressure to Slowking and OHKOes Tornadus-T as they switch in at the cost of a lower accuracy; however, a Modest nature is necessary if Thunder is used to create a more favorable roll to KO Slowking with a subsequent Sludge Wave. Flamethrower is another coverage option that reliably OHKOes Ferrothorn and Scizor and can apply pressure to Landorus-T switch-ins. Alternatively, Ice Beam targets Landorus-T and Garchomp but gives Nidoking a more difficult time in pressuring Ferrothorn, which can take advantage of it by using Knock Off, Leech Seed, or Spikes. Substitute is another option that lets Nidoking fully capitalize on a forced switch and safely force damage on a target of its choice without the threat of being knocked out beforehand, which greatly eases the need for prediction, but forces Nidoking to drop an additional coverage option. A Modest nature provides the Nidoking user with a more fruitful damage output and a much more favorable roll to 2HKO Slowking with Thunderbolt. However, Timid allows Nidoking to outspeed Tapu Bulu, Modest Tapu Lele, and Zapdos.</p> <p>Nidoking's inability to find many natural wallbreaking opportunities makes it a phenomenal partner with offensive pivots such as Tapu Koko and Dragapult that can provide it with opportunities to switch in safely. The former is able to apply great pressure to checks like Corviknight and Slowking while pivoting against bulky Grass-types like Ferrothorn; its Electric Terrain, additionally, boosts Nidoking's Thunderbolt, which is prominent against Slowking. The latter pivots against bulky Fairy-types like Tapu Fini and Clefable while applying pressure to Slowking with its Ghost-type STAB attacks. Additionally, it is capable of utilizing Thunder Wave to slow down Pokemon such as Tornadus-T, turning them into wallbreaking fodder for Nidoking. Nidoking also pairs well with defensive pivots like Corviknight and Rotom-W, which give Nidoking a safe wallbreaking opportunity against Electric-types like Tapu Koko and Grass-types like Tangrowth. They, additionally, can give Nidoking a good escape option against potential revenge killers like Tapu Lele for Corviknight and Landorus-T in Rotom-W's case. Slowking can also find good pivoting opportunities against Tapu Koko and Tangrowth while giving Nidoking the ability to exploit Toxapex for a wallbreaking opportunity. In addition, entry hazards and Knock Off are valuable tools that can greatly aid Nidoking's wallbreaking abilities by forcing checks like Slowking and Landorus-T to fold to its coverage. Ferrothorn, for example, boasts access to Stealth Rock, Spikes, and Knock Off to remove Slowking's Heavy-Duty Boots and more effectively pressure it. Landorus-T is also capable of using Stealth Rock and Knock Off, as well as pivoting against opposing Tangrowth, Ferrothorn, and Tapu Fini with U-turn and providing Nidoking with a wallbreaking opportunity. Clefable is also a solid Stealth Rock setter that has access to Knock Off.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 443485, "username": "curiosity"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 360720, "username": "ausma"}]}
  },
  "Clefable": {
    "overview": "<p>Clefable's typing, decent bulk, and access to an amazing ability in Magic Guard as well as reliable recovery make it a great Pokemon. A wide movepool gives Clefable a bunch of options with utility moves such as Stealth Rock as well as fantastic coverage moves like Flamethrower and Thunderbolt to hit Pokemon that would otherwise switch in safely such as Ferrothorn and Toxapex. Furthermore, access to Knock Off makes Clefable much harder to punish, as its checks are severely hindered by having their item removed. Thanks to this, Clefable can fit on a bunch of bulky offense and balance teams as a defensive entry hazard setter or a Calm Mind user. Despite all the features that make Clefable a great Pokemon, its somewhat disappointing natural bulk often means it can get overwhelmed by offensive Pokemon it might be used to check like Garchomp and Landorus-T after they use Swords Dance. Clefable's mediocre defensive stats can be especially problematic in longer games because it's often used as a switch-in to a lot of Pokemon.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Wish + Teleport set can be used to support Clefable's teammates. However, Clefable isn't the most effective Wish passer, as it lets in Pokemon such as Scizor, Melmetal, and Nidoking that prevent it from using Teleport safely. A specially defensive set can be used to let Clefable take on the likes of Hydreigon and Dragapult better, but this set can't take on physical attackers like Garchomp and Landorus-T as effectively and is inferior in most cases. Unaware can be used so that Clefable can take on setup sweepers like Swords Dance Garchomp and Landorus-T. However, without Magic Guard, Clefable is a lot more susceptible to being worn down by entry hazards or status effects and requires strong entry hazard removal. A set with Choice Scarf and Trick can be used to cripple Pokemon like Toxapex, Ferrothorn, and Blissey, making it easier for Clefable's teammates to take them on. However, this set has limited utility, as Trick is often useless after being used once, and Clefable only has one other moveslot to choose between Stealth Rock, Calm Mind, and a coverage move. Similarly, a set with Sticky Barb and Trick can be used to wear down Pokemon that switch into Clefable, but it also has limited utility for the same reason. Thunder Wave can be used to spread paralysis and is especially useful for crippling Pokemon like Heatran. Aromatherapy can be used to heal status conditions, which is appreciated especially by teammates such as Garchomp, Landorus-T, and Rillaboom.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-types like Scizor, Melmetal, and Excadrill can switch in and force out Clefable. Ferrothorn and Corviknight can switch in multiple times and pressure Clefable if they have a super effective move or set up entry hazards in the case of Ferrothorn. However, they all dislike being hit by Knock Off and need to be wary of Flamethrower or, in the case of Corviknight, Thunderbolt.</p> <p><strong>Fire-types: Heatran is one of the best counters to Clefable, taking very little from its attacks and hitting back very hard. Other Fire-types like Victini, Volcarona, and Moltres can also switch into Clefable. However, getting their Heavy-Duty Boots removed by Knock Off will limit their longevity if entry hazards are up. Moltres also needs to be wary of Thunderbolt.</p> <p><strong>Poison-types: Poison-types such as Toxapex, Galarian Slowking, and Nidoking can all switch into Moonblast; the latter two can threaten Clefable with super effective attacks. However, Nidoking gets a lot weaker if it loses its Life Orb to Knock Off, and Toxapex can lose to the combination of Calm Mind and Thunderbolt. Assault Vest Galarian Slowking can also lose to Calm Mind sets.</p> <p><strong>Powerful Wallbreakers: Despite its decent bulk, Clefable can get overwhelmed by strong wallbreakers like Rillaboom, Swords Dance Garchomp, and Landorus-T.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Clefable is a great Stealth Rock setter, as it can very easily take advantage of passive Pokemon such as Toxapex, Blissey, and Slowbro. Alternatively, Wish is a very useful move that can be used if Clefable's team already has a Stealth Rock user. It supports teammates such as Heatran and Ferrothorn by keeping them healthy throughout the game. Knock Off cripples any switch-in by removing its item, especially Leftovers from checks like Heatran or Ferrothorn, which limits their usefulness over the course of the game. While Leftovers provides passive recovery to keep Clefable healthy and allow it to switch into attacks better, Rocky Helmet is an alternative to punish physical attacks such as U-turn from Landorus-T, Dragapult, and Mandibuzz that usually want to pivot out against Clefable. 56 Special Defense EVs with a Calm nature allow Clefable to live back-to-back uses of Freeze-Dry from Kyurem and Hex from Dragapult with and without Leftovers respectively. The rest of its EVs go into Defense to allow for it to take consecutive hits from Pokemon like Dragonite.</p> <p>Offensive Pokemon like Melmetal, Heatran, and Rillaboom can often overwhelm Clefable, so checks to them are good teammates. Toxapex can take on Melmetal, and Slowbro and Zapdos are also decent Melmetal checks. Both Corviknight and defensive Landorus-T can take on Rillaboom and other physical attackers like Garchomp and opposing Landorus-T that might overwhelm Clefable. Steel-types like Melmetal, Excadrill, and Scizor can take advantage of this Clefable set, so switch-ins to them make good teammates; Ferrothorn can switch into Melmetal and Rillaboom while also using Spikes to form an entry hazard stacking duo with Clefable, and Slowbro can take on both Melmetal and Excadrill but has to be wary of Toxic. Ground-types like Landorus-T and Garchomp can pressure the aforementioned Steel-types as well as Poison-types such as Toxapex, Galarian Slowking, and Nidoking that might switch into Clefable. Specially defensive Pokemon like Blissey and Assault Vest Galarian Slowking can form a good defensive core with Clefable by taking on powerful special attackers such as Heatran, Tapu Koko, and Tornadus-T that Clefable often struggles with.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind boosts Clefable's Special Attack and Special Defense, allowing it to break through bulkier Pokemon or prepare for a sweep. Flamethrower hits Steel-types like Ferrothorn, Melmetal, and Excadrill, while Thunderbolt lets Clefable hit Toxapex, Corviknight and Moltres super effectively and is its best attack to wear down Heatran. Knock Off can be run instead of a coverage move to remove Leftovers or Heavy-Duty Boots from certain Pokemon, limiting their longevity and allowing Clefable to find easier wallbreaking and sweeping opportunities. Thunder is a less accurate alternative to Thunderbolt that hits the aforementioned Electric-weak Pokemon much harder while also having a higher chance to paralyze Heatran as it switches in. Life Orb gives Clefable a boost that makes it much harder to switch into, allowing it to 2HKO offensive Melmetal with Flamethrower and making it much easier to beat Toxapex one-on-one with Thunderbolt. Magic Guard keeps Clefable from taking Life Orb recoil, allowing it to sweep more easily and throw off attacks without taking extra damage. It also prevents Clefable from taking entry hazard and Toxic damage, allowing it to stay healthy when switching in and find more opportunities to set up. 60 Speed EVs allow for Clefable to outspeed uninvested Corviknight.</p> <p>Bulky Water-types such as Toxapex, Slowbro, and Slowking can switch into Melmetal, while the latter two can also take on Heatran for Clefable if they're healthy. Additionally, Toxapex can spread poison with Toxic or Toxic Spikes, making it easier for Clefable to sweep. Ferrothorn can set up entry hazards, which is really useful for wearing down Clefable's switch-ins, as well as covering Melmetal, while Corviknight can take on Excadrill. Since Clefable can weaken or KO bulky Steel-types with Flamethrower, Pokemon that take advantage of this like Excadrill, Melmetal, and Rillaboom are good teammates. Rillaboom can also pivot with U-turn to bring Clefable in safely against Pokemon such as Mandibuzz and Corviknight. Garchomp is an excellent teammate that appreciates Clefable KOing Corviknight. It also takes on Heatran and can set up Stealth Rock to wear down the opposing team.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 248449, "username": "talah"}]}, {"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 360720, "username": "ausma"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 295110, "username": "Ruft"}, {"user_id": 328915, "username": "Leo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 402001, "username": "DKM"}]}
  },
  "Ninetales-Alola": {"sets": [{"name": "Hail Setter"}, {"name": "Aurora Veil"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 295110, "username": "Ruft"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}},
  "Slowbro": {
    "overview": "<p>Slowbro is an amazing defensive pivot thanks to its great typing, decent bulk, and access to Regenerator and Teleport, making it a great answer to offensive threats like Melmetal, Galarian Zapdos, Victini, and Urshifu-R. When combining these traits with Future Sight, Slowbro can make progress against the opposing team while being able to support wallbreakers like Melmetal, Weavile, and Urshifu-R to break past their checks. Slowbro can run a Colbur Berry set with Body Press, letting it remove or even force out Dark-types like Weavile. However, Slowbro is susceptible to Toxic, hindering its ability to function as a pivot reliably and getting constantly worn down from U-turn spam and leaving problems when dealing with Landorus-T, Victini, and Heatran. Additionally, Slowbro's mediocre Special Defense makes it vulnerable when dealing with special attackers like Tapu Lele and Blacephalon.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Future Sight allows Slowbro to pressure the opposing team and help wallbreakers like Melmetal, Weavile, and Urshifu-R break past their switch-ins like Ferrothorn, Toxapex, and Tapu Fini. Teleport lets Slowbro bring teammates in safely and synergizes well with its bulk and Future Sight. Heavy-Duty Boots is the preferred item as it lets Slowbro avoid entry hazard damage, making it much more difficult to break past and allowing Slowbro to pivot more efficiently. Alternatively, Colbur Berry can be used with Body Press to lure in and remove Weavile. 0 Speed IVs and a Relaxed nature make Slowbro as slow as possible to make it move after opposing Slowbro. Rocky Helmet is another alternate option for Slowbro to punish U-turn users like Landorus-T and Urshifu-R.</p> <p>Wallbreakers such as Urshifu-R, Melmetal, and Weavile appreciate Future Sight's offensive pressure and being brought in safely by Teleport against Pokemon they can force out like Toxapex and Tapu Fini. Tornadus-T and Buzzwole are great partners, as they check Grass-types like Kartana and Rillaboom and appreciate Slowbro's ability to handle Urshifu-R, Victini, and Melmetal. Buzzwole in particular can take advantage of Future Sight. Slowbro struggles in handling special attackers like Dragapult, Tapu Lele, and Tapu Koko, so specially defensive partners like Assault Vest Tornadus-T, Ferrothorn, and Galarian Slowking are useful. Tornadus-T and Galarian Slowking can both form potent Regenerator cores with Slowbro. Ground-types like Landorus-T and Garchomp can take on Electric-types like Zeraora, Tapu Koko, and Regieleki for Slowbro and block their Volt Switch attempts. When using Colbur Berry Slowbro, partners like Dragapult, Blacephalon, and Tornadus-T appreciate its ability to remove Weavile for them, with the former two especially benefitting from this, as they can spam their Ghost-type STAB moves more easily. Tornadus-T and Landorus-T can provide entry hazard control for Colbur Berry Slowbro, as it misses out on avoiding entry hazard damage, allowing Slowbro to make the most from Regenerator recovery.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 443485, "username": "curiosity"}, {"user_id": 526987, "username": "Abhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 349443, "username": "Tysonslayer"}]}
  },
  "Gengar": {"sets": [{"name": "Substitute"}]},
  "Marowak-Alola": {"sets": [{"name": "Offensive Wallbreaker"}]},
  "Ditto": {
    "sets": [
      {
        "name": "Imposter",
        "description": "<p>Ditto carves a niche in the OU metagame by virtue of its ability in Imposter, making it one of the best revenge killers in the tier. Choice Scarf gives Ditto the ability to outspeed any Pokemon that isn't running a Choice Scarf itself, or Pokemon like Hawlucha once Unburden has been activated. Ditto is able to duplicate the opposing Pokemon's base stats bar HP; hence, 252 HP is required in order to maximize Ditto's bulk. Against stall teams, Ditto should switch into Knock Off to get its Choice Scarf removed so it can switch moves and have effectively infinite PP as it switches out. This is especially useful against passive Pokemon with recovery like Toxapex, Mandibuzz, and Quagsire, as it can increase its longevity throughout the game.</p> <p>Ditto functions best under bulky teams like stall that require support against offensive setup and opposing stall teams. Blissey appreciates Ditto's ability to break through setup sweepers like Nasty Plot Hydreigon and Venusaur, making it a great partner. In return, Blissey can pivot out slowly with Teleport to provide free switch-in opportunities. Corviknight is a fantastic partner for its ability to remove entry hazards to keep Ditto healthy throughout the game and pivot out with U-turn to bring it in safely. Trick Clefable can help cripple entry hazard removers like Excadrill and Corviknight and other Pokemon like Toxapex and Ferrothorn. Toxapex is useful for dealing with defensive Calm Mind Pokemon like Clefable, which Ditto struggles against due to its Choice Scarf. If you opt to run Toxapex, having a Regenerator core from Pokemon like Reuniclus, Amoonguss, or Tangrowth can prove useful, allowing Ditto to better PP stall defensive Pokemon. Having wallbreakers to support Ditto against stall can benefit it greatly; Pokemon like Safeguard Volcarona, Substitute Kyurem, and Block + Transform Mew can prove useful, with the latter trapping Toxapex, which Ditto struggles to remove.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 295110, "username": "Ruft"}, {"user_id": 144451, "username": "Mannat"}]}, {"name": "Quality checked by", "members": [{"user_id": 114198, "username": "Finchinator"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 303291, "username": "lyd"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 430787, "username": "PA"}]}
  },
  "Zapdos": {
    "overview": "<p>Zapdos's unique defensive typing and ability in Static let it check and punish common offensive threats like Rillaboom, Kartana, and Tornadus-T as well as common U-turn users like Urshifu-R and Landorus-T. It also makes use of rain with its STAB moves in Thunder and Hurricane, which become 100% accurate in rain, as well as Weather Ball, which lets it hit Ground-types and Heatran much harder. This set faces competition from other rain users like Thundurus-T and Tornadus-T, which are faster and can break defensive teams more easily because of their access to Nasty Plot. However, Zapdos can check Rillaboom and Kartana better with its solid defenses and reliable recovery, which rain teams often struggle with. Unfortunately , Zapdos is incredibly prone to having its item removed by Knock Off from Pokemon it's supposed to check, like Rillaboom and Kartana, making it a much less reliable check after being chipped by Stealth Rock. Because Knock Off hampers its ability to check these Pokemon long-term, it often relies on Static to cripple offensive threats. Zapdos is also rather weak to Toxic, which is why some Pokemon like Excadrill and Melmetal opt to run it. Zapdos also faces competition from other defensive walls like Corviknight and Skarmory, which have a better defensive typing. Their neutrality to Stealth Rock also allows them to absorb Knock Off more easily.</p> ",
    "comments": "<h1>Other Options</h1> <p>Toxic can also used on defensive sets to punish defensive Ground-types like Garchomp, Hippowdon, and specially defensive Landorus-T that otherwise don't take much from its attacks, as well as crippling other situational switch-ins like Tapu Koko, Zeraora, and Kyurem. However, it should only be used if the team has another form of entry hazard control. A set with Substitute and Pressure can be used to overwhelm common defensive cores and PP stall common checks like Heatran and Blissey. However, this set is outclassed by Pressure Kyurem and Moltres. An offensive variant with Heat Wave, Thunderbolt, and Hurricane can be a good choice, as it fits on archetypes other than rain and brings good defensive utility to a team by soft checking Pokemon like Hawlucha, Rillaboom, and Kartana, which not many other offensive Pokemon are able to do. This coverage also allows Zapdos to annoy and hit a plethora of Pokemon. However, this set faces competition from Pokemon like Tornadus-T, which also offers utility like Knock Off and has Nasty Plot.</p> <h1>Checks and Counters</h1> <p><strong>Knock Off: Due to the abundance of Knock Off users in the tier and Zapdos's reliance on its Heavy-Duty Boots, it is an easy target for Knock Off users like Rillaboom, Kartana, and Tornadus-T, making it much easier to overwhelm offensively.</p> <p><strong>Ice-types and Ice-type coverage</strong>: Ice-types like Weavile and Kyurem can easily threaten out Zapdos with their strong STAB attacks. However, Weavile cannot switch in very easily, as it lacks reliable recovery and runs the risk of getting paralyzed by a stray Discharge or KOed by Heat Wave. Melmetal can also choose to run Ice Punch to deter Zapdos from switching in frequently or Protective Pads to ignore Static.</p> <p><strong>Rock-types and Rock-type coverage: Tyranitar is a very good check to Zapdos, as it takes minimal damage from its moves and threatens it out with Rock Blast or Stone Edge. Pokemon like Landorus-T and Hawlucha can also easily run Stone Edge to deal with Zapdos, as they would be walled by it otherwise.</p> <p><strong>Galarian Slowking: Galarian Slowking's great bulk with Assault Vest makes it a solid Zapdos check and allows it to take multiple hits from it with ease while pressuring its Substitute set with Future Sight and repeated attacks. Zapdos is also unable to use Roost against it, since it risks the chance of being poisoned by Sludge Bomb.</p> <p><strong>Toxic</strong>: Excadrill and Melmetal can use Toxic to heavily cripple Zapdos, leaving it unable to check them and other threats consistently.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Discharge spreads paralysis, making it hard for common specially defensive switch-ins like Heatran, Clefable, and Galarian Slowking to switch in safely. Volt Switch can be used over Discharge, as it lets Zapdos pivot out against the aforementioned checks and Blissey. It should be used alongside Hurricane to punish Ground-types harder as they attempt to block Volt Switch. Heat Wave can be used over Hurricane, targeting Steel-types like Ferrothorn, Scizor, Excadrill, and Magnezone at the cost of much less damage against Ground-types. Defog adds to Zapdos's utility by letting it remove entry hazards, although it's often forced to do so on free turns like forced switches, as it loses to a lot of common Stealth Rock users like Landorus-T, Hippowdon, and Clefable that are able to cripple Zapdos with either Knock Off or Toxic. Some Stealth Rock users like Garchomp, Landorus-T, and Tyranitar can also carry Rock-type coverage to pressure Zapdos. Static can punish U-turn users like Landorus-T, Urshifu-R, and Dragapult. 40 Speed EVs let Zapdos outspeed Rillaboom and the rest are invested into HP and Defense to maximize Zapdos's physical bulk.</p> <p>Scizor makes a great defensive partner, as it can take pressure off of Zapdos to check Rillaboom and check Ice-types like Kyurem and Weavile. Zapdos can also pivot on some of its checks, like Galarian Slowking and Blissey, to bring Scizor in and threaten them with Knock Off or continue the VoltTurn cycle. Landorus-T also makes a good partner, as it can help out Zapdos by checking opposing Landorus-T, Swords Dance Garchomp, and Zeraora, while Zapdos is able to switch into offensive Grass-types that trouble Landorus-T, like Rillaboom and Kartana. Dragapult can make use of Zapdos's ability to force out some of its checks, like Mandibuzz and Corviknight, while Zapdos benefits from Dragapult's ability to force out Kyurem and offensive Ground-types like Garchomp and Landorus-T. Rillaboom pressures Ground-types like Hippowdon and Garchomp, which can wall Zapdos. Rillaboom also benefits from Zapdos's ability to force out common Flying-types like Tornadus-T and Corviknight and do huge damage to Ferrothorn, letting Rillaboom spam its Grass-type STAB moves much more freely. Melmetal also makes a great partner, as Zapdos can use Volt Switch to bring it in safely against Pokemon like Clefable and Galarian Slowking. Melmetal also benefits from Zapdos's ability to switch into Fighting-types and Pokemon with Fighting-type coverage, like Urshifu-R and Kartana.</p> "
      },
      {
        "name": "Offensive Rain Sweeper",
        "description": "<p>Zapdos's STAB Thunder and Hurricane become 100% accurate in rain, letting it spam them with no drawbacks and assume a wallbreaking role while providing needed defensive utility against Rillaboom, Kartana, and Tornadus-T that rain teams lack otherwise. Weather Ball makes it an even better user of rain, OHKOing both Heatran and Landorus-T that would otherwise be able to land a crippling Toxic or Knock Off. This unresisted coverage lets Zapdos become a potent offensive threat, especially against offensive teams lacking solid specially defensive walls like Tyranitar, Hippowdon, and Blissey. Static greatly benefits its slower teammates like Urshifu-R, as it can paralyze Pokemon like Kartana, making them much easier to deal with. A Timid nature is preferred, as it allows Zapdos to outspeed threats like Kyurem, Tapu Lele, Urshifu-R, and Swords Dance Landorus-T.</p> <p>Other Pokemon that can make use of rain, like Barraskewda and Urshifu-R make good partners. They can pivot on their checks like Tangrowth and Rillaboom to bring out Zapdos for a wallbreaking opportunity. In addition to setting rain and pivoting, Pelipper can also use Defog to remove entry hazards, which can greatly benefit the team by freeing up a moveslot for Zapdos. Ferrothorn is also a valuable teammate, since it can switch into opposing Electric-types like Tapu Koko and provide Spikes support to help Zapdos and its teammates break through teams more easily. These two can also check offensive Grass-types like Kartana and Rillaboom together. Garchomp makes a good partner for its Electric immunity and access to Stealth Rock, and in return Zapdos checks the offensive Grass-types it struggles with.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 415305, "username": "Katy"}, {"user_id": 513717, "username": "airfare"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "Bandkrook"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 526987, "username": "Abhi"}]}
  },
  "Zapdos-Galar": {
    "overview": "<p>Galarian Zapdos is an extremely powerful wallbreaker in OU, capable of taking the top off of most teams with its powerful STAB move combination of Brave Bird and Close Combat. Due to Defiant, Galarian Zapdos possesses the unique trait of threatening both Landorus-T and Corviknight's Defog with an Attack boost, which can nearly guarantee a KO. With even a +1 boost from Defiant, Galarian Zapdos threatens a KO on Corviknight with Close Combat, and with a +2 boost, Toxapex is OHKOed with Brave Bird. Furthermore, its access to U-turn allows Galarian Zapdos to act as a strong pivot, as it forces many defensive Pokemon out such as Ferrothorn and Heatran along with slower offensive threats like Tapu Lele and Urshifu-R. U-turn also is a strong midground play against Slowbro, which is a common switch-in to Galarian Zapdos on Regenerator team structures. However, its powerful Brave Bird comes with the drawback of recoil damage, which, when compounded with passive damage caused by Rocky Helmet, Iron Barbs, or Stealth Rock, can greatly limit its staying power. On the other hand, locking into Close Combat also comes at a cost, as it gives Fighting-type answers like Dragapult and Tapu Lele a free switch-in.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band allows Galarian Zapdos to break through defensively oriented teams with its nearly unresisted STAB move combination of Brave Bird and Close Combat. Thunderous Kick is a middle ground option for breaking through Corviknight even as it heals that does not come with Close Combat's drawback of lowering Galarian Zapdos's defenses. Stomping Tantrum is another option that acts as a way of pressuring bulky Poison-types like Toxapex and Galarian Slowking without Brave Bird recoil while also hitting Tapu Koko on the switch and Aegislash super effectively. Drill Peck is another option for the third moveslot that gives Galarian Zapdos more staying power than using Brave Bird constantly and is good for picking off weakened enemies. U-turn is helpful for generating momentum against healthy Regenerator cores and scouting if locking into Brave Bird or Close Combat is not desirable.</p> <p>Galarian Zapdos fits best on offensively oriented teams due to its incredible breaking power and ability to build momentum. Pivots like Dragapult and Tapu Fini help Galarian Zapdos get on the field safely while chipping away at foes health to allow Galarian Zapdos to more easily wallbreak. Tornadus-T, particularly Assault Vest variants, is an excellent pivot that pairs well with Galarian Zapdos, as it is able to both spam Knock Off and eat most hits that would otherwise KO Galarian Zapdos. Entry hazard support helps Galarian Zapdos secure easier KOes against bulkier foes and bait the opponent into activating Defiant with Defog, so teammates such as Spikes Ferrothorn and Stealth Rock Landorus-T are good choices. Ferrothorn can more easily chip away at foes with Knock Off and Leech Seed, while Landorus-T can come in on Electric-types like Tapu Koko and Zeraora that threaten Galarian Zapdos. Landorus-T can also utilize Toxic to wear down some of Galarian Zapdos's checks like Zapdos and Slowbro. Pairing Galarian Zapdos with another physical wallbreaker like Weavile or Melmetal is suggested, as together they can break through each other's checks. Both Weavile and Melmetal appreciate Galarian Zapdos's ability to deter Defog due to Defiant and blast through defensive walls like Ferrothorn and Toxapex with Brave Bird, while Galarian Zapdos appreciates Weavile removing Toxapex and Clefable's items with Knock Off and Melmetal's ability to both switch into Fairy-type attacks and spread status to bulky Flying-types like Corviknight and Zapdos. Electric-types like Tapu Koko, Magnezone, and Zeraora are excellent choices as teammates as they can bait in Landorus-T, activating Defiant on a double switch. Tapu Koko particularly appreciates Galarian Zapdos beating Ferrothorn, Landorus-T, and Galarian Slowking, while Magnezone comes with the added benefit of trapping Corviknight and Skarmory with Magnet Pull, allowing Galarian Zapdos to more freely use Brave Bird. Future Sight users like Slowbro and Galarian Slowking allow Galarian Zapdos to more easily break through physical walls like Toxapex and Corviknight. Slowbro deserves special mention for its ability to safely pivot Galarian Zapdos in with Teleport against Ferrothorn and Rillaboom.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 218318, "username": "Clone"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Moltres": {"sets": [{"name": "Substitute"}]},
  "Moltres-Galar": {"sets": [{"name": "Double Dance"}]},
  "Dragonite": {"sets": [{"name": "Utility"}, {"name": "Defensive Dragon Dance"}, {"name": "Offensive Dragon Dance"}]},
  "Mew": {"sets": [{"name": "Utility"}, {"name": "Cosmic Power"}, {"name": "Suicide Lead"}], "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 166698, "username": "power"}]}, {"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 295110, "username": "Ruft"}, {"user_id": 144451, "username": "Mannat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 487629, "username": "Zneon"}]}},
  "Xatu": {"sets": [{"name": "Magic Bounce"}]},
  "Azumarill": {"sets": [{"name": "Belly Drum"}]},
  "Quagsire": {"sets": [{"name": "Unaware"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 144451, "username": "Mannat"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 197439, "username": "Chimp"}]}},
  "Slowking": {
    "overview": "<p>Slowking's great typing, excellent ability in Regenerator, and special bulk make it one of the most reliable pivots and special walls in the metagame, and these traits with the combination of Future Sight and Teleport let it help its teammates to force progress against opposing teams. Regenerator allows Slowking to keep itself healthy, which helps it switch into threats more easily and gives it more opportunities to use Future Sight. With its great bulk and defensive typing, Slowking is able to check threatening specially offensive Pokemon such as Heatran, Nidoking, Tapu Lele, and Latios and use them as Future Sight fodders. However, Slowking is very vulnerable to physical wallbreakers like Landorus-T and Garchomp, as its physical bulk is mediocre and doesn't allow it to tank strong hits from them. Slowking's typing and mediocre physical bulk also leave it very vulnerable to Knock Off and U-turn. This is an issue, as these moves are very frequently run and often safe to use, further limiting Slowking's utility as a defensive pivot. In addition, Toxic is worrisome, as it forces Slowking to use Slack Off more often and limits its potential to consistently switch into dangerous Pokemon such as the aforementioned Heatran, Nidoking, and Tapu Lele.</p> ",
    "comments": "<h1>Other Options</h1> <p>Flamethrower is a great option to make Slowking a lure to Steel-types such as Ferrothorn, but it comes at the opportunity cost of pressuring the opposing team with Future Sight. Thunder Wave is another good option to cripple threatening setup sweepers such as Hydreigon and Nasty Plot variants of Tornadus-T, but losing the utility of Future Sight for it is not recommended.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Common Grass-types like Rillaboom and Kartana threaten Slowking with their super effective STAB options. Ferrothorn is especially annoying, as it can use Slowking as Spikes fodder and it can dish out a strong Power Whip. However, all of them have to fear a possible burn by Scald.</p> <p><strong>Electric-types: Tapu Koko, Zapdos, and Zeraora threaten Slowking with their respective STAB moves and can easily wear it down with pivoting moves. However, Zeraora can't risk switching into a Scald.</p> <p><strong>Ghost-types: Dragapult and Aegislash threaten Slowking with their strong STAB moves, but the former has to be wary of a Scald burn if it's running Dragon Darts.</p> <p><strong>Dark-types: Both Hydreigon and Mandibuzz threaten Slowking, as the former isn't scared by Scald and can use it as setup fodder, while the latter can threaten a Knock Off to remove its Heavy-Duty Boots.</p> <p><strong>Physical Wallbreakers: Physical wallbreakers such as Landorus-T, Garchomp, and Melmetal can all easily overwhelm Slowking. Landorus-T can easily pivot with U-turn on it or use Knock Off, Garchomp can dish out heavy damage with its STAB moves, and Melmetal can overwhelm it with coverage options. However, they must be wary of Scald's burn chance.</p> <p><strong>Toxic: Toxic is annoying for Slowking, as it limits its utility on the field by forcing more switches and uses of Slack Off. Although Slowking can normally check it, Heatran can lure in Slowking and cripple it with a debilitating Toxic.</p> ",
    "sets": [
      {
        "name": "Specially Defensive Pivot",
        "description": "<p>Scald is a reliable STAB move and can severely punish potential checks such as Rillaboom, Kartana, Zeraora, and Ferrothorn with a burn if they attempt to hard switch into it. Future Sight pressures opposing teams and works well with Slowking's teammates to increase their wallbreaking potential and force progress. Slack Off lets Slowking stay healthy to reliably check special wallbreakers without having to rely on Teleport or switches. Teleport is not only a solid pivoting option, but it works well in tandem with Future Sight, as Slowking can bring in a more offensive teammate safely to capitalize on the Future Sight. Heavy-Duty Boots lets Slowking pivot in more freely without getting whittled down by entry hazards and helps to maintain healing from Regenerator. 0 Speed IVs with a Sassy nature allow for it to underspeed or Speed tie with opposing Slowking and Slowbro with Teleport.</p> <p>Slowking fits best on bulky offense and balance, as it is able to check dangerous Pokemon such as Heatran and Nidoking, which are threatening to those team archetypes, while being able to maintain momentum. A lot of offensive Pokemon appreciate the additional pressure of Future Sight as well as Slowking's ability to bring them in safely with Teleport. Garchomp likes having its defensive answers like Tangrowth and Landorus-T pressured by Future Sight, providing it with easier wallbreaking opportunities. Slowking is weak to strong physical attackers such as Rillaboom and Kartana, so switch-ins like Tangrowth and Mandibuzz make great partners; in return, Slowking checks problematic Pokemon such as Heatran for them. Dark- and Ghost-types such as Dragapult and Hydreigon can threaten Slowking, making Mandibuzz and Clefable effective partners. In return, Slowking can check Heatran, Tapu Lele, and Nidoking for them. Additionally, Clefable can capitalize on Dark-types such as Hydreigon and Mandibuzz that Slowking pivots against. Electric-types such as Tapu Koko and Zeraora are threatening, making defensive Landorus-T and Grass-types like Ferrothorn and the aforementioned Tangrowth good partners that can help keep them at bay. When pivoted into battle via Teleport, both Landorus-T and Ferrothorn can force progress with their own Knock Off or set their respective entry hazards. Furthermore, Slowking checks Tapu Lele, Heatran, and Nidoking for them in return.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 402001, "username": "DKM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 415305, "username": "Katy"}]}
  },
  "Slowking-Galar": {
    "overview": "<p>Galarian Slowking's great defensive stats and Regenerator make it a very active specially defensive pivot that has decent offensive potential with its wide coverage options and Future Sight, separating it from other special walls like Blissey, Slowking, and Toxapex. Regenerator and good special bulk coupled with Assault Vest allow Galarian Slowking to act as a blanket special wall that can switch into powerful special attackers such as Heatran and eat super effective hits from foes like Dragapult and Nidoking. Galarian Slowking's diverse movepool makes it very difficult to switch into, since it can use Scald and Flamethrower to catch and punish Ground- and Steel-type switch-ins. Future Sight, in conjunction with status inflicting moves such as Sludge Bomb and Scald, makes Galarian Slowking excellent at annoying teams with status, coverage, and supporting wallbreakers. However, Galarian Slowking has a crippling weakness to Knock Off, and without Assault Vest, it can quickly get overwhelmed by Pokemon it is supposed to check, such as Clefable, Tapu Fini, and Tapu Koko.</p> ",
    "comments": "<h1>Other Options</h1> <p>Earthquake is an option with a Sassy nature to easily 2HKO specially defensive Heatran. However, this move is very situational and results in Galarian Slowking losing important coverage. Calm Mind and Slack Off turns Galarian Slowking into a bulky special sweeper that is able to break past switch-ins such as Corviknight and opposing Galarian Slowking. Whirlpool can trap Toxapex, opposing Galarian Slowking, and Clefable, particularly punishing Toxapex and Clefable for staying in and using Knock Off.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Dark-types such as Bisharp, Weavile, and Hydreigon can switch into Future Sight and threaten a KO on Galarian Slowking with their STAB attacks. However, most of these Pokemon do not appreciate switching into Flamethrower, Scald, or Sludge Bomb. Tyranitar is able to easily switch into Galarian Slowking if it is not running Scald.</p> <p><strong>Ground-types: Common Ground-types such as Landorus-T, Garchomp, Hippowdon, and Excadrill easily threaten Galarian Slowking with Earthquake. However, these Pokemon do not appreciate switching into its Water- or Ice-type coverage moves.</p> <p><strong>Knock Off: Knock Off users such as Clefable, Tornadus-T, and Toxapex can remove Galarian Slowking's Assault Vest on an expected switch, limiting its ability to check them as well as other special attackers such as Tapu Koko.</p> <p><strong>Strong Physical Attackers: Due to Galarian Slowking's low physical defense, it is susceptible to being forced out by physical attackers such as Zeraora, Urshifu-R, Landorus-T, and Garchomp. Psyshock users such as Tapu Lele also exploit Galarian Slowking's low Defense. However, none of these Pokemon appreciate switching into Scald or Sludge Bomb.</p> <p><strong>Specially Defensive Walls: Blissey easily switches into Future Sight and heals off the damage with Recover; it also has Heal Bell or Natural Cure to remove Galarian Slowking's status. Corviknight cannot be 2HKOed by Flamethrower from non-setup sets and is able to PP stall Galarian Slowking. Heatran can trap Galarian Slowking and chip it down greatly, which is especially problematic on sets lacking Water coverage. Slowking can switch in easily and use Future Sight and Teleport against Galarian Slowking.</p> ",
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Future Sight synergizes with powerful attackers like Urshifu-R and Bisharp to break through Pokemon such as Toxapex and Buzzwole. The combination of Future Sight and Sludge Bomb also allows Galarian Slowking to easily break through and damage Substitute users like Zapdos. However, Psychic can be used for more immediate damage against Toxapex and Urshifu-R. Flamethrower punishes Steel-type switch-ins to Future Sight like Ferrothorn and Corviknight. Scald punishes Ground-types such as Hippowdon, Landorus, and Excadrill with a potential burn and chips down Heatran. Hydro Pump is a notable option, as its power allows Galarian Slowking to 3HKO specially defensive Heatran and 2HKO defensive Ground-types like Landorus-T and Hippowdon, but it has lower accuracy and cannot burn foes like Scald. Ice Beam can replace Scald to specifically target Ground- and Dragon-types like Landorus-T, Dragapult, and Garchomp. Assault Vest allows Galarian Slowking to act as a special tank, sponging hits from Fairy-types like Clefable, Tapu Koko, and Tapu Fini and threatening them with its STAB moves. The EV spread with a Calm nature and Assault Vest allows Galarian Slowking to tank two Choice Specs Shadow Balls from Dragapult and survive a Choice Band Surging Strikes from Urshifu-R. However, if improving the Dragapult matchup is not necessary for the team, a Modest nature can be run for increased damage output.</p> <p>Urshifu-R is a nice partner due to its ability to deal with Ground- and Dark-types that threaten Galarian Slowking. In return, Galarian Slowking helps Urshifu-R break through opposing teams with Future Sight and status. Dragapult greatly appreciates Galarian Slowking's ability to switch into bulky Fairy-types such as Tapu Fini and Clefable. Moreover, Galarian Slowking can cripple walls such as Hippowdon and Tyranitar with Scald, empowering Dragapult's Hex and increasing its wallbreaking potential when paired with Future Sight. Partners that can absorb Knock Off such as Corviknight and Clefable also pair well with Galarian Slowking. Corviknight and Tangrowth in particular are also good switch-ins to Ground-types such as Landorus-T, Excadrill, and Garchomp. Entry hazard setters such as Ferrothorn and Skarmory appreciate Galarian Slowking pressuring most entry hazard removers with status from Scald and Sludge Bomb. In return, Galarian Slowking appreciates Spikes wearing down switch-ins such as Heatran, Tyranitar, and opposing Galarian Slowking in conjunction with its ability to spread status.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 526987, "username": "Abhi"}, {"user_id": 513717, "username": "airfare"}, {"user_id": 218318, "username": "Clone"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 440741, "username": "Anvil Head"}]}
  },
  "Scizor": {"sets": [{"name": "Physically Defensive"}, {"name": "Offensive Swords Dance"}]},
  "Shuckle": {"sets": [{"name": "Sticky Web"}]},
  "Skarmory": {
    "overview": "<p>Skarmory's impressive physical bulk and great defensive typing allow it to blanket check most physical attackers in the tier, including Landorus-T, Garchomp, Rillaboom, Kartana, and Weavile. Skarmory differentiates itself from other physical walls by being one of the only viable Spikes setters in the tier, easily setting it because of the many switches it forces against the Pokemon it walls. This prevents it from being completely passive despite its poor offensive stats. Iron Defense in conjunction with Body Press can also turn it into a late-game wincon. However, Skarmory's terrible special bulk leaves it vulnerable to almost every special attack, including even resisted attacks from strong wallbreakers like Tapu Lele and Dragapult. Skarmory faces competition from Ferrothorn and Mew as a Spikes setter, which have access to Knock Off and better special bulk to check Pokemon like Tapu Koko and Kyurem, as well as Corviknight and Buzzwole as a physically defensive wall, which have U-turn and actual offensive presence, respectively. Skarmory does, however, have access to reliable recovery and can consistently check Ground-types unlike Ferrothorn, as well as access to Spikes unlike Corviknight and Buzzwole.</p> ",
    "comments": "<h1>Other Options</h1> <p>Whirlwind can be used in the third moveslot to phaze setup sweepers and Pokemon that Skarmory does not want to face, like Tapu Koko, Magnezone, and Volcarona, if they try to switch into it. The switches it forces can wear down the opposing team in conjunction with Spikes. A Shed Shell allows Skarmory to escape Magnezone's Magnet Pull, which can annoy teams that rely on it to trap Skarmory to support Pokemon like Rillaboom and Kartana. However, Rocky Helmet is valuable, especially against U-turn users Skarmory can't punish without it, and Shed Shell can easily be removed by Knock Off if it pivots into one of the aforementioned Pokemon.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types and Electric-type Coverage: Tapu Koko and Zapdos do not mind anything except Toxic from Skarmory and can switch in and force it out, or remove Spikes with Defog in Zapdos's case. Zeraora dislikes switching into Body Press, leaving it reliant on pivots to switch in, but it also forces Skarmory out and can set up on it with Bulk Up. Magnezone is of particular note, as it traps Skarmory with Magnet Pull, though it must be wary of Body Press on the switch, and faster variants of Skarmory can outspeed and KO Magnezone with Body Press if it is weakened. Melmetal can potentially force in Skarmory and use Thunder Punch to weaken it.</p> <p><strong>Fire-types and Fire-type Coverage: Volcarona and Victini can switch into Skarmory safely if it does not carry Toxic, and the former can use Skarmory as setup fodder if it does not carry Whirlwind. Heatran cannot switch in safely in fear of Body Press but can force Skarmory out. Garchomp, which Skarmory usually walls, occasionally uses a mixed set with Fire Blast in order to lure in and KO it. Galarian Slowking usually uses Flamethrower on its Assault Vest set.</p> <p><strong>Special Attackers: Due to Skarmory's low special bulk, almost every special attacker, like Kyurem, Hydreigon, Tapu Lele, and Tornadus-T, is capable of threatening it out, though the former two take considerable damage from Body Press should they switch directly in. Pivots like Landorus-T that Skarmory wants to switch into can use U-turn to bring one of these special attackers safely in against it.</p> ",
    "sets": [
      {
        "name": "Defensive Spikes",
        "description": "<p>Body Press is the preferred attacking move, as it deals significant damage to most of the physical attackers Skarmory wants to check like Kartana, Excadrill, and Rillaboom, and it punishes Magnezone attempting to switch in and trap Skarmory. Iron Defense allows Skarmory to match boosts from setup sweepers like Swords Dance Weavile and Garchomp. Be careful when facing Kartana, however, as Sacred Sword bypasses Defense boosts. Iron Defense also boosts the power of Body Press, making Skarmory less passive and potentially able to sweep late-game if faster special attackers are removed. Toxic is an alternative to cripple some Pokemon that can otherwise switch into Skarmory like Zapdos, Volcarona, Tapu Koko, and Slowking, and it allows Skarmory to more consistently keep its Spikes up; it quickly puts most Defog users, with the exception of Corviknight, on a timer. However, it lets physical setup attackers overwhelm Skarmory in the short term. Rocky Helmet allows Skarmory to wear down physical attackers that make contact like Urshifu-R and Weavile. It is also particularly useful for deterring U-turn to gain momentum from the likes of Rillaboom, Landorus-T, and Urshifu-R, forcing progress against them. At the cost of considerable bulk, 176 Speed EVs can be used to outspeed Modest Magnezone so that Skarmory can 2HKO it with Body Press if it is weakened or caught on the switch.</p> <p>Many offensive Pokemon can benefit from Skarmory's Spikes punishing the switches they force and wearing down checks, like Bisharp, Weavile, Zeraora, and Dragapult. Bisharp and Weavile are particularly notable for their powerful Knock Offs, which can remove Heavy-Duty Boots from foes to wear them down further with Spikes, and the former can deter Defog thanks to Defiant while utilizing Assurance to take advantage of Spikes. Ground-types like Landorus-T, Hippowdon, and Garchomp can check Electric-types for Skarmory. Skarmory usually draws in special attackers, making special walls that can check them for it ideal teammates. For example, Blissey is a good check to Dragapult and Hydreigon, Slowking checks Heatran and Tapu Lele, and Assault Vest Galarian Slowking covers Kyurem and Tapu Koko. Skarmory's Spikes prevents U-turn users like Dragapult and Tapu Koko from freely using them for momentum, especially when paired with Knock Off support. Skarmory can also check most of the strong physical attackers that can beat them, like Rillaboom and Landorus-T. Skarmory is especially valuable to sand teams, as it can check Pokemon that they are usually weak to like Rillaboom and Excadrill, forming a solid defensive core with either specially defensive Tyranitar or Hippowdon, the two viable sand setters.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 526987, "username": "Abhi"}, {"user_id": 513717, "username": "airfare"}, {"user_id": 360720, "username": "ausma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 546123, "username": "TailGlowVM"}]}
  },
  "Kingdra": {"sets": [{"name": "Choice Specs"}]},
  "Blissey": {
    "overview": "<p>High base HP, great Special Defense, and a neutrality to a majority of the tier's coverage moves make Blissey a reliable wall in OU, as it is able to consistently check dangerous special attackers such as Dragapult, Kyurem, Nidoking, and Tapu Koko. Thanks to Teleport's great utility, Blissey can safely bring in a teammate and get momentum against your opponents. In addition, Teleport in tandem with its ability to check many special attackers let Blissey perform as an effective pivot. Natural Cure and Heavy-Duty Boots synergize well with Teleport and make Blissey hard to wear down, as it doesn't have to fear status. However, Blissey is a very passive Pokemon and is vulnerable to Taunt. Blissey is also threatened by the prevalence of strong Knock Off users such as Landorus-T, Ferrothorn, and Clefable due to its poor physical bulk and reliance on Heavy-Duty Boots to prevent it from being worn down by entry hazards.</p> ",
    "comments": "<h1>Other Options</h1> <p>Stealth Rock is an option to outlast Defoggers like Tornadus-T and Zapdos, but it should only be used when its team is lacking a Stealth Rock setter. Heal Bell and Aromatherapy are useful on more defensive teams that benefit from a cleric and don't need status support, but it comes at the cost of not being able to inflict status on foes. Wish is an option on defensive teams to support teammates that lack reliable recovery such as Heatran, Landorus-T, and Melmetal, but it prevents Blissey from using Teleport, as these two moves are incompatible.</p> <h1>Checks and Counters</h1> <p><strong>Physical Wallbreakers: Landorus-T, Kartana, Rillaboom, and Garchomp overpower Blissey with their strong STAB moves; notably, Rillaboom and Kartana can proceed to OHKO it. Landorus-T, Kartana, and Rillaboom also boast access to Knock Off, which they can easily use against Blissey and potential switch-ins due to Blissey's vulnerability to physical wallbreakers. However, all of them have to fear status moves such as Toxic and Thunder Wave.</p> <p><strong>Fighting-type Pokemon and Coverage: Hawlucha, Urshifu-R, and Galarian Zapdos are able to threaten a KO on Blissey with their strong STAB options. However, all of them have to be wary of directly switching into Blissey, as it can dish out status effects. Pokemon that Blissey usually walls, such as Nidoking and Hydreigon, can lure it in and pressure it with Focus Punch and Superpower, respectively.</p> <p><strong>Taunt: Taunt users such as Heatran can disrupt Blissey's ability to heal itself with Soft-Boiled. Calm Mind Tapu Fini with Taunt and Draining Kiss also turns Blissey into setup fodder, as Taunt can shut down Blissey's utility entirely.</p> <p><strong>Knock Off and Trick: Blissey dislikes Knock Off, as Heavy-Duty Boots are key to keeping it healthy, and losing it makes Blissey less effective at checking threats throughout the game. Ferrothorn especially is troublesome for Blissey, as it can remove Blissey's item and proceed to set up entry hazards and Leech Seed. Choice Scarf Tapu Fini, Choice Specs Latios, and the rare Choice Scarf Clefable can cripple Blissey with Trick.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Seismic Toss lets Blissey deal consistent damage to most foes. Soft-Boiled keeps Blissey healthy throughout the game and allows it to check special attackers. Thunder Wave is preferred, as it punishes Pokemon such as Heatran, Clefable, and Kartana. However, Toxic can be used to cripple setup sweepers such as Landorus-T, Garchomp, and Volcarona; it also deters physical attackers such as Hawlucha and Urshifu-R from directly switching into Blissey. Teleport lets Blissey pivot against special attackers to facilitate momentum for offensive teammates.</p> <p>Blissey fits well on teams such as bulky offense and balance, as it checks dangerous special attackers such as Nidoking and Choice Specs Kyurem and generates momentum against them. Offensive wallbreakers like Choice Specs Kyurem, Nidoking, and Tapu Lele appreciate being safely brought in via Blissey's Teleport, as they normally have trouble switching in due to their poor defensive typing and stats. Due to its access to Teleport, Blissey is able to form a pivoting core with partners such as Landorus-T and Corviknight. Corviknight in particular has great synergy with Blissey, as it is able to check physical wallbreakers such as Rillaboom and Landorus-T, while Blissey is able to check special attackers like Tapu Koko and Volcarona for it. Blissey is easily pressured by physical attackers such as Rillaboom, Kartana, and Landorus-T; therefore, physically defensive walls such as the aforementioned Corviknight, Zapdos, and Toxapex are good partners. In return, Blissey checks special wallbreakers such as Kyurem and Nidoking for them. Blissey is also great on more passive teams because of its ability to check the majority of special attackers. Unlike other common specially defensive walls seen on bulky offense teams like Slowking, Ferrothorn, and Heatran, Blissey is an amazing long-term check to key offensive threats like Tapu Koko and Dragapult.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 502731, "username": "devin"}, {"user_id": 360720, "username": "ausma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 415305, "username": "Katy"}]}
  },
  "Suicune": {"sets": [{"name": "VinCune"}]},
  "Tyranitar": {
    "overview": "<p>Tyranitar's unique defensive typing and solid bulk under sand allow it to check prominent special attackers in the tier like Dragapult, Heatran, Tornadus-T, and Volcarona. Alternatively, Tyranitar can use its great Attack stat, amazing offensive typing, strong coverage options, and Choice Band to become a fearsome wallbreaker. Sand Stream allows Tyranitar to support sand sweepers like Excadrill, Dracozolt, and Sand Veil Garchomp. However, Tyranitar's typing leaves it vulnerable to common Pokemon in the metagame such as Landorus-T, Rillaboom, and Tapu Lele. Tyranitar's lack of reliable recovery makes it easy to wear down and hurts its ability to check Pokemon repeatedly throughout the game. Additionally, Tyranitar's low Speed leaves it susceptible to faster foes like Landorus-T, Garchomp, and Rillaboom. Finally, many Pokemon that Tyranitar is supposed to check like Tornadus-T and Kyurem run super effective coverage moves to overwhelm it.</p> ",
    "comments": "<h1>Other Options</h1> <p>The specially defensive set can run Ice Beam to serve as a lure to Landorus-T and Garchomp, dealing a ton of damage on the switch, but it has limited uses outside of that, and running Thunder Wave is more useful to permanently cripple Pokemon like Corviknight and Clefable. Chople Berry allows Tyranitar to survive Fighting-type moves from the likes of Tornadus-T and Kyurem and KO them back with its Rock-type STAB move or cripple them with status conditions; however, it is a single-use item and Tyranitar prefers the longevity provided by Leftovers or Heavy-Duty Boots. A Dragon Dance set with Weakness Policy alongside dual screens support could be used on hyper offense teams, as dual screens allow Tyranitar to survive strong super effective moves like Garchomp's Earthquake and Tapu Lele's Moonblast while setting up. However, it has a mediocre Speed tier even after a boost, and it is outsped by threats like Zeraora, Choice Scarf Landorus-T, and Kartana, which can revenge kill it easily after some chip damage. The Choice Band set can use an EV spread of 40 HP / 252 Atk / 48 SpD / 168 Spe to withstand a Moonblast from Choice Specs Tapu Lele while still outspeeding Azumarill and Skarmory. Choice Band Tyranitar can also use Superpower to almost OHKO Ferrothorn if rain weakens Fire Punch while also OHKOing Heatran. Nevertheless, Tyranitar doesn't have enough room for it in this set, and it is also forced out by the stat drop, which can give free turns to dangerous threats.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Offensive Ground-types like Landorus-T, Garchomp, and Excadrill threaten to KO Tyranitar with their strong STAB Earthquakes. They can set up Stealth Rock or boost with Swords Dance as Tyranitar is scared out. However, they are worn down quickly if they switch into Choice Band Tyranitar's attacks. Albeit uncommon, physically defensive Hippowdon can take on any Tyranitar set lacking Toxic and set up Stealth Rock or hit it with its STAB Earthquake.</p> <p><strong>Grass-types: Offensive Grass-types like Rillaboom and Kartana can OHKO Tyranitar with their Grass-type STAB moves. However, they dislike being paralyzed by Thunder Wave, and they don't take hits from Choice Band Tyranitar very well. Tangrowth's great bulk coupled with Regenerator allows it to switch into Tyranitar with relative ease. However, it can be crippled by Thunder Wave or Toxic from the specially defensive set. Ferrothorn can switch into the specially defensive set almost unharmed, and it can set Spikes or cripple Tyranitar with Leech Seed. However, it must be wary of Fire Punch from the Choice Band set.</p> <p><strong>Water-types: Urshifu-R and Barraskewda threaten Tyranitar with their STAB attacks. Also, they can gain momentum with U-turn or Flip Turn. However, they hate being hit with Thunder Wave or Toxic. Bulky Water-types like Toxapex and Swampert can tank a hit and threaten it with a Scald burn or just pivot out.</p> <p><strong>Fighting-type Pokemon and Coverage: Though they must be wary of Thunder Wave, strong Fighting-types like Urshifu-R and Galarian Zapdos force out Tyranitar with their STAB moves, and they can gain momentum with U-turn as Tyranitar switches out. Pokemon that Tyranitar is supposed to check such as Tornadus-T, Kyurem, and Reuniclus usually run Fighting-type coverage to break past it.</p> <p><strong>Fairy-types: Fairy-types such as Clefable and Tapu Fini can take on the specially defensive set fairly well, and they can chip at Tyranitar's health with their STAB moves. Nevertheless, they can't switch into Choice Band Tyranitar reliably. Offensive Fairy-types like Tapu Lele and Tapu Koko can threaten Tyranitar with their STAB moves. None of them can switch into Choice Band attacks though, as they lack the bulk to do so.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Tyranitar's ability to pressure common forms of entry hazard removal such as Tornadus-T, Zapdos, and Mandibuzz makes it a great Stealth Rock user. Rock Blast is the STAB move of choice, as it has higher PP and accuracy than Stone Edge. Also, it helps against Substitute users like Kyurem. Earthquake OHKOes Heatran while dealing good damage to Toxapex, Bisharp, and opposing Tyranitar. Thunder Wave cripples defensive switch-ins like Corviknight and Clefable, while Toxic can be used to put Ground-types such as Landorus-T and Hippowdon on a timer. Leftovers provide passive recovery, increasing Tyranitar's longevity; on the other hand, Heavy-Duty Boots can be used to prevent Tyranitar from being worn down by entry hazards.</p> <p>Flying-types like Corviknight and Skarmory can deal with Grass- and Ground-types like Rillaboom, Kartana, Landorus-T, and Garchomp for Tyranitar, and both of them enjoy Tyranitar checking Heatran and Volcarona. Corviknight provides Defog support to prevent Tyranitar from being worn down by entry hazards, while Skarmory can set Spikes to form a hazard-stacking core with great defensive synergy. Nasty Plot Tornadus-T is noteworthy, as it can lure in Zapdos and smack it with a Rock-type Weather Ball under sand, which helps Tyranitar to keep Stealth Rock on the field. Slowbro can deal with Ground-, Water-, and Fighting-types that plague Tyranitar, such as Landorus-T, Barraskewda, and Urshifu-R, and it can bring Tyranitar in safely via Teleport. Similarly, Slowking can check some threats that Tyranitar can't such as Tapu Lele and Clefable while providing a secondary check to Heatran. Both Slowbro and Slowking enjoy Tyranitar's ability to check Dragapult and Volcarona. Moreover, they can bring in sand wallbreakers like Excadrill and especially Dracozolt safely with Teleport, and also both of them can use Future Sight, which is great to wear down opposing Pokemon for said wallbreakers. Tangrowth checks Ground-, Grass-, and Water-types like Landorus-T, Garchomp, Rillaboom, and Barraskewda, and it lures in Flying-types like Tornadus-T and Zapdos, which Tyranitar can set Stealth Rock on or cripple with status effects. Sand sweepers like Excadrill, Dracozolt, and Sand Veil Garchomp appreciate Tyranitar's sand and Stealth Rock support to wear down their checks for a late-game sweep. Excadrill also provides Rapid Spin to remove entry hazards and boost its own Speed simultaneously.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Tyranitar's high Attack stat further supported with Choice Band and solid coverage options makes it a great wallbreaker. Additionally, its fantastic special bulk under sand gives it defensive utility and allows it to check certain Pokemon like Heatran and Volcarona. Fire Punch allows Tyranitar to hit Steel-types like Ferrothorn, Kartana and Scizor, threatening them with an OHKO, while also providing another option to 2HKO Corviknight and Skarmory if Stone Edge PPs or its accuracy is a concern. Ice Punch nails Landorus-T and Garchomp on the switch while hitting Hippowdon for decent damage. Heavy Slam can be used to OHKO Clefable.</p> <p>Choice Band Tyranitar pairs well with pivots like Slowbro, Slowking, Tornadus-T, and Corviknight that can give it free switches to attack. Slowbro checks Ground- and Water-types like Landorus-T, Garchomp, and Urshifu-R, while Slowking can check Tapu Lele and Clefable. Both of them offer Teleport to bring in Tyranitar safely and also provide Future Sight support, which makes Tyranitar far harder to switch into. Flying-types like Tornadus-T and Corviknight can deal with Grass- and Ground-types such as Rillaboom, Kartana, and Landorus-T, and they can bring Tyranitar in safely with U-turn against their own checks such as Zapdos and Heatran. Bulk Up Corviknight is a great teammate, as it appreciates Tyranitar's ability to deal with its checks such as Zapdos, Heatran, and Volcarona for a late-game sweep. Sand sweepers like Excadrill, Dracozolt, and Sand Veil Garchomp enjoy Tyranitar's sand and ability to weaken their checks such as Landorus-T and Corviknight, allowing them to clean late-game. Outside of sand teams, Pokemon such as Zeraora, Swords Dance Scizor, and Swords Dance Landorus-T benefit from Tyranitar weakening opposing Landorus-T and Corviknight, which gives them more opportunities to set up and break through opposing defensive cores or clean late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 295110, "username": "Ruft"}]}, {"name": "Quality checked by", "members": [{"user_id": 415305, "username": "Katy"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 398969, "username": "Lando-San"}]}
  },
  "Blaziken": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Swampert": {
    "overview": "<p>Swampert carves out a niche in OU as a blanket special wall with diverse forms of utility that can tank hits from the likes of Dragapult, Galarian Slowking, and Hydreigon. Flip Turn allows it to function as a slow pivot that can directly pressure Defoggers while clawing back momentum. Swampert's good defensive typing lets it switch into common special attackers such as Tapu Koko, Magnezone, Heatran, and Volcarona and use the opportunity to set Stealth Rock or generate momentum on forced switches. Swampert can offer additional utility by punishing common entry hazard removers like Mandibuzz, Rotom-W, and Zapdos with Toxic. However, Swampert's lack of reliable recovery makes it susceptible to being worn down from repeatedly switching into attacks and entry hazards. Due to its narrow niche, Swampert faces competition from other bulky Water-types such as Slowbro, Slowking, Toxapex, and Gastrodon, which boast more longevity with reliable recovery moves and Regenerator in the former three's case. While Swampert boasts access to Flip Turn compared to other traditional bulky offensive Ground-types like Garchomp, it lacks the utility of Landorus-T, which is able to remove a Defogger's Heavy-Duty Boots with Knock Off.</p> ",
    "comments": "<h1>Other Options</h1> <p>Protect may be used over Toxic to increase Swampert's longevity by providing extra Leftovers and Grassy Terrain recovery and to scout common Choice item Pokemon such as Rillaboom, Kartana, Dragapult, and Tapu Lele. Yawn can be used as a disrupting move to deny setup sweepers or prevent opposing Defoggers from removing entry hazards. It can also be used in conjunction with Flip Turn to gain momentum if the opponent decides to switch out to prevent sleep.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Common offensive Pokemon such as Rillaboom and Kartana can switch into and either outright KO Swampert or use it as setup fodder. Defensive Pokemon such as Tangrowth and Ferrothorn can also punish Swampert's Flip Turn with Rocky Helmet and Iron Barbs damage. However, Swampert can punish Rillaboom and Tangrowth with Toxic and deny Kartana setup opportunities with Yawn or Flip Turn.</p> <p><strong>Specific Wallbreakers: Swampert is unable to reliably switch into unresisted attacks from wallbreakers and often relies on other team members to switch into Pokemon such as Tapu Lele, Dragapult, and Urshifu-R.</p> <p><strong>Residual Damage and Entry Hazards: Swampert's lack of reliable recovery makes it very susceptible to entry hazards and contact punishment from Rocky Helmet, Rough Skin, and Iron Barbs. Poison and burn damage are also extremely detrimental to Swampert, crippling its ability to check special attackers for the long term.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Stealth Rock is used to capitalize on Swampert's ability to force switches against Tapu Koko, Magnezone, Heatran, and Volcarona. Flip Turn generates momentum against Grass- and Water-type switch-ins and can safely bring in teammates that threaten out Defoggers such as Corviknight. Toxic is used to punish Defoggers and bulky Water-types such as Rotom-W, Slowbro, and Slowking, as well as common Grass-type switch-ins such as Rillaboom and Tangrowth. High Horsepower may be used over Earthquake to avoid Grassy Terrain's damage reduction, but it may result in Swampert taking more chip damage from Rocky Helmet, Rough Skin, Iron Barbs, and Flame Body. Damp prevents the use of Explosion on hyper offense lead Pokemon such as Landorus-T and Regieleki.</p> <p>Swampert fits very well on bulky offense and balance teams, where it can be used as a Stealth Rock setter and pivot that can chip opposing teams and generate momentum. Swampert can use its slow Flip Turn against bulky Grass- and Water-types such as Tangrowth and Toxapex to safely bring in powerful wallbreakers like Choice Specs Blacephalon, Choice Specs Tapu Lele, and Choice Band Rillaboom. Corviknight is an excellent partner since it appreciates Swampert's ability to switch into Fire- and Electric-type moves such as Magma Storm, Flamethrower, Volt Switch, and Thunderbolt, while Corviknight can be used to switch into many Grass-types that threaten Swampert and forms a pivoting core with it that is great at maintaining momentum. Other Flying-types like Zapdos can also be used to offensively threaten Grass- and Water-types, which may be a nuisance for Swampert. Grass-type Knock Off users such as Rillaboom and Kartana appreciate the Stealth Rock and Toxic chip damage Swampert provides against Flying-type Defoggers that usually switch into them. Swampert also benefits from Rillaboom's Grassy Surge providing it with an extra round of recovery per turn, though it is important to run High Horsepower over Earthquake to prevent damage reduction.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 526987, "username": "Abhi"}, {"user_id": 360720, "username": "ausma"}, {"user_id": 513717, "username": "airfare"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 440741, "username": "Anvil Head"}]}
  },
  "Pelipper": {"sets": [{"name": "Defensive"}]},
  "Shedinja": {"sets": [{"name": "Utility"}]},
  "Torkoal": {"sets": [{"name": "Support"}]},
  "Crawdaunt": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Latias": {"sets": [{"name": "Double Dance"}]},
  "Latios": {"sets": [{"name": "Choice Specs"}, {"name": "Life Orb"}, {"name": "Choice Scarf"}]},
  "Jirachi": {"sets": [{"name": "Specially Defensive"}, {"name": "Choice Scarf"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 295110, "username": "Ruft"}]}},
  "Gastrodon": {
    "overview": "<p>Gastrodon is an amazing specially defensive wall because of its defensive typing, ability, and access to reliable recovery that differentiate it from the other Ground-types in the metagame. It remains one of the only consistent checks to offensive pivots like Tapu Koko, Zeraora, and Dragapult and is notably one of the best checks to Heatran. Gastrodon can also serve as an all-purpose wall against common special attackers like Volcarona, Nidoking, and Dracozolt. Sticky Hold lets it become a counter to most Pokemon using Knock Off and Trick to force progress, like Zeraora, pivot Tornadus-T, and Clefable. On teams lacking solid Water-resistant Pokemon, Storm Drain gives it an edge in matchups against rain teams. However, its passiveness usually relegates it to more defensive teams that can afford its loss in momentum and staying power. For example, it often invites in threatening Grass-types like Kartana and Rillaboom on a predicted Recover or Earthquake, requiring teammates to handle these polarizing offensive threats. Offensive pivots that Gastrodon checks, like Dragapult, can also gain momentum and steady chip damage on it with U-turn, making them much more difficult to check long-term. It is also incredibly vulnerable to status from some of the threats it checks, like Heatran's and Zeraora's Toxic and Dragapult's Will-O-Wisp. Gastrodon faces competition from other defensive Ground-types that are less passive or have the ability to set Stealth Rock, like Landorus-T, Swampert, defensive Garchomp, and its main alternative on defensive teams, Hippowdon.</p> ",
    "comments": "<h1>Other Options</h1> <p>Earth Power can be used to hit Bulk Up Zeraora harder, neutering a typical threat to the defensive cores Gastrodon usually fits on. Gastrodon can run Curse with Waterfall over Scald to act as a late-game wincon, but its vulnerability to incredibly common revenge killers like Rillaboom, Kartana, and Kyurem and status from Skarmory, Zapdos, and Toxapex make this a niche and unreliable team option without extensive team support from partners like Magnezone and Heatran.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Defensive Grass-types like Ferrothorn and Tangrowth can often come in against Gastrodon with little risk, forcing it out easily. Offensive threats like Kartana and Rillaboom, which can either be pivoted in by a teammate like Slowking or switched directly in on a prediction, are also able to force Gastrodon to switch and use it as an opportunity to set up with Swords Dance, force progress with Knock Off, or pivot with U-turn.</p> <p><strong>Kyurem: Both Choice Specs and Substitute Kyurem variants can switch into Gastrodon extremely easily because of their solid natural defenses. However, they must be careful of Toxic or Scald burn upon switching in.</p> <p><strong>Status Conditions</strong>: Status inflicted by Zeraora, Dragapult, and Zapdos can make Gastrodon's job as a specially defensive wall much more difficult because of its need to use Recover more often. Heatran can also use Toxic and Taunt to stop Gastrodon from healing, but this is risky because of the chance Heatran is OHKOed by Earthquake on an incorrect prediction.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Scald gives Gastrodon some offensive pressure by letting it punish common Grass- and Steel-type switch-ins like Ferrothorn, Rillaboom, and Corviknight with a burn. Gastrodon uses Earthquake primarily to OHKO specially defensive Heatran after minor chip damage. Recover gives it a reliable way to check offensive threats like Heatran, Tapu Koko, Nidoking, and Dragapult over the course of a game. Clear Smog lets Gastrodon sit on many different specially attacking setup sweepers, including Calm Mind Clefable and Volcarona. Toxic can alternatively be used for more pressure on defensive Pokemon like Tangrowth, Zapdos, and Slowking if Gastrodon's teammates can adequately handle the aforementioned sweepers. Sticky Hold gives Gastrodon the ability to keep its Heavy-Duty Boots forever, making it less vulnerable to chip damage from entry hazards and being gradually worn down by offensive pivots that it checks, such as Dragapult and Tapu Koko. Sticky Hold also lets it counter defensive Pokemon using Knock Off to force progress, like Toxapex lacking Toxic and Clefable. For teams lacking concrete Water-resistant Pokemon, Storm Drain can be used for a better matchup against rain teams, as well as providing a rare immunity to Scald to block progress from common users like Toxapex and Galarian Slowking. Leftovers, typically used on teams with better entry hazard control, give Gastrodon more longevity at the cost of increased vulnerability to Spikes and Toxic Spikes. A more physically defensive spread with 48 EVs in Defense and 208 EVs in Special Defense lets it survive a Choice Specs-boosted Psyshock from Modest Tapu Lele and guarantee a 3HKO from defensive Landorus-T's Earthquake on Leftovers Gastrodon sets.</p> <p>Gastrodon primarily fits on more defensive balance and stall teams because of its passiveness and vulnerability to being taken advantage of by offensive threats like Rillaboom and Kyurem. These teams greatly appreciate its ability to check Heatran and Dracozolt, wallbreakers that their defensive cores typically struggle with. It is also an incredibly effective check to Tapu Koko, Zeraora, and Dragapult, offensive pivots that are usually able to annoy defensive teams with Knock Off. Gastrodon's defensive typing and Sticky Hold additionally help limit their pivoting. Physically defensive teammates like Corviknight, Skarmory, and Buzzwole help patch up Gastrodon's weakness to Rillaboom and Kartana while also pushing their advantage on a forced switch by pivoting with U-turn, setting Spikes, and gaining a wallbreaking opportunity with its powerful STAB and coverage moves, respectively. Because Gastrodon can often give free switches to special attackers that threaten it, like Tapu Lele and Kyurem, other specially defensive teammates like Blissey and Heatran make solid teammates as well. Gastrodon's vulnerability to status can be alleviated by Aromatherapy support from clerics like Clefable and Blissey, which also appreciate Gastrodon's support as a solid Heatran check.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 481219, "username": "Stareal"}, {"user_id": 360720, "username": "ausma"}, {"user_id": 516245, "username": "Gomi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 513717, "username": "airfare"}]}
  },
  "Garchomp": {
    "overview": "<p>Garchomp's above-average Speed tier, great Attack stat, relevant coverage options, ability, and good defensive typing let it perform several roles such as setting Stealth Rock, wallbreaking, and checking physical attackers. It is one of the best wallbreakers and cleaners in the metagame because of its nearly unresisted STAB move combination, Speed tier, and good natural bulk. It also serves as one of the tier's best entry hazard setters in the tier because it immensely pressures Defoggers such as Mandibuzz and Zapdos through Toxic. Despite this, Garchomp can struggle to keep up Stealth Rock versus Corviknight and Landorus-T, and its setup set is somewhat unreliable due to Scale Shot's imperfect accuracy. Garchomp also suffers from lacking longevity, making it vulnerable to chip damage from switching in on Pokemon like Heatran and Zapdos. Additionally, it faces competition from Landorus-T as a Stealth Rock setter due to the latter's ability to remove most Defoggers' Heavy Duty Boots with Knock Off and pivot with U-turn.</p> ",
    "comments": "<h1>Other Options</h1> <p>Garchomp can run a Naive nature and Fire Blast on Swords Dance sets to punish Steel-types it lures in like Corviknight and Skarmory. More dedicated mixed sets, also utilizing a Naive nature and maximum Special Attack investment, can aim to punish lured in defensive checks like Landorus-T, Slowbro, and Buzzwole, as well as Corviknight and Skarmory, with a strong Draco Meteor or Fire Blast.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Physically defensive Fairy-types like Clefable and Tapu Fini can switch in on Stealth Rock sets and use Moonblast, although they have trouble checking Swords Dance sets, especially if Garchomp holds a Life Orb. Their Dragon immunity lets them strategically block Scale Shot's Speed boosts, making Garchomp easier to revenge kill by faster threats. This is somewhat unreliable, though, because revenge killers still may need a sacrifice to switch in freely.</p> <p><strong>Physically Defensive Pokemon: Physically defensive Pokemon like Slowbro, Hippowdon, and Tangrowth can check Garchomp without Fire Blast or Toxic effectively and cripple it with a Scald, Toxic, Stun Spore, or Sleep Powder. All of these Pokemon can pivot into most of Garchomp's moves and force it out consistently if it hasn't used Swords Dance.</p> <p><strong>Corviknight and Skarmory: Both of these Steel / Flying types resist both of Garchomp's STAB attacks and take neutral damage from Stone Edge, although they have to be cautious of Fire Blast. Their high Defense and typing lets them chip Garchomp easily, set up on it with Iron Defense, pivot out with U-turn into a different check like Clefable or a revenge killer like Rillaboom in Corviknight's case, or force it out with Whirlwind in Skarmory's.</p> <p><strong>Rillaboom: Rillaboom's priority in Grassy Glide and its Grassy Terrain weakening Garchomp's Earthquakes make it a decent offensive check to most Garchomp sets, as well as a good revenge killer after Garchomp has boosted its Speed.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Garchomp can act as a very powerful sweeper or wallbreaker because of its nearly unresisted STAB move combination and tools to pressure checks. It primarily uses Fire Fang to check Corviknight, Skarmory, and Ferrothorn. Scale Shot's Speed boost makes Garchomp outspeed slower revenge killers and sweep effectively. Stone Edge can be used over Fire Fang to threaten Flying-types such as Zapdos, Mandibuzz, and Moltres. Threatening these bulky Defoggers makes Garchomp an excellent Stealth Rock setter. Leftovers provides more longevity, while Life Orb applies more pressure against physical walls like Clefable and Ferrothorn.</p> <p>Scale Shot Garchomp often features on offense teams utilizing other wallbreakers alongside dual screens support to make it sweep as effectively as possible. Scale Shot sets often need their health to be able to set up and sweep. If Garchomp runs Stealth Rock or Stone Edge, many Pokemon can benefit from its ability to pressure most Flying-types, most notably Kartana and Melmetal, which can break through teams incredibly easily. Additionally, Corviknight can serve as a good defensive partner. Garchomp can offensively answer Corviknight's checks, such as Heatran and Zapdos, while Corviknight can check some common revenge killers like Rillaboom. Swords Dance Garchomp does not have many solid defensive answers besides Steel / Flying types such as Skarmory and Corviknight and Unaware Pokemon like Clefable. Heatran, Magnezone, and Tapu Koko can exert pressure on these checks to give Garchomp easier setup opportunities.</p> "
      },
      {
        "name": "Tank",
        "description": "<p>Tank Garchomp is one of the best Stealth Rock setters in the tier because of its ability to keep entry hazards up and pressure conventional Defoggers like Zapdos, Mandibuzz, and Tornadus-T with Toxic. It can take advantage of its typing and the combination of Rocky Helmet and Rough Skin to punish users of contact moves like U-turn and many physical attackers like Melmetal, Kartana, and Hawlucha. Protect is useful to scout moves from Choice-locked Pokemon like Choice Scarf Landorus-T and Choice Band Rillaboom, and it is especially useful on Leftovers sets for better recovery every other turn. Flamethrower is an option to pressure Steel-types like Ferrothorn and Skarmory, which would otherwise be free to set up their own entry hazards or remove Garchomp's Stealth Rock. It can also help Garchomp check offensive Grass-types like Rillaboom and Kartana that take little damage from Earthquake. Rest gives added longevity and removes status caused by Pokemon Garchomp switches into, including Heatran and Zapdos. 120 Speed EVs with a Jolly nature let Garchomp outspeed maximum Speed Nidoking, most defensive Landorus-T, and maximum Speed Heatran.</p> <p>Physically defensive Garchomp provides entry hazard support that Pokemon like Kartana and Rillaboom benefit from. They can use Knock Off to help Garchomp pressure Flying-type Defoggers such as Zapdos and Mandibuzz that check them and appreciate Garchomp's pressure on other checks like Tangrowth. However, Rillaboom's Grassy Terrain weakening Earthquake usually warrants a replacement STAB move in either Stomping Tantrum or Scorching Sands. Garchomp's strain on Defoggers can help other dedicated entry hazard setters like Ferrothorn and Skarmory. Tapu Koko is also a good partner due to its pressure on Flying-typesespecially Corviknight and Skarmorythat can free up Garchomp's fourth moveslot, and it benefits from Garchomp's pressure on Tangrowth, Landorus-T, and Galarian Slowking through Toxic and Earthquake. Garchomp's immense pressure on Heatran and Galarian Slowking, specifically, can also make special attackers such as Tapu Lele and Calm Mind Clefable ideal teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 481219, "username": "stareal"}, {"user_id": 360720, "username": "ausma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 513717, "username": "airfare"}]}
  },
  "Hippowdon": {
    "overview": "<p>Hippowdon's great bulk, solid defensive typing, and reliable recovery allow it to check prominent offensive threats such as Dragapult, Heatran, and Excadrill. Hippowdon is one of the defining components of sand balance teams due to Sand Stream and provides further support by setting up Stealth Rock and checking key threats like Dragapult and Tapu Koko. However, Hippowdon's susceptibility to being pivoted against by these Pokemon makes it easy to wear down and forces it to switch out. It also faces stiff competition as a defensive Ground-type from Pokemon such as Landorus-T, Swampert, and Gastrodon; however, Hippowdon manages to offset this due to reliable recovery in Slack Off and access to Stealth Rock. Additionally, as Hippowdon is a passive Stealth Rock setter, it is difficult to keep its entry hazards on the field against common entry hazard removers such as Corviknight, since it can only use Whirlwind or Toxic to dissuade them. Hippowdon is also vulnerable to entry hazards and status, which make it much harder to remain healthy while checking offensive threats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Sand Force can be run instead of Sand Stream to prevent sand damage from being detrimental to Hippowdon's teammates and ensure they gain recovery from Leftovers. A physically defensive set can be used instead of the specially defensive variant to check prominent physical threats such as Landorus-T, Garchomp, and Melmetal. This physical set can often run Rocky Helmet to chip physical attackers and pivots such as Melmetal and Tapu Koko, although Hippowdon should be wary of Toxic.</p> <h1>Checks and Counters</h1> <p><strong>Corviknight and Skarmory: Hippowdon hates facing Corviknight and Skarmory due to its inability to do anything against them, especially if Hippowdon is not carrying Whirlwind. Skarmory can then use Hippowdon to set up Spikes, while Corviknight can remove entry hazards with Defog. At best, Hippowdon can use Whirlwind against them or Earthquake as they heal with Roost, but it fails to sufficiently weaken them.</p> <p><strong>Residual Damage</strong>: Hippowdon is easily worn down by status and entry hazards, which prevent it from checking Pokemon as effectively as it would like.</p> <p><strong>Ice-types</strong>: Kyurem and Weavile threaten Hippowdon with their powerful Ice-type STAB moves, although they cannot come in on a potential Earthquake or Toxic.</p> <p><strong>Grass-types: Grass-types such as Ferrothorn, Rillaboom, and Kartana wall Hippowdon and force it out, as they easily tank Earthquake and shrug off its coverage moves. Ferrothorn can take advantage of Hippowdon to set up Spikes, while Rillaboom and Kartana can pressure Hippowdon with their STAB attacks.</p> <p><strong>Defensive Water-types: Bulky Water-types such as Slowbro and Slowking threaten Hippowdon with Scald and apply pressure with Future Sight, while Tapu Fini does not fear Earthquake, prevents status with Misty Terrain, and can remove Stealth Rock if it chooses to run Defog.</p> ",
    "sets": [
      {
        "name": "Special Wall",
        "description": "<p>Hippowdon functions as a sturdy check to special attackers such as Dragapult, Tapu Koko, and Volcarona and provides helpful utility with Toxic and Stealth Rock to support its teammates. Toxic allows Hippowdon to punish non-Poison-immune Flying-types that attempt to remove its entry hazards, such as Zapdos and Mandibuzz, and other vulnerable walls such as Tangrowth, Slowking, and Swampert. Whirlwind is also a viable option, allowing Hippowdon to phaze foes it cannot do much against, such as Ferrothorn and Corviknight. Whirlwind can also be used to prevent Hippowdon from being used as setup fodder by setup sweepers like Clefable and Volcarona. Leftovers provides Hippowdon with passive recovery and helps alleviate pressure from offensive threats by letting it waste less turns healing with Slack Off. 8 Attack EVs ensure Hippowdon OHKOes Excadrill with Earthquake. Heavy-Duty Boots prevents residual damage from Spikes and Toxic Spikes, although the passive recovery from Leftovers is in most cases too good to pass up.</p> <p>Hippowdon's Electric immunity and access to reliable recovery give it defensive synergy with partners on more defensive teams and pivots such as Toxapex and Clefable; it helps the team from being overwhelmed by Electric-types such as Zeraora and Tapu Koko. Pressure users such as Corviknight and Moltres are great partners alongside Hippowdon, as they can wear down the PP of Defog and make it much easier for Hippowdons Stealth Rock to stay up long-term - they can also provide entry hazard removal so that Hippowdon doesnt get worn down by entry hazards. Sand Rush Excadrill can utilize Hippowdon's sand to clean late-game after a Swords Dance while also providing entry hazard removal. Knock Off and status absorbers like Clefable and Reuniclus are useful if Hippowdon is being utilized on defensive teams, as they provide the team with much more longevity in the long term. Bulky Water-types such as Toxapex and Tapu Fini are greatly appreciated; Toxapex can handle Weavile and Toxic Melmetal, while Tapu Fini can prevent status from crippling Hippowdon, although this also prevents Hippowdon from using Toxic against grounded Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 513717, "username": "airfare"}, {"user_id": 360720, "username": "ausma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 430787, "username": "PA"}]}
  },
  "Weavile": {
    "overview": "<p>Weavile's amazing offensive typing, powerful STAB moves in Triple Axel and Knock Off, and Speed tier cement it as one of the most versatile offensive Pokemon in the metagame, capable of performing several useful roles in wallbreaker, revenge killer, and late-game cleaner. Weavile also has some defensive use, as its resistance to Ghost and immunity to Psychic makes it a usable stopgap against Dragapult, as well as a pivot into Tapu Lele and Future Sight in a pinch for many offensive teams. Its priority Ice Shard also revenge kills even faster threats like Speed-boosted Garchomp, Hawlucha, and Dragonite. Both its Swords Dance and Choice Band sets let it sweep effortlessly even through opposing physical walls, including Corviknight, Buzzwole, and Clefable, with Swords Dance setting up on forced switches gained from its unique typing. One of Weavile's biggest drawbacks is its unreliability when using Triple Axelalthough the move is extremely powerful when it hits fully, there is a sizable chance to do negligible damage or miss altogether. Weavile's multi-hit Triple Axel can also be heavily punished with contact-based effects like Corviknight's and Toxapex's Rocky Helmet, Ferrothorn's Iron Barbs, and Heatran's Flame Body. Non-Heavy-Duty Boots sets also suffer major chip damage from Stealth Rock, requiring extensive Defog support from teammates to ensure safe entry.</p> ",
    "comments": "<h1>Other Options</h1> <p>Weavile can run Wide Lens on Swords Dance sets to make Triple Axel almost always full power. However, the tradeoff of taking damage from entry hazards, notably losing its ability to pivot in and out freely, almost always makes Heavy-Duty Boots the superior option. Life Orb can also be used for a huge power boost, notably allowing an OHKO on Corviknight with Triple Axel after a Swords Dance boost, at the cost of most of its longevity and long-term offensive potential through Life Orb recoil and its vulnerability to entry hazards. Life Orb Weavile is most often used on hyper offense teams, aiming to wallbreak early-game while hazards are off the field.</p> <h1>Checks and Counters</h1> <p><strong>Physical Walls: Physically defensive walls like Toxapex and Buzzwole can often switch into and force out Weavile, but they can be overwhelmed easily long-term via Knock Off, entry hazards, or Future Sight support. Physically defensive Toxapex with Haze can outlast Swords Dance Weavile while threatening a Scald burn or Toxic.</p> <p><strong>Steel-types: Steel-types like Skarmory, Ferrothorn, Melmetal, and Heatran can situationally switch into Weavile over the course of a game, though they dislike having their items removed. Rocky Helmet Skarmory and Corviknight and Iron Barbs Ferrothorn can also harshly punish Weavile's Triple Axel. Physically defensive Magnezone can also eat one hit and OHKO back with Body Press, making it a popular option for offense teams lacking room for a more dedicated check.</p> <p><strong>Fairy-types: Tapu Fini is one of Weavile's only real counters in the tier through its defensive typing. However, it fails to act as an adequate long-term answer, especially when switching into Weavile with entry hazards up. Physically defensive Clefable, especially when utilizing Unaware, can also switch into and take on most Weavile variants when it is healthy. Tapu Koko can switch into Knock Off or revenge kill it, although it needs a bit of prior chip damage to OHKO with Dazzling Gleam.</p> <p><strong>Adverse Contact Effects: Rocky Helmet and Iron Barbs damage from defensive Pokemon like Ferrothorn, Skarmory, and Corviknight inflict permanent damage on Weavile and dissuade it from using its spammable contact STAB moves. Zapdos's Static and Volcarona's and Heatran's Flame Body can also be used tactically to cripple Weavile with status.</p> <p><strong>Revenge Killers: Faster revenge killers like Zeraora, Tapu Koko, and Choice Scarf Tapu Lele can survive or negate Weavile's Ice Shard and force it out with the threat of a KO. Urshifu-R andoften Choice ScarfTapu Fini can easily switch into Weavile's STAB moves to eat a hit and OHKO it back.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance allows Weavile to be one of the best late-game cleaners in OU. After some prior chip damage, Weavile is able to break past its usual checks such as Clefable, Toxapex, and Corviknight and sweep through the opposing team. It can set up on forced switches from Pokemon like Galarian Slowking and Landorus-T, as well as more offensive threats like Garchomp, Hydreigon, and Choice-locked Dragapult. While Triple Axel is incredibly strong, Icicle Crash has higher cumulative accuracy and avoids contact, and its flinch chance often saves Weavile in late-game scenarios. However, Icicle Crash is significantly weaker, which is especially noticeable against Clefable, Buzzwole, and Skarmory. Weavile uses Knock Off on defensive Pokemon like Corviknight, Buzzwole, and Clefable early-game to better chip these targets down via entry hazards or pivoting teammates in preparation for an endgame with Triple Axel. It often prefers to keep Ice-resistant foes with recovery, like Toxapex, holding their item so it can do more damage when it comes time to sweep. Ice Shard revenge kills faster threats like Dragapult, Scale Shot Garchomp, and Hawlucha, and it can facilitate a late-game sweep by picking off weakened revenge killers like Tapu Koko and Zeraora. Low Kick can also serve as a way to surprise Ferrothorn, Melmetal, and other Weavile, especially useful alongside Tapu Lele, which appreciates Weavile luring these Steel-types and would otherwise block its Ice Shard with Psychic Surge. While a Jolly nature is often used on teams to outspeed and OHKO Tornadus-T, an Adamant nature can alternatively be used to make Weavile much harder to check, most notably increasing the chance to OHKO Clefable after a boost while dealing noticeably increased damage to Corviknight and Toxapex.</p> <p>Swords Dance Weavile shines on offensive teams, where it has several pivots to minimize risk when switching in and teammates to help it overwhelm common walls. Some examples of these teammates are Dragapult, Tapu Lele, and Melmetal, which are all able to target and overwhelm common Steel-type shared checks like Ferrothorn, Melmetal, and Heatran. Weavile removing these Steel-types' Leftovers lets this combination of offensive threats overwhelm them much more easily. Garchomp and Urshifu-R can help break through Clefable, Tapu Fini, and Corviknight for Weavile to easily clean up, and Heatran is an exceptional partner because it keeps Stealth Rock up while exerting pressure on all of Weavile's Fairy- and Steel-type checks. It also notably forces damage onto Tapu Fini, one of Weavile's best answers. Weavile also finds a cozy niche on typical Magnezone offense teams, where it benefits from Magnezone removing Ferrothorn, Skarmory, and Corviknight, and it helps overload other Steel-types alongside other common partners like Tapu Fini and Kartana. Whirlpool Tapu Fini can function similarly to Magnezone in that it removes Toxapex and Ferrothorn while checking Urshifu-R, one of Weavile's common switch-ins.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Weavile uses immediate wallbreaking power with extremely strong STAB moves and instant pressure to break through teams. While Triple Axel is the Ice-type STAB move of choice, Icicle Crash can be run for more reliable, but weaker, damage. Some Weavile opt to run both Triple Axel and Icicle Crash, keeping the former's power while minimizing the risk of missing and avoiding adverse contact effects when needed. Ice Shard is exceptionally good at revenge killing faster Dragon- and Flying-type threats, and it can even sweep through more offensive teams effectively in endgame scenarios. Choice Band Weavile's last moveslot depends on the team support surrounding it. Low Kick is most often used to hit Steel-types like Heatran, Ferrothorn, and Melmetal for super effective damage. Beat Up, especially when paired with teammates with high Attack, is great as an immensely strong, non-contact STAB move with great neutral coverage to easily bust through targets early-game like Rocky Helmet Corviknight and Toxapex. However, its restriction in keeping teammates alive and without status makes it less reliable than other options. Aerial Ace can occasionally snipe Buzzwole and pave the way for other physically attacking teammates. While an Adamant nature is most often used to maximize damage output, a Jolly nature can be utilized instead if a team lacks speed control.</p> <p>Choice Band Weavile's susceptibility to entry hazards makes Defoggers prime teammates. It's not uncommon to see multiple Defoggers, like Corviknight, Landorus-T, and Tornadus-T, providing constant Defog support and using U-turn to minimize the risk of Weavile switching in. One example is pivoting Weavile in on predicted switches into other Flying-types like Landorus-T and Zapdos. Slowking, Galarian Slowking, and Slowbro are also amazing partners. In addition to their safe switch-ins with Teleport, their Future Sight support can help it break through erstwhile checks like Toxapex and Buzzwole and help it overwhelm other physical walls such as Skarmory much more easily. They are also both able to switch into Heatran, Tapu Fini, and Urshifu-R, three of Weavile's notable checks. Physical attackers like Melmetal, Kartana, and Garchomp can help overwhelm common shared checks like Toxapex, Clefable, and Corviknight while boosting the power of Beat Up and appreciating Weavile revenge killing faster threats like Dragapult and Tornadus-T.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 218318, "username": "Clone"}, {"user_id": 526927, "username": "Abhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 513717, "username": "airfare"}]}
  },
  "Magnezone": {
    "overview": "<p>Magnezone's main draw is trapping and removing Steel-types such as Corviknight, Skarmory, and Ferrothorn with Magnet Pull. This support greatly enables many of the strongest sweepers and wallbreakers in the tier, such as Garchomp and Rillaboom. Its coverage is limited but effective, with different options to trap additional foes. However, Magnezone is held back offensively due to its low base Speed, leaving it revenge killed by the many faster Pokemon with super effective coverage. Its lack of longevity is also fairly limiting, denying it a defensive niche despite its great defensive typing. Further, Magnezone can't trap all relevant Steel-types with one set, forcing it to pick certain targets to trap.</p> ",
    "comments": "<h1>Other Options</h1> <p>If paired with Tapu Koko, Choice Specs Magnezone can opt to run Rising Voltage for an Electric-type STAB move that is extremely hard to switch into. Its reliance on Electric Terrain makes it somewhat inconsistent, but the reward is worthwhile. Rising Voltage's power also lets Magnezone run Choice Scarf over Choice Specs, but Choice Scarf sets still lose a lot of wallbreaking power overall and can't outspeed Pokemon such as Dragapult, Zeraora, and Tornadus-T. Choice Specs Magnezone can potentially run Analytic as its ability for extreme power, but sacrificing Magnet Pull and Magnezone's primary niche is not recommended. Teleport is another option on the Choice Specs set to pivot on Pokemon immune to Volt Switch. This comes at the cost of a key coverage move, though, and Flash Cannon already heavily dents some Ground-types.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Magnezone's 4x weakness to Ground and lack of coverage, especially on the Body Press set, make it very hard to break past and avoid revenge killing from Ground-types. Hippowdon, Landorus-T, Garchomp, and Excadrill all greatly threaten Magnezone with their STAB moves, but they don't appreciate switching into Choice Specs Magnezone's Flash Cannon, which lessens their pressure a little bit. Swampert and Gastrodon resist both of its STAB types, making them some of the hardest Ground-types to break immediately.</p> <p><strong>Revenge Killers: With such a low base Speed, middling special bulk, and weaknesses to common attacking types, Magnezone is fairly easy to revenge kill with Pokemon such as Dragapult, Volcarona, and Kartana, or any super effective coverage.</p> <p><strong>Specially Defensive Walls: Galarian Slowking is one of the best walls to Magnezone, as its high Special Defense, resistance to Body Press, and strong Fire-type coverage allow it to pivot into and take on most Magnezone sets. Blissey and Ferrothorn wall the Choice Specs set but fear the Iron Defense set, meaning they have to scout it first.</p> <p><strong>Bulky Grass-types: Tangrowth and Tapu Bulu are very sturdy walls against the Iron Defense set and deal decent damage back, but they are extremely vulnerable to a Choice Specs-boosted Flash Cannon. Ferrothorn, on the other hand, is great against the Choice Specs set but falls easily to the Iron Defense set.</p> ",
    "sets": [
      {
        "name": "Iron Defense",
        "description": "<p>Iron Defense + Body Press Magnezone traps Pokemon that its STAB moves cannot threaten while also pressuring certain special walls that can switch into its attacks otherwise, such as Blissey. Ferrothorn is the main target, as it is one of the best defensive Steel-types that resists Electric and Steel, but this set is still able to trap typical targets like Skarmory and Corviknight with Thunderbolt. Substitute is very useful to block common status moves such as Ferrothorn's Leech Seed and get one more hit off after taking down a Steel-type. Toxic allows Magnezone to badly poison switch-ins such as Landorus-T and Swampert that can exploit Magnezone, while Teleport allows for Magnezone to gain momentum against them and other Ground-type Pokemon instead.</p> <p>With how easily Magnezone can remove Skarmory, Corviknight, and Ferrothorn, among other foes, physical setup sweepers such as Rillaboom, Kartana, Garchomp, and Dragonite can be much more effective. Iron Defense Magnezone will typically have a hard time breaking through Pokemon that aren't Steel-types due to the lack of offensive investment, meaning it needs strong defensive pivots to help when it gets in a bad position. Teammates like Rotom-W and Slowking can pivot into strong Fire-type attacks from Pokemon like Heatran and Galarian Slowking, while Ground-type answers such as Corviknight and Landorus-T can cover Magnezone against attackers like Garchomp and opposing Landorus-T. Magnezone also appreciates strong wallbreakers to stop walls from taking momentum after it traps a foe, so Pokemon like Kyurem, Choice Specs Dragapult, and Weavile are good fits to break foes it can't even when boosted.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Magnezone goes all in with its massive Special Attack stat to hit as hard as possible while still trapping important targets. Its decently powerful STAB moves combined with Choice Specs and a Modest nature make it very hard to wall, as Electric-type answers without reliable recovery such as Landorus-T and Garchomp cannot switch into Flash Cannon reliably. Volt Switch is an incredible tool for Magnezone, allowing it to pivot around special walls such as Galarian Slowking, Blissey, and Ferrothorn to bring in stronger wallbreakers against them and chip them for itself later. Its Volt Switch is also very spammable because Flash Cannon deters Ground-types from switching in. Toxic is an unfavorable move to be locked into but is a great midground option against potential switch-ins like specially defensive Hippowdon and Swampert. Body Press lets Magnezone pick off Ferrothorn and Blissey after they've been chipped, and Steel Beam is a very high-risk, high-reward option that can even take down tanks such as Blissey and Galarian Slowking after they've been chipped. Magnezone is fine sacrificing itself with recoil after doing its trapping job. A Modest nature gives Magnezone a big general boost in power and more favorable damage rolls, such as always 2HKOing specially defensive Tyranitar with Flash Cannon. A Timid nature, however, allows Magnezone to outspeed some targets such as defensive Heatran and Scizor.</p> <p>Rillaboom, Tapu Koko, and Mandibuzz are all great VoltTurn partners to let Magnezone continually switch in, especially Rillaboom, which baits in Steel-types for Magnezone to trap. Pokemon such as Gastrodon, Excadrill, and Blissey are some of the toughest walls for this set to break, meaning teammates that can bait in and damage them are greatly appreciated. Tornadus-T is a VoltTurn partner that baits them in to chip them down, and mixed Hex Dragapult is another pivot that burns Ferrothorn and dents Blissey with Dragon Darts instead.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 526987, "username": "Abhi"}, {"user_id": 546123, "username": "TailGlowVM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Tangrowth": {
    "overview": "<p>Tangrowth's great physical bulk, defensive typing, and access to Regenerator make it a physical wall that consistently checks prominent Pokemon such as Zeraora, Garchomp, Kartana, and Urshifu-R. Useful utility moves such as Knock Off, Sleep Powder, and Stun Spore relieve Tangrowth's passivity issue and allow it to punish Pokemon such as Heatran, Zapdos, and Kyurem that would otherwise be able to switch in on it. Unfortunately, Tangrowth still has issues against certain physical attackers such as Weavile, Galarian Zapdos, and Buzzwole, and its abysmal special bulk leaves it open to threats such as Kyurem, Tapu Lele, Calm Mind Clefable, and Heatran. Tangrowth also is vulnerable to Future Sight, which invalidates its ability to wall Pokemon it would usually check. It also faces stiff competition from Ferrothorn as a defensive Grass-type, as Ferrothorn carries Spikes, which allows it to support its teammates and threaten entry hazard removers with Knock Off. Despite these flaws, Tangrowth is sought out for its better long term matchup against hyper offense teams, as it can constantly regenerate its health to take on these teams' multiple offensive threats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Heavy-Duty Boots prevents entry hazards from overwhelming Tangrowth and limiting Regenerator recovery, which would otherwise make it much easier to wear down. A Choice Specs set with Leaf Storm, Nature Power, Sludge Bomb, and Focus Blast alongside Tapu Koko can be used to lure in Pokemon such as Tornadus-T, Corviknight, and Toxapex, as well as hitting other Pokemon for heavy damage such as bulky Garchomp and opposing Tapu Koko. Sludge Bomb hits opposing Grass-types such as Rillaboom and Tapu Bulu, but it isn't as important as the other moves on its set. Tangrowth can opt not to use an item at all to have a better matchup against Knock Off users like Swords Dance Kartana and Rillaboom, notably avoiding an OHKO from a boosted Bisharp or Crawdaunt. Protect acts as extra security for Future Sight Pokemon and is commonly seen on bulkier builds to ensure longevity during the long term.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: Volcarona doesn't appreciate switching into Knock Off or a status move, but it can easily get rid of Tangrowth offensively, especially if it is a Safeguard variant, as it doesn't fear status and can burn Tangrowth for using Knock Off with Flame Body. Other Fire-types such as Heatran and Victini are just as threatening, but neither appreciates switching into a Knock Off or status.</p> <p><strong>Ice-types: While they can't switch in, Ice-types such as Weavile and Kyurem pose a massive threat to Tangrowth, as they can outspeed and deal massive damage to it. The former should be wary of potentially hitting a Rocky Helmet set, especially with Triple Axel, as it will take massive damage as a result.</p> <p><strong>Steel-types: Once Tangrowth has put a foe to sleep, there are very few options that it has against Steel-types such as Corviknight, Ferrothorn, and Scizor, which easily take Focus Blast. However, the potency of Sleep Powder and Knock Off still discourages them from switching in overall.</p> <p><strong>Special Attackers: Tangrowth's poor special bulk means that strong special attackers such as Kyurem and Tapu Lele, as well as Future Sight users like Slowbro and Slowking, can break through it with relative ease, leaving it unable to effectively deal with physical attackers such as Urshifu-R and Kartana. However, special threats must watch out for Sleep Powder and Knock Off. Other Pokemon such as Life Orb Garchomp and Dragapult can threaten Tangrowth with Fire Blast or Flamethrower.</p> <p><strong>Chip Damage: Entry hazards limit the recovery that Tangrowth gets from Regenerator and therefore significantly impede its ability to consistently check Urshifu-R and other physical attackers. Other Pokemon like Landorus-T, Garchomp, and Excadrill can carry Toxic and use it to whittle down Tangrowth while mitigating Regenerator's recovery, making it much harder to check them throughout the game.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Knock Off provides great utility for Tangrowth, removing items from common switch-ins such as Heatran, Zapdos, and Tapu Koko. Focus Blast mainly serves to hit Steel-types like Kartana, Ferrothorn, Melmetal, and Bisharp to force them out. Sleep Powder helps with Tangrowths passivity issue by preventing free opposing setup, incapacitating threats, and letting a teammate switch in freely. Stun Spore is an alternative to Sleep Powder that can incapacitate threats permanently, unlike Sleep Powder. Rocky Helmet allows Tangrowth to chip down physical attackers and Pokemon trying to pivot with U-turn such as Rillaboom, Zeraora, Kartana, and Urshifu-R.</p> <p>Tangrowth fits best on defensive teams that appreciate a bulky Grass-type that can check Ground-types such as Landorus-T and Garchomp. They also benefit from having a reliable and consistent check to physical attackers, particularly wallbreakers like Bisharp and Urshifu-R, that can force progress with Knock Off and generate opportunities for its teammates. Ground-types work well with Tangrowth, as they appreciate it taking on Water- and Grass-types like Urshifu-R, Rillaboom, and Kartana. Hippowdon, Garchomp, and Gastrodon work well to check most threatening special attackers like Heatran. Tangrowth's meager Special Defense requires having partners that can take on special attackers: specially defensive Heatran and Galarian Slowking are excellent teammates that can take care of Zapdos, Life Orb Clefable, and Tapu Lele. In return, they appreciate Tangrowth taking care of physical attackers, such as Landorus-T, Zeraora, and Urshifu-R. Slowking can form a Regenerator core with Tangrowth to handle threats like Heatran and Tapu Lele. Having entry hazard removal is very useful, as entry hazard damage can put Tangrowth in range of some of the tier's stronger wallbreakers, such as Swords Dance Kartana. Corviknight is a great partner on bulkier builds, as it can alleviate pressure for Tangrowth by checking Rillaboom and Kartana, while Zapdos can check Tornadus-T, which is really good at exploiting Tangrowths low Special Defense. Additional checks to physical attackers that Tangrowth can't handle are also beneficial; Toxapex can take care of Weavile, while Corviknight alongside a revenge killer such as Weavile can stop Swords Dance variants of Garchomp or Landorus-T. Corviknight can also alleviate pressure by helping Tangrowth against Rillaboom + Magnezone cores as well as Grass-type spam cores.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "Ausma"}, {"user_id": 526987, "username": "Abhisdn417"}, {"user_id": 513717, "username": "airfare"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 430787, "username": "PA"}]}
  },
  "Togekiss": {"sets": [{"name": "Nasty Plot"}], "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 248449, "username": "talah"}]}, {"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 295110, "username": "Ruft"}, {"user_id": 303291, "username": "lyd"}]}, {"name": "Grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}},
  "Mamoswine": {"sets": [{"name": "Choice Band"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 443485, "username": "curiosity"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 439341, "username": "Egor"}]}},
  "Rotom-Heat": {"sets": [{"name": "Nasty Plot", "description": "<p>A very good offensive typing in tandem with Nasty Plot makes Rotom-H a good wallbreaker, as it is easily able to break through common defensive Pokemon like Clefable, Ferrothorn, and Corviknight. It is mostly used on balance and bulky offensive teams looking for a reliable progress maker or Togekiss check. Clefable and Blissey are particularly good partners, as they are often able to deal with common threats to Rotom-H, such as Dragapult and Hydreigon.</p> "}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 185591, "username": "TDK"}, {"user_id": 328915, "username": "Leo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 101351, "username": "Gary"}]}},
  "Rotom-Wash": {
    "overview": "<p>Rotom-W is a premier defensive pivot in OU because of its Water typing and ability Levitate, giving it staying power against Ground-types and differentiating it from other Electric-type pivots like Tapu Koko and Zeraora. Along with its arsenal of threatening status moves, these factors make it an amazing support option for bulky offense teams, where it is able to easily grab momentum and pivot into threatening offensive teammates while heavily punishing Ground-types attempting to block its Volt Switch. It also has unique defensive utility in checking, most notably, Heatran and Tornadus-T, but also Ground-types like Excadrill and Landorus-T. However, Rotom-W lacks reliable recovery, and it is dependent on Pain Split and Leftovers to consistently pivot and check offensive threats throughout a game, letting it be easily overwhelmed by repeated hits from Pokemon like Landorus-T and Heatran. This problem worsens after a Knock Off from one of the Pokemon it most commonly checks, like Landorus-T or Tornadus-T, or when it is statused by Heatran or Excadrill. Rotom-W faces competition from Slowking as a defensive pivot because of Slowking's reliable recovery with Slack Off and Regenerator, useful guaranteed slow pivoting with Teleport, and access to Future Sight, an invaluable tool for offensive teammates. Swampert is also able to set Stealth Rock, spam its unblockable Flip Turn, and check Electric-types like Tapu Koko and Zeraora better while still checking Heatran.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rotom-W can run a Choice Scarf set with Trick to lure in and cripple common specially defensive walls like Blissey, Ferrothorn, and Galarian Slowking for its teammates while serving as a revenge killer. However, forgoing defensive investment means that it loses most of its defensive use. It also faces competition from Tapu Fini as a Choice Scarf + Trick user that has much more defensive utility, courtesy of its base stats and defensive typing, and can lure in walls like Toxapex better.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Offensive Grass-types like Rillaboom and Kartana can outspeed and OHKO Rotom-W easily if switched in safely, but direct switches let Rotom-W pivot on or cripple them. Ferrothorn and Tangrowth are pressured by Will-O-Wisp and prone to Rotom-W pivoting into a threatening wallbreaker like Kyurem or Heatran. However, they can easily switch into Rotom-W and punish its forced switch with Spikes, Knock Off, or Sleep Powder.</p> <p><strong>Chip Damage: Rotom-W's lack of reliable recovery makes it susceptible to Knock Off and Toxic from common Pokemon it checks, like Landorus-T and Tornadus-T, removing or negating its only consistent recovery in Leftovers. Switching into U-turn from either of these Pokemon can also steadily whittle it down, especially alongside chip damage from entry hazards.</p> <p><strong>Specially Defensive Pokemon: Specially defensive walls like Blissey, Ferrothorn, and Galarian Slowking can switch into Rotom-W easily, but the latter two are pressured by Will-O-Wisp, and all three can be taken advantage of with a predictive Volt Switch into a wallbreaker.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Volt Switch is extremely useful on Rotom-W in order to grab momentum for wallbreaking teammates, especially when armed with Hydro Pump and several status conditions to threaten incoming Ground-types intending to block Volt Switch. Thunder Wave lets it cripple offensive Dragon-types like Dragapult and Kyurem more than a burn would while crippling walls like Clefable and Heatran. Will-O-Wisp is also common to pressure Garchomp, Tapu Koko, and Zeraora, and it can provide amazing utility against Leftovers-reliant walls like Ferrothorn. Both status moves can also deter and heavily punish switch-ins from offensive Grass-types like Rillaboom and Kartana. Pain Split and Leftovers let Rotom-W check offensive threats while pivoting through chip damage from entry hazards or status conditions for longer. 88 Speed EVs let it outspeed Adamant maximum Speed Scizor. Rotom-W can use Defog because of its unique ability to relatively safely use Defog on Heatran, one of the most threatening Stealth Rock setters in the tier, as well as other extremely common Ground-type entry hazard setters like Landorus-T, Garchomp, and Hippowdon. However, forgoing Pain Split recovery makes it a less consistent answer to most offensive threats. Defense investment is an option to take care of miscellaneous physical attackers like Hawlucha, Weavile, and Melmetal more easily at the cost of reduced special bulk.</p> <p>Rotom-W fits best on bulky offense teams because it keeps up momentum consistently, enables its offensive teammates, and provides defensive flexibility. It gives opportunities to wallbreakers like Bisharp, Kartana, and Heatran after pivoting out on passive specially defensive walls like Blissey, Ferrothorn, and Galarian Slowking. Other defensive pivots like Landorus-T and Corviknight can help keep up momentum while respectively checking offensive Electric-types, like Tapu Koko and Zeraora, and Grass-types, like Rillaboom and Kartana, for Rotom-W. Scizor is also a fantastic partner because of its defensive synergy with Rotom-W. In addition to forming a potent momentum-based core, Scizor is a decent check to offensive Grass-type threats and can check strong wallbreakers, like Tapu Lele and Kyurem, that would otherwise blow back Rotom-W. Rotom-W can help check opposing Skarmory and Heatran in return. Tapu Lele and Tornadus-T enjoy Rotom-W's ability to check Heatran and force damage on Steel-types with Volt Switch or Will-O-Wisp, enabling them offensively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 526987, "username": "Abhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 513717, "username": "airfare"}]}
  },
  "Heatran": {
    "overview": "<p>Heatran cements itself as one of the best wallbreakers in the metagame. The combination of Magma Storm, Taunt, and Toxic makes Heatran almost impossible to deal with defensively, as it is able to overwhelm its checks throughout the game. Additionally, Heatran's fantastic typing allows it to check a large number of threats such as Dragapult, Tornadus-T, and Volcarona. However, its neutrality to Stealth Rock and lack of reliable recovery hurts it on the defensive end, making it lose to common Knock Off users like Ferrothorn and Rillaboom, which it can otherwise check, and leaving it unable to repeatedly take strong hits. Heatran's highly exploitable typing can be taken advantage of by Pokemon it is supposed to check such as Kyurem and Tapu Lele, as they carry coverage moves that can overwhelm it. Heatran's low Speed tier also leaves it vulnerable to faster Pokemon such as Landorus-T, Kyurem, and Tapu Lele. This is hindering to its offensive sets, as it is not able to take hits that well and can often be KOed by their coverage options.</p> ",
    "comments": "<h1>Other Options</h1> <p>Protect helps Heatran gain passive recovery with Leftovers and wear down opposing Pokemon with chip damage from Magma Storm. Flame Body enables Heatran to better check Rillaboom and Melmetal and discourage the use of U-turn. However, this can be bad for Heatran, as it is unable to check Volcarona well without Flash Fire. Stealth Rock alongside Lava Plume are good options for Heatran, as it is a good Stealth Rock user that is able to pressure common Defoggers like Corviknight, Zapdos, and Mandibuzz. These moves should only be used together, as they are underwhelming otherwise and leave it unable to punish Toxapex and Blissey. Magma Storm alongside Lava Plume can be a good choice, as it can cripple common switch-ins like Tyranitar and defensive Garchomp with a burn while also trapping and punishing defensive walls such as Toxapex and Blissey. Will-O-Wisp is also a good option, as it can burn switch-ins such as Tyranitar and defensive Garchomp, leaving them crippled due to their lack of reliable recovery. Heavy Slam is a good choice as well, as it pressures Pokemon like Tapu Lele, Clefable, Galarian Slowking, and Blissey. A set with Choice Specs and the moves Eruption / Solar Beam / Flamethrower/ Earth Power or Flash Cannon is decent on sun teams, as it lacks reliable switch-ins. However, this set is very vulnerable to chip damage, as it has no passive recovery with Leftovers. Furthermore, chip damage can be detrimental, as it reduces the Base Power of Eruption.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Bulky Water-types such as Slowking, Tapu Fini, and Rotom-W can switch into Magma Storm and threaten to KO Heatran. Swampert and Gastrodon can threaten to OHKO Heatran and force it out, with Swampert also being able to pivot using Flip Turn; however, both Pokemon struggle to consistently switch in due to the threat of Toxic. Offensive Water-types like Urshifu-R and Barraskewda also threaten to KO it with their strong STAB moves.</p> <p><strong>Dragon-types: Dragon-types like defensive Garchomp, Hydreigon, and Dragonite are good checks to Heatran, as they resist Magma Storm and threaten to OHKO it. They can also shrug off any chip damage from Magma Storm using their recovery, but they should be wary of being crippled by Toxic. Dragonite is a notable check, as it can use Heal Bell to get rid of any status that Heatran dishes out. Kyurem can use Heatran as setup fodder with Substitute, and it is capable of OHKOing Heatran with a Choice Specs-boosted coverage option.</p> <p><strong>Ground-type Pokemon and Coverage: Ground-types like Landorus-T, Garchomp, Excadrill, and Nidoking can threaten to OHKO Heatran. Moreover, Pokemon such as Galarian Slowking and Tyranitar can take Heatran's hits quite well and threaten to possibly KO it with Earthquake; however, Galarian Slowking with Earthquake is rather uncommon.</p> <p><strong>Residual Damage: Heatran's lack of reliable recovery leaves it weak to residual damage from entry hazards, Leech Seed from Ferrothorn, and Sticky Barb from Trick Clefable, and it makes it vulnerable to repeated strong hits from the likes of Tornadus-T and Dragapult. Knock Off can make this worse, as it removes Heatran's only form of recovery in Leftovers.</p> <p><strong>Fighting-type Pokemon and Coverage: Pokemon such as Tornadus-T, Kartana, and Tapu Lele run Fighting-type coverage moves to deal with Heatran and Steel-types and can threaten a KO on it and force it out. Fighting-types like Hawlucha, Urshifu-R, and Galarian Zapdos can also threaten it with an OHKO.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>This set acts as a good specially defensive wall, capable of checking threats such as Tornadus-T lacking Focus Blast, Choice Specs Dragapult, and Volcarona. Magma Storm enables Heatran to trap Pokemon like Toxapex and Blissey and chip down checks such as Garchomp and Swampert. Taunt allows Heatran to overwhelm Clefable, Toxapex, Slowking, and Blissey. Toxic wears down Heatran's defensive switch-ins such as Hydreigon, Slowking, and Tyranitar and also helps to break through Blissey. Earth Power provides good coverage, allowing Heatran to hit Toxapex and opposing Heatran.</p> <p>Grass-types are great partners, as they check bulky Water-types such as Tapu Fini and Slowking and benefit from Heatran's ability to pressure Steel-types. Rillaboom pairs well with Heatran, as it can pivot on Steel-types to bring in Heatran; furthermore, it weakens Earthquake from Swampert and Assault Vest Galarian Slowking. Defensive Landorus-T is also a great partner, as it can switch into and pressure common Ground-types such as opposing Landorus-T, Garchomp, and Excadrill. Heatran also helps Landorus-T by putting pressure on common Defoggers such as Corviknight, Zapdos, and Mandibuzz. Since Heatran is able to cripple a lot of its defensive switch-ins, Pokemon that benefit from it like Dragapult, Tornadus-T, and Tapu Lele are good partners.</p> "
      },
      {
        "name": "Offensive",
        "description": "<p>This set acts as an offensive wallbreaker that can pressure common defensive Pokemon by trapping them. Magma Storm allows Heatran to trap Toxapex and Blissey. Earth Power provides good coverage and hits Toxapex and opposing Heatran. Taunt allows Heatran to overwhelm Clefable, Slowking, Toxapex, and Blissey. Toxic cripples common switch-ins such as Slowking, Tyranitar, and Swampert, which makes it difficult for them to check it later.</p> <p>Pivots such as Rillaboom and Tapu Koko make good teammates, as they lure in and pivot on Steel-types like Corviknight and Skarmory and Grass-types like Ferrothorn and Tangrowth, which Heatran can threaten to KO and force out. These Pokemon also take care of bulky Water-types that Heatran can often struggle with. Other Pokemon such as Dragapult, Tornadus-T, and Nidoking are great partners as well, as they share common checks like Slowking and Tyranitar with Heatran, which can be overwhelmed trying to check both threats.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 481219, "username": "stareal"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 526987, "username": "Abhi"}]}
  },
  "Cresselia": {"sets": [{"name": "Lunar Dance"}]},
  "Victini": {
    "overview": "<p>Victini's extremely strong V-create along with its wide variety of coverage moves to break through V-create switch-ins make it a decent wallbreaker in the tier. Bolt Strike and Glaciate lets it hit Slowking, Tapu Fini, Landorus-T, and Garchomp and give it unresisted coverage in conjunction with V-create. Victini's typing and decent bulk allow it to offensively check Tapu Lele, Scizor, Volcarona, and Calm Mind Clefable, and it offers utility as a pivot with U-turn. However, Victini is heavily reliant on V-create to properly wallbreak because running Heavy-Duty Boots sacrifices a power-boosting item, and the move's stat drops let foes easily revenge kill it. Victini needs good prediction to get the most out of it, and its Speed tier lets faster threat like Weavile, Dragapult, and Zeraora revenge kill it, though it is fast enough to dissuade other threats like Landorus-T, Kyurem, and Urshifu-R.</p> ",
    "comments": "<h1>Other Options</h1> <p>Victini can run Will-O-Wisp over Glaciate to cripple Landorus-T, Garchomp, and Bisharp, but Glaciate is preferred for the immediate damage output on the former two. It can run a Choice Scarf set with Final Gambit to lure in the likes of Heatran, Toxapex, and Dragonite and remove them with ease. It can also run a Choice Band set; however, being locked into a move can make it vulnerable with the prevalence of Heatran and Ground-types in the tier, and entry hazard damage wears it down rather easily. Encore can also be used to take advantage of Pokemon like Clefable, Toxapex, and Landorus-T, locking them into a passive recovery move or entry hazard move and giving Victini a free turn to attack. It also helps handle Calm Mind Clefable and Tapu Lele, as they can be locked into setting up.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Slowbro, physically defensive Toxapex, and Rotom-W are able to pivot into Victini's attacks, and Toxapex is able to wear Victini down with Rocky Helmet as well as use Knock Off or Toxic. Urshifu-R and Tapu Fini can come into a V-create and threaten it out immediately.</p> <p><strong>Heatran: Heatran is one of the biggest roadblocks for Victini, as it is immune to V-create and takes neutral damage from its other moves except for Scorching Sands, though Heatran's lack of recovery makes it easy to overwhelm.</p> <p><strong>Faster Offensive Threats</strong>: Dragapult, Choice Band Kartana, and Weavile are able to force Victini out, as they are faster and can revenge kill it with a super effective move. V-create's Speed drop also leaves Victini open to more foes like Hydreigon, Kyurem, Bisharp, and Urshifu-R.</p> <p><strong>Ground-types: Landorus-T, Garchomp, and Hippowdon are able to switch into most of Victini's move, and all can beat Victini one on one; however, the former two dislike switching into a Glaciate or Will-o-Wisp. The latter can take a hit and is able to recover with Slack Off as well as chip down Victini with sand.</p> ",
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>Bolt Strike hits Toxapex and Slowking hard, as well hitting Heatran for a decent amount. Glaciate hits Ground-types that can otherwise switch into it like Garchomp and Landorus-T. Scorching Sands can be used over Glaciate in order to nail Heatran, but Bolt Strike does a decent amount to Heatran already. U-turn gives Victini momentum and lets it pivot out against Heatran and Tyranitar, which are usually able to take on its other attacks. Jolly is the preferred nature instead of Hasty, since Glaciate's targets will still be 2HKOed even with the Special Attack drop.</p> <p>Tapu Koko is a great partner, as they both are able to overwhelm their shared checks, and Tapu Koko enjoys Victini's coverage handling most of its switch-ins while also forming a pivoting core with Victini. Tapu Koko's Electric Terrain support strengthens Bolt Strike, helping Victini to beat Slowking and Slowbro on its own. Urshifu-R and Weavile pair nicely with Victini, as they both enjoy Victini removing or weakening their checks like Tapu Fini, Clefable, and Corviknight, which helps the former wallbreak and the latter sweep. Tapu Fini is able to switch into Heatran and Tyranitar for Victini and provides Misty Terrain so it doesn't get statused while also appreciating Victini weakening Slowking, Ferrothorn, and Blissey. Buzzwole, Corviknight, and Tornadus-T are able to switch into Grass-type attacks from Rillaboom and Kartana as well as Ground-types like Landorus-T and Hippowdon for it. Buzzwole in particular is able to switch into Ground- and Grass-types and isn't weak to Knock Off, being able to cover a majority of Victini's weaknesses. Spikes setters such as Skarmory and Ferrothorn can chip down Heatran and Toxapex into range of Victini's attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 114198, "username": "Finchinator"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 349443, "username": "Tysonslayer"}]}
  },
  "Excadrill": {
    "overview": "<p>Excadrill is a versatile threat in the OU metagame thanks to its impressive Attack stat, decent movepool, and access to two useful abilities. On sand teams, Excadrill is a strong sweeper that outspeeds almost every Pokemon in the tier thanks to the Speed boost given by Sand Rush. It also offers defensive utility despite its poor bulk, as it can set Stealth Rock, is one of the few viable users of Rapid Spin, and can deter Volt Switch attempts from Pokemon like Zeraora and Tapu Koko due to its Electric immunity. These traits can allow it to take on a more supportive role, utilizing its useful defensive typing and utility movepool to check Fairy-type Pokemon such as Tapu Koko, Tapu Lele, and Clefable and either set or remove entry hazards depending on the needs of its team. Unfortunately, Excadrill is very frail, and its Speed is mediocre if not boosted by Sand Rush or Rapid Spin, making it easily revenge killed by strong priority moves from Pokemon such as Rillaboom and Urshifu-R as well as by faster Pokemon like Garchomp and Kartana. It is easily walled by common physically defensive Pokemon like Slowbro, Corviknight, and Skarmory, leaving offensive sets heavily reliant on support from teammates to successfully sweep. The Sand Rush set also suffers from poor defensive synergy with both viable sand setters, sharing weaknesses with both Tyranitar and Hippowdon.</p> ",
    "comments": "<h1>Other Options</h1> <p>On hyper offensive teams, Excadrill can be used as a suicide lead entry hazard setter with Stealth Rock, Rapid Spin, and Steel Beam, but it is typically outclassed in this role by Landorus-T, which can utilize a powerful Explosion, and Mew, which is faster and has access to Spikes and Taunt. Excadrill can use some alternative items to Leftovers. For example, Heavy-Duty Boots allows Excadrill to switch in without taking damage from entry hazards, which can be helpful if using Rapid Spin. However, Excadrill is already immune to Toxic Spikes and resistant to Stealth Rock, meaning that the chip damage is not usually significant. An Air Balloon is another item that can be used on Sand Rush variants to allow Excadrill to set up against some Ground-types like Hippowdon, Garchomp, and Landorus-T that would usually force it out, but it isn't useful otherwise, and Excadrill will be unable to take advantage of its defensive typing if it wants to keep its item intact. Additionally, Excadrill is worn down more quickly without the passive recovery of Leftovers. High Horsepower can be used over Earthquake on either set to avoid having Excadrill's strongest STAB move weakened by Grassy Terrain, although in other situations its reduced power and imperfect accuracy can be undesirable.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Corviknight and Skarmory are the best counters to Excadrill, resisting its STAB moves and being immune to Toxic. Zapdos also resists Excadrill's STAB moves but must watch out for Rock Slide and Toxic. Corviknight and Zapdos also are able to remove Stealth Rock against utility Excadrill.</p> <p><strong>Physically Defensive Walls: Many physically defensive Pokemon like Slowbro, Tangrowth, Hippowdon, and defensive variants of Landorus-T and Garchomp are able to switch into Excadrill's attacks and force it out with their STAB moves. All of them can be worn down if Excadrill hits them with Toxic, though, and if Excadrill carries an Air Balloon, it can potentially set up on the Ground-types.</p> <p><strong>Revenge Killers: Rillaboom easily revenge kills Excadrill with its priority Grassy Glide, and it is of particular annoyance because Grassy Terrain weakens Earthquake. Urshifu-R and Weavile can also revenge kill it with Aqua Jet and Ice Shard, respectively, and many other Pokemon faster than Excadrill outside of sand can OHKO it, such as Volcarona and offensive Garchomp. However, none of these Pokemon can switch directly into Excadrill safely, and Sand Rush Excadrill under sand beats most revenge killers lacking priority moves.</p> ",
    "sets": [
      {
        "name": "Sand Rush",
        "description": "<p>If your team has other reliable forms of entry hazard removal, Rock Slide can be used over Rapid Spin to provide coverage for some Pokemon that resist Excadrill's STAB moves, such as Zapdos and Mandibuzz. Swords Dance allows Excadrill to take advantage of forced switches and Pokemon it walls like Tapu Koko. Alternatively, Toxic can be used to cripple walls that can otherwise switch into Excadrill with ease, such as Slowbro and Tangrowth. A Jolly nature is used to allow Excadrill to outspeed Timid Nidoking, Timid Heatran, and Modest Kyurem outside of sand. Leftovers makes Excadrill harder to wear down so it can find more opportunities to sweep.</p> <p>Sand Rush Excadrill fits exclusively with either Tyranitar or Hippowdon to set sand. Specially defensive Tyranitar in particular can set Stealth Rock for it and check threats to it such as Zapdos. Hippowdon is an alternative sand setter that can switch into opposing Excadrill and also set Stealth Rock. It has better longevity due to its reliable recovery but is more passive than Tyranitar. Dracozolt can be added to this sand core to break through walls Excadrill struggles against like Mandibuzz, Slowbro, and Corviknight. If Excadrill is running Toxic, it can lure in and cripple some of Dracozolt's checks like Hippowdon and Landorus-T, making it easier for Dracozolt to beat them. Garchomp can lure in and weaken Zapdos and Corviknight with Stone Edge and Fire Fang, respectively, to ease Excadrill's sweep, and it can wear down Water- and Grass-types like Slowbro and Tangrowth that check Excadrill. Mandibuzz, Corviknight, and Skarmory are consistent checks to Rillaboom, which sand cores typically struggle against, as well as Ground-types like Garchomp and opposing Excadrill. The former two can also remove entry hazards, allowing Excadrill to run Rock Slide over Rapid Spin more freely, while Skarmory is of particular note, as it is able to set Spikes, which is particularly effective at chipping Excadrill's checks down into its KO range.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>With these Special Defense EVs, Excadrill can take full advantage of its defensive typing to check special attackers such as Clefable lacking Flamethrower and Tapu Koko. Stealth Rock is usually the best choice for the third move, as Excadrill can pressure many entry hazard removers with the combination of its STAB moves and Toxic, like Tornadus-T and Mandibuzz. If Excadrill's team already has a Stealth Rock setter, it can instead use Rapid Spin to remove entry hazards. Toxic is typically preferred to cripple Pokemon that do not mind Excadrill's attacks such as Landorus-T and Slowbro. Swords Dance can be used instead to allow Excadrill to sweep late-game and take advantage of Pokemon it checks. It works especially well with the Speed boost of Rapid Spin. Swords Dance does, however, make Excadrill easier to wall without Toxic to punish its checks. Mold Breaker is the chosen ability for this set, as it allows Excadrill to use Earthquake more freely by ignoring Levitate from Pokemon like Hydreigon and Latios. Although it may seem unusual to use Special Defense EVs over HP EVs on a defensive set, they are most optimal for maximizing Excadrill's special bulk due to its already high base HP and low base Special Defense.</p> <p>While Excadrill's typing gives it many useful resistances, it also leaves it vulnerable to common types in the metagame such as Water, Ground, and Fighting. Consequently, a good defensive backbone for it is required. Pokemon like Corviknight, Tornadus-T, and Tangrowth are good teammates, as they can check Ground-types for it. The former two can also provide entry hazard removal, allowing Excadrill to run Stealth Rock over Rapid Spin more freely. Clefable and Toxapex are solid checks to Fighting-types like Hawlucha and Urshifu-R. They also benefit from Excadrill's ability to check Pokemon like Tapu Koko and prevent strong wallbreakers like Tapu Lele from freely using their strongest moves. If Excadrill is using Stealth Rock, it often draws in entry hazard removers like Zapdos, Corviknight, and Mandibuzz. Consequently, Pokemon that can take advantage of them like Tapu Koko are good teammates. On the other hand, if Excadrill is using Rapid Spin, many offensive Pokemon appreciate being able to pivot in and out of battle more freely, such as Urshifu-R and Choice Specs Dragapult.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 114198, "username": "Finchinator"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Quality checked by", "members": [{"user_id": 513717, "username": "airfare"}, {"user_id": 360720, "username": "ausma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 546123, "username": "TailGlowVM"}]}
  },
  "Conkeldurr": {"sets": [{"name": "Guts"}]},
  "Seismitoad": {"sets": [{"name": "Rain Wallbreaker"}]},
  "Reuniclus": {"sets": [{"name": "Calm Mind"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 144451, "username": "Mannat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}},
  "Amoonguss": {"sets": [{"name": "Defensive", "description": "<p>Regenerator in tandem with solid defensive stats and typing makes Amoonguss a fine defensive pivot and a nice check to the likes of Clefable, Zeraora, and Rillaboom. Since it has access to all of Spore, Toxic, and Stun Spore, it is not easy to switch into either. It fits best on balance teams looking for a sturdy check to Zeraora. Slowbro is one of Amoonguss's most common partners to form a Regenerator core, and it is able to check threats like Excadrill and Alakazam.</p> "}]},
  "Ferrothorn": {
    "overview": "<p>Ferrothorn excels as a Spikes setter thanks to the combination of its solid Grass / Steel defensive typing, great defensive stats, and wide utility movepool, which lets it pressure common forms of entry hazard control such as Zapdos and Tornadus-T with Knock Off. Ferrothorn's typing also lets it deter attackers such as Tapu Koko, Tapu Lele, and Melmetal. Spikes is Ferrothorn's main attribute, slowly chipping down checks as well as offensive threats such as Tapu Lele and Tapu Koko with the support of Knock Off. Additionally, Iron Barbs is useful to punish pivots that try to generate momentum such as Landorus-T and Rillaboom. However, Ferrothorn has a glaring 4x weakness to Fire, which means that it is immediately forced out by Fire-types and Pokemon carrying Fire-type coverage such as Dragapult and Nidoking. It also struggles against Pokemon carrying Fighting-type coverage moves such as Tornadus-T and Tapu Lele, which it would otherwise be able to check comfortably. Ferrothorn is almost completely useless against Regenerator cores such as Toxapex + Tangrowth and Toxapex + Tornadus-T, as they can easily shrug off Ferrothorn's chip damage and PP stall it. Furthermore, Ferrothorn is very easily worn down due to its reliance on Leech Seed and Leftovers to make up for its lack of reliable recovery, which makes it susceptible to wallbreakers such as Kartana and Rillaboom and Knock Off users such as Toxapex and Clefable that can threaten it over time.</p> ",
    "comments": "<h1>Other Options</h1> <p>Thunder Wave can be run to disrupt pivots and wallbreakers such as Tornadus-T and Kartana. Body Press is an option that lets Ferrothorn dish out super effective damage to Pokemon such as Heatran, Hydreigon, and opposing Ferrothorn, although forgoing Power Whip makes Ferrothorn a significantly worse check to Pokemon like Slowking and Tapu Fini. Gyro Ball is another alternative to Power Whip that lets Ferrothorn deal more damage to faster foes such as Tapu Koko, Tornadus-T, and Latios. Protect can be used to stall turns and gain extra recovery while scouting Choice-locked Pokemon such as Clefable, Tapu Fini, and Latios.</p> <h1>Checks and Counters</h1> <p><strong>Fire-type Pokemon and Coverage: Heatran and Volcarona are extremely threatening to Ferrothorn, as they OHKO it with their STAB moves; however, they cannot safely switch in because of a potential Knock Off or Thunder Wave. Thanks to the prevalence of Ferrothorn, there are plenty of Pokemon that choose to run Fire-type coverage for it such as Calm Mind Clefable, Choice Specs Dragapult, and Nidoking.</p> <p><strong>Fighting-type Pokemon and Coverage: Fighting-types such as Urshifu-R and Buzzwole can easily pressure Ferrothorn with their STAB moves, but the former struggles to switch into it. Pokemon like Rillaboom, Tapu Lele, and Zeraora often run Fighting-type coverage to pressure Ferrothorn.</p> <p><strong>Strong Wallbreakers: Swords Dance Landorus-T, Garchomp, and Kyurem threaten Ferrothorn with their STAB moves, although they must be wary of being worn down by Knock Off; the former two also need to set up in order to pressure it. Ferrothorn can also be overwhelmed by the Pokemon it is meant to check such as Tapu Lele and Melmetal.</p> <p><strong>Item Removal: Ferrothorn is reliant on Leftovers, as it is one of its main sources of recovery. It often must avoid Pokemon that carry Knock Off or can remove its item such as Landorus-T, Clefable, and Choice Scarf Tapu Fini to maintain its longevity.</p> <p><strong>Burn</strong>: Ferrothorn is prone to being vulnerable by Pokemon it checks such as Toxapex and Slowking, as it makes Ferrothorn much more passive and removes its ability to recover health, which prevents it from reliably checking its intended targets.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Ferrothorn is the best Spikes setter in the tier thanks to its ability to threaten common forms of entry hazard control like Zapdos, Tornadus-T, and Mandibuzz with Knock Off. Alternatively, Stealth Rock can be used over Spikes if your team lacks a Stealth Rock setter; however, Ferrothorn will have a harder time breaking through defensive cores. Leech Seed is Ferrothorn's main source of recovery and is particularly helpful because it makes Ferrothorn, which is usually a passive Pokemon, much harder to switch into. Maximum HP and Defense investment allows Ferrothorn to check Weavile, Zeraora, Melmetal, and other physical attackers well.</p> <p>Ferrothorn fits on balance and bulky offense teams that appreciate the defensive utility it provides as a Spikes setter. Wallbreakers such as Dragapult, Kyurem, and Nidoking appreciate the entry hazards Ferrothorn sets up and can pressure revenge killers such as Zeraora and Weavile. Clefable and Heatran both have great defensive synergy with Ferrothorn, as they can wear down common checks such as Corviknight. They, alongside other Stealth Rock setters such as Landorus-T, can also help Ferrothorn by allowing it to run Spikes. It's incredibly important to provide checks to Fire-type Pokemon such as Heatran and Volcarona, as Ferrothorn is extremely vulnerable to them. Therefore, Pokemon like Tapu Fini and Garchomp are fantastic partners for it. Fast pivots such as Tornadus-T and Tapu Koko provide VoltTurn support and retain momentum against Pokemon like Corviknight and Mandibuzz, which only fear Knock Off from Ferrothorn, while benefiting from it setting up Spikes to further pressure their defensive switch-ins like Heatran and Galarian Slowking. They can also give Ferrothorn opportunities to set up entry hazards and utilize Knock Off more reliably after pivoting against its checks such as Corviknight and Zapdos. Rain teams also deserve a special mention, as they have formidable synergy with Ferrothorn; Ferrothorn provides Spikes support to wear down the opposing team for rain wallbreakers like Kingdra, Seismitoad, and Barraskewda, it acts as a great check to many Pokemon that threaten rain teams such as Tapu Koko and Rillaboom, while rain reduces its weakness to Fire.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 513717, "username": "airfare"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 430787, "username": "PA"}]}
  },
  "Haxorus": {"sets": [{"name": "Swords Dance"}]},
  "Bisharp": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}], "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 344575, "username": "Twilight"}]}, {"name": "Quality checked by", "members": [{"user_id": 295110, "username": "Ruft"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 185591, "username": "TDK"}, {"user_id": 144451, "username": "Mannat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 122460, "username": "Mafeking"}]}], "writtenBy": []}},
  "Mandibuzz": {
    "overview": "<p>Mandibuzz's typing separates it from other defensive Flying-types through its ability to check Dragapult. Its great bulk and access to Roost also allow it to check common threats like Rillaboom and Kartana. It is a good Defog user, with Foul Play pressuring common Stealth Rock users like Landorus-T and defensive Garchomp, although it loses to them in the long run due to their moves like Toxic and Knock Off. Foul Play also discourages physical wallbreakers like Rillaboom, Kartana, Dragapult, and Excadrill from setting up. Since it is reliant on Heavy-Duty Boots, Pokemon that it otherwise reliably checks, like Kartana and Rillaboom, can pressure it more effectively after using Knock Off. Due to the number of threats it can check, it can often be overwhelmed during the course of a match, which forces it to use Roost very often. Its reliance on Foul Play to check certain threats can leave it rather passive as well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Mandibuzz with Toxic over Defog can work on teams with pre-existing forms of entry hazard control. This set is very good at annoying and punishing opposing Mandibuzz, Kyurem, Tapu Koko, and Zapdos, which can take advantage of it switching in. Whirlwind can be a good choice over U-turn to stop Mandibuzz from being setup fodder against sweepers like Volcarona, Tapu Fini, and Reuniclus. Taunt is also a good option over U-turn, since it can also prevent setup and stop Pokemon from setting entry hazards on Mandibuzz; it additionally allows Mandibuzz to win PP wars even though common entry hazards like Stealth Rock and Spikes have more PP than Defog. However, without U-turn, Mandibuzz becomes a lot more passive and can be taken advantage of by Pokemon like Tapu Koko and Kyurem.</p> <h1>Checks and Counters</h1> <p><strong>Offensive Electric-types: Offensive Electric-types like Zeraora and Tapu Koko can force out and pressure Mandibuzz very well with their STAB moves, and Tapu Koko can switch in for free, but Zeraora dislikes Foul Play.</p> <p><strong>Offensive Ice-types: Offensive Ice-types like Kyurem and Weavile can threaten to KO or set up on Mandibuzz, as they force it out and can find opportunities to switch in as it uses Defog. However, both of them dislike switching into Knock Off.</p> <p><strong>Status: Pokemon that Mandibuzz can check like Excadrill, Landorus-T, and defensive Garchomp often carry Toxic, which they can use as it pivots in, hurting its longevity. Toxic also forces it to use Roost more often, which can deplete its PP more quickly and give it less opportunities to use Defog. Other status conditions like burn and paralysis, especially from Dragapult, can hurt its ability to check threats as well. Status chip damage, along with weaker attacks like U-turn from the likes of Landorus-T and Rillaboom, can be enough to overwhelm Mandibuzz.</p> <p><strong>Knock Off: Some Pokemon that Mandibuzz is able to check like Landorus-T, Rillaboom, and Kartana carry Knock Off, which is extremely detrimental because it can be left unable to wall certain threats after Stealth Rock damage.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Mandibuzz operates best as a mixed defensive Pokemon to check a plethora of threats like Rillaboom, Kartana, and Dragapult. Foul Play enables it to threaten Swords Dance users like Garchomp, Rillaboom, Excadrill, and Kartana while also discouraging them from setting up. Roost gives it longevity to better check threats like Dragapult and Choice Band Rillaboom, which would easily overwhelm Mandibuzz otherwise. U-turn lets it keep up momentum and pivot out on its checks like Kyurem and Tapu Koko to safely bring in its teammates. Knock Off can be a good choice instead to immediately punish its switch-ins. The EVs are used to survive two Draco Meteors from Choice Specs Dragapult and two Smart Strikes from Choice Band Kartana. The remaining EVs are put into Speed to outspeed Azumarill.</p> <p>Landorus-T makes a good partner, since it can help alleviate pressure by covering physical threats like Excadrill and Garchomp that Mandibuzz can struggle with. Mandibuzz can also do the same for Landorus-T by checking offensive Grass-types like Kartana and Rillaboom. Similarly, Slowking can handle special threats that Mandibuzz can struggle with, like Nidoking and Tapu Lele. Mandibuzz also offers Slowking a switch-in to Ghost-type moves from threats like Dragapult. Mandibuzz's ability to lure in Tapu Koko and Kyurem and pivot on them can let Dragapult threaten a KO on them, and Dragapult also likes it switching into opposing Dragapult. Wallbreakers like Kyurem and Nidoking that have a difficult time switching in can take advantage of Mandibuzz's slow pivoting.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 415305, "username": "Katy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 526987, "username": "Abhi"}]}
  },
  "Hydreigon": {
    "overview": "<p>Hydreigon's high Special Attack and wide movepool give it unique power to punch holes by threatening common defensive Pokemon such as Slowking, Heatran, and defensive Landorus-T. This is further complemented by its decent Speed allowing it to outpace common offensive Pokemon such as offensive Landorus-T, Kyurem, and Tapu Lele. On top of all this, Hydreigon's defensive typing, ability, and Roost let it check Heatran extremely effectively and come in on slower defensive Pokemon such as Toxapex and Slowking with ease. However, although Hydreigon has passable Speed, it is still outpaced and OHKOed by common Pokemon such as Dragapult, Weavile, and Tapu Koko. It will also often be checked by some Pokemon such as Fairy-types, which it struggles to break through without Flash Cannon, and Blissey, which it can't do much to without Nasty Plot boosts.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hydreigon's movepool has options to cover certain defensive Pokemon at the cost of the neutral coverage its listed options provide; for instance, Superpower lets Hydreigon lure in Blissey and 2HKO it. Choice Scarf Hydreigon is a decent offensive pivot with U-turn and can also function as a revenge killer, but it oftentimes doesn't want to be locked into any of its attacks. Substitute improves Hydreigon's matchup versus offensive teams, as it eases prediction when forcing switches, as well as scouting Choice Scarf users such as Landorus-T. Substitute also allows Hydreigon to shield itself from status effects from Pokemon such as Toxapex. A bulkier set with Defog is a viable option to check Heatran even better, as well as other Pokemon such as Blacephalon, but it is passive and overall very niche.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Hydreigon's 4x weakness to Fairy makes Pokemon of this type solid checks to it. Clefable and Tapu Fini can survive any attack from full health and OHKO or heavily damage Hydreigon in return; however, Clefable is OHKOed by +2 Flash Cannon, and Tapu Fini can become too worn down to be able to pivot into Hydreigon's attacks. Rarer Unaware Clefable sets tend to check it better. Tapu Koko easily outspeeds Hydreigon and OHKOes it, although it can't pivot into Earth Power. The rarer Choice Scarf Tapu Fini also outpaces Hydreigon and OHKOes it.</p> <p><strong>Blissey: Blissey can tank just about any attack Hydreigon uses, up to a +4 Life Orb Draco Meteor, and cripple it with status or use Teleport to gain momentum.</p> <p><strong>Faster Revenge Killers</strong>: Faster Pokemon such as Kartana and Tornadus-T can easily outpace Hydreigon and pick it off if it is chipped a little bit. Weavile can outpace and OHKO Hydreigon, while Zeraora can also pick off a chipped Hydreigon. Common Dragon-types such as Dragapult, Sand Rush-boosted Dracozolt, and Garchomp all outpace Hydreigon. The former two can easily OHKO with Draco Meteor, while Garchomp can potentially OHKO it with Life Orb-boosted Scale Shot.</p> <p><strong>Passive Damage: Hydreigon is prone to being worn down by status effects from Pokemon it commonly pivots against, such as Toxapex and Slowbro. This is also compounded by how often in can pivot into Heatran's Magma Storm. Because of this damage, Hydreigon can be pressured into using Roost too often.</p> <p><strong>Fighting-types: Fighting-types such as Urshifu-R, Hawlucha, and Galarian Zapdos can all pivot into Hydreigon's attacks due to the rarity of Draco Meteor and OHKO it. Pokemon that run Fighting-type coverage, such as Rillaboom and Aegislash, which Hydreigon should be otherwise able to pivot into, threaten it as well.</p> ",
    "sets": [
      {
        "name": "Three Attacks",
        "description": "<p>Dark Pulse's acceptable power and overall solid coverage let Hydreigon consistently pressure Pokemon such as Slowking and Ferrothorn and consistently damage the majority of the tier. Earth Power OHKOes Heatran, hits Toxapex and Melmetal for super effective damage, and hits most Dark-resistant Pokemon neutrally. Flash Cannon provides coverage for Clefable while still hitting Tyranitar for super effective damage. Roost is mandatory to consistently pivot into Pokemon such as the aforementioned Heatran, Toxapex, and Slowking. Draco Meteor can be used over Flash Cannon or Earth Power to heavily dent most Pokemon, better pressure Mandibuzz as well as defensive Dragonite, and OHKO Urshifu-R, although the Special Attack drop usually forces Hydreigon to switch out after. Flamethrower can also be used over either coverage move to better pressure Corviknight. Life Orb is the best item for this set, as it allows Hydreigon to OHKO Heatran as well as 2HKO Clefable and Slowking. However, if your team needs Hydreigon's defensive capabilities, Leftovers lets it stay around longer, pivot into Heatran's Magma Storm more consistently, and negate burn damage from Pokemon such as Toxapex and Slowbro.</p> <p>Grass-types such as Rillaboom and Kartana put both Ferrothorn and Corviknight in 2HKO range of Dark Pulse by using Knock Off as they switch in; in return, Hydreigon offers a consistent switch-in to Heatran, which can be especially helpful if either one of them is Choice locked into a Grass-type move. Zeraora and Dragapult, when paired with Hydreigon, can overwhelm shared checks such as Clefable and Ferrothorn. Steel-types such as Corviknight, Scizor, and Heatran can check Fairy-types and appreciate Hydreigon checking Heatran; Scizor also has the added benefit of checking Kyurem, while Heatran can help overwhelm Tyranitar and Hippowdon. Pivots that can bring Hydreigon safely are solid teammates as well; Tapu Koko can lure in Ground-types such as Landorus-T and Hippowdon and use U-turn to bring Hydreigon in. Corviknight is another U-turn pivot that can lure in Rotom-W and Toxapex for Hydreigon. Slowking and Blissey can also pivot with Teleport, and Slowking can help overwhelm foes with Future Sight in combination with Hydreigon's attacks; the two also have decent defensive synergy with Hydreigon. Toxapex has good defensive synergy with Hydreigon and appreciates it stopping Heatran from trapping it. Clefable appreciates Hydreigon checking Heatran and can even heal status effects from it, like Toxic poison from Heatran and Toxapex, with Aromatherapy.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Nasty Plot grants Hydreigon absurd wallbreaking capabilities, allowing it to fully overwhelm Pokemon such as Scizor and Corviknight. Dark Pulse is the primary attack thanks to its decent coverage and power, hitting Pokemon such as Corviknight, Zapdos, and Landorus-T. Earth Power is a coverage option that immediately threatens Heatran and lets Hydreigon break through Tyranitar after a Nasty Plot boost, although Flash Cannon can potentially OHKO Clefable after a Nasty Plot boost and still hit Tyranitar super effectively. Roost is crucial to help Hydreigon better function as a stallbreaker as well as pivot into Heatran, Toxapex, and Slowbro consistently. Life Orb gives Hydreigon a noticeable boost to its power, allowing it to OHKO Corviknight and Clefable with one boost. However, Leftovers is a viable choice to improve its longevity, as Hydreigon still has decent power after a boost and may appreciate pivoting better and possibly setting up on the aforementioned Heatran and Slowbro. Hydreigon can opt for a Modest nature for more power, hitting benchmarks such as a guaranteed OHKO on Clefable with +2 Flash Cannon, although it loses out on the ability to outpace many notable Pokemon such as Kyurem. Draco Meteor is an option over Earth Power or Flash Cannon, as it has absurd power after a Nasty Plot boost, although its Special Attack drops and lack of coverage hinder it as an option. Focus Blast and Flamethrower are also viable options in that third moveslot to better pressure Ferrothorn as well as either Tyranitar and Blissey or Corviknight, respectively, although they have little use outside of this.</p> <p>Pivots such as Landorus-T and Slowking can lure in Corviknight and Ferrothorn, respectively, to pivot out and bring Hydreigon in. Depending on whether Hydreigon forgoes Earth Power or Flash Cannon, it will be fully checked by either Tapu Koko or Clefable; this makes Galarian Slowking a decent teammate, as it can stomach attacks from these Pokemon. Galarian Slowking can also use Future Sight to punish Steel-type switch-ins such as Corviknight and Ferrothorn. Ironically, Corviknight and Skarmory make for decent teammates, as they can check Garchomp and Kartana; Corviknight, once again, can lure in Pokemon such as Zapdos and bring in Hydreigon with U-turn, while Skarmory can provide Spikes to wear down Hydreigon's checks such as Tapu Fini. Cleaners such as Rillaboom and Weavile appreciate Hydreigon pressuring and softening up common defensive cores such as Corviknight + Slowking early-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 157610, "username": "ScraftyIsTheBest"}]}, {"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 235692, "username": "bb skarm"}]}
  },
  "Volcarona": {"sets": [{"name": "Bulky Quiver Dance"}, {"name": "Offensive Quiver Dance"}]},
  "Terrakion": {"sets": [{"name": "Choice Band"}]},
  "Tornadus-Therian": {
    "overview": "<p>Tornadus-T is one of the best wallbreakers, pivots, and Defoggers in OU because of its Speed tier, coverage options, and amazing ability in Regenerator. It is also one of the premier checks to common Grass-type threats such as Kartana and Rillaboom because it can outspeed them, tank hits from them, and stay healthy with Regenerator, opening up chances to freely remove entry hazards. Regenerator lets Tornadus-T make progress against an opposing team with Knock Off, ignore small amounts of chip damage, and pivot with very little risk while utilizing Heavy-Duty Boots. It can also supports itself and its teammates by using Knock Off to pressure common switch-ins like Zapdos and Galarian Slowking to make wallbreaking easier. However, Tornadus-T can struggle against Electric-types like Tapu Koko, Zapdos, and Zeraora because of their ability to switch in and force it out with super effective STAB moves and, in the former two's case, reliable recovery. It also fears Knock Off from Rillaboom and Kartana, as losing Heavy-Duty Boots reduces Regenerator's effectiveness against Stealth Rock and makes it more difficult to pivot.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tornadus-T can utilize Superpower on its pivot set to bait and punish common specially defensive switch-ins like Tyranitar, Blissey, and Heatran better than Focus Blast. On rain teams, Tornadus-T commonly runs Weather Ball instead of Knock Off on its Nasty Plot sets to consistently hit Heatran and provide a strong, accurate neutral move. It can also run Choice Specs or Life Orb to have more immediate power with the heavy drawback of taking damage from Stealth Rock and not being able to switch moves or taking constant damage with every attack.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Zapdos and Tapu Koko, in particular, are reliable checks to Tornadus-T. They can safely switch in and threaten it with super effective Electric-type moves, have reliable recovery in Roost, and are resistant to most of Tornadus-T's coverage options. Zapdos can also threaten to neutralize Tornadus-T through a Static paralysis on an attempted Knock Off or U-turn. Zeraora can also situationally check it, although its lack of recovery makes it an inconsistent switch-in.</p> <p><strong>Knock Off: Although Tornadus-T is a great check to both Rillaboom and Kartana, it can be gradually weakened over time with entry hazards pressure and Knock Off removing its Heavy-Duty Boots. This may result in it being overwhelmed, especially when facing Choice Band variants.</p> <p><strong>Ice-types: Ice-types like Kyurem and Weavile, if pivoted in safely or revenge killing, can threaten Tornadus-T and force it out if it is unboosted. However, they can be outlasted with hazard pressure and are generally inconsistent checks due to their lack of longevity.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Nasty Plot lets Tornadus-T become an intimidating wallbreaker, giving it the power to break through common specially defensive Pokemon such as Heatran and Ferrothorn with ease. Its Speed tier notably lets it outspeed most unboosted Pokemon in the metagame, including Kartana and other fast offensive threats, making it difficult to revenge kill and easy to sweep with. Focus Blast lets Tornadus-T hit Tyranitar and Steel-type switch-ins such as Heatran super effectively. Knock Off is used as a consistent means of punishing defensive switch-ins like Zapdos, Heatran, and Blissey by removing their item to force progress and make them more vulnerable to other threats in the long run. Heat Wave can be used over Focus Blast or Knock Off for the ability to hit Corviknight harder and its superior accuracy at the expense of hitting Heatran and Tyranitar super effectively and crippling certain switch-ins. Heavy-Duty Boots enables Tornadus-T to pivot in and out freely and maintain offensive pressure on opposing teams, as well as keeping some defensive utility against Pokemon like Rillaboom and Kartana that Tornadus-T is able to situationally switch into.</p> <p>Nasty Plot Tornadus-T fits well on bulky offense and balance teams because of its amazing wallbreaking power and team support through Knock Off, making it versatile throughout a game. Garchomp and Landorus-T are great partners to Tornadus-T because of the pressure they exert on Electric-types such as Zapdos and Tapu Koko that would otherwise freely pivot into Tornadus-T. Stealth Rock and Toxic or Knock Off support from either of these Pokemon can also help Tornadus-T break through these Electric-types more easily. They also appreciate Tornadus-T's pressure on Grass-type checks such as Tangrowth. Nasty Plot + Knock Off Tornadus-T assists Pokemon that struggle to break past specially defensive walls such as Heatran and Galarian Slowking, like Tapu Lele and Calm Mind Clefable. Tornadus-T is especially dangerous when paired with other strong wallbreakers like Tapu Lele and Kartana, as it can overwhelm shared checks like Heatran, Ferrothorn, and Corviknight. Ferrothorn is also a potent defensive partner because of Tornadus-T's ability to cripple Heatran and other switch-ins with Knock Off, making Ferrothorn's entry hazards more useful in steadily chipping walls.</p> "
      },
      {
        "name": "Defog",
        "description": "<p>Tornadus-T's amazing ability in Regenerator, Speed tier, and good typing make it an amazing Defogger and consistent check to Rillaboom and Kartana. Its immense role compression as a Defogger, revenge killer, Grass-type check, pivot, and Knock Off user makes it incredibly versatile and justifiable on almost any team. Knock Off is necessary to remove any form of longevity from common switch-ins, most notably Steel-types such as Ferrothorn, Heatran, and Melmetal. Its ability grants it the longevity to spam Knock Off against defensive Pokemon using Leftovers or Heavy-Duty Boots and pivot with little risk with U-turn on forced switches, clearing the way for teammates to break through walls. Regenerator also gives it more opportunities to use Defog with less fear of chip damage and more pivoting ability.</p> <p>Tornadus-T's ability to consistently pivot makes it very effective on momentum-based VoltTurn cores with Pokemon like Landorus-T and Tapu Koko, especially paired alongside wallbreakers such as Nidoking, Tapu Lele, and Crawdaunt that deal heavy damage when safely switched in. Knock Off's ability to cripple Steel-types and other common specially defensive switch-ins can help specially offensive wallbreakers or sweepers such as Choice Specs Tapu Lele, Calm Mind Clefable, and Tapu Koko win in the long run. Electric-immune Pokemon such as Landorus-T and Garchomp provide insurance against common checks to Tornadus-T like Zapdos and Tapu Koko. They also provide utility with Stealth Rock that will help whittle down teams after items are removed through Tornadus-T's Knock Off. Zeraora can also situationally switch into these Electric-types and appreciates Tornadus-T's U-turn support and pressure on Grass-types like Tangrowth and Amoonguss. Tornadus-T can provide sweeping opportunities for offensive Landorus-T and Garchomp sets by pivoting out of common Steel-type switch-ins like Heatran and Melmetal and letting Landorus-T or Garchomp set up on a forced switch.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 487629, "username": "Zneon"}, {"user_id": 360720, "username": "ausma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 513717, "username": "airfare"}]}
  },
  "Thundurus-Therian": {"sets": [{"name": "Nasty Plot"}]},
  "Landorus-Therian": {
    "overview": "<p>Landorus-T is one of the best Pokemon in the metagame thanks to its expansive movepool and good offensive and defensive stats, which make it incredibly versatile. Its typing, access to U-turn and Stealth Rock, and exceptional ability in Intimidate make it an amazing defensive pivot that can check various physical attackers such as Garchomp, Zeraora, and Excadrill, as well as a reliable Stealth Rock setter. Furthermore, it can be a great wallbreaker or Choice Scarf user thanks to its high Attack and access to EdgeQuake coverage. However, its lack of reliable recovery hurts its ability to check certain Pokemon consistently, as it can get pressured and overwhelmed throughout the game. Additionally, its middling Speed tier leaves it slower than many common Pokemon such as Hydreigon, Tapu Lele, and Kyurem.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Focus Sash set can be used to set up Stealth Rock for hyper offense teams and potentially leave a dent with Explosion. Defensive sets can utilize Defog, as Landorus-T has a favorable matchup against Stealth Rock setters such as Heatran and Tyranitar. However, it's rather inconsistent, especially against entry hazard setters that carry Toxic like Garchomp and opposing Landorus-T. Rocky Helmet can be used on defensive sets to punish contact moves, especially U-turn from Rillaboom, Tapu Koko, and opposing Landorus-T, at the cost of not having a way to maintain health. Soft Sand can be used on Swords Dance sets for more offensive pressure, making it even harder for Pokemon like Slowbro and Hippowdon to keep Landorus-T in check, although this leaves it without passive recovery. Protect can be used on defensive sets to gain extra Leftovers recovery, making Landorus-T harder to wear down. It can also waste Defog PPs from Corviknight, which can otherwise use Pressure to stall out Stealth Rock. Additionally, it can scout Choice-locked attackers like Choice Specs Dragapult and Kyurem, making them easier to play around; however, Landorus-T struggles to fit it over any other moves. A Double Dance set with Rock Polish and Swords Dance can make Landorus-T much harder to check. Although, finding a chance to use both setup moves is difficult, often forcing it to choose between the two. Other Swords Dance sets with moves such as Fly to hit Grass-types like Tangrowth or Gravity to hit Ground-immune targets can be used, but they're rather inconsistent. A Choice Band set can be used to take advantage of Landorus-T's high Attack and strong coverage, although it requires a lot more prediction to pull off.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Slowbro is a great defensive answer to Landorus-T by virtue of its high Defense, which means it can take hits well and retaliate with Scald or Ice Beam, although it dislikes taking a Toxic. Other bulky Water-types such as Rotom-W and Gastrodon can usually take a hit and threaten Landorus-T with their super effective STAB moves, but they struggle against Swords Dance sets and dislike Toxic as well. Offensive Water-types like Urshifu-R, Barraskewda, and Choice Scarf Tapu Fini can easily revenge kill Landorus-T. Urshifu-R is notably good at taking down Substitute variants thanks to Surging Strikes.</p> <p><strong>Corviknight and Skarmory: Thanks to their typing and excellent defensive stats, both of these Pokemon take very little from Landorus-T's attacks and are immune to Toxic. Corviknight can clear Stealth Rock with Defog, use Brave Bird to chip away at Landorus-T, or use U-turn to pivot out into a teammate. Skarmory can set up its own entry hazards, threaten Landorus-T with Toxic, or use Iron Defense to make tanking hits easier and be one of the best counters to Swords Dance sets.</p> <p><strong>Grass-types</strong>: Tangrowth can easily wall Landorus-T due to its typing and good Defense; Ferrothorn can also take a hit from Landorus-T, although it struggles against Swords Dance variants. They can both use Knock Off or wear down Landorus-T with their STAB moves and Leech Seed. Rillaboom can revenge kill offensive Landorus-T with Grassy Glide and also summon Grassy Terrain to lower Earthquake's damage, but it dislikes switching into U-turn or Toxic from other sets.</p> <p><strong>Strong Special Attackers: Landorus-T's mediocre special bulk means it can easily be KOed by special attackers such as Tapu Lele, Dragapult, and Latios.</p> <p><strong>Ice-type Pokemon and Coverage: Ice-types such as Kyurem and Weavile can outspeed non-Choice Scarf Landorus-T and easily OHKO it. Ice-type coverage like Ice Beam from Nidoking and Galarian Slowking is also problematic for Landorus-T.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Defensive Landorus-T is a great Stealth Rock setter by virtue of its good typing and Intimidate, which help it switch into many physical attackers including Garchomp and Excadrill to sponge hits. U-turn allows it to safely pivot out against checks like Corviknight, Hippowdon, and opposing Landorus-T as well as keep up momentum during a match. Knock Off cripples any Pokemon that switches in by removing their item; this makes Landorus-T much more annoying to switch into. Removing Heavy-Duty Boots from Pokemon like Tornadus-T, Zapdos, and Mandibuzz is especially useful, as it leaves them vulnerable to Landorus-T's Stealth Rock. Toxic is an alternative that cripples Pokemon like Tangrowth, Slowbro, and opposing Landorus-T. It's also especially useful for pressuring Defoggers such as the aforementioned Tornadus-T and Mandibuzz. Leftovers provides Landorus-T with passive recovery, which somewhat mitigates its problem with longevity. 92 Speed EVs are used to outspeed Bisharp and specially defensive Heatran as well as positive-natured base 60s such as Magnezone and Aegislash.</p> <p>Slowking can switch into strong special attackers such as Tapu Lele and Latios that easily overwhelm Landorus-T. It also generally covers Landorus-T's Water and Ice weaknesses. Similarly, Slowbro can also cover these weaknesses while also alleviating some of the pressure from Landorus-T in checking physical attackers like Garchomp and Excadrill. Bulky Steel-types like Corviknight and Ferrothorn are good partners, as they can take on the aforementioned Psychic-types. Bulk Up Corviknight can also alleviate pressure against physical attackers like Garchomp, Kartana, and Rillaboom, while Ferrothorn is a good Water-resistant teammate that can form a hazard-stacking duo with Landorus-T. Furthermore, Landorus-T can cripple Bulk Up Corviknight's checks such as Zapdos and Slowbro with Knock Off or Toxic. Offensive Pokemon such as Dragapult and Choice Specs Kyurem appreciate being brought in safely by Landorus-T's U-turn, especially against switch-ins like Slowbro and Tangrowth. They also appreciate its Stealth Rock support and ability to cripple their defensive answers with Knock Off or Toxic. Weavile is another good teammate that appreciates being brought in safely by U-turn against Landorus-T's switch-ins, such as Tornadus-T and Zapdos, to get a chance to set up or freely throw out an attack.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Landorus-T's ability in Intimidate and capability of forcing switches against Pokemon like Heatran and Galarian Slowking give it opportunities to set up with Swords Dance, allowing it to act as a dangerous wallbreaker that can easily overwhelm defensive Pokemon such as Clefable and Ferrothorn. Stone Edge is an amazing coverage move that hits Earthquake-immune targets such as Tornadus-T, Zapdos, Hydreigon, and Corviknight. Substitute eases prediction and allows Landorus-T to avoid Toxic and Leech Seed from Pokemon like Hippowdon and Ferrothorn. Alternatively, it can use Stealth Rock to take advantage of the switches it forces as well as its ability to threaten most entry hazard removers. While Leftovers provides passive recovery to keep Landorus-T healthy, Salac Berry is an alternative that gives it the chance to clean late-game and works well with Substitute, although it can only be used once and in certain situations, so it's often inferior.</p> <p>Offensive Pokemon like Kartana and Weavile work well with Landorus-T, as they can wear down or remove each other's checks like Corviknight and Rotom-W with coverage moves. This Landorus-T set appreciates VoltTurn support, so it pairs well with Pokemon like Tornadus-T and Tapu Koko that often force in the likes of Heatran, Galarian Slowking, and Blissey, which they can safely pivot against to bring Landorus-T in. Late-game cleaners such as Scale Shot Garchomp and Swords Dance Scizor take advantage of the significant damage Landorus-T does against most defensive answers. Landorus-T can also be used on hyper offense teams with dual screens support from Pokemon like Tapu Koko and Regieleki. They can also bring it in safely by using U-turn against Pokemon like Galarian Slowking and Excadrill in the former's case, or by using Explosion in the latter's case.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 402001, "username": "DKM"}]}
  },
  "Keldeo": {"sets": [{"name": "Calm Mind"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 240732, "username": "Astra"}]}},
  "Aegislash": {"sets": [{"name": "Mixed Wallbreaker"}]},
  "Hawlucha": {
    "overview": "<p>Hawlucha stands as a good late-game cleaner on hyper offense or dual screens teams thanks to the combination of Swords Dance, Unburden, and its powerful STAB combination. When Unburden is activated, Hawlucha turns into a fearsome cleaner because of its unparalleled Speed tier, which allows it to outpace all Pokemon in the metagame and makes it hard to revenge kill without priority. However, Hawlucha is frail, even with the Defense boost provided by its Terrain Seed, so it can only set up on Pokemon that it can force out or take a hit from, like Kartana. It also has problems with breaking through some common walls like Toxapex, Slowbro, and Skarmory, even after a Swords Dance boost, and it can get heavily crippled by status or chip damage. Lastly, Hawlucha heavily relies on its teammates and their survival to accomplish its role, meaning it will be dead weight until late-game.</p> ",
    "comments": "<h1>Other Options</h1> <p>Substitute is a possible option over Stone Edge or Taunt to avoid status effects like burn and poison from walls like Toxapex and Hippowdon; this also allows Hawlucha to tank some weak attacks and gives it more setup opportunities. However, Hawlucha hates losing these moves, as it has a bigger pool of checks and counters without them, like Zapdos and Skarmory.</p> <h1>Checks and Counters</h1> <p><strong>Physical Walls: Physical walls, such as Toxapex, Slowbro, Skarmory, and Zapdos, can take all of Hawlucha's attacks and retaliate back. Toxapex can reset its boosts with Haze and burn or poison it, Slowbro can eliminate it with Future Sight and Scald, Skarmory can win one-on-one, and Zapdos can paralyze it with Static and OHKO with its STAB moves, only fearing a boosted Stone Edge. Aegislash deserves a special mention, since it resists all Hawlucha's attacks and can decimate it with its own.</p> <p><strong>Status: All status ailments can severely cripple Hawlucha, as they can halve its Attack or Speed, slowly chip it down, or shut it down completely. Some of its checks, like Slowbro and Toxapex, can also cripple it with Scald burns or poison, hindering its ability to sweep.</p> <p><strong>Opposing Terrain</strong>: As Hawlucha relies on Terrains to start its sweep, Tapu Lele, Tapu Fini, Tapu Koko, and Rillaboom are roadblocks to it, as they can force Hawlucha out after switching in. Tapu Koko can also tank all of Hawlucha's attacks, even if it's boosted, while Tapu Fini can only stomach one attack and fire back.</p> ",
    "sets": [
      {
        "name": "Unburden Sweeper",
        "description": "<p>Swords Dance turns Hawlucha into a fearsome cleaner when combined with the Speed boost provided by Unburden. Stone Edge allows it to break through Zapdos and Tornadus-T, which otherwise could wall it; however, Taunt allows it to defeat certain walls, like Toxapex, Quagsire, and Hippowdon, by disabling their recovery moves at the cost of losing against the aforementioned Flying-types. Hawlucha's item is interchangeable depending on its teammates; on hyper offense teams, Hawlucha should run Grassy Seed, while on dual screens teams Electric Seed should be the choice. The Defense boost also allows it to set up more freely against threats like Kartana and Garchomp. The given EV spread allows Hawlucha to outspeed Excadrill in sand after Unburden activates, as well as revenge killing threats like +1 Volcarona if needed. The rest of the EVs are put into Special Defense to increase chances to survive Clefable's Moonblast after Stealth Rock.</p> <p>Hawlucha should always be used in tandem with Tapu Koko or Rillaboom, as their abilities activate its item and therefore Unburden. Rillaboom provides a strong wallbreaker that shares checks with Hawlucha, like Tornadus-T and Zapdos, so they can overwhelm them together. However, Tapu Koko acts as an offensive pivot that can set up screens and deal with walls like Toxapex and Slowbro, as well as bringing in Hawlucha against would-be setup fodders like Ferrothorn with U-turn. As Hawlucha only has one opportunity to clean, it appreciates having all of its checks removed or chipped into KO range; this makes Knock Off support from Kartana and Weavile very valuable, as they can remove items like Heavy-Duty Boots and Leftovers from its checks like Toxapex and Zapdos. Both Kartana and Weavile also share checks with Hawlucha; this allows them to wear them down together and let one clean late-game. They can also pressure some of Hawlucha's checks, like Slowbro and Hippowdon, with their STAB moves. Finally, Dragapult and Hawlucha can form an offensive core that can be hard to manage. Dragapult pressures key targets like Zapdos or Toxapex and forces damage on them with its powerful STAB moves; it can also offer setup opportunities with U-turn, as it gets forced out by Pokemon that Hawlucha wants to use as setup fodder, like Blissey and Tyranitar.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 526987, "username": "Abhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 477937, "username": "Windingsss"}]}
  },
  "Avalugg": {"sets": [{"name": "Physical Wall"}]},
  "Volcanion": {"sets": [{"name": "Wallbreaker"}]},
  "Primarina": {"sets": [{"name": "Choice Specs"}, {"name": "Substitute + Calm Mind"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 443485, "username": "curiosity"}, {"user_id": 295110, "username": "Ruft"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 208105, "username": "Jho"}, {"user_id": 173240, "username": "Martin"}]}},
  "Toxapex": {
    "overview": "<p>Toxapex is one of the best defensive Pokemon in the OU metagame. With its amazing defenses, great defensive typing, wide support movepool, reliable recovery, and Regenerator, Toxapex is both very hard to wear down and able to check common metagame threats such as Melmetal and Scizor. Thanks to these qualities, Toxapex is able to fit on numerous balance and stall teams as a defensive pivot. Its high number of utility options allow Toxapex to wear down and cripple many of the metagame's top threats such as Mandibuzz, Ferrothorn, and Heatran, making it a hard Pokemon to switch into despite being a defensive Pokemon. Toxapex unfortunately has trouble exerting offensive pressure due to its underwhelming offensive stats; therefore, its only ways of making progress will be spreading status such as poison and burn and removing items with Knock Off.</p> ",
    "comments": "<h1>Other Options</h1> <p>Poison Jab allows Toxapex to hit Tapu Fini for consistent damage, which would potentially beat Toxapex with a Calm Mind set otherwise. Shed Shell can be used to prevent being trapped by Magma Storm Heatran, which would otherwise beat Toxapex due to the combination of Magma Storm, Earth Power, and Taunt. Block can be used alongside Spite to both trap PP stall opposing Toxapex, crippling them significantly throughout the course of the game. Toxapex can use an alternative spread of 252 HP / 144 Def / 112 SpD to take hits from Tornadus-T much better while avoiding the OHKO from Timid Nidoking's Earth Power. It can use a Relaxed nature in order if it's using both Scald and Knock Off on the same set.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Latios and Tapu Lele can threaten out and overwhelm Toxapex with their STAB moves; however, none of them want to switch into a Toxic, Scald, or Knock Off.</p> <p><strong>Electric-types: Tapu Koko and Zapdos are examples of Pokemon that can threaten to OHKO Toxapex or deal serious damage to it. Zapdos in particular can remove Toxapex's Toxic Spikes; however, both need to be cautious of being heavily crippled by status effects or item removal.</p> <p><strong>Ground-types: Ground-type Pokemon such as Garchomp, Landorus-T, and Nidoking can deal heavy damage against it with their STAB moves; however, all of them can be worn down with Scald, and the former two can be potentially crippled by a burn, which can make them much less effective throughout the course of the game.</p> <p><strong>Taunt: Taunt is very detrimental to Toxapex, as it can be effectively shut down; Taunt users such as Tapu Fini and Heatran can render Toxapex useless and easily take advantage of it by using it as setup fodder in Tapu Fini's case or outright eliminate it through trapping in Heatran's case.</p> <p><strong>Future Sight</strong>: Future Sight can be troublesome for Toxapex. Slowbro, Slowking, and Galarian Slowking can open the door for wallbreakers such as Choice Band Melmetal and Kartana with a Future Sight, as Toxapex will be overwhelmed by the combination of Future Sight damage and their attacks.</p> ",
    "sets": [
      {
        "name": "The Pex",
        "description": "<p>Scald allows Toxapex to heavily damage Pokemon such as Landorus-T and Nidoking and potentially burn and cripple foes such as Garchomp and Ferrothorn, while Knock Off allows Toxapex to cripple Heavy-Duty Boots and Leftovers users such as Zapdos, Tornadus-T, and Heatran that may switch into it. Haze prevents Toxapex from being used as setup fodder by Pokemon like Dragonite, Calm Mind Clefable, Volcarona, and Suicune. Toxic is great for putting Pokemon such as Slowbro, Tornadus-T, Hydreigon, and Mandibuzz on a timer, allowing Toxapex's offensive teammates to overwhelm them, while Toxic Spikes is an option for wearing down grounded Pokemon like Garchomp, Rillaboom, and Tapu Fini as well as defensive Pokemon like Tyranitar and Tangrowth; unfortunately, it can easily be removed, cannot target vital non-grounded Pokemon like Mandibuzz and Hydreigon, and is often absorbed by Poison-types such as opposing Toxapex and Galarian Slowking, which makes it inconsistent at spreading status. Lastly, Baneful Bunker is great for crippling Pokemon such as Tornadus-T and Rillaboom attempting to pivot against Toxapex and scouting Choice-locked Pokemon such as Choice Scarf Landorus-T and Tapu Lele, as well as potentially racking up additional Black Sludge recovery. Rocky Helmet allows Toxapex to punish Pokemon such as Rillaboom and Kartana while also punishing U-turn attempts from Pokemon such as Corviknight and Dragapult. Black Sludge can be used as an alternative item to gain additional recovery at the end of each turn while also helping Toxapex in Trick scenarios by crippling the Trick user. A Bold nature is generally preferred; however, an Impish can be used if Toxapex uses Knock Off over Scald.</p> <p>Teammates like Dragapult and Rillaboom appreciate Toxapex's ability to spread poison and remove Heavy-Duty Boots and Leftovers from Pokemon like Moltres, Mandibuzz, and Hydreigon. Bulky Steel-types such as Heatran and Ferrothorn can be very useful for Toxapex; Heatran hard checks most of the Psychic-types in the tier, as well as being able to potentially trap and remove them with Magma Storm, whereas Ferrothorn covers Toxapex's Psychic- and Electric-type weakness and appreciates Toxapex covering its Fire- and Fighting-type weakness; in return, and run Knock Off to free up a moveslot on Toxapex for another utility option. Dark-types such as Obstagoon, Hydreigon, and Mandibuzz can be very useful, as they can cover Toxapex's Future Sight weakness, making it less prone to being overwhelmed by it. Setup sweepers such as Suicune are very weak to Toxic Spikes, so they appreciate Toxapex's ability to absorb them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 295110, "username": "Ruft"}, {"user_id": 303291, "username": "lyd"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 232216, "username": "Lumari"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 487629, "username": "Zneon"}]}
  },
  "Kommo-o": {
    "sets": [{"name": "Defensive", "description": "<p>Kommo-o is a pretty solid Stealth Rock setter, capable of pressuring the most common forms of entry hazard removal in Mandibuzz, Excadrill, and Corviknight. Beyond that, it has a very solid matchup against sun teams in general, notably checking Venusaur. Kommo-o fits best on balance teams that need to improve their matchup against sun teams and need a solid Stealth Rock setter. Kommo-o synergizes very well with Wish Clefable, as it is otherwise quickly worn down. It is also important to have counterplay to Clefable, as Kommo-o often baits it into play, so Pokemon like Excadrill and Corviknight are solid teammates.</p> "}],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 344575, "username": "Twilight"}]}, {"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 443485, "username": "curiosity"}, {"user_id": 260369, "username": "TPP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 439341, "username": "Egor"}]}
  },
  "Tapu Koko": {
    "overview": "<p>Tapu Koko is one of the best offensive pivots in the tier thanks to its high Speed, good defensive and offensive typing, and access to Roost, which allow it to reliably check and pressure Pokemon like Tornadus-T and Zapdos. These traits make it a great pick for offensive teams that need innate speed control and a reliable check to fast, offensive Pokemon such as Tornadus-T. However, Tapu Koko has rather underwhelming offensive stats and limited coverage options, meaning that bulky Pokemon such as Ferrothorn and Galarian Slowking can be very problematic. Furthermore, Tapu Koko doesn't have especially good bulk, which means that it'll take a lot of damage from any decently strong attack. Even resisted hits wear it down quickly and can force it to use Roost.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Choice Specs set with Grass Knot to hit bulky Ground-types like Hippowdon and Swampert can be used in order to increase Tapu Koko's offensive potential. However, it's more reliant on prediction and worse at checking Pokemon like Tornadus-T. Dual screens can be used on hyper offense teams to support setup sweepers, but these teams aren't as common or consistent as other teams Tapu Koko is found on. Taunt can be used to help against defensive Pokemon like Blissey and Clefable, although it's hard to justify over Tapu Koko's other moves.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Bulky Grass-types like Ferrothorn and Tangrowth are great answers to Tapu Koko thanks to their bulk and resistance to Thunderbolt. Rillaboom can also threaten to revenge kill Tapu Koko with Grassy Glide after changing the Terrain, although it should be wary of switching into Dazzling Gleam, U-turn, or Toxic.</p> <p><strong>Ground-types: Ground-types such as Landorus-T and Garchomp are immune to Tapu Koko's strongest move and can threaten it out although they dislike taking a Dazzling Gleam or Toxic. Excadrill and Nidoking are notable, as they are immune to or resist Tapu Koko's STAB moves while being immune to Toxic; however, their poor bulk means they can be worn down over time.</p> <p><strong>Specially Defensive Pokemon: Pokemon like Blissey and Assault Vest Galarian Slowking can switch into Tapu Koko by virtue of their high Special Defense. Galarian Slowking can threaten it out with a super effective STAB attack, while Blissey can use Toxic or pivot into a teammate.</p> <p><strong>Revenge Killers: Dragapult, especially its Choice Specs set, can outspeed and threaten to KO Tapu Koko. Choice Scarf users like Landorus-T and Kartana can do the same, although none of these Pokemon can reliably switch in. Priority moves such as Bullet Punch from Scizor and Ice Shard from Weavile can pick off Tapu Koko if it's at low HP.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>Dazzling Gleam is a good secondary STAB move that's safe to use for reliable damage. Additionally, it's super effective against Dragon-types like Hydreigon, Kyurem, and Latios that resist Thunderbolt. It's also the best option for damaging Electric-immune Pokemon such as Landorus-T, Garchomp, and Zeraora. U-turn allows Tapu Koko to reliably pivot against Ground-types like Landorus-T and keep up momentum against switch-ins such as Ferrothorn. Roost allows Tapu Koko to stay healthy throughout a match in order to check Pokemon like Tornadus-T and Zapdos more consistently. Toxic can be used instead of Dazzling Gleam to cripple Pokemon like Landorus-T, Hippowdon, and Tangrowth that can be problematic for Tapu Koko and is especially useful alongside teammates such as Garchomp and Kartana.</p> <p>Tapu Koko is often used on offensively oriented teams. Its ability to keep up momentum is appreciated by a multitude of strong wallbreakers that struggle to find effective opportunities to switch in such as Kartana, Choice Specs Kyurem, and Nidoking, which can be safely brought in via U-turn against the bulky Grass-types like Tangrowth and Ferrothorn that switch into Tapu Koko. Heatran also takes advantage of Grass-types that Tapu Koko forces in, can set Stealth Rock to wear down the opposing team, and use Toxic to cripple Pokemon like Hippowdon and Swampert that wall Tapu Koko. Additionally, it can trap and remove Blissey with the combination of Magma Storm and Taunt. Offensive Grass-types like Rillaboom and Kartana appreciate that Tapu Koko can switch in and take advantage of their defensive checks like Corviknight and Mandibuzz while also being a good answer to Tornadus-T. Furthermore, they can work together to overwhelm other checks like defensive Tangrowth. Landorus-T can set Stealth Rock and use U-turn to bring Tapu Koko in against Pokemon like Corviknight and Slowbro while also being a good check to some opposing Ground-types. Slowbro and Slowking can both use Future Sight and Teleport to help Tapu Koko put pressure on the opposing team, especially against Ground-types that might try to switch into it. They also appreciate that Tapu Koko can handle Zapdos and Nasty Plot Tornadus-T.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 402001, "username": "DKM"}]}
  },
  "Tapu Lele": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Calm Mind"}]},
  "Tapu Bulu": {
    "overview": "<p>Tapu Bulu separates itself from other offensive Grass-types thanks to its high Attack stat, Terrain-boosted Horn Leech, and strong coverage in Close Combat and Stone Edge to break past its would-be checks like Ferrothorn, Zapdos, defensive Dragonite, and Mandibuzz. Its strong defensive typing lets it check Landorus-T, Urshifu-R, and Zeraora. Grassy Terrain provides it with some form of longevity and mitigates Life Orbs recoil; furthermore, many teammates appreciate the passive recovery and weakening of Earthquake. However, Tapu Bulu often struggles to compete with Rillaboom for a team slot, as it offers priority in Grassy Glide and can support its teammates with Knock Off and U-turn. Tapu Bulu's middling Speed tier also gives it issues when setting up against offensive teams and lets many faster threats force it out.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tapu Bulu can run Yache Berry so it can survive an Icicle Crash from Weavile and OHKO back, but its listed items are more useful. It can run a bulky set with maximum HP investment, some defensive investment, and a moveset of Swords Dance / Horn Leech / Close Combat / Synthesis, which allows for a sturdy offensive check to the likes Urshifu-R, Garchomp, Zeraora, and Tapu Koko.</p> <h1>Checks and Counters</h1> <p><strong>Physical Walls: Though Corviknight, Skarmory, and Tangrowth don't like directly switching into Tapu Bulu, they are good checks even when Tapu Bulu is boosted. Corviknight can pressure Tapu Bulu with Brave Bird, while Skarmory can phaze it with Whirlwind. Tangrowth can weaken it with Knock Off and chip it down with Rocky Helmet. However, they can easily be overloaded due to Tapu Bulus high Base Power coverage and boosted strength. Buzzwole is a big roadblock for Tapu Bulu, able to take any hits after a boost and force it out with Ice Punch or recover with Roost.</p> <p><strong>Faster Offensive Threats: Tapu Bulu's Speed tier leaves it vulnerable to faster Pokemon such as Tornadus-T, Volcarona, Kartana, and Weavile, which can force it out.</p> <p><strong>Chip Damage: Stealth Rock and Spikes constantly chip down Tapu Bulu, and its lack of reliable recovery outside of bulky sets makes it get worn down easily. U-turn from Pokemon it otherwise beats such as Landorus-T and Urshifu-R can cause further chip damage, leaving it prone to being overwhelmed in trying to check them. Rocky Helmet and Iron Barbs also wear it down.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Horn Leech is Tapu Bulu's most effective STAB move, as its recovery offsets Life Orb recoil and is very strong under Grassy Terrain. Close Combat allows Tapu Bulu to hit Steel-types such as Heatran and Ferrothorn. Stone Edge is great coverage to hit Pokemon that resist its other moves like Zapdos, defensive Dragonite, and Mandibuzz. Life Orb guarantees OHKOs at +2 on Mandibuzz and defensive Dragonite when Multiscale is inactive. Leftovers is an alternative over Life Orb, as it stacks with Grassy Terrain for better longevity, though the reduced damage is very noticeable. Jolly is the preferred nature to allow it to be faster than defensive Zapdos and neutral nature Rillaboom, but Adamant is also an option for more damage output. An EV spread of 32 HP / 252 Atk / 224 Spe can be used along with an Adamant nature, which makes Tapu Bulu faster than positive nature Aegislash and Magnezone, while the HP gives it an extra point of recovery while Grassy Terrain is up.</p> <p>Tapu Bulu best fits on offense and bulky offense teams in need of a strong wallbreaker that can offensively check the likes of Landorus-T, Zeraora, and Urshifu-R. Heatran takes on Volcarona and Corviknight while also setting Stealth Rock. In return, Tapu Bulu checks Water-types such as Urshifu-R and Slowking while providing Terrain support. Volcarona, Heatran, and Tornadus-T can threaten Tapu Bulu, so switch-ins for them such as Slowking and defensive Dragonite can cover for it while alleviating its pressure to check Urshifu-R. The former is also able to handle faster wallbreakers such as Tapu Lele and Tornadus-T, while the latter is able to provide Tapu Bulu Heal Bell support. Tapu Koko is able to lure in targets that Tapu Bulu takes advantage of like Ferrothorn and Hippowdon and bring it in with U-turn out while providing a great check to Tornadus-T. Magnezone can remove Corviknight and Skarmory so Tapu Bulu doesn't have to force its way past them, and it benefits from Grassy Terrain decreasing the damage of Earthquake. Kartana is a great partner alongside Tapu Bulu, overwhelming teams once Tapu Bulu removes Flying-types like Zapdos, defensive Dragonite, and Mandibuzz with its powerful coverage. Grassy Terrain also complements its Leaf Blade.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 5269867, "username": "Abhi"}, {"user_id": 360720, "username": "ausma"}, {"user_id": 218318, "username": "Clone"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 349443, "username": "Tysonslayer"}]}
  },
  "Tapu Fini": {
    "overview": "<p>Tapu Fini is an excellent defensive presence in the OU metagame thanks to its typing and solid bulk, which allows it to check notable threats such as Weavile, Urshifu-R, Heatran, and Hydreigon. It can use Choice Scarf sets to switch into and threaten Pokemon like Urshifu-R and Dragapult, or it can take advantage of common defensive Pokemon such as Slowking, Toxapex, and Blissey by trapping and eliminating them for its teammates or setting up on them. It also limits the progress of status-spreading Pokemon, such as Dragapult and Toxapex, with Misty Surge and boasts a wide utility movepool including Defog, Taunt, and Knock Off. However, Tapu Fini lacks reliable recovery, meaning it can be worn down very quickly, especially if the common Knock Off removes its Leftovers or it runs Choice Scarf. If it has to check multiple threats, it may therefore need a secondary check to them. Many of the Pokemon it wants to switch into, such as Dragapult and Urshifu-R, carry U-turn to wear it down further. While Tapu Fini has many useful resistances, common faster offensive threats like Rillaboom, Tapu Koko, Kartana, and Zeraora exploit its typing. It faces competition from Slowbro, Slowking, and Toxapex as a defensive Water-type and Clefable as a defensive Fairy-type, which can also utilize Calm Mind sets. However, Tapu Fini differentiates itself with its unique combination of utility options, its rare and valuable ability, and it simultaneously checking Pokemon such as Heatran and Weavile.</p> ",
    "comments": "<h1>Other Options</h1> <p>A more defensive Choice Scarf set with Whirlpool, Moonblast, Nature's Madness, and Trick can be used to trap passive Pokemon similarly to Whirlpool sets, and it still allows Tapu Fini to outspeed and threaten many Pokemon. Such a set should use an EV spread of 252 HP / 116 SpD / 140 Spe with a Calm nature. Tapu Fini can also use a utility set with Knock Off and either Defog or Taunt, but it is usually outclassed by other Defog users like Corviknight and other Water-types like Slowking and Toxapex, which have superior longevity and, in the case of Corviknight, can better pressure most Stealth Rock setters.</p> <h1>Checks and Counters</h1> <p><strong>Galarian Slowking: Galarian Slowking completely walls Tapu Fini and gets an almost completely free Future Sight off or hits it back with Sludge Bomb. However, it can be worn down if its Assault Vest is lost to Trick or Knock Off and doesn't like being Choice locked, though using Trick will limit Tapu Fini heavily, as it will be unable to use non-attacking moves.</p> <p><strong>Revenge Killers</strong>: Common Pokemon like Zeraora, Tapu Koko, Kartana, and Rillaboom can outspeed and deal heavy damage to non-Choice Scarf Tapu Fini, and they survive at least one attack from Choice Scarf sets.</p> <p><strong>Steel-types: Ferrothorn can switch into Tapu Fini and hit it hard with Power Whip or wear it down with Leech Seed, though sets lacking Power Whip can be trapped in and KOed by the Whirlpool set, and it strongly dislikes Trick. While Corviknight doesn't offensively threaten Tapu Fini and hates being burned, it can take its attacks fairly well and pivot into a revenge killer. Melmetal avoids the 2HKO from any move and can 2HKO in return with Double Iron Bash or Thunder Punch. Kartana resists Tapu Fini's STAB moves and can OHKO it with Life Orb- or Choice Band-boosted Leaf Blade, but its horrendous special bulk means Tapu Fini nearly 2HKOes it.</p> <p><strong>Chip Damage: Often, the best way to beat Tapu Fini is to exploit its lack of consistent recovery with chip damage such as Future Sight from Slowbro, Slowking, and Galarian Slowking, which are often paired with Pokemon it wants to check like Urshifu-R and Weavile. Both aforementioned wallbreakers can also wear it down over time with their strong attacks. Knock Off from Pokemon like Weavile and Clefable removing its Leftovers, entry hazards, and U-turn from Dragapult, Urshifu-R, and Corviknight are also effective.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>With a Choice Scarf, Tapu Fini can outspeed and threaten Pokemon like Garchomp, Tornadus-T, and Dragapult. Trick cripples Ferrothorn, Blissey, Galarian Slowking, and Toxapex, which can switch into Tapu Fini's attacks with ease, and this can help teammates break through them. Taunt might look like a strange choice on a Choice item set, but it prevents Toxapex and Slowking from pivoting into it freely and bulky setup sweepers like bulky Volcarona and Dragonite from setting up on it. Defog can be used instead on teams that require situational hazard control. 216 Speed EVs are used to outspeed +1 Dragonite, but the EV spread is customizable; for example, maximum defensive investment can be used if a team has another revenge killer, and Special Attack EVs can allow Tapu Fini to OHKO Pokemon like Weavile and Dragapult.</p> <p>This set fits on offensive teams that do not require Tapu Fini's full defensive utility and appreciate the role compression of a revenge killer, situational switch-in to Pokemon like Dragapult, Urshifu-R, and Weavile, and potential Defogger. Pokemon that take advantage of Tapu Fini's ability to lure in and cripple Galarian Slowking, Blissey, and Toxapex, such as Volcarona and Nasty Plot Tornadus-Twhich also help against Rillaboom and Kartanaare ideal teammates. Ferrothorn can set Spikes to wear down opposing Pokemon into Tapu Fini's KO range and pressure Water-types like Slowking. It also switches into Tapu Koko for it. Ground-types like Landorus-T and Garchomp can switch into Tapu Koko and Galarian Slowking, and they like Tapu Fini's ability to check Weavile and Urshifu-R.</p> "
      },
      {
        "name": "Whirlpool",
        "description": "<p>Whirlpool allows Tapu Fini to trap and remove many Pokemon that cannot significantly damage it, such as Toxapex, Blissey, Slowbro, Slowking, and Ferrothorn lacking Power Whip. Nature's Madness provides consistent damage on bulkier Pokemon such as the aforementioned ones it can trap, as well as switch-ins like Galarian Slowking. Taunt is necessary so that Pokemon like Toxapex, Blissey, and Slowking cannot use their recovery moves or pivot out with Teleport. Knock Off can be used over Moonblast to lure in Galarian Slowking and remove its Assault Vest while wearing Toxapex down more quickly by removing its Black Sludge or Shed Shell, but this makes Tapu Fini unable to reliably check Weavile and Urshifu-R. The EVs allow Tapu Fini to survive three Choice Band-boosted Close Combats from Urshifu-R and two Choice Specs-boosted Shadow Balls from Blacephalon from full health.</p> <p>This set can fit on a wide variety of teams, but, as its main purpose is to trap and eliminate certain defensive Pokemon like Toxapex, Blissey, and Slowking, it should be used with Pokemon that appreciate them being removed. Weavile is a great option, as Toxapex and Ferrothorn are common checks to it, and it beats Grass-types and Galarian Slowking for Tapu Fini. Urshifu-R can similarly benefit from Toxapex and Slowbro being removed, and it eases prediction against teams with Ferrothorn. Volcarona and Dragonite can check Grass-types for Tapu Fini, and both can sweep much more easily with Toxapex removed. Ground-types like Landorus-T and Garchomp can switch into Electric-types for Tapu Fini and like its ability to check Weavile and Urshifu-R. If Tapu Fini is using Knock Off, Pokemon that benefit from Galarian Slowking losing its Assault Vest such as Kyurem are good teammates.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Taunt turns Pokemon that rely on status moves to damage Tapu Fini such as Blissey and Toxapex into setup fodder. It also prevents Slowking from using Teleport and Pokemon like Corviknight and Clefable from using their recovery moves, forcing them to play more carefully to avoid being worn down. Scald is weaker than Surf, but it discourages Pokemon not protected by Misty Terrain, such as Landorus-T and Rillaboom, from switching in due to the threat of a burn. Draining Kiss is preferred over Moonblast to make Tapu Fini less easily worn down, but Moonblast can be considered for its greater immediate power. 140 Speed EVs are used to outspeed Bisharp and Timid Magnezone. The Defense EVs and Bold nature are used because Calm Mind already boosts Tapu Fini's special bulk.</p> <p>Magnezone is a great teammate for Tapu Fini because it can trap and eliminate Ferrothorn, one of the most common counters to Tapu Fini, as well as other Steel-types like Corviknight that can pivot into it when it is unboosted. Ground-types like Landorus-T, Hippowdon, and Garchomp can check Electric-types like Zeraora and Tapu Koko and pressure Galarian Slowking, which counters this set. They enjoy Tapu Fini being a reliable switch-in to Weavile and Urshifu-R, two of the few physical attackers they cannot check. Weavile can overwhelm Grass-types and Galarian Slowking and appreciates the switch-in to Urshifu-R that Tapu Fini can provide.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 513717, "username": "airfare"}, {"user_id": 218318, "username": "Clone"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 546123, "username": "TailGlowVM"}]}
  },
  "Buzzwole": {"sets": [{"name": "Offensive Tank"}]},
  "Celesteela": {"sets": [{"name": "Defensive"}]},
  "Kartana": {
    "overview": "<p>Kartana is one of the best and most threatening wallbreakers in OU because of its monstrous Attack stat, good coverage options, and exceptional Speed tier among wallbreakers, which makes it difficult to revenge kill. Swords Dance or Choice Band lets it bust through its most common checks in Corviknight, Skarmory, and Zapdos. It can also be a good revenge killer and late-game wincon when utilizing a Choice Scarf and its ability Beast Boost. This lets it outspeed almost everything in the metagame and subsequently snowball for extremely easy sweeps. Knock Off lets it cripple common Flying- and Fire-type switch-ins, like Zapdos and Volcarona, by removing their Heavy-Duty Boots. Kartana is extremely effective at wallbreaking for other Pokemon that it shares Flying- or Grass-type checks with, including Garchomp and Rillaboom. However, it can be hindered by contact-based abilities and items like Zapdos's Static, Volcarona's Flame Body, Ferrothorn's Iron Barbs, and Corviknight's Rocky Helmet. Swords Dance and Choice Band sets are commonly revenge killed by faster threats such as Dragapult and Zeraora after they're switched in safely via a defensive pivot like Mandibuzz or Corviknight. Choice Scarf sets can be easily shut down by physically defensive walls like Tangrowth, Corviknight, and Skarmory without the power boost given by Swords Dance or Choice Band. Kartana faces competition from other wallbreakers and wincons like Garchomp, Bisharp, and Rillaboom because they are more difficult to revenge kill through their use of Speed boosting or priority. Garchomp and Bisharp can also use their good defensive typings when setting up, while Kartana is limited because of its frailty.</p> ",
    "comments": "<h1>Other Options</h1> <p>Swords Dance Kartana occasionally runs Protective Pads to bypass contact effects from the likes of Zapdos, Ferrothorn, and Rocky Helmet users like Skarmory and Corviknight at the expense of a great portion of its power without Life Orb. Some other Swords Dance Kartana, especially on hyper offense teams, also opt to act as a wincon by using a Timid nature, 19 Attack IVs, and maximum HP EVs, letting Kartana boost its Speed after a KO instead of its Attack. This prevents Kartana from being revenge killed by typical faster threats like Zeraora, Dragapult, and Tornadus-T at the expense of a huge portion of its power.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Flying-types like Corviknight, Zapdos, Tornadus-T, and Skarmory are able to deal with the majority of Kartana's coverage. However, they are vulnerable to being worn down over time with Knock Off and entry hazard support, and they can even lose to Swords Dance sets on the spot if weakened.</p> <p><strong>Physically Defensive Pokemon</strong>: Kartana has immense difficulty breaking through Skarmory, Tangrowth, and Buzzwole, which have enough Defense to check all of its sets. However, these checks can be heavily pressured by Choice Band Kartana assisted by Future Sight because of their mediocre Special Defense. In the process of KOing Kartana, they can also get weakened to the point where they are unable to check some of Kartana's cleaning teammates, like Garchomp and Rillaboom. Physically defensive Volcarona, especially on offensive teams, can threaten Kartana with Flame Body and use it as setup fodder, but it is crippled if it switches into a Knock Off and is unable to reliably take Swords Dance- or Choice Band-boosted attacks.</p> <p><strong>Contact Effects: Static from Zapdos, Flame Body from Volcarona, Iron Barbs from Ferrothorn, and Rocky Helmet on Corviknight and Skarmory can make it difficult for Kartana to make progress against these Pokemon, especially for the former two.</p> <p><strong>Revenge Killers</strong>: For Swords Dance and Choice Band sets, an aggressive double switch on a predicted Swords Dance or a sacrifice of a teammate into a faster threat like Dragapult, Zeraora, or Tornadus-T can easily force Kartana to switch or get KOed.</p> ",
    "sets": [
      {
        "name": "Paper Cut",
        "description": "<p>Swords Dance Kartana is a premier wallbreaker because of its immense power. Its ability to steamroll its common Flying-type checks when boosted or slowly whittle them down with Knock Off and entry hazard support makes it nearly uncheckable. Knock Off targets Flying-type switch-ins like Mandibuzz, Zapdos, and Tornadus-T, as well as hitting Galarian Slowking and Volcarona. By removing their items, Kartana ensures that it or one of its teammates has an easier time breaking through later. Sacred Sword lets it break through Steel-types such as Ferrothorn and Heatran more easily. Sacred Sword also lets Kartana beat Iron Defense Corviknight and Skarmory by bypassing their Defense boosts. Synthesis is an alternative to ensure Kartana defeats Corviknight while healing off Life Orb recoil. It is especially valuable on bulkier teams, where Kartana can be useful even after eliminating Corviknight. However, forgoing Sacred Sword results in harder matchups against other Steel-types like Ferrothorn and Heatran. A Jolly nature is used to outspeed and possibly revenge kill common offensive threats like Garchomp and Hydreigon. Life Orb is especially useful when trying to break through common defensive walls like Corviknight, Zapdos, and Tangrowth.</p> <p>Swords Dance Kartana is often used on offensive teams because of its unparalleled ability to break through Corviknight, Tangrowth, and Skarmory for other cleaners like Rillaboom and Garchomp. Magnezone supports it well because it can trap Corviknight and Skarmory, enabling an easy Kartana sweep. On bulky offense teams, Heatran can set Stealth Rock to help chip common checks, including Corviknight and Tangrowth, and easily pressure Grass- and Steel-types. Cleaners like Dragonite, Weavile, and Hawlucha, alongside the aforementioned ones, can benefit from Kartana's wallbreaking ability on hyper offense teams, often with dual screens support from Tapu Koko or Regieleki.</p> "
      },
      {
        "name": "Paper Press",
        "description": "<p>Knock Off is the one move Choice Band Kartana uses the most because of its unparalleled utility in gradually weakening its most common checks, including Zapdos and Tornadus-T. Removing their items, especially Heavy-Duty Boots, helps Kartana and its teammates break through these foes. Sacred Sword, in addition to targeting Steel-types like Ferrothorn and Heatran, can bypass Iron Defense boosts from Corviknight and Skarmory, letting Kartana break through them if positioned well.</p> <p>Choice Band Kartana fits well with Slowking on Future Sight-based balance or bulky offense teams because of its incredible synergy with Future Sight, which lets it easily bust through typical checks like Tornadus-T, Zapdos, and even Skarmory. Slowking's Teleport also gives it safe switches for more wallbreaking opportunities. Kartana's ability to wallbreak and remove Steel- and Flying-type answers makes partners like Garchomp and Tornadus-T thrive. Magnezone can remove Corviknight, Skarmory, and Ferrothorn, making Choice Band Kartana less prediction-reliant and helping it wallbreak more easily. Because Kartana systematically removes items from an opponent's whole team, especially Heavy-Duty Boots, Stealth Rock setters like Landorus-T and Heatran are solid teammates, as they set up their entry hazards while pressuring Kartana's checks with Toxic and Magma Storm, respectively.</p> "
      },
      {
        "name": "Paper Plane",
        "description": "<p>Utilizing a Choice Scarf, Kartana becomes a deadly late-game cleaner and revenge killer at the cost of being considerably weaker. It can use Knock Off to help weaken shared defensive checks for wallbreaking teammates like Rillaboom, Bisharp, and Tapu Lele. Sacred Sword nails Steel-types that would otherwise wall Kartana, like Ferrothorn and Heatran. Although most Kartana prefer Smart Strike for its reliable damage, some offensive teams opt for Defog as an emergency way to remove entry hazards on forced switches. A Jolly nature and a Choice Scarf let it outspeed other Choice Scarf Pokemon, including Landorus-T, and Speed-boosted sweepers like Garchomp and Volcarona to revenge kill them.</p> <p>Magnezone is Choice Scarf Kartana's most common partner because of its ability to trap annoying Steel-type checks, including Ferrothorn, Corviknight, and Skarmory that would otherwise wall it and its teammates. As Choice Scarf Kartana has problems beating walls without prior Beast Boost activations; therefore, wallbreaking teammates like Bisharp and Tapu Lele can help remove obstacles like Tangrowth and Corviknight for it to clean up. Garchomp is an especially great partner because it can help chip and remove common Flying-type checks, as well as threatening opposing Pokemon that could come in on Choice-locked Kartana, like Heatran and Volcarona.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 546123, "username": "TailGlowVM"}, {"user_id": 526987, "username": "Abhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 513717, "username": "airfare"}]}
  },
  "Blacephalon": {
    "overview": "<p>Blacephalon stands out as an explosive wallbreaker in OU thanks to its excellent offensive stats, its STAB combination, and Beast Boost, which allows it to snowball through whole teams easily after picking off a weakened opponent. All of this, coupled with the tier's lack of sturdy Ghost checks, gives it plenty of opportunities to spam its powerful Shadow Ball and punch holes in opposing walls, defeating common defensive cores made of Pokemon like Landorus-T, Slowbro, and Heatran. Furthermore, Choice Scarf sets allow Blacephalon to act as both a cleaner and a revenge killer. On top of all this, its access to Trick makes it very hard to properly answer, as it allows Blacephalon to cripple checks like Blissey and Tyranitar. However, Blacephalon's weak defensive stats mean it has problems getting into the field, as it requires either pivot support from a teammate or a predicted double switch to start wallbreaking. This means that, if it fails to bring down its target, it is easily KOed by strong neutral hits or weak super effective attacks. Even though Blacephalon has a solid speed tier, it's not enough to get the jump on relevant threats like Weavile, Tapu Koko, Tornadus-T, Kartana, and Dragapult. This, coupled with its Stealth Rock weakness, makes it a very easy target to take down, requiring significant support to function properly.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs turns Blacephalon into a frightening wallbreaker, capable of 2HKOing or OHKOing most neutral targets. Even though Overheat has the disadvantage of dropping its Special Attack, it's a powerful nuke that deals insane damage and is able to muscle past most Pokemon that do not resist its attacks like Landorus-T, Heavy-Duty Boots Tornadus-T, and even sturdier checks like Choice Band Tyranitar. This, coupled with Trick, narrows Blacephalon's checks even further, as Trick permanently cripples Pokemon like Toxapex, Tyranitar, and Blissey. Shadow Ball is a great tool for snowballing due to the lack of Ghost-resistant Pokemon in the tier. Flamethrower is chosen over Fire Blast because of its perfect accuracy, and it 2HKOes the same targets as Fire Blast.</p> <p>Blacephalon greatly appreciates support from pivots like Landorus-T, Tornadus-T, and Tapu Koko that can give Blacephalon a free switch into their checks to start snowballing. Furthermore, the former two can Defog the entry hazards that cripple Blacephalon. Speaking of which, Defog support from Pokemon like Corviknight, which also offers a slow U-turn, is necessary. Blacephalon also enjoys having teammates like Tapu Fini and Ferrothorn that can pivot into possible revenge killers like Weavile and Dragapult. Other wallbreakers like Kartana and Galarian Zapdos benefit from Blacephalon's presence too, as it can KO their checks like Zapdos and Corviknight for them to wreak havoc. Melmetal is a particularly good teammate, as it can help against threats like Weavile, Tapu Koko, and Scarf Tapu Lele that try to revenge kill Blacephalon while also weakening bulky walls like Heatran. Other late-game cleaners like Weavile benefit from Blacephalon's wallbreaking prowess, easily wiping out the opposing team once they get the chance; in exchange, Weavile can soft check Tornadus-T and Dragapult. Finally, making a double Ghost core with Blacephalon and Dragapult is a good idea, as together they can break down their shared checks like Heatran and Tapu Fini, which Blacephalon can also cripple with Trick, allowing one of them to clean late-game.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>This sets focuses on Blacephalon's already good Speed stat to make it harder to revenge kill after Beast Boost takes action, turning it into a fearsome cleaner. It also serves as a potent revenge killer against faster threats like Dragapult and Zeraora, which otherwise would force it out. Fire blast makes up for this set's lack of initial power, picking off most neutral targets after some chip damage, and unlike Overheat, it doesn't have the disadvantage of dropping its Special Attack. However, Flamethrower is a better option for late-game scenarios after Fire-resistant Pokemon like Tyranitar and Tapu Fini have been chipped, allowing for an easy clean. Trick rounds out the set, giving Blacephalon the opportunity to cripple a defensive Pokemon for its teammates if it's unable to clean efficiently in the match. A Timid Nature is chosen because it allows Blacephalon to outspeed other dangerous Choice Scarf users like Tapu Lele.</p> <p>Choice Scarf Blacephalon is best used as a late-game cleaner when it can come in and snowball once the opposing team has been weakened. Because of this, it's advised to pair it with potent wallbreakers like Swords Dance Kartana, Tapu Lele, and Urshifu-R that can weaken the opposing team. In exchange, Blacephalon can outspeed and threaten faster Pokemon that pressure these wallbreakers. Blacephalon also enjoys Knock Off and Defog support, as the former from Pokemon like Weavile can weaken possible checks like Tapu Fini and Toxapex, while the latter from Tornadus-T and Corviknight ensures it doesn't get chipped if it tries to get into the field. Finally, Dragapult is an excellent teammate, forming the classic double Ghost core with Blacephalon that lets Dragapult to spam Shadow Ball to chip foes into range of a Blacephalon sweep. Dragapult also offers U-turn support, which gives Blacephalon the opportunity to get a KO early-game or force switches to gain momentum.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 218318, "username": "Clone"}, {"user_id": 349443, "username": "Tysonslayer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 477937, "username": "Windingsss"}]}
  },
  "Zeraora": {
    "overview": "<p>Zeraora is one of the best offensive pivots in the OU metagame thanks to its blistering Speed tier combined with access to Knock Off and Close Combat, which allows it to threaten a majority of the metagame while forcing progress. Furthermore, because of its unparalleled Speed tier, it can revenge kill the likes of Dragapult, Weavile, and Tornadus-T. Zeraora can also act as a Volt Switch absorber thanks to its ability Volt Absorb; because of this, it can easily deter other Volt Switch users such as Tapu Koko, Zapdos, and opposing Zeraora from using the move and take advantage of them to generate momentum or force progress. Unfortunately, Zeraora is pretty frail, meaning that it can't afford to switch into most attacks unlike other Electric-types like Tapu Koko, which can check Pokemon like Tornadus-T more consistently due to its reliable recovery. Zeraora also has to rely on crippling and wearing down Ground-types like Landorus-T and Garchomp, as it cannot bypass them itself; this hurts its pivoting ability in the process.</p> ",
    "comments": "<h1>Other Options</h1> <p>Blaze Kick can be used over Close Combat to hit Scizor super effectively and easily 2HKO Ferrothorn; however, with this move Zeraora loses its ability to pressure Hydreigon. Grass Knot can be used in order to hit Ground-types such as Swampert, Hippowdon, and Gastrodon for super effective damage, though it has little use elsewhere.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Landorus-T, Garchomp, Hippowdon, and to a lesser extent Swampert can be very threatening to Zeraora, as they can block Volt Switch and proceed to KO it with their STAB moves; however, they all lack reliable recovery other than Hippowdon, meaning Knock Off and Toxic can wear them down quickly.</p> <p><strong>Grass-types: Grass-types such as Rillaboom, Tangrowth, and Amoonguss can easily switch into Zeraora's STAB move and either take it out or consistently wall it, respectively.</p> <p><strong>Chip Damage: Chip damage from Iron Barbs, Rocky Helmet, and Rough Skin can be detrimental for Zeraora, as it is worn down very quickly due to its lack of longevity.</p> <p><strong>Revenge Killers</strong>: Rillaboom can switch into Zeraora's Plasma Fists and has a chance to OHKO it from full health with a Choice Band-boosted Grassy Glide. However, it dislikes Knock Off and Toxic. Urshifu-R and Weavile cannot switch into Zeraora but can revenge kill it if it is weakened sufficiently with Aqua Jet and Ice Shard, respectively. Choice Scarf Pokemon such as Landorus-T and to a lesser extent Kartana can be dangerous for Zeraora as well. However, none them can switch safely into Zeraora, as they can be heavily crippled or taken out by it.</p> ",
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Bulk Up Zeraora is a very dangerous wincon. Its unparalleled Speed tier allowing it to outspeed the entire unboosted metagame alongside its amazing coverage make Zeraora extremely hard to deal with and revenge kill once it has enough boosts, and its ability to force out common Pokemon such as Slowking, Corviknight, and Tornadus-T gives it many setup opportunities. Knock Off is important for hitting Dragapult super effectively. Close Combat is great for hitting targets such as Hydreigon, Heatran, Ferrothorn, and Kyurem for super effective damage, as they would otherwise resist or take very little damage from both its aforementioned moves.</p> <p>Bulk Up Zeraora mainly fits on offensive teams, as the support offensive teams provide for Zeraora such as entry hazards and pivoting can give it more setup opportunities. Dual screens Tapu Koko is a great partner for it, as not only does the dual screens and pivoting support give Zeraora more setup opportunities, but the Electric Terrain increases the power of Plasma Fists, making it harder to wall. Suicide leads such as Landorus-T and Mew are very useful partners for Zeraora, as the entry hazards they provide can allow Zeraora to apply more pressure to the opposing team. Rillaboom is an excellent partner for Bulk Up Zeraora, as Grassy Terrain halves the power of Earthquake from the likes of Garchomp, Landorus-T, and Hippowdon; furthermore, Rillaboom can revenge kill Excadrill in sand, while Zeraora can heavily pressure Pokemon that Rillaboom may struggle with, such as Corviknight, Dragapult, and Skarmory.</p> "
      },
      {
        "name": "Offensive Pivot",
        "description": "<p>Knock Off allows Zeraora to cripple the likes of Landorus-T, Garchomp, Swampert, and Ferrothorn by removing their much needed item, especially Leftovers, making it easier for them to be worn down due to their lack of reliable recovery. Close Combat hits Pokemon that resist all of its other moves such as Hydreigon, Kartana, Excadrill, and Ferrothorn for super effective damage. Toxic allows Zeraora to wear down Pokemon such as the aforementioned Landorus-T and Garchomp as well as Tangrowth that can reliably switch into its STAB move. However, Toxic can be replaced with Volt Switch, which gives Zeraora the option to pivot out from an unfavorable matchup versus Pokemon like Ferrothorn and Tangrowth.</p> <p>Zeraora commonly fits best on offensive and balance teams, as its consistency with providing offensive momentum while also being able to revenge kill and clean late-game thanks to its amazing Speed and primary STAB move makes it fit onto these teams well. Pokemon such as Tornadus-T, Landorus-T, and Scizor are great teammates, as they form a potent VoltTurn core with it; the former two in particular are able to wear down Ground-types that Zeraora struggles with with Hurricane and Toxic, respectively. On the other hand, Zeraora can pivot against Grass-types to bring in Tornadus-T and Scizor and provide an Electric immunity for Tornadus-T. Pokemon that can cover Zeraora's disadvantageous matchup versus Ground-types such as Slowbro, Corviknight, and Ferrothorn while providing utility in Future Sight, slow pivoting, and Spikes respectively make for great teammates. Zeraora's ability to consistently take advantage of Pokemon such as Corviknight, Slowking, and Toxapex due to their fear of being OHKOed by its STAB move makes it a great partner for Pokemon like Rillaboom, Nidoking, and Tornadus-T that generally struggle with these foes. Pokemon that appreciate Zeraora's ability to provide offensive momentum against Grass-types via Volt Switch such as Kyurem and Tapu Lele are very useful teammates, as they can heavily threaten them out. Future Sight support from Slowking and Slowbro is very beneficial, as Ground-types will be more pressured and easily worn down.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 513717, "username": "airfare"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 487629, "username": "Zneon"}]}
  },
  "Melmetal": {"sets": [{"name": "Three Attacks + Thunder Wave"}, {"name": "Protect"}, {"name": "Choice Band"}, {"name": "Assault Vest"}]},
  "Rillaboom": {
    "overview": "<p>Rillaboom's unique access to Grassy Surge and Grassy Glide makes it a deadly revenge killer in OU. Moreover, its strong coverage moves, setup in Swords Dance, and pivoting in U-turn make it a great choice for offensive teams; it can effectively wallbreak, sweep late-game, and create momentum via pivoting out on its telegraphed switch-ins, and it also provides residual healing through Grassy Terrain. Despite all of these qualities, Rillaboom is held back by the ubiquity of Grass-resistant Pokemon such as Skarmory, Zapdos, Corviknight, and especially Buzzwole, with this exacerbated by its susceptibility to adverse contact effects such as Rocky Helmet and Static. Additionally, Rillaboom faces competition from other offensive Grass-types in the tier. Tapu Bulus higher Defense and Fairy typing make it a more reliable check to Landorus-T, Urshifu-R, and Zeraora, while its access to Stone Edge lets it more reliably break through Flying-type switch-ins. Alternatively, Kartanas higher Attack stat lets it more freely wallbreak early-game, and Beast Boost lets it snowball and break past would-be counters like Corviknight in the endgame. Finally, the prominence of Tapu Koko, Tapu Lele, and Tapu Fini, which override Grassy Terrain, threatens both Rillabooms damage output and access to priority, significantly decreasing its ease in simply sweeping with Grassy Glide.</p> ",
    "comments": "<h1>Other Options</h1> <p>Drain Punch can be run on the Swords Dance set to provide a more sustainable offensive option versus Steel-types, though the difference in power relative to Superpower is significant. For example, at +2, Superpower is a guaranteed 2HKO on Corviknight after Stealth Rock, whereas Drain Punch has just a 33.6% chance to 2HKO. Acrobatics with no item is another option on the set to lure in and break past Buzzwole, Tangrowth, and Amoonguss, making way for teammates like Kartana and Urshifu-R; running no item is preferred over Grassy Seed, since Grassy Seed makes the presence of Acrobatics obvious. There is a noticeable loss in power from dropping Life Orb, however. A Choice Scarf set can be used on teams in need of revenge killing that isn't as reliant on Grassy Glide, and it can also snag surprise KOs on the likes of Dragapult early-game. This generally relies on surprise factor, though, and is hard to justify over Choice Scarf Kartana, which boasts Beast Boost to clean more effectively late-game.</p> <h1>Checks and Counters</h1> <p><strong>Buzzwole: Buzzwole resists and tanks all of Rillabooms moves, even after a Swords Dance boost, while punishing attacking attempts with Rocky Helmet. This greatly limits Rillabooms ability to make progress in a game. Knock Off removing Buzzwoles Rocky Helmet or Heavy-Duty Boots, however, can either make it easier to use physical attacks or increase the cost of Buzzwole switching in on Rillaboom, respectively.</p> <p><strong>Flying-types</strong>: Tornadus-T, Corviknight, Zapdos, Skarmory, and Mandibuzz all comfortably switch into Grassy Glide and threaten out Rillaboom with Flying-type STAB moves, Static, Rocky Helmet, Foul Play, or a mixture of the above. Crucially, they can all also punish Rillaboom switching out with Defog, which can greatly lower a teams momentum. These Pokemon must exert caution when switching into Rillaboom at +2, though, for they all risk being 2HKOed. Moreover, Corviknight and Skarmory must be cautious of Rillaboom using U-turn to bring in Magnezone, which traps and KOes them, whereas the others severely dislike losing their Heavy-Duty Boots to Knock Off.</p> <p><strong>Steel-types: The likes of Corviknight, Skarmory, Heatran, Ferrothorn, Scizor, and Melmetal can discourage Grassy Glide spam and punish with options like entry hazards, U-turn, and Thunder Wave, especially against the Choice Band set. They must be wary of Superpower, however.</p> <p><strong>Contact Effects: Zapdoss Static, Volcarona's Flame Body, and the ubiquity of Rocky Helmet all limit Rillabooms ability to spam attacks and threaten to wear it down over time, especially in conjunction with entry hazards and Life Orb chip damage.</p> <p><strong>Opposing Terrain: All opposing Terrain severely hinders Rillaboom by removing the 1.3x damage boost to its Grass-type moves and negating the priority effect of Grassy Glide. Tapu Lele can always come in after a KO and threaten to OHKO with any of its STAB moves, while Tapu Koko can either use U-turn to pivot out of an incoming switch-in or just KO outright with Dazzling Gleam with trivial amounts of chip damage. Both are unable to switch into Rillaboom, however.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>The immediate power of Grassy Glide means that, if it is safely brought in, Rillaboom can force plenty of switches and set up, such as against Tapu Fini or Urshifu-R. At +2, boosted by a Life Orb and Grassy Terrain, Grassy Glide is immensely powerful, capable of KOing virtually all neutral threats and even doing high damage to resistant Pokemon. Knock Off complements Grassy Glide well, punishing switch-ins by removing items such as the Heavy-Duty Boots of Flying-types. Wood Hammer can be opted for here instead; it is extremely powerful, often eliminating the need for prediction, and OHKOes the likes of Unaware Clefable, which otherwise frustrates both this set and hyper offense generally. Wood Hammer also inflicts high damage to Flying-type switch-ins, helping a common teammate in Kartana clean later in the game with Knock Off, therefore making Knock Off redundant on Rillaboom itself. Superpower OHKOes Steel-types like Heatran, Ferrothorn, and Melmetal and 2HKOes Corviknight and Skarmory even when factoring in the Attack drop. A Jolly nature allows Rillaboom to outspeed and KO Modest Kyurem, Modest Tapu Lele, and offensive Heatran while also getting the jump on Zapdos to pressure it with boosted Knock Offs or Wood Hammers.</p> <p>This set is best run on hyper offense builds that appreciate Rillabooms powerful priority and ability to break past defensive checks. Superpower helps soften Skarmory and Corviknight to let physical attackers like Urshifu-R and Weavile sweep later. Kartana is a notable partner; though the pair fulfill greatly redundant offensive roles, one can wallbreak for the other to sweep later, with Grassy Terrain making Kartanas Leaf Blade spammable against even resisted switch-ins. Magnezone stands out as the single best partner for Rillaboom, punishing and discouraging predictable switches into Skarmory and Corviknight so it can more freely attack. Grassy Seed Hawlucha is a great partner for Rillaboom, giving hyper offense builds an unparalleled Speed tier and terrifying wallbreaker in one teamslot while also aiding Rillabooms weakness to Buzzwole. Moreover, Rillaboom is able to bust past the likes of Clefable, Slowbro, and Toxapex, setting up Hawlucha to sweep in the endgame.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Grassy Glide is the strongest priority move in the game under Grassy Terrain, capable of OHKOing common offensive threats, cementing Rillaboom as one of the tier's premier revenge killers. Knock Off hits Grass-resistant foes on the switch for high damage and crucially gets rid of items like Tornadus-Ts Heavy-Duty Boots and Corviknights Rocky Helmet, setting up easier wallbreaking opportunities as the game progresses. If Rillaboom is paired with Kartana, omitting Knock Off for Superpower is optimal, since Kartana is better poised to wallbreak with its own Knock Off if the opposing Flying-types' items are intact. Superpower is useful for targeting Steel-types like Melmetal, Ferrothorn, and Heatran that otherwise switch into Grassy Glide. For the final slot, U-turn is a hard-hitting pivoting tool that can bring in partners such as Magnezone, Blacephalon, and Heatran to punish the common Steel-type switch-ins Rillaboom forces. It generates momentum throughout the game, something competitors in Tapu Bulu and Kartana are unable to do. Rillaboom is also reasonably bulky and healed by Grassy Terrain, giving it opportunities to switch in and pivot out against weaker, resisted attacks like Landorus-Ts Earthquake without sacrificing its longevity too much.</p> <p>This set is most appropriate in bulky offense builds. As always, Magnezone is a standout partner as an incredible recipient of U-turns pivoting, heavily limiting the opponents ability to effectively utilize Corviknight and Skarmory. Heatran appreciates Grassy Terrain to heal and weaken Earthquakes from the likes of Galarian Slowking. It can open up Rillaboom by trapping and removing non-Shed Shell Toxapex, preventing it from scouting Rillaboom's Choice-locked move. Heatran also easily sets Stealth Rock versus nearly all of the Flying-types in the tier, which is especially useful in conjunction with Rillabooms Knock Off. Swords Dance Kartana greatly benefits from Grassy Terrain boosting the power of its Leaf Blade and can break through physical walls like Corviknight, setting up Rillaboom to clean with Grassy Glide in the endgame. Entry hazard support such as Stealth Rock from Landorus-T and Spikes from Skarmory helps slowly wear down the opponent's team for Grassy Glide to sweep later. Finally, Urshifu-R can capitalize on Rillabooms U-turns out of incoming Heatran and Melmetal. Moreover, Rillaboom has favorable matchups with all of the bulky Water-types in the tier, paving the way for it to sweep opposing teams with Surging Strikes.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 526987, "username": "Abhi"}, {"user_id": 218318, "username": "Clone"}, {"user_id": 513717, "username": "airfare"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 209953, "username": "Midnight Fredrick"}]}
  },
  "Corviknight": {
    "overview": "<p>Through the combination of an excellent defensive typing, fantastic bulk, and good movepool, Corviknight serves as one of the best defensive pivots in the tier, being able to check troublesome offensive threats such as Landorus-T, Rillaboom, and Weavile. Furthermore, a neutrality to Stealth Rock and the ability to switch in favorably against most entry hazard setters in the metagame, such as Landorus-T, Clefable, and Garchomp, makes Corviknight a great Defog user. Unlike Zapdos and Tornadus-T, it is not reliant on Heavy-Duty Boots, so it is effective even after being hit with Knock Off. Corviknight's best ability, Pressure, in tandem with Roost, lets it stall out moves such as hazards and weak attacks from the Pokemon it checks effectively. However, Corviknight is often forced to click Roost to stay healthy, leading to a loss of momentum. It also exhibits very little offensive pressure, often relying on one offensive moveslot to help it check foes. Opting for Body Press makes Rillaboom more difficult to deal with, while Brave Bird weakens its matchup against Kartana and Bisharp. Opponents can take advantage of this by sending out Pokemon that resist its main move, forcing Corviknight to switch. Furthermore, Corviknight is especially prone to being trapped by Magnezone, which can open up a major hole in its team.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Bulk Up set with maximum HP and Special Defense EVs, a Careful nature, and a moveset of Brave Bird / Bulk Up / Substitute / Roost is an option for a bulky wincon. This set is especially effective at Pressure stalling opposing Pokemon thanks to its sturdy Substitutes. 200 Speed EVs on the Defog set allow Corviknight to outspeed maximum Speed Modest Magnezone and use U-turn to avoid getting trapped. The loss of bulk is very noticeable, however. Iron Head is also an option to deal super effective damage to Fairy-types. However, it is very weak outside of this and an inferior option overall. Taunt can be used to prevent status moves like Leech Seed from Ferrothorn and Thunder Wave from Clefable, and it can also defend the team against setup sweepers in a pinch, but it has very little use otherwise.</p> <h1>Checks and Counters</h1> <p><strong>Strong Special Wallbreakers: Strong special attackers such as Choice Specs Kyurem and Thunderbolt Tapu Lele easily 2HKO Corviknight. Dragapult can also fish for a Special Defense drop with Shadow Ball if it gets in safely. However, Kyurem dislikes Body Press, and Dragapult and Tapu Lele take a big chunk from Brave Bird.</p> <p><strong>Electric-types and Electric-type Coverage: Common Pokemon such as Zeraora, Tapu Koko, and Zapdos threaten Corviknight with super effective moves. Electric-type coverage moves on Clefable, Melmetal, and Tapu Lele allow these Pokemon to break through Corviknight as well. Magnezone gets a special mention because it traps Corviknight with Magnet Pull and easily beats it, which can open up a major hole in its team.</p> <p><strong>Fire-types and Fire-type Coverage: Heatran is one of the few Stealth Rock users able to beat Corviknight and keep entry hazards on the field. Volcarona threatens Corviknight with its STAB attacks and sets up on variants lacking Brave Bird. Corviknight also invites in Victini, giving it a free turn to use one of its strong attacking moves. Fire-type coverage lets Dragapult and Garchomp break through Corviknight as well. However, Heatran takes a good chunk from Body Press and Volcarona and Dragapult dislike Brave Bird.</p> <p><strong>Chip Damage: Contact punishment from Rocky Helmet and Rough Skin or Iron Barbs is problematic for Corviknight. Furthermore, if hazards are on the field and Corviknight keeps getting forced out before being able to use Defog, the repeated Stealth Rock damage makes its job of switching into Pokemon it's supposed to check more difficult.</p> ",
    "sets": [
      {
        "name": "Defog",
        "description": "<p>The listed EV spread allows Corviknight to avoid the 2HKO from Choice Specs Tapu Lele's Psychic after Stealth Rock damage as well as the 2HKO from Choice Specs Dragapult's Shadow Ball from full HP. Maximum HP and Defense EVs is an alternative, although it takes considerably more damage from special attacks. Body Press OHKOes Bisharp and Weavile while also dealing decent damage to incoming Steel-types such as Heatran and Magnezone. U-turn is what makes Corviknight a great pivot, allowing it to keep momentum against Pokemon that switch in to it. Brave Bird is an alternative that hits Rillaboom, Urshifu-R, and Volcarona for super effective damage and prevents it from being setup fodder for the latter. However, teams especially weak to physical setup sweepers such as Swords Dance Garchomp and Kartana can make use of Iron Defense to completely wall those Pokemon while also making Body Press stronger. Corviknight's ability to wall most hazard setters makes it an excellent Defog user. Leftovers helps check more Pokemon in the long run thanks to the passive recovery. Rocky Helmet deals chip damage to U-turn and Knock Off spam and dissuades Urshifu-R from using Surging Strikes. Corviknight is often switching in on Knock Off from Pokemon such as Weavile, Bisharp, Rillaboom, and Kartana, so its item rarely lasts the entire match.</p> <p>Many team archetypes appreciate Corviknight as a Defogger thanks to its strong defensive presence and pivoting ability. Defensive teams greatly appreciate its longevity and ability to take Knock Off, while more offensive teams take great advantage of its pivoting. Corviknight appreciates Landorus-T, Garchomp, and Hippowdon switching into Electric-type attacks from Zeraora, Tapu Koko, and Zapdos that threaten it. These Pokemon also threaten Heatran, one of the few Stealth Rock setters able to beat Corviknight. Slowking, Toxapex, and Heatran switch into Fire-types that threaten Corviknight such as Heatran for the former two and Volcarona for the latter two. Slowking and Blissey also sponge special attacks from Pokemon such as Nidoking that Corviknight has trouble repeatedly taking, and they can safely pivot into it with Teleport against strong physical attackers that threaten them like Kartana, Rillaboom, and Urshifu-R. Another great teammate is Clefable, as it appreciates Corviknight's ability to take on physical attackers that threaten it like Rillaboom, Bisharp, and Kartana, while Clefable takes on Dragon-types such as Hydreigon, Dragapult, and Kyurem that threaten Corviknight. It also can heal status with Aromatherapy. Strong wallbreakers such as Tapu Lele, Urshifu-R, Bisharp, and Dragapult appreciate Corviknight's slow pivoting with U-turn getting them in safely.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 415305, "username": "Katy"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 218318, "username": "Clone"}]}
  },
  "Barraskewda": {"sets": [{"name": "Choice Band"}], "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 166698, "username": "power"}]}, {"name": "Quality checked by", "members": [{"user_id": 443485, "username": "curiosity"}, {"user_id": 295110, "username": "Ruft"}, {"user_id": 303291, "username": "lyd"}, {"user_id": 248449, "username": "talah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": []}},
  "Toxtricity": {"sets": [{"name": "Choice Specs"}]},
  "Hatterene": {"sets": [{"name": "Calm Mind"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 248449, "username": "talah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 303291, "username": "lyd"}]}},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}], "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 157610, "username": "ScraftyIsTheBest"}]}, {"name": "Quality checked by", "members": [{"user_id": 295110, "username": "Ruft"}, {"user_id": 443485, "username": "curiosity"}, {"user_id": 144451, "username": "Mannat"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 487629, "username": "f is for frens"}]}},
  "Dracozolt": {
    "overview": "<p>In sand, Dracozolt is one of the tier's most threatening wallbreakers thanks to its great Speed and signature move Bolt Beak, which doubles in power when Dracozolt moves first. It easily beats both offensive and defensive staples like Tornadus-T, Tapu Lele, Toxapex, and Corviknight. Whether it is by trapping and weakening Pokemon like Landorus-T, Ferrothorn, and Garchomp with Fire Spin or simply running coverage, Dracozolt can overcome traditional checks to Electric-types. Unfortunately, Dracozolt is reliant on sand, as it is very slow and easy to offensively pressure outside it. It has mediocre bulk and can be worn down quickly by entry hazards, especially with Life Orb. Finally, Dracozolt is reliant on prediction to nail switch-ins to Bolt Beak and utilize limited sand turns, which sometimes makes it very underwhelming.</p> ",
    "comments": "<h1>Other Options</h1> <p>Fire Blast can be used over Fire Spin on the Substitute set for more immediate damage against Pokemon like Ferrothorn, Excadrill, and Melmetal. However, it requires a lot of prediction to be effective, and these Pokemon are still able to pivot around Dracozolt, making Fire Spin's ability to trap them preferred. Taunt can be used on the Life Orb set to force out passive Pokemon like Ferrothorn, but Dracozolt dislikes having to give up a coverage move for it, and it should spend its sand turns attacking. High Horsepower can replace Earthquake on teams with Rillaboom so Dracozolt is not weakened by Grassy Terrain.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Specially defensive Ground-types like Hippowdon and Swampert are some of the very few reliable checks to Dracozolt, tanking even Life Orb-boosted Draco Meteors and OHKOing back with Earthquake. However, Swampert is chipped down quite easily. Utility Excadrill is capable of walling Dracozolt if it does not carry Earthquake, while Sand Rush Excadrill outspeeds and revenge kills Dracozolt in sand. Defensive Landorus-T can switch into Dracozolt and force it out, but switching into Draco Meteor and Fire Spin wears it down over time. Other Ground-types like Garchomp and Nidoking can fall to Dracozolt's coverage moves, but they prevent it from freely using its strongest STAB move and revenge kill it outside of sand.</p> <p><strong>Losing Sand: Dracozolt is unable to accomplish much outside of sand due to its mediocre Speed, below almost every offensive Pokemon in the tier, so you can stall out its sand turns by switching around it or using Protect users like Heatran. However, Dracozolt can overcome these strategies if it predicts correctly. Pelipper, Torkoal, and Alolan Ninetales replace sand with their own weather as well, although they cannot directly switch into Dracozolt.</p> <p><strong>Priority: Priority moves like Weavile's Ice Shard, Bisharp's Sucker Punch, and Rillaboom's Grassy Glide can finish off Dracozolt even in sand if it is weakened, which is fairly likely thanks to Substitute damage or Life Orb recoil, though Dracozolt can get past them with a Substitute up. Substitute can particularly exploit Sucker Punch, and none of these Pokemon can directly switch into Dracozolt.</p> <p><strong>Status: Although Dracozolt theoretically possesses the typing to switch into some defensive Pokemon like Slowking, Toxapex, and Zapdos, it cannot do so safely, as they can cripple it with Scald burns or Toxic. Burns weaken it, and both leave Dracozolt worn down even more quickly than usual.</p> ",
    "sets": [
      {
        "name": "Substitute + Fire Spin",
        "description": "<p>Draco Meteor is a strong secondary STAB move to hit Ground-types like Landorus-T, Garchomp, and Nidoking. Substitute allows Dracozolt to take advantage of the switches it forces, easing prediction, and avoid status moves from Pokemon it can trap with Fire Spin, such as Ferrothorn's Leech Seed and Tangrowth's Sleep Powder. If Dracozolt has a Substitute up, it can still safely attack one time outside of sand. Fire Spin allows Dracozolt to trap passive Pokemon like Ferrothorn and especially Clefable, easing prediction, and wear down some of its checks that lack reliable recovery, like Landorus-T and Ferrothorn. 140 Special Attack EVs let Dracozolt beat defensive Landorus-T. To do this, it must hit Landorus-T on the switch with Draco Meteor, then switch out. Later in the match, the combination of Fire Spin and Draco Meteor will then be able to KO it. 184 Speed EVs allow Dracozolt to outspeed Choice Scarf Landorus-T in sand. The remaining EVs are pooled into Attack to increase Bolt Beak's damage output. A Lonely nature guarantees that Dracozolt survives Clefable's Moonblast from full health and 2HKOes specially defensive Tyranitar with Bolt Beak, and it doesn't weaken Draco Meteor. Leftovers is the preferred item to heal off Substitute damage and weaker attacks.</p> <p>Dracozolt is used exclusively on sand cores. Consequently, Tyranitar or Hippowdon is a necessary teammate. Both of them can also set Stealth Rock for Dracozolt. Excadrill is also common on these sand cores; it can either sweep teams with Swords Dance once Dracozolt has weakened them or cripple shared checks like Tangrowth and Landorus-T with Toxic, making them even easier to trap and eliminate. Dracozolt's ability to trap Clefable and Ferrothorn is appreciated by Pokemon like Tornadus-T and Scizor, and they can give Dracozolt free turns against many of their checks like Corviknight by using U-turn. Skarmory can set Spikes, which is particularly useful for wearing down Dracozolt's checks like Hippowdon, Ferrothorn, and Melmetal as Dracozolt forces them in, and it also checks Excadrill. Dracozolt's poor bulk gives it few opportunities to switch in safely, making Teleport users like Slowbro and Slowking useful. Future Sight from either also stops many of Dracozolt's defensive checks, like Clefable and Landorus-T, from switching into it safely. Landorus-T and Corviknight are helpful teammates to check Pokemon like Excadrill for Dracozolt, and they draw in defensive Pokemon that it beats like Skarmory and bring it in safely with U-turn against them. Landorus-T also cripples Tangrowth and opposing Landorus-T with Toxic.</p> "
      },
      {
        "name": "Life Orb",
        "description": "<p>With Life Orb's damage boost, Dracozolt can effectively utilize coverage moves to hit Pokemon that resist its STAB moves. Earthquake hits Excadrill and Electric-types like Tapu Koko and Zeraora, and it OHKOes Heatran, which could otherwise survive a hit and do significant damage back with Earth Power. Fire Blast hits Grass-types like Ferrothorn and the rarer Tangrowth and Tapu Bulu. 184 Speed EVs and 176 Special Attack EVs allow Dracozolt to outspeed Choice Scarf Landorus-T in sand and OHKO SubRoost Kyurem with Draco Meteor. The remaining EVs are placed into Attack to increase Bolt Beak's damage output. A Naughty nature instead of Lonely lets Dracozolt take priority moves from Pokemon like Rillaboom and Weavile slightly better.</p> <p>Either Tyranitar or Hippowdon is required to set sand for Dracozolt. Both can check some offensive threats that Dracozolt struggles against, such as Kyurem behind a Substitute for the former and Sand Rush Excadrill for the latter. Garchomp is another Pokemon that fits on sand cores, and it appreciates Dracozolt wearing down their shared checks like Landorus-T, Clefable, and Tangrowth. Pivots like Dragapult, defensive Landorus-T, and Slowking can draw in Pokemon that Dracozolt can beat, like Mandibuzz, Corviknight, and Blissey, and bring it in safely with U-turn or Teleport to start wallbreaking. Slowking is particularly notable, as Future Sight is useful for pressuring Dracozolt's checks like Landorus-T and Clefable. Corviknight and Skarmory are consistent checks to the majority of Ground-types and Rillaboom, which often trouble sand teams. The former can also use its slow U-turn to bring Dracozolt in safely, while the latter sets Spikes to wear down its checks. Clefable can cripple faster Pokemon like Heatran with Thunder Wave, making Dracozolt not deadweight outside of sand, or support it with Aromatherapy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 526987, "username": "Abhisdn417"}, {"user_id": 443485, "username": "curiosity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 546123, "username": "TailGlowVM"}]}
  },
  "Arctozolt": {"sets": [{"name": "Substitute"}]},
  "Dragapult": {
    "overview": "<p>Dragapult is one of OU's premier wallbreakers, offensive pivots, and ways of keeping faster foes in check, boasting a near unresisted STAB combination, great coverage options, and a near-unparalleled Speed tier. The latter in particular is a versatile attribute that lets it get past a majority of offensive Pokemon in the tier and take full advantage of its dual STAB combination to sweep weakened teams, easily spread status, or safely pivot with U-turn. This, in addition to its access to Infiltrator, makes it a fantastic answer to more offensively inclined teams, including dual screens archetypes, as switching safely into its Ghost-type STAB attacks is incredibly difficult for them to do without a dedicated answer. Furthermore, its access to a fast U-turn in tandem with its powerful STAB combination lets Dragapult facilitate offensive teammates very well, letting it form incredible cores with a myriad of offensive Pokemon like Urshifu-R and Garchomp. More prominently, most of Dragapult's checks are highly exploitable with U-turn and can easily have progress forced against them, as they either lack reliable recovery or can be overwhelmed in the long run with entry hazard or Knock Off support. Dragapult also wields great coverage options such as Thunderbolt and Flamethrower that let it overwhelm would-be checks such as Mandibuzz, Toxapex, Tapu Fini, and Ferrothorn more reliably. However, Dragapult's lack of longevity and only serviceable bulk in spite of its solid defensive typing means that damage it sustains is permanent, leaving it susceptible to long-term pressure from status effects, chip damage from resisted hits, and entry hazards in the case of non-Heavy-Duty Boots variants. Consequently, this can lead to it being picked off by healthy Pokemon, priority, or Choice Scarf users later in the game. For these reasons, it is also incapable of utilizing its Dragon typing to provide long-term defensive utility against prominent targets like Heatran, leading to it needing pivoting support or aggressive doubles to find good opportunities to do its job. Dragapult's Special Attack stat is also only slightly above average, meaning it needs Choice Specs or status to be immediately threatening with its primary STAB attacks or Hex, respectively. Even when boosted, its damage output can be middling, making it reliant on forced switches and prior chip damage to safely damage its targets without risking damage or status against itself.</p> ",
    "comments": "<h1>Other Options</h1> <p>Dragapult is able to run a mixed variant of its pivot set utilizing Dragon Darts, being capable of beating Volcarona and pressuring Blissey and Tyranitar while providing reliable damage output without a Special Attack drop. However, donning a mixed variant further divvies Dragapult's middling power by forcing Attack investment and leaves it without the immediate power of Draco Meteor. Most notably, Dragapult is incapable of OHKOing a healthy Garchomp with Dragon Darts. On the other hand, Dragapult is able to take advantage of its great Attack stat and access to Dragon Dance to pierce past weakened teams. However, such a set is difficult to get value with against common Pokemon like Toxapex, Melmetal, and Corviknight, which can outlive its onslaught and dispatch it accordingly, especially against two attack variants. Substitute + Hex variants are also extremely potent at taking advantage of forced switches by easing prediction while spreading status and damage more deliberately, but the loss of U-turn and Speed investment strips Dragapult of its ability to facilitate offensive teammates and keep faster foes in check.</p> <h1>Checks and Counters</h1> <p><strong>Special Walls: Dragapult's damage output is greatly challenged by special walls like Blissey, Toxapex, Gastrodon, Hippowdon, and Clefable. However, in spite of this, Dragapult is easily able to exploit these Pokemon with its access to U-turn, and the latter three can easily be overloaded due to their reliance on being healthy to check Dragapult; additionally, Hex variants can be troublesome to check in spite of this. Tapu Fini and Tyranitar are decent short-term checks but are not reliable in the long run due to a lack of longevity.</p> <p><strong>Fairy-type Pokemon: Clefable and Tapu Fini are immune to its Draco Meteor and possess the bulk to stomach a Shadow Ball; the latter is also impervious to status due to Misty Surge. However, they can be overwhelmed with the aid of Knock Off support, making it increasingly difficult for them to check Dragapult as the game progresses.</p> <p><strong>Dark-type Pokemon and coverage</strong>: Bisharp, Mandibuzz, and Tyranitar are common Dark-type Pokemon that resist Dragapult's most spammable option in Shadow Ball. The former, uniquely, is able to resist both of Dragapult's STAB attacks but lacks the bulk to switch into it in the long run, forcing it to rely on pivoting support to reliably keep Dragapult at bay. Mandibuzz and Tyranitar are both very vulnerable to residual damage from Dragapult's U-turn and passive damage; Mandibuzz, particularly, is extremely vulnerable to Knock Off, which can make it an inconsistent check to Dragapult as the game progresses. Knock Off is also a very frequently utilized move that Dragapult is weak to, making it more vulnerable than other offensive Pokemon to stray uses of the move and making it further reliant on pivoting support.</p> <p><strong>Residual Damage: Dragapult's lack of longevity leaves it susceptible to residual damage from entry hazards, status, and resisted hits, which can reduce the utility of its defensive typing and limit switch-in opportunities over the course of the game.</p> <p><strong>Revenge Killers</strong>: Dragapult is very vulnerable to being revenge killed, since it is reliant on weakened foes or forced switches in order to safely do its job without risk of chip damage or status. However, priority moves from Rillaboom, Bisharp, and Weavile and Choice Scarf users like Tapu Lele, Kartana, and Landorus-T are capable of picking off Dragapult without the need of a defensive answer. Zeraora, on the other hand, is simply able to revenge kill it with Knock Off, as it barely eclipses its Speed tier.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>When equipped with a Choice Specs, Dragapult becomes a menacing wallbreaker that can easily overwhelm a majority of the metagame with its STAB Draco Meteor and Shadow Ball. In particular, Shadow Ball is an incredibly spammable, powerful option that is incredibly hard to switch into without a dedicated answer that is able to handle Dragapult's other options in the long run, like specially defensive Clefable, Toxapex, or Blissey. U-turn allows Dragapult to exploit and safely chip away at its small pool of checks to generate momentum, allowing offensive teammates to either enforce progress or safely wallbreak. Dragapult's last coverage move largely depends on the offensive core around it - Flamethrower is a highly effective coverage option that lets it apply more immediate pressure against targets like Corviknight, Scizor, and Ferrothorn. Hydro Pump allows Dragapult to further pressure Heatran and beat Hippowdon and specially defensive Landorus-T, or Thunderbolt or Thunder to instead pressure would-be checks such as Mandibuzz, Tapu Fini, and Toxapex. Thunder, notably, is capable of more reliably finishing off specially defensive Toxapex at the cost of accuracy and PP. Although a more niche option, Hex lets Dragapult overwhelm Gastrodon, Hippowdon, and Clefable when they've been statused, but it leaves Dragapult extremely reliant on teammates that can spread status. Dragapult's access to Infiltrator alongside its fantastic Speed tier makes it a great answer to offense teams, wholly disregarding dual screens and Substitute from Pokemon such as Kyurem and Landorus-T, making it the ideal choice over the more situational Clear Body.</p> <p>Dragapult's ability to pivot around Clefable, Tyranitar, and Blissey lets it pair incredibly well with offensive Pokemon that are capable of helping it break past them and remove shared checks. Urshifu-R and Melmetal are incredible examples of great U-turn recipients. The former can use its powerful STAB combination to beat Tyranitar, Hippowdon, and Blissey while helping it deal with Tapu Fini and Toxapex. Similarly, Melmetal also takes advantage of U-turn to come in against Clefable and Blissey, and its access to Toxic and Thunder Wave further reinforces Dragapult's wallbreaking potential with Hex. In return, Dragapult is capable of using its Ghost-type STAB and powerful Draco Meteor to hit or pivot against their checks like Slowbro, Tangrowth, Zapdos, and Corviknight. Additionally, Kyurem and Hydreigon can be fantastic in helping Dragapult overwhelm shared Fairy- and Steel-type checks in the form of Clefable, Ferrothorn, and Melmetal. They also appreciate Dragapult's ability to pivot against Pokemon like Toxapex, Gastrodon, and Hippowdon to find critical wallbreaking opportunities. Heatran is another U-turn recipient that is capable of trapping Toxapex, Clefable, and Blissey with Magma Storm or setting Stealth Rock. Dragapult also greatly appreciates Knock Off support in order to strip checks like Clefable and Tapu Fini of Leftovers recovery while leaving others like Mandibuzz and Blissey more vulnerable to entry hazards. Ferrothorn is a solid option that can target foes like Heatran with Knock Off to create progress for Dragapult and is also capable of setting entry hazards. Additionally, Kartana is an incredible, more offensively inclined Knock Off user that benefits from Dragapult's U-turn, easily ripping past Dragapult's checks like Gastrodon, Clefable, and Hippowdon with its high Attack, STAB attacks, and coverage. Landorus-T's access to Stealth Rock, Toxic, and Knock Off makes it capable of targeting and pressuring shared checks in the form of Mandibuzz and Tapu Fini while hitting Toxapex super effectively and providing Dragapult with both a Zeraora switch-in and pivoting support. Landorus-T also appreciates Dragapult's ability to provide it with a safe entry against Pokemon like Tyranitar and Blissey, which it can easily exploit to enforce progress with its utility.</p> "
      },
      {
        "name": "Offensive Pivot",
        "description": "<p>Dragapult's access to status, U-turn, and STAB Hex makes it a potent disruptor and pivot capable of sweeping past chipped down teams. Additionally, its blistering Speed tier alongside U-turn lets it operate as a superb check to fast Pokemon on offensively inclined teams, being able to take advantage of forced switches with ease to generate momentum or force progress with status. Dragapult's choice of status condition is highly dependent on the needs of its team, as well as what it wishes to target. Thunder Wave typically is the preferred option, as it is capable of punishing and crippling most of Dragapult's checks, including Clefable and situationally Heatran while slowing down fast offensive Pokemon like Tornadus-T for its teammates. Will-O-Wisp, however, can be a great option that takes advantage of and ruins the value of physical attackers while negating Leftovers recovery of Hippowdon and Gastrodon and forcing passive damage on Mandibuzz. Dragapult's vulnerability to entry hazards as an offensive pivot makes it a great user of Heavy-Duty Boots, enabling it to more reliably generate momentum in the long term. Lastly, Infiltrator lets Dragapult wholly disregard dual screens and Substitute and more freely force damage and inflict status on hyper offense builds. Access to Infiltrator also allows Dragapult to disregard Safeguard Volcarona and reliably paralyze it.</p> <p>Dragapult's ability to check faster Pokemon and facilitate offensive teammates with its access to status, fast U-turn, and ability to invite in its exploitable checks makes it a phenomenal pick on balance teams. Likewise, it also appreciates offensive teammates that are able to help it handle its checks due to its relative lack of immediate power. For example, Urshifu-R is a superb teammate that highly appreciates Dragapult's ability to slow down or weaken fast, offensive threats such as Kartana and Tornadus-T while also being able to take heavy advantage of Dragapult checks like Tyranitar and Blissey for wallbreaking opportunities. Additionally, Urshifu-R is capable of pivoting against Pokemon like Slowbro and Tangrowth to give Dragapult more opportunities to spread status. Kartana, similarly, heavily appreciates Dragapult's ability to cripple potential checks while providing it with safe switch in against Gastrodon, Hippowdon, and Blissey. Thunder Wave also allows Kartana to outspeed otherwise faster Pokemon like Weavile, improving its cleaning potential in the long run. Access to Knock Off can also allow Kartana to enforce progress for Dragapult and leave its checks more vulnerable to entry hazards and chip damage. Garchomp is a great offensive partner that likes having checks in Corviknight and mixed Clefable dispatched by Thunder Wave, exploits Toxapex, and takes great advantage of Dragapult's pivoting abilities while helping it deal with Clefable, Hippowdon, and Gastrodon more effectively. Landorus-T is also a great partner that can utilize both Knock Off and Stealth Rock to enforce progress for Dragapult while providing a solid switch-in against Zeraora, which may attempt to revenge kill it otherwise if it has sustained any chip damage. Lastly, Dragapult's ability to compress roles with its Speed tier to offensive check fast Pokemon, status, and cleaning make it a good fit on more defensively inclined teams alongside the aforementioned Landorus-T and allies such as Clefable and Ferrothorn that are similarly able to spread item removal and set entry hazards.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 458680, "username": "ScalchopFren"}, {"user_id": 303291, "username": "lyd"}, {"user_id": 248449, "username": "talah"}]}, {"name": "Quality checked by", "members": [{"user_id": 526987, "username": "Abhi"}, {"user_id": 513717, "username": "airfare"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 360720, "username": "ausma"}]}
  },
  "Urshifu-Rapid-Strike": {
    "overview": "<p>Urshifu-R is a very potent wallbreaker and pivot in the OU metagame, being able to force switches and threaten common Pokemon like Corviknight, Skarmory, and Mandibuzz while pivoting on switch-ins to its STAB moves such as Toxapex, Slowbro, and Tangrowth. It can even overwhelm and take advantage of defensive cores made of bulky Water-types like Slowking and Tapu Fini with ease. It has incredibly strong priority in its STAB Choice Band-boosted Aqua Jet, making it effective at revenge killing weakened faster foes like boosted Volcarona. Its STAB moves, while strong, are resisted by common walls such as Toxapex and Slowbro, which limits it as a wallbreaker in certain matchups. However, it can gain momentum by pivoting out of these into offensive teammates like Kartana and Tapu Koko for additional pressure. Urshifu-R only uses contact moves, so Surging Strikes can cause almost 50% in self-damage against Iron Barbs and Rocky Helmet users like Toxapex and Corviknight, making them able to consistently wear it down; in addition, Static from Zapdos can be extremely limiting. Urshifu-R is reliant on Choice Band to do most of its damage, meaning that it can't utilize its Dark resistance to switch into Knock Off without heavy punishment. This also makes it heavily prediction-reliant, potentially losing momentum against walls if it uses a resisted move.</p> ",
    "comments": "<h1>Other Options</h1> <p>Urshifu-R can run a set of Whirlpool, Taunt, Surging Strikes, and Thunder Punch or Close Combat with Protective Pads. This lets it greatly bait in and trap checks like Toxapex, Slowbro, and Slowking but sacrifices a large amount of breaking power with the loss of a damage-boosting item. A Bulk Up sweeper set can allow it to boost without locking it into a move. Equipped with Bulk Up, Zen Headbutt or Thunder Punch alongside its dual STAB moves, and Protective Pads to ignore Rocky Helmet and Iron Barbs chip damage, it can set up against Pokemon such as Toxapex and Corviknight lacking Brave Bird. However, its lack of initial power, pivoting, and priority takes away a lot of Urshifu-R's normal strengths. A Protective Pads with four attacks set can also be used, letting Urshifu-R freely pivot with U-turn and use Surging Strikes without fear of contact effects. The power drop is massive, though, noticeably making it ineffective at breaking through Pokemon like Corviknight and Skarmory immediately, limiting it as a wallbreaker overall. Choice Scarf Urshifu-R can act as a fast revenge killer with strong STAB moves. This set comes at the cost of a lot of attacking power, though, and with Urshifu-R's general goal being to wallbreak, it is not heavily recommended.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Toxapex and Slowbro completely wall Choice Band sets lacking Thunder Punch, and they can easily take a Thunder Punch and pivot out if needed. Other Water-types such as Tapu Fini can also check Urshifu-R, but, as Tapu Fini lacks reliable recovery, it can't wall Urshifu-R long term.</p> <p><strong>Grass-types: Defensive Grass-types like Tangrowth and Amoonguss can completely wall Urshifu-R, and offensive Grass-types like Rillaboom and Kartana threaten it with an OHKO from their STAB moves while resisting Surging Strikes and Aqua Jet.</p> <p><strong>Contact Effects: Rocky Helmet, Ferrothorn's Iron Barbs, and Zapdos's Static are all extremely harmful to Urshifu-R due to its heavy use of Surging Strikes and U-turn, making it much less effective.</p> <p><strong>Fast Wallbreakers: Urshifu-R's Speed is fairly average and its special bulk and defensive typing leave much to be desired, allowing many strong wallbreakers to revenge kill it. Zeraora, Tapu Koko, Dragapult, and Tornadus-T all force it to switch out, as they easily beat it offensively.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Surging Strikes ignores Defense boosts from Pokemon such as Iron Defense Corviknight and Skarmory, as well as breaking through Substitutes and potential Focus Sashes. Aqua Jet is great for revenge killing chipped foes, especially helping in the hyper offense matchup. Frailer Pokemon such as Volcarona, Blacephalon, and Hawlucha all take good damage from Aqua Jet, with the former two being OHKOed and Hawlucha having a potential sweep stopped when chipped. U-turn lets Urshifu-R keep up momentum on defensive switch-ins and provide wallbreaking opportunities for its teammates. Choice Band allows it to 2HKO many pivots such as Slowking, Skarmory, and Corviknight. A Jolly nature allows Urshifu-R to outspeed and revenge kill Pokemon such as Tapu Lele, Kyurem, and Landorus-T. Ice Punch can be used over Aqua Jet, giving it a very hard hit on Dragon-types trying to pivot into and scout it such as Garchomp, Dragonite, and Dragapult. It also gives a decently strong hit against Grass-types like Tangrowth and Amoonguss without having the Defense drop and Pokemon immune to it.</p> <p>With Urshifu-R acting as a very strong pivot with U-turn, many powerful wallbreakers appreciate its presence. Heatran, Kartana, and Kyurem can be given free switch ins and threaten out checks to Urshifu-R such as Slowbro, Tangrowth, and Toxapex with their own powerful attacks. Heatran in particular appreciates free switch in from U-turn to fire off Magma Storm and trap foes, and, as Dragon- and Water-types commonly come into Heatran, this chips them down for Urshifu-R to break. Dragapult can invite Pokemon like Blissey and Mandibuzz that Urshifu-R can pressure, and together they can remove shared checks such as Tapu Fini, forming a terrifying wallbreaking core. Tapu Lele works as a great partner to help overwhelm common pivots like Slowking while also appreciating momentum from Urshifu-R's U-turn. With Rocky Helmet users being such a big issue for Urshifu-R, Knock Off users such as Rillaboom, Kartana, and Tornadus-T, which invite in Rocky Helmet users like Corviknight, Skarmory, and Toxapex, are greatly appreciated. Rain support provided by Pelipper powers up Surging Strikes to incredible levels and lets Aqua Jet revenge kill foes more easily. Defensive checks such as Tapu Fini, Buzzwole, and specially defensive Toxapex are much less safe switch-ins with rain up. Future Sight support from the likes of Slowking, Galarian Slowking, and Slowbro is also incredibly useful for Urshifu-R, helping it break through checks it normally can't such as Toxapex, Tangrowth, and Amoonguss. Blissey acts as a specially bulky pivot that covers for some of Urshifu-R's big weaknesses to Pokemon like Dragapult while also giving it free switch ins with Teleport to wallbreak.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 513717, "username": "airfare"}, {"user_id": 360720, "username": "ausma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}]}
  },
  "Zarude": {"sets": [{"name": "Bulk Up"}]},
  "Regieleki": {"sets": [{"name": "Screens Lead"}]},
  "Glastrier": {"sets": [{"name": "Swords Dance"}]}
}