{
  "Venusaur": {
    "sets": [
      {
        "name": "Chlorophyll Attacker",
        "description": "<p>Chlorophyll makes Venusaur into an excellent attacker able to outspeed the entire unboosted metagame while threatening opponents with its great offensive typing, coverage, and Sleep Powder. Grass Knot takes advantage of the heavy weight of the restricted Pokemon of the format, reaching maximum Base Power against Groudon, Kyogre, and Xerneas. Leaf Storm is not reliant on weight for its power, having a chance to OHKO Landorus with a Life Orb and a Modest nature. Sludge Bomb hits Xerneas and Tapu Lele as well as hitting Tapu Fini hard, which does not take much damage from Grass Knot due to its light weight. Sleep Powder disrupts the opposition and lets Venusaur disable Pokemon in unfavorable matchups. Earth Power is important to hit many Ground-weak-Pokemon such as Stakataka and Nihilego as well as other metagame staples such as Incineroar and Zacian-C for decent damage. Alternatively, sun-boosted Weather Ball threatens to deal much more damage to Zacian-C while also hitting Amoonguss hard. Life Orb enables Venusaur to OHKO Nihilego with Modest Earth Power, 2HKO Zacian-C with Earth Power, and OHKO Kyogre with Modest Grass Knot. Alternatively, Focus Sash gives up power for survivability, avoiding an OHKO from the likes of Incineroar, Zacian-C, and Volcarona. A Timid Venusaur outspeeds Regieleki in sun, but it fails to outspeed any other notable targets and gives up much appreciated power.</p> <p>Venusaur must be paired with a Drought setter, Torkoal or preferably Groudon, in order to activate Chlorophyll. Groudon greatly appreciates Venusaur's ability to threaten opposing Grass-types such as Rillaboom and Tsareena while it handles Fire types such as Incineroar for Venusaur. Venusaur is not a very good Kyogre check on its own, so be sure to add secondary Grass- or Electric-type checks such as Assault Vest Rillaboom, Tsareena, and Regieleki to your team. Nihilego and Incineroar are great teammates for Venusaur for their ability to check opposing Fire-types like Volcarona and Incineroar; in exchange, Venusaur can pick off many Ground-types-such as opposing Groudon for them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}
  },
  "Gyarados": {
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Gyarados has proven to be a great Water-type in the metagame thanks to its defensive typing, Intimidate, and bulk with Assault Vest, which allows it to check common restricted Pokemon such as Calyrex-S and Groudon, with Intimidate being a crucial tool for slowing down Zacian-C. Waterfall is Gyarados's main STAB move, hitting prevalent Fire- and Ground-type Pokemon like Entei and Landorus. Power Whip provides Gyarados with coverage for Water-types, hitting Kyogre and Urshifu-R for a 2HKO, as well being the strongest option to hit Groudon with in the sun. Icy Wind offers speed control for letting Gyarados and its teammates surpass fast threats such as Zacian-C, Calyrex-S, and Landorus. Lash Out makes Gyarados a solid check to Calyrex-S and Lunala, notably OHKOing the former. Lash Out is used over Crunch or Payback in order to always get the OHKO on Calyrex-S, even if Gyarados is worn down by opposing Intimidate. Stone Edge gives Gyarados an option to OHKO Volcarona and ignore its Flame Body and the ability to 2HKO Entei in the sun, which is especially relevant, as Entei is sometimes paired with Groudon. Assault Vest significantly improves Gyarados's ability to take on powerful special attackers such as Calyrex-S and Kyogre. These EVs allow Gyarados to survive Kyogre's Thunder and make Calyrex-S's Astral Barrage a 3HKO. The Speed investment allows Gyarados to get past maximum Speed Incineroar and -1 Landorus.</p> <p>Zacian-C is Gyrados's best restricted partner and is capable of destroying Nihilego for it. In return, Gyarados can check Fire- and Ground-types such as Landorus, Incineroar, and Volcarona. Amoonguss is a phenomenal Gyarados teammate, as it is capable of redirecting Electric-type attacks from Regieleki and Zapdos. Gyarados in return can threaten Fire-types like Volcarona and Entei. Entei and Incineroar have great synergy with Gyarados, as they can thwart problematic Grass-types such as Amoonguss and Rillaboom, and Gyarados can check Ground-types like Groudon and Landorus. Landorus is solid alongside Gyarados for its ability to thwart Electric-types like Zapdos and Regieleki.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>Gyarados is a great Pokemon with its support moves, Intimidate, and defensive typing, which allow it to check some of the metagame's premier Pokemon, such as Groudon and Urshifu-R, and while it may not beat Zacian-C on its own, Intimidate is an invaluable tool versus it. Waterfall is Gyarados's best STAB option, threatening common Fire-types like Entei and Incineroar. Power Whip gives Gyarados the ability to meaningfully threaten Water-types such as Kyogre, Urshifu-R, and Tapu Fini. Taunt is useful for shutting down Trick Room from Stakataka, as well Amoonguss's and Whimsicott's support moves. Thunder Wave is a great disruptive tool for crippling fast Pokemon like Calyrex-S, Zacian-C, and Xerneas. Rocky Helmet is particularly useful for punishing or deterring Urshifu-R's Surging Strikes and is also useful in chipping the many Fake Out and U-turn users in the metagame such as Rillaboom, Incineroar, and Mienshao. The EV spread allows Gyarados to never be 2HKOed by Landorus's -1 Stone Edge, while the Speed EVs let Gyarados get past maximum Speed Incineroar and paralyzed Calyrex-S.</p> <p>Gyarados is great with Zacian-C for its ability to check Fire- and Ground-types such as Incineroar and Landorus. In return, Zacian-C can destroy Nihilego. Amoonguss is an amazing partner for Gyarados, as it can redirect attacks from the likes of Regieleki and Zapdos, while Gyarados checks Fire-types like Volcarona and Entei. Gyarados benefits greatly from Entei and Incineroar, as they can threaten troublesome Grass-types such as Amoonguss and Rillaboom. Gyarados helps them back with its ability to check Ground-types like Landorus and Groudon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 202058, "username": "Evelyie"}, {"user_id": 541847, "username": "Yourwelcomethanku"}]}
  },
  "Zapdos": {
    "sets": [
      {
        "name": "Rocky Helmet",
        "description": "<p>Zapdos's excellent defensive typing, potent offensive combination of Thunderbolt and Hurricane, and great natural bulk allow it to be a solid check to the likes of Zacian-C, Rillaboom, and Urshifu-R while also holding its own offensively. Hurricane hits all common Pokemon resistant or immune to Thunderbolt, namely Landorus, Groudon, Tsareena, and Rillaboom. Roost and Protect both serve to preserve Zapdos's longevity, though Heat Wave can be used for a third attack to hit Grass- and Steel-types without relying on Hurricane's accuracy. Even though Zapdos is played fairly defensively, it uses an offensive EV spread with maximum speed and power to outspeed and OHKO bulky Urshifu-R, as well as outspeed Kyogre, Groudon, and Landorus-T and strike them for big damage. The combination of Static and Rocky Helmet is used to punish the large variety of physical attackers that run contact moves, such as Zacian-C, Urshifu-R, and Incineroar, chipping and slowing them down for powerful partners like Zacian-C and Calyrex-S to finish them off. Zapdos fits best on slow, bulky teams that thrive in longer games, with partners like Rillaboom and Incineroar that can support Zapdos with Fake Out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Entei": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Entei's ability to check common threats such as Zacian-C and Calyrex-S has made it one of the best Fire-types this tier. The ability to ignore Intimidate and Fake Out from the likes of Incineroar and Mienshao with Inner Focus makes Entei a reliable answer to teams that take advantage of passive play. Sacred Fire handles common threats such as Zacian-C, Rillaboom and Tsareena, while its chance to burn can help mitigate the presence of physical attackers such as Urshifu-R and Landorus-T that would otherwise overcome Entei. Stone Edge picks up KOs on Flying-, Fire-, and Bug-types such as Volcarona and Incineroar, while Stomping Tantrum is able to nail opposing Steel-and Rock-types such as Stakataka and Nihilego. Crunch is a strong move that takes advantage of Entei's good Attack stat for OHKOing Calyrex-S, while Snarl hinders common special attackers such as Xerneas, Calyrex-S, and Eternatus. Extreme Speed is able to secure safe revenge kills against faster targets such as Regieleki. Choice Scarf allows Entei to outspeed Zacian, Calyrex-S, and Nihilego and OHKO them with its powerful moves. Flare Blitz is used instead of Extreme Speed on Choice Scarf variants because of its higher damage output in sun, being able to OHKO maximum HP Stakataka if also boosted by Cherrim's Flower Gift and Helping Hand. Alternatively, Assault Vest with a spread of 140 HP / 140 Atk / 4 Def / 116 SpD / 108 Spe allows Entei to avoid getting 2HKOed by +2 Moonblast from Xerneas.</p> <p>Entei is a great partner for Pokemon like Xerneas and Groudon; (SC) Entei is able to check Zacian-C and Stakataka for Xerneas while it gets rid of Water-types such as Urshifu-R and Palkia, while Groudon's sun helps Entei take care of opposing restricted Pokemon such as Xerneas and Calyrex-S that might give trouble to Groudon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}, {"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 554354, "username": "Pix"}]}
  },
  "Kyogre": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A+</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ",
    "sets": [
      {
        "name": "Mystic Water",
        "description": "<p>Kyogre is one of the most threatening Restricted Pokemon in the metagame thanks to Water Spout's high Base Power, Kyogre's amazing base 150 Special Attack, and rain from Drizzle boosting Water Spout's damage even further. Water Spout is the primary reason to Kyogre, being able to OHKO just about everything weak to it and still doing significant damage to some Pokemon that resist, notably still 2HKOing Miracle Seed Rillaboom. Hydro Pump, Scald, and Origin Pulse are Water-type STAB options that don't rely on Kyogre's HP to deal good damage. Hydro Pump is absolutely necessary for Timid Kyogre, as it is the only possible way to OHKO Calyrex-S outside of Tailwind. Both Hydro Pump and Scald notably bypass Wide Guard from the likes of Araquanid, Stakataka,and Mienshao with the latter also having a chance to burn, whereas Origin Pulse is a higher-Base Power alternative that allows Kyogre to continue hitting both targets at the cost of a significant amount of accuracy. Ice Beam is the primary coverage move for Kyogre, allowing it to do significant damage to Grass-types such as Rillaboom and Tsareena. Thunder is an option for opposing Kyogre; however, it is less advised due to its reliance on rain. A Timid nature allows Kyogre to naturally outspeed the likes of maximum Speed Rillaboom as well as Calyrex-S and Zacian-C at +1.</p> <p>Kyogre really appreciates Tailwind as speed control, as its base 90 Speed is less than ideal, underspeeding several common Pokemon such as Calyrex-S, Regieleki, Zacian-C, and Xerneas. As such, Tornadus is a must-have partner alongside Kyogre, as it can also fire off 100% accurate Hurricanes into the aforementioned Grass-types. Tsareena is also a great partner for Kyogre, as it is capable of blocking Fake Outs that would otherwise disrupt Kyogre, as well as protecting it from Rillaboom's Grassy Glide. Regieleki works well with Kyogre, as its Thunder can't miss in rain and helps deal with opposing Kyogre and Tapu Fini. Like most Pokemon, Kyogre enjoys the presence of Fake Out users such as Incineroar that allow it to pin down KOs. Shedinja is a niche idea that works well with Kyogre, with its Ally Switch and Wonder Guard punishing foes at a moment's notice and Will-O-Wisp shutting down physical attackers such as Rillaboom, Urshifu-R, and Zacian-C.</p> "
      },
      {
        "name": "Choiced Offensive",
        "description": "<p>Kyogre is a threat capable of ripping through majority of the meta thanks to its rain-boosted Water Spouts and amazing base 150 Special Attack. Water Spout hits immensely hard, notably extinguishing the likes of Incineroar, Landorus, and Jolly Zacian-C, at the expense of its Base Power being reliant on Kyogre staying healthy. Scald allows Kyogre to ignore Wide Guard from the likes of Araquanid, Stakataka, and Mienshao while still hitting hard with a Water-type STAB move. Origin Pulse is an alternative that allows Kyogre to deal spread damage while locked into a move at the cost of a bit of accuracy. Ice Beam gives Kyogre the necessary coverage to stand up to the likes of Tsareena and Rillaboom, notably 2HKOing both of them. Thunder is a potential option that Kyogre can use to duel opposing Kyogre, Tapu Fini, and Araquanid, with its perfect accuracy  in rain being a huge boon when locked into the move. Choice Scarf means Kyogre has less reliance on speed control to still do a good amount of damage, whereas Choice Specs will let it deal damage capable of OHKOing most unrestricted hits. The main drawback to a Choice item is that Kyogre cannot run Protect, leaving it susceptible to pins from Fake Out users such as Incineroar and Mienshao and Grassy Glide from Rillaboom.</p> <p>Tsareena is absolutely vital as a partner to a Choice-locked Kyogre, as without Protect it becomes extremely susceptible to Fake Out, Thudurus's Eerie Impulse, and Rillaboom's Grassy Glide. Tornadus is an invaluable partner to Kyogre, as its Tailwind allows Kyogre to fire off maximum power Water Spouts, often taking KOs before the foes can even move. Tornadus also benefits from Kyogre's Drizzle letting its Hurricane always hit in rain. Regieleki is a great partner that benefits from rain, with its Transistor-boosted Thunder capable of taking down opposing Kyogre and Tapu Fini with ease.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Groudon": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>In a metagame where Restricted Pokemon run rampant and the premier teams are sun teams, Groudon is easily a top contender. While Groudon is certainly threatening by itself, it's so good more because Drought serves as a catalyst for two of the metagame's most dangerous Pokemon, those being Charizard and Venusaur. Precipice Blades is Groudon's strongest STAB move and gives it access to Max Quake to boost its weaker Special Defense. Groudon has more consistent STAB options, but there is simply too much opportunity cost to reasonably justify them. Rock Slide gives Groudon means to hit Flying-types such as Zapdos and Yveltal, and most critically it threatens an OHKO against Dynamaxed Charizard via Max Rockfall. Swords Dance is useful for offsetting Intimidate from the likes of Landorus-T and Incineroar, and thanks to Groudon's bulk, it can oftentimes get one or even multiple boosts. Sitrus Berry improves Groudon's longevity as a bulky Swords Dance user and support Pokemon to Charizard and Venusaur. Alternatively, Groudon can run White Herb in order to offset Intimidate and make itself generally more threatening; however, Groudon oftentimes doesn't need to be more threatening because its teammates do that job. The given EV spread allows Groudon to outspeed -1 Thundurus and outspeed Tornadus while at +1, both of which are relevant given Groudon is often paired with Charizard, which can use Max Airstream, and Electroweb Regieleki.</p> <p>Groudon should always be paired with Venusaur and almost always with Charizard; there is simply little reason to not use Pokemon that are so powerful in the sun. Venusaur helps Groudon by thwarting Water-types such as Rotom-W, Blastoise, and Kyogre. In return, Groudon can thwart Fire-types like Incineroar and Coalossal. Charizard can assist Groudon by checking Grass-types such as Rillaboom and Venusaur, while Groudon can check Regieleki and Coalossal for Charizard. Regieleki is a great teammate for being one of the best answers to Kyogre teams, and it can also provide Groudon speed control with Electroweb. Grimmsnarl can provide dual screens to bolster Groudon's already good defensive stats, which can help it set up with Swords Dance more safely. Grimmsnarl can also mitigate Groudon's middling Speed via Scary Face or Thunder Wave. Porygon2 is a great partner for Groudon because it's a great check to Landorus-T with Ice Beam, most importantly, and also Calyrex-S with Eerie Impulse, which are both Pokemon that can greatly trouble Groudon teams. Porygon2 can also provide speed control to Groudon with Trick Room. Incineroar supports pretty much every Pokemon well and Groudon is no exception, appreciating Incineroar's ability to keep the likes of Venusaur, Rillaboom, and Calyrex-S in check if it's running Assault Vest. Umbreon is one of the best answers to Calyrex-S and also a solid answer to Calyrex-I, both of which can greatly trouble Groudon and its common teammates. Note that running Umbreon gives up the ability to reasonably justify Porygon2, which compromises the matchup against Landorus-T.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}
  },
  "Palkia": {
    "sets": [
      {
        "name": "Offensive Trick Room",
        "description": "<p>Palkia has made a name for itself thanks to its ability to reliably set Trick Room with its good bulk and provide a fierce offensive threat with its near-unresisted offensive typing. Hydro Pump is Palkia's strongest Water-type STAB move, OHKOing the likes of Incineroar, Stakataka, and Entei. Spacial Rend does decent damage against Grass-types like Rillaboom and Tsareena and OHKOes offensive Eternatus. Lustrous Orb gives Palkia a much-appreciated power boost that allows Hydro Pump to 2HKO Calyrex-I and enables Spacial Rend to 2HKO Amoonguss and Kyogre. Trick Room helps against the mostly fast-paced meta and can turn the battle into Palkia's favor quickly. Telepathy can be used over Pressure if you have spread moves that would hit Palkia on your team.</p> <p>Palkia appreciates Fake Out support from the likes of Incineroar and Rillaboom to help it set up Trick Room. Incineroar can check Zacian-C and Rillaboom, as can Entei, while Rillaboom can check Tapu Fini for Palkia; in return, Palkia can take care of Fire-types such as Entei and Incineroar. Amoonguss and Indeedee-F can provide redirection to help Palkia set up Trick Room. Pollen Puff from the latter also provides healing, while Psychic Terrain from the former lets Palkia use its strong attacks unimpeded by Fake Out. Stakataka is a great teammate for Palkia, as it helps check Fairy-types such as Tapu Lele and Xerneas. Landorus-T can assist Palkia by checking Rillaboom and Zacian-C.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 554354, "username": "PixxelsVGC"}]}
  },
  "Whimsicott": {
    "sets": [
      {
        "name": "Prankster Support",
        "description": "<p>Whimsicott has always been a staple Pokemon in Gen 8 VGC as the fastest Prankster Pokemon in the format with a wide array of utility. Tailwind is the main point of nearly all Whimsicott sets, as it provides speed control for a whole host of teams, pairing especially well with Calyrex-S, Kyogre, and Zacian-C. Moonblast allows Whimsicott to check some of the common Dark- and Fighting-types in the metagame such as Urshifu-R, Urshifu-S, and Yveltal. Alternatively, Dazzling Gleam deals chip damage to both Pokemon and can KO a low HP Pokemon protected by a redirector such as Indeedee-F. Grass Knot is another option, dealing significant damage to Kyogre and Groudon. Taunt prevents common status moves such as Stakataka's and Palkia's Trick Room and Amoonguss's Spore. Due to the banning of Dynamax, and Fake Out becoming more prevalent, Encore is great for punishing Fake Out from common non-Dark-type users such as Rillaboom and Mienshao as well as more passive moves such as Protect and Substitute from Zacian-C and Calyrex-S. Protect keeps Focus Sash from being broken due to Fake Out, thus guaranteeing Tailwind can be used next turn. Helping Hand allows Whimsicott to still support its partner, even when facing common Fake Out users such as Rillaboom, Incineroar, and Mienshao. Mental Herb cures Taunt from the likes of Incineroar, Tornadus, and opposing Whimsicott.</p> <p>Whimsicott usually takes a supporting role, often paired with an offensive Restricted Pokemon, namely Calyrex-S, Kyogre, or Zacian-C, as Tailwind makes them even greater threats. In a Calyrex-S team specifically, Whimsicott also helps check Calyrex-S counters such as Urshifu-S, Yveltal, and sometimes Galarian Moltres. Another way to utilize Whimsicott is to put it next to a Fake Out user such as Mienshao or Incineroar, thus guaranteeing Tailwind most of the time. Psychic Surge Pokemon such as Indeedee-F and Tapu Lele also help guarantee Tailwind by blocking Fake Out and Prankster Taunt. Fire- and Water-types help Whimsicott by safely switching into Steel- and Fire-types such as Zacian-C, Entei, and Incineroar in case Whimsicott needed to be conserved for the late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 563932, "username": "AletheiaVGC"}]}
  },
  "Amoonguss": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Amoonguss's good bulk and good utility make it a great support Pokemon with the tools to deal with the majority of the metagame. Clear Smog resets the boosts of Geomancy Xerneas and Cosmic Power Eternatus. Amoonguss will always carry Rage Powder, redirecting powerful attacks such as Zacian's Behemoth Blade and Regieleki's Thunder away from its common allies like Xerneas and Kyogre. Spore is used to disrupt the enemy team with sleep while also breaking Trick Room setups. Other options are Pollen Puff to heal your own Pokemon and Grass Knot to hit Groudon and Kyogre hard. Amoonguss will usually carry a Mental Herb to shake off Taunt from threats such as Whimsicott, Tornadus, and Incineroar, but it can also run an Occa Berry to survive Groudon's Heat Crash, Volcarona's Overheat, and Incineroar's Flare Blitz and put them to sleep in return. Regenerator provides Amoonguss longevity, while its EV spread makes it survive a +1 Behemoth Blade from Zacian-C and a Hurricane from Tornadus, although it can never survive a Calyrex-S Expanding Force. Unfortunately, Amoonguss's low offensive presence makes it rely heavily on its partners to deal significant damage. This makes Volcarona and Rillaboom often preferred over it.</p> <p>Amoonguss is a great partner for Zacian-C and Xerneas, since both Pokemon appreciate its redirection and support for setting up or preserving their health. Kyogre is another good option, since its rain weakens Fire-type moves. Fire-types such as Entei and Incineroar are also appreciated, since they can power through opposing Grass-types like Rillaboom and Tsareena easily, which can disrupt Amoonguss because they're immune to Rage Powder and Spore. Landorus, Palkia, and Urshifu-R are other good allies to KO opposing Fire-type Pokemon such as Incineroar and Volcarona.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541609, "username": "Evelyie"}]}
  },
  "Mienshao": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A-</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ",
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<p>With a myriad of utility moves such as Fake Out and Wide Guard, good base 125 Attack and 105 Speed stats, and a naturally good matchup against Incineroar thanks to Inner Focus ignoring Intimidate and Fake Out, Mienshao finds itself as a good offensive utility Pokemon in the current metagame. Close Combat does good damage, taking on the likes of Incineroar and Stakataka, and Mienshao isn't particularly affected by the defensive drops due to its already low defensive stats. Fake Out allows Mienshao to pin down opposing Pokemon for common partners such as Calyrex-S and Nihilego to attack them more freely, with Mienshao notably being able to use it before other common Fake Out users such as Incineroar and Rillaboom. Wide Guard is a must-have utility option that blocks some of the most threatening moves in the game like Calyrex-S's Astral Barrage, Kyogre's Water Spout and Groudon's Precipice Blades. Feint breaking all forms of protection is particularly helpful alongside Calyrex-S, allowing it to click Astral Barrage against most Wide Guard users. Taunt allows Mienshao to disrupt other utility Pokemon such as Volcarona, Amoonguss, and Whimsicott. Knock Off applies heavy pressure to Dark-weak Pokemon such as Aegislash and Calyrex-S. Focus Sash makes up for Mienshao's lack of bulk being the only item viable as a result. Helping Hand is a potential option to boost Mienshao's teammate in situations where its own damage is going to be limited; however this typically means giving up a more valuable utility move.</p> <p>Mienshao's utility can fit onto a wide array of teams, but it is mostly used alongside Calyrex-S. Mienshao's Close Combat is able to pressure two of Calyrex-S's best checks in Incineroar and Urshifu-S, and it also provides Wide Guard for opposing Calyrex-S alongside Feint. Nihilego also appreciates Mienshao, as Fake Out and Feint offer it the best chance to land a Meteor Beam for a crucial Special Attack boost, and it enjoys being protected from Kyogre's Water Spout, Landorus-T's Earthquake, and Groudon's Precipice Blades, which would all otherwise OHKO it. Whimsicott is another Pokemon that appreciates Mienshao's fast Fake Out support, being able to typically safely set up Tailwind as a result.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  },
  "Volcarona": {
    "sets": [
      {
        "name": "Support",
        "description": "<p>With access to good support moves such as Rage Powder and Struggle Bug and a good defensive typing, Volcarona stands out as a top support Pokemon in the Series 10 metagame. Heat Wave is Volcarona's main STAB attack, capable of hitting staples like Rillaboom and Zacian-C for super effective damage while also getting around redirection; Overheat is an alternative option to hit the aftermentioned targets harder and get around Wide Guard of Pokemon such as Mienshao and Celesteela, but its lack of consistency can often be a burden. Furthermore, Volcarona's main role is not one of a damage dealer but of a redirector. Rage Powder is used to protect allies from opposing attacks while they set up or wreak havoc upon the opposing team. However, it also synergizes well with Flame Body, threatening to burn physical attackers such as Zacian-C, Urshifu-R, and Rillaboom that make contact with their moves. Struggle Bug slows down special attackers like Calyrex-S and Xerneas. Whirlwind is an alternative option to phaze threats such as Geomancy-boosted Xerneas and Substitute Calyrex-S, while Quiver Dance makes Volcarona more and more dangerous as boosts stack. Xerneas appreciates Volcarona's ability to redirect opposing moves like Taunt, Fake Out, and Zacian-C's Behemoth Blade on the turn it sets up with Geomancy. Stakataka is also a great partner, as Volcarona can take opposing Fighting-types' moves like Mienshao's Close Combat and Urshifu-R's Surging Strikes and threaten them with a burn while Stakataka sets up Trick Room. Even Zacian-C appreciates Volcarona's help, as it can redirect Landorus's Earth Power and Entei's Sacred Fire, while in exchange, Zacian-C can take out Xerneas and Stakataka for Volcarona with its powerful moves.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 517038, "username": "Giokio"}, {"user_id": 559328, "username": "EzparVGC"}]}
  },
  "Tornadus": {
    "sets": [
      {
        "name": "Tailwind Support",
        "description": "<p>Tornadus utilizes Prankster to support its team with priority status moves and hits opposing Pokemon hard with its strong STAB Hurricane. Hurricane has 100% accuracy when paired with a Rain setter such as Kyogre, which is a common teammate. Tailwind allows Kyogre to outspeed Regieleki, Zacian-C, and Calyrex-S. Tailwind also allows Tsareena, another common teammate, to outspeed Landorus and Kyogre. Taunt prevents Trick Room from users such as Stakataka while also shutting down Spore from Amoonguss and Geomancy from Xerneas. Tornadus can run Icy Wind or Rain Dance over Protect; however, it loses its ability to avoid Fake Out and can easily be OHKOed by Pokemon such as Regieleki. Icy Wind provides coverage and speed control, comfortably 2HKOing Pokemon such as Landorus and letting Tornadus control the game's pace if hit by taunt. Rain Dance is useful when playing against Groudon and Torkoal, resetting the weather for Kyogre and weakening Groudon's Heat Crash and Torkoal's Eruption. Focus Sash allows Tornadus to survive Regieleki's Thunderbolt and Volt Switch as well as powerful moves such as Kyogre's Water Spout. Mental Herb allows it to ignore Taunt and Encore and still utilize Tailwind and Taunt for its team. Wacan Berry stops Regieleki's Thunderbolt from OHKOing Tornadus and lets another teammate utilize focus sash. Life Orb allows Tornadus to OHKO Pokemon such as Volcarona and Landorus but hinders its survivability and demands running Icy Wind over Protect.</p> <p>Tornadus and Kyogre work well together because Tornadus threatens opposing Grass-types for Kyogre and allows it to outspeed Regieleki with Tailwind. Regieleki poses a major threat to Tornadus and Kyogre, so Pokemon that can deal with it such as Tsareena, Rillaboom, and Landorus are very good choices for teammates. Tsareena is a great partner for Tornadus, as it shuts down opposing Fake Out, allowing Tornadus to more safely set up Tailwind. Rillaboom offers Fake Out to assist Tornadus in setting up Tailwind, and it can take out Regieleki with Grassy Glide. Landorus offers Electric immunity and can OHKO Regieleki and Zacian-C, Pokemon that Tornadus cannot handle.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 510629, "username": "Mustash"}]}
  },
  "Thundurus": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A-</a></p> ",
    "sets": [
      {
        "name": "Prankster Support",
        "description": "<p>Thundurus's excellent status moves such as Eerie Impulse and Scary Face backed by Prankster make it one of the most consistent support options in the metagame. Additionally, its defensive typing allows it to stand up to the likes of Zacian-C and Rillaboom quite nicely. Even without Special Attack investment, Thunderbolt will bring Urshifu-R down to its Focus Sash and always 2HKO offensive Kyogre. Eerie Impulse is vital for crippling threatening special attackers such as Xerneas, Calyrex-S, and Kyogre, though be sure to watch out for Tsareena's Queenly Majesty and Psychic Terrain, as they block Thundurus's status moves due to prankster. Taunt can shut down Pokemon heavily reliant on status moves such as Volcarona, Amoonguss, and Porygon2. Scary Face gives Thundurus a reliable form of speed control, though Thunder Wave can be used to fish for full paralyses at the cost of being ineffective against Electric- and Ground-types. Sitrus Berry and Mago Berry improve Thundurus's longevity, whereas Safety Goggles allows it to circumvent Rage Powder users such as Amoonguss and Volcarona while also blocking Amoonguss's Spore. Thundurus is rather passive and slow-paced, so it works well with Pokemon like Incineroar and Rillaboom that match its tempo; however, it's important to remember that it needs offensive partners such as Zacian-C, Calyrex-S, and Urshifu-R to do the heavy lifting when it comes to dealing damage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Landorus": {
    "sets": [
      {
        "name": "Life Orb Attacker",
        "description": "<p>Landorus is one of the most common Pokemon in the metagame, as the combination of Sheer Force and Life Orb allows it to do significant damage to common Pokemon in the Series 10 metagame. Earth Power hits important Pokemon such as Incineroar, Zacian-C, Entei, and Regieleki and 2HKOes a majority of the tier, allowing Landorus to tear through teams that can't KO it quickly. Sludge Bomb hits Earth Power-resistant Grass-types like Rillaboom and Tsareena and can potentially OHKO them if they are not Assault Vest variants. Protect tends to be the go-to third move for Landorus, while the final move slot has a bit more options. Substitute gives Landorus the ability to avoid damage and pairs extremely well with the metagame's many Fake Out users. Substitute also takes advantage of defensive plays and switches by punishing an opponent's passivity. Other options are Stone Edge and Rock Slide. Even with a hindering nature and no Attack investment, Stone Edge OHKOes maximum Defense Volcarona, while Rock Slide does sizable damage to Volcarona and Flying-types and hits both of the opponent's Pokemon. Choice Scarf is an option to outspeed and OHKO Zacian-C. However, Choice Scarf sees less usage than Life Orb due the inflexibility of not being able to swap moves and missing out on some important OHKOs. A Timid nature allows Landorus to outspeed Urshifu-R and Xerneas.</p> <p>Incineroar, Rillaboom, and Mienshao are strong partners due to their ability to apply pressure with Fake Out and support Landorus in various ways; Incineroar provides damage reduction, Rillaboom covers Water-types, and Mienshao provides Feint and Wide Guard. Landorus also appreciates some sort of speed control, such as Electroweb from Regieleki or Tailwind from Tornadus, in order to allow it outspeed Zacian-C and OHKO it without needing to take Behemoth Blade. There are two common ways to check Landorus; bulky Water-types like Kyogre and Suicune can tank Landorus's attacks and retaliate with an OHKO, while foes like Yveltal are immune to Earth Power and take neutral damage from Sludge Bomb, leaving Landorus with minimal ways to deal heavy damage to them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 426995, "username": "Namuko Pro"}]}
  },
  "Landorus-Therian": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Landorus-T has a favorable matchup against a good portion of the Series 11 metagame including, but not limited to, sun teams and Zacian-C compositions lacking Lapras. Intimidate allows it to weaken opposing Groudon and Zacian-C, two physical Restricted Pokemon at the forefront of the metagame. Earthquake deals massive damage to staples like Incineroar, Zacian-C, and Coalossal while also getting around redirection from Indeedee-F. It turns into Max Quake under Dynamax, allowing Landorus-T to boost its and its allies' Special Defense. Rock Slide complements Earthquake well by giving good coverage against Rotom-H, Charizard, and Zapdos. Swords Dance counteracts Intimidate and turns Landorus-T into a massive offensive threat, punishing passive leads. Fly turns into Max Airstream under Dynamax, allowing Landorus-T to hit Pokemon such as Urshifu-R and Rillaboom while also boosting its and its allies' Speed. Lum Berry offsets Sleep Powder from Venusaur and Will-O-Wisp from the likes of Rotom-H and Mimikyu, and alongside Grimmsnarl's dual screens, it makes Landorus-T a major threat to most sun compositions. Life Orb gives Landorus-T more immediate offensive presence at the cost of more vulnerability to status conditions.</p> <p>Landorus-T complements Zacian-C well by checking sun teams, especially checking Groudon and Venusaur. Zacian-C helps check Calyrex-I in return with its Ice-resistant typing and super effective Behemoth Blade. Landorus-T appreciates Grimmsnarl's dual screens to tank hits from threats like Charizard and Zacian-C and set up Swords Dance against passive leads. Incineroar has good type synergy with Landorus-T and provides it with Fake Out and Intimidate support, allowing it to set up Swords Dance safely. It also helps by pivoting around with Intimidate and Parting Shot against Landorus-T's biggest nemesis, Calyrex-I. Rillaboom helps Landorus-T hit bulky Water-types such as Kyogre and Lapras while aiding it with Fake Out in a similar way to Incineroar. Regieleki doubles down as a check to bulky Water-types alongside Rillaboom, as well as providing valuable speed control in Electroweb.</p> "
      },
      {
        "name": "Assault Vest",
        "description": "<p>Landorus-T, with the combination of Intimidate and Assault Vest giving it great mixed bulk, is strong against a majority of the metagame, including Coalossal-oriented teams and Zacian-C compositions without Lapras. Earthquake hits crucial Pokemon such as Incineroar and Zacian-C hard. It turns into Max Quake during Dynamax, further bolstering Landorus-T's Special Defense. Rock Slide is a good coverage option to hit Rotom-H, Charizard, Yveltal, and Zapdos. Fly is used for Max Airstream under Dynamax, which boosts Landorus-T's and its allies' Speed while also hitting the likes of Rillaboom and Urshifu-R. U-turn allows Landorus-T to pivot in and out, stacking Intimidate drops alongside Incineroar. The Speed investment allows it to outspeed and OHKO uninvested Thundurus after an Electroweb from Regieleki. Assault Vest, in conjunction with dual screens from Grimmsnarl, allows Landorus-T to comfortably withstand Charizard's G-Max Wildfire in sun and OHKO it back with Max Rockfall. It also allows Landorus-T to always survive at least two Yveltal Max Darknesses. Landorus-T is never 2HKOed by any of +2 Coalossal's attacks with Light Screen up, even with the residual damage from G-Max Volcalith.</p> <p>Landorus-T complements sun compositions with Zacian-C by being a good answer into Coalossal teams. Zacian-C in return helps it beat two of its biggest checks in Calyrex-I and Lapras under Gigantamax. Landorus-T appreciates Grimmsnarl's dual screens bolstering its bulk to phenomenal levels in conjunction with Intimidate, Assault Vest, and the doubled HP from Dynamax, allowing it to take strong attacks from Pokemon such as Charizard in sun and Zacian-C. Grimmsnarl also helps Landorus-T with its Speed via Scary Face or Thunder Wave, allowing it to outspeed and OHKO or 2HKO Gigantamaxed Charizard and Zacian-C with Max Rockfall and Max Quake, respectively. Landorus-T is a good Intimidate pivot alongside Incineroar, which supports it with Fake Out and Parting Shot against imposing threats such as Calyrex-I and Zacian-C. Rillaboom also carries Fake Out while helping Landorus-T hit bulky Water-types like Kyogre and Lapras. Regieleki checks Water-types such as Urshifu-R further alongside Rillaboom and also provides Landorus-T with valuable speed control in Electroweb.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}]}
  },
  "Xerneas": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A</a></p> ",
    "sets": [
      {
        "name": "Geomancy",
        "description": "<p>Xerneas is one of the most threatening wincons in the metagame thanks to the combination of Geomancy, Power Herb, and Fairy Aura turning it into a cleaning machine upon setup. Moonblast is Xerneas's strongest single-target option, capable of OHKOing Calyrex-S, physically defensive Incineroar, and Groudon at +2. Dazzling Gleam gives Xerneas a spread move option, useful for cleaning up weakened foes and circumventing redirection users like Volcarona and Indeedee-F. The HP investment allows Xerneas to always survive a Water Spout from Modest Choice Scarf Kyogre, while the Special Attack investment guarantees an OHKO on unboosted 4 HP Xerneas. Maximum Speed investment with a Timid nature is crucial for outspeeding the plethora of Pokemon in or around the base 90 Speed tier, such as Groudon, Kyogre, Urshifu-R, and Tapu Lele.</p> <p>Xerneas needs a safe turn to set up Geomancy, and, as such, appreciates Pokemon like Incineroar, Rillaboom, and Volcarona that can support it with Fake Out or redirection. Additionally, the aforementioned Fire-types help it pressure two of its most common checks, Amoonguss and Zacian-C. Thundurus can cripple Xerneas with Eerie Impulse and Scary Face, so having a priority blocker like Tsareena, Indeedee-F, or Tapu Lele is helpful to allow Xerneas to set up safely. Landorus is also an excellent Xerneas partner, as it cleanly OHKOes common Xerneas checks such as Entei, Stakataka, Incineroar, and Zacian-C with Earth Power.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Yveltal": {
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Even though Yveltal isn't been the most dominant restricted Pokemon, it has made a name for its ability to deal good damage thanks to Dark Aura while also providing good support to its teammates. Oblivion Wing threatens common Grass-types such as Rillaboom and Whimsicott, is able to 2HKO Bulky Urshifu-R, and provides a fairly reliable source of recovery. Snarl is an awesome tool to lower the Special Attack of many threats such as Kyogre, Xerneas, and Palkia and has the added benefit of bypassing Calyrex-S's Substitute to inflict an OHKO. Foul Play allows Yveltal to 2HKO Adamant Assault Vest Rillaboom and Interepid Sword-boosted Zacian-C. Sucker Punch allows Yveltal to get the upper hand against faster Pokemon such as Calyrex-S and Regieleki and secure safe revenge kills. This EV spread enable it to live a Magnet Thunderbolt from Regieleki and Play Rough from a neutral-natured Zacian-C.</p> <p>Stakataka is a great partner to get rid of Fairy-Types that give Yveltal a hard time while also giving the team a slow option. Rillaboom checks Tapu Fini and provides Fake Out and U-turn support to put Yveltal in better positions. Incineroar provides Fake Out, Snarl, Parting Shot and Intimidate support to gain momentum and protect Yveltal by softening damage dealt by opponents such as Xerneas and Zacian-C, possibly turning many OHKOs into 2HKOs.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 554354, "username": "PixxelsVGC"}]}
  },
  "Incineroar": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>A staple in VGC, Incineroar once again reigns as the best utility Pokemon in Series 10. Incineroar has a plethora of utility options including Fake Out, Parting Shot, Taunt, and Snarl that allow it to control the field and disrupt the opposing Pokemon. Fake Out allows it to pin down a threat on the enemy team. Parting Shot allows it to safely switch in another Pokemon, partly in thanks to its low Speed, while lowering the enemy's offensive stats, allowing Incineroar to take a hit before pivoting out. Flare Blitz hits Pokemon such as Rillaboom, Zacian-C, and Tsareena for heavy damage. Taunt shuts down Pokemon such as Whimsicott, Porygon2, and Amoonguss. Snarl lets Incineroar pressure special attackers such as Regieleki and Calyrex-S. Darkest Lariat nails Pokemon that are weak to it, including Calyrex-S and Indeedee-F, and even pressures Defense-boosting Pokemon such as Cosmic Power Eternatus.</p> <p>Thanks to the amount of utility that Incineroar provides, it is able to fit on virtually any team and do well. The given EVs let it survive Sacred Sword from Zacian-C, Surging Strikes from Jolly maximum Attack Urshifu-R, and Close Combat from Mienshao with a 94% chance. Alternatively, Incineroar can run an EV spread of 236 HP / 36 Def / 236 SpD with a Careful nature, allowing it to survive a +2 Moonblast from Timid Xerneas.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 547596, "username": "Helios of Sun"}]}
  },
  "Tsareena": {
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Tsareena's Queenly Majesty allows it to protect allies from priority attacks, and its solid 120 Attack and respectable movepool allow it to provide good damage output. Power Whip is Tsareena's main STAB move, allowing it to OHKO Kyogre and Tapu Fini and 2HKO Calyrex-S and Xerneas. U-turn, paired with Tsareena's relatively slow Speed can grant safe switches for Restricted partners like Kyogre and Groudon . High Jump Kick hits Stakataka, Incineroar and Urshifu-S and Triple Axel threatens Landorus, Tornadus, Rillaboom and Whimsicott. The given EV spread, paired with Assault Vest allows Tsareena to survive a Moonblast from Modest +2 Xerneas. Kyogre makes a great ally to Tsareena, setting up the rain so Fire-types like Incineroar can't OHKO it, while Tsareena shuts down Grassy Glide from Rillaboom and Eerie Impulse from Thundurus, as well as checking Regieleki. Tsareena also pairs well with Lunala and Calyrex-S, as it protects them from Sucker Punch and Shadow Sneak from threats like Urshifu-S and Aegislash. Tsareena also pairs nicely with Incineroar and Regieleki, as it covers their weaknesses to Water- and Ground-types and forms a nice pivoting core.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "kris"}]}], "writtenBy": [{"user_id": 541609, "username": "Evelyie"}]}
  },
  "Tapu Lele": {
    "sets": [
      {
        "name": "Choiced Offensive",
        "description": "<p>Tapu Lele is one of only three automatic Psychic Terrain setters in the game and it has a great offensive typing, being a Psychic-type that can threaten Dark-types such as Yveltal and Urshifu-S with its strong Fairy-type STAB move. Psychic Terrain strengthens its Psychic-type STAB moves and blocks crucial priority moves such as Fake Out from Incineroar and Rillaboom. Moonblast hits Pokemon such as Palkia for a 2HKO and has a very favorable roll to 2HKO Assault Vest Yveltal. Psyshock hits common specially defensive Pokemon such as Nihilego for an OHKO and Assault Vest Rillaboom and Entei harder than Psychic. Alternatively, Psychic targets the lower Special Defense of Pokemon such as bulky Urshifu-R for an OHKO and Landorus-T for a 2HKO. Shadow Ball crucially OHKOes Calyrex-S and 2HKOes Lunala through Shadow Shield. Choice Scarf allows Tapu Lele to outspeed threats such as Calyrex-S and Nihilego and threaten to OHKO them. Choice Specs boosts its already great Special Attack to insane levels, enabling it to OHKO Palkia and 2HKO the likes of Rillaboom, Calyrex-I, and Suicune. Dazzling Gleam can be used in order to KO a low HP Pokemon and chip the other or KO a low HP Pokemon behind a redirector such as Amoonguss. Nature's Madness is a good option with Choice Scarf, halving the HP of bulky Pokemon that can easily withstand Tapu Lele's attacks such as Incineroar, Rillaboom, and Zacian-C. Also with Choice Scarf, Magic Room can be run to impede Xerneas's Geomancy setup by disabling Power Herb.</p> <p>Tapu Lele's Psychic Terrain gives Calyrex-S and Lunala a huge power boost to their Expanding Forces. It also protects them from dangerous priority moves like Sucker Punch from Urshifu-S and Shadow Sneak from Mimikyu and Shedinja. Entei, Mienshao, and Urshifu-R are good partners for Tapu Lele, as they can check Steel-types such as Stakataka and Zacian-C. Choice Specs Tapu Lele appreciates speed control, as its base 95 Speed leaves it outsped by many common Pokemon such as Nihilego, Landorus, and Entei, so Tailwind support from Whimsicott and Tornadus can help it wreak havoc with its powerful attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 518634, "username": "Dawn Greninja"}]}
  },
  "Tapu Fini": {
    "sets": [
      {
        "name": "Support",
        "description": "<p>Tapu Fini is a great bulky Water-type due to its support options that can effectively deal with threats such as Kyogre and Calyrex-S. Moonblast is its main STAB move, hitting Urshifu-R while being able to lower Calyrex-S's and Xerneas's Special Attack. Nature's Madness patches Tapu Fini's lack of offensive presence, being able to damage Zacian-C and Xerneas for half of their remaining HP. Icy Wind aids slower allies such as Landorus in outspeeding and threatening Zacian-C, while Heal Pulse is great for healing Tapu Fini's partners and punishing defensive play. Misty Surge enables Tapu Fini to soft check Pokemon that rely on status conditions such as Amoonguss, Volcarona and Zapdos. Wiki Berry paired with Tapu Fini's EV spread allows it to take many hits such as +1 Zacian-C's Behemoth Blade, +2 Xerneas's Moonblast, +1 Nihilego's Sludge Bomb, and Rillaboom's Grassy Glide in Grassy Terrain. For restricted partners, Zacian-C, Groudon, and Necrozma-DM are great allies, being able to check Rillaboom easily while Tapu Fini threatens Urshifu-R and protects them from burns. As for non-restricted Pokemon, Incineroar and Entei are great to quickly check Grass-types like Tsareena and Rillaboom for Tapu Fini, while it checks Urshifu-R and Kyogre in return. Landorus is another good option, being able to OHKO Nihilego, Zacian-C, and Stakataka. Rillaboom's and Incineroar's Fake Out pressure offers Tapu Fini opportunities to easily damage opposing threats, leaving them in range for a potential Grassy Glide or Flare Blitz.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 541609, "username": "Evelyie"}]}
  },
  "Lunala": {
    "sets": [
      {
        "name": "Trick Room Attacker",
        "description": "<p>With a unique movepool and powerful signature ability, Lunala carves out a niche as an offensive Trick Room user. Moongeist Beam is a powerful STAB move for Lunala, hitting most popular Pokemon for neutral damage. Meteor Beam gives it great coverage, dealing super effective damage to the most popular Dark-type Pokemon, Incineroar. Lunala is a particularly effective Trick Room user thanks to Shadow Shield. While at full health, it can survive double targets that use strong attacks, including Zacian's Behemoth Blade and Kyogre's Water Spout, and set Trick Room afterwards. For its last move slot, Lunala can choose between Wide Guard and Protect. Wide Guard allows Lunala to discourage the powerful spread moves in the format, most notably Calyrex-S's Astral Barrage, while Protect instead gives it a more consistent positioning move. This EV spread gives Lunala the bulk to turn +0 Zacian's Behemoth Blade into a 3HKO even without Shadow Shield, but the spread is flexible and can be adapted in many ways.</p> <p>Lunala works well with partners that help it set Trick Room. Incineroar can suppress an opposing Pokemon with Fake Out, while also lowering foes' offensive power with Intimidate and Parting Shot. Amoonguss provides redirection support via Rage Powder, and can disable opposing Pokemon with Spore once Trick Room is up. Lunala also appreciates support moves that heal it back to full health and reactivate Shadow Shield, such as Tapu Fini's Heal Pulse and Amoonguss's Pollen Puff. Stakataka is another good inclusion for Lunala teams, as it provides another option for setting Trick Room and can take advantage of the effect itself. Lunala struggles to damage Dark-type and Normal-type Pokemon after using Meteor Beam; for example, Indeedee can redirect its powerful Moongeist Beam with Follow Me, or even threaten Lunala with a super effective Shadow Ball. Incineroar that run Throat Chop or Darkest Lariat are also capable of inflicting lots of damage, though they need to watch out for Meteor Beam.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 43686, "username": "Ace Emerald"}]}
  },
  "Nihilego": {
    "sets": [
      {
        "name": "Meteor Beam",
        "description": "<p>Nihilego's ability to snowball through teams and check Pokemon like Xerneas, Rillaboom, and Incineroar makes it a great Pokemon in the format. Meteor Beam can OHKO Landorus and Incineroar, and then give two Special Attack boosts thanks to Beast Boost. Power Gem is Nihilego's main attack after Power Herb is consumed. It can also run Clear Smog over Sludge Bomb to reset boosts from Xerneas, but its low damage output is a big drawback. Protect is standard, while Trick Room is a counter to hyper offense or slow teams that set Trick Room themselves. Nihilego is physically fragile, but its EV spread allows it to survive Miracle Seed Rillaboom's Grassy Glide.</p> <p>Calyrex-S and Zacian-C are great Restricted partners for Nihilego, since they can deal with Psychic-types such as Tapu Lele with ease, while Nihilego protects them from Incineroar and Volcarona while also putting Xerneas in check. As for non-Restricted partners, Nihilego appreciates Urshifu-R's ability to shut down threats like Assault Vest Landorus-T, while Nihilego checks Yveltal and Rillaboom. Incineroar and Landorus-T weaken foes such as Rillaboom with Intimidate to provide Nihilego more longevity. Fake Out from Incineroar, Rillaboom, or Mienshao also allows Nihilego to get its Meteor Beam off more safely. Mienshao can use Feint to open the way for Nihilego's Meteor Beam while also protecting it from Kyogre's Water Spout, Groudon's Precipice Blades, and Landorus-T's Earthquake with Wide Guard.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541609, "username": "Evelyie"}]}
  },
  "Necrozma-Dusk-Mane": {
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>Necrozma-DM is an extremely bulky and decently powerful Pokemon most notable for its excellent matchup against Xerneas. A mixed set avoids being slowed down horribly by Intimidate from the likes of Incineroar and Landorus-T. Even with low Attack investment Sunsteel Strike still hits hard, being able to 2HKO Xerneas and Grimmsnarl. Earth Power crucially hits Incineroar and OHKOes Stakataka. Photon Geyser OHKOes Urshifu-R and gives Necrozma-DM a strong STAB attack unaffected by Intimidate. Trick Room takes advantage of Necrozma-DM's middling speed, allowing it to turn the battle into its favor. Prism Armor and Necrozma-DM's massive bulk make it a good Weakness Policy user often able to stomach super effective attacks, such as Yveltal's Foul Play or Landorus Earth Power. Safety Goggles is an option that protects Necrozma-DM from Amoonguss and Venusaur's sleep moves and bypasses Volcarona and Amoonguss's Rage Powder, though without potential boosts from Weakness Policy Necrozma-DM's damage output can be underwhelming. Expanding Force can be run over Photon Geyser if Necrozma-DM is paired with Indeedee-F or Tapu Lele. Necrozma-DM has a higher Special Attack stat than Attack on this set to ensure that Photon Geyser will be special.</p> <p>Necrozma-DM is severely threatened by Calyrex-S, so it appreciates help from Dark- or Normal-type Pokemon such as Indeedee-F, Incineroar, and Galarian Moltres. Kyogre can take a few attacks from Necrozma-DM, outspeed and easily 2HKO it in return, so Grass-types such as Rillaboom and Amoonguss can help keep it in check. Redirection users like Volcarona, Indeedee-F, and Amoonguss or Fake Out users such as Rillaboom and Incineroar can help Necrozma-DM set up Trick Room. Urshifu-R is a great partner that appreciates Necrozma-DM's ability to handle Xerneas and in return can check Fire-types such as opposing Volcarona and Incineroar. Nihilego and Landorus-T can answer these Fire-types as well.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Necrozma-DM has plenty of opportunity to set up Swords Dance with its massive bulk and proceed to launch boosted attacks of its monstrous base 157 Attack. Sunsteel Strike is Necrozma-DM's strongest physical Steel STAB attack, being able to slam Xerneas very hard and OHKO Tapu Lele. Stone Edge hits Fire-types like Incineroar and Entei and notably OHKOes Volcarona. Rock Slide is an alternative for spread damage, but it fails to OHKO maximum Defense Volcarona. Since running Rock coverage unfortunately leaves Necrozma-DM walled by Urshifu-R and Kyogre, Photon Geyser is an option for OHKOing the former and hitting the latter hard; however, this leaves Necrozma-DM walled by Incineroar. Swords Dance can offset Intimidate from the likes of Incineroar and Landorus-T and boost Necrozma-DM's Attack to insane levels, for example OHKOing Yveltal with +2 Sunsteel Strike or +1 Stone Edge. Trick Room can turn the battle in Necrozma-DM's favor due to its middling speed. Weakness Policy has good synergy alongside Swords Dance, enabling you to discourage your opponent from attacking Necrozma-DM in respect to the item and punish them. Alternatively, Safety Goggles lets Necrozma-DM bypass redirection from Volcarona and Amoonguss whilst protecting it from the latter's Spore.</p> <p>Necrozma-DM appreciates redirection users such as Indeedee-F, Amoonguss, and Volcarona and Fake Out users such as Incineroar and Rillaboom to help it set up Swords Dance and Trick Room. Urshifu-R is an amazing teammate for its ability to thwart Fire-type threats to Necrozma-DM like Volcarona and Incineroar; in return, Necrozma-DM checks Xerneas. As Kyogre outspeeds and 2HKOes Necrozma-DM, Grass-types such as Rillaboom and Amoonguss can help keep it in check. Nihilego and Landorus-T are good teammates for their ability to check Fire-type threats towards Necrozma-DM such as Incineroar and Volcarona. Calyrex-S threatens Necrozma-DM immensely, so Dark- and Normal-types such as Indeedee-F, Incineroar, and Galarian Moltres can help keep Calyrex-S in check. Araquanid and Mienshao's Wide Guard can help protect Necrozma-DM from Calyrex-S and Kyogre's powerful spread attacks, helping it to set up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}
  },
  "Stakataka": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A-</a></p> ",
    "sets": [
      {
        "name": "Offensive Trick Room",
        "description": "<p>Stakataka's high Defense, excellent defensive typing, and great movepool allow it to be a key force in the Series 10 metagame. Its Gyro Ball hits almost the entire metagame at full power thanks to its low Speed and is excellent for checking Xerneas. Body Press lets Stakataka 2HKO Incineroar while being unaffected by Intimidate, and only gets stronger with each KO it takes thanks to Beast Boost raising Stakataka's Defense. Trick Room helps versus the mostly fast-paced meta, and can turn the battle in Stakataka's favor extremely quickly. Finally, Wide Guard is able to ward off threatening spread moves such as Astral Barrage, Water Spout, Electroweb, and Precipice Blades. Wide Guard can be switched out for Protect to avoid Fake Outs and other hits or Rock Slide for situations where teams need Rock-type coverage against Pokemon such as Yveltal and Volcarona. Chople Berry helps Stakataka survive Fighting-type hits from Urshifu-S, Urshifu-R, Mienshao, and Zacian-C. Safety Goggles can be an option to deal with Spore Amoonguss and Sleep Powder Venusaur, as well as ignoring Rage Powder from Amoonguss and Volcarona. Lastly, for more offensive variants, Life Orb is an option, boosting the power of Stakataka's already powerful attacks. The given EV spread allows Stakataka to survive a Helping Hand-boosted +2 Moonblast from Xerneas or a Life Orb- and Helping Hand-boosted Astral Barrage from Calyrex-S, as well as a chance of living Close Combat from Choice Band Urshifu-S and Urshifu-R should it be holding Chople Berry. Some Stakataka choose to use an offensively oriented EV spread with 252 HP / 252 Atk / 4 SpD, especially if holding Life Orb.</p> <p>Stakataka loves Fake Out users to help it set up Trick Room, so Incineroar and Rillaboom work magnificently Rillaboom more so, as they cover each other's weaknesses very well. Stakataka also appreciates redirection to help with setting up Trick Room, so Indeedee-F, Volcarona, and Amoonguss are great with it as well. Stakataka also pairs well with Groudon and Palkia, as Stakataka covers Xerneas and Yveltal for them and uses Wide Guard to block threatening spread moves. Groudon covers Stakataka's Water weakness with Drought, while Palkia covers Stakataka's Ground weakness with STAB Water-type attacks to threaten Groudon, Landorus, and Landorus-T.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 541946, "username": "Br0Sk1llz"}]}
  },
  "Rillaboom": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A+</a></p> ",
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<p>Rillaboom's good matchup against restricted Pokemon such as Kyogre and Xerneas, and its Grassy Terrain-boosted Grassy Glide, makes it a great Pokemon in the format. Grassy Glide allows Rillaboom to immediately check faster threats such as Regieleki and Urshifu-R while being its primary STAB move. Wood Hammer can OHKO Nihilego, bulky Kyogre, and Groudon while avoiding Tsareena's Queenly Majesty. Knock Off is an alternative move to get rid of items such as Xerneas's Power Herb and Incineroar's Figy Berry while also threatening Calyrex-S and Shedinja. Fake Out is a great tool for regaining momentum, stopping opposing setup such as Tornadus's Tailwind while leaving their users open for attacks from Rillaboom's allies. U-turn lets Rillaboom pivot in and out while recycling its Fake Out and Grassy Terrain. This EV spread, together with the Assault Vest, allows Rillaboom to live +2 Xerneas's Moonblast and comfortably take Calyrex-S's Astral Barrage.</p> <p>Rillaboom can partner with everything and do well due to its pressure and damage, but notable Restricted partners are Zacian-C and Xerneas, since they appreciate Fake Out pressure to set up Substitute or Geomancy, respectively. Groudon also appreciates Rillaboom, since it keeps Kyogre in check. As for non-Restricted partners, Fire-types such as Incineroar and Entei are appreciated to break through Grass-types that could wall Rillaboom, such as Tsareena and Amoonguss. Urshifu-R and Landorus are also good partners, since they can easily deal with Incineroar and Volcarona.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541609, "username": "Evelyie"}]}
  },
  "Indeedee-F": {
    "sets": [
      {
        "name": "Support",
        "description": "<p>Indeedee-F has made a name for itself as one of the best Follow Me and Terrain setters thanks to its amazing support movepool. Psychic Terrain's ability to block Fake Out and its Helping Hand support makes it partner well with Calyrex-S, Incineroar, and Stakataka. Expanding Force is a powerful STAB boosted by Psychic Terrain that hits the likes of Urshifu-R and Eternatus hard. Follow Me is a great tool to protect frail partners such as Calyrex-S as they set up Substitute or wreak havoc with their powerful moves. Helping Hand's power boost potentially turns many 2HKOs into OHKOs. Heal Pulse is also another situational move to support allies on bulkier teams that feature Necrozma-DM and Eternatus. The given EV spread allows Indeedee-F to take Adamant Rillaboom's Wood Hammer, Urshifu-R's Surging Strikes, and Zacian-C's unboosted Behemoth Blade while 2HKOing bulky Urshifu-R and Eternatus with Expanding Force. Shadow Ball is an alternative over Helping Hand to better check opposing Calyrex-S, threatening it with a 2HKO, but Helping Hand is usually preferred. Common partners include Calyrex-S, Incineroar, and Stakataka. Stakataka benefits from Follow Me to set up Trick Room more safely. Indeedee-F's Psychic Terrain also neuters Rillaboom's Grassy Glide and Shedinja's and Aegislash's Shadow Sneak, which threaten Calyrex-S so much, while Helping Hand support makes Astral Barrage or Expanding Force hit as hard as possible. However, Indeedee-F is easily checked by Intrepid Sword-boosted Zacian-C and Body Press Stakataka, and almost all restricted Pokemon can threaten Indeedee-F with a 2HKO, so preserving its health is often important in order to redirect important attacks late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 554354, "username": "PixxelsVGC"}]}
  },
  "Dragapult": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Dragapult is a powerful attacker on a wide variety of teams thanks to its great typing, incredible Speed, and access to Max Airstream. Phantom Force can be used both defensively, by dodging incoming Max Moves, and offensively, by breaking the foe's Protect. Under Dynamax, Phantom Force becomes Max Phantasm, which allows Dragapult to easily snowball by lowering opponents' Defense. Fly is mainly used because it turns into Max Airstream, allowing Dragapult to hit Urshifu-S and raising its and its allies' Speed. Dragon Darts, thanks to its smart targeting mechanic, is able to punish defensive play without requiring any prediction from the player. Max Wyrmwind makes it difficult for the opponent to answer Dragapult offensively by weakening physical attackers such as Calyrex-I, Landorus-T, and Zacian-C. Dragon Dance is a high-risk, high-reward option that punishes passive play. Lum Berry stops Dragapult from getting crippled by Venusaur's Sleep Powder, Grimmsnarl's Thunder Wave, and Mimikyu's Will-O-Wisp, keeping its offensive presence on the field; it is especially valuable alongside Clear Body, which also prevents stat drops from the likes of Intimidate and Fake Tears. Life Orb boosts Dragapult's already good Attack significantly. Adamant Dragapult, when Dynamaxed, can pick up an OHKO on Assault Vest Rillaboom, and a 2HKO on Venusaur and Charizard under Gigantamax, with Max Phantasm. When paired with Coalossal, Dragapult runs Surf in the second moveslot to activate its Steam Engine and Weakness Policy.</p> <p>Dragapult pairs well with Zacian-C, Urshifu-S, and Urshifu-R, as its Max Airstream and Max Phantasm provide them great support. Dragapult appreciates Fake Out support from the likes of Incineroar and Follow Me support from Indeedee-F to freely set up with Dragon Dance. Coalossal is also a great partner for Dragapult, since Surf Dragapult can activate Steam Engine and Weakness Policy for Coalossal thanks to its great Speed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 554354, "username": "Pix"}]}
  },
  "Zacian-Crowned": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Zacian-C is the the best Restricted Pokemon in Series 11 due to its sky-high Attack stat, great Speed, and great defensive typing. Behemoth Blade is an excellent STAB move that is able to punish Dynamax-reliant Pokemon like Venusaur and Thundurus. Sacred Sword and Close Combat maul threats that resist Behemoth Blade like Kyogre, Urshifu-S, and mainly Incineroar, which a Fairy-type STAB move wouldn't be as effective against. Sacred Sword is weaker, but its ability to get around Max Steelspike's boosts keeps it optimal, while Close Combat is an explosive attack that can OHKO physically defensive Incineroar at +1. Substitute protects Zacian-C from status conditions and Intimidate while punishing passive plays; meanwhile, Swords Dance allow Zacian-C to keep its offensive presence even after getting crippled by Intimidate and Max Wyrmwind. The Adamant nature optimizes the Attack gain from Intrepid Sword and Swords Dance, while the Speed EVs allow it to outspeed even Venusaur in sun while at +1. Its good bulk allows it to survive Venusaur's Max Quake and opposing Zacian-C's Behemoth Blade, and with dual screens support it can even survive Landorus-T's Max Quake and Venusaur's Max Flare.</p> <p>Grimmsnarl's dual screens and speed control in Scary Face allow Zacian-C to more safely pressure targets like opposing Zacian-C, Groudon, Venusaur, and Landorus-T. Thundurus can punish Intimidate from Incineroar while also boosting Zacian-C's Speed and Attack with its Max Airstream and Max Knuckle. Venusaur, Charizard, and Coalossal are all great early residual damage inflicters thanks to their G-Max Moves, which can put foes in range of Zacian-C's hits during the endgame. Landorus-T and Incineroar can stack Intimidate drops against threats like Groudon and opposing Landorus-T, protecting Zacian-C from physical attacks, while also being good Venusaur checks. Zacian-C also greatly appreciates Lapras's G-Max Resonance and its ability to OHKO Fire- and Ground-types like Landorus-T and Incineroar.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541609, "username": "Evelyie"}]}
  },
  "Eternatus": {
    "sets": [
      {
        "name": "Meteor Beam",
        "description": "<p>Eternatus's great offensive coverage and key resistances make it a strong bulky attacker. Using the combination of Meteor Beam and Power Herb, Eternatus can launch a powerful Rock-type attack while boosting its already formidable base 145 Special Attack stat even higher. For this set, Eternatus must chose which STAB move to utilize. Sludge Bomb allows Eternatus to threaten Fairy-types, notably preventing Xerneas from easily grabbing a Geomancy boost, while Dynamax Cannon gives it a better matchup against restricted Dragon-type Pokemon, such as Palkia and opposing Eternatus. Flamethrower provides necessary coverage, hitting Steel-types like Zacian-C for super effective damage. Protect is essential on this set, as it allows Eternatus to stay on the field even when it is threatened, thus avoiding resetting a Meteor Beam boost. The Speed EVs are flexible, but a Modest nature with maximum Special Attack is recommended to OHKO special defensive Incineroar sets with Meteor Beam.</p> <p>Eternatus has an even match-up against many popular restricted Pokemon, and it appreciates partners that provide it an edge. Incineroar assists Eternatus against Zacian-C, lowering the latter's Attack and threatening it with powerful Fire-type attacks. Volcarona is another good Fire-type to pair with Eternatus, stymieing Zacian-C with redirection and reducing Xerneas's Special Attack with Struggle Bug. Rillaboom is popular Pokemon for many team compositions that also works well with Eternatus. Assault Vest sets are able to threaten the powerful Calyrex-S, which can OHKO Eternatus, while Grassy Terrain helps Eternatus make the most of its impressive bulk. Landorus is a significant threat to Eternatus with its powerful Sheer Force-boosted Earth Power, though it can fall to a Meteor Beam after some chip damage. Indeedee-F is another non-restricted threat, which is able to both take hits with its great Special Defense and threaten Eternatus in return with its powerful Expanding Force. Lastly, almost all restricted Pokemon can threaten Eternatus with a 2HKO if they outspeed it, though Eternatus can often threaten a 2HKO if it is faster.</p> "
      },
      {
        "name": "Cosmic Power Stall",
        "description": "<p>While stall is not a common VGC strategy, Eternatus has all the tools it needs to successfully outlast opposing teams. With Cosmic Power, Eternatus can boost its already impressive defenses to the point where it can use Recover to heal all damage done by opposing Pokemon in one turn. Sludge Bomb gives Eternatus somewhat of an offensive presence, while Toxic goes all-in on a stall win condition. Either way, Flamethrower is a key coverage move to damage Steel-types, which are immune to Poison-type moves. Black Sludge gives Eternatus some passive recovery and is crucial in turning some potential 2HKOs into guaranteed 3HKOs. The EV spread is very specific, with the Special Defense allowing Eternatus to usually survive one Earth Power from Landorus or two Ice Beams from Kyogre with no boosts. The small investment in Defense is still important, as it turns Zacian-C's Behemoth Blade into a 3HKO after a Cosmic Power boost. With the Speed investment, Eternatus outspeeds Mienshao and everything slower, most notably Landorus, giving Eternatus the ability to boost its defenses before taking damage from slower Pokemon.</p> <p>This Eternatus set values free turns to grab Cosmic Power boosts. Incineroar can provide Fake Out support, suppressing enemy attacks while reducing attacking power with Intimidate, Parting Shot, and Snarl. Rillaboom is another good Fake Out user, and its ability to set Grassy Terrain gives Eternatus even more passive recovery. Landorus and Indeedee-F can deal massive damage to Eternatus with Earth Power and Expanding Force, respectively, but even those attacks can be insufficient after a few Cosmic Power boosts. Similarly, Groudon and Calyrex-S are notable restricted Pokemon that are also able to threaten Eternatus with their STAB moves. Roar or Whirlwind users like Volcarona and Incineroar can push Eternatus out of the field to reset Cosmic Power boosts but are helpless in the endgame. Finally, Perish Song users like Politoed can eliminate Eternatus without dealing any damage at all, especially if it is unable to switch out of battle.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 43686, "username": "Ace Emerald"}]}
  },
  "Urshifu": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Urshifu-S is a very threatening Pokemon with its Unseen Fist ignoring Protect, which makes it significantly harder to play around, alongside its base 130 Attack and Wicked Blow being unaffected by Intimidate. Wicked Blow ignoring Intimidate lets Urshifu-S click an attack unfazed by the likes of Incineroar and Landorus-T, and it also nails Calyrex-S, Lunala, and Indeedee-F. Sucker Punch is strong priority that threatens an OHKO on Calyrex-S and a 2HKO on Regieleki. Detect is used over Protect to deal with Imprison users that run Protect such as Zacian-C and Calyrex-S. Focus Sash is the preferred item on Urshifu-S due to its poor Special Defense and weaknesses, which would let Pokemon like Xerneas, Urshifu-R, and Zacian-C OHKO it otherwise. Life Orb gives Urshifu-S significantly more power, letting it OHKO Tornadus and physically defensive Incineroar. Choice Scarf lets it outpace Mienshao, Calyrex-S, and Nihilego, and Choice Band gives it the power to OHKO Landorus and specially defensive Incineroar after Intimidate. Choice item sets have the awful drawback of not being able to use Detect, making them significantly easier to play around.</p> <p>Urshifu-S appreciates Tailwind support from common users such as Tornadus and Whimsicott to outspeed threats to itself such as Mienshao, Regieleki, and Nihilego. Zacian-C is good alongside Urshifu-S for its ability to thwart Yveltal, Xerneas, and Tapu Fini, while Urshifu-S can hit Incineroar and Landorus-T for Zacian-C. Regieleki can help keep Urshifu-R and Mienshao in check for Urshifu-S as well giving it speed control with Electroweb. Fake Out users such as Rillaboom, Incineroar, and Gothitelle are fearsome alongside Urshifu-S due to Fake Out pinning down threats such as Xerneas, Landorus, and Zacian-C, allowing Urshifu-S to target the opposition more freely with its Protect-ignoring attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541847, "username": "yourwelcomethanku"}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Urshifu-R is a very solid offensive threat thanks to high base 130 Attack stat ability to ignore Protect with Unseen Fist. Surging Strikes is Urshifu-R's best attack, with its guaranteed critical hits ignoring Attack drops from common Intimidate users such as Incineroar and Landorus-T while also heavily pressuring both of them. Close Combat is the strongest Fighting-type STAB move that Urshifu-R has, allowing it to pressure a large part of the metagame and take on Pokemon that could survive Surging Strikes, such as Stakataka. Aqua Jet offers Urshifu-R a priority option to pressure and deal non-negligible damage to powerful and faster threats like Regieleki and Landorus. Focus Sash is Urshifu-R's primary item, somewhat negating it's otherwise lackluster Special Defense. An alternative spread of 140 HP / 236 SpD / 132 Spe with Adamant nature and Mystic Water allows Urshifu-R to hit even harder with Surging Strikes while also taking strong attacks such as Assault Vest Rillaboom's Grassy Glide, unboosted Xerneas's Dazzling Gleam, and Calyrex-S's Astral Barrage. Urshifu-R makes a great common partner to restricted Pokemon such as Xerneas and Zacian-C by pressuring and taking down their common checks such as Volcarona, Incineroar, Stakataka. Furthermore partners such as Regieleki, Incineroar, and Rillaboom create an offensive core with good type coverage that universally fits on many teams and is capable to handling most Pokemon in the metagame; Fire-types like Incineroar, Volcarona, and Entei pair especially well to take care of the Grass-type Pokemon that cause a lot of problems to Urshifu-R such as Amoonguss, Tsareena, and Rillaboom.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "Raineko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 532762, "username": "Hervalt"}]}
  },
  "Regieleki": {
    "sets": [
      {
        "name": "Focus Sash",
        "description": "<p>Regieleki's astounding Speed and powerful Electric-type moves fueled by Transistor, along with it providing speed control with Electroweb, make it an excellent speedy attacker. Transistor allows Regieleki to hit deceptively hard and greatly threaten Pokemon like Kyogre and Tornadus. Thunderbolt 2HKOes Zacian-C and Urshifu-S, along with OHKOing any Urshifu-R without Focus Sash. Volt Switch is weaker than Thunderbolt, but it allows Regieleki to quickly switch out of disadvantageous situations and take advantage of opposing switches while still dealing damage, and it synergizes well with other pivoting Pokemon like Rillaboom and Incineroar. Electroweb is especially useful when considering Regieleki's great Speed, which allows it to lower the Speed of Pokemon like Calyrex-S before they can even move. Focus Sash circumvents Regieleki's poor bulk, and Protect allows it to preserve that Focus Sash. Regieleki is useless against Ground-types such as Landorus, so Pokemon that can handle them relatively well like Urshifu-R, Rillaboom, and Kyogre make great partners for it. Pokemon that appreciate it's speed control like Groudon are also good teammates, especially because Regieleki handles Kyogre for Groudon quite well. Regieleki's great Speed and offensive utility make it beneficial to almost any team archetype in the metagame.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbadger"}]}
  },
  "Calyrex-Ice": {
    "sets": [
      {
        "name": "Offensive Trick Room",
        "description": "<p>Incredible bulk, one of the highest Attack stats in the metagame, a highly diverse movepool, and success both under and outside of Dynamax make Calyrex-I one of the premier Restricted Pokemon and Trick Room sweepers in the Series 11 metagame. Glacial Lance is arguably the best spread move in the game, and its synergy with As One allows Calyrex-I to quickly snowball under Trick Room, with very few Pokemon able to withstand a boosted attack. High Horsepower hits Fire- and Steel-types, which resist Glacial Lance, for super effective damage. Calyrex-I's third and fourth moveslots are more flexible. Heavy Slam is mainly useful under Dyanamax to hit opposing Calyrex-I, and it can pair with Max Quake to provide whichever defensive boosts are needed. Protect allows Calyrex-I to avoid damage, as opponents often focus on it to take it out quickly before it tears through teams, while Trick Room instead ensures that Calyrex-I isn't fully dependent on a partner to have a speed advantage. Many Calyrex-I opt for Weakness Policy as the item, which can work both with an activator partner or just taking foes' attacks, the latter being helped by Calyrex-I's immense bulk and several weaknesses. Other common options include Life Orb, which trades the massive damage potential of Weakness Policy for a more consistent offensive boost, and Lum Berry, which allows Calyrex-I to avoid burns and other statuses that are used to try and neutralize it. Other common set option include an Assault Vest set, which will typically run Close Combat alongside Heavy Slam in the final two moveslots, and faster sets on teams that use speed control methods other than Trick Room.</p> <p>Calyrex-I relies on several common partners to maximize its potential. It is most often run alongside a Trick Room setter: Dusclops and Mimikyu are common options that can support Calyrex-I with various moves, such as Haze on Dusclops to neutralize Intimidate drops and Safeguard on Mimikyu to deter status effects, as well as activating Weakness Policy with Shadow Sneak. Porygon2 has a less exhaustive support movepool but is much stronger against Calyrex-S teams due to not sharing a Ghost weakness with Calyrex-I like the Ghost-type setters do. Other common supportive partners for Calyrex-I include Tapu Fini, which protects Calyrex-I from status effects, redirectors such as Amoonguss, which can draw attention away from Calyrex-I while it sets up Trick Room or deals damage, and Fire-types like Incinceroar or Torkoal, which can pressure problematic Steel type Pokemon like Zacian-C, Solgaleo, and Necrozma-DM. Some teams will also opt for a secondary Dynamax or Gigantamax option that both covers some of Calyrex-I's weaknesses and gives the team an alternative \"fast mode\" that doesn't rely on Trick Room, like Venusaur (usually paired with Torkoal) or offensive Thundurus.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 547596, "username": "Helios of Sun"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 426995, "username": "Namuko Pro"}]}
  },
  "Calyrex-Shadow": {
    "overview": "<p><a href=\"https://www.smogon.com/forums/threads/series-10-viability-rankings.3688166/\">Viability Ranking: A+</a></p> <p>This is a sample set. We are currently working on proper analyses in <a href=\"https://www.smogon.com/forums/forums/vgc-analyses.643/\">Contributions &amp; Corrections</a>.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Calyrex-S is easily one of the most centralizing Restricted Pokemon in the current metagame thanks to a combination of immense Special Attack and Speed, Astral Barrage, and As One allowing it to snowball with each KO it takes. Astral Barrage is the main point of any Calyrex-S set, allowing it to potentially boost its Special Attack twice in a turn by KOing both foes on the field. Calyrex-S generally takes a Psychic-type STAB move as its second offensive move; Expanding Force is great when paired with a Psychic Terrain setter such as Tapu Lele or Indeedee-F, whereas Psyshock is an alternative option for teams without a Terrain setter. Shadow Ball allows Calyrex-S to ignore Wide Guard from the likes of Aegislash, Mienshao, and Stakataka while still doing great damage. Leaf Storm is a potential option that can be considered, but it is usually only recommended when the extra coverage is needed for Grass-weak Pokemon such as Kyogre and Groudon or when paired with Rillaboom. Substitute allows Calyrex-S to take advantage of turns where the opposing Pokemon are more passive into it, such as those where the foe uses Protect or switches. Encore allows Calyrex-S to discourage moves such as Zacian-C's Substitute and Incineroar's Fake Out, otherwise locking them into moves that render them effectively useless. Life Orb is a great item for Calyrex-S, as it boosts its damage further, giving it more opportunities to KO foes and gain boosts via As One. Focus Sash offers Calyrex-S a touch of longevity, as its otherwise mediocre bulk can be a downside. A Timid nature is mandatory on Calyrex-S, allowing it to outspeed Jolly Zacian-C.</p> <p>Calyrex-S pairs very effectively with Psychic Terrain setters such as Tapu Lele and Indeedee-F, increasing its damage output with Expanding Force as well as protecting it from otherwise lethal priority attacks like Urshifu-S's Sucker Punch and Aegislash's Shadow Sneak. For this reason, Tsareena can also be a good partner. Wide Guard users such as Mienshao and Stakataka are also great alongside Calyrex-S, as they are capable of blocking opposing Calyrex-S's Astral Barrage and Incineroar's Snarl. Calyrex-S's main drawback is its quadruple weakness to common Dark-types such as Incineroar and Urshifu-S, making a partner such as Mienshao or Urshifu-R mandatory to beat them.</p> "
      },
      {
        "name": "Choice Item",
        "description": "<p>Calyrex-S is a great Choice item user thanks to its already great Special Attack and Speed and ability to output a high amount of spread damage via Astral Barrage. Calyrex-S also likes to carry a Psychic-type STAB move in order to take down Amoonguss and Porygon2 with more ease. Expanding Force allows Calyrex-S totake advantage of Psychic Terrain set by Tapu Lele or Indeedee-F, whereas Psyshock is a great alternative that doesn't rely on having Psychic Terrain while also hitting specially defensive Pokemon such as Volcarona and +2 Xerneas for more damage. Shadow Ball allows Calyrex-S to pressure common Wide Guard users such as Aegislash and Mienshao with a Ghost-type STAB move. Mud Shot lets Calyrex-S fight its way through Incineroar, which would otherwise be unscathed by its other moves; Trick is an option to lock opposing Pokemon into moves they would rather not be locked into, such as Incineroar and Mienshao with Fake Out and Landorus with Substitute. Leaf Storm is an option that plays well into the likes of Groudon and Kyogre, as well as having a boosted move in Grassy Terrain with Rillaboom being so ubiquitous. Choice Specs is the best Choice item for Calyrex-S, as it typically does not need the extra Speed but very much appreciates additional damage giving it the chance to obtain more As One boosts. Choice Scarf allows Calyrex-S to act as solid cleaner while not having to worry about Speed tying opposing Calyrex-S.</p> <p>Calyrex-S loves being paired with Psychic Terrain setters such as Tapu Lele and Indeedee-F, allowing it to take advantage of Expanding Force, notably OHKOing Amoonguss and heavily pressuring Eternatus, while being protected from dangerous priority attacks such as Aegislash's Shadow Sneak. Without any means of surviving against opposing Calyrex-S Astral Barrage, Wide Guard users such as Mienshao and Stakataka make great partners for Calyrex-S. Calyrex-S also needs Pokemon that will help it through Dark-types such as Incineroar and Urshifu-S that would otherwise cause trouble for it when locked into a move it cannot hit them with, so partners such as Urshifu-R and Mienshao are advised. With Choice Specs giving such a hefty damage increase, a Tailwind user such as Whimsicott, Tornadus, or Talonflame can come in handy in order to guarantee that Calyrex-S will always get to fire off Astral Barrage first.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294287, "username": "Raineko"}]}
  }
}