{
  "Nidoqueen": {
    "comments": "<h1>Other Options</h1> <p>Nidoqueen can run HP investment to be a better Tapu Koko switch-in, but this leaves it outsped by uninvested base 90 Speed threats and Landorus-T. Stealth Rock is an option, as Nidoqueen threatens most of the common Defoggers, but the loss of coverage significantly increases its number of possible checks.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Walls With Few Weaknesses: Especially bulky walls like Lunala and Gastrodon can switch into any of Nidoqueen's moves, not being weak to any, and force it out. They also have access to recovery to outlast it.</p> <p><strong>Faster Threats: Unless they're passive walls, a majority of Pokemon, like Mewtwo, Tapu Lele, and Volcanion, outspeed Nidoqueen and force it out or revenge kill it. Some like Landorus-T, Necrozma-DM, and Heatran can switch in on an attack they're immune to or resist. However, all these threats greatly fear at least one of Nidoqueen's possible moves, and Substitute can block revenge killers.</p> ",
    "sets": [
      {
        "name": "Life Orb Attacker (Special Attack)",
        "description": "<p>Nidoqueen is a threatening wallbreaker with the combination of Sheer Force and its wide range of coverage moves. With a Special Attack donation, it has the firepower to overwhelm most special walls including Ferrothorn, Slowbro and Slowking, Giratina, and Ho-Oh. Since Sheer Force boosts all of its common moves, Life Orb is a drawback-free item to increase Nidoqueen's damage output even further. Sludge Wave is its strongest move against neutral targets and also provides important coverage against prominent defensive stalwarts like Clefable, Tapu Fini, and Tangrowth. Earth Power nails Necrozma-DM, Heatran, and Tyranitar. Nidoqueen has a lot of viable options for the last two moveslots. Ice Beam OHKOes the ubiquitous Landorus-T and is the best option against Giratina, while Fire Blast OHKOes Ferrothorn and most Corviknight sets. Substitute eases predictions, but Thunderbolt is the best option to hit Ho-Oh and Kyogre and still 2HKOes Corviknight. Maximum Speed investment allows Nidoqueen to outspeed most walls and uninvested base 90 Speed Pokemon, including common gods like Kyogre and Ho-Oh.</p> <p>Nidoqueen requires a god with a high base Special Attack, such as Yveltal, Mewtwo, Pheromosa, or Kyogre, to function well. While its unusual defensive typing lets it switch into some common threats, most notably Tapu Koko, its bulk is subpar and it has no form of recovery, so teammates that can pivot it in like Landorus-T and Corviknight are welcome. Entry hazard support from Ferrothorn and Skarmory can help weaken Nidoqueen's checks. Nidoqueen is also easily forced out by revenge killers such as Victini, so sturdy defensive switch-ins like Ho-Oh, Landorus-T, and Rotom-W make good teammates. Fast cleaners like Tapu Koko and Zeraora appreciate the holes Nidoqueen can open up in opposing defensive cores. Nidoqueen faces heavy competition from Nidoking; however, Nidoqueen's extra bulk allows it to better soft check Tapu Koko and absorb weak pivoting moves like Choice Band Rillaboom's U-turn without them breaking Substitute. Ultimately, the choice between Nidoqueen and Nidoking comes down to bulk versus power. Nidoqueen is slightly better at switching into Tapu Koko, while Nidoking has an easier time getting the jump on Necrozma-DM and Heatran.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 484270, "username": "beauts"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Nidoking": {
    "comments": "<h1>Other Options</h1> <p>Nidoking can receive Speed, which allows it to act as a cleaner, but comes at the expense of significant damage output.</p> <h1>Checks and Counters</h1> <p><strong>Neutral Walls</strong>: Bulky Ubers such as Lunala are capable of surviving any hit from Nidoking and forcing it out, while Pokemon like Rotom-W are able to force out Nidoking effectively.</p> <p><strong>Revenge Killers: Mewtwo, Zygarde-10%, Weavile, and and other fast offensive Pokemon are all able to revenge kill Nidoking very consistently.</p> ",
    "sets": [
      {
        "name": "Sheer Force Attacker (Special Attack)",
        "description": "<p>Nidoking is a powerful wallbreaker that is able to take advantage of its wide movepool and access to Sheer Force. With a god's Special Attack, it is able to break through common special walls like Heatran, Necrozma-DM, and Tapu Fini. Life Orb enhances Nidoking's damage output even further without drawback. Sludge Wave is its most powerful attack against neutral targets while also dealing super effective damage to common specially defensive Pokemon such as Tapu Fini and Clefable. Earth Power hits Heatran and Necrozma-DM for heavy damage, although specially defensive variants of Necrozma-DM are not OHKOed and can deal significant damage back. Ice Beam can be used to OHKO Landorus-T and is Nidoking's best option to hit Giratina, while Fire Blast OHKOes Ferrothorn and deals heavy damage or OHKOes Corviknight. Flamethrower can be used to ensure you are not PP stalled by Corviknight. Thunderbolt hits Ho-Oh, Kyogre, and Slowking for super effective damage, although Substitute can be used to ease predictions. Maximum Speed EVs and a Timid nature make sure Nidoking can outspeed non-max speed Rotom-W and Ho-Oh, although a Modest nature can be used to increase damage output even further while still outpacing Necrozma-DM without a boosting nature.</p> <p>Nidoking needs a god with high Special Attack, like Mewtwo, Pheromosa, or Rayquaza, in order to function properly. Its ability to open up holes in the opposing team's defensive core makes it a great partner for fast cleaners like Kartana and Tapu Koko. Nidoking has trouble breaking through Gastrodon, Lunala, and Ho-Oh if not carrying Thunderbolt. Kartana can help improve these matchups with its ability to threaten Gastrodon and Lunala and by removing Ho-Oh's Heavy-Duty Boots with Knock Off. When using Substitute, Nidoking has to sacrifice coverage and oftentimes the ability to beat certain Pokemon, so teammates that can help with this lack of coverage are appreciated. Due to its relatively low bulk and lack of recovery, sturdy defensive partners like Corviknight, Landorus-T, and Rotom-W are appreciated. All three of these offer pivoting support, allowing Nidoking to enter the field safely. Entry hazard setters like Ferrothorn and Heatran also make good teammates, accumulating chip damage on potential checks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Clefable": {"sets": [{"name": "Unaware (HP, Def)"}, {"name": "Magic Guard (HP, Def, SpA)"}]},
  "Ditto": {
    "comments": "<h1>Other Options</h1> <p>Since Ditto needs Choice Scarf to ensure its ability to revenge kill, it shouldn't run any other item.</p> <h1>Checks and Counters</h1> <p><strong>Substitute Sweepers</strong>: Ditto can't copy foes behind a Substitute, completely failing to threaten them.</p> <p><strong>Choice Scarf Users</strong>: Pokemon with Choice Scarf force a coinflip against Ditto, making it less reliable.</p> <p><strong>Bulky Setup Pokemon with Recovery</strong>: Ditto struggles to revenge kill bulky foes like Iron Defense Skarmory and Calm Mind Kyogre without critical hits.</p> <p><strong>Item Removal: Without Choice Scarf, Ditto risks losing the Speed tie against Pokemon it's supposed to check.</p> ",
    "sets": [
      {
        "name": "Revenge Killer (Any)",
        "description": "<p>Ditto is an effective revenge killer in the Godly Gift metagame thanks to its unique ability in Imposter, which, when combined with a Choice Scarf, allows it to outspeed any Pokemon without Choice Scarf or Unburden. Transformation copies donated stats, allowing Ditto to still outspeed Speed receivers and hit as hard as Attack receivers. Imposter's also useful against stall teams by effectively giving infinite PP and copying recovery moves. Ditto prefers having its Choice Scarf removed against stall teams to switch moves and maximize its PP stall capabilities. 252 HP EVs boost the only stat Ditto retains after Imposter activates, while 252 Special Attack EVs and a Quiet nature boost its Future Sight after transforming into a Pokemon like Slowking.</p> <p>Ditto almost exclusively finds its place on stall teams to handle offensive setup threats that its teammates struggle to handle. It struggles to switch in directly against most foes, so slow pivot moves make for great support. Examples include Teleport from Slowbro or Slowking and U-turn from Corviknight. Entry hazards prevent Ditto from switching in repeatedly, so teammates that can reliably remove them such as Mandibuzz and Ho-Oh are appreciated. Unaware users like Pyukumuku, Quagsire, and Clefable or Clear Smog users like Gastrodon and Amoonguss can handle bulky setup Pokemon with recovery, such as Calm Mind Galarian Slowking and Bulk Up Buzzwole, which outlast Ditto one-on-one. An ally with Regenerator, such as the aforementioned Slowbro or Ho-Oh, in tandem with Ditto can outstall defensive Regenerator Pokemon, effectively forcing them out. A defensive god with a high HP stat like Giratina theoretically complements Ditto well, but Ditto is able to go in any teamslot, especially the Attack and Special Attack slots, which stall teams don't benefit from much anyway. While the HP increase is beneficial, another bulky Pokemon can often take better advantage of it, usually Skarmory.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Mewtwo": {
    "comments": "<h1>Other Options</h1> <p>Mewtwo can also use Choice Specs, but this set is easier to play around once it is revealed. Replacing Recover with another coverage move is another option. Mewtwo can also use a Weakness Policy and Calm Mind set, often on dual screens hyper offense, that serves as a powerful setup sweeper.</p> <h1>Checks and Counters</h1> <p><strong>Heatran</strong>: Mewtwo, even with Aura Sphere, can have difficulties dealing with Heatran, which can often trap and eliminate it easily using Magma Storm, Taunt, and Toxic.</p> <p><strong>Faster Revenge Killers</strong>: Pokemon like Pheromosa, Zamazenta, and their common Speed receivers such as Pangoro will be faster than Mewtwo and can often force it out.</p> <p><strong>Priority Users: Pokemon that can use priority moves, like Rillaboom and Yveltal, can force Mewtwo out after a little chip damage.</p> <p><strong>Neutral HP Receivers: Pokemon like Rotom-W, Tapu Fini, and Clefable aren't weak to most or any of Mewtwo's attacks, often letting them handle Mewtwo after a high HP donation.</p> ",
    "sets": [
      {
        "name": "Three Attacks",
        "description": "<p>Mewtwo is a threatening special attacker that takes advantage of its wide coverage and impressive Special Attack to dish out heavy damage to opposing teams. Mewtwo also has excellent stats to donate to its team, including base 154 Special Attack and 130 Speed, making it one of the best Speed donors to offensive teams. Especially since this set forgoes any boosting moves, Life Orb is recommended to still do respectable damage; Recover also helps offset its recoil, besides generally keeping Mewtwo healthy. Psystrike has solid neutral coverage and can bypass specially bulky walls like Ho-Oh and Assault Vest Tangrowth. Fire Blast hits common switch-ins to Psystrike like Necrozma-DM, Skarmory, and Kartana. Thunderbolt is Mewtwo's best way to handle bulky Water- and Flying-types like Slowbro, Tornadus-T, and Corviknight. Ice Beam hits Dragon- and Ground-types like Rayquaza and Groudon. Taunt gives Mewtwo a way to break through common switch-ins such as Clefable by preventing it from healing. Aura Sphere is an option here for super effective coverage on Heatran while still hitting Ferrothorn super effectively.</p> <p>Mewtwo's amazing Special Attack and Speed, as well as its solid HP and Attack, make it an excellent god for offensive teams. Pokemon like Galarian Moltres and Nidoking love to receive Mewtwo's high Special Attack stat, while numerous Pokemon, including Dhelmise and Volcanion, can become fast wallbreakers after receiving its Speed stat. Mewtwo should always be paired with such Special Attack and Speed receivers that complement its aggressive nature, as the three Pokemon form the backbone of the team. Mewtwo excels at wearing down teams, so cleaners like Kartana and Tapu Koko that can take advantage of this make good teammates. Mewtwo's frailty makes it easily forced out by priority users like Weavile, Rillaboom, and Yveltal, especially after it has taken a few rounds of Life Orb recoil. Teammates like Rotom-W, Landorus-T, and Corviknight can alleviate this weakness with both pivot support and entry hazard control, giving Mewtwo safe entry and stopping hazards from chipping it down even further.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Mewtwo is a fearsome setup sweeper with Nasty Plot and its array of coverage moves. Its high Special Attack and Speed stats make it a difficult Pokemon to check on its own, and these stats power up its teammates as well, making it a very threatening god. Nasty Plot transforms this baseline threat into an immediate threat to sweep, especially coupled with its great Speed tier. Psystrike is the STAB attack of choice, threatening common special switch-ins like Gastrodon and Ho-Oh. Fire Blast hits Steel-types that are unfazed by Psystrike like Necrozma-DM and Ferrothorn. Thunderbolt gives Mewtwo an option to hit bulky Water-types like Tapu Fini and Slowking, while Ice Beam hits Ground- and Dragon-types like Landorus-T, Giratina, and Rayquaza for heavy damage. Recover lets Mewtwo stay healthy throughout a game, healing off Life Orb recoil and any other chip damage sustained.</p> <p>Mewtwo is an excellent choice for offensive teams, helping Pokemon that appreciate its strong Special Attack and Speed, like Tapu Koko and Volcanion, as well as its respectable Attack and HP stats. Mewtwo likes to be pivoted into foes it can force out to safely set up Nasty Plot, so physical pivots like Zeraora, Victini, and Rillaboom—which also threaten Mewtwo's specially bulky checks—make great teammates. Despite Mewtwo's offensive prowess, it has middling bulk and can be revenge killed by priority or Choice Scarf users; bulky pivots like Rotom-W and Tornadus-T can switch into potential revenge killers and regain momentum. Mewtwo rarely has trouble beating foes offensively, but certain Pokemon like Heatran, Reuniclus, and Lunala can give it trouble. Partners like Nidoking and Galarian Moltres can help deal with these threats easily. Mewtwo appreciates entry hazard removal to help avoid chip damage, since it will often be switching in several times over the course of a game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Slowking": {
    "comments": "<h1>Other Options</h1> <p>An EV spread of 252 HP / 124 Def / 132 SpD makes sure that Slowking is not 2HKOed by Kyogre's Water Spout after Leftovers recovery, but makes it harder for it to check physical attackers. Trick Room can be ran over Future Sight, as Slowking is able to reliably set it and pivot to a wallbreaker. Ice Beam is also an option to pressure Zygarde-10% and Garchomp, but they are already pressured well by Scald. Dragon Tail can deter setup sweepers, but a slow pivot to a revenge killer is often just as good.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Electric-types like Zeraora and Tapu Koko threaten Slowking with powerful, super effective STAB moves. However, Zeraora is crippled by burns from Scald.</p> <p><strong>Dark-types: Dark-types like Weavile and Galarian Moltres are immune to Future Sight and are capable of OHKOing Slowking.</p> <p><strong>Offensive Grass-types: Many Grass-types like Dhelmise, Kartana, and Rillaboom threaten Slowking with strong super effective STAB moves. The latter two also have access to Knock Off.</p> <p><strong>Strong Special Attackers: Slowking may have good mixed bulk, but it can still be overwhelmed by exceptionally strong special attackers like Kyogre, Tornadus-T, and Nidoking.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot (Defense)",
        "description": "<p>With a Defense donation to its name, Slowking possesses great mixed bulk. With superb durability, reliable recovery, and access to Teleport, Slowking cements itself as one of the best defensive pivots in the tier. Scald is the preferred STAB move, as its burn chance can chip down defensive Pokemon like Tangrowth and Ferrothorn and cripple physical attackers like Zeraora, Rillaboom, and Weavile that may try to switch in. Future Sight can force many Pokemon out to disrupt an opponent's momentum and also deals significant chunks of damage to neutral targets if it lands. It also allows Slowking to aid physical wallbreaking teammates by setting up Future Sight, slow pivoting them onto the field safely, and forcing the opposing physical wall to take Future Sight damage the same turn it switches in. Slack Off is necessary to keep Slowking healthy, as Regenerator is often not enough to keep it fully healthy. Teleport is an excellent way to bring in frail teammates safely, as Slowking has good matchups versus common Pokemon like Necrozma-DM, Heatran, Ho-Oh, and Calyrex-I and can switch into them and stomach a hit before pivoting out. Heavy-Duty Boots lets Slowking pivot around more freely, but Leftovers can be run if reliable entry hazard removal is present. Regenerator allows Slowking to still recover HP while pivoting out. A Relaxed nature alongside minimum Speed IVs ensure that Slowking will move last as often as possible and speed tie with Slowbro and opposing Slowking when pivoting.</p> <p>Slowking should receive its Defense stat from bulky gods like Necrozma-DM, Zamazenta-C, and Calyrex-I. Frail Pokemon like Zeraora and Weavile, as well as setup sweepers like Necrozma-DM, Kartana, and Mimikyu, love to be brought in by Teleport. Those same Pokemon also love Slowking's ability to spread burns, chipping walls and crippling physical attackers. Slowking pairs especially well with physical wallbreakers, as their checks are more significantly pressured by Future Sight. Slowking can force out Fire-types like Heatran and Victini locked into V-create, which is appreciated by Steel-type teammates like Ferrothorn and Skarmory. Slowking is vulnerable to Electric-types like Zeraora and Tapu Koko, so Ground-types like Landorus-T and Garchomp are good teammates. Slowking's Psychic typing makes it weak to Knock Off, teammates that resist Dark like Buzzwole, Clefable, and Tapu Fini are useful to have around. Slowking pairs well with other Regenerator users like Tornadus-T, Ho-Oh, and Tangrowth, as they can form infamous Regenerator cores and soft check a wide range of threats.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 525446, "username": "Ducky"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 584907, "username": "Wes8888"}]}
  },
  "Skarmory": {
    "comments": "<h1>Other Options</h1> <p>Skarmory has a wide range of other status options available. Toxic allows it to punish switch-ins directly and rack up even more residual damage. Skarmory can also set Stealth Rock, but the limited distribution of Spikes makes Skarmory's access to that move more valuable. Taunt is an option to prevent setup and Defog, but Skarmory's low Speed makes it an unreliable option. Skarmory can also forgo Body Press or Brave Bird to run four utility moves, but this makes it exceedingly passive. Skarmory can also run a specially defensive set, but this set is generally outclassed by Corviknight.</p> <h1>Checks and Counters</h1> <p><strong>Fire- and Electric-types: Even physical Fire- and Electric-types like Victini, Zeraora, and Dracozolt can reliably 2HKO Skarmory with their super effective STAB moves.</p> <p><strong>Taunt: Skarmory is vulnerable to Taunt, as it cannot recover, phaze, or set Spikes in front of Taunt users like Yveltal and Alolan Persian.</p> <p><strong>Pivots: Physical pivots like Landorus-T can draw Skarmory in and pivot to a special attacker that forces it out. Especially with Stealth Rock up, this can wear down Skarmory by denying it a chance to recover. Pivots are especially dangerous when paired with Magnezone.</p> <p><strong>Zygarde-10%: Thanks to Thousand Arrows, Zygarde is one of the few physical Ground-types that Skarmory cannot reliably check.</p> <p><strong>Strong Special Attackers: Even with augmented HP, Skarmory has poor special bulk and it can be 2HKOed by most special attackers such as Mewtwo and Nidoking.</p> ",
    "sets": [
      {
        "name": "Physical Wall (HP)",
        "description": "<p>Skarmory is the most reliable Spiker in the metagame and one of the sturdiest physical walls. With its amazing defensive typing, access to reliable recovery, and sky-high Defense, it is the perfect candidate for the HP teamslot. Skarmory is able to comfortably wall most physical threats, including Dhelmise, Bisharp, Excadrill, and Weavile. Body Press works off of its high Defense stat and threatens many of the Pokemon it walls, like Excadrill, but Brave Bird is an option for better neutral coverage and the ability to hit Ghost-types, especially Dhelmise, at the cost of taking recoil. Spikes punishes switch-ins and takes advantage of the free turns Skarmory generates. Iron Defense allows Skarmory to check setup sweepers as well, boosting alongside them while also powering up Body Press; Whirlwind is another option in the last moveslot to phaze set-up foes that Skarmory cannot KO. Rocky Helmet lets Skarmory punish physical attackers even more heavily, especially pivots that can otherwise wear down Skarmory, while Leftovers provides extra recovery. Maximum Defense investment is required to check the high-powered attackers common in Godly Gift and has the nice side effect of also powering up Body Press.</p> <p>Skarmory is a good option for stall and balance teams looking for a catch-all physical wall. Since most Uber Pokemon have a high base HP, Skarmory can work with a wide range of Gods, but some of the best fits are Giratina, Yveltal, and Kyurem-W. Wallbreakers like Victini and Zeraora appreciate Skarmory's Spikes, which help wear down their checks, and its ability to switch into would-be revenge killers that force them out, such as Landorus-T. Since Skarmory's Special Defense is poor, it appreciates bulky teammates like RegenVest Tangrowth and Gastrodon to sponge special hits aimed at it. Due to its Electric and Fire weaknesses, Skarmory is unable to wall Victini, Zeraora, and Dracozolt; reliable switch-ins to these foes like Hippowdown and Quagsire make good partners, especially since Skarmory covers their Grass weaknesses.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Tyranitar": {"sets": [{"name": "Specially Defensive (SpD)"}, {"name": "Dragon Dance (Spe)"}]},
  "Ho-Oh": {"sets": [{"name": "Physically Defensive"}, {"name": "Choice Band"}]},
  "Kyogre": {"sets": [{"name": "Choice Attacker"}, {"name": "Calm Mind"}]},
  "Garchomp": {
    "comments": "<h1>Other Options</h1> <p>Garchomp can forgo Scale Shot or one of its coverage moves for Stealth Rock. Fire Blast and a Special Attack donation threaten some of its checks like Skarmory and Corviknight better. A defensive set with a Defense donation and Rocky Helmet is possible, but the reliance on Wish and cleric support makes it hard to justify. Life Orb can increase its damage output, although it makes Garchomp more prone to priority moves such as Grassy Glide. Similarly, an Adamant nature leaves it outsped by more offensive Pokemon post-donation, like Tapu Koko and Noivern, but is an option on Scale Shot sets.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Pokemon: Hippowdon, Buzzwole, Skarmory, Tangrowth, and Corviknight can switch in and sponge any attack from Garchomp if it hasn't set up. They can then disrupt its sweep attempt with Whirlwind, Toxic, Stun Spore, or setup of their own.</p> <p><strong>Unaware Walls: Pyukumuku, Clefable, and Quagsire have no trouble handling Garchomp thanks to ignoring its boosts and healing its damage.</p> <p><strong>Ice-type Coverage: Ice Beam from Tyranitar or Ice Punch from Buzzwole can surprise Garchomp and heavily damage it, if not outright OHKO.</p> <p><strong>Faster Pokemon and Priority Users: Pokemon with Choice Scarf like Tapu Lele or a Speed-boosting ability like Arctozolt can outspeed and revenge kill Garchomp before Scale Shot, but only then. Alternatively, priority moves such as Ice Shard from Mamoswine and Weavile and Grassy Glide from Rillaboom can take advantage of the Defense drops from Scale Shot.</p> <p><strong>Status: Garchomp struggles to do its job properly if it is statused. Burn cuts its damage in half, paralysis from Tangrowth or Amoonguss makes it far easier to outspeed and revenge kill, and poison puts its sweep on a timer.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Speed)",
        "description": "<p>Garchomp is a dangerous setup sweeper with a better Speed stat under its belt. Swords Dance allows it to break past sturdy walls such as Corviknight and Landorus-T. Earthquake is strong and reliable, threatening common Pokemon such as Heatran and Galarian Slowking. Scale Shot allows Garchomp to attack while further raising its Speed, making it more difficult to revenge kill. Fire Fang targets Grass-type foes that can handle Earthquake like Tangrowth and Ferrothorn, as well as others like Skarmory and Corviknight, providing perfect neutral coverage alongside Earthquake and Scale Shot. Stone Edge can be used instead to heavily damage Yveltal, Mandibuzz, and Ho-Oh, with the former two heavily threatening Garchomp with Foul Play and the latter with a burn from Sacred Fire. Leftovers provides longevity as Garchomp sets up.</p> <p>Garchomp best fits on bulky offense teams as a late-game sweeper or hyper offense ones as a wallbreaker. A Speed donation from Zamazenta, Pheromosa, or Mewtwo helps it force more offensive Pokemon out such as Zygarde-10% and Noivern, allowing it to get a Swords Dance up more easily. Entry hazards, like Ferrothorn's Spikes and Heatran's Stealth Rock, compound damage throughout the game, putting Pokemon like Buzzwole and Slowking in Garchomp's KO range late-game. Magnezone can trap and eliminate Corviknight and Skarmory, making it a great partner. Special attackers that invite Heatran and Galarian Slowking in, especially those with a pivot move like Tapu Koko or Tornadus-T, are also great options. Pokemon such as Weavile and Kartana work with Garchomp to overwhelm shared checks, allowing one to sweep. The latter can also break past physically defensive Unaware walls like Clefable and Quagsire, which Garchomp can't get past. Dual screens support from the likes of Alolan Ninetales and Grimmsnarl helps Garchomp set up safely and remedies its Defense drop from Scale Shot. Scale Shot's inconsistency can make bulky Flying-type Pokemon, namely Ho-Oh and Landorus-T, troublesome, making teammates that can take advantage of them like Urshifu-R and Cloyster valuable. Psychic Surge from Tapu Lele can prevent priority attacks like Weavile's Ice Shard from exploiting Scale Shot's Defense drop.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Weavile": {"sets": [{"name": "Swords Dance (Atk)"}]},
  "Tangrowth": {
    "comments": "<h1>Other Options</h1> <p>Occa Berry can be run on physically defensive Tangrowth as an emergency to heavily damage Victini and remove its Choice item or Heavy-Duty Boots. Leech Seed can help beat foes like Zamazenta-C more consistently, but it's hard to forgo one of its other moves. Rock Slide on the specially defensive set allows Tangrowth to beat offensive Volcarona and hits Ho-Oh for decent damage on the switch. An offensive set utilizing Chlorophyll, a Speed donation, Growth, and its great mixed offensive movepool can surprise foes, but Venusaur is usually better at this role.</p> <h1>Checks and Counters</h1> <p><strong>Flying-type Pokemon: Strong offensive Flying-types can muscle past Tangrowth with their powerful STAB attacks. Rayquaza can OHKO Tangrowth, while Ho-Oh, Yveltal and Tornadus-T take little damage from Tangrowth's attacks and can heal off any damage they do take. However, they can be crippled by Knock Off, Sludge Bomb, and Stun Spore.</p> <p><strong>Fire-type Pokemon and Coverage: Despite being unable to switch in directly due to Earthquake, Knock Off, and Stun Spore, Fire-types such as Heatran, Victini, and Reshiram easily overwhelm Tangrowth. Fire-type coverage from offensive threats like Groudon's Heat Crash also threatens it, especially if they are boosted.</p> <p><strong>Steel-type Pokemon: Most Steel-types are bulky enough to withstand Tangrowth's attacks and can use it to set up boosts or entry hazards if it lacks Focus Blast. Skarmory and Ferrothorn can freely set entry hazards in front of Tangrowth, while Necrozma-DM and Bulk Up Corviknight aren't even threatened by Focus Blast and simply use their recovery moves to continuously set up, with the former even taking advantage of Knock Off to activate Weakness Policy.</p> <p><strong>Passive damage: Even with Regenerator, Tangrowth is still prone to getting worn down, especially without Synthesis, considering its weakness to U-turn. Entry hazards and Toxic from Landorus-T and Heatran cause Tangrowth to struggle with Pokemon it's supposed to check like Tapu Koko and Kyogre.</p> <p><strong>Item Removal: Specially Defensive Tangrowth relies on its Assault Vest to take hits effectively, so Knock Off from Ferrothorn and opposing Tangrowth or Trick from Tapu Fini can leave it unable to handle powerful special wallbreakers such as Choice Specs Kyogre.</p> ",
    "sets": [
      {
        "name": "Assault Vest (Special Defense)",
        "description": "<p>Specially Defensive Tangrowth is one of the best walls in Godly Gift, courtesy of Regenerator, its high Defense, and a received Special Defense, which is further amplified with an Assault Vest. This allows it to be an amazing check to a handful of top-tier threats like Tapu Koko and Kyogre, and it can also switch into Zygarde-10%'s Thousand Arrows when necessary. Giga Drain gives Tangrowth passive recovery, while Power Whip lets Tangrowth damage Calm Mind users like Kyogre and Tapu Fini, which would otherwise set up on it. Knock Off deters switch-ins that rely on their items, notably Ho-Oh and Ferrothorn. Sludge Bomb lets Tangrowth check Grass-types like Dhelmise, opposing Tangrowth, and Rillaboom, while threatening to spread poison. Earthquake heavily damages Heatran, which otherwise would trap and eliminate Tangrowth, while also allowing Tangrowth to beat Electric-types such as Zeraora and Tapu Koko. Focus Blast prevents Zamazenta-C, Ferrothorn, and Kartana from boosting or setting entry hazards on Tangrowth.</p> <p>Tangrowth's amazing defensive capability and ability to support offensive threats make it a great addition to offensive and defensive teams alike. Most gods can greatly bolster Tangrowth's poor Special Defense stat, most notably Kyogre and Ho-Oh. The latter has especially great synergy with Tangrowth, since it can switch in on Fire-type attacks that threaten it like Victini's V-Create and Reshiram's Blue Flare, while Tangrowth takes on Electric- and Water-type Pokemon such as Gastrodon and Alolan Raichu; they also form a Regenerator core. Physical walls such as Skarmory benefit from Tangrowth's ability to deal with special attackers like Dialga and Rotom-W. Rotom-W forms a Grass / Fire / Water core together with Ho-Oh and Tangrowth, being able to handle myriad physical threats that the other two can't, including Victini, Rayquaza, and Kyurem-B. Offensive threats such as Tapu Koko and Zygarde-10% who share common switch-ins with Tangrowth, like opposing Tangrowth and Ferrothorn, take advantage of Tangrowth's ability to cripple them with Sludge Bomb and Knock Off. Magnezone traps various Steel-type Pokemon, most importantly Skarmory and Necrozma-DM, that Tangrowth can't threaten. Entry hazard removal from Pokemon like Excadrill and Rotom-W is necessary to prevent Tangrowth from getting worn down.</p> "
      },
      {
        "name": "Physically Defensive (Special Defense)",
        "description": "<p>Physically defensive Tangrowth can handle prominent physical attackers such as Zeraora, Zygarde-10%, and Rillaboom while still being able to switch in and scout for several Choice iem special attackers like Choice Scarf Kyogre, thanks to a Special Defense donation. Giga Drain deals decent damage and gives Tangrowth passive recovery. Knock Off deters would-be switch-ins such as Ho-Oh and helps avoid the 2HKO from especially strong physical attacks like Outrage from Zygarde-10%. Setup sweepers like Dragon Dance Necrozma-DM and Bulk Up Buzzwole can muscle past Tangrowth; Stun Spore is Tangrowth's only option against them, enabling other teammates to handle them. Focus Blast is Tangrowth's best move against Zamazenta-C and Kartana, which otherwise use it as setup fodder. If another teammate can already handle them effectively, Sludge Bomb can replace Focus Blast to cripple defensive Pokemon such as Giratina. Synthesis is another alternative that helps keep Tangrowth healthy without having to switch out or rely on Giga Drain. Rocky Helmet is the preferred item to punish contact moves, especially U-turn from the likes of Landorus-T and Urshifu-R. Heavy-Duty Boots helps against entry hazard stack teams or if the team lacks strong entry hazard control options.</p> <p>Physically defensive Tangrowth finds its home on bulky offense teams as a reliable wall. Most gods make for good teammates, but Ho-Oh, Zamazenta-C, and Kyogre stand out thanks to their high Special Defense and defensive synergy with Tangrowth. Slow wallbreakers such as Victini and Nidoking appreciate Tangrowth's ability to switch in against faster threats that force them out like Zygarde-10% and Choice Scarf Kyogre. Grass-types such as Kartana and Rillaboom are problematic for Water-type partners such as Kyogre and Rotom-W, which Tangrowth can handle. Rotom-W, in particular, also deals with several physical threats that Tangrowth can't, namely Victini and Rayquaza. Bulky setup Pokemon, including Buzzwole and Steel-types like Necrozma-DM and Bulk Up Corviknight, can set up against Tangrowth even with Stun Spore, making a teammate that can handle these Pokemon a necessity. Ho-Oh can phaze with Whirlwind and burn them with Sacred Fire, while Rotom-W can cripple them with Trick and Will-O-Wisp. Magnezone can also trap these Steel-types and beat them one-on-one, making it a good partner. Excadrill, Ho-Oh, and Corviknight can clear entry hazards and relieve pressure for Tangrowth If it opts for Rocky Helmet over Heavy-Duty Boots. Nidoking and Nidoqueen are especially threatening due to Tangrowth taking up the Special Defense slot, so soft checks like Air Balloon Heatran are a must.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Rotom-Heat": {"sets": [{"name": "Pivot (HP)"}]},
  "Rotom-Wash": {
    "comments": "<h1>Other Options</h1> <p>Toxic can be run to wear down bulkier foes like Gastrodon, Tangrowth, Ho-Oh, and Lunala over time, but Rotom-W generally appreciates its other status spreading moves more. A specially defensive EV spread can be run to better check foes like Heatran, Volcarona, and Kyogre; however, Rotom-W is generally better off being physically defensive thanks to the plethora of major physical threats it can check. Choice Scarf Rotom-W can be an excellent revenge killer alongside slower gods, and it can also cripple slower foes with Trick. However, running Speed investment dramatically reduces Rotom-W's bulk, and there are generally better options for Choice Scarf users.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Grass-types like Kartana, Ferrothorn, and Tangrowth can safely sponge any of Rotom-W's moves and can hit it back super effectively; however, they do dislike getting burned.</p> <p><strong>Wallbreakers: Powerful wallbreakers like Galarian Moltres, Zekrom, and Tapu Lele are potentially able to overpower Rotom-W. However, it can punish them with status and they cannot safely switch in.</p> <p><strong>Chip Damage: Stealth Rock severely burdens Rotom-W, as it gets worn down as it repeatedly switches in. Furthermore, Toxic from foes like Heatran, Giratina, and Gastrodon will wear down Rotom-W over time.</p> <p><strong>Dragon-types: Dragon-types like Hydreigon, Zygarde-10%, and both Kyurem formes resist Rotom-W's STAB attacks and can overpower it, but they must be cautious about switching into status moves or Volt Switch.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot (HP)",
        "description": "<p>Rotom-W is one of the best defensive Pokemon in the metagame thanks to its great defensive stats, useful resistances, and plethora of moves that make it incredibly annoying to switch into. Thunder Wave cripples threats such as Yveltal, Volcarona, and Tapu Lele, while Will-O-Wisp ruins physical attackers such as Rayquaza, Necrozma-DM, and Bisharp. Volt Switch lets Rotom-W generate momentum on special walls like Ferrothorn, Tangrowth, and Giratina for free. Pain Split gives it a form of recovery, which can help in longer games. Defog is another option, as Rotom-W beats common entry hazard setters like Necrozma-DM, Landorus-T, and Heatran. Leftovers is the preferred item to give Rotom-W a form of passive recovery.</p> <p>Rotom-W fits best on bulky offense teams. It's best paired up with gods with high HP stats like Yveltal, Kyurem-W, and Ho-Oh. Other pivoting teammates like the aforementioned Yveltal, as well as Landorus-T, Zeraora, and Tapu Koko, are highly valued as they're able to keep up the momentum alongside Rotom-W. Powerful wallbreakers like Tapu Lele, Kartana, and Rayquaza also appreciate Rotom-W's pivoting and ability to spread status. Grass-types like Kartana, Ferrothorn, and Tangrowth are annoying for it, so pairing it up with Grass checks like Tornadus-T, Heatran, and Galarian Slowking make for good partnerships. Will-O-Wisp variants are vulnerable against special attackers like Mewtwo, Nidoking, and Tapu Lele, making specially defensive walls such as Galarian Slowking, Tangrowth, and Necrozma-DM fantastic teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Heatran": {
    "comments": "<h1>Other Options</h1> <p>Scorching Sands is an option over Earth Power to spread burns, but the damage drop is noticeable and can make it miss out on KOs such as Tapu Koko and opposing Heatran. An offensive set consisting of Eruption, Earth Power, Ancient Power, and Solar Beam is possible on sun teams, however its reliance on staying at full HP and the lack of a pivot option from Groudon and Torkoal make it very inconsistent. Flame Body over Flash Fire potentially punishes physical Pokemon, especially if they pivot out with U-turn, but this makes Heatran more vulnerable to Fire-types like Ho-Oh and Victini.</p> <h1>Checks and Counters</h1> <p><strong>Ground-type Pokemon and Coverage: Unless Heatran has its Air Balloon intact, Ground-type moves will heavily damage if not OHKO it. Nidoking and Excadrill can outspeed and OHKO the specially defensive variant, while Landorus-T and Zygarde-10% can take a hit and OHKO in return, with the latter also ignoring Air Balloon. However, none of these Pokemon can switch in safely. Earthquake from Ho-Oh and Tangrowth deters Heatran from switching in directly and trapping them.</p> <p><strong>Water-type Pokemon: Offensive Water-types like Kyogre and Urshifu-R threaten to OHKO Heatran with their powerful STAB attacks, and the latter also ignores Protect thanks to Unseen Fist. Defensive Water-type Pokemon like Gastrodon and Slowbro can muscle past or force mind game against Heatran. All of them still has to watch out for Toxic on the switch in though.</p> <p><strong>Offensive Pressure: Since Heatran usually needs a pivot from teammate to safely get in, offensive pressure prevents its partners like Landorus-T Rillaboom from safely using U-turn. Examples of Pokemon that can force these Pokemon out or pivot against them include Tornadus-T and Yveltal.</p> ",
    "sets": [
      {
        "name": "Specially Defensive (HP, Any)",
        "description": "<p>Thanks to its great typing and stats, Heatran is a good special tank that can check many Pokemon such as Volcarona and Kyurem-W without Earth Power. Magma Storm is a powerful Fire-type STAB move that also traps and deals chip damage, allowing Heatran to eliminate passive Pokemon like Clefable and Pyukumuku in conjunction with Taunt. Lava Plume is an option with better accuracy and PP that threatens a burn on potential switch-ins such as Rayquaza and Garchomp. Stealth Rock lets it support its teammates, and Heatran's ability to threaten common entry hazard removers allows it to keep it on the field frequently. Toxic cripples common switch-ins such as Gastrodon and Slowking and deals a lot of passive damage when stacked with Magma Storm. Earth Power is used to hit opposing Heatran, which otherwise wall it, as well as lessens the need to use Magma Storm's low PP against foes like Tapu Koko and Victini. Protect helps Heatran rack up passive damage as well as gain extra Leftovers recovery. It also scouts common Choice item Pokemon, like Zygarde-10% and Kyogre. Taunt is an option to prevent recovery moves and Teleport from defensive Pokemon, notably Clefable. Leftovers is the preferred item to give Heatran recovery, but Air Balloon is an aggressive option that lets it check Nidoking and opposing Heatran at least once, and also check Dhelmise after it pops. If it is not in the Speed slot, 120 Speed EVs lets Heatran outspeed uninvested base 90 Pokemon, which are common thanks to powerful gods like Kyogre and Ho-Oh, in addition to Bold and Modest Magnezone. If Heatran does receive Speed, it can invest more fully in Special Defense.</p> <p>Specially Defensive Heatran thrives on bulky offense teams where it gets many opportunities to switch in. Many physically offensive Pokemon enjoy Stealth Rock to wear down their checks and counters, especially those with Knock Off to remove Heavy-Duty Boots like Weavile and Kartana. Moreover, Heatran threatens physical walls that they can't break though such as Skarmory and Ho-Oh. Special attackers like Kyurem-W and Nidoking can struggle against specially defensive cores, and Heatran can help soften these walls for them. Offensive and defensive pivots complement Stealth Rock well by racking up damage and give Heatran more opportunities to switch in. Examples of pivots include offensive Pokemon like Zeraora and Rillaboom and defensive Pokemon like Slowking and Corviknight. Rillaboom notably synergizes well with Heatran thanks to Grassy Terrain providing extra recovery and halving Earthquake damage. Heatran is unable to deal with some special wallbreakers, namely Kyogre and Nidoking, so Gastrodon can cover for Heatran well. Physical Ground- and Fighting-types dent Heatran, which Buzzwole, Tangrowth, and Landorus-T handle well.</p> "
      },
      {
        "name": "Offensive (Speed)",
        "description": "<p>Offensive Heatran specializes in trapping and getting rid of passive defensive Pokemon that can otherwise cause problems, such as Ho-Oh and Clefable. Magma Storm is its main Fire-type STAB attack that deals residual damage in addition to its high Base Power, allowing it to beat even Pokemon that resist it such as Giratina and Ho-Oh without Earthquake. Earth Power destroys opposing Heatran, which otherwise walls it completely. Toxic further increases its passive damage, helping against said foes and reducing the need to constantly waste Magma Storm's low PP. Taunt prevents the defensive Pokemon from using their recovery moves, pivoting out with Teleport, or phazing Heatran out with Roar and Whirlwind. Leftovers's passive recovery allows Heatran to more comfortably take on the defensive Pokemon. If opposing Heatran is a concern, Air Balloon lets Heatran wall it, as well as Ho-Oh opting for Earthquake over Brave Bird.</p> <p>Offensive Heatran finds its home on balance and bulky offense teams as a way to make progress against bulkier builds. Heatran usually doesn't like switching in directly, so pivots like Slowbro and Landorus-T enable it to safely get a favorable matchup. Late game cleaners like Choice Scarf Kartana and Tapu Lele appreciate having opposing walls removed or weakened. Water- and Ground-type Pokemon such as Kyogre and Excadrill threaten an OHKO on Heatran, which Grass-types like Tangrowth and Ferrothorn can handle. Rillaboom threatens fast offensive Pokemon, as well as provides Grassy Terrain to give Heatran additional recovery and weaken Earthquake damage. Fighting-type coverage from the likes of Zeraora and Kartana can be dealt with by partners like Clefable.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Victini": {
    "comments": "<h1>Other Options</h1> <p>Glaciate can be used for speed control, but forces Victini to give up a coverage move, which makes it overall less threatening. It can run Trick Room so it doesn't have to worry about the Speed drop from V-create, but it is again forced to give up a coverage move and is underwhelming outside of Trick Room.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types</strong>: Fire-types like Heatran and Ho-Oh can switch into V-create and force out Choice Band Victini. Ho-Oh, however, must fear Bolt Strike.</p> <p><strong>Bulky Water-types: Water-types such as Slowking and Slowbro can come in for free if Victini is locked into V-create, but must fear Bolt Strike, which 2HKOes them.</p> <p><strong>Knock Off: Knock Off from defensive Pokemon that Victini may try to switch into like Tangrowth severely hinders Victini's ability to pivot by making it vulnerable to Stealth Rock.</p> <p><strong>Faster Pokemon: Many fast wallbreakers such as Zeraora, Zygarde-10%, Weavile, and Garchomp can outspeed Victini and exploit its mediocre defensive typing. However, Zeraora and Weavile must beware Speed inheritor sets, as they are OHKOed by a faster V-create. Garchomp and Zygarde-10% must also be wary of Glaciate, which can severely dent them and put Victini within range to outspeed and KO them.</p> ",
    "sets": [
      {
        "name": "Wallbreaker (Attack / Speed)",
        "description": "<p>With solid all around stats and great moves at its disposal, Victini is an excellent wallbreaker and pivot. V-create is a very strong STAB move that deals massive damage to all neutral targets. Zen Headbutt is a nice secondary STAB move that hits foes that resist Fire like Volcanion and has good neutral coverage with V-create, and also does not reduce Victini's stats. U-turn allows Victini to keep up momentum after scoring a KO or on a predicted switch to a check like physically defensive Landorus-T. Bolt Strike is a great coverage move to hit Pokemon that resist V-create such as Slowking and Ho-Oh. Heavy-Duty Boots allows Victini to switch in more easily without worry about Stealth Rock and have the freedom to switch moves, but Choice Band deals incredible damage. Speed receivers should run Jolly to make the most of their new Speed stat, and Attack Adamant or Jolly.</p> <p>Victini loves to receive donations from gods with high Attack stats like Necrozma-DM, Rayquaza, and Groudon. Groudon's Drought also increases V-create's damage even further. Alternatively, it can receive Speed from fast gods like Mewtwo, Zamazenta, and Pheromosa. Many setup sweepers appreciate Victini's ability to bring them in with U-turn, such as Rayquaza and Bulk Up Zeraora. Necrozma-DM and Victini synergize well, with Victini checking bulky Steel-types and making great use of Necrozma-DM's Attack stat, and Necrozma-DM switching into defensive Knock Off users that threaten Victini, activating its Weakness Policy and threatening to sweep. Victini is prone to being outsped after using V-create, so Landorus-T, which is immune to Earthquake from Garchomp and walls Zeraora, is a good teammate to handle faster threats. Victini is crippled by Knock Off, so bulky Pokemon that can switch into it like Buzzwole are appreciated. Choice Band sets require excellent entry hazard removal, so reliable Defog users such as Corviknight, Skarmory, Ho-Oh, and Tornadus-T are a necessity. Victini also likes being pivoted in by Pokemon like Landorus-T, Slowking, and Tapu Koko.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 584907, "username": "Wes8888"}]}
  },
  "Excadrill": {"sets": [{"name": "Sand Rush (Atk, Spe)"}, {"name": "Bulky Removal (SpD)"}]},
  "Ferrothorn": {"sets": [{"name": "Specially Defensive (HP)"}]},
  "Bisharp": {
    "comments": "<h1>Other Options</h1> <p>Bisharp can opt to hold a Choice Band to increase its wallbreaking ability, but it is a tough trade-off, as it means Bisharp can no longer run Swords Dance. Beat Up can be run with Choice Band to increase its damage output further. Low Kick threatens Steel-type Pokemon like Cobalion, which otherwise check Bisharp.</p> <h1>Checks and Counters</h1> <p><strong>Fast Offensive Pokemon: Bisharp is threatened by many offensive Pokemon that either Speed tie or outspeed it post-donation, such as Tapu Koko and Zeraora. However, many of these Pokemon are threatened by a boosted Sucker Punch.</p> <p><strong>Fighting-types: Fighting-types such as Zamazenta, Buzzwole, Urshifu-R, and Cobalion resist Bisharp's Dark-type attacks and are not threatened by Iron Head, and they force Bisharp out by threatening a KO.</p> <p><strong>Physical Walls: Physically defensive Pokemon such as Hippowdon, Quagsire, and Corviknight take very little damage from Bisharp's attacks and commonly carry moves such as Body Press or Earthquake that threaten it.</p> <p><strong>Psychic Surge: Psychic Surge removes Bisharp's ability to check faster Pokemon with Sucker Punch, so Pokemon such as Choice Scarf Tapu Lele can threaten it.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Speed)",
        "description": "<p>A Speed donation from its god makes Bisharp a threatening sweeper and wallbreaker. Bisharp's high base Attack and Swords Dance let it threaten 2HKOs against a large portion of the metagame after a boost, including Landorus-T and Corviknight. Its Steel type helps it set up by giving switch-ins against Grass- and Psychic-type moves, which, combined with Defiant, gives it a niche over other common physical wallbreakers such as Kartana. Bisharp's dual STAB moves, Knock Off and Iron Head, hit most Pokemon for at least neutral damage. Sucker Punch gives it strong priority, allowing it to revenge kill weakened. foes. Black Glasses boosts most of Bisharp's attacks, and Life Orb's slight power upgrade isn't usually worth the recoil. However, Life Orb powers up Iron Head, notably guaranteeing a 2HKO against physically defensive Tangrowth. Defiant lets Bisharp benefit from opposing Intimidate users, including the ubiquitous Landorus-T, and also threaten opposing Defoggers and Sticky Webs teams. A Jolly nature and Attack investment are used to make the most of Bisharp's new Speed tier, but an Adamant nature can be used to increase its damage output, especially if receiving a less valuable Speed tier.</p> <p>Bisharp works best when paired with fast gods such as Mewtwo, Pheromosa, and Zamazenta. It appreciates slow pivots such as Slowbro and Corviknight to bring it in safely, as it can be worn down slowly over the course of a game. Although Bisharp is able to threaten Pokemon such as Skarmory and Corviknight, both of them can run Body Press, which OHKOes it. Thus, Bisharp appreciates Pokemon like Magnezone and Nidoking, which threaten Skarmory, Corviknight, and other checks to Bisharp such as Tapu Fini. Other fast offensive Pokemon such as Tapu Koko can force Bisharp out, so it pairs well with strong defensive Pokemon such as Ferrothorn and Landorus-T. These Pokemon can also provide entry hazards, which weaken Bisharp's checks and synergize with Defiant punishing Defoggers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Volcarona": {"sets": [{"name": "Bulky Quiver Dance (Def)"}, {"name": "Offensive Quiver Dance (Def, SpA)"}]},
  "Tornadus-Therian": {
    "comments": "<h1>Other Options</h1> <p>Sludge Bomb or Toxic can be an option to further cripple its switch-ins like Gastrodon, and Sludge Bomb also heavily damages Tapu Koko. Grass Knot surprises Gastrodon and Groudon but is otherwise not very useful. A defensive set with either Rocky Helmet or Assault Vest is possible, however it's usually not worth it due to Tornadus-T's weakness to Stealth Rock. A physical set with Acrobatics and no item can surprise special walls, however its weakness to Rock is noticeable and requires a very specific team to work.</p> <h1>Checks and Counters</h1> <p><strong>Electric-type Pokemon: Zeraora and Tapu Koko are faster and can easily OHKO Tornadus-T. However, Zeraora doesn't want to switch in directly. Tapu Koko still fears the rare Sludge Bomb, but otherwise can restore its HP lost with Roost.</p> <p><strong>Faster Offensive Threats: While having decent bulk, many faster offensive Pokemon can still scare Tornadus-T out with their attacks such as Pheromosa, Mewtwo, and their Speed receivers, as well as Choice Scarf users like Kyurem-W. However, most of them can't switch in directly.</p> <p><strong>Specially Bulky Pokemon: Specially bulky Pokemon like Slowking and Gastrodon can deal with Tornadus-T well, and they can also deal with Nasty Plot with Dragon Tail and Clear Smog, respectively.</p> <p><strong>Knock Off: Once Tornadus-T loses its item, it becomes vulnerable to Stealth Rock and can struggle to check what it needs to repeatedly. Examples include Rillaboom, Tangrowth, and Landorus-T.</p> ",
    "sets": [
      {
        "name": "Defog (HP, Defense, Special Defense)",
        "description": "<p>Defog Tornadus-T is a great support Pokemon that provides consistent entry hazard removal and pivoting and also boasts a great Speed tier that outpaces Zygarde-10% and Alolan Persian. Hurricane hits Pokemon like Amoonguss and Landorus-T decently hard thanks to its high Base Power. Alternatively, Heat Wave ensures Tornadus-T can keep entry hazards off the field against Ferrothorn and Skarmory by forcing them out. Defog supports its teammates by preventing chip damage, and Tornadus-T can usually remove entry hazards multiple times thanks to Regenerator. U-turn helps it gain momentum on forced switches while also dealing chip damage. Knock Off deters switch-ins that rely on their items like Ho-Oh and and also helps deal with stall teams more effectively by forcing progress. Heavy-Duty Boots is required to negate Stealth Rock damage and let Tornadus-T switch in more comfortably. Timid is the preferred nature, as U-turn and Knock Off are mainly used for their utility.</p> <p>Defog Tornadus-T is a great option on almost all team archetypes, with the exception of hyper offense. It enjoys receiving HP or Defense, but can credibly do its job in any slot if needed. While matching up well against bulkier teams, Tornadus-T can be overwhelmed by strong offensive threats like Kyogre, Victini, and Nidoking, so running multiple bulky Pokemon is recommended. Landorus-T can form an entry hazard control core with Tornadus-T thanks to Stealth Rock and also deals with Electric-type Pokemon, namely Zeraora and Tapu Koko. Entry hazard setters like Ferrothorn and Heatran also synergize well with it. Ice-types such as Weavile and Kyurem-B threaten Tornadus-T, which can be taken care of by teammates like Zamazenta-C and Clefable. RegenVest users like Tangrowth and Slowking can take on special attackers like Kyogre and Dialga. Rotom-W checks a plethora of physical attackers such as Rayquaza, Victini, and Necrozma-DM; however, they are often both competing for the HP slot. Offensive Pokemon like Nidoking and Kyogre can take advantage of common defensive Pokemon that like to switch into Tornadus-T, such as Corviknight and Zamazenta-C. Those that tend to pivot or switch out multiple times throughout a game such as Victini and Tapu Koko also like having Stealth Rock removed in case they don't have Heavy-Duty Boots. A teammate that can take Knock Off is preferred. Zamazenta-C takes very little from Knock Off, and Clefable can also increase Tornadus-T's longevity with cleric support.</p> "
      },
      {
        "name": "Nasty Plot (Special Attack)",
        "description": "<p>With a Special Attack donation, Tornadus-T becomes a great special setup sweeper thanks to its coverage and Speed. It is also greatly helped out by Regenerator, which allows it to set up and attack multiple times and wear down its checks. Heavy-Duty Boots extends its longevity even further by negating its Stealth Rock weakness. Hurricane is its main STAB option, threatening slower offensive threats such as Rillaboom and Zygarde-10%. Nasty Plot further boosts its offensive capabilities and helps it break bulky special walls such as Reuniclus and Slowking. Focus Blast nails Steel- and Rock-types that can easily take Hurricane like Heatran, Ferrothorn, Excadrill, and Tyranitar. Heat Wave gives it a more reliable attack that still deals with most Steel-type Pokemon, notably Necrozma-DM, but misses out on Heatran and Tyranitar. Knock Off helps Tornadus-T remove key items from foes, especially Assault Vest and Heavy-Duty Boots, to wear down its checks and counters like Clear Smog Gastrodon and Ho-Oh, which can also help other teammates break them. U-turn instead keeps offensive momentum and is better against walls without Regenerator like Rotom-W and Heatran when combined with entry hazards. Taunt is another alternative that shuts down status and recovery moves from the likes of Gastrodon and Giratina. If Kyogre is a partner, Weather Ball is also viable to hit Heatran and Excadrill better.</p> <p>Bulky offense and balance teams appreciate Tornadus-T's ability to make progress and allow Tornadus-T to utilize Regenerator as much as possible. Gods with a high Special Attack like Kyurem-W and Dialga are a natural fit to bolster its Special Attack. Kyogre notably synergizes well with Tornadus-T thanks to Drizzle boosting Hurricane's accuracy. In turn, Kyogre enjoys its checks like Gastrodon, Ferrothorn, and Tangrowth getting worn down. Fast Electric-type Pokemon such as Tapu Koko and Zeraora outspeed and threaten to OHKO Tornadus-T, so answers to these like Tangrowth and Landorus-T are necessary. Ferrothorn notably also provides a switch-in against Weavile and Choice Scarf Kyurem-W. It can also check Tyranitar should Tornadus-T not run Focus Blast and complement its ability to pivot with either Stealth Rock or Spikes. Other partners with entry hazards like Heatran and Clefable also make for good teammates. Offensive Pokemon, especially those that can form a pivot core with Tornadus-T like Tapu Koko and Victini, keep the offensive pressure that Tornadus-T can provide. A Knock Off sponge should also be considered as Tornadus-T hates having its Heavy-Duty Boots removed, so Zamazenta-C and Clefable make good teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Landorus-Therian": {
    "comments": "<h1>Other Options</h1> <p>If donating HP or Defense to Landorus-T, a specially defensive EV spread lets it better check Pokemon such as Tapu Koko, but this is usually less consistent than the listed spread. Landorus-T can also invest in both of its defensive stats, making it a better mixed wall. Defensive sets can run 144 Speed EVs can be used to outspeed base 77 Pokemon such as Heatran and Necrozma-DM. Offensive sets can also run Choice Scarf, outspeeding common Pokemon such as Tapu Koko, Zeraora, and Zygarde-10%.</p> <h1>Checks and Counters</h1> <p><strong>Corviknight and Skarmory: Both Corviknight and Skarmory are immune to Landorus-T's STAB Earthquake and Toxic, do not fear its unboosted Stone Edge, and can clear Stealth Rock with Defog, allowing them to safely pivot out to a teammate that threatens Landorus-T. However, both may struggle versus Swords Dance sets without Iron Defense, or Whirlwind in Skarmory's case, and fear sets with Smack Down.</p> <p><strong>Ice-type Pokemon and Coverage</strong>: Ice-type Pokemon such as Weavile and Kyurem-W and coverage moves, such as Ice Beam from Nidoking and Tyranitar, heavily threaten Landorus-T. However, these Pokemon struggle to switch into Landorus-T directly.</p> <p><strong>Chip Damage: Chip damage from entry hazards and status is very annoying for Landorus-T, as it lacks reliable recovery and can be chipped down over the course of a game.</p> <p><strong>Strong Wallbreakers</strong>: Since Landorus-T lacks a reliable source of recovery, strong attackers like RIllaboom and Zygarde-10% can slowly beat it, as it can only switch into them a limited number of times.</p> ",
    "sets": [
      {
        "name": "Defensive (HP, Defense, Special Defense)",
        "description": "<p>Landorus-T is one of the best Pokemon in the metagame thanks to its great movepool, amazing ability, and good defensive stats. It's an amazing defensive pivot that can check various physical attackers such as Garchomp, Zeraora, and Excadrill, as well as reliably setting Stealth Rock. Earthquake makes Landorus-T less passive, as even when uninvested, its STAB-boosted Earthquake deals heavy damage to Ground-weak Pokemon such as Heatran and Tapu Koko. Knock Off weakens any Pokemon that switches in, making Landorus-T much more annoying to switch into, while Toxic is an alternative that cripples Pokemon like Tangrowth, Rotom-W, and opposing Landorus-T. U-turn allows it to safely pivot out of bad matchups, such as Corviknight, while also generating momentum for the team. Landorus-T finds ample opportunities to set Stealth Rock thanks to its ability to force switches; however, it can opt for Defog instead if its team needs an entry hazard remover. Leftovers is Landorus-T's only form of recovery, so it needs to be careful of Knock Off from Pokemon like Zeraora and other Landorus-T. 8 Speed EVs allow Landorus to outspeed Victini after a Speed drop, in addition to Modest and Bold Magnezone.</p> <p>Defensive Landorus-T fits best on bulky offense or balance teams, as it is a great check to many offensive threats in the short term, but it can often be worn down throughout longer games, making it a worse fit for stall teams. It enjoys any defensive stat boost, letting it fit with many gods such as Yveltal and Zamazenta-C. Zamazenta-C notably resists Ice to compensate for Landorus-T's 4x weakness. Landorus-T also pairs well with strong wallbreakers like Tapu Koko and Dhelmise, as they appreciate it pivoting them in safely and setting Stealth Rock to help them wear down their checks. Landorus-T can also check many fast offensive threats such as Zeraora and Zygarde-10%, which are problematic for slow wallbreakers, in particular Nidoking. Landorus-T is threatened by Water-types such as Urshifu-R and Rotom-W, so Grass-types such as Ferrothorn and Tangrowth make good partners. Landorus-T is susceptible to entry hazards wearing it down over longer games, so good Defoggers such as Rotom-W, Tornadus-T, and Corviknight are good teammates. Magnezone traps and removes Corviknight and Skarmory, two Pokemon that are impervious to Landorus-T's moves and can easily clear its Stealth Rock with Defog.</p> "
      },
      {
        "name": "Offensive (Speed)",
        "description": "<p>Landorus-T's high base 145 Attack and STAB Earthquake make it a powerful wallbreaker and threatening sweeper, especially with a Speed donation. Earthquake is Landorus-T's main attack, hitting many common Pokemon such as Tapu Koko, Nidoking, and Heatran for super effective damage, as well as hitting others such as Clefable and Ferrothorn for neutral damage. Stone Edge is used to hit Flying-types such as Corviknight and opposing Landorus-T for neutral damage, while Smack Down trades initial power for the ability to hit them with Earthquake next turn. Swords Dance boosts Landorus-T's already high Attack even further, letting it break through even sturdy defensive stalwarts, notably Ferrothorn and Magic Guard Clefable. Knock Off cripples its switch-ins and nails Psychic- and Ghost-type Pokemon, including Slowbro and Giratina, while Rock Polish boosts Landorus-T's donated Speed even higher, allowing it to more easily sweep. Life Orb is standard, but Soft Sand can be used to boost Earthquake's power to similar levels without the recoil. Leftovers is another option, trading damage output for easier setup and longevity.</p> <p>Offensive Landorus-T fits best on bulky or hyper offense teams, as it lacks the longevity needed for longer games and often only gets one chance to set up. Gods with high Speed stats such as Pheromosa, Zamazenta-C, and Mewtwo let Landorus-T outspeed or Speed tie many common Pokemon, such as Rayquaza, Kartana, and Tapu Koko. Defensive pivots such as Corviknight and Rotom-W can place it into favorable matchups safely. Ferrothorn and Heatran set entry hazards for Landorus-T while helping it beat Pokemon like Choice Scarf Kyogre and Weavile. Since Landorus-T has trouble breaking through Skarmory and Corviknight, Electric-type Pokemon like Tapu Koko and Zeraora are great partners, as they are able to both threaten them and pivot Landorus-T in with U-turn or Volt Switch. Magnezone is an especially great partner, as it can trap and OHKO Corviknight and Skarmory outright.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 500884, "username": "longhiep341"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Kyurem-White": {
    "comments": "<h1>Other Options</h1> <p>Stone Edge is an option to nail Ho-Oh, and Substitute can be used to ease predictions, but it is usually not worth sacrificing coverage for.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers: Pokemon like Kartana, Bisharp, Tapu Koko, Zamazenta-C, and Tapu Lele are all capable of outspeeding and revenge killing non-Choice Scarf Kyurem-W, and some can revenge kill even that set.</p> <p><strong>Specially Bulky Water-types: When Kyurem is not carrying Freeze-Dry, specially defensive Water-types like Special Defense-receiving Gastrodon and HP-receiving Tapu Fini and Rotom-W can check it.</p> <p><strong>Ho-Oh: Ho-Oh is a special wall that is not hit super effectively by any of Kyurem-W's primary attacks and also donates an incredible Special Defense stat to a team member.</p> ",
    "sets": [
      {
        "name": "Choice Item Attacker",
        "description": "<p>Kyurem-W's power and type coverage make it difficult to switch into reliably. It offers very good stats for an offensive team, including a huge Special Attack and strong HP and Attack, as well as a usable Speed stat. Choice Specs makes Kyurem-W a truly fearsome wallbreaker, while a Choice Scarf allows it to act as a revenge killer. Draco Meteor deals significant damage to anything that does not resist it. Ice Beam hits bulky Grass- and Ground-types like Tangrowth and Landorus-T for heavy damage or an OHKO, and it's Kyurem-W's most consistent STAB attack, while Earth Power nails Heatran and Necrozma-DM. Freeze-Dry is a very useful tool, hitting Water-types like Rotom-W and Gastrodon that would otherwise annoy Kyurem-W. Fusion Flare covers Steel-types like Ferrothorn and Corviknight, as well as being slightly stronger against Necrozma-DM.</p> <p>Kyurem-W often fits best on offensive teams, where receivers like Nidoking and Tapu Koko can take advantage of its monstrous Special Attack stat and physical attackers like Mimikyu and Victini can receive its respectable Attack stat. Kyurem-W's high HP stat supports defensive pivots like Rotom-W and Landorus-T, which can help deliver it onto the field safely while removing Stealth Rock for it. It is also threatened by Fairy- and Fighting-types, so their switch-ins like Heatran, Ferrothorn, and Clefable make great partners for it, and their offensive checks like Kartana and Tapu Lele do as well. Since Kyurem-W is often Choice locked, it is relatively easy to force out. Due to this weakness, reliable defensive switch-ins such as Skarmory and Tangrowth make good teammates.</p> "
      },
      {
        "name": "Special Attacker",
        "description": "<p>Kyurem-W is a strong wallbreaker with great coverage that's difficult to switch into. It offers very strong stats to donate on offensive teams, donating monstrous Special Attack, strong HP and Attack, and respectable Speed. Heavy-Duty Boots especially helps with Kyurem-W's Stealth Rock weakness, while Life Orb gives it a damage increase without limiting its coverage flexibility with Choice Specs. Ice Beam is the primary attack, dealing good damage to neutral targets and heavily damaging Flying- and Grass-types like Yveltal, Rillaboom, and Tangrowth. Freeze-Dry is another option that allows for super effective damage on targets like Gastrodon and Rotom-W. Draco Meteor is its most powerful attack, heavily damaging Pokemon that resist its other attacks, such as Rotom-W. Roost enables Kyurem-W to have some longevity and break through its switch-ins over the course of longer games. Fusion Flare lets it get through Steel-types like Ferrothorn and Corviknight. The combination of Ice- and Fire-type coverage allows Kyurem-W to hit the majority of the tier for at least neutral damage.</p> <p>Kyurem-W fits best on offensive teams, where its teammates can take advantage of its great donated stats. Special attackers like Nidoking and Tapu Lele and physical attackers such as Victini and Zygarde-10% all benefit from its excellent attacking stats. Its strong HP stat benefits defensive Pokemon like Rotom-W and Ferrothorn, which offer pivot and entry hazard support, respectively. Kyurem-W is offensively threatened by Steel- and Fairy-types like Bisharp, Kartana, and Tapu Lele, so Pokemon like Heatran and Ferrothorn make good defensive partners. Kyurem-W appreciates strong entry hazard control from partners like Corviknight and Rotom-W if forgoing Heavy-Duty Boots. Additionally, Kyurem-W is relatively slow and easy to revenge kill with faster threats, so bulky teammates and fast revenge killers like Skarmory and Tapu Koko, respectively, make great partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 525446, "username": "Ducky"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Yveltal": {"sets": [{"name": "Specially Offensive"}, {"name": "Choice Scarf"}, {"name": "Hone Claws"}]},
  "Zygarde-10%": {
    "comments": "<h1>Other Options</h1> <p>Zygarde-10% can run a Coil or Dragon Dance set that, once set up, is a powerful sweeper, but lacks immediate power.</p> <h1>Checks and Counters</h1> <p><strong>Fast Revenge Killers</strong>: Weavile, Mewtwo, Tapu Koko, and other faster offensive Pokemon can threaten out Zygarde-10% easily.</p> <p><strong>Bulky Bug and Grass Pokemon: Pokemon like Buzzwole, physically defensive Tangrowth, and even Dhelmise can take at least one Thousand Arrows from Zygarde-10% and threaten to OHKO back.</p> ",
    "sets": [
      {
        "name": "Choice Band (Attack)",
        "description": "<p>Zygarde-10% is a strong wallbreaker that takes advantage of its naturally high Speed tier and the completely fair and balanced move that is Thousand Arrows. Thousand Arrows is Zygarde-10%'s primary attack, and with no immunities and few common resistances, it can safely fire off Choice Band-boosted attacks with little need for prediction. Toxic can chip down switch-ins to Zygarde-10%, like physically defensive Tangrowth and Buzzwole, while Glare is another option to potentially gain free turns while also helping out slower teammates. Extreme Speed is used to pick off weakened, faster targets like Zeraora, Weavile, and Speed receivers faster than Zygarde-10%. Outrage is Zygarde-10%'s single strongest move and useful for overpowering Giratina and Tangrowth but leaves it exceedingly vulnerable to being revenge killed.</p> <p>A god with a high Attack stat, like Kyurem-B, Rayquaza, or Necrozma-DM, is a necessity to pair with Zygarde-10%. Its ability to eliminate Electric- and Steel-type foes like Rotom-W and Heatran is a great asset on offense and bulky offense teams. Zygarde-10% cannot break through physically bulky Pokemon like Buzzwole or Ferrothorn on its own and appreciates having powerful special attackers like Tapu Koko and Volcanion that are capable of eliminating these checks. It is able to break through Skarmory and Corviknight, opening the way for teammates like Urshifu-R , Necrozma-DM, and Kartana. Pokemon like Kartana and Zeraora are able to take advantage of the holes Zygarde-10% opens up to finish off weakened teams. Due to Zygarde-10%'s poor bulk, it benefits from the presence of bulky walls like Rotom-W and Ferrothorn, which can provide entry hazard removal and offensive hazard support. Rotom-W, Slowking, and Landorus-T can act as pivots for it, allowing for safe entry onto the field.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Mimikyu": {"sets": [{"name": "Swords Dance (Atk, Spe)"}]},
  "Dhelmise": {
    "comments": "<h1>Other Options</h1> <p>Dhelmise can equip Life Orb or Heavy-Duty Boots to give it the freedom to switch moves, but the extra power of Choice Band, plus the ability to to cripple a foe with Switcheroo, is usually preferred. Dhelmise also has access to Rapid Spin and Synthesis to provide entry hazard control and longevity, respectively, but due to its poor bulk it can rarely use either move. Anchor Shot is an option over Swords Dance to hit Yveltal neutrally and Clefable super effectively and works well with Switcheroo to trap and and PP stall passive walls that cannot threaten it.</p> <h1>Checks and Counters</h1> <p><strong>Yveltal: Yveltal resists both of Dhelmise's STAB moves, has reliable recovery, and can OHKO back with ease. It does not appreciate being given a Choice Band but is otherwise a hard wall to Dhelmise.</p> <p><strong>Other Dark-types</strong>: Alolan Persian, Galarian Moltres, and Tyranitar can all stomach Poltergeist and KO back. However, they lack recovery and are more short-term answers.</p> <p><strong>Skarmory: Skarmory with an HP donation effortlessly tanks any of Dhelmise's attacks but must watch out for Switcheroo.</p> <p><strong>Bulky Defense and HP Receivers</strong>: Clefable and Ferrothorn can switch in and retaliate with Knock Off, but they must be wary of Switcheroo or being worn down, respectively.</p> <p><strong>Faster Receivers: Dhelmise has awful bulk and is easily OHKOed by a vast majority of other common fast receivers including Pangoro, Volcanion, and Mamoswine. If they receive a higher Speed donation than Dhelmise does, it can easily be revenge killed.</p> ",
    "sets": [
      {
        "name": "Choice Band (Speed)",
        "description": "<p>Boasting high-powered STAB moves and a natural base 131 Attack, Dhelmise is an excellent candidate for a Speed donation from one of the faster gods. Ghost has amazing neutral coverage in Godly Gift; there are no relevant Normal-types, and only a few common Dark-types, namely Yveltal, Alolan Persian, and Galarian Moltres. As a result, Choice Band Dhelmise can often fire off Poltergeist with little prediction. Power Whip is slightly stronger and can provide useful coverage for Rotom-W and Tapu Fini. Switcheroo is useful for crippling passive walls that avoid being 2HKOed like HP Skarmory and Defense Clefable; it also helps against the rare itemless Giratina, which otherwise walls Dhelmise. Swords Dance pairs well with Switcheroo, as it helps Dhelmise power through fatter teams after crippling something with its Choice Band.</p> <p>Dhelmise can work on a wide variety of teams as long as it receives a good Speed donation. Mewtwo, Zamazenta-C, and Pheromosa are excellent gods, as they all provide base 130+ Speed, letting Dhelmise get the jump on most of the unboosted metagame. While Dhelmise has excellent coverage, it struggles against common Dark-types, most notably Yveltal; reliable checks like Tapu Fini and Tapu Koko are strongly recommended as teammates. Additionally, Dhelmise can struggle to break through Skarmory, Clefable, and Buzzwole due to their titanic bulk, so powerful Attack receivers like Zygarde-10%, Victini, and Zeraora make fantastic partners, as they can beat or at least cripple all of them with status. It is critically important to remember that Dhelmise has terrible synergy with Knock Off, as it renders the foe immune to Poltergeist; be very careful to not pair Dhelmise with teammates that rely on Knock Off to make progress like Tangrowth and Landorus-T. Dhelmise is easily revenge killed by Choice Scarf users, so bulky teammates like Skarmory and Tangrowth are recommended. Since Dhelmise has no form of recovery and often likes to switch in multiple times, reliable entry hazard control like Corviknight or Rotom-W is recommended.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 525446, "username": "Ducky"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Tapu Koko": {
    "comments": "<h1>Other Options</h1> <p>Tapu Koko can also use Grass Knot on its offensive pivot set to hit Gastrodon for super effective damage, but sacrificing Roost or U-turn is often not worth it. Light Clay and dual screens makes Tapu Koko a strong hyper offense lead when receiving HP. An HP donation can also be used to check Galarian Moltres and Yveltal more easily and is common when another teammate like Alolan Raichu can take advantage of Special Attack better. Calm Mind is an option to turn Tapu Koko into a strong wincon.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Ground-types: Pokemon like Gastrodon, Seismitoad, Excadrill, and Landorus-T are immune to Tapu Koko's primary STAB attack and often can force it out; however, the former two struggle with Grass Knot, while Landorus-T is susceptible to getting worn down.</p> <p><strong>Grass-types: Grass-types like Assault Vest Tangrowth, Ferrothorn, and Amoonguss can switch into Tapu Koko's attacks and force it out.</p> <p><strong>Faster Revenge Killers: Due to Tapu Koko's frailty, it can be revenge killed by Choice Scarf users and Pokemon receiving Speed from Zamazenta-C and Pheromosa, like Volcanion and Dhelmise.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot (Special Attack)",
        "description": "<p>Tapu Koko is a strong offensive pivot that can take advantage of its great Speed tier and a Special Attack donation to supercharge its offensive output. Heavy-Duty Boots allows it to come onto the field freely without fearing chip damage from entry hazards, improving its ability to pivot effectively. Terrain-boosted Thunderbolt is Tapu Koko's strongest attack against neutral targets and deals super effective damage versus Pokemon like Tapu Fini and Corviknight. Dazzling Gleam lets Tapu Koko effectively check common offensive threats such as Zygarde-10, Rayquaza, and Weavile while also wearing down switch-ins that resist or are immune to Thunderbolt like Landorus-T, Tangrowth, and Nidoking. U-turn preserves momentum against its checks, taking advantage of switches forced by Tapu Koko's powerful attacks while also chipping down checks like Gastrodon. Roost allows it to stay healthy throughout a game, giving it more opportunities to come onto the field and deal damage, and also lets it function as a soft check to offensive Dark- and Flying-types like Galarian Moltres, Yveltal, and Tornadus-T.</p> <p>Gods that can donate a high Special Attack, like Mewtwo, Yveltal, and Kyurem-W, make great teammates for Tapu Koko. It appreciates powerful wallbreakers, like Dhelmise and Victini, that can weaken teams and allow it to clean up in the late-game. Tapu Koko also helps bring them onto the field with its frequent pivoting. Tapu Koko can struggle to beat specially defensive Pokemon like Gastrodon, Assault Vest Tangrowth, and Ferrothorn, which offensive Pokemon like Kartana, Weavile, and Victini can help eliminate. Tapu Koko has mediocre bulk and enjoys having a sturdy defensive core to back it up. Its weakness to Ground- and Poison-type attacks make Landorus-T, Skarmory, and Corviknight excellent partners that can handle these attacks, in addition to providing entry hazard and pivot support. Pokemon faster than Tapu Koko like Choice Scarf Kyogre and Kartana, Pheromosa, and fast Speed receivers such as Pangoro are threats, and Pokemon like Skarmory and Ferrothorn can safely switch into them.</p> "
      },
      {
        "name": "Choice Specs (Special Attack)",
        "description": "<p>Choice Specs Tapu Koko is a formidable wallbreaker, thanks to its reliable STAB attacks and a Special Attack donation. Combined with Choice Specs, its attacks are very difficult to switch into, barring very specially bulky Pokemon like Tangrowth. Thunderbolt is Tapu Koko's strongest attack, dealing super effective damage to Slowbro and Corviknight, as well as offering strong neutral coverage against defensive Pokemon like Clefable. Dazzling Gleam is its secondary STAB attack, hitting Landorus-T and other Pokemon immune to Electric like Zeraora for good damage, while also dealing super effective damage to Giratina and Kyurem-B. Volt Switch lets Tapu Koko get off strong damage even when pivoting, while U-turn is more reliable and deals more damage to Grass-types like Rillaboom. Grass Knot offers super effective coverage for Ground-types like Gastrodon and Hippowdon, which otherwise wall this set.</p> <p>Tapu Koko needs a god with a high Special Attack, such as Pheromosa, Mewtwo, and Rayquaza, in order to do its job. Kyogre makes an excellent teammate, as Tapu Koko can weaken shared checks like Ferrothorn and Gastrodon for Kyogre. Since it is often pivoting, especially in the early-game, partners like Weavile and Volcanion that can take advantage of common switch-ins like Landorus-T, Tangrowth, and Ferrothorn make excellent teammates. Gastrodon can deal with offensive Pokemon like Nidoking that may try to take advantage of Choice-locked Tapu Koko. Even with a bolstered Special Attack, some specially bulky Pokemon like Tangrowth, Gastrodon, and Excadrill give it issues. Powerful wallbreakers like Victini, Kartana, and Zygarde-10% can help deal with them, opening the way for Tapu Koko. Since it will often pivot in and out of the field, Pokemon that can offer entry hazard removal, like Landorus-T and Corviknight, make good teammates for Tapu Koko. These Pokemon also offer a solid defensive backbone to support Tapu Koko's frailty.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 517892, "username": "pannuracotta"}, {"user_id": 500884, "username": "longhiep341"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Tapu Lele": {"sets": [{"name": "Choice Attacker (Spe)"}]},
  "Tapu Fini": {
    "comments": "<h1>Other Options</h1> <p>A defensive set with support moves like Defog, Knock Off, and Taunt, while viable, is outclassed by Pokemon with recovery such as Corviknight and Ho-Oh. A trapping set without Choice Scarf featuring Whirlpool and Nature's Madness can whittle down passive Pokemon, however a lot of these carry pivot moves, in particular U-Turn, and Tapu Fini's weak offensive presence means even offensive threats like Tapu Koko can switch in and force it out. Iron Defense and Stored Power are alternate options on the boosting set, however that would make Tapu Fini vulnerable to more Pokemon like Heatran.</p> <h1>Checks and Counters</h1> <p><strong>Offensive Electric-type Pokemon: Electric-types like Zeraora and Tapu Koko threaten to deal massive damage to Tapu Fini provided that it hasn't boosted enough. However, they struggle to switch in directly if Tapu Fini is a Special Attack receiver.</p> <p><strong>Grass-type Pokemon: Defensive Grass-type Pokemon such as Amoonguss and Ferrothorn have no trouble beating Tapu Fini one-on-one. To a lesser extent, Assault Vest Tangrowth can beat Tapu Fini if it switches in directly on the turn it first uses Calm Mind. Regardless, they still need to watch out for Trick, which can cripple them. Offensive Grass-types like Rillaboom and Kartana also force it out, however they can't switch in repeatedly, especially Rillaboom, as it is vulnerable to a Scald burn.</p> <p><strong>Poison-type Pokemon: Galarian Slowbro and Galarian Slowking take little damage from Tapu Fini's attacks and can hit hard back in return. They also sometimes carry Black Sludge, which punishes Tapu Fini's Trick. Nidoking and Nidoqueen can't reliably beat the Choice Scarf set, however they can deal enough damage to the setup variants for other teammates to revenge kill.</p> <p><strong>Fast Trick and Taunt: Calm Mind variants need multiple boosts to truly function so Taunt or Trick from a faster Pokemon can stop Tapu Fini's sweep. Examples include Slowking in the Speed slot and Mewtwo.</p> ",
    "sets": [
      {
        "name": "Calm Mind (HP, Special Attack)",
        "description": "<p>Calm Mind Tapu Fini is a dangerous wincon capable of setting up on passive Pokemon such as Giratina and Skarmory. It also has great bulk, especially if it receives HP, and a fantastic defensive typing, allowing it to check common attackers like Urshifu-R and Weavile. Calm Mind gradually boosts Tapu Fini's Special Defense, allowing it to shrug off weak special hits from the likes of Slowking and Clefable. Draining Kiss is preferred over Moonblast since it increases Tapu Fini's longevity and helps keep it out of range of being revenge killed by faster threats like Tapu Koko and Rayquaza. Taunt stops status effects, opposing setup, and phazing attempts aimed at Tapu Fini. Scald discourages Pokemon not protected by Misty Terrain from switching in and risking a burn, such as Rillaboom and Tornadus-T. 44 Speed EVs allow Tapu Fini to outrun common base 90 Speed Pokemon such as Ho-Oh, the aforementioned Giratina, and their Speed receivers.</p> <p>Tapu Fini fits best on bulkier builds that want a solid late-game wincon. Gods with a high HP stat like Yveltal and Ho-Oh make for great partners. They can also handle Grass-types that Tapu Fini struggles against such as Ferrothorn and Amoonguss. In return, Tapu Fini walls Weavile. Alternatively, a Special Attack donation from Kyurem-W or Dialga lessens the number of boosts needed to overwhelm the opposing team, which comes in handy against Clear Smog Gastrodon. Landorus-T also has great synergy with Tapu Fini, as it checks various Electric-type Pokemon such as Zeraora and Dracozolt. Entry hazards, especially Toxic Spikes, hinder Tapu Fini's ability to switch in, so entry hazard removal like Excadrill's Rapid Spin and Corviknight's Defog are necessary. Poison-type Pokemon such as Nidoking and Galarian Slowking beat Tapu Fini one-on-one if it doesn't have enough boosts, which sturdy special walls like Ho-Oh and Assault Vest Reuniclus can take on. If Gastrodon is a concern, offensive Tornadus-T invites it in and removes its Leftovers, allowing Tapu Fini to beat it. Magnezone traps and eliminates Ferrothorn, which is a common Tapu Fini answer, as well as Corviknight to prevent it from pivoting out against Tapu Fini.</p> "
      },
      {
        "name": "Choice Scarf (Special Attack)",
        "description": "<p>With a Choice Scarf, Tapu Fini outspeeds Pheromosa and its Speed receivers, making it a nice revenge killer when combined with a better Special Attack stat. Moonblast is its preferred Fairy STAB attack that deals great damage to many dangerous Ubers such as Yveltal and Kyurem-W, as well as frail receivers like Zeraora and Alolan Persian. Scald is more reliable and can threaten a burn on unprotected switch-ins such as Rillaboom and Corviknight, however Hydro Pump is still a usable alternative to increase its damage output. Trick cripples common defensive walls that can easily take Tapu Fini's attacks such as Gastrodon and Tangrowth. Taunt works well in tandem with Trick to deny recovery moves like Gastrodon's Recover and also prevent Slowbro and Slowking from using Teleport and gaining momentum. Whirlpool can surprise defensive Pokemon and potentially let Tapu Fini KO them should they lock themselves into an unfavorable move like entry hazards or Defog. Defog is another option if the team needs an entry hazard control option, which also helps Scald by removing Misty Terrain. While Misty Surge negates Tapu Fini's ability to spread burn, it also allows Tapu Fini to be played more aggressively by switching in directly against a predicted status inducing move or Rest.</p> <p>Choice Scarf Tapu Fini finds its place on bulky offense builds that enjoy its role compression. Gods with a high Special Attack stat like Yveltal and Dialga are great partners to maximize Tapu Fini's revenge kill capabilities. Yveltal and Dialga also have great defensive synergy with Tapu Fini, as the former can take on dangerous Grass-types like Rillaboom and Kartana while the latter can check Electric-types such as Zapdos. In turn, Tapu Fini can check Weavile and Pheromosa for them. Tangrowth handles a myriad of Grass- and Electric-type Pokemon Tapu Fini struggles with, and it also appreciates Misty Terrain to avoid status effects. Magnezone can capitalize on defensive Steel-types that have already been given a Choice Scarf, and also traps Ferrothorn, which is one of Tapu Fini's best counters. Bulky Pokemon with a setup option also like Misty Terrain to set up safely, which makes Kartana and Buzzwole great partners. If Tapu Fini doesn't run Defog, a teammate with an entry hazard removal option like Excadrill or Rotom-H is necessary.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Buzzwole": {"sets": [{"name": "Defensive (SpD)"}, {"name": "Choice Attacker (Spe)"}]},
  "Kartana": {
    "comments": "<h1>Other Options</h1> <p>Kartana can run Synthesis as its fourth move on Life Orb sets, helping it avoid being worn down over the course of a game, but sacrificing coverage. Aerial Ace is also an option to hit Buzzwole and Tangrowth super effectively. Protective Pads can also be used over Life Orb, trading damage output for avoiding damage from Rough Skin, Iron Barbs, and Rocky Helmet. A Timid Nature and 19 Attack IVs can also be used to have Beast Boost increase Kartana's Speed, turning it into a better sweeper at the cost of less initial damage.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Flying-types: Corviknight, Skarmory, and Ho-oh all resist both of Kartana's STAB moves, and can threaten it with either Body Press or Sacred Fire.</p> <p><strong>Physically Defensive Pokemon: Kartana has difficulty breaking through Amoongus, Tangrowth, and Buzzwole, which have enough Defense to check all of its sets.</p> <p><strong>Contact Effects</strong>: Contact effects such as Static, Flame Body, Iron Barbs, and Rocky Helmet make it difficult for Kartana to make progress.</p> <p><strong>Revenge Killers:</strong> Swords Dance sets can be revenge killed by faster threats such as Choice Scarf Victini and Zeraora. Choice Scarf sets can also be easily checked offensively, as opponents are able to take advantage of Kartana being locked into the same move.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Special Defense)",
        "description": "<p>Kartana's monstrous 181 base Attack stat, boosted even further via Life Orb and Swords Dance, makes it a fantastic wallbreaker. Inheriting Special Defense makes it much less susceptible to chip damage from resisted attacks like Tapu Koko's Thunderbolt. Kartana's Speed tier also allows it to outspeed many common Pokemon including Yveltal, all Kyurem formes, and Volcarona. Swords Dance helps it beat would-be checks such as Landorus-T inheriting Defense. Leaf Blade is its main form of damage, hitting Water-types like Slowbro and Rotom-W super effectively and dealing large amounts of damage to neutral targets. Knock Off is used to damage Flying- and Fire-type Pokemon such as Corviknight, Ho-oh, and Volcarona, removing their items like Leftovers or Heavy-Duty Boots, respectively, allowing Kartana to wear them down more easily. Sacred Sword hits Steel-type Pokemon like Ferrothorn super effectively, while also Flying-type Pokemon who are neutral to Fighting such as Skarmory.</p> <p>Swords Dance Kartana fits best on offensive teams, as it is excellent at wearing down opposing walls like Landorus-T and Corviknight so another teammate can sweep. Kartana is able to work with most gods, but is most commonly paired with more offensive gods such as Yveltal and Rayquaza, comma as they can also take advantage of the pressure Kartana puts on opposing teams and provide Kartana with a solid Special Defense donation. However, it is important to understand that Kartana does not work with every god, such as Kyogre and Ho-oh, as Kartana does not have much longevity. Offensive entry hazard setters such as Cloyster make great partners, as entry hazards help wear down Kartana’s checks. Kartana also compliments entry hazard setters well by removing Heavy-Duty Boots from walls, especially Ho-oh. Teammates such as Zygarde-10% who share common checks with Kartana are useful, as together they can slowly wear down their shared checks until one of them has an opportunity to sweep or pick up multiple KOs. Kartana also pairs well with powerful cleaners such as Bisharp inheriting Speed and Weavile inheriting Attack, as they excel at capitalizing off of Kartana's wallbreaking power. While Kartana has a good Speed tier, it is still outsped by common offensive Pokemon such as Tapu Koko and Pheromosa, making other fast Pokemon such as Mewtwo or Choice Scarf users such as Tapu Lele good teammates.</p> "
      },
      {
        "name": "Choice Scarf (Special Defense)",
        "description": "<p>With a Choice Scarf, Kartana becomes a deadly late-game cleaner and revenge killer. Thanks to its high Attack and good Speed tier, it is able to outspeed and threaten to KO the majority of the tier's offensive threats like Weavile and Zeraora. With its Special Defense patched up, it also is able to stomach weak hits in the process, such as Rotom-W's Volt Switch and Tapu Koko's Thunderbolt. Leaf Blade OHKOes common Pokemon like Zygarde-10%., while Smart Strike threatens Fairy-types such as Tapu Lele and Clefable. Knock Off hits Flying-type switch-ins like Corviknight and Ho-Oh, who resist Kartana's STAB moves, and Sacred Sword hits Steel- and Flying-type Pokemon neutral to Fighting such as Heatran and Yveltal. Defog is an option to allow Kartana to serve as an emergency entry hazard remover.</p> <p>Choice Scarf Kartana fits well on bulky offense and balance teams which appreciate its ability to outspeed and revenge kill common threats. It is often paired with offensive gods such as Yveltal and Rayquaza, but can work with many different gods. The exception to this is that some gods with very high Special Defense stats such as Ho-oh and Zamazenta-C would much rather donate their Special Defense to a defensive Pokemon. Magnezone is a great partner, as it is able to trap and remove Steel-types that Kartana has trouble breaking. Powerful wallbreakers such as Swords Dance Weavile are also good partners, as they are able to help weaken Kartana's checks like Corviknight, making it easier to sweep late-game. Special attackers like Kyurem-W and Nidoking are also great partners for Kartana, as they can pressure physical walls such as physically defensive Tangrowth. Teammates who can use Future Sight such as Slowking and Slowbro also pair well with Kartana, taking advantage of the fact that many of Kartana's checks, such as Landorus-T and Skarmory, have lower Special Defense.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Necrozma-Dusk-Mane": {
    "comments": "<h1>Other Options</h1> <p>Necrozma-DM can opt to run physically defensive set with a Rocky Helmet to more reliably wall physical threats like Rillaboom. Photon Geyser can be run over Earthquake on Necrozma-DM’s Dragon Dance set to target specific Pokemon like Nidoqueen, which threaten it with Ground-type moves, but is generally inferior to Earthquake’s coverage. Defensive sets can run Stealth Rock if their team lacks entry hazard setters, but being forced to give up one of its utility moves is usually not worth it.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Ground-types: Physically defensive Ground-types like Landorus-T can switch into Necrozma-DM and threaten it with Earthquake. However, they should be wary of Toxic.</p> <p><strong>Water-types: Bulky Water-types like Slowking, Slowbro, Tapu Fini, and Rotom-W can wall Necrozma-DM, Tapu Fini being notable for blocking Toxic and the rest for being able to burn it. However, Slowking and Slowbro must be wary of Knock Off, and Tapu Fini can be 2HKOed by a +1 Sunsteel Strike from offensive sets.</p> <p><strong>Steel-types: Steel-types like Skarmory, Corviknight, and Ferrothorn resist Sunsteel Strike and take insignificant amounts of damage from Necrozma-DM’s coverage. Skarmory and Corviknight can set up on defensive Necrozma-DM with Bulk Up and Iron Defense, and Ferrothorn can eternally outlast it with a combination of Leech Seed, Protect, and Leftovers.</p> <p><strong>Setup Sweepers: Powerful setup sweepers like Garchomp and Rayquaza can overwhelm even defensive Necrozma-DM with strong super effective moves, threatening all variants with a +2 Earthquake or a +1 V-create, respectively.</p> <p><strong>Ho-Oh: Ho-Oh resists Sunsteel Strike, is immune to Earthquake, and can hit back hard with Sacred Fire. However, Ho-Oh must fear heavy damage from Stone Edge from offensive sets.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Weakness Policy Necrozma-DM is a fearsome wallbreaker and mid- to late-game cleaner. Dragon Dance is an excellent tool to boost Necrozma-DM’s damage while also fixing its subpar Speed tier. Sunsteel Strike is a powerful STAB move that threatens most of the tier at +1. Necrozma-DM’s coverage options help break down common Pokemon that resist it, with Earthquake hitting Heatran and opposing Necrozma-DM and Stone Edge hitting Ho-Oh and Corviknight, which otherwise completely wall it. Prism Armor allows Necrozma-DM to shrug off super effective attacks and activate Weakness Policy more easily, putting it in a position to sweep.</p> <p>Necrozma-DM is best utilized on balance or bulky offense teams as a mid- or late-game cleaner, capable of shredding defensive cores after its checks have been removed. Necrozma-DM's solid defensive stats bolster teammates like Defensive Clefable and Assault Vest Tangrowth immensely, making for some very tough defensive cores. Many Pokemon such as Rillaboom, Victini, and Zeraora appreciate inheriting Necrozma-DM's high Attack stat and its ability to pressure common Pokemon such as Clefable. In turn, these Pokemon threaten the Water- and Steel-types that Necrozma-DM has trouble beating, such as Slowbro, Corviknight, and Skarmory. Necrozma-DM fears fast offensive Pokemon that carry super effective moves such as Rayquaza and Garchomp, whose sheer strength can overwhelm Necrozma-DM. Unaware users like Clefable are useful to ignore setup from these threats, and Pokemon with super effective priority such as Weavile can clean them up after chip.</p> "
      },
      {
        "name": "Specially Defensive",
        "description": "<p>Necrozma-DM's typing, bulk, and access to reliable recovery make it a great specially defensive wall. Sunsteel Strike lets Necrozma-DM still do respectable damage, and Knock Off is a handy utility move to punish common switch-ins like Ho-Oh and remove damage boosting items from wallbreakers. Toxic cripples defensive Pokemon like Rotom-W and Landorus-T, while Thunder Wave cripples switch-ins like Heatran. Earthquake provides good coverage to hit offensive switch-ins like Heatran, but generally isn’t as useful as spreading status. Morning Sun improves Necrozma-DM’s longevity greatly, but must be used sparingly, for it has very low PP. Leftovers is necessary to provide much needed passive recovery.</p> <p>Necrozma-DM can form well-rounded defensive cores with Pokemon such as Tangrowth and Buzzwole, who love to receive Necrozma-DM’s Special Defense stat. Both resist Ground, with the latter resisting Dark as well, which helps cover Necrozma-DM's weaknesses. Rotom-W and Necrozma-DM have good defensive synergy, with Rotom-W providing a resistance to Fire, an immunity to Ground, and sporting great bulk with an HP donation, while Necrozma-DM walls Grass-types such as Rillaboom, as it resists their STAB moves. Necrozma-DM is great at spreading status and removing items from switch-ins like Ho-Oh, which helps teammates that struggle with these threats pick up KOs on the weakened foes. Tapu Koko is a great Special Attack receiver to break past various Water-types that are not threatened by Necrozma-DM. Victini is a good choice to receive Attack and counter Steel-types such Skarmory and Corviknight, which wall Necrozma-DM and turn it into setup fodder, while also hitting Water-types with Bolt Strike.</p> "
      },
      {
        "name": "Bulky Booster",
        "description": "<p>This set combines Necrozma-DM's offensive and defensive utility to create something that can take a hit and hit back hard. Dragon Dance allows Necrozma-DM to become a threatening cleaner versus weakened teams, while Swords Dance is helpful to wallbreak early-game. Sunsteel Strike is an excellent STAB move with great power and good coverage. Knock Off has great neutral coverage with Sunsteel Strike and weakens its checks by removing their items, while Stone Edge hits Flying-types such as Ho-oh and Earthquake hits Steel-types such as Heatran. Morning Sun and Leftovers give Necrozma-DM respectable longevity, but Morning Sun must be rationed so its low PP doesn't run out. Maximum Attack and an Adamant nature maximize damage output while the Speed investment outspeeds base 100 Speed foes after a Dragon Dance.</p> <p>Pokemon such as Buzzwole and Tangrowth are excellent defensive presences if they receive Necrozma-DM's Special Defense stat, as they resist the Ground moves that threaten Necrozma-DM. Victini loves receiving Necrozma-DM's Attack stat and can threaten many Pokemon that Necrozma-DM can't beat like Ferrothorn and Skarmory. Entry hazard setters like Ferrothorn and Landorus-T help Necrozma-DM wear down its checks faster, with the latter being able to pivot it in with U-turn. This set struggles with Ground-types like Garchomp and Landorus-T, so teammates like Rotom-W, Landorus-T, and Skarmory are recommended. Skarmory and Ho-Oh are especially troublesome Pokemon for Necrozma-DM to face, as both resist Sunsteel Strike and wall sets that lack Stone Edge, so Electric-types like Tapu Koko and Zeraora that can handle these threats for Necrozma-DM, while also keeping up momentum with pivot moves, make great partners. Magnezone is also a valuable partner, as it traps and removes Skarmory and Corviknight.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 541143, "username": "senko"}, {"user_id": 584907, "username": "Wes8888"}]}
  },
  "Blacephalon": {
    "comments": "<h1>Other Options</h1> <p>Psyshock is an option on Choice Specs set to hit Gastrodon and Nihilego, but doesn't have much use otherwise. Rock Blast can lure and dent Ho-Oh, however Knock Off combined with Stealth Rock already prevents it from switching in multiple times. Even though Life Orb increases Blacephalon's damage output without locking it into a move, it reduces Blacephalon's already short longevity and thus should only be combined with Explosion to eliminate special walls.</p> <h1>Checks and Counters</h1> <p><strong>Tyranitar: Tyranitar resists both Blacephalon's STAB moves and can easily OHKO Blacephalon with its own STAB attack. However, its lack of a recovery option outside of Rest makes it prone to getting worn down by Toxic and Knock Off, especially in combination with entry hazards.</p> <p><strong>Specially Defensive Pokemon</strong>: Specially bulky Pokemon like Nihilego, Gastrodon, and Ho-Oh can take even Choice Specs-boosted hits from Blacephalon, and the latter two can heal off any damage dealt. They still hate receiving a Choice item, especially Ho-Oh if Stealth Rock is up.</p> <p><strong>Entry Hazards</strong>: Blacephalon's vulnerability to all entry hazards, especially Stealth Rock, means their presence makes it harder for it to repeatedly come in and wreak havoc.</p> <p><strong>Revenge Killers</strong>: Even when resisting most priority moves, Blacephalon's poor bulk makes it susceptible to being revenge killed by priority moves, such as Yveltal's Sucker Punch and Rillaboom's Grassy Glide, especially if it doesn't receive HP or Defense. If Blacephalon lacks a Speed donation, then faster Pokemon can also revenge kill it. Excadrill in sand and Choice Scarf Kartana both outspeed Choice Scarf Blacephalon. Bulky Pokemon that can take a hit like Kyogre and Kyurem-W also threatens to OHKO Blacephalon.</p> ",
    "sets": [
      {
        "name": "Choice Item Attacker (Speed, Defense, HP)",
        "description": "<p>Blacephalon is a fearsome late-game cleaner thanks to its high Special Attack and fantastic offensive typing. Blacephalon is also a serious threat to snowball the other team, as (in most cases) Beast Boost will raise its Special Attack after a KO, allowing it to blow through weakened teams. Shadow Ball is its primary attack, hitting most of the metagame at least neutrally. Fire Blast has high Base Power and can dent many Pokemon that can take Shadow Ball such as Tangrowth, Yveltal, and Zamazenta-C. Flamethrower is an alternative, trading raw power for more accuracy and PP. Trick allows Blacephalon to cripple specially defensive foes that it can't do much against otherwise, namely Gastrodon and Tyranitar. On the last moveslot, Knock Off disrupts the foe's item, and is particularly useful against Ho-Oh when Stealth Rock is up. Knock Off also comes in handy to remove Assault Vest from RegenVest Pokemon that might stomach its attacks and switch out with little HP lost otherwise, in particular Tangrowth and Galarian Slowbro. Toxic instead puts foes on a timer and forces them to use their recovery move more often. Overheat is an alternative that helps it revenge kill weakened offensive threats better. Choice Scarf is usually the go-to item to outspeed fast offensive threats like Tapu Koko and Mewtwo. If Blacephalon gets a Speed donation from Zamazenta or Pheromosa, Choice Specs is preferred, as Beast Boost will increase its Speed after a KO.</p> <p>Choice Item Blacephalon acts as a cleaner and revenge killer on offensive builds. A Speed donation from fast gods such as Mewtwo, Zamazenta-C, and Pheromosa helps it outpace fast offensive Pokemon such as Weavile and Kartana; however, a better Defense or HP stat can also help Blacephalon avoid a KO from priority moves such as Rillaboom's Grassy Glide. Groudon can provide sun, which further boosts Blacephalon's Fire attacks. Specially offensive Pokemon like Nidoking enjoy Blacephalon's ability to cripple special walls like Gastrodon and Ho-Oh without taking up the Special Attack slot. They can also weaken Blacephalon's checks and counters, allowing it to pick up a KO more easily and snowball. Physical threats such as Kartana and Zamazenta-C struggle against sturdy walls like Buzzwole and Skarmory, which Blacephalon can handle. Entry hazards greatly limit Blacephalon's ability to switch in multiple times, so teammates with entry hazard removal such as Landorus-T and Rotom-W are required. Blacephalon complements entry hazards well by removing Heavy-Duty Boots with Trick or Knock Off, which makes Ferrothorn and the aforementioned Nidoking great additions. Priority attacks like Yveltal's Sucker Punch and Rillaboom's Grassy Glide force Blacephalon out, so partners that can take them like Tapu Koko and Tornadus-T are appreciated. A counter to Tyranitar like Urshifu-R or Buzzwole is also necessary.</p> "
      },
      {
        "name": "Heavy-Duty Boots (Speed, Defense, HP)",
        "description": "<p>Heavy-Duty Boots Blacephalon is a very effective progress maker against bulkier teams that still possesses decent power. Shadow Ball is a reliable Ghost STAB attack that hits most Pokemon at least neutrally. Flamethrower is its secondary STAB move, dealing decent damage to Yveltal and Tangrowth. Fire Blast can be used instead, however its lower PP and accuracy are concerns when Blacephalon is often required to use it multiple times. Knock Off removes key items from common switch-ins, in particular Heavy-Duty Boots, Assault Vest, and Leftovers, to make them more vulnerable to chip damage. Toxic cripples Ho-Oh, Gastrodon, and Tyranitar, which otherwise can take Blacephalon's attacks with ease. Taunt prevents Clefable, which doesn't mind Toxic and loss of item, from using Soft-Boiled. Heavy-Duty Boots negates entry hazard damage that would quickly wear Blacephalon down.</p> <p>Heavy-Duty Boots Blacephalon's low defensive utility and capability to wallbreak short term means it should be built around as a secondary wincon. Zamazenta-C gives Blacephalon a much better Speed tier to threaten more offensive Pokemon out and thus opportunities to cripple switch-ins. It can also check two common priority users in Rillaboom and Yveltal. Pokemon who share checks with Blacephalon like Victini and Volcarona benefit from having opposing Ho-Oh and Gastrodon crippled. Bulky offensive threats such as Kyogre and Kyurem-W force it out, which makes it necessary to have a teammate that can handle their attacks like Tangrowth. Entry hazard support from Skarmory and Ferrothorn helps Blacephalon chip down opposing walls, especially with Knock Off to remove their Heavy-Duty Boots. Faster offensive Pokemon such as Zeraora and Pheromosa can OHKO Blacephalon, which can be taken care of by Clefable.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Zeraora": {
    "comments": "<h1>Other Options</h1> <p>A setup set with Bulk Up can be run to turn Zeraora into a sweeper without much offensive counterplay, but due to its limited coverage, most Ground-types stop it from making progress. A special set with Choice Specs can throw off checks like Hippowdon and Gastrodon, but its lack of coverage overall and utility without Knock Off makes it a worse wallbreaker than Choice Band. Other forms of coverage like Play Rough for Dragon-types like Garchomp and Dracozolt or Grass Knot for Ground-types like Hippowdon and Gastrodon can help beat out some of its most common checks. Taunt Zeraora with donated HP from Gods like Yveltal may be run to improve its longevity as a pivot, but it loses most of its offensive presence and doesn’t last as long without a form of reliable recovery.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Thanks to their immunity to Electric moves and high physical bulk, Ground-type Pokemon such as Hippowdon, Gastrodon, and Landorus-T can easily switch into Zeraora’s coverage and shut down any momentum by blocking Volt Switch. Knock Off can help chip these Pokemon down, but they are generally consistent switch-ins for most of the game.</p> <p><strong>Electric-types: Bulky Electric-types like Rotom-W and Rotom-H can check non-Choice Band Zeraora and cripple it with Will-O-Wisp, although Choice Band can 2HKO them with enough chip damage.</p> <p><strong>Grass-types: Grass-types like Ferrothorn, Tapu Bulu, Tangrowth, and Venusaur switch into Plasma Fists consistently and don't mind its other coverage. Ferrothorn, however, cannot switch into Close Combat from Choice Band, and Tangrowth and Tapu Bulu risk being crippled by Toxic.</p> <p><strong>Dragon-types: Dragon-types like Dialga, Zekrom, and Dracozolt resist Zeraora's Electric moves and don't fear its typical coverage options, making them consistent checks.</p> <p><strong>Faster Pokemon and Priority: Choice Scarf Pokemon like Tapu Lele and Pokemon with priority moves like Rillaboom can take advantage of Zeraora's poor bulk and threaten to OHKO it.</p> ",
    "sets": [
      {
        "name": "Choice Band (Attack)",
        "description": "<p>With one of the highest Speed stats in the game, Zeraora is both an excellent fast revenge killer and, with an Attack donation, a powerful wallbreaker. Plasma Fists allows Zeraora to threaten the prominent defensive Flying- and Water-types in the tier like Corviknight, Skarmory, Ho-Oh, Tapu Fini, and Slowking. It also hits most of the other common walls hard, breaking through Pokemon like Clefable and Heatran, as well as threatening to OHKO slower offensive Pokemon like Tapu Lele. Close Combat provides coverage for Pokemon that resist Plasma Fists like Ferrothorn and Excadrill, preventing them from switching in safely. Knock Off is an overall safe move that removes items from Zeraora’s switch-ins to limit their longevity, most notably Landorus-T and Rotom-H, who rely heavily on their items to consistently check it. Volt Switch creates momentum for the team and brings in a threat to Zeraora’s switch-ins.</p> <p>Zeraora fits best on fast-paced offensive teams with setup sweepers to take advantage of weakened defensive cores Zeraora creates. Most gods with high Attack like Rayquaza, Necrozma-DM, and Kyurem-B are great partners to donate Attack to Zeraora, allowing it to provide immediate wallbreaking power and setup opportunities for the gods. Other setup Pokemon like Garchomp and Weavile also appreciate the pressure Zeraora puts on bulky Water-types. Ground-types like Hippowdon, Gastrodon, and Landorus-T give Zeraora a hard time creating momentum with Volt Switch and can easily take its coverage moves, so Water-types like Rotom-W and Tapu Fini pair well. Dragon-types like Dialga, Zekrom, and Dracozolt prevent Zeraora from constantly using Plasma Fists, so Pokemon like Tapu Lele and Landorus-T support it well. Zeraora gets easily chipped down by entry hazards due to frequent pivoting, so hazard removers like Corviknight, Tapu Fini, and Excadrill are good partners. Entry hazard setters like Skarmory, Mew, and Ferrothorn help Zeraora wear down its checks and allow it to break more easily.</p> "
      },
      {
        "name": "Taunt Pivot (Attack)",
        "description": "<p>With its high Speed and threatening Electric moves, Zeraora pressures common Defoggers and generates momentum for the team. Taunt shuts down common Defoggers like Corviknight and Tapu Fini and prevents Pokemon like Clefable and Ferrothorn from setting entry hazards and healing. Volt Switch lets it keep up the pressure bringing in teammates consistently and has extra longevity due to Heavy-Duty Boots. Plasma Fists keeps Zeraora’s offensive presence and threatens prominent Water-type Pokemon like Tapu Fini and Slowking. Knock Off is useful for taking away Leftovers from its checks like Landorus-T, Gastrodon, and Ferrothorn, and improving the effectiveness of entry hazards by removing Heavy-Duty Boots off of Pokemon like Rotom-Heat, Slowbro, and Ho-Oh. Toxic gives Zeraora a way to punish its consistent checks like Landorus-T and Hippowdon.</p> <p>With immense pressure on Flying-types and Defoggers, Zeraora provides excellent support for entry hazard-stacking teams. Gods with high Attack like Rayquaza, Necrozma-DM, and Kyurem-B allow Zeraora to extert offensive pressure and appreciate its ability to control entry hazards. Spikers like Skarmory and Ferrothorn greatly appreciate Defog prevention and can easily set multiple layers of Spikes. Ground-types like Hippowdon and Landorus-T take very little damage from Zeraora’s attacks, so Water-types like Rotom-W and Tapu Fini are great partners to threaten them. Zeraora also relies much on Heavy-Duty Boots to stay healthy, so Pokemon like Skarmory and Clefable are great partners to switch into Knock Off without much drawback.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "Ducky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 541143, "username": "senko"}]}
  },
  "Corviknight": {"sets": [{"name": "Defog (SpD)"}, {"name": "Bulk Up (SpD)"}]},
  "Dracozolt": {"sets": [{"name": "Sand Rush (Atk)"}]},
  "Calyrex-Ice": {"sets": [{"name": "Substitute Leech Seed"}, {"name": "Choice Band"}, {"name": "Swords Dance"}]}
}