{
  "Arcanine": {
    "sets": [
      {
        "name": "Altarianite",
        "description": "<p>Arcanine stands out as an effective speed control in Mix and Mega due to its powerful form of priority, potent Fire / Fairy STAB combination, and access to Teleport. This Pokemon can perform a wide range of roles such as revenge killing, late-game sweeping, and slow pivot. Altarianite adds a secondary Fairy typing to Arcanine's Fire typing and allows it to fire off Fairy-type STAB Pixilate Extreme Speed, allowing Arcanine to outpace and deal with a large range of the offensive threats in Mix and Mega. Flare Blitz is Arcanine's secondary STAB option and gives it the ability to blow past Steel-types that resist Extreme Speed, such as Corviknight and Solgaleo. Morning Sun gives provides Arcanine with defensive utility and longevity throughout the game and works well with Arcanine's pre-Mega ability Intimidate to act as an emergency check to other Altarianite users like Dragonite. Teleport allows Arcanine to slow pivot out, which gives it a solid niche over other Extreme Speed users less able to make use of the switches they force.</p> <p>Arcanine struggles the most against some of the premier physical walls like Toxapex, Lunala, and Slowbro, so partners that can exploit these Pokemon like Lucarionite Zygarde, Spectrier, and Pheromosa are all good partners. Pheromosa is particularly useful here, as its access to U-turn allows it to keep up the momentum Arcanine wins with Teleport against most teams. In turn, Arcanine is one of the best offensive checks to other Altarianite users like Dragonite, and can bring these relatively fragile Pokemon in safely. Zeraora and Lucarionite Terrakion allow Arcanine to wear down and overwhelm shared physical checks like Slowbro and Lunala, who often prove incapable of staying healthy enough to answer all of them throughout the match. Ampharosite Blissey also pairs extremely well with Arcanine, as it can reliably set Stealth Rock to punish the switches Arcanine forces and can set Toxic on most of Arcanine's defensive checks. In turn, Arcanine serves as reliable speed control on the builds where Blissey fits best and is capable of stopping the threats that seek to exploit Blissey's added Dragon-typing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 331804, "username": "Gmansour20"}, {"user_id": 231402, "username": "xavgb"}]}], "writtenBy": [{"user_id": 257571, "username": "Andyboy"}]}
  },
  "Slowbro": {"sets": [{"name": "Sablenite Defensive Pivot"}]},
  "Zapdos": {"sets": [{"name": "Defensive Pivot"}, {"name": "Sablenite Bounce Pivot"}]},
  "Dragonite": {"sets": [{"name": "Altarianite Extreme Speed"}, {"name": "Salamencite Bulky Dragon Dance"}, {"name": "Altarianite Bulky Support"}]},
  "Mew": {"sets": [{"name": "Manectite Pivot"}]},
  "Blissey": {"sets": [{"name": "Ampharosite Utility"}, {"name": "Sablenite Defensive"}]},
  "Entei": {"sets": [{"name": "Pinsirite Extreme Speed"}, {"name": "Altarianite Extreme Speed"}]},
  "Ho-Oh": {"sets": [{"name": "Defensive"}]},
  "Milotic": {"sets": [{"name": "Sablenite Defensive"}]},
  "Groudon": {"sets": [{"name": "Bulky Swords Dance"}]},
  "Rhyperior": {"sets": [{"name": "Tyranitarite Defensive"}]},
  "Heatran": {"sets": [{"name": "Ampharosite Utility"}]},
  "Landorus-Therian": {"sets": [{"name": "Salamencite Utility"}]},
  "Kyurem": {"sets": [{"name": "Heracronite Sweeper"}]},
  "Zygarde": {"sets": [{"name": "Altarianite Extreme Speed"}, {"name": "Lucarionite Sweeper"}]},
  "Toxapex": {"sets": [{"name": "Banettite Physically Defensive"}, {"name": "Banettite Specially Defensive"}, {"name": "Gyaradosite Toxic Spikes"}]},
  "Tapu Lele": {"sets": [{"name": "Diancite Cleaner"}, {"name": "Lucarionite Wallbreaker"}]},
  "Solgaleo": {"sets": [{"name": "Metagrossite 3 Attacks"}, {"name": "Venusaurite Calm Mind"}]},
  "Lunala": {"sets": [{"name": "Power Herb Offensive"}]},
  "Magearna": {"sets": [{"name": "Manectite Pivot"}]},
  "Zeraora": {"sets": [{"name": "Pinsirite Bulk Up"}]},
  "Corviknight": {"sets": [{"name": "Sablenite Defog Pivot"}, {"name": "Venusaurite Pivot"}]},
  "Regieleki": {"sets": [{"name": "Regieleki Utility"}]},
  "Spectrier": {"sets": [{"name": "Lucarionite Wallbreaker"}]}
}