{
  "Arcanine": {
    "sets": {
      "Altarianite": {
        "description": "<p>Arcanine stands out as an effective speed control in Mix and Mega due to its powerful form of priority, potent Fire / Fairy STAB combination, and access to Teleport. This Pokemon can perform a wide range of roles such as revenge killing, late-game sweeping, and slow pivot. Altarianite adds a secondary Fairy typing to Arcanine's Fire typing and allows it to fire off Fairy-type STAB Pixilate Extreme Speed, allowing Arcanine to outpace and deal with a large range of the offensive threats in Mix and Mega. Flare Blitz is Arcanine's secondary STAB option and gives it the ability to blow past Steel-types that resist Extreme Speed, such as Corviknight and Solgaleo. Morning Sun gives provides Arcanine with defensive utility and longevity throughout the game and works well with Arcanine's pre-Mega ability Intimidate to act as an emergency check to other Altarianite users like Dragonite. Teleport allows Arcanine to slow pivot out, which gives it a solid niche over other Extreme Speed users less able to make use of the switches they force.</p> <p>Arcanine struggles the most against some of the premier physical walls like Toxapex, Lunala, and Slowbro, so partners that can exploit these Pokemon like Lucarionite Zygarde, Spectrier, and Pheromosa are all good partners. Pheromosa is particularly useful here, as its access to U-turn allows it to keep up the momentum Arcanine wins with Teleport against most teams. In turn, Arcanine is one of the best offensive checks to other Altarianite users like Dragonite, and can bring these relatively fragile Pokemon in safely. Zeraora and Lucarionite Terrakion allow Arcanine to wear down and overwhelm shared physical checks like Slowbro and Lunala, who often prove incapable of staying healthy enough to answer all of them throughout the match. Ampharosite Blissey also pairs extremely well with Arcanine, as it can reliably set Stealth Rock to punish the switches Arcanine forces and can set Toxic on most of Arcanine's defensive checks. In turn, Arcanine serves as reliable speed control on the builds where Blissey fits best and is capable of stopping the threats that seek to exploit Blissey's added Dragon-typing.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Andyboy", "user_id": 257571}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gman", "user_id": 331804}, {"username": "xavgb", "user_id": 231402}]}]}
  },
  "Slowbro": {"sets": {"Sablenite Defensive Pivot": {}}},
  "Zapdos": {"sets": {"Defensive Pivot": {}, "Sablenite Bounce Pivot": {}}},
  "Dragonite": {"sets": {"Altarianite Extreme Speed": {}, "Salamencite Bulky Dragon Dance": {}, "Altarianite Bulky Support": {}}},
  "Mew": {"sets": {"Manectite Pivot": {}}},
  "Blissey": {"sets": {"Ampharosite Utility": {}, "Sablenite Defensive": {}}},
  "Entei": {
    "sets": {
      "Altarianite Extreme Speed": {
        "description": "<p>Entei is a strong Altarianite Extreme Speed user, able to threaten various offensive Pokemon such as Zygarde and Regieleki. Double-Edge is Entei's main form of damage output, heavily damaging neutral targets such as Milotic and Slowbro, while Sacred Fire threatens Steel-types that otherwise resist Extreme Speed, such as Corviknight, Solgaleo, and Magearna. Howl can also be used over Double-Edge to boost Extreme Speed's power and let Entei function as an effective late-game sweeper. Stone Edge hits Flying-types such as Ho-Oh, as well as opposing Entei, who otherwise take very little damage from Entei's attacks. Double-Edge is usually preferred over Howl due to it being able to 2HKO Slowbro and Milotic. Inner Focus is used as the pre-Mega ability to avoid Attack drops from Intimidate before Entei Mega Evolves. Entei works well when paired with powerful wallbreakers such as Kartana and Xerneas, as it is very good at cleaning up weakened teams. Entei appreciates Stealth Rock support from Pokemon like Swampert to better wear down its checks. Swampert can also bring it in safely with Flip Turn. Entei also likes having entry hazard removers like Defog Landorus-T and Rapid Spin Regieleki to help mitigate its Stealth Rock weakness. Entei struggles to break Venusaurite Steel-types such as Solgaleo, so Magnezone pairs well with it to trap and remove them. Ground-types such as Landorus-T and Swampert can force Entei out with Earthquake, so strong Ice- and Grass-type Pokemon like Weavile and Kartana make good partners. Lucarionite Dragapult threatens Slowbro and helps wear down Milotic, making it a great partner for Entei. 80 EVs can be taken out of Speed and put into HP to slightly increase Entei's bulk white still outspeeding base 80 Speed Pokemon with a neutral nature.</p>"
      },
      "Pinsirite Extreme Speed": {}
    },
    "credits": {"writtenBy": [{"username": "Ducky", "user_id": 525446}], "teams": [{"name": "Quality checked by", "members": [{"username": "iapt", "user_id": 539897}, {"username": "hayedenn", "user_id": 484270}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Ho-Oh": {"sets": {"Defensive": {}}},
  "Milotic": {"sets": {"Sablenite Defensive": {}}},
  "Groudon": {"sets": {"Bulky Swords Dance": {}}},
  "Rhyperior": {
    "sets": {
      "Specially Defensive Stealth Rock": {
        "description": "<p>Tyranitarite Rhyperior is a great special tank and Stealth Rock setter that can defensively check common threats like Regieleki, Ho-Oh, Galarian Slowking, non-Grass Knot Magearna, and Zapdos. Thanks to Swords Dance, it can also threaten switch-ins like Slowbro and Manectite Mew. Rhyperior pairs well with Pokemon like Slowbro, as Rhyperior can safely switch into Zapdos and Regieleki, which Slowbro has a hard time against. Slowbro in return is able to switch into Milotic, Hippowdon, and Groudon and pivot out with Teleport, gaining momentum. Rhyperior is vulnerable to physical Fighting-, Grass-, and Steel-types such as Buzzwole, Kartana, and Solgaleo. Therefore, it pairs well with Manectite Mew and Zapdos, as well as Milotic and Magearna, which can pivot into these Pokemon and switch out with Volt Switch or Flip Turn. Rhyperior also appreciates offensive partners such as Altarianite Entei and Dragapult, which take advantage of Rhyperior wearing down bulky Water-types such as Milotic with its offensive pressure.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "zastra", "user_id": 558636}], "teams": [{"name": "Quality checked by", "members": [{"username": "iapt", "user_id": 539897}, {"username": "hayedenn", "user_id": 484270}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Heatran": {"sets": {"Ampharosite Utility": {}}},
  "Landorus-Therian": {"sets": {"Salamencite Utility": {}}},
  "Kyurem": {"sets": {"Heracronite Sweeper": {}}},
  "Zygarde": {"sets": {"Altarianite Extreme Speed": {}, "Lucarionite Sweeper": {}}},
  "Toxapex": {"sets": {"Banettite Physically Defensive": {}, "Banettite Specially Defensive": {}, "Gyaradosite Toxic Spikes": {}}},
  "Tapu Lele": {"sets": {"Diancite Cleaner": {}, "Lucarionite Wallbreaker": {}}},
  "Solgaleo": {"sets": {"Metagrossite 3 Attacks": {}, "Venusaurite Calm Mind": {}}},
  "Lunala": {"sets": {"Power Herb Offensive": {}}},
  "Magearna": {
    "sets": {
      "Manectite Pivot": {
        "description": "<p>Manectite Magearna is a top physically defensive pivot capable of blanket checking wallbreakers and sweepers like Regieleki, Tyranitar, and Mega Evolved Galarian Zapdos. Volt Switch allows Magearna to pivot while chipping Milotic, Slowbro, and Ho-Oh. Thunder Wave is an incredibly useful tool that debilitates fast threats like Barraskewda, Kartana, Xerneas, and Solgaleo, while Heal Bell can remove status conditions for its teammates. Ice Beam lets Magearna take Landorus-T and Pinsirite Hippowdon by surprise, at the cost of some utility. Pain Split gives Magearna much-needed recovery while being especially good against high-HP walls like Ho-Oh and Blissey, although Thunder Wave can be used instead. 152 Speed EVs allow Magearna to outpace Modest Lucarionite Magnezone, although a spread of 252 HP / 40 Def / 216 Spe and a Timid nature can be used to outspeed base 90s like Groudon. Slower wallbreakers like Lunala and Aerodactylite Buzzwole and Solgaleo love Magearna slowing faster threats like Dragapult, opposing Solgaleo, and Kartana, while frailer pivots like Barraskewda, Dragapult, and Zeraora like Volt Switch safely bringing them in to wallbreak. Galarian Zapdos pre-Mega Evolution, along with Lopunnite wallbreakers like Barraskewda and Zeraora, are immune to Magearna's Intimidate, so secondary physical answers like Slowbro, Hippowdon, and Landorus-T all make for good partners. Magearna often doesn't outright counter many Pokemon and gets worn down quickly, so said teammates also help it answer the metagame as a whole. Due to the slew of special attackers that threaten it like Heatran, Zapdos, and Lunala, specially defensive Pokemon like Ho-Oh and Blissey are necessary pairings.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Clas", "user_id": 545372}], "teams": [{"name": "Quality checked by", "members": [{"username": "iapt", "user_id": 539897}, {"username": "hayedenn", "user_id": 484270}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Zeraora": {"sets": {"Pinsirite Bulk Up": {}}},
  "Corviknight": {"sets": {"Sablenite Defog Pivot": {}, "Venusaurite Pivot": {}}},
  "Barraskewda": {"sets": {"Lopunnite Pivot": {}}},
  "Dragapult": {"sets": {"Lucarionite Pivot": {}}},
  "Regieleki": {"sets": {"Regieleki Utility": {}}},
  "Spectrier": {"sets": {"Lucarionite Wallbreaker": {}}}
}