{
  "Gengar": {
    "sets": [
      {
        "name": "Offensive Trapper",
        "description": "<p>Mega Gengar is a very potent pick in AG due to its ability to trap every Pokemon slower than it with careful predictions and force the opponent into using Dynamax in order to escape its clutches. Therefore, it is able to simultaneously fill the roles of offensive support, wallbreaker, stallbreaker, and revenge killer. Shadow Ball is its most consistent STAB move, having few resistances and allowing it to dispose of Pokemon it has successfully trapped. Encore is its main tool in order to put foes in a checkmate position, as Mega Gengar can utilize it to force Pokemon into using a non-damaging and non-phazing move such as Toxic, Defog, Stealth Rock, or Recover, thus creating free turns for itself that it can use to gradually damage and take out the trapped Pokemon. Encore's sheer presence also discourages the opponent from using status moves, in general, after Gengar has Mega Evolved, which Mega Gengar's team can take advantage of. However, keep in mind that Dynamax and Z-Moves bypass Encore. Substitute is mandatory in order to safely Mega Evolve against slower threats, escape Pursuit from Tyranitar, provide insurance against faster threats attempting to revenge kill Mega Gengar such as Zacian-C and Ditto, and most importantly, to secure itself against Max Moves should its target attempt to catch it off guard with Dynamax. Focus Blast along with Substitute drastically improves the matchup against Tyranitar, allowing Mega Gengar to discourage Tyranitar from switching in as well as trap it if it is slightly weakened. Sludge Wave may be run if trapping Tyranitar is not necessary, as it provides Mega Gengar with a more reliable move in order to take care of trapped Normal-types such as Smeargle, Chansey, and Arceus. It also enables Mega Gengar to trap Xerneas with a careful double switch. Nasty Plot is another option that turns Mega Gengar into a potent wincon and pairs nicely with the abundance of free turns it is able to provide itself with Encore. It also allows Mega Gengar to overwhelm targets trapped into a recovery move in a more reliable fashion than relying on Shadow Ball drops.</p> <p>Mega Gengar fits best on balance and bulky offensive teams that benefit from its trapping prowess and provide it with a sturdy defensive backbone. In a worst-case scenario, Mega Gengar always forces the opponent into sacrificing their Pokemon or using Dynamax, provided it has Mega Evolved and is brought in on a status move. Therefore, Pokemon that appreciate the opponent’s Dynamax gone, such as Xerneas, Yveltal, and Dragon Dance Zygarde-C, are extremely potent partners. Moreover, Mega Gengar can also remove their checks in Necrozma-DM, Ho-Oh, Tyranitar, and support Arceus formes. Mega Gengar cannot deal with faster Pokemon such as Zacian-C and Pokemon that have boosted their Speed such as Dragon Dance Mega Rayquaza and Ultra Necrozma. Therefore, Pokemon that can check these threats, such as Ditto, Necrozma-DM, and Primal Groudon for the former and defensive Zygarde-C and Lunala for the latter two, are very useful teammates. Mega Gengar also has an abysmal matchup against Yveltal. Thus, Tyranitar and specially defensive Ho-Oh are great teammates. Tyranitar is also capable of Pursuit trapping a transformed Ditto as well as Lunala, which Mega Gengar cannot trap. Furthermore, Mega Gengar heavily discourages entry hazard removal. Thus, harnessing this ability with an entry hazard-stacking core consisting of Ferrothorn and Necrozma-DM is a sensible choice.</p> "
      },
      {
        "name": "Utility Trapper",
        "description": "<p>Mega Gengar is also capable of running a utility set in order to trap Pokemon in a more secure fashion. Perish Song always allows Mega Gengar to remove its targets after three turns. This is particularly useful for trapping Normal-types such as Chansey and Arceus, sleeping Tyranitar, Primal Groudon, and Zygarde-C, and Pokemon forced into using their recovery move. Alternatively, Shadow Ball may be run in order to eliminate targets by means of direct damage instead. Destiny Bond is an option that always allows Mega Gengar to force a trade with slower foes, which is very useful if it isn’t needed anymore or direly needs remove a Pokemon for a teammate. It also works very well with Encore, as Pokemon that may attempt to escape Destiny Bond by using status moves are locked into them by Encore regardless. However, Dynamax ignores the effects of Destiny Bond, and phazing moves from the likes of Ho-Oh also shut down this strategy. Disable is another option that, in tandem with Substitute, allows Mega Gengar to more securely trap Pokemon that only have one way of harming it, such as Ferrothorn and certain Necrozma-DM, Ho-Oh, and support Arceus variants. In combination with Encore, it also lets Mega Gengar force the target into using Struggle. However, Pokemon with more than one attack, such as defensive Dragon Tail Zygarde-C and Brave Bird Ho-Oh, can simply alternate between them in order to avoid the effects of Disable. Moreover, Disable's effects are ignored by Dynamax and Z-Moves, and it also cannot prevent Mega Gengar from being phazed. The given EV spread optimizes Mega Gengar's Speed in order to quickly use Encore on as many targets as possible while improving its general bulk. A 252 SpA / 4 SpD / 252 Spe EV spread is to be run with Shadow Ball in order to maximize damage output.</p> <p>This Mega Gengar set also fits best on balance and bulky offensive teams that benefit from its ability to trap key Pokemon and provide it with a defensive backbone it can fall back on. Generally, it's safer to use Substitute first with this set after switching into a status move in order to scout for the target Dynamaxing immediately, should it predict Encore. Thanks to Destiny Bond or Disable, the opportunity to trap it won't be lost if it simply attacks without Dynamaxing instead. However, if running Disable over Destiny Bond, Mega Gengar should be more aggressive with using Encore first whenever it comes in on a status move from Pokemon with more than one attack, as otherwise, the opportunity to trap its target will be lost. This set always forces the opponent into sacrificing their Pokemon or using Dynamax at worst if Mega Gengar has Mega Evolved and is brought in on a status move. Thus, Pokemon that appreciate the opponent’s Dynamax gone, such as Xerneas, Yveltal, and Dragon Dance Zygarde-C, remain ideal partners. Mega Gengar still cannot deal with faster threats such as Zacian-C and Pokemon that have boosted their Speed such as Dragon Dance Mega Rayquaza and Ultra Necrozma. Therefore, Pokemon that can check these threats, such as Ditto, Necrozma-DM, and Primal Groudon for the former and defensive Zygarde-C and Lunala for the latter two, remain very useful teammates. Mega Gengar also has an abysmal matchup against Yveltal, which does not fear even Destiny Bond due to Dynamax blocking it. Thus, Tyranitar and specially defensive Ho-Oh continue to be great teammates. If running Perish Song, this set has a much easier time trapping defensive Pokemon such as Tyranitar, Zygarde-C, and Primal Groudon while they are asleep, as it can be hard switched into them on the turn after they use Rest and proceed to use Perish Song. Therefore, it is better tailored to status inducers such as Ho-Oh, defensive Necrozma-DM, and defensive Primal Kyogre, which often tend to force Rest on Mega Gengar's aforementioned targets.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}]}], "writtenBy": [{"user_id": 360582, "username": "Guard"}]}
  },
  "Chansey": {
    "sets": [
      {
        "name": "Wall Cleric",
        "description": "<p>Owing to its phenomenal health and Eviolite-boosted special bulk, Chansey is the premier special wall in the AG metagame checking the threatening special attackers in the tier, such as Xerneas, special sets of Yveltal, Primal Kyogre, Eternatus, and Calm Mind Arceus formes, by threatening them with Toxic or neutering their Special Attack boosts with Confide. Along with having spectacular special bulk, Chansey has access to an amazing ability in Natural Cure, allowing it to switch into any status move with impunity, and recovery in the form of Soft-Boiled, allowing it to regain health throughout the match. In addition, Chansey is capable of whittling down the health of the opponent’s Pokemon through Toxic, which also ensures that Toxic-susceptible wallbreakers such as Rayquaza, Yveltal and Primal Groudon cannot switch in without risking status. Heal Bell enables Chansey to support its team throughout the match by removing their status, greatly benefiting the bulkier teams on which it is often seen. Confide allows Chansey to stall out opposing special attackers that might otherwise boost past it, such as Calm Mind Primal Kyogre, Geomancy Xerneas, Calm Mind Arceus formes, and occasionally Yveltal and Eternatus. Seismic Toss can be run over either Toxic or Confide in order to reduce Chansey's weakness to Taunt and to chip Ferrothorn and Necrozma-DM. It is, however, generally inadvised, as forgoing Toxic prevents Chansey from effectively checking special attackers with recovery, while running Seismic Toss over Confide renders Chansey setup bait for Pokemon that can boost their special attack and are not crippled by Toxic, notably Calm Mind + Refresh Arceus formes and Rest Primal Kyogre. Chansey's extreme passivity also makes it easily trapped by Pokemon such as Gothitelle and Mega Gengar. In addition, its inability to damage Steel-types or bypass Substitute renders it setup bait for Pokemon such as Zacian-C, Necrozma-DM, and Zygarde-C. Chansey’s pitiful physical bulk makes it vulnerable to any physical moves from even defensive Pokemon. Chansey also suffers greatly from having its Eviolite removed through Knock Off and being afflicted with the occasional Taunt from Yveltal.</p> <p>Chansey is extremely passive, and so it most commonly sees use on stall or bulky balance teams. Chansey partners especially well with Lugia and Necrozma-DM, which can fend off many physical attackers. Chansey also partners well with Pokemon such as support Arceus formes and Rest users such as Primal Groudon or Zygarde-C, which can help fight off threats such as Zacian, Mega Rayquaza, and Dragon Dance Zygarde. Chansey is also useful in removing crippling status such as burn or paralysis from sweepers, making it a strong pick on semi-stall teams that appreciate cleric support.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 374620, "username": "pichus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  },
  "Ditto": {
    "sets": [
      {
        "name": "Revenge Killer",
        "description": "<p>Equipped with a Choice Scarf, Ditto is always able to outspeed any foe that it has copied unless they also hold a Choice Scarf or Ditto is undergoing Dynamax. Its ability Imposter is the reason it excels as a revenge killer. By causing it to copy all of the opponent's stats except HP, it is able to beat most sweepers such as Zacian-C, Mega Rayquaza, and non-Dynamaxed Xerneas by always hitting them first with boosted moves thanks to its Choice Scarf. A Relaxed nature, 0 Speed IVs, and maximum Defense investment are used in case Ditto is the last remaining Pokemon against another Ditto: it reduces the damage taken from Struggle and makes it as slow as possible, so that it uses Struggle last due to not copying the opposing Ditto first and therefore having more Transform PP. 248 HP EVs ensure it does not faint after four Struggles. The IV spread is optimal to have Hidden Power Fire when copying Xerneas, allowing it to potentially countersweep the opposing team with Dynamax, while maximizing the damage output of Struggle.</p> <p>Ditto is one of the the best revenge killers in AG. It can make great use of Dynamax, which lets it snowball on the opposing team after having copied a boosted sweeper like Xerneas, Necrozma-DM, or Mewtwo. It is ideally sent out on the field after a teammate has fainted: Ditto can then revenge kill the foe or, if the opportunity allows it to, Dynamax to break its Choice lock and blow through the opponent's team thanks to augmented moves and doubled HP. Once its Dynamax is over, it can potentially continue to sweep with its Choice Scarf. It can also immediately copy Zacian-C and get an extra boost from Intrepid Sword that lets it break past traditional counterplay to Zacian-C such as defensive Necrozma-DM and Primal Groudon with Close Combat. Ditto is self-sufficient and fits on every playstyle, but it is typically of great value on balance teams that would otherwise be overwhelmed by the myriad of sweepers that can resort to Dynamax to bypass defensive and offensive counterplay alike. Since several Pokemon are self-Imposter-proof at varying levels, counterplay to those is highly recommended. Yveltal cannot be beaten with Ditto during any of the three Dynamax turns because it has a higher HP stat and a Life Orb, and even afterwards, Ditto can't revenge kill it without Dynamax unless Yveltal is seriously worn down, so having Tyranitar, Protect Ho-Oh, or Xerneas as a partner helps Ditto a lot. Xerneas also needs to be seriously weakened or unable to Dynamax before attempting to revenge kill it with Ditto; thus, Ho-Oh and Necrozma-DM make for good partners by forcing Xerneas to Dynamax and wasting two turns of it without much trouble. Entry hazard removal is also recommended because Ditto likes to be healthy to repeatedly check threats, so pairing it with Ho-Oh is a good idea. Ditto can struggle against defensive teams with Pokemon like Zygarde-C, Necrozma-DM, and Ho-Oh that it can do little to, so it pairs well with Pokemon like Mega Gengar and Eternatus. They provide a way to remove passive foes, while Ditto is able to check offensive threats such as Zacian-C for them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}]}], "writtenBy": [{"user_id": 286018, "username": "Ktütverde"}]}
  },
  "Mewtwo": {
    "sets": [
      {
        "name": "Nasty Plot Sweeper",
        "description": "<p>Mega Mewtwo Y is a powerful non-Dynamax sweeper capable of ripping through bulkier teams with ease owing to its extensive movepool and phenomenal offensive presence. Furthermore, a blistering Speed tier allows Mega Mewtwo Y to naturally outpace offensive staples such as Adamant Zacian-C, Jolly Ultra Necrozma and Arceus forms, and regular Mewtwo. Another advantage of using Mega Mewtwo Y is that it is Imposter-proof by default. Ditto is incapable of OHKOing Mega Mewtwo Y, while it has a good chance to OHKO Ditto. Additonally, because Mega Mewtwo Y is a Mega Evolution, Ditto transformed into it are incapable of Dynamaxing to break the Choice lock, and, as such, are fairly easy to check. Psystrike is Mega Mewtwo Y's STAB option, allowing it to break through common special walls such as Chansey and Ho-Oh. Ice Beam allows Mega Mewtwo Y to OHKO Zygarde-C without boosts and deal heavy damage to Yveltal. Fire Blast lets Mega Mewtwo Y OHKO Necrozma-DM after a boost and break through Ferrothorn without a boost. Fire Blast also lets Mega Mewtwo Y revenge kill Adamant Zacian-C after minimal chip damage and OHKO it after one boost. Focus Blast is an option to OHKO Tyranitar after a boost, but can be a costly choice against Yveltal. Unnerve is the preferred ability to situationally ignore Occa Berry users such as Necrozma-DM and Magearna as well as Chople Berry Tyranitar if running Focus Blast. The given EV spread allows Mega Mewtwo Y to outspeed Adamant Zacian-C and survive Precipice Blades from defensive Primal Groudon after Stealth Rock damage.</p> <p>Mega Mewtwo Y fits best on balance teams that can provide it with defensive and offensive support to either break holes early-game or clean up late-game. Mega Mewtwo Y is a nuclear wallbreaker and so oftentimes forces the opponent's Dynamax. Therefore, Dynamax sweepers that can run through the opponent once they have expended Dynamax, such as Xerneas, Yveltal, and Zygarde-C, make good teammates. Mega Mewtwo Y can struggle to find setup opportunities against more offensively oriented teams, limiting it to revenge killing In particular, it is forced out by priority users such as Mega Rayquaza and Arceus forms. Teammates that can check these threats, such as defensive Zygarde-C and Lunala, are particularly important. Additionally, due to its weakness to Ditto once it has taken chip damage, ideal teammates for Mega Mewtwo Y are Pokemon that can easily beat a Ditto that has transformed into it, such as Necrozma-DM, Ho-Oh, Lunala, and Tyranitar. Tyranitar in particular is a key partner, as it checks Yveltal and can Pursuit trap a Ditto transformed into Mega Mewtwo Y while eliminating Lunala, one of the best counters to Mega Mewtwo Y. Owing to Mega Mewtwo Y’s inability to break through Tyranitar, teammates that can effectively take advantage of Tyranitar, such as Zygarde-C and Necrozma-DM, are also effective. Other good teammates for Mega Mewtwo Y are those that can take advantage of its ability to heavily pressure special walls, like Yveltal, Choice Scarf Kyogre, and Xerneas.</p> "
      },
      {
        "name": "Nasty Plot (Dynamax Sweeper)",
        "description": "<p>Mewtwo distinguishes itself from other specially-oriented Dynamax users such as Yveltal and Xerneas with a great initial Speed tier that allows it to outspeed or Speed tie with almost the entire unboosted metagame barring Zacian-C as well as access to both a setup move and a damage-boosting item, which makes it extremely hard to stop at +2. Psystrike serves as the obligatory STAB move, becoming Max Mindstorm under Dynamax and setting Psychic Terrain with the first use, which boosts the move's power even further while also preventing priority from the likes of Mega Rayquaza, Yveltal, and Marshadow. Psystrike also hits specially defensive Pokemon such as Primal Kyogre, Ho-Oh, and the occasional Chansey on their lower Defense, allowing Mewtwo to easily break through them without having to Dynamax. Fire Blast provides the best possible coverage alongside Psystrike, hitting almost the entire metagame for at least neutral damage in conjunction with it, and at +2, Fire Blast OHKOes almost all Pokemon that would take a Psystrike, including Necrozma-DM, Ferrothorn, and Zacian-C. +2 Max Flare notably OHKOes specially defensive Necrozma-DM as well as Yveltal and, in the sun, even Ultra Necrozma from full health and Dynamaxed Yveltal after Stealth Rock damage. Hurricane, while almost completely useless outside of Dynamax, lets Mewtwo boost its Speed via Max Airstream in order to outspeed Zacian-C as well as every relevant Choice Scarf user in the metagame barring Ditto, reducing Mewtwo's reliance on team support to overcome such threats at the cost of forcing Mewtwo into an awkward two-turn setup situation to sweep if they are still present. Taunt trades the flexibility bestowed by Max Airstream in order to allow Mewtwo to act as a much more reliable stallbreaker, while also increasing the general reliability of its setup by blocking harmful status moves and stopping Defog, notably letting it shut down Pokemon such as defensive Zygarde-C and Lugia. Shadow Ball is Mewtwo's only option to OHKO Lunala through Shadow Shield at +2, and it reliably OHKOes Ultra Necrozma regardless of forme and 2HKOes Multiscale Lugia, but it also causes Mewtwo to instantly lose to Ditto. Focus Blast can allow Mewtwo to bypass Tyranitar, which otherwise counters Mewtwo. Life Orb in conjunction with 252 Special Attack EVs gives Mewtwo the maximum power possible behind its attacks, giving it a good chance to OHKO Ho-Oh and specially defensive Necrozma-DM at +2. A Timid nature paired with full Speed investment lets Mewtwo outspeed important threats in Mega Rayquaza and Arceus formes and also lets Mewtwo Speed tie with Mega Gengar and Eternatus. Unnerve can be sometimes useful in rare matchups involving Pokemon that may run weakness-reducing berries, such as Chople Berry Tyranitar if running Focus Blast.</p> <p>In contrast to its main competition in Yveltal and Xerneas, Mewtwo has noticeably lacking bulk and does not possess an even remotely useful defensive typing. This significantly hinders its setup opportunities, especially against teams running Zacian-C, to the point where setting up Nasty Plot can involve serious mind games; if Zacian-C switches into Mewtwo as it sets up Nasty Plot, it can simply outspeed Mewtwo and OHKO it with Behemoth Blade, and Mewtwo's only defense against this is that Fire Blast OHKOes Zacian-C on the switch. Forgoing the Special Attack boost to immediately boost with Max Airstream is very often infeasible unless the opposing team is already worn down, and Yveltal can sweep in this manner a lot more effectively than Mewtwo. That being said, Mewtwo is a great pick for Sticky Web teams; the entry hazard allows Mewtwo to naturally outspeed Zacian-C and avoid Speed ties with other base 130 Speed Pokemon such as Eternatus and Mega Gengar without being forced to run Hurricane, giving it significantly more flexibility in its fourth moveslot. Smeargle is thus a reasonable partner, offering support with Sticky Web and potential status on foes. However, Mewtwo can still work on balance-oriented teams, as it appreciates such teams' ability to deal with Mewtwo's various stops. On these teams, Tyranitar is a great partner, checking Yveltal, potentially Pursuit trapping Lunala and Lugia to break Shadow Shield or Multiscale, and offering countermeasures against Ditto and Yveltal. Because Mewtwo appreciates Stealth Rock on the field to hit certain critical KO benchmarks, setters such as Primal Groudon, Necrozma-DM, and the aforementioned Tyranitar pair well. Primal Groudon, in particular, can help against Tyranitar and Necrozma-DM. Ferrothorn can also offer Spikes support and take advantage of these Pokemon. Zacian-C with Crunch can do away with Lunala and pressure Necrozma-DM for Mewtwo. Ditto is a great partner that can handle Zacian-C and boosted threats that outspeed Mewtwo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 262044, "username": "chlo"}, {"user_id": 464176, "username": "Icemaster"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 426798, "username": "Geysers"}]}
  },
  "Quagsire": {
    "sets": [
      {
        "name": "Unaware Wall",
        "description": "<p>Owing to its invaluable ability Unaware and its stellar defensive typing, Quagsire is the most reliable Zacian-C check in the game, as well as being adept at checking Necrozma-DM and Swords Dance Arceus formes and capable of taking on Dragon Tail Zygarde-C. Earthquake allows Quagsire to defeat Zacian-C, 2HKOing it while also damaging Primal Groudon and Necrozma-DM. Scald can be used over Earthquake for a chance to permanently cripple the aforementioned threats barring Primal Groudon, but it is less effective at forcing them out. Haze prevents Necrozma-DM from setting up on Quagsire and breaking through it with Sunsteel Strike while also providing a win condition versus Baton Pass teams and preventing Zygarde-C from freely setting up. Toxic allows Quagsire to cripple switch-ins such as Ho-Oh and support Arceus formes while chipping away at offensive Pokemon such as Mega Rayquaza, Xerneas, and Yveltal that may try to take advantage of Quagsire's passive nature. Leftovers provides passive recovery and is important to help prevent Play Rough or Close Combat Zacian-C from breaking through Quagsire, which it can with minimal chip. Shed Shell on the other hand eases the matchup versus Mega Gengar and Gothitelle, but in general the stall teams Quagsire features on cannot handle these threats regardless.</p> <p>Quagsire fits best on stall teams that in particular require an extremely reliable Zacian-C switch-ins. Due to Quagsire's low overall bulk, it is vulnerable to many wallbreakers. Lugia and support Arceus formes are good partners in order to help combat physical wallbreakers such as Primal Groudon, Mega Rayquaza,and Ultra Necrozma, whereas Chansey can check special ones such as Yveltal, Xerneas, Primal, Kyogre, Calm Mind Arceus formes, and Eternatus. Tyranitar is also a good partner, as it aids in checking Yveltal and Eternatus while potentially trapping Mega Gengar. Cleric support from the aformentioned Chansey and Diancie is also vital, as with just small amounts of chip damage, Zacian-C can break through Quagsire. Entry hazard removal is especially important, as Quagsire must be able to switch into Zacian-C reliably, and so Defoggers such as Ho-Oh, support Arceus formes, and Giratina are vital, and Magic Bounce users such as Mega Diancie and Mega Sableye are especially helpful for also countering Ferrothorn, which otherwise takes advantage of Quagsire.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 36058, "username": "Guard"}, {"user_id": 374620, "username": "pichus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 464176, "username": "Icemaster"}]}
  },
  "Tyranitar": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Tyranitar's great bulk and unique defensive typing let it check a bunch of scary threats such as Yveltal, Ho-Oh, Mega Gengar, Eternatus, and Mewtwo. Pursuit allows Tyranitar to trap Pokemon that it forces out, such as Mega Gengar, Mewtwo, and Choice item variants of Mega Rayquaza, as well as break Lunala's Shadow Shield if it tries to switch out. A Rock-type move is recommended in order to check Yveltal properly and to force out Ho-Oh; Rock Tomb is chosen for its Speed-lowering effect, which neutralizes Max Airstream users like Yveltal, Mewtwo, and Thundurus-T and preserves momentum against faster threats like Zacian-C and Eternatus. Foul Play deals major damage to Zacian-C and offensive Primal Kyogre, deterring them from switching in freely, as well as threats Tyranitar is supposed to check like Mega Gengar, Mewtwo, and, if running Shuca Berry, Mega Rayquaza and Ultra Necrozma. Alternatively, Stealth Rock is a decent option due to Tyranitar's good matchup against common Defoggers like Ho-Oh and Lunala. Rest gives Tyranitar a source of recovery and lets it shrug off status ailments like Toxic poison from Ho-Oh, Eternatus, and Lunala. Roar allows Tyranitar to phaze non-Dynamaxed setup sweepers like Vivillon, prevents Geomancy Xerneas from setting up on it, and racks up entry hazard damage. Leftovers reduces the need for Tyranitar to use Rest by giving it passive recovery, which is helpful because it's very prone to chip damage from entry hazards and status ailments. Alternatively, Tyranitarite is a decent option if none of Tyranitar's teammates are using a Mega Stone, as it gives Tyranitar significantly more bulk and power at the cost of being unable to Dynamax. Chople Berry reduces the damage taken from Fighting-type attacks such as Focus Blast from Mega Gengar and Yveltal. Shuca Berry allows Tyranitar to survive a boosted hit from physical attackers such as Mega Rayquaza, Ultra Necrozma, and Extreme Killer Arceus; this item should be used alongside Foul Play. The EV spread maximizes special bulk for threats such as Yveltal, Mega Gengar, and Eternatus. Shuca Berry can optionally be used with a physically defensive spread to take on the aforementioned physical attackers better.</p> <p>Tyranitar is a good fit on balanced teams that can accommodate its many weaknesses. Defensive Necrozma-DM is an excellent partner, as it is able to handle Zacian-C and check Xerneas, and it appreciates Tyranitar's ability to deal with Yveltal, Ho-Oh, and Eternatus in return. Note that sand limits Morning Sun's recovery, however. Arceus-Ground is able to check Primal Groudon and Zygarde-C well, while Tyranitar can deal with Ho-Oh and Yveltal. Ferrothorn and Primal Groudon are able to check Primal Kyogre; Ferrothorn in particular provides Spikes support, allowing Tyranitar to rack up more damage on the opposing team with Roar, and can use Knock Off on Ho-Oh, letting Tyranitar pressure said foe with Stealth Rock. Primal Groudon can run Stealth Rock, freeing up a moveslot on Tyranitar. Ditto is a great partner that makes up for Tyranitar's lackluster matchup versus offense, while wallbreakers such as Xerneas, Yveltal, Zacian-C, and Primal Kyogre can help to pressure bulky teams that Tyranitar struggles to dent.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 374620, "username": "pichus"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": []}
  },
  "Lugia": {
    "sets": [
      {
        "name": "Defensive Wall",
        "description": "<p>Owing to Lugia's high natural bulk, decent defensive typing, and invaluable ability in Multiscale, it serves as a potent blanket check and emergency switchin to some of AG's most potent threats, including Mega Rayquaza, Zacian-C, and Ultra Necrozma. Access to valuable support moves such as Whirlwind and Toxic and Thunder Wave allows it to accrue chip damage or cripple the aforementioned threats, allowing them to be more easily handled. Roost is chosen over Recover in order to have a better matchup against Swords Dance Primal Groudon and a paralyzed Zacian-C by negating super effective damage from their coverage moves and Wild Charge. Whirlwind is vital in shutting down setup sweepers such as Swords Dance Primal Groudon, Mega Rayquaza, Zacian-C, Xerneas, and Swords Dance Arceus formes, which may take advantage of Lugia's relative passiveness, while also allowing Lugia to rack up chip damage alongside entry hazards. However, it cannot be relied on to phaze some threats such as Dragon Tail Zygarde-C and Dynamax users. Thunder Wave allows Lugia to outspeed offensive threats and freely use Roost on them in order to have Multiscale up versus their attacks, making them much easier to deal with. In particular, it punishes Zacian-C, Mega Rayquaza, and Eternatus. Toxic allows Lugia to cripple switch-ins such as Ho-Oh and Yveltal while chipping away at offensive Pokemon such as Mega Rayquaza and Primal Groudon. Psychic, and Ice Beam to a lesser extent, are options in order to prevent Lugia from being trapped and removed by Mega Gengar; Ice Beam can also deter Dragon Tail Zygarde-C from setting up and damage Mega Rayquaza and Yveltal, although it is relatively weak. Multiscale is what enables Lugia to switch-in reliably to threats such as Mega Rayquaza, and so keeping it intact by preventing Lugia from being statused and keeping it at full HP is vital. Hence, a variant of this set with Leftovers and with Substitute over Thunder Wave can be run, which notably allows Lugia to defeat Dragon Tail Zygarde-C. Opting for this variant, however, mandates a great deal of entry hazard removal for Multiscale to function, and this set is also more prone to being trapped by Mega Gengar.</p> <p>Lugia is very passive and so fits mainly on fatter balance teams and stall teams. Dragon Tail Zygarde-C can heavily take advantage of non-Substitute Lugia, as it is faster than Lugia. Therefore, strong Zygarde-C checks such as Ice Beam or Perish Song support Arceus forms work well with it. Yveltal also massively threatens Lugia and can only be statused in return. Strong Yveltal switch-ins such as Diancie, Chansey, Tyranitar or Ho-Oh to an extent can help mitigate this. Tyranitar also provides Pursuit support in order to combat Mega Gengar and Lunala, which dispose of non-Psychic sets, but Tyranitar must be used carefully, as its ability can break Multiscale. Additionally, Lugia cannot handle being statused and so is forced out by bulky status users such as Ho-Oh, Eternatus and Necrozma-DM, making status absorbers such as Necrozma-DM and Ho-Oh and Rest users such as Zygarde-C, Giratina, and Primal Groudon are good partners. Clerics such as Chansey, Diancie, and Xerneas significantly assist Lugia in this regard as well, in the case it does get statused. Stealth Rock is useful in order to rack up chip damage with Whirlwind; often a key way for stall teams to damage the opposing team's wallbreakers; and so the aforementioned Necrozma-DM, Primal Groudon, and support Arceus forms pair well with it as well as Spikes Ferrothorn. If a Leftovers + Substitute set is opted for, reliable Defoggers such as Ho-Oh and support Arceus forms as well as Magic Bounce users such as Mega Diancie and Mega Sableye are recommended. Gothitelle is a major vulnerability for Lugia and the stall style builds it features on, and it is not possible to patch up this weakness.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 374620, "username": "pichus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 464176, "username": "Icemaster"}]}
  },
  "Ho-Oh": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Thanks to Heavy-Duty Boots, Ho-Oh has established itself as a staple of the AG metagame. An immunity to Stealth Rock granted by this item allows it to make full use of its fantastic ability, Regenerator, to switch into a large portion of the metagame. Ho-Oh is very effective at assisting its teammates when coupled with its solid array of support moves. Sacred Fire is an excellent STAB move due to having a high chance of inflicting a burn. Along with Toxic, this prevents a large part of the metagame from using Ho-Oh's presence as an opportunity to switch in. However, this excludes status absorbers like Eternatus, Rest variants of Tyranitar, Zygarde-C, Primal Kyogre, and Refresh Arceus formes. Defog is an excellent choice on Ho-Oh due to its ability to indefinitely switch in and out with no fear of entry hazards, provided its item has not been removed. Ho-Oh also naturally forces out premier entry hazard setters in Ferrothorn and, to a lesser extent, Necrozma-DM, although it should watch out for Knock Off from both of them. Whirlwind racks up entry hazard damage and phazes Pokemon that would otherwise take advantage of Ho-Oh's reliance on spreading status to beat foes. Such Pokemon include Eternatus, Calm Mind Arceus formes, non-Dynamaxed Xerneas, non-Dragon Tail Zygarde-C, and sleep inducers like Smeargle and Vivillon. Protect facilitates stalling out the Dynamax turns of Pokemon like Yveltal and Xerneas, Toxic damage, and low PP moves such as Stone Edge and Dynamax Cannon. It also allows Ho-Oh to scout Choice item users. Brave Bird can be used as a spammable STAB move that hits Pokemon like Primal Groudon, Mega Rayquaza, and Primal Kyogre for immediate damage. 52 Special Defense EVs guarantee that Ho-Oh is never OHKOed by +2 Thunder from non-Dynamaxed Xerneas. The remaining EVs are used to maximize Ho-Oh's physical bulk, ensuring that it lives one hit from Zacian-C and any Mega Rayquaza variant at full HP and can punish these foes if they try to set up on it. The bulk can also be useful for pivoting into physical attackers like Choice item Mega Rayquaza and a Ditto that has copied Zacian-C; notably, Ho-Oh narrowly avoids the 2HKO from +2 Behemoth Blade. If Ho-Oh is running Brave Bird, 16 Speed EVs should be run to outspeed Adamant Mega Rayquaza after using Max Airstream once and Jolly Zacian-C after using it twice. A specially defensive EV spread of 248 HP / 8 Def / 252 SpD with a Careful nature can be run alongside Protect to pivot into Yveltal and Xerneas and stall out their Dynamax turns more effectively. However, both of these Pokemon can still OHKO Ho-Oh with Rock Slide or +2 Max Lightning, respectively, and it will have a much worse matchup against the aforementioned physical attackers.</p> <p>Ho-Oh fits best on balance teams in need of a pivot, entry hazard remover, and phazer. Use it as a universal pivot, since it is able to switch into almost every Pokemon that can't hit it super effectively. However, make sure to replenish its health through constant pivoting after tanking a powerful hit, such as Life Orb Mega Rayquaza's Dragon Ascent or Dynamaxed Yveltal's Max Darkness. Ho-Oh must also be wary of powerful Rock-type coverage moves, such as Stone Edge from Primal Groudon, Necrozma-DM, and Ultra Necrozma and Rock Slide from Yveltal. Getting hit by Knock Off severely limits Ho-Oh's effectiveness if the opponent's Stealth Rock setter beats Ho-Oh, so don't recklessly switch it into Pokemon such as Necrozma-DM and Ferrothorn that may carry this move. Also, try not to let Ho-Oh get poisoned unless it gives you an opportunity to reciprocate by burning or poisoning the foe. Common scenarios include two Ho-Oh trading Toxic and Necrozma-DM using Toxic against a Ho-Oh using Sacred Fire. Ho-Oh also offers some help with wasting the opponent's Dynamax turns by switching into powerful Dynamaxed moves, using Protect, and then pivoting out into a teammate. Ho-Oh should be paired with sturdy physical walls in order to take on physical attackers like Primal Groudon, Mega Rayquaza, and Zacian-C that threaten it. Arceus-Ground, Arceus-Water, and defensive Zygarde-C are good checks to the former two, whereas defensive Necrozma-DM can switch into the latter two. Primal Kyogre also greatly threatens Ho-Oh and can even switch in for free if it's running Rest and Ho-Oh lacks Brave Bird. Thus, Primal Groudon, Ferrothorn, and defensive Eternatus make for good teammates. Wallbreakers such as Yveltal, Xerneas, Zacian-C, and Eternatus can threaten defensive teams that Ho-Oh struggles with, and the latter two appreciate Ho-Oh covering their weaknesses. Pairing Ho-Oh with Primal Groudon or defensive Necrozma-DM is an excellent way to Imposter-proof your team if you are using Zacian-C. This is because Ho-Oh can only be taken out by Ditto's Wild Charge from full HP, whereas the other two only fear Ditto's Close Combat, and Assurance if entry hazards are up, if healthy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 286018, "username": "Ktütverde"}]}
  },
  "Shedinja": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Shedinja carves out a niche in AG thanks to its ability to completely wall anything that isn’t carrying coverage that can damage it or damaging status moves, countering dangerous threats such as Primal Kyogre, Substitute Xerneas, and, most notably Zygarde-C. Baton Pass allows Shedinja to take advantage of its ability to force switches by slow pivoting out, giving a free switch in to a teammate with a favorable matchup and escaping potential Tyranitar switch-ins that would instantly KO Shedinja with sand damage. Toxic enables Shedinja to cripple most switch-ins such as Yveltal and Primal Groudon. Due to its high PP, Shadow Sneak lets Shedinja whittle down and PP stall Pokemon that choose to stay in against it, such as Substitute Zygarde-C and Xerneas. In addition, Shadow Sneak lets Shedinja pick off weakened Pokemon that could possibly have a tool to OHKO it. Will-O-Wisp allows Shedinja to heavily punish physical switch-ins like Necrozma-DM and Zacian-C. Alternatively, Protect may be run over Will-O-Wisp to scout for potentially harmful moves on Pokemon that Shedinja would otherwise counter, such as Crunch or Assurance on Zacian-C and Toxic on Primal Kyogre. Heavy-Duty Boots allow Shedinja to safely come in on threats throughout the battle regardless of entry hazards. Safety Goggles can also be run, forgoing immunity to hazards for an immunity to sand, which is required if Tyranitar is being used alongside Shedinja. This dramatically reduces Shedinja’s opportunities to come in, however, and necessitates that it is paired with multiple extremely reliable Defoggers, such as Ho-Oh and support Arceus formes with Defog. Shedinja has no other places to usefully invest its EVs, but maximizing its Attack allows it to chip Zygarde-C’s Substitute as much as possible in order to prevent it from PP stalling Shedinja.</p> <p>Shedinja's primary utility is in countering Substitute + Dragon Dance Zygarde-C, which is otherwise extremely difficult to stop owing to its immunity to phazing. Another important feat is stopping Calm Mind + Water Spout Primal Kyogre. Those two capabilities, coupled with its passivity, mean that Shedinja fits best on stall teams, where it can slow pivot away from threatening Pokemon to keep its teammates from having to switch into dangerous attacks. As such, good teammates for Shedinja are stall staples such as Ho-Oh for its ability to spread status, use Defog if Shedinja is running Safety Goggles, and reliably pivot into and scout a vast majority of the metagame for moves that could OHKO Shedinja. Other good stall teammates include Chansey, which consistently checks threatening special attackers such as Xerneas and Yveltal, Necrozma-DM, which reliably stops even Crunch Zacian-C, and defensive Arceus-Ground, which blanket checks dangerous physical attackers such as Primal Groudon and Photon Geyser Necrozma-DM. More niche stall picks can also fit alongside Shedinja, such as Giratina, a phenomenal Defogger if needed, Gliscor, which can trap and remove common defensive Pokemon Shedinja cannot switch into and serve as another Defogger, and Lugia, another check to the metagame's physical attackers that fits well on certain stall teams. Shedinja should be used conservatively, only switching into Pokemon that you have already scouted the sets of and ensured are unable to damage it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  },
  "Sableye": {
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<p>Mega Sableye is a staple on stall and bulky balance teams in AG owing to its access to Magic Bounce and solid physical bulk. Fake Out grants Mega Sableye a safe turn for it to Mega Evolve, as well as dealing minor chip damage to foes. Alternatively, Protect can similarly allow Mega Sableye to have a safe turn while scouting for attacks, as well as potentially bouncing back status moves used on a predicted switch, but it carries the drawback of potentially giving foes a free setup turn. Foul Play helps Mega Sableye to deter opposing physical attackers from setting up and revenge kill Pokemon like Dragon Dance Ultra Necrozma, some Mega Rayquaza sets, unboosted Mega Mewtwo Y, and chip defensive Necrozma-DM. Knock Off can be used instead, enabling Mega Sableye to focus on crippling opposing defensive Pokemon such Ho-Oh, Ferrothorn and Giratina. Toxic enables Mega Sableye to punish switches to Pokemon that might otherwise be able to force it out, such as Yveltal, Primal Kyogre, and Xerneas. Alternatively, Will-O-Wisp can be used over Toxic to cripple physical attackers like Zacian-C, Necrozma-DM, and Mega Rayquaza. Prankster is chosen in order to allow Sableye to potentially get a Will-O-Wisp or Toxic off before an opposing Pokemon can move before it Mega Evolves, potentially letting it avoid an OHKO. The given EVs with a Bold nature allow Mega Sableye to have as much physical bulk as possible in order to wall Necrozma-DM.</p> <p>Mega Sableye fits best on stall and bulky balance teams owing to its invaluable Magic Bounce support and strong bulk. Notably, Mega Sableye is a reliable switch-in to defensive Necrozma-DM, provided that Stealth Rock is not on its side of the field. Mega Sableye is, however, notably weak to Fairy, which is a common offensive type, and lacking in special bulk. These factors make it easy for Mega Sableye to be forced out by common offensive Pokemon like Zacian-C and Xerneas, both of which can be stopped by Necrozma-DM, which pairs well with Mega Sableye. Mega Sableye is also easily taken advantage of by support Arceus formes that run Refresh, since Mega Sableye struggles to chip them down. As such, ideal teammates for Mega Sableye are other common stall Pokemon, notably Giratina, for its ability to keep entry hazards off the field against Primal Groudon, which Mega Sableye cannot do, and PP stall Defog from Ho-Oh, giving teams a high level of control over entry hazards. Ho-Oh is also an ideal teammate, providing Defog support and setup-deterring abilities with Whirlwind. Chansey also makes a good teammate, as it can reliably check or counter almost all of the special attackers that might otherwise be able to break through Mega Sableye, such as Primal Kyogre, Eternatus, and Xerneas, as well as providing cleric support to ensure that Mega Sableye's team remains status-free. Additionally, Mega Sableye pairs well with Tyranitar and appreciates its ability to deter some support Arceus formes and reliably check Yveltal lacking Focus Blast and Steel Wing. Care must be taken, however, to ensure that Mega Sableye is not chipped too heavily by Tyranitar’s sand. Lugia can also be a good teammate for Mega Sableye thanks to its ability to force out or cripple Mega Rayquaza and Zacian-C. Necrozma-DM also checks Zacian-C and appreciates the hazard control offered by Sableye, preventing it from being defeated by Assurance sets.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240742, "username": "Estronic"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  },
  "Kyogre": {
    "sets": [
      {
        "name": "Dynamax Wallbreaker",
        "description": "<p>Setup Kyogre is immensely threatening; with a high Special Attack supplemented by Life Orb, access to insanely powerful STAB moves complemented by Drizzle, and stellar coverage, Kyogre succeeds in pressuring a large portion of the defensive metagame. In particular, it OHKOes Necrozma-DM, Ho-Oh, Zygarde-C, and Arceus-Ground. Most importantly, during Dynamax, its Calm Mind-boosted attacks allow it to overpower conventional Kyogre checks such as Ferrothorn, Primal Groudon, non-Calm Mind Arceus-Water, and Chansey while being extremely difficult to revenge kill, making stopping it once it's set up an arduous task. As a result, bulky builds are immensely pressured by this set. Origin Pulse provides a powerful STAB move capable of OHKOing Ho-Oh, Necrozma-DM, Tyranitar and Arceus-Ground as well as heavily damaging most potential switch-ins. Under Dynamax, it allows Kyogre to reset rain and overpower common checks in Chansey and Ferrothorn. Ice Beam targets everything that resists Origin Pulse, notably OHKOing Zygarde-C and OHKOing Mega Rayquaza and Eternatus under Dynamax as well as Primal Groudon and Giratina after a Calm Mind. However, it removes rain, making defeating Chansey and Ferrothorn more troublesome, so it should be used carefully. Calm Mind enables Kyogre to 2HKO a large portion of the metagame while making it even harder to revenge kill with special attacks and enables it to break through non Calm Mind Arceus-Water. Hidden Power Flying enables Kyogre to function as a sweeper, as the Speed boosts it gains under Dynamax allow it to outspeed revenge killers such as Mega Rayquaza and Zacian-C. Alternatively, Hidden Power Ground allows Kyogre to function as an even more adept wallbreaker, OHKOing specially defensive Primal Groudon. Modest is the preferred nature, enabling Kyogre to break Ferrothorn, Primal Groudon, and Chansey more easily, but Timid allows Kyogre to outspeed Modest Yveltal and Xerneas unboosted and Jolly Zacian-C after one Speed boost. The given EVs maximize Kyogre's Special Attack and Speed.</p> <p>Kyogre is a fantastic wallbreaker when utilizing Dynamax, so it fits best on balance and bulky offense teams, which appreciate its wallbreaking prowess while leaving the ability to Dynamax free for it. It also appreciates Sticky Web support. Calm Mind Arceus-Water is the most ubiquitous defensive Pokemon Kyogre cannot break through. As a result, pairing it with Perish trapping Arceus formes, Chansey, or Ferrothorn as well as Primal Groudon can be beneficial. Ferrothorn, Chansey, and Primal Groudon notably Imposter-proof Kyogre as well to some extent. This Kyogre set lures and breaks through common Kyogre switch-ins such as Primal Groudon, Chansey and Ferrothorn, so teammates that appreciate them being gone such as Calm Mind Arceus-Water and Eternatus are useful. Defensive checks to revenge killers such as Zacian-C, Mega Rayquaza, and Primal Groudon that may defeat Kyogre once its Dynamax has ended, such as Lugia, Arceus-Ground, Arceus-Water, and Necrozma-DM, are appreciated. While Dynamax should be conserved for Kyogre, there may be instances that it has already been used, in which case Kyogre will be unable to break through its common counters; as a result, teammates such as Zacian-C and Mega Rayquaza that force out Ferrothorn and Chansey while having the ability to wear down or KO a shared counter in Primal Groudon are appreciated. This support can allow Kyogre to make progress even without Dynamax. In return, Kyogre forces out Zygarde-C, Ho-Oh, and Necrozma-DM for Zacian-C while notably reducing Necrozma-DM's recovery due to rain, and it also relatively easily switches into the support Arceus formes that may threaten Mega Rayquaza.</p> "
      },
      {
        "name": "Primal Wallbreaker",
        "description": "<p>Primal Kyogre is a premier wallbreaker in AG due to a phenomenal Special Attack stat, access to strong STAB moves and colorful coverage, a great ability, and sufficient Speed. Said characteristics give Primal Kyogre a terrifyingly positive matchup against the defensive metagame, allowing it to easily threaten an OHKO on defensive metagame staples such as Necrozma-DM, Zygarde-C, and Ho-Oh. To compound on this, good natural bulk and a great defensive typing also allow it to aggressively switch into common defensive Pokemon such as Arceus-Ground, Necrozma-DM, and Ho-Oh. Origin Pulse provides Primal Kyogre with a strong STAB move to pressure common defensive Pokemon such as Ho-Oh, Necrozma-DM, and Tyranitar. Ice Beam is mandatory in order to chip down and pressure Primal Groudon in the long run. It is also Primal Kyogre’s best option against Dragon-types such as Eternatus and Mega Rayquaza and another check in Amoonguss. At full health, Water Spout is Primal Kyogre's strongest and most reliable STAB move, providing a guaranteed OHKO on common Pokemon such as Necrozma-DM, specially defensive Ho-Oh, Xerneas, and Yveltal, while also heavily pressuring a common Primal Kyogre check in Ferrothorn. Alternatively, Substitute lets Primal Kyogre reliably beat Ferrothorn lacking a Grass-type move, scout for status moves from Pokemon like Ho-Oh, Necrozma-DM, and defensive Primal Kyogre, take advantage of forced switches, and shield itself from revenge killers. In conjunction with Water Spout, Calm Mind allows Primal Kyogre to play a lethal mind game with Ferrothorn, severely punishing it if it tries to regain some health with Protect. Furthermore, Calm Mind also overpowers some of Primal Kyogre's other checks such as Amoonguss and Chansey. Thunder may be run if immediately denting Ditto, Arceus-Water, and opposing Primal Kyogre is desired. However, forgoing Calm Mind leaves Primal Kyogre unable to deal with most of its checks, and the aforementioned Water-types are overwhelmed after a Calm Mind boost regardless. A Timid nature ensures that Primal Kyogre outspeeds neutral-natured Xerneas and Yveltal. Alternatively, a Modest nature may be run in order to overwhelm Ferrothorn and Chansey more reliably.</p> <p>Primal Kyogre fits best on balance and bulky offensive teams, as it prefers being at full health and is quite prone to revenge killers, thus needing proper defensive support. Primal Groudon is the single biggest roadblock to Primal Kyogre's attempts at making progress. Thus, Pokemon that can switch into it and beat it such as defensive Zygarde-C and Arceus-Ground, as well as Pokemon that can overwhelm it in the long run such as Zacian-C and Zekrom, are good teammates. Primal Kyogre is heavily threatened by fast physical attackers such as Zacian-C and Mega Rayquaza. Therefore, Pokemon that can reliably combat these such as Necrozma-DM and Zygarde-C are nigh mandatory partners. Zygarde-C can also provide Glare support, allowing Primal Kyogre to outspeed and threaten an increased amount of the metagame. Furthermore, as Primal Kyogre prefers to stay at full health to preserve Water Spout's power and is repeatedly forced out by offensive checks, entry hazard removal from Ho-Oh is recommended. Since Primal Kyogre possesses over immense wallbreaking prowess, late-game cleaners that benefit from this, such as Yveltal, Zacian-C, and Xerneas, are sensible teammates as well. Moreover, these Pokemon innately improve the offense matchup too, which Primal Kyogre struggles against. Entry hazard support from Ferrothorn and Necrozma-DM is also recommended, as it severely restricts the amount of times Primal Groudon and opposing Ferrothorn can afford to switch into Primal Kyogre. In return, Primal Kyogre severely threatens Ho-Oh to ensure these entry hazards stay up.</p> "
      },
      {
        "name": "Choice Specs Wallbreaker",
        "description": "<p>Choice Specs Kyogre is a fearsome wallbreaker in AG capable of OHKOing almost any Pokemon that doesn’t resist its full power Water Spout. Water Spout notably always 2HKOes Ferrothorn, even if it uses Protect once. Even if opposing Pokemon resist Water Spout, unless they are Primal Groudon, they will still likely take massive damage. Due to this, many teams are reliant on prediction to minimize losses to this set; with correct prediction, it will break through almost any team. Origin Pulse is for when Kyogre has taken sufficient damage to make it do more damage than Water Spout, but is still very powerful in general, OHKOing non-resistant support Arceus formes after Stealth Rock. This set is capable of breaking through several of the usual Kyogre checks, such as Ferrothorn, Blissey, and Chansey. Choice Specs also enables it to deal heavy damage to Primal Groudon with Ice Beam, making it incapable of switching in with Stealth Rock up. Ice Beam also allows Kyogre to severely damage or outright OHKO common Dragon-types, such as Eternatus, Mega Rayquaza, and Zygarde-C. Thunder enables Kyogre to deal heavy damage to opposing Kyogre and Arceus-Water, although it can usually break through them with Water Spout anyway. A Timid nature is preferred to outspeed Modest Yveltal and Xerneas before they can retaliate or, in Xerneas's case, use Geomancy and Speed tie with opposing Kyogre; however, a Modest nature can be used for the extra firepower, which is situationally helpful to break past Primal Groudon and Chansey more easily. Kyogre is able to utilize Dynamax to break through switch-ins, even if you mispredict and select the wrong coverage move. For example, Kyogre can use Max Hailstorm to break or heavily chip Primal Groudon that switches in on a Water-type move or Max Geyser to break Zacian-C that switches into Ice Beam, although Dynamaxing does remove a significant amount of Kyogre's firepower. Importantly, it also gives Kyogre the bulk to tank their attacks. Dynamaxing should often be used early-game in order to break the opponent's Primal Groudon if it necessary to do so.</p> <p>Ideal teammates for Choice Specs Kyogre are Pokemon such as Arceus-Ground and defensive Zygarde-C that can easily deal with Primal Groudon and help deal with Mega Rayquaza. Zygarde-C in particular is useful for its ability to spread paralysis with Glare, making opposing teams easier prey for Kyogre. Zacian-C is also useful because it can wear down opposing Primal Groudon, which is a shared check between Zacian-C and Kyogre, while also forcing out Ferrothorn. Ferrothorn is also an effective teammate owing to its ability to stack Spikes, making it increasingly difficult for Primal Groudon to switch in. Ferrothorn also has the ability to Imposter proof Kyogre, even if Ditto Dynamaxes.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Water Spout is the primary source of Kyogre's damage output, OHKOing almost any non-Dynamaxed Pokemon that doesn’t resist it while Kyogre is healthy and rain is in effect. Origin Pulse is a secondary STAB option for use when Kyogre has been weakened by entry hazards or opposing attacks. Owing to its weaker power, it is less likely to get key KOs, notably missing the OHKO on Zacian-C, but it is still potent. Thunder, with its perfect accuracy under rain, enables Kyogre to take on opposing Kyogre and Arceus-Water, dealing heavy damage and threatening paralysis. Ice Beam enables Kyogre to OHKO or heavily damage Dragon-types such as Eternatus, Zygarde-C, and Mega Rayquaza, all of which are very common in the metagame, and deals chip damage to Primal Groudon. Choice Scarf with a Timid nature enables Kyogre to outspeed almost the entire unboosted metagame. Kyogre is capable of utilizing Dynamax to break through many common Pokemon that have switched into one of its coverage moves; for example, it can use Max Hailstorm to break through Primal Groudon that switched into any of Thunder, Origin Pulse, and Water Spout, Max Lightning to break Arceus-Water that switched into any of Ice Beam, Origin Pulse, and Water Spout, or Max Geyser to break Zacian-C that have switched into Ice Beam. The added bulk also lets it tank attacks like Primal Groudon's Precipice Blades, Mega Rayquaza's Dragon Ascent, and Zacian-C's Wild Charge if healthy.</p> <p>Ideal teammates for Choice Scarf Kyogre are Pokemon such as Arceus-Ground and defensive Zygarde-C that can easily deal with Primal Groudon, as well as checking Mega Rayquaza, and Pokemon such as Mega Rayquaza, Zacian-C, and Mega Gengar to remove Ferrothorn and allow Kyogre to clean more easily. Zacian-C is also useful because it can wear down opposing Primal Groudon, which is a shared check between Zacian-C and Kyogre. Ferrothorn is also an effective teammate owing to its ability to stack Spikes, making it increasingly difficult for Primal Groudon to switch in, and its ability to Imposter proof Kyogre, even if Ditto Dynamaxes.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Primal Kyogre can effectively run a defensive set as well, completely shutting down most defensive staples in Ho-Oh, Necrozma-DM, support Arceus formes, and Zygarde-C in the process. As this Primal Kyogre set is designed for longer games, Scald is the preferred STAB move of choice, as it has perfect accuracy and more PP than Origin Pulse. It also has a considerable chance to cripple the likes of Necrozma-DM, Ferrothorn, and Mega Rayquaza with a burn. Rest provides Primal Kyogre with a source of recovery while also curing status ailments from support Arceus forms, Ho-Oh, and Necrozma-DM, which turns it into an effective status absorber. Sleep Talk is recommended in order to prevent Primal Kyogre being a momentum drain when asleep and to avoid being safe setup fodder for dangerous Pokemon such as Xerneas and Dragon Dance Zygarde-C. As a side note, this is also useful against sleep inducers such as Smeargle and Vivillon. Alternatively, Ice Beam gradually damages Primal Groudon throughout a battle. It also provides a strong hit against Zygarde-C, Mega Rayquaza, and Eternatus. Toxic is recommended in order to put the likes of Xerneas, Yveltal, and Mega Rayquaza on a timer, while greatly pressuring non-Rest Primal Groudon. Alternatively, Calm Mind allows Primal Kyogre to combat Eternatus, Amoonguss, and most Calm Mind Arceus formes in a 1v1 scenario, while also turning it into a potent wincon and making it progressively more difficult to break with special attackers. As Primal Kyogre is a naturally specially bulky Pokemon, a Bold nature in conjunction with fully physically defensive investment greatly improves Primal Kyogre's overall bulk, notably allowing it to take a Choice Band-boosted Dragon Ascent from Mega Rayquaza and two Precipice Blades from uninvested Primal Groudon and more comfortably switch into Brave Bird from Ho-Oh and Thousand Arrows from Zygarde-C.</p> <p>Primal Kyogre fits best on balance and bulky offensive teams seeking a status absorber as well as a way to shut down a majority of the defensive metagame. Primal Groudon, especially with Rest, is the most annoying obstacle for Primal Kyogre, as it can switch into its attacks with impunity and force it out with a strong Precipice Blades. Thus, Pokemon that can check it, such as Arceus-Ground and Zygarde-C, as well as wallbreakers that can overwhelm or take advantage of it, such as Zacian-C, Yveltal, and Mega Rayquaza, are prudent teammates. Primal Kyogre is prone to strong physical attackers such as Mega Rayquaza and Zacian-C. Therefore, physical walls such as Zygarde-C and Necrozma-DM are recommended teammates. Moreover, Necrozma-DM can also check Xerneas, which can otherwise use Primal Kyogre as setup fodder if it lacks Toxic or gets an unfavorable Sleep Talk roll. Setup sweepers, in general, are an annoyance due to the potential free turns they may get against a sleeping Primal Kyogre, so strong anti-setup measures such as Ditto and Haze Zygarde-C fit well. Ferrothorn is especially troublesome to this set, as it can use this Primal Kyogre variant as an opportunity to lay multiple layers of Spikes. For this reason, strong entry hazard control from the likes of Ho-Oh and Mega Diancie, as well as strong means of pressuring Ferrothorn with the likes of Primal Groudon and Eternatus, are good choices as well. Chansey and the aforementioned Mega Diancie are valuable partners that can provide cleric support and deal with dangerous threats like Xerneas and Yveltal, respectively, that may try to take advantage of a sleeping Kyogre.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 426798, "username": "Geysers"}, {"user_id": 374620, "username": "pichus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336703, "username": "Rabia"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 464176, "username": "Icemaster"}]}
  },
  "Groudon": {
    "sets": [
      {
        "name": "Mixed Breaker",
        "description": "<p>Primal Groudon is one of the most fearsome offensive threats in AG thanks to its impressive offensive movepool and ability to hit foes incredibly hard both physically and specially while being accompanied by its solid natural bulk, which makes it difficult to revenge kill. Eruption provides Primal Groudon with the ability to break through physically defensive support Arceus formes, notably Arceus-Ground and Arceus-Dark, that would otherwise wall it. Fire Blast can also be used over Eruption for its consistency. This consistency allows Primal Groudon to soft check Zacian-C and Primal Kyogre without having to compromise its wallbreaking prowess. Precipice Blades gives Primal Groudon a tool to do good damage even if it's been chipped enough to reduce Eruption’s power meaningfully, as well as letting it break through specially bulky Pokemon like Chansey, which would otherwise wall it. In addition, Precipice Blades also gives Primal Groudon a way to damage Primal Kyogre, Arceus-Water, and Eternatus. Stone Edge is chosen to hit Flying types, such as Ho-Oh and Mega Rayquaza, that would otherwise switch into Primal Groudon with near impunity. Alternatively, Rock Tomb can be used, trading some power for the ability to cripple switch-ins, notably affecting Zacian-C and Mega Rayquaza that attempt to switch into a predicted Stone Edge or Precipice Blades, respectively. Swords Dance allows Primal Groudon to boost past many Pokemon that would otherwise check it, such as Giratina, Zygarde-C, and Arceus-Water, all of which would otherwise be able to whittle down Primal Groudon's health while recovering off its hits. Swords Dance further strengthens Primal Groudon's offensive presence if it's been chipped too much for Eruption to be useful. Hidden Power Ice can alternatively be used for the ability to KO Zygarde after it switches into one of Primal Groudon's other moves and OHKO Rayquaza as it switches in. Either Stealth Rock or Rest can also be used over Swords Dance. Stealth Rock enables Primal Groudon to take advantage of the many switches that it is capable of forcing, while Rest allows it to recover from chip damage and status in order to replenish Eruption's power. A Hasty nature does not lower Primal Groudon's Special Defense, giving it at least some capability to deal with Primal Kyogre and support Arceus formes while still maximizing its speed and power.</p> <p>Primal Groudon fits well on all manner of balanced and offensive teams thanks to its incredible breaking power, defensive utility, and natural bulk. Because it can struggle to break through defensive Pokemon like Arceus-Water, Zygarde-C, and Giratina, Primal Groudon appreciates teammates that are capable of taking advantage of them, such as Xerneas, Eternatus, and Yveltal. Similarly, Pokemon such as Mega Rayquaza, Eternatus, and Zacian-C that can pressure Primal Groudon's checks are good teammates as well. All of them hugely appreciate Primal Groudon's wallbreaking prowess, which facilitates their late-game cleaning. Gothitelle is another good teammate, as it can trap both Arceus-Water and Zygarde-C lacking Dragon Tail. If Rest is used over Swords Dance, Primal Groudon should be used on a bulkier team, preferably one with either Chansey or Diancie to provide cleric support to complement Rest. On more offensive teams, Primal Groudon's relatively slow Speed can become a hindrance, so it fits best with Sticky Web support. If it's used on offense without Sticky Web support, Primal Groudon should opt for Rock Tomb over Stone Edge in order to punish switches by ensuring that it can get another hit off against potential faster switch-ins. Those teams, in return, appreciate Primal Groudon's ability to heavily pressure most common Defoggers, including Ho-Oh and support Arceus formes. Primal Groudon should be used with caution throughout the match, ideally brought in on free turns or predicted switches in order to minimize chip damage and maximize Eruption's power. Owing to Primal Groudon's weakness to chip damage, it pairs well with reliable Defoggers on balance teams, such as Ho-Oh, Giratina, and support Arceus formes. On offense, however, pressure from Primal Groudon's teammates can prevent the foe from setting Stealth Rock at all. Most of the tier's common Stealth Rock users, including Necrozma-DM, Tyranitar, and opposing defensive Primal Groudon, can't switch into Primal Groudon itself, further reducing opportunities for foes to set Stealth Rock.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>With a specially defensive set, Primal Groudon notably acts as a great switch-in to Primal Kyogre and a reliable way of wasting Dynamax turns from Xerneas. Stealth Rock is a great move on Primal Groudon, since its bulk and typing give it numerous switch-in opportunities against common Pokemon such as Zacian-C, defensive Necrozma-DM, and Ho-Oh. Although uninvested, Precipice Blades is a powerful STAB move that 2HKOes Primal Kyogre and non-Dynamaxed Xerneas. Stone Edge is mainly run in order to force Ho-Oh, the best Defogger, out immediately. Overheat severely punishes Yveltal if it tries to switch into Primal Groudon, OHKOing it after little prior chip damage. It also lets Primal Groudon OHKO Necrozma-DM and Ferrothorn and force recovery from Arceus-Ground. Rest allows Primal Groudon to wall Ho-Oh, defensive Necrozma-DM, and Arceus-Water throughout the entire game by curing it from Toxic poison. It also makes up for Primal Groudon's lack of reliable recovery so it can repeatedly check Primal Kyogre even during longer matches. Toxic is a niche option to cripple offensive checks such as Mega Rayquaza, Yveltal, and Primal Kyogre if they attempt to switch in on an attack or use of Stealth Rock. Roar racks up entry hazard damage and prevents Primal Groudon from being used as setup fodder by Zygarde-C, Mega Rayquaza, Smeargle, Vivillon, and an overly confident Xerneas, but it is hard to justify over other moves. Sleep Talk alongside Rest deters Pokemon like Primal Kyogre, Xerneas, and Mega Gengar from switching in and taking advantage of Primal Groudon while it is asleep, but such a set is completely walled by Flying-types and struggles to set Stealth Rock against Ho-Oh without proper team support. 252 HP and 36 Defense EVs guarantee that Primal Groudon is never 2HKOed by Zacian-C's Close Combat when healthy. The remaining EVs with a Sassy nature are used to maximize its Special Defense without compromising its damage output. If not running Overheat, Primal Groudon should use a Careful nature. A fully physically defensive EV spread with an Impish nature can be used to make Primal Groudon much better against Zacian-C, but this job is done better by Necrozma-DM, since the latter has reliable recovery and Close Combat is still a 3HKO on physically defensive Primal Groudon.</p> <p>Primal Groudon fits best on balance and bulky offense teams in need of a Primal Kyogre check, Stealth Rock setter, and way of wasting Xerneas's Dynamax turns. It is also a good Zacian-C check, since it is able to switch in on all of said foe's moves except Close Combat and Assurance if entry hazards are in effect. Early-game, play aggressively with Primal Groudon since only defensive Zygarde-C and Refresh Arceus formes truly counter it. Use Stealth Rock if there's a good opportunity to, but don't hesitate to use an attack or Toxic instead if you expect your opponent to send out a powerful wallbreaker like Yveltal, Mega Rayquaza, or Primal Kyogre. Even though Primal Groudon resists most of Zacian-C's moves, Close Combat is too powerful for it to handle, so having a teammate like defensive Necrozma-DM or Zygarde-C is a good idea. Ho-Oh and Primal Groudon form a potent defensive core compressing Stealth Rock and Defog that also works well at wasting Dynamax turns from the likes of Xerneas and Yveltal. Furthermore, Primal Groudon can switch into Water- and Electric-type attacks from Pokemon like Primal Kyogre and Zacian-C, while Ho-Oh can switch into support Arceus-Ground. Having your own Primal Groudon check is important too, so take a look at team options such as Zygarde-C and Arceus-Ground, both of which also improve the matchup against Mega Rayquaza, one of the most dangerous threats to Primal Groudon. Finally, Ditto can come in after Primal Groudon has been defeated by Zacian-C, Xerneas, or Mega Rayquaza and proceed to reverse sweep. It is a recommended teammate, especially if Primal Groudon is running Rest, because Primal Groudon leaves its team dangerously vulnerable to sweepers when asleep.</p> "
      },
      {
        "name": "Stealth Rock + Swords Dance",
        "description": "<p>This set turns Primal Groudon into both a good Stealth Rock setter and a wallbreaker. Primal Groudon can easily find opportunities to set Stealth Rock up or use Swords Dance against foes it forces out such as Zacian-C and Necrozma-DM. Swords Dance turns Primal Groudon into a powerful wallbreaker that can surprise and decimate bulkier teams lacking Arceus-Ground. It is especially useful for breaking past defensive Zygarde with some prior chip damage, and it also allows Primal Groudon to beat Defoggers such as Lunala and Arceus-Water. Precipice Blades is its strongest STAB attack and achieves nearly perfect coverage with Rock Tomb or Stone Edge, which targets Flying-types such as Ho-Oh and Yveltal. The EV spread guarantees that Primal Groudon is never 2HKOed by Primal Kyogre's Ice Beam after Stealth Rock damage and that Zacian-C never 2HKOes Primal Groudon with Close Combat. The Speed investment makes it faster than positive-natured Arceus formes after one use of Rock Tomb, allowing it to set Stealth Rock versus them reliably. Crucially, it also allows Primal Groudon to outspeed defensive Zygarde and Lunala and potentially break past them. The remaining EVs go in Attack with an Adamant nature to increase its wallbreaking capability. An EV spread of 4 HP / 252 Atk / 252 Spe with a Jolly nature also works very nicely as a surprise factor, since it notably lets Primal Groudon outspeed Yveltal and support Arceus-Ground and Speed tie with Timid Primal Kyogre.</p> <p>Usually, it is best to set Stealth Rock up as soon as possible against offensive teams. Against balance teams that rely on defensive Zygarde-C to check Primal Groudon, weaken it first while taking care not to activate Power Construct, then use Swords Dance to break through it the next time Primal Groudon comes in. Having teammates that can handle Mega Rayquaza is important because it doesn't fear much from Primal Groudon; Zacian-C and Eternatus can check it offensively, while defensive Zygarde-C can paralyze it with Glare or phaze it with Dragon Tail as long as Mega Rayquaza doesn't carry a Dragon-type move. Zygarde-C also helps a lot against opposing Primal Groudon. Having solid counterplay to Arceus-Ground such as Ho-Oh and Ferrothorn is required, too. Since this set fits best on offensive teams that can use Primal Groudon as a Stealth Rock setter and wallbreaker that facilitates sweepers' task, sweepers such as Zacian-C, Xerneas, Yveltal, and Dragon Dance Necrozma-DM make for good partners. The former two can also help with checking opposing Yveltal, which can easily use Primal Groudon as an opportunity to switch in and Dynamax. Zacian-C, in particular, greatly appreciates Rock Tomb support, since it prevents Speed-boosting sweepers such as Dragon Dance Mega Rayquaza and Ultra Necrozma from becoming faster than Zacian-C while inflicting enough damage to put them in KO range of Behemoth Blade.</p> "
      },
      {
        "name": "Dynamax Sweeper",
        "description": "<p>Groudon is a threatening setup sweeper in AG thanks to its solid Attack stat and decent natural physical bulk, which can allow it to set up on forced switches against the likes of Necrozma-DM, defensive Primal Groudon, Tyranitar, and Ho-Oh. Precipice Blades is chosen over Earthquake to have a chance to OHKO Arceus-Water and defensive Zygarde after a Swords Dance boost while also breaking Giratina under Dynamax. Stone Edge gives Groudon a vital coverage move, enabling it to OHKO Ho-Oh and Mild Yveltal without a boost and also hit Mega Rayquaza. Notably, after a Swords Dance boost, Stone Edge OHKOes Mild Dynamaxed Yveltal from full, and Max Rockfall OHKOes any Dynamaxed Yveltal. Aerial Ace rounds out the set, as it gives Groudon a way to boost its Speed under Dynamax, allowing it to outspeed almost the entire unboosted metagame after one Max Airstream with a Jolly nature. Life Orb is chosen for its significant damage boost, which allows Groudon to land critical OHKOs on the aforementioned threats after a Swords Dance boost. An Adamant nature ensures these OHKOs, but it is worth noting that a +1 Speed Adamant Groudon cannot outspeed a Jolly Zacian-C. To overcome this issue, a Jolly nature can be used, which allows Groudon to outspeed Xerneas, Yveltal, and Modest Kyogre and Primal Kyogre while still being fairly powerful.</p> <p>Groudon fits best on hyper offense teams, especially those that can provide Sticky Web support to make up for Groudon's average Speed. These teams greatly appreciate Groudon's ability to break through just about every Defogger in the tier, and on them, Groudon often forces the opponent's Dynamax without even needing to Dynamax itself. Groudon greatly appreciates Stealth Rock support, which ensures the OHKO on Arceus-Water and a near-guaranteed one on defensive Zygarde with +2 Precipice Blades, as well as on Yveltal and Primal Kyogre with Stone Edge and Precipice Blades, respectively. Groudon can also fit on balance teams, although its average Speed means that it appreciates paralysis support from Pokemon like defensive Glare Zygarde-C and Thunder Wave Necrozma-DM, both of which can generate more setup turns for Groudon. Wallbreakers that can pressure defensive Zygarde-C and Giratina are important teammates to have on both Sticky Web and balanced teams. Good examples include Swords Dance Arceus formes and Ultra Necrozma on Sticky Web teams, Zacian-C on balance, and Mega Rayquaza on both. Teammates that can outright exploit Zygarde-C and Giratina, such as Yveltal and Xerneas, are equally effective options. If Groudon is used on balance, Perish Song + Whirlpool Arceus-Dark pairs especially well, since it's capable of removing Zygarde-C. Moreover, Arceus-Dark also takes great advantage of Giratina and Lunala, which avoid the OHKO from +2 Precipice Blades and can cripple Groudon with Will-O-Wisp. Since Groudon is weak to Ditto, Zygarde-C can help to Imposter-proof it on balance, while the likes of Mega Rayquaza and Yveltal can provide a Ground immunity on Sticky Web teams. Late-game cleaners that benefit from Groudon's immense wallbreaking capabilities are wise teammates on balance as well, with Zacian-C, Dragon Dance Mega Rayquaza, and Calm Mind Arceus formes being good examples.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 374620, "username": "pichus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 286018, "username": "Ktütverde"}, {"user_id": 426798, "username": "Geysers"}]}
  },
  "Rayquaza": {
    "sets": [
      {
        "name": "Setup Sweeper",
        "description": "<p>Mega Rayquaza sports immense raw power, a stellar offensive movepool, and the ability to hold an item, making it one of the most lethal wallbreakers Anything Goes has to offer. Moreover, its access to potent boosting options in Dragon Dance and Swords Dance further strengthens its wallbreaking prowess. Mega Rayquaza also boasts a solid Speed tier, notably outspeeding huge threats in Yveltal, Xerneas, and Primal Kyogre, which helps it in finding setup opportunities by forcing switches. Dragon Dance turns Mega Rayquaza into a potent wallbreaker as well as a late-game cleaner. Swords Dance may be opted for instead in order to turn Mega Rayquaza into a destructive wallbreaker, allowing it to OHKO the bulkiest of threats such as defensive Zygarde and every support Arceus form, but unlike the Dragon Dance set, it is easily revenge killed by Zacian-C, Eternatus, and other faster threats. Extreme Speed is mandatory, as it allows Mega Rayquaza to finish off a weakened Zacian-C and Eternatus, revenge kill several weakened boosted threats such as Xerneas, Yveltal, and opposing Mega Rayquaza, and ease the matchup against Ditto, since it will be forced to lock into the exploitable Extreme Speed if it wants to revenge kill Mega Rayquaza. V-create allows Mega Rayquaza to always OHKO Necrozma-DM after a boost from either Swords Dance or Dragon Dance, and even KO a Dynamaxed variant after minimal chip with a boost from Swords Dance. Earthquake may be used instead, as after a Swords Dance boost, it KOes Necrozma-DM after minimal chip, OHKOes Tyranitar and Zekrom, and hits Primal Groudon harder without lowering Mega Rayquaza's defenses and Speed. It also allows Mega Rayquaza to defeat Necrozma-DM without inviting Zacian-C in to revenge kill it after a Dragon Dance boost. An Adamant nature in combination with a Life Orb is preferred in order to get crucial OHKOes on the likes of defensive Zygarde and support Arceus formes after a Swords Dance.</p> <p>Mega Rayquaza fits best on balanced, bulky offensive, and hyper offensive teams as a dreaded wallbreaker capable of easily blowing up gaping holes or forcing the opponent's Dynamax for a teammate such as Xerneas or Zacian-C to clean up. In balance and bulky offense, Mega Rayquaza appreciates the support from defensive Pokemon that can take its revenge killers on, whereas in hyper offensive builds, it hugely benefits from teammates pressuring shared checks as well as having potential Sticky Web support. When Mega Rayquaza opts to run Dragon Dance, extra wallbreakers to pressure defensive Zygarde-C in particular are recommended in both builds in order to enable Mega Rayquaza's late-game cleanup. In bulky builds, this may include the likes of Play Rough Zacian-C and Swords Dance Primal Groudon, whereas in offensive builds, the likes of Ultra Necrozma and Swords Dance Arceus formes make for good teammates. When running Swords Dance, Mega Rayquaza is a very self-sufficient wallbreaker that doesn't necessarily require wallbreaking support. However, Swords Dance does leave it more prone to revenge killers such as Eternatus, Ultra Necrozma, and its biggest nemesis in Zacian-C, which notably resists Extreme Speed. Thus, Sticky Web support from Smeargle in offensive builds, and Pokemon that can check Zacian-C, Eternatus, and Ultra Necrozma in bulkier builds, such as Necrozma-DM, Tyranitar, and defensive Zygarde-C, respectively, are all sensible choices to pair with Mega Rayquaza. Ho-Oh is a great option that can mitigate Mega Rayquaza's weakness to Stealth Rock by providing Defog support. Both Swords Dance and Dragon Dance variants are prone to getting revenge killed by Ditto. As a result, Pokemon that can reliably pivot into Dragon Ascent in balanced and bulky offensive teams, such as Necrozma-DM and defensive Zygarde-C, are prudent teammates to have. In hyper offensive teams, Pokemon that can directly take advantage of a Ditto locked into Extreme Speed, such as Arceus-Ghost, Ultra Necrozma in either of its base formes, and Zacian-C, are good solutions for Ditto as well. Lastly, as Mega Rayquaza has a tendency to consistently force the opponent's Dynamax, late-game cleaners that benefit from this such as Yveltal, Xerneas, Swords Dance Zacian-C, and Calm Mind Arceus-Dark and Arceus-Water are great options as well.</p> "
      },
      {
        "name": "Mixed Life Orb",
        "description": "<p>Mixed Life Orb is the most flexible set Mega Rayquaza can opt for, as it isn't Choice-locked and doesn't necessitate a turn to boost up while still immensely threatening all defensive metagame staples in Necrozma-DM, Ho-Oh, Primal Groudon, Zygarde-C, and support Arceus formes. A strong Draco Meteor is the main appeal of this set, as it OHKOes a common Mega Rayquaza check in Zygarde-C while also hitting support Arceus formes and Primal Groudon very hard. Extreme Speed grants Mega Rayquaza a way to pick off faster threats such as Eternatus and Ultra Necrozma while also allowing it to revenge kill boosted setup sweepers in Xerneas, Yveltal, and opposing Mega Rayquaza. A Lonely nature is preferred for maximal wallbreaking potential while limiting damage from support Arceus formes. On the other hand, a Hasty nature may be used in order to outspeed neutral-natured Arceus formes.</p> <p>Mega Rayquaza fits best in balanced and bulky offensive teams that are in need of a wallbreaker capable of luring Zygarde-C. As a result, Pokemon that appreciate Zygarde-C out of the picture, such as Zacian-C, Dragon Dance Zygarde-C, and Primal Groudon make great partners. Mega Rayquaza is vulnerable to faster threats such as Zacian-C, Eternatus, and Mega Mewtwo Y. Therefore, Pokemon that can take these on, such as Necrozma-DM, Calm Mind Arceus formes, and Lunala, respectively, are good teammates as well. Furthermore, Ho-Oh is a great teammate, as it can provide Defog support in order to significantly increase the number of wallbreaking opportunities for Mega Rayquaza. After Mega Rayquaza has finished breaking walls and pressuring a foe to Dynamax, teammates such as Yveltal, Xerneas, and Zacian-C can clean up the weakened team late-game.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band provides Mega Rayquaza with notable merits over boosting sets, the most important one being that it can immediately start wallbreaking without necessarily having to find an opportunity to set up. Furthermore, this Mega Rayquaza variant is slightly more durable than most other variants due to the lack of Life Orb recoil. A strong Dragon Ascent right off the bat is a major draw of this set, severely limiting usual switch-ins such as support Arceus formes and defensive Lunala by handily 2HKOing them. Extreme Speed provides Mega Rayquaza with a strong priority move that can easily take out weakened threats such as Xerneas, Yveltal, Eternatus, opposing Mega Rayquaza, and Ultra Necrozma. V-create OHKOes Necrozma-DM, a major deterrent in spamming Dragon Ascent. It also boasts the same power as Dragon Ascent, slightly easing prediction against cores such as Necrozma-DM and a support Arceus forme. Earthquake rounds out the set by OHKOing specially defensive Tyranitar while still hitting Necrozma-DM for major damage, easing prediction against this particular core. Outrage may be used instead in order to lure and OHKO defensive Zygarde, while still hitting Tyranitar and support Arceus formes very hard. However, it leaves Mega Rayquaza wide open to Fairy-types such as Zacian-C and Xerneas. Draco Meteor is another option that still OHKOes defensive Zygarde while making Mega Rayquaza less prone to Fairy-types. However, it is relatively weak overall and is therefore an exploitable option to lock into. An Adamant nature is preferred for maximal wallbreaking potential. A Jolly nature may be used instead if outpacing neutral-natured Arceus formes is deemed necessary.</p> <p>Mega Rayquaza fits best as a wallbreaker in balance and bulky offense that can also provide valuable revenge killing utility in Extreme Speed. If forgoing a Dragon-type STAB move, defensive Zygarde-C is a nuisance to Mega Rayquaza, as it can soak up at least a couple of hits throughout a game, thereby limiting Mega Rayquaza's attempts at making progress. Thus, fellow wallbreakers that can pressure or exploit Zygarde-C, such as Yveltal, Play Rough Zacian-C, Primal Kyogre, and Swords Dance Primal Groudon make good teammates. Furthermore, Mega Rayquaza is prone to faster threats such as Zacian-C, Eternatus, and Mega Mewtwo Y. Pokemon that can take these threats on, such as Necrozma-DM, Tyranitar, and Lunala are therefore good teammates. Moreover, Tyranitar can Pursuit trap Mega Gengar, which can otherwise easily trap and dispose of Mega Rayquaza. Ho-Oh is another good teammate for its ability to provide Defog support and pivot into Zacian-C. Late-game cleaners that benefit from Mega Rayquaza's great wallbreaking prowess, such as Zacian-C, Yveltal, and Xerneas, can easily finish off a weakened team once Mega Rayquaza has concluded its wallbreaking. Xerneas and Assurance Zacian-C in particular can weaken or finish Necrozma-DM off in order to allow Mega Rayquaza to spam Dragon Ascent more freely. They also appreciate Mega Rayquaza's tendency to force the opponent's Dynamax, which greatly amplifies their cleaning prowess.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 374620, "username": "pichus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": [{"user_id": 360582, "username": "Guard"}]}
  },
  "Giratina": {
    "sets": [
      {
        "name": "Bulky Defog",
        "description": "<p>Owing to its high bulk, good matchup versus common entry hazard setters such as Primal Groudon, Ferrothorn, and Necrozma-DM, and inability to be trapped by Gothitelle and Mega Gengar, Giratina is a good Defogger for bulky balance teams and stall teams as well as a check to Zacian-C, Dragon Dance Mega Rayquaza, Necrozma-DM, and Swords Dance Arceus formes. Defog in tandem with Pressure enables Giratina to reliably remove hazards throughout the game. Toxic allows Giratina to cripple switch-ins such as Ho-Oh, Yveltal and Xerneas while chipping away at offensive threats such as Primal Groudon and Primal Kyogre. Will-O-Wisp allows Giratina to punish offensive Pokemon such as Necrozma-DM, Ultra Necrozma, Mega Rayquaza, and Zacian-C that may attempt to aggressively switch in or set up while allowing Giratina to chip Ferrothorn. Rest provides Giratina with a form of recovery while curing it of status. Roar is an option over Will-O-Wisp in order to rack up hazard damage and to fully prevent Giratina from being set up on by Pokemon such as Calm Mind + Refresh Arceus formes and Substitute Zacian-C, but it is generally not recommended, as it only provides a temporary check to physical wallbreakers, allowing them to freely attack Giratina. The given EV spread maximizes physical bulk while ensuring Giratina avoids the 2HKO from Primal Kyogre's Ice Beam after Stealth Rock damage. A Relaxed nature and minimum Speed IVs are recommended in order to use Defog after Primal Groudon and Necrozma-DM use Stealth Rock.</p> <p>Giratina is very passive, so it fits primarily on stall and bulkier balance teams that can patch up its weakness to top-tier threats and prevent it from being taken advantage of while asleep. In return, it offers powerful entry hazard control and status absorption. Yveltal is a huge threat to Giratina, so switch-ins such as Chansey, Tyranitar, Diancie and Ho-Oh to an extent are invaluable. In particular, Chansey and Diancie also offer cleric support to mitigate the effects of Rest, making them especially good partners. Substitute + Dragon Tail Zygarde-C sets up for free on Giratina, so strong checks such as Ice Beam or Perish Song Arceus formes are recommended. Refresh + Calm Mind Arceus formes also set up on Giratina for free, therefore checks such as Chansey or Whirlwind users such as Ho-Oh and Lugia are appreciated. Xerneas is also a huge threat to Giratina, and teammates such as Necrozma-DM and the aforementioned Chansey can check it. Switch-ins to Eternatus such as Tyranitar and Chansey are appreciated too. Play Rough Zacian-C and Draco Meteor Mega Rayquaza are common threats that Giratina cannot handle easily, so Lugia, Necrozma-DM, and Arceus-Ground are good partners for it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 374620, "username": "pichus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 464176, "username": "Icemaster"}]}
  },
  "Excadrill": {
    "sets": [
      {
        "name": "Hazard Lead",
        "description": "<p>Excadrill is a decent entry hazard lead in the metagame thanks to its ability to set Stealth Rock against Magic Bounce Pokemon. It also has great utility moves in Rapid Spin and Rock Tomb to aid it in the matchup versus other common leads like Deoxys-S and Smeargle. Rock Tomb lowers the Speed of opposing lead Pokemon that Excadrill or its teammates would otherwise be slower than, and it also prevents sweepers like Dynamaxed Yveltal, Mega Rayquaza, and Xerneas from KOing Excadrill with Speed boosts under their belt. A high Attack stat and Earthquake ensure that Excadrill isn't passive setup bait, letting it threaten common entry hazard setters such as Primal Groudon, Necrozma-DM, and Ferrothorn as well as potentially OHKO Zacian-C; this forces them to KO Excadrill, which allows its teammates to safely enter the field and take advantage of the Stealth Rock that it has laid. Toxic is also a viable option over Earthquake to pressure Pokemon such as Dragon Dance Zygarde-C, support Arceus formes without Refresh, and other Pokemon that try to set up on Excadrill. Rapid Spin removes entry hazards set by other lead Pokemon such as Deoxys-S, Primal Groudon, and Smeargle and provides Excadrill with a Speed boost to outspeed and threaten faster Pokemon. A Jolly nature is used to outspeed Smeargle, support Arceus formes, Modest Yveltal and Xerneas, and, after one Speed boost from Rapid Spin, Jolly Zacian-C. Focus Sash is the chosen item, as it guarantees that Excadrill will survive any one non-multi-hit move from faster Pokemon, which improves the chance of it getting Stealth Rock up.</p> <p>Excadrill fits best on hyper offense teams due to the fact that other playstyles generally do not appreciate a dedicated suicide lead. Beating lead Substitute Zacian-C is essential for offense, as otherwise, said foe will most likely outspeed and KO or severely damage the rest of Excadrill's team, preventing safe setup in most cases. Entry hazard-sensitive Pokemon such as Mega Rayquaza, Lunala, and Yveltal really appreciate Excadrill's ability to get rid of entry hazards. Other sweepers such as Zacian-C, Xerneas, and Dragon Dance Zygarde-C are also great teammates for Excadrill. Pokemon that can block Excadrill's Rapid Spin like Ferrothorn and Ghost-types like Lunala can be problematic, so teammates that can take advantage of them such as Zacian-C and Yveltal are also appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 374620, "username": "pichus"}, {"user_id": 464176, "username": "Icemaster"}]}], "writtenBy": [{"user_id": 511181, "username": "WrathoftheLeopard"}]}
  },
  "Gothitelle": {
    "sets": [
      {
        "name": "PP Stall Trapper",
        "description": "<p>With Shadow Tag, Gothitelle's functions as a bulky trapper able to switch into and trap common defensive Pokemon such as Necrozma-DM, many support Arceus formes, Ho-Oh, Ferrothorn and defensive Zygarde-C lacking Dragon Tail. This allows it to provide invaluable support to offensive teammates such as Zacian-C, Zygarde-C, and Xerneas that may otherwise struggle to sweep. It also potentially removes the opponent's control in the hazard game by trapping and removing entry hazard setters and Defoggers. Rest is mandatory in order for Gothitelle to avoid status while also wasting more of the opponent's PP. Shadow Tag prevents the foe from switching out and take taking advantage of the passiveness of a sleeping Gothitelle. Taunt is invaluable, as it denies phazing from Ho-Oh and Lugia and can help prevent foes from setting up or removing hazards. It also limits the moves the opponent can choose from, conserving Gothitelle's PP. Charm weakens trapped foes such as Necrozma-DM, Zygarde-C, and Ho-Oh, preventing them from harming Gothitelle at all outside of critical hits. Cosmic Power further boosts Gothitelle's bulk and allows it to safely trap special attacking threats such as support Arceus formes. The chosen spread maximizes Gothitelle's physical bulk while letting it outspeed Necrozma-DM. Leftovers is generally the preferred item for passive recovery, though Fairium Z can be used in tandem with Charm and a faster spread of 248 HP / 56 Def / 204 Spe in order to trap support Primal Groudon. However, this is not recommended, as it traps no additional Pokemon in comparison to the original set, and Primal Groudon often runs mixed coverage or faster sets anyway. A more specially defensive set of 252 HP / 4 Def / 252 SpD with a Calm nature can be run in order to more reliably trap Arceus formes and Eternatus but misses out on trapping Ho-Oh and Necrozma-DM.</p> <p>Gothitelle forces its own matchups and so doesn't require much support from its team in terms of its defensive weaknesses. As Gothitelle is capable of trapping a majority of the defensive metagame, it pairs well with a plethora of offensive threats. Xerneas and Swords Dance Zacian-C are notable teammates, as they can easily clean up teams once Gothitelle has trapped the likes of Necrozma-DM, Ho-Oh, and Chansey for the former and Lugia, Necrozma-DM, and Quagsire for the latter. Dragon Dance Zygarde-C heavily enjoys support Arceus formes being out of the picture and thus is a great teammate as well. Entry hazard setters such as Ferrothorn and Necrozma-DM appreciate Gothitelle's ability to eliminate common Defoggers such as Ho-Oh and support Arceus formes. Furthermore, several other miscellaneous offensive threats, such as Dragon Dance Necrozma-DM, Ultra Necrozma, and Zekrom benefit from Gothitelle, as it can trap and remove a majority of their checks in support Arceus formes, as well as defensive Zygarde-C for the former two.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 374620, "username": "pichus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 464176, "username": "Icemaster"}]}
  },
  "Ferrothorn": {
    "sets": [
      {
        "name": "Hazard Setter",
        "description": "<p>Ferrothorn is an effective hazard setter in AG due to its access to Spikes, and the ability to set these repeatedly with the assistance of its good natural bulk and strong defensive typing, which allows it to be one of the few reliable checks to Primal Kyogre and the only viable Spikes setter. Ferrothorn utilizes Leech Seed as a semi-reliable form of recovery and a way to deal chip damage to Pokemon that may switch into it, such as Ho-Oh, Zacian-C, and Primal Groudon. Ferrothorn's ability to force switches through Leech Seed pairs well with its capability to stack hazards. Furthermore, Leech Seed should be used liberally throughout the match to keep Ferrothorn as healthy as possible. Knock Off allows Ferrothorn to punish opposing Ho-Oh by removing its Heavy-Duty Boots, making it dangerous for Ho-Oh to switch in when Stealth Rock is up and making it unsafe for Ho-Oh to use Defog on Ferrothorn. In addition, Knock Off also makes Ferrothorn less prone to being trapped by Mega Gengar while greatly reducing the longevity Pokemon that rely on Leftovers like Necrozma-DM. Knock Off works well with the constant chip damage Ferrothorn does to the opposing team through Leech Seed and Spikes, forcing Pokemon like Necrozma-DM to waste its Morning Sun PP to stay healthy. Protect allows Ferrothorn to scout moves from Choice-locked attackers, such as Mega Rayquaza, Kyogre, and Lunala; stall Dynamax turns from Pokemon such as Yveltal and Xerneas; and stall for a little extra Leftovers recovery and potential Leech Seed recovery, which is especially vital versus Water Spout Primal Kyogre. Leftovers is chosen to enable Ferrothorn to semi-reliably switch into Primal Kyogre. Alternatively, Ferrothorn can run Gyro Ball, Power Whip, or Bullet Seed over Knock Off to be able to punish switch-ins such as Zacian-C and Mega Diancie or deal more damage to Primal Kyogre and Substitute Arceus-Water, although Knock Off is generally preferable, as otherwise, Ho-Oh removes freely removes Spikes.</p> <p>Ferrothorn fits best on hazard stacking balance or bulky offense teams that can patch up its weaknesses. Ferrothorn is vulnerable to strong physical attacks from Pokemon such as Primal Groudon, Mega Rayquaza, and Zacian-C, meaning that it appreciates support from defensive Pokemon like, defensive Zygarde-C, and Arceus-Ground. As Ferrothorn fits best on hazard-stacking teams, it works especially well with defensive Stealth Rock setters like Tyranitar and Necrozma-DM. Although Ferrothorn can punish switches through various ways, it is also fairly passive, so it has a tendency to invite dangerous Pokemon into battle, such as Zacian-C, Yveltal, and Eternatus. Thus, pairing it with a strong defensive backbone consisting of the aforementioned Necrozma-DM, as well as the likes of specially defensive Ho-Oh and Tyranitar, is recommended. Ferrothorn struggles to break Substitute from Pokemon like Zygarde-C and Zekrom, so it appreciates teammates capable of handling those, such as Arceus-Ground. Dragon Dance Zygarde-C frequently forces switches through Dragon Tail, allowing it to rack up significant hazard damage on the opposing as a Ferrothorn partner. Zacian-C and Eternatus also enjoy Ferrothorn's support, as their checks often need to be at or close to full health to switch in safely. Pokemon such as Zacian-C, Mega Rayquaza and Yveltal can immediately threaten Defog Arceus formes and can force many switches to rack up Spikes damage, so they are also good teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  },
  "Zekrom": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Zekrom is a major threat to balance and stall teams in Anything Goes, as it's able to take advantage of common defensive Pokemon and lacks consistent defensive counterplay outside of Arceus-Ground and Lunala. Substitute allows Zekrom to safely set up on Pokemon that cannot break it in a single hit, including Ferrothorn, Ho-Oh, and Stealth Rock Necrozma-DM. It also prevents Choice Scarf users like Ditto and Mega Rayquaza from revenge killing it, eases prediction if the opponent tries to pivot around Zekrom's STAB moves, and stalls out foes' Dynamax turns. Outrage is needed for its high damage output, allowing Zekrom to OHKO base forme Zygarde at +1, although it has the detrimental side effect of locking Zekrom into the move if it doesn't Dynamax. Dragon Claw gives Zekrom a safer Dragon-type STAB move to use, but it's extremely weak and doesn't OHKO base forme Zygarde at +1 even when boosted by Life Orb; it also makes Ditto more dangerous, since it can Dynamax to break its Choice lock after it revenge kills Zekrom. A Jolly nature allows Zekrom to outspeed Zacian-C at +1 and Modest Xerneas and Yveltal unboosted. Leftovers increases the number of times Zekrom is able to use Substitute, helping it to break through foes like Ferrothorn more easily. Haban Berry is an option that lets Zekrom survive a boosted Outrage from Ditto while Dynamaxed, as well as Draco Meteor from Choice Scarf Mega Rayquaza and Dynamax Cannon from Eternatus, in order to KO these threats back; however, Leftovers is hard to give up, and a Ditto that's locked into Outrage is already easy to exploit with partners like Xerneas. Life Orb is another option that gives a nice boost to Zekrom's damage output, but it can severely hurt its longevity in tandem with Substitute. Teravolt notably allows Zekrom to bypass abilities like Multiscale, Sturdy, Unaware, and Wonder Guard, although it doesn't ignore Lunala's Shadow Shield.</p> <p>Zekrom has great Dynamaxing potential. Under Dynamax, Bolt Strike turns into Max Lightning, powering up Zekrom's Electric-type moves even further by setting Electric Terrain; Zekrom can potentially break past defensive Lunala with two boosted Max Lightnings if it manages to play around Will-O-Wisp correctly. Max Wyrmwind allows Zekrom to break through Ground-types without being forced to lock into a move; it 2HKOes Arceus-Ground and defensive Primal Groudon at +1. It also helpfully lowers Primal Groudon's Attack stat, rendering said foe unable to deal much damage to Zekrom when also accounting for the extra bulk from Dynamax. However, it's important to note that Dynamaxing will cause Zekrom to lose its Substitute, leaving it susceptible to revenge killing from the likes of Ditto. Also, Zekrom cannot Dynamax or change moves while it's locked into Outrage, so in the meantime, it can be taken advantage of by foes like Geomancy Xerneas.</p> <p>Zekrom fits best on bulky offense teams that can make up for the momentum loss it creates when it uses Outrage. Defensive Necrozma-DM is a strongly recommended partner, as it's able to handle Xerneas and Zacian-C if they try to take advantage of Zekrom while it's locked into the move. Ditto can also revenge kill these threats, but it needs prior chip damage on Xerneas to KO it, especially if Xerneas can still Dynamax. Ho-Oh is a fantastic teammate that shuts down Zekrom's most reliable checks in support Arceus-Ground and Lunala, while Zekrom can pressure teams with Zygarde-C for Ho-Oh. Similarly, Arceus-Ground checks Primal Groudon for Zekrom, while Zekrom can pressure teams with Ho-Oh for Arceus-Ground. Xerneas and Zacian-C are helpful partners to revenge kill opposing Ditto; if Ditto has locked into Outrage, it won't be able to Dynamax to break its Choice lock. Zacian-C can also weaken shared checks like Primal Groudon, Arceus-Ground, and Lunala for Zekrom. Yveltal is a strong offensive partner that can switch into Ground-type attacks and clean late-game once Zekrom has weakened the opposition.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": []}
  },
  "Xerneas": {
    "sets": [
      {
        "name": "Geomancy",
        "description": "<p>Xerneas shapes the metagame around it with its Geomancy set due to a good offensive typing, a potent ability, a wide offensive movepool, and most importantly, the option of breaking through its checks with Dynamax, which grants Xerneas additional bulk and power and an immunity to phazing. Geomancy turns Xerneas into an extremely powerful, fast, and bulky setup sweeper at the cost of its item slot. After Geomancy and the boost from Fairy Aura, Moonblast OHKOes everything that does not resist it apart from Dynamaxed Pokemon and extremely bulky Pokemon such as Chansey and Lunala with its Shadow Shield intact. Under Dynamax, Moonblast turns into Max Starfall, which breaks through otherwise very solid checks such as bulky Primal Groudon, while also granting Xerneas an immunity to status effects from the likes of Ho-Oh and Lugia. Thunder grants Xerneas access to Max Lightning, allowing it to always OHKO Ho-Oh. Notably, it also sets Electric Terrain, which allows Xerneas to OHKO Ho-Oh even after Dynamax ends. Substitute is the most versatile option for Xerneas, allowing it to set up on Knock Off Ferrothorn, defensive Zygarde and support Arceus formes once boosted. Most importantly, it allows Xerneas to waste Necrozma-DM's Dynamax turns, allowing Xerneas to overwhelm it once Necrozma-DM's Dynamax ends. Hidden Power Fire is another option, turning into Max Flare under Dynamax, which allows Xerneas to overpower Necrozma-DM and OHKO Zacian-C and Ferrothorn. Max Flare also sets up harsh sunlight, which notably allows Xerneas to 2HKO most Dynamaxed Necrozma-DM variants; however, be careful, as it also lowers Thunder's accuracy. Power Herb turns Geomancy into a one-turn setup move. The given spread allows Xerneas to hit as hard and fast as possible, notably allowing it to Speed tie with opposing Xerneas and Yveltal and outspeed +1 Ultra Necrozma and Choice Scarf Marshadow after using Geomancy. Alternatively, a 108 HP / 252 SpA / 148 Spe EV spread still lets Xerneas outspeed Choice Scarf Mega Rayquaza after using Geomancy, while also allowing it to live Yveltal's Max Airstream after Stealth Rock damage and slightly improving the matchup against Ditto.</p> <p>Xerneas fits best on balance, bulky offensive, and hyper offensive teams capable of providing it the support it needs to properly put itself into a winning position. On balance and bulky offense, Mega Gengar and Gothitelle are potent teammates, as they are able to trap the likes of Necrozma-DM, Chansey, Ho-Oh, and Ditto with careful prediction, facilitating Xerneas's sweep like no other partners can. Moreover, Xerneas and Mega Gengar can both force the opponent into using Dynamax prematurely for each other, which can facilitate either one of them in cleaning up. Zacian-C, Eternatus, Primal Groudon, and Primal Kyogre are also very notable for their ability to pressure Ho-Oh and Necrozma-DM, allowing Xerneas to clean up late-game. Strong wallbreakers that do not rely on Dynamax, such as Zacian-C, Dragon Dance Mega Rayquaza, and Mega Mewtwo Y, are good teammates, as they tend to force the opponent into using Dynamax in the endeavor to check them, which allows Xerneas to clean up without having to worry about it. Ditto can prove to be a nuisance against Xerneas. Therefore, Pokemon that can take its hits after it has transformed into Xerneas, such as Necrozma-DM, Ho-Oh, and Primal Groudon, as well as Pokemon that can beat it, such as Zygarde-C and Arceus-Ghost, are useful teammates. Defensive Zygarde-C is also notable for its ability to check the likes of Zacian-C lacking Play Rough, Necrozma-DM, Ho-Oh, and Primal Groudon, while also acting as a status absorber. On hyper offensive teams, leads such as Deoxys-S, Smeargle, and Grimmsnarl can provide entry hazard or dual screens support, helping Xerneas to pick up more KOs and easing its setup even further. All of them appreciate Xerneas's ability to pressure Defoggers such as Ho-Oh and support Arceus formes; Xerneas also has a good matchup against Yveltal and Mega Rayquaza, two notable threats to Sticky Web teams.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}]}], "writtenBy": [{"user_id": 360582, "username": "Guard"}]}
  },
  "Yveltal": {
    "sets": [
      {
        "name": "Life Orb (Dynamax Sweeper)",
        "description": "<p>Under Dynamax, Yveltal becomes the most potent wallbreaker and late-game cleaner in AG due to its incredible STAB and coverage options, ability to outspeed the entire unboosted metagame at +1, and solid bulk that allows it to beat Ditto one-on-one. Dark Pulse becomes Max Darkness under Dynamax, which lowers foes' Special Defense and 2HKOes almost everything that doesn't resist it. Oblivion Wing gives Yveltal a recovery option and boosts its Speed while it's Dynamaxed, allowing it to sweep weakened teams. Heat Wave targets Zacian-C, OHKOing said foe after some chip damage or if sun has been set by Max Flare, and also OHKOes Ferrothorn. Yveltal can utilize many options for its last move depending on the needs of its team. Rock Slide allows Yveltal to OHKO Ho-Oh, a common switch-in, with Max Rockfall or break through said foe without Dynamaxing after it switches into Dark Pulse. However, it does worsen Yveltal's matchup against Ditto. Knock Off provides great utility by removing key defensive items such as Heavy-Duty Boots and Leftovers, while hitting Chansey and Ho-Oh hard on their weaker Defense stats. Focus Blast removes Tyranitar, which otherwise walls Yveltal. Hidden Power Poison becomes Max Ooze under Dynamax, which boosts Yveltal's Special Attack and makes it even more difficult to defensively handle; however, Special Attack boosts make Yveltal more susceptible to revenge killing by Ditto. Taunt shuts down Pokemon like Chansey, Ho-Oh, and support Arceus formes after Yveltal has finished Dynamaxing, preventing them from using status options like Toxic, Defog, and recovery moves; however, the former two are already crippled by Knock Off. Sucker Punch can be useful to revenge kill boosted threats such as Ultra Necrozma, Dragon Dance Necrozma-DM, and Mewtwo, but the move rarely needs to be used after Yveltal uses Max Airstream. Life Orb gives Yveltal tremendous damage output under Dynamax, letting it break past even very bulky foes such as Ho-Oh and support Arceus formes with its STAB moves. A Rash nature should be used with Rock Slide or Knock Off to preserve their damage output while taking less damage from priority users and faster physical attackers like Choice Scarf Mega Rayquaza; otherwise, a Modest nature should be used.</p> <p>Yveltal fits on balance and hyper offense teams due to the support both archetypes can provide for it. Balance is able to deal with Yveltal's relatively few checks, while hyper offense allows Yveltal to clean up weakened opposing teams. Necrozma-DM is a great partner that can check Xerneas and Zacian-C along with support from the likes of Ho-Oh and Primal Groudon. Furthermore, Ho-Oh can provide Defog support, while Primal Groudon can check other dangerous threats such as Primal Kyogre and take advantage of Tyranitar. Zacian-C has fantastic offensive synergy with Yveltal, as the former can pressure special walls like Ho-Oh, Tyranitar, and Chansey, while the latter can easily take advantage of Primal Groudon and Necrozma-DM. Ditto is also an option to consider, as it's able to revenge kill Pokemon like Zacian-C and weakened Geomancy Xerneas.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>This Yveltal set is a non-Dynamax-reliant wallbreaker that aims to lure in and cripple usual checks to Yveltal. Knock Off is very spammable thanks to its high damage output, 2HKOing Ho-Oh and OHKOing Chansey, and offers great utility by removing key defensive items like Heavy-Duty Boots and Leftovers. U-turn deals hefty damage to Tyranitar, a usual switch-in to Yveltal, and allows it to pivot out of unfavorable matchups against Pokemon such as support Arceus formes and Zygarde-C. Sucker Punch gives Yveltal utility in revenge killing faster boosted threats such as Ultra Necrozma, Dragon Dance Necrozma-DM, and Mewtwo. Foul Play deals heavy damage to Zacian-C, preventing it from being a safe switch-in to this set; it also deals more damage to Primal Groudon, Primal Kyogre, and most Pokemon that have already had their items removed. An Adamant nature is preferred for maximum wallbreaking potential, but a Jolly nature can be used instead to always outspeed base 90 Speed Pokemon such as Primal Groudon, Primal Kyogre, and Zekrom.</p> <p>Choice Band Yveltal doesn't benefit that much from Dynamax; in fact, it can even lower Yveltal's damage output, so try not to use it unless you desperately need the bulk increase. It's a good idea to pair this set with a teammate that can really take advantage of Dynamax. For example, Xerneas benefits from this set pressuring Necrozma-DM and Chansey, while Mewtwo appreciates Yveltal pressuring Lunala and weakening Tyranitar so it can sweep. Because this set doesn't have a way to boost its Speed, it's more important to pair it with a solid defensive core that can check Zacian-C, consisting of the likes of Necrozma-DM, Primal Groudon, Ditto, and Ho-Oh. This set is walled by support Arceus formes and defensive Zygarde-C, so special wallbreakers like Primal Kyogre and Xerneas are good teammates because they can pressure these foes and get in safely with the assistance of U-turn. Pairing this set with a Stealth Rock setter that beats Ho-Oh, such as Stone Edge Primal Groudon, is a great way to pressure it, allowing teammates such as Dragon Dance + Morning Sun Necrozma-DM to potentially sweep once Ho-Oh's Heavy-Duty Boots has been removed and Stealth Rock is up on the opponent's side.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 444201, "username": "Kate"}]}
  },
  "Zygarde": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>This Zygarde-C set is very good against defensive teams, which usually include multiple passive Pokemon it can use as setup fodder. Substitute protects Zygarde-C from status moves such as Toxic and Leech Seed, letting it set up on most foes that can't break its Substitute and scouting for the foe prematurely Dynamaxing in an attempt to stop its sweep. Dragon Tail allows Zygarde-C to bypass usual means of counterplay to setup sweepers such as phazing and Defense-boosting moves from Pokemon like Ho-Oh and opposing Zygarde-C. Under Dynamax, Max Quake gives Zygarde-C Special Defense boosts and allows it to comfortably tank even super effective hits like Ice Beam from support Arceus formes. Max Wyrmwind allows Zygarde-C to hit Flying-types when it's Dynamaxed and severely damage or OHKO opposing Zygarde-C, Ditto, and Mega Rayquaza after boosts. 16 HP EVs are used to maximize Leftovers recovery, while 232 Speed EVs allow Zygarde-C to outspeed foes like Eternatus, Mega Gengar, and Adamant Zacian-C at +1. 36 Defense EVs with an Impish nature prevent Zygarde-C's Substitute from being broken by attacks like Ho-Oh's Brave Bird, defensive Necrozma-DM's Sunsteel Strike, and Ferrothorn's Gyro Ball in a single hit. The remaining EVs are put into Attack and greatly improve Zygarde-C's offensive presence, letting it 2HKO support Arceus formes with +2 Max Quake and usually OHKO Zacian-C with +1 Thousand Arrows. This set's EV spread is fairly customizable, and more EVs can be put into Attack, Defense, or Speed if desired at the cost of the other two stats.</p> <p>Ferrothorn is a great partner for this set, as it can check Primal Kyogre and support Arceus formes that threaten Zygarde-C, and it makes Dragon Tail more threatening thanks to the support it provides through Spikes and Knock Off. Necrozma-DM is also appreciated for its ability to handle Xerneas and Zacian-C, while Ho-Oh is able to handle support Arceus formes. This set shouldn't be used as a switch-in to Ho-Oh or defensive Necrozma-DM, as the lack of Rest means it won't appreciate status from Toxic or Sacred Fire or having its Leftovers removed by Knock Off. Instead, a partner that can absorb status and Knock Off from these foes such as Refresh Arceus-Water, Rest Primal Kyogre, or even defensive Zygarde-C is recommended. Mega Gengar and Gothitelle are good partners, as they can trap and remove Zygarde-C's checks such as support Arceus formes and opposing Zygarde-C with Haze; Mega Gengar can also force checkmate situations in which the opponent is forced to use their Dynamax, letting Zygarde-C sweep more easily after it Dynamaxes itself. Zacian-C and Eternatus are non-Dynamax-reliant wallbreakers that have good offensive synergy with Zygarde-C, as they can pressure support Arceus formes, while Zygarde-C can take advantage of foes like Ho-Oh, Necrozma-DM, and Tyranitar for them.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Defensive Zygarde-C is a premier wall in AG thanks to its ability to check the majority of physical attackers, including Primal Groudon, Ho-Oh, Necrozma-DM, Dragon Dance Mega Rayquaza, and Zacian-C lacking Play Rough. Rest is important to keep Zygarde-C healthy and remove status ailments such as Toxic poison from Ho-Oh, Primal Groudon, and Necrozma-DM. An anti-setup move is mandatory in order to check sweepers like Dragon Dance Necrozma-DM properly. Haze lets Zygarde-C check opposing Zygarde-C with Dragon Tail, avoid being setup fodder for special attackers like Geomancy Xerneas, and deal with Baton Pass strategies. Alternatively, Coil makes Zygarde-C more threatening offensively thanks to the Attack boosts it provides, but it makes this set setup fodder for opposing Dragon Dance Zygarde-C. Glare is a good option to cripple sweepers like Dragon Dance Necrozma-DM and annoy offensive checks like Xerneas and Primal Kyogre, preventing them from switching in freely. Dragon Tail in tandem with Coil allows Zygarde-C to set up on Ho-Oh and opposing Zygarde-C if they're slower or lack phazing moves and rack up entry hazard damage. However, it is not acceptable as the only move to deal with setup sweepers because Dynamax blocks phazing. Toxic is another option that pressures bulky foes like Ho-Oh more harshly than Glare, but makes it harder to force out Pokemon like defensive Necrozma-DM. Zygarde-C has good Dynamax potential; Max Quake lets it comfortably take even super effective special attacks such as Ice Beam from support Arceus formes and Moonblast from Xerneas. If running Dragon Tail, Max Wyrmwind lets Zygarde-C hit Flying-types while it's Dynamaxed and also OHKOes or severely dents Mega Rayquaza and opposing Zygarde-C after Coil boosts. 48 Speed EVs allow Zygarde-C to outspeed Zacian-C after paralysis from Glare or, if Dragon Tail is run, uninvested Ho-Oh so that Dragon Tail phazes Ho-Oh before it can phaze Zygarde-C with Whirlwind. Leftovers gives Zygarde-C passive recovery so that it does not need to use Rest as often. Safety Goggles can be used with Haze to safely switch into and remove stat boosts from sleep inducers such as Smeargle and Vivillon.</p> <p>Zygarde-C fits best on balance and bulky offense teams that appreciate its defensive utility as a status absorber and blanket check to physical attackers. The biggest threats to it are support Arceus formes with Ice Beam and strong special attackers such as Xerneas, Yveltal, and Primal Kyogre; therefore, checks to them like defensive Necrozma-DM, Ho-Oh, and Ferrothorn make for excellent teammates. Ferrothorn can also provide Spikes support to increase the effectiveness of Dragon Tail sets. Zacian-C with Play Rough is a notable physical attacker that Zygarde-C cannot handle, so teammates like defensive Necrozma-DM, Primal Groudon, and Ditto are great for their ability to check or revenge kill it. Mega Gengar and Gothitelle are good partners thanks to their ability to dispose of common checks to Zygarde-C like support Arceus formes and Ho-Oh. Because Zygarde-C is rather passive, wallbreakers like Zacian-C, Xerneas, Yveltal, and Primal Kyogre are good partners to pressure bulky teams. The former two can take advantage of Pokemon that must lock into Outrage to break past Zygarde-C, such as Mega Rayquaza, Ultra Necrozma, and Zekrom; Primal Kyogre appreciates paralysis support from Glare and Zygarde-C's ability to switch into the physical attackers that threaten it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 374620, "username": "pichus"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": []}
  },
  "Lunala": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Lunala is a potent wallbreaker in AG due to a good Special Attack stat, a strong STAB move, and multiple coverage options to severely dent several Pokemon that may try to pivot into it. Additionally, its typing and a phenomenal ability in Shadow Shield can allow it to be an emergency check to the likes of Dragon Dance Ultra Necrozma, Necrozma-DM, Mega Rayquaza, and Zygarde-C. Moongeist Beam has few resistances and therefore hits most Pokemon for a 2HKO, including most support Arceus formes. Focus Blast perfectly complements Moongeist Beam by severely crippling, if not outright OHKOing, Dark- and Normal-types such as Tyranitar, Arceus-Dark, and Arceus while also hitting Ferrothorn harder than Moongeist Beam. Ice Beam KOs Yveltal after Stealth Rock damage, OHKOs an untransformed Zygarde-C, and revenge kills a boosted Mega Rayquaza in a pinch after a Dragon Ascent Special Defense drop, if Shadow Shield is intact. Alternatively, Moonblast still hits the same benchmarks against Yveltal and Mega Rayquaza while also providing Lunala with a more reliable way to hit Dark-types than Focus Blast. Trick is the preferred option in the last moveslot, as it cripples Ho-Oh and Chansey beyond repair, one of which will often be the main Lunala counterplay on the foe's team. However, Trick is completely negated by common Pokemon such as Arceus formes, Primal Groudon, Primal Kyogre, Zacian-C, and Mega Evolutions bar Mega Rayquaza, so it should be used with care. Alternatively, Psyshock hits specially defensive Ho-Oh and Chansey harder than anything else. It also delivers a more reliable hit against Normal-types than Focus Blast and picks off a weakened boosted Xerneas, provided that Shadow Shield is intact. On the other hand, Thunder may be used in order to OHKO Yveltal on the switch in and hit physically defensive Ho-Oh, Arceus-Water, and Primal Kyogre harder than anything else. A Modest nature allows Lunala to always 2HKO support Arceus formes, 2HKO Ferrothorn with Moongeist Beam after Stealth Rock damage, and OHKO Yveltal with Thunder, Tyranitar with Focus Blast, and Necrozma-DM with Moongeist Beam after Stealth Rock. A Timid nature may be used in order to outspeed neutral-natured Yveltal and Xerneas, as well as Timid Kyogre. However, Timid Lunala misses out on the aforementioned benchmarks.</p> <p>Lunala fits best on bulky offense teams that enjoy its wallbreaking prowess as well as its ability to situationally revenge kill a plethora of setup sweepers in a pinch, such as Xerneas, Dragon Dance Mega Rayquaza, Necrozma-DM, Ultra Necrozma, various Swords Dance Arceus forms, Mega Mewtwo Y, and Zekrom. However, it can only perform such revenge kills if its Shadow Shield is unbroken, which makes Defog support from Ho-Oh or a support Arceus forme mandatory. Stealth Rock support from the likes of Necrozma-DM and Primal Groudon is handy as well, ensuring an OHKO on the likes of Yveltal and Mega Tyranitar and helping Timid Lunala hit important benchmarks that it would otherwise miss. As Lunala is a fairly prediction-reliant wallbreaker, it may situationally give dangerous Pokemon such as Yveltal, Zacian-C, and Primal Kyogre a free switch in, depending on the move it locks itself into. Thus, pairing it with a strong defensive backbone that can check these threats via the likes of Ho-Oh, Necrozma-DM, and Primal Groudon is a sensible choice. Sturdy checks to Yveltal such as Chansey, Tyranitar, Arceus-Dark, Arceus-Fairy, and Diancie are particularly important because Yveltal can come in rather freely on Lunala. However, be careful with Tyranitar, as its Sand Stream can waste Shadow Shield. Strong late-game cleaners that can take advantage of Lunala's wallbreaking prowess, such as Zacian-C, Yveltal, and Xerneas, are recommended teammates as well.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Lunala is a niche defensive Pokemon in the metagame thanks to its good bulk, great ability in Shadow Shield, and rare Psychic / Ghost typing, which allow it to check scary threats like Zacian-C lacking Assurance or Crunch, non-Choice Band Mega Rayquaza, and Dragon Dance Necrozma-DM, Ultra Necrozma, and Zekrom while being immune to trapping from Shadow Tag users such as Mega Gengar and Gothitelle. Moongeist Beam is Lunala's primary attacking move, hitting Necrozma-DM, Ultra Necrozma, and Mewtwo super effectively and having good overall neutral coverage. Hex is an alternative that has more PP and deals more damage to statused foes. Will-O-Wisp allows Lunala to cripple physical attackers like Zacian-C, Necrozma-DM, and Mega Rayquaza. Toxic allows Lunala to punish Ho-Oh, Yveltal, and Primal Kyogre, which could otherwise switch into it freely. Alternatively, Defog is an option to remove entry hazards, given Lunala's passable matchup against common setters like Primal Groudon and Necrozma-DM. Roar allows Lunala to phaze setup sweepers like Xerneas in a pinch if they haven't Dynamaxed and potentially rack up damage from entry hazards. Roost is essential to maintain Lunala's longevity and reactivate Shadow Shield. Maximum HP and Defense investment with a Bold nature gives Lunala the best chance of stalling Zacian-C out of Behemoth Blade PP by switching in and repeatedly using Roost, assuming said foe lacks Assurance and Crunch and is running a Jolly nature. Heavy-Duty Boots negates entry hazard damage, allowing Shadow Shield to stay intact without mandating additional Defog support from teammates.</p> <p>Lunala is very vulnerable to status from the likes of Ho-Oh and support Arceus formes, so status absorbers such as defensive Zygarde-C, Eternatus, and Refresh Arceus forms are good teammates. Yveltal is also very troublesome for Lunala, so Ho-Oh, Xerneas, Tyranitar, and Chansey are good partners, since they can pivot into it or Dynamax in order to revenge kill it; Chansey can also provide cleric support. Knock Off absorbers such as Primal Groudon and Primal Kyogre and, if Lunala is running Defog, checks to Xerneas such as Necrozma-DM are also very helpful teammates. Pokemon that are vulnerable to Zacian-C such as Eternatus and Mega Rayquaza really appreciate Lunala's ability to soft check it. Backup checks to Zacian-C like Necrozma-DM, Primal Groudon, and Ditto are suggested, as it can potentially break past Lunala with Assurance, Crunch, an Adamant nature, or high damage rolls.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 374620, "username": "pichus"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 464176, "username": "Icemaster"}, {"user_id": 426798, "username": "Geysers"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 360582, "username": "Guard"}]}
  },
  "Kartana": {"sets": [{"name": "Swords Dance"}]},
  "Necrozma-Dusk-Mane": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Necrozma-DM is one of the best defensive Pokemon in the AG metagame. Sporting well-rounded bulk, great typing, and useful support moves, it can be used as a semi-reliable check to Zacian-C and Xerneas. Sunsteel Strike deals hefty damage to Zacian-C and hits Xerneas super effectively. Under Dynamax, it becomes Max Steelspike, which boosts Necrozma-DM's Defense by one stage, turning it into an impenetrable physical wall that laughs at otherwise dangerous attacks such as Primal Groudon's Precipice Blades, Mega Rayquaza's V-create, and Ultra Necrozma's Earthquake. Morning Sun allows Necrozma-DM to consistently heal itself and be a reliable wall throughout the match. Stealth Rock increases Necrozma-DM's splashability even further by letting it offer additional role compression. Knock Off is excellent at reducing the effectiveness of defensive threats, such as by removing Leftovers from opposing Necrozma-DM, Zygarde-C, and Ferrothorn so that they have a harder time checking wallbreakers. Most importantly, it removes Heavy-Duty Boots from Ho-Oh, so that it becomes vulnerable to Stealth Rock. Toxic is an option over Stealth Rock or Knock Off to cripple foes such as Primal Groudon and Primal Kyogre that would otherwise fear nothing from Necrozma-DM. However, it fails to do anything meaningful to staples such as defensive Zygarde-C and Refresh support Arceus forms. Maximum Defense investment paired improves Necrozma-DM's chances of switching into Zacian-C multiple times throughout the match. Rocky Helmet is preferred in order to punish Zacian-C's Close Combat and deter Crunch variants, while preserving Morning Sun as Zacian-C will not be able to deal sustained attacks. Leftovers improves Necrozma-DM's chances of pivoting into non-Assurance Zacian-C multiple times throughout the match and reduces the number of times it must use Morning Sun. Heavy-Duty Boots is an option that grants Necrozma-DM the ability to consistently wall Assurance Zacian-C.</p> <p>Necrozma-DM is a fantastic Pokemon that fits very easily on balance and bulky offense teams. It is the best defensive Dynamax user: indeed, it can use its doubled HP to defeat powerful setup sweepers such as Swords Dance Zacian-C, Dragon Dance Mega Rayquaza, and Dragon Dance Ultra Necrozma. After +2 Xerneas has wasted a Dynamax turn, Necrozma-DM is able to beat it by Dynamaxing itself and using Max Guard once so that it is hit by one Max Flare only. With Toxic in its moveset, Necrozma-DM can also stall out Ho-Oh, for it is bulky enough and has enough Morning Sun PP to survive eight Sacred Fires, but getting burned may be unwise if it is needed to check a threat such as Zacian-C or Xerneas. Good teammates for Necrozma-DM include reliable checks to Primal Kyogre and Yveltal, since these two can OHKO it with their powerful STAB moves; thus, Primal Groudon and Xerneas make for good partners. Ho-Oh provides Necrozma-DM with Defog support for Assurance Zacian-C, as well as a backup pivot to it. It also provides a solid check to support Arceus-Ground, and a way of wasting Xerneas's and Yveltal's Dynamax turns. Tyranitar is a good teammate that can carry Stealth Rock, thus freeing up a moveslot on Necrozma-DM, and check Eternatus, most Yveltal variants, and non-Focus Blast Mega Gengar, although be careful, as Sand Stream lowers Morning Sun recovery. Zygarde-C and Arceus-Ground are noteworthy teammates that can reliably wall Primal Groudon for Necrozma-DM, and, in Zygarde-C's case, Assurance Zacian-C. Ditto can take advantage of sweepers that Necrozma-DM forces to set up in order to break past it, such as Swords Dance Zacian-C and Geomancy Xerneas. Finally, Zacian-C appreciates being paired with defensive Necrozma-DM, since the latter contributes to Imposter-proofing Zacian-C by walling all of +2 Ditto's moves except Close Combat and Crunch: thus, also having Ho-Oh or defensive Zygarde-C is an excellent way of fully protecting your team against Ditto.</p> "
      },
      {
        "name": "Dragon Dance (Dynamax Sweeper)",
        "description": "<p>This set is a great Dynamax sweeper that can set up on a wide array of Pokemon, such as defensive Necrozma-DM, Xerneas, and Eternatus, turning super effective hits to its advantage if it's holding Weakness Policy. Dragon Dance in tandem with a Jolly nature boosts Necrozma-DM's Speed to outpace every unboosted Pokemon up to and including Mega Mewtwo Y. Sunsteel Strike is a powerful STAB move that deals good damage to everything that doesn't resist it. Earthquake provides excellent coverage alongside Sunsteel Strike because it deals great damage to Steel-resistant Pokemon such as Primal Groudon, opposing Necrozma-DM, and Primal Kyogre. It also OHKOes Zacian-C after one Dragon Dance. At +1, Stone Edge OHKOes Ho-Oh, which otherwise walls Necrozma-DM, as well as Yveltal. Rock Blast is less powerful 50% of the time, but it is more accurate and more effective against Smeargle and Vivillon, and it has the same Max Move Base Power. Morning Sun enables Necrozma-DM to set up on passive foes like Ferrothorn, but it is most useful after Dynamaxing, since Necrozma-DM's doubled HP allows it to repeatedly select Dragon Dance and Morning Sun on weaker foes and eventually sweep the rest of the opposing team. On top of sharing excellent coverage type-wise, Sunsteel Strike and Earthquake turn into Max Steelspike and Max Quake during Dynamax, which boost Necrozma-DM's Defense and Special Defense by one stage, respectively, thus rendering it extremely bulky and powerful at the same time. This is why a Weakness Policy works wonders on this set, because the only way of KOing a healthy Necrozma-DM with boosted defenses is with super effective hits. Leftovers is an option to facilitate setting up, especially when paired with Morning Sun. Morning Sun sets can run a more defensive EV spread in order to consistently switch into threats like Zacian-C and Xerneas, allocating 36 EVs to Speed in order to outspeed Modest Yveltal at +1 and Mega Gengar at +2.</p> <p>Dragon Dance Necrozma-DM is best used on very offensive teams that can forgo its defensive potential as a wall but still appreciate its ability to soft check Zacian-C and Xerneas and use them as setup opportunities. In worst-case scenarios where Necrozma-DM can't afford to set up, it can also simply Dynamax to OHKO Zacian-C after said foe has used Close Combat and Xerneas after being hit by Max Flare, which will trigger Weakness Policy. On one hand, Necrozma-DM will usually want to Dynamax to effectively sweep teams, so keep this in mind when building a team, since having too many Dynamax-reliant Pokemon can prove to be troublesome. On the other hand, Necrozma-DM can sometimes sweep without Dynamaxing, so pairing it with another Dynamax sweeper like Xerneas might give you more flexibility in difficult match-ups for Necrozma-DM, for example against defensive Zygarde-C. If using Dynamax, Necrozma-DM is better used early-game as a wallbreaker that is able to severely dent teams and open up opportunities to clean for teammates like Rock Polish Primal Groudon, Dragon Dance Mega Rayquaza, and Zacian-C. If you decide not to Dynamax it, Necrozma-DM should be used late-game after another Dynamax user like Yveltal or Xerneas has wrecked havoc. Good teammates include Deoxys-S for Spikes support, Smeargle for Sticky Web support, and Grimmsnarl for dual screens support. Even though Necrozma-DM is quite Imposter-proof if healthy and under Dynamax, it is prone to being revenge killed by Ditto once Dynamax is over; thus, having a teammate to Imposter-proof it can be valuable. Zygarde-C is, therefore, a noteworthy teammate, as it is able to paralyze Ditto with Glare or phaze it with Dragon Tail, and can even set up on Ditto locked into Earthquake. It also covers Necrozma-DM's Fire-type weakness and can use Primal Groudon as a setup opportunity. Having a wallbreaker to pressure defensive Zygarde-C is important, since its stellar physical bulk and access to Coil and Haze allows it to wall Dragon Dance Necrozma-DM. Also, if Necrozma-DM isn't running a Rock-type move, having a wallbreaker that beats balance teams that typically use Ho-Oh is mandatory. Thus Xerneas, Yveltal, and Primal Kyogre make for good partners, as they are able to put immense pressure on the two aforementioned walls.</p> "
      },
      {
        "name": "Dragon Dance (Ultranecrozium Z)",
        "description": "<p>Dragon Dance increases Ultra Necrozma's Speed so that it outspeeds the entire unboosted metagame after a single boost. Photon Geyser is a powerful STAB move that is mandatory to activate Light That Burns the Sky, a nuke that OHKOes almost everything that doesn't resist it after a boost. This extremely powerful Z-Move also makes up for Ultra Necrozma's inability to Dynamax by dealing enough damage to KO weakened Dynamaxed foes. Earthquake is the main coverage option that makes great use of Neuroforce to hit foes like Primal Groudon and Necrozma-DM hard. Stone Edge is used to KO Yveltal, which is immune to the other two attacking moves, and Ho-Oh without wasting Ultra Necrozma's Z-Move. Alternatively, Rock Blast allows Ultra Necrozma to check Vivillon, deal more damage to Multiscale Lugia, and potentially KO Smeargle through Focus Sash. Outrage also hits Yveltal and Ho-Oh hard at the cost of locking Ultra Necrozma into the move for one or two more turns, potentially giving free setup to Xerneas. Outrage enables Ultra Necrozma to reliably beat Zygarde-C too. Another option is Knock Off, which massively damages Psychic-resistant Pokemon such as Lunala, Lugia, and Mewtwo; however, it leaves Ultra Necrozma more vulnerable to being revenge killed by Ditto. An Adamant nature lets Ultra Necrozma usually score the OHKO on defensive untransformed Zygarde with Light That Burns The Sky after one boost, as well as Primal Groudon with Earthquake after one boost and Stealth Rock damage. A Jolly nature makes Ultra Necrozma faster than Mega Rayquaza, Arceus formes, and Marshadow prior to boosting and Choice Scarf users like Mega Rayquaza and Marshadow at +1 Speed.</p> <p>Ultra Necrozma fits best onto hyper offensive teams as one of the best non-Dynamax sweepers. Its Necrozma-DM base forme is very useful to set up on foes like Zacian-C and opposing Necrozma-DM while bluffing the Dynamax variant. Ultra Necrozma is also easy to Imposter-proof, since Ditto can't Dynamax after copying Ultra Necrozma and needs it to be in KO range of Earthquake if it lacks Outrage, while a Ditto locked into Outrage is easily taken advantage of by Fairy-types like Zacian-C and Xerneas. Dynamax sweepers and wallbreakers are fantastic partners, since they appreciate Ultra Necrozma's ability to wallbreak and clean without using Dynamax. Mewtwo's Max Mindstorm-induced Psychic Terrain boosts Photon Geyser's power to sky-high levels, whereas Xerneas and Yveltal can be sent out after Ultra Necrozma has been revenge killed by Ditto; Xerneas can revenge kill Ditto or use Geomancy if Ditto is locked into Outrage, while Yveltal can switch in on a Ditto locked into Photon Geyser or Earthquake. Partners like Zacian-C and Eternatus that attract setup bait for Ultra Necrozma such as defensive Necrozma-DM and Zacian-C are good partners. Dual screens support from Grimmsnarl also helps hyper offensive teams, which like to run Ultra Necrozma. Do note that using this Necrozma forme leaves the team extremely weak to Xerneas, so Ultra Necrozma should generally not be used outside of hyper offense.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}]}], "writtenBy": [{"user_id": 286018, "username": "Ktütverde"}]}
  },
  "Marshadow": {"sets": [{"name": "Choice Band"}, {"name": "Bulk Up"}]},
  "Grimmsnarl": {
    "sets": [
      {
        "name": "Dual Screens Setter",
        "description": "<p>Grimmsnarl is a niche pick on hyper offense teams due to its access to Prankster and utility options, such as dual screens, Taunt, and Thunder Wave. Thanks to Prankster, it can use a priority Taunt to prevent Defog and opposing Taunt, thereby keeping up Reflect, Light Screen, and any potential entry hazards. Prankster also prevents setup from sweepers, such as Geomancy from Xerneas, and Dragon Dance from Mega Rayquaza. Thunder Wave allows Grimmsnarl to cripple fast foes such as Zacian-C, which can then be exploited by Grimmsnarl’s teammates. A Bold nature along with maximum EV investment in both HP and Defense allow Grimmsnarl to tank hits better, thereby maximizing the chance that it can set both Reflect and Light Screen.</p> <p>Grimmsnarl is only usable on hyper offensive archetypes. Suicide leads, such as Deoxys-S and Excadrill, appreciate Grimmsnarl’s priority Taunt to prevent Defoggers, such as Ho-Oh, from removing the entry hazards they set up. General Pokemon that fit on hyper offense like Zacian-C, Mega Rayquaza, Weakness Policy Necrozma-DM, Primal Groudon, Ultra Necrozma, Yveltal, and Xerneas, appreciate both dual screens and Thunder Wave in order to ease setup. Dual screens is also valuable, as it improves offense's matchup against Ditto. Since Taunt still won’t stop spinners such as Excadrill and Smeargle from removing entry hazards set by Grimmsnarl’s teammates, pair Grimmsnarl with Ghost-types such as Arceus-Ghost in order to spinblock.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}], "writtenBy": [{"user_id": 506687, "username": "ImperialGamer517"}]}
  },
  "Zacian": {"sets": [{"name": "Choice Scarf"}, {"name": "Swords Dance"}]},
  "Zacian-Crowned": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Zacian-C is one of the top threats in Anything Goes, boasting an insanely high Attack stat, nearly unrivaled Speed, a brilliant typing and ability, and access to a plethora of coverage options that make it extremely difficult to handle offensively and defensively. Behemoth Blade is the preferred STAB move, since it's stronger and 100% accurate and deals more damage to Dynamaxed Pokemon than Play Rough. Wild Charge is essential coverage for targets like defensive Ho-Oh, Arceus-Water, and Primal Kyogre that resist Behemoth Blade. Close Combat destroys Ferrothorn and heavily dents Necrozma-DM and Primal Groudon, two of Zacian-C's best switch-ins. Swords Dance allows Zacian-C to sweep once the opposition is weakened and revenge killers like Ditto have been eliminated, while also forcing the Dynamax from Necrozma-DM in order to beat it. Assurance along with Close Combat takes out Necrozma-DM on the switch after Stealth Rock damage. Crunch is an option over Assurance in order to still pressure Necrozma-DM when entry hazards are not present. Although Crunch hits said foe for the same damage as Close Combat, it has a chance of a Defense drop and doesn't lower Zacian-C's own defenses, which can be vital in preventing Necrozma-DM from reliably switching in to Zacian-C multiple times. It also targets defensive Lunala harder than Assurance and lets Zacian-C avoid a mind game with Ultra Necrozma. Substitute may be used to ease prediction against common counterplay to Zacian-C, and works particularly well due to Zacian-C's tendency to force a plethora of switches. Notably, it also shields Zacian-C from Ditto. Protect is useful for scouting Ditto and stalling out foes' Dynamax turns. Play Rough can be used in the fourth moveslot to break through defensive Zygarde-C, which checks Zacian-C otherwise. A Jolly nature is preferred with Swords Dance, as it can be used to Speed tie with opposing Zacian-C and outspeed Mega Mewtwo Y and +1 Necrozma-DM. Otherwise, an Adamant nature is preferred for the extra damage output, which notably allows Zacian-C to 2HKO defensive Arceus-Ground after little to no prior chip damage, and to put more pressure on Necrozma-DM.</p> <p>Ho-Oh is one of the best teammates for Zacian-C, as it checks Arceus-Ground and can scout Ditto fairly reliably. A good check to Primal Groudon like Arceus-Water, Arceus-Ground, defensive Zygarde-C, or Mega Rayquaza is appreciated, as it's one of the few Pokemon that can switch into Zacian-C and force it out. Wallbreakers like Primal Kyogre, Geomancy Xerneas, Mega Rayquaza, and Yveltal can help to break down checks like Necrozma-DM, Primal Groudon, Zygarde-C, and Ho-Oh, allowing Zacian-C to clean up late-game. Ferrothorn can switch into support Arceus formes and provide Spikes support, helping Zacian-C to pick up on more KOs. Ditto is Zacian-C's greatest nemesis, so setup sweepers that beat it like Yveltal, Arceus-Ghost, and Zygarde-C are appreciated, and cores that can pivot around a Ditto that has copied Zacian-C like Ho-Oh + Primal Groudon + Necrozma-DM are helpful.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 464176, "username": "Icemaster"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": []}
  },
  "Eternatus": {
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Eternatus is very difficult for a lot of balance and stall teams to deal with, owing to its great offensive presence paired with its colossal bulk, Toxic immunity, ability in Pressure, and access to reliable recovery. Dynamax Cannon is a powerful STAB move that 2HKOes most Pokemon that don't resist it and hits Dynamaxed Pokemon twice as hard. Flamethrower targets Steel-types such as Zacian-C, Necrozma-DM, and Ferrothorn that resist Eternatus's main STAB move. Sludge Bomb OHKOes Xerneas, preventing it from setting up on Eternatus, and has a significant chance to poison foes. Alternatively, Meteor Beam allows Eternatus to punish Ho-Oh seeking to pivot into it, while also making Eternatus progressively harder to deal with due to the Special Attack boost. Recover lets Eternatus offset Life Orb recoil and take advantage of most Pokemon that can't 2HKO it, including walls like Ho-Oh, Ferrothorn, and support Arceus formes besides Arceus-Ground. It's also useful in tandem with Pressure to quickly drain the PP of opposing Pokemon. Life Orb gives Eternatus maximum wallbreaking power, letting it 2HKO support Arceus formes and specially defensive Primal Groudon after a small amount of chip damage, for example. Alternatively, Power Herb may be chosen if Meteor Beam is used, to allow Eternatus to OHKO Ho-Oh without letting Ho-Oh switch out. Maximum Speed investment with a Timid nature is preferred to Speed tie with Mega Gengar and Mewtwo and to outspeed Ultra Necrozma and Arceus formes. Alternatively, a Modest nature may be used if these threats are covered elsewhere.</p> <p>Eternatus fits well on balance teams that appreciate the offensive and defensive utility it provides. Arceus-Ground is a good teammate that can check Primal Groudon for Eternatus, and in return, it appreciates Eternatus's offensive presence and ability to take advantage of Ho-Oh. Ho-Oh provides a check to Arceus-Ground for Eternatus, while Necrozma-DM paired with the likes of Ho-Oh and Primal Groudon can check Zacian-C. Necrozma-DM also covers Xerneas, which can be problematic for this set if it lacks Sludge Bomb. Ditto can revenge kill Zacian-C as well as many of the boosted threats that outspeed Eternatus. Zacian-C forms a formidable wallbreaking core with Eternatus, as the two are able to apply immense pressure to each other's checks.</p> "
      },
      {
        "name": "T-Killer (Specially Defensive)",
        "description": "<p>Defensive Eternatus is a resilient presence in National Dex AG thanks to its phenomenal bulk, good utility movepool, good ability in Pressure, and immunity to Toxic. These traits allow it to wall almost the entire defensive metagame, as well as Primal Kyogre, Calm Mind Arceus-Water, and Yveltal that has Dynamaxed. Toxic Spikes allows Eternatus to take advantage of passive Pokemon such as Ho-Oh, Necrozma-DM, and Ferrothorn, providing incredibly useful support by putting almost all grounded Pokemon on a timer. Moreover, the status ailment also forces Arceus formes into using Refresh and the likes of defensive Zygarde-C and Primal Groudon into using Rest, forcing the opponent to forfeit momentum. Eternatus notably walls every single relevant Defogger in the metagame, even being capable of outstalling Arceus-Ground's Judgment PP, which allows it to independently secure the entry hazard game in longer matches by stalling Defoggers out of Defog PP. Flamethrower lets Eternatus pressure Steel-types such as Ferrothorn and Necrozma-DM that could otherwise take advantage of it by setting entry hazards, while also deterring Zacian-C from switching into it. Toxic pressures and forces out Pokemon that could otherwise stay in indefinitely on it, such as non-Refresh Arceus formes and Ho-Oh, while also punishing switch-ins that could otherwise take advantage of it, such as Zygarde-C and Mega Rayquaza. Alternatively, Sludge Bomb allows Eternatus to punish Mega Rayquaza, Yveltal, Xerneas, and Mega Mewtwo Y more effectively if they try to switch in while still sporting a high chance to poison Ho-Oh and support Arceus formes. Black Sludge gives Eternatus a form of passive recovery, which helps it more reliably outlast Primal Kyogre and support Arceus-Ground. Alternatively, Firium Z can be used in order to OHKO Zacian-C as it uses Behemoth Blade or switches in. If Firium Z is used, the alternative EV spread of 192 HP / 76 SpA / 196 SpD / 44 Spe must be used to guarantee the OHKO on Zacian-C. Shed Shell can also be used in order to avoid trapping from Perish Song + Whirlpool support Arceus formes, Mega Gengar, and Gothitelle, allowing Eternatus to completely wall them. The given EV spread maximizes special bulk while outspeeding Primal Kyogre.</p> <p>Eternatus fits best on balance and bulky offense teams that appreciate a reliable check to Primal Kyogre and useful Toxic Spikes support for breakers. Pokemon like Mega Rayquaza, Dragon Dance Zygarde-C, Calm Mind Arceus formes, Primal Groudon, Primal Kyogre, and Yveltal especially appreciate Toxic Spikes, since their most common checks are grounded and will thus be on a timer from the moment they come in. Eternatus greatly appreciates a reliable check to Primal Groudon, especially Rest variants, which can otherwise threaten it with near-impunity. As such, defensive Zygarde-C and Arceus-Water both pair well with it. Eternatus is typically forced out by a wide range of offensive threats including Zacian-C, Mega Rayquaza, Xerneas, Dragon Dance Zygarde-C, Mega Mewtwo Y, opposing Life Orb Eternatus, Swords Dance Arceus-Ground, and the likes of Yveltal and Kyogre under Dynamax. A strong backbone that can cover these threats is therefore crucial. Necrozma-DM goes a long way in forming one by hard checking Zacian-C and soft checking Mega Rayquaza, Xerneas, and Mega Mewtwo Y. In return, it appreciates Eternatus's ability to PP stall Defoggers. The likes of Arceus-Fairy, Arceus-Dark, and Tyranitar are all capable of easing the matchup against both Mega Rayquaza and Yveltal, with the former two also checking Dragon Dance Zygarde-C and the latter taking care of Life Orb Eternatus. Lunala and Chansey are interesting options to consider as well; Lunala hard checks Mega Rayquaza, Dragon Dance Zygarde-C, Mega Mewtwo Y, and Swords Dance Arceus-Ground, while Thunder Wave Chansey limits Xerneas, Life Orb Eternatus, and Calm Mind Kyogre.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 374620, "username": "pichus"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 464176, "username": "Icemaster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  }
}