{
  "Charizard": {
    "comments": "<h1>Other Options</h1> <section><h1>Mega Charizard Y</h1> <p>Weather Ball is an interesting STAB move option, as it has slightly higher Base Power than Flamethrower and smacks Pelipper even in rain, although it's usually not worth the opportunity cost of not having a STAB move in rain or sand. Defog is an option, as Mega Charizard Y has a good matchup against common entry hazard setters like Ferrothorn and Heatran, but its extreme vulnerability to Stealth Rock along with it losing to hazard setters like Garchomp makes it an unreliable Defogger. It also dislikes giving up an important moveslot for it.</p> <h1>Mega Charizard X</h1> <p>On more offensive teams that do not require Mega Charizard X's longevity and defensive utility, you can remove Roost and use both Dragon Claw and Earthquake.</p> </section><h1>Checks and Counters</h1> <section><h1>Mega Charizard Y</h1> <p><strong>Stealth Rock: Stealth Rock halves Mega Charizard Y's health, severely limiting its ability to switch in and wallbreak. To add insult to injury, some Stealth Rock setters can even set the hazard up in front of it.</p> <p><strong>Blissey and Chansey</strong>: Blissey and Chansey are near impossible for Mega Charizard Y to break through due to their massive special bulk, and they can then proceed to either status it or pivot out to a dangerous teammate.</p> <p><strong>Dragon-types</strong>: Dragon-types like Mega Latios, Mega Latias, Hydreigon, and Garchomp are tough for Mega Charizard Y to deal with due to their resistance to Fire and Grass. The former two are particularly difficult to deal with due to their good bulk and access to recovery.</p> <p><strong>Opposing Weather: Tyranitar and Mega Tyranitar are huge threats to Mega Charizard Y, as they can switch in and override sun with sand to weaken its STAB move and force Solar Beam to charge, and they then proceed to either KO it with their Rock-type moves or damage it as it tries to switch out with Pursuit. However, they must watch out for Scorching Sands burns and the rare Focus Blast. Pelipper is similarly dangerous, as it can switch in on Mega Charizard Y, override sun with rain, and proceed to either KO it with its Water-type moves or pivot out to a dangerous teammate.</p> <p><strong>Toxapex: Toxapex resists Fire while not being weak to Solar Beam, letting it check Mega Charizard Y well although Scorching Sands and Future Sight support threaten it to a degree.</p> <p><strong>Revenge Killers</strong>: Faster Pokemon like Tapu Koko, Mega Lopunny, and Garchomp can revenge kill Mega Charizard Y; however, they, with the exception of Garchomp, cannot switch in on it at all.</p> <h1>Mega Charizard X</h1> <p><strong>Bulky Water-types: Physically bulky Water-types like Slowbro, Toxapex, and Tapu Fini can take Mega Charizard X's STAB moves with ease and pressure it with their own STAB moves, but they must watch out for the rare Thunder Punch and, in Toxapex's case, Earthquake. Toxapex can also be 2HKOed by +1 Dragon Claw into Earthquake, while Tapu Fini is 2HKOed by +1 Flare Blitz after some chip damage.</p> <p><strong>Ground-types: Landorus-T can weaken Mega Charizard X with Intimidate and threaten it with Earthquake, forcing it to switch. Hippowdon can switch in and force Mega Charizard X out with Earthquake or phaze it, removing its boosts. However, offensive variants of Landorus-T can be OHKOed by Flare Blitz after Stealth Rock, while defensive variants can be easily worn down due to their lack of recovery. Gliscor can also tank one boosted Flare Blitz if it is at full health and KO back with Earthquake in combination with recoil damage.</p> <p><strong>Rock-types: Tyranitar and Mega Diancie can switch in and KO Mega Charizard X with their Rock-type STAB moves, but they have to be careful about Earthquake.</p> <p><strong>Stealth Rock: Charizard's 4x weakness to Stealth Rock prior to Mega Evolving makes it difficult to switch in, and, after Mega Evolving, it gets crippled by all entry hazards.</p> <p><strong>Residual Damage</strong>: Entry hazard damage and Toxic from the likes of Toxapex and Heatran reduce Mega Charizard X's longevity, making it more susceptible to being revenge killed. Landorus-T's Rocky Helmet, Ferrothorn's Iron Barbs, Garchomp's Rough Skin, and Flare Blitz do the same. However, these Pokemon cannot switch in on Mega Charizard X's attacks, with the exception of Garchomp if is not running Dragon Claw.</p> <p><strong>Revenge Killers</strong>: Ash-Greninja's Water Shuriken, Mega Lopunny's and Mega Medicham's Fake Outs, and Choice Scarf users like Tapu Lele and Landorus-T can revenge kill Mega Charizard X if it gets chipped enough, but they cannot come in safely against its attacks and are outsped after a Dragon Dance.</p> </section>",
    "sets": [
      {
        "name": "Drought Attacker",
        "description": "<p>Mega Charizard Y is a ferocious wallbreaker in National Dex because of its sky high Special Attack stat, great ability in Drought, and passable Speed tier that lets it threaten much of the metagame. Drought sets Mega Charizard Y apart by boosting its Fire-type moves, weakening Water-type moves, ands also letting it use Solar Beam effectively, which makes it a Fire-type that is able to threaten out bulky Water-types such as Tapu Fini and Slowking. Mega Charizard Y's typing and access to Roost let it check Pokemon like Rillaboom and Mega Scizor reliably throughout a game . Flamethrower has perfect accuracy and high PP, but Fire Blast has explosive power, easily OHKOing Landorus-T and possibly Zapdos as well as 2HKOing offensive Garchomp. Solar Beam complements Mega Charizard Y's STAB move well, severely denting bulky Water-types like Tapu Fini and Slowbro that may try to switch in on Flamethrower or Fire Blast. Scorching Sands rounds off its coverage by OHKOing offensive Heatran while also 2HKOing physically defensive Toxapex after Stealth Rock, and its burn chance can ruin Tyranitar. Focus Blast is an option to replace Scorching Sands, notably hitting Tyranitar extremely hard while retaining the ability to smack Heatran. However, it has terrible accuracy and it also leaves Mega Charizard Y completely helpless against Toxapex without Future Sight support, so it is generally not advised. Roost lets Mega Charizard Y heal off residual damage and check Pokemon like Rillaboom throughout the game. A Timid nature is chosen to outspeed Pokemon like non-Choice Scarf Landorus-T, Hydreigon, and Tapu Lele.</p> <p>Mega Charizard Y absolutely hates Stealth Rock, as its health is halved by it, so good Defoggers like Corviknight, Zapdos, and Synthesis Kartana are absolutely mandatory partners for it. Blissey and Chansey are also huge thorns in Mega Charizard Y's side, as it cannot 2HKO them due to their massive special bulk, so Pokemon like Swords Dance Gliscor and Kartana that can take advantage of them are good partners. Heatran is also a good choice to trap and remove them. Pursuit trappers like Tyranitar, Weavile, and Aegislash can greatly pressure Mega Latias, which can potentially use Mega Charizard Y as setup fodder, and also force damage onto Blissey. Mega Charizard Y struggles with Toxapex, especially if running Focus Blast, so Slowbro and Slowking can pressure it with Future Sight and Pokemon like Tapu Koko and Heatran can beat it directly. Due to Mega Charizard Y's only passable Speed tier, it is prone to getting revenge killed by faster threats like Tapu Koko and Mega Lopunny, so pivots like the aforementioned Slowbro and Blissey can both switch in on these Pokemon and give it free switches via slow pivoting. Similarly, faster pivots like Tapu Koko can lure in bulky Grass-types like Ferrothorn that give Mega Charizard Y free turns while also helping wear down their shared checks, like Blissey. Due to how prolific Mega Charizard Y is as a wallbreaker, late-game cleaners Kartana make good partners for it, as it can break through their checks like Corviknight and Ferrothorn. Entry hazard support from the likes of Ferrothorn, Heatran, and Garchomp helps force damage onto Mega Charizard Y's checks, mainly Toxapex, as it can 2HKO it with Scorching Sands after Stealth Rock.</p> "
      },
      {
        "name": "Dragon Dance Sweeper",
        "description": "<p>Mega Charizard X is a dangerous wallbreaker and setup sweeper thanks to its near-unresisted STAB combination that is further boosted by Tough Claws and Dragon Dance. At +1, Mega Charizard X outspeeds Choice Scarf users below base 100 Speed such as Landorus-T and Tapu Lele. Its typing lets it switch in on and force out common Steel- and Grass-types such as Corviknight, Mega Scizor, Ferrothorn, Tangrowth, and Rillaboom, granting it setup opportunities. Flare Blitz deals serious damage to common Ground-types such as Gliscor and Landorus-T. Dragon Claw is preferable in the second moveslot to not be walled by other Dragon-types such as Garchomp and Mega Latias. However, this leaves it walled by Heatran and more easily checked by Mega Diancie and Tyranitar. Earthquake provides a way to hit Toxapex, and Steel-types weak to it such as Excadrill and Magnezone without taking recoil from Flare Blitz, while also OHKOing Heatran and Mega Diancie after a Dragon Dance and 2HKOing Mega Tyranitar after Stealth Rock. Thunder Punch could be used to hit bulky Water-types such as Slowbro, Tapu Fini, and Pelipper more effectively, but it gives worse neutral coverage. Roost recovers HP lost from Flare Blitz recoil and residual damage, letting Mega Charizard X check Grass-types like Rillaboom more easily. A Jolly nature is better to outspeed Pokemon below base 100 Speed like Landorus-T, Tapu Lele, Hydreigon and Kyurem.</p> <p>Mega Charizard X functions as a early- or mid-game wallbreaker that can take advantage of Steel- and Grass-types such as Corviknight, Mega Scizor, Tangrowth, Amoonguss, and Ferrothorn, which benefits Pokemon like Rillaboom, Tapu Lele, Kartana, and Tapu Koko. In return, they can pressure some of its checks like Slowbro, Tapu Fini, Toxapex, Tyranitar, and Mega Diancie. Due to Charizard's 4x weakness to Stealth Rock prior to Mega Evolving, entry hazard removers such as Zapdos, Corviknight, and Tapu Fini are mandatory partners. Tapu Fini can also protect Mega Charizard X from status through Misty Terrain, giving it more opportunities to setup Dragon Dance. Stealth Rock setters like Garchomp, Clefable, and Gliscor chip some of boosted Mega Charizard X's answers; offensive Landorus-T turns from a decent check to a likely OHKO, Toxapex becomes a likely 2HKO, and Tapu Fini becomes a guaranteed 2HKO. Garchomp can also break through Landorus-T and Gliscor with its Z-Move to help Mega Charizard X sweep. Due to its Ground weakness after Mega Evolving, checks to Ground-types like Rillaboom, Tangrowth, and Corviknight make good teammates, with the latter also providing Defog support and Rillaboom pressuring common checks like Tapu Fini, Landorus-T, Gliscor, and Slowbro. It's important to note that Rillaboom's and Tapu Fini's terrains make Earthquake and Dragon Claw too weak to use, respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Mega Charizard Y analysis by", "members": [{"user_id": 521275, "username": "The Dragon Master"}]}, {"name": "Mega Charizard X analysis by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Quality checked by", "members": [{"user_id": 487629, "username": "Zneon"}, {"user_id": 475916, "username": "Sputnik"}, {"user_id": 491200, "username": "Light Sanctity"}, {"user_id": 521275, "username": "The Dragon Master"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 521275, "username": "The Dragon Master"}]}
  },
  "Clefable": {
    "comments": "<h1>Other Options</h1> <p>Utility and Calm Mind Clefable can use an EV spread of 252 HP / 160 Def / 96 SpD with a Calm nature to survive a +2 Tectonic Rage from Nasty Plot Hydreigon, but it loses the ability to comfortably check Mega Lopunny, making this spread somewhat undesirable. Wish can be used on utility sets to give Pokemon that lack reliable recovery such as Heatran and Ferrothorn tons of needed support; however, Wish sets are extremely passive and easy for Pokemon to overwhelm. A Clefable set using Moonblast / Wish / Protect / Teleport makes it even easier to pass Wishes; unfortunately, it's very easy for Clefable to get overwhelmed by a plethora of dangerous Pokemon such as Mega Scizor, Landorus-T, Rillaboom, and Tapu Lele, which can make it hard to pass Wish and keep Clefable healthy at the same time. Ice Beam can be used on Calm Mind Clefable to always KO Landorus-T and especially Gliscor, but it loses the ability to hit Heatran and Mega Scizor for neutral damage.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-types such as Mega Scizor, Melmetal, and Mega Mawile all pose threats to Clefable because they resist Moonblast and can easily overwhelm it. However, they are all very susceptible to Calm Mind Clefable with Flamethrower.</p> <p><strong>Fire-types: Fire-types such as Heatran, Volcarona, and Mega Charizard Y are very good checks to Clefable; their STAB attacks are able to overwhelm and force Clefable to recover multiple times versus them. However, none of them want to be hit by Knock Off or Thunder Wave.</p> <p><strong>Strong Attackers: Clefable's average bulk can leave it easily overwhelmed by neutral hits and attackers such as Choice Specs Tapu Lele, Tapu Koko, and Kyurem; however, they all lack longevity, meaning that Clefable can outlast them.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Clefable is one of the best wincons in National Dex due to its large movepool, great defensive typing, passable bulk, and especially amazing ability in Magic Guard, which allows Clefable to find many setup opportunities against some of the best Pokemon in the metagame, such as Slowbro, Corviknight, and Zapdos. Calm Mind makes it an extremely potent Pokemon against bulky teams that do not have a way of preventing it from setting up freely. Thunder is largely preferred over Thunderbolt because of its extremely high paralysis chance, letting Clefable cripple Pokemon such as Heatran, and its ability to easily 2HKO Toxapex without any Calm Mind boosts. Alternatively, Flamethrower hits Steel-types that annoy Clefable like Excadrill, Mega Mawile, Melmetal, and Mega Scizor, but Clefable's easily walled by Heatran and Toxapex without Thunder. A Bold nature is preferred so Clefable can more easily check Pokemon such as Mega Lopunny and Mega Latias.</p> <p>Calm Mind Clefable best fits on balance teams, as its defensive utility is very helpful there. Pokemon that struggle a lot with Kyurem and Mega Latias such as Heatran, Blissey, and Zapdos appreciate Clefable's ability to check them. Calm Mind Clefable can struggle quite a lot to beat Fire- and Steel-types such as Heatran, Volcarona, Mega Mawile, and Mega Scizor, and they can limit its opportunities to set up Calm Mind; as such, checks to them such as Toxapex, Heatran, Slowking, Landorus-T, and Garchomp work as excellent teammates. Spikes support from Ferrothorn is very important for Clefable, as it wears down Toxapex and Heatran, two of Clefable's most prominent answers.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>Clefable is an outstanding utility Pokemon due to its amazing defensive typing, decent bulk, and ability in Magic Guard, allowing it to check dangerous Pokemon such as Mega Lopunny, Kommo-o, Hawlucha, Garchomp, and Kyurem while not fearing passive damage. Stealth Rock is a great option for Clefable because it can cripple entry hazard removers such as Zapdos and Corviknight with its utility moves and be relatively unaffected by them in return. Knock Off allows Clefable to cripple a vast majority of Pokemon, such as Zapdos, Ferrothorn, opposing Clefable, and Heatran. Alternatively, Thunder Wave provides speed control and still lets Clefable cripple Pokemon that want to switch in, such as Mega Scizor and Heatran. Calm Mind is a much more niche option that can be used to make Clefable a much bigger threat and potential wincon while also allowing it to threaten Defoggers such as Zapdos and Tapu Fini more effectively to keep Stealth Rock up. A Bold nature allows Clefable to more easily check Mega Lopunny and Garchomp, which it would otherwise struggle with, but special investment can be useful in checking Kyurem.</p> <p>Clefable is a staple on balance teams due to its unrivalled utility and great role compression. Clefable can cripple Pokemon like Corviknight, Ferrothorn, Heatran, Toxapex, and Zapdos with Thunder Wave and Knock Off, supporting Pokemon like Volcarona, Rillaboom, Kartana, Mega Mawile, and Weavile. Although it has decent bulk, Clefable can be easily overwhelmed by Pokemon such as Heatran, Mega Mawile, and Mega Scizor, so checks such as Slowking, Heatran, and Zapdos are great teammates. Pokemon that heavily struggle versus Mega Lopunny and Garchomp such as Kyurem, Mega Mawile, and Heatran enjoy Clefable's ability to easily check them. Clefable appreciates Water-type checks such as Toxapex and Ferrothorn, as they allow it to more easily check Ash-Greninja, while Clefable's Dark-type resistance can be very helpful for the aforementioned Pokemon in keeping Ash-Greninja in check.</p> "
      },
      {
        "name": "Unaware",
        "description": "<p>Unaware Clefable is a very important part of stall teams, as its Fairy typing alongside its large movepool allows it to support its team in many ways, mainly comfortably checking prominent setup sweepers such as Garchomp, opposing Clefable, Mega Gyarados, Hydreigon, Hawlucha, and Volcarona. Calm Mind allows Clefable to be a potential wincon for stall teams. Flamethrower allows Clefable to hit Pokemon that resist Moonblast such as Mega Scizor, Ferrothorn, and Corviknight very hard. However, it can be replaced by Heal Bell, which makes Clefable very self sufficient and lets it support teammates such as Bulk Up Corviknight and Alomomola. Wish can also be considered, as Clefable's great defensive typing and decent bulk grant it opportunities to pass Wishes to another teammate. However, it's generally worse than Alomomola because its ability, bulk, and typing give it more opportunities to pass Wishes.</p> <p>Unaware Clefable fits exclusively on stall teams, as its ability to shut down sweepers is very valuable and prevents these teams from being overwhelmed as easily. Mega Sableye and Corviknight are very important partners, as Unaware Clefable is vulnerable to both entry hazards and especially Toxic, which Mega Sableye and Corviknight are able to deter. Bulk Up Corviknight in particular is notable, as it can PP stall Toxapex's Haze with Pressure, allowing Calm Mind Clefable to more easily break past it late-game. Chansey and Alomomola are great partners for Clefable because they can free up more important moves for it; for example, Chansey can run Heal Bell for it and Alomomola can run Wish.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 483087, "username": "Aurodian"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 487629, "username": "Zneon"}]}
  },
  "Alakazam": {
    "comments": "<h1>Other Options</h1> <p>Alakazam may use Recover over Shadow Ball, which gives it a lot of longevity, but it loses its ability to hit its most important targets in Tapu Lele, Aegislash, and Mega Latias. Alakazam can utilize Counter with Focus Sash to punish faster Pokemon and priority users such as Rillaboom, Landorus-T, and Victini.</p> <h1>Checks and Counters</h1> <p><strong>Priority: Due to Alakazam's horrible defenses, it is very vulnerable to priority moves from the likes of Rillaboom, Aegislash, and Mega Scizor; however, they cannot revenge kill Alakazam if it still has its Focus Sash intact. Rillaboom in particular can remove Psychic Terrain for its own terrain, allowing it to use its priority without struggle, but it doesn't want to switch in.</p> <p><strong>Faster Pokemon: Pokemon that are faster than Alakazam naturally, such as Greninja, Tapu Koko, and Mega Lopunny, can be huge roadblocks for it. Mega Lopunny in particular is a terrible matchup for Alakazam, as it can break Focus Sash with Fake Out before finishing it off.</p> <p><strong>Paralysis: Alakazam is extremely crippled by paralysis, as it makes it even easier to overwhelm and revenge kill; as such, Pokemon that can spread paralysis such as Serperior and Clefable can be annoying for it. However, none of them want to switch in, especially after Nasty Plot.</p> <p><strong>Steel-types: While most Steel-types are threatened by Focus Blast, ones that are not such as Mega Scizor and Jirachi can be a pain for Alakazam to handle. Either listed Steel-type can often outspeed it with priority or a Choice Scarf, respectively, and knock it out. However, while Mega Scizor can handle Alakazam's moves fine, Jirachi cannot switch into Shadow Ball.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Alakazam stands as a potent setup sweeper due to its high Speed, coverage options, access to Nasty Plot, and amazing ability in Magic Guard. However, it is a very niche pick due to its extreme frailty, which leaves it helpless against Choice Scarf users, priority, and faster Pokemon once its Focus Sash is broken. Its frailty also means it cannot switch in at all without taking a large amount of damage. Psychic can overwhelm Pokemon that Psyshock cannot, such as Clefable, Landorus-T, and Garchomp; however, Psyshock can be used over it to more consistently deal with Blissey and Chansey. Focus Blast allows Alakazam to blow past Pokemon such as Ferrothorn, Heatran, Corviknight, and especially Tyranitar and Mega Tyranitar, which can otherwise wall it and Pursuit trap it. Shadow Ball hits Pokemon that resist the other two moves, most notably Tapu Lele, Aegislash, and Mega Latias. Focus Sash lets Alakazam more easily set up and revenge kill faster Pokemon or priority users, which would otherwise KO Alakazam due to its frailty, and it cannot be broken by entry hazards or weather chip damage due to Magic Guard. However, Life Orb can be used over Focus Sash to more easily overwhelm Pokemon such as Clefable, Corviknight, and Mega Scizor; however, this set is very susceptible to being revenge killed.</p> <p>Alakazam fits primarily on bulky offense teams, as its high Speed and great Special Attack allow it to sweep late-game for those teams. Mega Tyranitar is a great partner for Alakazam, as it can Pursuit trap Slowking, Aegislash, and Mega Latias, which can all break Alakazam's Focus Sash, leaving it unable to revenge kill Pokemon like Rillaboom. Ferrothorn's Spikes is very beneficial to Alakazam, as it can make Alakazam harder to pivot around and wear down Pokemon that it can struggle with, such as Ash-Greninja, Rillaboom, and Weavile. Tapu Lele is also a good partner for Alakazam, as its Psychic Terrain boosts Alakazam's STAB move to dangerous levels, allowing it to beat Pokemon such as Clefable and Gliscor after a Nasty Plot.Psychic Terrain also prevents Alakazam from being revenge killed by priority from the likes of Mega Mawile and Aegislash.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 517892, "username": "pannuracotta"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 487629, "username": "Zneon"}]}
  },
  "Slowbro": {
    "comments": "<h1>Other Options</h1> <p>Toxic may be run in order to directly cripple Mega Latias. Slowbro is usually better off pivoting into a teammate that can force Mega Latias out instead though, due to how hard it is to give up any of its main moves. Thunder Wave is another option, allowing Slowbro to provide valuable support to slower wallbreakers such as Mega Mawile and Mega Medicham. However, it too is incredibly hard to justify over the other options.</p> <h1>Checks and Counters</h1> <p><strong>Special Attackers: Slowbro's Special Defense leaves a lot to be desired. As such, specially oriented wallbreakers such as Ash-Greninja, Kyurem, Tapu Koko, and Mega Charizard Y easily force Slowbro out. However, none of them are capable of stopping Slowbro from gaining momentum with Teleport as they switch in.</p> <p><strong>Grass-types: Both Kartana and Rillaboom heavily threaten Slowbro with their STAB moves, and can use the forced switch as an opportunity to set up. They must watch out for a Scald burn, however, and cannot maintain a positive momentum trade if Slowbro uses Teleport as they switch in.</p> <p><strong>Knock Off: Knock Off users such as Clefable, Mega Scizor, and Ferrothorn remove a key part of Slowbro's potency as a pivot in Heavy-Duty Boots. This makes Slowbro prone to being overwhelmed more easily by forcing it to take entry hazard damage. Slowbronite variants are unbothered by this, however.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Slowbro is one of the best defensive pivots in the metagame due to its amazing physical bulk, Regenerator, and access to Teleport, allowing it to effectively check some of the metagame's most prominent threats such as Garchomp, Gliscor, Landorus-T, Excadrill, and Mega Lopunny. Future Sight allows Slowbro to create near-guaranteed advantageous situations for its team by providing a powerful delayed hit. This enables wallbreaking teammates to make more progress due to Future Sight by either discouraging their checks from switching in or letting them break through their checks anyway if these checks do switch in. Ice Beam can be run over Scald, allowing Slowbro to force out Garchomp, Gliscor, and Landorus-T while also threatening Pokemon not too bothered by Scald such as Zapdos and Tangrowth. Teleport allows Slowbro to use Pokemon that don't threaten it much, such as Mega Latias and Gliscor, for momentum, letting it bring in a check or a revenge killer for those Pokemon. Heavy-Duty Boots is the preferred item, as it strengthens Slowbro's niche as a pivot and maximizes the effectiveness of Regenerator by negating entry hazard damage. Rocky Helmet is an alternative option to punish U-turn users such as Mega Lopunny and Victini. Slowbronite can be used for significantly improved physical bulk and Special Attack; however, be mindful of Slowbro losing Regenerator after Mega Evolving, which makes it a less effective defensive pivot.</p> <p>Slowbro mainly fits on bulky offense and balance teams, on which it can act as an amazing defensive pivot for teams that are weak to threats like Mega Lopunny, Gliscor, and Garchomp. On bulky offense teams, Blissey has great defensive synergy with Slowbro, covering up Slowbro's weaker Special Defense stat by checking some of the most dangerous special attackers in Calm Mind Clefable, Ash-Greninja, and Kyurem. Moreover, with access to Teleport, Blissey also forms a strong pivoting core with Slowbro. On more balanced teams, other specially defensive Pokemon such as Heatran, Clefable, and Ferrothorn can provide similar support. Wallbreakers highly benefit from Slowbro's presence, as they appreciate the momentum it can bring to teams with Teleport. Mega Mawile, Mega Medicham, and Kyurem are great examples of Pokemon that benefit from Slowbro's support. If running Future Sight, Pokemon that appreciate the likes of Toxapex, Tangrowth, Zapdos, and Clefable being pressured are great teammates as well. Examples of such Pokemon include Weavile, Mega Lopunny, Kartana, and Mega Charizard Y. The former three are also capable of providing speed control against various Pokemon Slowbro might pivot out of, such as Calm Mind Mega Latias and Clefable.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Updated by", "members": [{"user_id": 360582, "username": "Guard"}]}, {"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 487629, "username": "Zneon"}]}
  },
  "Slowbro-Galar": {"sets": [{"name": "Calm Mind"}]},
  "Gengar": {
    "comments": "<h1>Other Options</h1> <p>Taunt is an alternative to Substitute to combat Haze users such as Toxapex, but, in most cases, Gengar freely attacking from its immunity to most status moves behind Substitute is sufficient. Sludge Wave as a secondary STAB move can be considered to hit super effectively against Grass- and Fairy-types like Tangrowth and Clefable, but +2 Shadow Ball and Focus Blast will hit hard enough by themselves and already provide perfect coverage.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Gengar’s poor bulk allows faster Pokemon such as Mega Lopunny, Greninja, and various Choice Scarf Pokemon like Landorus-T to take advantage of it, threatening to OHKO or massively damage it. However, these attempts to revenge kill Gengar are futile if it has a Substitute up when they come in.</p> <p><strong>Pursuit Trappers: Pursuit users like Weavile and Tyranitar can trap Gengar without a Substitute, although they can be played around if Gengar keeps a consistent Substitute up.</p> <p><strong>Strong Priority: Fake Out from Mega Lopunny, Grassy Glide from Rillaboom, Bullet Punch from Mega Scizor, and Shadow Sneak from Aegislash can hit Gengar hard or OHKO in the case of the latter, due to its frailty.</p> ",
    "sets": [
      {
        "name": "Ghostium Z",
        "description": "<p>Gengar is a fearsome wallbreaker thanks to its high Special Attack and Speed as well as access to Nasty Plot. Its immunity to Toxic and Seismic Toss also makes it a potent stallbreaker. Nasty Plot allows Gengar to deal massive damage with its attacks and open up holes for the rest of its teammates. When used with the Ghostium Z, Shadow Ball becomes a strong Never-Ending Nightmare that OHKOes key checks to Gengar, most notably Unaware Clefable, Landorus-T, and Garchomp after minor chip damage. Focus Blast is Gengar’s preferred coverage move to hit Pokemon that Shadow Ball cannot such as Chansey, Blissey, and Tyranitar. Substitute allows Gengar to freely fire off attacks or set up with Nasty Plot to pressure defensive Pokemon and exploit Pokemon that rely on status, like Thunder Wave Blissey and Sleep Powder Tangrowth.</p> <p>Gengar fits best on offensive and hyper offensive teams, as they allow Gengar to utilize its offensive prowess well. Due to Gengar's frailty, it is important to switch it in safely, so pivots such as Tapu Koko, Landorus-T, and Rillaboom are key teammates. Landorus-T can also provide entry hazard support for Gengar, helping it punish switch-ins and securing OHKOs on bulkier Pokemon like Garchomp, and gives it a crucial Ground immunity to switch into. Pursuit trappers like Weavile and Tyranitar threaten Gengar heavily, so it pairs well with Pokemon like Mega Lopunny that can take them on. Gengar also likes Mega Lopunny's ability to pressure and take out offensive Pokemon that threaten it like Garchomp and Greninja, and Gengar helps pressure Fairy-types in return. Setup sweepers like Mega Gyarados and Rillaboom appreciate Gengar’s ability to tear massive holes into teams for them to clean up, and, in turn, Gengar appreciates their ability to get rid of threats such as Tyranitar and Choice Scarf Landorus-T.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 541143, "username": "emillight"}]}
  },
  "Chansey": {
    "comments": "<h1>Other Options</h1> <p>Confide can be used to have a better matchup against some special stallbreakers like Tapu Lele, but it can be hard to fit, and lacks use in some matchups. Wish can be an option to heal teammates, but it can be hard to justify over its other moves. A pivot set involving Teleport could be used but is generally outclassed by Blissey because of its susceptibility to entry hazards.</p> <h1>Checks and Counters</h1> <p><strong>Physical Fighting-types: Physical Fighting-types like Mega Medicham, Mega Lopunny, and Hawlucha can easily break through Chansey thanks to their super effective STAB moves. However, they can't switch safely into Chansey, since they can be weakened by Toxic or Seismic Toss.</p> <p><strong>Losing Eviolite: Getting its Eviolite removed by opposing Knock Off or Trick can be a disaster for Chansey; without the added bulk, Chansey is way less capable of tanking hits, especially on the physical side, and is way more susceptible to be worn down by pivoting moves. It is even worse if it obtains a Choice item through Trick, since being locked into a move severely cripples it.</p> <p><strong>Ghost-types</strong>: The three Ghost-types of the tier, Aegislash, Gengar, and Mega Sableye, hard wall Chansey and can turn it easily into a setup fodder in Aegislash's and Gengar's case or cripple it with Knock Off in Mega Sableye's case. Aegislash can straight up KO it with Close Combat or outstall it with Toxic.</p> <p><strong>Physical Wallbreakers: Even though Chansey is quite bulky on the physical side thanks to the Eviolite, most physical wallbreakers such as Garchomp, Rillaboom, and Mega Mawile can easily break through Chansey, especially after a boost.</p> ",
    "sets": [
      {
        "name": "Pink Blob",
        "description": "<p>Chansey is a premier choice on stall teams thanks to its ability to take on most special attackers in the metagame such as Ash-Greninja, Mega Charizard Y, and Mega Latias, alongside its useful ability in Natural Cure allowing it to act as a status sponge for its teammates. Soft-Boiled is Chansey's best recovery option and is needed in order to check what it needs to over the course of the game. Seismic Toss lets Chansey deal consistent damage, allowing it to be less passive against Pokemon like Mega Charizard Y and Ash-Greninja. Toxic cripples most switch-ins, especially those that don't mind taking Seismic Toss much, such as Slowbro and Roost Mega Latias. Aromatherapy is an option if the team already has a Stealth Rock setter or doesn't need Toxic on Chansey to check the aforementioned threats, allowing Chansey to act as a cleric by removing status inflictions. The EV spread maximizes Chansey's physical bulk, allowing it to take less damage from Psyshock and Pursuit users, such as Tapu Lele and Weavile, respectively.</p> <p>Since Chansey's passivity limits it to stall teams, staples of this playstyle are naturally good partners. Skarmory and Corviknight have good defensive synergy with Chansey, as they are able to check the physical attackers that can threaten it, such as Mega Lopunny, Garchomp, and Mega Mawile. They can both remove entry hazards for Chansey or, in Skarmory's case, form an entry hazard stacking core with Spikes. In return, Chansey can check special attackers that force them out like Mega Charizard Y, Ash-Greninja, and Tapu Koko. It also can absorb Scald burns for them. Unaware users like Quagsire and Clefable enjoy the cleric and status absorber support Chansey provides to them, while they can check Pokemon that could try to turn Chansey into setup fodder like Gengar. They also appreciate Chansey wearing the opposing team down thanks to Toxic and Stealth Rock if they are running Curse or Calm Mind, respectively, allowing them to win late-game. Clefable also can free up a slot for Chansey by running Aromatherapy itself. Mega Sableye is also a good teammate for Chansey, since it is able to sponge Knock Off for it, bounce back Taunt and entry hazards, and check Mega Medicham, while Chansey can check certain specially offensive Pokemon that threaten Mega Sableye, such as Tapu Koko and Choice Specs Kyurem.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 491200, "username": "Light Sanctity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 476595, "username": "R8"}]}
  },
  "Pinsir": {
    "comments": "<h1>Other Options</h1> <p>Earthquake may seem nice to smack Steel-types without the Defense drop caused by Close Combat, but it leaves Mega Pinsir walled by Corviknight. Additionally, Stone Edge to take down Zapdos sounds interesting, but it is simply not better than any of the listed options and leaves Mega Pinsir walled by most Steel-types.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Zapdos, Rotom-W, and Tapu Koko all resist Mega Pinsir's STAB Frustration and threaten to deal heavy damage in return or, in the case of Rotom-W, threaten to cripple Mega Pinsir with Will-O-Wisp.</p> <p><strong>Physically Bulky Pokemon: Defensive behemoths such as Skarmory and Hippowdon can withstand Mega Pinsir's assault and can use this opportunity to set up entry hazards or Toxic poison it. Corviknight can stomach even boosted Close Combats and OHKO in return with Brave Bird after Mega Pinsir has dropped its Defense with Close Combat.</p> <p><strong>Revenge Killers: Faster Pokemon that are not weak to Quick Attack do well at revenge killing Mega Pinsir, such as Choice Scarf Landorus-T, Tapu Koko, and Zeraora. All of these Pokemon, especially Landorus-T, can be susceptible to boosted Quick Attacks after enough chip, though.</p> <p><strong>Stealth Rock: Mega Pinsir's crippling quadruple weakness to Stealth Rock greatly cuts into the number of times it is able to hit the field.</p> <p><strong>Faster Priority</strong>: Strong priority moves such as Fake Out from Mega Medicham and Mega Lopunny can wear down Mega Pinsir quickly. Ash-Greninja's Water Shuriken is also noteworthy, as it will go before Quick Attack.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Mega Pinsir is an effective wallbreaker on hyper offense teams but faces stiff competition from the likes of Mega Garchomp, Mega Scizor, Mega Gyarados, and Mega Charizard X. However, it retains a valuable niche in being able to revenge kill Pokemon like Mega Lopunny, Rillaboom, and Hawlucha, which are otherwise massive threats to hyper offense. Swords Dance coupled with Aerilate-boosted Frustration allows Mega Pinsir to break through bulkier foes such as Toxapex, Ferrothorn, and Mega Scizor. Close Combat tears through Heatran, Excadrill, and Melmetal while dealing significant damage to Corviknight. Quick Attack boosted by Aerilate can pick off common threats to hyper offense, such as Mega Lopunny, Hawlucha, and Rillaboom. Hyper Cutter is the chosen ability prior to Mega Evolution because it blocks Intimidate from Landorus-T.</p> <p>As Mega Pinsir is seen mainly on hyper offense, suicide leads such as Excadrill and Landorus-T are vital partners. Excadrill is especially good at this, as it can deny the opponent's Stealth Rock, which would otherwise cripple Mega Pinsir severely. Additionally, teammates that can weaken Zapdos, Corviknight, and Rotom-W are important, such as Gyarados, Garchomp, and Serperior. Mega Pinsir's ability to offensively check Mega Lopunny and Hawlucha, two common threats to hyper offense teams, is extremely valued by its teammates as well. Mega Pinsir also tears through bulkier balance Pokemon like Toxapex, Clefable, and Gliscor, which can be helpful for teammates such as Hawlucha and Kommo-o. In particular, Serperior appreciates the pressure that Mega Pinsir applies to Heatran and Corviknight.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 497633, "username": "Avery"}]}
  },
  "Gyarados": {"sets": [{"name": "Dragon Dance Sweeper"}]},
  "Ditto": {"sets": [{"name": "Choice Scarf"}]},
  "Zapdos": {"sets": [{"name": "Utility"}, {"name": "Offensive"}]},
  "Zapdos-Galar": {
    "comments": "<h1>Other Options</h1> <p>A Choice Band set using U-turn, Brave Bird, Close Combat, and Throat Chop may seem appealing due to its great immediate power, but it is easily exploitable by pivots like Slowbro, as it lacks longevity and is prediction reliant. Choice Scarf is also an option but is outclassed by Landorus-T due to its defensive capabilities.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types: Zapdos and Tapu Koko resist Galarian Zapdos's STAB moves and can proceed to KO it. However, Tapu Koko falls to +1 Supersonic Skystrike after Stealth Rock.</p> <p><strong>Aegislash: Aegislash either resists or is immune to Galarian Zapdos's STAB moves and can easily KO it with Shadow Ball, but it cannot use King's Shield to protect itself due to Defiant.</p> <p><strong>Bulky Water-types</strong>: Without its Z-Move, Galarian Zapdos struggles to break bulky Water-types like Slowbro and Toxapex. Both can also burn Galarian Zapdos with Scald, reducing its wallbreaking capabilities and making it easily exploitable by revenge killers. Also, without Taunt, Toxapex can use Haze to nullify Galarian Zapdos's boosts and Thunderous Kick's Defense drops. However, they must watch out for +1 Supersonic Skystrike.</p> <p><strong>Revenge Killers: Due to its average Speed, Galarian Zapdos is easily revenge killed by fast Pokemon like Ash-Greninja, Tapu Koko, Mega Lopunny, and Weavile. However, they are not safe switch-ins due to their low defenses.</p> ",
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Galarian Zapdos is a niche wallbreaker on hyper offense teams due to its great offensive typing, Defiant to punish Defoggers like Corviknight and Zapdos, and access to Thunderous Kick to soften foes. However, Galarian Zapdos faces stiff competition from other wallbreakers and sweepers like Mega Pinsir and Hawlucha, which have a better setup move in Swords Dance and better Speed. Additionally, as a Defog punisher, it's outclassed by Bisharp and Serperior, with the former having priority to deal with faster foes an the latter having better support moves and offensive utility. Bulk Up makes it difficult to revenge kill Galarian Zapdos with common priority moves like Mega Scizor's Bullet Punch and Mega Lopunny's Fake Out. Substitute ensures safe setup opportunities, while Taunt can be used to prevent Haze or Toxic from Toxapex and Whirlwind from Hippowdon. Thunderous Kick and Brave Bird provide great coverage only resisted by Zapdos, Tapu Koko, and Aegislash. Flyinium Z provides a strong Supersonic Skystrike that, at +1, ensures an OHKO on Tapu Fini, Clefable, Tapu Koko, and Toxapex, though the latter two need some chip damage to be OHKOed. A Jolly nature is preferred to outspeed Pokemon below base 100 Speed like Kyurem, Landorus-T, and Mega Garchomp.</p> <p>Galarian Zapdos fits best on hyper offense teams with teammates that appreciate a wallbreaker that can weaken Corviknight and Zapdos like Rillaboom and Mega Scizor. Entry hazard support from Landorus-T or Mew is vital for Galarian Zapdos to get important KOs against certain foes like Mega Scizor and Toxapex. Since Galarian Zapdos isn't very bulky, dual screens support from Grimmsnarl and Tapu Koko help it find setup opportunities. Zapdos is a big problem for Galarian Zapdos, so teammates that weaken or KO it like Mega Gyarados and Rillaboom are great teammates as well. Galarian Zapdos really appreciates Sticky Web support so it can outspeed revenge killers such as Ash-Greninja and Tapu Koko and punish Defog attempts from Corviknight and Zapdos; consequently, Shuckle is a phenomenal teammate, as it sets both Sticky Web and Stealth Rock.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 535121, "username": "Pubo"}]}
  },
  "Mew": {
    "comments": "<h1>Other Options</h1> <p>Flare Blitz can be great for preventing Excadrill from removing hazards through Rapid Spin while also helping Mew KO itself, but its use outside of pressuring Excadrill is pretty barren, making it a worse option than Explosion overall. Skill Swap can be used over Explosion to let Mew set entry hazards against Magic Bounce users such as Mega Sableye and Mega Diancie, although it's generally an extremely fringe option due to them being very uncommon. Focus Sash can be used over Red Card to guarantee one layer of hazards.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Pokemon such as Ash-Greninja, Mega Tyranitar, Tyranitar, and Weavile can all threaten Mew with their STAB moves, either taking it out or weakening it enough to prevent it from setting up more entry hazards. Greninja and Weavile are especially dangerous; the former can Dark Pulse flinch it, preventing Mew from setting entry hazards up altogether, while the latter can outright OHKO Mew with Knock Off.</p> <p><strong>Ghost-types: Mew can be KOed by Ghost-types such as Gengar and Aegislash from their powerful STAB moves, preventing it from setting entry hazards.</p> <p><strong>Fast wallbreakers: Pokemon that are strong enough to 2HKO Mew or use it as setup fodder such as Garchomp, Kartana, and Tapu Koko can limit Mew's ability to set entry hazards for its teammates.</p> ",
    "sets": [
      {
        "name": "Suicide Lead",
        "description": "<p>Mew is a very solid lead in National Dex OU due to its great Speed tier and access to Taunt and Explosion, allowing it to set up and keep up entry hazards consistently and effectively for hyper offensive teams while also preventing opposing hazard setters from setting up their own. Taunt combined with Mew's Speed tier consistently prevents Defoggers such as Corviknight and Zapdos from removing hazards and lets Mew retain a niche over Landorus-T even though Mew is generally overshadowed by it. Explosion allows Mew to take itself out in exchange for a heavy hit on a foe, generate momentum for its dangerous offensive teammates, and prevent Excadrill from removing hazards with Rapid Spin. Red Card synergizes great with Taunt to prevent setup sweepers from taking advantage of Mew and forces out strong attackers; both of these cases can provide Mew with more chances to set entry hazards. Mew typically fits on offensive teams as a suicide lead, as its ability to set up and keep up multiple layers of hazards allows its dangerous teammates to wreak havoc. Setup sweepers such as Mega Gyarados and Mega Garchomp as well as wallbreakers such as Tapu Koko and Rillaboom make great teammates as Mew's consistency in setting up hazards are very beneficial for these Pokemon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208105, "username": "Jho"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 487629, "username": "Zneon"}]}
  },
  "Scizor": {"sets": [{"name": "Curse"}]},
  "Shuckle": {
    "comments": "<h1>Other Options</h1> <p>Shuckle has no other viable options.</p> <h1>Checks and Counters</h1> <p><strong>Strong Wallbreakers</strong>: Shuckle, despite its good bulk, can be easily overwhelmed by a plethora of Pokemon such as Kartana, Mega Mawile, and Rillaboom.</p> <p><strong>Offensive Water-types: Offensive Water-types such as Ash-Greninja, Mega Swampert, and Manaphy can 2HKO Shuckle with their STAB moves, thus limiting it to one layer of hazards.</p> <p><strong>Substitute and Taunt: Substitute and Taunt users such as Serperior, Gengar, Tapu Fini, and Tapu Koko are very troublesome for Shuckle, as they can take advantage of it setting hazards or outright block hazards from Red Card sets; however, Shuckle can deal with them through Encore.</p> ",
    "sets": [
      {
        "name": "Sticky Web Setter",
        "description": "<p>Shuckle finds a niche in National Dex OU as a lead on Sticky Web teams due to its great bulk and Final Gambit alongside Encore, which provide momentum to its teammates with ease after it sets entry hazards. Encore is vital because it can lock foes into Defog or a stat-boosting move, such as Corviknight, Zapdos, Rillaboom, and Mega Garchomp, allowing Shuckle to more easily set up hazards while also making it easy for its teammates to revenge kill them. Mental Herb is the item of choice for Shuckle to securely set up at least one hazard, as it is very susceptible to Taunt from Pokemon such as Grimmsnarl, Tapu Koko, and Mew; however, that can be replaced with Red Card, which can force out strong attackers and disrupt U-turn and Volt Switch from Pokemon such as Tapu Koko, Rillaboom, and Landorus-T. Bisharp is an essential teammate for Shuckle, as Defiant helps it easily deter Defoggers such as Corviknight and Zapdos, and it's a very threatening wallbreaker and setup sweeper. Serperior's Contrary also pressures Defog. Shuckle's Sticky Web support heavily supports a multitude of slow yet powerful wallbreakers, such as Thundurus-T, Mega Scizor, and Mega Heracross.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 491200, "username": "Light Sanctity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 487629, "username": "Zneon"}]}
  },
  "Skarmory": {
    "comments": "<h1>Other Options</h1> <p>Toxic can be used over Iron Defense in order to wear down physical setup sweepers like Rillaboom and put common switch-ins like Tapu Koko, Zapdos, and Gastrodon on a timer, but Skarmory loses the ability to make Body Press stronger and now loses to Mega Mawile and Swords Dance Rillaboom. Shed Shell can be used to switch out against Magnezone but is not worthwhile due to its relatively high opportunity cost in exchange for fixing one matchup. A faster Skarmory spread of 252 HP / 72 Def / 184 Spe with a Bold nature allows it to outpace Magnezone and OHKO it after one Iron Defense with the cost of having less bulk.</p> <h1>Checks and Counters</h1> <p><strong>Strong Special Attacks: Pokemon like Tapu Koko, Mega Charizard Y, and Heatran can easily take care of Skarmory with their super effective attacks, and other strong special attackers like Greninja and Hydreigon can also easily take care of it. Magnezone is especially dangerous for Skarmory, as it can trap it and take care of it with Thunderbolt or gain momentum by using Volt Switch on it.</p> <p><strong>Ghost-types: Ghost-types like Gengar and Aegislash are immune to Body Press and therefore use Skarmory as setup fodder.</p> <p><strong>Taunt: Taunt shuts down Skarmory, as it cannot set up with Iron Defense, use Roost, or put down Spikes.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>With its sky-high Defense, solid defensive typing, and ability to lay Spikes, Skarmory makes a fantastic fit on balance and stall teams. Iron Defense allows Skarmory to handle Swords Dance Mega Mawile, Garchomp, Mega Garchomp, and Rillaboom better, and it makes Body Press hit harder. Spikes helps wear down the opposing team and makes it easier for Skarmory’s teammates to sweep. Rocky Helmet is used to get off damage against physical attackers like Mega Lopunny, Mega Mawile, Rillaboom, and Mega Swampert. Leftovers can be used over Rocky Helmet to give Skarmory passive recovery. 96 Speed EVs allow Skarmory to outpace Mega Mawile, allowing it to use Roost before the latter can hit it with Thunder Punch.</p> <p>Skarmory best fits on stall and balance teams. All teammates love Skarmory coming in on strong physical attacks from Weavile and Mega Lopunny and providing Spikes to wear down the opposing team. Chansey and Blissey are solid teammates for Skarmory, as they can come in on strong special attacks from Magnezone, Greninja, and Tapu Koko that Skarmory cannot tank, and in return, Skarmory can come in on Mega Lopunny and Mega Mawile's attacks for them. Clefable can check dangerous setup sweepers that threaten Skarmory like Mega Heracross and Mega Latias thanks to Unaware. Mega Sableye is great to pair with Skarmory due to Magic Bounce preventing Stealth Rock from wearing it down and Will-O-Wisp making physical attackers like Garchomp, Mega Scizor, and Kartana easier to handle. Alomomola can provide Wish support while also coming in on attacks from Mega Scizor, Mega Charizard X, and Victini that Skarmory struggles with, while in return Skarmory can come in on strong attacks from Rillaboom and Garchomp for it. Gastrodon is great to have a Manaphy check for the team, and it can also take care of Heatran, Magnezone, Manaphy, and Tapu Koko for Skarmory. Both Calm Mind Clefable and Reuniclus on balance teams love Skarmory for its Spikes support, which makes it easier for these two to set up and sweep. Ditto can revenge kill setup sweepers that Skamory cannot handle, such as Mega Heracross and Mega Charizard X, and trap and OHKO Magnezone with Hidden Power Ground.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 517892, "username": "Pannuracotta"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 393488, "username": "Yami"}]}
  },
  "Blissey": {
    "comments": "<h1>Other Options</h1> <p>Blissey can use Wish to pass its teammates enormous amounts of health, but Teleport and Wish are illegal together and it often isn't worth losing the positive benefits that Teleport provides.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types</strong>: Mega Medicham, Mega Lopunny, Hawlucha, and Mega Heracross are capable of threatening Blissey with their powerful STAB moves, although they should all be wary of switching directly into Blissey lest they take a status move on the switch.</p> <p><strong>Strong Physical Attackers: Mega Mawile, Landorus-T, Garchomp, and Excadrill are all capable of punching through Blissey with their powerful STAB moves. Many can also set up Swords Dance on Blissey, KOing it and potentially breaking even more after Blissey is dispatched.</p> <p><strong>Specialized Special Attackers: Certain special attackers can run sets that are often designed specifically to beat Blissey. Magic Guard users like Clefable, Reuniclus, and Alakazam are only afraid of Thunder Wave and use Toxic variants of Blissey as setup fodder. Heatran can employ sets utilizing Magma Storm, Taunt, and Toxic to trap and remove Blissey from the match completely. Gengar can set up Substitutes on Blissey that it is unable to break, therefore giving Gengar free setup. Calm Mind variants of Tapu Fini can set up for free on Blissey thanks to Taunt. Mega Latias and Tapu Lele can also run Psyshock as their Psychic STAB in order to deal more damage to Blissey, although they need to watch out for status moves.</p> <p><strong>Steel-types: Steel-types can set up on Toxic variants of Blissey easily and proceed from there. Mega Mawile, Kartana, Mega Scizor, and Aegislash take especially good advantage of this, while Corviknight and Skarmory are capable of directly pivoting into Toxic variants as well. Special mention goes to Excadrill, which is also immune to Thunder Wave and only fears chip from Seismic Toss.</p> ",
    "sets": [
      {
        "name": "Specially Defensive Pivot",
        "description": "<p>Blissey's enormous special bulk allows it to effectively take on most of the tier's many special attackers, with threats such as Ash-Greninja, Tapu Koko, and Mega Charizard Y all failing to break Blissey. Teleport allows it to safely pivot in teammates like Ash-Greninja, Mega Medicham, and Mega Mawile and take advantage of the many switches that it forces; Blissey's ability to viably hold Heavy-Duty Boots also makes it hard to wear down via entry hazards, unlike its pre-evolution Chansey. Toxic allows Blissey to chip away at threats such as Mega Latias, Slowbro, Landorus-T, and Zapdos. Targeting Mega Latias is especially important, as Blissey is one of the few Pokemon that can reliably come in on it and cripple it in the long term with Toxic. It must be noted, however, that Toxic forces Blissey to use Teleport more often, as it invites Steel-types like Mega Scizor, Corviknight, Aegislash, and Kartana to easily pivot in. Thunder Wave is another good choice for the last move, as it allows Blissey to effectively cripple offensive Pokemon like Mega Mawile and Kartana. It also gives Blissey a weapon against a couple of the select few special attackers that otherwise handily beat Blissey, such as Alakazam, Reuniclus, a reckless Gengar on the switch, and Calm Mind Clefable. Stealth Rock can be run over a status move if your team can't fit a Stealth Rock setter elsewhere, but Blissey is even more passive than normal without Toxic or Thunder Wave and can easily be taken advantage of by threats such as Mega Latias, Corviknight, and Aegislash.</p> <p>Blissey finds its home on balanced and bulky offensive teams. There it should be used to pivot into threats such as Heatran and Ash-Greninja and regain momentum with Teleport while also spreading status. Blissey really hates powerful physical attackers like Garchomp, Mega Lopunny, and Mega Medicham. A physically bulky partner is therefore appreciated. Slowbro and its Mega Evolution are very solid switch-ins to Fighting-type attacks, are capable of checking many of the tier's physical attackers, and can also form a very strong double Teleport core with Blissey. Corviknight effectively rounds out the Slowbro + Blissey core, taking on the likes of Kartana, Mega Scizor, Rillaboom, Weavile, and Mega Tyranitar, as well as offering Defog support and additional pivoting support with U-turn. Zapdos is another option that meets the previously mentioned positives bar checking Weavile and Mega Tyranitar, and it can also provide pivoting support with Volt Switch if desired. Toxapex can also handle Mega Lopunny and can beat other powerful physical attackers that Blissey dislikes like Mega Scizor and Mega Mawile. Blissey's Teleport makes it a very solid pivot, which is appreciated by Pokemon like Mega Medicham, Greninja, and Weavile. The latter two are also capable of revenge killing Gengar, a special attacker that completely shuts down Blissey, with Weavile in particular heavily limiting additional threats such as Mega Medicham with Pursuit. Physical walls, such as Landorus-T and Toxapex, appreciate Blissey taking on special attackers they can't handle, such as Ash-Greninja, Heatran, and Tapu Koko. Thunder Wave variants of Blissey can also be paired with slower wallbreakers that appreciate the paralysis support, such as Mega Mawile, Garchomp, Mega Medicham, Mega Charizard Y, and Mega Heracross. Toxic variants of Blissey dislike Steel-types, with Landorus-T, Victini, and Garchomp helping out in that category.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 475916, "username": "Sputnik"}]}
  },
  "Tyranitar": {
    "comments": "<h1>Other Options</h1> <p>A Jolly nature can be used to outspeed threats such as Rotom-W and Magnezone, but the lack of power is noticeable, as Tyranitar struggles to break the likes of Tangrowth and Alomomola.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Pokemon: Physically defensive Pokemon such as Hippowdon, Alomomola, and Landorus-T can all stomach multiple hits and recover the damage dealt or pivot out. Faster Skarmory sets are exceptional Tyranitar checks due to them switching in well, boosting Defense with Iron Defense with Iron Defense, and forcing it out with a boosted Body Press. Physically defensive Tangrowth also can switch into Tyranitar well to scout its move, and it can threaten it out with Sleep Powder, but it can easily lose if it is slightly chipped.</p> <p><strong>Faster Pokemon: Rillaboom, Ash-Greninja, and Landorus-T can all force Tyranitar out with ease due to its middling Speed tier, but they can‘t switch in reliably.</p> <p><strong>Status: If Tyranitar is burnt, it’s much easier to defensively check, and it gets worn down extremely quickly if it is poisoned. If it is paralyzed, it becomes much easier to threaten out.</p> <p><strong>Super Effective Coverage</strong>: Super effective coverage moves from the likes of Mega Latias, Mega Charizard Y, and Reuniclus can all threaten a KO on a slightly chipped Tyranitar, preventing it from Pursuit trapping them.</p> ",
    "sets": [
      {"name": "Stealth Rock"},
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Tyranitar is an obscenely strong wallbreaker, near-impossible to check defensively, sporting an amazing offensive typing alongside good bulk while sand is active. However, Tyranitar‘s middling Speed stat and poor defensive typing mean it struggles to come in and dish out multiple hits throughout the match. Stone Edge is Tyranitar’s main STAB move, being extremely hard to switch into due to its sheer power. Crunch is Tyranitar’s most spammable move due to the tiers‘s lack of sturdy Dark-resistant Pokemon, and it also KOes Pokemon like Mega Latias and Slowbro that can live a Stone Edge comfortably and retaliate. Pursuit lets Tyranitar trap Ghost- and Psychic-types that it forces out, such as Aegislash and Mega Latias. It can also trap Choice-locked Ash-Greninja, Tapu Lele, Chansey, and Zapdos, which otherwise can‘t threaten it back. Superpower lets Tyranitar immediately threaten a KO on Chansey, which can otherwise use Soft-boiled to scout its move, and also hits Ferrothorn and Heatran hard. Fire Punch OHKOes Mega Scizor and Ferrothorn without risking a Stone Edge miss or getting chipped multiple times by Iron Barbs. Earthquake lets Mega Tyranitar nail Heatran, Mega Mawile, and Magnezone without dropping its Attack and Defense, and it gives it near-perfect neutral coverage. The given EV spread allows Tyranitar to outspeed Adamant Mega Mawile, always live a +1 Bug Buzz from Volcarona, and always survive Choice Specs Tapu Lele Moonblast.</p> <p>Tyranitar fits best on bulky offense teams that appreciate it breaking holes in opposing teams and Pursuit trapping key threats such as Mega Latias and Reuniclus. It works best with partners that appreciate it Pursuit trapping their checks, such as Mega Charizard Y, Mega Latias, and Calm Mind Clefable. Teammates such as Amoonguss and Tapu Fini that can deal with pesky Water-types such as Ash Greninja and Rotom-W, help Tyranitar—so do Pokemon that can handle Grass-types like Rillaboom and Kartana, such as Corviknight and Tangrowth. Partners that can manage Fighting-types such as Mega Medicham and Mega Lopunny are also appreciated, so Clefable and Reuniclus are great with it. Skarmory and Mega Latias can deal with Ground-types such as Landorus-T and Garchomp. Excadrill benefits greatly from Tyranitar providing sand and wearing down the bulky Grass- and Flying-types that normally check it, such as Tangrowth, Corviknight, and Landorus-T. Teammates that can stack entry hazards such as Ferrothorn and Skarmory appreciate Tyranitar being great against the majority of the tier‘s hazard removal.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 517892, "username": "pannuracotta"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Swampert": {
    "comments": "<h1>Other Options</h1> <p>Superpower can be used in the last moveslot in order to eliminate Ferrothorn and Kyurem. Stealth Rock is another option, as Mega Swampert threatens the most common entry hazard removers such as Zapdos, Corviknight, and Excadrill when in rain. Bulk Up, while appealing, wastes valuable turns of rain while simply not being better than any other available option. Liquidation's slightly higher Base Power than Waterfall might also look appealing, but it doesn't improve any notable damage rolls, and Waterfall's chance to flinch is more useful overall.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Physically bulky Water-types such as Slowbro and Alomomola threaten out Mega Swampert due to the risk of a Scald burn. Rotom-W also forces out Mega Swampert with Will-O-Wisp while being immune or resistant to all of its STAB attacks. Toxapex cannot switch into Earthquake, but it can stomach an Earthquake from full health and threaten a Scald burn in return. However, Mega Swampert can use Flip Turn to bring in a teammate such as Manaphy or Zapdos to take advantage of these Pokemon.</p> <p><strong>Bulky Grass-types: Rocky Helmet Tangrowth and Mega Venusaur take minimal damage from Mega Swampert's attacks and threaten it back with an OHKO from Giga Drain. Ferrothorn also threatens Mega Swampert with Power Whip, but it is exploitable due to how easily Mega Swampert and its teammates can wear it down, and it fears Superpower.</p> <p><strong>Strong Priority: Priority moves bypass Mega Swampert's excellent Speed in rain. Rillaboom threatens to OHKO Mega Swampert with Grassy Glide, resists both of its STAB attacks, and is passively kept healthy due to Grassy Terrain, making it a very effective check. However, Rillaboom does have to beware catching an Ice Punch if it switches into Mega Swampert. Ash-Greninja can't switch in to Mega Swampert but threatens it with rain-boosted Water Shuriken. Other priority moves, such as Mega Lopunny and Mega Medicham's Fake Out and Mega Mawile's Sucker Punch, can wear Mega Swampert down quickly.</p> <p><strong>Faster Pokemon Outside of Rain: Mega Swampert's dependence on rain to outspeed the entire metagame can be exploited by Pokemon such as Kyurem, Ash-Greninja, and Mega Medicham when rain is not active. Mega Charizard Y deserves special mention, as it immediately removes rain while scaring out Mega Swampert with Solar Beam.</p> ",
    "sets": [
      {
        "name": "Rain Sweeper",
        "description": "<p>Mega Swampert is a mainstay on rain teams due to its ability upon Mega Evolution, Swift Swim, which allows it to outpace the entire unboosted metagame while rain is active. Mega Swampert's immunity to Electric is also very useful for rain teams, as they often consist of multiple Water-type Pokemon. Earthquake hits most common Pokemon resistant to Waterfall, such as Toxapex, Kartana, and Gastrodon. Ice Punch hammers Garchomp and Kommo-o while also scoring a 2HKO on Mega Latias after Stealth Rock damage. Flip Turn allows Mega Swampert to act as an offensive pivot against threatening Pokemon such as Tangrowth and Slowbro for teammates such as Zapdos and Manaphy to take advantage of them. Damp is the chosen ability prior to Mega Evolution to situationally block Landorus-T and Mew from using Explosion. A Jolly nature is preferred to Adamant to allow Mega Swampert to outpace Choice Scarf Kartana in rain.</p> <p>Due to Mega Swampert's dependence on rain in order to be an offensive threat, Pelipper is an absolute necessity. Additionally, due to its poor matchup against bulky Water-types such as Slowbro and Alomomola, teammates such as Ash-Greninja, Manaphy, and offensive Zapdos are important partners. Zapdos is an especially fantastic partner, as not only does it threaten Slowbro, Mega Venusaur, and Tangrowth for Mega Swampert, but it can also defensively handle Rillaboom. Mega Swampert also helps the aforementioned teammates punch through Gastrodon and Ferrothorn while being immune to the Electric-type attacks that they are commonly weak to. Finally, Ferrothorn is an especially nice partner, as it provides entry hazards to weaken Mega Swampert's checks while defensively answering Ash-Greninja and Kyurem.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 497633, "username": "Avery"}]}
  },
  "Pelipper": {
    "comments": "<h1>Other Options</h1> <p>Hurricane may seem more appealing than Scald, as it hits bulky Grass-type Pokemon like Tangrowth and Mega Venusaur that commonly annoy rain teams. However, losing the ability to punish switch-ins with potential burns from Scald can be detrimental.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types and Electric-type Attacks: Pelipper's quadruple weakness to Electric can be exploited by strong Electric-type attackers such as Tapu Koko, Magnezone, and Zeraora. Volt Switch users are also problematic, so Pelipper should be wary of Magearna, Rotom-W, and Zapdos.</p> <p><strong>Strong Special Attackers: Due to Pelipper's poor special bulk, it is often forced out by strong special attackers such as Tapu Lele, Ash-Greninja, and Serperior.</p> <p><strong>Changing the Weather: Mega Charizard Y and Tyranitar can remove Pelipper's rain, which is a huge detriment to Pelipper's team. Although Tyranitar cannot switch into Pelipper for fear of a Scald burn, Pelipper cannot switch into Tyranitar either.</p> ",
    "sets": [
      {
        "name": "Utility Rain Setter",
        "description": "<p>Pelipper, courtesy of its ability Drizzle, is a mainstay on rain teams. Summoning rain allows Pelipper to enable dangerous wallbreakers such as Ash-Greninja, Mega Swampert, and Manaphy. Pelipper's physical bulk, solid defensive typing, and access to Scald allow it to check dangerous Pokemon such as Mega Lopunny, Landorus-T, and Mega Scizor. Pelipper also is able to support its team rather well as a Defogger courtesy of Roost to remain healthy. U-turn allows Pelipper to pivot safely into its powerful teammates, which is incredibly important, as they generally do not want to take chip damage. Unfortunately, Pelipper is the only entry hazard removal that Zapdos rain teams have access to, meaning it often has to take Stealth Rock damage before using Defog. This can cut into its longevity, as Pelipper can be exploited on the turns it is using Roost by strong special attackers such as Tapu Koko and Tapu Lele.</p> <p>The ability to summon rain with Drizzle is incredibly important, as it enables several powerful walbreakers such as Mega Swampert, Ash-Greninja, Manaphy, and Zapdos. Mega Swampert is a particularly potent teammate, as not only is it enabled by Pelipper's Drizzle, but it is also a great check to strong Electric-type attackers such as Tapu Koko, Magnezone, and Zeraora. Ferrothorn is also a great teammate, as it can switch into Tapu Lele, Tapu Koko, and Magearna, all of which threaten Pelipper out. Rain also weakens Fire-type attacks, which Ferrothorn greatly appreciates. Ferrothorn can also use this as an opportunity to set Spikes for its teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 487629, "username": "Zneon"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 497633, "username": "Avery"}]}
  },
  "Gardevoir": {
    "overview": "<p>At first glance, Mega Gardevoir seems to be a solid wallbreaker, tearing apart bulkier teams with its high powered STAB attacks, as well as shutting down walls such as Chansey, Slowking, and Blissey with Taunt, thereby easily breezing past common defensive cores. However, Mega Gardevoir is thoroughly outclassed by Tapu Lele as a wallbreaker. Tapu Lele is much more useful in matchups outside of bulky teams while still maintaining the ability to tear down balance teams, has the ability to hold items to further increase its power, and boasts a stronger Psychic-type STAB attack under Psychic Terrain. Mega Gardevoir also is unable to outperform Clefable, Reuniclus, Tapu Fini, or Mega Latias as a Fairy- or Psychic-type Calm Mind sweeper, due to their respective individual advantages over it such as an immunity to damage from status, access to recovery options, or better bulk. There is generally no reason to use Mega Gardevoir over Tapu Lele or any of the aforementioned Pokemon at any time, as even the slight Speed tier increase isn’t worth it.</p> ",
    "sets": [
      {
        "name": "Taunt 3 Attacks",
        "description": "<p>Hyper Voice, after being boosted by Pixilate, provides Mega Gardevoir with a strong Fairy-type STAB option, demolishing even targets hit for neutral damage with ease. Psyshock lets Mega Gardevoir break past specially defensive walls such as Chansey and Blissey, as well as being a strong Psychic-type STAB attack to break past the likes of Toxapex, Galarian Slowking, and Amoonguss. Mystical Fire allows Mega Gardevoir to hit Steel-type Pokemon such as Ferrothorn, Mega Scizor, and Corviknight, which otherwise wall it. Focus Blast can be used to let Mega Gardevoir hit Heatran, which otherwise walls it; however, this choice leaves Mega Gardevoir struggling to break past Corviknight and Mega Scizor. Taunt is used to cripple Chansey, Blissey and Slowking by preventing their recovery, letting it break past these Pokemon, as well as preventing it from being statused, which can cut into its longevity and its nifty Speed tier. Trace is the chosen pre-Mega Evolution ability in order to potentially give Gardevoir a free switch in against the likes of Heatran or Gastrodon. Healing Wish and Will-O-Wisp can also be used to utilize Mega Gardevoir’s vast supportive options; however, running these moves severely limits Mega Gardevoir’s wallbreaking capabilities, and as a result it is greatly outperformed by Pokemon such as Clefable and Mew due to their superior recovery options and longevity. Pokemon that appreciate Mega Gardevoir wallbreaking early-game, such as Rillaboom and Bisharp, serve as great teammates. Mega Gardevoir should never be used on any serious team as the few advantages it has over its other competitors don't even come close to outweighing the cons. Teammates such as Volcarona and Manaphy who appreciate Blissey, Toxapex, and Chansey being broken down work well with it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 483087, "username": "Aurodian"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Shedinja": {
    "comments": "<h1>Other Options</h1> <p>Swords Dance sets, though they may seem appealing, are not ideal due to Shedinja's low Speed and how easily it can be played around. Poltergeist pressures Pokemon like Clefable and Manaphy, but has low PP and relies on the foe's item being intact. Shedinja's teammates, specifically Mega Sableye, Mega Scizor, and Weavile, commonly carry Knock Off, which causes Poltergeist to fail. Shadow Claw doesn't need items to be intact and also has more PP than Poltergeist, but it is incredibly weak and makes contact, meaning Shedinja is vulnerable to Rocky Helmet and Rough Skin damage. Shadow Sneak can pick off a weakened Gengar, but it otherwise does little damage and also triggers contact damage.</p> <h1>Checks and Counters</h1> <p><strong>Super Effective Coverage: Coverage moves from Pokemon Shedinja typically check can ruin it. Problematic sets include Hidden Power Fire Tapu Lele, Flamethrower Clefable, and Mystical Fire Mega Latias; however, Shedinja and its team can possibly scout for them.</p> <p><strong>Passive Damage: Any passive damage, such as sand, burn, and poison, will KO Shedinja. If Shedinja is using Shadow Sneak or Shadow Claw, it must be especially wary of Rough Skin, Iron Barbs, and Rocky Helmet damage.</p> <p><strong>Pursuit</strong>: Shedinja can be trapped and removed by Tyranitar, Weavile, and Mega Tyranitar, though they can all be burned by Will-O-Wisp on switch-in in order for Shedinja's team to deal with them more easily.</p> <p><strong>Mold Breaker: Mold Breaker ignores Wonder Guard, making Excadrill a very solid check to Shedinja. Excadrill cannot switch in though, as it fears being burned by Will-O-Wisp.</p> <p><strong>Trick: Jirachi and Victini can remove Shedinja's Heavy-Duty Boots with Trick, leaving it vulnerable to entry hazard damage.</p> ",
    "sets": [
      {
        "name": "Dual Status",
        "description": "<p>Shedinja's signature ability Wonder Guard etches it a niche, allowing it to wall common Pokemon that often threaten common stall teams, where it fits best. These Pokemon include Manaphy, Tapu Lele, Kyurem, non-Flamethrower Calm Mind Clefable, Kartana lacking Knock Off, and Thundurus-T. Toxic and Will-O-Wisp allow Shedinja to capitalize on the switches that it forces by crippling the incoming Pokemon. Will-O-Wisp cripples physical threats immune to Toxic such as Kartana and Mega Scizor. Hex synergizes well with Toxic and Will-O-Wisp; however, Shedinja has a paltry Special Attack stat, so even a boosted Hex will not be dealing too much damage. Protect can be used to scout for super effective coverage, such as Flamethrower on Clefable or Hidden Power Fire on Tapu Lele, as well as prolonging passive damage from Toxic poison and Will-O-Wisp burns. Heavy-Duty Boots stops entry hazards from KOing Shedinja. Minimum bulk investment is so Ditto copying Shedinja has as little bulk as possible, as Shedinja can only take one hit regardless.</p> <p>Due to its relative passivity, Shedinja is restricted to stall teams. It appreciates the entry hazard support from Chansey and Skarmory to wear down its foes faster in conjunction with its own status conditions. Pokemon such as Mega Sableye, Toxapex, Chansey, Clefable, and Alomomola all appreciate Shedinja's ability to switch into and ward off the threatening Manaphy, Tapu Lele, Reuniclus, and Kyurem. Also, since Shedinja is very vulnerable to being Pursuit trapped, its teams must play around opposing Weavile and Tyranitar via double switching. Skarmory, Melmetal, and Alomomola are teammates that can double switch into the aforementioned Pursuit trappers. Tyranitar in particular poses a huge threat, as Shedinja cannot come in while its summoned sand is active. Pokemon that absorb status such as burn and poison are vital, as these conditions will KO Shedinja. Chansey and Gliscor are exampes of solid status absorbers to pair with it. Gliscor is particularly helpful, as it can switch into the dangerous Heatran, which otherwise can switch into Shedinja freely. Gastrodon can help alleviate pressure from Heatran as well.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 497633, "username": "Avery"}]}
  },
  "Sableye": {
    "comments": "<h1>Other Options</h1> <p>More specially defensive spreads can be used for a better matchup against threats like Heatran and Ash-Greninja, but they are not particularly good against these Pokemon anyway, can be broken through by Mega Medicham in Electric Terrain, and have a worse matchup against offensive Stealth Rock setters like Garchomp and Landorus-T, and so are not advised. Snarl weakens special attackers such as Mega Charizard Y, Heatran, and Hydreigon that may try to take advantage of its passivity, but it is difficult to fit in its moveset and justify due to Knock Off's higher utility, particularly because Mega Sableye is commonly paired up with teammates that can deal with these special attackers like Gastrodon, Clefable, and Chansey. Calm Mind may seem appealing, but Mega Sableye is pitifully slow and very weak without boosts, and thus it gives many free turns to the opponent while setting up, so it's outclassed in this role by other Pokemon such as Clefable, Mega Latias, and Reuniclus. It also has to give up most of its utility to be a sweeper. Toxic can also be used to punish switch-inslike Mega Charizard Y and Hydreigon, but it is very difficult to fit, as its other moves offer much more utility.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Fairy-types like Tapu Lele, Tapu Koko, Mega Mawile, and Mega Diancie easily break through Mega Sableye, although Will-O-Wisp and Knock Off can cripple them and deter them from switching in directly, with Mega Mawile especially fearing Will-O-Wisp. Clefable and Mega Diancie are especially dangerous, as they are not affected by Will-O-Wisp, can shrug off Knock Off, and threaten Mega Sableye out with Moonblast.</p> <p><strong>Fire-types: Fire-types such as Heatran, Mega Charizard Y, and Volcarona are immune to Will-O-Wisp and can overwhelm Mega Sableye with their powerful attacks. Mega Charizard Y and Z-Move variants of Heatran and Volcarona in particular do not fear Knock Off, though Heavy-Duty Boots Volcarona and specially defensive Heatran lose a lot of longevity upon losing their items.</p> <p><strong>Powerful Wallbreakers: Despite Mega Sableye having good bulk, powerful wallbreakers such as Kyurem, Mega Charizard Y, and Ash-Greninja can easily break through it.</p> <p><strong>Substitute. Due to how weak its Knock Off is, Mega Sableye cannot do anything to Pokemon behind a Substitute such as Kyurem, Corviknight, and Mega Gyarados, and it will only serve as setup fodder for them.</p> ",
    "sets": [
      {
        "name": "Defensive Magic Bounce",
        "description": "<p>Mega Sableye is a staple on stall teams due to its good bulk, great movepool,and fantastic ability in Magic Bounce, which lets it deny entry hazards from various common hazard setters like Ferrothorn, defensive Landorus-T, Kommo-o, Toxapex, and Skarmory. Its typing and bulk also lets it check several dangerous threats, such as Mega Medicham and variants of Reuniclus and Mega Latias that use only Psychic- and Fighting-type coverage. Knock Off is used to remove Leftovers from key threats like specially defensive Heatran, Tapu Fini, and Corviknight. Will-O-Wisp burns physical attackers that may try to advantage of Mega Sableye, like Mega Mawile, Kartana, and Mega Garchomp, along with crippling Stealth Rock setters like Garchomp and Landorus-T, letting Mega Sableye keep Stealth Rock off the field. Protect lets Sableye safely Mega Evolve at any point in time while also scouting the intentions of Choice-locked threats like Tapu Koko, Tapu Lele, Ash-Greninja, and Kyurem. Prankster grants Sableye priority Will-O-Wisp and Recover before Mega Evolving, which can be used to burn and neutralize threats like Garchomp, Kartana, and offensive Landorus-T.</p> <p>Mega Sableye only fits on stall teams due to its immense passivity. All of Mega Sableye's teammates on stall appreciate it keeping entry hazards off the field against common hazard setters like Ferrothorn, Kommo-o, and defensive Landorus-T. However, Mega Sableye struggles to keep hazards off against some setters like Heatran, Mega Diancie, and Clefable, so good checks to these such as Gastrodon, Gliscor, and Unaware Clefable make for good partners for it. Specifically, Defoggers that can beat these such as Gliscor for Heatran, and Corviknight and Zapdos for Clefable, are excellent. Mega Sableye is very weak to Fairy-type Pokemon like Clefable, Tapu Lele, Mega Diancie, and Mega Mawile, so checks to those like Toxapex, Shedinja, Corviknight, Skarmory, and Unaware Clefable are great partners . Despite having good bulk, Mega Sableye is easily broken through by powerful wallbreakers such as Heatran, Kyurem, and Mega Charizard Y: good checks to these include Gliscor, Gastrodon, and Chansey. Finally, Mega Sableye appreciates hazard support from the likes of Chansey, Skarmory, and Toxapex to wear down the opposing team faster in conjunction with its own Knock Off and Will-O-Wisp. Magic Bounce lets its team stack hazards without worrying about opposing hazards, which could force a Defog that removes the team's own hazards.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 483087, "username": "Aurodian"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 521275, "username": "The Dragon Master"}]}
  },
  "Mawile": {"sets": [{"name": "Swords Dance"}, {"name": "All Out Attacker"}]},
  "Crawdaunt": {
    "comments": "<h1>Other Options</h1> <p>Dragon Dance can be used instead of Swords Dance to give Crawdaunt a chance to improve its middling Speed, but this set is largely outclassed, as you lose out on the extreme wallbreaking power Swords Dance provides, and the Speed isn’t enough to help it sweep without multiple boosts. Even then it is prone to revenge killing due to its pitiful bulk.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types</strong>: Bulky Grass-types such as Tangrowth, Tapu Bulu, and Mega Venusaur can switch into Crawdaunt’s moves with relative ease and force it out, and offensive Grass-Types such as Rillaboom, Kartana, and Serperior can all revenge kill Crawdaunt. Tapu Bulu is an exceptionally good check, as it is resistant to both of Crawdaunt’s STAB moves, has reliable recovery, and can run a Z-Crystal to negate the damage increase from Knock Off, while still outspeeding it with minimal investment to KO it.</p> <p><strong>Faster Pokemon: Generally the best way to deal with Crawdaunt is by forcing it out with a faster check such as Tapu Koko, Mega Lopunny, or Kyurem, as Crawdaunt lacks consistent defensive counterplay that don’t get shredded by its spammable STAB moves.</p> <p><strong>Hydreigon: Hydreigon is one of the few Pokemon that can switch into both of Crawdaunt‘s STAB moves and heal them off while also forcing Crawdaunt out.</p> <p><strong>Bulky Water-types</strong>: Pokemon such as Mega Gyarados and Tapu Fini can both switch into Crawdaunt‘s STAB moves and threaten it out with a burn or outright KO it; however, Tapu Fini hates losing its Leftovers, as it is its main form of recovery.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Crawdaunt is a potent wallbreaker, demolishing slower teams with Swords Dance and Adaptability while revenge killing faster Pokemon with a boosted Aqua Jet, as most teams lack a defensive answer to its power and STAB moves. It even eviscerates defensive Pokemon like Clefable, specially defensive Toxapex, and Ferrothorn. However, its middling Speed and bulk limit its switch-in opportunities. Knock Off is Crawdaunt’s most spammable move, letting it cripple switch-ins by removing their items and KOing the bulky Grass-types that attempt to tank a boosted hit. Crabhammer nets KOs on Dark-resistant Pokemon such as Clefable and Mega Tyranitar. Aqua Jet lets Crawdaunt pick off weakened foes, clean late-game, and revenge kill Pokemon like Volcarona and Mega Diancie that would otherwise end a sweep. Waterium Z is the preferred item, as it gives Crawdaunt a one-time nuke on many of its usual switch-ins and almost always KOes a neutral target, while Life Orb is a secondary option to pull off ridiculous feats such as OHKOing physically defensive Tangrowth and Toxapex after a boost.</p> <p>Crawdaunt fits on bulky offense teams that can safely bring it in multiple times throughout the match; it therefore appreciates slow pivoting from the likes of Corviknight, Slowbro, and Slowking. Reliable speed control such as Mega Lopunny complement this further by helping to deal with faster teams, while Crawdaunt shreds through bulkier teams for them. As Crawdaunt is prone to being revenge killed by even resisted and neutral hits due to its pitiful defences, a strong defensive core to fall back on complements it perfectly. Specifically, checks to offensive Grass-types such as Rillaboom, Kartana, and Serperior such as Corviknight and Zapdos deny these Pokemon a free boost or KO each time it comes in. Lastly, other wallbreakers such as Rillaboom and Tapu Koko work with it amazingly, softening up the opponent’s team early on for Crawdaunt to clean late-game.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Crawdaunt is one of the hardest Pokemon to switch into in the tier due to its enormous, Adaptability-boosted immediate power and nearly unresisted STAB combination. However, its middling Speed and bulk limit its ability to switch in. Aqua Jet is Crawdaunt’s main way of damaging faster foes that threaten to revenge kill it such as Mega Lopunny, Zeraora, and Tapu Koko, doing over half to all three of them. Knock Off synergizes well with Crabhammer due to most of the tier’s Dark-resistant Pokemon fearing Crabhammer, which is also Crawdaunt's hardest hitting move. Crunch is the usual fourth option for Choice Band Crawdaunt, as it provides a secondary STAB option if the target has already lost its item or uses a Mega Stone or Z-Crystal. Close Combat is an extremely niche option and is used for nailing Hydreigon, which can switch in to scout Crawdaunt’s move, and Ferrothorn.</p> <p>Crawdaunt fits perfectly on VoltTurn teams that can repeatedly bring it in to further pressure the opponent. A good defensive core that focuses on bringing Crawdaunt in is a must, with Pokemon such as Landorus-T, Corviknight, Slowbro, and Slowking as Crawdaunt is extremely susceptible to being revenge killed and is a huge momentum sink after getting a KO. Other than that, fast threats pair well with Crawdaunt such as Tapu Koko and Mega Lopunny, helping Crawdaunt pressure and soften up offensive teams for it to clean.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 521275, "username": "The Dragon Master"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 529732, "username": "adsam"}]}
  },
  "Latias": {
    "comments": "<h1>Other Options</h1> <p>Stored Power is an option to sweep teams more easily, as it's a very powerful STAB move once Mega Latias has fully boosted up, and is commonly used as the only attacking move so Mega Latias can use a utility move like Refresh to clear status or Reflect Type to beat Pokemon like Heatran, Mega Mawile, Ferrothorn, and Mega Scizor. However, only attacking with Stored Power lets Dark-types fully stop your progress, meaning Toxic Spikes support is a requirement; this set also needs multiple boosts to hit hard. Defog sets have a niche because of Mega Latias' great movepool allowing it to beat all of the Stealth Rock users in the tier while generally having a strong;- albeit somewhat passive;- defensive presence. This set cannot beat every Stealth Rock user in one set, but it's customizable on a team-by-team basis.</p> <h1>Checks and Counters</h1> <p><strong>Phazers and Status: Pokemon like Physically Defensive Toxapex, Blissey, Hippowdon, Skarmory, Clefable, and Melmetal can stop Mega Latias from sweeping with Haze, phazing, Toxic, or paralysis that makes it prone for revenge killing.</p> <p><strong>Steel-types: Mega Latias can't cover all Steel-types with one set. Aegislash, Mega Scizor, and Jirachi are solid checks to the Aura Sphere variant; meanwhile Heatran will completely wall the Mystical Fire set. Mega Mawile is also very good at revenge killing Mega Latias with either Sucker Punch or Play Rough.</p> <p><strong>Pursuit: Pokemon like Weavile, Mega Tyranitar, and Tyranitar can Pursuit trap Mega Latias if it is weak enough and they get a safe switch in; however, if Mega Latias is somewhat healthy, it can take a Pursuit and recover up with Roost or threaten a KO with Aura Sphere.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>With its amazing bulk, Roost, and immunity to the common Spikes and Toxic Spikes, Calm Mind Mega Latias is one of the best wincons in the tier. Psyshock is the preferred STAB option as it can hit opposing Calm Mind users and specially bulky Pokemon like Reuniclus, Clefable, Tapu Fini, Blissey, and Slowking as hard as possible. Aura Sphere beats many of the Dark- and Steel-types that resist Psyshock, like Heatran, Mega Tyranitar, Tyranitar, Ferrothorn, and Weavile. Mystical Fire is another solid option, since it hits Steel-types that aren't weak to Fighting like Mega Scizor, Aegislash, Mega Mawile, and Jirachi, but it importantly misses out on Heatran, Mega Tyranitar, and Tyranitar. BoltBeam is another option for the attacking moves, since it has super effective coverage against a majority of the tier, letting Mega Latias check offensive Ground-types like Gliscor, Garchomp, and Landorus-T, while also nailing Pokemon like Tapu Fini, Rillaboom, and Slowking. However, the lack of a STAB move and inability to beat Pokemon like Blissey and Chansey without Psyshock leaves this option as somewhat niche.</p> <p>Mega Latias appreciates teammates that help it sweep such as entry hazard setters like Clefable, Ferrothorn, Skarmory, Landorus-T, Heatran, and Toxapex, Toxapex deserves a special mention, as Toxic Spikes allows Mega Latias to outlast Pokemon like Tyranitar, Tapu Lele, and Ash-Greninja that could otherwise pose an issue; this also frees up its coverage moveslot for something like Refresh for better longevity. Pokemon that can threaten Steel-types, like Magnezone, Heatran, Skarmory, Gliscor, and Volcarona, make for valuable teammates. Lastly, status removers and absorbers like Blissey, Chansey, Clefable, and Gliscor help Mega Latias avoid being crippled and losing effectiveness.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511832, "username": "Optify"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Latios": {"sets": [{"name": "Mixed Attacker"}]},
  "Jirachi": {
    "comments": "<h1>Other Options</h1> <p>Fire Punch, Ice Punch, and Zen Headbutt can be run over Trick or Healing Wish on the Choice Scarf set, as they target Pokemon like Ferrothorn, Mega Scizor, Garchomp, and Toxapex, but sacrificing this utility in exchange for extra coverage is often not worth it. A specially defensive set with Iron Head / U-turn and two of Stealth Rock / Wish / Protect lets Jirachi act as a solid pivot that can provide Wish and Stealth Rock support while fulfilling an important defensive niche in checking Psychic- and Fairy-types.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Heatran, Mega Scizor, Aegislash, and Ferrothorn take very little damage from Jirachi’s Iron Head and U-turn. Mega Scizor, Firium Z Heatran, and Ghostium Z Aegislash are particularly dangerous, as they’re immune to Trick, while Ferrothorn can wear down Jirachi with Iron Barbs. However, specially defensive Heatran and Ferrothorn must be wary of Trick, as losing their Leftovers and being Choice-locked does them no favors.</p> <p><strong>Water-types: Toxapex and Slowbro don’t mind Iron Head and don’t even need to risk a flinch while healing thanks to Regenerator. In the meantime, both can burn Jirachi, Toxapex can remove its Choice Scarf with Knock Off, and Slowbro can set up Future Sight or Teleport out. Jirachi is able to Trick them, though.</p> <p><strong>Fire-types: Volcarona, Heatran and Mega Charizard Y easily stomach all of Jirachi’s attacks and hit back with their powerful STAB moves. All three can also avoid Trick provided the former two run a Z-Crystal.</p> <p><strong>Ground-types: Garchomp, defensive Landorus-T, and Gliscor are capable of switching into Jirachi and eliminating it with STAB Earthquake. The former two can wear down Jirachi with Rough Skin or Rocky Helmet, respectively, while Gliscor easily switches in thanks to Poison Heal and it not caring about Trick after its Toxic Orb has activated. Garchomp and Landorus-T need to be wary of Trick, however.</p> <p><strong>Electric-types: Most Electric-types easily switch into Jirachi thanks to their Steel resistance, and hit it hard with their STAB moves. Zapdos is especially troubling, as it has the potential to paralyze Jirachi with its ability, ruining its Speed. Magnezone can trap Jirachi locked into Iron Head and remove it with Thunderbolt. Rotom-W despises Trick, but it easily takes Iron Head and cripples Jirachi with Will-O-Wisp.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Jirachi is a solid Choice Scarf user due to its decent Speed and access to a reliable and disruptive move in Iron Head. On top of that, Jirachi boasts a good defensive typing and great utility in U-turn, Trick, and Healing Wish. Iron Head is Jirachi’s main tool to revenge kill numerous Pokemon in Tapu Lele, Weavile, and Mega Diancie. In conjunction with Serene Grace, Iron Head can situationally defeat a wide range of additional threats as well, including Mega Medicham, Mega Lopunny, and Tapu Koko. As Jirachi’s damage output is mediocre outside of Iron Head, the remaining three moves are dedicated to utility in order to make the best out of Jirachi’s solid defensive typing. U-turn allows Jirachi to capitalize on switch-ins and preserve momentum while letting its offensive teammates in for free. Healing Wish lets Jirachi completely heal a weakened teammate at the cost of sacrificing itself, offering offensive partners a second chance to break open or clean up the opponent’s team. Trick can allow Jirachi to cripple nearly every switch-in to it, as Toxapex, Ferrothorn, and Zapdos don’t like being locked into a move. Serene Grace gives Iron Head a 60% flinch chance, making it quite spammable against Pokemon that don’t resist Steel.</p> <p>Jirachi’s ability to fully heal a teammate is incredible for a number of offensive teammates, such as Mega Mawile, Garchomp, and Swords Dance Kartana. Its ability to cripple Pokemon like Toxapex, Heatran, and Slowbro with Trick and pivot out of them with U-turn is also fantastic for the aforementioned partners. Jirachi can act as a solid check to Fairy- and Psychic-types such as Clefable, Mega Diancie, and Tapu Lele, so Pokemon that may struggle with these threats like Mega Latias, Mega Medicham, and Mega Lopunny make good teammates. As Jirachi lacks the necessary longevity to continuously withstand these Fairy- and Psychic-types, additional soft checks such as Ferrothorn and Corviknight are advisable teammates. Jirachi cannot reliably revenge kill Pokemon like Kartana, Mega Scizor, and Ash-Greninja, so counterplay to these threats like bulky Landorus-T, Corviknight, and Blissey is essential. In addition, all of these Pokemon can form a pivoting core with Jirachi. Jirachi baits in Pokemon that aren’t bothered by its moves and can take advantage of it, like Heatran, Zapdos, and Mega Scizor. Jirachi’s best way of making progress against these Pokemon is either crippling them with Trick or pivoting out of them with U-turn into teammates that can exploit such as Garchomp, Greninja, and Tapu Koko.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 471780, "username": "Solaros & Lunaris"}]}
  },
  "Lopunny": {
    "comments": "<h1>Other Options</h1> <p>Mega Lopunny’s expansive movepool leaves a lot of room for theoretical utility either offensively or support oriented. Toxic and Thunder Wave can be run over U-turn in order to harass defensive answers, but they aren’t worth dropping the ability to reliably pivot on most teams. Quick Attack and Facade can be offensively useful, but only situationally. Healing Wish is an option but faces competition from Choice Scarf Jirachi, which boasts a better defensive typing, as well as the ability to effectively cripple walls before sacrificing itself.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Walls: The likes of Toxapex, Bold Clefable, and defensive Zapdos can easily take all of Mega Lopunny’s attacks. However, all of these must be at or near full health, cannot switch in whatsoever if Future Sight also hits that turn - and bar Static Zapdos - are susceptible to a loss of momentum from U-turn. Slowbro can afford chip damage, but its Psychic typing exacerbates the effectiveness of Mega Lopunny’s U-turn. This can lead to scenarios where the combination of Return and U-turn either forces Slowbro to waste turns using Slack Off or risk being excessively whittled down over the course of the match.</p> <p><strong>Faster Attackers: Faster attackers such as Choice Scarf Landorus-T, Excadrill in sand, and Mega Swampert in rain can take advantage of Mega Lopunny’s defensive woes and either KO it outright or take advantage of the forced switch into a passive wall. However, none of these can switch (added space) in reliably, and they are additionally susceptible to being chipped down by Fake Out with the exception of Excadrill.</p> <p><strong>Priority Moves: Attackers with priority moves, such as Ash-Greninja, Weavile, Mega Medicham, and Rillaboom, can easily revenge kill Mega Lopunny due to its awful defensive attributes. However, they cannot come in directly, struggle with Fake Out, and - with the exception of Rillaboom - require significant chip damage to actually KO Mega Lopunny.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>Mega Lopunny’s high Speed and Attack, unresisted STAB combination with Scrappy, and STAB priority in Fake Out make it simultaneously one of the best revenge killers and anti-offense choices in the metagame. Fake Out can force respectable chip damage onto faster threats and priority users, like Rillaboom and Choice Scarf Landorus-T, and even slower attackers that it brings to KO range like Mega Medicham. U-turn takes advantage of how easily Mega Lopunny can force switches by keeping up momentum on the likes of Slowbro, Clefable, Toxapex, and Slowking. Ice Punch can be run over U-turn to handle Gliscor and Landorus-T more effectively, but Mega Lopunny loses out on a lot of offensive utility. Limber can prevent paralysis before Mega Evolving.</p> <p>Mega Lopunny fits best on bulky offense teams that appreciate the Speed and ability to pivot on forced switches that it provides. As such, wallbreakers such as Choice Specs Kyurem, Ash-Greninja, and Choice Band Victini make excellent partners, and Mega Lopunny can clean up holes in cores they make. Similarly, setup sweepers such as Reuniclus and Nasty Plot Hydreigon also appreciate being pivoted into passive Pokemon such as Slowbro. Mega Lopunny’s defensive stats are quite subpar, so walls like Clefable and specially defensive Heatran are good partners. Pivots such as U-turn Greninja variants, Rotom-W, and Choice Band Rillaboom make great options as well to get Mega Lopunny in safely. Slowking and Slowbro deserve special mention, as they can fulfill the aforementioned defensive role while using Future Sight + Teleport to let Mega Lopunny break through almost all common counterplay options, such as Toxapex, Zapdos, and Tangrowth. Magnezone can trap and remove common switch-ins to Mega Lopunny, like Mega Scizor and Corviknight, and pressure others like Clefable and Toxapex. Entry hazards from the likes of Ferrothorn, Greninja, and Garchomp are fantastic with Mega Lopunny in order to maximize the pressure it places on defensive cores and chip down foes into Fake Out range faster. Clefable especially makes an excellent partner, as it can fulfill hazard-setting duties and also support Mega Lopunny defensively,</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 487629, "username": "Zneon"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 241308, "username": "faded love"}]}
  },
  "Garchomp": {
    "comments": "<h1>Other Options</h1> <p>Scale Shot can be run to turn regular Garchomp into a sweeper, but it is generally outclassed in this role by its Mega counterpart. Due to its stellar bulk and good defensive ability in Rough Skin, Garchomp can also run a defensive Stealth Rock set with a Rocky Helmet in tandem with Rough Skin to rack up chip damage against opposing physical attackers, However, this set is outclassed in this role by Rocky Helmet Landorus-T and is unsuitable for checking anything in the long run. Garchomp can also run a mixed Life Orb set with Draco Meteor or Fire Blast to bait in and punish physical walls that would usually give Garchomp problems, though Garchomp’s poor Special Attack makes the set difficult to pull off consistently, and this set is also outclassed by its Mega Evolution.</p> <h1>Checks and Counters</h1> <p><strong>Physically Bulky Pokemon: Pokemon that have good physical bulk and don't take super effective damage from any of Garchomps common moves like Tangrowth, Slowbro, and Hippowdon can survive any unboosted hit from Garchomp and force it out with status or super effective coverage moves. Pokemon with Unaware such as Clefable and Quagsire can also completely stop Garchomp from wallbreaking.</p> <p><strong>Faster Attackers: Naturally fast Pokemon or Choice Scarf users like Greninja, Tapu Koko, Landorus-T, Weavile, and Ice Beam Latias can revenge kill Garchomp. Priority users like Rillaboom, Mega Medicham, and Mega Scizor can also knock out a weakened Garchomp but they don't enjoy the chip from Rough Skin.</p> <p><strong>Status: Garchomp absolutely hates status conditions, as all of them severely cripple its wallbreaking capabilities and defensive utility. Scald burns from Slowbro, Slowking or Gastrodonseriously limit its wallbreaking potential, while Toxic poisoning from Clefable, Blissey, or Gliscor will seriously dent its longevity.</p> <p><strong>Skarmory and Corviknight: Garchomp cannot reliably break either Skarmory or Corviknight without Continental Crush. Iron Defense or Bulk Up variants of these two will completely wall Garchomp; not only can they clear Garchomp's Stealth Rock with Defog, but they can set their own hazards up as well.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Because of its stellar Attack, good STAB combination and coverage moves, solid Speed tier, and above average bulk, Garchomp is one of the premier offensive Stealth Rock setters and wallbreakers in the tier. It also has some solid defensive utility with its typing, letting it provide an Electric immunity and check common Pokemon like Heatran and non-Hidden Power Zapdos. Swords Dance allows Garchomp to beat a lot of common Defoggers like Zapdos, Corviknight, Landorus-T, and Gliscor, allowing it to easily keep Stealth Rock up. Rockium Z with Stone Edge gives Garchomp a strong Rock-type move to beat Defoggers like Zapdos and Corviknight. Alternatively, Dragonium Z with Outrage allows Garchomp to deliver a harder hit on physically defensive Pokemon like Landorus-T, Tangrowth, and Slowbro, and it can also catch a Mega Latias expecting a Stone Edge off guard. However, having a much worse matchup against Corviknight and Skarmory and the lack of a spammable STAB move once Devastating Drake has been used, make Dragonium Z an inferior option overall. Rough Skin is the preferred ability on most sets, as it punishes physical attackers like Mega Scizor, Rillaboom, Mega Medicham, and Hawlucha.</p> <p>Due to its role as both a wallbreaker and Stealth Rock setter, Garchomp fits best on offensive teams, where it can be paired up with teammates that enjoy its ability to break down or threaten out bulkier Pokemon like Toxapex, Zapdos, and Blissey. Pokemon such as Tapu Koko, Ash-Greninja, Mega Lopunny, Mega Mawile, and Mega Medicham make for stellar teammates, as they benefit from its ability to break down defensive foes like Zapdos, Slowbro, and Corviknight. The former three can also bring Garchomp in safely on defensive Pokemon, allowing it to set up Stealth Rock or use Swords Dance easily. Garchomp is very easily forced out by faster offensive Pokemon such as Ash-Greninja, Weavile, Kartana, and Tapu Koko, so Pokemon that can deal with them, like Tapu Fini, Ferrothorn, Corviknight, and Gastrodon make for solid teammates. Tapu Fini is an especially good partner for non-Outrage sets, as Misty Terrain can let Garchomp freely switch into bulky Water-types like Toxapex, Slowbro, and Slowking without fearing a Scald burn. Due to it beating many of the common Defoggers in the tier, Garchomp pairs well with Spikes users like Ash-Greninja and Ferrothorn, as it can threaten opposing Defoggers and keep Spikes on the field. It also has some very good defensive utility, being able to check Pokemon like Heatran, Zapdos, Volcarona, and Victini.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 475916, "username": "Sputnik"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Weavile": {
    "comments": "<h1>Other Options</h1> <p>Due to the multi-hit nature of Triple Axel, it is very easy to rack up contact chip damage from Ferrothorn's Iron Barbs, Garchomp's Rough Skin, and various Rocky Helmet users. Icicle Crash avoids this chip damage while having a reliable damage output and a flinch chance; however, Icicle Crash does not always OHKO Mega Latias, so Triple Axel is preferred.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers: Due to Weavile's frailty, faster revenge killers such as Mega Lopunny and Tapu Koko can outspeed it and threaten an OHKO with their STAB moves. Additionally, strong priority moves such as Mega Medicham's Fake Out, Greninja's Water Shuriken, and Rillaboom's Grassy Glide will all deal heavy damage to Weavile and should be avoided at all times.</p> <p><strong>Steel-types: Mega Scizor, Mega Mawile, and Melmetal all take minimal damage from Weavile and threaten to OHKO it in return. Mega Scizor deserves special mention, as it is an extremely consistent counter due to its longevity through Roost.</p> <p><strong>Water-types: Toxapex, Alomomola, and Tapu Fini, though they dislike the loss of their item, can switch into Weavile repeatedly over the course of the match and threaten it back with Scald burns or an OHKO after Stealth Rock in Tapu Fini's case. Toxapex and Alomomola can also remain healthy to continually check Weavile courtesy of Regenerator.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Weavile's powerful STAB combination, coupled with a fearsome Attack stat and great Speed tier, allow it to function as a solid weapon against offensive teams. Weavile is also one of the few Pursuit trappers in the National Dex tier, and it sets itself apart from Tyranitar and Mega Tyranitar due to its heightened Speed, allowing Weavile to fit on teams that are much more offensive than the bulky offense teams that Tyranitar and Mega Tyranitar are found on. Triple Axel threatens to OHKO common offensive Pokemon like Kartana, Mega Latias, and Mega Charizard Y. Knock Off helps Weavile cripple its defensive answers such as Toxapex, Alomomola, and Tapu Fini while hitting offensive Pokemon like Mega Medicham and Aegislash rather hard. Additionally, Pursuit allows Weavile to trap Psychic- and Ghost-type Pokemon like Mega Latias, Reuniclus, and Gengar. Offensive Pokemon that Weavile forces out are also good Pursuit targets, such as Mega Medicham, Serperior, and Mega Charizard Y. Ice Shard is useful for revenge killing Choice Scarf Landorus-T, Scale Shot Mega Garchomp, and Rillaboom. Ice Shard is also useful in revenge killing neutrally hit faster threats, such as Mega Lopunny and Tapu Koko, after a considerable amount of chip damage.</p> <p>Weavile fits best on offensive teams that appreciate the Pursuit support it provides. Pokemon that struggle against Mega Latias, Reuniclus, and Aegislash appreciate Pursuit, such as Kartana, Mega Medicham, and Toxapex. Pivots such as Slowbro and Blissey help Weavile get into play without being forced to take a hit while also luring in Aegislash and Gengar for Weavile to take advantage of. Weavile's frailty and typing leave quite a bit to be desired defensively, making it vulnerable to priority users and faster offensive threats such as Rillaboom, Ash-Greninja, and Mega Lopunny. Pokemon that can pivot into these threats like Toxapex, Corviknight, and Clefable fit well alongside Weavile. Also, Weavile's susceptibility to Stealth Rock necessitates Defog support from the likes of Corviknight and Zapdos. Corviknight is especially noteworthy because it invites in Garchomp and offensive Landorus-T in order to pivot out with U-turn into Weavile. Additionally, Mega Scizor and Toxapex counter Weavile, so Pokemon that threaten them such as Taunt Heatran and Mega Medicham make for excellent partners. Heatran and Toxapex are especially good partners because they appreciate Weavile's ability to Pursuit trap Mega Latios and Mega Latias and threaten Gliscor, Garchomp, and Landorus-T with Triple Axel.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 497633, "username": "Avery"}]}
  },
  "Magnezone": {
    "comments": "<h1>Other Options</h1> <p>Magnezone can run a Choice Scarf set with a spread of 4 HP / 4 Def / 248 SpA / 252 Spe and a Timid nature to trap Swords Dance Kartana, outspeeding it and surviving a Sacred Sword after Stealth Rock damage. The Choice Scarf also lets Magnezone be played more offensively and act as a revenge killer against foes that would normally outspeed it, such as Kyurem, Tapu Lele, and Manaphy. However, due to Magnezone's poor Speed, Choice Scarf Magnezone cannot be a team's general answer to fast threats, still only being as fast as Serperior. Also, Choice Scarf Magnezone lacks the power to wallbreak effectively, most notably being stalled out by Leech Seed + Protect Ferrothorn if Magnezone is hit by Leech Seed on the switch. Though the removal of Kartana can be very valuable to some teams, Kartana's middling speed is much easier to exploit with more conventional fast threats such as Mega Lopunny and Ash-Greninja. Steel Beam can also be run over Flash Cannon on the Choice Specs set in order to nuke Ground-types that would otherwise switch into Flash Cannon more than once. However, the lack of a spammable Steel-type STAB move hurts against Calm Mind Clefable, and the recoil of Steel Beam is also undesirable.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types and Fire-type coverage: The likes of Heatran and Mega Charizard Y are offensive Pokemon that can both OHKO Magnezone or use it to set up and threaten teammates. Heatran is also a defensive answer to Magnezone that can easily tank any attack from it. However, Heatran dislikes being forced to take a Gigavolt Havoc from Electrium Z Magnezone. Also, Mega Charizard Y cannot switch in, as it fears Magnezone's Electric-type attacks.</p> <p><strong>Ground-types: Ground-type Pokemon such as Gliscor, Garchomp, and Gastrodon are immune to Thunderbolt and Volt Switch. Not being able to pivot out with Volt Switch can drain the momentum of your team rather quickly as well. Landorus-T, Garchomp, and Excadrill are all able to outspeed non-Choice Scarf Magnezone and OHKO it with Earthquake. However, most Ground-types, with the exception of Gastrodon and Excadrill, cannot reliably stomach a Corkscrew Crash and are generally poor switch-ins to Flash Cannon.</p> <p><strong>Fighting-types and Fighting-type coverage: Fighting-types that can outspeed and OHKO Magnezone such as Mega Lopunny, Mega Medicham, and Mega Heracross pose a major threat. Strong Fighting-type coverage can deal sizable damage to Magnezone as well, such as Sacred Sword from Kartana. It should be noted, however, that these Fighting-types are usually revenge killing Magnezone, as none of them want to stomach a hit from it.</p> <p><strong>Chansey and Blissey: Chansey and Blissey take minimal damage from any of Magnezone's attacks due to their incredible special bulk, easily using it to set up Stealth Rock or regain momentum via Teleport.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Thanks to Magnet Pull, Magnezone can decisively eliminate slower Steel-type Pokemon like Ferrothorn, Corviknight, and Skarmory. This enables dangerous breakers such as Rillaboom, Tapu Lele, and Mega Diancie. Hidden Power Fire is useful for trapping Mega Scizor and Ferrothorn. Volt Switch maintains momentum versus Pokemon Magnezone matches up poorly against, such as Blissey, Mega Venusaur, and Amoonguss. It also allows Magnezone to keep momentum as it finishes off some targets, such as Corviknight. Volt Switch should also be used to exploit Toxapex and Clefable for momentum, as they are heavily threatened by Magnezone's STAB moves and often switch out. A Modest nature is preferred over Timid in order to wallbreak as effectively as possible.</p> <p>Pokemon that appreciate the removal of bulky Steel-type Pokemon, such as Mega Latias, Tapu Lele, Rillaboom, and Kyurem, make for great partners. These Pokemon also take advantage of Heatran, which Magnezone cannot beat. Gliscor is a particularly excellent partner, as it baits in Corviknight for Magnezone to trap. Also, it has a good matchup against defensive Ground-types, such as Landorus-T and Garchomp. Bulky Water-type Pokemon such as Slowbro and Toxapex not only address Magnezone's high vulnerability to fast, strong offensive Pokemon such as Mega Lopunny and Mega Medicham, but also benefit from it trapping Ferrothorn. Magnezone is also vulnerable to Ground-type Pokemon when locked into Thunderbolt or Volt Switch, so sturdy Ground-resistant or immune teammates such as Tangrowth, Gliscor, and Landorus-T are good to have. Finally, Magnezone's passivity against and ability to pivot out on Blissey means strong physical breakers pair well with it, such as Mega Lopunny, Garchomp, and Weavile.</p> "
      },
      {
        "name": "Z-Crystal",
        "description": "<p>Magnezone's Magnet Pull allows it to trap opposing Steel-type Pokemon, such as Ferrothorn, Mega Mawile, and Mega Scizor. Substitute allows Magnezone to take advantage of most trapped foes, such as Ferrothorn and Skarmory. Most importantly, it allows Magnezone to trap and remove Mega Mawile without having to worry about Sucker Punch mindgames. Substitute also takes advantage of passive Pokemon, such as non-Calm Mind Clefable, Toxapex, and Alomomola. Hidden Power Fire allows Magnezone to trap Ferrothorn and Mega Scizor. Electrium Z is the preferred item, as it can help alleviate pressure from Heatran while still safely trapping Mega Mawile. Steelium Z alongside Steel Beam is another option, most notably dealing heavy damage to Landorus-T, Gliscor, Tyranitar, and Mega Tyranitar. Steel Beam should only be used alongside Steelium Z, though, as Magnezone will otherwise lack a spammable Steel-type STAB move to chip Ground-type Pokemon and threaten Clefable.</p> <p>Teammates that are vulnerable to Mega Mawile, such as Mega Latias, Tapu Lele, Kommo-o, and Gastrodon, greatly appreciate Magnezone's ability to reliably trap and remove it. Teammates such as Rillaboom, Serperior, and Gliscor are also great partners due to Magnezone's prowess in trapping Corviknight, Ferrothorn, and Mega Scizor. Additionally, Pokemon that can break through Blissey and Chansey are excellent, such as Mega Mawile, Rillaboom, and Kartana. Rillaboom and Kartana are particularly good partners, as they also handle Ground-types that are immune to Magnezone's Electric-type attacks, and they appreciate the removal of Corviknight, Mega Scizor, and especially Mega Mawile. Finally, Pokemon such as Excadrill and Tyranitar greatly appreciate Steelium Z Magnezone being able to reliably remove Mega Mawile, dent Ground-type Pokemon, and trap Steel-type Pokemon effectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 497633, "username": "Avery"}]}
  },
  "Tangrowth": {"sets": [{"name": "Physically Defensive"}]},
  "Gallade": {
    "comments": "<h1>Other Options</h1> <p>Bulk Up and Drain Punch may seem appealing to offer some form of recovery, but they fail to break through Corviknight in the same manner as Swords Dance. Shadow Sneak also seems nice, as it gives Mega Gallade a priority move, but it has no relevant targets and is simply not better than any of the listed options.</p> <h1>Checks and Counters</h1> <p><strong>Strong Priority: Rillaboom's Grassy Glide, Mega Scizor's Bullet Punch, Aegislash's Shadow Sneak, and Mega Mawile and Bisharp's Sucker Punch bypass Mega Gallade's solid Speed tier and threaten to deal heavy damage to it.</p> <p><strong>Revenge Killers: Faster revenge killers such as Tapu Koko, Ash-Greninja, and Mega Lopunny all scare Mega Gallade out. None of these Pokemon can switch into it though, nor can they check a full health Mega Gallade due to its solid bulk.</p> <p><strong>Status: Being burned severely impedes Mega Gallade's ability to break through bulkier cores, and being Paralyzed ruins its solid Speed tier, leaving it vulnerable to slower foes such as Tapu Lele, Tapu Fini, and Zapdos.</p> <p><strong>Fairy-type Pokemon: Fairy-types such as Mega Mawile, Clefable, and Tapu Lele can stomach a hit from Mega Gallade, and threaten it back with their STAB moves.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>As a Psychic / Fighting wallbreaker, Mega Gallade often draws comparison to Mega Medicham. Although Mega Medicham has more immediate power, Mega Gallade's access to Swords Dance, a higher Speed tier, and Knock Off differentiate it enough to give it a niche. Swords Dance allows Mega Gallade to clean up easier in the late game, when checks such as defensive Landorus-T are weakened into Zen Headbutt range. Knock Off can be used to threaten Slowbro, Reuniclus, and Slowking and cripple Pokemon that rely on their item, such as Volcarona, Zapdos, and Moltres. Ice Punch can be used to revenge kill Garchomp as well as nailing Gliscor, Mega Latias, and Landorus-T. It is important to note that upon Mega Evolving, Mega Gallade gains Inner Focus, protecting it from Landorus-T's Intimidate. Justified is the chosen ability prior to Mega Evolving to get an Attack boost by absorbing a weak Knock Off from Tangrowth or Toxapex. Maximum Speed investment and a Jolly nature allow Mega Gallade to outspeed Kartana and Garchomp as well as Speed tying Mega Latias and threatening the aforementioned Pokemon with an OHKO.</p> <p>Quite possibly the best partner for Mega Gallade is Tapu Lele, as it appreciate Mega Gallade's ability to break through Corviknight, Slowking, and Heatran, and it provides Psychic Terrain to boost the power of Mega Gallade's Zen Headbutt, allowing it to break through Clefable. Other teammates that appreciate Mega Gallade's ability to pressure Corviknight, Slowbro, and Heatran include Garchomp, Volcarona, and Serperior. Additionally, solid checks to Fairy-types are appreciated, such as Ferrothorn and Jirachi. Jirachi is an especially great teammate, as its Healing Wish gives Mega Gallade a second opportunity to sweep. Solid entry hazard removal is also mandatory to give Mega Gallade more longevity, so Defoggers such as Corviknight, Zapdos, and Rotom-W pair well. Mega Gallade also appreciates Tyranitar and Weavile's ability to threaten Zapdos and trap Psychic-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511832, "username": "Optify"}, {"user_id": 517892, "username": "Pannuracotta"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 497633, "username": "Avery"}]}
  },
  "Rotom-Wash": {
    "comments": "<h1>Other Options</h1> <p>A more specially defensive spread can be used to check Heatran better but it worsens the matchup significantly against Pokemon like Gliscor and Mega Swampert. Waterium Z is a niche option on Rotom-W to consistently eliminate Gliscor and Heatran, threaten a KO on weakened foes, and consistently check Weavile, but the lost Leftovers recovery can add up a lot with Stealth Rock long term. A Choice Scarf set can also be run with Trick, which has a lot of surprise factor, but losing Leftovers hurts and Rotom-W is a subpar Choice Scarf user. Rocky Helmet garners chip damage on the likes of Landorus-T and Corviknight, but it's generally not worth using over Leftovers. Lastly, Thunder Wave is another option that can be run instead of Will-O-Wisp, letting Rotom-W slow foes for the rest of your team to generate momentum easily and drastically punish Pokemon like Serperior for getting too greedy, but this lets Pokemon such as Mega Scizor set up on it.</p> <h1>Checks and Counters</h1> <p><strong>Grass-Types: Tangrowth, Amoonguss, and Ferrothorn can safely pivot in on Rotom-W and and freely set up entry hazards, or chip it down with their STAB moves. Rillaboom, Kartana, and Tapu Bulu have to be cautious when coming in on it to avoid getting burnt, but they otherwise threaten it back out. Serperior can always come in on it, only fearing the rare Thunder Wave, and set up a Substitute and wreak havoc. However, Rotom-W can safely pivot out of these Pokemon with Volt Switch on a predicted switch, maintaining momentum.</p> <p><strong>Specially Offensive Dragon-types: Dragon-types such as Kyurem, Hydreigon, and Mega Latias can come in and set up for free on Rotom-W due to them resisting both of its STAB moves and not fearing a burn. These Pokemon do, however, fear a Thunder Wave if they hard switch in, and a burn can pressure Kyurem a lot in the long term.</p> <p><strong>Residual Damage: Due to Rotom-W’s lack of reliable recovery, residual damage in the form of Stealth Rock, status and sand can add up a lot in the long term, reducing it’s reliability as a pivot and a check to Landorus-T, Gliscor, and Melmetal.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<p>Due to its amazing defensive typing, Levitate, and the ability to check a multitude of threats such as Mega Swampert, Mega Scizor, Landorus-T and Gliscor, Rotom-W is a great pivot on offensive teams. Volt Switch lets Rotom-W generate momentum freely on the Grass- and Dragon-types that it lures in, and it can also pivot freely because Hydro Pump deters Ground-types that could block its Volt Switch. Pain Split gives Rotom-W longevity together with Leftovers, although unreliably. Defog is another option over Pain Split for role compression, as it also has a good matchup against two of the best Stealth Rock setters in the tier, Heatran and Landorus-T. However losing out on the recovery is generally not worth it for an otherwise subpar Defogger, since Rotom-W is threatened greatly by Toxic in the long term and loses to common Stealth Rock setters such as Garchomp, Clefable, and Mega Diancie. Will-O-Wisp prevents Pokemon such as Mega Scizor from using Rotom-W as setup bait. The given EV spread allows it to outspeed Tyranitar, specially defensive Heatran, and Aegislash.</p> <p>Strong wallbreakers such as Mega Medicham, Ash-Greninja, Heatran, and Mega Mawile all appreciate Rotom-W’s ability to bring them in safely, and Mega Mawile especially loves Rotom-W luring in Grass-types such as Tangrowth and Rillaboom that it can use as setup fodder. Pokemon such as Ferrothorn, Tangrowth, and Corviknight all appreciate the Fire resistance Rotom-W provides, and they can check Grass-types like Serperior, Rillaboom, and Kartana for it in return. Landorus-T and Jirachi also form a potent VoltTurn core with Rotom-W that can be difficult to stop and exerts immense pressure, as Rotom-W threatens Skarmory, Corviknight, and defensive Landorus-T for its partners. Garchomp is also a notable partner, as it appreciates Rotom-W bringing it in safely and threatening Tapu Fini, Skarmory, and Corviknight for it, in addition to providing an extra defensive measure for opposing Heatran. Lastly, Heatran and Tangrowth both appreciate Rotom-W’s ability to check threats such as Flyinium Z Landorus-T and, in the case of Heatran, Mega Swampert. In return, Heatran and Tangrowth check Rillaboom and Serperior for Rotom-W.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "Pannuracotta"}, {"user_id": 497633, "username": "Avery"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 529732, "username": "adsam"}]}
  },
  "Heatran": {"sets": [{"name": "Specially Defensive"}, {"name": "Z-Move"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 395754, "username": "Jordy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}, {"user_id": 297659, "username": "Deetah"}]}], "writtenBy": [{"user_id": 475916, "username": "SputnikGT"}]}},
  "Victini": {
    "comments": "<h1>Other Options</h1> <p>A Heavy-Duty Boots set with V-create / Bolt Strike / U-turn / Toxic can be used as a decent check to Pokemon like Tapu Lele and Mega Latias while being difficult to wear down thanks to its immunity to hazards.</p> <h1>Checks and Counters</h1> <p><strong>Pursuit Trappers: Weavile and both Tyranitar formes are able to trap a Victini locked into V-create, eliminating it from the game entirely. However, all of them are smacked by U-turn and Final Gambit, so they need to be wary of directly switching in.</p> <p><strong>Fire-resistant Pokemon: Heatran, Garchomp, Toxapex, Slowbro, and Mega Slowbro take V-create very well and aren't bothered too much by U-turn, with Garchomp in particular chipping Victini with Rough Skin every time it goes for these moves. However, all of them need to watch out for Final Gambit, and all of them barring Z-Move Heatran and Mega Slowbro need to be wary of Trick.</p> <p><strong>Ground-types: Garchomp, Landorus-T, and Gliscor are an incredible annoyance fo Victini, as they can tank a V-create and then outspeed Victini and KO it with their STAB move. All of them can be crippled by Trick, but Landorus-T and Garchomp can carry a Z-Move, and Gliscor's Toxic Orb will ruin Victini's longevity by poisoning it.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Victini compresses speed control and a way to check several dangerous offensive threats in Mega Medicham, Tapu Lele, and Mega Charizard Y, along with crippling the opposition thanks to Trick and Final Gambit or pummeling them with strong V-creates. U-turn makes Victini a great scout and momentum grabber, taking advantage of forced switches to bring its teammates in unscathed. Trick is a great way to cripple walls like Slowbro, Heatran, and Toxapex, forcing them to lose momentum every time they come in. Final Gambit can eliminate a defensive target entirely, as well as getting a teammate in freely, though this comes at the cost of Victini itself. Therefore, use it with caution if there's another threat Victini wants to check. Maximum HP investment allows Victini to make the most of its Final Gambit while improving its overall bulk to let it check Pokemon like Tapu Lele and Mega Medicham better.</p> <p>Victini fits on offensively geared teams, with hyper offensive teams in particular enjoying its ability to sacrifice itself to take out a defensive Pokemon they may not be able to break through. Therefore, hyper offensive staples like Rillaboom, Mega Gyarados, and Mega Garchomp make excellent partners. Suicide lead variants of Landorus-T can aid Victini in this role by setting up Stealth Rock and exploding on key defensive targets like Zapdos. This in conjunction with Victini's Final Gambit can often mean that the remaining teammates can clean up very easily. Bulkier offense archetypes enjoy Victini's defensive utility, as its ability to pivot in on huge threats like Mega Charizard Y, Tapu Lele, and Mega Medicham is often a godsend for them. Victini likes to get in unharmed so it can take advantage of its bulk as best as possible, so pivots like Corviknight, Blissey, and Slowbro make good teammates. Similarly, Defoggers like Zapdos and the aforementioned Corviknight make excellent partners because they can remove Stealth Rock, which often hinders Victini's defensive utility. Pokemon that appreciate Victini crippling or KOing Pokemon like Heatran, Landorus-T, and Slowbro, such as Mega Mawile, Tapu Koko, and Gliscor, make fantastic partners. Victini can struggle with sturdy Ground-types like Garchomp and Landorus-T that can tank its V-creates decently while wearing it down with Rocky Helmet or Rough Skin, so Pokemon like Weavile, Kyurem, and Ash-Greninja are good choices to deal with them. These three also appreciate Victini's ability to bait in these Ground-types and U-turn on them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 487629, "username": "Zneon"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 471780, "username": "Solaros & Lunaris"}]}
  },
  "Excadrill": {
    "comments": "<h1>Other Options</h1> <p>Steelium Z is a niche option that can push more damage onto Pokemon like Tapu Fini, Gliscor, physically defensive Tangrowth, and Landorus-T, but these targets can be pressured by Normalium Z anyway while also causing headaches for Zapdos and Rotom-W. Air Balloon reverses the matchup against Ground-types such as Garchomp, Landorus-T, and Gliscor. However, these matchups aren't worth being stonewalled by Tangrowth, Slowbro, and Zapdos. A suicide lead set consisting of Stealth Rock / Earthquake / Rapid Spin / Toxic or Steel Beam can be used on hyper offensive teams to guarantee Stealth Rock, thanks to Mold Breaker, and to keep hazards off its side of the field. However, such a set is generally outclassed by Landorus-T, which brings a nuclear Explosion to the table, and Mew, which brings Spikes and Taunt. A specially defensive set can be used to check a myriad of Pokemon like Tapu Koko and Tapu Lele while providing Rapid Spin, but it is easy to wear down and overwhelm.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Corviknight, Zapdos, and Mega Charizard Y are immune to Excadrill's Earthquake and take its Iron Head decently well, while they can all retaliate with super effective coverage. Mega Charizard Y can also remove potential sand, causing Excadrill to be slower than it. However, the former must be wary of Substitute variants if it lacks Body Press, and the latter two are shattered by +2 Normalium Z.</p> <p><strong>Faster Pokemon: When unboosted by sand or Rapid Spin, Excadrill sits are at a poor Speed tier. As a result, faster Pokemon like Garchomp, Ash-Greninja, and Mega Lopunny are capable of revenge killing it. Ash-Greninja in particular has a powerful Water Shuriken to dispatch of Excadrill even when its boosted. However, none of these Pokemon can switch into Excadrill directly and cannot beat it if its Speed is boosted.</p> <p><strong>Grass-types: Physically defensive Tangrowth is incredibly difficult for Excadrill to break if it has used its Z-Move, and Tangrowth can wear Excadrill down with Rocky Helmet and Giga Drain or neutralize it with Sleep Powder. However, Tangrowth can be crippled by Toxic long-term. Rillaboom, while unable to switch in directly, deals heavy damage to Excadrill with a priority Grassy Glide. Even if Rillaboom is taken out, Excadrill may have to contend with Grassy Terrain weakening its Earthquake.</p> ",
    "sets": [
      {
        "name": "Sand Rush Sweeper",
        "description": "<p>Excadrill is a cornerstone on sand teams, serving as a capable wallbreaker and sweeper for the archetype thanks to its high Attack, access to Swords Dance, and doubled Speed under sand. Additionally, its solid bulk and fantastic defensive typing give it many opportunities to set up against the likes of Clefable, Tapu Lele, and Tapu Koko. Swords Dance alongside a Z-Move lets Excadrill clean up weakened defensive Pokemon like Slowbro, Ferrothorn, and Tapu Fini. Giga Impact gives it access to Breakneck Blitz, allowing Excadrill to break through common Pokemon like Zapdos as well as chipped Slowbro and Tangrowth after a boost. Rapid Spin can be used if Excadrill's team can't fit Defog elsewhere and gives Excadrill the ability to limit Stealth Rock Clefable, patch up its Speed without the need for sand, and remove entry hazards for Pokemon weak to them like Mega Charizard Y. Toxic can be used in the fourth slot to wear down Slowbro, Tangrowth, Landorus-T, and Zapdos, especially alongside sand damage. Substitute is an option to use non-Body Press Corviknight as setup fodder. Leftovers allows for Excadrill to take advantage of its solid defensive typing, giving it easier setup on Pokemon like Clefable and Tapu Koko. However, forgoing Normalium Z can be detrimental against teams carrying Slowbro, Zapdos, and Tangrowth. Jolly is the preferred nature to Speed tie with opposing Excadrill, but if adequate Excadrill counterplay is on your team, Adamant can be used for its higher power, which is notable for dispatching Slowbro and Tangrowth a bit easier.</p> <p>Excadrill necessitates sand to function properly, so either Tyranitar or Mega Tyranitar are mandatory alongside it. Mega Tyranitar is also a great Stealth Rock setter, chipping Excadrill's answers into the range of its attacks. Both Tyranitar formes are also notable for being able to beat Zapdos one-on-one for Excadrill and having Pursuit to cripple Mega Latias. Corviknight effortlessly walls Excadrill, so teammates that can deal with it, such as Zapdos and Magnezone, make excellent teammates. Both are also notable for tearing open physically defensive Tangrowth, which would otherwise halt Excadrill's sweep. Swords Dance and Choice Band Kartana sets are also capable of forcing damage onto Corviknight and Zapdos, causing them to falter at checking Excadrill. Faster Pokemon like Ash-Greninja and Mega Lopunny can exploit Excadrill's mediocre Speed outside of sand, with Ash-Greninja revenge killing it even under sand with Water Shuriken, so partners such as Toxapex, Slowbro, and Corviknight are needed to help remedy this issue. Ferrothorn and Ash-Greninja are notable partners for their ability to set Spikes, allowing Excadrill to pressure Pokemon that would otherwise check it like Tangrowth. Calm Mind Clefable and Reuniclus are solid partners for Excadrill, as they appreciate Excadrill dismantling Steel-types that can halt their sweep. They also provide a solid defensive backbone which Excadrill can fall back on once sand has run out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 395754, "username": "Jordy"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 475916, "username": "Sputnik"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "martha"}]}], "writtenBy": [{"user_id": 471780, "username": "Solaros & Lunaris"}]}
  },
  "Reuniclus": {"sets": [{"name": "Calm Mind"}]},
  "Amoonguss": {
    "comments": "<h1>Other Options</h1> <p>A more physically defensive spread with a Rocky Helmet can be run to check Mega Lopunny and do a bit better against Rillaboom and Kartana, but it isn't even that great against the latter two and leaves Amoonguss vulnerable to Ash-Greninja. Stun Spore can be used to spread paralysis, but Amoonguss tends to miss out on important targets if it drops any of its moves. Toxic can also be run to spread the status onto threats that are generally crippled by it, such as Mega Latias, Hydreigon, Slowbro, Slowking, and Zapdos, but this runs into the same moveslot issues as Stun Spore. An Assault Vest set makes Amoonguss an even bulkier check to threats such as Ash-Greninja and Tapu Koko while also allowing it to lure Heatran via Stomping Tantrum; however, losing out on Spore is annoying, and the Heatran luring strategy can fall apart if your opponent sees that your Amoonguss isn't running Black Sludge. Hidden Power Ice can be used to hit Landorus-T, Garchomp, and Gliscor, but losing Hidden Power Fire prevents Amoonguss from checking Kartana or pushing any sort of meaningful damage onto Ferrothorn or Mega Mawile</p> <h1>Checks and Counters</h1> <p><strong>Fire-types: Fire-types such as Heatran, Victini, Mega Charizard X, Mega Charizard Y, and Volcarona all threaten Amoonguss with their STAB moves, although none of them want to get put to sleep.</p> <p><strong>Flying-types: Flying-types threaten Amoonguss with their STAB moves, and many of them take very little damage from its standard moves. Corviknight, Landorus-T, and Hawlucha all fit with this. Gliscor, while not running any Flying-type STAB moves, can't be put to sleep after its Toxic Orb activates and easily sets up on variants not running Clear Smog or Hidden Power Ice.</p> <p><strong>Psychic-types: Psychic-types, such as Mega Medicham, Tapu Lele, Reuniclus, and Mega Latias can all threaten Amoonguss greatly. Slowbro and Slowking can also use Future Sight to apply extra pressure and prevent Amoonguss from switching into what it's normally tasked with. They all have to beware of Spore, however.</p> <p><strong>Ice-types: Weavile and Kyurem force out Amoonguss with their powerful STAB moves. Weavile struggles to switch in more than once even if Amoonguss has already used Spore, but SubRoost Kyurem doesn't always have its Substitutes broken by Amoonguss, making it an especially dangerous foe.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Amoonguss is a bulky special wall that is hard to wear down thanks to Regenerator. It is capable of checking dangerous threats such as Ash-Greninja, Clefable, and Tapu Koko. Spore is capable of almost guaranteeing putting a non-Grass-type foe out of commission via sleep. This is especially effective considering most Grass-types, as well as the sleep blocking Tapu Fini, cannot safely switch into Amoonguss. This also makes Pokemon that would otherwise be able to absorb Sludge Bomb easily, such as Corviknight and Toxapex, hesitant to switch in due to the threat of Spore. Hidden Power Fire hits Kartana and Ferrothorn while also applying some chip to other Steel-types, such as Mega Scizor, Magnezone, and Mega Mawile. Clear Smog can be used over Sludge Bomb to shut down setup attempts from Calm Mind Clefable, Calm Mind Tapu Fini, Swords Dance Gliscor, and a reckless Manaphy, but Sludge Bomb's poison chance and ability to apply more damage to Rillaboom, Tangrowth, and Serperior makes it the preferred option. 56 Defense EVs allow Amoonguss to tank a +2 Smart Strike from Kartana and a +2 Life Orb Knock Off from Rillaboom. 204 Special Defense EVs and a Calm nature allow Amoonguss to tank two Dark Pulses from a transformed Ash-Greninja if at full health. Regenerator is the preferred ability, as it allows Amoonguss to regain health every time it switches out, therefore letting it pivot into threats such as Ash-Greninja, Tapu Koko, and Zeraora consistently.</p> <p>Amoonguss is bait for most of the metagame's Fire-types, especially if Spore has already been used. Water-types such as Slowking and Tapu Fini are capable of checking the very threatening Heatran, while a bulky Dragon-type such as Garchomp or Kommo-o can help out against Mega Charizard Y and Volcarona. The aforementioned Water-types appreciate Amoonguss checking Electric-types such as Tapu Koko, Magnezone, and Zeraora, while the Dragon-types appreciate Amoonguss dealing with Fairy-types such as Clefable and Tapu Fini. Slowking also appreciates Amoonguss checking Ash-Greninja, while the two of them can work together to form a Regenerator core that is tough to break. A Ground-type, such as Landorus-T, Garchomp, or Gliscor, can also prevent Amoonguss from being pivoted on by Volt Switch by the aforementioned Electric-types. A Dark-resistant Pokemon, such as Clefable or Mega Tyranitar, can also help Amoonguss pivot around Ash-Greninja effectively. Amoonguss is a Grass-type that is incapable of properly checking Ground-types, such as Landorus-T, Garchomp, and Gliscor, as well as Rillaboom. A bulky Flying-type, most notably Corviknight, can help out with this, as can a powerful offensive Ice-type, such as Weavile or Kyurem. Corviknight can also help out Amoonguss against Psychic-types such as Tapu Lele and Mega Latias.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 475916, "username": "Sputnik"}]}
  },
  "Ferrothorn": {
    "comments": "<h1>Other Options</h1> <p>Ferrothorn can run Stealth Rock if the team lacks a setter. Iron Head is an alternative attacking move, notably hitting Kyurem. Gyro Ball with a Sassy nature can also be run to hit Pokemon like Clefable and Mega Mawile. Toxic can cripple and whittle down threats like Zapdos, Mega Lopunny, and Mega Medicham in conjunction with Leech Seed. These moves, however, can hinder Ferrothorn's ability to check its main targets like Tapu Fini and Greninja-Ash. Chople Berry can be run to take a hit from Fighting-types and Fighting-type coverage and then cripple the threat with Thunder Wave or Toxic. An alternative spread with 92 Defense EVs allows Ferrothorn to survive a Choice Band Kartana's Sacred Sword after Stealth Rock damage and return with either Body Press, Thunder Wave, or Knock Off.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types and Fire-type Coverage: Due to Ferrothorn's quadruple weakness to Fire, Pokemon like Heatran, Mega Charizard Y, and Volcarona all threaten it heavily. Pokemon that can carry Fire-type coverage like Clefable, Galarian Slowking, and Zapdos also pressure Ferrothorn.</p> <p><strong>Magnezone: Magnezone prevents Ferrothorn from switching out due to Magnet Pull and easily takes care of Ferrothorn with Hidden Power Fire. However, Ferrothorn can beat Magnezone in rain with Leech Seed and Body Press due to Hidden Power Fire's damage reduction.</p> <p><strong>Fighting-types and Fighting-type Coverage</strong>: Strong Fighting-types like Mega Lopunny and Mega Medicham threaten to OHKO Ferrothorn but cannot switch in safely without taking heavy damage from its attacks. It is also pressured by Pokemon with Fighting-type coverage like Focus Blast Tapu Lele and Superpower Rillaboom.</p> <p><strong>Grass-types: Grass-types like Tangrowth, Kartana, Mega Venusaur, and Amoonguss all easily take Ferrothorn's attacks, are immune to Leech Seed, and wear it down. However, Tangrowth can risk losing its item or being inflicted by Toxic, and Kartana can risk being hit by Body Press.</p> <p><strong>Strong Wallbreakers: Without recovery outside of Leech Seed and Leftovers, Ferrothorn falls to the sheer power of wallbreakers like Garchomp, Landorus-T, Ash-Greninja, and Mega Mawile.</p> ",
    "sets": [
      {
        "name": "Entry Hazard Setter",
        "description": "<p>Ferrothorn provides a fantastic role as a Spikes setter that can keep them up reliably against most Defoggers in the tier. Knock Off removes the Leftovers or Heavy-Duty Boots from many of its switch-ins, such as Zapdos, Corviknight, Tangrowth, and Heatran, making entry hazards more effective against them. As its only form of recovery besides Leftovers, Leech Seed improves its longevity and lets it slowly whittle down Pokemon like Garchomp and Ash-Greninja. Power Whip improves its mostly passive presence and pressures Water-types like Ash-Greninja, Tapu Fini, Mega Swampert, Gastrodon, and Slowking. Body Press can be run to pressure Kyurem, Heatran, and Kartana from switching in and beat Magnezone in rain. Thunder Wave can provide utility in crippling fast wallbreakers like Ash-Greninja and walls like Corviknight for its teammates. Iron Barbs is Ferrothorn's best ability, chipping pivots like U-turn Rillaboom and Landorus-T. A specially defensive EV spread allows it to handle Pokemon like Clefable, Tapu Lele, and Greninja more easily. 232 Special Defense EVs ensure it survives three Choice Specs Greninja's Dark Pulses from full HP.</p> <p>Ferrothorn fits best on balance and bulky offensive teams in need of a wall. Ferrothorn synergizes well with other entry hazard setters such as Stealth Rock Landorus-T and Garchomp to stack up chip damage. Landorus-T also does well at providing a Ground immunity, as Pokemon like Garchomp and opposing Landorus-T can overwhelm Ferrothorn once boosted due to its reliance on passive recovery. Garchomp can also pressure Defoggers like Corviknight and Zapdos, preventing them from safely removing its entry hazards. Garchomp, Tapu Fini, Tyranitar, and Toxapex check Fire-type threats like Heatran, Mega Charizard Y, and Volcarona. Ash-Greninja can also threaten the aforementioned Pokemon and also set Spikes alongside Ferrothorn. Ferrothorn appreciates Dark-resistant Pokemon like Clefable and Tapu Fini to handle Ash-Greninja more easily. Spikes is a boon for teammates like Reuniclus, Clefable, and Garchomp, as they appreciate it wearing down their checks and punishing switches harder.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}, {"name": "Past Versions by", "members": [{"user_id": 395754, "username": "Jordy"}]}], "writtenBy": [{"user_id": 541143, "username": "emillight"}]}
  },
  "Bisharp": {
    "comments": "<h1>Other Options</h1> <p>Darkinium Z can be used over Life Orb to break open a hole for another sweeper to exploit if there are no other Z-Move users on the team. It is important to note that using Sucker Punch as the base move will give Black Hole Eclipse the highest Base Power. Black Glasses can also be held as Bisharp's item to avoid taking recoil damage while still boosting the majority of Bisharp's attacks. The drop is power is noteworthy, though, as a boosted Sucker Punch will fail to OHKO Garchomp after a layer of Spikes.</p> <h1>Checks and Counters</h1> <p><strong>Faster Dark-resistant Pokemon: Fast Fighting- and Dark-Types resist both Knock Off and Sucker Punch, allowing them to have a favorable matchup. As such, Pokemon such as Ash-Greninja, Mega Lopunny, Tapu Koko, Mega Diancie, and Hydreigon can check Bisharp, though they cannot switch into a boosted Iron Head.</p> <p><strong>Physically Bulky Pokemon: Pokemon such as Rocky Helmet Tangrowth, Hippowdon, and Skarmory can weather Bisharp's assault and threaten it back with an OHKO in the case of Hippowdon or Skarmory, or Sleep in Tangrowth's case. Quagsire deserves special mention, as Unaware combined with its physical bulk allows it to fully counter Bisharp. Mega Scizor can also use its bulk to stave off Bisharp and set up, which can be incredibly threatening to the offensive teams Bisharp fits on. Additionally, Mega Garchomp, though not a defensive Pokemon, has the bulk to withstand any of Bisharp's attacks, even after a Swords Dance boost.</p> <p><strong>Strong Special Attacks: Due to Bisharp's poor special bulk, strong special attackers such as Tapu Lele, Kyurem, and Mega Diancie can all outspeed and threaten to OHKO Bisharp. Tapu Lele's Psychic Terrain will also block Bisharp's Sucker Punch, leaving it helpless.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Bisharp is a terrifying setup sweeper on hyper offense and a fixture on Sticky Web teams thanks to Swords Dance, a great STAB combination, and Defiant. Defiant allows Bisharp to punish Corviknight and Zapdos's Defog attempts, though Bisharp should watch out for Body Press and Heat Wave, respectively. This dissuades the opposing team from using Defog altogether, which lends Bisharp a very useful niche seeing as keeping entry hazards up is integral to enabling dangerous teammates on hyper offense. Defiant also makes Bisharp a physical attacker that Landorus-T cannot check, as Intimidate will raise Bisharp's Attack instead of lowering it. Fellow Defiant user Galarian Zapdos can fulfill a similar role, but it is held back by its inability to deal with Zapdos. However, Bisharp is both frail and weak to common attacking types, meaning that it cannot reliably switch into much. Additionally, Bisharp heavily relies on Sucker Punch against faster foes, which can be played around. A Jolly nature is preferred to Adamant, as it allows Bisharp to outspeed Heatran, Gliscor, and Zapdos, although the former is not a problem with Sticky Web support. Life Orb notably lets Bisharp OHKO Landorus-T on the switch and OHKO Weavile with Sucker Punch after Stealth Rock damage.</p> <p>Entry hazard support from a teammate like Landorus-T, Mew, or Shuckle is integral to making the most of Bisharp, as the threat of giving Bisharp a Defiant boost with Defog will often prevent your opponent from using it outright until Bisharp has been dealt with. Entry hazard support also allows Bisharp to pick up OHKOs with a boosted Sucker Punch that it would not net without other chip damage, such as on Garchomp and Weavile. Teammates that can take advantage of physical walls like Mega Scizor, Hippowdon, and Toxapex make great partners, such as Mega Charizard X, Tapu Lele, and Serperior. Also, teammates that can weaken or remove Tangrowth, Toxapex, Skarmory, and Hippowdon for Bisharp to break through them are great, including Mega Mawile, Mega Garchomp, and Mega Charizard X. Mega Mawile can also take advantage of Bisharp luring in Kommo-o. Teammates that can lure in Pokemon that Bisharp can set up on are also vital, which includes Mega Pinsir and Hawlucha luring in Slowbro, and Serperior luring in Blissey. Also, Bisharp is especially threatening on Sticky Web teams, as it not only deters the removal of Sticky Web, but also takes advantage of its Speed reduction to outspeed otherwise faster offensive threats, such as Kartana, Tapu Lele, and Kyurem. Teammates that pair well with Bisharp on Sticky Web teams include the aforementioned Mega Scizor, Kommo-o, and Mega Pinsir.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 497633, "username": "Avery"}]}
  },
  "Hydreigon": {
    "comments": "<h1>Other Options</h1> <p>Running other coverage moves such as Flash Cannon, Draco Meteor, and Flamethrower are also solid options over Earth Power, with Draco Meteor variants also running Dragonium Z to hit foes like Blissey and Kommo-o harder. However, forgoing Earth Power makes Hydreigon incredibly weak to Fairy-types and loses out on coverage against other Pokemon. A specially defensive EV spread with Defog over Nasty Plot can be run to better check Ash-Greninja and Heatran, but it doesn't beat any Stealth Rock setters aside from Heatran and is incredibly passive.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Because of Hydreigon's typing and usual coverage options, Fairy-types like Clefable, Tapu Fini, and Mega Diancie can check it, provided it has not set up yet. Flash Cannon variants can threaten Clefable after enough boosts, and Mega Diancie cannot reliably switch into Hydreigon; after enough boosts, it can also threaten Clefable and Tapu Fini with Tectonic Rage after minimal chip damage.</p> <p><strong>Fighting-types: Mega Lopunny, Mega Medicham, and Kommo-o resist Hydreigon's Dark Pulse and threaten it with their STAB attacks. However, they aren't the most reliable switch-ins, as they do not like switching into Draco Meteor or Tectonic Rage.</p> <p><strong>Blissey and Chansey: Standard Hydreigon variants are completely unable to make progress against Blissey and Chansey and forced out by status. However, Devastating Drake after two Nasty Plots has a great chance to OHKO Blissey, but Hydreigon would end up being statused in the exchange.</p> <p><strong>Status</strong>: Toxic reduces Hydreigon's longevity in battle, making it harder for it to switch in or set up. Paralysis cripples Hydreigon and leaves it outsped by notable targets like Tapu Lele, Adamant Mega Medicham, and Mega Garchomp.</p> <p><strong>Faster Pokemon: Tapu Koko, Mega Lopunny, Garchomp, and Kartana outspeed Hydreigon and can KO it after minimal chip damage.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Hydreigon functions as an excellent wallbreaker on balance teams, as it has strong wallbreaking potential and good defensive utility, which let it switch into a plethora of common Pokemon such as Ash-Greninja, Heatran, Slowbro, and Zapdos. Nasty Plot allows Hydreigon to break down common defensive staples such as Ferrothorn, Mega Scizor, Gastrodon, and Gliscor. Earth Power hits important targets such as Toxapex, Heatran, Mega Mawile, and Mega Tyranitar while also being a good neutral option against Fairy-types. After Nasty Plot, Groundium Z allows Hydreigon to OHKO foes such as physically defensive Clefable, Toxapex, and Mega Tyranitar. Roost gives Hydreigon reliable recovery to improve its longevity and act as a sufficiently defensive Pokemon. The given EV spread lets Hydreigon survive 2 Hydro Pumps from Ash-Greninja as well as Kartana's Sacred Sword from full HP.</p> <p>Hydreigon fits best on balance teams with offensive and defensive teammates to support it. Due to Hydreigon's average Speed tier and vulnerable defensive typing, it has a tendency to get revenge killed by offensive threats, so it appreciates teammates that can give it a solid defensive backbone and offensively check these threats. Hydreigon is capable of soft checking Heatran and Ash-Greninja, but it can get overwhelmed easily and isn't good as the only form of counterplay to them. Toxapex, Gastrodon, Assault Vest Tangrowth, and Slowking aid Hydreigon in handling these Pokemon. Heatran, Mega Scizor, and Ferrothorn help cover Hydreigon's Fairy- and Ice-type weaknesses, with the latter two appreciating it acting as a Fire-resistant partner in return. Toxapex and Clefable can help against annoying Fighting-types trying to revenge kill Hydreigon, like Mega Lopunny and Kommo-o. Zeraora, Choice Scarf Landorus-T, and Choice Scarf Victini check offensive threats like Weavile and Tapu Koko, which prove troublesome for Hydreigon. Blissey tends to render Hydreigon useless offensively, so pairing it up with Pokemon such as Kartana, Mega Scizor, and Mega Lopunny helps out Hydreigon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 483087, "username": "Aurodian"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 5178921, "username": "pannuracotta"}]}
  },
  "Volcarona": {
    "comments": "<h1>Other Options</h1> <p>A bulky Quiver Dance set with Roost is an option on bulkier teams, as it has a lot of defensive utility from switching into the likes of Kyurem, Clefable, Mega Scizor, Rillaboom, and Kartana. However, its reliance on Heavy-Duty Boots means it is crippled incredibly hard by Knock Off, and its limited coverage due to only having two attacks can make it hard to sweep. Giga Drain hits Pokemon like Gastrodon and Tapu Fini super effectively, but it's generally less useful than the listed coverage options.</p> <h1>Checks and Counters</h1> <p><strong>Specially Bulky Pokemon: Pokemon like Blissey, Chansey, Toxapex, Gastrodon, and Heatran are able to take anything Volcarona hits them with, unless it's set up a lot of Quiver Dances, and threaten it back with Toxic or Clear Smog. However, Heatran and Toxapex should be wary of Hidden Power Ground and Psychic variants, respectively. Pokemon like Garchomp, Tyranitar, and Mega Tyranitar can take a hit from Volcarona at full health and KO back with a powerful Stone Edge; however, they fear a +1 Bug Buzz if they are slightly chipped.</p> <p><strong>Faster Pokemon and Priority: Pokemon that are faster than Volcarona like Garchomp, Greninja, and Mega Diancie can hit it with a super effective attack before it can set up; meanwhile, priority users like Ash-Greninja, Mega Mawille, Mega Medicham, Urshifu-R, and Mega Lopunny can chip down and revenge kill Volcarona. Lastly Choice Scarf users such as Victini can outspeed and KO Volcarona even after a boost.</p> <p><strong>Knock Off: Due to Volcarona's reliance on its Heavy-Duty Boots, it cant risk setting up on the likes of Ferrothorn, Rillaboom, and Mega Scizor. Psychium Z variants don't have to worry about Knock Off, though.</p> <p><strong>Status: Status makes it incredibly hard for Volcarona to sweep, as paralysis from the likes of Serperior, Clefable, and Blissey means it cant freely switch in and set up on these Pokemon, and Toxic from the likes of Chansey, Toxapex, and Heatran will severely hinder its longevity.</p> ",
    "sets": [
      {
        "name": "Offensive Quiver Dance",
        "description": "<p>Volcarona is a great sweeper on offense teams, thanks to Quiver Dance, strong STAB moves, and solid coverage options, while also providing crucial defensive utility by checking the likes of Mega Scizor, Rillaboom, Kartana, and Kyurem. Psychic hits many of its checks, such as Toxapex and Kommo-o. Volcarona can also run Hidden Power Ground to hit one of its best counters in Heatran, but this causes it to falter against Pokemon like Toxapex and Kommo-o. Heavy-Duty Boots maintains Volcarona's defensive utility through Stealth Rock and gives it better opportunities to set up; meanwhile, Psychium Z allows it to deal incredible neutral damage with a Shattered Psyche at the cost of taking entry hazard damage. Flame Body can punish physical attackers like Rillaboom, Mega Scizor, and Mega Mawile, while a Timid nature lets it naturally outspeed Pokemon like Kyurem, Excadrill, and Urshifu-R, as well as Choice Scarf Landorus-T after a Quiver Dance boost. Modest can be used if more power is desired, grabbing notable KOs such as Kommo-o, Mega Tyranitar, and Garchomp, but Volcarona ends up easier to revenge kill by the likes of Choice Scarf Landorus-T and Mega Garchomp before a boost.</p> <p>Volcarona mainly fits on hyper offense, teams as they appreciate the defensive utility and firepower it brings; in return, Volcarona appreciates hyper offense teammates weakening its checks and counters, as there are a lot of situations where it cannot set up and sweep. Entry hazards delay it if it's been hit by Knock Off, and a healthy Tyranitar, Garchomp, or Heatran can take a hit and KO it back. Good examples of powerful teammates are Bisharp, Rillaboom, Garchomp, and Mega Medicham. Meanwhile, cleaners like Hawlucha, Rillaboom, and Mega Gyarados can clean up late-game after Volcarona has broken through the opposing team. Serperior makes a stellar offensive core with Volcarona as Volcarona handles many of Serperior's checks such as Heatran, Corviknight, and Amoonguss, and Serperior's Glare can give Volcarona better opportunities to set up. Hazard control is also incredibly important when using Volcarona, encouraging teammates like Kartana, Corviknight, Excadrill, and Tapu Fini. Non-Heavy-Duty Boots variants used on HO absolutely need hazard removal through the likes of Excadrill or Regieleki to function. Leads such as Taunt Mew and Excadrill can stop Stealth Rock from being on the field, which Volcarona appreciates, and dual screens support through Grimmsnarl or Tapu Koko makes Volcarona harder to take down and give it more opportunities to set up. Lastly, Gliscor can freely set up on Volcarona's best counters: Heatran, Toxapex, and Blissey.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 497633, "username": "Avery"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Landorus-Therian": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Ice can be used on the defensive set to threaten opposing Landorus-T and Garchomp while also breaking Hawlucha's Substitutes, but it's difficult to fit on the set unless your team has another Stealth Rock setter. A set utilizing Substitute, Swords Dance, Earthquake, and Smack Down with Groundium Z can be used to take advantage of Body Press Corviknight and Skarmory. Bulky sets carrying Fly with Flyinium Z and U-turn can be useful, as they allow Landorus-T to threaten immediate damage onto offensive Pokemon, such as Mega Medicham and Rillaboom. It also takes advantage of the standard bulky pivot sets tending to lure in Tangrowth. However, the loss of Toxic and Rocky Helmet makes this set worse against Pokemon such as Mega Latias and Mega Mawile.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Slowbro is capable of forcing damage onto Landorus-T and potentially burning it with Scald while also eating unboosted hits rather comfortably, although it fears Toxic and a boosted Supersonic Skystrike. Offensive Water-types such as Ash-Greninja, Manaphy, and Mega Swampert are all capable of threatening Landorus-T with their STAB moves as well, although Ash-Greninja can't switch into any set and the other two must be careful of Z-Moves or Explosion.</p> <p><strong>Ice-types and Ice-type Coverage: Landorus-T's quadruple Ice weakness means that any Ice-type move will deal heavy damage, if not OHKO. Weavile and Kyurem both outspeed non-Choice Scarf Landorus-T and OHKO it with a STAB move. In addition, Pokemon such as Tapu Koko and Mega Medicham can carry Ice-type moves, allowing them to threaten Landorus-T with enormous damage.</p> <p><strong>Ground-immune Pokemon: Corviknight only fears Knock Off from the Choice Scarf and Defensive sets and can proceed to remove Landorus-T's Stealth Rock rather comfortably. Gliscor doesn't even fear Knock Off, but it must be careful of Swords Dance variants. Rotom-W is threatened by a stray Toxic but can force out Landorus-T with its STAB Hydro Pump. Skarmory can use Landorus-T to freely set up Spikes. However, all of these Pokemon must be cautious of the Rockium Z set, and the rare Smack Down variant completely invalidates all of these as answers.</p> <p><strong>Residual Damage: Landorus-T is rather susceptible to residual damage, as it is often tasked with checking several prominent threats on the opposing team. This, in conjunction with a vulnerability to Stealth Rock, leads to Landorus-T being worn down rather easily over the course of a game.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Landorus-T is one of the best Choice Scarf users in the metagame. Its ability to act as a team's Ground-type and answer to fast threats alongside its generally good power and utility moves makes it very easy to put on many teams. It gives teams offensive and defensive weapons against threats such as Heatran, Toxapex, and Tapu Koko. U-turn allows Landorus-T to keep up the momentum and take advantage of the switches it forces from common Pokemon such as Tapu Koko, Toxapex, and Heatran. Stone Edge 2HKOes Zapdos, OHKOes Moltres, and allows Landorus-T to revenge kill Mega Charizard Y. Knock Off, on the other hand, removes important items from the likes of Slowbro, Zapdos, Moltres, Tapu Fini, and Tangrowth. Punishment allows Landorus-T to deal with Calm Mind Mega Latias, 2HKOing it after a Calm Mind, as well as Calm Mind Reuniclus. It works especially well with teammates that force Mega Latias to use Calm Mind multiple times, such as Corviknight. Explosion allows Landorus-T to deal more damage to certain threats, such as Garchomp, Gliscor, Kommo-o, and Rotom-W; however, keep in mind that all of them require chip damage before being KOed. Defog can be used if the role compression of having revenge killing and hazard removal in the same teamslot is needed. Unfortunately, being locked into Defog gives foes free turns. Hidden Power Ice can be used to threaten opposing Landorus-T and Garchomp. Earth Power can work on teams that are desperately in need of a reliable Kartana revenge killer and need Landorus-T's role compression. A neutral nature and 76 Special Attack EVs should be run in this case in order to secure the OHKO on Kartana. 232 Speed EVs and a Jolly nature are used to outrun +1 Excadrill.</p> <p>Bulky Water-types, such as Slowbro and Toxapex, work well with Landorus-T. Slowbro can also form a pivoting core with Landorus-T with Teleport, while Toxapex is capable of taking on Ash-Greninja for Landorus-T. These Water-types also appreciate Landorus-T's Electric immunity, and Toxapex also appreciates the Ground immunity. Strong wallbreakers such as Mega Medicham, Mega Mawile, Kyurem, and Tapu Lele appreciate Landorus-T solidly handling fast threats for them and pivoting them in with U-turn. Mega Mawile and Kyurem are capable of taking advantage of Slowbro, a physical sponge that can generally pivot into Landorus-T safely, and Kyurem can additionally deal with Zapdos. Choice Scarf Landorus-T will get worn down over the course of a game, so having Defog support in the form of Corviknight, Zapdos, or Kartana is very helpful. Corviknight can also force Mega Latias to use Calm Mind multiple times, which can work well with Punishment Landorus-T.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Defensive Landorus-T gives teams an interim measure against threats such as Mega Mawile, Mega Medicham, and Mega Lopunny while also being a good utility Pokemon in general. Landorus-T is capable of setting Stealth Rock for its team, which allows it to make use of the switches that it forces against the aforementioned threats. U-turn is useful, as it lets Landorus-T pivot out of bad matchups against Corviknight and Slowbro. Toxic is used to punish threats such as opposing Landorus-T, Mega Latias, Kyurem, and Slowbro that might look to come in on Landorus-T. Hidden Power Fire is a viable option for teams that need a buffer against Kartana. Rocky Helmet is preferred to punish U-turn from the likes of opposing Landorus-T, Mega Lopunny, and Corviknight, as well as general contact moves from threats such as Mega Medicham and Mega Mawile. 144 Speed EVs allows Landorus-T to outrun Modest Heatran. Alternate Speed investments, such as 16 Speed EVs for Tyranitar or 88 for Bisharp, are viable if you want Landorus-T to have more bulk, but missing out on Modest Heatran can be detrimental considering how common it is.</p> <p>Defensive Landorus-T finds its place on more offensive builds that appreciate it checking threats such as Mega Medicham and Mega Lopunny while also keeping up momentum and setting Stealth Rock. Landorus-T is very effective at spreading residual damage onto threats such as Landorus-T and Mega Mawile, which fast offensive Pokemon such as Tapu Koko, Mega Lopunny, and Weavile enjoy, as it allows them to get past these threats much more easily. Landorus-T has no recovery and somewhat mediocre special bulk, both of which make it vulnerable to special attackers such as Clefable, Heatran, and Tapu Lele. The good special bulk of Ferrothorn, Mega Scizor, and Slowking makes them decent partners as a result. Other Water-types, such as Tapu Fini and Slowbro, also enjoy Landorus-T's defensive presence. Strong wallbreakers such as Mega Mawile, Ash-Greninja, and Mega Medicham appreciate Landorus-T wearing down faster, frailer offensive Pokemon and safely pivoting them in.</p> "
      },
      {
        "name": "Suicide Lead",
        "description": "<p>Landorus-T is one of the best suicide leads in the tier due to its powerful Explosion denying attempts from the likes of Corviknight, Zapdos, and Tapu Fini to remove its hazards via Defog, and Swords Dance boosting Earthquake and Explosion can let it take one or more opposing Pokemon down with it. Swords Dance boosts Landorus-T's Attack to titanic levels, allowing Earthquake to do enormous damage to even bulky neutral targets and making Explosion much more powerful, notably allowing it to OHKO Zapdos, Gliscor, and Slowbro while doing over 50% to Corviknight. Focus Sash lets Landorus-T live one hit from full, allowing it to get Stealth Rock up reliably in most situations.</p> <p>Suicide Lead Landorus-T fits well on hyper offense teams that need to get the game started with a bang and keep Stealth Rock up if possible. Landorus-T is a great lead, as it matches up well against the vast majority of entry hazard removal options. The only notable ways to stop Landorus-T from getting Stealth Rock up are a faster Taunt user, such as Mew, or a Magic Bounce user such as Mega Sableye. Hyper offense teams utilizing Choice Scarf Victini can also make Victini the lead instead, as Landorus-T tends to trade Stealth Rock with opposing Stealth Rock setters, and it can be therefore more valuable at times to deny the opponent's Stealth Rock first and send in Landorus-T next. This pair can also take two foes with it quite easily. Staple sweepers on hyper offense such as Mega Gyarados, Belly Drum Kommo-o, Mega Garchomp, and Rillaboom are good teammates, as they all appreciate Stealth Rock wearing down the opposition and Landorus-T opening up a big hole with Explosion early-game.</p> "
      },
      {
        "name": "Offensive Stealth Rock",
        "description": "<p>Offensive Stealth Rock Landorus-T serves as one of the best pure wallbreakers in the metagame while also being one of the tier's more reliable Stealth Rock setters. It matches up well against common entry hazard removers like Tapu Fini and Corviknight, and it also uses its ability to force out common Pokemon like Heatran and Excadrill to either set Stealth Rock or set up a Swords Dance. Swords Dance Landorus-T is also one of the best Pokemon for breaking stall teams, as the immense power combined with a Z-Move makes checking Landorus-T quite hard for them, even with Unaware Pokemon such as Clefable and Quagsire. Fly with Flyinium Z allows Landorus-T to smash through common defensive Pokemon like Slowbro and Tangrowth after a boost. Stone Edge with Rockium Z, on the other hand, lets Landorus-T directly threaten common Defoggers like Corviknight and Zapdos while also allowing it to break through Rotom-W with greater efficiency. It also still has enough power to OHKO Tapu Fini at +2. Its targets are rather limited, however, which makes Flyinium Z the overall superior choice. The Rockium Z set also faces competition from Garchomp, which sits at a significantly better Speed tier that gives it the jump on Mega Medicham, Mega Charizard X, Mega Charizard Y, and Hydreigon, but Landorus-T retains a niche due to compressing a Ground immunity and getting better damage rolls against Corviknight.</p> <p>Late-game cleaners are excellent partners for Landorus-T, as they greatly appreciate Landorus-T weakening or straight up removing bulkier Pokemon while also setting up Stealth Rock. Pokemon such as Ash-Greninja, Mega Lopunny, and Tapu Koko make for good teammates in this regard. Ash-Greninja also forms a dangerous hazard-setting duo while appreciating Landorus-T’s ability to defeat Toxapex, Blissey, Tangrowth, and Tapu Fini. U-turn variants of Ash-Greninja can also be employed to get Landorus-T in safely and exploit Pokemon such as Toxapex and Blissey. Mega Lopunny appreciates Landorus-T’s ability to weaken Corviknight and Zapdos, letting them wreak havoc later on. Landorus-T appreciates pivot support that can get it in safely. Blissey, Mega Scizor, and Slowbro are good partners as a result. Magnezone also stands out as an exemplary partner, as it can take out Corviknight and Skarmory for Landorus-T, allowing it to use its Z-Move on other targets. Landorus-T's teammates can be tuned depending on what Z-Crystal it is using. Pokemon that appreciate Pokemon such as Tangrowth, Slowbro, and Hippowdon removed make for good partners for the Flyinium Z variant, with Mega Lopunny working in this regard. Teammates that appreciate the removal or denting of Pokemon such as Corviknight, Rotom-W, and Zapdos work well as partners for the Rockium Z set. These include Kartana, Mega Scizor, and Mega Lopunny.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guard"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 475916, "username": "Sputnik"}]}
  },
  "Kyurem": {
    "comments": "<h1>Other Options</h1> <p>Kyurem can run Dragon Dance + Icicle Spear on SubRoost sets, but this makes it play much differently than its standard set does, as it needs more support and loses to a lot of bulky Water- and Steel-types. A Modest nature can augment Kyurem's power on the Choice Specs set, but this does make Kyurem's already mediocre Speed stat even worse.</p> <h1>Checks and Counters</h1> <p><strong>Entry Hazards</strong>: Without Heavy-Duty Boots, Kyurem easily gets chipped down by hazards during games. With sets that run Roost, this is somewhat more manageable, but Choice Specs variants have to be mindful of their HP throughout a game.</p> <p><strong>Steel-types</strong>: Despite SubRoost Kyurem running Earth Power to hit Steel-types, those that are not weak to Ground such as Mega Scizor, Corviknight, and Ferrothorn can pose a threat to it as none of them get 2HKOed by the set Kyurem. However, Choice Specs sets that run Hidden Power Fire hit all of the above. Mega Scizor especially poses a problem due to its U-turn always breaking Kyurem's Substitute while allowing it to switch into something that can force it out, in addition to Bullet Punch always KOing after Stealth Rock damage.</p> <p><strong>Faster Pokemon: Due to Kyurem's mediocre Speed tier, it is often outsped by many Pokemon such as Mega Lopunny, Garchomp, and Mega Medicham, which can force it out with super effective coverage if Kyurem is not behind a Substitute.</p> ",
    "sets": [
      {
        "name": "SubRoost",
        "description": "<p>Because of its very high natural bulk, SubRoost Kyurem excels at taking advantage of passive Pokemon such as Toxapex, Blissey, and Tangrowth by setting up Substitutes so that their status moves can't affect it. This pairs nicely with Pressure and Roost, allowing it to effectively PP stall these targets. Freeze-Dry has high PP and super effectively hit Water-types like Slowbro, Slowking, Toxapex, and Tapu Fini that'd resist its other Ice-type STAB options, and Earth Power covers the Steel- and Fire-types that resist Freeze-Dry like Heatran, Mega Mawile, and Victini. 56 HP EVs give Kyurem 101 HP Substitutes so that Seismic Toss from Blissey and Chansey can't break it in one hit.</p> <p>Fast pivots with U-turn like Mega Lopunny, Landorus-T, Jirachi, and Greninja make excellent teammates to Kyurem by baiting in bulky passive Pokemon such as Toxapex, Slowbro, Tangrowth, and Chansey and giving Kyurem a free switch to set up Substitute. If Kyurem can't safely get a Substitute up, it is fairly vulnerable to Pokemon like Clefable, Mega Scizor, and Corviknight that can eat hits from it and break its Substitute. As a result, Kyurem greatly appreciates having teammates like Magnezone and Heatran that can deal with the Steel- and Fairy-types that can threaten it. Magnezone is notable due to its ability to completely trap and remove Steel-types like Mega Scizor, Corviknight, and Ferrothorn with Magnet Pull. Because of Kyurem's lack of immediate power, it's also very much setup fodder for Pokemon like Calm Mind Mega Latias, Clefable, and Reuniclus, so Pokemon that can stop these setup sweepers make for good teammates. Crippling them with a status move like Toxic or Thunder Wave works well, so Pokemon like Blissey, Clefable, Ferrothorn, and Toxapex can be useful, Toxapex can also remove boosts from Reuniclus and Clefable, which are not crippled by status too heavily. If you choose to not run Heavy-Duty Boots, hazards are also a massive threat to Kyurem, so it should always be paired with a reliable Defogger like Zapdos, Corviknight, or Choice Scarf Landorus-T.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Kyurem is a powerful wallbreaker that focuses more on doing big damage to the opposing team's defensive core. Freeze-Dry lets it super effectively hit Water-types, whereas Ice Beam can 2HKO Pokemon that Freeze-Dry can't like Clefable, Ferrothorn, and Corviknight. The last slot can be either Earth Power or Hidden Power Fire, both of which hit Steel-types. Earth Power is better for Heatran, but Hidden Power Fire is better against Ferrothorn and Mega Scizor, at the cost of being less reliable against other Steel-types. Focus Blast is an option to hit Steel-types as well as Blissey, but Blissey does not get 2HKOed unless Kyurem is running a Modest nature, and it is less reliable than the other options.</p> <p>Because of Kyurem being able to fire off such powerful attacks, it really likes having faster teammates that can clean up late-game. Mega Lopunny, Greninja, and Jirachi can all clean up games quite easily once Kyurem has punched a few holes in the opposing team's defensive core. Due to its subpar Speed stat, notable threats such as Victini, Mega Medicham, Garchomp, Mega Lopunny and Tapu Koko naturally outspeed and OHKO or deal a lot of damage to Kyurem. The Specially bulky pivots that can eat multiple hits from Kyurem like Blissey, specially defensive Corviknight, and Mega Scizor can pose a big threat to it in combination with faster pivots like the aforementioned Victini, Mega Lopunny, and Tapu Koko. Because of this, you want to pair Kyurem up with Pokemon that can punish opposing pivots. Tyranitar and Weavile can Pursuit trap some of the more physically frail answers to Kyurem, like Blissey, Corviknight, and Reuniclus. Furthermore, offensive entry hazard setters such as Landorus-T, Garchomp, and Heatran can help weaken Pokemon switching in against Kyurem and allow it to achieve 2HKOs that it couldn't before. Kyurem itself is very weak to hazards, so you should always run it with a good Defogger like Corviknight or Zapdos. Tapu Fini is also an option, but it should only be paired with Kyurem if it elects not to run any Dragon-type attacks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 491200, "username": "Light Sanctity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 388157, "username": "A Cake Wearing A Hat"}, {"user_id": 302985, "username": "Lotiasite"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 517892, "username": "Pannuracotta"}, {"user_id": 511181, "username": "WrathoftheLeopard"}]}
  },
  "Aegislash": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360582, "username": "Guardsweeper"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 475916, "username": "SputnikGT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}]}], "writtenBy": [{"user_id": 376369, "username": "Chazm"}]}},
  "Hawlucha": {
    "comments": "<h1>Other Options</h1> <p>Stone Edge can be used over Substitute to hit Zapdos super effectively; however, it doesn't hit any other noteworthy Pokemon that Hawlucha's STAB combination doesn't, making it a worse option than Substitute overall. Taunt allows Hawlucha to deny any attempts at preventing it from sweeping, such as phazing attempts from Hippowdon and Haze from Toxapex. Throat Chop can be used to hit Aegislash super effectively, as it comfortably resists Hawlucha's STAB combination; however, it has very little use otherwise.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Pokemon like Clefable and Tapu Fini can heavily threaten Hawlucha with their STAB moves while being able to take an Acrobatics from it at +2; however, once weakened enough, they become flimsy checks to it.</p> <p><strong>Psychic-types: Pokemon such as Tapu Lele, Reuniclus, and Mega Latias are able to KO Hawlucha with their STAB moves, the former being able to override Rillaboom and Tapu Koko's respective Terrains with its Psychic Terrain, and the latter two being able to always survive a hit from it even at +2.</p> <p><strong>Priority Users: Priority users such as Ash-Greninja, Weavile, and Rillaboom can stop Hawlucha's sweep by revenge killing it with their priority moves in Water Shuriken, Ice Shard, and Grassy Glide, respectively. However, Hawlucha needs to be weakened enough in order to be revenge killed by these Pokemon.</p> <p><strong>Bulky Water-types: Pokemon such as Slowbro, Tapu Fini, and Toxapex can slow down Hawlucha's progress. The former two are capable of always taking a hit at +2 and attempting to burn it with Scald or KOing it with Moonblast respectively. Toxapex can remove Hawlucha's boosts; however, it can be taken advantage of by Taunt or Substitute.</p> ",
    "sets": [
      {
        "name": "Unburden Sweeper",
        "description": "<p>Hawlucha is a very potent setup sweeper in the National Dex metagame. Its decent STAB combination in conjunction with a good Attack stat, access to Swords Dance, and Unburden allows Hawlucha to outspeed and revenge kill even the most common Choice Scarf users in the metagame, such as Landorus-T, Jirachi, and Victini. Substitute allows it to take advantage of Pokemon such as defensive Landorus-T, Toxapex, Ferrothorn, and Garchomp by forcing switches after getting its Speed doubled by Unburden. The EVs allow Hawlucha to always take a Moonblast from an uninvested Clefable and outspeed Excadrill under sand.</p> <p>Hawlucha mainly fits on offensive teams, as they greatly enable Hawlucha's sweeping capabilities. Tapu Koko and Rillaboom are absolute necessities for Hawlucha, as the Terrains they set up are crucial for activating its ability via Electric or Grassy Seed, respectively, along with the fact that they are able to overwhelm almost all of Hawlucha's checks, such as Zapdos, Clefable, and Tapu Fini. Hawlucha appreciates entry hazard support from Pokemon such as Mew and Landorus-T, it allows Haluwcha to more easily offensively pressure Pokemon like Mega Scizor and Tapu Fini. Additionally, Hawlucha enjoys the presence of wallbreakers such as Mega Medicham that can aid it in its sweep Hawlucha struggles a lot with Fairy-types such as Clefable and Tapu Fini, as they can heavily threaten it due to Moonblast; thus, checks to them such as Bisharp and Victini are very reliable teammates. Zapdos is a major problem for Hawlucha, as it resists its STAB combination, has access to reliable recovery to check it multiple times throughout a game, and it can threaten to KO Hawlucha with Discharge; thus, checks to Zapdos such as Weavile and Kyurem are great teammates.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 487629, "username": "Zneon"}]}
  },
  "Diancie": {
    "comments": "<h1>Other Options</h1> <p>Psychic is an option to slam Mega Venusaur as well as hitting Amoonguss harder, but it’s often hard to fit onto Mega Diancie‘s moveset. A set with Substitute and Endeavor alongside 5 HP IVs can be used to lure in and cripple Corviknight and Blissey, but these targets are easy enough to pressure with regular attacks anyway.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Mega Scizor, Corviknight, and Heatran are all solid answers to Mega Diancie. The former two can retaliate with a Steel-type STAB move, and Heatran can smack it with Earth Power. However, Heatran lacks reliable recovery and must be wary of Earth Power, while Mega Scizor and Corviknight must be cautious about eating a Mystical Fire on the switch.</p> <p><strong>Ground-types: Landorus-T and Gliscor make decent checks to Mega Diancie, as they can take its attacks and OHKO it with their STAB Earthquake. However, they need to watch their health, as Mega Diancie can break past them with brute force.</p> <p><strong>Pokemon with Regenerator: Toxapex, Slowking, and Amoonguss make solid switch-ins to Mega Diancie, and they don’t need to worry about their health thanks to Regenerator. The former two can threaten Mega Diancie with Scald, while Amoonguss can use Giga Drain. Toxapex needs to watch for Earth Power, while Amoonguss must be careful about Mystical Fire or the rare Psychic.</p> <p><strong>Faster Offensive Pokemon: Tapu Koko, Greninja, Ash-Greninja, Mega Lopunny, and Choice Scarf Landorus-T all pose a massive threat to Mega Diancie. Rillaboom’s Grassy Glide is also a major thorn in its side. However, none of these Pokemon can directly switch into it, as they take severe damage or are KOed outright by its STAB moves.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Mega Diancie’s ability to pressure most of the Defoggers in the tier makes it a potent offensive Stealth Rock setter. In addition, it‘s a terrific wallbreaker thanks to its incredible offenses and good Speed in conjunction with colorful coverage. Diamond Storm is preferred over Power Gem to wear down specially defensive Pokemon like Blissey, Toxapex, and Slowking. Moonblast is a powerful STAB move that easily dispatches Pokemon like Garchomp and Mega Latias while also hitting physical walls like defensive Landorus-T quite hard. Mystical Fire is crucial coverage, as it targets Corviknight and Ferrothorn and discourages Mega Scizor from switching in. Instead of Stealth Rock, Earth Power can be used to snipe Heatran and do more damage to Mega Mawile and Excadrill. Encore can also be used in this moveslot to, for example, lock Corviknight into Defog or Tapu Fini into Calm Mind, allowing Mega Diancie to exploit the switch or revenge kill them. Magic Bounce deters status moves and entry hazards, allowing Mega Diancie to take advantage of passive Pokemon like Mega Sableye and Blissey. 132 Special Attack EVs allow it to 2HKO Corviknight with 72 Special Defense EVs after Stealth Rock, with the remaining EVs going into Attack for better damage rolls against Pokemon like Blissey and Heatran.</p> <p>Mega Diancie fits on bulky offense teams that appreciate its monstrous wallbreaking power and Stealth Rock. Magnezone is a phenomenal teammate thanks to its ability to completely remove Steel-types, allowing Mega Diancie to forgo Mystical Fire entirely. Because of Mega Diancie’s frailty, pivots that can bring it in like Blissey, Slowking, and Corviknight make solid partners. Blissey can also paralyze offensive answers to Mega Diancie such as Greninja and Ash-Greninja, (feel free t Slowking can use Future Sight to make its attacks indirectly stronger, and Corviknight can check defensive Ground-types like Landorus-T and Gliscor that Mega Diancie can’t break through on its own. Wallbreakers and late-game cleaners such as Swords Dance Kartana and Kyurem appreciate Stealth Rock and Mega Diancie’s ability to wear down several defensive Pokemon, such as Blissey, Heatran, and Mega Scizor. Kartana in particular loves Mega Diancie pressuring Zapdos, Mega Latias, and Corviknight, while Kartana uses the defensive Ground-types that Mega Diancie baits in as setup fodder. Mega Diancie can form solid entry hazard stacking cores with Ferrothorn, Greninja, and Ash-Greninja thanks to their collective ability to beat down Defoggers so that entry hazards can stay up. Ferrothorn can also annoy several of Mega Diancie's checks like Heatran and Blissey with Toxic, Leech Seed, and Knock Off, while Ash-Greninja can beat down the checks it shares with Mega Diancie like Ferrothorn and Toxapex.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511832, "username": "Optify"}, {"user_id": 491200, "username": "Light Sanctity"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 471780, "username": "Solaros & Lunaris"}]}
  },
  "Toxapex": {
    "comments": "<h1>Other Options</h1> <p>Gastro Acid is a good option in tandem with Toxic, as it punishes Toxic-immune Pokemon that try to set up on Toxapex, like Clefable, Reuniclus, and Gliscor; it can also remove other abilities that might hinder Toxapex's effectiveness, such as Natural Cure from Blissey. However, a lot of the time, Gastro Acid is less useful than simply running Haze and Toxic. Shed Shell can be useful to escape Heatran's Magma Storm, however; in most situations, the passive recovery from Black Sludge is better. Physically defensive variants can be used to better check Pokemon like Hawlucha, Mega Lopunny, and Mega Mawile, but Toxapex is generally best used to tank special hits. Papaya Berry is an option that allows Toxapex to sponge a hit from foes like Mega Medicham, Latias, and Tapu Lele and cripple them with Toxic, Knock Off, or a Scald burn; however, this tends to be incredibly situational. Lastly, Baneful Bunker can be used to scout moves from Choice-locked foes like Greninja, Landorus-T, Magnezone, and Tapu Lele, as well as punish physical attackers like Mega Medicham and Zeraora. However, this makes Toxapex significantly more passive and unable to handle Pokemon that come in on it freely such as Mega Charizard Y and Magnezone.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-types such as Landorus-T, Garchomp, Gliscor, Mega Swampert, and Excadrill can OHKO Toxapex with Earthquake and force it out. Gliscor deserves a special mention, as it can freely use Toxapex as setup fodder and cannot be hurt by burn or poison after Toxic Orb has been activated due to Poison Heal. However, the other Ground-types fear getting burned or poisoned.</p> <p><strong>Psychic-types: Psychic-types such as Tapu Lele, Reuniclus, Mega Latios, and Mega Medicham threaten Toxapex with their super effective attacks and force it out. Slowbro and Slowking can use Future Sight to scare Toxapex from coming into Pokemon it wants to check, like Ash-Greninja and Mega Charizard Y.</p> <p><strong>Magic Guard Users: Magic Guard users like Clefable and Reuniclus are not affected by Toxapex's status moves and can use it as an opportunity to set entry hazard or boost with Calm Mind. However, if Clefable lacks Thunder or gets its Life Orb removed, it can be forced into a stalemate with Haze.</p> ",
    "sets": [
      {
        "name": "The Pex",
        "description": "<p>Toxapex is one of the premier defensive Pokemon in the tier due to its amazing ability in Regenerator, huge defensive stats, good defensive typing, and great utility moves. These traits make it an excellent wall for bulkier teams that can check and counter many key Pokemon in the metagame such as Ash-Greninja, Mega Scizor, Mega Charizard Y, and Weavile. Scald burns physical attackers and discourages Pokemon such as Landorus-T, Garchomp, and Mega Medicham from switching into Toxapex. Toxic wears down foes and gives Toxapex more turns to use Recover, Knock Off cripples foes like Tapu Fini and Heatran, and Toxic Spikes spreads status and forces Defog if the opponent does not have a Poison-type to absorb them. Haze thwarts setup attempts from foes like Clefable and Hawlucha. The given EV spread allows Toxapex to survive two Knock Offs from Choice Band Weavile and +2 Kartana's Leaf Blade from full HP.</p> <p>Toxapex fits very well on bulky teams, as it pairs well with fellow Regenerator users like Tangrowth. Bulky Pokemon like Skarmory, Chansey, Hippowdon, and Mega Latias form an incredibly hard-to-break defensive core with Toxapex. Toxapex appreciates having teammates that can switch into its very few weaknesses. Ground-resistant and -immune partners like Tangrowth, Corviknight, Gliscor, Skarmory, and Mega Latias are excellent switch-ins into Garchomp, Landorus-T, and opposing Gliscor, while Electric-immune teammates like Gliscor and Landorus-T can deal with Electric-types such as Magnezone, Tapu Koko, and Zeraora. Ferrothorn is an amazing partner due to it being able to handle Electric- and Psychic-types like Tapu Koko and Mega Latias for Toxapex. Toxapex appreciates having entry hazard removal on its side, as Spikes and Stealth Rock can bother it long term; Pokemon like Corviknight and Zapdos make a good core with it. Toxic Spikes variants have great synergy with bulky setup sweepers such as Reuniclus, Mega Latias, Gliscor, and Clefable due to Toxic Spikes wearing down their counters over time. In return, the former two are able to handle Mega Medicham, which is a threat to Toxapex.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Kommo-o": {"sets": [{"name": "Defensive"}]},
  "Tapu Koko": {
    "comments": "<h1>Other Options</h1> <p>Hidden Power Fire is a very niche option that covers both Ferrothorn and Excadrill. However, it sacrifices Hidden Power Ice, drastically worsening the matchup against Gliscor. On hyper offense teams, Tapu Koko could run a dual screens set with Light Clay and Taunt that can also enable Hawlucha, but the superior dual screens setter in Grimmsnarl can do the same in conjunction with Rillaboom's Grassy Terrain support.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Opposing teams having a Ground-type can really deter Tapu Koko's progress-making by forcing a lot of mind games between Hidden Power Ice and Volt Switch. Some of the more common Ground-types in the tier like Landorus-T, Garchomp, and Gliscor must be wary of being OHKOed by Hidden Power Ice, but the Ground-types that aren't weak to Ice, like Gastrodon and Excadrill, completely wall Tapu Koko.</p> <p><strong>Grass-types: Defensive Grass-types such as Ferrothorn, Mega Venusaur, Amoonguss, and the rare Assault Vest Tangrowth resist Tapu Koko's main STAB type and are bulky enough to stomach Dazzling Gleam and Hidden Power Ice relatively easily as well. Amoonguss and Tangrowth are particularly pesky, capable of neutralizing Tapu Koko's progress with Volt Switch due to Regenerator. Although not able to switch in safely, Rillaboom can check Tapu Koko in a pinch as well, owing to its resistance to Electric-type attacks and access to strong priority. However, barring Amoonguss and Tangrowth, none of these Grass-types can maintain a positive or even neutral momentum trade against Volt Switch.</p> <p><strong>Specially Bulky Walls: Blissey and Chansey sport tremendous special bulk, which allows them to hold Tapu Koko off for a while. However, they can be overwhelmed with Volt Switch in the long run quite easily.</p> <p><strong>Faster Pokemon While Tapu Koko is very fast, there are still Pokemon that outspeed it, such as Mega Lopunny and Ash-Greninja. Additionally Choice Scarf users like Landorus-T, Victini, and Jirachi all outspeed it and can threaten it out with STAB moves. Priority moves from the likes of Mega Medicham, Weaville, and Ash-Greninja can threaten to knock out a previously weakened Tapu Koko as well.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Because of its stellar Speed, good offensive prowess, and access to a strong Volt Switch, Tapu Koko is one of the best offensive pivots in the tier. It has a relatively poor Special Attack stat, but its ability to summon Electric Terrain in tandem with the use of a Choice Specs makes up for that. Hidden Power Ice lets Tapu Koko hit the Ground-types that are immune to its Electric-type moves like Garchomp, Landorus-T, Gliscor, and Hippowdon. This is incredibly important; a well-timed Hidden Power Ice will cleanly OHKO the former two Ground-types and force the latter two out, and the resulting mind games drastically improve Tapu Koko's ability to generate momentum with Volt Switch. Volt Switch lets Tapu Koko scout the opponent and gain free momentum once the opponent's Ground-type has been removed. Dazzling Gleam gives Tapu Koko a good neutral option against Pokemon that resist Thunderbolt but aren't very threatened by Hidden Power, like opposing Tapu Koko, Hydreigon, and Kyurem. Alternatively, it can run Roost to improve its longevity in more drawn-out games against Pokemon that it forces out, such as Toxapex, Corviknight, and Slowbro. However, Roost forces Tapu Koko to switch out, thereby losing momentum. Grass Knot is another option that lends Tapu Koko the ability to pressure Gastrodon and Mega Swampert much harder, but it is inferior to Dazzling Gleam otherwise.</p> <p>Due to its role as a fast pivot that can generally keep up momentum well, Tapu Koko fits very well on more offensive teams, but it's a fine fit on balanced teams as well. Tapu Koko pairs particularly well with teammates that can bait in Water- and Flying-types such as Toxapex, Slowbro, Tapu Fini, Corviknight, and Zapdos. Such teammates include the likes of Heatran, Ash-Greninja, Greninja, Mega Lopunny, Rillaboom, and Mega Scizor. Moreover, all of these partners bar Heatran are capable of creating pivoting cores with Tapu Koko courtesy of their access to U-turn, with Greninja and Ash-Greninja amplifying progress made through pivoting with Spikes as well. Water-, Grass-, and Ice-types such as Ash-Greninja, Kartana, Rillaboom, and Kyurem can easily pressure most of the metagame's Ground-types, including the ones that are particularly annoying for Tapu Koko such as Gastrodon, Mega Swampert, and Excadrill. On the other hand, Fire-types such as Mega Charizard Y and Heatran take advantage of Grass-types such as Ferrothorn, Tangrowth, and Amoonguss, which can otherwise keep Tapu Koko at bay for extended amounts of time. Due to Tapu Koko's tendency to force plenty of switches and rack up damage with Volt Switch, good entry hazard setters such as Landorus-T, Garchomp, and the aforementioned Heatran, Greninja, and Ash-Greninja make for good teammates that can greatly speed up the rate at which Tapu Koko can break teams down. Tapu Koko also likes having strong physical wallbreakers on its side to deal with the more specially defensive Pokemon that check it such as Blissey, Ferrothorn, Amoonguss, and Gastrodon. Pokemon like Mega Mawile, Mega Medicham, and Hawlucha make for great teammates to pressure these special walls, with the latter two also having great synergy with Electric Terrain. Lastly, as Tapu Koko is quite frail and prone to revenge killers such as Mega Lopunny, Choice Scarf Landorus-T, Rillaboom, and Ash-Greninja as a result, it appreciates a defensive backbone that can sponge up hits from these threats. On bulky offense teams, Pokemon such as bulky Landorus-T, Slowbro, Corviknight, and Blissey can provide said backbone while also maintaining momentum with their pivoting moves. On balanced teams, the likes of Toxapex, Clefable, and Corviknight can fulfill the same objective.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 487629, "username": "Zneon"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 517892, "username": "Pannuracotta"}]}
  },
  "Tapu Lele": {"sets": [{"name": "Calm Mind"}, {"name": "Choice Specs"}, {"name": "Choice Scarf"}]},
  "Tapu Fini": {
    "comments": "<h1>Other Options</h1> <p>A more offensive Choice Scarf set can be utilized with Trick, Hydro Pump, Moonblast, and either Defog or a coverage move of choice. This set trades off a lot of the bulk of a normal Defog set in order to become a solid revenge killer, as well as providing good offensive prowess. Choice Scarf Tapu Fini is usually used on offensive teams that appreciate it soft checking Heatran and Greninja while also revenge killing the likes of boosted Mega Gyarados, Mega Lopunny, and Ash-Greninja.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types and Grass-type Coverage: Bulky Grass-types such as Tangrowth, Ferrothorn, Amoonguss, and Tapu Bulu can reliably switch into Tapu Fini and force it out, and can they easily recover off the damage dealt. However, they all fear losing their item to Knock Off, and Tapu Bulu doesnt want to switch into a Scald, fearing a burn. Offensive Grass-types such as Serperior, Rillaboom, and Kartana all force it out, but the latter two are threatened by a Scald burn and don't appreciate a Moonblast, so they can't switch in as easily. Grass-type coverage from the likes of Mega Charizard Y and Manaphy also greatly threatens it.</p> <p><strong>Electric-types and Electric-type Coverage: Pokemon such as Zeraora, Magnezone, and Tapu Koko all can threaten Tapu Fini out with their STAB moves, but they can get easily worn down by switching in multiple times. Zapdos is especially a good switch-in due to it easily recovering off the damage dealt to later pressure Tapu Fini out again. Electric-type coverage moves from the likes of Clefable, Blaziken, and Victini can also force it out.</p> <p><strong>Poison-types: Poison-types such as Mega Venusaur, Galarian Slowking and Gengar all pressure Tapu Fini consistently with their STAB moves, although Gengar struggles to switch in repeatedly due to its frailty, and Galarian Slowking fears being rendered much less effective by a Knock Off.</p> <p><strong>Chip Damage: Due to Tapu Fini’s lack of reliable recovery, chip damage can easily rack up, eventually wearing it down into range of the likes of Greninja and Heatran. Since Tapu Fini is going be removing opposing entry hazards, it also has to worry about switching into them, worsening its longevity as the game goes on.</p> <p><strong>Strong Wallbreakers</strong>: Strong wallbreakers such as Z-Move Heatran, Mega Medicham, and Tapu Lele can dent Tapu Fini massively, greatly reducing its lifespan.</p> ",
    "sets": [
      {"name": "Calm Mind"},
      {
        "name": "Defog",
        "description": "<p>Tapu Fini is a excellent Defogger that pressures and beats a large number of entry hazard setters such as Heatran, Landorus-T, and Kommo-o. Its amazing typing and multiple utility moves in Taunt and Nature's Madness, as well as its great bulk, allow it to be a sturdy check to terrifying threats such as Ash-Greninja, Weavile, and Heatran as well. However, due to its lack of consistent recovery and its vulnerability to all entry hazards, it is easily worn down throughout the match. Scald allows Tapu Fini to threaten burns on the likes of Tapu Bulu, Landorus-T, Corviknight, and Rillaboom, as well as pressuring Heatran consistently. Nature's Madness greatly chips its switch-ins like Amoonguss and Ferrothorn for its teammates. Taunt lets Tapu Fini prevent Pokemon such as Ferrothorn from setting up entry hazards in front of it and the likes of Mega Scizor and Clefable from setting up on it; Taunt also lets it force out Pokemon like Toxapex and Slowking in combination with Nature's Madness. Knock Off is another option that can punish common switch-ins such as Tangrowth and Galarian Slowking by removing their items, as well as removing Leftovers, Heavy-Duty Boots, and Black Sludge from the likes of Toxapex, Amoonguss, Slowking, and Tapu Bulu, greatly reducing their longevity and effectiveness. The given EV spread allows Tapu Fini to live a boosted Acrobatics from Hawlucha and OHKO it back, as well as outspeeding and 2HKOing offensive Heatran with Scald, with the remaining EVs in Special Defense to check the likes of Heatran and Ash-Greninja better.</p> <p>Tapu Fini fits on bulky offense teams, which appreciate it checking big offensive threats such as Heatran and Ash-Greninja, as well as providing good Defog support. Physical attackers that fear being burnt such as Kartana, Garchomp, Mega Scizor, and Melmetal, as well as Pokemon generally susceptible to status like Tangrowth, Volcarona, and Mega Tyranitar, synergize well with Tapu Fini due to Misty Terrain protecting them from status. Due to Tapu Fini being weak to Electric- and Grass-type moves, Pokemon that can take these attacks such as Gliscor, Ferrothorn, Zapdos, and Mega Latias are solid teammates. In return, Tapu Fini takes the Ice- and Fire-type attacks directed at them. Pokemon such as Mega Lopunny and Mega Scizor that appreciate its reliable Defogging are also good partners. Lastly, it checking offensive behemoths like Greninja and Heatran makes Volcarona and Gliscor stellar partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Earlier versions by", "members": [{"user_id": 475916, "username": "Sputnik"}]}, {"name": "Quality checked by", "members": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Kartana": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}, {"name": "Synthesis Utility"}, {"name": "Choice Scarf"}]},
  "Zeraora": {"sets": [{"name": "Offensive Pivot"}]},
  "Rillaboom": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Corviknight": {
    "comments": "<h1>Other Options</h1> <p>Iron Head is an option over Brave Bird or Body Press, allowing Corviknight to defeat Calm Mind Clefable while still hitting Mega Tyranitar and Kyurem decently hard. Iron Defense in tandem with Body Press can be used on stall teams to keep pace with Swords Dance Garchomp and Landorus-T, but this role is often better filled by Skarmory or Quagsire. Taunt can be used to shut down passive Pokemon like Toxapex, Hippowdon, and Clefable while also blocking any attempt to set up and blow past Corviknight. Unfortunately, Corviknight's other moves have much greater opportunity costs than Taunt has benefits. Shed Shell can be used to escape Magnezone, but losing Leftovers or Rocky Helmet is extremely detrimental, and having little use against teams without Magnezone makes it very matchup dependent.</p> <h1>Checks and Counters</h1> <p><strong>Electric-type Pokemon and Coverage: Magnezone, Tapu Koko, and Zeraora all use Corviknight as a free entry point thanks to their Flying resistance. The first in particular poses a huge threat to Corviknight, as it can trap it and remove it from the game. Similarly, Pokemon like Clefable and Mega Mawile often run Electric-type coverage that can beat down Corviknight.</p> <p><strong>Fire-types: Heatran and Mega Charizard Y are easily capable of breaking past Corviknight with their STAB moves. The latter in particular can repeatedly come in if Stealth Rock is not on the field thanks to Roost. However, both must be wary of switching into too many Brave Birds or Body Presses, or of Corviknight using them to pivot into a wallbreaker like Mega Medicham or Tapu Koko.</p> <p><strong>Substitute Ground-types: Landorus-T and Excadrill are normally walled by Corviknight, but if they decide to run Substitute, they can use it as setup fodder. As Corviknight cannot touch them without the proper move and U-turn can't break their Substitutes, they can simply set up safely behind a Substitute and break past it. It should be noted that Bulk Up and Iron Defense sets can set up alongside these Pokemon, making them non-issues.</p> ",
    "sets": [
      {
        "name": "Defog Pivot",
        "description": "<p>Corviknight's ability to compress several important defensive niches at once makes it a strong utility Pokemon on many teams. Its good matchups against common entry hazard setters in Garchomp, Landorus-T, Mega Tyranitar, and Ferrothorn, alongside Pressure to deplete the PP of their entry hazards, make it a fantastic Defogger. Brave Bird is preferred to threaten Rillaboom, Garchomp, Mega Medicham, and Landorus-T, but Body Press can be used if one's team is weak to Pokemon like Excadrill and Kartana, or if one wants to secure the Mega Tyranitar matchup while discouraging Heatran from switching in. U-turn allows Corviknight to take advantage of the Pokemon it checks by granting free switch-in opportunities to teammates, preserve momentum against Pokemon that seek to take advantage of it such as Heatran and Mega Charizard Y, and escape Magnezone on the switch. Alternatively, Bulk Up can be used over U-turn to better deal with the setup sweepers Corviknight is tasked with handling, like Gliscor and offensive Landorus-T, while also letting it act as a potent wincon. However, U-turn's utility makes Bulk Up generally inferior.</p> <p>Pressure allows Corviknight to PP stall entry hazard moves of passive setters, such as Ferrothorn and Clefable lacking Calm Mind, as well as PP stall other Pokemon like Gliscor and Mega Tyranitar. 184 Defense EVs with an Impish nature allow Corviknight to not be OHKOed by +2 Continental Crush from Landorus-T, with the remaining EVs going to Special Defense to let it switch into Tapu Lele, Mega Latias, and Clefable better. Alternatively, a spread of 252 HP / 44 Def / 212 SpD with an Impish nature allows Corviknight to avoid the 2HKO from Choice Specs Tapu Lele's Hidden Power Fire while also letting it withstand +2 Garchomp's Continental Crush. If running U-turn, using 0 Speed IVs with a Relaxed nature is an option to grab as much momentum as possible against Pokemon like Clefable, although being slower than Blissey and Mega Mawile can be problematic. Leftovers prevents Corviknight from being worn down too quickly. Alternatively, Rocky Helmet can be used to punish U-turn from the likes of Mega Scizor, Landorus-T, and Mega Lopunny.</p> <p>Corviknight is heavily threatened by Fire-types like Heatran and Mega Charizard Y. Therefore, bulky Water-types like Slowbro, Slowking, Gastrodon, and Toxapex can form strong defensive cores with it. Gastrodon can also deal with a major roadblock in Zapdos; Slowbro and Slowking can form a pivot core with Corviknight; and Toxapex enjoys Corviknight checking most Ground- and Psychic-types. Corviknight has a mediocre matchup against Electric-types and Pokemon with Electric-type coverage, such as Tapu Koko, Rotom-W, and Mega Mawile. Teammates that can take these threats on, such as the aforementioned Gastrodon in Tapu Koko's case and Heatran in the case of the latter two, pair well with it. Corviknight can form pivot cores with Pokemon like Landorus-T and Mega Lopunny, with both appreciating Corviknight's ability to lure in Steel-types that they can take advantage of such as Aegislash, Magnezone, and Heatran. Pokemon that appreciate Corviknight's ability to get them in unscathed, such as Mega Medicham, Mega Mawile, and Weavile, make great partners. Weavile in particular is great at strengthening the matchup against Ground-types that Corviknight cannot properly force out, such as Landorus-T, Garchomp, and Gliscor.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 395754, "username": "Jordy"}, {"user_id": 487629, "username": "Zneon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "The Dutch Plumberjack"}, {"user_id": 517429, "username": "Finland"}, {"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 471780, "username": "Solaros & Lunaris"}]}
  },
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Zarude": {
    "comments": "<h1>Other Options</h1> <p>Zarude can utilize Leftovers for extra longevity so it isn't overly reliant on Jungle Healing for recovery; however, this greatly reduces its wallbreaking power. Grassium Z can also be used in order to beat Unaware Clefable and and have an even stronger nuke; however, you sacrifice its matchup versus much more common threats like Zapdos, Heatran, and Tangrowth. Heavy-Duty Boots is another option to repeatedly set up without being bothered by hazards, but you lose out on the power of Z-moves.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Pokemon such as Mega Mawile, Tapu Koko, and Mega Diancie can all either take a boosted hit from Zarude or outspeed it and KO. Mega Mawile in particular is an exceptional check due to Intimidate before Mega Evolving, good bulk, resistance to both of Zarude's moves, and the power to OHKO even after Defense boosts, which allow it to switch in multiple times and force it out. Unaware Clefable stonewalls Zarude and can use it as setup fodder. Clefable must be wary of Grassium Z though, and it must remain at full HP to avoid being 2HKOed by Power Whip.</p> <p><strong>Fire-types: Pokemon such as Mega Charizard Y, Volcarona, and Heatran can KO Zarude, but Zarude outspeeds them and can OHKO with a boosted Black Hole Eclipse. Heatran can stomach an unboosted Black Hole Eclipse and OHKO Zarude in return with Magma Storm or Inferno Overdrive. Both Moltres and Volcarona can burn Zarude with Flame Body, making it waste a turn removing the status instead of outright KOing them.</p> <p><strong>Fighting-types and Fighting-type Coverage: Hawlucha, Galarian Zapdos, and Mega Lopunny all can switch into Zarude multiple times and threaten to KO it. Furthermore, Fighting-type coverage on the likes of Alakazam, Kartana, and Melmetal can force it out also.</p> <p><strong>Bug-types and Bug-type Coverage: Due to Zarude's crippling 4x Bug weakness, it is extremely prone to being U-turn fodder for the likes of Landorus-T and Rillaboom. Mega Scizor and Mega Heracross also force Zarude out due to their strong Bug-type STAB moves.</p> <p><strong>Ice-types: Weavile can revenge kill Zarude if brought in safely, but, due to its frailty, it struggles to switch in. Kyurem can force out Zarude and take a boosted Darkest Lariat, but it fears a boosted Z-Move. Both are also prone to Stealth Rock chip damage.</p> <p><strong>Entry Hazards: Entry hazards can easily overwhelm and wear Zarude down long term due to its reliance on its relatively poor recovery move.</p> ",
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Zarude functions as a late-game wincon that's hard to stop once it gets going, since the combination of Bulk Up and Jungle Healing bolsters its good bulk to outlast bulkier foes. Bulk Up and its amazing Speed tier also make it hard to revenge kill. It outpaces many common threats such as Volcarona, Kyurem, and Tapu Lele, even if it's outsped by common revenge killers such as Tapu Koko, Mega Lopunny, and Greninja. However, Zarude faces competition as an offensive Grass-type from Rillaboom, Kartana, and Serperior due to it lacking immediate power. Jungle Healing allows it to shrug off crippling status, like paralysis and Toxic, and recover any chip damage it has sustained from Scald burns; however, it isn't a reliable source of recovery long term. Darkinium Z allows it to nuke would-be checks such as Zapdos, Mega Scizor, and Corviknight, and Darkest Lariat beats the likes of Iron Defense Skarmory and Corviknight by bypassing their Defense boosts. Power Whip is Zarude's strongest move, hitting Dark-resistant Pokemon such as Tyranitar, Clefable, and Tapu Fini. Furthermore, it lets Zarude hit neutral targets such as Landorus-T, Gliscor, and Tapu Lele much harder than Darkest Lariat.</p> <p>Zarude fits on bulkier balance teams, which can provide it with long-term support in the form of entry hazard stacking and other sweepers. Strong hazard support from the likes of Toxic Spikes Toxapex and Spikes Skarmory is extremely beneficial to wear down Zarude's checks in the long run, such as Tangrowth and Unaware Clefable. Pokemon such as Tapu Koko, Mega Lopunny, and Ash-Greninja appreciate Zarude breaking down bulkier teams and help its struggles with faster-paced teams. Other setup sweepers such as Calm Mind Clefable, Bulk Up Corviknight, and Mega Latias all appreciate Zarude weakening or KOing their checks, with Clefable especially enjoying it KOing Heatran and Mega Scizor. Zarude also needs sturdy Fire-resistant Pokemon because they force it to switch out or waste its Z-Move, so partners such as Toxapex, Mega Latias, and Heatran are greatly appreciated. Lastly, Pokemon such as Corviknight and Skarmory that can switch into revenge killers that threaten Zarude, such as Mega Lopunny, Hawlucha, Landorus-T, and Kartana, are required. Zarude’s typing gives it amazing defensive utility, allowing it to solidly check Ash-Greninja and switch into Slowbro and Slowking; however, Scald burns forcing it to use Jungle Healing can easily be taken advantage of. It can also reliably switch into Ground-types such as Gliscor and Garchomp and threaten them out. These defensive capabilities make it a good partner with the likes of Heatran, Gliscor, and Mega Diancie.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 497633, "username": "Avery"}, {"user_id": 517892, "username": "pannuracotta"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  }
}