{
  "Blastoise": {"sets": [{"name": "Follow Me Support", "description": "<ul> <li>The EV spread let Blastoise survive a Leaf Blade from 4 Atk Miracle Seed Kartana.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Weezing-Galar": {"sets": [{"name": "Neutralizing Gas"}]},
  "Chansey": {"sets": [{"name": "Bulky Utility"}]},
  "Zapdos": {"sets": [{"name": "Rain Attacker"}, {"name": "Defensive Tailwind", "description": "<ul> <li>The EV spread is primarily geared towards allowing Zapdos to survive a +1 Meteor Beam from Nihilego while it has a +1 Special Defense boost, and it also lets Zapdos outrun opposing Choice Scarf Genesect while Tailwind is up. The leftover EVs are dumped onto Special Attack.</li> </ul> <p>These are sample sets while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Zapdos-Galar": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}]},
  "Mew": {"sets": [{"name": "Tailwind Support"}]},
  "Politoed": {"sets": [{"name": "Drizzle Support"}]},
  "Kingdra": {"sets": [{"name": "Rain Attacker"}]},
  "Porygon2": {"sets": [{"name": "Trick Room Setter", "description": "<ul> <li>The Special Defense investment allows Porygon2 to survive the combination of Meteor Beam and Sludge Bomb from +1 Nihilego.</li> <li>The Defense investment lets Porygon2 survive two Sacred Swords from 4 Atk Kartana</li> <li>The remaining EVs are dumped onto Special Attack</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Tyranitar": {"sets": [{"name": "Bulky Attacker"}]},
  "Ludicolo": {"sets": [{"name": "Rain Attacker"}]},
  "Pelipper": {"sets": [{"name": "Offensive Rain Setter"}]},
  "Torkoal": {"sets": [{"name": "Sun Attacker"}]},
  "Heatran": {"sets": [{"name": "Fast Attacker"}]},
  "Cresselia": {"sets": [{"name": "Calm Mind"}]},
  "Excadrill": {"sets": [{"name": "Sand Rush"}, {"name": "Mold Breaker"}]},
  "Whimsicott": {"sets": [{"name": "Prankster Support"}]},
  "Amoonguss": {"sets": [{"name": "Rage Powder Support", "description": "<ul> <li>The EV spread is primarily geared towards allowing Amoonguss with its Sitrus Berry to survive two Heat Waves from Volcanion, with the rest of the EVs being dumped to Defense.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Landorus-Therian": {"sets": [{"name": "Intimidate Pivot", "description": "<ul> <li>The EV spread is geared towards allowing Landorus-T to survive a +1 Meteor Beam from Nihilego and KO back with Earth Power. The leftover EVs are dumped onto Defense.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Kyurem-Black": {"sets": [{"name": "Defensive", "description": "<ul> <li>The EV spread is primarily geared towards allowing Kyurem-B to survive a +1 Meteor Beam from Nihilego with the Special Defense boost from either Assault Vest or Misty Seed, and the EV spread also allows Kyurem-B to outrun threats with up to base 115 Speed that have a Speed drop from Icy Wind, with Persian-A and Kartana as the primary targets. The leftover EVs are dumped into Special Attack.</li> </ul> "}, {"name": "Life Orb Attacker"}]},
  "Genesect": {"sets": [{"name": "Choice Scarf"}, {"name": "Assault Vest"}]},
  "Zygarde": {"sets": [{"name": "Choice Band"}, {"name": "Dragon Dance"}]},
  "Diancie": {"sets": [{"name": "Trick Room Attacker", "description": "<ul> <li>The EV investment and a Sassy nature maximizes Diancie's Attack while efficiently letting it survive a Steam Eruption from Volcanion.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Volcanion": {"sets": [{"name": "Bulky Attacker"}]},
  "Incineroar": {
    "overview": "<p>The combination of an excellent ability, access to valuable utility moves, and solid stats makes Incineroar one of the best pivots in the tier. It fits well on a variety of team structures because of its great defensive utility being appreciated on most archetypes. Specifically, setup threats such as Calm Mind Tapu Fini and Dragon Dance Dragapult appreciate its ability to generate safe turns, while strong offensive Pokemon such as Kartana and Urshifu-R value the slow and safe switch-in generated through Parting Shot. However, Incineroar faces competition from other Fire-types such as Volcanion and Heatran, and it has rough matchups against common Pokemon such as Tapu Fini and Zygarde. It is also easily worn down pivoting in and out, especially since it rarely can fit Protect or a recovery item in its repertoire.</p> ",
    "comments": "<h1>Other Options</h1> <p>Sitrus Berry and Assault Vest are options over Heavy-Duty Boots for either recovery that can turn 2HKOs into 3HKOs or more special bulk, but they are usually not worth the risk of running into Stealth Rock. When running Assault Vest, use U-turn over Parting Shot, but the minimal damage is usually less helpful than Parting Shot's stats drops, so you shouldn't use it unless needed. Safety Goggles lets it act as a more reliable check to Amoonguss, but it makes Incineroar very vulnerable to entry hazards and leaves it with no healing. Taunt shuts down any Trick Room setters, but it's hard to to justify using over any of Incineroar's usual moves, which have much more utility overall.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<ul> <li> <p>Fake Out can provide space for your partner to boost its stats, provide speed control, switch, or attack.</p> </li> <li> <p>Flare Blitz is a strong STAB move that hits Pokemon such as Rillaboom, Amoonguss, and Genesect for super effective damage. Despite little investment, it still hits hard due to Flare Blitz's high Base Power, which is worth the recoil.</p> </li> <li> <p>Knock Off is a great utility move because removing items is always beneficial. Specifically, it can remove important items such as Eviolite on Porygon2, Assault Vest on Kyurem-B, and Leftovers on Tapu Fini.</p> </li> <li> <p>Parting Shot allows you to grab momentum while also enabling recycling of Fake Out and Intimidate. It also has the added bonus of crippling common switch-ins such as Urshifu-R and Volcanion.</p> </li> <li> <p>Heavy-Duty Boots keeps Incineroar safe from entry hazards, especially Stealth Rock, which makes its life as a pivot much easier.</p> </li> <li> <p>Intimidate weakens most opposing physical attackers on the switch in, notably Zygarde, often forcing them out to reset their own stats.</p> </li> <li> <p>The EV spread allows Incineroar to survive a Steam Eruption from Volcanion and OHKO Dragapult with Knock Off. EVs can be moved to Speed to outpace threats in Tailwind, notably Kartana.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 188164, "username": "MajorBowman"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Tsareena": {"sets": [{"name": "Assault Vest", "description": "<ul> <li>The EV spread maximizes Speed while also allowing Tsareena to survive a +1 Sludge Bomb from Nihilego.</li> </ul> "}, {"name": "Sitrus Berry + Taunt", "description": "<ul> <li>The EV spread lets Tsareena take two Sacred Swords from 4 Atk Kartana without the need of a Sitrus Berry, and it also lets Tsareena survive a Choice Specs Draco Meteor from Dragapult.</li> </ul> <p>These are sample sets while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Kommo-o": {"sets": [{"name": "Omnibooster"}, {"name": "Iron Defense"}]},
  "Tapu Koko": {"sets": [{"name": "Choice Specs Attacker"}]},
  "Tapu Lele": {"sets": [{"name": "Choice Specs"}, {"name": "Life Orb"}, {"name": "Choice Scarf"}]},
  "Tapu Fini": {"sets": [{"name": "Calm Mind", "description": "<ul> <li>The EV spread allows Tapu Fini to survive a Leaf Blade from 4 Atk Miracle Seed Kartana.</li> </ul> "}, {"name": "Heal Pulse Support", "description": "<ul> <li>The EV spread allows Tapu Fini to survive a Leaf Blade from 4 Atk Miracle Seed Kartana as well as a Shadow Ball from a +2 Life Orb Spectrier.</li> </ul> <p>These are sample sets while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Nihilego": {"sets": [{"name": "Meteor Beam Attacker"}]},
  "Celesteela": {"sets": [{"name": "Bulky Leech Seed", "description": "<ul> <li>The EV Spread allows Celesteela to survive a Thunderbolt from Choice Specs Tapu Koko in Electric Terrain.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Kartana": {"sets": [{"name": "Fast Attacker"}]},
  "Necrozma": {"sets": [{"name": "Bulky Attacker"}]},
  "Zeraora": {"sets": [{"name": "Assault Vest"}]},
  "Rillaboom": {"sets": [{"name": "Bulky Pivot", "description": "<ul> <li>The EV spread is primarily geared towards surviving either a +1 U-turn from Genesect or a +1 Sludge Bomb from Nihilego. The leftover EVs are dumped onto Attack.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Hatterene": {"sets": [{"name": "Offensive Trick Room"}]},
  "Indeedee-F": {"sets": [{"name": "Follow Me Support"}]},
  "Dracovish": {"sets": [{"name": "Choiced Attacker"}]},
  "Dragapult": {"sets": [{"name": "Special Attacker"}, {"name": "Dragon Dance"}]},
  "Urshifu-Rapid-Strike": {
    "overview": "<p>Urshifu-R is one of the most threatening offensive Pokemon in Doubles, possessing a monstrous base 130 Attack, a great offensive typing, and the unique ability to bypass most traditional defensive counterplay such as Intimidate, Protect, and Defense boosting thanks to the combination of Unseen Fist ignoring protection and Surging Strikes's guaranteed critical hits. This makes it one of the strongest candidates to answer metagame staples like Kyurem-B, Incineroar, Porygon2, and Diancie. Due to Urshifu-R's excellent offensive prowess, defensive answers are limited to mainly just Amoonguss and Tapu Fini, two Pokemon that resist all of its STAB attacks. Instead, it is often answered offensively by the likes of Rillaboom, Kartana, and Necrozma. Urshifu-R is held back by a fairly middling Speed tier, meaning pairing it with speed control and priority will be very helpful. As such, Zapdos and Kartana are excellent partners, providing Tailwind support and a way to hit Water-types. Other examples of good teammates include Tapu Lele and Indeedee-F for providing Psychic Terrain, which keeps Urshifu-R safe from priority moves like Fake Out and Grassy Glide, and Heatran, which is excellent for hitting Grass-types.</p> ",
    "comments": "<h1>Other Options</h1> <p>Urshifu-R can outrun the entire unboosted metagame with a Choice Scarf; however, this comes at a significant decrease in power, as it loses its ability to OHKO Porygon2 and Genesect. An Adamant nature can somewhat make up for the loss of offensive pressure, but the set then fails to outspeed Jolly Kyurem-B and Zygarde after a Dragon Dance. Ice Punch can be utilized on a Choice Band set to score a surprise OHKO on Zygarde. Poison Jab is the best way to hit Tapu Fini, which otherwise walls Urshifu-R completely. Both of these moves don't have much use otherwise, though.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Surging Strikes is incredibly free to use thanks to its guaranteed critical hits bypassing any form of damage reduction, like Intimidate. It can easily pick up OHKOs on Incineroar, Landorus-T, and Diancie.</p> </li> <li> <p>Close Combat is Urshifu-R's strongest attack, possessing the rare ability to OHKO Kyurem-B and Porygon2. Even neutral foes like Rillaboom and Volcanion will take a large amount of damage from it.</p> </li> <li> <p>Aqua Jet is reliable priority that can  pick off foes with low Defense like Volcarona and Nihilego.</p> </li> <li> <p>U-turn is a decently hard-hitting move that allows Urshifu-R to pivot out of unfavorable situations. This can be especially useful for the opposing Grass-types it baits in, letting it switch out to proper checks. Protect is important on Life Orb sets for keeping Urshifu-R safe from the Grass- and Electric-type attacks that it often baits in.</p> </li> <li> <p>A Choice Band and maxed out Attack EVs allow Urshifu-R to make the most out of its offensive potential, notably scoring the OHKO on physically defensive Porygon2, which Life Orb sets cannot. However, Life Orb allows Urshifu-R to switch moves and run Protect. 252 Speed EVs and a Jolly nature let Urshifu outspeed base 95s like Kyurem-B and Tapu Lele.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 188164, "username": "MajorBowman"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Spectrier": {"sets": [{"name": "Fast Attacker"}]}
}