{
  "Clefable": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {"name": "Kee Berry Sweeper", "description": "<ul> <li> <p>This Clefable aims to take advantage of opposing setup sweepers in order to augment its own stats and reverse sweep.</p> </li> <li> <p>Moonlight is chosen to guarantee quick healing and for getting boosted healing in sun, which can be set by Clefable's own Max Flare. Be wary of its low PP and other weathers before committing to sweeping and relying on it for healing.</p> </li> <li> <p>Kee Berry is used to grant Clefable a one-time boost of Defense and can be used in combination with Dynamax to ensure Clefable can survive hits such as Excadrill's Iron Head.</p> </li> <li> <p>The given EV spread gives near maximum physical bulk and is used to survive an initial physical hit as well as possible before getting the +1 Defense boost from Kee Berry.</p> </li> </ul> "},
      {"name": "Trick Crippler", "description": "<ul> <li> <p>Clefable when equipped with Flame Orb or Lagging Tail can cripple various attackers, making them easy setup fodder for teammates.</p> </li> <li> <p>Stealth Rock provides additional support, but can be sacrificed for Flamethrower coverage, in order to ensure Ferrothorn and Celesteela cannot switch in with impunity.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Flame Orb allows Clefable to cripple physical attackers with Trick.</p> </li> <li> <p>Lagging Tail and Full Incense are an extremely effective form of Speed control with Trick, with even fast Pokemon, and Pokemon under Trick Room being impacted by it.</p> </li> <li> <p>Leftovers can also be opted for, and provides a decent all around Stealth Rock lead with two useful complementary attacks.</p> </li> </ul> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Chansey": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Wall"}]},
  "Gyarados": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Gyarados's combination of unique typing and movepool make it a good choice for Max Airstream sweeping.</p> </li> <li> <p>Dragon Dance is a great option on Gyarados, making it less reliant on Dynamax to sweep.</p> </li> <li> <p>Power Whip provides coverage against bulky Water-types, most notably slamming Rotom-W, Tapu Fini, and Swampert.</p> </li> <li> <p>Earthquake deals massive damage to Electric-types such as Raikou, Tapu Koko, and Magnezone, while giving Gyarados a valuable Special Defense boost as Max Quake.</p> </li> <li> <p>Taunt deserves special mention for shutting down passive Pokemon such as Hippowdon, Swampert, and defensive Celesteela, giving Life Orb Gyarados more set up opportunities.</p> </li> <li> <p>Ice Fang is also a reasonable coverage option, hitting Dragon-types such as Garchomp, Salamence, and Dragonite much more effectively.</p> </li> <li> <p>Stone Edge is Gyarados's strongest option against Zapdos.</p> </li> <li> <p>Intimidate is a good choice for allowing Gyarados to set up Dragon Dance more freely, while Moxie allows Gyarados to potentially sweep with just KOs from Max Airstream.</p> </li> <li> <p>A Jolly nature and the given EV spread ensures that Gyarados outspeeds Tapu Koko and Dragapult after a Speed boost.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Lum Berry insulates Gyarados from status such as Sleep and Burn. When used with Dragon Dance, this makes Gyarados an effective lead against Hippowdon and Swampert.</p> </li> <li> <p>Life Orb makes Gyarados an effective Dynamax sweeper, and should always be used if Gyarados gives up Dragon Dance for more coverage.</p> </li> <li> <p>Wacan Berry is a less common option for Gyarados that lets it survive some Electric-type attacks while Dynamaxed.</p> </li> </ul> "
      },
      {
        "name": "Bulky Dragon Dance",
        "description": "<ul> <li> <p>This Gyarados takes a slower approach to sweeping, and uses increased bulk and Intimidate to better check major threats.</p> </li> <li> <p>Taunt is extremely useful for punishing passive Pokemon that Gyarados may otherwise have trouble setting up on, such as Hippowdon, Swampert, and defensive Celesteela.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Sitrus Berry is a good, reliable way for Gyarados to gain back a short burst of health.</p> </li> <li> <p>When paired with Chesto Berry, Rest is useful for giving Gyarados a second chance at sweeping later, at the cost of immediate recovery that Sitrus Berry provides.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 156 Def / 100 Spe with Impish: This EV spread allows Gyarados to outspeed Nihilego with one Speed boost, and avoid a 2HKO from Life Orb Cinderace's Max Airstream with Sitrus Berry after Stealth Rock damage.</p> </li> <li> <p>252 HP / 252 Def / 4 Spe with Impish: This EV spread maximizes Gyarados's physical bulk.</p> </li> <li> <p>156 HP / 164 Def / 188 Spe with Impish: This EV spread outspeeds Timid Celesteela, while still giving Gyarados a 95% chance to avoid a 2HKO from Cinderace's Life Orb Max Airstream after Stealth Rock and Sitrus Berry.</p> </li> <li> <p>252 HP / 132 Atk / 20 Def / 4 SpD / 100 Spe with Adamant: This is a more offensive approach for Gyarados, allowing it to survive two Max Airstreams from Life Orb Cinderace after Sitrus Berry, and outspeed Nihilego after one Speed boost</p> </li> <li> <p>252 HP / 20 Def / 4 SpD / 232 Spe with Jolly: This EV spread allows Gyarados to outspeed up to Timid Dragapult and Tapu Koko after one Speed boost, while being able to avoid a 2HKO from Life Orb Cinderace's Max Airstream after Sitrus Berry.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Lapras": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "G-Max Resonance"}]},
  "Ditto": {
    "overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ",
    "sets": [
      {
        "name": "Revenge Killer",
        "description": "<ul> <li> <p>With Imposter, Ditto becomes one of the most effective revenge killers in the format, dealing with massive threats such as Zacian-C, Calyrex-S, offensive Eternatus, and a variety of weakened Dynamax sweepers such as Seismitoad and Dragapult.</p> </li> <li> <p>Imposter has a special interaction with Zacian's Intrepid Sword, granting Ditto an Attack boost upon transforming. This can make weakening Zacian-C into KO range of +2 Behemoth Blade a serious win condition to consider.</p> </li> <li> <p>Ditto is a fairly capable user of Dynamax depending on what it copies, so always consider that as another potential win condition. Dynamax also allows Ditto to either get around a poor Choicelock or prevent itself from locking its move for three turns if used turn one.</p> </li> <li> <p>While any Pokemon appreciates Stealth Rock support, it's especially notable for Ditto, since Stealth Rock nullifies Focus Sash and makes revenge killing Calyrex-S much more reliable.</p> </li> <li> <p>Consider benching Ditto if facing a dedicated stall team or Trick Room team, as it has major issues breaking through them.</p> </li> <li> <p>While Zacian-C and Calyrex-S are excellent targets for Ditto to use for sweeping, make sure to pay attention to team preview, as well-crafted teams may have Pokemon in the back to specifically prevent Ditto sweeps. Examples include Quagsire and bulky Steel-types against Zacian-C and physically defensive Porygon2 and Mimikyu for Calyrex-S.</p> </li> <li> <p>Focus Sash Ditto needs a way to prevent Stealth Rock to be most effective. Teams with Choice Scarf Kyogre have a particularly good use for Focus Sash Ditto, since Choice Scarf Kyogre will be less expected with Ditto on team preview. Taunt users such as Tapu Fini, Grimmsnarl, and Yveltal are also good options to consider.</p> </li> <li> <p>When using Focus Sash Ditto, consider some forms of speed control to give Ditto a better chance at sweeping foes. Paralysis support is the easiest option to consider, with a wide variety of Pokemon to choose from such as Porygon2 and Chansey, but another option includes Trick + Lagging Tail from Prankster Grimmsnarl, Mimikyu, and Tapu Fini. The most extreme method is using Sticky Web support, but setters such as Galvantula and Shuckle make this strategy unfriendly to beginners.</p> </li> <li> <p>A Relaxed nature and 0 Speed IVs give Ditto the best chance of winning in the rare mirror match.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Scarf makes Ditto better at revenge killing its weakened targets.</p> </li> <li> <p>Focus Sash is a high risk, high reward alternative that allows Ditto to switch moves, at the cost of being very vulnerable to Stealth Rock nullifying its Focus Sash.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 146, "username": "Tox"}, {"user_id": 336524, "username": "greilmercenary9"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Snorlax": {
    "overview": "<h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {"name": "Gmax Setup Sweeper", "description": "<ul> <li> <p>Snorlax can use Belly Drum or Curse to raise its stats to frightening levels and break many Pokemon who would otherwise wall it.</p> </li> <li> <p>Heavy Slam and Earthquake are both great coverage choices in the Crown Tundra metagame, and when using them with Gigantamax, it allows Snorlax to boost its Defense and Special Defense with their respective Max Moves.</p> </li> <li> <p>Figy Berry helps Snorlax gain back significant health when dropped below half HP, and can also be restored with Gmax Replenish.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>220 HP / 212 Def / 76 SpD Careful: This spread deals with prominent Special Attack boosting foes, such as Nihilego, and helps Snorlax wall with both its physical and special bulk.</p> </li> <li> <p>212 HP / 252 Def / 52 Spe Impish: Outspeeds Toxapex to avoid getting hit by Haze following a Belly Drum.</p> </li> </ul> "},
      {"name": "Yawn Support", "description": "<ul> <li> <p>Snorlax is a solid Yawn abuser, living nearly all Max Move attacks at full HP to guarantee disruption to its foes.</p> </li> <li> <p>Heavy Slam allows Snorlax to hit the relevant Ghost-types well and boosts Defense with Max Steelspike, while Earthquake hits Nihilego and Heatran well, and raises Special Defense with Max Quake.</p> </li> <li> <p>Leftovers is used with Thick Fat, regular form Snorlax, and Protect, as those have the most impact when no berry is held. Figy Berry is used with Gluttony and Gigantamax in order to gain back health when in a pinch, and can also be restored with Gmax Replenish or Recycle.</p> </li> </ul> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Zapdos": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Dynamax Attacker"}, {"name": "Defensive"}, {"name": "Defensive Kee Berry"}, {"name": "Choice Scarf"}]},
  "Zapdos-Galar": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B- Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Dynamax Sweeper",
        "description": "<ul> <li> <p>Galarian Zapdos has the tools to be a decent Max Airstream sweeper, though its poor match-up against other Max Airstream sweepers limits its potential.</p> </li> <li> <p>Close Combat is Galarian Zapdos's most powerful STAB. Thunderous Kick's Defense drop does play better to hit and run tactics, however.</p> </li> <li> <p>Brave Bird is the obvious choice for a strong Max Airstream, but Dual Wingbeat can be useful for busting through Urshifu-R's Focus Sash after a boost, and dealing damage through Mimikyu's Disguise.</p> </li> <li> <p>Bulk Up is Galarian Zapdos's only means to set up outside of Dynamax, and can be key to helping it survive unfavorable physical match-ups with the Defense boost.</p> </li> <li> <p>Blaze Kick is Galarian Zapdos's strongest attack against Celesteela if Dynamaxed.</p> </li> <li> <p>Taunt punishes passive Pokemon like Hippowdon, Swampert, and Ferrothorn.</p> </li> <li> <p>U-turn can make Galarian Zapdos a decent pivot.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy works well with Dynamax, especially considering how many weaknesses Galarian Zapdos has.</p> </li> <li> <p>Life Orb is a good alternative that doesn't put as much pressure on Dynamaxing.</p> </li> <li> <p>Lum Berry protects Galarian Zapdos from status, making it more difficult to stop while Dynamaxed.</p> </li> </ul> "
      },
      {"name": "Choice Attacker", "description": "<ul> <li> <p>Galarian Zapdos has a good enough Speed tier and offenses to make a decent Choice Attacker. It also has access to U-turn, which is useful for pivoting.</p> </li> <li> <p>Close Combat is the obvious choice for a strong Fighting-type STAB, but Thunderous Kick's guaranteed Defense drop can come in handy if Galarian Zapdos must switch out.</p> </li> <li> <p>Brave Bird is the prefered choice for a Flying-type STAB, but Dual Wingbeat is a reasonable option to hit through Focus Sash and Mimikyu's disguise.</p> </li> <li> <p>Blaze Kick is Galarian Zapdos's strongest option against Celesteela while Dynamaxed.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Scarf lets Galarian Zapdos outspeed several key threats, such as Pheromosa and Dragapult.</p> </li> <li> <p>Choice Band makes Galarian Zapdos harder to switch in to, most notably 2HKOing defensive Tapu Fini with Brave Bird.</p> </li> </ul> "},
      {"name": "Focus Sash", "description": "<ul> <li> <p>With Counter and Focus Sash, Galarian Zapdos can surprise common problematic Max Airstream users such as Cinderace and Landorus-T with a KO.</p> </li> <li> <p>Close Combat is an easy choice with its high power, but Thunderous Kick benefits hit and run tactics more.</p> </li> <li> <p>Since Galarian Zapdos is using Focus Sash, Dual Wingbeat is the best choice for a Flying-type STAB.</p> </li> <li> <p>U-turn allows Galarian Zapdos to pivot out of unfavorable match-ups, but Taunt is useful for shutting down Stealth Rock set up from more passive Pokemon. Bulk Up can give Galarian Zapdos the Attack boost it needs to pull off a surprise late-game sweep.</p> </li> </ul> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Moltres-Galar": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Dynamax Sweeper"}]},
  "Dragonite": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Physical Sweeper"}, {"name": "All-Out Attacker"}]},
  "Azumarill": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Bad Bunny (Huge Power Wallbreaker)",
        "description": "<ul> <li> <p>Azumarill is an uncommon but unique wallbreaker in Battle Stadium, with decent bulk, useful dual STAB coverage, and a great priority move to beat much of the metagame that doesn't resist its attacks.</p> </li> <li> <p>Superpower gives Azumarill a way to beat Ferrothorn while providing Max Knuckle Attack boosts during Dynamax, whereas Bounce is used with Life Orb to help Azumarill become a surprise sweeper.</p> </li> <li> <p>The given EVs allow Azumarill to have decent bulk while outspeeding uninvested Celesteela, and avoiding a Special Attack boost from Download Porygon2. The leftover 4 EVs can be put anywhere but Defense.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Assault Vest makes Azumarill quite bulky, especially while Dynamaxed.</p> </li> <li> <p>Choice Band makes Azumarill an effective hit and run attacker.</p> </li> <li> <p>Life Orb, while compromising Azumarill's bulk, is the most effective wall-breaking tool for it, making Azumarill a good Dynamax attacker.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Quagsire": {
    "overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ",
    "sets": [
      {
        "name": "Zacian-C Check",
        "description": "<ul> <li> <p>Despite mediocre stats, Quagsire makes itself very important by checking one of the best Pokemon in the game, Zacian-C! This makes Quagsire a staple both on stall teams and on more balanced and offensive teams that desperately need a Zacian-C check.</p> </li> <li> <p>Yawn is highly recommended, as it lets Quagsire pressure special attackers that switch in as long as Stealth Rock is up, and it can stop Necrozma-DM before its Dragon Dances get too out of control.</p> </li> <li> <p>Earthquake lets Quagsire usually 3HKO Zacian-C on its own. It also usually 4HKOes defensive Necrozma-DM, though Sunsteel Strike, which ignores Unaware, and Weakness Policy make this a risky tactic.</p> </li> <li> <p>Scald is very weak, but it prevents Landorus-T from totally walling Quagsire, and the 30% chance to burn is quite useful. The burn can conflict with Toxic and Yawn, however.</p> </li> <li> <p>Quagsire gets access to the rare and useful Toxic, which is great for putting bulky switch-ins to Quagsire on a timer, such as Kyogre.</p> </li> <li> <p>Protect can help stall out powerful Dynamax users such as Life Orb Landorus-T that can threaten to break through Quagsire, and it also has great synergy with Yawn and Leftovers.</p> </li> <li> <p>Stockpile is an alternate way to protect Quagsire against powerful physical Dynamax users, turning a lot of moves that 2HKO into a 3HKO, such as Life Orb Landorus-T's Max Quake.</p> </li> <li> <p>Pairing Blissey or Chansey alongside Quagsire is highly suggested, since most powerful special attackers easily KO it. Blissey in particular does well against Kyogre thanks to Utility Umbrella.</p> </li> <li> <p>Although Quagsire is mostly used to check Zacian-C, Water Absorb is a surprise option that makes Quagsire a good Kyogre check instead. The surprise factor at Team Preview is the main value, though, as Gastrodon is a better Kyogre check otherwise. When playing against Quagsire, consider the possibility of Water Absorb at Team Preview if it is paired with a strong secondary Zacian-C check, such as Necrozma-DM.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Rocky Helmet lets Quagsire deal some immediate chip damage when switching into Zacian-C, making it an even better check! It's especially important when using Quagsire on full stall teams, since the extra chip damage can be vital when timer stalling.</p> </li> <li> <p>Leftovers works very well with Protect, and it can help Quagsire escape some potential 2HKO cases. It also gives Quagsire some recovery pressure with Yawn, which can be useful on more balanced teams.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 146, "username": "Tox"}, {"user_id": 336524, "username": "greilmercenary9"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Umbreon": {
    "overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ",
    "sets": [
      {
        "name": "KINGSLAYER (Defensive Support)",
        "description": "<ul> <li> <p>With its good bulk, Yawn, and STAB Foul Play, Umbreon has a small niche as an answer to both Calyrex-S and Calyrex-I.</p> </li> <li> <p>Foul Play provides consistent damage, puts heavy pressure on Calyrex-S thanks to its quadruple weakness, and can do decent damage to Zacian-C trying to come in.</p> </li> <li> <p>Snarl is less useful against Calyrex-I, but it can completely shut down Calyrex-S, as well as annoying most special threats thanks to the Special Attack drop.</p> </li> <li> <p>Moonlight can be used in place of Wish for instant, though inconsistent, recovery.</p> </li> <li> <p>Though Umbreon should only Dynamax in the most dire of situations, a Careful nature will make Max Darkness slightly stronger.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Leftovers is the most sensible item, granting Umbreon consistent passive recovery, lessening the need to use Wish and Protect.</p> </li> <li> <p>Sitrus Berry is an alternative to Leftovers, providing Umbreon with a quick burst of health after taking some damage.</p> </li> <li> <p>Utility Umbrella can allow Umbreon to better stand up to Kyogre, and it also enables more consistent recovery if using Moonlight. However, even with Utility Umbrella, Umbreon should not be relied on as a Kyogre answer.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 4 Def / 252 SpD with Calm - This spread maximizes Umbreon’s special bulk, allowing it to consistently check Calyrex-S.</p> </li> <li> <p>252 HP / 252 Def / 4 SpD with Bold - This spread allows Umbreon to better take physical attacks but severely hinders its consistency against Calyrex-S and other special threats.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 146, "username": "Tox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Skarmory": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Physical Wall"}]},
  "Porygon2": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Defensive"}, {"name": "Specially Defensive"}]},
  "Blissey": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Calm Mind"}]},
  "Raikou": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A- Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>Raikou's great Speed stat and shockingly good coverage make it a good choice for Calm Mind sweeping.</p> </li> <li> <p>Substitute pairs very well with Pressure for PP stalling, punishes more flimsy checks, and also protects Raikou from status.</p> </li> <li> <p>Rest with Chesto Berry is a reasonable alternative for giving Raikou more chances to set up Calm Mind.</p> </li> <li> <p>Volt Switch lets Raikou function as a pivot when needed. Extrasensory is mainly for hitting Naganadel as hard as possible.</p> </li> <li> <p>Shadow Ball does good damage to Dragapult, and Aura Sphere can be used if your team has issues with Ferrothorn.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Leftovers pairs the best with Calm Mind and Substitute.</p> </li> <li> <p>Life Orb turns Raikou into a more immediate sweeper, and works especially well when Raikou Dynamaxes.</p> </li> <li> <p>Always hold Chesto Berry when using Rest, as Raikou can't afford spending time asleep.</p> </li> </ul> "
      },
      {"name": "Choice Specs", "description": "<ul> <li> <p>Raikou's ability to pivot with Volt Switch, combined with its good Speed stat and coverage, make Choice Specs a reasonable option for it.</p> </li> <li> <p>Extrasensory is Raikou's best attack against Naganadel, while Shadow Ball hits Dragapult hard. Aura Sphere lets Raikou deal a good amount of damage to Ferrothorn, who otherwise walls Raikou.</p> </li> </ul> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Suicune": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>Suicune has some trouble competing with Tapu Fini as a bulky Water-type, but access to tools such as Pressure and a unique movepool give it some niches over the more common Pokemon.</p> </li> <li> <p>Ice Beam is Suicune's most reliable coverage against Dragon-types such as Salamence and Dragapult. Sheer Cold isn't very reliable, but it does give Suicune a 20% chance to OHKO extremely bulky Pokemon such as Tapu Fini and Cresselia, and still gives Suicune a powerful Max Hailstorm.</p> </li> <li> <p>Icy Wind deserves mention for giving Suicune a decent option for Speed control.</p> </li> <li> <p>Air Slash gives Suicune access to Max Airstream, a rare tool for bulky Water-types.</p> </li> <li> <p>Substitute saves Suicune from status moves such as Yawn and Leech Seed, letting it set up on certain passive Pokemon such as Swampert and defensive Celesteela.</p> </li> <li> <p>When paired with Chesto Berry, Rest gives Suicune one chance to recover all its health without much consequence, something Tapu Fini is unable to do.</p> </li> <li> <p>Roar lets Suicune win Calm Mind wars against any Pokemon that lacks Taunt, in addition to phazing set-up sweepers in general before they Dynamax.</p> </li> <li> <p>Protect pairs well with Pressure and Leftovers, letting Suicune scout common choice locked Pokemon such as Rillaboom and Regieleki.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Leftovers gives Suicune the most sticking power for its more defensive variants, and pairs well with Substitute and Protect.</p> </li> <li> <p>Sitrus Berry gives Suicune a more immediate burst of health, useful for more offensive variants.</p> </li> <li> <p>Chesto Berry lets Suicune wake up from Rest without wasting a turn.</p> </li> <li> <p>Weakness Policy is an unusual option that lets Calm Mind Suicune take advantage of common checks while Dynamaxed, such as Tapu Koko and Regieleki.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 100 Def / 156 Spe with Bold: This EV spreads outspeeds up to Timid Celesteela, while giving Suicune good physical bulk.</p> </li> <li> <p>100 HP / 252 SpA / 156 Spe with Modest: This is a more offensive take on Suicune that still outspeeds Timid Celesteela.</p> </li> <li> <p>252 HP / 252 Def / 4 Spe with Bold: This EV spread maximizes Suicune's physical bulk.</p> </li> <li> <p>4 HP / 252 SpA / 252 Spe with Modest or Timid: This is a far more offensive approach to Suicune, maximizing its power and Speed to take advantage of Max Airstream. Modest gives Suicune some extra fire power and outspeeds up to Timid Tapu Koko after a Max Airstream, while Timid outspeeds Dragapult.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Tyranitar": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Bulky Attacker"}, {"name": "Support"}]},
  "Lugia": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Calm Mind"}]},
  "Ho-Oh": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Defensive"}, {"name": "Assault Vest"}, {"name": "Offensive"}]},
  "Blaziken": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Physical Sweeper"}, {"name": "Baton Pass"}]},
  "Swampert": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Stealth Rock Support"}, {"name": "Offensive Focus Sash"}]},
  "Shedinja": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/shedinja-qc-2-2-gp-0-1.3698786/\">A rought draft of the analysis can be found here.</a></p> ", "sets": [{"name": "Wonder Guard"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 146, "username": "Tox"}]}], "writtenBy": [{"user_id": 542590, "username": "Comradesquidwar"}]}},
  "Salamence": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<ul> <li> <p>Salamence is a very threatening Max Airstream sweeper, with just enough coverage to make it difficult to check with defensive Pokemon.</p> </li> <li> <p>Dual Wingbeat is the clear choice over Fly for a Flying-type STAB, as it's more reliable outside of Dynamax, and its multi-hit nature is useful against frail Focus Sash Pokemon such as Pheromosa.</p> </li> <li> <p>Fire Blast is highly recommended for hitting Celesteela as hard as possible when Dynamaxed. Fire Fang, while very weak on its own, can make sense on Moxie Salamence as a powerful Fire-type Attack under Dynamax.</p> </li> <li> <p>Earthquake is also highly valuable for hitting other Steel-types hard such as Heatran and Metagross.</p> </li> <li> <p>Although this makes Salamence walled by certain Pokemon, some coverage can be given up to slot in Dragon Dance, which makes Salamence less reliant on Dynamaxing to sweep.</p> </li> <li> <p>Moxie is the ability of choice, letting Salamence kickstart a sweep with a simple KO, especially from Max Airstream. Intimidate is still a reasonable alternative, allowing Salamence to set up Dragon Dance or Weakness Policy more easily.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb Salamence's best option for immediate power while Dynamaxed.</p> </li> <li> <p>Weakness Policy is an acceptable alternative that takes advantate of Intimidate quite well.</p> </li> <li> <p>Lum Berry is particularly useful for Dragon Dance Salamence, as this makes it less worried about status.</p> </li> </ul> "
      },
      {"name": "Special Attacker", "description": "<ul> <li> <p>While its Special Attack is lower than its Attack, Salamence's high base power moves and access to Intimidate and STAB Max Airstream make it a fully capable Special Attacker.</p> </li> <li> <p>Hurricane allows Salamence to be at its most dangerous when Dynamaxed, especially when Salamence can set up its own rain to guarantee its accuracy. Air Slash is still a reasonable alternative as a more reliable Flying-type STAB.</p> </li> <li> <p>Fire Blast and Hydro Pump are important for covering Steel-types such as Celesteela and Heatran. Note, however, that while Salamence is Dynamaxed, the weathers they set up will weaken the other move.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb allows Salamence to deal as much damage as possible, and is less reliant on Dynamax.</p> </li> <li> <p>Weakness Policy is a reasonable alternative to focus more on Dynamax sweeping.</p> </li> </ul> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Metagross": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A- Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Dynamax Attacker",
        "description": "<ul> <li> <p>Metagross's great bulk and typing make it a very solid choice for Dynamaxing, with Max Steelspike making it particularly difficult to KO.</p> </li> <li> <p>Earthquake is very useful for gaining a Special Defense boost via Max Quake, and hitting opposing Steel-types hard.</p> </li> <li> <p>Thunder Punch is mainly useful for dealing as much damage to Celesteela and Corviknight as possible.</p> </li> <li> <p>Hammer Arm lets Metagross boost its Attack while Dynamaxed with Max Knuckle, and still hits Heatran and Ferrothorn decently hard.</p> </li> <li> <p>Zen Headbutt is Metagross's most powerful STAB when Psychic Terrain is up, and it severely damages Urshifu-R and the rare Toxapex.</p> </li> <li> <p>Bullet Punch is a useful priority move to carry when not Dynamaxed.</p> </li> <li> <p>Although giving up an attack is difficult, Agility is notable for allowing Metagross to potentially sweep late-game.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy is the obvious choice as a Dynamax attacker, punishing foes that dare hit Metagross super-effectively.</p> </li> <li> <p>Assault Vest is a reasonable alternative that makes Metagross even more difficult to KO with Special Attacks.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 252 Atk / 4 Spe with Adamant: This EV spread mazimizes Metagross's bulk and Attack stat.</p> </li> <li> <p>164 HP / 252 Atk / 92 Spe with Adamant: When used with Agility, this EV spread allows Metagross to outspeed up to neutral natured Pheromosa.</p> </li> <li> <p>68 HP / 252 Atk / 188 Spe with Jolly: This EV spread allows Metagross to outspeed Timid Celesteela, which is very useful when running Thunder Punch.</p> </li> <li> <p>44 HP / 252 Atk / 212 Spe with Jolly: When using Agility, this Speed investment allows Metagross to outspeed up to +1 Nihilego, +1 Garchomp, and max Speed neutral natured Regieleki.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Kyogre": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Choice Scarf"}, {"name": "Bulky Assault Vest"}, {"name": "Offensive Dynamax"}, {"name": "Choice Specs"}, {"name": "Defensive"}]},
  "Groudon": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Assault Vest Dynamaxer"}, {"name": "Swords Dance"}, {"name": "Bulk Up"}, {"name": "Choice Scarf"}]},
  "Gastrodon": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/gastrodon-qc-2-2-gp-0-1.3697914/\">A rough draft of the analysis can be found here.</a></p> ", "sets": [{"name": "Specially Defensive"}, {"name": "Physically Defensive"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 146, "username": "Tox"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}]}},
  "Garchomp": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Swords Dance Sweeper"}, {"name": "Stealth Rock Setter"}, {"name": "Choice Scarf"}]},
  "Hippowdon": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Support"}]},
  "Magnezone": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<ul> <li> <p>With a unique typing and set of abilities, Magnezone has a niche for being a bulky offensive Electric-type.</p> </li> <li> <p>Sturdy gives Magnezone a Focus Sash like effect and makes it immune to deadly OHKO moves. Alternately, Analytic works well since Magnezone usually moves second, giving it a good boost in power.</p> </li> <li> <p>Steel Beam is Magnezone's strongest attack by far, but the cost of losing half its health means it should be used sparringly.</p> </li> <li> <p>Mirror Coat takes advantage of Sturdy, allowing Magnezone to potentially get a surprise KO on common Special Attacking Dynamaxers.</p> </li> <li> <p>Body Press is Magnezone's best option against Ferrothorn, Raikou, and opposing Magnezone.</p> </li> <li> <p>Endure should be used with Custap Berry, giving Magnezone another chance to activate it if Sturdy has been used up, or if Magnezone is using Analytic.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Assault Vest gives Magnezone a good amount of special bulk, especially if it's forced to Dynamax.</p> </li> <li> <p>Choice Specs gives Magnezone a ton of firepower as a hit-and-run attacker, and works especially well with taking advantage of Volt Switch.</p> </li> <li> <p>Custap Berry gives Magnezone once chance to have an attack with increased prirotity when it's low on health, which pairs especially well with Sturdy.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 252 SpA / 4 Spe with Modest: This spread maximizes Magnezone's bulk and power.</p> </li> <li> <p>4 HP / 252 Def / 252 SpA with Modest: This spread is to be used with Body Press, to maximize that move's power.</p> </li> <li> <p>4 HP / 252 SpA / 252 Spe with Modest: Magnezone may not be fast, but investing in Speed can allow it to get the jump on bulky foes that don't always bother to, such as Celesteela.</p> </li> </ul> "
      },
      {"name": "Stall Breaker", "description": "<ul> <li> <p>With Iron Defense and Body Press, Magnezone can be an effective tool against stall teams.</p> </li> <li> <p>Substitute and Leftovers protects Magnezone from status, and can effectively scout potentially problematic switch-ins.</p> </li> <li> <p>Magnet Pull seriously punishes defensive Steel-types on stall teams by trapping them, but Sturdy is a more reliable option otherwises, in case Magnezone faces a threat that might OHKO it.</p> </li> </ul> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Rhyperior": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Assault Vest"}, {"name": "Offensive"}, {"name": "Focus Sash"}]},
  "Mamoswine": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Focus Sash"}]},
  "Porygon-Z": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B- Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Special Wallbreaker",
        "description": "<ul> <li> <p>Porygon-Z's high base Special Attack coupled with Adaptability and great coverage allows it to break down or outright sweep a variety of slower opposing team compositions.</p> </li> <li> <p>Tri Attack or Uproar can be used as an alternative STAB options to Hyper Beam that do not have cooldown, whereas Thunderbolt provides solid coverage against the likes of Celesteela and Water-types such as Tapu Fini and Gyarados.</p> </li> <li> <p>Nasty Plot allows Porygon-Z to boost its Special Attack to nearly unwallable levels, whereas Trick allows it to cripple passive walls and regain move flexibility.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Chopple Berry lets Porygon-Z survive Fighting-type Attacks while Dynamaxed, particularly useful against Cinderace and Urshifu-R.</p> </li> <li> <p>Life Orb lets Porygon-Z deal massive damage even without a Nasty Plot boost.</p> </li> <li> <p>Choice Scarf patches up Porygon-Z's Speed stat, letting it outspeed key threats such as Dragapult and Choice Scarf Dracovish.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Rotom-Heat": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Choice",
        "description": "<ul> <li> <p>Rotom-H sports a fantastic defensive typing, and serves as a premier offensive pivot with good defensive upside.</p> </li> <li> <p>Rotom-H often choses Trick and Will-O-Wisp as defensive move options to cripple defensive walls or physical Dynamax sweepers at the expensive of offensive coverage</p> </li> <li> <p>Alternatively, Rotom-H can also opt between Thunderbolt or Dark Pulse as offensive move selections over Will-O-Wisp, which can be somewhat awkward with choice lock. Thunderbolt gives Rotom-H a repeatable Electric-type STAB that doesn't force it to switch, and Dark Pulse helps it get important coverage against various Pokemon that resist both of its STAB types, such as Dragapult.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Scarf allows Rotom-H to outspeed major threats, such as Dragapult and Choice Scarf Dracovish. It also punishes defensive Pokemon more with Trick.</p> </li> <li> <p>Choice Specs gives Rotom-H much more power.</p> </li> </ul> <h1>EV spreads</h1> <ul> <li> <p>252 SpA / 4 SpD / 252 Spe Timid: This spread maximizes speed and power for Choice Scarf.</p> </li> <li> <p>68 HP / 4 Def / 252 SpA / 12 SpD / 172 Spe Modest: This spread gives Rotom-H some bulk while maximizing Special Attack and outspeeding Adamant Choice Band Dracovish and slower variants of Zapdos.</p> </li> </ul> "
      },
      {
        "name": "Bulky Baking Oven",
        "description": "<ul> <li> <p>Rotom-H without a choice item can seamlessly play both a potent Dynamax role and a useful supporting role in one set.</p> </li> <li> <p>Nasty Plot in combination with Electric STAB options allow it to check all variants of Zapdos, but can be replaced by Volt Switch if equipping an Assault Vest.</p> </li> <li> <p>For the last slot, Rotom-H can use Dark Pulse to hit many targets that resist its dual STAB, and can also gain access to Max Darkness, dropping foes' Special Defense. It can also opt for running Will-O-Wisp to gain the upper hand against physical attackers.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Sitrus Berry gives Rotom-H a quick burst of recovery that can turn potential 2HKOs into 3HKOs, with th most notable one being turning Zapdos's Life Orb Max Lightning into a 3HKO after Stealth Rock against maximum HP Rotom-H.</p> </li> <li> <p>Assault Vest gives Rotom-H plenty of special bulk to better check special threats, and it works particulary well with Dynamax.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 252 SpA / 4 SpD Modest: This spread forgoes Speed investment to maximize Rotom-H's HP.</p> </li> <li> <p>68 HP / 4 Def / 252 SpA / 12 SpD / 172 Spe Modest: This spread gives Rotom-H bulk, maximizes Special Attack, and outspeeds Adamant Choice Band Dracovish and slower variants of Zapdos.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Rotom-Wash": {"sets": [{"name": "Assault Vest"}, {"name": "Bulky"}, {"name": "Choice Attacker"}, {"name": "Nasty Plot"}]},
  "Dialga": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Offensive Dynamax"}, {"name": "Bulky Dynamax"}]},
  "Palkia": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Special Attacker"}, {"name": "Physical Attacker"}]},
  "Heatran": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Offensive"}, {"name": "Specially Defensive"}]},
  "Cresselia": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>Cresselia is the bulkiest option avaliable for a Calm Mind user.</p> </li> <li> <p>Stored Power takes time to gain power, but after 2 Calm Minds, it becomes Cresselia's most powerful STAB attack. Psyshock can be used to defeat Tapu Fini in Calm Mind wars if they lack Taunt, win against Raikou, and deal massive damage to Nihilego.</p> </li> <li> <p>Ice Beam hits a lot of high value targets hard, such as Landorus-T, Salamence, and Garchomp. Moonblast still does good damage to Dragon-types, and makes Cresselia less vulnerable to Dark-types like Urshifu-S.</p> </li> <li> <p>Substitute allows Cresselia to set up in the face of status users such as Celesteela, Swampert, and Hippowdon that lack Whirlwind. However, this makes Cresselia completely useless against Dark-types, so don't choose it in team preview if they are seen.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Kee Berry's Defense boost helps Cresselia against powerful Dynamaxing threats such as Cinderace and Landorus-T, all while giving another 20 BP boost to Stored Power.</p> </li> <li> <p>Sitrus Berry gives Cresselia a short burst of extra health, making it more difficult to break past in the short term.</p> </li> <li> <p>Leftovers gives more long-term recovery, which is helpful in slower-paced matches.</p> </li> <li> <p>Rocky Helmet is useful for punishing Pokemon that commoningly use physical contact moves, such as Cinderace and Urshifu-R.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 252 Bold / 4 Spe Bold: This spread maximizes Cresselia's physical bulk.</p> </li> <li> <p>252 HP / 100 Def / 156 Spe Bold: This spread is suggested for Substitute Cresselia. It outspeeds up to Timid Celesteela, allowing Cresselia to set up Substitute before Celesteela hits with Leech Seed.</p> </li> </ul> "
      },
      {
        "name": "Trick Room Support",
        "description": "<ul> <li> <p>Cresselia is an extremely bulky option for Trick Room, and with Lunar Dance, it's the only viable one that can give Trick Room sweepers another chance at sweeping.</p> </li> <li> <p>Psychic is a reliable STAB option if Cresselia needs to do some damage, but Ice Beam hits a wide variety of targets harder such as Landorus-T, Salamence, and Garchomp.</p> </li> <li> <p>Even though this Cresselia often sacrifces itself with Lunar Dance, Moonlight is still good to have to potentially wall certain Pokemon.</p> </li> <li> <p>When using this Cresselia, always pair it with 1-2 slow Pokemon that can take advantage of Trick Room. Glastrier is by far the most dangerous Trick Room sweeper, so it comes highly recommended. Other options for slow Pokemon include Celesteela, Heatran, Magnezone, and Ferrothorn.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Sitrus Berry gives Cresselia a quick burst of recovery. This is more valuable than Leftovers, since Cresselia often sacrifices itself anyways.</p> </li> <li> <p>Rocky Helmet is still good for punishing contact moves from common foes such as Cinderace and Urshifu-R.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Excadrill": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Offensive Support",
        "description": "<ul> <li> <p>With Mold Breaker and an excellent typing, Excadrill has the tools to deal with major threats, such as Mimikyu and Rotom-W.</p> </li> <li> <p>Rock Tomb is essential for providing Speed control.</p> </li> <li> <p>If using Focus Sash, Excadrill is a good choice for setting up Stealth Rock.</p> </li> <li> <p>Horn Drill gives Excadrill a 30% chance to bust through defensive Pokemon that would otherwise wall it, such as Celesteela.</p> </li> <li> <p>Swords Dance lets Excadrill take advantage of more passive threats, such as Cresselia. If using Assault Vest, Brick Break is a reasonable replacement while Dynamaxed thanks to Max Knuckle, and has the bonus of breaking Reflect and Light Screen otherwise.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Focus Sash lets Excadrill focus on supporting the team to its fullest extent, without worrying about getting OHKOed.</p> </li> <li> <p>Assault Vest is the item of choice if Excadrill plans on Dynamaxing, making it a surprisingly bulky Pokemon. It also lets Excadrill handle Nihilego far better than it would otherwise.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>4 HP / 252 Atk / 252 Spe with Jolly: This maximizes Excadrill's Speed and power, letting it outspeed Pokemon in a similar speed bracket such as Dragonite and Gyarados.</p> </li> <li> <p>4 HP / 252 Atk / 252 Spe with Adamant: While this spread no longer allows Excadrill to outspeed Dragonite and Gyarados consistently, it does allow Excadrill to KO Dynamax Nihilego with Rock Tomb + Earthquake under Grassy Terrain.</p> </li> <li> <p>244 HP / 116 Atk / 148 Spe with Adamant: This spread is a good fit for bulkier Assault Vest sets, allowing Excadrill to OHKO Dynamax Naganadel with Max Quake, while still outspeeding them after one use of Rock Tomb.</p> </li> </ul> "
      },
      {"name": "Choice Scarf", "description": "<ul> <li> <p>Excadrill's decent Speed tier and access to Mold Breaker make it a good choice for Choice Scarf revenge killing, outspeeding major threats such as Mimikyu, Pheromosa, and Dragapult.</p> </li> <li> <p>Horn Drill is Excadrill's best hope at breaking past defensive Pokemon such as Cresselia and Tapu Fini, with a 30% chance of OHKOing them as long as they aren't Dynamaxed.</p> </li> <li> <p>Rock Slide is Excadrill's most powerful option for coverage against Flying-types. Rock Tomb is a weaker alternative that does provide Speed control in a pinch.</p> </li> </ul> "},
      {
        "name": "Sand Sweeper",
        "description": "<ul> <li> <p>When it comes to Sand Stream sweeping, no Pokemon does the job better than Excadrill, who fully takes advantage of Dynamax to both set up the sand, and Max Moves to increase its bulk.</p> </li> <li> <p>Rock Slide's chance to flinch makes it a good choice for a Rock-type attack outside of Dynamax, but Rock Blast deserves special mention for blasting through Disguise and Focus Sash.</p> </li> <li> <p>Swords Dance makes Excadrill less reliant on Dynamax to sweep, and lets Excadrill deal massive damage to defensive Pokemon such as Tapu Fini and Cresselia.</p> </li> <li> <p>Brick Break allows Excadrill to boost its Attack while Dynamaxed via Max Knuckle, in addition to breaking Reflect and Light Screen outside of it.</p> </li> <li> <p>While Excadrill is fully capable of setting up sand on its own thanks to Dynamax, consider pairing Excadrill with Hippowdon or Tyranitar to ease reliance on Max Rockfall in certain match-ups.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy takes full advantage of Excadrill's Dynamax capabilities, especially since its two Max Move STABs boost its defensive stats.</p> </li> <li> <p>Focus Sash gels well with setting up Swords Dance at unexpected times, opening up new late-game sweeping opportunities.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>4 HP / 252 Atk / 252 Spe with Jolly: This EV spread makes Excadrill as fast as possible, outspeeding key threats under Sandstorm such as Dragapult and Choice Scarf Cinderace.</p> </li> <li> <p>196 Atk / 140 SpD / 172 Spe with Jolly: This EV spread gives Excadrill enough Special Defense to survive Choice Specs Rotom-W's Hydro Pump while Dynamaxed, while still outspeeding up to Choice Scarf Naganadel under Sandstorm.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Seismitoad": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/seismitoad-qc-2-2-gp-0-1.3698815/\">A rought draft of the analysis can be found here.</a></p> ", "sets": [{"name": "Physical Sweeper"}, {"name": "Specially Defensive Support"}, {"name": "Specially-Based Sweeper"}], "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 469498, "username": "luisin"}, {"user_id": 29010, "username": "Theorymon"}]}], "writtenBy": [{"user_id": 542590, "username": "Comradesquidwar"}]}},
  "Whimsicott": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Prankster Support",
        "description": "<ul> <li> <p>This Whimsicott functions to help hyper offensive or setup sweeper-centered builds set up against faster foes.</p> </li> <li> <p>Tailwind is used to boost Speed while sacrificing Whimsicott, allowing the incoming Pokemon to take advantage of the Speed boost.</p> </li> <li> <p>Alternatively, Switcheroo in combination with Lagging Tail makes the foe setup fodder for certain sweepers that can take advantage of slowed Pokemon to rack up boosts.</p> </li> <li> <p>Memento allows Whimsicott to freely pivot against opposing Pokemon after setting up speed control. Memento finds usefulness in guaranteeing one turn of Dynamax stalling, avoiding opposing boosts from secondary effects of Max Moves or Moxie, and also neutering Dynamax sweepers via attacking stat drops.</p> </li> <li> <p>Moonblast is Whimsicott's primary STAB move, hitting Dark types, which are not affected by Prankster, hard. Energy Ball also makes a decent STAB, letting Whimsicott deal serious damage to Tapu Fini and Rotom-W.</p> </li> <li> <p>Taunt prevents Whimsicott from being Taunted itself as well as shuts down more passive Pokemon such as Swampert and Hippowdon. Charm stifles physical Pokemon without needing to sacrifice Whimsicott via Memento.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Focus Sash lets Whimsicott survive even powerful attacks, ensuring it can support your offensive Pokemon.</p> </li> <li> <p>Lagging Tail should only be used with Switcheroo.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>4 HP / 252 SpA / 252 Spe with Modest or Timid: This is used with attacking sets and Focus Sash to give Whimsicott the ability to hit hard when using Moonblast or Energy Ball. Timid is an alternate option for outspeeding Garchomp.</p> </li> <li> <p>252 HP / 252 Def / 4 SpD with a Bold nature: This maximizes physical bulk in order to get off a Switcheroo or Fling followed by Memento without getting OHKOed and should be used for all non-attacking variants.</p> </li> </ul> "
      },
      {"name": "Cotton Guard Stall", "description": "<ul> <li> <p>This Whimsicott takes advantage of Prankster to set up Cotton Guard, allowing it to stop even would-be physical checks, such as Metagross, that may try to switch in.</p> </li> <li> <p>Prankster Substitute + Leech Seed serves as its main method of defeating opposing Pokemon, stalling them out while passively sapping HP through Leech Seed and healing through Leftovers.</p> </li> <li> <p>While it might be possible to run a no-attack variant of this version of Whimsicott, Moonblast is strongly recommended in order to hit Dark-types, which are unaffected by Prankster, and to ensure that Whimsicott is not complete Taunt bait.</p> </li> <li> <p>The given EV spread maximizes physical bulk in order to Leech Seed stall most effectively and take minimal damage from physical threats immediately after a Cotton Guard boost.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 158401, "username": "cant say"}, {"user_id": 70760, "username": "Marilli"}]}, {"name": "Grammar checked by", "members": [{"user_id": 228482, "username": "kt3"}]}], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Darmanitan-Galar": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Gorilla Tactics"}, {"name": "Zen Mode"}]},
  "Ferrothorn": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Defensive"}, {"name": "Specially Defensive"}, {"name": "Set-Up"}]},
  "Thundurus": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Prankster Support"}, {"name": "Dynamax Sweeper"}]},
  "Reshiram": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Dynamax"}, {"name": "Choice Scarf"}]},
  "Zekrom": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Dragon Dance"}]},
  "Landorus-Therian": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Dynamax Sweeper"}, {"name": "Suicide Lead"}, {"name": "Bulky Support"}, {"name": "Choice Scarf"}]},
  "Kyurem-White": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Dynamax"}, {"name": "Choice Scarf"}]},
  "Xerneas": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Geomancy"}]},
  "Yveltal": {
    "overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<ul> <li> <p>Yveltal's combination of power, Max Airstream, and good bulk make it one of the most fearsome Dynamax sweepers in the metagame.</p> </li> <li> <p>Oblivion Wing is preferred over Hurricane for the healing factor, even though it gives a less powerful Max Airstream.</p> </li> <li> <p>Heat Wave roasts Zacian-C while under Dynamax.</p> </li> <li> <p>Roost is a more reliable form of recovery at the cost of coverage or utility.</p> </li> <li> <p>Even with an Attack-lowering nature, Sucker Punch is a powerful priority move that's perfect for picking off weakened faster threats, such as Regieleki.</p> </li> <li> <p>Taunt shuts down support Pokemon such as Hippowdon. Yveltal is immune to Prankster, so it can deny at least one of Grimmsnarl's dual screens.</p> </li> <li> <p>Focus Blast is Yveltal's best hope for dealing serious damage to Tyranitar, though it is a poor Max move.</p> </li> <li> <p>U-turn makes Yveltal decent scout and is especially good for gaining momentum against Tyranitar switching in.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb provides the most reliable form of extra damage, and its recoil can be offset by Oblivion Wing's recovery.</p> </li> <li> <p>Assault Vest makes Yveltal a particularly bulky Dynamax user, at the cost of having to drop Taunt.</p> </li> <li> <p>Weakness Policy has the potential to turn Yveltal into a dangerous Dynamax sweeper.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 SpA / 252 Spe with Timid: This spread maximizes Yveltal's Special Attack and Speed, outpacing key threats such as Mimikyu and Urshifu.</p> </li> <li> <p><strong>4 HP / 252 SpA / 252 Spe with Modest: This spread sacrifices outspeeding Mimikyu and Urshifu for potentially breaking past the many Pokemon that invest in surviving Timid Yveltal. This spread still outspeeds Calyrex-S after using Max Airstream.</p> </li> <li> <p><strong>140 HP / 172 SpA / 196 Spe with Timid: This EV spread minimizes Life Orb recoil, survives Zacian-C's Behemoth Blade, avoids a 2HKO from Calyrex-S's Max Starfall while under Dynamax, and outspeeds Timid Kyogre.</p> </li> </ul> "
      },
      {
        "name": "Stall Breaker",
        "description": "<ul> <li> <p>With Taunt and Roost, Yveltal does an excellent job of crippling more defensive Pokemon, such as Necrozma-DM and Chansey. This set struggles against most defensive Eternatus sets, as they outspeed it and can cripple Yveltal with Toxic.</p> </li> <li> <p>Even without Special Attack investment, Oblivion Wing gives Yveltal a good secondary method of recovery, and the option to use Max Airstream when under Dynamax.</p> </li> <li> <p>Foul Play 2HKOes Zacian-C, ensuring that it isn't an easy switch-in. However, even Bold Yveltal risks a OHKO from Play Rough, so it shouldn't stay in unless crippled Zacian-C is paralyzed.</p> </li> <li> <p>Dark Pulse is Yveltal's strongest STAB move, making it a more dangerous Dynamax option compared to the others.</p> </li> <li> <p>While Snarl is weak, its Special Attack drop gives Yveltal a better matchup against specially offensive threats and makes Xerneas switching in easier to deal with for the rest of the team.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Leftovers provides a reliable form of recovery that fits this set's more defensive playstyle.</p> </li> <li> <p>Kee Berry's Defense boost can help Yveltal to survive strong physical attacks such as Zacian-C's Play Rough.</p> </li> <li> <p>Sitrus Berry and riskier alternatives like Mago Berry can be used to get an immediate health boost.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 188 Def / 68 Spe with Timid or 252 HP / 92 Def / 168 Spe with Bold: These two spreads allow Yveltal to outspeed Jolly Dracovish and Necrozma-DM, while maximizing its Defense.</p> </li> <li> <p><strong>252 HP / 60 Def / 196 Spe with Timid: This spread allows Yveltal to outspeed Jolly Landorus-T.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe with Bold: This spread fully maximizes Yveltal's Defense.</p> </li> <li> <p><strong>252 HP / 4 Def / 252 Spe with Timid</strong>: This spread maximizes Yveltal's Speed, allowing it to outspeed and use Taunt on Mimikyu before it can use a status move.</p> </li> </ul> "
      },
      {
        "name": "Physical Attacker",
        "description": "<ul> <li> <p>Physical Yveltal's movepool may not be great, but it can surprise some of it's usual checks, such as 2HKOing Chansey with Dual Wingbeat, and it has one of the strongest priority moves in the game in STAB Dark Aura-boosted Sucker Punch.</p> </li> <li> <p>Heat Wave with a Special Attack-lowering nature may seem strange, but when paired with Life Orb, it can finish off most Zacian-C with Max Flare if they switch into Max Airstream.</p> </li> <li> <p>Taunt shuts down Hippowdon, which is otherwise a big issue for this set.</p> </li> <li> <p>Foul Play doesn't take advantage of the Attack investment before Dynamax, but it does allow Yveltal to deal over 50% to Zacian-C switching in.</p> </li> <li> <p>Lash Out is a more reliable Dark-type STAB move than Sucker Punch. Knock Off would normally be a far better move, but it's sadly illegal on Yveltal in this format.</p> </li> <li> <p>Steel Wing gives Yveltal a Defense boost under Dynmax with Max Steelspike while seriously damaging Tyranitar.</p> </li> <li> <p>Roost can be used in conjunction with Taunt to shut down more defensive Pokemon.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb is the most highly recommended item, as it gives Adamant Yveltal a chance to KO Zacian-C switching in with Max Airstream into Max Flare.</p> </li> <li> <p>Weakness Policy can turn this set into a dangerous Dynamax sweeper; this is particularly notable against Chansey, as +2 Max Darkness will OHKO it.</p> </li> <li> <p>Black Glasses is a decent alternative for dealing extra damage with Dark-type attacks while avoiding Life Orb recoil.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 Atk / 252 Spe with Adamant: This spread maximizes Yveltal's Attack, while letting it outspeed Calyrex-S after a Max Airstream.</p> </li> <li> <p><strong>140 HP / 172 Atk / 196 Spe with Jolly: This spread outspeeds Jolly Landorus-T, minimizes Life Orb recoil, and avoids an OHKO from Zacian-C's Behemoth Blade.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 469498, "username": "luisin"}, {"user_id": 146, "username": "Tox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Zygarde": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Specially Defensive Coil"}, {"name": "Physically Defensive Coil"}]},
  "Primarina": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B- Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li>Primarina is usually severely overshadowed by Tapu Fini, but Primarina does offer some small advantages, such as a much higher Special Attack stat, Grass-type coverage, and being able to pick off Focus Sash Pokemon with Aqua Jet.</li> </ul> <h1>Items</h1> <ul> <li> <p>Assault Vest is the most common item on offensive Primarina to take advantage of its good special bulk. </li> <li> <p>Choice Specs is still viable for offering a lot of firepower, especially compared to Tapu Fini.</p> </li> <li> <p>Focus Sash lets Primarina take advantage of Torrent more easily, and lets it deal massive damage to Pokemon it'd normally be KOed by.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 28 Def / 228 SpA: This spread maximizes special attack and bulk, and always takes a Choice Band Urshifu Thunder Punch.</p> </li> <li> <p>4 Atk / 252 SpA / 252 Spe: This spread is viable with more offensive items, especially Focus Sash.</p> </li> <li> <p>252 HP / 156 Def / 100 SpA: This spread gives Primarina the ability to always survive Max Lightning from Urshifu formes.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 70760, "username": "marilli"}]}
  },
  "Lycanroc-Dusk": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B- Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Focus Sash",
        "description": "<ul> <li> <p>Lycanroc-D is a decent and unique Focus Sash lead due to its access to all of Counter, Endeavor, Stealth Rock, and a unique STAB priority move.</p> </li> <li> <p>Counter, when combined with Accelerock, allows Lycanroc-D to defeat promiment physical Dynamax sweepers such as Cinderace. This set almost requires Focus Sash to remain intact, so be wary of Lycanroc-D taking residual damage if the opponent still has physical sweepers in play.</p> </li> <li> <p>Close Combat allows Lycanroc-D to hit Ferrothorn and many other Steel-types harder than its STAB coverage, and gets a Tough Claws boost, unlike many of its higher-Base Power STAB moves.</p> </li> <li> <p>Stealth Rock allows Lycanroc-D to support sweepers on its team, helping break opposing Focus Sash and weakening opposing Galarian Moltres and Glastrier.</p> </li> <li> <p>Endeavor allows Lycanroc-D to also defeat many special attackers one-on-one, but be wary of Dynamaxed foes, which will only go to half health if Lycanroc is put to 1 HP.</p> </li> <li> <p>Swords Dance allows Lycanroc-D to become less passive and punishes opponents that try to play around its somewhat predictable Focus Sash strategies.</p> </li> <li> <p>Rock Tomb can be used to provide speed control for incoming sweepers, allowing the likes of Cinderace and Urshifu-R to outspeed many threats to their sweep.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 248085, "username": "Psynergy"}, {"user_id": 336524, "username": "greilmercenary9"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Toxapex": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Physical Wall"}]},
  "Mimikyu": {
    "overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ",
    "sets": [
      {
        "name": "Disruptor",
        "description": "<ul> <li> <p>With Disguise and Thunder Wave, Mimikyu is an extremely disruptive Pokemon that can cripple common sweepers such as Zacian-C and Calyrex-S, leaving them open for a Dynamax sweeper to pick off.</p> </li> <li> <p>Curse dealing 25% damage per turn and often KOing Mimikyu makes it a perfect opportunity for sweepers to come in.</p> </li> <li> <p>Play Rough is useful for giving Mimikyu a way to deal damage to Taunt Yveltal, and it also lets Mimikyu OHKO Urshifu-S.</p> </li> <li> <p>Shadow Sneak is great for picking off weakened foes if Mimikyu doesn't come in early in the match, and it's particularly good at picking off weakened Calyrex-S.</p> </li> <li> <p>Phantom Force lets Mimikyu stall out Dynamax turns when needed.</p> </li> <li> <p>Taunt blocks Stealth Rock from the likes of Hippowdon and Landorus-T, and it's useful for gaining an edge against defensive Pokemon in general.</p> </li> <li> <p>Wood Hammer can be used to surprise Quagsire and Seismitoad with massive damage.</p> </li> <li> <p>Note that bulky Necrozma-DM will shrug off anything Mimikyu throws at it, can stack Dragon Dance boosts, and ignores Disguise with Sunsteel Strike. Pokemon that can nullify abilities, such as Cinderace and Rillaboom under Gigantamax, Zekrom, Reshiram, and Kyurem-W, also are very difficult to cripple.</p> </li> <li> <p>Make sure to use this Mimikyu with good Dynamax sweepers. Most Dynamax sweepers that have Max Airstream work fantastically well. Calyrex-S works especially well thanks to its snowball potential. Focus Sash Ditto is also an incredible teammate that can use Mimikyu's Thunder Wave to copy and outspeed foe Restricted Pokemon, almost acting like a third Restricted teammate. Finally, sweepers that rely on stacking up multiple boosts, such as bulky Necrozma-DM and Zygarde, benefit a lot from Curse and Thunder Wave.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Since this Mimikyu won't be around for long, Bright Powder's chance for a miss can make Curse that much more deadly, as the extra turn of damage makes it even easier for Dynamax sweepers to set up.</p> </li> <li> <p>Rocky Helmet instead deals extra chip damage to physical attackers like Zacian-C, making them even more vulnerable to a Dynamax sweeper.</p> </li> <li> <p>Expert Belt can be used to guarantee an OHKO with Phantom Force on minimum HP Calyrex-S, even if it's under Dynamax.</p> </li> <li> <p>An alternative to Thunder Wave is to use Trick with Lagging Tail. This doesn't work against Zacian-C, but it does let Mimikyu cripple Landorus-T and Zekrom, and it prevents Necrozma-DM from getting around paralysis by stacking up Speed boosts.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 Atk / 252 Spe with Jolly: This maximizes Mimikyu's power while outspeeding important foes such as Kyogre that lack Choice Scarf, Landorus-T, Adamant Urshifu formes, and Dialga.</p> </li> <li> <p><strong>252 HP / 4 Atk / 252 Spe with Jolly: This maximizes Mimikyu's bulk while still maintaining a high Speed stat, useful for letting Mimikyu survive weak attacks when Disguise is broken.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe with Impish:</strong> This gives Mimikyu an 87.5% chance to survive one Sunsteel Strike from defensive Necrozma-DM.</p> </li> </ul> "
      },
      {
        "name": "Curse Stall",
        "description": "<ul> <li> <p>With Substitute, Curse, and Pain Split together, Mimikyu can effectively wear down a variety of Pokemon and stall out Dynamax users.</p> </li> <li> <p>Play Rough gives Mimikyu something to do if it gets hit by Taunt. It deals decent damage to Yveltal, a common user of Taunt, and also OHKOes Urshifu-S.</p> </li> <li> <p>Phantom Force makes Mimikyu even more effective at stalling out Dynamax, and it deals serious damage against Calyrex-S.</p> </li> <li> <p>Thunder Wave does a great job of crippling fast threats such as Zacian-C and Eternatus, and the full paralysis chance makes Curse even more devastating. However, it does make Mimikyu extremely vulnerable to Taunt.</p> </li> <li> <p>Ironically, Mimikyu can use Taunt itself to shut down any Pokemon with recovery that attempt to stall it out, such as Quagsire, Chansey, and defensive Eternatus.</p> </li> <li> <p>Trick Room is a more unusual option to consider. Since Mimikyu can use Substitute and Curse to knock itself out easily, it makes a particularly good Trick Room setter for slow sweepers such as Calyrex-I.</p> </li> <li> <p>This Mimikyu set effectively destabilizes common defensive cores, such as Chansey + Quagsire, so make sure to pair it up with Pokemon that can take advantage of these holes. Zacian-C is a fantastic example, with Necrozma-DM, Yveltal, and Cinderace also being good examples.</p> </li> <li> <p>The given HP EVs allow Mimikyu to use Substitute four times from full health. 252 HP EVs and 4 Defense EVs can be used to activate Custap Berry after three Substitutes instead.</p> </li> <li> <p>If not using any attacks, a Timid nature with an Attack IV of 0 is preferred over Jolly to weaken Foul Play.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Custap Berry can be activated with Substitute and lets Mimikyu deliver an extra move, like Pain Split or Thunder Wave, before fainting.</p> </li> <li> <p>Bright Powder isn't the most reliable, but missing one attack against this Mimikyu can be devastating, giving it more room to stall.</p> </li> <li> <p>Recovery berries such as Figy Berry can be used to restore some health after using Substitute several times.</p> </li> <li> <p>Leftovers is the most reliable method of extra recovery, but it comes at the cost of revealing Mimikyu's set fairly early.</p> </li> <li> <p>If using Trick Room, Room Service works well.</p> </li> </ul> "
      },
      {
        "name": "Swords Dance Sweeper",
        "description": "<ul> <li> <p>With Disguise, Swords Dance, and priority, Mimikyu overcomes its mediocre offensive stats, becoming an effective revenge killer and sweeper in one package!</p> </li> <li> <p>Phantom Force is not only Mimikyu's strongest Ghost-type STAB move, but its semi-invulnerable turn can stall out Dynamax turns. Most notably, with Life Orb, a +2 Max Phantasm from this move will OHKO bulky Zacian-C.</p> </li> <li> <p>Shadow Claw is the more reliable Ghost-type move, being less vulnerable to Chansey switch-ins at the cost of giving a weaker Max Phantasm.</p> </li> <li> <p>Wood Hammer allows Mimikyu to get past Quagsire and Swampert. It also makes Mimikyu a fantastic option against dedicated rain teams, as Life Orb Mimikyu will deal 98% minimum to Seismitoad under Dynamax, as well as dealing massive damage to Kyogre.</p> </li> <li> <p>Thunder Wave is a potential option. While it won't help Mimikyu with sweeping, it does give an emergency way to cripple massive offensive threats, such as Zacian-C.</p> </li> <li> <p>This Mimikyu is a great contender for using Dynamax. Not only does Dynamax help with Mimikyu's power issues, but its Max Moves have powerful secondary effects, with Max Starfall protecting Mimikyu from status and Max Phantasm lowering the foe's Defense.</p> </li> <li> <p>While Disguise lets Mimikyu set up Swords Dance easily despite its fraility, note that it can't set up on Pokemon that can nullify abilities, such as Necrozma-DM, Cinderace and Rillaboom under Gigantamax, Zekrom, Reshiram, and Kyurem-W. Also, because of Behemoth Blade, Zacian-C will stop any Mimikyu sweep unless Disguise is up or it's paralyzed.</p> </li> <li> <p>Jolly is the preferred nature to at least Speed tie with opposing Mimikyu and outspeed a wide variety of relevant Pokemon, such as Kyogre, Ho-Oh, Jolly Landorus-T, Adamant Urshifu formes, Zekrom, Dialga, and Zygarde. If your team is well prepared for those threats or has paralysis support, Adamant is a fine nature.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb is the best option to make up for Mimikyu's meager Attack stat.</p> </li> <li> <p>Spell Tag is another option if Life Orb is taken, since boosting Shadow Sneak's power helps it revenge kill weakened foes. Most notably, with an Adamant nature, +2 Spell Tag Mimikyu can still OHKO bulky Zacian-C with Max Phantasm from Phantom Force.</p> </li> <li> <p>Expert Belt is a decent alternative if Life Orb is needed on a different Pokemon. It especially pairs well with Wood Hammer, allowing Mimikyu to still OHKO Quagsire.</p> </li> <li> <p>Salac Berry and Substitute can be used together to give Mimikyu an unexpected avenue of sweeping, with the Speed boost letting it outspeed most relevant Pokemon.</p> </li> </ul> "
      },
      {
        "name": "Choice Scarf",
        "description": "<ul> <li> <p>Mimikyu is fairly weak compared to most Choice Scarf revenge killers, but thanks to Trick, it can be a powerful tool against defensive Pokemon such as Eternatus and Blissey.</p> </li> <li> <p>Phantom Force, while not great at revenge killing, does help stall out Dynamax.</p> </li> <li> <p>Shadow Claw is a more reliable Ghost-type STAB move, and it's particularly good at chipping Zacian-C switch-ins.</p> </li> <li> <p>Shadow Sneak isn't very useful while Mimikyu is holding a Choice Scarf, but it can let Mimikyu still pick off faster threats after using Trick.</p> </li> <li> <p>Wood Hammer 2HKOes Quagsire and Swampert, and it deals far more damage to Kyogre than any other attack.</p> </li> <li> <p>Thunder Wave lets Mimikyu cripple another threat after firing off Trick, or it can paralyze fast threats in emergencies such as Zacian-C and Eternatus.</p> </li> <li> <p>Importantly, while this set threatens common Pokemon on stall such as Chansey and Eternatus, Zacian-C is also very common on stall teams and is immune to Trick, making it an extremely dangerous Pokemon for this set that requires good prediction to play around.</p> </li> <li> <p>While Jolly is the suggested nature on the set, it's best to actually use a Jolly Mint with Serious, or another neutral nature. This lets Mimikyu eat any Berry acquired from Trick without getting confused, and it still gets the extra Speed it needs.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336524, "username": "greilmercenary9"}, {"user_id": 146, "username": "Tox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Tapu Koko": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Special Attacker"}, {"name": "Dual Screens"}, {"name": "Yveltal Check (Bulky Physical Attacker)"}]},
  "Tapu Lele": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With Psychic being boosted by a terrain, Tapu Lele makes a competent offensive threat that doesn't have to worry about priority attacks.</p> </li> <li> <p>Thunderbolt is important coverage, hitting Celesteela, who otherwise walls Tapu Lele.</p> </li> <li> <p>Psyshock lets Tapu Lele hit Pokemon that have softer physical defense such as Raikou harder.</p> </li> <li> <p>Shadow Ball punishes Metagross and Cresselia switch-ins, and hits a lot of Pokemon neutrally in general.</p> </li> <li> <p>Focus Blast is Tapu Lele's best hope at dealing severe damage to Ferrothorn and Heatran, but isn't a particularly reliable move, and is a notoriously poor move while Dynamaxed.</p> </li> <li> <p>Modest is Tapu Lele's best nature for damage output, but Timid is a reasonable alternative if outspeeding Jolly Landorus-T is a must, and it also lets Choice Scarf Tapu Lele outspeed Jolly Pheromosa.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Scarf pairs very well with Psychic Terrain, letting Tapu Lele deal massive damage to fast threats without worrying about potential priority attacks.</p> </li> <li> <p>Choice Specs makes Tapu Lele a better wall breaker, notably being able to 2HKO defensive Tapu Fini with Psyshock under Psychic Terrain.</p> </li> <li> <p>Life Orb not only lets Tapu Lele switch up its attacks, but makes it a better Dynamaxer. Just note that most of it's coverage will remove Psychic Terrain.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Tapu Fini": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Defensive Support"}, {"name": "Calm Mind"}, {"name": "Speed Crippler"}, {"name": "Choice Attacker"}]},
  "Nihilego": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A+ Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [{"name": "Power Herb Sweeper", "description": "<ul> <li> <p>Nihilego has access to Meteor Beam, and in combination with Power Herb, it becomes instantaneously threatening through increasing its Special Attack and striking with a 120 BP STAB in one turn.</p> </li> <li> <p>Grass Knot hits common Stealth Rock leads like Swampert and Hippowdon very hard, Thunderbolt best hits the likes of Celesteela and Gyarados, Psyshock allows it to hit other Nihilego and Chansey, Power Gem is an alternative Rock STAB to use when not Dynamaxed, and Stealth Rock helps chip future switch-ins while giving access to a Max Guard option when Dynamaxed.</p> </li> <li> <p>The given EVs ensure Nihilego gets a Speed boost after a KO, complementing the SpA boost gained from Meteor Beam and making it difficult to be revenge killed by the likes of Choice Scarf Landorus-T.</p> </li> </ul> "}],
    "credits": {"teams": [], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Pheromosa": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Offensive Pivot"}]},
  "Celesteela": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Leech Seed"}, {"name": "Meteor Sweeper"}]},
  "Kartana": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<ul> <li> <p>Kartana's impressive Attack stat and Beast Boost make it a capable late-game physical sweeper, only held back by its awful Special Defense and low base power attacks.</p> </li> <li> <p>Aerial Ace may seem weak, but it gives Kartana access to Max Airstream while Dynamaxed, giving it a good shot of sweeping late-game. Smart Strike is weak for a STAB Attack, but it OHKOs Nihilego, and grants access to the useful Max Steelspike while Dynamaxed. While difficult to fit in, Giga Impact is Kartana's best hope of doing decent damage to Zapdos with Max Strike.</p> </li> <li> <p>Swords Dance makes Kartana less reliant on Dynamax and Beast Boost to sweep, and pairs especially well with Focus Sash.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Focus Sash lets Kartana survive in match-ups that may normally be difficult for it to win, mainly against special attackers.</p> </li> <li> <p>Life Orb makes Kartana a better late-game sweeper when Dynamaxed.</p> </li> </ul> "
      },
      {"name": "Choice Scarf", "description": "<ul> <li> <p>Kartana's access to Beast Boost makes it a reasonable choice for Choice Scarf revenge killing and late-game sweeping.</p> </li> <li> <p>Guillotine is an emergency attack to have a 30% shot at destroying bulky Pokemon, while Aerial Ace gives Kartana a Speed boost if Dynamax sweeping presents itself to Kartana.</p> </li> </ul> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Necrozma-Dusk-Mane": {
    "overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ",
    "sets": [
      {
        "name": "HEAVY METAL (Bulky Dragon Dance)",
        "description": "<ul> <li> <p>Necrozma-DM is a terrifying Dragon Dance sweeper, with its stellar typing and bulk allowing it ample opportunity to set up.</p> </li> <li> <p>Moonlight is an alternative to Morning Sun due to its slightly longer animation, allowing for slightly more efficient timer stalling should it be necessary.</p> </li> <li> <p>Psychic Fangs is usually taken over Photon Geyser to make Max Mindstorm physical, allowing for the most damage possible on targets like Kyogre.</p> </li> <li> <p>Earthquake provides an option to boost Special Defense via Max Quake, making Necrozma-DM extremely difficult to take down, while also hitting Eternatus and Zacian-C super effectively.</p> </li> <li> <p>Rock Blast can be used to pressure Ho-Oh heavily and bypass Substitutes thanks its multiple hits.</p> </li> <li> <p>If Yawn Quagsire is a serious problem, Photon Geyser is viable for dealing massive damage to it, at the cost of being nearly useless while Necrozma-DM is under Dynamax.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy is the preferred item, taking maximum advantage of Necrozma-DM’s ability to tank super effective hits with its bulk and Prism Armor.</p> </li> <li> <p>Rocky Helmet is useful as a way to punish Pokemon like Zacian-C and Urshifu-S, potentially chipping them down into range of a KO. This is especially useful against Zacian-C, forcing it to take irreversible chip damage for using any of its moves.</p> </li> <li> <p>Lum Berry is also useful for more consistent setup, allowing Necrozma-DM to stomach a burn or paralysis while using Dragon Dance.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 140 Def / 116 Spe with Impish - this spread allows Necrozma-DM to outspeed Timid Yveltal and Zapdos after a Dragon Dance, while also having enough Defense to avoid a 2HKO from Adamant Zacian-C.</p> </li> <li> <p><strong>252 HP / 124 Def / 132 Spe with Impish - this spread will allow Necrozma-DM to outrun Jolly Garchomp after a Dragon Dance.</p> </li> </ul> "
      },
      {
        "name": "Offensive Dragon Dance",
        "description": "<ul> <li> <p>With this set, Necrozma-DM uses its impressive natural bulk and Dragon Dance to raise its already incredible power to simply absurd levels, as well as patching up its rather lackluster Speed.</p> </li> <li> <p>By maximizing its Attack EVs, Necrozma-DM is able to serve as both wallbreaker and sweeper with one set. It can to threaten even Unaware Quagsire due to the sheer power of fully invested Max Mindstorms.</p> </li> <li> <p>Psychic Fangs is preferred over Photon Geyser to enable a physical Max Mindstorm. Photon Geyser should only be used if Yawn Quagsire is problematic, since it's nearly useless under Dynamax.</p> </li> <li> <p>Earthquake is useful against other Necrozma-DM, as well as hitting Zacian-C super effectively, though this does make it more vulnerable to Ditto.</p> </li> <li> <p>Rock Blast is very helpful against Ho-Oh and Yveltal. A +1 Adamant Max Rockfall has a very high chance to OHKO Yveltal undergoing Dynamax</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy is the most consistent item, punishing super-effective attacks with huge boosts.</p> </li> <li> <p>Lum Berry allows Necrozma-DM to get a boost up more securely, not minding status from the likes of Hippowdon or Swampert.</p> </li> <li> <p>Life Orb gives Necrozma-DM even more power to work with, allowing it to consistently 2HKO Quagsire with Max Mindstorm, and allowing a boosted Max Rockfall to always OHKO Yveltal undergoing Dynamax after Stealth Rock.</p> </li> <li> <p>Rocky Helmet can be used to punish contact moves, as Necrozma-DM still has excellent bulk without defense investment.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>140 HP / 252 Atk / 116 Spe with with Adamant - This spread outspeeds Timid Zapdos and Yveltal after one Dragon Dance.</p> </li> <li> <p><strong>124 HP / 252 Atk / 132 Spe with Adamant - This allows Necrozma-DM to outrun the rare Garchomp after a Dragon Dance, at the cost of some bulk.</p> </li> <li> <p><strong>60 HP / 252 Atk / 196 Spe with Jolly - This will allow Necrozma-DM to outspeed Offensive Eternatus after a Dragon Dance</p> </li> </ul> "
      },
      {"name": "Cosmic Power", "description": "<ul> <li> <p>This set takes full advantage of Necrozma-DM's impressive defensive profile.</p> </li> <li> <p>Moonlight is an alternative to Morning Sun due to its slightly longer animation, allowing for slightly more efficient timer stalling should it be necessary.</p> </li> <li> <p>Stored Power turns Necrozma-DM's defensive boosts into offensive pressure; this also has the benefit of effectively bypassing Quagsire's Unaware.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Rocky Helmet is the most sensible item, making Necrozma-DM less passive while setting up against physical threats, notably Zacian-C.</p> </li> <li> <p>Weakness Policy can be used to give Necrozma-DM a bit more offensive pressure when activated, boosting both of its offenses while additionally giving Stored Power 80 more Base Power.</p> </li> <li> <p>Leftovers can be useful for some passive recovery, lessening the need to use Morning Sun's limited 8 PP.</p> </li> </ul> "},
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>With this set, Necrozma-DM utilizes its great bulk and serviceable Special Attack to become a rather threatening Calm Mind sweeper.</p> </li> <li> <p>Stored Power already matches Photon Geyser's Base Power after activating Weakness Policy and getting one Calm Mind boost, or after getting three Calm Mind boosts. Continually increasing its Base Power also effectively bypasses Unaware.</p> </li> <li> <p>Heat Wave can be used as coverage for Ferrothorn, other Necrozma-DM, and Zacian-C.</p> </li> <li> <p>This set uses Dynamax particularly well , as Stored Power becomes a 130 BP Max Mindstorm, and Max Steelspike's Defense boosts contribute to both Necrozma-DM’s survivability and Stored Power's Base Power.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy is the preferred item, providing huge boosts to both Necrozma-DM's Special Attack and Stored Power's base power upon taking a super effective attack.</p> </li> <li> <p>Leftovers can be used to provide some passive recovery, better conserving Necrozma-DM's limited Morning Sun PP.</p> </li> <li> <p>Kee Berry also deserves a mention, as the Defense boost pairs nicely with the Special Defense boosts from Calm Mind, increasing Necrozma-DM's survivability.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 146, "username": "Tox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Naganadel": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A+ Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {"name": "Nasty Plot Sweeper", "description": "<ul> <li> <p>With Beast Boost boosting its Speed, Naganadel has excellent potential to sweep with Nasty Plot.</p> </li> <li> <p>While Draco Meteor may seem to be a poor fit for sweeping, it gives Naganadel a powerful attack without setting up, and is useful while Dynamaxed. Dragon Pulse can be used for consistent power, however.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb gives Naganadel the extra power it needs to sweep easily, and makes it less reliant on setting up Nasty Plot.</p> </li> <li> <p>Focus Sash can give Nagandel an unexpected chance to set up Nasty Plot.</p> </li> <li> <p>Lum Berry is also a handy tool against status, letting Naganadel shrug off attempts to stop a sweep with Yawn and Thunder Wave in particular.</p> </li> </ul> "},
      {"name": "All-out Attacker", "description": "<ul> <li> <p>Thanks to Beast Boost, Naganadel is fully capable of sweeping with 4 Attacks, especially while Dynamaxed.</p> </li> <li> <p>Air Slash lets Nagandel boost its Speed while Dynamaxed, whch pairs perfectly with Modest variants. If hitting Heatran is a must, Thunderbolt is a reasonable alternative.</p> </li> <li> <p>A Modest nature ensures that Naganadel will get a Special Attack boost after a KO, which is especially useful if using Choice Scarf or Air Slash. Timid is still useful though, because it lets Naganadel outspeed Cinderace.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb is Nagandel's best option for sweeping while Dynamaxed, giving Naganadel an immediate power boost.</p> </li> <li> <p>Choice Scarf gives Naganadel the alternative role of revenge killing threats when not Dynamaxed, and also lets it clean weakened teams thanks to Beast Boost.</p> </li> </ul> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Rillaboom": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "G-Max Choice Attacker"}, {"name": "G-Max General Offense"}, {"name": "G-Max Swords Dance Sweeper"}]},
  "Cinderace": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "G-Max Focus Sash"}, {"name": "G-Max Libero"}, {"name": "G-Max Choice Scarf"}]},
  "Corviknight": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<ul> <li> <p>When running maximum Defense investment alongside Iron Defense, Corviknight is a good physical wall that has several tools to differentiate itself from Celesteela, such as Roost.</p> </li> <li> <p>Body Press alongside Iron Defense makes Corviknight very difficult to defeat with physical attacks following a boost and allows it to deal incredibly high damage with Body Press following Defense boosts.</p> </li> <li> <p>Brave Bird allows Corviknight to hit Ghost-types and boost its Speed with Max Airstream, but Iron Head can be used to help ease the matchup against Swords Dance Mimikyu. Taunt can also be run here to stop status moves like Yawn, but this leaves Corviknight unable to damage Ghost-types.</p> </li> <li> <p>Avoid using Dynamax on Corviknight unless it needs it to survive hits in a pinch, such as switching in against a boosted Mimikyu. Corviknight will lose the massive damage output from Iron Defense-boosted Body Press, and its damage output is tame against any Pokemon with decent defenses.</p> </li> <li> <p>Mirror Armor is preferred over Pressure in order to survive against Max Phantasm Defense drops, allowing Corviknight to effectively defeat standard Mimikyu and physical Dragapult sets. This also punishes Intimidate Pokemon such as Landorus-T, Salamence, and Gyarados</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Sitrus Berry is the primary item, which helps Corviknight avoid many 2HKOs, such as Cinderace's Pyro Ball.</p> </li> <li> <p>Leftovers can be used for long-term health recovery if that is preferred.</p> </li> <li> <p>Rocky Helmet can be used for chip damage in matchups such as against Urshifu-R.</p> </li> </ul> "
      },
      {
        "name": "Specially Defensive",
        "description": "<ul> <li> <p>Near-maximum special bulk and Maranga Berry allow Corviknight to consistently survive weaker super effective attacks and set up on Pokemon that would otherwise check it.</p> </li> <li> <p>Taunt is the more traditional option for shutting down passive Pokemon, but Substitute can be used for stalling out PP more effectively or setting up on weak special attacks.</p> </li> <li> <p>Pressure is the preferred ability to stall out weak super effective special attacks, but Mirror Armor can still be useful to help against Intimidate users, Mystical Fire attackers, and Max Phantasm users.</p> </li> <li> <p>Dynamax allows Corviknight to survive otherwise lethal hits and can be used to sweep after Bulk Up boosts have been accumulated.</p> </li> <li> <p>The given EV spread is designed to be as specially bulky as possible while still being able to outspeed defensive Celesteela and Iron Defense Corviknight sets to Taunt them.</p> </li> </ul> "
      },
      {
        "name": "Fast Taunt",
        "description": "<ul> <li> <p>This Corviknight set takes advantage of its relatively good natural bulk, Speed investment, and Bulk Up to outspeed the majority of bulky metagame options to take advantage of passive foes and opposing Corviknight to sweep opposing teams with boosted Brave Bird or Max Airstream.</p> </li> <li> <p>Taunt is used to shut down status and boosting moves, allowing Corviknight to gain an advantage over slower Pokemon that have trouble damaging it. such as Hippowdon and Ferrothorn.</p> </li> <li> <p>Substitute can be used to gain an advantage over status users while also easing prediction against foes switching out.</p> </li> <li> <p>This Corviknight wants to Dynamax after setting up Bulk Up and when its natural checks, such as Rotom forms, are removed from the game or severely damaged. Following Speed boosts from Max Airstream, Corviknight becomes difficult to deal with for offensively oriented teams, as it will outspeed most Choice Scarf users at +2 Speed.</p> </li> <li> <p>Mirror Armor is used to help beat Mimikyu one-on-one, outspeeding it after a Max Airstream and reversing Defense drops from Max Phantasm. It also let Corviknight punish Intimidate Pokemon such as Landorus-T, Salamence, and Gyarados.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Lum Berry is used with Taunt generally to allow Corviknight to switch into moves such as Yawn, breaking Stealth Rock + Yawn cycles.</p> </li> <li> <p>Leftovers is generally used in combination with Substitute, to gain passive health while being protected by Substitute.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>108 HP / 148 Atk / 252 Spe with a Jolly nature: Maximum Speed allows this Corviknight to effectively Taunt all Corviknight while still having decent attacking power and health through partial investment in Attack and HP. It also can outspeed Jolly Cinderace at +1 Speed.</p> </li> <li> <p>252 HP / 4 Def / 252 Spe with a Jolly nature: This is a simple spread to maximize HP and Speed; it also lets Corviknight outspeed everything up to Jolly Cinderace at +1 Speed and survive hits better than the 148 Attack spread.</p> </li> <li> <p>252 HP / 60 Atk / 196 Spe with an Adamant nature: This EV spread allows Corviknight to outspeed positive-natured base 100 Speed Pokemon after a Max Airstream.</p> </li> </ul> "
      },
      {
        "name": "Weakness Policy",
        "description": "<ul> <li> <p>This Corviknight set is designed to bait in super effective attacks, using the combination of Dynamax and Corviknight's superb natural bulk to easily survive these attacks and hit back lethally with Max Airstream.</p> </li> <li> <p>Bulk Up is the boosting move of choice, allowing Corviknight to augment its Attack when not in Dynamax forme, allowing it to hit harder and making it more difficult to take down with physical attacks.</p> </li> <li> <p>Iron Head gives Corviknight a great chance to OHKO Dynamax Togekiss with Max Steelspike after Weakness Policy is activated.</p> </li> <li> <p>Power Trip can be used to deal massive damage following Dynamax expiring through stat boost accumulation.</p> </li> <li> <p>Body Press gives Attack boosts with Max Knuckle and allows Corviknight to hit Steel-types more effectively than other options.</p> </li> <li> <p>Taunt allows you to stifle slower status moves, allowing Corviknight to set up on passive Pokemon.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li>252 HP / 4 Def / 252 Spe with a Jolly nature: This is a simple spread to maximize HP and Speed; it also allows Corviknight to outspeed everything up to Jolly Cinderace at +1 Speed and survive hits better than the spreads invested in Attack.</li> </ul> <ul> <li>252 HP / 100 Atk / 156 Spe with an Adamant nature: These EVs are designed to outspeed positive-natured Dragapult after two Max Airstreams.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 336524, "username": "Greilmercenary9"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Grimmsnarl": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Dual Screens"}]},
  "Dracovish": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Choice Attacker"}, {"name": "Sand Rush Sweeper"}]},
  "Dragapult": {"sets": [{"name": "Physical Attacker"}, {"name": "Dual Screens"}, {"name": "Bulky Substitute"}]},
  "Zacian-Crowned": {
    "overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<ul> <li> <p>With absurd power and a great defensive typing, Zacian-C stands out as the most defining offensive threat in the metagame!</p> </li> <li> <p>Behemoth Blade is key to Zacian-C's success, letting it ignore the bulk boost Dynamax gives its foes.</p> </li> <li> <p>Close Combat is Zacian-C's strongest attack against Steel-types that would otherwise wall it.</p> </li> <li> <p>Quick Attack may be weak, but the priority is very helpful for picking off faster, weakened foes such as Choice Scarf Cinderace.</p> </li> <li> <p>Wild Charge deals massive damage to Ho-Oh, which otherwise can give Zacian-C issues, and OHKOes maximum HP Kyogre (assuming it doesn't Dynamax).</p> </li> <li> <p>Crunch ensures that Shedinja will not wall Zacian-C. Note that it deals the same amount of damage to Necrozma-DM as Close Combat, and it risks activating Weakness Policy.</p> </li> <li> <p>Substitute gives Zacian-C some insurance against Ditto, which can otherwise revenge kill it with a bit of chip damage.</p> </li> <li> <p>Fire Fang is rather weak, but it covers Shedinja and Ferrothorn with one move, though it does rather poorly in the rain.</p> </li> <li> <p>Solar Blade requires sun support from Groudon or Torkoal, but it allows Zacian-C to overcome its arch nemesis, Quagsire.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>220 HP / 252 Atk / 4 Def / 4 SpD / 28 Spe with Adamant: This EV spread allows Zacian-C to outspeed up to Adamant Cinderace, survive Jolly Landorus-T's Earthquake—provided it lacks Life Orb, and maximizes its power.</p> </li> <li> <p><strong>236 HP / 108 Atk / 4 Def / 132 SpD / 28 Spe with Adamant: This EV spread allows Zacian-C to survive Choice Scarf Kyogre's Water Spout 93.7% of the time, survive Jolly Landorus-T's Earthquake from full health, and still outspeed Adamant Cinderace.</p> </li> <li> <p><strong>92 HP / 252 Atk / 164 Spe with Adamant:</strong> This EV spread sacrifices a major amount of bulk to outspeed Jolly Cinderace. This spread is worth considering if your team has Stealth Rock support to chip Focus Sash Cinderace.</p> </li> <li> <p><strong>252 Atk / 4 SpD / 252 Spe with Jolly:</strong> Maximizing Speed allows Zacian-C to outspeed Eternatus and Choice Scarf Dracovish but results in far less bulk.</p> </li> </ul> "
      },
      {
        "name": "Swords Dance Sweeper",
        "description": "<ul> <li> <p>Swords Dance may seem like overkill with Zacian-C's crazy strength, but the extra boost can stop offensive Steel-resistant Pokemon such as Kyogre, Zapdos, and Ho-Oh from escaping a KO!</p> </li> <li> <p>Despite not offering much extra coverage alongside Zacian-C's other moves, Behemoth Blade is essential for the extra damage against Dynamax users such as Landorus-T.</p> </li> <li> <p>Play Rough deals massive damage to important Steel-type resistances, such as Kyogre and Zapdos.</p> </li> <li> <p>Close Combat is Zacian-C's most powerful tool against the majority of Steel-types.</p> </li> <li> <p>Quick Attack opens up new chances for cleaning up teams, at the cost of coverage.</p> </li> <li> <p>Wild Charge prevents defensive Ho-Oh from walling Zacian-C. With Stealth Rock support, even defensive Ho-Oh won't be saved by Dynamax.</p> </li> <li> <p>Crunch lets Zacian-C get around Shedinja. It also deals the same amount of damage to Necrozma-DM as Close Combat, though watch out for Weakness Policy.</p> </li> <li> <p>Fire Fang lets Zacian-C beat Shedinja and Ferrothorn with one moveslot. However, it is fairly weak and not particularly effective against other Steel-types in rain.</p> </li> <li> <p>Substitute creates a serious loss in coverage, but it does prevent a potentially devastating counter-sweep from Ditto.</p> </li> <li> <p>Quagsire will usually give Zacian-C problems, but preparing for it is especially important when trying to sweep with this set. Pokemon with Grass-type attacks are usually a good choice against it. Using Groudon or Torkoal in combination with Solar Blade is also an option, though it's fairly easy to predict at Team Preview if using Torkoal.</p> </li> <li> <p>When using this set, take dual screens support in serious consideration, as, despite its decent bulk, Zacian-C has a hard time setting up Swords Dance against most of the metagame. Good teammates to consider include Lapras with its Gigantamax set, Regieleki, and Grimmsnarl.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 Atk / 4 SpD / 252 Spe with Jolly: Maximizing Speed and Attack reduces the chance of opposing Zacian-C from revenge killing.</p> </li> <li> <p><strong>220 HP / 252 Atk / 4 Def / 4 SpD / 28 Spe with Adamant:</strong> This bulkier EV spread allows Zacian-C to survive Focus Sash Landorus-T's Earthquake while still outspeeding Adamant Cinderace.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 146, "username": "Tox"}, {"user_id": 469498, "username": "Luisin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Eternatus": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Cosmic Power"}, {"name": "Meteor Beam Sweeper"}, {"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Special Attacker"}]},
  "Urshifu": {
    "overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ",
    "sets": [
      {
        "name": "Focus Sash",
        "description": "<ul> <li> <p>With its high Attack stat, great STAB combination, and absolute nuke that is Wicked Blow, Urshifu-S has made a name for itself as one of the most threatening wallbreakers in the BSS metagame.</p> </li> <li> <p>With Focus Sash and Counter, Urshifu-S is also a potent revenge killer against physical threats.</p> </li> <li> <p>This variant of Urshifu-S makes for a solid lead, trading very efficiently with strong physical attackers such as Zacian-C and Landorus-T.</p> </li> <li> <p>Outside of the lead slot, Urshifu-S must be wary of Stealth Rock and other entry hazards nullifying its Focus Sash, and thus making Counter less consistent.</p> </li> <li> <p>Sucker Punch provides powerful priority, allowing Urshifu-S to finish off Pokemon that survived Counter or Wicked Blow the turn prior.</p> </li> <li> <p>Rock Tomb is difficult to fit in, but the Speed control it gives is very useful and unexpected from foes.</p> </li> <li> <p>Taunt is potentially useful to help Urshifu-S break through the likes of Quagsire and Toxapex by preventing them from recovering. However giving up Counter or Sucker Punch severely limits Urshifu-S’s potential against offensive Pokémon.</p> </li> <li> <p>While this variant of Urshifu-S usually won’t be using it, Gigantamax is preferred over Dynamax because G-Max One Blow's secondary effect helps Urshifu-S much more than Max Darkness’s.</p> </li> </ul> "
      },
      {
        "name": "BEAR KNUCKLE (Choice Item Attacker)",
        "description": "<ul> <li> <p>Wicked Blow is Urshifu-S's main attack, with the guaranteed critical hit providing extreme damage and bypassing Defense boosts or Attack drops</p> </li> <li> <p>Sucker Punch is powerful priority to pick off weakened, faster targets such as Regieleki, boosted Necrozma-DM, and especially Calyrex-S.</p> </li> <li> <p>U-turn is useful for Urshifu-S to effectively scout its switch-ins and maintain momentum for its team.</p> </li> <li> <p>Aerial Ace provides access to Max Airstream to boost Urshifu-S’s Speed, potentially allowing it to sweep faster, frailer teams. Max Airstream also can deny Eternatus the chance to recover against Urshifu-S and stall its Wicked Blow PP.</p> </li> <li> <p>Stone Edge is useful coverage against Ho-Oh, Yveltal and other Flying-types that could potentially survive Wicked Blow and KO Urshifu-S in return.</p> </li> <li> <p>Thunder Punch hits Tapu Fini super effectively in addition to most Flying-types, but it sacrifices some damage against Ho-Oh and Zapdos.</p> </li> <li> <p>Ice Punch can be used to heavily damage targets like Landorus-T and Zygarde while still hitting Yveltal and Zapdos super effectively.</p> </li> <li> <p>Sleep Talk is a niche but effective pick that allows Urshifu-S to absorb sleep from the likes of Hippowdon and Quagsire while maintaining effectiveness; however, Sucker Punch will fail if called by Sleep Talk when Urshifu-S moves last, so it is not advised to use these moves on the same set.</p> </li> <li> <p>If running Choice Band, an Adamant nature is worth considering. While Urshifu-S will no longer outspeed key threats such as Kyogre, Landorus-T, and Mimikyu, the extra power can be very helpful against bulkier teams.</p> </li> <li> <p>Gigantamax is preferred over Dynamax thanks to G-Max One Blow’s ability to ignore Max Guard.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Band provides Urshifu-S with absurd power, allowing Wicked Blow to easily 2HKO the likes of Toxapex and Quagsire, and even some resistant Pokémon like Yveltal. Additionally, very few Pokemon can stall out this set, making it particularly effective against stall teams.</p> </li> <li> <p>Choice Scarf lets Urshifu-S outspeed usually-faster targets, letting it revenge kill and grabbing a surprise KO, securing your team an early lead.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 469498, "username": "Luisin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Urshifu-Rapid-Strike": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Choice Attacker"}, {"name": "Focus Sash"}]},
  "Regieleki": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Dual Screens"}, {"name": "Special Attacker"}]},
  "Glastrier": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A+ Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Chilling Dynamax Sweeper",
        "description": "<ul> <li> <p>Glastrier's insane bulk, power, and Chilling Neigh make it a fearsome Dynamax sweeper, especially under Trick Room.</p> </li> <li> <p>Icicle Spear breaks through Focus Sash and Disguise, making it the ideal STAB once Dynamax has run out. Icicle Crash deals more consistent damage outside of Dynamax, and can flinch foes under Trick Room or with Custap Berry.</p> </li> <li> <p>Heavy Slam gives Glastrier access to the valuable Max Steelspike while Dynamaxed.</p> </li> <li> <p>Endure can be useful when used with Custap Berry to give Glastrier one priority attack.</p> </li> <li> <p>Glastrier becomes a far more deadly Pokemon when it has Trick Room support. Cresselia is the best choice for this, since it can use Lunar Dance to give Glastrier another chance to sweep through teams, and even let it Dynamax early. Mimikyu and Porygon2 are also good users of Trick Room.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy pairs perfectly with Dynamax, giving Glastrier another way to sweep teams.</p> </li> <li> <p>Custap Berry can make revenge killing Glastrier extra difficult when it's low on health, giving it one attack with higher priority.</p> </li> <li> <p>Assault Vest makes Glastrier even more difficult to take down on the special side, and pairs especially well with Dynamax.</p> </li> <li> <p>Lum Berry can be paired with Swords Dance to severly punish Yawn leads such as Hippowdon and Swampert, and also to worry less about common Will-O-Wisp users such as Rotom-W.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Spectrier": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p> ",
    "sets": [
      {
        "name": "Ghost Rider",
        "description": "<ul> <li> <p>Spectrier serves as a fragile but potent offensive sweeper, utilizing a very easily spammed Shadow Ball STAB option, high Speed tier, and Grim Neigh to overwhelm defensively oriented teams.</p> </li> <li> <p>Hyper Beam and Dark Pulse help Spectrier break through Normal-type Pokemon, and have the added bonus of dropping Speed and Special Defense, respectively, when Dynamaxed.</p> </li> <li> <p>Will-O-Wisp and Mud Shot allow Spectrier to provide surprisingly good support for teammates, as opponents need to respect Spectrier's offensive capabilities, leaving them vulnerable the two crippling moves.</p> </li> <li> <p>Substitute or Taunt are also great options for helping Spectrier take advantage of passive Pokemon, allowing it to setup Nasty Plot against unsuspecting foes.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb maximizes Spectrier's power, and puts less pressure on it needing to set up Nasty Plot to sweep.</p> </li> <li> <p>Spell Tag is a decent alternative if Life Orb is used by another Pokemon on your team.</p> </li> <li> <p>Lum Berry gives Spectrier an alternate means to set up on more passive Pokemon, such as Hippowdon and Swampert.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li>36 Def / 252 SpA / 220 Spe Timid: Allows Spectrier to outspeed 252 EV invested neutral Dragapult while gaining a bit more physical bulk to take advantage of burned foes.</li> </ul> "
      },
      {"name": "Choice Scarf", "description": "<ul> <li> <p>Spectrier runs a fairly simple Choice Scarf set, using its top Speed tier in order to revenge kill and snowball against opponents with its Grim Neigh boosts.</p> </li> <li> <p>Hyper Beam is usually picked to increase damage output, but Uproar can also be opted for to avoid a turn cooldown when not Dynamaxed and avoid falling asleep.</p> </li> <li> <p>Dark Pulse allows Spectrier to drop foes' Special Defense when Dynamaxed, Will-O-Wisp lets Spectrier serve as an emergency control against physical sweepers while also providing a Max Guard option, and Mud Shot allows Spectrier provide Speed control while also boosting its own Special Defense with Max Quake.</p> </li> </ul> "}
    ],
    "credits": {"teams": [], "writtenBy": [{"user_id": 434111, "username": "1_TrickPhony"}]}
  },
  "Calyrex-Ice": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Trick Room Sweeper"}, {"name": "Agility Sweeper"}]},
  "Calyrex-Shadow": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p> ", "sets": [{"name": "Special Attacker"}, {"name": "Choice Specs"}, {"name": "Bulky Choice Scarf"}]}
}