{
  "Blastoise": {
    "overview": "<p>With a kit tailor-made for enabling partners, Blastoise stands out as DOU's definitive pure support pick. Access to all of Fake Out, Follow Me, and a pivot move in Flip Turn makes Blastoise incredibly effective at controlling the board and generating space for teammates to operate. Its respectable defenses leave it quite adept at soaking up attacks for its team; its pure-Water typing can be a mixed bag, though, only truly vulnerable to Grass-types such as Rillaboom but giving little in meaningful resistances. Blastoise generally fits best in fast, aggressive teams that feature threatening setup sweepers such as Dragon Dance Dragapult, Nasty Plot Spectrier, and Quiver Dance Volcarona. While Blastoise does compete with Amoonguss as a redirector and Tapu Fini as a bulky Water-type, it can be a better fit for borderline hyper offensive compositions that prefer its dynamic, positioning-oriented arsenal over slow, controlling utility of Amoonguss's Spore and Tapu Fini's terrain control. Most glaringly, though, Blastoise's focus on sponging hits can let strong attackers like Urshifu-R and Zygarde simply overwhelm it or ignore the redirection; its lack of any offensive presence whatsoever means its partners must be threatening enough to make the support count.</p> ",
    "comments": "<h1>Other Options</h1> <p>Safety Goggles is one of the best alternatives on Blastoise purely for hard countering Amoonguss, as it renders Spore ineffective alongside Follow Me. Blastoise also has more niche alternatives for its fourth move in Helping Hand, Icy Wind, and Life Dew.</p> ",
    "sets": [{"name": "Follow Me Support", "description": "<ul> <li> <p>Fake Out and Follow Me let Blastoise keep its team safe, making them its primary tools for providing support.</p> </li> <li> <p>Flip Turn lets Blastoise act as a pivot, utilizing its bulk and relatively low Speed to effectively provide safe switches for teammates; it also makes Fake Out available again for later.</p> </li> <li> <p>Toxic pressures bulky threats such as Porygon2 and Kyurem-B, making up for Blastoise's lack of offensive presence, while Roar can be quite nifty for phazing and denying Trick Room setups.</p> </li> <li> <p>The EV spread is primarily focused on Defense to help Blastoise deal with the likes of Urshifu-R, Rillaboom, and Kyurem-B much more reliably, with the investment in its special bulk, in conjunction with its Sitrus Berry, handily letting it survive two Expanding Forces from Necrozma in Psychic Terrain.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finalnd"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Weezing-Galar": {"sets": [{"name": "Neutralizing Gas"}]},
  "Chansey": {"sets": [{"name": "Bulky Utility"}]},
  "Zapdos": {
    "overview": "<p>Zapdos offers a premium speed control option in Tailwind backed by a great 100 base Speed, making it a reliable user of the move. Its Electric typing offensively covers Urshifu-R, Volcanion, and Tapu Fini, while its Flying type allows it to defensively cover Rillaboom and Genesect. Zapdos' high Special Attack and ability to pivot out of the field means it is rarely passive as a support Pokemon. These traits and respectable bulk place it as a useful glue on fast-paced teams, supporting offensive behemoths such as Urshifu-R and Kyurem-B. On these types of teams, it faces competition from other Tailwind users such as the speedier and more offensive Naganadel, though its Volt Switch and durability set it apart. Zapdos is plagued by some poor matchups into tier mainstays such as Kyurem-B, Zygarde, and Diancie. Additionally, most of Zapdos's utility comes from its relatively fast Tailwind, meaning Taunt and Trick Room will render its main strength useless.</p> ",
    "comments": "<h1>Other Options</h1> <p>Heat Wave can be useful coverage for OHKOing Genesect and providing spread damage, though replacing Hurricane leaves Zapdos quite desperate for power in the face of bulkier opponents such as Rillaboom and completely blanked by Zygarde. Safety Goggles allows Zapdos to switch into and completely ignore opposing Amoonguss, but the loss of Sitrus Berry recovery is noticeable. A all-out rain attacking set with Life Orb, carrying Thunder as its Electric-type STAB move, turns Zapdos into a major threat that also carries useful speed control. Whirlwind can be used to force out foes that have accumulated stat boosts or are setting Trick Room.</p> ",
    "sets": [
      {
        "name": "Offensive Tailwind",
        "description": "<ul> <li> <p>Volt Switch offers a decently powerful and accurate STAB move that OHKOs Urshifu-R while giving Zapdos a pivoting option. This is quite important for bringing in strong offensive threats shortly after Zapdos has set Tailwind.</p> </li> <li> <p>Hurricane is Zapdos's primary damage-dealing option, slamming Rillaboom for a super effective hit while offering a strong neutral hit on Pokemon such as Zygarde and Kyurem-B.</p> </li> <li> <p>Tailwind is Zapdos's main niche, allowing Pokemon with otherwise middling Speed stats such as Heatran and Zygarde to outspeed the vast majority of the tier, and pushing faster teammates to unmatched Speeds.</p> </li> <li> <p>Protect allows Zapdos to dance around the opponent's dangerous moves and let its user to maneuver themselves into a better position.</p> </li> <li> <p>Sitrus Berry allows Zapdos to survive a Choice Band Surging Strikes from Urshifu-R and gives it general longevity.</p> </li> <li> <p>Static can inflict game-changing status against attacking Rillaboom, Genesect, and Urshifu-R, the latter of which hits three times with Surging Strikes.</p> </li> <li> <p>The given EV spread and nature maximizes Zapdos' speed, allowing it to outspeed Urshifu-R and Speed tie with opposing Zapdos and Mew. More bulk can be added to survive specific attacks—a spread of 232 HP / 24 SpA / 252 Spe can be used to survive a Modest Choice Specs Dragapult Draco Meteor and a Jolly Choice Band Urshifu-R Surging Strikes without Sitrus Berry.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 230771, "username": "qsns"}]}
  },
  "Zapdos-Galar": {
    "overview": "<p>Hailing from the Crown Tundra, the regional variant of Zapdos distinguishes itself as a strong, fast attacker thanks to its good Speed and great STAB combination. Galarian Zapdos also has the benefit of being a physical attacker that punishes Intimidate attempts with its Defiant ability, which makes it even stronger. Its Fighting / Flying typing grants it an excellent STAB combination that threatens many excellent Pokemon such as Rillaboom, Urshifu-R, Kyurem-B, and Incineroar. In particular, Galarian Zapdos is one of the best Rillaboom counters thanks to its resistance to Grass-type moves and ability to OHKO it with Brave Bird. This makes it one of the best partners for Tapu Fini, which greatly appreciates one of its greatest threats being removed. Another great teammate is Zygarde, who also loves Galarian Zapdos handling Rillaboom, along with it discouraging Intimidate from the likes of Incineroar and Landorus-T. Thanks to the combination of its base 100 Speed and the boost from Choice Scarf, Galarian Zapdos is able to outspeed Kyurem-B after a Dragon Dance, as well as common users of Choice Scarf, most notably Genesect. Galarian Zapdos's ability to consistently be the fastest Pokemon on the field is invaluable for bulkier teams that can struggle against more offensive teams. However, Galarian Zapdos struggles against the same bulkier teams, as Pokemon with high Defense like Tapu Fini and Diancie are mainstays on those teams, and Galarian Zapdos can struggle to break past them. Its damage can also be lackluster against neutral targets without a rare Defiant boost. Galarian Zapdos's poor defenses also make it dead weight against opposing speed control, and its reliance on Choice Scarf makes it very susceptible to Fake Out putting it in a vulnerable situation, along with the move lock being easily exploited. On top of that, it faces stiff competition from fellow Fighting-type Urshifu-R, which indirectly ignores Intimidate via Surging Strikes, while also being able to ignore Protect thanks to Unseen Fist.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Band and Life Orb are both options to increase Galarian Zapdos's damage output, but they make it very reliant on speed control as it no longer outspeeds Pokemon like Zeraora and Dragapult. Steel Wing OHKOs Diancie with Choice Band and has a good chance to with Life Orb, however, it's an exploitable move to lock into and has little usage otherwise.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<ul> <li> <p>Brave Bird and Close Combat are Galarian Zapdos's main STAB moves due to their high Base Power and ability to threaten several of the top Pokemon in the tier, like Rillaboom, Kyurem-B, and Urshifu-R. Brave Bird is the preferable attack to lock into, as it's the least exploitable of the two.</p> </li> <li> <p>Blaze Kick allows Galarian Zapdos to OHKO Genesect, while Low Sweep lets it provide immediate speed control for its teammates, thanks to Generation 8's dynamic speed mechanics.</p> </li> <li> <p>U-turn keeps momentum by taking advantage of Galaran Zapdos's switch-ins and can be used to pivot out of unfavorable situations.</p> </li> <li> <p>Choice Scarf allows Galarian Zapdos to immediately outspeed the vast majority of the metagame, even other users of Choice Scarf like Genesect, while the EV spread maximizes its offensive prowess.</p> </li> <li> <p>Defiant allows Galarian Zapdos to punish Intimidate and other methods of dropping stats, such as Icy Wind from Kyurem-B.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Mew": {
    "overview": "<p>Mew is one of the most versatile support choices in the Doubles OU metagame, thanks to its large movepool, decent bulk and relatively high Speed. Its main uses are providing Tailwind, setting up entry hazards like Stealth Rock, and helping Pokemon such as Dragon Dance Zygarde and Kyurem-B set up with moves like Fake Out and Pollen Puff. Mew is often used as a lead, to set up either speed control or hazards early on, or as a mid-game Tailwind enabler. Pokemon with strong spread moves, such as Choice Band Zygarde and Heatran, benefit from Mew's ability to reliably set Tailwind. Pokemon such as Genesect, Incineroar, and Tyranitar can threaten Mew with super effective attacks; teammates such as Heatran, Zygarde, and Urshifu-R can make use of Tailwind to put pressure on these threats. Due to an average Special Attack stat and lack of strong moves, Mew finds itself lacking in offensive pressure, which can allow opponents to reposition their Pokémon or set up.</p> ",
    "comments": "<h1>Other Options:</h1> <p>Other solid coverage moves include Flamethrower to hit Genesect and Earth Power to hit Volcanion and Heatran, depending on what the team is weak to. Coaching can support Zygarde, Kyurem-B, Urshifu-R, and other Pokemon, but it cuts into more valuable moves. Mew also has use as a setup sweeper, carrying Nasty Plot or Power Herb and Meteor Beam, although its Special Attack can be lackluster at times. Safety Goggles is another option over Sitrus Berry; it allows Mew to ignore Spore and Rage powder, although this is generally less useful and typically not worth the sacrifice of longevity. Taunt is a way to help against Trick Room, Tailwind, Spore, and other status moves.</p> ",
    "sets": [
      {
        "name": "Tailwind Support",
        "description": "<ul> <li> <p>Fake Out can generate free turns for your allies to switch, set up speed control, or attack safely. Besides Zeraora, Mew is the fastest relevant Fake Out user in the tier, allowing for more control against other Fake Out users.</p> </li> <li> <p>Ice Beam is Mew’s offensive option, hitting Zygarde and Landorus-T for 4x damage and chipping other common threats such as Rillaboom.</p> </li> <li> <p>Pollen Puff heals allies and goes through Substitute, which benefits setup Pokemon such as Dragon Dance Zygarde and Kyurem-B, as well as Pokemon like Eruption Heatran that appreciate HP boosts. However, you lose out on either Fake Out utility or Ice Beam coverage.</p> </li> <li> <p>Tailwind enables slower teammates such as Heatran, Volcanion, and Zygarde to become real threats by outspeeding Pokemon such as Urshifu-R, Dragapult, Zeraora, and Rillaboom.</p> </li> <li> <p>Stealth Rock weakens Pokemon such as Kyurem-B and Volcanion, putting them in range of KOs, and can dissuade opponents from making switches, lest they rack up too much chip damage.</p> </li> <li> <p>Sitrus Berry increases Mew's longevity, turning a 2HKO from Rillaboom's Wood Hammer into a 3HKO, for example.</p> </li> <li> <p>Maximum Speed investment allows Mew to set Tailwinds before Kyurem-B, Tapu Lele, and Urshifu-R move, allowing slower teammates to outspeed them immediately. The Speed also allows Mew to outspeed Zygarde and hit it with Ice Beam.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 546393, "username": "Crunchman"}]}
  },
  "Crobat": {
    "overview": "<p>Crobat has a small niche in DOU as a Tailwind setter for fast offensive teams. Crobat's base 130 Speed and ability Inner Focus allow it to reliably set Tailwind in most matchups, as it boasts the fastest non-Prankster Tailwind in the format and cannot be contested by Fake Out from the likes of Incineroar and Rillaboom. While it does compete in this niche with Ribombee, Crobat's access to Taunt comes in handy for maintaining its team's Speed advantage, preventing opposing Tailwind and Trick Room setters such as Naganadel and Diancie from being problematic. Strong teammates such as Urshifu-R, Landorus, and Heatran are preferred to capitalize on Crobat's Tailwind, with these three in particular being notable for decimating Diancie. One must be wary of opposing Zeraora, however, which completely counters Crobat because it is faster, can prevent Tailwind with Taunt, and hits Crobat super effectively with Plasma Fists. Partners such as Zygarde, Rillaboom, and Kyurem-B are preferred to deal with Zeraora, and these Pokemon are competitive beneficiaries of Tailwind as well. Crobat's biggest weakness, though, is how little offensive presence it has after setting Tailwind; its lacking offensive stats often leaving it exploitable against offensive teams, though Super Fang does mitigate this somewhat.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hypnosis adds even more to Crobat's offensive presence by rendering foes completely non-threatening, but its poor accuracy makes it generally unappealing. A set with maximum Attack investment and Sharp Beak is also viable to maximize damage with Brave Bird, allowing Crobat a guaranteed OHKO against Urshifu-R and a good chance to OHKO most Rillaboom. The decreased longevity can also be useful, as Crobat's job can be considered done after setting Tailwind, and some teams may prefer an earlier exit to more quickly switch in strong attackers.</p> ",
    "sets": [
      {
        "name": "Fast Utility",
        "description": "<ul> <li> <p>Tailwind provides speed control for strong teammates such as Zygarde, Heatran, and Urshifu-R.</p> </li> <li> <p>Taunt prevents opposing support Pokemon such as Porygon2 and Naganadel from setting Trick Room or their own Tailwind, allowing Crobat's team to maintain the Speed advantage.</p> </li> <li> <p>Brave Bird lets Crobat finish off weakened foes and hits key metagame threats such as Grass-types Rillaboom and Amoonguss, as well as Urshifu-R, super effectively. Super Fang gets around Crobat's lacking offensive stats by dealing meaningful damage to even the bulkiest of foes in the metagame, such as Diancie and Porygon2.</p> </li> <li> <p>Inner Focus prevents Fake Out users such as Incineroar and Rillaboom from contesting Crobat, and it is particularly handy against teams that lead a Trick Room setter paired with Fake Out teammate.</p> </li> <li> <p>Sitrus Berry provides a generally useful boost to Crobat's longevity, while Safety Goggles lets it ignore opposing Amoonguss.</p> </li> <li> <p>The EV spread and nature maximize Crobat's ability to take hits from special attackers such as Heatran and Dragapult while still outrunning Naganadel.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 531334, "username": "dnagerbdager"}, {"user_id": 243661, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Politoed": {
    "overview": "<p>Politoed is one of the primary rain setters due to Drizzle alongside decent defensive typing and stats, although it has lackluster offensive presence. It can often survive long enough to set rain multiple times, maintaining weather control. Attackers like Urshifu-R, Zapdos, Kingdra, and Tornadus take advantage of rain, and Helping Hand boosts their strength even further. Scald burns and support moves such as Icy Wind and Encore give Politoed further utility value beyond setting rain. A major drawback Politoed faces is matching up poorly against a plethora of common Pokemon, such as Rillaboom, Tapu Fini, Kyurem-B, Amoonguss, and Dragapult, among others. The aforementioned teammates, along with others like Genesect and Tsareena, can help this, though. Politoed's relative passivity can also clash with the typically fast-paced nature of rain teams. Therefore, it faces competition from Pelipper as a rain setter, which has Hurricane to deal with troublesome Grass-types and Tailwind, making it more offensively suited than Politoed.</p> ",
    "comments": "<h1>Other Options</h1> <p>Toxic and Hypnosis are notable support options but require terrain control to be truly effective, as they otherwise struggle against teams with Tapu Fini. Ice Beam trades the utility of Icy Wind for damage, helping Politoed against Grass- and Dragon-types, but it still struggles against the likes of Rillaboom and Kyurem-B. Sitrus Berry complements Politoed's natural bulk, but it is usually inferior to Eject Button or Damp Rock for maintaining rain. Hydro Pump is an offensive option even stronger than Weather Ball, although the imperfect accuracy makes it difficult to justify. Perish Song offers an alternative win condition for when the opponent has only two Pokemon left, but it does little otherwise.</p> ",
    "sets": [
      {
        "name": "Rain Setter",
        "description": "<ul> <li> <p>Scald is Politoed's primary attack, doing reasonable damage while boosted by rain and offering utility in the form of potential burns. Weather Ball has more raw power at the cost of utility and being incredibly reliant on rain, for instance guaranteeing the OHKO on Landorus.</p> </li> <li> <p>Helping Hand mitigates Politoed's limited offensive presence by allowing it to boost a stronger teammate's attack instead. It also lets Politoed make a move before Eject Button forces it out.</p> </li> <li> <p>Politoed's third moveslot is quite flexible, and which option is best can differ depending on the exact team. Icy Wind provides speed control for teammates, while Encore can lock a foe into a move like Fake Out or Protect, punish setup such as Dragon Dance from Kyurem-B, or disrupt Trick Room users.</p> </li> <li> <p>Protect allows Politoed to stall out a turn, wasting turns of opposing Tailwind or Trick Room, or keeping it safe while a teammate is brought out to be assisted with Helping Hand.</p> </li> <li> <p>Eject Button helps Politoed get off the field after its job of setting rain is done, allowing more offensive teammates to switch in and benefit while saving Politoed to set rain again later. Alternatively, Damp Rock extends the duration of rain, reducing the need to set it an additional time.</p> </li> <li> <p>The given EV spread patches up Politoed's more vulnerable physical bulk to ensure it can survive almost any single attack. This further helps Politoed fulfill its duty of maintaining rain throughout the match.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 243662, "username": "Yoda2798"}]}
  },
  "Kingdra": {
    "overview": "<p>While Kingdra does stand out as the best Swift Swim attacker in SS DOU, it still leaves a lot to be desired. Its Speed in rain gives it a notable amount of utility, as it can pin down faster, frailer foes while it breaks the opposing team with strong rain-boosted Muddy Waters. In particular, Kingdra excels in using its offensive presence to give its teammates space and clean up weakened teams. However, it has multiple awkward matchups in the metagame, including against DOU's top threats in Rillaboom, Tapu Fini, and Kyurem-B, and its average Special Attack stat can at times feel lacking, which is a major downside, as it offers no utility outside of purely attacking. Kingdra, in particular, faces stiff competition as a Water-type attacker in rain from Urshifu-R, which boasts noticeably better power output and coverage, an improved matchup against Trick Room, more relevant utility in the ability to force trades with Unseen Fist, and most importantly a non-reliance on rain to be effective; while Kingdra does offer blazing Speed and a better match-up against fast Dragon-types in Dragapult and Naganadel, its Speed is also easily compensated for by the rain archetype's many Tailwind-setting Flying-type options in Tornadus and Zapdos, and its need for Speed also leaves it much more vulnerable in the face of opposing speed control. Kingdra's reliance on keeping its rain setter available, as it is very lacking as an attacker without it, on top of its other flaws, ultimately makes it quite awkward to run on rain teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Specs is an option in order to amplify Kingdra's damage output even further, taking advantage of the fact that it only really needs its Water-type STAB moves to do its job while also niftily avoiding Life Orb's recoi. However, the set's inability to switch moves and run Protect viably can also leave it quite punishable, especially with Fake Out and other priority moves being particularly awkward to play against. Substitute is an option over one of Kingdra's coverage moves in order to block Fake Outs and Grassy Glide from Rillaboom, though losing one of its coverage moves can also make breaking through teams more difficult.</p> ",
    "sets": [
      {
        "name": "Swift Swim Attacker",
        "description": "<ul> <li> <p>Muddy Water is Kingdra's primary attacking option, as it hits both foes with significant rain-boosted damage.</p> </li> <li> <p>Hurricane is Kingdra's best option to hit Grass-type switch-ins such as Rillaboom and Amoonguss for super effective damage, and it is also nifty for sniping Urshifu-R.</p> </li> <li> <p>Draco Meteor is used to decimate Dragon-types that may otherwise be able to stomach a rain-boosted Water-type attack and hit back hard such as Kyurem-B, Dragapult, and Naganadel, though be wary, as it also weakens Kingdra considerably, squandering the already limited turns of rain.</p> </li> <li> <p>Hydro Pump is an option over either coverage move to decimate neutral targets such as Zeraora, Necrozma, and Metagross, which otherwise easily survive a Muddy Water, at the cost of being worse against either Grass-types and Rillaboom or Dragon-types.</p> </li> <li> <p>Protect lets Kingdra be safe for a turn, which is handy for giving teammates time to position around it and stalling out threatening field conditions such as opposing Tailwind and Trick Room.</p> </li> <li> <p>Life Orb in conjunction with the given EV investment and Modest nature is geared towards maximizing Kingdra's offensive presence, with Swift Swim letting it outrun practically the entire metagame under rain, getting the jump on Zeraora and Dragapult as well as Choice Scarf users such as Genesect and Galarian Zapdos.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "Kris"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Porygon2": {
    "overview": "<p>Porygon2 manages to stand out as a reliable Trick Room setter and threatening late-game wincon thanks to its Eviolite-boosted defenses, access to Recover, and single weakness in Fighting. Download can allow it to provide some offensive pressure with its good coverage in Thunderbolt and Ice Beam should it get a Special Attack boost. Porygon2 is appreciated on semi-Trick Room teams. On these teams, Rillaboom provides Fake Out support and checks Urshifu-R, while Volcanion and Diancie benefit from Trick Room, with Diancie being a secondary setter. However, if lacking a Download boost, Porygon2 can find itself being ignored due providing subpar offensive pressure. Porygon2 also has to be cautious of Knock Off from Incineroar and Toxic from Blastoise, which can severely cripple it. Despite having one weakness, Porygon2 can be OHKOed by Life Orb Urshifu-R and overwhelmed by combinations of strong attacks from Pokemon like Zygarde and Heatran.</p> ",
    "comments": "<h1>Other Options</h1> <p>Icy Wind Porygon2 fits on more offensive teams that do not need Trick Room support. It can also use Ally Switch to cause the opponent to pay attention to it or make unnecessary reads, which can rectify its passivity problem. However, running Ally Switch means you need to give up either valuable coverage or pressure with Toxic.</p> ",
    "sets": [
      {
        "name": "Trick Room",
        "description": "<ul> <li> <p>Ice Beam is a good coverage option that allows Porygon2 to hit foes such as Rillaboom, Zygarde, and Dragapult. In combination with Thunderbolt, it can hit the entire tier for at least neutral damage.</p> </li> <li> <p>Thunderbolt enables Porygon2 to pressure Tapu Fini, Volcanion, and Urshifu-R with super effective damage, while Toxic puts bulky walls like Assault Vest Kyurem-B and Porygon2, and setup sweepers such as Dragon Dance Kyurem-B and Calm Mind Tapu Fini outside of Misty Terrain, on a timer.</p> </li> <li> <p>Recover enables Porygon2 to stay healthy and consistently set up Trick Room, making it difficult to remove late-game once its main checks have been removed, such as Urshifu-R and Heatran.</p> </li> <li> <p>Trick Room makes Porygon2 an excellent form of speed control, as it can turn the tables against faster threats such as Urshifu-R and deters setup sweepers like Dragon Dance Kyurem-B from setting up. Allies in Volcanion and Diancie benefit greatly from Trick Room support, as they then underspeed the majority of the metagame.</p> </li> <li> <p>Download can often boost Porygon2's Special Attack due to the prevalence of Zygarde and Urshifu-R, which greatly improves its special moves, allowing it to OHKO Urshifu-R, Zygarde, and Dragapult at +1.</p> </li> <li> <p>The given EV spread allows Porygon2 to OHKO Zygarde and Dragapult at +1, as well as making Choice Band Zygarde's Thousand Arrows into a 4HKO and Modest Charcoal Heatran only able to 3HKO.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 491200, "username": "Light Sanctity"}]}
  },
  "Tyranitar": {"sets": [{"name": "Bulky Attacker"}]},
  "Ludicolo": {"sets": [{"name": "Rain Attacker"}]},
  "Pelipper": {
    "overview": "<p>Pelipper's coveted Drizzle helps make it a premier choice for rain setter, with STAB Hurricane for pesky Grass-types and Tailwind providing further value to rain teams. These traits make it a more offensive option than its rival setter Politoed, which has greater bulk and range of utility options for a more supportive role. Hurricane is great for removing Grass-types like Rillaboom, Amoonguss, and Tsareena on behalf of teammates such as Urshifu-R and Kingdra, which are also prime beneficiaries of rain. Using Pokemon like them, and other rain teammates like Zapdos and Tornadus, is vital for making full use of Pelipper's utility. Unfortunately, outside of super effective hits, Pelipper is underwhelming offensively, and it's often a vulnerable target if left on the field due to its subpar bulk and middling Speed. Its particularly low Special Defense means even strong neutral attacks can be quite threatening. The problem is worsened by Pelipper's weakness to common Pokemon such as Kyurem-B, Tapu Fini, Zeraora, and Dragapult. This harms Pelipper's ability to set rain multiple times when needed, something the more defensive Politoed is usually better at doing.</p> ",
    "comments": "<h1>Other Options</h1> <p>Wide Guard is useful for stopping strong spread attacks, most notably Zygarde's Thousand Arrows and Diancie's Diamond Storm. U-turn lets Pelipper pivot out to teammates to maintain momentum, though it's less useful if already carrying Eject Button. Focus Sash and Sitrus Berry are item options, but they are generally less effective in keeping rain up throughout the match than Eject Button and Damp Rock. Hydro Pump is Pelipper's strongest attack in rain and notably can KO standard Diancie; however, the minor increase in power over Weather Ball is brought down by suboptimal accuracy.</p> ",
    "sets": [
      {
        "name": "Rain Setter",
        "description": "<ul> <li> <p>Hurricane is strong, unable to miss in rain, and deals with Grass-types such as Rillaboom and Amoonguss, which resist rain-boosted Water-type attacks.</p> </li> <li> <p>Weather Ball is a powerful attack when used in rain, and it's generally Pelipper's strongest offensive option, but it's heavily reliant on weather dominance to be effective. Scald is a slightly weaker alternative that is functional outside of rain while offering burn utility.</p> </li> <li> <p>Tailwind helps make up for Pelipper's paltry Speed stat, and it provides utility to teammates. One important example use is to counter opposing Tailwind, which cramps Swift Swim partners like Kingdra.</p> </li> <li> <p>Protect keeps Pelipper safe while stalling field conditions such as Trick Room and Tailwind.</p> </li> <li> <p>Eject Button helps Pelipper switch out after setting rain, getting more offensive Pokemon in immediately to effectively use rain turns. On the other hand, Damp Rock increases how long rain lasts, meaning Pelipper needs to switch in less often.</p> </li> <li> <p>The given EV spread allows Pelipper to outspeed the majority of the unboosted metagame in Tailwind, up to and including Dragapult and Zeraora. Combined with a Modest nature, the Special Attack EVs make Hurricane a guaranteed 2HKO on standard Amoonguss through Sitrus Berry, while the remaining EVs are placed into HP to maximize Pelipper's limited bulk.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 243662, "username": "Yoda2798"}]}
  },
  "Torkoal": {
    "overview": "<p>Torkoal's low Speed and powerful Drought-boosted Eruption make it one of the most devastating Trick Room sweepers in Doubles, though its reliance on Trick Room and sun being active can leave it inconsistent in practice. Eruption, in particular, is amazing for getting as much damage on the board as possible in the limited amount of turns that Trick Room is up. Its passable natural bulk, particularly its solid Defense, makes it difficult to KO in one hit without a special Ground- or Rock-type attack. However, Torkoal has its limitations: namely, entry hazards like Stealth Rock and Spikes, which greatly limit its offensive potential, as they cripple Eruption's power as soon as Torkoal enters the battlefield. Additionally, its reliance on Trick Room, and accordingly, multiple Trick Room setters like Porygon2, Diancie, and Necrozma, and sun means that it needs to work hard to get the most out of the few turns it is afforded. Even then, other Fire-types such as Heatran and Volcanion give it stiff competition for a slot on semi-Trick Room teams. It also despises Fake Out users like Incineroar and Zeraora if it isn't paired with some sort of priority blocker like Tapu Lele, Indeedee-F, or Tsareena, as they can stall its Trick Room turns.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Specs can be used for the strongest Eruption possible, but being locked into a move dependent on HP can lead to potentially unfavorable scenarios. Solar Beam is useful for hitting Urshifu-R, Tapu Fini, and Diancie hard but leaves Torkoal completely walled by Fire-types or without a backup STAB attack. Flamethrower and Overheat are alternative options to Heat Wave, useful for giving Torkoal an option to bypass Wide Guard; however, being single-target moves, they limit Torkoal's potential as a sweeper. Wise Glasses is useful for giving Torkoal a general boost to all of its special attacks, including the ability to always OHKO Heatran with Earth Power.</p> ",
    "sets": [
      {
        "name": "Trick Room Attacker",
        "description": "<ul> <li> <p>Eruption is capable of sweeping teams quickly when at full power, 2HKOing almost any neutral target and even some resisted targets like Dragapult.</p> </li> <li> <p>Earth Power hits common resists such as Volcanion, Diancie, and Incineroar, making it a great complementary move to Torkoal's Fire-type attacks.</p> </li> <li> <p>Heat Wave is a strong secondary Fire-type attack that can be used when Torkoal's HP is too low to effectively make use of Eruption.</p> </li> <li> <p>Protect is useful for avoiding opposing Fake Outs and stalling a turn when bringing in a Trick Room setter.</p> </li> <li> <p>The This EV Spread maximizes Torkoal's general bulk while also having the strongest possible offensive capabilities. 0 Speed IVs and a negative nature are crucial for underspeeding Amoonguss.</p> </li> <li> <p>Charcoal gives Torkoal a powerful Eruption with virtually no drawback, making it the best choice for an item.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  },
  "Metagross": {"sets": [{"name": "Utility"}]},
  "Heatran": {"sets": [{"name": "Fast Attacker"}]},
  "Cresselia": {"sets": [{"name": "Calm Mind"}]},
  "Excadrill": {"sets": [{"name": "Sand Rush"}, {"name": "Mold Breaker"}]},
  "Whimsicott": {
    "overview": "<p>Whimsicott has a usable niche as a decent support Pokemon, but it's seriously lacking in every other department. Its Prankster ability lets it to make excellent use of its wide support movepool, which includes moves like Fake Tears, Encore and Taunt, but most notably Tailwind. Prankster Tailwind is a great tool, as it immediately enables many strong attackers, and it can even be consistently set while opposing speed control is up, which is invaluable to the Hyper Offense teams Whimsicott is usually found on. Pokemon like Heatran, Urshifu-R, Zygarde, and Landorus especially appreciate Whimsicott's support, and the latter two can threaten the Fire-types, like Incineroar, that Whimsicott hates. Heatran and Landorus further benefit from Fake Tears. Whimiscott also has limited defensive utility, as its typing allows it to switch in on the likes of Rillaboom, Zygarde, and Urshifu-R, although its poor defenses make this risky. This same bad bulk, alongside its overall poor typing, means Whimsicott has trouble setting Tailwind multiple times, as it struggles to stay in for multiple turns or switch back in after leaving the field. Whimsicott also has difficulty against teams with Psychic Terrain or Tsareena, both of which negate most of its support movepool, bar Tailwind. Finally, Whimsicott faces competition from other Tailwind setters such as Naganadel and Mew. The former possesses powerful offensive pressure, and the latter has a massive support movepool, which includes Fake Out, and fantastic bulk, which makes setting Tailwind multiple times a cinch.</p> ",
    "comments": "<h1>Other Options</h1> <p>Memento cripples attackers until they switch and provides momentum, which can be invaluable on hyper offense teams. However, it doesn't provide as much utility as Whimsicott's other moves while also sacrificing it on use.</p> ",
    "sets": [
      {
        "name": "Prankster Support",
        "description": "<ul> <li> <p>Prankster Tailwind is Whimiscott's main niche, allowing it to instantly provide speed control for a teammate like Urshifu-R, Zygarde, or Heatran.</p> </li> <li> <p>Taunt can be used to prevent status moves like Tailwind and Trick Room from opposing Pokemon, while Encore lock the foe into an unfavorable move, like Protect, Fake Out, or Tailwind. Both greatly benefit from Prankster's priority.</p> </li> <li> <p>Moonblast allows Whimiscott to decently check Zygarde and Urshifu-R while also providing chip damage for its team.</p> </li> <li> <p>Fake Tears further supports special attackers such as Heatran and Landorus by helping them break through bulkier Pokemon like Tapu Fini and Porygon2.</p> </li> <li> <p>Protect allows Whimiscott to block Fake Out and preserve its Focus Sash.</p> </li> <li> <p>Focus Sash guarantees Whimsicott can take a hit, which can allow it to get a support move off after setting Tailwind or a second Tailwind later.</p> </li> <li> <p>A Timid nature allows Whimsicott to Speed tie with other Whimsicott, in addition to outspeeding Landorus. 252 HP EVs can be used if Moonblast isn't used.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 215000, "username": "Memoric"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Amoonguss": {
    "overview": "<p>Amoonguss is one of the best support Pokemon in the metagame, capable of redirecting attacks with Rage Powder or putting foes to sleep with Spore. It is bulky enough to live most attacks, and the added survivability from Regenerator allows it to perform its role repeatedly throughout a match. Additionally, Pollen Puff ensures Amoonguss's teammates can also remain healthy. Setup Pokemon, such as Dragon Dance Zygarde or Kyurem-B and Calm Mind Tapu Fini, benefit the most from Amoonguss's support and can make up for its minimal damage output. Due to its low Speed and Spore, Amoonguss also works well both with and against Trick Room teams, as it can then send most Pokemon to sleep before they move. Trick Room users such as Porygon2 and Diancie also appreciate the redirection support while setting it. Despite being able to stomach most hits, Amoonguss must be wary of Fire-types such as Heatran and Incineroar as well as Psychic-types such as Tapu Lele and Necrozma, requiring teammates to deal with them such as Urshifu-R and Heatran, respectively. The presence of Misty Terrain hampers Amoonguss's Spore, so terrain setters such as Tapu Lele and Indeedee-F, or Metagross with Steel Roller, are essential to remove it. Opposing Grass-types such as Rillaboom, or Pokemon holding Safety Goggles, can also be troublesome, as immunity to powder moves lets them mostly ignore Amoonguss and attack its partner. Blastoise, its biggest competitor as a redirector, doesn't share this drawback.</p> ",
    "comments": "<h1>Other Options</h1> <p>Resist berries such as Occa and Papaya allow Amoonguss to live certain attacks that it would not otherwise. Eject Button lets Amoonguss redirect a hit and then immediately switch out, e.g. for helping to set Trick Room or Tailwind and then getting an attacker in to benefit right away. However, Eject Button can be awkward if Amoonguss intends to use Spore and gets forced out instead or needs to redirect two attacks. Another option is Rocky Helmet, which provides chip damage on physical attackers such as Urshifu-R, Rillaboom, and Genesect. These alternate item choices are not as generally useful as the recovery from Sitrus Berry, though. Clear Smog is a weaker Poison-type STAB move compared to Sludge Bomb, but it can be used instead to help deal with opposing setup. A Grass-type STAB move such as Energy Ball could also be considered, but it cannot effectively hit the Pokemon immune to Spore, while the Pokemon it does hit harder than Sludge Bomb are vulnerable to Spore, so there is little reason to use it.</p> ",
    "sets": [
      {
        "name": "Rage Powder Support",
        "description": "<ul> <li> <p>Sludge Bomb is Amoonguss's primary offensive option, hitting Tapu Fini as well as Grass-types like Rillaboom, which are immune to Spore. Protect can be used instead to scout for moves such as Choice Scarf Genesect locking into Ice Beam, but this leaves Amoonguss quite passive.</p> </li> <li> <p>Pollen Puff heals Amoonguss's partner.</p> </li> <li> <p>Rage Powder keeps partners safe from attacks and is most effective when used alongside setup Pokemon, or while setting field conditions such as Trick Room and Tailwind.</p> </li> <li> <p>Besides critically putting foes out of action, Spore helps ensure Amoonguss is not too passive while on the field.</p> </li> <li> <p>Sitrus Berry complements Amoonguss's bulk, turning many would-be 2HKOs into 3HKOs instead, such as Ice Beam from non-Life Orb Kyurem-B.</p> </li> <li> <p>Regenerator also helps Amoonguss's longevity on switching out, which can let it give future utility even when at low health.</p> </li> <li> <p>The given EV spread and nature, combined with Sitrus Berry, allow Amoonguss to live two Heat Waves from Volcanion, with the remaining EVs placed in Defense. 28 Speed IVs let it underspeed Diancie to move first under Trick Room while still being able to outspeed foes with the help of speed control.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 243662, "username": "Yoda2798"}]}
  },
  "Tornadus": {
    "overview": "<p>Tornadus is a niche support Pokemon on rain teams,granting Tailwind with Prankster for teammates like Kingdra and Zygarde. Its Flying typing is crucial to beat rain threats such as Rillaboom, Amoonguss, and Tsareena, landing STAB Hurricane with rain-boosted accuracy while resisting their Grass-type attacks. All this support helps teammates like Urshifu-R, Nihilego, and Heatran, which force out the Steel- and Rock-types that Tornadus fears. Urshifu-R under Tailwind, in particular, can also force out Dragon Dance-boosted Kyurem-B, one of Tornadus's biggest checks. Tornadus, however, faces fierce competition from fellow Flying-type Tailwind user Zapdos. Zapdos is bulkier, letting it provide Tailwind for the entire game, and has comparable offensive pressure, better threatening the likes of Volcanion and Tapu Fini with Thunder. Another issue Tornadus has is its reliance on rain for its offensive pressure, as both of its attacking moves are unreliable outside of it.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tornadus can use Taunt over Protect to block opposing Tailwind or Trick Room to secure the speed control advantage. Sharp Beak can be used over Life Orb for more longevity while still boosting Hurricane.</p> ",
    "sets": [{"name": "Tailwind Support", "description": "<ul> <li> <p>Hurricane is Tornadus's strongest STAB attack and hits prominent Grass- and Fighting-types like Urshifu-R, Amoonguss, and Rillaboom for super effective damage. It becomes more reliable and threatening under rain because of its perfect accuracy.</p> </li> <li> <p>Weather Ball damages Pokemon that resist Hurricane like Nihilego, Diancie, and Heatran in rain.</p> </li> <li> <p>Tailwind gives powerhouse teammates such as Urshifu-R and Zygarde immediate speed control with Prankster.</p> </li> <li> <p>Protect allows Tornadus to hinder Fake Out attempts and stall out Trick Room turns if needed.</p> </li> <li> <p>Life Orb noticeably helps Tornadus blast the likes of Rillaboom, Urshifu-R, and Diancie.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 531334, "username": "dnagerbdager"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 540482, "username": "Reece"}]}
  },
  "Landorus": {
    "overview": "<p>Landorus stands out as the most threatening special attacker in the format. Blessed with Sheer Force and a Ground typing, Landorus decimates many metagame threats such as Incineroar, Diancie, and Metagross, with its outright power significantly chunking even bulky neutral switch-ins like Mew and Porygon2. Its base 101 Speed is just enough to pin down nearly the entire unboosted metagame, letting it get the jump on Mew, Urshifu-R, and Zygarde while only being outrun and threatened by Nihilego, Naganadel, and Dragapult. However, Landorus offers very little defensive utility in disadvantaged positions against opposing speed control, is vulnerable to Ice- and Water-type attacks from the likes of Porygon2 and Tapu Fini, an is relatively frail, leaving it easily OHKOed by the aforementioned three faster threats. Tailwind teammates mitigate this weakness, with Naganadel in particular also matching up well against Assault Vest Kyurem-B, Tapu Fini, and Rillaboom, which Landorus can struggle against. Landorus can also struggle against particular bulky threats that it can't outright OHKO such as Porygon2, Celesteela, and Assault Vest Kyurem-B, which each punish it accordingly. Urshifu-R, Metagross, and Heatran are good example teammates to account for them.</p> ",
    "comments": "<h1>Other Options</h1> <p>Focus Blast can be handy to hit Celesteela, which otherwise completely walls Landorus, and is also nifty as a super effective option against Porygon2 and Kyurem-B, though its narrow applications and unreliability make it unappealing. Similarly to Substitute, Stealth Rock can be useful to punish a switch or Protect, but Landorus is typically better off attacking, which Substitute better enables. Choice Scarf is a viable alternative set, as it can let Landorus lure in and surprise KO faster threats such as Nihilego, Naganadel, and Dragapult, and Landorus still has enough damage without Life Orb to be a decent general Choice Scarf attacker. However, it must be used cautiously, as threats like Rillaboom will easily punish it locking into Earth Power. Rillaboom resists Earth Power, can flinch Landorus with Fake Out, and can get around its Speed advantage with Grassy Glide.</p> ",
    "sets": [
      {"name": "Special Attacker", "description": "<ul> <li> <p>Earth Power is very strong with boosts from Sheer Force and Life Orb, in particular being handy for key metagame threats such as Incineroar, Metagross, and Diancie.</p> </li> <li> <p>Sludge Bomb hits Grass-types that can switch in on and resist Earth Power such as Rillaboom and Tsareena, and it's also useful against Tapu Fini.</p> </li> <li> <p>Substitute lets Landorus punish Protect and switches, providing a buffer from Fake Out and otherwise lethal blows, while Psychic comes in handy for hitting opposing Landorus and nailing Amoonguss.</p> </li> <li> <p>Protect gives Landorus safety for a turn, handy for stalling out field conditions such as Tailwind and Trick Room, as well as maintaining board position while teammates switch accordingly.</p> </li> <li> <p>Life Orb and Sheer Force maximize Landorus's offensive potential, with Timid being key for outrunning threats such as Urshifu-R, Genesect, and Mew.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 531334, "username": "dnagerbdager"}, {"user_id": 243661, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Landorus-Therian": {
    "overview": "<p>Landorus-T possesses the unique combination of Intimidate, Stealth Rock, and U-turn, which, alongside its bulk, make it a decent pivot. It fits best on balance teams, with some of its best partners including Volcanion for its ability to switch into Water- and Ice-type attacks, Metagross for being one of the best checks to Kyurem-B, and Rillaboom for being being able to beat Water-types like Tapu Fini. There are, however, some notable drawbacks to Landorus-T. Two of the best Pokemon in the tier, Kyurem-B and Tapu Fini, are very unfavorable matchups for Landorus-T. In addition, it is also threatened by Pokemon that run Ice-type coverage such as Genesect and Porygon2. Intimidate is also a less notable selling point than it has traditionally been due to the state of the metagame, with Urshifu-R able to land critical hits through any Attack drops using Surging Strikes and Diancie, Metagross, and Dragapult able to ignore Intimidate completely due to Clear Body. Offensively, Landorus-T struggles to do major damage to anything that isn't weak to Ground, but it can pick up OHKOs on Heatran and Nihilego. It also faces competition from Pokemon like Incineroar and Zygarde for a teamslot; the former has access to the Intimidate + pivot move combination while also having Fake Out and a better defensive typing, though Landorus-T does better than Incineroar against opposing Zygarde and Zeraora, while the latter has much more offensive potential.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Choice Scarf set can be run to make Landorus-T a more offensive pivot, allowing it to outspeed the entire unboosted metagame with a Speed-boosting nature. Knock Off can function as both coverage and utility, being Landorus-T's best way to deal damage against Dragapult and Spectrier while and cripple Porygon2. Superpower can be used to provide Fighting-type coverage to hit Porygon2 and Kyurem-B, but this demands Attack investment to make it worthwhile. Several Rock-type coverage moves are available; Stone Edge is the most powerful and can 2HKO Zapdos, Rock Slide is particularly good at dealing damage to Volcarona while it's next to redirection and has the potential to pick up flinches, and Rock Tomb can provide speed control, though these moves are rather niche, being generally less effective than Toxic or Protect.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<ul> <li> <p>Despite having much higher Attack than Special Attack, Earth Power is recommended over Earthquake due to the latter being weakened by Grassy Terrain and opposing Intimidate.</p> </li> <li> <p>U-turn allows Landorus-T to pivot out, letting you better position yourself while allowing for future opportunities to switch back in and threaten the foe with Intimidate.</p> </li> <li> <p>Setting up Stealth Rock can chip away at opposing switch-ins, most notably Kyurem-B and Incineroar.</p> </li> <li> <p>Toxic is useful for wearing down setup sweepers like Dragon Dance Zygarde and Dragon Dance Kyurem-B or bulky foes like Porygon2 and Diancie. Protect can help Landorus-T stay safe from Ice-type moves that it will often be the target of.</p> </li> <li> <p>Sitrus Berry helps increase Landorus-T's overall bulk, increasing the odds of making a Terrain-boosted Wood Hammer from -1 Rillaboom a 3HKO.</p> </li> <li> <p>Intimidate is helpful in mitigating the damage output of physical attackers like Rillaboom, Zeraora, and Zygarde.</p> </li> <li> <p>The given HP and Special Defense EVs allow Landorus-T to take a +1 Meteor Beam from Nihilego. 64 Special Attack EVs guarantee a 2HKO on Diancie with Earth Power.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 154787, "username": "KennyJ"}]}
  },
  "Kyurem-Black": {
    "overview": "<p>Kyurem-B is blessed with the combination of solid mixed attacking capabilities, good defensive stats—which make it difficult to remove, a potent boosting option in Dragon Dance, and excellent coverage moves in Fusion Bolt and Earth Power, making it one of the most threatening forces in Doubles OU. It can be used on almost any team due to its universally beneficial combination of offensive pressure and utility, utility both in outright checking threats like Rillaboom and Zygarde and even speed control from Icy Wind. Its monstrously strong Dragon Dance set is also one of the most potent wincons in the tier, especially when paired with Fake Out and redirection support from the likes of Incineroar and Amoonguss, though it struggles against Trick Room Pokemon, particularly Diancie. Unfortunately, Kyurem-B's relatively average Speed tier leaves it outrun by checks like Urshifu-R and Genesect, which can hit it for super effective damage. Additionally, its poor defensive typing leaves it open to multiple powerful fringe attacks such as Galarian Zapdos's Close Combat, Nihilego's Meteor Beam, and Metagross's Steel Roller.</p> ",
    "comments": "<h1>Other Options</h1> <p>Kyurem-B can use a Life Orb mixed attacking or Choice Band physical set to have a stronger immediate offensive presence; however, the former gets worn down fairly quickly with recoil, while the latter can be taken advantage of based on the move it locks in to. Freeze-Dry can be used over Fusion Bolt to avoid running a Defense-lowering nature and hit Water-types that aren't weak to Electric like Kingdra and Dracovish. Like Leftovers, Heavy-Duty Boots can be useful for preserving its health, but it is useless if the opponent isn't using entry hazard. Dragon Tail phazes Trick Room setters and setup sweepers like Porygon2 and Dragon Dance Kyurem-B, respectively, though it cannot be used on Diancie. Flash Cannon can hit Diancie but serves little purpose otherwise.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<ul> <li> <p>Dragon Dance boosts Kyurem-B's already sky-high Attack. Additionally, it outruns the entire unboosted metagame at +1 Speed, and it even outruns the likes of Heatran in Tailwind and Choice Scarf Genesect at +2.</p> </li> <li> <p>Icicle Spear is Kyurem's main attack, OHKOing the likes of Zygarde and Dragapult unboosted while also scoring OHKOs on Rillaboom and Zapdos at +1 with at least three hits.</p> </li> <li> <p>Fusion Bolt gives Kyurem-B great coverage, hitting Water-types like Tapu Fini and Urshifu-R, as well as Steel-types such as Heatran and Genesect that resist Icicle Spear.</p> </li> <li> <p>Protect is necessary for keeping Kyurem-B safe from attacks like Necrozma's Meteor Beam and Fake Out from Incineroar and Rillaboom, in addition to providing a turn to bring in supportive partners like Amoonguss and Incineroar.</p> </li> <li> <p>Leftovers can be very useful because Kyurem-B often gets worn down when attempting to set up Dragon Dances. Chople Berry lets it take a Close Combat from any variant of Urshifu-R, allowing it to use Dragon Dance to then outspeed and OHKO it back with Fusion Bolt.</p> </li> <li> <p>With 136 Attack EVs and an Adamant nature, Kyurem-B will always OHKO Zygarde with two hits from Icicle Spear, while maximum Speed investment allows it to tie Adamant Zygarde unboosted and outrun Dragapult and Zeraora at +1 Speed.</p> </li> </ul> "
      },
      {"name": "Assault Vest", "description": "<ul> <li> <p>Ice Beam is a very reliable STAB move, hitting numerous common Pokemon such as Landorus-T, Zygarde, Rillaboom, and Zapdos for super effective damage, while Fusion Bolt makes good use of Kyurem-B's great Attack stat, hitting Water-types like Volcanion and Tapu Fini.</p> </li> <li> <p>Earth Power is an excellent coverage move, hitting Fire- and Steel-types including Heatran, Incineroar, and Metagross.</p> </li> <li> <p>Icy Wind provides a means of speed control while also 2HKOing the likes of Zygarde and Dragapult through redirection.</p> </li> <li> <p>The EV spread, combined with Assault Vest, allows Kyurem-B to outspeed maximum Speed Adamant Zygarde and survive a Draco Meteor from Choice Specs Dragapult.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  },
  "Genesect": {
    "overview": "<p>Genesect excels as a strong offensive pivot that can gain the upper hand in the positioning game thanks to its STAB U-turn, 120 / 120 offenses, wide variety of powerful coverage moves, and excellent ability in Download. It can immediately threaten a wide swathe of the tier for super effective damage, including Kyurem-B, Rillaboom, and Zygarde, and many teams appreciate it bringing in setup threats or Pokemon with favorable matchups. become a potent wincon with Shift Gear, completely dismantling teams that lack study counterplay options such as Heatran, Volcanion, Zapdos, and Urshifu-R. It also has the sustainability that other setup sweepers lack thanks to Leech Life. Unfortunately, not only does Genesect have no way to hit most Fire-types, but its effectiveness plummets when momentum isn't on its side, either due to Fake Out or opposing forms of speed control. This counterplay exposes its meager bulk and 4x Fire weakness while impeding its revenge killing. Lastly, once Choice Scarf Genesect is locked into a move, it becomes a lot easier to play around. Genesect appreciates teammates that threaten Fire-types like Volcanion, Urshifu-R, and Zygarde, while it threatens Kyurem-B, Rillaboom, and Landorus in return. Shift Gear Genesect in particular enjoys support from Pokemon with redirection, such as Volcarona, or Fake Out, like Zeraora.</p> ",
    "comments": "<h1>Other Options</h1> <p>Assault Vest lets Genesect switch moves and improve its special bulk, notably avoiding the 2HKO from both +1 Expanding Force in Psychic Terrain and Earth Power from Necrozma. If running it, be sure to run a Hasty nature instead of Naive. Other items that allow switching moves are Life Orb and Expert Belt, with Expert Belt being less directly effective but avoiding recoil and letting Genesect bluff Choice Scarf. However, all three items leave Genesect slower than threats such as Zapdos, Naganadel, and Dragapult, which makes its life as a pivot much harder. Flash Cannon is an option over Iron Head to for Diancie after it gets some Defense boosts, but does significantly less damage to Assault Vest Kyurem-B, Nihilego, and Tapu Fini. Explosion deals tremendous damage to both opposing Pokemon, especially with an Attack boost, but it both sacrifices Genesect and threatens its ally.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<ul> <li> <p>Iron Head is a reliable STAB move that punishes Fairy- and Rock-type Pokemon such as Diancie and Nihilego. It's used over Flash Cannon to pressure Assault Vest Kyurem-B more effectively.</p> </li> <li> <p>U-turn is Genesect's most spammable move, allowing it to gain momentum and bring in a Pokemon with a more favorable matchup. It also hits the omnipresent Rillaboom, as well as Psychic-types like Necrozma and Mew, for super effective damage.</p> </li> <li> <p>Ice Beam is important coverage for the likes of Zygarde, Landorus-T, and Dragapult. It is also the best option to damage Zapdos, which otherwise threatens Genesect with Heat Wave.</p> </li> <li> <p>Thunderbolt OHKOes Urshifu-R with a Download boost, while hitting Celesteela and Volcanion hard. Flamethrower hits other Genesect, along with Metagross, and still hits Celesteela hard.</p> </li> <li> <p>Choice Scarf allows Genesect to outspeed the entire unboosted metagame and bring immediate pressure with its wide array of coverage, as well as revenge killing Speed-boosted threats such as Kyurem-B and Zygarde. It also allows it to pivot out before potentially getting KOed. However, Choice Scarf's lock-in effect does punish Genesect severely for choosing an incorrect move.</p> </li> <li> <p>Download is an incredible offensive ability that always boosts two of Genesect's moves and can flip some matchups in its favor. Notably, with the Special Attack boost, it can OHKO Dragapult with Ice Beam and OHKO Urshifu-R if running Thunderbolt.</p> </li> <li> <p>A Naive nature is chosen over Hasty to switch into physical threats such as Rillaboom, Zygarde, and Diancie better. Hasty is an option to take less damage against Necrozma, but the loss in physical bulk is generally not worth it.</p> </li> <li> <p>152 Special Attack EVs allow Genesect to OHKO Zygarde and Landorus-T without relying on a Download boost. Maximum Speed investment is important to outrun Kyurem-B after a Dragon Dance and Choice Scarf Urshifu-R. Alternatively, full Attack and Speed investment can be used because U-turn and Iron Head are the moves it uses the most.</p> </li> </ul> "
      },
      {
        "name": "Shift Gear",
        "description": "<ul> <li> <p>Shift Gear lets Genesect outspeed the entire unboosted metagame while becoming a huge offensive threat with a potential Download Attack boost, 2HKOing or even 2HKOing or every OHKOing most of the metagame.</p> </li> <li> <p>Leech Life is Genesect's main STAB move, regaining health while being just as powerful as Iron Head. Notably, the recovery can negate Life Orb recoil. It also OHKOes opposing Rillaboom with no Attack boosts at all while providing immediate pressure on Psychic-type Pokemon like Mew and Necrozma, being able to OHKO the former with just a Download boost.</p> </li> <li> <p>Iron Head hits common threats like Diancie and Kyurem-B for super effective damage. It is also useful for trying to get a timely flinch to win the game.</p> </li> <li> <p>Protect shields Genesect from threatening attacks, and it can also be used to bring in a support partner or stall out field conditions such as Trick Room and opposing Tailwind.</p> </li> <li> <p>52 Speed EVs let Genesect always outspeed Choice Scarf Landorus after a Shift Gear.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}, {"user_id": 327195, "username": "Z Strats"}, {"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Zygarde": {
    "overview": "<p>Boasting great offensive capabilities with Thousand Arrows, a decent defensive typing, and solid bulk to boot, Zygarde sets itself as a premier threat in the metagame. Thousand Arrows is a big draw to Zygarde, as it is one of the best offensive spread moves in the game due hitting Ground-immune Pokemon, making it having no immunities and a lack of resistances on an already great offensive type. Choice Band allows Zygarde to be immediately threatening to teams with instant power, while Dragon Dance turns it into a threatening sweeper. However, both options have issues with being too slow and requiring multiple turns of setup to be threatening, respectively. Redirection support from the likes of Volcarona and Amoonguss as well as Fake Out support from Rillaboom and Zeraora can help alleviate these weaknesses, with the Dragon Dance set in particular appreciating these opportunities to set Substitute and set up. Due to the Zygarde's middling Speed tier and lack of immediate power ,it is easily pressured by the likes of Genesect, Kyurem-B, and Dragapult which outspeed and threaten to OHKO it. Furthermore, Rillaboom, Tapu Fini, and the aforementioned Kyurem-B easily take a hit from Zygarde and can force it back out. Intimidate from both Landorus-T and Incineroar can make Zygarde much easier to deal with defensively. Zygarde also faces stiff competition with Landorus, which boasts much more immediate power and better coverage options.</p> ",
    "comments": "<h1>Other Options</h1> <p>Dragon Dance Zygarde can opt for a slightly more offensive set with Soft Sand to further boost Thousand Arrows's power at the cost of losing Leftovers, which in turn makes Substitute harder to pull off. Scale Shot provides Zygarde with a secondary STAB option that can nail Ground-resistant Pokemon and provide a burst of Speed. However, the Defense drop and being forced to drop a potentially more useful coverage option makes it not worth it most of the time. A Sitrus Berry, Yache Berry, and Weakness Policy can all be used on the Dragon Dance set, although the lack of passive recovery forgone when choosing these items over Leftovers makes them an inferior option.</p> ",
    "sets": [
      {"name": "Choice Band", "description": "<ul> <li> <p>Thousand Arrows is Zygarde’s most spammable move because it has no immunities and few resistances as well as being a spread move with respectable power.</p> </li> <li> <p>Thousand Waves has the ability to trap both opposing Pokemon for as long as Zygarde is in play, but it can only damage grounded Pokemon unlike Thousand Arrows. Toxic can be used instead to wear down bulkier Pokemon such as Porygon2 and Cresselia.</p> </li> <li> <p>Superpower allows Zygarde to deal massive damage against Kyurem-B and Porygon2, which otherwise pivot into Zygarde easily and threaten it out.</p> </li> <li> <p>Extreme Speed allows Zygarde to pick off weakened targets that would normally outspeed and KO it, such as Dragon Dance Kyurem-B and Urshifu-R.</p> </li> </ul> "},
      {"name": "Dragon Dance", "description": "<ul> <li> <p>Due to Thousand Arrows's nature of having no immunities and a lack of resistances and being a spread move, it is the only move Zygarde needs. Thousand Arrows's decent power is also easily offset by Dragon Dance.</p> </li> <li> <p>Dragon Dance turns Zygarde into a threatening setup sweeper letting it outspeed the entire unboosted metagame at +1.</p> </li> <li> <p>Substitute allows Zygarde to block Fake Out and Intimidate, avoid a potential Spore or Toxic, and take a hit if needed.</p> </li> <li> <p>Protect keeps Zygarde safe for a turn and lets it accumulate an extra turn of Leftovers recovery, as well as stall out turns of Tailwind and Trick Room.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 531334, "username": "dnagerbdager"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 441302, "username": "Shadowmonstr7"}, {"user_id": 529732, "username": "adem"}]}
  },
  "Diancie": {
    "overview": "<p>Diancie shines as one of the best Trick Room setters and beneficiaries due to its high offensive and defensive stats, low Speed, strong typing, and access to Diamond Storm, fitting the unique role of a reliable Trick Room setter that can also deal out massive damage. Offensively, Rock has minimal resistances and hits common Pokemon like Kyurem-B and Incineroar super effectively. While its typing might leave it with four common weaknesses, its outstanding defensive stats mean that it can usually take a hit and activate Weakness Policy. Diancie fits best on semi-Trick Room compositions, where it takes advantage of its low Speed and can set up Trick Room multiple times and start shredding holes in the opponent's team with Diamond Storm, stacking Defense boosts to make it much harder to get rid of. Clear Body also lets it ignore Intimidate, making it very hard to stop once it gets going. Volcanion makes for an excellent partner, as it helps remove Grass- and Steel-types such as Rillaboom and Genesect for Diancie, which in return provides reliable speed control. Rillaboom's Fake Out makes Trick Room easier to set up and its powerful Grass-type STAB moves help against Urshifu-R and Tapu Fini. In return, Diancie takes care of Fire-types and Kyurem-B. Diancie struggles quite a bit outside of Trick Room, where its poor Speed leaves it vulnerable to super effective hits from the likes of Urshifu-R, Rillaboom, Zygarde, and Genesect, the first ignoring any Defense boosts Diancie might accumulate and the second having strong priority to hit first even if Trick Room is active. Diancie is also hard walled by Metagross, and must always worry about its strong Steel-type STAB moves threatening an OHKO. Furthermore, it can struggle to break past bulkier Pokemon such as Tapu Fini and Amoonguss even under Trick Room, the latter of which is able to land Spore freely if Diancie isn't using Safety Goggles.</p> ",
    "comments": "<h1>Other Options</h1> <p>Body Press can be used over Moonblast to synergize well with Defense boosts from Diamond Storm, but it needs said boosts to be most effective and Diancie then loses out on coverage for Urshifu-R and Zygarde. It also doesn't benefit from any potential Weakness Policy boosts. Play Rough is another alternative to Moonblast that's stronger, but it risks missing and the power difference is typically not needed, especially if Diancie gets the Weakness Policy boost. Babiri, Rindo, Shuca, and Passho Berry are all options to make sure Diancie lives a certain hit on specific teams and Mental Herb can be used to ignore Taunt once, but these items are less useful overall than Weakness Policy or Safety Goggles.</p> ",
    "sets": [
      {
        "name": "Trick Room Attacker",
        "description": "<ul> <li> <p>Diamond Storm is a strong spread STAB attack with minimal resistances in the tier and hits Pokemon such as Kyurem-B and Incineroar super effectively. Successfully gaining Defense boosts also aids Diancie against physical attackers such as Rillaboom and Zygarde.</p> </li> <li> <p>Moonblast covers common Diamond Storm switch-ins such as Urshifu-R and Zygarde.</p> </li> <li> <p>Trick Room is an excellent form of speed control that lets Diancie control the pace of the game. It is useful for letting both itself and its partners move first while also deterring setup from Dragon Dance Kyurem-B and Zygarde.</p> </li> <li> <p>Protect keeps Diancie safe for a turn while a support teammate, such as a Fake Out or redirection user, switches in to aid in setting up Trick Room.</p> </li> <li> <p>Weakness Policy works well with Diancie's phenomenal bulk and weaknesses to common types such as Water and Grass. Safety Goggles ignores Spore and redirection attempts from Amoonguss, one of the best Pokemon against Trick Room.</p> </li> <li> <p>Clear Body lets Diancie ignore Intimidate and Parting Shot from Incineroar, rending standard means of decreasing damage from physical attackers useless.</p> </li> <li> <p>A Sassy nature lets Diancie live a Steam Eruption from Volcanion and usually move first under Trick Room when combined with minimum Speed IVs. The remaining EVs are dumped into Attack to boost Diamond Storm. A Brave nature can be used instead of Sassy to hit as hard as possible. Additionally, 104 EVs can be shifted from Attack to Special Attack to secure the OHKO on Urshifu-R with Moonblast.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Volcanion": {
    "overview": "<p>Volcanion is an excellent bulky attacker that can dish out massive damage with a STAB combination only resisted by Water- and Dragon-types. Volcanion also possesses defensive utility thanks to its good defenses and unique typing. It fits well on semi-Trick Room teams, which let Volcanion reliably OHKO several dangerous Pokemon like Heatran and Genesect without needing to take a hit beforehand. Diancie can set Trick Room for Volcanion while also beating Kyurem-B. Rillaboom and Zeraora can use Fake Out to allow Volcanion to create Substitutes and easily beat Water-types. In return, Volcanion reliably beats Steel-types for Diancie and Fire-types for Rillaboom. Volcanion can struggle to find attacking opportunities with its awkward Speed tier forcing it to take a hit if it doesn't have speed control, and several Pokemon like Kyurem-B, Tapu Fini, Dragapult, and Urshifu-R can easily switch into Volcanion and threaten it out. It also faces stiff competition as a Water-type from the aforementioned Tapu Fini and Urshifu-R, as well as a Fire-type from Heatran and Incineroar.</p> ",
    "comments": "<h1>Other Options</h1> <p>Sludge Bomb hits Tapu Fini and Overheat is a stronger Fire-type STAB move that also bypasses Wide Guard, but both have less utility overall than Substitute or Earth Power. Toxic is also an option to wear down Pokemon Volcanion doesn't immediately threaten, like Porygon2, and works well with Rillaboom removing Misty Terrain. However, unlike Substitute and Earth Power, its utility takes a long time to set in. Heavy-Duty Boots is an alternate item to prevent Stealth Rock from rapidly wearing down Volcanion, but it is useless without opposing entry hazards. Shuca Berry can let Volcanion take Ground-type attacks like Landorus's Earth Power and Zygarde's Thousand Arrows, although it's useful in far fewer situations than Leftovers or Safety Goggles.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<ul> <li> <p>Steam Eruption deals large amounts of damage to even neutral targets, and it destroys Fire- and Ground-type Pokemon like Incineroar and Landorus-T. It also can punish switch-ins with its high burn chance.</p> </li> <li> <p>Heat Wave is a spread move that hits Grass-types that resist Steam Eruption, like Rillaboom and Amoonguss.</p> </li> <li> <p>Volcanion can set up Substitute on Genesect, on Incineroar, and while next to a Fake Out user, and this allows Volcanion to attack freely without fear of attacks like Zygarde's Thousand Arrows. Earth Power is an option over Substitute to hit Volcanion, which would otherwise wall it. If Earth Power is run, Safety Goggles should be Volcanion's item to retain the ability to block Amoonguss's Spore.</p> </li> <li> <p>Protect keeps Volcanion safe so a teammate can come in and support it, such as Rillaboom with its Fake Out, while also allowing a teammate to set up ether Trick Room or Tailwind.</p> </li> <li> <p>Leftovers restores Volcanion's lost health from Substitute, while Safety Goggles allows it to switch into Amoonguss's Spore and ignore its Rage Powder when not running Substitute.</p> </li> <li> <p>Water Absorb lets Volcanion switch into Urshifu-R's Surging Strikes and completely wall it if it's Choice locked.</p> </li> <li> <p>EVs can be shifted from HP to Speed to outspeed Zeraora in Tailwind, or Volcanion can utilize a Quiet nature and 0 Speed IVs to be as fast as possible under Trick Room.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Incineroar": {
    "overview": "<p>The combination of an excellent ability, access to valuable utility moves, and solid stats makes Incineroar one of the best pivots in the tier. It fits well on a variety of team structures because of its great defensive utility being appreciated on most archetypes. Specifically, setup threats such as Calm Mind Tapu Fini and Dragon Dance Kyurem-B appreciate its ability to generate safe turns, while strong offensive Pokemon such as Zygarde and Urshifu-R value the slow and safe switch-in generated through Parting Shot. However, Incineroar faces competition from other Fire-types such as Volcanion and Heatran, and it has rough matchups against common Pokemon such as Tapu Fini and Zygarde. It is also easily worn down pivoting in and out, especially since it rarely can fit Protect in its repertoire.</p> ",
    "comments": "<h1>Other Options</h1> <p>Heavy-Duty Boots and Assault Vest are options over Sitrus Berry for either immunity to entry hazards or more special bulk, but they are usually not worth over the healing Sitrus Berry provides. When running Assault Vest, use U-turn over Parting Shot, but the minimal damage is usually less helpful than Parting Shot's stats drops, so you shouldn't use it unless needed. Safety Goggles lets it act as a more reliable check to Amoonguss, but it leaves Incineroar with no healing. Taunt shuts down any Trick Room setters, but it's hard to justify using over any of Incineroar's usual moves, which have much more utility overall.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<ul> <li> <p>Fake Out can provide space for your partner to boost its stats, provide speed control, switch, or attack.</p> </li> <li> <p>Flare Blitz is a strong STAB move that hits Pokemon such as Rillaboom, Amoonguss, and Genesect for super effective damage. Despite little investment, it still hits hard due to Flare Blitz's high Base Power, which is worth the recoil.</p> </li> <li> <p>Knock Off is a great utility move because removing items is always beneficial. Specifically, it can remove important items such as Eviolite on Porygon2, Assault Vest on Kyurem-B, and Leftovers on Tapu Fini.</p> </li> <li> <p>Parting Shot allows you to grab momentum while also enabling recycling of Fake Out and Intimidate. It also has the added bonus of crippling common switch-ins such as Urshifu-R and Volcanion.</p> </li> <li> <p>The EV spread allows Incineroar to survive a Steam Eruption from Volcanion and OHKO Dragapult with Knock Off. EVs can be moved to Speed to outpace threats in Tailwind.</p> </li> <li> <p>Sitrus Berry provides burst healing which helps Incineroar in pivoting in and out. It also gives it good odds to survive two Choice Band Zygarde Thousand Arrows at -1.</p> </li> <li> <p>Intimidate weakens most opposing physical attackers on the switch in, notably Dragon Dance Kyurem-B and Zygarde, often forcing them out to reset their own stats.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 188164, "username": "MajorBowman"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Ribombee": {
    "overview": "<p>As the only viable Sticky Web setter in DOU, Ribombee has a niche in the most aggressive of hyper offense teams as a unique speed control support option, albeit one with an inconsistent matchup spread. Ribombee's high Speed and Shield Dust, which prevents flinching from Fake Out, make it a reliable Sticky Web setter, stopped only by a combination of priority and the few faster Pokemon in the metagame such as Zeraora and Dragapult. It also has access to Tailwind, which gives its team the Speed advantage before foes switch in and out to activate Sticky Web. This support makes Ribombee quite effective against fast teams such as rain and Naganadel-centric teams, giving strong teammates such as Urshifu-R and Zygarde both a lasting and an immediate Speed advantage. Ribombee's biggest problems, however, are its one-dimensional, telegraphed kit and polarized matchups. It practically has to be led in every game in order to actually take advantage of Sticky Web. Further, Sticky Web is useless against common ungrounded foes such as Landorus and Zapdos, and the move is outright detrimental against slower, bulkier teams running Trick Room. Even more, its frailty gives it zero defensive utility, making it completely dead weight in matchups where Sticky Web isn't useful, and Steel-types such as Celesteela and Genesect easily exploit its STAB coverage. Ribombee's dependence on running into a workable matchup often leaves it outshined by more consistent and simpler speed control options such as Mew, Naganadel, and Assault Vest Kyurem-B.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ally Switch lets Ribombee surprise foes by unexpectedly taking a hit for its partner. Getting KOed lets Ribombee give a free switch to a more offensive teammate once it's done providing speed control. Protect can be used because Ribombee is a common victim of double-targeting, as its main moveset is generally expected and inflexible, thus letting Ribombee waste an opponent's turn while preserving itself. Fake Tears alongside strong special attackers such as Nihilego and Heatran can be used to quickly overwhelm a specific foe, but its narrow applications make it an unappealing option.</p> ",
    "sets": [
      {
        "name": "Speed Control",
        "description": "<ul> <li> <p>Tailwind, in practice, is most useful immediately after setting Sticky Web, before the entry hazard actually takes effect.</p> </li> <li> <p>Moonblast is its main attacking option, giving good neutral coverage and hitting Dragon-types such as Kyurem-B and Zygarde, as well as Urshifu-R, super effectively.</p> </li> <li> <p>Pollen Puff comes in handy as a super effective option against Psychic-types such as Mew and Cresselia, as well as Rillaboom. It also has nifty utility in healing up a weakened attacker teammate, handy for coming off better when trading damage.</p> </li> <li> <p>Shield Dust is used specifically to prevent Fake Out from the likes of Rillaboom and Incineroar from flinching Ribombee, letting it set Sticky Web unopposed, and it also comes in handy for avoiding the Speed drop from Kyurem-B's Icy Wind.</p> </li> <li> <p>Focus Sash hides Ribombee's frailty a bit, helping it set both Sticky Web and Tailwind.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 531334, "username": "dnagerbdager"}, {"user_id": 243661, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Tsareena": {
    "overview": "<p>Tsareena provides a strong niche to teams with its ability in Queenly Majesty, which lets it protect its allies from priority such as Fake Out and Rillaboom's Grassy Glide. It also functions as a solid check to the likes of Rillaboom, Zygarde, and Tapu Fini, threatening all three out, as well as taking away the biggest tools from the first two. Tsareena works best on offensive teams where it can protect Urshifu-R and weakened teammates from getting sniped down from Rillaboom's Grassy Glide, as well as Choice Band Zygarde and Choice Scarf Genesect from getting slowed down by Fake Out. Tsareena's middling Speed tier in conjunction with its mediocre bulk, often relying on an Assault Vest or a Sitrus Berry for longevity, make it extremely vulnerable to the myriad of strong attackers in the tier, such as Heatran and Genesect. Tsareena also faces large competition from the dominant Grass-types of the tier in Rillaboom and Amoonguss, which provide more overall utility in the form of Fake Out and Grassy Surge for the former and redirection and Spore for the latter.</p> ",
    "comments": "<h1>Other Options</h1> <p>A Choice Band set utilizing Grassy Glide can be used alongside Rillaboom to increase Tsareena's offensive prowess, but by taking on a more offensive role, it becomes less reliable at blocking priority. Rapid Spin is another option that can be handy in some cases, removing entry hazards that can be detrimental long term as well as boosting its middling Speed, although it is useless against hazardless teams and is generally less viable compared to Tsareena's other move options. Feint and Helping Hand enable Tsareena's teammates to pick up KOs by breaking Protect and boosting their damage output, respectively, but at the cost of other valuable moves. Wide Lens can also be used to make up for Tsareena's low accuracy moves, but it cuts into its longevity greatly.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<ul> <li> <p>Power Whip is Tsareena's strongest STAB option, allowing it to force out threats such as Tapu Fini and Urshifu-R, as well as netting heavy damage on neutral targets such as Necrozma and Zeraora.</p> </li> <li> <p>U-turn lets Tsareena pivot out of unfavorable positions while maintaining momentum to bring another teammate in safely. This can lead to scenarios where Tsareena can block Fake Out and Grassy Glide at the start of the turn and then bring in something with a better matchup.</p> </li> <li> <p>Triple Axel threatens the likes of Landorus, Zygarde, and Amoonguss and shifts these matchups a lot more in Tsareena's favor.</p> </li> <li> <p>High Jump Kick is used to threaten common Grass-resistant Pokemon such as Kyurem-B, Incineroar, and Heatran, but Tsareena must be wary of Protect. Taunt is another option on Sitrus Berry sets to shut down Trick Room setters such as Porygon2 as well as redirection users such as Amoonguss, Blastoise, and Volcarona.</p> </li> <li> <p>The given spread allows Tsareena to survive a Close Combat from Choice Band Urshifu-R while also giving it a solid offensive presence. The Attack EVs can be moved into Speed to allow Tsareena to outspeed the likes of Rillaboom, Tapu Fini, and Zeraora under Tailwind, but this cuts into its offensive capabilities.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Kommo-o": {
    "overview": "<p>Kommo-o is a niche sweeper for offensive teams because of its matchup reliance due to its checks such as Tapu Fini and Naganadel being fairly common. After a Clangorous Soul or Iron Defense boost, Kommo-o poses a threat to common Pokemon. Due to its handful of notable resistances, it can take on foes such as Rillaboom, Incineroar, and Zeraora. Kommo-o looks to set up with help from redirection and Fake Out, as it’s relatively passive and easy to pick off before it boosts. Kommo-o is especially weak to Fairy-type Pokemon, and Expanding Force, which cannot be redirected in Psychic Terrain. Tapu Fini, in particular, is troublesome, as it invalidates Kommo-o entirely with Misty Terrain. Kommo-o struggles against Psychic spam teams as well since it gets OHKOed by Necrozma’s Expanding Force and Tapu Lele’s Moonblast while struggling to pressure them in return. Naganadel and Kyurem-B threaten to OHKO Kommo-o before it sets up; however, if it safely gets a Clangorous Soul off it will become a threat to them instead. Rillaboom is a support for Kommo-o as it both checks Tapu Fini and sets Grassy Terrain to replace Misty or Psychic Terrain. The recovery provided by Grassy Terrain also helps make up for Clangorous Souls recoil. Amoonguss is another great teammate, providing redirection with Rage Powder and recovery with Pollen Puff.</p> ",
    "comments": "<h1>Other Options</h1> <p>On the Throat Spray set, Aura Sphere is an option to hit Heatran harder; however, most other Steel-types in DOU take neutral damage from it. Soundproof prevents Snarl from lowering Kommo-o’s Special Attack however, it is vastly inferior immunities to Sand, Hail, and Spore that Overcoat provides. For the Body Press set, Substitute lets Kommo-o avoid common ways of passively chipping it like Toxic and Will-O-Wisp. Draco Meteor can nab unexpected KOs on other Dragon-types thinking they can switch in and threaten Kommo-o.</p> ",
    "sets": [
      {
        "name": "Throat Spray Sweeper",
        "description": "<ul> <li> <p>This set aims to sweep with Clanging Scales after a Clangorous Soul boost, with Throat Spray giving an additional +1 to Special Attack.</p> </li> <li> <p>This set threatens massive spread damage with Clanging Scales after a boost. Additionally, it threatens Dragon-types like Naganadel, and Kyurem-B.</p> </li> <li> <p>Flamethrower hits Steel-types like Genesect, Celesteela, and Metagross, but should only be used when these mons are actively threatening Kommo-o as Clanging Scales already deals sufficient damage.</p> </li> <li> <p>Flash Cannon hits Fairy-types like Diancie and Tapu Lele; however, it is largely outclassed by Flamethrower due to its vastly worse overall matchup spread.</p> </li> <li> <p>Protect gives Kommo-o free turns to avoid damage while letting teammates pivot in to support it. It is particularly useful on this set as Kommo-o is frequently being double targetted when on the field.</p> </li> <li> <p>Overcoat protects Kommo-o from Amoonguss’s Spore and keeps Rage Powder users from redirecting its single target moves.</p> </li> <li> <p>A Timid nature with max Special Attack and Speed investment maximizes Kommo-o's offensive potential while retaining a decent Speed tier.</p> </li> </ul> "
      },
      {"name": "Body Press", "description": "<ul> <li> <p>This set uses Iron Defence to boost its Body Press to frightening levels of power while becoming harder to defeat.</p> </li> <li> <p>Because this set uses Body Press as a solo attacking move, Kommo-o can afford to run Stealth Rock to support its team.</p> </li> <li> <p>Protect gives Kommo-o free turns to get Leftovers recovery and stall while a support teammate is switched in.</p> </li> <li> <p>Overcoat lets Kommo-o ignore Rage Powder from Amoonguss and Volcarona, and gives it an immunity to Amoonguss’s Spore.</p> </li> <li> <p>The Speed investment lets Kommo-o outspeed Modest Celesteela, letting it trade effectively, while the Defense investment lets Kommo-o OHKO Porygon2, Heatran, and Incineroar at +2, and trade positively with physical attackers like Urshifu, Zeraora, and Rillaboom.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 215000, "username": "Memoric"}, {"user_id": 531334, "username": "dnagerbdager"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 428483, "username": "Grandmas Cookin"}]}
  },
  "Tapu Koko": {"sets": [{"name": "Choice Specs Attacker"}]},
  "Tapu Lele": {
    "overview": "<p>Tapu Lele is an asset to teams with its Psychic Terrain providing a large boost to Psychic-type moves, blocking Fake Out and other priority, and removing other Terrains, which means it puts strong offensive pressure on opposing teams. Tapu Lele works best on Psychic-type spam and semi-Trick Room structures alongside teammates such as Necrozma that appreciate Psychic Terrain vastly boosting Expanding Force. Amoonguss is also a solid partner due to Tapu Lele removing opposing Misty Terrain, which blocks its Spore. However, Tapu Lele is held back by its middling Speed tier, which, while high enough to outspeed threats such as Choice Band Zygarde, is still vulnerable to attackers such as Urshifu-R and Dragapult. It is also generally quite weak due to the prevalence of opposing Terrain control as well as the the lack of a boosting item and significant Special Attack investment. Furthermore, its inability to break through Steel-type Pokemon such as Heatran, Genesect, and Metagross means it needs offensive support from Pokemon such as Urshifu-R and Zygarde. Tapu Lele also faces competition from Indeedee-F as a Psychic Terrain setter, which has less offensive prowess but provides much more in terms of support to teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tapu Lele can run a Choice Scarf or a Choice Specs set with a fully offensive EV spread, but this comes at the cost of being locked into one move, losing Taunt, and being much less effective at maintaining Psychic Terrain. Life Orb is also an option to boost Tapu Lele’s power while still maintaining its utility and ability to switch moves. However, it cuts into Tapu Lele’s bulk drastically and therefore makes it worse at doing its job as a pivot, leaving it generally much worse than Pixie Plate.</p> ",
    "sets": [
      {
        "name": "Bulky Taunt",
        "description": "<ul> <li> <p>Psychic is Tapu Lele’s main STAB option, giving it a strong attack boosted by Psychic Terrain to threaten the likes of Urshifu-R and Amoonguss. Psyshock can be run to deal with Calm Mind Tapu Fini better but at the cost of some Base Power.</p> </li> <li> <p>Moonblast which hits Pokemon such as Zygarde and Kyurem-B harder and helps deal with foes Psychic can't hit neutrally like Incineroar. In conjunction with Psychic, it gives Tapu Lele the ability to hit every type at least neutrally besides Steel.</p> </li> <li> <p>Taunt shuts down Trick Room setters such as Diancie and Porygon2 and stops redirection from Pokemon such as Blastoise. Furthermore, it also allows Tapu Lele to stop Pokemon such as Calm Mind Tapu Fini from setting up on it. Tapu Lele can also use Taunt on Tailwind setters such as Mew and Zapdos, but this is difficult, as they generally outspeed it.</p> </li> <li> <p>Protect keeps Tapu Lele safe while its partner uses speed control, and it also allows Tapu Lele to scout moves.</p> </li> <li> <p>The given EV spread allows Tapu Lele to outspeed Choice Band Zygarde and avoid the 2HKO from Thousand Arrows with a Sitrus Berry.</p> </li> <li> <p>A Sitrus Berry is used to increase Tapu Lele’s longevity during matches, letting it last long enough to provide Terrain support. An Eject Button can also be used to preserve it while also maintaining momentum, allowing it to bring in its teammates with ease. If running Eject Button, Tapu Lele should shift its Defense EVs to Special Attack.</p> </li> <li> <p>Tapu Lele can take on a more offensive role with Pixie Plate, using a spread of 212 HP / 144 SpA / 152 Spe and a Timid nature to OHKO Zygarde. However, this makes Tapu Lele less effective at pivoting in and out.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Tapu Fini": {
    "overview": "<p>Tapu Fini is an important asset of balance teams thanks to its defensive and offensive utility, which stems from its typing and ability. A Water / Fairy typing lets it easily take attacks from the likes of Heatran, Urshifu-R, and Volcanion, especially when considering its great natural bulk, which also allows it to take neutral attacks from the likes of Zygarde and Dragapult relatively well. In return, it can threaten the aforementioned Pokemon back with its STAB moves, giving it offensive utility as well. Misty Surge allows Tapu Fini to exert Terrain control, with Misty Terrain removing priority from Rillaboom's Grassy Glide and turning Necrozma's Expanding Force into a single target move. Misty Terrain also has the benefit of blocking Amoonguss's Spore and weakening Dragon-type moves from the likes of Dragapult and Kommo-o. Tapu Fini can take advantage of Pokemon it walls with a Calm Mind set, which lets it function as a dangerous wincon while maintaining its defensive and offensive utility. It can also take on a support role and utilize its great support movepool with moves like Heal Pulse and Nature's Madness. The Calm Mind set can take a bit to get going and relies on Leftovers to keep it healthy, while the support set is mostly passive. Further, both sets have a tendency to be and share a considerable weakness to one of the best Pokemon in the tier, Rillaboom. It threatens Tapu Fini with its powerful STAB Grassy Glide and resets Misty Terrain. Tapu Fini also has a tendency to get overwhelmed and chipped while it switches in to take resisted hits and change the terrain, a problem made worse by its lack of instant recovery. Pokemon that can handle Rillaboom make excellent partners for Tapu Fini. Kyurem-B and Incineroar in particular are great partners, as Tapu Fini beats Urshifu-R for them as well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Specs and Choice Scarf can both exert immediate offensive pressure as well as potentially pick up a surprise KO. Trick is an option on both sets and can cripple its switch-ins like Rillaboom. However, both items are generally less consistent than the Calm Mind or Support sets. Muddy Water is an option over Nature's Madness on the support set to hit Heatran, but it has a lower overall damage output.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>Muddy Water and Moonblast allow Tapu Fini to effectively exert offensive pressure the opposing team. Moonblast is a single target move that hits many threats like Urshifu-R, Zygarde, and Kommo-o, while Muddy Water hits both targets and nails Pokemon that aren't too threatened by Moonblast like Heatran and Incineroar. However, both need boosts to become significantly threatening.</p> </li> <li> <p>Tapu Fini can set up Calm Mind on a wide variety of Pokemon, like Volcanion and the aforementioned Urshifu-R and Heatran. Keep in mind that this will force a lot of attention on Tapu Fini, which can open up a hole for a teammate.</p> </li> <li> <p>Protect allows Tapu Fini to accumulate Leftovers recovery safely, along with bringing in a teammate that can better support it, such as a Fake Out user like Zeraora.</p> </li> <li> <p>Leftovers recovery is greatly appreciated, as it helps Tapu Fini switch in more, and it's likely to spend several turns on the field attacking or using Calm Mind.</p> </li> <li> <p>Summoning Misty Terrain makes it considerably harder to prevent Tapu Fini from setting up via moves like Toxic.</p> </li> <li> <p>144 Special Attack EVs let Tapu Fini always OHKO Urshifu-R with Moonblast. The Defense EVs and Bold nature allow it to take more physical hits, which Calm Mind doesn't help against, such as Pokemon like Zygarde and Fusion Bolt Kyurem-B. EVs can be shifted from Defense to Speed to outspeed certain threats with speed control.</p> </li> </ul> "
      },
      {
        "name": "Support",
        "description": "<ul> <li> <p>Moonblast hits Fairy-weak Pokemon like Zygarde and Urshifu-R and can claim KOs against foes weakened by Nature's Madness.</p> </li> <li> <p>Nature's Madness weakens foes for Tapu Fini or its teammates to pick off.</p> </li> <li> <p>Icy Wind allows Tapu Fini to provide speed control for its teammates along with punishing and forcing switches.</p> </li> <li> <p>Heal Pulse is particularly useful for Pokemon that lack recovery and and take a lot of hits like defensive Kyurem-B, along with setup sweepers like Dragon Dance Zygarde.</p> </li> <li> <p>Taunt is also an option over ether Icy Wind or Heal Pulse, as it can prevent Trick Room, Tailwind, and other status moves from Pokemon slower than Tapu Fini. However, it can be useless against faster Tailwind setters like Zapdos.</p> </li> <li> <p>Sitrus Berry's burst recovery is preferred over Leftovers's gradual recovery due to this set's tendency to repeatedly switch in-and-out of battle</p> </li> <li> <p>Summoning Misty Terrain is great against Pokemon that rely on Terrain, like Necrozma and Rillaboom.</p> </li> <li> <p>144 Special Attack EVs allow Tapu Fini to always OHKO Urshifu-R with Moonblast. The Defense EVs and Bold nature are used to increase its lower Defense. EVs can be shifted to outspeed certain threats in Tailwind or after Icy Wind.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Nihilego": {
    "overview": "<p>While Nihilego shines in DOU as a menacing attacker that can quickly turn a game in its favor, it is particularly held back by its one-dimensional nature, lacking coverage, and vulnerability to the tier's various physical threats. Its access to the combination of STAB-boosted Meteor Beam and Beast Boost make it quite dangerous, with the ability to completely dominate the game off a single KO being its main selling point. This is supplemented by its impressive offensive stats, as its base 127 Special Attack is quite high and its Speed allows it to outrun a large swathe of the metagame, only beaten by the likes of Zeraora, Dragapult, and Naganadel. Outside of purely attacking, though, Nihilego can only really utilize its astounding Special Defense to soak some special hits in a pinch; it otherwise offers no team-wide utility whatsoever, which means it's completely useless in opposing speed control, as it wouldn't be able to safely attack. Its paper-thin Defense leaves it prey to the likes of Rillaboom, Urshifu-R, and Zeraora, and it's also completely walled by Zygarde and Metagross. Fake Out and redirection support from Incineroar, Rillaboom, Blastoise, and Amoonguss can be handy in giving it the space to operate, with Incineroar also having Intimidate to hide Nihilego's low Defense, while the likes of Dragapult, Kyurem-B, and Genesect help in making up for Nihilego's lacking coverage. Most glaring, though, is how predictable Nihilego can be, as it practically needs Meteor Beam to be truly threatening, and its set is also essentially telegraphed due to needing both reliable STAB moves and having a lacking movepool.</p> ",
    "comments": "<h1>Other Options</h1> <p>Stealth Rock and Toxic Spikes, used either with Meteor Beam or on a dedicated set with Focus Sash, can give Nihilego the utility it needs to shine in cases where it can't offensively, though they would also exacerbate Nihilego's already existing flaws as an attacker. Dazzling Gleam can be an option to hit Zygarde and Kommo-o as well as for having a spread move to clean with if sufficient Special Attack boosts are accumulated, though neither of Nihilego's STAB moves are easy to give up. Sludge Wave can be used similarly and is a bit stronger due to STAB, but it hitting teammates makes it tough to use effectively.</p> ",
    "sets": [
      {
        "name": "Meteor Beam Attacker",
        "description": "<ul> <li> <p>Meteor Beam, in conjunction with Power Herb, gives Nihilego insane burst damage with a Special Attack boost.</p> </li> <li> <p>Beast Boost lets Nihilego snowball through teams, pairing well with Meteor Beam, as Nihilego instantly gets to +2 Special Attack if it KOes.</p> </li> <li> <p>Power Gem and Sludge Bomb are reliable STAB attacks typically used to get KOs post-Meteor Beam, with Sludge Bomb being the default move for its higher power and Power Gem being handy for hitting Steel-types such as Heatran and Genesect as well as targets such as Kyurem-B, Zapdos, and Volcanion super effectively.</p> </li> <li> <p>Protect gives Nihilego safety as its team maneuvers around current positions, and it can be particularly handy in stalling out field conditions such as Tailwind and Trick Room.</p> </li> <li> <p>The given EV investment maximizes Nihilego's offensive presence, with the Speed in particular letting it get the jump on base 100 Speed Pokemon such as Zapdos and Mew as well as Urshifu-R.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Celesteela": {
    "overview": "<p>Celesteela is a formidable offensive threat due to its favorable matchups against metagame threats such as Rillaboom and Landorus, setting up in front of them and quickly snowballing through weakened teams with Beast Boost and Meteor Beam boosts. Partnering it with solid redirection and Fake Out support helps it set up without being overwhelmed. Celesteela works best on offensive team structures that can provide this support, with solid Tailwind support from Pokemon like Naganadel and Mew letting it outspeed threats such as Naganadel and Zeraora. However, Celesteela really requires good speed control to function to its fullest, as it can be easily revenge killed by the myriad of faster threats in the tier such as Heatran and Zeraora, although the former needs prior chip damage and the latter needs to be healthy. Furthermore, if it lacks Fake Out or redirection support, it can be stopped easily before it sets up due to its low initial damage output.</p> ",
    "comments": "<h1>Other Options</h1> <p>Wide Guard is a solid option that allows Celesteela to perform a more supportive role but sacrifices some sweeping efficiency. Flamethrower can also be run to threaten Metagross and opposing Celesteela immediately, although Air Slash and Flash Cannon are generally superior. A bulkier spread with 252 HP EVs is an option for slower teams that use Trick Room alongside it; however, it loses the ability to hit Incineroar and Volcanion before they attack outside of Trick Room. A defensive set with Leech Seed can be used as well, making Celesteela a solid defensive check to the likes of Rillaboom and Metagross, and while it is less viable, it still has decent matchups across the board.</p> ",
    "sets": [{"name": "Meteor Beam", "description": "<ul> <li> <p>Meteor Beam with Power Herb gives Celesteela a one-time way to nail would-be checks such as Incineroar, Zapdos, and Volcanion, as well as providing a Special Attack boost, which lets it snowball more easily with Beast Boost.</p> </li> <li> <p>Air Slash is Celesteela's main STAB move, and it allows it to effectively check the likes of Rillaboom, Urshifu-R, and Amoonguss.</p> </li> <li> <p>Flash Cannon nails Pokemon that can switch into Air Slash such as Diancie and Kyurem-B.</p> </li> <li> <p>Protect provides a turn of safety for Celesteela, allowing another teammate to attack or set up Tailwind or Trick Room for it. Protect also lets it stall out opposing Tailwind and Trick Room turns.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 531334, "username": "dnagerbdager"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Necrozma": {
    "overview": "<p>Necrozma is one of the most powerful attackers in Doubles OU, threatening to 2HKO the entire tier with Expanding Force under Psychic Terrain at +1, which it can easily get to with the combination of Power Herb and Meteor Beam. With many common Psychic-resistant and -immune Pokemon in the metagame such as Heatran and Incineroar folding to its coverage options like Earth Power and Meteor Beam, Necrozma can easily plow through teams once if it gets the necessary support. It fits best of on hyper offense builds where the goal is to win games in as few turns as possible. Psychic Terrain support, which powers up Expanding Force and blocks priority, is critical to Necrozma's success, making either Tapu Lele or Indeedee-F mandatory teammates. Pokemon that can break through Steel- and Dark-types such as Urshifu-R and Heatran also make excellent partners, enabling Necrozma to keep using Expanding Force without worry. While Necrozma can end games once it gets going, it can be slowed down in multiple ways. Rillaboom and Tapu Fini can reliably switch in multiple times and reset Terrain, which heavily weakens Expanding Force, with the former also threatening Necrozma with Fake Out. Opposing Tailwind setters such as Zapdos and Mew also work well against it, as well as other forms of speed control users such as Icy Wind Kyurem-B and Trick Room Diancie. Additionally, while Pokemon such as Incineroar, Heatran, and Metagross must fear Necrozma's coverage, they can all switch into Expanding Force and slow it down.</p> ",
    "comments": "<h1>Other Options</h1> <p>Trick Room gives Necrozma a way to control its own Speed and decide the pace of the game, but it comes at the cost of valuable coverage. Weakness Policy is another way to boost that has a bigger payoff, but it's less reliable and Necrozma loses the one-time Meteor Beam nuke. Heat Wave is an alternative coverage option that's better against Genesect, but it is generally inferior to Earth Power's ability to hit Heatran and Incineroar. Stealth Rock can be used to secure chip damage on incoming foes, notably Incineroar, but it can be a momentum loss to uses and Necrozma prefers using its coverage to take down its foes.</p> ",
    "sets": [
      {
        "name": "Power Herb",
        "description": "<ul> <li> <p>Expanding Force is a decimating STAB attack under Psychic Terrain that is able to 2HKO almost the entire tier after a Special Attack boost, including threats such as Assault Vest Kyurem-B. It also has the added benefit of hitting both foes when Psychic Terrain is up, though keep in mind that it's much weaker if a different Terrain is active.</p> </li> <li> <p>Meteor Beam, in conjunction with Power Herb, boosts Necrozma's Special Attack by one stage and cripples common switch-ins such as Assault Vest Kyurem-B and Incineroar.</p> </li> <li> <p>Earth Power hits many common Psychic-resistant and -immune Pokemon such as Heatran, Metagross, and Incineroar for super effective damage.</p> </li> <li> <p>Protect shields Necrozma for a turn, letting its partner reposition, set Tailwind, or target one of Necrozma's checks. It can also be used for stalling out adverse field conditions, such as Trick Room and opposing Tailwind.</p> </li> <li> <p>Prism Armor helps keep Necrozma safe from Dragapult and Genesect's STAB moves. Notably, Necrozma can always take a Choice Specs-boosted Shadow Ball from Dragapult at full health.</p> </li> <li> <p>A Modest nature is preferred to maximize Necrozma's damage output, but Timid can be used to always outspeed Heatran. A Quiet nature, along with shifting EVs from Speed to HP and lowering its Speed IVs, can be used if Necrozma is on a Trick Room-oriented build.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Naganadel": {
    "overview": "<p>Naganadel's high base Speed and strong typing make it one of the best Tailwind setters in the tier, allowing it to get the first Tailwind off frequently, and letting it match up favorably against common Pokemon such as Rillaboom, Tapu Fini, and Urshifu-R. Naganadel's Tailwind utility is appreciated on many structures, but shines brightest on offensive archetypes where teammates such as Heatran, Zygarde, and Urshifu-R can get an immediate Speed boost and start firing off strong attacks. Naganadel appreciates all three of these Pokemon's ability to deal with Heatran and other Steel-types, while in return Naganadel deals with Tapu Fini as well as Rillaboom for the latter two. However, Naganadel is completely useless into Heatran, and its frailty leaves it susceptible to being KOed early, therefore limiting its potential to set up multiple Tailwinds. It also struggles into opposing forms of speed control, especially Trick Room, and usually can't fit Protect in its repertoire due to it wanting all 3 of its attacks and Tailwind. Its inability to fit Protect and bad matchup against opposing speed control expose its poor bulk even more, while also meaning it cannot block the everpresent Fake Out and instead must rely only on its partner keeping it safe. Lastly, Naganadel is heavily prediction reliant as failing to get KOs puts it in danger.</p> ",
    "comments": "<h1>Other Options</h1> <p>Fire Blast can be run over Flamethrower for the extra strength and the ability to 2HKO Amoonguss through Sitrus Berry, but its low accuracy leaves a lot to be desired. Protect can be used over Fire-type coverage or Tailwind to keep Naganadel safe from Fake Out and other attacks, but then it cannot threaten Steel-types or provide speed control. Focus Sash can be used to live any one hit and guarantee the setup of at least one Tailwind, but Naganadel's damage output is significantly reduced without Life Orb.</p> ",
    "sets": [
      {
        "name": "Fast Tailwind",
        "description": "<ul> <li> <p>Draco Meteor threatens common Dragon-types such as Kyurem-B and Zygarde while acting as Naganadel's strongest move against Pokemon it checks such as Urshifu-R, Landorus, and Volcanion. However, the Special Attack drop usually forces it to switch out, as its damage output is no longer as useful.</p> </li> <li> <p>Sludge Bomb covers Rillaboom and Tapu Fini, with the latter being the most common Dragon-immune Pokemon. It's also helpful for picking up KOs on weakened targets without dropping Naganadel's Special Attack.</p> </li> <li> <p>Flamethrower targets Steel-types such as Genesect and Metagross that Naganadel's STAB moves are useless against, but it notably cannot touch Heatran.</p> </li> <li> <p>As one of the fastest Tailwind setters, Naganadel can quickly give a Speed boost to its teammates to gain the upper hand.</p> </li> <li> <p>Maximum Special Attack and Speed investment and a Life Orb allows Naganadel to hit as hard and fast as possible. A Timid nature allows Naganadel to get a Speed boost from Beast Boost and always Speed tie with other Naganadel, while a Modest nature gives it a threatening Special Attack boost and allows it to deal as much damage as possible.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}, {"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Zeraora": {
    "overview": "<p>Zeraora uses its speed and access to valuable utility moves to support a variety of different teamstyles, from balance to hyper offense, by acting as a solid offensive pivot. Fake Out is always valuable, and Zeraora also can threaten the Ghost-types like Dragapult that are immune to it with a faster Knock Off. Being the fastest Pokemon in the tier is one of Zeraora's most helpful traits, especially benefitting Fake Out and Taunt. Zeraora's bulk isn't stellar, but when combined with an immunity to Electric, two resistances, and only one weakness, it's generally sufficient to pivot throughout the battle. Grass-types like Rillaboom, Amoonguss, and Tsareena can cause problems for Zeraora, so Fire-types like Heatran and Volcarona are solid teammates, and they also appreciate Zeraora's ability to threaten Water-type foes. Zeraora also needs help handling Zygarde and other Ground-type enemies, so Kyurem-B is another solid option, and it also helps with those Grass-types. Although Zeraora's utility moves can be valuable in many situations, if one of those situations isn't currently happening, then it can be a bit of a momentum sink, struggling to scare many popular threats.</p> ",
    "comments": "<h1>Other Options</h1> <p>Coaching offers external setup to physical attackers like Zygarde, Shift Gear Genesect, and Dragon Dance Kyurem-B, but it must replace Taunt or Knock Off, and not every team can afford to make the switch. If Zeraora drops Knock Off, then it can also shift the 252 Attack EVs to HP for a significant boost in bulk, since investing so heavily in Attack for only one significant attack is inefficient. An Assault Vest allows Zeraora to sit in on foes it is meant to beat like Tapu Fini and Zapdos a bit more reliably; however, this forces it to drop Taunt in favor of another attacking move, which typically is one of three options. Volt Switch offers fast pivoting that can also deal okay damage, Electroweb gives fast, spread speed control to support middling-Speed wallbreakers, and Snarl expands upon the special bulk provided by Assault Vest while annoying special attackers. For a more offensive take on Zeraora, it can use a Life Orb and drop Fake Out in favor of Protect. Close Combat often finds its way onto such sets, as it hits Kyurem-B super effectively as well as Incineroar and Porygon2. Using an Adamant nature is a different way to get a bit more power, notably increasing the chance to KO Urshifu-R with Plasma Fists. This misses out on outrunning Dragapult and Spectrier and Speed tying with opposing Zeraora, but teams with adequate answers for these foes can get away with it. Equipping a Magnet guarantees the Plasma Fists OHKO on Urshifu-R without changing the makeup of Zeraora's standard set, but this is the only benchmark it enables.</p> ",
    "sets": [
      {
        "name": "Fast Utility",
        "description": "<ul> <li> <p>The fastest Fake Out in the tier is very important to Zeraora's role, providing its teammates free turns and some time to improve field positioning.</p> </li> <li> <p>Plasma Fists is a reliable STAB move, hitting threats that Zeraora is meant to check like Tapu Fini and Urshifu-R.</p> </li> <li> <p>Knock Off provides coverage to hit Ghost-types, which is notable, as Dragapult outspeeds every other unboosted presence in the metagame. It also removes key items like Kyurem-B's Assault Vest and Porygon2's Eviolite.</p> </li> <li> <p>A fast Taunt most notably prevents foes like Mew and Naganadel from setting Tailwind, though it also has utility in shutting down redirectors like Amoonguss and Trick Room setters like Diancie and Porygon2.</p> </li> <li> <p>With a Sitrus Berry equipped, Zeraora is able to fulfill its role for a bit longer in the game, and the boost in recovery is also beneficial for taking a multi-hit attack like Surging Strikes.</p> </li> <li> <p>Zeraora's Speed is maximized to outrun Dragapult and tie with opposing Zeraora and its Fake Out. 252 Attack EVs give it the greatest chance to OHKO Urshifu-R and generally pick off the foes it can outspeed.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 232101, "username": "talkingtree"}]}
  },
  "Rillaboom": {
    "overview": "<p>Rillaboom is among the best pivots in the metagame thanks to its excellent ability, useful utility moves, and strong priority STAB attack. Grassy Surge lets Rillaboom set Grassy Terrain on switch-in, providing passive healing for teammates and slowing down threats that benefit from Psychic Terrain such as Necrozma. Grassy Glide is given priority and boosted by Grassy Terrain, letting Rillaboom soft check a wide variety of threats regardless of Speed, such as boosted Dragon Dance Zygarde and Diancie under Trick Room, as well as picking off any Pokemon low on health. Rillaboom works well on a variety of team archetypes thanks to the sheer utility it provides. For example, structures that rely on Trick Room or setup appreciate Rillaboom’s ability to create safe turns through the use of Fake Out, while the latter also appreciates Grassy Terrain's passive healing to keep wincons healthy. Volcanion and Urshifu-R synergize well with Rillaboom, as they remove Fire-types and Kyurem-B, respectively, and in return, Rillaboom checks Water-types such as Tapu Fini. Rillaboom is not without faults, though; its Grass typing leaves it with a plethora of weaknesses that are exposed by common Pokemon such as Kyurem-B and Genesect, and it can be tricky to use alongside other Terrain setters. It's also worn down quickly by pivoting in and out, especially with entry hazards up, as it typically has no recovery besides Grassy Terrain and doesn't carry Protect, leaving it open to being attacked every turn and susceptible to double targets.</p> ",
    "comments": "<h1>Other Options</h1> <p>Superpower is an option over Wood Hammer to hit Heatran and Kyurem-B, while High Horsepower secures an OHKO on Heatran and is better against Metagross, but it leaves Rillaboom toothless against Kyurem-B. If using High Horsepower, Rillaboom can also run a more offensive spread with a Jolly nature to always outspeed Heatran. Knock Off is also available to hit Dragapult, but all three alternatives mean missing out on your most powerful STAB attack. Eject Button is an option to switch in, set Terrain, and immediately pivot out to a strong attacker on more offensive teams if keeping up momentum is preferred over longevity. A Choice Band set can deal massive damage, notably securing the OHKO on Urshifu-R with Grassy Glide under Grassy Terrain, but it loses out on Fake Out and overall support value. Miracle Seed is another option to make sure Rillaboom can OHKO Urshifu-R while retaining Fake Out, but it's significantly weaker than Choice Band and generally inferior to Assault Vest and Eject Button besides from that one benchmark.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<ul> <li> <p>Fake Out puts one of the opponent’s Pokemon out of commission for a turn, giving your partner a safe turn to create progress.</p> </li> <li> <p>Grassy Glide is a strong priority STAB move under Grassy Terrain that hits Water- and Rock-types such as Tapu Fini, Urshifu-R, and Diancie for super effective damage. It also can pick off faster threats such as Urshifu-R and Nihilego as well as Diancie under Trick Room.</p> </li> <li> <p>Wood Hammer is Rillaboom's strongest attack that is most useful for hitting slower, bulkier targets such as Tapu Fini, Blastoise, and Diancie outside of Trick Room. It also threatens an OHKO on Zeraora and a 2HKO on Zygarde under Grassy Terrain, which Grassy Glide can't do.</p> </li> <li> <p>U-turn helps make Rillaboom an excellent pivot by being able to switch out of disadvantageous positions and bring in a Pokemon with a better matchup. It also does a solid amount of damage to opposing Rillaboom.</p> </li> <li> <p>The given EVs, combined with Assault Vest, let Rillaboom survive a +1 Sludge Bomb from Nihilego, Charcoal-boosted Eruption from Heatran, and +1 U-turn from Genesect. The rest of the EVs are dumped into Attack to hit as hard as possible. EVs can be shifted from Defense to Speed to outspeed threats such as Zeraora under Tailwind.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Hatterene": {"sets": [{"name": "Offensive Trick Room"}]},
  "Indeedee-F": {
    "overview": "<p>Boasting both Psychic Surge and Follow Me, Indeedee-F stands out as one of the cornerstones of building the Psychic spam archetype in DOU, as it is the best at purely enabling Necrozma by allowing it to devastate opposing teams with Psychic Terrain-boosted Expanding Forces behind redirection support. While Indeedee-F faces competition from Tapu Lele, its access to Follow Me essentially lets it act as the hyper offensive archetype's defensive backbone, as it leaves Necrozma and other attackers such as Heatran and Urshifu-R safe to wreak havoc on the opposing team. If Necrozma is not on the same team, though, then Indeedee-F is generally a poor pick; as a redirector, Indeedee-F pales in comparison to Blastoise and Amoonguss with regard to defensive stats, typing, and utility, and as a Psychic Terrain setter, Tapu Lele's monstrous strength and overall better stats will be more useful. Even within Psychic spam teams, Indeedee-F's lack of offensive presence compared to Tapu Lele can be quite exploitable, with Tapu Lele's ability to check Dragon-types such as Dragapult and Kyurem-B possibly being missed, and Indeedee-F's redirection niche is still replaceable by Amoonguss. While the combination of Follow Me and Psychic Surge may seem enticing, it is typically not worthwhile to deal with Indeedee-F's flaws if not further taking advantage of Psychic Terrain with an attacker such as Necrozma.</p> ",
    "comments": "<h1>Other Options</h1> <p>Sitrus Berry can be run in order to give Indeedee-F more longevity and allow it to play more like a traditional redirector, though even then its bulk would still be lacking and the aggressive teams that Indeedee-F usually fits on will miss the safe switch from Eject Button. Safety Goggles can be useful for safely redirecting Amoonguss's Spore, but this would highlight its lack of bulk even more and Psychic spam teams are good at offensively checking Amoonguss anyway. Heal Pulse can be used over Helping Hand in order to give its attacking partners more longevity, though again this would be antithetical to how Indeedee-F usually plays.</p> ",
    "sets": [
      {
        "name": "Terrain Setter",
        "description": "<ul> <li> <p>Expanding Force is boosted by Psychic Terrain and is Indeedee-F's best attacking option, though one has to be wary of opposing Terrains being set up.</p> </li> <li> <p>Follow Me keeps Indeedee-F's partners mostly safe from its foes, handy for letting them freely attack or set up.</p> </li> <li> <p>Helping Hand gives strong attacking partners such as Necrozma and Heatran a quick boost to their damage, helping them get KOs more easily.</p> </li> <li> <p>Protect lets Indeedee-F safely stall out a turn, handy as a waiting move as its team positions around it as well as for letting a turn of opposing Tailwind or Trick Room pass.</p> </li> <li> <p>Eject Button lets Indeedee-F quickly pivot in and out as it sets Psychic Terrain for its team, handy for maintaining control of Terrain as well as for quickly enabling a strong attacker such as Heatran or Urshifu-R through a safe switch in.</p> </li> <li> <p>Maximum Defense investment lets Indeedee-F match up better against the metagame's many physical attackers, namely Urshifu-R, Kyurem-B, and Metagross; in particular, it's quite nifty for facing Rillaboom,as Indeedee-F will often need to switch in against it to contest Terrain.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294304, "username": "emma"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Dracovish": {"sets": [{"name": "Choiced Attacker"}]},
  "Dragapult": {
    "overview": "<p>Dragapult is useful on a wide variety of teams for its great typing and Speed. Its Dragon / Ghost typing lets it switch into Pokemon like Urshifu-R, and Heatran. It's also a great offensive typing, as Ghost-type moves are virtually unresisted in the metagame bar Pokemon like Incineroar and Porygon2, and Dragon-type moves hit many important targets like Kyurem-B and Zygarde. Its Speed allows it to outpace the vast majority of the unboosted metagame. These qualities allow it to handle many great Pokemon like Urshifu-R, and Zygarde, along with other Pokemon like Rillaboom and Necrozma. Its Choice Specs set can apply pressure instantly, while conversely, its Dragon Dance set can end a game outright if given the freedom to set up. However, Dragapult is heavily relies on its Speed, and its lack of bulk can give it trouble with speed control and switching in. Both sets can also feel underwhelming at times, as the Choice Specs set has to make use of Dragapult's mere base 100 Special Attack, while the Dragon Dance set is reliant on getting boosts to become threatening and lacks reliable STAB moves. As a result, it can struggle to break bulkier Pokemon like Porygon2 and Amoonguss, and it falls easily to faster attackers like Choice Scarf Genesect and Dragon Dance-boosted Kyurem-B. Dragapult also loathes Tapu Fini, as Misty Terrain severely limits Dragapult's offensive pressure, and Tapu Fini can OHKO it after minimal chip. This weakness to Tapu Fini makes Rillaboom a prime partner for the drake; Rillaboom can change the Terrain and provide openings for Dragapult to set up via Fake Out. Blastoise is a good partner for the Dragon Dance set, as it packs both Fake Out and Follow Me. Diancie is also another good partner for Dragapult, as it handles Kyurem-B and Incineroar well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Dragon Fang is an option over Life Orb on the Dragon Dance set, as it boosts Dragapult's main source of damage without the recoil, but is significantly weaker. Thunderbolt can be run in the fourth slot to hit Water- and Flying-types like Tapu Fini and Galarian Moltres. While it does 2HKO Tapu Fini, it is generally an inferior option to U-turn or Hydro Pump.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<ul> <li> <p>Dragapult's dual STAB moves provide great neutral coverage against the majority of the tier, if not hitting them super effectively. Draco Meteor in particular is used for high burst damage and hitting bulky Dragon types like Zygarde and Kyurem-B, while Shadow Ball deals more consistent damage and is minimally resisted in the tier, making it a safer STAB move to lock into if Dragapult needs to attack consecutively.</p> </li> <li> <p>Flamethrower allows Dragapult to hit Grass- and Steel- types such as Rillaboom, Amoonguss, and Genesect. Genesect is OHKOed, while Rillaboom and Amoonguss are dented by it. Fire Blast has less than perfect accuracy, but it guarantees a 2HKO on Rillaboom and Amoonguss.</p> </li> <li> <p>U-turn can allow Dragapult to keep momentum, as its great Speed and ability to force switch-ins often grant it solid opportunities to rotate out, while Hydro Pump allows Dragapult to hit Heatran, Incineroar, and Diancie.</p> </li> <li> <p>Life Orb is also an option over Choice Specs, giving Dragapult the option to switch moves, but reducing its overall longevity and cutting into its power noticeably. If running Life Orb, the fourth slot should go to Protect.</p> </li> <li> <p>Infiltrator allows Dragapult to attack Volcanion and Zygarde hiding behind Substitute.</p> </li> <li> <p>A Timid nature is needed to Speed tie against other Dragapult, while Modest is also an option to hit considerably harder, and guarantees the 2HKO on Heatran with Shadow Ball.</p> </li> </ul> "
      },
      {
        "name": "Dragon Dance",
        "description": "<ul> <li> <p>Dragon Claw is the more consistent option for single target damage, while Dragon Darts hits both targets and can potentially deal more single target damage thanks to its smart targeting, causing it to avoid targeting a Fairy-type or Pokemon using Protect, which makes both hits attack a singular target.</p> </li> <li> <p>Phantom Force is Dragapult's most powerful Ghost-type STAB move that allows it to dodge incoming attacks and break Protect for itself and its allies, creating some valuable openings. However, its charging turn leaves the opponent open to appropriately responding to the incoming attack, such as with Normal-type switch-ins like Porygon2 and Indeedee or attacks after Phantom Force for the KO.</p> </li> <li> <p>Dragon Dance brings Dragapult's Attack to impressive levels, making it an immensely dangerous sweeping threat after a single boost. At +1, Dragapult OHKOes Zygarde with Dragon Claw, and it can OHKO Urshifu-R with Phantom Force at +2. The extra Speed can also help in certain scenarios, such as outspeeding Zygarde in Tailwind after a boost.</p> </li> <li> <p>Protect allows Dragapult to avoid potentially dangerous moves and gives it a better opportunity to set up by allowing allies such as Blastoise and Rillaboom to come to its aid with Follow Me and Fake Out.</p> </li> <li> <p>Life Orb boosts Dragapult's power significantly, allowing it to KO foes like bulky Necrozma with Phantom Force and Defensive Kyurem-B with Dragon Claw, at +1 Attack.</p> </li> <li> <p>Clear Body's primary function is to block Intimidate, but it can also come in handy for some stat-lowering moves such as Parting Shot and Icy Wind.</p> </li> <li> <p>A Jolly nature is required to outspeed Zygarde in Tailwind at +1.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbdager"}]}
  },
  "Urshifu-Rapid-Strike": {
    "overview": "<p>Urshifu-R is one of the most threatening offensive Pokemon in Doubles, possessing a monstrous base 130 Attack, a great offensive typing, and the unique ability to bypass most traditional defensive counterplay such as Intimidate, Protect, and Defense boosting thanks to the combination of Unseen Fist ignoring protection and Surging Strikes's guaranteed critical hits. This makes it one of the strongest candidates to answer metagame staples like Kyurem-B, Incineroar, Porygon2, and Diancie. Due to Urshifu-R's excellent offensive prowess, defensive answers are limited to mainly just Amoonguss and Tapu Fini, two Pokemon that resist all of its STAB attacks. Instead, it is often answered offensively by the likes of Rillaboom, Dragapult, and Necrozma. Urshifu-R is held back by a fairly middling Speed tier, meaning pairing it with speed control and priority will be very helpful. As such, Zapdos and Naganadel are excellent partners, providing Tailwind support and a way to match up well against Water-types. Other examples of good teammates include Tapu Lele and Indeedee-F for providing Psychic Terrain, which keeps Urshifu-R safe from priority moves like Fake Out and Grassy Glide, and Heatran, which is excellent for hitting Grass-types.</p> ",
    "comments": "<h1>Other Options</h1> <p>Urshifu-R can outrun the entire unboosted metagame with a Choice Scarf; however, this comes at a significant decrease in power, as it loses its ability to OHKO Porygon2 and Genesect. An Adamant nature can be used to deal even more damage, but runs the risk of being outsped by Jolly Kyurem-B, Timid Tapu Lele, and opposing Urshifu-R.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Surging Strikes is incredibly free to use thanks to its guaranteed critical hits bypassing any form of damage reduction, like Intimidate. It can easily pick up OHKOs on Incineroar, Landorus-T, and Diancie.</p> </li> <li> <p>Close Combat is Urshifu-R's strongest attack, possessing the rare ability to OHKO Kyurem-B and Porygon2. Even neutral foes like Rillaboom and Volcanion will take a large amount of damage from it.</p> </li> <li> <p>Ice Punch is useful for securing the OHKO on Zygarde and Dragapult, while Aqua Jet is reliable priority that can pick off foes with low Defense like Volcarona and Nihilego.</p> </li> <li> <p>U-turn is a decently hard-hitting move that allows Urshifu-R to pivot out of unfavorable situations. This can be especially useful for the opposing Grass-types it baits in, letting it switch out to proper checks. Protect is important on Life Orb sets for keeping Urshifu-R safe from the Grass- and Electric-type attacks that it often baits in.</p> </li> <li> <p>A Choice Band and maxed out Attack EVs allow Urshifu-R to make the most out of its offensive potential, notably scoring the OHKO on physically defensive Porygon2, which Life Orb sets cannot. However, Life Orb allows Urshifu-R to switch moves and run Protect, but comes at the cost of recoil. 252 Speed EVs and a Jolly nature let Urshifu-R outspeed base 95s like Kyurem-B and Tapu Lele.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 188164, "username": "MajorBowman"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zee"}]}
  },
  "Spectrier": {
    "overview": "<p>Once Calyrex's loyal steed, Spectrier now haunts the metagame as a fast, strong special attacker that can snowball with Grim Neigh. It has great base Special Attack and Speed stats, OHKOing targets like Mew and outrunning threats such as Landorus and Naganadel, along with a STAB Shadow Ball for excellent neutral coverage. After a Nasty Plot boost, Spectrier is difficult to slow down due to Grim Neigh making it stronger with each KO, along with a Fake Out immunity. Tools that help Spectrier set up, such as Fake Out and redirection from Pokemon like Zeraora, Blastoise, and Amoonguss, are excellent, as is Urshifu-R, which beats the Dark- and Normal-types, like Incineroar and Porygon2, that are immune or resistant to Shadow Ball. However, without a boost, Spectrier can struggle to break past bulkier Pokemon like Tapu Fini and Incineroar, the latter of which doesn't fear Shadow Ball. Shadow Ball is also its only good attack, which exacerbates the issue of needing a boost to snowball and be optimally effective. Spectrier also has issues setting up a Nasty Plot, due to the being frail enough to fear spread damage even when given redirection, and Life Orb recoil leaves it vulnerable to priority moves such as Rillaboom's Grassy Glide. To top it all off, Spectrier relies heavily on its Speed, which makes it weak to opposing Tailwind or Trick Room, while also being threatened by the two Pokemon naturally faster than it, Zeraora and Dragapult. Trick Room teams in particular are a huge headache due to Porygon2, one of the best Spectrier answers, being a mainstay on those teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Taunt allows Spectrier to prevent speed control or recovery moves from Pokemon slower than it, primarily Porygon2. Will-O-Wisp cripples physical attackers like Zygarde and Urshifu-R, indirectly increasing its physical bulk. Snarl helps Spectrier and its teammates by weakening attackers like Heatran and Volcanion. However, to use any of these moves, Spectrier must give up Mud Shot, rendering it unable to hit Incineroar. Hyper Beam is an option that can hit both Incineroar and Porygon2, but it has the devastating drawback of making Spectrier unable to act for a turn. Spell Tag can be used to boost Shadow Ball without Life Orb's recoil, but it is weaker than Life Orb, notably losing the chance to OHKO Mew, and doesn't boost Mud Shot.</p> ",
    "sets": [{"name": "Nasty Plot", "description": "<ul> <li> <p>Shadow Ball is a strong STAB move that possesses excellent neutral coverage and hits Ghost-weak targets like Mew and Metagross hard.</p> </li> <li> <p>Mud Shot allows Spectrier to KO Incineroar, one of the few Pokemon that resists Shadow Ball, after a Nasty Plot and a bit of chip.</p> </li> <li> <p>Nasty Plot makes Spectrier a massive sweeping threat, lets it muscle through bulkier Pokemon, and secures OHKOs to snowball with Grim Neigh.</p> </li> <li> <p>Protect keeps Spectrier safe while another teammate, such as a Fake Out user, comes in to support it, while also being able to stall out field conditions like Trick Room or Tailwind.</p> </li> <li> <p>Life Orb significantly helps Spectrier pick up KOs, like the OHKO on Mew.</p> </li> <li> <p>A Timid nature lets Spectrier always outspeed Naganadel, while Modest guarantees the OHKO on Mew and the 2HKO on 252 HP Celesteela.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 215000, "username": "Memoric"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbdager"}]}
  }
}