{
  "Chansey": {
    "sets": [
      {
        "name": "Imposter",
        "description": "<p>Imposter Chansey's ability to transform into opposing Pokemon offers all kinds of utility on balance and stall. Chansey's mere presence can deter attempts at setup, as Chansey is able to to switch in on setup sweepers, beat them with its superior bulk, and sweep the rest of their team. Chansey can scout the moveset and ability of whatever it transforms into, making it excellent for identifying opposing wincons. When transformed, Chansey gains 20 PP that it can freely expend, making it useful for PP stalling in longer games. In addition to scaring out offensive threats, Chansey is capable of copying a foe's utility moves, such as Spikes and Rapid Spin. Eviolite makes Chansey even bulkier, enhancing its anti-offense capabilities. Shed Shell prevents Chansey from being trapped by Anchor Shot and subsequently PP stalled. Toxic Orb lets Chansey exploit Poison Heal Pokemon, such as Xerneas and Regigigas, as the recovery increases Chansey's longevity and lets it beat them 1v1. Chansey's moves and nature aren't relevant when transformed, meaning Chansey can dedicate its entire moveset to Imposter-proofing teammates. Chansey's immense Special bulk lets it Imposter-proof Special attackers like Xerneas and Eternatus, running moves that shut down or make progress against opposing Imposter Pokemon, such as Topsy Turvy and Nuzzle.</p> <p>Passive Magic Bounce and Prankster Pokemon, such as Giratina and Registeel, appreciate Chansey's ability to deter setup. Chansey's scouting abilities greatly benefit setup sweepers and entry hazard setters like Spikes Regigigas and Nasty Plot Eternatus, as they need to know when they're free to set up and set hazards. Chansey appreciates entry hazard support, as they wear down the opponent's Imposter-proofers, allowing Chansey to better threaten reverse sweeps. Chansey tends to get worn down quickly, as the offensive threats it transforms into will often lack significant recovery. As such, slow pivots like Zygarde-C and Kyogre and entry hazard removers like Pixilate Xerneas are useful for limiting the amount of unnecessary damage Chansey takes. Opponents will often try to counter Chansey with Knock Off or Nuzzle, so Poison Heal users, which can switch into these with little risk, are greatly appreciated.</p> "
      },
      {"name": "Choice Scarf Imposter"},
      {"name": "Fur Coat"},
      {"name": "Prankster SubPass"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 225453, "username": "MAMP"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 546606, "username": "Tanny89k"}]}
  },
  "Mewtwo": {"sets": [{"name": "Choice Specs Psychic Surge"}, {"name": "Nasty Plot Psychic Surge"}, {"name": "Poison Heal"}]},
  "Umbreon": {"sets": [{"name": "Poison Heal"}]},
  "Blissey": {"sets": [{"name": "Imposter"}, {"name": "Choice Scarf Imposter"}]},
  "Suicune": {"sets": [{"name": "Defensive"}]},
  "Lugia": {"sets": [{"name": "Aerilate"}]},
  "Ho-Oh": {
    "sets": [
      {
        "name": "Desolate Land",
        "description": "<p>Desolate Land grants Ho-Oh a tremendous damage boost to V-create and provides a valuable immunity to Water that helps it check Palkia and Fishious Rend users, on top of its normal role as an offensive Xerneas check and blanket special wall. The combination of V-create and a paralysis move threatens almost the entirety of the metagame, with sun-boosted V-create significantly damaging or OHKOing key targets like Regigigas and Xerneas and Glare or Nuzzle punishing foes that can stomach a V-create, such as Eternatus, Flash Fire and Primordial Sea Zamazenta-C, and Imposter users. Since Ho-Oh forces numerous switches and threatens out common spinners like Pixilate Xerneas and Magearna and Aerilate Celesteela, it is a great Spikes setter. Physical walls like Giratina and Zygarde-C form a strong defensive core with Ho-Oh and help to check threats like Regigigas and Groudon that Ho-Oh may struggle against. Poison Heal Regigigas can help this set by switching into Nuzzle and weakening checks like Giratina with boosted Wicked Blow and Glacial Lance. Pixilate Xerneas is also a good partner, as Xerneas threatens physically defensive Pokemon and Fur Coat users like Giratina and Palkia. Ho-Oh's ability to directly threaten Steel-types means Xerneas can take advantage of this by luring them in for Ho-Oh and using Volt Switch.</p> "
      },
      {
        "name": "Magic Bounce",
        "description": "<p>Magic Bounce Ho-Oh is a non-passive wall that frustrates common passive Pokemon by blocking their status moves. Magic Bounce crucially hinders Xerneas and Steel-types by blocking Strength Sap and bouncing back entry hazards. Despite the lack of immediate power, Fire Lash is usually considered over V-create for its higher PP and ability to force out bulky Pokemon after a few Defense drops. Other moves like Anchor Shot, Nuzzle, and Spectral Thief are chosen to punish Imposter, cripple Pokemon like Flash Fire and Primordial Sea Zamazenta-C, and allow Ho-Oh to more reliably check Poison Heal Xerneas. Ho-Oh's ability to check Xerneas, switch into special attackers like Eternatus reasonably well, and punish status and entry hazards from Steel-types makes it a good partner for Pokemon like Giratina and Zygarde-C in defensive teams, as they can handle physical threats like Regigigas and offensive Zamazenta-C. Common Pokemon like Regigigas and Eternatus make good teammates, as they can set up and beat Flash Fire and Primordial Sea foes. Wallbreakers, such as Kyurem-B, Kyurem-W, and Zekrom, (comma) can forgo Heavy-Duty Boots and healing moves for a boosting item or a coverage move thanks to Ho-Oh's Magic Bounce discouraging entry hazards and improving their longevity.</p> "
      },
      {"name": "Magic Guard Life Orb"},
      {"name": "Aerilate Rapid Spin"},
      {"name": "Prankster"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 225453, "username": "MAMP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 434601, "username": "Lotus"}]}
  },
  "Registeel": {"sets": [{"name": "Prankster"}, {"name": "Fire Immune Wall"}]},
  "Kyogre": {"sets": [{"name": "Regenvest"}, {"name": "Utility Poison Heal"}, {"name": "Quiver Dance Poison Heal"}, {"name": "Prankster"}]},
  "Groudon": {
    "sets": [
      {"name": "Mold Breaker + Spikes", "description": "<p>Preventing Groudon from setting up Spikes is a nightmare, as it ignores Magic Bounce with Mold Breaker and threatens huge swathes of the tier with Thousand Arrows and Glare. Strength Sap keeps Groudon healthy throughout the game, which allows it to repeatedly switch into foes such as Zamazenta-C and defensive Ho-Oh sets. Zekrom, Magearna, and other slow wallbreakers love Groudon's efficiency at spreading Spikes and paralysis; with Spikes up and foes such as Xerneas and Palkia paralyzed, they're far more difficult to switch into or force out. While Imposter Chansey must risk being crippled by paralysis to switch in against Groudon, it's still important to ensure that Chansey cannot freely set up Spikes when it does. Poison Heal Xerneas with Rapid Spin and Strength Sap helps out with this, as it can clear away Spikes, is unaffected by Glare, and can easily heal off damage from Thousand Arrows.</p> "},
      {
        "name": "Choice Band",
        "description": "<p>When holding a Choice Band, Groudon is a frightening wallbreaker that can easily blast holes in defensive cores, so long as it can get onto the field against the defensive Eternatus sets and Steel-types that it forces out. While it's less reliable than Thousand Arrows, the extra power from Precipice Blades enables Groudon to OHKO Zamazenta-C if it opts for Mold Breaker, or to take down Xerneas and Regigigas after a layer of Spikes on Adaptability sets. Trick neutralizes common physical walls such as Giratina and Fur Coat Lunala, and Glacial Lance is another strong option against Giratina that also knocks out Zygarde-C. U-turn can be used to pivot out from physical walls into a specially offensive teammate such as Dialga or Pixilate Xerneas, and these Pokemon can create opportunities for Groudon by inviting in easy prey like Zamazenta-C and Solgaleo. Poison Heal Regigigas sets with Swords Dance and Wicked Blow can weaken Giratina, Zygarde-C, and Fur Coat Lunala so they can no longer switch into Groudon's attacks. Against Imposter users, a teammate with solid physical bulk and reliable recovery can handle the imposter's attacks. Strength Sap Xerneas or a defensive Giratina set can perform this role effectively.</p> "
      },
      {"name": "Prankster"},
      {"name": "Ice Scales"},
      {"name": "Fur Coat"},
      {"name": "Poison Heal Setup"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 225453, "username": "MAMP"}]}
  },
  "Rayquaza": {"sets": [{"name": "Mixed Aerilate"}, {"name": "Triage"}, {"name": "Choice Specs Aerilate"}]},
  "Garchomp": {"sets": [{"name": "Choice Band"}]},
  "Dialga": {"sets": [{"name": "RegenVest"}, {"name": "Doom Desire"}, {"name": "Defensive Trapper"}, {"name": "Magic Guard Life Orb"}]},
  "Palkia": {"sets": [{"name": "Mixed Adaptability"}, {"name": "Rain Sweeper"}, {"name": "Fur Coat"}]},
  "Heatran": {"sets": [{"name": "RegenVest"}]},
  "Regigigas": {
    "sets": [
      {
        "name": "Spikes Utility",
        "description": "<p>Spikes Regigigas is an excellent support piece. Its high Attack stat and Facade make it a dangerous offensive threat that can 2HKO the majority of the metagame. Spikes offers a consistent way of making progress with entry hazard chip, and Nuzzle or Knock Off cripple enemy hazard control options such as Magic Bounce users or Pixilate Xerneas carrying Rapid Spin. Flip Turn is useful for turning the many slow, passive Magic Bounce users that aren't bothered about Nuzzle or Knock Off into free momentum. Regigigas has excellent synergy with Poison Heal, which not only grants it status-boosted STAB Facade, but also lets it use its great bulk and lack of weaknesses to consistently stay healthy without draining momentum with manual recovery and grants it an immunity to crippling status like paralysis. Regigigas has an excellent matchup into Imposter users, as Imposter will lack any recovery and the damage boost to Facade unless it carries Toxic Orb, compromising its effectiveness against other Pokemon. Magic Bounce Zygarde-C is an excellent teammate, as it can Imposter-Proof thanks to its immunity to Nuzzle, massive bulk, and ability to reflect Spikes. Xerneas, particularly Pixilate, can form a very effective offensive core which can combine raw damage output, entry hazard stacking, entry hazard clearing, and pivoting into just 2 slots - Regigigas is able to cripple the many Steel-types and special walls that Xerneas can struggle to break past, and Xerneas can be brought in on walls that beat Regigigas such as Giratina. Regigigas can also provide entry hazard and paralysis support, which other wallbreakers such as Kyurem-B and Palkia can exploit.</p> "
      },
      {
        "name": "Tough Claws Attacker",
        "description": "<p>Life Orb + Tough Claws Regigigas is an immense wallbreaking and sweeping threat, as it can break down walls early-game or sweep through a weakened team late-game as the situation demands. After Shift Gear, Regigigas is able to OHKO virtually everything in the tier that isn't designed specifically to counter it, meaning that Regigigas can easily dismantle teams if it gets just one free turn. V-create is used due to its stellar Base Power, which is enough to OHKO most targets even through Fur Coat, such as Zamazenta-C. Similarly, Wicked Blow hits Psychic-type Fur Coat users for heavy damage, as well as Giratina, and the combination of Fire and Dark-type coverage dispatches every common Fur Coat user. Glacial Lance is an alternative option that, despite not being boosted by Tough Claws, can be used to OHKO Zygarde-C while still threatening Giratina. Regigigas appreciates teammates such as Palkia, Xerneas and Kyurem-B that can take advantage of the opened holes to cause even further damage, and scouting tools such as Imposter users can aid in safely setting Regigigas up without risking debilitating burns or paralysis. Imposter-proofing this set can be difficult, as the damage output is still high even without Life Orb, so will often require Zygarde-C, Primordial Sea Zamazenta-C, or Fur Coat Lunala to be safe.</p> "
      },
      {"name": "Poison Heal Dragon Dance + Spikes"},
      {"name": "Poison Heal Swords Dance"},
      {"name": "Poison Heal Dragon Dance Sweeper"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 225453, "username": "MAMP"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}]}
  },
  "Giratina": {
    "sets": [
      {
        "name": "Magic Bounce",
        "description": "<p>Magic Bounce Giratina provides entry hazard control and blocks Strength Sap. Teleport, when combined with minimum Speed investment, allows Giratina to almost always move last and safely put its teammates in advantageous situations. Spectral Thief prevents Giratina from becoming setup fodder. Knock Off makes permanent progress and scares out Imposter users, allowing Giratina to Teleport out without risking a Speed tie. Entrainment and Core Enforcer scare out Poison Heal and -ate users, Entrainment functioning against Xerneas and slower Pokemon and Core Enforcer providing a valuable STAB move that also ignores Magic Bounce. Nuzzle spreads paralysis for your team's wallbreakers to capitalize on. Minimum Speed investment allows Giratina to underspeed opposing pivots. Giratina has excellent synergy with Poison Heal users, as it provides valuable entry hazard control and a safe avenue into activating their Toxic Orbs via Teleport. Xerneas is a particularly strong teammate for Giratina, since Xerneas Imposter-proofs Giratina. Strong wallbreakers, such as Kyurem-B and Spectrier, appreciate Teleport's free entry and Magic Bounce helping to limit entry hazard chip. Giratina struggles most with Pixilate Xerneas, Eternatus, and Kyurem-B, as they can either 2HKO or OHKO Giratina, so teammates such as Ice Scales Zamazenta-C and Primordial Sea Steel-types can help check these threats.</p> "
      },
      {"name": "Poison Heal"},
      {"name": "Prankster"},
      {"name": "Defensive"},
      {"name": "Worry Seed Poison Heal"},
      {"name": "Final Gambit"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 225453, "username": "MAMP"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 546606, "username": "Tanny89k"}]}
  },
  "Giratina-Origin": {"sets": [{"name": "Fur Coat"}]},
  "Cresselia": {"sets": [{"name": "Prankster Utility"}, {"name": "Tower of Power (Prankster Dual Screens)"}]},
  "Darmanitan": {"sets": [{"name": "Regenvest"}, {"name": "Prankster"}, {"name": "Poison Heal"}]},
  "Ferrothorn": {"sets": [{"name": "Defensive"}]},
  "Reshiram": {"sets": [{"name": "Magic Guard Life Orb"}, {"name": "Desolate Land"}]},
  "Zekrom": {"sets": [{"name": "Magic Guard"}, {"name": "Adaptability Wallbreaker"}, {"name": "Shift Gear"}]},
  "Landorus-Therian": {"sets": [{"name": "Choice Band"}]},
  "Kyurem-Black": {"sets": [{"name": "Choice Band"}, {"name": "Setup Sweeper"}]},
  "Kyurem-White": {"sets": [{"name": "Choice Specs Refrigerate"}]},
  "Aegislash": {"sets": [{"name": "Defensive"}, {"name": "Prankster"}]},
  "Xerneas": {"sets": [{"name": "Offensive Poison Heal"}, {"name": "Pixilate Boots + Spin"}, {"name": "Pixilate Wallbreaker"}, {"name": "Poison Heal Rapid Spin"}]},
  "Yveltal": {"sets": [{"name": "Triage"}, {"name": "Aerilate Rapid Spin"}]},
  "Zygarde": {"sets": [{"name": "RegenVest"}, {"name": "Defensive Trapper"}, {"name": "Poison Heal"}, {"name": "Wish Passer"}, {"name": "Final Gambit"}]},
  "Incineroar": {"sets": [{"name": "Prankster"}]},
  "Golisopod": {"sets": [{"name": "Poison Heal"}, {"name": "Prankster"}]},
  "Tapu Fini": {"sets": [{"name": "Poison Heal Pivot"}, {"name": "Prankster"}]},
  "Solgaleo": {"sets": [{"name": "Fur Coat"}]},
  "Lunala": {
    "sets": [
      {
        "name": "Fur Coat Wall",
        "description": "<p>Fur Coat Lunala is an excellent wall that can check the majority of physical attackers in the tier, with its typing leaving very few weaknesses and Fur Coat allowing it to easily withstand powerful attacks like V-create and Glacial Lance. Nuzzle provides speed control that can threaten out powerful attackers like Eternatus and Zacian, while Glare still paralyses Groudon and Zygarde-C. Hex is a strong STAB attack that is unresisted by most of the tier and has good synergy with Nuzzle's paralysis to clean up weakened teams. Core Enforcer negates Regigigas's Poison Heal and forces it to switch out, which, when combined with Lunala's immunity to Normal allows it to reliably switch in and scare out Regigigas lacking Wicked Blow. Entrainment improves the matchup against Xerneas and makes Lunala harder to pivot around. Recover provides a reliable recovery option which keeps Lunala in good enough condition to check threats over longer games. Lunala's glaring weakness to Dark-type attacks, most commonly Wicked Blow and Knock Off from Regigigas, makes Zygarde-C a good teammate, as the pair has the physical bulk to withstand threats carrying coverage for the other. Lunala's speed control and ability to scare out offensive threats can be exploited by slower wallbreakers such as Kyurem-B and Groudon. Lunala can self-Imposter-proof to an extent, as a boosted Hex will always 2HKO Eviolite Imposter Chansey, but Ground-type teammates can help negate the Imposter user's Nuzzle to prevent boosting Hex's power.</p> "
      },
      {
        "name": "No Retreat Sweeper",
        "description": "<p>Lunala's typing and great Special Attack allow it to fully exploit No Retreat - Psychic offers an excellent STAB Stored Power and Ghost makes Lunala immune to trapping, allowing it to safely switch out of Spectral Thiefs and attempt multiple sweeps. With Simple, No Retreat not only offers a massive bulk increase, but also raises Stored Power's Base Power to 220, which when combined with a +2 Special Attack boost is sufficient to OHKO the majority of the metagame. Final Gambit is used alongside Lunala's high HP to heavily damage Prankster users like Groudon and Ho-Oh who look to remove Lunala's boosts. 0 Special Defense EVs, 5 Special Defense IVs, and a Rash nature allow Lunala to always OHKO Imposter Eviolite Chansey with Astral Barrage, whereas using maximum Special Defense allows set up in front of most special attackers. Sweepers like Shift Gear Kyurem-B and Simple Eternatus synergize well with Lunala, as they can exploit Prankster users being absent or heavily injured due to Final Gambit, giving them an easier time cleaning up a team. Pixilate Xerneas makes a good teammate, as it can pressure foes that Lunala is unable to break past such as Yveltal and Ice Scales users like Zamazenta-C. Yveltal also partners well with Lunala as it can safely Imposter-proof with Spectral Thief and has STAB Knock Off to remove Assault Vest, which allows certain targets like Kyogre and Melmetal to survive boosted Stored Power and Astral Barrage, respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 225453, "username": "MAMP"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}]}
  },
  "Pheromosa": {"sets": [{"name": "Magic Guard"}]},
  "Celesteela": {"sets": [{"name": "Bulky Triage"}, {"name": "Offensive Triage"}, {"name": "Primordial Sea"}, {"name": "Prankster"}, {"name": "Aerilate"}]},
  "Kartana": {"sets": [{"name": "Choice Band"}]},
  "Necrozma-Dusk-Mane": {"sets": [{"name": "Simple Shift Gear"}]},
  "Necrozma-Dawn-Wings": {"sets": [{"name": "No Retreat"}]},
  "Magearna": {"sets": [{"name": "Pixilate"}, {"name": "Fire Immunity"}]},
  "Blacephalon": {"sets": [{"name": "Life Orb Adaptability"}, {"name": "Choice Specs Adaptability"}, {"name": "Magic Guard"}]},
  "Melmetal": {"sets": [{"name": "Prankster"}]},
  "Barraskewda": {"sets": [{"name": "Choice Band"}]},
  "Dragapult": {"sets": [{"name": "Normalize"}]},
  "Zacian": {"sets": [{"name": "Tough Claws"}, {"name": "Poison Heal"}]},
  "Zamazenta": {"sets": [{"name": "Magic Guard"}, {"name": "Tough Claws"}, {"name": "Poison Heal"}]},
  "Eternatus": {
    "sets": [
      {
        "name": "Nasty Plot + 3 Attacks",
        "description": "<p>Eternatus's great bulk and Speed tier make it an excellent Nasty Plot sweeper that has the capacity to set up multiple times in a match to soften defensive cores in the early-game and clean up weakened teams towards the late-game. Simple maximizes Eternatus's power after setting up, but it could opt instead for Mold Breaker, which gives it a better matchup against Ice Scales users and Steel-types with Flash Fire. Alternatively, Adaptability boasts greater initial power, which makes Eternatus less reliant on setting up and improves its ability to check Palkia and Xerneas. Blue Flare is a strong coverage option against Steel-types like Zamazenta-C and Magearna. Earth Power is a notably weaker but more accurate alternative that hits Steel-types with Flash Fire or Primordial Sea. Pixilate Xerneas is a great partner for this set, as it appreciates Eternatus softening up the special walls and Steel-types that it struggles with. Additionally, Poison Heal Regigigas loves to switch in on Spectral Thief and Nuzzle aimed at Eternatus. Imposter Chansey can scout opposing teams to identify opportunities for Eternatus to set up and has the massive special bulk necessary to handle Imposter users copying Eternatus. Zamazenta-C or Magearna with Flash Fire or Primordial Sea can Imposter-proof Blue Flare variants.</p> "
      },
      {
        "name": "Regenerator + Spikes",
        "description": "<p>Regenerator gives Eternatus the longevity to switch in repeatedly and make progress with Spikes, powerful Dragon-type attacks, and Sludge Bomb poisonings. Dragon Energy is generally the Dragon STAB move of choice, as Regenerator keeps Eternatus at high HP. Draco Meteor is an alternative that offers less raw power but allows Eternatus to be played more aggressively, as its damage output is not lowered by taking hits. Volt Switch helps Eternatus chip down its checks, retain momentum, and escape from Anchor Shot, particularly against Zamazenta-C. Blue Flare is a less flexible, but more immediate method of breaking through Steel-types. Trick can be used alongside Black Sludge to cripple Magic Bounce users and special walls that would limit Eternatus's ability to make progress. Wallbreakers such as Pixilate Xerneas and Kyurem-B make for good teammates, as they are adept at forcing switches to maximize the effectiveness of Eternatus's Spikes. Eternatus's Regenerator can be exploited by Imposter Chansey for free recovery, so Pokemon like Magic Bounce Zamazenta-C or Pixilate Rapid Spin Magearna that prevent Imposter from doing too much harm make good partners. Teammates like Desolate Land Ho-Oh and RegenVest Kyogre can lure in Imposter users to Nuzzle them or remove their Eviolite with Knock Off, making it tougher for them to safely switch in against Eternatus later.</p> "
      },
      {"name": "Taunt 3 Attacks"},
      {"name": "Ice Scales Wall"},
      {"name": "Recover + Dragon Energy"},
      {"name": "Choice Specs"},
      {"name": "Flare Boost"},
      {"name": "Corrosion"},
      {"name": "Sniper"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 466276, "username": "Dragonillis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 225453, "username": "MAMP"}]}
  },
  "Regieleki": {"sets": [{"name": "Mixed Galvanize Cleaner"}]},
  "Spectrier": {"sets": [{"name": "Choice Specs"}, {"name": "Simple Plot"}]},
  "Calyrex-Ice": {"sets": [{"name": "Poison Heal Shift Gear"}, {"name": "Mold Breaker Shift Gear"}, {"name": "Magic Guard Shift Gear"}, {"name": "Refrigerate Rapid Spin"}, {"name": "Regenvest"}]}
}