{
  "Nidoqueen": {"sets": [{"name": "Sheer Force (SpA)"}]},
  "Nidoking": {
    "comments": "<h1>Other Options</h1> <p>Nidoking can receive Speed, which allows it to act as a cleaner, but comes at the expense of significant damage output.</p> <h1>Checks and Counters</h1> <p><strong>Neutral Walls</strong>: Bulky Ubers such as Lunala are capable of surviving any hit from Nidoking and forcing it out, while Pokemon like Rotom-W are able to force out Nidoking effectively.</p> <p><strong>Revenge Killers: Mewtwo, Zygarde-10%, Weavile, and and other fast offensive Pokemon are all able to revenge kill Nidoking very consistently.</p> ",
    "sets": [
      {
        "name": "Sheer Force Attacker (Special Attack)",
        "description": "<p>Nidoking is a powerful wallbreaker that is able to take advantage of its wide movepool and access to Sheer Force. With a god's Special Attack, it is able to break through common special walls like Heatran, Necrozma-DM, and Tapu Fini. Life Orb enhances Nidoking's damage output even further without drawback. Sludge Wave is its most powerful attack against neutral targets while also dealing super effective damage to common specially defensive Pokemon such as Tapu Fini and Clefable. Earth Power hits Heatran and Necrozma-DM for heavy damage, although specially defensive variants of Necrozma-DM are not OHKOed and can deal significant damage back. Ice Beam can be used to OHKO Landorus-T and is Nidoking's best option to hit Giratina, while Fire Blast OHKOes Ferrothorn and deals heavy damage or OHKOes Corviknight. Flamethrower can be used to ensure you are not PP stalled by Corviknight. Thunderbolt hits Ho-Oh, Kyogre, and Slowking for super effective damage, although Substitute can be used to ease predictions. Maximum Speed EVs and a Timid nature make sure Nidoking can outspeed non-max speed Rotom-W and Ho-Oh, although a Modest nature can be used to increase damage output even further while still outpacing Necrozma-DM without a boosting nature.</p> <p>Nidoking needs a god with high Special Attack, like Mewtwo, Pheromosa, or Rayquaza, in order to function properly. Its ability to open up holes in the opposing team's defensive core makes it a great partner for fast cleaners like Kartana and Tapu Koko. Nidoking has trouble breaking through Gastrodon, Lunala, and Ho-Oh if not carrying Thunderbolt. Kartana can help improve these matchups with its ability to threaten Gastrodon and Lunala and by removing Ho-Oh's Heavy-Duty Boots with Knock Off. When using Substitute, Nidoking has to sacrifice coverage and oftentimes the ability to beat certain Pokemon, so teammates that can help with this lack of coverage are appreciated. Due to its relatively low bulk and lack of recovery, sturdy defensive partners like Corviknight, Landorus-T, and Rotom-W are appreciated. All three of these offer pivoting support, allowing Nidoking to enter the field safely. Entry hazard setters like Ferrothorn and Heatran also make good teammates, accumulating chip damage on potential checks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "DuckeryDoodle"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Clefable": {"sets": [{"name": "Unaware (HP, Def)"}, {"name": "Magic Guard (HP, Def, SpA)"}]},
  "Ditto": {
    "comments": "<h1>Other Options</h1> <p>Since Ditto needs Choice Scarf to ensure its ability to revenge kill, it shouldn't run any other item.</p> <h1>Checks and Counters</h1> <p><strong>Substitute Sweepers</strong>: Ditto can't copy foes behind a Substitute, completely failing to threaten them.</p> <p><strong>Choice Scarf Users</strong>: Pokemon with Choice Scarf force a coinflip against Ditto, making it less reliable.</p> <p><strong>Bulky Setup Pokemon with Recovery</strong>: Ditto struggles to revenge kill bulky foes like Iron Defense Skarmory and Calm Mind Kyogre without critical hits.</p> <p><strong>Item Removal: Without Choice Scarf, Ditto risks losing the Speed tie against Pokemon it's supposed to check.</p> ",
    "sets": [
      {
        "name": "Revenge Killer (Any)",
        "description": "<p>Ditto is an effective revenge killer in the Godly Gift metagame thanks to its unique ability in Imposter, which, when combined with a Choice Scarf, allows it to outspeed any Pokemon without Choice Scarf or Unburden. Transformation copies donated stats, allowing Ditto to still outspeed Speed receivers and hit as hard as Attack receivers. Imposter's also useful against stall teams by effectively giving infinite PP and copying recovery moves. Ditto prefers having its Choice Scarf removed against stall teams to switch moves and maximize its PP stall capabilities. 252 HP EVs boost the only stat Ditto retains after Imposter activates, while 252 Special Attack EVs and a Quiet nature boost its Future Sight after transforming into a Pokemon like Slowking.</p> <p>Ditto almost exclusively finds its place on stall teams to handle offensive setup threats that its teammates struggle to handle. It struggles to switch in directly against most foes, so slow pivot moves make for great support. Examples include Teleport from Slowbro or Slowking and U-turn from Corviknight. Entry hazards prevent Ditto from switching in repeatedly, so teammates that can reliably remove them such as Mandibuzz and Ho-Oh are appreciated. Unaware users like Pyukumuku, Quagsire, and Clefable or Clear Smog users like Gastrodon and Amoonguss can handle bulky setup Pokemon with recovery, such as Calm Mind Galarian Slowking and Bulk Up Buzzwole, which outlast Ditto one-on-one. An ally with Regenerator, such as the aforementioned Slowbro or Ho-Oh, in tandem with Ditto can outstall defensive Regenerator Pokemon, effectively forcing them out. A defensive god with a high HP stat like Giratina theoretically complements Ditto well, but Ditto is able to go in any teamslot, especially the Attack and Special Attack slots, which stall teams don't benefit from much anyway. While the HP increase is beneficial, another bulky Pokemon can often take better advantage of it, usually Skarmory.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Skarmory": {
    "comments": "<h1>Other Options</h1> <p>Skarmory has a wide range of other status options available. Toxic allows it to punish switch-ins directly and rack up even more residual damage. Skarmory can also set Stealth Rock, but the limited distribution of Spikes makes Skarmory's access to that move more valuable. Taunt is an option to prevent setup and Defog, but Skarmory's low Speed makes it an unreliable option. Skarmory can also forgo Body Press or Brave Bird to run four utility moves, but this makes it exceedingly passive. Skarmory can also run a specially defensive set, but this set is generally outclassed by Corviknight.</p> <h1>Checks and Counters</h1> <p><strong>Fire- and Electric-types: Even physical Fire- and Electric-types like Victini, Zeraora, and Dracozolt can reliably 2HKO Skarmory with their super effective STAB moves.</p> <p><strong>Taunt: Skarmory is vulnerable to Taunt, as it cannot recover, phaze, or set Spikes in front of Taunt users like Yveltal and Alolan Persian.</p> <p><strong>Pivots: Physical pivots like Landorus-T can draw Skarmory in and pivot to a special attacker that forces it out. Especially with Stealth Rock up, this can wear down Skarmory by denying it a chance to recover. Pivots are especially dangerous when paired with Magnezone.</p> <p><strong>Zygarde-10%: Thanks to Thousand Arrows, Zygarde is one of the few physical Ground-types that Skarmory cannot reliably check.</p> <p><strong>Strong Special Attackers: Even with augmented HP, Skarmory has poor special bulk and it can be 2HKOed by most special attackers such as Mewtwo and Nidoking.</p> ",
    "sets": [
      {
        "name": "Physical Wall (HP)",
        "description": "<p>Skarmory is the most reliable Spiker in the metagame and one of the sturdiest physical walls. With its amazing defensive typing, access to reliable recovery, and sky-high Defense, it is the perfect candidate for the HP teamslot. Skarmory is able to comfortably wall most physical threats, including Dhelmise, Bisharp, Excadrill, and Weavile. Body Press works off of its high Defense stat and threatens many of the Pokemon it walls, like Excadrill, but Brave Bird is an option for better neutral coverage and the ability to hit Ghost-types, especially Dhelmise, at the cost of taking recoil. Spikes punishes switch-ins and takes advantage of the free turns Skarmory generates. Iron Defense allows Skarmory to check setup sweepers as well, boosting alongside them while also powering up Body Press; Whirlwind is another option in the last moveslot to phaze set-up foes that Skarmory cannot KO. Rocky Helmet lets Skarmory punish physical attackers even more heavily, especially pivots that can otherwise wear down Skarmory, while Leftovers provides extra recovery. Maximum Defense investment is required to check the high-powered attackers common in Godly Gift and has the nice side effect of also powering up Body Press.</p> <p>Skarmory is a good option for stall and balance teams looking for a catch-all physical wall. Since most Uber Pokemon have a high base HP, Skarmory can work with a wide range of Gods, but some of the best fits are Giratina, Yveltal, and Kyurem-W. Wallbreakers like Victini and Zeraora appreciate Skarmory's Spikes, which help wear down their checks, and its ability to switch into would-be revenge killers that force them out, such as Landorus-T. Since Skarmory's Special Defense is poor, it appreciates bulky teammates like RegenVest Tangrowth and Gastrodon to sponge special hits aimed at it. Due to its Electric and Fire weaknesses, Skarmory is unable to wall Victini, Zeraora, and Dracozolt; reliable switch-ins to these foes like Hippowdown and Quagsire make good partners, especially since Skarmory covers their Grass weaknesses.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 517892, "username": "pannuracotta"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Tyranitar": {"sets": [{"name": "Specially Defensive (SpD)"}, {"name": "Dragon Dance (Spe)"}]},
  "Ho-Oh": {"sets": [{"name": "Physically Defensive"}, {"name": "Choice Band"}]},
  "Kyogre": {"sets": [{"name": "Choice Attacker"}, {"name": "Calm Mind"}]},
  "Garchomp": {
    "comments": "<h1>Other Options</h1> <p>Garchomp can forgo Scale Shot or one of its coverage moves for Stealth Rock. Fire Blast and a Special Attack donation threaten some of its checks like Skarmory and Corviknight better. A defensive set with a Defense donation and Rocky Helmet is possible, but the reliance on Wish and cleric support makes it hard to justify. Life Orb can increase its damage output, although it makes Garchomp more prone to priority moves such as Grassy Glide. Similarly, an Adamant nature leaves it outsped by more offensive Pokemon post-donation, like Tapu Koko and Noivern, but is an option on Scale Shot sets.</p> <h1>Checks and Counters</h1> <p><strong>Physically Defensive Pokemon: Hippowdon, Buzzwole, Skarmory, Tangrowth, and Corviknight can switch in and sponge any attack from Garchomp if it hasn't set up. They can then disrupt its sweep attempt with Whirlwind, Toxic, Stun Spore, or setup of their own.</p> <p><strong>Unaware Walls: Pyukumuku, Clefable, and Quagsire have no trouble handling Garchomp thanks to ignoring its boosts and healing its damage.</p> <p><strong>Ice-type Coverage: Ice Beam from Tyranitar or Ice Punch from Buzzwole can surprise Garchomp and heavily damage it, if not outright OHKO.</p> <p><strong>Faster Pokemon and Priority Users: Pokemon with Choice Scarf like Tapu Lele or a Speed-boosting ability like Arctozolt can outspeed and revenge kill Garchomp before Scale Shot, but only then. Alternatively, priority moves such as Ice Shard from Mamoswine and Weavile and Grassy Glide from Rillaboom can take advantage of the Defense drops from Scale Shot.</p> <p><strong>Status: Garchomp struggles to do its job properly if it is statused. Burn cuts its damage in half, paralysis from Tangrowth or Amoonguss makes it far easier to outspeed and revenge kill, and poison puts its sweep on a timer.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Speed)",
        "description": "<p>Garchomp is a dangerous setup sweeper with a better Speed stat under its belt. Swords Dance allows it to break past sturdy walls such as Corviknight and Landorus-T. Earthquake is strong and reliable, threatening common Pokemon such as Heatran and Galarian Slowking. Scale Shot allows Garchomp to attack while further raising its Speed, making it more difficult to revenge kill. Fire Fang targets Grass-type foes that can handle Earthquake like Tangrowth and Ferrothorn, as well as others like Skarmory and Corviknight, providing perfect neutral coverage alongside Earthquake and Scale Shot. Stone Edge can be used instead to heavily damage Yveltal, Mandibuzz, and Ho-Oh, with the former two heavily threatening Garchomp with Foul Play and the latter with a burn from Sacred Fire. Leftovers provides longevity as Garchomp sets up.</p> <p>Garchomp best fits on bulky offense teams as a late-game sweeper or hyper offense ones as a wallbreaker. A Speed donation from Zamazenta, Pheromosa, or Mewtwo helps it force more offensive Pokemon out such as Zygarde-10% and Noivern, allowing it to get a Swords Dance up more easily. Entry hazards, like Ferrothorn's Spikes and Heatran's Stealth Rock, compound damage throughout the game, putting Pokemon like Buzzwole and Slowking in Garchomp's KO range late-game. Magnezone can trap and eliminate Corviknight and Skarmory, making it a great partner. Special attackers that invite Heatran and Galarian Slowking in, especially those with a pivot move like Tapu Koko or Tornadus-T, are also great options. Pokemon such as Weavile and Kartana work with Garchomp to overwhelm shared checks, allowing one to sweep. The latter can also break past physically defensive Unaware walls like Clefable and Quagsire, which Garchomp can't get past. Dual screens support from the likes of Alolan Ninetales and Grimmsnarl helps Garchomp set up safely and remedies its Defense drop from Scale Shot. Scale Shot's inconsistency can make bulky Flying-type Pokemon, namely Ho-Oh and Landorus-T, troublesome, making teammates that can take advantage of them like Urshifu-R and Cloyster valuable. Psychic Surge from Tapu Lele can prevent priority attacks like Weavile's Ice Shard from exploiting Scale Shot's Defense drop.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 500884, "username": "longhiep341"}]}
  },
  "Weavile": {"sets": [{"name": "Swords Dance (Atk)"}]},
  "Rotom-Heat": {"sets": [{"name": "Pivot (HP)"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot (HP)"}]},
  "Heatran": {"sets": [{"name": "Specially Defensive (HP, Spe)"}, {"name": "Offensive (Spe)"}]},
  "Victini": {
    "comments": "<h1>Other Options</h1> <p>Glaciate can be used for speed control, but forces Victini to give up a coverage move, which makes it overall less threatening. It can run Trick Room so it doesn't have to worry about the Speed drop from V-create, but it is again forced to give up a coverage move and is underwhelming outside of Trick Room.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types</strong>: Fire-types like Heatran and Ho-Oh can switch into V-create and force out Choice Band Victini. Ho-Oh, however, must fear Bolt Strike.</p> <p><strong>Bulky Water-types: Water-types such as Slowking and Slowbro can come in for free if Victini is locked into V-create, but must fear Bolt Strike, which 2HKOes them.</p> <p><strong>Knock Off: Knock Off from defensive Pokemon that Victini may try to switch into like Tangrowth severely hinders Victini's ability to pivot by making it vulnerable to Stealth Rock.</p> <p><strong>Faster Pokemon: Many fast wallbreakers such as Zeraora, Zygarde-10%, Weavile, and Garchomp can outspeed Victini and exploit its mediocre defensive typing. However, Zeraora and Weavile must beware Speed inheritor sets, as they are OHKOed by a faster V-create. Garchomp and Zygarde-10% must also be wary of Glaciate, which can severely dent them and put Victini within range to outspeed and KO them.</p> ",
    "sets": [
      {
        "name": "Wallbreaker (Attack / Speed)",
        "description": "<p>With solid all around stats and great moves at its disposal, Victini is an excellent wallbreaker and pivot. V-create is a very strong STAB move that deals massive damage to all neutral targets. Zen Headbutt is a nice secondary STAB move that hits foes that resist Fire like Volcanion and has good neutral coverage with V-create, and also does not reduce Victini's stats. U-turn allows Victini to keep up momentum after scoring a KO or on a predicted switch to a check like physically defensive Landorus-T. Bolt Strike is a great coverage move to hit Pokemon that resist V-create such as Slowking and Ho-Oh. Heavy-Duty Boots allows Victini to switch in more easily without worry about Stealth Rock and have the freedom to switch moves, but Choice Band deals incredible damage. Speed receivers should run Jolly to make the most of their new Speed stat, and Attack Adamant or Jolly.</p> <p>Victini loves to receive donations from gods with high Attack stats like Necrozma-DM, Rayquaza, and Groudon. Groudon's Drought also increases V-create's damage even further. Alternatively, it can receive Speed from fast gods like Mewtwo, Zamazenta, and Pheromosa. Many setup sweepers appreciate Victini's ability to bring them in with U-turn, such as Rayquaza and Bulk Up Zeraora. Necrozma-DM and Victini synergize well, with Victini checking bulky Steel-types and making great use of Necrozma-DM's Attack stat, and Necrozma-DM switching into defensive Knock Off users that threaten Victini, activating its Weakness Policy and threatening to sweep. Victini is prone to being outsped after using V-create, so Landorus-T, which is immune to Earthquake from Garchomp and walls Zeraora, is a good teammate to handle faster threats. Victini is crippled by Knock Off, so bulky Pokemon that can switch into it like Buzzwole are appreciated. Choice Band sets require excellent entry hazard removal, so reliable Defog users such as Corviknight, Skarmory, Ho-Oh, and Tornadus-T are a necessity. Victini also likes being pivoted in by Pokemon like Landorus-T, Slowking, and Tapu Koko.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "DuckeryDoodle"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 584907, "username": "Wes8888"}]}
  },
  "Excadrill": {"sets": [{"name": "Sand Rush (Atk, Spe)"}, {"name": "Bulky Removal (SpD)"}]},
  "Ferrothorn": {"sets": [{"name": "Specially Defensive (HP)"}]},
  "Bisharp": {
    "comments": "<h1>Other Options</h1> <p>Bisharp can opt to hold a Choice Band to increase its wallbreaking ability, but it is a tough trade-off, as it means Bisharp can no longer run Swords Dance. Beat Up can be run with Choice Band to increase its damage output further. Low Kick threatens Steel-type Pokemon like Cobalion, which otherwise check Bisharp.</p> <h1>Checks and Counters</h1> <p><strong>Fast Offensive Pokemon: Bisharp is threatened by many offensive Pokemon that either Speed tie or outspeed it post-donation, such as Tapu Koko and Zeraora. However, many of these Pokemon are threatened by a boosted Sucker Punch.</p> <p><strong>Fighting-types: Fighting-types such as Zamazenta, Buzzwole, Urshifu-R, and Cobalion resist Bisharp's Dark-type attacks and are not threatened by Iron Head, and they force Bisharp out by threatening a KO.</p> <p><strong>Physical Walls: Physically defensive Pokemon such as Hippowdon, Quagsire, and Corviknight take very little damage from Bisharp's attacks and commonly carry moves such as Body Press or Earthquake that threaten it.</p> <p><strong>Psychic Surge: Psychic Surge removes Bisharp's ability to check faster Pokemon with Sucker Punch, so Pokemon such as Choice Scarf Tapu Lele can threaten it.</p> ",
    "sets": [
      {
        "name": "Swords Dance (Speed)",
        "description": "<p>A Speed donation from its god makes Bisharp a threatening sweeper and wallbreaker. Bisharp's high base Attack and Swords Dance let it threaten 2HKOs against a large portion of the metagame after a boost, including Landorus-T and Corviknight. Its Steel type helps it set up by giving switch-ins against Grass- and Psychic-type moves, which, combined with Defiant, gives it a niche over other common physical wallbreakers such as Kartana. Bisharp's dual STAB moves, Knock Off and Iron Head, hit most Pokemon for at least neutral damage. Sucker Punch gives it strong priority, allowing it to revenge kill weakened. foes. Black Glasses boosts most of Bisharp's attacks, and Life Orb's slight power upgrade isn't usually worth the recoil. However, Life Orb powers up Iron Head, notably guaranteeing a 2HKO against physically defensive Tangrowth. Defiant lets Bisharp benefit from opposing Intimidate users, including the ubiquitous Landorus-T, and also threaten opposing Defoggers and Sticky Webs teams. A Jolly nature and Attack investment are used to make the most of Bisharp's new Speed tier, but an Adamant nature can be used to increase its damage output, especially if receiving a less valuable Speed tier.</p> <p>Bisharp works best when paired with fast gods such as Mewtwo, Pheromosa, and Zamazenta. It appreciates slow pivots such as Slowbro and Corviknight to bring it in safely, as it can be worn down slowly over the course of a game. Although Bisharp is able to threaten Pokemon such as Skarmory and Corviknight, both of them can run Body Press, which OHKOes it. Thus, Bisharp appreciates Pokemon like Magnezone and Nidoking, which threaten Skarmory, Corviknight, and other checks to Bisharp such as Tapu Fini. Other fast offensive Pokemon such as Tapu Koko can force Bisharp out, so it pairs well with strong defensive Pokemon such as Ferrothorn and Landorus-T. These Pokemon can also provide entry hazards, which weaken Bisharp's checks and synergize with Defiant punishing Defoggers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 484270, "username": "beauts"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 525446, "username": "DuckeryDoodle"}]}
  },
  "Volcarona": {"sets": [{"name": "Bulky Quiver Dance (Def)"}, {"name": "Offensive Quiver Dance (Def, SpA)"}]},
  "Tornadus-Therian": {"sets": [{"name": "Defog (HP, Def, SpD)"}, {"name": "Nasty Plot (SpA)"}]},
  "Landorus-Therian": {"sets": [{"name": "Defensive (HP, Def, SpD)"}, {"name": "Offensive (Spe)"}]},
  "Kyurem-White": {
    "comments": "<h1>Other Options</h1> <p>Stone Edge is an option to nail Ho-Oh, and Substitute can be used to ease predictions, but it is usually not worth sacrificing coverage for.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers: Pokemon like Kartana, Bisharp, Tapu Koko, Zamazenta-C, and Tapu Lele are all capable of outspeeding and revenge killing non-Choice Scarf Kyurem-W, and some can revenge kill even that set.</p> <p><strong>Specially Bulky Water-types: When Kyurem is not carrying Freeze-Dry, specially defensive Water-types like Special Defense-receiving Gastrodon and HP-receiving Tapu Fini and Rotom-W can check it.</p> <p><strong>Ho-Oh: Ho-Oh is a special wall that is not hit super effectively by any of Kyurem-W's primary attacks and also donates an incredible Special Defense stat to a team member.</p> ",
    "sets": [
      {
        "name": "Choice Item Attacker",
        "description": "<p>Kyurem-W's power and type coverage make it difficult to switch into reliably. It offers very good stats for an offensive team, including a huge Special Attack and strong HP and Attack, as well as a usable Speed stat. Choice Specs makes Kyurem-W a truly fearsome wallbreaker, while a Choice Scarf allows it to act as a revenge killer. Draco Meteor deals significant damage to anything that does not resist it. Ice Beam hits bulky Grass- and Ground-types like Tangrowth and Landorus-T for heavy damage or an OHKO, and it's Kyurem-W's most consistent STAB attack, while Earth Power nails Heatran and Necrozma-DM. Freeze-Dry is a very useful tool, hitting Water-types like Rotom-W and Gastrodon that would otherwise annoy Kyurem-W. Fusion Flare covers Steel-types like Ferrothorn and Corviknight, as well as being slightly stronger against Necrozma-DM.</p> <p>Kyurem-W often fits best on offensive teams, where receivers like Nidoking and Tapu Koko can take advantage of its monstrous Special Attack stat and physical attackers like Mimikyu and Victini can receive its respectable Attack stat. Kyurem-W's high HP stat supports defensive pivots like Rotom-W and Landorus-T, which can help deliver it onto the field safely while removing Stealth Rock for it. It is also threatened by Fairy- and Fighting-types, so their switch-ins like Heatran, Ferrothorn, and Clefable make great partners for it, and their offensive checks like Kartana and Tapu Lele do as well. Since Kyurem-W is often Choice locked, it is relatively easy to force out. Due to this weakness, reliable defensive switch-ins such as Skarmory and Tangrowth make good teammates.</p> "
      },
      {
        "name": "Special Attacker",
        "description": "<p>Kyurem-W is a strong wallbreaker with great coverage that's difficult to switch into. It offers very strong stats to donate on offensive teams, donating monstrous Special Attack, strong HP and Attack, and respectable Speed. Heavy-Duty Boots especially helps with Kyurem-W's Stealth Rock weakness, while Life Orb gives it a damage increase without limiting its coverage flexibility with Choice Specs. Ice Beam is the primary attack, dealing good damage to neutral targets and heavily damaging Flying- and Grass-types like Yveltal, Rillaboom, and Tangrowth. Freeze-Dry is another option that allows for super effective damage on targets like Gastrodon and Rotom-W. Draco Meteor is its most powerful attack, heavily damaging Pokemon that resist its other attacks, such as Rotom-W. Roost enables Kyurem-W to have some longevity and break through its switch-ins over the course of longer games. Fusion Flare lets it get through Steel-types like Ferrothorn and Corviknight. The combination of Ice- and Fire-type coverage allows Kyurem-W to hit the majority of the tier for at least neutral damage.</p> <p>Kyurem-W fits best on offensive teams, where its teammates can take advantage of its great donated stats. Special attackers like Nidoking and Tapu Lele and physical attackers such as Victini and Zygarde-10% all benefit from its excellent attacking stats. Its strong HP stat benefits defensive Pokemon like Rotom-W and Ferrothorn, which offer pivot and entry hazard support, respectively. Kyurem-W is offensively threatened by Steel- and Fairy-types like Bisharp, Kartana, and Tapu Lele, so Pokemon like Heatran and Ferrothorn make good defensive partners. Kyurem-W appreciates strong entry hazard control from partners like Corviknight and Rotom-W if forgoing Heavy-Duty Boots. Additionally, Kyurem-W is relatively slow and easy to revenge kill with faster threats, so bulky teammates and fast revenge killers like Skarmory and Tapu Koko, respectively, make great partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 525446, "username": "Duckerydoodle"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 539897, "username": "iapt"}]}
  },
  "Yveltal": {"sets": [{"name": "Specially Offensive"}, {"name": "Choice Scarf"}, {"name": "Hone Claws"}]},
  "Mimikyu": {"sets": [{"name": "Swords Dance (Atk, Spe)"}]},
  "Tapu Koko": {"sets": [{"name": "Offensive Pivot (SpA)"}]},
  "Tapu Lele": {"sets": [{"name": "Choice Attacker (Spe)"}]},
  "Buzzwole": {"sets": [{"name": "Defensive (SpD)"}, {"name": "Choice Attacker (Spe)"}]},
  "Kartana": {"sets": [{"name": "Paper Airplane (Spd, Spe)"}, {"name": "Swords Dance (SpD)"}]},
  "Necrozma-Dusk-Mane": {
    "comments": "<h1>Other Options</h1> <p>Necrozma-DM can opt to run physically defensive set with a Rocky Helmet to more reliably wall physical threats like Rillaboom. Photon Geyser can be run over Earthquake on Necrozma-DM’s Dragon Dance set to target specific Pokemon like Nidoqueen, which threaten it with Ground-type moves, but is generally inferior to Earthquake’s coverage. Defensive sets can run Stealth Rock if their team lacks entry hazard setters, but being forced to give up one of its utility moves is usually not worth it.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Ground-types: Physically defensive Ground-types like Landorus-T can switch into Necrozma-DM and threaten it with Earthquake. However, they should be wary of Toxic.</p> <p><strong>Water-types: Bulky Water-types like Slowking, Slowbro, Tapu Fini, and Rotom-W can wall Necrozma-DM, Tapu Fini being notable for blocking Toxic and the rest for being able to burn it. However, Slowking and Slowbro must be wary of Knock Off, and Tapu Fini can be 2HKOed by a +1 Sunsteel Strike from offensive sets.</p> <p><strong>Steel-types: Steel-types like Skarmory, Corviknight, and Ferrothorn resist Sunsteel Strike and take insignificant amounts of damage from Necrozma-DM’s coverage. Skarmory and Corviknight can set up on defensive Necrozma-DM with Bulk Up and Iron Defense, and Ferrothorn can eternally outlast it with a combination of Leech Seed, Protect, and Leftovers.</p> <p><strong>Setup Sweepers: Powerful setup sweepers like Garchomp and Rayquaza can overwhelm even defensive Necrozma-DM with strong super effective moves, threatening all variants with a +2 Earthquake or a +1 V-create, respectively.</p> <p><strong>Ho-Oh: Ho-Oh resists Sunsteel Strike, is immune to Earthquake, and can hit back hard with Sacred Fire. However, Ho-Oh must fear heavy damage from Stone Edge from offensive sets.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Weakness Policy Necrozma-DM is a fearsome wallbreaker and mid- to late-game cleaner. Dragon Dance is an excellent tool to boost Necrozma-DM’s damage while also fixing its subpar Speed tier. Sunsteel Strike is a powerful STAB move that threatens most of the tier at +1. Necrozma-DM’s coverage options help break down common Pokemon that resist it, with Earthquake hitting Heatran and opposing Necrozma-DM and Stone Edge hitting Ho-Oh and Corviknight, which otherwise completely wall it. Prism Armor allows Necrozma-DM to shrug off super effective attacks and activate Weakness Policy more easily, putting it in a position to sweep.</p> <p>Necrozma-DM is best utilized on balance or bulky offense teams as a mid- or late-game cleaner, capable of shredding defensive cores after its checks have been removed. Necrozma-DM's solid defensive stats bolster teammates like Defensive Clefable and Assault Vest Tangrowth immensely, making for some very tough defensive cores. Many Pokemon such as Rillaboom, Victini, and Zeraora appreciate inheriting Necrozma-DM's high Attack stat and its ability to pressure common Pokemon such as Clefable. In turn, these Pokemon threaten the Water- and Steel-types that Necrozma-DM has trouble beating, such as Slowbro, Corviknight, and Skarmory. Necrozma-DM fears fast offensive Pokemon that carry super effective moves such as Rayquaza and Garchomp, whose sheer strength can overwhelm Necrozma-DM. Unaware users like Clefable are useful to ignore setup from these threats, and Pokemon with super effective priority such as Weavile can clean them up after chip.</p> "
      },
      {
        "name": "Specially Defensive",
        "description": "<p>Necrozma-DM's typing, bulk, and access to reliable recovery make it a great specially defensive wall. Sunsteel Strike lets Necrozma-DM still do respectable damage, and Knock Off is a handy utility move to punish common switch-ins like Ho-Oh and remove damage boosting items from wallbreakers. Toxic cripples defensive Pokemon like Rotom-W and Landorus-T, while Thunder Wave cripples switch-ins like Heatran. Earthquake provides good coverage to hit offensive switch-ins like Heatran, but generally isn’t as useful as spreading status. Morning Sun improves Necrozma-DM’s longevity greatly, but must be used sparingly, for it has very low PP. Leftovers is necessary to provide much needed passive recovery.</p> <p>Necrozma-DM can form well-rounded defensive cores with Pokemon such as Tangrowth and Buzzwole, who love to receive Necrozma-DM’s Special Defense stat. Both resist Ground, with the latter resisting Dark as well, which helps cover Necrozma-DM's weaknesses. Rotom-W and Necrozma-DM have good defensive synergy, with Rotom-W providing a resistance to Fire, an immunity to Ground, and sporting great bulk with an HP donation, while Necrozma-DM walls Grass-types such as Rillaboom, as it resists their STAB moves. Necrozma-DM is great at spreading status and removing items from switch-ins like Ho-Oh, which helps teammates that struggle with these threats pick up KOs on the weakened foes. Tapu Koko is a great Special Attack receiver to break past various Water-types that are not threatened by Necrozma-DM. Victini is a good choice to receive Attack and counter Steel-types such Skarmory and Corviknight, which wall Necrozma-DM and turn it into setup fodder, while also hitting Water-types with Bolt Strike.</p> "
      },
      {
        "name": "Bulky Booster",
        "description": "<p>This set combines Necrozma-DM's offensive and defensive utility to create something that can take a hit and hit back hard. Dragon Dance allows Necrozma-DM to become a threatening cleaner versus weakened teams, while Swords Dance is helpful to wallbreak early-game. Sunsteel Strike is an excellent STAB move with great power and good coverage. Knock Off has great neutral coverage with Sunsteel Strike and weakens its checks by removing their items, while Stone Edge hits Flying-types such as Ho-oh and Earthquake hits Steel-types such as Heatran. Morning Sun and Leftovers give Necrozma-DM respectable longevity, but Morning Sun must be rationed so its low PP doesn't run out. Maximum Attack and an Adamant nature maximize damage output while the Speed investment outspeeds base 100 Speed foes after a Dragon Dance.</p> <p>Pokemon such as Buzzwole and Tangrowth are excellent defensive presences if they receive Necrozma-DM's Special Defense stat, as they resist the Ground moves that threaten Necrozma-DM. Victini loves receiving Necrozma-DM's Attack stat and can threaten many Pokemon that Necrozma-DM can't beat like Ferrothorn and Skarmory. Entry hazard setters like Ferrothorn and Landorus-T help Necrozma-DM wear down its checks faster, with the latter being able to pivot it in with U-turn. This set struggles with Ground-types like Garchomp and Landorus-T, so teammates like Rotom-W, Landorus-T, and Skarmory are recommended. Skarmory and Ho-Oh are especially troublesome Pokemon for Necrozma-DM to face, as both resist Sunsteel Strike and wall sets that lack Stone Edge, so Electric-types like Tapu Koko and Zeraora that can handle these threats for Necrozma-DM, while also keeping up momentum with pivot moves, make great partners. Magnezone is also a valuable partner, as it traps and removes Skarmory and Corviknight.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "duckerydoodle"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 541143, "username": "senko"}, {"user_id": 584907, "username": "Wes8888"}]}
  },
  "Zeraora": {
    "comments": "<h1>Other Options</h1> <p>A setup set with Bulk Up can be run to turn Zeraora into a sweeper without much offensive counterplay, but due to its limited coverage, most Ground-types stop it from making progress. A special set with Choice Specs can throw off checks like Hippowdon and Gastrodon, but its lack of coverage overall and utility without Knock Off makes it a worse wallbreaker than Choice Band. Other forms of coverage like Play Rough for Dragon-types like Garchomp and Dracozolt or Grass Knot for Ground-types like Hippowdon and Gastrodon can help beat out some of its most common checks. Taunt Zeraora with donated HP from Gods like Yveltal may be run to improve its longevity as a pivot, but it loses most of its offensive presence and doesn’t last as long without a form of reliable recovery.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Thanks to their immunity to Electric moves and high physical bulk, Ground-type Pokemon such as Hippowdon, Gastrodon, and Landorus-T can easily switch into Zeraora’s coverage and shut down any momentum by blocking Volt Switch. Knock Off can help chip these Pokemon down, but they are generally consistent switch-ins for most of the game.</p> <p><strong>Electric-types: Bulky Electric-types like Rotom-W and Rotom-H can check non-Choice Band Zeraora and cripple it with Will-O-Wisp, although Choice Band can 2HKO them with enough chip damage.</p> <p><strong>Grass-types: Grass-types like Ferrothorn, Tapu Bulu, Tangrowth, and Venusaur switch into Plasma Fists consistently and don't mind its other coverage. Ferrothorn, however, cannot switch into Close Combat from Choice Band, and Tangrowth and Tapu Bulu risk being crippled by Toxic.</p> <p><strong>Dragon-types: Dragon-types like Dialga, Zekrom, and Dracozolt resist Zeraora's Electric moves and don't fear its typical coverage options, making them consistent checks.</p> <p><strong>Faster Pokemon and Priority: Choice Scarf Pokemon like Tapu Lele and Pokemon with priority moves like Rillaboom can take advantage of Zeraora's poor bulk and threaten to OHKO it.</p> ",
    "sets": [
      {
        "name": "Choice Band (Attack)",
        "description": "<p>With one of the highest Speed stats in the game, Zeraora is both an excellent fast revenge killer and, with an Attack donation, a powerful wallbreaker. Plasma Fists allows Zeraora to threaten the prominent defensive Flying- and Water-types in the tier like Corviknight, Skarmory, Ho-Oh, Tapu Fini, and Slowking. It also hits most of the other common walls hard, breaking through Pokemon like Clefable and Heatran, as well as threatening to OHKO slower offensive Pokemon like Tapu Lele. Close Combat provides coverage for Pokemon that resist Plasma Fists like Ferrothorn and Excadrill, preventing them from switching in safely. Knock Off is an overall safe move that removes items from Zeraora’s switch-ins to limit their longevity, most notably Landorus-T and Rotom-H, who rely heavily on their items to consistently check it. Volt Switch creates momentum for the team and brings in a threat to Zeraora’s switch-ins.</p> <p>Zeraora fits best on fast-paced offensive teams with setup sweepers to take advantage of weakened defensive cores Zeraora creates. Most gods with high Attack like Rayquaza, Necrozma-DM, and Kyurem-B are great partners to donate Attack to Zeraora, allowing it to provide immediate wallbreaking power and setup opportunities for the gods. Other setup Pokemon like Garchomp and Weavile also appreciate the pressure Zeraora puts on bulky Water-types. Ground-types like Hippowdon, Gastrodon, and Landorus-T give Zeraora a hard time creating momentum with Volt Switch and can easily take its coverage moves, so Water-types like Rotom-W and Tapu Fini pair well. Dragon-types like Dialga, Zekrom, and Dracozolt prevent Zeraora from constantly using Plasma Fists, so Pokemon like Tapu Lele and Landorus-T support it well. Zeraora gets easily chipped down by entry hazards due to frequent pivoting, so hazard removers like Corviknight, Tapu Fini, and Excadrill are good partners. Entry hazard setters like Skarmory, Mew, and Ferrothorn help Zeraora wear down its checks and allow it to break more easily.</p> "
      },
      {
        "name": "Taunt Pivot (Attack)",
        "description": "<p>With its high Speed and threatening Electric moves, Zeraora pressures common Defoggers and generates momentum for the team. Taunt shuts down common Defoggers like Corviknight and Tapu Fini and prevents Pokemon like Clefable and Ferrothorn from setting entry hazards and healing. Volt Switch lets it keep up the pressure bringing in teammates consistently and has extra longevity due to Heavy-Duty Boots. Plasma Fists keeps Zeraora’s offensive presence and threatens prominent Water-type Pokemon like Tapu Fini and Slowking. Knock Off is useful for taking away Leftovers from its checks like Landorus-T, Gastrodon, and Ferrothorn, and improving the effectiveness of entry hazards by removing Heavy-Duty Boots off of Pokemon like Rotom-Heat, Slowbro, and Ho-Oh. Toxic gives Zeraora a way to punish its consistent checks like Landorus-T and Hippowdon.</p> <p>With immense pressure on Flying-types and Defoggers, Zeraora provides excellent support for entry hazard-stacking teams. Gods with high Attack like Rayquaza, Necrozma-DM, and Kyurem-B allow Zeraora to extert offensive pressure and appreciate its ability to control entry hazards. Spikers like Skarmory and Ferrothorn greatly appreciate Defog prevention and can easily set multiple layers of Spikes. Ground-types like Hippowdon and Landorus-T take very little damage from Zeraora’s attacks, so Water-types like Rotom-W and Tapu Fini are great partners to threaten them. Zeraora also relies much on Heavy-Duty Boots to stay healthy, so Pokemon like Skarmory and Clefable are great partners to switch into Knock Off without much drawback.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 525446, "username": "DuckeryDoodle"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 541143, "username": "senko"}]}
  },
  "Corviknight": {"sets": [{"name": "Defog (SpD)"}, {"name": "Bulk Up (SpD)"}]},
  "Dracozolt": {"sets": [{"name": "Sand Rush (Atk)"}]},
  "Calyrex-Ice": {"sets": [{"name": "Substitute Leech Seed"}, {"name": "Choice Band"}, {"name": "Swords Dance"}]}
}