{
  "Charizard": {
    "overview": "<p>Charizard's overall solid stats, great typing, and splendid movepool allow it to perform multiple roles effectively, such as special wallbreaker and physical sweeper. Its typing and decent bulk also give it a fair amount of defensive utility, allowing it to check threats like Ribombee. However, Charizard struggles to get past many metagame staples like Gigalith, particularly if it lacks Toxic, while its Speed tier leaves it unable to check multiple threats like Sneasel and Dragon Dance Scrafty.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>Charizard makes for a great wallbreaker and offensive check to Pokemon like Ribombee, Tsareena, and Gallade. Defog allows Charizard to clear all entry hazards and is the preferred option due to Charizard's ability to force out common entry hazard setters like Palossand and Weezing. Toxic cripples switch-ins such as Lanturn and Gigalith; it also allows Charizard to pressure Jellicent and Aromatisse more effectively. Lastly, Focus Blast immediately pressures Rock-types like Regirock. Fighting-types like Hitmontop and Bulk Up Scrafty appreciate Charizard pressuring their switch-ins such as Ribombee. In exchange, they can take on Charizard's answers like Gigalith and Lanturn. Pokemon like Sandaconda and Jellicent make for good partners thanks to their ability to take on attackers that force Charizard out like Lycanroc and Basculin, respectively. On sun teams, Solar Power is an option, as it makes Charizard significantly harder to switch into. On such teams, it should forego Hurricane for Solar Beam and run Weather Ball in the fourth moveslot, and Choice Specs is an option over Heavy-Duty Boots. Charizard should also be paired with other Pokemon that take advantage of sun such as Shiftry.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Thanks to its great utility options and defensive profile, Charizard can offer teams valuable support while also checking prominent threats such as Ribombee and Choice Specs Whimsicott. With Toxic, it can more easily wear down common switch-ins in Gigalith, Regirock, and Lanturn. Mystical Fire can be used as a STAB option over Flamethrower to help Charizard take on Stored Power users, notably Mesprit, Uxie, and Claydol. The move also allows Charizard to beat Scald Jellicent alongside Toxic. Good teammates for Charizard would be Pokemon such as Perrserker and Trevenant, as they help further break down Rock- and Water-types such as Regirock and Jellicent, respectively. Pokemon like Sandaconda and Weezing also pair well with Charizard, setting entry hazards to help weaken its checks and absorbing Knock Off for it. Finally, teammates such as Quiver Dance Ribombee and Nasty Plot Mesprit appreciate Charizard crippling Gigalith with Toxic, as they have a hard time breaking through it even after a boost.</p> "
      },
      {"name": "Dragon Dance", "description": "<p>Charizard's impressive Speed and coverage allows it to outspeed common Choice Scarf users like Togedemaru and Mesprit as well as threaten its would-be switch-ins such as Gigalith after a Dragon Dance. Roost allows Charizard to switch into threats like Ribombee and Whimsicott as well as set up more easily, while Thunder Punch is Charizard's best option to hit Jellicent, having a solid chance of 2HKOing it; it also hits Archeops and opposing Charizard. Charizard's middling Attack means it can't sweep unless the opposing team is very weakened; this makes wallbreakers like Vikavolt and Trevenant very appreciated. They can both take on defensive behemoths such as Jellicent and Regirock that Charizard struggles against. Mach Punch Hitmontop can check Lycanroc; similarly, Froslass can wear down its shared checks with Charizard, like Gigalith, particularly with Spikes.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 346653, "username": "avarice"}, {"user_id": 202117, "username": "MZ"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 400292, "username": "asa"}]}], "writtenBy": [{"user_id": 434150, "username": "gum"}, {"user_id": 510532, "username": "cy"}]}
  },
  "Pikachu": {"sets": [{"name": "Revenge Killer"}]},
  "Sandslash": {"sets": [{"name": "Offensive"}]},
  "Clefairy": {"sets": [{"name": "Stealth Rock"}]},
  "Ninetales": {"sets": [{"name": "Nasty Plot"}]},
  "Wigglytuff": {"sets": [{"name": "Defensive"}]},
  "Dugtrio": {"sets": [{"name": "Lead"}, {"name": "Wallbreaker"}]},
  "Dugtrio-Alola": {"sets": [{"name": "SubToxic"}, {"name": "Wallbreaker"}]},
  "Persian": {
    "sets": [
      {
        "name": "Revenge Killer",
        "description": "<p>Persian's uncontested Speed tier, Technician Fake Out, and solid coverage make it a decent, although weak, revenge killer. However, it suffers extreme competition in this role from Pikachu, which boasts Extreme Speed and a greater offensive presence at the expense of some Speed. Fake Out lets Persian get extra damage on the foe without punishment and stall for extra poison damage, letting it follow up with Double-Edge in order to secure KOs on targets like the Silvally formes. Fake Out can also be used to pick off heavily weakened targets that have boosted their Speed, like Fraxure, in a pinch. Knock Off removes items from bulky switch-ins that otherwise disregard anything Persian can do to them, such as Mawile, Dusclops, and Hippopotas, and provides coverage for Ghost-types like Drakloak. U-turn lets Persian keep up momentum for its team, saving it from floundering against bulky foes like Stonjourner, Mawile, and Dusclops. Hypnosis can be used over Knock Off to better cripple switch-ins like Mawile but is unreliable due to its poor accuracy and leaves Persian unable to damage Ghost-types outside of U-turn. Silk Scarf is preferred in order to boost Persian's most important attacks without further cutting into its already limited longevity. Technician is vital in order to let Fake Out deal significant damage.</p> <p>Persian is a good fit for bulky offense teams utilizing Spikes, which help it gradually overwhelm its switch-ins with Spikes damage, Fake Out, and U-turn. Offensive Roselia is an effective Spiker that Persian can bring in on switchins such as Mareanie, Gourgeist, and Dubwool via U-turn to set up Spikes. Roselia can also utilize Sleep Powder to put shared checks like Mawile and Pawniard to sleep. Offensive entry hazard setters like Crustle and Pawniard help weaken foes early-game, and their hazards greatly aid Persian in its role as a revenge killer. Persian can form an effective VoltTurn core with teammates like Manectric, Raichu, and Raboot, all of which can cover Pokemon that can safely switch in on Persian such as Mawile, Stonjourner, and Pawniard. Silvally-Psychic can put offensive pressure on Fighting-types Persian struggles with, such as Throh, Falinks, and Hitmontop, while also threatening to set up and breaking down targets like Mawile to help Persian clean late-game. Mr. Rime can't switch in easily but can pressure Throh and Hitmontop, and its access to hazard control helps keep Persian from being overwhelmed by residual damage. Stacking other priority users like Pawniard and Falinks with Persian can form a powerful anti-setup core that takes pressure off Persian. Both examples also deter Defog with Defiant, making them good choices for teams utilizing Spikes.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 461329, "username": "Estarossa"}, {"user_id": 474994, "username": "royesk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 375272, "username": "Eve"}]}
  },
  "Persian-Alola": {"sets": [{"name": "Bulky Pivot"}]},
  "Golduck": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Specs"}, {"name": "Rain Dance"}]},
  "Poliwrath": {
    "overview": "<p>Thanks to its interesting assortment of attributes, Poliwrath has a unique place in PU and can provide teams with incredibly useful role compression. On top of naturally taking on Scrafty and Aggron due to its typing and bulk, Poliwrath also checks opposing Water-types like Wishiwashi thanks to Water Absorb, which distinguishes it from Quagsire. Poliwrath's movepool is also solid, containing good offensive and defensive tools that let it function as either a powerful wallbreaker or a sturdy phazer. Beyond this, Poliwrath can potentially run other sets that make different use of its good traits, such as Choice Scarf, which mitigates its mediocre Speed tier. Despite being proficient in various areas, however, Poliwrath is not a master in any one of them. Poliwrath's meager offensive stats mean its damage output can be lackluster at times, which tends to make its defensive set even more passive. Poliwrath checks a lot of the tier, but common Pokemon like Espeon, Ribombee, and Charizard similarly threaten it. Finally, Poliwrath faces serious competition in its roles from more prevalent Pokemon. In terms of other wallbreakers, Basculin is faster and has access to priority and Flip Turn, while Jellicent can be harder to answer immediately due to Water Spout. As for defensive pivots, Lanturn and Wishiwashi more comfortably deal with Charizard and generate momentum for teams, while Scrafty can compensate for its passivity by setting up on opposing walls.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Common Water-resistant foes like Ferroseed find switching into Poliwrath difficult thanks to its powerful Close Combat. Darkest Lariat threatens Ghost-types like Jellicent, which otherwise walls Poliwrath, and Cofagrigus, which despises that the move also ignores Defense boosts. Earthquake deals more damage to Lanturn than Close Combat and also OHKOs Poison Point Qwilfish after Stealth Rock. Poison Jab is another option that hits Fairy-types like Silvally-Fairy and Aromatisse harder than any other move Poliwrath viably runs. Fire-types such as Charizard and Centiskorch are good offensive checks to Grass- and Fairy-types and can support Poliwrath by wearing down its checks with either status or coverage and, in Charizard's case, removing entry hazards. In return, Poliwrath protects them against Water-type attacks and pressures switch-ins to them like Audino and Aggron. Galarian Articuno can similarly check Grass-types on top of bringing Poliwrath in safely with U-turn punishing its switch-ins with Future Sight. In return, Poliwrath pressures special walls like Gigalith and Audino and offensively checks Pokemon like Sneasel and Glastrier.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Circle Throw prevents setup sweepers like Scrafty and Quagsire from switching in on and exploiting Poliwrath. Rest lets Poliwrath remain healthy so that it can switch into threats like Absol with more ease throughout the game, and Sleep Talk limits its passivity while it's sleeping. 96 Speed EVs allow Poliwrath to outspeed Adamant Aggron and Speed tie with Sandaconda. Spikes and Toxic Spikes become especially difficult to play around due to how disruptive Poliwrath can be, with Ferroseed and Weezing being premier users of these moves, respectively. The former offers Poliwrath safety against opposing Water-types like Lanturn and Wishiwashi, the latter keeps Grass-types like Whimsicott at bay, and both can check Fairy-types like Ribombee. As for Stealth Rock users, Gigalith is a notable example, since it also provides sand to further wear foes down and takes on Pokemon such as Charizard and Vikavolt. These entry hazard setters appreciate Poliwrath absorbing Knock Off and punishing threats like Scrafty looking to exploit them. Galarian Articuno can be devastating alongside Poliwrath thanks to Circle Throw, which may force a critical member of the opposing team to take heavy damage from or be KOed by Future Sight. In return, Poliwrath annoys Pokemon such as Alolan Sandslash and Sneasel that can switch into or revenge kill Galarian Articuno. Ghost-types such as Trevenant and Silvally-Ghost are really good at exploiting Poliwrath, which makes having teammates like Tangela that can deal with them important. Tangela also commonly runs Knock Off, which makes spreading residual damage easier for Poliwrath.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 563643, "username": "Milah"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Kadabra": {"sets": [{"name": "Revenge Killer"}, {"name": "Life Orb Attacker"}]},
  "Rapidash": {"sets": [{"name": "Offensive Utility"}, {"name": "Swords Dance"}]},
  "Rapidash-Galar": {
    "overview": "<p>Galarian Rapidash stands out among other Terrain sweepers in PU thanks to its unique blend of characteristics. While noticeably frailer than Uxie, its main competition, Galarian Rapidash can more comfortably set up against defensive teams because of Pastel Veil and its access to immediate recovery in Morning Sun. In addition, Galarian Rapidash's higher Speed lets it naturally outrun common threats like Charizard and Galarian Articuno, making it harder to pressure once it begins setting up. However, Galarian Rapidash often needs to boost multiple times to sweep due to its mediocre Special Attack. Galarian Rapidash's four-moveslot syndrome means that it also struggles to make full use of its good coverage, which, at times, limits its early- to mid-game effectiveness. Outside of Grassy Terrain teams, there is little to no reason to use Galarian Rapidash over other Psychic- and Fairy-types like Mesprit and Whimsicott, since they provide valuable and consistent support, have greater defensive presences, and, in the case of the former, are stronger.</p> ",
    "sets": [
      {
        "name": "Grassy Seed Sweeper",
        "description": "<p>Mystical Fire breaks through Steel-types such as Togedemaru and Ferroseed while also annoying opposing Stored Power users like Uxie by limiting their Special Attack boosts. Dazzling Gleam is mainly useful for threatening Scrafty, which would otherwise wall Galarian Rapidash. Healing Wish is a good, if niche, utility option that gives a weakened teammate another chance to either sweep or provide support. Pastel Veil protects Galarian Rapidash from being poisoned, which allows it to freely switch in on Toxic and Toxic Spikes. This can be useful for creating additional setup opportunities, something that Galarian Rapidash greatly appreciates. Thwackey is a required teammate due to its ability to automatically set Grassy Terrain upon switching in. Thwackey can also aid Galarian Rapidash by softening up foes like Ferroseed with Knock Off, generating momentum for it with U-turn, and threatening bulky Rock-types such as Gigalith. Other Terrain sweepers are similarly important partners. Hitmonlee is particularly notable for its ability to deal with Scrafty as well as Rock- and Steel-types. Galarian Rapidash pressures many annoying walls in return, such as Weezing and Quagsire.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Magneton": {
    "overview": "<p>Because of its good offensive typing, high Special Attack, and strong STAB options, Magneton can serve as a threatening wallbreaker that pressures defensive staples like Aromatisse and Gigalith. Analytic compensates for Magneton's middling Speed tier while also making it more difficult to switch into. Magneton can effectively take advantage of this thanks to its access to Volt Switch, putting opponents on the back foot while also generating momentum for its teammates. With the combination of Sturdy and Heavy-Duty Boots, Magneton can also act as a decent revenge killer, taking pressure off of its team against threats like Charizard and Lycanroc. However, the prevalence of Pokemon such as Lanturn, Lightning Rod Togedemaru, and Galarian Stunfisk makes walling Magneton easier for a lot of teams. Magneton's average Speed also leaves it outsped by common offensive threats like Gallade and Magmortar. Finally, due to its poor bulk, Magneton often struggles to safely switch in even on resisted hits and can't make full use of the defensive benefits that come with its Steel typing.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Tri Attack provides Magneton with neutral coverage for Lanturn and Vikavolt while still hitting Ground-types like Claydol. Teleport is another option that lets Magneton pivot out against Electric-immune Pokemon like Lightning Rod Togedemaru. Alternatively, Steel Beam manages to 2HKO even Bulk Up Scrafty on the switch if Stealth Rock is up, which Flash Cannon cannot achieve. Other pivots such as Ninjask and Tsareena pair well with Magneton, since they create a momentum core and help to exert increased pressure on opposing teams. These examples also threaten nuisances like Galarian Stunfisk and offer Knock Off support, while Magneton threatens physically bulky Pokemon like Weezing. Walls like Aromatisse, Weezing, and Gigalith serve as a safety net against faster Fire-types like Charizard and Magmortar that force Magneton out. Pokemon like Sandaconda and Ribombee provide Magneton with speed control in Glare and Stun Spore, respectively, which gives it more opportunities to wallbreak by making it harder to immediately threaten out. These examples falter against Pokemon such as Trevenant, Whimsicott, and Silvally-Steel, all of which Magneton can potentially exploit.</p> "
      },
      {
        "name": "Revenge Killer",
        "description": "<p>Thunder Wave lets Magneton debilitate setup sweepers and wallbreakers that it can't immediately OHKO, such as Silvally-Ghost and Magmortar. Toxic can be used to gradually down wear switch-ins like Claydol and Palossand. Steel Beam is another option that always OHKOes Silvally-Fairy and +1 Ribombee. Preserving Sturdy is often easy thanks to Heavy-Duty Boots and Magneton's natural immunity to residual damage from sand, even if it needs to come in and use Volt Switch or threaten a wall like Golbat after a teammate pivots out or faints. This set fits best on offensive teams in need of both a revenge killer and a pivot. Bear in mind that Magneton doesn't need much support to function, meaning you should add it to teams that benefit from its talents rather than build around it. Magneton struggles with bulky Electric-immune Pokemon such as Lanturn, which is especially problematic given that many of its targets can easily fall back on them. As such, it appreciates having teammates like Tsareena and Whimsicott. Spikes support from Pokemon like Froslass can give Magneton an easier time revenge killing Dragon Dance Scrafty and other foes it otherwise falls short of KOing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 346653, "username": "avarice"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Haunter": {
    "overview": "<p>Haunter finds a niche as a wallbreaker that opens holes for its teammates with a unique STAB combination that benefits from the tier's lack of common resistances to Ghost-types. Unlike other Ghost-type wallbreakers such as Trevenant and Silvally-Ghost, Shadow Ball allows Haunter to bypass pseudo-Ghost-type checks like itemless Togedemaru and Weezing. This allows teammates to run item removal, which makes it more flexible than Silvally-Ghost. Furthermore, the ability to choose its item, access to a secondary STAB to break past Normal-types more easily, and consistent super effective coverage for Scrafty gives Haunter a valuable niche over Trevenant. While Haunter’s secondary STAB is less spammable, the ability to beat Fairy-types like Silvally-Fairy and Clefairy is useful. A mix of good damage output, solid Speed tier, and Sludge Bomb, which poisons switch-ins, make it a unique special attacker over the likes of Vikavolt and Ribombee. Haunter outpaces several offensive threats such as Tsareena, Mesprit, and Hitmontop. However, it is left lacking against faster threats such as Archeops and Charizard, both of which force Haunter out. It also has a Speed tie with offensive Silvally formes and Timid Galarian Articuno, which makes it inconsistent at threatening them, especially if both sides are at +1. Despite three immunities and a 4x resistance to U-turn, Haunter lacks meaningful defensive utility due to its horrendous bulk and thus only takes advantage of passive Pokemon that it resists like Aromatisse. Haunter is also switched into easily by blanket special walls such as Gigalith, Lanturn, Audino, and Togedemaru.</p> ",
    "sets": [
      {
        "name": "Substitute + 3 Attacks",
        "description": "<p>This set capitalizes on the switches Haunter forces by setting up a Substitute, which eases prediction and negates otherwise threatening priority from Pokemon like Absol, and dissuading faster Pokemon like Charizard from coming in. Sludge Bomb is chosen over Sludge Wave due to the higher poison chance, which cripples switch-ins like Gigalith and Miltank. Disable takes advantage of Pokemon that have only one attack that can break Haunter's Substitute such as Palossand and Flamethrower Weezing, but dropping Dazzling Gleam means Haunter struggles to break past Scrafty. Life Orb gives Haunter the most power while allowing it to switch moves. Choice Specs in tandem with Trick or Energy Ball instead of Substitute is an option that increases Haunter's power, notably allowing it to OHKO Scrafty and 2HKO Togedemaru. However, it is then more easily pressured by Pokemon that can outspeed it like Charizard and more reliant on prediction to succeed. Haunter struggles against Gigalith commonly running Rock Blast, so partners with a type advantage such as Sandaconda and Tsareena, are appreciated. Sandaconda also provides entry hazard support, while Tsareena brings Haunter in on checks like Weezing and Togedemaru to wear them down. Fighting-types such as Sawk and Gallade make solid partners, as they both lure in Ghost-types like Palossand and Jellicent that Haunter can break through. In return, they check Normal- and Dark-type threats to Haunter like Audino and Absol.</p> "
      },
      {"name": "Choice Scarf", "description": "<p>The advantage that Choice Scarf Haunter has over other sets is the ability to revenge kill various Choice Scarfers like Mesprit and Rotom, as well as various sweepers like +1 Tsareena and Adamant Sandslash in sand. Dazzling Gleam lets Haunter revenge kill fast Dark-types such as +1 Scrafty and Alolan Persian. Trick allows Haunter to cripple passive checks like Audino. Haunter is very frail, so it appreciates pivot support from the likes of Togedemaru and Archeops, which can bring Haunter in on their switch-ins like Weezing and Quagsire in order to wallbreak. Blanket special walls like Gigalith, Audino, and Lanturn can switch into Haunter multiple times during a match, so partners that can wear them down such as Ribombee and Charizard, are useful to Haunter.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 346653, "username": "avarice"}, {"user_id": 563643, "username": "Milah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 192841, "username": "dave"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Marowak": {"sets": [{"name": "Wallbreaker"}]},
  "Hitmonlee": {
    "overview": "<p>With Hitmonlee's strong Attack and Unburden, it can function as a great Terrain sweeper. It has solid coverage and has passable bulk to set up with after using Electric or Grassy Seed. However, outside of Terrain teams, Hitmonlee is outclassed by other Fighting-types in the tier like Scrafty or Gallade due to Hitmonlee being reliant on Unburden to make progress. While it has the ability to set up, Hitmonlee still finds itself unable to get past Pokemon like Charizard and Aromatisse if it does not have the right coverage move.</p> ",
    "sets": [
      {
        "name": "Terrain Sweeper",
        "description": "<p>Hitmonlee is exclusively used on Terrain teams, which, in tandem with Electric Seed or Grassy Seed, help it set up with Bulk Up more easily. Close Combat is Hitmonlee's best STAB move, as it does not run the same risk to miss as High Jump Kick does. Knock Off gives Hitmonlee coverage for Pokemon like Mesprit and Silvally-Ghost, cripples Pokemon like Weezing, and hits Flying-types if Hitmonlee is not running Stone Edge. Stone Edge allows Hitmonlee to remove Flying-types such as Charizard and Scyther with ease. Alternatively, Poison Jab gives Hitmonlee coverage for Fairy-types like Aromatisse and Silvally-Fairy. Hitmonlee requires either Pincurchin or Thwackey as a partner and therefore pairs well with other Terrain sweepers like Thievul. On Electric Terrain teams, Jolteon can pressure Flying-types for Hitmonlee so it can run Poison Jab, and Nature Power Ribombee can lure Charizard if Electric Terrain is still active. For Grassy Terrain teams, Thwackey is able to wear down Pokemon like Weezing and Charizard for Hitmonlee to break through late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Hitmonchan": {"sets": [{"name": "Assault Vest"}, {"name": "Offensive"}]},
  "Weezing": {
    "overview": "<p>Weezing's physical bulk, wide utility movepool, and abilities allow it to function as a great defensive pick for teams. A pure Poison typing leaves it with only two weaknesses, one of which can be negated by Levitate, and important resistances, letting it wall Pokemon that utilize Grass- and Fighting-type moves such as Tsareena and Hitmonlee. A solid Special Attack stat and the threat of status make Weezing hard to switch into as well, and the ability to lay Toxic Spikes allows it to provide support for its team and wear down its checks. However, Weezing's low special bulk means even neutral strong special hits will take a big chunk out of its health. Weezing also has unreliable recovery, especially if it forgoes Black Sludge, since its only viable option is Pain Split. A weakness to Psychic also leaves it forced out by foes such as Mesprit and Gallade, and by those with Psychic-type coverage, such as Whimsicott and Ribombee, if it is chipped enough. Choosing Neutralizing Gas also means it struggles with Ground-types such as Palossand.</p> ",
    "sets": [
      {
        "name": "Defensive Utility",
        "description": "<p>Weezing can function as both a wall and a supporter. Will-O-Wisp cripples against Pokemon immune to poison such as Aggron and Ferroseed. Taunt can be used to shut down opposing defensive Pokemon such as Gigalith and Regirock. Flamethrower allows Weezing to threaten Steel-types and Froslass beyond a burn. Neutralizing Gas sacrifices a Ground immunity to let Weezing take advantage of Pokemon that rely heavily on their abilities, such as Gurdurr, Gigalith, and Scyther, and also lets it absorb Toxic Spikes. The given EV spread allows Weezing to outspeed Pokemon like defensive Alcremie. Weezing pairs best with specially defensive Pokemon that can absorb special hits for it; these include blanket checks to special attackers, such as Gigalith and Lanturn, which enjoy Weezing soaking up Fighting- and Grass-type moves for them. Steel-types like Aggron and Ferroseed can handle special attackers like Mesprit, Ribombee, and Galarian Articuno that can overwhelm Weezing. In return, Weezing can absorb Fighting- and, if running Levitate, Ground-type moves for them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Rhydon": {
    "overview": "<p>Rhydon is a solid Stealth Rock user thanks to its great Eviolite-boosted bulk, fearsome Attack stat, good coverage choices, and excellent offensive typing. Its STAB EdgeQuake combination is difficult to switch into, especially when combined with coverage options like Heat Crash to deter frailer Grass-types like Gourgeist-S and Whimsicott from switching in. Rhydon's bulk and defensive typing enable it to become a decent offensive switch-in to common staples like Charizard, Gigalith, and Archeops while also being capable of threatening out Defoggers like Rotom, Articuno, and Silvally-Poison. While Rhydon has a terrific offensive typing, it is weak to numerous common attacking types, causing it to falter against certain entry hazard removers like Whimsicott and Eldegoss. Rhydon's low Special Defense, Speed, and lack of reliable recovery cause it to get worn down very quickly by entry hazards and status, making it reliant on cleric support to aid its longevity.</p> ",
    "sets": [
      {
        "name": "Offensive Stealth Rock",
        "description": "<p>Heat Crash allows Rhydon to lure in and OHKO Ferroseed and Whimsicott as well as Gourgeist-S after Stealth Rock. Rhydon can set up with Swords Dance against passive foes like Audino, Clefairy, and Miltank, making it even more difficult to switch into. Rhydon can also run a more specially defensive set with an EV spread of 252 HP / 16 Atk / 240 SpD to switch into Ribombee and Charizard more reliably and trade against offensive teams. However, this comes at the cost of losing a lot of its offensive presence. Rhydon enjoys Grass-types like Trevenant, Gourgeist-S, and Tangela covering against its weaknesses to Water, Ground, and Grass. In return, Rhydon can switch into Fire- and Flying-type attacks aimed at them. Ferroseed pairs particularly well with Rhydon to form an entry hazard-stacking core, wearing down each other's checks, although they must be wary of their shared weakness to Fighting. Cleric support from Aromatisse and Audino can patch up Rhydon's vulnerability to getting worn down by entry hazards and status.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Tangela": {
    "overview": "<p>Tangela's solid bulk, further bolstered by Eviolite, in combination with its great ability in Regenerator makes it a great switch-in to top physical threats like Archeops, Tsareena and Trevenant. Tangela also has great supportive options such as Knock Off, Leech Seed, Toxic, and Sleep Powder, which makes up for its mediocre damage output. However, Tangela is held back by its poor special bulk and bad typing, as being pure Grass leaves it vulnerable to a plethora of top Pokemon like Ribombee, Vikavolt, and Magmortar. Additionally, Tangela is very reliant on its item Eviolite, and a lot of Pokemon that it checks carry Knock Off, making Tangela less reliable of an answer to them. Furthermore, it dislikes getting poisoned by Toxic, making it less effective as a pivot.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Knock Off is a great utility move and is able to remove items such as Heavy-Duty Boots from Pokemon such as Centiskorch, Charizard, and Ribombee. Leech Seed allows Tangela to cripple answers like Charizard and potentially help a teammate like Regirock, although Synthesis gives it an easier time beating Pokemon like Absol in a one-on-one, which it can't reliably do when running Leech Seed. Toxic cripples defensive Pokemon better, while Sleep Powder cripples offensive Pokemon such as Gallade and allows it to bring a wallbreaker or setup sweeper in with more ease. Rock-types such as Gigalith check Fire-types such as Magmortar and Charizard. Lanturn also checks threats like Magmortar, Charizard, and Galarian Articuno that Tangela dislikes; it can also provide Heal Bell support for Tangela. In return, Tangela checks Palossand and Sandaconda for them and can bolster their health with Leech Seed. Since Tangela hates Poison-types like Golbat and Weezing, partners like Mesprit and Vikavolt are appreciated. In return, Tangela checks Absol and Togedemaru for them. Frail wallbreakers like Magneton, Archeops, and the aforementioned Vikavolt dislike the presence of foes such as Silvally-Ground, Togedemaru, and Lycanroc, so Tangela makes for a great defensive backbone to rely on.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 415305, "username": "Katy"}]}
  },
  "Kangaskhan": {
    "overview": "<p>Kangaskhan carves itself a role as a priority attacker in the PU metagame with the combination of Fake Out and Sucker Punch, enabling it to become a good blanket check against offensive teams thanks to its solid power and bulk. Scrappy allows it to combat Ghost-types like Froslass, Gourgeist-S, and especially Silvally-Ghost, distinguishing itself from other Normal-types. Kangaskhan's decent Speed tier permits it to outspeed threats like non-Choice Scarf Mesprit and Gallade, while its solid natural bulk enables it to take a hit if necessary and continue to wallbreak. However, despite Kangaskhan's good Attack stat and access to Earthquake, it struggles against Pokemon resistant to Normal-type attacks like Gigalith, Regirock, and especially Ferroseed, as it lacks enough power to muscle past them. Kangaskhan is also reliant on hazards to supplement its damage output, as it struggles to break through teams without them. While its Speed tier is acceptable, offensive threats like Silvally-Fairy, Archeops, and Charizard can outpace it and threaten it with heavy damage. Lastly, although Kangaskhan has a wide movepool, other set options, like Choice Band and defensive variants, tend to be outclassed by other Pokemon with more immediate power or better defensive profiles.</p> ",
    "sets": [
      {
        "name": "Dual Priority",
        "description": "<p>Fake Out enables Kangaskhan to score free chip damage and flinch offensive Pokemon like Froslass, Charizard, and Silvally-Ghost. It should be noted, however, that Ribombee cannot be flinched because of Shield Dust. Double-Edge is its primary STAB attack, dealing heavy neutral damage against Tsareena, Silvally-Fairy, and Mesprit. Earthquake OHKOes Togedemaru and Magneton while being its best option to damage Aggron, Ferroseed, and Gigalith. Sucker Punch finishes off sufficiently weakened offensive foes like Choice Scarf Rotom, Galarian Articuno, and Scyther. An Adamant nature is preferred to maximize its power and achieve KOs against Scrafty, Galarian Articuno, and Silvally formes, though a Jolly nature can be opted for to outpace Mesprit and Gallade. Silk Scarf boosts the power of its STAB moves and enables it to wallbreak as hard as possible; however, Heavy-Duty Boots can alleviate Kangaskhan's susceptibility to getting worn down by entry hazards.</p> <p>Entry hazard support and chip damage from the likes of Qwilfish, Ferroseed, and Gigalith are greatly appreciated to whittle down foes like Lanturn, Weezing, and Palossand to be closer in Kangaskhan's KO ranges. Even with Earthquake to hit Gigalith and Regirock for super effective damage, Kangaskhan appreciates Water-types that effectively check them, like Wishiwashi and Jellicent, as they both threaten Kangaskhan’s checks with Scald. Physically defensive Pokemon like Tangela and Sandaconda can also switch into Rock-types and threaten them out. Ferroseed stands out as an excellent Kangaskhan answer, so Fighting-types like Gallade and Sawk are appreciated to counter it. Special wallbreakers, such as Frosmoth, Ribombee, and Rotom, are also recommended to weaken such checks and facilitate opportunities for Kangaskhan to attack. Charizard also works nicely as a partner, since Kangaskhan’s checks like Ferroseed, Gigalith, and Regirock can either be hit super effectively with Fire Blast or worn down by Toxic. In return, Kangaskhan can pressure specially defensive foes such as Clefairy, Aggron, and Togedemaru with its STAB attacks and coverage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 563643, "username": "Milah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Seaking": {"sets": [{"name": "Choice Band"}]},
  "Mr. Mime": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Mr. Mime is a great revenge killer due to its overall good Speed and Special Attack, allowing it to pick off threats such as Dubwool, Falinks, Stonjourner, and even some Silvally formes. Its access to Healing Wish allows it to bring in a weakened teammate back to full health and cure any existing status conditions, giving it more utility and team support, while Trick allows it to cripple defensive Pokemon like Type: Null and Musharna. Mr. Mime can also viably run Choice Specs to increase its wallbreaking power, though the Speed boost from Choice Scarf is normally preferred, since Mr. Mime is otherwise outsped by Silvally and Drakloak. Focus Blast or Mystical Fire can be used over a support move to allow Mr. Mime to do more damage to Steel-types like Klang and Mawile. Teleport is another option that allows Mr. Mime to provide a valuable negative-priority pivoting move and gain momentum for an offensive team.</p> <p>Choice Scarf Mr. Mime itself appreciates strong wallbreakers like Life Orb Falinks, Basculin, and Silvally-Grass so that it can clean up once bulkier Pokemon like Type: Null and Mawile are weakened and faster threats like Manectric or Choice Scarf Leafeon are taken care of. These Pokemon also appreciate Mr. Mime's Healing Wish support so they can come back for a second time late-game, allowing them to be played more aggressively early in the game. Mr. Mime's generally low damage output means it also appreciates help from Spikes setters like Roselia and Crustle to wear down Pokemon it usually can't break through. Setup sweepers like Nasty Plot Gourgeist, Rock Polish Stonjourner, and Shell Smash Crustle also appreciate Mr. Mime's ability to give them a second chance at setting up to sweep with Healing Wish or shut down a defensive Pokemon like Type: Null or Pyukumuku with Trick that could keep them from sweeping. Mr. Mime also appreciates their ability to break through bulkier Pokemon like Mawile and Shiinotic for it to pick off. While Mr. Mime is decently fast, it is still outsped by Pokemon such as Choice Scarf Manectric as well as Flame Charge Silvally formes, so priority users like Hitmontop and Falinks or Speed-boosting sweepers like Rock Polish Stonjourner help take care of these threats. Defensive checks to these Pokemon like Palpitoad, Drakloak, and Pyukumuku also help Mr. Mime handle them. Alternatively, if Mr. Mime is running Trick, its ability to cripple special walls by removing their items allows other specially offensive Pokemon like Raichu and Choice Specs Glaceon to break through them better.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 331538, "username": "TJ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 265399, "username": "SergioRules"}]}
  },
  "Scyther": {
    "overview": "<p>Scyther is a decent pivot in PU due to its decent Speed tier and high Attack. Scyther also possesses a resistance to Fighting and semi-decent bulk, granting it some defensive utility. In addition, Scyther can easily apply offensive pressure due to its Technician-boosted Dual Wingbeat and Knock Off. However, Scyther has a mediocre defensive typing with a weakness to Flying- and Rock-types, both of which are common in the tier. Scyther also has difficulty checking Fighting-types, as many of them carry either Knock Off or Stone Edge. Furthermore, Scyther has difficulty breaking through common walls even with a boost, and while it has a decent Speed tier, it is still outsped by common threats such as Archeops, Sneasel, and Ribombee. Finally, Scyther faces stiff competition from Archeops, as it provides more power to a team.</p> ",
    "sets": [{"name": "Offensive Pivot", "description": "<p>Scyther is an excellent momentum grabber due to its offensive presence. Knock Off cripples common switch-ins such as Regirock and Weezing, making them easier to pressure. Roost is an option to extend Scyther's longevity while also taking advantage of its natural ability to force switches and passive Pokemon such as Palossand. Scyther fits nicely on VoltTurn teams due to its pivoting abilities. Lanturn works well with Scyther, as Lanturn can bring it in via a slow Volt Switch and cure its status with Heal Bell while checking Pokemon such as Choice Scarf Togedemaru that it has a hard time against. Other Volt Switch users such as Rotom and Vikavolt also pair nicely with Scyther, as they handle each other’s weaknesses while forming a VoltTurn core. Tsareena and Mesprit appreciate Scyther bringing them in via U-turn against Pokemon Scyther struggles to break through, such as Regirock and Weezing.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 488506, "username": "sovietsympathizer"}]}
  },
  "Jynx": {"sets": [{"name": "Nasty Plot"}, {"name": "Choice Scarf"}, {"name": "Choice Specs"}]},
  "Pinsir": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Scarf"}, {"name": "Stealth Rock"}]},
  "Lapras": {"sets": [{"name": "RestTalk"}, {"name": "Choice Specs"}]},
  "Jolteon": {"sets": [{"name": "Utility"}]},
  "Flareon": {"sets": [{"name": "Specially Defensive"}, {"name": "Offensive"}]},
  "Kabutops": {"sets": [{"name": "Choice Scarf"}]},
  "Articuno": {
    "overview": "<p>Articuno secures itself a niche on defensive teams as a solid Defogger with unique qualities. Its great special bulk and reliable recovery let it take on Pokemon such as Ribombee, Mesprit, and Frosmoth without much issue. Pressure + Defog can threaten entry hazard users that don't threaten Articuno, such as Druddigon and Mesprit, and it is able to stall Pokemon such as Whimsicott lacking Knock Off and Palossand due to its massive special bulk. Unfortunately, Articuno's typing gives it few relevant resistances and weaknesses to common types such as Electric, Fire and Steel as well as a 4x weakness to Rock-types. This makes Articuno reliant on Heavy-Duty Boots to avoid Stealth Rock and very vulnerable to Knock Off. Articuno often requires dedicated support to succeed and only fits on specific playstyles such as stall or semi-stall.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Freeze-Dry hits Ground-types such as Sandaconda and Rhydon as well as Water-types such as Lanturn and Jellicent. Alternatively, U-turn generates momentum for Articuno's team but cannot directly threaten the aforementioned Ground- and Water-types. Brave Bird hits Bug-types such as Ribombee and Centiskorch and prevents them from turning Articuno into setup fodder. Heal Bell can be used for cleric and frees up a slot for the most common cleric on defensive teams, Audino. Toxic is also an option to cripple switch-ins such as Gigalith and Magmortar, but it lacks the utility of either Brave Bird or Heal Bell. The given Speed EVs let Articuno outspeed neutral-natured base 65 Speed foes such as Centiskorch and Frosmoth, while the remaining EVs go into its special bulk to better check Ribombee and Galarian Articuno. Since Articuno mainly fits on stall teams, it should be paired with Knock Off absorbers such as Scrafty and Weezing; Scrafty also absorbs status, while Weezing can burn physical attackers.. In return, it provides valuable Defog support and checks Frosmoth and Centiskorch, which have good matchups against defensive teams. Other entry hazard removers such as Claydol and Tsareena can free up a moveslot for Articuno and allow it to run another utility move while also threatening entry hazard setters such as Reigrock and Gigalith. Articuno's common weaknesses can be negated by partners such as Palossand and Quagsire. Both absorb Electric- and Rock-type moves, with Palossand also providing Stealth Rock support and Quagsire taking on Fire- and Steel-type moves for Articuno.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 467518, "username": "Bag of Trixx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Articuno-Galar": {
    "overview": "<p>Galarian Articuno is one of PU's best and most dangerous special attackers thanks to its high Special Attack and great offensive typing. Part of what makes Galarian Articuno so threatening is Future Sight, which can severely limit its counterplay. Furthermore, Galarian Articuno is somewhat versatile, capable of serving either as a pivot that wallbreaks for itself and its teammates or a Choice Specs user that can tear through many teams with its power and coverage. Both sets fit on similar teams, which can make it hard to predict what Galarian Articuno is going to do and play around it. Galarian Articuno even has a nice defensive presence because of its decent bulk and recovery, with its typing also providing it useful opportunities to switch in against foes like Tsareena and Mesprit. However, Galarian Articuno can only reliably come in on threats that are weak like Whimsicott or Choice-locked like Mesprit. This is because Pokemon like Weezing, Sandaconda, and Scrafty can either threaten it with status or super effective coverage. Galarian Articuno also struggles to break through bulky Rock- and Steel-types like Gigalith, Aggron, and Galarian Stunfisk, given its lack powerful coverage for them. Finally, due to its middling Speed tier, Galarian Articuno is outpaced and easily pressured by Pokemon such as Archeops and Basculin.</p> ",
    "sets": [
      {
        "name": "Heavy-Duty Boots",
        "description": "<p>This set lets Galarian Articuno serve as an offensive pivot that checks defensive Pokemon like Weezing and Sandaconda and generates momentum for its teammates. Protect is a niche alternative to U-turn that stalls a turn after using Future Sight and allows Galarian Articuno to see what move Choice item users like Sneasel and Togedemaru will lock into. However, U-turn tends to be better, since it maximizes the pressure Future Sight puts on teams. Freezing Glare can be used over Future Sight for an accurate and immediately damaging STAB move, although it's noticeably weaker. Physical wallbreakers such as Hitmontop, Absol, and Trevenant appreciate Future Sight deterring their checks from switching into them and, in return, break through special walls like Gigalith and Articuno. Since many of Galarian Articuno's best checks are grounded, support from entry hazard setters such as Weezing, Ferroseed, and Froslass is very useful. These Pokemon have an easier time keeping their entry hazards up thanks to Galarian Articuno's Competitive discouraging Defog attempts, and the former two can also sponge hits from potential revenge killers like Archeops. Because of its weakness to Knock Off and reliance on Heavy-Duty Boots, Galarian Articuno should never be a team's only way to deal with Fighting-types. More reliable checks to them like Aromatisse, which can also eliminate status with Aromatherapy, are therefore important partners. It's worth noting that Heavy-Duty Boots Galarian Articuno can alternatively serve as a decent setup sweeper with Calm Mind, forgoing U-turn and opting for Freezing Glare instead of Future Sight. Such a set is more self-reliant, since it allows Galarian Articuno to more readily exploit the switches it forces.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Future Sight becomes incredibly strong when powered up by Choice Specs but shouldn't be used as this set's only Psychic-type STAB move. Psyshock hits special walls like Audino and Lanturn harder than Freezing Glare and more reliably than Hurricane, but Freezing Glare has better overall damage output. Shadow Ball hits Steel-types for neutral damage and threatens opposing Psychic-types such as Claydol and Mesprit more consistently than Hurricane. Entry hazard control is important, since Stealth Rock prevents Galarian Articuno from freely switching in. Tsareena and Whimsicott are notable removers, since they both threaten common entry hazard setters like Gigalith and Regirock and can use Knock Off to soften shared checks with Galarian Articuno, such as Alolan Sandslash. Tsareena can go one step further by running High Jump Kick to eliminate unsuspecting Steel-types altogether. Another good example is Charizard, which pressures Steel-types and offensively checks faster Pokemon like Ribombee. Particularly, if it lacks Toxic, Charizard also enjoys Galarian Articuno overwhelming its primary switch-in in Gigalith. Setup sweepers like Scrafty and Silvally-Fairy appreciate Galarian Articuno giving them an easier time breaking through teams and finishing them off late-game. They also find Future Sight dissuading their checks and counters from switching in very useful, since this can translate to either a forced KO or more turns to set up.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Lanturn": {
    "overview": "<p>Lanturn has unique utility as a bulky Water-type thanks to its splendid defensive typing and great ability. This allows it to check a myriad of Pokemon such as Charizard, Rotom, and Basculin. It can also act as a pivot due to Volt Switch, which allows it to serve as a damage sponge to bring stronger yet more delicate wallbreakers in such as Archeops and Scyther that benefit from specially defensive or Grass-type Pokemon being brought in. However, it struggles switching in against Ground-types, which other bulky Water-types like Jellicent are normally able to handle; Lanturn also has to rely on passive recovery due to its lack of a reliable recovery move, which makes it unreliable as a wall for longer games.</p> ",
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<p>Protect is used to stall out Toxic turns and safely gain passive recovery from Leftovers. Heal Bell can be used over Protect to make Lanturn a cleric to assist its teammates while also making it less vulnerable to opposing Toxic users; however, this leaves it more open to Choice item users like Whimsicott and Aggron, and faces competition from Aromatisse. The HP EVs are used to maximise Leftovers recovery, and the Defense EVs are used to allow Lanturn to tank a +1 Earthquake from Dragon Dance Charizard after Stealth Rock. The Speed EVs let Lanturn outspeed maximum Speed, neutral-natured base 40 Pokemon such as Rhydon, and the Special Attack EVs are for Lanturn to OHKO Rhydon with Scald. Defensively, Lanturn needs support from Pokemon that can take on Grass- and Ground-type threats like Whimsicott and Sandaconda. This makes Pokemon such as Charizard, Whimsicott, and Weezing solid partners. Lanturn can also support wallbreakers such as Whimsicott and Ribombee that can offensively pressure its main checks, while it supports them defensively and safely brings them in via Volt Switch.</p> "
      },
      {"name": "Assault Vest", "description": "<p>Assault Vest allows Lanturn to switch into special attacking threats such as Basculin and Magmortar without sacrificing power. Hydro Pump is an option over Scald, allowing it useful rolls such as a guaranteed OHKO on offensive Charizard with an accuracy and utility tradeoff. Discharge can cripple common Pokemon like Mesprit, while Dazzling Gleam 2HKOes Bulk Up Scrafty. The Speed EVs are used for maximum Speed, neutral-natured base 50 Pokemon and lower such as Aggron and Perrserker. Pokemon like Ferroseed appreciate Lanturn being able to wall their checks like Charizard, and it is also defensively supported by Pokemon such as Palossand and Sandaconda that switch in on physical threats like Archeops and Aggron that take advantage of it.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 213583, "username": "TONE"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 292388, "username": "Meri Berry"}]}
  },
  "Bellossom": {"sets": [{"name": "Bulky Quiver Dance"}]},
  "Quagsire": {
    "overview": "<p>Quagsire is seen on stall teams and sometimes balance teams thanks to its support moves, Unaware, and reliable recovery. With Unaware, Quagsire is able to counter many setup sweepers such as Scrafty, Silvally-Ghost, Charizard, and Sandaconda. Additionally, it fulfills a lot of role compression for said teams thanks to its wonderful defensive typing providing an Electric immunity to foes like Togedemaru and Rotom and making it an excellent switch-in to Aggron. However, Quagsire's 4x weaknesses to Grass-types and Freeze-Dry leave it unable to check certain Pokemon such as mixed Silvally formes as well as Perrserker. Furthermore, Quagsire fails to halt incredibly strong wallbreakers like Life Orb Gallade and Choice Band Sawk in their tracks due to them comfortably 2HKOing it. Lastly, Quagsire has poor Special Defense, which makes it struggle against common special wallbreakers like Vikavolt, Choice Specs Mesprit, and Whimsicott.</p> ",
    "sets": [
      {
        "name": "Unaware Wall",
        "description": "<p>Scald is essential for Quagsire, as it burns Grass-types that can switch into its STAB moves like Tsareena and Gourgeist-S. Toxic wears down switch-ins like Whimsicott, Ribombee, and Vikavolt. Curse is another option to provide stall teams with a bulky setup sweeper and beat Bulk Up Scrafty reliably. Haze is also a good option to prevent setup opportunities from foes like Ribombee and Silvally-Fairy. Heavy-Duty Boots is preferred for its ability to nullify entry hazards, since Quagsire's bulk isn't largely impressive to begin with. Taking 44 EVs from Defense and putting them in Special Defense allows Quagsire to switch into Quiver Dance Ribombee, although it makes it easier to overwhelm on the physical side. Weezing is an outstanding partner for Quagsire, as it provides a Toxic immunity and a switch-in to Grass-types like Tsareena. Audino provides cleric support and appreciates Quagsire's abilities to handle setup sweepers that take advantage of its passiveness, like Sandaconda and Scrafty. Charizard or Articuno makes for a fine Defogger to pair with Quagsire, as entry hazards can severely cripple Quagsire's longevity if it loses its Heavy-Duty Boots.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 346653, "username": "avarice"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 467518, "username": "Bag of Trixx"}]}
  },
  "Qwilfish": {
    "overview": "<p>Qwilfish makes for a solid Spikes user in PU. Its high Speed tier differentiates itself from other Spikes users like Ferroseed and Alolan Sandslash, making it a good fit on more offensive teams. It is a decent switch-in to Fighting-types such as Hitmontop and works against Swords Dance Silvally formes in a pinch as well. Also, it is one of the few Toxic Spikes absorbers available. Qwilfish frequently gets opportunities to set Spikes against defensive Pokemon such as Audino and Aromatisse that cannot threaten it. However, Qwilfish is checked by common special attackers like Galarian Articuno and Charizard. Qwilfish also struggles against common entry hazard removers such as Rotom due to being worn down too fast.</p> ",
    "sets": [
      {
        "name": "Spikes",
        "description": "<p>Taunt puts a stop to passive Pokemon like Ferroseed and Weezing. Waterfall prevents Qwilfish from being too passive and checks defensive Charizard and Centiskorch. Thunder Wave cripples Pokemon that fail to OHKO Qwilfish like Silvally formes and can also be useful against setup sweepers such as Scyther. Poison Jab is another option that lets Qwilfish immediately threaten Whimsicott and Ribombee. Destiny Bond is handy to grab momentum on more offensive teams, as it can remove some slower wallbreakers like Trevenant. Toxic Spikes can also be used with Substitute users like Silvally-Ghost and Frosmoth. Intimidate helps against Tsareena and Silvally formes but can be a liability against Galarian Articuno, making Poison Point a fair option. Poison Point combined with Rocky Helmet can also be rather annoying for Pokemon such as Scyther. Qwilfish pairs nicely with Ghost-types like Silvally-Ghost and Cofagrigus because they spinblock, and in return they appreciate Spikes positioning them for a sweep. Rapid Spin users like Coalossal and Hitmontop synergize well with Qwilfish to keep Qwilfish's entry hazards up. Charizard appreciates both Spikes and Thunder Wave support and threatens Pokemon like Whimsicott for Qwilfish in return. Pokemon like Quiver Dance Ribombee and Swords Dance Silvally-Ghost value Qwilfish's Spikes to sweep more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 563543, "username": "Milah"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Shuckle": {"sets": [{"name": "Lead"}]},
  "Sneasel": {
    "overview": "<p>Sneasel is a strong offensive threat in PU thanks to its high Speed that allows it to outpace major threats such as Archeops and near-unresisted STAB move combination in Knock Off and Triple Axel, which are powerful enough to make up for Sneasel's lacking Attack stat. Sneasel can further improve its damage output with Swords Dance or Choice Band. However, even with these options, Sneasel can struggle to break through walls like Weezing and Aromatisse. Sneasel's bulk is very low, making it difficult to switch into even the most passive defensive Pokemon, such as Palossand. It also doesn't help that not running Heavy-Duty Boots leaves Sneasel extremely vulnerable to all forms of entry hazards, while running it leaves Sneasel somewhat weaker and more vulnerable to status. Sneasel also faces competition from other fast revenge killers such as Archeops and Whimsicott, which have more switch-in opportunities and pivoting. Nevertheless, nothing in the tier can rival Sneasel's combination of typing, Speed, and powerful STAB combination.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Due to Sneasel's weakness to Stealth Rock and susceptibility to all other entry hazards, Heavy-Duty Boots is the primary option for its held item. However, Life Orb can be used for an easier time sweeping, and Lum Berry gives Sneasel a one-time out from being crippled by status from the likes of Weezing and Jellicent. Sneasel rarely wants to directly switch into attacks, so it is best brought in as a revenge killer or through pivots such as Silvally-Fairy and Uxie. Silvally-Fairy is also able to remove hazards, while Uxie is able to set Stealth Rock up, and both can also check Fighting-types like Passimian, which can cause trouble for Sneasel. These Fighting-types, as well as defensive threats like Weezing and Silvally-Steel, should be taken out or greatly weakened for Sneasel before it starts setting up. Wallbreakers such as Charizard and Archeops are ideal for this role. Spikes setters and Rocky Helmet users such as Qwilfish and Druddigon are also ideal for dealing chip damage to Choice Scarf users such as Passimian and Togedemaru, ideally putting them into range of Sneasel's +2 Ice Shard before it starts setting up.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band gives Sneasel a good amount of raw power to spam its STAB moves. Low Kick provides coverage for various Pokemon that would take longer for Sneasel to wear down, such as Regirock and Silvally-Steel. Similarly to its Swords Dance set, Sneasel has difficulty hard switching in and is therefore best brought in as a revenge killer or through pivots such as Lanturn and defensive Mesprit. Because full control over the entry hazard game is difficult, Sneasel will either want very effective entry hazard removers or setters. Capable entry hazard removers such as Silvally-Fairy and Whimsicott give Sneasel more chances to wallbreak and are better for teams that can bring it in more frequently. Tsareena is an effective Rapid Spin user in some matchups and also a powerful wallbreaker in its own right, capable of wearing down many defensive Pokemon such as Weezing in conjuction with Sneasel. Entry hazard setters such as Ferroseed and Qwilfish make Sneasel more devastating each time it comes in but tend to also allow Stealth Rock on Sneasel's side of the field, limiting its switch-ins. Sweepers and cleaners such as Quiver Dance Ribombee and Dragon Dance Scrafty also make for good teammates, as they appreciate Sneasel's ability to deal heavy damage to opposing walls.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213583, "username": "TONE"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 202117, "username": "MZ"}]}
  },
  "Piloswine": {
    "overview": "<p>Piloswine is able to set up Stealth Rock and stand out from other setters with its unique STAB combination and priority. Piloswine is able to pressure opposing Stealth Rock setters such as Druddigon and traditional ground-type checks like Whimsicott. Its typing and being able to pick off weakened Pokemon is its greatest strength. While it has a decent offensive presence, it suffers from a lack of recovery making it hard to deal with Pokemon like Vikavolt in the long run. Its typing also hinders it defensively as it leaves Piloswine vulnerable to Togedemaru, common fighting-types like Passimian, as well as Rock-types such as Archeops and Aggron that other Ground-types such as Palossand handle reliably.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Piloswine can be overwhelmed by Fighting-types like Sawk, so it appreciates Pokemon such as Weezing countering them and absorbing Knock Off, which limits Piloswine's defensive potential. In return, Piloswine can pivot into Volt Switch users like Galvantula. Piloswine gets quickly worn down, since it lacks any form of recovery; Aromatisse can alleviate this issue by providing cleric and Wish support and serving as a switch-in to Fighting-types and Knock Off. In return, Aromatisse benefits from Piloswine consistently switching into Arctozolt. Piloswine is able to pick off weakened Pokemon like Whimsicott and Ribombee and take some pressure off Pokemon such as Charizard to deal with them. Charizard makes for a solid partner, as it provides entry hazard removal and beats Tsareena, which Piloswine cannot handle with Ice Shard. Piloswine also has solid synergy with Silvally-Dragon, which can pivot into Water-types like Basculin and benefit from Piloswine weakening threats like Weezing and Gigalith to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Corsola-Galar": {"sets": [{"name": "Defensive"}, {"name": "Calm Mind"}]},
  "Miltank": {
    "overview": "<p>Miltank's Normal typing and solid bulk allow it to reliably switch into the threatening Ghost-types of the tier, such as Froslass, Gourgeist-S, and Trevenant, depending on its ability. Thanks to a wide array of utility moves such as Stealth Rock, Heal Bell, Thunder Wave, and Milk Drink, it is able to provide important role compression while having reliable recovery. Two great defensive abilities and great mixed bulk make Miltank easily customizable to a specific team's needs, with Thick Fat letting it check Fire-types such as Charizard and Sap Sipper letting it check Grass-types such as Tsareena lacking High Jump Kick. However, Miltank can be much too passive at times, relying on Toxic and Seismic Toss to maintain pressure, which can be sorely lacking against foes such as Cofagrigus and Togedemaru. It lacks many resistances, making it easy to overwhelm with attackers such as Tsareena if lacking Sap Sipper and Centiskorch if lacking Thick Fat. It also has a very relevant Fighting weakness, leaving it unable to face the Fighting-types in the tier such as Gallade and Scrafty.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>If Stealth Rock is already taken by a teammate, then Heal Bell is a solid replacement that lets Miltank function as a cleric. Toxic is useful for crippling opposing defensive threats such as Gigalith. Seismic Toss is the chosen attacking move due to it having a consistent damage output, but Body Slam is able to spread paralysis at the cost of inconsistent damage output. Thick Fat allows Miltank to better counter Froslass and take other Fire- and Ice-type moves from Pokemon such as Charizard and Alolan Sandslash, while Sap Sipper makes Miltank the tier's only reliable switch-in to Gourgeist-S and Trevenant and deters Tsareena's Power Whip. Scrappy is an option to damage Ghost-types such as Silvally-Ghost and Haunter, which would otherwise wall Miltank, barring its status, but lacks the defensive utility of either Thick Fat or Sap Sipper. The Speed EVs allow Miltank to outspeed Jolly Scrafty and the entire unboosted tier after a paralysis, while the rest augment its mildly lacking special bulk. Miltank should be paired with Pokemon that can account for its debilitating Fighting weakness. This includes Pokemon such as Weezing and Palossand, which, in return, appreciate Miltank checking special attackers such as Charizard. Stealth Rock setters such as Gigalith and Sandaconda can allow Miltank to run Heal Bell. These Pokemon heavily appreciate the cleric support Miltank then provides, as they are easily susceptible to status. Defensive Pokemon that are weak to Fire or Ice such as Ferroseed and Golbat appreciate the resistance Thick Fat Miltank provides. In return, Ferroseed can remove items from shared checks while Golbat can nullify Fighting-type attacks for Miltank.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 467518, "username": "Bag of Trixx"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Linoone-Galar": {
    "sets": [
      {
        "name": "Toxic Orb Attacker",
        "description": "<p>Galarian Linoone is a reliable revenge killer thanks to its Quick Feet ability and can hit decently hard with its status-boosted Facade. However, it can be worn down quickly between Toxic and entry hazards. Galarian Linoone is able to support teammates with its pivoting capability through Parting Shot. Knock Off lets it cripple Pokemon such as Type: Null and Tangela that rely on their items. Protect allows Galarian Linoone to safely activate its Toxic Orb and Quick Feet, block First Impression from Falinks and Fraxure, and scout against Choice item users such as Choice Scarf Golduck and Manectric. Galarian Linoone's Speed tier and ability to switch moves set it apart from other fast revenge killers like Choice Scarf Unfezant and Lycanroc-N. A set using Double-Edge over Facade with Eviolite gives it more bulk in exchange for the ability to immediately take advantage of Quick Feet and becomes more of a fast pivot than a revenge killer.</p> <p>Wallbreakers such as Appletun and Marowak appreciate the ability to come in safely and pressure Pokemon that Galarian Linoone can pivot on such as Mawile and Stunfisk. In return, Galarian Linoone is able to pick off Pokemon weakened by them. Since Galarian Linoone is prone to being taken advantage of by Competitive and Defiant users such as Wigglytuff, Pawniard, and Falinks, checks to these Pokemon like Gourgeist for Wigglytuff and Galarian Rapidash for Pawniard and Falinks are needed. Galarian Linoone can also form a pivoting core with Manectric, Golduck, Morpeko, Raboot, or Boltund to wear down the opposing team. Parting Shot's Attack and Special Attack drops can also help setup sweepers like Galarian Rapidash and Drifblim have an easier time setting up. As Galarian Linoone will be frequently entering the field, entry hazard removal from Mr. Rime or Morpeko is appreciated too. Mareanie and Stunfisk can also pivot into Fighting-type moves such as Hitmonchan's Mach Punch for Galarian Linoone.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 331538, "username": "TJ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Ludicolo": {"sets": [{"name": "Rain Sweeper"}]},
  "Sableye": {"sets": [{"name": "Defensive"}]},
  "Aggron": {
    "overview": "<p>Aggron fits as both a strong wallbreaker and defensive wall in SS PU. Its STAB moves are naturally strong, and it has a fair amount of coverage and utility moves as well. Aggron's raw strength makes Choice Band sets extremely difficult to switch into and allows even uninvested variants to do a fair amount of damage. Aggron's typing makes it a great stop to common Pokemon like Ribombee and Galarian Articuno and grants a Toxic immunity, setting itself apart from other defensive Pokemon with Stealth Rock such as Regirock and Gigalith. However, its typing can hinder it against common Pokemon such as Scrafty and Sandaconda. No reliable recovery makes defensive sets vulnerable to being worn down as well.</p> ",
    "sets": [
      {"name": "Choice Band", "description": "<p>Aggron is able to threaten most of the tier with its high base power STAB moves. Aqua Tail provides coverage for bulky Ground-types like Palossand and Sandaconda. Earthquake allows Aggron to OHKO opposing Aggron, in addition to evading chip from Rocky Helmet users such as Sandaconda. Superpower is an option to hit Ferroseed super effectively and deal more damage to Regirock, but it usually isn't worth it. Choice Band Aggron appreciates pivots such as Whimsicott and Uxie that lure passive Pokemon such as Aromatisse and Audino for it to take advantage of. Pokemon like Basculin and Archeops can exploit Aggron's typing to gain momentum, so it appreciates support from bulky Pokemon such as Jellicent and Sandaconda. Sandaconda and Uxie also spread paralysis for Aggron.</p> "},
      {
        "name": "Specially Defensive",
        "description": "<p>Aggron is great at sponging attacks from Ribombee, Mesprit, and other special attackers with limited coverage. Even without investment, its STAB moves hit hard and keep it from being passive. Protect makes playing around Choice-locked Pokemon like Gallade and Mesprit, as well as Future Sight users such as Galarian Articuno when they are paired with Pokemon that can threaten Aggron directly, much easier. Toxic is useful to wear down bulky Pokemon like Palossand and Tangela. Roar can rack up chip damage, especially when paired with Spikes from Froslass or Qwilfish. Roar also pairs amazingly with Future Sight users like Galarian Articuno to wallbreak. Wish Aromatisse and Healing Wish Mesprit are great tools to keep Aggron healthy. Fairy-types like Aromatisse and Whimsicott deal with Bulk Up Scrafty, which would otherwise comfortably set up on Aggron, and absorb Knock Off. Other Knock Off absorbers like Weezing and Qwilfish are also useful against Pokemon such as Sawk and Ferroseed. Pokemon like Charizard and Claydol, which can remove Spikes, assist Aggron in not getting worn down too quickly.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Manectric": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Specs"}, {"name": "Toxic + Protect"}]},
  "Altaria": {"sets": [{"name": "Defog"}]},
  "Solrock": {
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Solrock is a Stealth Rock setter that acts as a physical wall thanks to its decent Defense and access to Will-O-Wisp and a reliable recovery move, making it a good check to some physical attackers such as Persian and Stonjourner. It is also notable for having a decent matchup against spinners such as Hitmontop and Galarian Mr. Mime depending on its coverage. However, Solrock suffers from competition with other Stealth Rock setters such as Mawile and Palpitoad, both of which have a better typing and are easier to fit on teams. Mawile has access to Intimidate and plenty of really good resistances such as Ice, Grass, and Flying while Palpitoad has two great immunities in Electric and Water. Rock Slide gives Solrock a better matchup against common entry hazard removers like Mr. Rime, whereas Zen Headbutt is another option that helps against Fighting-types such as Throh and Falinks. Toxic can be an option over Will-O-Wisp to wear down bulkier Pokemon like Gourgeist-XL and Beheeyem, but in a lot of cases, Solrock needs the opposing Pokemon burned to check it easily. Colbur Berry can be used to check Throh, which it can't cripple with Will-O-Wisp, more easily. However, Solrock otherwise prefers the passive recovery from Leftovers.</p> <p>Solrock struggles a lot against Dark-types such as Pawniard and Thievul, so Fighting-types like Throh, Falinks, and Hitmontop make really good teammates for it. They also benefit from Solrock's unique typing, since they tend to struggle against Psychic- and Flying-types such as Defog Silvally-Psychic and Vespiquen that Solrock has no trouble checking. Falinks can offensively check Swords Dance Silvally-Psychic and Ludicolo variants thanks to First Impression. Offensive Grass- and Water-types such as Silvally-Grass and Basculin can easily pressure Solrock, so bulky Grass-types such as Gourgeist and Roselia are recommended teammates for it. Solrock can also switch into Fire- and Flying-types such as Raboot and Vespiquen for Roselia and Gourgeist. Although Solrock has good Defense, its Special Defense is bad, so special walls such as Dusclops and Type: Null work well as teammates, since both of them can switch fairly well into wallbreakers that pressure Solrock like Ludicolo and Glaceon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 474994, "username": "royesk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 228482, "username": "kt3"}]}], "writtenBy": [{"user_id": 480681, "username": "zS"}]}
  },
  "Claydol": {
    "overview": "<p>Claydol's unique qualities, movepool, and typing allow it to function as an interesting form of role compression on teams. It has access to Stealth Rock and Rapid Spin, making it a solid choice for either a Stealth Rock setter or a defensive spinner, although it cannot threaten most Ghost-types. Its typing and Levitate give it important resistances to Poison-, Psychic-, and Rock-type moves, letting it pivot into these moves from Pokemon such as Weezing, Mesprit, and Aggron, as well as two important immunities to Electric and Ground; these make it a stop to Volt Switch pivots and Pokemon locked into Earthquake in a pinch, as it fares badly against most of them otherwise. However, Claydol is very passive, heavily relying on Toxic to maintain a presence. It is forced to choose between two STAB moves that are exploitable, meaning it can struggle against foes such as Golbat and Togedemaru depending on the move it chooses. Its typing is also a double-edged sword, with weaknesses to Grass, Dark, Water, and Bug, making it easy to exploit by Pokemon such as Tsareena and Absol, and many of the Pokemon it would like to check can run these moves. Claydol also lacks recovery if it forgoes Leftovers, meaning it can be hard to check what it wants to over a long match.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Psychic has solid neutral coverage as Claydol's STAB move, letting it chip Flying-types such as Archeops and Charizard, but makes it harder to threaten Dark-types. Scorching Sands can be chosen as its STAB move due to its ability to spread burns and hit Dark-types, but it loses to Pokemon such as Golbat and Weezing. Teleport allows Claydol to gain momentum against Pokemon it forces out such as Choice-locked Togedemaru. Alternatively, Protect and Leftovers give Claydol more recovery, increase Toxic damage, and scout opposing Choice-locked Pokemon. However, this gives it a worse matchup against Knock Off users such as Absol and Gallade due to the lack of Colbur Berry. The Speed investment is to guarantee outspeeding fully invested base 80s after a Rapid Spin, such as Gallade and Mesprit, crippling them with a Toxic before they can respond. Claydol likes to have defensive support from Pokemon that can handle special attackers like Rotom, Charizard, and Basculin. Lanturn can take hits from all of them and cripple them with Toxic, and Assault Vest Lanturn specifically can soak up general special hits for Claydol. Ferroseed is another option, functioning as a Toxic sponge that can also check Grass- and Water-types. In return, Claydol can reduce the chip damage Lanturn takes with Rapid Spin and deal with Ground-types such as Sandaconda for both of them. Claydol often best fits on more defensive teams due to its lack of recovery, supportive capabilities, and lacking offensive presence; as such, it appreciates the cleric and Wish support Pokemon such as Aromatisse and Audino can give it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Cradily": {"sets": [{"name": "Defensive"}]},
  "Armaldo": {"sets": [{"name": "Utility"}, {"name": "Swift Swim"}]},
  "Absol": {
    "overview": "<p>Absol is a good wallbreaker in the PU metagame thanks to a sky-high Attack stat, a spammable STAB option in Knock Off, and options to boost its Attack in Choice Band and Swords Dance. Access to priority in Sucker Punch, which is especially potent with Swords Dance, makes it harder to revenge kill. Its wide coverage options to hit standard Dark-type checks, like Iron Tail and Close Combat for Aromatisse and Regirock, and an extremely strong STAB Knock Off are its main draws over Sneasel. Unfortunately, Absol's poor bulk, few resistances, and weaknesses to common Fighting- and Bug-type moves in the tier leave it with little defensive utility. This means Absol struggles to get in, and due to its middling Speed tier as well as Sucker Punch potentially being worked around, it often gets forced out.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>The fourth move of choice depends on what Absol wants to deal with. Iron Tail takes care of bulky Fairy-types such as Aromatisse and Silvally-Fairy; however, Psycho Cut lets it 2HKO Weezing after Stealth Rock and does significant damage to Fighting-types like Hitmontop. Justified is run in order to punish Knock Offs from Pokemon such as Audino and Scrafty; however, Super Luck means Psycho Cut will critically hit half of the time. A Jolly nature is chosen to ensure Absol can outspeed Jolly Hitmontop, but an Adamant nature hits harder. Absol has trouble getting onto the field, so slow pivots such as Uxie can remedy this issue. They also help by baiting in Absol's prey, foes such as Rotom and Palossand, making it even easier for Absol to take something down. Fighting-types such as Hitmontop and Scrafty appreciate Absol's ability to weaken Poison- and Fairy-types with its coverage, making it easier for them to sweep. Absol appreciates Fighting-type checks and Pokemon that can pivot into U-turn, such as Aromatisse and Weezing, as they can punish these Pokemon that Absol dislikes.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Iron Tail takes out Fairy-types such as Aromatisse, while Close Combat takes care of Rock-types such as Regirock and Dark-types such as Scrafty. Play Rough can be used as a middle ground to hit Fighting-types such as Gurdurr and Hitmontop on a switch-in while hitting Fairy-types harder than Close Combat, but lacks the higher power of Iron Tail or Close Combat. Life Orb is preferred, but Black Glasses gives better longevity and the ability to bluff a Choice Band set. Justified is run to punish Knock Offs from Pokemon like Uxie. However, Super Luck, when used with Psycho Cut, results in a critical hit half of the time. Sticky Webs support is heavily appreciated due to Absol's middling Speed tier, so setters like Ribombee and Vikavolt are great partners for it. Vikavolt also breaks through physical walls such as Regirock. On bulkier teams, slow pivots such as Lanturn can help Swords Dance Absol wallbreak or sweep a team by slowly wearing down its checks whilst providing setup opportunities. Hazard setters such as Palossand also help Swords Dance Absol by moving many faster threats into the range of a boosted Sucker Punch, like Silvally-Fairy. Offensive sweepers such as Quiver Dance Ribombee appreciate Absol's wallbreaking, as it makes it easier for them to clean late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Walrein": {"sets": [{"name": "Swords Dance"}]},
  "Relicanth": {"sets": [{"name": "Choice Band"}]},
  "Regirock": {
    "overview": "<p>Regirock's incredible physical bulk, typing, and access to Stealth Rock make it a premier physical wall in the tier. It can check a multitude of threats, like Archeops, Sneasel, Togedemaru, and Scyther, giving it multiple opportunities to set Stealth Rock reliably. However, it struggles against common wallbreakers like Gallade and can get overwhelmed rather quickly due to its lack of reliable recovery. Lastly, it suffers from competition from Gigalith, which can switch into threats like Charizard more reliably thanks to Sand Stream giving it better special bulk.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Thanks to its typing and splendid physical bulk, Regirock makes for a sturdy Stealth Rock setter capable of dishing out solid damage thanks to Body Press. The given EV spread allows Regirock to always avoid the 2HKO from Tsareena and Choice Band Aggron, while Clear Body lets it block Parting Shot. Rock Blast allows Regirock to break Substitute and Focus Sash from Pokemon like Rotom-F and lead Archeops, while Stone Edge hits consistently harder. Toxic gives Regirock a way to cripple walls like Palossand and Jellicent, whereas Thunder Wave can be used to cripple more offensive threats such as Whimsicott. Partners that can take on special attackers like Magneton and Magmortar that Regirock struggles against are appreciated. Lanturn stands out as a solid option, being able to further support Regirock with Heal Bell. Answers to Fighting- and Grass-types like Gurdurr and Tsareena are also appreciated; this makes Weezing a stellar partner. Charizard is another great teammate, and it appreciates Regirock checking threats like Archeops.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 434150, "username": "gum"}]}
  },
  "Regice": {"sets": [{"name": "Rock Polish"}, {"name": "RestTalk"}]},
  "Luxray": {"sets": [{"name": "Defensive"}, {"name": "Guts"}]},
  "Vespiquen": {
    "overview": "<p>The following analysis was written in a prior iteration of the PU metagame and as a result does not accurately reflect the current state of the tier, where Vespiquen is considered outclassed and not worth using. This page will be updated later to reflect this.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Heavy-Duty Boots lets Vespiquen circumvent its 4x Stealth Rock weakness, making it a viable option for checking Grass- and Fighting-types like Silvally-Grass, Leafeon, Throh, Falinks, and Hitmontop and as a slow pivot with U-turn. Roost gives Vespiquen a reliable recovery option, and allows for more chances to stall moves like Silvally-Psychic's  Multi-Attack with Pressure. Defog and Pressure pair nicely together, as this means you can PP stall Toxic Spikes and Spikes from Mareanie and Roselia for the entirety of the game. Alternatively, Toxic Spikes cripples foes, while Aromatherapy lets Vespiquen function as a cleric. Vespiquen’s Speed alongside U-turn is excellent for slow pivoting, giving you ample opportunities to bring in wallbreakers. Air Slash makes it easier to defeat Gourgeist-XL that have burned Vespiquen, but Acrobatics is an option to have a strong STAB move if Throh or Leafeon choose to remove Vespiquen's item with Knock Off.</p> <p>Vespiquen fits best on bulky offense and balance teams that can deal with Defog deterrents like Falinks and Pawniard, so Silvally-Electric, Dubwool, Hitmontop, and Throh are excellent teammates, as they not only check Pawniard and act as Knock Off absorbers, the latter two are also Rock-type checks. Palpitoad is very notable as a partner; it resists Rock, checks Pawniard, and handles Fire- and Electric-types like Raboot and Manectric, while Vespiquen checks Grass-types in return. Vespiquen's reliance on Heavy-Duty Boots means it is not optimal to have its item removed by Knock Off unless you are using Acrobatics, so Knock Off absorbers like Rocky Helmet Mawile, Silvally formes, Colbur Berry Musharna, and Throh make it easier for Vespiquen to not be affected by Stealth Rock damage. Strong wallbreakers that can break Rock- and Ice-types, like Falinks, Silvally formes, and Stonjourner, appreciate the safety from slow U-turn pivoting; Vespiquen benefits from the removal of such Pokemon, since it makes it much easier for it to use Defog. Vespiquen does not appreciate Ice-type Pokemon like Mr. Rime, Glaceon, and Lapras; Type: Null, Mr. Rime, Klang, Throh, and Lapras are fine options for mitigating this weakness, using Toxic, pivoting, or phasing them out to deal with them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 331538, "username": "TJ"}, {"user_id": 434150, "username": "Gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 387445, "username": "Musharnanigans"}]}
  },
  "Drifblim": {"sets": [{"name": "Calm Mind"}, {"name": "Defog"}]},
  "Skuntank": {"sets": [{"name": "Nasty Plot"}, {"name": "Defog"}]},
  "Spiritomb": {"sets": [{"name": "Choice Band"}, {"name": "Calm Mind"}]},
  "Lickilicky": {"sets": [{"name": "Specially Defensive"}]},
  "Magmortar": {
    "overview": "<p>Magmortar is an extremely threatening wallbreaker in PU thanks to its incredible coverage and very high Special Attack. These allow it to break through many special walls that aim to check Fire-types such as Regirock and Jellicent. Magmortar also has a decent Speed stat, with a Timid nature allowing it to outspeed base 80 Speed Pokemon such as non-Choice Scarf Mesprit. However, Magmortar is still outrun by many common threats such as Basculin and Silvally. Its merely fine Speed combined with its lacking physical bulk make Magmortar relatively simple to revenge kill compared to Charizard, which has much more long-term potential. Finally, Magmortar is forced to choose between being extremely vulnerable to all entry hazards and giving up a boosting item.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Thunderbolt hits Water- and Flying-types such as Jellicent and Charizard. Focus Blast hits Rock-types such as Gigalith and Regirock as well as Scrafty. The last slot is very customizable depending on your team's needs: Scorching Sands gives Magmortar a better matchup against Lanturn and opposing Magmortar while also being a safer way to hit Rock-types. Taunt prevents recovery from the likes of Jellicent and Scrafty as well as Stealth Rock from setters like Druddigon in a pinch. Toxic is a good source of chip damage versus walls such as Jellicent and Gigalith. Overheat is a powerful nuke for Choice Specs Magmortar. Flame Charge is another option to turn Magmortar into a late-game cleaner, although it should only be run with Heavy-Duty Boots and a Timid nature. Magmortar can switch into a few resisted hits from Pokemon such as Whimsicott and Ribombee, but it is easily worn down and better brought in by pivots such as Lanturn and Rotom. It can also switch into predicted U-turns from Pokemon like Togedemaru and Archeops to fish for burn with Flame Body, although this can be risky. Setup sweepers such as Scrafty and Quiver Dance Ribombee make for great teammates that can effectively exploit Magmortar's breaking power. Magmortar greatly appreciates entry hazard removers if it opts to not run Heavy-Duty Boots: Silvally-Fairy and Rotom are good Defoggers that can also bring Magmortar in via pivoting.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 213583, "username": "Tone"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 355061, "username": "UberSkitty"}]}
  },
  "Leafeon": {"sets": [{"name": "Swords Dance"}, {"name": "Choice"}]},
  "Glaceon": {
    "overview": "<p>The following analysis was written in a prior iteration of the PU metagame and as a result does not accurately reflect the current state of the tier, where Glaceon is considered outclassed and not worth using. This page will be updated later to reflect this.</p> ",
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Glaceon is one of PU's scariest wallbreakers, capable of putting immense pressure on even some of the tier's best special walls in Throh and Type: Null as a result of its sheer power. Freeze-Dry allows Glaceon to threaten Ice-resistant Water-types like Pyukumuku and Corsola, and it's also Glaceon's best option against Lapras. Shadow Ball allows Glaceon to OHKO Galarian Mr. Mime and threaten specially defensive Mr. Rime. It also hits Klang and opposing Glaceon harder than any other move Glaceon can viably run. Water Pulse targets Carkol, though it doesn't have much use outside of that. Frost Breath can allow Glaceon to get past bulky Calm Mind and Cosmic Power users like Musharna and Gothitelle in a pinch, but the move is virtually useless outside of this one purpose and cuts into Glaceon's already limited coverage. A Timid nature can be used to outspeed Adamant Falinks and Choice Band Fraxure as well as Speed tie with offensive Roselia. Glaceon could opt to use Choice Scarf to act as a revenge killer rather than a wallbreaker. Although this allows Glaceon to take care of +1 Adamant Fraxure and circumvent typical offensive checks like Silvally-Grass and Raichu, such a set severely reduces Glaceon's power and faces serious competition from Mr. Rime and Galarian Mr. Mime due to their higher Speed tiers, better coverage, and access to Healing Wish. Glaceon's low Speed and poor defensive typing make it very easy to offensively pressure, so it appreciates having bulky teammates to fall back on in the face of faster Fire-, Fighting-, and Rock-types. Vibrava gives Glaceon an easier time switching in by removing entry hazards with Defog and generating momentum with U-turn. It's worth noting that a lot of Pokemon that Vibrava baits in and pivots out against, like Gloom and Togetic, find themselves easily exploited by Glaceon. Mareanie absorbs Toxic Spikes upon switching in, can wear teams down with its own Toxic Spikes, and also softens up bulky foes that depend on their item, like Type: Null and Lapras, with Knock Off. Although Glaceon is strong, it lacks the coverage to bypass dedicated Ice-type answers such as Munchlax and Klang. Wallbreakers like Mawile, Hitmontop, and Flame Orb Throh help to remedy this issue, and they appreciate Glaceon taking on physical walls like Mareanie, Shiinotic, and Gourgeist-XL. Mawile also provides Stealth Rock support to put further pressure on teams, while Hitmontop removes entry hazards with Rapid Spin. Glaceon has an easier time breaking through teams with Spikes support, essentially 2HKOing Type: Null after Stealth Rock and three layers of Spikes. Roselia is a great Spikes setter, capable of incapacitating foes like Klang with Sleep Powder and making them easier for Glaceon to overwhelm. Pivots like Manectric and Silvally-Bug can give Glaceon more opportunities to switch in, with both examples doubling as late-game sweepers that can exploit the holes that Glaceon leaves in teams earlier on. These pivots can annoy Pokemon like Lapras and Pawniard, while Glaceon can threaten Palpitoad and Carkol.</p> "
      },
      {
        "name": "Cleric",
        "description": "<p>Because of its decent bulk and near-unique access to both Wish and Heal Bell, Glaceon can serve as a cleric for balance teams. Freeze-Dry is used instead of Ice Beam to hit foes like Lapras and Seaking harder. Heavy-Duty Boots prevents Glaceon from being worn down by entry hazards, which allows it to more easily switch around and better preserve the health of it and its teammates. This immunity to entry hazards, alongside Glaceon's higher Special Attack and natural defenses, helps to separate it from Togetic, another cleric that similarly has access to Wish and Heal Bell. Although Glaceon has higher Defense than Special Defense, its poor defensive typing is easily exploited by many of the tier's physical attackers, including Mawile, Falinks, and Silvally-Rock. There are fewer specially offensive Pokemon that can do the same, and opting for a specially defensive set provides defensive teams with a secondary check to threats like Ludicolo and opposing Glaceon. Stunfisk and physically defensive Mawile appreciate having their lack of reliable recovery mitigated by Wish support, and in return, they can absorb Knock Off and check threats that Glaceon is vulnerable to, such as Pawniard and Stonjourner. Pyukumuku can also absorb Knock Off as well as wall setup sweepers like Falinks and Crustle that threaten Glaceon thanks to Unaware. In return, Glaceon can relieve Pyukumuku of any potential status conditions, which is especially useful for Rest variants. Stronger special attackers like Beheeyem and Raichu are capable of overwhelming Glaceon, meaning that it should never be the only special wall on balance teams. Other specially bulky Pokemon such as Type: Null, Dusclops, Vibrava, and Munchlax make for great partners because of this, with Rest allowing all three examples to soak up status conditions for Glaceon as well. Glaceon allows these examples to rely less on Rest by providing them with Wish support. Checks to Fighting-types are useful partners, since they can often switch into Glaceon with ease. Mareanie is a notable example, since it can consistently check Fighting-types thanks to both Recover and Regenerator, further wears teams down through Scald and either Toxic or Toxic Spikes, takes pressure off of Glaceon's team by absorbing Toxic Spikes, and stops setup sweepers like Falinks in their tracks with Haze.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 474994, "username": "royesk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Gallade": {
    "overview": "<p>Gallade makes for a potent wallbreaker with its raw strength, coverage, and decent Speed tier. It does a great job at dismantling slower teams, as it can threaten balance staples with its STAB moves, such as Regirock and Weezing. Gallade is able to distinguish itself from other Fighting-types like Scrafty and Sawk with its immediate power, secondary STAB, and ability to boost with Swords Dance. However, its Speed tier still leaves much to be desired, as it can easily be pressured by offensive Pokemon like Archeops and Charizard. Gallade finds itself competing with other Fighting-type wallbreakers like Scrafty that are weaker initially but have more defensive utility.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Gallade is able to bolster its naturally high Attack with Life Orb to easily muscle past Pokemon like Gigalith without the need for hazards. Swords Dance elevates its power even further, helping net OHKOs on bulky Pokemon like Weezing once boosted, while generally being harder to switch into. It also provides the necessary strength to get past Palossand and Aromatisse. Lum Berry provides more setup opportunities against status users, such as Gigalith and Regirock. Sticky Web support from Pokemon like Ribombee, Galvantula, and Vikavolt allows Gallade to outspeed Pokemon like Silvally-Ghost and Lycanroc. These Sticky Web setters are also able to pivot Gallade into Pokemon such as Gigalith and Togedemaru. Gallade's middling Speed tier makes it rather easy for it to be checked by common Pokemon like Charizard and Silvally-Fairy, so Gallade appreciates having a defensive backbone with Pokemon like Druddigon and Sandaconda to fall back on. Gallade's average bulk can be mitigated with pivots like Togedemaru and Whimsicott to get it in safely on Pokemon like Weezing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "Bandkrook"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Dusknoir": {"sets": [{"name": "Tank"}]},
  "Froslass": {
    "overview": "<p>Froslass makes for a capable wallbreaker thanks to its usable Attack and great Speed tier combined with its unique typing. It also has access to utility moves such as Trick and Spikes, allowing it to cripple and overwhelm its answers; it can even run a dedicated Spikes set, although it becomes much weaker without a boosting item. However, its below average Attack often leaves it over-reliant on its own Spikes to get past defensive behemoths like Regirock, while its typing and bulk leave it easily revenge killed by faster threats such as Lycanroc, Choice Scarf Togedemaru, and Sneasel as well as priority moves like Sucker Punch and Accelrock.</p> ",
    "sets": [
      {"name": "Choice Band", "description": "<p>Triple Axel is a strong, albeit unreliable, STAB move. Icicle Crash is an option, as it's more reliable despite being weaker; it also avoids Rough Skin and Flame Body from the likes of Druddigon and Coalossal. Trick allows Froslass to cripple its answers such as Scrafty and Aromatisse, while Ice Shard allows it to revenge kill foes like Ribombee. Despite seeming odd on a set using a Choice item, Spikes lets Froslass take advantage of the many Pokemon it forces out. Froslass's subpar bulk means it appreciates being brought in via partners like Galarian Articuno and Scyther; The former can also act as a Defog deterrent, and they both appreciate the Spikes Froslass sets. Pokemon like Quiver Dance Ribombee and Dragon Dance Charizard have an easier time cleaning late-game after Froslass has weakened down walls such as Regirock, Aromatisse, and Wishiwashi.</p> "},
      {"name": "Spikes", "description": "<p>Froslass's great Speed and typing make it a potent Spikes setter, as it's capable of pressuring common spinners such as Tsareena. Taunt prevents Pokemon like Miltank from recovering and also allows Froslass to keep its Spikes on the field against Defog users like Silvally-Fairy. Wallbreakers like Magmortar and Archeops greatly appreciate the Spikes Froslass sets, as it gives them an easier time breaking through Gigalith and Regirock, respectively. Pokemon like Regirock, Weezing, and Lanturn can switch into threats such as Lycanroc, Aggron, and Togedemaru that force out Froslass, respectively.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 346653, "username": "avarice"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 434150, "username": "gum"}]}
  },
  "Rotom": {
    "overview": "<p>Rotom is a quite versatile Pokemon thanks to its solid typing both offensively and defensively, great Speed, and decent movepool. These traits allow it to perform well as either a Choice Scarf user or a Defogger. Electric / Ghost is a near unresisted typing, barring Shiftry, all of which can be pivoted out against with Volt Switch. Defensively, Rotom resists or is immune to various common attacks from Pokemon such as Scyther and Sawk, although has to watch out for common coverage moves such as Knock Off. Rotom's Speed allows it to outspeed threatening breakers such as Nasty Plot Mesprit and Vanilluxe and for its Choice Scarf set to outspeed other common Choice Scarf users like Mesprit and Kabutops. There are other Electric- and Ghost-types that give it competition as a Choice Scarf user, such as Togedemaru with its valuable Steel typing, and Haunter with its higher Special Attack alongside support moves such as Destiny Bond; both also have higher speed than Rotom. However, Rotom's unique type combination and access to both Trick and Volt Switch make it a great option over the other two.</p> ",
    "sets": [
      {"name": "Choice Scarf", "description": "<p>Choice Scarf allows Rotom to utilize its solid Speed to outspeed various other Choice Scarf users, such as Kabutops and Mesprit, as well as gain momentum with Volt Switch. While Trick is run to cripple specially defensive Pokemon that may try to switch in on Rotom, such as Lanturn and Gigalith, it can also be used to potentially put a stop to bulky setup Pokemon such as Scrafty and Aromatisse. Rotom is best used as a revenge killer or brought in by slow pivots such as defensive Mesprit and defensive Silvally-Fairy, which furthermore form a solid VoltTurn core with it. Wallbreakers such as Aggron and Vanilluxe benefit from being brought in through Rotom's Volt Switch.</p> "},
      {
        "name": "Defog",
        "description": "<p>Rotom can serve as a solid Defog user with its good matchup against various entry hazard setters such as Mesprit and Palossand. Furthermore, it is able to cripple various other hazard setters such as Gigalith and Druddigon with Will-O-Wisp. Will-O-Wisp also powers up Hex, which should only be run alongside it. Thunderbolt is an option for the last slot if you want to give Rotom more of an offensive presence, although Pain Split is an option to increase Rotom's longevity that pairs well with its low HP stat. Colbur Berry allows for Rotom to better check Fighting-types and other Knock Off users, such as Sawk and Scyther, but Heavy-Duty Boots is a secondary option so it can take no damage from Stealth Rock. While Rotom does have a nice defensive typing, it is recommended to not switch it into attacks too many times, as it is easily worn down with its only okay bulk, especially without Pain Split. Pokemon that are easily worn down by entry hazards, such as Gallade and Uxie, appreciate Rotom's hazard removal.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 355061, "username": "UberSkitty"}]}
  },
  "Rotom-Frost": {
    "overview": "<p>Rotom-F is a moderately fast wallbreaker capable of dishing out major damage thanks to its STAB BoltBeam coverage, further supported by its access to Nasty Plot. Additionally, Rotom-Frost has an excellent support movepool, through featuring Will-O-Wisp, Defog, Pain Split, and Trick. Rotom-F is also able to make use of its wonderful offensive typing as a Defogger to threaten common entry hazard setters such as Druddigon and Sandaconda. However, Rotom-F has a limited offensive movepool outside of its STAB moves, which leaves it completely walled by several common Pokemon in the tier like Lanturn and Togedemaru. On top of this, its poor defensive typing, lack of reliable recovery, and susceptibility to Knock Off give Rotom-F severe longevity issues compared to other entry hazard removers such as Tsareena, Charizard, and Whimsicott. Additionally, Vikavolt is much more useful to many teams as an offensive Electric-type pivot thanks to its higher Special Attack, better coverage, and access to Roost.</p> ",
    "sets": [
      {"name": "Nasty Plot", "description": "<p>With Nasty Plot and Volt Switch, Rotom-F is capable of wearing down common specially defensive tanks such as Gigalith and Aromatisse. Pain Split is an option to replenish HP and punish switch-ins with high HP stats like Lanturn, which can easily switch into boosted Blizzard. Will-O-Wisp, on the other hand, allows Rotom-F to cripple Togedemaru and Gigalith. Offensive partners such as Archeops and Whimsicott make for fine pairings, as they can offensively check common Fighting-types like Scrafty and Gallade while also helping Rotom-F in wearing down Lanturn and Whimsicott, respectively. Archeops also completes a fantastic VoltTurn core thanks to its ability to pivot on bulky Ground- and Grass-types like Sandaconda, Palossand, and Tangela in order to bring in Rotom-F safely.</p> "},
      {"name": "Offensive Defog", "description": "<p>Pain Split provides Rotom-F with the ability to regain HP while chipping bulkier switch-ins like Lanturn, Gigalith, and Miltank. However, Will-O-Wisp is an option for crippling Steel-types like specially defensive Aggron and Togedemaru. Rotom-Frost partners excellently with Lanturn, as it creates a good VoltTurn core and provides a key Fire-type resistance for Pokemon that threaten Rotom-F like Charizard and Magmortar. Additionally, Lanturn enjoys Rotom-F's ability to offensively check Grass-types like Gourgeist and Trevenant. Other wallbreakers that can take advantage of Gigalith, such as Gourgeist-S and Poliwrath, make for good offensive partners.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 467518, "username": "bagoftrixx"}]}
  },
  "Rotom-Fan": {"sets": [{"name": "Nasty Plot"}, {"name": "Utility"}, {"name": "Choice Scarf"}]},
  "Uxie": {
    "overview": "<p>Uxie stands out as a great pivot in PU thanks to its natural Speed, bulk, and support options. Uxie's Speed allows it to pivot out with U-turn before Pokemon like Aggron can otherwise muscle past it. Uxie is able to check weaker physical attackers such as Lycanroc and Archeops and potentially cripple them with Thunder Wave or Knock Off, but it can be worn down due to the lack of reliable recovery. Uxie also faces heavy competition from Mesprit, which offers more utility in Healing Wish and is less vulnerable to bulky setup sweepers like Scrafty and Sandaconda.</p> ",
    "sets": [
      {
        "name": "Defensive Stealth Rock",
        "description": "<p>Uxie is able to consistently set Stealth Rock with its natural bulk and pivot against entry hazard removers that it cannot do much to like Claydol and Silvally-Steel. Knock Off is helpful for crippling other passive Pokemon like Gigalith and Aromatisse. Alternatively, Thunder Wave is a great tool for stopping setup sweepers that do not mind Psychic such as Mesprit and Silvally-Fairy, while also targeting Defoggers like Charizard that force Uxie out. Memento is also an option to support frailer setup sweepers such as Ribombee and Absol. Colbur Berry allows Uxie to stay in against opposing Knock Off users like Absol and hinder it with Thunder Wave or pivot out and get some chip damage. Leftovers is another option to let Uxie stay healthy, as it has no consistent recovery of its own. While Uxie's bulk is well-rounded, it can struggle with stronger special attackers like Ribombee and Charizard due to the lack of Special Defense investment. Specially defensive Pokemon such as Silvally-Steel and Lanturn can help cover for Uxie so it will not be overwhelmed by these special attackers. Uxie is able to take advantage of U-turn to get wallbreakers like Absol and Aggron in safely or form pivot cores with Pokemon such as Passimian and Rotom. Aromatisse helps Uxie against Dark-types like Absol and Scrafty and can provide Wish support and Uxie can pressure Weezing in return.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Mesprit": {
    "overview": "<p>Mesprit stands out as by far the most versatile Pokemon in PU thanks to its solid stat distribution, excellent ability in Levitate, and wide support movepool with moves such as U-turn, Healing Wish, Trick, Nasty Plot, and Stealth Rock. Mesprit is extremely good at role compression and can fulfill a variety of different needs for your team, although its counters rarely differ too much based on the set. While Mesprit is a solid wallbreaker and has the speed to beat out slower offensive and defensive staples like Tsareena and Weezing, it's still outpaced by a large portion of the metagame. Combined with a lack of any reliable recovery, this gives Mesprit extreme longevity issues, particularly Choice Scarf sets, which will rarely outspeed any other boosted Pokemon. Furthermore, Mesprit's special coverage can be lacking at times, as Mesprit can struggle against Steel-types such as Aggron and Togedemaru. Ultimately Mesprit's role compression can be very useful for covering weaknesses, but Mesprit will never be the best at any one role it attempts to cover.</p> ",
    "sets": [
      {"name": "Choice Scarf", "description": "<p>Choice Scarf lets Mesprit revenge kill Pokemon such as Sneasel and +1 Dragon Dance Scrafty. Many different teammates appreciate Healing Wish support from Mesprit, from recovery-lacking wallbreakers like Magmortar to sweepers looking to set up twice such as Dragon Dance Scrafty. However, Trick can be run in this slot instead to cripple bulky Pokemon that otherwise wall Mesprit such as Jellicent and check bulky setup sweepers such as Cosmic Power Claydol. Mesprit rarely has opportunities to guarantee a safe switch in and needs to be brought in when a teammate has been KOed, via good predictions, or using pivoting. Slow pivots such as Silvally-Fairy and Lanturn are great options to safely bring Mesprit in and form a VoltTurn core. This will ideally be supplemented with a strong wallbreaker such as Sneasel or Trevenant ready to be brought in on a convenient pivot to do some damage.</p> "},
      {
        "name": "Nasty Plot",
        "description": "<p>Nasty Plot turns Mesprit into a fairly powerful wallbreaker, being able to 2HKO most of the tier after a single boost. The last moveslot is fairly customizable; Shadow Ball is Mesprit's best move for Steel-types like Togedemaru and Galarian Stunfisk, but Thunderbolt is an effective way to threaten Flying- and Water-types like Charizard and Jellicent before Mesprit sets up. Colbur Berry is the preferred item, as it makes Mesprit harder to revenge kill with Dark-types like Sneasel and Absol and fare better against Fighting-types like Gallade and Gurdurr. Life Orb is a more powerful item that might even remove the need for Mesprit to set up, but the lack of longevity is such that Mesprit is unlikely to have many chances to wallbreak. A Timid nature allows Mesprit to outspeed Modest Magmortar and Jolly Tsareena among other threats, but Modest can be run for more damage output. Tsareena is a good partner because it can use U-turn to bring Mesprit in for easy setup opportunities on Pokemon such as Weezing. Due to Mesprit's lack of longevity, it often pairs well with a secondary wallbreaker like Magmortar or Archeops to keep up offensive pressure after Mesprit has been KOed. Sweepers and cleaners such as Ribombee and Lycanroc can make good use of Mesprit's wallbreaking to clean up the opposing team.</p> "
      },
      {
        "name": "Offensive Stealth Rock",
        "description": "<p>Mesprit's final moveslot is largely dependent on how badly you want Healing Wish on your team. U-turn is far more useful for keeping up momentum and preventing Mesprit from becoming too predictable, but Healing Wish can be an effective way to supplement setup sweepers such as Dragon Dance Charizard. Mesprit's best qualities are its good speed for a Stealth Rock setter and favorable matchup against several entry hazard removers such as Golbat and Hitmontop. Despite this set's lack of defensive investment, having few weaknesses means it often has the time to set up Stealth Rock and fire off multiple attacks. Few weaknesses and access to U-turn allow Mesprit to keep up momentum in a way few Stealth Rock users can, making it an ideal pick for more offensive teams. Its inability to deal much damage to special walls or Steel-types means that wallbreakers such as Trevenant and Charizard make for good partners. Mesprit appreciates Pokemon that can punish U-turn, such as Rocky Helmet Druddigon and Coalossal, which can discourage Pokemon like Togedemaru from freely pivoting versus Mesprit. Mesprit can also opt for a more defensively oriented spread that runs both U-turn and Healing Wish while foregoing Dazzling Gleam. However, this set runs into competition from Uxie, which is both faster and bulkier than Mesprit at the cost of being mildly less threatening due to its lower offenses and inability to bluff more threatening sets.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Shadow Ball is Mesprit's best way to hit Steel- and Psychic-types, U-turn eases Mesprit's reliance on predictions while gaining momentum in the process, and Trick can cripple switch-ins such as Articuno and Galarian Stunfisk. Choice Specs Mesprit is extremely prediction reliant, so having at least one of U-turn and Trick can be vital for a safer option that does not leave Mesprit Choice locked into an exploitable attack. Even with Dazzling Gleam, Dark-types greatly hinder Mesprit's ability to freely spam Psychic, so a solid Dark-type answer such as Silvally-Fairy or Aromatisse is important. Mesprit is not the strongest wallbreaker around, so entry hazard setters such as Froslass and Regirock are advised to supplement its damage output. Weaker or non-boosting cleaners such as Dragon Dance Charizard and Tsareena are ideal Pokemon to make use of Mesprit's wallbreaking. Mesprit will also require a solid defensive core with blanket checks such as Palossand, Jellicent, and Weezing ready to cover the wide variety of threats capable of revenge killing Mesprit after minimal chip damage.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 202117, "username": "MZ"}]}
  },
  "Stoutland": {"sets": [{"name": "Choice Band"}]},
  "Liepard": {"sets": [{"name": "Breaker"}, {"name": "Nasty Plot"}, {"name": "Utility"}]},
  "Musharna": {"sets": [{"name": "Calm Mind"}, {"name": "Future Sight"}]},
  "Unfezant": {"sets": [{"name": "Defog"}, {"name": "Choice Scarf"}]},
  "Gigalith": {
    "overview": "<p>Gigalith’s excellent natural bulk in tandem with Sand Stream allows it to act as one of PU’s most wisely useful Pokemon. Its typing allows it to resist common threats such as Galarian Articuno, Scyther, and Charizard, and, with base 135 attack it is by no means passive. However, Gigalith has no means of recovery outside of Leftovers and is prone to being worn down. Its pure Rock typing can be a detriment at times, as Pokemon such as Hitmontop and Tsareena can come in on it for free and proceed to remove Gigalith’s hazards while threatening it out with their STAB moves.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Stone Edge can be run over Rock Blast for more immediate damage, but its low PP and accuracy make it unreliable at times. Earthquake prevents Pokemon like Togedemaru and Aggron from taking advantage of Gigalith. Protect is used to scout for Choice-locked Pokemon such as Trevenant and Togedemaru, as well as to gain additional Leftovers recovery and rack up residual Sandstorm damage. Toxic can be run to cripple Pokemon such as Whimsicott and punish safe switch-ins such as Regirock and Palossand, which would otherwise come in on it for free. Gigalith should be paired with team members that can deal with Water-, Grass-, or Fighting-types, such as Lanturn, Ferroseed, and Weezing. Lanturn is also able to support Gigalith with Heal Bell, allowing it to better check Pokemon like Charizard that commonly run Toxic, while Ferroseed can cripple switchins like Charizard with Knock Off while giving Gigalith switch-in opportunities. Other teammates such as Scyther and Whimsicott appreciate Gigalith’s ability to handle Fire- and Flying-types, and Whimsicott also deals with the Water- and Ground-types that give Gigalith trouble.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 488506, "username": "sovietsympathizer"}]}
  },
  "Swoobat": {
    "sets": [
      {
        "name": "SubSalac",
        "description": "<p>Swoobat finds a niche in PU as a late-game sweeper, utilizing its ability in Simple and access to Substitute to acquire boosts from Calm Mind and Salac Berry to empower its Stored Power. Substitute provides Swoobat with an opportunity to set up multiple Calm Minds, letting it avoid status such as Toxic from Klinklang and helping it activate its Salac Berry. Stored Power utilizes the boosts from Calm Mind and Salac Berry and allows Swoobat to break through specially defensive walls such as Type: Null, Lickilicky, and Unaware Pyukumuku. Heat Wave serves as coverage for Steel- and Dark-types such as Klinklang, Mawile, and Pawniard. Alternatively, Roost provides Swoobat with recovery, letting it set up multiple Substitutes. Nasty Plot is a notable mention over Calm Mind, providing Swoobat with immediate wallbreaking power at the cost of not improving its special bulk, giving it worse matchups against threats like Shadow Ball Beheeyem and Calm Mind Drifblim. Thanks to Simple, Salac Berry provides Swoobat with a +2 boost to Speed, helping it outspeed offensive checks such as Choice Scarf Manectric and Golduck. As an alternative, Kee Berry boosts Swoobat's Defense, making it harder to revenge kill with priority moves like Pawniard's Sucker Punch and Falinks's First Impression.</p> <p>Swoobat is mainly found on offensive teams that can weaken its checks and enable it to set up and sweep. Pairing Swoobat with Fighting-types such as Throh, Falinks, and Hitmonchan is ideal, since they provide a check to Steel- and Dark-types like Klinklang and Pawniard, especially if Swoobat is not running Heat Wave. Furthermore, they can threaten specially defensive walls like Type: Null and Lickilicky, two foes that can pressure Swoobat with Shadow Claw and Knock Off, respectively. Swoobat is susceptible to priority Shadow Sneak from Gourgeist and Dusknoir, so answers to them like Unfezant and Morpeko make for good partners. Pivots such as Boltund, Golduck, and the aforementioned Morpeko can bring Swoobat safely into battle and provide it with more setup opportunities, with Morpeko also providing Parting Shot support. Memento support from Alolan Dugtrio is valuable, weakening a foe and letting Swoobat set up safely. Fellow special attackers like Lilligant and Glaceon can cripple and weaken shared checks like Klinklang and Type: Null, helping Swoobat clean late-game. Physically defensive walls like Stunfisk and Sandslash complement Swoobat by serving as checks to revenge killers like Choice Scarf Unfezant and Boltund while setting up entry hazards to wear down opposing foes; in return, they appreciate Swoobat setting up and threatening their checks like Appletun, Lilligant, and Golduck. The aforementioned Sandslash as well as Defog users such as Drifblim and Silvally-Rock can help remove Stealth Rock, keeping Swoobat healthy to enable more setup opportunities.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 346653, "username": "avarice"}, {"user_id": 213583, "username": "TONE"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Audino": {"sets": [{"name": "Wish"}]},
  "Gurdurr": {
    "overview": "<p>Gurdurr is able to solidify itself in SS PU as a consistent Defogger with fair bulk. It is able to cripple all entry hazard setters with Knock Off or Drain Punch, which is particularly effective against Gigalith and Regirock. Gurdurr's reasonable bulk allows it to check a fair amount of Pokemon in the tier in a pinch too. However, Gurdurr still finds itself overwhelmed by common special attackers like Whimsicott and Charizard. It also competes with Hitmontop as an entry hazard remover; Gurdurr is more bulky, but Hitmontop is more offensive and has better coverage options.</p> ",
    "sets": [
      {
        "name": "Defog",
        "description": "<p>Gurdurr is able to 2HKO Archeops with Drain Punch and avoid being 2HKOed by Magmortar due to the recovery. It can absorb Scalds from Pokemon like Lanturn without worry thanks to Guts. Knock Off hits Psychic-types like Mesprit and Galarian Articuno and wears down Weezing. Rock Slide allows Gurdurr to nail Flying-types such as Charizard, Vikavolt, and Scyther on the switch. Mach Punch picks off weakened Pokemon like Kabutops and Choice Scarf Togedemaru. This works especially well when running Bulk Up over Defog, but it is hard to justify over Scrafty. Toxic wears down Pokemon it cannot threaten, like Silvally-Fairy and Palossand. Defensively, Gurdurr has solid synergy with Regirock and Gigalith, as they can consistently switch into Flying-types like Charizard and appreciate Gurdurr removing Spikes and absorbing status. Charizard checks Ribombee and Whimsicott for Gurdurr. Silvally-Fairy and Aromatisse are able to absorb Knock Off so Gurdurr can keep its Eviolite, and they appreciate it wearing down bulky Poison-types in return. Aromatisse provides Wish support too. Bulky Ghost-types such as Cofagrigus and Palossand are not very bothered by Knock Off, making wallbreakers like Haunter useful. Haunter and other special wallbreakers appreciate Gurdurr checking Gigalith and keeping Stealth Rock off the field in return.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 11407, "username": "2xTheTap"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Throh": {"sets": [{"name": "RestTalk"}, {"name": "Flame Orb Attacker"}, {"name": "Substitute + Bulk Up"}]},
  "Sawk": {
    "overview": "<p>Among the myriad of Fighting-types in PU, Sawk tries to stand out thanks to its above average Speed tier that allows it to overcome certain threats of the tier such as Gallade, Mesprit, and Magmortar. Sawk also has very good coverage, its movepool including moves like Knock Off, Poison Jab, Stone Edge, and Earthquake which, coupled with its access to Mold Breaker allow it to defeat the most common switch-ins to other Fighting-types, such as Weezing, Charizard, and Whimsicott. Sawk is very frail though, but this problem can be handled thanks to its ability Sturdy, allowing it to survive a hit from full HP and retaliate, making it a dangerous threat to offensive archetypes. However, it has no real defensive utility, and nothing in its movepool pushes it over the edge, so Fighting-types such as Gallade and Hitmontop are often preferred over it.</p> ",
    "sets": [
      {
        "name": "Choice Attacker",
        "description": "<p>This set makes switching into Sawk's Close Combat a really difficult task that only a few pokemon such as Aromatisse, Uxie, and Weezing can afford to accomplish. But Sawk's coverage makes up for that problem: Earthquake, paired with its ability Mold Breaker allows it to beat Weezing with Earthquake and eases prediction against Rotom, while Knock Off is good for getting rid of items, as well as hitting Psychic- and Ghost-types such as Mesprit, Uxie, and Gourgeist-S. Poison Jab rounds off the set, hitting Fairy-types such as Aromatisse and Ribombee super effectively. Sawk greatly appreciates teammates that are capable of bringing it in against Pokemon like Gigalith, Regirock, and Aggron with pivoting moves, such as Archeops, Togedemaru, and Scyther. Cleaners such as Ribombee really appreciate Sawk's ability to get rid of their counters such as Regirock, Gigalith, and Weezing, and Ribombee can also set up Sticky Web, making Sawk a lot harder to revenge kill. However, if Sticky Web is not set up, Sawk is super easy to revenge kill and needs a strong defensive core to back it up. Therefore, hazard setters like Weezing and Gigalith also make for good partners, improving Sawk’s wallbreaking potential.</p> "
      },
      {"name": "Sturdy Boots", "description": "<p>This set makes good use of Sawk's Sturdy ability and Heavy-Duty Boots keeping it intact. Knock Off is its main coverage option, allowing it to deal good damage to Ghost- and Psychic-types such as Jellicent, Mesprit, and Claydol. Knock Off can also make Sawk a lot harder to revenge kill by getting rid of Choice Scarf from Pokémon such as Mesprit. Poison Jab hits Fairy-types such as Silvally-Fairy and Ribombee super effectively, and Earthquake deals good damage to Neutralizing Gas Weezing and Lanturn. This Sawk set works particularly well on offensive teams thanks to its ability to stop sweeps, as it is able to revenge kill a lot of threats such as Scrafty, Lycanroc, and Silvally-Steel. Cleaners such as Ribombee and Silvally-Ghost really appreciate Sawk's ability to wear down their checks such as Golbat, Sandaconda, and Weezing.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 480681, "username": "zS"}]}
  },
  "Whimsicott": {
    "overview": "<p>Whimsicott is a very versatile Pokemon; its good offensive Fairy typing and immaculate Speed tier let it revenge kill Pokemon such as Scrafty and Swords Dance Gallade, and it has a defensive presence with its great typing, Prankster, and ability to annoy opposing Pokemon with status moves. It is difficult to play around due to the unpredictability that comes with the great variety of sets it can run and its Speed. However, Whimsicott lacks the Special Attack and coverage to deal much damage. This makes it rely on utility and status moves to disrupt foes. It also lacks great defensive stats to constantly check threats such as Regirock.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>U-turn is used to get Whimsicott out of bad matchups, especially after using Switcheroo, when its power is lower. Psychic hits Poison-types very hard, doing massive amounts of damage to Weezing and Golbat, while being a reliable way to hit Fire-types neutrally. Hurricane hits Fire-types harder, 2HKOing Centiskorch and usually 2HKOing offensive Charizard, but is much less reliable than Psychic. Switcheroo is used to disrupt defensive cores, as Whimsicott can force in a Pokemon such as Charizard or Togedemaru that would otherwise wall it and limit the Pokemon's counterplay by giving it Choice Specs. Pixie Plate is an alternative to Choice Specs that sacrifices strength for flexibility, making prediction less of a factor. Whimsicott offensively pairs well with Pokemon that break Fire- and Steel-types, most notably Fighting-type Pokemon that can run Rock-type coverage such as Hitmontop and Sawk. Defensively, it appreciates support from Steel-types such as Aggron and Togedemaru to switch into Poison-, Flying-, and Ice-type moves, as well as a bulky Water-types such as Jellicent and Lanturn to handle Fire- and Steel-types. With U-turn, Whimsicott can form a solid VoltTurn core with the latter partner.</p> "
      },
      {"name": "Utility", "description": "<p>Knock Off allows Whimsicott to remove important items such as Leftovers and Heavy-Duty Boots from defensive Pokemon such as Aromatisse and Charizard, making them much less effective at checking offensive threats, while Prankster Encore deals with offensive Pokemon such as Silvally-Ghost and Frosmoth by locking them into a setup move. U-turn is a crucial move for this set, allowing Whimsicott to let wallbreakers such as Lycanroc and Aggron in on its answers like Charizard and Togedemaru, respectively. Stun Spore provides speed control against fast Pokemon such as Ribombee on the switch so that Pokemon such as Scrafty can sweep much more easily. Leech Seed gives Whimsicott a form of recovery, allowing it to exploit defensive Pokemon to increase its longevity. Whimsicott pairs very well with Pokemon that like its usual Steel-, Fire-, and Flying-type switch-ins crippled, such as Frosmoth and Scyther.</p> "},
      {
        "name": "SubSeed",
        "description": "<p>This set uses Prankster to its fullest potential, catching opposing Pokemon with a Leech Seed and then using Substitute before they can act. The combination of Leftovers and Leech Seed recovery almost makes up for the HP loss of using Substitute every turn, slowly draining the opposing Pokemon's HP until it's in range of a Moonblast. Psychic can be used to annoy Poison-types that can easily break its Substitute, while Knock Off is used to disrupt defensive Pokemon with recovery that can stall Leech Seed. Encore can be used to prevent setup Pokemon such as Ribombee from taking advantage of this set's passive nature while also stalling out the recovery of defensive Pokemon such as Palossand. This set struggles most against Grass-types such as Tangela and Ferroseed, and Whimsicott must be wary of moves such as Dual Wingbeat from Archeops and Scyther that both break its Substitute and damage it. Defensively, Whimsicott needs Pokemon such as Aggron and Stunfisk-Galar that can tank hits from Pokemon that can get past its Substitute, and these teammates can also benefit from the passive recovery that Leech Seed gives them. It also benefits from Flying- and Fire-types such as Charizard and Magmortar that deal with the Grass-types it struggles against.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 292388, "username": "Meri Berry"}]}
  },
  "Lilligant": {
    "overview": "<p>Despite being seemingly outclassed by Ribombee as a Quiver Dance sweeper, two things set Lilligant apart: Sleep Powder and Nature Power. Sleep Powder allows Lilligant to safely set up against slower Pokemon that would otherwise beat it like Weezing and Togedemaru. The second is Nature Power, which transforms into Tri Attack under normal circumstances, giving Lilligant a strong attack to break past many Grass-resistant Pokemon like Charizard and Druddigon more easily, and Nature Power is easier to run on Lilligant than Ribombee due to the latter's need for Aromatherapy and Roost. This, combined with Lilligant not being forced to run Heavy-Duty Boots, lets it serve as a solid sweeper. However, Lilligant can be wildly inconsistent, as it relies on sleep turns to break past many of its switch-ins. Its lack of coverage also leaves it walled by Steel-types such as Togedemaru, which is troublesome if it does not get adequate Sleep turns or if Lilligant has already put a foe to sleep. Without a Speed boost, it is easily revenge killed by Pokemon like Silvally-Ghost, and even at +1, it is outsped by Choice Scarf Togedemaru and has to play a guessing game versus Ninjask. Finally, Lilligant's paltry bulk belies its decent defensive typing, and as such, Lilligant provides less defensive utility compared to other sweepers like Ribombee.</p> ",
    "sets": [
      {
        "name": "Quiver Dance",
        "description": "<p>Giga Drain is a decently powerful STAB move that heals chip damage Lilligant tends to take from entry hazards, sand, and weak attacks. Petal Dance, when combined with Own Tempo, gives Lilligant more power in exchange for giving it less sustainability. Chlorophyll bolsters Lilligant's matchup against sun teams, which are uncommon but can be annoying to deal with offensively. Lilligant dislikes opposing Steel-types such as Ferroseed and Perrserker; Togedemaru in particular is troublesome due to its access to consistent recovery, ability to pivot into an offense check, and propensity to cripple Lilligant with Toxic, so Pokemon that can break past them such as Charizard and Hitmontop are appreciated teammates. Ribombee also makes for an excellent partner, as together they can wear down each other's checks, such as Centiskorch, and open up sweeping opportunities for each other. Lilligant can hit a shared check with Sleep Powder, while Ribombee can heal annoying status from Togedemaru and Regirock with Aromatherapy. Entry hazard support from Pokemon like Froslass can help wear down Lilligant's switch-ins.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Basculin": {
    "overview": "<p>Utilizing Adaptability and its good Speed tier, Basculin is a good offensive threat in the metagame, being able to function as both a strong physical and special wallbreaker and outspeeds common offensive threats such as the Silvally formes. Unfortunately, the tier is full of common Water immunities such as Toxicroak and Heliolisk, which prevent Basculin from spamming its STAB moves frequently; outside of using its STAB moves, Basculin lacks in damage output. While it takes a bit of support to use, once the Water immunities are dealt with, Basculin can use its high damage output to wallbreak efficiently.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>Superpower is Basculin's preferred coverage option in order to deal with certain Water-resistant and Water-immune Pokemon like Heliolisk and Guzzlord. Psychic Fangs is used to hit Toxicroak and Qwilfish, two Pokemon that otherwise wall Basculin, but Aqua Jet can instead be used to revenge kill faster threats such as Archeops. Ice Beam is another alternative to hit opposing Grass-types like Tangela and Alolan Exeggutor. Basculin appreciates partners that are able to deal with Jellicent, which shuts down Basculin. Heliolisk is a great example, and it appreciates Basculin's ability to deal with special walls like Gigalith and Assault Vest Guzzlord. Basculin also struggles with Pokemon like Toxicroak and Tangela depending on what coverage move it opts to use, so teammates like Charizard and Garbodor are greatly appreciated. Basculin welcomes entry hazard support from Pokemon like Ferroseed and Mesprit, which enables it to increase its wallbreaking capabilities. Mesprit, in addition to the aforementioned Heliolisk, can also form a VoltTurn core with Basculin, giving Basculin additional opportunities to come onto the field safely. Mesprit in particular also offers Healing Wish support to increase Basculin's longevity.</p> "
      },
      {"name": "Choice Specs", "description": "<p>Ice Beam is Basculin's best coverage option, allowing it to hit opposing Dragon- and Grass-type Pokemon such as Silvally-Dragon and Tsareena, as well as certain Water-immune Pokemon like Toxicroak and Heliolisk for good damage. Flip Turn lets Basculin get free damage on its incoming switch-ins like Lanturn while maintaining offensive momentum, which helps its teammates. Toxic is essential to cripple Jellicent and Lanturn. However, locking into Toxic has its drawbacks of forcing Basculin out versus Steel- and Poison-types like Togedemaru and Toxicroak. Defensive partners like Assault Vest Guzzlord are nice to handle the strong Electric-types in the tier like Heliolisk and Rotom, and it punishes incoming switch-ins with Knock Off chip damage, which is vital for Basculin to secure KOs.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 444224, "username": "Juno"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "martha"}]}], "writtenBy": [{"user_id": 307004, "username": "Toy Time King"}]}
  },
  "Krokorok": {"sets": [{"name": "Stealth Rock"}]},
  "Crustle": {"sets": [{"name": "Shell Smash"}, {"name": "Lead"}]},
  "Scrafty": {
    "overview": "<p>Scrafty can be run as an either bulky or fast setup sweeper, sporting both Bulk Up and Dragon Dance. Its solid bulk and defensive typing give it various opportunities to switch in against and set up on Pokemon such as Weezing and Palossand. However, this same typing also gives it weaknesses to common types such as Fairy and Fighting, which are often run as coverage on Pokemon Scrafty wants to check such as Mesprit and Absol. Scrafty's typing also has its ups and downs offensively, as it is able to hit most of the tier neutrally, but Fairy-types such as Aromatisse and Silvally-Fairy completely wall it if it is not running coverage. While Scrafty's defenses are good, its Attack is underwhelming without boosts and its Speed is very mediocre, with it still being outsped even at +1 by Pokemon such as Ribombee and Whimsicott.</p> ",
    "sets": [
      {"name": "Bulk Up", "description": "<p>This set allows Scrafty to serve as a special sponge that can soft check special attackers such as Rotom, which it can use as setup fodder. This pairs well with Bulk Up because, after setting up, Scrafty can take both physical and special hits, ideally allowing it to slowly break through the opponent's remaining Pokemon. This is furthered by its combination of Rest and Shed Skin, which makes Scrafty harder to wear down and cripple with status conditions, although Shed Skin can be unreliable at times. Drain Punch also helps keep Scrafty healthy, while Knock Off does decent damage while crippling Pokemon that may depend on their items such as Ribombee and Whimsicott. Scrafty prefers to start setting up after threats to it such as Whimsicott and Aromatisse have been taken out, so Pokemon that can help against those such as Uxie, Togedemaru, and Rotom make for good teammates.</p> "},
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance gives Scrafty a greater offensive presence, with Moxie giving it an easier time sweeping and maximum Speed with a Jolly nature allowing it to outspeed base 110 Speed Pokemon after one Dragon Dance. Close Combat serves as its powerful STAB move, although High Jump Kick is slightly more powerful and has no defense drops in exchange for considerably more risk. Iron Head hits Fairy-types like Silvally-Fairy and Aromatisse. Lum Berry gives Scrafty one-time protection from status conditions that would otherwise make it much harder to sweep, but Chople Berry can instead be used to take moves such as Mach Punch from Hitmontop, and ease setup against Body Press users such as Regirock. Shed Skin can be run if using a Chople Berry so Scrafty can still set up against status inflicting Pokemon like Jellicent. Good teammates are Pokemon that can help against faster threats such as Ribombee and priority users like the previously mentioned Hitmontop. Both Togedemaru and Silvally-Fairy make for good teammates, as they can check these threats and bring Scrafty onto the field with their respective pivoting moves. Wallbreakers like Magmortar and Vikavolt can weaken bulky Pokemon such as Weezing and Aromatisse, making it easier for Scrafty to clean up the match.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213583, "username": "TONE"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 355061, "username": "UberSkitty"}]}
  },
  "Cofagrigus": {
    "overview": "<p>Cofagrigus sets itself apart from other Ghost-types through its useful supportive and defensive capabilities. Because of its access to Toxic Spikes, Cofagrigus can aid its teammates by wearing down their checks while doing the same to its own checks, such as Palossand and Jellicent. Its Ghost typing and bulk are useful for denying Rapid Spin from Pokemon such as Tsareena and Hitmontop, and Iron Defense + Body Press pressures these Pokemon further, notably OHKOing Alolan Sandslash. This combination of moves is also useful late-game once Cofagrigus's checks have been worn down, making it a valuable asset throughout a game. However, Cofagrigus has a serious lack of reliable recovery and is forced to rely on Rest, rendering it setup fodder for Pokemon such as Nasty Plot Mesprit and Quiver Dance Ribombee. It also has lackluster Special Defense, which lets wallbreakers such as Vikavolt and Magmortar easily pierce through it.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Shadow Ball is an interesting alternative over Toxic Spikes to hit Ghost-types, which otherwise wall Cofagrigus. Notably, this includes Rotom, Heavy-Duty Boots Froslass, and opposing Cofagrigus, which are not heavily impacted by Toxic Spikes. However, the supportive capabilities of Toxic Spikes are generally preferred due to these Pokemon being uncommon, and Toxic Spikes is more useful during the early- and mid-game stages. Despite Chesto Berry usually being run to give Cofagrigus a one-time instant recovery option alongside Rest, running no item makes it harder to pressure with Poltergeist and Knock Off users such as Froslass, Gourgeist-S, and Absol. The Speed investment lets it outspeed Galarian Stunfisk, and the remaining EVs combined with a Bold nature bolster Cofagrigus's physical bulk, which improves its durability and the damage output of Body Press. Alternatively, a specially defensive spread of 248 HP / 240 SpD / 20 Spe with a Calm nature allows it to take special hits better at the cost of its physical bulk and attacking power. Cofagrigus should be paired with Pokemon that can cover for it against special attackers; these include blanket special walls such as Gigalith and Lanturn. These examples also benefit from Toxic Spikes pressuring checks like Jellicent and Quagsire. Offensive partners such as Tsareena and Choice Scarf Togedemaru appreciate Cofagrigus's Toxic Spikes, and, in return, both can safely pivot into Cofagrigus. Tsareena can also remove entry hazards on its side and Heavy-Duty Boots from foes for Cofagrigus with Rapid Spin and Knock Off, respectively. Cofagrigus also appreciates Pokemon that can threaten grounded Poison-types, as they remove Toxic Spikes; this includes Charizard, Mesprit, and Sandaconda.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 400292, "username": "asa"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Carracosta": {"sets": [{"name": "Shell Smash"}]},
  "Archeops": {
    "overview": "<p>Archeops is a very threatening Pokemon in the PU tier thanks to its fantastic offensive stats, vivid movepool, and great Speed tier. Earthquake and Stone Edge give Archeops near-perfect coverage that leaves its switch-ins restricted to a marginal few, such as Claydol, Palossand, and Regirock. Archeops also has a decent defensive typing, allowing it to check foes like Charizard in a pinch; however, it is held back by its poor defensive stats. It doesn't want to be the sole defensive switch-in to any foe, preferring to pivot in on resisted attacks such as Centiskorch's Fire Lash. Defeatist is a dreadful ability that basically makes Archeops useless if it drops below 50%, further hindering its ability to hard switch into foes like Scyther well and making it very dependent on both Heavy-Duty Boots and Roost.</p> ",
    "sets": [
      {
        "name": "Heavy-Duty Boots",
        "description": "<p>U-turn is the preferred option in the third slot to generate momentum against foes like Palossand. Dual Wingbeat is an option that lets Archeops OHKO Sturdy Sawk and revenge kill other Grass- and Fighting-types, like Tsareena and Gallade, more reliably. Roost is necessary to offset HP loss that activates Defeatist. Heavy-Duty Boots is another important tool that prevents Archeops's Stealth Rock weakness from wearing it down into Defeatist range. Archeops fits best on offensive teams, and it should primarily be brought in via safe switches in to wallbreak or revenge kill threats such as Galarian Articuno and Magmortar, as its lack of defensive utility prevents it from getting many free turns otherwise. For this reason, partners with pivoting moves like Ribombee and Whimsicott work well with Archeops, and they form a pivot core if Archeops is using U-turn. Lanturn is another partner that can bring Archeops in safely, and it can absorb both Water- and Electric-type attacks aimed at Archeops as well as provide an additional check to Togedemaru. Froslass can help pressure many of Archeops's checks, like Palossand and Rhydon thanks to its access to Spikes, notably bringing walls like Jellicent into 2HKO range of Stone Edge. Pokemon like Sneasel and Choice Specs Ribombee are problematic foes for Archeops, as they are faster and threaten to KO it, so Ferroseed and Choice Scarf Togedemaru can help pressure them.</p> "
      },
      {
        "name": "Suicide Lead",
        "description": "<p>Archeops is a good Stealth Rock setter on hyper offense teams. Its high Speed tier lets it block opposing entry hazard setters with Taunt, and it can KO itself with Head Smash to bring a teammate in safely and prevent Rapid Spin and Defog from removing its hazards. Focus Sash ensures that it can almost always set Stealth Rock; however, once it is brought into Defeatist range, there isn't too much value in preserving Archeops. Archeops can pretty much support every offensive threat in the tier, and it should almost always be the lead on the hyper offense teams it is used on. Nasty Plot Mesprit and Swords Dance Silvally-Fairy are offensive threats that appreciate the support Archeops provides. Galarian Articuno can punish Defog attempts with Competitive, letting it become more dangerous even if Stealth Rock gets removed. Offensive checks to Sneasel such as Ribombee are helpful because it can prevent Stealth Rock from being set with Triple Axel, assuming it lands two hits. Many of the aforementioned Pokemon can also bring Archeops in safely with U-turn to find opportunities to set Stealth Rock if it was unable to earlier on.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 344575, "username": "Twilight"}]}
  },
  "Cinccino": {"sets": [{"name": "All Out Attacker"}]},
  "Gothitelle": {
    "overview": "<p>The following analysis was written in a prior iteration of the PU metagame and as a result does not accurately reflect the current state of the tier, where Gothitelle is considered outclassed and not worth using. This page will be updated later to reflect this.</p> ",
    "sets": [
      {
        "name": "Cosmic Power + Stored Power",
        "description": "<p>Gothitelle faces competition from other Psychic-types like Musharna, Mr. Rime, and Beheeyem, with these Pokemon fitting onto multiple teams more easily. This is because of them being more potent offensively, more reliably checking Throh, having reliable recovery, and generating momentum in Beheeyem's case. In spite of this, Gothitelle can still function as a solid bulky setup sweeper due to its decent bulk with investment, Cosmic Power further augmenting its defenses, and Stored Power allowing it to make excellent use of the boosts it accrues. Teams lacking Dark-types can struggle with Gothitelle, since even specially bulky Pokemon and Psychic-resistant Pokemon, such as Dusclops, Type: Null, and Silvally-Psychic, take too much damage after enough boosts. Stored Power also bypasses Pyukumuku's Unaware, meaning Gothitelle can be a major threat to stall teams. Leftovers lessens the need to use Rest and provides Gothitelle with passive recovery, while Colbur Berry reduces the damage that it takes from Dark-type coverage against foes like Grapploct. Competitive exploits moves and abilities that drop Gothitelle's stats, like Defog and Intimidate, by boosting its Special Attack and making Stored Power stronger. Moves like Mean Look and Thunderbolt can be used over Sleep Talk to trap and set up on passive foes or hit Dark-types, respectively, though forgoing Sleep Talk leaves Gothitelle completely helpless while it's asleep. Weakness Policy allows Gothitelle to take advantage of super effective coverage like Knock Off from Throh and U-turn from non-Swords Dance Silvally formes. This is an especially viable option, since most opponents will go for super effective moves against Gothitelle given its bulk.</p> <p>Gothitelle fits best on bulkier builds, since its defensive nature and relatively low Speed would cost more offensive teams too much momentum. Dark-types like Pawniard and Galarian Linoone completely wall Gothitelle if its only attacking move is Stored Power. Fighting-types like Hitmontop and Throh are important teammates to have because of this, with the former also removing entry hazards with Rapid Spin and the latter wearing teams down through the combination of Circle Throw and Knock Off. Strong attackers like Silvally-Bug, Choice Specs Glaceon, and Nasty Plot Raichu can overwhelm Gothitelle faster than it can boost, meaning that teammates to pressure these wallbreakers, like Lapras and Roselia, are appreciated. Roselia can also pressure opposing teams with Spikes and Toxic Spikes, making it easier for Gothitelle to sweep. Silvally formes like Silvally-Bug and Silvally-Electric can also be useful partners, providing support through blocking Trick and Switcheroo from Mr. Mime and Manectric, breaking through foes like Mawile, and potentially removing entry hazards with Defog. In return, Gothitelle can absorb status conditions and set up on potential revenge killers like Manectric locked into Overheat. Pairing Gothitelle with Dark-types, notably Taunt Pawniard, can prevent a potential stalemate against opposing bulky Stored Power users like Musharna and Duosion.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 474994, "username": "royesk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 228482, "username": "kt3"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Vanilluxe": {"sets": [{"name": "Wallbreaker"}]},
  "Jellicent": {
    "overview": "<p>Jellicent is one of the best defensive Water-types in the tier. Compared to its primary competitor in Lanturn, however, Jellicent brings to the table an excellent Ghost typing further enhanced by its myriad of supportive options such as Will-O-Wisp, Taunt, and Recover. Because of this, Jellicent is an effective switch-in to to various physical attackers such as Gallade and Perrserrker. Jellicent also provides teams additional utility by punishing Water-types or Choice-locked attackers depending on if it's running Water Absorb or Cursed Body. Jellicent can also serve as an incredible threatening offensive Pokemon when equipped with Choice Specs thanks to its insanely powerful moves and coverage, which hit the majority of the tier's defensive staples like Regirock, Sandaconda, and Hattrem for super effective damage. However, Jellicent can be rather passive due to its low offensive capabilities and reliance on status as the typical way of dealing damage. Furthermore, Jellicent struggles versus common special attackers such as Whimsicott and Vikavolt, as many of them can comfortably switch in and typically are not overly bothered by Will-O-Wisp or Toxic.</p> ",
    "sets": [
      {
        "name": "Defensive Utility",
        "description": "<p>Will-O-Wisp is the preferred status move as a way to catch many physical attackers that threaten Jellicent such as Absol, Togedemaru, and Gourgeist; however, Toxic can be used here in order to better cripple bulkier checks such as Lanturn and opposing Jellicent. Hex is preferred as the sole attacking move on this set because it pairs well with its status moves versus bulkier defensive answers such as Lanturn. Colbur Berry is the optimal item in order to weaken Knock Off from the likes of Sneasel or Gallade, but Heavy-Duty Boots can be used in order to be immune to entry hazards. Jellicent can also opt to not use an item, allowing it to switch into Choice Band Froslass, at the cost of some defensive utility against other threats. Gigalith makes a fantastic partner for Jellicent, as not only is it a good check to special attackers like Haunter, but with Sand Stream and hazard support, the residual damage Jellicent can spread with Will-O-Wisp and Toxic can severely cripple offensive answers like Whimsicott and Vikavolt. Conversely, Gigalith appreciates Jellicent's ability to reliably provide a Fighting immunity versus Choice-locked attackers like Sawk. Silvally-Fairy is also a fine partner, since it acts as a Knock Off absorber if Jellicent isn't running Colbur Berry and handles Dark-types such as Absol. Whimsicott makes a great offensive partner for Jellicent thanks to its ability to offensively check Sandaconda, Scrafty, and Absol, whereas Jellicent can check Charizard decently well. 32 Speed EVs allow Jellicent to outspeed Carracosta and Taunt it, preventing it from setting up with Shell Smash.</p> "
      },
      {
        "name": "Special Wallbreaker",
        "description": "<p>Water Spout is an incredibly strong, STAB-boosted move when Jellicent is at full HP and should be the move that is used most of the time, as it's able to hit the large majority of the tier, including defensive stalwarts like Sandaconda, Regirock, and Aggron, making Jellicent incredibly difficult to switch into. Special tanks like Audino can't switch into it, making the only real reliable switch-ins bulky, Water-resistant Pokemon like Ferroseed, opposing Wishiwashi, and Eldegoss. However, Shadow Ball hits these foes for neutral damage, forcing severe chip damage. Trick lets Jellicent cripple checks like Audino, Pyukumuku, and Ferroseed. Surf is a strong secondary Water-type attack in case Jellicent gets worn down. Hydro Pump can also be run, as it has a higher base power, making it more difficult to switch into, notably 2HKOing Aromatisse and Tangela after Stealth Rock, but its inaccuracy makes it less reliable than Surf. Pairing Jellicent with pivots like Archeops, Togedemaru, and Scyther lets it get onto the field safely, usually against physical walls lured in by these pivots like Quagsire, Tangela, or Regirock. Entry hazards irritate Jellicent and weaken Water Spout, making deterring or removing teammates like Charizard, Hattrem, and Eldegoss incredibly valuable. Furthermore, it loves having entry hazard support to make it even harder to switch into, making entry hazard setters like Garbodor, Aggron, and Ferroseed valued teammates, as they also form a defensive core to handle Pokemon that offensively pressure Jellicent, such as Scyther, Gallade, and Ribombee. Defensive answers to Electric- and Grass-types like Sandaconda, Eldegoss, and Charizard are incredibly good to cover Jellicents weaknesses.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 434150, "username": "gum"}, {"user_id": 414072, "username": "Heracross 2.0"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 467518, "username": "Bag of Trixx"}, {"user_id": 517892, "username": "pannuracotta"}]}
  },
  "Galvantula": {
    "overview": "<p>Due to its great Speed, good offensive typing and coverage, and ability to threaten common entry hazard removers like Charizard, Tsareena, and Golbat, Galvantula is an effective Sticky Web setter. Its access to Volt Switch in combination with these traits also makes it a decent pivot. However, Galvantula's meager Special Attack hinders its overall damage output. Opting for Life Orb does make up for this, particularly if Galvantula runs Thunder, but doing so means forgoing Heavy-Duty Boots and limiting its staying power. Galvantula also faces competition from other Sticky Web setters in Ribombee and Vikavolt. The former is better against Pokemon like Whimsicott due to its higher Speed, while the latter is much stronger, has Levitate and better bulk, and possesses similar coverage.</p> ",
    "sets": [
      {
        "name": "Offensive Support",
        "description": "<p>Thunder is Galvantula's strongest STAB move and doesn't force it to switch out like Volt Switch does. The move's accuracy is also boosted by Compound Eyes, substantially increasing its reliability. Energy Ball can be used instead to put more pressure on Rock- and Ground-types like Regirock and Palossand. Heavy-Duty Boots negates the effects of entry hazards, giving Galvantula an easier time switching around and annoying offensive teams. Alternatively, Life Orb can be used to bolster Galvantula's offensive presence, giving it a high chance to OHKO Pokemon like defensive Mesprit with Bug Buzz after Stealth Rock. However, losing immunity to entry hazards and taking Life Orb recoil both decrease its overall longevity. Slower wallbreakers and setup sweepers like Haunter and Nasty Plot Rotom-F very much appreciate Galvantula both slowing down potential revenge killers, like Basculin, with Sticky Web and generating momentum for them with Volt Switch. Both of these Pokemon also benefit from Galvantula's ability to force damage onto shared checks like Gigalith and Lanturn, and can break through bulkier walls like Sandaconda and Palossand in return. Rapid Spin users like Tsareena and Hitmontop can give Galvantula's teammates easier entry without removing Sticky Web and offensively check Pokemon such as Palossand and Charizard, with Tsareena in particular also maintaining momentum with U-turn. Support from the previously mentioned spinners can also allow Galvantula to more comfortably use Life Orb.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 346653, "username": "avarice"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Ferroseed": {
    "overview": "<p>With its typing, Eviolite-boosted bulk, and access to Spikes and Stealth Rock, Ferroseed functions as an effective entry hazard setter and good blanket check to several offensive and defensive threats, including Ribombee, non-Trick Mesprit, Gigalith, and Aromatisse. These same traits alongside Iron Barbs allow Ferroseed to annoy pivots such as Togedemaru and removers like Comfey. Despite lacking reliable recovery, Leech Seed and Ferroseed's natural immunity to Toxic and chip damage from sand can make it incredibly hard for some teams to wear down. However, prominent Pokemon like Charizard and Scrafty pressure Ferroseed with their STAB moves due to its typing. Ferroseed's passivity also leaves it unable to do much in the face of setup sweepers like the aforementioned Scrafty, Sandaconda, and Cofagrigus. Finally, Ferroseed must exercise caution around foes like Whimsicott, Aggron, and Mesprit, since they can punish it for recklessly switching in with either super effective coverage or moves like Knock Off and Trick.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Stealth Rock can be considered over Spikes to save a slot on Ferroseed's team and pressure non-grounded foes like Levitate Weezing, but Spikes tends to be more useful for reliably wearing down grounded Pokemon like Gigalith, Sandaconda, and Jellicent. Protect provides Ferroseed with additional recovery from Leech Seed and lets it scout Choice-locked foes like Poliwrath. Running a Relaxed nature and no Speed IVs maximizes the damage output of Gyro Ball, which compensates for Ferroseed's passivity. Try not to immediately use Gyro Ball too much, though, as the move has limited PP. Knock Off is an alternative utility option that punishes Charizard on the switch as well as other foes looking to take advantage of Ferroseed's passivity. However, it can be difficult to make room for, since Ferroseed's other moves are incredibly useful. Gigalith is a great partner, covering for Ferroseed's weakness to Fire, completing an entry hazard stacking core with it, and using sand to give it an even easier time wearing foes down. In return, Ferroseed switches into Water-types like Lanturn and Wishiwashi and can make up for its lack of recovery with Leech Seed. Jellicent can check Fighting-types and block Rapid Spin for Ferroseed, all while suffocating opposing walls with its utility options and Ferroseed's entry hazards. Offensive partners like Silvally-Fairy, Galarian Articuno, and Archeops pressure threats Ferroseed lets in, such as Scrafty and Charizard. These teammates also benefit from their switch-ins being worn down by entry hazards, with Galarian Articuno also punishing Defog attempts with Competitive.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 467518, "username": "Bag of Trixx"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Klinklang": {"sets": [{"name": "Shift Gear"}]},
  "Beheeyem": {"sets": [{"name": "Bulky Pivot"}, {"name": "Choice Specs"}, {"name": "Offensive Trick Room"}]},
  "Cryogonal": {"sets": [{"name": "Specially Defensive"}]},
  "Accelgor": {"sets": [{"name": "Offensive Spiker"}, {"name": "Wallbreaker"}]},
  "Stunfisk": {"sets": [{"name": "Mixed Wall"}]},
  "Stunfisk-Galar": {
    "overview": "<p>Galarian Stunfisk's unique typing and great bulk make it a solid switch-in to attackers like Ribombee, Togedemaru, and Vikavolt, giving it a solid niche over other Ground- and Steel-types like Palossand and Silvally-Steel. It can also further support its team with Stealth Rock and other support moves like Yawn. However, while its typing is at times great, it can also be a hinderance when trying to switch into threats like Frosmoth and Lycanroc that Steel- and Ground-types, respectively, usually check. Its lack of reliable recovery also makes it quite easy to overwhelm.</p> ",
    "sets": [{"name": "Specially Defensive", "description": "<p>Rock Slide allows Galarian Stunfisk to beat Bug- and Flying-types like Ribombee and Archeops more reliably, although Stone Edge can also be used to always knock Archeops into Defeatist range. Yawn prevents Pokemon like Tsareena and Palossand from freely switching into Galarian Stunfisk, while Pain Split gives it a mean of recovery, albeit unreliable. Aromatisse makes for a stellar partner thanks to ability to switch into threats like Scrafty for Galarian Stunfisk; it can also heal it back up with Wish, which it greatly appreciates. In return, Galarian Stunfisk checks Steel-types like Togedemaru and Silvally-Steel for Aromatisse. Similarly, Weezing and Silvally-Fairy can take on Fighting-types such as Hitmontop that it struggles against. Lastly, wallbreakers and setup sweepers like Trevenant and Quiver Dance Ribombee appreciate Galarian Stunfisk providing them with more opportunities to come in via Yawn.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 434150, "username": "gum"}]}
  },
  "Druddigon": {
    "overview": "<p>Druddigon makes an effective pivot with its Dragon typing and ability in Rough Skin, which is used in conjunction with Rocky Helmet to punish U-turn and Flip Turn users like Togedemaru and Basculin. Heavy Defense investment lets it switch into notable Pokemon such as Tsareena and Togedemaru. Druddigon also has a great supportive movepool with access to Stealth Rock and Glare. However, Druddigon is weak to common Fairy- and Ice-type attacks from Pokemon like Ribombee and Froslass, as well as lacking any reliable recovery options.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Dragon Tail can be used to phaze Pokemon and rack up damage with Stealth Rock against Defoggers such as Charizard or setup sweepers such as Cosmic Power Claydol. Otherwise, Dragon Claw makes a decent alternative. Glare is used to spread paralysis, mainly targeting Whimsicott and Ribombee that may try to switch into Druddigon. Earthquake provides good coverage with Dragon Tail, hitting Steel-types like Aggron and Togedemaru super effectively. Endure can be used as a way to accumulate an extra turn of Rocky Helmet and Rough Skin damage onto a foe, which can help check opposing Pokemon such as Triple Axel Froslass in a pinch. Leftovers can be used as an alternative to Rocky Helmet to provide Druddigon with more longevity. Silvally-Fairy and other fast wallbreakers pair well with Druddigon, as Druddigon can punish fast Pokemon like Togedemaru that attempt to revenge kill them. Aggron and Charizard help to cover Fairy-types like Aromatisse and Ribombee that attempt to take advantage of Druddigon. Togedemaru is another Fairy-resistant Pokemon that can provide Wish support, which helps Druddigon stay healthy throughout a game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 273347, "username": "ShuckleDeath"}]}
  },
  "Bouffalant": {"sets": [{"name": "Substitute + Swords Dance"}]},
  "Heatmor": {"sets": [{"name": "Mixed Attacker"}, {"name": "Special Attacker"}, {"name": "Choice Scarf"}]},
  "Meowstic": {"sets": [{"name": "Dual Screens"}]},
  "Meowstic-F": {
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Meowstic-F finds a solid niche in PU as a frail, but fast, wallbreaker that threatens common Fighting-, Poison-, and Water-types. Thunderbolt devastates Water-types while serving as Meowstic-F's best method of hitting Dark- and Steel-types such as Pawniard, Thievul, Mawile, and Klang. Protect provides valuable utility, allowing Meowstic-F to block First Impression from Fraxure and Falinks while letting it scout for moves from Choice item users such as Manectric and Stonjourner and gain additional recovery if running Leftovers. Shadow Ball is a notable mention over Protect, allowing Meowstic-F to threaten opposing Psychic-types. Colbur Berry provides a one-time damage reduction against Dark-type moves, allowing Meowstic-F to potentially stay in against Pawniard and Thievul to retaliate with Thunderbolt while also reducing the damage from Throh's Knock Off and Falink's Throat Chop. Leftovers can be utilized over Colbur Berry to offer recovery, extending Meowstic-F's longevity. Competitive, in tandem with its naturally high Speed tier, allows Meowstic-F to outspeed and punish Defog from the various Silvally formes and other slower Defoggers such as Vibrava and Vespiquen.</p> <p>Fighting-types such as Falinks, Throh, and Hitmontop appreciate Meowstic-F removing Poison-types such as Mareanie, Gloom, and Roselia that limit their effectiveness. In return, they are able to eliminate Dark- and Steel-types such as Pawniard, Thievul, and Klang that trouble Meowstic-F. Steel-types such as Mawile and Pawniard can help Meowstic-F by offering Stealth Rock support, wearing down opposing foes, and by serving as soft checks to Bug-types like Crustle and Silvally-Bug. Setup sweepers such as Klang, Eiscue, and Thievul can benefit from Meowstic-F removing Fighting-types, letting them set up and sweep late-game. Entry hazard setters such as Crustle and Roselia appreciate Meowstic-F's ability to punish Defog from Silvally formes to reliably get up their hazards, providing valuable residual damage that can make up for Meowstic-F's mediocre Special Attack stat.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Aromatisse": {
    "overview": "<p>Aromatisse is one of the best defensive Fairy-types in the tier, capable of checking powerful Fighting-types like Scrafty. Aromatisse sets itself apart from its competition thanks to the Wish and Heal Bell support it can provide its teammates, as well as an immunity to Taunt and Encore. Unfortunately, Aromatisse's mono-Fairy typing, poor Special Attack stat and lack of coverage leave it prone to giving strong wallbreakers like Magmortar and Aggron a free switch-in. Aromatisse is reliant on Wish to keep itself healthy, forcing it to use Protect very often, which can be a huge momentum drain. Aromatisse faces little direct competition but teams that do not need its Wish support may wish to invest in a Fighting-type check with more utility, such as Weezing.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Heal Bell provides Aromatisse and its teammates with cleric support. Toxic allows Aromatisse to cripple Pokemon like Gigalith and Charizard. Calm Mind is an option for the last slot to give Aromatisse a more offensive precense; however, many Fairy-resistant Pokemon such as Centiskorch and Aggron can overwhelm Aromatisse with sheer power. Aroma Veil is a useful ability that prevents Aromatisse from being shut down by Taunt and Encore. Heavy-Duty Boots is an alternative option over Leftovers to prevent Aromatisse from being worn down by entry hazards, though the passive recovery from Leftovers is generally preferred.</p> <p>Aromatisse fits best on bulky offense and balance builds that value Wish support and a sturdy Fighting-type check. Synthesis variants of Tsareena can wear down Ferroseed, a Pokemon which heavily abuses Aromatisse's passivity, and also provides Rapid Spin support to stop Aromatisse from being easily worn down by entry hazards. In return, Aromatisse can cleanse Tsareena of status and give it easier entry with Wish support. Weezing and Jellicent can help provide a secondary Fighting-type check, better handling Triple Axel Hitmontop, and can check offensive breakers like Aggron and Swords Dance Qwilfish, respectively. Gigalith and Lanturn can help check strong Fire-types such as Magmortar and Charizard that Aromatisse invites in, both also greatly valuing the Wish support Aromatisse provides.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213583, "username": "TONE"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 344575, "username": "Twilight"}]}
  },
  "Carbink": {"sets": [{"name": "Stealth Rock"}]},
  "Trevenant": {
    "overview": "<p>Trevenant is one of PU's most devastating wallbreakers because of its high Attack, amazing offensive typing, and powerful STAB moves in Poltergeist and Wood Hammer. Trevenant also has some useful defensive attributes that differentiate it from other offensive Ghost-types such as Gourgeist-S and Froslass. Chief among these qualities is Natural Cure, which allows it to more comfortably switch into status inducers like Quagsire and Glare Sandaconda. Furthermore, Trevenant can heal while attacking with Horn Leech, which isn't weather-dependent like Synthesis, and isn't weak to Stealth Rock like Froslass. However, Trevenant lacks the bulk and longevity necessary to make full use of these good traits. While it outspeeds most defensive Pokemon, Trevenant is still incredibly slow, which, combined with its frailty and poor defensive typing, makes it easy to pressure and limits its opportunities to safely switch in. Trevenant also faces competition as a Ghost-type wallbreaker from Gourgeist-S and Froslass, since both are faster, the former is more versatile with moves like Explosion and Flame Charge, and the latter offers vital utility in Spikes.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Earthquake lets Trevenant OHKO Aggron and 2HKO itemless Neutralizing Gas Weezing. Alternatively, Drain Punch hits Ghost-immune Sap Sipper users like Drampa and Miltank harder. Trick can be used to annoy defensive Pokemon like Tangela and virtually guarantee that a foe can be hit by Poltergeist, although Trevenant becomes noticeably weaker without Choice Band. Sucker Punch is another option that allows Trevenant to make up for its lackluster Speed, but it's prediction-reliant and not a good move to be locked into. While Frisk lets Trevenant scout for items and whether foes can be hit by Poltergeist, not being rendered useless by status thanks to Natural Cure is usually more useful. Using an Adamant nature maximizes Trevenant's damage output, but opting for a Jolly nature allows it to outspeed Pokemon like Jolly Aggron and Perrserker. Despite being incredibly strong, Trevenant can still struggle to take care of some physical walls like Tangela. Therefore, powerful special attackers such as Galarian Articuno and Charizard are good teammates. The former can also use U-turn to get Trevenant in safely and put immense pressure on Trevenant's answers with Future Sight, while the latter can remove entry hazards with Defog. Entry hazard support helps to wear down annoying physical walls too. In particular, Spikes setters like Alolan Sandslash can be incredibly useful, helping Trevenant guarantee 2HKOs against Pokemon like Ferroseed with Poltergeist. Avoid pairing Trevenant with Knock Off users, since they'll prevent it from as freely using Poltergeist.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Gourgeist": {"sets": [{"name": "Wallbreaker"}, {"name": "Choice Scarf"}, {"name": "Nasty Plot"}]},
  "Gourgeist-Small": {"sets": [{"name": "Offensive"}, {"name": "Choice Scarf"}, {"name": "Nasty Plot"}]},
  "Gourgeist-Super": {"sets": [{"name": "Physically Defensive"}, {"name": "Choice Band"}]},
  "Avalugg": {"sets": [{"name": "Physically Defensive"}]},
  "Vikavolt": {
    "overview": "<p>Vikavolt is a wallbreaking powerhouse, sporting a massive base 145 Special Attack stat, powerful STAB attacks, Volt Switch, and decent coverage to boot. It can also switch into threats like Palossand and Passimian thanks to its passable bulk, typing, and access to recovery. However, Vikavolt is very slow for a wallbreaker, and its Bug typing can be a hindrance, as it leaves Vikavolt unable to switch into Pokemon like Regirock that it can otherwise easily pressure. It is often outclassed by Ribombee and Galvantula as a Sticky Web setter, as their Speed tier is much more suited for the aggressive playstyle, with Galvantula also sporting the same typing and Volt Switch. Similarly, Agility sets suffer from competition from Quiver Dance Ribombee.</p> ",
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>This set takes advantage of Vikavolt's wallbreaking potential, forcing out most Pokemon slower than it such as Sandaconda and Jellicent. Although Thunderbolt is a great reliable STAB move for Vikavolt, Sticky Web can be used on more offensive teams as speed control, giving Vikavolt a few more opportunities to outspeed and pressure opposing Pokemon such as Aggron and Adamant Absol but mostly serving to support its teammates. Bug Buzz is primarily used on Vikavolt as a reliable way to hit Pokemon that Electric-type moves cannot hit as well, such as Druddigon and Tsareena. However, Energy Ball is a useful alterative to hit Ground-types harder, such as Palossand and Rhydon, that may attempt to block Volt Switch. A good partner for this set is Passimian, which can assist in offensively checking common switch-ins such as Gigalith and Regirock and deter the opponent from using Defog thanks to Defiant. It can also form a solid VoltTurn core with Vikavolt. Other wallbreakers that appreciate the Sticky Web support like Magmortar and Silvally-Steel make for solid partners. The former appreciates Vikavolt taking on Water-types such as Lanturn, while the latter can pressure defensive behemoths like Gigalith for Vikavolt.</p> "
      },
      {
        "name": "Agility",
        "description": "<p>This set uses Vikavolt's wallbreaking potential and transforms it into a late-game sweeper, using Agility to make it faster than the entirety of the unboosted metagame. Vikavolt's natural bulk and typing let it use Agility against Choice Scarf Pokemon such as Passimian and Togedemaru as well as more defensive Pokemon that struggle to damage it such as Uxie and Claydol. Energy Ball is used to defeat Pokemon that resist its primary attacks, such as Palossand and Galarian Stunfisk. Roost, however, can give Vikavolt more longevity, allowing it to recover on more defensive threats to make it harder to revenge kill. This set pairs well with entry hazards setters such as Spikes Froslass and Qwilfish, as these help Vikavolt force its way past difficult-to-break Pokemon such as Gigalith and specially defensive Togedemaru. It also defensively pairs well with Ground-types such as Palossand and Sandaconda that resist Rock-type attacks from Pokemon such as Lycanroc and Regirock, since these Pokemon often stop Vikavolt from sweeping.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 292388, "username": "Meri Berry"}]}
  },
  "Ribombee": {
    "overview": "<p>Ribombee makes for an incredibly versatile threat due to its blistering Speed, good typing, and solid movepool. These traits render it capable of fulfilling multiple roles, ranging from an offensive pivot able to support its teammates with Sticky Web to a capable wallbreaker and cleaner with Choice Specs and Quiver Dance, respectively. It can also revenge kill various threats like Sneasel and Archeops. However, Ribombee struggles a lot against Steel- and Fire-types as well as specially defensive walls like Aggron, Magmortar, and Gigalith due to its average Special Attack and relative lack of coverage options.</p> ",
    "sets": [
      {"name": "Quiver Dance", "description": "<p>Thanks to its decent coverage and great Speed, Ribombee makes for a fairly threatening setup sweeper. Roost allows Ribombee to use walls like non-Toxic Palossand as setup fodder and makes Ribombee a far more reliable answer to Scrafty. Bug Buzz hits Psychic- and Grass-types like Mesprit and Tsareena without needing a boost, while U-turn gives Ribombee more utility early- and mid-game when its checks are still healthy. Wallbreakers like Mesprit and Trevenant are vital partners; they soften up Pokemon like Gigalith, Aggron, and Charizard, making Ribombee much more of a nuisance. Due to its poor bulk, teammates that can bring Ribombee in safely like Lanturn and Togedemaru make for stellar partners; the former can also switch into Fire-types such as Charizard. Lastly, other cleaners like Scrafty and Hitmonlee can set up on Ribombee's answers, and vice versa.</p> "},
      {
        "name": "Choice Specs",
        "description": "<p>Ribombee's coverage and Speed make it a potent wallbreaker and revenge killer when wielding a Choice Specs. Sticky Web is an option over U-turn for Ribombee to support its teammates, while Switcheroo lets it cripple answers like Gigalith and Togedemaru. However, U-turn is the preferred option due to it easing prediction. Cleaners like Sneasel and Gourgeist-Small appreciate Ribombee weakening walls like Weezing and Aggron for them. Scrafty is another great teammate, as it can also take advantage of some of the various walls that Ribombee finds itself unable to break, such as specially defensive Togedemaru. Stealth Rock and other entry hazards are a huge nuisance to this particular set; they heavily dent Ribombee and make it easier to pick off with a priority move, meaning it has a harder time revenge killing Pokemon like Sneasel and Absol. This makes entry hazard control absolutely vital, with Charizard and Tsareena standing out as great options because they also deal with threats Ribombee struggles against.</p> "
      },
      {
        "name": "Offensive Support",
        "description": "<p>This set makes Ribombee a capable offensive pivot capable of supporting its teammates with Sticky Web. Stun Spore allows Ribombee to cripple threats it struggles against, like Charizard, while Psychic allows it to hit Poison-types, notably Weezing. U-turn takes advantage of the switches Ribombee forces and allows it to bring it teammates against the Pokemon it invites in. Pokemon like Hitmontop, Magmortar, and Aggron make for fantastic partners; not only do they greatly appreciate Ribombee's Sticky Web, but they can also easily take on threats Ribombee has a hard time against such as Togedemaru and Gigalith. Due to Ribombee's unimpressive damage output, it appreciates Spikes from partners like Froslass, which can pressure Steel-types for Ribombee and also enjoys Ribombee being able to revenge kill or cripple faster threats like Sneasel. Froslass can also switch into Rapid Spin users like Hitmontop trying to get rid of Ribombee's Sticky Web.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 434150, "username": "gum"}]}
  },
  "Lycanroc": {
    "overview": "<p>Thanks to its great Speed, great Attack, and coverage, Lycanroc has established itself as a notable offensive threat capable of revenge killing multiple tier staples such as Charizard and Ribombee, which gives it an important niche over Archeops. While it does have a great Attack and movepool, it struggles to get past physically defensive walls that aren't weak to its attacks like Tangela, Quagsire, and Sandaconda without residual damage. Its frailty and poor defensive typing causes it to rely on pivots like Ribombee and Rotom to enter the field safely.</p> ",
    "sets": [{"name": "All-out Attacker", "description": "<p>With this set, Lycanroc makes for a great revenge killer. Close Combat targets Pokemon like Gigalith, Togedemaru, and Regirock. If running Psychic Fangs, Lycanroc is going to find itself unable to break through Palossand and Claydol; partners that can take them on like Whimsicott and Gourgeist-Small are therefore appreciated. They can also weaken other walls such as Weezing in order for Lycanroc to clean. In exchange, they enjoy Lycanroc pressuring Pokemon like Charizard and Sneasel for them. If running Crunch, Lycanroc struggles against Fighting-types such as Hitmontop and Gurdurr, which makes teammates like Jellicent and Aromatisse appreciated. While Life Orb makes Lycanroc less prediction reliant, Choice Band makes it hit considerably harder while also not getting chipped down by Life Orb.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 444224, "username": "Juno"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 434150, "username": "gum"}]}
  },
  "Lycanroc-Midnight": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Scarf"}]},
  "Wishiwashi": {"sets": [{"name": "Defensive"}, {"name": "ToxTect"}]},
  "Lurantis": {"sets": [{"name": "Defog"}]},
  "Shiinotic": {"sets": [{"name": "Defensive Strength Sap"}]},
  "Palossand": {
    "overview": "<p>Palossand is an important defensive centerpiece in PU thanks to its good typing, bulk, access to Stealth Rock, and ability to check otherwise dangerous Pokemon like Archeops, Lycanroc, and Aggron. It can be very difficult to take down over the course of a game thanks to Shore Up, an excellent reliable recovery move that is often boosted in potency by the common presence that is Gigalith's sand. Its solid STAB coverage and decent Special Attack also make it somewhat difficult to switch into, reducing its passivity. Palossand can struggle somewhat with threats that its typing would otherwise allow it to check, though, like Regirock because of Toxic and Vikavolt because of Energy Ball. It can also be a major momentum drain due to how passive it can be, especially against bulkier teams.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Palossand's great bulk makes it possible for it to come in on foes like Togedemaru, Gigalith, Sawk, and Aggron, giving it ample opportunities to set up Stealth Rock. Colbur Berry provides Palossand with a buffer against Knock Off from the Fighting-types it checks and can also let it check Choice Band Sneasel locked into Knock Off. Checks to strong special attackers like Whimsicott and Ribombee are recommended, since Palossand can't handle them at all. Togedemaru can perform this role while also providing Wish support, which is very helpful, as Palossand can easily be worn down by chip damage from U-turn and entry hazards over longer games. Lanturn provides useful defensive synergy and can further support Palossand with Heal Bell. Other good partners include Weezing, which can act as a good Tsareena check, and Ribombee, which checks annoyances like Scrafty. Both of these Pokemon appreciate Palossand's ability to check Steel-types and set up Stealth Rock to wear down their switch-ins.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 481709, "username": "Lily"}]}
  },
  "Pyukumuku": {"sets": [{"name": "Unaware Trapper"}]},
  "Type: Null": {
    "overview": "<p>The following analysis was written in a prior iteration of the PU metagame and as a result does not accurately reflect the current state of the tier, where Type: Null is considered outclassed and not worth using. This page will be updated later to reflect this.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Type: Null's great bulk, which is further bolstered by Eviolite, and access to U-turn make it an incredible pivot able to switch into some of the premier special threats in the tier, like Mr. Rime and Lilligant. U-turn allows Type: Null to pivot out of unfavorable matchups and, thanks to its low Speed, bring a teammate in safely. While Toxic allows Type: Null to cripple Pokemon that try to take advantage of it like Crustle, Stunfisk, and Gourgeist, Crush Claw provides Type: Null with a STAB move that makes it considerably less passive and allows it to beat threats it otherwise wouldn't beat, like Calm Mind Galarian Rapidash. Rest allows it to stay healthy throughout the game and act as a status absorber, while Sleep Talk prevents it from being overly passive when sleeping, although it can be unreliable. Shadow Claw is an option over Toxic or Sleep Talk, as it allows Type: Null to beat Substitute + Calm Mind Drifblim. Answers to Fighting-types, like Drifblim, Qwilfish, and Gourgeist-XL are vital partners, as they can switch into threats like Throh and Falinks that Type: Null struggles against. Drifblim also gets rid of entry hazards, which Type: Null greatly appreciates due to its lack of passive recovery, while Qwilfish sets Spikes and Toxic Spikes. In exchange, Type: Null acts as a reliable switch-in to Pokemon they're threatened by, like Appletun, Beheeyem, and Mr. Rime. Knock Off absorbers, along with Pokemon that can switch into Trick and Switcheroo, are appreciated, since Type: Null needs its item to do its job reliably. Pokemon holding a Rocky Helmet, such as Stunfisk and Runigerus, make for great switch-ins to Knock Off users like Mawile; they can also switch into threats like Perrserker and Silvally-Rock that threaten Type: Null, while they appreciate the latter's ability to switch into Ice-, Grass-, and Water-types. Teammates holding a Choice item like Unfezant and Gourgeist also work, as they can switch into Pokemon with Trick and Switcheroo like Choice Scarf Mr. Mime and Manectric, while they can also revenge kill Pokemon that can overwhelm Type: Null, like Throh. Gourgeist, in particular, can also cripple Pokemon like Calm Mind Musharna and Cosmic Power Gothitelle that Type: Null struggles against with Trick. Strong physical attackers like Choice Band Gourgeist-XL can easily overwhelm Type: Null; this makes answers to these, such as itemless Appletun, great options. They all appreciate Type: Null dealing with special attackers such as Lilligant they struggle against, while they can aid Type: Null in checking Electric-types such as Boltund for Tangela and Manectric in Gourgeist-XL's case. Frailer or slower threats appreciate Type: Null bringing them in safely against Pokemon like Dusknoir, Klinklang, and Stunfisk via U-turn. Choice Band Morpeko, Flame Orb Throh, and Choice Specs Golduck are prime examples, with the former being able to deal with Substitute Calm Mind Drifblim. Lastly, clerics such as Vespiquen and Togetic are appreciated, as Type: Null's reliance on Rest means it can be taken advantage of as well as overwhelmed. They also check Fighting-types like Hitmonchan and appreciate Type: Null dealing with Ice-types like Glaceon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 461329, "username": "Estarossa"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 434150, "username": "gum"}]}
  },
  "Silvally-Bug": {"sets": [{"name": "Swords Dance"}]},
  "Silvally-Dark": {
    "overview": "<p>Silvally-Dark is able to serve as a setup sweeper with its natural bulk and coverage. Its bulk and Speed distinguish it from Absol as a Dark-type wallbreaker, as it is more capable of pulling off a full sweep and is not reliant on Sucker Punch. Silvally-Dark can set up on Choice-locked Mesprit and Jellicent as well as passive Pokemon such as Audino, proceeding to wreak havoc with +2 Multi-Attack allowing Silvally-Dark to muscle past many Pokemon. However, it struggles to compete with the other Silvally formes in both defensive utility and offensive potency due to its typing. Scrafty is another notable Dark-type sweeper that, while slower, is not bothered by status, has access to Knock Off utility, and is much more self sufficient.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Silvally-Dark can break walls other Silvally formes struggle with such as Palossand, Uxie, and Jellicent with its Dark-type Multi-Attack, in addition to generally bulky Pokemon like Gigalith. Iron Head hits common Dark-type answers such as Aromatisse and Whimsicott and can pick off weakened Scrafty. Flame Charge allows Silvally-Dark to clean weakened teams, allowing it to outspeed Pokemon like Lycanroc, Ribombee, and Choice Scarf users like Mesprit. Silvally-Dark greatly appreciates Spikes support to better facilitate a sweep, making Froslass and Ferroseed great partners. Froslass stands out, as it can bait Shadow Ball from Choice Scarf Rotom to give Silvally-Dark a setup opportunity. Poison-types such as Qwilfish and Weezing are able to deal with Fairy-types like Aromatisse and provide additional entry hazards. In return, Silvally-Dark threatens Psychic-types like Mesprit. Special wallbreakers like Galarian Articuno and Ribombee are solid partners to pressure Pokemon such as Regirock and Weezing that Silvally-Dark can't muscle past even after a Swords Dance. They are also able to check Fighting-types such as Gallade and Scrafty. Healing Wish support from Mesprit allows Silvally-Dark to play more aggressively and wear down its own checks while also drawing in Pokemon like Audino and Gigalith.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 1232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Silvally-Dragon": {
    "overview": "<p>With its natural bulk and unique coverage, Silvally-Dragon is able to serve as a consistent setup sweeper. Its typing allows Silvally-Dragon to set up on Pokemon like Tsareena and choice-locked Togedemaru. However, it is unable to provide much defensive utility throughout a match without jeopardizing its ability to sweep. Silvally-Dragon also ends up competing with Silvally-Ghost and -Fairy as a setup sweeper, as these types typically provide more defensive utility and find easier setup opportunities.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Silvally-Dragon is able to muscle through most foes with its STAB Multi-Attack. Iron Head nails Fairy-types like Aromatisse and Whimsicott. Flame Charge allows Silvally-Dragon to hit Steel-types such as Togedemaru and Silvally-Steel harder and outspeed Ribombee, Archeops, and Choice Scarf users like Passimian and Mesprit. With its offensive nature, Silvally-Dragon finds itself most commonly on Spikes stacking offense teams. Silvally-Dragon struggles to get past physically defensive Pokemon like Regirock and Weezing, even after a boost, so it benefits from other wallbreakers like Nasty Plot Mesprit and Quiver Dance Ribombee. Healing Wish support from Mesprit lets Silvally-Dragon be more aggressive and wear down Weezing and Sandaconda without being too bothered by chip damage and potential status. Steel-types like Togedemaru and Aggron deal with opposing Fairy-types, and in return, Silvally-Dragon is able to break past Pokemon like Lanturn and Magmortar.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Silvally-Fairy": {
    "overview": "<p>Silvally-Fairy is a very versatile threat in the PU metagame thanks to a myriad of factors. Solid base 95 stats across the board and a wide movepool allow it to be easily constructed to fit a specific team's needs. With access to Defog, Parting Shot, and Thunder Wave, it can be a great support Pokemon, while access to Swords Dance and super effective coverage to hit common Fairy-type checks such as Togedemaru and Charizard let it be a great offensive Pokemon. A pure Fairy typing means it's great for checking and setting up on Dark- and Fighting-types such as Absol and Scrafty. Silvally-Fairy's biggest flaw is its lack of any form of recovery. It is also susceptible to all entry hazards and status afflictions, making it easy to wear down and unable to check what it needs to consistently. Finally, it cannot fit all of what it wants on one set, limiting its options.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Parting Shot allows Silvally-Fairy to pivot out on would-be threats such as Togedemaru and Aggron. If Defog is unneeded, then Silvally-Fairy can run a status move of its choice to cripple an opposing Pokemon. Despite the Jolly nature, Flamethrower is chosen to hit Steel-types, hitting them harder than Fire Fang. The Speed investment allows Silvally-Fairy to outspeed Timid Magmortar, in addition to slower Pokemon like Absol and Shiftry, and the rest is invested into physical bulk. Notably, it lives a +1 Life Orb Iron Head from Dragon Dance Scrafty with two layers of Spikes up. Silvally-Fairy pairs best with Steel-types, building a solid defensive core with them. Togedemaru is a great option, as it can sponge Poison- and Steel-type attacks while healing Silvally-Fairy with Wish, and, in return, Silvally-Fairy can tank Fighting-type attacks for it. Psychic- and Dark-type attackers such as Mesprit and Scrafty heavily appreciate the absence of Dark- and Fighting-type checks as well as the Parting Shot support, making it easier for them set up without fear of being punished.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>A strong STAB move, great coverage, and two boosting moves let Silvally-Fairy tear through teams. Flame Charge is not only useful for hitting Steel-types, but it lets Silvally-Fairy boost its Speed, making it harder to revenge kill by Choice Scarf users such as Mesprit and Rotom. Rock Slide allows it to OHKO Charizard, while Psychic Fangs is a niche alternative that can take out a weakened Weezing. U-turn is also an option if Silvally-Fairy finds itself in a bad situation, however this means forgoing important coverage. Swords Dance Silvally-Fairy can be used as both a sweeper and a breaker, but be aware that it struggles to break past bulky physically defensive Pokemon such as Regirock and Aggron. Wallbreakers such as Shiftry and Basculin take advantage of these due to their super effective STAB moves while also weakening Fire- and Poison-types, making them solid partners for Silvally-Fairy. Cleaners such as Sneasel and Dragon Dance Charizard also appreciate walls such as Regirock and Palossand being weakened so they can efficiently sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Silvally-Ghost": {
    "overview": "<p>With access to boosting moves in Swords Dance and Flame Charge alongside a good offensive typing and strong stats, Silvally-Ghost makes for a strong setup sweeper. However, it faces stiff competition from the likes of Silvally-Fairy, which offers teams a stronger defensive typing with a plethora of useful resistances for a setup sweeper whilst maintaining the same coverage, meaning it's much more versatile and can fit on a wider variety of teams. Defensively, it falls short compared to other Ghost-types, such as Palossand and Jellicent, which provide solid secondary typings with useful immunities and greater supportive movepools.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Explosion is outstanding for its ability to provide a one-time nuke versus defensive checks such as Miltank and Scrafty. However, U-turn can be used as a way to gain momentum against the aforementioned Ghost-resists without sacrificing Silvally-Ghost's life in the process. Substitute allows Silvally-Ghost to avoid status from the likes of Lanturn and is a strong option against Sucker Punch users like Absol, but leaves Silvally-Ghost with no way to threaten other bulky Pokemon like Scrafty and Quagsire. Ribombee makes a great partner thanks to its ability to not only offensively check Dark-types like the aforementioned Scrafty, but it also provides Sticky Web support. Additionally, Silvally-Ghost can act as a spinblocker against the likes of Tsareena and Claydol and use either of them as setup fodder. Fighting-types like Poliwrath and Hitmontop can pressure defensive checks to Silvally-Ghost such as Miltank, Scrafty, and Regirock, especially when safely brought in with U-turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 301217, "username": "bandkrook"}]}], "writtenBy": [{"user_id": 467518, "username": "bagoftrixx"}]}
  },
  "Silvally-Ice": {"sets": [{"name": "Swords Dance"}, {"name": "Work Up"}]},
  "Silvally-Poison": {
    "overview": "<p>Silvally-Poison is primarily a niche breaker, but can also be a Defogger. Its typing works decently in a tier with prevalent Fairy-, Grass-, and Fighting-types such as Ribombee, Tsareena, and Scrafty, respectively. Silvally-Poison's Toxic immunity makes it a potent threat against passive teams, as it can freely setup on clerics such as Audino and Aromatisse and still have coverage for checks like Togedemaru. Being able to fit Grass Pledge comfortably to counter Quagsire distinguishes it from other Silvally formes. However, Silvally-Poison often is outperformed as a breaker by other Silvally formes with more intimidating offensive typings like Silvally-Ghost and Silvally-Fairy. As a Defogger, Silvally-Poison fits nicely on bulkier teams as a Knock Off and Toxic Spikes absorber; even so, Silvally-Steel and Silvally-Water are generally easier to fit onto teams because they are not as commonly checked by defensive staples like Weezing and Togedemaru.</p> ",
    "sets": [
      {
        "name": "Work Up",
        "description": "<p>Silvally-Poison fits nicely on bulky offense and balance teams in need of a stallbreaker. It is great at dismantling bulky teams through Work Up. Multi-Attack allows it to muscle through specially defensive Pokemon like Articuno and Audino. Flamethrower nails Steel-types like Togedemaru and Silvally-Steel. Grass Pledge is useful for targeting Quagsire and Palossand. Surf, as an alternative to Grass Pledge, does more damage to Aggron in exchange for not breaking Quagsire. Ferroseed is a good partner for Silvally-Poison by providing Spikes support. They compliment each other defensively as well, as Ferroseed can switch into Psychic-types like Mesprit and Silvally-Poison can switch into Fighting-types like Scrafty. Jellicent is also a solid fit for dealing with opposing Fighting-types and spreading burns for easier setup later. Other partners such as Galvantula and Whimsicott can lure in defensive Pokemon like Audino for Silvally-Poison to set (add space) up on. Charizard benefits from Silvally-Poison tanking Knock Off and pressuring common defensive cores. In return, Charizard offers more immediate power and can wear down shared checks like Gigalith.</p> "
      },
      {"name": "Defog", "description": "<p>Defogger Silvally-Poison checks common Pokemon like Tsareena and makes for decent hazard removal on bulkier teams. The Speed investment allows Silvally-Poison to Defog before Qwilish can Taunt it. Poison-type Multi-Attack pressures common threats like Silvally-Fairy. Flamethrower hits Steel-types like Alolan Sandslash and Ferroseed super effectively. U-turn allows Silvally-Poison to pivot without triggering Competitive Galarian Articuno. Silvally-Poison is worn down fast by entry hazards when removing them, so clerics like Aromatisse and Audino are valuable partners. Tangela and Gourgeist check common Ground-types that Silvally-Poison is vulnerable against such as Sandaconda. Unaware Quagsire nullifies the various setup sweepers in the tier and reciprocally benefits from Silvally-Poison dealing with Grass-types.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400929, "username": "asa"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 192841, "username": "dave"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Silvally-Rock": {
    "overview": "<p>The following analysis was written in a prior iteration of the PU metagame and as a result does not accurately reflect the current state of the tier, where Silvally-Rock is considered outclassed and not worth using. This page will be updated later to reflect this.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Silvally-Rock finds a solid niche in PU as a Swords Dance sweeper, obtaining setup opportunities against common foes such as Mr. Rime and Unfezant. Swords Dance bolsters Silvally-Rock's attacking prowess, letting it break through slower foes such as Appletun and Dusknoir. U-turn provides valuable utility and allows Silvally-Rock to pivot away from checks such as Sandslash and Throh. Alternatively, Flame Charge turns Silvally-Rock into a better late-game cleaner, boosting its Speed stat, letting it hit Klinklang, and enabling it to outspeed offensive checks such as Galarian Rapidash and Alolan Dugtrio and Choice Scarf users such as Drednaw and Golduck. Ice Beam serves as coverage for Ground-types such as Stunfisk and Sandslash. Psychic Fangs is a notable mention that allows Silvally-Rock to better break through Fighting-types like Throh and Falinks. Swords Dance Silvally-Rock is often found on offensive builds that appreciate its ability to fire off strong Multi-Attacks, keep offensive momentum with U-turn, and potentially clean late-game. If running Flame Charge over U-turn, Silvally-Rock should be preserved until late-game when its checks have been weakened or removed and it can set up and sweep. Partners such as Unfezant and Morpeko weaken physical walls such as Stunfisk and Sandslash, helping facilitate a late-game sweep. Pairing Silvally-Rock with special wallbreakers such as Appletun, Nasty Plot Gourgeist, and Mr. Rime can be beneficial, as they can take advantage of the aforementioned physical walls and defensive Throh; Eject Pack Appletun can also provide more setup opportunities by bringing Silvally-Rock in on special walls such as Type: Null and Lickilicky. Stunfisk and Sandslash also make for good partners, providing checks to Steel-types such as Klinklang and Mawile and setting up entry hazards. Checks to Fighting-types such as Galarian Rapidash, Mr. Rime, and Unfezant are also appreciated, with the former two also providing Healing Wish support.</p> "
      },
      {
        "name": "Offensive Defog",
        "description": "<p>Silvally-Rock finds a slight niche in PU as an offensive Defog user, thanks to its strong Multi-Attack that gives it good matchups against common foes such as Mr. Rime, Unfezant, and Drifblim. Ice Beam targets Ground-types such as Stunfisk and Sandslash, while Flamethrower punishes switch-ins from Steel-types such as Klinklang and Mawile, letting Silvally-Rock utilize Defog against Mawile. U-turn establishes offensive momentum, allowing Silvally-Rock to pivot away from and accrue residual damage on checks such as Sandslash and Throh. This Silvally-Rock set fits on balance and bulky offense builds that appreciate its offensive capabilities and good utility in Defog and U-turn. Grass-types such as Appletun, Gourgeist, and Lilligant appreciate Silvally-Rock checking Fire- and Ice-types such as Flareon and Mr. Rime, as well as Flying-types like Unfezant and Drifblim. In return, they can threaten Water- and Ground-types such as Golduck, Stunfisk, and Sandslash. Lilligant is a notable partner, able to capitalize on switches that Silvally-Rock forces to set up with Quiver Dance or heal up Silvally-Rock with Healing Wish, depending on its set. Setup sweepers such as Swords Dance Galarian Rapidash and Calm Mind Musharna benefit from Silvally-Rock clearing entry hazards and improving their longevity; in return, they can remove Fighting-types such as Throh and Falinks that trouble Silvally-Rock. Wallbreakers such as Mr. Rime and Beheeyem appreciate Silvally-Rock luring in physical walls such as Stunfisk and Sandslash to wreak havoc. Pokemon such as Klinklang and Drifblim can also lure in the aformentioned physical walls and cripple them with Toxic, allowing Silvally-Rock to potentially get off a Defog against them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 449990, "username": "DC"}]}
  },
  "Silvally-Water": {
    "overview": "<p>Often appearing on balance teams, Silvally-Water is a decent Defogger that is able to threaten common Stealth Rock setters such as Sandaconda and Regirock. It also possesses decent defensive utility and can easily pivot into its teammates with Parting Shot or U-turn. As a result of its weaknesses to Grass- and Electric-type moves, Silvally-Water is threatened by Pokemon such as Tsareena and Togedemaru. Silvally-Water also faces competition from Whimsicott and Charizard as an entry hazard remover. Silvally-Water can be worn down easily and struggles to consistently check foes such as Charizard. Furthermore, it is outclassed as a bulky Water-type by Pokemon such as Jellicent and Lanturn due to the former possessing recovery and the latter having an Electric immunity.</p> ",
    "sets": [
      {
        "name": "Defensive Defog",
        "description": "<p>Silvally-Water's teammates appreciate its ability to remove entry hazards and bring them in safely with Parting Shot or U-turn; its ability to lure foes such as Tsareena benefits Pokemon such as Magmortar, and it can also function as a slow pivot for frail partners such as Heavy-Duty Boots Archeops. Surf hits foes such as Sandaconda and Charizard super effectively. Ice Beam prevents foes such as offensive Whimsicott and Trevenant from switching into Silvally-Water. Thunderbolt can be used over Ice Beam, as it deters switch-ins from foes like Wishiwashi and Kabutops. Toxic is also an option to defeat bulky Water-types such as Jellicent and Lanturn. The EV spread makes Silvally-Water as bulky as possible while letting it outspeed foes such as Tsareena and Adamant Kabutops. Aromatisse is an extremely valuable teammate for Silvally-Water, as it is able to switch in comfortably on foes such Scrafty, which would otherwise use Silvally-Water as setup fodder, and provide Wish and cleric support. Silvally-Water appreciates Grass-type teammates such as Ferroseed, as they can switch into Electric-types such as Togedemaru and Lanturn for it. In return, Silvally-Water can defeat Fire-types such as Charizard and Centiskorch. Charizard is able to handle Grass-types such as Tangela and Gourgeist-S while benefitting from Silvally-Water's ability to deal with Rock-types such as Regirock.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 467518, "username": "Bag of Trixx"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 531302, "username": "Aqua Jet"}]}
  },
  "Turtonator": {"sets": [{"name": "Shell Smash"}, {"name": "Utility"}]},
  "Togedemaru": {
    "overview": "<p>Togedemaru stands out as one of the best Choice Scarf users in the tier thanks to its solid Speed tier, great offensive and defensive typing that allows it to check Pokemon such as Archeops and Whimsicott, ability to gain momentum through U-turn, and good abilities. Its unique defensive typing and access to recovery in Wish also makes Togedemaru a useful special wall for taking on certain difficult threats such as Ribombee and Vikavolt. However, despite its excellent set of resistances, its mediocre bulk and an unreliable recovery move limits Togedemaru's ability to directly switch into threats. Sitting at base 96 Speed, it is one of the fastest Choice Scarf users and can outspeed boosted setup sweepers like Modest Ludicolo and Silvally-Fairy. However, Togedemaru fails to OHKO many of these Pokemon due to its only average Attack stat and coverage options. Togedemaru faces strong competition as a specially defensive Steel-type from Aggron and Galarian Stunfisk, who can set up Stealth Rock, and as a Wish passer from Aromatisse due to its much higher HP stat.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Toxic is useful for crippling switch-ins like Palossand and Vikavolt rather than merely pivoting out with U-turn, while Encore is more effective at annoying bulky setup sweepers such as Scrafty. Lightning Rod is useful for pivoting into Volt Switch users such as Rotom and Vikavolt, but the chip damage from Iron Barbs is preferred if there is already an Electric-immune Pokemon on the team. Iron Barbs also helps defeat opposing Choice Scarf Togedemaru. While Togedemaru can be used throughout the match to tank some resisted hits, it is best brought in as a revenge killer or through slow pivots such as Lanturn and Uxie, which form a VoltTurn core with it. Due to Togedemaru's poor damage output, it appreciates entry hazards from the likes of Gigalith and Froslass to help wear down its foes. Wallbreakers such as Whimsicott and Magmortar can also help wear down the opposing team so Togedemaru can potentially clean late-game, and they also serve as checks for threats to Togedemaru such as Palossand and Vikavolt, respectively.</p> "
      },
      {
        "name": "Wish Passer",
        "description": "<p>Iron Head is Togedemaru's attacking move of choice because it better threatens Pokemon Togedemaru is aiming to check such as Frosmoth and Whimsicott and does not leave Togedemaru unable to hit Ground-types. U-turn allows Togedemaru to slightly circumvent its passivity by pivoting on predicted switches, but Toxic cripples many Pokemon that Togedemaru cannot do much damage to such as Vikavolt. Heavy-Duty Boots significantly decreases Togedemaru's weakness to Spikes, Leftovers helps make it slightly less reliant on Wish, and Rocky Helmet in tandem with Iron Barbs allows Togedemaru to punish a wide variety of contact attackers. However, Lightning Rod is preferred to stop Volt Switch users such as Vikavolt and Rotom. 8 Speed EVs allow Togedemaru to outspeed Adamant Centiskorch and Modest Frosmoth. Togedemaru can support many teammates lacking recovery with Wish, such as Weezing and Uxie, both of which also help against the Fighting-and Ground-types that threaten Togedemaru. Setup sweepers that can take advantage of Fighting- and Ground-types, such as Nasty Plot Mesprit and Quiver Dance Ribombee, appreciate being brought in through Togedemaru's U-turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 355061, "username": "UberSkitty"}]}
  },
  "Thwackey": {
    "overview": "<p>While there are better Grass-types in the tier such as Whimsicott and Trevenant, Thwackey primarily stands out with Grassy Surge, letting it support setup sweepers like Hitmonlee and making it a decent wallbreaker and revenge killer. It has limited coverage, but it can make up for that with Grassy Glide, raw strength behind its STAB Wood Hammer, and the utility of Knock Off and U-turn. However, the tier has a fair amount of Grass-resistant Pokemon that can outspeed and threaten Thwackey such as Charizard and Whimsicott. Thwackey also competes with Tsareena, which has better bulk, superior coverage, more natural strength, and access to Rapid Spin.</p> ",
    "sets": [{"name": "Choice Band", "description": "<p>Choice Band allows Thwackey to maximize its power combined with Grassy Terrain. Knock Off is able to cripple common Grass-resistant Pokemon such as Charizard and Tangela. U-turn allows Thwackey to pivot on Grass-resistant that are not heavily bothered by Knock Off such as Weezing and Silvally-Poison. Grassy Surge allows Thwackey to support setup sweepers such as Grassy Seed Hitmonlee and Swoobat. Ribombee is able to form a U-turn core with Thwackey and switch it in against bulky Water-types like Lanturn. Ribombee also appreciates Thwackey weakening Steel-types. Together, they can overwhelm Grass-resistant Pokemon like Weezing and Togedemaru. Uxie and Silvally-Fairy are reliable pivots that can switch in Thwackey to safely set Grassy Terrain again or sweepers like Hitmonlee and Thievul to set up. With Grassy Terrain, Aggron appreciates the weakened Earthquake damage and passive recovery.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 434150, "username": "gum"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Dubwool": {"sets": [{"name": "Cotton Guard"}]},
  "Drednaw": {"sets": [{"name": "Stealth Rock"}, {"name": "Rain Dance"}, {"name": "Swords Dance"}, {"name": "Choice Scarf"}]},
  "Boltund": {"sets": [{"name": "All-out Attacker"}]},
  "Coalossal": {
    "overview": "<p>While undoubtedly niche, Coalossal possesses a few attributes to stand out among other Rock-types. Unlike other entry hazard removers such as Charizard and Silvally-Fairy, it can set hazards, and it's sturdier then both. Coalossal's Fire typing gives it an easier time dealing with Bug- and Fairy-types, such as Ribombee and Whimsicott, than other Rock-types. Additionally, Flame Body lets it punish reckless U-turn users like Ninjask and other physical attackers. However, because of its common 4x weaknesses in Water and Ground, Coalossal is incredibly vulnerable to Pokemon like Quagsire, Sandaconda, and Jellicent. Additionally, many of the Pokemon it wishes to check, such as Charizard, Scyther, and Centiskorch, have coverage moves to chunk it or can cripple it with Knock Off for the latter two, or Toxic for Charizard. For these reasons, Coalossal can only fit into teams that require its specific niches, facing heavy competition from the likes of Gigalith, Regirock, and Aggron, which are all less passive than Coalossal and can hold Leftovers due to not needing Heavy-Duty Boots. Furthermore, Aggron's Steel typing lets it better check Psychic-types.</p> ",
    "sets": [
      {"name": "Specially Defensive", "description": "<p>Coalossal can opt for Spikes if used with another Stealth Rock setter. Rapid Spin is its claim to fame over other Rock-types. Defensive Jellicent is an ideal partner for Coalossal, as it checks Pokemon such as Poliwrath and Galarian Stunfisk for it. Ferroseed and Druddigon can stack entry hazards with Coalossal and provide extra utility, like both spreading paralysis, Ferroseed bringing Knock Off, and Druddigon checking Ground- and Fighting-types. As Coalossal appreciates checks to Water-, Ground-, and Fighting-types, like Silvally-Water, Palossand, and Gallade, Pokemon such as Whimsicott and Weezing make for good partners. Meanwhile, wallbreakers like Dragon Dance Scrafty and Trevenant appreciate hazard support from Coalossal and have good type synergy with it, as Coalossal checks the Fairy-, Fire-, and Flying-types that check Scrafty and Trevenant, while the latter checks both Water- and Ground-types for Coalossal.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 488506, "username": "iceblazer"}]}
  },
  "Flapple": {
    "overview": "<p>Flapple carves a niche for itself in PU as a brutally strong wallbreaker. With its Hustle-boosted attacks, Flapple can OHKO or 2HKO most Pokemon with its sheer strength while also dropping their Defense with Grav Apple, making it easier for a teammate to pick them off. Flapple's typing also allows it to take advantage of multiple defensive Pokemon such as Sandaconda and non-Ice Beam Lanturn. However, Flapple sports a detrimental 4x weakness to Ice as well as weaknesses to common types such as Flying, Bug, and Fairy. Additionally, its poor bulk makes Flapple unable to take many hits, and its middling Speed tier causes Flapple to pale in comparison to other offensive threats such as Charizard and Silvally formes. Hustle is also a double-edged sword for Flapple; while it does increase Flapple's potency as a wallbreaker, it also decreases accuracy by a fair amount, making it possible for Flapple to miss an attack and either be severely damaged or outright KOed. Flapple faces stiff competition from Tsareena as a Grass-type and Life Orb Gallade as a wallbreaker, as both Pokemon sport better bulk and Speed tiers while also offering more utility to a team.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>U-turn is used to gain momentum on predicted switches. Sucker Punch allows Flapple to pick off faster threats such as Galarian Articuno and Froslass. Grav Apple's guaranteed Defense drop also makes it easier to take out weakened Pokemon with Sucker Punch. If running Thwackey alongside Flapple, Grassy Glide is the preferred priority move. While Choice Band is preferred to maximize Flapple's wallbreaking power, Life Orb can be used to switch moves, albeit at the cost of reducing Flapple's longevity. Miracle Seed is an option to bluff Choice Band, although the loss of power on other attacks is noticeable. Steel-types such as Aggron and Togedemaru are able to force out Ice- and Fairy-types like Frosmoth and Ribombee, which Flapple cannot handle on its own, with Togedemaru also forming a U-turn core with Flapple. Fire-types like Charizard and Centiskorch can check Steel-types while providing valuable support with Toxic and Knock Off, respectively. As many of Flapple's checks are easily worn down, it greatly enjoys Spikes and Toxic Spikes support from the likes of Froslass and Weezing. Thwackey can offer Grassy Terrain support for Flapple, powering up Grav Apple even further and turning Grassy Glide into a reliable, STAB priority move. Finally, Pokemon that Flapple can bring in via U-turn, such as Lycanroc and Archeops, are recommended partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 202117, "username": "MZ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 488506, "username": "iceblazer"}]}
  },
  "Appletun": {"sets": [{"name": "Choice Specs"}, {"name": "Tank"}, {"name": "Physically Defensive"}]},
  "Sandaconda": {
    "overview": "<p>Sandaconda is able to serve as a consistent Stealth Rock user and Electric-immune Pokemon with its natural bulk and Shed Skin. With Shed Skin and Rest, Sandaconda is able to remain healthy throughout the game to check Pokemon like Gigalith, Aggron, and Togedemaru. Sandaconda also provides speed control with Glare, making it less easy to take advantage of. Sandaconda's decent Speed and Attack mean it can even commit to a Coil set, although its typing and poor Special Defense leaves it forced out by tier staples like Whimsicott. However, Sandaconda still faces competition from Palossand as a Stealth Rock user and Electric-immune Pokemon, as it has more consistent recovery and better bulk. Shed Skin is also not consistent, making it unsafe to be overly dependent on Rest.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Sandaconda is able to cripple Pokemon it cannot touch with Earthquake like Mesprit and Archeops with Glare. Rest is able to keep Sandaconda healthy and is more reliable in combination with Shed Skin. Rocky Helmet allows Sandaconda to wear down Pokemon such as Togedemaru. Leftovers gives Sandaconda more sustainability, but it is often switching into Knock Off from Pokemon like Absol anyway. The Speed investment allows Sandaconda to outspeed Adamant Aggron. Pokemon like Togedemaru and Lanturn are able to provide Wish and cleric support respectively so Sandaconda is less reliant on Shed Skin, and can sponge special attacks from Pokemon such as Ribombee and Charizard. In return, Sandaconda can switch into strong physical attackers like Lycanroc and Archeops. Wallbreakers such as Gallade and Magmortar are able to capitalize on Sandaconda spreading paralysis. Sandaconda can run Stone Edge over Glare to hit Flying-types like Archeops at the cost of providing less support.</p> "
      },
      {
        "name": "Defensive Coil",
        "description": "<p>With Coil, recovery, and the ability to expel status conditions with Shed Skin, Sandaconda becomes a dangerous threat late-game. Ground- and Rock-type moves hit the entire tier for neutral coverage. Stone Edge has more power and a higher critical hit chance but low PP, while Rock Slide has less power but higher PP, which is useful in longer games where the opponent can stall out Stone Edge PP. The Speed investment allows Sandaconda to move before Adamant Aggron, with the remainder of its EVs allocated to its special bulk. Some physical bulk could be useful to ease setup against Pokemon like Silvally formes and Scrafty. Grass- and Water-types such as Whimsicott and Wishiwashi prevent Sandaconda from setting up, so teammates that can switch into and threaten such foes are crucial to Sandaconda's success. Ferroseed has the bulk and typing to handle a majority of offensive Grass- and Water-types, and can take advantage of their presence as an opportunity to lay entry hazards. Charizard and Gourgeist-S similarly threaten the Grass- and Water-types that Sandaconda dislikes. These teammates also appreciate Sandaconda turning Archeops and Togedemaru into setup fodder late game, as they are forced out by both of them. Grass-type breakers like Trevenant and Gourgeist-S can bait in and wear down opposing Ground-type checks like Tangela and Claydol, while also forcing out Water-types like Poliwrath and Quagsire. Stealth Rock setters such as Gigalith and Miltank can allow Sandaconda to run Coil by filling in the role of a Stealth Rock user. In return, Sandaconda can switch into threatening Fighting-type foes like Scrafty, especially with the aforementioned physical bulk investment option.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 202117, "username": "MZ"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 229690, "username": "queez"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}, {"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Centiskorch": {
    "overview": "<p>Centiskorch makes for a great wallbreaker thanks to its fantastic movepool and great Attack, allowing it to beat most physically defensive walls and Fire-resistant Pokemon like Palossand, Gigalith, and Jellicent. Its ability Flash Fire, decent special bulk, and typing allow it to switch into threats like Magmortar and Ribombee, although its lack of recovery means it can't do so very often. However, Centiskorch's mediocre defensive typing, Speed, and Defense leave it susceptible to many faster threats like Absol, Archeops, and Basculin, which also makes it harder to get it in the field safely.</p> ",
    "sets": [{"name": "Wallbreaker", "description": "<p>Fire Lash makes Centiskorch harder to switch into, and it allows Centiskorch to get past defensive behemoths like Weezing and Jellicent more easily. Power Whip hits Ground-, Rock-, and Water-types, and Knock Off allows Centiskorch to cripple foes reliant on their items. Due to its poor physical bulk, typing, and Speed, Centiskorch greatly appreciates teammates capable of bringing it in safely; Archeops, Togedemaru, and Ribombee are great examples, as they all appreciate it weakening down their answers like Gigalith. Basculin is another great example, as it enjoys Centiskorch softening up Jellicent. Answers to Flying-, Rock-, and Water-types like Charizard, Aggron, and Kabutops are greatly appreciated, as Centiskorch often finds itself forced out by them. This makes Regirock and Ferroseed great partners as they can also support it with their Stealth Rock, giving it an easier time wallbreaking.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 444224, "username": "Juno"}, {"user_id": "userid2", "username": "TONE"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 434150, "username": "gum"}]}
  },
  "Grapploct": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Due to its ability to boost its stats with Bulk Up as well as its access to semi-reliable recovery in Drain Punch, Grapploct can function as a solid wincon on balance teams while also being able to check physical attackers such as Morpeko. Brutal Swing allows Grapploct to hit Psychic- and Ghost-types such as Musharna and Gourgeist, whereas Sucker Punch gives it the ability to hit faster Pokemon such as Boltund as well as deal with offensive teams in general. The given HP and Defense investment lets Grapploct avoid the 2HKO from Life Orb Drednaw's Liquidation after Stealth Rock, while the Special Defense EVs let it take Modest Choice Specs Glaceon's Ice Beam after Stealth Rock.</p> <p>Psychic-types such as Mr. Rime, Beheeyem, and Galarian Rapidash can handle Poison-types like Mareanie for Grapploct, while they in turn appreciate Grapploct's ability to handle Dark-types like Morpeko. Morpeko in turn aids Grapploct in dealing with Ghost- and Psychic-types, which Grapploct can struggle against while Beheeyem can provide slow momentum for Grapploct with Teleport. Entry hazard support from Pokemon such as Roselia and Stunfisk further aid Grapploct in wearing down foes. Fairy-types such as Galarian Rapidash and Shiinotic are difficult for Grapploct to deal with as well, so Pokemon such as Roselia, Drednaw, Mawile, and Flareon make for decent partners. Mawile and Pawniard also provide Knock Off support to weaken bulkier Pokemon such as Mareanie that can be problematic for Grapploct to handle. Healing Wish support from Pokemon such as Mr. Mime and Galarian Rapidash can provide Grapploct with a second chance to sweep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 331538, "username": "TJ"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 213583, "username": "TONE"}]}
  },
  "Hattrem": {"sets": [{"name": "RestTalk"}]},
  "Perrserker": {
    "overview": "<p>Boasting a high Attack stat, two abilities that boost its damage output even further, and access to moves like Seed Bomb and Close Combat to shred the likes of Quagsire and Ferroseed, Perrserker is a very powerful wallbreaker in PU with very few safe switch-ins. In combination with its natural immunity to Toxic and sand damage, this makes for a Pokemon adept at shredding defensive cores. However, Perrserker is very slow for an offensive Pokemon, leaving it outrun and dispatched by many offensive Pokemon such as Charizard, Gallade, Archeops, and Lycanroc. This gives it a much tougher matchup against faster, more offensive teams. Its special bulk is also very lacking, so Pokemon like Galarian Articuno and Ribombee can still heavily damage Perrserker, even though it resists their STAB moves—despite being a Steel-type, Perrserker doesn't contribute much defensive value to your team.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance lets Perrserker break through most of PU's defensive Pokemon. Seed Bomb hits the Water-types that resist Iron Head, 2HKOing Quagsire and, after Swords Dance, OHKOing Lanturn and 2HKOing Jellicent. Substitute allows Perrserker to set up on weak walls like Ferroseed and Tangela, as well as dodging Weezing and Jellicent's Will-O-Wisp. Steely Spirit boosts Iron Head's power to massive levels, allowing it to 2HKO Weezing and Tangela at +2. Fire-types like Charizard and Centiskorch are highly problematic for this set, so Rock-types like Regirock and Gigalith are great teammates for checking them. Both can also set Stealth Rock for Perrserker. Charizard can scorch the Steel-types that wall this set like Ferroseed and defensive Togedemaru, and it appreciates Perrserker smashing the aforementioned Rock-types, as well as KOing Lanturn and Jellicent. Spikes setters like Garbodor and Qwilfish can help give Perrserker an easier time wallbreaking—one layer of Spikes guarantees an OHKO on Regirock with a +2 Iron Head. Both can also switch into the Fighting-types Perrserker is weak to, such as Scrafty. Fast cleaners like Archeops and Ribombee can take advantage of the holes Perrserker can punch in teams.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Close Combat hits opposing Steel-types such as Aggron and Ferroseed, OHKOing the former and 2HKOing the latter. Seed Bomb hits the Water-types that resist Perrserker's STAB Iron Head, OHKOing Quagsire and 2HKOing Jellicent. U-turn allows Perrserker to scout switch-ins and safely bring in a teammate. Double-Edge OHKOes Charizard and Centiskorch on the switch if running Tough Claws, two Pokemon that otherwise switch into Perrserker with ease. Tough Claws is the preferred ability on this set, as it powers up all of Perrserker's moves bar Seed Bomb. Steely Spirit can still be used, as it allows Perrserker to 2HKO Sandaconda and Palossand with a slightly stronger Iron Head. This set serves the dual roles of wallbreaker and offensive pivot. Against more defensive teams, Perrserker can use its massive power to smash defensive Pokemon like Regirock and Gigalith, as well as switching into predicted Stealth Rock and Toxic. Against offensive teams, it's best used to check physically frail Pokemon like Galarian Articuno and Ribombee, and it can use the forced switches to safely bring in a teammate with U-turn or fire off a strong attack. Fast Pokemon like Archeops and Choice Specs Ribombee are good teammates to threaten the more offensive teams Perrserker struggles with, while Perrserker can threaten the bulkier teams they struggle with. They all also appreciate the free switches Perrserker can give them with U-turn.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 346653, "username": "avarice"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 278934, "username": "ChrystalFalchion"}]}
  },
  "Cursola": {"sets": [{"name": "Weak Armor Breaker"}, {"name": "Choice Specs"}]},
  "Mr. Rime": {"sets": [{"name": "Rapid Spin"}, {"name": "Choice Specs"}, {"name": "Specially Defensive"}]},
  "Runerigus": {
    "overview": "<p>Runerigus is able to provide a fair amount of utility with its typing and ability to spread both status and entry hazards. It has the natural Defense to withstand strong attacks from Pokemon like Lycanroc and various Silvally formes. Runerigus is also capable of being a setup sweeper to become less passive and take advantage of Pokemon like Toxic Regirock expecting to just wear it down. However, its typing leaves it vulnerable to common wallbreakers like Tsareena and Froslass. It also faces heavy competition from Palossand, which has similar defensive qualities and reliable recovery, although it lacks Toxic Spikes and is generally more one-dimensional. Cofagrigus rivals Runerigus as a bulky setup sweeper with its typing and is better at keeping up Toxic Spikes, as it can safely spinblock Tsareena. However, Runerigus is able to fit Amnesia more easily.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Runerigus's bulk gives it a fair amount of opportunities to set up entry hazards against Pokemon like Archeops and Togedemaru. Leftovers provides passive recovery, while Colbur Berry lets Runerigus switch into Knock Off users like Gallade and Sawk comfortably. Earthquake hits Magmortar and Charizard using Roost, but Body Press can be used for more damage against switch-ins like Tsareena and Scrafty while still hitting typical Earthquake targets like Regirock and Gigalith. Will-O-Wisp cripples Archeops and deters Swords Dance Silvally formes. Toxic Spikes lets Runerigus spread more status and support setup sweepers like Charizard and Gallade. Poltergeist is an alternative to hit Pokemon like Whimsicott and Ribombee as well as opposing Ghost-types like Haunter. Rest gives Runerigus some form of recovery and pairs nicely with clerics like Aromatisse and Lanturn that can reliably beat special attackers such as Charizard and Magmortar that Runerigus struggles against. Aromatisse can also deal with Scrafty and provides Wish support for it.</p> "
      },
      {
        "name": "Bulky Setup Sweeper",
        "description": "<p>Runerigus is able to further push its defensive capabilities with Iron Defense and Amnesia to become a durable setup sweeper. Full Defense investment maximizes Body Press's power, but a specially defensive spread can be used to more comfortably boost against Galvantula and Charizard. Rest is Runerigus's only means of recovery and prevents it from being worn down by Toxic. Body Press allows it to capitalize on Iron Defense further and hit extremely hard. Leftovers provides passive recovery to lessen the need to use Rest, but Chesto Berry can be used for a free Rest and to have an easier time snowballing. Runerigus is completely walled by opposing Ghost-types like Froslass and Haunter with this set, so it benefits from Dark-types like Scrafty and Absol to pressure them. Weezing can spread burns to give Runerigus more setup opportunities and use Toxic Spikes to prevent Ghost-types like Palossand and Gourgeist from stalling it out. Fighting-types like Hitmontop and Gallade can check opposing Dark- and Ice-types like Absol and Arctovish and draw in bulky Pokemon like Quagsire and Sandaconda that Runerigus can use as setup fodder. Runerigus is also vulnerable to Pokemon such as Tsareena and Choice Specs Whimsicott that can break past it before it can boost high enough, so offensive checks to them like Charizard and Silvally-Steel are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 202117, "username": "MZ"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 346653, "username": "avarice"}]}
  },
  "Alcremie": {"sets": [{"name": "Offensive"}, {"name": "Bulky Booster"}, {"name": "Three Attacks"}]},
  "Falinks": {"sets": [{"name": "All-out Attacker"}, {"name": "Swords Dance"}, {"name": "No Retreat"}]},
  "Pincurchin": {"sets": [{"name": "Terrain Setter"}, {"name": "Defensive"}, {"name": "Choice Specs"}]},
  "Frosmoth": {
    "overview": "<p>Despite competition from Ribombee, with its superior typing and speed, as a Bug-type sweeper, Frosmoth makes for a niche yet threatening setup sweeper thanks to Quiver Dance and potent offensive coverage. Ice Scales also gives it many setup opportunities against special attackers such as Mesprit and Whimsicott, which differentiates it from Ribombee. Frosmoth's underwhelming Speed and physical bulk, mediocre defensive typing, and inability to hit Steel-types for significant damage render it easy to revenge kill and a liability in certain matchups.</p> ",
    "sets": [
      {
        "name": "Quiver Dance",
        "description": "<p>Substitute allows Frosmoth to avoid status conditions from Pokemon like Lanturn and Palossand while making it harder to revenge kill. Giga Drain grants Frosmoth with recovery and targets Water-types like Jellicent, as well as dealing super effective damage to Rock-types like Regirock and Gigalith. Frosmoth greatly appreciates partners that can wear down the Steel-types it struggles to get past; Choice Specs Whimsicott and Mesprit make for great options, and they can both also cripple Pokemon like specially defensive Aggron and Togedemaru by using Switcheroo and Trick, respectively. Due to its lackluster Speed tier, Frosmoth finds itself easily revenge killed by threats like Choice Scarf Togedemaru; teammates like Silvally-Ghost and Coil Sandaconda can use the aforementioned threats that Frosmoth invites in as setup fodder. Charizard can wear down Pokemon like Gigalith with Toxic and can threaten Steel-types like defensive Togedemaru.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 346653, "username": "avarice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}], "writtenBy": [{"user_id": 434150, "username": "gum"}]}
  },
  "Stonjourner": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}, {"name": "Stealth Rock / Rock Polish"}]},
  "Eiscue": {
    "sets": [
      {
        "name": "Belly Drum",
        "description": "<p>Eiscue's unique Ability in Ice Face and access to Belly Drum make it a threatening, albeit matchup dependent, late-game sweeper. Reversal is an 80-Base Power attack after Eiscue uses Substitute and Belly Drum, providing great neutral coverage alongside Eiscue's Ice STAB and letting it take down Steel-type Pokemon it otherwise couldn't, such as Mawile, Pawniard, and Klang, as well as Lapras. Zen Headbutt sacrifices hitting those target in order to cover Mareanie, which otherwise walls Eiscue. Liquidation is a niche option that deals more damage to the aforementioned targets before Eiscue is set up. Substitute provides Eiscue with protection from status and revenge killing, and lets it activate its Salac Berry after using Belly Drum, outspeeding most of the unboosted metagame even if Ice Face hasn't been activated and outrunning even the fastest boosted Pokemon, like Choice Scarf Manectric and Quick Feet Galarian Linoone, if it has been activated. Belly Drum brings Eiscue's otherwise mediocre Attack stat to ridiculous levels, making it vital to sweeping. A Jolly nature with maximum Speed investment is used to let Eiscue outspeed fast Pokemon like Leafeon and Silvally at +1 if Ice Face isn't activated.</p> <p>Eiscue fits best on offensive teams that can break through its defensive answers. If Eiscue isn't running Zen Headbutt, teammates that can take on Mareanie are absolutely vital. Good examples of these teammates include Electric-type Pokemon like Manectric and Raichu and Psychic-type Pokemon like Mr. Mime, Musharna, and Mr. Rime, the latter of which can also remove entry hazards. Roselia can use Spikes or Toxic Spikes to help wear down the opponent's defensive backbone, check Water-types, put opposing Pokemon to sleep to provide Eiscue with more setup opportunities, and removes Toxic Spikes, which would otherwise shut Eiscue down. If Eiscue isn't running Reversal, teammates that can take on Steel-types are important. Falinks and Hitmontop are good at pressuring foes like Mawile, Klang, and Pawniard offensively, with Falinks fitting very well on hyper offense and Hitmontop offering hazard removal and reliable priority. The aforementioned Psychic-types are also great options for wearing down Steel-types, as most teams rely on those Pokemon to take them on, with Mr. Rime, Mr. Mime, and Musharna giving Eiscue a safe switch and a second chance at setting up via Healing Wish. Pivots such as the aforementioned Electric-type Pokemon, Silvally formes, and Drakloak can be useful for getting Eiscue on the field safely against Pokemon that it threatens, like Roselia, or that can't bypass Ice Face, as is the case for most physical attackers lacking Knock Off. Stonjourner makes for a strong lead option on offense that can provide Stealth Rock support and threaten several of Eiscue's answers with Earthquake. Other setup sweepers, like Fraxure, Pawniard, and the previously mentioned Falinks and Raichu, are effective at softening the opponent's defensive backbone for Eiscue. Wallbreakers like Swords Dance Mawile, Throh, and Choice Band Fraxure are effective teammates for the same purpose, with the former two being able to use Knock Off on sturdy answers to Eiscue, like Mareanie and Klang, that rely on their Eviolite to function effectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 434150, "username": "gum"}, {"user_id": 442732, "username": "Laurenbee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 375272, "username": "Eve"}]}
  },
  "Morpeko": {"sets": [{"name": "Offensive Support"}, {"name": "Wallbreaker"}, {"name": "Offensive Substitute"}]},
  "Calyrex": {"sets": [{"name": "Choice Specs"}]}
}