{
  "Cresselia": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>Cresselia is the bulkiest option avaliable for a Calm Mind user.</p> </li> <li> <p>Stored Power takes time to gain power, but after 2 Calm Minds, it becomes Cresselia's most powerful STAB attack. Psyshock can be used to defeat Tapu Fini in Calm Mind wars if they lack Taunt, win against Raikou, and deal massive damage to Nihilego.</p> </li> <li> <p>Ice Beam hits a lot of high value targets hard, such as Landorus-T, Salamence, and Garchomp. Moonblast still does good damage to Dragon-types, and makes Cresselia less vulnerable to Dark-types like Urshifu-S.</p> </li> <li> <p>Substitute allows Cresselia to set up in the face of status users such as Celesteela, Swampert, and Hippowdon that lack Whirlwind. However, this makes Cresselia completely useless against Dark-types, so don't choose it in team preview if they are seen.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Kee Berry's Defense boost helps Cresselia against powerful Dynamaxing threats such as Cinderace and Landorus-T, all while giving another 20 BP boost to Stored Power.</p> </li> <li> <p>Sitrus Berry gives Cresselia a short burst of extra health, making it more difficult to break past in the short term.</p> </li> <li> <p>Leftovers gives more long-term recovery, which is helpful in slower-paced matches.</p> </li> <li> <p>Rocky Helmet is useful for punishing Pokemon that commoningly use physical contact moves, such as Cinderace and Urshifu-R.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 252 Bold / 4 Spe Bold: This spread maximizes Cresselia's physical bulk.</p> </li> <li> <p>252 HP / 100 Def / 156 Spe Bold: This spread is suggested for Substitute Cresselia. It outspeeds up to Timid Celesteela, allowing Cresselia to set up Substitute before Celesteela hits with Leech Seed.</p> </li> </ul>"
      },
      {
        "name": "Trick Room Support",
        "description": "<ul> <li> <p>Cresselia is an extremely bulky option for Trick Room, and with Lunar Dance, it's the only viable one that can give Trick Room sweepers another chance at sweeping.</p> </li> <li> <p>Psychic is a reliable STAB option if Cresselia needs to do some damage, but Ice Beam hits a wide variety of targets harder such as Landorus-T, Salamence, and Garchomp.</p> </li> <li> <p>Even though this Cresselia often sacrifces itself with Lunar Dance, Moonlight is still good to have to potentially wall certain Pokemon.</p> </li> <li> <p>When using this Cresselia, always pair it with 1-2 slow Pokemon that can take advantage of Trick Room. Glastrier is by far the most dangerous Trick Room sweeper, so it comes highly recommended. Other options for slow Pokemon include Celesteela, Heatran, Magnezone, and Ferrothorn.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Sitrus Berry gives Cresselia a quick burst of recovery. This is more valuable than Leftovers, since Cresselia often sacrifices itself anyways.</p> </li> <li> <p>Rocky Helmet is still good for punishing contact moves from common foes such as Cinderace and Urshifu-R.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Zacian-Crowned": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [
      {"name": "All-out Attacker", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>236 HP / 252 Atk / 4 Def / 4 SpD / 12 Spe with Adamant:</strong> This bulky EV spread maximizes Zacian-C's power, while still outspeeding Garchomp.</p> </li> <li> <p><strong>236 HP / 180 Atk / 4 Def / 4 SpD / 84 Spe with Adamant: This spread outspeeds Timid Lugia at the cost of some power.</p> </li> <li> <p><strong>236 HP / 92 Atk / 4 Def / 164 SpD / 12 Spe with Adamant:: This Specially Defensive spread survives Modest Life Orb Yveltal's Max Flare and Timid Choice Scarf Kyogre's Water Spout.</p> </li> <li> <p><strong>252 Atk / 4 SpD / 252 Spe with Jolly: Maximizing Speed allows Zacian-C to outspeed Eternatus and Marshadow, at the cost of having the bulk to effectively trade blows.</p> </li> </ul>"},
      {"name": "Swords Dance Sweeper", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 Atk / 4 SpD / 252 Spe with Jolly:</strong> Maximizing Speed lets Zacian-C defeat Marshadow with Stealth Rock support, outspeed Eternatus, and is the best bet against opposing Zacian-C after Swords Dance.</p> </li> <li> <p><strong>236 HP / 180 Atk / 4 Def / 4 SpD / 84 Spe with Adamant: This spread sacrifices some power to survive Focus Sash Landorus-T's Earthquake, and still outspeed Timid Lugia.</p> </li> </ul>"}
    ]
  },
  "Clefable": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {"name": "Kee Berry Sweeper", "description": "<ul> <li> <p>This Clefable aims to take advantage of opposing setup sweepers in order to augment its own stats and reverse sweep.</p> </li> <li> <p>Moonlight is chosen to guarantee quick healing and for getting boosted healing in sun, which can be set by Clefable's own Max Flare. Be wary of its low PP and other weathers before committing to sweeping and relying on it for healing.</p> </li> <li> <p>Kee Berry is used to grant Clefable a one-time boost of Defense and can be used in combination with Dynamax to ensure Clefable can survive hits such as Excadrill's Iron Head.</p> </li> <li> <p>The given EV spread gives near maximum physical bulk and is used to survive an initial physical hit as well as possible before getting the +1 Defense boost from Kee Berry.</p> </li> </ul>"},
      {"name": "Trick Crippler", "description": "<ul> <li> <p>Clefable when equipped with Flame Orb or Lagging Tail can cripple various attackers, making them easy setup fodder for teammates.</p> </li> <li> <p>Stealth Rock provides additional support, but can be sacrificed for Flamethrower coverage, in order to ensure Ferrothorn and Celesteela cannot switch in with impunity.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Flame Orb allows Clefable to cripple physical attackers with Trick.</p> </li> <li> <p>Lagging Tail and Full Incense are an extremely effective form of Speed control with Trick, with even fast Pokemon, and Pokemon under Trick Room being impacted by it.</p> </li> <li> <p>Leftovers can also be opted for, and provides a decent all around Stealth Rock lead with two useful complementary attacks.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": []}
  },
  "Chansey": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Physically Defensive"}, {"name": "Specially Defensive"}]},
  "Gyarados": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Gyarados's combination of unique typing and movepool make it a good choice for Max Airstream sweeping.</p> </li> <li> <p>Dragon Dance is a great option on Gyarados, making it less reliant on Dynamax to sweep.</p> </li> <li> <p>Power Whip provides coverage against bulky Water-types, most notably slamming Rotom-W, Tapu Fini, and Swampert.</p> </li> <li> <p>Earthquake deals massive damage to Electric-types such as Raikou, Tapu Koko, and Magnezone, while giving Gyarados a valuable Special Defense boost as Max Quake.</p> </li> <li> <p>Taunt deserves special mention for shutting down passive Pokemon such as Hippowdon, Swampert, and defensive Celesteela, giving Life Orb Gyarados more set up opportunities.</p> </li> <li> <p>Ice Fang is also a reasonable coverage option, hitting Dragon-types such as Garchomp, Salamence, and Dragonite much more effectively.</p> </li> <li> <p>Stone Edge is Gyarados's strongest option against Zapdos.</p> </li> <li> <p>Intimidate is a good choice for allowing Gyarados to set up Dragon Dance more freely, while Moxie allows Gyarados to potentially sweep with just KOs from Max Airstream.</p> </li> <li> <p>A Jolly nature and the given EV spread ensures that Gyarados outspeeds Tapu Koko and Dragapult after a Speed boost.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Lum Berry insulates Gyarados from status such as Sleep and Burn. When used with Dragon Dance, this makes Gyarados an effective lead against Hippowdon and Swampert.</p> </li> <li> <p>Life Orb makes Gyarados an effective Dynamax sweeper, and should always be used if Gyarados gives up Dragon Dance for more coverage.</p> </li> <li> <p>Wacan Berry is a less common option for Gyarados that lets it survive some Electric-type attacks while Dynamaxed.</p> </li> </ul>"
      },
      {
        "name": "Bulky Dragon Dance",
        "description": "<ul> <li> <p>This Gyarados takes a slower approach to sweeping, and uses increased bulk and Intimidate to better check major threats.</p> </li> <li> <p>Taunt is extremely useful for punishing passive Pokemon that Gyarados may otherwise have trouble setting up on, such as Hippowdon, Swampert, and defensive Celesteela.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Sitrus Berry is a good, reliable way for Gyarados to gain back a short burst of health.</p> </li> <li> <p>When paired with Chesto Berry, Rest is useful for giving Gyarados a second chance at sweeping later, at the cost of immediate recovery that Sitrus Berry provides.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 156 Def / 100 Spe with Impish: This EV spread allows Gyarados to outspeed Nihilego with one Speed boost, and avoid a 2HKO from Life Orb Cinderace's Max Airstream with Sitrus Berry after Stealth Rock damage.</p> </li> <li> <p>252 HP / 252 Def / 4 Spe with Impish: This EV spread maximizes Gyarados's physical bulk.</p> </li> <li> <p>156 HP / 164 Def / 188 Spe with Impish: This EV spread outspeeds Timid Celesteela, while still giving Gyarados a 95% chance to avoid a 2HKO from Cinderace's Life Orb Max Airstream after Stealth Rock and Sitrus Berry.</p> </li> <li> <p>252 HP / 132 Atk / 20 Def / 4 SpD / 100 Spe with Adamant: This is a more offensive approach for Gyarados, allowing it to survive two Max Airstreams from Life Orb Cinderace after Sitrus Berry, and outspeed Nihilego after one Speed boost</p> </li> <li> <p>252 HP / 20 Def / 4 SpD / 232 Spe with Jolly: This EV spread allows Gyarados to outspeed up to Timid Dragapult and Tapu Koko after one Speed boost, while being able to avoid a 2HKO from Life Orb Cinderace's Max Airstream after Sitrus Berry.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Lapras": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "G-Max Resonance"}]},
  "Ditto": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Revenge Killer", "description": "<h1>Items</h1> <ul> <li> <p><strong>Choice Scarf</strong>: This is the best option for revenge killing with Ditto.</p> </li> <li> <p><strong>Focus Sash</strong>: While very weak to Stealth Rock set up, being able to switch moves can make Ditto more effective at reverse sweeping without needing to Dynamax.</p> </li> </ul>"}]},
  "Snorlax": {
    "overview": "<h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {"name": "Gmax Setup Sweeper", "description": "<ul> <li> <p>Snorlax can use Belly Drum or Curse to raise its stats to frightening levels and break many Pokemon who would otherwise wall it.</p> </li> <li> <p>Heavy Slam and Earthquake are both great coverage choices in the Crown Tundra metagame, and when using them with Gigantamax, it allows Snorlax to boost its Defense and Special Defense with their respective Max Moves.</p> </li> <li> <p>Figy Berry helps Snorlax gain back significant health when dropped below half HP, and can also be restored with Gmax Replenish.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>220 HP / 212 Def / 76 SpD Careful: This spread deals with prominent Special Attack boosting foes, such as Nihilego, and helps Snorlax wall with both its physical and special bulk.</p> </li> <li> <p>212 HP / 252 Def / 52 Spe Impish: Outspeeds Toxapex to avoid getting hit by Haze following a Belly Drum.</p> </li> </ul>"},
      {"name": "Yawn Support", "description": "<ul> <li> <p>Snorlax is a solid Yawn abuser, living nearly all Max Move attacks at full HP to guarantee disruption to its foes.</p> </li> <li> <p>Heavy Slam allows Snorlax to hit the relevant Ghost-types well and boosts Defense with Max Steelspike, while Earthquake hits Nihilego and Heatran well, and raises Special Defense with Max Quake.</p> </li> <li> <p>Leftovers is used with Thick Fat, regular form Snorlax, and Protect, as those have the most impact when no berry is held. Figy Berry is used with Gluttony and Gigantamax in order to gain back health when in a pinch, and can also be restored with Gmax Replenish or Recycle.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": []}
  },
  "Zapdos": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Dynamax Attacker"}]},
  "Zapdos-Galar": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B- Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Dynamax Sweeper",
        "description": "<ul> <li> <p>Galarian Zapdos has the tools to be a decent Max Airstream sweeper, though its poor match-up against other Max Airstream sweepers limits its potential.</p> </li> <li> <p>Close Combat is Galarian Zapdos's most powerful STAB. Thunderous Kick's Defense drop does play better to hit and run tactics, however.</p> </li> <li> <p>Brave Bird is the obvious choice for a strong Max Airstream, but Dual Wingbeat can be useful for busting through Urshifu-R's Focus Sash after a boost, and dealing damage through Mimikyu's Disguise.</p> </li> <li> <p>Bulk Up is Galarian Zapdos's only means to set up outside of Dynamax, and can be key to helping it survive unfavorable physical match-ups with the Defense boost.</p> </li> <li> <p>Blaze Kick is Galarian Zapdos's strongest attack against Celesteela if Dynamaxed.</p> </li> <li> <p>Taunt punishes passive Pokemon like Hippowdon, Swampert, and Ferrothorn.</p> </li> <li> <p>U-turn can make Galarian Zapdos a decent pivot.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy works well with Dynamax, especially considering how many weaknesses Galarian Zapdos has.</p> </li> <li> <p>Life Orb is a good alternative that doesn't put as much pressure on Dynamaxing.</p> </li> <li> <p>Lum Berry protects Galarian Zapdos from status, making it more difficult to stop while Dynamaxed.</p> </li> </ul>"
      },
      {"name": "Choice Attacker", "description": "<ul> <li> <p>Galarian Zapdos has a good enough Speed tier and offenses to make a decent Choice Attacker. It also has access to U-turn, which is useful for pivoting.</p> </li> <li> <p>Close Combat is the obvious choice for a strong Fighting-type STAB, but Thunderous Kick's guaranteed Defense drop can come in handy if Galarian Zapdos must switch out.</p> </li> <li> <p>Brave Bird is the prefered choice for a Flying-type STAB, but Dual Wingbeat is a reasonable option to hit through Focus Sash and Mimikyu's disguise.</p> </li> <li> <p>Blaze Kick is Galarian Zapdos's strongest option against Celesteela while Dynamaxed.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Scarf lets Galarian Zapdos outspeed several key threats, such as Pheromosa and Dragapult.</p> </li> <li> <p>Choice Band makes Galarian Zapdos harder to switch in to, most notably 2HKOing defensive Tapu Fini with Brave Bird.</p> </li> </ul>"},
      {"name": "Focus Sash", "description": "<ul> <li> <p>With Counter and Focus Sash, Galarian Zapdos can surprise common problematic Max Airstream users such as Cinderace and Landorus-T with a KO.</p> </li> <li> <p>Close Combat is an easy choice with its high power, but Thunderous Kick benefits hit and run tactics more.</p> </li> <li> <p>Since Galarian Zapdos is using Focus Sash, Dual Wingbeat is the best choice for a Flying-type STAB.</p> </li> <li> <p>U-turn allows Galarian Zapdos to pivot out of unfavorable match-ups, but Taunt is useful for shutting down Stealth Rock set up from more passive Pokemon. Bulk Up can give Galarian Zapdos the Attack boost it needs to pull off a surprise late-game sweep.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Moltres-Galar": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Dynamax Sweeper"}]},
  "Dragonite": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Physical Sweeper"}, {"name": "All-Out Attacker"}]},
  "Azumarill": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Bad Bunny (Huge Power Wallbreaker)",
        "description": "<ul> <li> <p>Azumarill is an uncommon but unique wallbreaker in Battle Stadium, with decent bulk, useful dual STAB coverage, and a great priority move to beat much of the metagame that doesn't resist its attacks.</p> </li> <li> <p>Superpower gives Azumarill a way to beat Ferrothorn while providing Max Knuckle Attack boosts during Dynamax, whereas Bounce is used with Life Orb to help Azumarill become a surprise sweeper.</p> </li> <li> <p>The given EVs allow Azumarill to have decent bulk while outspeeding uninvested Celesteela, and avoiding a Special Attack boost from Download Porygon2. The leftover 4 EVs can be put anywhere but Defense.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Assault Vest makes Azumarill quite bulky, especially while Dynamaxed.</p> </li> <li> <p>Choice Band makes Azumarill an effective hit and run attacker.</p> </li> <li> <p>Life Orb, while compromising Azumarill's bulk, is the most effective wall-breaking tool for it, making Azumarill a good Dynamax attacker.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": []}
  },
  "Quagsire": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Zacian-C Check"}]},
  "Umbreon": {
    "overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>",
    "sets": [
      {
        "name": "KINGSLAYER (Defensive Support)",
        "description": "<ul> <li> <p>With its good bulk, Yawn, and STAB Foul Play, Umbreon has a small niche as an answer to both Calyrex-S and Calyrex-I.</p> </li> <li> <p>Foul Play provides consistent damage, puts heavy pressure on Calyrex-S thanks to its quadruple weakness, and can do decent damage to Zacian-C trying to come in.</p> </li> <li> <p>Snarl is less useful against Calyrex-I, but it can completely shut down Calyrex-S, as well as annoying most special threats thanks to the Special Attack drop.</p> </li> <li> <p>Moonlight can be used in place of Wish for instant, though inconsistent, recovery.</p> </li> <li> <p>Though Umbreon should only Dynamax in the most dire of situations, a Careful nature will make Max Darkness slightly stronger.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Leftovers is the most sensible item, granting Umbreon consistent passive recovery, lessening the need to use Wish and Protect.</p> </li> <li> <p>Sitrus Berry is an alternative to Leftovers, providing Umbreon with a quick burst of health after taking some damage.</p> </li> <li> <p>Utility Umbrella can allow Umbreon to better stand up to Kyogre, and it also enables more consistent recovery if using Moonlight. However, even with Utility Umbrella, Umbreon should not be relied on as a Kyogre answer.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 4 Def / 252 SpD with Calm - This spread maximizes Umbreon’s special bulk, allowing it to consistently check Calyrex-S.</p> </li> <li> <p>252 HP / 252 Def / 4 SpD with Bold - This spread allows Umbreon to better take physical attacks but severely hinders its consistency against Calyrex-S and other special threats.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "DerpySuX", "user_id": 528485}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "Tox", "user_id": 146}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Skarmory": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Physical Wall"}]},
  "Porygon2": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Defensive"}, {"name": "Specially Defensive"}]},
  "Blissey": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Calm Mind"}]},
  "Raikou": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A- Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>Raikou's great Speed stat and shockingly good coverage make it a good choice for Calm Mind sweeping.</p> </li> <li> <p>Substitute pairs very well with Pressure for PP stalling, punishes more flimsy checks, and also protects Raikou from status.</p> </li> <li> <p>Rest with Chesto Berry is a reasonable alternative for giving Raikou more chances to set up Calm Mind.</p> </li> <li> <p>Volt Switch lets Raikou function as a pivot when needed. Extrasensory is mainly for hitting Naganadel as hard as possible.</p> </li> <li> <p>Shadow Ball does good damage to Dragapult, and Aura Sphere can be used if your team has issues with Ferrothorn.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Leftovers pairs the best with Calm Mind and Substitute.</p> </li> <li> <p>Life Orb turns Raikou into a more immediate sweeper, and works especially well when Raikou Dynamaxes.</p> </li> <li> <p>Always hold Chesto Berry when using Rest, as Raikou can't afford spending time asleep.</p> </li> </ul>"
      },
      {"name": "Choice Specs", "description": "<ul> <li> <p>Raikou's ability to pivot with Volt Switch, combined with its good Speed stat and coverage, make Choice Specs a reasonable option for it.</p> </li> <li> <p>Extrasensory is Raikou's best attack against Naganadel, while Shadow Ball hits Dragapult hard. Aura Sphere lets Raikou deal a good amount of damage to Ferrothorn, who otherwise walls Raikou.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Suicune": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>Suicune has some trouble competing with Tapu Fini as a bulky Water-type, but access to tools such as Pressure and a unique movepool give it some niches over the more common Pokemon.</p> </li> <li> <p>Ice Beam is Suicune's most reliable coverage against Dragon-types such as Salamence and Dragapult. Sheer Cold isn't very reliable, but it does give Suicune a 20% chance to OHKO extremely bulky Pokemon such as Tapu Fini and Cresselia, and still gives Suicune a powerful Max Hailstorm.</p> </li> <li> <p>Icy Wind deserves mention for giving Suicune a decent option for Speed control.</p> </li> <li> <p>Air Slash gives Suicune access to Max Airstream, a rare tool for bulky Water-types.</p> </li> <li> <p>Substitute saves Suicune from status moves such as Yawn and Leech Seed, letting it set up on certain passive Pokemon such as Swampert and defensive Celesteela.</p> </li> <li> <p>When paired with Chesto Berry, Rest gives Suicune one chance to recover all its health without much consequence, something Tapu Fini is unable to do.</p> </li> <li> <p>Roar lets Suicune win Calm Mind wars against any Pokemon that lacks Taunt, in addition to phazing set-up sweepers in general before they Dynamax.</p> </li> <li> <p>Protect pairs well with Pressure and Leftovers, letting Suicune scout common choice locked Pokemon such as Rillaboom and Regieleki.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Leftovers gives Suicune the most sticking power for its more defensive variants, and pairs well with Substitute and Protect.</p> </li> <li> <p>Sitrus Berry gives Suicune a more immediate burst of health, useful for more offensive variants.</p> </li> <li> <p>Chesto Berry lets Suicune wake up from Rest without wasting a turn.</p> </li> <li> <p>Weakness Policy is an unusual option that lets Calm Mind Suicune take advantage of common checks while Dynamaxed, such as Tapu Koko and Regieleki.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 100 Def / 156 Spe with Bold: This EV spreads outspeeds up to Timid Celesteela, while giving Suicune good physical bulk.</p> </li> <li> <p>100 HP / 252 SpA / 156 Spe with Modest: This is a more offensive take on Suicune that still outspeeds Timid Celesteela.</p> </li> <li> <p>252 HP / 252 Def / 4 Spe with Bold: This EV spread maximizes Suicune's physical bulk.</p> </li> <li> <p>4 HP / 252 SpA / 252 Spe with Modest or Timid: This is a far more offensive approach to Suicune, maximizing its power and Speed to take advantage of Max Airstream. Modest gives Suicune some extra fire power and outspeeds up to Timid Tapu Koko after a Max Airstream, while Timid outspeeds Dragapult.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Tyranitar": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Bulky Attacker"}, {"name": "Support"}]},
  "Lugia": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [{"name": "Dynamax Sweeper", "description": "<h1>EV Spreads</h1> <ul> <li><strong>196 HP / 4 Def / 148 SpA / 4 Def / 180 Spe with Timid</strong>: The HP investment allows Multiscale Lugia to avoid a 2HKO from non-offensive boosting item Calyrex-S, and outspeed Timid Zapdos.</li> </ul>"}, {"name": "Paralysis Spreader", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 108 Def / 148 Spe with Bold</strong>: The given Speed allows Lugia to outspeed Calyrex-S after using Max Airstream.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe with Bold: This spread maximizes Lugia's Defense, making it a more reliable check against Zacian-C that lack Substitute.</p> </li> <li> <p><strong>252 HP / 36 Def / 220 Spe with Timid: The Speed investment allows Lugia to outspeed up to paralyzed Choice Scarf Calyrex-S.</p> </li> </ul>"}, {"name": "Defensive"}]
  },
  "Ho-Oh": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Defensive"}, {"name": "Assault Vest"}, {"name": "Offensive"}, {"name": "Choice Scarf"}]},
  "Blaziken": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Physical Sweeper"}, {"name": "Baton Pass"}]},
  "Swampert": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Stealth Rock Support"}, {"name": "Offensive Focus Sash"}]},
  "Shedinja": {
    "sets": [
      {
        "name": "Wonder Guard",
        "description": "<ul> <li> <p>Despite meager stats across the board, Shedinja finds a place on teams as a defensive pivot thanks to its unique ability, Wonder Guard. This enables Shedinja to wall any Pokemon that can't fit a move to hit it for super effective damage, such as most Kyogre, Xerneas, and Zacian-C.</p> </li> <li> <p>Poltergeist is Shedinja's strongest STAB move, dealing respectable damage to most neutral foes and revealing the target's held item. Use this move liberally to gather information about opponents' sets and scout for items like Rocky Helmet, which will KO Shedinja using Shadow Sneak or X-Scissor. Scouting items is especially effective in the Battle Stadium format due to the Item Clause, which allows for a process of elimination to deduce other foes' items.</p> </li> <li> <p>Will-O-Wisp allows Shedinja to burn incoming physical attackers looking to KO it, making them easier to deal with for teammates.</p> </li> <li> <p>Shadow Sneak lets Shedinja revenge kill faster foes that have been sufficiently weakened.</p> </li> <li> <p>Endure allows Shedinja to scout for super effective attacks, including surprise Max Moves, and is particularly useful if not utilizing a Focus Sash. Use Endure liberally, as teams that appear to be weak to Shedinja at first glance may have surprise coverage options to overcome it.</p> </li> <li> <p>X-Scissor is an alternative to Endure that lets Shedinja hit Dark-types super effectively and keeps Normal-types from completely walling it, but it won't be able to scout for fatal coverage. Even with X-Scissor, Shedinja still will not deal much damage to most Normal- and Dark-types, so teammates that can handle them make for great partners. Urshifu-R can both threaten them and the majority of entry hazard setters in the metagame, which threaten to instantly KO Shedinja switching in unless it's holding Heavy-Duty Boots.</p> </li> <li> <p>Protect may seem appealing instead of Endure, further allowing Shedinja to scout for moves like Leech Seed, Toxic, and Will-O-Wisp. However, it leaves Shedinja vulnerable to Max Moves, making Endure the superior option in most cases.</p> </li> <li> <p>A Lonely nature, along with 0 IVs in Defense and Special Defense, is chosen to improve the matchup against Ditto, since Shedinja can't benefit from bulk investment itself.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Focus Sash allows Shedinja to survive one super effective attack without having to use Endure, but it leaves Shedinja vulnerable to any form of indirect damage.</p> </li> <li> <p>Heavy-Duty Boots prevents Shedinja from fainting to entry hazard damage. Notably, it can let Shedinja wall hazard setters reliant on Stealth Rock to take it out, such as Swampert and Mamoswine lacking Rock Tomb. If not running Heavy-Duty Boots, Shedinja's team absolutely needs a plan for dealing with common entry hazard setters.</p> </li> <li> <p>Safety Goggles is the only way to prevent hail and sand damage from KOing Shedinja, which can be invaluable against teams with Tyranitar, Hippowdon, or potential users of Max Hailstorm and Max Rockfall.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Comradesquidwar", "user_id": 542590}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "Tox", "user_id": 146}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Salamence": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<ul> <li> <p>Salamence is a very threatening Max Airstream sweeper, with just enough coverage to make it difficult to check with defensive Pokemon.</p> </li> <li> <p>Dual Wingbeat is the clear choice over Fly for a Flying-type STAB, as it's more reliable outside of Dynamax, and its multi-hit nature is useful against frail Focus Sash Pokemon such as Pheromosa.</p> </li> <li> <p>Fire Blast is highly recommended for hitting Celesteela as hard as possible when Dynamaxed. Fire Fang, while very weak on its own, can make sense on Moxie Salamence as a powerful Fire-type Attack under Dynamax.</p> </li> <li> <p>Earthquake is also highly valuable for hitting other Steel-types hard such as Heatran and Metagross.</p> </li> <li> <p>Although this makes Salamence walled by certain Pokemon, some coverage can be given up to slot in Dragon Dance, which makes Salamence less reliant on Dynamaxing to sweep.</p> </li> <li> <p>Moxie is the ability of choice, letting Salamence kickstart a sweep with a simple KO, especially from Max Airstream. Intimidate is still a reasonable alternative, allowing Salamence to set up Dragon Dance or Weakness Policy more easily.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb Salamence's best option for immediate power while Dynamaxed.</p> </li> <li> <p>Weakness Policy is an acceptable alternative that takes advantate of Intimidate quite well.</p> </li> <li> <p>Lum Berry is particularly useful for Dragon Dance Salamence, as this makes it less worried about status.</p> </li> </ul>"
      },
      {"name": "Special Attacker", "description": "<ul> <li> <p>While its Special Attack is lower than its Attack, Salamence's high base power moves and access to Intimidate and STAB Max Airstream make it a fully capable Special Attacker.</p> </li> <li> <p>Hurricane allows Salamence to be at its most dangerous when Dynamaxed, especially when Salamence can set up its own rain to guarantee its accuracy. Air Slash is still a reasonable alternative as a more reliable Flying-type STAB.</p> </li> <li> <p>Fire Blast and Hydro Pump are important for covering Steel-types such as Celesteela and Heatran. Note, however, that while Salamence is Dynamaxed, the weathers they set up will weaken the other move.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb allows Salamence to deal as much damage as possible, and is less reliant on Dynamax.</p> </li> <li> <p>Weakness Policy is a reasonable alternative to focus more on Dynamax sweeping.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Metagross": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A- Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Dynamax Attacker",
        "description": "<ul> <li> <p>Metagross's great bulk and typing make it a very solid choice for Dynamaxing, with Max Steelspike making it particularly difficult to KO.</p> </li> <li> <p>Earthquake is very useful for gaining a Special Defense boost via Max Quake, and hitting opposing Steel-types hard.</p> </li> <li> <p>Thunder Punch is mainly useful for dealing as much damage to Celesteela and Corviknight as possible.</p> </li> <li> <p>Hammer Arm lets Metagross boost its Attack while Dynamaxed with Max Knuckle, and still hits Heatran and Ferrothorn decently hard.</p> </li> <li> <p>Zen Headbutt is Metagross's most powerful STAB when Psychic Terrain is up, and it severely damages Urshifu-R and the rare Toxapex.</p> </li> <li> <p>Bullet Punch is a useful priority move to carry when not Dynamaxed.</p> </li> <li> <p>Although giving up an attack is difficult, Agility is notable for allowing Metagross to potentially sweep late-game.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy is the obvious choice as a Dynamax attacker, punishing foes that dare hit Metagross super-effectively.</p> </li> <li> <p>Assault Vest is a reasonable alternative that makes Metagross even more difficult to KO with Special Attacks.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 252 Atk / 4 Spe with Adamant: This EV spread mazimizes Metagross's bulk and Attack stat.</p> </li> <li> <p>164 HP / 252 Atk / 92 Spe with Adamant: When used with Agility, this EV spread allows Metagross to outspeed up to neutral natured Pheromosa.</p> </li> <li> <p>68 HP / 252 Atk / 188 Spe with Jolly: This EV spread allows Metagross to outspeed Timid Celesteela, which is very useful when running Thunder Punch.</p> </li> <li> <p>44 HP / 252 Atk / 212 Spe with Jolly: When using Agility, this Speed investment allows Metagross to outspeed up to +1 Nihilego, +1 Garchomp, and max Speed neutral natured Regieleki.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Kyogre": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [
      {"name": "Choice Scarf"},
      {"name": "Bulky Assault Vest", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 SpA / 4 SpD</strong>: This is the standard EV spread for maximizing Kyogre's bulk and power.</p> </li> <li> <p><strong>252 HP / 196 SpA / 60 Spe</strong>: This EV spread allows Kyogre to outspeed important paralyzed threats, such as Zacian-C and opposing Choice Scarf Kyogre.</p> </li> <li> <p><strong>4 HP / 252 SpA / 252 Spe: The Speed investment allows Kyogre to outpace up to Jolly Necrozma-DM, at the cost of potentially being 2HKOed by mixed Dynamax Yveltal while Kyogre is under Dynamax.</p> </li> </ul>"},
      {"name": "Offensive Dynamax"},
      {"name": "Choice Specs", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 SpA / 4 SpD with Modest</strong>: This EV spread is used when your team does not have paralysis support.</p> </li> <li> <p><strong>196 HP / 252 SpA / 60 Spe with Modest</strong>: This EV spread allows Kyogre to outspeed important paralyzed threats, such as Zacian-C and opposing Choice Scarf Kyogre.</p> </li> <li> <p><strong>4 HP / 252 SpA / 252 Spe with Timid This spread will speed tie with dangerous base 90 Speed threats, such as Zekrom and Dialga.</p> </li> </ul>"},
      {"name": "Defensive"}
    ]
  },
  "Groudon": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [
      {
        "name": "Support",
        "description": "<h1>Items</h1> <ul> <li> <p><strong>Light Ball</strong>: When paired with Fling, this lets Groudon paralyze foes while breaking through Focus Sash, paralyze Ground-types, and bypass Taunt.</p> </li> <li> <p><strong>Sitrus Berry</strong>: Sitrus Berry gives Groudon a chance to turn some 2HKOs into 3HKOs, such as Zacian-C's Behemoth Blade when using a physically defensive spread.</p> </li> <li> <p><strong>Custap Berry: Groudon often gets into the activation range for Custap Berry, letting it get one last attack in before going down. This can be paired with Endure for more reliable activation, at the cost of coverage or paralysis spreading.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 196 SpD / 60 Spe with Careful</strong>: This EV spread lets Groudon avoid an OHKO from Modest Life Orb Yveltal's Max Darkness, while outspeeding up to Choice Scarf Kyogre after paralysis.</p> </li> <li> <p><strong>252 HP / 76 Atk / 116 Def / 4 SpD / 60 Spe with Impish: This spread allows Groudon to avoid a 2HKO from Adamant Zacian-C's Behemoth Blade with Sitrus Berry, while still outspeeding Choice Scarf Kyogre after paralysis.</p> </li> <li> <p><strong>252 HP / 196 Atk / 60 Spe with Adamant</strong>: A more offensive spread is a suitable option for Custap variants, and makes Groudon a better Dynamax user.</p> </li> </ul>"
      },
      {"name": "Assault Vest Dynamaxer"}
    ]
  },
  "Jirachi": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Support"}]},
  "Gastrodon": {
    "overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<ul> <li> <p>With Storm Drain and its part-Ground typing, Gastrodon is one of the better switch-ins to Choice item Kyogre sets.</p> </li> <li> <p>Earth Power can be used in place of Counter to hit Zacian-C super effectively, heavily damaging it without relying on Gastrodon itself getting hit first. It also can punish a Zacian-C trying to grab a free switch on Mirror Coat.</p> </li> <li> <p>Yawn can help play around Dynamax sweepers like Zapdos, forcing them out and potentially allowing Gastrodon to get a vital Recover off. It should be used carefully, however, as Max Starfall users can bypass its effect.</p> </li> <li> <p>Mirror Coat can be used to more immediately pressure the special attackers Gastrodon will be walling, but it comes at the cost of some longevity. Additionally, Mirror Coat does not affect Dark-types, such as Yveltal.</p> </li> <li> <p>Earthquake can be used over Earth Power to hit Kyogre harder, which helps against Substitute and Calm Mind variants.</p> </li> <li> <p>Gastrodon can potentially be used as a wincon via timer stalling, though this is not a use to rely on consistently. If attempting this, consider using a shiny Gastrodon to whittle down the timer more on every switch-in.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Leftovers is preferred to augment Gastrodon’s longevity, allowing it to passively heal from lesser damage sources like Stealth Rock. Sitrus Berry is an alternative longevity option.</p> </li> <li> <p>Rindo Berry can be useful to survive surprise Grass-type attacks aimed at Gastrodon.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>228 HP / 180 Def / 100 SpD with Calm - This prevents the 2HKO from Modest Ice Beam from Choice Specs Kyogre, as well as avoiding the OHKO from Adamant Zacian-C’s Play Rough and Choice Band Urshifu-S’s Wicked Blow, barring a maximum damage roll from the latter. However, it comes at the cost of some resilience against Zapdos and Yveltal.</p> </li> <li> <p>252 HP / 4 Def / 252 SpD with Calm - This spread maximizes Gastrodon’s special bulk but leaves it heavily threatened by strong physical attackers.</p> </li> </ul>"
      },
      {
        "name": "Physically Defensive",
        "description": "<ul> <li> <p>This set maximizes Gastrodon’s physical bulk, allowing it to act as a sort of mixed wall, being somewhat competent against threats like Zacian-C while maintaining effectiveness against Choice item Kyogre variants.</p> </li> <li> <p>Counter and Mirror Coat are used in tandem with Focus Sash to potentially trade with massive threats, such as Landorus-T, Zacian-C, Zapdos, and Urshifu-S.</p> </li> <li> <p>Earth Power can be useful against Zacian-C, punishing it on the switch and getting around potential Counter mind games.</p> </li> <li> <p>Yawn can be used to annoy setup and utility-based Pokemon, but it does make Gastrodon more vulnerable to Taunt. Additionally, Dynamax users with Fairy-type attacks can use Max Starfall to block sleep.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Focus Sash is the preferred item, allowing Gastrodon to get maximum value out of both Counter and Mirror Coat.</p> </li> <li> <p>If running Yawn or Earth Power, consider Leftovers or Sitrus Berry for slightly more longevity.</p> </li> <li> <p>Rindo Berry can also be used to potentially save Gastrodon from a surprise Grass-type attack.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "DerpySuX", "user_id": 528485}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "Tox", "user_id": 146}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Garchomp": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Swords Dance Sweeper"}, {"name": "Stealth Rock Setter"}, {"name": "Choice Scarf"}]},
  "Hippowdon": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Support"}]},
  "Magnezone": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<ul> <li> <p>With a unique typing and set of abilities, Magnezone has a niche for being a bulky offensive Electric-type.</p> </li> <li> <p>Sturdy gives Magnezone a Focus Sash like effect and makes it immune to deadly OHKO moves. Alternately, Analytic works well since Magnezone usually moves second, giving it a good boost in power.</p> </li> <li> <p>Steel Beam is Magnezone's strongest attack by far, but the cost of losing half its health means it should be used sparringly.</p> </li> <li> <p>Mirror Coat takes advantage of Sturdy, allowing Magnezone to potentially get a surprise KO on common Special Attacking Dynamaxers.</p> </li> <li> <p>Body Press is Magnezone's best option against Ferrothorn, Raikou, and opposing Magnezone.</p> </li> <li> <p>Endure should be used with Custap Berry, giving Magnezone another chance to activate it if Sturdy has been used up, or if Magnezone is using Analytic.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Assault Vest gives Magnezone a good amount of special bulk, especially if it's forced to Dynamax.</p> </li> <li> <p>Choice Specs gives Magnezone a ton of firepower as a hit-and-run attacker, and works especially well with taking advantage of Volt Switch.</p> </li> <li> <p>Custap Berry gives Magnezone once chance to have an attack with increased prirotity when it's low on health, which pairs especially well with Sturdy.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 252 SpA / 4 Spe with Modest: This spread maximizes Magnezone's bulk and power.</p> </li> <li> <p>4 HP / 252 Def / 252 SpA with Modest: This spread is to be used with Body Press, to maximize that move's power.</p> </li> <li> <p>4 HP / 252 SpA / 252 Spe with Modest: Magnezone may not be fast, but investing in Speed can allow it to get the jump on bulky foes that don't always bother to, such as Celesteela.</p> </li> </ul>"
      },
      {"name": "Stall Breaker", "description": "<ul> <li> <p>With Iron Defense and Body Press, Magnezone can be an effective tool against stall teams.</p> </li> <li> <p>Substitute and Leftovers protects Magnezone from status, and can effectively scout potentially problematic switch-ins.</p> </li> <li> <p>Magnet Pull seriously punishes defensive Steel-types on stall teams by trapping them, but Sturdy is a more reliable option otherwises, in case Magnezone faces a threat that might OHKO it.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Rhyperior": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Assault Vest"}, {"name": "Offensive"}, {"name": "Focus Sash"}]},
  "Mamoswine": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Focus Sash"}]},
  "Porygon-Z": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B- Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Special Wallbreaker",
        "description": "<ul> <li> <p>Porygon-Z's high base Special Attack coupled with Adaptability and great coverage allows it to break down or outright sweep a variety of slower opposing team compositions.</p> </li> <li> <p>Tri Attack or Uproar can be used as an alternative STAB options to Hyper Beam that do not have cooldown, whereas Thunderbolt provides solid coverage against the likes of Celesteela and Water-types such as Tapu Fini and Gyarados.</p> </li> <li> <p>Nasty Plot allows Porygon-Z to boost its Special Attack to nearly unwallable levels, whereas Trick allows it to cripple passive walls and regain move flexibility.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Chopple Berry lets Porygon-Z survive Fighting-type Attacks while Dynamaxed, particularly useful against Cinderace and Urshifu-R.</p> </li> <li> <p>Life Orb lets Porygon-Z deal massive damage even without a Nasty Plot boost.</p> </li> <li> <p>Choice Scarf patches up Porygon-Z's Speed stat, letting it outspeed key threats such as Dragapult and Choice Scarf Dracovish.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": []}
  },
  "Rotom-Heat": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Choice",
        "description": "<ul> <li> <p>Rotom-H sports a fantastic defensive typing, and serves as a premier offensive pivot with good defensive upside.</p> </li> <li> <p>Rotom-H often choses Trick and Will-O-Wisp as defensive move options to cripple defensive walls or physical Dynamax sweepers at the expensive of offensive coverage</p> </li> <li> <p>Alternatively, Rotom-H can also opt between Thunderbolt or Dark Pulse as offensive move selections over Will-O-Wisp, which can be somewhat awkward with choice lock. Thunderbolt gives Rotom-H a repeatable Electric-type STAB that doesn't force it to switch, and Dark Pulse helps it get important coverage against various Pokemon that resist both of its STAB types, such as Dragapult.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Scarf allows Rotom-H to outspeed major threats, such as Dragapult and Choice Scarf Dracovish. It also punishes defensive Pokemon more with Trick.</p> </li> <li> <p>Choice Specs gives Rotom-H much more power.</p> </li> </ul> <h1>EV spreads</h1> <ul> <li> <p>252 SpA / 4 SpD / 252 Spe Timid: This spread maximizes speed and power for Choice Scarf.</p> </li> <li> <p>68 HP / 4 Def / 252 SpA / 12 SpD / 172 Spe Modest: This spread gives Rotom-H some bulk while maximizing Special Attack and outspeeding Adamant Choice Band Dracovish and slower variants of Zapdos.</p> </li> </ul>"
      },
      {
        "name": "Bulky Baking Oven",
        "description": "<ul> <li> <p>Rotom-H without a choice item can seamlessly play both a potent Dynamax role and a useful supporting role in one set.</p> </li> <li> <p>Nasty Plot in combination with Electric STAB options allow it to check all variants of Zapdos, but can be replaced by Volt Switch if equipping an Assault Vest.</p> </li> <li> <p>For the last slot, Rotom-H can use Dark Pulse to hit many targets that resist its dual STAB, and can also gain access to Max Darkness, dropping foes' Special Defense. It can also opt for running Will-O-Wisp to gain the upper hand against physical attackers.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Sitrus Berry gives Rotom-H a quick burst of recovery that can turn potential 2HKOs into 3HKOs, with th most notable one being turning Zapdos's Life Orb Max Lightning into a 3HKO after Stealth Rock against maximum HP Rotom-H.</p> </li> <li> <p>Assault Vest gives Rotom-H plenty of special bulk to better check special threats, and it works particulary well with Dynamax.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 252 SpA / 4 SpD Modest: This spread forgoes Speed investment to maximize Rotom-H's HP.</p> </li> <li> <p>68 HP / 4 Def / 252 SpA / 12 SpD / 172 Spe Modest: This spread gives Rotom-H bulk, maximizes Special Attack, and outspeeds Adamant Choice Band Dracovish and slower variants of Zapdos.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": []}
  },
  "Rotom-Wash": {"sets": [{"name": "Assault Vest"}, {"name": "Bulky"}, {"name": "Choice Attacker"}, {"name": "Nasty Plot"}]},
  "Dialga": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [{"name": "Offensive Dynamax"}, {"name": "Bulky Dynamax"}, {"name": "Offensive Support", "description": "<h1>Items</h1> <ul> <li> <p><strong>Focus Sash</strong>: Focus Sash allows Dialga to survive moves it'd normally have no hope of without Dynamax, such as Life Orb Yveltal's Max Darkness and Zacian-C's Close Combat.</p> </li> <li> <p><strong>Chople Berry: Chople Berry lets Dialga survive Zacian-C's Close Combat.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>196 HP / 252 SpA / 60 Spe</strong>: This EV spread allows Dialga to outspeed up to Choice Scarf Kyogre after paralysis.</p> </li> <li> <p><strong>140 HP / 252 SpA / 116 Spe: This EV spread lets Dialga outpeed up to +1 paralyzed Timid Yveltal.</p> </li> </ul>"}]
  },
  "Palkia": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Dynamax Attacker"}]},
  "Heatran": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Offensive"}, {"name": "Specially Defensive"}]},
  "Victini": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [{"name": "Choice Scarf", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Atk / 252 Spe</strong>: Maximizing HP allows Victini to OHKO support Groudon and other base 100 HP foes.</p> </li> <li> <p><strong>228 HP / 92 Atk / 188 Spe: This spread allows Victini to outspeed Landorus-T and OHKO Zacian-C with V-create.</p> </li> </ul>"}, {"name": "Focus Sash", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Atk / 252 Spe</strong>: Maximum HP ensures that Victini can OHKO the many base 100 HP foes, such as Groudon and Kyogre.</p> </li> <li> <p><strong>228 HP / 92 Atk / 188 Spe: This spread prioritizes OHKOing Zacian-C with V-create, and outspeeding Landorus-T.</p> </li> <li> <p><strong>252 Atk / 4 SpD / 252 Spe: If not using Final Gambit, this spread is useful for maximizing the power of V-create.</p> </li> </ul>"}]
  },
  "Excadrill": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Offensive Support",
        "description": "<ul> <li> <p>With Mold Breaker and an excellent typing, Excadrill has the tools to deal with major threats, such as Mimikyu and Rotom-W.</p> </li> <li> <p>Rock Tomb is essential for providing Speed control.</p> </li> <li> <p>If using Focus Sash, Excadrill is a good choice for setting up Stealth Rock.</p> </li> <li> <p>Horn Drill gives Excadrill a 30% chance to bust through defensive Pokemon that would otherwise wall it, such as Celesteela.</p> </li> <li> <p>Swords Dance lets Excadrill take advantage of more passive threats, such as Cresselia. If using Assault Vest, Brick Break is a reasonable replacement while Dynamaxed thanks to Max Knuckle, and has the bonus of breaking Reflect and Light Screen otherwise.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Focus Sash lets Excadrill focus on supporting the team to its fullest extent, without worrying about getting OHKOed.</p> </li> <li> <p>Assault Vest is the item of choice if Excadrill plans on Dynamaxing, making it a surprisingly bulky Pokemon. It also lets Excadrill handle Nihilego far better than it would otherwise.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>4 HP / 252 Atk / 252 Spe with Jolly: This maximizes Excadrill's Speed and power, letting it outspeed Pokemon in a similar speed bracket such as Dragonite and Gyarados.</p> </li> <li> <p>4 HP / 252 Atk / 252 Spe with Adamant: While this spread no longer allows Excadrill to outspeed Dragonite and Gyarados consistently, it does allow Excadrill to KO Dynamax Nihilego with Rock Tomb + Earthquake under Grassy Terrain.</p> </li> <li> <p>244 HP / 116 Atk / 148 Spe with Adamant: This spread is a good fit for bulkier Assault Vest sets, allowing Excadrill to OHKO Dynamax Naganadel with Max Quake, while still outspeeding them after one use of Rock Tomb.</p> </li> </ul>"
      },
      {"name": "Choice Scarf", "description": "<ul> <li> <p>Excadrill's decent Speed tier and access to Mold Breaker make it a good choice for Choice Scarf revenge killing, outspeeding major threats such as Mimikyu, Pheromosa, and Dragapult.</p> </li> <li> <p>Horn Drill is Excadrill's best hope at breaking past defensive Pokemon such as Cresselia and Tapu Fini, with a 30% chance of OHKOing them as long as they aren't Dynamaxed.</p> </li> <li> <p>Rock Slide is Excadrill's most powerful option for coverage against Flying-types. Rock Tomb is a weaker alternative that does provide Speed control in a pinch.</p> </li> </ul>"},
      {
        "name": "Sand Sweeper",
        "description": "<ul> <li> <p>When it comes to Sand Stream sweeping, no Pokemon does the job better than Excadrill, who fully takes advantage of Dynamax to both set up the sand, and Max Moves to increase its bulk.</p> </li> <li> <p>Rock Slide's chance to flinch makes it a good choice for a Rock-type attack outside of Dynamax, but Rock Blast deserves special mention for blasting through Disguise and Focus Sash.</p> </li> <li> <p>Swords Dance makes Excadrill less reliant on Dynamax to sweep, and lets Excadrill deal massive damage to defensive Pokemon such as Tapu Fini and Cresselia.</p> </li> <li> <p>Brick Break allows Excadrill to boost its Attack while Dynamaxed via Max Knuckle, in addition to breaking Reflect and Light Screen outside of it.</p> </li> <li> <p>While Excadrill is fully capable of setting up sand on its own thanks to Dynamax, consider pairing Excadrill with Hippowdon or Tyranitar to ease reliance on Max Rockfall in certain match-ups.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy takes full advantage of Excadrill's Dynamax capabilities, especially since its two Max Move STABs boost its defensive stats.</p> </li> <li> <p>Focus Sash gels well with setting up Swords Dance at unexpected times, opening up new late-game sweeping opportunities.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>4 HP / 252 Atk / 252 Spe with Jolly: This EV spread makes Excadrill as fast as possible, outspeeding key threats under Sandstorm such as Dragapult and Choice Scarf Cinderace.</p> </li> <li> <p>196 Atk / 140 SpD / 172 Spe with Jolly: This EV spread gives Excadrill enough Special Defense to survive Choice Specs Rotom-W's Hydro Pump while Dynamaxed, while still outspeeding up to Choice Scarf Naganadel under Sandstorm.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Seismitoad": {
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<ul> <li> <p>Sporting a solid typing, colorful coverage, and access to Swift Swim, Seismitoad is a potent rain sweeper that can threaten many common Pokemon in the Series 12 format.</p> </li> <li> <p>Seismitoad's spammable STAB combination allows it to set its own rain with Max Geyser and boost its Special Defense with Max Quake while Dynamaxed, making it more difficult to revenge kill.</p> </li> <li> <p>Power Whip is necessary coverage to break past Water-immune Pokemon and other bulky Water-types, such as Kyogre, Quagsire, and Tapu Fini, with Life Orb-boosted Max Overgrowth OHKOing all three.</p> </li> <li> <p>Brick Break is Seismitoad's best option for a physical Max Knuckle, further preventing Ferrothorn and physically defensive Porygon2 from walling it. Brick Break also allows Seismitoad to remove opposing Light Screen and Reflect for its team.</p> </li> <li> <p>Bounce is Seismitoad's only option for Max Airstream, but the Speed boost can be crucial if rain runs out the following turn, and it heavily damages most Grass-type switch-ins. Notably, it is the only listed move that can damage Shedinja while Seismitoad is Dynamaxed.</p> </li> <li> <p>Ice Punch is Seismitoad's only way to hit Dragonite and defensive Zygarde-C for meaningful damage, maintains coverage against Grass-types, and is its strongest option against Landorus-T outside of rain.</p> </li> <li> <p>At the cost of a coverage option, Seismitoad can set Stealth Rock if its team lacks a setter. Due to its ability to threaten a sweep under rain, Seismitoad can find opportunities to set up Stealth Rock on predicted switches to checks like Ferrothorn, Lapras, and Shedinja.</p> </li> <li> <p>Toxic may seem strange on such an offensive Pokemon, but it supports Seismitoad's team by crippling a potentially troublesome wall, and Seismitoad's threat level tends to draw walls in. Additionally, if Seismitoad forgoes Bounce, Toxic is its only option to defeat Heavy-Duty Boots Shedinja.</p> </li> <li> <p>Kyogre is one of Seismitoad's best teammates, as it can summon rain with Drizzle to kickstart a Seismitoad sweep, and together they can wear down their shared checks.</p> </li> <li> <p>While Seimitoad's power under rain and many coverage options make it difficult to keep in check, it still needs to be wary of Grass- and bulky Water-types. Zapdos makes for a standout partner, threatening them with its accurate STAB Hurricane and Thunder under rain. Urshifu-S pressures the likes of Ferrothorn, Shedinja, and Porygon2, which give Seismitoad trouble.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb is the best item to enable a Seismitoad sweep, granting it high damage output while Dynamaxed despite an only average Attack stat.</p> </li> <li> <p>Choice Band makes Seismitoad worse at Dynamax sweeping, in exchange for OHKOing maximum HP Zacian-C and havng a 70% chance of OHKOing maximum HP Kyogre with Power Whip.</p> </li> <li> <p>However, if Life Orb is already being used by another Pokemon, other viable options include Mystic Water, Rindo Berry, and Expert Belt. Do note that Seismitoad needs either a Life Orb or Expert Belt to OHKO Kyogre with Max Overgrowth.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 Atk / 4 SpD / 252 Spe with Adamant: Under rain, this EV spread lets Seismitoad outspeed the entire unboosted metagame bar Regieleki, as well as +1 positive-natured base 100s.</p> </li> <li> <p><strong>116 HP / 252 Atk / 140 Spe with Adamant: This EV spread gives Seismitoad a good chance of surviving a Play Rough from Jolly Zacian-C while still outspeeding Pheromosa and Calyrex-S under rain.</p> </li> <li> <p><strong>52 HP / 252 Atk / 204 Spe with Adamant: If Seismitoad is holding a Rindo Berry, this EV spread will allow it to survive a Grassy Glide from Choice Band Rillaboom under Dynamax.</p> </li> </ul>"
      },
      {
        "name": "Specially Defensive Support",
        "description": "<ul> <li> <p>With its serviceable bulk, great defensive typing, and coveted Water Absorb ability, Seismitoad can act as one of the sturdiest Kyogre switch-ins around while blanket checking the metagame's many Water-types. While it competes with Gastrodon, which sports higher special bulk and access to Recover, Seismitoad's unique utility movepool and access to Grass-type coverage make it less predictable.</p> </li> <li> <p>Stealth Rock is the primary advantage Seismitoad has over many other Water-immune Pokemon, freeing up its teammates to run more offensive sets.</p> </li> <li> <p>Seismitoad's access to Toxic, very valuable and rare for a non-Poison type, is key to put foes on a timer.</p> </li> <li> <p>If holding a Light Ball, Fling becomes a one-time paralysis-inducing move, which can be a nasty surprise for offensive switch-ins that don't mind Toxic but hate the Speed drop from paralysis.</p> </li> <li> <p>If holding Leftovers, Protect allows Seismitoad to restore a bit of additional HP per turn, as well as scouting for potentially devastating Grass-type coverage.</p> </li> <li> <p>Power Whip is an option for more security against bulkier Kyogre variants, particularly those with Substitute + Calm Mind. In general, carrying Grass-type coverage makes Seismitoad a much better check to many threatening Water-types, such as Tapu Fini, Quagsire, and Rotom-W.</p> </li> <li> <p>Rest when paired with Chesto Berry, lets Seismitoad stick around much longer.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Light Ball makes Fling a one-time paralysis-inducing move.</p> </li> <li> <p>Leftovers provides Seismitoad with passive recovery each turn, and it synergizes especially well with Protect. Aguav Berry is an alternate healing option.</p> </li> <li> <p>Chesto Berry is required when running Rest, to avoid losing serious momentum while asleep.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>The listed 4 Speed EVs allow Fling Seismitoad to outpace paralyzed Cinderace.</p> </li> <li> <p><strong>212 HP / 4 Atk / 92 Def / 196 SpD / 4 Spe with Careful: This EV spread allows Seismitoad to avoid the 2HKO from Adamant Zacian-C's Behemoth Blade, avoid the OHKO from its Play Rough, and survive a Choice Band-boosted Wicked Blow from Urshifu-S.</p> </li> <li> <p><strong>252 HP / 252 SpD / 4 Spe with Careful: This spread maximizes Seismitoad's special bulk, letting it take on Kyogre as well as possible.</p> </li> <li> <p><strong>228 HP / 4 Atk / 76 Def / 196 SpD / 4 Spe with Careful</strong>: This spread allows Seismitoad to always survive Timid Life Orb Yveltal's Max Darkness and almost always survive Adamant Zacian-C's Play Rough.</p> </li> </ul>"
      },
      {
        "name": "Specially-based Sweeper",
        "description": "<ul> <li> <p>Despite its lower Special Attack stat, Seismitoad can run a specially-based set worth consideration, as Hydro Pump actually outdamages Liquidation against neutral targets, and the ability to catch opponents off guard with a mixed set has tremendous value in a best-of-one format.</p> </li> <li> <p>A Ground-type STAB move lets Seismitoad deal good damage against Zacian-C, with Earthquake doing more against Kyogre and Tyranitar, while Earth Power is less vulnerable to Attack drops via Intimidate or burn.</p> </li> <li> <p>Power Whip nets crucial coverage against Water-immune Pokemon and bulky Water-types. Grass Knot is a feasible alternative, sporting much higher damage against physically-bulky targets like Quagsire. It is significantly weaker against Kyogre and Gastrodon than Power Whip, though, and will fail if the target is Dynamaxed.</p> </li> <li> <p>Focus Blast is Seismitoad's only way of hitting Ferrothorn for significant damage, netting a 2HKO against specially defensive variants outside of Dynamax.</p> </li> <li> <p>Sludge Bomb allows Seismitoad to boost its Special Attack with Max Ooze while Dynamaxed, and it's Seismitoad's strongest option against Rillaboom.</p> </li> <li> <p>Seismitoad can set Stealth Rock if there's not already a setter on its team, but it won't be able to surmount Grass-types.</p> </li> <li> <p>While Toxic may seem out of place on a set designed for sweeping, it is Seismitoad's only shot at beating Chansey, specially defensive Porygon2, and Shedinja, and it can put other troublesome walls on a timer for its team.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb is the best item to enable a Seismitoad sweep, granting it high damage output while Dynamaxed despite its only average attacking stats.</p> </li> <li> <p>However, if Life Orb is already being used by another Pokemon on the team, other viable options include Mystic Water, Assault Vest, and Expert Belt.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 Atk / 252 SpA / 252 Spe with Mild: Under rain, Seismitoad will outspeed the entire unboosted metagame bar Regieleki, as well as +1 positive-natured base 100s. A Mild nature is preferred over Rash to always survive a Max Geyser from Modest Kyogre while Dynamaxed.</p> </li> <li> <p>A special-only set with a Modest nature can be run if opting for Grass Knot, though such a set struggles even more to break past many of the metagame's special walls.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Comradesquidwar", "user_id": 542590}], "teams": [{"name": "Quality checked by", "members": [{"username": "luisin", "user_id": 469498}, {"username": "Theorymon", "user_id": 29010}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Whimsicott": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Prankster Support",
        "description": "<ul> <li> <p>This Whimsicott functions to help hyper offensive or setup sweeper-centered builds set up against faster foes.</p> </li> <li> <p>Tailwind is used to boost Speed while sacrificing Whimsicott, allowing the incoming Pokemon to take advantage of the Speed boost.</p> </li> <li> <p>Alternatively, Switcheroo in combination with Lagging Tail makes the foe setup fodder for certain sweepers that can take advantage of slowed Pokemon to rack up boosts.</p> </li> <li> <p>Memento allows Whimsicott to freely pivot against opposing Pokemon after setting up speed control. Memento finds usefulness in guaranteeing one turn of Dynamax stalling, avoiding opposing boosts from secondary effects of Max Moves or Moxie, and also neutering Dynamax sweepers via attacking stat drops.</p> </li> <li> <p>Moonblast is Whimsicott's primary STAB move, hitting Dark types, which are not affected by Prankster, hard. Energy Ball also makes a decent STAB, letting Whimsicott deal serious damage to Tapu Fini and Rotom-W.</p> </li> <li> <p>Taunt prevents Whimsicott from being Taunted itself as well as shuts down more passive Pokemon such as Swampert and Hippowdon. Charm stifles physical Pokemon without needing to sacrifice Whimsicott via Memento.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Focus Sash lets Whimsicott survive even powerful attacks, ensuring it can support your offensive Pokemon.</p> </li> <li> <p>Lagging Tail should only be used with Switcheroo.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>4 HP / 252 SpA / 252 Spe with Modest or Timid: This is used with attacking sets and Focus Sash to give Whimsicott the ability to hit hard when using Moonblast or Energy Ball. Timid is an alternate option for outspeeding Garchomp.</p> </li> <li> <p>252 HP / 252 Def / 4 SpD with a Bold nature: This maximizes physical bulk in order to get off a Switcheroo or Fling followed by Memento without getting OHKOed and should be used for all non-attacking variants.</p> </li> </ul>"
      },
      {"name": "Cotton Guard Stall", "description": "<ul> <li> <p>This Whimsicott takes advantage of Prankster to set up Cotton Guard, allowing it to stop even would-be physical checks, such as Metagross, that may try to switch in.</p> </li> <li> <p>Prankster Substitute + Leech Seed serves as its main method of defeating opposing Pokemon, stalling them out while passively sapping HP through Leech Seed and healing through Leftovers.</p> </li> <li> <p>While it might be possible to run a no-attack variant of this version of Whimsicott, Moonblast is strongly recommended in order to hit Dark-types, which are unaffected by Prankster, and to ensure that Whimsicott is not complete Taunt bait.</p> </li> <li> <p>The given EV spread maximizes physical bulk in order to Leech Seed stall most effectively and take minimal damage from physical threats immediately after a Cotton Guard boost.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": [{"name": "Quality checked by", "members": [{"username": "cant say", "user_id": 158401}, {"username": "marilli", "user_id": 70760}]}, {"name": "Grammar checked by", "members": [{"username": "kt3", "user_id": 228482}]}]}
  },
  "Darmanitan-Galar": {
    "sets": [
      {
        "name": "GORILLA WARFARE",
        "description": "<ul> <li> <p>With its sky high Attack stat and the in-built Choice Band of Gorilla Tactics, Galarian Darmanitan boasts the highest natural raw Attack in the game.</p> </li> <li> <p>Flare Blitz provides valuable coverage against Steel-Types like Zacian-C, Necrozma-DM and Ferrothorn.</p> </li> <li> <p>Earthquake hits Rock-Types for heavy damage and provides a way to threaten foes like Zacian-C without the recoil of Flare Blitz.</p> </li> <li> <p>U-turn makes Galarian Darmanitan a great pivot, doing heavy damage to most targets while maintaining a switch advantage.</p> </li> <li> <p>Stone Edge and Rock Slide can be used to heavily pressure Ho-Oh.</p> </li> <li> <p>Superpower is great for breaking through Tyranitar, Chansey, and Blissey with minimal stress. Should you choose to Dynamax Galarian Darmanitan, you can use Max Knuckle to take its Attack to unmatched levels.</p> </li> <li> <p>It is worth noting that when Dynamaxed, Galarian Darmanitan will lose its Gorilla Tactics boost, so Dynamax should only be used when it is necessary to switch moves</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Scarf helps patch up Galarian Darmanitan’s somewhat disappointing Speed stat, allowing it to threaten the likes of Eternatus more easily.</p> </li> <li> <p>Focus Sash can let Galarian Darmanitan get around its abysmal bulk, ensuring it gets an attack off as a lead and potentially letting you preserve it for later in the game. If hazards are not in play, Focus Sash Galarian Darmanitan can also be used to threaten big damage on Max Airstream users, such as Yveltal.</p> </li> <li> <p>Choice Band takes Galarian Darmanitan’s offense to new heights, letting it perform absurd feats such as OHKOing fully defensive Toxapex with Earthquake, alongside making its Icicle Crash all but impossible to safely switch into.</p> </li> </ul>"
      },
      {
        "name": "Zen Mode",
        "description": "<ul> <li> <p>By using Zen Mode, Galarian Darmanitan gains the ability to switch moves, potentially securing a surprise KO. Zen Mode also increases Darmanitan-G’s Attack and Speed even further once activated. The Speed boost makes it quite fast, and it can surprise previously-faster targets with a devastating second attack.</p> </li> <li> <p>Flare Blitz is valuable coverage against Steel-types such as Zacian-C and Necrozma-DM, additionally, the recoil from Flare Blitz can potentially activate Zen Mode, boosting its offenses and giving it STAB on Flare Blitz.</p> </li> <li> <p>Earthquake hits Rock-types such as Tyranitar for heavy damage while also threatening the odd Heatran.</p> </li> <li> <p>With Yawn, Galarian Darmanitan can support its team in the event it is walled while still being a potent offensive threat. Yawn is also somewhat unexpected on Galarian Darmanitan, since opponents must respect the more common Gorilla Tactics set.</p> </li> <li> <p>Stone Edge can be used to heavily pressure Ho-Oh.</p> </li> <li> <p>Superpower provides super effective coverage against Chansey, Blissey, and Tyranitar, as well as giving Galarian Darmanitan access to Max Knuckle.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "DerpySuX", "user_id": 528485}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "greilmercenary9", "user_id": 336524}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Gothitelle": {"overview": "<p>If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Trapper"}]},
  "Ferrothorn": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Defensive"}, {"name": "Specially Defensive"}, {"name": "Set-Up"}]},
  "Thundurus": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Prankster Support"}, {"name": "Dynamax Sweeper"}]},
  "Reshiram": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Dynamax Sweeper"}, {"name": "Choice Scarf"}, {"name": "Dragon Dance", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 Atk / 4 Def / 252 Spe with Jolly</strong>: Reshiram is in a hotly contested Speed tier, making maximizing Speed the safest choice.</p> </li> <li> <p><strong>60 HP / 252 Atk / 4 Def / 4 SpD / 188 Spe with Adamant</strong>: This spread survives Adamant Zacian-C's Play Rough, allowing Reshiram to sacrifice itself with Flare Blitz if needed. It also outspeeds Eternatus after using Dragon Dance.</p> </li> </ul>"}]},
  "Zekrom": {
    "overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [{"name": "Dynamax Sweeper", "description": "<h1>Items</h1> <ul> <li> <p><strong>Life Orb</strong>: This item makes Zekrom an immediate threat, even without set-up.</p> </li> <li> <p><strong>Weakness Policy</strong> Weakness Policy potentially lets Dynamax Zekrom sweep without needing to set up Dragon Dance, and works especially well on dual screen teams.</p> </li> <li> <p><strong>Assault Vest</strong>: Assault Vest improves Zekrom's match up against Yveltal and Kyogre, at the cost of needing to use Max Knuckle from Body Press to boost Attack.</p> </li> <li> <p><strong>Lum Berry: This is Zekrom's best option for dealing with Will-O-Wisp from the likes of Mimikyu and Victini, while powering through Yawn if Electric Terrain is not up.</p> </li> </ul>"}]
  },
  "Landorus-Therian": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Bulky Support", "description": "<p>The Speed IV of 29 lets Landorus-T underspeed most Landorus-T by 1 point. A Speed IV of 27 can also be used to U-turn after some support Groudon attack.</p>"}, {"name": "Dynamax Sweeper"}, {"name": "Suicide Lead"}, {"name": "Choice Scarf"}]},
  "Kyurem-White": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Dynamax", "description": "<h1>Items</h1> <ul> <li> <p><strong>Assault Vest</strong>: This makes Kyurem-W a decent check to Kyogre.</p> </li> <li> <p><strong>Life Orb: Life Orb's immense power allows Kyurem-W to 2HKO Dynamax Dialga that lack Assault Vest with Max Quake.</p> </li> </ul>"}, {"name": "Choice Scarf"}]},
  "Xerneas": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Bulky Geomancy", "description": "<h1>EV Spreads</h1> <ul> <li><strong>156 HP / 252 Def / 44 SpA / 4 SpD / 52 Spe with Bold</strong>: This EV spread lets Dynamax Xerneas use Max Steelspike to survive Adamant Zacian-C's Behemoth Blade followed by Quick Attack. The Speed investment ensures Xerneas will outspeed Choice Scarf Victini after Geomancy.</li> </ul>"}, {"name": "Fast Geomancy"}]},
  "Yveltal": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<h1>Items</h1> <ul> <li> <p><strong>Life Orb</strong>: Life Orb makes Yveltal an extremely danagerous Dynamax sweeper with no prior set-up.</p> </li> <li> <p><strong>Assault Vest</strong>: This makes Yveltal a very bulky Dynamax sweeper, at the cost of being unable to use Taunt.</p> </li> <li> <p><strong>Weakness Policy</strong>: If the Life Orb slot is used up or dual screens are used, Weakness Policy can seriously punish foes using super-effective attacks.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 SpA / 252 Spe with Timid:</strong> This spread maximizes Yveltal's Special Attack and Speed, outpacing key threats such as Mimikyu and Kyurem-W.</p> </li> <li> <p><strong>4 HP / 252 SpA / 252 Spe with Modest: This spread sacrifices outspeeding Mimikyu and Kyurem-W for potentially breaking past the many Pokemon that invest in surviving Timid Yveltal. This spread still outspeeds Calyrex-S after using Max Airstream.</p> </li> <li> <p><strong>140 HP / 172 SpA / 196 Spe with Timid: This EV spread minimizes Life Orb recoil, survives Zacian-C's Behemoth Blade, avoids a 2HKO from Calyrex-S's Max Starfall while under Dynamax, and outspeeds Timid Kyogre.</p> </li> </ul>"
      },
      {"name": "Stall Breaker", "description": "<h1>Items</h1> <ul> <li> <p><strong>Leftovers</strong>: The passive recovery gels well with Yveltal's ability to shut down defensive Pokemon.</p> </li> <li> <p><strong>Kee Berry</strong> The Defense boost can let Yveltal survive Zacian-C's Play Rough.</p> </li> <li> <p><strong>Lum Berry / Cheri Berri: These two berries can be used to effectively shut down Fling + Light Ball users such as Groudon.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 60 Def / 196 Spe with Timid: This spread allows Yveltal to outspeed Jolly Landorus-T.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe with Bold: This spread fully maximizes Yveltal's Defense.</p> </li> <li> <p><strong>252 HP / 4 Def / 252 Spe with Timid</strong>: This spread maximizes Yveltal's Speed, allowing it to outspeed and use Taunt on Mimikyu before it can use a status move.</p> </li> </ul>"},
      {"name": "Physical Attacker", "description": "<h1>Items</h1> <ul> <li> <p><strong>Life Orb</strong>: This is the best item choice, giving Adamant Yveltal a chance to KO Zacian-C switching in with Max Airstream into Max Flare.</p> </li> <li> <p><strong>Weakness Policy: Weakness Policy can turn Yveltal into a dangerous Dynamax sweeper.</p> </li> <li> <p><strong>Black Glasses</strong>: If Life Orb is used up, Black Glasses is a good alternative for boosting Dark-type attacks.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 Atk / 252 Spe with Adamant:</strong> This spread maximizes Yveltal's Attack, while letting it outspeed Calyrex-S after a Max Airstream.</p> </li> <li> <p><strong>140 HP / 172 Atk / 196 Spe with Jolly: This spread outspeeds Jolly Landorus-T, minimizes Life Orb recoil, and avoids an OHKO from Zacian-C's Behemoth Blade.</p> </li> </ul>"}
    ]
  },
  "Zygarde": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [{"name": "Specially Defensive Coil", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>236 HP / 116 SpD / 156 Spe with Careful</strong>: This spread survives Life Orb Modest Yveltal's Max Darkness while in the 50% forme, and outspeeds +1 Timid Yveltal as Zygarde-C after paralyzing it with Glare.</p> </li> <li> <p><strong>252 HP / 204 SpD / 52 Spe with Careful: This bulkier spread allows Zygarde-C to outspeed a paralyzed Calyrex-S.</p> </li> </ul>"}, {"name": "Physically Defensive Coil", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 124 Def / 132 Spe with Impish</strong>: The given Speed EVs lets Zygarde outspeed Choice Scarf Mimikyu after Glare.</p> </li> <li> <p><strong>252 HP / 204 Def / 52 Spe with Impish: With these Speed EVs, Zygarde outspeeds up to paralyzed Calyrex-S.</p> </li> </ul>"}, {"name": "Dragon Dance"}]
  },
  "Incineroar": {
    "overview": "<p>If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>",
    "sets": [
      {"name": "Assault Vest", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>244 HP / 4 Atk / 4 Def / 236 SpD / 20 Spe with Adamant</strong>: This EV spread allows Incineroar to almost always survive a +2 Max Quake from Calyrex-S, while outspeeding most Tyranitar.</p> </li> <li> <p><strong>252 HP / 116 Def / 140 SpD with Sassy: This spread avoids a 2HKO from Timid Life Orb Yveltal's Max Airstream, while having the slowest possible U-turn.</p> </li> <li> <p><strong>252 HP / 4 Def / 252 SpD with Sassy: This spread lets Incineroar survive two Max Airstreams from Modest Life Orb Yveltal, at the cost of physical bulk.</p> </li> </ul>"},
      {"name": "Support", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Def / 252 SpD with Sassy</strong>: This spread allows Incineroar to handle Calyrex-S and Yveltal more effectively, while having the slowest use of Parting Shot possible.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 SpD with Relaxed: Maximizing Defense makes Incineroar more capable of crippling Zacian-C and Necrozma-DM.</p> </li> </ul>"}
    ]
  },
  "Primarina": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B- Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li>Primarina is usually severely overshadowed by Tapu Fini, but Primarina does offer some small advantages, such as a much higher Special Attack stat, Grass-type coverage, and being able to pick off Focus Sash Pokemon with Aqua Jet.</li> </ul> <h1>Items</h1> <ul> <li> <p>Assault Vest is the most common item on offensive Primarina to take advantage of its good special bulk. </li> <li> <p>Choice Specs is still viable for offering a lot of firepower, especially compared to Tapu Fini.</p> </li> <li> <p>Focus Sash lets Primarina take advantage of Torrent more easily, and lets it deal massive damage to Pokemon it'd normally be KOed by.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 28 Def / 228 SpA: This spread maximizes special attack and bulk, and always takes a Choice Band Urshifu Thunder Punch.</p> </li> <li> <p>4 Atk / 252 SpA / 252 Spe: This spread is viable with more offensive items, especially Focus Sash.</p> </li> <li> <p>252 HP / 156 Def / 100 SpA: This spread gives Primarina the ability to always survive Max Lightning from Urshifu formes.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "marilli", "user_id": 70760}], "teams": []}
  },
  "Lycanroc-Dusk": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B- Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Focus Sash",
        "description": "<ul> <li> <p>Lycanroc-D is a decent and unique Focus Sash lead due to its access to all of Counter, Endeavor, Stealth Rock, and a unique STAB priority move.</p> </li> <li> <p>Counter, when combined with Accelerock, allows Lycanroc-D to defeat promiment physical Dynamax sweepers such as Cinderace. This set almost requires Focus Sash to remain intact, so be wary of Lycanroc-D taking residual damage if the opponent still has physical sweepers in play.</p> </li> <li> <p>Close Combat allows Lycanroc-D to hit Ferrothorn and many other Steel-types harder than its STAB coverage, and gets a Tough Claws boost, unlike many of its higher-Base Power STAB moves.</p> </li> <li> <p>Stealth Rock allows Lycanroc-D to support sweepers on its team, helping break opposing Focus Sash and weakening opposing Galarian Moltres and Glastrier.</p> </li> <li> <p>Endeavor allows Lycanroc-D to also defeat many special attackers one-on-one, but be wary of Dynamaxed foes, which will only go to half health if Lycanroc is put to 1 HP.</p> </li> <li> <p>Swords Dance allows Lycanroc-D to become less passive and punishes opponents that try to play around its somewhat predictable Focus Sash strategies.</p> </li> <li> <p>Rock Tomb can be used to provide speed control for incoming sweepers, allowing the likes of Cinderace and Urshifu-R to outspeed many threats to their sweep.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": [{"name": "Quality checked by", "members": [{"username": "Psynergy", "user_id": 248085}, {"username": "greilmercenary9", "user_id": 336524}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Toxapex": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Physical Wall"}]},
  "Mimikyu": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [
      {"name": "Disruptor", "description": "<h1>Items</h1> <ul> <li> <p><strong>Bright Powder</strong>: While unreliable, just one miss can be devestating against this Mimikyu.damage makes it even easier for Dynamax sweepers to set up.</p> </li> <li> <p><strong>Mental Herb</strong>: If using Trick Room, Mental Herb is very helpful for getting around Taunt.</p> </li> <li> <p><strong>Rocky Helmet</strong>: This gives a bit of extra damage against Pokemon with contact moves such as Zacian-C, which could lead to a Dynamax sweep from teammates such as Yveltal.</p> </li> </ul>"},
      {"name": "Curse Stall", "description": "<h1>Items</h1> <ul> <li> <p><strong>Custap Berry</strong>: Substitute can help activate Custap Berry, and let Mimikyu deliver an extra move, like Pain Split or Thunder Wave, before fainting.</p> </li> <li> <p><strong>Bright Powder</strong>: Brought Powder isn't very reliable, but dodging one attack can make Mimikyu very difficult to deal with.</p> </li> <li> <p><strong>Mental Herb</strong>: This will make Mimikyu immune to one use of Taunt, potentially foiling anti-leads such as Yveltal.</p> </li> </ul>"},
      {"name": "Swords Dance Sweeper", "description": "<h1>Items</h1> <ul> <li> <p><strong>Life Orb</strong>: This is the best option to make up for Mimikyu's meager Attack stat.</p> </li> <li> <p><strong>Spell Tag</strong>: If Life Orb is used on another Pokemon, Spell Tag is a reasonable alternative for still OHKOing bulky Zacian-C with +2 Max Phantasm from Phantom Force.</p> </li> </ul>"},
      {"name": "Choice Scarf"}
    ]
  },
  "Tapu Koko": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Special Attacker"}, {"name": "Dual Screens"}, {"name": "Yveltal Check (Bulky Physical Attacker)"}]},
  "Tapu Lele": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With Psychic being boosted by a terrain, Tapu Lele makes a competent offensive threat that doesn't have to worry about priority attacks.</p> </li> <li> <p>Thunderbolt is important coverage, hitting Celesteela, who otherwise walls Tapu Lele.</p> </li> <li> <p>Psyshock lets Tapu Lele hit Pokemon that have softer physical defense such as Raikou harder.</p> </li> <li> <p>Shadow Ball punishes Metagross and Cresselia switch-ins, and hits a lot of Pokemon neutrally in general.</p> </li> <li> <p>Focus Blast is Tapu Lele's best hope at dealing severe damage to Ferrothorn and Heatran, but isn't a particularly reliable move, and is a notoriously poor move while Dynamaxed.</p> </li> <li> <p>Modest is Tapu Lele's best nature for damage output, but Timid is a reasonable alternative if outspeeding Jolly Landorus-T is a must, and it also lets Choice Scarf Tapu Lele outspeed Jolly Pheromosa.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Scarf pairs very well with Psychic Terrain, letting Tapu Lele deal massive damage to fast threats without worrying about potential priority attacks.</p> </li> <li> <p>Choice Specs makes Tapu Lele a better wall breaker, notably being able to 2HKO defensive Tapu Fini with Psyshock under Psychic Terrain.</p> </li> <li> <p>Life Orb not only lets Tapu Lele switch up its attacks, but makes it a better Dynamaxer. Just note that most of it's coverage will remove Psychic Terrain.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Tapu Fini": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Defensive Support"}, {"name": "Calm Mind"}, {"name": "Speed Crippler"}, {"name": "Choice Attacker"}]},
  "Lunala": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Bulky Calm Mind", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 Def / 4 Spe with Bold</strong>: This maximizes Lunala's physical bulk for potentially stalling Zacian-C out with paralysis, while outspeeding paralyzed Choice Scarf Kyogre.</p> </li> <li> <p><strong>252 HP / 52 SpA / 204 Spe with Timid: This spread allows Lunala to outspeed +Speed Nature base 90s such as Kyogre, Groudon, and Zekrom.</p> </li> </ul>"}]},
  "Nihilego": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A+ Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [{"name": "Power Herb Sweeper", "description": "<ul> <li> <p>Nihilego has access to Meteor Beam, and in combination with Power Herb, it becomes instantaneously threatening through increasing its Special Attack and striking with a 120 BP STAB in one turn.</p> </li> <li> <p>Grass Knot hits common Stealth Rock leads like Swampert and Hippowdon very hard, Thunderbolt best hits the likes of Celesteela and Gyarados, Psyshock allows it to hit other Nihilego and Chansey, Power Gem is an alternative Rock STAB to use when not Dynamaxed, and Stealth Rock helps chip future switch-ins while giving access to a Max Guard option when Dynamaxed.</p> </li> <li> <p>The given EVs ensure Nihilego gets a Speed boost after a KO, complementing the SpA boost gained from Meteor Beam and making it difficult to be revenge killed by the likes of Choice Scarf Landorus-T.</p> </li> </ul>"}],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": []}
  },
  "Pheromosa": {"overview": "<p>This set is for a new and developing metagame. If you have any questions about the set, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Offensive Pivot"}]},
  "Celesteela": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Leech Seed"}, {"name": "Meteor Sweeper"}]},
  "Kartana": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B+ Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<ul> <li> <p>Kartana's impressive Attack stat and Beast Boost make it a capable late-game physical sweeper, only held back by its awful Special Defense and low base power attacks.</p> </li> <li> <p>Aerial Ace may seem weak, but it gives Kartana access to Max Airstream while Dynamaxed, giving it a good shot of sweeping late-game. Smart Strike is weak for a STAB Attack, but it OHKOs Nihilego, and grants access to the useful Max Steelspike while Dynamaxed. While difficult to fit in, Giga Impact is Kartana's best hope of doing decent damage to Zapdos with Max Strike.</p> </li> <li> <p>Swords Dance makes Kartana less reliant on Dynamax and Beast Boost to sweep, and pairs especially well with Focus Sash.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Focus Sash lets Kartana survive in match-ups that may normally be difficult for it to win, mainly against special attackers.</p> </li> <li> <p>Life Orb makes Kartana a better late-game sweeper when Dynamaxed.</p> </li> </ul>"
      },
      {"name": "Choice Scarf", "description": "<ul> <li> <p>Kartana's access to Beast Boost makes it a reasonable choice for Choice Scarf revenge killing and late-game sweeping.</p> </li> <li> <p>Guillotine is an emergency attack to have a 30% shot at destroying bulky Pokemon, while Aerial Ace gives Kartana a Speed boost if Dynamax sweeping presents itself to Kartana.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Necrozma-Dusk-Mane": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [
      {"name": "HEAVY METAL (Bulky Dragon Dance)", "description": "<h1>Items</h1> <ul> <li> <p><strong>Rocky Helmet</strong>: Rocky Helmet lets Necrozma-DM deal damage to Zacian-C as it switches in.</p> </li> <li> <p><strong>Weakness Policy: With Weakness Policy, Necrozma-DM becomes a far more fearsome Dynamax sweeper.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li><strong>252 HP / 140 Def / 116 Spe</strong>: The given Speed EVs allow Necrozma-DM to outspeed Timid Yveltal after one Dragon Dance, while surviving 2 hits from Zacian-C 73.6% of the time.</li> </ul>"},
      {"name": "Support", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 Def / 4 Spe</strong> This spread avoids a 2HKO from Zacian-C's Close Combat.</p> </li> <li> <p><strong>252 HP / 140 Def / 116 Spe: This spread sacrifices some bulk to outspeed Calyrex-S after paralysis, while still avoiding a 2HKO from Adamant Zacian-C 73.6% of the time.</p> </li> </ul>"},
      {"name": "Offensive Dragon Dance", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>140 HP / 252 Atk / 116 Spe with Adamant</strong>: The Speed EVs allow Necrozma-DM to outspeed Timid Yveltal after Dragon Dance.</p> </li> <li> <p><strong>60 HP / 252 Atk / 196 Spe with Jolly: With some bulk sacrificed, this spread allows Necrozma-DM to outspeed Marshadow and Eternatus after Dragon Dance.</p> </li> </ul>"},
      {"name": "Cosmic Power", "description": "<h1>Items</h1> <ul> <li> <p><strong>Rocky Helmet</strong>: This item is Necrozma-DM's best way of dealing daamage to Zacian-C while setting up.</p> </li> <li> <p><strong>Utility Umbrella: Utility Umbrella ensures that Necrozma-DM can recover 50% of its health, even under Kyogre's rain.</p> </li> </ul>"}
    ]
  },
  "Marshadow": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Focus Sash", "description": "<h1>Natures</h1> <ul> <li> <p><strong>Adamant</strong>: Adamant gives Marshadow a good shot of KOing Zacian-C with Spectral Thief + Shadow Sneak after Stealth Rock damage.</p> </li> <li> <p><strong>Jolly: Jolly is useful for outspeeding Timid Lugia and slower Zacian-C.</p> </li> </ul>"}]},
  "Naganadel": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A+ Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {"name": "Nasty Plot Sweeper", "description": "<ul> <li> <p>With Beast Boost boosting its Speed, Naganadel has excellent potential to sweep with Nasty Plot.</p> </li> <li> <p>While Draco Meteor may seem to be a poor fit for sweeping, it gives Naganadel a powerful attack without setting up, and is useful while Dynamaxed. Dragon Pulse can be used for consistent power, however.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb gives Naganadel the extra power it needs to sweep easily, and makes it less reliant on setting up Nasty Plot.</p> </li> <li> <p>Focus Sash can give Nagandel an unexpected chance to set up Nasty Plot.</p> </li> <li> <p>Lum Berry is also a handy tool against status, letting Naganadel shrug off attempts to stop a sweep with Yawn and Thunder Wave in particular.</p> </li> </ul>"},
      {"name": "All-out Attacker", "description": "<ul> <li> <p>Thanks to Beast Boost, Naganadel is fully capable of sweeping with 4 Attacks, especially while Dynamaxed.</p> </li> <li> <p>Air Slash lets Nagandel boost its Speed while Dynamaxed, whch pairs perfectly with Modest variants. If hitting Heatran is a must, Thunderbolt is a reasonable alternative.</p> </li> <li> <p>A Modest nature ensures that Naganadel will get a Special Attack boost after a KO, which is especially useful if using Choice Scarf or Air Slash. Timid is still useful though, because it lets Naganadel outspeed Cinderace.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb is Nagandel's best option for sweeping while Dynamaxed, giving Naganadel an immediate power boost.</p> </li> <li> <p>Choice Scarf gives Naganadel the alternative role of revenge killing threats when not Dynamaxed, and also lets it clean weakened teams thanks to Beast Boost.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Melmetal": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Trick Room Offense", "description": "<h1>Items</h1> <ul> <li> <p><strong>Choice Band</strong>: Choice Band is best suited for late game Trick Room sweeping with Double Iron Bash.</p> </li> <li> <p><strong>Assault Vest</strong>: This patches up Melmetal's poor Special Defense, making it an extremely bulky Dynamax user.</p> </li> <li> <p><strong>Life Orb</strong>: This item is best suited when your win condition involves Melmetal usually Dynamaxing.</p> </li> </ul>"}]},
  "Rillaboom": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "G-Max Choice Attacker"}, {"name": "G-Max General Offense"}, {"name": "G-Max Swords Dance Sweeper"}]},
  "Cinderace": {
    "overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>",
    "sets": [
      {
        "name": "SUPER STRIKER (Gigantamax Attacker)",
        "description": "<ul> <li> <p>With its great Attack, Speed, and Libero, Cinderace finds itself in a commanding position in the BSS metagame.</p> </li> <li> <p>Pyro Ball becomes G-Max Fireball under Gigantamax, a 160-Base Power attack that also nullifies abilities like Mimikyu's Disguise and Heatran's Flash Fire.</p> </li> <li> <p>Bounce gives Cinderace access to Max Airstream, which makes it a very potent sweeper, having nearly unmatched Speed alongside its colorful movepool and Libero.</p> </li> <li> <p>Sucker Punch may seem odd on a set revolving around Max Airstream, but it can be useful in situations where Cinderace doesn't have a boost, such as revenge killing.</p> </li> <li> <p>Giga Impact provides Cinderace with an obscenely powerful Max Strike, which is useful for both its wide neutral coverage and the Speed drop, which lets it maintain the Speed advantage in Dynamax battles against Zapdos without relying on Max Airstream. Max Strike is also Cinderace's strongest option against Quagsire.</p> </li> <li> <p>Gunk Shot grants valuable coverage against Fairy-types such as Xerneas and Tapu Fini.</p> </li> <li> <p>Iron Head still covers Xerneas while giving Cinderace access to Max Steelspike for Defense boosts.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb elevates Cinderace's damage output even further, making it extremely difficult to wall.</p> </li> <li> <p>Assault Vest grants Cinderace some extra survivability, potentially allowing it to get a crucial second hit off against Pokemon like Zapdos.</p> </li> </ul>"
      },
      {"name": "Focus Sash", "description": "<ul> <li> <p>Focus Sash Cinderace makes for a powerful general attacker and great lead, starting most games off with a bang.</p> </li> <li> <p>High Jump Kick is Cinderace's strongest attack outside of Dynamax.</p> </li> <li> <p>Counter and Focus Sash allow Cinderace to trade KOs with physical threats such as Zacian-C, Urshifu-S, and Landorus-T, potentially removing them from the game immediately.</p> </li> <li> <p>Sucker Punch provides powerful priority, picking off weakened targets such as Calyrex-S.</p> </li> <li> <p>Gunk Shot provides valuable coverage against Xerneas and Tapu Fini. Iron Head still hits Xerneas supper effectively, but it sacrifices damage against Tapu Fini for the chance to cause foes to flinch so that Cinderace can then KO them.</p> </li> </ul>"},
      {"name": "Choice Scarf", "description": "<ul> <li> <p>Choice Scarf Cinderace can use its fantastic Speed to be a great pivot and terrifying revenge killer.</p> </li> <li> <p>Thanks to Cinderace's very high natural Speed, Choice Scarf lets it prevent Ditto from reverse sweeping after copying fast foes like bulky Zacian-C.</p> </li> <li> <p>High Jump Kick is Cinderace's strongest attack outside of Dynamax.</p> </li> <li> <p>Gunk Shot provides valuable coverage against Fairy-types, namely Xerneas and Tapu Fini.</p> </li> <li> <p>Iron Head provides more accurate coverage on Xerneas and a potentially useful flinch chance to bring foes into KO range, but it sacrifices a lot of damage.</p> </li> <li> <p>While Sucker Punch may seem odd on a Choice Scarf set, the coverage against Calyrex-S is extremely valuable, especially against Choice Scarf variants and certain other Speed-boosted Pokemon, which outspeed even Choice Scarf Cinderace.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "DerpySuX", "user_id": 528485}], "teams": [{"name": "Quality checked by", "members": [{"username": "greilmercenary9", "user_id": 336524}, {"username": "Tox", "user_id": 146}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Corviknight": {
    "overview": "<p>This analysis covers a Pokemon in a very new metagame. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<ul> <li> <p>When running maximum Defense investment alongside Iron Defense, Corviknight is a good physical wall that has several tools to differentiate itself from Celesteela, such as Roost.</p> </li> <li> <p>Body Press alongside Iron Defense makes Corviknight very difficult to defeat with physical attacks following a boost and allows it to deal incredibly high damage with Body Press following Defense boosts.</p> </li> <li> <p>Brave Bird allows Corviknight to hit Ghost-types and boost its Speed with Max Airstream, but Iron Head can be used to help ease the matchup against Swords Dance Mimikyu. Taunt can also be run here to stop status moves like Yawn, but this leaves Corviknight unable to damage Ghost-types.</p> </li> <li> <p>Avoid using Dynamax on Corviknight unless it needs it to survive hits in a pinch, such as switching in against a boosted Mimikyu. Corviknight will lose the massive damage output from Iron Defense-boosted Body Press, and its damage output is tame against any Pokemon with decent defenses.</p> </li> <li> <p>Mirror Armor is preferred over Pressure in order to survive against Max Phantasm Defense drops, allowing Corviknight to effectively defeat standard Mimikyu and physical Dragapult sets. This also punishes Intimidate Pokemon such as Landorus-T, Salamence, and Gyarados</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Sitrus Berry is the primary item, which helps Corviknight avoid many 2HKOs, such as Cinderace's Pyro Ball.</p> </li> <li> <p>Leftovers can be used for long-term health recovery if that is preferred.</p> </li> <li> <p>Rocky Helmet can be used for chip damage in matchups such as against Urshifu-R.</p> </li> </ul>"
      },
      {
        "name": "Specially Defensive",
        "description": "<ul> <li> <p>Near-maximum special bulk and Maranga Berry allow Corviknight to consistently survive weaker super effective attacks and set up on Pokemon that would otherwise check it.</p> </li> <li> <p>Taunt is the more traditional option for shutting down passive Pokemon, but Substitute can be used for stalling out PP more effectively or setting up on weak special attacks.</p> </li> <li> <p>Pressure is the preferred ability to stall out weak super effective special attacks, but Mirror Armor can still be useful to help against Intimidate users, Mystical Fire attackers, and Max Phantasm users.</p> </li> <li> <p>Dynamax allows Corviknight to survive otherwise lethal hits and can be used to sweep after Bulk Up boosts have been accumulated.</p> </li> <li> <p>The given EV spread is designed to be as specially bulky as possible while still being able to outspeed defensive Celesteela and Iron Defense Corviknight sets to Taunt them.</p> </li> </ul>"
      },
      {
        "name": "Fast Taunt",
        "description": "<ul> <li> <p>This Corviknight set takes advantage of its relatively good natural bulk, Speed investment, and Bulk Up to outspeed the majority of bulky metagame options to take advantage of passive foes and opposing Corviknight to sweep opposing teams with boosted Brave Bird or Max Airstream.</p> </li> <li> <p>Taunt is used to shut down status and boosting moves, allowing Corviknight to gain an advantage over slower Pokemon that have trouble damaging it. such as Hippowdon and Ferrothorn.</p> </li> <li> <p>Substitute can be used to gain an advantage over status users while also easing prediction against foes switching out.</p> </li> <li> <p>This Corviknight wants to Dynamax after setting up Bulk Up and when its natural checks, such as Rotom forms, are removed from the game or severely damaged. Following Speed boosts from Max Airstream, Corviknight becomes difficult to deal with for offensively oriented teams, as it will outspeed most Choice Scarf users at +2 Speed.</p> </li> <li> <p>Mirror Armor is used to help beat Mimikyu one-on-one, outspeeding it after a Max Airstream and reversing Defense drops from Max Phantasm. It also let Corviknight punish Intimidate Pokemon such as Landorus-T, Salamence, and Gyarados.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Lum Berry is used with Taunt generally to allow Corviknight to switch into moves such as Yawn, breaking Stealth Rock + Yawn cycles.</p> </li> <li> <p>Leftovers is generally used in combination with Substitute, to gain passive health while being protected by Substitute.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>108 HP / 148 Atk / 252 Spe with a Jolly nature: Maximum Speed allows this Corviknight to effectively Taunt all Corviknight while still having decent attacking power and health through partial investment in Attack and HP. It also can outspeed Jolly Cinderace at +1 Speed.</p> </li> <li> <p>252 HP / 4 Def / 252 Spe with a Jolly nature: This is a simple spread to maximize HP and Speed; it also lets Corviknight outspeed everything up to Jolly Cinderace at +1 Speed and survive hits better than the 148 Attack spread.</p> </li> <li> <p>252 HP / 60 Atk / 196 Spe with an Adamant nature: This EV spread allows Corviknight to outspeed positive-natured base 100 Speed Pokemon after a Max Airstream.</p> </li> </ul>"
      },
      {
        "name": "Weakness Policy",
        "description": "<ul> <li> <p>This Corviknight set is designed to bait in super effective attacks, using the combination of Dynamax and Corviknight's superb natural bulk to easily survive these attacks and hit back lethally with Max Airstream.</p> </li> <li> <p>Bulk Up is the boosting move of choice, allowing Corviknight to augment its Attack when not in Dynamax forme, allowing it to hit harder and making it more difficult to take down with physical attacks.</p> </li> <li> <p>Iron Head gives Corviknight a great chance to OHKO Dynamax Togekiss with Max Steelspike after Weakness Policy is activated.</p> </li> <li> <p>Power Trip can be used to deal massive damage following Dynamax expiring through stat boost accumulation.</p> </li> <li> <p>Body Press gives Attack boosts with Max Knuckle and allows Corviknight to hit Steel-types more effectively than other options.</p> </li> <li> <p>Taunt allows you to stifle slower status moves, allowing Corviknight to set up on passive Pokemon.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p>252 HP / 4 Def / 252 Spe with a Jolly nature: This is a simple spread to maximize HP and Speed; it also allows Corviknight to outspeed everything up to Jolly Cinderace at +1 Speed and survive hits better than the spreads invested in Attack.</p> </li> <li> <p>252 HP / 100 Atk / 156 Spe with an Adamant nature: These EVs are designed to outspeed positive-natured Dragapult after two Max Airstreams.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "greilmercenary9", "user_id": 336524}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Grimmsnarl": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Dual Screens"}]},
  "Dracovish": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Choice Attacker"}, {"name": "Sand Rush Sweeper"}]},
  "Dragapult": {"sets": [{"name": "Physical Attacker"}, {"name": "Dual Screens"}, {"name": "Bulky Substitute"}]},
  "Eternatus": {
    "overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>",
    "sets": [
      {"name": "Defensive", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>244 HP / 228 Def / 36 Spe</strong>: This physically bulky spread outspeeds Palkia and Garchomp.</p> </li> <li> <p><strong>244 HP / 4 Def / 4 SpA / 4 SpD / 252 Spe: This maximizes Eternatus's Speed and bulk, allowing it to at least Speed tie with offensive Eternatus.</p> </li> </ul>"},
      {"name": "Offensive", "description": "<h1>Items</h1> <ul> <li> <p><strong>Power Herb</strong>: This allows Eternatus to boost its Special Attack with Meteor Beam, which is also deals massive damage to Ho-Oh.</p> </li> <li> <p><strong>Life Orb: When using Recover, Life Orb is the best offensive item for Eternatus.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>76 HP / 4 Def / 252 SpA / 4 SpD / 172 Spe with Modest</strong>: With this spread, Eternatus OHKOes offensive Yveltal with a +1 Dynamax Cannon after Stealth Rock damage, and outspeeds both Palkia and Garchomp. 4 Defense EVs can be removed to deal with Porygon2's Download better, but it's not a particularly common Pokemon.</p> </li> <li> <p><strong>252 SpA / 4 SpD / 252 Spe with Timid: This spread maximizes Eternatus's Speed, letting it outspeed Jolly Marshadow and Speed tie with Adamant Zacian-C.</p> </li> </ul>"},
      {"name": "Choice Item Attacker", "description": "<h1>Items</h1> <ul> <li> <p><strong>Choice Specs</strong>: Choice Specs Eternatus slices through Dynamax foes, being able to OHKO offensive Yveltal after Stealth Rock damage with Dynamax Cannon in particular.</p> </li> <li> <p><strong>Choice Scarf With Choice Scarf, Eternatus becomes an effective revenge killer of several Dragon-types, such as Zekrom and Palkia.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>76 HP / 4 Def / 252 SpA / 4 SpD / 172 Spe with Modest: The Speed investment outpaces Palkia and Garchomp. If the rare Porygon2 poses an issue, the 4 Defense EVs can be removed to avoid a Download boost.</p> </li> <li> <p><strong>252 SpA / 4 SpD / 252 Spe with Timid: With maximum Speed investment, Eternatus can now outspeed Jolly Marshadow and Timid Lugia, and speed tie with Adamant Zacian-C at worst.</p> </li> </ul>"}
    ]
  },
  "Urshifu": {
    "overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>",
    "sets": [
      {
        "name": "Focus Sash",
        "description": "<ul> <li> <p>With its high Attack stat, great STAB combination, and absolute nuke that is Wicked Blow, Urshifu-S has made a name for itself as one of the most threatening wallbreakers in the BSS metagame.</p> </li> <li> <p>With Focus Sash and Counter, Urshifu-S is also a potent revenge killer against physical threats.</p> </li> <li> <p>This variant of Urshifu-S makes for a solid lead, trading very efficiently with strong physical attackers such as Zacian-C and Landorus-T.</p> </li> <li> <p>Outside of the lead slot, Urshifu-S must be wary of Stealth Rock and other entry hazards nullifying its Focus Sash, and thus making Counter less consistent.</p> </li> <li> <p>Sucker Punch provides powerful priority, allowing Urshifu-S to finish off Pokemon that survived Counter or Wicked Blow the turn prior.</p> </li> <li> <p>Rock Tomb is difficult to fit in, but the Speed control it gives is very useful and unexpected from foes.</p> </li> <li> <p>Taunt is potentially useful to help Urshifu-S break through the likes of Quagsire and Toxapex by preventing them from recovering. However giving up Counter or Sucker Punch severely limits Urshifu-S’s potential against offensive Pokémon.</p> </li> <li> <p>While this variant of Urshifu-S usually won’t be using it, Gigantamax is preferred over Dynamax because G-Max One Blow's secondary effect helps Urshifu-S much more than Max Darkness’s.</p> </li> </ul>"
      },
      {
        "name": "BEAR KNUCKLE (Choice Item Attacker)",
        "description": "<ul> <li> <p>Wicked Blow is Urshifu-S's main attack, with the guaranteed critical hit providing extreme damage and bypassing Defense boosts or Attack drops</p> </li> <li> <p>Sucker Punch is powerful priority to pick off weakened, faster targets such as Regieleki, boosted Necrozma-DM, and especially Calyrex-S.</p> </li> <li> <p>U-turn is useful for Urshifu-S to effectively scout its switch-ins and maintain momentum for its team.</p> </li> <li> <p>Aerial Ace provides access to Max Airstream to boost Urshifu-S’s Speed, potentially allowing it to sweep faster, frailer teams. Max Airstream also can deny Eternatus the chance to recover against Urshifu-S and stall its Wicked Blow PP.</p> </li> <li> <p>Stone Edge is useful coverage against Ho-Oh, Yveltal and other Flying-types that could potentially survive Wicked Blow and KO Urshifu-S in return.</p> </li> <li> <p>Thunder Punch hits Tapu Fini super effectively in addition to most Flying-types, but it sacrifices some damage against Ho-Oh and Zapdos.</p> </li> <li> <p>Ice Punch can be used to heavily damage targets like Landorus-T and Zygarde while still hitting Yveltal and Zapdos super effectively.</p> </li> <li> <p>Sleep Talk is a niche but effective pick that allows Urshifu-S to absorb sleep from the likes of Hippowdon and Quagsire while maintaining effectiveness; however, Sucker Punch will fail if called by Sleep Talk when Urshifu-S moves last, so it is not advised to use these moves on the same set.</p> </li> <li> <p>If running Choice Band, an Adamant nature is worth considering. While Urshifu-S will no longer outspeed key threats such as Kyogre, Landorus-T, and Mimikyu, the extra power can be very helpful against bulkier teams.</p> </li> <li> <p>Gigantamax is preferred over Dynamax thanks to G-Max One Blow’s ability to ignore Max Guard.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Choice Band provides Urshifu-S with absurd power, allowing Wicked Blow to easily 2HKO the likes of Toxapex and Quagsire, and even some resistant Pokémon like Yveltal. Additionally, very few Pokemon can stall out this set, making it particularly effective against stall teams.</p> </li> <li> <p>Choice Scarf lets Urshifu-S outspeed usually-faster targets, letting it revenge kill or grab a surprise KO, securing your team an early lead.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "DerpySuX", "user_id": 528485}], "teams": [{"name": "Quality checked by", "members": [{"username": "Theorymon", "user_id": 29010}, {"username": "luisin", "user_id": 469498}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Urshifu-Rapid-Strike": {"overview": "<p>These sets are for a new and developing metagame. If you have any questions about the sets, feel free to ask any in the <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-12-analysis-discussion-thread.3697668/\">Battle Stadium Singles Analysis Discussion thread.</a></p>", "sets": [{"name": "Choice Attacker"}, {"name": "Focus Sash"}]},
  "Regieleki": {"overview": "<p>This set is for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Dual Screens", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>156 HP / 36 Atk / 252 Def / 4 SpD / 60 Spe</strong> This physical bulk lets Regieleki survive Adamant Groudon's Precipice Blades after Reflect, and have a 93% chance to OHKO Choice Scarf Kyogre with Wild Charge.</p> </li> <li> <p><strong>252 HP / 4 Atk / 108 Def / 84 SpD / 60 Spe: This spread allows Regieleki to survive Modest Life Orb Yveltal's Max Darkness, while also outspeeding +1 Timid Yveltal.</p> </li> </ul>"}]},
  "Glastrier": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: A+ Rank</h1> <p>Reserved for Pokemon that are fantastic in the Battle Stadium Singles metagame, and can sweep, support, or wall significant portions of the metagame. These Pokemon require less support than most others to be used effectively and have few flaws that can easily be overlooked when compared to their positive traits.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Chilling Dynamax Sweeper",
        "description": "<ul> <li> <p>Glastrier's insane bulk, power, and Chilling Neigh make it a fearsome Dynamax sweeper, especially under Trick Room.</p> </li> <li> <p>Icicle Spear breaks through Focus Sash and Disguise, making it the ideal STAB once Dynamax has run out. Icicle Crash deals more consistent damage outside of Dynamax, and can flinch foes under Trick Room or with Custap Berry.</p> </li> <li> <p>Heavy Slam gives Glastrier access to the valuable Max Steelspike while Dynamaxed.</p> </li> <li> <p>Endure can be useful when used with Custap Berry to give Glastrier one priority attack.</p> </li> <li> <p>Glastrier becomes a far more deadly Pokemon when it has Trick Room support. Cresselia is the best choice for this, since it can use Lunar Dance to give Glastrier another chance to sweep through teams, and even let it Dynamax early. Mimikyu and Porygon2 are also good users of Trick Room.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Weakness Policy pairs perfectly with Dynamax, giving Glastrier another way to sweep teams.</p> </li> <li> <p>Custap Berry can make revenge killing Glastrier extra difficult when it's low on health, giving it one attack with higher priority.</p> </li> <li> <p>Assault Vest makes Glastrier even more difficult to take down on the special side, and pairs especially well with Dynamax.</p> </li> <li> <p>Lum Berry can be paired with Swords Dance to severly punish Yawn leads such as Hippowdon and Swampert, and also to worry less about common Will-O-Wisp users such as Rotom-W.</p> </li> </ul>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Theorymon", "user_id": 29010}], "teams": []}
  },
  "Spectrier": {
    "overview": "<p>This analysis covers a newly introduced Pokemon. The metagame may shift rapidly. If you have any suggestions for this analysis, please post them in the current <a href=\"https://www.smogon.com/forums/threads/crown-tundra-analyses.3673305/\">Battle Stadium Singles Analysis Thread.</a></p> <h1>Viability Ranking: B Rank</h1> <p>Reserved for Pokemon that are great in the Battle Stadium Singles metagame. These Pokemon have more notable flaws than those above them that affect how they function in the format. Their positive traits still outshine their negatives, but they require a bit more team support to bring out their full potential.</p> <p>For more information on viability rankings, <a href=\"https://www.smogon.com/forums/threads/crown-tundra-sword-shield-bss-viability-rankings.3672698/\">check out the full rankings here.</a></p>",
    "sets": [
      {
        "name": "Ghost Rider",
        "description": "<ul> <li> <p>Spectrier serves as a fragile but potent offensive sweeper, utilizing a very easily spammed Shadow Ball STAB option, high Speed tier, and Grim Neigh to overwhelm defensively oriented teams.</p> </li> <li> <p>Hyper Beam and Dark Pulse help Spectrier break through Normal-type Pokemon, and have the added bonus of dropping Speed and Special Defense, respectively, when Dynamaxed.</p> </li> <li> <p>Will-O-Wisp and Mud Shot allow Spectrier to provide surprisingly good support for teammates, as opponents need to respect Spectrier's offensive capabilities, leaving them vulnerable the two crippling moves.</p> </li> <li> <p>Substitute or Taunt are also great options for helping Spectrier take advantage of passive Pokemon, allowing it to setup Nasty Plot against unsuspecting foes.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p>Life Orb maximizes Spectrier's power, and puts less pressure on it needing to set up Nasty Plot to sweep.</p> </li> <li> <p>Spell Tag is a decent alternative if Life Orb is used by another Pokemon on your team.</p> </li> <li> <p>Lum Berry gives Spectrier an alternate means to set up on more passive Pokemon, such as Hippowdon and Swampert.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li>36 Def / 252 SpA / 220 Spe Timid: Allows Spectrier to outspeed 252 EV invested neutral Dragapult while gaining a bit more physical bulk to take advantage of burned foes.</li> </ul>"
      },
      {"name": "Choice Scarf", "description": "<ul> <li> <p>Spectrier runs a fairly simple Choice Scarf set, using its top Speed tier in order to revenge kill and snowball against opponents with its Grim Neigh boosts.</p> </li> <li> <p>Hyper Beam is usually picked to increase damage output, but Uproar can also be opted for to avoid a turn cooldown when not Dynamaxed and avoid falling asleep.</p> </li> <li> <p>Dark Pulse allows Spectrier to drop foes' Special Defense when Dynamaxed, Will-O-Wisp lets Spectrier serve as an emergency control against physical sweepers while also providing a Max Guard option, and Mud Shot allows Spectrier provide Speed control while also boosting its own Special Defense with Max Quake.</p> </li> </ul>"}
    ],
    "credits": {"writtenBy": [{"username": "1_TrickPhony", "user_id": 434111}], "teams": []}
  },
  "Calyrex-Ice": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Trick Room Sweeper"}, {"name": "Agility Sweeper"}]},
  "Calyrex-Shadow": {"overview": "<p>These sets are for one of the final Battle Stadium Singles metagames for this generation. If you feel there is anything wrong or missing, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-series-13-analysis-contribution-thread.3707854/\">please post in this thread</a>.</p>", "sets": [{"name": "Special Attacker"}, {"name": "Choice Scarf", "description": "<h1>EV Spreads</h1> <ul> <li> <p><strong>124 HP / 220 Def / 100 SpA / 60 Spe with Modest</strong>: This EV spread allows Calyrex-S to survive Adamant Zacian-C's Behemoth Blade while outspeeding +1 Timid Lugia.</p> </li> <li> <p><strong>4 Def / 252 SpA / 252 Spe with Timid: Maximizing Speed is useful for letting Calyrex-S outspeed threats such as +2 Xerneas, and dealing with the many potential speed ties.</p> </li> </ul>"}, {"name": "Choice Specs"}, {"name": "Substitute"}]}
}