{
  "Blastoise": {
    "overview": "<p>With Shell Smash in its arsenal, Blastoise is capable of sweeping weakened teams and is a staple on offensive playstyles. It has enough natural bulk to secure setup opportunities on passive Pokemon like Sylveon and Vaporeon, and its Speed is crucially high enough to prevent Choice Scarf users like Passimian and Rotom-C from revenge killing it after setting up. Its defensive counterplay is limited, as Toxic users like Bronzong and Vaporeon are unable to deter Substitute variants, and tanks like Stealth Rock Copperajah and Dragalge are only able to KO it with chip damage; they may even inadvertently buff Blastoise by weakening it into Torrent range. Nonetheless, Blastoise is likely to sustain noteworthy damage when setting up, which in turn makes it easier for the aforementioned walls and priority users like Decidueye and Sirfetch'd to deal with it. Some bulky Pokemon like Assault Vest Copperajah, Haze Mantine, and specially defensive Dhelmise check Blastoise even without prior chip damage. Blastoise will also struggle to set up against offensive teams that pressure it with faster wallbreakers and sweepers as well as against teams with ample entry hazard and Knock Off support to make Blastoise much more vulnerable to revenge killers like Goodra and Choice Scarf Heliolisk.</p> ",
    "comments": "<h1>Other Options</h1> <p>Blastoise may opt for a defensive utility set that offers Rapid Spin, Flip Turn, and status support, although this set is less effective than other defensive Water-types like Mantine and Vaporeon. Life Orb has the niche of picking up more OHKOs at +2, like against Dragalge and Silvally-Ghost, but these KOs are also obtainable with entry hazard damage. This makes Life Orb usually not worth the recoil combined with the lack of White Herb. Aura Sphere hits notable targets like Heliolisk and Assault Vest Copperajah, but outside of the improved matchup for these threats, Blastoise has better options for sweeping.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Water-types: Despite being passive, Mantine and Vaporeon use Haze and recovery to outlast Blastoise and prevent it from sweeping.</p> <p><strong>Special Walls</strong>: A handful of special tanks and Assault Vest users like Copperajah, Dhelmise, and Goodra are capable of surviving a hit and OHKOing Blastoise. Other walls such as Escavalier and Guzzlord can stomach a boosted hit as well, but with usually only weaker attacks and Toxic to threaten Blastoise, they are more situational checks.</p> <p><strong>Revenge Killers: Heliolisk is one of the only Choice Scarf users capable of revenge killing Blastoise and can even tank a boosted hit if Thunderbolt fails to OHKO. Priority users like Sirfetch'd and Decidueye dispatch Blastoise when its in Torrent range, and offensive Water-types like Starmie check non-Dark Pulse variants.</p> <p><strong>Residual Damage: Entry hazards and Knock Off wear down Blastoise and make it much more susceptible to being KOed, thus expanding its revenge killers and limiting its setup chances.</p> ",
    "sets": [
      {
        "name": "Shell Smash",
        "description": "<h1>Set Details</h1> <p>Surf threatens many of the same OHKOs at +2 that Hydro Pump does without the inaccuracy. Dark Pulse is Blastoise's best way to hit opposing Water-types like Vaporeon and Starmie. Ice Beam targets Grass- and Dragon-types like Rotom-C, Decidueye, and Dragalge, although Substitute offers a safe way to activate Torrent and setup opportunities against status users like Bronzong. White Herb is necessary to retain Blastoise's bulk and severely limit revenge killers.</p> <p>Dual screens + Teleport support from Xatu is a great way for Blastoise to get off Shell Smash and to prevent Mudsdale and Guzzlord from breaking Substitute, and Xatu's Magic Bounce prevents entry hazards from chipping Blastoise. Additional sweepers and wallbreakers like Salazzle, Tyrantrum, and Decidueye break down walls like Mantine and Dhelmise and keep momentum up for an eventual Blastoise sweep. On less offensive teams, Blastoise is more likely to sweep with defensive cores of Copperajah + Sylveon and Bronzong + Vileplume wearing down foes through status, Stealth Rock, and item removal; in return, Blastoise is a crucial Fire-type check. Knock Off support from Passimian and Guzzlord is another great way to wear down Blastoise's defensive checks such as Mantine and Copperajah. Pivots such as Dragalge and Ninjask get Blastoise in safely against targets it's able to use Shell Smash on like Bronzong and Arcanine.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 241380, "username": "Abejas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}
  },
  "Vileplume": {
    "overview": "<p>With its great typing, amazing bulk, and numerous utility options, Vileplume acts as a check to common Pokemon in the tier such as Flygon, Dhelmise, and Guzzlord. Its great Poison / Grass typing and reliable recovery options make it difficult for opposing teams to wear down. With Effect Spore, it has a chance to passively punish physical attackers and pivots. Vileplume's natural strength and unique combination of STAB moves in Giga Drain and Sludge Bomb make it difficult to switch into. Vileplume can also serve as a great tool against bulky Steel-types like Copperajah and Bronzong, as Corrosive Gas removes their held items and Sleep Powder puts them to sleep. However, Vileplume is slow and vulnerable to Psychic- and Fire-types as well as strong special attackers such as Goodra, Dragalge, and Exploud. Vileplume is also easily worn down by entry hazards, and it has difficulty switching into strong physical wallbreakers like Golurk and Tyrantrum.</p> ",
    "comments": "<h1>Other Options</h1> <p>Leech Seed inflicts residual damage on opposing Pokemon and gives Vileplume an option for more recovery. While having less PP than Leech Seed, Synthesis gives Vileplume consistent recovery. Moonblast can put out some extra damage on Fighting-, Dark-, and Dragon-types like Passimian and Guzzlord. Aromatherapy can be used if the team needs a cleric option. Growth can turn Vileplume into a wincon late-game at the cost of its utility in Corrosive Gas or Sleep Powder.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Psychic-types such as Starmie and Celebi threaten Vileplume with Psychic or Stored Power. They can force out Vileplume, but none of them want to get poisoned by Sludge Bomb.</p> <p><strong>Flying-types: Aerodactyl can dish out huge damage with Dual Wingbeat. Ninjask and Braviary resist Giga Drain, and Braviary also gains a Defiant boost from Strength Sap. However, all of them have to be wary about switching into Sludge Bomb and getting poisoned.</p> <p><strong>Fire-types: Salazzle, Talonflame, and Charizard can threaten out Vileplume with their strong STAB options, but switching into Corrosive Gas is problematic, as it removes their Heavy-Duty Boots.</p> <p><strong>Strong Wallbreakers: Choice Band users such as Tyrantrum and Sirfetch'd threaten Vileplume with Head Smash and Brave Bird, respectively. Dragalge, Guzzlord, and Exploud threaten Vileplume with their STAB moves and coverage.</p> <p><strong>Strength Sap Blockers: Xatu, Espeon, and Goodra can all block Vileplume's recovery from Strength Sap with Magic Bounce and Sap Sipper, limiting its ability to switch into Sirfetch'd and Flygon.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<h1>Set Details</h1> <p>Strength Sap is one of Vileplume’s biggest assets to check Pokemon like Copperajah and Flygon. Corrosive Gas removes the item of common switch-ins like Bronzong, Copperajah, and Arcanine. Alternatively, Sleep Powder can be used to put common switch-ins such as Talonflame and Arcanine to sleep, making it safer for Vileplume to switch out on them. Black Sludge gives Vileplume extra recovery, but running no item is better for checking Knock Off and Poltergeist users like Drapion and Golurk.</p> <p>Vileplume is weak to Flying-types, so Steel- and Rock-types such as Bronzong, Copperajah, and Diancie that can check Talonflame and Braviary are appreciated. In return, Vileplume can check Rotom-C, Decidueye, and Vaporeon for them. Vileplume struggles against strong Psychic-types such as Starmie and Indeedee-F; therefore, partners like Bronzong and Copperajah are great. Vileplume in return checks Fighting-types such as Passimian for them. Vileplume dislikes Fire-types like Salazzle, so Mantine and Goodra are great partners for it. Vileplume and Guzzlord form a great core, since they are able to wall physical and special attackers while canceling out each other's weaknesses; Vileplume helps with Fighting- and Fairy-types, and Guzzlord helps with Psychic-types. Offensive teammates like Flygon and Starmie both target Dragalge and Arcanine, which Vileplume has trouble with.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 298730, "username": "poh"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "estronic"}]}], "writtenBy": [{"user_id": 415305, "username": "Katy"}]}
  },
  "Arcanine": {
    "overview": "<p>Arcanine's typing and ability in Intimidate allow it to effectively check Copperajah as well as other foes like Escavalier, Tauros, and Dhelmise. It then functions as a defensive pivot with Teleport, allowing it to gain momentum against its switch-ins like Salazzle and Starmie. Arcanine's Teleport is also vital for teams with frail wallbreakers like Tyrantrum and Exploud, as it allows them to safely get in against Mantine and Sylveon without the risk of status and chip damage. However, Arcanine risks compromising its longevity when using Teleport on walls and is easily worn down by Toxic and Knock Off. Additionally, it fails in the face of common physical attackers like Tyrantrum, Golurk, and Diancie. Arcanine relies heavily on Teleport and supportive teammates to punish its checks, and if it loses this support late-game, its passivity becomes a glaring issue against foes like Dragalge and Blastoise.</p> ",
    "comments": "<h1>Other Options</h1> <p>Arcanine has a vast offensive movepool and mixed offensive stats to make it less passive, so attacks like Extreme Speed, Wild Charge, and Scorching Sands work as alternatives to Flamethrower or Toxic. Offensive sets enjoy this coverage as well but are inefficient due to being easy to wall and wear down.</p> <h1>Checks and Counters</h1> <p><strong>Dragon-types</strong>: By resisting Flamethrower and being immune to Toxic, Dragalge can safely switch in against Arcanine and punish it with all of its usual coverage. Arcanine should also be wary of Dragalge, Tyrantrum, and Goodra, but Teleport at least allows it to bring in faster wallbreakers if it still has valid support.</p> <p><strong>Water-types: Offensive Water-types like Starmie and Blastoise are the hardest for Arcanine to deal with, and while defensive examples like Mantine and Vaporeon are checks as well, they are more manageable with Toxic and Teleport.</p> <p><strong>Ground-types: Arcanine fails to switch into and wall Golurk and Mudsdale, although it may have a better chance if it opts for Will-O-Wisp.</p> <p><strong>Residual Damage: Switching into attacks and following up with Teleport will wear Arcanine down, and it will lose momentum anytime it is forced to recover. Moreover, Arcanine's effectiveness is limited by Knock Off, Corrosive Gas, and Toxic from walls like Escavalier, Vileplume, and Talonflame.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<h1>Set Details</h1> <p>Teleport is essential for Arcanine to slowly pivot, as it can stomach attacks from Copperajah and bring in revenge killers unscathed. Toxic hurts walls like Sylveon, Vaporeon, and Mantine that take next to nothing from Flamethrower. Will-O-Wisp is an alternative to Toxic so that Arcanine punishes Sirfetch'd, Diancie, and Tyrantrum more effectively. With 64 Speed EVs, Arcanine is faster than Adamant Tyrantrum.</p> <p>As a check to physically offensive Steel-types, Arcanine finds itself being invaluable to Sylveon and Diancie, and they in return offer Heal Bell to cure Toxic poison. Arcanine also helps special attackers like Goodra, Rotom-C, and Dragalge for the same reason, and the latter two are additional pivots that chain momentum with Arcanine. Wallbreakers like Golurk, Tyrantrum, and Exploud all find safe opportunities to switch into walls via Teleport support, and when they find themselves threatened by revenge killers such as Tauros and Decidueye, Arcanine again is a good defensive answer. Vileplume and Mudsdale cover Knock Off users that Arcanine is vulnerable to like Sirfetch'd and Guzzlord. For specially offensive threats, Mantine and Vaporeon will help, and so will Decidueye and Choice Scarf Heliolisk to offensively pressure Blastoise and Starmie. Ground-type checks like Rotom-C, Tsareena, and Xatu are valuable so Arcanine won't have to take an Earthquake.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 241380, "username": "Abejas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}
  },
  "Machamp": {
    "overview": "<p>Machamp's nearly unstoppable wallbreaking power makes it a force to be reckoned with in the NU metagame. Because of this, switch-ins to it are very inconsistent, since it OHKOes or 2HKOes most of the tier. Additionally, its coverage options help it immensely; bulky Flying- and Poison-types like Talonflame and Vileplume falter in the face of Facade, whereas faster foes like Tyrantrum and Ninjask risk being picked off by Bullet Punch. Unfortunately, it does have a hard time coming in with its mediocre bulk and resistances. Its Speed tier is not great either, being slower than other wallbreakers like Sirfetch'd and Decidueye. Machamp also requires a turn for its item to activate so that it can become a huge threat, which causes it to need plenty of pivot support to bring it in safely.</p> ",
    "comments": "<h1>Other Options</h1> <p>Assault Vest improves Machamp's ability to switch in and gives it the opportunity to switch into opposing Scalds and Sludge Bombs from Pokemon like Vaporeon and Salazzle, respectively. Earthquake is also an option to use over Bullet Punch to OHKO Garbodor without the effect of Aftermath and Rocky Helmet chip, but this means that Machamp loses out on a priority move that can help it in the long run.</p> <h1>Checks and Counters</h1> <p><strong>Flying-types: Threats like Ninjask, Braviary, and Talonflame all outspeed Machamp and offensively pressure it with their respective STAB moves. None of them want to be hit by Guts-boosted Facade, however.</p> <p><strong>Ghost-types: Threats like Golurk, Decidueye, Dhelmise, and even Silvally-Ghost can deal notable damage to Machamp while also halting it from spamming Close Combat. None of them want to switch into Knock Off, though.</p> <p><strong>Physical Walls: Sylveon, Talonflame, and Vileplume are situational defensive checks to Machamp that prevent spamming of Close Combat and beat it with a safe switch in, while others like Garbodor and Mudsdale can eat up a Close Combat. Neither of them are strong enough to revenge kill -1 Machamp unless it's weakened, however.</p> <p><strong>Faster Wallbreakers: Sirfetch'd and Starmie are just a couple of speedy threats that can make short work of Machamp.</p> ",
    "sets": [
      {
        "name": "Guts Wallbreaker",
        "description": "<h1>Set Details</h1> <p>Knock Off is a solid midground option while also KOing or heavily damaging Ghost-types like Golurk, Decidueye, and itemless Dhelmise. Guts-boosted Facade ensures 2HKOs on common physical walls like Vileplume, Sylveon, and Mantine. Bullet Punch gives Machamp priority to pick off faster threats like Ninjask, Decidueye, and Tyrantrum, although Heavy Slam can be used over Bullet Punch to guarantee OHKOs on Diancie and Sylveon.</p> <p>Teammates like Sylveon, Comfey, and Dragalge that appreciate Machamp's capacity for offensively pressuring Steel-types are appreciated. In return, Sylveon provides Wish support to offset accumulated burn chip, Comfey can pivot on Steel-types to bring in Machamp, and Dragalge can also pivot on Steel-types while providing Toxic Spikes support and weakening Fairy-types that Machamp hates. Teammates like Ninjask, Xatu, and Choice Scarf Rotom-C that lure in and pivot on Steel-types can bring in Machamp to threaten such threats. Ghost-types prevent Machamp from spamming Close Combat. Therefore, Dark-type teammates like Drapion and Guzzlord are appreciated. A partner like Diancie can check Flying-types like Ninjask, Talonflame, and Braviary for Machamp.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 241380, "username": "Abejas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}]}
  },
  "Weezing": {
    "overview": "<p>Weezing's good physical bulk, defensive typing, and access to Levitate and Will-O-Wisp allow it to check various physical threats such as Sirfetch'd, Toxicroak, Silvally-Ground, and Golurk all in one. Weezing can also restrict defensive Pokemon and bulky setup sweepers such as Vileplume, Snorlax, and Doublade with Taunt. However, Weezing has no reliable recovery besides Pain Split, meaning it struggles to stay healthy. Many special attackers such as Dragalge, Salazzle, and Exploud easily switch into and threaten Weezing due to its bad special bulk and limited coverage. Finally, Weezing faces slight competition with other defensive Poison-types such as Garbodor and Vileplume, which check similar physical threats and offer some nice support options such as Spikes and a useful secondary typing, respectively.</p> ",
    "comments": "<h1>Other Options</h1> <p>Weezing can use Toxic instead of Toxic Spikes to badly poison a Pokemon directly. It also allows Weezing to poison airborne Pokemon such as Talonflame and Mantine. Corrosive Gas is an option to remove opposing items, but it is hard to fit over another move. Neutralizing Gas can be used instead of Levitate to set Toxic Spikes against Xatu and better check physical attackers like Machamp and Araquanid. However, outside of these examples, it has little use, and Levitate gives Weezing a key niche over other Poison-types in NU. Flamethrower is an option to hit Toxicroak and Steel-types, but besides Escavalier and Doublade, it does not do much to the other Steel-types, and crippling them with Will-O-Wisp is often enough.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types: Psychic-types such as Starmie, Xatu, and Indeedee-F threaten Weezing with their powerful STAB moves. In addition, Xatu prevents Weezing from using status moves with Magic Bounce. However, they all dislike being poisoned by Sludge Bomb.</p> <p><strong>Special Attackers: Due to Weezing's bad special bulk, strong special attackers such as Exploud, Heliolisk, and Goodra easily break through it.</p> <p><strong>Poison-types: Salazzle is a huge offensive threat to Weezing, since it takes little from Sludge Bomb, is immune to Will-O-Wisp, and easily sets up in front of Weezing. Other Poison-types such as Dragalge and special Toxicroak also take little from Sludge Bomb and pressure Weezing with their strong moves, but they dislike the chip damage from Will-O-Wisp.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<h1>Set Details</h1> <p>Will-O-Wisp cripples physical attackers such as Golurk, Drapion, and Copperajah. Pain Split gives Weezing recovery and helps wear down opposing Pokemon like Guzzlord. Taunt restricts defensive Pokemon, prevents slow entry hazard setters such as Copperajah and Mudsdale from setting their hazard, and shuts down bulky setup sweepers such as Curse Snorlax and Bulk Up Scrafty. Toxic Spikes can be used instead to punish grounded Pokemon and weaken them, which is especially helpful for bulky Pokemon such as Vaporeon, Diancie, and Sylveon. Levitate is the preferred ability to better check Ground-types and physical attackers such as Golurk, Drapion, and Mudsdale. However, Rocky Helmet punishes physical attackers such as Passimian and Ninjask. Black Sludge is also an option for some passive recovery. 44 Speed EVs allow Weezing to outspeed Vaporeon and prevent it from passing Wish with Taunt.</p> <p>Weezing works best on balance and more defensive teams that need a reliable check for physical threats such a Sirfetch'd, Toxicroak, and Golurk as well as a Ground immunity. Bulky Dark-types such as Guzzlord and Scrafty pair well with Weezing, as they check Psychic-types such as Xatu and Starmie and can remove Heavy-Duty Boots with their Knock Off if Weezing carries Toxic Spikes. Bulky Steel-types such as Copperajah and Escavalier also check Psychic-types and various other special attackers such as Dragalge, Goodra, and Heliolisk that threaten Weezing. In return, Weezing checks Fighting- and Ground-types. Vaporeon and Sylveon are good teammates, since they keep Weezing healthy with their Wish support. Checks to Salazzle such as Dragalge, Vaporeon, and Mantine are also helpful, as it easily sets up in front of Weezing. Finally, setup sweepers such as Glastrier, Ninjask, and Braviary appreciate Weezing's Toxic Spikes support, as it weakens many of their checks such as Vaporeon, Diancie, and Sylveon, and they can stall for poison damage turns with Substitute or Protect.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 464737, "username": "Holy-Darky"}]}
  },
  "Tangela": {"sets": [{"name": "Physical Wall"}]},
  "Starmie": {
    "overview": "<p>Starmie stands out as a great wallbreaker and spinner in NU thanks to its coverage and utility options alongside its Speed tier. Starmie outspeeds most of the unboosted metagame, making it easy to safely wallbreak and difficult to revenge kill. Starmie can also use its defensive utility to switch in and threaten Pokemon like Arcanine. Unfortunately, Starmie is vulnerable to common revenge killers like Choice Scarf Passimian and Rotom-C, as well as First Impression users like Sirfetch'd and Flygon, which can easily OHKO Starmie. Additionally, specially bulky Pokemon like Goodra, Dhelmise, and Guzzlord can be difficult to break past, especially without proper prediction.</p> ",
    "comments": "<h1>Other Options</h1> <p>A utility set can be run with an EV spread of 252 HP / 40 SpD / 216 Spe, a Timid nature, Heavy-Duty Boots as an item, and Natural Cure for its ability to act as a status absorber and pivot with Flip Turn. This EV spread lets Starmie outspeed threats like Tauros and Espeon, and it also prevents faster threats like Salazzle from overwhelming it as easily.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers: First Impression users like Sirfetch'd and Flygon—along with faster Pokemon like Salazzle, Inteleon, and Choice Scarf users in Passimian and Rotom-C—OHKO Starmie with priority or outspeed it and threaten heavy damage or a KO.</p> <p><strong>Dark-types: Drapion and Guzzlord threaten Starmie with their respective STAB moves and force it out. Guzzlord doesn't want to be hit with an Ice Beam, though, while Drapion gets blasted by Hydro Pump.</p> <p><strong>Grass-types: Decidueye, Celebi, and Dhelmise are able to threaten Starmie with their super effective STAB moves. None of them want to switch into an Ice Beam, however.</p> <p><strong>Specially Bulky Pokemon: Assault Vest Copperajah, Sylveon, and Escavalier all win a one-on-one battle with Starmie due to their bulk.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<h1>Set Details</h1> <p>Because of Analytic, Starmie's Speed tier, and its coverage options, it's tough to switch into and matches up well against other offensive Pokemon like Life Orb Zoroark and Tauros. Thunderbolt nails opposing Water-types like Mantine and Blastoise, whereas Ice Beam hits threats like Goodra and Dragalge for decent damage. Psyshock can be used in place of Ice Beam to have a good chance to OHKO Dragalge and guarantee a 2HKO on Goodra while still 2HKOing Vileplume. Recover gives Starmie reliable recovery, since it will be switching into attacks often to wallbreak. Alternatively, Rapid Spin not only removes entry hazards but also gives Starmie a boost in Speed and makes it tougher to revenge kill. Choice Specs is also a viable item, with Trick being a great option alongside it to cripple common switch-ins like physical Guzzlord and Sylveon.</p> <p>Spikes support from Garbodor can wear down the opposing team to put threats like Copperajah within range of a Hydro Pump and punish forced switches. Garbodor also functions as a consistent switch-in to Fighting-types, whereas Starmie is only a soft check. In return, Starmie beats Mudsdale and Golurk. Sylveon is a good teammate to check Choice Scarf users like Passimian and Flygon. U-turn from threats like Ninjask and Choice Scarf Passimian is problematic for Starmie. Therefore, teammates like Talonflame and Comfey work well against them. Talonflame, in particular, can fish for Flame Body burns, while Comfey provides Defog support and can bring Starmie in against foes like Arcanine and Golurk. Lastly, Ground-type partners like Mudsdale and Golurk eat up Electric-type moves and provide Stealth Rock support too.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 241380, "username": "Abejas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}]}
  },
  "Tauros": {
    "overview": "<p>Tauros is a fast wallbreaker with completely unresisted coverage. Sheer Force and Life Orb make its STAB Body Slam nail walls like defensive Flygon and Mantine. It also has the coverage for Pokemon that take Body Slam, like Close Combat for Copperajah and Throat Chop for Decidueye. Moreover, its great Speed allows it to function as a revenge killer and cleaner once teams are weakened. Still, Tauros is frail, so it cannot afford to trade hits with targets that avoid a OHKO from it, let alone against faster attackers like Starmie and Choice Scarf Rotom-C. It needs positioning support and ample chip damage before it can safely KO threats like Dragalge and Tyrantrum, which makes it fall short as a reliable revenge killer for some teams. Tauros is also plagued by status from Talonflame and Vileplume and is unable to break through the bulkiest of physical walls, like Mudsdale.</p> ",
    "comments": "<h1>Other Options</h1> <p>Zen Headbutt sometimes fits on Tauros over Iron Head to reliably revenge kill Fighting- and Poison-types. Earthquake hits Diancie and Arcanine on top of targeting Poison-types like Dragalge and Toxicroak, but Body Slam hits the latter two hard as is and Iron Head is able to OHKO Diancie. Fire Blast is another coverage option to 2HKO Escavalier and avoid Effect Spore from Vileplume, but these two walls are less popular than Diancie and Sylveon.</p> <h1>Checks and Counters</h1> <p><strong>Physical Walls: Vaporeon, Mudsdale, Vileplume, and Arcanine outstall Tauros with their bulk and / or recovery. Talonflame outspeeds and threatens burn through Flame Body and Will-O-Wisp.</p> <p><strong>Bulky Attackers: Without a guaranteed KO, Tauros will have hard time dealing with bulky attackers that are able to OHKO it back like Dragalge, Tyrantrum, Sirfetch'd, Machamp, and Escavalier. However, when these threats take entry hazard damage and possibly Defense drops from Close Combat, Tauros is more likely to beat them.</p> <p><strong>Revenge Killers: Once Tauros is worn down, faster Pokemon like Salazzle and Starmie and priority users like Sirfetch'd are able to revenge kill it. This also applies to fast pivots like Choice Scarf Flygon and Rotom-C, which are able to chip Tauros down themselves with U-turn and Volt Switch.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<h1>Set Details</h1> <p>Close Combat is Tauros's strongest attack versus Steel-types like Copperajah and Escavalier while also nailing Tyrantrum, Guzzlord, and Exploud. Throat Chop targets Ghost-types like Golurk and Dhelmise. Iron Head prevents physically defensive Fairy-types like Diancie and Sylveon from walling Tauros. To help in its role as a cleaner, Work Up is an option over Iron Head, although Tauros will then need more support wearing down the aforementioned Fairy-types.</p> <p>Residual damage is a great way to support Tauros, as Pokemon like Tyrantrum and Drapion need to be worn down before they can be revenge killed. Entry hazard teammates like Copperajah, Diancie, and Garbodor help in this regard, with Copperajah also wearing down shared checks like Bronzong and Mudsdale, and Garbodor checking Fighting-types. U-turn Talonflame and Rocky Helmet Xatu are defensive pivots that also compound residual damage. Choice Scarf users like Flygon and Rotom-C target the threats faster than Tauros like Salazzle, Starmie, and Choice Scarf Passimian while also bringing Tauros in safely. Knock Off and Toxic support from Pokemon like Salazzle and Guzzlord wears down walls like Vaporeon and Mudsdale so they're unable to consistently switch into Tauros. For more pressure against physical walls, Tauros teams should fit special wallbreakers like Choice Specs Heliolisk and Decidueye, especially since they both can afford to switch into Scald and Strength Sap from Vaporeon and Vileplume.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 298730, "username": "poh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}
  },
  "Vaporeon": {
    "overview": "<p>Thanks to its good typing, solid defenses, and great supportive tools, Vaporeon cements itself as one of the best defensive Pokemon in NU. Vaporeon's solid overall bulk allows it to check strong Pokemon such as Salazzle, Talonflame, and Blastoise. Moreover, Vaporeon has great utility options in Wish, Heal Bell, and Toxic to support its partners, and it is able to scout attacks with Protect. Unfortunately, Vaporeon faces lots of competition from Sylveon; despite Vaporeon's ability to pivot with Flip Turn, Sylveon is an overall superior defensive Pokemon that can also pass Wishes and defensively answer offensive Water-types like Starmie and Inteleon. Also, Vaporeon's passivity leaves it easily exploited by threats like Rotom-C, Vileplume, and Decidueye. Furthermore, even with a lot of investment in its bulk, Vaporeon's Defense is still lacking, which leaves it vulnerable to strong physical wallbreakers.</p> ",
    "comments": "<h1>Other Options</h1> <p>Haze is a great alternative over Flip Turn, as it allows Vaporeon to stop setup sweepers like Shell Smash Blastoise, but using this comes at the cost of Flip Turn's ability to grab momentum. Ice Beam can be used to hit incoming Grass- and Dragon-types like Rotom-C, Vileplume, and Flygon harder. A more specially defensive EV spread lets Vaporeon better fend off Pokemon such as Starmie and Blastoise.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Both Decidueye and Dhelmise threaten Vaporeon with their STAB options, but they have to be careful about switching into Vaporeon and getting burned by Scald. Vileplume is also annoying, as it can hit Vaporeon super effectively with Giga Drain and regain health while having the ability to poison it with Sludge Bomb.</p> <p><strong>Electric-types: Heliolisk is very annoying, as it is immune to Vaporeon's Water-type STAB moves; all Vaporeon can do is hit it with Toxic on the switch. Rotom-C is especially dangerous, as it has two STAB moves that are super effective against Vaporeon.</p> <p><strong>Dragon-types: Dragalge is very potent against Vaporeon, as it doesn't fear being whittled down by Toxic and can fish for poisons with Sludge Bomb. Goodra hits Vaporeon with strong super effective coverage, and Guzzlord weakens Vaporeon severely with Knock Off and Toxic, but it dislikes getting burned by Scald.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<h1>Set Details</h1> <p>Heal Bell is a great tool to keep Vaporeon and its partners healthy and helps it cure status effects, which otherwise hinder its role as a defensive Pokemon. Alternatively, Toxic wears down Mantine and Heliolisk, two Pokemon Vaporeon otherwise is helpless against, whereas Flip Turn creates momentum for Vaporeon's teammates, helps Vaporeon pass Wishes more safely, and prevents foes such as Vileplume, Rotom-C, and Dragalge from taking advantage of it. Leftovers grants Vaporeon more longevity and synergizes well with Protect. Alternatively, Heavy-Duty Boots grants Vaporeon better durability and helps it to pivot more consistently. The listed EVs allow Vaporeon to avoid a 2HKO from +4 Blastoise's Dark Pulse.</p> <p>Vaporeon has great typing and bulk, and it fits well on bulkier builds such as bulky offense and balance due to its passivity. Wish and Flip Turn are excellent tools to safely bring in its partners and keep them healthy; these partners include wallbreakers like Assault Vest Copperajah, Dragalge, and Escavalier. Vaporeon dislikes strong Electric- and Grass-types such as Heliolisk, Rotom-C, Decidueye, and Dhelmise, so partners like Vileplume, Dragalge, and Goodra check them for Vaporeon; in return, Vaporeon can safely bring in these checks with Flip Turn. Ground-types such as Flygon and Mudsdale are good partners, as they check Electric-types like Heliolisk. Vaporeon is reliant on its item, so Knock Off absorbers such as itemless Vileplume make for great partners. In return, Vaporeon helps Vileplume against Pokemon like Salazzle, Talonflame, and boosted Blastoise.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 241380, "username": "Abejas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 415305, "username": "Katy"}]}
  },
  "Omastar": {"sets": [{"name": "Shell Smash"}, {"name": "Lead"}]},
  "Aerodactyl": {"sets": [{"name": "Choice Band"}, {"name": "Lead"}]},
  "Articuno-Galar": {"sets": [{"name": "Future Sight"}]},
  "Xatu": {
    "overview": "<p>Xatu derives much of its value through two tools: Magic Bounce and Teleport. Xatu is fantastic at pivoting into passive foes like defensive Flygon, Vaporeon, and Talonflame that rely on status to inflict significant damage and is a true nuisance for entry hazard setters too, including Copperajah, Mudsdale, and Bronzong. Additionally, with Teleport, Xatu can guarantee safe entry for both potent wallbreakers and setup sweepers, which has made it the staple dual screens setter on hyper offense teams and sets it apart from other dual screens setters like Espeon. Where Xatu comes short, though, is in its passivity. Despite Teleport helping it keep up momentum, its low offensive prowess still causes it to cede turns to potent wallbreakers like Starmie, Tyrantrum, and Guzzlord. Additionally, its poor defensive stats make it less effective at directly switching into coverage attacks from the likes of Sirfetch'd and Machamp and force it to use Roost very frequently to stay healthy. Xatu also struggles heavily to prevent Diancie from setting Stealth Rock, making it much less useful in certain matchups if it lacks Defog.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Scarf sets with Trick are useful for crippling passive foes like Bronzong, Talonflame, and Mantine. Xatu can attempt boosting sets with Calm Mind and Stored Power, but because of relatively low initial damage output, they take a few turns to ramp up. On utility sets, Defog is an option if Xatu is your sole entry hazard remover; however, Magic Bounce + Heavy-Duty Boots Xatu is typically serviceable enough as a sole hazard remover.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Guzzlord, Drapion, and Zoroark all fear very little from Xatu and threaten heavy damage in return. The most Xatu can do is bring in a teammate to deal with them through Teleport or fire off a Night Shade.</p> <p><strong>Ghost-types: Pokemon like Decidueye, Golurk, and Silvally-Ghost can all easily OHKO Xatu with their STAB attacks; however, Golurk and Decidueye must be mindful of using Poltergeist against Xatu, since it may not be holding an item.</p> <p><strong>Rock-types: Diancie is the hardest Stealth Rock setter to deal with for Xatu, since Diamond Storm and Moonblast do heavy damage to it. Other Rock-types like Tyrantrum and Aerodactyl are problematic too, since they easily take Xatu out.</p> <p><strong>Powerful Wallbreakers: Xatu's bulk, even when invested in, isn't very great, so strong attackers like Machamp, Tauros, and Toxicroak can still get past it.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<h1>Set Details</h1> <p>Although Psychic is a more consistent attack, Xatu sometimes runs Future Sight because of its great synergy with Teleport and U-turn, letting Xatu bring in a strong wallbreaker to make use of the extra damage Future Sight provides. Night Shade is helpful to force damage onto Guzzlord and other Dark-types like Drapion; alongside Rocky Helmet, it's also enough for Xatu to beat Steel-types like Copperajah. However, Heat Wave can be used instead to take out Steel-types more quickly. The choice between Teleport and U-turn is mostly arbitrary, although it's noteworthy that Teleport has slightly better synergy with Future Sight. Xatu can also drop a STAB move entirely to run Thunder Wave, further supporting slow wallbreakers.</p> <p>Rocky Helmet is the preferred item for Xatu so it can successfully stall out Copperajah and prevent it from forcing Stealth Rock. However, Xatu can instead opt for Heavy-Duty Boots to be a better pivot in case it fails to keep Stealth Rock off the field; even going itemless is a viable option if checking Poltergeist users like Golurk and Decidueye is desired. 16 Speed EVs and a Timid nature give Xatu the jump on Jolly Sirfetch'd as well as other slow wallbreakers like Adamant Tyrantrum and neutral-natured Decidueye.</p> <p>Teammates that can make use of Teleport support—Sirfetch'd, Tyrantrum, and Choice Band Guzzlord, for instance—are necessary to get the most out of Xatu. Wallbreakers such as these also appreciate Xatu's Future Sight support, especially since it makes physical walls like Mudsdale and Vileplume worse at switching into them. Similarly, teammates like itemless Ninjask, Focus Sash Salazzle, and Substitute Braviary that appreciate extra security against entry hazards are prime teammates for Xatu. Dark-types like Guzzlord, Drapion, and Zoroark fear very little from Xatu and can easily switch into and threaten to KO it; this makes teammates like Sylveon, Mudsdale, and Machamp good to have, with the latter immensely benefitting from Teleport support.</p> "
      },
      {
        "name": "Dual Screens",
        "description": "<h1>Set Details</h1> <p>Thanks to Teleport, Xatu is the premier dual screens setter of the tier; it can set its screens and then guarantee safe entry for a setup sweeper with Teleport. Thunder Wave provides more overall team support and prevent opposing setup sweepers from taking advantage of its passivity as easily, but Roost on Colbur Berry sets helps provide Xatu with more chances to set its screens. Maximum Speed investment with a Timid nature gives Xatu the best shot at setting both its screens.</p> <p>This set fits exclusively on dual screens offense teams, and thus the suggested teammates are very narrow in scope. Setup sweepers such as Blastoise, Decidueye, and Salazzle are a must, with the former being a staple on hyper offense teams. Decidueye and Salazzle are also notable for their appreciation of paralysis support, and Focus Sash Salazzle really appreciates Xatu's Magic Bounce. Offensive Stealth Rock setters like Celebi and Focus Sash Aerodactyl preserve offensive momentum, and the former can also supply these teams with Healing Wish support to give setup sweepers a second chance at cleaning.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 211471, "username": "shiloh"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Quagsire": {
    "overview": "<p>Quagsire finds success thanks to its great defensive typing, solid defensive stats, reliable recovery, and very useful ability in Unaware. It is used mostly on stall and balance teams to wall a variety of threats such as Salazzle, Blastoise, Tyrantrum, and Drapion while offering fantastic role compression. Quagsire doesn't only stare down offensive threats, though, as it can pester many defensive Pokemon with moves like Encore, Toxic, and Yawn. While Quagsire is typically the go-to option to take on setup sweepers, its below-average stats leave it struggling to deal with strong wallbreakers such as Tauros, Sirfetch'd, and Golurk. Quagsire also has to fear Grass-type coverage such as Power Whip from Copperajah and powerful Grass-types such as Rotom-C and Tsareena, which can come in on Quagsire very easily and force it out.</p> ",
    "comments": "<h1>Other Options</h1> <p>Heavy-Duty Boots can help Quagsire pivot into threats, especially when facing Toxic Spikes, but the loss of Leftovers can make a lot of matchups more difficult than they need to be. Quagsire can viably run a Curse set, potentially even with Ice Punch or Avalanche to snipe incoming Grass-types, although special wallbreakers are far too common, and the set's initial damage output is far too low to be worth it in most cases. There are many other utility moves Quagsire can use, such as Yawn, Haze, and Infestation, but the ones listed in the main set are most useful overall.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types and Grass-type Coverage</strong> Vileplume, Tsareena, Rotom-C, and Decidueye are all fairly common Grass-types that easily threaten an OHKO on Quagsire. Grass-type coverage like Power Whip from Copperajah and Grass Knot from Heliolisk also destroys Quagsire.</p> <p><strong>Special Wallbreakers Special wallbreakers that don't rely on setting up can cleave through Quagsire quite easily; Exploud, Sylveon, and Vanilluxe are all capable of coming in on Quagsire and threatening a near OHKO.</p> <p><strong>Passive Damage Despite its great defensive typing and ability, Quagsire's stats often leave much to be desired, meaning that entry hazards, status, and item removal can leave it overwhelmed by Pokemon it's meant to check. Some examples of Pokemon that do this effectively are Drapion with Knock Off, Salazzle with Toxic, and Spikers.</p> <p><strong>Strong Physical Wallbreakers Pokemon that can muscle past Quagsire with raw power such as Flame Orb Machamp, Choice Band Golurk, and Sirfetch'd can be problematic if it is the sole physical wall on a team.</p> ",
    "sets": [
      {
        "name": "Mixed Wall",
        "description": "<h1>Set Details</h1> <p>Earthquake and Toxic synergize perfectly with each other, as the Poison- and Steel-types immune to Toxic are often weak to Earthquake, which allows Quagsire to exert some offensive pressure even as a defensive Pokemon. Protect can be used in favor of Scald to rack up as much poison damage as possible, which is extremely helpful in whittling down threats such as Rotom-C and Decidueye. 68 Special Defense EVs allow it to survive two Surfs from Blastoise, although it must be wary of Torrent-boosted Surf, and deal with Salazzle and Dragalge more effectively.</p> <p>Quagsire pairs best with other walls often found on stall teams, which may fall in the face of common stallbreakers such as Tyrantrum, Salazzle, and Drapion. Goodra and Escavalier take on Grass-types very nicely for Quagsire and also help make up for its poor Special Defense. Rocky Helmet Xatu and Effect Spore Vileplume can punish powerful wallbreakers like Sirfetch'd and Tauros that can overwhelm Quagsire and can switch into Toxic aimed at it. They appreciate Quagsire's Rock and Fire resistances, respectively, while providing additional partners that resist Grass.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 298730, "username": "poh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 400664, "username": "Togkey"}]}
  },
  "Sneasel": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Mantine": {
    "overview": "<p>Because of its Water / Flying typing, Mantine can check a number of relevant Pokemon in the tier like Golurk, Salazzle, and Mudsdale. Its high special bulk allows it to switch into special attackers like Celebi and Blastoise, while Water Absorb lets it also act as a Scald absorber. Unfortunately, it has a hard time getting rid of all of the common Stealth Rock setters; Copperajah beats it one-on-one with Power Whip and only fears a Scald burn, and Diancie's Diamond Storm hits it for super effective damage. Mantine also invites in Dragon- and Water-types like Goodra, Dragalge, and Vaporeon because it lacks a way to deal with them.</p> ",
    "comments": "<h1>Other Options</h1> <p>Hurricane is an option over Air Slash for more damage. An offensive Rain Dance set with Hydro Pump and Hurricane can be used to clean, but Mantine is usually worse than Blastoise and Kingdra for this role.</p> <h1>Checks and Counters</h1> <p><strong>Electric-types and Electric-type Coverage: Rotom-C and Heliolisk fear little from Mantine and they heavily pressures it with their Electric-type attacks. Mantine also fails as a special wall versus attackers that carry Thunderbolt like Starmie and Goodra.</p> <p><strong>Physical Attackers: Pokemon like Tyrantrum, Decidueye, and Drapion target Mantine's lackluster physical bulk and can potentially remove it outright if they set up.</p> <p><strong>Rock-types: Although they fear Scald, foes like Tyrantrum, Diancie, and Aerodactyl can easily bypass Mantine with powerful Rock-type moves.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<h1>Set Details</h1> <p>Air Slash allows Mantine to hit Dragon- and Grass-types like Dragalge, Rotom-C, and Vileplume that wouldn't normally be bothered by Scald. Alternatively, Haze helps against setup sweepers like Blastoise. Toxic is also an option to cripple bulky foes like Guzzlord, Sylveon, and Vaporeon, although the former two options are typically superior. 136 Speed EVs creep Pokemon like Adamant Golurk and Machamp.</p> <p>Mantine appreciates Ground-types like Mudsdale to take on Electric- and Rock-types like Heliolisk and Tyrantrum. Fire- and Fighting-types like Arcanine, Salazzle, and Sirfetch'd can take care of Steel-types like Copperajah and Escavalier with their STAB attacks. Mantine's physical bulk is not that great, so partnering it with a Fighting-type check like Sylveon or Vileplume is necessary. Steel-types are appreciated to help with Rock-types like Diancie and Tyrantrum; in return, Mantine helps get rid of Fire-types like Arcanine, Salazzle, and Talonflame that may try KOing them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 298730, "username": "poh"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 481576, "username": "Roxiee"}]}
  },
  "Kingdra": {
    "overview": "<p>Kingdra has insane late-game potential thanks to how strong its Sniper-boosted critical hits are. The amount of Pokemon in NU that can contend with Kingdra's Water + Dragon coverage is low, and the amount that can meaningfully threaten Kingdra in return is even lower. Kingdra suffers, though, from taking multiple turns to fully set up, which gives the opponent a bit of time to prevent it from taking the game over. Additionally, many of the Pokemon it'd like to set up against, namely Vaporeon, Talonflame, and Arcanine, commonly run Toxic, which severely compromises its ability to clean late-game. Lastly, despite being one of the few offensive checks to Blastoise, Kingdra offers very little defensively compared to other Water- and Dragon-types like Vaporeon, Dragalge, and Guzzlord, meaning it requires a good amount of defensive teambuilding support.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Specs sets possess immense power, can provide pivot support with Flip Turn, and fit well on rain teams, but Starmie is a better dedicated wallbreaker, and rain teams aren't very consistent.</p> <h1>Checks and Counters</h1> <p><strong>Sylveon: Bulky Sylveon variants can stomach a critical hit from Surf and retaliate with Moonblast or Hyper Voice, the latter having a decent chance to OHKO Kingdra and bypassing Substitute. Even offensive variants can easily survive an attack from Kingdra and OHKO in return.</p> <p><strong>Bulky Water-types</strong>: Despite being setup fodder for Kingdra, Vaporeon and Mantine can cripple it with Toxic and stall out turns and Draco Meteors by spamming their recovery moves.</p> <p><strong>Offensive Pressure: Kingdra isn't very strong nor fast before it boosts, and its bulk isn't very great; therefore, Pokemon like Rotom-C, Decidueye, and Silvally-Ghost can give it issues because Kingdra can't OHKO them without a critical hit, is slower than them without an Agility boost, and takes significant damage from their attacks, making it hard to safely set up when faced with such foes. Additionally, priority users like Sirfetch'd, Choice Band Sneasel, and Toxicroak can revenge kill Kingdra regardless of if it uses Agility.</p> <p><strong>Critical Hit-immune Foes: Shell Armor Escavalier counters Kingdra because of its bulk and can remove Kingdra's Scope Lens with Knock Off. Battle Armor Drapion is a much shakier answer, since Draco Meteor KOes it after Stealth Rock, but it can also weaken Kingdra's damage output with Knock Off.</p> ",
    "sets": [
      {
        "name": "CritDra",
        "description": "<h1>Set Details</h1> <p>The combination of Focus Energy and Scope Lens ensures Kingdra can always critically hit, letting it ignore the Special Attack drops from Draco Meteor. Alongside Agility, this severely limits overall counterplay to Kingdra once it sets up. Alternatively, Kingdra can use Substitute to avoid Toxics from Vaporeon, guaranteeing that Kingdra wins one-on-one. A Modest nature is used to guarantee an OHKO on Drapion after Stealth Rock and because Timid isn't necessary thanks to Agility.</p> <p>Because Kingdra has very few answers after boosting, much of the support it requires is related to easing setup. Dual screens from Xatu is one way to do this, making it harder for powerful attackers like Toxicroak and Heliolisk to take Kingdra out. Similarly, pivots like Talonflame and Arcanine that draw in Water-types help provide Kingdra with good setup opportunities. Sylveon is one of the few foes that Kingdra can't OHKO even with a critical hit; teammates like Sirfetch'd and Passimian that can force damage onto it and push it into OHKO range are helpful as a result. Entry hazard support also works to force chip damage onto Pokemon that can stomach a hit, with Pokemon like Diancie, Copperajah, and Garbodor being good hazard setters.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 298730, "username": "poh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Ninjask": {
    "overview": "<p>Ninjask distinguishes itself with amazing Speed backed up by Speed Boost, making it an effective revenge killer and late-game cleaner, especially when combined with Swords Dance. Ninjask's STAB options also allow it to threaten massive damage or outright KOs on offensive Pokemon like Salazzle, Starmie, and Rotom-C. Even options that switch into Ninjask, like Copperajah and Mudsdale, fear repeated U-turn damage and the threats that use such opportunities to come in. However, Ninjask's average Attack leaves a lot to be desired, and it will struggle to break through bulkier teams without a hefty helping of team support. Furthermore, Ninjask's terrible bulk gives it very limited opportunities to set up, as it will take massive damage even from uninvested attacks. Lastly, the use of Acrobatics precludes Ninjask from wearing Heavy-Duty Boots, requiring Ninjask users to run steady entry hazard removal to keep it in play throughout the game.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ninjask can opt to use Dual Wingbeat with Heavy-Duty Boots. Doing so greatly relieves the pressure to keep entry hazards off, making Ninjask easier to fit on teams and use. However, doing so sacrifices a lot of power, and Ninjask's sweeping potential and ability to force switches will sharply drop as a result.</p> <h1>Checks and Counters</h1> <p><strong>Stealth Rock Users</strong>: Stealth Rock users like Diancie, Mudsdale, and Copperajah realistically won't drop to Acrobatics even with prior damage and easily take the opportunity to set up Stealth Rock, making it hard for Ninjask to come in in the future. They also easily KO Ninjask with STAB moves or coverage.</p> <p><strong>Offensive Rock-types and Steel-types: Rock-types and Steel-types like Tyrantrum, Aerodactyl, and Escavalier use their STAB moves and coverage to force Ninjask to retreat while taking little from U-turn.</p> <p><strong>Fire-types: Flame Body and Intimidate users like bulky Talonflame and Arcanine can safely switch into Ninjask's unboosted attacks and proceed to threaten it with OHKOs or status. Furthermore, their slower pivoting options in U-turn and Teleport allow them to grab momentum from Ninjask. Note that Talonflame needs to be wary of a KO from +2 Acrobatics.</p> <p><strong>Rocky Helmet: Users of Rocky Helmet or Aftermath such as Garbodor and Xatu can tack massive amounts of damage on Ninjask as it attacks, further reducing its ability to come in with Stealth Rock on the field. The extra damage also greatly hampers Ninjask's ability to sweep, as setting up becomes more dangerous and it becomes more susceptible to priority moves.</p> <p><strong>Priority Moves: Extreme Speed, Sucker Punch, and Shadow Sneak users such as Arcanine, Toxicroak, and Decidueye can give Ninjask quite the headache, as its terrible bulk means it has a hard time enduring such moves. Fake Out and First Impression are ineffective, though, as Ninjask will just block these moves with Protect.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Acrobatics is the preferred STAB attack; Pokemon that could otherwise endure a +2 Dual Wingbeat, such as Dragalge and Talonflame, are unable to do so for +2 Acrobatics. Several targets, such as Sirfetch'd, are guaranteed to be OHKOed Acrobatics. Protect is useful for scouting the moves of Choice Scarf users such as Passimian and Rotom-C; the Speed Boost accumulated on such turns allows Ninjask to outpace them. 168 EVs allow Ninjask to outpace Choice Scarf Tyrantrum without needing to use Protect; with this Speed, Ninjask is also able to outspeed certain threats at +2, such as Agility Kingdra. The remaining EVs are put into Ninjask's physical bulk and can make a difference when trying to take a priority attack such as +2 Decidueye's Shadow Sneak.</p> <p>Ninjask greatly appreciates teammates that can break down enemy walls like Copperajah and Diancie. Pokemon like Sirfetch'd, Machamp, and Golurk will do so gladly and enjoy Ninjask's propensity to bait in and use U-turn on these walls. Wallbreakers will also be glad to have Ninjask around to check faster threats like Starmie for them. Ninjask can also form potent VoltTurn cores with the likes of Talonflame and Rotom-C. Early-game, Ninjask must use U-turn if faced with Steel-types like Copperajah, Rock-types like Tyrantrum, or Fire-types like Arcanine, so it pairs well with Pokemon that can endure attacks from them, such as Heatproof Bronzong and Mudsdale. Defog and Rapid Spin support from the likes of Rotom-C, Starmie, and Dhelmise is strongly recommended to remove Stealth Rock and to check Diancie. Xatu is notable for preventing Stealth Rock users such as Bronzong and Mudsdale from setting it in the first place.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 435989, "username": "Mariannabelle"}]}
  },
  "Exploud": {
    "overview": "<p>Exploud's stats are not the best on paper, but its access to STAB Boomburst allows it to be a menacing wallbreaker in NU, breaking apart slower Pokemon like Vaporeon and Sylveon with Choice Specs. With a colorful movepool accompanied by Scrappy, Exploud is able to deal with Steel-, Ghost-, and Rock-types such as Escavalier, Golurk, and Diancie. Unfortunately, its slow Speed leaves it open to faster Pokemon like Toxicroak, Rotom-C, and Tyrantrum. Additionally, Exploud matches terribly into common offensive archetypes and must take a strong attack from a Pokemon like Drapion or Blastoise before attacking itself.</p> ",
    "comments": "<h1>Other Options</h1> <p>Sleep Talk is an option with Boomburst and Overheat to allow Exploud to still function as a wallbreaker if it's hit by Sleep Powder from Vileplume. Soundproof is an option to wall opposing Exploud and Hyper Voice Sylveon, but coverage like Shadow Ball is then needed to hit Ghost-types. Additionally, using Soundproof makes Exploud far more prediction reliant, especially if there is a Ghost-type on the opposing team. Silk Scarf alongside Taunt is an option to make Exploud less prediction reliant and prevent foes like Vaporeon, Sylveon, and Mantine from spamming recovery moves.</p> <h1>Checks and Counters</h1> <p><strong>Faster Pokemon: Pokemon like Drapion, Starmie, Tauros, and Rotom-C outspeed Exploud and can revenge kill it. Rotom-C along with Heliolisk and Ninjask can also exploit forced switches from it by pivoting.</p> <p><strong>Fighting-types: Fighting-types like Passimian, Toxicroak, and Sirfetch'd can OHKO Exploud with their STAB attacks, although Sirfetch'd is slower than Exploud and can only take it on if it's not locked into Boomburst.</p> <p><strong>Protect: Due to Exploud being Choice locked, Pokemon like Vaporeon, Sylveon, and Guzzlord can scout its attack with Protect, but even when they switch out to a check, Boomburst is still doing a good amount of chip damage.</p> <p><strong>Normal-resistant Pokemon: Despite Exploud having ways to deal with Pokemon like Assault Vest Copperajah and Diancie, they still check its Boomburst before their HP gets too low.</p> ",
    "sets": [{"name": "DAT LOUD", "description": "<h1>Set Details</h1> <p>Overheat is Exploud's strongest attack for Steel-types like Copperajah and Escavalier. Surf and Focus Blast help deal with Rock-types like Diancie, but Focus Blast notably hits Guzzlord as well. A Modest nature is an option for more power, like 2HKOing Diancie after Stealth Rock, but leaves it open to Pokemon like neutral-natured Decidueye and Tyrantrum.</p> <p>Since Exploud gets worn down easily due to its low Speed and lackluster bulk, slow pivots like Teleport Xatu and Flip Turn Dragalge are appreciated to safely bring it in to wallbreak through teams. Wish passers like Vaporeon and Sylveon can help its longevity and also provide cleric support. Additionally, Sylveon helps with Fighting-types like Sirfetch'd and Passimian. Although Exploud has ways to get rid of Steel-types, it still benefits from Pokemon like Toxicroak and Golurk to speed up the process.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 211471, "username": "shiloh"}, {"user_id": 114198, "username": "Finchinator"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 481576, "username": "roxiee"}]}
  },
  "Absol": {
    "overview": "<p>Absol is an effective wallbreaker because it's incredibly strong and has great coverage; very little can safely switch into it. Furthermore, unlike other wallbreakers with a somewhat average Speed tier, Absol's access to Sucker Punch gives it extra security against frail revenge killers like Salazzle, Heliolisk, and Starmie. Defensively, though, Absol offers very little despite its typing being passable; it just lacks the bulk to make use of its resistances to Ghost and Dark as much as its main competition in Guzzlord, which is much bulkier and has an even better defensive typing. As a result, Absol also struggles getting into battle without aggressive play and pivot support, limiting the amount of chances it has to wallbreak. Absol also can have a rough time dealing with foes like Diancie, Sylveon, and Mudsdale if it lacks the proper coverage move or chance to set up.</p> ",
    "comments": "<h1>Other Options</h1> <p>Psycho Cut has good synergy with Super Luck and targets Toxicroak as well as other Fighting-types that may try pivoting into Knock Off, although Iron Tail is a vastly superior option if you desire more coverage. Focus Sash on dual screens teams works to guarantee Absol a Swords Dance boost. Choice Band sets cannot switch between moves but have great raw power and lack the constant chip damage of Life Orb.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: Toxicroak is one of the better offensive checks to Absol because it resists Dark and Fighting and easily dispatches Absol with Drain Punch. Other Fighting-types like Sirfetch'd, Machamp, and Passimian can deal with Absol too, with the former also having First Impression to avoid sustaining major damage from Absol, but they're much more vulnerable to Close Combat.</p> <p><strong>Physical Walls: Mudsdale has the raw bulk to take multiple attacks from Absol and beat it one-on-one with Earthquake. Vileplume is a shakier answer, needing to be at full health to contend with Absol, but can take two Knock Offs and recover health back with Strength Sap. Arcanine detests losing its Heavy-Duty Boots, but its bulk combined with Intimidate lets it easily wall Absol.</p> <p><strong>Fairy-types: Sylveon and Diancie are both good Knock Off switch-ins that threaten to KO Absol with their STAB attacks. Iron Tail heavily pressures both, though, and even Swords Dance Absol variants can still heavily dent Diancie with Close Combat.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<h1>Set Details</h1> <p>Absol has perfect coverage if it opts for Iron Tail; without it, Fairy-types like Diancie and Sylveon can generally answer it throughout a game. However, Swords Dance is still a great alternative that gives Absol more late-game potential and can severely limit offensive answers to it with the threat of +2 Sucker Punch. Do note, though, that because of how fragile Absol is, Iron Tail's miss chance is even more punishing and it's very hard to find good setup opportunities with Swords Dance. A Jolly nature is usually advised so Absol always outpaces Decidueye and Sirfetch'd, but Adamant lets it always OHKO Heliolisk with Sucker Punch and lowers the amount of chip damage necessary to secure a KO against other revenge killers like Salazzle.</p> <p>Because of Absol's poor defenses, it greatly appreciates the support of pivots to get it in safely. Dragalge, Talonflame, and Rotom-C are some of the best available; Dragalge's slow Flip Turn is particularly nice for guaranteeing safe entry, and it as well as Talonflame both help handle Sylveon for Absol. Additionally, Dragalge and Rotom-C are great at getting Absol in against Bronzong and Guzzlord, respectively. Absol's ability to force damage onto Fairy-types works well alongside late-game cleaners like Ninjask and Choice Scarf Passimian, with all of these options also supplying Absol with pivot support. If using Swords Dance, consider running Absol on a hyper offense dual screens team with Xatu or Espeon to provide it with safer setup opportunities.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 114198, "username": "Finchinator"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Drapion": {
    "overview": "<p>Drapion's main advantages lie in its excellent typing, letting it set up Swords Dance on common Pokemon like Sylveon, Vileplume, and Celebi while also being able to check wallbreakers like Decidueye and Silvally-Ghost. With its typing and coverage, it's also able to threaten out other popular Pokemon like Rotom-C and Dragalge. Despite being able to boost its Attack, though, it often falls short of OHKOing bulkier targets like Vaporeon, Talonflame, and Mudsdale. Faster offensive Pokemon like Starmie, Heliolisk, and Tauros also threaten it out with their powerful attacks.</p> ",
    "comments": "<h1>Other Options</h1> <p>A support set with Toxic Spikes and Whirlwind can be used to disrupt and soften up the opposing team. However, grounded Poison-types are very common and the coverage that Earthquake offers is better in most circumstances. Aqua Tail is an option over Earthquake to target bulky Ground-types like Mudsdale and Rhydon.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Drapion has difficulties getting past bulky Ground-types like Mudsdale and Rhydon without Aqua Tail, and Unaware Quagsire prevents any sweeping attempts.</p> <p><strong>Physically Bulky Pokemon: Pokemon like Diancie, Vaporeon, and Arcanine can stomach a Poison Jab while scaring off Drapion with a Moonblast, Scald, or Will-O-Wisp, respectively. However, Diancie is vulnerable to Earthquake, while Vaporeon and Arcanine don't appreciate losing their item, especially the latter.</p> <p><strong>Faster Attackers: Salazzle and Starmie take advantage of Drapion's weaker Special Defense with Fire Blast and Hydro Pump, respectively. Heliolisk and Choice Scarf Rotom-C are notable for wearing down Drapion with Volt Switch.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Earthquake hits Rock- and Poison-types like Diancie, Tyrantrum, and Dragalge. Black Sludge ensures Drapion's longevity and allows it to switch in repeatedly on resisted hits like Decidueye's Poltergeist and Salazzle's Sludge Bomb. Black Sludge also makes common Trick users like Rotom-C think twice. A Shuca Berry can be used for setting up in front of a Ground-type like Mudsdale and Rhydon.</p> <p>Grass-types like Rotom-C and Decidueye can switch into the Ground-types Drapion struggles with and threaten them out. Fighting-types like Sirfetch'd and Passimian appreciate Drapion's ability to deal with Psychic- and Ghost-types. Drapion's ability to chip away at teams with Knock Off and Poison Jab paves the way for wallbreakers like Starmie and Sirfetch'd but also clears the way for faster Pokemon like Shell Smash Blastoise and Choice Scarf Rotom-C. Vaporeon is a great partner for Drapion, dealing with opposing Ground-types like Mudsdale and Rhydon while supporting it with Wish and Heal Bell. Mudsdale can tackle opposing Poison-types like Salazzle and Dragalge while supporting Drapion with Stealth Rock.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Rabia"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 298730, "username": "poh"}]}
  },
  "Toxicroak": {
    "overview": "<p>Dry Skin and Poison typing make Toxicroak the tier's premier offensive switch-in to Vaporeon, and with Swords Dance, it can consistently set up and break through defensive cores that revolve around it. These same traits also make Toxicroak a soft check to the other Water-types in the tier, reliably checking Blastoise at full health or switching into Starmie's Hydro Pump and threatening it out with Sucker Punch. On top of that, Toxicroak only needs minimal chip damage to finish off bulkier builds or clean up against offense ones thanks to its priority Sucker Punch. Toxicroak's main problems lie in its frailty, especially when coupled with Life Orb, giving it a hard time getting onto the field and setting up safely. Even +2 Toxicroak is easily revenge killed, especially sets without Sucker Punch, with Pokemon like Talonflame and Salazzle consistently KOing it because of its poor defenses. It also has competition from the other Fighting-types in the tier in Sirfetch'd and Machamp, as both do not need to boost to wallbreak, making them more consistent.</p> ",
    "comments": "<h1>Other Options</h1> <p>Nasty Plot sets punish common Ground-type switch-ins such as Mudsdale which can be OHKOed by a +2 Focus Blast and also have the benefit of STAB Vacuum Wave, helping pick off weakened Pokemon that don't resist it, although they're a lot less effective at beating common revenge killers such as Talonflame, Salazzle, and Starmie.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Mudsdale will almost always stop a sweep, reliably tanking multiple hits in conjunction with Stamina, although sets with Low Kick can KO it. Palossand resists both of Toxicroak's STAB moves, and with Colbur Berry, it will always beat every variant of Toxicroak, even Nasty Plot. Golurk also deserves mention, as it reliably beats Earthquake variants of Toxicroak, although it folds to Sucker Punch or Knock Off.</p> <p><strong>Poison-types: Dragalge resists both of Toxicroak's STAB moves and can take advantage of it to set up Toxic Spikes or throw out strong attacks. Garbodor will force massive damage on it through Rocky Helmet and Aftermath while setting up Spikes in the process, although Earthquake variants can bait in and KO both Garbodor and Dragalge. Levitate Weezing completely walls Toxicroak and threatens it out with Will-O-Wisp, but it hates Knock Off getting rid of the little recovery it gets, and Neutralizing Gas Weezing will be 2HKOed by Earthquake.</p> <p><strong>Psychic-types: Starmie and Celebi can easily revenge kill Toxicroak, although neither can switch in reliably and Sucker Punch variants beat them after some chip damage. Indeedee-F will also always revenge kill Toxicroak thanks to Psychic Terrain blocking Sucker Punch. Levitate Bronzong can reliably wall Earthquake sets, but Knock Off or Sucker Punch will KO it at +2.</p> <p><strong>Fire-types: With Dry Skin, Toxicroak gets a slight weakness to Fire-type moves, and on top of that, Arcanine can reliably switch into it because of Intimidate. Salazzle resists its STAB attacks and easily OHKOes back, but boosted Sucker Punch can pick it off. Talonflame outspeeds and revenge kills Toxicroak with Brave Bird and can threaten a burn if it switches into Toxicroak's Fighting-type move, although it fears switching into Gunk Shot.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Drain Punch helps mitigate Life Orb recoil damage but a Swords Dance-boosted Low Kick with an Adamant nature has a chance to KO Mudsdale after Stealth Rock. Sucker Punch helps Toxicroak sweep against more offensive teams and threatens frail revenge killers such as Salazzle and Starmie, but Knock Off can cripple potential answers like Mudsdale and Talonflame for the rest of the game, while Earthquake will KO Poison-types like Dragalge and Garbodor that resist both of its STAB attacks. Adamant is the preferred nature for the extra power boost while still allowing Toxicroak to outspeed Pokemon like Tyrantrum, Blastoise, and Decidueye, but Jolly variants have the benefit of outspeeding Pokemon like Hasty Goodra and offensive Braviary.</p> <p>Toxicroak pairs best offensively with Pokemon that appreciate a consistent Vaporeon switch-in, such as Fire-types like Talonflame and Arcanine, Water-types like Blastoise and Starmie, and Glastrier, all of which reliably bait in Vaporeon for Toxicroak. On top of that, getting rid of Ground-types like Mudsdale and Palossand is key for letting Toxicroak sweep, so Grass-types like Dhelmise, Decidueye, and Rotom-C make great offensive teammates. Poison-types like Weezing, Dragalge, and Garbodor can all cause problems for Toxicroak, making Ground- and Steel-types like Golurk, Mudsdale, and Bronzong helpful partners. Defensively, Toxicroak appreciates switch-ins to Fire-types, making Rock- and Water-types like Diancie and Vaporeon fantastic partners. Toxicroak also pairs well with Ground-immune Pokemon such as Talonflame, Xatu, and Rotom-C. Steel-types such as Copperajah and Bronzong are reliable answers to Dragalge, which switches into most variants of Toxicroak, although sets running Earthquake will bait in and KO it. Steel-types also add the extra benefit of a crucial Psychic and Flying resistance, stopping Pokemon like Celebi, Starmie, and Talonflame that expect a free KO.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 298730, "username": "poh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 509790, "username": "Pokeslice"}]}
  },
  "Rotom-Mow": {
    "overview": "<p>The biggest benefit to using Rotom-C is its nearly unblockable Volt Switch. Rotom-C's Speed and STAB Leaf Storm prevent Ground-types from reliably denying it from generating momentum, and, although plenty of Pokemon take negligible damage from its attacks, they cannot prevent it from freely pivoting and bringing in terrifying wallbreakers. It's also the best Choice Scarf user in the tier, revenge killing key Pokemon like Talonflame and Starmie, still pivoting very effectively, and providing a source of entry hazard removal. Add Nasty Plot into the mix, and you've got a Pokemon with great use at every stage of the game, be it pivoting and slowly chipping away at checks early- and mid-game or cleaning teams with boosted attacks late-game. Despite all of this, there are still solid defensive stops to Rotom-C like Dragalge and Guzzlord that prevent it from easily sweeping teams and lower the impact of repeated Volt Switches. Additionally, because Rotom-C's Speed tier isn't all that impressive, aggressive double switches into faster revenge killers like Drapion and Salazzle can keep it from continuously generating momentum with Volt Switch. Choice Scarf sets also struggle with this, especially against Protect users like Vaporeon.</p> ",
    "comments": "<h1>Other Options</h1> <p>Yache Berry helps Rotom-C check Shell Smash Blastoise in a pinch but lacks much other use. Going itemless is an option for blocking Poltergeist from Golurk and Decidueye, although both commonly carry super effective coverage for Rotom-C. These two item options also let Rotom-C more effectively bluff a Choice Scarf set, potentially letting it scare out faster threats like Starmie and Talonflame. Choice Specs sets are fairly potent wallbreakers that make Volt Switch slightly more punishing to switch into and can just get by with Rotom-C's limited coverage. However, they are much less effective at ensuring Rotom-C can generate constant momentum with Volt Switch. Nasty Plot sets can use Substitute + Discharge to exploit foes like Vaporeon that can't break Substitute and cripple checks like Goodra, but Volt Switch pivoting is too good to drop.</p> <h1>Checks and Counters</h1> <p><strong>Dragon-types: Dragalge, Guzzlord, and Goodra can withstand Rotom-C's boosted attacks, take negligible damage from Volt Switch, and have ways to punish whatever Rotom-C brings in with Volt Switch, be it Dragalge's Flip Turn, Guzzlord's Knock Off, or one of Goodra's coverage attacks.</p> <p><strong>Grass-types: Grass-types like Decidueye and Vileplume have solid special bulk and typing, letting them easily wall Rotom-C. Additionally, Vileplume and Dhelmise can keep themselves healthy despite repeated Volt Switches thanks to their recovery moves, making them much harder to wear down over time.</p> <p><strong>Faster Attackers: Rotom-C's Speed still leaves it vulnerable to a plethora of faster attackers, including Talonflame, Salazzle, and Drapion, all of which can revenge kill it and potentially prevent it from using Volt Switch through aggressive play.</p> <p><strong>Special Walls: Generic special walls like Copperajah and Sylveon are bulky enough to withstand a few hits from Rotom-C, but they're much more prone to being worn down by Volt Switch.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Details</h1> <p>The combination of Trick and Defog makes Rotom-C an incredible source of utility and gives it even more room to cripple checks to it like Guzzlord, Dragalge, and Vileplume. Alternatively, Nasty Plot gives it great late-game potential. If you wish to have a more consistent attack to lock into, Thunderbolt is a good alternative that does more damage to Salazzle and can't miss versus Water-types like Starmie.</p> <p>Pokemon like Salazzle, Starmie, and Guzzlord benefit from Rotom-C crippling shared checks like Dragalge, Goodra, and Vileplume with Trick. Similarly, wallbreakers like Golurk and Swords Dance Toxicroak appreciate being safely brought in against foes like Dragalge and Decidueye that they match up well into. Golurk can also help against Copperajah, and Toxicroak easily deals with Vaporeon, which otherwise easily scouts Rotom-C with Protect. Setup Grass-types like Decidueye and opposing Rotom-C can take advantage of Rotom-C locking into Leaf Storm, so checks to them like Assault Vest Copperajah, Drapion, and Dragalge are necessary teammates.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<h1>Set Details</h1> <p>Pain Split lets Rotom-C make better use of its ability to switch into foes like Vaporeon and Mantine, and it can also be used to weaken checks like Copperajah and Guzzlord that have high HP stats. Thunderbolt can be run instead so Rotom-C has a spammable Electric-type attack after it boosts, but it's usually not necessary.</p> <p>Rotom-C needs Dragon- and Grass-types weakened or removed before it can sweep with Nasty Plot, so pair it with wallbreakers like Choice Specs Sylveon, Assault Vest Copperajah, and Toxicroak. Conversely, Rotom-C is great at repeatedly taking advantage of bulky Water-types like Vaporeon, Mantine, and Quagsire; offensive Fire- and Water-types like Salazzle, Starmie, and Blastoise appreciate this, and in return, they can help wear down bulky Dragon-types like Dragalge and Guzzlord. Rotom-C struggles with being easily revenge killed by faster threats like Flare Blitz Talonflame, Drapion, and Ninjask if it attempts to set up too early; make sure to pair it with checks like Vaporeon, Mudsdale, and Diancie.</p> "
      },
      {
        "name": "Utility",
        "description": "<h1>Set Details</h1> <p>Pain Split gives a good boost in longevity, helping Rotom-C continuously pivot and remove entry hazards throughout a battle. Alternatively, Will-O-Wisp lets Rotom-C more quickly wear down checks to it like non-Rest Guzzlord, Dragalge, and Vileplume. Offensive investment makes Rotom-C's Volt Switch more cumbersome for special walls like Copperajah and Sylveon to switch into, but opting for more bulk, especially alongside Will-O-Wisp, gives it more leeway around physical attackers like Guzzlord and Dhelmise.</p> <p>Rotom-C commonly draws in Dragon- and Grass-types, so wallbreakers like Glastrier and Assault Vest Copperajah work well here; in addition, they appreciate Rotom-C safely bringing them in with Volt Switch, since their low Speed often leaves them vulnerable to taking hits first from the foe. Since Rotom-C is one of NU's most consistent pivots, it pairs well with other pivots like Talonflame, Dragalge, and Passimian. Talonflame also switches into Sirfetch'd's First Impression and U-turns from foes like Ninjask, and it can bring Rotom-C in against Diancie. Rotom-C is poor at keeping Stealth Rock off the field against Copperajah; strong physical wallbreakers like Sirfetch'd, Golurk, and Guzzlord help mitigate this issue.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 114198, "username": "Finchinator"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Gigalith": {"sets": [{"name": "Specially Defensive"}]},
  "Scrafty": {
    "overview": "<p>Scrafty is a unique Pokemon that provides multiple valuable qualities to its team: Knock Off can remove items to soften up opposing teams early-game, Shed Skin makes it one of the best status absorbers in the tier, Bulk Up and Rest let it act as a late-game sweeper, and its great Special Defense and few weaknesses let it stand up to threatening wallbreakers such as Starmie and Expert Belt Goodra. However, Scrafty is completely countered by defensive Sylveon, which makes it deadweight in that fairly common matchup. Additionally, it can be a sitting duck for the tier's many threatening Fighting-types and requires a lot of team support to make up for the switch-in opportunities it often gives Sirfetch'd, Toxicroak, and Machamp. It also struggles with other defensive staples such as Mantine and Vileplume and is generally slow to make progress.</p> ",
    "comments": "<h1>Other Options</h1> <p>Throat Chop is a niche option to defeat defensive Hyper Voice Sylveon; however, Scrafty sacrifices tons of utility by dropping Knock Off, and many Sylveons run Moonblast to bypass this. A Dragon Dance set with Knock Off, Close Combat, and Iron Head seems appealing at first glance, but Scrafty's low speed leaves it outsped by Talonflame, Salazzle, and every Choice Scarf user even after a boost; faster Choice Scarf users like Heliolisk can outspeed it even after two Speed boosts.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Sylveon's access to recovery makes it a very reliable answer that can wall Scrafty all game long. Diancie is neutral to Fighting and lacks recovery, making it less effective, but it still forces Scrafty out with the threat of a faster Moonblast. More niche Fairy-types like Comfey and Ribombee can shut Scrafty down just as effectively.</p> <p><strong>Fighting-types: Toxicroak, Sirfetch'd, and Passimian can switch into both of Scrafty's STAB attacks and force it out with their powerful Fighting-type attacks even if Scrafty has a Defense boost or two. However, they generally lack recovery, which can allow Scrafty to outlast them, particularly if it has Spikes support.</p> <p><strong>Flying-types: Mantine's Hurricane never 2HKOes, but it takes little damage from Scrafty's attacks and is faster, making it favored in that matchup. Defensive variants of Talonflame struggle against Scrafty due to Bulk Up, but offensive Talonflame and Braviary can threaten it even after a boost, while Taunt can also allow defensive Talonflame to emerge victorious.</p> <p><strong>Trick: Although they cannot switch directly into it, Trick users such as Choice Scarf Rotom-Mow can cripple Scrafty and prevent it from sweeping in most situations.</p> ",
    "sets": [
      {
        "name": "Defensive Bulk Up",
        "description": "<h1>Set Details</h1> <p>Bulk Up makes Scrafty quite bulky, letting it avoid the 2HKO from defensive Talonflame's Brave Bird after just one boost. Drain Punch has no drawbacks unlike other options like Close Combat and helps it stay healthy to check threats like Drapion, Guzzlord, and Goodra. Rest restores Scrafty's HP to full and has good synergy with Shed Skin; this can prevent opposing wallbreakers from safely entering the field to threaten Scrafty on an anticipated use of Rest. 92 Speed EVs let Scrafty outspeed Jolly Copperajah and Glastrier and help it take on Vaporeon.</p> <p>Garbodor is an excellent partner for Scrafty; it can force out Sylveon, check Fighting-types, and set up Spikes and Toxic Spikes to weaken the opposing team. In return, Scrafty can remove Heavy-Duty Boots to make Garbodor's hazards more effective and threatens some of Garbodor's most common switch-ins, Bronzong and Xatu. Other Fighting-type checks such as Talonflame, Sylveon, and Xatu are helpful to handle Sirfetch'd and Passimian, and Copperajah and Escavalier can switch into Sylveon and other Fairy-types. Stealth Rock setters that can beat common forms of hazard removal, such as Diancie and Copperajah with a Rock-type attack, can make Scrafty's Knock Off more punishing by keeping hazards on the field. Diancie also switches into Talonflame and can cure status from Rest if Shed Skin fails. Finally, Fairy-type lures such as Iron Tail Goodra and Heavy Slam Guzzlord can pave the way for Scrafty to sweep late-game, though make sure to cover their shared Fairy-type weakness with teammates like Bronzong and Vileplume.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 202058, "username": "Expulso"}]}
  },
  "Garbodor": {
    "overview": "<p>In a tier otherwise devoid of viable Spikers, Garbodor stands out as the best option for teams that desire Spikes support. It's decent enough at finding chances to set Spikes against common foes like Sylveon, Toxicroak, and defensive Guzzlord and is blessed with access to Corrosive Gas, which lets it remove opposing Heavy-Duty Boots and force foes to take extra entry hazard damage in addition to crippling other item-reliant foes. Garbodor can also check Sirfetch'd thanks to its good bulk, defensive typing, and ability Aftermath, which lets it trade KOs with Sirfetch'd in a pinch. Sadly, Garbodor's stats make it hard to keep up with wallbreakers like Copperajah, Tyrantrum, and Choice Band Guzzlord, whose STAB attacks it doesn't resist, and because of how prominent Spikes-immune entry hazard removers like Xatu, Rotom-C, and Talonflame are, its usefulness can often be minimal outside of disrupting teams with item removal or poison spreading. Additionally, it's very difficult to justify using Garbodor over other Fighting-resistant Pokemon and bulky Poison-types like Xatu, Talonflame, Dragalge, and Vileplume on teams that don't need Spikes support, which limits how easy it is to slot on teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Toxic Spikes can be useful in certain matchups, but the ubiquity of grounded Poison-types in addition to entry hazard removers that are immune to them heavily limits their overall usefulness. Drain Punch gives Garbodor even more longevity and still hits Copperajah and Tyrantrum for decent damage, although its overall coverage is inferior to Stomping Tantrum. Offensive sets can more easily bypass Xatu to force Spikes up but offer much less to teams overall.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types and Ground-type Moves: Although Garbodor can cripple them by removing their item or poisoning them, Ground-types like Mudsdale and Golurk still switch into it relatively freely and threaten with Earthquake. Similarly, physical attackers that commonly carry Earthquake like Aerodactyl, Drapion, and Toxicroak can easily bypass Garbodor too.</p> <p><strong>Xatu: Garbodor's damage output isn't significant enough to threaten Xatu unless it poisons Xatu with Gunk Shot. Otherwise, Xatu can freely switch into it and bounce back Spikes.</p> <p><strong>Powerful Wallbreakers</strong>: Even when invested in, Garbodor's bulk isn't great enough to stand in the face of foes like Copperajah, Choice Band Tyrantrum, and Dragalge. Even Fighting-types like Choice Band Sirfetch'd and Guts Machamp can brute force their way through Garbodor; it can only hope to trade KOs with them.</p> <p><strong>Special Attackers: Garbodor's lackluster special bulk when uninvested leaves it quickly overwhelmed by Pokemon like Heliolisk, Starmie, and Dragalge. Scalds from bulky Water-types like Vaporeon and Mantine are hard to deal with too because of the chance to inflict a burn.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<h1>Set Details</h1> <p>Although setting Spikes is always fine when predicting a check to switch in, Garbodor's other moves can also significantly damage a switch-in. Stomping Tantrum does good damage to Copperajah, Dragalge, and Tyrantrum and lets Garbodor effectively answer Toxicroak; alternatively, Toxic is great to cripple Ground-types such as Mudsdale and Golurk. Pain Split helps Garbodor stick around longer to check threats like Sirfetch'd, but Corrosive Gas is useful for crippling item-reliant foes like Mudsdale and Escavalier. The EVs allow Garbodor to outrun Adamant Sirfetch'd and give it as much physical bulk as possible.</p> <p>Garbodor pairs best with wallbreakers like Tauros, Starmie, and Sirfetch'd that excel at forcing switches, helping get the most out of its Spikes. The former two as well as other cleaners like Silvally-Ghost greatly appreciate Spikes weakening their switch-ins and making it easier for them to sweep late-game. Garbodor appreciates insurance against Ground-types like Golurk and Mudsdale, so pair it with Water- and Grass-types like Blastoise, Rotom-C, and Dhelmise, the latter of which can also provide entry hazard control that preserves Garbodor's Spikes. Special walls like Copperajah and Guzzlord make good defensive cores with Garbodor, giving it insurance against foes like Choice Specs Sylveon and Starmie, respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Zoroark": {
    "overview": "<p>Zoroark's unique ability in Illusion allows it to potentially catch its checks and counters off guard. With Choice Scarf equipped, it's able to outspeed fast Pokemon like Starmie, Salazzle, and Choice Scarf Rotom-C, and, without Choice Scarf, it still outspeeds Pokemon like Flygon and Celebi. Zoroark is also very versatile; it can go physical and make great use of its utility movepool, or it can run a Nasty Plot set to take advantage of its high Special Attack and decent coverage moves. Unfortunately, Illusion can reveal Zoroark to the opponent via chip damage taken, such as through entry hazards if it's not running Heavy-Duty Boots. Zoroark is also vulnerable to many foes due to its poor bulk, like Fairy- and Fighting-types like Sylveon and Machamp, First Impression Pokemon like Sirfetch'd and Flygon, and faster Pokemon like Ninjask and Choice Scarf Passimian. Other fast Pokemon like Aerodactyl and Tauros can threaten it without its Choice Scarf.</p> ",
    "comments": "<h1>Other Options</h1> <p>Zoroark can use a Swords Dance set with Heavy-Duty Boots, but it lacks the coverage to break through Fairy- and Fighting-types like Sylveon and Machamp.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Fairy-types like Sylveon, Comfey, and Diancie can OHKO Zoroark with their respective STAB attacks. Diancie can notably survive against all Zoroark variants and KO it with Body Press and Moonblast.</p> <p><strong>Revenge Killers: Faster offensive Pokemon like Ninjask and Choice Scarf Passimian outpace Nasty Plot Zoroark and easily OHKO it, and neither is threatened by Choice Scarf variants. Additionally, First Impression Sirfetch'd can easily revenge kill Zoroark.</p> <p><strong>Bulky Pokemon: Pokemon like Goodra and Guzzlord are extremely bulky, letting them tank Zoroark's attacks. Drapion and Guzzlord resist Zoroark's STAB moves, making them harder to revenge kill.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Details</h1> <p>Trick is useful for crippling defensive Pokemon like Sylveon, Vaporeon, and Diancie. Sucker Punch lets Zoroark still revenge kill faster threats like Choice Scarf Flygon, Salazzle, and Tauros after it has used Trick. U-turn gives momentum, and it's needed to pivot out of Fairy- and Fighting-type threats like Diancie and Machamp. Using Choice Scarf allows Zoroark to surprise KO faster Pokemon like Choice Scarf Rotom-C and Flygon.</p> <p>Psychic-, Fairy-, and Poison-types like Xatu, Sylveon, and Weezing are appreciated as teammates to take hits from Fighting-types like Sirfetch'd and Passimian. Pokemon like Copperajah, Mudsdale, and Tyrantrum can help Zoroark deal with faster foes like Ninjask and, once Zoroark loses its Choice Scarf, Talonflame. Zoroark can disguise as teammates that are weak to Psychic-type attacks like Dragalge, Sirfetch'd, and Machamp to bait and get rid of Pokemon like Starmie and Celebi. Fire-, Ground-, and Fighting-types such as Talonflame, Flygon, and Passimian can take care of Steel-types like Copperajah and Escavalier.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<h1>Set Details</h1> <p>Flamethrower is used to hit Dark- and Fighting-types that resist Dark Pulse like Drapion and Machamp and 2HKO Copperajah. Sludge Bomb 2HKOes Fairy-types like Sylveon and Comfey and is Zoroark's best form of damage against Diancie. Heavy-Duty Boots is optimal so entry hazards don't negate Illusion, but Life Orb can be used for the extra power, with Zoroark potentially 3HKOing Sylveon with unboosted Sludge Bomb and 2HKOing defensive Flygon.</p> <p>Support teammates like Aerodactyl and Xatu are appreciated on hyper offensive teams. Aerodactyl sets Stealth Rock to make it easier for Zoroark to KO Pokemon, and Xatu set dual screens to give Zoroark safer opportunities to set up Nasty Plot and sweep. Zoroark should be used alongside Pokemon that can effectively take Fighting-type attacks such as Mudsdale, Sylveon, and Vileplume as well as Fairy-type attacks like Copperajah, Escavalier, and Salazzle. Poison- and Fighting-types like Dragalge and Sirfetch'd let Zoroark play mind games on Psychic-types like Xatu and Celebi with Illusion.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 211471, "username": "shiloh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 481576, "username": "roxiee"}]}
  },
  "Vanilluxe": {"sets": [{"name": "Choice Specs"}]},
  "Escavalier": {
    "overview": "<p>Escavalier offers a useful blend of offensive and defensive traits that makes it an excellent answer to common foes like Dragalge and Diancie. Its Swords Dance sets are potent wallbreakers that can easily dispatch physical walls like Vileplume, Mudsdale, and Bronzong, whereas its specially defensive set provides teams with a sturdy answer to special attackers such as Starmie, Kingdra, and Choice Specs Decidueye. Additionally, Escavalier is fantastic at luring in and crippling defensive staples like Talonflame, Arcanine, and Mantine with Knock Off, which makes them much easier to overwhelm throughout a battle. In spite of this, however, Escavalier itself struggles to successfully deal with its counterplay on its own; it can't outduel defensive Fire-types, and bulky Water-types like Mantine and Vaporeon can force it out with the threat of a Scald burn. Additionally, Escavalier is vulnerable to being lured in and heavily damaged or OHKOed by Pokemon like Sylveon, Exploud, and Goodra that it otherwise is a solid answer to. Escavalier's also very reliant on its item for recovery, which makes item removal from the likes of Vileplume and Guzzlord problematic. Lastly, Escavalier's poor Speed makes it easy for faster foes like Salazzle and Sirfetch'd to dispatch.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Band turns Escavalier into an extremely potent wallbreaker with minimal defensive counterplay, although this set is very prediction reliant and can struggle to reliably get by bulky Fire-types like Talonflame and Arcanine. RestTalk gives Escavalier improved longevity, helps if Escavalier loses its Leftovers to Vileplume's Corrosive Gas, and can remove burn inflicted by Talonflame's Flame Body and Rotom-C's Will-O-Wisp. Heavy-Duty Boots is an especially good item on such sets, making Escavalier much harder to wear down through entry hazard damage.</p> <h1>Checks and Counters</h1> <p><strong>Fire-types and Fire-type Coverage: Arcanine and Talonflame are consistent switch-ins to Escavalier thanks to their bulk and abilities, although Knock Off is bothersome for them both. Salazzle is a poor switch-in, but it easily OHKOes Escavalier with Flamethrower. Other Pokemon with Fire-type coverage like Sylveon and Goodra are problematic too, especially since Escavalier frequently switches into them.</p> <p><strong>Bulky Water-types: Mantine and Vaporeon can switch into an unboosted Escavalier with relative ease and threaten it with a Scald burn. However, if they fail at inflicting a burn, Escavalier can muscle past them with its boosted attacks. Bulky Escavalier sets can also hamper the longevity of such Water-types with Toxic.</p> <p><strong>Physical Wallbreakers: Despite Escavalier's physical bulk being passable, powerful attackers like Choice Band Tyrantrum, Sirfetch'd, and Golurk can still muscle past it, the former not even needing prior chip damage to do so.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Close Combat provides necessary coverage for Copperajah and opposing Escavalier, while Knock Off prevents Fire-types like Talonflame, Salazzle, and Arcanine from freely switching into Escavalier. The listed EV spread allows Escavalier to outpace Dhelmise, but other spreads are possible too. For example, Escavalier can also opt for much bulkier spreads so it can better take attacks like Dragalge's Draco Meteor and Rotom-C's Thunderbolt.</p> <p>Escavalier appreciates the removal of Fire-types like Salazzle, Talonflame, and Arcanine so it can more freely wallbreak; teammates like Dragalge, Mantine, and Guzzlord are effective here. Late-game cleaners like Dragon Dance Tyrantrum and Swords Dance Decidueye benefit from Escavalier shredding opposing defensive cores and weakening physical walls like Mudsdale and Vileplume. In return, the former two help pressure Fire-types, whereas the latter can deal with Water-types. Pokemon such as Ninjask and Goodra appreciate Escavalier's ability to handle Fairy-types; in return, Ninjask can bring Escavalier in against such foes with U-turn, while Goodra can help pressure physical walls.</p> "
      },
      {
        "name": "Specially Defensive",
        "description": "<h1>Set Details</h1> <p>The combination of Knock Off and Toxic makes it difficult for Pokemon like Talonflame, Mantine, and Arcanine to take advantage of Escavalier. Protect complements this move combination well, letting Escavalier poison stall foes and scout powerful Choice item attackers like Tyrantrum, Sirfetch'd, and Guzzlord. Swords Dance instead of Toxic is also viable so that Escavalier can take advantage of passive foes like Vileplume and Xatu.</p> <p>Escavalier is very effective at luring in and crippling bulky Water-types like Mantine and Vaporeon with Toxic; this makes Pokemon like Starmie, Salazzle, and Blastoise effective teammates. In return, Starmie and Blastoise can easily get rid of Fire-types, while Salazzle can work alongside Escavalier to bypass said foes. Despite Escavalier not being helpless against opposing Fire-types, it still appreciates teammates like Dragalge, Vaporeon, and Diancie that can directly deal with them. Dragalge and optionally, Vaporeon, can also bring Escavalier in against Fairy-types. Escavalier also benefits from physically defensive teammates such as Sylveon and Mudsdale to take on powerful physical attackers. Cleric support from teammates like Sylveon and Vaporeon is helpful so Escavalier doesn't have to worry as much about burns; these two can also supply Wish support for it, greatly boosting its longevity.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 241380, "username": "Abejas"}, {"user_id": 298730, "username": "poh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Beartic": {"sets": [{"name": "Hail Sweeper"}]},
  "Stunfisk-Galar": {
    "sets": [
      {
        "name": "Defensive Stealth Rock",
        "description": "<p>Galarian Stunfisk functions as a great Stealth Rock user in NU. Its great HP stat paired up with its decent defensive stats and incredible typing makes it a great check to common threats such as Togedemaru, Rotom-F, and Rotom. Yawn lets Galarian Stunfisk pressure Pokemon that would like to switch in such as Eldegoss, Wishiwashi, and Piloswine, forcing them to switch out again or to sleep. Stone Edge hits common Defoggers such as Rotom-S and Rotom-F hard. Snap Trap is an alternative to Stone Edge; when paired with Yawn, it can force a foe to sleep or, when used alongside Protect, can be used to rack up chip damage. It also lets Galarian Stunfisk severely cripple Rotom-S, as it's unable to do anything once trapped. Thunder Wave can be used over Yawn to cripple setup sweepers such as Alcremie and Cofagrigus. An alternative EV spread of 252 HP / 64 Atk / 192 SpD can be used to OHKO Toxicroak with Earthquake after Life Orb recoil.</p> <p>Galarian Stunfisk usually belongs on non-offensive teams because they most appreciate its blend of utility and defensive presence. Galarian Stunfisk's passivity invites in the other predominant Stealth Rock users in Piloswine and Sandaconda, so Water-types such as Wishiwashi and Silvally-Water are great partners, being able to take these Ground-types out while also checking Fire-type Pokemon like Silvally-Fire and Rapidash. Grass-types such as Eldegoss and Abomasnow can also pressure these Ground-types and are able to switch into Water-type attacks directed at Galarian Stunfisk. Poison-type Pokemon like Garbodor and Toxicroak can check Fighting-type Pokemon such as opposing Toxicroak and Sawk while appreciating Galarian Stunfisk's ability to take out opposing Poison-type Pokemon. They also punish the most common spinner Eldegoss, a Pokemon that fully counters Galarian Stunfisk. Fairy-type Pokemon such as Alcremie and Clefairy also check Fighting-type Pokemon, with Clefairy also absorbing status from moves like Will-O-Wisp and being able to pass Wishes to Galarian Stunfisk.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 241380, "username": "Abejas"}]}
  },
  "Golurk": {
    "overview": "<p>Golurk's combination of Poltergeist and Earthquake is difficult for the tier's defensive staples to handle, easily breaking through common defensive cores like Mantine + Copperajah and Sylveon + Bronzong. This is supplemented by Golurk's good overall coverage, which gives it some flexibility in terms of dealing with potential checks. However, while Golurk's bulk is by no means terrible, its typing burdens it with unfortunate weaknesses to common Dark-, Grass-, and Water-type attacks, and this is further compounded by its mediocre Speed, which often leads to Golurk struggling against faster teams. To make matters worse, Pokemon like Vileplume and Dhelmise can viably run no item, which nullifies Poltergeist and makes wallbreaking with Golurk much trickier. These factors mean that Golurk faces competition from other wallbreakers like Sirfetch'd and Life Orb Starmie, which, while not reaching Golurk's level of immediate raw power, have better Speed tiers and offer more utility.</p> ",
    "comments": "<h1>Other Options</h1> <p>An offensive Stealth Rock set with Colbur Berry could be used to capitalize on the switches Golurk forces, but Golurk is usually outclassed in this role by Copperajah, which has a better typing and offers much more to a team defensively. Stone Edge hits Braviary hard but lacks any real use outside of this. Golurk can also use Klutz with a Choice Scarf to cripple defensive foes like itemless Vileplume and Bronzong, making them much easier to deal with long-term.</p> <h1>Checks and Counters</h1> <p><strong>Itemless Pokemon: Pokemon like Vileplume and Dhelmise that can afford to run no item are a big pain for Golurk, as they make Poltergeist much harder to effectively use. That said, Golurk can beat these Pokemon with proper prediction, making them shaky answers to it.</p> <p><strong>Water-types: Though they cannot switch into Golurk, offensive Water-types like Starmie and Inteleon threaten it out with their STAB attacks. On the defensive side, Mantine sports an immunity to Earthquake and can capitalize on Golurk being locked into it, though Mantine doesn't appreciate taking a Poltergeist.</p> <p><strong>Grass-types: Rotom-C, Decidueye, and Vileplume can KO Golurk fairly easily and potentially ignore Poltergeist in Vileplume's case, but none of them can take Heat Crash well.</p> <p><strong>Faster Attackers: In general, offensive threats that outspeed Golurk like Drapion, Zoroark, and Goodra can KO or revenge kill it with relative ease, as it lacks the Speed or bulk to contest them. Other attackers like Passimian and Sirfetch'd can also threaten with Knock Off, which decimates Golurk or cripples its teammate.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Details</h1> <p>Heat Crash offers good neutral coverage alongside Golurk's STAB moves and is fairly safe to throw out against targets like Vileplume. Darkest Lariat is mostly used to hit itemless Dhelmise, which shrugs off Golurk's STAB moves and take a pittance from Heat Crash. Shadow Punch can be run over Darkest Lariat with Iron Fist as the ability so Golurk always has a reliable Ghost-type attack, but losing No Guard makes Poltergeist's shaky accuracy a problem.</p> <p>As Golurk has a hard time getting onto the field, pivots like Arcanine, Passimian, and Rotom-C are helpful to give it safe entry. In return, these pivots appreciate Golurk dispatching bulky Pokemon like Dragalge for them. Water- and Grass-type checks such as Dragalge, Escavalier, and Goodra can shore up Golurk's defensive shortcomings and give it more breathing room against threats like Rotom-C and Starmie. On a similar note, Dark-type answers like Comfey and Sylveon can alleviate Golurk's weakness to Knock Off, with both also drawing in Steel-types for Golurk to take advantage of. Lastly, late-game sweepers like Nasty Plot Salazzle and Shell Smash Blastoise can utilize the holes Golurk punches in the opposing team's defensive cores to clean.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 231074, "username": "Ho3nConfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 483285, "username": "SpacialRendevous"}, {"user_id": 336073, "username": "Rabia"}]}
  },
  "Braviary": {"sets": [{"name": "Offensive"}]},
  "Talonflame": {
    "overview": "<p>Talonflame's role in NU focuses on being a Defogger, pivot, and defensive check to Fighting-type threats like Passimian and Sirfetch'd. Additionally, using Flame Body, it can fish for a burn by switching into these threats, including common U-turn users like Flygon. Its Speed tier is also its best friend, allowing it to naturally outspeed most of the tier and revenge kill fast threats like Salazzle and Inteleon. Sadly, since Water-types like Vaporeon and Blastoise are common, it can be tough for Talonflame to do its job. Also, while it wants to check the aforementioned Fighting-types, Talonflame cannot do this reliably, since they can remove its Heavy-Duty Boots with Knock Off, thus making it more susceptible to Stealth Rock. Additionally, it's not a strong attacker and as a result can struggle to revenge kill at times.</p> ",
    "comments": "<h1>Other Options</h1> <p>Swords Dance can work on a viable setup set for sweeping. However, this requires a turn of setup, and given Talonflame's less-than-decent Attack stat, it is still not hitting as hard as it would like. Flamethrower can be used over Brave Bird to better check Steel-types like Copperajah and Escavalier. Unfortunately, while Flamethrower does hit them hard, it removes Talonflame's best way to damage the Fighting-types it's supposed to be checking. Taunt is also a viable option to shut down foes like defensive Arcanine, Sylveon, and Comfey. It is generally not encouraged, however, due to the fact that it's not always effective and Talonflame can get severely hurt as a result.</p> <h1>Checks and Counters</h1> <p><strong>Water-types: Vaporeon, Blastoise, and Mantine force out Talonflame with Water-type attacks and then recover health or set up. They are all U-turn bait and dislike getting Toxic poisoned, however.</p> <p><strong>Rock-types: Threats like Tyrantrum, Aerodactyl, and Diancie easily switch into Talonflame and force it out. They all fear Will-O-Wisp, though.</p> <p><strong>Choice Scarf Users: Passimian, Rotom-C, and Heliolisk are just a couple of Choice Scarf users that outspeed Talonflame and OHKO it.</p> <p><strong>Knock Off: Common Knock Off users like Drapion, Escavalier, and Sirfetch'd commonly draw in Talonflame and can remove its Heavy-Duty Boots and make its role tougher. They all need to be careful of a Flame Body burn, however.</p> ",
    "sets": [
      {
        "name": "Defensive Utility",
        "description": "<h1>Set Details</h1> <p>The choice between STAB attacks and status moves isn't too important, but you should almost always pair Brave Bird with Will-O-Wisp and Flare Blitz with Toxic; this ensures Talonflame retains a good matchup into Steel-types like Copperajah and Bronzong. U-turn is great because Talonflame's high Speed lets it force out several common foes like Sirfetch'd and Decidueye, giving it many turns to pivot and gain momentum. However, Defog can be considered if you need Talonflame to have it. Flame Body is the preferred ability because Talonflame is good at fishing for burns by switching into moves like Passimian's U-turn and Copperajah's Heavy Slam. The EV spread with a Jolly nature maximizes Talonflame's bulk while being able to outspeed Inteleon and Salazzle.</p> <p>Teammates like Copperajah and Guzzlord, which Fighting-types feast on, can retreat into Talonflame and serve as Flame Body lures. Water-types that run amuck like Vaporeon, Blastoise, and Mantine all switch into Talonflame with little-to-no issue, save for Toxic. Therefore, teammates like Vileplume, Dragalge, and Rotom-C are appreciated to take pressure off of Talonflame. These Pokemon also check Electric-types like Heliolisk and Choice Scarf Rotom-C. Similarly, Rock-types like Aerodactyl and Diancie either outspeed Talonflame or don't mind coming in on any of its moves. Mudsdale can eat up any hit they throw at them and can also switch in on Choice Scarf users like Tyrantrum and Passimian, since Head Smash and Rock Slide, respectively, take out Talonflame with ease.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 241380, "username": "Abejas"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}]}
  },
  "Dragalge": {
    "overview": "<p>Dragalge is both a great support Pokemon and a potent wallbreaker in NU. Its defensive typing lets it easily switch into foes like Vileplume, Arcanine, and Rotom-C, generating free turns for it to throw off powerful Draco Meteors or simply pivot with Flip Turn. Furthermore, because Dragalge is so great at drawing in Steel-types, it has fantastic synergy with common wallbreakers like Sirfetch'd and Golurk that love free opportunities to switch in against such foes. Despite being a task to defensively answer, though, Dragalge is left vulnerable to faster foes like Golurk, Tyrantrum, and Starmie due to its poor Speed. Additionally, its reliance on Black Sludge for recovery and subpar physical bulk make it a poor answer to Fighting-types like Toxicroak and Sirfetch'd despite its resistances to Gunk Shot and Close Combat.</p> ",
    "comments": "<h1>Other Options</h1> <p>Toxic Spikes can be used instead of a fourth attacking move to punish teams lacking a grounded Poison-type. Choice Specs sets pack immense power but lack the longevity a typical utility set provides. Protect in tandem with Black Sludge bolsters Dragalge's passive recovery and helps it scout faster Choice item users like Sirfetch'd, Rotom-C, and Tyrantrum. RestTalk sets worry less about losing their item to Vileplume's Corrosive Gas, greatly boosting Dragalge's longevity at the cost of team utility.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Steel-types like Copperajah, Bronzong, and Escavalier are the most consistent defensive answers to Dragalge, and they aren't even affected by Toxic Spikes. However, they must be mindful of their HP because they lack reliable recovery, and they easily cede momentum to Dragalge if it uses Flip Turn as they switch in.</p> <p><strong>Special Walls: Mantine is capable of stomaching a Draco Meteor and recovering off the damage with Roost, while Diancie walls all of its moves and can freely set Stealth Rock. Quagsire also walls Dragalge and blocks Flip Turn with its Water Absorb.</p> <p><strong>Psychic-types: Starmie and Celebi are all faster than Dragalge and can easily revenge kill it with their STAB Psychic-type attacks.</p> <p><strong>Revenge Killers: Faster Dragon-types like Tyrantrum, Choice Band Guzzlord, Kingdra, and Goodra can easily revenge kill Dragalge with minimal or no chip damage necessary. Wallbreakers like Golurk, Glastrier, and Exploud also break through Dragalge.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<h1>Set Details</h1> <p>Flip Turn lets Dragalge keep up momentum against Steel-types that switch into it. Scald threatens Steel-types such as Copperajah, Bronzong, and Escavalier with a burn, but Focus Blast is a workable alternative that nets more immediate damage onto Copperajah. Heavy-Duty Boots lets Dragalge pivot more freely without worry of repeated entry hazard damage. Alternatively, Black Sludge helps Dragalge repeatedly switch into weak, resisted attacks from the likes of Vileplume and Talonflame, although the immunity to hazard damage is usually preferred. The listed Speed EVs allow Dragalge to outspeed uninvested Sylveon.</p> <p>Since Dragalge commonly draws in Steel-types like Copperajah and Bronzong, it pairs great with Fighting- and Ground-types like Sirfetch'd, Golurk, and Passimian that appreciate being brought in against such foes via Flip Turn. In a similar vein, Dragalge's strong Draco Meteor can force significant damage onto Steel-types over the course of a battle; teammates like Ninjask and Nasty Plot Celebi benefit from this. Rotom-C is very problematic for Water-types like Vaporeon; Dragalge can easily wall it and is a solid Trick deterrent when running Black Sludge. Offensive Ground-types can easily KO Dragalge, so teammates like Rotom-C and Decidueye are ideal. Sylveon complements Dragalge well, offering Wish support and forming a good defensive core capable of taking on Fighting-types. Similarly, Steel-types like Bronzong, Copperajah, and Escavalier are good defensive teammates; the former covers all of Dragalge's weaknesses, while the latter two threaten opposing Psychic- and Steel-types. In return, Dragalge checks Fire-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 298730, "username": "poh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Heliolisk": {
    "overview": "<p>Heliolisk is a prominent special attacker because of its great Special Attack and Speed and useful immunities to Water and Ghost, which let it take on common Water-types like Vaporeon, Mantine, Starmie, and Shell Smash Blastoise and pivot into Choice-locked Ghost-types like Golurk and Decidueye. Heliolisk can also run multiple sets, like Choice Specs to break through Electric-resistant Pokemon like Celebi and Guzzlord and Choice Scarf to outspeed Salazzle, +2 Modest Blastoise, and Choice Scarf Passimian. Its coverage from Hyper Voice, Surf, and Grass Knot also gives many ways to target checks like Mudsdale, Rhydon, and Decidueye. However, its poor defenses can leave it revenge killed by physical attackers and priority users like Sirfetch'd, Toxicroak, and Absol, and other fast Pokemon like Choice Scarf Rotom-C, Tauros, and Salazzle can outspeed it if it does not run Choice Scarf. Furthermore, Heliolisk faces competition with Rotom-C as an Electric-type because of its ability to check Ground-types with STAB Leaf Storm and Levitate.</p> ",
    "comments": "<h1>Other Options</h1> <p>Focus Blast can be used to hit Copperajah and Guzzlord, but this causes Heliolisk to be walled by Golurk, Dhelmise, and Decidueye. U-turn is an alternative over Volt Switch on its Choice Scarf set to not lose momentum against Ground-types while also slightly chipping Grass-types.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Ground-types like Golurk, Rhydon, and Mudsdale can OHKO Heliolisk with Earthquake. However, Golurk and Mudsdale have to be wary of Surf and Grass Knot.</p> <p><strong>Grass-types: Decidueye, Dhelmise, and Rotom-C resist Heliolisk's Electric-type STAB moves; additionally, the former three can recover on Heliolisk with Recover, Roost, and Synthesis.</p> <p><strong>Dragon-types: Dragon-types like Dragalge, Guzzlord, and Goodra are extremely bulky, letting them tank Heliolisk's attacks.</p> <p><strong>Revenge Killers: Faster Pokemon like Choice Scarf Passimian, Tauros, and Starmie can outspeed and revenge kill Choice Specs Heliolisk. Priority users like Sirfetch'd, Toxicroak, and Absol can also revenge kill Heliolisk after chip damage.</p> <p><strong>Residual Damage: Without Heavy-Duty Boots, Heliolisk is worn down tremendously by entry hazards, and it's vulnerable to Toxic poison from bulky Water-types like Mantine and Vaporeon.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<h1>Set Details</h1> <p>Dark Pulse hits Celebi and Ghost-types that are resistant or immune to Heliolisk's STAB options like Decidueye, Golurk, and Dhelmise. Alternatively, Grass Knot KOes Ground-types like Mudsdale, Rhydon, and Golurk. Choice Specs helps Heliolisk take on Electric-resistant Pokemon like Dragalge and Decidueye and gives it an easier time getting past defensive Pokemon like Goodra and Diancie, while Heavy-Duty Boots is an alternative for fewer prediction-reliant plays.</p> <p>Heliolisk should be paired with Pokemon immune to Ground like Xatu, Talonflame, and Mantine to switch into Ground-types like Mudsdale. Xatu and Talonflame can also form a VoltTurn core with it to bring it in safely due to its poor defenses. Drapion and Braviary make great partners to check Grass-types like Decidueye and Dhelmise. Entry hazard support from the likes of Copperajah, Diancie, Garbodor, and Dragalge also wears down foes. Furthermore, the former three Pokemon check Dragon-type threats like Dragalge and Goodra for Heliolisk.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Details</h1> <p>Grass Knot provides necessary coverage for Ground-types like Mudsdale, but Dark Pulse is useful if being walled by Decidueye and Dhelmise is undesirable.</p> <p>Choice Scarf Heliolisk is usually used on teams that need extra support against offensive Water-types like Shell Smash Blastoise and Life Orb Starmie. Pokemon that are immune to Ground like Rotom-C and Xatu are appreciated to check Pokemon like Mudsdale and Rhydon. Dragalge, Talonflame, and Xatu form a pivot core with Heliolisk and provide it with opportunities to come in safely. Dark-types like Guzzlord, Drapion, and Scrafty provide utility with Knock Off and check Grass-types like Decidueye and Dhelmise. Powerful physical attackers like Sirfetch'd, Golurk, and Escavlier make great teammates to take care of specially defensive Pokemon like Copperajah and Dragalge. Entry hazard support from the likes of Copperajah, Garbodor, and Diancie also helps to wear down foes and give Heliolisk an easier time cleaning late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 114198, "username": "Finchinator"}, {"user_id": 435989, "username": "Mariannabelle"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 481576, "username": "roxiee"}]}
  },
  "Tyrantrum": {
    "overview": "<p>With access to a STAB recoil-free Head Smash and useful coverage options, Tyrantrum is one of NU's premier wallbreakers, threatening immense damage whenever it safely gets onto the field. Because of this, Tyrantrum loves the plethora of pivoting options in the tier to reliably bring it in, and, when coupled with its good Speed tier for a wallbreaker, teams rarely have a consistent defensive answer. Tyrantrum also has Scale Shot, allowing sweeper sets to outspeed more offensive teams and revenge killers. Tyrantrum's main drawback offensively lies in its reliance on Head Smash, making Tyrantrum predictable for teams to switch into with a defensive Steel- or Ground-type. On top of that, Head Smash has low accuracy, making Tyrantrum unreliable at throwing out huge damage. Faster revenge killers, such as Passimian, Rotom-C, and Flygon, can also take advantage of Tyrantrum, forcing it out to grab back momentum or break massive holes in your team.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Details</h1> <p>Crunch and Close Combat help make quick work of common switch-ins such as Steel- and Ground-types, chipping them into Head Smash range for later.</p> <p>Getting rid of Steel- and Ground-types such as Bronzong and Mudsdale is key to letting Tyrantrum rip open teams with Head Smash. Grass- and Water-types such as Rotom-C, Decidueye, and Starmie can help switch into and break open the Ground-types in the tier for Tyrantrum. Fire-types such as Arcanine, Talonflame, and Salazzle also make great partners, helping check Steel-types like Copperajah and Bronzong, while Tyrantrum can help break through common Fire-type answers such as Mantine and Diancie. Entry hazard support from Pokemon like Copperajah, Bronzong, and Garbodor helps chip walls into OHKO range, such as with Diancie and Vileplume. Pokemon that utilize pivoting moves, such as Vaporeon, Rotom-C, and Passimian, are also helpful for getting Tyrantrum onto the field easily.</p> "
      },
      {
        "name": "Setup Sweeper",
        "description": "<h1>Set Details</h1> <p>After boosting, Tyrantrum becomes a powerful late-game cleaner, and, when paired with Scale Shot, not much can reliably revenge kill it. Lum Berry is the most common item, letting Tyrantrum set up in the face of status users such as Mantine and Talonflame. On dual screens teams, Life Orb is preferred, giving it an immediate power boost that can pick up the KO versus certain Pokemon such as Sylveon, Vaporeon, and Diancie when at +1 Attack. Weakness Policy is another viable option for dual screens teams, taking advantage of the weakened super effective attacks sent its way and boosting up to astronomical heights. Hone Claws is a solid secondary option over Dragon Dance to boost accuracy for Head Smash and Scale Shot, but Dragon Dance is usually preferred because of its higher sweeping potential. A Jolly nature is prefered specifically for speeding past Talonflame, Inteleon, and Aerodactyl at +1 Speed.</p> <p>Getting rid of or chipping Ground-types is necessary to letting Tyrantrum sweep. Grass-type partners such as Rotom-C, itemless Vileplume, and Decidueye do a great job switching into and punishing Ground types such as Mudsdale, Golurk, and Flygon. Spikes support from Garbodor or Qwilfish also helps chip down Pokemon such as Diancie, Sylveon, and Vaporeon into Head Smash range. Dragon Dance Tyrantrum also fits wonderfully with dual screens support, taking advantage of the added cushioning screens provide from Pokemon like Xatu, Espeon, and Inteleon to quickly boost up and win. On such teams, Grass- and Water-type setup sweepers such as Decidueye and Blastoise are fantastic partners, setting up on the Ground-types Tyrantrum wants gone.</p> <h1>Other Options</h1> <p>Choice Scarf can be an alternative option on Tyrantrum, letting it be a revenge killer and potential late-game cleaner while improving its matchup against offensive teams, but this set struggles to break through defensive cores with its significantly lower power level and needs heavy support. Chople Berry on setup sets is another viable item, baiting in and KOing Passimian, which would usually stop a sweep.</p> <h1>Checks and Counters</h1> <p><strong>Ground-types: Mudsdale is the best defensive answer to Tyrantrum thanks to Stamina boosting its Defense when it gets hit. Other Ground-types, like Golurk and defensive Flygon, can all take one resisted hit and KO Tyrantrum back.</p> <p><strong>Bronzong</strong>: Physically defensive variants of Bronzong make spamming Head Smash difficult, although Crunch can 2HKO them.</p> <p><strong>Fighting-types</strong>: Choice Scarf Passimian will always revenge kill Tyrantrum, and Jolly Sirfetch'd will outspeed and KO Adamant Tyrantrum, although Dragon Dance sets threaten it out. Machamp can also come in on a Tyrantrum that is locked into Head Smash and threaten to KO it.</p> <p><strong>Special Attackers: Because of Tyrantrum's low Special Defense, it can easily be revenge killed by any faster special attacker in the tier, like Rotom-C, Starmie, or Goodra.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 509790, "username": "Pokeslice"}]}
  },
  "Aurorus": {"sets": [{"name": "Hail Setter"}]},
  "Sylveon": {
    "overview": "<p>Sylveon distinguishes itself as a prominent Fairy-type, punishing attackers like Guzzlord, Sirfetch'd, and Goodra. Sylveon's defensive set also has enough natural special bulk to prevent Blastoise and Life Orb Starmie from breaking through it. Its Wish and Heal Bell support is also relevant, as many Pokemon that form good defensive cores with Sylveon, like Copperajah and Guzzlord, lack reliable recovery themselves. When it opts for Choice Specs, Sylveon is a potent wallbreaker that lures in checks like Copperajah and Salazzle to dent them with Mystical Fire and Psyshock. However, Sylveon will still struggle against Steel- and Poison-types like Copperajah, Escavalier, and Vileplume when locked into Hyper Voice or when it lacks coverage. Defensive Sylveon's passivity and reliance on Protect to secure its recovery can also let in wallbreakers and setup sweepers like Celebi, Glastrier, and Exploud. Physical wallbreakers like Drapion, Tyrantrum, and Tauros outpace and carry strong coverage for Sylveon, making it ineffective if they have a setup opportunity or predict it switching in.</p> ",
    "comments": "<h1>Other Options</h1> <p>Calm Mind is an option for Sylveon to function as a defensive sweeper. Toxic also works versus walls like Talonflame and Vaporeon, although Sylveon is even more vulnerable to its offensive checks as a result.</p> <h1>Checks and Counters</h1> <p><strong>Poison-types: Besides Psyshock, Sylveon has little to deter Salazzle, which can use its resistances to set up Nasty Plot against Sylveon. Similarly, Garbodor can switch into Sylveon to set Spikes. Other Poison-types like Dragalge and Drapion also hit it hard but have limited opportunities to switch in.</p> <p><strong>Steel-types: Specially defensive Steel-types like Copperajah and Escavalier wall Sylveon's Hyper Voice but ought to worry about switching into a boosted Mystical Fire.</p> <p><strong>Fire-types: Talonflame and Arcanine tank Hyper Voice and punish Sylveon with status.</p> <p><strong>Wallbreakers: Some of the strongest wallbreakers like Tauros, Tyrantrum, and Exploud are able to break down Sylveon. However, as the latter two are often Choice locked, Protect can mitigate this problem if Sylveon still has relevant defensive teammates around.</p> <p><strong>Setup Sweepers: Sylveon's passivity may let sweepers like Celebi, Decidueye, and Braviary set up on it.</p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<h1>Set Details</h1> <p>Protect makes Wish a reliable recovery move and scouts Choice-locked wallbreakers like Tyrantrum and Exploud. Heal Bell allows Sylveon to preform as a cleric and remove Toxic poison. If a cleric is less desirable for the team, Mystical Fire offers coverage against targets like Vileplume and Escavalier. Leftovers provides passive recovery and pairs well with Protect, but Heavy-Duty Boots can be considered so Sylveon has a better defense against Spikes and Toxic Spikes. The EV investment allows Sylveon to avoid a 2HKO from Sludge Bomb Goodra and +2 Blastoise while still being bulky enough to switch into Close Combat from Sirfetch'd.</p> <p>Wish support works great with specially defensive Steel-types like Copperajah and Escavalier, as they lack their own recovery and have valuable resistances for Sylveon to rely on. Other walls that lack recovery like Mudsdale and Guzzlord enjoy the support as well, and they help cover Sylveon's vulnerabilities to attackers like Drapion and Salazzle, respectively. Arcanine and Talonflame are valuable for checking Steel-types, and they spread Toxic against other walls like Mantine, which Sylveon will then be able to outstall. Offensive teammates like Celebi, Dragalge, and Golurk target the defensive Steel- and Poison-types that give Sylveon trouble.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<h1>Set Details</h1> <p>Mystical Fire hits bulky Steel-types such as Copperajah and Escavalier and 2HKOes Vileplume. Psyshock deals with Poison-types such as Salazzle and Garbodor. The last moveslot is not very important, but Heal Bell is a good choice for balance teams that need a cleric option. While a Modest nature is preferred for more wallbreaking power, a Timid nature can be used to outspeed wallbreakers like Adamant Sirfetch'd, neutral-natured Decidueye, and Modest Exploud.</p> <p>Choice Specs Sylveon works best on balance and bulky offense teams as a strong wallbreaker. Although Sylveon can lure in and heavily damage bulky Steel-types such as Copperajah and Escavalier with its coverage moves, this relies on proper prediction, and these Steel-types also prevent it from freely using Hyper Voice and take huge advantage of it once it is locked into this move. Therefore, a check to them such as Guzzlord, Arcanine, or Talonflame is recommended. Electric-types such as Heliolisk and Rotom-C provide Volt Switch support, chip down opposing Steel-types, and check special defensive Mantine, which Sylveon struggles with. Rock- and Water-types like Diancie, Tyrantrum, and Vaporeon check Fire-types like Talonflame, Arcanine, and Salazzle, which either reliably pivot into or offensively check Sylveon. Late-game cleaners such as Choice Scarf Heliolisk, Kingdra, and Blastoise benefit from Sylveon's ability to weaken or even remove opposing Steel-types and take advantage of its common checks such as Mantine and Talonflame.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 298730, "username": "poh"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 331519, "username": "CyroGyro"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 464737, "username": "Holy-Darky"}]}
  },
  "Goodra": {
    "overview": "<p>Goodra stands out as a wallbreaker thanks to its powerful Draco Meteor and coverage options that allow it to hit the majority of the tier super effectively. Furthermore, its naturally high Special Defense means that Goodra can take hits and check the likes of Shell Smash Blastoise and Nasty Plot Salazzle. However, Goodra is held back by a mediocre physical bulk that leaves it vulnerable to revenge killers like Tauros and Passimian, and it lacks solid recovery options to use its special bulk with. Goodra also finds itself in direct competition with other special attackers like Exploud and Dragalge that rely less on movepool diversity given their raw power.</p> ",
    "comments": "<h1>Other Options</h1> <p>Assault Vest bolsters Goodra's special bulk to ridiculous levels, allowing it to easily shrug off boosted coverage from the likes of Shell Smash Blastoise and Nasty Plot Salazzle, but Goodra still survives boosted hits without Assault Vest. Goodra can also justify Choice Scarf or Choice Specs with its solid power and coverage, but it has little staying power after using a Choice-locked attack.</p> <p>Thunder can be justified to 2HKO Vaporeon, although the move is rather inaccurate. Goodra's decent Attack is backed up by some useful STAB options and great coverage moves like Earthquake, Superpower, Iron Tail, and Power Whip. However, physical attacking sets are, for the most part, performed more effectively by other Pokemon. Goodra can also run an effective Substitute + Acid Armor set with Body Press to beat Steel-types and set up on passive foes like Vaporeon.</p> <h1>Checks and Counters</h1> <p><strong>Specially Defensive Pokemon: Specially defensive variants of Pokemon like Vaporeon and Sylveon can shrug off Goodra's standard moves and slowly whittle down its HP with Toxic and other moves.</p> <p><strong>Steel-types: While most do not want to switch directly into a Fire Blast, Steel-types like Assault Vest Copperajah can easily shrug off Goodra's other usual attacks and strike at its weaker Defense.</p> <p><strong>Fairy-types: Fairy-types such as bulky Sylveon and Diancie can take most of Goodra's moves and respond with their own STAB attacks. However, they do need to be careful of Sludge Bomb or Hydro Pump coverage, respectively. Diancie will also fall to Iron Tail.</p> <p><strong>Physical Attackers: Goodra's weaker Defense leaves it prone to physical attackers like Tauros, Assault Vest Copperajah, and Drapion. Some of them do need to fear attacks from Choice Scarf Goodra, though.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<h1>Set Details</h1> <p>Fire Blast is Goodra's best option for hitting Steel-types like Copperajah and Escavalier that would otherwise wall it. Thunderbolt is a consistent option to hurt bulky Water-types like Vaporeon and Mantine. Sludge Bomb is the preferred last move to hit Fairy-types like Comfey and Sylveon. Alternatively, Hydro Pump and Surf are Goodra's best ways to damage Diancie and allow it to threaten Fire-types without sustaining Special Attack drops. The Modest nature and Expert Belt are useful for netting 2HKOs on the likes of Assault Vest Copperajah and physically defensive Sylveon.</p> <p>Goodra is prone to being revenge killed by physical attackers like Tauros and Ninjask, so physically defensive partners like Mudsdale and Bronzong are appreciated for it to retreat behind. Fire-types like Arcanine and Talonflame appreciate Goodra's ability to switch into Water-type moves and threaten Thunderbolt usage, while Steel-types like Copperajah benefit from Goodra's Fire resistance. In return, they can threaten the opposing Steel- and Fairy-types such as Bronzong and Sylveon that limit the effectiveness of Draco Meteor. Water-types like Vaporeon enjoy Goodra's ability to casually switch into Electric- and Grass-type moves, and Goodra likes having them around for their matchups against the likes of Diancie and Glastrier. Because Goodra lacks recovery to accompany its bulk, Wish support from the likes of Vaporeon and Sylveon can be very beneficial.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 435989, "username": "Mariannabelle"}]}
  },
  "Diancie": {
    "overview": "<p>Diancie's ability to wall many metagame staples and support its team through other useful ways solidly places it at the top of the metagame. It can defensively answer many hard-to-wall wallbreakers such as Dragalge, Exploud, and Salazzle and can pivot around other threats like Tauros and Guzzlord. It's also a fantastic Stealth Rock setter by virtue of its good matchup against many of NU's common entry hazard removers and one of a select few clerics available. However, Diancie's great defensive potential is limited by the litany of wallbreakers that can switch into it and easily take it down, such as Starmie, Celebi, and Golurk. Additionally, many Pokemon can lure in and take out or heavily damage Diancie with coverage moves, in particular Iron Head Tauros and Braviary, Iron Tail Goodra, and Hydro Pump Exploud, further restricting its capabilities.</p> ",
    "comments": "<h1>Other Options</h1> <p>Diancie's good coverage lets it effectively run an offensive set, be it Calm Mind or Choice Specs. Such sets can much more reliably pressure Fighting-resistant foes like Sylveon, Vileplume, and Garbodor and can lure in and defeat Steel-types like Copperajah and Escavalier with Mystical Fire. Protect scouts Choice-locked Pokemon such as Rotom-C and Exploud in addition to giving Diancie extra Leftovers recovery. Encore stops slower setup sweepers like Snorlax and disrupts utility Pokemon like Sylveon, but having to find an alternative Stealth Rock setter or dropping Heal Bell or Moonblast is a somewhat large opportunity cost. Trick Room supports slower wallbreakers like Glastrier and Copperajah well but is limited to dedicated Trick Room teams. Toxic occasionally sees use to cripple Ground-types, but it's generally outclassed by Diancie's other moves.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types: Without Mystical Fire, Diancie is incapable of consistently beating Escavalier and easily folds to its Iron Head. Copperajah struggles to switch into Diancie because of Body Press but OHKOes it with Heavy Slam.</p> <p><strong>Ground-types</strong>: Without Moonblast, Diancie lacks a means to meaningfully damage Golurk and Palossand, both of which can easily take it out. Mudsdale is similar, resisting Diamond Storm and boosting alongside Diancie thanks to Stamina, although its damage output isn't as severe as the aforementioned Ground-types.</p> <p><strong>Grass-types: Celebi and Vileplume resist Body Press and don't mind Diamond Storm much, letting them easily switch into and force out Diancie. Rotom-C and Decidueye are shakier answers long-term because their physical bulk isn't great, but they too heavily threaten Diancie.</p> ",
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<h1>Set Details</h1> <p>Diancie excels as a Stealth Rock setter and cleric because it easily forces out several common Pokemon, including Salazzle, Dragalge, and Talonflame, giving it ample opportunity to get Stealth Rock up or cleanse its team of status. As an alternative to Heal Bell, Moonblast pressures Sirfetch'd and Toxicroak, gets chip damage off on Golurk, and makes it harder for Xatu to PP stall Diancie. The EV spread lets Diancie outrun maximum Speed Guzzlord in addition to other threats like Jolly Glastrier and Vaporeon.</p> <p>The biggest benefit to using Diancie is that other potential Stealth Rock setters can utilize other sets and moves. Copperajah is the most notable example, being freed up to run Assault Vest and make better use of its great offensive potential. Diancie is also a phenomenal Talonflame answer, so Pokemon like Sirfetch'd and Decidueye pair well with it. Sirfetch'd in particular greatly appreciates Diancie's cleric support when up against Flame Body Talonflame. Ground-types like Golurk, Mudsdale, and Palossand are hard stops to Diancie, so pair it with Pokemon like Rotom-C, Starmie, and Vileplume that can handle such foes.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435989, "username": "Mariannabelle"}, {"user_id": 114198, "username": "Finchinator"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Decidueye": {
    "overview": "<p>Whether specially or physically orientated, Grass / Ghost typing with decent mixed offensive stats makes Decidueye exceed as a wallbreaker. Choice Band and Choice Specs sets are immediately threatening, with the former offering a strong U-turn while the latter being a safe switch-in to Vaporeon's Scald. Meanwhile, Sword Dance sets take advantage of Pokemon like Mudsdale and Choice-locked Rotom-C to set up and sweep past threats like Copperajah, Sylveon, and, with Shadow Sneak, Starmie. The main issue between sets is the prevalence of Pokemon able to tank both of Decidueye's STAB attacks like Guzzlord, Drapion, and Braviary. Decidueye also isn't that fast nor physically bulky, so it often folds to revenge killers like Talonflame and Tauros. Both sets also have their own competition and situational checks like Escavalier and Arcanine that limit Decidueye's effectiveness.</p> ",
    "comments": "<h1>Other Options</h1> <p>Swords Dance variants may try coverage like Low Sweep, U-turn, and Knock Off to deal with Decidueye's checks like Guzzlord and Braviary. These moves come at the cost of one of Decidueye's STAB attacks, though, and ultimately are too situational to be recommended generally. Lum Berry on Sword Dance sets sacrifices power for a consistent setup opportunity against Vaporeon. Hurricane on Choice Specs nails Vileplume while retaining strong neutral coverage against Shadow Ball targets in the event of a Dark- or Normal-type switch-in. However, Knock Off and U-turn are usually better to have.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Two relevant Dark-types counter Decidueye thanks to their STAB Knock Off and Grass resistance: Guzzlord and Drapion. U-turn might ease prediction for Decidueye, but Shadow Sneak sweeps are hard stopped by these two.</p> <p><strong>Normal-types: Braviary walls Decidueye, and along with Tauros, the two outspeed and OHKO Decidueye. Decidueye also wants to spam its Ghost-type attacks but is deterred by other Normal-types like Heliolisk and Exploud.</p> <p><strong>Revenge Killers: A middling Speed tier makes Decidueye a prime target for Salazzle, Talonflame, Toxicroak, and Ninjask. However, boosted Shadow Sneak could become an issue depending on how worn down these threats are.</p> ",
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<h1>Set Details</h1> <p>U-turn gains momentum against switch-ins like Drapion and Braviary, and it especially hurts Guzzlord. Shadow Sneak's priority helps pick off faster, weakened foes like Starmie and Ninjask. Spirit Shackle could be opted for instead of Poltergeist on teams with Knock Off support, although this set prefers Poltergeist to 2HKO Sylveon and OHKO physically defensive Bronzong after Stealth Rock. Spell Tag lets Decidueye switch attacks, which makes walls with Protect like Vaporeon less effective at scouting it. Long Reach avoids Talonflame's Flame Body, and a Jolly nature ensures Decidueye can revenge kill slower wallbreakers like Sirfetch'd and Exploud.</p> <p>Offensive pivots such as Dragalge and Heliolisk often bring in Decidueye on special walls like Bronzong and Copperajah. They also target Decidueye's checks like Talonflame and Braviary. Physical walls like Mudsdale and Quagsire work as defensive pivots when Drapion and Guzzlord attempt to revenge kill or switch into a Choice-locked Decidueye. In return, Decidueye punishes Psychic-types like Celebi and Xatu. Vaporeon, Mantine, and Goodra are good checks to Fire-types like Talonflame and Arcanine, especially when Poltergeist Decidueye cannot always rely on Knock Off + Stealth Rock support to help deal with these two.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<h1>Set Details</h1> <p>Leaf Storm and Giga Drain both have their uses; one nukes slower attackers like Exploud and Diancie, and the other is more reliable versus walls like Vaporeon and Mudsdale. U-turn is used so that Decidueye may build momentum on walls it's unable to threaten like Guzzlord. Otherwise, Knock Off works too for wearing down checks like Assault Vest Copperajah and Braviary. A Timid nature guarantees Decidueye will outspeed similarly fast wallbreakers like Sirfetch'd and Exploud.</p> <p>Physically offensive pivots like Ninjask and Passimian lure in walls like Mudsdale and Bronzong for Decidueye to break, and they also deal with special walls like Copperajah. Flip Turn pivots like Dragalge and Vaporeon also help bring in Decidueye safely, and their attacks help wear down its checks like Escavalier and Guzzlord, respectively. Physical wallbreakers like Sirfetch'd and Toxicroak are also great for when Decidueye pivots versus special walls. Additional Knock Off support from Salazzle and Drapion is a great way to wear down Guzzlord and Mantine, and in return, Decidueye is a punishing switch-in against Diancie and Mudsdale. Decidueye prefers spamming Shadow Ball, so add checks to Normal- and Dark-types, like Diancie, Sylveon, and Bronzong.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Spirit Shackle, while weaker than Poltergeist, still hits itemless targets and can potentially trap sacks like Mudsdale to set up multiple times. Poltergeist instead has enough power at +2 to reliably OHKO walls like Copperajah, Sylveon, and Escavalier. Spell Tag with an Adamant nature is a necessary combination for wallbreaking and so +2 Shadow Sneak OHKOes uninvested Ninjask. Long Reach is preferable over Overgrow because of Flame Body Talonflame.</p> <p>Decidueye cleans weakened teams late-game and finds windows to set up on passive walls. To help with these goals in mind, offensive pivots like Rotom-C, Passimian, and Heliolisk are able to chip walls like Vileplume and Guzzlord and check attackers like Drapion and Braviary. Wallbreakers like Sirfetch'd and Tyrantrum are also great at clearing a path for Decidueye. In return, Decidueye is able to set up on their revenge killers, especially Choice Scarf Rotom-C. To deal with faster Normal- and Flying-types, try pairing Decidueye with teammates like Bronzong, Assault Vest Copperajah, and Diancie. Offensive support from lead Aerodactyl, dual screens Xatu, and additional sweepers like Salazzle and Blastoise also works to facilitate Decidueye sweeps on hyper offense.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 297859, "username": "quziel"}, {"user_id": 114198, "username": "Finchinator"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 262594, "username": "Milak"}, {"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}
  },
  "Mudsdale": {
    "overview": "<p>Mudsdale differentiates itself from other Stealth Rock setters like Copperajah and Diancie with its consistency in handling physical attackers such as Drapion, Tyrantrum, and Sirfetch'd. Mudsdale's solid physical bulk, ability in Stamina, and typing help it match offensive power with defensive might to check these wallbreakers. Mudsdale also lacks passivity issues thanks to its high Attack and strong moves in STAB Earthquake and Body Press, the latter of which can take advantage of Stamina boosts. Mudsdale is otherwise far too easily to overwhelm with common special attackers like Starmie, Blastoise, and Nasty Plot Salazzle. Additionally, Mudsdale is an ineffective Volt Switch deterrent because the most common Volt Switch users, Rotom-C and Heliolisk, can easily OHKO it with Leaf Storm and Grass Knot, respectively, and it's also very slow.</p> ",
    "comments": "<h1>Other Options</h1> <p>Roar prevents Substitute setup sweepers like Braviary and Blastoise from taking advantage of Mudsdale as easily. Payback helps against foes like Decidueye and Dhelmise and means Mudsdale doesn't need to waste a turn using Smack Down to deal with Xatu. Choice Band sets make use of Mudsdale's incredible Attack stat and solid coverage moves to turn it into a good wallbreaker, although it's very prediction reliant and at risk of being setup fodder for foes like Rotom-C and Decidueye.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Rotom-C, Celebi, and Decidueye are immune to or resist Earthquake, force Mudsdale out, and can set up with Nasty Plot and Swords Dance. Vileplume has immense physical bulk augmented by Strength Sap, and it's immune to Toxic. Dhelmise can spin away Mudsdale's Stealth Rock, although doing so may negatively affect its ability to beat Toxic + Protect Mudsdale one-on-one due to Stamina.</p> <p><strong>Water-types: Defensive Water-types such as Mantine and Vaporeon have little issue taking on Mudsdale, only disliking being poisoned by Toxic. Offensive Water-types like Starmie and Blastoise, meanwhile, can easily dispatch Mudsdale, with Blastoise threatening to set up with Shell Smash too.</p> <p><strong>Ground-immune Pokemon: Braviary can fairly easily set up against Mudsdale, especially if it has Substitute, although it must use Bulk Up a couple of times before attacking because of Mudsdale's Stamina. Levitate Weezing has a good matchup against Mudsdale with its combination of Will-O-Wisp + Taunt, preventing Mudsdale from doing significant damage to it with Earthquake and denying Stealth Rock.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<h1>Set Details</h1> <p>Although Toxic is typically preferred so Mudsdale can prevent common switch-ins like Dhelmise, Decidueye, and Vaporeon from easily answering it, Body Press synergizes nicely with Stamina and helps against foes like Guzzlord and Braviary. Smack Down is useful for letting Mudsdale hit Ground-immune foes like Xatu with Earthquake, and it also does significant damage to Talonflame. Alternatively, Protect helps Mudsdale accumulate poison damage, gain extra health from Leftovers, and scout Choice item attackers like Rotom-C and Choice Specs Decidueye. You can consider running 64 Special Defense EVs to avoid Salazzle from OHKOing Mudsdale with +2 Fire Blast, although this benchmark is rarely necessary.</p> <p>Mudsdale is vulnerable to powerful special attackers such as Goodra, Rotom-C, and Starmie, so it benefits from teammates like Sylveon, Assault Vest Copperajah, and Mantine that can take attacks from such foes. Mudsdale is a great answer to opposing Rock-types such as Diancie and Tyrantrum, so pair it with Fire-types like Talonflame, Salazzle, and Arcanine. In return, these Pokemon help against Grass- and Ice-types. Similarly, Mudsdale is effective at luring in and crippling bulky Water-types with Toxic; teammates like Shell Smash Blastoise and Swords Dance Escavalier appreciate this. Mudsdale appreciates the support of Grass-types like Vileplume, Celebi, and Decidueye, which handle opposing Water- and Grass-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 241380, "username": "Abejas"}, {"user_id": 298730, "username": "poh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Araquanid": {
    "overview": "<p>Araquanid's natural Special Defense and typing allow it to set up on many passive Pokemon, namely Vaporeon, and it can also take on many attackers such as Blastoise and Salazzle. It also manages to maintain an offensive presence with Water Bubble-boosted Liquidation. However, its low base Attack and Speed leave it outmatched by opposing wallbreakers like Golurk and Sirfetch'd, and it struggles if the opposition lacks Pokemon for it to use Substitute on. Its subpar physical bulk also leaves it struggling to capitalize on many of its resistances, so it can take heavy damage trying to switch into the likes of Copperajah and Passimian.</p> ",
    "comments": "<h1>Other Options</h1> <p>Araquanid is a rare user of Sticky Web, which can be really useful for partners in competitive Speed tiers, like Exploud and Drapion; it can even pull off a dedicated lead set with moves like Magic Coat in such cases. However, such a set is generally regarded as a waste of Araquanid's other talents.</p> <h1>Checks and Counters</h1> <p><strong>Sound Move Wallbreakers: Araquanid needs to be wary of Exploud and Choice Specs Sylveon; both can bypass Substitute, potentially landing OHKOs after Substitute damage.</p> <p><strong>Electric-types and Electric-type Coverage: Despite Leech Life offensively pressuring them, Rotom-C and Heliolisk are generally safe switch-ins to Liquidation and threaten heavy damage with their STAB attacks. Goodra can hit Araquanid hard with Thunderbolt, preventing it from being a good pivot into it.</p> <p><strong>Faster Physical Attackers: If Araquanid struggles to get a Substitute up, its low Speed and physical bulk leave it vulnerable to the STAB and coverage moves of faster attackers like Golurk and Tauros; even the likes of Diancie and Rhydon can invest in Speed to demolish it before it gets a chance to use Liquidation.</p> <p><strong>Poison-types: Between Dry Skin and its Poison typing, Toxicroak is utterly unfazed by anything Araquanid could try to do to it. Other Poison-types like Dragalge and Vileplume also have solid matchups against it. Garbodor also annoys Araquanid with Rocky Helmet and Aftermath.</p> <p><strong>Residual Damage: Mudsdale and Vaporeon can poison Araquanid with Toxic on the switch and completely ruin its chances of stallbreaking if its team lacks a cleric. Chip damage from Xatu's or Weezing's Rocky Helmet can also give Araquanid issues. Additionally, Passimian can remove Araquanid's Heavy-Duty Boots with Knock Off, forcing it to take entry hazard damage.</p> ",
    "sets": [
      {
        "name": "Substitute Attacker",
        "description": "<h1>Set Details</h1> <p>Substitute should be used against foes that cannot break past Araquanid, such as Vaporeon; it can also be used against Pokemon that it comfortably scares out, like Mudsdale and Salazzle. From behind a Substitute, Araquanid should use a combination of Liquidation and Toxic to wear down foes. Leech Life provides some extra recovery and is Araquanid's best move against Water-resistant foes like Starmie, Rotom-C, and Guzzlord. 188 Speed EVs are used to outspeed uninvested Vaporeon; alternatively, 220 EVs allow it to outpace maximum Speed Glastrier if needed.</p> <p>Araquanid is most at home when taking advantage of and crippling passive Pokemon like Vaporeon and Mudsdale; this is a great boon for sweepers like Nasty Plot Salazzle. Pokemon like Mudsdale and Diancie also benefit from Araquanid switching into stray Scalds and checking Blastoise for them. In exchange, they can take on various physical attackers that threaten Araquanid; Mudsdale easily takes on the likes of Tyrantrum and Aerodactyl, while Diancie takes care of Flying-types such as Ninjask. Because Araquanid is still vulnerable to Exploud and Sylveon when behind a Substitute, it appreciates the support of Steel-types like Copperajah and Escavalier to take their attacks. In return, Araquanid threatens the opposition's Ground- and Fire-types.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 298730, "username": "poh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 435989, "username": "Mariannabelle"}, {"user_id": 336073, "username": "Rabia"}]}
  },
  "Salazzle": {
    "overview": "<p>Salazzle's access to Nasty Plot and incredible offensive stats make it a premier setup sweeper in NU. Despite having difficulty bypassing common Water-types, very few other foes can stand up to Salazzle's boosted attacks; for example, +2 Overheat gets past Mudsdale, while +2 Dragon Pulse deals with Dragalge, Goodra, and Guzzlord. Additionally, Salazzle possesses a very convenient defensive typing, which helps it avoid being revenge killed by Sirfetch'd's First Impression and Passimian's Close Combat. Despite all of this, other fast foes like Inteleon, Talonflame, and Choice Scarf Heliolisk give Salazzle trouble, and Salazzle lacks any effective way to bypass bulky Water-types like Vaporeon and Mantine on its own.</p> ",
    "comments": "<h1>Other Options</h1> <p>A set with the moves Substitute / Toxic / Protect / Flamethrower and Black Sludge is good at crippling the opposition and letting Salazzle scout foes. Choice item sets are workable thanks to Salazzle's great natural Special Attack and Speed, but it lacks good coverage moves beyond its STAB attacks and Dragon Pulse and dislikes locking into moves such as Toxic and Knock Off.</p> <h1>Checks and Counters</h1> <p><strong>Water-types</strong>: Foes like Mantine and Vaporeon are effective walls versus Salazzle and can KO it with Scald. Offensively, Inteleon is faster and easily OHKOes Salazzle with Hydro Pump, while Starmie can tank a single hit and OHKO in return.</p> <p><strong>Dragon-types: If Salazzle lacks Dragon Pulse, it struggles to get through foes like Guzzlord, Dragalge, and Goodra without a fair amount of chip damage.</p> <p><strong>Rock-types: Gigalith walls Salazzle with ease and only cares about being afflicted with Toxic poison or hit by Knock Off. Diancie, despite its Poison neutrality, can defensively answer Salazzle and OHKO it with Diamond Storm. Choice Scarf Tyrantrum easily OHKOes Salazzle with Earthquake.</p> ",
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<h1>Set Details</h1> <p>Overheat can muscle past foes like Mudsdale, whereas Dragon Pulse prevents Dragon-types like Goodra, Guzzlord, and Dragalge from being consistent defensive answers. Encore can also be considered to lock slow setup sweepers like Snorlax into unhelpful moves, making it easy for Salazzle to set up against and break through them. Focus Sash helps avoid being revenge killed by moves like Inteleon's Hydro Pump and Choice Scarf Tyrantrum's Earthquake, but Heavy-Duty Boots means Salazzle is less reliant on effective entry hazard control.</p> <p>Xatu is a great teammate for Salazzle, especially Focus Sash variants, for its ability to deny entry hazards. Similarly, other hazard removers like Rotom-C and Mantine are good to have. Salazzle cannot reliably get by bulky Water-types on its own; teammates like Heliolisk, Decidueye, and Goodra are good as a result. On hyper offense teams, Froslass is a great lead to set Spikes and deny entry hazards with Taunt.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 298730, "username": "poh"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Tsareena": {"sets": [{"name": "Utility"}]},
  "Comfey": {
    "comments": "<h1>Other Options</h1> <p>Calm Mind sets can use Triage and Stored Power to give Comfey a good matchup against offensive Pokemon like Kingdra and Blastoise and Poison-types like Weezing and Vileplume, but it still gets walled by Dragalge and Steel-types like Copperajah and Bronzong. Dual screen setters like Xatu and Espeon make good teammates for this set to give Comfey multiple setup opportunities and help it survive a super effective attack to activate Weakness Policy.</p> <h1>Checks and Counters</h1> <p><strong>Poison-types: Poison-types such as Salazzle, Weezing, Dragalge, and Drapion pressure Comfey with their STAB attacks. Due to Comfey's weak offensive stats, they may opt to use a non-attacking move like Toxic Spikes or Swords Dance.</p> <p><strong>Steel-types: Steel-types like Bronzong and Copperajah can utilize their resistances to set Stealth Rock. Furthermore, they also punish Comfey's teammates after U-turn due to it outspeeding them.</p> <p><strong>Fire-types</strong>: Fire-types like Salazzle, Arcanine, and Talonflame act as great defensive options, as Comfey can't do much in return.</p> <p><strong>Wallbreakers: Comfey is forced out by powerful wallbreakers like Exploud, Glastrier, and Golurk that can KO it. Glastrier is notably able to frequently set up Substitute and Swords Dance and muscle through Comfey's attacks.</p> ",
    "sets": [
      {"name": "Calm Mind", "description": "<p>The following analysis is outdated. Information contained in the analysis may be misinformative in regards to the current metagame.</p> <hr /> <h1>Overview</h1> <p>Comfey acts as great role compression, providing hazard control thanks to Defog and acting as a pivot with U-turn. Its Fairy typing helps it check Fighting- and Dragon-types like Sirfetch'd, Machamp, and Guzzlord. Thanks to Natural Cure and Synthesis, Comfey can absorb weaker hits and status ailments from Stealth Rock users like Diancie and Mudsdale. It has a hard time getting past Fire-, Steel-, and Poison-types like Talonflame, Bronzong, and Dragalge because of its poor coverage and offensive stats, and as a result, it's forced to use U-turn and act as a lure. Comfey faces competition with Sylveon due to its better bulk, access to Wish, and ability to pull off offensive sets more effectively.</p> "},
      {
        "name": "Defog",
        "description": "<h1>Set Details</h1> <p>U-turn allows Comfey to pivot out of Pokemon it cannot KO like Dragalge, Vaporeon, and Talonflame. Heavy-Duty Boots synergizes with its pivoting, but Rocky Helmet is also an option to chip physical attackers like Sirfetch'd and Tauros. Leech Seed is an alternative to Synthesis to get extra chip damage on Poison- and Steel-types like Weezing and Bronzong, and it gives teammates a little recovery as Comfey switches with U-turn. 24 Speed EVs allow Comfey to outspeed Adamant Tyrantrum and Decidueye.</p> <p>Comfey is extremely reliant on its teammates to deal with checks its baits in with U-turn. Ground-, Fighting-, and Fire-types like Golurk, Sirfetch'd, and Arcanine are great to check Steel-types like Bronzong, Copperajah, and Escavalier. Dragalge and Toxicroak also make great teammates to threaten walls like Sylveon, Vaporeon, and Mantine, as they outstall Comfey otherwise. Psychic- and Ground-types like Starmie and Mudsdale can threaten Poison-types like Salazzle and Toxicroak that Comfey struggles to get rid of. Water-types like Blastoise and Kingdra can set up on Fire-types like Talonflame after Comfey pivots out. Teammates with pivoting moves can form a VoltTurn core alongside Comfey such as Arcanine, Ninjask, and Rotom-C with Teleport, U-turn, and Volt Switch, respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}, {"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 481576, "username": "roxiee"}]}
  },
  "Passimian": {
    "overview": "<p>Passimian is the only Fighting-type Pokemon in the tier that can perform the roles of a revenge killer and pivot with U-turn. Its access to coverage moves like Rock Slide and Gunk Shot allows it to punish its checks in Flying- and Fairy-types like Talonflame and Sylveon. With a Choice Scarf, it's able to outpace Pokemon like Tauros, Talonflame, and Tyrantrum after a Dragon Dance and KO them with its attacks. Although Passimian is using a Choice Scarf, it's unable to deal with faster Pokemon like Choice Scarf Rotom-C and Flygon and Blastoise after a Shell Smash. Passimian faces a lot of risk-reward situations by being Choice locked like using Rock Slide to predict the Flying-type switch-in in front of a Steel-type like Copperajah. Passimian also must avoid status effects from foes like Talonflame's Flame Body and Vileplume's Effect Spore, which discourage U-turn.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Band amplifies Passimian's damage output, allowing it to muscle through Fighting-resistant Pokemon better with Close Combat. Facade is an option so Passimian isn't completely useless if it gets a status ailment, notably a burn.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types</strong>: Fairy-types like Sylveon, Comfey, and Diancie can OHKO Passimian with Moonblast, but the first two risk switching into a Gunk Shot.</p> <p><strong>Physically Defensive Pokemon: Passimian has a hard time getting past physically defensive foes like Xatu, Mantine, Arcanine, and Mudsdale. They all have their ways of statusing Passimian, and the first three notably have recovery in Roost and Morning Sun to keep them healthy throughout the match.</p> <p><strong>Poison-types: Poison-types like Weezing and Vileplume can stomach all of Passimian's attacks and status it with Will-O-Wisp, Sleep Powder, and Stun Spore. They also have adverse effects like Rocky Helmet from Weezing and Effect Spore from Vileplume, which can lower its longevity and potentially status it. Offensive Pokemon like Salazzle and Toxicroak can make use of Passimian being Choice locked to set up with Nasty Plot or Swords Dance, respectively.</p> <p><strong>Status: Status ailments, notably paralysis from Pokemon like Xatu and burn from Vaporeon's Scald, cripple Passimian. Abilities that can trigger adverse effects like Talonflame's Flame Body and Vileplume's Effect Spore can potentially status Passimian when using a contact move.</p> ",
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<h1>Set Details</h1> <p>Knock Off prevents Psychic- and Ghost-types like Espeon, Starmie, and Golurk from safely switching in on a predicted Close Combat. Rock Slide hits Flying- and Bug-types like Talonflame and Ninjask. Gunk Shot is an option over Rock Slide to hit Fairy-types like Sylveon. Earthquake is also an option in the last moveslot to hit Poison-types like Toxicroak, Dragalge, and Salazzle, notably OHKOing the latter as compared to Rock Slide.</p> <p>Poison- and Steel-types like Dragalge, Bronzong, and Copperajah can switch into Fairy-types like Sylveon and Comfey. They all also provide entry hazard support to help wear down Pokemon and allow Passimian to pick up KOs. Rock-types such as Aerodactyl, Diancie, and Tyrantrum are appreciated to deal with Flying-types like Ninjask, Xatu, and Talonflame. Although Passimian has Knock Off for Psychic-types, running a Dark-type like Guzzlord, Drapion, or Zoroark is encouraged to help with Pokemon like Starmie and Decidueye. Passimian helps Dark-types deal with opposing Dark-types they struggle to break with Close Combat. Psychic-types also make great teammates, as they can KO Poison-types like Salazzle, Vileplume, and Weezing. Wallbreakers like Choice Specs Exploud, Golurk, and Choice Band Flygon appreciate opportunities to come into play with U-turn. Pokemon like Sylveon, Vaporeon, and Diancie are useful clerics to remove status ailments with Heal Bell.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 262594, "username": "Milak"}]}], "writtenBy": [{"user_id": 481576, "username": "roxiee"}]}
  },
  "Palossand": {
    "overview": "<p>Palossand's forte in NU is eating physical attacks and setting Stealth Rock due to its excellent defensive typing and bulk. It's also great at checking some of the tier's common Pokemon like Copperajah, Diancie, and Bronzong. Unlike other Ground-types in the tier, like Mudsdale, Palossand does not let Xatu and Celebi in for free. It also has a reliable form of recovery in Shore Up. However, Palossand is very slow and is extremely susceptible to special wallbreakers like Exploud and Decidueye, along with many other common special threats in the tier like Rotom-C, Vaporeon, Starmie, and Blastoise.</p> ",
    "comments": "<h1>Other Options</h1> <p>Palossand can potentially run a Choice Specs set along with Trick to utilize its decent Special Attack stat. However, due to its sluggish Speed, Palossand will need to predict the right move every time to be an effective wallbreaker.</p> <h1>Checks and Counters</h1> <p><strong>Dark- and Ghost-types</strong>: Pokemon like Guzzlord, Decidueye, Dhelmise, and Golurk can make life tough for Palossand by not letting it set up Stealth Rock or heal with Shore Up. Said Ghost-types need to be mindful of Shadow Ball, however.</p> <p><strong>Bulky Grass- and Water-types: Vileplume, Vaporeon, and Blastoise are just a few common threats that can take advantage of Palossand's poor special bulk and weaknesses.</p> <p><strong>Braviary: Barring Toxic variants of Palossand, Braviary freely switches into it because of its Ghost and Ground immunities.</p> <p><strong>Special Wallbreakers</strong>: Threats like Exploud, Nasty Plot Celebi, Starmie, and Dragalge can do serious damage or even OHKO Palossand outright with their STAB attacks.</p> ",
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<h1>Set Details</h1> <p>Palossand is great at setting up Stealth Rock on common Pokemon like Diancie, Talonflame, and Bronzong. If Stealth Rock is not needed, Palossand can run Toxic to cripple common switch-ins like Vaporeon and Mantine. Colbur Berry is the preferred item to stomach one Dark-type move like Knock Off or Dark Pulse from threats like Drapion or Heliolisk. Going itemless, however, lets Palossand switch into Poltergeist users like Choice Band Golurk.</p> <p>Guzzlord has excellent defensive synergy with Palossand, as it can switch in on Ghost- and Dark-type moves from the likes of Decidueye and Drapion. Guzzlord can also switch in on the Grass- and Water-type moves that Palossand loathes. Since Grass-types like Rotom-C, Vileplume, and Decidueye offensively force out Palossand, partners like Ninjask, Expert Belt Goodra, and Salazzle are appreciated. Similarly, Water-types like Vaporeon, Blastoise, and Starmie take advantage of Palossand's lackluster special bulk. Teammates like Toxicroak, Choice Scarf Heliolisk, and Rotom-C work very well here to scare them off. Because of Palossand's ability to set up Stealth Rock on Diancie, Talonflame, and Bronzong, having a partner like Talonflame to pivot on such threats and bring in Palossand is nice. Special wallbreakers like Nasty Plot Celebi, Exploud, and Dragalge love to feast on Palossand's mediocre Special Defense. Partners like Leek Sirfetch'd or Goodra can force them out.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 298730, "username": "poh"}, {"user_id": 435989, "username": "Mariannabelle"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}]}
  },
  "Silvally-Fairy": {"sets": [{"name": "Swords Dance"}]},
  "Silvally-Ghost": {
    "overview": "<p>Silvally-Ghost is an incredibly potent wallbreaker and late-game cleaner in NU as a result of its strong Multi-Attack and ability to boost with both Swords Dance and Flame Charge. Ghost-type Multi-Attack is very hard to safely switch into, so many teams are forced to rely on blanket physical walls like Mudsdale and Guzzlord that are more vulnerable to being overwhelmed throughout the game. What holds Silvally-Ghost back, though, is its poor coverage. When faced with a foe such as Braviary that Multi-Attack won't do the job against, Silvally-Ghost typically struggles to break past it due to weak coverage moves limited to essentially Bug and Rock, and its unimpressive unboosted Attack stat amplifies this issue. Additionally, Silvally-Ghost is fairly easy to revenge kill if it doesn't get a Speed boost, which can make setting up ideal late-game sweeping scenarios somewhat difficult. It also suffers from being unable to hold a more useful item, which lessens its ability to wallbreak, and being a poor Knock Off absorber due to its Dark weakness.</p> ",
    "comments": "<h1>Other Options</h1> <p>Rock Slide lets Silvally-Ghost better deal with Braviary and retain neutral coverage against other Normal-types. Explosion turns Silvally-Ghost into more of a support option for other offensive Ghost-types, eliminating Normal- and Dark-types for them.</p> <h1>Checks and Counters</h1> <p><strong>Normal-types: Braviary is the best switch-in to Silvally-Ghost; it only fears the somewhat rare Rock Slide and Explosion and can set up alongside Silvally-Ghost with Bulk Up. Other Normal-types like Tauros and Exploud are problematic too, but +2 Flame Charge followed up by a stronger coverage attack is generally enough to get by them.</p> <p><strong>Dark-types: Drapion and Guzzlord can't reliably contend with a boosted Silvally-Ghost, but they resist Multi-Attack and can 2HKO it with Knock Off. Zoroark can OHKO Silvally-Ghost with Life Orb Dark Pulse or, if running Choice Scarf, outspeed boosted Silvally-Ghost and KO it with some chip damage.</p> <p><strong>Physical Walls: Mudsdale has a fair chance to avoid a 2HKO from even +2 Silvally-Ghost and, with some chip damage, can 2HKO in return with Earthquake. Weezing, Arcanine, and Vaporeon take significant damage from boosted Multi-Attack but threaten to burn Silvally-Ghost with Will-O-Wisp and Scald.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Despite its lack of coverage options, Silvally-Ghost's strong Multi-Attack is typically enough to carry it offensively. So, U-turn is usually run to give Silvally-Ghost more use early- and mid-game and helps it take advantage of Normal- and Dark-types like Braviary and Guzzlord. Alternatively, X-Scissor helps it muscle past defensive Guzzlord, having a good chance to 2HKO it at +2, and works better than U-turn on more offensive builds. Substitute also sees use to prevent faster revenge killers like Choice Scarf Flygon and Zoroark from dealing with Silvally-Ghost. If desired, you can opt for the combination of X-Scissor + Substitute, although this leaves Silvally-Ghost more vulnerable to revenge killers when not behind a Substitute.</p> <p>Although Silvally-Ghost can muscle past Normal- and Dark-types on its own, it still greatly benefits from the support of Fighting-types such as Sirfetch'd, Machamp, and Toxicroak to expedite the process; these teammates also help pressure blanket physical walls. In return, it deals with opposing Ghost- and Psychic-types like Decidueye and Xatu. Entry hazard setters like Diancie, Copperajah, and Garbodor are great teammates, and the latter can potentially remove recovery items from foes like Mudsdale and Drapion, making them much easier to wear down. Similarly, Xatu provides great offensive support with dual screens and Thunder Wave, which enables Silvally-Ghost to set up and sweep late-game much more easily. Other offensive Ghost- and Dark-types like Decidueye and Guzzlord can work with Silvally-Ghost to overwhelm shared checks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 211471, "username": "shiloh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Silvally-Ground": {
    "overview": "<p>Silvally-Ground is a threatening and versatile Pokemon; strong EdgeQuake coverage threatens most of the tier, and it can either act as a sweeper with Flame Charge or an offensive pivot with U-turn that successfully blocks Rotom-C's Volt Switch. It finds plenty of opportunities to come in and threaten NU staples such as Copperajah, Diancie, and Dragalge, and its bulk allows it to take one attack from walls like Vaporeon and subsequently break through them. However, its inability to hold a useful item makes it quite susceptible to status and entry hazard damage, which can interfere with its ability to sweep; it is also held back by the existence of revenge killers like Choice Scarf Inteleon and Heliolisk and First Impression Sirfetch'd.</p> ",
    "comments": "<h1>Other Options</h1> <p>Defog can take advantage of Silvally-Ground's positive matchup versus entry hazard setters like Garbodor, Copperajah, and Diancie but is generally a waste of its offensive potential.</p> <h1>Checks and Counters</h1> <p><strong>Grass-types: Rotom-C dislikes switching into Silvally-Ground's U-turn, but it is able to survive a +2 Flame Charge and OHKO back with Leaf Storm. Bulkier Grass-types like Decidueye and Dhelmise have access to recovery and can reliably fend off Silvally-Ground in the long-term.</p> <p><strong>Water-types: Vaporeon tanks one +2 Multi Attack and 2HKOes with Scald, preventing Silvally-Ground from getting an Attack and Speed boost if it is fully healthy.</p> <p><strong>Physical Walls: The combination of Stamina, Toxic, and Protect allows Mudsdale to stall out Silvally-Ground; Quagsire's Unaware lets it do the job as well. Levitate Weezing completely shuts down Silvally-Ground and cripples it with Will-O-Wisp. Talonflame's 4x weakness to Rock Slide makes it an unreliable answer, but it can revenge kill Silvally-Ground or pivot in on a Multi-Attack and chip it with U-turn.</p> <p><strong>Entry Hazards: Spikes can make it easier to offensively pressure Silvally-Ground or stall it out with Toxic poison due to its inability to run Leftovers or Heavy-Duty Boots. Toxic Spikes ruin its ability to sweep or pivot if they are not removed.</p> <p><strong>Revenge Killers</strong>: Choice Scarf Inteleon can outspeed and OHKO Silvally-Ground even after a Speed boost; Choice Scarf Heliolisk also outspeeds Silvally-Ground but cannot OHKO it. Without Flame Charge, Silvally-Ground can be revenge killed by a wider variety of fast offensive threats. Starmie and Choice Scarf Rotom-Mow can OHKO it, and Talonflame, Salazzle, and Choice Scarf Passimian are able to KO it after a moderate amount of chip damage.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Swords Dance and 120-Base Power Multi-Attack combine to make Silvally-Ground a massive offensive threat. Rock Slide takes down Flying-types like Xatu and Talonflame; it also hits Mantine super effectively but does not OHKO at +2 without prior damage. Flame Charge turns Silvally-Ground into a sweeper, letting it boost its Speed while providing a coverage move for Grass-types, albeit a weak one. U-turn, on the other hand, can wear down checks such as Vaporeon and Rotom-C as they switch in, letting its Multi-Attack more easily break them the next time it comes in.</p> <p>Spikers like Garbodor, Froslass, and the more niche Ferroseed can pave the way for a Silvally-Ground sweep, especially when paired with Knock Off users like Drapion and Passimian. Teammates that struggle with Water- or Grass-types, such as Swords Dance Talonflame and Nasty Plot Rotom-C, appreciate U-turn Silvally-Ground's ability to weaken those walls. Silvally-Ground appreciates having Flying-types like Xatu and Mantine weakened or removed before attempting to sweep; Fighting-types like Passimian and Sirfetch'd can force damage onto them and put them in range of +2 Rock Slide.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 202058, "username": "Expulso"}]}
  },
  "Silvally-Steel": {"sets": [{"name": "Utlity"}]},
  "Turtonator": {"sets": [{"name": "Shell Smash"}]},
  "Dhelmise": {
    "overview": "<p>Dhelmise is one of NU's few viable spinners thanks to its solid all-around bulk, good matchup against common Stealth Rock setters, and reliable recovery in Synthesis. Dhelmise can easily take on foes like Bronzong, Diancie, and Mudsdale thanks to its powerful STAB moves and spin their Stealth Rock away, and it's also able to answer common offensive threats such as Shell Smash Blastoise and Golurk. Sadly, Dhelmise is extremely prone to being statused by foes like Rotom-C and Vaporeon, severely cutting into its longevity and forcing it to waste turns recovering health more frequently. Additionally, Dhelmise is at times a shaky answer to the Pokemon it wants to check because of their access to super effective coverage for it, meaning it must remain at or near maximum health to be a safe switch-in, which is difficult because of its vulnerability to all forms of entry hazards. Dhelmise's poor Copperajah matchup is also notable, making it a worse hazards remover against such teams.</p> ",
    "comments": "<h1>Other Options</h1> <p>Colbur Berry is another item option that makes it harder for foes like Guzzlord and Drapion to revenge kill Dhelmise; however, it makes Dhelmise a worse response to foes like Poltergeist Golurk and Decidueye. More offensive EV spreads improve Dhelmise's Copperajah matchup and let it 2HKO foes like Dragalge and Sylveon at the cost of immense bulk. Knock Off works over Poltergeist on Spikes teams with heavy item displacement, but this makes it easier for Poison-types like Dragalge and Toxicroak to switch into Dhelmise.</p> <h1>Checks and Counters</h1> <p><strong>Dark-types: Drapion and Guzzlord can easily switch into Dhelmise's STAB attacks, force it out, and cripple whatever switches in with Knock Off. Zoroark can't switch into Dhelmise, but it can force Dhelmise out and boost with Nasty Plot on the switch.</p> <p><strong>Braviary: Braviary easily switches into Dhelmise and can use it as setup fodder with Bulk Up.</p> <p><strong>Fire-types</strong>: Arcanine is a premier defensive answer to Dhelmise thanks to its solid bulk and Intimidate and easily forces Dhelmise out. Talonflame must be cautious of Poltergeist from Dhelmise, but it threatens heavy damage with Brave Bird and a burn from Flame Body if it switches into Dhelmise's other attacks. Salazzle is a poor switch-in but scares Dhelmise out with Flamethrower.</p> <p><strong>Physical Wallbreakers: Pokemon like Tyrantrum and Sirfetch'd can switch into Dhelmise when at full health and easily OHKO it. Ghost-types like Silvally-Ghost, Spirit Shackle Decidueye, and Shadow Punch Golurk also pose a problem, since Dhelmise can't bypass their STAB moves by forgoing an item.</p> ",
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<h1>Set Details</h1> <p>Dhelmise forgoes holding an item to better check Poltergeist users like Golurk, Decidueye, and opposing Dhelmise; this also lets Dhelmise take less damage from Knock Off from the likes of Passimian and Machamp. Heavy-Duty Boots, however, gives Dhelmise a better time answering foes like Starmie, Blastoise, and Nasty Plot Rotom-C if entry hazards are up. Dhelmise runs significant special bulk investment so it can beat Pokemon like Starmie and +2 Blastoise more consistently.</p> <p>Garbodor is an excellent teammate, since Dhelmise can clear entry hazards without removing its Spikes. Garbodor also helps Dhelmise handle Fighting-types such as Sirfetch'd and Toxicroak. Dark- and Flying-types such as Guzzlord, Drapion, Talonflame, and Braviary can easily switch into Dhelmise's attacks and threaten to KO it, so checks like Diancie, Vaporeon, and Mudsdale are good partners. The former two as well as Sylveon can also offer cleric support, which lets Dhelmise switch into Scalds and Toxics with less worry. In return, Dhelmise can handle opposing Water-types for Diancie and Mudsdale.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 292388, "username": "Meri Berry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Guzzlord": {
    "overview": "<p>Guzzlord can effectively use either a wallbreaker set thanks to its nice offensive stats in conjunction with Beast Boost, its great coverage, and Choice Band to break through many defensive Pokemon like Mantine, Sylveon, and Vaporeon or a defensive set with Knock Off and Toxic and Leftovers to gain passive recovery. Additionally, its typing and weight allow it to check Copperajah and Decidueye no matter the set. Sadly, Guzzlord's poor Speed leaves it open to common wallbreakers like Sirfetch'd, Choice Specs Sylveon, and Tyrantrum. Guzzlord is also likely to be worn down because of its lack of reliable recovery, residual damage from entry hazards and Rocky Helmet, and status conditions.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Specs Guzzlord is an option given it has nice special coverage, but it faces competition with other Dragon-types like Goodra and Dragalge if it runs such a set. Dragon Tail is an option to phaze setup sweepers like Shell Smash Blastoise. A RestTalk set can be used to give Guzzlord some recovery on defensive sets and make it more self sufficient.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-types: Fairy-types like Comfey, Sylveon, and Diancie can OHKO Guzzlord with their STAB attacks but fear switching into a Heavy Slam.</p> <p><strong>Fighting-types: Fighting-types like Machamp, Passimian, and Sirfetch'd can KO Guzzlord with Close Combat. Additionally, they can utilize their Dark-type resistance to get an opportunity to switch in on Guzzlord.</p> <p><strong>Faster Wallbreakers: Faster wallbreakers like Tyrantrum, Tauros, and Goodra can all outspeed Guzzlord and threaten it with their super effective attacks.</p> ",
    "sets": [
      {
        "name": "Choice Band",
        "description": "<h1>Set Details</h1> <p>Heavy Slam allows Guzzlord to OHKO Fairy-types like Sylveon and Diancie. Earthquake hits Steel-, Poison-, and Rock-types like Copperajah, Drapion, Toxicroak, and Tyrantrum. Outrage is normally used once Fairy-types are KOed and Steel-types like Bronzong and Copperajah are in range. Dragon Claw is an option over Outrage so Guzzlord isn't locked into one move, and it can also consider another Dark-type move like Crunch to keep up damage against foes like Mudsdale and Vileplume after they're hit by Knock Off.</p> <p>Guzzlord often fits on Dragon / Fairy / Steel and Psychic / Dark / Fighting cores to help cover weaknesses. Pokemon like Sylveon, Talonflame, Xatu, and Mudsdale make great teammates to deal with Fighting-types like Sirfetch'd and Toxicroak that threaten Guzzlord. Pivots like Teleport Arcanine, U-turn Talonflame, and Flip Turn Dragalge can position Guzzlord so it's not always directly switching in and risking longevity. Poison- and Steel-types like Salazzle and Bronzong make good teammates, as they can support Guzzlord by beating and switching into Fairy-types. Psychic-types like Starmie and Celebi appreciate Guzzlord dealing with Pokemon like Bronzong, Drapion, and Copperajah.</p> "
      },
      {
        "name": "Physically Defensive",
        "description": "<h1>Set Details</h1> <p>Protect stacks Toxic damage and Leftovers recovery and scouts Choice-locked attackers like Rotom-C, Exploud, and Passimian. Earthquake allows Guzzlord to hit Pokemon that resist Knock Off like Diancie, Drapion, and Toxicroak. Furthermore, this covers Steel- and Rock-types like Copperajah and Tyrantrum. Heavy Slam is also an option to hit Fairy-types like Sylveon.</p> <p>Steel- and Poison-types like Bronzong, Copperajah, and Salazzle make good teammates and help get rid of Fairy-type threats like Sylveon for Guzzlord. Talonflame, Xatu, and Starmie can check Fighting-types for Guzzlord with their respective super effective STAB attacks. Clerics like Vaporeon and Sylveon aren't able to recover much of Guzzlord's HP due to its high HP, but they are still good for healing status ailments and recovery. Additionally, Sylveon can take on Fighting-type threats like Sirfetch'd and Passimian, while, in return, Guzzlord can deal with Steel- and Poison-types like Copperajah, Bronzong, and Salazzle that threaten Sylveon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 298730, "username": "poh"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 481576, "username": "roxiee"}]}
  },
  "Sirfetch’d": {
    "overview": "<p>Sirfetch'd stands out as a dominant Fighting-type wallbreaker in NU thanks to a decent selection of coverage moves, its ability in Scrappy, and great power, letting it heavily pressure even standard Fighting-type answers like Mantine, Vileplume, and Sylveon. Additionally, First Impression makes Sirfetch'd more dangerous, since it can OHKO faster threats like Starmie and Rotom-C. As a result, Sirfetch'd lacks much in the room of consistent defensive counterplay, especially to its strong Close Combat. As far as Fighting-type wallbreakers go, though, it faces competition from Machamp, which can match Sirfetch'd in damage output without being Choice-locked thanks to Guts and Flame Orb. Additionally, Sirfetch'd has to worry about status from Pokemon like Flame Body Talonflame and Effect Spore Vileplume, unlike Machamp.</p> ",
    "comments": "<h1>Other Options</h1> <p>Swords Dance is a viable set to allow Sirfetch'd to be even more dangerous behind dual screens on hyper offense teams. But, given Sirfetch'd's Speed tier and the immediate increase in damage output that Choice Band and Leek provide, Swords Dance is not as valuable in the long term. Using Swords Dance also means that First Impression must be sacrificed, leaving Sirfetch'd with no way of threatening faster revenge killers.</p> <h1>Checks and Counters</h1> <p><strong>Psychic-types</strong>: Starmie, Espeon, and Indeedee-F are just a few threats that force out Sirfetch'd. The former two cannot survive a First Impression, though, while the latter cannot survive any move except First Impression; which it nullifies due to Psychic Terrain.</p> <p><strong>Fairy-types: Sylveon and Comfey can come in safely on a Sirfetch'd using Close Combat or Knock Off and force it out or use it to restore lost HP. They both need to be careful of Poison Jab, however.</p> <p><strong>Flying-types: Talonflame, Mantine, and Braviary outspeed Sirfetch'd and threaten it with their respective STAB Flying-type moves. The former two also resist Close Combat, with Talonflame potentially burning Sirfetch'd via Flame Body.</p> <p><strong>Bulky Poison-types: Weezing and Garbodor have little issue switching into Sirfetch'd's attacks outside of Choice Band Brave Bird. Vileplume can also be a problem for Sirfetch'd due to Effect Spore and Strength Sap, but it is OHKOed by Brave Bird after Stealth Rock chip.</p> ",
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<h1>Set Details</h1> <p>Knock Off bothers Pokemon like Talonflame and Dragalge that may try to switch into Sirfetch'd's Close Combat. First Impression OHKOes speedier threats to Sirfetch'd like Rotom-C, Starmie, and Zoroark. Brave Bird OHKOes Vileplume after Stealth Rock chip, has an excellent chance to 2HKO Mantine, and has a decent chance to 2HKO Sylveon. However, Poison Jab can be used over Brave Bird to better hit Fairy-types like Sylveon and Comfey. Although Choice Band is usually chosen to enable Sirfetch'd's Close Combat to at worst 2HKO most of NU, Leek grants it an overall damage boost without the drawback of being locked into a move. A Jolly nature lets Sirfetch'd outspeed Adamant Choice Band Tyrantrum and neutral-natured Decidueye, while an Adamant nature can be used to guarantee 2HKOs on Mantine, Vileplume, and Sylveon.</p> <p>Partners like Copperajah, Escavalier, and Drapion deal with Psychic-types like Espeon, Starmie, and Celebi that offensively pressure Sirfetch'd. The former two partners can also handle Fairy-types that Sirfetch'd struggles with. Fairy-type teammates like Comfey and Sylveon also make great partners for Sirfetch'd. Comfey can provide Defog support and pivot with U-turn on Steel-types, which Sirfetch'd loves to face, while Sylveon can provide Wish and Heal Bell support should Sirfetch'd become weakened or statused. Teammates like Dragalge and Ninjask can also pivot on Steel-types for Sirfetch'd to handle. Like Psychic-types, Flying-types like Mantine, Braviary, and Talonflame also give Sirfetch'd problems with their respective STAB attacks. Therefore, teammates like Diancie and Choice Scarf Rotom-C can be used to pressure them right back. Rotom-C can also wear down or OHKO physically bulkier threats like Mudsdale as well.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}]}
  },
  "Indeedee-F": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}]},
  "Copperajah": {
    "overview": "<p>Copperajah's blend of offense and defense makes it a potent wallbreaker that also offers teams an awful lot defensively. Teams typically will struggle to fit a reliable defensive switch-in to Copperajah because of its great coverage, which limits otherwise reasonable checks like Guzzlord and Mudsdale to being situational switch-ins. Copperajah is also a fine Stealth Rock setter because it retains a significant offensive presence even with minimal investment, giving it plenty of chances to force foes out and set its entry hazard. Copperajah's biggest flaw, however, is how poor its longevity is. It is heavily reliant on Wish support to stay healthy and is prone to getting repeatedly weakened by pivoting moves from foes like Rotom-C, Heliolisk, Dragalge, and Ninjask, forcing it to cede momentum. It's also incredibly slow, which greatly expands the list of foes that will threaten Copperajah and force it out.</p> ",
    "comments": "<h1>Other Options</h1> <p>Iron Head can be used over Heavy Slam on Stealth Rock sets so that Glastrier can't take advantage of Copperajah as easily. Sheer Force can be considered to boost its and Rock Slide's power further. Choice Band sets sacrifice longevity for incredible wallbreaking power, but because Copperajah's Speed tier is so poor, it appreciates the extra survivability Assault Vest provides more. Play Rough immediately removes Guzzlord and prevents Scrafty from setting up against Copperajah, but it's otherwise very limited in use. Protect + Leftovers sets are solid for scouting Choice item attackers like Exploud, Guzzlord, and Passimian and increase Copperajah's self sufficiency.</p> <h1>Checks and Counters</h1> <p><strong>Heatproof Bronzong: Heatproof Bronzong is the best defensive answer available to Copperajah, taking a pittance from any of its attacks other than the rare Earthquake and using it as setup fodder for Iron Defense or Stealth Rock.</p> <p><strong>Fire-types</strong>: Arcanine reliably switches into even coverage attacks from Copperajah, outspeeds it, and threatens super effective damage in return. Talonflame is a riskier switch-in because of Stone Edge, but it can fish for burns when Copperajah uses its contact moves thanks to Flame Body.</p> <p><strong>Physical Walls: Pokemon like Mudsdale, Guzzlord, and Vileplume can contend with Copperajah but risk being hit really hard on the switch by a coverage move. Xatu stonewalls Stealth Rock Copperajah, although it can't keep up with the damage from Assault Vest variants.</p> <p><strong>Fighting-types: Pokemon like Sirfetch'd, Toxicroak, and Passimian are ineffective at switching into Copperajah, but they can take it out with their STAB Fighting-type attacks.</p> ",
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<h1>Set Details</h1> <p>Power Whip targets Ground- and Water-types like Mudsdale, Golurk, and Vaporeon and lets Copperajah revenge kill Shell Smash Blastoise. Stone Edge prevents Talonflame from safely switching in, OHKOes Salazzle, and is Copperajah's best move to hit Arcanine with. Superpower hits other Copperajah hard and chunks Guzzlord and Glastrier, although Heat Crash smashes Levitate Bronzong in addition to other foes like Rotom-C, Vileplume, and Escavalier. Earthquake can also be considered for nailing Heatproof Bronzong while retaining coverage for Salazzle and Arcanine.</p> <p>Wish and cleric support from Vaporeon or Sylveon is almost necessary, as without it, Copperajah is a much worse standalone defensive option and more vulnerable to status from the likes of Talonflame. Additionally, Vaporeon checks Fire-types like Salazzle and Talonflame, while Sylveon helps against certain Fighting-types like Sirfetch'd and Passimian. Although Copperajah's great special bulk helps it find its own chances to switch in, pivot support from Pokemon like Talonflame, Rotom-C, and Xatu ensures safer entry onto the field. Copperajah is great at forcing damage onto foes like Mudsdale, Bronzong, and Guzzlord; setup sweepers like Salazzle and Celebi benefit from this. Lastly, other slow wallbreakers like Golurk and Sirfetch'd benefit from Copperajah answering faster special attackers like Rotom-C, Starmie, and Celebi and can form a strong wallbreaking core with it.</p> "
      },
      {
        "name": "Stealth Rock",
        "description": "<h1>Set Details</h1> <p>Power Whip lets Copperajah take on Water-types like Starmie and Vaporeon and prevents Ground-types like Silvally-Ground, Golurk, and Mudsdale from switching in as easily. Rock Slide is needed to take out Talonflame, although Heat Crash can be considered for Rotom-C, Escavalier, and Levitate Bronzong. The Speed investment gives Copperajah the jump on Dhelmise, but Copperajah's Speed is very flexible.</p> <p>Copperajah is easily walled and exploited by Fire-types like Talonflame and Arcanine, so the support of Water- and Dragon-types like Starmie, Vaporeon, and Goodra is good to have. In addition, Starmie can soft check Fighting-types, Vaporeon provides Wish and cleric support, and Goodra breaks down physical walls that Copperajah draws in. In return, Copperajah checks Grass-types for the former two and Fairy-types for the latter. Copperajah forms solid defensive cores with physically defensive Pokemon like Xatu, Talonflame, and Sylveon; additionally, the former two appreciate Copperajah checking Electric-types such as Rotom-C and Heliolisk, whereas the latter enjoys help against Dragalge. Copperajah's inability to force Stealth Rock up against Xatu mandates the support of teammates like Rotom-C, Decidueye, and Silvally-Ghost that can break past it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 435989, "username": "Mariannabelle"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 336073, "username": "Rabia"}]}
  },
  "Duraludon": {
    "overview": "<p>Duraludon's wallbreaking capabilities are defined by its excellent coverage, which makes it a great Expert Belt user. Thanks to Duraludon's good Speed and Draco Meteor + Eject Pack combo, it's also able to act as a decent one-time pivot and wallbreaker. Even in unfavorable matchups against walls it can't get past alone, Duraludon is still able to safely make progress against Copperajah, Vaporeon, and Escavalier. Its serviceable physical bulk and Steel typing allow it to switch into the likes of Talonflame, Ninjask, and bulky Poison-types. However, Duraludon has very poor Special Defense, making it very vulnerable to faster special attackers such as Salazzle, Starmie, and Volt Switch users. Duraludon also faces large competition with other Dragon- and Steel-type wallbreakers like Goodra and Copperajah. Additionally, Duraludon is unable to properly check Pokemon a typical Dragon- or Steel-type would check, such as Rotom-C, Exploud, Sylveon, and more, leading to its team requiring type stacking and more compensation.</p> ",
    "comments": "<h1>Other Options</h1> <p>Choice Specs can be used to increase Duraludon's already decent wallbreaking power, scoring more OHKOs and 2HKOing Pokemon such as Vaporeon and Bronzong. Choice Specs Duraludon is more prediction reliant, however, than Expert Belt variants.</p> <p>While more matchup dependent, Iron Defense + Body Press Duraludon can serve as a usable sweeper. It's able to use its decent bulk and Steel typing to set up on non-Body Press Bronzong, Copperajah, and other passive Pokemon. It also has more longevity utilizing Leftovers, allowing it to better answer Pokemon like Ninjask long-term.</p> <h1>Checks and Counters</h1> <p><strong>Bulky Steel-types: Bulky Steel-types such as Copperajah and Escavalier can tank multiple hits and threaten heavy damage, while Bronzong can avoid a 2HKO and threaten back with devastating Body Press.</p> <p><strong>Specially Defensive Pokemon: Unless it gets very favorable damage rolls with Thunderbolt, Vaporeon has a chance to PP stall Duraludon and win one-on-one. Snorlax has the raw bulk to handle any attack from Duraludon and KO it with Earthquake. Scrafty can use Duraludon as setup fodder with Bulk Up.</p> <p><strong>Special Attackers: Special attackers such as Salazzle, Heliolisk, Rotom-C, and Starmie are all able to OHKO or heavily chunk Duraludon with their resisted attacks.</p> ",
    "sets": [
      {
        "name": "Expert Belt",
        "description": "<h1>Set Details</h1> <p>When boosted by Expert Belt, Dark Pulse 2HKOes Bronzong. Thunderbolt targets Water- and Flying-type walls like Vaporeon, Talonflame, and Mantine, and Duraludon's bulk and typing let it switch into such foes and beat them one-on-one. A Modest nature is necessary to 2HKO Bronzong and have a chance to 2HKO Vaporeon, though a Timid nature with entry hazard support can also achieve these benchmarks.</p> <p>Physical attackers like Drapion, Sirfetch'd, and Passimian can break through special walls like Copperajah and Escavalier that Duraludon struggles with. Their Knock Off support is also crucial so that walls like Vaporeon and Mudsdale are worn down enough to be threatened by Duraludon. In return, they rely on Duraludon as a switch-in to walls like Talonflame and Vileplume. Pivots like Rotom-C, Xatu, and Heliolisk work well to bring Duraludon in safely against the likes of Dragalge, Guzzlord, and Diancie. After a Draco Meteor, Duraludon is susceptible to setup sweepers, so make sure to have a good revenge killer saved; Heliolisk and Passimian are good Choice Scarf users, and priority from Sirfetch'd and Toxicroak also works.</p> "
      },
      {
        "name": "Eject Pack",
        "description": "<h1>Set Details</h1> <p>Eject Pack allows Duraludon to gain momentum for its teammates, oftentimes after claiming a KO. Dark Pulse hits Pokemon such as Bronzong and Starmie for good damage, lessening the need to use Draco Meteor, while Body Press hits Copperajah, helping teammates such as Blastoise sweep later on. Duraludon's good matchup against common entry hazard removal options like Talonflame and Xatu makes it a decent Stealth Rock setter. Alternatively, Thunderbolt can be used to better pressure bulky Water-types such as Vaporeon and Mantine. A Timid nature is preferred to outspeed base 80s such as Braviary and tie at worst with Toxicroak.</p> <p>Fighting-types such as Toxicroak and Sirfetch'd take advantage of Duraludon's checks such as Copperajah, Vaporeon, and Escavalier. They are also able to weaken and pressure shared checks in Mudsdale and Bronzong. In return, Duraludon is able to threaten bulky Poison-types such as Garbodor, Vileplume, and Dragalge. Duraludon is easily revenge killed and chunked by faster special attackers such as Salazzle, Starmie, and Electric-types, and unable to properly check Fire- and Fairy-types. Pokemon such as Diancie and Heatproof Bronzong pair nicely with Duraludon as a result. Diancie and Bronzong appreciate the extra protection against Pokemon like Decidueye, Heavy Slam Guzzlord, and bulky Poison-types. In addition, they benefit from Duraludon running Stealth Rock, allowing them to use other sets.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 503907, "username": "turtledoggo1"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}
  },
  "Glastrier": {
    "overview": "<p>Glastrier's immense Attack stat, backed up by a good STAB move and extremely useful coverage options, makes it capable of breaking through most foes. Its bulk is nothing to sneeze at either, and it can create extremely tanky Substitutes to protect itself from status and weaker hits from the likes of Vileplume and Vaporeon. Glastrier's two main problems are its poor defensive typing and very low Speed; these leave it vulnerable to the powerful STAB moves and coverage attacks of most other wallbreakers such as Sirfetch'd and Exploud, so its defensive utility is less than it appears on paper. Glastrier is also unable to make progress against certain answers such as Diamond Storm Diancie, Quagsire, and Arcanine without a lot of support. Worse yet, other stallbreakers like Salazzle and Growth Vileplume boast superior typings and Speed, so it is hard to justify Glastrier on teams given it offers little in comparison.</p> ",
    "comments": "<h1>Other Options</h1> <p>Iron Defense + Body Press is another way to sweep and is better versus Mudsdale and Copperajah in exchange for being worse versus Sylveon and Vileplume. Glastrier can run a brutal Choice Band set to immediately pressure the opposition; however, such a set is very prone to getting forced out due to Glastrier's low Speed and common weaknesses as an Ice-type. Offensive sets can drop Substitute for an extra attack, making Glastrier very hard to wall, but losing Substitute makes Glastrier more vulnerable to status and revenge killers. Taunt can be used to deny the recovery and utility moves of Pokemon like Quagsire at the cost of setting up. Endure + Custap Berry can also be used over Substitute for a surprise KO versus revenge killers. High Horsepower provides coverage for Doublade, Salazzle, and Arcanine but is otherwise inferior to Close Combat.</p> <h1>Checks and Counters</h1> <p><strong>Rock-types: Diancie is a huge concern for Glastrier given Diamond Storm breaks its Substitute and can increase Diancie's Defense. This attack can stop Glastrier sweeps while allowing Diancie itself to sweep with Body Press. Other Rock-types like Tyrantrum and Aerodactyl are threatening revenge killers with their STAB attacks.</p> <p><strong>Physical Walls: Not all walls succumb to Glastrier's boosted attacks; Unaware Quagsire especially stops all sweeps. Running into Haze Mantine, Arcanine, Doublade, or Weezing is bad news, too, given their typings and access to status moves.</p> <p><strong>Fighting-types: Wallbreakers like Sirfetch'd, Toxicroak, and Machamp are tough for Glastrier to deal with without a Substitute.</p> <p><strong>Faster Wallbreakers: Utilizing powerful STAB moves or super effective coverage, Pokemon like Goodra, Duraludon, Sylveon, and Exploud are all capable of putting decent amounts of pressure on Glastrier; the latter two even go through Substitute with their sound-based STAB attacks. Others like Salazzle and Starmie resist all of Glastrier's moves if it opts for Close Combat.</p> <p><strong>Residual Damage and Status Ailments: All entry hazards wear down Glastrier, making it harder to rely on its bulk to beat revenge killers. Similarly, being inflicted with status makes sweeping nigh impossible.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<h1>Set Details</h1> <p>Glastrier should use Substitute on forced switches or in front of passive Pokemon; the given EV spread allows Glastrier to make beefy 101 HP Substitutes that Vaporeon's Scald won't break. The EV spread also allows it to outspeed Vaporeon and other uninvested walls such as Guzzlord and Vileplume. Close Combat is the overall best coverage move available, blasting through Steel-types like Copperajah and Escavalier and hitting Water-types like Vaporeon for good neutral damage.</p> <p>Partners like Talonflame and Passimian easily draw in targets like Vaporeon and Mudsdale for Glastrier to safely set up versus; their status moves and Knock Off support, respectively, give Glastrier an easier time breaking through foes and performing a late-game sweep. Vaporeon is an excellent partner, protecting Glastrier from Fire-type attacks and passing Wishes to augment its stellar bulk. In return, Glastrier can take advantage of Pokemon that like to switch into Vaporeon like Vileplume. Glastrier is threatened by Fighting-types, so partners like Garbodor, Talonflame, and Xatu are appreciated; the latter two also provide entry hazard control.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 435989, "username": "Mariannabelle"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}
  }
}