{
  "Zacian-Crowned": {
    "sets": {
      "Offensive": {
        "description": "<p>Zacian-C is the the best Restricted Pokemon in Series 11 due to its sky-high Attack stat, great Speed, and great defensive typing. Behemoth Blade is an excellent STAB move that is able to punish Dynamax-reliant Pokemon like Venusaur and Thundurus. Sacred Sword and Close Combat maul threats that resist Behemoth Blade like Kyogre, Urshifu-S, and mainly Incineroar, which a Fairy-type STAB move wouldn't be as effective against. Sacred Sword is weaker, but its ability to get around Max Steelspike's boosts keeps it optimal, while Close Combat is an explosive attack that can OHKO physically defensive Incineroar at +1. Substitute protects Zacian-C from status conditions and Intimidate while punishing passive plays; meanwhile, Swords Dance allow Zacian-C to keep its offensive presence even after getting crippled by Intimidate and Max Wyrmwind. The Adamant nature optimizes the Attack gain from Intrepid Sword and Swords Dance, while the Speed EVs allow it to outspeed even Venusaur in sun while at +1. Its good bulk allows it to survive Venusaur's Max Quake and opposing Zacian-C's Behemoth Blade, and with dual screens support it can even survive Landorus-T's Max Quake and Venusaur's Max Flare.</p> <p>Grimmsnarl's dual screens and speed control in Scary Face allow Zacian-C to more safely pressure targets like opposing Zacian-C, Groudon, Venusaur, and Landorus-T. Thundurus can punish Intimidate from Incineroar while also boosting Zacian-C's Speed and Attack with its Max Airstream and Max Knuckle. Venusaur, Charizard, and Coalossal are all great early residual damage inflicters thanks to their G-Max Moves, which can put foes in range of Zacian-C's hits during the endgame. Landorus-T and Incineroar can stack Intimidate drops against threats like Groudon and opposing Landorus-T, protecting Zacian-C from physical attacks, while also being good Venusaur checks. Zacian-C also greatly appreciates Lapras's G-Max Resonance and its ability to OHKO Fire- and Ground-types like Landorus-T and Incineroar.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541609, "username": "Evelyie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Venusaur": {
    "sets": {
      "Chlorophyll Attacker": {
        "description": "<p>Venusaur's fantastic coverage, offensive typing, Chlorophyll, and access to G-Max Vine Lash turn it into one of the best Pokemon in the metagame. Frenzy Plant gives Venusaur the most powerful G-Max Vine Lash possible, but it trades flexibility outside of Dynamax by needing a turn to recharge. Leaf Storm, on the other hand, is a slightly less powerful Max Move and decreases Venusaur's Special Attack, but it's more flexible outside of Dynamax. Sleep Powder can disrupt the opposition and lets Venusaur potentially take the upper hand in unfavorable matchups. Weather Ball allows Venusaur to make use of the weather setup by Pokemon it's nearly always used alongside. When paired with Groudon or Torkoal, Venusaur gets Max Flare, which has a roll to OHKO most Zacian-C, and when paired with Kyogre, it gets Max Geyser, allowing it to slam Fire-types like Incineroar and Charizard. Earth Power turns into Max Quake, allowing Venusaur to threaten a KO onto Coalossal after fairly minimal prior damage and lets Venusaur boost its Special Defense. Sludge Bomb turns into Max Ooze, allowing Venusaur to boost its teams Special Attack, and it hits Grimmsnarl for a hefty amount of damage. With Life Orb and a Modest nature, Venusaur has the ability to 2HKO Rotom-H with G-Max Vine Lash and OHKO Zacian-C with Max Flare. Coba Berry improves Venusaur's matchup against Flying-types such as Landorus-T and Thundurus. Focus Sash helps against Pokemon such as Coalossal and Charizard, allowing Venusaur to threaten them with Sleep Powder after surviving any hit. When running Weakness Policy, consider running a bulkier EV spread such as 132 HP / 44 Def / 76 SpA / 4 SpD / 252 Spe with a Timid nature, which survives Thundurus's Life Orb-boosted Max Airstream unless it gets the highest possible roll. This spread also pairs especially well with dual screens support to survive powerful super effective attacks under Dynamax, (RC) and retaliate harder. A Timid nature allows Venusaur to outspeed Regieleki and +1 Thundurus under sun, whereas Modest removes these luxuries but allows Venusaur to score more OHKOs and 2HKOs, such as G-Max Vine Lash 2HKOing Rotom-H after the residual damage from the move and Life Orb-boosted Max Quake scoring an OHKO onto Gigantamax Coalossal.</p> <p>Due to Chlorophyll, Venusaur pairs well with Pokemon that are able to easily set sun for it, such as Groudon and Torkoal. Paired with Groudon, Venusaur is able to check Water-types such as Rotom-W and Kyogre that threaten Groudon, while Groudon is able to threaten Fire-types such as Rotom-H, Incineroar, and Charizard that threaten Venusaur. Torkoal, on the other hand, is the best non-Restricted Pokemon to set sun for Venusaur, freeing the team to run another dangerous Restricted Pokemon such as Zacian-C or Kyogre, and it can provide additional support with Yawn or Burning Jealousy. Venusaur also pairs well with another beneficiary of the sun in Charizard because it's oftentimes able to weaken the opposition with its sheer power, allowing Venusaur to clean up. Kyogre is an amazing partner for Venusaur; although contradictory to Chlorophyll being a rain setter, it's able to take advantage of Venusaur’s Max Ooze boosts and threaten Fire-types that Venusaur struggles against. Grimmsnarl is capable of setting dual screens to help Venusaur's fairly mediocre bulk and can provide speed control with Scary Face or Thunder Wave, leaving Venusaur not completely reliant on sun. Venusaur pairs excellently alongside Porygon2 for its ability to help handle threats to Venusaur such as Landorus-T with Ice Beam and weaken Rotom-H via Eerie Impulse. Landorus-T can also be a nice teammate for Venusaur, being able to threaten opposing Charizard and Rotom-H with Rock-type coverage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 547596, "username": "Helios of Sun"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Charizard-Gmax": {
    "sets": {
      "Gigantamax": {
        "description": "<p>Gigantamax Charizard is among the metagame's best Pokemon for its ability to melt nearly everything under sun, access to G-Max Wildfire, and positive matchups versus other common Pokemon such as Venusaur and Zacian-C. Due to Heat Wave's spread move status and Charizard's power, it's generally the best option for it to use outside of Dynamax, and during Dynamax, it grants Charizard access to G-Max Wildfire and its incredibly powerful residual effect. Hurricane grants Charizard the strongest Max Airstream, allowing it to boost its Speed and snowball with its immense power. Hurricane's poor accuracy in the sun isn't much of a problem, since Charizard rarely needs to use it outside of Dynamax. Alternatively, Air Slash is a decent alternative option that gives Charizard a move with greater consistency; however, the situations where Air Slash is better than Hurricane are niche, but the additional power Hurricane grants is also fairly niche. Blast Burn grants Charizard the strongest possible G-Max Wildfire, making it capable of OHKOing Porygon2 when holding Life Orb under sun. Due to Blast Burn's recharge penalty, its only reasonably justifiable to run it alongside another Fire-type move. Ancient Power is specifically useful to take out opposing Charizard with Max Rockfall, though Max Rockfall does replace sun and weakens Charizard significantly. Scorching Sands gives Charizard access to Max Quake, which destroys Dynamaxed Coalossal under sun, one of the few Pokemon it fails to very meaningfully threaten otherwise, and it's also useful for boosting Charizard's Special Defense. Life Orb grants Charizard cataclysmic levels of power, allowing it to OHKO both Incineroar and Dynamaxed Landorus-T under sun with G-Max Wildfire and Max Quake, respectively. Safety Goggles is immensely useful for an immunity to Venusaur's Sleep Powder. Lum Berry protects Charizard from the aforementioned Sleep Powder as well as Thunder Wave from support Thundurus and Grimmsnarl, but the downside of being a one-time use leaves Charizard susceptible to being hit by multiple status moves after it's been used. Assault Vest is another good option to improve Charizard's matchup versus special attackers such as Regieleki, Calyrex-S, and opposing Charizard. With Assault Vest, consider a bulkier EV spread such as 4 HP / 4 Def / 188 SpA / 60 SpD / 252 Spe with a Timid nature, which survives Dynamaxed Regieleki's Max Lightning. Wacan Berry is a niche option that helps against Regieleki and Thundurus, though Charizard's other options are generally more useful.</p> <p>Charizard's longing to be under sun makes Drought Pokemon such as Groudon and Torkoal great teammates. Torkoal is the best non-Restricted Pokemon to set sun, freeing the team to run another dangerous Restricted Pokemon, usually Zacian-C. Venusaur is phenomenal alongside Charizard, as both love being under sun, with Venusaur checking some of Charizard's biggest threats like Regieleki and Kyogre. Regieleki is another great teammate to Charizard for being one of best answers to Kyogre teams and providing speed control with Electroweb. Ground-types such as Groudon and Landorus-T make good partners for Charizard, as they check Coalossal effectively, while Charizard can tackle common Ice- and Grass-types such as Calyrex-I, Rillaboom, and Kartana. Charizard pairs well with Grimmsnarl thanks to its dual screens support helping with Charizard's mediocre bulk, and it can also provide Charizard speed control via Thunder Wave or Scary Face. Prankster Pokemon with access to Sunny Day such as Sableye and Whimsicott can be used in lieu of a Drought Pokemon, both providing the weather and speed control that Charizard demands.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Blastoise": {
    "sets": {
      "Gigantamax": {
        "description": "<p>Blastoise is a unique Pokemon in Series 11 for its access to G-Max Cannonade, ability to pressure foes with Yawn, and strong matchups against metagame staples such as Incineroar, Charizard, and Landorus-T. Blastoise is able to dish out large amounts of damage with G-Max Cannonade's powerful residual effect, and Hydro Cannon gives Blastoise the strongest possible G-Max Cannonade, and being inflexible outside of Dynamax doesn't matter much since Blastoise often is the one Dynamaxing on the team. Blizzard gives Blastoise the strongest possible Max Hailstorm against threats such as Venusaur, Dragapult, and Rillaboom, 2HKOing Dynamaxed Dragapult. Ice Beam can be used for more consistency outside of Dynamax, which is especially relevant given that the hail set by Max Hailstorm is often replaced, leaving Blizzard inaccurate. Blastoise can pressure Dynamaxed Pokemon with Yawn reliably thanks to its natural bulk, threatening to waste their Dynamax turns. Fake Out, Helping Hand, and Terrain Pulse are all more niche options that can be run over preferably Protect but also Yawn. Fake Out gives Blastoise's teammates opportunities to set up or get a strong attack off. Helping Hand allows Blastoise to boost the power of its teammates such as Zacian-C unimpeded due to its high priority. Terrain Pulse allows Blastoise to hit Water-types such as Kyogre, Gastrodon, and opposing Blastoise super effectively when paired with Rillaboom's Grassy Surge. Aqua Jet is an alternative option over Yawn on Coalossal teams so that Blastoise can best position itself to activate Coalossal's Weakness Policy and Steam Engine. Wacan Berry improves Blastoise's matchup against Regieleki and offensive Thundurus. Alternatively, Life Orb boosts Blastoise's damage output immensely, enabling it to 2HKO Gigantamax Venusaur and Dynamaxed Rillaboom with Max Hailstorm. Blastoise's given Speed investment outspeeds paralyzed Calyrex-S and also outspeeds it at +2, both of which are relevant given that support Thundurus and Landorus-T that can boost its Speed with Max Airstream are common partners.</p> <p>Blastoise is most commonly paired with Zacian-C to pressure Pokemon such as Incineroar, Rotom-H, and Landorus-T for it, while Zacian-C checks Rillaboom for Blastoise. Furthermore, the residual damage from G-Max Cannonade can set Zacian-C up to sweep late-game. Incineroar checks Grass-types such as Venusaur, Amoonguss, and Rillaboom and offers Blastoise Fake Out pressure. Grimmsnarl's dual screens support and speed control allow Blastoise to pressure foes more easily. Support Thundurus pairs similarly well with Blastoise, as it can provide speed control and support in Eerie Impulse to help Blastoise better take on threats such as Venusaur and Regieleki. Landorus-T is very frequently paired with Blastoise, as it checks Regieleki and Grass-types. Rillaboom smacks Water-types such as Gastrodon, Tapu Fini, and Kyogre, which Blastoise struggles to damage. Coalossal deals with threats to Blastoise like Thundurus and Venusaur, and Blastoise in return can check Ground-type threats to Coalossal like Landorus-T, as well as activate Coalossal's Weakness Policy and Steam Engine via Aqua Jet.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Umbreon": {
    "sets": {
      "Support": {
        "description": "<p>Umbreon is a sturdy wall in the metagame thanks to its great defenses and good typing, allowing it to easily withstand attacks from common Pokemon such as Groudon, Venusaur, and Dragapult. Foul Play takes advantage of the high Attack stats of Restricted Pokemon and deals very acceptable damage to them, such as on Groudon and Calyrex-I. Snarl allows Umbreon to slow down strong specially attacking threats such as Calyrex-S and Kyogre. Yawn makes Umbreon demand respect unlike most other defensive Pokemon, as sleep is generally an oppressive mechanic and can also completely shut down Dynamax for at least a turn, forcing the Pokemon to switch out in order to prevent it and wasting their Dynamax. Moonlight semi-reliably heals 2/3 of Umbreon's HP under sun, which is fantastic for a defensive Pokemon that is usually paired with Groudon. Moonlight can prove to help Umbreon win against Pokemon such as Calyrex-S and Kyogre under sun due to being able to play a very long game with them, 2HKOing the former and slowly chipping the latter down. Helping Hand allows Umbreon to bypass its lack of offensive presence by powering up an ally such as Groudon. Protect helps Umbreon stall opposing Dynamax turns more effectively. Sitrus Berry allows Umbreon to heal off a good amount of damage immediately, while Leftovers allows it to play the slow game when healing alongside Protect or Moonlight. The EV spread allows Umbreon to always survive Modest Kyogre's Water Spout under rain and Brave Calyrex-I's Max Hailstorm.</p> <p>Umbreon appreciates partners such as Groudon that can set sun, helping Umbreon heal a substantial amount with Moonlight, and Umbreon in turn gives Groudon room to set up with Swords Dance via Yawn and can shoot its damage up even higher with Helping Hand. Charizard is another good Umbreon partner that also loves being in the sun. It offsets Umbreon's weakness to Zacian-C and both Urshifu formes with its G-Max Wildfire and Max Airstream, respectively. Grimmsnarl makes Umbreon even more problematic by bolstering its bulk via dual screens support and serves as a secondary check to both Urshifu formes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Porygon2": {
    "sets": {
      "Trick Room Support": {
        "description": "<p>Porygon2 is the metagame's best Trick Room setter with its incredible bulk, mere one weakness, and ability to keep top-tier Pokemon at bay, such as Calyrex-S and Landorus-T. Trick Room is invaluable speed control for almost any team, and Porygon2 sets Trick Room reliably thanks to its immense bulk. Recover gives Porygon2 longevity, letting it stall out Dynamax turns and potentially help it serve as a late-game wincon, outlasting foes. Eerie Impulse is immensely useful to impede the metagame's various special attackers such as Calyrex-S, Rotom-H, and Kyogre. Tri Attack is oftentimes less critical than Porygon2's other options, but its the best option versus Pokemon such as Urshifu-R and Incineroar that aren't vulnerable to Porygon2's coverage or Eerie Impulse. Ice Beam makes Porygon2 one of the best checks to one of the metagame's most potent threats, Landorus-T, and it also deals decent damage to the likes of Groudon and Venusaur. Foul Play allows Porygon2 to threaten a 2HKO onto Calyrex-S and hit boosted Weakness Policy users such as Solgaleo, Calyrex-I, and Metagross quite hard. Download is good because it gives Porygon2 a Special Attack boost pretty often, considering common Pokemon such as Incineroar, both Urshifu formes, and Landorus-T have higher Defense stats. Trace should only be run if Porygon2 chooses Eerie Impulse and Foul Play as its last two moves. Trace will be more advantageous than disadvantageous most of the time, mainly due to the potential of copying Intimidate from users such as Incineroar and Landorus-T. Thunderbolt is an option for Porygon2's third moveslot, giving Porygon2 BoltBeam coverage with Ice Beam and allowing it to more immediately threaten the likes of Charizard, Blastoise, and Kyogre, and unlike Eerie Impulse, its not shut down by Taunt. However, its overall less useful then Eerie Impulse. Note that when running Thunderbolt, Porygon2 should elect for a Modest nature to best make use of its BoltBeam coverage. Icy Wind is alternative speed control over Trick Room, though oftentimes Trick Room is simply going to be more valuable. Shadow Ball has the advantage over Foul Play of being able to OHKO Calyrex-S after a Download boost, but it's worse versus boosted Weakness Policy users. Ally Switch is an option over one of the last two moveslots, giving Porygon2 the ability to redirect attacks from its teammates, though its incredibly difficult to justify Ally Switch due to it taking a valuable slot. A physically defensive EV spread is preferred for Porygon2 to better set Trick Room in the face of powerful physical attackers such as Urshifu-S and Zacian-C, and the given EVs allow Porygon2 to survive Adamant Zacian-C's Close Combat with the remainder thrown into Special Defense. A specially defensive EV spread such as 252 HP / 144 Def / 112 SpD with a Sassy nature is also a good option, which allows Porygon2 to live extremely powerful special attacks such as Calyrex-S's Helping Hand- and Life Orb-boosted Max Mindstorm and Kyogre's Mystic Water-boosted 150 BP Max Geyser. A Modest nature with some Special Attack investment can make Porygon2 notably more threatening with a Download boost, though this of course compromises its bulk.</p> <p>Porygon2 makes a great fit on sun teams with either Torkoal or Groudon alongside Venusaur because they greatly appreciate its role compression as a check to Landorus-T with Ice Beam, as well as Calyrex-S and Rotom-H with Eerie Impulse. Furthermore, the combination of Porygon2 with the aforementioned Pokemon is quite flexible between Porygon2's ability to set Trick Room or swap into a Drought setter to activate Venusaur's Chlorophyll, which has the threat of both Dynamax and Sleep Powder at its disposal. Incineroar pairs extremely well with Porygon2 with its Fake Out capable of helping it set Trick Room. Other good Restricted Pokemon to pair with Porygon2 are Kyogre and Zacian-C, the former being a heavy hitter that can benefit greatly from Trick Room and the latter appreciating its ability to check Landorus-T.</p>"
      },
      "Offensive Support": {
        "description": "<p>Contradictory to Porygon2's massive bulk with Eviolite, it can run a more niche, albeit effective offensive set. Download and Analytic activate fairly consistently, and alongside Special Attack investment and occasionally Dynamax Porygon2 can be a threat in of itself. Tri Attack is simply a consistent STAB move, whereas Hyper Beam gives Porygon2 the strongest possible Max Strike, though it's less flexible outside of Dynamax and Porygon2 tends to stay on the field for a long time. Shadow Ball threatens Calyrex-S, one of the metagame's most dangerous Pokemon. Ice Beam on the other hand lethally threatens Landorus-T and deals good damage to the likes of Groudon and Venusaur. Running either Trick Room or Icy Wind is invaluable for speed control and should be used respectively of which would benefit your team more. Recover is incredibly useful, granting Porygon2 longevity and allowing it to serve as a late-game wincon by outlasting foes and stalling out Dynamax turns. Alternatively, Ally Switch allows Porygon2 to redirect attacks from its partners, but this gives up Recover's longevity. Thunderbolt is a coverage option that slams the likes of Charizard, Tapu Fini, and Blastoise fairly hard, though its difficult to justify over Porygon2's generally more important coverage options. Download should be used if Porygon2 has Trick Room, and it should instead have Analytic instead when running Icy Wind, as Analytic will not consistently activate under Trick Room.</p> <p>Porygon2 is generally seen on compositions with Zacian-C, Gigantamax Lapras, and sometimes Grimmsnarl. Offensive Porygon2 compromises its bulk, so dual screens setters such as the aforementioned Gigantamax Lapras and Grimmsnarl are good partners. The former has a great Landorus-T matchup, freeing Porygon2 from running Ice Beam, while the latter also packs other useful support moves like Fake Tears to help Porygon2. Note that Lapras and Grimmsnarl can be run together, but Grimmsnarl should not be running dual screens when doing so.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Torkoal": {
    "sets": {
      "Defensive": {
        "description": "<p>Torkoal has a high Defense stat that allows it to easily handle the offensive threats that are among the most present in the metagame like Zacian-C, Incineroar, and Rillaboom. In a metagame that relies heavily on weather, Drought allows Torkoal to cause trouble for teams based on rain. Burning Jealousy hits common Steel-types such as Zacian-C and Solgaleo while threatening a burn on physical attackers that tend to boost their stats with Max Moves, such as Landorus-T and Thundurus. Body Press takes advantage of Torkoal's high Defense stat, allowing it to ignore Intimidate and heavily damage Incineroar. Yawn allows Torkoal to threaten to waste opposing Dynamax turns and slow down the momentum of opposing strategies thanks to its good bulk. The EV spread allows Torkoal to survive three +1 Sacred Swords from Zacian-C, a +1 Earth Power from Venusaur, and a Wicked Blow from Choice Band Urshifu-S.</p> <p>Zacian-C is Torkoal's most common Restricted partner, which takes care of Pokemon such as Porygon2 and Urshifu-S against which Torkoal can't do much. Torkoal in turn handles opposing Zacian-C. Torkoal is very commonly paired with Charizard and almost always with Venusaur as Drought allows the former to deal very large amounts of damage with its powerful Solar Power-boosted G-Max Wildfires and the latter to fire off fast Sleep Powders and G-Max Vinelashes. In the case of a team with a Trick Room setter, Whimsicott and Calyrex-I are good partners for Torkoal, as Burning Jealousy will always burn against Zacian-C since it burns Pokemon that have had a stat boost, allowing Calyrex-I to better resist Behemoth Blade.</p>"
      },
      "Offensive": {
        "description": "<p>Through the combination of Charcoal, Drought, and STAB Eruption, Torkoal is capable of acting as one of the most powerful Trick Room sweepers in the Series 11 metagame. Eruption is an incredibly powerful option for Torkoal, especially since under Trick Room it will almost always act first, allowing it to act as a mini-Kyogre and fire off a 150 BP STAB weather-boosted spread move, OHKOing even the bulkiest of Zacian-C and heavily damaging Dynamaxed Calyrex-I. Consequently, offensive Torkoal tend to opt for Charcoal as their item instead of Life Orb, since they will almost always be using Fire-type moves and do not want to reduce Eruption damage with Life Orb recoil. Charcoal Torkoal often opts for a second spread Fire-type move as an alternative choice for after it has been weakened enough to meaningfully reduce Eruption damage. Heat Wave is the most common choice due to its superior power, but some offensive Torkoal will opt for Burning Jealousy instead due to its perfect accuracy and ability to work as a support option against leads such as Zacian-C and Defiant Thundurus. However, a major downside for Burning Jealousy is that it runs the risk of missing out on KOs that Heat Wave would be able to reach, such as against Zacian-C with 4 HP EVs. To round out the moveset, many Charcoal Torkoal opt for Earth Power as a means of providing an attacking option against Incineroar, Coalossal, and opposing Torkoal, while others choose to run Yawn to put pressure on Dynamax Pokemon and provide a supportive option if Torkoal has its Special Attack dropped or if the weather gets changed from sun. While Charcoal is typically the preferred item for offensive Torkoal, which will run Protect as the fourth move, some opt to instead run Choice Specs in order to maximize the power of Eruption and will use a fourth attacking move instead of Protect such as Solar Beam.</p> <p>Due to having one of the lowest Speed stats in the metagame, offensive Torkoal excels on teams that are either wholly dedicated to Trick Room or have a strong Trick Room option. Consequently, it is almost always paired with one of the three common non-Restricted Trick Room setters in the format: Porygon2, Mimikyu, and Dusclops. Common Restricted partners for offensive Torkoal are those that excel in Trick Room, such as Calyrex-I and Necrozma-DM, although it is also possible to use offensive Torkoal on teams using a Restricted Pokemon such as Zacian-C alongside a Trick Room mode. Many teams using offensive Torkoal will also opt to run Gigantamax Venusaur, giving the team an alternative \"fast mode\" where Torkoal can both support the incredibly strong Gigantamax Venusaur outside of Trick Room and act as a Trick Room attacker during different phases of the match. Some teams will opt to go all in on sun and run Gigantamax Charizard alongside, or instead of, Venusaur to provide massive damage potential with double sun-boosted attacks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 532762, "username": "yone"}, {"user_id": 426995, "username": "Namuko Pro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518634, "username": "Sole Survivor"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Kyogre": {
    "sets": {
      "Mystic Water": {
        "description": "<p>Kyogre's high Special Attack, powerful rain-boosted Water-type attacks, and good bulk make it one of the biggest restricted threats. Water Spout is a devastating spread move, being able to OHKO the likes of Zacian-C, Calyrex-S, and Incineroar. Origin Pulse is a powerful, although inaccurate, backup to Water Spout after Kyogre has been harmed, while Scald is a weaker but consistent option with a chance to burn threats like Zacian-C. Ice Beam is mainly useful for Max Hailstorm, to let Kyogre best contend with the likes of Gigantamaxed Venusaur and Dynamaxed Dragapult, threatening a 2HKO on both. Alternatively, Thunder hits opposing Kyogre and turns into Max Lightning, blocking Yawn from Umbreon and Spore from Amoonguss but leaving Kyogre more vulnerable to Grass-types. Mystic Water boosts Kyogre's Water-type attacks with no drawbacks, as opposed to Life Orb's recoil lowering Water Spout's damage. A Timid nature allows Kyogre to outspeed Calyrex-S and Zacian-C at +1 from Tornadus's Max Airstream, as well outspeed them when they are at -1 from Regieleki's Electroweb, while Modest lets Kyogre OHKO Thundurus with Water Spout while also having a chance to OHKO Zacian-C.</p> <p>Tornadus is a staple partner to Kyogre, as it can offer speed control with Tailwind and Max Airstream and check Grass-types such as Venusaur and Rillaboom. In return, Kyogre's rain turns Hurricane into a sure-hit move. Dragapult helps handle threats to Kyogre like Venusaur and Regieleki and offers speed control with Max Airstream. Venusaur, although near requiring the support of the anti-synergistic Torkoal, is an amazing partner for Kyogre, as it checks Regieleki well, while Kyogre can help deal with Ground- and Fire-types such as Landorus-T and Incineroar. Grimmsnarl's dual screens support and speed control help Kyogre pressure the opponent more safely. Porygon2 can weaken threats to Kyogre such as Zapdos and Venusaur with Eerie Impulse and set Trick Room, meaning Kyogre should exchange its speed for bulk if paired with it. Incineroar can check Venusaur and Amoonguss for Kyogre and also offers Fake Out pressure. Regieleki pairs excellently with Kyogre, for it provides speed control with Electroweb while Kyogre can destroy Ground-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541609, "username": "Evelyie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Groudon": {
    "sets": {
      "Swords Dance": {
        "description": "<p>In a metagame where Restricted Pokemon run rampant and the premier teams are sun teams, Groudon is easily a top contender. While Groudon is certainly threatening by itself, it's so good more because Drought serves as a catalyst for two of the metagame's most dangerous Pokemon, those being Charizard and Venusaur. Precipice Blades is Groudon's strongest STAB move and gives it access to Max Quake to boost its weaker Special Defense. Groudon has more consistent STAB options, but there is simply too much opportunity cost to reasonably justify them. Rock Slide gives Groudon means to hit Flying-types such as Zapdos and Yveltal, and most critically it threatens an OHKO against Dynamaxed Charizard via Max Rockfall. Swords Dance is useful for offsetting Intimidate from the likes of Landorus-T and Incineroar, and thanks to Groudon's bulk, it can oftentimes get one or even multiple boosts. Sitrus Berry improves Groudon's longevity as a bulky Swords Dance user and support Pokemon to Charizard and Venusaur. Alternatively, Groudon can run White Herb in order to offset Intimidate and make itself generally more threatening; however, Groudon oftentimes doesn't need to be more threatening because its teammates do that job. The given EV spread allows Groudon to outspeed -1 Thundurus and outspeed Tornadus while at +1, both of which are relevant given Groudon is often paired with Charizard, which can use Max Airstream, and Electroweb Regieleki.</p> <p>Groudon should always be paired with Venusaur and almost always with Charizard; there is simply little reason to not use Pokemon that are so powerful in the sun. Venusaur helps Groudon by thwarting Water-types such as Rotom-W, Blastoise, and Kyogre. In return, Groudon can thwart Fire-types like Incineroar and Coalossal. Charizard can assist Groudon by checking Grass-types such as Rillaboom and Venusaur, while Groudon can check Regieleki and Coalossal for Charizard. Regieleki is a great teammate for being one of the best answers to Kyogre teams, and it can also provide Groudon speed control with Electroweb. Grimmsnarl can provide dual screens to bolster Groudon's already good defensive stats, which can help it set up with Swords Dance more safely. Grimmsnarl can also mitigate Groudon's middling Speed via Scary Face or Thunder Wave. Porygon2 is a great partner for Groudon because it's a great check to Landorus-T with Ice Beam, most importantly, and also Calyrex-S with Eerie Impulse, which are both Pokemon that can greatly trouble Groudon teams. Porygon2 can also provide speed control to Groudon with Trick Room. Incineroar supports pretty much every Pokemon well and Groudon is no exception, appreciating Incineroar's ability to keep the likes of Venusaur, Rillaboom, and Calyrex-S in check if it's running Assault Vest. Umbreon is one of the best answers to Calyrex-S and also a solid answer to Calyrex-I, both of which can greatly trouble Groudon and its common teammates. Note that running Umbreon gives up the ability to reasonably justify Porygon2, which compromises the matchup against Landorus-T.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Rotom-Heat": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Rotom-H's strong matchups into sun threats like Venusaur and Charizard, as well as Zacian-C, give it a strong niche. Overheat is Rotom-H's strongest STAB move and, when Dynamaxed, becomes Max Flare, which sets sun, powering up Overheat and reducing the power of opposing Water-types like Kyogre and Tapu Fini. Nasty Plot allows Rotom-H to OHKO Pokemon like Landorus-T, Groudon, and Thundurus with boosted Max Flare, and it also compensates for Overheat's Special Attack drop. Ally Switch allows Rotom-H to redirect attacks like Zacian's Behemoth Blade or Venusaur's Sleep Powder to itself. Safety Goggles gives Rotom-H protection against Venusaur's and Amoonguss's powder moves, while Sitrus Berry provides some recovery; however, protection against Venusaur's Sleep Powder is usually preferred .</p> <p>Rotom-H fits best on Zacian-C teams that appreciate its ability to check sun threats like Venusaur and Charizard, as well as opposing Zacian-C. Landorus-T checks Coalossal for Rotom-H while Rotom-H checks opposing Ice-types like Calyrex-I. Both Landorus-T and Rotom check many of the same things like Venusaur, Charizard, and Zacian, giving it them flexibility and insurance against these threats. Rillaboom checks Water-types like Kyogre and appreciates Rotom-H's ability to check Zacian-C, Charizard, and Calyrex-I. Prankster Pokemon like Grimmsnarl and Thundurus reduce the damage Rotom-H takes from opponents with dual screens support and Eerie Impulse, and can provide it with speed control in the form of Scary Face and Thunder Wave. Gastrodon can protect Rotom-H from opposing Water-types such as Blastoise and Lapras with Storm Drain and check Landorus-T while Rotom-H checks common Grass-types like Venusaur and Rillaboom for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541224, "username": "He-who-is-not-to-be-named"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}]}
  },
  "Palkia": {
    "sets": {
      "Offensive": {
        "description": "<p>Palkia, while certainly not the most popular Restricted Pokemon, definitely has a niche in Series 11 for its strong matchup against Kyogre teams, respectable bulk, and considerable offensive prowess. Palkia's STAB combination is excellent, as few Pokemon resist it; both Max Geyser and Max Wyrmwind are quite useful, as Max Geyser sets up rain and Max Wyrmwind lowers the Attack of opposing Pokemon, such as Calyrex-I and Zacian-C. Earth Power is a useful coverage move when Palkia is Dynamaxed, as Palkia can OHKO Zacian-C with Life Orb Max Quake, and it boosts Palkia's Special Defense. Trick Room can turn the tables in Palkia's favor when facing faster paced teams. Life Orb's stronger power boost is preferable because it also boosts Max Quake; however, if another teammate wants to run Life Orb, Lustrous Orb can be used instead. Palkia can also run more Speed investment, as it has a nice base 100 Speed stat, which is faster than Kyogre, Kyurem-W, Reshiram, and both Urshifu formes. However, a bulkier EV spread is usually preferred, as Palkia fits well on bulky Trick Room teams.</p> <p>Since Palkia struggles with Zacian-C, as well as Grass-types that are supported by Grimmsnarl's Light Screen like Venusaur and Amoonguss, it appreciates partners that can check the aforementioned Pokemon like Incineroar and Rotom-H, and they appreciate Palkia's ability to check Landorus-T and Kyogre in return. Regieleki appreciates Palkia checking Ground-types for it, and provides Palkia with speed control via Electroweb. Ferrothorn gives Palkia teams a strong win condition with Iron Defense and Body Press and appreciates Palkia's ability to check Fire-types for it. Grimmsnarl helps Palkia stay alive longer with dual screens, as well as providing speed control with either Scary Face or Thunder Wave. Porygon2 also provides speed control with Trick Room, allowing Palkia to more freely drop Trick Room in favor of Protect, and it can weaken opposing special attackers like Venusaur and Dialga with Eerie Impulse.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541224, "username": "He-who-is-not-to-be-named"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 241023, "username": "dhelmise"}]}]}
  },
  "Whimsicott": {
    "sets": {
      "Utility": {
        "description": "<p>Being the fastest Prankster Pokemon in the game with a deep supportive movepool, Whimsicott establishes itself as one of the best utility Pokemon in the current metagame. Prankster allows Whimsicott to have a priority Tailwind, allowing it to boost its team's Speed against faster restricted Pokemon such as Zacian-C and Calyrex-S, while gen 8’s dynamic speed mechanics make Tailwind users like Whimsicott very potent. Moonblast is able to deal good damage to Fairy-weak Pokemon such as Urshifu-S. Taunt allows Whimsicott to prevent Trick Room from Porygon2 and Mimikyu as well as Venusaur's Sleep Powder, Amoonguss's Spore, and Rotom-H's Will-O-Wisp. Helping Hand allows Whimsicott to still play a supportive role while facing common Fake Out Pokemon like Incineroar and Rillaboom while also making up for Whimsicott's lack of offensive presence. Focus Sash allows Whimsicott to take a move which it wouldn't be able to. Alternatively, the combination of Switcheroo and Eject Button can be run to get rid of your opponent's Dynamax if properly timed.</p> <p>Whimsicott usually plays a supportive role on the team enabling common partners like Calyrex-S, Thundurus,and Charizard to excel with its supportive moves. Whimsicott is able to provide Tailwind and Cotton Spore for Calyrex-S while also keeping Dark-types such as Urshifu-S in check. Thundurus is able to take care of Incineroar for Whimsicott while Whimscott provides Helping Hand. Charizard and Whimsicott synergize well due to Whimsicott providing Charizard with Sunny Day and Fake Tears while Charizard keeps Zacian-C in check for Whimsicott.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 554354, "username": "pix"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Amoonguss": {
    "sets": {
      "Utility": {
        "description": "<p>Amoonguss's good bulk and good utility make it a great support Pokemon with the tools to deal with the majority of the metagame. Clear Smog resets the boosts of Geomancy Xerneas and Cosmic Power Eternatus. Amoonguss will always carry Rage Powder, redirecting powerful attacks such as Zacian's Behemoth Blade and Regieleki's Thunder away from its common allies like Xerneas and Kyogre. Spore is used to disrupt the enemy team with sleep while also breaking Trick Room setups. Other options are Pollen Puff to heal your own Pokemon and Grass Knot to hit Groudon and Kyogre hard. Amoonguss will usually carry a Mental Herb to shake off Taunt from threats such as Whimsicott, Tornadus, and Incineroar, but it can also run an Occa Berry to survive Groudon's Heat Crash, Volcarona's Overheat, and Incineroar's Flare Blitz and put them to sleep in return. Regenerator provides Amoonguss longevity, while its EV spread makes it survive a +1 Behemoth Blade from Zacian-C and a Hurricane from Tornadus, although it can never survive a Calyrex-S Expanding Force. Unfortunately, Amoonguss's low offensive presence makes it rely heavily on its partners to deal significant damage. This makes Volcarona and Rillaboom often preferred over it.</p> <p>Amoonguss is a great partner for Zacian-C and Xerneas, since both Pokemon appreciate its redirection and support for setting up or preserving their health. Kyogre is another good option, since its rain weakens Fire-type moves. Fire-types such as Entei and Incineroar are also appreciated, since they can power through opposing Grass-types like Rillaboom and Tsareena easily, which can disrupt Amoonguss because they're immune to Rage Powder and Spore. Landorus, Palkia, and Urshifu-R are other good allies to KO opposing Fire-type Pokemon such as Incineroar and Volcarona.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541609, "username": "Evelyie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Tornadus": {
    "sets": {
      "Offensive Tailwind": {
        "description": "<p>Tornadus finds itself as a critical component of many Kyogre teams, supporting them with Prankster Tailwind and its immense offensive pressure. Hurricane is fully accurate under Kyogre's rain, and it allows Tornadus to boost its team's Speed with Max Airstream. Tailwind is invaluable speed control that is particularly strong alongside Kyogre, letting it outspeed and nearly 2HKO or OHKO the entire metagame. Heat Wave provides Max Flare, which immensely benefits Chlorophyll Venusaur. Dark Pulse gives Tornadus a means to OHKO Dynamaxed Calyrex-S with Max Darkness, and its Special Defense lowering effect can be taken advantage of by Kyogre. Icy Wind provides additional speed control, but it is harder to justify over other options.</p> <p>Tornadus should always be paired with Kyogre and helps it greatly by providing Tailwind and checking Grass-types such as Venusaur, Amoonguss, and Rillaboom. Typical partners to this pair include Venusaur to answer Regieleki, Torkoal to enable Chlorophyll Venusaur, and the support Pokemon Incineroar and Grimmsnarl. Note that on of the support Pokemon could instead be a more offensive Pokemon such as Choice Band Urshifu-S or Regieleki. The former is a powerful threat that benefits immensely from Tailwind, while the latter appreciates Tornadus checking Grass-types.</p>"
      },
      "Tailwind Support": {
        "description": "<p>Tornadus is an amazing support Pokemon for many Kyogre teams, able to put on incredible offensive pressure and support its team with Tailwind, Taunt, and Icy Wind. Hurricane is a powerful and consistent STAB move under Kyogre's rain that becomes Max Airstream, letting Tornadus boost its team's Speed. Tailwind is indispensable speed control that pairs really well with Water Spout Kyogre. Taunt allows Tornadus to shut down status moves from the likes of Porygon2, Amoonguss, and Venusaur. Icy Wind gives Tornadus additional speed control, potentially giving it the upper hand against opposing Tailwind teams. Rain Dance is useful against Drought setters like Groudon and Torkoal Wacan Berry specifically helps against Regieleki, a huge threat to Kyogre teams, while Mental Herb prevents Whimsicott from denying Tailwind with Prankster Taunt.</p> <p>Tornadus should almost always be paired with Kyogre because it lacks a niche outside Kyogre teams and Tornadus can support Kyogre by providing speed control and checking Grass-types such as Rillaboom and Venusaur. Tornadus and Kyogre are quite vulnerable to Regieleki, so answers to Regieleki such as Kartana and Venusaur make good partners. Note that Torkoal should be run alongside Venusaur to activate Chlorophyll. Tornadus is also great alongside Regieleki, as it can check troublesome Grass-types. Choice Band Urshifu-S is a powerful Pokemon that benefits immensely from Tornadus's Tailwind.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518634, "username": "Sole Survivor"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}]}
  },
  "Thundurus": {
    "sets": {
      "Support": {
        "description": "<p>Thundurus is a very effective support option in Series 11 thanks to its good defensive typing and Prankster-boosted disruptive moves such as Eerie Impulse and Thunder Wave. Eerie Impulse slows special attackers such as Kyogre and Zapdos. In a metagame where Tailwind and Max Airstream are so ubiquitous, Thunder Wave gives Thundurus a way to control Speed, permanently slowing down fast Pokemon such as Zacian-C. Alternatively, Scary Face is fully accurate and can lower Regieleki's and Landorus-T's Speed. Taunt shuts down status moves such as Spore and Rage Powder from Amoonguss, Sleep Powder from Venusaur, and Trick Room and Eerie Impulse from Porygon2. Leer is mainly used with Zacian-C's Behemoth Blade to OHKO Dynamaxed Pokemon such as Thundurus. Thunder Wave sets sometimes opt for Swagger to give targets a harder time moving, which is extremely potent in a Dynamax metagame. It can also be paired with allies such as Lum Berry Landorus-T to turn them into huge threats. Sitrus Berry helps improve Thundurus's longevity. The Defense investment allows Thundurus to survive +1 Zacian-C's Play Rough.</p> <p>Support Thundurus is commonly paired with Landorus-T for the bulk-improving combination of Intimidate and Eerie Impulse. Thundurus checks Water-types and helps Landorus-T with its Speed via Scary Face or Thunder Wave. Zacian-C is a common Restricted partner that appreciates Thundurus checking Water-types and giving it increased special bulk via Eerie Impulse. Blastoise has immense synergy with Thundurus because Eerie Impulse improves Blastoise's matchup against Regieleki, Thunder Wave or Scary Face helps Blastoise's Speed, and Blastoise threatens Landorus-T with G-Max Cannonade.</p>"
      },
      "Defiant": {
        "description": "<p>In a metagame crowded with Intimidate Pokemon like Incineroar and Landorus-T, Defiant Thundurus has a strong niche as a Dynamax option capable of heavily denting teams and controlling speed with Max Airstream. Wild Charge allows Thundurus to hit Pokemon such as Kyogre and Charizard for super effective damage. Superpower OHKOes Incineroar and turns into Max Knuckle under Dynamax, giving Thundurus and its allies like Zacian-C Attack boosts. Foul Play takes advantage of the high Attack stats of many Restricted Pokemon and turns into Max Darkness, allowing Dynamaxed Thundurus to OHKO Calyrex-S and get Special Defense drops on both foes to aid powerful special attacking allies such as Calyrex-S. Alternatively, Lash Out consistently OHKOes Calyrex-S and gives Thundurus further protection against stat drops. Note that Thundurus is usually only effective as a Dynamax option. The EV spread combined with the Assault Vest allows Dynamaxed Thundurus to always survive Mystic Water Kyogre's Water Spout and Life Orb Charizard's G-Max Wildfire, and the Defense investment does the same for Jolly Life Orb Landorus-T's Max Rockfall. The Special Defense investment allows Dynamaxed Thundurus to never get KOed by Electroweb from Timid Magnet Regieleki combined with Max Geyser from Mystic Water Kyogre in rain, and the Attack investment lets it OHKO standard Kyogre back with Max Lightning even without a Defiant boost. Life Orb alternatively lets Thundurus 2HKO bulky Dynamaxed Landorus-T with Max Airstream after a Defiant boost. Life Orb sets tend to drop Foul Play or Lash Out for Protect.</p> <p>Thundurus is frequently paired with Zacian-C thanks to its ability to punish Incineroar's and Landorus-T's Intimidate, enabling Zacian-C's Behemoth Blade by deterring them. It can also get Attack boosts on Zacian-C via Max Knuckle, allowing Zacian-C to threaten OHKOs on even most Dynamaxed Pokemon such as Charizard and opposing Thundurus. Zacian-C in return helps Thundurus beat Calyrex-I. Calyrex-S is another common Restricted partner that appreciates its ability to deter Incineroar and Urshifu-S and lower Special Defense via Max Darkness, allowing Calyrex-S to use its powerful Astral Barrage uncontested. Calyrex-S in return helps Thundurus beat Calyrex-I. Rillaboom helps Thundurus break through Gastrodon and Groudon, and Thundurus helps beat Charizard and Incineroar in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 426995, "username": "Namuko Pro"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}]}
  },
  "Landorus-Therian": {
    "sets": {
      "Offensive": {
        "description": "<p>Landorus-T has a favorable matchup against a good portion of the Series 11 metagame including, but not limited to, sun teams and Zacian-C compositions lacking Lapras. Intimidate allows it to weaken opposing Groudon and Zacian-C, two physical Restricted Pokemon at the forefront of the metagame. Earthquake deals massive damage to staples like Incineroar, Zacian-C, and Coalossal while also getting around redirection from Indeedee-F. It turns into Max Quake under Dynamax, allowing Landorus-T to boost its and its allies' Special Defense. Rock Slide complements Earthquake well by giving good coverage against Rotom-H, Charizard, and Zapdos. Swords Dance counteracts Intimidate and turns Landorus-T into a massive offensive threat, punishing passive leads. Fly turns into Max Airstream under Dynamax, allowing Landorus-T to hit Pokemon such as Urshifu-R and Rillaboom while also boosting its and its allies' Speed. Lum Berry offsets Sleep Powder from Venusaur and Will-O-Wisp from the likes of Rotom-H and Mimikyu, and alongside Grimmsnarl's dual screens, it makes Landorus-T a major threat to most sun compositions. Life Orb gives Landorus-T more immediate offensive presence at the cost of more vulnerability to status conditions.</p> <p>Landorus-T complements Zacian-C well by checking sun teams, especially checking Groudon and Venusaur. Zacian-C helps check Calyrex-I in return with its Ice-resistant typing and super effective Behemoth Blade. Landorus-T appreciates Grimmsnarl's dual screens to tank hits from threats like Charizard and Zacian-C and set up Swords Dance against passive leads. Incineroar has good type synergy with Landorus-T and provides it with Fake Out and Intimidate support, allowing it to set up Swords Dance safely. It also helps by pivoting around with Intimidate and Parting Shot against Landorus-T's biggest nemesis, Calyrex-I. Rillaboom helps Landorus-T hit bulky Water-types such as Kyogre and Lapras while aiding it with Fake Out in a similar way to Incineroar. Regieleki doubles down as a check to bulky Water-types alongside Rillaboom, as well as providing valuable speed control in Electroweb.</p>"
      },
      "Assault Vest": {
        "description": "<p>Landorus-T, with the combination of Intimidate and Assault Vest giving it great mixed bulk, is strong against a majority of the metagame, including Coalossal-oriented teams and Zacian-C compositions without Lapras. Earthquake hits crucial Pokemon such as Incineroar and Zacian-C hard. It turns into Max Quake during Dynamax, further bolstering Landorus-T's Special Defense. Rock Slide is a good coverage option to hit Rotom-H, Charizard, Yveltal, and Zapdos. Fly is used for Max Airstream under Dynamax, which boosts Landorus-T's and its allies' Speed while also hitting the likes of Rillaboom and Urshifu-R. U-turn allows Landorus-T to pivot in and out, stacking Intimidate drops alongside Incineroar. The Speed investment allows it to outspeed and OHKO uninvested Thundurus after an Electroweb from Regieleki. Assault Vest, in conjunction with dual screens from Grimmsnarl, allows Landorus-T to comfortably withstand Charizard's G-Max Wildfire in sun and OHKO it back with Max Rockfall. It also allows Landorus-T to always survive at least two Yveltal Max Darknesses. Landorus-T is never 2HKOed by any of +2 Coalossal's attacks with Light Screen up, even with the residual damage from G-Max Volcalith.</p> <p>Landorus-T complements sun compositions with Zacian-C by being a good answer into Coalossal teams. Zacian-C in return helps it beat two of its biggest checks in Calyrex-I and Lapras under Gigantamax. Landorus-T appreciates Grimmsnarl's dual screens bolstering its bulk to phenomenal levels in conjunction with Intimidate, Assault Vest, and the doubled HP from Dynamax, allowing it to take strong attacks from Pokemon such as Charizard in sun and Zacian-C. Grimmsnarl also helps Landorus-T with its Speed via Scary Face or Thunder Wave, allowing it to outspeed and OHKO or 2HKO Gigantamaxed Charizard and Zacian-C with Max Rockfall and Max Quake, respectively. Landorus-T is a good Intimidate pivot alongside Incineroar, which supports it with Fake Out and Parting Shot against imposing threats such as Calyrex-I and Zacian-C. Rillaboom also carries Fake Out while helping Landorus-T hit bulky Water-types like Kyogre and Lapras. Regieleki checks Water-types such as Urshifu-R further alongside Rillaboom and also provides Landorus-T with valuable speed control in Electroweb.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Yveltal": {
    "sets": {
      "Assault Vest": {
        "description": "<p>Even though Yveltal isn't been the most dominant restricted Pokemon, it has made a name for its ability to deal good damage thanks to Dark Aura while also providing good support to its teammates. Oblivion Wing threatens common Grass-types such as Rillaboom and Whimsicott, is able to 2HKO Bulky Urshifu-R, and provides a fairly reliable source of recovery. Snarl is an awesome tool to lower the Special Attack of many threats such as Kyogre, Xerneas, and Palkia and has the added benefit of bypassing Calyrex-S's Substitute to inflict an OHKO. Foul Play allows Yveltal to 2HKO Adamant Assault Vest Rillaboom and Interepid Sword-boosted Zacian-C. Sucker Punch allows Yveltal to get the upper hand against faster Pokemon such as Calyrex-S and Regieleki and secure safe revenge kills. This EV spread enable it to live a Magnet Thunderbolt from Regieleki and Play Rough from a neutral-natured Zacian-C.</p> <p>Stakataka is a great partner to get rid of Fairy-Types that give Yveltal a hard time while also giving the team a slow option. Rillaboom checks Tapu Fini and provides Fake Out and U-turn support to put Yveltal in better positions. Incineroar provides Fake Out, Snarl, Parting Shot and Intimidate support to gain momentum and protect Yveltal by softening damage dealt by opponents such as Xerneas and Zacian-C, possibly turning many OHKOs into 2HKOs.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 554354, "username": "pix"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Incineroar": {
    "sets": {
      "Utility": {
        "description": "<p>Incineroar is the metagame's greatest support Pokemon, with invaluable support moves and the ability to check top-tier Pokemon such as Zacian-C and Venusaur through its phenomenal defensive typing and Intimidate. Fake Out is an invaluable tool to shut down a foe and give Incineroar's teammates setup opportunities. Parting Shot is also an indispensable tool that, thanks to Incineroar's low Speed, provides teammates with safer switches. Darkest Lariat improves Incineroar's Calyrex-S matchup, and as a bonus, it ignores Max Steelspike boosts from Solgaleo and Metagross. Alternatively, Throat Chop alongside Speed investment is an option to try and disable opposing Incineroar's Parting Shot. Taunt is immensely useful for shutting down support moves from the likes of Porygon2, Amoonguss, and Grimmsnarl. Burning Jealousy can be run in the fourth moveslot to punish the metagame's many boosting Max Move users, such as Thundurus, Landorus-T, and Calyrex-Ice. Will-O-Wisp is another option that punishes physical attackers similarly to Burning Jealousy without being as situational; however, unlike Burning Jealousy, it fails versus Taunt and redirection from the likes of Indeedee-F and Amoonguss. Sitrus Berry improves Incineroar's longevity, and it's preferable to Iapapa Berry because it activates more reliably. Safety Goggles improves Incineroar's matchup against Venusaur and Amoonguss by giving it an immunity to their powder moves. Shuca Berry is an alternative for fighting Pokemon that rely on Ground-type attacks to hit Incineroar such as Calyrex-I, Solgaleo, and Groudon.</p> <p>A physically defensive EV spread is preferred to best stand up to the likes of Zacian-C, Calyrex-I, and powerful super effective attacks such as Landorus-T's -1 Max Quake. It takes Choice Band Urshifu-S's -1 Close Combat almost every time, and the remaining EVs are thrown into Special Defense to help Incineroar deal with special attackers like Venusuar and Calyrex-S. Incineroar's EV spread is, however, extremely flexible; it can even viably run maximum Speed on teams with Speed control such as Tailwind, Scary Face, or Thunder Wave to outspeed Zacian-C and Calyrex-S. Investing more into Special Defense is a niche option to help against Pokemon such as Charizard and Venusaur; however, Incineroar's physical bulk is generally too important to give up, and Assault Vest Incineroar is likely the better option for checking Calyrex-S. Incineroar is such an amazing support Pokemon that it will realistically fit on nearly any team and perform well.</p>"
      },
      "Assault Vest": {
        "description": "<p>Incineroar is a phenomenal support Pokemon with its utility moves and Intimidate, and Assault Vest makes it a strong check to one of the metagame's most centralizing forces: Calyrex-S. Flare Blitz is required to hit Venusaur and Zacian-C super effectively. Fake Out and U-turn are invaluable support moves; the former gives Incineroar's teammates setup opportunities, while the latter helps Incineroar pivot its teammates in safely thanks to its low Speed. Darkest Lariat Calyrex-S and ignores Defense boosts from the likes of Solgaleo's and Metagross's Max Steelspike. Throat Chop is an alternative STAB move that, with Speed investment, can attempt to block Parting Shot from opposing Incineroar. Snarl weakens special attackers such as Venusaur, Charizard, and Regieleki while still doing respectable damage to Calyrex-S and bypassing its Substitute. The defensive investment on this set takes Zacian-C's unboosted Close Combat. Assault Vest Incineroar is generally seen on teams that appreciate stronger insurance versus Calyrex-S, such as on Calyrex-I and Groudon teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 547596, "username": "Helios of Sun"}, {"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}]}
  },
  "Mimikyu": {
    "sets": {
      "Trick Room": {
        "description": "<p>Mimikyu has a strong niche as a Trick Room setter on Calyrex-I teams thanks to Disguise and its good bulk virtually guaranteeing that it can set Trick Room. Shadow Sneak allows Mimikyu to activate Calyrex-I's Weakness Policy and pick off weakened Pokemon. Trick Room is used to support slow teammates such as Calyrex-I and Torkoal. Will-O-Wisp cripples physical attackers such as Zacian-C, Groudon, and Urshifu-R. Play Rough gives Mimikyu ways to hit Pokemon such as both Urshifu formes and Grimmsnarl super effectively. Taunt is an alternative option to stop status moves such as Amoonguss's Spore and Incineroar's Parting Shot. Safeguard is another option that can also stop Amoonguss's and Venusaur's sleep moves, and unlike Taunt, Mimikyu doesn't need to use the move as actively to stop status; however, this disables Mimikyu from stopping Incineroar's Parting Shot and opposing Trick Room reversals. Mental Herb lets Mimikyu ignore Taunt from the likes of Incineroar and Whimsicott in order to set Trick Room.</p> <p>Incineroar is a great ally to basically every Pokemon, and Mimikyu isn't an exception, with Mimikyu appreciating Fake Out virtually guaranteeing that it can set Trick Room as well as Incineroar's ability to check Calyrex-S and Zacian-C. Calyrex-I has great synergy with Mimikyu, as Mimikyu can set Trick Room and activate its Weakness Policy with Shadow Sneak, making it a huge threat. As an added bonus, Mimikyu can cripple Zacian-C with Will-O-Wisp for Calyrex-I. Torkoal appreciates Mimikyu's Trick Room support, as it enables Torkoal to deal huge amounts of damage with Eruption under sun. Tapu Fini is also a fairly common Pokemon on Mimikyu compositions, as Misty Surge blocks status moves such as Amoonguss's and Venusaur's sleep moves, allowing Mimikyu to set Trick Room.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 548417, "username": "Awes0me"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Tapu Fini": {
    "sets": {
      "Support": {
        "description": "<p>Tapu Fini is a great bulky Water-type due to its support options that can effectively deal with threats such as Kyogre and Calyrex-S. Moonblast is its main STAB move, hitting Urshifu-R while being able to lower Calyrex-S's and Xerneas's Special Attack. Nature's Madness patches Tapu Fini's lack of offensive presence, being able to damage Zacian-C and Xerneas for half of their remaining HP. Icy Wind aids slower allies such as Landorus in outspeeding and threatening Zacian-C, while Heal Pulse is great for healing Tapu Fini's partners and punishing defensive play. Misty Surge enables Tapu Fini to soft check Pokemon that rely on status conditions such as Amoonguss, Volcarona and Zapdos. Wiki Berry paired with Tapu Fini's EV spread allows it to take many hits such as +1 Zacian-C's Behemoth Blade, +2 Xerneas's Moonblast, +1 Nihilego's Sludge Bomb, and Rillaboom's Grassy Glide in Grassy Terrain. For restricted partners, Zacian-C, Groudon, and Necrozma-DM are great allies, being able to check Rillaboom easily while Tapu Fini threatens Urshifu-R and protects them from burns. As for non-restricted Pokemon, Incineroar and Entei are great to quickly check Grass-types like Tsareena and Rillaboom for Tapu Fini, while it checks Urshifu-R and Kyogre in return. Landorus is another good option, being able to OHKO Nihilego, Zacian-C, and Stakataka. Rillaboom's and Incineroar's Fake Out pressure offers Tapu Fini opportunities to easily damage opposing threats, leaving them in range for a potential Grassy Glide or Flare Blitz.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541609, "username": "Evelyie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Kartana": {
    "sets": {
      "Assault Vest": {
        "description": "<p>Kartana has a niche on Kyogre teams, separating itself from other Grass-types such as Venusaur thanks to its access to Max Airstream and stronger matchup against Calyrex-I. Smart Strike grants Kartana Max Steelspike while Dynamaxed to boost its Defense and slam Fairy- and Ice-types such as Grimmsnarl and Calyrex-I. Sacred Sword turns into Max Knuckle and allows Kartana to hit Incineroar super effectively and neutralize Intimidate from it and Landorus-T by raising its Attack. Aerial Ace is used for Max Airstream, which is especially good alongside Kyogre, allowing it to rain down fast and powerful Water Spouts. Assault Vest with Special Defense investment allows Kartana to take strong special attacks such as Kyogre's Water Spout and Dynamaxed Regieleki's Life Orb-boosted Max Lightning.</p> <p>Kartana and Kyogre pair well together, as Kartana provides a check to Electric- and Grass-types such as Regieleki, Amoonguss, and Rillaboom, while Kyogre checks Fire-types such as Incineroar and Charizard as well as Landorus-T. Other common teammates include Tornadus and Regieleki, both providing great speed control with Tailwind and Electroweb, respectively. Tornadus also appreciates the Kartana checking opposing Regieleki, while Regieleki appreciates it checking opposing Grass-types. Kartana cannot properly check Venusaur in sun due to Weather Ball, so Incineroar is a solid teammate that can alleviate this problem.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 554354, "username": "pix"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Rillaboom-Gmax": {
    "sets": {
      "Assault Vest": {
        "description": "<p>Between access to Fake Out and the incredibly strong Grassy Surge and Grassy Glide combination, Rillaboom is one of Series 11's best offensive support Pokemon. Most Rillaboom that aim to be more defensive opt to use Assault Vest in order to better survive attacks from some of the metagame's most potent threats like Kyogre and Calyrex-S. Grassy Glide in Grassy Terrain provides a strong priority attack that threatens heavy damage on Water-types like Kyogre and Blastoise and Ground-types like Groudon. Wood Hammer is often used as a secondary offensive option that can deal significant damage, while Knock Off is an alternative option that offers a more consistent answer to Calyrex-S and provides utility by removing items from Pokemon that depend on them such as Porygon2 and Dusclops. U-turn allows Rillaboom's teammates to pivot in safely, which is an especially effective option when paired with Assault Vest. Fake Out rounds out the set and allows Rillaboom to flinch an opposing Pokemon while its partner is free to set up or deal damage. The given EVs ensure that Rillaboom is not 2HKOed by Kyogre's Mystic Water Max Geyser based off Water Spout after Grassy Terrain.</p> <p>Rillaboom is most commonly used on teams that need additional support against Water-types like Kyogre and Gastrodon. Accordingly, two of the most common partners for Rillaboom are Coalossal and Blastoise, which both have significant trouble against Water- and/or Ground-types like Kyogre, Groudon, and Gastrodon. Zacian-C makes a strong Restricted partner for this reason, as well as because of its strong defensive synergy with Rillaboom, which makes for opportunities such as being able to pivot around Landorus-T's STAB moves. Other common partners for Rillaboom include Pokemon such as Landorus-T and Incineroar that can threaten Fire-, Grass- or Steel-types such as Torkoal, Venusaur, and Zacian-C that trouble Rillaboom.</p>"
      },
      "Miracle Seed": {
        "description": "<p>More offensively inclined Rillaboom will often opt for Miracle Seed as their item in order to further increase their already potent Grass-type damage output, which allows Rillaboom to get priority OHKOs on important Water-types like Kyogre and Blastoise. After accounting for Grassy Terrain and Miracle Seed, Grassy Glide becomes an incredibly powerful priority move that is not only capable of always getting an OHKO on top metagame threat Kyogre, but also deals sizable damage to nearly every Pokemon that doesn't resist Grass. Wood Hammer is often used as the secondary attacking move due to the amazing damage output it provides. However, Rillaboom using Wood Hammer must be wary about recoil, so if Grassy Glide is deemed sufficient for damage Rillaboom may instead opt for U-turn instead to allow for better positioning and defensive play. Fake Out allows Rillaboom to play a bit of a supportive role, letting a partner make an important move while being unimpeded by an enemy Pokemon.</p> <p>Teams that want to quickly remove opposing Water-types like Kyogre and Lapras will often opt to use Miracle Seed Rillaboom. This leads to Coalossal and Blastoise as common partners, since Rillaboom can KO opposing Water-types and allow Gigantamaxed Coalossal or Blastoise to tear through opposing teams. Zacian-C is a common Restricted partner for Rillaboom, due to Zacian-C appreciating Rillaboom's ability to OHKO Kyogre and Blastoise. Incineroar and Landorus-T also make for strong partners for Rillaboom given that they can help check Fire- and Steel-types like Torkoal and Zacian-C that can threaten Rillaboom, and that they appreciate Rillaboom's ability to deal with Water-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 426995, "username": "Namuko Pro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 541874, "username": "Bonig"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Coalossal": {
    "sets": {
      "Weakness Policy": {
        "description": "<p>A strong offensive typing, Steam Engine, access to G-Max Volcalith, and good bulk make Coalossal one of the most powerful Gigantamax Pokemon in the format. Coalossal runs Heat Wave as opposed to other Fire-type attacks for a strong spread damage option outside of Dynamax, threatening common Pokemon in the format such as Zacian-C, Amoonguss, and Venusaur. Max Flare also sets up sun to further boost its power. Meteor Beam provides Coalossal with the strongest G-Max Volcalith, threatening to OHKO metagame staples like Incineroar while also dealing 1/6th of both opposing Pokemon's health as passive chip damage. One of Solar Beam and Earth Power is chosen as a coverage move. The former is very useful to threaten bulky Water-types such as Kyogre and Gastrodon, OHKOing the former when it is not Dynamaxed. However, Earth Power allows Coalossal to OHKO the opposing Coalossal in a mirror matchup and turns into Max Quake under Dynamax, boosting Coalossal and its allies' Special Defense. Coalossal uses a Weakness Policy as its item of choice because in combination with the Speed boost from Steam Engine, Coalossal's Special Attack is also doubled, making it a formidable threat.</p> <p>Coalossal wants game plans centered around activating its Weakness Policy and sweeping opposing teams, or setting G-Max Volcalith and letting its partners do the rest. Common partners include Urshifu-R and Dragapult, which are among the best Pokemon to activate Coalossal’s Weakness Policy with Aqua Jet or fast Surf, giving Coalossal the Steam Engine boost. Urshifu also helps Coalossal by providing strong damage that piles up as G-Max Volcalith turns go on and defeating common checks, such as Dynamaxed Landorus-T, with strong super effective attacks. Dragapult is also a good ally, as it can be used in either a supportive role defensively aiding Coalossal by using Light Screen, Will-O-Wisp, or Breaking Swipe to weaken opposing Pokemon’s damage output, or as a secondary Dynamax candidate, helping Zacian-C or Urshifu-R deal out increased damage after Max Phantasm drops both opposing Pokemon's Defense. Incineroar and Rillaboom or Amoonguss are used as a defensive backbone. Incineroar provides Coalossal with Intimidate support, weakening threats such as Zacian-C, while Rillaboom offers a pivot into Water- and Ground-type attacks and useful priority with Grassy Glide, to chip opposing Pokemon into range of Coalossal’s attacks, or faint after G-Max Volcalith’s residual does its work. Amoonguss is used to further support Coalossal by redirecting attacks and applying pressure with Spore, as well as pivot into Water-type attacks like Rillaboom. There are two main restricted partners that Coalossal is run together with, Zacian-C and Yveltal. Zacian-C is used usually on faster-paced Coalossal teams with an offensive Dragapult set, so that it can provide strong, fast damage that is incredibly useful combined with G-Max Volcalith’s passive chip damage. Yveltal is used usually on more defensive style teams with a defensive Dragapult set as well and helps Coalossal against Calyrex-S and Urshifu-R, both of which threaten it. Coalossal functionally cannot play without Dynamaxing, which is why many teams run a secondary Dynamax option, in case Coalossal has a hard time against opposing Pokemon and cannot reliably be used.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 551090, "username": "InkVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518634, "username": "Sole Survivor"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Grimmsnarl": {
    "sets": {
      "Defensive": {
        "description": "<p>Grimmsnarl's priority support moves thanks to Prankster and good bulk cement it as one of the best support Pokemon in Series 11. Reflect and Light Screen protect allies like Zacian-C and Venusaur against strong Max Moves such as Landorus-T's Max Quake and Max Airstream. Thunder Wave and Scary Face are great speed control tools, with Thunder Wave hindering the foe with a status and Scary Face slowing down Groudon, Landorus-T and Regieleki. Spirit Break is Grimmsnarl’s only attack, which has the added benefit of reducing the damage output of special attackers such as Kyogre and Venusaur while OHKOing Urshifu-S. Light Clay increases the duration of dual screens, and the EV spread maximizes its physical bulk, allowing it to survive Calyrex-I's Max Steelspike.</p> <p>Ground-types like Groudon and Landorus-T are great allies for Grimmsnarl, dealing with Zacian-C and Solgaleo. Zacian-C can safely switch into Venusaur's Max Ooze and set up behind Grimmsnarl's dual screens, making it a major threat. Other Dynamax users like Venusaur and Charizard enjoy being behind dual screens, setting residual damage safely. Porygon2, Dusclops, and Mimikyu can survive incoming attacks behind dual screens and set Trick Room or disrupt foes with Eerie Impulse and Will-O-Wisp.</p>"
      },
      "Disruptive": {
        "description": "<p>Grimmsnarl's disruptive tools in Trick, Fake Out, and Thunder Wave make it a great support Pokemon in the metagame. The combination of Trick and Lagging Tail greatly disrupts foes, making them move last no matter their Speed, ignoring Landorus-T's and Thundurus's Max Airstream boosts and also removing their item. Thunder Wave and Scary Face don't require a turn to activate, being a quick options to slow down Regieleki, Calyrex-S, and Zacian-C. Fake Out can stop Pokemon like Zacian-C, Groudon, and Porygon2 from moving, while Fake Tears can make bulky Pokemon vulnerable to its allies' special attacks. Spirit Break OHKOes Urshifu-S and weakens Kyogre, Charizard, and Venusaur, protecting its allies from their attacks. A Careful nature allows Grimmsnarl to survive Kyogre's Water Spout and Venusaur's Max Ooze.</p> <p>Bulky Dynamax Pokemon like Kyogre, Landorus-T, and Venusaur can attack quickly after Grimmsnarl's support and tear foes down after Fake Tears. Zacian-C, Groudon, and Landorus-T can safely set up with Grimmsnarl's Fake Out support and deal with threats like opposing Zacian-C. Kyogre and Torkoal can fire off Water Spouts and Eruptions and quickly remove threats from the field when paired with Grimmsnarl.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541609, "username": "Evelyie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Indeedee-F": {
    "sets": {
      "Support": {
        "description": "<p>Indeedee-F is one of the best redirectors in Series 11 thanks to its amazing support movepool and ability in Psychic Surge. Follow Me is its main selling point, allowing allies to attack and set up without fear of damage or harmful status, such as your Calyrex-I setting up Trick Room or Landorus-T using Swords Dance. Expanding Force takes full advantage of Psychic Surge to threaten Psychic-weak Pokemon like Urshifu-R and Venusaur. Helping Hand allows Indeedee-F to make up for its lack of an offensive. Maximum HP EVs with a Bold nature allows Indeedee-F to take a +1 Behemoth Blade from Zacian-C. Among the items, Psychic Seed lets it survive even the strongest of special attacks, such as Life Orb Max Wyrmwind from Dialga with Roar of Time as the base move. Lastly, Safety Goggles allows Indeedee-F to redirect Amoonguss's Spore and Venusaur's Sleep Powder for its teammates without fear of sleep.</p> <p>Calyrex-S is one of Indeedee-F’s most popular partners thanks to Psychic Surge Calyrex-S's boosting Expanding Force, as well as protecting it from priority attacks like Mimikyu's Shadow Sneak and Urshifu-S's Sucker Punch. Setup sweepers like Dragon Dance Dragapult and Swords Dance Landorus-T benefit from Follow Me to set up without fear of damage. Common Trick Room setters like Calyrex-I and Porygon2 appreciate Follow Me, and Psychic Surge denying Fake Out, to set up Trick Room unopposed. Indeedee-F's inability to threaten Dark-types like Incineroar and Urshifu-S makes Pokemon that can dispose of Dark-types like Zacian-C, Urshifu-S, and Urshifu-R good options.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 273634, "username": "Rich Li"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Dragapult": {
    "sets": {
      "Offensive": {
        "description": "<p>Dragapult is a powerful attacker on a wide variety of teams thanks to its great typing, incredible Speed, and access to Max Airstream. Phantom Force can be used both defensively, by dodging incoming Max Moves, and offensively, by breaking the foe's Protect. Under Dynamax, Phantom Force becomes Max Phantasm, which allows Dragapult to easily snowball by lowering opponents' Defense. Fly is mainly used because it turns into Max Airstream, allowing Dragapult to hit Urshifu-S and raising its and its allies' Speed. Dragon Darts, thanks to its smart targeting mechanic, is able to punish defensive play without requiring any prediction from the player. Max Wyrmwind makes it difficult for the opponent to answer Dragapult offensively by weakening physical attackers such as Calyrex-I, Landorus-T, and Zacian-C. Dragon Dance is a high-risk, high-reward option that punishes passive play. Lum Berry stops Dragapult from getting crippled by Venusaur's Sleep Powder, Grimmsnarl's Thunder Wave, and Mimikyu's Will-O-Wisp, keeping its offensive presence on the field; it is especially valuable alongside Clear Body, which also prevents stat drops from the likes of Intimidate and Fake Tears. Life Orb boosts Dragapult's already good Attack significantly. Adamant Dragapult, when Dynamaxed, can pick up an OHKO on Assault Vest Rillaboom, and a 2HKO on Venusaur and Charizard under Gigantamax, with Max Phantasm. When paired with Coalossal, Dragapult runs Surf in the second moveslot to activate its Steam Engine and Weakness Policy.</p> <p>Dragapult pairs well with Zacian-C, Urshifu-S, and Urshifu-R, as its Max Airstream and Max Phantasm provide them great support. Dragapult appreciates Fake Out support from the likes of Incineroar and Follow Me support from Indeedee-F to freely set up with Dragon Dance. Coalossal is also a great partner for Dragapult, since Surf Dragapult can activate Steam Engine and Weakness Policy for Coalossal thanks to its great Speed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 554354, "username": "pix"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Urshifu": {
    "sets": {
      "Offensive": {
        "description": "<p>Urshifu-S's massive Attack stat, solid Speed stat, and excellent offensive movepool allow it to act as one of the very few non-Restricted offensive threats that are not dependent on Dynamax in Series 11. Unseen Fist is a fantastic ability for an offensive Pokemon in VGC due to the ubiquity of Protect, and consequently Urshifu-S is able to put tremendous pressure on opposing teams that have limited options of mitigating Urshifu-S's damage output. Wicked Blow is Urshifu-S' best move, as being able to guarantee a critical hit is invaluable in a metagame inundated with Intimidate users like Incineroar and Landorus-T and dual screen setters like Grimmsnarl and Gigantamax Lapras. Close Combat offers a powerful secondary STAB move that targets Pokemon like Incineroar for super effective damage and offers neutral damage on many other Pokemon that resist Dark such as Zacian-C. Sucker Punch is a very useful priority move that enables Urshifu-S to take out Pokemon like Calyrex-S before they attack, and it can also offer enough damage to finish off Pokemon who are brought to low health by Wicked Blow or Close Combat. The final moveslot depends on the item that Urshifu-S chooses to run. Most Urshifu-S will opt to run Focus Sash to mitigate its mediocre bulk, multitude of common weaknesses, and Close Combat defensive drops and consequently will run Detect as the final move. The other common item choice for Urshifu-S is Choice Band to maximize damage output, and on those sets Urshifu-S will typically opt for U-turn as the final move in order to allow some flexibility through simultaneously switching out and providing chip damage.</p> <p>Urshifu-S can fit on a wide variety of teams, but it is most commonly used on hyper offense teams that offer high damage output and heavy speed control. Consequently, a common Restricted partner is Calyrex-S, as Urshifu-S can threaten Ghost- and Dark- types that threaten Calyrex-S with Wicked Blow and can take advantage of Defense drops from Max Phantasm. Urshifu-S is also oftentimes used on aggressive variants of Kyogre and Zacian-C teams. Other common partners for Urshifu-S include options such as Whimsicott that can provide speed control and strong offensive Pokemon like Defiant Thundurus that can go all in on providing massive damage alongside Urshifu-S.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 426995, "username": "Namuko Pro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Urshifu-Rapid-Strike-Gmax": {
    "sets": {
      "Offensive": {
        "description": "<p>Urshifu-R has strong stats and an excellent offensive movepool, enabling it to function as perhaps the lone non-Restricted offensive Water-type that is not dependent on Dynamax in Series 11. Unseen Fist is a fantastic ability for an offensive Pokemon in VGC due to the ubiquity of Protect, and consequently Urshifu-R is able to put tremendous pressure on opposing teams that have limited options of mitigating Urshifu-R's damage output. Surging Strikes is Urshifu-R's best move, as being able to guarantee critical hits is fantastic in a metagame inundated with Intimidate users and screens setters, being able to OHKO Landorus-T and do heavy damage to or outright OHKO Incineroar. Close Combat offers a powerful secondary STAB move and can target Water-types and other Pokemon that resist Surging Strikes. Aqua Jet is a useful move to finish off weakened Pokemon and is oftentimes used to activate a partner Pokemon's Weakness Policy, such as Coalossal. Despite not Dynamaxing often, Urshifu-R opts to use its Gigantamax forme due to its ability to take out important Pokemon like Coalossal through Max Guard. Focus Sash is Urshifu-R's most common item and is useful to mitigate its mediocre bulk and defensive drops from Close Combat. However, while less common, Urshifu-R can run other items such as Mystic Water, Choice Band, and Choice Scarf to boost damage output or Speed and will opt for U-turn over Detect on Choice item sets.</p> <p>In Series 11, Urshifu-R is most commonly used as an offensive support Pokemon on Coalossal teams, as it can utilize Aqua Jet to activate Coalossal's Weakness Policy and offer strong damage output to KO Pokemon weakened by G-Max Vocalith damage. The pair also have strong synergy, as Coalossal and Urshifu-R can threaten each other's most common checks, such as Landorus-T for Coalossal and Grass-types like Venusaur for Urshifu-R. The best choice for a Restricted Pokemon on these teams tends to be Zacian-C or Yveltal, and the rest of the team is typically filled out with Dragapult, Incineroar, and one of either Amoonguss or Rillaboom. However, Urshifu-R can also be a strong Pokemon on other teams that don't use Coalossal, as it still offers stellar offensive pressure that can compliment many Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 426995, "username": "Namuko Pro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "Yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Regieleki": {
    "sets": {
      "Special Attacker": {
        "description": "<p>With the highest Speed stat in the game, immensely powerful attacks, and incredible speed control in Electroweb, Regieleki is one of s11's top-tier Pokemon. Elecrtoweb is invaluable speed control that deals decent damage, ignores redirectors such as Amoonguss and Indeedee-F, and usually goes first with Regieleki's Speed. Thunder should only be run over Thunderbolt on teams with a rain setter. Thunder Wave and Eerie Impulse are niche support options that can be run over Thunderbolt or Volt Switch. Thunder Wave slows foes more severely than Electroweb and is particularly useful against Clear Body Dragapult, while Eerie Impulse weakens special attackers such as Venusaur, Rotom-H, and Coalossal. Magnet and Life Orb further increase Regieleki's incredible offense; Magnet lets a teammate such as Landorus-T, Dragapult, or Venusaur run Life Orb, but Life Orb is otherwise superior. Focus Sash is an especially useful item given Regieleki's frailty and makes it a great check to the combination of Tornadus and Kyogre.</p> <p>Regieleki's many positive qualities and strong synergy with other top-tier Pokemon allow it to fit on a wide variety of teams. Incineroar can threaten Grass-types such as Venusaur and Rillaboom, while Regieleki can thwart Water-types like Blastoise and Kyogre. Water-types are also strong teammates, able to check Ground-types like Landorus-T and Groudon for Regieleki. Zacian-C greatly benefits from Regieleki's Electroweb and ability to keep Water-types and Charizard in check. Landorus-T and Groudon appreciate Regieleki's speed control and Water-type checking, and Landorus-T can check Grass-types for Regieleki.</p>"
      },
      "Dynamax Attacker": {
        "description": "<p>With Dynamax and bulk investment, Regieleki has better survivability and cataclysmic power. Rising Voltage gives Regieleki the most powerful Max Lightning, and Rising Voltage becomes even stronger in the Electric Terrain set by Regieleki's Max Lightning. Electroweb supports Regieleki's team outside of Dynamax. Hyper Beam is most useful for Max Strike, which is Regieleki's best way to hit pertinent Ground-types like Landorus-T and Groudon, and it has utility in lowering Speed. Life Orb grants Regieleki immense power, allowing it to 2HKO even Amoonguss. The given EVs are optimal for Life Orb recoil and allow Dynamaxed Regieleki to always survive Adamant Zacian-C's Behemoth Blade after Life Orb recoil. Regieleki also outspeeds +1 Landorus-T with the given Speed. Regieleki's EV spread is fairly flexible, and it can very viably forgo bulk for more Speed.</p> <p>This Regieleki set fits well on Calyrex-S hyper offense teams and Calyrex-I Trick Room teams. Regieleki and Calyrex-S have a limited pool of mostly different answers and are immensely powerful, which makes them strong together. Calyrex-I is an excellent Regieleki partner, as it can destroy Ground- and Grass-types like Groudon, Landorus-T, and Rillaboom, while the slow Trick Room teams Calyrex-I fits on appreciate having a fast and powerful Pokemon for increased flexibility. Helping Hand makes Regieleki capable of incredible feats such as OHKOing Porygon2 and Dynamaxed Calyrex-S. Indeedee-F and Whimsicott are good options to provide Helping Hand on Calyrex-S teams, and Dusclops can provide it on Calyrex-I teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541847, "username": "Yourwelcomethanku"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 517038, "username": "Giokio"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}]}
  },
  "Calyrex-Ice": {
    "sets": {
      "Offensive Trick Room": {
        "description": "<p>Incredible bulk, one of the highest Attack stats in the metagame, a highly diverse movepool, and success both under and outside of Dynamax make Calyrex-I one of the premier Restricted Pokemon and Trick Room sweepers in the Series 11 metagame. Glacial Lance is arguably the best spread move in the game, and its synergy with As One allows Calyrex-I to quickly snowball under Trick Room, with very few Pokemon able to withstand a boosted attack. High Horsepower hits Fire- and Steel-types, which resist Glacial Lance, for super effective damage. Calyrex-I's third and fourth moveslots are more flexible. Heavy Slam is mainly useful under Dynamax to hit opposing Calyrex-I, and it can pair with Max Quake to provide whichever defensive boosts are needed. Protect allows Calyrex-I to avoid damage, as opponents often focus on it to take it out quickly before it tears through teams, while Trick Room instead ensures that Calyrex-I isn't fully dependent on a partner to have a speed advantage. Many Calyrex-I opt for Weakness Policy as the item, which can work both with an activator partner or just taking foes' attacks, the latter being helped by Calyrex-I's immense bulk and several weaknesses. Other common options include Life Orb, which trades the massive damage potential of Weakness Policy for a more consistent offensive boost, and Lum Berry, which allows Calyrex-I to avoid burns and other statuses that are used to try and neutralize it. Other common set option include an Assault Vest set, which will typically run Close Combat alongside Heavy Slam in the final two moveslots, and faster sets on teams that use speed control methods other than Trick Room.</p> <p>Calyrex-I relies on several common partners to maximize its potential. It is most often run alongside a Trick Room setter: Dusclops and Mimikyu are common options that can support Calyrex-I with various moves, such as Haze on Dusclops to neutralize Intimidate drops and Safeguard on Mimikyu to deter status effects, as well as activating Weakness Policy with Shadow Sneak. Porygon2 has a less exhaustive support movepool but is much stronger against Calyrex-S teams due to not sharing a Ghost weakness with Calyrex-I like the Ghost-type setters do. Other common supportive partners for Calyrex-I include Tapu Fini, which protects Calyrex-I from status effects, redirectors such as Amoonguss, which can draw attention away from Calyrex-I while it sets up Trick Room or deals damage, and Fire-types like Incinceroar or Torkoal, which can pressure problematic Steel type Pokemon like Zacian-C, Solgaleo, and Necrozma-DM. Some teams will also opt for a secondary Dynamax or Gigantamax option that both covers some of Calyrex-I's weaknesses and gives the team an alternative \"fast mode\" that doesn't rely on Trick Room, like Venusaur (usually paired with Torkoal) or offensive Thundurus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 426995, "username": "Namuko Pro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 547596, "username": "Helios of Sun"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Calyrex-Shadow": {
    "sets": {
      "Offensive": {
        "description": "<p>Boasting two of the highest Special Attack and Speed stats in the game and the ability to snowball via As One after every KO it gets, Calyrex-S is one of the strongest, most dangerous Pokemon in the VGC metagame. The combination of its Ghost- and Psychic-type STAB moves hits almost the entire metagame for at least neutral damage, barring Grimmsnarl, Urshifu-S, and staple Incineroar, which are its biggest nemeses. Astral Barrage hits both targets, 2HKOing almost the entire unboosted metagame. It allows Calyrex-S to hit the likes of Zacian-C, Dragapult, and Calyrex-I hard. It also turns into Max Phantasm when Dynamaxed, dropping the Defense of both opposing Pokemon for strong physical allies such as Urshifu-R. Expanding Force becomes a spread move under Psychic Terrain provided by an ally such as Indeedee-F and OHKOes Pokemon such as Urshifu-R and Venusaur. Max Mindstorm also sets up Psychic Terrain, blocking Mimikyu's Shadow Sneak and Urshifu-S's Sucker Punch. Mud Shot allows Calyrex-S to hit Incineroar and becomes Max Quake when Dynamaxed, which consistently deals substantial damage to Incineroar while raising Calyrex-S's and its allies' Special Defense. Draining Kiss allows Calyrex-S to hit problematic Dark-types such as Urshifu-S, Grimmsnarl, and Yveltal. Hyper Beam is used mainly to turn into Max Strike when Dynamaxed, allowing Calyrex-S to lower the Speed of both opposing Pokemon. Trick Room is an alternative option, allowing Calyrex-S to support slower teammates such as Torkoal on specific team compositions. Life Orb boosts Calyrex-S's damage output to high levels, allowing it to 2HKO just about anything that doesn't resist its attacks. Alternatively, Focus Sash helps Calyrex-S in the mirror matchup while also giving it at least two opportunities to attack in every other matchup thanks to its naturally high Speed.</p> <p>Calyrex-S appreciates Tailwind support from Whimsicott, allowing it to wreak havoc with its powerful moves. Indeedee-F is helpful for its ability to set up Psychic Terrain so Calyrex-S can deal huge amounts of damage with Expanding Force and Max Mindstorm. Indeedee-F also provides Calyrex-S with redirection support in the form of Follow Me, as Calyrex-S is rather frail, and Helping Hand support to boost Calyrex-S's damage output to astronomical levels, especially under Dynamax. Calyrex-S is also accompanied by Pokemon such as Thundurus and Urshifu-R that can thwart its biggest check, Incineroar, by punishing its Intimidate with Defiant and Surging Strikes, respectively. Urshifu-S is also dealt with, as both of the aforementioned partners have super effective moves for it. Calyrex-S lowers the Defense of opposing Pokemon with Max Phantasm for them in return, allowing them to clean up late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  }
}