{
  "Blastoise": {
    "overview": "<p>With a kit tailor-made for enabling partners, Blastoise stands out as DOU's definitive pure support pick. Access to all of Fake Out, Follow Me, and a pivot move in Flip Turn makes Blastoise incredibly effective at controlling the board and generating space for teammates to operate. Its respectable defenses leave it quite adept at soaking up attacks for its team; its pure-Water typing can be a mixed bag, though, only truly vulnerable to Grass-types such as Rillaboom but giving little in meaningful resistances. Blastoise generally fits best in fast, aggressive teams that feature threatening setup sweepers such as Dragon Dance Dragapult, Nasty Plot Spectrier, and Quiver Dance Volcarona. While Blastoise does compete with Amoonguss as a redirector and Tapu Fini as a bulky Water-type, it can be a better fit for borderline hyper offensive compositions hat prefer its dynamic, positioning-oriented arsenal over slow, controlling utility of Amoonguss's Spore and Tapu Fini's terrain control. Most glaringly, though, Blastoise's focus on sponging hits can let strong attackers like Urshifu-R and Zygarde simply overwhelm it or ignore the redirection; its lack of any offensive presence whatsoever means its partners must be threatening enough to make the support count.</p> ",
    "comments": "<h1>Other Options</h1> <p>Safety Goggles is one of the best alternatives on Blastoise purely for hard countering Amoonguss, as it renders Spore ineffective alongside Follow Me. Rindo Berry can also be useful for Rillaboom; Blastoise surviving a hit from these threats can give teammates game-changing extra safety. Blastoise also has more niche alternatives for its fourth move in Helping Hand, Icy Wind, and Life Dew.</p> ",
    "sets": [{"name": "Follow Me Support", "description": "<ul> <li> <p>Fake Out and Follow Me let Blastoise keep its team safe, making them its primary tools for providing support.</p> </li> <li> <p>Flip Turn lets Blastoise act as a pivot, utilizing its bulk and relatively low Speed to effectively provide safe switches for teammates; it also makes Fake Out available again for later.</p> </li> <li> <p>Toxic pressures bulky threats such as Porygon2 and Kyurem-B, making up for Blastoise's lack of offensive presence, while Roar can be quite nifty for phazing and denying Trick Room setups.</p> </li> <li> <p>The EV spread is primarily focused on Defense to help Blastoise deal with the likes of Urshifu-R, Rillaboom, and Kyurem-B much more reliably, with the investment in its special bulk, in conjunction with its Sitrus Berry, handily letting it survive two Expanding Forces from Necrozma in Psychic Terrain.</p> </li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finalnd"}]}], "writtenBy": [{"user_id": 215000, "username": "Memoric"}]}
  },
  "Weezing-Galar": {"sets": [{"name": "Neutralizing Gas"}]},
  "Chansey": {"sets": [{"name": "Bulky Utility"}]},
  "Zapdos": {"sets": [{"name": "Rain Attacker"}, {"name": "Offensive Tailwind", "description": "<ul> <li>The EV spread maximizes HP and Speed while letting Zapdos get the OHKO on Genesect with Heat Wave</li> </ul> <p>These are sample sets while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Zapdos-Galar": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}]},
  "Mew": {"sets": [{"name": "Tailwind Support"}]},
  "Politoed": {"sets": [{"name": "Drizzle Support"}]},
  "Kingdra": {"sets": [{"name": "Rain Attacker"}]},
  "Porygon2": {"sets": [{"name": "Trick Room Setter", "description": "<ul> <li>The Special Defense investment allows Porygon2 to survive the combination of Meteor Beam and Sludge Bomb from +1 Nihilego.</li> <li>The Defense investment lets Porygon2 survive two Sacred Swords from 4 Atk Kartana</li> <li>The remaining EVs are dumped onto Special Attack</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Tyranitar": {"sets": [{"name": "Bulky Attacker"}]},
  "Ludicolo": {"sets": [{"name": "Rain Attacker"}]},
  "Pelipper": {"sets": [{"name": "Offensive Rain Setter"}]},
  "Torkoal": {"sets": [{"name": "Sun Attacker"}]},
  "Metagross": {"sets": [{"name": "Utility"}]},
  "Heatran": {"sets": [{"name": "Fast Attacker"}]},
  "Cresselia": {"sets": [{"name": "Calm Mind"}]},
  "Excadrill": {"sets": [{"name": "Sand Rush"}, {"name": "Mold Breaker"}]},
  "Whimsicott": {"sets": [{"name": "Prankster Support"}]},
  "Amoonguss": {
    "overview": "<p>Amoonguss is one of the best support Pokemon in the metagame, capable of redirecting attacks with Rage Powder or putting foes to sleep with Spore. It is bulky enough to live most attacks, and the added survivability from Regenerator allows it to perform its role repeatedly throughout a match. Additionally, Pollen Puff ensures Amoonguss's teammates can also remain healthy. Setup Pokemon, such as Dragon Dance Zygarde or Kyurem-B and Calm Mind Tapu Fini, benefit the most from Amoonguss's support and can make up for its minimal damage output. Due to its low Speed and Spore, Amoonguss also works well both with and against Trick Room teams, as it can then send most Pokemon to sleep before they move. Trick Room users such as Porygon2 and Diancie also appreciate the redirection support while setting it. Despite being able to stomach most hits, Amoonguss must be wary of Fire-types such as Heatran and Incineroar as well as Psychic-types such as Tapu Lele and Necrozma, requiring teammates to deal with them such as Urshifu-R and Heatran, respectively. The presence of Misty Terrain hampers Amoonguss's Spore, so terrain setters such as Tapu Lele and Indeedee-F, or Metagross with Steel Roller, are essential to remove it. Opposing Grass-types such as Rillaboom, or Pokemon holding Safety Goggles, can also be troublesome, as immunity to powder moves lets them mostly ignore Amoonguss and attack its partner. Blastoise, its biggest competitor as a redirector, doesn't share this drawback.</p> ",
    "comments": "<h1>Other Options</h1> <p>Resist berries such as Occa and Papaya allow Amoonguss to live certain attacks that it would not otherwise. Eject Button lets Amoonguss redirect a hit and then immediately switch out, e.g. for helping to set Trick Room or Tailwind and then getting an attacker in to benefit right away. However, Eject Button can be awkward if Amoonguss intends to use Spore and gets forced out instead or needs to redirect two attacks. Another option is Rocky Helmet, which provides chip damage on physical attackers such as Urshifu-R, Rillaboom, and Genesect. These alternate item choices are not as generally useful as the recovery from Sitrus Berry, though. Clear Smog is a weaker Poison-type STAB move compared to Sludge Bomb, but it can be used instead to help deal with opposing setup. A Grass-type STAB move such as Energy Ball could also be considered, but it cannot effectively hit the Pokemon immune to Spore, while the Pokemon it does hit harder than Sludge Bomb are vulnerable to Spore, so there is little reason to use it.</p> ",
    "sets": [
      {
        "name": "Rage Powder Support",
        "description": "<ul> <li> <p>Sludge Bomb is Amoonguss's primary offensive option, hitting Tapu Fini as well as Grass-types like Rillaboom, which are immune to Spore. Protect can be used instead to scout for moves such as Choice Scarf Genesect locking into Ice Beam, but this leaves Amoonguss quite passive.</p> </li> <li> <p>Pollen Puff heals Amoonguss's partner.</p> </li> <li> <p>Rage Powder keeps partners safe from attacks and is most effective when used alongside setup Pokemon, or while setting field conditions such as Trick Room and Tailwind.</p> </li> <li> <p>Besides critically putting foes out of action, Spore helps ensure Amoonguss is not too passive while on the field.</p> </li> <li> <p>Sitrus Berry complements Amoonguss's bulk, turning many would-be 2HKOs into 3HKOs instead, such as Ice Beam from non-Life Orb Kyurem-B.</p> </li> <li> <p>Regenerator also helps Amoonguss's longevity on switching out, which can let it give future utility even when at low health.</p> </li> <li> <p>The given EV spread and nature, combined with Sitrus Berry, allow Amoonguss to live two Heat Waves from Volcanion, with the remaining EVs placed in Defense. 28 Speed IVs let it underspeed Diancie to move first under Trick Room while still being able to outspeed foes with the help of speed control.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 243662, "username": "Yoda2798"}]}
  },
  "Landorus-Therian": {"sets": [{"name": "Intimidate Pivot", "description": "<ul> <li>The EV spread is geared towards allowing Landorus-T to survive a +1 Meteor Beam from Nihilego and KO back with Earth Power. The leftover EVs are dumped onto Defense.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Kyurem-Black": {"sets": [{"name": "Defensive", "description": "<ul> <li>The EV spread is primarily geared towards allowing Kyurem-B to survive a +1 Meteor Beam from Nihilego with the Special Defense boost from either Assault Vest or Misty Seed, and the EV spread also allows Kyurem-B to outrun threats with up to base 115 Speed that have a Speed drop from Icy Wind, with Persian-A and Kartana as the primary targets. The leftover EVs are dumped into Special Attack.</li> </ul> "}, {"name": "Life Orb Attacker"}]},
  "Genesect": {"sets": [{"name": "Choice Scarf"}, {"name": "Assault Vest"}]},
  "Zygarde": {"sets": [{"name": "Choice Band"}, {"name": "Dragon Dance"}]},
  "Diancie": {"sets": [{"name": "Trick Room Attacker", "description": "<ul> <li>The EV investment and a Sassy nature maximizes Diancie's Attack while efficiently letting it survive a Steam Eruption from Volcanion.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Volcanion": {"sets": [{"name": "Bulky Attacker"}]},
  "Incineroar": {
    "overview": "<p>The combination of an excellent ability, access to valuable utility moves, and solid stats makes Incineroar one of the best pivots in the tier. It fits well on a variety of team structures because of its great defensive utility being appreciated on most archetypes. Specifically, setup threats such as Calm Mind Tapu Fini and Dragon Dance Dragapult appreciate its ability to generate safe turns, while strong offensive Pokemon such as Zygarde and Urshifu-R value the slow and safe switch-in generated through Parting Shot. However, Incineroar faces competition from other Fire-types such as Volcanion and Heatran, and it has rough matchups against common Pokemon such as Tapu Fini and Zygarde. It is also easily worn down pivoting in and out, especially since it rarely can fit Protect or a recovery item in its repertoire.</p> ",
    "comments": "<h1>Other Options</h1> <p>Sitrus Berry and Assault Vest are options over Heavy-Duty Boots for either recovery that can turn 2HKOs into 3HKOs or more special bulk, but they are usually not worth the risk of running into Stealth Rock. When running Assault Vest, use U-turn over Parting Shot, but the minimal damage is usually less helpful than Parting Shot's stats drops, so you shouldn't use it unless needed. Safety Goggles lets it act as a more reliable check to Amoonguss, but it makes Incineroar very vulnerable to entry hazards and leaves it with no healing. Taunt shuts down any Trick Room setters, but it's hard to to justify using over any of Incineroar's usual moves, which have much more utility overall.</p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<ul> <li> <p>Fake Out can provide space for your partner to boost its stats, provide speed control, switch, or attack.</p> </li> <li> <p>Flare Blitz is a strong STAB move that hits Pokemon such as Rillaboom, Amoonguss, and Genesect for super effective damage. Despite little investment, it still hits hard due to Flare Blitz's high Base Power, which is worth the recoil.</p> </li> <li> <p>Knock Off is a great utility move because removing items is always beneficial. Specifically, it can remove important items such as Eviolite on Porygon2, Assault Vest on Kyurem-B, and Leftovers on Tapu Fini.</p> </li> <li> <p>Parting Shot allows you to grab momentum while also enabling recycling of Fake Out and Intimidate. It also has the added bonus of crippling common switch-ins such as Urshifu-R and Volcanion.</p> </li> <li> <p>Heavy-Duty Boots keeps Incineroar safe from entry hazards, especially Stealth Rock, which makes its life as a pivot much easier.</p> </li> <li> <p>Intimidate weakens most opposing physical attackers on the switch in, notably Zygarde, often forcing them out to reset their own stats.</p> </li> <li> <p>The EV spread allows Incineroar to survive a Steam Eruption from Volcanion and OHKO Dragapult with Knock Off. EVs can be moved to Speed to outpace threats in Tailwind.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 188164, "username": "MajorBowman"}, {"user_id": 215000, "username": "Memoric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 294304, "username": "emma"}]}
  },
  "Tsareena": {"sets": [{"name": "Assault Vest", "description": "<ul> <li>The EV spread maximizes Speed while also allowing Tsareena to survive a +1 Sludge Bomb from Nihilego.</li> </ul> "}, {"name": "Sitrus Berry + Taunt", "description": "<ul> <li>The EV spread lets Tsareena take two Sacred Swords from 4 Atk Kartana without the need of a Sitrus Berry, and it also lets Tsareena survive a Choice Specs Draco Meteor from Dragapult.</li> </ul> <p>These are sample sets while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Kommo-o": {"sets": [{"name": "Omnibooster"}, {"name": "Iron Defense"}]},
  "Tapu Koko": {"sets": [{"name": "Choice Specs Attacker"}]},
  "Tapu Lele": {"sets": [{"name": "Bulky Taunt"}]},
  "Tapu Fini": {"sets": [{"name": "Calm Mind", "description": "<ul> <li>The EV spread allows Tapu Fini to survive a Leaf Blade from 4 Atk Miracle Seed Kartana.</li> </ul> "}, {"name": "Heal Pulse Support", "description": "<ul> <li>The EV spread allows Tapu Fini to survive a Leaf Blade from 4 Atk Miracle Seed Kartana as well as a Shadow Ball from a +2 Life Orb Spectrier.</li> </ul> <p>These are sample sets while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Nihilego": {"sets": [{"name": "Meteor Beam Attacker"}]},
  "Celesteela": {"sets": [{"name": "Bulky Leech Seed", "description": "<ul> <li>The EV Spread allows Celesteela to survive a Thunderbolt from Choice Specs Tapu Koko in Electric Terrain.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Kartana": {"sets": [{"name": "Fast Attacker"}]},
  "Necrozma": {"sets": [{"name": "Power Herb"}]},
  "Zeraora": {"sets": [{"name": "Utility"}]},
  "Rillaboom": {"sets": [{"name": "Bulky Pivot", "description": "<ul> <li>The EV spread is primarily geared towards surviving either a +1 U-turn from Genesect or a +1 Sludge Bomb from Nihilego. The leftover EVs are dumped onto Attack.</li> </ul> <p>This is a sample set while we are currently working on analyses in <a href=\"http://www.smogon.com/forums/forums/doubles-ou-analyses.541/\">Contributions and Corrections</a>.</p> "}]},
  "Hatterene": {"sets": [{"name": "Offensive Trick Room"}]},
  "Indeedee-F": {"sets": [{"name": "Follow Me Support"}]},
  "Dracovish": {"sets": [{"name": "Choiced Attacker"}]},
  "Dragapult": {
    "overview": "<p>Dragapult is useful on a wide variety of teams for its great typing and Speed. Its Dragon / Ghost typing lets it switch into Pokemon like Urshifu-R, and Heatran. It's also a great offensive typing, as Ghost-type moves are virtually unresisted in the metagame bar Pokemon like Incineroar and Porygon2, and Dragon-type moves hit many important targets like Kyurem-B and Zygarde. Its Speed allows it to outpace the vast majority of the unboosted metagame. These qualities allow it to handle many great Pokemon like Urshifu-R, and Zygarde, along with other Pokemon like Rillaboom and Necrozma. Its Choice Specs set can apply pressure instantly, while conversely, its Dragon Dance set can end a game outright if given the freedom to set up. However, Dragapult is heavily relies on its Speed, and its lack of bulk can give it trouble with speed control and switching in. Both sets can also feel underwhelming at times, as the Choice Specs set has to make use of Dragapult's mere base 100 Special Attack, while the Dragon Dance set is reliant on getting boosts to become threatening and lacks reliable STAB moves. As a result, it can struggle to break bulkier Pokemon like Porygon2 and Amoonguss, and it falls easily to faster attackers like Choice Scarf Genesect and Dragon Dance-boosted Kyurem-B. Dragapult also loathes Tapu Fini, as Misty Terrain severely limits Dragapult's offensive pressure, and Tapu Fini can OHKO it after minimal chip. This weakness to Tapu Fini makes Rillaboom a prime partner for the drake; Rillaboom can change the Terrain and provide openings for Dragapult to set up via Fake Out. Blastoise is a good partner for the Dragon Dance set, as it packs both Fake Out and Follow Me. Diancie is also another good partner for Dragapult, as it handles Kyurem-B and Incineroar well.</p> ",
    "comments": "<h1>Other Options</h1> <p>Dragon Fang is an option over Life Orb on the Dragon Dance set, as it boosts Dragapult's main source of damage without the recoil, but is significantly weaker. Thunderbolt can be run in the fourth slot to hit Water- and Flying-types like Tapu Fini and Galarian Moltres. While it does 2HKO Tapu Fini, it is generally an inferior option to U-turn or Hydro Pump.</p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<ul> <li> <p>Dragapult's dual STAB moves provide great neutral coverage against the majority of the tier, if not hitting them super effectively. Draco Meteor in particular is used for high burst damage and hitting bulky Dragon types like Zygarde and Kyurem-B, while Shadow Ball deals more consistent damage and is minimally resisted in the tier, making it a safer STAB move to lock into if Dragapult needs to attack consecutively.</p> </li> <li> <p>Flamethrower allows Dragapult to hit Grass- and Steel- types such as Rillaboom, Amoonguss, and Genesect. Genesect is OHKOed, while Rillaboom and Amoonguss are dented by it. Fire Blast has less than perfect accuracy, but it guarantees a 2HKO on Rillaboom and Amoonguss.</p> </li> <li> <p>U-turn can allow Dragapult to keep momentum, as its great Speed and ability to force switch-ins often grant it solid opportunities to rotate out, while Hydro Pump allows Dragapult to hit Heatran, Incineroar, and Diancie.</p> </li> <li> <p>Life Orb is also an option over Choice Specs, giving Dragapult the option to switch moves, but reducing its overall longevity and cutting into its power noticeably. If running Life Orb, the fourth slot should go to Protect.</p> </li> <li> <p>Infiltrator allows Dragapult to attack Volcanion and Zygarde hiding behind Substitute.</p> </li> <li> <p>A Timid nature is needed to Speed tie against other Dragapult, while Modest is also an option to hit considerably harder, and guarantees the 2HKO on Heatran with Shadow Ball.</p> </li> </ul> "
      },
      {
        "name": "Dragon Dance",
        "description": "<ul> <li> <p>Dragon Claw is the more consistent option for single target damage, while Dragon Darts hits both targets and can potentially deal more single target damage thanks to its smart targeting, causing it to avoid targeting a Fairy-type or Pokemon using Protect, which makes both hits attack a singular target.</p> </li> <li> <p>Phantom Force is Dragapult's most powerful Ghost-type STAB move that allows it to dodge incoming attacks and break Protect for itself and its allies, creating some valuable openings. However, its charging turn leaves the opponent open to appropriately responding to the incoming attack, such as with Normal-type switch-ins like Porygon2 and Indeedee or attacks after Phantom Force for the KO.</p> </li> <li> <p>Dragon Dance brings Dragapult's Attack to impressive levels, making it an immensely dangerous sweeping threat after a single boost. At +1, Dragapult OHKOes Zygarde with Dragon Claw, and it can OHKO Urshifu-R with Phantom Force at +2. The extra Speed can also help in certain scenarios, such as outspeeding Zygarde in Tailwind after a boost.</p> </li> <li> <p>Protect allows Dragapult to avoid potentially dangerous moves and gives it a better opportunity to set up by allowing allies such as Blastoise and Rillaboom to come to its aid with Follow Me and Fake Out.</p> </li> <li> <p>Life Orb boosts Dragapult's power significantly, allowing it to KO foes like bulky Necrozma with Phantom Force and Defensive Kyurem-B with Dragon Claw, at +1 Attack.</p> </li> <li> <p>Clear Body's primary function is to block Intimidate, but it can also come in handy for some stat-lowering moves such as Parting Shot and Icy Wind.</p> </li> <li> <p>A Jolly nature is required to outspeed Zygarde in Tailwind at +1.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zeefable"}, {"user_id": 294304, "username": "emma"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Estronic"}]}], "writtenBy": [{"user_id": 531334, "username": "dnagerbadger"}]}
  },
  "Urshifu-Rapid-Strike": {
    "overview": "<p>Urshifu-R is one of the most threatening offensive Pokemon in Doubles, possessing a monstrous base 130 Attack, a great offensive typing, and the unique ability to bypass most traditional defensive counterplay such as Intimidate, Protect, and Defense boosting thanks to the combination of Unseen Fist ignoring protection and Surging Strikes's guaranteed critical hits. This makes it one of the strongest candidates to answer metagame staples like Kyurem-B, Incineroar, Porygon2, and Diancie. Due to Urshifu-R's excellent offensive prowess, defensive answers are limited to mainly just Amoonguss and Tapu Fini, two Pokemon that resist all of its STAB attacks. Instead, it is often answered offensively by the likes of Rillaboom, Dragapult, and Necrozma. Urshifu-R is held back by a fairly middling Speed tier, meaning pairing it with speed control and priority will be very helpful. As such, Zapdos and Naganadel are excellent partners, providing Tailwind support and a way to match up well against Water-types. Other examples of good teammates include Tapu Lele and Indeedee-F for providing Psychic Terrain, which keeps Urshifu-R safe from priority moves like Fake Out and Grassy Glide, and Heatran, which is excellent for hitting Grass-types.</p> ",
    "comments": "<h1>Other Options</h1> <p>Urshifu-R can outrun the entire unboosted metagame with a Choice Scarf; however, this comes at a significant decrease in power, as it loses its ability to OHKO Porygon2 and Genesect. An Adamant nature can somewhat make up for the loss of offensive pressure, but the set then fails to outspeed Jolly Kyurem-B and Zygarde after a Dragon Dance. Ice Punch can be utilized on a Choice Band set to score a surprise OHKO on Zygarde. Poison Jab is the best way to hit Tapu Fini, which otherwise walls Urshifu-R completely. Both of these moves don't have much use otherwise, though.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Surging Strikes is incredibly free to use thanks to its guaranteed critical hits bypassing any form of damage reduction, like Intimidate. It can easily pick up OHKOs on Incineroar, Landorus-T, and Diancie.</p> </li> <li> <p>Close Combat is Urshifu-R's strongest attack, possessing the rare ability to OHKO Kyurem-B and Porygon2. Even neutral foes like Rillaboom and Volcanion will take a large amount of damage from it.</p> </li> <li> <p>Aqua Jet is reliable priority that can  pick off foes with low Defense like Volcarona and Nihilego.</p> </li> <li> <p>U-turn is a decently hard-hitting move that allows Urshifu-R to pivot out of unfavorable situations. This can be especially useful for the opposing Grass-types it baits in, letting it switch out to proper checks. Protect is important on Life Orb sets for keeping Urshifu-R safe from the Grass- and Electric-type attacks that it often baits in.</p> </li> <li> <p>A Choice Band and maxed out Attack EVs allow Urshifu-R to make the most out of its offensive potential, notably scoring the OHKO on physically defensive Porygon2, which Life Orb sets cannot. However, Life Orb allows Urshifu-R to switch moves and run Protect. 252 Speed EVs and a Jolly nature let Urshifu outspeed base 95s like Kyurem-B and Tapu Lele.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 188164, "username": "MajorBowman"}, {"user_id": 243662, "username": "Yoda2798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Finland"}]}], "writtenBy": [{"user_id": 501951, "username": "zeefable"}]}
  },
  "Spectrier": {"sets": [{"name": "Fast Attacker"}]}
}