{
  "Charmander": {"sets": [{"name": "Sun Wallbreaker"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Flou", "user_id": 605215}]}]}},
  "Diglett": {"sets": [{"name": "Life Orb"}, {"name": "Eviolite"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "goldenghost", "user_id": 32350}]}]}},
  "Meowth": {"sets": [{"name": "Revenge Killer"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "ZeStinky", "user_id": 597006}]}]}},
  "Psyduck": {"sets": [{"name": "Rain Wallbreaker"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Altariel von Sweep", "user_id": 330191}]}]}},
  "Mankey": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Mankey is one of the most powerful Choice Scarf users in Little Cup thanks to its high Speed, which allows it to outpace or tie with the entire unboosted metagame. This allows Mankey to beat other common Choice Scarf users such as Magnemite, Mudbray, and Gothita. U-turn allows it to greatly capitalize on the switches it forces. Earthquake is a powerful coverage move that hits Mareanie, Glimmet, and Voltorb. Assurance is used to deal as much damage as possible to Ghost-types, OHKOing Eviolite variants on the switch if Stealth Rock is up, while Ice Punch OHKOes Toedscool and threatens Flying-types like Wattrel. Stone Edge is an uncommon option to hit Larvesta and Flying-types. Vital Spirit can be helpful on teams lacking a Grass-type, as it provides a switch-in to Toedscool's Spore, while Defiant is very useful in matchups against Pokemon such as Sticky Web Surskit and Parting Shot Shroodle, as the Attack boosts make Mankey nigh unwallable. Tera Fighting allows Mankey to hit as hard as possible with Close Combat in situations where an unboosted hit is insufficient. Some of Mankey's best teammates include Toedscool to switch in on Ghost-types and remove entry hazards, which can hamper Mankey's pivoting abilities, and either Gothita or Diglett, which can remove the bulky Poison-types like Mareanie and Foongus that give Mankey trouble. Mankey also performs well as part of a VoltTurn core with Pokemon like Volt Switch Voltorb and U-turn Zorua.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Drifting", "user_id": 342456}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "Éric", "user_id": 440139}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Slowpoke": {"sets": [{"name": "Pivot"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "PigWarrior19", "user_id": 587838}]}]}},
  "Magnemite": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Magnemite is a powerful Choice Scarf user, capable of capitalizing on switches it forces with the combination of its high Special Attack, STAB Volt Switch, and Analytic. Tera Blast in combination with Tera Ice gives Magnemite STAB on the BoltBeam combination, letting it hit common checks such as Toedscool, Diglett, and Wattrel for super effective damage. Alternatively, Tera Steel makes Flash Cannon a much more spammable attack and turns Steel Beam into a nuke. A Modest nature is preferred to improve damage rolls, especially with an Analytic boost; a Timid nature is an alternative to ensure Magnemite outspeeds Speed-boosted foes like Choice Scarf Gothita and Quaxly after a Rapid Spin. Ground-types like opposing Toedscool, Diglett, and Mudbray are the biggest threats to Magnemite; Pokemon like Toedscool and Shellos that can check Ground-types make good teammates. Magnemite can form a powerful VoltTurn core with other pivot move users such as Larvesta and Nymble. Frail attackers such as Wingull appreciate Magnemite bringing them in safely with Volt Switch.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Aurora", "user_id": 109385}]}]}
  },
  "Shellder": {"sets": [{"name": "Shell Smash"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "RedPee428", "user_id": 611652}]}]}},
  "Voltorb": {
    "sets": [
      {
        "name": "Tera Pivot",
        "description": "<p>Voltorb's elite Speed tier and STAB Volt Switch make it one of Little Cup's premier pivots, as well as an excellent offensive check to fast threats like Wingull and Crabrawler. Volt Switch lets Voltorb deal solid damage while preserving itself and capitalizing on the switches it forces with its Speed. Thunderbolt deals a stronger blow, invaluable against bulky Water-types like Mareanie, Quaxly, and Shellos, and is valuable for cleaning up weakened fast threats. Tera Blast, once Voltorb has Terastallized, gives it the heralded BoltBeam coverage and turns the tables on would-be checks like Toedscool, Mudbray, Diglett, and Wattrel. Because of Voltorb's limited coverage and the prominence of Ground-types, Voltorb often depends on Terastallization (or the threat of it) to function well in a match. Voltorb leans on a few utility options for its fourth move due to its limited movepool; Protect stops Nymble's First Impression from revenge killing it and can scout defensive Terastallizations, especially Tera Water on Toedscool. Taunt prevents setup and entry hazards from the likes of Pawniard, Surskit, and Glimmet, and Thunder Wave neutralizes setup sweepers and faster threats that Voltorb cannot OHKO. Voltorb pairs well with teammates that can switch into its Ground-type checks when it has not Terastallized. Toedscool is a natural partner thanks to its bulk, Ground resistance, and ability to remove entry hazards for Terastallized Voltorb, given its new Stealth Rock weakness. Drifloon's Ground immunity also supports Voltorb well. As a pivot, Voltorb appreciates the support of other pivots to continually put your opponent on the back foot. Nymble has a powerful STAB U-turn and often invites in Mareanie, which Voltorb can pressure. Wingull not only checks Ground-types with its dual STAB types and Ground immunity, but also appreciates Voltorb handling the bulky Water-types that check it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Wingull": {"sets": [{"name": "Offensive"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "gali", "user_id": 107567}]}]}},
  "Surskit": {"sets": [{"name": "Sticky Web"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "DuGuo", "user_id": 561351}]}]}},
  "Azurill": {"sets": [{"name": "Belly Drum"}]},
  "Numel": {"sets": [{"name": "Double Dance"}]},
  "Buizel": {"sets": [{"name": "Rain Wallbreaker"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Altariel von Sweep", "user_id": 330191}]}]}},
  "Shellos": {"sets": [{"name": "Defensive"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Charis_Akins", "user_id": 588203}]}]}},
  "Drifloon": {"sets": [{"name": "Defog"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "gali", "user_id": 107567}]}]}},
  "Snover": {"sets": [{"name": "Physical Wall"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "TheShoddyStrawman", "user_id": 585065}]}]}},
  "Zorua": {"sets": [{"name": "Pivot"}, {"name": "Choice Scarf"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "TheShoddyStrawman", "user_id": 585065}]}]}},
  "Zorua-Hisui": {"sets": [{"name": "Pivot"}, {"name": "Nasty Plot"}]},
  "Gothita": {"sets": [{"name": "Choice Scarf"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Lialiabeast", "user_id": 564420}]}]}},
  "Deerling": {"sets": [{"name": "Offensive"}]},
  "Foongus": {"sets": [{"name": "Defensive"}]},
  "Pawniard": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Pawniard's well-rounded stats, typing, and movepool make it one of the best role compressors in Little Cup. It can set up Stealth Rock while being a solid defensive answer to Pokemon such as Drifloon, Deerling, and both forms of Zorua, or it can use Swords Dance and Defiant to become a top-tier sweeper with Sucker Punch. Low Sweep threatens opposing Pawniard, OHKOing after Stealth Rock damage, while also providing Speed control against common switch-ins like Crabrawler. Alternatively, teams that don't fear opposing Pawniard can opt for Night Slash, a consistent source of STAB damage that threatens bulky Water-types and pairs best with Swords Dance. Flying and Ghost are both strong defensive Tera types that address Pawniard's key weaknesses; Tera Flying is a better choice against Diglett, whereas Tera Ghost is better against Fighting-types and doesn't add a Stealth Rock weakness. Tera Dark as an offensive option is more niche, but on Swords Dance + Night Slash sets, it can easily invalidate common Pawniard checks such as Quaxly and Mareanie. One of the best partners for Pawniard is Toedscool, as it is similarly versatile and counters the Pokemon Pawniard struggles with, such as bulky Water-types, Fuecoco, Diglett, and Mudbray. Other great partners are Ghost-types like Drifloon and Hisuian Zorua, as they exploit Fighting-types like Mankey and Crabrawler, which easily KO Pawniard. Most teammates appreciate Pawniard's versatility: Crabrawler, Toedscool, and Drifloon all heavily appreciate its defensive utility, as it switches into these Pokemon's common checks like Hisuian Zorua and Deerling. Pawniard also shines on teams without Glimmet that need a reliable Stealth Rock user, as well as Sticky Web teams that want a potent set-up sweeper and something to deter Drifloon's Defog.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Drifting", "user_id": 342456}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Larvesta": {"sets": [{"name": "Defensive Pivot"}, {"name": "Choice Scarf"}], "credits": {"writtenBy": [], "teams": [{"name": "Sunmitted by", "members": [{"username": "Charis_Akins", "user_id": 588203}, {"username": "aleaniled", "user_id": 589495}]}]}},
  "Crabrawler": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Crabrawler is a fantastic bulky attacker that checks dangerous threats such as Toedscool, Pawniard, and Diglett and can sweep teams with Bulk Up. Coverage moves such as Ice Punch, Thunder Punch, and Earthquake offer Crabrawler extreme flexibility in the threats it needs to cover. Ice Punch hits Foongus, Wattrel, and Toedscool, while Thunder Punch hits Mareanie and Quaxly; both options also hit Drifloon super effectively. Earthquake allows Crabrawler to hit Mareanie and Fuecoco and is its strongest neutral option against Hisuian Zorua. Tera Fire makes Crabrawler immune to burns, while Tera Electric makes Thunder Punch stronger against Water-types and gives it defensive utility against threats like Voltorb and Wingull. Crabrawler hates dealing with opposing Ghost-types such as Hisuian Zorua, Greavard, and Drifloon, as well as Gothita. Pawniard checks these threats and makes an excellent teammate for Crabrawler, as do Ghost-types such as Hisuian Zorua and Drifloon that benefit from the removal of opposing Pawniard.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TheShoddyStrawman", "user_id": 585065}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Lunaflare", "user_id": 430518}]}]}
  },
  "Mareanie": {
    "sets": [{"name": "Defensive", "description": "<p>Mareanie is one of the top walls in Little Cup, capable of checking threats such as Pawniard, Quaxly, and Nymble. Toxic Spikes wears down foes like Toedscool and synergizes with partners like Hex Hisuian Zorua, while Ice Beam hits Toedscool and Foongus. Mareanie has some other viable options for its fourth moveslot; Haze is an option to stop setup sweepers like Swords Dance Pawniard and Bulk Up Crabrawler, and Iron Defense turns Mareanie into a defensive wincon. Tera Water eliminates Mareanie's weakness to Ground- and Psychic-type moves, notably preventing an OHKO from Life Orb Diglett, while also making it less passive by powering up Surf. Mareanie benefits from the support of teammates like Deerling, Toedscool, and Diglett. Deerling and Toedscool can switch into troublesome Ground-types like Mudbray and opposing Toedscool, while Diglett traps problematic Electric-types like Magnemite and Voltorb.</p> "}],
    "credits": {"writtenBy": [{"username": "Flou", "user_id": 605215}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Mudbray": {"sets": [{"name": "RestTalk"}, {"name": "Stealth Rock"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "ashelyDeluxe", "user_id": 593128}, {"username": "Flou", "user_id": 605215}]}]}},
  "Chewtle": {"sets": [{"name": "Shell Smash"}]},
  "Impidimp": {"sets": [{"name": "Dual Screens"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Sanjay das", "user_id": 557942}]}]}},
  "Fuecoco": {"sets": [{"name": "Defensive"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Joeshh", "user_id": 607664}]}]}},
  "Quaxly": {"sets": [{"name": "Defensive Spinner"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Drifting", "user_id": 342456}]}]}},
  "Nymble": {
    "sets": [{"name": "Revenge Killer", "description": "<p>Nymble's unique combination of STAB First Impression and a powerful ability in Tinted Lens allows it to become one of Little Cup's reliable revenge killer, picking off targets such as Toedscool and sweepers such as Shellder. U-turn allows Nymble to pivot on the switches it forces and avoid problematic matchups, such as Wattrel. Sucker Punch revenge kills foes that have Protect or can safely tank a First Impression, such as Drifloon. Nymble switches out of battle very often, so spinners such as Quaxly and Toedscool are good partners to have. Mareanie and Pawniard can switch into Nymble's common checks such as Hisuian Zorua and Mudbray well. Pokemon weak to Grass- or Dark-types such as Diglett and Hisuian Zorua appreciate Nymble forcing out or removing their checks. Voltorb and Magnemite pair well with Nymble, as they can make a deadly VoltTurn combination.</p> "}],
    "credits": {"writtenBy": [{"username": "uhBella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "Drifting", "user_id": 342456}]}, {"name": "Grammar checked by", "members": [{"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Wattrel": {"sets": [{"name": "Offensive Pivot"}]},
  "Maschiff": {"sets": [{"name": "Choice Scarf"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Shandeur", "user_id": 580548}]}]}},
  "Shroodle": {"sets": [{"name": "Prankster Pivot"}, {"name": "Weather Setter"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Charis_Akins", "user_id": 588203}, {"username": "gali", "user_id": 107567}]}]}},
  "Bramblin": {"sets": [{"name": "Spinner"}]},
  "Toedscool": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Toedscool is one of the premier forms of entry hazard removal in Little Cup. Toedscool spreads sleep and removes entry hazards, punishing Spore absorbers and spinblockers with Knock Off while using its good natural bulk and typing to serve as a check to Ground- and Electric-types. The given EV spread allows Toedscool to hit 17 Speed, which outspeeds common 16 Speed entry hazard setters like Glimmet and Pawniard. Toedscool can also opt for a Grass-type STAB move over Spore to give it more offensive presence. Power Whip provides a better matchup into opposing Toedscool, while Giga Drain gives it a form of recovery, a secondary STAB that cannot miss, and the ability to beat Mudbray. If running Power Whip, Toedscool should use an EV spread of 36 HP / 36 Atk / 156 Def / 36 SpA / 36 SpD / 196 Spe with a Jolly nature. Toedscool's Tera type occasionally allows it to avoid a super effective Ice-type move. Tera Water is preferred, as the added resistance to Water-type attacks also allows Toedscool to be an emergency check to rain teams and setup Quaxly sets. Tera Steel can also be used to deal with Tera Ice Electric-types more easily and to give it a favorable matchup against Foongus, but at the cost of adding unfortunate Ground and Fighting weaknesses. Toedscool pairs well with Pokemon that struggle with Stealth Rock chip, like Larvesta, Nymble, and Wattrel, and teammates that appreciate the momentum that Toedscool generates, like Magnemite, Mankey, and Hisuian Zorua. Water-types such as Mareanie and Quaxly have defensive synergy with Toedscool, both checking the Ice- and Fire-types that threaten Toedscool and benefitting from Toedscool's ability to absorb Electric-type moves.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "yellowfin", "user_id": 416460}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Acehunter1", "user_id": 430377}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}]}]}
  },
  "Tinkatink": {"sets": [{"name": "Utility"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "TheShoddyStrawman", "user_id": 585065}]}]}},
  "Glimmet": {
    "sets": [
      {
        "name": "Entry Hazard Setter",
        "description": "<p>Glimmet is one of the best entry hazard setters in LC because it can set up all of Stealth Rock, Spikes, and Toxic Spikes. Mud Shot threatens Steel-types like Pawniard and Tinkatink, albeit activating the former's Defiant, hits opposing Glimmet, and can help win matchups against faster threats with its Speed drop, especially on Focus Sash sets. Alternatively, Power Gem can be used to hit Ghost-types such as Hisuian Zorua and Drifloon. Eviolite allows Glimmet to set up entry hazards multiple times in a game and check Larvesta and Drifloon, while Focus Sash can be used to guarantee hazards, even in unfavorable lead matchups such as Diglett. Tera Ghost lets Glimmet spinblock and allows it to escape Diglett and Gothita, while Tera Grass gives it a better matchup against Quaxly and Toedscool, the two most common spinners, as well as Ground-types like Diglett and Mudbray. Ghost-types such as Hisuian Zorua, Drifloon, and Greavard should be used with Glimmet to maintain Glimmet’s hazards by spinblocking. U-turn and Volt Switch users like Magnemite, Mankey, and Voltorb are great partners, as their ability to force switches amplifies the damage Glimmet's hazards can deal to the opposing team. Offensive attackers such as Crabrawler, Pawniard, and Mankey appreciate Glimmet's hazards to secure KOs and wear down their checks.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Charis_Akins", "user_id": 588203}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Greavard": {"sets": [{"name": "Bulky Spinblocker"}]}
}