{
  "Venusaur": {"sets": {"Sun Sweeper": {}}},
  "Clefable": {"sets": {"Utility": {}}},
  "Ninetales-Alola": {"outdated": true, "sets": {"Aurora Veil": {}}},
  "Arcanine-Hisui": {"outdated": true, "sets": {"Choice Band": {"description": "<p>These are sample set(s) as we wait for the metagame to settle before working on <a href=\"https://www.smogon.com/forums/forums/ou-analyses.758/\">new analyses</a>. They will be updated as the metagame continues to develop, so stay tuned!</p>"}}},
  "Tentacruel": {"sets": {"Defensive Spinner": {}}},
  "Muk-Alola": {"sets": {"Defensive": {}}},
  "Weezing-Galar": {"outdated": true, "sets": {"Defensive": {}}},
  "Zapdos": {"sets": {"Defensive": {}, "Offensive": {}}},
  "Moltres": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<p>Thanks to its natural bulk, typing, and Flame Body, physically defensive Moltres can threaten crippling burns to most physical attackers in the tier and force out threats such as Kingambit, Zamazenta, Swords Dance Iron Valiant, Dragonite, Roaring Moon, and Sneasler. Moltres gets many free turns over the course of a game thanks to the many Pokemon it forces out, which makes U-turn a fantastic tool for pivoting and gaining momentum while also ensuring that Moltres is not passive against Pokemon such as Heatran and Ting-Lu. Hurricane is an alternative that can OHKO Great Tusk, Iron Valiant, and Sneasler and 2HKO Zamazenta. 12 Speed EVs allows Moltres to outspeed Jolly Kingambit. Tera Fairy removes all of Moltres' previous weaknesses and strengthen its matchup against Kingambit and Roaring Moon. Alternatively, Tera Water is a solid defensive type that also improves Moltres's rain matchup allowing it to live rain-boosted Tera Water Wave Crash from Floatzel and Basculegion and be able to threaten them back with Will-O-Wisp. 248 Special Defense EVs with a Calm nature can be used instead of the Defense investment and Bold nature to more comfortably take on Enamorus and most special Iron Valiant sets. Great Tusk can form a good core with Moltres thanks to Great Tusk's ability to threaten Moltres's switch-ins, such as Garganacl, Ting-Lu, Galarian Slowking, and Heatran, and remove Stealth Rock if Moltres loses its Heavy-Duty Boots. Ting-Lu can take advantage of Moltres's switch-ins such as Zapdos, Dragapult, and Iron Moth to lay entry hazards while Moltres covers it against Fighting- and Fairy-types such as Great Tusk, Iron Valiant, and Sneasler. Similarly, Gholdengo handles offensive threats that may overwhelm Moltres, such as pivot Sneasler and Iron Valiant, while Moltres covers it against Cinderace and Kingambit. Setup sweepers such as Kingambit and Iron Valiant can make great use of Moltres's ability to generate free turns by pivoting them into play and spreading burn for easier setup.</p>"
      },
      "Specially Defensive": {}
    },
    "credits": {"writtenBy": [{"username": "SenSequ", "user_id": 642099}], "teams": [{"name": "Quality checked by", "members": [{"username": "hamiltonion", "user_id": 40598}, {"username": "SetsuSetsuna", "user_id": 548068}]}, {"name": "Grammar checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Moltres-Galar": {
    "outdated": true,
    "sets": {
      "Double Dance": {
        "description": "<p>Galarian Moltres is a terrifying sweeper due to its access to both Nasty Plot and Agility as well as a near-unresisted STAB combination. After one Nasty Plot boost, it can 2HKO the likes of Assault Vest Galarian Slowking and Curse Garganacl, and after one Agility boost, it can outspeed would-be faster Pokemon such as +1 Iron Valiant, Choice Scarf Gholdengo, and +1 Walking Wake. Tera Blast Fairy lets it OHKO Hoopa-U while also being able to net 2HKOs on Kingambit, Assault Vest Hoopa-U, and Dragonite, all after one Nasty Plot boost. Tera Fairy also maintains its Dark resistance while letting it potentially set up in the face of Dragon-type attacks from foes like Dragapult. Alternatively, Hurricane is a strong neutral STAB move that prevents Galarian Moltres form relying too much on Terastallization to function. Tera Dark boosts Fiery Wrath's power, being able to OHKO Assault Vest Galarian Slowking after a Nasty Plot boost and Stealth Rock damage, as well as being able to 2HKO specially defensive Moltres and Assault Vest Toxapex after a Nasty Plot boost. Tera Flying is only to be used if running Hurricane, which can OHKO Zamazenta without a Nasty Plot boost, as well as non-Assault Vest Azumarill and Enamorus after a Nasty Plot boost. Sitrus Berry lets it set up much more easily, and can potentially let it trigger Berserk twice. Heavy-Duty Boots allows it to ignore Stealth Rock. Finally, Weakness Policy is a viable alternative if running dual screens support to take on super effective hits more comfortably. Because of its reliance on setup, Galarian Moltres is best utilized on hyper offense teams. Hence, it appreciates entry hazard support from suicide leads such as Glimmora, Hisuian Samurott, and Meowscarada so that incoming foes can be worn down for Galarian Moltres to clean. Dual screens from Dragapult lets it setup much more easily, esepcially for Weakness Policy variants. Hazard control is a must when running Galarian Moltres due to its vulnerability to Stealth Rock, so it appreciates partners such as Great Tusk and Hatterene with their access to Rapid Spin and Magic Bounce. The two of them can also threaten special walls that can hinder a Galarian Moltres sweep, with Great Tusk being able to OHKO Galarian Slowking and 2HKO Ting-Lu, while Hatterene can 2HKO Clodsire. In return, Galarian Moltres can set up on and threaten Zamazenta for Great Tusk and Gholdengo for Hatterene. Bulky Unaware users such as Dondozo as well as special walls like Garganacl prevent Galarian Moltres from performing its sweep. Hence, offensive Zapdos pairs well with Galarian Moltres, being able to 2HKO both of the aforementioned Pokemon, provided Garganacl is Tera Water. Lastly, Galarian Moltres can facilitate sweeps from physically oriented sweepers like Kingambit by removing obstacles like Great Tusk and Gholdengo.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "CaptainDaimyo", "user_id": 602431}], "teams": [{"name": "Quality checked by", "members": [{"username": "BreloomBuddy", "user_id": 619748}, {"username": "Sp0oN1oRd", "user_id": 513254}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Dragonite": {
    "outdated": true,
    "sets": {
      "Offensive Dragon Dance": {
        "description": "<p>Multiscale combined with solid natural bulk, a high Attack stat, and Dragon Dance enable Dragonite become a deadly set-up sweeper. Extreme Speed is an excellent move for any physical sweeper, due to its high power and initiative over other priority users such as Kingambit. Earthquake provides coverage against bulky foes such as Toxapex, Garganacl, and Clodsire. Fire Punch OHKOes Scizor and 2HKOes physically defensive Corviknight after a Dragon Dance and Stealth Rock. Alternatively, Ice Spinner hits opposing Dragonite, Great Tusk, and Dragapult super effectively, notably OHKOing Dragapult after a Dragon Dance. Heavy-Duty Boots + Roost improves Dragonite's longevity and possibly enables it to retain Multiscale and obtain multiple boosts; preserving Multiscale is particularly useful for surviving Draco Meteor from Timid Choice Specs Dragapult. Encore can be used to provide setup opportunities and eventually overwhelm bulky Pokemon like Corviknight, Bulk Up Great Tusk, and Curse Garganacl. Tera Normal turns Extreme Speed into an incredibly powerful STAB priority move capable of shredding offensive teams after a single boost, and a timely typing change also removes Dragonite's weaknesses to Ice, Fairy, and Dragon, which can buy a free turn to set up. An Adamant nature is preferred since it maximizes the power of Extreme Speed, which often makes makes Speed stats irrelevant, but a Jolly nature can also be used to outspeed the Normal-immune Dragapult after a Dragon Dance, which is especially useful if Dragonite is running Ice Spinner.</p> <p>Offensive Dragon Dance Dragonite regularly serves as a potent win con on offensive teams that can also act as a revenge killer against fast and frail threats. Multiscale Dragonite's considerable bulk, as well as Ghost immunity with Tera Normal provides significant defensive utility for offensive teams. In particular, teams using frail offensive Pokemon such as Iron Valiant appreciate the defensive utility Dragonite brings. In return, these Pokemon can help wallbreak for a late-game Dragonite sweep. Entry hazard support from Great Tusk, Glimmora, and Garchomp is appreciated to weaken Pokemon such as Iron Valiant into range of boosted Extreme Speed. Dual screens support from Grimmsnarl is a potential option that can supplement Dragonite's already great bulk and virtually guarantee the ability to acquire multiple boosts. Since Dragonite struggles against bulky Unaware users such as Dondozo and Skeledirge, a teammate that can switch into and check these Pokemon, such as Rotom-W, is appreciated. Rotom-W can cripple these physical walls with Trick, gain momentum against them with Volt Switch, and absorb Will-O-Wisp from Skeledirge.</p>"
      },
      "Bulky Dragon Dance": {
        "description": "<p>With the combination of its solid natural bulk, valuable typing, reliable recovery in Roost, and Multiscale, Dragonite can accrue multiple Dragon Dance boosts and become a dangerous bulky setup sweeper. It can set up on common Pokemon such as Great Tusk lacking Bulk Up or Ice Spinner, and even super effective attacks from Iron Valiant and Choice Specs Dragapult thanks to Multiscale. Extreme Speed alongside Tera Normal lets Dragonite clean up late-game, OHKOing faster threats like Meowscarada and potentially Cinderace at +1. It also outprioritizes Meowscarada's Sucker Punch as well as Grimmsnarl's Prankster-boosted Reflect and Thunder Wave. Earthquake covers Normal-resistant and -immune Pokemon, including foes like Dragapult, non-Air Balloon Gholdengo, Garganacl, and Kingambit. 144 HP EVs allow Dragonite to survive Tera Fairy Iron Valiant's Moonblast at +1 through Multiscale. Aside from strengthening Dragonite's Extreme Speed, Tera Normal sheds off its weaknesses to give it setup opportunities against would-be threats like Dragapult and Hatterene. Heavy-Duty Boots keeps Multiscale intact by ignoring Stealth Rock.</p> <p>Bulky Dragon Dance Dragonite fits well on bulky offense. A defensive backbone consisting of Pokemon like Ting-Lu, Gholdengo, and Corviknight is valuable to check threats like Dragapult and Iron Valiant, which would threaten Dragonite prior to boosting; in return, Dragonite can answer threats like Roaring Moon and Cinderace for them. Garchomp, Glimmora, and Ting-Lu can reliably set entry hazards, which rack up chip damage onto walls such as Dondozo, Great Tusk, and Garganacl and puts revenge killers like Iron Valiant into guaranteed KO range of +1 Tera Normal Extreme Speed. Wallbreakers such as Breloom and Great Tusk can punch holes early-game and overwhelm Dragonite's checks, such as Corviknight, Dondozo, Skeledirge, and defensive Great Tusk. Moreover, Breloom can incapacitate foes with Spore to give setup opportunities for Dragonite, while Great Tusk can use Knock Off to cripple Corviknight and Dondozo and pop Gholdengo's Air Balloon.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band makes Dragonite one of the most dangerous wallbreakers in the tier. Unaware users like Dondozo and Skeledirge may switch into Dragonite expecting a Dragon Dance variant but take massive damage from a Choice Band-boosted attack instead. Outrage is an extremely powerful STAB move capable of 2HKOing virtually any Pokemon that does not resist it, which even includes physically defensive walls like Great Tusk and Dondozo. It can also OHKO opposing Dragonite, even with Multiscale intact. Breaking walls is not the only role Dragonite fulfills, as Extreme Speed is a strong priority move that allows it to revenge kill threats like Iron Valiant and Roaring Moon with some prior chip damage, or clean up late-game. Earthquake provides strong coverage, hitting grounded Steel-types like Gholdengo and Kingambit that resist Outrage and Extreme Speed. It's also Dragonite's strongest attack against walls like Garganacl, Toxapex, and Skeledirge to avoid locking it into Outrage. There are a couple of different options for the last moveslot. Fire Punch provides coverage for Corviknight and Tera Steel Rotom-W. Iron Head deals significant damage to Fairy-types like Hatterene and Scream Tail, as well as Tera Fairy users like Garganacl and Skeledirge. Thunder Punch is Dragonite's best option for dealing with Azumarill while also providing coverage for Corviknight. Ice Spinner is another option to hurt the likes of Great Tusk, Garchomp, and opposing Dragonite without locking into Outrage. It also ends Psychic Terrain, which allows Dragonite to use Extreme Speed against grounded Pokemon later on. Multiscale allows Dragonite to take even super effective hits from offensive Pokemon like Roaring Moon, Iron Moth, and Choice Specs Dragapult and KO them back. Tera Normal makes Extreme Speed even more powerful, OHKOing offensive Volcarona and Iron Moth, and removes Dragonite's usual weaknesses to attacks like Iron Valiant's Moonblast, which can be useful for revenge killing and cleaning.</p> <p>Choice Band Dragonite fits best on mostly offensive teams where it can break holes in the opposing team for its teammates to take advantage of and where its strong priority may be needed against other offensive teams. However, while Choice Band Dragonite is very powerful, it also requires a lot of support. As it is vulnerable to Stealth Rock, not only because Dragonite is weak to it but also because it negates Multiscale, strong entry hazard control is important. This can be in the form of entry hazard removal, such as Rapid Spin Great Tusk, but also in the form of entry hazard prevention, such as Hatterene and Taunt users like Meowscarada and Greninja. Knock Off users like Great Tusk and Meowscarada can remove Leftovers and Rocky Helmet from walls like opposing Great Tusk and Corviknight, which makes them easier to break for Dragonite and keeps Multiscale intact. Switching Dragonite directly into attacks should generally be avoided, since keeping Multiscale intact is desirable, so it appreciates teammates that can bring it in safely. Examples include pivot move users, such as Cinderace, Rotom-W, Corviknight, and Slowking, as well as Eject Button or Eject Pack users, such as Eject Button Hatterene, Eject Pack Great Tusk, and Eject Pack Gholdengo. Physical attackers like Kingambit and Roaring Moon appreciate Dragonite weakening or removing checks like Great Tusk, Rotom-W, and Dondozo. On the other hand, special attackers like Iron Valiant and Iron Moth can lure in checks like Clodsire and Slowking for Dragonite to punish. Iron Moth has the additional benefit of helping with Dragonite's fourth moveslot issue, as it can threaten Steel-types like Corviknight for Dragonite lacking Fire Punch and Fairy-types like Hatterene for Dragonite lacking Iron Head.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}, {"username": "nimzowitsch", "user_id": 272785}, {"username": "Ruft", "user_id": 295110}], "teams": [{"name": "Quality checked by", "members": [{"username": "ausma", "user_id": 360720}, {"username": "Milo", "user_id": 540138}, {"username": "chimp", "user_id": 197439}, {"username": "SetsuSetsuna", "user_id": 548068}, {"username": "royalfluxh", "user_id": 493260}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "autumn", "user_id": 384270}, {"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Azumarill": {
    "outdated": true,
    "sets": {
      "Belly Drum": {
        "description": "<p>Azumarill provides a versatile defensive answer for its frailer teammates while maintaining a strong offensive presence that pulls its weight on hyper offense. Maximum HP with Sitrus Berry highlights Azumarill’s naturally exceptional defensive typing, allowing it to serve as a one time check to OU staples such as Dragapult, Hydreigon, Roaring Moon, and Walking Wake. Belly Drum is an incredibly threatening option that lets Azumarill take advantage of the switches it forces from Pokemon such as Hydreigon to get setup opportunities. It is also a threatening late-game sweeper, as it can outspeed and OHKO defensive walls such as Clodsire, Slowking, and Garganacl while KOing most neutral faster targets such as Gholdengo and Iron Valiant with a +6 Aqua Jet. The threat of Belly Drum also lets Azumarill force uncomfortable mind games against Pokemon it can force out like weakened Great Tusk. Encore can be run over Liquidation to lock foes into undesirable moves to create more setup opportunities; this should be run with maximum Speed investment. Tera Water lets Azumarill OHKO even resisted targets such as Greninja, Meowscarada, and Dragapult with +6 Aqua Jet, as well as OHKOing Amoonguss and KOing Toxapex after Stealth Rock.</p> <p>Azumarill serves as a valuable late-game sweeper for offense teams. Strong special attackers such as Iron Valiant and Greninja can help pressure Water-resistant foes such as Toxapex and Amoonguss to allow Azumarill to sweep without needing to Terastallize while providing Azumarill with setup opportunities against their checks like Dragapult and Hydreigon. Other setup sweepers such as Dragonite and Roaring Moon complement Azumarill, appreciating Azumarill's ability to break Amoonguss and Toxapex and wearing down each other's checks like Dondozo and Skeledirge. Entry hazard support from Pokémon like Glimmora and Garchomp provides the necessary chip damage to turn near OHKOs into true OHKOs on resisted Pokémon such as Roaring Moon, Dragapult, and Meowscarada with Tera Water +6 Aqua Jet. Azumarill can pair well with teammates like Grimmsnarl and Orthworm that provide it with more setup opportunities. Pelipper is also a strong partner for Azumarill, as rain provides an extreme damage boost, giving it the ability to avoid needing to Terastallize versus Pokemon such as Toxapex, Dragapult, and Amoonguss.</p>"
      },
      "Choice Band": {
        "description": "<p>Equipped with a Choice Band, Azumarill becomes a powerful wallbreaker strong enough to do significant damage to the opposing team. Combine that with Huge Power, priority from Aqua Jet, and the boost to STAB that comes from Tera Water, and Azumarill goes from powerful to extremely threatening for any ill-prepared team. Ice Spinner as coverage is useful to hit Amoonguss and Water Absorb Clodsire, while Superpower is an alternative to deal with Steel-types like Kingambit and Orthworm that would be harder to damage without it. 140 Speed EVs allow Azumarill to outspeed Corviknight and Skeledirge. The remaining 116 EVs in HP increase its survivability. This, along with the incredible defensive typing of Water / Fairy protecting it from the many Dragon-type threats roaming the tier, such as Dragapult and Walking Wake, gives it the opportunity to safely switch into many otherwise frightening Pokemon. Tera Water and Fairy are for powering up the Choce Band-boosted STAB attacks Azumarill uses. Tera Water is preferred to get the extra boost to Aqua Jet, but Tera Fairy can also be used to reduce the continual damage from Garganacl's Salt Cure.</p> <p>Choice Band Azumarill is best used on offensive teams and benefits from the support of Pokemon that can open up opportunities for it to break holes. Pokemon like Dragapult and Rotom-W can be excellent teammates by making ample use of pivoting moves throughout a game to let Azumarill in safely. Special attackers like Iron Valiant and Iron Moth can be helpful to break through walls like Dondozo that Azumarill would otherwise struggle with. Faster Pokemon like Cinderace and Roaring Moon are useful as speed control to help cover Azumarill's low Speed. Most importantly though, entry hazards help Azumarill wear down tougher foes to be picked off later in the battle, so hazard setters like Great Tusk and Glimmora, as well as spinblockers like Gholdengo, are always appreciated teammates. Defensive Pokemon that have the tools to deal with Azumarill, like Rotom-W, Toxapex, and Dondozo, are the biggest thorns in Azumarill's side. Having another wallbreaker like Dragonite and Tera Electric Iron Valiant on the team can help mitigate some of these issues.</p>"
      },
      "Assault Vest": {
        "description": "<p>Azumarill leverages its good bulk and typing to check key special attackers such as Walking Wake, Hydreigon, and Greninja while maintaining a powerful offensive presence. An Assault Vest offers a noticeable increase to Azumarill's special bulk, letting it check a wider pool of special attackers such as Hisuian Zoroark and Dragapult while also granting it greater flexibility in its attacking options compared to Choice Band. Liquidation and Play Rough serve as Azumarill's primary STAB attacks, possessing fantastic neutral coverage and hitting many threats such as Dragonite, Walking Wake, and Iron Valiant for super effective damage. Aqua Jet allows Azumarill to revenge kill weakened foes such as Great Tusk and Iron Moth. Ice Spinner is a powerful coverage option, 2HKOing many of Azumarill's common switch-ins such as Amoonguss and Water Absorb Clodsire. Ice Spinner's ability to remove Terrain also makes it particularly useful against opposing Psychic Terrain teams. Tera Water increases the power of Azumarill's Water-type STAB moves, letting it pick off foes such as Iron Moth from higher ranges with Aqua Jet and allowing its Liquidation to 2HKO Hatterene and OHKO offensive Great Tusk. However, Tera Water does come with noticable drawbacks, namely removing Azumarill's immunity to Dragon-type moves and resistances to Fighting- and Dark-type moves, which can make it a shakier check to Walking Wake and Greninja.</p> <p>Assault Vest Azumarill's talents will best be used by more offensive teams looking for a temporary answer to the aforementioned special threats. Partners at risk of being revenge killed by Walking Wake and Iron Valiant, such as Great Tusk and Hydreigon, will greatly appreciate Azumarill's ability to act as a buffer against these Pokemon. Despite Azumarill's good bulk, its tanking prowess can often be undermined by its vulnerability to passive damage from entry hazards and Rocky Helmet. Great Tusk is therefore an excellent partner, providing Rapid Spin support and being able to lure and remove Rocky Helmet from Pokemon such as Corviknight with Knock Off. Meowscarada is also an excellent ally, being able to shut down opposing entry hazard setters with Taunt while also providing Knock Off support. Furthermore, both Great Tusk and Meowscarada can support Azumarill by laying down entry hazards, which it will greatly appreciate given its ability to force switches. Ting-Lu can similarly lay down multiple layers of entry hazards and ease pressure exerted onto Azumarill in dealing with threats such as Dragapult and Iron Moth. Teammates that can bring Azumarill in safely with a pivoting move, such as Cinderace and Dragapult, are also recommended. Cinderace can assist Azumarill in dealing with entry hazards via Court Change, while Dragapult can deal with Orthworm, which may sometimes use Azumarill as an entry point to pass Shed Tail. In return, Azumarill can check key Pokemon such as Greninja that would threaten them. Azumarill greatly struggles against bulky Water-types such as Rotom-W, Toxapex, Dondozo, and Tera Water Garganacl. Hydreigon can exploit both Toxapex and Garganacl's passivity to set up with Substitute and Nasty Plot, though it must be wary of switching in against Toxic and Salt Cure. Breloom can pressure Dondozo and Tera Water Garganacl with Bullet Seed, while Covert Cloak Gholdengo matches up quite nicely against Garganacl and opposing Breloom and can pivot into Will-O-Wisp from Rotom-W.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UUTS", "user_id": 626573}, {"username": "Nichalho", "user_id": 359575}, {"username": "Magcargo", "user_id": 177111}], "teams": [{"name": "Quality checked by", "members": [{"username": "chimp", "user_id": 197439}, {"username": "SetsuSetsuna", "user_id": 548068}, {"username": "Estarossa", "user_id": 461329}]}, {"name": "Grammar checked by", "members": [{"username": "Estarossa", "user_id": 461329}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Slowking-Galar": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Galarian Slowking is an excellent defensive pivot thanks to good Special Defense, Regenerator, and a solid defensive typing. Future Sight allows Galarian Slowking to pressure a number of offensive threats like Iron Valiant, Great Tusk, and Zamazenta and do significant damage to defensive foes like Toxapex and Clodsire. Chilly Reception alongside minimum Speed investment allows Galarian Slowking to serve as the metagame's slowest pivot, able to safely bring in offensive teammates safely while changing the weather to snow, which disrupts weather archetypes like rain and sun. Galarian Slowking has a number of options for its last move: Thunder Wave allows it to cripple fast offensive threats like Dragapult and Weavile while preventing Kingambit from freely switching into Galarian Slowking, Toxic wears down opposing walls like Ting-Lu and Dondozo as well as Thunder Wave-immune targets like Raging Bolt, and Slack Off offers immediate recovery, allowing Galarian Slowking to stay on the field longer. Tera Water lets Galarian Slowking stand up to powerful Fire-types like Gouging Fire and Cinderace as well as offensive Water-types like Walking Wake, while Tera Fairy gives it an immunity to strong Dragon-type attacks from the likes of Walking Wake, Raging Bolt, and Kyurem. Tera Dark is another option that turns Galarian Slowking's Dark- and Ghost-type weaknesses into resistances, making it more resilient against foes like Greninja and Dragapult. 16 Defense EVs allow Galarian Slowking to live a Knock Off from Meowscarada.</p> <p>Galarian Slowking is an excellent choice for a pivot on balance teams, as frail offensive teammates like Kyurem and Iron Valiant appreciate being brought in safely as well as the pressure applied by Future Sight. Kyurem in particular enjoys the Defense boost from snow, allowing it to stomach attacks from foes like Zamazenta and Kingambit more easily. Due to its average Defense, Galarian Slowking benefits from physically defensive partners like Archaludon and Skarmory to form a solid defensive core. Galarian Slowking struggles against special walls like Ting-Lu and Skeledirge if not running Toxic, so physically offensive teammates like Weavile and Hisuian Samurott that can take care of them make good partners. Additionally, Galarian Slowking is walled by Steel-types like Corviknight and Heatran, so teammates like Volcarona and Great Tusk that can remove them are necessary. Ground-immune teammates like Gliscor, Landorus-T, and Corviknight are also good partners for Galarian Slowking due to its weakness to common threats like Great Tusk and opposing Gliscor.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Dreadfury", "user_id": 408271}, {"username": "chimp", "user_id": 197439}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Scizor": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Skarmory": {"sets": {"Iron Defense": {}}},
  "Kingdra": {"sets": {"Rain Sweeper": {}}},
  "Smeargle": {"sets": {"Lead": {}}},
  "Blissey": {"sets": {"Defensive": {}}},
  "Suicune": {"sets": {"Calm Mind": {}}},
  "Tyranitar": {"sets": {"Choice Band": {}, "Sand setter": {}}},
  "Blaziken": {"sets": {"Swords Dance": {}}},
  "Pelipper": {"sets": {"Rain Setter": {}}},
  "Torkoal": {"sets": {"Sun Setter": {}}},
  "Milotic": {"sets": {"Defensive": {}}},
  "Latias": {"sets": {"Double Dance": {}}},
  "Latios": {"sets": {"Choice Scarf": {}, "Choice Specs": {}}},
  "Deoxys-Defense": {"sets": {"Utility": {}}},
  "Deoxys-Speed": {"sets": {"Hazard Lead": {}, "Offensive": {}, "Dual Screens": {}}},
  "Empoleon": {"outdated": true, "sets": {"Defensive Pivot": {}}},
  "Garchomp": {"sets": {"Swords Dance": {}}},
  "Weavile": {"sets": {"Offensive": {}}},
  "Gliscor": {
    "sets": {
      "Spikes": {
        "description": "<p>Gliscor is a premier Spikes user. The combination of Poison Heal and Protect allows it to outlast common entry hazard removal options such as Great Tusk and Cinderace, setting it apart from its peers. Gliscor can survive some of the strongest neutral attacks in the tier with ease, including Life Orb Darkrai's Dark Pulse, Choice Specs Dragapult's Shadow Ball, and Kingambit's Kowtow Cleave. Its immunity to status conditions helps it against more defensively oriented teams, allowing it to be unfazed by Toxic from opposing Gliscor, Galarian Slowking, and Toxapex or by Will-O-Wisp from Cinderace, Skeledirge, and Dragapult. Protect is not just useful for giving Gliscor a free turn of recovery; it is also useful for scouting the moves of Choice-locked Pokemon that are able to break it, like Kyurem and Walking Wake. Toxic is used to whittle away at the foe’s health, as the combination of Toxic and Protect allows the poison damage to worsen while Gliscor heals itself in the process. Gliscor spreads status exceptionally well because most Pokemon immune to Toxic like Clodsire, Archaludon, and Gholdengo are weak to Earthquake. Toxic is not always required though, as Knock Off can be substituted over it to remove foes' Heavy-Duty Boots, allowing teams that rely on hazard stacking to make progress. Knock Off can be slotted in over Toxic on teams that either lack another Knock Off user or have a different Toxic user. A physically defensive EV spread with an Impish nature lets Gliscor check Pokemon like Great Tusk lacking Ice Spinner, Dragonite, Iron Boulder, Gouging Fire, and Roaring Moon, and the Special Defense EVs provide enough special bulk to survive Choice Specs Enamorus's Moonblast and Life Orb Deoxys-S's Psycho Boost from full. A specially defensive EV spread can be run instead to check Pokemon like Heatran, Raging Bolt, and Gholdengo, retaining enough physical bulk to live Ogerpon-W's unboosted Ivy Cudgel from full. Both sets run 244 HP EVs to maximize the amount of health Gliscor recovers from Poison Heal. Tera Water lets Gliscor flip bad matchups against Water-types like Walking Wake and Hisuian Samurott as well as Ice-types like Weavile while being a great defensive typing in general. However, this is best reserved as a last resort, since Gliscor immensely appreciates its base typing because of its Stealth Rock neutrality and Spikes immunity. Moreover, Gliscor's teammates will generally get more mileage from Tera, so using it on Gliscor is not worth it most of the time.</p> <p>Gliscor functions best on entry hazard stacking balance teams, since its role compression provides flexibility in what Pokemon and sets these structures can run. Gliscor’s role as a Spikes setter and Toxic user gives its team a much easier time breaking down opposing defensive balances and pivoting cores, punishing switches and poisoning foes that decide to stay in. Gliscor works in conjunction with its offensive partners by forcing switches while also soaking up incoming attacks from powerful offensive threats, giving it and its teammates ample opportunities to force progress. With these traits, Gholdengo makes an amazing teammate for Gliscor, since after Gliscor sets up Spikes, Gholdengo blocks all removal options aside from Court Change Cinderace, which Gliscor can beat one-on-one. Galarian Slowking is another great teammate, being able to sponge hits from strong special attackers such as Kyurem, Walking Wake, Serperior, and Enamorus, many of which threaten Gliscor out. In return, Gliscor walls physical Ground-type attackers that easily dispose of Galarian Slowking, like Great Tusk, Ting-Lu, and Landorus-T. Stealth Rock users such as Ting-Lu and Clefable pair very well with Gliscor, and stacking hazards is a very effective way at making progress. Knock Off users such as the aforementioned Clefable, as well as Meowscarada and Weavile, work well with Gliscor, since they allow it to run Toxic to punish bulkier Pokemon, and they are able to remove Heavy-Duty Boots from Pokemon that do not come in on Gliscor so that its hazards can chip more effectively throughout the game. Late-game cleaners such as Dragapult, Meowscarada, and Kingambit all work well with Gliscor too, as they appreciate their checks having to constantly switch and get chipped by Spikes early- and mid-game, putting them into KO range late-game.</p>"
      },
      "Swords Dance": {
        "description": "<p>Gliscor can make a lot of easy progress throughout the game thanks to its great bulk, being able to use Swords Dance in front of opposing Gliscor and other passive Pokemon such as Clefable, Clodsire, and Toxapex to become an offensive threat. Gliscor being permanently affected by poison allows it to use Facade consistently, which breaks Pokemon such as Ogerpon-W, Hawlucha, and Dragonite.[B] [/B]Swords Dance Gliscor can threaten common Knock Off absorbers like Clefable, particularly on Heavy-Duty Boots spam teams, so it can effectively use Knock Off instead against these teams to punish different foes, especially entry hazard-weak Pokemon such as Volcarona, Zapdos, and Enamorus.[B] [/B]Ice Fang is another option that can be run over Knock Off to shut down opposing Gliscor, which may give the team trouble, or to have better coverage and damage against opposing Dragon-, Flying-, and Grass-types such as Dragapult, Dragonite, and Rillaboom. Tera Water flips Gliscor's matchup against Ice- and Water-types such as Weavile and Barraskewda defensively; however, it becomes a worse check to Pokemon such as Rillaboom. For teams that are not as strong defensively into Grass-types, Tera Dragon is recommended, as it covers for both Water and Grass, and most notably, it shuts down Ogerpon-W and gains a better matchup versus Serperior and other potent offensive threats that would have been able to beat Gliscor even with Tera Water. 16 Special Defense EVs allow Gliscor to survive both a Choice Specs Enamorus's Moonblast and Life Orb Deoxys-S's Psycho Boost from full health, or it can be given more special bulk to better handle common offensive threats like Iron Valiant, Dragapult, and Iron Moth, which may chunk it heavily and affect its time on field otherwise. The 36 Defense EVs on the specially bulky EV spread allow Gliscor to comfortably survive Ogerpon-W's Ivy Cudgel from full health.</p> <p>Swords Dance Gliscor best fits on teams that need to break balance structures, most prominently teams that utilize multiple Heavy-Duty Boots users. Gliscor enjoys being a part of Spikes-stacking teams that need guaranteed progress against opposing Heavy-Duty Boots spam teams, which Spikes-stacking teams usually lose to. As a result, Ting-Lu and Skarmory are great teammates, as they can set up entry hazards and directly complement Gliscor defensively. Gholdengo also pairs well, preventing Defog and hindering the removal of hazards. However, Gliscor's lack of Toxic or hazards makes it exert less pressure long-term, prevents it from placing opposing Pokemon on a timer such as Ting-Lu and Great Tusk, and means it cannot punish any switch-ins to it with a Toxic. Teammates such as Weaville and Choice Specs Dragapult help Gliscor's lack of pressure with great upfront damage. Swords Dance Gliscor is also unable to deal with the common Iron Defense Skarmory on balance teams or muscle through common defensive walls such as Dondozo and Corviknight; however, access to Knock Off allows it remove their items at the very least, which could be helpful in the long run for Gliscor's teammates. Teammates such as, Kyurem and Rotom-W are great with Swords Dance Gliscor, as they can beat the fatter Pokemon that Gliscor is unable to muscle through, such as the aforementioned Skarmory, Ting-Lu, and Corviknight. Gholdengo and Ogerpon-W are also good options, as they are able to turn threats such as Skarmory and Dondozo into setup fodder.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Exotic64", "user_id": 499397}, {"username": "alkazoth", "user_id": 518682}], "teams": [{"name": "Quality checked by", "members": [{"username": "ausma", "user_id": 360720}, {"username": "alkazoth", "user_id": 518682}, {"username": "Morkal", "user_id": 367494}, {"username": "autumn", "user_id": 384270}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Mamoswine": {"outdated": true, "sets": {"Stealth Rock": {}}},
  "Rotom-Wash": {"sets": {"Defensive Pivot": {}}},
  "Heatran": {
    "outdated": true,
    "sets": {
      "Offensive": {
        "description": "<p>With its unique typing and high stats all around the board, Heatran makes for a bulky attacker able to threaten all kinds of Pokemon in the tier. Magma Storm allows Heatran to trap and potentially remove opposing Pokemon, as well as chipping them down with its passive damage. Earth Power hits Toxapex and Fire-types such as Cinderace, Iron Moth, Volcanion, and opposing Heatran for super effective damage. Taunt can be used to stop Toxapex's Recover and Galarian Slowking's Chilly Reception and Slack Off, thus allowing Heatran to trap them. Heatran is an effective Stealth Rock user thanks to its good matchup against common entry hazard removal options in Defog Corviknight and bulky Court Change Cinderace. Tera Blast Grass gives Heatran a way to hit Water-types such as Rotom-W, Hisuian Samurott, and Azumarill, as well as threatening an OHKO against Great Tusk. Furthermore, Tera Grass works well with Flash Fire and turns Heatran's Ground and Water weaknesses into resistances, improving its matchup against the aforementioned Pokemon as well as Volcanion and letting it potentially trap the likes of Dondozo and Clodsire. Leftovers lets Heatran heal throughout the game and makes it easier for it to trap its targets. Air Balloon is another option that allows Heatran to take a hit from Pokemon that would usually target it with Earthquake or Earth Power such as Enamorus, Ursaluna, and opposing Heatran and heavily damage them. The matchup against opposing Heatran also makes a Timid nature desirable to outspeed the other and hit it with Earth Power; it also lets Heatran outspeed the likes of Modest Gholdengo and Volcanion. Alternatively, Heatran can opt to run a Modest nature to further boost its power.</p> <p>Heatran usually finds itself on bulky offense teams due to its ability to threaten defensive Pokemon and common forms of entry hazard control. Kingambit appreciates Heatran's support against Will-O-Wisp users in Cinderace, Dragapult, and Moltres and its ability to take on walls such as Corviknight as well as Dondozo and Great Tusk if Terastallized. Heatran's ability to force heavy damage against Amoonguss, Hatterene, and defensive Zapdos makes it a good Great Tusk partner. Great Tusk, in turn, provides Rapid Spin support to keep the field clear from entry hazards, which Heatran tends to get worn down by. Zapdos can defensively check Fighting-types that outspeed Heatran, such as Iron Valiant, Zamazenta, Sneasler, and offensive Great Tusk, as well as Hisuian Samurott, which tends to use Heatran as an opportunity to fire off Ceaseless Edge. Enamorus is also able to check Iron Valiant, Zamazenta, Great Tusk, and Hisuian Samurott, though it struggles to safely switch into them consistently due to its lesser bulk. Dragapult can threaten the Dragon-types that don't take much damage from Heatran's attacks, such as Dragonite, Walking Wake, and Garchomp. Furthermore, its Water resistance and Fighting immunity let it answer Volcanion and Zamazenta aiming to KO Heatran. Lastly, Rillaboom's ability to summon Grassy Terrain via Grassy Surge provides Heatran with extra passive recovery, boosts the power of its Tera Blast Grass, and weakens the damage it takes from Earthquake, letting Heatran survive physically defensive Great Tusk's Earthquake from full health.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Heatran's natural high bulk and decent typing make it a solid wall able to shrug off resisted and weaker neutral hits and, in conjunction with Flash Fire, take on the likes of Iron Moth and bulky Cinderace. Magma Storm is a strong STAB move that lets it potentially trap the likes of Toxapex and Galarian Slowking, and which even Fire-resistant foes such as Garchomp and Rotom-W can struggle against due to its passive damage. Taunt allows Heatran to block status moves such as Toxapex's Recover and Galarian Slowking's Chilly Reception. Alternatively, Protect can be used to gain extra Leftovers recovery, deal further damage with Magma Storm, and scout Choice item users such as Dragapult, Enamorus, and Zamazenta. Earth Power provides a way for Heatran to dent Fire-types such as Cinderace, Iron Moth, and opposing Heatran, and it lets Heatran continuously chip Toxapex and Galarian Slowking to more easily remove them after having trapped them. Stealth Rock is used to take advantage of its good matchup against hazard control options such as Hatterene, Corviknight, and bulky Cinderace. Tera Blast Grass is an alternative that lets Heatran threaten the likes of Rotom-W and Hisuian Samurott. Lastly, Will-O-Wisp is another option that allows Heatran to punish Dragonite, Garchomp, and Roaring Moon trying to switch in, as well as Kingambit aiming to revenge kill Heatran with Sucker Punch. The set opts for near maximum Special Defense investment with enough Speed EVs to outspeed Adamant Kingambit and Azumarill. The 4 Defense EVs in conjunction with maximum HP allows Heatran to always survive an Earthquake from Clodsire from full health. Tera Grass's benefits go beyond the Tera Blast coverage, as it also gives Heatran a resistance to Water- and Ground-type attacks, which expands its range of Pokemon it can trap to include Dondozo, Clodsire, and Garganacl. Tera Grass also synergizes beautifully with Flash Fire, as it removes the potential weakness to Fire-type attacks. Tera Flying is another option that gets rid of Heatran's weakness to Fighting- and Ground-type attacks, notably improving its matchup against Great Tusk and Landorus-T. Dragapult appreciates Heatran's ability to switch into Choice Scarf Gholdengo's Shadow Ball, Choice Scarf Enamorus's Moonblast, and opposing Dragapult's STAB moves. Great Tusk is another Pokemon that appreciates Heatran's support against said special attackers, as well as against Zapdos, Amoonguss, and Hatterene, and in turn it is able to keep Heatran healthy by removing entry hazards with Rapid Spin. Heatran and Toxapex make for a solid defensive core thanks to the former's ability to take on Hatterene, Zapdos, and Gholdengo that annoy Toxapex, and the latter's resistance to Fighting- and Water-type moves that aim to target Heatran such as Close Combat from Iron Valiant, Sneasler, and Zamazenta, Walking Wake's Hydro Steam, and Greninja's Hydro Pump.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "SetsuSetsuna", "user_id": 548068}], "teams": [{"name": "Quality checked by", "members": [{"username": "DKM", "user_id": 402001}, {"username": "Dreadfury", "user_id": 408271}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Milak", "user_id": 262594}]}]}
  },
  "Cresselia": {
    "outdated": true,
    "sets": {
      "Calm Mind": {
        "description": "<p>Calm Mind Cresselia is a potent late-game wincon thanks to its gargantuan bulk, reliable recovery, and access to Calm Mind + Stored Power as well as solid coverage to deal with the Dark-types. After several Calm Mind boosts, Stored Power allows Cresselia to muscle past both Unaware walls like Skeledirge and Dondozo and bulky Psychic-resistant foes like Corviknight, Gholdengo, and Heatran while making it nigh impossible to KO with special attackers. Moonblast rounds out Cresselia's coverage, allowing it to hit Dark-types like Ting-Lu, Hisuian Samurott, and Greninja super effectively while being able to at least damage Kingambit; Tera Blast Fighting greatly improves Cresselia's matchup against Kingambit and hits these Dark-types harder than Moonblast, but makes Cresselia more reliant on Terastallization. Leftovers grants Cresselia crucial passive healing, allowing it to conserve its limited Moonlight PP long-term; Covert Cloak, on the other hand, blocks secondary effects from an array of moves, including Heatran's Magma Storm, Garganacl's Salt Cure, Zapdos's Discharge, and Sneasler's Dire Claw, allowing Cresselia to set up against these threats more safely. Grassy Seed is an option if Cresselia is used on Grassy Terrain hyper offense teams, which gives it more opprotunities to set up in the face of physical attackers while also boosting its Stored Power. Tera Poison has wonderful synergy with Levitate, giving Cresselia a single weakness to Psychic-type attacks, granting it resistances to Poison- and Fairy-type attacks, and an immunity to Toxapex's Toxic while still maintaining its Fighting resistance. Defensively, Tera Fighting lets Cresselia flip its Dark weakness against prominent Pokemon like Meowscarada, Greninja, Hisuian Samurott, and the aforementioned Kingambit as well. 52 Speed EVs allow Cresselia to outspeed Kingambit.</p> <p>Cresselia fits well on an array of hyper offense, offense, and balance teams capable of supporting such a potent wincon. Heatran, Hisuian Samurott, and Landorus-T can provide entry hazard support to wear down foes over time. Heatran can also use Will-O-Wisp to cripple Kingambit or trap and wear down threats like Haze Toxapex and Chilly Reception Galarian Slowking with Magma Storm and Taunt; in return, Cresselia can handle threats like Great Tusk and Zamazenta that Heatran struggles against. Kingambit is ubiquitous and is a major thorn in Cresselia's side; as such, Great Tusk, Iron Valiant, and Low Kick Kingambit are crucial partners that can help stop opposing Kingambit's attempt to countersweep. Assault Vest Toxapex is a great teammate for Cresselia; it can take on Encore Iron Valiant, which is a frustrating matchup for Cresselia, and it can trap and deal with opposing defensive Toxapex, which can shut down Cresselia's boosts with Haze and force Cresselia to Tera Poison in order to avoid being crippled by Toxic. Thanks to Grassy Surge, Rillaboom is a necessary partner for Grassy Seed variants; it can support Cresselia with utility options like Knock Off and U-turn too.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Dreadfury", "user_id": 408271}], "teams": [{"name": "Quality checked by", "members": [{"username": "SetsuSetsuna", "user_id": 548068}, {"username": "chimp", "user_id": 197439}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Manaphy": {"sets": {"Tail Glow": {}, "Double Dance": {}}},
  "Darkrai": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Serperior": {"sets": {"Contrary Sweeper": {}}},
  "Samurott-Hisui": {"sets": {"Lead": {}, "Choice Scarf": {}, "Assault Vest": {}}},
  "Excadrill": {"sets": {"Sand Sweeper": {}}},
  "Lilligant-Hisui": {"sets": {"Sun Sweeper": {}}},
  "Cinccino": {"sets": {"Tidy Up": {}}},
  "Reuniclus": {"sets": {"Calm Mind": {}}},
  "Alomomola": {"sets": {"Defensive Pivot": {}}},
  "Mandibuzz": {"outdated": true, "sets": {"Defensive": {}}},
  "Volcarona": {"sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Tornadus-Therian": {"sets": {"Pivot": {}}},
  "Thundurus-Therian": {"outdated": true, "sets": {"Choice Specs": {}, "Nasty Plot": {}, "Pivot": {"description": "<p>These are sample set(s) as we wait for the metagame to settle before working on <a href=\"https://www.smogon.com/forums/forums/ou-analyses.758/\">new analyses</a>. They will be updated as the metagame continues to develop, so stay tuned!</p>"}}},
  "Landorus-Therian": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Landorus-T is an effective Choice Scarf user thanks to its high Attack stat and useful movepool. This, combined with its typing, natural bulk, and exceptional ability in Intimidate, makes it a good offensive pivot. U-turn is useful for generating momentum and bringing in teammates safely when the foe is forced to switch out. Stone Edge hits Flying-types such as Enamorus, Zapdos, Dragonite, and Moltres, notably providing good coverage alongside Earthquake. Grass Knot is crucial for hitting Great Tusk, which would otherwise comfortably take Landorus-T's physical attacks. It is also the best option for hitting Dondozo and Tera Water, Curse, or Iron Defense Garganacl. Tera Ground can be used to boost Landorus-T's already strong Earthquake, potentially helping it clean late-game when all Ground-immune foes have been removed. Tera Blast can be used alongside Tera Flying, as it still hits Great Tusk hard while also hitting Amoonguss and Zamazenta for super effective damage. It also guarantees an OHKO against Iron Valiant. Becoming pure Flying-type also lets Landorus-T potentially survive priority moves such as Aqua Jet from Hisuian Samurott in a pinch.</p> <p>Landorus-T fits well on balanced and bulky offense teams that appreciate speed control and the ability to generate momentum. Wallbreakers and setup sweepers such as Iron Valiant, Dragapult, and Enamorus appreciate being brought in safely with U-turn. Choice Specs Enamorus and Choice Specs Dragapult especially appreciate being in against certain Pokemon that commonly switch into Landorus-T, such as Great Tusk and defensive Zapdos. Offensive Zapdos can also take advantage of these Pokemon while forming a potent VoltTurn core with Landorus-T. Faster special attackers such as Booster Energy Iron Valiant and Choice Scarf Enamorus are problematic for Landorus-T. Therefore, specially defensive Galarian Slowking is a solid teammate to help deal with them. It also consistently switches into Rotom-W, which takes very little from Landorus-T's attacks. Furthermore, Galarian Slowking forms a momentum-generating core with Landorus-T and provides Future Sight support, making Landorus-T more difficult for foes to switch into. Great Tusk forms a strong core alongside Landorus-T to deal with physical attackers such as Sneasler and Cinderace that tend to be overwhelming for one of them to take on alone. Notably, Landorus-T outspeeds Cinderace and can threaten it before getting burned by Will-O-Wisp.</p>"
      },
      "Defensive": {
        "description": "<p>Defensive Landorus-T is a reliable pivot on balance and bulky offensive teams, leveraging its good typing, bulk, and Intimidate to serve as a roadblock to common threats such as Kingambit, Sneasler, and Great Tusk without Ice Spinner. Its Spikes immunity and neutrality to Stealth Rock allow it to comfortably switch in and check the aforementioned Pokemon. Landorus-T is also an excellent Stealth Rock user thanks to its good matchups against key entry hazard removers like Great Tusk and Cinderace. U-turn enables Landorus-T to pivot out of bad matchups and safely bring one of its teammates in. The last slot is flexible depending on a team's needs. Grass Knot deals high damage to Great Tusk, Dondozo, and Tera Water Garganacl, which could otherwise switch in and set up on Landorus-T, and it is useful to open up for teammates such as Kingambit to reliably clean late-game. However, Grass Knot also leaves Landorus-T quite exploitable to key Flying-types and Tera Flying Pokemon such as Moltres, Dragonite, and Kingambit, which can either cripple it with status or setup on it. Taunt is a useful utility move to stop entry hazards from Ting-Lu and Great Tusk and to prevent Enamorus-T and Garganacl from setting up. Finally, Smack Down deals decent damage to Landorus-T's common Flying-type switch-ins as well as Rotom-W, either leaving them vulnerable to Earthquake or forcing them out. 4 Speed EVs are used to outspeed Jolly Kingambit and deal good damage to it with Earthquake. As Landorus-T is a support Pokemon, it will often be more valuable to use Terastallization with other teammates. However, Tera Water lets Landorus-T resist Ice- and Water-type moves from Pokemon such as Greninja, Alolan Ninetales, and Walking Wake. Alternatively, Tera Ghost can be run to spinblock against Great Tusk while still maintaining its positive matchup against Fighting-type moves. Rocky Helmet is the preferred item, as it forces valuable chip damage on key targets such as Sneasler, Great Tusk, and Kingambit. Leftovers can also be run to grant Landorus-T a bit more longevity. Landorus-T typically fits quite well on teams with multiple pivot move users such as Sneasler, Cinderace, and Zapdos, as they can continually apply pressure to each other's counters, especially if entry hazards are up. Zapdos and Rotom-W have the added benefit of having good matchups against Flying-types, which Landorus-T struggles with. Galarian Slowking matches up quite well against strong special attackers such as Zapdos and Enamorus and appreciates Landorus-T's ability to pivot into physical attackers such Great Tusk, Kingambit, and Swords Dance Iron Valiant. Spikes setters such as Ting-Lu and Hisuian Samurott form a potent hazard-stacking core with Landorus-T and can pressure entry hazard removers such as Cinderace and Great Tusk. Strong wallbreakers such as Choice Specs Dragapult, Choice Specs Iron Valiant, and Choice Band Hoopa greatly benefit from Landorus-T's U-turn support, as it can position them to fire off their powerful attacks with little risk and can wear the opposing Pokemon down over time to be in their KO range. Landorus-T is quite exploitable by fast Water-types such as Battle Bond Greninja and Walking Wake; bulky Water-types such as Toxapex can help alleviate the pressure from these Pokemon. Landorus-T's ability to lure and overwhelm physical walls such as Dondozo and Great Tusk with Grass Knot is greatly appreciated by various physical setup sweepers such as Kingambit, Swords Dance Iron Valiant, and Hisuian Samurott.</p>"
      },
      "Substitute + 3 Attacks": {
        "description": "<p>This more offensive set allows Landorus-T to take advantage of its varied movepool and high attacking stats to cause headaches to common teambuilding structures in SV OU while still retaining its usefulness as an Intimidate pivot; as such, Substitute is essential mostly to ease prediction, but it can also catch unsuspecting players trying to use a status move on Landorus-T, such as Moltres's Will-O-Wisp or Amoonguss's Spore. Smack Down is important to let Landorus-T threaten a KO on Corviknight, Rotom-W, Zapdos, Moltres, or even Enamorus the next turn with Earthquake, and even if the opponent switches out, Earthquake is likely to strongly dent their team, unless they're running more than one Pokemon immune to Ground. Stone Edge, on top of its great coverage with Earthquake, provides a more immediate hit on Zapdos, which is useful for more offensive variants that outpace Landorus-T, as these force Landorus-T to take damage before being able to KO Zapdos. Stone Edge also OHKOes Moltres and Enamorus, but it comes at the price of being unable to dent Corviknight or Rotom-W, which is undesirable. Grass Knot rounds out Landorus-T's coverage as a way to do massive damage to Great Tusk; Garganacl after Iron Defense, Curse, or Tera Water; and Dondozo. Tera Water allows Landorus-T to turn its Ice and Water weaknesses around and thus better check Ice Spinner Great Tusk and Hisuian Samurott. A Naive nature is best alongside maximum Speed investment to make sure Landorus-T outpaces Great Tusk and most defensive Zapdos variants and Speed ties with other Landorus-T. 24 Special Attack EVs allow Landorus-T to 2HKO physically defensive Garganacl with Grass Knot if its Leftovers has been removed, but maximum Attack EVs can also be run instead.</p> <p>Substitute Landorus-T is commonly found on bulky offense and balance teams, bringing the gap between a wallbreaker and a bulky pivot. To aid its wallbreaking efforts, however, Landorus-T strongly appreciates Spikes support from the likes of Hisuian Samurott and Ting-Lu to help wear down its switch-ins, as Landorus-T commonly causes the opponent to switch around, and, most importantly, put Great Tusk in range of going down to a single Grass Knot. While Landorus-T has great coverage for most of the tier and is a strong wallbreaker against most balance and bulky offense teams, there are still a few Pokemon that it gives free switches to. Iron Defense Zamazenta doesn't take much from Landorus-T's Earthquake, especially with Dauntless Shield activated, and can use Landorus-T as setup fodder with Iron Defense. Physically defensive variants of Galarian Slowking, Moltres, and Zapdos help remedy this, and the former three also help bring Landorus-T for wallbreaking opportunities via Chilly Reception, Volt Switch, and U-turn. Calm Mind Cresselia is another dangerous setup sweeper that Landorus-T allows to come in for free. Kingambit and Encore Tera Dark or Steel Iron Valiant pose great answers to it while also appreciating Landorus-T spreading damage around for them to clean up, especially if an unsuspecting Great Tusk is taken out via Grass Knot. Great Tusk itself is also a great partner, as going with a more offensive set on Landorus-T makes it less reliable of a check to physical attackers, which Great Tusk helps handle; in return Great Tusk appreciates opposing Great Tusk being taken out via Grass Knot, making it easier for defensive variants to win the hazard game and offensive variants to sweep or dent the opposing team.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Magcargo", "user_id": 177111}, {"username": "lydian", "user_id": 303291}, {"username": "DKM", "user_id": 402001}], "teams": [{"name": "Quality checked by", "members": [{"username": "chimp", "user_id": 197439}, {"username": "autumn", "user_id": 384270}, {"username": "DKM", "user_id": 402001}, {"username": "SetsuSetsuna", "user_id": 548068}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Milak", "user_id": 262594}, {"username": "Clouds", "user_id": 356215}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Kyurem": {
    "sets": {
      "Choice Specs": {
        "description": "<p>When using Choice Specs, Kyurem becomes a devastating wallbreaker thanks to its great offensive typing alongside its naturally sky-high Special Attack. Freeze Dry helps Kyurem in dealing with bulky Water-types like Toxapex, Dondozo, and common Tera Water users such as Gliscor and Galarian Slowking. Earth Power finds itself in the last slot, allowing Kyurem to hit Galarian Slowking hard as well as Pokemon that resist its STAB moves, examples being Heatran, Kingambit, and Gholdengo. Tera Ice provides the most amount of damage possible to its Ice-type STAB moves, which can potentially OHKO naturally high specially defensive behemoths like Clodsire and Toxapex with Ice Beam and Freeze Dry, respectively, as well as 2HKO offensive Gholdengo and Kingambit with Ice Beam. Meanwhile, Tera Ground can be used to boost up Earth Power, having a chance to OHKO bulky variants of Kingambit and Gholdengo, as well as provide a Rock resistance, which lets it take on Stealth Rock and the dangerous Iron Boulder's Mighty Cleave more easily. Finally, Tera Fairy provides Kyurem with an immunity to Dragon-type attacks such as Dragapult, Walking Wake, and opposing Kyurem's Draco Meteor, coupled with a newfound Fighting resistance against moves like Iron Valiant and Zamazenta's Close Combat and Corviknight and Skarmory's Body Press.</p> <p>Kyurem often founds itself in bulky offense teams that appreciate its ability to destroy common walls. While Kyurem's typing is amazing offensively, defensively it makes Kyurem hard to switch in due to its numerous weaknesses combined with its average Speed tier. To solve this, pair Kyurem with pivot users; Kyurem's best friend is Galarian Slowking, which brings Kyurem in safely and provides snow with Chilly Reception as well as switch into Fairy-types like Enamorus and Iron Valiant. Kyurem needs entry hazard removal to not get worn down quickly by hazard-stacking teams; therefore, Rapid Spin users like Great Tusk and Excadrill are great partners. Corviknight can take Fairy- and Dragon-type moves, clear out hazards with Defog, and provides a slow U-turn to get Kyurem in safely. Additionally, Cinderace can use Court Change to use the hazards against the opposing team and can also lure in and pivot out of checks such as Toxapex and Gliscor with U-turn for Kyurem. Hatterene is also a good partner for Kyurem, which can deflect hazards with Magic Bounce, slow down faster threats with Nuzzle, and give Kyurem a second chance at wallbreaking with Healing Wish. Physical attackers like Meowscarada can be used to scare away common special walls thanks to its crippling STAB Knock Off to make Kyurem's attacks more impactful. Another strong physical attacker is Kingambit, which threaten some of Kyurem's checks like Galarian Slowking, Clodsire, and specially defensive Clefable. In return, Kyurem can break past their defensive checks such as Skarmory, Dondozo, and Great Tusk. Gholdengo makes for an amazing partner, as it can switch into super effective moves aimed at Kyurem and threaten Galarian Slowking and Fairy-types with its STAB moves; in return, Kyurem beats Unaware Clodsire for it. Kyurem can take advantage of hazard-stacking teams to be even harder to wall, so common hazard setters like Skarmory, Ting Lu, Hisuian Samurott, and Gliscor can be helpful, with the latter two having Knock Off on their arsenal as well to cripple Kyurem's defensive checks.</p>"
      },
      "Heavy-Duty Boots": {
        "description": "<p>Heavy-Duty Boots Kyurem is an incredibly powerful Pokemon with very few switch-ins, leveraging its hefty natural bulk and monstrous offensive stats to threaten a large portion of the tier with its perfect coverage. Both Ice Beam and Freeze-Dry are fantastic STAB options, with the raw power of Ice Beam supplemented by Freeze-Dry's super effective coverage into bulky Water-types such as Toxapex and Dondozo. Earth Power is a great coverage move that allows Kyurem to hit common switch-ins like Galarian Slowking, Kingambit, Gholdengo, and Heatran, and Draco Meteor rounds out the set with a powerful nuke that tears through neutral targets like Darkrai, Deoxys-S, and Terastallized Ting-Lu while securing a notable OHKO on Gouging Fire. Scale Shot is a weaker alternative that boosts Kyurem's Speed to patch up its middling Speed tier and thwart revenge killing attempts by otherwise faster Pokemon such as Dragapult and Zamazenta. It also targets special walls like Blissey on their frailer Defense and hits Volcarona hard to prevent it from using Kyurem as setup fodder. A Naive nature is selected for a mixed set with Scale Shot in order to still survive Iron Boulder's Mighty Cleave from full HP. A Hasty nature can also be considered for a better matchup into Volcarona and to avoid an OHKO from Iron Valiant's Moonblast. Tera Ice synergizes with Kyurem's double Ice-type STAB attacks to blast holes through teams, allowing it to 2HKO both physically defensive Clefable and Corviknight with Ice Beam. Tera Ground can be used instead to change Kyurem's defensive profile entirely while giving it a STAB boost to Earth Power, securing crucial 2HKOs on both Galarian Slowking and Skeledirge along with dropping offensive Gholdengo in a single hit. Additionally, both Tera types drop Kyurem's weaknesses to Dragon- and Fairy-type attacks from Pokemon like Dragapult and Enamorus, with Tera Ground also removing its Fighting- and Rock-type weaknesses to block revenge killing attempts from Zamazenta and Iron Boulder.</p> <p>Kyurem is a perfect fit for entry hazard-stacking teams that opt to neglect removal in favor of putting hazards up on both sides, as Heavy-Duty Boots allows Kyurem to switch in freely, and its lack of power from no boosting item is made up for by switch-ins being forced to take chip damage on entry. Good defensive hazard setters that pair well with Kyurem include Skarmory and Gliscor with their Steel- and Fighting-type resistances, respectively. Faster teammates are also appreciated to help cover for Kyurem's mediocre Speed, with fast Knock Off users such as Meowscarada and Weavile being great picks for balance teams and Iron Boulder as a good pairing on more offensive builds. Another partner that works particularly well is Knock Off Clefable, which switches into Dragon- and Fighting-type attacks from Dragapult and Zamazenta and invites in Kyurem's defensive checks like Galarian Slowking, Air Balloon Gholdengo, and Air Balloon Heatran to remove their items, making them more susceptible to chip damage and allowing Kyurem to hit the latter two with Earth Power. Galarian Slowking itself is a bulky pivot that has great synergy with Kyurem, as it stifles revenge killing attempts with Fighting- and Fairy-type attacks from checks like Iron Valiant and Enamorus, and it can not only can bring in Kyurem freely with Chilly Reception but also sets up snow to make it significantly harder to revenge kill. Offensively, Kyurem pairs well with threats that can force in walls weak to it such as Gliscor, Skarmory, and Great Tusk, making Kingambit a natural partner.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Dragon Dance Kyurem is an effective setup sweeper with great bulk and two strong physical STAB moves in Loaded Dice-boosted Icicle Spear and Scale Shot, capable of outspeeding would-be revenge killers such as Dragapult and Booster Energy Great Tusk after a single boost. Tera Blast is primarily used on sets that Terastallize into a Ground-type, giving Kyurem the coveted near-unresisted Ice + Ground STAB combination. This allows Kyurem to break past otherwise troubling Pokemon like Gholdengo and Kingambit. Substitute is an alternative option that relies less on Terastallization, allowing Kyurem to dodge status moves and to scout potential switches or Terastallization. Tera Fairy is a more defensive choice, trading its Dragon and Fighting weaknesses for an immunity and a resistance, allowing Kyurem to safely take a hit from Pokemon like Dragapult and Iron Valiant to OHKO them back with Icicle Spear. Tera Steel enables Kyurem to easily take moves like Make It Rain from Gholdengo and Mighty Cleave from Iron Boulder while being able to avoid Toxic from the likes of Toxapex.</p> <p>Dragon Dance Kyurem is best used on offensive teams that appreciate a strong physical setup sweeper that can muscle past the bulky Ground- and Dragon-types of the tier. It is one of the few setup sweepers that immediately threatens Gliscor and provides a way for hyper offense to resist the priority from Raging Bolt and KO it. Kyurem wants a teammate to provide some form of entry hazard control like Great Tusk, as Kyurem is weak to Stealth Rock and needs Loaded Dice to output consistent damage. It appreciates the support of Spikes from setters like Deoxys-S and Hisuian Samurott, as most of its checks are bulky grounded Pokemon. For example, one layer of Spikes allows Kyurem to OHKO maximum HP Great Tusk and offensive Zamazenta without an Intrepid Shield boost at +1 and +2, respectively. Kyurem greatly enjoys snow from Alolan Ninetales's Snow Warning, as the Defense boost helps greatly in positioning Kyurem to get the free turns that it needs. Alolan Ninetales can also set up Aurora Veil to further ease Kyurem's setup. Bulky Steel-types like Heatran, Kingambit, and Gholdengo all give Kyurem trouble unless it is Tera Ground and willing to commit the Tera, so teammates like Tera Ground Volcarona and Knock Off Iron Valiant help to pressure these foes. Bulky Water-types like Dondozo and Primarina can also consistently beat Kyurem one-on-one, so offensive Grass-types like Rillaboom and Meowscarada can be used to threaten them out. These also provide tools like Grassy Terrain to keep Kyurem healthy as it sets up and Knock Off to remove defensive items from Pokemon like Corviknight and Zamazenta. Other strong physical attackers like Gouging Fire can help to force in and wear down the Water-types that Kyurem struggles with. Very fast offensive Pokemon like Booster Energy Iron Boulder and Iron Valiant can outspeed even a +1 Kyurem and threaten huge damage with their super effective STAB moves. Because of this, Kyurem appreciates Pokemon like Gholdengo that can take hits from those fast threats and continue to apply offensive pressure.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Sp0oN1oRd", "user_id": 513254}, {"username": "1LDK", "user_id": 517709}, {"username": "kd458", "user_id": 633798}], "teams": [{"name": "Quality checked by", "members": [{"username": "ausma", "user_id": 360720}, {"username": "kd458", "user_id": 633798}, {"username": "BT89", "user_id": 487308}, {"username": "royalfluxh", "user_id": 493260}, {"username": "SetsuSetsuna", "user_id": 548068}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "royalfluxh", "user_id": 493260}, {"username": "Aera", "user_id": 572981}]}]}
  },
  "Keldeo": {"sets": {"Choice Specs": {}}},
  "Greninja": {
    "outdated": true,
    "sets": {
      "Battle Bond": {
        "description": "<p>Battle Bond Greninja is an extremely powerful cleaner thanks to its great STAB moves, wonderful coverage, and solid Special Attack and excellent Speed, which are boosted to astronomical levels the first time it KOes an enemy. After Battle Bond activates, Greninja can outpace threats that are already considered very fast, including Choice Scarfers like Enamorus and Sneasler and Booster Energy users like Iron Valiant, Walking Wake, and Iron Moth. Hydro Pump is extremely powerful, always OHKOing uninvested Kingambit after Battle Bond activates and having a significant chance to OHKO it with just Tera Water while at worst 2HKOing much of the tier with both Battle Bond and Tera Water active, but Surf is a more consistent alternative; Greninja will need to rely more on entry hazard support to secure OHKOs against threats like the aforementioned Kingambit, but it is still more than capable of OHKOing many offensive threats with Battle Bond and Tera Water active. Grass Knot rounds out Greninja's coverage by OHKOing Tera Water Garganacl and opposing Greninja with Battle Bond active, having a high chance to OHKO Hisuian Samurott after Stealth Rock even without Battle Bond active, and 2HKOing Dondozo. Water Shuriken can pick off weakened faster threats like +1 Iron Valiant, Unburden Sneasler, Choice Scarf Enamorus, and +1 Great Tusk, and in a pinch it can act as insurance against greatly weakened threats like Dragapult. With a Modest nature and rain support from Pelipper, it also OHKOes Iron Valiant after Stealth Rock with a Battle Bond Boost as long as it hits at least three times, which makes up for the loss in Speed from foregoing a Timid nature. Water Shuriken also helps deal with Kingambit's Sucker Punch, which can otherwise greatly threaten Greninja if it has been weakened or shed its Dark resistance with Tera Water. Ice Beam, on the other hand, reliably handles Water-resistant threats like Dragonite, Amoonguss, Rillaboom, Meowscarada, and Tera Grass Galarian Slowking.</p> <p>Battle Bond Greninja greatly appreciates entry hazard support from Ting-Lu, Glimmora, and Hisuian Samurott to wear threats down over the course of a game; for instance, enabling it to KO Kingambit with Tera Water Surf and take out Amoonguss more easily once Battle Bond is already active. Moreover, the chip damage from entry hazards can help wear down faster threats like Booster Energy Iron Valiant Choice Scarf Enamorus, putting them into Water Shuriken range. In that vein, Gholdengo is another excellent teammate due to its ability to prevent hazard removal; it can also use its powerful STAB moves alongside Choice Specs or a Nasty Plot boost to wallbreak and wear down the opposing team, allowing Greninja to finish the job. Other powerful offensive threats like Iron Valiant and especially Kingambit greatly appreciate Battle Bond Greninja's ability to break past various threats like Corviknight, Dondozo, Great Tusk, Heatran, and Landorus-T to assist their late-game sweeps; in return, they can help weaken threats like Walking Wake and Dragonite. Kingambit in particular can handle threats like Toxapex, Clodsire, and Terastallized Galarian Slowking, which Greninja may struggle to muscle past. Lastly, Battle Bond Greninja is a natural fit on rain teams, as the boost from Pelipper's Drizzle alongside a Modest nature, Tera Water, and Battle Bond allows Greninja's Hydro Pump to accomplish ludicrous feats such as outright OHKOing specially defensive pivot Galarian Slowking, OHKOing Roaring Moon after Stealth Rock, and even 2HKOing Assault Vest Toxapex more reliably. Basculegion is another rain staple that synergizes well with Greninja, as one can weaken their shared checks like Rotom-W and Walking Wake to enable the other's sweep. Lastly, Zapdos offers rain teams an effective means of dealing with Toxapex, Amoonguss, and Tera Water Galarian Slowking, ensuring that Greninja doesn't have to waste precious turns attacking them and getting worn down by their attacks alongside Life Orb recoil.</p>"
      },
      "Choice Specs": {
        "outdated": true,
        "description": "<p>When equipped with Choice Specs, Greninja becomes a potent wallbreaker thanks to its great coverage and Protean. Since Choice Specs ensures it only uses one attack per switch-in, even though Protean only activates once per switch-in, Greninja will have STAB every time it attacks. Hydro Pump is Greninja's most powerful move, pummeling both offensive and defensive Water-weak Pokemon like Cinderace, Skeledirge, and Great Tusk. Dark Pulse hits the likes of Gholdengo, Skeledirge, and Hisuian Zoroark super effectively while also dealing the most damage to Toxapex and Rotom-W. Dark Pulse's flinch chance can also come in clutch against the aforementioned walls. Ice Beam eviscerates Amoonguss, Water Absorb Clodsire, and Dragon-types like Dragonite and Roaring Moon. Grass Knot can OHKO Dondozo, Garganacl, and Walking Wake after minor chip damage, and it deals good damage to lighter Water-types like Quaquaval and Azumarill. Alternatively, Spikes lets Greninja wear down checks like Toxapex while taking advantage of the switches it often forces. In addition, Greninja also beats common entry hazard removers such as Great Tusk and Corviknight, making Spikes easy to maintain. Tera Water further enhances Greninja's already powerful Hydro Pump to extreme levels, letting it OHKO Pokemon like Corviknight, Hatterene, and Unaware Clodsire. Meanwhile, Tera Dark lets Greninja 2HKO Toxapex and Rotom-W with Dark Pulse.</p> <p>Choice Specs Greninja fits best on hyper offense and bulky offense teams as a menacing wallbreaker. Stealth Rock setters like Great Tusk, Ting-Lu, Garchomp, and Glimmora are amazing for Spikes Greninja, as it can create a hazard-stacking core with them. Alternatively, these Pokemon can also let Greninja drop Spikes for Grass Knot, as they can set up hazards and Grass Knot overwhelming Dondozo and Walking Wake. Strong offensive Pokemon like Kingambit and mixed Iron Valiant make for excellent partners, as Greninja threatens their checks like Great Tusk, Dondozo, and Garchomp for the former, and Skeledirge, Gholdengo, and Clodsire for the latter. They can also threaten Pokemon that would otherwise revenge kill Greninja, such as Dragapult and Meowscarada, granting Greninja more consistency against teams with these Pokemon.</p>"
      },
      "Lead": {
        "outdated": true,
        "description": "<p>Greninja is an excellent dedicated lead due to its high Speed tier alongside Spikes, Toxic Spikes, and valuable utility options. It differentiates itself from Meowscarada due to its better matchup against other leads as well as entry hazard setters and removers such as Glimmora, Iron Treads, Garchomp, Toxic Spikes Iron Moth, and Court Change Cinderace. Taunt has various applications; it blocks Amoonguss's Spore, prevents entry hazards from the likes of Ting-Lu and leads like Glimmora and Iron Treads, stops Defog from Corviknight, and prevents setup from Pokemon Roaring Moon, Kingambit, and Tera Water Garganacl that attempt to exploit Greninja's relative passivity. Greninja can choose to run Toxic Spikes to punish offensive teams filled with setup sweepers like Roaring Moon and Iron Valiant better, but Ice Beam OHKOes Garchomp and dents Water-resistant Pokemon like Dragonite, Meowscarada, Dragapult, Tera Grass Glimmora, and Water Absorb Clodsire, especially if its Focus Sash is still intact for the former three. Focus Sash guarantees that Greninja can set at least one layer of entry hazards and works extremely well to safely put it into Torrent range, which allows Surf to OHKO Hisuian Zoroark and provides significant odds to OHKO Iron Valiant, one of the biggest threats to offense teams. Alternatively, Protean improves Ice Beam's damage and allows Greninja to block Volt Switch from Rotom-W, Iron Treads, and Sandy Shocks when using Spikes, maintaining offensive momentum. Tera Water boosts Greninja's Surf, notably netting the OHKO on specially defensive Garganacl and 2HKO on Tera Fairy Skeledirge with Torrent, as well as the 2HKO on Gholdengo and Corviknight after Stealth Rock.</p> <p>Greninja is perfectly suited for hyper offense teams. Offensive teammates like Iron Valiant and Roaring Moon put further pressure on entry hazard removers such as Corviknight, Iron Treads, and Great Tusk to maintain Greninja's Spikes throughout the game and enjoy Spikes chipping down their checks like Garganacl, Clodsire, Amoonguss, and Dondozo. They also appreciate Spikes invalidating Focus Sash from Pokemon like Hisuian Zoroark, Ceruledge, and Meowscarada. Aside from possessing insane late-game potential themselves, Kingambit and Iron Moth particularly help against Meowscarada—one of the few leads that can easily beat Greninja—and Hatterene, which can freely switch into Greninja and reflect its Taunt and entry hazards with Magic Bounce, with Calm Mind variants using it as setup fodder as well. Kingambit in particular appreciates Greninja's tendency to faint early-game to accumulate Supreme Overlord boosts. Knock Off from Bulk Up Great Tusk and Swords Dance Iron Valiant can remove Heavy-Duty Boots from walls like Dondozo, Slowking, and Tera Fairy Skeledirge, making them susceptible to Greninja's Spikes. Ghost-types like Gholdengo and Dragon Dance Dragapult can spinblock the likes of Great Tusk and Iron Treads in a pinch to keep Greninja's Spikes up; Gholdengo in particular does it exceptionally well by blocking Defog and Glimmora's Mortal Spin as well, and it has the added benefit of threatening Hatterene and crippling walls like Toxapex, Clodsire, and Ting-Lu with Choice item + Trick, making them more vulnerable to Greninja's entry hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Dreadfury", "user_id": 408271}], "teams": [{"name": "Quality checked by", "members": [{"username": "DKM", "user_id": 402001}, {"username": "SetsuSetsuna", "user_id": 548068}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Hawlucha": {"outdated": true, "sets": {"Unburden Sweeper": {}}},
  "Goodra-Hisui": {"outdated": true, "sets": {"Assault Vest": {"description": "<p>These are sample set(s) as we wait for the metagame to settle before working on <a href=\"https://www.smogon.com/forums/forums/ou-analyses.758/\">new analyses</a>. They will be updated as the metagame continues to develop, so stay tuned!</p>"}}},
  "Hoopa-Unbound": {
    "outdated": true,
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Hoopa-U is an extremely strong physical wallbreaker that can be very threatening to more balanced and defensive teams due to its massive Attack stat and reliable STAB move in Hyperspace Fury, which is capable of impressive feats such as 2HKOing physically defensive Corviknight and Toxapex the majority of the time and always 2HKOing physically defensive Rotom-W. Zen Headbutt is a nice complementary STAB move, allowing Hoopa-U to smack prominent Fighting-types like Great Tusk, Zamazenta, and Iron Valiant that may try to switch in on a predicted Hyperspace Fury. Drain Punch hits Dark-types like Kingambit and Ting-Lu, while Gunk Shot offers coverage against Fairy-types like Enamorus and Azumarill, as well as Tera Fairy Moltres, Garganacl, Kingambit, and Baxcalibur. A Jolly nature allows Hoopa-U to outspeed Pokemon like Timid Heatran, Modest Gholdengo, and Timid Volcanion, while an Adamant nature allows Hoopa-U to hit even harder, 2HKOing Garganacl the majority of the time. Tera Dark boosts the power of Hyperspace Fury even further, 2HKOing physically defensive Dondozo; Tera Dark also offers the additional benefit of making Hoopa-U resist other Dark-type attacks, which can be crucial against Kingambit's Sucker Punch. Hoopa-U fits well on bulky offense teams that are in need of a physical wallbreaker. Physical setup sweepers like Kingambit, Baxcalibur, and Dragonite appreciate Hoopa-U's presence on a team, as Hoopa-U is able to break through or dent physically defensive Pokemon that could stand in their way, like Dondozo, Great Tusk, and Rotom-W. One of Hoopa-U's biggest challenges is safely getting on the field due to its frail physical defense and quadruple weakness to U-turn, so it pairs well with pivots such as Chilly Reception Galarian Slowking, U-turn Dragapult, and Volt Switch Zapdos. Hoopa-U is also held back by its middling Speed, which tends to exacerbate Hoopa-U's physical frailty, so it appreciates paralysis support from partners like Rotom-W and Substitute Dragapult. Static Zapdos is a particularly notable partner for Hoopa-U, because it is able to switch in and potentially paralyze faster Pokemon like Cinderace and Dragapult, rendering those Pokemon no longer threatening to Hoopa-U. Pokemon that can set entry hazards like Ting-Lu, Heatran, and Landorus-T help facilitate with Hoopa-U breaking through its switch-ins. Opposing physical Dark-types, such as Kingambit, Hisuian Samurott, and Roaring Moon, typically force Hoopa-U out, especially after a Defense drop. For this reason, sturdy Dark-resistant teammates like Zamazenta, Great Tusk, and Low Kick Kingambit synergize well with Hoopa-U, while those Pokemon also appreciate Hoopa-U punching holes in the opposing team's defensive backbone.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Hoopa-U is an incredibly threatening special wallbreaker, especially to slower and more defensive teams, that is able to OHKO the majority of the tier and 2HKO essentially every other relevant Pokemon. This is thanks to Hoopa-U's astronomically high Special Attack stat and potent dual STAB combination. Focus Blast rounds out its coverage, allowing Hoopa-U to hit Dark-types like Ting-Lu, Kingambit, and Hisuian Samurott; Focus Blast also OHKOes specially defensive Heatran after entry hazard chip. Trick can be run in the fourth slot to cripple the few special walls that Hoopa-U is unable to reliably blast through, like Blissey, Scream Tail, and Alolan Muk, while also affording Hoopa-U the ability to switch moves, alleviating the need for prediction in exchange for less immediate power. Alternatively, Thunderbolt can be used instead as Hoopa-U's best option to hit Corviknight and Galarian Moltres while also providing a more reliable option than Focus Blast to OHKO Hisuian Samurott and Greninja. A Timid nature makes Hoopa-U faster than Pokemon like Timid Heatran, Modest Gholdengo, and Timid Volcanion, while a Modest nature gives Hoopa-U even more breaking power so that it is able to potentially 2HKO Blissey and Alolan Muk with Focus Blast after entry hazard damage. Tera Dark increases the power of Dark Pulse, giving it an opportunity to 2HKO Scream Tail and specially defensive Heatran while also threatening to OHKO Baxcalibur, bulky Cinderace, and defensive Landorus-T. Tera Dark also makes Hoopa-U resist Dark-type attacks, which can prevent Kingambit from answering it with Sucker Punch. Quick special attackers like Choice Specs Dragapult, Iron Valiant, and Enamorus make good teammates, as they appreciate Hoopa-U's ability to break through even the bulkiest of specially defensive walls. One of Hoopa-U's biggest flaws is that its physical frailty and crippling 4x weakness to U-turn can make it difficult for it to safely be brought onto the field. As a result, Hoopa-U greatly benefits from being paired alongside pivots that can facilitate its entry, like Galarian Slowking with Chilly Reception; Landorus-T, Dragapult, and Sneasler with U-turn; and Rotom-W and Zapdos with Volt Switch. Paralysis support from Thunder Wave users like Rotom-W, Substitute Dragapult, and defensive Gholdengo can help alleviate Hoopa-U's lackluster Speed and make previously faster threats easy targets. Static Zapdos synergizes particularly well with Hoopa-U in this regard, since Zapdos can punish U-turns directed at Hoopa-U from faster Pokemon like Cinderace, Sneasler, and Meowscarada to potentially paralyze them. Hoopa-U also appreciates the inclusion of hazard setters like Hisuian Samurott, Ting-Lu, Landorus-T, and Heatran, allowing it to punch holes in defensive backbones more easily and damage the opposing team thanks to the switches it forces. Some of the most difficult Pokemon for Hoopa-U to handle are opposing Dark-types like Kingambit, Roaring Moon, Ting-Lu, and Hisuian Samurott because they can force Hoopa-U to rely on Focus Blast and good prediction to break through. To help mitigate this issue, Pokemon that can reliably switch into Dark-types like Great Tusk, Zamazenta, and Azumarill also make good partners for Hoopa-U, and in return they appreciate Choice Specs Hoopa-U's ability to threaten physical walls as well. Bulk Up Great Tusk and Belly Drum Azumarill can also clean up late-game after Hoopa-U wears down the opposing team.</p>"
      },
      "Assault Vest": {
        "description": "<p>Equipping Hoopa-U with an Assault Vest makes the most of its excellent coverage and surprisingly high special bulk, letting it trade with various special attackers like Dragapult and Walking Wake. Strong Knock Off is a large reason to use this set, as it is an excellent progress maker, particularly against bulkier teams. Psychic is run over Zen Headbutt for its higher accuracy and better damage against physically defensive Pokemon like Zapdos and Great Tusk. Drain Punch provides Hoopa-U with adequate recovery and logevity, and it is largely used to hit Kingambit and other Dark-types, which otherwise walls this set. Gunk Shot provides important coverage for Fairy-types like Enamorus and Tera Fairy foes like Garganacl while potentially poisoning checks like Ting Lu. Tera Poison not only empowers its Gunk Shot but also gives it a crucial Fairy and U-turn resistance. 248 HP and 40 Defense investment with a Lonely Nature allows Hoopa-U to survive one Sucker Punch from Adamant Kingambit with a maximum Supreme Overlord boost and gives it an easier time against weaker physical attacks from Pokemon like Garganacl and Clodsire. Meanwhile, 84 SpA EVs give Hoopa-U a guaranteed OHKO on Iron Moth with Psychic and 92 Speed EVs allow it to outspeed Jolly Kingambit. Hoopa-U is best utilized on bulky offense teams that can support a slow, powerful wallbreaker like it while still appreciating its ability to trade hits with common special attackers. It is incredibly physically frail, so pairing it with physically bulky Pokemon like Garganacl and Great Tusk is a good idea, as it will often be forced out by physical attackers. Additionally, pivot support from Cinderace and Zapdos can put Hoopa-U in favorable positions to dish out damage with its strong attacks, something that is necessary given its aforementioned physical frailty. Because Hoopa-U often makes great progress with Knock Off, entry hazard setters like Ting-Lu and Landorus-T are great teammate options. Hoopa-U excels at punching holes in the opposition, so faster offensive teammates like Dragapult, Iron Valiant, and Enamorus are good ideas to take advantage of the resultant weakened foes. Teammates like Amoonguss and Galarian Slowking also deserve consideration for checking Iron Valiant and Enamorus without having to expend Terastallization.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dex", "user_id": 277988}, {"username": "Goodbye & Thanks", "user_id": 506997}], "teams": [{"name": "Quality checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Mellow", "user_id": 423226}, {"username": "BT89", "user_id": 487308}, {"username": "DKM", "user_id": 402001}, {"username": "royalfluxh", "user_id": 493260}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Volcanion": {
    "outdated": true,
    "sets": {
      "Utility Wallbreaker": {
        "description": "<p>Volcanion's high Special Attack and great offensive typing make it an excellent wallbreaker with solid defensive utility thanks to Water Absorb. Good coverage options as well as a powerful STAB move that can burn its foes make it very difficult to switch into. Earth Power is crucial for hitting Toxapex, which easily switches into both of Volcanion's STAB moves; it also hits Galarian Slowking harder, notably guaranteeing a 2HKO on physically defensive variants. Taunt is useful against bulkier Pokemon, preventing Dondozo or Toxapex from using healing moves and Galarian Slowking from using Thunder Wave. Substitute eases prediction, as Volcanion can force switches, and it takes advantage of certain Pokemon that fail to break the Substitute such as bulky Cinderace and non-Assault Vest Toxapex while still avoiding status attempts from the aforementioned walls. It also allows Volcanion to avoid Sucker Punch from Kingambit. Tera Blast alongside Tera Fairy can be used to hit Pokemon such as Dragapult, Walking Wake, and Hisuian Samurott. Becoming a Fairy-type offers useful defensive utility, giving it an immunity to both of Walking Wake's STAB moves and a resistance to Kingambit's Sucker Punch. Alternatively, Tera Ground can be used to grant Volcanion an Electric immunity, improving its matching against Zapdows and Rotom-W, while also boosting Earth Power's damage. Both Tera types also neutralize its weakness to Earthquake from Pokemon like Landorus-T and Great Tusk. 140 Speed EVs are used to outspeed uninvested Great Tusk. Volcanion fits on bulky offense teams that appreciate a strong wallbreaker. Entry hazards, especially Spikes, make Volcanion much harder to deal with. Therefore, hazard setters including Ting-Lu, Great Tusk, Hisuian Samurott, and Landorus-T make good partners. Ting-Lu can also switch into special attackers like Dragapult and Zapdos for Volcanion. Specially defensive Pokemon such as Galarian Slowking cause problems for Volcanion, so teammates that can help overwhelm them such as Nasty Plot Gholdengo and Utility Dragapult are also useful. Finally, Swords Dance Iron Valiant and Kingambit can clean late-game once Volcanion has worn down the opposing team, and they also pressure the aforementioned specially defensive Pokemon. Kingambit in particular appreciates Volcanion's ability to deal with Fire-types like Cinderace and Moltres, and especially its immunity to Will-O-Wisp.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Volcanion is a wallbreaker with absurd strength thanks to its sky high Special Attack and amazing high-Base Power moves, allowing it to make progress every time it is in. Steam Eruption is Volcanion's most spammable move and has very limited switch-ins, as many Pokemon that resist both of Volcanion's STAB moves like Dragapult, Dragonite, Roaring Moon, and Hisuian Samurott end up getting 2HKOed or burned. Fire Blast is Volcanion's best move for Grass-types such as Meowscarada, Amoonguss, and Tera Grass Galarian Slowking. Earth Power helps immensely with Toxapex, Water Absorb Clodsire, and Assault Vest Galarian Slowking. Sludge Bomb hits Azumarill and Tera Grass Heatran while crippling foes like Rotom-W more than burn, while Tera Blast Fairy can hit many Dragon types such as Dragapult, Walking Wake, Dragonite, and Roaring Moon as well as Pokemon like Assault Vest Hisuian Samurott. Tera Fairy also makes Volcanion immune to Dragon-type moves, negating both of Walking Wake's STAB types, and removes all of Volcanion's weaknesses, particularly to Ground-type attacks such as Great Tusk, Ting-Lu and Landorus-T's Earthquake. Tera Fairy also allows Volcanion to resist Kingambit's Sucker Punch, making it a great revenge killing option. Tera Water and Tera Fire make Steam Eruption and Fire Blast even stronger, allowing Volcanion to muscle through Assault Vest Galarian Slowking and even 2HKO physically defensive Toxapex. Its main counters are Tera Water Galarian Slowking and Water Absorb or Tera Water Clodsire, alongside Blissey. Volcanion appreciates support from wallbreakers that can deal with these threats or wear them down, such as Black Glasses Kingambit and mixed Iron Valiant. Kingambit in particular loves Choice Specs Volcanion's matchup against Fire-types like Cinderace, Moltres, and Heatran. In turn, Kingambit has a good matchup versus the aforementioned counters and can help pressure other checks such as Toxapex. Dragapult can also be a great partner, as it provides pivoting and speed control along with adding pressure on said counters and checks and has the option to provide great support with Thunder Wave. Great Tusk is another great option, as it can provide hazard removal, which is crucial for Volcanion. It is also a great blanket check for physical attackers that threaten Volcanion, and it provides Knock Off support, making it one of the best defensive partners for Volcanion. Volcanion also fits great on VoltTurn teams, as it loves being brought in as many times as possible by Pokemon such as Cinderace, Dragapult, and Rotom-W.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "DKM", "user_id": 402001}, {"username": "zaydapoketrainer", "user_id": 605278}], "teams": [{"name": "Quality checked by", "members": [{"username": "SetsuSetsuna", "user_id": 548068}, {"username": "autumn", "user_id": 384270}, {"username": "DKM", "user_id": 402001}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Milak", "user_id": 262594}]}]}
  },
  "Primarina": {"sets": {"Assault Vest": {}, "Calm Mind": {}}},
  "Ribombee": {"outdated": true, "sets": {"Sticky Web": {}}},
  "Toxapex": {
    "outdated": true,
    "sets": {
      "The Pex": {
        "description": "<p>With a valuable defensive profile and remarkable longevity, Toxapex cements itself as a very sturdy mixed wall and defensive pivot. It can switch into and counter Pokemon like Cinderace and Greninja, scout for Choice item users like Dragapult, Breloom, and Iron Valiant, and absorb Toxic Spikes from Glimmora and opposing Toxapex. Surf forces damage onto Toxic-immune foes such as Gholdengo, Garganacl, Iron Moth, and Kingambit. Toxic shuts down Pokemon such as Dragonite, Skeledirge, and Rotom-W, and if Toxapex should run Toxic Spikes, it matches up well against offensive teams that contain setup sweepers such as Roaring Moon, Iron Valiant, and Great Tusk. Any attempts of boosting past Toxapex gets shut down easily by Haze, which combined with poison damage prevents Toxapex from being used as setup fodder by Pokemon such as Calm Mind Hatterene. Covert Cloak is an option to ignore Garganacl's Salt Cure, Dragapult and Gholdengo's Shadow Ball drops, and Greninja's Dark Pulse flinches, but Leftovers's longevity reduces Toxapex's reliance on Recover, and it is used over Black Sludge in case Toxapex decides to Terastallize. Tera Steel improves Toxapex's matchup against non-Earthquake Roaring Moon and Meowscarada while still maintaining an immunity to poison. Alternatively, Tera Fairy fares better against Dragapult, Great Tusk, Garganacl, and Choice Band Roaring Moon. The given EVs allow Toxapex to survive two Choice Band Meowscarada's Flower Trick from full health.</p> <p>Toxapex fits nicely on balance and bulky offense teams that appreciate a sturdy defensive backbone. Teammates like Corviknight, Ting-Lu, and Garganacl are terrific defensive partners that covers Pokemon such as Great Tusk, Choice Specs Dragapult, and Tera Electric Iron Valiant, respectively. Corviknight and Great Tusk in particular provide a backup check to multiple combinations of physical attackers like Roaring Moon, Dragonite, and Kingambit that attempt to overwhelm Toxapex. They also remove entry hazards, which would mitigate Toxapex's Regenerator and force it to use Recover more often; in return, Toxapex covers Pokemon such as Cinderace for the former and Greninja for the latter. Bulky setup sweepers like Garganacl, Skeledirge, and Gholdengo can take advantage of Toxic Spikes slowly chipping down checks such as Dondozo, Ting-Lu, and Great Tusk. Particularly, Skeledirge and Gholdengo can make use of Hex easily to take advantage of Toxapex spreading poison, as well as threaten Hatterene, which can block Toxapex's Toxic Spikes and use non-Haze variants as setup fodder. Offensive partners like Dragapult, Iron Valiant, and Kingambit compensate for Toxapex's overall passivity; in return, they appreciate Toxapex switching into their revenge killers such as Choice Scarf Gholdengo, Scizor, and Iron Valiant, respectively.</p>"
      },
      "Assault Vest": {
        "description": "<p>Assault Vest allows Toxapex to maximize its Special Attack EVs, letting it turn the tables on offensive Pokemon looking to exploit its passivity with Taunt or Substitute, while retaining excellent special bulk to check threats such as Choice Specs Dragapult, Walking Wake, Iron Moth, and Iron Valiant. Surf does a solid chunk of damage to common Toxapex switch-ins like Kingambit, physically defensive Corviknight, and Gholdengo and often 2HKOes Garganacl after Stealth Rock. Sludge Bomb has good coverage alongside it, dealing heavy damage to Fairy-types like Iron Valiant, Hatterene, and Azumarill while breaking Hydreigon's Substitute. Sludge Bomb's high chance to poison can be critical for crippling Rotom-W and Slowking in the long term. Infestation provides a nice source of chip damage while letting Toxapex trap and beat defensive threats, such as Amoonguss, Toxapex, Skeledirge, and Clodsire, in conjunction with Acid Spray. Furthermore, Infestation prevents the opponent from double switching on Toxapex, enabling much safer plays. Instead of Acid Spray, Ice Beam works to offer more immediate damage against Clodsire, Dragonite, Dragapult, and Amoonguss. Tera Blast, with Tera Fighting, is also viable to nab surprise KOs on Kingambit and Roaring Moon, which might otherwise set up on it. However, Fairy is the most standard Tera type for Toxapex, allowing it to block Dragon-type attacks from Dragapult and Walking Wake.</p> <p>Toxapex fits best on balance and bulky teams that appreciate its unique combination of bulk and power. Assault Vest Toxapex likes to pivot around aggressively and spread chip damage, thanks in part to Regenerator: entry hazard setters like Great Tusk and Ting-Lu can help it pressure opposing teams more, punishing opponents for switching out against it. Without either Haze or Toxic, Toxapex is vulnerable to setup sweepers such as Dragonite and Roaring Moon, so Unaware Pokemon such as Dondozo and Skeledirge are excellent teammates. Since Assault Vest Toxapex's physical bulk is rather lacking, physically defensive Pokemon like Great Tusk, Dondozo, and Corviknight can offer much-needed switch-ins to the likes of Kingambit and Choice Band Roaring Moon. Toxapex can often struggle to make progress against bulkier teams due to its middling power and lack of Toxic, so it appreciates strong balance wallbreakers like Iron Valiant. Hydreigon deserves special mention as an excellent teammate, sharing near-perfect type synergy with Toxapex. Hydreigon checks key threats to Toxapex such as Armarouge, Kingambit, and Nasty Plot Gholdengo, and it can set up on bulkier Pokemon like defensive Great Tusk and Clodsire. In return, Toxapex can check Iron Valiant, Dragapult, and Greninja, which can threaten Hydreigon. Finally, Scream Tail is also a great partner, using Wish to extend Toxapex's longevity and having solid defensive synergy with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}, {"username": "hamiltonion", "user_id": 40598}], "teams": [{"name": "Quality checked by", "members": [{"username": "Milo", "user_id": 540138}, {"username": "chimp", "user_id": 197439}, {"username": "3d", "user_id": 295768}, {"username": "SetsuSetsuna", "user_id": 548068}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Kommo-o": {"outdated": true, "sets": {"Clangorous Soul": {}}},
  "Necrozma": {"sets": {"Lead": {}}},
  "Rillaboom": {"sets": {"Choice Band": {}}},
  "Cinderace": {
    "outdated": true,
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Cinderace is a good offensive pivot thanks to its high Speed, decent Attack, and wide coverage that gains a STAB boost thanks to Libero each time it enters the field. Pyro Ball is its most reliable move, as it can hit hard while preserving Libero. Sucker Punch gives Cinderace a means to hit faster Pokemon such as Choice Scarf Gholdengo and Dragapult super effectively. Alternatively, Gunk Shot can be run to OHKO Iron Valiant and Hatterene while preserving the team's ability to Terastallize. Court Change is an extremely useful move, as it can provide hazard control that is unaffected by Gholdengo's Good as Gold while also stealing Light Screen and Reflect from hyper offensive teams; however, Cinderace can choose to run High Jump Kick instead to hit Dark-types such as Roaring Moon and Ting-Lu harder as well as inflicting more damage against Pokemon that resist Pyro Ball like Garchomp and Garganacl. Tera Fire is the Tera type that Cinderace wants to utilize in order to maximize Pyro Ball's damage, giving it the ability to, with an Adamant nature, OHKO Corviknight after Stealth Rock. It also helps Cinderace hit bulkier targets like Hatterene and offensive Great Tusk, especially if it isn't running Gunk Shot or High Jump Kick. A Jolly nature is preferred to augment Cinderace's role as a fast pivot, allowing it to outspeed Iron Valiant, Iron Moth, and Iron Treads. However, an Adamant nature can be run instead to increase its damage output.</p> <p>Cinderace works best on balance and bulky offense teams, providing utility and entry hazard control while simultaneously exerting offensive pressure. Defensive Water-type Pokemon like Toxapex, Rotom-W, and Dondozo can all sponge Water-type attacks while taking neutral damage from Rock- and Ground-type moves, with the exception of Toxapex. In turn, Cinderace can match up well against wallbreakers such as Dragapult, Iron Valiant and Meowscarada, which can all cause difficulties for the aforementioned Water-types. Ground-types that provide entry hazard support such as Garchomp, Great Tusk, and Ting-Lu make it easier for Cinderace to check threats with Stealth Rock and Spikes, especially if it is running an Adamant nature. Dragapult, Gholdengo, and Iron Valiant pair well with Cinderace, as they can eradicate foes that wall it such as Great Tusk, Dondozo, and Rotom-W. Similarly, Dragonite and Kingambit can check Pokemon such as Hatterene and Skeledirge, which can both cause issues for Cinderace. In return, Cinderace can provide hazard control for all of these partners and help them come in the field more safely without having to worry about chip damage from entry hazards.</p>"
      },
      "Bulky Pivot": {
        "description": "<p>Cinderace functions as an excellent bulky pivot thanks to its great Speed tier, serviceable bulk, and access to support moves such as Court Change and Will-O-Wisp. Cinderace can force out important offensive threats like Gholdengo and Iron Valiant with the threat of STAB Pyro Ball while keeping up momentum against defensive switch-ins with U-turn. Will-O-Wisp allows Cinderace to cripple physical attackers such as Kingambit, Roaring Moon, Dragonite, and Great Tusk, and it can also negate Leftovers for defensive Pokemon such as Rotom-W, Toxapex, and Ting-Lu. Specifically, Will-O-Wisp offers a safe way for Cinderace to check Kingambit, since it avoids Sucker Punch mindgames. Finally, Court Change offers unmatched utility in providing entry hazard control that cannot be blocked by Gholdengo and is also able to steal opposing dual screens. The 32 Attack EVs guarantee a KO on Gholdengo sets lacking defensive investment and 2HKO on physically defensive Corviknight after Leftovers. Although this set rarely wants to Terastallize, Tera Fire can potentially come in handy for securing KOs with Pyro Ball, especially with a Blaze boost. Alternatively, Tera Flying grants Cinderace an immunity to Ground-type attacks, such as Great Tusk's Earthquake, which can grant it extra opportunities to KO foes or cripple them with Will-O-Wisp. Tera Flying also matches up well against common Ground-type hazard setters such as Ting-Lu and Great Tusk, letting Cinderace safely Court Change against them.</p> <p>Cinderace works best on bulkier teams where its ability to guarantee hazard removal shines. Defensive Pokemon such as Dondozo, Slowking, Toxapex, and Amoonguss are great teammates, as they appreciate Cinderace's ability to ensure hazard removal, freeing them up to run items other than Heavy-Duty Boots. Water-types such as Dondozo and Toxapex have notably strong synergy with Cinderace; Dondozo checks Great Tusk and Tera Fire Kingambit, while Toxapex can check Water-types, such as Walking Wake and Greninja. Hazard-weak breakers such as Iron Moth and Choice Band Dragonite also fit well with Cinderace, as it's able to bring them in with U-turn. These breakers also enjoy bulky Water-types like Toxapex or Dondozo being burnt, making it easier to overwhelm them long-term. Cinderace usually requires the presence of another hazard control Pokemon such as Great Tusk, Hatterene, or Corviknight so it doesn't get overwhelmed. Corviknight synergizes especially well with Cinderace thanks to its Ground immunity and ability to absorb Knock Off from Meowscarada, which outspeeds Cinderace. Skeledirge and Dragapult can take advantage of bulky Cinderace, since both completely wall it and can potentially set up a Substitute. Kingambit is a great partner, as it can offensively check both Skeledirge and Dragapult. In return, it appreciates Cinderace burning Great Tusk and Ting-Lu, opening up the way for it to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Milo", "user_id": 540138}, {"username": "hamiltonion", "user_id": 40598}], "teams": [{"name": "Quality checked by", "members": [{"username": "chimp", "user_id": 197439}, {"username": "BT89", "user_id": 487308}, {"username": "SetsuSetsuna", "user_id": 548068}, {"username": "royalfluxh", "user_id": 493260}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Yourfavoritetransfem", "user_id": 629345}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Corviknight": {"sets": {"Physically Defensive": {}}},
  "Barraskewda": {"sets": {"Rain Sweeper": {}}},
  "Polteageist": {
    "outdated": true,
    "sets": {
      "Shell Smash": {
        "description": "<p>Uniquely among setup sweepers, Shell Smash + Stored Power gives Polteageist the power to KO most of the tier, the Speed to outspeed most of it, and a tool to plow through Unaware walls, all in one turn. Its Ghost typing also blocks common priority attacks like Dragonite's Extreme Speed and Breloom's Mach Punch, which allows it to sweep even when Psychic Terrain is not active. Though it is resisted by Steel-types, a Psychic Terrain-boosted Stored Power can still heavily damage even Corviknight, 2HKOing physically defensive variants after just one Shell Smash. Shadow Ball is a consistent STAB move with excellent neutral coverage to hit most Steel- and Psychic-types hard, OHKOing Gholdengo and Hatterene. Tera Blast with Tera Fighting fills a gap in Polteageist's coverage, eliminating Dark-types like Roaring Moon, Kingambit while Psychic Terrain is active, and Hydreigon. Tera Fighting can also let it survive their Dark-type attacks. Weak Armor alongside a Focus Sash allows Polteageist to punish a stray physical attack, further boosting its Speed—it can outspeed +1 foes like Roaring Moon, Iron Valiant, and Iron Moth—and Stored Power's damage. Focus Sash also lets Polteageist set up against threats that would otherwise outpace it or survive an attack and OHKO it, such as Kingambit, Choice Specs Dragapult, and offensive Great Tusk. A Timid nature is run to outpace +1 Walking Wake after a single Shell Smash.</p> <p>Polteageist is a staple on Psychic Terrain offense teams. Indeedee's Psychic Terrain protects Polteageist against priority attacks from Kingambit, Azumarill, and Floatzel while powering up its Stored Power, though Polteageist requires both a Shell Smash and a Weak Armor boost to outpace Swift Swim Floatzel. Indeedee can also let Polteageist set up with Encore or give it a second chance to sweep with Healing Wish, although if Polteageist has already consumed its Focus Sash, it will struggle to set up as reliably a second time. Armarouge is an excellent teammate and another staple on Psychic Terrain teams, as it can eliminate Steel-types like Kingambit with Armor Cannon to enable Polteageist's late-game sweep and it can use Endure to activate Weak Armor multiple times against Dragon Darts Dragapult, which Polteageist cannot reliably set up against. In return, Polteageist can greatly weaken or outright eliminate Unaware walls, set up against specially offensive Dragapult if its Focus Sash is intact, and can safely utilize Tera Fighting to eliminate Roaring Moon and wear down Ting-Lu, which allows Armarouge to sweep. Entry hazard removal is extremely important to maintain Focus Sash's protection. Eject Pack Great Tusk provides both Rapid Spin and Stealth Rock support, can safely get Polteageist in after using a strong Headlong Rush or Close Combat, and can also switch into and threaten Dark-types for Polteageist. Magic Bounce Hatterene deters entry hazards, spreads paralysis with Nuzzle, and can provide Healing Wish support. Also, Eject Button lets it safely pivot Polteageist in, even against U-Turns from Corviknight, Cinderace, or Meowscarada, giving it much easier setup opportunities. Setup sweepers like Dragon Dance Dragapult appreciate Polteageist breaking past Unaware walls and wearing down Steel-types. In return, Dragapult can use its multi-hit attacks to threaten opposing Psychic Terrain teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Dreadfury", "user_id": 408271}], "teams": [{"name": "Quality checked by", "members": [{"username": "Greentea570", "user_id": 542215}, {"username": "royalfluxh", "user_id": 493260}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Hatterene": {"sets": {"Calm Mind": {}, "Healing Wish": {}}},
  "Grimmsnarl": {"outdated": true, "sets": {"Dual Screens": {}}},
  "Indeedee": {"sets": {"Terrain Setter": {}}},
  "Dragapult": {
    "sets": {
      "Boots Pivot": {
        "description": "<p>Dragapult is one of OU's best pivots, with its massive base Speed stat allowing it to dance around slower threats, spread status and deal significant damage over the course of a game. Dragon Darts is a strong STAB option that hits key targets in the tier such as Roaring Moon, Raging Bolt, and Dragonite, with the given spread running enough Attack investment to OHKO Kyurem after Stealth Rock damage. Alternatively, Draco Meteor can be used with an EV spread fully invested into Special Attack that lets it secure an OHKO into Walking Wake and Gouging Fire while also giving Dragapult a more powerful Hex to 2HKO even max HP Gholdengo, but the Special Attack drop from Draco Meteor leaves it vulnerable to being used as setup fodder, and this set is also weaker into sweepers that boost their Special Defense such as Raging Bolt and Volcarona. Both Will-O-Wisp and Thunder Wave are great options that synergize with the rest of Dragapult's toolkit by doubling the power of Hex; Will-O-Wisp turns Dragapult into a great fast check that can outrun and neutralize physical threats such as Zamazenta, Great Tusk, and Kingambit while also forcing chip on Pokemon like Ting-Lu and Clodsire that try to switch in, while Thunder Wave slows down targets like Volcarona to help teammates deal with them more easily. Tera Fairy is a great defensive option that flips Dragapult's Dragon weakness into an immunity while also granting a Dark resistance to resist hits from Kingambit and Darkrai, whereas Tera Ghost powers up Hex while still dropping its weaknesses to Fairy and Dragon to help block revenge killing attempts by Enamorus.</p> <p>Heavy-Duty Boots Dragapult is a fantastic pick on balance teams, synergizing well with durable hazard setters such as Skarmory, Gliscor, and Ting-Lu that can assist in chipping down the switch-ins that it forces. In return, Dragapult helps to patch up bulkier teams' lack of speed control while not minding the hazards that they often allow on both sides of the field. Knock Off users such as Meowscarada and Weavile are solid pairings with Dragapult on these balance structures, removing Heavy-Duty Boots from opposing Pokemon to make the switches that Dragapult forces more meaningful while giving Dragapult opportunities to come in for free on their own checks, allowing these teams to better pressure opposing Skarmory and Corviknight. Bulkier offense teams also benefit from the presence of Dragapult as a form of speed control that wears down defensive cores with both damage and status effects; Kingambit in particular is a terrifying late-game sweeper that appreciates Dragapult's ability to weaken a team for it to clean through, with Will-O-Wisp Dragapult able to neuter its physical checks like Great Tusk, Zamazenta, and Skarmory, while Thunder Wave variants can slow down threats that would otherwise outspeed Kingambit such as Volcarona, Cinderace, and Heatran. In turn, Dragapult often invites in opposing Kingambit, which resists its STAB options and is only threatened by its status moves, so solid switch-ins for this like Skarmory and Great Tusk are usually appreciated to prevent it from getting too many free turns. Raging Bolt in particular is a strong partner to pivot Dragapult on bulky offense teams that enjoy its support to help break through Ting-Lu, Clodsire, and specially defensive Gliscor. Heavy-Duty Boots Dragapult also struggles to muscle past bulkier checks like Toxapex and Clefable alone, so partners that can take advantage of them for setup opportunities such as Kingambit and Gholdengo are great picks. As Dragapult's Speed tier is almost unmatched in the OU metagame, Booster Energy users like Iron Boulder and Iron Valiant along with the even faster Deoxys-S are frequently forced in to revenge kill it, so more defensive teammates that can handle these threats are valued; Galarian Slowking is a good bulky pivot that takes on the latter two and can use Chilly Reception to bring in Dragapult for free after taking a hit, while both Gliscor and Skarmory are solid Iron Boulder checks that can either beat it or force it to switch out and lose its Speed boost, allowing Dragapult to outspeed it later.</p>"
      },
      "Choice Specs": {
        "description": "<p>Dragapult is an amazing source of immediate power due to its near unresisted STAB combination, solid Special Attack, and excellent Speed tier, which outspeeds the majority of the unboosted metagame except Deoxys-S. Equipping Choice Specs allows Dragapult to break through Pokemon such as Gliscor and Zamazenta with its STAB moves. Flamethrower threatens Kingambit. U-turn allows Dragapult to keep the momentum for its team and hit Dark-types like Ting-Lu and Roaring Moon. Infiltrator allows Dragapult to be a great check to dual screens teams and Substitute sweepers such as Iron Defense Zamazenta. Tera Ghost powers up its most spammable STAB attack in Shadow Ball, allowing Dragapult to further dent Galarian Slowking and secure the OHKO on Iron Valiant and Skeledirge. This also improves its matchup into Iron Valiant and Enamorus, as it takes much less damage from Moonblast, allowing it to survive a hit and KO them back. Tera Dragon raises Draco Meteor to nuclear levels, OHKOing Gliscor, Dondozo, and defensive Landorus-T, and it also improves Dragapult's matchup into Darkrai and Gholdengo, as it removes it weakness to Dark Pulse and Shadow Ball, respectively. A Modest nature can be run instead of Timid to forego outspeeding Zamazenta, Weavile, and Darkrai for higher damage output, such as OHKOing Gliscor and Serperior with Draco Meteor.</p> <p>Dragapult fits well on offensive teams due to its excellent ability to break down walls such as Toxapex, Ting-Lu, and Clodsire. Therefore, Dragapult is able to benefit sweepers like Gholdengo, Raging Bolt, and Volcarona that appreciate walls being worn down. Dark- and Fairy-types like Kingambit, Roaring Moon, and Clefable are threats to Dragapult, as they are able to switch in and force it out. Therefore, checks to these such as Iron Valiant, Great Tusk, and Zamazenta make for good partners. The latter two help with Kingambit, which is Dragapult's biggest check due to resisting both of its STAB moves. Dragapult benefits from entry hazards on the opposing side of the field. Therefore, entry hazard setters like Ting-Lu and Gliscor are good partners for it. Knock Off support from the likes of Weavile, Roaring Moon, and Meowscarada are able to be brought in by Dragapult's U-turn, removing Heavy-Duty Boots from Kyurem and Darkrai. Meowscarada especially is a great partner, since it’s able to bring Dragapult in with its own U-turn after removing Heavy-Duty Boots, allowing Dragapult to better pressure its checks. Dragapult is not very good at switching into attacks, as it is relatively frail, so slow pivots like Galarian Slowking and Alomomola are amazing teammates. Entry hazards wear down Dragapult over time, limiting the number of times it can switch onto the field; therefore, hazard control from Great Tusk and Cinderace can help Dragapult. Deoxys-S and Booster Energy Pokemon with a Speed Boost such as Roaring Moon and Iron Valiant are able to outspeed and threaten to KO Dragapult, so speed control like Rillaboom, Raging Bolt and Kingambit make for good teammates.</p>"
      },
      "Focus Sash": {}
    },
    "credits": {"writtenBy": [{"username": "skippergamez", "user_id": 620268}, {"username": "kd458", "user_id": 633798}], "teams": [{"name": "Quality checked by", "members": [{"username": "viivian", "user_id": 584916}, {"username": "veti", "user_id": 612907}, {"username": "autumn", "user_id": 384270}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Zamazenta": {
    "sets": {
      "Heavy-Duty Boots": {},
      "Iron Defense": {
        "description": "<p>Iron Defense Zamazenta is a fast sweeper for offense that also happens to blanket check most of the physical metagame with great matchups into key threats such as Kingambit, Great Tusk, and Weavile. It acts as a strong form of role compression that can make use of its great bulk, a Defense boost from Dauntless Shield, and its high Speed stat to find opportunities to use Iron Defense to not only bolster its survivability but also strengthen the power of its Body Press. Crunch is a necessity to hit Ghost- and Psychic-types like Gholdengo, Skeledirge, and Galarian Slowking that aren't threatened by Body Press, while its last moveslot is more flexible; Heavy Slam gives Zamazenta super effective coverage into Fairy-types that otherwise would wall it such as Clefable, Enamorus, and Iron Valiant, while Substitute allows Zamazenta to dodge status moves from the likes of Gliscor, Galarian Slowking, and Toxapex along with helping to block revenge killing attempts from faster Pokemon such as Booster Energy Iron Valiant and Choice Scarf Gholdengo. Stone Edge is an alternative that gives Zamazenta a non-contact option to hit Volcarona and Zapdos while still giving it coverage to hit Enamorus, at the expense of losing its ability to hit other Fairy-types and the benefit of Substitute's status and revenge killing protection. 168 EVs in Speed allow Zamazenta to outrun Adamant Dragonite after a Dragon Dance while also outrunning key threats like Weavile and Darkrai. Zamazenta can then choose to invest EVs into HP for better overall bulk or into Attack for stronger coverage moves; notably, maximum HP investment ensures that Zamazenta will survive Choice Scarf Enamorus's Moonblast from full while also avoiding a 2HKO from Clefable. Choosing to maximize Attack gives Zamazenta a clean 2HKO on offensive Gholdengo with Crunch and on both Clefable and Hatterene with Heavy Slam. The remaining EVs are invested in Defense to improve Zamazenta's bulk and give it a stronger Body Press. Tera Steel is one of Zamazenta's best options, defensively flipping the matchup into Fairy-, Psychic-, and Flying-type attacks from foes like Enamorus, Galarian Slowking, Deoxys-S, and Dragon Dance Roaring Moon while also powering up Heavy Slam to OHKO both Enamorus and Iron Valiant even without Attack investment. Tera Steel also gives Zamazenta a crucial immunity to Toxic from Gliscor and Toxapex. Tera Fire serves to grant Zamazenta a key Fairy resistance without making it weak to Fighting-type moves from Iron Valiant, but the primary draw of this Tera type is an immunity to burn, a particularly important quality against Dragapult and Skeledirge, the former of which being able to burn even Substitute variants of Zamazenta with Infiltrator. Tera Fairy is another solid defensive typing for Zamazenta, granting it a great defensive profile that includes a resistance to Fighting-type attacks that helps out immensely in the Iron Defense mirror matchup against both Zamazenta and Skarmory, as well as an immunity to Dragapult's Draco Meteor and a retained resistance to Dark-type attacks that allows you to still check Weavile and Roaring Moon; Tera Ghost is an option that leans even heavier into beating opposing Iron Defense users at the expense of granting little defensive value.</p> <p>Zamazenta is a great fit on both bulky offense and hyper offense teams that need a fast offensive piece with good matchups into the tier's physical threats, in particular providing a crucial Kingambit check to a team. However, to be able to fully leverage its defensive value, it appreciates entry hazard removal to allow it to switch in without taking chip damage on entry and potentially being neutered entirely by Toxic Spikes. Hatterene is a particularly good partner in this regard, as it not only blocks entry hazards but can also be used to weaken shared checks like Gholdengo, Galarian Slowking, and Skeledirge, and Great Tusk can clear hazards from the field along with helping to wear down Gliscor and force in and chip down Gholdengo attempting to block Rapid Spin. Rillaboom also serves as a great pairing that helps to bolster Zamazenta's longevity, with the additional healing from Grassy Terrain making Zamazenta much more difficult to remove from the field. Zamazenta's ability to check the tier's offensive Dark-types is also a valuable quality for hyper offense teams that opt to run a hazard lead like Glimmora or Deoxys-S, as these builds often use Gholdengo to block hazard removal; this will often give threats like Kingambit, Weavile, and Hisuian Samurott free attacks that necessitate an offensive switch-in that Zamazenta provides. Zamazenta is then able to take advantage of these Pokemon by using them as setup fodder. Gholdengo itself is a strong partner to Zamazenta, able to switch into Fairy- and Psychic-type attacks from Enamorus, Iron Valiant, and Hatterene while also taking advantage of Zamazenta's defensive checks like Galarian Slowking and Clefable being unable to touch it. Zamazenta's relatively low wallbreaking power unfortunately leaves it struggling to muscle through Unaware walls like Dondozo, Skeledirge, and Clodsire, while its inability to boost the strength of its coverage moves makes bulkier Pokemon that don't fear Body Press like defensive Gholdengo and Galarian Slowking hard to break through; Zamazenta matches up best into opposing offense teams, and so balance breakers and stallbreakers are appreciated to support it in its other matchups. One strong offensive pairing with Zamazenta is Dragon Dance Roaring Moon, as it can weaken Skarmory and remove its Rocky Helmet to allow Zamazenta to later break through it. In particular, Roaring Moon's ability to chunk Dondozo and force it to take hazard damage with Knock Off is much appreciated to help Zamazenta make progress against it. Kingambit is another excellent teammate for Zamazenta, loading well into bulkier teams and heavily pressuring Dondozo while also being able to switch into Dragapult, Gholdengo and Hatterene that may come in to force Zamazenta out. A great partner to Zamazenta on hyper offensive teams is Booster Energy Iron Valiant, able to weaken shared checks like Gholdengo, Galarian Slowking, and Skeledirge for Zamazenta to later break through. Iron Valiant also provides hyper offensive teams with a temporary form of speed control that can outrun Dragapult and Deoxys-S, both of which outspeed and can threaten Zamazenta with strong special attacks, or, in Dragapult's case, debilitating status with Will-O-Wisp.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "kd458", "user_id": 633798}], "teams": [{"name": "Quality checked by", "members": [{"username": "royalfluxh", "user_id": 493260}, {"username": "SetsuSetsuna", "user_id": 548068}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Zarude": {"sets": {"Swords Dance": {}, "Bulk Up": {}}},
  "Ursaluna": {
    "outdated": true,
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance Ursaluna is a peerless wallbreaker that can muscle through even the bulkiest of Pokemon. After Flame Orb activates, Facade 2HKOes even Pokemon as physically bulky as Dondozo and OHKOes physically defensive Great Tusk after a Swords Dance while letting Ursaluna act as a status absorber. Headlong Rush is generally preferred for its higher power, but Earthquake is another good option that avoids Rough Skin and Rocky Helmet damage and lets Ursaluna leverage its good bulk. Fire Punch hits Corviknight, Air Balloon Gholdengo, and Air Balloon Kingambit, which resist Ursaluna's STAB combination. Tera Normal boosts Facade to breathtaking levels, allowing it to cleanly 2HKO physically defensive Corviknight after Stealth Rock. Tera Ghost is an alternative that lets Ursaluna avoid being revenge killed by Fighting-type attacks such as Close Combat from Great Tusk, Iron Valiant, or Sneasler. The given EV spread maximizes Ursaluna's damage output while also ensuring it outspeeds Skeledirge and standard Corviknight. On Trick Room teams, Ursaluna should run maximum Attack and HP investment, a Brave nature, and 0 Speed IVs.</p> <p>Ursaluna serves as an exceptionally powerful wallbreaker on hyper offense and bulky offense teams. Entry hazard support from Great Tusk, Glimmora, Hisuian Samurott, and Garchomp is appreciated to make Ursaluna even more difficult to wall. Dual screens support from Dragapult can also be considered, since it will further reinforce Ursaluna's excellent bulk, and Dragapult can even provide free switches through Curse or U-turn. Against slower-paced teams, Ursaluna's great bulk and immunity to status give it many opportunities to switch in and start wreaking havoc, but it can struggle against faster-paced, more aggressive teams. Good partners for Ursaluna that excel against offense include Kingambit, Iron Valiant, Dragapult, and Zamazenta, which, in return, appreciate Ursaluna breaking through Pokemon such as Dondozo and Corviknight. Ursaluna enjoys U-turn or Volt Switch support from Rotom-W, Landorus-T, or Dragapult, letting it hit the field multiple times to fire off its insanely powerful attacks. Galarian Slowking is another great teammate for Ursaluna, as it can both provide momentum with Chilly Reception and supplement Ursaluna's firepower with Future Sight. Galarian Slowking can also switch into and pressure some of the Pokemon that give Ursaluna trouble, such as Iron Valiant. Trick Room support from Hatterene and Cresselia is an interesting option to turn Ursaluna's low Speed into an advantage.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "nimzowitsch", "user_id": 272785}], "teams": [{"name": "Quality checked by", "members": [{"username": "Dreadfury", "user_id": 408271}, {"username": "Mellow", "user_id": 423226}, {"username": "royalfluxh", "user_id": 493260}]}, {"name": "Grammar checked by", "members": [{"username": "memesketch", "user_id": 537558}, {"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Basculegion": {"sets": {"Rain Sweeper": {}}},
  "Enamorus": {"sets": {"Choice Scarf": {}, "Choice Specs": {}}},
  "Enamorus-Therian": {
    "outdated": true,
    "sets": {
      "Double Dance": {
        "description": "<p>Enamorus-T's good natural defenses and access to boosting moves in Calm Mind and Iron Defense allow it to serve as a viable wincon that is difficult to remove once it starts setting up. What Draining Kiss may lack in power, it makes up for with its ability to keep Enamorus-T healthy, which is critical, since this set is focused on longevity over raw damage. Earth Power pairs exceedingly well with it, giving Enamorus-T impressive coverage that is resisted by only a few Pokemon while hitting threats like Gholdengo and Heatran super effectively. Leftovers help keep Enamorus-T healthy while it racks up boosts, but Heavy-Duty Boots keeps it safe from Stealth Rock, which poses to cut away a significant amount of HP once Enamorus-T switches in. Grassy Seed can also be run if Enamorus-T is paired with Rillaboom, as the instant Defense boost can aid it greatly in setting up. Terastallization aids Enamorus-T's ability to set up by mixing up its defensive profile;Tera Steel allows it to deal with Poison- and Steel-types, giving it a chance to take Dire Claw from Sneasler and Iron Head from Kingambit, respectively. It also removes its weakness to Electric, giving it a better matchup against Zapdos. In addition, with Overcoat, Tera Steel makes Enamorus-T a very capable Amoonguss switch-in, letting it use it as setup fodder for a potential sweep. Tera Water maintains the resistance to Steel while also giving it a resistance to Ice, and can turn Enamorus-T into a useful Walking Wake check in a pinch. The EV spread is designed to keep Enamorus-T as bulky as possible while still allowing it to outspeed uninvested Kingambit, Azumarill, and Ursaluna.</p> <p>Enamorus-T fits best on bulky offensive teams that allow it to sweep late-game once its checks have been whittled down or removed. Therefore, offensive wallbreakers like Sneasler and Iron Valiant serve as good teammates for it. The latter in particular is good at wearing down Moltres and Corviknight, two common Pokemon that resist both of Enamorus-T's attacks. Offensive hazard setters like Hisuian Samurott also help by wearing down the opponent's team. If Enamorus-T is not using Heavy-Duty Boots, then hazard removal is a necessity, so Pokemon like Great Tusk and Cinderace are further appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "chimp", "user_id": 197439}], "teams": [{"name": "Quality checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Sp0oN1oRd", "user_id": 513254}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Meowscarada": {
    "sets": {
      "Boots Pivot": {
        "description": "<p>Meowscarada is one of the tier's premier offensive pivots thanks to its stupendous base 123 Speed, a critical benchmark that lets it outspeed scary threats like Cinderace, Iron Valiant, Roaring Moon, and Serperior. Knock Off scares some of the tier's key dangers like Deoxys-Speed, Dragapult, and Gholdengo while simultaneously threatening to cripple other switch-ins like Archaludon, Hatterene, and Volcarona. Flower Trick cuts through bulky threats such as Dondozo, Great Tusk, and Primarina, even ignoring the former two's potential Defense boosts, while Triple Axel gives Meowscarada a crucial Ice-type STAB move that allows it to nail common Pokemon such as Clodsire, Gliscor, Raging Bolt, and Roaring Moon. U-turn could be used in the last slot for keeping momentum while chipping switch-ins such as Kingambit and Hatterene. Alternatively, Meowscarada can run Low Kick to smack some of the tier's most threatening staples such as Archaludon, Kingambit, and Kyurem. Heavy-Duty Boots is practically a requirement on this set, as Meowscarada will frequently be switching in and out of combat and is otherwise quite weak to hazards. Tera Grass and Dark enhance Flower Trick and Knock Off while Tera Fire grants Meowscarada some crucial resistances to Fairy, Ice, and Steel-type attacks such as those from Enamorus, Gouging Fire, and Choice Scarf Gholdengo. Tera Electric is an additional option that allows Meowscarada to feast on Zapdos more effectively thanks to a newly gained Static immunity and resistance to both of its STAB moves.</p> <p>Meowscarada fits best on balance teams that need a way to force hazard chip along with Knock Off spam to whittle down or outright threaten Pokemon that otherwise don't mind Knock Off such as Gliscor. Meowscarada's frailty courtesy of its pitiful bulk is sometimes hard to work around and limits its switch in opportunities, especially with common weaknesses courtesy of its exploitable defensive typing and a nasty 4x weakness to U-turn. Furthermore, Meowscarada, while being quite fast, is still outsped by monsters such as Darkrai, Dragapult, Weavile, and Zamazenta, the latter of which happens to be one of Meowscarada's best checks. Weavile's offensive tenacity combined with deadly Speed makes it a potent threat, which is why Rocky Helmet Skarmory is one of Meowscarada's best partner options on balance teams, as it punishes Triple Axel spam and shrugs off Weavile's hits comparatively easily. Meowscarada's role as an offensive pivot helps chip away at opposing cores while also bringing some of their key defensive threats into OHKO range for some frail teammates like Darkrai, Iron Boulder, and Gholdengo. Dragapult is another great partner for Meowscarada; it can blank Fighting-type attacks and follow up with a fast Will-O-Wisp to neuter Zamazenta as well. Meowscarada's defensive woes can be covered by bulky teammates that don't mind taking coverage moves from faster threats. On the physical side, Gouging Fire and Great Tusk are both excellent partners whose typings complement Meowscarada's. Gouging Fire acts as a great Will-O-Wisp absorber, while Great Tusk's role as a physically bulky offensive spinner with synergistic typing opens up multiple opportunities to clear hazards. On the special side, Clodsire and Galarian Slowking are both impressive partners thanks to their longevity and fantastic defensive profiles, with the former being able to blank setup sweepers like Darkrai and the latter being able to continue Meowscarada's momentum chain by using a slow Chilly Reception to take a hit or scout a switch, allowing Meowscarada to come in safely. Additionally, Galarian Slowking also threatens Pokemon that would commonly switch into Meowscarada like Iron Defense Zamazenta with Future Sight.</p>"
      },
      "Choice Item": {}
    },
    "credits": {"writtenBy": [{"username": "Morkal", "user_id": 367494}], "teams": [{"name": "Quality checked by", "members": [{"username": "BT89", "user_id": 487308}, {"username": "ausma", "user_id": 360720}, {"username": "kd458", "user_id": 633798}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Skeledirge": {"sets": {"Defensive": {}}},
  "Maushold": {"outdated": true, "sets": {"Tidy Up Sweeper": {}}},
  "Garganacl": {
    "outdated": true,
    "sets": {
      "Curse": {
        "description": "<p>Curse Garganacl is a sturdy wall that can spread passive damage and boost to win in the long term. It can take hits from Dragapult, Zapdos, and Iron Moth as well as sit on passive walls like Toxapex, Clodsire, and non-Grass Knot Amoonguss, giving it plenty of opportunites to enter the field. In addition to letting it contest with Attack-boosting foes like Dragonite, Dragapult, and Roaring Moon, Curse boosts Salt Cure's initial damage to threaten Pokemon like Corviknight, which would otherwise exhaust Salt Cure's PP with Pressure. Curse also works well with Earthquake, breaking past Covert Cloak Gholdengo, non-Haze Toxapex, opposing Garganacl, and Skeledirge's Substitute. Stealth Rock is a viable alternative if the team lacks a Stealth Rock user, since Garganacl tends to force multiple switches with Salt Cure and can outlast and annoy common entry hazard removers like Great Tusk and Corviknight. Tera Water lets it take on Kingambit, Gholdengo, Azumarill, and rain teams better, while Tera Fairy improves its matchup against Dragapult, Great Tusk, and Meowscarada, the latter of which can bypass Garganacl's boosts with Flower Trick. The EV spread prevents a 2HKO from offensive Great Tusk's Close Combat or Headlong Rush after Curse, even after its Leftovers is removed by Knock Off.</p> <p>Curse Garganacl is a valuable asset for balance teams. Defensive teammates such as Corviknight, Toxapex, Skeledirge, and Clodsire cover threats like Great Tusk, Greninja, Iron Valiant, and Gholdengo, respectively. Skeledirge in return appreciates Garganacl switching into Shadow Ball from Dragapult and Hisuian Zoroark, with Tera Water variants dealing with Gholdengo and Water-types as well, while Ting-Lu and Clodsire are secondary checks to Dragapult, Heatran, and Iron Moth, which keeps Garganacl moderately healthy early-game so it can have an easier time sweeping later on. Knock Off users such as Great Tusk and Meowscarada are crucial to remove Covert Cloak and Heavy-Duty Boots from Pokemon like Amoonguss, Clodsire, Gholdengo, Corviknight, and Slowking. Great Tusk, Meowscarada, Toxapex, and Clodsire can also set entry hazards of their own, either allowing Garganacl to forgo Stealth Rock or forming an entry hazard stacking core. Offensive teammates like Dragapult and Choice Scarf Iron Valiant and Meowscarada are great against offensive teams that contain the likes of Dragonite and Roaring Moon—which can overwhelm Garganacl prior to boosting—and can clean up late-game in case Garganacl is unable to fully sweep. In return, Garganacl matches up well against defensive foes that they struggle with, such as Clodsire and Toxapex, especially with Dragapult bringing it into them safely via U-turn.</p>"
      },
      "Stealth Rock": {
        "description": "<p>Garganacl is a great Stealth Rock setter thanks to its fantastic bulk, longevity with Recover, and ability to easily force switches against Great Tusk and outlast Defog Corviknight one-on-one. Protect alongside Salt Cure wears down entry hazard removal options such as Great Tusk and especially Corviknight due to its limited Roost PP and typing's vulnerability to Salt Cure. Protect also scouts out the intentions of Choice locked Pokemon such as Gholdengo and gives extra Leftovers recovery. Terastallization, lets Garganacl turn the tables on Great Tusk and Iron Treads lacking Iron Head, and makes it an incredibly consistent Stealth Rock setter. Specifically, Tera Fairy lets it completely wall Dragapult, while Tera Water lets it check Gholdengo, though this makes its matchup against opposing Garganacl much tougher. 116 Special Defense EVs let Garganacl take a Draco Meteor from Choice Specs Tera Dragon Dragapult at full health.</p> <p>Garganacl fits on a wide variety of teams from bulky offense to stall thanks to it setting up Stealth Rock easily and having fantastic longevity. Ting-Lu is a fantastic partner since it can lay Spikes, and check Gholdengo and unboosted Kingambit, and wear down Corviknight much faster with Ruination thanks to Garganacl running Stealth Rock. Meowscarada and Great Tusk provide Knock Off support by removing Heavy-Duty Boots and Covert Cloak from Gholdengo and Toxapex to let Garganacl accrue Salt Cure damage more freely. Great Tusk also removes entry hazards with Rapid Spin. Gholdengo appreciates Great Tusk being worn down, since it shuts down other forms of entry hazard control well and fits alongside Garganacl and other entry hazard setters such as Garchomp. Cinderace lures in and uses U-turn on bulky Water-types such as Dondozo and Toxapex, giving Garganacl free entry to pressure them with Salt Cure.</p>"
      },
      "Iron Defense": {
        "description": "<p>The combination of Iron Defense + Body Press lets Garganacl serve as a bulky and dangerous setup sweeper, allowing it to beat Pokemon it otherwise loses to, such as Dragonite, Roaring Moon, and Kingambit. Salt Cure wears down common switch-ins such as Great Tusk, Gholdengo, Rotom-W, and Hatterene, as well as passive Pokemon like Toxapex and Corviknight, and forces them to burn recovery PP more often. Recover keeps Garganacl healthy throughout a game to check Pokemon like Ceruledge and Iron Moth and makes it more sustainable as a wincon. Purifying Salt prevents it from being crippled by Pokemon like Toxapex, Rotom-W, and Clodsire. It also provides a handy Ghost resistance, letting Garganacl potentially switch in on predicted Ghost-type moves from Pokemon like Dragapult and Skeledirge. Leftovers provides valuable passive recovery, reducing Garganacl's reliance on Recover. Maximum Special Defense EVs and a Careful nature maximize Garganacl's bulk, making it easier for Garganacl to switch in on Pokemon such as Dragapult, Zapdos, and Heatran and use them as setup fodder. Tera Water provides incredibly valuable resistances, letting Garganacl potentially check Gholdengo and Scizor while retaining its ability to pivot in on Fire-types like Cinderace. Tera Fairy allows Garganacl to turn the tables on Great Tusk while also preventing Breloom from revenge killing it. However, this does remove its resistance to Fire, making it more susceptible to Pokemon like Skeledirge and Ceruledge. Tera Ghost prevents Fighting-types like Iron Hands and Great Tusk from reliably revenge killing Garganacl, letting it use them as setup fodder. It does negate the Ghost resistance provided by Purifying Salt, however, so another switch-in to Dragapult's Shadow Ball should be used.</p> <p>Checks to strong wallbreakers like Iron Valiant and Breloom are good teammates; examples include the likes of Toxapex, Amoonguss, and Corviknight. While Garganacl is given a Ghost resistance from Purifying Salt, it cannot fully check Dragapult and Gholdengo prior to Terastallization, with the latter completely countering it if it uses Covert Cloak. As such, Pokemon like Ting-Lu and Clodsire make for great teammates. Pokemon like Corviknight and Scizor appreciate Garganacl checking Fire-types like Ceruledge and Skeledirge. Corviknight is notable in that it also forms a strong defensive core with Garganacl, checking Meowscarada for it. Entry hazard removers like Great Tusk and the aforementioned Corviknight are appreciated, as Garganacl is heavily pressured by entry hazards and cannot set up reliably if it is worn down. Frail, offensive Pokemon like Cinderace appreciate chip damage being forced onto their checks and having a strong defensive Pokemon to fall back on. Pokemon like Ting-Lu, Kingambit, and Iron Valiant can pave the way for Garganacl to clean late-game, wearing down or significantly pressuring its checks in Gholdengo, Meowscarada, and Fighting-types like Iron Hands and Great Tusk.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}, {"username": "Sulo", "user_id": 528036}, {"username": "romanji", "user_id": 524894}], "teams": [{"name": "Quality checked by", "members": [{"username": "SetsuSetsuna", "user_id": 548068}, {"username": "dex", "user_id": 277988}, {"username": "Tysonslayer", "user_id": 349443}, {"username": "Milo", "user_id": 540138}, {"username": "ausma", "user_id": 360720}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "aurora", "user_id": 109385}, {"username": "deetah", "user_id": 297659}, {"username": "Dawn of Ares", "user_id": 467437}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Ceruledge": {"sets": {"Swords Dance": {}}},
  "Tinkaton": {"outdated": true, "sets": {"Utility": {"description": "<p>These are sample set(s) as we wait for the metagame to settle before working on <a href=\"https://www.smogon.com/forums/forums/ou-analyses.758/\">new analyses</a>. They will be updated as the metagame continues to develop, so stay tuned!</p>"}}},
  "Glimmora": {"sets": {"Lead": {}}},
  "Dondozo": {"sets": {"Wall": {}}},
  "Clodsire": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Clodsire is a defensive Pokemon with great abilities, using Unaware to sit in front of setup sweepers and Water Absorb to stop a sweeping Walking Wake. Its fantastic defensive typing allows it to absorb Toxic Spikes and nets it nice resistances to Fighting and Fairy, letting it check a unique combination of threatening offensive Pokemon like Iron Valiant, Skeledirge, and Rotom-W. To aid in checking them, it runs Toxic to put these Pokemon on a timer, stalling with Recover as poison damage increases. When they're inevitably forced to switch, their replacement takes damage too since Clodsire sets Stealth Rock or Spikes, racking up even more damage. Leftovers can be used to help preserve Recover’s PP and stay in longer, while Heavy-Duty Boots helps Clodsire switch in and out to wall threats. Earthquake, besides providing direct damage, super effectively damages Pokemon that can't be poisoned like Gholdengo and other Clodsire. Terastallization gives Clodsire much more defensive flexibility as well; Tera Water can help it resist powerful STAB moves from Dondozo and Azumarill which would otherwise scare it out. Tera Flying is another useful option, turning its Ground weakness into an immunity while preserving its Fighting resistance, allowing it to stay in against Great Tusk and Focus Sash Breloom.</p> <p>Clodsire fits neatly into plenty of balance or stall teams looking for a way to handle special hits, offering support with both setting up hazards and removing Toxic Spikes, and walling sweepers with Unaware. Other hazard setters in particular love stacking hazards alongside it; since it learns both Stealth Rock and Spikes, it can fit with many options, like Spikes Meowscarada or Stealth Rock Garganacl. However, its mediocre Defense and weaknesses to Ground and Ice leave it particularly vulnerable to the the tier's physical wallbreakers, most notably Great Tusk, Dragonite, and Garchomp. As such, Clodsire greatly appreciates having teammates who can check these Pokemon and easily switch into Earthquake or Icicle Crash like Rotom-W, Corviknight, and Tera Water Garganacl. In particular, Clodsire is completely stonewalled by Hatterene and Air Balloon or Tera Flying Gholdengo. The former reflects both Toxic and entry hazards while overpowering its healing with Psyshock, and the latter is immune to Toxic via Good as Gold, even if it loses its Steel typing. Great teammates to help check these two are Gholdengo itself for Hatterene, which threatens Hatterene with Make It Rain and its unpredictable set versatility, and Kingambit for opposing Gholdengo, which resists both of Gholdengo's STAB moves and can immediately threaten to OHKO it back. In turn, these two appreciate Clodsire checking the Fire-types that scare them out, especially Iron Moth and Skeledirge. Bulky Water-types like Toxapex and Dondozo can check the Water-type threats Clodsire fears, like Floatzel and Azumarill.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Return to Zero", "user_id": 619344}], "teams": [{"name": "Quality checked by", "members": [{"username": "BT89", "user_id": 487308}, {"username": "SetsuSetsuna", "user_id": 548068}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Kingambit": {
    "sets": {
      "Offensive Swords Dance": {
        "description": "<p>Kingambit is the premier offensive Pokemon in OU, with potent wallbreaking and sweeping potential thanks to its high Attack bolstered by Supreme Overlord and Swords Dance. It has excellent natural bulk and the ability to Terastallize to either maximize damage output or gain defensive advantages against its checks. Its strong Sucker Punch makes it one of the best anti-offense tools in the metagame. Kingambit can use Kowtow Cleave for a more consistent Dark-type attack than Sucker Punch. Iron Head gives coverage against Dark-resistant Pokemon, notably Clefable, Great Tusk, and Zamazenta. Low Kick can be used over Kowtow Cleave or Iron Head to beat opposing Kingambit, although dropping Iron Head for Low Kick leaves Kingambit walled by Fairy-types, while dropping Kowtow Cleave leaves Kingambit walled by Skeledirge and Toxapex and stuck with the less reliable Sucker Punch as its only Dark-type move. Kingambit's item slot is very flexible depending on the needs of the team; Black Glasses is the best item on Kingambit to stack with Supreme Overlord and potentially Tera Dark; Air Balloon can be used to gain setup opportunities on Ground-types like Great Tusk, Gliscor, and Landorus-T; Lum Berry is an option to absorb otherwise crippling status from Pokemon like Galarian Slowking, Dragapult, and Cinderace; and Heavy-Duty Boots is an option on teams with either no or unreliable entry hazard control to keep Kingambit from being worn down by Spikes early-game. Tera Dark powers up Sucker Punch and Kowtow Cleave while removing Kingambit's weaknesses to Fire- and Ground-type moves. In combination with Black Glasses and +2 Attack, it allows Kingambit's Kowtow Cleave to OHKO physical walls such as Alomomola, Gliscor, and Garganacl. Additionally, Kowtow Cleave 2HKOes Dondozo, while +2 Sucker Punch OHKOes Roaring Moon, opposing offensive Kingambit after Spikes, and Hisuian Samurott. Tera Flying allows Kingambit to set up on Ground- and Fighting-types such as Great Tusk, Gliscor, and Zamazenta. Tera Fighting can be used with Low Kick to always OHKO defensive Great Tusk at +2 with five Supreme Overlord boosts and a layer of Spikes, and it can 3HKO Dondozo with five Supereme Overlord boosts. Tera Fighting also provides more setup opportunities than Tera Dark, with the advantage of shedding Kingambit's weakness to Fighting-type attacks. Adamant is preferred to maximize the power of Sucker Punch to break through bulky Pokemon. Jolly can be run over Adamant to win the Low Kick Kingambit mirror matchup against Adamant variants and outspeed some variants of IronPress Skarmory and Corviknight before they can boost Defense. However, the power drop from losing out on Adamant limits Kingambit in all other matchups, especially when Sucker Punch nullifies Adamant's speed drop anyway; Jolly Kingambit cannot OHKO Dragapult with Sucker Punch unboosted, and even with five Supreme Overlord boosts, it cannot 3HKO Dondozo without Black Glasses or Tera Dark.</p> <p>Kingambit fits on offensive and bulky offense teams that appreciate its defensive profile and capabilities as a revenge killer and late-game sweeper, being able to defensively check non-Focus Blast Gholdengo, Choice Specs Dragapult, Meowscarada, and Weavile without Low Kick. Offensively, Kingambit can revenge kill a wide range of Pokemon, including Deoxys-S, Dragapult, and Kyurem while also being able to revenge kill anything without Substitute, Encore, or strong neutral priority, given enough chip damage. Roaring Moon is an excellent partner for Kingambit, overloading Dark-resistant foes and physical walls for each other and paving the way for one of them to break through and end the game. On bulky offense teams, Spikes setters like Skarmory and Gliscor synergize well with Kingambit. Spikes Gliscor in particular provides a highly valuable and resilient Ground immunity and Fighting resistance, and its Toxic also synergizes with Sucker Punch, helping to ease prediction by putting opposing Pokemon on a turn limit. On offensive teams, hazard setters such as Glimmora, Deoxys-S, and Hisuian Samurott help Kingambit break through foes that resist its moves, especially Great Tusk variants without Heavy-Duty Boots, which can be forced to take hazard chip early on. Kingambit can also be used alongside dual screens Deoxys-S and Alolan Ninetales, making it easier to set up and providing a highly valuable Dragapult check to the dual screens team. Rillaboom can support Kingambit with Grassy Surge, giving it easier setup opportunities with extra HP and weakening Earthquake from Gliscor, Great Tusk, Landorus-T, and Ting-Lu. Rillaboom can also switch into Ogerpon-W, Great Tusk, and Dondozo and remove Rocky Helmet from Skarmory and Corviknight with Knock Off. Galarian Slowking appreciates Kingambit resisting Ghost- and Dark-type attacks aimed at it. In return, it supports Kingambit with Future Sight to break through Great Tusk, Zamazenta, Dondozo, Alomomola, and Skarmory while also switching into Iron Valiant, Enamorus, and Zamazenta for Kingambit. Gholdengo is a great teammate for Kingambit, being able to handle threats like Iron Valiant, Zamazenta, Skarmory, Corviknight, Substitute Iron Boulder, and Dondozo while checking Rillaboom and Dragonite, which can punish its Sucker Punch with priority. It also softens opposing teams for Kingambit to finish off using Gholdengo's own wallbreaking capabilities and excellence in keeping entry hazards on the field. Volcarona is another excellent partner for Kingambit, countering Skarmory, Zamazenta without Stone Edge, and Iron Valiant. It also sometimes punishes other Kingambit checks in Great Tusk, Low Kick Weavile and Meowscarada, and Dragonite with Flame Body, turning them into setup fodder for Kingambit.</p>"
      },
      "Bulky Swords Dance": {
        "description": "<p>By investing in bulk, Kingambit gains more setup opportunities and the ability to act as a short-term blanket check for much of the metagame; it also is an effective late-game cleaner. Kingambit can be used to absorb hits throughout the game from Pokemon like Dragapult, as well as Gholdengo and Weavile if they aren't running Fighting-type coverage. Iron Head destroys many of the Fairy-types in the tier, including Enamorus, Clefable, and Hatterene. Tera Blast Fairy is a surprising pick that can take on bulky Fighting-types, including Great Tusk and Zamazenta. Low Kick provides solid coverage for opposing Kingambit as well as maintaining a strong option into Pokemon like Roaring Moon and Ting-Lu. However, without Iron Head, Kingambit struggles with the matchup against Fairy-types. Kingambit makes good use of both Leftovers to increase its longevity late-game and Heavy-Duty Boots to avoid entry hazard damage and continue switching in to keep pressure on. Tera Flying gives Kingambit a resistance to Fighting and an immunity to Ground, allowing it to set up on Great Tusk and Landorus-T, whereas Tera Fairy not only assists Kingambit defensively by giving it a Fighting resistance and a good defensive spread but also gives it access to Tera Blast Fairy to add to its coverage. 44 Speed EVs make Kingambit faster than Blissey, and the remaining 212 EVs not invested in Attack are put into HP, increasing its bulk. Alternatively, Kingambit's HP EVs can be raised to increase bulk, dropping Speed down to 4 EVs, which outruns uninvested Iron Hands, Ursaluna, and Azumarill.</p> <p>Bulky Kingambit is excellent on offense and balance teams as both a powerful late game setup sweeper and a form of speed control. Alongside more passive bulky Pokemon, such as Gliscor and Skarmory, Kingambit helps the team make more progress and break through tougher threats; in return, they can chip down Great Tusk with Toxic or Rocky Helmet damage. These Pokemon also set up entry hazards, which assist with wallbreaking. Slower teams appreciate the priority Kingambit provides, and Pokemon like Gholdengo and Kyurem also appreciate Kingambit's ability to switch into Dragon- and Ghost-type attacks from Dragapult and opposing Gholdengo. Great Tusk can weaken Gliscor, Landorus-T, and opposing Great Tusk for Kingambit while also being able to  remove Skarmory's Rocky Helmet with Knock Off. In return, Great Tusk appreciates bulky Kingambit being able to switch in on Pokemon like Hatterene and Clefable that force Great Tusk out. Kingambit benefits from teammates with the ability to pivot and get it in safely, such as Meowscarada and Galarian Slowking. Galarian Slowking also supports Kingambit by setting up Future Sight, which is difficult for foes to switch in on at the same time as Kowtow Cleave, as it forces special and physical damage on the same turn; only Dark-types resist both, and they struggle to take Kingambit's coverage moves. Kingambit in turn helps Galarian Slowking by resisting Dark and Ghost and switching in on Gholdengo and Dragapult. Kingambit can form a Dark-type spam core with Roaring Moon or Weavile, as they can assist in beating down Dondozo, Skarmory, and Great Tusk. Rillaboom helps Kingambit by removing its Earthquake weakness and providing passive recovery from Grassy Terrain. Due to its lower special bulk, Kingambit can be vulnerable to wallbreakers like Volcarona and Walking Wake. Having teammates more suited to taking hits from such Pokemon, like Galarian Slowking and Toxapex, is a good solution. Combining Kingambit's power with the power of Pokemon like Iron Valiant and Gholdengo is another way to boost a team's wallbreaking potential. Gholdengo's ability allows it to keep hazards up, helping Kingambit keep pressure up. Both Pokemon defensively check Pokemon that threaten the other; Gholdengo checks Fighting-types like Iron Valiant and Zamazenta, while Kingambit checks Ghost-types like Dragapult and other Gholdengo. Iron Valiant and Kingambit both have powerful speed control and support each other by weakening their shared checks, like Gliscor and Volcarona. Kingambit is also useful against Galarian Slowking and Gholdengo, which Iron Valiant forces in.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Nichalho", "user_id": 359575}, {"username": "veti", "user_id": 612907}], "teams": [{"name": "Quality checked by", "members": [{"username": "Dreadfury", "user_id": 408271}, {"username": "veti", "user_id": 612907}, {"username": "kd458", "user_id": 633798}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "zastra", "user_id": 558636}]}]}
  },
  "Great Tusk": {
    "sets": {
      "Offensive Bulk Up": {
        "description": "<p>Bulk Up Great Tusk with Booster Energy's Speed boost is a potent physical setup sweeper that is capable of providing valuable utility to its team, as its access to Rapid Spin and its natural bulk allows it to check key threats such as Dragonite, Kingambit, and Gouging Fire. Bulk Up leverages Great Tusk's natural bulk to give it setup opportunities against many of the common physical attackers in the tier, such as Kingambit and Zamazenta. Headlong Rush is a brutally powerful option for a Ground-type STAB move and is not weakened by Grassy Terrain. Alternatively, Earthquake can be run if Headlong Rush's low PP and Defense drops prove to be problematic, but misses out on benchmarks like the potential OHKO on Dragapult and Iron Valiant at +1. Ice Spinner allows Great Tusk to hit Grass- and Flying-types such as Serperior, Gliscor, and Enamorus for super effective damage, which would otherwise wall it or force it out. The last moveslot can be Close Combat for a strong Fighting-type STAB move, guaranteeing the OHKO on bulky Kingambit, threatening huge damage on Kyurem and Ting-Lu, and punishing switch-ins like Skarmory and Corviknight with heavy damage; Rapid Spin, which lets it remove hazards and provides it with further boosts to its Speed, preventing otherwise faster threats like Deoxys-S and Booster Energy Iron Valiant from revenge killing it; or Knock Off, which deals with Air Balloon Gholdengo as well as crippling its checks like Dondozo. The EV spread listed is necessary for Great Tusk to attain a Speed boost from Protosynthesis from Booster Energy; however, Leftovers can be used instead should Great Tusk be used on sun. Tera Poison is the premier defensive Tera type for Great Tusk, allowing it to set up on Gliscor's Toxic and completely wall Rillaboom and Zamazenta alongside avoiding a KO and thus granting it an extra turn against Iron Valiant and Enamorus. Conversely, Tera Ice is a strong choice for an offensive Tera type that provides Great Tusk with STAB on Ice Spinner, which can net OHKOs on Gliscor and offensive Zapdos after a boost from Bulk Up. Tera Steel can also be considered as an alternative to Tera Poison that also lets Great Tusk wall Choice Band Dragapult and Dragon Dance Kyurem, at the cost of being weaker into Cinderace, Zamazenta, and Low Kick Kingambit. Additionally, both Tera Ice and Steel provides an Ice resistance against foes like Weavile and Meowscarada.</p> <p>Great Tusk is commonly seen on offense, hyper offense, and sun structures, which appreciate its entry hazard control and ability to clean teams in late-game scenarios. Great Tusk particularly struggles against physical walls such as Skarmory, Corviknight, and Dondozo. On sun teams, strong special attackers such as Raging Bolt and Walking Wake can easily force these Pokemon out and can soften up the opposing team for Great Tusk to sweep in the mid- or late-game. In return, Great Tusk provides key hazard control and switches into powerful physical threats such as Kingambit. Additionally, it can easily shatter common checks to both Walking Wake and Raging Bolt, particularly Clodsire and Galarian Slowking. Hatterene on sun teams and Choice Scarf Enamorus on weatherless offense can support Great Tusk with Healing Wish and can threaten some of its checks, notably Gliscor, Deoxys-S, and Zamazenta. Hatterene also alleviates the need for Great Tusk to run Rapid Spin, freeing up the last moveslot for more offensively oriented options such as Close Combat and Knock Off. Outside of sun, Rillaboom provides Great Tusk with passive recovery without relying on Leftovers and can force out or KO the likes of Primarina and Dondozo. In return, Great Tusk can act as a mid- or late-game sweeper once the opposing team is sufficiently weakened and can threaten Pokemon such as Archaludon that Rillaboom struggles against. Volcarona and Dragonite appreciate the utility of Great Tusk's Rapid Spin and its ability to consistently threaten Skeledirge. In exchange, Volcarona can act as a reliable check to Weavile and Iron Valiant, while Dragonite can handle opposing Volcarona and Ogerpon-W. Lastly, Kingambit enjoys having Great Tusk beating its checks like opposing Great Tusk one-to-one with its own setup, allowing it to more easily sweep late-game.</p>"
      },
      "Offensive Utility": {},
      "Defensive": {
        "description": "<p>Thanks to its gargantuan Defense in tandem with a plethora of utility options and a great defensive typing, Great Tusk makes for a premier defensive presence, checking notable threats like Kingambit, Gouging Fire, and Dragonite. Stealth Rock, in tandem with Rapid Spin, makes Great Tusk a dominant choice for entry hazard control, being able to threaten Pokemon immune to Rapid Spin like Gholdengo and Dragapult with Earthquake or Knock Off while also being able to set up Stealth Rock in the face of aforementioned physical threats. Alternatively, Bulk Up makes Great Tusk more consistently able to check foes like Choice Band Roaring Moon, Iron Boulder, Choice Band Zamazenta, and especially Kingambit. Knock Off punishes common switch ins like Corviknight, Air Balloon Gholdengo, and Zapdos and breaks through Ghost-types like Dragapult. Alternatively, Ice Spinner provides solid coverage for Flying- and Ground-types like Gliscor, Enamorus, and Tera Flying Kingambit. 36 Speed EVs lets Great Tusk outspeed Jolly maximum Speed Kingambit. Tera Water provides Great Tusk means of resisting Water-type attacks from the likes of Barraskewda and Hisuian Samurott while also removing its weaknesses to Fairy and Flying. Alternatively, Tera Steel turns its weaknesses to Grass and Ice into resistances, giving Great Tusk stronger utility against the likes of Meowscarada, Serperior, and Rillaboom. Leftovers gives Great Tusk better longevity, while Heavy-Duty Boots bolsters Great Tusk's role as hazard control.</p> <p>Great Tusk fits best on balance and bulky offense teams as a premier choice for entry hazard control, in addition to acting as a strong check towards the likes of Kingambit and Gouging Fire. Pokemon that heavily benefit from hazard removal, namely Raging Bolt and Gouging Fire, heavily appreciate Great Tusk's capability of shedding entry hazards with ease while being able to take advantage of the Water- and Grass-type Pokemon that threaten Great Tusk. Air Balloon Gholdengo poses a major threat to Great Tusk without Knock Off, as it can otherwise switch in with ease and overwhelm Great Tusk with Shadow Ball. As a result, Kingambit makes for a solid partner to Great Tusk thanks to its strong ability to check non-Focus Blast Gholdengo, as well as Serperior, Meowscarada, and Dragapult. Defensive Great Tusk also doubles as a solid Kingambit answer, meaning that Pokemon that would otherwise be overwhelmed by Kingambit such as Dragapult and Gholdengo make for solid partners. The latter also blocks attempts at removing Stealth Rock from the likes of Corviknight and opposing Great Tusk.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}, {"username": "viivian", "user_id": 584916}], "teams": [{"name": "Quality checked by", "members": [{"username": "chimp", "user_id": 197439}, {"username": "veti", "user_id": 612907}, {"username": "autumn", "user_id": 384270}, {"username": "kd458", "user_id": 633798}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Scream Tail": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Scream Tail's gargantuan bulk and access to utility moves such as Wish and Encore make it a potent support Pokemon. Its defensive typing and high Speed make it a good answer to Great Tusk, Iron Valiant, and Walking Wake. Dazzling Gleam is this set's only attacking move, letting it hit Pokemon like Great Tusk, Dragapult, Hydreigon, and Iron Valiant and prevents it from being shut down by Taunt from Pokemon like Meowscarada, Roaring Moon, and Greninja. Wish gives Scream Tail a recovery move while letting it heal teammates such as Great Tusk, Rotom-W, and Hatterene that lack reliable recovery and are vulnerable to being overwhelmed by repeated hits. Protect synergizes well with Wish, making it much more reliable as a recovery move. Additionally, Protect scouts the intentions of Choice-locked Pokemon like Iron Valiant, Gholdengo, and Hisuian Zoroark. Encore prevents setup sweepers like Volcarona, Calm Mind Iron Valiant, and Bulk Up Great Tusk from using Scream Tail as a setup opportunity, letting Scream Tail's teammates switch in and take advantage of these threats. It can also be used to annoy passive Pokemon like Ting-Lu and Dondozo. Tera Fairy gives Scream Tail better matchups against Hydreigon, Roaring Moon, Dragapult, and Hisuian Zoroark, with the former two being susceptible to being OHKOed by Dazzling Gleam. Alternatively, Tera Water lets Scream Tail maintain a solid defensive typing while also helping it check Walking Wake, Skeledirge, and Greninja. With a Timid nature, 152 Speed EVs let Scream Tail outspeed Hydreigon, while 236 Special Defense EVs ensure that Scream Tail gets a Special Defense boost with Protosynthesis under sun, letting it more easily take on threats such as Walking Wake and Iron Valiant. Alternatively, a spread of 252 HP / 84 SpD / 172 Spe with a Calm nature lets Scream Tail outspeed unboosted Great Tusk and pass beefier Wishes.</p> <p>Scream Tail fits on many sun, balance, and stall teams thanks to its bulk, ability to pass Wish to teammates, and create momentum with Encore. Bulky Water-types like Toxapex and Dondozo make for good teammates, as they are able to check Greninja and Ceruledge, respectively. Moreover, Toxapex also checks Pokemon like Iron Moth and Glimmora as well as spread status, making Encore much more of a detriment to setup sweepers like Volcarona and Iron Valiant, while Dondozo blanket checks physically oriented Pokemon that can overwhelm Scream Tail, namely Booster Energy Roaring Moon and Ceruledge. Entry hazard removers such as Great Tusk, Cinderace, and Corviknight make for excellent teammates, as a lack of hazards means that Scream Tail can accomplish feats such as surviving two Choice Specs Greninja Hydro Pumps from full HP. Additionally, Great Tusk appreciates Wish support in order to more consistently check Scream Tail answers such as Kingambit. Torkoal is a great teammate thanks to its sun activating Scream Tail's Protosynthesis. In addition, Torkoal very much appreciates Wish support in order to more consistently check Pokemon like Kingambit. Meanwhile, Scream Tail is able to sponge special attacks from the likes of Walking Wake. Under sun, Pokemon such as Great Tusk, Ceruledge, and Brute Bonnet appreciate Scream Tail facilitating their sweeps with its combination of Encore and Wish, keeping them healthy while leveraging setup opportunities for them. Hydreigon is another excellent offensive partner, checking Gholdengo and finding more opportunities to set up Substitute thanks to Scream Tail's Wish.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "BT89", "user_id": 487308}], "teams": [{"name": "Quality checked by", "members": [{"username": "SetsuSetsuna", "user_id": 548068}, {"username": "Dreadfury", "user_id": 408271}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Sandy Shocks": {"sets": {"Offensive Pivot": {}, "Booster Energy": {}}},
  "Iron Treads": {"sets": {"Special Attacker": {}, "Physical Attacker": {}}},
  "Iron Hands": {"outdated": true, "sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Iron Jugulis": {
    "outdated": true,
    "sets": {
      "Booster Energy Sweeper": {
        "description": "<p>Iron Jugulis is a potent sweeper due to its stellar offensive typing and excellent Quark Drive-boosted Speed, which allow it to revenge kill fast threats such as Dragapult, Meowscarada, Iron Valiant, and Armarouge after a Weak Armor boost. Hurricane destroys many offensive Pokemon that can take Dark Pulse, including Great Tusk, Iron Valiant, Quaquaval, and Volcarona. Taunt allows Iron Jugulis to function as a dangerous stallbreaker by shutting down passive walls such as Clodsire, Toxapex, and Ting-Lu. It also prevents Slowking from pivoting with Chilly Reception and threats such as Dragonite, Volcarona, Polteageist, and Roaring Moon from setting up. Flamethrower hits Steel-types such as Corviknight, Kingambit, and Iron Treads. Fire Blast trades some of Flamethrower's accuracy for more power, most notably OHKOing the aforementioned Steel-types with Tera Fire. Alternatively, Earth Power OHKOes Iron Moth and lands a stronger hit on Clodsire, Garganacl, Cinderace, Iron Hands, and Toxapex. Tera Dark boosts the power of Dark Pulse, making it easier to pressure walls such as Garganacl, Rotom-W, and Toxapex with its flinch chance. Tera Flying strengthens Hurricane, OHKOing Greninja, Amoonguss, and Cinderace most of the time and 2HKOing Toxapex, Dondozo, and Tera Fairy Skeledirge. Tera Fire strengthens Flamethrower or Fire Blast and gives Iron Jugulis crucial resistances to Iron Valiant's Moonblast.</p> <p>Iron Jugulis is best used on hyper offense teams that appreciate its ability to trouble stall teams and keep fast sweepers in check. Due to its only decent power, Iron Jugulis greatly appreciates entry hazards from teammates such as Glimmora, Greninja, Meowscarada, and Garchomp to wear down its checks. Additionally, Iron Jugulis's Stealth Rock weakness makes entry hazard removers such as Great Tusk and Iron Treads very valuable partners; they can also pressure Clodsire and Iron Moth to free up Iron Jugulis to run a Fire-type move. Powerful wallbreakers such as Breloom and Dragapult can soften up the opposing team for Iron Jugulis to clean up late-game. Conversely, Iron Jugulis's ability to break through special walls with Taunt opens up other special sweepers such as Iron Valiant, Gholdengo, and Iron Moth. Gholdengo can also cripple walls with Choice item + Trick and handle Booster Energy Iron Valiant, one of the only threats capable of outspeeding and threatening Iron Jugulis. Iron Jugulis is also effective on rain teams, providing it with a perfectly-accurate Hurricane and featuring extremely powerful wallbreakers such as Floatzel and Walking Wake that can punch holes for it to sweep late-game. In return, Iron Jugulis threatens Amoonguss and provides a valuable Ghost resistance to take on threats such as Dragapult and Hisuian Zoroark more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "BT89", "user_id": 487308}, {"username": "3d", "user_id": 295768}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Iron Moth": {"sets": {"Booster Energy": {}}},
  "Gholdengo": {
    "sets": {
      "Offensive": {
        "description": "<p>Thanks to its ability Good as Gold and excellent defensive typing that lets it set up on Pokemon like Enamorus, Galarian Slowking, and Clefable, Nasty Plot Gholdengo is a premier wallbreaker in SV OU. While Recover gives Gholdengo a way to stay in the battle for longer and leverage its defensive utility against the aforementioned threats, it also has a range of coverage moves to give it more options for wallbreaking. Psyshock is useful for breaking through special walls that would otherwise give Gholdengo trouble, like Blissey and Clodsire, and Focus Blast hits the many Dark-types in the tier, such as Darkrai, Roaring Moon, and Kingambit. Recover is generally used on bulkier teams, whereas Psyshock and Focus Blast are more useful for teams leaning towards offense. The Ground immunity granted by Air Balloon allows Gholdengo to set up in the face of Ground-types like Gliscor and Great Tusk, even spinblocking the latter in a pinch. Heavy-Duty Boots is another option on teams that lack any entry hazard removal. Gholdengo can make great use of a wide variety of Tera types, both for offensive and defensive purposes: Tera Fairy or Fighting gives it a sudden resistance to Dark, potentially mitigating the damage from moves like Knock Off, Crunch, and Sucker Punch from Great Tusk, Zamazenta, and Kingambit, respectively. Tera Fairy gives it an additional Dragon immunity, whereas Tera Fighting gives Focus Blast an additional STAB boost. Tera Steel can give an additional boost to Make It Rain, as well as lessening the damage of Dark- and Ghost-type attacks from Pokemon like Dragapult.</p> <p>Thanks to Good as Gold, any team can make great use of Gholdengo’s ability to spinblock and prevent Defog, but an offensive team would make the best use of its wallbreaking power. Offensive hazard-stacking cores featuring Pokemon such as Glimmora, Hisuian Samurott, and Deoxys-S can use Gholdengo’s help to keep the pressure on. Powerful Pokemon that take advantage of the switches that Gholdengo forces, like Weavile and Meowscarada with Spikes, as well as other Nasty Plot wallbreakers like Darkrai provide support for Gholdengo to whittle down defensive cores. In addition, other special attackers that have access to utility tools like Knock Off to cripple their shared walls and Pokemon that would otherwise absorb Knock Off, such as Gliscor, Skarmory, Corviknight and Clefable, Darkrai, and Iron Valiant, synergize well with Gholdengo's ability to block all hazard removal. Without using Tera, Gholdengo struggles against the Dark-types that are so common in the tier, such as Kingambit, Roaring Moon, and Hisuian Samurott. Having teammates resistant to Dark-type attacks, like Zamazenta and Enamorus, give Gholdengo some extra protection and a way to strike back against them. Even if it's using Air Balloon, having another Ground-immune Pokemon, such as Gliscor or Tornadus-T, is extremely helpful to mitigate that weakness. Gholdengo’s Speed tier is still slightly lacking when compared to the rest of the OU tier, leaving it vulnerable to fast threats such as Dragapult, Walking Wake, and Weavile. Having some speed control on the team, such as Choice Scarf Enamorous and Meowscarada or priority users like Weavile and Raging Bolt, to counteract these threats is extremely valuable.</p>"
      },
      "Defensive": {
        "description": "<p>Defensive Gholdengo can serve as a bulky spinblocker and powerful setup sweeper in long matches. Its bulk, typing, and access to reliable recovery give it multiple opportunities to pivot into various defensive Pokemon such as Skarmory, Corviknight, Galarian Slowking, and Clefable and make it a more reliable check to key offensive Pokemon such as Iron Valiant, Hatterene, and Zamazenta. It can use its increased bulk to more safely set up a Nasty Plot while sustaining itself with Recover. Gholdengo possesses near perfect coverage with its STAB attacks, making it very difficult to respond to. Dazzling Gleam is an option over Make It Rain, as it deals high damage to Dark-types such as Hisuian Samurott, Kingambit, and Roaring Moon after a Nasty Plot boost. 60 Speed EVs allow Gholdengo to outspeed Jolly Kingambit and Azumarill, as well as uninvested Landorus-T; alternatively, 92 Speed EVs can allow Gholdengo to also outspeed uninvested Gliscor at the cost of losing a noticeable amount of bulk. Air Balloon allows Gholdengo to avoid taking Spikes damage and Ground-type attacks from prominent Pokemon such as Great Tusk and Gliscor, letting it setup on these Pokemon and more safely pivot into Rapid Spin users such as the aforementioned Great Tusk and Iron Treads. Alternatively, Heavy-Duty Boots can be used to more reliably mitigate entry hazard damage and more frequently pivot into various defensive Pokemon such as Skarmory even after it has taken damage. Gholdengo is a fantastic Terastallization candidate in most matches, as it greatly benefits from neutralizing all of its weaknesses to gain a crucial free turn to setup a Nasty Plot or heal itself with Recover. Tera Fairy gives Gholdengo a better matchup against various Dark-types such as Roaring Moon, Weavile, and Meowscarada and boosts the power of Dazzling Gleam. Tera Flying lets it completely dominate Ground-types such as Great Tusk, Gliscor, and Ting-Lu. Tera Water is an alternative option, improving Gholdengo's matchups against Heatran, Cinderace, and Volcarona, as well as Water-types such as Barraskewda and Walking Wake.</p> <p>Gholdengo fits quite well on bulky offense and balance teams as a spinblocker. Therefore, Spikes setters such as Ting-Lu, Gliscor, and Skarmory, as well as Stealth Rock setters such as Great Tusk, Garganacl, and Landorus-T greatly appreciate Gholdengo's ability to block most forms of hazard removal. Offensive teammates also appreciate Gholdengo's presence due to its strong defensive profile and ability to absorb status moves. Kingambit in particular greatly benefits from Gholdengo's ability to block status moves and check Pokemon it struggles against such as Zamazenta and Iron Valiant and can capitalize on Gholdengo luring and weakening its other checks such as Great Tusk. Iron Valiant similarly benefits from Gholdengo's ability to check Hatterene, and it can lure and weaken key checks to Gholdengo such as Clodsire and Volcarona with Psyshock. Gholdengo often struggles against offensive teams due to its poor matchup against many key threats such as Volcarona, Gouging Fire, Darkrai, Kingambit, and Roaring Moon. Great Tusk and Dondozo can help alleviate pressure by dealing with Kingambit and Gouging Fire while simultaneously benefiting from Gholdengo's defensive profile against faster special attackers such as Kyurem and Enamorus. Ting-Lu and Clodsire can handle the special attackers that give Gholdengo trouble, such as Volcarona and Dragapult, and accentuate Gholdengo's threat level with entry hazards. While Gholdengo is excellent at keeping entry hazards on the field, it can often struggle against opposing entry hazard setters such as Ting-Lu, Hisuian Samurott, and Clodsire, particularly if it is unable to Terastallize. Therefore, hazard removal support from Great Tusk is beneficial.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Gholdengo is a great speed control option in the tier capable of outrunning and revenge killing premier offensive threats like Dragapult, Choice Specs Enamorus, and Kyurem. Shadow Ball allows it to threaten foes like Galarian Slowking, Skarmory, and Dragapult, while Make It Rain, with its high Base Power, not only becomes challenging to switch into but also enables Gholdengo to effectively revenge kill Pokemon like Kyurem and Enamorus. Trick is a good utility move that allows it to Choice-lock Pokemon like Ting-Lu, Gliscor, and Archaludon, hampering their effectiveness. Focus Blast enables Gholdengo to hit Dark-types like Kingambit, Hisuian Samurott, and Ting-Lu. Alternatively, Nasty Plot can be used to turn Gholdengo into a potent late-game cleaner once it has successfully used Trick to get rid of its Choice Scarf. In another vein, Recover can be utilized to keep Gholdengo healthy, especially against bulkier foes, once it has used Trick, allowing it to check them more consistently. Tera Fighting gives Gholdengo a resistance to Dark-type moves, most notably Sucker Punch from Kingambit, and it gives Focus Blast a STAB boost. Alternatively, Tera Flying can be used to help Gholdengo against Ground-types like Great Tusk and Gliscor.</p> <p>Gholdengo fits well on bulky offense and balance teams, where it functions as a great revenge killer. Teammates that benefit from Gholdengo's presence include Pokemon that appreciate its ability to handle fast and strong offensive threats. For instance, setup sweepers like Calm Mind Raging Bolt and Bulk Up Great Tusk can capitalize on Gholdengo's ability to revenge kill and weaken opposing threats like Dragapult and Choice Specs Enamorus, creating opportunities for Gholdengo's partners to set up and sweep. Great Tusk's access to Rapid Spin also synergizes well with Gholdengo, which is punished by Spikes, so getting rid of them gives Gholdengo more opportunities to switch in. Entry hazard setters like Gliscor, Skarmory, and Ting-Lu also benefit from Gholdengo's ability to serve as an emergency spinblocker. Moreover, both Gliscor and Great Tusk help in checking Gouging Fire, a foe that Gholdengo is weak to. Due to its vulnerability to Dark-type Pokemon like Kingambit and Hisuian Samurott, exacerbated by its reliance on the inaccurate Focus Blast and the inherent risk of being Choice-locked, Gholdengo greatly benefits from the support of teammates that check the aforementioned foes, such as Zamazenta and Iron Valiant. Rillaboom also deserves a special mention as a teammate, as its Grassy Terrain weakens the super effective Earthquake, in addition to acting as a check to foes like Ting-Lu. In return, Gholdengo helps Rillaboom by handling threats that would otherwise be problematic for the latter, such as Skarmory. Gouging Fire is also a really good teammate for Gholdengo, since it appreciates Gholdengo's ability to exploit the passivity of some of its checks like Toxapex and Dondozo. It also checks Kingambit and offensive Fire-types, such as Volcarona and Cinderace, for Gholdengo.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Magcargo", "user_id": 177111}, {"username": "Nichalho", "user_id": 359575}, {"username": "zastra", "user_id": 558636}], "teams": [{"name": "Quality checked by", "members": [{"username": "alkazoth", "user_id": 518682}, {"username": "veti", "user_id": 612907}, {"username": "kd458", "user_id": 633798}, {"username": "autumn", "user_id": 384270}, {"username": "BT89", "user_id": 487308}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Ting-Lu": {
    "sets": {
      "Entry Hazard Setter": {
        "description": "<p>With incredible bulk, Vessel of Ruin, and access to both Spikes and Stealth Rock, Ting-Lu is one of OU's premier hazard setters and also doubles as a special wall. Spikes are used to hit grounded Stealth Rock-resistant Pokemon like Kingambit and Gholdengo harder, while Stealth Rock can be used instead to damage Spikes-immune Pokemon like Enamorus and Corviknight that repeatedly switch into Ting-Lu, as well as punish Stealth Rock-weak Pokemon like Booster Energy Gouging Fire and Choice Specs Kyurem. Thanks to its huge bulk, Ting-Lu is able to take super effective hits from setup sweepers like Volcarona, Kyurem, and Iron Boulder and phaze them with Whirlwind in return; in addition to this, Whirlwind forces in opposing Pokemon, which will take damage from Ting-Lu's hazards unless they hold Heavy-Duty Boots. Ruination deals meaningful damage to switch-ins like Rillaboom, Great Tusk, and Hatterene, while Stone Edge can be run instead to allow Ting-Lu to OHKO Volcarona and hit Flying-types like Dragonite and Zapdos. Tera Poison is used to help Ting-Lu better check Fairy- and Fighting-types like Enamorus, Zamazenta, and especially Iron Valiant and grant it an immunity to Toxic, while Tera Ghost can be run instead to nullify Ting-Lu's Fighting-type weakness and allow it to spinblock Great Tusk and Iron Treads, though this comes at the cost of being weak to Ghost-types like Gholdengo and Choice Specs Dragapult as well as Dark-types like Darkrai, Kingambit, and Roaring Moon that Ting-Lu would otherwise check.</p> <p>Ting-Lu fits well as a support option on nearly any balance team. Offensive partners like Dragapult, Gouging Fire, and Kyurem appreciate entry hazard support to make foes easier to KO, while physically defensive partners like Dondozo and Skarmory benefit from Ting-Lu's ability to handle special attackers like Gholdengo and Raging Bolt. Skarmory is particularly notable for forming a strong defensive hazard-stacking core with Ting-Lu, being able to switch into Pokemon like Meowscarada and Weavile that threaten it. Aside from being potent late-game cleaners that appreciate Ting-Lu spreading chip damage early-game, offensive partners like Weavile and Meowscarada pair well, since they're able to remove Heavy-Duty Boots from opposing Pokemon with Knock Off to make Ting-Lu's hazard stacking more effective as well as pressure Gliscor, which Ting-Lu struggles significantly against. Galarian Slowking and Gholdengo are both great defensive partners for Ting-Lu to handle Fairy-types like Hatterene and Iron Valiant, with the former able to provide additional pressure with Future Sight and the latter also able to block hazard removal.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "TPP", "user_id": 260369}, {"username": "royalfluxh", "user_id": 493260}]}, {"name": "Grammar checked by", "members": [{"username": "StupidFlandrs48", "user_id": 633500}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Roaring Moon": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Dragon Dance Roaring Moon is one of the tier's most dangerous sweepers due to its fantastic Attack and Speed complemented further by its decent bulk, a great typing both offensively and defensively, and diverse coverage options that dramatically limit its defensive counterplay. Acrobatics, thanks to its perfect synergy with Booster Energy, boasts excellent coverage alongside Knock Off by giving Roaring Moon an incredibly powerful option to super effectively hit threats like Great Tusk as well as Ogerpon-W, Serperior, and Rillaboom without the need to Dragon Dance; between it and Knock Off, Roaring Moon hits much of the tier for at least neutral damage, which is often enough for it to clean up late-game. Earthquake OHKOes threats that can survive a boosted Knock Off or Acrobatics, such as offensive Kingambit, Raging Bolt, Gouging Fire, and Iron Treads. Stone Edge strongly hits threats like Kyurem, Pelipper, and opposing Tera Flying Roaring Moon super effectively, KOes Volcarona without risking Flame Body activating, and maintains the OHKO against Gouging Fire and Cinderace without a Dragon Dance boost. Taunt drastically improves Roaring Moon's matchup against defensive teams by preventing threats like Dondozo, Ting-Lu, Tera Fairy Skeledirge, and Skarmory from disrupting its sweep with their recovery, status, or setup moves; Taunt is still useful against more offensive teams by virtue of preventing Serperior from stopping Roaring Moon's sweep with Glare, denying Glimmora multiple layers of entry hazards, or preventing setup sweepers like Tera Fairy Gouging Fire and Kyurem from surviving a hit and setting up against it. Brick Break is an interesting alternative; it outright OHKOes Weavile and defensive Kingambit, hits Darkrai and opposing Roaring Moon super effectively, and greatly improves Roaring Moon's matchup against opposing dual screens or Aurora Veil teams. Tera Flying grants Roaring Moon some noteworthy defensive benefits, including turning its Fighting weakness into a resistance and granting it a Ground immunity, but its greatest benefit is giving Roaring Moon access to the absurd power of STAB Acrobatics; with the boost from Tera Flying, Roaring Moon can OHKO max HP Great Tusk without even needing a boost from Dragon Dance while having a chance to OHKO Zamazenta after a Dragon Dance. A Jolly nature is preferred to outpace Booster Energy Iron Valiant after a Dragon Dance, but the power increase from an Adamant nature is enough to OHKO bulky Kingambit and Assault Vest Archaludon with Earthquake without any chip damage while securing more reliable KOs against Zamazenta and bulkier Great Tusk variants.</p> <p>Roaring Moon is a staple on fast-paced hyper offense teams that can help facilitate its sweep, though on these teams it can also serve as a wallbreaker to help facilitate other setup sweepers as needed. Hisuian Samurott and Glimmora can reliably set up entry hazards to help Roaring Moon secure OHKOs against bulky Kingambit and Archaludon without needing to commit to an Adamant nature, while dual screens setters like Deoxys-S, Alolan Ninetales, and Grimmsnarl can allow Roaring Moon to set up more safely, grant it a safety net against strong priority from the likes of Weavile and Tera Normal Dragonite, or even allow Roaring Moon to set up multiple Dragon Dances and devastate opposing offensive teams. Deoxys-S is a particularly excellent teammate for Roaring Moon; it can act as a fast dual screens setter, an entry hazard setter that can deny opposing hazards while bypassing Hatterene's Magic Bounce with Skill Swap, or a standalone offensive threat that can help overwhelm threats like Dondozo, Skarmory, and Tera Fairy Skeledirge with its excellent coverage while allowing Roaring Moon to maximize its own coverage instead of running Taunt. Fast Booster Energy users like Iron Valiant and Iron Boulder synergize well with Roaring Moon; Roaring Moon can serve as more of a wallbreaker alongside these threats, using its high immediate damage output and Knock Off to wear down or eliminate threats like Gholdengo, Clodsire, Dondozo, and Corviknight to enable their late-game sweeps. Volcarona is also an excellent teammate, as it handles Steel-types like Corviknight and Skarmory that Roaring Moon may struggle with and appreciates Roaring Moon's ability to brute force past walls like Clodsire, Blissey, specially defensive Skeledirge, Ting-Lu, and Galarian Slowking in return, particularly if it is running Taunt. Even other Dragon Dance users, such as Gouging Fire, Kyurem, and Dragonite, can help overwhelm physical walls that Roaring Moon may struggle with while utilizing their alternate defensive profiles to cover Roaring Moon's shortcomings. Gouging Fire's burn immunity makes it useful against Volcarona, Skeledirge, and Will-O-Wisp Rotom-W, while its excellent physical bulk makes it very difficult to revenge kill with priority moves from Dragonite and Weavile; Kyurem fits well on Aurora Veil teams alongside Roaring Moon thanks to its tremendous physical bulk while snow is active, and Dragonite's Extreme Speed acts as a strong priority attack to deal with opposing priority users like Weavile and Raging Bolt, which can revenge kill Roaring Moon with Ice Shard and Thunderclap, respectively. Kingambit greatly appreciates Roaring Moon's ability to pressure Fire-types like Cinderace and Volcarona, and in return its great bulk and typing can allow it to handle threats like Weavile and Meowscarada lacking Low Kick. Lastly, Roaring Moon can fit reasonably well on Psychic Terrain teams spearheaded by Indeedee; Psychic Terrain keeps Roaring Moon safe from opposing priority attacks until it activates Tera Flying, and such a playstyle helps facilitate offensive threats that Roaring Moon already synergizes well with such as Volcarona, Iron Boulder, and Expanding Force Deoxys-S.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Roaring Moon is an elite physical wallbreaker on sun teams thanks to its phenomenal Attack and great Speed stats, either of which can be further boosted by its Protosynthesis. Knock Off is extremely spammable and difficult to safely switch into, giving Roaring Moon a strong STAB move that can even support the rest of its team with item removal. Outrage is a brutally strong STAB move that is impossible to switch into without a Fairy-type, easily allowing Roaring Moon to break past physical walls like Gliscor and Dondozo. Iron Head is used to hit Fairy-types such as Clefable and Enamorus for super effective damage; however Earthquake is an alternative to Iron Head that allows Roaring Moon to hit Steel-types, particularly Archaludon and Kingambit for super effective damage. U-turn is pivotal for maintaining momentum, allowing it to safely bring in threats such as Walking Wake onto the field. 220 Attack EVs and maximum Speed investment with a Jolly nature are necessary for Roaring Moon to attain a boost to its Speed via Protosynthesis, allowing it to always outspeed Dragapult, Iron Valiant, and Choice Scarf Enamorus. Alternatively, simply running maximum Attack and Speed EVs gives Roaring Moon an Attack boost through its Protosynthesis, letting it 2HKO Skarmory with Knock Off and Dondozo with Outrage, alongside always netting an OHKO on Kingambit with Earthquake. Tera Dark is the premier Tera type for this set, as it powers up Knock Off to unprecedented levels of power, inflicting heavy damage on Gliscor, Skarmory, and even Clefable, whereas Tera Steel can be used to gain STAB on Iron Head and to withstand Dragon- and Fairy-type attacks.</p> <p>This set functions best on sun teams, leveraging Torkoal to set the sun for Roaring Moon to take advantage of, with the former also checking Bug-, Ice-, and Fairy-types for the latter. Roaring Moon is vulnerable to repeated chip damage from entry hazards, which can wear it down very quickly if left unchecked. Hatterene and Great Tusk are much appreciated forms of hazard control that can also check some of the threats Roaring Moon struggles against, with Hatterene forcing out Dragon- and Fighting-types, namely Dragonite, Iron Valiant, and Zamazenta, and Great Tusk being able to force out Kingambit while generally acting as a reliable physical tank. Venusaur and Kingambit also pair very well with Roaring Moon on sun, with Venusaur forcing Primarina and Great Tusk out alongside Kingambit's reliability in taking on Meowscarada and Swords Dance Weavile. In return, Roaring Moon is able to soften up the opposing team for Venusaur and Kingambit to clean up in the late-game. Walking Wake and Raging Bolt can form an incredibly potent wallbreaking core with Roaring Moon, as both appreciate its Knock Off crippling their checks, and Raging Bolt can form a potent pivoting core with Roaring Moon that can easily take advantage of forced switch-ins. Gouging Fire also appreciates checks such as Gliscor and Dondozo being worn down, giving it an easier time sweeping teams in mid- or late-game scenarios.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Dreadfury", "user_id": 408271}, {"username": "viivian", "user_id": 584916}], "teams": [{"name": "Quality checked by", "members": [{"username": "Morkal", "user_id": 367494}, {"username": "Dreadfury", "user_id": 408271}, {"username": "autumn", "user_id": 384270}, {"username": "Sp0oN1oRd", "user_id": 513254}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Iron Valiant": {"sets": {"Calm Mind": {}, "Swords Dance": {}, "Choice Specs": {}, "Mixed": {}, "Choice Scarf": {}}},
  "Walking Wake": {"sets": {"Choice Specs": {}}},
  "Sinistcha": {"sets": {"Calm Mind": {}}},
  "Ogerpon": {"outdated": true, "sets": {"Swords Dance": {}, "Choice Band": {}}},
  "Ogerpon-Wellspring": {"outdated": true, "sets": {"Swords Dance": {}, "Offensive Pivot": {}}},
  "Ogerpon-Cornerstone": {"outdated": true, "sets": {"Swords Dance": {}, "Utility": {}}},
  "Archaludon": {"sets": {"Assault Vest": {}, "Utility": {}}},
  "Hydrapple": {"sets": {"Assault Vest": {}, "Nasty Plot": {}}},
  "Gouging Fire": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Gouging Fire is a very powerful Dragon Dance sweeper with solid longevity thanks to its bulk and access to reliable recovery. Flare Blitz is a strong STAB move with reliable power; however, Heat Crash can be used instead to avoid recoil damage, though its variable Base Power can sometimes backfire against heavier targets like Great Tusk. Earthquake can be used to hit Fire-resistant targets like Raging Bolt and offer overall solid neutral coverage. For the last slot, Morning Sun grants Gouging Fire longevity, while Dragon Claw hits Dragapult and Roaring Moon hard. Outrage is also an option for more power against Fire-resistant targets such as Toxapex and Dondozo, but the fact that it locks the user into using it and leaves Gouging Fire vulnerable to Fairy- and Steel-types makes it less than ideal. Scale Shot, in conjunction with Loaded Dice, also has more power than Dragon Claw and lets Gouging Fire snowball further by boosting its Speed, but it leaves Gouging Fire vulnerable to entry hazards and doesn't boost its overall damage output unlike Booster Energy. An Adamant nature maximizes Gouging Fire's damage output, but a Jolly nature can be used to outrun the likes of Booster Energy Iron Boulder and Choice Scarf Meowscarada at +2 while avoiding the Speed tie with Dragapult and outrunning Choice Scarf Gholdengo at +1. Heavy-Duty Boots patches up Gouging Fire's crippling hazard weakness, while Booster Energy can also be used to further bolster Gouging Fire's damage output, letting it 2HKO non-defensive Great Tusk with Flare Blitz. Tera Fairy is an overall solid defensive typing that lets Gouging Fire resist Sucker Punch from Kingambit and Dragon-type moves from the likes of Raging Bolt and Kyurem.  Tera Ground boosts Earthquake's damage output while giving Gouging Fire an immunity to Thunder Wave. Finally, Tera Flying is also an option, as it gives Gouging Fire an immunity to Ground-type moves, letting it dent Excadrill and Great Tusk more easily.</p> <p>Gouging Fire's potential as a powerful Dragon Dance sweeper means that it makes its home on offensive teams. Booster Energy sets have a glaring weakness to entry hazards, so they appreciate removal from Great Tusk as well as hazard deterrents such as Magic Bounce Hatterene and Taunt Deoxys-S. Deoxys-S is also able to set up Spikes and/or dual screens, giving Gouging Fire an easier time sweeping. Additionally, Gouging Fire makes an excellent addition to sun teams. On such teams, it appreciates wallbreakers like Venusaur, Raging Bolt, and Walking Wake that can muscle through its checks and break through physical walls that Gouging Fire struggles with such as Dondozo and Skeledirge. On non-sun teams, Pokemon that can break through the aforementioned walls, such as Darkrai and Enamorus, are appreciated, as are Pokemon that can lure physical walls in before denting them, such as Grass Knot Landorus-T. Gouging Fire can chip away at bulkier Pokemon such as Gliscor and defensive Landorus-T early-game, so Pokemon that share checks with it, such as Kingambit and offensive Great Tusk, appreciate it as a partner.</p>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"username": "Bice", "user_id": 236507}], "teams": [{"name": "Quality checked by", "members": [{"username": "kd458", "user_id": 633798}, {"username": "autumn", "user_id": 384270}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Raging Bolt": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Raging Bolt is one of OU's fiercest offensive OU threats thanks to good bulk, a great Special Attack stat, and fantastic priority in Thunderclap allowing it to act both as a wallbreaker and sweeper while additionally threatening potent revenge killers. Raging Bolt threatens common metagame walls such as Skarmory, Dondozo, and Toxapex with its Electric-type STAB. Calm Mind allows Raging Bolt to gain a boost against walls like Heatran and Ting-Lu while also avoiding being OHKOed from threats like Kyurem, Iron Valiant, and Enamorus. Thunderclap lets Raging Bolt threaten Pokemon like Hisuian Samurott, Enamorus, and Iron Valiant. Dragon Pulse is preferred due to its higher PP and lack of a drawback, although Draco Meteor can be used for immediate breaking power and the ability to OHKO neutral threats such as Zamazenta and Rillaboom. Weather Ball can be used over Thunderbolt if Raging Bolt is used on a weather team, but it has to forgo reliable Electric-type STAB move. In rain, Weather Ball allows Raging Bolt to threaten Ground-types like Gliscor and Great Tusk, while under sun, Raging Bolt can hit Fire-types that resist its Dragon-type STAB move. The given EV spread is used to live Speed-boosting Great Tusk's Headlong Rush, as well as outspeeding Gliscor. Leftovers is preferred for longevity, but Booster Energy in conjunction with Protosynthesis can be used to threaten unboosted Gouging Fire and Dragonite. Tera Fairy is recommended to flip matchups on Dragon-type threats such as the aforementioned Gouging Fire and Dragonite, as well as Walking Wake and Dragapult, by evading their super effective Dragon-type attacks. Tera Flying is the final option, providing Raging Bolt an immunity to Ground-type attacks from Excadrill, Gliscor, and Ting-Lu.</p> <p>Raging Bolt fits well on rain, sun, hyper and bulky offense teams due to hits good bulk and Special Attack, so weather setters such as Torkoal and Pelipper are ideal. Raging Bolt is also a good partner for physical wallbreakers like Iron Boulder and Gouging Fire, as they both enjoy Raging Bolt's ability to threaten Dondozo, while Rillaboom and Meowscarada appreciate Raging Bolt's ability to threaten Skarmory and Corviknight. Raging Bolt is threatened by faster Ground-types like Excadrill, Landorus-T, and Great Tusk due to being unable to hit them with Thunderclap. Therefore, Rillaboom is a great teammate, as it provides another form of speed control in Grassy Glide as well as Grassy Terrain recovery, which also halves the damage of Earthquake. On weather teams however, there are a multitude of ways to deal with the aforementioned Ground-types. On sun teams, Torkoal and Walking Wake are beneficial, while on rain teams, Barraskweda and Pelipper are good teammates. Walking Wake, Barraskewda, and Pelipper deal with Ground-types, while Torkoal helps Raging Bolt activate Protosynthesis. Raging Bolt also has a poor Speed tier, so speed control options such as Darkrai, Iron Valiant, and Weavile are good teammates, threatening Raging Bolt's common Dragon-type checks like Dragapult and Kyurem. Raging Bolt also fears entry hazards, as they can break down its defensive profile, especially if it forgoes Leftovers. Therefore, hazard control from Pokemon such as Great Tusk, Hatterene, and Corviknight is appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Morkal", "user_id": 367494}, {"username": "SetsuSetsuna", "user_id": 548068}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Iron Boulder": {"sets": {"Swords Dance": {}}},
  "Iron Crown": {"sets": {"Double Dance": {}, "Psychic Terrain Sweeper": {}}},
  "Pecharunt": {"sets": {"Nasty Plot": {}, "Pivot": {}}}
}