{
  "Beedrill-Mega": {"sets": {"Choice Band": {}}},
  "Pikachu": {
    "sets": {
      "Imposter": {
        "description": "<p>Thanks to Light Ball, Pikachu is a niche Imposter user that can break past less-sturdy Imposter-proofers, although it forgoes defensive utility in exchange. When Pikachu transforms, only the ability, item, and HP EVs listed here matter. The listed moves, non-HP EVs, and nature will very rarely see use: since Pikachu outspeeds all other Imposter users like Chansey, it is extremely rare that Pikachu is not transformed. Nevertheless, Volt Switch provides a reasonably strong pivoting option against opposing transformed Imposter users, which cause Pikachu's Imposter to fail, while Glare can paralyze threats to aid Pikachu later on. Healing Wish and Spikes both provide some utility if Pikachu is no longer needed. Since Pikachu is extremely frail, it can easily fall to any strong move from opposing threats it wants to transform into. Therefore, significant team support is needed to realize its potential. Paralysis spam through Nuzzle and Glare ensures Pikachu always outspeeds opposing threats like Mega Mewtwo X, and it can also generate free turns. Knock Off invalidates Pikachu, so Knock Off absorbers, such as Arceus with a held Plate are recommended. Bulky special walls like Ice Scales Arceus-Ground and Ho-Oh check Mega Diancie and Arceus-Ghost, which Pikachu cannot safely transform into: the former can OHKO with Extreme Speed, and the latter Imposter-proofs itself.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Chansey": {
    "sets": {
      "Imposter": {
        "description": "<p>With Imposter, Chansey transforms into a version of the opposing Pokemon with bulk that is far greater and can be further bolstered by Eviolite. This provides a myriad of benefits, including blanket checking most Pokemon, scouting sets, and PP stalling less threatening foes. These traits make Imposter Chansey a valuable addition to almost every team. The given moves offer the most utility in the rare situations Chansey is not transformed, allowing it to Imposter-proof certain special attackers and act as a cleric. While Eviolite is usually the best item, Covert Cloak is useful against Spirit Shackle and Salt Cure users, and Spooky Plate allows Chansey to threaten Arceus-Ghost and Lunala that would otherwise defeat it with Judgment. Offensive threats such as Ultra Necrozma appreciate the information Imposter Chansey provides through scouting; physical attackers in particular highly appreciate moves like Burning Bulwark being discovered. Special attackers enjoy Imposter Chansey taking advantage of RegenVest users and potentially Imposter-proofing them. Imposter Chansey appreciates slow pivoting from Pokemon like Celesteela and Mega Steelix so it can safely scout. Specially defensive Pokemon like Ice Scales Arceus formes and Magic Guard Blissey can serve as checks to opposing Take Heart Arceus formes, which can beat Imposter Chansey one-on-one, while also checking Dragon-type attackers like Eternatus and Miraidon that can hit it hard.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Steelix-Mega": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Mega Steelix is a reliable soft-check to the vast majority of the tier thanks to its massive mixed bulk and great typing. It's also slower than almost everything, making it a valuable slow pivot. Gigaton Hammer deals surprising damage, scaring out dangerous foes like Mega Diancie and entry hazard removers like Arceus-Fairy. Knock Off dissuades Imposter users from switching in and removing Covert Cloak and Heavy-Duty Boots helps it rack up passive damage. Stone Axe helps support offensive allies by setting Stealth Rock and also chunking Ho-Oh for major damage, while Mortal Spin allows Mega Steelix to remove hazards in a pinch and offers similar chip damage potential. While Mega Steelix's mixed bulk is good, it relies heavily on Assault Vest to check things and is often unable to wall anything long-term; as such, teammates like defensive Arceus formes are recommended to help check foes like Mega Diancie and Palkia-O. A major issue with Mega Steelix is Imposter, as its move selection is very annoying to Imposter-proof, and in slower games where Eviolite is less necessary, Imposter users can use it as a relatively safe source of Regenerator recovery. Fur Coat Arceus-Poison is the most effective all-around Imposter-proof, but Jungle Healing users and Steel-types like Celesteela can also work.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Blissey": {
    "sets": {
      "Magic Guard": {
        "description": "<p>With naturally high Special Defense and HP along with a decent neutral typing against most attacks, Blissey is an effective special wall capable of checking various special threats like Eternatus and Miraidon. Magic Guard also gives Blissey an immunity to residual damage from sources such as Salt Cure and Thunder Cage, with the protection from the latter and its low Attack limiting healing from Strength Sap letting it check most Take Heart Arceus formes. Ruination is a way to make near-guaranteed progress barring a miss, and its consistent damage mitigates Blissey's otherwise-crippling passivity. Topsy-Turvy deters setup attempts from Take Heart and Nasty Plot users by inverting their boosts and likely forcing a switch, in which case Blissey can then pivot out with Teleport or Parting Shot. Blissey's ability to deny Strength Sap healing makes it a great pick on balance teams carrying physical attackers such as Mega Lucario, as Fur Coat walls with Strength Sap usually can't get past Blissey, and physical attackers can force Imposter users out if they switch in while Blissey is pivoting. Blissey's immense frailty means that reliable physical walls, such as Mega Slowbro, are mandatory to cover for it; Arceus-Ghost can also bypass Blissey with either Secret Sword or Triple Arrows, so Yveltal makes for a good teammate. Imposter-proof Blissey with any Regenerator user.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "rightclicker", "user_id": 589755}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Ho-Oh": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Magic Guard Ho-Oh is a strong, resilient wallbreaker that can also provide valuable support through entry hazard removal. Flare Blitz and Brave Bird are reliable STAB moves that deal great damage against the majority of the tier. Magic Guard negates recoil from these moves in addition to various forms of passive damage, such as Stealth Rock and poison. V-create is an option that allows Ho-Oh to have more immediate power over Flare Blitz, notably 2HKOing non-Fur Coat neutral Arceus formes, at the cost of lowering Ho-Oh's defenses and Speed after use. Also, V-create only has 8 PP compared to Flare Blitz's 24, which can cause issues in longer games. Fire Lash is another alternative that allows Ho-Oh to pressure passive walls like Dondozo more easily though consecutive Defense drops, eventually forcing these foes out. Tidy Up and Mortal Spin both serve as hazard removal, and each come with their own advantages. Tidy Up allows Ho-Oh to set up and potentially sweep, and it also somewhat mitigates the stat drops from V-create if it is used. Meanwhile, Mortal Spin applies more pressure to opposing walls, with poison helping to wear them down over the course of a game. Alternatively, Head Smash can be used to nearly OHKO Imposter users that lack Eviolite; otherwise, Ho-Oh risks being walled by its Imposter. Furthermore, Head Smash is Ho-Oh's best move to hit Mega Diancie, cleanly 2HKOing it. Strength Sap pairs well with Magic Guard to give Ho-Oh incredible longevity, ensuring that it can serve as a long-term check to opposing Fire- and Fairy-Types like Arceus-Fire, Arceus-Fairy, and Choice Specs Mega Diancie locked into Boomburst. Ho-Oh can struggle to defeat bulky Dragon- and Water-types such as Fur Coat Miraidon and Dondozo, so offensive teammates such as Mega Diancie and Kartana are appreciated. Ho-Oh also enjoys entry hazard and Knock Off support to push checks into 2HKO range, as well as allowing Head Smash variants to defeat Imposter users more easily. Ho-Oh can be Imposter-proofed by the aforementioned Fur Coat Miraidon and Dondozo, as well as by Fur Coat Arceus formes, although they should all ideally have some move to punish the Imposter user from simply staying in and setting up.</p>"
      },
      "Ice Scales": {
        "description": "<p>Ice Scales Ho-Oh serves as an effective specially defensive wall capable of checking dangerous threats such as No Retreat Arceus-Ghost and Mega Gardevoir. V-create's high Base Power coming from Ho-Oh's respectable Attack helps reduce Ho-Oh's passivity and forces switches, while Lava Plume provides a high-PP alternative that can cripple Pokemon like Mega Mewtwo X with burns. Haze clears stat boosts from setup sweepers like No Retreat users and Arceus formes. Ho-Oh serves as a good user of Mortal Spin with its STAB moves threatening out Steel-types. Glare cripples Magic Guard Mega Mewtwo X on V-create sets. Knock Off removes important items like Covert Cloak and Eviolite from switch-ins like Miraidon and Imposter users, respectively. Teleport is an option to generate momentum and allow Ho-Oh to safely bring in allies against threats it cannot take on, such as certain Take Heart Arceus formes. Ho-Oh is threatened by certain special attackers such as Mega Diancie with a Rock-type move, Palkia-O, and Primal Kyogre; as a result, teammates such as Arceus-Poison and RegenVest Primal Kyogre make good partners. Ho-Oh also can have trouble against bulky setup Pokemon such as Miraidon and Take Heart Arceus formes, making Pokemon like Dialga-O, Salt Cure users, and Covert Cloak Imposter users good teammates. Fur Coat Dialga-O, Arceus-Poison, and Arceus-Ghost help check physical wallbreakers that break past Ho-Oh and can also absorb Knock Off, which is useful considering that Ho-Oh ceases functioning as a wall without its item. Ho-Oh can be Imposter-proofed by Pokemon like Fur Coat + Take Heart Arceus-Poison and Arceus-Ghost, though a Fire-immune Steel-type like Primordial Sea Registeel can be used to block the Imposter user's Mortal Spin.</p>"
      },
      "Desolate Land": {}
    },
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}, {"username": "LTG", "user_id": 473639}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "Rose", "user_id": 511181}]}]}
  },
  "Blaziken-Mega": {"sets": {"Desolate Land": {}, "Tinted Lens": {}}},
  "Swampert-Mega": {
    "sets": {
      "RegenVest": {
        "description": "<p>Mega Swampert is a premier special wall thanks to its great typing and decent bulk. It has a good matchup against common special attackers like Miraidon, Eternatus, and Blacephalon. Knock Off is a useful utility move, removing items like Imposter Chansey's Eviolite, Miraidon's Covert Cloak, and Primal Kyogre's Assault Vest. Stone Axe can be used to set up Stealth Rock, and threaten physically frail Pokemon like Mega Beedrill and Blacephalon, while Mortal Spin can be used for entry hazard removal, and in conjunction with Knock Off, poison walls that would otherwise be immune thanks to Covert Cloak, like Miraidon and Ice Scales Primal Kyogre. Mega Swampert is a particularly good user of this Mortal Spin thanks to hitting Steel-types like Mega Steelix and Dialga-O with its Ground-type STAB move. Mega Swampert is mainly used as a special wall and slow pivot, making teammates such as Mega Mewtwo X and Mega Diancie suitable partners. Despite its good special bulk being further boosted by Assault Vest, its physical bulk is middling at best, meaning common mixed attackers like Mega Mewtwo X and Deoxys-A largely don't have trouble with it. Therefore, Fur Coat Miraidon and Ice Scales Arceus-Fairy are nice defensive options. Since Mega Swampert's Mortal Spin + Ground-type STAB move threatens most Pokemon, a Take Heart Arceus forme with a held Plate is the easiest Imposter-proofing option.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Gardevoir-Mega": {
    "sets": {
      "Pixilate": {
        "description": "<p>Pixilate Mega Gardevoir distinguishes itself from Mega Diancie through its higher damage output and STAB-boosted Psystrike, allowing it to heavily pressure Poison-types and RegenVest Primal Kyogre. Volt Switch eases prediction and helps chip targets like Primal Kyogre and Ho-Oh into 2HKO range from Boomburst. Armor Cannon provides the strongest general coverage against Steel-types like Mega Steelix, while Steam Eruption hits Ho-Oh for super effective damage while also dealing respectable damage against Primordial Sea Steel-types. Mega Gardevoir is capable of applying pressure onto common specially defensive walls such as Ice Scales Arceus formes, but it can need help taking down walls like Ice Scales Ho-Oh. Thus, partners like Eternatus and Palkia-O are helpful to assist in pressuring opposing Ice Scales users, while they appreciate Mega Gardevoir helping deal with RegenVest Primal Kyogre. Mega Gardevoir also appreciates paralysis support, such as from RegenVest Nuzzle users like Celesteela, to help with its middling Speed. Depending on coverage, Mega Gardevoir can be Imposter-proofed by teammates such as Victini, Ferrothorn, and Ice Scales Arceus formes.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Kyogre": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Primal Kyogre is a useful special wall, pivot, and utility Pokemon, notably checking foes like Flutter Mane, Palkia-O, and Eternatus. Flip Turn allows Primal Kyogre to safely scout moves from opposing threats like Choice Specs Flutter Mane and then swap into the appropriate answer, be it an Imposter Pokemon or an Ice Scales user. Scald is typically preferred over Steam Eruption thanks to its higher PP, but some teams may appreciate the extra power of Steam Eruption. Knock Off cripples item-reliant Pokemon like Chansey, RegenVest Dialga, and RegenVest Celesteela along with removing Covert Cloak to let it status Pokemon it otherwise couldn't, such as Mega Audino. Mortal Spin's entry hazard removal and poison-inflicting capabilities make it a good all-around utility choice, especially since Primal Kyogre has an excellent matchup against many of the metagame's Steel-types, like Mega Steelix and Celesteela. Nuzzle can slow down wallbreakers like Eternatus and Choice Specs Flutter Mane, and Stone Axe can help wear down foes for allies. Primal Kyogre's fear of physical wallbreakers like Mega Garchomp, Ash-Greninja, and Ultra Necrozma makes reliable checks to them, like Fur Coat Mega Audino and Ice Scales Arceus-Ground, useful teammates. Special wallbreakers like Flutter Mane, Eternatus, and Miraidon appreciate Knock Off removing items from opposing RegenVest users and Ability Shields from Pokemon like Ice Scales Arceus-Ground. Imposter-proof Primal Kyogre with a Take Heart Arceus forme holding a Plate.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "vesp", "user_id": 610920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Groudon": {
    "outdated": true,
    "sets": {
      "Setup Attacker": {
        "description": "<p>Groudon's base stats and STAB on Precipice Blades make it a premier choice for a bulky attacker. Fur Coat allows Groudon to wall many common threats, such as Koraidon and opposing Groudon, while Mold Breaker ignores Fur Coat and Levitate on walls like Eternatus, Arceus-Ghost, and Zamazenta-C. Victory Dance lets it reliably set up on opposing physical attackers like Groudon and Koraidon, whereas Tidy Up removes entry hazards and makes it harder for Imposter users to safely switch in thanks to the lack of a Defense boost. Toxic heavily cripples Precipice Blades switch-ins like Arceus formes and Dondozo, and it works especially well with Mold Breaker, which lets Groudon bait and punish Prankster users. Alternatively, Knock Off removes Heavy-Duty Boots, Leftovers, and Ability Shield from bulkier targets like Dondozo, Eternatus, and opposing Groudon. Earth Plate boosts Precipice Blades's damage, whereas Heavy-Duty Boots leaves Groudon less susceptible to chip damage from Spikes, and Rocky Helmet provides extra security against Population Bomb users like Ursaluna. Groudon's best fit is on balance and offense teams that want to compress a bulky attacker, non-passive wall, and possibly an entry hazard remover into a single teamslot. Teammates like Dondozo and Eternatus are recommended to shore up Groudon's weakness to Palafin-H, with the latter also helping out against Solar Beam Arceus-Fire. Use Corviknight to Imposter-proof Toxic and Mold Breaker Groudon variants, and a Fur Coat user that doesn't mind Knock Off for other variants.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Rayquaza": {
    "sets": {
      "Aerilate": {
        "description": "<p>Rayquaza is a dangerous mixed attacker with very few consistent long-term answers. Tera Flying Boomburst deals absurd damage, OHKOing everything that isn't a special wall or Flying-resistant target and 2HKOing many resistant foes like Corviknight and Dialga-O, provided the latter's Assault Vest has been removed. Extreme Speed helps chase out opposing offensive threats like Flutter Mane and Koraidon; Tera Flying Extreme Speed also 2HKOes Arceus and Zacian. Both coverage moves nuke Steel-types; Collision Course beats Chansey and is easier to Imposter-proof, while Headlong Rush beats Arceus-Electric and Zacian-C and makes offensive Imposter-proofing easier thanks to lowered defenses. Strength Sap helps offset Life Orb recoil and takes advantage of the switches Rayquaza forces, while Jungle Healing allows it to completely nullify Toxic Groudon at the cost of lower healing per use. Rash is used to maximize damage output, while Naive allows Rayquaza to outrun Jolly Groudon and most opposing Rayquaza. Rayquaza offers basically no defensive utility and hates taking status or Knock Off, meaning slow pivoting support from Dondozo and RegenVest users like Dialga-O is mandatory. Entry hazard setters like Zacian and RegenVest users are recommended, as hazards help remove Rayquaza's need to predict and allow it to safely spam Boomburst. Imposter-proof Rayquaza with Ice Scales Arceus formes, Soundproof users, or Zacian-C.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Garchomp-Mega": {
    "sets": {
      "Setup Sweeper": {
        "description": "<p>Mega Garchomp is an incredibly powerful wallbreaker and sweeper with favorable matchups against common physical walls like Miraidon and Arceus-Poison. Shift Gear and Tidy Up increase its offensive power and help offset Mega Garchomp's poor Speed, allowing it to outspeed common physical walls; the former ensures Mega Garchomp outspeeds Deoxys-A, while the latter provides role compression by removing entry hazards. Jungle Healing helps offset accumulated chip damage and Life Orb recoil while also removing crippling status conditions like burn and poison. This allows Mega Garchomp to much more freely switch into Mortal Spin users like Arceus-Poison and Miraidon not running a Dragon-type attack. Life Orb, Adaptability, and an Adamant nature provide a crucial power boost, letting unboosted Mega Garchomp OHKO Mega Steelix and 2HKO Fur Coat Arceus-Poison. If desired, Defense EVs can be lowered to allow Mega Garchomp to always OHKO Eviolite Imposter Chansey with +1 Glaive Rush. Mega Garchomp pairs well with other physical wallbreakers like Choice Band Mega Mewtwo X to heavily pressure Fur Coat users like Yveltal and Arceus-Ghost; in return they appreciate Mega Garchomp handling Arceus-Poison and Miraidon. Teammates, such as Magic Bounce Mega Audino, can limit Strength Sap recovery from opposing physical walls like Fur Coat Arceus-Ghost and Yveltal, allowing Mega Garchomp to eventually break through them. Mega Garchomp can be Imposter-proofed by Fur Coat users like Arceus-Fairy and Arceus-Ghost.</p>"
      },
      "Choice Band": {
        "description": "<p>Thanks to an excellent offensive typing and Attack, Mega Garchomp is an incredibly strong wallbreaker that, thanks to its Ground typing, resists Stealth Rock and can naturally destroy foes that competitors like Kyurem-B can't. Adaptability, which Mega Garchomp can afford to run thanks to its Ground STAB, gives a strong power boost that Imposter users aren't immune to, while Mold Breaker ignores Fur Coat on targets like Arceus-Ghost; Sword of Ruin fares worse into Imposter users than Adaptability, but it boosts Glacial Lance’s and Gigaton Hammer's damage. Gigaton Hammer hits Pokemon like Arceus-Fairy and Mega Audino, making them shaky switch-ins, while Glacial Lance can be used on Mold Breaker sets to OHKO Yveltal after slight chip damage. Because of its low Speed and lack of longevity, Mega Garchomp appreciates slow pivots like RegenVest Mega Steelix and Primal Kyogre. Mega Garchomp can be Imposter-proofed by the likes of Fur Coat Arceus-Fairy and Yveltal.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}, {"username": "Notagamer", "user_id": 619896}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}, {"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Dialga-Origin": {
    "sets": {
      "Utility": {
        "description": "<p>Dialga-O is a useful defensive presence and pivot. Its typing gives it an excellent matchup into Miraidon, which it can threaten to OHKO with Draco Meteor, and allows it to soft check a large portion of the tier and pivot into an ally with a better matchup. Revelation Dance offers general-purpose damage and can instantly threaten Normalize users, while Doom Desire can set up a KO for an ally like Kartana. Teleport is used to underspeed opposing slow pivots like RegenVest Mega Steelix, Primal Kyogre, and Celesteela, allowing Dialga-O to bring in teammates largely without fear of utility moves like Knock Off and Mortal Spin. Fur Coat allows Dialga-O to switch in on more attackers, notably allowing it to wall Kartana, while Magic Guard makes it more effective into slower teams reliant on passive damage from entry hazards and moves like Salt Cure to gain the advantage. Adamant Crystal can't be removed with Knock Off and provides a useful damage increase, while Covert Cloak allows Fur Coat sets to navigate Salt Cure. Dialga-O's best fit is on balance teams with dangerous attackers that need as many attacking windows as possible to make progress, such as Choice Band users like Kartana. Outside of Kartana, Dialga-O has a pretty poor matchup into common physical attackers like Mega Mewtwo X and Kyurem-B, so it needs extra support from an ally like Imposter Chansey or a second Fur Coat user like Arceus-Ghost, Arceus-Poison, or Arceus-Fairy to help out. An offensive teammate like Steely Spirit Kartana enjoys the presence of Doom Desire to pick up instant KOes on targets like Fur Coat Arceus-Poison. Imposter-proof Dialga-O with something that can deny Strength Sap healing, like Chansey or a Magic Bounce user; these can also opt to use Teleport themselves to underspeed the Imposter user and gain the switch advantage against them.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Palkia-Origin": {
    "outdated": true,
    "sets": {
      "Nasty Plot Sweeper": {
        "description": "<p>Nasty Plot Palkia-O is a terrifying sweeper thanks to its brutally powerful STAB combination and good Speed. A Timid nature guarantees that Palkia-O outspeeds and threatens to OHKO almost all Arceus. Steam Eruption provides more consistent damage output and a potential burn, while Water Spout has potentially higher damage, won't miss, and can OHKO Ice Scales Arceus-Fairy after Nasty Plot and Spikes. Strength Sap is necessary to keep Dragon Energy and Water Spout's damage high as well as to allow Palkia-O greater freedom to switch in. Tera Dragon allows Dragon Energy to OHKO Dondozo and +4 Dragon Energy to OHKO Ice Scales Dialga-O, while Tera Water lets Palkia-O withstand Fairy-type attacks from users like Arceus-Fairy and Zacian. Palkia-O's best fit is on offense teams that can maximize the opportunities it gets and can easily pressure faster threats like Koraidon. Prankster and Ice Scales Chansey are complete counters for Palkia-O, as they are never threatened by its attacks and make Strength Sap worthless; as such, mixed attacking teammates like Enamorus and Triple Arrows Arceus-Ghost are highly recommended. Imposter-proof Palkia-O with a Desolate Land Arceus-Fairy or Ice Scales Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Giratina": {
    "outdated": true,
    "sets": {
      "Prankster": {
        "description": "<p>Prankster + Haze Giratina's huge bulk and recovery and disruption options allow it to function as a reliable answer to setup users. Giratina has a wide array of options it can use to disrupt foes attempting to set up: Glare paralyzes fast attackers such as Palkia-O, Encore keeps them locked into moves such as Nasty Plot, Parting Shot lets Giratina pivot and Destiny Bond trades a KO, and Entrainment helps force out ability-dependent attackers. Heavy-Duty Boots helps Giratina switch in more easily without fear of entry hazard chip, while Covert Cloak helps prevent status from moves like Mortal Spin and Nuzzle. Tera Fairy improves Giratina's matchup into opposing Dragon-types such as Koraidon while maintaining a Fighting-type resistance, whereas Tera Dark grants immunity to status moves from opposing Prankster users and a Ghost- and Dark-type resistance for Flutter Mane and Arceus-Dark. Great partners for Prankster Giratina include RegenVest Ting-Lu, Fur Coat Dondozo, and Imposter users thanks to their strong defensive synergy, which allows Giratina to get in more comfortably against Arceus-Ghost and Koraidon.</p>"
      },
      "Magic Bounce": {
        "description": "<p>Giratina is a great defensive Pokemon that provides utility and disruption with its immunity to Fighting and resistance to powerful attacks like V-create and Rising Voltage. Court Change makes Giratina effective at removing entry hazards against Mold Breaker entry hazard setters and Stone Axe Pokemon. Strength Sap helps with keeping strong physical attackers such as Groudon in check. Whirlwind bypasses Substitute to force out foes, whereas Encore can be used as another form of disruption. Scald is useful for spreading burns, especially against physical attackers such as Groudon and Zamazenta-C. Tera Fairy is great for the immunity to Dragon-type attacks from Koraidon, Eternatus, and Palkia-O, while Tera Dark is great for being resistant to Ghost- and Dark-type attacks from Arceus-Ghost and Hoopa-Unbound. Covert Cloak helps Giratina beat Imposter users and blocks troublesome status from Scald and Mortal Spin. Dondozo and RegenVest Ting-Lu are great partners for Giratina thanks to their physical bulk and complementary typings, which help Giratina against threats such as Eternatus and Arceus-Ghost.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "TTTech", "user_id": 338877}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Arceus-Fairy": {
    "sets": {
      "Ice Scales": {"description": "<p>Ice Scales Arceus-Fairy is a good wall to Pokemon such as Miraidon and Arceus-Ghost. Take Heart boosts Arceus-Fairy's offensive pressure, allowing to it sweep teams after checks like Mega Steelix and Primal Kyogre have been removed; the Special Defense boosts are also useful against boosting foes like Arceus-Ghost and Torch Song users. Thunder Cage traps and eliminates Imposter users, allowing Arceus-Fairy to Imposter-proof itself given it's at high HP. Arceus-Fairy struggles against Pokemon like Mega Garchomp because of Gigaton Hammer, so Fur Coat Pokemon like Mega Slowbro and Yveltal pair well with it. Strength Sap blockers, like Blissey, also pose a major problem by preventing Arceus-Fairy from meaningfully healing; as such, allies like mixed Ultra Necrozma can help pressure them. Arceus-Fairy Imposter-proofs itself thanks to Thunder Cage, but a Haze user like Chansey is recommended as a failsafe.</p>"},
      "Fur Coat": {
        "description": "<p>Fur Coat Arceus-Fairy is a good option that compresses a wall and entry hazard remover into one slot. Tidy Up provides unblockable hazard removal and potentially allows Arceus-Fairy to sweep late-game when walls like Mega Steelix have been removed. Spirit Shackle allows Arceus-Fairy to Imposter-proof itself, as trapping Imposter users almost always means a KOed Imposter and a +6 Arceus-Fairy, and it also hits Fairy-resistant foes slightly harder than Magical Torque. Covert Cloak offers extra security against Magical Torque confusion from Imposter users, while Heavy-Duty Boots makes it more flexible as a hazard remover. Arceus-Fairy struggles against Sunsteel Strike users like Mega Lucario and Mega Garchomp, so checks to these like Miraidon and Ho-Oh are highly recommended. Arceus-Fairy also appreciates allies that can remove Steel-types like Mega Steelix and Celesteela in order to facilitate a late-game sweep. Spirit Shackle Arceus-Fairy Imposter-proofs itself.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "Rose", "user_id": 511181}]}]}
  },
  "Arceus-Fire": {
    "sets": {
      "Utility Desolate Land": {"description": "<p>Fixes Desolate Land Arceus-Fire's main issue, being Imposter users, with Spirit Shackle. Offers additional utility with either entry hazard removal or the ability to easily dispatch Dondozo and Groudon.</p>"},
      "Fur Coat": {
        "outdated": true,
        "description": "<p>Arceus-Fire's great defensive typing and base stats make it a solid Fur Coat wall. Lava Plume's burn heavily cripples common physical attackers like Koraidon and Groudon and forces chip damage on opponents. Heal Bell allows Arceus-Fire to support its teammates by removing status conditions like paralysis, burn, and poison. U-turn allows Arceus-Fire to safely bring in offensive teammates to exploit passive Lava Plume switch-ins, such as Dondozo and Giratina; alternatively, Knock Off allows Arceus-Fire to remove items like Covert Cloak and Heavy-Duty Boots, as well as an Imposter user's Eviolite. Arceus-Fire best fits on balance teams that appreciate a reliable check to V-create users and a bulky pivot. Teammates like Palkia-O and Koraidon appreciate Arceus-Fire's pivoting and ability to bring in and force damage on passive walls. Imposter-proofing can be done with any Pokemon immune to burn, such as a Covert Cloak user. Tera Flying gives Arceus-Fire an immunity to Ground-type attacks from Groudon and Ursaluna, on top of gaining a Spikes immunity.</p>"
      },
      "Desolate Land": {
        "outdated": true,
        "description": "<p>Arceus-Fire's Desolate Land-boosted V-create is a brutally strong attack, letting it force out most Pokemon by threatening an OHKO. Arceus-Fire's niche over other V-create users is its powerful Solar Beam, which removes common physical walls such as Dondozo and Groudon. Growth enables Arceus-Fire to set up on passive walls, whereas Glacial Lance targets Dragon-types such as Eternatus and Giratina. Life Orb increases Arceus-Fire's power to absurd levels, OHKOing Arceus formes that don't resist its moves and 2HKOing most resistant targets with V-create. Heavy-Duty Boots, on the other hand, allows Arceus-Fire to take better advantage of its resistance to common Fairy- and Fire-type attacks. Arceus-Fire has difficulty breaking past Fire-immune foes, most commonly Well-Baked Body Steel-types, so it pairs well with teammates that can handle these targets like Groudon and Headlong Rush Enamorus. Imposter-proofing is done with Well-Baked Body Steel-types or Primordial Sea users. Tera Fire boosts the power of V-create even further, while Tera Grass grants a Ground resistance and a much stronger Solar Beam.</p>"
      }
    }
  },
  "Arceus-Ghost": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Arceus-Ghost serves as both a sturdy physical wall and a potent setup wincon, having the unique ability to blank Knock Off and self-Imposter-proof with Spooky Plate + Judgment. Strength Sap is the preferred recovery option due to its higher healing against physical attackers like Mega Garchomp and ability to neutralize Attack boosts, but Shore Up can't be limited by Pokemon like Magic Guard Blissey. Take Heart and Nasty Plot bolster Arceus-Ghost's average Special Attack; Take Heart allows it to rid itself of sweep-ending poison from Mortal Spin, while Nasty Plot provides bigger boosts and means Shore Up sets can't be stalled by Imposter users. The last slot is dedicated to utility or coverage. Secret Sword nukes Blissey; Knock Off can ease Arceus-Ghost's sweep by removing Assault Vests, Yveltal's Heavy-Duty Boots, and the occasional Spooky Plate from Imposter users; Sludge Wave smashes Mega Audino and helps prevent Ice Scales Arceus-Fairy from PP stalling Arceus-Ghost; and Thunder Cage threatens Yveltal and Ho-Oh in addition to chipping special walls. Mega Garchomp appreciates Arceus-Ghost removing items from Yveltal and Mega Audino or, with certain coverage, straight up removing them; in return, Arceus-Ghost Imposter-proofs Mega Garchomp. Arceus-Ghost can struggle against Ash-Greninja, so a check to it like Fur Coat Mega Audino is a good partner. Arceus-Ghost generally Imposter-proofs itself, but in the event of your opponent having a rare Spooky Plate Imposter user, a teammate that can cover it like Magic Guard Blissey is recommended.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "rightclicker", "user_id": 589755}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Arceus-Ground": {
    "sets": {
      "Ice Scales": {
        "description": "<p>Ice Scales Arceus-Ground fills a valuable niche as a special wall, self-Imposter-proof setup sweeper, and entry hazard remover; its Ground typing also offers a useful immunity to Thunder Cage and Volt Switch. Tidy Up supplements a strong Earthquake and allows Arceus-Ground to sweep late-game when its checks like Celesteela and Yveltal have been removed. Spirit Shackle is solely for Imposter users; after trapping one, Arceus-Ground can always boost to +6 and beat it one-on-one, putting the opponent in a heavily disadvantaged position. Strength Sap is necessary for Arceus-Ground to Imposter-proof itself, and it usually heals for more than Recover; Arceus-Ground being a physical attacker also prevents the bane of most Ice Scales Arceus formes, Magic Guard Blissey, from denying it healing. Earth Plate provides a damage boost to Earthquake and can't be removed with Knock Off or Trick, while Covert Cloak shuts down passive damage from Salt Cure and Mortal Spin, making boosting easier. Arceus-Ground's main drawback is that against teams with Strength Sap, Haze, or Topsy-Turvy Celesteela or Yveltal it's never sweeping; as a result, threats like Bolt Strike Mega Garchomp and Mega Lucario are useful teammates. Arceus-Ground can also struggle against Palkia-O and No Retreat Arceus-Ghost, so backup checks to them like Salt Cure users and Mega Audino help out. Arceus-Ground can almost always Imposter-proof itself thanks to Spirit Shackle, but if it's badly poisoned or if the Imposter user has a Covert Cloak, then some physical tank like Mega Slowbro or Yveltal can fulfil this role.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Arceus-Poison": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Arceus-Poison is a pretty good wall thanks to its typing, which gives it an edge against foes like Kyurem-B and Pheromosa. Earth Plate + Judgment provides a solid way to hit most Steel-types and synergizes well with Mortal Spin, which can remove entry hazards against most teams; alternatively; Thunder Cage can trap and remove Imposter users while also hitting Celesteela. Strength Sap slows down most physical threats, provides an advantage against Imposter users, and offers some leeway against Ground-type coverage like Headlong Rush. Support against Ground-type attackers, like Ho-Oh and Fur Coat Yveltal, is highly recommended. Arceus-Poison also appreciates allied hazard removal, as Celesteela completely shuts Mortal Spin variants down, and Steel-types like Mega Steelix can spinblock if Arceus-Poison doesn't have many boosts. Arceus-Poison Imposter-proofs itself thanks to Earth Plate, although it usually takes a while to win the one-on-one; Jungle Healing Chansey can also deny opposing Imposter user's healing and shake off poison.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Arceus-Water": {
    "outdated": true,
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Arceus-Water is a strong defensive wall thanks to its great typing and bulk. Scald reliably spreads burns, helping spread chip damage and neutralize physical attackers. Knock Off removes items like Covert Cloak and Leftovers, making its burns easier to spread and more damaging, and also boosts Arceus-Water's own survivability by removing Choice Band; alternatively, Spikes can force passive damage on foes, which offensive teammates can exploit. Flip Turn allows Arceus-Water to bring in dangerous offensive teammates against Scald switch-ins like Dondozo and Giratina. Covert Cloak allows Arceus-Water to stop status from moves like Magical Torque, Nuzzle, and Scald, while Leftovers boosts its longevity. Arceus-Water's best fit is on balance teams, which appreciate a reliable physcial wall and a pivot. Offensive teammates, like Koraidon and Flutter Mane, are recommended as they enjoy the safe pivoting Arceus-Water provides and the chip damage it inflicts.  Arceus-Water is best Improofed by itself, as Knock Off sets can threaten Imposter users with item removal and Scald burns.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Audino-Mega": {
    "sets": {
      "Magic Bounce": {
        "description": "<p>Mega Audino's viability lies in using Magic Bounce in tandem with its typing and low Speed tier, allowing it to pivot and reflect Stregth Sap, Glare, and Toxic. Haze can be used against setup users like Miraidon, various Arceus formes, and Simple + No Retreat users like Arceus-Ghost, while Salt Cure can be used to put walls like RegenVest Primal Kyogre and Take Heart users like Miraidon on a timer. Knock Off can be used to remove Covert Cloak and Assault Vest from the likes of Miraidon, Primal Kyogre, and Mega Steelix, while Mortal Spin is used as a form of chip as well as entry hazard control. Mega Audino is a very good slow pivot with Teleport, underspeeding the majority of the metagame's slow pivots. Mega Audino is particularly useful against Strength Sap walls like Miraidon and Yveltal, which Pokemon such as Blacephalon and Mega Garchomp struggle to break through, so they make for good teammates. Despite Mega Audino's defensive utility, it cannot wall most physically offensive threats like Kyurem-B, as it is weak to Gigaton Hammer and has no bulk-boosting ability. Therefore, walls like Miraidon and Arceus-Ghost can protect Mega Audino from the aforementioned threats. Mega Audino Imposter-proofs itself quite well defensively if it isn't running Knock Off, as Salt Cure and Mortal Spin can affect Eviolite Imposter Chansey, while they cannot in return; allies with unremovable items, such as Arceus formes holding Plates, are recommended to Imposter-proof Knock Off sets.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Kyurem-Black": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Kyurem-B is a threatening wallbreaker. Its main advantage over the competition, being Kartana and Mega Garchomp, is its STAB-boosted Glacial Lance, which is more spammable than Gigaton Hammer and Headlong Rush and grants it a natural advantage into Fur Coat users like Yveltal. V-create threatens to OHKO Steel-types like Mega Steelix, which can otherwise scout Kyurem-B's move choice and heal off about half of the damage with Regenerator. U-turn offers dangerous teammates like Mega Mewtwo X a safe window to switch in if Kyurem-B can't secure a KO, and it can be used early-game to scout for potential Fur Coat switch-ins. Kyurem-B fits best on balance teams that can grant it opportunities through pivoting and can make room for counterplay against the few things it can't instantly get past, such as Arceus-Poison. Kyurem-B's lack of recovery and weakness to Rock mean Stone Axe is a major pain, so multiple entry hazard removers like Miraidon, Mega Steelix, and Primal Kyogre are recommended; the latter two also function as slow pivots, which Kyurem-B also appreciates. Fur Coat Arceus formes not weak to Kyurem-B's attacks, such as Arceus-Poison and Arceus-Fairy, also aren't afraid of it when healthy; as a result, it appreciates an ally that can block their Strength Sap, such as a Magic Bounce user like Mega Audino, significantly cutting into their longevity. A faster offensive teammate like Mega Mewtwo X or Deoxys-A is recommended to clean weakened teams, as Kyurem-B's poor Speed inhibits it in this regard. Imposter-proof Kyurem-B with a Fur Coat user not weak to its attacks, like Arceus-Poison or Arceus-Fairy.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Greninja": {
    "sets": {
      "Sniper": {
        "description": "<p>Using its high Speed, synergistic offensive typing, and high offensive stats, Ash-Greninja becomes a strong wallbreaker. With Flower Trick, Ash-Greninja can dent Fur Coat Slowbro without activating Rocky Helmet, OHKO Mega Swampert, and 2HKO Imposter users. Frost Breath lets Ash-Greninja OHKO Mega Garchomp and severely weaken Fur Coat Miraidon and Yveltal. Physically strong Pokemon like Mega Grachomp, Mega Lucario, and Kyurem-B appreciate Ash-Greninja's presence, as it's able to help overwhelm their checks such as Fur Coat Arceus-Ghost, Ho-Oh, and Mega Slowbro; Mega Lucario is particularly useful thanks to its strong matchup against Fur Coat Fairy-types like Mega Audino, which otherwise completely wall Ash-Greninja thanks to Rocky Helmet. Ash-Greninja can struggle against faster Pokemon such as Flutter Mane and Miraidon, as these are are all able to revenge kill it, so having teammates like Mega Steelix, Ho-Oh, and Arceus-Ground helps. Ash-Greninja also benefits immensely from having teammates that can block Strength Sap such as Mega Audino, Blissey, and Mega Slowbro, as many of its defensive checks like Miraidon and Arceus-Fairy rely on this move for healing. Having slow pivots, such as Teleport users like Mega Audino or RegenVest users like Mega Swampert, is also helpful to account for its frailty. To Imposter-proof Ash-Greninja's, a Fur Coat + Rocky Helmet user like Mega Audino is ideal.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hiusi guy", "user_id": 603640}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Yveltal": {
    "sets": {
      "RegenVest": {},
      "Fur Coat": {
        "description": "<p>Fur Coat Yveltal is an effective wall capable of checking threatening physical and mixed wallbreakers like Mega Garchomp, Magic Guard Mega Mewtwo X, and No Retreat Ghost-types. Knock Off is a reasonably strong STAB attack and provides useful utility, while Revelation Dance hits Arceus-Ghost harder and allows Yveltal to check Normalize users. Haze and Parting Shot are useful against No Retreat Arceus-Ghost, with Parting Shot also providing pivoting but matching up worse against Nasty Plot Arceus-Ghost. Calm Mind is an option in tandem with Revelation Dance to also check Arceus-Ghost effectively, although all Fairy-types must be removed before attempting to sweep with it. Yveltal's powerful Dark-type STAB moves deter Ghost-types, making it an effective user of Rapid Spin. If entry hazard removal is not needed, Will-O-Wisp and Nuzzle act as options for neutering threats like Mega Mewtwo X. Ability Shield is an alternative to Heavy-Duty Boots to offer a much better matchup against Teravolt Kartana and Mega Mewtwo X, but Yveltal then requires strong hazard removal and still falls prey to Sword of Ruin variants. Yveltal is susceptible to threats like Mega Diancie and Kyurem-B, so Steel- and Fire-types like Solgaleo, Zacian-C, and Victini are good teammates, and they can also provide a degree of scouting against Choice Band Mega Mewtwo X. Aforementioned offensive threats like Magic Guard Mega Mewtwo X can be Imposter-proofed by Yveltal. Knock Off variants can be Imposter-proofed by Arceus formes, while Revelation Dance sets can be Imposter-proofed by Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Lunala": {
    "sets": {
      "No Retreat": {
        "description": "<p>Lunala is a threatening setup sweeper thanks to the combination of Simple + No Retreat making it a decent complement to other setup sweepers like Simple Arceus-Ghost. Judgment with Spooky Plate lets Lunala Imposter-proof itself. Stored Power after No Retreat deals a massive chunk to special walls such as Mega Audino, Primal Kyogre, and Arceus formes. Final Gambit with Lunala's above-average HP can clear out walls like Yveltal and Ice Scales + Haze users for its teammates. Lunala can struggle to break past walls like Yveltal and Dialga-O without using Final Gambit, making it pair well with offensive Pokemon like Arceus-Ghost, Magic Guard Mega Mewtwo X, and Mold Breaker Eternatus. Lunala is threatened by Pokemon such as Arceus-Ghost, Kartana, and Wicked Blow or Astral Barrage Mega Mewtwo X, which can force it out by threatening an OHKO and thus prevent it from setting up, so appreciates defensive teammates such as Fur Coat Yveltal, Miraidon, and Ice Scales Arceus-Fairy to check these foes, respectively. Lunala usually Imposter-proofs itself thanks to Spooky Plate, but in the event that a Spooky Plate Imposter user transforms into Lunala, a teammate like Fur Coat Yveltal is highly recommended to not get instantly reverse swept.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Pheromosa": {
    "sets": {
      "Choice Band": {
        "description": "<p>Pheromosa has one job on most teams: be the fastest thing on the field and fire off very strong U-turn. This allows it to both force out dangerous offensive threats and grab momentum at the same time. Sword of Ruin kicks up Pheromosa's power and makes it a decent supporting wallbreaker for an ally like Mega Garchomp. Glacial Lance chunks Dragon-types like Eternatus and Giratina for solid damage. Knock Off cuts into the longevity of most physical walls by removing their Leftovers and Heavy-Duty Boots, making it easier for an ally to pick them off; in addition, removing Covert Cloak opens these up to be poisoned by Mortal Spin. Pheromosa's best fit is on offense teams that are looking for a reliable way of scaring out fast threats that Imposter isn't very reliable into, like Ultra Necrozma and Ash-Greninja. Pheromosa lacks the power to beat Fur Coat users by itself, so another physical wallbreaker like Mega Garchomp is mandatory for it to be useful. Imposter-proof Pheromosa with bulky physical walls that don't mind Knock Off, like Fur Coat Earth Plate Arceus-Poison.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Necrozma-Ultra": {
    "sets": {
      "Sheer Force": {
        "description": "<p>Sheer Force Ultra Necrozma boasts great Speed and offenses, making it a fast and strong mixed attacker. Thanks to Sheer Force + Life Orb, it has excellent damage output, with Luster Purge or Bolt Strike always threatening to 2HKO Arceus formes other than Arceus-Ground. Blue Flare takes down Steel-types like Registeel, Celesteela, and Mega Steelix. Magical Torque is used primarily to target Imposter users for large amounts of damage, but it also hits Giratina and Miraidon hard. Sheer Force Ultra Necrozma best fits on balance teams that can give it multiple safe opportunities to switch in, as it generally needs to get predictions correct to make any substantial progress. Pivoting support, such as with Teleport users like Mega Slowbro or RegenVest users like Mega Swampert, helps navigate Ultra Necrozma's frailty and prediction reliance. Ultra Necrozma can't really beat Ice Scales Arceus-Ground, so Toxic Spikes and Magic Bounce Flying-types like Yveltal can help by wearing it down. Ultra Necrozma also tends to get scared out by faster offensive threats like Ash-Greninja and Flutter Mane, so reliable checks to these like Mega Audino are appreciated. Imposter-proofing Ultra Necrozma with Ice Scales Arceus-Ground is the most reliable option, but options like other Ice Scales Arceus formes and Fur Coat Mega Slowbro can also work.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Blacephalon": {
    "sets": {
      "Adaptability": {
        "description": "<p>Adaptability Blacephalon is a powerful mixed wallbreaker. Choice Scarf makes Blacephalon the fastest relevant Pokemon in the meta, outspeeding threats like Miraidon, allowing it to double as a revenge killer and also offsetting V-create's Speed drops against slower checks like Primal Kyogre. Alternatively, Life Orb provides Blacephalon with more firepower, allowing it to hit benchmarks like OHKOing Arceus and Mega Audino after slight chip. Volt Switch retains momentum and chips Pokemon like Ice Scales Primal Kyogre and Ho-Oh into 2HKO range. Poltergeist on Life Orb sets serves as a way to hit the aforementioned Pokemon without receiving Speed drops. Trick lets Blacephalon cripple a defensive Pokemon in matchups where its Choice Scarf is unnecessary. Strength Sap provides crucial longevity to offset Life Orb recoil and entry hazard chip damage. A Naughty nature is chosen to boost V-create's damage and make Imposter users take more damage from Astral Barrage. Blacephalon benefits greatly from entry hazards that chip walls like Primal Kyogre and Fur Coat Arceus formes into 2HKO range. Conversely, due to its Stealth Rock weakness, Blacephalon also strongly appreciates teammates that provide entry hazard removal like Arceus-Ground. Slow pivots like Primal Kyogre and Mega Steelix can bring Blacephalon in safely. Blacephalon can be Imposter-proofed by Imposter Guzzlord, though other options like Fur Coat Ting-Lu and Mega Audino also work.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Zacian": {
    "outdated": true,
    "sets": {
      "Ice Scales": {
        "description": "<p>Ice Scales Zacian is an effective special wall against prominent special attackers like Palkia-O and Arceus-Ghost. Spirit Break dissuades setup from Arceus formes, Eternatus, and Palkia-O, though Magical Torque is a stronger alternative. While seemingly counter-productive with Spirit Break, Haze is the best option to neuter Nasty Plot Palkia-O and Arceus-Ghost, and it also ensures Zacian beats No Retreat Arceus-Ghost. Spikes provides support for the team and makes progress against Strength Sap users. Spirit Shackle traps Imposter users, preventing them from recovering health for free on Zacian. Toxic punishes most setup special attackers like Calm Mind Arceus formes. Covert Cloak prevents burns from Palkia-O's Steam Eruption and protects against status conditions inflicted by Nuzzle and Mortal Spin. Alternatively, Heavy-Duty Boots and Leftovers help mitigate entry hazard damage and keep Zacian healthy. Ability Shield is useful against Normalize users like Dragapult and Mold Breaker users like Palkia-O. Zacian pairs very well with a secondary specially defensive pivot like RegenVest Ting-Lu or Dialga-O, as they can scout for moves from Choice Specs users while not being chipped down by Volt Switch. In return, Zacian provides a switch-in to strong Dragon-type moves while also checking setup Pokemon like Palkia-O and Nasty Plot Flutter Mane. Imposter-proofs for Spikes variants include Fur Coat Groudon and Arceus-Ground, while Toxic variants can be Imposter-proofed by Arceus-Poison and Corviknight. Tera Steel provides a resistance to Iron Bundle and Flutter Mane's Boomburst while retaining a Dragon resistance, as well as providing a Toxic immunity.</p>"
      },
      "Fur Coat": {
        "description": "<p>Fur Coat Zacian differentiates itself from other Fur Coat users with its high Speed, outspeeding dangerous physical threats like Koraidon and threatening them with Knock Off or Will-O-Wisp. Spirit Break is a weaker alternative to Magical Torque that offers more PP and a useful secondary effect, preventing Calm Mind Arceus formes and Torch Song Eternatus from freely setting up. Knock Off removes important items like Choice Band and Assault Vest from Pokemon like Groudon and Ting-Lu, respectively, as well as removing Imposter Chansey's Eviolite. Will-O-Wisp neutralizes most physical attackers like Koraidon. Spirit Shackle threatens to trap and eliminate Imposter users and physical threats walled by Zacian. Toxic cripples Imposter users and most Fur Coat users. Heavy-Duty Boots and Leftovers help mitigate entry hazard damage, allowing Zacian to check physical threats more reliably, while Covert Cloak provides protection against status conditions from Nuzzle and Mortal Spin. Zacian can struggle to handle extremely powerful physical wallbreakers like Groudon and Mold Breaker Koraidon by itself, so secondary physical walls like Fur Coat Arceus formes are appreciated as teammates; they can also Imposter-proof Zacian. Despite outspeeding threats like Palkia-O and Flutter Mane, Zacian cannot switch in, so a special wall like Ice Scales Dialga-O or Chansey can help pivot Zacian in. Tera Water grants a resistance to V-create and Gigaton Hammer, the latterof which Koraidon commonly uses to threaten Zacian.</p>"
      },
      "Pixilate": {
        "description": "<p>Pixilate Zacian is a powerful cleaner. Pixilate boosted Population Bomb is an incredibly strong STAB move, 2HKOing defensive behemoths like Fur Coat Dondozo at +2. Coil + Protective Pads and Swords Dance + Wide Lens both increase Population Bomb's power and accuracy, with the former bypassing Rocky Helmet and the latter providing a stronger boost, notably letting Zacian boost past Strength Sap. Rapid Spin with Pixilate provides unblockable entry hazard removal in a pinch, while Precipice Blades targets Fairy-resistant Pokemon like Arceus-Poison and Arceus-Fire. Spirit Shackle is an option with Coil to trap and eliminate Imposter users, which are otherwise problematic. Knock Off users like Ting-Lu and Groudon are mandatory for Wide Lens sets to remove Rocky Helmet. While Zacian can remove hazards with Rapid Spin, hazard setters often carry moves that can heavily cripple it like Nuzzle and Knock Off, making another hazard remover like Tidy Up Groudon or Mortal Spin Ting-Lu a good choice. Groudon notably also pressures Fairy-resistant Pokemon like Arceus-Poison and Arceus-Fire well. Imposter users serve as a strong check to this set, so having a sturdy Imposter-proofing teammate is necessary, with Rocky Helmet + Fur Coat users or Corviknight being good candidates.</p>"
      },
      "Offensive Utility Zac-Crowned": {}
    },
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Eternatus": {
    "sets": {
      "Mold Breaker": {
        "description": "<p>Mold Breaker Eternatus is a threatening attacker that takes advantage of teams that heavily rely on Ice Scales to tackle special attackers. Torch Song hits Steel-types like Mega Steelix for good damage and allows Eternatus to boost alongside Calm Mind Arceus formes. Spikes allows Eternatus to take advantage of the switches it forces and notably ensures that it can make immediate progress against foes like RegenVest Primal Kyogre; alternatively, Toxic can wear away at foes without requiring multiple Special Attack boosts and high HP for Dragon Energy, and Sludge Bomb eliminates targets like Arceus-Fairy and Mega Diancie much faster and more reliably than Torch Song. Mold Breaker Eternatus appreciates support from mixed attackers like Mega Diancie and Arceus-Ghost, as these can help pressure one of Eternatus's best checks in RegenVest Primal Kyogre; these both also appreciate Eternatus's strong matchup into specially defensive Fairy-types if using Toxic or Sludge Bomb. Knock Off users are also similarly effective, as removal of Assault Vest puts both Primal Kyogre and Mega Steelix into 2HKO range. Imposter-proof Mold Breaker Eternatus with Imposter Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Dondozo": {
    "outdated": true,
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Dondozo is a great defensive Pokemon with its high physical bulk and typing, which allows it to wall physical attackers such as Koraidon and Groudon. Spikes supports offensive teammates, while Haze stops foes like Tidy Up Groudon from setting up. Knock Off removes items such as Covert Cloak and Leftovers, and Scald burns provide chip damage on foes. Flip Turn makes it easier to pivot into offensive teammates such as Koraidon, since Taunt, Dark-types, and Magic Bounce don't block it; alternatively, Parting Shot makes the foe easier to handle for Dondozo's teammates, but it's stopped by Taunt and Good as Gold. Heavy-Duty Boots, notably eases Dondozo's pivoting, while Rocky Helmet punishes contact moves such as U-turn and V-create. Covert Cloak protects against secondary effects like confusion from Magical Torque and burns from Scald. Tera Fire allows Dondozo to resist Magical Torque and Grass-type moves from Arceus-Fire, and it maintains Dondozo's resistance to Fire-type moves such as V-create. Dondozo appreciates defensive teammates with typing synergy such as RegenVest Ting-Lu, which helps protect Dondozo from threatening Pokemon such as Eternatus.</p>"
      },
      "Prankster": {
        "description": "<p>Prankster Dondozo with Haze can reliably check physical setup sweepers such as Groudon thanks to its huge physical bulk. Entrainment forces out Pokemon dependent on their abilities, Encore can lock foes into unfavorable moves such as setup moves or V-create, and Glare debilitates fast attackers such as Koraidon and Palkia-O. Parting Shot allows Dondozo to maintain momentum against opposing threats such as Arceus-Ghost with its priority pivoting and attack stat reduction, making it easier for teammates such as Ting-Lu to take hits from them; alternatively, Flip Turn provides a pivoting option unaffected by Taunt, Dark-types, and Magic Bounce. Heavy-Duty Boots, notably eases Dondozo's pivoting, while Covert Cloak protects it from status conditions from moves such as Nuzzle, Mortal Spin, and Magical Torque. Tera Fire improves Dondozo's matchup against Arceus-Fire with Grass-type coverage and lets it resist V-create and Magical Torque, whereas Tera Dark makes Dondozo immune to status moves from other Prankster users and improves its matchup against Ghost- and Dark-types. RegenVest Hisuian Goodra, Ting-Lu, and Fur Coat users synergize with Dondozo, covering threats such as Arceus-Fairy, Groudon, and Palkia-O.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "TTTech", "user_id": 338877}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Flutter Mane": {
    "sets": {
      "Flare Boost": {
        "description": "<p>Flutter Mane leverages its extremely rare offensive typing, good Speed, and decent Special Attack to be a very threatening wallbreaker and cleaner. Flame Orb + Flare Boost gives it a boost that can't be copied by Imposter users alongside a pseudo-immunity to status and Knock Off's item removal. With a Nasty Plot boost, Moongeist Beam does terrifying amounts of damage to Ice Scales users, having odds of OHKOing Ice Scales Arceus formes after Stealth Rock; Flutter Mane's Speed and power also let it offensively pressure other fast offensive threats, such as Ultra Necrozma and Ash-Greninja. Flutter Mane uses Pain Split, which Imposter users can't utilize effectively, as a burst healing option thanks to its low HP stat, offsetting burn damage andallowing it to beat Magic Guard Blissey one-on-one. Flutter Mane fits on balance and offense teams looking for a powerful special wallbreaker and late-game cleaner. Moongeist Beam ignores Ice Scales but not Assault Vest, making Knock Off users like RegenVest Primal Kyogre great partners. Imposter-proofing Flutter Mane can be done by any specially defensive Normal-type with Haze or Topsy-Turvy, usually Imposter Chansey, which can also trade Knock Off with RegenVest users.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "rightclicker", "user_id": 589755}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Ting-Lu": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Ting-Lu is a reliable special wall and a premier momentum generator. Regenerator gives Ting-Lu reliable recovery without conflicting with Assault Vest. Nuzzle discourages dangerous attackers like Palkia-O from switching in. U-turn allows Ting-Lu to safely bring in teammates thanks to its low Speed. Stone Axe forces chip damage on foes, letting offensive teammates wallbreak more easily. Knock Off removes items like Heavy-Duty Boots and Covert Cloak, making Ting-Lu's own utility more effective; it also punishes Imposter users attempting to gain Regenerator. Ting-Lu fits best on balance teams, which appreciate its ability to spread paralysis and safely bring in teammates thanks to its huge bulk. Dangerous wallbreakers like Koraidon and Palkia-O help maximize the effectiveness of U-turn pivoting. Ting-Lu is unable to naturally check Palkia-O and Fairy-types like Flutter Mane, so a teammate that helps shore up this weakness, such as Arceus-Grass or Hisuian Goodra, is appreciated. Tera Fairy provides an immunity to Dragon, allowing Ting-Lu to block Dragon Energy from Palkia-O and Glaive Rush from Koraidon; alternatively, Tera Grass provides a Water resistance, covering for Palkia-O's Water Spout.</p>"
      },
      "Prankster": {},
      "Magic Bounce": {}
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Miraidon": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Miraidon is an excellent support Pokemon due to its favorable typing and high Speed, crucially outspeeding threats like Mega Mewtwo X and Kartana to neutralize them with Strength Sap. Thunder Cage provides a consistent, high PP STAB move that is effective at wearing down checks such Ice Scales Arceus-Fairy. Torch Song provides coverage against Steel-types like Mega Steelix and Ferrothorn. Mortal Spin provides entry hazard removal in a pinch and is effective against Imposter users, while synergizing with Thunder Cage's trapping. Judgment hits Dragon-types like Mega Garchomp and opposing Miraidon. Take Heart allows Miraidon to also boost its Special Defense while removing crippling status conditions like poison, making it a potent bulky setup sweeper; note that if Take Heart is opted, then Lava Plume can be used over Torch Song. Fire-immune Steel-types synergize well defensively with Miraidon by switching into threatening wallbreakers like Mega Diancie and Kyurem-B and can also block Imposter users' Mortal Spin. Ho-Oh checks Mega Diancie, provides a Ground-immunity, and appreciates Miraidon as an Imposter-proofer. Other strong physical wallbreakers like Kartana and Mega Blaziken can also be Imposter-proofed by Miraidon.</p>"
      },
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  }
}