{
  "Cloyster": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Super Smash Sweeper",
        "description": "<ul> <li> <p>Shell Smash and Skill Link more than make up for Cloyster's weak Attack stat, making it a formidable sweeper that Focus Sash and Mimikyu can't easily stop.</p> </li> <li> <p><strong>Ice Shard: Priority may seem like overkill, but it helps for not only picking off weakened threats, but getting around priority attacks from Breloom, Dragapult, and Meowscarada.</p> </li> <li> <p><strong>Rock Blast: This is Closyer's best shot at dealing with the many Tera Fires that will attempt to deal with Icicle Spear, as well as OHKOing Volcarona, Iron Bundle, and Iron Moth.</p> </li> <li> <p><strong>Drill Run: This hits Gholdengo and other Steel-types hard without needing to Terastallize.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ice: The increased damage from Tera Ice makes it very difficult for Pokemon to wall Cloyster without resisting it, with even Corviknight getting OHKOed by +2 Adamant Icicle Spear after Stealth Rock damage.</p> </li> <li> <p><strong>Fire: While boosted Tera Blast actually does less damage to Corviknight than Tera Ice Icicle Spear, Tera Fire otherwise helps Cloyster muscle past Steel-types it traditionally struggles to beat, such as Scizor.</p> </li> <li> <p><strong>Grass: Tera Grass gives Cloyster coverage against troublesome Water-tyes such as Rotom-W, in addition to a handy Spore immunity.</p> </li> <li> <p><strong>Electric: Tera Electric gives Cloyster coverage for Corviknight, Toxapex, and Water-types with one moveslot.</p> </li> <li> <p><strong>Ghost: Since Cloyster will often be at extremely low health after Shell Smash, Tera Ghost helps it avoid getting revenge killed by Breloom's Mach Punch. It also provides coverage against Gholdengo with Tera Blast.</p> </li> <li> <p><strong>Normal</strong>: Tera Normal offers no offensive benefits to Cloyster, but it does prevent Mimikyu from revenge killing it with Shadow Sneak.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Focus Sash</strong>: Considering Cloyster's paper thin Special Defense, Focus Sash gives Cloyster by far the most set up opportunities.</p> </li> <li> <p><strong>King's Rock</strong>: King's Rock is a risky option for making Cloyster difficult to set up, but it does give Icicle Spear a 41% chance of flinching.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Gengar": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Disruptor",
        "description": "<ul> <li> <p>Gengar's useful immunities and fast Encore give it a niche as an incredibly disruptive Pokemon, especially if taking the correct predictive risks.</p> </li> <li> <p><strong>Destiny Bond</strong>: Destiny Bond is excellent at making foes second guess attacking Gengar. When slower foes don't take the bait and use a setup move, Gengar can punish them with Encore.</p> </li> <li> <p><strong>Thunder Wave</strong>: Thunder Wave is great at crippling faster sweepers if Gengar's Focus Sash is intact, and punishing fast, common switch-ins such as Roaring Moon.</p> </li> <li> <p><strong>Sludge Bomb: This covers Meowscarada and Fairy-types, in addition to being Gengar's most powerful attack.</p> </li> <li> <p><strong>Dazzling Gleam In addition to OHKOing Hydreigon after Stealth Rock damage, Dazzling Gleam is an appealing secondary STAB move when using Tera Fairy.</p> </li> <li> <p><strong>Focus Blast: Focus Blast is Gengar's best shot at beating Kingambit outside of Destiny Bond.</p> </li> </ul> <h1>Other Options</h1> <ul> <li><strong>Will-O-Wisp</strong> Gengar does a great job of burning bulky sweepers that Gengar can be forced to Destiny Bond against, such as Dragonite, Great Tusk, Iron Treads, and Tera Annihilape.</li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Normal: Tera Normal Gengar can turn slower Ghost-types such as Mimikyu, Flutter Mane, and Annihilape into easy Encore targets. </li> <li> <p><strong>Fairy: A Dragon-type immunity gives Gengar new Encore targets and better threatens Dragon-types.</p> </li> <li> <p><strong>Flying</strong>: Earthquake is a common attack against Gengar, so Tera Flying can turn the tables effectively. It also takes advantage of common Fissure users such as Dondozo and Garganacl.</p> </li> <li> <p><strong>Dark: A Dark Tera type lets Gengar surprise Espathra, letting it Encore Stored Power and potentially ruin its sweep.</p> </li> </ul> "
      }
    ]
  },
  "Tauros-Paldea-Blaze": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "FIREFIGHTER (Defensive)",
        "description": "<ul> <li> <p>Will-O-Wisp and Intimidate make Paldean Tauros-F a potent check to physical attackers, notably enabling it reliably check Kingambit.</p> </li> <li> <p><strong>Raging Bull: This provides a powerful STAB attack that can also break screens, allowing Paldean Tauros-F’s teammates to clean up more easily.</p> </li> <li> <p><strong>Body Press</strong> Body Press is valuable because unlike Close Combat, it doesn’t cause defense drops.</p> </li> <li> <p><strong>Rock Tomb</strong>: Rock Tomb allows Paldean Tauros-F to check Volcarona despite its meager Special Defense.</p> </li> <li> <p>Paldean Tauros-F should generally avoid Terastallizing, as its typing is a big part of what lets it act as such a sturdy check to Kingambit and other massive threats, such as Baxcalibur.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers: Leftovers makes up for Paldean Tauros-F’s lack of manual recovery.</p> </li> <li> <p><strong>Sitrus Berry</strong>: This can be used as an alternative to Leftovers if they are otherwise unavailable.</p> </li> <li> <p><strong>Heavy-Duty Boots</strong>: This allows Paldean Tauros-F to switch around more freely in after entry hazards are set.</p> </li> </ul> "
      },
      {
        "name": "Offensive Screen Smasher",
        "description": "<ul> <li> <p>Paldean Tauros-F is fast enough to outspeed key threats such as Hydreigon and Mimikyu, making an offensive set viable.</p> </li> <li> <p><strong>Raging Bull: Raging Bull might not be as powerful as Flare Blitz, but its ability to break Reflect and Light Screen make it an essential attack.</p> </li> <li> <p><strong>Flame Charge</strong>: This gives Paldean Tauros-F an unexpected late-game win condition, letting it outspeed threats such as Dragapult and Iron Bundle.</p> </li> <li> <p><strong>Rock Tomb: Rock Tomb's speed control is useful when sacrificing Paldean Tauros-F against a threat and prevents Dragonite from getting easy Speed boosts.</p> </li> <li> <p><strong>Will-O-Wisp: Despite this set's offensive nature, Will-O-Wisp is good for punishing Dragonite, Dragapult, and foes that may Terrastallize, such as Kingambit.</p> </li> <li> <p><strong>Bulk Up: Bulk Up is another potentially surprising win condition in the late stages of the game, and helps against Corviknight.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Grass: A Grass Tera type makes Paldean Tauros-F far less vulnerable to Rotom-W, Great Tusk, and Palafin-H.</p> </li> <li> <p><strong>Fairy: When paired with Tera Blast, a Fairy Tera type means Dragon-types will no longer wall Paldean Tauros-F.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Eject Pack</strong>: With Close Combat, this will give Paldean Tauros-F a powerful, one-time use pivot option.</p> </li> <li> <p><strong>Assault Vest</strong>: Patching up Paldean Tauros-F's mediocre Special Defense gives it a better shot against Dragapult and Rotom-W when Terastallizing.</p> </li> <li> <p><strong>Mirror Herb</strong>: Mirror Herb punishes setup sweepers even more effectively and pairs especially well with Intimidate.</p> </li> <li> <p><strong>Life Orb</strong>: This high value item can be tough to slot in, but the increased power makes sweeping with a Speed boost much easier.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 29010, "username": "Theorymon"}]}
  },
  "Gyarados": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Dragon Dance Sweeper",
        "description": "<ul> <li> <p>With Dragon Dance and its solid movepool and typing, Gyarados becomes a a viable sweeper that can take on major threats such as Great Tusk and physical Iron Valiant.</p> </li> <li> <p><strong>Earthquake: Earthquake is Gyarados's best coverage option against Magnezone, Iron Hands, and Water Absorb Clodsire.</p> </li> <li> <p><strong>Tera Blast: Tera Blast allows Gyarados to give itself another coverage option with various Tera types or provide a reliable Flying STAB attack for it to use after Terastallization.</p> </li> <li> <p><strong>Ice Fang</strong>: Ice Fang is valuable coverage versus Grass- and Dragon-type Pokemon who may try to deal with Gyarados, such as Dragonite, Brute Bonnet, and Hydreigon.</p> </li> <li> <p><strong>Taunt: This shuts down passive Pokemon and status users such as Corviknight, Scream Tail, and Skeledirge, opening the door for more opportunities to sweep.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Intimidate: Intimidate gives Gyarados more opportunities to set up on weakened physical attackers, such as Choice Band Garchomp and Choice Band Tera Dragon Dragapult.</p> </li> <li> <p><strong>Moxie: Moxie gives Gyarados sweeping potential after it picks off weakened foes like Hippowdon and Breloom, which reduces Gyarados's reliance on Dragon Dance.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Lum Berry: Lum Berry helps protect Gyarados from status and makes it easier to set up on sleep inducers such as Brute Bonnet, Breloom, and Amoonguss.</p> </li> <li> <p><strong>Life Orb: Life Orb boosts Electric Tera Blast enough to potentially 2HKO Dondozo and OHKO Iron Bundle and secures the OHKO against Dragapult with +1 Ice Fang.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ground: In addition to gaining a immunity to Electric-type attacks and giving Gyarados a resistance to rock-type attacks that threaten it, Gound Tera also boosts the power of Earthquake.</p> </li> <li> <p><strong>Flying</strong>: While not helping it's matchup versus Pokemon that threaten it, Tera Flying gives Gyarados access to a very dangerous STAB Flying move once it is boosted.</p> </li> <li> <p><strong>Electric</strong>: Tera Electric not only covers Gyarados's Electric-type weakness, but it also vastly improves its matchup against Iron Bundle.</p> </li> <li> <p><strong>Grass</strong>: Grass Tera eliminates Gyarados's weakness to Electric type attacks such as Rotom-W's Volt Switch and gives it an immunity to Spore from the likes of Breloom and Amoonguss.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 326738, "username": "Ultima-Z"}]}
  },
  "Dragonite": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Extreme Killernite",
        "description": "<ul> <li> <p>With Tera Normal, Dragonite can do its best impression of Arceus, with a powerful Extreme Speed that makes Dragonite a great revenge killer and sweeper in one!</p> </li> <li> <p><strong>Earthquake versus Fire Punch: Earthquake is Dragonite's strongest tool against most Steel-types, but Fire Punch is worth considering to hit Corviknight.</p> </li> <li> <p><strong>Low Kick: This is a far more reliable move against Kingambit, and can help in Tera Normal Dragonite mirrors.</p> </li> <li> <p><strong>Outrage and Dragon Claw: While a Dragon-type STAB move is useful against opposing Dragons and is Dragonite's best shot at picking off weakened Dondozo, it's not strictly needed on this Dragonite.</p> </li> <li> <p><strong>Jolly versus Adamant: A Jolly nature allows Dragonite to outspeed Dragapult, Iron Bundle, and Flutter Mane after one use of Dragon Dance, but Adamant is a reasonable consideration if revenge killing with Extreme Speed is more important.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Lum Berry: Lum Berry gives Dragonite more set up opportunities against status moves and pairs particularly well with Outrage to cure confusion.</p> </li> <li> <p><strong>Silk Scarf</strong>: This item goes all in on Extreme Speed's revenge killing power, without conflicting with Multiscale.</p> </li> <li> <p><strong>Life Orb</strong>: Life Orb doesn't pair well with Multiscale on paper, but the power boost it gives Extreme Speed can let Dragonite clean teams up earlier.</p> </li> </ul> "
      },
      {
        "name": "Defensive Dragon Dance",
        "description": "<ul> <li> <p>Dragonite's good bulk gives it plenty of chances to set up Dragon Dance, while still providing a solid defensive backbone.</p> </li> <li> <p><strong>Encore</strong>: Encore makes setting up on slower defensive foes such as Corviknight fairly easy.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: With Tera Blast, Tera Flying gives Dragonite a solid mono-attacking option and defensive typing in one, at the cost of always needing to Terastallize.</p> </li> <li> <p><strong>Steel</strong>: Tera Steel covers Dragonite's former weaknesses very well, and can still work somewhat well even if not Terastallized thanks to Iron Head.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Rocky Helmet</strong>: Rocky Helmet lets Dragonite play more passively thanks to the chip damage.</p> </li> <li> <p><strong>Heavy-Duty Boots</strong>: Preserving Multiscale even when Stealth Rock is set up can help Dragonite survive attacks in emergencies.</p> </li> <li> <p><strong>Leftovers</strong>: Leftovers's passive healing gives Dragonite a better matchup against passive foes it can Encore.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 100 Def / 156 Spe with Impish</strong>: This EV Spread allows Dragonite to outspeed Jolly Kingambit before boosting, and up to Timid Scream Tail after Dragon Dance, avoiding a potentially faster Encore.</p> </li> <li> <p><strong>252 HP / 4 Atk / 4 Def / 4 SpD / 252 Spe with Jolly: Maximizing Speed outspeeds Jolly Dragapult, Timid Flutter Mane, and Timid Iron Bundle after a Dragon Dance, and at least speed ties with offensive Dragonite.</p> </li> </ul> "
      },
      {
        "name": "Defensive Encore",
        "description": "<ul> <li> <p>Due to Dragonite's offensive presence and high bulk, many opponents choose to either check it defensively or set up against it to break through Roost + Multiscale. Against either option, Encore can turn Dragonite practically invincible allowing it to reside on the field indefinitely in most cases.</p> </li> <li> <p><strong>Fire Spin</strong>: This allows Dragonite to defeat almost any Pokemon universally by simply making full use of its longevity. Trapping an Encore locked Pokemon in the field is also highly valuable. Fire Spin is used instead of Wrap because it affects Ghost-types and doesn't trigger chip damage from Rough Skin and Rocky Helmet.</p> </li> <li> <p><strong>Encore and Thunder Wave</strong>: Encore is most effective against slower foes. Thunder Wave allows Dragonite to lock a much wider variety of Pokemon into their moves, while also giving it more opportunities to keep Multiscale up via potential paralysis.</p> </li> <li> <p><strong>Substitute</strong>: Substitute adds to Dragonite's longevity. Baiting a status move such as Toxic or Yawn, blocking it with Substitute, and locking the move in with Encore guarantees Dragonite an active Substitute while defeating the opposing Pokemon. Most notably, managing to leave a Substitute against Garganacl's Salt Cure or Corviknight's U-turn gains a lot of momentum.</p> </li> <li> <p><strong>Draco Meteor: Draco Meteor is a powerful move that can catch opposing Dragon-types off- guard and snatch a surprise KO. This Dragonite set has more than enough capability to run the timer out, so guaranteeing the number advantage is significant. It is also a significantly better offensive option against opposing Dragonite, which can avoid Encore via the use of Extreme Speed, raise its own Speed with Dragon Dance, and ignore Thunder Wave with the common Lum Berry.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Fairy</strong>: Due to Dragonite’'s low Speed compared to other Dragon-types, it has a difficult time without a Fairy Tera type.</li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 SpD / 252 Spe with Timid</strong>: In order to make the most use of Encore, max Speed is recommended.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe with Bold</strong>: A more defensive spread lets Dragonite preserve Terastallization against certain physical attackers, which makes it a noteworthy choice. In particular, max Defense Dragonite can use Roost to mitigate the damage from Choice Band Meowscarada without needing to Terastallize, and Substitute can survive Garganacl's Salt Cure.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers Generally, Leftovers preserves Dragonite’'s longevity best, as it cancels out the damage from Sandstorm and makes timer stall easier. However, the increased usage of entry hazard setter Garchomp makes Heavy-Duty Boots a strong option.</p> </li> <li> <p><strong>Rocky Helmet: Rocky Helmet makes it easier for Dragonite to defeat Pokemon such as opposing Dragonite, Kingambit, and Meowscarada, and its residual damage can be used to execute a win condition, especially for sets that choose not to run Fire Spin.</p> </li> </ul> "
      },
      {"name": "Choice Band", "description": "<ul> <li> <p>Choice Band makes Dragonite both an effective late-game cleaner with Extreme Speed, and a powerful wall-breaker against foes such as Skeledirge and Dondozo.</p> </li> <li> <p><strong>Outrage versus Dragon Claw: Outrage is strong enough to potentially 2HKO Impish Dondozo after Stealth Rock damage, though it leaves Dragonite very vulnerable to getting revenge killed.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Normal</strong>: Tera Normal boosts Dragonite's revenge killing potential with Extreme Speed.</p> </li> <li> <p><strong>Flying</strong>: With Tera Blast, Tera Flying is a surprising option that lets Dragonite 2HKO defensive Pokemon such as Tera Fairy Skeledirge.</p> </li> </ul> "},
      {
        "name": "Offensive Dragon Dance",
        "description": "<ul> <li> <p>Dragonite uses both Multiscale and the unpredictability of Terastallization to become an extremely dangerous sweeper!</p> </li> <li> <p><strong>Earthquake versus Low Kick</strong>: Earthquake is a consistent option against most Steel-types, but Low Kick does better against Kingambit.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel: Dragonite has superb synergy with Tera Steel, resisting most of its weaknesses, and particularly helping against Fairy-types and opposing Dragon-types. When paired with Safety Goggles, this Dragonite can take advantage of Amoonguss effectively as well.</p> </li> <li> <p><strong>Fire: With Tera Fire, Dragonite deals massive damage to Corviknight with +1 Fire Punch, in addition to gaining a useful Fairy-type resistance.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Lum Berry: With a Lum Berry, Dragonite can set up against status moves and use Outrage with less risk late game.</p> </li> <li> <p><strong>Heavy-Duty Boots</strong>: Avoiding damage from hazards lets Dragonite always set up with Multiscale in tow.</p> </li> <li> <p><strong>Life Orb</strong>: Life Orb doesn't fit well with Multiscale, but it's notable for allowing Tera Fire Dragonite a 75% chance to OHKO Corviknight after Dragon Dance.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 613881, "username": "Tachipoyo"}]}
  },
  "Azumarill": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With a fantastic typing and priority, Azumarill makes a good choice for a team's bulky Water-type.</p> </li> <li> <p><strong>Superpower</strong>: Superpower often forces Azumarill to switch out, but its reliability against common Hydreigon Tera types is very valuable, in addition to OHKOing Kingambit.</p> </li> <li> <p><strong>Ice Spinner: Ice Spinner is Azumarill's best option against Amoonguss.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fire: Tera Fire gives Azumarill a vital immunity to Will-O-Wisp, as well as letting it deal massive damage to Corviknight with Tera Blast.</p> </li> <li> <p><strong>Water: Tera Water not only makes it easier to clean weakened teams with Aqua Jet, but it also lets Choice Band Azumarill OHKO Flutter Mane with Aqua Jet.</p> </li> <li> <p><strong>Fairy: Tera Fairy gives Assault Vest Azumarill a much better match-up against Iron Bundle, no longer being weak to Freeze-Dry and OHKOing it after Stealth Rock damage with Play Rough.</p> </li> <li> <p><strong>Grass: Tera Grass lets Azumarill beat Breloom, Brute Bonnet, and Rotom-W.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Assault Vest: Assault Vest lets Azumarill act as a Hydreigon check; even Choice Specs-boosted Tera Electric Tera Blast fails to OHKO it. It also lets Tera Fairy Azumarill do well against Iron Bundle.</p> </li> <li> <p><strong>Choice Band</strong>: The big power boost from Choice Band gives Azumarill an 81.3% chance to OHKO Rotom-H with Aqua Jet, and pick off major foes such as Flutter Mane and Great Tusk more easily.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Umbreon": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Wish Tank",
        "description": "<ul> <li> <p>Umbreon’s high bulk allows it tank a slew of offensive Pokemon. In particular, it matches up extremely well against Dragapult. A naturally high bulk alongside excellent utility moves means Umbreon can generate tempo while surviving even surprise Tera-boosted attacks.</p> </li> <li> <p><strong>Foul Play: In such a physically leaning format, Foul Play is a strong reliable move to chip the opponent’s Pokemon. In particular, it punishes Swords Dance from Lum Berry Kingambit. Protect also scouts for U-turn and Tera.</p> </li> <li> <p><strong>Wish and Protect: Wish + Protect provides excellent recovery, and with Leftovers's animation as well, is great at stalling out the timer and can also keep teammates healthy.</p> </li> <li> <p><strong>Yawn</strong>: Yawn's ability to force switches generates extra Leftovers recovery and generates momentum for its teammates.</p> </li> <li> <p><strong>Thunder Wave</strong>: Thunder Wave has excellent synergy with Wish. If the opponent’s Pokemon is unable to attack on the turn Umbreon uses Wish, Umbreon can easily pass the Wish to a teammate.</p> </li> <li> <p><strong>Taunt</strong>: Umbreon can Taunt opposing walls and deny their recovery; with foes such as Hippowdon and Corviknight being especially vulnerable.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Poison: Tera Poison resists Fighting, Bug, and Fairy and provides an immunity to Toxic.</p> </li> <li> <p><strong>Steel</strong>: Tera Steel resists Bug and Fairy, is immune to Toxic, and has a decent matchup against Kingambit and Flutter Mane.</p> </li> <li> <p><strong>Fairy: In a heavily Dragon-centric metagame, Tera Fairy on defensive Pokemon is highly valuable.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 Def / 4 SpD with Bold</strong>: This spread allows Umbreon to tank a majority of the heavily physical metagame.</p> </li> <li> <p><strong>172 HP / 252 Def / 60 SpD / 20 Spe with Bold</strong>: If running Taunt, 20 Speed EVs outpace Skeledirge and Corviknight while retaining all-around bulk.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Inner Focus: Inner Focus avoids flinches from Kingambit and Hydreigon, making it a more reliable check.</p> </li> <li> <p><strong>Synchronize: Synchronize punishes attempts to burn Umbreon.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 613881, "username": "Tachipoyo"}]}
  },
  "Scizor": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Pivot",
        "description": "<ul> <li> <p>Thanks to its high Attack, great defensive typing and solid bulk, Scizor is an effective bulky pivot that can also punish faster foes with Technician-boosted Bullet Punch, such as Flutter Mane, Iron Valiant, and Baxcalibur.</p> </li> <li> <p><strong>Close Combat: Close Combat is Scizor’s best option to hit opposing Steel types, while Thief is the strongest option against Gholdengo due to the Technician boost.</p> </li> <li> <p><strong>Thief Thief is a great option for hitting Gholdengo hard.</p> </li> </ul> <h1>Other Options</h1> <ul> <li> <p><strong>Aerial Ace</strong> This is an option over Thief to hit Fighting types like Annihilape, Great Tusk, and Breloom, but leaves you vulnerable to Gholdengo.</p> </li> <li> <p><strong>Trailblaze: Besides gaining a useful Speed boost, Trailblaze does good damage to Great Tusk and Rotom-W.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Band: Choice Band lets Scizor function as a scary late-game cleaner, especially with Tera Steel-boosted Bullet Punch. The high damage output also helps Scizor to break down walls for its teammates.</p> </li> <li> <p><strong>Assault Vest</strong>: While much less immediately threatening than Choice Band, Assault Vest lets Scizor more comfortably switch in to stray special attacks like Gholdengo’s and Flutter Mane's Shadow Ball or Rotom-W’s Volt Switch, improving its longevity.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel</strong>: Choice Band Scizor is a fairly good user of Terastallization, as with Tera Steel boosts Bullet Punch to terrifying levels. Tera Steel also softens Scizor’s weakness to Fire, letting it avoid the OHKO from attacks like Dragonite’s Fire Punch even after a boost.</p> </li> <li> <p><strong>Water: While Steel is Scizor’s best Tera type in most circumstances, Water turns its Fire weakness into a resistance, allowing Scizor to surprise Pokemon like Skeledirge, Iron Moth, and Volcarona.</p> </li> <li> <p><strong>Fire: A Fire Tera type functions similarly to Water, but it trades more weaknesses in general for an immunity to burn and a better matchup against Corviknight.</p> </li> </ul> "
      },
      {"name": "Swords Dance", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 15093, "username": "Jediment"}]}
  },
  "Blissey": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Calm Mind Support",
        "description": "<ul> <li> <p>The old reliable special wall is still viable, but with a twist: Blissey uses Calm Mind so it isn't entirely passive and fully takes advantage of Tera Blast giving it STAB no matter what type it is.</p> </li> <li> <p><strong>Shadow Ball</strong>: Shadow Ball is still a reasonable option for dealing good damage to Gholdengo and Dragapult regardless of Blissey's Tera type, and also breaks Mimikyu's Disguise.</p> </li> <li> <p><strong>Thunder Wave: Thunder Wave is Blissey's most consistent way of spreading paralysis, though it's vulnerable to Taunt and Gholdengo switch-ins.</p> </li> <li> <p><strong>Fling with Light Ball</strong>: This allows Blissey to paralyze Gholdengo, Ground-types, and users of Taunt alike, though Covert Cloak holders are immune to the effect. Fling also gets rid of Choice items from Trick users.</p> </li> <li> <p><strong>Trick with Lagging Tail</strong>: This cripples even Electric-types and is a more direct way of getting rid of troublesome Choice items that Blissey would normally succumb to.</p> </li> </ul> <h1>Other Options</h1> <ul> <li> <p><strong>Fling with Flame Orb</strong>: This is a surprising option to burn common Blissey switch-ins like Great Tusk, though failing to use it right away will force switching out to get rid of the burn.</p> </li> <li> <p><strong>Fling with Toxic Orb: This is as close as it gets to Blissey regaining Toxic, though getting poisoned is devestating if Blissey is the last Pokemon around, making it a risky option.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dark</strong>: Dark Tera type not only gives Blissey a less exploitable STAB move against Gholdengo, but it also ruins Espathra's attempts to break through Blissey with Stored Power, at least forcing a Calm Mind war instead of a total loss.</p> </li> <li> <p><strong>Ghost: The Fighting-type immunity comes in handy for Blissey, though it does become more vulnerable to Gholdengo.</p> </li> <li> <p><strong>Flying</strong>: Under Flying Tera type, Blissey gains a handy resistance to Fighting and no longer has to worry about Fissure from Dondozo.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Pelipper": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Drizzle Bird",
        "description": "<ul> <li> <p><strong>Hydro Pump versus Surf</strong>: Hydro Pump significantly weakens opponents when rain-boosted, often picking up surprise KOs. Surf is the far more reliable option.</p> </li> <li> <p><strong>Hurricane versus Roost</strong>; The choice between Hurricane and Roost is a matter of coverage versus longevity. Hurricane gives Pelipper a powerful secondary STAB move, while Roost takes advantage of its decent physical bulk, increasing its staying power. This is particularly useful in weather wars against Torkoal</p> </li> </ul> <h1>Tera Types</h1> <p><strong>Ground</strong>: Tera Ground gives Pelipper an immunity to Volt Switch, which is often used against it early-game. This wastes a turn for the opponent and gives Pelipper the chance to safely U-turn or deal massive damage with a rain-boosted Hydro Pump.</p> <p><strong>Grass</strong>: Tera Grass is a viable option for Rotom-W, which primarily uses Hydro Pump on lead while providing a Volt Switch resistance.</p> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Def / 252 SpA with Quiet: With 0 Speed IVs, this is used to underspeed uninvested Hippowdon, giving Pelipper the initial advantage in weather wars.</p>  <li> <p><strong>252 HP / 252 Def / 4 SpA with Relaxed: This spread gives Pelipper a better matchup against dominant, powerful physical attackers like Choice Band Dragpault and Extreme Speed Dragonite.</p> </li> <li> <p><strong>4 Def / 252 SpA / 252 Spe with Modest: This offensive spread can be used to outspeed uninvested Corviknight and others in that Speed tier.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Eject Button: This extra method of pivoting makes it much easier to switch Pelipper in just for getting rain up.</p> </li> <li> <p><strong>Choice Specs</strong>: Choice Specs can be used to take advantage of Pelipper's powerful STAB moves.</p> </li> <li> <p><strong>Sitrus Berry</strong>: Sitrus Berry provides longevity on defensive sets.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 62165, "username": "StarkGod"}]}
  },
  "Breloom": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Since it can sleep foes without restriction, Breloom is a monstrous foe that every team needs to prepare for!</p> </li> <li> <p><strong>Bulldoze</strong>: This is Breloom's best option against Gholdengo and provides valuable speed control.</p> </li> <li> <p><strong>Spore: As good as Spore is, it's well prepared for enough by threats such as Gholdengo, Garganacl, and Lum Berry that going without it can make sense.</p> </li> <li> <p><strong>Rock Tomb: Rock Tomb provides speed control and ensures that Breloom is not walled by Flying-types such as Dragonite.</p> </li> <li> <p><strong>Close Combat: Close Combat lets Breloom muscle past bulkier threats more easily, such as Tera Steel Garganacl.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fighting</strong>: Breloom doesn't Terastallize often, but Fighting Tera is a good choice for picking off foes more easily with Mach Punch.</p> </li> <li> <p><strong>Ground</strong>: Tera Ground-boosted Bulldoze has a 93.8% chance to OHKO 4 HP Gholdengo, making Breloom a situational lure. It also severely punishes Rotom-W that attempt to Volt Switch out, and Hippowdon that don't Terastallize.</p> </li> <li> <p><strong>Fire: With Tera Blast, Tera Fire provides an alternative way to get past Gholdengo, avoids getting burned by other foes, and gives bulkier Breloom a chance against Flutter Mane.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Focus Sash: Since Breloom's bulk isn't very good, Focus Sash is the most reliable way to fire off Spore.</p> </li> <li> <p><strong>Loaded Dice</strong>: Guaranteeing 4 hits from Bullet Seed can be quite useful for bulkier Breloom sets, clinching a OHKO on Flutter Mane and Iron Bundle regardless of them running Substitute.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 Atk / 252 Spe: If using Focus Sash, maximizing Speed is important to deal with slower foes that might invest in Speed, such as Corviknight and Skeledirge.</p> </li> <li> <p><strong>252 HP / 180 Atk / 76 SpD: This bulkier spread makes sense if using Loaded Dice and Swords Dance, letting Breloom survive one hit from Iron Bundle or Choice Specs Flutter Mane with the correct Tera type.</p> </li> </ul> "
      },
      {"name": "Subseed", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 534158, "username": "Kiby"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Torkoal": {"sets": [{"name": "Sun Support", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}]},
  "Salamence": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Specsmence Returns",
        "description": "<ul> <li> <p>Salamence finds a niche for itself among other special attacking Dragon-types due to an incredible ability in Intimidate and a useful typing that provides a handy Fissure immunity.</p> </li> <li> <p><strong>Hurricane versus Air Slash</strong>: Hurricane's accuracy may not be very reliable, but the sheer damage output makes it worth it. Air Slash is much weaker than Hurricane, but the more reliable accuracy and flinch chance make it a reasonable alternative. It becomes especially attractive if using Tera Flying.</p> </li> <li> <p><strong>Hydro Pump</strong>: If not using Tera Fairy, Hydro Pump is a reasonable choice that deals massive damage to Hippowdon and Fire-types without risking Draco Meteor.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: Not only does Tera Fairy give Salamence an edge against many Dragon-types, but it also pairs extremely well with Intimidate, transforming Salamence into an effective hit-and-run threat.</p> </li> <li> <p><strong>Steel</strong>: Tera Steel comes in handy against Dragon- and Fairy-types alike, though the added weaknesses to Ground and Fighting make it less effective at taking physical hits with Intimidate.</p> </li> <li> <p><strong>Flying</strong>: Air Slash becomes much easier to justify with Tera Flying, and if you're willing to risk it, Hurricane can be used to become almost impossible to wall with Choice Specs.</p> </li> <li> <p><strong>Fire</strong>: Tera Fire doesn't offer as much defensive utility, but the powerful STAB attacks come in handy against Steel-types like Corviknight.</p> </li> <li> <p><strong>Dragon: Tera Dragon trades defensive advantages for an extremely powerful Draco Meteor that catches defensive foes like Dondozo by surprise.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Specs: With Salamence already standing at a decent Speed tier, it can get away with Choice Specs, making it extremely difficult to wall outside of using Blissey.</p> </li> <li> <p><strong>Choice Scarf: Choice Scarf trades wallbreaking power for the ability to get the jump on major offensive threats, such as Dragapult, Meowscarada, and Garchomp.</p> </li> </ul> "
      },
      {
        "name": "Physically Offensive",
        "description": "<ul> <li> <p>Salamence is somewhat overshadowed by other physical Dragon-types like Roaring Moon and Dragapult, but it has a trick up its claws: Dual Wingbeat, which OHKOes Breloom and Meowscarada through their Focus Sash.</p> </li> <li> <p><strong>Earthquake versus Fire Blast: Earthquake is the best option for hitting Steel-types such as Gholdengo hard, but Fire Blast is Salamence's best shot at 2HKOing Corviknight.</p> </li> <li> <p><strong>Dragon Dance: After a boost, Dual Wingbeat's Focus Sash slaying powers go into overdrive, being able to bust through Flutter Mane, Iron Bundle, and Great Tusk.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: With a Flying Tera type, a boosted Dual Wingbeat has a 75% chance to OHKO offensive Mimikyu through its disguise! It also means Salamence no longer needs a boost to OHKO Great Tusk and Flutter Mane.</p> </li> <li> <p><strong>Electric: Tera Electric lets Tera Blast Salamence OHKO Azumarill and Iron Bundle, and potentially 2HKO Dondozo after Stealth Rock damage.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Intimidate: While Salamence isn't particularly bulky, Intimidate makes setting up far easier when paired with a Flying Tera type that removes Salamence's common weaknesses.</p> </li> <li> <p><strong>Moxie</strong>: With Moxie, Salamence has the potential to seriously punish Breloom leads or snowball through teams even without Dragon Dance.</p> </li> </ul> "
      },
      {
        "name": "Mixed Attacker",
        "description": "<ul> <li> <p>Salamence's great mixed offenses, Intimidate, and decent Speed give it a niche as a powerful wall breaker.</p> </li> <li> <p><strong>Dual Wingbeat</strong>: Dual Wingbeat lets Salamence OHKO Breloom regardless of its Focus Sash, something very few Pokemon can do.</p> </li> <li> <p><strong>Draco Meteor: Draco Meteor deals massive damage to Dondozo, usually doing more than 50% to physically defensive ones.</p> </li> <li> <p><strong>Substitute: Substitute makes the Dondozo match-up even better, making Yawn a non-issue. It's also a good way to scout Terastallization against slower threats.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel</strong>: A Steel Tera type covers a lot of Salamence's weaknesses and makes dealing with Mimikyu, Iron Bundle, and Flutter Mane much easier.</p> </li> <li> <p><strong>Fairy: Tera Fairy gives Salamence a great match-up against most Dragon-types, and pairs especially well with Intimidate to turn Salamence into a good hit-and-run attacker.</p> </li> <li> <p><strong>Fire</strong>: With a Fire Tera type, Salamence gains a resistance to Fairy-type attacks and deals massive damage to Assault Vest Magnezone.</p> </li> <li> <p><strong>Electric: Tera Electric gives Salamence a great tool against Dondozo with Tera Blast.</p> </li> <li> <p><strong>Dragon</strong>: While this Tera type fails to help Salamence much defensively, it makes Draco Meteor 2HKO physically defensive Dondozo.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Floatzel": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Swift Weasel",
        "description": "<ul> <li> <p><strong>Wave Crash</strong>: This is your main offensive option. When further boosted by rain, Tera Water, and Choice Band, it becomes one of the most powerful physical moves in the game, 2HKOing the likes of Bold Amoonguss and OHKOing maximum Defense Corviknight. Mystic Water is an option for flexibility but sacrifices the listed KOs.</p> </li> <li> <p><strong>Liquidation versus Waterfall: Liquidation is a secondary option, and it's preferred when facing frailer offensive teams due to the significant recoil drawback of Wave Crash. However, Waterfall is worth considering for its possible flinch chance.</p> </li> <li> <p><strong>Aqua Jet</strong>: Aqua Jet allows Floatzel to maintain offensive presence outside of rain, as well as being a great response to opposing priority moves, such as Kingambit's Sucker Punch.</p> </li> <li> <p><strong>Rain Setter: Pelipper's rain is mandatory for both Swift Swim and maximum damage output.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Water</strong>: Tera Water massively bolters Floatzel's damage output, and the weasel simply doesn't have the bulk needed for more defensive options.</li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>60 HP / 252 Atk / 196 Spe:196 Speed EVs are used to outspeed the entire tier in rain, including Choice Scarf Dragpault.</p> </li> <li> <p><strong>4 HP / 252 Atk / 252 Spe</strong>: Maximum Speed investment outspeeds Hydreigon and Mimikyu outside of rain, in addition to tying with Salamence, at the cost of having less buffer HP for Wave Crash recoil.</p> </li> </ul> "
      }
    ]
  },
  "Garchomp": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Swords Dance Sweeper",
        "description": "<ul> <li> <p>The classic Swords Dance sweeper is still a big threat, thanks to its good bulk, unique Speed tier, and excellent use of Terastallization.</p> </li> <li> <p><strong>Outrage versus Dragon Claw</strong>: Outrage is by far Garchomp's strongest STAB move, but the lock-in effect makes it very vulnerable to Fairy-types such as Mimikyu.</p> </li> <li> <p><strong>Fire Fang versus Tera Blast: Despite its low base power, Fire Fang is Garchomp's best shot at breaking past Corviknight after a Swords Dance. If Garchomp is almost always Terastallized on your team, Tera Blast can be used instead.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel: A Steel Tera type has excellent synergy with Garchomp's typing, letting it more effectively tackle faster Dragon-types, Iron Bundle, Mimikyu, and Ice Shard from the likes of Baxcalibur and Cloyster.</p> </li> <li> <p><strong>Fairy: Fairy is an even stronger option against Dragon-types, and gives Garchomp a better matchup against Great Tusk.</p> </li> <li> <p><strong>Fire: While the Stealth Rock weakness is unfortunate against bulkier teams, a Fire Tera type lets Life Orb Garchomp OHKO Corviknight with a +2 Fire Fang 93.8% of the time.</p> </li> <li> <p><strong>Ground</strong>: While the defensive synergy with Garchomp's former typing isn't that strong, a Ground Tera type lets Garchomp become more of a hit-and-run attacker with Earthquake, dealing good damage to Dondozo before being forced out by Yawn.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Life Orb: This is the best option for damage output.</p> </li> <li> <p><strong>Lum Berry</strong>: Lum Berry lets Garchomp deal with major status users more easily, such as Dragapult and Breloom.</p> </li> <li> <p><strong>Mirror Herb: Mirror Herb gives Garchomp the potential to severely punish set-up sweepers such as Dragapult and Dragonite, with the right Tera type.</p> </li> <li> <p><strong>Focus Sash: Surviving shocking attacks with Focus Sash gives Garchomp new sweeping and revenge killing potential.</p> </li> </ul> "
      },
      {
        "name": "Entry Hazard Setter",
        "description": "<ul> <li> <p>While Garchomp is known for its offensive prowess, it can also support its teammates with entry hazards and phazing.</p> </li> <li> <p><strong>Earthquake versus Bulldoze</strong>: Bulldoze brings utility against Choice Scarf and naturally fast grounded opponents, but its lower Base Power makes Garchomp more passive against bulkier Pokemon.</p> </li> <li> <p><strong>Dragon Tail</strong>: Dragon Tail has marvelous synergy with setting up hazards, making it the prime choice for a Dragon-type STAB despite the lowered priority.</p> </li> <li> <p><strong>Fairy Tera Blast</strong>: If using Tera Fairy, this can help Garchomp muscle past Great Tusk, a foe that can threaten to Rapid Spin your hazards away.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: Fairy Tera type provides Garchomp with an immunity to Dragon-type attacks, and is a big help against Great Tusk.</p> </li> <li> <p><strong>Steel</strong>: Terastallizing into a Steel-type makes Garchomp resist Dragon-, Ice- and Fairy-type attacks, making it a safer lead against opposing Dragon-type leads and Iron Bundle, at the cost of being vulnerable to Tera Fire Dragons and Fighting- and Ground-types.</p> </li> </ul> <h1>EV spreads</h1> <ul> <li> <p><strong>188 HP / 236 Def / 84 Spe with Impish: This EV spread lets Garchomp survive Adamant Dragonite's Outrage while also outspeeding it.</p> </li> <li> <p><strong>252 HP / 116 Def / 140 Spe with Jolly: While this spread doesn't take physical hits as well, it lets Garchomp outspeed Gholdengo, Baxcalibur, Great Tusk, and Rotom-W.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Sitrus Berry: This prevents Choice Band Dragapult from OHKOing Garchomp, as it activates after the first hit, and the HP recovered doesn't allow the second one to get the KO, unless Dragapult is Terastallized into a Dragon-type.</p> </li> <li> <p><strong>Rocky Helmet: Combined with Rough Skin, Rocky Helmet severely punishes contact moves.</p> </li> <li> <p><strong>Red Card</strong>: With Red Card, Garchomp will be able to phaze foes Terastallizing into a Fairy type once.</p> </li> </ul> "
      },
      {
        "name": "Choice Item",
        "description": "<ul> <li> <p>Garchomp's fantastic Speed tier and power make it a fine Choice item user, especially when it can catch its softer checks off guard, such as Dragapult and Corviknight.</p> </li> <li> <p><strong>Stone Edge versus Rock Tomb: Stone Edge deals massive damage to common Tera Flying Pokemon such as Gholdengo, and it prevents it from being walled by Tera Fairy Rotom-W. Rock Tomb is fairly weak, but the speed control can be very useful on Choice Scarf variants if sacrificing Garchomp.</p> </li> <li> <p><strong>Iron Head: With Tera Steel, Iron Head lets Garchomp beat Tera Fairy Levitate foes such as Rotom-W.</p> </li> </ul> <h1>Other Options</h1> <ul> <li> <p><strong>Crunch</strong>: Crunch lets Garchomp deal massive damage to Air Balloon Gholdengo, though it doesn't cover much else.</p> </li> <li> <p><strong>Fire Fang</strong> While weak, this is Garchomp's best option against Corviknight when not Tera Fire.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fire</strong>: When combined with Tera Blast, Tera Fire lets even Choice Scarf Garchomp possibly 2HKO Corviknight. The Fairy and Ice resistance is also very helpful.</p> </li> <li> <p><strong>Steel</strong>: Tera Steel is a good defensive alternative to Fire, retaining the useful Stealth Rock resistance and preforming better against Dragon- and Fairy-types.</p> </li> <li> <p><strong>Fairy</strong>: Tera Fairy goes all in on the Dragon-type immunity, and deals with Great Tusk and Flutter Mane better than other Tera types.</p> </li> <li> <p><strong>Ground: The incredible power boost Earthquake gets from Tera Ground is worth considering, with Choice Band possibly 2HKOing physically defensive Dondozo with it.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Band: Choice Band trades revenge killing for wallbreaking, letting Garchomp reliably 2HKO Skeledirge and deal massive damage to Corviknight with Fire-type Tera Blast.</p> </li> <li> <p><strong>Choice Scarf: With Choice Scarf, Garchomp is able to outspeed and revenge kill key threats, such as Dragapult, Meowscarada, and Choice Specs Iron Moth, making it a potent late-game cleaner as well.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 330577, "username": "Thick Fat Azumarill"}]}
  },
  "Hippowdon": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Stealth Rock Support",
        "description": "<ul> <li> <p>Few Pokemon are more reliable at setting up Stealth Rock and phazing than Hippowdon.</p> </li> <li> <p><strong>Whirlwind</strong>: This is a more direct phazing option than Yawn, and it is helpful against dangerous setup sweepers that may run Lum Berry, such as Dragonite and Garchomp.</p> </li> <li> <p><strong>Slack Off: Slack Off may seem like an obvious choice to make a defensive Pokemon last longer, but Hippowdon is often more focused on support than walling, so Slack Off doesn't fit every team.</p> </li> <li> <p><strong>Rock Tomb</strong>: Rock Tomb not only provides helpful speed control, but also pops Air Balloon on foes Hippowdon would otherwise struggle with, such as Gholdengo.</p> </li> </ul> <h1>Other Options</h1> <ul> <li><strong>Fissure</strong>: Hippowdon isn't quite as good at using Fissure as Dondozo and Garganacl, and it can be difficult to fit in, but it does severely punish passive play.</li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Grass: Hippowdon doesn't Terastallize often, but a Grass Tera type does help it against Breloom, Brute Bonnet, and Water-types such as Rotom-W. </li> <li> <p><strong>Steel: Tera Steel allows specially defensive Hippowdon to avoid a 2HKO from Iron Bundle that lack Choice Specs.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Def / 252 SpD with Careful: Patching up Hippowdon's weaker Special Defense is quite useful against special attackers, such as having a 6.3% chance of surviving Gholdengo's +2 Make It Rain, and Choice Specs Hydreigon no longer being able to 2HKO Sitrus Berry Hippowdon.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 SpD with Impish: A physically defensive spread means not even Choice Band Tera Dragon Dragapult will be able to 2HKO Sitrus Berry Hippowdon.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Magnezone": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<ul> <li> <p>In a metagame with very few special attackers, Magnezone carves a strong niche as an Electric-type attacker that can take out the common physical walls, such as Dondozo and Corviknight.</p> </li> <li> <p>Magnezone’s STAB combination is difficult to switch into, especially with Choice Specs. Clodsire, the most noteworthy special wall in the format, can fall to an Analytic-boosted Flash Cannon or Steel Beam when carrying Choice Specs.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: A Fairy-type Tera Blast is very useful against common Dragon-types, most notably Garchomp and Roaring Moon.</p> </li> <li> <p><strong>Fighting: Gaining a resistance to Dark allows Magnezone to surprise and defeat Kingambit, Roaring Moon, and Hydreigon.</p> </li> <li> <p><strong>Grass: Grass has excellent defensive and offense synergy with Magnezone, especially through its utility against Ground-type attackers and Spore immunity. Most notably, Tera Blast Grass can OHKO max SpD Hippowdon with Choice Specs.</p> </li> <li> <p><strong>Flying: Flying has wonderful defensive synergy with Magnezone, reversing its Ground and Fighting weaknesses, and lets Tera Blast hit Grass-types harder.</p> </li> <li> <p><strong>Water</strong>: Offensively, Water serves a similar role to Grass, letting Tera Blast nail Ground-types. Water lacks a Ground resistance or a Spore immunity, but it gives Magnezone a much-appreciated Fire resistance for Pokemon like Skeledirge. Much like in the case of Grass, Tera Blast Water can OHKO Hippowdon, while also having the possibility of KOing Unaware Clodsire, although the risk it runs when considering Water Absorb should be noted.</p> </li> <li> <p><strong>Steel: The boost from Tera Steel makes Steel Beam absurdly powerful, with Analytic letting Choice Specs Magnezone OHKO even offensive Multiscale Dragonite!</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 SpA / 4 SpD / 252 Spe with Modest: Running at least some Speed investment lets Magnezone outspeed critical Pokemon like Azumarill, Corviknight, Skeledirge, and Kingambit. 252 EVs give Magnezone a chance at outspeeding slow Mimikyu, Dragonite, Gholdengo, and Annihilape.</p> </li> <li> <p><strong>188 HP / 252 SpA / 60 Spe with Modest: Magnezone's excellent typing means you often switch it into attacks, especially if you aren’t using Sturdy as an ability. This spread sacrifices some of Magnezone's Speed to raise its capabilities as a pivot. However, reducing the Speed EVs below 60 is not recommended, as it is the minimum required line to outspeed an uninvested Corviknight.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Specs</strong>: Choice Specs gives Magnezone a devastating amount of power, with even Clodsire having trouble handling it.</p> </li> <li> <p><strong>Assault Vest</strong>: The increase in special bulk helps Magnezone against the myriad of choice item special attacking Dragon-types, like Hydreigon and Dragapult.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Analytic: A Magnezone boosted by both Choice Specs and Analytic is incredibly hard to switch into, making it easier for Magnezone to generate momentum.</p> </li> <li> <p><strong>Sturdy</strong>: With Sturdy's guaranteed survivability and Magnezone's high damage output, Magnezone will very likely take down at least one Pokemon per game. Sturdy also helps Magnezone play around Dondozo, as it can safely come in on Fissure and use Volt Switch against it, which renders Yawn moot. However, if Magnezone switches into a Yawn and not Fissure, it should be noted that Dondozo often runs Protect to block Volt Switch and ensure Magnezone falls asleep.</p> </li> <li> <p><strong>Magnet Pull</strong>: Magnet Pull ensures Magnezone can eliminate Corviknight. In the case Magnezone uses Fighting as its Tera Type, Magnet Pull also allows it to beat both Kingambit and Tera Steel Hydreigon with more reliability.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 613881, "username": "Tachipoyo"}]}
  },
  "Rotom-Heat": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {"name": "Defensive", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "},
      {
        "name": "Choice Attacker",
        "description": "<ul> <li> <p>Rotom-H sets itself apart from other Fire-types, with its Ground immunity and Volt Switch pivoting.</p> </li> <li> <p><strong>Trick</strong>: Trick gives Rotom-H an excellent tool against defensive foes, such as Dondozo and Skeledirge.</p> </li> <li> <p><strong>Using a neutral nature with a Timid mint: Make sure to get a Rotom-H with a neutral nature and then use a Timid Mint on it. This way, it can't be confused by any Berries given with Trick.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy</strong>: A Fairy Tera typing with Tera Blast makes Rotom-H much better equipped to handle normally problematic Dragon-types, such as Garchomp, Roaring Moon, and Dragapult.</p> </li> <li> <p><strong>Electric: Electric is an easy Tera type to recommend, as it increases damage output and removes all of Rotom-H's weaknesses.</p> </li> <li> <p><strong>Fire</strong>: When paired with Tera Blast, Rotom-H now has a much more reliable Fire-type STAB move than Overheat, at the cost of retaining several problematic weaknesses.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Scarf</strong>: Choice Scarf lets Rotom-H outspeed normally problematic threats such as Iron Bundle.</p> </li> <li> <p><strong>Choice Specs: The extra power makes Rotom-H far more difficult to wall, with defensive Skeledirge getting 2HKOed by Thunderbolt.</p> </li> </ul> "
      },
      {"name": "Nasty Plot", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Rotom-Wash": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>Rotom-W's Speed, which notably allows it to outpace Gholdengo, access to Volt Switch, and great typing make it an excellent pivot and revenge killer.</p> </li> <li> <p><strong>Trick: If using a Choice Item, Trick is seriously worth considering for its ability to cripple defensive Pokemon such as Garganacl and Dondozo. Make sure Rotom-W is a neutral nature that has had a Timid Mint used on it. This way, Rotom-W can eat any Berry without getting confused.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: When combined with Tera Blast, a Fairy Tera type lets Rotom-W take on Dragon-types such as Dragapult and Roaring Moon far more effectively.</p> </li> <li> <p><strong>Electric: Not only does the damage boost from Tera Electric come in handy, but it also removes any weaknesses Rotom-W has.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Scarf</strong>: Choice Scarf lets Rotom-W outspeed major threats such as Dragapult and Meowscarada.</p> </li> <li> <p><strong>Choice Specs: Choice Specs tends to be safer to Trick than Choice Scarf, and it gives a big power boost.</p> </li> <li> <p><strong>Assault Vest</strong>: Increasing Rotom-W's special bulk gives it a far better matchup against foes like Flutter Mane and Gholdengo.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 SpA / 252 Spe with Timid: Maximizing Rotom-W's Special Attack is part of what makes it an effective revenge killer if using a Choice Item.</p> </li> <li> <p><strong>252 HP / 252 SpA / 4 SpD with Modest</strong>: This spread sacrifices Rotom-W's revenge killing potential, but, in exchange, it makes it a better pivot, and the better bulk makes Rotom-W more suited to finding the right time to cripple a wall with Trick. It's also is the best spread to use on Assault Vest sets.</p> </li> </ul> "
      },
      {
        "name": "Nasty Plot",
        "description": "<ul> <li> <p>With a great typing, ability, and good bulk, Rotom-W makes for an effective user of Nasty Plot.</p> </li> <li> <p><strong>Fairy Tera Blast</strong>: This move is essential for getting past Dragon-types like Dragapult and Roaring Moon. Even when not Terastallized, it's a decent coverage move.</p> </li> <li> <p><strong>Hydro Pump versus Substitute: Hydro Pump is by far Rotom-W's strongest STAB, but it can be worth sacrificing for Substitute, which lets Rotom-W effectively defeat most Garganacl and defensive Dondozo.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Fairy</strong>: With a Fairy Tera type, Rotom-W can turn the tables on its Dragon-type adversaries.</li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Lum Berry: Lum Berry lets Rotom-W easily set up on Hippowdon, and avoid getting put to sleep by Dondozo.</p> </li> <li> <p><strong>Sitrus Berry: If Sleep isn't a big issue, Rotom-W appreciates the burst recovery Sitrus Berry provides.</p> </li> <li> <p><strong>Covert Cloak</strong>: If using Hydro Pump, this is Rotom-W's best way around Garganacl.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 SpA / 252 Spe</strong>: Maximizing Speed with a Timid nature gives Rotom-W the jump on Gholdengo. If Gholdengo isn't an issue, a Modest nature will still outspeed Jolly Breloom.</p> </li> <li> <p><strong>252 HP / 252 SpA / 4 SpD with Modest: Rotom-W's good bulk can be maximized instead of outspeeding Breloom; this spread avoids the 2HKO from Timid Gholdengo's Shadow Ball.</p> </li> </ul> "
      },
      {"name": "Defensive", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Amoonguss": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<ul> <li> <p>With good bulk, a solid defensive typing, and access to Spore, Clear Smog, and Regenerator, Amoonguss is a fantastic support and disruptor option.</p> </li> <li> <p><strong>Clear Smog</strong>: This prevents Amoonguss from getting set up on unless the opponent is Steel-type or has a Substitute up.</p> </li> <li> <p><strong>Hex</strong>: Hex both punishes foes put to sleep by Spore and hits Air Balloon Gholdengo and Flutter Mane.</p> </li> <li> <p><strong>Stomping Tantrum: Stomping Tantrum deals decent damage to Gholdengo and Magnezone.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers: Leftovers gives Amoonguss longevity outside of Synthesis and Regenerator.</p> </li> <li> <p><strong>Black Sludge</strong>: Black Sludge is a great way to get around Item Clause if Leftovers is already in use. Note, if Amoonguss Terastallizes into a type that isn't Poison, it will take damage instead.</p> </li> <li> <p><strong>Sitrus Berry</strong>: Sitrus Berry is an alternative form of recovery, and it can be used regardless of Amoonguss's Tera type.</p> </li> <li> <p><strong>Rocky Helmet</strong>: Rocky Helmet punishes contact moves with residual damage, potentially breaking Focus Sash from foes like Great Tusk in the process.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dark: While Amoonguss doesn't Terastallize often, Dark removes its weakness to Psychic-type attacks and makes Foul Play stronger, at the cost of gaining new weaknesses.</p> </li> <li> <p><strong>Poison</strong>: Poison removes Grass-type weaknesses, but makes Amoonguss weak to Ground-type attacks.</p> </li> <li> <p><strong>Steel</strong>: While it makes Amoonguss weak to Ground- and Fighting-type attacks, it also grants Amoonguss with a plethora of resistances, and it can be a tough Pokemon to break once foes like Breloom are KOed.</p> </li> </ul> "
      },
      {
        "name": "Pivot",
        "description": "<ul> <li> <p>Amoonguss has a great defensive profile, and this set can help it even further with a slow switch to another teammate once per game.</p> </li> <li> <p><strong>Pivoting with Leaf Storm</strong>: After using Leaf Storm, Eject Pack activates and Amoonguss is switched out; however, it can also be activated by other stat drops, such as Intimidate and Special Defense drops from Shadow Ball.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dark</strong>: A Dark Tera type grants a Psychic-type immunity, along with a STAB Foul Play.</p> </li> <li> <p><strong>Poison</strong>: A Poison Tera type removes Amoonguss's Ice-, Fire-, and Flying-type weaknesses; and makes Clear Smog stronger due to its Base Power being increased to 60 along with the bonus STAB; however this increases its vulnerability to Ground-type attacks.</p> </li> <li> <p><strong>Grass</strong>: A Grass Tera type takes advantage of Leaf Storm's high Base Power to make it hit even harder, in addition to now resisting Ground-type attacks from the likes of Garchomp and Great Tusk.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}
  },
  "Haxorus": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/haxorus.3713233/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Mold Breaker Funny Moments Compilation",
        "description": "<ul> <li> <p>With its workable Speed, sky-high Attack stat, and the ever-valuable Mold Breaker, Haxorus is notable as one of the few setup sweepers not bothered by Mimikyu or Unaware.</p> </li> <li> <p>With one Dragon Dance, it can outspeed most unboosted foes, but Choice Scarf users still cause issues, notably Hydreigon and Play Rough Meowscarada.</p> </li> <li> <p>Dragon Claw may be worth using in place of Outrage to avoid locking Haxorus in.</p> </li> <li> <p>Earthquake is extremely valuable on Haxorus due to Mold Breaker nullifying Levitate and Earth Eater, allowing Haxorus to hit foes like Rotom-W and Hydreigon hard without the need to lock into Outrage, and giving it a way to hit Orthworm hard at all</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Life Orb: Life Orb lets Haxorus deal damage much more effectively at the cost of recoil</p> </li> <li> <p><strong>Lum Berry</strong>: Lum Berry lets Haxorus safely set up against a foe that may use crippling status moves such as Will-O-Wisp and Spore.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel</strong>: Steel grants good security against opposing Ice-, Fairy-, and Dragon-types.</p> </li> <li> <p><strong>Fairy</strong>: Fairy maximizes Haxorus's security against opposing Dragon-types, specifically.</p> </li> <li> <p><strong>Electric</strong>: Electric provides a surefire way of dealing with Dondozo thanks to Tera Blast.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality Checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar Checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 505592, "username": "smushedtomato"}]}
  },
  "Hydreigon": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "HARBINGER (Choice Item)",
        "description": "<ul> <li> <p>With access to the incredible Levitate, Hydreigon sets itself apart from Roaring Moon as a dangerous offensive force that effectively utilizes Terastallization.</p> </li> <li> <p><strong>Flamethrower: Flamethrower is useful for hitting Steel-types such as Scizor and otherwise decent Dark Pulse switch-ins like Meowscarada.</p> </li> <li> <p><strong>Flash Cannon: This is Hydreigon’s best option to hit Fairy-types such as Mimikyu and Flutter Mane.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Specs: If your team has another Scarf user, Choice Specs Hydreigon is a nuclear wallbreaker that can pummel unsuspecting teams.</p> </li> <li> <p><strong>Choice Scarf</strong>: Choice Scarf patches up Hydreigon’s somewhat lackluster Speed, allowing it to threaten a wider portion of the metagame with its high-powered attacks.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel</strong>: A Steel Tera type can be used to get around the many Dragon and Fairy-types that try to revenge kill Hydreigon, though it is still vulnerable to Mach Punch from Breloom.</p> </li> <li> <p><strong>Fairy: Tera Fairy has great synergy with Hydreigon's former typing, making it do especially well against Great Tusk.</p> </li> <li> <p><strong>Dark: Tera-boosted Dark Pulse is an absurdly powerful weapon, and when coupled with its flinch rate, Tera Dark Hydreigon can potentially muscle its way out of otherwise hopeless situations.</p> </li> <li> <p><strong>Fire</strong>: Terastallizing into the fire typing will grant Hydreigon a resistance to Fairy-types while removing its weakness to Fighting-types and giving it a good move to hit Steel-types with. However, unlike Tera Steel it does not grant a resistance to Dragon, and it also gives Hydreigon a few new weaknesses.</p> </li> </ul> "
      },
      {
        "name": "Versatile Attacker",
        "description": "<ul> <li> <p>Hydreigon's useful support movepool can add quite a bit of unpredictability to its offensive potential.</p> </li> <li> <p>Note that this Hydreigon is fully capable of running three attacking moves with one support move.</p> </li> <li> <p><strong>Substitute</strong>: Substitute is excellent for scouting Terastallization and punishes common status users such as Yawn Dondozo.</p> </li> <li> <p><strong>Thunder Wave: When Terastallizing Hydreigon, Thunder Wave is often the safest move against other faster Dragon-types that Terastallize, such as Dragapult and Salamence.</p> </li> <li> <p><strong>Taunt: This is good for getting the edge against defensive foes such as Clodsire.</p> </li> <li> <p><strong>Nasty Plot: Nasty Plot makes Hydreigon a surprisingly dangerous sweeper against slower teams.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel</strong>: A Steel Tera type has fantastic synergy with Levitate, helping Hydreigon against Dragon- and Fairy-types without the dreaded Ground weakness.</p> </li> <li> <p><strong>Fairy</strong>: Tera Fairy gives Hydreigon a great matchup against Dragon-types and Great Tusk.</p> </li> <li> <p><strong>Poison: With a Poison Tera type, Hydreigon can do well against Fairy-types without fear of powerful Fighting-type attacks.</p> </li> <li> <p><strong>Dark</strong>: Since so few Pokemon resist Dark-type attacks, this is a good Tera type for cleaning up late game.</p> </li> <li> <p><strong>Fire</strong>: When using Flamethrower, a Fire Tera type is handy for both the Fairy resistance and a better matchup against Kingambit.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers: If using Substitute, Leftovers's extra bit of recovery helps reduce its risk.</p> </li> <li> <p><strong>Life Orb</strong>: A simple power boost still comes in handy, even if only using two attacks.</p> </li> <li> <p><strong>Black Glasses</strong>: If a teammate is already using Life Orb, Black Glasses is a good compromise.</p> </li> </ul> "
      },
      {
        "name": "Stealth Rock Support",
        "description": "<ul> <li> <p>Hydreigon's new access to Stealth Rock makes it a surprisingly effective offensive support Pokemon.</p> </li> <li> <p><strong>Taunt</strong>: Taunt effectively shuts down common support leads like Hippowdon and Clodsire.</p> </li> <li> <p><strong>Thunder Wave: This is a powerful deterrent against offensive foes and can even stop sweepers in emergency situations when used with Focus Sash.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel</strong>: Thanks to Levitate, a Steel Tera type is an incredible defensive typing for Hydreigon, giving it an advantage over Fairy- and Dragon-types.</p> </li> <li> <p><strong>Poison</strong>: Tera Poison is a good alternative to Steel, with fewer resistances but an important Fighting-type resistance.</p> </li> <li> <p><strong>Fairy</strong>: A Fairy Tera type gives Hydreigon the potential to effectively lead against Great Tusk.</p> </li> <li> <p><strong>Dark: If using Life Orb, boosting Dark-type attacks can make for some surprising late-game cleaning.</p> </li> <li> <p><strong>Fire</strong>: Fire-type Hydreigon is better against Kingambit and Fairy-types.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers: If using Taunt, Leftovers is the best choice for giving Hydreigon longevity against defensive foes such as Corviknight.</p> </li> <li> <p><strong>Focus Sash: Focus Sash makes setting up Stealth Rock a much easier task against offensive teams. Be warned that it doesn't stop Dragapult's Dragon Darts.</p> </li> <li> <p><strong>Life Orb: Life Orb lets Hydreigon be played more offensively if setting Stealth Rock isn't needed.</p> </li> <li> <p><strong>Dark Glasses</strong>: Dark Glasses work if a teammate is using Life Orb.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 29010, "username": "Theorymon"}]}
  },
  "Volcarona": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Quiver Dance Sweeper",
        "description": "<ul> <li> <p>Volcarona's access to Quiver Dance makes it a more effective sweeper than Iron Moth.</p> </li> <li> <p><strong>Giga Drain: Giga Drain is the best coverage option for Volcarona, as it helps it deal with Water-type Pokémon, as well as recover a good amount of HP.</p> </li> <li> <p><strong>Water Tera Blast</strong>: Water-type Tera Blast helps Volcarona deal with Pokemon like Skeledirge, Ceruledge, and other Volcarona. Volcarona with Bug Buzz can also be used, as it is a very powerful STAB move and helps Volcarona deal with Hydreigon.</p> </li> <li> <p><strong>Rock Tera Blast: Despite Rock being a poor defensive typing, Tera Rock allows Volcarona to cover Dragonite and Skeledirge with one move.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Water: Terastallizing into the Water typing nullifies Volcarona's most common weakness in Rock-type. Tera Blast damages Hydreigon decently prior to Terastallizing. Water-type Tera Blast is also the best option Volcarona has to hit Skeledirge.</p> </li> <li> <p><strong>Grass</strong>: The Grass typing strengthens Giga Drain and nullifies Volcarona's weakness to Water-types, most notably helping against Dondozo and Rotom-W.</p> </li> <li> <p><strong>Rock: Tera Rock is Volcarona's best bet against Skeledirge and Dragonite, especially with the useful Extreme Speed resistance. When used with Hippowdon's Sand Stream, it also makes Volcarona quite specially bulky.</p> </li> <li> <p><strong>Fire: Terastallizing into Fire typing makes Volcarona's Fire Blast even more powerful.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Heavy-Duty Boots</strong>: It is the best option on Volcarona, as it circumvents its crippling Stealth Rock weakness.</p> </li> <li> <p><strong>Sitrus Berry</strong>: Sitrus Berry helps Volcarona accrue boosts more easily with Quiver Dance and lets it avoid being 2HKOed by Mimikyu and Dragonite.</p> </li> <li> <p><strong>Life Orb: This is the most reliable tool for helping Volcarona sweep in the late-game.</p> </li> </ul> "
      },
      {
        "name": "Bulkarona",
        "description": "<ul> <li> <p>With recovery and massive investments in bulk, Volcarona is capable of setting up multiple Quiver Dances, giving it new opportunities to sweep.</p> </li> <li> <p><strong>Tera Blast</strong>: Even before Terastallization, Tera Blast can come in handy for hitting Roaring Moon and Hydreigon.</p> </li> <li> <p><strong>Giga Drain: Giga Drain is Volcarona's best shot at beating Water-types such as Rotom-W and Palafin; note that Dondozo is not 2HKOed.</p> </li> <li> <p><strong>Will-O-Wisp: Burning foes is great for punishing boosting physical attackers that may Terastallize, such as Kingambit or Roaring Moon.</p> </li> <li> <p><strong>Bug Buzz: This is Volcarona's best tool against foes behind a Substitute, and hits Roaring Moon and Hydreigon hard.</p> </li> <li> <p><strong>Substitute</strong>: Though it can be difficult to fit-in, Substitute allows Volcarona to punish users of status moves, such as sleep moves from Breloom and Toxic from Water Absorb Clodsire.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: A Fairy Tera type lets Volcarona punish foes like Choice Band Dragapult and Roaring Moon, at the cost of being far more vulnerable to Tera Steel Dragons and Kingambit.</p> </li> <li> <p><strong>Water: Besides removing all of Volcarona's old weaknesses, a Water Tera type also 2HKOes Skeledirge with Tera Blast.</p> </li> <li> <p><strong>Grass: With a Grass Tera type, Volcarona can now 2HKO most Dondozo with Giga Drain and is better insulated against Rotom-W revenge kills.</p> </li> <li> <p><strong>Flying</strong>: While a Flying Tera Type isn't a huge help defensively, the immunity to Fissure makes Volcarona better equipped to handle Dondozo.</p> </li> <li> <p><strong>Fire</strong>: A Fire Tera type simply gives Fiery Dance more power, and makes sense if not using Tera Blast.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Heavy-Duty Boots</strong>: Stealth Rock is common enough that this is the safest item for Volcarona to hold.</p> </li> <li> <p><strong>Sitrus Berry</strong>: Sitrus Berry gives Volcarona more durability against teams that lack hazards.</p> </li> <li> <p><strong>Safety Goggles</strong>: This allows Volcarona to handle Spore from Breloom and Amoonguss without Terastallizing.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>244 HP / 196 Def / 68 Spe with Bold: This spread outspeeds Meowscarada after Quiver Dance while maximizing Volcarona's physical bulk.</p> </li> <li> <p><strong>244 HP / 188 Def / 76 Spe with Timid: This spread sacrifices some physical bulk for being able to outspeed Dragapult and Iron Bundle after one Quiver Dance.</p> </li> </ul> "
      },
      {
        "name": "SOLAR FLARE (Choiced Attacker)",
        "description": "<ul> <li> <p>While Iron Moth is the easier to justify Choice Item user, Volcarona is still an extremely powerful at doing this too, and can catch defensive threats off guard with it.</p> </li> <li> <p>** Fiery Dance**: With its high chance to boost Volcarona’s Special Attack, Fiery Dance is a potent cleaning tool.</p> </li> <li> <p><strong>Bug Buzz: Bug Buzz is a good secondary STAB move that allows Volcarona to hit foes hiding behind a substitute.</p> </li> <li> <p><strong>Overheat</strong>: Overheat deals good immediate damage, which can allow Volcarona to muscle past otherwise annoying walls.</p> </li> <li> <p><strong>Giga Drain</strong>: This is Volcarona’s best option to hit Dondozo.</p> </li> <li> <p><strong>Tera Blast: Tera Blast can be used with various Tera types to augment Volcarona’s coverage, helping it get around its somewhat limited movepool.</p> </li> <li> <p><strong>U-turn</strong>: Since Stealth Rock is relatively less common in Battle Stadium Singles, Volcarona can serve as a rather reliable pivot with U-turn.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Specs</strong>: With the extra power offered by Choice Specs, Volcarona becomes even more difficult to wall, even potentially breaking through some resists with its attacks.</p> </li> <li> <p><strong>Choice Scarf</strong>: Choice Scarf Volcarona outspeeds the entire unboosted metagame, allowing it to revenge kill and pivot very effectively.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fire</strong>: A Fire Tera type slightly improves Volcarona’s defensive profile while boosting Fiery Dance and Overheat even further, allowing it to grab some surprising KOs.</p> </li> <li> <p><strong>Fairy</strong>: When paired with Tera Blast, a Fairy Tera type allows Volcarona to better handle the many Dragon-types in the metagame; notably, it is Volcarona's best option for beating Dragonite and Dragapult.</p> </li> <li> <p><strong>Grass: A Grass Tera type allows Volcarona to resist the many Water-type attacks aimed at it and gives it a better chance at breaking past Dondozo.</p> </li> <li> <p><strong>Rock</strong>: Despite the poor defensive typing, Tera Rock allows Volcarona to cover both Dragonite and Skeledirge. When paired with Hippowdon, it also makes revenge killing Volcarona with Special Attackers fairly difficult.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 469498, "username": "luisin"}, {"user_id": 29010, "username": "Theorymon"}, {"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Sylveon": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With its good natural bulk, Sylveon can serve as a potent attacker and decent revenge killer.</p> </li> <li> <p><strong>Tera Blast</strong>Tera Blast serves as a good alternate STAB attack once Sylveon has Terastallized, providing highly valuable coverage against the Steel-types that could otherwise exploit it, like Scizor. It also gets around potential users of Throat Chop before Terastallization, such as Roaring Moon.</p> </li> <li> <p><strong>Psyshock: This is Sylveon's best shot of dealing with Iron Moth.</p> </li> <li> <p><strong>Shadow Ball: Shadow Ball hits foes such as Mimikyu, Flutter Mane, and Gholdengo super effectively, and it means Sylveon does not have to Terastallize to hit Gholdengo for good damage.</p> </li> <li> <p><strong>Quick Attack: Though it is weak, Quick Attack gives valuable priority for picking off weakened threats, and thanks to Pixilate, surprise users of Tera Ghost aren't able to absorb it.</p> </li> <li> <p><strong>Hyper Beam</strong>: Despite the serious risks from the recharge turn, Hyper Beam's extreme power makes it a good filler move.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Assault Vest</strong>: Assault Vest lets even offensive Sylveon be specially resilient.</p> </li> <li> <p><strong>Choice Specs</strong>: With the boost from Choice Specs, Sylveon is a surprisingly potent wallbreaker, making the most out of its many opportunities to switch in.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Def / 252 SpA</strong>: This spread capitalizes on Sylveon's good natural bulk while maximizing its power.</p> </li> <li> <p><strong>4 Def / 252 SpA / 252 Spe</strong>: While no bulk investment makes Sylveon more difficult to safely get in, Speed investment allows it to outrun and threaten a wider range of foes, such as Scizor and Corviknight.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fire: Tera Fire allows Sylveon to break past troublesome Steel-types, like Gholdengo and Kingambit.</p> </li> <li> <p><strong>Fairy: Getting an extra boost on Hyper Voice and Hyper Beam makes Choice Specs Sylveon far more difficult to wall, with even resists such as Gholdengo and physically defensive Skeledirge getting 2HKOed by Hyper Voice!</p> </li> </ul> "
      },
      {
        "name": "CUTESY CRUSADER (Defensive)",
        "description": "<ul> <li> <p>With its good bulk and Special Attack, Sylveon is quite a dangerous threat and is also hard to take down.</p> </li> <li> <p><strong>Tera Blast</strong>: Beyond just Terastallization, Sylveon can optionally use it as its sole attacking move, since Pixilate will make it a Fairy-type attack before Terastallizing.</p> </li> <li> <p><strong>Hyper Voice</strong>: This gives Sylveon a reliable Fairy-type attack even when Terastallized.</p> </li> <li> <p><strong>Wish</strong>: Wish can be used to keep Sylveon healthy, as well as its teammates.</p> </li> <li> <p><strong>Shadow Ball</strong>: Shadow Ball offers important coverage on Gholdengo without demanding that Sylveon Terastallize.</p> </li> <li> <p><strong>Quick Attack Though weak, Quick Attack can be very helpful for finishing off foes that have hung on against Sylveon or its teammates, and thanks to Pixilate, Ghost-types cannot safely switch in to absorb the move.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fire</strong>: A Fire Tera type grants Sylveon resistances to Steel and Fairy, allowing it to take on foes it would otherwise have to run from, such as Gholdengo.</p> </li> <li> <p><strong>Water</strong>: Tera Water is a great mono-attacking option, making it ideal if only running Tera Blast to do decently well against Steel-types.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Mimikyu": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<ul> <li> <p>Thanks to Disguise, Mimikyu is a premier revenge killer and sweeper in Battle Stadium Singles, being particularly apt at revenge killing Flutter Mane with Shadow Sneak.</p> </li> <li> <p><strong>Drain Punch: If using Tera Fighting, Drain Punch is a good coverage move against Steel-types such as Kingambit and Iron Treads.</p> </li> <li> <p><strong>Fire Tera Blast: Tera Blast is a risky option due to making your team commit to Terastallizing Mimikyu, but it can be worth it for muscling through Mimikyu's usual checks, such as Corviknight and Tera Steel Pokemon.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost: The extra damage on Shadow Sneak gives Mimikyu an easier time sweeping late-game.</p> </li> <li> <p><strong>Fighting</strong>: The boosted power of Drain Punch gives Mimikyu a far better matchup against Kingambit.</p> </li> <li> <p><strong>Fairy</strong>: A boosted Play Rough lets Mimikyu clean through weakened bulky Pokemon like Dondozo more easily.</p> </li> <li> <p><strong>Fire: With Tera Blast, Jolly Mimikyu has a 75% chance to OHKO Corviknight after Swords Dance, which means most other Steel-types will have a far more difficult time dealing with Mimikyu.</p> </li> <li> <p><strong>Electric</strong>: While not as effective against Steel-types as Tera Fire, it still deals massive damage to Corviknight, and gives Mimikyu better chip damage to Dondozo.</p> </li> <li> <p><strong>Normal</strong>: Tera Normal doesn't help Mimikyu offensively and makes Mimikyu vulnerable to Mach Punch and Dragon Darts, making it a niche option. However, it does severely punish Dragapult if it uses Phantom Force.</p> </li> </ul> "
      },
      {
        "name": "Curse Stall",
        "description": "<ul> <li> <p>The combination of Curse, Substitute, and Pain Split is devastating against key defensive Pokemon such as Garganacl and Dondozo.</p> </li> <li> <p><strong>Shadow Claw versus Play Rough: Shadow Claw is Mimikyu's best shot at dealing damage to Gholdengo, at the cost of doing poorly against Normal-types. While it will make Mimikyu nearly helpless against Gholdengo, Play Rough lets Mimikyu deal serious damage to Dragon-types and Great Tusk.</p> </li> <li> <p><strong>Taunt: Taunt does an even better job of shutting down defensive foes, but makes Mimikyu totally useless against Gholdengo.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost / Fairy</strong>: Terastallizing this Mimikyu for extra damage output is fairly situational, but getting a bit of extra power can help late game.</p> </li> <li> <p><strong>Flying</strong>: Against common users of Fissure such as Dondozo, this gives Mimikyu a situational way to stall them out more easily while healthy.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Figy Berry</strong>: Figy Berry and it's other counterparts give Mimikyu another method of healing after using Substitute enough times.</p> </li> <li> <p><strong>Bright Powder</strong>: While not particularly reliable, even one miss against Mimikyu can be devestating.</p> </li> </ul> "
      },
      {
        "name": "Trick Scarf",
        "description": "<ul> <li> <p>Mimikyu might seem like an odd user of Choice Scarf with its low offenses, but with Trick and Disguise, it becomes a very disruptive Pokemon against defensive foes like Dondozo and Corviknight.</p> </li> <li> <p><strong>Shadow Sneak: Shadow Sneak is a reasonable option to give Mimikyu priority after using Trick, which is especially helpful against Flutter Mane.</p> </li> <li> <p><strong>Wood Hammer hits Water-types such as Rotom-W and Iron Bundle very hard.</p> </li> <li> <p><strong>Thunder Wave, Will-O-Wisp, and Curse: Thunder Wave, Will-O-Wisp, or Curse let Mimikyu further disrupt Pokemon after using Trick, or can be used as an emergency way to stop a sweeper while still holding Choice Scarf.</p> </li> <li> <p><strong>Using a neutral Nature with a mint</strong>: Mimikyu should have a neutral nature with a Jolly Mint used on it. This way, Mimikyu can't be confused by eating any Berry after using Trick.</p> </li> </ul> <h1>Other Options</h1> <ul> <li><strong>Destiny Bond</strong>: Mimikyu's good Speed makes it a good option for making trades with Destiny Bond.</li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost</strong>: Tera Ghost gives Mimikyu a good chance to OHKO Dragapult with Shadow Claw.</p> </li> <li> <p><strong>Grass: With Wood Hammer being boosted, Mimikyu OHKOes offensive Rotom-W.</p> </li> <li> <p><strong>Normal</strong>: While this makes Mimikyu far more vulnerable to Breloom, it is useful for catching other Ghost-types such as Flutter Mane off guard.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Corviknight": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Pivot Knight",
        "description": "<ul> <li> <p>Corviknight's fantastic typing makes it one of the best pivots in the metagame; it easily gets dangerous teammates such as Hydreigon, Flutter Mane, and Dragapult in.</p> </li> <li> <p><strong>Brave Bird: Brave Bird's damage output generally justifies the recoil.</p> </li> <li> <p><strong>Body Press</strong>: Body Press deals much more damage to Kingambit and Electric-types such as Rotom-W but makes Dragapult and Flutter Mane a problem.</p> </li> <li> <p><strong>Rocky Helmet: This lets Corviknight wear down physical threats more quickly while pivoting.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p>Corviknight's defensive typing is fantastic, so don't Terastallize too hastily and lose to more threats.</p> </li> <li> <p><strong>Dragon</strong>: Dragon and Fairy weaknesses are devastating, but in the late-game, resisting Electric and Fire can give Corviknight new win conditions against old foes such as Rotom-W.</p> </li> <li> <p><strong>Flying</strong>: Boosting Brave Bird's damage output is nice, but the secret to the Flying Tera type is that Corviknight will no longer be vulnerable to Fissure while it uses Roost.</p> </li> <li> <p><strong>Grass</strong>: Grass improves matchups against Rotom-W and Breloom significantly.</p> </li> </ul> "
      },
      {
        "name": "IronPress",
        "description": "<ul> <li> <p>Corviknight stands out as one of the best choices around for a defensive Steel-type, thanks to recovery and Body Press.</p> </li> <li> <p><strong>Taunt</strong>: This lets Corviknight effectively shut down slower defensive Pokemon, such as Dondozo.</p> </li> <li> <p><strong>Iron Head: Iron Head helps Corviknight check Mimikyu more easily, especially if not running Rocky Helmet. It also prevents Corviknight from being walled by Flutter Mane and Dragapult.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p>Corviknight has a fantastic defensive typing, so only Terastallize if you need to win certain matchups, especially since it becomes vulnerable to Toxic.</p> </li> <li> <p><strong>Flying: A Flying Tera type lets Corviknight retain its Flying typing even when using Roost, making it a more reliable check to Fissure users such as Dondozo and Garganacl.</p> </li> <li> <p><strong>Fighting: With a Fighting Tera type, Body Press is easier to sweep with, as long as troublesome Fairy-types such as Mimikyu are removed.</p> </li> <li> <p><strong>Grass</strong>: Tera Grass Corviknight not only handles Rotom-W better, but can set up on Breloom and Brute Bonnet.</p> </li> <li> <p><strong>Dragon: A Dragon Tera type lets Corviknight resist common attacks aimed at it, such as Electric- and Fire-type attacks. However, the new weaknesses to Fairy and Dragon make this a reactive Terastallization.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Rocky Helmet</strong>: The passive damage from Rocky Helmet against Mimikyu gives Corviknight a much easier time using Taunt over Iron Head.</p> </li> <li> <p><strong>Leftovers</strong>: Corviknight tends to stick around, so Leftovers recovery makes sense over a Berry.</p> </li> </ul> "
      },
      {
        "name": "Bulk Up",
        "description": "<ul> <li> <p>With Bulk Up giving an Attack boost, Corviknight is free from having to use Body Press for good damage output.</p> </li> <li> <p><strong>Taunt</strong>: This is highly recommended for shutting down Garganacl and Dondozo.</p> </li> <li> <p><strong>Iron Head: Iron Head is chosen for both reliable damage output and hitting Fairy-types hard.</p> </li> <li> <p><strong>Power Trip</strong>: Power Trip takes several boosts to get powerful, but it's Corviknight's best shot at dealing decent damage to Gholdengo, being able to break its Substitute after Bulk Up. It also makes Corviknight a powerful Baton Pass recipient when using Espathra.</p> </li> <li> <p><strong>Covert Cloak: This makes Corviknight immune to Salt Cure's residual damage, making Corviknight a good check to Garganacl.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p>Remember that most of Corviknight's good Tera types leave it vulnerable to Toxic, so Terastallize carefully.</p> </li> <li> <p><strong>Dark</strong>: While it doesn't help Corviknight much defensively, a Dark Tera type lets it 2HKO 4 HP Gholdengo with Power Trip after one use of Bulk Up.</p> </li> <li> <p><strong>Flying</strong>: This Tera type lets Corviknight retain its Flying typing while using Roost, meaning Fissure users such as Dondozo are much easier to handle.</p> </li> <li> <p><strong>Steel</strong>: A Steel Tera type boosts Iron Head and removes Corviknight's Electric weakness, at the cost of making it vulnerable to Earthquake.</p> </li> <li> <p><strong>Dragon</strong>: Once Fairy- and Dragon-types are out of the way, the Dragon Tera type allows Corviknight to get around Electric- and Fire-type attacks.</p> </li> <li> <p><strong>Grass-type</strong>: A Grass Tera type is Corviknight's best way of setting up on Breloom and handling Rotom-W.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 534158, "username": "Kiby"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 517429, "username": "Adeleine"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Grimmsnarl": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<ul> <li> <p>With Prankster and the movepool to use it, Grimmsnarl is one of the best dual screens setters, as it is useful for setting up dangerous sweepers such as Dragonite or Iron Valiant.</p> </li> <li> <p><strong>Parting Shot: Parting Shot is not only useful for dropping stats, but the pivoting action can let Grimmsnarl come in later to set up screens if it's in a bad matchup.</p> </li> <li> <p><strong>Thunder Wave</strong>: This is a reasonable alternative for crippling fast foes that may be problematic for sweeps.</p> </li> <li> <p><strong>Taunt</strong>: Taunt shuts down phazers and opposing Taunts that could stop the dual screens from being set up.</p> </li> <li> <p><strong>Spirit Break versus Foul Play</strong>: Hitting foes like Great Tusk and Roaring Moon makes Spirit Break a good offensive move. Alternatively, Foul Play is notable for breaking Gholdengo's Substitute and punishing physical setup sweepers.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Grass</strong>: Grimmsnarl should almost never Terastallize, since it's trying to support sweepers rather than deal serious damage on its own. Still, a Grass Tera type is a reasonable choice for blocking Spore from Breloom and Amoonguss.</li> </ul> "
      },
      {"name": "Offensive", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Dragapult": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Physical Attacker",
        "description": "<ul> <li> <p>Dragapult's incredible Speed makes it a very effective hit-and-run attacker.</p> </li> <li> <p><strong>Phantom Force</strong>: This is risky due to the two turns making Dragapult vulnerable to Normal-types and surprise Terastallization, but lack of many strong Ghost-resistant foes makes Phantom Force an effective late-game cleaning move.</p> </li> <li> <p><strong>Shadow Ball</strong>: With a Naive nature, Shadow Ball is an easy way to 2HKO Gholdengo, Flutter Mane, and incoming Skeledirge.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dragon and Ghost: Terastallizing into either of Dragapult's STAB types makes it even more difficult to wall, with Ghost being notable for letting Dragapult use a less risky STAB move in Tera Blast.</p> </li> <li> <p><strong>Fire</strong>: Tera Fire gives a valuable Fairy-type resistance and is a more powerful tool against Steel-types at the cost of a Stealth Rock weakness.</p> </li> <li> <p><strong>Fairy</strong>: Tera Fairy's Dragon-type immunity can help win Tera wars against foes like Garchomp, Great Tusk, and Roaring Moon.</p> </li> <li> <p><strong>Fighting: Tera Fighting vastly improves Dragapult's match-up against Kingambit and Choice Scarf Meowscarada.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Band: Choice Band guarantees that Breloom is OHKOed through its Focus Sash with Dragon Darts.</p> </li> <li> <p><strong>Life Orb: Life Orb makes Sucker Punch a less risky option.</p> </li> <li> <p><strong>Choice Scarf</strong>: This may seem like overkill, but Choice Scarf gives Dragapult the edge over Booster Energy users such as Iron Bundle, Roaring Moon, and Flutter Mane, and other Choice Scarf foes such Gholdengo.</p> </li> </ul> "
      },
      {
        "name": "Dragon Dance",
        "description": "<ul> <li> <p>Despite Dragapult's insane Speed stat, Dragon Dance insulates it from popular revenge killers such as Booster Energy Iron Bundle and Choice Scarf Gholdengo, making it a great sweeper.</p> </li> <li> <p><strong>Phantom Force: Phantom Force's drawback can be an issue when Normal-types are potentially around, but its great coverage still makes it good way to clean teams.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dragon</strong>: Not only does this make Dragon Darts difficult to wall, but it clinches a OHKO on Breloom regardless of the item.</p> </li> <li> <p><strong>Fairy: Tera Fairy makes setting up against Great Tusk and Dragon-types much more feasible.</p> </li> <li> <p><strong>Fire: Not only does this make Fairy-types easier to deal with, but it can help Dragapult sweep through defensive Steel-types such as Corviknight with Tera Blast.</p> </li> <li> <p><strong>Steel: Steel covers a lot of Dragapult's former weaknesses, letting it set up on new foes such as Mimikyu.</p> </li> <li> <p><strong>Ghost: Terastallizing into a Ghost-type gives Dragapult the option for a much more reliable STAB move in Tera Blast, at the cost of not helping it set up against new threats.</p> </li> <li> <p><strong>Fighting</strong>: With Tera Fighting, Kingambit is far less likely to stop Dragapult's sweep.</p> </li> </ul> "
      },
      {
        "name": "Special Attacker",
        "description": "<ul> <li> <p>Despite the lower offensive stat, the higher base power of Dragapult's special attacks makes it a serious threat.</p> </li> <li> <p><strong>Thunderbolt</strong>: Thunderbolt is the recommended coverage move for hitting Corviknight and Dondozo hard.</p> </li> <li> <p><strong>U-turn: Even though it's weak, U-turn is a reasonable consideration for pivoting and breaking Mimikyu's Disguise.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost: The stronger Shadow Ball makes this Dragapult difficult to wall outside of Normal-types and Ghost resistant foes such as Garganacl.</p> </li> <li> <p><strong>Fire: The Fairy-type resistance and powerful Flamethrower can make the Stealth Rock weakness worth it.</p> </li> <li> <p><strong>Fighting</strong>: The resistance to Sucker Punch Tera Fighting provides can be key in stopping Kingambit.</p> </li> <li> <p><strong>Fairy: Tera Fairy improves Dragapult's match-up against other Dragon-types and Great Tusk.</p> </li> <li> <p><strong>Dragon: Tera Dragon makes Draco Meteor nearly impossible to wall without a resistance.</p> </li> </ul> "
      },
      {
        "name": "Bulky Status",
        "description": "<ul> <li> <p>With usable bulk bolstered by Will-O-Wisp, this Dragapult can severely punish its weaker offensive checks.</p> </li> <li> <p><strong>Disable and Substitute</strong>: Disable makes Dragapult rely on Will-O-Wisp for Normal-types, but when combined with Substitute, it defeats Choice-locked foes and those that rely on one specific move to beat Dragapult.</p> </li> <li> <p><strong>Draco Meteor</strong>: Draco Meteor improves Dragapult against other Dragon-types, particularly Hydreigon and itself.</p> </li> <li> <p><strong>Flamethrower: This lets Dragapult deal decent unconditional damage to Steel-types, with Kingambit being the biggest target.</p> </li> <li> <p><strong>Dragon Darts: With a Naive nature, Dragon Darts gives Dragapult a consequence-free Dragon-type attack and decent mixed attacking potential.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy</strong>: With a Fairy Tera type, Dragapult preforms better against most Dragon-types and Knock Off users such as Great Tusk and Iron Valiant.</p> </li> <li> <p><strong>Steel: Steel Tera type is great for general defense and Fairy-types such as Azumarill and Mimikyu.</p> </li> </ul> "
      },
      {
        "name": "Dual Screens",
        "description": "<ul> <li> <p>Dragapult's high Speed combined with Reflect and Light Screen make it an effective dual screens lead.</p> </li> <li> <p><strong>Curse</strong>: Curse reduces Dragapult's HP to get it off the field quickly once it has set up screens. It also forces opponents to use recovery moves or switch out, allowing Dragapult's teammates to get in and set up safely. Curse is Dragapult’s best option to bypass Substitute, Protect, and Mimikyu.</p> </li> <li> <p><strong>Shadow Ball: This breaks Focus Sash, hits Ghosts like Gholdengo and opposing Dragapult that normally threaten it, and breaks Mimikyu's Disguise. Notably Gholdengo stops Curse with Good as Gold, making Dragapult totally helpless against it if it does not carry Shadow Ball.</p> </li> <li> <p><strong>Dragon Darts: Dragon Darts can be used for more power to make Dragapult more self-sufficient when it has to stay on the field, and breaks Focus Sash as well. Its dual-hit nature makes it bypass most Substitutes.</p> </li> <li> <p><strong>Will-O-Wisp</strong>: Will-O-Wisp can be used to cripple physical attackers. In tandem with Reflect, this can be a potent strategy to allow the next Pokemon to set up nearly risk-free.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost / Dragon</strong>: Dragapult, as a screens supporter, should not normally Terastallize, but if you are in a bad spot, Ghost and Dragon power up its STAB move of choice.</p> </li> <li> <p><strong>Steel</strong>: A defensive typing like Steel can allow Dragapult to survive certain moves like Iron Bundle's Ice Beam, boosted Cloyster's Icicle Spear, and boosted Baxcalibur's Glaive Rush and retaliate.</p> </li> <li> <p><strong>Fairy: A Fairy Tera type is useful for enemy Infiltrator Dragapult's Dragon Darts.</p> </li> </ul> <h1>Items</h1> <ul> <li><strong>Focus Sash</strong>: While Light Clay is standard, Focus Sash nearly guarantees setting at least one screen without having to Terastallize, in the event Dragapult leads off against Choice Scarf users like Gholdengo, Hydreigon, and Meowscarada.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 619905, "username": "Anchiceratops"}]}
  },
  "Meowscarada": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "CRITTY CAT",
        "description": "<ul> <li> <p>With its good Attack, Speed, and access to Flower Trick and Knock Off, Meowscarada is a potent cleaner that is also hard to switch into.</p> </li> <li> <p><strong>Flower Trick</strong>: With its guaranteed critical hit, Flower Trick is a dangerous cleaning move once resistances to it have been sufficiently chipped.</p> </li> <li> <p><strong>Trick</strong>: Trick can help Choice-locked sets incapacitate an annoying wall, such as Dondozo or Amoonguss, by locking them into a single move. Make sure to use a neutral nature and use a Jolly Mint on Meowscarada, so it won't get confused by eating any Berry after Trick.</p> </li> <li> <p><strong>Low Kick: Low Kick OHKOs Hydreigon, Roaring Moon, and Kingambit if using Protean.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Protean: Protean’s type-shifting allows Meowscarada to make the most of its colorful movepool, particularly on Choice-locked sets, where the limitation to only changing types once is effectively nullified.</p> </li> <li> <p><strong>Overgrow</strong>: If you intend to make use of a Tera type other than Grass or switch moves often, Overgrow is worth considering, as it allows Meowscarada more flexibility with its moves by not changing type and removing STAB from Flower Trick or Knock Off.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Band</strong>: Choice Band boosted Meowscarada hits incredibly hard, and with its naturally high Speed it can serve as a cleaner and a potential wallbreaker.</p> </li> <li> <p><strong>Choice Scarf</strong>: With the Speed offered via Choice Scarf, Meowscarada can threaten otherwise faster foes, such as Dragapult, potentially putting more pressure on offensive teams.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Grass</strong>: While Terastallizing does override Protean, Tera Grass Meowscarada can be used to power through teams ill-prepared for it. Dual screens teams in particular are especially vulnerable to the sheer power of Choice Band-boosted Tera Grass Flower Trick.</li> </ul> "
      },
      {
        "name": "Focus Sash",
        "description": "<ul> <li> <p>With its good Speed and wide movepool, Meowscarada makes for a potent lead.</p> </li> <li> <p><strong>Sucker Punch</strong>: Sucker Punch allows Meowscarada to better handle foes such as Dragapult and Choice Scarf Gholdengo.</p> </li> <li> <p><strong>Toxic Spikes: Toxic Spikes’s forced passive damage is a great asset for the fast-paced teams Meowscarada generally finds itself on.</p> </li> <li> <p><strong>Taunt</strong>: Thanks to its good Speed, Meowscarada makes particularly excellent use of Taunt, shutting down other entry hazard leads such as Garchomp and Hippowdon.</p> </li> <li> <p><strong>Play Rough: This provides good coverage for Fighting- and Dragon-types that might otherwise pose issues, such as Roaring Moon.</p> </li> <li> <p><strong>Low Kick: Low Kick is worth considering if your team struggles with Kingambit.</p> </li> <li> <p><strong>Overgrow: Since this Meowscarada set aims to be more of a supportive Pokemon, Overgrow is preferred to keep STAB on its attacks after it uses its support moves.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Grass</strong>: When paired with an Overgrow boost, Tera Grass lets Flower Trick deal a huge amount of damage.</p> </li> <li> <p><strong>Fairy</strong>: Tera Fairy eases Meowscarada's matchup against Choice Band Dragapult, who can threaten to KO through Focus Sash via Dragon Darts.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 330577, "username": "Thick Fat Azumarill"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 331519, "username": "CyroGyro"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Skeledirge": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Defensive Gator",
        "description": "<ul> <li> <p>Thanks to instant recovery, Unaware, and the snowballing potential of Torch Song, Skeledirge distinguishes itself as one of the premier physical walls.</p> </li> <li> <p><strong>Will-O-Wisp versus Yawn</strong>: Will-O-Wisp vastly improves Skeledirge's match-up against fearsome physical foes such as Kingambit, while Yawn works exceptionally well with Stealth Rock support.</p> </li> <li> <p><strong>Substitute: Substitute is a good way around status, especially Garganacl's Salt Cure. It also becomes effective when used on Toxic Spikes teams.</p> </li> </ul> <h1>Other Options</h1> <ul> <li> <p><strong>Encore: When paired with Substitute, Skeledirge can seriously punish passive Pokemon, though at a serious cost in coverage.</p> </li> <li> <p><strong>Flame Charge</strong>: Despite Skeledirge's low Speed, stacking Flame Charge boosts can make it difficult to check, though it'll often need multiple boosts to outspeed threats without compromising its bulk.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy</strong>: Terastallizing into the Fairy typing removes Skeledirges glaring weakness to Dark and provides an overall superior defensive typing. It also provides a neutral typing for the inevitable Shadow Balls that will be thrown at Skeledirge. With proper timing, Skeledirge can defeat counters meant to deal with it, most notably Gholdengo and Dragapult.</p> </li> <li> <p><strong>Normal: While Tera Normal isn't fantastic defensively, it lets Skeledirge severely punish attempts from special attacking Ghost-types such as Flutter Mane and Dragapult to check it.</p> </li> <li> <p><strong>Water: A Water Tera type lets Skeledirge take on formerly super effective attacks such as Liquidation, providing a valuable turn to burn the offender. It should be noted that Tera Water tends to be a safer option versus the ubiquitous Gholdengo, as it does not often run Thunderbolt.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers or Sitrus Berry</strong>: The residual recovery helps Skeledirge use Torch Song more freely.</p> </li> <li> <p><strong>Covert Cloak</strong>: Covert Cloak ignores the secondary effects of Salt Cure and Acid Spray, improving Skeledirge's match-up against Garganacl and Bellibolt.</p> </li> </ul> <p><strong>Safety Goggles</strong>: The immunity to Spore Skeledirge gains lets it check Breloom and Brute Bonnet far more effectively.</p> <ul> <li><strong>Heavy-Duty Boots</strong>: This makes Skeledirge less pressured to Terastallize to rid itself of its Stealth Rock weakness. </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 244 Def / 12 Spe with Bold: The EVs are set to maximize physical bulk with just enough Speed to outpace uninvested Corviknight.</p> </li> <li> <p><strong>220 HP / 164 Def / 4 SpA / 108 SpD / 12 Spe with Calm: This EV spread allows both Tera Fairy and Water Skeledirge to avoid a 2HKO from a plethora of offensive threats, such as Modest Gholdengo, Adamant Azumarill, and Choice Specs Dragapult, while still boasting significant physical bulk.</p> </li> </ul> "
      },
      {"name": "Blunder Song", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> <h1>EV Spreads</h1> <ul> <li> <p><strong>164 HP / 180 SpA / 164 Spe with Modest</strong>: This EV spread outspeeds Dragapult after gaining +2 Speed.</p> </li> <li> <p><strong>252 HP / 92 Def / 164 Spe with Bold: This more defensive EV spread outspeeds Dragapult at +2 Speed.</p> </li> </ul> "},
      {"name": "Offensive Gator", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 62165, "username": "StarkGod"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 62165, "username": "StarkGod"}]}
  },
  "Quaquaval": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Bulky",
        "description": "<ul> <li> <p>While Quaquaval's bulk is only serviceable, having both Roost and a great support movepool makes it a reasonable defensive option that does particularly well against Kingambit.</p> </li> <li> <p><strong>Taunt and Bulk Up: Taunt pairs particularly well with Bulk Up, letting it set up on surprising foes such as Corviknight.</p> </li> <li> <p><strong>Substitute: Substitute lets Quaquaval stall out OHKO moves from the likes of Dondozo, and it protects it from Garganacl's Salt Cure.</p> </li> <li> <p><strong>Encore: Not only does Encore give Quaquaval new chances to set up, but it also punishes passive play from Unaware walls such as Skeledirge.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: While it has very little defensive synergy with Quaquaval's previous typing, Tera Flying lets Quaquaval effectively stall out Dondozo if using Taunt, or Substitute and Encore together.</p> </li> <li> <p><strong>Grass</strong>: Tera Grass makes Quaquaval's match-up against Rotom-W much smoother.</p> </li> <li> <p><strong>Steel: Tera Steel gives Quauqaval a better matchup against Flutter Mane and Iron Bundle, who can be fairly problematic otherwise.</p> </li> <li> <p><strong>Fairy: With a Fairy Tera type, Quaquaval can set up against most defensive Garchomp thanks to the Dragon Tail immunity.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Rocky Helmet: Rocky Helmet pairs well with Taunt and Tera Flying, letting Quaquaval easily play around Dondozo and Corviknight while setting up Bulk Up.</p> </li> <li> <p><strong>Covert Cloak</strong>: If running Substitute isn't possible, Covert Cloak is Quaquaval's best shot at defeating Garganacl.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 156 SpD / 100 Spe with Jolly</strong>: This EV spread allows Quaquaval to outspeed Meowscarada while raising its special bulk. If not using Bulk Up, running Defense EVs is also viable instead.</p> </li> <li> <p><strong>244 HP / 4 Atk / 76 Def / 116 SpD / 68 Spe with Careful: The Special Defense investment and Careful nature let Quaquaval survive Choice Specs Hydreigon's Draco Meteor at full health, and the Speed lets it outspeed Garchomp after Aqua Step. The Defense investment lets Quaquaval avoid a 2HKO from Tera Dark Black Glasses Kingambit with one Supreme Overlord boost.</p> </li> <li> <p><strong>252 HP / 4 Def / 252 Spe with Jolly: Maximizing Speed ensures that Quaquaval outspeeds Choice Scarf Gholdengo, Iron Bundle, Flutter Mane, and Dragapult after using Aqua Step.</p> </li> </ul> "
      },
      {
        "name": "Moxie Sweeper",
        "description": "<ul> <li> <p>Aqua Step and Moxie give Quaquaval a niche as a late-game sweeper that doesn't always need a turn of setup.</p> </li> <li> <p><strong>Ice Spinner</strong>: This is Quaquaval's best way of dealing big damage to Dragonite and Garchomp.</p> </li> <li> <p><strong>Encore: Encore lets Quaquaval punish slower foes such as Corviknight by getting an easy setup opportunity.</p> </li> <li> <p><strong>Roost: Recovery might seem odd on such an offensive Pokemon, but it helps Quaquaval avoid getting worn down against bulkier teams.</p> </li> <li> <p><strong>Aqua Jet</strong>: Aqua Jet's ability to pick off weakened threats pairs very well with Moxie, giving it new potential win conditions.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Water</strong>: Boosting Aqua Step's power opens up new sweeping chances late-game.</p> </li> <li> <p><strong>Electric</strong>: Tera Electric lets Quaquaval deal massive damage to Azumarill and wear down Dondozo switch-ins with Tera Blast.</p> </li> <li> <p><strong>Grass: Tera Grass lets Quaquaval potentially set up against would-be checks such as Rotom-W.</p> </li> <li> <p><strong>Fire: With Tera Fire, Quaquaval can get around Will-O-Wisp.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Life Orb</strong>: The power increase makes sweeping with Aqua Step easier, especially against bulkier foes.</p> </li> <li> <p><strong>Focus Sash</strong>: With Focus Sash, Quaquaval trades potential wallbreaking for getting surprise sweeps against more offensive teams.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Lokix": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/lokix.3713436/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Tinted Offense",
        "description": "<ul> <li> <p>The combination of First Impression and Tinted Lens make Lokix one of the most threatening revenge killers in the format, able to outprioritize and KO foes regardless of resistance.</p> </li> <li> <p>First Impression is Lokix's most important attack, but it can only be used as the first attack after it switches in.</p> </li> <li> <p>U-turn can be punishing against offensive and slow teams as the lack of resists means Lokix can keep switching in and dealing big damage with First Impression, at the cost of making it vulnerable to hazards.</p> </li> <li> <p>Leech Life is the strongest Bug-type move Lokix learns outside of First Impression, with the added benefit of healing recoil damage.</p> </li> <li> <p>Sucker Punch is a powerful STAB priority move, enabling Lokix to outprioritize foes even after it has used First Impression.</p> </li> <li> <p>Axe Kick is the only coverage move of note in Lokix's moveset due to its high Base Power. Be wary of the low accuracy and recoil that occurs should it miss.</p> </li> <li> <p>Throat Chop is the most powerful Dark-type move Lokix learns. It also has the side benefit of disabling Roar from Hippowdon and Hyper Voice from Sylveon.</p> </li> <li> <p>Swords Dance is an option to make Lokix a sweeper instead of a revenge killer.</p> </li> </ul> <h1>Items</h1> <p><strong>Life Orb</strong>: Life Orb enables easier revenge kills at the cost of recoil.</p> <p><strong>Silver Powder</strong>: Silver Powder raises the power of First Impression without the recoil from Life Orb, and it also frees up Life Orb for a teammate to use instead.</p> <h1>Tera Types</h1> <p><strong>Bug</strong>: A Bug Tera Type increases the damage of First Impression, allowing Lokix to OHKO foes it could not otherwise, such as Dragapult.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality Checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 11020, "username": "Blackbeltsam"}]}
  },
  "Pawmot": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<ul> <li> <p>Pawmot separates itself from Iron Hands by having an excellent support movepool and a good Speed tier.</p> </li> <li> <p><strong>Double Shock and Close Combat: Double Shock and Close Combat are its most important attacks, but note that it can only use Double Shock once without Terastallizing. Once Terastillized, Pawmot you can use Double Shock continuously for big damage, even on foes that resist it.</p> </li> <li> <p><strong>Mach Punch</strong>: Priority allows Pawmot to revenge kill better, hitting Meowscarada, Roaring Moon, and Iron Bundle super effectively.</p> </li> <li> <p><strong>Ice Punch: Ice Punch gives Pawmot coverage against Ground-types, most notably Clodsire and Garchomp, in addition to hitting Dragapult for lots of damage.</p> </li> <li> <p><strong>Revival Blessing: Revival Blessing's one shot of reviving a teammate give Pawmot an extremely unique niche in turning battles around, though it doesn't fit all offensive teams.</p> </li> <li> <p><strong>Nuzzle</strong> This is notably one of the few ways to inflict paralysis on Gholdengo. Nuzzle is best when used with a Focus Sash, as Pawmot can paralyze the foe and outspeed it the next turn, getting another move off before it faints.</p> </li> <li> <p><strong>Encore: Encore does a great job of punishing passive play, and prevents easy setup from slower defensive foes such as Garganacl.</p> </li> </ul> <h1>Other Options</h1> <ul> <li><strong>Fake Out</strong>: This can be used to get an edge against common Focus Sash leads such as Meowscarada.</li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Iron Fist: This boosts the power of Mach Punch and Ice Punch, giving Pawmot more powerful priority and coverage.</p> </li> <li> <p><strong>Volt Absorb</strong>: Volt Absorb's Electric immunity stops Magnezone, Rotom-W, and Rotom-H from using Volt Switch to create safe switch-ins.</p> </li> <li> <p><strong>Natural Cure: This allows Pawmot to take status moves more freely, such as Yawn from Dondozo or Will-O-Wisp from Skeledirge.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Life Orb: Life Orbs enables easier revenge kills at the cost of recoil.</p> </li> <li> <p><strong>Focus Sash</strong>: Focus Sash trades the damage boost from the other items for better opportunities to use support moves.</p> </li> <li> <p><strong>Magnet</strong>: Magnet will power up Double Shock without the recoil from Life Orb, and it also frees up Life Orb for a teammate to use instead.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Electric</strong>: An Electric Tera Type allows Pawmot to continuously use Double Shock, making it an effective late-game cleaner.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality Checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 11020, "username": "Blackbeltsam"}]}
  },
  "Garganacl": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<ul> <li> <p>With Purifying Salt making it immune to status and Salt Cure providing useful chip damage, especially against Water- and Steel-types, Garganacl is a dangerous defensive setup Pokemon.</p> </li> <li> <p><strong>Iron Defense and Body Press</strong>: Body Press is the best option for consistency against offensive teams.</p> </li> <li> <p><strong>Fissure</strong>: Fissure severely punishes passive play against Garganacl, at the cost of forcing it to rely on Salt Cure residual damage against offensive teams.</p> </li> <li> <p><strong>Curse and Earthquake</strong>: While Curse is slower to set up than Iron Defense, it can be paired with Earthquake to potentially defeat Substitute Gholdengo.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: A Flying typing lets Garganacl take on new foes such as Great Tusk, Garchomp, Breloom, and Brute Bonnet.</p> </li> <li> <p><strong>Ghost: A Ghost Tera type gives Garganacl an immunity to Body Press, giving it the edge against Corviknight and opposing Garganacl, especially when paired with Leftovers. Note that Curse will no longer boost Garganacl's stats when Terastallized.</p> </li> <li> <p><strong>Water: Tera Water vastly improves Garganacl's chances of defeating Gholdengo, thanks to the Make It Rain resist.</p> </li> <li> <p><strong>Steel</strong>: Terastallizing into a Steel-type stops Amoonguss from clearing its boosts with Clear Smog and makes Garganacl a decent check to Fairy-types such as offensive Mimikyu and Substitute + Calm Mind Flutter Mane.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 SpD / 4 Spe with Careful: If using Tera Flying Garganacl, maximizing Special Defense is the best choice for easier setup.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe with Impish</strong>: In addition to powering up Body Press, a focus on Defense makes setting up on powerful setup sweepers such as Dragonite an easier task.</p> </li> <li> <p><strong>252 HP / 84 Def / 172 SpD with Careful: This EV spread allows Tera Steel Garganacl to avoid a 2HKO from Breloom's Mach Punch after Iron Defense.</p> </li> </ul> "
      },
      {
        "name": "Salty Stall",
        "description": "<ul> <li> <p>With some entry hazard support, this Garganacl can be very difficult to outstall, thanks to the constant passive damage from Salt Cure.</p> </li> <li> <p><strong>Protect</strong>: Not only does Protect scout for surprise Tera types, but it also goes well with the passive healing from Leftovers.</p> </li> <li> <p><strong>Substitute</strong>: This makes Garganacl even more difficult to properly switch into, providing protection against Trick, OHKO moves, and opposing Salt Cure.</p> </li> <li> <p><strong>Fissure</strong>: Garganacl's great bulk makes it a prime candidate for fishing with Fissure itself, though its low PP can be an issue in mirror matches.</p> </li> <li> <p><strong>Stealth Rock</strong>: Since this set benefits so much from Stealth Rock support, running it on its own is a reasonable sacrifice if Garganacl needs to be more self-sufficient.</p> </li> </ul> <h1>Other Options</h1> <ul> <li><strong>Fling with Light Ball, Toxic Orb, or Flame Orb</strong>: Although the loss of Leftovers can be a huge blow for Garganacl, Fling and its associated status inducing items can be a devastating surprise for some of its offensive checks, such as Great Tusk.</li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying</strong>: Tera Flying gets rid of the Ground and Fighting weaknesses, giving it a far better chance of beating Great Tusk and Garchomp. It also makes Fissure no longer an issue. </li> <li> <p><strong>Ghost: While removing Purifying Salt's Ghost resistance is a shame, Tera Ghost does wonderfully against Corviknight, Great Tusk, and opposing Garganacl due to the Body Press immunity.</p> </li> <li> <p><strong>Fairy: Tera Fairy makes taking on powerful Dragon-types such as Garchomp and Roaring Moon an easier task.</p> </li> <li> <p><strong>Steel: Tera Steel gives Garganacl a better matchup against Gholdengo and Flutter Mane.</p> </li> <li> <p><strong>Grass: Tera Grass gives Garganacl a much easier time against Rotom-W and Palafin-H.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 330577, "username": "Thick Fat Azumarill"}, {"user_id": 534158, "username": "Kiby"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Armarouge": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Expanding Force",
        "description": "<ul> <li> <p>Armarouge's combination of powerful STAB moves, excellent coverage, Weak Armor, and Psychic Terrain makes it strong candidate to use Focus Sash.</p> </li> <li> <p><strong>Psychic Terrain</strong> Psychic Terrain is a powerful setup move for Armarouge thanks to Expanding Force; it also protects Armarouge from priority moves after Weak Armor triggers.</p> </li> <li> <p><strong>Expanding Force</strong>: Expanding Force under Psychic Terrain, especially with Tera Psychic, is a devastatingly powerful move.</p> </li> <li> <p><strong>Armor Cannon</strong>: This helps Armarouge defeat Steel-types that resist Expanding Force.</p> </li> <li> <p><strong>Aura Sphere</strong>: Aura Sphere is excellent coverage against the Dark-types.</p> </li> <li> <p><strong>Destiny Bond</strong>: This is a good alternative to forcefully take down threats that Armarouge can’t easily KO.</p> </li> <li> <p><strong>Energy Ball</strong>: Energy Ball hits the specially defensive Water-types Armarouge might struggle to defeat otherwise, most notably Gastrodon.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Psychic: With a boost from Tera Psychic, Expanding Force OHKOes even relatively bulky foes such as Garchomp and Flutter Mane. With Stealth Rock, Expanding Force still achieves most notable KOs without Tera Psychic, but the extra damage is still appreciated.</p> </li> <li> <p><strong>Fighting: In cases where setting up Psychic Terrain proves to be more difficult, Tera Fighting provides a useful resistance to Sucker Punch and powers up Aura Sphere.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 613881, "username": "Tachipoyo"}]}
  },
  "Ceruledge": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Bulk Up Sweeper",
        "description": "<ul> <li> <p>Bulk Up Ceruledge makes excellent use of both its respectable bulk and Bitter Blade's high recovery. By changing its typing to a more defense oriented one, while maintaining the Fire immunity thanks to Flash Fire, Ceruledge can set up Bulk Ups on a variety of common Pokemon, ranging from Corviknight, Kingambit, Azumarill and Gholdengo.</p> </li> <li> <p><strong>Taunt: Taunt lets Ceruledge set up Bulk Up without needing to fear common phasing moves (with the exception of attacking moves such as Dragon Tail), as well as opposing setup moves such opposing Bulk Up and Iron Defense, provided you outspeed.</p> </li> <li> <p><strong>Shadow Sneak</strong> Priority of some form is always nice to have on a Pokemon, which makes Shadow Sneak an easy contender for the last move. Gaining extra added strength against Pokemon such as Flutter Mane, Dragapult and Annihilape is certainly charming.</p> </li> <li> <p><strong>Grass Tera Blast: This allows Ceruledge to eliminate Dondozo more quickly. While Taunt can shut down Dondozo's Yawn, it cannot shut down Fissure. The only way to beat Dondozo would be to eliminate it as quickly as possibly, which Grass Tera Blast aids with.</p> </li> <li> <p><strong>Flame Charge: Flame Charge provides Ceruledge an extra net of safety against potential Scarf users and Annihilape, who are capable of turning the tides against it. While normally, Ceruledge is prone to faster Taunt + Bulk Up users and Scarfed Trick, Flame Charge helps mitigate both of those weaknesses.</p> </li> <li> <p><strong>Will-O-Wisp</strong>: Ceruledge can be a status spreader in games where it can't set up as easily. It also helps Ceruledge set up more easily against threats such as Unaware Clodsire.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: Tera Fairy helps Ceruledge's matchup against prominent Dark-types such as Roaring Moon and Hydreigon.</p> </li> <li> <p><strong>Grass: An immunity to Spore and a resistance to Water makes Grass the most notable Tera type for this set. Flash Fire eliminating one of Grass's many weaknesses is also noteworthy.</p> </li> <li> <p><strong>Fire</strong>: Increasing Bitter Blade's power will always be a valuable trait. Eliminating Ghost's weaknesses to Ghost and Dark also allows Ceruledge to set up more comfortably.</p> </li> <li> <p><strong>Bug</strong>: Tera Bug is similar to Tera Grass, but in exchange for losing the Water resistance and maintaining the Rock weakness of Fire / Ghost, Ceruledge can tank Volcarona's Bug Buzz with significantly more ease.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 Def with Impish: Investing into Defense prepares Ceruledge and its mediocre physical bulk for the physical-biased metagame. Bulk Up will boost its Defense, but it can struggle to take some physical hits even after a boost, and its special bulk is naturally high.</p> </li> <li> <p><strong>252 HP / 252 Spe with Jolly</strong>: A faster spread helps Ceruledge outspeed other Bulk Up users, like Annihilape opting to invest in bulk. Being faster, more often than not, lets Ceruledge win these matchups with ease.</p> </li> <li> <p><strong>252 HP / 252 SpD with Careful</strong>: While most threats in the metagame at the moment are physical, a specially defensive spread is still noteworthy for its ability to surprise Hydreigon.</p> </li> </ul> "
      },
      {
        "name": "Focus Sash Attacker",
        "description": "<ul> <li> <p>With a stellar offensive typing, a unique set of attacks, Weak Armor allowing it to outspeed a large part of the metagame, and its immunity to Extreme Speed and Mach Punch, Ceruledge proves itself to be a very solid Focus Sash option.</p> </li> <li> <p><strong>Bitter Blade</strong>: Bitter Blade's recovery can make Focus Sash usable even if entry hazards chip it. If Ceruledge is brought down to 1 HP, a +2 Bitter Blade can heal it to the point that it can tank an extra attack.</p> </li> <li> <p><strong>Close Combat versus Shadow Claw</strong>: Close Combat hits the Normal-, Dark-, and Rock-types that resist Ceruledge's STAB combination. Still, Shadow Claw is a noteworthy choice to guarantee the KO on Mimikyu and let Ceruledge pressure Skeledirge. Note, however, that maximum Defense Skeledirge can recover more than Shadow Claw's damage, barring critical hits, and a Terastallized Skeledirge can completely wall this set.</p> </li> <li> <p><strong>Swords Dance versus Destiny Bond: As powerful as Swords Dance boosted attacks from Ceruledge are, the abundance of Unaware Pokemon, primarily Dondozo, has made some players opt to use Destiny Bond to attempt Dondozo—makes Destiny Bond viable to snag surprise kills. KOs. Destiny Bond can also make the matchup against KOing common Sucker Punch Pokemon, such as Meowscarada and Kingambit, easier to win without having to rely on predictions. less prediction reliant.</p> </li> <li> <p><strong>Adamant versus Jolly: Adamant's added damage output is valuable, but Jolly allows Ceruledge to outspeed non-Scarf Gholdengo, and gives it a chance at outspeeding Modest Rotom formes and Glimmora. All of the mentioned examples are Special Attackers, meaning Ceruledge's Weak Armor often does not trigger in these matchups.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fire: Giving Bitter Blade an extra push in damage is quite useful, giving Ceruledge more recovery.</p> </li> <li> <p><strong>Normal</strong>: Normal is an exceedingly common Tera Type on Ghost types due to the immunity it brings to the table. Ceruledge makes particularly excellent use of Normal Tera by resisting both Steel and Fairy, making it very difficult for Gholdengo and Mimikyu to click anything other than a Ghost type move when facing off against Ceruledge.</p> </li> <li> <p><strong>Fighting</strong>: Giving extra reach pwer to Close Combat, a powerful option against Pokemon such as Hydreigon, makes Fighting a solid choice for a Tera Type.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 613881, "username": "Tachipoyo"}]}
  },
  "Bellibolt": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Fat Bellibolt",
        "description": "<ul> <li> <p>Bellibolt's stats allow it to be deceptively bulky, and a pure Electric typing is not terrible on a defensive Pokemon with reliable recovery and pivoting.</p> </li> <li> <p><strong>Parabolic Charge</strong>: Parabolic Charge gives Bellibolt a more constant stream of recovery, though it is much less punishing than Discharge.</p> </li> <li> <p><strong>Volt Switch</strong>: Volt Switch maintains initiative when predicting switches after bringing Bellibolt in on something that it walls, such as defensive Gholdengo or Corviknight.</p> </li> <li> <p><strong>Chilling Water: Chilling Water punishes Garchomp and Hippowdon on the switch-in.</p> </li> <li> <p><strong>Thunder Wave: This disrupts opponents if Bellibolt doesn't have Discharge.</p> </li> <li> <p><strong>Fairy Tera Blast</strong>: Tera Blast hits common Dragon-types such as Garchomp and Baxcaliber after Terastallizing into the Fairy typing.</p> </li> <li> <p><strong>Soak</strong>: Soak catches Electric resistant foes on the switch-in and forces them to either switch out or Terastallize early, with major targets including Garchomp and Baxcalibur.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Grass: Terastallizing into the Grass typing flips the matchup against Ground-types on its head, turning their attacks from super effective into a resisted hit while still charging Bellibolt's next Electric hit; this allows Bellibolt to wall Hippowdon and Garchomp and absorb Spores vs Breloom and Amoonguss, effectively walling them as well.</p> </li> <li> <p><strong>Fairy: A Fairy Tera type comfortably walls Dragon-types, removing a lot of their offensive pressure.</p> </li> <li> <p><strong>Water</strong>: Water is just generally good to have as a defensive Tera type. It also gives Bellibolt STAB on Chilling Water for slightly more damage.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li><strong>228 HP / 244 Def / 4 SpA / 4 SpD / 28 Spe</strong>: This EV spread allows Bellibolt to live two Glaive Rushes from Adamant Baxcalibur if it is not in a position to Terastallize. The physical bulk lets Bellibolt always survive Life Orb Garchomp's Earthquake, and after Terastallization into a neutral type, it becomes a 3HKO. 28 Speed EVs allow Bellibolt to outspeed 4 Speed Hippowdon.</li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers</strong>: Leftovers provides long term passive recovery alongside Slack Off, which can make Bellibolt very difficult to remove. Leftovers also removes any chance of a 2HKO from powerful physical threats such as Baxcalibur.</p> </li> <li> <p><strong>Sitrus Berry</strong>: A short-term HP booster that effectively gives Bellibolt 125% HP, making it a good back-up option if Leftovers is already in use.</p> </li> <li> <p><strong>Rocky Helmet</strong>: Rocky Helmet Bellibolt can switch into and punish physical attackers in a more passive manner; the chip damage can also break Focus Sash and weaken things into range of Electromorphosis-boosted attacks.</p> </li> </ul> "
      },
      {
        "name": "Tactical Bellibolt",
        "description": "<ul> <li> <p>Bellibolt can be quite unassuming, and specially offensive Pokemon such as Hydreigon and Rotom may see it as a free opportunity to get into position. Assault Vest turns the tides against them with Electromorphosis + Parabolic Charge, which makes Bellibolt seem impossible to remove for certain Pokemon. It's also a decent check against Iron Bundle.</p> </li> <li> <p><strong>Grass or Fairy Tera Blast: Tera Blast is important coverage to have; with a Fairy Tera type, Bellibolt reliably checks non-Tera Steel Dragons.</p> </li> <li> <p><strong>Muddy Water versus Chilling Water</strong>: Muddy Water should be used with Tera Electric for much-needed coverage. Alternatively, Chilling Water weakens common switch-ins such as Garchomp and Baxcalibur, allowing you to reposition your team more safely.</p> </li> <li> <p><strong>Acid Spray: This threatens non-Steel type switch-ins and also allows Bellibolt to effectively use it’s ability without having to take damage first. Its also a powerful tool against Unaware walls such as Skeledirge.</p> </li> <li> <p><strong>Sucker Punch: While weak, Sucker Punch catches Focus Sash Pokemon and/or deals chip damage on turns where Bellibolt is guaranteed to go down.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy-type</strong>: Fairy Tera Bellibolt offensively checks big threats like Roaring Moon and Dragapult by walling their non-Tera sets and nabbing surprise KOes.</p> </li> <li> <p><strong>Grass-type: Grass Tera Bellibolt can stay in versus common Pokemon such as Hippowdon can Breloom, sponge their attacks, and either chunk them or survive and reposition.</p> </li> <li> <p><strong>Electric-type: Maximizing Parabolic Charge damage is a viable option.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li><strong>228 HP / 28 Def / 180 SpA / 44 SpD / 28 Spe</strong>: This spread is to avoid the 2HKO from Timid Choice Specs Rotom-W and Hydreigon's Hydro Pump and Draco Meteor, respectively. 28 Speed EVs allow Bellibolt to outspeed 4 Speed Hippowdon. 28 Defense EVs are enough for Bellibolt to survive Focus Sash Garchomp's Earthquake, which notably becomes a 3HKO if Bellibolt Terastallizes into into a typing without a weakness to Ground.</li> </ul> "
      },
      {
        "name": "Bespectacled Bellibolt",
        "description": "<ul> <li> <p>With such good natural bulk, Bellibolt can easily survive hits from common threats and nab surprise KO's in return with a cheeky Choice Specs set.</p> </li> <li> <p><strong>Discharge / Thunderbolt</strong>: Discharge or Thunderbolt is the preferred primary STAB move, as either one takes advantage of Choice Specs more than Parabolic Charge. With an Electromorphosis boost, Bellibolt can 2HKO common switch-ins without having to Terastallize, like Dragapult.</p> </li> <li> <p><strong>Fairy Tera Blast: Tera Blast is important for coverage; with a Fairy typing you reliably check non-Tera Steel Dragons. Muddy Water should be used with Tera Electric.</p> </li> <li> <p><strong>Muddy Water versus Parabolic Charge</strong>: Muddy Water lets Bellibolt win the one-on-one against Hippowdon. Parabolic Charge should be used if run Tera Electric with Muddy Water already available in a different moveslot.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy-type: Tera Fairy let Bellibolt turn the tables on bulky Dragon-types such as Baxcalibur and Roaring Moon by scoring a surprise KO on a potential setup attempt.</p> </li> <li> <p><strong>Grass-type: Tera Grass turns Bellibolt's only weakness into a resistance and gets surprise OHKOs on threats such as physically defensive Hippowdon.</p> </li> <li> <p><strong>Electric-type</strong>: Tera Electric + Choice Specs turns Bellibolt into an offensive behemoth, and with an Electromorphosis boost it can OHKO resists like Dragapult, Hydreigon, and specially defensive Garganacl.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li><strong>228 HP / 28 Def / 196 SpA / 28 SpD / 28 Spe</strong>: This EV spread allows Bellibolt to survive Choice Specs Draco Meteor from Hydreigon and Earthquake from Focus Sash Garchomp; Garchomp's Earthquake becomes a 3HKO if Bellibolt Terastallizes into a typing without a weakness to Ground. The Speed EVs outspeed 4 Speed Hippowdon, while the SpA EVs are enough to OHKO physically defensive Hippowdon with Muddy Water.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 265677, "username": "Butch Hardnight"}]}
  },
  "Scovillain": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Sun Attacker",
        "description": "<ul> <li> <p>Tera Fire Scovillain's damage under sun is absurd, managing to barely KO even Fire-resistant targets. Most notably, its ability to defeat most Pokemon, even powerful Dragon-types, without fearing surprise Terastallizations makes Scovillain a charming offensive option.</p> </li> <li> <p><strong>Overheat and Fire Blast</strong>: Overheat combined with Tera Fire and Choice Specs guarantees the KO on Garchomp  without bulk EVs, and OHKO offensive Roaring Moon after Stealth Rock damage. Against the frailer Dragapult, Tera Fire and Fire Blast is enough to earn the KO. It's recommended to run both Fire STAB moves because Overheat's added damage can be necessary to guarantee certain KOs, but its stat drop can be fatal.</p> </li> <li> <p><strong>Solar Beam versus Leaf Storm: Solar Beam nails the few bulky Water-types that can survive Scovillain's absurd attacks, most notable examples being notably Gastrodon and Assault Vest Azumarill. However, Leaf Storm can be used in its stead for the ability to OHKO Hippowdon, despite it summoning sand.</p> </li> <li> <p><strong>Flamethrower: Flamethrower is perfectly accurateand is typically more than enough to nip off frailer foes.</p> </li> <li> <p><strong>Substitute</strong>: In spite of the type matchup, Scovillain is deceptively weak to Kingambit thanks to Sucker Punch. Additionally, many Pokemon will use Protect in front of Scovillain to waste sun turns— most notably Espathra and Dondozo. Against all of these foes, a well-timed Substitute can guarantee the win.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fire: It is almost mandatory to run Tera Fire on this Scovillain set. Tera Fire guarantees KOs on most Dragon-types.</p> </li> <li> <p><strong>Ghost</strong>: The abundantly common Dragonite is incredibly strong against Scovillain. Should Stealth Rock support be deemed enough to let Scovillain sweep teams reasonably, even without Tera Fire, using Tera Ghost to gain an immunity to Extreme Speed can be very useful.</p> </li> <li> <p><strong>Rock: Tera Rock with Tera Blast can be a decent alternative to Tera Fire, as it gives Scovillain excellent coverage and also provides a much-needed countermeasure to Dragonite's Extreme Speed.</p> </li> </ul> "
      },
      {
        "name": "Moody Ace",
        "description": "<ul> <li> <p>The metagame's abundance of Unaware Pokemon makes it difficult to maneuver Moody Pokemon in general. On top of that, Scovillain is held back by the powerful Dragon-types that resist its STAB combination. However, Scovillain still carves a niche for itself by being the only Moody Pokemon with excellent recovery moves, Leech Seed and Ingrain, allowing it to win a variety of matchups.</p> </li> <li> <p><strong>Protect and Substitute</strong>: Protect and Substitute are mandatory to get the most opportunities to activate Moody. Once you gain enough Defense or Special Defense boosts that Scovillain's Substitute can tank an attack without breaking, it tends to be easy to win the game. Note, however, that Protect, Substitute, and Leftovers's animation make Scovillain very vulnerable to losing via timer.</p> </li> <li> <p><strong>Flamethrower</strong>: With enough Moody boosts, Scovillain's Flamethrower tends to be enough to break through an entire team. There are very few Pokemon that are immune or quadruply resistant to Fire, and Flamethrower has good PP and accuracy, which makes it an easy pick.</p> </li> <li> <p><strong>Giga Drain</strong>: Unlike Flamethrower, Giga Drain gets shrugged off by a lot of Pokemon, even at +6, notably Corviknight and Dragonite. However, an attacking move that helps recover HP lost from Substitutes helps it gain gives Scovillain more mileage off of Moody. Giga Drain is also notable to more reliably defeat Dondozo, one of the Unaware Pokemon that would give Scovillain a lot of trouble otherwise.</p> </li> <li> <p><strong>Leech Seed: Leech Seed combined with Protect, Substitute, and Leftovers helps Scovillain restore HP while collecting Moody boosts, as well as chipping Pokemon it'd otherwise have trouble against, such as Clodsire.</p> </li> <li> <p><strong>Ingrain: Ingrain is an alternative recovery option that makes Scovillain impervious to phazing moves. When purely considering recovery, it's more reliable than the inaccurate 90% accurate Leech Seed.</p> </li> <li> <p><strong>Fairy Tera Blast</strong>: Tera Blast with Tera Fairy is an excellent option that helps remedy Scovillain's Dragon susceptibility, particularly making the Infiltrator Dragapult and Roaring Moon matchup easier.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Water: The Water resistance helps Scovillain beat Dondozo. Even though Dondozo ignores Scovillain's Defense boosts via Unaware, with Tera Water, Scovillain's Substitute can tank a Wave Crash. Tera Water also keeps the Scovillain's Steel resistance, unlike Tera Grass, which makes it easier to check Scizor—a common priority user that people attempt to use to check Moody Pokemon.</p> </li> <li> <p><strong>Fairy: Tera Fairy mitigating Scovillain's weakness to Dragon-types is massively helpful.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li><strong>180 HP / 220 Def / 4 SpA / 4 SpD / 100 Spe with Bold</strong>: This spread bolsters Scovillain’s physical bulk. Notably, Tera Water Scovillain's Substitute manages to survive Dondozo's Wave Crash with this spread. The Speed allows Scovillain to outspeed slow Baxcalibur and Gholdengo, as well as Dragapult with one Moody Speed boost. The HP is adjusted to make maximum use of Leftovers, with the resulting stat having a remainder of 1 when divided by 16. The remaining EVs are split between Special Attack and Special Defense because, at level 50, investing 8 EVs in either stat has no benefit over investing 4.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 613881, "username": "Tachipoyo"}]}
  },
  "Espathra": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Speed Passer",
        "description": "<ul> <li> <p>Espathra is the only option for the coveted Speed Boost + Baton Pass combination, which can be extremely deadly for setting up sweeps!</p> </li> <li> <p><strong>Lumina Crash</strong>: Lumina Crash ensures that Espathra isn't totally shut down by Taunt, and the guaranteed -2 Special Defense drop helps against Unaware walls.</p> </li> <li> <p><strong>Hypnosis</strong>: While extremely risky, putting a foe to sleep lets Espathra easily stack up on boosts.</p> </li> <li> <p><strong>Some Teammates</strong>: While most Pokemon love getting Baton Pass boosts, especially consider Pokemon that resist Espathra's common weaknesses, such as Hydreigon, Roaring Moon Sylveon, and Kingambit. Corviknight is also worth considering due to Power Trip.</p> </li> <li> <p><strong>EV Spread: The given EV spread outspeeds Choice Scarf Hydreigon after one turn of Speed Boost.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p>Espathra should usually avoid Terastallizing if possible, since its point is to help other Pokemon sweep. Consider these two options as fairly situational.</p> </li> <li> <p><strong>Normal</strong>: With a Normal Tera type, Espartha can set up against its Ghost types and isn't worried about Shadow Sneak anymore.</p> </li> <li> <p><strong>Ghost</strong>: Ghost Tera type makes Espartha immune to Extreme Speed, making passing against Dragonite much easier.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Focus Sash: Focus Sash is the best way to guarantee passing at least one Speed boost, though it's a lackluster option for passing multiple boosts compared to other items.</p> </li> <li> <p><strong>Leftovers</strong>: Leftovers is the easy option to recommend since it pairs well with Protect and Substitute.</p> </li> <li> <p><strong>Sitrus Berry</strong>: Sitrus Berry should be used if Espathra is planning on passing Speed to teammates that want Leftovers, such as Skeledirge and Garganacl.</p> </li> </ul> "
      },
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>With Calm Mind and Speed Boost rapidly increasing Stored Power's damage output, Espathra is a dangerous wincon against bulkier teams, as it even overwhelms Unaware foes.</p> </li> <li> <p><strong>Dazzling Gleam</strong>: This provides coverage against Dark-types such as Roaring Moon and Hydreigon.</p> </li> <li> <p><strong>Protect versus Substitute: Protect is the most reliable way to get a free turn of Speed Boost. Substitute is a riskier option for Speed Boost stalling, but it severely punishes passive Pokemon and works extremely well on dual screen teams.</p> </li> <li> <p><strong>EV Spread</strong>: The given EV spread allows Espathra to outspeed Flutter Mane and Iron Bundle after one turn of Speed Boost.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fighting: When paired with Tera Blast, Tera Fighting is Espathra's only hope of defeating Kingambit.</p> </li> <li> <p><strong>Fairy: Fairy Tera type makes setting up on Hydreigon a much more realistic scenario and severely punishes Choice-locked Dragon-types like Dragapult.</p> </li> <li> <p><strong>Dark: Tera Dark provides gives Espathra a valuable Shadow Sneak resistance and does a better shot of defeating weakened Gholdengo.</p> </li> </ul> "
      },
      {"name": "Offensive", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Tinkaton": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Utility",
        "description": "<ul> <li> <p>Tinkaton boasts an impressive support movepool alongside a fantastic typing in Fairy / Steel.</p> </li> <li> <p><strong>Encore</strong>: Encore can open up opportunities for teammates, locking foes into status moves or attacks that a teammate resists.</p> </li> <li> <p><strong>Thunder Wave</strong>: With Mold Breaker, Tinkaton is capable of paralyzing Gholdengo and Garganacl with Thunder Wave.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: Flying Tera makes Tinkaton immune to Ground, which can be useful in avoiding Earthquake from the likes of Garchomp, Great Tusk, and Tera Ground Baxcalibur.</p> </li> <li> <p><strong>Fire: Fire Tera turns Tinkaton's Fire-type weakness into a resistance, allowing it to use Encore on Volcarona.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li><strong>244 HP / 4 Atk / 164 Def / 20 SpD / 76 Spe with Careful</strong>: The HP and Defense investment lets Tinkaton survive Adamant Dragonite's Earthquake into Extreme Speed. The Special Defense investment allows Tinkaton to survive one Timid Choice Specs Fire Blast from Hydreigon, two Modest Choice Specs Shadow Balls from Dragapult, and three uninvested Shadow Balls from Gholdengo. The Speed investment allows Tinkaton to outspeed a paralyzed non-Choice Scarf Hydreigon.</li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Air Balloon: Air Balloon lets Tinkaton set up Stealth Rock against other common entry hazard setters such as Garchomp and Glimmora without the use of Flying Tera and pairs incredibly well with Encore. </li> <li> <p><strong>Focus Sash: Focus Sash allows Tinkaton to get a Thunder Wave off even against powerful attacks from the likes of Terastallized Garchomp, Hydreigon, and Dragapult.</p> </li> </ul> "
      },
      {
        "name": "Offensive Support",
        "description": "<ul> <li> <p>Despite Tinkaton's low offensive stats, it can still perform as an offensive Pokemon thanks to Gigaton Hammer's enormous 160 Base Power and Swords Dance.</p> </li> <li> <p><strong>Encore</strong>: Encore is a fantastic support move, potentially locking foes into resisted moves after a switch-in or denying slower, bulkier foes their recovery moves for a few turns.</p> </li> <li> <p><strong>Play Rough versus Knock Off</strong>: Play Rough is Tinkaton's best option against Roaring Moon, and thanks to Mold Breaker, Tinkaton can hit Unaware Dondozo with boosted Play Rough. Meanwhile, Knock Off is Tinkaton's best attack against Gholdengo.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: Flying Tera turns Tinkaton's Ground-type weakness into an immunity, allowing it to use Encore on moves like Earthquake and Fissure from foes such as Garchomp, Great Tusk, Iron Treads, and Dondozo.</p> </li> <li> <p><strong>Steel: Steel Tera capitalizes on Gigaton Hammer to make it deal as much damage as possible.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li><strong>4 HP / 236 Atk / 36 Def / 4 SpD / 228 Spe with Jolly</strong>: This spread outspeeds Annihilape and allows Tinkaton to survive a +1 Dragon Claw + Normal Tera Extreme Speed from Dragonite after Terastallizing.</li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers</strong>: Leftovers has great synergy with Encore, allowing it to set up while healing off some of the damage from weak moves. </li> <li> <p><strong>Focus Sash</strong>: Holding a Focus Sash guarantees that Tinkaton can get at least one move off even against super effective attacks aimed at it.</p> </li> <li> <p><strong>Air Balloon</strong>: With Air Balloon, Tinkaton can give Ground-type foes like Great Tusk and Hippowdon issues before even Terastallizing.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}
  },
  "Palafin": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "This looks like a job for Palafin",
        "description": "<ul> <li> <p>Palafin's stats are middling, but after switching out once it will forme change into Palafin-H, which boasts the highest base Attack in the format, making it an effective wall breaker and revenge killer.</p> </li> <li> <p><strong>Jet Punch</strong>: With Jet Punch, Palafin-H becomes an excellent revenge killer, being able to take down important threats such as Flutter Mane, Iron Moth, and Great Tusk.</p> </li> <li> <p><strong>Close Combat: Close Combat is good coverage, hitting Rotom-W for neutral damage and covering Roaring Moon and Meowscarada.</p> </li> <li> <p><strong>Adamant versus Jolly: An Adamant nature increases the damage Wave Crash and Jet Punch inflict, making Palafin-H a more effective wall breaker and revenge killer. A Jolly nature enables Palafin-H to outspeed Mimikyu and Hydreigon.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Water: A Water Tera type boosts Jet Punch and Wave Crash, making Palafin-H a potent late-game cleaner.</p> </li> <li> <p><strong>Grass</strong>: A Grass Tera type turns all of Palafin-H's weaknesses into resistances, giving it a favorable matchup against Rotom-W, and making it immune to Spore from Breloom and Brute Bonnet.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality Checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 11020, "username": "Blackbeltsam"}]}
  },
  "Orthworm": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "IronPress",
        "description": "<ul> <li> <p>Thanks to Earth Eater, Orthworm can wall sets of many physical Dragon-types like Garchomp and Baxcalibur.</p> </li> <li> <p><strong>Heavy Slam versus Iron Head: Heavy Slam can 2HKO offensive Dragapult, OHKOs Flutter Mane, and deals much more damage to Iron Valiant, while Iron Head is superior for Dragonite.</p> </li> <li> <p><strong>Rest and Chesto Berry: Rest is an option with Chesto Berry to heal Orthworm in a pinch, giving it better longevity.</p> </li> <li> <p><strong>Shed Tail</strong>: Shed Tail gives Orthworm use when IronPress isn't as effective. The surprise factor comes at the price of the reduced effectiveness of IronPress.</p> </li> <li> <p><strong>Substitute</strong>: Substitute stops Salt Cure damage from Garganacl and phazing from Garchomp's Dragon Tail.</p> </li> </ul> <h1>Other Options</h1> <ul> <li>Earthquake is an option to hit Gholdengo, but it won't 2HKO, so Recover is still a problem.</li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Sitrus Berry: Sitrus Berry allows two uses of Shed Tail. </li> <li> <p><strong>Leftovers</strong>: Leftovers is a consistent option, especially in conjunction with Substitute.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Poison</strong>: Tera Poison provides a key Fighting resistance and single weakness and maintains a key resistance to Flower Trick, letting Orthworm preform better against Meowscarada, Great Tusk, and Iron Valiant.</p> </li> <li> <p><strong>Fairy: Tera Fairy provides a Fighting resistance and Dragon immunity, turning Dragon Tail Garchomp into setup bait, and dealing with Great Tusk, Iron Valiant, and Roaring Moon.</p> </li> </ul> <h1>EV spreads</h1> <ul> <li> <p><strong>252 HP / 252 SpD / 4 Spe with Careful: This EV spread makes Orthworm much less likely to be 2HKOd by Life Orb Dragapult.</p> </li> <li> <p><strong>252 HP / 116 Def / 140 Spe with Impish</strong>: This spread can be used to outspeed Adamant Kingambit and most Corviknight and Skeledirge. This can be very useful if using Shed Tail.</p> </li> </ul> "
      },
      {
        "name": "Shed Tail Support",
        "description": "<ul> <li> <p>Orthworm's good physical bulk and ability make it a great user of Shed Tail, and a reliable Stealth Rock user.</p> </li> <li> <p><strong>Body Press</strong>: Body Press has a good chance to OHKO offensive Meowscarada, and threatens Kingambit and Roaring Moon.</p> </li> <li> <p><strong>Heavy Slam versus Iron Head: A Steel-type STAB move helps hit some Ghost-types like Mimikyu and Flutter Mane, who are OHKOed by Heavy Slam, and deals massive damage to Iron Valiant. Iron Head is an alternative for heavy foes like Dragonite.</p> </li> <li> <p><strong>Spikes: Orthworm can also set Spikes, but this compromises its ability to pass Shed Tail.</p> </li> <li> <p><strong>A Special Teammate</strong>: Many Pokemon can benefit from Orthworm's Shed Tail. One example is Air Balloon Gholdengo, which puts a lot of pressure on defensive foes when behind a Substitute.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p>This Orthworm isn't usually meant to Terastalize, since that's better served by the teammates its passing a Substitute to.</p> </li> <li> <p><strong>Poison: Tera Poison leaves Orthworm with only one fairly rare weakness, and aiding it against former threats like Great Tusk and Iron Valiant.</p> </li> <li> <p><strong>Fairy: Tera Fairy gives Orthworm a Fighting resistance, as well as a way to absorb Garchomp's Dragon Tail while still staying in.</p> </li> </ul> <h1>EV spreads</h1> <ul> <li> <p><strong>252 HP / 252 Def / 4 SpD: This spread maximizes Orthworm's physical bulk. Running a Speed IV of 0 may be tempting, but being outsped by bulky Brute Bonnet is risky.</p> </li> <li> <p><strong>252 HP / 116 Def / 140 Spe with Impish: This spread outspeeds Kingambit, and most Skeledirge and Corviknight. Outspeeding Kingambit and Corviknight prevents Taunt from stopping Shed Tail, and let's Orthworm bring in a teammate against Torch Song.</p> </li> <li> <p><strong>252 HP / 44 Def / 212 Spe with Jolly: This spread outspeeds Adamant Breloom and Jolly Brute Bonnet. Mach Punch still does a lot, but thanks to Sitrus Berry, Orthworm will have enough HP left to Shed Tail to a check or counter.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 291756, "username": "Omastar68"}]}
  },
  "Glimmora": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Debris Lead",
        "description": "<ul> <li> <p>With a solid early-game Speed tier, utility, high Special Attack, and decent coverage options, Glimmora can set the tone of a battle, sometimes scoring KOs before fulfilling its main role of setting entry hazards.</p> </li> <li> <p><strong>Mud Shot</strong>: This will fail to KO many foes—most notably other Glimmora—but it is a valuable form of speed control that can immediately turn the game in your favor.</p> </li> <li> <p><strong>Mortal Spin</strong>: If using Stealth Rock weak teammates like Dragonite or Baxcalibur, clearing the hazards with Mortal Spin can be quite useful.</p> </li> <li> <p><strong>Memento: Memento immediately makes way for a devastating sweeper to set up against foes with halved offensive stats and potentially lowered Speed.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying</strong>: Tera Flying vastly improves Glimmora's matchup against Great Tusk and Garchomp.</p> </li> <li> <p><strong>Grass: A Grass Tera type is an option to absorb Spore from Breloom and Brute Bonnet.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Focus Sash: This is the most reliable item for setting up Stealth Rock.</p> </li> <li> <p><strong>Air Balloon</strong>: With Air Balloon, Glimmora vastly improves its match-up against Ground-type leads such as Garchomp.</p> </li> </ul> "
      },
      {"name": "Choice Scarf", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 62165, "username": "StarkGod"}]}
  },
  "Flamigo": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/flamigo.3713787/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Scrappy Choice Item",
        "description": "<ul> <li> <p>Scrappy gives Flamigo a unique niche, letting it throw out powerful Close Combats that are unsafe for Gholdengo and Dragapult to take!</p> </li> <li> <p>Throat Chop is a decent filler move, letting Flamigo shut down Sylveon's Hyper Voice and Skeledirge's Torch Song. Note that Close Combat still does more damage to most Ghost-types.</p> </li> <li> <p>Tailwind is a filler move that gives Flamigo's team some extreme speed control before it goes down.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fighting: Tera Fighting lets Flamigo fully take advantage of Scrappy, giving Choice Scarf sets a 81.3% chance to OHKO offensive Dragapult.</p> </li> <li> <p><strong>Fire</strong>: Tera Fire makes Flamigo immune to Will-O-Wisp, letting Choice Band sets more easily break through Skeledirge, and gives Flamigo the option to 2HKO Corviknight with Tera Blast.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Scarf: With Choice Scarf, Flamigo outspeeds major threats such as Dragapult and Hydreigon, making it a more effective late-game cleaner.</p> </li> <li> <p><strong>Choice Band: Choice Band lets Flamigo deal massive damage, giving it a shot at 2HKOing Skeledirge with Close Combat.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Dondozo": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "OHKO Fisher",
        "description": "<ul> <li> <p>With immense bulk, Yawn, and Unaware, Dondozo is not only an impressive defensive Pokemon, but one of the most dangerous OHKO fishers in the game.</p> </li> <li> <p><strong>Wave Crash</strong>: Despite the recoil, Wave Crash is the prefered option over Liquidation in most cases, purely for the damage output.</p> </li> <li> <p><strong>Protect</strong>: Protect is not only useful for scouting for unexpected Tera types, but pairs well with Yawn and Leftovers to give Dondozo more longevity.</p> </li> <li> <p><strong>Avalanche</strong>: It can be tricky to fit in, but Avalanche can be used to deal more consistent damage against Dragon-types.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy</strong>: A Fairy Tera type lets Dondozo take on powerful Dragon-type attacks much more easily, and is just a good defensive typing in general.</p> </li> <li> <p><strong>Grass</strong>: A Grass Tera type is useful enough for covering Dondozo's weaknesses, and the Spore immunity makes it capable of beating Breloom too.</p> </li> <li> <p><strong>Flying: Flying may seem like an odd Tera type, but it can lead to your Dondozo winning mirror matches thanks to the Fissure immunity.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 Def / 252 SpD / 4 Spe</strong>: With Dondozo's massive HP stat, it's still able to take physical hits fairly well with this spread, while making it feasible to Yawn against special attacking threats such as Choice Scarf Hydreigon.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe: This more extreme spread helps against powerful Tera users, with the ability to avoid a 2HKO from Choice Band Tera Dragon Dragapult's Dragon Darts with Leftovers. This comes at the cost of being much more vulnerable to weaker special attackers.</p> </li> </ul> "
      },
      {
        "name": "BIG FLOPPA (Assault Vest)",
        "description": "<ul> <li> <p>Dondozo’s good power and bulk lend it nicely to an Assault Vest set, and is particularly good at punishing otherwise troublesome special attackers such as Flutter Mane.</p> </li> <li> <p><strong>Avalanche: Avalanche punishes Flying- and Dragon-types with super effective coverage.</p> </li> <li> <p><strong>Body Press</strong>: This is valuable Fighting-type coverage for most foes that would otherwise be a good switch in to Dondozo, such as Meowscarada, Magnezone, and Kingambit.</p> </li> <li> <p><strong>Fissure: Fissure allows Dondozo to potentially cheese its way through something that might otherwise wall it.</p> </li> <li> <p><strong>Heavy Slam</strong>: Dondozo is heavy enough to deal serious damage to Fairy-types such as Mimikyu and Flutter Mane.</p> </li> <li> <p><strong>Earthquake: Earthquake offers more reliable Ground-type coverage at the cost of not being an instant KO like Fissure.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Grass</strong>: Tera Grass removes Dondozo’s usual set of weaknesses and allows it to absorb spore from the likes of Amoonguss, Breloom, and Brute Bonnet.</p> </li> <li> <p><strong>Fairy: Tera Fairy grants Dondozo a new set of resistances to take advantage of with its phenomenal bulk and also grants it a powerful STAB to hit Dragon- and Fighting-types with if it runs Tera Blast.</p> </li> <li> <p><strong>Steel</strong>: When paired with Heavy Slam, Dondozo can now 2HKO Iron Bundle without Stealth Rock support, in addition to gaining a fantastic defensive typing.</p> </li> <li> <p><strong>Ground: Terastallizing into a Ground-type allows Dondozo to block the Electric-type attacks commonly aimed at it while also giving it STAB on Earthquake.</p> </li> <li> <p><strong>Dragon</strong>: Tera Dragon gives Dondozo a resistance to both Electric- and Water-type attacks, allowing it to stand up to Rotom-W much better.</p> </li> <li> <p><strong>Dark: Tera Dark allows Dondozo to better check Espathra by becoming immune to Lumina Crash and Stored Power.</p> </li> </ul> "
      },
      {"name": "Curse", "description": "<ul> <li> <p>With Unaware, Dondozo becomes an effective and difficult to break Curse user.</p> </li> <li> <p><strong>Fissure</strong>: Even with Curse being the point of this set, Dondozo can still effectively fish for OHKOs with Fissure when it's not in a favorable set-up position.</p> </li> <li> <p><strong>Avalanche</strong>: Many foes will Terrastallize into a Flying-type to avoid an expected Fissure, which makes Avalanche a particularly useful coverage move.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy</strong>: The Dragon immunity that Tera Fairy provides makes setting up on powerful foes like Choice Band Dragapult and Roaring Moon much easier.</p> </li> <li> <p><strong>Grass: With a Grass Tera Type, Dondozo can effectively set up on Breloom and Brute Bonnet.</p> </li> <li> <p><strong>Flying: If using Fissure, Tera Flying is a good choice for potentially beating other Dondozo.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Annihilape": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big new changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Bulky Taunt",
        "description": "<ul> <li> <p>Thanks to great bulk and the dangerous Rage Fist, Annihilape is one of the premier bulky set-up sweepers of Battle Stadium Singles.</p> </li> <li> <p><strong>Taunt</strong>: Taunt helps you deal with annoying Pokemon like Dondozo, Will-O-Wisp Skeledirge, and Hippowdon, to mention a few, forcing them to attack and boost Rage Fist.</p> </li> <li> <p><strong>Vital Spirit: With Vital Spirit, Annihilape can absorb Spore from foes like Breloom, Brute Bonnet, and Amoonguss.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel: Steel turns Annihilape's Psychic and Fairy weakness into resistances, as well as being an excellent defensive type overall. It lets Annihilape set up freely on Amoonguss, gives it a better chance of defeating Flutter Mane, and resisting Flower Trick means Meowscarada has a much harder time revenge killing it.</p> </li> <li> <p><strong>Flying: Flying helps a lot to avoid Dondozo's Fissure, forcing it to attack with moves that boost Rage Fist. It also improves Annihilape's match-up against Great Tusk.</p> </li> <li> <p><strong>Fire: In addition to giving a useful resistance to Fairy attacks, Tera Fire also prevents Will-O-Wisp from hitting.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Covert Cloak</strong>: Covert Cloak makes Annihilape immune to being Salt Cured, making it a great check against Garganacl. It also gives peace of mind, removing potential flinches from Hydreigon's Dark Pulse or Special Defense drops from Flutter Mane's Shadow Ball.</p> </li> <li> <p><strong>Leftovers: Leftovers's residual recovery comes in handy if a different Pokemon is using Covert Cloak.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Def / 252 Spe with Jolly</strong>: Maximum Speed mainly helps Annihilape outspeed Gholdengo, Great Tusk, and Breloom. With Bulk Up and Rage Fist improving its offense, Annihilape can invest in HP over Attack.</p> </li> <li> <p><strong>252 HP / 252 SpD / 4 Spe with Careful: More special bulk can make it much more difficult for special attackers such as Flutter Mane and Dragapult to revenge kill Annihilape.</p> </li> <li> <p><strong>252 HP / 156 SpD / 100 Spe with Careful: This EV spread outspeeds Adamant Breloom and Cloyster while still giving Annihilape good special bulk.</p> </li> </ul> "
      },
      {
        "name": "Choice Scarf",
        "description": "<ul> <li> <p>Annihilape has enough Speed to surprise important threats with Choice Scarf, such as Dragapult, Flutter Mane, and Meowscarada.</p> </li> <li> <p><strong>Shadow Claw versus Rage Fist: Shadow Claw is weak, but it's a reliable Ghost-type STAB move that can reliably OHKO Flutter Mane even when using minimum Attack investment. If you can manage to get Annihilape into a weak attack, though, Rage Fist has much more reward associated with it.</p> </li> <li> <p><strong>Ice Punch</strong>: Ice Punch deals massive damage to Garchomp and Dragonite, making them easier to pick off or pressuring them to Terastallize.</p> </li> <li> <p><strong>Final Gambit: If using maximum HP, Final Gambit can potentially OHKO major defensive threats if Annihilape is healthy, such as Garganacl and Corviknight.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fighting: With a Fighting Tera type, Close Combat does outrageous damage, with Rotom-W in particular taking over 90% from it.</p> </li> <li> <p><strong>Ghost: A Ghost Tera type makes Shadow Claw OHKO Dragapult, as well as giving it a 56.3% chance of OHKOing 4 HP Gholdengo.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 Atk / 252 Spe: This simple EV spread is best when not using Final Gambit to maximize offensive power.</p> </li> <li> <p><strong>252 HP / 4 Atk / 252 Spe</strong>: While maximizing HP makes Annihilape a less reliable revenge killer, it can effectively sacrifice itself with Final Gambit to get surprise KOs on certain defensive foes, like Corviknight and Garganacl.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Vital Spirit</strong>: The immunity to Spore gives Annihilape a good opportunity to switch into Breloom, and it need not worry about Yawn.</p> </li> <li> <p><strong>Defiant: While Intimidate is not particularly common, punishing that and Speed drops can lead to devastating surprise sweeps.</p> </li> </ul> "
      },
      {
        "name": "Stealth Rock Setter",
        "description": "<ul> <li> <p>Annihilape's good bulk and significant offensive presence makes it an easy to use Stealth Rock setter.</p> </li> <li> <p><strong>Rage Fist</strong>: Rage Fist is Annihilape’s strongest move; its power and coverage often lets Annihilape either defeat or significantly chip one of the opponent’s Pokemon on top of getting Stealth Rock up.</p> </li> <li> <p><strong>Taunt</strong>: Taunt gives Annihilape a strong matchup into bulky walls such as Hippowdon and opposing setup foes like Volcarona, while also making it easier to boost Rage Fist’s power.</p> </li> <li> <p><strong>Encore: Encore is an incredibly powerful move that can lock the opponent into an attacking move to boost Rage Fist's power. Alternatively, it can lock the opponent into a status move.</p> </li> <li> <p><strong>Final Gambit</strong>: Final Gambit has excellent synergy with Rage Fist; not only do they cover for each other's immunities, Final Gambit punishes foes that refuse to attack Annihilape to avoid boosting Rage Fist, allowing Annihilape to still take out a foe.</p> </li> <li> <p><strong>Curse</strong>: This is an excellent way for Annihilape to retire itself from the battle while putting significant pressure on the opponent to switch out and shutting down gimmicks such as Baton Pass.</p> </li> <li> <p><strong>Using speed controlling moves</strong>: A variety of lead Annihilapes run speed controlling moves. By using a Speed reducing move against a faster opponent rather than leading with Stealth Rock, Annihilape can scout the opponent's set, as well as providing support to its teammates. It also prevents foes from setting up on Annihilape. Speed reducing moves can help against those. Speed reducing moves are also better than Taunt and Encore at shutting down opposing Dragon Dance and Quiver Dance.</p> </li> <li> <p><strong>Rock Tomb</strong>: Rock Tomb is an excellent Speed reducing move for its ability to hit Dragonite, and threaten Volcarona and Iron Bundle. Its low accuracy should be noted as a risk, however.</p> </li> <li> <p><strong>Bulldoze: Bulldoze cannot hit Flying and Levitate Pokemon. In exchange, it is much more effective against Steel-types such as Gholdengo, Iron Treads, and Tinkaton.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Normal: Ghost-type attacks are incredibly common. Pokemon such as Gholdengo, Flutter Mane, Dragapult, and opposing Annihilape all struggle against an unexpected Tera Normal.</p> </li> <li> <p><strong>Steel: Tera Steel has excellent defensive synergy with Annihilape. It's noteworthy for halving the damage from common Dragon and Fairy-type moves.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Atk / 4 Def / 108 SpD / 140 Spe with Jolly</strong>: This spread outspeeds critical Pokemon such as Dragonite, Adamant Baxcalibur, and Modest Gholdengo. The Special Defense investment lets Annihilape live Choice Specs Dragapult and Choice Scarf Gholdengo’s Shadow Ball with ease.</p> </li> <li> <p><strong>172 HP / 4 Atk / 180 Def / 76 SpD / 76 Spe with Careful: This spread compromises some of Annihilape’s Speed to invest into more bulk. It still outspeeds Garchomp at -1 and certain sets of Dragonite, and lives Dragapult’s Choice Band Fairy Tera Blast on a roll.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Vital Spirit: Vital Spirit adds to Annihilape’s reliability as a lead. Immunity to sleep moves from common Pokemon such as Breloom, Brute Bonnet, Dondozo, Hippowdon, and Skeledirge lets Annihilape thrive.</p> </li> <li> <p><strong>Defiant: Defiant is a strong option. While Intimidate Pokemon are far from common from the format, Defiant can take advantage of an opposing Annihilape’s speed control moves.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 469498, "username": "luisin"}, {"user_id": 29010, "username": "Theorymon"}, {"user_id": 613881, "username": "Tachipoyo"}]}
  },
  "Clodsire": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big new changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>While Clodsire is lacking in physical bulk compared to Dondozo and Skeledirge, it makes up for it in having a fantastic support movepool.</p> </li> <li> <p><strong>Yawn: Yawn is very effective at forcing switches, which is especially dangerous if Stealth Rock is set up.</p> </li> <li> <p><strong>Protect</strong>: In addition to benefiting from Leftovers, Protect pairs well with Yawn.</p> </li> <li> <p><strong>Low Kick</strong>: This prevents Clodsire from being totally walled by Tera Steel Hydreigon.</p> </li> <li> <p><strong>Amnesia: With Amnesia, Clodsire has a far better match-up against powerful special attacking foes such as Hydreigon and Iron Bundle.</p> </li> <li> <p><strong>Black Sludge versus Leftovers: Black Sludge may seem appealing, but it punishes Clodsire for Terastalliizing unless it becomes Tera Poison, so Leftovers is preferred unless Leftovers is already on something else.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying</strong>: With a Flying Tera type, Clodsire no longer has to worry about Earthquake or Fissure.</p> </li> <li> <p><strong>Steel</strong>: A Steel Tera type allows Clodsire to take on powerful Dragon-type attacks, without the worry of Gholdengo dealing massive damage.</p> </li> <li> <p><strong>Poison: With Tera Poison, Clodsire not only becomes a better check to Grass- and Water-types such as Meowscarda and Rotom-W, but it can also safely run Black Sludge to punish users of Trick.</p> </li> <li> <p><strong>Fairy: A Fairy Tera type will stop powerful Dragon-type attacks cold without making Clodsire weak to Earthquake, but it comes at the cost of compromising its ability to check Gholdengo.</p> </li> <li> <p><strong>Dark</strong>: Espathra's Stored Power is a big issue for Clodsire, so Tera Dark can flip the tables on it.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Unaware: If you're planning to use Clodsire to its fullest defensive potential, Unaware is the best bet against setup foes.</p> </li> <li> <p><strong>Water Absorb</strong>: Water Absorb sacrifices overall defensive potential in exchange for being able to wall Rotom-W without needing to Terastallize. If setting up Stealth Rock is important, this can be worth it.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 SpD / 4 Spe with Careful</strong>: Maximizing Special Defense is Clodsire's best hope for handling powerful special attackers such as Choice Specs Hydreigon.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe with Impish</strong>: Clodsire's Defense may be mediocre, but with maximum investment, it can pull stunts such as usually avoiding a 2HKO from Jolly Dragonite's Outrage with Leftovers.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Kingambit": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<ul> <li> <p>Kingambit sets itself apart from most other Dark-types with its bulk and typing, which make it a reasonable check against Gholdengo that lack Focus Blast.</p> </li> <li> <p><strong>Guillotine: This makes Kingambit far more difficult to wall with foes such as Dondozo.</p> </li> <li> <p><strong>Low Kick: Low Kick is Kingambit's best option against other Kingambit.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dark</strong>: A Dark Tera type makes Kingambit even harder to wall and removes its irritating Ground weakness.</p> </li> <li> <p><strong>Flying</strong>: This Tera type covers Kingambit's issues with Fighting- and Ground-type attacks very well.</p> </li> <li> <p><strong>Fairy</strong>: With a Fairy Tera type, Kingambit gains a resistance to Fighting and can still deal with Dragon-types, but it becomes vulnerable to Gholdengo.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Supreme Overload</strong>: This is generally the more consistent ability since Intimidate foes are not very common.</p> </li> <li> <p><strong>Defiant</strong>: Defiant is still useful for punishing speed control options such as Rock Tomb, especially alongside Sucker Punch.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 Atk / 4 Spe</strong>: This simple spread maximizes bulk and power.</p> </li> <li> <p><strong>108 HP / 252 Atk / 148 Spe</strong>: This EV spread has enough Speed to outspeed most Corviknight and Skeledirge, and it still has enough bulk to survive one unboosted Body Press from Corviknight. Since this is a fairly congested Speed range, feel free to move some Attack EVs to Speed.</p> </li> <li> <p><strong>4 HP / 252 Atk / 252 Spe: Using maximum Speed might seem absurd on such a slow Pokemon, but outspeeding most Skeledirge, Corviknight, and opposing Kingambit can make this worth it.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Black Glasses</strong>: While its boost to Dark-type attacks isn't as high as Life Orb's, Black Glasses is a better fit for Kingambit's bulk due to the lack of recoil.</p> </li> <li> <p><strong>Sitrus Berry</strong>: The burst of recovery helps Kingambit check Gholdengo better.</p> </li> <li> <p><strong>Assault Vest</strong>: Assault Vest makes Kingambit a better check against Gholdengo and Hydreigon.</p> </li> </ul> "
      },
      {"name": "Stealth Rock Support", "description": "<p>This set will be up for reservation once the analysis process for Series 2 begins.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Great Tusk": {"overview": "<p>This exciting new Paradox Pokemon is likely to have an impact on Battle Stadium Singles Series 2! While we wait for the metagame to settle, here are some sample sets to get you started. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Offensive"}, {"name": "Choice Item"}, {"name": "Focus Sash"}, {"name": "Defensive"}]},
  "Scream Tail": {
    "overview": "<p>This new Paradox Pokemon is likely to be relevant in Battle Stadium Singles Series 2. While we wait for the metagame to settle, here are some sample sets that may be viable. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [{"name": "Stealth Rock Support", "description": "<p>An Attack IV of 0-3 is needed to take minimum damage from Foul Play.</p> "}, {"name": "Wish Support", "description": "<p>An Attack IV of 0-3 is needed to take minimum damage from Foul Play.</p> "}, {"name": "Dual Screen", "description": "<p>An Attack IV of 0-3 is needed to take minimum damage from Foul Play.</p> "}, {"name": "Baton Pass", "description": "<p>An Attack IV of 0-3 is needed to take minimum damage from Foul Play.</p> "}]
  },
  "Brute Bonnet": {
    "overview": "<p>This new Paradox Pokemon is likely to be relevant in Battle Stadium Singles Series 2. While we wait for the metagame to settle, here is a sample set that may be viable. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [{"name": "Speedy Spore", "description": "<p><a href=\"https://www.smogon.com/forums/threads/brute-bonnet-gp-0-1.3715781/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> "}, {"name": "Bulky Spore", "description": "<p><a href=\"https://www.smogon.com/forums/threads/brute-bonnet-gp-0-1.3715781/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> "}]
  },
  "Flutter Mane": {"overview": "<p>This exciting new Paradox Pokemon is likely to have an impact on Battle Stadium Singles Series 2! While we wait for the metagame to settle, here are some sample sets to get you started. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Offensive", "description": "<p>An Attack IV of 0-3 is needed to take minimum damage from Foul Play.</p> "}, {"name": "Choice Item", "description": "<p>An Attack IV of 0-3 is needed to take minimum damage from Foul Play.</p> "}]},
  "Slither Wing": {"overview": "<p>This new Paradox Pokemon is likely to be relevant in Battle Stadium Singles Series 2. While we wait for the metagame to settle, here are some sample sets that may be viable. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Offensive"}, {"name": "Bulk Up"}, {"name": "Choice Scarf"}]},
  "Sandy Shocks": {"overview": "<p>This new Paradox Pokemon might have a niche in Battle Stadium Singles Series 2, though their viability is uncertain. While we wait for the metagame to settle, here are some sample sets that may be viable. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Choice Item", "description": "<p>An Attack IV of 0-1 is needed to take minimum damage from Foul Play.</p> "}, {"name": "Hazards Setter", "description": "<p>An Attack IV of 0-1 is needed to take minimum damage from Foul Play.</p> "}]},
  "Iron Treads": {"overview": "<p>This new Paradox Pokemon is likely to be relevant in Battle Stadium Singles Series 2. While we wait for the metagame to settle, here is a sample set that may be viable. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Assault Vest", "description": "<p>The given EV Spread gives Iron Treads a favorable matchup against Flutter Mane, outspeeds Jolly Breloom, and outspeeds Iron Bundle after using Rapid Spin.</p> "}]},
  "Iron Bundle": {"overview": "<p>This exciting new Paradox Pokemon is likely to have an impact on Battle Stadium Singles Series 2! While we wait for the metagame to settle, here are some sample sets to get you started. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Santa's Slay", "description": "<p><a href=\"https://www.smogon.com/forums/threads/iron-bundle-gp-0-1.3715770/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> "}]},
  "Iron Hands": {"overview": "<p>This new Paradox Pokemon is likely to be relevant in Battle Stadium Singles Series 2. While we wait for the metagame to settle, here is a sample set that may be viable. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Assault Vest"}]},
  "Iron Jugulis": {"overview": "<p>This new Paradox Pokemon might have a niche in Battle Stadium Singles Series 2, though their viability is uncertain. While we wait for the metagame to settle, here are some sample sets that may be viable. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Choice Item", "description": "<p>An Attack IV of 0-1 is needed to take minimum damage from Foul Play.</p> "}, {"name": "Booster Energy", "description": "<p>An Attack IV of 0-1 is needed to take minimum damage from Foul Play.</p> "}]},
  "Iron Moth": {
    "overview": "<p>This exciting new Paradox Pokemon is likely to have an impact on Battle Stadium Singles Series 2! While we wait for the metagame to settle, here are some sample sets to get you started. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [{"name": "Offensive", "description": "<p><a href=\"https://www.smogon.com/forums/threads/iron-moth-gp-0-1.3715775/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> "}, {"name": "Speedy Booster Energy", "description": "<p><a href=\"https://www.smogon.com/forums/threads/iron-moth-gp-0-1.3715775/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> "}]
  },
  "Iron Thorns": {"overview": "<p>This new Paradox Pokemon might have a niche in Battle Stadium Singles Series 2, though their viability is uncertain. While we wait for the metagame to settle, here id s sample set that may be viable. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Dragon Dance"}]},
  "Baxcalibur": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Sweeper",
        "description": "<ul> <li> <p>With good bulk, an immunity to burn, and just enough Speed to work, Baxcalibur is a powerful sweeper.</p> </li> <li> <p><strong>Icicle Spear</strong>: Icicle Spear KOes Breloom and Mimikyu through Focus Sash and Disguise respectively.</p> </li> <li> <p><strong>Glaive Rush: While Glaive Rush is valuable for late-game sweeping, it does make Baxcalibur very vulnerable to bulky OHKO move users such as Dondozo and Garganacl.</p> </li> <li> <p><strong>Ice Shard: Ice Shard means Baxcalibur will have a difficult time breaking past bulky Steel-types early-game, but it makes it an effective cleaner otherwise.</p> </li> </ul> <h1>Other Options</h1> <ul> <li><strong>Swords Dance</strong>: Dragon Dance is the more reliable option for sweeping due to Baxcalibur's Speed, but Swords Dance can be paired with Ice Shard and an Adamant nature to OHKO fast, frail foes such as Booster Energy Flutter Mane.</li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dragon</strong>: This makes Glaive Rush deal obscene damage and removes weaknesses to Mach Punch and Bullet Punch. </li> <li> <p><strong>Electric</strong>: When paired with Tera Blast, this is Life Orb Baxcalibur's best shot at dealing damage to Dondozo switch-ins. The paralysis immunity also helps Baxcalibur set up against Chansey with less risk.</p> </li> <li> <p><strong>Ice: Tera Ice works great with Swords Dance and Ice Shard, making Baxcalibur easier to clean teams with.</p> </li> <li> <p><strong>Steel</strong>: With a Tera type of Steel, Baxcalibur can set up on Mimikyu and Dragon-type attacks.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Life Orb</strong>: This helps Baxcalibur sweep reliably and ensures Icicle Spear OHKOes Breloom through Focus Sash.</p> </li> <li> <p><strong>Loaded Dice</strong>: With a guaranteed 4 hits from Icicle Spear, Baxcalibur is able to always OHKO offensive Mimikyu after Dragon Dance.</p> </li> <li> <p><strong>Focus Sash</strong>: Focus Sash may seem like a waste with Baxcalibur's bulk, but it provides new set up opportunities and eases match-ups against other Dragon-types.</p> </li> </ul> "
      },
      {
        "name": "All-Out Attacker",
        "description": "<ul> <li> <p>Baxcalibur's bulk and the wonderful Ice Shard means it doesn't need to set-up to become a powerful threat.</p> </li> <li> <p><strong>Icicle Spear</strong>: Icicle Spear is recommended despite its inconsistent damage, as it deals damage through Mimikyu's disguise and potentially KOes Focus Sash users like Breloom and Meowscarada.</p> </li> <li> <p><strong>Glaive Rush: Glaive Rush makes Baxcalibur very vulnerable to getting KOed the next turn, but it is still the least risky Dragon-type STAB move. Remember that Ice Shard will remove Glaive Rush's negative effects as well.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ground</strong>: A Ground Tera type gives Baxcalibur a reliable STAB move in Earthquake, resistance to Stealth Rock, and removes a ton of weaknesses, all at the cost of losing to Water-types such as Rotom-W and Iron Bundle.</p> </li> <li> <p><strong>Electric: With Tera Electric, Baxcalibur's Tera Blast deals massive damage to Corviknight that lack a set up move, Azumarill, does good chip damage to Dondozo, and gains a valuable resistance to Gholdengo's Make It Rain.</p> </li> <li> <p><strong>Ice: Boosting the power of Ice Shard gives Choice Band Baxcalibur new revenge kill chances, and makes wall breaking with Icicle Spear easier.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Assault Vest</strong>: Baxcalibur's bulk makes it an excellent user of Assault Vest, making it particularly effective against Rotom formes and Iron Bundle.</p> </li> <li> <p><strong>Choice Band: With Choice Band, Baxcalibur becomes an immediate threat, threatening to 2HKO physical walls such as Dondozo.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 Atk / 4 Spe with Adamant</strong>: This simple EV spread maximizes Baxcalibur's bulk and power.</p> </li> <li> <p><strong>116 HP / 252 Atk / 140 Spe with Jolly</strong>: The Speed investment here outspeeds Modest Gholdengo and Adamant Dragonite.</p> </li> <li> <p><strong>4 HP / 252 Atk / 252 Spe with Jolly: If using Choice Band, winning Speed ties against Great Tusk and opposing Baxcalibur makes maximum Speed much more appealing.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 534158, "username": "Kiby"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Gholdengo": {
    "overview": "<p>With Paradox Pokemon being introduced, Series 2 is bringing big changes to Battle Stadium Singles! This is a modified Series 1 analysis that takes Paradox Pokemon into account. We will update this overview and analysis again once the metagame settles more. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [
      {
        "name": "Choice Item",
        "description": "<ul> <li> <p>With Trick and an immunity to status moves, Gholdengo is a dangerous Choice item attacker for offensive and stall teams alike!</p> </li> <li> <p><strong>Thunderbolt</strong>: This 2HKOes Dondozo and deals serious damage to Tera Flying Garganacl.</p> </li> <li> <p><strong>Dazzling Gleam Dazzling Gleam deals massive damage to Meowscarada, Roaring Moon, and Hydreigon.</p> </li> <li> <p><strong>Nasty Plot: This can be used to give Gholdengo more bite against defensive, slower teams after using Trick.</p> </li> <li> <p><strong>Focus Blast</strong>: Though it's accuracy can be an issue, Focus Blast is the best way around Kingambit.</p> </li> <li> <p><strong>Neutral Nature and Nature Mints: Use a neutral nature Gholdengo that has a Timid or Modest Mint used on it. This way, Gholdengo can eat any Berry without being confused after Trick.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying</strong>: With a Flying Tera type, Gholdengo gains an extremely useful immunity to Ground, which is especially useful on Choice Specs sets and against users of Fissure such as Dondozo.</p> </li> <li> <p><strong>Ghost</strong>: The extra damage from Shadow Ball can make Gholdengo a more effective late-game cleaner.</p> </li> <li> <p><strong>Fighting</strong>: Tera Fighting gives Gholdengo a far better chance of defeating Kingambit.</p> </li> <li> <p><strong>Water</strong>: In addition to giving Gholdengo a valuable resistance to Fire, this makes Gholdengo deal much more damage to Volcarona and common Tera Fire users such as Dragapult.</p> </li> <li> <p><strong>Steel: Make It Rain becomes very powerful with a Tera boost, at the cost of making Gholdengo vulnerable to Mach Punch from Breloom.</p> </li> <li> <p><strong>Normal: A Normal Tera type gives Gholdengo the edge against opposing Ghost-types, at the cost of becoming very vulnerable to Breloom.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Scarf</strong>: With this, Gholdengo outspeeds key threats such as Dragapult, Meowscarada, and Flutter Mane.</p> </li> <li> <p><strong>Choice Specs: Choice Specs make Gholdengo much more difficult to wall, with foes such as Dondozo getting 2HKOed.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li><strong>4 HP / 252 SpA / 252 Spe with Timid</strong>: Gholdengo mirror matches are common enough that maximizing Speed is usually a wise idea.</li> </ul> <ul> <li><strong>100 HP / 4 Def / 212 SpA / 28 SpD / 164 Spe with Modest</strong>: This bulkier spread for Choice Specs sets allows Gholdengo to survive an unboosted Shadow Ball from opposing Gholdengo, while outspeeding Timid Magnezone and Jolly Tyranitar.</li> </ul> "
      },
      {
        "name": "Nasty Plot",
        "description": "<ul> <li> <p>Nasty Plot makes Gholdengo a terror against slower teams, especially with its good bulk, unpredictable coverage, and diverse Tera Types.</p> </li> <li> <p><strong>Substitute</strong>: Substitute lets Gholdengo avoid residual damage from Garganacl's Salt Cure and ease prediction in general.</p> </li> <li> <p><strong>Psyshock: Psyshock lets Gholdengo break through Chansey and Clodsire more easily.</p> </li> <li> <p><strong>Focus Blast: Despite its reliability issues, Focus Blast lets Gholdengo defeat Kingambit.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: Flying Gholdengo gets the jump on dangerous Earthquake users such as Garchomp, Great Tusk, Iron Treads, and Dragonite.</p> </li> <li> <p><strong>Fighting: With Tera Fighting, Kingambit is unlikely to stop Gholdengo from sweeping.</p> </li> <li> <p><strong>Water</strong>: With this Tera type, Volcarona and Skeledirge are far less likely to stop Gholdengo from sweeping.</p> </li> <li> <p><strong>Normal: While it's a much worse defensive typing, Tera Normal does let Gholdengo surprise faster Ghost-types like Mimikyu, Flutter Mane, and Dragapult, at the cost of being weak to Mach Punch.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers: This is the most reliable option for keeping Gholdengo healthy and pairs especially well with Substitute.</p> </li> <li> <p><strong>Covert Cloak</strong>: Covert Cloak prevents Salt Cure from chipping down Gholdengo, making it far easier for it to run Recover against Garganacl.</p> </li> <li> <p><strong>Air Balloon</strong>: Air Balloon ruins Breloom's chances of winning the lead war against Gholdengo and makes Hippowdon easy setup bait.</p> </li> <li> <p><strong>Focus Sash: Despite Gholdengo's good bulk, Focus Sash is useful for giving it new opportunities to sweep.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 SpA / 252 Spe with Timid</strong>: Maximizing Speed is key to at least speedtie with opposing Gholdengo, and outspeeding several threats close to this Speed tier, such as Dragonite.</p> </li> <li> <p><strong>100 HP / 4 Def / 212 SpA / 28 SpD / 164 Spe with Modest</strong>: For sets with Recover, this bulkier spread can make sense, allowing Gholdengo to survive Shadow Ball from Gholdengo that lack an offensive item, and outpacing Timid Magnezone and Jolly Tyranitar.</p> </li> </ul> "
      },
      {
        "name": "Defensive",
        "description": "<ul> <li> <p>While Gholdengo's defensive stats aren't remarkable, it's fantastic typing and immunity to status moves like Taunt make it a great defensive Pokemon.</p> </li> <li> <p><strong>Thunder Wave</strong> This makes switching into this Gholdengo very difficult, as it can punish its speedier offensive checks like Roaring Moon and Meowscarada.</p> </li> <li> <p><strong>Hex versus Shadow Ball: Hex gives this Gholdengo a good offensive kick against paralyzed foes, but Shadow Ball is worth considering for its consistency.</p> </li> <li> <p><strong>Make It Rain versus Focus Blast</strong>: Make It Rain is Gholdengo's most consistent way of dealing damage to Garganacl, but this set's defensive nature makes it difficult to win the one-on-one. Focus Blast isn't nearly as reliable, but it's Gholdengo's best shot at making it past Kingambit.</p> </li> <li> <p><strong>EV Spread:The given EVs outspeed paralyzed Dragapult, while maximizing physical bulk.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: Avoiding Earthquake against foes like Garchomp makes Tera Flying extremely useful for Gholdengo; this also gives it protection against Fissure from the likes of Dondozo and Garganacl.</p> </li> <li> <p><strong>Normal: Tera Normal is not incredible defensively, but it does let Gholdengo surprise faster Ghost-types such as Dragapult, Flutter Mane, and Mimikyu.</p> </li> <li> <p><strong>Fairy: Tera Fairy gives Gholdengo a much better matchup against Dark-type attackers like Roaring Moon, Brute Bonnet, and Meowscarada.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Rocky Helmet: Rocky Helmet takes advantage of Gholdengo's excellent typing against physical moves, making it a good way to punish contact moves such as Outrage from Garchomp.</p> </li> <li> <p><strong>Covert Cloak</strong>: This is Gholdengo's best shot of outstalling Garganacl, since it grants an immunty to Salt Cure's effect.</p> </li> <li> <p><strong>Weakness Policy</strong> While this might seem strange on a defensive Pokemon, Weakness Policy lets Gholdengo beat opposing Gholdengo as long as they lack Choice Specs.</p> </li> </ul> "
      },
      {
        "name": "Assault Vest",
        "description": "<ul> <li> <p>Gholdengo's good bulk and unpredictable Tera types make it a great user of Assault Vest.</p> </li> <li> <p><strong>Dazzling Gleam</strong>: This punishes Dark-type revenge killers such as Hydreigon and Meowscarada when combined with Tera.</p> </li> <li> <p><strong>Thunderbolt: Thunderbolt is Gholdengo's best shot at muscling past Dondozo and also deals good damage to Corviknight and Tera Flying Garganacl.</p> </li> <li> <p><strong>Focus Blast: The only chance of getting past Kingambit is the inaccurate Focus Blast.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: A Flying-type makes Gholdengo much more difficult to revenge kill with common Earthquake users such as Garchomp, Great Tusk, and Dragonite.</p> </li> <li> <p><strong>Fighting: Tera Fighting is Gholdengo's best chance of breaking past Kingambit.</p> </li> <li> <p><strong>Water</strong>: With Assault Vest, Gholdengo can tank most Fire-type attacks against it and deal good damage to Volcarona and Iron Moth. Watch out for their Grass-type attacks, though.</p> </li> <li> <p><strong>Normal: With a Normal Tera type, Gholdengo can defeat several faster Ghost-types such as Dragapult, Mimikyu, and Flutter Mane, at the cost of a worse defensive typing and losing to Breloom.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 330577, "username": "Thick Fat Azumarill"}, {"user_id": 47861, "username": "Pearl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Roaring Moon": {"overview": "<p>This exciting new Paradox Pokemon is likely to have an impact on Battle Stadium Singles Series 2! While we wait for the metagame to settle, here are some sample sets to get you started. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ", "sets": [{"name": "Dragon Dance"}, {"name": "Booster Acrobatics", "description": "<p>The EVs give Roaring Moon a Speed boost from Protosynthesis.</p> "}, {"name": "Choice Item"}, {"name": "Jaw Lock Trapper"}]},
  "Iron Valiant": {
    "overview": "<p>This exciting new Paradox Pokemon is likely to have an impact on Battle Stadium Singles Series 2! While we wait for the metagame to settle, here are some sample sets to get you started. <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2-paradox-pandemonium-speed-tiers-and-more-inside.3714699/\">For more information on Series 2, check out the resource thread.</a></p> <p><a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-2.3715382/\">If you feel that this analysis is missing important information, feel free to leave feedback here.</a></p> ",
    "sets": [{"name": "Destiny Bond + Focus Sash"}, {"name": "Swords Dance"}, {"name": "Special Attacker", "description": "<ul> <li> <p>An Attack IV of 0-1 is needed to take minimum damage from Foul Play.</p> </li> <li> <p>This set should use a neutral nature with a Timid mint used on it, to prevent confusion from any berries received via Trick.</p> </li> </ul> "}]
  }
}