{
  "Murkrow": {"sets": [{"name": "Tailwind"}]},
  "Pelipper": {
    "overview": "<ul> <li> <p>Pelipper's role is primarily to set rain for its teammates, but functions it as an offensive support Pokemon with fully accurate Hurricanes and access to Tailwind and Wide Guard.</p> </li> <li> <p>Rain boosts the power of Water-type teammates such as Palafin, Floatzel, and Drednaw, and it also weakens Fire-type moves for Fire-weak partners such as Amoonguss, Gholdengo, and Kingambit.</p> </li> <li> <p>Pelipper's overall bulk is lacking, particularly specially, and super effective attacks like Thunderbolt from Gholdengo or Rotom-W are capable of OHKOing it.</p> </li> </ul> ",
    "sets": [
      {
        "name": "Pelipper",
        "description": "<ul> <li> <p>Hurricane's full accuracy in Rain makes it mandatory on Pelipper. It provides consistent damage and threatens the Grass-type Pokemon that resist Water.</p> </li> <li> <p>Hydro Pump is Pelipper's best Water-type attack but can be forgone if accuracy is a concern. Helping Hand paired with a fast Water-type Pokemon can compensate for the lack of reliable Water-type damage.</p> </li> <li> <p>Wide Guard can be used over Protect to answer ubiquitous spread moves such as Gholdengo's Make it Rain and Sylveon's Hyper Voice.</p> </li> <li> <p>Focus Sash ensures Pelipper survives attacks from Pokemon that might otherwise outspeed and OHKO it, such as Hydreigon and Annihilape. Damp Rock extends the uptime of Pelipper's rain-reliant teammates, allowing them to beat bulkier teams without requiring repeat switch-ins.</p> </li> <li> <p>252 Speed EVs with a Timid nature allow Pelipper to outspeed the entire metagame with Tailwind, as well as some notable Choice Scarf threats such as Annihilape.</p> </li> <li> <p>A Ground Tera type grants Pelipper an immunity to Electric and a resistance to Rock, which are its main concerns. With a Grass Tera type, it instead resists Electric, but this grants an immunity to Spore and Rage Powder.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 377427, "username": "smogon account"}]}
  },
  "Torkoal": {"sets": [{"name": "Trick Room Offense"}]},
  "Garchomp": {"sets": [{"name": "Offensive"}]},
  "Abomasnow": {
    "overview": "<ul> <li> <p>Snow lets Abomasnow carve itself a niche in the current metagame.</p> </li> <li> <p>Abomasnow is a decent offensive support Pokemon with Aurora Veil, which partners well with various Ice-types such as Baxcalibur, Cetitan, and Glaceon, as they gain a Defense boost in snow.</p> </li> <li> <p>Abomasnow's offensive typing is well-suited in a metagame filled with Ground-, Dragon-, and Water-types such as Garchomp, Hydreigon, and Rotom-W.</p> </li> <li> <p>Despite the Defense boost in snow, Abomasnow is still fairly specially frail with a poor set of weaknesses that leave it vulnerable to some of the most common special attackers in the format like Gholdengo and Armarouge.</p> </li> </ul> ",
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>Giga Drain gives Abomasnow some longevity when behind Aurora Veil and lets it beat the likes of Rotom-W and Palafin which resist Blizzard. Earth Power is an alternative that hits Fire- and Steel-types like Torkoal and Gholdengo, notably OHKOing the former when Terastallized.</p> </li> <li> <p>Abomansow runs items that help it overcome its crucial weaknesses. Focus Sash allows it to take any one hit, such as Rotom-H's Overheat, letting it set up Aurora Veil. Babiri Berry serves a similar purpose, allowing it to survive Gholdengo's Make It Rain and Tera Steel Hydreigon's Flash Cannon.</p> </li> <li> <p>The Speed investment allows Abomsnow to outspeed Garchomp while in Tailwind.</p> </li> <li> <p>Water is the primary Tera type used by Abomasnow, turning its Fire and Steel weaknesses into resistances. Ground is an alternative Tera type that allows it to fire off STAB-boosted Earth Powers, catching its common checks by surprise.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 294287, "username": "yuki"}]}
  },
  "Lilligant": {"sets": [{"name": "Sun Support"}]},
  "Amoonguss": {"sets": [{"name": "Support"}]},
  "Hydreigon": {"sets": [{"name": "Offensive"}, {"name": "Assault Vest"}]},
  "Sylveon": {"sets": [{"name": "Offensive"}, {"name": "Choice Specs"}]},
  "Hatterene": {"sets": [{"name": "Trick Room Sweeper"}]},
  "Armarouge": {"sets": [{"name": "Trick Room"}]},
  "Ceruledge": {"sets": [{"name": "Bulk Up"}]},
  "Kilowattrel": {
    "overview": "<ul> <li> <p>Kilowattrel stands out as one of the best Tailwind setters in the current metagame. Its base 125 Speed stat lets it set Tailwind first, with very little Prankster Tailwind Pokemon stopping it from doing so.</p> </li> <li> <p>Kilowattrel has a respectable base 105 Special Attack stat and a good offensive typing, allowing it to tackle the likes of Meowscarada and Gyarados well.</p> </li> <li> <p>Kilowattrel appreciates immediately hard-hitting partners such as Choice Specs Gholdengo and Garchomp to break through opposing teams. Gholdengo is great in particular thanks to its immunity to Dragonite's Extreme Speed.</p> </li> <li> <p>Kilowattrel is particularly frail, meaning it often only gets to set Tailwind and fire off a single attack before it faints. It also means in late-game scenarios, it is unreliable at dueling the meta's most common attackers like Gholdengo and Hydreigon.</p> </li> </ul> ",
    "sets": [
      {"name": "Support", "description": "<ul> <li> <p>Air Slash is Kilowattrel's primary Flying-type STAB move of choice due to its higher accuracy than Hurricane, though the latter may be seen on rain teams.</p> </li> <li> <p>Discharge is a good spread option when next to a Ground- or Electric-type partner like Garchomp or Rotom-F. Volt Switch allows Kilowattrel to use its high base Speed to pivot into a partner that can better use the extra Speed from Tailwind.</p> </li> <li> <p>Competitive acts as an Intimidate-deterrent for physically attacking partners such as Garchomp, Baxcalibur, and Ceruledge.</p> </li> <li> <p>Focus Sash is a must-have, as Kilowattrel is incredibly frail and unable to take any super effective or strong neutral attacks such as Baxcalibur's Icicle Crash and Tera Normal Dragonite's Extreme Speed.</p> </li> <li> <p>Kilowattrel rarely Terastallizes, but when it does, it prefers to use same type Tera to boost the power of one of its STAB moves.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 541847, "username": "yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 294287, "username": "yuki"}]}
  },
  "Tinkaton": {"sets": [{"name": "Bulky Attacker"}]},
  "Annihilape": {
    "overview": "<ul> <li> <p>Annihilape is a great Bulk Up user in Series 1 thanks to its unresisted STAB combination, good bulk, Rage Fist, and Defiant, which stops Attack drops from slowing down its clean up.</p> </li> <li> <p>It can also utilize Choice Scarf to good effect, using Final Gambit as an immediate one-on-one trade option.</p> </li> <li> <p>Rage Fist increases in power every time Annihilape is hit, making it a deadly move during longer games thanks to its good natural bulk.</p> </li> <li> <p>Annihilape sports positive matchups versus much of the metagame, including, but not limited to, Maushold, Hydreigon, and Meowscarada. Additionally, its Defiant can be used to deter Intimidate Pokemon such as Arcanine and Gyarados, allowing strong ally physical attackers such as Garchomp and Gyarados to thrive.</p> </li> </ul> ",
    "sets": [
      {"name": "Bulk Up", "description": "<ul> <li> <p>To set up with Bulk Up safely, Annihilape enjoys dual screens and redirection support from Pokemon such as Grimmsnarl and Amoonguss.</p> </li> <li> <p>Tera Blast is used to KO Steel-types Drain Punch does not hit super effectively, such as Gholdengo, without relying on Rage Fist being boosted.</p> </li> <li> <p>The Fire Tera type gives Annihilape a key resistance to Fairy and neutrality to Ghost and Psychic, useful against opposing Annihilape, Meowscarada, and Armarouge. Furthermore, it lets Annihilape effectively combat Trick Room because, when played under dual screens, Annihilape can counter major Trick Room threats like Hatterene and Tera Fire Torkoal. Alternatively, picking Tera Water focuses on defensive advantages, primarily resistances to Steel- and Fire-type moves such as Gholdengo's Make it Rain and Torkoal's STAB moves.</p> </li> </ul> "},
      {
        "name": "Choice Scarf",
        "description": "<ul> <li> <p>This set is used commonly on Trick Room teams. Annihilape outspeeding most Pokemon, OHKOing them with Final Gambit, and being immune to Fake Out helps teammates like Hatterene and Armarouge set Trick Room, and fainting gives a free switch-in to a slow Trick Room beneficiary such as Tera Fire Torkoal. U-turn provides a switch-in without sacrificing Annihilape, and, while it doesn't OHKO, it hits common Pokemon such as Oranguru and Indeedee-F for large amounts of damage.</p> </li> <li> <p>Shadow Claw is a consistent damage-dealing option that doesn't rely on foes to power it up. However, Rage Fist can still be utilized effectively thanks to Annihilape's bulk. Phantom Force avoids attacks and ignores protecting moves, giving Annihilape opportunities to deal unavoidable damage.</p> </li> <li> <p>While not normally Terastallized, Annihilape can use Tera Ghost to remove its Fairy weakness and give a huge boost to its Ghost-type move, which becomes able to heavily dent much of the metagame.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}, {"user_id": 541847, "username": "yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}]}
  },
  "Farigiraf": {"sets": [{"name": "Bulky Trick Room"}]},
  "Baxcalibur": {"sets": [{"name": "Dragon Dance"}, {"name": "Assault Vest"}]},
  "Gholdengo": {"sets": [{"name": "Choiced Attacker"}, {"name": "Nasty Plot"}]}
}