{
  "Dugtrio": {"sets": [{"name": "Choice Scarf"}]},
  "Cloyster": {"sets": [{"name": "Spikes"}]},
  "Ditto": {"sets": [{"name": "Imposter"}]},
  "Blissey": {"sets": [{"name": "Defensive"}, {"name": "Calm Mind"}]},
  "Pelipper": {"sets": [{"name": "Rain Setter"}]},
  "Masquerain": {"sets": [{"name": "Sticky Web"}]},
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Gothitelle": {"sets": [{"name": "Choice Specs"}]},
  "Toxapex": {"sets": [{"name": "The Pex"}]},
  "Corviknight": {"sets": [{"name": "Physically Defensive"}, {"name": "Specially Defensive"}]},
  "Barraskewda": {"sets": [{"name": "Choice Band"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Dragapult": {"sets": [{"name": "Dragon Dance"}, {"name": "Pivot"}, {"name": "Choice Specs"}]},
  "Skeledirge": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Skeledirge is a decent Koraidon check, reliably beating Choice Scarf and Swords Dance + Flame Charge sets while pivoting into and scouting Choice Band Koraidon. Skeledirge is notably immune to trapping by Dugtrio and Gothitelle, which ensures its viability as an alternative to the more passive Toxapex. Torch Song is Skeledirge's most reliable STAB move and gives it the potential to snowball late-game into a sweeper. Will-O-Wisp prevents physical attackers like Koraidon, Great Tusk, and Chien-Pao from setting up on it and also annoys passive Pokemon like Toxapex, Ting-Lu, and Alomomola. Earth Power punishes Miraidon and Chi-Yu as they switch in while also letting it beat Garganacl and Tera Fire Koraidon. Alternatively, Hex complements Will-O-Wisp, doing heavy damage to neutral targets such as Toxapex and Pelipper. Fairy is Skeledirge's preferred Tera Type, granting it a valuable immunity to Koraidon's Outrage and allowing it to absorb otherwise supereffective attacks like Crunch from Chien-Pao and Earthquake or Headlong Rush from Great Tusk. Skeledirge fits best on balance teams that appreciate its ability to neuter Koraidon and can effectively handle the numerous Pokemon that can threaten Skeledirge, such as Great Tusk, Miraidon, and Iron Bundle. As a result, ideal teammates include revenge killers such as Choice Scarf Miraidon and Choice Band Chien-Pao and defensive staples like Corviknight, Clodsire, and Ting-Lu.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 374620, "username": "pichus"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 426798, "username": "Geysers"}]}
  },
  "Pawmot": {"sets": [{"name": "Volt Absorb Fairy"}]},
  "Garganacl": {"sets": [{"name": "Specially Defensive"}]},
  "Espathra": {"sets": [{"name": "Calm Mind"}]},
  "Palafin": {"sets": [{"name": "Choice Band"}]},
  "Glimmora": {"sets": [{"name": "Entry Hazard Lead"}]},
  "Houndstone": {"sets": [{"name": "Choice Band"}]},
  "Dondozo": {"sets": [{"name": "Defensive"}]},
  "Annihilape": {"sets": [{"name": "Bulk Up"}]},
  "Clodsire": {"sets": [{"name": "Defensive"}]},
  "Kingambit": {"sets": [{"name": "Offensive"}]},
  "Great Tusk": {"sets": [{"name": "Offensive Utility"}, {"name": "Defensive"}, {"name": "Choice Item"}, {"name": "Setup Sweeper", "description": "<p>These are samples sets while we work on new analyses. Stay tuned!</p> "}]},
  "Scream Tail": {"sets": [{"name": "Defensive"}]},
  "Flutter Mane": {"sets": [{"name": "Choice Specs"}, {"name": "Calm Mind"}]},
  "Iron Treads": {"sets": [{"name": "Specially Defensive"}, {"name": "Offensive Utility"}]},
  "Iron Bundle": {"sets": [{"name": "Heavy-Duty Boots"}, {"name": "Choice Specs"}]},
  "Iron Hands": {"sets": [{"name": "Swords Dance"}]},
  "Iron Moth": {"sets": [{"name": "Agility"}]},
  "Baxcalibur": {"sets": [{"name": "Dragon Dance"}]},
  "Gholdengo": {"sets": [{"name": "Choice Scarf"}, {"name": "Nasty Plot"}]},
  "Wo-Chien": {"sets": [{"name": "Defensive"}]},
  "Chien-Pao": {
    "sets": [
      {"name": "Choice Band"},
      {
        "name": "Setup Sweeper",
        "description": "<p>Chien-Pao is one of the most threatening sweepers in Anything Goes due to its solid typing, ability, and stats. Swords Dance allows Chien-Pao to break through walls such as Toxapex, Alomomola, and Corviknight. Ice Spinner can be considered over Icicle Crash due to its perfect accuracy, but it is a slightly weaker contact move that cannot flinch. Sucker Punch is the preferred priority move option, allowing it to OHKO Flutter Mane without a boost, as well as Iron Bundle and Miraidon after a Swords Dance. Alternatively, Ice Shard OHKOes Koraidon, Miraidon, and Flutter Mane at +2 Attack after Stealth Rock. Heavy-Duty Boots is the best item on this set, but Life Orb and Focus Sash are solid picks on hyper offense builds and other teams with good entry hazard control. Life Orb lets Chien-Pao get some crucial OHKOs at +2 Attack, notably against Miraidon and Koraidon with Ice Shard and Corviknight and Toxapex with Crunch. Tera Dark makes its Dark-type moves stronger while shedding the weaknesses from its Ice typing, notably reducing Stealth Rock damage and weakening Iron Head and Body Press from Corviknight as well as Torch Song from Skeledirge. Chien-Pao fits best on offensive teams and flourishes with other wallbreakers like Miraidon, Koraidon, Iron Bundle, and offensive Great Tusk. On bulkier builds, teammates like defensive Great Tusk, Ting-Lu, and Iron Treads set entry hazards while checking fast Pokemon like Koraidon and Miraidon. If forgoing Heavy-Duty Boots, it is essential to pair Chien-Pao with lead entry hazard setters like Glimmora and Froslass on offensive teams and Iron Treads and Great Tusk on bulkier teams, as they additionally prevent opposing entry hazards from going up.</p> "
      },
      {"name": "All-out Attacker"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 471586, "username": "Seldanna"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 374620, "username": "pichus"}]}
  },
  "Ting-Lu": {"sets": [{"name": "Defensive Pivot"}]},
  "Chi-Yu": {
    "sets": [
      {"name": "Choice Scarf"},
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Chi-Yu is one of the metagame's most devastating wallbreakers. Beads of Ruin and a high Special Attack stat let it consistently force a KO whenever it comes in. Overheat allows Chi-Yu to OHKO or 2HKO even bulky resistant foes, with Flamethrower having perfect accuracy and not dropping Chi-Yu's Special Attack. Dark Pulse allows Chi-Yu to immediately threaten Fire-resistant Pokemon like Toxapex, Skeledirge, and Garganacl, 2HKOing or OHKOing them without sun. Fire Blast can reach important damage thresholds, such as 2HKOing Blissey, without the Special Attack drop that accompanies Overheat, with Psychic instead preventing Toxapex from scouting Chi-Yu's move. Tera Fire turns Chi-Yu's 2HKOs against Pokemon like Toxapex and Double Dance Miraidon into OHKOs under sun, and it guarantees 2HKOs on even the bulkiest defensive Pokemon like Blissey and Garganacl, OHKOing them in sun and with minor chip damage. A Modest nature is preferred, but a Timid nature can be considered if Jolly Great Tusk is an issue. Koraidon is an incredible partner, setting sun and bringing Chi-Yu in with U-turn; in exchange, Chi-Yu greatly threatens all of Koraidon's checks. Pivots such as Corviknight and the aforementioned Koraidon are greatly appreciated, as they can let Chi-Yu switch in without worrying about its poor bulk. Entry hazard removal from Great Tusk, Corviknight, or Iron Treads is very helpful due to Chi-Yu's weakness to Stealth Rock and its tendency to switch out after a KO. Chi-Yu is often forced out by faster Pokemon like Miraidon and Koraidon, so defensive switch-ins to them like Clodsire, Toxapex, Ting-Lu, and Corviknight are good partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 3717133, "username": "pichus"}, {"user_id": 302985, "username": "lotiasite"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 584685, "username": "TaxFraud"}]}
  },
  "Roaring Moon": {"sets": [{"name": "Tera Flying"}, {"name": "Tera Steel"}]},
  "Iron Valiant": {"sets": [{"name": "Swords Dance"}, {"name": "Mixed"}]},
  "Koraidon": {
    "sets": [
      {"name": "Setup Flame Charge"},
      {"name": "Choice Scarf"},
      {
        "name": "All-out Attacker",
        "description": "<p>Great Attack and Speed stats along with a solid moveset make Koraidon an incredible wallbreaker. Close Combat hits Steel- and Dark-types such as Iron Treads and Ting-Lu. Flare Blitz OHKOes Corviknight, Iron Treads, and Gholdengo and allows Koraidon to deal with Scream Tail better. Flare Blitz also breaks through Toxapex, Great Tusk, and Skeledirge if they have Terastallized into the Fairy type. Stomping Tantrum 2HKOes Skeledirge and Toxapex. Additionally, Skeledirge switching into Close Combat on the previous turn doubles Stomping Tantrum's power, allowing Koraidon to OHKO Skeledirge. Wild Charge OHKOes Pelipper and 2HKOes Toxapex. Alternatively, Outrage is a good all-around Dragon-type STAB option that still hits Pelipper and Alomomola but makes it vulnerable to Tera Fairy from checks such as Pelipper and Toxapex as well as revenge killers such as Flutter Mane and Iron Bundle. Tera Fire boosts Flare Blitz, lets Koraidon ward off Will-O-Wisp from Skeledirge, and lets it resist Ice- and Fairy-type moves from Pokemon such as Chien-Pao and Iron Bundle, Double Dance Miraidon, and Flutter Mane. Entry hazard removal options such as Corviknight, Great Tusk, and Iron Treads are good teammates, as Koraidon can easily get worn down due to Life Orb and Flare Blitz recoil as well as Rocky Helmet chip from Alomomola and Toxapex. Corviknight can also switch into Iron Bundle and Flutter Mane, which can KO Koraidon after minimal chip. Offensive Pokemon such as Great Tusk, Walking Wake, and Chi-Yu take full advantage of Koraidon's ability to set up sun. Miraidon pressures Koraidon's checks like Great Tusk and Skeledirge well and appreciates Koraidon's ability to pressure its checks like Iron Treads and Ting-Lu as well.</p> "
      },
      {"name": "Choice Band"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 374620, "username": "pichus"}, {"user_id": 360582, "username": "Guard"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}]}], "writtenBy": [{"user_id": 532881, "username": "Frozoid"}]}
  },
  "Miraidon": {
    "sets": [
      {"name": "Offensive"},
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Miraidon can break through all of its checks owing to its excellent stats and stellar movepool, making it the strongest wallbreaker in Anything Goes. Overheat hits Iron Treads and also eases predictions against defensive cores such as Corviknight + Great Tusk. Tera Dragon boosts Draco Meteor, notably allowing Miraidon to 2HKO Ting-Lu while also getting rid of its weakness to Dugtrio. A Timid nature allows Miraidon to Speed tie against Koraidon and Chien-Pao, but Modest may be used to further boost its strength. Miraidon is threatened by revenge killers like Iron Bundle, Chien-Pao, and Choice Scarf users like Koraidon, Miraidon, and Great Tusk, so special walls like Clodsire and Blissey and physical walls like Toxapex, Great Tusk, and Alomomola are used to soak the offensive pressure. Dugtrio can trap Iron Bundle, Clodsire, and Iron Treads, as well as opposing Miraidon and Koraidon locked into Dragon-type moves with Tera Fairy.</p> "
      },
      {"name": "Choice Scarf"},
      {
        "name": "Double Dance",
        "description": "<p>Double Dance Miraidon is one of the most potent sweepers and wincons in the AG metagame. It outspeeds the entire metagame after using Agility, and can muscle through defensive Pokemon after a boost or two from Calm Mind. Parabolic Charge greatly improves Miraidon's longevity, and Electric Terrain makes up for its low Base Power, notably letting Miraidon outheal Blissey's Seismic Toss after two Calm Mind boosts. Dazzling Gleam hits Ting-Lu, Great Tusk, and opposing Dragon-types for super effective damage. Tera Fairy enables setup on the Ice-, Ground-, and Dragon-type attacks that would otherwise threaten it, boosts the power of Dazzling Gleam, and limits revenge killing attempts from Koraidon, Miraidon, Chien-Pao, and Iron Bundle. The given EV spread allows Miraidon to outspeed Quark Drive-boosted Iron Bundle after an Agility and maximizes Leftovers recovery; the rest is put into Special Attack and Defense. Gothitelle and Dugtrio are phenomenal partners for their ability to trap Clodsire and Iron Treads, removing defensive counterplay to Miraidon. Chien-Pao and Great Tusk are able to bait in physically defensive Pokemon like Toxapex, Corviknight, and Alomomola for Miraidon to set up on and greatly threaten Clodsire and Iron Treads. With dual screens support from Grimmsnarl, Miraidon is able to set up on more Pokemon, and revenge killing it becomes even more difficult. Toxic Spikes is a major hindrance, so Poison-types like Toxapex and Clodsire, or hazard removal from Iron Treads or Corviknight is greatly appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 374620, "username": "pichus"}, {"user_id": 360582, "username": "Guard"}, {"user_id": 471586, "username": "Seldanna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 302985, "username": "lotiasite"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 584685, "username": "TaxFraud"}, {"user_id": 374620, "username": "pichus"}]}
  }
}