{
  "Clefable": {"sets": {"Unaware Wall": {}}},
  "Ninetales-Alola": {"sets": {"Aurora Veil": {}}},
  "Dragonite": {"sets": {"Dragon Dance": {"description": "<p>156 Speed outspeeds base 110 Pokemon at +1</p>"}}},
  "Mewtwo": {"sets": {"Life Orb": {}, "Nasty Plot": {}, "StallTwo": {}, "Choice Specs": {}}},
  "Slowking-Galar": {"sets": {"Defensive Pivot": {}}},
  "Skarmory": {"sets": {"Iron Defense": {}}},
  "Blissey": {"sets": {"Wall": {}, "Specially Defensive": {}}},
  "Lugia": {"sets": {"Specially Defensive": {}, "Calm Mind": {}}},
  "Torkoal": {"sets": {"Sun Setter": {}}},
  "Deoxys": {
    "sets": {
      "All-Out-Attacker": {},
      "Lead": {
        "description": "<p>Deoxys is one of the best leads in Ubers UU thanks to its solid offensive stats and good movepool allowing it to act as an offensive threat after setting up entry hazards. Psycho Boost is an amazing one-time nuke, dealing serious damage to most Pokemon that don't resist it. Superpower allows Deoxys to target Pokemon like Arceus-Dark, Dialga, and Kyurem-W. Generally, Deoxys prefers Stealth Rock in the final moveslot, allowing it to nearly guarantee it sets up both Stealth Rock and a layer of Spikes, although Taunt can be run instead allowing it to stop Pokemon from setting up or laying their own entry hazards. Focus Sash allows Deoxys to guarantee at least one layer of entry hazards. Tera Psychic boosts Deoxys's Psycho Boost, although Tera Ghost can be run instead, allowing it to spinblock Pokemon like Great Tusk and Cyclizar and block Extreme Speed from Arceus-Fire, which otherwise troubles it. Deoxys fits best on offense and hyper offense teams looking for a dedicated lead that can set up hazards consistently. Offensive threats like Mewtwo, Zacian, and Ogerpon-H appreciate the entry hazards Deoxys sets up to wear down their switch-ins like Arceus-Dark, Solgaleo, and Giratina. Pokemon like Spectrier and Gholdengo that can spinblock are also nice to have. If Deoxys is not running Taunt threats like Arceus-Fire, Arceus-Dark, and Mewtwo may try to use it as set-up fodder, so Pokemon like Zamazenta-C, Palafin, and Magearna that can counter these threats are helpful to have.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "nap00", "user_id": 610920}, {"username": "Leo Justice", "user_id": 587908}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Garchomp": {"sets": {"Suicide Lead": {}, "TankChomp": {}}},
  "Dialga": {"sets": {"Mixed Utility": {}, "Specially Defensive": {}, "Trick Room Setter": {}}},
  "Palkia": {"sets": {"Choice Scarf": {}, "Trick Room Setter": {}}},
  "Palkia-Origin": {"sets": {"Wallbreaker": {}}},
  "Giratina": {"sets": {"Specially Defensive": {}, "Defog": {}}},
  "Arceus-Dark": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Calm Mind Arceus-Dark is an incredibly potent sweeper and stallbreaker in Ubers UU. Its amazing bulk allows it to set up on the many special attackers in the tier, such as Kyurem-W, Chi-Yu, and Mewtwo, and Taunt stops Blissey and other Arceus formes from setting up alongside it with their own Calm Mind, blocks Encore from Magearna, and prevents phazing from Giratina, Skarmory, and Dialga. Recover allows it to increase its longevity and set up on some physical attackers, such as Solgaleo and Kingambit. Tera Fairy grants Arceus-Dark a resistance to Fighting-type moves from the likes of Urshifu-S, Deoxys, and Mewtwo, along with an immunity to Dragon Tail, the only phazing move that cannot be prevented by Taunt. Tera Poison turns its Fairy, Fighting, and Bug weaknesses into resistances, which is incredible for setting up on Zacian, Magearna, and Zamazenta-C. Arceus-Dark greatly benefits from the help of Pokemon that can deal with physical attackers, as Zacian and Zamazenta-C both offensively check it, so Dondozo, Lugia, Skarmory, physically defensive Solgaleo, and Magearna form good defensive cores with it. Other Pokemon that pair well with Arceus-Dark are Zamazenta-C and Annihilape, as both are Defense-boosting offensive sweepers that can wall and eliminate physical attackers for Arceus-Dark to freely take care of special attackers. Arceus-Dark is very entry hazard weak, so Pokemon like Giratina and Great Tusk that can remove hazards for Arceus-Dark are greatly appreciated. Giratina appreciates Arceus-Dark's ability to check Dark- and Ghost-types like Gholdengo and Spectrier, and Great Tusk appreciates Arceus-Dark beating common checks to it like Giratina, Skarmory, and Deoxys.</p>"
      },
      "Defensive": {
        "description": "<p>Arceus-Dark has extensive options as a defensive Pokemon in Ubers UU checking metagame threats like Palafin-H and Deoxys. Foul Play hits physical attackers like Arceus-Fire and Palafin-H hard while still scoring solid damage versus Psychic-types such as Mewtwo and Lugia. Arceus-Dark can run Will-O-Wisp to cripple physical attackers, like Zacian and Zamazenta-C switching in, or it can run Stealth Rock to give its team entry hazard support if a partner doesn't have the move. Roar phazes many setup sweepers, such as Arceus and Mewtwo, whereas Taunt blocks them from setting up altogether. Taunt also shuts down many lead Pokemon like Smeargle and Galvantula and can force your opponent on the back foot provided it wins a Speed tie against opposing Arceus-Dark. Tera Poison turns Dark's Fairy, Fighting, and Bug weaknesses into resistances, which is especially helpful versus Zacian and Volcarona. Tera Fairy gives similar resistances to Poison, but the neutrality to Psychic and Ground helps against Great Tusk and Deoxys, and the valuable Dragon immunity lets Arceus-Dark beat Kyurem-W. Arceus-Dark benefits from specially defensive partners like Blissey, Calm Mind Clefable, and Giratina due to being weak to special attackers such as Magearna and Palkia-O. Arceus-Dark also pairs well with Corviknight and Regieleki, as both can remove hazards to keep it healthy and pivot it onto the field.</p>"
      },
      "Support": {}
    },
    "credits": {"writtenBy": [{"username": "imperialorder241", "user_id": 626445}], "teams": [{"name": "Quality checked by", "members": [{"username": "SwordIsBored", "user_id": 489963}, {"username": "Leo Justice", "user_id": 587908}, {"username": "nap00", "user_id": 610920}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Arceus-Dragon": {"sets": {"Support": {}}},
  "Arceus-Electric": {"sets": {"Calm Mind": {}}},
  "Arceus-Fighting": {"sets": {"Cosmic Power": {}}},
  "Arceus-Fire": {"sets": {"E-Killer": {}}},
  "Arceus-Grass": {"sets": {"Calm Mind + Taunt": {}}},
  "Arceus-Poison": {"sets": {"Dragon Dance": {}}},
  "Arceus-Psychic": {"sets": {"Cosmic Power": {}}},
  "Excadrill": {"sets": {"Sand Rush Sweeper": {}, "Lead": {}}},
  "Galvantula": {"sets": {"Sticky Web Setter": {}}},
  "Volcarona": {"sets": {"Quiver Dance": {"description": "<p>124 Speed is to outspeed Deoxys at +1</p>"}}},
  "Reshiram": {"sets": {"Chocie Scarf": {}}},
  "Landorus": {"sets": {"Choice Scarf": {}, "Life Orb": {}}},
  "Landorus-Therian": {"sets": {"Choice Scarf": {}, "Defensive": {}}},
  "Kyurem-White": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Kyurem-W is one of the most dangerous Pokemon in Ubers UU thanks to its combination of high Special Attack, good coverage options, and usable defensive profile, making it one of the tier's most dangerous revenge killers and special attackers. Draco Meteor + Ice Beam is a great STAB combination, hitting the majority of the tier. Freeze-Dry gives Kyurem-W coverage for Water-types like Palafin and Toxapex. Fusion Flare gives Kyurem-White coverage for Steel-types like Magearna, Solgaleo, and Zamazenta-C. Tera Fire allows Kyurem-W to boost Fusion Flare as well as provides it with a nifty resistance to Fairy- and Steel-type attacks from the likes of Zacian, Magearna, Dialga, and Solgaleo. Kyurem-W fits best on balance and offensive teams looking for a strong revenge killer and special attacker. Kyurem-W struggles to break through specially defensive walls like Blissey and Solgaleo, so Pokemon that can deal with these walls like Arceus-Fire, Zamazenta-C, and Landorus-T, make good partners. Entry hazard control from Pokemon like Great Tusk and Corviknight increases Kyurem-W's longevity.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Kyurem-W is an unparalleled wallbreaker in Ubers UU. Draco Meteor is an nuclear bomb of an attack, easily OHKOing most neutral targets such as Dialga and Mewtwo. Ice Beam gives Kyurem-W a strong move versus Fairy-types such as Zacian and Clefable while also allowing it to hit Ground- and Flying-types, such as Great Tusk and Landorus, hard. Freeze-Dry allows Kyurem-W to OHKO Palafin and Palkia-O without dropping its Special Attack with Draco Meteor. Fusion Flare allows Kyurem-W to hit the Steel-types that would otherwise resist Ice and Dragon, such as Magearna and Solgaleo. Tera Fire is a must to power up its Fusion Flare while also helping against Zacian and Solgaleo by making its Fairy and Steel weaknesses into resistances. Kyurem-W is incredibly vulnerable to entry hazards due to its Stealth Rock weakness, meaning it appreciates hazard removal from Giratina or Great Tusk. Another great teammate that helps with hazard control is Hatterene, due to its immunity to Dragon-type moves helping against Arceus-Dragon and Garchomp, as its Magic Bounce ability provides a proactive way of preventing hazards. Kyurem-W also pairs well with slower pivots, such as Galarian Slowking and Solgaleo, as they help to get it onto the field safely. Kyurem-W is especially vulnerable to the many faster threats in the metagame, such as Zacian, Zamazenta-C, and Palkia-O, so it likes the support of Sticky Web from Galvantula and Smeargle or paralysis from Magearna and Giratina.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}, {"username": "imperialorder241", "user_id": 626445}], "teams": [{"name": "Quality checked by", "members": [{"username": "Leo Justice", "user_id": 587908}, {"username": "Finchely", "user_id": 642468}, {"username": "nap00", "user_id": 610920}]}, {"name": "Grammar checked by", "members": [{"username": "sunny004", "user_id": 197240}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Toxapex": {"sets": {"Defensive": {}}},
  "Solgaleo": {"sets": {"Specially Defensive": {}, "Trick Room Setter": {}}},
  "Necrozma-Dawn-Wings": {"sets": {"Offensive Trick Room": {}, "Calm Mind": {}, "Grassy Seed Sweeper": {}, "Choice Specs": {}, "Special Utility": {}}},
  "Magearna": {"sets": {"Utility": {}, "Double Dance": {}, "Trick Room Setter": {}}},
  "Rillaboom": {"sets": {"Choice Band": {}, "Assault Vest": {"description": "<p>An Adamant nature and 52 Attack EVs allow Rillaboom to KO Palkia-O with Wood Hammer + Grassy Glide</p>"}}},
  "Corviknight": {"sets": {"Physically Defensive": {}}},
  "Zacian": {"sets": {"Wallbreaker": {}, "Choice Band": {}}},
  "Zamazenta-Crowned": {
    "sets": {
      "IronPress": {
        "description": "<p>With its combination of robust defenses and good Attack, Zamazenta-C is an excellent mid- or late-game sweeper for bulkier teams. Body Press synergizes well with Iron Defense and Dauntless Shield, and when combined with Zamazenta-C's brilliant natural bulk, it can quickly clean up weakened teams. Behemoth Bash or Heavy Slam lets it Zamazenta-C answer Fairy-types, like Zacian and Tera Fairy Arceus-Dark, and Crunch lets it tackle Psychic- and Ghost-types, like Mewtwo, Giratina, Lugia, and Deoxys. 200 Speed EVs with a Jolly Nature allow it to outspeed Cyclizar, 112 Attack EVs let it have a favorable roll to 2HKO Mewtwo, and the rest of the EVs go into Defense to maximize Body Press's damage. Tera Water lets Zamazenta-C stay in on more opponents foes like Arceus-Fire, Palafin, Chi-Yu, and Kyurem-W, and Tera Flying lets you it resist Fighting-type moves from the likes of Mewtwo, Zacian, and Deoxys and be immune to Ground-type moves from Great Tusk, Landorus, and Ursaluna, though a weakness to Stealth Rock is added. Being able to check Magearna, Zacian, Dialga, Ursaluna-B, Arceus-Dark, Palafin, and Palkia-O, Zamazenta-C is appreciated by Giratina, Chi-Yu, Palkia-O, Arceus-Dark and Mewtwo. Zamazenta-C suffers from being worn down by entry hazards, so a hazard remover like Great Tusk or Giratina is needed. It also appreciates hazard support of its own from setters like Magearna and Dialga. Fighting-, Ground-, and Fire-resistant Pokemon like Arceus-Poison, Rillaboom, and Giratina are also a boon to Zamazenta-C, as they can stomach whatever hits come at it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Go make a sandwitch", "user_id": 275219}], "teams": [{"name": "Quality checked by", "members": [{"username": "nap00", "user_id": 610920}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Urshifu": {"sets": {"Choice Band": {}}},
  "Urshifu-Rapid-Strike": {"sets": {"Choice Scarf": {}}},
  "Regieleki": {"sets": {"Dual Screens": {}, "Offensive Utility": {}}},
  "Spectrier": {"sets": {"Choice Scarf": {}, "Nasty Plot Sweeper": {}}},
  "Ursaluna": {"sets": {"Trick Room Sweeper": {}}},
  "Sneasler": {"sets": {"Unburden Sweeper": {}, "Choice Scarf": {}}},
  "Garganacl": {"sets": {"Iron Defense": {}, "Curse": {}, "Stealth Rock": {}}},
  "Espathra": {"sets": {"Calm Mind": {"description": "<p>12 speed EVs allow you to outspeed base 120 Speed Pokemon at +1</p>"}}},
  "Palafin": {"sets": {"Choice Band": {}}},
  "Cyclizar": {"sets": {"Utility": {}}},
  "Dondozo": {"sets": {"Unaware Wall": {}}},
  "Annihilape": {"sets": {"Bulk Up": {}, "Choice Scarf": {}}},
  "Kingambit": {"sets": {"Swords Dance": {}}},
  "Great Tusk": {"sets": {"Offensive Utility": {}, "Physically Defensive": {}}},
  "Iron Treads": {"sets": {"Utility": {}}},
  "Iron Moth": {"sets": {"Booster Energy": {}}},
  "Baxcalibur": {"sets": {"Swords Dance": {}, "Dragon Dance": {}}},
  "Gholdengo": {"sets": {"Offensive": {}, "Specially Defensive": {}, "Choice Scarf": {}}},
  "Chi-Yu": {"sets": {"Choice Scarf": {}, "Choice Specs": {}}},
  "Roaring Moon": {"sets": {"Dragon Dance": {}}},
  "Walking Wake": {"sets": {"Choice Specs": {}}},
  "Ogerpon-Hearthflame": {"sets": {"Swords Dance": {}}}
}