{
  "Annihilape": {
    "overview": "<ul> <li> <p>Annihilape is a great Bulk Up user in Series 1 thanks to its unresisted STAB combination, good bulk, Rage Fist, and Defiant, which stops Attack drops from slowing down its clean up.</p> </li> <li> <p>It can also utilize Choice Scarf to good effect, using Final Gambit as an immediate one-on-one trade option.</p> </li> <li> <p>Rage Fist increases in power every time Annihilape is hit, making it a deadly move during longer games thanks to its good natural bulk.</p> </li> <li> <p>Annihilape sports positive matchups versus much of the metagame, including, but not limited to, Maushold, Hydreigon, and Meowscarada. Additionally, its Defiant can be used to deter Intimidate Pokemon such as Arcanine and Gyarados, allowing strong ally physical attackers such as Garchomp and Gyarados to thrive.</p> </li> </ul> ",
    "sets": [
      {"name": "Bulk Up", "description": "<ul> <li> <p>To set up with Bulk Up safely, Annihilape enjoys dual screens and redirection support from Pokemon such as Grimmsnarl and Amoonguss.</p> </li> <li> <p>Tera Blast is used to KO Steel-types Drain Punch does not hit super effectively, such as Gholdengo, without relying on Rage Fist being boosted.</p> </li> <li> <p>The Fire Tera type gives Annihilape a key resistance to Fairy and neutrality to Ghost and Psychic, useful against opposing Annihilape, Meowscarada, and Armarouge. Furthermore, it lets Annihilape effectively combat Trick Room because, when played under dual screens, Annihilape can counter major Trick Room threats like Hatterene and Tera Fire Torkoal. Alternatively, picking Tera Water focuses on defensive advantages, primarily resistances to Steel- and Fire-type moves such as Gholdengo's Make it Rain and Torkoal's STAB moves.</p> </li> </ul> "},
      {
        "name": "Choice Scarf",
        "description": "<ul> <li> <p>This set is used commonly on Trick Room teams. Annihilape outspeeding most Pokemon, OHKOing them with Final Gambit, and being immune to Fake Out helps teammates like Hatterene and Armarouge set Trick Room, and fainting gives a free switch-in to a slow Trick Room beneficiary such as Tera Fire Torkoal. U-turn provides a switch-in without sacrificing Annihilape, and, while it doesn't OHKO, it hits common Pokemon such as Oranguru and Indeedee-F for large amounts of damage.</p> </li> <li> <p>Shadow Claw is a consistent damage-dealing option that doesn't rely on foes to power it up. However, Rage Fist can still be utilized effectively thanks to Annihilape's bulk. Phantom Force avoids attacks and ignores protecting moves, giving Annihilape opportunities to deal unavoidable damage.</p> </li> <li> <p>While not normally Terastallized, Annihilape can use Tera Ghost to remove its Fairy weakness and give a huge boost to its Ghost-type move, which becomes able to heavily dent much of the metagame.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}, {"user_id": 541847, "username": "yourwelcomethanku"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}]}
  }
}