{
  "Arcanine-Hisui": {
    "sets": {
      "Altarianite": {
        "description": "<p>Hisuian Arcanine serves as a formidable revenge killer and, if it's running Stealth Rock, entry hazard setter while also packing solid defensive utility thanks to having Intimidate before Mega Evolving, allowing it to soft check the likes of Weavile and Altarianite Regieleki. Altarianite grants Hisuian Arcanine access to Pixilate Extreme Speed, which lets it revenge kill common offensive staples such as Dragonite, Urshifu-R, and Hisuian Samurott. Stealth Rock lets Hisuian Arcanine set entry hazards and pressure hazard removers such as Corviknight and Metagrossite Great Tusk looking to come in. Stone Edge lets it threaten foes that resist its STAB moves, notably targeting Ho-Oh, Pinsirite Gouging Fire, and opposing Hisuian Arcanine. The given EVs let it outpace uninvested Solgaleo. Hisuian Arcanine struggles against bulky Water-types such as Arceus-Water and Toxapex, making teammates that can threaten them such as Raging Bolt, Raikou, and Zapdos appreciated. Other defensive staples such as Eternatus, Garganacl, and Red Orb Hippowdon trouble Hisuian Arcanine, so teammates that can reliably pressure these such as Landorus, Great Tusk, and Arceus-Ground are also appreciated. Defensive teammates such as Eternatus, Solgaleo, and Corviknight appreciate Hisuian Arcanine's ability to take on threats such as Magearna, Ho-Oh, and Weavile. Hisuian Arcanine dislikes entry hazards, so allies that can remove them such as Corviknight, Mandibuzz, and Great Tusk are necessary.</p>"
      },
      "Pinsirite": {}
    },
    "credits": {"writtenBy": [{"username": "Slither Wing", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "Quantum Tesseract", "user_id": 297239}, {"username": "zastra", "user_id": 558636}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Dragonite": {"sets": {"Bulky -ate Speed": {}, "Offensive -ate Speed": {}}},
  "Slowking-Galar": {"sets": {"Defensive Pivot": {}}},
  "Arceus-Fairy": {"sets": {"Bulky Calm Mind": {}}},
  "Arceus-Ground": {"sets": {"Calm Mind": {}, "Physical Sweeper": {}}},
  "Samurott-Hisui": {"sets": {"Offensive Spiker": {}}},
  "Landorus": {"sets": {"Red Orb Wallbreaker": {}}},
  "Solgaleo": {"sets": {"Physical Breaker": {}, "Defensive Pivot": {}, "Special Sweeper": {}, "Bulky Calm Mind": {}}},
  "Lunala": {"sets": {"Meteor Beam": {}, "Physically Defensive": {}, "Specially Defensive": {}}},
  "Corviknight": {"sets": {"Hazard Control Pivot": {}, "Bulky Setup Wall": {}}},
  "Eternatus": {
    "sets": {
      "Defensive": {},
      "Offensive": {},
      "Meteor Beam": {
        "description": "<p>Eternatus acts as a terrifying cleaner and setup sweeper, using its good natural bulk and typing to have an easier time against revenge killers. Meteor Beam allows Eternatus to lure in and OHKO Ho-Oh while providing extra firepower, and Fire Blast threatens Steel-types like Corviknight, Magearna, and Solgaleo, whereas Flamethrower is a weaker but more consistent alternative. Sludge Bomb nails Fairy-types like Arceus-Fairy, Altarianite Dragonite, and Hisuian Arcanine, while Recover provides longevity, allowing Eternatus to have an easier time against revenge killers like Altarianite Regieleki and Metagrossite Urshifu-R. Meteor Beam and Power Herb's single-use nature requires Eternatus to be used with offensive pivots that can wear down the opposing team like Altarianite Regieleki, Red Orb Raikou, and Metagrossite Urshifu-R; in return, it can clean up the opposing team. Entry hazard users like Arceus formes, Hisuian Arcanine, and Hisuian Samurott make for great partners, wearing down Eternatus's checks like Galarian Slowking, Arceus-Ground, and non-Heavy-Duty Boots Lunala throughout the course of the game.</p>"
      },
      "Cosmic Power": {}
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "zastra", "user_id": 558636}, {"username": "Slither Wing", "user_id": 603931}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Offensive Wallbreaker": {
        "description": "<p>Thanks to its great Attack, amazing Speed, and versatile movepool with powerful STAB moves, Urshifu-R distinguishes itself as a fantastic wallbreaker and offensive pivot. Ice Spinner hits foes that resist Urshifu-R's STAB attacks, such as Eternatus and Dragonite. Alternatively, Zen Headbutt can be used for better outs against Toxapex while still hitting Eternatus. U-turn allows Urshifu-R to switch out of bad matchups such as Arceus-Water and generate momentum. Metagrossite ensures that Urshifu-R can act as a fast pivot, outpacing foes like Eternatus, Scizorite Weavile, Lucarionite Walking Wake. Alternatively, Aerodactylite or Blue Orb can be used if another teammate like Galarian Zapdos is using Metagrossite to enhance Urshifu-R's wallbreaking potential, with Aerodactylite sets always 2HKOing defensive Eternatus with Ice Spinner and Blue Orb sets 2HKOing Arceus-Fairy with Surging Strikes, albeit at the cost of being outsped by the aforementioned Pokemon. Urshifu-R fits well with other offensive pivots, such as Raikou and Walking Wake, pressuring structures involving Pokemon like Eternatus and bulky Water-types like Arceus-Water and Toxapex. Setup sweepers like Raging Bolt, Gouging Fire, and Lunala also appreciate Urshifu-R's ability to safely pivot them in. Urshifu-R is vulnerable to -ate Speed users, such as Altarianite Regieleki, Hisuian Arcanine, and Dragonite, so teammates that help in dealing with them such as Arceus-Ground, Galarian Slowking, and Solgaleo are appreciated. Urshifu-R also has difficulty in dealing with bulky Arceus formes, especially Arceus-Fairy and Arceus-Water, so Pokemon that beat them such as Eternatus and the aforementioned Raging Bolt make great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "zastra", "user_id": 558636}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "SpaceSpeakers", "user_id": 573194}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Regieleki": {
    "sets": {
      "Dual Screens": {
        "description": "<p>Regieleki acts as an excellent dual screens setter on hyper offense teams, allowing teammates like Meteor Beam Eternatus, Dragon Dance Gouging Fire, and Swords Dance Urshifu-R to set up safely. Volt Switch allows it to pivot out into these aforementioned teammates and chips Corviknight, Explosion allows it to chunk threats like Hisuian Arcanine and Dragon Dance Dragonite while ensuring that a teammate can always come in safely, and Rapid Spin removes entry hazards from setters like Hisuian Arcanine, Garganacl, and Arceus formes attempting to take advantage of Regieleki's passivity. 196 HP and 252 Defense EVs with an Impish nature allow Regieleki to survive two uses of Extreme Speed from Altarianite Regieleki from full HP if it sets Reflect first, and 4 Speed EVs allow it to outspeed base 149 Speed Pokemon like Absolite Walking Wake and Lucarionite Shaymin-S. Regieleki should always be paired with setup sweepers that appreciate it setting dual screens like Dragon Dance Dragonite, Meteor Beam Lunala, and Swords Dance Kingambit, notably allowing them to set up safely and making them harder to revenge kill. Defoggers like Corviknight threaten to remove the dual screens Regieleki sets, so partners that can threaten them or punish their Defog attempts like Dragon Dance Gouging Fire, Swords Dance Lopunnite Iron Boulder, and Kingambit, which notably has Defiant before Mega Evolving, are appreciated.</p>"
      },
      "Altarianite": {},
      "Glalitite": {}
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Clas", "user_id": 545372}, {"username": "zastra", "user_id": 558636}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Great Tusk": {"sets": {"Offensive Spinner": {}, "Offensive Wallbreaker": {}}},
  "Gouging Fire": {"sets": {"Offensive Setup": {}, "Offensive Wallbreaker": {}}},
  "Raging Bolt": {"sets": {"Special Wallbreaker": {}}}
}