{
  "Venusaur": {
    "sets": {
      "Tank": {
        "description": "<p>Mega Venusaur's great overall stats and ability make it a powerful tank in the metagame, capable of checking staples like Clefable, Rotom-W, and Zeraora while providing excellent offensive pressure, since Sludge Bomb, Knock Off, and Earth Power can cripple or threaten the majority of its checks, like Mega Latias, Aegislash, and Celesteela. Giga Drain can be used to threaten Greninja, Ting-Lu, and Hippowdon immediately, but Leech Seed is also an option to annoy and force out checks like Celesteela and Skarmory while providing another source of recovery for itself and teammates. Earth Power allows it to hit Fire-types like Iron Moth and Skeledirge and Steel-types like Aegislash and Excadrill. Hidden Power Fire prevents Skarmory from setting up Spikes and Scizor from using Mega Venusaur as setup fodder while still hitting most Steel-types super effectively, even if it's less effective than Earth Power. The given EV spread allows it to outspeed Modest Celesteela and Adamant Tyranitar. Mega Venusaur fits on several archetypes, from offense to balance. Partners like Clefable, Scizor, and Excadrill enjoy Leftovers from Celesteela and Skarmory being removed; Scizor provides priority and a check against faster threats like Alakazam, Iron Boulder, and Mega Gardevoir, and Clefable can use Thunder Wave to cripple Iron Moth or Alakazam. Skarmory can set up Spikes against Mega Venusaur when the latter is not running Hidden Power Fire, so entry hazard removal from Rotom-W and Excadrill or dedicated counters like Magnezone are great partners. Mega Venusaur's vulnerability to entry hazards also make Rotom-W or other entry hazard control options really useful; Rotom-W can also pivot Mega Venusaur in against Clefable, Hydrapple, and Tangrowth.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535121, "username": "Pubo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Beedrill": {
    "sets": {
      "Please Don't Use Mega Beedrill": {
        "description": "<p>Despite Mega Beedrill initially seeming like a good Pokemon thanks to its exceptional Attack and Speed stats, great ability in Adaptability, and access to U-turn, it is completely unviable. While U-turn can grab momentum against foes such as Hydreigon and Mega Latias, and Poison Jab has some utility in targeting Fairy-types like Clefable, Bug and Poison is an atrocious STAB combination that has no way to break through common defensive Pokemon like Hippowdon and Buzzwole, and it notably struggles to even touch Steel-types. Skarmory and Celesteela stonewall Mega Beedrill, and while other Steel-types dislike Drill Run and Knock Off, virtually every Steel-type, from Bisharp to Excadrill, can usually beat Mega Beedrill one-on-one. As a pivot, Mega Beedrill suffers massively due to its Stealth Rock weakness and inability to hold Heavy-Duty Boots, which makes it very over-reliant on hazard control, or else it'd be worn down rapidly. Mega Beedrill's paltry defensive stats and terrible typing give it practically no defensive utility, rendering it extremely vulnerable to Choice Scarf users such as Hydreigon and priority moves like Scizor's Bullet Punch and Bisharp's Sucker Punch. Pursuit is another seemingly useful option, with its ability to outpace the likes of Victini and Mega Latias working well in tandem with Mega Beedrill's ability to hit them super effectively. However, Mega Beedrill is outclassed as a Pursuit trapper by Mega Aerodactyl and Tyranitar, both of which have a much better offensive and defensive presence thanks to their better typings. For teammates, entry hazard removers like Excadrill and Tapu Fini are mandatory. Special attackers that can remove or chip physical walls, such as Iron Moth and Thundurus, are necessary to let Mega Beedrill have any hope of threatening the opposing team. Magnezone is notable for its ability to trap and remove Skarmory and Celesteela. Entry hazards from setters like Ting-Lu and Skarmory can chip Mega Beedrill's targets and help it actually KO its targets. Overall, Mega Beedrill is an offensive threat that loses to most foes and requires excessive amounts of support to function properly; thus, it is far too difficult to apply to standard teams to be considered viable.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272785, "username": "nimzowitsch"}, {"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Clefable": {
    "sets": {
      "Utility": {
        "description": "<p>With a seemingly infinite utility movepool, great typing, and excellent ability allowing it to be unbothered by entry hazards and most status, Clefable cements itself as one of the best defensive options in the tier, able to check significant threats like Mienshao, Buzzwole, and Hydreigon. It also helps its teammates play around certain support options, such as Rotom-W, Ting Lu, and Hippowdon and uses these opportunities to set entry hazards or annoy the enemy team with its utility options. Thunder Wave allows Clefable to cripple faster threats like Iron Boulder and Enamorus while also dissuading many of Clefable's checks such as Mega Venusaur and Celesteela from switching in. Knock Off allows Clefable to leverage its numerous entry points to remove key items like Leftovers and Heavy-Duty Boots from checks like Excadrill and Iron Moth. Flamethrower is a niche option typically only found alongside Calm Mind that helps Clefable better threaten Excadrill while also chipping Celesteela. Stealth Rock is generally preferred, as Clefable tends to outlast most hazard control options, like Rotom-W and Excadrill, due to Magic Guard. Calm Mind similarly takes advantage of its ability to be unfazed by Toxic, turning it into a resilient sweeper that can punish teams reliant on special attackers like Amoonguss and Volcanion to check it. Rocky Helmet allows Clefable to punish threats such as Mienshao that would otherwise use U-turn and overrun most teams in conjunction with hazards. Leftovers is an alternative that greatly improves Clefable's longevity against the rest of the tier and is especially potent alongside Calm Mind to allow Clefable to overwhelm checks like Mega Venusaur or Aegislash. While maximum Defense investment is recommended to help Clefable withstand physical attackers like Mienshao better, an alternative spread with 68 Special Defense EVs can be used to ensure Clefable always survives an unboosted Iron Moth Sludge Wave, allowing Clefable to cripple it with Thunder Wave or Knock Off. Because of Clefable's ability to handle many dangerous threats and stay healthy throughout the course of a game, it is found on every team style barring hyper offense. Teammates like Ting-Lu and Celesteela appreciate Clefable dealing with dangerous physical threats like Mienshao and Zeraora; in return, these partners can handle Iron Moth and Mega Venusaur for Clefable. Other defensive partners like Skarmory can pair nicely with Clefable to better handle Mienshao while also providing support against Excadrill and Scizor. Clefable is an adept Stealth Rock setter, which is appreciated by offensive teammates such as Zeraora, Choice Band Iron Boulder, Mienshao, and Iron Moth. In return, these attackers can threaten options Clefable cannot handle, such as Greninja, Iron Moth, and Mega Venusaur while also racking up hazard damage onto the enemy team, allowing Clefable to outlast such checks. Clefable is also one of the best Knock Off absorbers in the tier, because it doesn't rely on its item to perform defensively, which allows it to support teammates weak to Knock Off like Skeledirge and Aegislash as well as Rotom-W and Celesteela, which simply dislike their Leftovers being removed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Arcanine-Hisui": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Hisuian Arcanine finds a modest niche in the tier as a wallbreaker thanks to its ability Rock Head. Head Smash and Flare Blitz are the STAB moves of choice, as the Rock- and Fire-type coverage is only resisted by Water / Ground types like Quagsire. Close Combat hits Ting-Lu for super effective damage and is its strongest option to hit Swampert, Quagsire, and Gastrodon. Extreme Speed can pick off frail threats that otherwise outspeed it such as Thundurus, Greninja, and Iron Moth. Choice Band lets Hisuian Arcanine achieve 2HKOs on Pokemon like Ting-Lu. An Adamant nature can be used to maximize power, dealing significantly more damage to would-be switch-ins like Ting-Lu and Swampert, while a Jolly nature can be run to outspeed Pokemon like Excadrill and Rotom-W. While Hisuian Arcanine is potent at breaking through defensive teams, it often struggles to enter the field due to its poor defensive typing. As such, it appreciates the support of bulky pivots like Rotom-W, Scizor, and Slowbro. Bulky Ground- and Water-types like Quagsire, Ting-Lu, Hippowdon, and Slowbro can all switch in on Hisuian Arcanine, making Grass-type Pokemon like Tapu Bulu, Tangrowth, and Giga Drain Mega Venusaur valuable partners. In return, Hisuian Arcanine can pressure Grass-resistant foes like Skarmory, Celesteela, and Buzzwole. When locked into its STAB moves, Hisuian Arcanine can provide free setup opportunities to dangerous revenge killers like Mega Aerodactyl, Greninja, Sand Rush Excadrill, and Keldeo. Thus, Hisuian Arcanine appreciates defensive pivots like Tapu Fini and Celesteela, which can stave off these threats. Tapu Fini and defensive Celesteela both benefit from Hisuian Arcanine threatening Grass-types like Tangrowth with Flare Blitz. Since Hisuian Arcanine cannot afford to run Heavy-Duty Boots, entry hazard removal support from Pokemon like Tapu Fini, Rotom-W, and Excadrill is necessary for Hisuian Arcanine to function effectively. Hisuian Arcanine also appreciates entry hazard support to chip down defensive answers like Quagsire and Ting-Lu, so entry hazard setters like Excadrill, Gastrodon, Greninja, and Skarmory are excellent partners for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 391284, "username": "Velcroc"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Alakazam": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Alakazam is a powerful offensive threat thanks to Nasty Plot, its high Speed, and its ability allowing it to ignore entry hazards and other forms of passive damage to keep its Focus Sash intact. These assets make it a great revenge killer or wallbreaker for offensive teams. It is able to outspeed and KO top-tier threats like non-Choice Scarf Mienshao and Iron Moth or break sturdy defensive cores with Ting-Lu, Skarmory, and Mega Venusaur. Focus Blast is used to hit Dark- and Steel-types like Ting-Lu, Excadrill, and Celesteela. Shadow Ball hits Mega Latias, Aegislash, and Slowking. Recover allows Alakazam to set up in front of weaker attacks or passive Pokemon, such as Chansey. Encore locks Pokemon like Mega Latias, Clefable, and Excadrill into unfavorable moves, and Alakazam can use these free turns to set up. Counter is a niche option to KO Iron Boulder and Zeraora and should only be used with Focus Sash for its surprise factor, but it's way less useful than Alakazam's other moves in most matchups. Alakazam's choice of item depends on what your team needs the most; Focus Sash allows it to revenge kill fast Pokemon like Speed Booster Energy Iron Moth and Greninja, while Life Orb or Fightinium Z allows it to pressure defensive staples like Ting-Lu, Celesteela, and Slowking with much more consistency. When not running Focus Sash, 28 Defense EVs should be used to avoid an OHKO from Hippowdon's Earthquake. Alakazam fits best on offensive teams that enjoy a fast revenge killer against Iron Moth and Mienshao. Entry hazard support from Ting-Lu, Greninja, and Iron Moth is effective at wearing down most of Alakazam's answers; Toxic Spikes from Iron Moth can put Ting-Lu on a timer, while Spikes can weaken Aegislash and force Scizor to use Roost more often. Magnezone can trap Celesteela and Scizor; in return, Alakazam threatens Mienshao and Buzzwole. Knock Off from Scizor or Clefable can remove Leftovers from Celesteela and Aegislash, and both appreciate Alakazam revenge killing Iron Moth for them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535121, "username": "Pubo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Slowbro": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Slowbro's high physical bulk combined with Regenerator makes it a fantastic defensive pivot, able to check numerous physical attackers such as Victini and Excadrill. As they're forced out, Slowbro can use Teleport to maintain momentum and stay healthy. Scald serves as a spammable STAB attack that can cripple targets with burns, dissuading otherwise decent checks like Tyranitar. Even foes that don't rely on physical attacks, like Hydreigon, tend to dislike the chip from burn. Future Sight supports wallbreakers like Choice Band Tyranitar, Buzzwole, and Enamorus in breaking through their checks such as Tangrowth and Skarmory for the former two and Mega Venusaur for the latter. It also synergizes excellently with Teleport. Slack Off serves as reliable recovery that doesn't require Slowbro to switch out. Heavy-Duty Boots allows Slowbro to avoid taking damage from entry hazards, maximizing HP regained from Regenerator, though Rocky Helmet can be held instead to punish contact move users, notably foes that run U-turn like Victini. A Relaxed nature and 0 Speed IVs are used to make Slowbro as slow as possible, maximizing its odds of moving slower than opposing Teleport users. Slowbro best fits on bulky offense and balance teams looking for a reliable defensive pivot that can also generate momentum for wallbreakers. Hazard-stacking teammates like Skarmory, defensive Clefable, Ting-Lu, and Hippowdon pair up nicely with Future Sight, further putting pressure on opposing defensive cores. Many hazard-stacking teammates can also double as checks to Pokemon Slowbro struggles against, such as Clefable and Ting-Lu checking Dark-types like Hydreigon, Skarmory handling Bug- and Grass-types like Buzzwole and Tapu Bulu, and Hippowdon and Ting-Lu checking Electric-types like Zeraora. Similarly, pivots like Scizor also check threats like Clefable while pairing nicely with Slowbro's own pivoting potential to maintain offensive momentum. If it isn't running Heavy-Duty Boots, hazard control from teammates like Hydreigon, Excadrill, and Flygon is necessary.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Iride"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Chansey": {
    "sets": {
      "Pink Blob:2": {
        "description": "<p>With its enormous bulk due to one of the largest HP stats in the game alongside Eviolite, Chansey is the premier special wall for bulky teams looking to stifle the tier's most threatening special attackers, namely Iron Moth, Enamorus, and Hydreigon. Seismic Toss is Chansey's most reliable way of dealing damage, letting it punish Toxic-immune targets like Iron Moth and Mega Venusaur while also ensuring Substitute users like Hydreigon and Enamorus cannot use Chansey as setup fodder. Soft-Boiled provides instant reliable recovery, but Wish alongside Protect is an option to grant Chansey increased recovery PP while also potentially passing massive Wishes to teammates. However, this comes at the cost of being more exploitable, as threats like Galarian Moltres and Thundurus can use Nasty Plot on forced Protect turns. Toxic restricts special sweepers like Calm Mind Enamorus and Mega Latias while also punishing physical attackers that switch in to threaten Chansey like Buzzwole and Tyranitar. Thunder Wave is an alternative on bulky teams that are less capable of handling setup sweepers like Aegislash to allow teammates like Ting-Lu to outspeed and KO them before they can retaliate. Given the number of opportunities Chansey gets to switch in, Stealth Rock is a great move for it, but Aromatherapy can be used on teams with another entry hazard setter to keep the team free from status. Given its weakness to hazards as well as its passivity, Chansey is typically only seen on stall and bulky teams. Chansey can struggle with many of the tier's most common physical attackers, particularly Tyranitar and Buzzwole, so teammates like Hippowdon and Skarmory are appreciated, and Chansey can check special threats that target them like Hydreigon and Iron Moth in return. Chansey also struggles with Fighting-types like Keldeo and Mienshao, so teammates like Mega Latias and Clefable are good partners. Teammates like Mega Venusaur and Mega Latias that can handle strong setup sweepers like Nasty Plot Thundurus are appreciated. In return, Chansey can help handle special threats that don't rely on setting up such as Choice Specs Enamorus and Hydreigon. Chansey's complete inability to touch Ghost-types without Toxic and staples like Aegislash even with Toxic is problematic, so reliable answers to these threats like Ting-Lu are appreciated. Chansey is threatened heavily by Knock Off, so good Knock Off absorbers like Buzzwole and Clefable are important alongside it, while Chansey can handle any special threats that might threaten them, including Galarian Moltres and Magnezone.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Ditto": {
    "sets": {
      "Revenge Killer": {
        "description": "<p>Ditto functions as a niche Choice Scarf user thanks to Imposter allowing it to transform into dangerous opposing setup sweepers such as Galarian Moltres, Celesteela, Thundurus, and Alakazam while always outspeeding them and potentially reverse sweeping. Ditto also serves as a solid response to stall teams, since it can effectively PP stall threats like Skarmory and Clefable while also acting as a strong Knock Off absorber against threats such as Mega Sableye and Hisuian Goodra, with the added bonus of PP stalling more efficiently after it loses its Choice Scarf. Ditto can also remain healthy against these teams by copying Regenerator from Slowbro and Amoonguss and Natural Cure from Chansey. Transform is Ditto's only possible move, so it must be used. Although the case is rare, Ditto has a multitude of Hidden Power types to choose from, such as Hidden Power Ice and Ground to hit threats such as Tangrowth, Thundurus, and Magnezone that commonly carry Hidden Power. The given EV spread allows Ditto to possibly win Struggle wars against opposing Ditto. Using 1 Speed IV is optional, but it makes sure that Ditto is as slow as possible to help against opposing Ditto and guarantees that it can still use Hidden Power Ground. Seeing as how Ditto requires a lot of defensive support to make up for its rather mediocre HP stat, it fits best on bulky balance and stall teams that can afford to stack defensive checks more reliably than other playstyles, and in return, Ditto provides these slower playstyles with a consistent means of speed control. Ditto is completely helpless against Substitute users such as Iron Moth, so more direct checks such as Ting-Lu can help support it, while Ditto can revenge kill Thundurus in return. Ditto's mediocre HP stat can also land it in tricky situations against more offensive teams with high-powered wallbreakers such as Nasty Plot Alakazam and Swords Dance Aegislash, since it struggles to switch into them, so defensive pivots such as Slowking, Unaware Clefable, and Mandibuzz are much appreciated to help it get on the field more easily. Bulky setup sweepers such as Mega Latias and Clefable can also heavily annoy Ditto, since it struggles to do significant damage back to them. Phazers such as Skarmory and Ting-Lu, as well as more direct checks such as Celesteela, are needed in order to beat them. Unaware Pokemon such as Quagsire and Clefable are also great partners to combat them, while Ditto can function as a backup in case they're overwhelmed by more offensive threats like Hydreigon and Excadrill. Ditto hates entry hazards, since they cut into its longevity, so hazard control options such as Mega Sableye and Skarmory are great support for it on stall teams, while balance teams can opt for bulky Excadrill or utility Mega Latias.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568189, "username": "Runo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Aerodactyl": {
    "sets": {
      "Offensive": {
        "description": "<p>Mega Aerodactyl's unrivalled Speed tier, attacking prowess, and decent defensive profile make it a great all-around offensive threat in the metagame, outpacing and forcing out a huge portion of faster threats, such as Greninja, Galarian Moltres, and Enamorus lacking Choice Scarf. Earthquake provides Mega Aerodactyl with perfect neutral coverage, hitting Rock-resistant Pokemon as well as targets that are weak to it, such as Tyranitar, Zeraora, and Bisharp, allowing Mega Aerodactyl to threaten them. Dual Wingbeat provides a secondary STAB option that ensures Mega Aerodactyl hits important targets such as Buzzwole, Mega Venusaur, and Amoonguss super effectively. Taunt can be used instead to deny the likes of bulkier targets, such as Clefable, Skarmory, and Hippowdon, from accessing their healing moves, on top of shutting down setup options from specific setup sweepers, such as Mega Latias. Mega Aerodactyl can even serve as an effective Pursuit trapper; with the Tough Claws boost, it makes for an effective option to use against the likes of Iron Moth, Victini, and Alakazam. Roost is mandatory in the last slot to offset Mega Aerodactyl's Stealth Rock weakness while also allowing it to repeatedly switch into foes such as Iron Moth, resisting most of its attacks in the process. Mega Aerodactyl fits best on bulky offense and balance teams in need of an offensive backbone with solid secondary defensive applications. Bulkier Pokemon such as Ting-Lu and Rotom-W appreciate Mega Aerodactyl's ability to relieve pressure in dealing with offensive threats which they may be overwhelmed by, such as Victini and Enamorus. In return, the former provides hazard support to help Mega Aerodactyl secure damage rolls against Pokemon it would otherwise miss out on, such as against Autotomize Celesteela with Stone Edge and Tyranitar with Earthquake, whereas the latter provides additional pivoting support, hazard removal in Defog to offset Mega Aerodactyl’s weakness to Stealth Rock, and the ability to take on several setup sweepers which it struggles to take on, such as Sand Rush Excadrill and Swords Dance Scizor. Similarly, other Pokemon that can remove entry hazards, such as Excadrill and Mandibuzz, are effective at ensuring Mega Aerodactyl isn’t being dug into by Stealth Rock. On the other hand, offensive Pokemon such as Life Orb Mienshao, Nasty Plot Hydreigon, and Tapu Bulu can benefit from Mega Aerodactyl's ability to check or remove faster Pokemon which they may be dissuaded by, such as Iron Moth and Keldeo. Mega Aerodactyl's ability to force in defensive Pokemon can also lead to some interesting synergies with other offensive Pokemon, particularly when carrying Taunt; setup sweepers such as Calm Mind Enamorus and Bulk Up Buzzwole benefit from Mega Aerodactyl's ability to lure in and weaken walls such as Skarmory, Tapu Fini, Slowbro, and Mega Venusaur.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Dragon Dance turns Mega Aerodactyl into a threatening sweeper, leveraging its combination of power, Speed, and coverage to great effect. It particularly preys on faster teams that over-rely on using faster speed control options to check most sweepers, such as Choice Scarf users Mienshao and Keldeo. Earthquake nails several Ground-weak targets in Excadrill, Tyranitar, and Bisharp after a Dragon Dance, OHKOing the latter. Dual Wingbeat, especially with the boost from Tough Claws, flattens many neutral targets after a Dragon Dance, such as Clefable, Slowking, Gastrodon, and Mega Latias, while also allowing it to beat walls such as Buzzwole and Tangrowth. Alternatively, Mega Aerodactyl can run Roost in the last slot to offset its lack of longevity, potentially grabbing multiple setup opportunities against weaker Pokemon such as Ting-Lu and Clefable lacking Thunder Wave. Due to its offensive prowess, this Mega Aerodactyl set fits best on fast-paced teams as an effective mid-to-late game cleaner. Early-game wallbreakers such as Enamorus can help Mega Aerodactyl by opening up gaps in the opposition through their numerous offensive applications against walls which the latter may find itself being stopped by, such as Slowbro, Scizor, and Iron Defense Skarmory. Conversely, Mega Aerodactyl’s tendency to find opportunities against specific targets such as Ting-Lu and Mega Venusaur can also work to the benefit of other late-game cleaners, such as Booster Energy Iron Moth. As Mega Aerodactyl often finds itself leveraging its bulk to make the most of its setup capabilities, teammates that can prevent entry hazards from going up, such as Taunt Mew, Excadrill, and Tapu Fini, make for excellent partners. Mega Aerodactyl also benefits from entry hazard support provided by the former two, which helps it secure OHKOs against Pokemon such as Hydreigon after a Dragon Dance.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Moltres-Galar": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Leveraging its excellent defensive profile and bulk, on top of its access to a multitude of boosting moves, Galarian Moltres makes for an excellent mid-to late-game cleaner on more offensive teams. It provides an important buffer against offensive threats such as Aegislash and Alakazam while also finding setup opportunities against a large portion of defensive staples, such as Slowbro and Mega Venusaur. Nasty Plot boosts Galarian Moltres's Special Attack to absurd levels, allowing it to reliably pressure specially defensive tanks such Hippowdon and Clefable. Agility allows Galarian Moltres to outspeed common revenge killers such as Mega Aerodactyl and Choice Scarf Keldeo after one round of setup while giving it the opportunity to clean up opposing teams late-game when its wallbreaking prowess with Nasty Plot isn't as necessary. Taunt, on the other hand, can be used to prevent status and healing from Pokemon such as Blissey and specially defensive Hippowdon, allowing Galarian Moltres to wear them down or use them as setup fodder. Hurricane, in conjunction with Flyinium Z, gives Galarian Moltres a powerful one-time nuke in Supersonic Skystrike that can break through neutral targets such as Blissey and Gastrodon, threatening to outright OHKO the latter at +2 while also offsetting Hurricane’s middling accuracy in the process. As Galarian Moltres can struggle to safely find setup opportunities against faster threats such as Mega Aerodactyl and Enamorus, it pairs best with offensive teammates that can also complement its wallbreaking prowess; late-game cleaners such as Swords Dance Aegislash, Battle Bond Greninja, and Booster Energy Iron Moth capitalize on Galarian Moltres's ability to weaken specific answers, such as Celesteela and Skeledirge, respectively, allowing them to sweep opposing teams with greater ease late-game. The latter can also invite in and weaken Rock-types such as Tyranitar, which Galarian Moltres can struggle to break through otherwise. Galarian Moltres's Stealth Rock weakness and inability to run Heavy-Duty Boots necessitates strong anti-hazard options, leads such as Excadrill and Mew can all shut down common entry hazard setters, the former via Rapid Spin and the latter via Taunt.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 572981, "username": "Aera"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Mew": {
    "sets": {
      "Utility": {
        "description": "<p>Although it tends to underperform defensively due to the presence of dangerous threats such as Aegislash as well as competition with other Spikers like Ting-Lu, Mew still has great bulk for the tier and can sport a good amount of utility for teams with entry hazard setting or removal. Mew can easily set Spikes against foes such as Ting-Lu and Skarmory, and it can even set the hazard against offensive threats such as Mega Latias and Rotom-W. Mew can also switch into and remove entry hazards against Ting-Lu, Skarmory, and Clefable with Defog. Will-O-Wisp allows Mew to cripple wallbreakers such as Bisharp and Scizor. In a pinch, Will-O-Wisp can also be used to prevent faster threats like Zeraora and Iron Boulder from causing havoc. Knock Off has good synergy with Spikes to remove Heavy-Duty Boots from threats like Slowbro, Iron Moth, and Zeraora while still being able to punish Choice-locked wallbreakers such as Greninja and Hydreigon. Psychic allows Mew to immediately pressure threats like Iron Moth, Amoonguss, and Mega Venusaur, while Night Shade can provide consistent damage into threats such as Ting-Lu and Celesteela. Mew's EV spread is invested to outrun Adamant Choice Band Buzzwole, but it is flexible enough to run slower spreads like 16 Speed EVs to just outrun Bisharp. Mew best fits on balance teams looking to find a valuable role compression option that can set or control entry hazards while still blanket checking a ton of threats, such as Buzzwole and Iron Boulder, which helps to enable teammates such as Mienshao, Scizor, and Iron Moth. Common pivots such as Rotom-W and Victini can easily force Mew in and pivot out to checks such as Aegislash, so partners that can block or punish their pivoting such as Ting-Lu and Zeraora as well as Rocky Helmet users like Clefable and Rotom-W are appreciated. Mew hates offensive Dark-types like Greninja, Hydreigon, and Tyranitar even if it can punish them, so it enjoys additional partners like Mienshao and Keldeo to force them out. Aegislash is a big roadblock for Mew, so pairing it up with Iron Moth and Bisharp is great for it; in return, Mew can harass their common checks such as Ting-Lu and Mega Venusaur. Spikes Mew can also pair nicely with Stealth Rock users like Ting-Lu, Clefable, and Hippowdon to overwhelm entry hazard removers such as Excadrill and Rotom-W. Partners that can take advantage of Rotom-W's attempts to use Defog, such as Bisharp, also are valuable to Mew in order to let it set Spikes freely.</p>"
      },
      "Suicide Lead": {
        "description": "<p>Mew is a good lead option for hyper offense teams as its better bulk compared to other leads allows it to set both Stealth Rock and Spikes and prevent opposing entry hazards and Defog attempts with Taunt. However, Mew suffers competition from lead Excadrill, which is capable of setting up Stealth Rock against Mega Sableye and remove entry hazards with Rapid Spin, something heavily appreciated by Stealth Rock weak Pokemon like Iron Moth. Taunt prevents Defog from slower targets like Rotom-W and Tapu Fini, setup attempts from Pokemon like Nasty Plot Hydreigon, and Stealth Rock and Spikes from setters like Excadrill and Skarmory, respectively . Explosion allows Mew to generate momentum and hinder entry hazard removers like Hydreigon and Excadrill from removing entry hazards with Defog or Rapid Spin, respectively. Flare Blitz can be used to heavily dent Steel-types like Excadrill and Scizor, but it's a worse option overall, as it lacks consistency to KO itself with the recoil, unlike Explosion. Red Card works well to force out opposing lead Excadrill and setup sweepers like Nasty Plot Thundurus if Mew survives a hit. Lead Mew fits best on hyper offense teams where it can support its teammates by setting up entry hazards. Air Balloon Aegislash and Sinistcha are great partners capable of spinblocking Excadrill; they appreciate Mew's entry hazards weakening walls such as Celesteela or in Aegislash's case weakening fast revenge killers like Iron Moth and Mega Aerodactyl into Shadow Sneak KO range. Wallbreakers like Swords Dane Mega Gallade and Calm Mind Keldeo can easily set up against Dark-types that Mew lures in like Tyranitar and Hydreigon. Nasty Plot Thundurus is another great partner that can pressure Defoggers like Tapu Fini and Rotom-W to keep entry hazards up for the rest of team. Late-game cleaners like Autotomize Celesteela, Booster Energy Iron Moth, and Double Dance Galarian Moltres enjoy Mew preventing Steath Rock with Taunt and its Spikes potentially putting Tyranitar in Energy Ball and Supersonic Skystrike KO range, respectively. Finally, since Mew lacks the ability to get entry hazards up against Mega Sableye, good partners that can pressure it like Nasty Plot Thundurus and Galarian Moltres make for great options.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 568189, "username": "Runo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 391284, "username": "Velcroc"}, {"user_id": 546157, "username": "Iride"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Azumarill": {
    "sets": {
      "Belly Drum": {
        "description": "<p>Azumarill excels as a strong setup sweeper on hyper offense teams thanks to the combination of Belly Drum and Huge Power allowing it to output colossal damage against walls such as Gastrodon, Slowbro, and Tangrowth while also being able to hold its own against offensive threats like Enamorus and Iron Moth with Aqua Jet. Its defensive value to hyper offense teams is also important, as it's a solid check to threats like Greninja. Unfortunately, Azumarill's low Speed leaves it susceptible to common checks such as Rotom-W and Mega Venusaur, which all shrug off its +6 Aqua Jet. Play Rough is important in order to beat bulky Water- and Grass-types such as Tapu Fini and Hydrapple while also mauling Dragon-types that may otherwise check it such as Mega Latias. Knock Off is valuable to rip apart common Steel-types such as Aegislash and Skarmory after a Belly Drum boost, and the progress it forces against threats it can't immediately beat such as Volcanion and Amoonguss is very valuable. Alternatively, Liquidation can be used in order to OHKO Skarmory and bulky Scizor. Ice Spinner is a middle ground option that especially terrorizes Grass-types like physically defensive Tangrowth while still being able to annihilate Skarmory and Celesteela. Normalium Z provides a near guarantee that Azumarill can set up a Belly Drum and sweep, but Sitrus Berry is perfectly fine if it's partnering with another Z-Move user. The 4 HP EVs are important for Sitrus Berry sets, as they ensure the berry activates after setting up with Belly Drum, but it's better to run 4 Defense or Special Defense EVs instead on Normalium Z sets to minimize Stealth Rock damage. Since Azumarill tends to struggle even with +6 Aqua Jet against faster foes that resist Water like Keldeo and Greninja, partners that can threaten them, such as Thundurus and Hawlucha, respectively, are greatly appreciated. In return, Azumarill can break open defensive staples like Assault Vest Tangrowth and Hippowdon for them. Although Azumarill is a powerful sweeper, it can't break through physically defensive behemoths such as Quagsire and Mega Venusaur, so partners like Meteor Beam Celesteela and Alakazam are great to have while Azumarill takes cares of their checks like Ting-Lu for them. Hyper offense leads such as Excadrill and Mew are essential partners to help Azumarill break through foes like Skarmory with the help of entry hazard chip. Ribombee is another option that helps Azumarill negate its poor Speed with Sticky Web so it can deal with threats such as Mega Venusaur and Tapu Fini. Setup sweepers such as Nasty Plot Thundurus can wear down checks like Mega Venusaur and Rotom-W for Azumarill while it takes down threats such as Gastrodon for it. Cleaners such as Alakazam, Galarian Moltres, and Iron Moth appreciate Azumarill softening defensive checks such as Chansey, Ting-Lu, and Celesteela for them.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Azumarill finds a solid niche in the tier as a wallbreaker with access to priority in Aqua Jet and an excellent defensive typing that provides switch-in opportunities into common threats such as Choice Specs Greninja and Keldeo. Its STAB combination threatens common metagame staples such as Ting-Lu, Mega Latias, Tyranitar, Buzzwole, and Hippowdon. Aqua Jet allows Azumarill to revenge kill threats like Sand Rush Excadrill, Booster Energy Iron Moth, and Iron Boulder. Knock Off hits Pokemon that resist its STAB moves like Amoonguss, and item removal is valuable for helping chip down walls like Slowbro, Celesteela, and Skarmory into range for future assaults by Azumarill or its teammates. Choice Band Azumarill fits best on bulky offense teams, as they can reliably fit pivots such as Scizor and Rotom-W. Azumarill appreciates the pivoting support that these Pokemon provide in helping it enter the field, and in return, it pressures Pokemon that dissuade U-turn or Volt Switch such as Rocky Helmet Buzzwole, Hippowdon, and Ting-Lu. Azumarill's excellent defensive typing provides bulky offensive teams with the ability to withstand hits from otherwise threatening wallbreakers such as Hydreigon and Choice-locked Greninja. Furthermore, its access to priority lets it revenge kill fast offensive threats that threaten these teams such as Sand Rush Excadrill and Booster Energy Iron Moth. Azumarill's biggest hindrance in the tier is Mega Venusaur—and, to a lesser extent, Amoonguss—which can withstand all of Azumarill's moves and threaten it with Sludge Bomb, Leech Seed, or status. Therefore, Azumarill should be paired with partners that can reliably dispatch or scare out Mega Venusaur such as Mega Latias and Air Slash Celesteela. While other defensive Grass-types like Tangrowth, Hydrapple, and Tapu Bulu need to watch out for Choice Band Azumarill's Play Rough, they can slow down its attempts at wallbreaking and retaliate with their Grass-type STAB moves or, in Tangrowth's case, Rocky Helmet. Pokemon that can punish these Grass-types like Iron Moth, Offensive Celesteela, Mega Latias, Victini, and Scizor thus make excellent partners for Azumarill. In a similar vein, blanket physical walls like Rocky Helmet Buzzwole and Skarmory can punish an Azumarill Choice-locked into one of its STAB moves; as a result, Azumarill appreciates the support of special attacking wallbreakers such as Thundurus, Alakazam, Volcanion, and Keldeo. In return, these special wallbreakers appreciate Azumarill's ability to handle special walls like Ting-Lu, Slowking, and Blissey. Volcanion and Keldeo in particular appreciate its ability to pressure Mega Latias. Additionally, Water-types like Slowbro, Rotom-W, Gastrodon, and Volcanion have resistances or immunities that allow them to pivot in on Choice-locked Azumarill and threaten it with burns and Toxic. Consequently, Pokemon that exploit bulky Water-types like Rotom-W, Zeraora, and Hydrapple make excellent teammates. Azumarill appreciates entry hazard support from the likes Excadrill, Skarmory, Greninja, and Clefable, as they can help chip down answers such as Mega Venusaur. Choice Specs Greninja and Azumarill form an especially potent Water-type spam core, where Azumarill helps chip down walls that can impede a Greninja sweep such as Tapu Bulu, Chansey, and Gastrodon, while Choice Specs Greninja wears down Mega Venusaur for Azumarill with a combination of Sludge Wave and Spikes chip damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 391284, "username": "Velcroc"}, {"user_id": 568189, "username": "Runo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 558636, "username": "zastra"}]}]}
  },
  "Quagsire": {
    "sets": {
      "Unaware Wall": {
        "description": "<p>Quagsire's great defensive typing and passable physical bulk alongside Unaware allow it to check many of the tier's physical attackers and setup sweepers, notably Excadrill and all variants of Tyranitar. Earthquake allows Quagsire to threaten Aegislash more immediately, while Scald can be utilized to cripple wallbreakers such as Mienshao and punish switch-ins immune to Earthquake and Toxic such as Celesteela and Skarmory. Given the lack of reliable Spikers, Quagsire prefers to run Spikes to pressure the opposing team, but it can also run Stealth Rock effectively if the team lacks a Stealth Rock setter. Toxic wears down the bulky Pokemon Quagsire is often tasked with answering, like Tyranitar, and can also punish common Quagsire switch-ins such as Rotom-W and Tangrowth. Maximum HP and Defense investment allows Quagsire to more easily answer its main targets, but an alternative spread with 84 Special Defense EVs can be utilized on teams with other answers to physical attackers to allow Quagsire to more reliably switch into Rotom-W, especially if Quagsire's Leftovers has been removed by Knock Off. Due to its passivity, Quagsire is typically seen on bulkier teams that appreciate its defensive profile and ability to set entry hazards. Quagsire is threatened heavily by Grass-types like Mega Venusaur and Hydrapple, so answers to these Pokemon, such as Skarmory, Celesteela, and Hisuian Goodra, are mandatory. Skarmory can also form a hazard-stacking core alongside Quagsire, and in return, Quagsire can check threats like Victini and Zeraora. Quagsire is unable to handle special attackers and sweepers, such as Iron Moth and Enamorus, so options like Chansey and Clefable are appreciated to help switch into these threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 572981, "username": "Aera"}]}]}
  },
  "Slowking": {
    "sets": {
      "Specially Defensive Pivot": {
        "description": "<p>With great special bulk, Regenerator, and Teleport, Slowking is an effective pivot and defensive check to prominent threats like Iron Moth, Enamorus, and Keldeo, being able to switch in against their powerful moves and either bring another teammate to maintain momentum or set up Future Sight and switch out right after. Scald allows Slowking to punish switch-ins like Tyranitar, Ting-Lu, and Tangrowth. Future Sight synergizes well with Teleport by threatening Pokemon like Buzzwole and Mega Venusaur while aiding wallbreakers like Scizor, Thundurus, and Bisharp by giving a free entry with Teleport to better pressure the opposing walls in conjunction with Future Sight. The extra damage provided is useful even against neutral or resistant targets like Gastrodon and Celesteela. Thunder Wave cripples faster targets like Mega Latias, Hydreigon and Enamorus. Teleport is preferred over Chilly Reception due to its negative priority, but the latter can be useful to disrupt sand from Tyranitar and Hippowdon to prevent Excadrill from activating Sand Rush. A Sassy nature with 0 Speed IVs is used to ensure Slowking is as slow as possible to possibly switch out after an opposing Teleport user like Slowbro. Heavy-Duty Boots blocks damage from entry hazards, notably allowing Slowking to better check Choice Specs Enamorus while maximizing recovery from Regenerator. Slowking fits best on balance and bulky offense teams where its defensive and support capabilities are appreciated by both defensive and offensive partners. Ground-types like Hippowdon, Ting-Lu, and Excadrill can block Volt Switch from Zeraora; in return, Slowking can check Water-types like Keldeo and Volcanion. Fighting-types are also amazing partners by pressuring Dark-types like Tyranitar and Hydreigon for Slowking while enjoying Future Sight discouraging common switch-ins like Mega Venusaur and Clefable. Tyranitar deserves a special mention, as it usually tries to switch in and Pursuit trap Slowking. Good partners to deal with Dark-types include Buzzwole and Mienshao. Choice Specs Enamorus can put heavy pressure on Slowking with repeated Moonblasts respectively, making secondary checks like Celesteela and Scizor useful to help with Enamorus while Slowking scouts dangerous moves like Mystical Fire for them. Finally, frail offensive Pokemon like Thundurus and Victini enjoy the free entry Slowking provides with Teleport or Chilly Reception. Nasty Plot Thundurus is especially notable by threatening most Dark-types like Tyranitar and Hydreigon with Focus Blast or All-Out Pummeling.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535121, "username": "Pubo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Scizor": {
    "sets": {
      "Offensive Swords Dance": {
        "description": "<p>Accounting for its diverse movepool, priority options, and huge base Attack, Scizor makes for an incredibly threatening wallbreaker and cleaner on more offensive teams. Furthermore, Scizor's Steel typing and decent bulk also complements its ability to keep many faster threats in check, such as Enamorus, Mega Latias, and Alakazam, while using them as setup fodder. Knock Off allows Scizor to break past Slowbro and Skeledirge while also OHKOing Victini; it can even prove useful for removing items from several soft checks otherwise reliant on them, such as Leftovers from Rotom-W. Dual Wingbeat is usually preferred in the last slot for its coverage against specific physical walls able to blank its other attacks, such as Buzzwole, Mega Venusaur, and Tangrowth, but Close Combat can be used instead to deal more damage to Steel-types such as Skarmory, Magnezone, and Bisharp, putting immense pressure on the former at +2 while OHKOing the latter two unboosted. Quick Attack can also be used to give Scizor an extra priority attack, allowing it to finish off weakened foes that would otherwise resist Bullet Punch, such as Iron Moth and Zeraora, although its lack of coverage can leave Scizor to struggle with breaking through the aforementioned defensive targets. Due to its lack of longevity and early- or mid-game prowess, this Scizor set usually fits best on select offensive teams that appreciate its versatility in being able to deal with faster threats. Entry hazard support from the likes of Excadrill and Lead Mew can help push several Pokemon, such as Iron Moth, Tyranitar, and Tapu Fini, into Scizor's KO threshold. Scizor also appreciates specific teammates that can help weaken or take advantage of Fire- and Steel-types, like Iron Moth and Greninja, as it can often be dissuaded from sweeping by their presences in a vacuum while they remain healthy. Conversely, other late-game cleaners such as Swords Dance Bisharp, Z-Celebrate Victini, and Dragon Dance Mega Aerodactyl appreciate Scizor's own ability to force damage onto shared checks such as Hippowdon, Skarmory, and Choice Scarf Keldeo while allowing Scizor to forgo its late-game approach if attacking early may be more optimal for enabling the rest of its teammates.</p>"
      },
      "Bulky Swords Dance": {
        "description": "<p>A fantastic defensive typing alongside powerful priority allow Scizor to be an important defensive piece as well a great late-game cleaner on most teams. Swords Dance is essential to allow Scizor to sweep weakened teams, and it pairs well with Bullet Punch, allowing Scizor to ignore its mediocre Speed and KO faster threats, like Alakazam and Iron Boulder. Knock Off allows Scizor to overwhelm checks such as Celesteela and Rotom-W that rely on Leftovers to check Scizor over a longer game. U-turn is another option that allows Scizor to pivot in threats such as Iron Moth and Greninja on typical Scizor checks such as Skarmory and Skeledirge. Roost is essential to allow Scizor to consistently perform defensive roles over a long game, as well as set up on weaker defensive foes, like Hippowdon and Tangrowth. Heavy-Duty Boots is typically preferred on Scizor to prevent it from being worn down too quickly by entry hazards, but Leftovers can also be used on teams with more reliable hazard removal. Buginium Z can be utilized alongside U-turn to defeat foes such as Amoonguss at +2 while also allowing Scizor to threaten foes such as Ting-Lu without being forced to switch out. 112 Attack EVs with an Adamant Nature allow Scizor to OHKO Mega Gardevoir with Bullet Punch, 12 Speed EVs allow Scizor to outspeed Skeledirge, and 76 Special Defense EVs allow Scizor to survive 2 Shadow Ball from uninvested Aegislash. However, EVs can be moved from Attack to Defense or Special Defense to help Scizor better check threats such as Iron Boulder or Aegislash respectively, though 16 Attack with an Adamant nature is recommended to OHKO Mega Gardevoir after Stealth Rock. Bulky Swords Dance Scizor can be used on offensive and bulky teams that appreciate Scizor's priority and defensive profile. Teammates such as Mega Gardevoir and Alakazam appreciate Scizor removing Leftovers from shared checks such as Aegislash and Celesteela; Scizor's defensive profile provides support against threats such as Zeraora and Iron Boulder. Scizor often struggles to break through Skarmory, so teammates that can take advantage of it, like Aegislash, Iron Moth, and Magnezone are appreciated. Scizor is also heavily threatened by Fire-types like Iron Moth and Skeledirge, so partners such as Rotom-W, Slowking, and Ting Lu that can handle these threats are mandatory; in return, Scizor can check common switch-ins to these defensive pieces such as Hydrapple and Mega Venusaur. Scizor can also struggle to threaten certain offensive Pokemon that resist Bullet Punch, like Iron Moth and Greninja, so teammates such as Hippowdon and Celesteela that can handle these threats or wear them down until Scizor can pick them off later in the game are appreciated.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band provides Scizor with immediate power on its attacks, allowing it to be more proficient as a wallbreaker, pivot, and late-game cleaner all at once. Bullet Punch puts substantial pressure on win conditions such as Calm Mind Clefable and Tapu Bulu, outright OHKOing the latter from full HP. Knock Off allows Scizor to remove important items from Pokemon otherwise reliant on them to deter it, such as Leftovers from Rotom-W and Celesteela and Rocky Helmet from Buzzwole and Amoonguss. Pursuit takes advantage of Scizor's excellent typing against several Psychic-type Pokemon to trap them, most notably Mega Latias, Alakazam, and Slowking. Alternatively, Close Combat and Dual Wingbeat are options to pose a more immediate threat to their respective targets, such as Excadrill and Magnezone with Close Combat and Buzzwole and Mega Venusaur with Dual Wingbeat. Scizor fits best on bulky offense teams that can best take advantage of its strong momentum-grabbing capabilities and cleanup potential. Pivots such as Rotom-W, Choice Scarf Hydreigon, and Iron Moth can help Scizor by threatening the physical walls used to stifle it, including Skarmory and Buzzwole; in return, Scizor can help force damage onto walls that normally handle these pivots, such as Tangrowth and Blissey. Scizor also appreciates strong entry hazard removal options to avoid being worn down quickly, including Defog from Rotom-W, Tapu Fini, and Volcanion and Rapid Spin from Excadrill; the aforementioned Defog users are also capable of taking advantage of Fire-types that may pose a threat to Scizor, such as Victini. On the other hand, entry hazard support from the likes of Clefable and Ting-Lu is imperative to increase the overall impact of Scizor's pivoting capabilities as well as extend its capacity to revenge kill threats like Galarian Moltres with Bullet Punch.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}, {"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Heracross": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Mega Heracross uses its gigantic Attack stat alongside Swords Dance to be a powerful wallbreaker, pressuring common physical walls like Skarmory and Mega Venusaur. Swords Dance boosts Mega Heracross's Attack to incredible heights and lets it OHKO a majority of the Pokemon in the tier, including walls like Skarmory and Hippowdon. Close Combat OHKOes threats like Tyranitar while 2HKOing bulkier Pokemon like Skarmory. Rock Blast threatens Flying-types such as Enamorus, Galarian Moltres, and Thundurus, as well as Fire-types like Iron Moth that could otherwise take Close Combat and force Mega Heracross out. Pin Missile threatens Slowbro and Mega Venusaur, while Substitute lets Mega Heracross avoid Will-O-Wisp from Mega Sableye, capitalize from the forced switches it generates, and ease prediction against Pokemon it forces out. Physical cleaners like  Swords Dance Scizor appreciate Mega Heracross being able to threaten their switch-ins, such as Skarmory and Mega Venusaur, allowing them to sweep late-game. Mega Heracross is prone to being revenge killed by faster threats like Greninja, Iron Moth, and Enamorus, so teammates that can deal with them such as Tapu Fini, Tyranitar, and Celesteela, respectively, are appreciated. Fire-type partners like Victini and Iron Moth can threaten Buzzwole, which walls Mega Heracross; Poison-types like Amoonguss can threaten Fairy-types like Tapu Fini and Unaware Clefable, which also wall it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Skarmory": {
    "sets": {
      "Defensive": {
        "description": "<p>Skarmory is a great physical wall in the metagame thanks to its impressive defensive typing and great physical bulk allowing it to handle threats such as Excadrill and Scizor among other foes. Skarmory also serves as a valuable Spikes user thanks to it being able to set up against threats such as Buzzwole, Blissey, and non-Flamethrower Clefable. The combination of Iron Defense and Body Press is Skarmory’s preferred choice to make progress against teams, as it allows it to stonewall threats such as Scizor, Bisharp, and Tyranitar while also further pressuring threats such as Blissey and Hippowdon. Dropping Iron Defense and Body Press for Whirlwind or Toxic and Brave Bird respectively is also an option on more offensive teams to pressure threats such as Buzzwole and Mega Venusaur more effectively while also offering extra team support by phasing or spreading poison damage. However, this comes at the cost of being far more passive against Excadrill and lacks a proper response to Bisharp. 96 Speed EVs allows Skarmory to outspeed Adamant Azumarill. On stall teams, Skarmory has the choice of running Defog in place of either Spikes or Iron Defense and can also run an EV spread of 248 HP / 76 Def / 184 Spe with an Impish nature to outspeed Choice Band Tyranitar, allowing it to boost or safely heal up before Tyranitar can 2HKO it. Skarmory’s main item of choice is Rocky Helmet to get residual damage off against foes with U-turn such as Scizor while also chipping setup sweepers, but it can also run Shed Shell on bulkier playstyles such as balance and stall in order to avoid being trapped by Magnezone. Skarmory can struggle a lot against special attackers such as Iron Moth and Enamorus, so specially defensive walls such as Blissey, Chansey, and specially defensive Skeledirge are good partners to shore up that weakness. Tyranitar is another good partner, since it can switch into and Pursuit trap threats that pressure Skarmory such as Iron Moth and Hisuian Zoroark. Common pivots that take advantage of Skarmory such as Thundurus also hate being Pursuit trapped by Tyranitar. Skarmory also has issues against Fire-types such as Iron Moth and Victini, so bulky Water-types such as Slowbro, Slowking, Gastrodon, and Alomomola can help deal with them. Electric-types such as Thundurus, Sandy Shocks, and Zeraora can also threaten Skarmory, so bulky Ground-types such as Hippowdon and Gastrodon are good partners to hinder them, but bulky Grass-types such as Tangrowth, Amoonguss, and Mega Venusaur also work as teammates at the cost of being unable to block Volt Switch. The aforementioned Ground-types can also form strong entry hazard stacking cores with Skarmory that bulkier playstyles such as stall enjoy greatly. Offensively, wallbreakers such as Life Orb Mienshao make for good partners, since they appreciate Skarmory's Spikes helping them chip their checks so they can wallbreak easier.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568189, "username": "Runo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Iride"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Tyranitar": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Tyranitar is a brutally powerful wallbreaker capable of ripping through common defensive staples such as Clefable, Mega Venusaur, and Celesteela. Its absurdly powerful Knock Off and Pursuit combined with its excellent special bulk also make it a premier Pursuit trapper capable of dominating common Psychic-types such as Victini and Slowking as well as physically frail foes like Iron Moth and Blissey. Superpower targets Ting-Lu and Excadrill. While an Adamant nature maximises Tyranitar's wallbreaking power, a Jolly nature can be used instead to outspeed Jolly Aegislash and Bisharp. Tyranitar best fits on offense teams looking for a wallbreaker and Pursuit trapper. It is especially effective at removing special walls such as Blissey, making specially attacking teammates such as Greninja and Iron Moth great partners. Pivots, notably specially attacking ones such as Slowbro and the aforementioned Iron Moth, can force in special walls and safely bring in Tyranitar. Entry hazard setters such as Excadrill and Skarmory enjoy Tyranitar's ability to break through most hazard removal options, and it greatly appreciates the chip damage they provide in return. Tyranitar is dominated by Fighting-types such as Mienshao and Buzzwole, making checks to them such as Clefable and Mega Latias mandatory teammates. Sand Stream can notably support Sand Rush variants of Excadrill, and because they are both physical wallbreakers, Tyranitar and Excadrill can weaken their shared physically defensive checks like Skarmory, Buzzwole, and Tangrowth. While Tyranitar matches up well against many special attackers, it falters against a good deal of them such as Alakazam and Greninja due to its weaknesses, making specially defensive tanks such as Slowking and Assault Vest Tangrowth useful partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Iride"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Swampert": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Swampert's good matchups against entry hazard removers like Excadrill, Rotom-W, and Salamence and access to Flip Turn make it a solid option for offensive teams as a Stealth Rock setter. Its typing allows it to check important threats like Mega Aerodactyl, Victini, and Excadrill, and utility options like Toxic and Yawn are useful to pressure Defoggers or force switches, respectively. Flip Turn allows Swampert to function as a slow pivot and bring another teammate in safely against Pokemon like Mega Venusaur, Clefable, and Slowbro. Toxic cripples Defoggers like Rotom-W and Salamence and walls like Slowbro, Tangrowth, and Gastrodon. Yawn is an alternative that can discourage setup sweepers like Calm Mind Latias or Clefable from taking advantage of Swampert, and it synergizes well with Flip Turn and entry hazards by forcing the opposing Pokemon to switch out and surrender momentum. A Relaxed nature with 0 Speed IVs is used to ensure Swampert is as slow as possible, letting it use Flip Turn after the opposing Pokemon attacks. Swampert fits best on offensive teams looking for a pivot that can set up Stealth Rock and safely bring in frail wallbreakers such as Choice Specs Enamorus against walls like Slowbro. Pivots like Victini and Thundurus can create VoltTurn cores and enjoy Swampert bringing them in against Pokemon like Mega Venusaur and Celesteela. Celesteela in particular appreciates Swampert's Electric immunity and ability to check Victini, Rotom-W, and Zeraora; in return, Celesteela deals with Grass-types that annoy Swampert like Tangrowth, Amoonguss, and Tapu Bulu. Slow wallbreakers like Choice Band Tyranitar and Choice Band Bisharp can pressure Pokemon that Swampert invites in like Slowbro, Salamence, and Clefable. The latter two are especially notable since they can Pursuit trap Slowbro, and all of them enjoy Swampert's ability to keep entry hazards up and maximize their wallbreaking potential. Finally, Swampert is very reliant on Leftovers to check threats like Excadrill as it lacks other forms of recovery, making Knock Off absorbers like Mega Venusaur and Z-Move Hydreigon great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535121, "username": "Pubo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Gardevoir": {
    "sets": {
      "Stallbreaker": {
        "description": "<p>With Pixilate-boosted Hyper Voice and an incredible Special Attack stat, Mega Gardevoir is one of the tier's most effective stallbreakers, able to threaten many defensive staples like Ting-Lu with its STAB moves and rip through neutral and even resistant targets like Clefable and Skarmory. However, Mega Gardevoir faces competition from Enamorus as a wallbreaker and other Fairy-types with more defensive utility like Tapu Fini. Psyshock allows Mega Gardevoir to do decent damage to Blissey and also threatens Pokemon that resist Hyper Voice, like Mega Venusaur. Mystical Fire hits the Steel-types that resist both of its STAB moves, such as Celesteela and Aegislash. These three moves make Mega Gardevoir a potent threat on its own, so the fourth slot can be changed to whatever suits the team best. Teleport takes advantage of the many switches Mega Gardevoir forces thanks to its high power, letting it pivot out of checks like Celesteela and Chansey and bring out Pokemon like Magnezone that can trap the former, and Pokemon like Choice Band Bisharp and Choice Band Tyranitar that can Pursuit trap both. Taunt prevents status and recovery moves from Pokemon like Chansey. Calm Mind is another great option against defensive teams, as it takes advantage of these slower structures by boosting up its Special Attack. This allows it to break through foes that would normally stop it, notably being able to 2HKO the likes of Chansey and Celesteela after a boost. Mega Gardevoir commonly finds itself on offensive teams that appreciate a strong wallbreaker, such as teams with VoltTurn cores, as these teams may struggle to properly break stall and bulkier teams. However, Mega Gardevoir can struggle against specially defensive Pokemon like Chansey, Celesteela, and Jirachi. Chansey is able to poison Mega Gardevoir lacking Taunt, and defensive Celesteela and Jirachi can both take a hit and retaliate with Heavy Slam and Iron Head, respectively. Mega Gardevoir greatly appreciates help from strong physical attackers like Mienshao and Victini and good entry hazard setters, such as Ting-Lu, Swampert, and Excadrill, to pressure these Pokemon. Pokemon like Thundurus that can pressure its aforementioned checks with special attacks are also great teammates. Mega Gardevoir's Speed also leaves it susceptible to being picked off by Choice Scarf Mienshao, Iron Moth, Mega Aerodactyl, and Excadrill in sand, making Skarmory and Rotom-W great defensive partners. In return, Mega Gardevoir can threaten the bulky cores that these Pokemon may struggle to break apart.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 593933, "username": "Amstan"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 572981, "username": "Aera"}]}]}
  },
  "Sableye": {
    "sets": {
      "Magic Bounce": {
        "description": "<p>The combination of solid bulk, incredible utility, and Magic Bounce makes Mega Sableye a near-mandatory addition on stall teams. Thanks to Magic Bounce, Mega Sableye is able to effectively stop entry hazards from the likes of Skarmory and Sand Rush Excadrill from going up on its side of the field, and thanks to its Ghost typing it can block Rapid Spin from Excadrill as well. Knock Off is used for its ability to remove items like Leftovers and Heavy-Duty Boots from targets like Celesteela and Enamorus, causing them to be worn down more easily. Will-O-Wisp allows Mega Sableye to cripple physical attackers such as Excadrill with a burn. It can also be used against Pokemon unbothered by Knock Off like Mega Venusaur to slowly wear them down. The final moveslot is typically given to Protect, allowing Mega Sableye to safely get its Mega Evolution off as well as scout the intentions of Choice item users like Enamorus and Keldeo. Toxic is an alternative to status Pokemon that do not mind Will-O-Wisp like Victini and Nasty Plot Hydreigon. Prankster is chosen as the pre-Mega ability on Sableye, allowing it to burn a boosted physical threat in case of emergency. Mega Sableye struggles with strong special attackers, and as such appreciates specially defensive teammates like Blissey, Ting-Lu, and Gastrodon. Its lack of passive recovery in tandem with Recover’s meagre PP means it can get worn down by repeated hits and chip damage from sand. Therefore, Wish passers like Blissey and Clefable will greatly improve its longevity. Mega Sableye can get statused through Magic Bounce by moves like Sludge Bomb and Scald and thus appreciates cleric support from Chansey or Clefable. Pokemon like Clefable and Mold Breaker Excadrill can effectively set up hazards against Mega Sableye. As such, backup hazard control from Pokemon like Skarmory and Mandibuzz can prove helpful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 572981, "username": "Aera"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Iride"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Flygon": {
    "sets": {
      "Defensive Utility": {
        "description": "<p>Flygon is a niche role compression option for bulkier teams that is an effective check to a variety of defining offensive threats like Aegislash, Iron Moth, and Victini while providing Defog support and blocking Volt Switch from the likes of Rotom-W and Zeraora better than Ground-types like Hippowdon and Ting-Lu. Earthquake and Toxic allow Flygon to properly perform its role by checking the aforementioned options as well as ensuring that Flygon can beat certain entry hazard setters such as Hippowdon and Ting-Lu. However, Flygon can fail to prevent hazards being set up by Clefable and Skarmory given its inability to threaten them. While Defog is essential for Flygon to perform its primary role, alternative utility options such as U-turn, Dragon Tail, and Psychic Noise are options on bulkier hazard-stacking teams that appreciate Flygon's defensive profile but do not need Defog. Leftovers is generally preferred on Flygon, as its Spikes immunity and Stealth Rock resistance mean that Heavy-Duty Boots is not necessary. Groundium Z is an alternative option to allow Flygon to threaten OHKOs on certain Ground-weak foes like Aegislash and Iron Boulder that may otherwise be able to survive an Earthquake. The given EV spread avoids a 3HKO from Choice Band Iron Boulder's Mighty Cleave, lets Flygon take Shadow Ball twice from maximum Special Attack Aegislash and not be 4HKOed by Iron Moth's Sludge Wave, and outspeeds Timid Magnezone and positive-natured Aegislash. When using Groundium Z, an alternative EV spread of 16 Attack and 148 Special Defense with an Adamant Nature is recommended to always OHKO maximum HP Shield forme Aegislash and always take Shadow Ball twice from maximum Special Attack Aegislash. Given Flygon's inability to handle many of the metagame's premier threats such as Greninja, Mega Venusaur, and Excadrill and inability to use Defog on common hazard setters like Skarmory and Clefable, heavy team support is necessary to facilitate it, leaving Flygon generally only used on stall or other bulky team styles. Reliable answers to Clefable and Skarmory such as Jirachi, Mega Venusaur, and Aegislash are required alongside Flygon; in return, Flygon can check Fire- and Ground-types such as Victini and Ting-Lu. Mega Venusaur, in particular, is a common partner for Flygon, as it appreciates Flygon's ability to remove hazards, can check both Clefable and Skarmory, and appreciates Flygon absorbing burn from Rotom-W. While Flygon provides great utility, its middling bulk means it can often struggle to handle common threats Ground-types like Hippowdon and Ting-Lu are tasked with handling, such as Choice Band Tyranitar and Choice Band Iron Boulder. For this reason, partners like Skarmory and Tangrowth are important alongside Flygon to help handle such threats and patch up holes Flygon may leave in these bulky teams' defensive structures.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Latias": {
    "sets": {
      "Mega Calm Mind": {
        "description": "<p>Mega Latias's impressive bulk, speed tier, and defensive typing make for a superb setup sweeper. This also allows it to find points of entry against common offensive threats such as Iron Moth and Keldeo. Calm Mind boosts Mega Latias' naturally high Special Attack and Special Defense to astounding levels, ensuring that it can easily withstand moves such as Clefable's unboosted Moonblast and Choice Scarf Hydreigon's Dark Pulse to sweep weakened teams. Psyshock is crucial to ignore defensive boosts from Calm Mind variants of the aforementioned Clefable while also breaking past special walls such as Blissey and Chansey more easily, preventing them from crippling Mega Latias with status moves. Aura Sphere provides Mega Latias with important coverage against most Dark- and Steel-types, hitting Pokemon such as Tyranitar, Bisharp, and Excadrill super effectively. Alternatively, if Tyranitar is handled adequately by Mega Latias's teammates, Mystical Fire can be used to deal more immediate damage to the likes of Scizor and Celesteela instead. Mega Latias fits best on defensive and balance teams, which can provide it with the longevity needed to gain proper setup opportunities. Entry hazard support from the likes of Skarmory and Gastrodon can help wear down opposing walls that would otherwise be difficult to break through late-game, such as Tapu Fini. Conversely, paralysis support from the likes of Clefable is also notable, as they can limit faster Pokemon such as Choice Scarf Hydreigon from being able to overwhelm Mega Latias with super effective hits late-game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Latias is an effective form of speed control that sets itself apart from other Pokemon the same role, such as Choice Scarf Mienshao, with its unique utility options. Draco Meteor serves as its main STAB attack, letting Latias revenge kill most neutral targets such as Thundurus and opposing Latias. Psyshock is a more spammable STAB move that also lets it clean weakened teams and threaten Fighting-types as well as Iron Moth. Psychic is very similar, trading a chance to OHKO Iron Moth for a slightly higher damage output against most neutral targets. Healing Wish is especially helpful to bulky Pokemon that lack reliable recovery such as Tapu Fini. It can also grant offensive Pokemon another opportunity to sweep or wallbreak. Trick is Latias's preferred fourth move, allowing it to cripple otherwise unbreakable foes such as Blissey and Chansey. An alternative is Mystical Fire, which lets Latias threaten the Steel-types that resist its STAB combination, like Aegislash and Excadrill. Its Special Attack-lowering effect makes it especially useful against certain boosting threats such as Autotomize Celesteela. Defog is another alternative, letting Latias clear hazards for its team; however, the fact that Latias loses to most Stealth Rock users such as Excadrill makes it somewhat unreliable in this role. Latias fits best on bulky offense and balance teams that want a revenge killer and appreciate Latias's utility. Latias struggles the most against special walls like Blissey and Slowking, making physical wallbreakers such as Bisharp and Mienshao mandatory partners. Fighting-types such as Buzzwole are useful to threaten Tyranitar, which takes minimal damage from Latias's attacks and can trap it with Pursuit; they can also take out Steel-types like Excadrill, something especially important if Latias forgoes Mystical Fire. Latias's ability to force in and cripple special walls with Trick makes a good partner for special attackers like Clefable.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Jirachi": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Specially Defensive Jirachi utilizes its solid bulk and useful resistances to check numerous special attackers such as Alakazam, Mega Latias, and Clefable. Iron Head is chosen as Jirachi’s STAB move thanks to its decent power and high flinch chance, bolstered further by Serene Grace. Stealth Rock provides the team with valuable entry hazard support. Though, if that role has already been covered on the team, Jirachi can also run Fire Punch to hit common checks like Scizor and Aegislash, or Body Slam to paralyze foes like Hippowdon and Celesteela. U-turn allows Jirachi to maintain momentum and bring its teammates in safely. Healing Wish can fully heal whichever one of Jirachi’s worn down teammates is needed the most late-game. Alternatively, the combination of Wish and Protect can be used to vastly increase the Jirachi’s longevity, though it diminishes its support capabilities and renders it more passive. 16 Speed EVs allow Jirachi to outspeed Adamant Bisharp. The remaining EVs are used to maximize Jirachi’s special bulk. Jirachi is prone to getting Pursuit trapped by Dark-type Pokemon like Tyranitar and Bisharp and thus needs to be positioned carefully to not be taken out too early. It also pairs well with Pokemon that can switch into these threats such as Keldeo. Jirachi is also weak to common Ground-types like Excadrill and Hippowdon and thus pairs well with Pokemon like Celesteela or Rotom-W that can handle them. Jirachi also quickly gets overwhelmed by strong Fire- and Ghost-types and therefore appreciates teammates that handle those Pokemon like Tyranitar and Ting-Lu.</p>"
      },
      "Happy Hour": {
        "description": "<p>Happy Hour Jirachi functions as a potent late-game sweeper. Z-Happy Hour gives Jirachi a +1 boost to all its stats, heightening its damage output and increasing the base power of Stored Power. After a Z-Happy Hour boost, Stored Power is a powerful STAB move that allows Jirachi to OHKO Pokemon like Buzzwole and physically defensive Tangrowth while 2HKOing common walls like Hippowdon and Tapu Fini. Iron Head is a powerful STAB move that hits Dark-type Pokemon like Tyranitar and Hydreigon; as it is a physical move, it allows Jirachi to beat Blissey and Chansey, which otherwise beat most special attackers. Iron Head’s high Serene Grace-boosted flinch chance also allows Jirachi to chip its checks into range for its other moves to KO. Shadow Ball hits Pokemon like Aegislash and Slowking for super effective damage, though Thunderbolt can be used instead to hit Celesteela and Mandibuzz while maintaining super effective coverage for Slowking. Jirachi struggles to do meaningful damage to walls like Ting-Lu and Hisuian Goodra and thus pairs well with Pokemon like Keldeo and Mienshao that can threaten these Pokemon. Entry hazard support from Pokemon like Tyranitar and Ting-Lu will further wear these checks down to facilitate its sweep. Jirachi can also be overwhelmed prior to setting up by offensive threats like Victini, Excadrill, and Galarian Moltres. Thus, Jirachi appreciates checks to these Pokemon like Rotom-W, Celesteela, and Tyranitar.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Jirachi is a potent form of speed control, able to check fast threats like Enamorus and Alakazam while also effectively serving as a pivot with U-turn. Iron Head lets Jirachi exert high pressure thanks to its decent power and Serene Grace-boosted flinch chance. Trick allows Jirachi to cripple defensive checks like Slowbro and Skarmory that would otherwise switch in for free. Alternatively, Jirachi can use Fire Punch to hit Steel-type Pokemon like Aegislash and Scizor for super effective damage. U-turn allows Jirachi to maintain momentum for its team. Healing Wish lets Jirachi fully heal any of its worn down teammates. Jirachi struggles to deal meaningful damage to defensive Pokemon like Celesteela, Tangrowth, and Ting-Lu. It therefore pairs well with wallbreakers like Iron Moth and Enamorus that can threaten these switch-ins. Pokemon like Aegislash, Excadrill, and Bisharp also threaten Jirachi with super effective STAB moves while taking negligible damage from Jirachi in return. Switch-ins to these threats like Mandibuzz and Skarmory are therefore invaluable. Due to Jirachi’s middling damage output, it appreciates entry hazard support from Pokemon like Tyranitar and Skarmory to apply more pressure to Jirachi’s switch-ins. Jirachi can also get worn down quickly by Spikes and Rocky Helmet chip damage and thus pairs nicely with hazard removers, such as Rotom-W and Excadrill, and Knock Off support from Pokemon like Tyranitar and Clefable.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 572981, "username": "Aera"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Gastrodon": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Gastrodon sets itself apart with its excellent Water / Ground typing in combination with Storm Drain. This unique set of traits allows it to flourish on defensive teams, where it is able to check a number of strong special attackers such as Mega Latias and Volcanion while supporting the team with passive damage. Spikes or Stealth Rock allow Gastrodon to support its teammates by wearing down the opposing team. If the team already has entry hazards covered, Clear Smog can be used to stop common setup sweepers such as Victini and Clefable that would otherwise greatly threaten Gastrodon and its teammates. Scald is used to cripple both physical attackers and poison-immune Pokemon with a burn. Earthquake is an alternative for more immediate pressure against Poison- and Steel-types such as Okidogi and Iron Moth, but it leaves Gastrodon unable to punish switch-ins like Celesteela and Skarmory. The final moveslot is usually given to Toxic, which allows Gastrodon to slowly wear down its answers. Alternatively, Protect can be used in tandem with Leftovers to improve its longevity while also scouting common Choice-locked Pokemon such as Keldeo and Enamorus. Gastrodon's great special bulk and unique resistances allow it to help out Pokemon like Skarmory, Slowbro, and Tangrowth that struggle against strong Fire- or Electric-type attacks from Pokemon like Volcanion, Sandy Shocks, and Zeraora. Gastrodon can get worn down quickly through poison and burn and therefore appreciates cleric support from Pokemon like Clefable and Blissey. Its low Defense also leaves it susceptible to strong physical attackers such as Tyranitar and Bisharp, and therefore, it appreciates physical walls such as Tangrowth and Buzzwole that can handle those threats. Gastrodon is also very weak to Pokemon that use Grass-type moves such as Mega Venusaur and Iron Moth and therefore needs to be wary of coverage from Pokemon it is used to check. Secondary special walls like Blissey and Celesteela are therefore appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 572981, "username": "Aera"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Hippowdon": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>With great typing and bulk, Physically Defensive Hippowdon is an effective blanket check on balance teams to many of the tiers most threatening physical attackers, such as Tyranitar, Iron Boulder, and Excadrill. Earthquake is a strong STAB move that threatens many of the foes Hippowdon is tasked with handling, like Victini and Zeraora, and pairs nicely with Toxic to force in options like Tangrowth and Rotom-W and cripple them. Alternatively, Whirlwind is an option to help phaze sweepers like Swords Dance Scizor as well as force in entry hazard weak foes like Enamorus. Leftovers is the preferred item on Hippowdon, as its recovery allows Hippowdon to preserve recovery PP and turns. On teams without entry hazard removal, Heavy-Duty Boots is optimal to prevent Hippowdon from being worn down quickly. 8 Attack EVs allow Hippowdon to guarantee the OHKO on Excadrill with Earthquake. Sand Stream is the preferred ability on Hippowdon to chip the opposing team as well as potentially set sand for teammates like Excadrill, but Sand Force can be used on bulkier teams that dislike the chip on allies like Chansey. Physically Defensive Hippowdon can support attackers like Scizor and Thundurus, as they enjoy pivoting and Hippowdon provides hazard support to weaken checks like Celesteela and Mega Venusaur as well as a defensive backbone to fall back on against Pokemon like Excadrill and Tyranitar. In return, they can help check the Water- and Grass-types that threaten Hippowdon, like Tapu Fini and Hydrapple. Celesteela is a notable teammate for Hippowdon, as it can handle the Grass-types Hippowdon dislikes while Hippowdon can handle Fire- and Electric-types like Victini and Zeraora for it. Hippowdon also finds it difficult to handle special attackers like Keldeo and Enamorus, so defensive options like Slowking and Chansey are important alongside it, and Hippowdon can check threats like Excadrill or Bisharp in return.</p>"
      },
      "Mixed Wall": {
        "description": "<p>While specially defensive Hippowdon is generally outclassed by Ting-Lu, it is an option for teams looking for an entry hazard setter that can pressure defoggers like Rotom-W and Salamence while also checking Iron Moth while healthy. With Special Defense investment, Hippowdon becomes able to handle weaker special attackers such as Choice Scarf Enamorus and Aegislash as well as weak physical attackers like Zeraora. Earthquake serves as Hippowdon's way to threaten the foes it switches into, while Toxic is often used to pressure common switch-ins, like Rotom-W and Salamence. Leftovers is generally preferred to ensure Hippowdon can sponge both physical and special attacks better, but Heavy-Duty Boots can be used on teams lacking entry hazard removal. 8 Attack EVs allow Hippowdon to guarantee the OHKO on Excadrill. Specially defensive Hippowdon is only seen as a sand setter on balance sand teams, which appreciate its longevity and ability to pressure defoggers like Rotom-W and Salamence. Given Hippowdon's lacking special bulk even after heavy investment, strong neutral or super effective hits like Choice Specs Enamorus Moonblast or Rotom-W's Hydro Pump can still threaten Hippowdon. Therefore, backup special walls like Chansey and Assault Vest Tangrowth are recommended, and Hippowdon can help check threats like Zeraora and Iron Moth for them in return. Options that can handle strong physical attackers like Tyranitar and Z-Move Excadrill that threaten Mixed Wall Hippowdon, like Clefable and Skarmory are recommended, the latter of which can form a hazard stack core with Hippowdon. In return, Hippowdon can check threats like Aegislash and Victini for them. Partners like Excadrill and Keldeo also appreciate Hippowdon luring in Rotom-W and Salamence and crippling them with Toxic to allow them to wallbreak later in the game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 568189, "username": "Runo"}, {"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Magnezone": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Magnezone combines its ability to trap and remove certain Steel-types with potent special wallbreaking prowess that lets it rip through common defensive staples such as Tapu Fini, Clefable, and Tyranitar. It is an effective pivot with Volt Switch, though it must be wary of Ground-types like Hippowdown and Excadrill switching in. Hidden Power Grass primarily targets Gastrodon and Quagsire, and it also hits other, rarer Pokemon that share their type combination like Swampert. Hidden Power Fire is an alternative to hit Excadrill on the switch and also OHKO Scizor after trapping it. Magnezone best fits on offense teams looking for a means to remove Steel-types, primarily Skarmory and Celesteela. Removing the former enables numerous physical attackers, such as Tyranitar and Scizor while removing the latter enables teammates such as Enamorus. Pivots such as Slowking can form effective pivoting cores with Magnezone, helping it safely switch into foes like Slowbro and Clefable; physically attacking pivots like Scizor can notably lure Skarmory in. Due to Skarmory possessing Sturdy and Body Press, Stealth Rock support from teammates such as Tyranitar and Clefable greatly aids Magnezone. Magnezone struggles to take on Ground-types such as Hippowdon and Ting-Lu, and depending on its choice of coverage, it's walled by Ground / Water types like Gastrodon or Ground / Steel types like Excadrill, making Grass- and Water-types such as Mega Venusaur and Keldeo useful partners. Magnezone struggles to break through special walls like Chansey and Blissey, making the aforementioned physical wallbreakers useful; Pursuit trappers such as Tyranitar and Bisharp are especially effective at removing these foes, and they appreciate Magnezone's pivoting capabilities.</p>"
      },
      "Substitute + 3 Attacks": {
        "description": "<p>Substitute lets Magnezone take advantage of switches from foes it forces out such as Tapu Fini and Clefable and exploit status moves like Amoonguss's and Celesteela's Leech Seed. Hidden Power Grass targets Gastrodon, Quagsire, and some rare foes like Swampert. Electrium Z powering up Thunderbolt helps Magnezone break through certain foes it traps such as Scizor and specially defensive Celesteela; Steelium Z primarily helps against Ground- and Grass-types such as Hippowdon and Mega Venusaur. Magenzone best fits on offense teams looking to remove certain Steel-types, namely Skarmory and Celesteela. This enables numerous teammates such as Scizor. Since it fears taking Skarmory's Body Press and Celesteela's Flamethrower upon switching in, a pivot that can lure them in like Mienshao or Scizor is a great partner. A Stealth Rock setter like Clefable can let Magnezone avoid Sturdy to OHKO Skarmory. Magnezone is completely helpless against Excadrill, so Grass- and Water-types such as Tangrowth and Slowbro can help by dealing with them. After removing opposing Steel-types, Magnezone isn't particularly useful, though it's still a reasonably strong special wallbreaker, especially if it still can use its Z-Move. It struggles with special walls like Blissey and Chansey, so physical wallbreakers, notably Pursuit trappers like Tyranitar, can help by removing them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Tangrowth": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Tangrowth's excellent natural physical bulk, crucial resistances, and variety of utility options at its disposal come together to make it a solid physical wall, being an effective stop to the likes of Tyranitar and Excadrill. Regenerator only serves to further complement the aforementioned defensive traits, blessing it with the longevity needed to repeatedly switch into and answer these Pokemon. Knock Off allows Tangrowth to cripple incoming switch-ins by removing important held items, such as Heavy-Duty Boots from Thundurus and Leftovers from Clefable and Celesteela, making them far easier to wear down in the long-term. Hidden Power Fire allows Tangrowth to deal high amounts of damage to Steel and Grass-type Pokemon in a pinch, most notably 2HKOing Scizor. Alternatively, Focus Blast greatly improves Tangrowth's matchup against Excadrill and Bisharp, being able to OHKO the latter, although its lack of accuracy can be somewhat irritating. Sleep Powder allows Tangrowth to neutralize incoming targets it would otherwise be unable to threaten, such as Iron Moth, offensive Celesteela, and Skarmory while also shutting down setup sweepers like Calm Mind Clefable and Enamorus. However, Toxic can be used instead to permanently cripple Pokemon such as Buzzwole, Mega Latias, and Slowking, limiting their ability to pivot into Tangrowth throughout the game. Rocky Helmet allows Tangrowth to punish contact moves from the likes of U-turn, whereas Heavy-Duty Boots can be used to provide Tangrowth with greater longevity against entry hazards, allowing it to take advantage of Regenerator more effectively; it also helps keep Tangrowth out of KO range of wallbreakers it may try to switch in against, such as Iron Boulder and Excadrill when entry hazards have been set. Tangrowth fits best on balance teams that appreciate its longevity and diversity in crippling opposing teams via its utility options. Entry hazard setters such as Ting-Lu, Clefable, and Toxic Spikes Iron Moth appreciate Tangrowth's ability to deter opposing hazard removal options such as Tapu Fini and Rotom-W while further capitalizing on Tangrowth's tendency to remove various items from targets, such as Thundurus and Amoonguss, with Knock Off. Specially defensive teammates such as Slowking, Gastrodon, and Celesteela have excellent defensive synergies with Tangrowth, compensating for its low Special Defense by providing a solid backbone against threats such as Hydreigon and Alakazam; Slowking and Gastrodon also help Tangrowth play around with the likes of Keldeo, utility Clefable, and Victini, which can overwhelm it easily. In return, Tangrowth can help check the likes of Bisharp, which may threaten them. Besides the aforementioned Pokemon, offensive teammates such as Victini, Choice Specs Enamorus, and Thundurus appreciate Tangrowth's ability to sponge Knock Off from Pokemon that they may be forced out by, such as Tyranitar, Clefable, and Scizor.</p>"
      },
      "Assault Vest": {
        "description": "<p>Tangrowth is a solid special wall that can check threats like Enamorus, Hydreigon, Keldeo, and Alakazam thanks to Assault Vest and Regenerator, allowing it to pivot against these threats reliably throughout the game. Tangrowth's great movepool also allows it to punish specific targets to help its team; for example, Knock Off can remove Leftovers from Celesteela, making wallbreakers like Alakazam much more threatening and Heavy-Duty Boots from Iron Moth and Zeraora. Power Whip is used to beat Calm Mind Tapu Fini and Keldeo, but Giga Drain is a fine alternative that can provide reliable recovery. Focus Blast threatens Hydreigon, Bisharp, and Excadrill trying to use Tangrowth as setup fodder, while Sludge Bomb is used to fish for poison against targets like Mega Latias and hit Enamorus super effectively. Hidden Power Fire is Tangrowth's best way to hit Scizor and can be useful to chip targets like Skarmory and Excadrill into Focus Blast range. Finally, Earthquake hits Excadrill, Aegislash, and most importantly Iron Moth super effectively. Assault Vest is the item of choice so Tangrowth can offset its terrible Special Defense and check special attackers more reliably. Tangrowth fits best on balance teams as a good pivot capable of checking special attackers like Keldeo and scouting coverage moves like Mystical Fire from Pokemon like Enamorus for teammates like Slowking and Aegislash. Hippowdon, Excadrill, and Skarmory are all great teammates that enjoy Tangrowth checking Water-types like Keldeo and removing Heavy-Duty Boots from Victini and Enamorus to make their entry hazards much more effective. In return, Hippowdon and Skarmory can deal with threatening wallbreakers like Swords Dance Excadrill and Bisharp. Powerful special attackers like Choice Specs Enamorus and Nasty Plot Hydreigon can pressure Tangrowth with their STAB moves or super effective coverage, making additional defensive answers like Celesteela and Ting-Lu good options. Bulky Water-types like Slowking are good partners that can check threats like Iron Moth, Victini, and Volcanion for it; in return, Tangrowth can check Rotom-W. Clefable can scout Knock Off from opposing Clefable, opposing Tangrowth, and Tapu Fini, preventing Tangrowth from losing its much needed item. Finally, Tyranitar can Pursuit trap Iron Moth and Victini, while enjoying Tangrowth removing Leftovers from Defoggers like Rotom-W and Tapu Fini.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}, {"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Gallade": {
    "sets": {
      "Swords Dance": {
        "description": "<p>With a sky-high Attack stat and a powerful STAB Close Combat, Mega Gallade serves as a potent wallbreaker in the tier, able to pressure common defensive cores featuring Pokemon such as Skarmory, Ting-Lu, and Mega Venusaur. Mega Gallade's good Speed tier also allows it to notably get the jump on threats like non-Choice Scarf Enamorus, Keldeo, and Mienshao. After a Swords Dance boost, Mega Gallade can OHKO a majority of the tier, including bulky Pokemon like Hippowdon and Mega Latias. Close Combat OHKOes threats like Tyranitar, Excadrill, and Hydreigon while 2HKOing bulkier Pokemon like Celesteela and Gastrodon. Zen Headbutt threatens Mega Venusaur, Amoonguss, and Iron Moth while also being its strongest move against Fairy-types like Tapu Fini and Clefable. Triple Axel threatens Flying-types like both Thundurus formes and Enamorus as well as Dragon-types like Mega Latias and Hydrapple while also being its strongest move against Mega Sableye. Knock Off threatens switch-ins like Skeledirge, Slowking, and Slowbro while also hindering foes that Mega Gallade struggles to break through like Unaware Clefable. Physical cleaners like Zeraora and Scizor appreciate Mega Gallade being able to threaten or weaken their switch-ins such as Mega Venusaur and Skarmory, respectively, potentially allowing them to sweep late-game. Mega Gallade's frailty means it's OHKOed by faster threats like Mega Aerodactyl, so teammates that can handle them like Celesteela and Slowbro are appreciated. Mega Gallade struggles to break through Pokemon like Mega Sableye, Skeledirge, and Unaware Clefable, meaning it can struggle versus bulkier teams as a whole. Therefore, teammates that can assist in these matchups while threatening the aforementioned walls such as Enamorus and Bisharp are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rotom-Wash": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Rotom-W is an excellent pivot, wielding a great STAB combination that lets it freely use Volt Switch on most Pokemon, with common Ground-types like Ting-Lu, Hippowdon, and Excadrill in perpetual fear of taking Hydro Pump or Will-O-Wisp. Defensively, Rotom-W doubles as a momentum-maintaining check to offensive threats such as Excadrill and Mega Aerodactyl for more offensively oriented teams. Rotom-W can utilize Defog effectively thanks to a good matchup into the aforementioned Ground-types, as well as Skarmory, the premier Spikes setter in the tier. Will-O-Wisp allows Rotom-W to cripple common physical attackers such as Swords Dance Aegislash, additionally wearing down Mega Venusaur. Toxic threatens some of the few Pokemon that do not fear Rotom-W's STAB moves, such as Tangrowth, Mega Latias, and Gastrodon. Lastly, Pain Split allows Rotom-W to maintain longevity, especially helping it stick around versus fatter teams utilizing Chansey or Blissey and further chip down Mega Venusaur. The given EV spread allows Rotom-W to outrun max Speed Tyranitar and get ahead of most offensive Aegislash variants. Given its nature as a pivot, teammates like Tyranitar, Alakazam, and Bisharp that can capitalize on foes Rotom-W often forces in, such as Chansey, Mega Latias, Mega Venusaur, and Clefable work incredibly well. Ground-types that do not fear Hydro Pump, such as Gastrodon and Swampert, give Rotom-W trouble; Mega Venusaur is a great teammate to threaten these foes for it while Rotom-W can often bring it in on Clefable and Hydrapple.</p>"
      },
      "Choice Scarf": {
        "description": "<p>With a threatening STAB combination alongside a great defensive profile, Rotom-W is an excellent option for teams looking for speed control that provides a blend of power and utility and can repeatedly threaten foes like Excadrill and Iron Moth lacking a Speed Booster Energy boost throughout a game. Trick allows Rotom-W to cripple otherwise great counters like Gastrodon and Amoonguss, and while this leaves it unable to provide speed control, it also prevents foes like Ting-Lu and Tapu Fini from taking advantage of it being locked into Volt Switch or Hydro Pump, respectively. Defog is useful, as it grants Rotom-W even more utility, especially for offensive teams that find it hard to fit entry hazard control, and it lets it deal with common hazard setters in Ting-Lu and Skarmory. On teams with other forms of hazard control, Will-O-Wisp can be utilized to check bulkier physical attackers, such as Swords Dance Aegislash. 200 Speed EVs ensure Choice Scarf Rotom-W outspeeds Zeraora, with the rest invested in Defense. Rotom-W is utilized most effectively on offensive teams that appreciate its power and utility, but it can also be used on bulkier teams if given proper team support. Teammates like Mienshao and Hydreigon appreciate the pivot support Rotom-W provides, bringing them in on foes like Blissey and Hydrapple, while forming a pivoting core that can bring it in on their checks, like Slowbro and Tapu Fini. Rotom-W is stifled by Grass-types, especially Mega Venusaur, as Rotom-W cannot use Trick to cripple it with Choice Scarf, so checks to them like Celesteela and Scizor are appreciated. In return, Rotom-W can check Fire-types such as Iron Moth and Victini for its partners. Choice Scarf Rotom-W also suffers from a lack of longevity, as it must invest heavily in Speed and cannot utilize Pain Split or Leftovers; therefore, it appreciates faster team compositions with teammates like Enamorus, Excadrill, and Tyranitar that aim to win quickly, which allows Rotom-W to leverage its defensive profile efficiently short-term to grant it and its teammates more attacking opportunities. On bulkier team structures alongside defensive options like Celesteela and Ting-Lu, Rotom-W appreciates Wish support from partners like Clefable and Chansey to allow it to stay healthy throughout the game, given its lack of recovery.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 514772, "username": "sealoo"}, {"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}, {"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Victini": {
    "sets": {
      "Pivot": {
        "description": "<p>Heavy-Duty Boots Victini is a great offensive pivot, using the combination of its strong V-create, utility options, and momentum to wear down opposing teams. Bolt Strike provides crucial coverage against Water-types such as Slowbro, Tapu Fini, and Volcanion that may try to soak up its other moves. Toxic is used in the last moveslot to give Victini a way of applying long-term pressure against certain physically defensive pivots such as Hippowdon and Rotom-W that otherwise don't mind taking V-create, allowing Victini to outlast them in the long run. Alternatively, Will-O-Wisp deals less residual damage against the aforementioned targets but it allows Victini to deter physical attackers such as Mega Aerodactyl and Azumarill from switching in while creating mind games against Pursuit Tyranitar. Encore is also an interesting option that allows Victini to continue breaking down Pokemon such as Clefable and Mega Latias that rely on stalling V-create via recovery moves while letting Victini double as an effective countermeasure against their setup variants. This Victini set typically fits best on bulkier team structures, which can provide it with sufficient opportunities to break down the opposing team as well as provide a solid defensive foundation for it to fall back on against potential adversaries such as Mega Aerodactyl and Keldeo. Additionally, these structures also appreciate Victini's ability to help play around dangerous threats such as Clefable and Mega Gardevoir. Entry hazard setters such as Hippowdon, Clefable, and Skarmory are prime examples that can also support Victini through their use of status moves or, in Clefable's case, Knock Off to remove opposing Leftovers and Heavy-Duty Boots from Pokemon such as Rotom-W and Skeledirge. Similarly, other defensive pivots such as Rotom-W, Scizor, Assault Vest Tangrowth, and Celesteela can assist Victini by sponging attacks from the likes of faster Pokemon that may force Victini out, such as Iron Boulder and Greninja. Lastly, additional pivoting support, particularly from the aforementioned Rotom-W and Scizor as well as Zeraora and Choice Scarf Mienshao can form effective VoltTurn cores with Victini, utilizing their ability best to help force out the likes of Greninja and Mega Aerodactyl in order to compensate for Victini’s lower Speed tier. These Pokemon also appreciate Victini's own ability to lure in and wear down several of the walls that may deter them from making progress, such as Hippowdon, Mega Latias, and Pecharunt.</p>"
      },
      "Z-Celebrate": {
        "description": "<p>Z-Celebrate turns Victini into a powerful and difficult to revenge kill setup sweeper capable of setting up against and threatening large portions of the metagame. After using Z-Celebrate, Victini outspeeds the entire unboosted metagame as well as common Choice Scarf users such as Tapu Fini. The boost to Victini's defenses eases setup and makes it more difficult for priority moves such as Shadow Sneak from Aegislash and Sucker Punch from Bisharp to revenge kill it; in addition, it lets Victini survive attacks such as Earthquake from Excadrill, giving it the option to set up against them. At +1, Victini's Searing Shot OHKOes most Steel-types such as Excadrill. Stored Power pairs nicely with Z-Celebrate, reaching 120 BP after the latter move is used, enabling Victini to deal massive damage to Fire-resistant foes such as Mega Aerodactyl and Tapu Fini, OHKOing the former after Stealth Rock. Stored Power's Base Power rise after setting up also enables Victini to 2HKO Unaware users such as Quagsire and physically defensive Skeledirge. Focus Blast pairs well with Victini's STAB moves, hitting top threats such as Tyranitar, and its poor accuracy is mitigated somewhat by Victory Star. Alternatively, Energy Ball lets Victini destroy specially defensive Gastrodon, which otherwise takes little from even a boosted Stored Power. Z-Celebrate Victini fits best on hyper offense teams as a late-game cleaner. Entry hazard support from Mew and Excadrill can help wear down foes such as Tapu Fini and Slowbro into range of Victini's attacks. Excadrill also offers Rapid Spin to remove hazards for Victini. Good offensive partners for Victini include Swords Dance Scizor and Autotomize Celesteela. Finally, Celesteela and Victini share similar checks in specially bulky Pokemon like Gastrodon and Mega Latias, so they can weaken each other's checks to enable one of them to sweep.</p>"
      },
      "Choice Band": {
        "description": "<p>Victini is a great wallbreaker with Choice Band, packing a V-create strong enough to 2HKO Fire-resistant Pokemon as bulky as Gastrodon, offensive Tyranitar, and Tapu Fini. U-turn generates momentum against foes such as Tyranitar and Mega Latias, wearing them down over the course of a game. Trick lets Victini cripple an opposing physical wall such as Slowbro by giving it a Choice Band. Bolt Strike targets Water-types, notably 2HKOing Slowbro and physically defensive Tapu Fini Choice Band Victini fits best on offensive and bulky offense teams, where it serves as a powerful early- or mid-game wallbreaker. Victini is vulnerable to all forms of entry hazards and therefore appreciates entry hazard removal from Excadrill, Hydreigon, or Tapu Fini. Excadrill and Tyranitar can also set Stealth Rock to weaken Victini's checks such as Slowbro into range of its attacks. Victini also greatly enjoys U-turn or Teleport support to let it hit the field to launch its powerful V-create. Scizor and Slowbro are all good Pokemon that fulfill this role. Scizor can even trap some of Victini's checks, such as Mega Latias, with Pursuit. Since Victini can struggle to reliably pressure some of its aforementioned checks, like Slowbro thanks to Regenerator, a partner that can take advantage of them, such as Nasty Plot Hydreigon, is also appreciated. Finally, a good late-game cleaner such as Autotomize Celesteela can finish off a team weakened by Victini. On sun teams, Venusaur is a good option for a cleaner that pairs well with Victini and enjoys its ability to punish Pokemon used to check it, such as Blissey.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}, {"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 546157, "username": "Iride"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Excadrill": {
    "sets": {
      "Sand Rush": {
        "description": "<p>Excadrill cements itself as a staple on sand teams thanks to its great offensive capabilities with Swords Dance and Sand Rush. After a Swords Dance boost, it can effectively outspeed and break through a large portion of the metagame with its strong STAB moves. Steelium Z allows Excadrill to eliminate chipped switch-ins such as Buzzwole and Tangrowth after a Swords Dance boost. Rapid Spin supports the team while also making sure that Excadrill can beat other Sand Rush Excadrill and Unburden Hawlucha. If a teammate can remove entry hazards, Rock Slide is an alternative that stops Celesteela and Skarmory from stonewalling Excadrill, as well as handling threats such as Thundurus. As a Sand Rush sweeper, Excadrill needs to partner with Tyranitar or Hippowdon to outpace the entire metagame. Strong wallbreakers like Choice Band Tyranitar and Dracozolt form a strong offensive core with Excadrill to help overwhelm its checks such as Slowbro or Skarmory. In return, Excadrill can pressure threats such as opposing Excadrill for them. Additionally, Choice Scarf users such as Hydreigon, Latias, and Tapu Fini can help pressure some of Excadrill's checks, such as Buzzwole and Tangrowth, while also acting as secondary speed control options outside of sand. Tapu Fini in particular is a great partner to protect Excadrill from burns while setting up, thanks to its Misty Terrain, while also handling Buzzwole for it. Slowbro and Slowking handle Fighting- and Fire-types for it such as Buzzwole and Victini, as well as providing Future Sight support and safely getting Excadrill on the field with Teleport.</p>"
      },
      "Offensive Utility": {
        "description": "<p>Excadrill is a strong offensive spinner thanks to its ability to pressure common entry hazard setters, such as Clefable and Tyranitar, while serving as a strong check to common foes such as Tyranitar. The Attack EVs and nature make Excadrill less passive against threats such as Mega Latias and Scizor; the specific listed arrangement slightly optimizes the stat. The rest of the EVs are dumped into Special Defense to better check threats such as Mega Latias. Toxic is a great option to cripple common switch-ins to Excadrill such as Buzzwole, Tangrowth, and Slowbro while pressuring other threats such as Latias and Mega Sableye, providing more long-term support for its teammates. Iron Head can be used to check threats such as Clefable more easily. Swords Dance is an option, if running Iron Head instead of Toxic, to become a powerful setup sweeper. If running Swords Dance, then a more offensive EV spread of 252 Atk / 4 SpD / 252 Spe with a Jolly nature can be used. Stealth Rock is another option that gives Excadrill additional role compression as a hazard setter. Excadrill can struggle against physical walls such as Slowbro, Buzzwole, Skarmory, and Celesteela. Hydreigon and Thundurus can help deal with those defensive checks, and in return, Excadrill can check threats such as Clefable and Bisharp for them. Excadrill can be forced out by faster threats such as Mienshao, Alakazam, Iron Moth, and Blacephalon; defensive Pokemon such as Slowbro and Tapu Fini can help manage them, and these also give Excadrill slow pivoting in Teleport and Misty Terrain, respectively. Other defensive pivots such as Tangrowth and Tapu Bulu can help deal with Ground- and Water-type checks such as Hippowdown, Gastrodon, and Tapu Fini; however, run High Horsepower instead of Earthquake if pairing with Tapu Bulu due to Grassy Terrain cutting Earthquake's power in half. In return, Excadrill can remove threats such as Aegislash and Jirachi for them.</p>"
      },
      "Suicide Lead": {
        "description": "<p>Excadrill can function as a great suicide lead on hyper offense teams, having the unique ability to set up entry hazards against stall teams thanks to Mold Breaker bypassing Mega Sableye's Magic Bounce. Rapid Spin prevents opposing entry hazards from being set. Steel Beam allows Excadrill to go out while generating momentum for its teammates, as well as preventing common Defoggers such as Tapu Fini from clearing its Stealth Rock. Toxic is another option to cripple opposing hazard setters and Mega Sableye long-term. Focus Sash is an important item to ensure that Excadrill can reliably set Stealth Rock. Excadrill can struggle against threats such as Skarmory and Celesteela due to their Ground immunities; strong setup sweepers such as Thundurus, Meteor Beam Celesteela, and Nihilego can pressure them for it. Excadrill's Rapid Spin is especially beneficial for setup sweepers otherwise vulnerable to Stealth Rock, such as Booster Energy Iron Moth and Focus Sash Polteageist.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568189, "username": "Runo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Iride"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Conkeldurr": {
    "sets": {
      "Guts Wallbreaker": {
        "description": "<p>Conkeldurr is a niche wallbreaker capable of pressuring common defensive staples like Ting-Lu, Celesteela, Rotom-W, and Hippowdon. It has access to priority in Mach Punch and ability to threaten Fighting-type answers like Mega Venusaur, Clefable, Tapu Fini, and Mega Latias with Guts-boosted Facade. However, Conkeldurr faces competition from other Fighting-types like Okidogi, which can perform a similar role but with much-appreciated longevity thanks to Drain Punch and Bulk Up, and Mega Heracross, which has similar wallbreaking power and a much better Speed tier. Knock Off allows Conkeldurr to hit Aegislash, Slowbro, and Skeledirge super effectively, and Mach Punch allows it to revenge kill faster threats like Excadrill, Greninja, and Hydreigon. The given EV spread allows Conkeldurr to outspeed Clefable. Conkeldurr fits best on bulky offense teams filled with pivot support that can give it safe opportunities to activate its Flame Orb and wallbreak. Slowking and Slowbro can lure in Dark-types like Tyranitar and Hydreigon for Conkeldurr, which forces them out thanks to Mach Punch. Slowking in particular can either set up Future Sight to better pressure Conkeldurr's switch-ins like Buzzwole or use Thunder Wave to cripple faster Dark-types for the rest of the battle. Choice Scarf Hydreigon can use U-turn and lure in defensive Pokemon like Ting-Lu and Celesteela; in return, Conkeldurr can break past defensive Fairy-types like Clefable and Tapu Fini with Guts-boosted Facade. Faster Psychic- and Fairy-types like Mega Latias, Iron Boulder, and Enamorus are not threatened by Mach Punch and can easily force Conkeldurr out, making partners like Ting-Lu, Aegislash, and Scizor good options to deal with these Pokemon. Scizor in particular can lure in Celesteela and use U-turn to bring in a teammate that checks it, and it can also revenge kill Iron Boulder and Alakazam with Bullet Punch. Scizor also enjoys Conkeldurr pressuring some of its checks like Skarmory and Rotom-W with Close Combat. Defog Rotom-W is a good partner considering Conkeldurr's lack of longevity due to Flame Orb. Rotom-W can also bring Conkeldurr in with Volt Switch against slower Grass-types like Tangrowth and Amoonguss. Finally, Toxic from Victini and Zeraora can be useful to wear down Conkeldurr's checks, most notably Mega Latias and Buzzwole.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535121, "username": "Pubo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 391284, "username": "Velcroc"}, {"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Zoroark-Hisui": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Hisuian Zoroark's combination of high Special Attack and Speed, access to Nasty Plot, and excellent typing and ability that provide setup opportunities makes it a great wallbreaker and sweeper. Focus Blast primarily targets the Dark- and Normal-types that resist or are immune to Hisuian Zoroark's Shadow Ball, notably OHKOing most variants of Tyranitar and 2HKOing Hydreigon unboosted. It also targets Steel-types like Excadrill. Fightinium Z serves the dual purpose of letting Hisuian Zoroark avoid having to rely on Focus Blast's terrible accuracy while giving it the power to OHKO foes like Hydreigon unboosted and Galarian Moltres at +2. Grass Knot hits Ground-types like Hippowdon and Gastrodon, OHKOing most of them after Nasty Plot. Hisuian Zoroark fits best on offense teams with other wallbreakers and sweepers. Teammates like Iron Moth can KO or weaken Hisuian Zoroark's checks like specially defensive Celesteela, while it can remove foes like Hippowdon. Despite its good Speed, Hisuian Zoroark is vulnerable to being revenge killed by faster foes like Choice Scarf Mienshao and Choice Scarf Hydreigon, making walls such as Skarmory for the former and Tapu Fini for the latter useful partners. Illusion makes Hisuian Zoroak pair nicely with Pokemon weak to Fighting and Ghost, such as Tyranitar and Victini, forcing the opponent into an uneasy guessing game that can allow it or its teammates to set up. Pretending to be a physical attacker can also lure in physical walls like Skarmory and Buzzwole. Hazard setters like Excadrill and Mew can weaken checks like Mega Venusaur into Hisuian Zoroark's KO range.</p>"
      },
      "Choice Specs": {
        "description": "<p>Hisuian Zoroark's high Speed, power, and spammable Shadow Ball make it a potent wallbreaker. Focus Blast OHKOes Dark-types such as Tyranitar and Hydreigon and Steel-types such as Excadrill. Grass Knot 2HKOes Ground-types like Hippowdon and Gastrodon; it also 2HKOes or 3HKOes most variants of the Tyranitar formes, easing prediction and letting Hisuian Zoroark sometimes avoid having to rely on the inaccurate Focus Blast. Trick can cripple walls Hisuian Zoroark otherwise can't touch, such as Blissey and Chansey. Hisuian Zoroark fits best on offense teams. Pivots such as Victini and Iron Moth can provide Hisuian Zoroark safe entry for it to wallbreak. Hisuian Zoroark struggles against Dark-types after being locked into Shadow Ball, especially Pursuit users like the Tyranitar formes, making Fighting-types like Buzzwole great partners for their ability to threaten them. They also work well at threatening Normal-types like Chansey and Blissey. In return, Hisuian Zoroark can eliminate physical walls like Clefable and Skarmory, and can notably lure them in thanks to Illusion. Setup sweepers like Booster Energy Iron Moth and Hydreigon can take advantage of Hisuian Zoroark weakening the opposing team's defensive cores by sweeping late-game. Entry hazard setters like Mew and Excadrill can chip Hisuian Zoroark's targets into KO range, something which notably punishes checks with limited longevity like Tapu Fini and the Tyranitar formes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Reuniclus": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Reuniclus can act as a powerful bulky Calm Mind sweeper on balance teams thanks to Magic Guard, which allows it to abuse common defensive staples such as Celesteela, Chansey, and Hippowdon that would typically threaten Calm Mind sweepers like Mega Latias with status or other forms of residual damage. Psyshock is an important STAB move used to break opposing Calm Mind users such as Clefable while still letting Reuniclus directly pressure threats such as Mega Venusaur. Focus Blast is a powerful coverage option that allows Reuniclus to break traditional Psychic-type switch-ins such as Ting-Lu and bulky Excadrill while also being able to lure foes such as Hydreigon and Tyranitar. Thunder is another option that allows Reuniclus to immediately threaten the likes of Slowbro and Celesteela, although it becomes harder to deal with Excadrill, Tyranitar, and Ting-Lu without Focus Blast. Alternatively, Reuniclus can use Stored Power and Acid Armor to become an unbreakable sweeper that threatens to dish out absurd damage as it accrues stat boosts. However, this variant is heavily prone to being shut down by Dark-types such as Tyranitar and Galarian Moltres. Phazers and stat removers such as Whirlwind Ting-Lu and Clear Smog Gastrodon also threaten to halt its progress. Z-crystals, such as Fightinium Z and Electrium Z, are valuable to nuke threats such as Ting-Lu and Slowking, respectively, without having to rely on the mediocre accuracy of Focus Blast and Thunder. Leftovers is another item option, since it gives Reuniclus great longevity when combined with Magic Guard. Colbur Berry is also useful when used with Focus Blast in order to lure Dark-types such as Tyranitar and Bisharp while also letting Reuniclus safely switch out once if it gets caught by their Pursuit. The given EV spread lets Reuniclus outrun Gastrodon in order to hit it hard with a boosted Psyshock before it can use Clear Smog. Reuniclus is heavily pressured by Dark-types like Ting-Lu and Tyranitar, so Fighting-type wallbreakers such as Mienshao are essential, and in return Reuniclus can remove walls such as Slowbro and Buzzwole. Ghost-type switch-ins such as Chansey and Ting-Lu pair nicely with Reuniclus to handle the likes of Aegislash and the rare Blacephalon, while Reuniclus can deal with Fighting-types like Buzzwole and Okidogi for them. Stat removers such as Clear Smog Gastrodon and phazers like Whirlwind Hippowdon can give Reuniclus issues, so partners like Tapu Bulu and Tangrowth can help deal with them while Reuniclus can pressure threats such as Skarmory in return. Strong pivots such as Scizor and Mienshao can also pressure Reuniclus, so speed control options such as Sand Rush Excadrill, Zeraora, and Choice Scarf Rotom-W are solid partners to support it. Supporting walls such as Gastrodon and Slowbro are also useful partners to check them.</p>"
      },
      "Assault Vest": {
        "description": "<p>Assault Vest Reuniclus is meant to act as a strong wall on balance and stall teams to blanket check special attackers such as Iron Moth, Alakazam, and Enamorus, letting it take pressure off of other special walls such as Chansey and Ting-Lu; its offensive capabilities can also be valuable in order to pressure threats that Chansey and Ting-Lu can't, such as Nasty Plot Thundurus and Mega Gardevoir. Psychic Noise is a strong option in order to force the hand of foes like Hippowdon and Slowbro by denying their recovery while still effectively pressuring threats such as Iron Moth. Psyshock is an alternative to better deal damage to Blissey. Knock Off is a good move to force progress against would-be checks such as Choice Band Tyranitar, Aegislash, and Celesteela. Future Sight is an alternative to disrupt the opposing team's momentum by railroading them into a Future Sight switch-in such as Ting-Lu or Celesteela. Focus Blast is important to deal with Tyranitar and Bisharp on the switch while annoying checks like Ting-Lu. Shadow Ball is another option in order to pressure most variants of Aegislash and Mega Gardevoir, which threaten to use Reuniclus as setup fodder. The EV spread is somewhat flexible, as the Special Attack investment can be adjusted to benchmark for threats such as Iron Moth and Slowbro, but 16 Special Attack EVs is a nice starting number, letting Reuniclus 2HKO threats such as Aegislash after Stealth Rock. Regenerator is the ability of choice instead of Magic Guard in order to heal off damage as Reuniclus constantly switches in and out of special attackers. Assault Vest is prone to being worn down quickly by entry hazards and status, so Mega Sableye and a cleric like Chansey or Clefable can give Reuniclus the support it needs to stay healthy in order to check foes that threaten its partners, such as Iron Moth. Knock Off absorbers such as Quagsire, Ting-Lu, and Skarmory are also beneficial, as Reuniclus performs worse in its role as a blanket special wall without its Assault Vest. In return, Reuniclus can stop threats such as Mega Gardevoir and Volcanion for them. Strong physical attackers such as Excadrill and Scizor can be a nuisance for Reuniclus, so partners such as Tangrowth and Skarmory can deal with them while Reuniclus deals with Alakazam and Iron Moth for them in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568189, "username": "Runo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Amoonguss": {
    "sets": {
      "Defensive": {
        "description": "<p>Amoonguss serves as a solid defensive pivot that is capable of scouting and checking a range of offensive foes like Zeraora, Azumarill, and Keldeo, while staying healthy with Regenerator. Heavy-Duty Boots allows Amoonguss to maximize Regenerator recovery, while Black Sludge improves Amoonguss's passive recovery, notably offsetting sand as well as punishing Trick users such as Rotom-W with good prediction. Foul Play allows Amoonguss to inflict massive damage to Pokemon such as Scizor and Excadrill; alternatively, Clear Smog shuts down Calm Mind Clefable and Calm Mind Enamorus while additionally not being blocked by Taunt, easing the matchup versus Calm Mind Tapu Fini. Amoonguss synergizes well with Pokemon such as Tyranitar and Hippowdon that appreciate its useful defensive profile versus threats like Keldeo. Other teammates lacking in recovery such as Excadrill also appreciate Amoonguss's ability to scout certain offensive Pokemon such as Thundurus. Once Amoonguss has successfully used Spore, it becomes quite passive—this can lead to it being exploited by common Steel- and Poison-types such as Celesteela and Iron Moth. Therefore, teammates such as Victini and Tyranitar that can ease the burden of allowing these foes entry make for very effective partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 514772, "username": "sealoo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Mienshao": {
    "sets": {
      "Life Orb": {
        "description": "<p>With Life Orb and Regenerator granting it fantastic power while maintaining its longevity, Mienshao is able to be a consistent offensive threat capable of wearing down defensive options like Skarmory, Rotom-W, and Clefable over time while still immediately threatening common defensive and offensive options such as Ting-Lu, Aegislash, and Excadrill. Knock Off removes Leftovers and Rocky Helmet from Clefable and Skarmory, which assists Mienshao in wearing them down long-term while also ensuring Fighting-immune and -resistant Pokemon like Aegislash and Iron Moth are unable to switch in freely. U-turn can wear down switch-ins such as Mega Venusaur and Hippowdon until they are in 2HKO range of Close Combat, and also allows Mienshao to remain healthy by constantly triggering Regenerator. Fake Out is a fantastic option against offensive teams, allowing Mienshao to rack up chip damage against faster threats like Iron Moth and Zeraora, but Poison Jab is an option to help Mienshao break through Clefable immediately after Leftovers is removed. Mienshao typically finds itself on balance teams that appreciate its longevity with Regenerator as well as on offensive teams that appreciate Mienshao's ability to remove physical walls like Skarmory and Clefable for teammates such as Iron Boulder and Scizor. Given Life Orb Mienshao's subpar speed, teammates such as Zeraora and Greninja are appreciated for their natural Speed and ability to outrun threats such as Alakazam and Iron Moth. Mienshao also enjoys using U-turn to create momentum, so strong wallbreakers such as Aegislash and Iron Moth are appreciated, with the latter being able to bring Mienshao in on Ting-Lu in return. Other pivots such as Rotom-W and Victini can help Mienshao come in multiple times per match, allowing it to better break holes in the opposing team's defensive core. Because Mienshao enjoys pivoting in and out, entry hazard support from the likes of Ting-Lu and Skarmory is mandatory to wear down Mega Venusaur and Hippowdon while also providing defensive support against faster threats such as Iron Moth and Iron Boulder.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Mienshao differentiates itself from other speed control options by outspeeding most faster Pokemon like Zeraora and Choice Scarf Hydreigon while maintaining longevity throughout a match thanks to Regenerator, allowing Mienshao to be less bothered by entry hazards. Knock Off removes Leftovers from the likes of Celesteela and Aegislash as well as Rocky Helmet from Skarmory and Clefable, and it complements Close Combat well. Poison Jab is an option to help Mienshao against Enamorus and Mega Gardevoir, while Stone Edge can be used to OHKO Iron Moth. Triple Axel threatens Amoonguss, but it can be difficult to lock into given the prevalence of Rocky Helmet on defensive options like Skarmory. U-turn allows Mienshao to generate momentum against walls it cannot break, such as Skarmory and Hippowdon. Choice Scarf Mienshao can be utilized on teams that enjoy its longevity, resilience to entry hazards, and ability to outspeed other common speed control options like Zeraora and Choice Scarf Hydreigon. Since Choice Scarf Mienshao can be stopped fairly easily due to its lack of power, hazard support is mandatory alongside it, often provided by Skarmory and Hippowdon; in return, Mienshao can check powerful offensive threats such as Greninja and Alakazam. Choice Scarf Mienshao also forces many switches, so wallbreakers such as Aegislash and Choice Specs Greninja that can threaten common defensive responses to Mienshao like Skarmory and Clefable are important. While Mienshao is able to outspeed most offensive threats, Pokemon like Speed Booster Iron Moth and Sand Rush Excadrill able to outspeed it. Checks to these Pokemon, such as Ting Lu or Rotom-W, are mandatory to ensure teams don't fall apart against these faster threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Bisharp": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Thanks to its typing and access to Sucker Punch, Swords Dance Bisharp cements itself as a powerful wallbreaker and late-game cleaner. Knock Off offers high damage output and item removal, which can aid in chipping down checks that rely on their item. Sucker Punch offers valuable priority to revenge kill faster threats such as Iron Moth and Alakazam, and, after a boost, Bisharp can thwart revenge killing attempts from faster Pokemon like Zeraora and Thundurus. Iron Head is a great complementary STAB move for Fairy-types such as Enamorus and Clefable, which otherwise resist Dark-type attacks, while being Bisharp's best neutral option versus Pokemon such as Mega Venusaur and Buzzwole. An Adamant nature enables Bisharp to threaten an OHKO on Clefable with minimal chip damage. Maximum Speed investment is needed to outspeed Tyranitar, Celesteela, and Scizor and to Speed tie with opposing Bisharp. Swords Dance Bisharp works best on offensive teams with teammates such as Swords Dance Scizor that put pressure on shared checks such as defensive Hippowdon, Skarmory, and Buzzwole. Similarly, Bisharp pairs well with special attackers like Thundurus by pressuring specially defensive walls such as Blissey for them. Bisharp struggles to break through bulky Fighting-types like Okidogi, making partners like Slowbro, Clefable, and Mega Latias beneficial. Future Sight support from Slowbro and Slowking aids Bisharp in whittling down the latter two in range for a boosted Knock Off or Iron Head. Bisharp is an excellent partner for entry hazard setters such as Mew and Excadrill, as Defiant deters Defog from Pokemon like Tapu Fini. In return, Bisharp appreciates hazards chipping down switch-ins like Leftovers Hippowdon. Similarly, Ribombee appreciates Bisharp pressuring common Defoggers like Tapu Fini. In exchange, Sticky Web from Ribombee enables Bisharp to outspeed and significantly damage Pokemon that otherwise outspeed it, such as Excadrill and Keldeo.</p>"
      },
      "Pursuit Trapper": {
        "description": "<p>Bisharp acts as an offensive answer to common Psychic- and Ghost-types in the tier, such as Alakazam and Blacephalon through the combination of Pursuit and Sucker Punch. Knock Off provides strong, super effective damage to targets that may not switch out immediately, including Mega Latias, Skeledirge, and Slowbro, while removing items from walls like Heavy-Duty Boots from Buzzwole and Amoonguss. Sucker Punch provides valuable priority to pick off frail or weakened faster Pokemon such as Alakazam, Gengar, and Hisuian Zoroark. Iron Head is a valuable option to hit Fairy-types like Enamorus and Clefable super effectively and Pokemon like Buzzwole and Tapu Fini neutrally. Investing 184 EVs into Speed enables Bisharp to outspeed fully invested offensive Celesteela prior to Autotomize and Tyranitar. Fighting-types like Okidogi, Mienshao, Buzzwole, and Mega Heracross benefit immensely from Bisharp trapping Ghost- and Psychic-types, and they also appreciate it wearing down defensive Fairy-types like Tapu Fini. Bisharp can also benefit defensive Pokemon like Skarmory, Hippowdon, and Tangrowth by picking off frail wallbreakers such as Iron Moth and Alakazam. Pursuit Bisharp has a noticeable weakness to bulky physical walls in the tier such as Buzzwole, Hippowdon and Skarmory, so pairing it with sufficient offensive pressure from Enamorus, Mega Latias, and Iron Moth to take advantage of these foes is appreciated. Without Swords Dance, Bisharp enables offensive Fighting-types such as Keldeo, Okidogi, and Hawlucha to switch in with relative impunity. Bulky Fighting-resistant partners like Mega Latias, Slowbro, Clefable, Tapu Fini, and Mega Venusaur can help pivot into these offensive threats. Finally, Bisharp can find a place on balanced hazard stack teams alongside Skarmory or Gastrodon. It can dissuade Defog via Defiant and threaten chip damage on Defoggers like Tapu Fini with its STAB moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 391284, "username": "Velcroc"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Mandibuzz": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Courtesy of its unique defensive traits and utility options, Mandibuzz is a niche defensive pivot and wall on teams looking to stave off threats such as Aegislash, Alakazam, and Scizor. However, Mandibuzz’s overall passivity, susceptibility to status, and inability to fit all the moves it needs to often restricts the amount of team structures that it can be justified on; it is generally overshadowed by more reliable choices such as defensive Celesteela and Assault Vest Tangrowth as a result, which have a much easier time handling similar groups of Pokemon while being better at forcing long-term progress with their other options in comparison. STAB Foul Play allows Mandibuzz to threaten various physical attackers, OHKOing Iron Boulder as well as Scizor, Aegislash, and Excadrill after they have boosted with Swords Dance. Alternatively, Knock Off allows Mandibuzz to remove items such as Leftovers and Heavy-Duty Boots from the likes of Slowking and Rotom-W that may try to take advantage of it. Toxic provides Mandibuzz with a crucial way to punish setup Pokemon, such as Nasty Plot Thundurus and Hydreigon, as well as potential defensive Pokemon such as Gastrodon. U-turn provides Mandibuzz with the ability to generate momentum on forced switches, allowing it to also provide entry for frailer teammates such as Iron Moth and Zeraora. On more defensive teams that require it, Defog allows Mandibuzz to remove entry hazards, though it should be noted that Mandibuzz is generally a poor hazard remover that struggles to consistently keep them off against common Stealth Rock users such as Clefable and Hippowdon. Alternatively, Taunt prevents certain Pokemon such as Substitute + Toxic Aegislash, Calm Mind Clefable, and Reuniclus from using Mandibuzz as setup fodder. The given EV spread allows Mandibuzz to survive a +2 Focus Blast from Life Orb Alakazam and outrun Adamant Azumarill, letting Mandibuzz strike the latter with Foul Play before it can be KOed in return after a Belly Drum. 104 Speed EVs can be used to outrun Adamant Aegislash and Tyranitar, though this notably worsens Mandibuzz's ability to take hits from attackers such as Life Orb Mienshao. Mandibuzz heavily values the presence of other forms of passive damage on its team, which it often complements. Pokemon such as Clefable, Skarmory, and Amoonguss not only assist Mandibuzz by absorbing status moves from Hippowdon and Blissey but also can use various moves such as Stealth Rock, Spikes, and Sludge Bomb to inflict residual damage. In return, Mandibuzz is able to cripple defensive pivots that don't mind taking damage from these moves such as Hippowdon, as well as check certain attackers like Aegislash. Faster teammates such as Zeraora and Mega Aerodactyl can help revenge kill the various offensive Pokemon that Mandibuzz may be overwhelmed by, such as Iron Boulder and Keldeo. On more offensive teams, pivots such as Scizor and Iron Moth synergise well with Mandibuzz by removing certain threats such as Enamorus and Mega Gardevoir for it while being able to overwhelm the likes of Celesteela and Ting-Lu in tandem.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Hydreigon": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>With Choice Scarf, Hydreigon becomes a solid revenge killer capable of beating important threats like Iron Moth, Alakazam, and Thundurus with its STAB moves while still providing utility and role compression for its team thanks to Defog and its good defensive profile against defining threats like Greninja, Rotom-W, and Aegislash. Earth Power is specifically used to revenge kill Speed Booster Energy Iron Moth and weakened Excadrill. Fire Blast allows Hydreigon to revenge kill Excadrill and hit targets like Celesteela and Assault Vest Tangrowth hard. Hydreigon can run Defog to act as an emergency entry hazard remover, but its matchups against hazard setters like Tyranitar, Clefable, and Ting-Lu make it unreliable in this role. Focus Blast is coverage to hit Excadrill and Bisharp. U-turn allows it to keep momentum and bring in its teammates safely against switch-ins like Clefable, Tapu Fini, and Celesteela. Choice Scarf Hydreigon fits best on offense and bulky offense teams that appreciate a solid revenge killer against important threats that still maintains some defensive utility thanks to its typing. Speed Booster Energy Iron Boulder, Enamorus, and Choice Scarf Mienshao are some of the few Pokemon that Hydreigon outright fails to outspeed or revenge kill, making partners like Aegislash, Celesteela, and Clefable good options; Celesteela in particular enjoys Hydreigon revenge killing Iron Moth or Tyranitar with Earth Power or Focus Blast, respectively. Fairy-types like Clefable, Tapu Fini, and Mega Gardevoir can easily deal with Hydreigon and use it as setup fodder, making Steel-types like Celesteela, Aegislash, and Excadrill good partners to deal with these Pokemon. Finally, wallbreakers like Life Orb Mienshao and Choice Specs Keldeo appreciate the free entries that Hydreigon provides with U-turn by luring in Pokemon like Skarmory, Assault Vest Tangrowth, and Ting-Lu. These Fighting-types also enjoy Hydreigon revenge killing or forcing out faster Pokemon that may threaten them, such as Alakazam, Mega Latias, and Greninja.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Hydreigon's solid defensive profile and decent Speed tier make it an effective wallbreaker with Nasty Plot, giving it ample opportunities to set up against the likes of Aegislash, Slowbro, and Rotom-W. Dark Pulse, when boosted by Darkinium Z, allows Hydreigon to overwhelm many specially defensive Pokemon after a boost, such as defensive Celesteela barring Protect. Flash Cannon allows Hydreigon to hit Clefable and Enamorus super effectively, potentially OHKOing non-Unaware variants of the former after a boost while potentially OHKOing the latter after Stealth Rock. Alternatively, Earth Power in conjunction with Groundium Z allows Hydreigon to put more immediate pressure onto the likes of Clefable, Tyranitar, and Tapu Fini at +2; it also scores an immediate OHKO on Iron Moth without the need to burn its Z-Crystal. Roost allows Hydreigon to offset status damage from Hippowdon, keeping it healthy enough throughout the game to repeatedly bombard the opposition. However, Substitute in conjunction with Leftovers allows Hydreigon to set up safely on the likes of defensive Pokemon that can't touch it, such as Hippowdon, Slowking, and Skeledirge. Hydreigon fits best on bulkier teams that appreciate its unique mix of defensive utility and offensive firepower. Defensive staples such as Clefable and SubToxic Aegislash are all sufficient at pivoting into Fairy- and Fighting-types that Hydreigon may have a hard time playing around, such as Enamorus, Mienshao, and Buzzwole. The former two also have access to utility moves such as Knock Off that can help wear down some of Hydreigon's checks long-term, like defensive Celesteela, Ting-Lu, and Tapu Fini. Hydreigon is easily revenge killed by faster threats such as Alakazam and Keldeo, making additional defensive partners that can respond to these Pokemon, such as Gastrodon, Assault Vest Tangrowth, and Slowking extremely valuable, letting Hydreigon maximize its wallbreaking efforts despite the presence of these Pokemon. Additionally, pivoting support from the likes of Iron Moth, Scizor, and the aforementioned Slowking can aid Hydreigon in finding safe entry against many of its defensive targets, preventing it from being worn down or threatened by potential coverage options and status that would otherwise be aimed at it, such as Close Combat from Aegislash or Thunder Wave from Rotom-W.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Hydreigon is a potent wallbreaker, being able to threaten common special walls such as Celesteela with its powerful STAB moves and coverage options. It also has more longevity and defensive utility, including a resistance to Pursuit, at the cost of Speed and more consistent STAB moves compared to other special wallbreakers like Iron Moth. Draco Meteor OHKOes threats like Iron Moth and Mega Heracross while doing significant damage to foes such as Galarian Moltres and Mega Sableye. Dark Pulse threatens Slowking and gives Hydreigon a spammable STAB move. Flash Cannon hits Fairy-types like Enamorus, Mega Gardevoir, and Clefable. Fire Blast threatens Celesteela, Tangrowth, and Bisharp, Roost takes advantage of forced switches and lets Hydreigon stay healthy to switch in several times throughout the match, while U-turn lets it pivot out of foes it can struggle against such as Tapu Fini, Azumarill, and Clefable. A Timid nature lets Hydreigon outspeed Excadrill, while Modest gives Hydreigon even more power. Hydreigon struggles to break through Fairy-types such as Tapu Fini, Azumarill, and Clefable, as well as Celesteela if not running Fire Blast, so teammates that can pressure them like Thundurus and Mega Venusaur are helpful. Hydreigon also appreciates pivots such as Victini and Slowking that can safely get it onto the field; Victini can use U-turn to pivot out of switch-ins that Hydreigon threatens like Slowbro and Mega Venusaur, while Slowking can safely pivot it in with Teleport. Knock Off support from the likes of Mega Vensaur, Clefable, and Thundurus is appreciated to help Hydreigon break through Pokemon like Celesteela, Tapu Fini, and Assault Vest Tangrowth. Setup sweepers like Tapu Fini and Galarian Moltres benefit from Hydreigon's longevity and ability to pressure their checks such as Mega Venusaur and Tyranitar, respectively, allowing them to become wincons late-game; fast teammates such as Choice Scarf Enamorus and Keldeo also appreciate Hydreigon for this reason, with it being able to pressure their switch-ins such as Slowking and Assault Vest Tangrowth, which can open the way for them to clean late-game. Hydreigon can also easily be revenge killed by faster Pokemon such as Hawlucha, Alakazam, and Enamorus; Skarmory can deal with Hawlucha while providing Spikes support, and Celesteela can deal with Alakazam and Enamorus.</p>"
      },
      "Offensive Utility": {}
    },
    "credits": {"writtenBy": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 546157, "username": "Iride"}, {"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}, {"user_id": 546157, "username": "Iride"}, {"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Thundurus": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Thundurus is a good setup sweeper and wallbreaker on offensive teams thanks to its great Special Attack and good offensive movepool, which can make it threatening even after one boost. Thunderbolt helps against the plethora of bulky Water- and Flying-types, 2HKOing Celesteela, Tapu Fini, and Slowbro. It can also threaten 2HKOs on bulky foes like Magic Guard Clefable and Mega Sableye at +2. Focus Blast helps against the tier's numerous Dark- and Steel-types, OHKOing Tyranitar and Excadrill and having good odds to OHKO Hydreigon after Stealth Rock. Hidden Power Ice hits Dragon-types that resist Thunderbolt, 2HKOing Mega Altaria, and unboosted Mega Latias at +2, its also more spammable against Grass-types than Focus Blast and can hit Pokemon like Amoonguss super effectively. Psychic is an alternative that helps against Poison- and Fighting-types, 2HKOing foes like Mega Venusaur, Amoonguss, and Buzzwole. Fightinium Z can provide Thundurus a way to OHKO targets like Tyranitar, help break through neutral targets like Gastrodon, and bypass Focus Blast's accuracy. Thundurus can have a hard time breaking through specially defensive Pokemon, notably Mega Latias, which can set up on it even if Thundurus uses Nasty Plot, as well as Tapu Bulu and Mega Venusaur when lacking Hidden Power Ice or Psychic; it pairs well with other offensive Pokemon like Hydreigon and Iron Moth that can threaten these foes. In return, Thundurus can help to deal with their checks like bulky Scizor and Tapu Fini. Thundurus can pair well with pivots like Victini, which can bring it in against Water-types it threatens like Tapu Fini as well as help against Pokemon that wall it like Mega Venusaur. Due to Thundurus's Stealth Rock weakness that can make it harder for it sweep, hazard removers like Tapu Fini, Excadrill, and Hydreigon make for good teammates. Thundurus can also pair well with entry hazard setters like Ting-Lu, Tyranitar, and Skarmory, which can help it to guarantee an OHKO on foes like Hydreigon and Tyranitar. In return, Thundurus can threaten out common hazard removal options like Tapu Fini and Excadrill, and it can even set up on some of them like Tapu Fini. Thundurus is very prone to getting revenge killed by faster foes like Mega Aerodactyl, Alakazam, and Choice Scarf Mienshao, so it pairs well with bulky partners like Slowbro, Celesteela, and Clefable.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Keldeo": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Keldeo is an excellent wallbreaker, utilizing its solid Speed and high Special Attack to break through many defensive Pokemon like Blissey, Jirachi, and Clefable. Hydro Pump is preferred due to its incredible power, giving Keldeo solid odds to 2HKO special walls like Celesteela and Jirachi and guaranteeing an OHKO on offensive threats like Enamorus and Thundurus. Alternatively, Surf can be used for its better accuracy, though it significantly hurts Keldeo's damage output against the aforementioned Pokemon. Secret Sword hits the weaker Defense of special walls like Gastrodon and Chansey while also hitting Pokemon that could pivot into Water-type attacks like Volcanion and Hisuian Goodra. Flip Turn allows Keldeo to maintain momentum and switch out of bad matchups like Slowbro and Mega Latias. Alternatively, Toxic can be used to cripple these checks instead. Hidden Power Ice is used in the final slot to hit many Pokemon that resist its STAB combination like Salamence, Mega Latias, and Mega Altaria for super effective damage. Focus Blast can be used instead to deal massive damage to neutral targets like Rotom-W and Assault Vest Tangrowth. Choice Specs Keldeo invites in Pokemon that resist its STAB combination such as Slowking, Mega Latias, and Amoonguss. It therefore pairs well with teammates that can take advantage of these switch-ins such as Bisharp and Tyranitar for the former two and Iron Moth for the latter. Additionally, it can take advantage of Future Sight support from Slowbro or Slowking to limit the ability of Poison-types like Amoonguss and Mega Venusaur to switch in. Pursuit from Pokemon like Tyranitar and Scizor is also helpful for removing Psychic-type checks to Keldeo like Slowbro and Slowking. Keldeo also appreciates entry hazard support from Pokemon like Excadrill and Ting-Lu to push checks like Tapu Fini and Mega Venusaur into range for Hydro Pump to 2HKO. Finally, Keldeo struggles against faster offensive threats like Mega Latias and thus pairs well with partners like Celesteela that can switch into these threats.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Keldeo is a threatening sweeper, thanks to its ability to break past many defensive cores. Scald is usually chosen because of its high PP and burn chance, allowing Keldeo to slowly wear down checks like Mega Venusaur while crippling physical attackers like Tapu Bulu and Salamence. Scald is especially potent in tandem with Substitute and Leftovers, as it allows Keldeo to set up on many defensive Pokemon that struggle to break its Substitute like Slowking, Celesteela, and Gastrodon lacking Earthquake while dodging status and Leech Seed. Alternatively, Hydro Pump in combination with Waterium Z allows Keldeo to blow past common answers to itself such as Mega Venusaur, Tapu Fini, and Slowbro if they are weakened. When using Hydro Pump, Taunt is used over Substitute to prevent Pokemon like Mega Venusaur and Unaware Clefable from recovering their HP, though Keldeo must be wary of moves like Giga Drain and Moonblast in return. Secret Sword hits the lower Defense of many common checks to special attackers like Blissey and Gastrodon. Calm Mind Keldeo fits best on balance and bulky offense which appreciate its ability to effectively take on defensive team styles. Keldeo is threatened out by faster offensive Pokemon that can hit it super effectively like Alakazam and Mega Latias if it does not have a Substitute up. Therefore, it pairs well with Pokemon that can switch into them like Celesteela and Scizor. They are also valuable for their ability to switch into checks to Keldeo like Tapu Fini and Mega Venusaur. Keldeo pairs well with entry hazard support from Pokemon like Tyranitar, Skarmory, and Excadrill that can push its checks into range of a boosted Hydro Vortex.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf allows Keldeo to act as a decent revenge killer with its strong STAB moves and high Speed. Its decent natural bulk and useful typing also allow it to check Dark-types like Tyranitar and Bisharp while also giving it a Stealth Rock resistance. Hydro Pump is chosen for its high power, OHKOing Pokemon like Victini while giving Keldeo a high chance to KO Choice Scarf Enamorus and Nasty Plot Thundurus after Stealth Rock damage. Secret Sword hits the weaker Defense of common special walls like Blissey and Gastrodon. Flip Turn allows Keldeo to pivot out of bad matchups while maintaining momentum for its team. Toxic is used to status common checks to Keldeo such as Mega Altaria and Mega Latias. Hidden Power Ice can be used as an alternative to allow Keldeo to revenge kill threats such as Dragon Dance Salamence while also doing solid damage against Mega Altaria and Latias. Furthermore, Keldeo itself is threatened by faster Choice Scarf users like Zarude and Hydreigon and therefore requires checks to these Pokemon like Skarmory and Celesteela. Keldeo also appreciates entry hazard setters like Excadrill and Mew that can push Pokemon like Scizor and Enamorus into Hydro Pump range.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 572981, "username": "Aera"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 546157, "username": "Iride"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Greninja": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With nearly perfect coverage and an incredible base Speed stat of 122, Choice Specs Greninja is able to naturally outspeed and threaten most of the tier, including staples such as Mega Latias, Iron Moth, Excadrill, and Alakazam. Hydro Pump and Dark Pulse are Greninja's standard STAB moves, threatening the aforementioned Pokemon as well as many defensive options like Ting-Lu and Slowking. Surf can be utilized for its consistency and higher PP against stall teams but can miss out on OHKOs on notable threats like Buzzwole and Magnezone. Sludge Wave allows Greninja to threaten the Grass- and Fairy types that resist its STAB moves, like Tapu Fini, Mega Venusaur, and Hydrapple. Extrasensory allows Greninja to OHKO Keldeo and can also OHKO Mega Venusaur after slight chip damage. Spikes allows Greninja to support its team while also pressuring special walls that it cannot break through like Chansey and Gastrodon. Ice Beam is also an option that allows Greninja to OHKO Enamorus and Hydreigon. Water Shuriken is a niche option, but it can allow Greninja to check faster threats like Speed Booster Energy Iron Moth, Mega Aerodactyl, and Sand Rush Excadrill if they are at low health. Choice Specs Greninja is typically seen on offensive teams that appreciate its ability to pivot into physical walls and wallbreak for its teammates. Therefore, offensive pivots like Mienshao, Scizor, and Victini are appreciated, as they give Greninja opportunities to launch its attacks against their checks, such as Clefable, Skarmory, and Skeledirge. In return, these physical attackers can threaten special walls like Chansey and Assault Vest Tangrowth for Greninja. Greninja also appreciates entry hazard support from the likes of Clefable or Hippowdon to wear down its checks quicker. Hazard support also frees Greninja to use an attacking move instead of Spikes. Clefable and Hippowdon are also notable because they can check faster threats, such as Choice Scarf Mienshao and Zeraora, for Greninja.</p>"
      },
      "Battle Bond": {
        "description": "<p>Battle Bond allows Greninja to become an incredible late-game cleaner, able to pick up KOs on weakened defensive pieces like Ting-Lu and Clefable and convert a Battle Bond boost into a sweep. Hydro Pump is necessary on Battle Bond Greninja, as its extra power alongside either Life Orb or Waterium Z allows it to activate Battle Bond more easily. Dark Pulse and Sludge Wave are good coverage options alongside Hydro Pump, giving Greninja super effective coverage against most tier staples, such as Slowbro, Tapu Fini, and Hydrapple. Water Shuriken allows Greninja to remove and activate Battle Bond against faster threats, such as Mega Aerodactyl and Booster Energy Speed Iron Moth. Water Shuriken can even remove Sand Rush Excadrill and Hawlucha, which outspeed +1 Greninja. Waterium Z can be used over Life Orb as a way to surprise defensive options like Clefable and Celesteela that would otherwise be able to stomach Life Orb-boosted attacks and retaliate back. Because of its reliance on the one-time Battle Bond boost, Battle Bond Greninja is only seen on hyper offense or offense teams looking for an effective late-game cleaner. Teammates like Iron Moth and Aegislash can help weaken defensive Pokemon like Ting-Lu and Mega Venusaur that may stop a boosted Greninja from completing a sweep. Entry hazard support is also required, so a teammate like lead Excadrill or lead Mew are recommended. These leads are also appreciated for their ability to keep hazards off the field, as Greninja can often be picked off mid-sweep due to Life Orb recoil and sometimes taking hits from bulkier Pokemon that it cannot OHKO, such as Celesteela and Scizor.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Greninja is one of the most potent forms of speed control in the metagame, outpacing fast threats such as +1 Blacephalon and Speed Booster Energy Iron Moth, as well as other Choice Scarf users such as Mienshao and Hydreigon. Dark Pulse provides a more reliable secondary STAB move that 2HKOes Aegislash and Pecharunt. Its flinch chance can also prove useful versus bulkier targets that Greninja would otherwise struggle to 2HKO from full HP, such as Autotomize Celesteela and Mega Gallade. Ice Beam allows Greninja to OHKO Hydrapple as well as revenge kill Enamorus, Hydreigon, and Thundurus more reliably. Sludge Wave deals solid damage to Fairy-types such as Clefable and Tapu Fini, which otherwise take its moves easily. Alternatively, Greninja's ability to force out offensive Pokemon make it an effective user of Spikes, enabling offensive teammates such as Iron Moth and Life Orb Mienshao to wear down their respective checks in Ting-Lu and Slowbro more effectively. Choice Scarf Greninja is best used on offensive teams that appreciate its ability to revenge kill and facilitate momentum against opposing offensive threats that they may be weak to, such as Iron Boulder and Alakazam. Certain defensive pivots such as Clefable, Slowking, and Scizor are useful teammates that can provide Greninja with a failsafe against walls it would otherwise struggle against, such as Rotom-W, Amoonguss, and Celesteela. Additionally, Clefable can set up Stealth Rock to complement Greninja's potential Spikes, whereas Slowking and Scizor can support Greninja with their own pivoting moves in Teleport and U-turn, respectively. Conversely, slower wallbreakers such as Choice Band Tyranitar, Mega Gardevoir, and Swords Dance Tapu Bulu appreciate the safe entry Greninja can provide them by using U-turn on forced switches while covering the offensive Pokemon which they may be forced out by, such as Zeraora and Iron Moth. Greninja also struggles to put adequate pressure onto defensive wincons such as Calm Mind Clefable, Swords Dance + Roost Scizor, and Calm Mind Mega Latias that can use it as setup fodder. Thus, it appreciates being paired with checks to these Pokemon, such as Mold Breaker Excadrill, Skeledirge, and Celesteela.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}, {"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 391284, "username": "Velcroc"}, {"user_id": 589016, "username": "Danbear02"}, {"user_id": 535121, "username": "Pubo"}, {"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Aegislash": {
    "sets": {
      "SubToxic": {
        "description": "<p>Aegislash's valuable defensive profile and immense natural bulk in Shield forme make it perfectly capable of forcing out and setting up on passive Pokemon such as Slowking, Jirachi, and Amoonguss. Substitute allows Aegislash to take advantage of the aforementioned Pokemon's inability to deal sufficient damage to it while also protecting it from potential status moves from these Pokemon; it also allows it to safely land Toxic on incoming defensive walls such as Ting-Lu and Gastrodon, stalling them out in conjunction with King's Shield and recovery from Leftovers. Shadow Ball serves as Aegislash's main STAB move, and alongside Aegislash's naturally high Special Attack stat, is useful for putting pressure onto Toxic-immune Pokemon such as Iron Moth, Excadrill, and Mega Sableye. SubToxic Aegislash fits best on bulky offense and balance teams that appreciate its ability to safely set up on and wear down defensive Pokemon while also making use of its ability to simultaneously check offensive threats such as Mega Latias. Due to Aegislash's fear of status moves, like Scald burns from the likes of Slowking, as well as Spore from Amoonguss, pivots such as Flip Turn Keldeo, U-turn Iron Moth, and Teleport Blissey are helpful to ensure that Aegislash finds safe opportunities against them. Other defensive Pokemon such as Buzzwole, Skarmory, and Clefable can form notable cores with Aegislash; the former two take advantage of Dark- and Ground-types such as Tyranitar and Ting-Lu, while Clefable provides additional support in staving off the likes of Buzzwole, which can potentially nail Aegislash on the switch with Earthquake. Knock Off users such as the aforementioned Clefable and Assault Vest Tangrowth are also helpful, as they can remove items from checks to Aegislash like Leftovers from Celesteela and Heavy-Duty Boots from Iron Moth and Scizor, giving it an easier time breaking through them in the long-run.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance turns Aegislash into a potent wallbreaker and sweeper, using its fantastic neutral coverage and bulk in Shield forme to set up against and break through defensive cores. Close Combat is Aegislash's strongest move overall, and it threatens the many Dark-types that would otherwise resist its Ghost-type STAB moves, like Tyranitar, Hydreigon, and Ting-Lu. Iron Head is an alternative option that still OHKOes the former two after a boost while also 2HKOing Unaware Clefable. Shadow Sneak is a crucial priority move which at +2 can finish off weakened offensive Pokemon that would normally outspeed and take it out, such as Iron Moth and Keldeo, while also being usable to pick off Alakazam without a boost. Ghostium Z is usually preferred to power up STAB Shadow Claw, which, when turned into Never Ending Nightmare, threatens to KO physically defensive Pokemon such as Skarmory and Amoonguss after Swords Dance. However, Air Balloon can be run instead if the team already has a different Z-Move user, and this also allows Aegislash to find free setup opportunities against Ground-types such as Excadrill and Hippowdon, potentially spinblocking the former. Aegislash fits best on more offensive teams that appreciate its defensive utility and ability to break open holes for its teammates early-game. Aegislash also suffers from having terrible bulk in Blade forme, so it is easily revenge killed after attacking, making entry hazard support from the likes of Mew, Ting-Lu, and Tyranitar helpful at chipping down offensive threats like Excadrill into Shadow Sneak range while also pressuring other walls such as Tapu Fini.</p>"
      },
      "Mixed Attacker": {
        "description": "<p>Mixed Aegislash makes the most out of its excellent offensive stats accentuated further by Spell Tag to serve as a terrifying early- or mid-game wallbreaker. Close Combat forms perfect neutral coverage with Shadow Ball, notably 2HKOing Blissey. Shadow Sneak gives Aegislash additional utility in being able to pick off weakened offensive Pokemon such as Alakazam and Blacephalon when needed. King's Shield prevents Aegislash from being picked off by Pursuit users like Tyranitar and lets it scout Choice-locked revenge killers such as Keldeo and Hydreigon. 8 Attack EVs with a Mild nature are necessary for Aegislash to 2HKO Chansey with Close Combat after Stealth Rock. Mixed Aegislash commonly features on more offensive teams that appreciate its instant wallbreaking power combined with its utility. Stealth Rock support from Pokemon such as Tyranitar can be very crucial in helping Aegislash secure 2HKOes against Pokemon such as Tapu Fini and Amoonguss on the switch. While Aegislash can find additional opportunities by pivoting directly into attackers such as Mega Latias, it is often unable to preserve its HP to continue wallbreaking after doing so; as such, pivots like Mienshao are essential to let Aegislash enter the battlefield safely against Pokemon it would like to force out, such as Slowbro. Other setup Pokemon such as Nasty Plot Hydreigon can help overwhelm shared checks to this set, such as Ting-Lu; in return, Hydreigon benefits from Aegislash's ability to keep faster Pokemon like Alakazam in check.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Hawlucha": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Thanks to its good STAB combination and great ability, Hawlucha functions as a powerful Swords Dance sweeper on offense teams. Its above-average Speed also enables it to outspeed all prominent Choice Scarf users like Hydreigon and Mienshao after Unburden. Acrobatics pairs really well with Unburden and is Hawlucha's best move due to its power, notably helping deal with the plethora of Fighting- and Grass-types, 2HKOing Okidogi, Mega Venusaur, and Amoonguss and OHKOing Buzzwole. Close Combat hits Steel-types that resist Acrobatics like Celesteela, Skarmory, and Excadrill, as well as OHKOing Dark-types like Tyranitar, Bisharp, and Hydreigon. Taunt prevents Pokemon like Mega Venusaur, Okidogi, and Mew from using recovery, setup, and status moves, while Roost lets Hawlucha set up in front of defensive Pokemon like Tangrowth, Buzzwole, and Hippowdon. Grassy Seed is used on teams with Tapu Bulu boosting its Defense, while Misty Seed is used on teams with Tapu Fini boosting its Special Defense. The first EV spread lets Hawlucha avoid an OHKO from defensive Clefable's Moonblast and should be run alongside Grassy Seed. The second EV spread is used to let it survive a Moonblast from defensive Clefable after Misty Seed is activated. 124 Speed EVs are used to outspeed Sand Rush Excadrill. Hawlucha functions as a do-or-die sweeper on offense teams. Tapu Bulu and Tapu Fini are mandatory teammates for Hawlucha, as they can allow it to immediately use up its item and active Unburden; offensive variants are perferred when using Hawlucha, helping to threaten targets like Slowbro and Mega Sableye respectively. Hawlucha can have a hard time breaking through Fairy- and Ghost-types like Tapu Fini, Mega Altaria, and Mega Sableye, as well as Skeledirge, which deserves a special mention because of its typing, ability, and good physical bulk. Hawlucha pairs well with general offensive partners like Thundurus, Celesteela, and Enamorus, which can help threaten the aforementioned foes out and can also help against generally physically bulky Pokemon like Slowbro; in return, Hawlucha can help to break Mega Venusaur, Chansey, and Blissey. Hawlucha appreciates entry hazard setters like Ting-Lu and Tyranitar and notably dedicated hyper offense leads like Excadrill, which can also help keep off Stealth Rock. Entry hazard chip which can be useful to help 2HKO bulky Scizor and Mega Altaria.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Zygarde-10%": {
    "sets": {
      "Choice Band": {
        "description": "<p>Zygarde-10% finds a niche as a Ground-type wallbreaker with a strong matchup into typical responses to Ground-type Pokemon. Despite its frailty and the immense competition it faces from Sand Rush Excadrill, Thousand Arrows allows Zygarde-10% to differentiate itself by allowing it to overwhelm common responses to Ground-types such as Skarmory, Celesteela, and Rotom-W that its competition (such as Excadrill) struggles with. Extreme Speed offers priority that lets Zygarde revenge kill faster offensive threats such as Battle Bond Greninja and Speed Booster Energy Iron Moth. Outrage has solid neutral coverage with Thousand Arrows and is a valuable STAB move to hit walls like Buzzwole and Mega Venusaur. Toxic allows Zygarde-10% to punish and potentially overwhelm physically defensive walls like Rocky Helmet Tangrowth, Slowbro, and Buzzwole. A Jolly nature is crucial for allowing Zygarde-10% to outspeed important metagame threats like Mega Latias, non-Speed Booster Energy Iron Moth, and Thundurus. Zygarde-10% finds itself on offensive teams that appreciate its wallbreaking capabilities against common defensive cores like Celesteela and Rotom-W. These teams can further support Zygarde-10%, which partners well with offensive pivots such as Scizor, Slowbro, and Greninja that can help Zygarde-10% hit the field. In addition, Slowbro provides Future Sight support, which can be valuable in breaking through answers such as Buzzwole. In return, Zygarde-10% pressures walls that give these Pokemon issues such as Rotom-W and Celesteela. Grass-types like Tapu Bulu and Tangrowth are the most consistent pivots into Zygarde-10% and, as such, it appreciates support from Pokemon that force Grass-types out such as Victini, Iron Moth, Mega Venusaur, and Celesteela. Physically defensive walls such as Hippowdon, Buzzwole, Ting-Lu, and Slowbro can withstand hits from Zygarde-10% and can either deal hefty damage or inflict status. Special attackers like Mixed Aegislash, Greninja, and Iron Moth can exploit these physically defensive walls, and in exchange, they appreciate Zygarde-10% dishing out massive damage to specially defensive walls like Chansey, Blissey, and Celesteela. As most of Zygarde-10%'s checks are vulnerable to entry hazards, entry hazard support from Excadrill, Skarmory, and Tyranitar allows Zygarde-10% to achieve favorable damage rolls on its would-be answers like Buzzwole and Tangrowth. In exchange, Zygarde-10% pressures hazard removal from the likes of Excadrill and Rotom-W, ensuring that hazards stay up in the long term.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 391284, "username": "Velcroc"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Volcanion": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Volcanion's unique Water / Fire typing allows it to be a very threatening wallbreaker on balance and bulky offense teams with strong defensive utility, capable of checking threats such as Tapu Fini, Scizor, and Clefable while also pressuring the likes of Buzzwole, Skarmory, and Celesteela. Steam Eruption, in addition to being a powerful STAB option, is also very useful at spreading burns in order to weaken potential checks such as Mega Venusaur and Slowking. Sludge Bomb is used in order to break Clefable and Tapu Fini while also heavily damaging switch-ins such as Mega Latias and Hydreigon with a chance to poison them. Alternatively, Hidden Power Grass can be used in order to combat Slowbro and Gastrodon that would otherwise easily switch into Volcanion. Volcanion also offers some utility with Defog, being able to use its offensive capabilities to force out common entry hazard setters such as Tyranitar, Skarmory, and Hippowdon and clear hazards as they flee. Taunt is another utility option that allows Volcanion to shut down the likes of Calm Mind Clefable and Tapu Fini more efficiently while also preventing Slowking and Slowbro from using Teleport and Slack Off. Alternatively, Volcanion can forego its utility options in exchange for Earth Power in order to target threats such as Okidogi and other Volcanion. Heavy-Duty Boots is Volcanion's main item of choice in order to avoid damage from entry hazards, but it can also run Shuca Berry on more offensive playstyles in order to lure threats attempting to use Ground-type attacks against it, such as Excadrill and Enamorus. Wallbreakers like Hydreigon make for a solid offensive core with Volcanion, as Volcanion can switch into and pressure their checks in Clefable while they handle its checks in Slowking. Physical attackers such as Mega Aerodactyl also enjoy Volcanion's Water-type immunity, allowing it to absorb Scald from the likes of Slowbro, Tapu Fini, and Gastrodon. Volcanion is capable of pressuring a ton of offensive threats such as Mega Aerodactyl and Zeraora, as they are unable to switch into it properly, but unfortunately the inverse can also be said for it, since its mediocre Speed leaves it outpaced by the aforementioned threats and others, such as Iron Moth. To mitigate this, speed control options such as Choice Scarf Hydreigon and Enamorus are vital in order to force them out more easily. In return, Volcanion can provide a switch-in to Tapu Fini for them while also pressuring defensive checks such as Amoonguss and Celesteela. Volcanion hates dealing with offensive Ground-types such as Excadrill due to its inability to switch into them, so partners like Skarmory are very useful at keeping them at bay. In return, Volcanion can handle threats that would try to take advantage of Skarmory such as Aegislash and Tapu Fini. Electric-types such as Thundurus and Zeraora are also incredibly annoying for Volcanion, so partners such as Gastrodon, Mega Latias, Mega Venusaur, and Tangrowth are good at handling them. In return, Volcanion can pressure threats such as Amoonguss and Celesteela for them. Although Volcanion can beat Rock-types in theory, Tyranitar and Mega Aerodactyl can pressure it really easily if on the field. Partners such as Scizor are great at forcing them out, and in return, Volcanion can deal with Iron Defense Skarmory and Amoonguss for them. Dragon-type wallbreakers such as Hydreigon and Mega Latias can also take advantage of Volcanion by merit of resisting both its STAB moves. Partners such as Celesteela, Clefable, and Tyranitar can effectively force them out for Volcanion.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568189, "username": "Runo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ribombee": {
    "sets": {
      "Sticky Web": {
        "description": "<p>Ribombee is the fastest and most consistent Sticky Web setter in the tier, able to outspeed other leads like Mew to ensure that Sticky Web will go up before Mew can use Taunt. Stun Spore allows Ribombee to paralyze faster threats like Speed Booster Energy Iron Moth and Choice Scarf Enamorus while also ruining setup sweepers that may use it as setup fodder. Tailwind is a great option for Ribombee if it will be immediately KOed after setting Sticky Web, as it allows most partners to outspeed the entire metagame after Sticky Web. U-turn is another option that can scout for switches and create setup opportunities for teammates. While niche, Shield Dust is more relevant than any of Ribombee's other abilities, allowing it to avoid being inflicted with poison or burn from moves like Sludge Bomb and Flare Blitz, giving it another turn to use Stun Spore or Tailwind. Focus Sash allows Ribombee to survive any hit from a faster attacker to ensure Sticky Web goes up. Ribombee works only as a lead on Sticky Web offense teams. Teammates like Mienshao appreciate Sticky Web, as it allows them to outspeed and OHKO threats like Keldeo before they get a chance to retaliate. Defiant users like Bisharp are also useful to punish attempts to use Defog to remove Sticky Web. Ribombee struggles to set entry hazards against Excadrill and Mega Aerodactyl due to Rapid Spin and Dual Wingbeat respectively, so checks to these threats like Celesteela are appreciated. Air Balloon Aegislash is recommended with Ribombee as well, as it can help prevent Excadrill from using Rapid Spin to clear Sticky Web. The turn Ribombee uses to set Sticky Web can be exploited by threats like Swords Dance Scizor and Aegislash, so offensive partners that can handle these threats like Victini and Greninja are recommended to prevent these threats from sweeping.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Tapu Bulu": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Tapu Bulu's strong offenses, access to Swords Dance, and Grassy Terrain-boosted STAB attacks make it a potent physical wallbreaker, being able to tear through prominent Ground- and Water-types in the tier such as Ting-Lu, Slowbro, and Gastrodon. On top of this, Tapu Bulu's solid defensive profile also allows it to serve as an effective check to certain offensive threats such as Thundurus, Zeraora, and Keldeo, while Grassy Surge allows it to support its team with additional passive recovery, as well as lessening the damage of Earthquake, a common attacking move seen on Pokemon such as Excadrill, Mega Aerodactyl, and Ting-Lu. However, Tapu Bulu's common weaknesses to attacking types such as Fire, Flying, and Steel, mediocre Speed tier, and heavy reliance on prediction to get past certain walls such as Mega Venusaur and Celesteela tend to limit its consistency in the long run. In addition, Grassy Terrain, while beneficial, can also backfire due to it healing opposing grounded Pokemon as well. Stone Edge gives Tapu Bulu a way to hit Fire- and Flying-types such as Victini and Thundurus; when powered up by Rockium Z, it turns into a perfectly accurate move that also deals enormous damage to natural targets such as Celesteela, Amoonguss, and Mega Latias at +2, letting it break through them. High Horsepower gives Tapu Bulu a way to hit Steel-types such as Aegislash, Excadrill, and Bisharp super effectively. The given EV spread maximizes Tapu Bulu's bulk, whilst allowing it to outspeed Adamant Tyranitar and Modest Celesteela. Alternatively, a spread of 252 Atk / 4 SpD / 252 Spe can be used to maximize Tapu Bulu's offensive potential, most notably ensuring a guaranteed OHKO on maximum HP Aegislash with High Horsepower and defensive Celesteela and Amoonguss with Contential Crush at +2. By virtue of its defensive qualities, Tapu Bulu is best suited to defensive teams which can capitalize on its long-term prowess. Pokemon such as Aegislash, Excadrill, and Slowking each appreciate the residual effects brought on by Grassy Terrain, which can allow them to play more aggressively; in return, these Pokemon can help pivot into several of Tapu Bulu's answers, such as Celesteela and Mega Venusaur, while Slowking also helps check Fire-types such as Victini. Additionally, other defensive Pokemon such as Ting-Lu, Slowbro, Clefable, and Hippowdon can also benefit from Grassy Surge while supporting Tapu Bulu's team against offensive threats such as Iron Moth, in addition to providing entry hazards and pivoting support. However, it should be noted that Ting-Lu and Hippowdon will often need to run alternative Ground-type STAB options to remain effective under Grassy Terrain. Faster teammates such as Choice Scarf Hydreigon, Zeraora, and Choice Scarf Mienshao can assist in revenge killing Tapu Bulu’s checks, and they benefit from Tapu Bulu's ability to help them overwhelm pivots such as Celesteela, Tangrowth, and Amoonguss.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Tapu Fini": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Tapu Fini's solid typing, good bulk, and vast utility make it an excellent defensive presence in the metagame, holding the tier together against numerous Pokemon, such as Greninja and Keldeo. Misty Surge makes it excellent at regaining momentum against status users, such as Clefable and Blissey, allowing setup teammates like Iron Boulder to more freely set up against these Pokemon. Scald provides Tapu Fini with a STAB move that can burn the likes of Celesteela and Tapu Bulu attempting to take advantage of it while also letting it apply pressure to targets such as Iron Moth and Victini. Alternatively, Nature's Madness allows Tapu Fini to hit defensive Pokemon it would otherwise be unable to punish for switching in, Mega Venusaur and Amoonguss. Defog keeps entry hazards off against walls that its typing enables it to match up well against, like Skarmory. Taunt, besides preventing the aforementioned Pokemon from relaying hazards in front of Tapu Fini, also denies healing and setup attempts from Pokemon like Clefable and Blissey, particularly when used in combination with Nature's Madness to more quickly wear down said targets. 96 Speed EVs ensure that Tapu Fini outruns Adamant Scizor, letting it shut down potential Swords Dance attempts against it, while the rest is put into Defense to maximize its walling capabilities against Pokemon such as Buzzwole and Excadrill. Defog Tapu Fini fits onto many bulky offense and balance teams for its valuable role compression. Tapu Fini is prone to being overwhelmed and lacks any form of healing outside of Leftovers, which makes other defensive Pokemon that can support it against the aforementioned threats extremely valuable; these include Pokemon such as Skarmory and Assault Vest Tangrowth. Wish users such as Jirachi and Blissey are also highly noticeable in this regard for their ability to keep Tapu Fini healthy throughout the game in addition to synergizing with it immensely by handling special attackers that can threaten Tapu Fini, such as Alakazam. Other defensive Pokemon like Buzzwole and Mega Aggron benefit from Tapu Fini's ability to clear hazards, allowing them to more safely leverage their HP to check the threats they are meant to deal with. Finally, powerful offensive Pokemon that appreciate Misty Terrain's effects, like Bisharp and Choice Band Tyranitar, also enjoy being able to fall back on Tapu Fini to deal with offensive threats like Keldeo and clear hazards, improving their potential to wallbreak throughout the game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Tapu Fini can outspeed and revenge kill common offensive Pokemon such as Greninja and Alakazam. Additionally, Tapu Fini can still uphold its natural defensive qualities and bulk to switch into other threats like Victini and Greninja when needed, before outspeeding and threatening them too, while also providing Defog support. Hydro Pump is Tapu Fini's strongest move to hit Iron Moth and Excadrill with, OHKOing both after Stealth Rock damage, but Surf can be used instead if accuracy is a concern despite having less power. Trick allows Tapu Fini to cripple an incoming wall that would normally try to take advantage of it, like Blissey and Amoonguss. Defog allows Tapu Fini to clear entry hazards for its team in a pinch, especially once it has Tricked away its Choice Scarf, but if Defog is already found on another Pokemon, Taunt and Nature's Madness are options that can be used instead to further mess with most defensive Pokemon, chipping them down quickly or denying healing attempts. The given EV spread ensures that Tapu Fini survives a +2 Acrobatics from Hawlucha and outspeeds Mega Aerodactyl. Tapu Fini fits best on offensive teams that appreciate its defensive utility and role compression. Wallbreakers that benefit from its ability to check faster offensive threats like Keldeo and Mienshao include Pokemon such as Choice Band Tyranitar and Mega Heracross, with each additionally benefiting from Misty Terrain's status immunity. On the other hand, Tapu Fini's tendency to lure in defensive Pokemon that it can Trick its Choice Scarf over to, like Blissey and Chansey, can be exploited by Pokemon that normally struggle to break past them, such as Iron Moth and Nasty Plot Hydreigon. As Tapu Fini can struggle to check threats like Greninja and Victini in the long run, other Pokemon like Mega Venusaur and Galarian Moltres can help provide extra insurance against these Pokemon.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Tapu Fini's combination of high bulk and Taunt allows it to set up on numerous defensive staples such as Buzzwole, Clefable, and Blissey, making it very adept at punishing the use of common walls and tanks. While Scald cannot burn grounded foes while Misty Terrain is active, it can still burn certain foes like Enamorus and Celesteela. While weak, Draining Kiss provides a massive amount of recovery to Tapu Fini, letting it remain healthy as it sweeps through opposing teams. The given EV spread provides enough Special Attack for Tapu Fini to OHKO Excadrill with +1 Scald and lets it outspeed Adamant Bisharp, with the rest maximizing its physical bulk. Tapu Fini best fits on bulky offense and balance teams that want an end-game wincon, supporting wallbreaking teammates such as Choice Band Tyranitar. It's overwhelmed by fast offensive foes that can hit it super effectively such as Thundurus and Iron Moth. Teammates like Mega Venusaur can check Thundurus while Iron Moth checks opposing Iron Moth. Mega Venusaur is another troublesome matchup, and it can be threatened by teammates such as Mega Latias.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}, {"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 511181, "username": "Rose"}, {"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Buzzwole": {
    "sets": {
      "Defensive": {
        "description": "<p>Buzzwole is a strong tank with the ability to check many of the physical attackers in the tier such as Tyranitar, Excadrill, and Bisharp. Buzzwole sets itself apart from other physical walls with its high Attack stat and strong moves, allowing it to exert immediate pressure against the opposing team. Close Combat is Buzzwole's STAB move of choice, as its high Base Power is preferred over alternatives like Drain Punch against threats such as Scizor. Earthquake is a solid coverage move that allows Buzzwole to threaten Iron Moth, which would otherwise be able to switch in for free. The final moveslot offers a bit more flexibility, with Toxic being used the most in order to status common switch-ins such as Mega Latias, Hippowdon, and Tangrowth. Alternatively, Thunder Punch can be utilized for more immediate pressure against Water- and Flying-types such as Tapu Fini and Enamorus. Finally, Bulk Up can be used on defensive teams to allow Buzzwole to act as a wincon. The Defense boosts can also help in one-on-one situations against other Attack-boosting threats such as Scizor. The Attack EVs ensure Buzzwole 2HKOs defensive Celesteela with Close Combat after Stealth Rock damage, while 112 Speed EVs allow Buzzwole to outspeed Adamant Tyranitar. This Speed benchmark is largely trivial, however, and can be adjusted to account for other specific threats such as Bisharp and Scizor. Buzzwole’s ability to switch into Ground- and Fighting-type moves is valued by Pokemon such as Excadrill and Tyranitar, and its resistance to Bug and Dark is greatly appreciated by Psychic-types such as Mega Latias and Slowking. Due to its poor special bulk, Buzzwole can quickly be overwhelmed by strong special attackers and Future Sight. Therefore, it appreciates specially defensive teammates such as Blissey and Hippowdon. Physical wallbreakers are often paired with Future Sight support; therefore, Pokemon such as Celesteela and Aegislash can prove helpful because of their high Defense paired with a Psychic resistance. Pokemon that can cover Buzzwole's weaknesses to Flying, Fairy, Fire, and Psychic are also greatly appreciated. As such, Mega Latias, Clefable, and Tyranitar are natural partners.</p>"
      },
      "Offensive": {
        "description": "<p>Offensive Buzzwole combines its naturally high Attack stat with its colorful coverage options to serve as a powerful wallbreaker, and unlike other Fighting-types like Mega Gallade, it does this while retaining great defensive utility between its stellar physical bulk and resistances. This allows it to consistently find opportunities against opposing offensive threats such as Mienshao and Tyranitar. Earthquake provides solid neutral coverage with Close Combat, OHKOing Iron Moth while also 2HKOing Aegislash and Skeledirge. Poison Jab can chunk Clefable and Tapu Fini attempting to switch in while hitting Enamorus and Azumarill super effectively. Roost provides Buzzwole with a form of reliable recovery, allowing it to leverage its defensive profile against potential threats such as Scizor long-term. Fist Plate strengthens Close Combat's power, allowing it to consistently 2HKO defensive Celesteela and Gastrodon. Alternatively, Life Orb also boosts the power of its coverage moves at the cost of sustaining recoil damage, notably allowing it to 2HKO physically defensive Clefable with Poison Jab. 188 Speed EVs ensure Buzzwole outruns maximum Speed Aegislash and Magnezone. Offensive Buzzwole fits best on bulkier teams in need of its firepower and natural defensive traits against potential threats such as Scizor and Tapu Bulu. Defensive Water-types such as Rotom-W, Slowking, and Tapu Fini each possess excellent synergy with Buzzwole; Buzzwole provides them with much needed security and a point of entry against the Dark- and Fighting-types, such as Mienshao, Tyranitar, and Zarude, which are capable of threatening or wearing them down; Rotom-W and Tapu Fini provide crucial hazard control to ensure Buzzwole's wallbreaking prowess isn't limited by entry hazards, whereas Slowking provides Future Sight support to help Buzzwole break down certain defensive Pokemon that would otherwise stop it, such as Mega Venusaur and Amoonguss. Entry hazard setters such as Ting-Lu, Skarmory, and Clefable can force additional chip damage onto physically defensive walls such as Tangrowth. Ting-Lu and Clefable also help play around dangerous Psychic-types such as Mega Latias and Reuniclus, which are capable of using Buzzwole as setup fodder. Additionally, Clefable can use Knock Off to remove items like Rocky Helmet from Skarmory and Heavy-Duty Boots from Slowking, making it easier for Buzzwole to break past these Pokemon as well. Lastly, Buzzwole also necessitates faster teammates in order to revenge kill the myriad of threats that are capable of outspeeding and forcing it out, such as Iron Moth, Alakazam, and Greninja. Teammates such as Iron Boulder, Zeraora, Mega Aerodactyl, and Choice Scarf Enamorus are all good examples that can assist in this aspect.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 572981, "username": "Aera"}, {"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Iride"}, {"user_id": 535121, "username": "Pubo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Celesteela": {
    "sets": {
      "Defensive": {
        "description": "<p>Celesteela makes the most of its typing, utility options, and great natural bulk on both sides to serve as a fantastic wall, capable of holding teams together against threats such as Aegislash, Excadrill, and Mega Latias. Leech Seed serves as Celesteela's main recovery move, capitalizing on the many switches it forces while also being able to deter incoming walls such as Rotom-W and Ting-Lu, which may otherwise try and take advantage of it. Heavy Slam acts as Celesteela's main STAB attack; with its massive weight, Celesteela threatens to OHKO Iron Boulder, Mega Aerodactyl, and Alakazam, on top of being able to 2HKO physically defensive Clefable. On the other hand, Air Slash deals more damage to Grass- and Fighting-types such as Amoonguss, Mega Venusaur, and Keldeo, preventing the former two from switching in to absorb its Leech Seed and deterring the latter from trying to use it as setup fodder. Protect allows Celesteela to accrue recovery from Leech Seed and Leftovers as well as scout the intentions of Choice item users such as Tyranitar. However, Toxic is also a relevant option, assisting Celesteela against Regenerator pivots such as Assault Vest Tangrowth, Slowbro, and Slowking. Flamethrower OHKOes most Scizor sets and provides a coverage option for other Steel-types such as Aegislash, Skarmory, and opposing Celesteela. Alternatively, at the cost of its ability to hit several of the aforementioned Pokemon, Earthquake gives Celesteela a more reliable option to hit Iron Moth and Magnezone, preventing them from KOing it in return. Maximum HP and Special Defense investment give Celesteela the best odds at surviving attacks from the likes of Alakazam, Greninja, and Aegislash. Alternatively, 96 Defense EVs in conjunction with a Relaxed nature improve Celesteela's ability to take on physical attackers, most notably avoiding a 2HKO from Choice Band Iron Boulder's Mighty Cleave after Leftovers recovery. Defensive Celesteela fits best on bulky offense and balance teams that appreciate its lack of passivity over Skarmory, being comfortable with falling back on it without losing momentum against threats such as Mega Latias and Hydreigon. Walls such as Amoonguss, Hippowdon, and Slowking appreciate Celesteela's ability to help cover several of the aforementioned Dragon-, Psychic-, and Grass-type threats. In return, they can help supplement Celesteela's ability to spread chip damage through the use of entry hazards or status moves as well as answer threats that may overwhelm it, such as Swords Dance Iron Boulder and Keldeo. On the other hand, faster revenge killers such as Zeraora, Choice Scarf Mienshao, and Sand Rush Excadrill are similarly effective at keeping these Pokemon, as well as other setup sweepers such as Galarian Moltres, in check; the former two are also able to assist Celesteela in breaking down walls with Knock Off, whereas Excadrill can utilize Rapid Spin to ensure it isn't being worn down by Stealth Rock. Lastly, Celesteela is very reliant on Leftovers for recovery; the likes of Clefable, Tapu Fini, and Alakazam can opt to exploit this by luring it with Knock Off; thus, Knock Off absorbers such as Mega Venusaur and Scizor can prove vital while attempting to scout these Pokemon.</p>"
      },
      "Autotomize Sweeper": {
        "description": "<p>Celesteela's high Special Attack, good movepool, and snowballing potential with Beast Boost make it a great sweeper when using Autotomize to shore up its poor Speed. Its naturally great bulk and Steel/Flying typing afford it setup opportunities against foes like Scizor and Excadrill, as well as the ability to easily muscle past them. Meteor Beam combined with Power Herb lets Celesteela boost its Special Attack without needing a KO. Given that it's Celesteela's strongest attack, in some situations it should be saved to instead target a foe Celesteela would otherwise have trouble breaking through like Skeledirge or Victini. Air Slash serves as a spammable STAB attack, 2HKOing most of the tier at +1, though it can OHKO many Bug- and Fighting-types like Buzzwole and Mienshao unboosted. Its chance to flinch its foes can also come in handy against special walls like Gastrodon and Slowking, which could otherwise stop Celesteela's sweep. Fire Blast primarily targets Steel-types, OHKOing foes like Scizor unboosted and opposing Celesteela after a few boosts. Celesteela best fits on offense teams looking for a cleaner, forming a potent offensive combination with other sweepers like Bisharp. Alternatively, if the opportunity arises, it can instead be used as a mid-game wallbreaker and have a teammate clean using the holes it creates. However, it has no way to break through certain special walls like Blissey and Chansey on its own, making physical attackers like Bisharp and Mienshao necessary. While they share some overlapping counterplay, special sweepers like Booster Energy Iron Moth and Galarian Moltres also appreciate Celesteela's support for similar reasons, and they can still support each other by weakening some of each other's shared checks, such as Slowbro, Slowking, and Latias. Entry hazard setters like Lead Mew and Excadrill are crucial for their ability to weaken Celesteela's checks, making it harder for foes like Gastrodon and Tapu Fini to remain healthy enough to check Celesteela.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Iride"}, {"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Blacephalon": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Blacephalon is an incredibly frail but incredibly difficult Pokemon to switch into, as most defensive options get 2HKOed, and if it's kept healthy, it can quickly snowball out of control due to Beast Boost and its ability to threaten defensive targets like Celesteela, Mega Venusaur, and Slowking. Fire Blast is preferred despite its inaccuracy, as it’s a very strong attack capable of OHKOing Hydrapple and 2HKOing Hydreigon, while Flamethrower is reasonably weaker (RC) but is more reliable against most Pokemon. Hidden Power Grass deals with Gastrodon while being able to potentially 2HKO Pursuit Tyranitar, which would revenge kill it otherwise. Psychic takes out Pokemon like Iron Moth as well as being able to remove Mega Venusaur more easily. Overheat can be used alongside Flamethrower to serve as a hard-hitting attack, almost always OHKOing Clefable as well as Mega Venusaur after Stealth Rock. Trick is essential to cripple walls like Ting-Lu and Blissey, which would otherwise take Blacephalon's attacks with ease. Blacephalon fits best on more offensive teams that appreciate its ability to break holes in almost any defensive Pokemon for late-game wincons like Swords Dance Scizor, Alakazam, and Swords Dance Iron Boulder to sweep. Blacephalon is very frail and struggles to take even resisted attacks, so pivots like Rotom-W and Slowking are required to get Blacephalon into the field to break the opposing team. Rotom-W in particular can also remove entry hazards for Blacephalon, as its Stealth Rock weakness can wear it down extremely quickly. Even though it can deal massive damage to most Pokemon, it still can’t touch Pokemon like defensive Tyranitar and Blissey without sacrificing its Choice Specs due to their massive special bulk, so teammates like Mienshao and Buzzwole are necessary to deal with these. Blacephalon also struggles with revenge killers and faster threats like Iron Boulder, Greninja, Zeraora, and Pokémon with priority moves like Bisharp and Azumarill, so checks to these Pokemon like Slowking, Assault Vest Tangrowth, and Celesteela are very helpful for Blacephalon to have a defensive backbone against more offensive teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 591294, "username": "Lightniong"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Iride"}, {"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Zeraora": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>A blistering Speed tier, above-average offenses, and potent offensive typing make Zeraora an effective pivot and revenge killer in the tier, threatening important targets in Thundurus, Enamorus and Alakazam. Additionally, Zeraora packs significant utility options in Knock Off and Volt Switch that can capitalize on the aforementioned traits and even allow it to make long-term progress against a majority of defensive targets, such as Ting-Lu and Rotom-W. Toxic is usually Zeraora's preferred move in the last slot, allowing it to stifle specific Pokemon that are otherwise able to heal off and withstand its attacks, such as Mega Latias and Hippowdon. Alternatively, Zeraora can also make use of Close Combat to pose an immediate threat to most Steel- and Dark-type Pokemon, such as Excadrill, Hydreigon, and Tyranitar. On the other hand, Grass Knot is an alternative that puts immediate pressure on Hippowdon and Quagsire, though it becomes more difficult for Zeraora to break through several of the aforementioned targets in Mega Latias, Hydreigon, and Excadrill. Heavy-Duty Boots ensures Zeraora isn't hampered by entry hazards. Zeraora fits best on bulkier teams that appreciate its proficiency in revenge killing offensive threats while possessing added longevity and the ability to generate momentum. Defensive staples such as Slowking appreciate Zeraora's ability to force out Pokemon that may threaten them, like Life Orb Mienshao. In return, Slowking can use Future Sight to pressure Pokemon that would otherwise be able to stave off Zeraora's attacks, such as Buzzwole and Mega Venusaur. Similarly, slower wallbreakers like Choice Specs Enamorus, Nasty Plot Hydreigon, and Choice Band Tyranitar appreciate Zeraora's ability to scare out faster Pokemon while also benefitting from the safe switch-in opportunities provided by Volt Switch. While Zeraora's offensive matchups are impressive, it can struggle to contain many offensive threats that are capable of boosting their Speed, such as Sand Rush Excadrill, Dragon Dance Salamence, and Autotomize Celesteela. Thus, specific defensive checks to these Pokemon such as defensive Celesteela, Slowbro, and Thunder Wave Clefable are highly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Enamorus": {
    "sets": {
      "Calm Mind Sweeper": {
        "description": "<p>Enamorus is a potent sweeper, capable of beating common defensive staples in Skarmory, Mega Sableye, and Clefable. Its expansive coverage in Earth Power and Mystical Fire allows it to hit every Steel-type in the tier, such as Celesteela, Skarmory, and Scizor, for super effective damage, securing either an OHKO or a 2HKO on them with a Calm Mind boost. It also allows Enamorus to work around other Fairy-resistant foes such as Skeledirge and Iron Moth as well as offensive checks in Hisuian Arcanine and Victini, while its Speed tier allows it to outspeed and OHKO Mienshao. Taunt is an option to potentially beat and deny recovery from status users like Clefable, Hippowdon, and Chansey that try to slow down or stall Enamorus. Similarly, Iron Moth enjoys many of its checks being removed, particularly Tyranitar and Latias. However, Enamorus's frailty and lack of immediate power makes it difficult for it to break past checks such as Mega Venusaur and Celesteela, which threaten to OHKO it with Sludge Bomb and Heavy Slam, respectively, and aren't OHKOed after a Calm Mind boost. Similarly, Chansey can use Toxic and Seismic Toss to take advantage of Enamorus's lack of longevity. This means it appreciates partners such as Tyranitar and Bisharp, which are capable of Pursuit trapping special walls like Chansey, as well as Victini, which can break past Celesteela as well as provide pivoting to bring Enamorus in safely. Its Speed tier also means it is pressured by faster threats such as Iron Moth and Greninja. This means it enjoys speed control from partners such as Alakazam and Choice Scarf Hydreigon, which are able to outspeed its offensive checks. To compensate for its relative frailty, it also enjoys slow pivots to bring it in safely, such as Slowbro, Slowking, and Scizor, and in return it provides an offensive check to the Dark-types they are threatened by, such as Tyranitar, Bisharp, and Hydreigon.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs allows Enamorus to be more immediately fearsome against bulky teams, now threatening 2HKOs on most Fairy-resistant foes without the need for a turn of setup. In addition to Earth Power and Mystical Fire, Superpower allows it to threaten a 3HKO on Chansey. This also allows Enamorus to potentially snowball through weakened teams once faster foes like Alakazam have been removed. Alternatively, Psychic hits Poison-types that aren't weak to Earth Power, such as Mega Venusaur and Amoonguss. In addition to Pursuit trappers like Tyranitar, speed control from the likes of Choice Scarf Victini, and slow pivots like Slowbro, Choice Specs Enamorus functions as an excellent partner to special sweepers such as Iron Moth, Keldeo, and Blacephalon due to its ability to remove checks to it without competing for the same team slot. These options can also be used to remove Steel- and Poison-types to allow Enamorus to use its powerful Moonblast more freely. As Enamorus is weak to Stealth Rock, it appreciates being partnered with strong entry hazard removal options, such as Rapid Spin Excadrill, Defog Tapu Fini, and Rotom-W, which allow it to more easily work around opposing entry hazard setters such as Hippowdon and suicide leads like Excadrill. Due to its Choice Specs, however, Enamorus becomes prediction-reliant against teams that stack multiple Fairy-resistant foes, so Stealth Rock and Knock Off support from Clefable, Tyranitar, and Scizor allows it to more effectively break down its checks over the course of a game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>With Choice Scarf, its high Special Attack, and the utility of Healing Wish, Enamorus is an effective form of speed control that can also sweep or facilitate another partner's sweep late-game. Earth Power targets Steel-types like Excadrill and Aegislash, Fire-types like Victini and Iron Moth, and it's also Enamorus's strongest attack against Mega Venusaur. Mystical Fire hits specific Steel-types that don't mind Earth Power, namely Skarmory, Scizor, and Celesteela; its Special Attack-lowering effect also provides some utility against Autotomize variants of the latter. Alternatively, Grass Knot can 2HKO Ground-types like Hippowdon and Gastrodon. Finally, Focus Blast serves as a middle ground option against Steel-types like Excadrill and Skarmory while also OHKOing Tyranitar, though its shaky accuracy combined with Enamorus's frailty makes it risky to use. Enamorus best fits on offense teams looking for a form of speed control that can revenge kill fast threats such as Thundurus. Due to its weakness to Stealth Rock, entry hazard removers such as Excadrill and Tapu Fini are essential teammates. Due to Enamorus's low bulk, pivots such as Thundurus can help it safely get onto the field. Enamorus also appreciates the defensive backbone provided by bulky partners such as Amoonguss, Tangrowth, and Skamory; Pokemon that resist Steel like the latter are important as checks to Scizor and Sand Rush Excadrill. Enamorus lacks the power to OHKO certain foes like Victini and Thundurus from full health, while they can often cripple or OHKO it back, making hazard setters like Excadrill and Mew good partners as they can chip these foes into KO range. Enamorus struggles to get past certain Poison-types like Mega Venusaur, making checks to them like Mega Latias useful. Enamorus also has no way of getting past Blissey and Chansey, making physical wallbreakers such as Buzzwole necessary teammates. Healing Wish is best used to either give a sweeper like Dragon Dance Tyranitar or Celesteela a second opportunity to sweep, or a bulky wallbreaker like Scizor the health needed to continue breaking holes into the opposing team.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 585020, "username": "TBIC106"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 546157, "username": "Iride"}, {"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 262594, "username": "Milak"}]}]}
  },
  "Skeledirge": {
    "sets": {
      "Unaware Wall": {
        "description": "<p>Skeledirge is a defensive wall with a solid typing against threats like Iron Moth and Victini and the ability to act as a bulky win condition thanks to Torch Song. Torch Song is the Fire STAB move of choice, allowing Skeledirge to break through defensive Pokemon like Clefable. Will-O-Wisp cripples physical attackers and induces passive damage, allowing Skeledirge to outlast opposing Pokemon. Scorching Sands is an option to hit Iron Moth and Victini for super effective damage while retaining a chance to cripple Tyranitar and Ting-Lu on the switch. Hex synergises with Will-O-Wisp and offers a powerful STAB option that threatens even status absorbers like Clefable. Encore lets Skeledirge set up on defensive walls and punish opposing set up attempts. Heavy-Duty Boots are preferred, as they help Skeledirge avoid entry hazard damage, thereby contributing to its longevity. 44 Defense EVs ensure that Skeledirge lives Rock Blast from Mega Heracross, with the rest of the investment being dumped into Special Defense to better withstand attacks from Iron Moth. Skeledirge finds its home on balance teams that appreciate its ability to compress a solid defensive profile with the ability to snowball against bulkier teams. Knock Off switch-ins are vital for Skeledirge to function optimally. Thus, it appreciates being paired with Pokemon that ignore item removal, such as Mega Venusaur, Clefable, and Z-move users like Hydreigon. Offensive threats such as Excadrill, Mega Aerodactyl, and Aegislash can all muscle through Skeledirge, and thus Skeledirge should be partnered with other physically defensive walls and pivots, such as Tapu Fini, Slowbro, and Mega Venusaur. Specially defensive partners such as Ting-Lu, Chansey, Assault Vest Tangrowth and Tyranitar can help stave off special wallbreakers like Alakazam and Thundurus that would otherwise overwhelm Skeledirge. Finally, certain defensive Pokemon such as Tapu Fini, Ting-Lu and Tyranitar can repeatedly come in on Skeledirge and force it out with phazing moves or the threat of status or item removal. Teammates that can exploit these Pokemon, such as Skarmory, are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 391284, "username": "Velcroc"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Lokix": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Lokix stands out as an offensive pivot thanks to Tinted Lens allowing it to pressure standard U-turn switch-ins such as Buzzwole and Tapu Fini far more consistently than other pivots. Its powerful offensive typing also lets it wear down threats such as Ting-Lu, Tyranitar, and Slowbro. Lokix sports good priority moves such as First Impression and Sucker Punch, which allow it to revenge kill threats such as Greninja, Mega Latias, Iron Boulder, and Alakazam. Knock Off allows Lokix to force progress against Buzzwole, Clefable, and Celesteela by removing their Leftovers while also being able to punish more offensive checks such as Iron Moth and Mienshao for switching in. Leech Life can be an alternative to Sucker Punch to retain Lokix's longevity against bulkier teams. As a pivot, Lokix values Heavy-Duty Boots to prevent it from being worn down from entry hazards as it comes in and out of the field. Lokix typically runs an Adamant nature to maximize its power, but a Jolly nature can be run to pivot against Excadrill more easily; however, it doesn't have many uses aside from that. Despite having Tinted Lens and a solid offensive typing, many physical walls like Skarmory, Clefable, and Mega Venusaur can still easily halt Lokix's progress, so strong special attackers such as Victini, Alakazam, and Iron Moth can easily serve to deal with them. Other Pokemon that 4x resist Lokix's moves like Iron Moth can still be a chore for Lokix to face, since they can switch in on its Bug-type moves and immediately threaten Lokix and its team with their high-powered attacks. To rectify this, partnering Lokix with threats such as Iron Boulder is necessary to properly deal with with those respective foes. All of them greatly appreciate Lokix's ability to pivot and safely get them onto the field in return. Magnezone in particular is a great partner to easily dispatch Skarmory, Celesteela, and Scizor for Lokix, while Lokix can pressure Ting-Lu for it in return. Entry hazard setters such as Skarmory and Clefable are also good partners to help Lokix break threats such as Mega Venusaur.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568189, "username": "Runo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Iron Moth": {
    "sets": {
      "Offensive": {
        "description": "<p>Offensive Iron Moth is one of the most threatening forces in the tier, functioning simultaneously as a wallbreaker and sweeper for offensive teams due to its high Speed, nearly unresisted STAB combination, and ability to boost its Special Attack while attacking. With its STAB combination, it is able to consistently threaten out common Steel- and Fairy-type defensive staples, such as Skarmory, Celesteela, and Clefable, while hitting nearly the entire tier for neutral damage. With longevity through Morning Sun and Toxic immunity combined, it can perform this role through longer games while allowing it to break past checks that could otherwise outlast it, such as Chansey. To enhance this threat, Fiery Dance allows Iron Moth to boost its Special Attack without having to spend a turn setting up, allowing it to overwhelm potential answers like Mega Venusaur and Hippowdon. U-turn allows it to chip down and maintain momentum against Tyranitar, Ting-Lu, and Mega Latias. Alternatively, Energy Ball can be used to remove Ground-type foes, including Quagsire, Hippowdon, and Gastrodon. Iron Moth is also adept at setting Toxic Spikes, as it is able to threaten out Amoonguss and deny entry to Mega Venusaur that would otherwise absorb the entry hazard. However, Iron Moth can often struggle to break past Ground-type foes, such as Ting-Lu, Hippowdon, and Gastrodon, as well as Dragon-type foes, such as Mega Latias. Additionally, it can also be beaten by Unaware users not weak to its coverage, namely Skeledirge. Because of this, it appreciates being paired with Fighting-type partners, like Buzzwole and Mienshao, that can force out these foes or threaten them with Knock Off to remove essential items such as Hippowdon's Leftovers and Skeledirge's Heavy-Duty Boots. In return, Iron Moth aids these partners by removing Steel-types that are not hit super effectively by Fighting-type coverage, such as Skarmory and Aegislash, as well as Fairy-types that would threaten these partners, like Mega Gardevoir and Clefable. Additionally, it enjoys partners such as Celesteela and Rotom-W that can easily switch in on Ground-type foes, such as Ting-Lu and Gastrodon, as well as partners capable of setting entry hazards to wear down these checks, such as Ting-Lu. It also appreciates partners capable of beating opposing Dragon-types, such as Scizor and Clefable. To handle offensive checks like Iron Boulder and Zeraora that would prevent Iron Moth from sweeping a weakened team, it appreciates being paired with speed control partners, including Choice Scarf Rotom-W and Shadow Sneak Aegislash. These allies can eliminate the aforementioned threats once Iron Moth has broken past their defensive counterplay.</p>"
      },
      "Booster Energy: Speed": {
        "description": "<p>Iron Moth is a good sweeper primarily seen on hyper offense and offense teams thanks to Booster Energy bolstering its Speed and giving it the immediate ability to outspeed Choice Scarf users like Hydreigon and Mienshao. It also has high Special Attack and access to a threatening movepool. Fiery Dance serves as a spammable Fire-type STAB move that has the power to 2HKO bulky foes like Celesteela, Aegislash, and Amoonguss, and its ability to boost Iron Moth's Special Attack can let it sweep late-game. Sludge Wave helps break through Fire-resistant and Fairy-type Pokemon like Hydreigon, Volcanion, Tapu Fini, and Clefable, and it can help get KOs on neutral targets that Fiery Dance cannot. Substitute lets Iron Moth make use of switches it forces against foes like Celesteela and Buzzwole and take advantage of some defensive Pokemon like Tangrowth lacking Earthquake and Amoonguss. Energy Ball hits Ground-types like Gastrodon, Ting-Lu, and Hippowdon, as well as providing a way to chip Tyranitar. Psychic is an alternative that helps deal with opposing Mega Venusaur and opposing Iron Moth. This given EV spread maximizes Special Attack while ensuring that Booster Energy will boost Speed, while the rest is put into Defense to augment its physical bulk and to help against priority moves. Entry hazard setters, notably suicide leads like Excadrill also pair nicely with Iron Moth, being able to chip down targets like Tyranitar and Ting-Lu. Due to Iron Moth's Stealth Rock weakness that can give it a harder time sweeping, hazard removers like Tapu Fini and Excadrill make good teammates. Iron Moth primarily struggles to break through its checks like Chansey, Blissey, and Skeledirge, making fellow physically offensive Pokemon like Bisharp and Mega Aerodactyl good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 585020, "username": "TBIC106"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 272785, "username": "nimzowitsch"}, {"user_id": 589016, "username": "Danbear02"}, {"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 546157, "username": "Iride"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 643347, "username": "marillvibes"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Ting-Lu": {
    "sets": {
      "Defensive": {
        "description": "<p>Ting-Lu's high bulk, further boosted by Vessel of Ruin, and access to both Spikes and Stealth Rock make it an elite entry hazard setter and tank in National Dex UU. Ruination reduces Ting-Lu's passivity, notably letting it wear down otherwise sturdy switch-ins such as Rotom-W and Mega Venusaur. Ruination can also pop Air Balloon held by foes such as Aegislash, letting Ting-Lu beat them one-on-one. Running both Spikes and Stealth Rock is an option on more offensive teams, letting Ting-Lu maximize its hazard-setting prowess, but it loses out on valuable utility by doing so. Rest lets Ting-Lu more consistently wall foes such as Iron Moth long-term, though while it's asleep Ting-Lu is very vulnerable to wallbreakers and setup sweepers. Alongside letting Ting-Lu damage foes using the hazards it set up, Whirlwind lets Ting-Lu phaze setup sweepers such as Sinistcha and Celesteela. It also prevents Ting-Lu from being setup fodder to foes resistant or immune to Ground such as the aforementioned two, something especially problematic if Ting-Lu isn't running Ruination. Leftovers slightly makes up for Ting-Lu's lack of reliable recovery, though Heavy-Duty Boots can be run instead to mitigate its vulnerability to entry hazards. Ting-Lu best fits on bulky offense and balance teams looking for a potent hazard setter and tank capable of checking dangerous threats such as Iron Moth and Mega Latias. These traits are appreciated by defensive and offensive Pokemon alike, such as Mega Venusaur and Iron Moth. Teams focused on hazard stacking can add another teammate such as Skarmory to set up Stealth Rock or Spikes so Ting-Lu doesn't have to run both. Offensive pivoting cores such as Iron Moth + Rotom-W can rapidly wear down Ting-Lu while preventing it from fulfilling its defensive roles effectively. Knock Off users such as Clefable and Scizor can lure in and remove these pivot's Heavy-Duty Boots or Leftovers, leaving them more vulnerable to Ting-Lu's entry hazards. Despite its great bulk, Ting-Lu has a plethora of weaknesses that let foes with super effective moves such as Clefable and Hydrapple have an easy time breaking through it, making checks to them such as Mega Venusaur and Celesteela good partners. While it's favored to win against many foes one-on-one, some foes such as Iron Boulder have the coverage to take out Ting-Lu if it has taken a moderate amount of damage beforehand. Defoggers such as Rotom-W can ensure entry hazards don't cut into Ting-Lu's bulk if it isn't holding Heavy-Duty Boots, and the aforementioned bulky teammates such as Skarmory, Rotom-W, and Slowbro can prevent Ting-Lu from being spread too thin checking foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 568189, "username": "Runo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Sinistcha": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Sinistcha's solid defensive typing, good bulk, and access to Calm Mind make it a threatening setup sweeper, matching up well against common defensive stalwarts such as Hippowdon, Rotom-W, and Skarmory. Strength Sap is used to provide Sinistcha with a means of reliable recovery; it also cripples Pokemon such as Mienshao and Choice Band Iron Boulder, ensuring Sinistcha can defeat them one-on-one. Alternatively, Substitute allows Sinistcha to dodge status moves such as Toxic and Thunder Wave from the likes of Celesteela, Hippowdon, and Slowking while allowing it to set up in front of Blissey and Chansey. It also provides Sinistcha with extra security against offensive threats such as Bisharp and Choice Scarf Hydreigon, allowing it to potentially beat them through burns from Matcha Gotcha. Shadow Ball provides Sinistcha with a reliable secondary STAB move that consistently threatens the likes of Aegislash, Celesteela, and Iron Moth once boosted. 96 Speed EVs allow Sinistcha to outrun Adamant Azumarill. Sinistcha fits best on bulky offense and balance structures as a wincon that helps even out matchups against common defensive Pokemon that they would otherwise struggle to break through, such as Hippowdon and Amoonguss. Entry hazard setters like Clefable, Ting-Lu, and Skarmory are solid choices that can check and wear down certain Pokemon that Sinistcha struggles against, such as Mega Aerodactyl, Bisharp, and Tyranitar. Clefable is especially noticeable, as it can also use Knock Off to remove key items from targets such as defensive Celesteela, Assault Vest Tangrowth, and Heavy-Duty Boots Iron Moth, making it easier for Sinistcha to break past them in the long run. On the other hand, wallbreakers such as mixed Aegislash, offensive Mega Latias, and Life Orb Mienshao are similarly efficacious teammates that can help open up opportunities for Sinistcha to sweep. Sinistcha values its longevity, thus preferring not to lose its Leftovers or be crippled by any form of residual damage before setting up. Therefore, defensive pivots such as Mold Breaker Excadrill, Rotom-W, Slowbro, and Scizor are all appreciated for their ability to assist in these areas; Excadrill and Rotom-W serve as effective hazard removal options, whereas Slowbro and Scizor can use Teleport and U-turn respectively to help Sinistcha enter the battlefield safely and absorb Knock Off from users such as Clefable and Mega Venusaur in the process.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Okidogi": {"sets": {"Bulk Up": {}}},
  "Hydrapple": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Hydrapple is a decent wallbreaker thanks to its high Special Attack, good natural bulk, and ability Regenerator letting it stay healthy and pressure checks like Mega Venusaur and Celesteela throughout the game. Nasty Plot's boost to Special Attack lets Hydrapple deal massive damage to foes like Aegislash and Clefable. Fickle Beam hits Grass-resistant Pokemon like Mega Latias, and if it doubles Base Power, it can threaten significant damage against Mega Venusaur and Amoonguss, OHKOing them at +2, while Draco Meteor lets Hydrapple threaten significant reliable damage against the aforementioned Grass-types. Leaf Storm OHKOes Clefable at +2, and Giga Drain provides extra recovery at the cost of a significant loss in power. Recover can be used over a STAB move to let Hydrapple use Steel-types like Skarmory and Celesteela as setup fodder. Heavy-Duty Boots protects it from entry hazards, allowing it to better check threats like Thundurus and non-Hidden Power Ice Keldeo. Grassium Z in combination with Leaf Storm allows it to OHKO Tyranitar prior to setting up, while Dragonium Z in combination with Draco Meteor helps it muscle past checks like Mega Venusaur and Assault Vest Tangrowth, dealing significant damage to them unboosted. Earth Power threatens Steel-types like Excadrill and Bisharp as well as Poison-types like Pecharunt and Iron Moth. 132 Speed EVs and 16 Special Attack EVs alongside a Modest nature let Hydrapple outspeed and OHKO Magic Guard Clefable at +2 with Leaf Storm; alternatively, maximum Special Attack EVs can be run instead to maximize power, with 12 Speed EVs to outspeed Ting-Lu. Hydrapple is typically used on balance and bulky offense teams that appreciate its ability to check a myriad of offensive threats while being able to pressure the opponent's team. Frailer offensive teammates like Enamorus and Victini appreciate Hydrapple's ability to check some of their own checks like Rotom-W, letting them rip holes in or sweep through the opponent's team; in return, Victini threatens Steel-types like Scizor and Jirachi, while Enamorus can lure Mega Venusaur and Amoonguss and do significant damage with Psychic. Hydrapple struggles to make progress against Steel-types; it can't meaningfully damage Scizor, and requires Recover to not be forced out by Celesteela, making Fire-types that can threaten them like Iron Moth and Victini excellent teammates; Hydrapple can also support Victini by threatening Water-types like Slowbro and Rotom-W, as well as Iron Moth by threatening Ting-Lu and Tyranitar. Many faster Pokemon like Enamorus and Iron Moth outspeed Hydrapple and can threaten to OHKO it with their STAB moves or coverage, so teammates that can deal with them like Celesteela and Ting-Lu, respectively, are appreciated. These teammates also benefit from Hydrapple's presence; it can check Electric-types like Rotom-W and Zeraora for Celesteela, and Ting-Lu benefits from it checking Water-types like Keldeo and the aforementioned Rotom-W.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589016, "username": "Danbear02"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Iron Boulder": {
    "sets": {
      "Swords Dance": {
        "description": "<p>With phenomenal base Speed, Iron Boulder is able to outspeed nearly every threat in the tier, making it a powerful wallbreaker and cleaner for offensive teams. Swords Dance is mandatory for Iron Boulder to break past defensive options like Slowbro and Skarmory. Close Combat allows Iron Boulder to threaten Tyranitar and break past Ting-Lu at +2, which resists both of Iron Boulder's STAB moves. Zen Headbutt lets Iron Boulder immediately threaten Mega Venusaur, especially at +2, but Earthquake can be used instead to threaten Aegislash. Rockium Z allows Iron Boulder to secure OHKOs against the aforementioned Skarmory and Slowbro, as well as most other neutral targets, like Celesteela and Rotom-W, that would otherwise be able to stomach a +2 Mighty Cleave and threaten Iron Boulder in return. Psychium Z is an alternative, letting Iron Boulder OHKO Mega Venusaur without a Swords Dance boost and threaten certain Rock-resistant foes like Hippowdon, but is generally less consistent. Booster Energy is an option on hyper offensive teams, allowing Iron Boulder to outspeed all Choice Scarf users, at the cost of Iron Boulder's wallbreaking power provided by Z-Crystals. Swords Dance Iron Boulder is generally seen on teams that appreciate its natural Speed and can take advantage of Iron Boulder removing common defensive staples like Clefable and Slowbro. Teammates such as Mienshao and Scizor can take advantage of holes left in the opposing team to sweep and can also weaken these defensive Pokemon to allow Iron Boulder to sweep later. Iron Boulder also appreciates entry hazard support, as even at +2, it can fail to KO many defensive options without hazard damage, so hazard setters like Hippowdon and Excadrill are appreciated. Iron Boulder is also relatively frail, so it appreciates pivots such as Iron Moth and Mienshao that can give it entry against foes such as Skeledirge and Clefable. Given its poor defensive typing, Iron Boulder is also weak to revenge killers such as Scizor, Mega Aerodactyl, and Azumarill, so teammates that can take hits from these threats, such as Celesteela and Mega Venusaur, are good teammates.</p>"
      },
      "Choice Band": {
        "description": "<p>With Choice Band, Iron Boulder forgoes sweeping potential to become an instantly threatening, incredibly fast wallbreaker and revenge killer that can consistently threaten out foes like Greninja and Alakazam while still threatening defensive options like Clefable and Celesteela. The ability to run all of Close Combat, Earthquake, and Zen Headbutt allows Iron Boulder to threaten Ting Lu, Aegislash, and Mega Venusaur at the same time. Choice Band Iron Boulder can 2HKO all of these threats, as well as immediately threatening Mega Latias and Tapu Fini with 2HKOs. Given its phenomenal Speed and instant power, Choice Band Iron Boulder can fit on most teamstyles that can provide it with safe entry. Defensive pivots like Rotom-W, Slowbro, and Clefable can provide it with a solid defensive backbone into options like Azumarill and Mega Aerodactyl that can threaten Iron Boulder while also providing entry points against Pokemon like Mega Venusaur and Celesteela. Alternatively, offensive pivots like Greninja and Iron Moth can take advantage of the defensive options that Iron Boulder lures in, such as Hippowdon and Quagsire, as well as the holes it can leave in an opposing team. In return, they provide entry points against foes like Skeledirge and Tyranitar. Despite Iron Boulder's power, it can fail to 2HKO certain defensive options, such as Skarmory, Quagsire, and Hippowdon. Therefore, entry hazard support from Clefable and Ting Lu is appreciated. Teammates that can break through these physical walls, such as Iron Moth and Hydrapple, are also good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589016, "username": "Danbear02"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Pecharunt": {"sets": {"Pivot": {"description": "<p>248 HP and 44 SpD lives a +1 Earth Power from Enamorus.</p>"}, "Nasty Plot": {}}}
}