{
  "Ditto": {
    "overview": "<p>Ditto is a niche yet potent revenge killer, leveraging its Imposter ability to quickly reverse sweeps, which would otherwise pose a significant threat to its team. Choice Scarf is both Ditto's biggest strength and Achilles' heel, allowing it to outspeed the Pokemon it copies; however, it is limited to choosing one move, allowing its opponent to respond accordingly by switching to a check. Partially due to being Choice-locked, Ditto struggles against opposing defensive Terastallization, where foes may gain a resistance or immunity to Ditto's moves and fire back with a powerful attack. However, due to Ditto’s lack of any defensive utility and being somewhat situational as well as matchup dependent, Ditto is not a common Pokemon.</p>",
    "comments": "<h3>Other Options</h3> <p>Due to Ditto being incredibly one-dimensional and lacking almost any versatility, it mostly lacks other options. However, Ditto can choose to run Tera Steel. Tera Steel acts as a midground between Tera Fairy and Tera Ghost, giving Ditto a resistance to Dragon-type moves, a Toxic and Toxic Spikes immunity, and maintaining a resistance to Arceus's Extreme Speed. However, due to Ditto's poor bulk, a resistance might not be enough to keep Ditto alive against powerful attackers such as Koraidon and Miraidon.</p> <h3>Checks and Counters</h3> <p><strong>Protect Users</strong>: Protect users like Gliscor take advantage of Ditto being Choice-locked to scout and respond accordingly.</p> <p><strong>Entry Hazards</strong>: Entry hazards significantly cripple Ditto due to its inability to run Heavy-Duty Boots, slowly wearing them down every time it switches in.</p>",
    "sets": {
      "Revenge Killer": {
        "description": "<p>Tera Ghost grants Ditto an immunity to Arceus's Extreme Speed and Koraidon's Low Kick, while Tera Normal gives Ditto an immunity to Calyrex-S's Astral Barrage while adding a STAB boost when copying Arceus's Extreme Speed. On the other hand, Tera Fairy gives Ditto immunity to moves such as Koraidon's Outrage and Scale Shot and Miraidon's Draco Meteor. 0 Speed IVs and a Relaxed nature ensure Ditto has the best chance against other Ditto, making Struggle move last and therefore causing recoil the latest, and 248 HP EVs ensure that Ditto gets five uses of Struggle and minimizes entry hazard damage. It is optimal that Ditto is shiny, as opposing non-shiny Ditto are forced to transform into it, making them have five Transform PP instead of sixteen, causing shiny Ditto to win the interaction due to Struggle’s recoil.</p> <p>Ditto mainly fits on bulkier balance teams, where being passive is less of an issue due to its great revenge killing and reverse sweeping abilities. Furthermore, on more defensive teams, Ditto’s lack of defensive utility is supplemented by other teammates, while it can also more easily rely on teammates to scout for an opponent Terastallizing. More passive teammates like Eternatus, Gliscor, and Alomomola enjoy having extra insurance against powerful threats like Zacian-C or Scale Shot Koraidon. Due to Ditto being Choice locked, defensive Pokemon such as Ho-Oh can take great advantage of Ditto being locked into an unfavorable move. Therefore, Ditto appreciates the support of Eternatus, which provides a Toxic poison immunity and a strong STAB attack in Dynamax Cannon in combination with Toxic, which can quickly wear Ho-Oh down. Ditto also appreciates teammates like Alomomola, which can help Ditto that are Choice-locked into Dragon- or Ghost-type moves and safely switch out against Pokemon like Zacian-C and Arceus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487990, "username": "Swas"}, {"user_id": 554093, "username": "RL"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}]}]}
  },
  "Ho-Oh": {
    "overview": "<p>Thanks to Ho-Oh's amazing stats, typing, and access to Regenerator, it cements itself as one of the best Pokemon in AG, making it a very good addition to balance and bulky offense teams. Ho-Oh is able to reliably check threatening physical attackers such as Extreme Killer Arceus, Koraidon, Necrozma-DM, Calyrex-I, and Kingambit. Although, special attackers such as Miraidon and Kyogre are able to threaten Ho-Oh out with Electro Drift and Origin Pulse, respectively. Ho-Oh also dislikes switching into Arceus-Fairy because most sets carry Power Gem to heavily chip it. Additionally, Pokemon like Arceus-Ground and Zacian-C like to run Stone Edge and Wild Charge, respectively, to be able to counter Ho-Oh. As Ho-Oh is always tasked to deal with Koraidon, it can get overwhelmed over the course of a game because it is forced to check so many physical attackers. Extreme Killer Arceus, Dragon Dance Arceus-Ground, Calyrex-I, and Necrozma-DM in particular like to run Tera Fire, gaining an immunity to burn from Sacred Fire and being able to set up on Ho-Oh.</p>",
    "comments": "<h3>Other Options</h3> <p>Ho-Oh can opt to run a more niche option in Imprison to prevent bulky Arceus formes and Eternatus from using Recover, albeit at the cost of losing Whirlwind to stop setup sweepers and phaze foes. Imprison Ho-Oh also likes running a faster EV spread to use Imprison before Arceus formes can use Recover, at the cost of its bulk. Ho-Oh can run Choice Band, boosting its STAB moves' power to notable levels, 2HKOing bulky Arceus formes, Eternatus, and Ting-Lu with Brave Bird. Although, this completely removes its defensive capabilities, with it no longer being able to check the likes of Extreme Killer Arceus, Koraidon, and opposing Ho-Oh. Furthermore, it makes Stealth Rock a glaring weakness, derailing Ho-Oh's longevity, especially due to the lack of great entry hazard removal options. Tera Steel lets Ho-Oh take on non-Low Kick Tera Steel Koraidon and reliably check Calm Mind Arceus-Fairy, turning Power Gem into a resistance and allowing Ho-Oh to phaze it.</p> <h3>Checks and Counters</h3> <p><strong>Miraidon</strong>: Miraidon resists both of Ho-Oh's STAB moves and forces it out with Electro Drift. However, Miraidon is not able to switch in freely on Ho-Oh because of Sacred Fire threatening a burn and Earthquake threatening to 2HKO it.</p> <p><strong>Eternatus</strong>: Eternatus is able to switch into Ho-Oh's attacks and force it out with Toxic or Meteor Beam. Furthermore, it can use this opportunity to set up Toxic Spikes. Although, Eternatus must be wary of Ho-Oh's Earthquake, which is able to 2HKO it. Lastly, offensive variants of Ho-Oh are able to brute force through Eternatus thanks to Brave Bird and Tera Flying.</p> <p><strong>Tera Fire Users</strong>: Setup Pokemon such as Necrozma-DM, Extreme Killer Arceus, Arceus-Ground, Calyrex-I, and Kingambit often like to carry Tera Fire to block Sacred Fire's burn and set up on Ho-Oh, with Arceus opting to run Taunt occasionally to stop Ho-Oh from using Whirlwind.</p> <p><strong>Water-types</strong>: Water-types such as Arceus-Water, Kyogre, and Dondozo can be problematic to Ho-Oh. Arceus-Water can safely switch in on Ho-Oh's attacks, has a reliable recovery option in Recover, and is able to threaten Ho-Oh out with Judgment. Although, Arceus-Water must be careful of the combination of a Sacred Fire burn and entry hazards hampering its ability to check Ho-Oh throughout a game. Kyogre can switch in on Ho-Oh's Sacred Fire and force Ho-Oh out, but it must be careful of Brave Bird, which is able to 2HKO it. Although not usually seen, Dondozo is a staple on stall teams. Thanks to Dondozo's amazing bulk and access to Rest, it is able to safely switch in on Ho-Oh and check it. Although, Ho-Oh can brute force its way through Dondozo with either Choice Band or an offensive set with Tera Flying.</p> <p><strong>Gliscor</strong>: Mostly seen on stall archetypes, Gliscor is able to absorb Ho-Oh's STAB moves, doesn't fear burn, and can heal itself with Protect and Poison Heal. Furthermore, Gliscor can use Knock Off to remove Ho-Oh's Heavy-Duty Boots, which destroys its longevity if Stealth Rock is up. However, Ho-Oh can use an offensive set paired with Substitute and Tera Flying to absorb Gliscor's Knock Off and beat it with Brave Bird. Additionally, although not as common, Ho-Oh can use a Choice Band set to 2HKO Gliscor.</p> <p><strong>Calyrex-S</strong>: Calyrex-S is able to take on a low HP Ho-Oh with Tera Ghost. Furthermore, Calyrex-S occasionally likes to run Choice Specs to brute force its way through Ho-Oh with Astral Barrage, 2HKOing it. Alternatively, Calyrex-S can use Trick to derail Ho-Oh's longevity, removing its Heavy-Duty Boots and locking it down to one single move.</p> <p><strong>Garganacl</strong>: Like Gliscor, Garganacl is mostly seen on stall archetypes. Garganacl is able to threaten Ho-Oh out with Salt Cure, safely switch in on its STAB moves, and avoid Sacred Fire burns thanks to Purifying Salt, increasing its longevity. Although, Garganacl must be wary of Earthquake, as it deals reliable damage to it.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Sacred Fire allows Ho-Oh to threaten out and burn physical attackers like Extreme Killer Arceus and Koraidon, and it is able to deal reliable damage to the likes of Ting-Lu and Arceus-Fairy under sun. Brave Bird allows Ho-Oh to OHKO Koraidon with minimal chip damage, 2HKO Calyrex-S, and deal reliable damage to Ting-Lu, bulky Arceus formes, and Eternatus. Whirlwind helps Ho-Oh phaze setup threats that like to run Tera Fire, such as Koraidon, Extreme Killer Arceus, Necrozma-DM, Calyrex-I, and Kingambit, and rack up entry hazard damage on opposing Pokemon. Tera Fairy is primarily used to stop Scale Shot Koraidon from running wild and block Choice Scarf Koraidon's Outrage from 2HKOing Ho-Oh. Although, this comes at the cost of making Ho-Oh weak to Necrozma-DM's and Zacian-C's Steel-type STAB moves, removing its burn immunity, and removing its resistance to Fire-type moves, notably from opposing Ho-Oh and Koraidon. Alternatively, Ho-Oh can opt to run Tera Grass, which allows it to check Miraidon, Kyogre, and Arceus-Ground in a pinch. Tera Grass also significantly improves Ho-Oh's matchup against Calm Mind Arceus-Fairy, removing its 4x Rock weakness.</p> <p>Ho-Oh is a fantastic addition to balance and bulky offense teams. Ho-Oh struggles with Miraidon and Kyogre, hence it appreciates teammates such as Ting-Lu, which is able to switch in on Miraidon's Electro Drift, and Eternatus, which can take on Kyogre and poison it. Koraidon and Extreme Killer Arceus are able to overwhelm Ho-Oh in the long run, so it appreciates Arceus-Fairy helping it check these threats. Landorus-T with Rocky Helmet is another option to pair with Ho-Oh for the same reason, although it is seen more on offensive structures. Ho-Oh struggles with Eternatus being able to reliably recover its HP, status Ho-Oh with Toxic, and set up Toxic Spikes, so Ho-Oh appreciates Necrozma-DM absorbing Eternatus's Toxic and threatening it out. Setup sweepers like Koraidon, Dragon Dance Arceus-Ground, and Swords Dance Arceus can overwhelm Ho-Oh and force it out, so it likes Choice Scarf users such as Calyrex-S and Koraidon, which are able to revenge kill these foes. Ho-Oh also struggles with Calyrex-S one-on-one when on low HP, making teammates like Ting-Lu and Arceus, which are able to force Calyrex-S out, very good choices. Additionally, Arceus-Water is able to reliably switch in on Ho-Oh's STAB moves and threaten it out with Judgment. Miraidon can take on Arceus-Water and threaten it out with Electro Drift, although Miraidon must be wary of Arceus-Water burning it with Will-O-Wisp, reducing its longevity.</p>"
      },
      "Offensive": {
        "description": "<p>Ho-Oh is one of the best wallbreakers in the metagame thanks to its high Attack stat, powerful STAB moves, incredible longevity provided by Regenerator, and amazing typing. The prominence of Koraidon and its sun makes Ho-Oh's Sacred Fire incredibly powerful, always OHKOing offensive Necrozma-DM and Calyrex-S with one layer of Spikes, always 2HKOing Arceus, and greatly limiting the capacity of Ting-Lu to switch in while having very high odds of burning switch-ins that aren't Fire-type, such as Eternatus and Arceus-Water. Brave Bird is only resisted by a few Pokemon, like Necrozma-DM, Zacian-C, and Miraidon, which are all threatened by Ho-Oh's other moves. Earthquake is mainly used as a way to hit Miraidon super effectively, but it also 2HKOes Eternatus without recoil. Alternatively, Substitute can be used to break through more passive teams, since it lets Ho-Oh take advantage of bulky staples like Gliscor, which is unable to break its Substitute. Notably, Substitute Ho-Oh should always be Tera Flying to maximize its ability to break stall teams. Imprison can also be used to beat opposing Ho-Oh by blocking its recovery and damaging moves, and it enables Ho-Oh to break support Arceus formes that can't hit it super effectively by blocking Recover. Whirlwind can also be used to block setup attempts by Calm Mind Arceus-Fairy or Arceus-Ground, which could otherwise use Ho-Oh as setup fodder. Tera Ground allows Ho-Oh to turn the tables on Miraidon and OHKO it with Earthquake, increase the damage it deals to Eternatus, and 2HKO offensive Tera Fire Arceus-Ground without getting OHKOed by Stone Edge. However, it leaves Ho-Oh weak to Calyrex-S's Grass Knot. Tera Fairy is helpful as a way to deny Dragon-type moves from Koraidon while still surviving any move from Miraidon, although it stops Ho-Oh from checking Necrozma-DM and removes its resistance to and immunity to burn from opposing Ho-Oh's Sacred Fire and Koraidon's Flare Blitz. Tera Flying further bolsters the power of Brave Bird, allowing it to OHKO Calyrex-S, 2HKO bulky Arceus, and 2HKO Ting-Lu with one layer of Spikes. The given EVs are to ensure Ho-Oh outspeeds opposing defensive Ho-Oh, Gliscor, and bulky Necrozma-DM while maximizing its Attack and bulk.</p> <p>Offensive Ho-Oh fits best on balance and bulky offense teams, which greatly benefit from its wallbreaking and high staying power due to Regenerator. Calyrex-S and Miraidon appreciate Ho-Oh taking on opposing Ting-Lu, which can check both of them. Choice Scarf Koraidon also benefits from offensive Ho-Oh switching in freely against most of its checks, such as defensive Arceus-Ground, Arceus-Fairy, and Landorus-T, and it can easily pivot Ho-Oh in with U-turn, also providing sun to bolster Sacred Fire's power. Offensive Ho-Oh appreciates Ting-Lu a lot thanks to its ability to check Miraidon—which would otherwise OHKO Ho-Oh with Electro Drift—and Calyrex-S. Entry hazard setters like Eternatus, Ting-Lu, Arceus-Ground, and Landorus-T are perfect partners, as they enhance Ho-Oh's wallbreaking power with the chip damage provided by hazards. Ho-Oh also greatly values partners that can help check Koraidon, like Arceus-Fairy, Arceus-Ground, and Arceus-Water; the last also checks Necrozma-DM, which can be threatening for Ho-Oh if it's carrying Stone Edge. Offensive Ho-Oh struggles against Calyrex-S; therefore, partners that can check it like Ting-Lu and Arceus are appreciated.</p>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 554093, "username": "RL"}, {"user_id": 631210, "username": "Adhi"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 554093, "username": "RL"}, {"user_id": 631210, "username": "Adhi"}, {"user_id": 487990, "username": "Swas"}, {"user_id": 584685, "username": "Glory"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 569291, "username": "zinnias"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Kyogre": {
    "overview": "<p>Kyogre sets itself apart as a wallbreaker in the Anything Goes metagame by virtue of its formidable bulk and superb raw power. Drizzle extends Kyogre's damage potential to impressive heights, which severely limits the amount of Pokemon willing to switch in on its Water-type attacks. Kyogre matches up positively against the majority of the tier's defensive threats, including staples like Necrozma-DM, Ho-Oh, Ting-Lu, and Arceus-Ground. However, Kyogre may struggle against bulky Dragon-types such as Eternatus, Koraidon, Miraidon, and Giratina-O, which can discourage the use of Kyogre’s STAB moves.</p>",
    "comments": "<h3>Other Options</h3> <p>Leftovers variants of Kyogre may use an alternative EV spread of 240 HP / 252 Def / 16 Spe and a Bold nature. While this limits Kyogre's firepower, it improves its ability to check Necrozma-DM, Ho-Oh, Koraidon, and physical Arceus-Ground. On these sets, Protect may be favored over Thunder in order to scout Choice item users and recover with Leftovers. Water Spout can be used in place of Thunder to deal high damage to switch-ins while being more accurate than Origin Pulse. Surf may also seem appealing as an accurate Water-type STAB option. However, it is considerably less powerful than Origin Pulse. All Kyogre sets can reasonably opt for Tera Poison as a niche option, as it grants an immunity to Eternatus's Toxic and the ability to remove its Toxic Spikes. Furthermore, it provides a valuable resistance to Calyrex-S's Grass Knot, which is otherwise super effective. Another Tera type option is Electric, which provides relevant resistances to Miraidon's Electro Drift, Ho-Oh's Brave Bird, and opposing Kyogre's Thunder.</p> <h3>Checks and Counters</h3> <p><strong>Eternatus</strong>: Eternatus can reliably switch in on Kyogre's attacks and threaten it with Toxic. Additionally, it can take advantage of Kyogre to set Toxic Spikes. Eternatus has access to reliable recovery, which prevents Kyogre from wearing it down. Thunder Wave variants of Kyogre can cripple Eternatus, however, and Choice Specs variants can 2HKO it with Ice Beam.</p> <p><strong>Koraidon</strong>: Due to Orichalcum Pulse activating sun, Koraidon is able to switch in comfortably on Kyogre's Water-type attacks and 2HKO it with Low Kick. Furthermore, Koraidon can pivot out with U-turn safely, as Kyogre is significantly weakened by sun. Kyogre can deal significant damage to Koraidon on a predicted switch by using Ice Beam, with Choice Specs variants achieving an OHKO. Additionally, Thunder Wave may allow Kyogre to outspeed non-Choice Scarf variants of Koraidon. Choice Scarf Koraidon is also incapacitated by paralysis, as its revenge killing capabilities become severely impaired.</p> <p><strong>Miraidon</strong>: Miraidon outspeeds Kyogre and is able to OHKO it with Electro Drift. Because Miraidon is such a threatening wallbreaker in its own right, it forces Kyogre to be played carefully. Though Miraidon resists Water, it cannot switch in on Kyogre's Water-type attacks repeatedly, as they deal heavy chip damage.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>This set aims to maximize longevity by use of Heavy-Duty Boots or Leftovers in addition to heavy HP investment. Kyogre's exceedingly strong Origin Pulse in tandem with Drizzle allows it to pose a major threat to defensive cores. Ice Beam is a compulsory coverage move, as it allows Kyogre to deal heavy damage to Dragon-types like Eternatus, Koraidon, and Miraidon, which resists Origin Pulse. Thunder improves Kyogre's matchup against opposing Kyogre and Arceus-Water. Kyogre is able to set up using Calm Mind, further bolstering its already impressive Special Attack to break through Eternatus. Finally, Thunder Wave allows Kyogre to pester faster switch-ins such as Eternatus and Koraidon. The given EV spread allows Kyogre to outspeed paralyzed Calyrex-S. Kyogre's choice of item largely depends on a team's interaction with entry hazards. Teams with adequate hazard countermeasures, including Pokemon with Taunt, often opt for Leftovers. Otherwise, Kyogre should use Heavy-Duty Boots. Tera Fairy is Kyogre's Tera Type of choice, as it greatly improves Kyogre's matchup against Koraidon.</p> <p>Offensive Kyogre excels on bulky offense teams, as it is able to keep pressure on many of the metagame's defensive threats. Kyogre’s notable bulk allows it to take hits from more passive Pokemon such as support Arceus formes and Ting-Lu. Bulky offense teams also appreciate its ability to soft check major threats in Necrozma-DM, Arceus-Ground, and Ho-Oh. Drizzle can deactivate Koraidon's Orichalcum Pulse, making it significantly easier to handle. Kyogre synergizes very well with pivots like Koraidon, Miraidon, and Landorus-T, which give it ample opportunity to face defensive Pokemon. Eternatus is a good teammate for Leftovers Kyogre, as it absorbs Toxic Spikes. Steel-type Pokemon such as Necrozma-DM and Zacian-C can shut down Kyogre’s main check in Eternatus.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Kyogre trades longevity for more immediate damage, increasing its breaking power. Origin Pulse is inaccurate but is Kyogre's best move after Water Spout is weakened. Ice Beam allows Kyogre to threaten Dragon-types like Koraidon, Miraidon, and Eternatus, preventing them from being reliable switch-ins and notably OHKOing Koraidon after one spike layer of Spikes. Thunder allows Kyogre to hit bulky Water-types, such as opposing Kyogre, Arceus-Water, and Tera Water Arceus-Fairy. Tera Water boosts Kyogre's Water-type attacks to an absurd level, allowing it to OHKO Miraidon with Water Spout on the switch and at worst 2HKO every common defensive Pokemon in rain. Alternatively, Tera Fairy makes Kyogre immune to Dragon-type attacks and lets it survive a Low Kick from Koraidon even after some chip damage. Tera Ghost is an alternative option that similarly deals with Low Kick while also adding an immunity to Extreme Speed, which allows Kyogre to take on even boosted Arceus. 252 EVs in Speed with a Timid nature lets Kyogre outspeed most defensive Arceus formes, whereas Modest can be used for more damage output, enabling Ice Beam to OHKO Koraidon.</p> <p>Since Choice Specs Kyogre is easily chipped down by entry hazards, it often finds itself on faster-paced teams that appreciate its ability to quickly force progress. Koraidon, Miraidon, Calyrex-S, and offensive Arceus-Fairy make excellent teammates, since they appreciate Kyogre's ability to OHKO most of their checks. Since Kyogre is very slow, it appreciates speed control options such as Choice Scarf Koraidon and Calyrex-S as well as Arceus, which can clean up late-game. Kyogre also benefits from Sticky Web, as it allows it to outspeed threats such as Loaded Dice Koraidon, Life Orb Miraidon, and Zacian-C, making Kyogre much more difficult to answer. Bulky Ground-types like Ting-Lu, Iron Treads, Arceus-Ground, and Landorus-T are also great teammates, since they switch into Miraidon's Electric-type attacks well. Landorus-T in particular can also switch into and chip Koraidon with Rocky Helmet and pivot Kyogre in against the defensive Pokemon that often switch into it, such as defensive Arceus formes, Ho-Oh, and opposing Landorus-T. Other pivots such as Choice Scarf Koraidon and Miraidon also make excellent partners, as they can help bring Kyogre onto the field.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Kyogre's strong rain-boosted STAB moves and decent Speed tier make it a good Choice Scarf user, and with this item it becomes a formidable revenge killer and late-game cleaner that is very hard to deal with when opposing Koraidon is chipped sufficiently, with barely anything being able to switch into it. Choice Scarf Kyogre also allows other Choice Scarf users such as Koraidon and Calyrex-S to run more offensive sets such as Swords Dance and Nasty Plot. Water Spout can pick up crucial OHKOs on many top threats such as Zacian-C, Ho-Oh, and non-Choice Scarf Calyrex-S while also OHKOing Arceus-Fairy after three layers of Spikes. Origin Pulse lets Kyogre retain its threatening offensive ability even when it's damaged and Water Spout's Base Power is diminished. Ice Beam is used to super effectively hit Dragon-type threats such as Koraidon, Eternatus, Giratina-O, and Miraidon. Koraidon is particularly important to hit because of Orichalcum Pulse wiping Drizzle away. Thunder is useful against opposing Kyogre, Arceus-Water, and Tera Water users like Arceus-Fairy. A Timid nature is necessary for Kyogre to outspeed Zacian-C and Calyrex-S. Tera Water allows Kyogre to overpower bulkier Pokemon that can otherwise survive multiple uses of Water Spout like Eternatus and Blissey, while also guaranteeing an OHKO on Zacian-C with Origin Pulse. Tera Ghost can be used as an alternative, making Kyogre immune to Koraidon's Low Kick and Arceus's Extreme Speed, letting it secure a revenge kill. Tera Flying grants Kyogre an immunity to Sticky Web and also allows it to avoid chip damage from Toxic Spikes and Spikes at the cost of becoming weak to Stealth Rock. Tera Flying is especially preferred when not paired with a Defog or Magic Bounce support partner.</p> <p>Choice Scarf Kyogre fits mainly on bulky offense teams, which cherish its ability to revenge kill Koraidon, Zacian-C, and Calyrex-S, freeing their own Koraidon to run non-Choice Scarf sets. Arceus-Fairy is an extremely important partner for Kyogre, as it serves as a good check to Koraidon, which can revenge kill Choice Scarf Kyogre not locked into Ice Beam. Arceus-Fairy is also able to block Koraidon’s Dragon-type STAB moves and force it out as well as checking Arceus, which can threaten Kyogre with its powerful priority Extreme Speed. Arceus-Fairy also checks speed-boosting threats like Koraidon and Arceus-Ground, which can outspeed Choice Scarf Kyogre after a turn of setup. Since Kyogre is vulnerable to Sticky Web and other entry hazards, it's essential to fit Hatterene or Defog Giratina-O on the team if possible. Hatterene can prevent hazards from entering the field with Magic Bounce in order to increase Kyogre's longevity, completely wall most common Eternatus sets, and provide a safe switch in for Kyogre via Baton Pass, which can also pass Calm Mind boosts. In return, Kyogre can revenge kill a Zacian-C, which threatens both Arceus-Fairy and Hatterene. Landorus-T is able to check Koraidon because of Intimidate and chip it with Rocky Helmet while also being able to safely pivot Kyogre in via a slow U-turn. Arceus can also be used as a partner, as it provides a switch-in to Choice Scarf Calyrex-S. In return, Kyogre is able to constantly pressure walls like Arceus-Fairy and Ho-Oh. Ting-Lu is also a superb teammate, as it can check Choice Scarf Calyrex-S, provide a safe switch-in to Miraidon, and set up Spikes, which can assist Kyogre's wallbreaking ability.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 541114, "username": "PrimalKyogre"}, {"user_id": 660324, "username": "GigaBytes7"}, {"user_id": 697081, "username": "fion"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487990, "username": "Swas"}, {"user_id": 532881, "username": "Frozoid"}, {"user_id": 554093, "username": "RL"}, {"user_id": 426798, "username": "Geysers"}, {"user_id": 584685, "username": "Glory"}, {"user_id": 631210, "username": "Adhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 593115, "username": "igiveuponaname"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Groudon": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Groudon is a decent pick for bulky offense teams thanks to its ability to check Zacian-C, Extreme Killer Arceus, Dragon Dance Arceus-Ground, and Koraidon due to its solid bulk. Access to moves such as Will-O-Wisp and Spikes differentiate it from Landorus-T. Will-O-Wisp allows Groudon to cripple Pokemon that switch into it such as Koraidon and physical variants of Arceus-Ground. Roar is used to phaze foes such as Swords Dance Zacian-C, Swords Dance Koraidon, Extreme Killer Arceus, and Arceus-Ground that may try to set up on it while also racking up chip damage from entry hazards. Protect is an alternative move that can be used to scout moves from the likes of Choice Specs Miraidon and Kyogre and Choice Scarf Koraidon as well as maximize Leftovers recovery. Tera Water allows Groudon to resist Behemoth Blade from Zacian-C, Flare Blitz from Koraidon, and Water Spout and Ice Beam from Kyogre, whereas Tera Fairy makes it immune or resistant to Scale Shot and Low Kick from Koraidon and Draco Meteor from Miraidon. Offensive teammates that benefit from the hazards set up by Groudon such as Calyrex-S, Calm Mind Arceus formes, Miraidon, Koraidon, Zacian-C, and Extreme Killer Arceus are appreciated. As Groudon lacks recovery, revenge killers such as Choice Scarf Koraidon and other physical walls with access to recovery such as defensive Arceus formes are mandatory partners. As Groudon is unable to check special attackers such as Calyrex-S, Miraidon, and Kyogre, checks to them such as Ting-Lu and Clodsire are appreciated; they can set up hazards as well to form a hazard stacking core with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609321, "username": "eavo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys-Attack": {"sets": {"All-Out Attacker": {}}},
  "Deoxys-Speed": {
    "overview": "<p>With incredible Speed and a diverse pool of utility moves, Deoxys-S cements itself as one of the most reliable suicide leads in AG and should be considered on many hyper offense structures. The fast Taunt and entry hazards Deoxys-S provides enable many powerful setup sweepers like Koraidon and Miraidon to break through their usual checks. However, Deoxys-S is quite one dimensional, as it is cramped for moves if it wants to beat some of its many counterleads; for example, it needs Knock Off to threaten Calyrex-S and Psycho Boost to threaten Scale Shot Koraidon. Although it is often considered to be the most reliable suicide lead in the tier, it doesn't match up well against many other hyper offense leads such as Ribombee, Glimmora, and the occasional Grimmsnarl, so teammates like Necrozma-DM are appreciated.</p>",
    "comments": "<h3>Other Options</h3> <p>Skill Swap can be used to beat Magic Bounce Hatterene, but Hatterene is very rare, and Skill Swap has limited uses in other matchups. Tera Dark can be used to beat Grimmsnarl leads, but this is quite situational, and it loses out on the Extreme Killer Arceus matchup. Rocky Helmet with a bulkier EV spread of 252 HP / 192 Def / 16 SpD / 52 Spe can be used to possibly set multiple layers of entry hazards more reliably and beat Focus Sash leads, but it leaves Deoxys-S vulnerable to Choice Scarf Calyrex-S. Counter can be used alongside the aforementioned bulky EV spread to punish U-turn from Choice Scarf Koraidon but has limited other uses.</p> <h3>Checks and Counters</h3> <p><strong>Ribombee</strong>: Ribombee can lower Deoxys-S's Speed with Pounce and follow up by KOing it with Bug Buzz.</p> <p><strong>Calyrex-S</strong>: With its powerful Astral Barrage, Calyrex-S can KO non-Knock Off Deoxys-S and gain a Special Attack boost as a result, which makes it harder to respond to, as hyper offense teams usually do not have any Choice Scarf users.</p> <p><strong>Grimmsnarl</strong>: Deoxys-S cannot deal any meaningful damage to Grimmsnarl, which can use Taunt before Deoxys-S can set entry hazards. However, Grimmsnarl doesn't appreciate losing its Light Clay because of Knock Off.</p>",
    "sets": {
      "Suicide Lead": {
        "description": "<p>Deoxys-S outspeeds every single viable unboosted Pokemon in the metagame, and with utility moves such as Taunt, Stealth Rock, Spikes, and Knock Off, it is often considered to be one of the most reliable and effective dedicated leads in AG. Taunt can prevent other leads from setting up their own entry hazards or boosting, and Psycho Boost OHKOes Koraidon. Knock Off can take out any unsuspecting Calyrex-S, while Stealth Rock can be used if Deoxys-S can survive for multiple turns to set it in addition to Spikes and should be used with an EV spread of 80 HP / 176 SpA / 252 Spe and a Timid nature. Tera Ghost blocks Extreme Speed from Arceus, letting Deoxys-S set up more hazards. 176 Special Attack EVs guarantee that Psycho Boost OHKOes Koraidon, and the leftover EVs are dumped into Attack to guarantee an OHKO on Calyrex-S with Knock Off.</p> <p>The only archetype that Deoxys-S fits on is hyper offense, so setup sweepers like Scale Shot Koraidon, Agility Miraidon, and Nasty Plot Calyrex-S that can take advantage of the entry hazard damage on their checks are great teammates. Since Deoxys-S struggles with Grimmsnarl, Ribombee, and Choice Scarf Calyrex-S, teammates like Trick Room Necrozma-DM and Extreme Killer Arceus can help by dealing with them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 651906, "username": "Pigbeeef"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Gliscor": {"sets": {"Defensive": {}}},
  "Giratina-Origin": {
    "sets": {
      "Offensive": {},
      "Defensive": {
        "outdated": true,
        "description": "<p>Thanks to its bulk, typing, and Levitate ability, defensive Giratina-O checks Pokemon like Arceus, Arceus-Ground, and Choice Scarf Kyogre, and it is the only metagame-relevant Defog user. Will-O-Wisp and Thunder Wave both debilitate physical attackers, but Will-O-Wisp chips away at walls and affects Dragon Dance Arceus-Ground, while Thunder Wave additionally impairs special attackers such as Calm Mind Arceus-Fairy. Poltergeist breaks Arceus-Ground's Substitute, which would otherwise block Will-O-Wisp and Dragon Tail, in one hit; alternatively, running Hex lets Giratina-O hit statused walls harder and makes burn affect it much less. Dragon Tail quickly racks up entry hazard damage on the opposing team and prevents foes from continuously setting up against Giratina-O, which is especially useful against Taunt users. The given EV spread lets Giratina take unboosted Calyrex-S's Astral Barrage and outspeed Taunt Landorus-T. Tera Steel makes Giratina-O immune to poison from foes such as Toxapex and gives it a resistance to moves like Arceus-Fairy's Judgment, Zacian-C's Play Rough and Behemoth Blade, Koraidon's Scale Shot, and Arceus-Ground's Dragon Claw and Ice Beam. Tera Poison similarly removes Giratina-O's Dragon weakness and provides it with an immunity to Toxic and a resistance to Fairy, but it doesn't make Giratina-O weak to Koraidon's Low Kick. Defensive Giratina-O fits best on balance teams that otherwise have trouble dealing with Ground-types such as Dragon Dance Arceus-Ground or need the increased longevity Defog provides. Toxapex and Skeledirge handle Pokemon like Zacian-C and Koraidon for Giratina-O; in return, it handles Ground-types and helps check Arceus. Giratina-O appreciates Ting-Lu and Arceus checking Calyrex-S for it; Ting-Lu also checks Miraidon and helps check Calm Mind Arceus-Ground. Calyrex-S likes Giratina-O being able to deal with its two main switch-ins, Arceus and Ting-Lu, by checking the former and removing the latter's Spikes. Because it lacks recovery, Giratina-O can get overwhelmed by the Pokemon it checks when facing hyper offense teams, so it appreciates revenge killers such as Extreme Killer Arceus and Choice Scarf Koraidon.</p>"
      }
    }
  },
  "Arceus": {
    "sets": {
      "Bulky Swords Dance": {},
      "Bulk Up": {
        "description": "<p>Bulk Up Arceus is a potent late-game setup sweeper and revenge killer that leverages Extreme Speed—the strongest priority move in the tier. Shadow Claw allows it to hit Calyrex-S, Tera Ghost Koraidon, and Giratina-O. Recover allows Arceus to set up on Pokemon such as other Arceus lacking Bulk Up, Dragon Dance Arceus-Ground, various defensive Arceus formes lacking Will-O-Wisp, and Koraidon after Terastallizing. Tera Fire gives Arceus a burn immunity, which lets it set up on Pokemon that would otherwise check it, such as support Arceus formes with Will-O-Wisp and non-Whirlwind Ho-Oh. It also grants a resistance to Koraidon's Flare Blitz and Calyrex-S's Grass Knot at the cost at the cost of Arceus's immunity to Calyrex-S's Astral Barrage. Arceus's Special Defense and HP EVs allow it to survive a +2 Tera Grass Calyrex-S Grass Knot or a +2 Tera Stellar Psychic from the same foe. Its Speed creeps it above fully invested, neutral-natured base 90 Pokemon such as Kyogre and Ho-Oh.</p> <p>Bulk Up Arceus applies offensive pressure on Pokemon such as Arceus-Fairy, Arceus-Water, and defensive Ho-Oh, forcing them to stay at high enough HP to successfully stop a sweep. Its longevity relative to regular Extreme Killer Arceus makes it much more prominent on bulkier balance and bulky offense teams, where it frequently acts as a great Calyrex-S check and often threatens to sweep once the opponent's defensive Arceus formes and Ho-Oh are worn down. Bulk Up Arceus struggles with special wallbreakers, like Miraidon and Kyogre, as it can't OHKO them without multiple boosts, allowing them to force out or heavily damage it. Thus, Eternatus is a great partner for Bulk Up Arceus, leveraging its Water resistance to be one of the best Kyogre switch-ins, as well as spreading poison with Toxic Spikes and Toxic. Ting-Lu, being balance's best and only Miraidon check, is also a great partner to Bulk Up Arceus due to its Electric immunity and great Special Defense. Before Terastallizing, Arceus is also weak to Koraidon's Low Kick and burn inflicted by defensive Arceus formes, Ho-Oh, and Giratina-O. Arceus-Fairy is a great burn absorber, can force out Ho-Oh with Power Gem, acts as a great Koraidon switch-in, and easily spreads paralysis with Thunder Wave to make it easier for Arceus to set up. Arceus-Water is also a great switch-in to Ho-Oh, leveraging its Fire resistance and threatening it out with Judgment. It also helps slow down Zacian-C, using its Water typing to resist Behemoth Blade and threatening Zacian-C with Will-O-Wisp but at the cost of letting opposing Koraidon use Low Kick more freely than Arceus-Fairy. Bulk Up Arceus is a deadweight against stall due to Dondozo, Skeledirge, Skarmory, and Garganacl walling it effectively. Thus, it appreciates stallbreaking teammates, such as Miraidon and Calyrex-S, which also assist in breaking Arceus-Fairy and Arceus-Water. Zacian-C also proves to be a challenge for Bulk Up Arceus to break on its own, so it usually relies on teammates such as Ho-Oh or the aforementioned Arceus-Water to force Zacian-C to switch out and slowly chip it with entry hazard damage. Choice Scarf Koraidon is also a great offensive check to Zacian-C and Miraidon, threatening OHKOes with Flare Blitz and Outrage, respectively.</p>"
      },
      "Offensive Extreme Killer": {
        "description": "<p>Arceus is one of the most potent setup sweepers and cleaners in the metagame, fitting on a wide variety of teams due to its impressive natural bulk and typing blessing it with a good matchup into Calyrex-S, while its powerful Extreme Speeds are crucial at keeping other attackers like Miraidon, Koraidon, and Dragon Dance Arceus-Ground from running wild. Shadow Claw is critical coverage for its ability to OHKO non-Terastallized Calyrex-S and hit Necrozma-DM and Giratina-O for large amounts of damage. Stone Edge hits Ho-Oh, OHKOing offensive sets unboosted and defensive sets with a boost. Earthquake instead hits Zacian-C—which can otherwise switch into Arceus with relative ease—in addition to OHKOing most Eternatus and hitting Necrozma-DM for higher damage after using Swords Dance. Taunt is an option on more offensive teams that prevents defensive Arceus formes from healing or crippling Arceus with Will-O-Wisp or Thunder Wave, stifles setup attempts from Pokemon like Bulk Up Arceus and Dragon Dance Necrozma-DM, and can help break stall teams by shutting down Gliscor and stopping Dondozo from using Rest. Heavy-Duty Boots provides Arceus with more opportunities to set up in the face of Spikes or Toxic Spikes, but hyper offense teams can instead run Mental Herb or Lum Berry to circumvent either Encore Calyrex-S or burn from Ho-Oh and defensive Arceus formes. Tera Normal boosts Extreme Speed's power to the point of it 2HKOing defensive Arceus formes and OHKOing Miraidon and Koraidon after a boost, albeit requiring minor chip damage to KO the latter with consistency. Tera Fire instead grants an immunity to burn; gives resistances to Calyrex-S's Grass Knot and Fairy- and Steel-type attacks from Arceus-Fairy, Zacian-C, and Necrozma-DM; and rids Arceus of its Fighting-type weakness so it can survive Koraidon's Low Kick and Zacian-C's Close Combat. Maximum Speed investment gives an advantage over opposing Extreme Killer Arceus, though lower investment is an option to increase survivability against Calyrex-S.</p> <p>Arceus excels on almost every type of team, from balance to bulky offense to hyper offense. On balance and bulky offense, Ting-Lu can assist Arceus as a check to Calyrex-S while helping handle Necrozma-DM and providing Spikes that can chip Arceus's checks like Koraidon, Zacian-C, and defensive Arceus formes into KO range of its boosted attacks. On these teams, switch-ins to Koraidon like Arceus-Fairy, Landorus-T, and defensive Arceus-Ground are a necessity, as Koraidon can survive even boosted Extreme Speeds without Tera Normal and frequently runs Tera Ghost to stop Arceus even from critical HP. Arceus pairs well with most offensive threats in the metagame but has particularly nice synergy with Giratina-O and Choice Scarf Calyrex-S, as they can often put foes into lose-lose scenarios where they must use Tera Ghost to avoid Extreme Speed, thus becoming vulnerable to Shadow Sneak or Astral Barrage; the inverse is also true in the case of Tera Normal Calyrex-S. Arceus is an essential member of hyper offense teams, acting as their primary stopgap to Calyrex-S on top of being a potent sweeper and revenge killer. Suicide leads like Deoxys-S and Ribombee can support Arceus and its teammates with Spikes and Sticky Web, respectively. Life Orb Calyrex-S can take advantage of Arceus's switch-ins like defensive Arceus formes and Zacian-C to deal massive damage or even outright sweep, while physical attackers like Koraidon and Zacian-C can overwhelm physical walls to open a path for Arceus to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 584685, "username": "Glory"}, {"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 554093, "username": "RL"}, {"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Fairy": {
    "overview": "<p>Arceus-Fairy is one of the best walls in AG and one of the very few defensive Pokemon that is able to reliably check Koraidon thanks to an immunity to Dragon-type moves letting it block Scale Shot and a resistance to Low Kick and Close Combat. This forces Koraidon to use Flare Blitz to KO Arceus-Fairy, which derails its longevity. Additionally, Arceus-Fairy's good bulk allows it to soft check Pokemon such as Extreme Killer Arceus, Ho-Oh, and Giratina-O. Arceus-Fairy can sometimes be a bit passive versus Steel-types such as Necrozma-DM and Zacian-C; although, both are unable to switch in on Arceus-Fairy because it likes to carry Will-O-Wisp to cripple them. Furthermore, Eternatus is able to take on Arceus-Fairy and use Toxic on it. If not, then it can set up Toxic Spikes without taking any significant damage. Apart from these weaknesses, Arceus-Fairy is almost flawless and should always be considered on balance and bulky offense teams.</p>",
    "comments": "<h3>Other Options</h3> <p>Arceus-Fairy can run Stealth Rock in conjunction with Ting-Lu's Spikes. Although, this means that Arceus-Fairy has to drop either a status-inducing move or Power Gem. On more offense-oriented teams, Arceus-Fairy can opt to run Taunt paired with Thunder Wave, paralyzing foes and stopping Ho-Oh, bulky Arceus formes, and Eternatus from using Recover.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Steel-types such as Zacian-C and Necrozma-DM are able to brute force their way through Arceus-Fairy thanks to their powerful Steel moves. Although, both must be wary of Arceus-Fairy Terastallizing into a Water-type and burning them with Will-O-Wisp.</p> <p><strong>Kyogre</strong>: Kyogre is a great lead and likes to carry Thunder Wave to cripple Arceus-Fairy. Furthermore, Kyogre's Drizzle-boosted Origin Pulse 2HKOes Arceus-Fairy.</p> <p><strong>Tera Fire Users</strong>: Setup users such as Extreme Killer Arceus, Dragon Dance Arceus-Ground, Koraidon, and Calyrex-I like to run Tera Fire to block Arceus-Fairy's Will-O-Wisp. Although, Thunder Wave can cripple them.</p> <p><strong>Eternatus</strong>: Eternatus can poison Arceus-Fairy without taking any significant damage in return. Furthermore, it is able to set up Toxic Spikes, which derails Arceus-Fairy's longevity.</p> <p><strong>Calyrex-S</strong>: Calyrex-S is able to take on a low HP Arceus-Fairy with Astral Barrage or 2HKO it with Tera Ghost or Choice Specs. Although, Calyrex-S must be wary of Thunder Wave when switching in on Arceus-Fairy.</p> <p><strong>Taunt Users</strong>: Although mostly seen on offensive teams, Taunt users such as Extreme Killer Arceus and Dragon Dance Arceus-Ground can prevent Arceus-Fairy from using Will-O-Wisp to burn them.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>This set allows Arceus-Fairy to reliably take on Koraidon. Judgment hits Dark- and Dragon-types like Ting-Lu, Koraidon, and Miraidon super effectively, deterring Miraidon from switching in freely. It also acts as good neutral coverage that deals good damage to Calyrex-S, Arceus formes, Kyogre, and Hatterene. Power Gem gives Arceus-Fairy a reliable way of hitting Ho-Oh, having a chance at 2HKOing it. Will-O-Wisp prevents setup sweepers such as Zacian-C, Necrozma-DM, Extreme Killer Arceus, and Calyrex-I from safely switching in on Arceus-Fairy. Although, Will-O-Wisp is unable to burn Ho-Oh and Tera Fire users such as Calyrex-I, Extreme Killer Arceus, Arceus-Ground, Koraidon, and Necrozma-DM. Thunder Wave on the other hand cripples the likes of Ho-Oh, Necrozma-DM, Zacian-C, Eternatus, and bulky Arceus formes, as all of them commonly switch in on Arceus-Fairy. Arceus-Fairy can opt for a dual status set to punish not only physical attackers with Will-O-Wisp but also Calyrex-S, Kyogre, and Eternatus on a switch in with Thunder Wave. Although, running this set means that Arceus-Fairy cannot do reliable damage to Ho-Oh because it is not carrying Power Gem. Tera Water allows Arceus-Fairy to check Zacian-C and Koraidon in a pinch and burn both with Will-O-Wisp. A drawback of Tera Water is that it makes Arceus-Fairy weak to Miraidon's Electro Drift, Zacian-C's Wild Charge, and Calyrex-S's Grass Knot. Additionally, Tera Water makes Arceus-Fairy no longer immune to Dragon-type moves and removes its resistance to Koraidon's Low Kick. Tera Poison on the other hand grants Arceus-Fairy an immunity to poison, lets it absorb Toxic Spikes, and makes it resist opposing Arceus-Fairy's Judgment. A major downside of both the aforementioned Tera types is that with them Arceus-Fairy is unable to block Koraidon's Scale Shot, which can cause a snowball into a quick sweep.</p> <p>Arceus-Fairy is a staple on balance and bulky offense teams. Despite Arceus-Fairy being an almost flawless wall, it is still unable to check physical attackers such as Zacian-C and Necrozma-DM without Terastallization. Ho-Oh makes a great teammate for Arceus-Fairy, as it is able to check both because of Sacred Fire having a 50% burn chance. Also, thanks to Koraidon's omnipresent Sun, Ho-Oh's Sacred Fire can 2HKO Necrozma-DM and OHKO Zacian-C. Calyrex-S and Miraidon are able to do great amounts of damage to Arceus-Fairy; to effectively deal with them, Arceus-Fairy greatly appreciates Ting-Lu as a teammate, which can pivot in on both foes. Ting-Lu can also soft check Necrozma-DM and set up Spikes, keeping opposing sweepers on a timer. Defensive Ho-Oh and Eternatus are able to keep up with offensive Ho-Oh, with Eternatus threatening to poison it. Furthermore, Eternatus can check Kyogre and both absorb and set up Toxic Spikes whenever required. Due to being tasked to deal with so many physical attackers, Arceus-Fairy can get overwhelmed. It appreciates Choice Scarf users such as Koraidon and Calyrex-S, which can revenge kill these attackers with their powerful STAB moves. Koraidon may run Tera Steel in conjunction with Substitute and Iron Head to get the better of Arceus-Fairy, forcing it to Terastallize in most interactions. To beat Tera Steel Koraidon, Arceus-Fairy once again likes Ting-Lu as its teammate, since it is able to phaze Koraidon with Whirlwind. Necozma-DM can also beat this Koraidon set one-on-one thanks to its bulk and access to Dragon Dance. Although, both Necrozma-DM and Ting-Lu must be careful of Low Kick, which Tera Steel Koraidon can sometimes run over Substitute. Furthermore, Choice Scarf Koraidon and Calyrex-S can revenge kill this foe too.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 631210, "username": "Adhi"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487990, "username": "Swas"}, {"user_id": 554093, "username": "RL"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Ground": {
    "sets": {
      "Defensive": {},
      "Calm Mind": {
        "description": "<p>Calm Mind Arceus-Ground is an amazing wallbreaker and setup sweeper thanks to its good natural bulk and coverage that cement it as a threat that cannot be ignored. Power Gem 2HKOes Ho-Oh and hits Ground-immune targets such as Gliscor and Landorus-T for decent damage after a Calm Mind boost. Tera Ground allows Arceus-Ground to 2HKO Ting-Lu at +1 after a layer of Spikes, 2HKO Arceus formes at +1, and OHKO Arceus formes at +1 them after 3 layers of Spikes. Tera Fairy makes Arceus-Ground immune to Miraidon's Draco Meteor and Koraidon's Outrage and Scale Shot while giving it a resistance to Low Kick from the latter and a neutrality to Calyrex-S's Grass Knot, making it difficult to revenge kill. However, it makes Arceus-Ground more vulnerable to Zacian-C's Behemoth Blade. More often than not, Arceus-Fairy ends up being the Calm Mind user that's easier to fit thanks to its defensive utility, which enables it to take on Koraidon. Although, Arceus-Ground fits on teams that tend to be weak to Necrozma-DM and Zacian-C.</p> <p>Calm Mind Arceus-Ground is best suited for balance and bulky offense teams where it is able to open up holes for its teammates. Calyrex-S in particular is a great teammate for Arceus-Ground, with both pressuring Ting-Lu and opening up a potential sweep for each other. Similarly, Miraidon helps to overwhelm their mutual check in Ting-Lu, paving the way for Arceus-Ground to clean up later. Calyrex-S can take advantage of Arceus-Ground locked into Calm Mind or Recover via Encore and use it as an opportunity to set up Nasty Plot. Grass Knot also does massive damage to unboosted Arceus-Ground; hence, Arceus-Ground appreciates Arceus, which is able to check Calyrex-S by effectively switching in on its Grass Knot and threatening it out with Shadow Claw. Koraidon, with its various sets such as Choice Scarf and Swords Dance, is able to brute force its way through Arceus-Ground, so Ho-Oh is another teammate that Arceus-Ground appreciates, helping keep Koraidon in check while soft checking Calyrex-S and Arceus. Arceus-Ground can struggle with entry hazards, which makes Hatterene a good partner, as it is able to bounce them back and can also bring in Arceus-Ground via Baton Pass, allowing it to set up on common switch-ins to Hatterene, such as Ho-Oh. Arceus-Ground also appreciates Choice Scarf Koraidon, which is able to bring it in via U-turn. Eternatus and Ting-Lu are also amazing teammates, setting up Toxic Spikes and Spikes, respectively, chipping foes and allowing Arceus-Ground to sweep more easily; Eternatus also helps keep Kyogre in check thanks to its bulk and access to Toxic. Arceus-Ground struggles to break through Giratina-O because of its Ground immunity, hence Arceus-Ground appreciates Arceus-Fairy because it is able to beat Giratina-O with Judgment. Arceus-Ground on the other hand is able to handle Arceus-Fairy's checks such as Necrozma-DM and Zacian-C and punish them with Judgment. Although, running both Arceus-Fairy and Arceus-Ground means that entry hazards like Spikes and Toxic Spikes could cause a big problem to them.</p>"
      },
      "Bulky Dragon Dance": {},
      "Offensive Dragon Dance": {
        "description": "<p>Offensive Dragon Dance Arceus-Ground is a potent setup sweeper, leveraging its high Speed tier and Dragon Dance to outspeed the entire unboosted metagame after one boost and all Choice Scarf users after two boosts while punching holes through teams with boosted Earthquake. Taunt stops Pokemon such as Arceus-Fairy, Arceus-Water, and defensive Arceus-Ground from burning Arceus-Ground with Will-O-Wisp while also stopping Ting-Lu and Terastallized Ho-Oh from phazing it with Whirlwind. Furthermore, Taunt blocks recovery from defensive Pokemon like support Arceus formes and Dondozo, allowing Arceus-Ground to break through or cripple them for a teammate. Stone Edge allows Arceus-Ground to OHKO Ho-Oh at +1. Tera Fire is used to block Will-O-Wisp, resist Koraidon's Flare Blitz, resist Calyrex-S's Grass Knot, resist both of Zacian-C's STAB moves, and resist Arceus-Fairy's Judgment. However, it does make Arceus-Ground weak to Stealth Rock and Ting-Lu's Earthquake, and it maintains its weakness to Arceus-Water's Judgment.</p> <p>Arceus-Ground is a staple on hyper offense teams, alongside suicide leads such as Deoxys-S, Ribombee, and Glimmora. Other offense staples like Zacian-C, Arceus, and Koraidon greatly benefit from Arceus-Ground's presence, as they both struggle with defensive Arceus formes. Arceus-Ground can help chip down the aforementioned Arceus formes that frequently switch in on it, using Taunt to deny Recover and entry hazards, allowing its teammates to eventually break through them. This works the other way around as well, with Koraidon and Zacian-C doing a great deal of damage to defensive Arceus formes and Koraidon knocking support Arceus formes into Earthquake's KO range, potentially enabling a sweep. Arceus-Ground also serves a vital role on hyper offense teams as an Electric-immune Pokemon, which allows it to force out and set up on Miraidon, an otherwise potentially significant threat. Calyrex-S and Arceus-Ground share a common check in Ting-Lu, which they chip into KO range of each other, allowing for one of them to sweep. Arceus and Arceus-Ground also both struggle with Giratina-O, as Giratina-O's Ground and Normal immunity makes it a hard-to-break wall. This can be circumvented by using Arceus to chip Giratina-O with Swords Dance-boosted Shadow Claw, which can allow Arceus-Ground to sweep with Stone Edge without having to fear Dragon Tail or Will-O-Wisp.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 631210, "username": "Adhi"}, {"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 554093, "username": "RL"}, {"user_id": 487990, "username": "Swas"}, {"user_id": 631210, "username": "Adhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Water": {
    "overview": "<p>Arceus-Water is one of the best physical walls in the metagame, being used on balance and bulky offense teams to check top threats like Necrozma-DM, Ho-Oh, and Koraidon with its great bulk, typing, and utility moves such as Will-O-Wisp and Dragon Tail. It can also be a decent wincon with Calm Mind, using its defensive profile to repeatedly set up and avoid revenge killing attempts. However, Pokemon like Miraidon and Eternatus can relatively freely switch into Arceus-Water and threaten it, the omnipresent Koraidon's sun weakens its Judgment, and it is vulnerable to being worn down into KO range of foes it's supposed to check by entry hazards.</p>",
    "comments": "<h3>Other Options</h3> <p>Defensive Arceus-Water can use Calm Mind in the fourth moveslot to turn into a decent wincon, as it can use its bulk to set up on the foes it checks and avoid being revenge killed by Pokemon like Koraidon and Arceus. Draco Meteor is also an option in this moveslot to chip Koraidon, Miraidon, and Eternatus more reliably than Dragon Tail; Miriadon can only switch into it once, and it has a good chance to 2HKO Koraidon. Thunder Wave can be used over Will-O-Wisp to debilitate Calyrex-S, Eternatus, Ho-Oh, and Tera Fire users like Koraidon and Necrozma-DM, but this makes Arceus-Water worse against Arceus and Dragon Dance Arceus-Ground.</p> <h3>Checks and Counters</h3> <p><strong>Miriadon</strong>: Miraidon can switch into any of Arceus-Water's moves bar Dragon Tail with very little consequence to fire off its powerful attacks or grab momentum with U-turn.</p> <p><strong>Eternatus</strong>: Eternatus can repeatedly take Arceus-Water's moves and cripple it with Toxic or lay Toxic Spikes against it, though Tera Poison prevents this.</p> <p><strong>Calyrex-S</strong>: Calyrex-S can pretty safely switch into Arceus-Water, usually at worst taking a chunk from Judgment or being forced out by Dragon Tail, and use this as an opportunity to set up or immediately wallbreak. However, the rare Thunder Wave completely ruins Calyrex-S.</p> <p><strong>Kyogre</strong>: Kyogre is similarly able to use Arceus-Water as an entry point to use Calm Mind, Thunder, or Origin Pulse; it loses to Calm Mind Arceus-Water if it lacks Thunder, however.</p> <p><strong>Sun</strong>: Koraidon's sun severely weakens Arceus-Water's Judgment, making it struggle against foes like Ho-Oh, Ting-Lu, and Arceus-Ground or potentially impeding its sweep.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Water is a good check to dangerous physical attackers like Necrozma-DM, Koraidon, Ho-Oh, Arceus, Arceus-Ground, and Zacian-C, and it soft checks non-Thunder Kyogre. Its resistances to moves like Necrozma-DM's Sunsteel Strike and Koraidon's Flare Blitz and—most importantly—its ability to beat Ho-Oh set it apart from its main competition in Arceus-Ground. Dragon Tail phazes setup sweepers like Necrozma-DM and Arceus formes, as well as chipping Pokemon such as Miraidon and Eternatus on the switch-in and racking up entry hazard damage. Alternatively, Taunt stops setup sweepers from boosting and Pokemon like Ting-Lu from laying entry hazards, and Stealth Rock greatly hinders Choice Band Ho-Oh and weakens defensive Pokemon for Arceus-Water's teammates. Tera Fairy lets Arceus-Water more comfortably take Koraidon's Low Kick and completely block its Scale Shot, denying it a Speed boost; Tera Fairy does make Arceus-Water weak to Necrozma-DM's Sunsteel Strike, however. Tera Poison also gives it a resistance to Low Kick, lets it absorb Toxic Spikes and Toxic from Eternatus, and improves its matchup against Wild Charge Zacian-C, albeit at the cost of leaving it vulnerable to foes like Necrozma-DM and Arceus-Ground. Both Tera types also help by removing Arceus-Water's weaknesses to Miraidon's Electro Drift and Calyrex-S's Grass Knot in a pinch.</p> <p>Arceus-Water should be used on balance and bulky offense teams, where both offensive Pokemon and walls benefit from its defensive utility. Arceus-Water can switch into walls like Ho-Oh and Arceus-Ground and common revenge killers like Arceus and Choice Scarf Koraidon for offensive teammates such as Calyrex-S, Miraidon, Arceus, and Zacian-C. In return, Calyrex-S and Miraidon can threaten Eternatus, one of Arceus-Water's biggest problems, and Zacian-C can safely switch into Eternatus lacking a Fire-type move. Necrozma-DM appreciates Arceus-Water checking Koraidon and Arceus-Ground; additionally, Necrozma-DM helps handle Wild Charge Zacian-C, can take Choice Band Ho-Oh's Brave Bird—which 2HKOes Arceus-Water with entry hazards up—and is the best Eternatus check in the metagame. Ting-Lu can handle Calyrex-S, Miraidon, and, to a certain extent, Eternatus for Arceus-Water and appreciates it taking on Pokemon like Koraidon, Ho-Oh, and Zacian-C. Eternatus can check Kyogre and absorb Toxic Spikes for Arceus-Water, and Arceus-Water deals with Ground-types like Arceus-Ground and Ting-Lu. Ho-Oh likes that Arceus-Water checks Dragon Dance Arceus-Ground and some Kyogre and helps take on Pokemon like Koraidon and Arceus. Offensive Ho-Oh in particular can also potentially lure in and KO Eternatus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511181, "username": "Rose"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 584685, "username": "Glory"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Mandibuzz": {
    "comments": "<h3>Other Options</h3> <p>Mandibuzz could opt to use Mental Herb over Heavy-Duty Boots for the ability to check Taunt variations of Draining Kiss Calyrex-S. However, not using Heavy-Duty Boots renders Mandibuzz vulnerable to Stealth Rock and other entry hazards after Terastallization. Mandibuzz can also use U-turn over the moves in its third slot. Usually, when Mandibuzz switches in against Calyrex-S and forces it to switch out, Mandibuzz loses momentum by staying in. However, with U-turn, Mandibuzz can gain its team the initiative and switch in a teammate that can make its position more advantageous. Although in most cases, the slight increase in momentum Mandibuzz's team gets is insignificant, and other moves can bring more value.</p> <h3>Checks and Counters</h3> <p><strong>Zacian-C</strong>: Zacian-C is immune to Mandibuzz's status moves and resists Knock Off. It is also capable of OHKOing Mandibuzz with Play Rough.</p> <p><strong>Miraidon</strong>: Miraidon can OHKO Mandibuzz with Electro Drift and does great damage to the point where Mandibuzz can no longer check Calyrex-S even after Terastallization.</p> <p><strong>Hatterene</strong>: Hatterene's Magic Bounce grants it an immunity to Mandibuzz's Toxic, and it can use Calm Mind in combination with Draining Kiss to deal significant damage to Mandibuzz, healing itself in the process.</p> <p><strong>Gliscor</strong>: Gliscor's Knock Off poses a significant threat to Mandibuzz, as removing Heavy-Duty Boots causes Mandibuzz to be much more vulnerable to Stealth Rock.</p> <p><strong>Wallbreakers</strong>: Wallbreakers, like Kyogre and Koraidon, are capable of dealing significant damage to Mandibuzz, rendering it unable to check Calyrex-S effectively.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Mandibuzz is one of stall teams' best Calyrex-S checks, utilizing its Dark typing, special bulk, and access to reliable recovery in Roost to wall all Calyrex-S sets, bar Tera Fairy. Toxic significantly cripples foes by limiting how much they can set up. Whirlwind phazes setup threats like various setup Arceus formes. Defog is a form of emergency entry hazard control, especially useful against Knock Off Pokemon, but Mandibuzz also removes its own team's hazards while using it. Alternatively, Foul Play discourages physical attackers from setting up against Mandibuzz. Knock Off removes Heavy-Duty Boots, making it much easier to chip down Pokemon with the Spikes and Toxic Spikes that Mandibuzz's teammates set. Tera Steel grants Mandibuzz a resistance to Fairy- and Psychic-type moves, allowing it to check non-Taunt Draining Kiss Calyrex-S, as well as Arceus-Fairy, and giving Mandibuzz a Toxic immunity. Mandibuzz has to compete with Alolan Muk for a slot, another Dark-type Calyrex-S check that is much better equipped to deal with Tera Fairy Calyrex-S. However, Mandibuzz has reliable recovery in Roost, unlike Alolan Muk, whose Rest is shut down by Electric Terrain.</p> <p>Teammates like Dondozo, Skeledirge, and Gliscor appreciate having a reliable switch-in to Calyrex-S, while Blissey appreciates having a fallback method when facing Psyshock variations of Calyrex-S. As Mandibuzz is forced out by the threat of Miraidon's Electro Drift or Kyogre's Water-type moves, it enjoys having teammates like Tera Grass Ho-Oh, Clodsire, and Blissey, all of which can absorb their attacks well. Arceus-Fairy's super effective Judgment poses a great threat to Mandibuzz, forcing it to switch out to teammates like Clodsire, whose Poison typing and access to Toxic make it an excellent check to Arceus-Fairy. Mandibuzz is also very vulnerable to physical attackers, like Zacian-C, which is immune to its Toxic, resists Knock Off, and can OHKO Mandibuzz with Play Rough; or Koraidon, whose Choice Scarf sets can 2HKO Mandibuzz, and Substitute sets use it as setup fodder. Thus, teammates like Skeledirge, Dondozo, and Alomomola work very well with Mandibuzz, as both Skeledirge and Dondozo can fully ignore both setup sweepers' Swords Dance boosts with Unaware, and Skeledirge can cripple them with Will-O-Wisp. At the same time, Alomomola can use its great physical bulk to use Flip Turn and absorb damage the aforementioned Unaware walls would have taken otherwise.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487990, "username": "Swas"}, {"user_id": 469993, "username": "Bread Sandwich"}]}, {"name": "Grammar checked by", "members": [{"user_id": 653095, "username": "FavMon=Garchomp"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Landorus-Therian": {
    "outdated": true,
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Landorus-T is an excellent physically defensive pivot that checks foes such as Koraidon, Zacian-C, Arceus, and Dragon Dance Arceus-Ground thanks to its rare Spikes immunity, Intimidate, and U-turn. Taunt denies entry hazards and status from Pokemon such as Ting-Lu and Toxapex and prevents foes like Arceus from continuously setting up in front of Landorus-T. Rocky Helmet punishes foes like Koraidon and Zacian-C for attacking by potentially putting them into range of attacks such as +2 Arceus's Extreme Speed, Calyrex-S's Astral Barrage, and Giratina-O's Shadow Sneak. Tera Water grants a resistance to attacks such as Koraidon's Flare Blitz and Zacian-C's Behemoth Blade, while Tera Fairy grants an immunity to Dragon, denying Scale Shot Koraidon a Speed boost and less importantly blocking moves like Miraidon's Draco Meteor. Landorus-T best fits on bulky offense teams, where it can support offensive teammates such as Calyrex-S, Zacian-C, Arceus, and Miraidon by setting Stealth Rock, safely pivoting them in to wallbreak, and checking revenge killers like Zacian-C and Choice Scarf Koraidon. Ting-Lu checks Pokemon like Calyrex-S, Miraidon, and Calm Mind Arceus-Ground for Landorus-T and provides its offensive teammates with Spikes support; Landorus-T checks strong physical attackers for it in return. Landorus-T lacks recovery, so partners like Arceus-Fairy, Arceus-Ground, and Zacian-C can assist it by checking Koraidon, opposing Zacian-C, and Arceus, respectively, with help from Intimidate; Choice Scarf Koraidon can also revenge kill these foes. Teammates like Koraidon, Giratina-O, and Eternatus deter Kyogre from using its STAB moves to an extent, but Kyogre can still force you to predict whether it will use a Water-type move or Ice Beam in the face of Landorus-T.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511181, "username": "Rose"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 584685, "username": "Glory"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Ribombee": {
    "comments": "<h3>Other Options</h3> <p>Baton Pass can be used to pass stat boosts from Quiver Dance onto Ribombee's teammates, mainly special attackers like Calyrex-S and Miraidon. Psychic Noise and Psychic are niche options that allow Ribombee to hit Glimmora super effectively.</p> <h3>Checks and Counters</h3> <p><strong>Heavy-Duty Boots Users</strong>: Heavy-Duty Boots is a very common item, with many naturally fast Pokemon like Calyrex-S and Miraidon running it, nullifying the effect of Sticky Web entirely.</p> <p><strong>Taunt Users</strong>: Taunt prevents Ribombee from setting up Sticky Web; however, the most common Taunt users of Miraidon, Deoxys-S, and Grimmsnarl must all be wary of Moonblast.</p> <p><strong>Glimmora</strong>: Glimmora directly counters Ribombee, as it resists Moonblast and can use Mortal Spin to remove Sticky Web.</p> <p><strong>Ditto</strong>: Ditto ignores the Speed drop from Sticky Web upon transforming, potentially allowing it to countersweep your team with Choice Scarf.</p> <p><strong>Hatterene</strong>: Hatterene can prevent Ribombee from setting up Sticky Web with its Magic Bounce ability and is able to break Ribombee's Focus Sash. It has to be wary of Skill Swap and Quiver Dance-boosted Moonblast.</p>",
    "sets": {
      "Sticky Web": {
        "description": "<p>Ribombee is the best Sticky Web setter in AG thanks to its Speed tier letting it outspeed and avoid Taunt from Arceus formes as well as its Fairy typing, which makes it immune to Koraidon's Scale Shot. Moonblast allows Ribombee to threaten Pokemon like Miraidon and Grimmsnarl that may try to use Taunt against it. Stun Spore and Pounce both let Ribombee's allies set up and sweep safely without worrying about the opposing Pokemon outspeeding them. Stun Spore paralyzes the likes of Ho-Oh, whereas Pounce offers a safer alternative while also avoiding Taunt from the likes of Arceus-Ground and Miraidon. Skill Swap allows Ribombee to set up Sticky Web in front of Magic Bounce Hatterene. Alternatively, Quiver Dance boosts the power of Ribombee's Moonblast, allowing it to break Substitute from Zacian-C and deal with Tera Steel Koraidon, both of which may attempt to set up in front of Ribombee; it also allows Ribombee to 2HKO Hatterene. Choice Scarf lets Ribombee outspeed Taunt users like Deoxys-S and Miraidon, with Trick to cripple Glimmora and stall Pokemon. However, it gives Ribombee a shakier matchup into Zacian-C while still being outsped by Jolly Choice Scarf Koraidon. Tera Ghost gives Ribombee an immunity to Extreme Speed from Arceus, whereas Tera Steel provides an immunity to Glimmora's Mortal Spin while still keeping a resistance to Extreme Speed.</p> <p>Common hyper offense Pokemon such as Calyrex-S, Zacian-C, and Arceus-Ground greatly benefit from Ribombee's Sticky Web. The Speed drop prevents Choice Scarf Koraidon from revenge killing Calyrex-S and Zacian-C, and in Arceus-Ground's case, allows it to outspeed Choice Scarf Calyrex-S after a Dragon Dance boost. Glimmora can provide the team with Spikes support while punishing physical attacks such as Dual Wingbeat, U-turn, and Flare Blitz from Koraidon; Sacred Fire from Ho-Oh; and Extreme Speed from Arceus by setting up Toxic Spikes. It also provides entry hazard control through Mortal Spin, clearing away Spikes that may have been set by Ting-Lu in front of Ribombee, while its Poison typing allows it to clear Toxic Spikes from Eternatus, since their teammates tend to be vulnerable to entry hazards. Arceus in particular enjoys Glimmora's Toxic Spikes and hazard removal, as it allows Arceus to run items like Mental Herb and Lum Berry. It also appreciates Sticky Web, as they strengthen Arceus's middle-level Speed stat.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 649291, "username": "Playering"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487990, "username": "Swas"}, {"user_id": 631210, "username": "Adhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 593115, "username": "igiveuponaname"}, {"user_id": 197240, "username": "sunny"}]}]}
  },
  "Necrozma-Dusk-Mane": {
    "overview": "<p>Necrozma-DM is the single most potent sweeper in Anything Goes, and it excels on every style of team. A terrific typing backed by Prism Armor and colossal bulk makes Necrozma-DM incredibly difficult to KO, allowing it to effortlessly leverage its immense natural power to set up and to win games on a dime. Necrozma-DM's unique defensive profile makes it the most consistent switch-in to Eternatus and the only Pokemon that can pivot into Choice Band Ho-Oh's Brave Bird; it also lets it check Arceus, Arceus-Fairy, Deoxys-A, and Zacian-C while deterring Dragon-type moves from Koraidon and Miraidon. Unparalleled versatility in choice of moves, EV spreads, and Tera types enables Necrozma-DM to pick and choose its answers like little else in the metagame. Despite this myriad of excellent traits, Necrozma-DM can be taken advantage of by powerful threats like Calyrex-S, Koraidon, Kyogre, and Arceus-Ground, while some common walls like Ting-Lu, Ho-Oh, and Arceus-Water are able to take Necrozma-DM's attacks and respond by crippling or phazing it.</p>",
    "comments": "<h3>Other Options</h3> <p>Bulky Necrozma-DM has many different less consistent options. It can use a specially defensive spread to take less damage from Calyrex-S's Astral Barrage and set up on Miraidon and defensive Arceus formes lacking Will-O-Wisp. However, the lack of physical defense or offensive power leaves Necrozma-DM unable to set up or do meaningful damage against most teams. Swords Dance can be used over Dragon Dance for more immediate power, but it struggles to make an impact in endgame scenarios. Sunsteel Strike can be dropped for Photon Geyser to do more damage to Ho-Oh and Arceus-Water, but this leaves Necrozma-DM walled by Ting-Lu and unable to do much damage to Calyrex-S.</p> <p>A defensive set consisting of Stealth Rock, Knock Off, Sunsteel Strike, and Moonlight might seem enticing, but such a set is extremely passive and fails to make progress against defensive Arceus formes.</p> <p>Necrozma-DM can effectively use nearly any Tera type to fill whatever role its team needs, but most options fail to help against its primary forms of counterplay and thus fail to have much effectiveness outside of niche circumstances.</p> <h3>Checks and Counters</h3> <p><strong>Ho-Oh</strong>: Ho-Oh can comfortably stomach any of Necrozma-DM's attacks besides Stone Edge and respond with a powerful Sacred Fire or by phazing it out with Whirlwind.</p> <p><strong>Calyrex-S</strong>: Calyrex-S can deal massive damage to Necrozma-DM with Astral Barrage and outspeed it even after a Dragon Dance boost, though it is unable to switch in safely and fails to OHKO a healthy Necrozma-DM.</p> <p><strong>Koraidon</strong>: Koraidon massively threatens Necrozma-DM with sun-boosted Flare Blitz, and Choice Scarf variants outspeed it even after it uses Dragon Dance multiple times.</p> <p><strong>Arceus Formes</strong>: Defensive Arceus formes, particularly Arceus-Water and Arceus-Ground, are able to take Necrozma-DM's attacks and respond by burning it with Will-O-Wisp or hitting it with a powerful Judgment. However, they are worn down quickly when switching in with multiple layers of Spikes up, especially if they are also tasked with checking Necrozma-DM's teammates.</p> <p><strong>Kyogre</strong>: Kyogre resists Sunsteel Strike and threatens to do major damage to Necrozma-DM, though it must be wary of Photon Geyser or Tera Water.</p> <p><strong>Ting-Lu</strong>: While unable to seriously threaten Necrozma-DM, Ting-Lu can take boosted hits from Necrozma-DM and use Whirlwind or weaken it with Ruination.</p> <p><strong>Necrozma-DM</strong>: Necrozma-DM is one of its own biggest obstacles. Variants without Earthquake are completely walled by opposing Necrozma-DM, and even those with Earthquake can lose to Tera Water.</p>",
    "sets": {
      "Bulky Dragon Dance": {
        "description": "<p>Necrozma-DM is an incredibly potent sweeper, leveraging its stellar defensive profile to set up on a plethora of common options like Arceus, Zacian-C, and Eternatus. Sunsteel Strike is the preferred STAB move over alternative options like Photon Geyser and Iron Head for its combination of power and coverage, which is especially notably against Ting-Lu, Calyrex-S, and defensive Arceus formes. Earthquake is the go-to coverage move for its ability to hit Miraidon, Zacian-C, and opposing Necrozma-DM for major damage. Entry hazard-stacking teams may get more use from Knock Off, which crucially removes Ho-Oh's and opposing Necrozma-DM's Heavy-Duty Boots while having the helpful property of always OHKOing Calyrex-S. On more offensive teams, Necrozma-DM can opt to run Stone Edge to lure in and OHKO Ho-Oh, though this leaves it floundering against opposing Necrozma-DM. Heavy-Duty Boots provides unrivaled longevity in the face of Ting-Lu's ever-present Spikes, allowing Necrozma-DM to switch in repeatedly without compromising its defensive presence or ability to set up. Tera Fire grants a crucial resistance Fire-type attacks, stymying Choice Scarf Koraidon's revenge killing attempts and turning offensive Ho-Oh into setup fodder; it additionally blocks Will-O-Wisp from the likes of Arceus-Ground and Arceus-Water. Tera Water resists Fire-type attacks too, resists Kyogre's powerful STAB moves, rids Necrozma-DM of its Ground-type weakness, and maintains its Steel-type resistance, letting it always beat opposing Necrozma-DM and defeat Dragon Dance Arceus-Ground one-on-one once boosted; though, this leaves it floundering against Ho-Oh and Will-O-Wisp Arceus formes. Tera Steel is a niche option on offensive sets with Stone Edge, boosting their power to the stratosphere and potentially letting them 2HKO opposing Necrozma-DM at +2, though they need prior chip damage against defensive Necrozma-DM, and it doesn't provide any defensive utility beyond removing their Ghost-type weakness. The given EV spread lets Necrozma-DM outspeed uninvested base 90 Speed Pokemon, non-Choice Scarf Calyrex-S after two Dragon Dances, and Adamant-natured Choice Scarf Koraidon after using Dragon Dance three times; the remaining EVs are put into Defense and used with an Impish nature to maximize its defensive prowess, allowing for ridiculous feats like letting it survive +1 Dragon Dance Arceus-Ground's Earthquake and stalling out Choice Scarf Koraidon's Flare Blitz due to Moonlight's increased healing in sun. Offensive teams can forgo the additional defensive investment for an offensive spread with an Adamant nature to markedly improve damage against Ting-Lu and defensive Arceus formes, though this results in considerably reduced bulk, which is especially noticeable against Koraidon.</p> <p>Few teams bar hyper offense don't appreciate Necrozma-DM's immense versatility as a powerful wincon. On more offensive teams, it works in tandem with other physical wallbreakers like Koraidon, Ho-Oh, Zacian-C, and Dragon Dance Arceus-Ground to overwhelm physical walls. Balance teams benefit greatly from Necrozma-DM's defensive utility—especially against Zacian-C—and provide it with a defensive backbone that enables it to bide its time until it can set up and end the game. Ting-Lu is Necrozma-DM's single best partner on any because it provides refuge from Calyrex-S and Miraidon seeking to take advantage of Necrozma-DM, and the Spikes it easily stacks hinder attempts to revenge kill Necrozma-DM from Choice Scarf Koraidon and Calyrex-S while wearing down common checks to Necrozma-DM in Ting-Lu, Arceus-Ground, and Arceus-Water. Ho-Oh is another wonderful partner for Necrozma-DM, checking Koraidon and Calyrex-S for it; in exchange, Necrozma-DM can switch into Eternatus and deter Choice Scarf Koraidon from using Outrage. Necrozma-DM loves to be paired with powerful wallbreakers like Calyrex-S, Koraidon, and Choice Band Ho-Oh, as these Pokemon excel at beating teams down into position for Necrozma-DM to checkmate them. Calyrex-S supports Necrozma-DM by doing major damage to Ho-Oh with its Choice Specs- or Nasty Plot-boosted attacks and weakening Ting-Lu, which can comfortably take hits from Necrozma-DM and phaze it out with Whirlwind. Koraidon can weaken defensive Arceus formes and force Ho-Oh to Terastallize into the Fairy-type from the threat of being 2HKOed by its Dragon-type moves and thus become weak to Sunsteel Strike. Ho-Oh is the nemesis of any Necrozma-DM lacking Stone Edge, as it can comfortably take most of its attacks and respond with the threat of a Sacred Fire burn or phazing with Whirlwind. As a result, having strong counterplay to Ho-Oh, such as Arceus-Water, Eternatus, or Miraidon, is necessary due to Ho-Oh's propensity for staying healthy. Defensive Arceus-Ground and Arceus-Water are other troublesome defensive checks to Necrozma-DM, so switch-ins to them, such as Ting-Lu or Ho-Oh for the former and Eternatus or Miraidon for the latter, are crucial. Kyogre, though wary of Knock Off or Tera Water, can often take advantage of Necrozma-DM to launch its powerful Water-type attacks, necessitating a Pokemon that can pivot into it like Eternatus, Miraidon, or Koraidon.</p>"
      },
      "Offensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 584685, "username": "Glory"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Zacian-Crowned": {
    "overview": "<p>Thanks to Zacian-C's high base Attack backed by Intrepid Sword, it cements itself as one of the strongest physical attackers in the metagame. Its excellent typing allows it to block Dragon-type attacks from Eternatus, Koraidon, and Miraidon; resist Extreme Speed from Arceus; and be immune to Toxic Spikes. However, Zacian-C is checked by multiple defensive Pokemon, most notably Necrozma-DM and Arceus-Ground, as they can take its attacks and force it to switch out. Furthermore, Calyrex-S is a huge threat because of its high Special Attack and Speed, being able to KO Zacian-C after minor chip damage. Choice Scarf Koraidon is also a threat, as it can OHKO Zacian-C with Flare Blitz.</p>",
    "comments": "<h3>Other Options</h3> <p>Substitute is a niche option that can take advantage of Eternatus and Pokemon Choice-locked into Dragon-type moves, allowing Zacian-C to set up without interruption. Substitute isn't the best choice for Zacian-C though, as losing important coverage moves like Wild Charge and Crunch lets it get walled by checks such as Necrozma-DM, Ho-Oh, and defensive Arceus formes. Tera Fire is a niche option that grants Zacian-C an immunity to burn from Ho-Oh and defensive Arceus formes such as Arceus-Water and Arceus-Fairy while also allowing it to resist Ho-Oh's Sacred Fire and Koraidon's Flare Blitz. However, Tera Fire makes Zacian-C weak to Stealth Rock, allowing Choice Scarf users such as Koraidon and Calyrex-S and priority users in Arceus to revenge kill it with ease. An alternate EV spread of 104 HP / 252 Atk / 152 Spe allows Zacian-C to outspeed both Koraidon and Miraidon, with the remaining EVs being put into HP, allowing it to survive an Earthquake from Necrozma-DM at -1 and making it harder for Calyrex-S to revenge kill it. However, this EV spread might struggle against opposing Zacian-C with maximum Speed and offensive Necromza-DM, so it is not always the best choice.</p> <h3>Checks and Counters</h3> <p><strong>Necrozma-DM</strong>: Physically defensive Necrozma-DM is one of the most common checks to Zacian-C, as it resists both of Zacian-C's main STAB moves and has moves like Earthquake and Sunsteel Strike that can potentially 2HKO it back.</p> <p><strong>Revenge Killers</strong>: Calyrex-S, as well as Choice Scarf users such as Koraidon and Miraidon, are able to outspeed Zacian-C. Calyrex-S can brute force its way through Zacian-C with Astral Barrage after minor chip damage or a Close Combat Special Defense drop, Koraidon is able to OHKO Zacian-C with Flare Blitz, and Miraidon 2HKOes Zacian-C with Electro Drift.</p> <p><strong>Defensive Arceus Formes</strong>: Bulky Arceus formes such as Arceus-Water and Arceus-Ground can be a problem for Zacian-C, as they can take hits from it and reliably heal themselves with Recover while also threatening it with Judgment or Will-O-Wisp.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Play Rough OHKOes Koraidon and Miraidon and 2HKOes Ting-Lu. Alternatively, Behemoth Blade is another high damage STAB move that has 100% accuracy and can hit most Pokemon for neutral damage, such as Arceus-Ground and Eternatus, while doing super effective damage to Arceus-Fairy. Wild Charge hits Ho-Oh, Kyogre, and Arceus-Water, OHKOing or doing major damage to them after Zacian-C uses Swords Dance. Crunch and Close Combat deal with Necrozma-DM, with the former also threatening Calyrex-S and the latter hitting Ting-Lu for Behemoth Blade sets and OHKOing Arceus. Tera Dark boosts Crunch's damage to let it break through Necrozma-DM more easily and prevents Zacian-C from getting 2HKOed by Calyrex-S's Astral Barrage. Tera Fighting increases the damage of Close Combat, which lets Zacian-C OHKO defensive Arceus formes at +3.</p> <p>Zacian-C struggles with Calyrex-S, which outspeeds it and threatens it with Astral Barrage, so Arceus and special walls such as Ho-Oh and Ting-Lu are needed to help check Calyrex-S. It is also weak to Choice Scarf users such as Koraidon and Calyrex-S, so it appreciates teammates that can either outspeed or outprioritize threats, such as Extreme Killer Arceus, Choice Scarf Koraidon, and Choice Scarf Calyrex-S. Bulky walls such as various Arceus formes can also help with Koraidon. Due to Necrozma-DM's high Defense stat, Zacian-C often struggles to break through it, so special attackers like Calyrex-S, Miraidon, Kyogre, and Calm Mind Arceus-Ground are good options to help deal with it. Multiple layers of Spikes significantly hinder Zacian-C's longevity, making it easier for revenge killers to KO it, so Taunt users like Deoxys-S on hyper offense and various Arceus formes can be useful to have on the team. Other good teammates include physical attackers such as Dragon Dance Arceus-Ground, Necrozma-DM, and Swords Dance Koraidon because they can help wear down the checks they share with Zacian-C, allowing them to break through walls more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604042, "username": "Cutecat1122"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 631210, "username": "Adhi"}, {"user_id": 584685, "username": "Glory"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Eternatus": {
    "overview": "<p>Eternatus is a versatile Pokemon that is mostly used on passive balance and bulky offense teams due to its access to Toxic and Toxic Spikes. Thanks to its unique typing and great defensive stats, it is a reliable answer to Kyogre, Ho-Oh, Arceus-Water, and Arceus-Fairy and can absorb Toxic Spikes set by opposing Glimmora, Eternatus, and Gliscor. With the lack of good entry hazard control options and Poison-types, it can also quickly wear down opposing teams, often forcing them to use Tera Poison to remove Toxic Spikes. However, it is weak to other Dragon-types such as Miraidon and Koraidon because they can outspeed and OHKO it, and it typically struggles with Steel-types such as Zacian-C and Necrozma-DM, which can easily set up on it if it's lacking a Fire-type attack. Additionally, other strong physical attackers such as Calyrex-I and Arceus-Ground can force Eternatus out with their super effective STAB moves, so a lot of defensive support is necessary when running it.</p>",
    "comments": "<h3>Other Options</h3> <p>Life Orb Eternatus can be a decent wallbreaker, but it is easily chipped down by the combination of recoil from Life Orb and entry hazard damage, and despite running Life Orb, it's unable to do good damage to Ting-Lu. Reflect can be used in conjunction with Toxic to allow Eternatus to beat Ting-Lu, offensive Ho-Oh, and Extreme Killer Arceus one-on-one, and it can also help Eternatus's teammates take hits better. Other attacks like Sludge Bomb to threaten Hatterene and Arceus-Fairy and Shadow Ball to more immediately threaten Calyrex-S can also be used. Haban Berry + Draco Meteor can also be helpful to let Eternatus survive an Outrage or Draco Meteor from Koraidon or Miraidon and OHKO it back without any investment, but this leaves Eternatus vulnerable to Spikes. Dragon Tail can be used to phaze anything that tries setting up on Eternatus like Tera Poison Calm Mind Kyogre or Arceus-Fairy. Fire Spin is sometimes used to trap walls such as Blissey and bulky Arceus formes as well as Kyogre Choice-locked into a move like Ice Beam against Tera Steel Eternatus, but both Dragon Tail and Fire Spin are incredibly niche options, as they do not get many opportunities to be used. Most of the aforementioned options also require dropping Toxic Spikes, which is much more valuable in most scenarios.</p> <h3>Checks and Counters</h3> <p><strong>Tera Poison Users</strong>: Tera Poison on Ting-Lu and defensive Arceus formes gives them an immunity to Toxic and Toxic Spikes, making it difficult to spread poison and break through teams, as they remove Toxic Spikes and take very little damage from Dynamax Cannon. Calm Mind Kyogre likes to run Tera Poison in conjunction with Thunder Wave to use Eternatus as setup fodder. Calm Mind Arceus-Fairy can similarly turn Eternatus into setup fodder by running this Tera type.</p> <p><strong>Steel-types</strong>: Without Fire Blast or Flamethrower, Eternatus is walled by Steel-types such as Zacian-C, Necrozma-DM, and Kingambit, as they take little to no damage from Dynamax Cannon and are immune to poison.</p> <p><strong>Dragon-types</strong>: Faster Dragon-types like Miraidon and Koraidon can easily threaten and force out Eternatus with their powerful Dragon-type attacks but are unable to safely switch into it.</p> <p><strong>Ground-type Coverage</strong>: Earthquake from offensive Ho-Oh, Dragon Dance Arceus-Ground, and Ting-Lu as well as Ground-type Judgment from the aforementioned Arceus-Ground can threaten Eternatus for large amounts of damage and force it out.</p> <p><strong>Calyrex-S</strong>: Calyrex-S can threatren Eternatus with its powerful Psychic-type attacks or lock it into Toxic Spikes or Recover with Encore and can threaten to sweep if not dealt with properly.</p> <p><strong>Calyrex-I</strong>: Calyrex-I can OHKO Eternatus with Glacial Lance and become extremely threatening if it sets up Trick Room.</p> <p><strong>Hatterene</strong>: Hatterene is able to completely wall Eternatus by blocking status moves, bouncing back Toxic Spikes, and being immune to Dynamax Cannon; it can also paralyze Eternatus with Nuzzle but must be wary of coverage like Sludge Bomb or sun-boosted Fire-type attacks.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Eternatus is an excellent blanket check to Kyogre, defensive Ho-Oh, Arceus-Water, and Arceus-Fairy that pressures opposing teams with Toxic Spikes and Toxic. Toxic Spikes is one of Eternatus's greatest assets, as it weakens the opposing defensive core and especially overwhelms hyper offense teams because it quickly chips down their sweepers due to them not having a way to remove it. Fire Blast or Flamethrower can be used instead to threaten Steel-types such as Zacian-C, Necrozma-DM, and Kingambit, with the former guaranteeing a 2HKO on Zacian-C and having a chance to OHKO it in sun and the latter providing more consistent damage at the cost of reduced firepower. However, this means dropping Toxic Spikes, which makes spreading poison much more difficult. Dynamax Cannon is Eternatus's preferred STAB move, but Draco Meteor can be run instead, trading consistency for the ability to OHKO both Koraidon and Miraidon. The given EV spread allows Eternatus to outspeed maximum Speed Kyogre and survive offensive Arceus-Ground's Earthquake from full HP. Tera Fairy allows Eternatus it to block Miraidon's Draco Meteor and Koraidon's Scale Shot or Outrage in an emergency but makes it more vulnerable to Steel-type attacks from Zacian-C and Kingambit and Flare Blitz from Koraidon. Tera Steel gives it valuable resistances to Kyogre's Ice Beam, Calyrex-I's Glacial Lance, Arceus's Extreme Speed, Arceus-Fairy's Judgment, and Psychic-type moves from Calyrex-S. Although, using Tera Steel makes Eternatus weak to Fire-type attacks such as Flare Blitz and Sacred Fire from Koraidon and Ho-Oh, respectively, as well as Koraidon's Low Kick and Zacian-C's Close Combat. Tera Dark is another option, albeit niche, that may be used to improve a team's matchup against Calyrex-S, but it makes Eternatus weak to Arceus-Fairy's Judgment and Koraidon's Low Kick. All three Tera types also reduce Eternatus's ability to check Kyogre and Ho-Oh, so the user must be wary before committing to Terastallizing.</p> <p>Eternatus fits on more passive balance and bulky offense teams that appreciate its ability to act as both a Toxic Spikes absorber and spreader that can take on threats like Kyogre, Ho-Oh, Arceus-Water, and Arceus-Fairy. Koraidon and Miraidon are both excellent partners, as the former can threaten Steel-type Pokemon, and the latter helps to break bulky Ground-types such as Ting-Lu and Arceus-Ground. In return, Eternatus helps check Kyogre and puts their checks, such as bulky Arceus formes and Ting-Lu, on a timer with poison. They both also appreciate Eternatus's ability to soak up status effects, and Koraidon in particular enjoys Eternatus reliably switching into defensive Arceus formes like Arceus-Fairy and Ho-Oh. Eternatus is vulnerable to Koraidon and Miraidon, which force it out with strong Dragon-type attacks, so Pokemon that can check them such as Ho-Oh, Arceus-Fairy, and Ting-Lu also make good teammates. Ting-Lu also helps Eternatus by switching into Calyrex-S, which can deal massive damage to Eternatus with its Psychic-type moves or lock it into Toxic Spikes or Recover via Encore. If Eternatus isn't running Fire Blast or Flamethrower, it is incapable of hitting Steel-types like Zacian-C, Necrozma-DM, and Kingambit, so Ground-types that force them out like Arceus-Ground and Landorus-T are also recommended. Arceus-Water can check the aforementioned Steel-types and Koraidon, as well as switching into Calyrex-I, Arceus-Ground, and Extreme Killer Arceus. Arceus helps to check Calyrex-S and benefits from Eternatus weakening the opposing defensive structure so it can clean up late-game. Eternatus also struggles with Hatterene, as it blocks Toxic and Toxic Spikes and is immune to Dynamax Cannon, so Pokemon that can beat Hatterene like Ho-Oh and Arceus-Ground are appreciated. Although, Fire Blast under sun can 2HKO Hatterene. Setup sweepers like Scale Shot Koraidon, Dragon Dance Arceus-Ground, and Swords Dance Zacian-C can easily force Eternatus out and set up on it, so reliable checks to them like defensive Arceus-Fairy and Arceus-Water are recommended.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 660324, "username": "GigaBytes7"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 631210, "username": "Adhi"}, {"user_id": 487990, "username": "Swas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Calyrex-Ice": {
    "overview": "<p>Calyrex-I is a niche yet powerful pick, with its spectacular Attack, Glacial Lance, and Swords Dance allowing it to break through even the sturdiest physical walls seen on teams, such as Ho-Oh and Arceus-Fairy. Calyrex-I can set up Trick Room to compensate for its Speed, and its ability allows it to quickly snowball out of control. Calyrex-I suffers from a significant opportunity cost, as due to in-game restrictions allowing only one Calyrex forme per team, Calyrex-I is overshadowed by the metagame-defining Calyrex-S.</p>",
    "comments": "<h3>Other Options</h3> <p>Calyrex-I could opt to use a more niche option in Choice Band or Life Orb, which can help break through defensive Arceus formes, like Arceus-Fairy and Arceus-Water, and Ho-Oh, paired with Tera Ice to break easier, though non-Heavy-Duty Boots Calyrex-I suffers from an entry hazard weakness. Mental Herb can be used to block Taunt by various Arceus formes and pivot Miraidon, and Lum Berry can be used to heal a Sacred Fire or Will-O-Wisp burn, though both items leave Calyrex-I suffering suffer from the aforementioned hazard weakness. Seed Bomb is an alternative to High Horsepower to break through Arceus-Water and Kyogre more easily, though it struggles with Necromza-DM and Zacian–C.</p> <h3>Checks and Counters</h3> <p><strong>Arceus-Water</strong>: A Glacial Lance resistance combined with great physical bulk, reliable recovery, Will-O-Wisp to severely cripple Calyrex-I, and a super effective Judgment against Tera Fire Calyrex-I, Arceus-Water is an almost perfect wall to Calyrex-I.</p> <p><strong>Dondozo</strong>: Dondozo resists Glacial Lance, neutralizes Calyrex-I's Attack boosts with Unaware, and has respectable physical bulk to wall Calyrex-I.</p> <p><strong>Skeledirge</strong>: Though it doesn't have the best physical bulk, Skeledirge's Glacial Lance resistance, Unaware, and Will-O-Wisp make it a great wall against Calyrex-I even though it's weak to High Horsepower.</p> <p><strong>Protect Users</strong>: Protect users stall out turns in Trick Room and make Calyrex-I significantly less threatening, allowing their teammates to outspeed and OHKO Calyrex-I.</p> <p><strong>Taunt Users</strong>: Taunt users block Calyrex-I from setting Trick Room, severely crippling its sweeping ability and allowing their teammates such as Calyrex-S and Koraidon threaten Calyrex-I with an OHKO.</p>",
    "sets": {
      "Swords Dance Trick Room Sweeper": {
        "description": "<p>Calyrex-I plays the role of a Swords Dance sweeper, leveraging its low Speed and high Attack to its advantage and using Trick Room to outspeed any other Pokemon in the metagame. Its tremendous Attack allows it to cleave through common offensive Pokemon, such as Koraidon, Miraidon, and Calyrex-S under Trick Room. Multiple physically defensive Pokemon such as Ho-Oh, Arceus-Fairy, defensive variants of Arceus Ground, and Eternatus either take massive damage or get KOed by a Swords Dance-boosted Glacial Lance, made worse especially when combined with Tera Fire blocking Will-O-Wisp and Sacred Fire burns. Once Trick Room fades away, Calyrex-I is very prone to getting revenge killed due to its poor defensive typing and Speed. Glacial Lance is great at forcing Terastallization from Pokemon such as Tera Water Arceus-Fairy and Tera Water Landorus-T, which opens up holes for teammates such as Choice Scarf Koraidon and pivot Miraidon to exploit, as Arceus-Fairy and Ho-Oh would lack the ability to Terastallize. High Horsepower allows Calyrex-I to target the Steel-type Pokemon in the tier, such as Necrozma-DM and Zacian-C. Calyrex-I's EV spread maximizes its Attack and breaking potential and runs minimum Speed to Speed tie opposing Calyrex-I under Trick Room. Calyrex-I often consumes Terastallization, potentially hindering its teammates.</p> <p>Miraidon and Arceus benefit from Calyrex-I's presence, as it annihilates Ground-types, Miraidon's main checks in the tier, allowing Miraidon to spam unresisted Electro Drifts to deal massive damage to team structures. Arceus can clean a game when some of its main checks, like defensive Ho-Oh, defensive Arceus formes, Zacian-C, and Necrozma-DM, are chipped by Calyrex-I, leaving a gaping hole in a team that Arceus can exploit. Calyrex-I struggles with Pokemon such as Arceus-Water, Skeledirge, and Dondozo, being completely unable to break them in most scenarios. Calyrex-I benefits from Pokemon such as Miraidon and Kyogre, which break through the aforementioned checks, and Kyogre has great synergy with Trick Room due to its relatively low Speed stat. Ting-Lu and Eternatus can help defensively back Calyrex-I, as Eternatus can switch into defensive Arceus formes, bar defensive Arceus-Ground, and defensive Ho-Oh with ease, setting up Toxic Spikes and Toxic to help enable a Calyrex-I sweep. Miraidon and Calyrex-S can easily exploit Calyrex-I once Trick Room is over, so Ting-Lu helps by checking Miraidon and Calyrex-S, enabling Calyrex-I to come back later in the game and set up Trick Room.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 554093, "username": "RL"}, {"user_id": 631210, "username": "Adhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Calyrex-Shadow": {
    "overview": "<p>Calyrex-S is the most prominent, centralizing threat in Anything Goes by virtue of its nigh-unmatched Speed tier and variety of offensive options. Astral Barrage shreds through neutral targets, and Calyrex-S is able to overcome its defensive checks by using its broad selection of coverage, Tera types, utility, and item options. Additionally, thanks in part to its ability As One, Calyrex-S can snowball late-game when its checks are worn down. However, Calyrex-S's bulk is rather unimpressive, limiting its ability to switch in aggressively or set up on defensive Pokemon. Calyrex-S also struggles early-game against Pokemon resistant to Ghost, such as Arceus, Arceus-Dark, and Ting-Lu, as they are able to halt its momentum by switching in to Astral Barrage. Additionally, Ho-Oh's high Special Defense and access to Regenerator allow it to pivot into Choice item variants of Calyrex-S.</p>",
    "comments": "<h3>Other Options</h3> <p>Baton Pass can be fit over Psychic on Choice Scarf sets, allowing Calyrex-S to pivot on a predicted switch to one of its checks and give way to wallbreakers such as Kyogre, Koraidon, and Zacian-C that can take advantage of them. Psychic can also be forgone in favor of Nasty Plot, allowing Calyrex-S to set up after using Trick. This can be used to break through checks like Ting-Lu, Arceus, and Ho-Oh later in the game and take advantage of entry hazard leads such as Ribombee and Glimmora. Nasty Plot sets can use Draining Kiss in tandem with Tera Fairy, granting an immunity to Choice Scarf Koraidon's Outrage as well as a method to break through Ting-Lu while maintaining HP.</p> <h3>Checks and Counters</h3> <p><strong>Ting-Lu</strong>: Ting-Lu can comfortably switch in on Calyrex-S and set Spikes layers. Ting-Lu is reliant on Leftovers for recovery, however, and therefore cannot switch in on Calyrex-S repeatedly. Moreover, if Calyrex-S Terastallizes, Ting-Lu loses the ability to OHKO it with Payback.</p> <p><strong>Arceus</strong>: In addition to having an immunity to Ghost-type attacks, Arceus can recover off damage from Calyrex-S's coverage options and OHKO it with Shadow Claw. Furthermore, Arceus is able to use Choice item variants of Calyrex-S as setup fodder for Swords Dance. However, Choice item variants of Calyrex-S can cripple Arceus with Trick, while Encore variants can lock it into a status or Normal-type move.</p> <p><strong>Ho-Oh</strong>: Ho-Oh is able to pivot into Astral Barrage and heal using Recover or Regenerator. It is worth noting, however, that bulky variants of Ho-Oh cannot OHKO Calyrex-S from full HP. Additionally, after a Nasty Plot, damage boosts from Life Orb, Tera Stellar, or Tera Ghost can allow Calyrex-S to OHKO Ho-Oh.</p> <p><strong>Revenge Killers</strong>: Calyrex-S lacking Choice Scarf are vulnerable to to revenge killers such as Choice Scarf variants of Koraidon and opposing Calyrex-S. Additionally, Giratina-O is able to OHKO Calyrex-S with Shadow Sneak, and if Calyrex-S Terastallizes into a non-Ghost type, it will lose its immunity to Arceus's Extreme Speed.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Calyrex-S is a phenomenal speed control option on balance and bulky offense teams. Its Speed stat eclipses that of other Choice Scarf users, such as Koraidon and Miraidon; moreover, it is able to reliably revenge kill +1 Scale Shot Koraidon, setting it apart from its aforementioned competitors. As One allows Calyrex-S to snowball in endgame scenarios. Grass Knot weakens Ting-Lu, which can otherwise switch in and use Spikes. Psychic lets Calyrex-S OHKO Koraidon while also dealing significant chip damage to bulky Arceus. Lastly, Trick cripples Calyrex-S's main defensive checks in Ting-Lu, Arceus, and Ho-Oh, which its teammates can take advantage of. Tera Ghost furthers the strength of Astral Barrage, which secures KOs on weakened targets such as Miraidon and Zacian-C and allows Calyrex-S to 2HKO Ho-Oh. Alternatively, Calyrex-S can opt for Tera Grass in order to 2HKO Ting-Lu with Grass Knot and OHKO both Kyogre and Arceus-Ground after minimal chip damage.</p> <p>Most forms of balance and bulky offense should consider adding Choice Scarf Calyrex-S, as it provides teams with a reliable option to revenge kill Scale Shot Koraidon. Calyrex-S being a team's Choice Scarf user can give Koraidon the freedom to use a different item. Calyrex-S synergizes well with Pokemon that can take advantage of Astral Barrage switch-ins like Arceus, Arceus-Dark, and Ting-Lu. Powerful wallbreakers such as Koraidon, Zacian-C, and Kyogre are capable of this. Partners that can wear down Ting-Lu throughout the game, such as Eternatus and Miraidon, can help ease the burden on Calyrex-S. Because Ho-Oh can pivot into Calyrex-S's moves, wallbreakers such as Swords Dance Koraidon, offensive Ho-Oh, and Necrozma-DM that can wear Ho-Oh down serve as excellent teammates. Calyrex-S appreciates support from entry hazard setters, namely Ting-Lu and Eternatus, in order to secure KOs late-game. Arceus-Water is a reliable defensive switch-in to Arceus and Ho-Oh, and it can stop any offensive momentum they gain at Calyrex-S's expense.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Calyrex-S is an excellent wallbreaker, independently breaking through most of its usual checks with accurate prediction. Grass Knot most importantly 2HKOes Ting-Lu, as well as pressuring neutral targets like Arceus and OHKOing Arceus-Water and Arceus-Ground after entry hazard damage. Psychic 2HKOes Arceus, while Psyshock 2HKOes offensive Ho-Oh, has a better chance of OHKOing Eternatus, and hits Pokemon such as Blissey. Trick + Choice Specs debilitates Calyrex-S's checks like Ho-Oh, Ting-Lu, and Arceus by removing the longevity their items grant them and forcing them to attack. Tera Ghost allows Astral Barrage to 2HKO Ting-Lu with less chip damage, OHKO Ho-Oh with an As One boost, and OHKO Necrozma-DM with a neutral Tera type, in addition to 2HKOing Ho-Oh and defensive Arceus formes after Calyrex-S loses its Choice Specs because of Trick. Tera Grass gives Grass Knot a good chance of OHKOing Ting-Lu after hazard damage and lets it 2HKO Arceus; Tera Grass also grants Calyrex-S a resistance to Dragon Dance Arceus-Ground's Earthquake. Tera Normal prevents revenge killing attempts from opposing Calyrex-S. All three Tera types also allow Calyrex-S to survive attacks like Ting-Lu's Payback and Arceus's Shadow Claw, though the latter two make it vulnerable to Arceus's Extreme Speed.</p> <p>Calyrex-S is best used on balance and bulky offense teams, where it can pressure various defensive Pokemon and rely on its teammates to deal with revenge killers. Koraidon can threaten Ting-Lu and Arceus for Calyrex-S and use U-turn to safely bring it in against Pokemon it threatens like Arceus-Water and Arceus-Ground; additionally, the pair can wear down Ho-Oh for each other. Similarly, Zacian-C and Calyrex-S can deal with each other's checks and overwhelm Ho-Oh together. Kyogre threatens Ting-Lu and Ho-Oh for Calyrex-S, which can pressure Eternatus for it. Necrozma-DM appreciates Calyrex-S weakening Ting-Lu and Ho-Oh and threatening its checks like Arceus-Water and Arceus-Ground; in return, it can somewhat deal with Arceus and potentially lure in and KO Ho-Oh with Stone Edge. Ho-Oh can switch into Arceus, Choice Scarf Calyrex-S, and Ting-Lu, and Calyrex-S can deal with two of Ho-Oh's primary checks in Eternatus and Arceus-Water. Ting-Lu can also check Choice Scarf Calyrex-S, as well as wearing foes down into Calyrex-S's KO range via Spikes, which it potentially trades with opposing Ting-Lu. Miraidon and Calyrex-S can weaken Ting-Lu for each other, and Miraidon can switch into and threaten Ho-Oh. Defensive Arceus formes—namely Arceus-Water, Arceus-Ground, and Arceus-Fairy—can check Choice Scarf Koraidon and Arceus, and the former can also deal with Ho-Oh.</p>"
      },
      "Tera Fairy Nasty Plot": {
        "description": "<p>Tera Fairy Calyrex-S is one of the most threatening setup sweepers on hyper offense and offense teams that trades immediate pressure and firepower for the ability to slowly overwhelm and snowball through opposing teams. Tera Fairy removes Calyrex-S's weakness to Ghost- and Dark-type moves like Extreme Killer Arceus's Shadow Claw, Giratina-O's Shadow Sneak, Ting-Lu's Payback, and Kingambit's Sucker Punch while also making it immune to Koraidon's Outrage and Scale Shot. Draining Kiss and Leftovers allow Calyrex-S to out-heal damage from Ting-Lu's Ruination and Arceus's Extreme Speed after a Nasty Plot and Terastallization, simultaneously inflicting heavy damage to both. Astral Barrage enables near-perfect coverage with Draining Kiss, hitting Steel- and Fire-types like Necrozma-DM, Zacian-C, and Ho-Oh for massive damage, notably OHKOing the former two at +2. Taunt prevents Ting-Lu, Ho-Oh, and Mandibuzz from phazing Calyrex-S by Whirlwind and Arceus from setting up Swords Dance on Calyrex-S. It also stops status spreaders like Thunder Wave Arceus-Fairy, Toxic Eternatus, and Toxic Mandibuzz from crippling Calyrex-S with paralysis and poison, letting Calyrex-S set up freely on the latter two with Tera Fairy. The EV spread lets Calyrex-S survive Adamant Choice Scarf Koraidon's Flare Blitz from full HP while sun is up, and maximum Speed investment allows Calyrex-S to outspeed Zacian-C and speed tie with opposing Calyrex-S. However, this set is overly reliant on Terastallization and setup to break past checks like Ting-Lu, Arceus, and Mandibuzz, as it cannot do significant damage to them without Terastallizing due to non-STAB Draining Kiss's low Base Power.</p> <p>Tera Fairy Calyrex-S fits primarily on hyper offense teams where it can utilize dual screens to set up safely. Thus, Grimmsnarl is an excellent partner for Calyrex-S, providing dual screens support with Prankster safely bringing in Calyrex-S with Parting Shot. As Calyrex-S is not holding Heavy-Duty Boots, it is prone to entry hazards. Glimmora helps to patch this weakness by clearing entry hazards via Mortal Spin and also switching in to Choice Scarf Koraidon's Flare Blitz, Arceus's Shadow Claw, and Ho-Oh's Sacred Fire while setting up Toxic Spikes to help Calyrex-S wallbreak easier. Similarly, Hatterene's Magic Bounce prevents Spikes and Toxic Spikes from the aforementioned hazard setters like Ting-Lu, Eternatus, Glimmora, and Gliscor. Hatterene also helps to maintain the momentum with Baton Pass, bringing in Calyrex-S safely and also passing on Calm Mind boosts. Due to the reliance on Terastallization to properly function as a sweeper, Calyrex-S appreciates teammates that can punch holes early-game without needing to Terastallize such as Life Orb Miraidon, Swords Dance Zacian-C, Arceus, Swords Dance Koraidon, and Dragon Dance Arceus-Ground. In particular, Miraidon heavily pressures Ting-Lu and threatens Ho-Oh, paving the way for Calyrex-S to sweep late-game. Tera Normal Arceus with Mental Herb also ignores Taunt and threatens an OHKO on Calyrex-S at +2 with Extreme Speed if Reflect is not up. As such, Zacian-C is a great partner that forces Arceus out due to the latter fearing boosted attacks from Zacian-C. Calyrex-S is also unable to OHKO bulkier variants of Kyogre at +2, and Kyogre deals huge damage to Calyrex-S back with rain-boosted Origin Pulse or cripples it with Thunder Wave. Choice Scarf sets can outspeed and OHKO Calyrex-S with Water Spout, hence Koraidon that can switch in on Kyogre's Water-type attacks is a good teammate. Similarly, Miraidon can take a few hits from Kyogre and is immune to Thunder Wave. However, Ice Beam is capable of 2HKOing both. Calyrex-S is vulnerable to getting reverse swept by Ditto and gets forced out by opposing Choice Scarf Calyrex-S; therefore, Arceus makes up for a valuable partner by switching in to Astral Barrage. In return, Calyrex-S can take advantage of common switch-ins to Arceus like Arceus-Fairy, Arceus-Water, and Alomomola to set up Nasty Plot.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Nasty Plot Calyrex-S is a superb wallbreaker and sweeper that provides a ton of incredible utility by virtue of its nigh unmatched Speed tier and immense power, keeping an armada of different threats, most notably Necrozma-DM and Koraidon, in check. Grass Knot is crucial coverage that hits Ting-Lu hard, which would otherwise comfortably wall Calyrex-S, and deals extra damage to Arceus-Ground, Arceus-Water, and Kyogre. Psychic OHKOes Koraidon, 2HKOes Eternatus, and is Calyrex-S's strongest option against Arceus. Alternatively, Encore enables Calyrex-S to aggressively switch in on any attempts to heal or set up from nearly any relevant Pokemon in the metagame, generating free turns to use Nasty Plot or fire off powerful attacks. Calyrex-S can also run Psyshock as its strongest move against Eternatus—OHKOing after a boost from As One—and hits Calm Mind users like Kyogre or Arceus-Ground; it's also Calyrex-S's best move for niche walls like Blissey and Clodsire. Heavy-Duty Boots allows Calyrex-S to repeatedly switch in with impunity and bludgeon its checks until it can break through them. Life Orb is an alternative on hyper offense teams that gives Calyrex-S ludicrous power, letting it OHKO supposed answers like Ho-Oh and Ting-Lu after a Nasty Plot. Tera Stellar boosts Calyrex-S's power just enough to hit multiple important thresholds once boosted, OHKOing Ho-Oh and offensive Arceus, as well as Ting-Lu after two layers of Spikes. Sets lacking a Psychic-type attack can run Tera Ghost to 2HKO Eternatus and Ho-Oh while the lessened Ghost- and Dark-type weaknesses enables Calyrex-S to survive Arceus's Shadow Claw and Ting-Lu's Payback. Tera Normal is an option on Life Orb variants to turn the tables on Giratina-O and opposing Choice Scarf Calyrex-S, as these sets do not need the additional firepower provided by an offensive Tera, albeit at the cost of becoming vulnerable to Arceus's Extreme Speed. Tera Grass allows Calyrex-S to survive a boosted Earthquake from Dragon Dance Arceus-Ground and always OHKO Ting-Lu and offensive Arceus at +2.</p> <p>Nasty Plot Calyrex-S is a potent addition to nearly every kind of team. Balance and bulky offense teams love it for its potency as a wallbreaker that provides immense utility as a revenge killer and by potentially using Encore, whereas it is borderline mandatory on hyper offense due to its unmatched explosivity and Speed. Koraidon is Calyrex-S's best partner on every kind of team, terrifying Arceus and Ting-Lu while amplifying the pressure placed upon Ho-Oh; on bulkier teams, it takes the mantle of being the team's Choice Scarf user that Calyrex-S must forfeit by opting for Nasty Plot, whereas on hyper offense, it backs up Calyrex-S as one of the core setup sweepers and wallbreakers. Ting-Lu is a great partner for its overall immense defensive utility and capability to answer Choice Scarf Calyrex-S, and its Spikes can wear down opposing Ting-Lu and defensive Arceus formes into range for Calyrex-S to KO them. Ho-Oh provides refuge from Choice Scarf Calyrex-S and Koraidon, the most common revenge killers of Calyrex-S, as well as checking Arceus and Ting-Lu. Ho-Oh is a major nuisance for Calyrex-S, so switch-ins to it like Eternatus or Arceus-Water are important to have. On hyper offense, suicide leads like Deoxys-S, Ribombee, and Glimmora can set entry hazards to weaken foes for Calyrex-S and its teammates or—in Ribombee's case—hinder revenge killers.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 487990, "username": "Swas"}, {"user_id": 511181, "username": "Rose"}, {"user_id": 541114, "username": "PrimalKyogre"}, {"user_id": 584685, "username": "Glory"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 584685, "username": "Glory"}, {"user_id": 631210, "username": "Adhi"}, {"user_id": 511624, "username": "Fc"}, {"user_id": 554093, "username": "RL"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 511181, "username": "Rose"}, {"user_id": 523866, "username": "UT"}, {"user_id": 652656, "username": "Gambit"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Skeledirge": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Skeledirge is a good physical wall, acting as an important check to Koraidon, Zacian-C, and Extreme Killer Arceus. It can switch into these powerful Swords Dance sweepers, beating them or halting their sweep. Torch Song allows it to potentially sweep a weakened team late-game. Earth Power is an option that chips Miraidon and Eternatus as well as giving it a super effective hit against Tera Fire Zacian-C and Koraidon. Fairy is the ideal Tera type, giving Skeledirge an immunity to Koraidon's Dragon-type attacks and removing its weaknesses to Ground- and Ghost-type attacks from foes like Arceus-Ground, Calyrex-S, and Giratina-O. Tera Flying is a niche option that further improves its matchup against Arceus-Ground while avoiding super effective Behemoth Blade from Zacian-C. Skeledirge is a good fit on balance teams that appreciate it checking common setup threats and carrying teammates that make up for its shortcomings and bad matchups. Skeledirge is very vulnerable to Miraidon, Kyogre, Calyrex-S, and Arceus-Ground, so it appreciates teammates like Ting-Lu, Eternatus, Wo-Chien, and Giratina-O to handle these powerful attackers. Likewise, Skeledirge pairs well with fast attackers and priority users such as Calyrex-S, Choice Scarf Koraidon, and Extreme Killer Arceus, which can threaten the foes that force Skeledirge out and revenge kill Pokemon it checks if it is overwhelmed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540420, "username": "April"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 584685, "username": "Glory"}, {"user_id": 511181, "username": "Rose"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Garganacl": {
    "comments": "<h3>Other Options</h3> <p>Tera Fairy allows Garganacl to wall Koraidon fully, but since it prevents Garganacl from walling Arceus and Substitute Ho-Oh, this set is not regularly used. Garganacl could also opt to use Curse, increasing the damage of Salt Cure while simultaneously allowing Garganacl to keep up with boosting threats. Yet, the additional Salt Cure damage is inconsequential, and it takes many more turns for Garganacl to do the same amount of damage with Body Press if it were instead using Iron Defense.</p> <h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Special attackers like Kyogre, Miraidon, and Calyrex-S can easily exploit Garganacl's poor special defenses to threaten massive damage.</p> <p><strong>Koraidon</strong>: Koraidon's super effective Low Kick does great damage to Garganacl, forcing it to switch out even after an Iron Defense boost.</p> <p><strong>Knock Off Users</strong>: Knock Off users like Gliscor significantly cripple Garganacl's defensive capabilities, causing it to be much less effective in checking Pokemon like Earthquake Ho-Oh after some entry hazard chip damage.</p> <p><strong>Zacian-C</strong>: Zacian-C's Behemoth Blade, especially in combination with Swords Dance, tears through even boosted Garganacl's HP and forces it to switch out.</p> <p><strong>Necrozma-DM</strong>: Necrozma-DM's Sunsteel Strike, in combination with a move like Dragon Dance or Swords Dance, threatens great damage to Garganacl, forcing it to switch out.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Salt Cure puts a timer on any Pokemon attempting to set up against Garganacl while also breaking offensive Ho-Oh's Substitute and dealing considerable damage to Zacian-C, Giratina-O, and Kyogre that try to switch in. Iron Defense allows Garganacl to keep up with Swords Dance Arceus and also allows it to check Dragon Dance Arceus-Ground after Terastallization. The IronPress combination allows Garganacl to do significant damage to Pokemon like Arceus and anything else that attempts to switch in. Alternatively, Stealth Rock further chips defensive Arceus formes and Choice Scarf users, allowing Garganacl to aid its team. Body Press, usually used in conjunction with Iron Defense, allows Garganacl to become a late-game sweeper while also dealing considerable damage to more offensive Pokemon like Arceus, Arceus-Ground, and Koraidon. Protect lets Garganacl safely scout Choice item users, like Choice Band Koraidon and Choice Specs Kyogre, as well as provide an additional turn of Salt Cure chip damage. Tera Flying gives Garganacl an immunity to Arceus-Ground, Landorus-T, and Ting-Lu's Earthquake, as well as a resistance to Koraidon's Low Kick and Calyrex-S's Grass Knot. On the other hand, Tera Water gives Garganacl a resistance to Zacian-C's Behemoth Blade, Necrozma-DM's Sunsteel Strike, Calyrex-I's Glacial Lance, and Kyogre's Water-type attacks in a pinch. Garganacl is an especially effective Ho-Oh check, as Purifying Salt nullifies its Sacred Fire burns.</p> <p>Physically frail Pokemon like Blissey and Clodsire enjoy having Garganacl on their team, as it excels in checking both Extreme Killer and Bulk Up Arceus. Even physically defensive Pokemon like Gliscor, various bulky Water-types, and Skeledirge appreciate Garganacl for its ability to wall both offensive Ho-Oh sets and Giratina-O with ease. However, although Garganacl can wall many physical threats, its special defenses are lacking. Powerful special attackers like Kyogre, Miraidon, and Calyrex-S can easily break through Garganacl. Thus, Garganacl appreciates having teammates like Blissey, Specially Defensive Ho-Oh, and Clodsire, which find it far easier to handle special-attacking threats. Although Garganacl has excellent defenses, it still cannot handle super effective hits from Koraidon, Zacian-C, Arceus-Ground, and Necrozma-DM. Pokemon like Alomomola, Skeledirge, and Gliscor, which switch into their attacks, are very effective when paired with Garganacl.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487990, "username": "Swas"}, {"user_id": 554093, "username": "RL"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}]}]}
  },
  "Glimmora": {
    "overview": "<p>Glimmora is one of the best suicide leads, utilizing Stealth Rock and Spikes to pressure opposing Pokemon with chip damage and enabling teammates to secure KOs more leisurely. Glimmora's Poison typing allows it to clear Toxic Spikes set by Eternatus, opposing Glimmora, and Gliscor, which are usually incredibly threatening to the hyper offense teams Glimmora is found on. Finally, Glimmora's Toxic Debris ability deters attacks from Pokemon like Koraidon, Arceus, and Ho-Oh. However, although Glimmora is an excellent lead, it struggles against faster Substitute Pokemon like Tera Flying Zacian-C and Eternatus, causing tough situations that can be very hard to recover from.</p>",
    "comments": "<h3>Other Options</h3> <p>Power Gem could be considered because it does significant damage to Ho-Oh, yet Ho-Oh does not frequently stay in against Glimmora, thus rendering it useless the vast majority of the time. Glimmora could also consider using Toxic, which chips down walls and sweeps faster than regular poison. Sludge Bomb could also be used over Memento, hitting Hatterene and Arceus-Fairy, but once again, it isn't ideal due to the moves mentioned in the above set being much more important.</p> <h3>Checks and Counters</h3> <p><strong>Eternatus</strong>: Eternatus's Poison typing allows it to absorb the Toxic Spikes Glimmora sets while 2HKOing Glimmora with Dynamax Cannon and taking minimal damage from Mud Shot.</p> <p><strong>Deoxys-S</strong>: Deoxys-S leads threatens to break Glimmora's Focus Sash with Psycho Boost while also threatening to use Taunt, putting Glimmora in an unfavorable situation.</p> <p><strong>Hatterene</strong>: Hatterene's Magic Bounce makes it a profound threat to Glimmora hyper offense teams. However, it still needs to be cautious about the extremely niche but usable Sludge Bomb.</p> <p><strong>Substitute Tera Flying Zacian-C</strong>: Substitute Tera Flying Zacian-C is an excellent counterlead to Glimmora, as it is unaffected by Mud Shot after Terastallization and can potentially sweep after a Swords Dance boost, all while behind its Substitute.</p>",
    "sets": {
      "Suicide Lead": {
        "description": "<p>Spikes is Glimmora's most reliable entry hazard, chipping Koraidon, Zacian-C, Ting-Lu, and various Arceus formes. Alternatively, Stealth Rock hits targets like Landorus-T and Giratina-O, yet many Pokemon weak to Stealth Rock run Heavy-Duty Boots, so Spikes is the superior option the majority of the time. Memento allows Glimmora to disallow many sweepers like Calm Mind Tera Poison Arceus-Fairy, Arceus-Ground, and Covert Cloak Dragon Dance Necrozma-DM from setting up, while Dazzling Gleam discourages Swords Dance Koraidon from setting up. Mud Shot stops setup attempts from powerful sweepers like Nasty Plot Calyrex-S and Zacian-C, letting Glimmora's teammates safely enter the field. Mortal Spin removes hazards from Glimmora's side, in particular Ribombee's Sticky Web, making it an effective counterlead against Sticky Web teams. In addition, Mortal Spin poisons frequent targets like Ting-Lu, various Arceus formes, and Ho-Oh, putting them on a timer and making a potential sweep far easier. Glimmora's EV spread allows it to survive five Scale Shot hits from Jolly Koraidon and four Scale Shot hits from Adamant Koraidon. Tera Ghost disallows Rapid Spin users like Iron Treads from clearing hazards, while Tera Steel stops opposing Glimmora from using Mortal Spin. Tera Flying offers Glimmora immunity to Ground-type moves, in particular opposing Glimmora's Mud Shot.</p> <p>Due to Glimmora being a suicide lead exclusively used on hyper offense teams, potent sweepers like Arceus, Scale Shot Koraidon, and Dragon Dance Arceus-Ground appreciate the entry hazards that Glimmora sets, which wear down their main checks in defensive Arceus formes. Furthermore, Calyrex-S also works very well with Glimmora, as one of its main checks in Ting-Lu does not usually hold Heavy-Duty Boots, making Ting-Lu vulnerable to Glimmora's hazards. Glimmora is also frequently used on Grimmsnarl dual screens teams, where Glimmora discourages Ribombee leads while providing valuable hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487990, "username": "Swas"}, {"user_id": 631210, "username": "Adhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Dondozo": {
    "overview": "<p>Dondozo is a niche Pokemon used on stall teams, where its great physical bulk in combination with Unaware allows it to stomach many hits from powerful physical attackers such as Extreme Killer Arceus, Koraidon, Zacian-C, Calyrex-I, and Dragon Dance Arceus-Ground. However, due to its incredibly passive nature and unreliable recovery in Rest, which is blocked by Miraidon's Hadron Engine and Taunt users like Landorus-T, Arceus, and Arceus-Ground, it is prone to being weakened throughout a game. Furthermore, Skeledirge, another common stall Pokemon, frequently competes with Dondozo for a team slot due to playing a similar role and having a means of reliable recovery in Slack Off.</p>",
    "comments": "<h3>Other Options</h3> <p>Curse can be used as an alternative to Fissure to better handle threats such as Scale Shot Koraidon and Necrozma-DM, but it isn't preferred due to making Dondozo much more passive. Body Press is also an alternative to Fissure, as it helps against Taunt Arceus as well as being more consistent than Fissure, but suffers the same issues as Curse in being far too passive.</p> <h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Special Attackers like Miraidon, Calyrex-S, and Kyogre threaten Dondozo with significant damage due to its poor Special Defense. Miraidon’s Electro Drift, Calyrex-S’s Grass Knot, and Kyogre’s Thunder or Origin Pulse either OHKO or cripple Dondozo to the point where it is no longer effective in checking physical attackers.</p> <p><strong>Taunt Users</strong>: Taunt users like Extreme Killer Arceus and Landorus-T shut down Dondozo's only means of recovery in Rest, which can help slowly wear it down in addition to chip damage.</p> <p><strong>Knock Off Users</strong>: Knock Off users like Necrozma-DM and Gliscor can stop Dondozo from repeatedly switching in when combined with hazards.</p> <p><strong>Necrozma-DM</strong>: Necrozma-DM’s Photon Geyser, when boosted by Swords Dance or Dragon Dance, ignores Unaware and easily blasts through Dondozo's defenses.</p>",
    "sets": {
      "Wall": {
        "description": "<p>Avalanche provides Dondozo with a method to hit Pokemon such as Koraidon and Tera Flying Ho-Oh. Fissure makes Dondozo much less passive, allowing it to hit defensive Arceus formes like Arceus-Fairy and Arceus-Water while simultaneously deterring Miraidon from switching in, as well as being much more useful against Taunt Arceus formes. While unreliable and prevented by Miraidon's Hadron Engine, Rest is Dondozo's only method of healing. Sleep Talk prevents Pokemon from exploiting Dondozo while it is asleep, and also gives Dondozo a chance to use Fissure even after it runs out of PP. Tera Fairy provides Dondozo an immunity to Dragon-type moves, specifically Koraidon's Scale Shot and Outrage and Eternatus’s Dynamax Cannon, while also giving Dondozo a resistance to Fighting-type attacks like Koraidon's Low Kick. However, Tera Fairy leaves Dondozo vulnerable to Steel-type attacks like Necrozma-DM’s Sunsteel Strike and Zacian-C’s Behemoth Blade. Tera Flying also gives Dondozo the same resistance to Fighting-type moves while also allowing Dondozo to use Rest while Electric Terrain is active. Tera Electric provides Dondozo a resistance to Zacian-C's Wild Charge and Ho-Oh's Brave Bird.</p> <p>Teammates like Gliscor and Blissey appreciate Dondozo's presence as a fallback option when powerful setup Pokemon like Swords Dance Arceus and Swords Dance Koraidon threaten a sweep. Although very bulky on the physical side, Dondozo's poor special bulk and bad matchups against the tier's most popular special attackers in Miraidon, Calyrex-S, and Kyogre render it extremely vulnerable to their attacks. Therefore, specially defensive teammates like Blissey, Clodsire, and Tera Grass Ho-Oh are excellent teammates for Dondozo, as Dondozo helps deal with powerful physical threats. In contrast, they help deal with powerful special attackers. Alomomola is also an excellent teammate for Dondozo, as Alomomola helps take a lot of pressure off of it by providing Wish support, also giving Dondozo a method of healing while Electric Terrain is active. Additionally, Gliscor's ability to absorb Knock Off from Pokemon like Alolan Muk, Mandibuzz, Necrozma-DM, and opposing Gliscor, which could otherwise significantly cripple Dondozo, is helpful. Alolan Muk also works very well with Dondozo due to being one of the only reliable Calyrex-S checks, and Garganacl is also helpful when Dondozo is dealing with Tera Flying Ho-Oh.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 487990, "username": "Swas"}, {"user_id": 631210, "username": "Adhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}]}]}
  },
  "Clodsire": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Clodsire's solid special bulk, access to entry hazards, and ability to absorb Toxic Spikes give it a niche in checking Miraidon, Arceus-Fairy, and some variants of Calyrex-S. However, it faces competition from Ting-Lu, which similarly checks Miraidon and Calyrex-S, has more offensive pressure, and gets Spikes up more easily. Spikes and Toxic Spikes give Clodsire a way to exert offensive pressure, alongside Earthquake which punishes Miraidon and Zacian-C on switch-in and hits Eternatus and Glimmora. Poison Jab can be used over Toxic or Toxic Spikes to potentially punish Taunt variants of Arceus-Fairy and Tera Fairy Calyrex-S along with Magic Bounce Hatterene, but it is generally outclassed by the other options. Water Absorb makes Clodsire a more solid check to Miraidon, since Unaware ignores Draco Meteor's Special Attack drop, and lets Clodsire check Arceus-Water and Kyogre. Unaware is an alternative that checks Calyrex-S more consistently. Tera Steel flips Clodsire's weakness to Ice- and Psychic-type attacks such as Kyogre's Ice Beam and Calyrex-S's Psyshock, while making Clodsire more reliable into Miraidon's Draco Meteor. Tera Dark makes Clodsire weaker to Arceus-Fairy and Miraidon, but checks Calyrex-S without Draining Kiss, as well as Calm Mind Arceus-Ground. Clodsire's ability to both absorb Toxic Spikes and check various special attackers gives it a niche on balance and stall teams. Clodsire pairs well with physical walls such as Gliscor, Alomomola, Dondozo, and Skeledirge, as they can check Koraidon, physical variants of Arceus formes, and Zacian-C. Secondary special walls such as Blissey and Tera Grass Ho-Oh are appreciated to ease the burden on Clodsire against Calyrex-S, Calm Mind Arceus-Ground, and Kyogre. Arceus is another partner for Clodsire that can pivot into Calyrex-S on balance teams, and appreciates Clodsire setting Spikes and clearing Toxic Spikes for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595062, "username": "Taka"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 306317, "username": "katerina"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Kingambit": {"sets": {"Swords Dance": {}}},
  "Wo-Chien": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<p>Wo-Chien's unique typing and movepool backed by its high, Tablets of Ruin-boosted bulk grants it a solid place in the metagame, checking threats such as Calyrex-S, Arceus-Ground, and Kyogre. Leech Seed reduces Wo-Chien's passivity while allowing teammates to heal after switching in. Ruination hits foes like Arceus-Fairy, Ting-Lu, and Giratina-O. Foul Play is a stronger alternative against physical attackers like Arceus and Dragon Dance Arceus-Ground that also does a decent chunk of damage to Koraidon and Zacian-C and allows Wo-Chien to punish physical attackers that have Taunt. Knock Off gives Wo-Chien more of a niche due relevant Pokemon that learn it being rare, and it is useful against foes like Ting-Lu and Landorus-T. However, Arceus formes, which can absorb Knock Off without losing their items, are quite omnipresent. Protect lets Wo-Chien safely rack up Leftovers and Leech Seed recovery. Alternatively, Taunt shuts down setup and entry hazard Pokemon such as Arceus formes and Ting-Lu on the switch. Tera Poison gives Wo-Chien key resistances to attacks like Koraidon's Low Kick, Zacian-C's Play Rough, Double Dance Miraidon's Dazzling Gleam, and the omnipresent U-turn from foes like Landorus-T, Koraidon, and Miraidon while also offering an immunity to Toxic and letting Wo-Chien absorb Toxic Spikes. However, Tera Poison also makes Wo-Chien weak to Ground-type moves from Arceus-Ground and Psychic-type moves from Calyrex-S, respectively. Wo-Chien fits best on balance and bulky offense teams that appreciate its ability to check Calyrex-S and Arceus-Ground while offering good recovery via Leech Seed to teammates. Wo-Chien benefits from teammates such as Skeledirge, Toxapex, and Landorus-T, which check Koraidon and Zacian-C for it. Special attackers in Arceus-Fairy, Substitute Kyogre, and Eternatus trouble Wo-Chien, so offensive checks to them such as Zacian-C, Choice Scarf Koraidon, Arceus, and Calyrex-S are appreciated. Water Absorb Closdire as a defensive teammate checks Arceus-Fairy, Kyogre, and Eternatus while setting up hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 631210, "username": "Adhi"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 584685, "username": "Glory"}, {"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ting-Lu": {
    "overview": "<p>Ting-Lu is a dominant presence in Anything Goes, filling the role of the metagame's most crucial defensive glue while simultaneously providing indispensable offensive support. Ting-Lu is blessed with a fantastic typing that—in tandem with its titanic, Vessel of Ruin-boosted bulk—makes it the single best switch-in to Miraidon, one of the most consistent Calyrex-S checks, and a soft check to Necrozma-DM, Eternatus, and a plethora of other threats. This incredible defensive profile grants Ting-Lu many opportunities to set multiple layers of Spikes, making it that much harder for the foes to weather hits from its teammates. This unrivaled combination of traits means that Ting-Lu should be used on nearly every team bar hyper offense ones. Though, as fantastic as Ting-Lu is, its omnipresence means that methods to limit its impact or take advantage of it are common. Koraidon and Kyogre are able to exploit Ting-Lu to facilitate their wallbreaking, and common Pokemon like Miraidon and various Arceus formes can use Taunt to prevent Ting-Lu from setting Spikes. Furthermore, Ting-Lu is entirely reliant on Leftovers for healing, so Knock Off or any status condition greatly reduces its longevity.</p>",
    "comments": "<h3>Other Options</h3> <p>Ting-Lu has plenty of fringe options. Fissure can be used in a similar vein to Ruination, punishing switch-ins and OHKOing bulky sweepers that would typically beat Ting-Lu, though its inherent inconsistency and inability to touch Ho-Oh mean that it is generally inferior. Protect can be used to gain additional healing from Leftovers and scout Choice Scarf Koraidon's attacks, though this means giving up a valuable moveslot for minimal upsides. Stealth Rock can be used to stack additional passive damage on top of Spikes, though the difficulty of fitting it into Ting-Lu's moveset and lack of general effectiveness over Spikes mean that it is usually better delegating Stealth Rock to a partner like Arceus-Water, if it's run at all. Similarly, Taunt can be used, with some extra Speed investment, to gain an advantage over opposing Ting-Lu, though this has minimal other use and struggles to fit into Ting-Lu's cramped moveset. A wide variety of Tera types can be used, such as Steel and Fairy, to fill whatever niche is required; these have far less overall use than Tera Grass or Tera Poison though.</p> <h3>Checks and Counters</h3> <p><strong>Koraidon</strong>: Koraidon heavily threatens Ting-Lu with its powerful Low Kick and can switch into it with relative safety, though it doesn't appreciate getting hit by Ruination or Earthquake.</p> <p><strong>Kyogre</strong>: Kyogre deals massive damage to Ting-Lu and can typically use it as an entry point; Tera Grass Ting-Lu can turn the tables against it though.</p> <p><strong>Ho-Oh</strong>: Ting-Lu is incapable of doing much damage to Ho-Oh, and it can get crippled by a Sacred Fire burn or take a lot of damage from offensive sets. Ho-Oh doesn't immediately force Ting-Lu out though, and it can often allow multiple layers of Spikes to go up.</p>",
    "sets": {
      "Entry Hazard Support": {
        "description": "<p>Massive bulk, a great movepool, and an absolute godsend of a typing cement Ting-Lu as a core part of the metagame, checking key threats like Calyrex-S, Miraidon, and Necrozma-DM. Spikes are an essential part of Ting-Lu's kit, chipping key defensive walls like Arceus-Ground, Arceus-Water, and opposing Ting-Lu into KO range of the powerful wallbreakers that it is often paired with, in addition to limiting common revenge killers like Choice Scarf Calyrex-S and Koraidon; futhermore, the dearth of relevant entry hazard removal means that each layer of Spikes is usually permanent. Earthquake does large amounts of damage to Miraidon and Eternatus and is a decently strong hit on most neutral targets. Ruination is an important tool for limiting Ting-Lu's switch-ins and forcing Arceus formes to use Recover, as well as being the best move to weaken opposing Ting-Lu. Payback can be run over either Earthquake or Ruination to OHKO Calyrex-S for teams that are weaker to it, though this will result in Ting-Lu either struggling against Miraidon or failing to punish switch-ins, depending on which move is replaced. Whirlwind allows Ting-Lu to handle setup sweepers like Necrozma-DM and Arceus-Ground, as well as racking up additional damage from Spikes. Tera Grass can turn the tables on Kyogre and makes Ting-Lu an effective check to Dragon Dance Arceus-Ground. Tera Poison instead lets Ting-Lu resist Koraidon's Low Kick and Fairy-type attacks from Zacian-C and Arceus-Fairy, be immune to Eternatus's Toxic, and remove Eternatus's Toxic Spikes, albeit at the cost of becoming weak to Psychic- and Ground-type attacks from Calyrex-S, Necrozma-DM, and Arceus-Ground. Both Tera types additionally let Ting-Lu resist Calyrex-S's Grass Knot.</p> <p>Ting-Lu is so incredible that it's hard to find reasons not to use it. It can slot into any playstyle besides hyper offense and likely improve the team. That being said, Ting-Lu's glaring weakness to Koraidon necessitates partners that can handle it, such as Ho-Oh and defensive Arceus formes. Kyogre is another troublesome wallbreaker, so teammates that can pivot into it like Eternatus, Koraidon, and Miraidon are greatly appreciated, with Eternatus additionally absorbing Toxic Spikes for Ting-Lu. Reliance on Leftovers for healing means that Ting-Lu can be overwhelmed by Miraidon and Calyrex-S, so backup checks to them like Arceus-Ground for the former and Ho-Oh or Arceus for the latter are very important. Almost every offensive threat benefits from Ting-Lu's Spikes digging into its checks, as well as the backbone it provides against Calyrex-S and Miraidon. Koraidon and Miraidon are especially notable partners, as they can maintain momentum with U-turn to accrue additional entry hazard damage on defensive Arceus formes and Ting-Lu, respectively, with Koraidon also taking advantage of opposing Ting-Lu attempting to trade hazards with Ting-Lu. Necrozma-DM is another teammate that benefits greatly from Ting-Lu's Spikes support weakening opposing teams to the point where it can sweep with Dragon Dance, and it provides additional support as a check to Zacian-C and another pivot for Eternatus, while Ting-Lu can check Calyrex-S for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 584685, "username": "Glory"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Koraidon": {
    "overview": "<p>Koraidon is one of the most dominant and ubiquitous threats in AG thanks to its impressive Speed tier and Attack, which establish it as both a formidable revenge killer and an effective wallbreaker. Koraidon can overcome its defensive checks thanks to its expansive movepool, which gives it the option to run Swords Dance + Scale Shot. However, Koraidon's ability to switch in repeatedly is significantly hindered by Spikes and Toxic Spikes. Additionally, Koraidon's reliance on Flare Blitz diminishes its longevity. Nevertheless, Koraidon's versatile movepool and Tera type options cement it as a staple on every offensive team.</p>",
    "comments": "<h3>Other Options</h3> <p>Choice Scarf Koraidon can opt to counter Ribombee with Dual Wingbeat, preventing it from setting up Sticky Web, though this comes at the cost of being heavily matchup reliant. Sacrificing its crucial STAB coverage in Outrage also worsens its effectiveness against Ho-Oh. A Choice Band, when used in conjunction with Close Combat and Tera Fighting, boosts Koraidon's power to monumental levels and allows it to achieve absurd feats such as 2HKOing defensive Ho-Oh and brute forcing through Necrozma-DM and bulky Arceus formes. Alternatively, Koraidon can run Tera Fairy, which enables it to serve as an emergency check to opposing Choice-locked Koraidon.</p> <h3>Checks and Counters</h3> <p><strong>Kyogre</strong>: Kyogre nullifies Koraidon's sun with Drizzle and can 2HKO it with Ice Beam. Additionally, Kyogre can paralyze Koraidon with Thunder Wave, rendering its Choice Scarf ineffective. However, Kyogre cannot switch directly into Outrage or Low Kick.</p> <p><strong>Revenge Killers</strong>: Revenge killers such as Choice Scarf Calyrex-S and Zacian-C can OHKO Koraidon with Psychic and Play Rough, respectively. Zacian-C in particular can easily take down Choice Scarf Koraidon if it locked into Outrage.</p> <p><strong>Bulky Arceus Formes</strong>: If healthy, bulky Arceus formes are not 2HKOed by any of Choice Scarf Koraidon's attacks. Additionally, Arceus-Fairy is immune to Dragon-type attacks and resists Low Kick and U-turn, while Arceus-Water resists Flare Blitz.</p> <p><strong>Ho-Oh</strong>: Ho-Oh can pivot into Koraidon's attacks, bar its Dragon-type STAB moves, and use Tera Fairy to lure in Koraidon and OHKO Koraidon with Brave Bird.</p> <p><strong>Dondozo</strong>: With its tremendous bulk and Unaware, Dondozo can easily switch into Koraidon, recover with Rest, and retaliate with Avalanche.</p> <p><strong>Gliscor</strong>: Gliscor can safely switch into Choice Scarf Koraidon and heal itself thanks to Poison Heal and Protect. However, it must be cautious of Swords Dance sets, as a +2 Flare Blitz or Scale Shot can OHKO Gliscor.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Koraidon is one of the premier speed control options and revenge killers in the metagame. Flare Blitz, when boosted by Orichalcum Pulse's sun, provides excellent neutral coverage against Steel-, Fairy-, and Ghost-types such as Necrozma-DM, Arceus-Fairy, and Calyrex-S. Low Kick, with its 120 Base Power against most of the metagame, avoids the stat drops of Close Combat and OHKOes Arceus and Ting-Lu after one layer of Spikes while reliably damaging Arceus-Ground and Arceus-Water. Outrage is generally preferred over Dragon Claw due to its ability to 2HKO Ho-Oh and OHKO Calyrex-S and Eternatus. However, it makes Koraidon vulnerable to revenge killing attempts by Fairy-types such as Arceus-Fairy, Zacian-C, and Tera Fairy Ho-Oh. U-turn provides essential pivoting capabilities and allows Koraidon to finish off weakened foes without the concern of them Terastallizing into a type that's immune to one of its STAB moves. A Jolly nature can be used to outspeed +1 Jolly Dragon Dance Necrozma-DM after Sticky Web, outspeed +1 Jolly Dragon Dance Arceus-Ground, and Speed tie with opposing Choice Scarf Miraidon and Koraidon. An Adamant nature enables Koraidon to 2HKO bulky Arceus formes after one layer of Spikes or Stealth Rock and secure a guaranteed OHKO on Calyrex-S. Tera Fire allows Flare Blitz to OHKO Necrozma-DM and 2HKO Arceus-Fairy and Arceus-Ground; it also grants Koraidon burn immunity while making it neutral to Psychic-type moves from Calyrex-S and Necrozma-DM. However, Tera Fire flips Koraidon's resistance to Stealth Rock into a weakness, severely limiting its ability to switch in repeatedly. Tera Ghost provides Koraidon with immunities to Fighting- and Normal-type moves, allowing it to turn the tables against opposing Koraidon and Extreme Killer Arceus. Additionally, it allows Koraidon to take neutral damage from Psychic- and Dragon-type attacks from Necrozma-DM, Calyrex-S, and Eternatus. The primary downside of Tera Ghost is its weakness to Calyrex-S's Astral Barrage.</p> <p>Choice Scarf Koraidon is an incredibly powerful asset to balance and bulky offense teams thanks to its game-defining pivoting and wallbreaking abilities. However, Koraidon struggles against bulky Arceus formes like Arceus-Fairy and Arceus-Water, as the former resists Low Kick, and the latter resists Flare Blitz. Defensive Ho-Oh also poses a challenge for Koraidon to break through. As a result, Kyogre and Ho-Oh make excellent teammates, applying pressure on opposing Ho-Oh and bulky Arceus formes. In return, they greatly benefit from Koraidon's pivoting allowing them to enter the battlefield safely. Koraidon also pairs well with Calyrex-S, whose unmatched Special Attack and Speed stats can dismantle Koraidon's aforementioned checks. Physical attackers in Dragon Dance Arceus-Ground and Necrozma-DM are also invaluable teammates, as they can dispose of Ho-Oh with Stone Edge while continually pressuring bulky Arceus formes. Miraidon is another outstanding partner that complements Koraidon perfectly, as both can safely bring in the other, with Koraidon forcing out Ting-Lu and Miraidon pressuring Ho-Oh. Lastly, Koraidon benefits from being paired with entry hazard setters such as Ting-Lu, Landorus-T, and Eternatus, which not only provide critical support with Spikes, Stealth Rock, and Toxic Spikes but also check significant threats such as Calyrex-S, opposing Koraidon, and Kyogre, respectively.</p>"
      },
      "Scale Shot": {
        "description": "<p>Scale Shot Koraidon is an incredibly potent setup sweeper, leveraging its great Attack, great ability, and high Speed to punch holes through many bulky offense and balance teams alike. Scale Shot targets Dragon-types, such as Eternatus, Miraidon, and Giratina-O, while also increasing Koraidon's Speed. This boost allows it to outspeed non-Choice Scarf Calyrex-S and Speed tie with Jolly Choice Scarf Koraidon. However, the accompanying Defense drop makes it more vulnerable to Arceus's Extreme Speed. Scale Shot can also 2HKO Skeledirge and OHKO Ho-Oh after a boost, allowing Koraidon to break through teams that are reliant on them to check it. Flare Blitz gives Koraidon a way to hit Arceus-Fairy, OHKOing it at +2 after some chip damage and forcing Arceus-Fairy to stay healthy; this move also gives Koraidon an accurate way of hitting and OHKOing Calyrex-S. Low Kick OHKOes Arceus and deals significant damage to Arceus-Water, Arceus-Ground, and Ting-Lu. Close Combat is an alternative to Low Kick, giving Koraidon a good way of hitting Alomomola, although it causes a Defense drop in exchange. Swords Dance allows Koraidon to threaten defensive Arceus formes, threaten defensive Ho-Oh, and break through many teams. Tera Ghost gives Koraidon an immunity to Arceus's Extreme Speed and opposing Koraidon's Low Kick, helping it avoid being revenge killed.</p> <p>Koraidon is a staple on hyper offense teams, where Scale Shot forces Arceus-Fairy to stay very healthy or allow Koraidon a Speed boost, which it can use to easily snowball into a sweep. Thus, due to Koraidon's ability to easily chip defensive Arceus formes, Zacian-C finds its way onto the majority of teams using Scale Shot Koraidon. One of Zacian-C's biggest defensive checks, Arceus-Water, takes a great deal of damage when attempting to stop +2 Koraidon, allowing Zacian-C to revenge kill Arceus-Water with Wild Charge. Koraidon also assists Arceus-Ground in breaking defensive Arceus formes, which can otherwise chip Arceus-Ground with Judgment or threaten to use Will-O-Wisp until they are Taunted. Though Koraidon can assist in breaking defensive Arceus formes, on its own, it still struggles to get past them without prior chip damage. Therefore, Deoxys-S's entry hazards greatly assist Koraidon, as +2 Low Kick OHKOes Arceus-Water, and +2 Flare Blitz OHKOes Arceus-Fairy after some hazard damage. Choice Scarf Calyrex-S can outspeed even +1 Koraidon and threaten to OHKO it with Psychic or Astral Barrage after some chip damage, so Arceus, with an immunity to Astral Barrage and great natural bulk, is a stellar teammate for Koraidon. Furthermore, taking advantage of Calyrex-S being locked into Astral Barrage or Psychic, Arceus can force Calyrex-S to switch out with the threat of Shadow Claw and set up with Swords Dance. Though quite niche, Scale Shot Koraidon can also be used on balance and bulky offense structures using Choice Scarf Calyrex-S, leveraging surprise factor to quickly overwhelm unsuspecting defensive Arceus formes.</p>"
      },
      "Iron Head": {
        "description": "<p>Iron Head Koraidon, coupled with Substitute and Tera Steel, serves as an incredibly strong setup sweeper that uses its invaluable Fairy resistance to turn its checks into setup fodder. It is able to bait its checks, including Arceus-Fairy, Arceus-Water, and Alomomola, to switch into it. With Substitute, Koraidon is able to set up without fear of being statused by defensive Arceus formes, Skeledirge, and Gliscor or being revenge killed by a Ditto; once set up, it can rip through many team archetypes. Iron Head is able to super effectively target Fairy-types like Arceus-Fairy and Tera Fairy users like Arceus-Water, Ho-Oh, and Skeledirge; Koraidon can OHKO all of them with Tera Steel at +2, though it is a roll for Skeledirge. Iron Head also does not cause recoil damage like Flare Blitz would, allowing Koraidon to set up Substitute more frequently. Scale Shot is the perfect partner to Iron Head, providing Koraidon with a high-Base Power STAB move that, at +2, has a chance to OHKO most physically defensive Pokemon, including Ho-Oh, Alomomola, and Arceus-Water. It also allows Koraidon to outspeed Zacian-C, non-Choice Scarf Calyrex-S, Miraidon, and maximum Speed Arceus formes. With this move combination, Koraidon is able to hit nearly the entire metagame for neutral damage, except Necrozma-DM and Tera Steel users such as Ting-Lu and Giratina-O. To combat this, Substitute can alternatively be replaced for Low Kick, making it easier to take down Steel-types at the expense of leaving Koraidon more vulnerable to status moves. The Speed investment allows Koraidon to naturally outspeed maximum Speed neutral-natured Arceus formes. After it has Terastallized, the HP EVs notably provide it with enough bulk to prevent its Substitute from being broken in one hit by Judgment from uninvested Arceus-Fairy and Arceus-Water while sun is up, as well as Dynamax Cannon from Eternatus. This also leaves Koraidon more resilient to an Arceus's Extreme Speed, making it much harder for Koraidon to be revenge killed.</p> <p>Koraidon is able to fit on both hyper offense and bulky offense teams. Because Tera Steel and Substitute work to bait and nullify checks such as Arceus-Fairy and Arceus-Water, Koraidon is a great teammate for Pokemon that would otherwise struggle with defensive Arceus formes, such as Dragon Dance Arceus-Ground, Zacian-C, and Arceus. Entry hazard setters such as Glimmora, Deoxys-S, Ting-Lu, and Eternatus can help Koraidon guarantee an OHKO on bulky Pokemon like the aforementioned defensive Arceus formes. Using Swords Dance Koraidon often means forgoing the usual Choice Scarf Koraidon sets, so Choice Scarf users such as Calyrex-S, Ditto, Kyogre, and Landorus-T are excellent teammates on bulky offense and balance teams, as they let the team maintain a level of speed control and deal with faster threats like Zacian-C. Because Iron Head Koraidon struggles with Steel-types like Necrozma-DM and Tera Steel users like Ting-Lu and Giratina-O, having a Ground-type like Arceus-Ground or a Fire-type like Ho-Oh is good to help Koraidon where it falls short. Due to Koraidon being naturally outsped by Calyrex-S, Arceus is another great teammate, as it is able to switch into Calyrex-S’s attacks and threaten it out with Shadow Claw. Special attackers such as Miraidon, Calyrex-S, and Kyogre are able to break through physical walls, such as Dondozo, that Koraidon would be unable to take out.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 608926, "username": "Lord Rekkuza"}, {"user_id": 631210, "username": "Adhi"}, {"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 426798, "username": "Geysers"}, {"user_id": 487990, "username": "Swas"}, {"user_id": 511624, "username": "Fc"}, {"user_id": 532881, "username": "Frozoid"}, {"user_id": 631210, "username": "Adhi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Miraidon": {
    "overview": "<p>Thanks to Miraidon's outstanding power cementing it as one of the most potent wallbreakers in the metagame, it is a staple on balance and bulky offense, and every team needs to have effective counterplay for it. U-turn makes Miraidon an amazing pivot, allowing it to safely bring in teammates such as Koraidon and Calyrex-S. However, due to the prevalence of the Ground-types Ting-Lu and Arceus-Ground, which can force Miraidon out one-on-one, it has a tough time safely coming in and wallbreaking. Additionally, Calyrex-S and Choice Scarf Koraidon can revenge kill Miraidon. Keeping this in mind, Miraidon really appreciates teammates such as Ho-Oh and Ting-Lu that are able to check Ting-Lu, Arceus-Ground, and offensive wallbreakers such as Koraidon and Calyrex-S.</p>",
    "comments": "<h3>Other Options</h3> <p>Miraidon can opt to use a more niche option in Overheat, which OHKOes Steel-types such as Necrozma-DM and Zacian-C under the sun provided by the omnipresent Koraidon. However, it is heavily prediction reliant and makes Miraidon drop more effective option in Taunt or Calm Mind. Miraidon can also opt for Tera Grass, which further bolsters the power of Solar Beam, allowing it to OHKO Ting-Lu at +1 and OHKO Arceus-Ground when unboosted. Furthermore, it lets Miraidon serve as a backup check to Arceus-Ground thanks to the Ground resistance it provides.</p> <h3>Checks and Counters</h3> <p><strong>Ting-Lu</strong>: Ting-Lu can effectively switch into Miraidon's Draco Meteor and safely pivot into Electro Drift, making it difficult to break through. However, Ting-Lu lacks recovery, which means it cannot do this repeatedly.</p> <p><strong>Arceus-Ground</strong>: At +1, Arceus-Ground can outspeed Miraidon and threaten it out with Earthquake. Also, Arceus-Ground is able to pivot in on Miraidon's Electro Drift, and it can force Miraidon to switch out in a one-on-one situation.</p> <p><strong>Revenge Killers</strong>: Revenge killers such as Koraidon and Calyrex-S can outspeed Miraidon and potentially KO it with their STAB moves. Additionally, thanks to Arceus's STAB priority in Extreme Speed, it can pick off a low-HP Miraidon.</p> <p><strong>Zacian-C</strong>: Courtesy of Zacian-C's high Speed and Play Rough, it is able to KO Miraidon. Also, Zacian-C is one of the very few Pokemon that blocks Miraidon's Draco Meteor, making it easier for it to safely switch in.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Miraidon's raw natural power backed by Hadron Engine and access to U-turn make it one of the best pivots for balance and bulky offense teams. Heavy-Duty Boots greatly increases Miraidon's longevity by letting it come in multiple times without any consequences from entry hazards while also improving its matchup against Sticky Web. Taunt helps prevent Ting-Lu from using Spikes, Arceus formes and Clodsire from using Recover, and foes such as Arceus and Necrozma-DM from setting up. Calm Mind allows Miraidon to OHKO Necrozma-DM after a single boost and brute force its way through its checks, 2HKOing Ting-Lu and OHKOing Arceus-Ground at +1 after entry hazard damage. Solar Beam is an alternative option that allows Miraidon to 2HKO Ting-Lu and OHKO Arceus-Ground after some minor chip damage, although it requires sun to be up for Miraidon to be able to use it with ease. Tera Fairy gives Miraidon an immunity to Dragon-type moves from Koraidon, Eternatus, and opposing Miraidon, albeit at the cost of making it weak to Necrozma-DM's Sunsteel Strike and removing its resistance to Ho-Oh's STAB moves. Tera Dragon boosts Miraidon's Draco Meteor to absolutely insane levels, allowing it to 2HKO Ting-Lu at +1 and OHKO Arceus-Ground. Tera Ghost grants Miraidon an immunity to Koraidon's Low Kick and Arceus's Extreme Speed, although it makes Miraidon weak to Calyrex-S's Astral Barrage.</p> <p>Miraidon is primarily used on balance and bulky offense teams that benefit from its wallbreaking and pivoting capabilities. Miraidon struggles with revenge killers such as Koraidon and Calyrex-S, so it likes checks to them such as Ho-Oh and defensive Arceus formes for the former and Ting-Lu for the latter. Miraidon appreciates being paired with Choice Scarf Koraidon, as they can pivot each other in and complement each other really well, with Koraidon being able to pressure Ting-Lu and Arceus-Ground and Miraidon helping against Ho-Oh and Arceus-Water. Miraidon also appreciates special attackers such as Calyrex-S and Arceus-Ground that can pressure and eventually break through Ting-Lu. Lastly, Miraidon greatly benefits from Ting-Lu setting entry hazards to let it effectively break through foes and being a fabulous check to Calyrex-S and Arceus-Ground, which Miraidon struggles with.</p>"
      },
      "Choice Specs": {},
      "Agility": {
        "description": "<p>Life Orb Miraidon is a potent setup sweeper, leveraging its great power to unleash incredible damage. Agility allows Miraidon to outspeed the entire unboosted metagame. Electro Drift hits most of the tier neutrally and notably OHKOes Zacian-C, Calyrex-S, and Ho-Oh, as well as OHKOing Arceus formes after two layers of Spikes. Solar Beam gives Miraidon a way of hitting Ting-Lu super effectively, though it is hindered by requiring Koraidon's sun. Dragon Pulse hits all Dragon-types in the tier for super effective damage while giving an alternative to chip Ting-Lu. However, due to Miraidon's poor longevity because of Life Orb recoil damage and a vulnerability to entry hazard damage, it can't afford to switch in frequently early in the game. Additionally, an opponent could predict Miraidon's moves and constantly switch to a resisted Pokemon to stall out Electric Terrain. Tera Grass ensures an OHKO on Ting-Lu with Solar Beam after minor chip damage and ensures Miraidon's safe setup against foes such as Eternatus, Miraidon, and Ting-Lu if it doesn't use Whirlwind. Miraidon's EV spread allows it to outspeed the fastest unboosted Pokemon in the tier, Choice Scarf Calyrex-S, after using Agility.</p> <p>Agility Miraidon is primarily used on two types of teams—hyper offense and bulky offense—as a late-game sweeper once other attackers wear down its checks. On bulky offense, it also has a surprise factor, since an offensive pivot set is much more common on such teams, and an unexpected Agility can quickly turn the tide of a game. However, due to Miraidon's issues with longevity and weakness to entry hazard damage, bulky offense teams using it often run Pokemon such as Magic Bounce Hatterene to stave off hazards or powerful attackers like Choice Specs Kyogre to apply pressure on opposing hazard setters. Miraidon lures in and does great damage to Ting-Lu, one of Calyrex-S's best checks, helping enable a Nasty Plot sweep. Agility Miraidon also lures in Arceus-Ground, which takes a great deal of damage from Solar Beam, and opens up Pokemon such as Choice Scarf Koraidon, which no longer has to worry about Dragon Dance Arceus-Ground using Tera Fairy to set up on it. Similarly, Miraidon's ability to significantly chip Arceus-Fairy when combined with entry hazards helps Koraidon overwhelm and KO it. Miraidon struggles with Ting-Lu before Terastallizing due to the latter's great natural bulk and Electric immunity, and Choice Scarf Koraidon's Outrage threatens to OHKO Miraidon before it uses Agility. Therefore, Arceus-Fairy, Ho-Oh, and Landorus-T are great partners to Agility Miraidon, leveraging their excellent defensive typings and stats to switch into Ting-Lu and Koraidon effectively. Landorus-T's and Choice Scarf Koraidon's U-turns also provide a safe switch in opportunity for Agility Miraidon. Furthermore, Landorus-T checks Zacian-C, which otherwise outspeeds and threatens to OHKO Miraidon with Play Rough before it uses Agility. Ting-Lu is also a stellar partner for Miraidon, as the layers of Spikes it sets are an invaluable aid to a potential sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 631210, "username": "Adhi"}, {"user_id": 665318, "username": "JK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 584685, "username": "Glory"}, {"user_id": 631210, "username": "Adhi"}, {"user_id": 511624, "username": "Fc"}, {"user_id": 554093, "username": "RL"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  }
}