{
  "Arcanine-Hisui": {"sets": {"Altarianite Revenge Killer": {}, "Pinsirite Revenge Killer": {}}},
  "Dragonite": {
    "sets": {
      "Altarianite": {
        "description": "<p>Dragonite is one of the most formidable setup sweepers in the metagame, capable of unleashing incredibly powerful Pixilate-boosted Extreme Speed, further amplified by Dragon Dance. Additionally, it boasts exceptional coverage options to deal with foes that can safely switch into its Extreme Speed. Fire Punch handles Magearna and Corviknight. Alternatively, Earthquake deals more damage to Magearna, Pecharunt, and Garganacl, but is completely walled by Latiasite variants of the former two, as well as setup Corviknight. Waterfall, on the other hand, hits all the aforementioned foes reliably, albeit weakly, along with dealing super effective damage to Ho-Oh and Hearthflame Mask Great Tusk; it can also be used to fish for flinches in dicey situations. Dragonite may also utilize Facade to severely punish attempts to burn it by foes like Milotic, Ho-Oh, and Arceus formes, as well as turn the tables against Gyaradosite Pecharunt when Pecharunt poisons it. Roost is nearly essential to provide Dragonite with reliable recovery. The Speed EVs allow it to outspeed uninvested Manectite Magearna. Dragonite can fit seamlessly into various offense and balance teams, where it can serve as a potent revenge killer and sweeper. Pairing it with entry hazard setters such as Magearna, Great Tusk, and Swampert applies immense offensive pressure on the opposing team as Dragonite spams Extreme Speed. Similarly, hazard removers like Great Tusk and Corviknight are amazing allies, allowing it to avoid getting easily chipped and preventing Multiscale from breaking pre-Mega Evolution. Dragonite is vulnerable to other Altarianite Extreme Speed users, such as Entei, Hisuian Arcanine, and Regieleki, making checks to these like defensive Eternatus and Hearthflame Mask Great Tusk excellent pairing options. Hearthflame Mask Great Tusk also applies pressure on Magearna and Pecharunt, two of Dragonite's most troublesome walls.</p>"
      },
      "Aerilate Dragon Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 641598, "username": "Solosis"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604741, "username": "kenn"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 545372, "username": "Clas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}]}]}
  },
  "Slowking-Galar": {"sets": {"Special Wall": {}}},
  "Ho-Oh": {"sets": {"Defensive": {}}},
  "Hippowdon": {"sets": {"Specially Defensive": {}}},
  "Arceus": {"sets": {"Extreme Killer": {}}},
  "Arceus-Fairy": {"sets": {"Calm Mind": {}}},
  "Arceus-Ghost": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Arceus-Ghost makes use of its good Speed, amazing bulk, and a lack of Ghost-resistant Pokemon in the tier to become a frightening setup sweeper, capable of taking advantage of common walls like Magearna and Arceus-Water. Substitute allows Arceus-Ghost to take advantage of its bulk to set up on more passive walls, such as Milotic and Garganacl, as well as block status moves from foes such as Pecharunt, Clodsire, and Magearna. Similarly, Taunt blocks status moves from non-Sablenite versions of the aforementioned Pokemon and prevents foes from healing or setting up. Will-O-Wisp can cripple Pokemon like Urshifu-R, Dragonite, Regieleki, and Kingambit, allowing either Arceus-Ghost or its teammates to take advantage of their lessened damage output. Imprison is a niche, but useful, move, allowing Arceus-Ghost to completely stonewall other Calm Mind Arceus formes; however, its utility outside of that is highly outclassed by Taunt. Ghost-resistant Pokemon such as Kingambit, Hisuian Samurott, and Arceus as well as Gyaradosite users such as Pecharunt and Clodsire are a pain for Arceus-Ghost, as it can’t reliably break through them, although all of them fear being burned by Will-O-Wisp. Pokemon like Great Tusk and Urshifu-R are wonderful teammates for Arceus-Ghost, as they can deal with these foes. Urshifu-R, in particular, can lure in Ghost-types like Lunala and non-Gyaradosite Pecharunt for Arceus-Ghost to come in and force them out, while Great Tusk can remove entry hazards for Arceus-Ghost. Similarly, other Pokemon that can give hazard removal, such as Regieleki and Corviknight, are great teammates, so that Arceus-Ghost doesn't get worn down by switching in constantly. As Arceus-Ghost doesn't have much of an offensive presence until it sets up, hazard setters like Magearna, Garganacl, Great Tusk, and Hippowdon are great teammates to help wear down bulkier Pokemon like Garganacl and Eternatus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 591294, "username": "Lightniong"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604741, "username": "kenn"}, {"user_id": 641598, "username": "Solosis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 593115, "username": "igiveuponaname"}]}]}
  },
  "Arceus-Ground": {
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Ground boasts amazing defensive capabilities, effectively checking wallbreakers such as Great Tusk and Raging Bolt, while also maintaining a formidable offensive presence. Ice Beam offers a valuable coverage option that deals significant damage to opposing Arceus-Ground, Great Tusk, and Dragonite. Alternatively, Power Gem can be employed to counter foes like Ho-Oh, which would otherwise force Arceus-Ground to switch out. Gravity may also be used to enable Arceus-Ground to neutralize common Latiasite users, such as Magearna, Garganacl, and Pecharunt, as well as Flying-types like Ho-Oh and Corviknight, rendering them vulnerable to Judgment. Calm Mind amplifies Arceus-Ground's potential as a setup sweeper, whereas Will-O-Wisp enhances its defensive utility by crippling physical attackers. It can also be employed as a Stealth Rock user, as most Sablenite foes such as Magearna, Garganacl, and Pecharunt find it really difficult to switch into. The Speed EVs allow Arceus-Ground to outspeed Hearthflame Mask Great Tusk. Arceus-Ground's versatility as both an offensive and defensive Pokemon makes it an excellent addition to all team archetypes. Pairing it with other defensive partners like Magearna, Corviknight, and Pecharunt creates a robust defensive core, allowing them to check each other's weaknesses, such as the former two being able to check Ice-types like Weavile and Baxcalibur, while Arceus-Ground switches into Fire-type foes. Arceus-Ground struggles to counter Water-type Pokemon such as Arceus-Water and Urshifu-R, making Pokemon like Raging Bolt, Eternatus, and Regieleki valuable partners, with the latter also providing entry hazard removal support.</p>"
      },
      "Dragon Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 641598, "username": "Solosis"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 545372, "username": "Clas"}, {"user_id": 558636, "username": "zastra"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Water": {"sets": {"Defensive": {}}},
  "Samurott-Hisui": {"sets": {"Offensive Spiker": {}}},
  "Mandibuzz": {"sets": {"Specially Defensive": {}, "Gyaradosite Utility": {}}},
  "Lunala": {"sets": {"Power Herb": {}, "Physically Defensive": {}}},
  "Magearna": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Magearna is the cornerstone of defensive utility and a premier Spikes user, as it can reliably wield a variety of defensive Mega Stones while supporting its teammates through pivoting. It can fit on practically any playstyle, capable of dealing with metagame staples like Lunala and Raging Bolt while having a ton of role compression. Latiasite is the most common Mega Stone, as the Ground immunity gained by Levitate allows it to switch into Pokemon like Dragonite, Arceus-Ground, and Pinsirite Great Tusk and threaten them out. Sablenite is useful for not only granting amazing boosts in both defensive stats, allowing Magearna to take hits that it would normally run from, but also letting it bounce back entry hazards and status from Garganacl, defensive Arceus formes, and other Magearna. Manectite, in combination with a Bold nature, is used on more offensive teams, as with Intimidate, Magearna can weaken common physical attackers like Arceus and Regieleki. Ice Beam gives Magearna consistent damage against Pokemon that it checks like Arceus-Ground lacking Calm Mind and Eternatus, as well as threatening out Ground-types like Great Tusk and Hippowdon for non-Latiasite sets. Alternatively, Fleur Cannon hits harder against Pokemon that don't resist it and can OHKO Altarianite Dragonite and Regieleki but leaves Magearna fairly weak after use. Magearna is an amazing Spikes setter, as it fares well against common hazard removers such as Regieleki and Mandibuzz, as well as being capable of pivoting on hazard-blocking Magic Bounce users like Corviknight and Galarian Slowking and chipping down Pokemon like Hippowdon and Eternatus for teammates such as Regieleki and Urshifu-R. On the other hand, Encore can disrupt common setup sweepers such as Calm Mind Arceus formes and Dragonite. Frailer wallbreakers like Regieleki and Spectrier appreciate Magearna giving them slow pivoting, allowing them to consistently break the opposing team without worrying about switching in. Blue Orb Kilowattrel and Water-types like Urshifu-R and Arceus-Water can pressure Ground-types like Hippowdon and Arceus-Ground that threaten out non-Latiasite sets with ease and deal with Fire-types like Hisuian Arcanine and Hearthflame Mask Great Tusk in particular that give Magearna trouble. Due to Magearna’s constant switching, it can get easily worn down by Spikes chip damage without Latiasite, so hazard removers like Regieleki and Great Tusk are great partners.</p>"
      },
      "Physical Setup": {}
    },
    "credits": {"writtenBy": [{"user_id": 591294, "username": "Lightniong"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 545372, "username": "Clas"}, {"user_id": 604741, "username": "kenn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 712558, "username": "waffledogefern"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Corviknight": {
    "sets": {
      "Defensive": {},
      "Bulky Setup": {
        "description": "<p>Corviknight is a potent setup user thanks to its fantastic bulk, useful defensive utility and typing, and ability to punish opposing physical setup from the likes of Dragonite and Great Tusk. IronPress allows for more instant anti-setup pressure, notably switching into and beating Fire Punch Dragonite without issue, while physically defensive Bulk Up + Brave Bird is better at dealing more instantaneous damage, especially Flying-weak or Fighting-resistant Pokemon like Urshifu-RS and Spectrier. U-turn in combination with Sablenite allows Corviknight to keep its ability to bounce entry hazards without hassle while bringing in frailer teammates like Urshifu-RS and Dragapult, while Defog is a better option on fatter teams where momentum isn't as necessary. Specially defensive variants can use both a Relaxed and Sassy nature depending on the team's needs, while physically defensive variants should always use a Relaxed nature. Venusaurite is useful on physically defensive Bulk Up + Brave Bird variants to answer the likes of Hisuian Arcanine and Iron Moth in a pinch while denying Stealth Rock from the former in conjunction with Defog. Corviknight fits best on balance and stall teams, with some viability on bulky offense teams thanks to its defensive prowess. Teammates like Urshifu-R and Raging Bolt adore Corviknight's ability to slow pivot them onto the field while blocking most entry hazard-setting attempts from the likes of Magearna, faster Garganacl variants, and the Arceus formes. Corviknight fears Garganacl's Salt Cure, notably chunking it every turn for 1/4 of its health, so answers like Lopunnite Iron Boulder, Great Tusk, and Urshifu-RS are greatly appreciated; Substitute Arceus-Ghost can also use non-Pinsirite Garganacl as setup fodder. Stronger Fire-types like Heatran, along with Iron Moth and Hisuian Arcanine when excluding Venusaurite, greatly pressure Corviknight, so answers like Hearthflame Mask Great Tusk, Arceus-Water, and Ho-Oh are necessary. Electric-types like Regieleki and Raging Bolt are also extremely problematic for Corviknight, so answers like non-Fighting-type Great Tusk, Arceus-Ground, Eternatus, and Altarianite Dragonite are essential. Venusaurite variants should be paired with an alternative Sablenite user like Blissey, Hippowdon, or Cresselia, as entry hazard denial is especially important on bulkier teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 545372, "username": "Clas"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641598, "username": "Solosis"}, {"user_id": 604741, "username": "kenn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Zamazenta": {
    "sets": {
      "Aggronite": {
        "description": "<p>Zamazenta's natural Speed coupled with Aggronite, which gives it a fabulous secondary Steel typing alongside a beefy +50 Defense and the ability Filter, allows it to easily set up in the face of many physical attackers thanks to Iron Defense and fires off a devastating Body Press. Crunch hits Ghost-types such as non-Gyaradosite Pecharunt, non-Audinite Spectrier, and Lunala, while Stone Edge targets the ever-problematic Ho-Oh as well as other Fire-types such as Entei and Hisuian Arcanine. While Zamazenta can be extremely bulky on the physical side, it struggles against the many special attackers in the metagame such as Eternatus and Spectrier; therefore, Pokemon such as Magearna and Ho-Oh can provide special bulk to annoy those aiming to take advantage of Zamazenta's weaker defensive stat. Ghost-types such as Pecharunt, Audinite Spectrier, and Arceus-Ghost are not only immune to Body Press, but are also bulky enough to shrug off Crunch; therefore, Pokemon such as the aforementioned Arceus-Ghost, Kingambit, and Gyaradosite Pecharunt can help ease the pressure. Since Zamazenta is prone to being worn down and isn't dedicated to continuously take physical hits, a physically bulky Pokemon such as some Arceus formes and Eternatus can complement Zamazenta's ability to boost in the face of physical attackers. Zamazenta is also worn down by entry hazards, so having removal such as Regieleki and Great Tusk can allow Zamazenta to continue threatening the opponent.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604741, "username": "kenn"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 545372, "username": "Clas"}, {"user_id": 641598, "username": "Solosis"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Eternatus": {"sets": {"Physical Wall": {}, "Life Orb": {}, "Meteor Beam": {}}},
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Thanks to its impressive stats and splendid movepool, Urshifu-R is one of the best physical attackers of the metagame, capable of fulfilling both wallbreaking and sweeping roles; its access to Swords Dance alongside two solid Mega Stone options grants it flexibility to adjust its set to best fit the team's needs. Close Combat hits foes like Arceus, Arceus-Water, and Kingambit. Ice Spinner hits Dragon-types like Dragonite and Eternatus. U-turn makes Urshifu-R an excellent pivot and helps it escape bad matchups such as Pecharunt and Arceus-Fairy. Swords Dance can be considered over Close Combat or U-turn to turn it into a dangerous cleaner and potentially even break past physical walls like Pecharunt and Eternatus, though it has its drawbacks. Dropping Close Combat makes it weak to Arceus-Water, whereas dropping U-turn means that it can no longer generate momentum for the team. Metagrossite should be used with a Jolly nature to allow Urshifu-R to outspeed foes such as fast variants of Eternatus and Arceus formes, while Aerodactylite with an Adamant nature is a slower but more powerful alternative, achieving feats like 2HKOing Arceus-Fairy with minor chip damage. Urshifu-R synergizes extremely well with offensive staples such as Raging Bolt and Kingambit; Raging Bolt, in particular, is a standout partner, forming a formidable VoltTurn wallbreaker duo with it. Entry hazard setters such as Magearna, Hearthflame Mask Great Tusk, and Garganacl are amazing partners, aiding Urshifu-R in maintaining crushing offensive pressure against the opposing team. Urshifu-R also appreciates entry hazard removers such as Regieleki, non-Hearthflame Mask Great Tusk, and Corviknight as teammates, as they help it maximize its impact by removing hazards and keeping it healthy throughout the game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 558636, "username": "zastra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 545372, "username": "Clas"}, {"user_id": 604741, "username": "kenn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Regieleki": {
    "sets": {
      "-ate Speed": {
        "description": "<p>Regieleki is the premier -ate Speed user, entry hazard remover, and speed control, having incredible role compression that is unmatched. Volt Switch creates progress against switch-ins like Eternatus and Magearna, especially with entry hazard support, while Rapid Spin removes entry hazards to support its teammates. Explosion removes nearly every Pokemon in the tier upon use, notably removing chipped Calm Mind Arceus formes, while Supercell Slam can lure and remove Ho-Oh, an otherwise-decent Regieleki switch-in. Supercell Slam can be used over Rapid Spin to allow Regieleki to have even more offensive pressure on teams where Rapid Spin is less necessary. Maximum Attack and Speed investment is preferred to negate Speed ties, but 8 HP and 60 Defense EVs can be allocated to allow Regieleki to survive opposing Altarianite Regieleki's Extreme Speed and KO back with a Rapid Spin into Extreme Speed or straight Extreme Speed after Stealth Rock. Glalitite is a fringe option when Altarianite is used up with a spread of 252 Atk / 160 SpA / 96 Spe to outspeed opposing Regieleki and remove entry hazards reliably at the cost of being offensively pathetic in comparison to Altarianite. Regieleki fits on a wide range of teams, from offense to semi-stall, and its teammate support reflects that. Pivots and setup attackers like Urshifu-R, Raging Bolt, Spectrier, and Calm Mind Arceus formes all benefit from Regieleki's Explosion threats and notable Volt Switch, either answering switch-ins like Arceus-Ground, Blissey, Pecharunt, and Magearna or capitalizing off of Regieleki removing these roadblocks via Explosion to let them clean up games. Regieleki struggles to make progress versus the likes of Magearna, Eternatus, and Ground-types like Clodsire and Hearthflame Mask Great Tusk, so answers to these walls like Lunala, Hearthflame Mask Great Tusk, and Arceus-Ground are necessary. Entry hazards also weaken grounded variants of those listed, so setters like Magearna, Hearthflame Mask Great Tusk, and Garganacl are enjoyed. While Regieleki is certainly the best Rapid Spin user in the tier, it despises switching into entry hazards, and, as such, Sablenite users like Magearna, Mandibuzz, and Swampert are incredibly helpful.</p>"
      },
      "Dual Screens": {}
    },
    "credits": {"writtenBy": [{"user_id": 545372, "username": "Clas"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604741, "username": "kenn"}, {"user_id": 558636, "username": "zastra"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Spectrier": {"sets": {"Offensive Setup": {}}},
  "Garganacl": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Garganacl stands out as one of the tier's premier special walls, boasting exceptional bulk that grants it the ability to check special attackers such as Raging Bolt and Eternatus. With Sablenite, Garganacl's defenses are elevated even further while also granting it Magic Bounce, punishing attempts to set entry hazards except against Mold Breaker foes and allowing it to exploit common Pokemon such as Latiasite Magearna. Alternatively, Tyranitarite provides Garganacl with the Sand Stream ability, so it can increase its Special Defense even further and inflict additional chip damage through sand, which synergizes effectively with Salt Cure and hazards. Earthquake hits foes like Raging Bolt and non-Latiasite Magearna and Pecharunt, granting it somewhat of an offensive presence. Curse enhances Garganacl's ability to check physical attackers and can also be utilized to sweep opposing teams all while making it incredibly difficult to KO. Garganacl can even fulfill the role of a Stealth Rock setter by leveraging its ability to force switches and accumulate chip damage through Salt Cure. Garganacl thrives on balance teams and provides them with outstanding defensive utility; thus, pairing it with other bulky partners such as Magearna, Pecharunt, Arceus-Ground, and Ho-Oh creates a formidable core. Magearna has noteworthy synergy, as it also sets Spikes and capitalizes on Garganacl's ability to force switches through Salt Cure. Pokemon such as Arceus-Water, Urshifu-R, and Pinsirite Great Tusk as well as Latiasite users like Pecharunt and Magearna help Garganacl against troublesome Ground-type foes such as Arceus-Ground and Great Tusk. Offensive partners like Regieleki and Dragonite also form effective pairings with Garganacl, as they appreciate its capacity to wall threats like Eternatus, while in return, they can check foes such as Urshifu-R and Iron Boulder.</p>"
      },
      "Physically Defensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 641598, "username": "Solosis"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 604741, "username": "kenn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Kilowattrel": {"sets": {"Blue Orb": {}, "Offensive Pivot": {}}},
  "Great Tusk": {
    "sets": {
      "Pinsirite": {
        "description": "<p>Pinsirite Great Tusk cements itself as the metagame's premier entry hazard remover while also being a respectable offensive threat. Body Slam potentially cripples common switch-ins like Arceus-Water and Latiasite Pecharunt with paralysis. Bulk Up makes Great Tusk a formidable cleaner that's difficult to revenge kill, especially in conjunction with Rapin Spin. Smack Down can be used over Body Slam or Bulk Up to threaten Ground-immune targets such as Latiasite variants of Magearna and Pecharunt as well as Corviknight and Ho-Oh. 204 Speed EVs allow Pinsirite Great Tusk to outspeed Hearthflame Mask Great Tusk, while 144 HP EVs enable it to survive two maximum Attack Altarianite Dragonite Extreme Speeds after Stealth Rock. Strong wallbreakers such as Urshifu-R, Hisuian Arcanine, Raging Bolt, Entei, and Iron Moth benefit from Great Tusk's ability to remove hazards, potentially giving them more opportunities to hit the field. Defensive staples like Garganacl, Pecharunt, and bulky variants of Arceus-Water and Arceus-Fairy also appreciate it removing hazards and maximizing their longevity. Great Tusk struggles against Arceus-Water and Latiasite users like Magearna, so pairing it with answers such as Ho-Oh, Hisuian Arcanine, and Entei for Magearna as well as Eternatus and Raging Bolt for Arceus-Water is crucial. Great Tusk also appreciates specially bulky teammates such as Magearna and Garganacl because special attackers, especially Ice Beam users like Lunala, are troublesome for it.</p>"
      },
      "Stealth Rock": {},
      "Wallbreaker": {}
    },
    "credits": {"writtenBy": [{"user_id": 558636, "username": "zastra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604741, "username": "kenn"}, {"user_id": 591294, "username": "Lightniong"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Sandy Shocks": {"sets": {"Offensive Pivot": {}, "Glalitite": {}}},
  "Baxcalibur": {"sets": {"Heracronite": {}}},
  "Raging Bolt": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Raging Bolt stands out as one of the premier special wallbreakers in the tier, boasting exceptional offensive stats and a formidable STAB combination. Lucarionite further amplifies its breaking power by granting it Adaptability and substantial stat boosts, whereas Diancite can be used to significantly raise its Speed stat, albeit at the cost of some firepower and bulk. Timid nature helps Diancite Raging Bolt outspeed Great Tusk, Arceus formes, and Eternatus; a Modest nature allows Lucarionite Raging Bolt to reach feats like OHKOing offensive Arceus-Ground after minimal entry hazard chip damage. Raging Bolt utilizes Draco Meteor for its immense firepower and hit-and-run potential with Volt Switch. Thunderbolt and Discharge provide options for either dealing more damage or fishing for paralysis, respectively. Additionally, Thunderclap allows Raging Bolt to reverse kill Pokemon such as Urshifu-R and Basculegion formes, and Volt Switch enables it go function as a strong pivot. Raging Bolt may also utilize moves such as Calm Mind and Substitute to serve as a devastating progress maker at the cost of Volt Switch's utility or Thunderclap's priority. It synergizes exceptionally well with pivots like Urshifu-R, Magearna, and Pecharunt to form incredible VoltTurn cores; Urshifu-R and the Latiasite versions of the latter two also deal with Ground-types such as Arceus-Ground and Great Tusk, with the former being able to check Blissey as well. Offensive partners such as Spectrier, Calm Mind Arceus formes, and Zamazenta also aid in dismantling opposing defensive cores and thus synergize well with Raging Bolt. Pairing Raging Bolt with hazard setters such as Hearthflame Mask Great Tusk and Magearna helps it secure KOs more efficiently, especially against foes such as Arceus formes. It faces troubles against Pixilate Extreme Speed users such as Dragonite and Regieleki; thus, it is usually paired with Pokemon such as Pecharunt and Arceus-Ground to deal with them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641598, "username": "Solosis"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 545372, "username": "Clas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}]}]}
  },
  "Iron Boulder": {"sets": {"Pinsirite": {}, "Wallbreaker": {}}},
  "Pecharunt": {
    "sets": {
      "Physically Defensive": {},
      "Gyaradosite": {
        "description": "<p>Pecharunt, bolstered by its impressive Defense stats and Dark typing thanks of Gyaradosite, emerges as an amazing physical wall in the metagame. Mold Breaker further enhances Pecharunt's utility, granting it the capability to use Toxic against defensive Sablenite users, such as Garganacl and Milotic, and Parting Shot against Magic Bounce users. Malignant Chain can be used in place of Toxic to inflict decent damage to specific targets, including Altarianite Dragonite and Hisuian Arcanine, while also being able to poison common Taunt users such as Arceus and non-Substitute Arceus-Ghost, although the reduced chance of poisoning and the limited PP may render this choice suboptimal. Foul Play enables Pecharunt to deal significant damage to foes like Lunala and punishes physical setup sweepers such as Arceus, Urshifu-R, and Iron Boulder. Parting Shot amplifies Pecharunt's utility as a pivot. Gyaradosite Pecharunt is a valuable addition to balance and bulky offense teams, forming an immaculate core with specially defensive Latiasite Magearna, as they cover each other's checks excluding Hearthflame Mask Great Tusk; Pecharunt is able to deal with physical attackers like Hisuian Arcanine, Entei, and Urshifu-R, while Magearna provides a Ground immunity with Levitate as well as the ability to set up Spikes and establishes a formidable pivot core. Arceus formes such as Arceus-Ground also solidify the defensive backbone as well as provide an offensive presence to the team with Calm Mind. Entry Hazards can compromise Pecharunt's efficacy as a wall and may force it to use Recover more often, necessitating hazard removers in the team like Regieleki and Great Tusk. Pecharunt can be paired with offensive teammates such as Zamazenta, Raging Bolt, and Urshifu-R as it can easily provide them a safe switch.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641598, "username": "Solosis"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 545372, "username": "Clas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  }
}