{
  "Charizard": {
    "comments": "<h3>Other Options</h3> <p>Charizard has Dragon Dance and Swords Dance in its arsenal for setting up without sacrificing half of its HP, but Charizard's Attack isn't amazing without multiple boosts, so Charizard needs teams to be significantly worn down before it can sweep. Solar Power makes Charizard a capable sun attacker, though Charizard is worn down quickly by Stealth Rock and the ability's recoil, and it faces competition from Scovillain as a sun sweeper. All-out attacker Charizard can run Focus Blast for greater damage against Rock-types and Snorlax but Scorching Sands has reliable accuracy and lets Charizard fish for burns on these targets. Belly Drum Charizard can run Tera Ground to turn the tables on Rock-types and Electric-types, and the boost in power to Earthquake lets Charizard reliably OHKO Regirock and Naclstack. Tera Dark on Belly Drum Charizard can protect Charizard from moves affected by Prankster coming from foes like Whimsicott and Sableye.</p> <h3>Checks and Counters</h3> <p><strong>Faster Revenge Killers</strong>: Jolteon requires little chip damage to revenge kill Charizard, and Choice Specs Jolteon can OHKO Charizard outright. Choice Scarf Electric-types like Magneton and Rotom-C also have super effective STAB moves to revenge kill Charizard with less chip damage, and they also gain momentum against it with their pivot moves. Virizion, Sneasel, and Mismagius are strong attackers faster than Charizard, but few revenge killers can switch into it safely or repeatedly.</p> <p><strong>Rock-types</strong>: Regirock is quite difficult for Charizard to break on its own, and still threatens Charizard even when it is burned. Lycanroc outspeeds Charizard and can pick off Flame Charge variants with Accelerock. Naclstack is an excellent wall to all-out attacker Charizard thanks to Recover, Purifying Salt shielding it from burns, and great bulk with Eviolite, but Belly Drum Charizard can OHKO it with a +6 Earthquake.</p> <p><strong>Specially Bulky Pokemon</strong>: Snorlax can use all-out attacker Charizard as an opportunity to set up, and it doesn't mind damage or burns thanks to Rest. Muk dislikes burns but can take repeated hits from Charizard and wear it down with Poison Jab and Knock Off. Fire-weak speical walls like Articuno and Cryogonal can become a pain for Charizard to deal with if they Terastallize.</p> <p><strong>Lanturn</strong>: Lanturn only minds burns cutting into its passive recovery, and it can gain momentum from Charizard with Volt Switch, threaten to spread burns with Scald, and heal away damage with Rest.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Charizard's high Speed, great Special Attack, and unique offensive and defensive typing make it a great all-out attacker, checking many common Grass-types like Whimsicott and Shaymin. Charizard's Hurricane is one of its strongest attacks and has few common resistances. Flamethrower has more reliable accuracy than Hurricane, destroys Steel-types like Magneton and Orthworm that can otherwise handle Hurricane, and melts Ice-types like Glastrier. Scorching Sands covers Regirock and Lanturn, lets Charizard fish for burns, and is a more accurate move than Hurricane against foes like Typhlosion. Roar is an option to wear down checks that want to switch into Charizard like Snorlax and Regirock, while also being a get out of jail free card against foes setting up like Bellossom, Dipplin, and Mesprit. Will-O-Wisp punishes physical attackers like Snorlax and Regirock that would otherwise try to take advantage of Charizard. Tera Ground stops fast Electric-types like Jolteon and Choice Scarf Magneton from taking advantage of Charizard with Volt Switch and flips its major 4x Rock weakness into a resistance to better handle Regirock and Sandaconda. Offensively, Tera Ground gives Charizard great odds to 2HKO Lanturn and always 3HKO defensive Muk after Stealth Rock chip.</p> <p>Charizard appreciates pivots like Jolteon and Whimsicott bringing it in safely on Pokemon that check them like Orthworm and Magneton; Charizard also benefits from these teammates checking Water-types like Lanturn and Clawitzer that it otherwise struggles with. Regirock is a great teammate for Charizard, as it can check Snorlax for Charizard and is an even sturdier wall to the threats Charizard burns with Will-O-Wisp. Grass-type partners like Virizion, Rotom-C, and Dipplin cover Charizard's weaknesses and are complemented by Charizard handling Whimsicott. Charizard is a great switch-in against Weezing's Will-O-Wisp for Hisuian Sneasel and Passimian, while they threaten one of Charizard's biggest checks in Regirock.</p>"
      },
      "Belly Drum": {
        "description": "<p>After a Belly Drum, Charizard becomes a deadly sweeper capable of OHKOing most Pokemon that don't resist Acrobatics. Even physical walls like Weezing and Sandslash are KOed by +6 Acrobatics after Stealth Rock damage. Earthquake wrecks bulky Pokemon that resist Acrobatics like Magneton, and at +6, Charizard's Earthquake OHKOes even Regirock after Stealth Rock damage and Naclstack. Flame Charge makes Charizard harder to revenge kill by fast Pokemon like Jolteon and Choice Scarf Rotom, and at +6, it is likely to OHKO Orthworm after Stealth Rock damage. Sitrus Berry restores some of Charizard's health given that Stealth Rock and Belly Drum both take 50% of its HP, and it easily allows Charizard to consume its item and maximize damage from Acrobatics. Tera Flying boosts Acrobatics, allowing Charizard to reliably OHKO physical walls like Sandaconda.</p> <p>Belly Drum Charizard usually has just one chance to sweep, so it primarily features on hyper offense teams built around fast-paced setup sweepers. Charizard benefits immensely from teammates that set entry hazards, enabling it to OHKO foes like Sandaconda and Regirock, both of which could otherwise survive its onslaught; offensive teammates like Lycanroc and Primeape can reliably set Stealth Rock, and Orthworm and Sandslash can set Spikes for Charizard. Sandslash is an excellent partner for Charizard, as it can set up hazards, remove hazards with Rapid Spin, and check Rock- and Electric-types for Charizard. Parting Shot users Alolan Persian can weaken foes and ease Charizard's time setting up. Memento users like Mismagius and Whimsicott can put Charizard in a good position to sweep by debuffing foes. Offensive pivots like Mesprit and Whimsicott can bring Charizard into favorable matchups against Pokemon they lure in like Orthworm and Articuno. Other physical attackers like Glastrier and Sneasel can break holes in teams so that Charizard can clean up afterwards, and they all appreciate its great Speed and potential to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Raichu-Alola": {"sets": {"Nasty Plot": {}}},
  "Sandslash": {
    "overview": "<p>Sandslash is one of the few good entry hazard removers in ZU, and it's distinguished as a role compressor due to its additional access to Stealth Rock and Spikes. Spinblockers like Mismagius and Froslass fear and despise Sandslash's Knock Off, and Sandslash matches up nicely against common hazard setters like Regirock and Lycanroc thanks to its typing and physical bulk. Sandslash isn't just limited to being a role compressor either, as it can run Swords Dance alongside Rapid Spin to become a surprisingly strong setup sweeper with good offensive utility from Rapid Spin + Knock Off. However, Sandslash is burdened by lacking any recovery besides Leftovers, leading it to being easily worn down by residual damage. Grass-types like Dipplin, Virizion, Rotom-C, and Shaymin can all exploit Sandslash as an opportunity to switch in and threaten it out. Common hazard setters like Mesprit, Orthworm, and Vikavolt are even immune to Earthquake, leaving Sandslash reliant on Knock Off to punish them. Middling special bulk leaves Sandslash vulnerable against many special attackers. Sandslash also has several viable competitors: Sandaconda has Rest + Shed Skin for superior longevity, Mesprit distinguishes itself as a role compressor with additional utility like U-turn and Healing Wish, Regirock is a much tankier hazard setter, and Hattrem can deter hazards altogether.</p>",
    "comments": "<h3>Other Options</h3> <p>Rock-type coverage like Stone Edge can help Sandslash nail Flying-types like Charizard, Articuno, and Dodrio, especially as Sandslash is setup fodder for Minior. However, Knock Off alongside entry hazards still punishes Flying-types and a wider pool of Pokemon for Sandslash's utility set. Sandslash's Swords Dance set also tends to appreciate coverage options like Leech Life and Knock Off that hit Ground-resistant and -immune obstacles like Dipplin, Virizion, and Mesprit a lot harder. Alternative Tera types like Water and Dragon can improve utility Sandslash's matchups against Water-types like Clawitzer and Poliwrath that would give it trouble. An Assault Vest is an option for utility Sandslash variants that don't run entry hazards, as it helps Sandslash function as a tank against Electric-types.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Grass-types like Rotom-C, Shaymin, and Alolan Exeggutor can use Sandslash's Earthquake as an opportunity to switch in and fire off attacks. Lurantis even threatens to remove Sandslash's entry hazards. Virizion, Whimsicott, and Dipplin can very neatly switch into Knock Off and proceed to threaten Sandslash. Grassy terrain set up by Arboliva and Thwackey even blunts Sandslash's STAB Earthquake for their teammates, and they can exploit Sandslash to get the terrain set up. However, all Grass-types should be wary of Sandslash's access to coverage moves like Gunk Shot and Leech Life on top of its potential for Tera Poison.</p> <p><strong>Water- and Ice-types</strong>: Water- and Ice-types like Clawitzer and Beartic can hit Sandslash hard with their super effective STAB moves. Froslass can spinblock, while Cryogonal can spin away Sandslash's hazards. Beartic under snow and Poliwrath aren't as threatened trying switching into Sandslash's Earthquake, and they can use Sandslash as setup fodder.</p> <p><strong>Spinblockers</strong>: Through blocking Rapid Spin, Ghost-types like Mismagius, Sableye, and Spiritomb inhibit utility Sandslash in its role as a hazard remover, and they similarly prevent offensive sets from boosting their Speed to sweep. However, Mismagius's frailty and Spiritomb's dependence on Leftovers for recovery mean they don't enjoy Knock Off.</p> <p><strong>Ground-immune Pokemon</strong>: Minior and Oricorio-F can use utility Sandslash's inability to hit them hard as an opportunity to for setup. Mesprit, Vikavolt, and Orthworm can tolerate Knock Off enough to slug it out with Sandslash and come out on top. Even Flying-types like Charizard and Dodrio can switch in on Earthquake and proceed to pressure Sandslash, but they must be wary of losing their Heavy-Duty Boots and being made to take damage from Stealth Rock.</p> <p><strong>Special Wallbreakers</strong>: Typhlosion, Farigiraf, and Magneton all hit Sandslash hard on its lower special bulk. However, most of them lack the bulk or typing to switch in against Sandslash.</p> <p><strong>Residual Damage</strong>: Hazard damage can overwhelm Sandslash unless it runs Heavy-Duty Boots. Burns neutralize most of Sandslash's decent power, leaving Sandslash vulnerable to burn spreaders like Scald Lanturn and Will-O-Wisp Weezing. Toxic, poison, and Toxic Spikes from Muk can punish Sandslash by putting it on a timer.</p>",
    "sets": {
      "Rapid Spin": {
        "description": "<p>Good physical bulk, solid Attack, and plenty of utility make Sandslash an excellent hazard remover and role compressor. Knock Off deters spinblockers like Mismagius, nails Mesprit, and punishes Ground-immune Pokemon like Vikavolt, Charizard, and Orthworm. Knock Off's item removal helps soften up Hattrem and renders Heavy-Duty Boots users like Charizard, Glastrier, and Arboliva vulnerable to hazards set by Sandslash or its teammates. Sandslash is a solid hazard setter itself thanks to its good bulk and opportunities to set up against Rock-types like Naclstack and Regirock, Choice item Electric-types like Jolteon and Rotom-C locked into Electric-type moves, and Poison-types like Muk and Hisuian Sneasel. Stealth Rock is more useful than Spikes for hitting all non-Heavy-Duty Boots users, and it targets Ground-immune Pokemon like Mesprit and Vikavolt that try to take advantage of Sandslash. If one of Sandslash's teammates runs Stealth Rock instead, then it can use Spikes to wear down foes like Dipplin and Orthworm. Alternatively, Gunk Shot makes Sandslash much less passive against Grass-types like Lurantis, Rotom-C, and Virizion. Heavy-Duty Boots keep Sandslash from being worn down by the hazards it's frequently tasked with removing. For alternative utility, Sandslash can hold Rocky Helmet to chip away at contact move users like Mesprit and Passimian that may use Knock Off to remove Sandslash's item anyway. Leftovers is Sandslash's only option for recovery, and the healing is nice against passive foes like Regirock and Naclstack. Tera Ghost enables Sandslash to spinblock for itself, and the Fighting immunity is a nice perk against Fighting-types like Passimian and Hisuian Sneasel, Lycanroc's Close Combat, and Body Press users like Regirock and Orthworm. Alterantively, the Grass and Fairy resistances provided by Tera Poison improve Sandslash's matchups against threats like Choice Specs Jolteon and Whimsicott, and Gunk Shot variants have a strong Poison-type move to capitalize on Tera Poison. Tera Poison Sandslash becomes even better as a spinner by absorbing Toxic Spikes, and its matchup against Virizion and other Grass-types become even better.</p> <p>Sandslash's access to Rapid Spin earns it a spot on many styles of teams thanks to the utility it provides. Defensive Pokemon that rely on items other than Heavy-Duty Boots, including Regirock, Snorlax, Orthworm, and Dipplin all appreciate Sandslash spinning to keep them from being worn down. Lanturn enjoys being able to run items other than Heavy-Duty Boots, Poliwrath depends on Leftovers for recovery, and both of them can handle Water-types like Clawitzer for Sandslash. Rock-weak offensive Pokemon like Belly Drum Charizard, Choice Band Sneasel, and Minior all depend on Sandslash to keep Stealth Rock out of the picture. Pivots like Magneton, Rotom-C, and Jolteon appreciate Sandslash removing hazards to reduce the residual damage they take from constantly pivoting, earning Sandslash a spot on VoltTurn teams. Knock Off users like Passimian and Mesprit can help remove Heavy-Duty Boots from foes to maximize the impact of Sandslash's hazards. Typhlosion relies on being in pristine condition to maximize Eruption's power, so it's another beneficiary of Sandslash as a spinner. Sandslash's ability to remove hazards without removing Aurora Veil puts it ahead of Defog users for pairing with Abomasnow, and Abomasnow itself can disrupt troublesome Grass-types like Arboliva and Dipplin for Sandslash. Hattrem can deter entry hazards to relieve Sandslash of some of its duty as a remover and enable it to work more as a hazard setter, and Hattrem appreciates being able to fall back on Sandslash in the event that it cannot deter hazards. Other hazard setters like Mesprit and Weezing can create hazard stacking cores with Sandslash, and Sandslash's Rapid Spin doesn't remove its own team's hazards. Sandslash's Spikes can wear down defensive walls like Snorlax, Regirock, and Orthworm that lack recovery, which can ease sweeping attempts by setup users like Mesprit and Oricorio-F. Spinblockers like Mismagius and Spiritomb can ensure that Sandslash's own hazards remain on the field. Sandslash depends greatly on its teammates to answer the Grass-types like Shaymin and Dipplin it invites in, so Pokemon like Whimsicott, Hisuian Sneasel, and Articuno make great partners to Sandslash. Sandslash's own Grass-type partners, including ones like Virizion and Shaymin, appreciate its ability to defensively answer Poison-types like Weezing and Muk. Variants of Sandslash that lack Heavy-Duty Boots become vulnerable to Toxic Spikes, making grounded Poison-types like Hisuian Sneasel and Muk even better teammates than usual.</p>"
      },
      "Swords Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}]}]}
  },
  "Dugtrio-Alola": {"outdated": true, "sets": {"Fast Attacker": {}}},
  "Persian-Alola": {"sets": {"Defensive Pivot": {}}},
  "Primeape": {"sets": {"Offensive Stealth Rock": {}, "Bulk Up": {}}},
  "Poliwrath": {
    "overview": "<p>Poliwrath has a solid typing, strong moves, and well-rounded stats for taking on Pokemon like Regirock, Lycanroc, Orthworm, and Sneasel. Poliwrath's access to Water Absorb makes it a decent answer to Clawitzer as well as Rock- and Ice-types like Lycanroc and Sneasel. Poliwrath's access to utility moves like Knock Off and Circle Throw further distinguishes it as a solid defensive presence. However, Poliwrath's middling Speed leaves it prone to being revenge killed by threats like Rotom-C, Mesprit, and Virizion. Lanturn is a tough competitor for Poliwrath, offering pivot moves for extra momentum, a better matchup against Charizard, and the ability to run Volt Absorb, which shores up its defensive matchups against Jolteon and Magneton. As a Fighting-type, Poliwrath also faces competition from as Passimian, Hisuian Sneasel, and Virizion, which can offer better speed control and more immediate offensive presence.</p>",
    "comments": "<h3>Other Options</h3> <p>Defensive sets with Rest + Sleep Talk and either full physical or special bulk investment make decent walls. Poliwrath has Circle Throw for phazing, but its defensive sets can become very passive and are often outclassed by walls like Regirock, Dipplin, and Snorlax. Poliwrath's Water immunity makes it a great user of alternative defensive Tera types, but Poliwrath generally sticks to Tera Dark and Tera Steel for their combinations of good defensive utility and number of flipped weaknesses into resistances. With Tera Fairy, Poliwrath becomes a hard counter to Clawitzer sets lacking the uncommon Flash Cannon. Tera Ground Poliwrath effectively counters Lanturn and severely turns the tables on Jolteon and Magneton, allowing it to absorb Volt Switch. Choice Scarf sets can surprise faster Pokemon like Virizion by 2HKOing them, and they can also revenge kill offensive threats like Charizard and Magneton, but Clawitzer and Passimian generally outclass such a set because of their access to pivoting moves.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Dipplin walls Poliwrath, breaks Substitute with Giga Drain, has Sticky Hold for Knock Off, and can phaze it with Dragon Tail if it's boosted. Whimsicott resists Poliwrath's STAB moves and Knock Off, Shaymin can run recovery to deal with Poliwrath long-term, and Rotom-C may use Poliwrath for momentum with Volt Switch; however, all of them dislike switching in to lose their items to Knock Off. Virizion, on the other hand, can use Justified to gain an advantage from tanking Knock Off, and it has Swords Dance and Leaf Blade to break through Defense boosts.</p> <p><strong>Ghost-types</strong>: Ghost-types cannot be hit by Poliwrath's Drain Punch for recovery. Sableye and Spiritomb threaten Poliwrath with Will-O-Wisp and take neutral damage from Knock Off; the former Ghost-type can use Encore to lock Poliwrath into a setup move, while the latter has Psychic-type coverage and Nasty Plot. However, Spiritomb depends on Leftovers for recovery, so Knock Off annoys it. Mismagius outspeeds Poliwrath and can hit it hard with Dazzling Gleam, but its physical frailty leaves it vulnerable to Knock Off and Liquidation.</p> <p><strong>Flying-types</strong>: Most Flying-types struggle losing their Heavy-Duty Boots to Knock Off, but a majority of them can switch into Poliwrath's Fighting-type attacks and proceed to threaten it with their Flying-type STAB moves. Braviary has Bulk Up and Roost to set up against Poliwrath. Minior, Oricorio-F, and Charizard are all weak to Liquidation, but they can pressure Poliwrath variants that forgo it.</p> <p><strong>Psychic-types</strong>: Mesprit and Farigiraf can hit Poliwrath super effectively with their STAB Psychic-type moves, and Psychic Noise from either of them goes through Poliwrath's Substitute and inhibits its recovery from Leftovers and Drain Punch. However, Poliwrath can hit Psychic-types back super effectively with Knock Off, and item removal particularly deters Hattrem.</p> <p><strong>Electric-types</strong>: Vikavolt resists Fighting and hits Poliwrath back hard, though it doesn't enjoy losing its item to Knock Off. Lanturn resists Liquidation and is quite bulky, but it also doesn't want to give up its item to Knock Off. Jolteon and Magneton hit Poliwrath hard with their Electric-type STAB moves, and the former can even finish off a weakened Poliwrath behind a Substitute with Alluring Voice. However, Jolteon and Magneton struggle to switch into Poliwrath's Fighting-type attacks or Knock Off unscathed.</p> <p><strong>Poison-types</strong>: Weezing resists Drain Punch, runs Rocky Helmet to punish physical attackers like Poliwrath, and can use Haze to remove Poliwrath's Bulk Up boosts. Grafaiai can use Encore to lock Poliwrath into a setup move, though its frailty means it's not a defensive switch-in to Poliwrath.</p>",
    "sets": {
      "Bulk Up": {
        "description": "<p>Bulk Up Poliwrath can take advantage of bulky Pokemon like Sandslash and Orthworm to set up and sweep; it's also enabled when Choice item Clawitzer locks itself into a Water Pulse or Dark Pulse. Substitute protects Poliwrath from annoying status effects inflicted by users like Thunder Wave Regirock and Will-O-Wisp Weezing, giving it more room to maneuver against revenge killers like Mesprit, Rotom-C, and Charizard. The recovery from Drain Punch compensates for Poliwrath's dependence on Leftovers and the HP-lowering effect of Substitute. Knock Off hits Ghost- and Psychic-types like Mismagius and Mesprit super effectively, and its effect of removing items helps Poliwrath against Rocky Helmet users like Weezing and Palossand. Liquidation hits Oricorio-F and Charizard for more substantial damage than Knock Off, fending off these faster Flying-types. Tera Dark powers up Knock Off and flips Poliwrath's Psychic weakness into an immunity, improving Poliwrath's matchups against Mesprit and Farigiraf. Additionally, Prankster users like Sableye and Grafaiai can't use status moves like Encore against Tera Dark Poliwrath. Tera Steel is an alternative for better matchups against Grass-types like Dipplin and Shaymin, while the immunities it provides can be key against Weezing and Toxic Spikes teams. However, the Fighting immunity provided by Tera Ghost enables Poliwrath to suffocate IronPress users like Regirock and Orthworm.</p> <p>Poliwrath is a good option for bulky offense teams and balance teams thanks to the way it can improve its team's defensive backbone against staple threats like Lycanroc, Snorlax, Sneasel, and Regirock. Charizard and other staple Pokemon weak to Water, such as Sandslash and Regirock, appreciate Poliwrath serving as a defensive pivot against Water-types like Clawitzer. Regirock can defensively handle Charizard and other Fire-types, giving Poliwrath more room to handle Water-types in return. Poliwrath may rely on Snorlax to blanket check special attackers like Shaymin and Charizard, and in return, Poliwrath can handle Lycanroc for Snorlax. Poliwrath's ability to remove items with Knock Off synergizes with entry hazard setters like Weezing, Sandaconda, and Sandslash. Offensive Dark-types like Sneasel can pressure troublesome Psychic-types like Mesprit and Farigiraf for Poliwrath, making it easier for Poliwrath to run Liquidation. Dark-types like Spiritomb and Sableye can also wall the problematic Psychic-types mentioned earlier. Orthworm is another good defensive answer to Psychic-types, helps against Grass-types, and synergizes with Poliwrath's Knock Off by stacking hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Victreebel": {"sets": {"Sun Sweeper": {}}},
  "Magneton": {
    "overview": "<p>Magneton secures itself a place in the ZU metagame by virtue of its excellent power, a typing that is useful both offensively and defensively, and its ability to reliably pivot against many teams. Magneton's Steel typing is very rare in ZU, and it can hold Eviolite to shore up its mediocre bulk. This gives it a unique niche as a bulky pivot that provides a rare form of defensive utility while still hitting quite hard. Alternatively, Choice item sets are effective offensive threats thanks to Magneton's excellent STAB combination and great ability in Analytic, which can situationally boost its already good power even further. Magneton's Steel-type STAB moves are very threatening to most of the tier's Ground-types, which allows all sets to pivot reliably against many teams. However, Magneton's bulk is very poor, which prevents Choice item sets from providing much defensive utility, and Eviolite sets are simply not as threatening as their Choice item counterparts. Magneton's Steel typing also saddles it with unsavory weaknesses to Fire-, Fighting-, and Ground-type attacks; the first two are especially problematic, as Magneton is slower than most of the tier's Fire- and Fighting-types.</p>",
    "comments": "<h3>Other Options</h3> <p>A bulkier spread on the Eviolite set can work if you want to focus on Magneton's ability to take hits. The Choice Specs set could choose Tera Fighting with Tera Blast to 2HKO Snorlax after Stealth Rock without having to take itself out due to recoil, but pivoting out of them with Volt Switch is generally more effective, and they are greatly pressured by Steel Beam anyway. More defensively oriented Tera types, such as Tera Fairy and Tera Ghost, can be considered, as they give Magneton a Fighting resistance while turning its other weaknesses into neutralities. Thunder Wave over Tera Blast on Eviolite sets is a decent option to spread paralysis, but most Magneton switch-ins don't mind being paralyzed that much or are outright immune to the move. Metal Sound is an additional option on the Eviolite set that lets Magneton break through Dipplin and Snorlax, but it is overall niche compared to the other options.</p> <h3>Checks and Counters</h3> <p><strong>Lanturn</strong>: Volt Absorb Lanturn is one of the only Pokemon that doesn't care about Magneton's STAB attacks at all; even an Analytic-boosted Steel Beam doesn't hit it all that hard. It also blocks Volt Switch thanks to Volt Absorb and can use Magneton as an opportunity to pivot safely to a teammate or spread burns with Scald. It does have to watch out for Tera Blast Grass, however.</p> <p><strong>Special Walls</strong>: Special walls such as Snorlax and Muk are decent checks to Magneton due to their ability to sponge its main STAB attacks. Steel Beam's immense power pressures even them, however, and neither of them prevent Magneton from pivoting out of the bad matchup with Volt Switch.</p> <p><strong>Ground-types</strong>: Bulky Ground-types, such as Sandaconda and Sandslash block Volt Switch from Magneton and threaten to OHKO it with their STAB moves. They are not true switch-ins, however, as Magneton's Analytic boosted Steel-type STAB moves are still greatly threatening to them.</p> <p><strong>Fire-types</strong>: Fire-types such as Charizard, Typhlosion, Magmortar, and Pyroar can OHKO Magneton with their STAB moves, and they are all faster than variants lacking a Choice Scarf. They also resist Magneton's Steel-type STAB moves, but none of them are true switch-ins due to their inability to block Volt Switch or reliably switch into Thunderbolt.</p> <p><strong>Fighting-types and Fighting-type coverage</strong>: Fighting-types such as Passimian and Hisuian Sneasel threaten to revenge kill Magneton; Choice Scarf Passimian is even faster than Choice Scarf Magneton. Additionally, common Fighting-type coverage from the likes of Orthworm, Regirock, and Naclstack prevents Magneton from comfortably dealing with them one-on-one depending on what coverage move it is locked into. None of them can directly switch in, however.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Magneton's Steel typing makes it an excellent offensive answer to common Pokemon like Mesprit and Weezing, giving it plenty of opportunities to switch in, attack, and pivot out. Most Ground-type Pokemon like Sandaconda and Sandslash that would otherwise block Magneton's Volt Switch cannot reliably switch into Magneton's Analytic-boosted Flash Cannon and avoid being KOed by a follow-up Flash Cannon. Analytic makes Magneton painful to switch around; it's also complemented by Magneton's many resistances and solid bulk when holding Eviolite. Tera Blast Grass enhances Magneton's coverage, enabling it to punish troublesome Electric-immune foes like Lanturn and Ground-types. Tera Fairy helps give Magneton a Fighting resist against Pokemon like Passimian and Virizion, while being able to hit them and other checks like Virizion and Dipplin for big damage. Tera Flying also eases Magneton's otherwise poor matchups against Fighting-types, and it turns its 4x Ground weakness into an immunity to make it less vulnerable to Ground-types like Sandslash and Sandaconda; although a Spikes immunity can help Magneton as a pivot, the Stealth Rock weakness is a huge hindrance and should normally be used late game to avoid this. Even without Terastallizing, Tera Blast is a decent standalone attack that hits Jolteon and Lanturn harder than Flash Cannon would. 84 Speed allows you to outrun Defensive Pivot Mesprit, with rest in bulk giving it more longevity.</p> <p>VoltTurn teams welcome Magneton as a strong offensive pivot that adds to their defensive backbone with its Steel typing. Other pivots like Passimian and Clawitzer can create cores with Magneton and cause opponents to end up lost in the vortex. Strong wallbreakers like Virizion and Glastrier appreciate Magneton bringing them in safely with Volt Switch, and they have the bulk and power to answer problematic Ground-types for Magneton. Volt Absorb Lanturn walls Magneton and prevents it from pivoting with Volt Switch, so Magneton relies on Grass-type partners like Virizion and Lurantis to put pressure on it. Specially defensive Pokemon like Regirock and Snorlax are excellent answers to Fire-types like Charizard and Typhlosion that threaten Magneton. Magneton cannot afford to run Heavy-Duty Boots given the greater bulk provided by Eviolite, so it often ends up worn down by entry hazards; hazard removers like Lurantis and Sandslash can mitigate Magneton's vulnerability to this as it pivots in and out, and they appreciate Magneton checking threats to them like Mesprit and Dodrio. Psychic-weak Pokemon like Passimian and Weezing appreciate Magneton checking Mesprit for them. Magneton's Steel typing similarly gives it opportunities to switch in and threaten Articuno out as well, which is appreciated by Ice-weak teammates such as Shaymin. Physical attackers like Passimian and Hisuian Sneasel benefit from Magneton threatening Weezing, one of their most significant checks, and they support Magneton in return by threatening special walls like Snorlax for it.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Magneton is one of the most feared wallbreakers in the entire tier. Many teams are completely incapable of safely switching into Magneton thanks to its great STAB combination and access to Analytic, which amps up its power even further. Volt Switch complements Magneton nicely, as it is still quite powerful and allows Magneton to keep up momentum for its team. Magneton is generally quite good at pivoting, as many of the Pokemon immune to Electric, such as Sandslash and Sandaconda, fear Magneton's Steel-type STAB moves. Steel Beam is a monstrously powerful attack that is capable of hitting several notable power benchmarks, including OHKOing Sandaconda and Regirock so they can't KO Magneton back. While the massive recoil damage prevents it from being a staple attack, it gives a teammate free entry into battle should Magneton take itself out due to recoil. Tera Steel is preferred to jack up the power of Flash Cannon and Steel Beam even more, allowing the former to reliably 2HKO Jolteon and specially defensive Mesprit and the latter to 2HKO Snorlax. However, Tera Blast with Tera Grass allows Magneton to threaten standard checks such as Lanturn and various Ground-types with high damage while also becoming resistant to their STAB moves. Analytic allows Magneton to hit switch-ins much harder than it would be able to otherwise, which has great synergy with its threatening wallbreaking profile as well as Volt Switch. It also boosts its power should it have to take a hit before moving, which can be useful versus weak moves that Magneton resists, such as STAB moves from Mesprit and Farigiraf. However, such situations should generally be avoided due to Magneton's middling bulk. A Timid nature is recommended in order to outrun Timid Farigiraf.</p> <p>Choice Specs Magneton fits well on teams ranging from offense to balance teams due to its ability to act as a strong wallbreaker and a reliable pivot. Magneton's toolkit is appreciated by a variety of offensive teammates. Magneton's power is intimidating, but special walls such as Snorlax can check it. Teammates with powerful Fighting-type coverage, such as Passimian and Regirock, are good teammates, as are Grass-types, such as Dipplin and Virizion. Their ability to threaten Ground-types that might try to absorb Magneton's Electric-type STAB moves while still being able to break through standard special walls is very useful for Magneton, and they can also switch into annoying Ground-types, such as Sandaconda and Sandslash. Magneton, in return, can bring them in safely with Volt Switch and threaten physical walls such as Weezing and Orthworm. Switch-ins to Fire-types are also needed, as Magneton is easily revenge killed by foes such as Charizard, Typhlosion, and Pyroar. Bulky Water- and Rock-types, such as Lanturn and Regirock, are therefore good teammates. Faster, frailer partners also appreciate Magneton's wallbreaking and pivoting capabilities; Passimian, Clawitzer, and Hisuian Sneasel appreciate Magneton threatening to break down defensive cores and bringing them in safely with Volt Switch. The first two can also form a pivoting core with it, while Passimian can also use Knock Off to remove Heavy-Duty Boots from specially defensive Magneton checks, making them even more vulnerable to chip damage. On a related note, Magneton also benefits significantly from entry hazards being on the opponent's side of the field, as several of its bulkier checks, such as Snorlax, do not normally hold Heavy-Duty Boots. Stealth Rock setters such as Mesprit, Sandaconda, and Regirock can set up the hazard reliably to assist Magneton's wallbreaking capabilities, and they are generally not significantly threatened by Magneton's bulky checks. Spikes setters such as Sandslash and Orthworm also work well. Teams utilizing Magneton require additional preparation for Lanturn, which is one of the only Pokemon in the tier that switches into Magneton with impunity and largely prevents it from performing its role as a wallbreaking pivot unless Magneton is packing Tera Grass. Dedicated Lanturn answers such as the aforementioned Grass-types as well as specially bulky teammates such as Cryogonal and Snorlax make for good teammates as a result.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf turns Magneton into an effective revenge killer and general anti-offense Pokemon, as it outruns the entire unboosted metagame bar Jolteon. It also has a limited, but still notable, defensive profile, and its ability to pivot brings a lot of utility to the table. Volt Switch allows Magneton to keep up momentum for its team and effectively pivot. Steel Beam allows Magneton to wallbreak should the need arise and hits extremely hard with an Analytic boost. However, the massive recoil makes it a situational attack. Tera Steel allows Magneton to power up Flash Cannon and Steel Beam significantly. On the other hand, Tera Blast Grass allows Magneton to pressure Lanturn and Ground-types such as Sandaconda and Sandslash with more confidence, allowing it to pivot more reliably against teams with these threats or to lure them in and KO them outright. It also gives Magneton a Ground resistance, further improving its matchup versus the aforementioned Ground-types. A Timid nature is required so Magneton can outrun Whimsicott and Alolan Persian. Analytic allows Magneton to pick up several KOs, such as 2HKOing Sandaconda with Flash Cannon on the switch and doing the same to Orthworm with Thunderbolt and Lanturn with Tera Blast Grass.</p> <p>Choice Scarf Magneton is a good choice for many bulky offense and outright offensive teams. Magneton is the slowest viable Choice Scarf user, and it is unsuitable for revenge killing Speed-boosting sweepers, such as Oricorio-F and Lapras, and other Choice Scarf users, such as Passimian, Hisuian Sneasel, and Typhlosion. Other ways of taking care of these threats are therefore necessary. Prankster Encore users like Whimsicott and Sableye can greatly irritate and deter setup from the aforementioned setup threats, while the former can form a pivoting core with Magneton. Meanwhile, defensive checks to the other Choice Scarf users, such as Sandaconda and Weezing for the former, and Lanturn for the last two, serve to greatly assist Magneton. Magneton can help these teammates out by bringing them into battle safely with Volt Switch and revenge killing unboosted offensive foes for them. Magneton also benefits from teammates that can effectively take down Lanturn and problematic Ground-types. Strong Grass-types, such as Virizion and Alolan Exeggutor, can switch into and pressure these foes. Magneton's tendency to force these threats to switch in also opens the door for them to enter battle via advantageous double switches. Other powerful wallbreakers, such as Glastrier, Sneasel, and Clawitzer, can also threaten these foes, while Magneton can bring them into battle safely with Volt Switch; the first three pressure special walls, such as Snorlax, that can sponge Magneton's attacks. Articuno is another notable teammate, as it forms a pivoting core with Magneton, threatens many of its checks with Freeze-Dry, and can annoy setup sweepers that Magneton cannot deal with via Haze.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 452572, "username": "missangelic"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Dodrio": {"sets": {"Swords Dance": {}}},
  "Muk": {"sets": {"Defensive": {}}},
  "Haunter": {"sets": {"Choiced": {}}},
  "Exeggutor-Alola": {"sets": {"Choice Specs": {}, "Offensive Trick Room": {}, "Bulky Attacker": {}}},
  "Hitmonchan": {"sets": {"Bulky Rapid Spin": {}}},
  "Weezing": {
    "overview": "<p>With its incredible physical bulk, great typing, and ability, Weezing serves as an excellent physical wall. Its Poison typing gives it a resistance to Fighting-type attacks, making it an incredible check to Fighting-types, such as Virizion and Passimian. Its bulk allows it to easily spread status through Will-O-Wisp and Sludge Bomb, making Weezing incredibly irritating to switch into. However, Weezing lacks any reliable recovery, making it easy to wear down over the course of a game. Its mediocre special bulk means it folds to any strong special attack.</p>",
    "comments": "<h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Weezing's lacking Special Defense makes it susceptible to any strong neutral attack from the likes of Charizard, Mismagius, and Jolteon. However, Sludge Bomb's nasty poison chance makes it hard to consistently switch these attackers in.</p> <p><strong>Residual Damage</strong>: As tanky as Weezing is, its lack of reliable recovery leaves it prone to being overwhelmed, especially in longer games versus bulkier teams. Strong attacks can easily bypass Pain Split's weak healing, leaving Weezing vulnerable to being forced past by attackers like Sneasel and Dodrio.</p> <p><strong>Psychic-types</strong>: Mesprit can easily switch in on Weezing, only fearing Sludge Bomb's poison chance, threaten it out, and use it to set entry hazards, pivot with U-turn, set up Substitute or boosts, or do any other of the million things it does. Farigiraf can also easily enter on Weezing and start boosting. Less common Psychic-types like Malamar, Indeedee-F, and Veluza still scare Weezing out with super effective Psychic-type attacks and use it to force progress throughout the game, though none of them enjoy being poisoned or burned.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Sludge Bomb's poison chance makes it the preferred attack of choice, threatening otherwise safe switches like Mesprit and Lanturn with uncomfortable chip damage. Will-O-Wisp cripples physical attackers and spreads chip damage on common switch-ins like Lanturn and Mesprit. Pain Split gives Weezing some staying power and helps it stick around in longer games. Haze denies setup sweepers like Swords Dance Virizion. Taunt messes with defensive foes, denying attempts at setting entry hazards, spreading status, and recovery. Toxic Spikes messes with grounded Pokemon like Regirock and is great into bulkier teams. Rocky Helmet chips away at physical attackers using contact moves. Levitate lets Weezing hover over Spikes as well as Ground-type moves, letting it ignore Earthquake from Passimian and Sandaconda. Tera Steel makes Weezing resist Psychic-type attacks from Mespirit and Farigiraf, as well as a ton of other types like Flying, Normal, and Ice, making it a better check to many physical attackers like Dodrio and Glastrier. However, Tera Steel makes Weezing weak to Fighting-type attacks, reducing its effectiveness as a check to Fighting-types like Hitmontop and Passimian.</p> <p>Balance teams can tend to struggle against the many strong Fighting-types like Passimian, so Weezing is a great fit on these teams to take this pressure off its teammates. Because of this, Fighting-weak partners like Sneasel appreciate Weezing's presence. Glastrier is another wallbreaker that balance teams struggle with, and Weezing can help its team dance around it. As Weezing can't take special hits very well, special walls like Lanturn and Orthworm are helpful for sponging the special attacks aimed at Weezing. Lanturn and Orthworm coincidentally form a powerful defensive core with Weezing, with Weezing covering Lanturn's Grass- and Ground-types for Lanturn and Fighting-types for Orthworm. In return, Lanturn blanket checks most special attackers for Weezing, particularly the Fire-types that can enter on a predicted Will-O-Wisp, as well as Magneton, which can use Weezing as an easy entry point. Snorlax appreciates Weezing's Fighting resistance and, in return, handle threatening special attackers like Mismagius and Rotom for it. Offensive threats like Glastrier and Sneasel appreciate having Weezing to fall back on against would-be revenge killers like Passimian.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 643347, "username": "calmvibes"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Tauros": {"outdated": true, "sets": {"All-Out Attacker": {}}},
  "Lapras": {"sets": {"Special Tank": {}}},
  "Ditto": {"sets": {"Revenge Killer": {}}},
  "Jolteon": {
    "overview": "<p>Jolteon establishes itself as a premier fast pivot with its great Speed and solid power. Its fast Volt Switch makes it an easy candidate on VoltTurn teams, and its adequate coverage with Alluring Voice and Shadow Ball discourages specially bulky Pokemon like Virizion and Mesprit from switching into it. Jolteon's decent set variety means it can be a deadly Calm Mind sweeper or a dangerous wallbreaker with Choice Specs. Jolteon's defensive utility with Volt Absorb and passable special bulk also makes it a situational switch-in to special attackers like Articuno and opposing Jolteon. However, the lacking power of its coverage moves causes it to struggle quite hard against specially defensive Pokemon like Snorlax as well as Ground-types like Sandaconda. Said Ground-types make Jolteon quite reliant on Terastalization to bypass its checks, which causes it to demand for more team support.</p>",
    "comments": "<h3>Other Options</h3> <p>On Choice Specs sets, Tera Blast Water can be used as a coverage move to drench Ground-types like Sandaconda and Sandslash. Tera Blast Ice and Tera Blast Fire both threaten Jolteon's Grass-type checks, with the former even targeting Ground-types. However, slotting Tera Blast makes Jolteon more reliant on team support to weaken its checks, and Terastalizing Jolteon into an Ice- or Fire-type requires entry hazard removal. Jolteon still gets walled by Grass-types if running Tera Blast Water. Tera Blast Flying gives it an immunity to Ground-type moves and maintains coverage against Grass-types, though it once again demands hazard removal.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Specially defensive Pokemon like Snorlax and Regirock are not particularly bothered by even Choice Specs Jolteon, as they have the bulk to weather repeated hits and can threaten huge damage on it back with their respective STAB moves. Volt Absorb Lanturn can block Jolteon's Volt Switch and chip it down with Scald.</p> <p><strong>Ground-types</strong>: Toedscruel and bulky Tera Ground users like Shaymin and Articuno are Jolteon's biggest obstacles, preventing it from pivoting, and Toedscruel can proceed to set up Spikes against it. However, Ground-types that have mediocre special bulk like Sandaconda and Sandslash must be wary of Jolteon's Choice Specs-boosted coverage.</p> <p><strong>Grass-types</strong>: Shaymin's excellent natural bulk makes it a reliable Grass-type switch-in, with it being able to threaten it back with STAB-boosted Seed Flares. Other Grass-types like Dipplin, Alolan Exeggutor, and Virizion are similarly effective but must watch out for coverage options.</p> <p><strong>Revenge Killers</strong>: Despite being the second fastest unboosted Pokemon in the metagame, Jolteon has mediocre longevity and can get picked off easily by faster Choice Scarf users like Passimian without too much trouble. Both of these Pokemon can also pivot on it in return, causing Jolteon's teammates to lose momentum. Slower cleaners or wallbreakers with priority moves like Sneasel can exploit Jolteon's low physical bulk without too much prior damage.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>After one Calm Mind boost, Jolteon's Thunderbolt 2HKOes unboosted Orthworm. Volt Switch maintains momentum and allows it to escape bad matchups like Snorlax, Regirock, and Virizion. Jolteon's fourth moveslot is flexible and can depend on the team's need for coverage. Alluring Voice discourages certain Grass-types like Virizion from switching in and also targets Dragon-types like Dipplin and Alolan Exeggutor that would be comfortable switching into its Electric-type STAB moves. It also hits Tera Dragon users like Sandaconda and Regirock, walls that would otherwise switch into Jolteon without too much trouble. Shadow Ball hits Mesprit harder than any of its STAB moves do while also hitting Ghost-types like Mismagius quite hard. While Jolteon's Tera type is flexible, Tera Blast Ice synergizes the best when striking back at its overall checks, hitting Ground-types like Sandaconda and Sandslash and Dragon-types like Alolan Exeggutor and Dipplin. However, this comes at the cost of using up the Terastallization slot. Tera Fairy and Tera Ghost, on the other hand, strengthen Alluring Voice and Shadow Ball, respectively, and make Jolteon slightly better at taking Fighting-type attacks from Pokemon like Passimian and Virizion. Volt Absorb allows Jolteon to switch in against predicted Electric-type attacks from Pokemon like opposing Jolteon.</p> <p>Jolteon's blistering Speed makes it a prime candidate for VoltTurn teams, pairing well with pivots like Mesprit and Passimian. In addition to pivoting, they all can provide utility with Knock Off. Knock Off support works especially well with Jolteon, as its Volt Switch is able to put more pressure on Pokemon reliant on items like Leftovers and Heavy-Duty Boots for longevity, such as walls like Snorlax and Regirock. Wallbreakers like Glastrier benefit from Jolteon's Volt Switch and can capitalize on its checks. Grass- and Water-types like Shaymin, Virizion, and Poliwrath can switch in and force out the Ground-types Jolteon struggles against and delay its need to Terastallize. Similarly, checks to Grass-types like Orthworm and Articuno can similarly benefit Jolteon either through entry hazard and status support or through pivoting, respectively, allowing it to Terastallize as a later time. Deterrents to Snorlax like Regirock and Passimian are valuable for pressuring it to Terastalize sooner, which can be exploited by teammates like Perrserker and Hisuian Sneasel.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs boosts Jolteon's decent power to more threatening levels while still leveraging its excellent Speed. Volt Switch allows Jolteon to escape from walls like Snorlax and Regirock and maintain momentum for its team. Alluring Voice and Shadow Ball are Jolteon's strongest options for coverage against Ground-type foes; the former strikes at Fighting- and Dragon-types like Virizion and Alolan Exeggutor, while the latter pressures Ghost-types like Rotom. Despite Jolteon's frailty, Volt Absorb gives it limited defensive utility by making it a situational switch-in against Electric-types like opposing Jolteon and Magneton.</p> <p>While Choice Specs's enhanced power makes Jolteon more threatening as a pivot, it still struggles to tackle Ground- and Grass-types. Water- and Grass-types like Clawitzer, Virizion, and Whimsicott are great candidates to threaten these walls. Jolteon can form VoltTurn cores with fellow pivots like Passimian and Perrserker, keeping momentum while threatening Jolteon's checks like Snorlax and Alolan Exeggutor. Water-types like Clawitzer pair excellently with Jolteon, threatening out Ground-types like Sandslash that intend to block Jolteon's Volt Switch while maintaining a VoltTurn core. Similarly, checks to Grass-types like Charizard and Hisuian Sneasel can take advantage of Jolteon's Volt Switch and threaten heavy damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528485, "username": "DerpySuX"}]}]}
  },
  "Snorlax": {
    "overview": "<p>Continuing its dramatic fall from grace from the higher tiers, Snorlax now establishes itself as a dominant force in ZU with its Curse sets. Thanks to its overall outstanding bulk and offensive versatility, Snorlax is quite difficult to stop once it gets stat boosts, even when factoring in Rest turns. Snorlax isn't just limited to late-game cleaning, either  it can also use said bulk and Thick Fat to function as a reliable sponge to common special attackers like the Oricorio-F, Jolteon, and Typhlosion while also being a good paralysis spreader with Body Slam. Walls comfortable switching into Body Slam also have to be aware of Heat Crash, limiting the consistency of its switch-ins. However, its low Speed and reliance on Rest or Protect for recovery make it quite easy to pressure it into passivity and cost momentum for its team. Snorlax's lack of resistances also makes it easy for Fighting-types like Virizion and Passimian to pressure it to Terastallize earlier than expected, which forces careful play to ensure a successful sweep.</p>",
    "comments": "<h3>Other Options</h3> <p>Snorlax's coverage move is quite flexible - Crunch hits Ghost-types like Drifblim harder, while Heavy Slam more heavily pressures Tera Fairy setup sweepers like Mesprit. However, Crunch is usually noticeably weaker compared to Heat Crash, and Heavy Slam worsens its matchup against Steel-types and Tera Steel Pokemon and is still walled by Rock-types. Sleep Talk over Curse makes Snorlax more consistent as a special wall at the cost of its late-game potential. Heavy-Duty Boots is a notable alternative to Leftovers, allowing Snorlax to fare better against entry hazards and easing the need for hazard removal. However, Snorlax usually appreciates the passive recovery from Leftovers better. Offensive sets like Choice Band are usable to surprise the opposition but are held back by Snorlax's low Speed and giving up quite a lot of its bulk.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Rock-types like Regirock and Naclstack are not particularly bothered by even a boosted Snorlax and can set up Stealth Rock or pressure it with repeated uses of Body Press, with the latter two even using it as setup fodder.</p> <p><strong>Fighting-types and Fighting-type Coverage</strong>: Fighting-types like Virizion and Passimian can threaten huge damage on Snorlax with their Fighting-type STAB moves, though none of them particularly enjoy it Terastallizing to Fairy. Hisuian Sneasel can even threaten Snorlax even when the latter Terastallizes with its Poison-type STAB moves. Pokemon with Fighting-type coverage like Clawitzer and Glastrier can also pressure it into Terastallizing sooner than expected.</p> <p><strong>Strong Wallbreakers</strong>: Strong physical wallbreakers like Glastrier and Dodrio can strike at Snorlax's initially lower physical bulk and cause it to use Rest sooner than expected.</p> <p><strong>Coil Sweepers</strong>: Orthworm can consistently keep up and eventually overpower Snorlax thanks to its Steel typing. While Sandaconda cannot outright beat Snorlax without critical hits, it can outlast Snorlax by PP stalling and can brush off status with Shed Skin.</p> <p><strong>Item Removal</strong>: Snorlax's Leftovers is an essential part for it to wall and sweep teams; Knock Off users like Mesprit, Muk, and Dodrio endanger its chances of sweeping and follow up with strong STAB moves in their arsenals. Trick and Switcheroo users like Whimsicott and Mismagius can outright neuter Snorlax's sweeping potential with a Choice item, forcing it out.</p> <p><strong>Residual Damage</strong>: Snorlax hates taking residual damage, with common entry hazard setters like Orthworm and Sandaconda making it more difficult for Snorlax to sweep; the latter two can also rack up additional chip damage with Rocky Helmet. Status like burn and poison also forces Snorlax to use Rest, causing it to become more passive. Snorlax also can quickly get worn down by VoltTurn users like Mesprit, Whimsicott, and Jolteon as a switch-in to them, risking losing momentum against them.</p>",
    "sets": {
      "CurseLax": {
        "description": "<p>STAB Body Slam not only functions as Snorlax's primary attacking move but also threatens incoming switch-ins like Poliwrath and Passimian with the chance of paralysis. Heat Crash is a powerful coverage move that hits both Ghost-types like Rotom, Mismagius, and Sableye that would freely switch into Body Slam and Tera Steel users like Weezing and Mesprit. Rest fully restores Snorlax's health and removes existing status conditions at the expense of making it passive for two turns. Alternatively, Protect scouts for Choice-locked foes like Passimian and Rotom and racks up additional Leftovers recovery at the cost of being unable to remove status. Tera Fairy turns its Fighting weakness into a resistance and provides an immunity to Dragon-type moves from foes like Dipplin and Alolan Exeggutor. Tera Fairy Snorlax also benefits from Poison- and Steel-type moves being uncommon. Thick Fat strengthens its defensive profile by making it a consistent switch-in to Fire- and Ice-types like Typhlosion, Charizard, and Froslass.</p> <p>Snorlax excels mid- or late-game as a setup sweeper that can take advantage of Fighting-types and wallbreakers being worn down. Physical walls like Regirock shore up Snorlax's lower physical bulk and can provide entry hazards to wear down switch-ins like Magneton and opposing Regirock. Choice item wallbreakers like Whimsicott and Jolteon can simulataneously provide wallbreaking and pivoting support for Snorlax to enter the field safely. Poison-types like Weezing can help with Snorlax's weakness to Fighting-types and provide additional utility. Rock-types like Regirock and Naclstack can easily ward off anything Snorlax can do, so checks to them like Virizion, Shaymin, and Weezing are helpful to consistently force them out. Due to Snorlax's utility as a special wall and susceptibility to residual damage, hazard removers like Sandslash and Lurantis are critical in preventing Snorlax from being worn down by hazards; the lack of hazards make it far more consistent walling foes and sweeping throughout a game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Articuno": {
    "comments": "<h3>Other Options</h3> <p>Hurricane is less reliable than Freeze-Dry but is stronger and much more significant against foes that resist Ice such as Typhlosion, Sneasel, and Glastrier. A more offensive EV spread using Hurricane can catch faster or more offensive Pokemon expecting to get the jump on Articuno off-guard, letting Articuno nail foes weak to Freeze-Dry like Rock Blast Sandaconda and Clawitzer while still maintaining its good bulk. However, Articuno is not very strong on its own and tends to be outclassed by other offensive pivots like Mesprit, Passsimian, and Whimsicott for their superior power, coverage, and utility from moves like Knock Off, Trick, and Switcheroo. Tera Ground alleviates Articuno's 4x Rock weakness and gives it an immunity to Electric to enable it to block Volt Switch, but it worsens Articuno's matchups against specially offensive Grass-types like Whimsicott, Calm Mind Virizion, and Alolan Exeggutor that it's meant to check.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types and Rock-type Coverage</strong>: Articuno's 4x Rock weakness makes Rock-type moves a huge threat to it. Regirock and Lycanroc can threaten out Articuno and use it as an opportunity to set up entry hazards. Naclstack cannot get frozen, can recover off chip damage from Articuno, and wears Articuno down with Salt Cure. Sandaconda and Virizion commonly run Rock-type coverage but must be wary of Articuno's Freeze-Dry and strong Hurricane.</p> <p><strong>Item Removal</strong>: Articuno depends on its Heavy-Duty Boots to avoid losing 50% of its HP to Stealth Rock as it switches in, so losing them hurts its longevity and pushes it to Terastallize. Mesprit is a common special attacker that can lure Articuno in and threaten to use Knock Off or give it a Choice item with Trick. Mismagius and Whimsicott respectively run Trick and Switcheroo.</p> <p><strong>Steel-types</strong>: Orthworm shrugs off attacks from Articuno, threatens it with its Steel-type STAB moves, and can set up Coil or entry hazards on it. Magneton is only chipped by Articuno's attacks, threatens it with its STAB moves, and can keep up momentum if Articuno switches out with its STAB Volt Switch.</p> <p><strong>Electric-types</strong>: Jolteon, Rotom, and Alolan Raichu resist Hurricane, threaten Articuno with their Electric-type STAB moves, and can gain momentum with Volt Switch. All three of the Electric-types can use setup moves to blow through Articuno.</p> <p><strong>Fire-types</strong>: Charizard and Typhlosion overcome Articuno's massive special bulk thanks to their super effective STAB attacks. Although Typhlosion resists Freeze-Dry, it prefers not to take damage in order to preserve the power of its Eruption. Oricorio-F can use Taunt on Articuno and set up on it with Quiver Dance and Roost. However, all of them struggle to break through Tera Dragon Articuno.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Amazing bulk and reliable recovery make Articuno a cool special wall in the ZU metagame. Special attackers like Whimsicott and Shaymin struggle to break through Articuno on their own. Roost keeps Articuno healthy and lets it take repeated hits from special wallbreakers like Alolan Exeggutor and Clawitzer while stonewalling more passive Pokemon like Dipplin and Cryogonal. Freeze-Dry has the best coverage and reliability of any of Articuno's moves, nailing Grass- and Water-type special attackers like Arboliva and Lanturn. U-turn helps Articuno keep up momentum against wallbreakers that might switch in against it like Charizard, Typhlosion, and Magneton. Haze immediately removes boosts from special setup users like Mesprit and Farigiraf. Roar is an alternative to Haze that lets Articuno rack up residual damage from entry hazards, but it forces Articuno to move second and fails if the target is the last active member of its team. Tera Dragon helps Articuno beat Fire-types it struggles against like Charizard and Typhlosion. Tera Steel gives Articuno a Toxic immunity and lets it more reliably check attackers like Muk, Alolan Exeggutor, and Farigiraf.</p> <p>Articuno is a great choice for balance teams in need of a specially defensive Pokemon. However, Articuno can also support more offensive teams thanks to U-turn enabling teammates like Typhlosion, Charizard, and Clawitzer. Pokemon vulnerable to Grass-types and special attackers such as Sandaconda and Dipplin greatly appreciate Articuno's support, and they can assist it against threatening physical attackers like Passimian and Lycanroc, respectively. Articuno can form cores with other pivots like Passimian and Jolteon, helping it to keep up momentum and support its teammates despite being a wall. Articuno's 4x weakness to Rock is a major vulnerability that can be covered by partners like Virizion, Orthworm, and Sandslash. Entry hazard setting partners like Naclstack, Regirock, and Sandslash complement Articuno running Roar, as Articuno racks up hazard damage with Roar, forces Dipplin out even if it Terastallizes, and pressures other Pokemon vulnerable to hazards like Snorlax and Regirock to switch in. Knock Off users like Mesprit and Passimian support Articuno if it runs Roar to rack up entry hazard chip damage by removing Heavy-Duty Boots from foes dependent on them to avoid hazard damage such as opposing Articuno, Sandslash, and Charizard. Articuno struggles with Fire-types like Typhlosion and Charizard, so Snorlax and Regirock partner well with it by bolstering against these bad matchups. Steel-types like Orthworm and Magneton can respectively set up on Articuno and break through it, so teammates like Passimian and Virizion can threaten them for Articuno.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Typhlosion": {
    "overview": "<p>Choice Specs Typhlosion is an insanely powerful special attacker in a tier without much in the way of sturdy Fire-resistant Pokemon. Much of its power comes from its move Eruption, which has unparalleled strength with Typhlosion at full health and can OHKO most neutral targets such as Mesprit and Passimian. With Typhlosion's Speed tier, it outspeeds much of the unboosted metagame, meaning that it can frequently come in and pick up KOs. However, Choice Specs Typhlosion struggles against faster Pokemon such as Hisuian Sneasel and Choice Scarf users like Passimian that can damage it before it moves and limit its power; it's also checked by the few Pokemon that can take on its Eruption reliably such as Snorlax and Poliwrath, necessitating a team to have good answers to them such as Regirock and Dipplin, respectively. On the other hand, the Choice Scarf set misses out on some OHKOs against targets like Mesprit, but it outspeeds common Choice Scarf users like Rotom and Passimian and fast attackers like Sneasel and Jolteon. Typhlosion's Eruption is limited by Stealth Rock as well as other damaging entry hazards, meaning it requires hazard removal support from the likes of Sandslash.</p>",
    "comments": "<h3>Other Options</h3> <p>Heavy-Duty Boots might seem tempting to ignore entry hazards and preserve the power of Typhlosion's Eruption, but this comes with the trade-offs of sacrificing vital power or Speed on Typhlosion, leaving it otherwise outclassed by Charizard once Eruption is no longer at full power. An alternative Tera type like Ground might seem interesting for Typhlosion to catch fast revenge killers like Jolteon and Choice Scarf Magneton off guard while powering up its Scorching Sands. However, Typhlosion should prioritize using its Fire-type moves to their fullest, as it without Tera Fire, it will otherwise miss out on KOs such as Choice Scarf Mesprit after Stealth Rock damage, Jolteon, and Mismagius.</p> <h3>Checks and Counters</h3> <p><strong>Entry Hazards</strong>: Stealth Rock, Spikes, and even Toxic Spikes ruin Typhlosion's stand-out power and the reason to use it. Sticky Web leaves Typhlosion prone to being outsped.</p> <p><strong>Special Sponges</strong>: Snorlax and Regirock can withstand Eruptions from Typhlosion. Typhlosion can deal significant damage to these Pokemon with Focus Blast, but the inconsistent accuracy and commitment of locking into a coverage move are hard on Typhlosion. Scorching Sands hits Lanturn for solid damage, but Typhlosion dislikes locking into it due to its low power and exploitability by foes immune to Ground such as Orthworm, Mesprit, and Rotom-C. Defensive Terastallization flips Articuno from easy prey for Typhlosion to a wall capable of burning through the low PP of Typhlosion's moves with Pressure.</p> <p><strong>Pokemon Immune or Resistant to Fire</strong>: Typhlosion should prioritize using Eruption, so Pokemon immune to it and Pokemon that can tolerate it are a huge issue if Typhlosion is to keep its Eruptions powerful. Lanturn can pivot into Typhlosion's Fire-type moves and generate momentum with Flip Turn or Volt Switch. Charizard and Clawitzer can retaliate with a strong hit against Typhlosion to impair its power after they withstand one Tera Fire Choice Specs Eruption. Oricorio-F can boost its Special Defense with Quiver Dance and stall Typhlosion out of Eruptions with Roost.</p> <p><strong>Priority</strong>: Even chip damage wrecks the power of Eruption, and Typhlosion's lacking Defense and defensive typing leave it prone to being picked off once it's in range of Blaze. Even otherwise an easy target like Hitmontop can clip Eruption's power to make Typhlosion easier to handle.</p> <p><strong>Faster Revenge Killers</strong>: Choice Specs Typhlosion is speedy but still slower than Virizion, Jolteon, and Mismagius as well as Choice Scarf users like Mesprit, Rotom, and Passimian. Choice Scarf Typhlosion is quite fast for a Choice Scarf user but is still outsped by faster Choice Scarf users like Hisuian Sneasel and Mismagius.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Eruption is Typhlosion main STAB attack, dealing insane damage at full health, even being able to 2HKO Fire-resistant Pokemon like Regirock and Appletun with the help of Tera Fire. Fire Blast and Flamethrower are to be used when Typhlosion gets weakened; both options are valid and come down to personal preference between power and accuracy. Fire Blast namely gives better odds to OHKO threats such as Sandslash and Passimian. Focus Blast gives Typhlosion a chance to 2HKO Snorlax, which can easily take Fire-type attacks, as well as being its strongest move against Rock-types like Regirock and Naclstack. Scorching Sands targets Fire-types such as opposing Typhlosion and Pyroar as well as Lanturn, and it is a more accurate option to threaten Rock-types. Flash Fire lets Typhlosion switch into powerful Fire-type attacks without losing power on Eruption. Blaze boosts Typhlosion's secondary Fire-type STAB attack to insane levels in late-game scenarios, becoming about as strong as full-power Eruption.</p> <p>As a powerful wallbreaker, Typhlosion naturally benefits special cleaners such as Jolteon and Farigiraf that appreciate special walls getting weakened. If opting for Flash Fire, its immunity to Fire-type moves makes it a great teammate for Fire-weak Pokemon such as Glastrier and Rotom-C. Typhlosion appreciates VoltTurn support that can force in walls to get nuked by it, such as Articuno, Lanturn, and Mesprit as well as the aforementioned Jolteon and Rotom-C. Typhlosion has trouble breaking through Fire-resistant Pokemon, including Snorlax, Lanturn, and Appletun, which makes counters to these threats such as Orthworm and Articuno attractive. Entry hazard removal and deterrence is also appreciated from Pokemon such as Sandslash and Hattrem to keep Typhlosion at full health as long as possible. Healing Wish Pokemon like Shaymin and Mesprit can give Typhlosion a second chance at full health Eruptions later in the match. Defensive Pokemon that can take on revenge killers such as Choice Scarf Passimian and Lycanroc, like Weezing and Poliwrath, respectively, make for great partners.</p>"
      },
      "Choice Scarf": {
        "description": "<p>When it holds a Choice Scarf, Typhlosion is free to rain its powerful Eruption down onto the entire unboosted metagame and even a majority of the boosted metagame, making it powerful speed control, a dangerous revenge killer, and a strong cleaner all-in-one. Fast Pokemon like Jolteon and Choice Scarf Mesprit don't require much chip damage before they're at risk of being KOed by Eruption. Fire Blast lets Typhlosion keep up a good damage output once Eruption is no longer at maximum power, and it still threatens to OHKO foes like Sneasel, Virizion, and Whimsicott. Focus Blast 2HKOes Fire-resistant Pokemon like Regirock and Naclstack, and it is Typhlosion's strongest coverage move against Snorlax. Scorching Sands covers Fire-types like Pyroar and opposing Typhlosion, wears down Lanturn, has greater accuracy against Rock-types, and can spread burns with a little bit of luck. Tera Fire enables Typhlosion to OHKO Choice Scarf Mesprit with Eruption after Stealth Rock damage. Flash Fire powers up Typhlosion's STAB moves to make it an even more dangerous cleaner if it can switch in on a Fire-type move from Charizard, opposing Choice-locked Typhlosion, or Will-O-Wisp from Weezing and Spiritomb, although Typhlosion often doesn't switch into most Pokemon if it wants to preserve the power of Eruption. Blaze can reignite Typhlosion's power once it's been worn down enough, boosting Fire Blast beyond even Eruption's maximum power, although purposefully and safely getting Typhlosion into range of Blaze once Eruption is no longer at maximum power can be tricky.</p> <p>Choice Scarf Typhlosion distinguishes itself through the power of its Eruption, so it depends on teammates like Sandslash and Hitmontop to remove entry hazards that would dampen the power of Eruption. Special wallbreakers like Nasty Plot Mesprit, Choice Specs Jolteon, and Alolan Exeggutor can soften up or remove special sponges like Snorlax for Typhlosion to more easily clean up. Snorlax is a very common special sponge that comfortably walls Typhlosion, so Typhlosion benefits from teammates that check Snorlax like Regirock, Passimian, and Orthworm. Chip damage from hazards wears down common checks to Typhlosion such as Regirock, Snorlax, and Naclstack, making hazard setters like Sandslash and Orthworm excellent support for Typhlosion. Healing Wish support from Mesprit and Shaymin can give Typhlosion another opportunity to melt down targets with Eruption. Typhlosion appreciates pivots bringing it in safely, especially on their checks, such as Mesprit with Orthworm and Articuno and Jolteon with Shaymin and Magneton. Lanturn and Magneton are especially good pivots to partner with Typhlosion, as they give it opportunities to threaten Grass-types they invite in like Rotom-C and Virizion. Typhlosion struggles against Water-types such as Lanturn and Poliwrath, so it appreciates partners that check each of them such as Whimsicott and Weezing, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 648292, "username": "budgetplayer"}, {"user_id": 369076, "username": "Tuthur"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Lanturn": {
    "comments": "<h3>Other Options</h3> <p>Lanturn can use Tera Flying to remove its Ground weakness and more comfortably answer defensive Sandaconda and Sandslash, though this set should always use Volt Absorb to still check Electric-types. Lanturn could use Thunder Wave for more reliable paralysis spreading, but it cannot make room for Thunder Wave without its moveset leaving it extremely passive. Leftovers is an alternative to Heavy-Duty Boots to extend Lanturn's longevity and make it less dependent on Rest for recovery, opening up options for different moves; Protect synergizes with Leftovers and allows Lanturn to scout attacks from Choice item users like Typhlosion and Mesprit, and Ice Beam leaves Lanturn less passive against Whimsicott and Dipplin. However, Lanturn will be more easily worn down by entry hazards as a pivot without Heavy-Duty Boots.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Lanturn's defensive coverage limits it from dealing significant damage to Grass-types, most of which threaten it super effectively. Rotom-C is especially dangerous as a Volt Switch pivot that has a super effective secondary STAB move against Lanturn. Nasty Plot Rotom-C, Virizion, and Dipplin can use Lanturn as a chance to set up, though they should be wary of potential status. Shaymin and Whimsicott can use Lanturn as an opportunity to switch in, but they're also challenged by status; Virizion especially dislikes burns, while Whimsicott is particularly hindered by paralysis. Slow and specially offensive Pokemon such as Alolan Exeggutor, Appletun, and Arboliva are the least impaired by Lanturn's status spreading. Shaymin can annoy Lanturn repeatedly and rely on Natural Cure to clear any status it takes from Lanturn.</p> <p><strong>Specially Bulky Pokemon</strong>: Lanturn's passivity means it often doesn't do much other than threaten to status specially defensive Pokemon, though many cannot prevent it from pivoting out. Curse Snorlax can use Lanturn as a chance to set up, though burns will force Snorlax to become more passive through Rest. Frosmoth can use Substitute to safely set up on Lanturn, and it's greatly enabled if Lanturn is forced to Rest.</p> <p><strong>Ground-types and Ground-type Coverage</strong>: A Ground weakness can leave Lanturn offensively overwhelmed by Sandslash in spite of its bulk. Ground-types like Sandaconda can beat Lanturn one-on-one if it lacks Scald, but they can't absorb its Flip Turn. Choice Specs Typhlosion can 3HKO Lanturn with Scorching Sands, but it will almost never switch into Lanturn. Charizard can only 4HKO Lanturn with Scorching Sands, but it can rely on prior damage and Lanturn's passivity to put it in a bad position.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Excellent bulk and defensive abilities let Lanturn shine as a specially defensive pivot that takes advantage of special attackers like Charizard, Typhlosion, and opposing Lanturn. Volt Switch generates momentum and doesn't trigger contact effects from Rocky Helmet. Flip Turn is a slightly weaker pivoting option with the trade-off of working against Jolteon, opposing Lanturn with Volt Absorb, and Ground-types like Sandaconda and Sandslash. Scald should always be run alongside Volt Switch; Lanturn uses it to threaten Pokemon that would block Volt Switch and burn physical attackers such as Thwackey and Virizion that might try to switch in. Discharge pairs with Flip Turn and has the added benefit of spreading paralysis to punish setup sweepers and faster Pokemon such as Oricorio-F, Whimsicott, and Mesprit. Lanturn appreciates Discharge not forcing it to switch out when attacking Pokemon weak to Electric such as Poliwrath and Clawitzer. Rest is Lanturn's best method of recovery, and Sleep Talk helps Lanturn be less passive while it's asleep. Heavy-Duty Boots is especially helpful, as Lanturn pivots in frequently. Volt Absorb lets Lanturn reliably answer Electric-types such as Jolteon, Magneton, and Vikavolt. Water Absorb is an option for Lanturn to thwart Water-type attacks from Clawitzer, but Lanturn answers fewer specially offensive Water-types beyond Clawitzer compared to Electric-types. Tera Dragon gives Lanturn few weaknesses as it enhances Lanturn's capacity to answer special attackers with super effective coverage such as Typhlosion and Charizard. Tera Fairy has similarly helpful benefits, especially against Whimsicott and Alolan Exeggutor. A specially defensive EV spread lets Lanturn reliably answer strong special attackers like Charizard, Typhlosion, and Clawitzer.</p> <p>Many other pivots form great cores with Lanturn thanks to the momentum they provide for teams. Mesprit covers Lanturn's Ground weakness with Levitate and threatens Virizion. Muk and Hisuian Sneasel can offensively threaten Grass-types with their Poison-type STAB moves, and they appreciate Lanturn taking on Jolteon. Whimsicott can threaten Grass-types like Dipplin and Virizion as well as Ground-types like Sandaconda and Sandslash. Virizion scares out Ground-types and threatens Snorlax. Other Poison-types like Muk and Weezing can check problematic Grass-types like Whimsicott and Virizion, and they benefit from Lanturn bringing them in safely while wearing down these targets. Strong wallbreakers like Typhlosion, Glastrier, and Vikavolt gain more opportunities to tear open holes in foes thanks to Lanturn's pivoting. Lanturn inviting in Snorlax can benefit Fighting-type partners such as Virizion and Hitmontop. Lanturn is especially appreciative of partners like Charizard, Oricorio-F, and Sneasel that threaten Grass-types that would pressure it, and it can return the favor by checking Electric-types for Charizard and Oricorio-F and Fire-types for Sneasel. Fire-weak Pokemon like Whimsicott and Orthworm especially benefit from Lanturn as a stopgap to Charizard and Typhlosion, and they match Lanturn's help by defensively answering Ground-types like Sandaconda and Sandslash. Water-types like Clawitzer and opposing Lanturn are a pain for Typhlosion and Charizard, so they can depend on Lanturn to handle these troublesome Pokemon for them, especially if Lanturn runs Water Absorb to deny Flip Turn from Clawitzer.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Bellossom": {"sets": {"Bulky Quiver Dance": {}}},
  "Sneasel": {
    "overview": "<p>With its blisteringly fast Speed and a deadly STAB combination, Sneasel carves a place for itself in ZU as a powerful wallbreaker and cleaner. STAB Knock Off makes Sneasel excellent at forcing progress, especially since the primary Knock Off absorber, Dipplin, fears its Ice-type attacks, and it outruns many already fast threats like Charizard, Mismagius, and Virizion. However, Sneasel's paper-thin defenses mean it crumples to most strong neutral attacks and, combined with its many weaknesses, give it near to no defensive utility outside of switching into Psychic-type attacks. Sneasel also can be left wanting in power and struggles to break past walls like Regirock and Orthworm. Choice Band sets don't have this problem but are vulnerable to entry hazards and very prediction reliant. Lastly, Sneasel is incredibly vulnerable to getting revenge killed by most Choice Scarf users in the tier, like Passimian, Sneasel-Hisui, and Typhlosion, as well as priority attacks such as Mach Punch from Hitmontop.</p>",
    "comments": "<h3>Other Options</h3> <p>Sneasel has no other options.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types</strong>: Sneasel greatly fears Fighting-types like Passimian and Hisuian Sneasel. Most of them don't enjoy switching in on Sneasel's attacks, however, though Poliwrath resists Sneasel's STAB moves and doesn't take much damage from Low Kick.</p> <p><strong>Choice Scarf Users</strong>: Sneasel's lack of bulk means that Choice Scarf users have an easy time outspeeding it and taking it out. All of Hisuian Sneasel, Passimian, and Mesprit can revenge kill Sneasel with ease.</p> <p><strong>Physical Walls</strong>: Physically bulky Pokemon like Regirock, Orthworm, and Weezing don't fear much from Sneasel and can force it out with status conditions or super effective attacks. However, since all three of them lack reliable recovery, and the former two hate losing Leftovers, Sneasel can slowly wear them down over a longer game. Glastrier also can take Sneasel on but hates losing its Heavy-Duty Boots. Snorlax can take a Knock Off well enough but doesn't appreciate losing its Leftovers either. All of them except Weezing also must be wary of Low Kick.</p>",
    "sets": {
      "Fast Attacker": {
        "description": "<p>Ice Shard lets Sneasel pick off weakened foes and faster attackers like Whimsicott and Jolteon as well as dance around priority like Mach Punch from Hitmonchan. Swords Dance lets Sneasel pick up OHKOs on Charizard and Dipplin and gives it an easier time cleaning up weakened teams, while Low Kick lets it threaten Orthworm, Regirock, and Glastrier more immediately. Heavy-Duty Boots lets Sneasel come in without taking damage from entry hazards, allowing it to come in many times over the course of a game. Tera Ice boosts Triple Axel and Ice Shard's power immensely, netting a 2HKO on Regirock and Weezing at +2, but does nothing to help Sneasel's terrible defensive typing. Tera Ghost flips Sneasel's Fighting weakness into an immunity, letting it blank Close Combat from revenge killers like Choice Scarf Passimian and Hisuian Sneasel.</p> <p>Sneasel's powerful Knock Off makes it an excellent pick on entry hazard stacking teams where teammates such as Sandslash and Orthworm help Sneasel push past bulkier foes like Magneton and Snorlax. Sneasel struggles to break past physically bulky foes like Regirock, Orthworm, and Weezing, so teammates that share these checks like Charizard, Mesprit, and Virizion, respectively, can team up to wear down said walls. Poliwrath notably takes little damage from Sneasel's STAB attacks, so teammates that handle it like Whimsicott and Shaymin are quite helpful. Physical wallbreakers like Lycanroc and Swords Dance Charizard also help wear walls down so Sneasel can sweep. Fighting-types like Passimian and Hisuian Sneasel threaten Sneasel immensely, so defensive fallbacks like Weezing make for great teammates. Other defensive teammates such as Snorlax and Poliwrath help make up for Sneasel's lack of defenses, dealing with threats like Whimsicott and Typhlosion for it. As Sneasel struggles to switch in directly, pivots like Jolteon, Passimian, Whimsicott, and Lanturn are all helpful in assisting Sneasel to hit the field safely. On more offensive teams, it can pair up with other setup sweepers like Oricorio-F and Mesprit to overwhelm the opposing team.</p>"
      },
      "Choice Band": {
        "description": "<p>Sneasel has very strong STAB moves and a great Speed tier to spam them. A Choice Band gives Sneasel the immediate raw power to make quick offensive progress against bulky Pokemon like Orthworm and Regirock. Choice Band also makes Sneasel a more reliable revenge killer to offensive threats like Charizard, Nasty Plot Mesprit, and Virizion. Low Kick is Sneasel's strongest move against physically bulky Pokemon like Glastrier, Regirock, and Orthworm, which take neutral or resisted damage from its STAB moves, but its limited coverage and variable power make it a difficult option to lock into. Tera Ice cranks up the power of Sneasel's strongest STAB move to ice out bulkier Pokemon such as Tera Fairy Nasty Plot Mesprit and Weezing. Tera Ice also boosts Sneasel's priority to more effectively pick off Jolteon, Oricorio-F, and Whimsicott.</p> <p>Choice Band Sneasel has great immediate damage output, quickly cutting through teams with Triple Axel and making progress with Knock Off. Choice Band Sneasel's ability to lure in and remove Leftovers from Regirock makes it a great enabler to offensive Pokemon that struggle against it such as Charizard, Snorlax, and Oricorio-F, and it functions similarly against Orthworm to support Mesprit and Whimsicott. Knock Off removing Heavy-Duty Boots from foes creates excellent synergy with entry hazard setting Pokemon such as Sandslash and Orthworm. Choice Band Sneasel is vulnerable to being worn down by entry hazards, particularly Stealth Rock, so hazard removers like Sandslash and Lurantis are critical to maximizing Sneasel's offensive presence. Defensive pivots like Lanturn and Mesprit can bring Sneasel in safely in spite of its poor bulk and vulnerable defensive typing. While Sneasel resists Shadow Sneak and Sucker Punch from foes like Muk and Hitmontop, its frailty leaves it prone to strong and super effective priority users; Sandaconda and Weezing can check Passimian and Hisuian Sneasel for Sneasel. Choice Band Sneasel is fast but still struggles with revenge killers like Passimian, Choice Specs, and Choice Scarf Typhlosion, which can be respectively handled by teammates like Orthworm, Weezing, and Regirock.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 543866, "username": "5Dots"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Sneasel-Hisui": {
    "overview": "<p>Hisuian Sneasel is a powerful and versatile threat in ZU, leveraging its excellent Speed tier and powerful STAB attacks to great effect. Not much in the metagame can withstand its potent Close Combat and Gunk Shot combination, and those that can, like Mesprit and Mismagius, are threatened by Throat Chop. With Switcheroo to disrupt foes that otherwise give it issues, like Iron Defense Regirock, Hisuian Sneasel has the tools to position itself to wreak havoc. Swords Dance Hisuian Sneasel can utilize Trailblaze to become a devastatingly fast and powerful late-game cleaner. It does, however, have subpar bulk without Eviolite and can struggle at times to pick up KOs against premiere walls like Dipplin and Regirock if they use Terastallization. Hisuian Sneasel's weaknesses to common types like Flying, Ground, and Psychic mean it struggles to hit the field safely and use its offensive traits to great success against notable foes like Charizard, Sandslash, and offensive Mesprit.</p>",
    "comments": "<h3>Other Options</h3> <p>Hisuian Sneasel has access to Toxic Spikes, which can cause disruption without needing to swap items with Switcheroo. Toxic, similarly, can be used to reliably status checks Hisuian Sneasel can't normally get past, such as Spiritomb. Taunt can be used to stop slower setup sweepers like Mesprit or prevent recovery attempts from foes like Dipplin and Oricorio formes, though it is difficult to use given how frail Hisuian Sneasel is.</p> <h3>Checks and Counters</h3> <p><strong>Psychic-types</strong>: Mesprit is a notable Hisuian Sneasel check with the bulk to withstand its powerful attacks and the ability to threaten it with an OHKO back. Farigiraf is similarly difficult for it to deal with.</p> <p><strong>Ghost-types</strong>: Spiritomb can sponge Hisuian Sneasel's attacks and threaten it back with Psyshock. Mismagius and Tera Ghost users like Magneton can also use their brute power to threaten an OHKO against it.</p> <p><strong>Faster Revenge Killers and Wallbreakers</strong>: Despite its excellent Speed tier, non-Choice Scarf Hisuian Sneasel is slower than common Choice Scarf users like Passimian and Mesprit, which can threaten it immensely with Earthquake and Psychic Noise, respectively. Likewise, Choice Specs Jolteon is able to pick Hisuian Sneasel off cleanly with Thunderbolt.</p> <p><strong>Poison-types</strong>: Weezing can reliably sponge attacks from Hisuian Sneasel and threaten to disrupt it with Will-O-Wisp. Muk is less reliable as a check but can nail it with Zen Headbutt after tanking an attack. Tera Poison Dipplin can stonewall Hisuian Sneasel with Sticky Hold to prevent disruption from Switcheroo and the ability to phaze it with Dragon Tail to stop setup attempts. Likewise, Tera Poison Regirock can use IronPress against Hisuian Sneasel to great effect, threatening to reverse sweep after just one boost.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance Hisuian Sneasel is a great setup sweeper in the ZU metagame, capable of blowing through teams as a late-game sweeper thanks to its strong STAB moves and good typing. Throat Chop provides the coverage to hit foes like Mesprit and Muk hard, preventing the former from hitting it back with Psychic Noise; Trailblaze, alternatively, can allow Hisuian Sneasel to outpace the entire metagame after one boost to more consistently threaten a sweep. Hitmontop. Tera Dark can stop Psychic-type attacks from halting a sweep, as well as boost Throat Chop tremendously, securing an OHKO on offensive Mesprit after a Swords Dance. Tera Dark also prevents niche Prankster users like Sableye from disrupting a potential sweep. Tera Grass, meanwhile, flips the weakness to Ground and allows Hisuian Sneasel to set up against foes like Sandslash.</p> <p>With its prolific Speed tier and snowballing ability, Swords Dance Hisuian Sneasel is a great fit on bulky offense and offense teams alike. Teammates that can provide entry hazards to chip down walls like Dipplin and Sandslash are much appreciated; on offensive teams, Primeape is a great lead, while on bulky offense teams, Mesprit and Orthworm provide Hisuian Sneasel hazards and reliable defensive pivots, if needed. Teammates that can lure in foes like Arboliva and Dipplin that Hisuian Sneasel can set up against include VoltTurn users like Magneton and Mesprit. Jolteon is another notable teammate, capable of setting up for its own sweep and flexibly pivoting into Hisuian Sneasel. Other setup sweepers like Mesprit, Mismagius, and Oricorio are great teammates, similarly helping break the opposition down for Hisuian Sneasel or taking advantage of worn down foes themselves to clean late-game. Vikavolt is a powerful support option, helping check Mesprit and providing Sticky Web so Hisuian Sneasel can outpace Choice Scarf users like Passimian and Mesprit. Other physical wallbreakers that can wear down shared checks include Virizion, which can help break down foes like Sandaconda and Sandslash that Hisuian Sneasel usually struggles with.</p>"
      },
      "Choice Item": {
        "description": "<p>Hisuian Sneasel is an exceptional wielder of Choice items, with its high Speed, coveted access to Switcheroo, and hard-hitting STAB attacks in Close Combat and Gunk Shot. Throat Chop provides Hisuian Sneasel a powerful attack to break past Ghost-types like Mismagius, as well as threatening big damage against Psychic-types like Farigiraf and Mesprit, even blocking Psychic Noise; Swords Dance is an alternative that gives Hisuian Sneasel the capacity to function as a setup sweeper after it has shed its item. Switcheroo is a big reason Choice item sets function so well, as it can disrupt common switch-ins like Sandslash immensely. Choice Band grants Hisuian Sneasel the damage output needed to pick up 2HKOs on notable foes like Dipplin and Mesprit; Choice Scarf sets, on the other hand, trade power for Speed, turning Hisuian Sneasel into the fastest late-game cleaner and revenge killer, which is useful against usually speedier foes like Jolteon and Whimsicott. Tera Fighting boosts Close Combat tremendously, with Choice Band sets being capable of OHKOing Farigiraf and Lanturn, while also removing Hisuian Sneasel's weakness to Ground. Tera Dark grants Hisuian Sneasel a useful immunity to Psychic while making Throat Chop far more difficult to stomach for foes like Mesprit. Tera Dark also blocks Prankster from affecting Hisuian Sneasel, turning foes like Sableye and the more niche Volbeat into setup fodder.</p> <p>A natural fit on bulky offense and balance teams, Hisuian Sneasel is a great choice as a Choice Band wallbreaker or Choice Scarf cleaner. Given Choice Band Hisuian Sneasel's propensity to blow holes in teams and force switches every time it hits the field, teammates that can help wear down walls like Dipplin, Regirock, and Spiritomb with entry hazards are much appreciated; Orthworm and Sandslash are great Spikes setters, and Mesprit is a notable Stealth Rock setter and pivot option. Other pivot options that can help Hisuian Sneasel get safe entry points in favorable matchups include Lanturn, which can invite in Snorlax. Choice Scarf Hisuian Sneasel appreciates other wallbreaker teammates that can enable it to pull off a late-game sweep, such as Choice Specs Magneton and Nasty Plot Spiritomb. Teammates that can help keep Charizard and Mesprit in check, like Snorlax, are valuable to provide defensive pivots for Hisuian Sneasel. Poison-type foes like Muk and Weezing can be difficult for Hisuian Sneasel to break through consistently, making Psychic-type partners like Farigiraf and Mesprit especially valuable. Similarly, Spiritomb can sponge Hisuian Sneasel's hits comfortably and use it as setup fodder, which makes Whimsicott valuable to threaten it back. Choice Band Hisuian Sneasel pairs well with setup sweepers like Swords Dance Virizion, as it can break holes in teams for Virizion to clean late-game or vice versa.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 452572, "username": "missangelic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Piloswine": {"outdated": true, "sets": {"Stealth Rock": {}, "Choice Band": {}}},
  "Smeargle": {"sets": {"Hazard Lead": {}}},
  "Hitmontop": {"sets": {"Rapid Spin": {}}},
  "Sceptile": {"sets": {"Choice Specs": {}, "Swords Dance": {}}},
  "Combusken": {"sets": {"Swords Dance": {}}},
  "Shiftry": {"sets": {"All-Out Attacker": {}}},
  "Sableye": {"sets": {"Utility": {}}},
  "Medicham": {"sets": {"Choice Item": {}, "All-Out Attacker": {}}},
  "Volbeat": {"sets": {"Weather Setter": {}}},
  "Cacturne": {"sets": {"Mixed Attacker": {}}},
  "Whiscash": {"sets": {"Wall": {}}},
  "Regirock": {
    "comments": "<h3>Other Options</h3> <p>On paper, Sturdy gives a healthy Regirock a guaranteed turn to set up Stealth Rock, but between Regirock being so bulky and entry hazards being ubiquitous, it's unlikely that Regirock would be at risk of being OHKOed from full HP outside of uncommonly strong hits like Clawitzer's Water Pulse or Alolan Exeggutor's Leaf Storm. Regirock is totally dependent on the passive recovery from Leftovers to be a reliable wall, so even items like Heavy-Duty Boots and Rocky Helmet are suboptimal. Stone Edge is generally stronger than Rock Blast but has unreliable accuracy and poor PP, and it and Rock Slide cannot break past Substitute Pokemon. Curse can be used as a setup move over Iron Defense to power up Regirock's Rock Blast, but the extra Defense from Iron Defense is more useful to stonewall physical attackers, and Regirock's Body Press is more powerful and reliable than its STAB move anyway. Protect can enhance Regirock's recovery from Leftovers and allow Regirock to scout common Choice item attackers like Jolteon and Whimsicott, but it makes Regirock much more passive. Tera Ghost lets Regirock become immune to Fighting-type moves from major offensive threats like Virizion and Passimian while preserving Regirock's ability to check Snorlax and enabling it to block Rapid Spin from Sandslash and Toedscruel. Tera Grass helps Regirock manage its common Grass, Water, and Ground weaknesses, whereas Tera Water lets Regirock better handle Glastrier, and Tera Steel shares Tera Poison's poison immunity and Grass resistance while giving Regirock an easier time against Mesprit and Farigiraf. Regirock can run a Careful nature to patch up its relatively lower special bulk, but Regirock is often tasked with taking on physical attackers, and more Defense investment benefits its IronPress combination.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Sandaconda has great longevity, while Sandslash and Toedscruel can remove Regirock's entry hazards with Rapid Spin, but all three must be wary of Regirock boosting too much with Iron Defense.</p> <p><strong>Special Attackers</strong>: Regirock's lower special bulk leaves it prone to being overwhelmed by special attackers like Mesprit, Jolteon, and Rotom. Magneton can hit Regirock super effectively with its STAB Flash Cannon. However, most special attackers are physically frail, and Magneton takes a lot of damage from Regirock's Body Press. Many special attackers also cannot KO Regirock without significant chip or several boosts.</p> <p><strong>Fighting-types</strong>: Regirock's Fighting weakness can lead it to fall victim to Fighting-types like Passimian and Virizion. Hitmontop and Hitmonchan can both remove Regirock's Stealth Rock. However, Regirock can turn the tables on physically offensive Fighting-types with its IronPress combination and Terastallization.</p> <p><strong>Grass-types</strong>: Whimsicott, Alolan Exeggutor, and Sceptile can blow through Regirock with their strong super effective STAB moves, and Whimsicott is distinguished for avoiding a 2HKO from Regirock's Body Press after Stealth Rock. Alolan Exeggutor annihilates Regirock, while Dipplin can phaze Regirock with Dragon Tail and use Recover to wall it back.</p> <p><strong>Water-types</strong>: Poliwrath can use non-IronPress Regirock as setup fodder. Clawitzer can OHKO Regirock with Water Pulse but cannot switch into Regirock's Body Press more than once with Stealth Rock up. Veluza resists Body Press and can break through Regirock's Defense boosts with Aqua Cutter.</p> <p><strong>Knock Off, Trick, and Switcheroo</strong>: Regirock relies on its Leftovers for recovery, so Knock Off users like Sneasel and Mesprit are disruptive to Regirock. Mespirit and Hisuian Sneasel can use Trick and Switcheroo to disrupt Regirock by giving it their Choice items.</p> <p><strong>Residual damage</strong>: Burns and poison neutralize Regirock's already limited passive recovery. Burns from Will-O-Wisp users like Weezing and Rotom halve Regirock's damage output, while Toxic from Muk and Toedscruel puts Regirock on a timer. Entry hazards like Stealth Rock and Spikes cause Regirock to struggle to stay healthy.</p> <p><strong>Taunt and Encore</strong>: Encore users like Whimsicott and Mesprit can lock Regirock into a move to exploit it though neither enjoy taking Body Press. Froslass and Primeape can use Taunt to stop Regirock from setting up Stealth Rock or Iron Defense. Sableye can run Taunt or Encore and does not fear Regirock's Body Press.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Thanks to its titanic Defense, Regirock can stonewall popular physical attackers like Snorlax and Sneasel and use them as an opportunity to set up Stealth Rock. Rock Blast deals reliable damage to Typhlosion, Oricorio-F, and Charizard and breaks Substitute on users like Mismagius and Jolteon. Body Press crushes Snorlax, Ice-types like Glastrier and Sneasel, and Steel-types like Orthworm and Magneton. Iron Defense boosts Regirock's physical bulk and powers up Body Press, turning Regirock into a bulky setup sweeper capable of suffocating physical attackers like Snorlax and overwhelming walls like Sandaconda. Thunder Wave slows down setup sweepers like Hisuian Sneasel and fast Pokemon like Whimsicott but makes Regirock more passive. Clear Body helpfully denies stat debuffs from Intimidate, Shadow Ball, and Triple Arrows. 16 Defense EVs and an Impish nature is a useful jump point to balance Regirock's bulk. Tera Poison helps with Regirock's Grass and Fighting weaknesses and gives it an immunity to poison.</p> <p>Regirock fits best on teams looking for a physically defensive backbone that can set up Stealth Rock. While Regirock has great physical bulk, its typing and comparatively lesser special bulk leave it more prone to strong special attacks. Specially defensive partners like Snorlax, Articuno, and Magneton complement Regirock's physical bulk and can intercept special attackers like Mismagius, Whimsicott, and Mesprit. Sandslash and Hitmontop can form entry hazard cores with Regirock and help keep it from taking entry hazard chip damage. Other Grass-type partners like Alolan Exeggutor, Dipplin, and Virizion are also appreciated by Regirock, as they can cover its Ground, Grass, and Water weaknesses by taking on Sandslash, opposing Dipplin, and Clawitzer, while Regirock can take on threatening Flying-types like Oricorio-F and Articuno.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Drifblim": {"sets": {"Defog": {}}},
  "Mismagius": {
    "overview": "<p>Mismagius's fantastic Speed and Special Attack stats, Ghost typing, and colorful coverage make it a powerful specially offensive threat. Nasty Plot sets can break specially bulky Pokemon like Lanturn, Regirock, and Articuno wide open, while Choice item sets lean into Mismagius's spammable STAB Shadow Ball. Terastallization greatly enables Mismagius offensively and defensively, especially with the synergies of Tera Fairy + Draining Kiss and Tera Electric + Levitate. However, Mismagius's bad physical bulk leaves it prone to fast physical attackers like Lycanroc, Sneasel, and Choice Scarf Passimian. Nasty Plot sets also struggle with Mismagius's frailty, reducing its opportunities to set up safely, especially when special walls like Snorlax can tank Mismagius's attacks and neutralize it.</p>",
    "comments": "<h3>Other Options</h3> <p>Mystical Fire nails Steel-types like Magneton and Orthworm alongside hitting Sneasel super effectively. However, Mismagius has better synergies available to it with Fairy-type coverage moves and Tera Fairy or Thunderbolt and Tera Electric. Will-O-Wisp can punish special walls like Regirock and Snorlax, but the latter tends to run Rest anyway, and some walls, like Lanturn, aren't hindered by an Attack drop. Choice item sets can run Tera Ghost to power up Mismagius's spammable STAB Shadow Ball, but Tera Fairy and Tera Electric are more valuable for offering Mismagius outs against Dark-type moves and paralysis, respectively.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Snorlax and Regirock can survive Mismagius's boosted attacks and hit it back hard, Articuno and Cryogonal can use Haze to remove Nasty Plot boosts, and Naclstack resists Shadow Ball and can use Salt Cure to wear Mismagius down. However, all special walls must be wary of Choice item Mismagius using Trick and Nasty Plot Mismagius using Taunt or Substitute.</p> <p><strong>Faster Attackers</strong>: Physical attackers like Lycanroc exploit Mismagius's much lower Defense. Sneasel resists Shadow Ball, safely threatens to OHKO Mismagius with Knock Off, and can play around Mismagius Terastallizing with Triple Axel. Jolteon commonly runs Shadow Ball for coverage, and it can use Volt Switch to chip down Mismagius into range of a KO. Choice Scarf users like Rotom-C and Mesprit can also finish off a weakened Mismagius.</p> <p><strong>Paralysis</strong>: Mismagius's frailty leaves it vulnerable to being revenge killed, so paralysis spreaders like Magneton and Lanturn can ruin it. Despite being weak to Ghost-type attacks, Mesprit and Hattrem are bulky enough to survive a Shadow Ball from non-Choice Specs Mismagius and paralyze it in desperation.</p>",
    "sets": {
      "Nasty Plot": {
        "description": "<p>Mismagius can use its Ground, Normal, and Fighting immunities to find setup opportunities with Nasty Plot, opening it up further as a special wallbreaker and cleaner. Draining Kiss provides Mismagius some extra recovery as it attacks, and Mismagius can use its special bulk to enable this strategy. Mismagius can alternatively run Dazzling Gleam for stronger coverage against Dark-types, OHKOing Sneasel with Life Orb or Tera Fairy's boost if it tries to switch in. Thunderbolt makes Mismagius more offensively potent against Flying-types like Articuno, and it's Mismagius's strongest coverage move against Normal-types like Snorlax, Grafaiai, and Farigiraf. Alternatively, Substitute provides Mismagius with protection from Naclstack's Salt Cure and revenge killers like Virizion. Taunt is a different utility option that shuts down special walls like Articuno and Crygonal in addition to denying Defog. Leftovers Mismagius variants can set up Substitute several times, and Draining Kiss sets can appreciate the additional longevity. In contrast, Life Orb makes Mismagius much more immediately threatening as a wallbreaker, giving it enough power to OHKO Charizard with Shadow Ball at +2. Tera Fairy powers up Mismagius's Fairy-type coverage moves, grants it a useful Dark resistance for intercepting Passimian's Knock Off, and creates an immunity to phazing by Dipplin's Dragon Tail. Mismagius can use Tera Electric as an alternative to shed all of its weaknesses, acquire a paralysis immunity to leverage against Lanturn and Magneton, and power up Thunderbolt to the point that it can OHKO Articuno at +2 with a Life Orb.</p> <p>Mismagius fits offensive teams as a strong wallbreaker that opens up holes for fast cleaners like Virizion, Jolteon, and Choice Scarf Mesprit. Setup sweepers like Lycanroc and Hisuian Sneasel similarly appreciate Mismagius softening up teams early-game so that they can sweep. As a special sweeper, Oricorio-F especially benefits from Mismagius weakening special walls like Regirock. Sticky Web teams led by Vikavolt can rely on Mismagius as an offensive spinblocker, and Mismagius loves moving before faster foes like Lycanroc and Choice Scarf Passimian to KO them first. Spikes teams featuring Sandslash and Orthworm can also count on Mismagius to spinblock, and Mismagius thrives when grounded walls like Snorlax and Regirock are chipped down by entry hazards. Mismagius can struggle to break through grounded walls like Snorlax and Regirock without significant chip damage or a few rounds of damage from hazards, so teammates like Minior, Shaymin, and Poliwrath are helpful to take advantage of them or soften them up for Mismagius.</p>"
      },
      "Choice Item": {
        "description": "<p>Choice item Mismagius sets benefit from STAB Shadow Ball's great coverage against most of the metagame. Mismagius's coverage makes it troublesome for Ghost-immune and -resistant Pokemon to play around. Dazzling Gleam covers Dark-types like Persian-Alola and Sneasel, while Thunderbolt targets Dodrio and Articuno. Trick disrupts passive special walls by locking them into one move, which is especially devastating to item-reliant walls like Naclstack, Snorlax, Regirock, Articuno, and Cryogonal. With a Choice Scarf, Mismagius becomes one of the fastest threats in the boosted metagame, outpacing Choice Scarf users like Passimian and Shaymin as well as +1 Oricorio formes. Alternatively, Choice Specs Mismagius is an immediate wallbreaker that can threaten to OHKO staples like Charizard, Mesprit, and Hattrem. Tera Fairy boosts Mismagius's Dazzling Gleam and it provides Mismagius with a solid defensive typing to beat revenge killing attempts from Passimian's Knock Off. Mismagius gains a useful paralysis immunity with Tera Electric, allowing it to handle paralysis spreaders like Magneton and Mesprit, and with Choice Specs, Tera Electric Mismagius can 2HKO Articuno with Thunderbolt.</p> <p>With a Choice Scarf, Mismagius can serve as a powerful Speed control option for offensive teams, helping them threaten fast attackers like Charizard and Shaymin. Mismagius's ability to debilitate special walls with a Choice item can improve offense teams' matchups against bulky teams, allowing special setup sweepers like Oricorio-F and Farigiraf to take off once special walls like Snorlax and Articuno are restricted. Mismagius can spinblock to maintain Vikavolt's Sticky Web, and Choice Specs Mismagius can outspeed faster foes like Choice Scarf Typhlosion with Sticky Web support. Spikes support from Sandslash and Orthworm helps wear down special walls like Snorlax, Regirock, and Naclstack for Mismagius, making it easier for Mismagius to overwhelm these foes, while Mismagius can spinblock and deal with Sandslash for the Ground-weak Regirock.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 543866, "username": "5Dots"}, {"user_id": 626095, "username": "sinnabyss"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 653095, "username": "FavMon=Garchomp"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Spiritomb": {
    "comments": "<h3>Other Options</h3> <p>Physically offensive and mixed variants of Spiritomb can be used due to its access to Sucker Punch and Poltergeist, but there are far better options for physically offensive Dark-types like Mabosstiff and Sneasel, which boast superior Attack and Speed stats. Spiritomb can opt to use Pain Split or Will-O-Wisp instead of Psyshock on the offensive Trick Room set in order to improve its survivability and potentially ease setup at a heavy cost to its coverage, losing out on key targets like Virizion and Poliwrath.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Offensive Dark-type foes like Mabosstiff and Sneasel resist Spiritomb's STAB Dark Pulse and retaliate with excellent damage themselves, though they must be wary of physically defensive variants that can debilitate them with Will-O-Wisp.</p> <p><strong>Fairy-types</strong>: As the tier's best Fairy-type Pokemon, Whimsicott can take on Spiritomb's boosted attacks and threaten heavy damage with Moonblast. Tera Fairy walls like Mesprit, Snorlax, and Dipplin can resist Spiritomb's STAB Dark Pulse to stop its sweep or further their own setup.</p> <p><strong>Wallbreakers</strong>: Spiritomb's lackluster natural bulk can be easily preyed upon by wallbreakers like Mabosstiff, Jolteon, and Vikavolt regardless of what set it's running, though they must be careful when switching in.</p> <p><strong>Encore</strong>: While it is immune to Prankster Encore from the likes of Whimsicott and Sableye, Spiritomb must be wary of a potential Encore from other foes like Mesprit, Beartic, and non-Prankster variants of the previously mentioned Whimsicott.</p> <p><strong>Special Walls</strong>: Specially defensive walls like Cryogonal and Articuno can wipe away Spiritomb's Nasty Plot boosts with Haze; in addition, Articuno can also phaze Spiritomb with Roar.</p>",
    "sets": {
      "Offensive Trick Room": {
        "description": "<p>Spiritomb utilizes its defensive profile to switch into foes like Passimian and Hisuian Sneasel, setting up and devastating teams in a tier almost completely lacking Fairy-type Pokemon. Dark Pulse serves as an amazing neutral STAB attack for a vast majority of the tier, threatening OHKOs on metagame staples like Jolteon and Mesprit after a Nasty Plot boost; it is the preferred STAB over Shadow Ball to avoid letting Normal-type Pokemon like Snorlax and Farigiraf switch in for free. Psyshock compliments Dark Pulse excellently with its ability to hit Fighting-types like Poliwrath and Virizion while targeting opposing special walls like Snorlax and Lanturn on their comparatively worse Defense. Alternatively, Tera Blast Steel targets Dark-types like Sableye and Mabosstiff alongside Fairy-types like Whimsicott and Tera Fairy Mesprit. Tera Dark further amplifies the power of Spiritomb's Dark Pulse to OHKO as many foes as possible once boosted, securing guaranteed OHKOs on foes like Rotom-C and Charizard, while Tera Steel allows for the usage of Tera Blast as well as shoring up Spiritomb's Fairy weakness.</p> <p>Spiritomb works well alongside wallbreakers like Virizion, Glastrier, and Hisuian Sneasel, which can wallbreak for each other and enable Spiritomb's sweep. Spiritomb struggles with strong physical attacks from the likes of Mabosstiff and Sneasel, so it appreciates physical walls like Regirock and Weezing that can reliably switch into them. Special attackers like Jolteon, Vikavolt, and Mesprit pair well with Spiritomb to break down walls for each other. Teammates with pivoting moves like Rotom-C, Lanturn, Jolteon, and Passimian can help bring Spiritomb in safely to help ease its setup. Entry hazard support from the likes of Regirock, Sandslash, and Mesprit is also greatly appreciated to help whittle foes into range for Spiritomb to sweep. Pokemon that can threaten Whimsicott like Muk and Magneton are appreciated to help cover for Spiritomb's lone weakness to Fairy.</p>"
      },
      "Physical Wall": {}
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Hippopotas": {"sets": {"Sand Setter": {}}},
  "Abomasnow": {
    "overview": "<p>With the combination of Aurora Veil, Snow Warning, and a strong offensive profile, Abomasnow is ZU's sole viable snow setter and a threatening offensive tank. The Defense boost from snow even helps Abomasnow tank attacks like Glastrier's Close Combat and Lycanroc's Stone Edge. Abomasnow's snow pairs well with Beartic, enabling the latter's Slush Rush for formidable late-game sweeps. Aurora Veil is also invaluable support for teammates like Jolteon and Charizard, allowing them to more easily wreak havoc against the opposition. Abomasnow itself can dish out powerful STAB attacks courtesy of its threatening offensive stats and coverage. Abomasnow, however, is hindered by its low Speed and awful defensive typing, leaving it vulnerable to special attackers like Charizard and Magneton without the help of Terastallization. Without Heavy-Duty Boots, Abomasnow is very vulnerable to getting worn down by entry hazards. Abomasnow faces competition from other offensive Grass-types like Shaymin and Virizion for their faster Speed and better defensive profiles, though Abomasnow stands out for its unique ability and offensive typing.</p>",
    "comments": "<h3>Other Options</h3> <p>Focus Blast nails Orthworm and deals more damage to special walls and tanks like Snorlax and Glastrier, though its shaky accuracy makes it an inconsistent option. On more offensive teams, Eject Pack can make Abomasnow a one-time pivot with Leaf Storm, while Icy Rock can be run to give Beartic more turns of snow for sweeping. However, not running Heavy-Duty Boots exacerbates Abomasnow's vulnerability to residual damage. Physical sets can surprise special walls like Snorlax and Cryogonal, though they struggle by lacking a strong physical Ice-type STAB move and being less effective overall. Leech Seed can be used to discourage special walls like Snorlax and Muk from staying in on Abomasnow, though it can't afford dropping Aurora Veil or coverage.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Even when Abomasnow has the Defense boost under snow, Fire-types like Charizard, Oricorio, and Typhlosion can melt it with their powerful STAB moves and switch into its Grass-type attacks.</p> <p><strong>Special Walls</strong>: Despite Abomasnow's powerful STAB moves, special tanks like Snorlax, Articuno, and Cryogonal can stomach its attacks and reliably recover the damage off before chipping it away with their own STAB attacks; Snorlax is particularly dangerous with its Heat Crash.</p> <p><strong>Steel-types</strong>: Orthworm stands out as one of Abomasnow's most difficult matchups, resisting both of its STAB moves, being immune to Earth Power, and being able to retaliate by setting up entry hazards or Iron Defense. Other Steel-types like Magneton and Perrserker are similarly threatening but hate Earth Power.</p> <p><strong>Faster Pokemon</strong>: Abomasnow's awful defensive typing and merely fine bulk leave it vulnerable to numerous attackers faster than it. Revenge killers and wallbreakers like Passimian, Virizion, and Lycanroc are just a few examples that can pick it off with some chip damage, even if they dislike switching into it.</p>",
    "sets": {
      "Aurora Veil": {
        "description": "<p>Abomasnow is a chilling offensive tank courtesy of its offensive typing and the combination of Snow Warning and Blizzard. Giga Drain provides consistent recovery for Abomasnow and hits Water-types like Lanturn and Poliwrath, though Leaf Storm can be used for immediate burst damage at the cost of lowering its offensive stats and forgoing healing. Earth Power is Abomasnow's strongest option against Steel-types like Magneton as well as Typhlosion. Heavy-Duty Boots covers Abomasnow's Stealth Rock vulnerability so it can effectively tank attacks and set up Aurora Veil. While other Pokemon are preferred for Terastallization, Tera Water can help in a pinch to shield Abomasnow from Fire-types like Charizard and Typhlosion.</p> <p>Abomasnow tends to fit on offensive and balanced builds thanks to its offensive typing and the support provided by Aurora Veil. Offensive pivots like Mesprit and Jolteon appreciate it to better take damage from potential Choice Scarf users like opposing Mesprit and Hisuian Sneasel; Jolteon also benefits from having a more threatening coverage move under snow with Ice-type Weather Ball. Beartic particularly stands out as a partner, benefiting from the Defense boost under snow and having its sweeping capabilities enabled with Slush Rush. Other setup sweepers like Minor, Oricorio, and Nasty Plot Mesprit benefit from the extra bulk under Aurora Veil giving them more opportunities to break or sweep. Abomasnow's plethora of weaknesses leaves it vulnerable to U-turn users and Fire-types; defensive backbones like Lanturn, Mesprit, and Snorlax can provide support with their bulk and utility moves. Additionally, Lanturn can provide paralysis support with Thunder Wave, and the latter two can rack up residual damage with entry hazards. Abomasnow can, in return, switch into weaker walls like Dipplin, Lanturn, and Sandslash to threaten them away with powerful STAB moves. Hazard deterrents like Hattrem and Sandslash stand out as notable teammates, with the former providing Magic Bounce, paralysis, and Healing Wish support, while the latter can remove hazards and provide Knock Off utility.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626095, "username": "sinnabyss"}, {"user_id": 452572, "username": "missangelic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Magmortar": {"sets": {"All-Out Attacker": {}}},
  "Leafeon": {"sets": {"Sunny Day Attacker": {}}},
  "Probopass": {"sets": {"Sand Attacker": {}}},
  "Froslass": {"sets": {"Hazard Lead": {}, "Utility Spikes": {}}},
  "Rotom": {"sets": {"Choice Scarf": {}, "Nasty Plot": {}}},
  "Rotom-Frost": {"outdated": true, "sets": {"Nasty Plot": {}}},
  "Rotom-Mow": {
    "overview": "<p>Rotom-C is one of the most potent offensive threats in ZU thanks to its great offensive coverage and Special Attack. Electric-immune Pokemon like Lanturn and Sandslash are weak to Leaf Storm, which makes Rotom-C a punishing pivot and difficult to stop. Choice Scarf sets outspeed the entire unboosted metagame, while bulky sets provide excellent team support with their utility moves. Levitate is fantastic as defensive utility, giving Rotom-C opportunities to switch in and threaten Ground-types and keeping it from being worn down by Spikes. Rotom-C isn't lacking utility, either, with moves like Trick, Will-O-Wisp, Thunder Wave, and Pain Split at its disposal. Terastallization is great for pushing Rotom-C's power to greater heights, giving it a great defensive typing with Levitate for setup opportunities and providing coverage to Nasty Plot sets in conjunction with Tera Blast. However, Rotom-C struggles to do much to Grass-types like Virizion, Shaymin, and Dipplin.</p>",
    "comments": "<h3>Other Options</h3> <p>Nasty Plot sets can use Tera Blast as a fourth move in conjunction with Tera types, such as Poison, that improve their coverage. Choice Specs sets are prediction-reliant and aren't especially fast, but they can surprise and wear down walls like Snorlax and Muk.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Bulky Grass-types like Lurantis, Dipplin, and Arboliva resist Rotom-C's STAB moves and can remain healthy against it. Physical attackers like Dipplin and Virizion must be wary of Will-O-Wisp, while defensive Grass-types like Lurantis and Arboliva become prone when given a Choice Scarf by Trick. However, Dipplin is a menace to Rotom-C because of its immunity to Trick and potential to use Rotom-C as setup fodder.</p> <p><strong>Snorlax</strong>: Snorlax can tank boosted attacks from Rotom-C and hit it back hard, but it is punished by Trick. Non-Rest variants of Snorlax are not fans of Pain Split or Will-O-Wisp.</p> <p><strong>Poison-types</strong>: Hisuian Sneasel threatens Rotom-C with its Poison-type STAB moves, but it should watch out for Will-O-Wisp. Muk has the bulk to withstand boosted attacks from Rotom-C and hit it back hard. Weezing is a bit weaker on the special side, but can hit hard with Sludge Bomb.</p> <p><strong>Bulky Electric-types</strong>: Vikavolt resists Rotom-C's STAB moves and threatens it back hard with Bug Buzz, while Magneton can similarly beat Rotom-C one-on-one. If Lanturn Terastallizes into a Dragon-type, then it becomes a very capable check to Rotom-C, and Volt Absorb variants can stop Rotom-C from pivoting.</p> <p><strong>Ice-types</strong>: Sneasel and Cryogonal both outspeed Rotom-C and hit it hard with their Ice-type moves; Sneasel has Ice Shard to deal with Choice Scarf variants, and Cryogonal has good special bulk. Glastrier is bulky, but it is vulnerable to Will-O-Wisp.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Rotom-C outspeeds the entire unboosted metagame and makes a great revenge killer against offensive threats like Charizard and Choice Scarf Passimian. Rotom-C excels as a pivot because of Electric-immune Pokemon like Sandslash and Volt Absorb Lanturn taking major damage from Leaf Storm, and few of these Pokemon run coverage to hit Rotom-C back hard. Volt Switch helps Rotom-C keep up momentum as it finishes off foes, and it lets it put Grass-type switch-ins like Dipplin on the backfoot. Trick punishes walls to Rotom-C like Arboliva and Snorlax by restricting them with a Choice lock, but it can also help against offensive foes, such as Virizion and Shaymin, that prefer to switch their moves and don't benefit especially from a Choice Scarf. Tera Electric makes Rotom-C's Thunderbolt and Volt Switch even more powerful, and shedding Rotom-C's Grass typing improves its matchups against Oricorio-F and Sneasel.</p> <p>Rotom-C's ability to keep up the tempo for its team makes it a great pick for offense teams. Other pivots can make great VoltTurn cores with Rotom-C. Charizard threatens Grass-types like Shaymin, and it appreciates Rotom-C pressuring bulky Rock- and Ground-types like Regirock and Sandslash. Rotom-C becomes more vulnerable once it's used Leaf Storm, and Regirock can switch into foes like Charizard and Sneasel that would try to take advantage of it. As a pivot, Rotom-C can support wallbreakers like Sneasel, Charizard, Typhlosion, and Glastrier, all of which can prey on the Grass-types that Rotom-C invites in. If Rotom-C doesn't use Volt Switch as specially defensive walls like Snorlax and Cryogonal switch in, then physical tanks and bulky wallbreakers like Regirock and Glastrier can switch in and deal with these foes. Since Rotom-C is still slower than Choice Scarf users like Typhlosion, Mismagius, and Hisuian Sneasel, bulky partners like Snorlax and Sandaconda can pivot into these foes for Rotom-C.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Thanks to Rotom-C's Electric- and Grass-type STAB moves, Nasty Plot sets can shred bulky cores that rely on walls like Lanturn, Regirock, and Orthworm. Discharge is an alternative to Thunderbolt that punishes walls like Cryogonal and Dipplin with paralysis so that Rotom-C or a teammate can more easily overwhelm them. Volt Switch lets Rotom-C keep up momentum against its switch-ins if it's not in a position to sweep, giving it more utility in the early- and mid-game. Pain Split keeps Rotom-C healthy against bulky foes like Snorlax and Muk, and the HP-lowering effect can put them into positions to be overwhelmed by Rotom-C. Will-O-Wisp punishes Grass-types and special walls looking to intercept Rotom-C like Muk and Snorlax. A bulkier EV spread affords Rotom-C more opportunities to set up Nasty Plot, but a more offensive one lets Rotom-C break through weakened walls like Snorlax more easily and with fewer boosts. If Rotom-C opts to run Volt Switch, then Heavy-Duty Boots will generally add more to its longevity than Leftovers. Tera Ghost throws off Fighting-type revenge killers like Passimian and Hisuian Sneasel, and the Fighting immunity it grants can save Rotom-C against Tera Dragon Regirock's Iron Defense-boosted Body Press. The Fire resistance provided by Tera Dragon helps Rotom-C against Fire-type revenge killers like Charizard and Typhlosion, and it preserves Rotom-C's natural Electric, Grass, and Water resistances. Tera Steel gives Rotom-C a good defensive typing that offers it more setup opportunities against special walls like Muk and the ability to flip its matchups for a critical turn against revenge killers like Sneasel and Choice Scarf Mesprit.</p> <p>Rotom-C's ability to pressure defensive Pokemon is an asset for offense, bulky offense, and balance teams. Spikes from entry hazard setters like Sandslash and Orthworm helps wear down checks to Rotom-C like Dipplin, Muk, and Snorlax. Stealth Rock from setters like Mesprit, Regirock, and Sandslash can also passively get chip damage on these checks to Rotom-C, and in turn, Rotom-C threatens entry hazard removers like Sandslash. Special sweepers like Oricorio-F and Farigiraf can sweep late-game once Rotom-C has softened up special walls like Snorlax for them. Physical wallbreakers like Glastrier and Hisuian Sneasel apply pressure to special walls Rotom-C struggles against, while Rotom-C threatens Regirock and Poliwrath. Fire-types like Charizard, Oricorio-F, and Typhlosion can melt the Grass-types that are obstacles to Rotom-C like Whimsicott and Shaymin, while Rotom-C can pressure Regirock and Lanturn for these Fire-type teammates. Offensive Poison-types like and Hisuian Sneasel can be handled by Ground-type teammates like Sandslash and Sandaconda. Additionally, these Poison-types can actually make great partners for Rotom-C itself, as they can pressure Grass-types for it, and they also appreciate Rotom-C's good matchups against Ground-types. Glastrier, Regirock, and Poliwrath can handily handle fast Ice-types like Sneasel and Froslass for Rotom-C.</p>"
      },
      "Bulky Pivot": {
        "description": "<p>Rotom-C's decent bulk and STAB combination make it a reliable and potent bulky pivot, punishing Electric-immune Pokemon like Sandslash and Lanturn with Leaf Storm. Pain Split capitalizes on Rotom-C's low natural HP and provides it with recovery beyond Leftovers. High-HP Pokemon like Snorlax and Muk looking to switch into Rotom-C are prime targets for Pain Split and otherwise comfortably stomach Rotom-C's attacks. Will-O-Wisp neuters physical attackers like the aforementioned high-HP Pokemon as well as Passimian and Virizion. Alternatively, Thunder Wave can slow down fast threats like Mismagius and Whimsicott. Leftovers is Rotom-C's only form of recovery beyond Pain Split, while Heavy-Duty Boots keeps it healthier in the face of entry hazards as it pivots. Tera Ghost provides Rotom-C extra defensive presence against Hisuian Sneasel and Virizion to hinder them with status. The resistances provided by Tera Dragon help Rotom-C deal with Fire-type threats like Charizard and Oricorio-F while preserving its Water, Electric, and Grass resistances, ensuring it maintains its positive matchups against Lanturn and opposing Rotom-C. Tera Steel disrupts Psychic-types like Mesprit and Farigiraf, and its synergy with Levitate works well against Ground-types like Sandslash and Sandaconda.</p> <p>Rotom-C's capacity to punish Electric-immune Pokemon with Leaf Storm makes it a good fit for VoltTurn teams. Offensive pivots like Passimian and Perrserker form good pivot cores with Rotom-C. In particular, Passimian nails bulky Normal-types as well as Cryogonal, and Perrserker pressures Grass-types like Shaymin as well as Arboliva. Clawitzer can tank a Fire-type attack and break through special walls like Snorlax as well as Arboliva, and it benefits from Rotom-C drawing in and pivoting out on these targets for it. Regirock, Snorlax, and Lanturn can answer Fire-types like Charizard and Oricorio-F for Rotom-C. While Rotom-C does have an immunity to Spikes, it still appreciates Stealth Rock being off the field as it pivots if it's not holding Heavy-Duty Boots; Sandslash, Hitmontop, and Hattrem can all keep the field clear for Rotom-C. Rotom-C's ability to deal with Lanturn and Regirock is greatly appreciated by Fire-types like Charizard, Typhlosion, and Oricorio-F. Other powerful offensive threats, such as Mismagius, benefit from the free switches Rotom-C can provide with Volt Switch. Notably, Glastrier, Sneasel, and Hisuian Sneasel can deal with the Grass-types that Rotom-C invites in. Setup sweepers with middling Speed like Mesprit and Malamar can set up more easily thanks to the positioning Rotom-C can provide, and the latter presures Grass-types. Specially defensive walls like Snorlax and Lanturn can switch into Vikavolt for Rotom-C, while Ground-types like Sandslash and Sandaconda can deal with faster Poison-types like Hisuian Sneasel for Rotom-C.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Mesprit": {
    "overview": "<p>Mesprit is a highly flexible Pokemon that is capable of fulfulling a multitude of roles within the ZU metagame. Its balanced stats and useful movepool allow Mesprit to work well in offensive and defensive utility roles, while its Nasty Plot set is a threatening sweeper that is extremely challenging for bulky builds to deal with. Mesprit is also a good check to Fighting-types such as Virizion and Passimian, and Levitate lets it deal with many Ground-types, such as Sandslash and Sandaconda. Unfortunately, Mesprit's balanced stats means that it isn't truly exceptional at any role that it tries to play, as its offensive stats aren't fantastic, and bulky sets are prone to getting chipped down over time. Its Psychic typing also leaves it vulnerable to common Dark-types, such as Sneasel, Spiritomb, and Persian-Alola, while also leaving it weak to the ubiquitous U-turn. Finally, Mesprit's coverage is quite limited, as it lacks a way to hit Steel-types hard and doesn't hit much of the metagame for super effective damage. This can lead to it sometimes struggling to break through bulky threats such as Articuno and Snorlax.</p>",
    "comments": "<h3>Other Options</h3> <p>A Choice Specs set utilizing Psychic, Dazzling Gleam, Psyshock or Shadow Ball, and either Trick or U-turn is feasible. However, Mesprit isn't powerful enough to consistently break down defensive cores without perfect prediction, it can't hit Steel-types for significant damage, and its mediocre Speed tier means it isn't especially good against offensive teams either. The Nasty Plot set can consider Psychic Noise or Stored Power as its Psychic-type STAB move. The former prevents recovery from the likes of Articuno, Pallosand, and Snorlax, while the latter will become extremely powerful if Mesprit accrues multiple Nasty Plot boosts. However, Psyshock's ability to pressure common special walls like Lanturn, Snorlax, and Articuno makes it the most consistent option. The defensive pivot set can consider Colbur Berry as an alternative item to take Knock Off from the likes of Passimian and Sneasel, as well as Dark-type attacks from Spiritomb. However, the loss of Leftovers recovery means that only offensive teams looking to play fast should consider this, and it loses value if Mesprit is forced to Terastallize. The defensive pivot could also use other Tera types, such as Tera Fairy to give a Dark resistance that is useful when facing down Sneasel, Spiritomb, and Passimian and Tera Water to grant useful resistances for Typhlosion and Clawitzer. Tera Water, however, leaves Mesprit open to common Grass- and Electric-type attacks from Shaymin, Jolteon, and Virizion. Options like Thunder Wave to deter setup or and Pain Split to give Mesprit some form of recovery may seem appealing for the defensive set, but Mesprit tends to perform its role more consistently with the given moves.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types and Dark-type Coverage</strong>: Dark-types such as Sneasel, Spiritomb, and Persian-Alola threaten Mesprit with their STAB moves and either force it to switch out or Terastallize. Mesprit is capable of pivoting out or hitting them with Fairy-type coverage as they switch in, however. Pokemon that Mesprit would otherwise check, such as Passimian, Hisuian Sneasel, and Sandslash often run Dark-type coverage, limiting its ability to comfortably deal with them. Sableye and Spiritomb don't fear Mesprit's STAB moves, and Sableye can threaten to lock Mesprit into an ineffective move with Prankster Encore, though neither of them appreciate Fairy-type coverage, Knock Off, or Trick.</p> <p><strong>Ghost-types</strong>: Ghost-type attackers such as Mismagius, offensive Froslass, and Rotom threaten Mesprit with their STAB moves, but they can't comfortably switch in to most sets due to the threat of Knock Off, Trick, or a STAB move.</p> <p><strong>Steel-types</strong>: Steel-types such as Orthworm, Magneton, and Perrserker resist Mesprit's common coverage options, and they can use it as an opportunity to fire off a strong attack or, in Orthworm's case, set up Stealth Rock, Spikes, Coil, or Iron Defense. However, they must be wary of Trick or Knock Off. Additionally, certain Pokemon Mesprit usually checks, such as Weezing and Articuno, often run Tera Steel and can therefore turn the tables on Mesprit.</p> <p><strong>Strong Wallbreakers</strong>: Mesprit's rather modest bulk means it can't comfortably answer many of the tier's strongest offensive threats. Typhlosion and Jolteon outrun non-Choice Scarf Mesprit and threaten to do serious damage, even to the defensive set. Even slow wallbreakers such as Alolan Exeguttor and Clawitzer are still faster than the defensive pivot set and threaten it with extreme damage.</p>",
    "sets": {
      "Physically Defensive Pivot": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Mesprit is a great revenge killer to handle fast Pokemon like Jolteon and Hisuian Sneasel. Dazzling Gleam is Mesprit's best complementary coverage move for Psychic, covering Dark-types like Sneasel and Sableye. U-turn lets Mesprit keep up offensive momentum against switch-ins like Orthworm, Farigiraf, and Snorlax. Healing Wish lets Mesprit give teammates like Virizion, Snorlax, and Glastrier a second chance to set up and sweep. Mesprit can alternatively use Trick to make a defensive Pokemon like Snorlax or Orthworm less threatening. Tera Fairy Mesprit is a more effective offensive and defensive answer to Sneasel and Passimian given their Dark-type coverage moves, and Tera Fairy lets Mesprit not play guessing games with Psychic and Dazzling Gleam against Tera Dark Passimian. Tera Steel has good synergy with Levitate and gives Mesprit several new resistances to more easily answer Whimsicott, Sandslash, and Farigiraf.</p> <p>Offensive pivots like Jolteon and Magneton make great cores with Mesprit and appreciate Mesprit's Levitate to more easily play around Ground-types. Fighting-types like Virizion, Passimian, and Hitmontop are great offensive checks to Snorlax and Steel-types like Orthworm and Perrserker, all of which give Mesprit trouble, and they appreciate Mesprit offensively checking Poison-types like Weezing and Hisuian Sneasel. Mesprit benefits from Ground-type teammates like Sandslash and Sandaconda patching up its poor matchup against Sneasel-Hisui, while it can check foes like Virizion for them. Setup sweepers like Oricorio-F, Regirock, and Virizion benefit from Mesprit providing them second chances to sweep with Healing Wish or making foes more exploitable with Trick. Physical wallbreakers like Glastrier and Hisuian Sneasel all benefit from Healing Wish giving them an additional chance for breaking, as they can break special walls that Mesprit cannot.</p>"
      },
      "Nasty Plot Sweeper": {
        "description": "<p>Nasty Plot Mesprit is a fearsome mid- or late-game sweeper thanks to the combination of Levitate and a somewhat high base 105 Special Attack stat. Its biggest perk is the ability to set up in front of most bulkier Pokmon. Mesprit can choose between Encore and Substitute as its setup tool; Substitute can be very good versus bulkier teams, as Mesprit can tank a hit from most of the passive mons such as Regirock and Lanturn if not being hit super effectively, obtaining a free turn to either set up Nasty Plot or fire off an attack. Encore helps to circumvent Mesprit's passivity and can take advantage of checks that need to set up or use status moves like Haze to wall Mesprit, like Articuno for the Haze case, and Regirock for the setup. Psyshock is great to deal with specially defensive Pokmon such as Snorlax. Draining Kiss allows Mesprit to outlast Dark-type checks such as Spiritomb and Sneasel while healing in the process, Thunderbolt allows it to hit and Flying- and Water-types such as Charizard and Clawitzer hard. Tera Fairy lets Mesprit set up in front of the aforementioned Dark-types, grants immunity to Dragon Tail from Dipplin and Appletun, and increases the power of Draining Kiss, letting Mesprit restore more HP on the aforementioned threats and making it even harder to take down. Tera Steel improves Mesprit's defensive capabilities, making it take neutral damage from Dark- and Ghost-type attacks and giving it a Bug resistance, while only being weak to Fighting- and Fire-type moves due to Levitate. Tera Electric boosts the power of Thunderbolt and removes all of Mesprit's weaknesses.</p> <p>Nasty Plot Sweeper Mesprit works well with specific entry hazard setters and Fighting-types. Hazard setters like Orthworm and Naclstack both cover each other's weaknesses and let Mesprit get rolls it wouldn't otherwise, such as KOing Honchkrow with Tera Fairy Draining Kiss after Stealth Rock chip damage. Fighting-types such as Virizion and Passimian deserve a highlight, as when paired with Mesprit, they provide good coverage for it, pressuring Dark- and Steel-types with their STAB moves and Ghost-types with Knock Off. Both of them offer additional utility, with Virizion being bulky enough to enter in and provide wallbreaking prowess and Passimian having access to U-turn to let Mesprit in safely and Knock Off to offer utility. Secondary wallbreakers that don't rely on Setup to make progress such as Clawitzer and Magneton will also appreciate being by Mesprit's side. Some cleaners also enjoy Mesprit's ability to make progress so they can clean late-game, such as Dodrio and Hisuian Sneasel.</p>"
      },
      "Specially Defensive Pivot": {
        "description": "<p>Mesprit's decent defensive profile and access to useful utility moves like Stealth Rock and Healing Wish allow it to act as a good defensive pivot. Its bulk and typing allows it to check foes such as Jolteon, Charizard, and Passimian locked into Close Combat. Psychic Noise is a useful STAB move that allows Mesprit to force out Hitmonchan and Hitmontop, which are among the few viable hazard removers of the tier. Its decent Base Power and ability to prevent healing allow Mesprit to annoy other defensive Pokemon like Dipplin and Sandaconda. U-turn allows Mesprit to pivot out of poor matchups such as Glastrier and Spiritomb while keeping up momentum for its team. Knock Off allows Mesprit to punish foes that would feel comfortable coming in otherwise, such as Orthworm, Articuno, and Snorlax. Healing Wish is another option for offensive teams that allows Mesprit to fully heal an offensive teammate and give it another go at breaking down the opponent's team. It is capable of running both Knock Off and Healing Wish if your team already has another Stealth Rock user. Maximum Special Defense investment is preferred in order to better take hits from the likes of Charizard, Magneton, and Pyroar. A Sassy nature is preferred to give Mesprit a slow U-turn and maximize the damage that its physical attacks do. Steel is the preferred Tera type, as it turns each of Mesprit's weaknesses into a neutrality or a resistance and gives it a superb general defensive typing. It notably lets Mesprit handle opposing Mesprit and Whimsicott with more confidence. Tera Steel also has good synergy with Levitate and allows Mesprit to comfortably handle foes such as Sandslash and Sandaconda. Leftovers grants Mesprit passive recovery and helps it stay as healthy as possible throughout the match.</p> <p>Mesprit is one of the few bulky Stealth Rock setters in the tier that also has access to a pivoting move, which makes it highly useful for both balance and offense. Mesprit lacks reliable recovery, so teams utilizing it shouldn't expect it to be a stalwart wall. Rather, its good support movepool and defensive traits allow it to act as a stopgap that can take a few hits while also supporting its offensively oriented teammates via pivoting and utility moves such as Knock Off and Healing Wish. Mesprit's physical bulk is somewhat lacking, so physically defensive teammates such as Weezing and Sandaconda, make for good partners. These two help out against Fighting-types such as Passimian and Hisuian Sneasel, which Mesprit struggles to check in the long term. Dipplin serves as a good physically defensive partner and in particular a Knock Off absorber, which is highly useful for Mesprit because it fears Knock Off greatly. Mesprit is also vulnerable to Dark-types such as Spiritomb and Sneasel. Teammates such as Hisuian Sneasel and Virizion can help with the latter, while Articuno and Whimsicott can help with the former. Teammates such as Passimian, Virizion, and Charizard can help check Steel-types such as Magneton and Orthworm, which Mesprit struggles to deal with on its own. Strong wallbreakers, such as Typhlosion, Glastrier, and Alolan Exeggutor, appreciate Mesprit's slow U-turn getting them in safely, and they benefit from Mesprit's ability to use Knock Off to remove various items from defensive Pokemon such as Regirock, Orthworm, and Articuno. Mesprit also pairs well with other VoltTurn users; Passimian and Whimsicott also benefit from Mesprit bringing them in safely and can form a pivoting core that can slowly wear down the opponent's team. Pokemon such as Typhlosion, Charizard, and Glastrier appreciate Healing Wish support should Mesprit choose to run it, as they are all vulnerable to being worn down over the course of a match, and many teams are not prepared to deal with them a second time.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 475916, "username": "Sputnik"}, {"user_id": 644300, "username": "Havocknight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 452572, "username": "missangelic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 649096, "username": "a blue banana"}, {"user_id": 652656, "username": "Gambit"}]}]}
  },
  "Shaymin": {
    "overview": "<p>Shaymin is blessed with well-rounded bulk, solid Special Attack, and great Speed, enabling it to tap into its colorful coverage to act as a potent specially offensive threat. Seed Flare is a potent offensive STAB move, and it can make Shaymin into a deadly wallbreaker if it gets lucky with Special Defense drops against would-be checks like Snorlax and Muk. A gifted utility movepool makes Shaymin surprisingly flexible when building with it and using it, and Shaymin's customizability makes it even more threatening because of how unpredictable it is. Natural Cure even makes Shaymin a rare, viable status absorber, giving it an edge in taking advantage of status spreaders like Lanturn, Rotom-C, and Hattrem. However, Shaymin has a lot of competition from other Grass-types like Rotom-C, Whimsicott, Virizion, and Dipplin for spots on teams, and its own Grass typing is a liability against major threats like Charizard, Oricorio-F.</p>",
    "comments": "<h3>Other Options</h3> <p>Shaymin's well-rounded stats and flexibility suit it as a good user of Terastallization, so it can tap into a variety of alternative Tera types. Tera Ghost offers Shaymin a good defensive typing against Hisuian Sneasel and other Poison-types, helps Shaymin spinblock against Sandslash, and annoys Snorlax and Terastallized IronPress Regirock. Tera Rock + Tera Blast can catch Charizard and Articuno, but dedicating a moveslot to this makes Shaymin more dependent on Terastallization at the cost of its teammates losing the ability to rely on such a valuable resource.</p> <h3>Checks and Counters</h3> <p><strong>Flying-types</strong>: Charizard and Oricorio-F take 4x resisted damage from Shaymin's Seed Flare, and Articuno can waste Seed Flare PP with Pressure. Both Oricorio-F and Articuno have reliable recovery to wall Shaymin.</p> <p><strong>Special Walls</strong>: Without Special Defense drops, Snorlax and Orthworm can be a pain for Shaymin to take down on its own. Cryogonal can use Haze to remove any stat drops.</p> <p><strong>Poison-types</strong>: Muk has the best special bulk out of any Poison-type and can tank Earth Power, but even it must be wary of Special Defense drops. Hisuian Sneasel naturally outspeeds Shaymin, barring Choice Scarf. Weezing has Levitate for Earth Power, but Shaymin can overwhelm it even more easily than Muk by dropping its Special Defense with Seed Flare.</p> <p><strong>Ice-types</strong>: Sneasel naturally outspeeds non-Choice Scarf Shaymin and can pick off Choice Scarf variants with Ice Shard. Glastrier is bulky enough to tank an attack from Shaymin and usually KO it in return. Beartic can outspeed non-Choice Scarf Shaymin under snow.</p> <p><strong>Vikavolt</strong>: Even when it's uninvested, Vikavolt's STAB Bug Buzz OHKOes Shaymin, and Vikavolt is bulky enough to tank Shaymin's attacks provided it doesn't have its Special Defense dropped.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>Seed Flare's high Base Power and solid chance to drop a foe's Special Defense make Shaymin a potent offensive threat that can break down its own checks with its coverage and some good luck. Earth Power targets Poison-types like Hisuian Sneasel and Muk as well as other Grass-resistant foes like Typhlosion and Magneton. Air Slash covers opposing Grass-types like Arboliva and Lurantis. Dazzling Gleam is an alternative coverage move that synergizes with Tera Fairy and still acts as a good coverage move against Virizion, Dipplin, and Alolan Exeggutor. Shaymin can use its well-rounded bulk and Synthesis to outlast and overwhelm passive foes like Regirock and Orthworm as well as Rotom-C. Healing Wish leans more into Shaymin's role as an offensive support for its team, which can make up for Shaymin's limited Grass-type coverage by giving a teammate a second wind or free switch. Rest is an alternative recovery option that takes advantage of Natural Cure curing Shaymin's sleep status once it switches out. The protection against entry hazards that Heavy-Duty Boots provides enables Shaymin to worry less about its longevity, so Heavy-Duty Boots sets can more aggressively pivot onto the field to absorb status or passive attackers with hazards up. Additionally, Heavy-Duty Boots Shaymin has a better matchup against Sticky Web teams thanks to Shaymin's good natural Speed. Choice Scarf Shaymin sets take advantage of Seed Flare's spammability and Shaymin's great Speed tier for a Choice Scarf user, and the Speed boost from Choice Scarf helps Shaymin more consistently use Healing Wish. Life Orb variants crank Shaymin's power up higher to break down special walls like Snorlax, and they share the moveset flexibility of Heavy-Duty Boots variants that can flex Shaymin's colorful coverage to beat down Muk. Shaymin can also use Synthesis or Rest to mitigate the recoil damage from running Life Orb. Shaymin is a flexible user of Terastallization thanks to not relying on it to function yet still having well-rounded stats and diverse coverage for good offensive and defensive Terastallization. Tera Ground powers up Earth Power and gives Shaymin a useful Poison resistance to improve its matchups against Poison-types like Weezing and Muk. Alternatively, Tera Fairy grants Shaymin a good defensive typing that's disruptive against Dragon- and Fighting-types like Dipplin and Passimian.</p> <p>Shaymin's customizability earns it spots on multiple team archetypes. Hyper offense teams appreciate Healing Wish and can rely on Shaymin's decent bulk and wallbreaking abilities. Shaymin has the natural bulk for bulky offense teams and the power to keep up as a wallbreaker, and its ability to absorb status can let it play more aggressively. Special sweepers like Oricorio-F, Farigiraf, and Jolteon appreciate Shaymin softening up walls like Snorlax, Orthworm, and Muk so that they can more efficiently sweep. Other special wallbreakers like Charizard, Typhlosion, and Magneton can pair with Shaymin to overwhelm their shared checks in the aforementioned walls, and these wallbreakers can pressure Cryogonal and Articuno for Shaymin while benefitting from its good matchups against Lanturn and Regirock. Pivots like Mesprit and Clawitzer can give Shaymin free switches to hit the field and conserve its health as it wallbreaks, which is especially useful if Shaymin forgoes recovery. Fire-types like Charizard and Typhlosion are major obstacles for Shaymin and can exploit its Choice item lock, so Shaymin benefits from partners like Regirock and Lanturn that can switch into Fire-types. Shaymin depends on Poison-resistant Pokemon like Sandslash and Sandaconda to mitigate its difficult matchups against Poison-types like Muk and Hisuian Sneasel. Special walls like Snorlax and Muk are vulnerable to Spikes, which can by set by Orthworm, and Shaymin can threaten Sandslash for Orthworm so that it doesn't have to have its Leftovers removed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Gurdurr": {"outdated": true, "sets": {"Bulky Attacker": {}}},
  "Whimsicott": {
    "overview": "<p>Blessed with the rare Fairy typing and an excellent Speed tier, Whimsicott makes for an excellent revenge killer and utility Pokemon. Whimsicott's unique typing allows it to beat many dangerous threats like Persian-Alola and Virizion. A powerful Moonblast and pivoting coupled with Choice Specs allow Whimsicott to break past bulkier threats like Orthworm and Glastrier. However, Whimsicott's low offensive stats leave it often wanting for power, especially without Choice Specs, and it's incapable of fitting every move it wants. Furthermore, lack of reliable recovery and only average bulk makes it unable to consistently check the Pokemon it's supposed to like Regirock and Sandaconda.</p>",
    "comments": "<h3>Other Options</h3> <p>Psychic is an option that nails Poison-types like Weezing. However, this comes at the cost of either losing U-turn's pivoting or the utility of Switcheroo or Encore. Whimsicott can use a SubSeed set to mess up its usual defensive checks like Snorlax and Orthworm and be a general nuisance. This set struggles to find setup opportunities however and relies heavily on getting a free Substitute on a forced switch.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Whimsicott's 4x weakness to Poison and inability to hit Poison-types with its STAB attacks makes Poison-types like Muk and Weezing good checks. However, these Pokemon lack reliable recovery and can thus be worn down over a game.</p> <p><strong>Steel-types</strong>: Steel-types like Magneton and Orthworm can take Whimsicott's STAB attacks with ease. Orthworm can start setting entry hazards or set up with Coil or Iron Defense, while Magneton can generate momentum with Volt Switch.</p> <p><strong>Fire-types</strong>: As Whimsicott's STAB attacks do little to them, Fire-types like Charizard, Typhlosion, and Magmortar can use Whimsicott as an entry point to start firing off powerful attacks. These Pokemon aren't usually defensively invested however and can struggle to switch in consistently.</p> <p><strong>Special Walls</strong>: Special walls like Snorlax and Articuno aren't bothered by Whimsicott's attacks and can use it to start forcing progress with entry hazards, status, pivoting, or boosts. However, Switcheroo completely ruins these walls, especially Articuno, and Encore can force them to repeat their status moves, allowing Whimsicott to safely bring in a teammate.</p> <p><strong>Choice Scarf Users</strong>: Many common Choice Scarf users like Hisuian Sneasel and Gunk Shot Passimian get the jump on Whimsicott and can easily take it out.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Whimsicott takes advantage of its high Speed and Moonblast to be a powerful cleaner and revenge killer. U-turn lets It scout for switches and pivot out of unfavorable matchups like Weezing and Orthworm, allowing it to bring in a more suitable teammate. Switcheroo allows Whimsicott to cripple its defensive checks, greatly hindering special walls like Orthworm and especially Articuno, letting Whimsicott and its teammates break past them later in the game. However, Whimsicott loses a substantial amount of power without its Choice Specs, so one must be careful about when to use Switcheroo. Infiltrator allows Whimsicott to bypass Substitute from foes like Glastrier and opposing Whimsicott.</p> <p>Choice Specs Whimsicott best fits on balance and bulky offense teams looking for a fast offensive cleaner that also provides some defensive utility. Whimsicott loves entry-hazard stacking teammates like Sandslash and Orthworm to help push its otherwise average damage output. It can't handle Fire-types like Charizard and Typhlosion, so answers to them like Regirock and Snorlax help immensely. Whimsicott can in return take advantage of the Grass- and Fighting-types like Virizion and Passimian that these Pokemon are at a disadvantage against. Whimsicott struggles with Poison-types like Weezing and Muk who resist its STAB attacks and threathen it with 4x super effective attacks, so answers like Magneton and Sandaconda make for great teammates. Whimsicott pairs well with offensive Fire-types like Typhlosion and Charizard that handle the Steel-types like Orthworm that it has difficulties breaking past, and in return, it handles their Water and Rock-type answers such as Regirock and Lanturn. Special sweepers such as Oricorio-F and Mesprit enjoy pairing with Whimsicott for its capability to pressure and cripple special walls like Snorlax and Lanturn.</p>"
      },
      "Offensive Pivot": {
        "description": "<p>Whimsicott leverages its superb Speed and access to Prankster to be a competent offensive pivot. Giga Drain is used for its ability to give Whimsicott staying power in longer games. Encore is key to this set, allowing it to force defensive foes into unfavorable moves like Stealth Rock and Recover, as well as shutting down setup sweepers like Oricorio-F and Snorlax by locking them into their setup moves. U-turn pairs beautifully with Encore, scouting any forced switches and allowing Whimsicott to bring in powerful teammates like Glastrier and Typhlosion. Tera Steel gives Whimsicott an immunity to Poison-type attacks from Muk and Weezing, and a resistance to Flying-type attacks from Dodrio as well as Ice-type attacks from Sneasel in a pinch. However, this still leaves Whimsicott vulnerable to Fire-type attacks from Charizard and Typhlosion and makes it weak to Fighting, making it unable to reliably switch into Passimian and Virizion. Tera Fire provides emergency resistances to Ice and Fire, but this makes Whimsicott unable to safely check Ground- and Rock-types like Sandaconda and Regirock.</p> <p>Balance teams enjoy Whimsicott's pivoting and Prankster Encore helping them deal with bulky defensive Pokemon and dangerous setup sweepers. Powerful physical wallbreakers like Glastrier and Passimian pair well with Whimsicott, as it baits in special walls like Articuno and can bring these teammates in with U-turn. Ground-types like Sandaconda make for excellent partners, as Whimsicott helps them handle the Water- and Grass-types like Clawitzer and Virizion that they struggle with, while they can handle Poison-types like Muk that scare Whimsicott out. Fire-types like Charizard and Magmortar can easily gain entry on Whimsicott, so Fire-resistant teammates like Regirock, Naclstack, and Snorlax are helpful partners. Partners such as Charizard or Passimian that threaten Steel-types like Orthworm and Magneton can come in after a U-turn on these Steel-types to fire off attacks. Electric-types like Jolteon and Magneton appreciate Whimsicott's ability to handle Ground-types like Sandaconda, and in return, they handle the Flying-types like Dodrio and Articuno that Whimsicott struggles to beat. Other offensive pivots like Passimian and Mesprit can form a powerful VoltTurn core with Whimsicott, quickly racking up damage against walls like Regirock and Snorlax, especially with entry hazards up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Lilligant": {"sets": {"Sun Sweeper": {}}},
  "Eelektross": {"sets": {"Defensive Pivot": {}, "Coil": {}}},
  "Beartic": {
    "overview": "<p>Under snow, Beartic is a chillingly threatening sweeper, boasting wide coverage and frightening offensive power while outspeeding the entire unboosted metagame. The Defense boost in snow allows it to tank physical attacks like Passimian's Close Combat and Lycanroc's Stone Edge. Beartic relies on Abomasnow to provide snow, and it forms a deadly offensive core with it, as Abomasnow's Aurora Veil makes Beartic even more difficult to take down. Beartic, however, is hindered by its low Speed and awful defensive typing; even under snow, it can be outsped by faster Choice Scarf users like Hisuian Sneasel and Typhlosion. Even with the Defense boost and Aurora Veil support, Beartic sports minimal defensive utility, owing to its vulnerability to all residual damage and lack of resistances if not running Heavy-Duty Boots, and it also stacks weaknesses with Abomasnow. Outside of snow, Beartic is extremely slow and easy to revenge kill without Terastallization, requiring significant support to perform well as a setup sweeper.</p>",
    "comments": "<h3>Other Options</h3> <p>Beartic has no other viable options.</p> <h3>Checks and Counters</h3> <p><strong>Faster Revenge Killers</strong>: Even under snow, Beartic is still quite slow and can be picked off by Choice Scarf users like Rotom-C, Hisuian Sneasel, and Shaymin.</p> <p><strong>Physical Walls</strong>: Physical walls like Weezing, Spiritomb, and Sableye can threaten Beartic with Will-O-Wisp, while walls like Regirock and Orthworm can beat it with Iron Defense in a one-on-one scenario.</p> <p><strong>Residual Damage</strong>: Beartic is vulnerable to all entry hazards if not running Heavy-Duty Boots and despises status, all of which heavily cut into its sweeping potential and making it easier to revenge kill.</p> <p><strong>Wallbreakers</strong>: Most wallbreakers not weak to its coverage moves can stomach at least one unboosted attack and retaliate, which is especially prominent if Beartic is not under snow. Examples include Passimian, Vikavolt, and Clawitzer.</p> <p><strong>Glastrier</strong>: Glastrier can leverage its massive bulk under snow and retaliate with its own coverage moves to defeat Beartic.</p>",
    "sets": {
      "Snow Sweeper": {
        "description": "<p>The combination of snow and Slush Rush enables Beartic to become one of the scariest setup sweepers under this archetype, boasting high offensive stats and outspeeding the entire unboosted metagame. Icicle Spear's higher power is preferred over Icicle Crash's potential flinch chance if running Loaded Dice, and its multiple hits work well against foes using Substitute like Minior, Mismagius, and Rotom-C. Close Combat threatens Ice-resistant targets like Snorlax, Orthworm, and Glastrier while also hitting Regirock hard. Earthquake threatens Lanturn, Magneton, and non-Choice Scarf Typhlosion, while Substitute capitalizes on weak walls like Snorlax and Dipplin. While an Adamant nature is ideal to maximize its power, Jolly can be used to outspeed Choice Scarf Passimian and Choice Scarf Mesprit under snow. If Beartic is not running Icicle Spear, Life Orb or Heavy-Duty Boots can be chosen to either strengthen all of its moves' power or protect it from entry hazard damage, respectively. Tera Fighting boosts the power of Close Combat and lets Beartic resist priority moves like Sucker Punch and Accelerock, while Tera Ground boosts the power of Earthquake and provides it a Stealth Rock resistance and Electric immunity while still resisting Accelerock; changing into either of these Tera types, however, relinquishes the Defense boost under snow.</p> <p>Due to Beartic being heavily reliant on snow for wallbreaking, Abomasnow is a mandatory partner to enable Slush Rush and the Defense boost. Pivots like Clawitzer and Passimian can help threaten and force out walls like Regirock and Orthworm, while wallbreakers like Clawitzer and Charizard can be similarly effective. Hattrem is a notable partner, as it supplies paralysis and Healing Wish support, enabling Beartic to clean through teams easier, while providing Magic Bounce support for Beartic's non-Heavy-Duty Boots sets. Spinners like Sandslash and Hitmontop are also valuable partners, providing entry hazard removal support without needing to remove Aurora Veil. Water-types like Clawitzer and Lanturn can not only force out Fire-types but also provide pivoting support. Hazard setters like Regirock and Sandslash not only can help rack up residual damage over the course of a game but also provide additional utility with Thunder Wave and Knock Off, respectively. Other setup sweepers like Minior can overwhelm teams and shared checks like Regirock with Beartic.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Cryogonal": {"sets": {"Hazard Remover": {}}},
  "Virizion": {
    "overview": "<p>Virizion's great Speed tier and threatening offensive typing make it a dangerous offensive threat that can serve as both a wallbreaker and a late-game cleaner. Virizion has access to Swords Dance, which allows it to boost its attack and wallbreak consistently. Its great Speed tier lets it stay threatening versus offensive teams and even clean them up late-game when its checks are weakened or removed. Virizion has naturally high special bulk and a workable defensive typing that allow it to find set up opportunities versus Choice-locked special attackers like Jolteon, Magneton, and Clawitzer, and there is some ambiguity to its sets thanks to its good coverage and ability to run a physical or special set. However, Virizion isn't especially strong without a boost, and it can struggle to break through physically bulky checks like Weezing and Dipplin. Despite that, Virizion retains a very solid niche thanks to its higher Speed tier and its ability to run coverage options like Stone Edge and Zen Headbutt.</p>",
    "comments": "<h3>Other Options</h3> <p>Virizion can run a Tera Flying Calm Mind set using Giga Drain, Air Slash, and Focus Blast or Aura Sphere. This turns the tables on many of Virizion's traditional answers such as Dipplin and Weezing, and Virizion's STAB combination threatens several common special walls, such as Lanturn and Snorlax. However, Virizion can only boost its Special Attack by one stage at a time with Calm Mind, and it is forced to use weak moves unless it opts for the inaccurate Focus Blast as its Fighting-type STAB move, which makes the set considerably less threatening in practice. A mixed attacker set with Leaf Storm, Close Combat, Stone Edge, and Synthesis with a Life Orb can be threatening to certain offensive and balance teams but fails to make significant progress versus builds packing common walls such as Dipplin, Mesprit, and Muk. Sacred Sword is an interesting alternative to Close Combat that ignores the Defense boosts on IronPress foes such as Regirock, Orthworm, and Naclstack and doesn't lower Virizion's own defenses, but the drop in power is very noticeable. Tera Fairy is a fringe alternative Tera type that gives Virizion a Fighting resistance, allowing it to stave off revenge killing from Choice Scarf Passimian, and an immunity to Dragon Tail, which lets it potentially break past Dipplin after accruing multiple Swords Dance boosts. Tera Poison grants Virizion a generally useful defensive typing to counteract revenge killing attempts from the likes of Whimsicott and Passimian. These are inferior to the other Tera types outside of these specific situations, however.</p> <h3>Checks and Counters</h3> <p><strong>Dipplin</strong>: Dipplin's massive physical bulk allows it to handily deal with the standard Swords Dance set. It isn't even 2HKOed by a +2 Close Combat and can use Dragon Tail to phaze Virizion before healing off any damage, which makes it a very reliable answer. It has to be wary of a surprise Calm Mind set, however, and the rare Tera Fairy can turn it into setup fodder.</p> <p><strong>Poison-types</strong>: Bulky Poison-types such as Weezing and Muk resist Virizion's STAB moves and threaten it in return with their STAB moves, or in Weezing's case, a burn from Will-O-Wisp. They must be cautious of Zen Headbutt, however. Hisuian Sneasel is faster than Virizion and can OHKO it with Gunk Shot. Additionally, several Pokemon that Virizion usually threatens, such as Sandslash and Regirock, commonly run Tera Poison and can therefore turn the tables on it.</p> <p><strong>Revenge Killers</strong>: Virizion's Speed tier, while very solid, still leaves it outpaced by several common revenge killers. Choice Scarf Passimian, Whimsicott, Sneasel, and Choice Scarf Typhlosion all outrun Virizion and can threaten to revenge kill it. All but the latter two need chip damage dealt before they can KO Virizion, however, and only Whimsicott and Passimian can directly switch in.</p> <p><strong>Status</strong>: Burns and paralysis are especially threatening to Virizion. Common Pokemon such as Weezing, Lanturn, and Charizard are all capable of spreading those status conditions, and Virizion is not capable of OHKOing any of them except for Charizard if it chooses to run Stone Edge. However, Lum Berry allows Virizion to circumvent this and set up on many of these foes fearlessly.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance allows Virizion to break through bulky foes like Mesprit and Regirock. Stone Edge lets Virizion threaten Charizard, Articuno, and Oricorio-F. Zen Headbutt can be used instead to threaten Poison-types like Weezing and Muk. Justified dissuades foes such as Passimian and Poliwrath from attempting to remove Virizion's item via Knock Off. Heavy-Duty Boots allows Virizion to come in multiple times throughout a game without fear of chip damage from entry hazards. However, Lum Berry is a viable alternative on offensive teams, as it allows Virizion to set up safely on foes that might try to cripple it with status, such as Mesprit, Rotom, and Sandaconda. Tera Rock allows Stone Edge to OHKO Whimsicott and 2HKO Weezing after Stealth Rock damage at +2. It also gives Virizion a resistance to Fire- and Flying-type attacks, which lets it deal with Charizard, Typhlosion, and Oricorio-F with more confidence. Tera Psychic lets Zen Headbutt 2HKO Tera Poison Regirock at +2, do significantly more damage to Weezing, removes Virizion's weakness to their Poison-type STAB moves, and gives Virizion a useful Fighting resistance that can foil revenge killing attempts from Choice Scarf Passimian and opposing Virizion.</p> <p>Virizion's great Speed tier and ability to both wallbreak and sweep depending on the situation make it usable on teams ranging from balanced to hyper offensive team styles. Virizion dislikes facing down extremely bulky physical walls such as Dipplin and Weezing and Iron Defense Pokemon such as Regirock and Orthworm, which can also outlast Virizion should they begin boosting as it comes in. Strong special attackers, such as Nasty Plot Mesprit, Magneton, and Charizard, are therefore good teammates; the former is especially good at disrupting these extremely bulky threats. These teammates appreciate Virizion's Speed tier helping them out against offensive builds and its ability to threaten special walls like Lanturn. Virizion appreciates entry hazards on the opponent's side, as it tends to force a lot of switches and loves seeing its defensive checks worn down. Stealth Rock setters such as Mesprit and Regirock are good teammates as a result, as are Spikes setters like Orthworm. These bulky hazard setters help to check revenge killers that are dangerous to Virizion; Regirock and Naclstack can help check Choice Scarf Typhlosion; Mesprit helps out versus Choice Scarf Passimian. Lanturn pivots into Fire-types like Typhlosion and Charizard easily and can bring Virizion into battle safely with Volt Switch. Virizion pairs well with other physical wallbreakers, especially on offense and hyper offense, as they can work together to break down their shared defensive answers. Teammates such as Swords Dance Sneasel and Glastrier work well as a result.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Pyroar": {"sets": {"Special Attacker": {}}},
  "Malamar": {"sets": {"RestTalk": {}, "Choice Scarf": {}}},
  "Clawitzer": {"sets": {"Choice Specs": {}}},
  "Carbink": {"sets": {"Double Dance": {}}},
  "Vikavolt": {
    "overview": "<p>Vikavolt distinguishes itself as a powerful Sticky Web setter, pressuring Hattrem and entry hazard removers like Sandslash and Lurantis with its STAB and coverage moves. Levitate and a Bug / Electric typing make Vikavolt a surprisingly good tank against common Grass-types like Rotom-C, Shaymin, and Virizion. Vikavolt's offensive typing, powerful special attacks, and coverage even let it deter opposing hazard setters like Mesprit, Sandslash, and Orthworm. What's more, Vikavolt's special wallbreaking potential enables it to capitalize on its own Sticky Web. However, Vikavolt's poor Speed is a major hindrance, leaving it easily outsped and picked off once it's weakened. Taunt leads like Froslass and Primeape can prevent Vikavolt from setting up Sticky Web and get their own hazards up. Fire-types like Charizard, Typhlosion, and Oricorio-F are major specially offensive threats that take advantage of Vikavolt's lower special bulk and lack of recovery. Special walls like Snorlax and Cryogonal can withstand Vikavolt's strong attacks, and the latter can even remove Sticky Web with Rapid Spin. Beyond Sticky Web, Vikavolt tends to compete with other Electric-types like Jolteon, Rotom-C, and Lanturn, which offer more Speed, utility, and defensive value, respectively.</p>",
    "comments": "<h3>Other Options</h3> <p>Tera Electric leaves Vikavolt free of weaknesses and powers up Vikavolt's STAB Electric-type attacks, but it doesn't offer as much defensive utility as the resistances and immunities of Tera types like Ghost and Steel. Tera Dragon helps Vikavolt catch Fire-types like Charizard off guard, and it even improves Vikavolt's matchups against Water-types like Lanturn while retaining Vikavolt's Grass and Electric resistances. Vikavolt can aim to be a sweeper with Agility and Throat Spray, but it requires multiple turns of setup to be threatening compared to setup sweepers like Oricorio-F, Jolteon, and Mesprit. Vikavolt's poor Speed, both before and after Agility, is also a major hindrance to it as a sweeper.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Muk can tank Vikavolt's attacks, Snorlax can use Vikavolt as setup fodder with Curse, and Cryogonal can remove Vikavolt's Sticky Web. On top of that, Tera Fairy Volt Absorb Lanturn walls Vikavolt outright.</p> <p><strong>Fire-types</strong>: Charizard, Oricorio-F, and Typhlosion melt Vikavolt with their Fire-type STAB moves, though they don't switch into its Electric-type attacks safely.</p> <p><strong>Faster Attackers</strong>: Fast wallbreakers like Sneasel, Hisuian Sneasel, and Mismagius pressure Vikavolt and can pick it off with just a bit of prior damage. Even attackers with middling Speed like Alolan Exeggutor, Clawitzer, and Hitmontop can blow past Vikavolt.</p>",
    "sets": {
      "Sticky Web Lead": {
        "description": "<p>Vikavolt is a threatening Sticky Web lead thanks to its offensive typing and massive Special Attack. Volt Switch enables Vikavolt to bring a partner in safely once it's set Sticky Web, and Vikavolt's low Speed makes it more likely that it can bring its teammates in without forcing them to take a hit. Volt Switch also helps break the Focus Sash of a Taunt lead like Primeape or Froslass so one of Vikavolt's teammates can come in and dispose of them. Thunderbolt's advantage over Volt Switch is that it doesn't force Vikavolt to switch out against Pokemon it wants to threaten, such as Passimian, Articuno, and Clawitzer. Energy Ball covers Electric-immune Pokemon like Sandslash and Volt Absorb Lanturn, and it nails Regirock. Vikavolt can opt for Thunderbolt over Energy Ball so that it doesn't have to choose between a pivot move and a reliable Electric-type STAB move across matchups against foes like Orthworm, Muk, and Weezing. Additionally, Vikavolt's STAB moves already hit most of the metagame for neutral damage. Tera Ghost turns Vikavolt into a spinblocker, ensuring its Sticky Web stays up against spinners like Sandslash, Cryogonal, and Hitmontop. Alternatively, Tera Steel has defensive synergy with Levitate, makes Vikavolt a good check to Psychic- and Fairy-types like Mesprit and Whimsicott, and turns the tables on Regirock for a key turn. Focus Sash makes Vikavolt a dedicated lead, while Heavy-Duty Boots makes Vikavolt more flexible throughout the game as a Sticky Web setter and pivot.</p> <p>Vikavolt can feature on hyper offense teams thanks to Sticky Web, but it's a good fit for offense and bulky offense teams as well due to the speed control Sticky Web offers. Wallbreakers like Glastrier, Charizard, and Typhlosion thrive with Sticky Web up, and they also benefit from being brought in safely by Vikavolt's Volt Switch. Slower wallbreakers like Clawitzer, Glastrier, and Arboliva are especially appreciative of Sticky Web compensating for their poor Speed. Setup sweepers with middling Speed like Mesprit and Rotom-C also benefit from the ability to outspeed more threats. Knock Off users like Passimian, Mesprit, and Sandslash help ensure Heavy-Duty Boots is removed from all foes so that the entire opposing team is subjected to Sticky Web, and the item removal support they offer helps against checks to Vikavolt like Snorlax and Cryogonal. Ghost-types like Mismagius and Froslass act as spinblockers to keep up Vikavolt's Sticky Web, while Defiant Pokemon, such as Passimian and Primeape, can deter and punish Defoggers. Spinners like Hitmontop, Cryogonal, and Sandslash help keep opposing entry hazards off the field without removing Vikavolt's Sticky Web. Vikavolt's poor matchups against Fire-types make teammates like Regirock and Snorlax vital.</p>"
      },
      "Sticky Web Pivot": {
        "description": "<p>Vikavolt is an effective wallbreaker, pivot, and Sticky Web setter because of its unique typing and monstrous Special Attack. Energy Ball hits foes like Lanturn and Regirock especially hard; if Vikavolt is using a Modest nature, it consistently 2HKOes Regirock. Heavy-Duty Boots allows Vikavolt to function as a bulky slow pivot more reliably. A Bold nature with full Defense investment can be used to let Vikavolt better take attacks from physical attackers like Passimian, Hitmontop, and Virizion; alternatively, a Modest nature with full Special Attack investment can maximize its damage output at the cost of taking on opposing leads less effectively. Tera Steel is used to provide a resistance to Psychic, which helps it take on Mesprit after it Terastallizes, and flip its weakness to Rock into a resistance, taking Rock Blast and Stone Edge from foes like Regirock and Virizion more comfortably.</p> <p>Vikavolt, despite being a Sticky Web setter, is a good fit for bulky offense and offensive structures alike. With its good natural bulk and massive power even without EV investment, Vikavolt can reliably come in and pivot a few times each game, using its wallbreaking proficiency to lure in foes like Snorlax for teammates like Passimian and Hisuian Sneasel. Similarly, setup sweepers like Poliwrath and Mesprit can overcome their relative slowness with Sticky Web support, threatening to clean late-game after one boost. Stealth Rock setters like Regirock pair well with Vikavolt, with the former taking on foes like Sneasel reliably and the latter taking on Fire-types like Charizard and Typhlosion. Vikavolt is a notable VoltTurn partner for Clawitzer and Passimian, as they can lure in Arboliva and Mesprit for it, while it can provide entry points for them against walls like Muk and Snorlax. Defog deterrents, like Malamar and Passimian, make for excellent teammates, leveraging the Sticky Web set by Vikavolt to become devastating wallbreakers if positioned well. Knock Off users that can aid further in this endeavor, like Passimian and Sneasel also help soften up Vikavolt checks such as Snorlax.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 626095, "username": "sinnabyss"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 583607, "username": "PowerOfMemes"}]}]}
  },
  "Crabominable": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Oricorio": {
    "overview": "<p>Oricorio-F serves as one of the deadliest setup sweepers in the tier, utilizing its combination of excellent typing, decent offensive stats, reliable recovery, and one of the best setup moves in the game in Quiver Dance. Oricorio-F can find opportunites to set up through its ability to pressure common bulky Grass-, Steel-, and Ice-types like Shaymin, Orthworm, and Articuno; furthermore, it can also set up in the face of specially offensive threats like Charizard and Shaymin, especially with bulk investment. Revelation Dance makes Oricorio-F especially flexible by serving as an excellent move both before and after Terastalization which it can use both offensively and defensively. Oricorio-F often struggles against common special walls like Regirock and Snorlax. Furthermore, priority from the likes of Lycanroc often pressure Oricorio-F, though Terastallization can help it choose its checks more reliably. While it faces fierce competition from Charizard as a more immediately threatening Fire / Flying type as well as Oricorio-P as a Quiver Dance sweeper able to run Grassy Seed, Oricorio-F makes its name in the tier through combining the best of both its typing and movepool to devastate teams once set up.</p>",
    "comments": "<h3>Other Options</h3> <p>Oricorio-F can opt for Tera Water on both Quiver Dance sets to have a generally better defensive typing than Tera Grass offers, but it risks being completely walled by opposing Lanturn as well as taking severe damage from the likes of Jolteon, Rotom-C, and Thwackey. Due to access to a few rare and excellent utility moves in Defog and U-turn, Oricorio-F can be used as a bulky utility Defog user and pivot. However, this role is often done better by other entry hazard removers like Sandslash and Lurantis, especially as Oricorio-F is extremely reliant on its Heavy-Duty Boots to maintain its overall health, whereas Sandslash resists Stealth Rock and Lurantis often runs recovery.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Snorlax, Regirock, and Lanturn can all cause grief for attempts at an Oricorio-F sweep.</p> <p><strong>Priority</strong>: Accelrock from Lycanroc can cut Oricorio-F's sweep short without Terastallization. Prankster Encore users like Sableye and Whimsicott can use Encore to lock Oricorio-F into a utility move if they manage to switch in safely, though they must be wary of Tera Dark.</p> <p><strong>Fast Choice Scarf Users</strong>: Faster Choice Scarf users like Hisuian Sneasel can threaten an OHKO on Oricorio-F even after a Quiver Dance boost, and Mismagius can finish it off with Thunderbolt or Power Gem.</p>",
    "sets": {
      "Offensive Quiver Dance": {
        "description": "<p>With full offensive investment, Oricorio-F aims to immediately set up and sweep the opposing team once it hits the field. Hurricane's increased power is required over the higher reliablility of Air Slash due to Oricorio-F's middling Special Attack, and it hits foes like Charizard and Clawitzer extremely hard. Revelation Dance serves as excellent secondary coverage to Oricorio-F's Hurricane with or without Terastallization. Oricorio-F's different Terastallization options help aid its setup opportunities and improve its coverage. Tera Ground allows for easier setup versus Electric-types like Jolteon, Choice-locked Rotom formes, and Vikavolt. It also blesses Oricorio-F with a resistance to Lycanroc's Accelrock and an immunity to Electric-type moves like Lanturn's Electric-type STAB moves and Regirock's Thunder Wave. Tera Grass provides Oricorio-F with similar boons against foes like the aforementioned Lanturn as well as Clawitzer. Tera Fighting flips Oricorio-F's weakness to Rock-type attacks from foes like Regirock, gives it a strong coverage move against Snorlax, and provides a useful resistance to Lycanroc's Accelerock.</p> <p>Oricorio-F thrives on balanced and offensive structures that need a wincon once opposing teams are battered and bruised, often taking advantage of the opportunities gained from pivot moves used by Rotom-C, Lanturn, and Passimian. Oricorio-F struggles immensely with special walls like Regirock and Snorlax, so physical wallbreakers like Passimian, Glastrier, and Hisuian Sneasel are greatly appreciated as partners. Special wallbreakers like Mismagius, Rotom-C, and Shaymin work well alongside Oricorio-F in the effort to put additional pressure on special walls as well. Knock Off support from the likes of Passimian, Sneasel, and Sandslash is also appreciated to weaken the aforementioned walls, Lanturn, and Snorlax. Entry hazard support from offensive teammates like Sandslash, Orthworm, and Mesprit is invaluable to help break down the walls like Snorlax and Regirock that can often get in the way of Oricorio-F's sweep. In return, Oricorio-F benefits its teammates by serving as a devastating wincon while being able to pressure certain physical walls like Dipplin and Orthworm prior to going for a sweep.</p>"
      },
      "Bulky Quiver Dance": {
        "description": "<p>With full health investment and reliable recovery, Oricorio-F aims to set up multiple Quiver Dances over the course of the game on foes like Charizard and eventually bulldoze through the opposing team, even beating mons that ordinarily check it like Lanturn. Taunt allows Oricorio-F to shut down status moves like Thunder Wave and Recover; in addition, it prevents phazing and recovery from the likes of Articuno, Cryogonal, and Weezing, as well as Rest from the likes of Lanturn. Air Slash maximizes Oricorio-Fs consistency and has good neutral coverage against the widest portion of the metagame. Alternatively, Revelation Dance is a higher power move that synergizes with Terastallization, but it doesnt have the same wider-reaching neutral effectiveness Air Slash has and can struggle against certain threats depending on Oricorio-Fs Tera type. Tera Fairy serves as a generally effective defensive Tera type that maximizes the number of foes Oricorio-F can set up against, like Passimian and Rotom, while providing an immunity to Dragon Tail. Tera Grass allows Oriorio-F to flip its matchup versus Water-types like Lanturn and Clawitzer, while Tera Dark allows Oricorio-F to work around Prankster users like Sableye and Whimsicott and continue setting up against them.</p> <p>Oricorio-F excels on bulky offense with teammates like Dipplin and Lanturn that are able to outlast foes and appreciate a win condition that can use its bulk to set up and sweep. Entry hazard support from the likes of Regirock and Orthworm breaks down checks like Regirock and Snorlax, as does Knock Off from teammates like Sneasel and Passimian. Sandslash and Mesprit excel at bringing both Knock Off and hazard support; Spikes stacking in general is an effective way to break down Oricorio-Fs checks. Lanturn can deter Oricorio-F from setting up and punish it with with Discharge, so Grass-types capable of pressuring it repeatedly like Rotom-C, Virizion, and Shaymin are greatly appreciated. Other walls like Snorlax and Regirock also cause issues for this set, so Fighting-type teammates that can pressure them like Passimian, Hisuian Sneasel, and Virizion are helpful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Oricorio-Pa'u": {"sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Lycanroc": {
    "overview": "<p>With its high Speed, good movepool, and powerful offensive typing, Lycanroc has secured a great spot in ZU as a positively potent offensive sweeper as well as an adept entry hazard lead. Its access to a unique priority move in Accelerock lets it bury faster targets like Sneasel as well as boosted threats like Oricorio-F. Swords Dance Lycanroc is a prolific wallbreaker and sweeper, while lead sets can start games off with Stealth Rock, deny opposing hazards with Taunt, and severely weaken foes with Endeavor. However, Lycanroc is hounded by several issues. Its severe lack of bulk means that any strong neutral attack will likely take it out, hampering its opportunities to set up and sweep. Lycanroc also lacks in power if it can't hit a foe super effectively, which can leave it defenseless against certain foes like Regirock and especially Dipplin. Lycanroc's sweep is easily put down by many revenge killers like Whimsicott and Choice Scarf Passimian, which aren't as afraid of Accelerock. The dedicated lead set faces competition from Froslass, which has access to Spikes and a more effective trading tool in Destiny Bond.</p>",
    "comments": "<h3>Other Options</h3> <p>Lycanroc can opt out of Accelerock on sand teams, since it outruns everything with Sand Rush active. Choice Band may seem tempting to use on Lycanroc; however, none of its moves are spammable, making the set heavily prediction reliant, and Lycanroc prefers switching moves to deal super effective damage. Crunch allows Lycanroc to hit Palossand hard, which would otherwise be a perfect counter, while Psychic Fangs nails Weezing. Play Rough hits Fighting-types slightly harder than Psychic Fangs and is Lycanroc's best bet at breaking past Dipplin. However, dropping Close Combat leaves Lycanroc unable to break past Orthworm, Magneton, and Regirock, which are generally more common.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types</strong>: Faster Fighting-types like Choice Scarf Passimian and Hisuian Sneasel resist Accelerock and can cleanly take Lycanroc out with Close Combat. Hitmonchan has a strong Mach Punch to pick it off.</p> <p><strong>Ground-types</strong>: Sandaconda and Sandslash resist Lycanroc's Rock-type attacks and can all tank a boosted move from Lycanroc before KOing it back in return with a Ground-type attack.</p> <p><strong>Water-types</strong>: Lanturn doesn't switch into Lycanroc well but can take an unboosted attack and retaliate with a Water-type attack or inflict it with status. Clawitzer can tank Lycanroc's unboosted attacks and KO it in return.</p> <p><strong>Physical Walls</strong>: A healthy Dipplin completely walls Lycanroc and threatens it back with Giga Drain. Weezing isn't very keen on taking Stone Edge but can burn Lycanroc in retaliation. Orthworm and Regirock can Terastallize out of their Fighting-type weakness and threaten Lycanroc back with Body Press.</p> <p><strong>Status Conditions</strong>: Burn from Weezing and Charizard hampers Lycanroc's offensive capabilities, while paralysis from Lanturn and Magneton worsens its great Speed as well as potentially stopping it from attacking, which is fatal for a Pokemon as frail as Lycanroc.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Lycanroc's high Speed and excellent Attack make it a deadly revenge killer, wallbreaker, and setup sweeper. The many switches it forces on foes like Charizard and Sneasel lets it grab a Swords Dance boost and potentially sweep. Stone Edge, while innacurate, is Lycanroc's strongest STAB attack. Alternatively, Rock Blast in conjunction with Loaded Dice is more accurate, but it results in Lycanroc losing Life Orb's extra power boost on its other moves. Lycanroc has a wide array of coverage moves to pick and choose from, with Close Combat being the most reliable choice for its high power and coverage against foes like Orthworm, Regirock, and Magneton. Accelerock lets Lycanroc pick off Rock-weak foes like Sneasel and Choice Scarf Typhlosion as well as weakened targets like Jolteon. Sand Rush is the optimal ability for Lycanroc, as on sand teams, Sand Rush allows Lycanroc to outspeed everything in the metagame, while on non-sand teams, it gives Lycanroc a positive matchup into opposing sand teams. A Jolly nature is generally preferred to outrun Charizard, Mismagius, and Froslass, but Adamant is an option on sand teams because of Sand Rush doubling Lycanroc's Speed. Tera Fighting gives Lycanroc immense power on Close Combat, notably cleanly OHKOing Orthworm and Regirock at +2. Tera Ghost flips Lycanroc's Fighting weakness, letting it blank a Choice Scarf Passimian's and Hisuian Sneasel's Close Combat.</p> <p>Offense and hyper offense teams enjoy Lycanroc's powerful wallbreaking and sweeping potential as well as the assurance it provides against opposing offense with Accelerock, especially against sun teams. Pivots like Passimian, Mesprit, and Whimsicott help Lycanroc hit the field safely. Whimsicott is a particularly good partner, as it handles many of Lycanroc's answers like Dipplin and Sandaconda, and its Prankster Encore can give Lycanroc a chance to sweep. In return, Lycanroc threatens many of Whimsicott's checks like Charizard, Magneton, and Articuno. Other physical wallbreakers like Sneasel, Hisuian Sneasel, and Glastrier play well with Lycanroc, working to create gaping holes in the opponent's team for each other to exploit. Dipplin is a near-perfect wall to Lycanroc, so teammates that can exploit it like Charizard and Magneton are quite handy. Lycanroc is quite frail, so defensive teammates like Weezing are helpful for it to fall back on. Lycanroc loves entry hazard setters like Sandslash and Orthworm, as the chip damage from Spikes softens up many of its answers like Dipplin and Sandaconda, helping Lycanroc secure its KOs much more easily. On sand teams, Sand Spit Sandaconda is necessary to set sand, and fellow sand sweepers like Sandslash can band together with Lycanroc to break the opposing team down. As Lycanroc struggles with Fighting-types, teammates that can deal with them like Oricorio-F and Whimsicott are its best friends. Other sweepers on hyper offense teams are useful partners for Lycanroc as well, since many of them like Nasty Plot Mesprit and Swords Dance Virizion exploit Lycanroc's answers in Sandaconda and Regirock. Physical sweepers like Swords Dance Hisuian Sneasel benefit from the holes in the opponent's team left behind by Lycanroc, easing their sweeps. Healing Wish support from Mesprit and Shaymin allows Lycanroc to go for a second round of sweeping.</p>"
      },
      "Lead": {
        "description": "<p>With Taunt and its high Speed, Lycanroc makes for an excellent entry hazard-setting lead. Taunt lets Lycanroc deny hazards from being set by Pokemon like Regirock, Orthworm, and Sandaconda as well as stop Defog attempts from Lurantis. Focus Sash is vital to guarantee that Stealth Rock is set even versus foes that would outspeed and OHKO Lycanroc. Endeavor pairs beautifully with Focus Sash, letting Lycanroc bring a foe's health down with it and potentially rendering that opposing Pokemon near useless. Rock Blast lets Lycanroc OHKO lead Froslass through Focus Sash, which allows it to simultaneously preserve its own while completely denying Spikes from going up. Close Combat nails opposing Lycanroc, and Accelerock lets Lycanroc chip faster foes before going down, possibly taking them out completely when combined with Endeavor beforehand. This also makes the mirror against opposing lead Lycanroc easier. Tera Ghost lets Lycanroc spinblock, but it is generally better to preserve Terastallization for Lycanroc's teammates, as it is intended to sacrifice itself.</p> <p>Lycanroc is best used on hyper offense teams, where it can lead the charge for its pack of setup sweepers. It notably is incredibly annoying for opposing hyper offense teams that use Froslass as their lead, as Lycanroc can one-shot Froslass through Focus Sash with Rock Blast. Mesprit is just one example of the many sweepers that appreciate Stealth Rock chipping away at their checks. On sun teams, Lycanroc denying hazards can free up Fire-type teammates like Charizard and Typhlosion to run items like Choice Specs and Choice Scarf instead of Heavy-Duty Boots. Lycanroc notably struggles to face lead Sandslash, so a teammate that can deal with it, like Virizion, can help Lycanroc in this regard. Since Lycanroc ideally sacrifices itself to get Stealth Rock up, teammates that deter hazard removal are great to make sure that Stealth Rock can stay up. Ghost-types like Mismagius can block Rapid Spin attempts from Sandslash and Cryogonal, and Defog punishers like Passimian and Malamar make foes think twice about trying to clear Stealth Rock.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 583607, "username": "PowerOfMemes"}]}]}
  },
  "Lurantis": {"sets": {"Defog": {}}},
  "Passimian": {
    "comments": "<h3>Other Options</h3> <p>With a Choice Band equipped, Passimian 2HKOes physically defensive Sandaconda with Close Combat. However, Passimian's base 80 Speed leaves it very susceptible to faster offensive Pokemon like Jolteon, Charizard, and Whimsicott.</p> <h3>Checks and Counters</h3> <p><strong>Physically Defensive Pokemon</strong>: Dipplin and Sandaconda have the longevity and bulk to withstand repeated attacks from Passimian, and neither are particularly punished by Knock Off or its coverage moves. Gunk Shot can threaten Dipplin, but it suffers from poor accuracy and fails to 2HKO it. Weezing is a standout defensive check to Passimian between having great physical bulk, threatening to Will-O-Wisp Passimian, and punishing U-turn with Rocky Helmet.</p> <p><strong>Ghost-types</strong>: Sableye and Spiritomb cause Passimian to lose momentum when it's locked into Close Combat, and both can burn it. Spiritomb dislikes losing its Leftovers to Knock Off though. Mismagius can use Passimian to set up if it's locked into Close Combat or Earthquake, but it can't switch into Knock Off.</p> <p><strong>Status</strong>: Will-O-Wisp from Rotom and Charizard debilitates Passimian, though they struggle to switch into its coverage moves safely. Paralysis leaves Passimian easily outsped and makes it poor speed control, so Regirock can punish Passimian trying to switch in on it with Thunder Wave.</p> <p><strong>Faster Choice Scarf Users</strong>: Rotom, Typhlosion, and Mismagius can outspeed and deal significant damage to Passimian, though none of them switch into the combination of Close Combat and Knock Off safely.</p> <p><strong>Fairy-types and Tera Fairy Pokemon</strong>: Whimsicott resists or takes neutral damage from most of Passimian's moves but must be wary of Gunk Shot, and Close Combat can 2HKO it after Stealth Rock damage. Tera Fairy users like Mesprit, Mismagius, and Jolteon can take advantage of Passimian's limited coverage to take a hit from it and KO it at the cost of burning Terastallization. Even Pokemon vulnerable to Passimian such as Snorlax can use Tera Fairy to defensively flip their matchups and wall Passimian, opening opportunities for themselves to set up.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Passimian is an excellent fast offensive pivot and revenge killer thanks to its strong STAB attacks, good physical bulk, and Stealth Rock resistance. Passimian OHKOes fast offensive threats like Sneasel and can KO Hisuian Sneasel after Spikes damage or a Defense drop. Knock Off makes Mesprit and Mismagius unsafe switch-ins to Passimian, and it makes helpful progress by removing items from defensive checks like Weezing and Spiritomb. U-turn lets Passimian keep up momentum against switch-ins like Dipplin and Sableye. Earthquake is Passimian's best coverage move for Poison-types like Neutralizing Gas Weezing, Hisuian Sneasel, and Muk. Gunk Shot OHKOes Whimsicott, is Passimian's best move against Dipplin, and keeps Passimian offensively relevant against Tera Fairy users like Snorlax and Jolteon. Rock Slide hits Flying-types like Charizard and Oricorio-F and Bug-types like Venomoth and Vikavolt. Tera Fighting allows Passimian to outright OHKO offensive foes like Virizion and Typhlosion and 2HKO defensive foes like Regirock and Sandaconda with Close Combat after one layer of Spikes. Tera Dark improves Passimian's matchups against Mesprit and Farigiraf, powers up Knock Off to hurt Spiritomb more, and denies Prankster-boosted moves from Sableye. Defiant is Passimian's only viable ability, but it's useful punishing Sticky Web teams.</p> <p>Passimian punishing Defog with Defiant and removing Heavy-Duty Boots with Knock Off makes it a great team player for entry hazard-stacking teams that include Orthworm or Sandslash. Passimian's momentum is greatly appreciated by wallbreakers like Typhlosion, Clawitzer, and Alolan Exeggutor. Passimian luring in physically defensive Pokemon like Sandaconda and Dipplin enables partners like Mesprit and Whimsicott to take advantage of them when Passimian pivots out with U-turn, and in turn, Passimian threatens Steel-types like Orthworm and Magneton for them. Ghost-types like Rotom and Mismagius can exploit Passimian locked into Close Combat, Earthquake, or Gunk Shot, so teammates like Snorlax and Naclstack are great teammates. Likewise, Passimian appreciates specially offensive teammates like Mesprit, Farigiraf, and Charizard that can exploit physically defensive Pokemon like Weezing and Dipplin that it lures in. Once Passimian can form pivot cores with Pokemon like Jolteon, Magneton, and Lanturn, it can trap foes in the vortex and wear down mutual Ground-type checks such as Sandaconda and Sandslash. Physical wallbreakers like Choice Band Sneasel and Swords Dance Glastrier can open up holes in defensive cores to pave the way for Passimian to clean up late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Minior": {"sets": {"Shell Smash": {}}},
  "Thwackey": {"sets": {"Grassy Terrain": {}}},
  "Appletun": {"sets": {"Special Wall": {}}},
  "Sandaconda": {
    "overview": "<p>Sandaconda is a good defensive Pokemon in SV ZU thanks to its bulk and Shed Skin. The increased reliability of Rest as recovery lends Sandaconda the longevity to check Pokemon like Muk and Passimian. Options like Stealth Rock, Glare, and Coil diversify Sandaconda into a great support Pokemon or a bulky setup sweeper. Sandaconda is an excellent Terastallization user to boot, enhancing its defensive profile to become even tougher to break or enabling its own sweeps. However, Shed Skin does not make Rest perfectly reliable, hampering Sandaconda's consistency. Physical attackers with super effective STAB moves like Glastrier and Virizion are very problematic for Sandaconda and coerce it to burn Terastallization for its team. Despite its Electric immunity, Sandaconda's lower special bulk can leave it to be overwhelmed by coverage and additional STAB attacks from Jolteon, Magneton, and Rotom. Sandaconda also faces competition from Regirock, another Stealth Rock setter that much more reliably takes on physical attackers like Snorlax, Glastrier, and Sneasel.</p>",
    "comments": "<h3>Other Options</h3> <p>Sandaconda has access to Body Press, which does hit Orthworm and Snorlax harder, but Rock Blast and Scale Shot provide better general coverage against most Pokemon immune to Ground. High Horsepower can be run instead of Earthquake if Thwackey is a teammate.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Most Grass-types take little damage from Earthquake and threaten Sandaconda out with their STAB moves. Dipplin, Appletun, and Lurantis can wall Sandaconda in longer games. Lurantis and Toedscruel can remove Sandaconda's Stealth Rock and Rocky Helmet. Whimsicott and Calm Mind Virizion can easily take advantage of Sandaconda, though they don't appreciate Glare hurting their great Speed stats. Shaymin shrugs off paralysis from Glare thanks to Natural Cure. Tera Dragon and Scale Shot can give Coil Sandaconda some recourse against some Grass-types but can make its position against Pokemon like Dipplin, Whimsicott, and Dazzling Gleam Shaymin worse.</p> <p><strong>Pokemon Immune to Ground</strong>: Ground-immune walls like Articuno and Dipplin can walk on Sandaconda, while Orthworm can use it as fodder for setting up Coil or entry hazards. Mesprit and Mismagius can use Sandaconda to set up, block its Glare with Substitute, and use Tera Fairy to completely wall sets with Scale Shot. Oricorio-F can set up on Sandaconda and use Taunt to deny Glare. However, Ground-immune Pokemon weak to Rock, such as Charizard and Oricorio-F, must be wary of Rock Blast or Stone Edge. Only Rotom-C, Vikavolt, and Rotom are immune to Glare.</p> <p><strong>Special Attackers</strong>: Sandaconda's lower special bulk leaves it easily overwhelmed by Typhlosion, Jolteon, and Magneton, though all of them are OHKOed by Earthquake and must be wary of Sandaconda catching them with a defensive Terastallization.</p> <p><strong>Water-types</strong>: Clawitzer and Veluza hit Sandaconda for strong super effective damage and generally tolerate an Earthquake. Lanturn is capable of finishing off Sandaconda but is vulnerable to Earthquake.</p> <p><strong>Ice-types</strong>: Sneasel is powerful enough to overwhelm Sandaconda with a boost or some chip damage and can pick off Sandaconda's offensive Scale Shot set with Ice Shard even if Sandaconda has a boost, though it takes a lot of Rocky Helmet chip damage from Sandaconda when it uses Triple Axel. Glastrier is bulky enough to take two five-hit Rock Blasts from Sandaconda and threatens it with a strong Icicle Crash.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Sandaconda is a great wall thanks to its natural bulk, Shed Skin, and Ground typing. Common physical attackers like Muk, Passimian, and Regirock struggle to break through Sandaconda, and its great defensive profile enables it to consistently set up Stealth Rock. Rock Blast lets Sandaconda strike foes such as Articuno, Charizard, and Mismagius that it cannot touch with Earthquake. Alternatively, Glare lets Sandaconda spread paralysis and punish Pokemon like Dipplin, Orthworm, and Virizion that it would deal little damage to anyway. Rest and Shed Skin can keep Sandaconda healthy, although the inconsistency of Shed Skin can leave it out to dry. Rocky Helmet helps Sandaconda further wear down physical attackers like Snorlax and Regirock trying to break through it, and it enables Sandaconda to punish U-turn from pivots like Mesprit and Passimian. Tera Poison makes Sandaconda a more reliable wall to physical attackers like Passimian, Brute Bonnet, and Virizion. Tera Ghost makes Sandaconda an even more sturdy wall to physical setup sweepers like Snorlax and Regirock, improves its matchups against Fighting-types like Passimian and Hisuian Sneasel, and lets it spinblock Sandslash and Hitmontop. Tera Water helps Sandaconda handle physically offensive Ice-types like Sneasel, Beartic, and Glastrier.</p> <p>Sandaconda is a good physical wall for balanced teams looking to compress entry hazard setting on a teammate that isn't bothered as much by residual damage and status compared to Regirock, Orthworm, and Sandslash. Bulkier offensive teams also benefit from the utility and bulk Sandaconda offers in Glare and absorbing status from Weezing and Muk for offensive teammates. Sandaconda's Water weakness makes speical walls like Lanturn, Whimsicott, and Snorlax helpful for managing Clawitzer. Sandaconda is not offensively threatening to walls like Dipplin and Articuno, so teammates like Magneton and Charizard can compensate for Sandaconda's poor matchup against them and have an easier time against said targets if Sandaconda has paralyzed them with Glare. Sandaconda invites in hazard setters like Mesprit and Orthworm due to its passivity, so teamamates that can remove hazards like Lurantis and Hitmontop make good partners for Sandaconda.</p>"
      },
      "Coil": {
        "description": "<p>Sandaconda serves as a deadly late-game threat with the powerful combination of Coil, Rest, and Shed Skin. Earthquake hits most of the tier for at least neutral damage, while Sandaconda's other attacking move hits Pokemon that are immune to Earthquake like Oricorio-F and Dodrio. Scale Shot allows Sandaconda to boost its Speed, outspeeding the entire unboosted metagame except for common Choice Scarf users like Typhlosion at +2. Alternatively, Stone Edge doesn't drop Sandaconda's Defense and has more immediate potential to threaten Flying-types like Oricorio-F, Articuno, and Charizard. Rest acts as excellent recovery to keep Sandaconda healthy and combines well with Shed Skin to make it more reliable and help it serve as a wall in early- and mid-game scenarios, especially when combined with Tera Dragon to flip matchups on common Water- and Grass-types like Lanturn and Rotom-C. Coil Sandaconda can opt to run less Speed in exchange for more bulk, with 224 Speed EVs and a neutral nature being enough to outpace base 110 Speed Pokemon at +1; however, running these Speed EVs means it no longer outspeeds common Chlorophyll sweepers like Victreebel and faster Choice Scarf users like Mismagius at +2. Sandaconda can also opt to run Attack investment instead of HP, but this makes it more difficult to wall the foes it's tasked with setting up on late-game.</p> <p>Levitate users such as Mesprit and Mismagius serve as potentially problematic Pokemon, since they are immune to Earthquake and can become fully immune to Sandaconda's moves, if it's running Scale Shot, with Tera Fairy, so specially bulky teammates like Porygon2 and Snorlax can be extremely helpful to counteract them. Orthworm poses similar issues due to Earth Eater and Iron Defense, so wallbreakers that threaten it like Charizard and Typhlosion are invaluable as teammates. These two as well as Dodrio and Glastrier also threaten Grass-types, which cause problems for Sandaconda pre-Terastallization. Water-types pose similar issues while also often carrying super effective coverage for Terastallized Sandaconda, so teammates like Snorlax, Poliwrath, and Virizion benefit it greatly. In return for all of these potential partners' help, Sandaconda turns many physical attackers into setup fodder. Some common examples of Pokemon completely walled by it late-game include Passimian, Muk, and Regirock; after Terastallization, this list expands to include other threats like Lanturn and Rotom-C.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Hattrem": {
    "comments": "<h3>Other Options</h3> <p>Eject Button is an option for sun and snow teams that want Hattrem to act as a one-time pivot that deters entry hazards.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Sneasel can slam Hattrem with its Dark-type attacks, though it doesn't like taking Mystical Fire. Spiritomb can wear down or break through Hattrem. Persian-Alola threatens Hattrem with Knock Off, but struggles to wear it down quickly.</p> <p><strong>Ghost-types</strong>: Offensive Froslass and Mismagius hit Hattrem hard, though the former is hurt hard by Mystical Fire.</p> <p><strong>Psychic-types</strong>: Nasty Plot Mesprit and Farigiraf can use Hattrem as setup fodder. Even if Mesprit can't get up Stealth Rock against Hattrem, it can punish it with Knock Off and put it into bad positions with U-turn, chipping it down in the process.</p> <p><strong>Item Disruption</strong>: Knock Off users like Passimian, Sandslash, and Gurdurr soften up Hattrem by removing its Eviolite. Switcheroo and Trick still pull off their effects against Magic Bounce, so users like Mesprit and Hisuian Sneasel can punish Hattrem with a Choice item.</p> <p><strong>Strong Wallbreakers</strong>: Powerful attackers like Jolteon and Glastrier can overwhelm Hattrem with repeated hits due to its lack of recovery. Tanks like Snorlax and Arboliva can tolerate Hattrem's weak attacks and wear it down.</p>",
    "sets": {
      "Hazard Deterrent": {
        "description": "<p>Magic Bounce lets Hattrem play a rare support role as a bulky entry hazard-deterring Pokemon against Regirock and Mesprit. Healing Wish is excellent utility for supporting teammates that get worn down easily, such as Regirock and Glastrier. Mystical Fire covers Steel-types like Magneton and Orthworm. Giga Drain is an alternative that pressures Rock- and Ground-types like Regirock and Sandslash while providing Hattrem with some recovery, but it worsens Hattrem's matchups against Steel-types. Nuzzle offers valuable paralysis support; unlike Thunder Wave, it can paralyze opposing Hattrem and also break opposing Focus Sash and Sturdy users. Alternatively, Hattrem can anchor Trick Room teams, which can take advantage of Healing Wish for pivoting and giving slow attackers a second wind. Hattrem should have a Quiet nature when it runs Trick Room. Tera Fairy helps Hattrem survive a massive Dark-type attack from wallbreakers like Sneasel so it can retaliate with Mystical Fire, but Hattrem generally isn't a good user of Terastallization.</p> <p>Offense teams can count on Hattrem to keep entry hazards off, and offensive Pokemon can compensate for Hattrem's poor Speed and passivity. Teammates that appreciate entry hazards being out of the picture most appreciate Hattrem's type of support. Bulky Pokemon that don't run Heavy-Duty Boots are vulnerable to being worn down by Spikes, so Regirock, Snorlax, and Orthworm benefit greatly from Magic Bounce. Rock-weak offensive threats that don't always run Heavy-Duty Boots, such as Choice Band Sneasel and Choice Scarf Typhlosion, can hit the field more often thanks to Hattrem's support. Offensive pivots like Choice Specs Jolteon, Rotom-C, and Mesprit all benefit from the field being clear of hazards so they can switch around and stay healthy. Walls that depend on Eviolite, such as Dipplin, don't have to use their recovery moves more often when Hattrem can keep hazards off. Hattrem can stave off Fighting-types like Passimian and Hisuian Sneasel, which is greatly appreciated by Fighting-weak teammates such as Glastrier and Sneasel. Knock Off absorbers like Dipplin and Virizion let Hattrem hang onto its Eviolite and remain a useful support Pokemon for these teammates. Specially bulky Pokemon like Snorlax and Regirock can handle special attackers like Mismagius and Vikavolt for Hattrem, while physical walls like Orthworm, Dipplin, and Regirock can withstand physical attackers like Sneasel, Passimian and Muk, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Perrserker": {"sets": {"Hazard Setter": {}}},
  "Indeedee-F": {"sets": {"Choiced": {}}},
  "Morpeko": {"sets": {"Offensive Utility": {}, "Choice Band": {}}},
  "Glastrier": {
    "overview": "<p>Glastrier's defining role is that of a bulky physical wallbreaker. It has outstanding bulk for ZU; furthermore, its stellar base 145 Attack, Icicle Crash, and all the coverage it needs including Close Combat and High Horsepower make it extremely difficult to switch into. Lastly, Glastrier can boost its Attack even further with Swords Dance, allowing it to potentially OHKO or 2HKO almost the entire metagame. Defensive staples like Snorlax and Dipplin are often forced to Terastallize or switch out versus it. This means that Glastrier's most reliable defensive counterplay is somewhat specific, being limited to almost exclusively Regirock and Orthworm, none of which have reliable recovery, and the latter two of which often require Terastallization to fully check Glastrier.</p>",
    "comments": "<h3>Other Options</h3> <p>Glastrier can opt to run Heavy Slam alongside Tera Steel over High Horsepower to hit light foes like Mesprit and Steel-weak foes like Tera Fairy Dipplin and Malamar. However, trading out High Horsepower for Heavy Slam tends to be overkill, as Glastrier's standard three-move coverage sufficiently hits all relevant foes. Glastrier can also consider running Substitute to ease prediction, but all of its coverage moves are near mandatory, and without Swords Dance, Glastrier can struggle to threaten the walls it needs to.</p> <h3>Checks and Counters</h3> <p><strong>Faster Attackers</strong>: Glastrier's awful Speed means it can often be a target for offensive threats like Typhlosion, Charizard, and Passimian, though it often has to be chipped in order to not take them down with it.</p> <p><strong>Bulky Threats</strong>: Iron Press users like Orthworm and Regirock can match Glastrier's setup and threaten it out, though they may at times require Terastallization to do so. Poliwrath and Snorlax can do the same with Bulk Up and Curse, respectively, though Snorlax must Terastallize first. Weezing is able to neuter Glastrier with Will-O-Wisp and can switch in fairly safely, only fearing boosted Icicle Crash.</p> <p><strong>Status</strong>: Glastrier gets worn down rapidly by poison from Pokemon like Muk as well as burn from Pokemon like Weezing and Mismagius; burn also neuters its damage.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance Glastrier acts as a fearsome wallbreaker, leveraging its outstanding bulk and the threat of its attacks to create setup opportunities for itself. Close Combat takes on bulky Pokemon that resist Icicle Crash like Orthworm and Thick Fat Snorlax. High Horsepower serves as effective coverage for Fire-types. Tera Ground gives Glastrier a resistance to Rock while boosting the power of High Horsepower, while Tera Water and Fairy flip Glastrier's weaknesses to common offensive types like Fire and Fighting. 252 Speed EVs allows it to outspeed slower walls like Regirock, while the bulk investment lets it take on powerful attacks from various threats in the tier.</p> <p>Glastrier greatly appreciates teammates that can help bring it in safely like Jolteon and Mesprit, since it often has to take a hit after switching in due to its poor Speed. Glastrier also works well alongside other wallbreakers like Choice Specs Jolteon, Charizard, Hisuian Sneasel, as they are able to break down checks like Snorlax and Regirock for each other. Due to its many weaknesses as an Ice-type, Glastrier loves teammates it can fall back on to support it; some of these teammates include Snorlax and Regirock. As a wallbreaker, Glastrier does exceedingly well alongside Pokemon like Oricorio-F and Typhlosion that can often take advantage of the holes that Glastrier makes in defensive cores through removal of foes like Snorlax and Regirock.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Dachsbun": {"sets": {"Cleric": {}}},
  "Arboliva": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Arboliva serves as a devastating wallbreaker, utilizing its excellent STAB combination and solid coverage to OHKO or 2HKO almost the entire tier. Hyper Voice serves as an excellent neutral attack, dealing massive damage to foes like Charizard, Rotom-C, and Whimsicott. Leaf Storm is preferred as its Grass-type STAB, maximizing damage against special walls like Snorlax while potentially OHKOing foes like Mesprit and Spiritomb. Earth Power helps Arboliva hit Perrserker and Muk while Alluring Voice serves as effective coverage against the likes of Virizion and Lurantis while being an excellent tertiary STAB option post Terastallization. Tera Fairy is used for survivability reasons, flipping its matchup against foes like Passimian and the previously mentioned Virizion. The given EV spread allows Arboliva to outpace Regirock and Weezing to avoid being threatened by their super effective attacks before it can break them.</p> <p>Arboliva greatly appreciates pivoting teammates that can help safely bring it in like Lanturn, Vikavolt, and Passimian, with it working alongside them to break down opposing teams. Physically offensive teammates like Hisuian Sneasel, Glastrier, and Lycanroc appreciate Arboliva's ability to threaten massive damage to defensive foes like Lanturn, Regirock, and Spiritomb; in turn, they pressure walls Arboliva struggles with Snorlax. Entry hazard support from the likes of Sandslash and Mesprit help augment Arboliva's wallbreaking, making damage stick on the likes of Snorlax and Muk while potentially pushing them into range to be 2HKOed by Leaf Storm and Hyper Voice, respectively. Defensive Mesprit is a particularly excellent teammate for Arboliva, as it is able to provide a variety of utility options between Knock Off to remove Eviolite and Leftovers, U-turn for momentum, hazard support with Stealth Rock, and Encore to stop Snorlax in its tracks. It also works well with Arboliva defensively, where the former handles Fighting-type foes, while the latter handles Ghost-types like Mismagius and Spiritomb. Defensive teammates like Regirock, Lanturn, and Weezing help cover for Arbolivas weaknesses to common threats like Charizard, Sneasel, and Virizion.</p>"
      },
      "Bulky Attacker": {},
      "Physically Defensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 626095, "username": "sinnabyss"}]}, {"name": "Grammar checked by", "members": [{"user_id": 664887, "username": "wisteriapurple"}]}]}
  },
  "Naclstack": {"sets": {"Stealth Rock": {}, "IronPress": {}}},
  "Mabosstiff": {"sets": {"Choiced": {}}},
  "Toedscruel": {"sets": {"Offensive Rapid Spin": {}}},
  "Scovillain": {"sets": {"Choice Specs": {}}},
  "Tinkatuff": {"sets": {"Special Wall": {}}},
  "Orthworm": {
    "overview": "<p>Orthworm's place in ZU is defined by its extremely valuable Steel typing combined with its amazing natural Defense and an immunity to Ground-type moves through its signature ability, Earth Eater. With both Stealth Rock and Spikes at its disposal, Orthworm can be an excellent defensive entry hazard setter for its team; furthermore, it has multiple setup moves in Iron Defense and Coil that let it serve as both a defensive check to opposing physical attackers and a potential bulky setup sweeper with Body Press. Orthworm has two pain points holding it back from further success: special attacks threaten severe damage to it, and it can get worn down rapidly due to its lack of a reliable recovery move, especially if it loses its Leftovers.</p>",
    "comments": "<h3>Other Options</h3> <p>Orthworm can opt to run a few other Tera types if it desires; Tera Electric allows it to avoid being hit super effectively by any attack, while Tera Poison and Tera Fairy provide a Fighting resistance as well as additional defensive utility in more specific matchups. However, these Tera types introduce weaknesses to wallbreakers like Mesprit and Magneton, which are more common than Ghost-types like Mismagius and Rotom. Lastly, Orthworm can opt to run Rock Slide or Rock Blast to hit opposing Fire-types particularly hard on the switch, but it struggles to fit these over any of its moves without impacting its utility or ability to sweep.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types</strong>: Fighting-type foes like Virizion and Passimian often force Orthworm to either Terastallize or switch out unless it's already properly set up.</p> <p><strong>Fire-types</strong>: Fire-type foes like Typhlosion, Charizard, and Oricorio-F put immense pressure on Orthworm with their STAB attacks. Orthworm also struggles to deal damage against Charizard and Oricorio-F due to them resisting both Iron Tail and Body Press.</p> <p><strong>Ghost-types</strong>: Mismagius, Rotom, and Sableye are immune to Body Press and either threaten Orthworm directly with their own moves or threaten status to severely hinder its sweep.</p> <p><strong>Burn</strong>: Burn from foes like Charizard, Weezing, and Rotom significantly hinders Orthworm's damage output, neutralizes its Leftovers recovery, and limits its sweeping ability, though it can at least use Substitute to circumvent Will-O-Wisp attempts against slower foes like Weezing.</p> <p><strong>Encore and Taunt</strong>: Encore from foes like Mesprit and Whimsicott can disrupt Orthworm in the middle of its setup attempts, as does Taunt from the likes of Mismagius and Oricorio-F. Taunt also denies its attempts to set entry hazards.</p> <p><strong>Item Disruption</strong>: Knock Off from foes like Mesprit, Passimian, and Sandslash severely injures Orthworm's longevity due to its reliance on Leftovers, as does Switcheroo from Rotom and Whimsicott.</p> <p><strong>Special Attackers</strong>: Orthworm's poor special bulk can often be taken advantage of by foes like Jolteon, Magneton, Vikavolt, and Clawitzer, though some of these Pokemon have to be wary of Body Press on the switch in.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Orthworm is an excellent defensive Pokemon thanks to its great physical bulk, Steel typing, and complementary immunity to Ground from Earth Eater. Common Pokemon like Snorlax, Sandslash, and Sandaconda struggle to break through Orthworm on their own, while other Pokemon like Farigiraf and Mesprit must either dedicate a coverage move for Orthworm or Terastallize. Orthworm's fantastic defensive profile gives it ample opportunities to switch in and set up entry hazards with Stealth Rock and Spikes for its teammates. Orthworm is also a resilient hazard setter against Sandslash, one of the few common hazard removers. Heavy Slam has the best immediate power and coverage of Orthworm's attacks against foes like Sneasel-Hisui and Articuno, deals super effective damage to Froslass, and wrecks Whimsicott and Tera Fairy Pokemon such as Jolteon and Mesprit. Body Press is strong against Snorlax and Glastrier, and it 2HKOes heavier foes and Electric-types such as Magneton and Jolteon. The increased resilience and additional power to Body Press provided by Iron Defense enable Orthworm to beat physical attackers like Passimian and set up on setup sweepers such as Curse Snorlax. Orthworm can lean into its hazard setting capabilities by running Stealth Rock and Spikes, taking advantage of Choice item attackers like Mesprit and Sneasel-Hisui and accepting its own lack of longevity as a defensive Pokemon. Protect helps Orthworm maximize recovery from Leftovers and scout Choice item attackers like Passimian, Magneton, and Typhlosion. Tera Ghost makes Orthworm more secure against Fighting-type physical attacks like Close Combat from Passimian and Glastrier, Body Press from Regirock and opposing Orthworm, and Low Kick from Dodrio. Tera Ghost also enables Orthworm to block Rapid Spin from Sandslash to preserve the entry hazards it sets, and it's especially helpful against Hitmontop. Tera Electric leaves Orthworm without weaknesses, so it can more efficiently set hazards and take on physical attackers. Orthworm's EVs are tailored to patch up its lower special bulk to enable it to take on special attackers like Mesprit, Farigiraf, and Whimsicott more comfortably while still giving it enough physical bulk to survive a +2 Low Kick from Dodrio, Close Combat from Passimian, and 2 Low Kicks from Sneasel.</p> <p>Orthworm is a good fit for bulky offense teams looking for an entry hazard setter, and its limited longevity is a better fit for the playstyle compared to more passive hazard setters like Sandaconda. Offensive Pokemon such as Charizard, Jolteon, and Typhlosion adore checks to them like Snorlax and Regirock taking residual damage from Orthworm's entry hazards. Passimian, Mesprit, and Sneasel commonly run Knock Off, which complements Orthworm's entry hazards by removing Heavy-Duty Boots from Pokemon such as Hitmontop and Charizard and helping wear them down. Charizard can comfortably take Orthworm's attacks and threaten it out, so Orthworm appreciates support from partners like Snorlax and Lanturn that can threaten Charizard and other Fire-types like Typhlosion. Hazard removers like Lurantis are appreciated by Orthworm because residual damage from Spikes racks up quickly on it and limits its defensive capabilities. Rapid Spin users like Sandslash, Hitmontop, and Cryogonal remove entry hazards without removing Orthworm's entry hazards. Fighting-types like Virizion and Passimian can overpower Orthworm with their super effective STAB moves, so checks to them such as Mesprit, Charizard, and Weezing are appreciated. Orthworm is a great partner for Pokemon vulnerable to Ground-types, such as Jolteon and Lanturn.</p>"
      },
      "Coil": {
        "description": "<p>With Coil, Orthworm can act as an excellent progress maker and bulky wincon for its team, leveraging its excellent typing and Ground immunity to set up on foes like Sandslash and Sandaconda. Furthermore, other foes like Muk and Mesprit can often find it difficult to make progress against Orthworm without utilizing Terastallization. Iron Tail and Body Press cover much of the tier together, while Substitute lets Orthworm avoid burn from foes like Mismagius, and Weezing. Substitute also prevents Orthworm from being phazed by Dragon Tail from the likes of Dipplin and protects it from revenge killers like Passimian. Maximum Special Defense investment alongside a Careful nature helps Orthworm better withstand special attacks from foes like Jolteon, Lanturn, and Mismagius. Tera Ghost is used to help find setup opportunities against Fighting-types like Passimian and Virizion.</p> <p>Coil Orthworm pairs well with fast teammates like Jolteon and Hisuian Sneasel, which appreciate its ability to take advantage of Ground-type foes like Sandslash and Sandaconda. Other teammates like Lanturn, Articuno, and Typhlosion appreciate Orthworm's ability to use common checks like Arboliva and Snorlax as setup fodder. Fire-types can often be a significant struggle for Orthworm, so it appreciates teammates like Snorlax and Lanturn to check them. Without prior boosts, Orthworm can often have a rough time against opposing Fighting-types, so teammates like Whimsicott, Charizard, and Weezing can serve as invaluable support. Since Orthworm relies heavily on its Leftovers for its game plan, it appreciates Knock Off absorbers like Dipplin and Muk. Hazard support from teammates like Mesprit and Sandslash is often greatly appreciated to help weaken Orthworm's checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 435539, "username": "BloodAce"}, {"user_id": 452572, "username": "missangelic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 569291, "username": "zinnias"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Veluza": {"sets": {"Fillet Away Sweeper": {}}},
  "Farigiraf": {
    "comments": "<h3>Other Options</h3> <p>Tera Fairy blunts the damage from Knock Off and other Dark-type moves from Sneasel, Spiritomb, and Passimian, and it also denies Dragon Tail from Dipplin and Appletun. Tera Fighting beats Steel-types, hits Snorlax harder and sooner than Stored Power can with limited boosts, and also flips Farigiraf's Dark and Bug weaknesses. A Weakness Policy on Stored Power sets can take advantage of weaker attacks like Knock Off and U-turn from Mesprit but is situational, tough to activate, and limits Farigiraf's longevity. Cud Chew, with a Sitrus Berry, can give Farigiraf more concentrated recovery than Leftovers, and, with a Lum Berry, it can help it more comfortably set up against Glare Sandaconda and Toxic Toedscruel. Sap Sipper can provide Farigiraf with setup opportunities against Whimsicott and Shaymin locked into Grass-type moves. However, Armor Tail best enables Farigiraf as a sweeper by guarding it from priority moves. Farigiraf can run an offensive Trick Room set, though Alolan Exeggutor often does this role better because of its greater power and coverage. Farigiraf has other options in its movepool such as Future Sight, Wish, and Roar but struggles to support teams with its mediocre defensive typing.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Malamar has enough special bulk to take a boosted hit from Farigiraf and retaliate with their Dark-type STAB moves, Sneasel outspeeds Farigiraf before an Agility and hits it hard with Knock Off, and Alolan Persian can Taunt Farigiraf before it can set up. Although Sableye and Spiritomb don't deal much damage to Farigiraf on their own, they can force it to exhaust Terastallization or totally counter it if it's no longer available.</p> <p><strong>Steel-types</strong>: Magneton, Orthworm, and Perrserker force Farigiraf to exhaust Tera in order to beat them if it lacks enough boosts for Stored Power, and Psyshock is particularly weak against their high Defense stats.</p> <p><strong>Bulky Pokemon</strong>: Snorlax and Regirock can stomach Farigiraf's hits unless it's accumulated multiple boosts for Stored Power. Snorlax takes significant damage from a boosted Psyshock, though. Dipplin and Appletun can phaze Farigiraf with Dragon Tail; similarly, Articuno can use Haze to clear away Farigiraf's boosts or Roar to phaze it, and it has the bulk and recovery to repel Farigiraf repeatedly.</p> <p><strong>Taunt</strong>: With Taunt, Oricorio-F and Mismagius can prevent Farigiraf from setting up, which is especially disruptive if Farigiraf lacks boosts and has Stored Power, and they can set up on it in return.</p>",
    "sets": {
      "Double Dance": {
        "description": "<p>Farigiraf can reach great heights as a setup sweeper thanks to its great bulk and solid Special Attack. Psyshock hits specially bulky Pokemon such as Snorlax and Articuno and ignores Special Defense boosts on sweepers like Oricorio-F and Jolteon. As Farigiraf accumulates multiple boosts, though, Stored Power helps it become a taller order for teams to check, and it hits physically bulkier Pokemon like Regirock and Sandaconda harder. However, Stored Power provides less immediate damage for breaking teams and is more inflexible by requiring Farigiraf to spend multiple turns boosting. Farigiraf can effectively use Tera Blast as a STAB move to beat Dark-types like Persian-Alola and Sneasel. After Terastallizing, it transforms into Tera Blast Fire, which lets it beat Orthworm, Magneton, Spiritomb, and Tera Steel Pokemon like Rotom-C and Weezing. Armor Tail aids Farigiraf's sweep by denying priority attacks like Aqua Jet from Accelrock from Lycanroc and Ice Shard from Sneasel. Armor Tail also saves Farigiraf from being locked into its setup by Prankster Encore from Whimsicott and Sableye. Farigiraf can invest fully in its Special Attack to become immediately more threatening, potentially sweeping just off of Agility, but full investment in HP gives it better opportunities to use multiple setup moves; Psyshock is better tailored for sets with maximum Special Attack investment, compared to Stored Power, which works better on maximum HP sets where it can more comfortably accumulate multiple boosts.</p> <p>Farigiraf fits on hyper offensive teams as a setup sweeper. Fellow setup sweepers such as Virizion and Oricorio-F greatly appreciate partnering with Farigiraf, given its positive matchups against Prankster disruptors like Whimsicott and Sableye. Powerful offensive partners like Glastrier, Virizion, and Typhlosion can break holes in teams for Farigiraf to more easily sweep. Farigiraf has to exhaust Terastallization in order to beat Spiritomb, so it appreciates partners that can deal with it, such as Whimsicott and Magneton. Hyper offense leads like Froslass and Lycanroc can set up entry hazards to help weaken foes like Regirock and Dipplin to better enable Farigiraf to sweep. Orthworm is a tough target for Fargiraf to break on its own, so it appreciates help from Fire-type teammates like Charizard, Typhlosion, and Oricorio-F that can pressure it. Fighting-type partners like Passimian, Virizion, and Hitmontop can handle Orthworm as well as another obstacle to Farigiraf in Regirock. Hisuian Sneasel is a standout partner for Farigiraf by checking all three aforementioned stops to it, while Fargiraf pressures its defensive answers such as Weezing and Mismagius.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Dipplin": {
    "comments": "<h3>Other Options</h3> <p>Dipplin's shallow movepool leaves little room for variety. Tera Water eliminates its Ice weakness and defensively answers Glastrier, but it does not fix Dipplin's vulnerability to Articuno's Freeze-Dry and worsens its matchups against Virizion and Trevenant, physical attackers that it would otherwise check.</p> <h3>Checks and Counters</h3> <p><strong>Whimsicott</strong>: The Grass / Fairy typing leaves Whimsicott barely scratched by Dipplin's Giga Drain and immune to Dragon Tail. Even without Choice Specs, Whimsicott has a 93.4% chance to 2HKO Dipplin with Moonblast. Even if Dipplin Terastallizes, pivot Whimsicott sets can lock Dipplin into a non-damaging move with Encore and whittle it down.</p> <p><strong>Ice-type Pokemon and Coverage</strong>: Articuno 2HKOes Dipplin with Freeze-Dry, has great bulk and Roost, can remove Dipplin's boosts with Haze or Roar if it Terastallizes, and can PP stall Dipplin with Pressure. Cryogonal has Freeze-Dry, recovery, and Haze similar to Articuno but isn't as bulky. Sneasel, Froslass, and Glastrier overcome Dipplin's massive Defense by exploiting its 4x Ice weakness, but Dipplin Terastallizing sours their positive matchups against it.</p> <p><strong>Flying-types</strong>: Charizard 2HKOes Dipplin with Hurricane and can switch in while Dipplin uses Growth, Recover, or Giga Drain. Oricorio-F similarly 2HKOes Dipplin with Hurricane, threatens to set up on Dipplin with Quiver Dance, and can Taunt Dipplin. Dodrio can cut through Dipplin's physical bulk if it gains a Swords Dance boost.</p> <p><strong>Strong Special Attackers</strong>: Choice Specs Jolteon 2HKOes Dipplin with Alluring Voice. Shaymin can exploit the Special Defense drops from Seed Flare and one of its coverage moves to break through Dipplin, and it has the bulk to take boosted hits from Dipplin. Alolan Exeggutor takes a big chunk of damage from Dragon Tail but can switch in on Recover, Growth, or Giga Drain and exploit the negative priority of Dragon Tail to blow Dipplin away with Draco Meteor. Vikavolt 2HKOes Dipplin with Bug Buzz and can comfortably take attacks from Dipplin. Clawitzer must be wary of Giga Drain but has a 68.8% chance to OHKO Dipplin with a Choice Specs-boosted Dragon Pulse.</p> <p><strong>Tera Fairy Users</strong>: Dipplin's dependence on Dragon Tail to phaze setup sweepers makes it setup fodder for Tera Fairy users like Nasty Plot Mesprit, Calm Mind Jolteon, and Mismagius. Snorlax must fish for paralysis with Body Slam but can overcome Dipplin in the long run with luck.</p> <p><strong>Residual Damage</strong>: Dipplin relies on its Eviolite for its bulk and is vulnerable to damaging entry hazards, which force it to use its limited Recover more often and become more passive. Toxic from Muk and Toedscruel puts Dipplin on a timer and prevents it from gaining enough boosts to sweep. Even burns from switching into ideal foes like Lanturn hurt Dipplin's longevity and dampen the power of its Dagon Tail. Weezing can fish for a poison on Dipplin with Sludge Bomb, burn it with Will-O-Wisp, and wash away its boosts with Haze.</p> <p><strong>Haze and Phazing</strong>: Weezing and Muk can wipe Dipplin's boosts with Haze and threaten it with their Poison-type STAB moves, and they have the bulk to take even boosted hits from Dipplin.</p> <p><strong>Encore</strong>: Sableye can switch in as Dipplin sets up and lock it into a non-damaging move like Growth or Recover. Even if Dipplin Terastallizes to improve its matchups against them, Mesprit and Whimsicott can still disrupt it.</p>",
    "sets": {
      "Growth": {
        "description": "<p>Dipplin is a fantastic check to physical attackers like Regirock and Passimian thanks to its substantial physical bulk and ability to absorb Knock Off. Dipplin's walling capabilities give it many opportunities to set up Growth against passive or ineffective foes like Sandaconda and Orthworm to function as a bulky sweeper. Dragon Tail phazes setup sweepers that might try to break through Dipplin such as Snorlax, Virizion, and Malamar. Giga Drain keeps Dipplin healthy as it attacks to make it less reliant on Recover to quickly devour Pokemon weak to Grass like Regirock, Poliwrath, and Sandaconda. Sticky Hold distinguishes Dipplin from other NFE Pokemon dependent on their Eviolite such as Porygon2 by protecting Dipplin from Knock Off, Switcheroo, and Trick from users like Passimian and Mesprit. Tera Poison improves Dipplin's matchups against Fighting-types like Hisuian Sneasel, allowing it to maintain good matchups against Poison-types like Muk and Weezing as well as an immunity to poison at the cost of vulnerability to Mesprit and Farigiraf. Tera Fairy protects Dipplin from being phazed by Dragon Tail from opposing Dipplin and Appletun, and it improves Dipplin's vulnerability to Alolan Exeggutor and Appletun. Tera Steel turns the tables against checks like Glastrier, Sneasel, and Tera Fairy Mesprit and protects Dipplin from poison from Weezing and Muk at the cost of worsening its matchups against Fighting-types.</p> <p>Dipplin's capability to absorb Knock Off makes it a great partner to Pokemon that are reliant on their items, including Articuno, Regirock, and Porygon2. Snorlax is an excellent partner to handle threats to Dipplin like Articuno, Typhlosion, and Charizard, and Dipplin takes physical attacks and Knock Off from Poliwrath, Passimian, and Sandslash for Snorlax in return. Dipplin amplifies residual damage from entry hazard stacking thanks to Dragon Tail, so hazard setters like Hisuian Qwilfish, Orthworm, and Sandslash have great synergy with Dipplin. Knock Off users like Mesprit, Passimian, and Sneasel can remove Heavy-Duty Boots from foes to ensure they take damage from entry hazards when Dipplin uses Dragon Tail. Teammates weak to Water and Grass like Regirock, Sandaconda, and Sandslash appreciate Dipplin taking on Lanturn and Virizion for them. Teammates like Charizard, Typhlosion, and Orthworm can handle special attackers with Fairy- and Ice-type coverage for Dipplin, offensively checking Whimsicott and Articuno. Regirock and Naclstack help Dipplin by defensively answering Flying-types like Dodrio, Charizard, and Oricorio-F for it. Dipplin is vulnerable to being overwhelmed by chip damage from hazards, so it depends on partners with hazard removal like Sandslash and Hitmontop to mitigate this vulnerability.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  }
}