{
  "Charizard": {"sets": {"Special Attacker": {}}},
  "Sandslash": {"sets": {"Defensive Spinner": {}}},
  "Sandslash-Alola": {"sets": {"Defensive Spinner": {}}},
  "Arcanine": {
    "sets": {
      "Curse": {
        "description": "<p>Arcanine is one of PU's strongest and most threatening sweepers and cleaners thanks to its great natural bulk, decent defensive typing, great ability in Intimidate, and Curse + Extreme Speed naturally synergizing together. Curse boosts Arcanine's physical stats, making it a stronger threat and a bulkier attacker while also naturally synergizing with Extreme Speed and Intimidate. Morning Sun provides recovery, allowing Arcanine to alleviate its Stealth Rock weakness and recover against more passive walls like Altaria and Wo-Chien. An alternative to Morning Sun is Close Combat, which prevents Arcanine from being walled by Coalossal and does more damage to Water-types than Extreme Speed before Terastallization; however, it severely cuts into Arcanine's longevity. Leftovers aids with Flare Blitz recoil, although it does leave Arcanine extremely weak to entry hazards. Heavy-Duty Boots is another viable option to make it completely immune to Stealth Rock and other entry hazards, although it does come at the cost of Arcanine solely relying on Morning Sun to recover off damage. The given EV spread allows Arcanine to outspeed Modest Toxtricity before a Curse. Tera Normal removes all of Arcanine's weaknesses, allowing it to set up on Pokemon like Decidueye and non-Clear Smog Gastrodon while also boosting Extreme Speed, enabling it to pick off faster attackers like Inteleon and Staraptor after a Curse.</p> <p>Arcanine fits on a variety of teams but most commonly finds itself on hyper offense and balance teams looking for a powerful sweeper and setup threat. Arcanine struggles to deal with bulky physically defensive walls that can cripple it with status or phaze it like Bellibolt, Mudsdale, and Galarian Slowbro, so checks to these Pokemon like Golurk and Inteleon make excellent partners. Other physical attackers like Decidueye and Flamigo also make great partners, as they work together with Arcanine to chip away at their shared checks like Bellibolt and Houndstone. If Arcanine is using Leftovers as its item, entry hazard control from Pokemon like Tastugiri, Scyther, and Altaria can help alleviate Arcanine's Stealth Rock weakness to make it a more potent sweeper. As Arcanine struggles to set up against special attackers like Toxtricity, Inteleon, and Scream Tail, special walls like Assault Vest Galarian Slowbro and Milotic can provide a defensive backbone for Arcanine to fall back on.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 414072, "username": "Hera"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Poliwrath": {"sets": {"Bulk Up": {}}},
  "Slowbro-Galar": {
    "sets": {
      "Assault Vest": {
        "description": "<p>Galarian Slowbro makes for an effective mixed wall and bulky pivot when equipped with an Assault Vest thanks to its good natural bulk and typing that enables it to check prominent threats like Florges and Paldean Tauros-W. Regenerator is an incredible ability that allows Galarian Slowbro to remain healthy throughout a game while maintaining momentum, which, when paired with its good coverage, lets it soft check most Pokemon in the tier, from setup sweepers like Calm Mind Scream Tail and Curse Arcanine to other walls like Bellibolt and Coalossal. Flamethrower gives Galarian Slowbro important coverage to hit Steel-types like Alolan Sandslash and Bronzong. Surf lets Galarian Slowbro punish Ground-types that threaten it on the switch, such as Mudsdale and Gligar, while also letting it hit Fire-types like Coalossal and Rotom-H. Earthquake gives Galarian Slowbro an advantage versus other Galarian Slowbro while also letting it hit Skuntank on the switch, which otherwise resists its STAB attacks and heavily threatens it with Knock Off. 4 Special Attack EVs mean that Shell Side Arm will always be special against targets with equal Defense and Special Defense, avoiding contact effects like Rocky Helmet. 128 Defense EVs let Galarian Slowbro tank a +2 Wave Crash from Jolly Paldean Tauros-W. An alternative EV spread of 248 HP / 16 Def / 4 SpA / 240 SpD can be used instead to allow Galarian Slowbro to tank two consecutive Boombursts from Throat Spray Toxtricity. Both Tera Water and Tera Fairy let Galarian Slowbro shed all of its regular weaknesses, letting it deal with Pokemon such as Mudsdale, Houndstone, Zoroark, and Bombirdier. Tera Fairy completely reverses Galarian Slowbro's Dark weakness and enables it to better handle Dark-types like Scrafty and Zoroark compared to Tera Water while retaining its ability to handle Fighting-types like Flamigo and Pawmot. Tera Water lets Galarian Slowbro better handle Water- and Fire-types such as Delphox and Inteleon, allows Surf to 2HKO Ground-types like Gligar and Golurk, and does better into Skuntank compared to Tera Fairy due to lack of a Poison weakness.</p> <p>Assault Vest Galarian Slowbro fits excellently on balance and bulky offense teams due to its ability to serve as a reliable pivot into Fighting- and Fairy-type attackers for teammates like Alolan Sandslash and Paldean Tauros-W. Galarian Slowbro is particularly susceptible to Knock Off due to its Dark weakness and reliance on its item to check special attackers, so teammates like Scrafty, Mudsdale, and Bellibolt that can switch in on Knock Off users like Skuntank and Zoroark make for good partners. Scrafty in particular makes for a great partner, as while it can defensively and offensively deal with Dark- and Ghost-types, Galarian Slowbro deals with the Fairy- and Fighting-types that threaten Scrafty, such as Flamigo and Paldean Tauros-W. Galarian Slowbro is also threatened by Ground-types like Mudsdale, so Ground-resistant and -immune teammates like Decidueye and Gligar are appreciated. Bombirdier and Staraptor both make for strong partners for their ability to deter Ground-type attacks while offensively checking Decidueye, Golurk, and Scrafty that all threaten Galarian Slowbro. Galarian Slowbro is greatly hurt by entry hazards, as it switches frequently to recover health with Regenerator, so teammates that can remove these hazards such as Coalossal and Altaria make for excellent partners, and in return, Galarian Slowbro can check Paldean Tauros-W and Paldean Tauros-F for Coalossal and Florges for Altaria.</p>"
      },
      "Defensive": {
        "description": "<p>Galarain Slowbro is a premier defensive pivot thanks to its solid defensive typing, which checks Pokemon like Flamigo and both Paldean Tauros formes; strong physical bulk; wide movepool to deal with switch-ins; Regenerator to heal off residual damage; and Slack Off so it can stay on the field. Psyshock is occasionally used over Psychic because it hits specially defensive Pokemon like Gastrodon, Tera Poison Florges, and Snorlax harder. Flamethrower synergizes well with its other moves, letting it hit Steel-types that would usually come in on Galarian Slowbro like Alolan Sandslash and Levitate Bronzong, as well as Dark-types like Skuntank. Toxic is great at putting switch-ins like Mudsdale, Golurk, and Bellibolt on a timer. Thunder Wave is occasionally useful as a stopgap for faster sweepers like Trailblaze Paldean Tauros-W; however, this gives Ground-types like Golurk and Mudsdale free entry compared to Toxic. Surf is also an option that hits Ground- and Fire-types like Golurk and Delphox, which are otherwise annoying for Galarian Slowbro while being a solid midground option versus Dark-types like Bombirdier; however, it often struggles to fit this move in practice. Heavy-Duty Boots is the more consistent option to avoid taking troublesome damage from entry hazards, while Rocky Helmet punishes contact moves from Pokemon like Staraptor and Flamigo while deterring U-turn from Pokemon like Scyther. Tera Water and Tera Fairy are both useful for shedding its poor Ghost-, Dark-, and Ground-type weaknesses, letting Galarian Slowbro switch into Pokemon like Houndstone, Bombirdier, and Sandaconda; however, while Tera Water gives it a better matchup against Fire- and Water-types like Arcanine and Inteleon, Tera Fairy reverses its Dark weakness and lets it handle foes like Zoroark and Bombirdier while keeping its good matchup against Fighting-types like Flamigo and Pawmot.</p> <p>Galarian Slowbro fits best on balance and bulky offense teams that appreciate its ability to pivot in and out of tier staples like Flamigo and Ambipom. While bulky, Galarian Slowbro appreciates a fellow physical wall to pivot to so it doesn't have to take every hit. Pokemon like Bellibolt, Milotic, and Wo-Chien are all solid options; Bellibolt and Milotic can bring Galarian Slowbro in with pivot moves to regain health, while Wo-Chien and Bellibolt can directly switch into Galarian Slowbro's poor matchups like Swords Dance Decidueye and Zoroark, respectively; Bellibolt specifically is a great switch-in to Knock Off, which Galarian Slowbro hates. In return, Galarian Slowbro can block Toxic for them, which all of these defensive Pokemon hate. Wallbreakers that are weak to Fighting-types like Zoroark and Duraludon also appreciate having a strong Fighting resistant teammate to fall back on. Specially defensive Pokemon like Florges and Scrafty can help Galarian Slowbro deal with the special attackers it struggles with like Inteleon and Delphox. Galarian Slowbro struggles with Dark-, Ground-, and Ghost-types like Scrafty, Mudsdale, and Golurk, so Pokemon that can come in on them like Grimmsnarl and Wo-Chien are heavily appreciated. Pokemon that threaten Steel-types and Gligar, such as Paldean Tauros-W, are also greatly appreciated, as due to their Toxic immunity, Galarian Slowbro struggles to make progress against them even when running Flamethrower, unless it is running Surf for Gligar.</p>"
      },
      "Calm Mind": {"description": "<p>Psyshock is better for dealing with special walls like Gastrodon and Goodra as well as opposing Calm Mind users, but Psychic can be used to deal with physical walls like Mudsdale and opposing Galarian Slowbro. Sludge Bomb is another option that can help Galarian Slowbro wear down nuisances like Delphox, Wo-Chien, and Bombirdier. Flamethrower nails Steel-types like Alolan Sandslash, Bronzong, and Tera Steel Paldean Tauros-W, while Surf hits Ground-types like Gligar hard and has good neutral coverage. Nasty Plot gives Galarian Slowbro more breaking power than Calm Mind but doesn't boost its Special Defense, making it easier for foes like Rotom-H and Tatsugiri to overwhelm.</p> <p>Sample set. Stay tuned for updates!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 414072, "username": "Hera"}, {"user_id": 626934, "username": "Morge"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Dodrio": {"sets": {"Swords Dance": {}, "Choice": {}}},
  "Muk": {"sets": {"Utility": {}}},
  "Electrode-Hisui": {"sets": {"Pivot": {}}},
  "Exeggutor-Alola": {"sets": {"Choice Specs": {}, "Eject Pack": {}}},
  "Weezing": {"sets": {"Physically Defensive": {}}},
  "Rhydon": {"sets": {"Stealth Rock": {}, "Offensive Swords Dance": {"description": "<p>Megahorn is a niche option that hits Wo-Chien and Uxie harder than Heat Crash while being more reliable against Alolan Exeggutor. However, it is generally less useful coverage than Heat Crash, since it's worse against Bronzong and Hisuian Decidueye.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Scyther": {"sets": {"Swords Dance": {}, "Pivot": {}}},
  "Tauros-Paldea-Blaze": {"sets": {"Bulk Up": {}, "Choice": {}}},
  "Tauros-Paldea-Aqua": {"sets": {"Bulk Up": {}, "Choice": {}}},
  "Jolteon": {"sets": {"Calm Mind": {}}},
  "Snorlax": {"sets": {"Tank": {}, "Curse": {}}},
  "Articuno-Galar": {"sets": {"Offensive Pivot": {}}},
  "Lanturn": {"sets": {"Defensive Pivot": {"description": "<p>36 Speed EVs allow Lanturn to outspeed Sandaconda. While Volt Absorb is generally the better ability, Water Absorb is viable on teams that are particularly weak to Water-types like Floatzel.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Gligar": {"sets": {"Physically Defensive": {"description": "<p>With the Special Defense investment, Gligar avoids the 2HKO from Rotom-C’s Leaf Storm after Stealth Rock. 16 Speed EVs let Gligar outrun Adamant Golurk.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Heracross": {"sets": {"Wallbreaker": {}}},
  "Sneasel": {"outdated": true, "sets": {"Swords Dance": {"description": "<p>Life Orb compensates for Sneasel’s naturally middling damage output and makes taking its hits more difficult. Eviolite augments Sneasel’s bulk, which can translate to setup opportunities against threats like Morpeko. However, both options are generally less consistent than Heavy-Duty Boots, which lets Sneasel freely switch in and out to wear foes down or revenge kill weakened targets like Skuntank and Tauros. Tera Ghost makes Sneasel immune to Fighting-type attacks from the likes of Hisuian Sneasel and Passimian, allowing it to either retaliate with a strong attack or set up on them.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Band": {}}},
  "Hitmontop": {"sets": {"Rapid Spin": {}}},
  "Sceptile": {"sets": {"Terrain Sweeper": {}, "Special Attacker": {}}},
  "Hariyama": {"sets": {"Bulk Up": {}, "Assault Vest": {}, "Belly Drum": {}}},
  "Grumpig": {"sets": {"Nasty Plot": {"description": "<p>Grumpig is not viable in PU, but this is considered its best set.</p> <p>136 Speed EVs let Grumpig outspeed Modest Glaceon. 44 SpA EVs allow unboosted Tera Ground Grumpig to KO offensive Skuntank with Earth Power after Stealth Rock damage.</p>"}}},
  "Altaria": {
    "sets": {
      "Defensive": {
        "description": "<p>Altaria's wide variety of utility options like Defog, Will-O-Wisp, Haze, and Roar, great defensive stats, useful ability in Natural Cure, and excellent typing allowing it to check a wide variety of Pokemon like Paldean Tauros-W, Golurk, Bruxish, and Hariyama make it one of PU's few forms of entry hazard control and a decent wall, although it needs to watch out for Ice-type coverage from Pokemon like Golurk and Scrafty. Brave Bird allows Altaria to not be completely passive and helpless against Taunt from Pokemon like Bombirdier and Skuntank while also doing more damage than Hurricane against specially defensive Pokemon like Florges and Delphox. Altaria's choice of its final move is flexible; Will-O-Wisp cripples physical attackers Altaria switches into like Paldean Tauros-W, Scrafty, and Decidueye. Haze allows Altaria to prevent setup sweepers like Nasty Plot Delphox and Zoroark as well as Curse Arcanine from using it as setup fodder, while Roar does the same but also functions better against Substitute users such as Scream Tail, although it can be counterintuitive with Defog due to not being able to accrue chip damage from hazards that Defog removes. The given EV spread allows Altaria to outspeed Golurk and Adamant Emboar while still providing as much bulk as possible, although a spread of 252 HP / 252 Def / 4 SpD can be used to be bulkier if outspeeding these two is not needed. An alternative spread of 252 HP / 120 SpD / 136 Spe can allow Altaria to become a better special wall, checking Pokemon like Kilowattrel and Meloetta better. Tera Steel flips all of Altaria's weaknesses, allowing it to more safely threaten Pokemon like Alolan Sandslash, Florges, and Scream Tail, although Terastallizing does make it unable to check Fighting- and Fire-types like Flamigo and Delphox as well as removing Altaria's Ground immunity, making the matchup against hazard setters like Gligar and Mudsdale harder.</p> <p>Due to its relative passivity, Altaria fits mostly on bulky balance teams needing a Defogger that can also compress multiple roles. Altaria's ability to absorb status moves like Toxic and Thunder Wave is appreciated by other walls like Wo-Chien and Gastrodon as well as setup sweepers like Delphox and Virizion. In turn, Pokemon like Wo-Chien and Virizion can be reliable Knock Off absorbers for Altaria, so it does not lose its Heavy-Duty Boots. Altaria finds itself extremely susceptible to Ice- and Fairy-types like Alolan Sandslash, Froslass, and Florges as well as coverage moves like Triple Axel from Ambipom; checks to these threats like Bronzong, Skuntank, and Rotom-H thus make excellent partners. Specially defensive walls like Bronzong, Assault Vest Galarian Slowbro, and Florges create a defensive backbone with Altaria. Altaria's ability to check and burn physical attackers like Paldean Tauros-W, Zoroark, and Flamigo allows Pokemon that are checked by these threats like Arcanine and Houndstone become more potent attackers. Altaria's ability to remove entry hazards allows Pokemon particularly weak to them like Choice Scarf Staraptor, Arcanine, and Galarian Slowbro to become bigger threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 617840, "username": "gulch"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Milotic": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Milotic ensures its place as a defensive staple thanks to its ability to stop setup sweepers, take advantage of otherwise debilitating status ailments with Marvel Scale, and take on common threats like Inteleon, Paldean Tauros-W, and Salazzle. Haze is preferred, as it can clear stat boosts on Fairy-type Pokemon like Grimmsnarl, Florges, and Tera Fairy Galarian Slowbro and even go through Substitute, which can help versus the former and Scream Tail. However, Dragon Tail can be used to bypass Taunt from Pokemon such as Oricorio-G while still phazing foes. Ice Beam lets Milotic hit incoming Grass-types like Decidueye, Hisuian Electrode, and Rotom-C while also preventing it from being useless against Water-resistant or -immune Pokemon like Altaria, Goodra, Tatsugiri, and Gastrodon. Flip Turn can be used to turn Milotic into a pivot, but it either has to give up its matchup versus setup sweepers or Water-resistant and -immune Pokemon, making it hard to justify. If Milotic runs Dragon Tail, it can opt to use Mirror Coat over Ice Beam to still threaten Fairy-types that like to set up, such as Florges and Tera Fairy Galarian Slowbro, while also letting it do damage to Pokemon it couldn't touch otherwise like Inteleon. Heavy-Duty Boots allows Milotic to circumvent being chipped by entry hazards while Leftovers can counteract Milotic's need to heal as often and make it less vulnerable to chip damage from status. Marvel Scale allows Milotic to take advantage of status ailments such as the burn from Altaria's and Coalossal's Will-O-Wisp as well as Gastrodon's Scald, paralysis from Duraludon's Thunder Wave, and poison from Skuntank's Poison Jab. Competitive can be used to take advantage of Defog users like Altaria and Scyther as well as Pokemon with stat-dropping moves like Parting Shot Grimmsnarl and Memento Tatsugiri, but in general, it tends to be quite niche and very situational. The given EV spread makes Milotic as physically defensive as possible while outspeeding Adamant Golurk. Tera Dragon gifts Milotic Grass and Electric resistances while maintaining key resistances to Water and Fire, letting it better take on Decidueye and Rotom-H.</p> <p>Due to Milotic's ability to phaze Pokemon with Dragon Tail, entry hazards from setters like Alolan Sandslash, Coalossal, and Gligar work well alongside it, helping Milotic wear down the opposing team more easily. Choice Scarf users like Flamigo, Zoroark, and Paldean Tauros-F greatly appreciate Milotic's ability to spread chip damage with Dragon Tail and ensure setup sweepers like Toxtricity, Virizion, and Scrafty don't get out of hand, as it makes late-game cleaning easier for them. Grass- and Electric-types like Wo-Chien, Pawmot, and Kilowattrel easily threaten Milotic, so teammates like Rotom-H, Mudsdale, and Assault Vest Goodra act as good switch-ins that can still threaten these Pokemon offensively. Special tanks like Bronzong, Wo-Chien, and Assault Vest Galarian Slowbro help create a defensive backbone alongside Milotic. While Milotic can switch into Water-types like Inteleon, Paldean Tauros-W, and Gastrodon and easily tank their attacks, it can't do much back, making it a stalemate. Pairing Milotic with offensive threats like Rotom-C, Kilowattrel, and Decidueye helps to circumvent this issue. As Milotic can't easily carry Flip Turn, it can be a momentum sink at times, so other pivots are valuable partners. In addition, pivots like Scyther, Rotom-H, and Decidueye match up well against the Grass- and Electric-types like Virizion and Bellibolt that threaten Milotic. On top of that, these pivots enjoy bringing in Milotic on their checks like Mudsdale, Gastrodon, and Coalossal. Thanks to Milotic's ability to switch in to Water- and Fire-type attacks from Paldean Tauros-W and Arcanine, it can support Pokemon like Delphox, Golurk, and Rotom-C greatly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Regirock": {"sets": {"Stealth Rock": {}}},
  "Staraptor": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Staraptor is one of PU's strongest and most consistent revenge killers and cleaners thanks to its Reckless-boosted STAB attacks and high Speed , which allows it to outspeed other Choice Scarf Pokemon like Flamigo and Florges. U-turn allows Staraptor to pivot out of bad matchups like Bronzong and Houndstone, as well as being good to revenge kill Pokemon like Decidueye and Scrafty while still keeping momentum for the team. Close Combat is extremely important coverage, allowing Staraptor to hit Steel- and Rock-types that would otherwise completely wall it like Alolan Sandslash, Duraludon, and Coalossal. Tera Normal removes Staraptor's Stealth Rock weakness, gives it a better matchup against Pokemon like Bellibolt, Pawmot, and Rotom-H, and allows Staraptor to 2HKO Bellibolt and Galarian Slowbro. Tera Normal also keeps its Ghost immunity. Tera Flying boosts Staraptor's more reliable STAB move in Brave Bird while still 2HKOing Galarian Slowbro and keeping its Ground immunity.</p> <p>Staraptor fits primarily on balance and offense teams looking for a reliable revenge killer that can also operate as a pivot if need be. Staraptor can struggle to break through physical walls such as Milotic, Bellibolt, and Bronzong; checks to these threats like Golurk and Skuntank make excellent partners. Other pivots like Bellibolt, Gligar, and Rotom-H can pair with Staraptor to make a powerful VoltTurn core. Staraptor requires entry hazard control to operate as a revenge killer, so Rapid Spin support from Tatsugiri and Alolan Sandslash and Defog from Scyther are extremely appreciated. Staraptor's main problems arise from its frailty and ability to be easily taken advantage of by Ghost-types like Houndstone and Golurk as well as priority from Zoroark, Arcanine, and especially Skuntank due to Sucker Punch and Aftermath. Pairing it with both special walls like Assault Vest Galarian Slowbro and Bronzong and physical walls like Coalossal and Wo-Chien that Staraptor can fall back on is very important to have</p>"
      },
      "Choice Band": {
        "description": "<p>In terms of sheer power, few Pokemon outclass Choice Band Staraptor's STAB options; however, its weakness to Stealth Rock and its constant recoil often limit it to making trades or forcing damage on Pokemon like Bellibolt, Regirock, and Bronzong. Brave Bird and Double-Edge are boosted by Reckless, letting Staraptor 2HKO Pokemon like Galarian Slowbro and Gligar. U-turn lets it pivot out of poor matchups like Houndstone and gives it more flexibility, while Close Combat is used for the Rock- and Steel-types that resist its STAB moves like Coalossal and Alolan Sandslash. Quick Attack is also useful for picking off faster foes like Inteleon and Choice Scarf Flamigo as well as slower priority users like Skuntank and Toxicroak. Tera Flying is recommended because even though both of Staraptor's STAB moves have the same base power, Tera Flying Brave Bird is more spammable than Tera Normal Double-Edge; however, Staraptor can be Tera Normal if the team it's on would prefer a stronger Normal-type STAB attack. A Jolly nature lets it outspeed targets like Galarian Articuno and non-Choice Scarf Meloetta as well as speed tie with most other Staraptor and Paldean Tauros-W in a pinch.</p> <p>Staraptor's weakness to Stealth Rock requires entry hazard removal for it to be at its max effectiveness, so Pokemon like Decidueye and Coalossal are recommended to support it. They also have the benefit of switching into common revenge killers like Virizion, Salazzle, and Ambipom, while Decidueye specifically can bring in Staraptor with a slow U-turn. Other pivots like Bellibolt and Inteleon can bring Staraptor in on their switch-ins like Wo-Chien and Gastrodon; in return, Staraptor can pivot on Pokemon like Regirock and Arcanine for them, making a strong VoltTurn core. Choice Specs Zoroark is also a notable partner, as many of Staraptor's switch-ins like Bronzong cannot take a Dark Pulse and many of Choice Specs Zoroark's switch-ins like Hariyama fall to a Brave Bird, so both can pivot to the other to create further mindgames. However, any form of entry hazards reveal the ruse quickly. Late-game cleaners like Arcanine and Paldean Tauros-W also appreciate Staraptor wearing down shared checks like Coalossal and Houndstone.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 414072, "username": "Hera"}, {"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 527276, "username": "Techno"}]}]}
  },
  "Floatzel": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Gastrodon": {
    "sets": {
      "Special Wall": {
        "description": "<p>Gastrodon's great typing, ability, and utility movepool allow it to fit on many teamstyles from stall to balance, checking threats like Inteleon and Rotom-H. Ice Beam in tandem with Earth Power provodes near-unresisted coverage with only Rotom-H and Levitate Bronzong able to switch into this combination of moves, and it also hits common switch-ins to Earth Power like Rotom-C, Decidueye, and Staraptor super effectively. Clear Smog, however, works best on bulkier teams, as it both stops Gastrodon from being setup fodder and lets it check setup sweepers that these teams struggle with such as Bulk Up Scrafty, Calm Mind Florges, and Curse Arcanine. Surf targets Rotom-H, which Gastrodon walls but has issues with taking out, gives it a useful secondary STAB move and hits Flying-types neutrally. Gastrodon usually runs Stealth Rock is usually ran, but if a team already has a Stealth Rock user like Bronzong, Bombirdier, or Coalossal, Spikes could be used instead so it can help out its team entry hazard-wise no matter what. Leftovers prevents Gastrodon from having to heal as often, while Heavy-Duty Boots alleviates pressure from entry hazards during switches. Storm Drain allows Gastrodon to wall Water-type wallbreakers like Inteleon and also stop Qwilfish from pivoting with Flip Turn. Sticky Hold can be used on more defensive teams that require a Knock Off switch-in. Tera Poison helps Gastrodon check Fighting-types like Paldean Tauros-W, Hariyama, and Heracross while also turning its 4x weakness to Grass-type attacks into a resistance, letting it take hits from Rotom-C and Decidueye in a pinch. On top of this, it becomes immune to Toxic from Salazzle. Tera Fairy also helps Gastrodon versus the aforementioned Fighting-types, gifting it a more well-rounded defensive typing that allows it to check Scrafty, Zoroark, and Scyther better. Alternatively, a physically defensive EV spread can be used to better handle threats like Paldean Tauros-W, Skuntank, and Pawmot.</p> <p>While Gastrodon is a strong specially defensive wall, its Defense is lacking. In order to patch up this issue, Gastrodon pairs well with Bellibolt, Galarian Slowbro, and Altaria, as they can handle Staraptor, Flamigo, Paldean Tauros-W, and Hariyama more reliably. Gastrodon consistently checks Fire-, Poison-, and Steel-type Pokemon like Rotom-H, Skuntank, and Duraludon, so Pokemon that can benefit from this like Rotom-C, Flamigo, and Choice Specs Florges make for great teammates. Grass-types like Hisuian Electrode, Decidueye, and Rotom-C easily threaten Gastrodon; therefore, it should have partners like Arcanine, Paldean Tauros-F, and Rotom-H that can scare out these foes. In turn, Gastrodon handles threatening Water-types like Inteleon and Kingdra amazingly. With entry hazard support from Gastrodon, wallbreakers like Toxtricity, Zoroark, and Emboar break through their checks like Bronzong, Wo-Chien, and Milotic more effectively. Gastrodon also tends to drain momentum, so to circumvent this, partners like Rotom-H, Scyther, and Flamigo can check common switch-ins to Gastrodon like Rotom-C and Wo-Chien and also pivot to regain momentum.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ambipom": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Ambipom is a capable offensive pivot that can create momentum as an anti-offense lead, or it can revenge kill foes and clean up late-game with its Technician-boosted Fake Out and impressive Speed tier. Opposing sweepers, other revenge killers, and fast pivots such as Shift Gear Toxtricity, Choice Scarf Staraptor, and Kilowattrel, whose Speed tiers make them otherwise hard to deal with, can be picked off or forced out by using Fake Out. U-turn allows Ambipom to escape after dealing Fake Out chip or maintain pressure on an anticipated switch. Knock Off serves as coverage for Ghost-types such as Decidueye and Golurk while also making progress by removing key items like Heavy-Duty Boots from users such as Bombirdier and Eviolite from foes such as Hisuian Qwilfish. Triple Axel provides Technician-boosted coverage for potential switch-ins, being most effective against Gligar and Altaria. Alternatively, Double-Edge provides a more accurate and STAB-boosted option that has a chance to OHKO frailer offensive Pokemon—Tatsugiri and Salazzle being two examples. Double Hit is another STAB-boosted option that trades accuracy and some power for longevity, especially when paired with Protective Pads. Because of its frequent pivoting, Ambipom often uses Heavy-Duty Boots for greater longevity throughout games, avoiding chip damage from entry hazards. Protective Pads guards Ambipom from contact effects like Flame Body burns and Rocky Helmet chip damage, which are most inhibiting to sets with Triple Axel and Double Hit. Silk Scarf and Tera Normal achieve a similar effect for Ambipom, improving key Fake Out rolls in a pinch by consistently 2HKOing Inteleon and Salazzle, whose high Speed can mandate trading Pokemon for Fake Out hits. Tera Normal or Silk Scarf Double-Edge and Double Hit also have respectable damage outputs, OHKOing Tatsugiri and Zoroark. When used together, Ambipom gains legitimate wallbreaking potential: Tera Normal Silk Scarf Double-Edge has a favorable roll to 2HKO Galarian Slowbro and Bellibolt, the two best physical walls in the tier.</p> <p>Ambipom is well suited for bulky or fast offense and balance teams susceptible to fast threats and opposing setup. Sweepers such as Dragon Dance Scrafty and Calm Mind Scream Tail that have fewer chances to set up may be picked off by speed control or trade damage with bulkier Pokemon like Goodra and Meloetta. Thus, Ambipom's ability to apply pressure after they faint and prevent counter sweeps is a helpful addition. Entry hazard users like Gastrodon and Gligar also synergize with Ambipom, taking advantage of Knock Off removing Heavy-Duty Boots to wear down susceptible foes—removal options like Alolan Sandslash and Defog Scyther rely on Heavy-Duty Boots to switch in several times. Hazards also allow Ambipom to wear down teams by repeated switching and enable Silk Scarf sets to break through chipped switch-ins like Assault Vest Galarian Slowbro, which it 2HKOes with Stealth Rock up. Unfortunately, without Protective Pads, Ambipom is very susceptible to contact abilities like Static and Flame Body, and it struggles to break common physical walls like Bellibolt and defensive Galarian Slowbro that it cannot consistently 2HKO after Terastallizing without Silk Scarf. As such, it benefits from wallbreakers such as Toxtricity and Golurk that clear through these checks. Ambipom also appreciates bulky teammates with recovery such as Milotic and Florges, allowing a safe switch in after using U-turn. Finally, variants of Ambipom not using Heavy-Duty Boots are easily worn down by opposing hazards and appreciate removal from teammates like Coalossal and Altaria, which in turn appreciate Ambipon providing more opportunities for them to be brought in on favorable matchups and remove hazards or make progress with other utility moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641532, "username": "bleahey"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 414072, "username": "Hera"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Mismagius": {"sets": {"Nasty Plot": {}, "Choice": {}}},
  "Skuntank": {
    "sets": {
      "Utility": {
        "description": "<p>Skuntank's unique typing, ability in Aftermath, and movepool tailored for both stallbreaking and revenge killing establish it as a solid glue Pokemon in the metagame for a variety of team structures. Its typing allows it to check a variety of threats, such as Galarian Slowbro and Decidueye, which creates reliable opportunities to debuff walls like Mudsdale, Gligar, and Bellibolt on the switch, as not much in the metagame can resist its STAB combination of Gunk Shot and Knock Off. Sucker Punch is able to pick off weakened offensive threats such as Delphox, Inteleon, and Toxtricity as well as Choice Scarf users like Staraptor and Rotom-C. Taunt is useful to stop the likes of Bellibolt and Milotic from healing freely and also inhibits setup sweepers such as Scrafty. Toxic can be used instead to cripple and wear down switch-ins like Mudsdale and Gastrodon. Rocky Helmet is useful to punish opposing Knock Off users like Scrafty, Bombirdier, and other Skuntank, as Skuntank is often the designated Knock Off absorber for many teams. Rocky Helmet also synergizes well with Aftermath to allow Skuntank to trade with contact-attacking threats like Arcanine and Paldean-Tauros W as needed. The boost from Black Glasses works exceptionally well with an Adamant nature and Tera Dark, as Skuntank can break through walls like Gastrodon and Altaria with these boosts stacked while also notably giving Adamant variants a guaranteed chance to OHKO Delphox from full with Sucker Punch. Some teams may opt for Heavy-Duty Boots, as it can be used to more reliably handle Decidueye for teams that need that support, avoiding the 3HKO from Spirit Shackle after Stealth Rock chip damage. A Jolly nature is useful to outspeed the likes of Goodra, Tatsugiri, and Jolly Bombirdier, while an Adamant nature can be used for additional power, for example, guaranteeing an OHKO against Golurk with Knock Off even without Black Glasses. Tera Ghost can be used over Tera Dark for its defensive merits versus certain Hyper Offensive sweepers; for example, Skuntank becomes immune to Boomburst from Toxtricity and Scream Tail as well as Curse Arcanine's Extreme Speed in a pinch and can then fire back with Gunk Shot or Knock Off.</p> <p>Skuntank functions well on entry hazard-stacking archetypes thanks to its ability to lure in and remove Heavy-Duty Boots from the likes of Bellibolt, Arcanine, and Milotic. Spikes setters such as Gastrodon and Coalossal are able to wear down offensive threats like Inteleon and Salazzle into range of Skuntank's Sucker Punch as well. Additionally, Skuntank is a valuable asset for hyper offense teams, providing role compression by being able to defensively check problematic threats like Decidueye while also supporting setup sweepers such as Calm Mind Scream Tail, Curse Arcanine, and Bulk Up Paldean Tauros-W by wearing down shared checks such as Coalossal, Mudsdale, and Milotic with Toxic and Knock Off support. These offensive threats also appreciate Skuntank's ability to pivot into one of their best answers, Galarian Slowbro, fairly reliably. Decidueye is another great partner with solid synergy, appreciating Skuntank's ability to take on checks like Scrafty and Wo-Chien and even wear down opposing Skuntank while Decidueye directly takes on Mudsdale, Gastrodon, and Paldean Tauros-W. Offensive Water-types such as Inteleon and Paldean Tauros-W appreciate Skuntank's ability to pressure Grass-types like Wo-Chien and Decidueye, while in return, they can switch into Ground-types like Mudsdale and Gligar immediately after Skuntank has crippled them with Knock Off. Skuntank's ability to offensively check the likes of Delphox, Decidueye, and Staraptor can also be beneficial for defensive pieces such as Wo-Chien and Bellibolt to not become overwhelmed, which can allow them to return the favor by better handling threats to Skuntank such as Mudsdale and Flamigo, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 435539, "username": "BloodAce"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Bronzong": {"sets": {"Utility": {"description": "<p>Trick should only be used in tandem with Toxic Orb to punish foes like Wo-Chien on the switch. Heatproof is better if Bronzong's team is particularly weak to Delphox and Salazzle.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Bulky Setup Sweeper": {}}},
  "Toxicroak": {"sets": {"Nasty Plot": {}, "Swords Dance": {}, "Choice": {}}},
  "Froslass": {"sets": {"Spikes Lead": {}, "Utility": {}, "Choice Band": {}}},
  "Rotom-Heat": {"sets": {"Nasty Plot": {}}},
  "Rotom-Mow": {"sets": {"Choice Scarf": {}, "Utility": {}}},
  "Uxie": {"sets": {"Utility": {}, "Terrain Sweeper": {}}},
  "Mesprit": {"sets": {"Setup Sweeper": {"description": "<p>Substitute allows for easier setup against passive foes like Sandaconda. Thunderbolt offers strong neutral coverage and stops Steel-types like Registeel and Alolan Sandslash from walling Mesprit. Shadow Ball is weaker than Thunderbolt but hits Bronzong super effectively. Mesprit should only use Grassy Seed if it's being paired with Thwackey.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Scarf": {}, "Choice Specs": {}, "Utility": {}}},
  "Emboar": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Despite facing tight competition from other Fighting-types like Flamigo, Scrafty, and the Paldean Tauros formes, which are faster, more useful defensively, or both, Emboar is still a solid wallbreaker. Emboar's sheer strength, coverage, and access to Reckless-boosted STAB Flare Blitz let it easily cleave through physical walls like Galarian Slowbro and Bellibolt without requiring Choice Band or setup, making it hard for balance to pivot around. Sucker Punch makes up for Emboar's low Speed, picking off weakened foes such as Delphox and Inteleon; be mindful of Encore when trying to revenge kill the former, though. Knock Off punishes walls like Gligar and Altaria that are reliant on their items and can otherwise annoy Emboar, while Earthquake provides coverage for Bellibolt, Skuntank, and Qwilfish that doesn't trigger Static, Aftermath, and Rocky Helmet. Emboar can run additional Reckless-boosted coverage in Head Smash and Wild Charge to destroy Altaria and Tera Water Gligar, respectively, but these moves aren't particularly useful against most teams. These moves also wear Emboar down even faster, especially Head Smash, which limits its offensive capabilities. Even though a Jolly nature lets Emboar outspeed neutral-natured threats like Decidueye and Toxtricity, an Adamant nature allows it to potentially 2HKO Galarian Slowbro, Milotic, and physically defensive Gastrodon from full HP with the appropriate STAB move. Heavy-Duty Boots is preferred for increasing Emboar's longevity and giving it more flexibility in its approach to wallbreaking, but Choice Band can be used if Emboar wishes to go all in on decimating the opposition, letting Flare Blitz 2HKO even Mudsdale and Palossand.</p> <p>Emboar can't afford to switch directly into most Pokemon, since it's quite slow and already on a timer due to Flare Blitz's recoil; as such, it benefits a lot from being paired with pivots. Scyther, Rotom-C, and Meloetta are some offensive Pokemon that fulfill this role, baiting in walls like Coalossal and Wo-Chien for Emboar to clobber while picking up the slack for it against faster teams. Rotom-C is also notable for checking Water- and Ground-types like Milotic, Mudsdale, and Gastrodon. Slower pivots like Bellibolt, Gligar, and Milotic also generate momentum for Emboar while using their bulk and typing to stave off revenge killers like Paldean Tauros-W and Skuntank. Bellibolt can also potentially slow down faster physical attackers with Static, giving Emboar even more opportunities to fire off its strong attacks. Other paralysis spreaders like Duraludon and Dudunsparce can supply additional speed control, effectively nullifying Emboar's main flaw. Psychic- and Fairy-type sweepers such as Galarian Slowbro and Florges benefit from the immense pressure Emboar puts on Dark- and Steel-types. In return, these Pokemon offer Emboar safety from faster foes like Flamigo and Kilowattrel and can use moves like Toxic and Psychic Noise to quickly wear down nuisances like Mudsdale and Scream Tail. In addition, physical setup sweepers like Scrafty, Zoroark, and Scyther have an easier time finishing teams off with Emboar ripping through walls like Florges, Coalossal, and Houndstone early-game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Emboar makes use of Choice Scarf to counteract its middling Speed stat, becoming a terrifying revenge killer. Its main advantages over other revenge killers are its surprise factor and, more importantly, its incredible attacking power compounded by Reckless, with Reckless-boosted Flare Blitz making light work of threats like Scyther and Florges as well as breaking past common walls such as Wo-Chien and Bronzong. Knock Off complements Emboar's dual STAB moves well; it can slice through the likes of Delphox and Golurk with no drawbacks, as well as remove items from the likes of Gligar and Galarian Slowbro switching into it. Knock Off is usually the safest move to lock into due to its complete lack of drawbacks and its guarantee of progress with item removal. Earthquake is a useful mid-ground that can hit Fire-resistant Pokemon like Delphox and Arcanine and Fighting-resistant Pokemon like Toxtricity and Galarian Slowbro in the same slot while additionally avoiding negative contact effects like Bellibolt's Static, Skuntank's Aftermath, and chip damage from the various Rocky Helmet users in the tier. Head Smash is a risky coverage option that allows Emboar to hit Altaria super effectively while cleanly OHKOing Hisuian Braviary and making light work of Arcanine. Additionally, it retains some of the benefits of Earthquake by hitting Fire-types super effectively, and, as it's a Rock-type move, it has no immunities, unlike Earthquake. Head Smash is still a risky option because the recoil damage is a huge drawback, and its accuracy is poor. Wild Charge is another midground option that lets Emboar hit Water-types like Inteleon and Milotic and, like Head Smash, is boosted by Reckless. Tera Dark sharpens Knock Off into a strong STAB attack that can cleanly OHKO Delphox and 2HKO physically defensive Galarian Slowbro. Additionally, Tera Dark gives Emboar a relevant Psychic immunity in the face of Choice Scarf Meloetta and Galarian Articuno. Tera Fighting and Tera Fire can be used to bolster the already great power of Emboar's STAB attacks, letting it 2HKO Milotic and Arcanine with Tera Fighting Close Combat and 2HKO physically defensive Bellibolt and Gligar with Tera Fire Flare Blitz. Emboar's Choice Scarf-boosted Speed allows it to outrun even base 120 Speed Pokemon like Inteleon and Minior; however, Kilowattrel and various faster Choice Scarf users still outspeed and threaten Emboar.</p> <p>Emboar fits well on balance teams, where it can act as a physical attacker and revenge killer, taking the pressure off of potential defensive teammates like Florges and Duraludon in the face of threats like Delphox, Heracross, and Salazzle. In order to get the most out of Emboar, it should be paired with pivoting support, bringing it in without it taking unnecessary chip damage against offensive threats like Inteleon and Delphox. Good examples of partners that can provide this are Kilowattrel, Gligar, and Bellibolt. Florges appreciates Emboar's ability to threaten Steel-types like Bronzong and Alolan Sandslash. In return, it can either pass Wish, which is incredibly helpful due to Emboar's tendency to be worn down quickly, or clean up games with Calm Mind after Emboar has broken a hole in the opposing team. Healing Wish support from the likes of Mesprit is useful to not only give Emboar a second wind after it's chipped down by recoil and attacks but also clear potential status like paralysis to allow it to clean. Other physical attackers like Decidueye and Golurk can beat Milotic and Galarian Slowbro, respectively, additionally working with Emboar to take chunks out of Bellibolt. Entry hazard removal is important because Emboar already has enough issues being worn down by its own attacks; spinners like Alolan Sandslash and Hitmontop and Defoggers like Altaria and Scyther can fill this role. Kilowattrel is a good naturally fast speed control option to help round out Emboar's team and prevents over-reliance on Emboar to force out opposing threats. Choice Scarf Emboar should be used over its Heavy-Duty Boots and Choice Band variants on slower teams that rely on Emboar to outspeed and force out threats for them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 569291, "username": "zinnias"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Whimsicott": {"sets": {"Choice Specs": {"description": "<p>Shadow Ball threatens Delphox and Bronzong and hits Alolan Sandslash slightly harder than Moonblast. Pranskter should only be used alongside Switcheroo, since this makes the move better at disrupting teams.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Scrafty": {"sets": {"Bulky Dragon Dance": {"description": "<p>212 Speed EVs let +1 Scrafty outspeed Flamigo. This is particularly important against Choice Scarf Flamigo, which will likely switch into Scrafty’s Knock Off. An EV spread of 252 Atk / 4 Def / 252 Spe with a Jolly nature can be used to make Scrafty more immediately threatening at the cost of bulk and longevity.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Bulk Up": {}}},
  "Zoroark": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Zoroark is a powerful wallbreaker that, unlike others, can surprise opponents thanks to Illusion and net KOs, paving the way for partners like Galarian Slowbro and Paldean Tauros-F. Sludge Bomb hits incoming Fairy-types that plan on taking a Dark Pulse like Scream Tail and Grimmsnarl. Trick allows Zoroark to maintain utility, as it can then cripple bulkier Pokemon like Wo-Chien and Florges and bulky setup sweepers like Scrafty and Arcanine. Focus Blast punishes Dark-types that try to take on Zoroark's Dark Pulse like Skuntank and Bombirdier. U-turn can also be run to give extra utility to Zoroark, allowing it to gain momentum. Tera Dark is preferred to boost Zoroark's wallbreaking capabilities to insane levels, allowing it to 2HKO Gastrodon after a layer of Spikes and non-Assault Vest Goodra, but Tera Poison gifts Zoroark a boost to its Sludge Bomb and a resistance to Fighting-type attacks, letting it survive a hit from Heracross and Paldean Tauros-F. However, Tera Fighting can also be used to boost Focus Blast's damage output, preventing Pokemon like Skuntank and Wo-Chien from taking on Zoroark as well as they could otherwise. Though, with the latter two Tera types, Zoroark's Psychic-type immunity turns into a weakness, worsening its matchup against Delphox, Meloetta, and Galarian Articuno.</p> <p>Zoroark's access to Illusion allows it to pair well with Paldean Tauros-W, Inteleon, and Calm Mind Florges, as it can disguise as them to lure in and beats Pokemon such as Decidueye, Bronzong, and Assault Vest Galarian Slowbro, which tend to switch in to check them. Some of Zoroark's checks, namely Milotic and Assault Vest Hariyama, are open to getting chipped away at by entry hazards, so Spikes setters like Gastrodon, Alolan Sandslash, and Heracross pair well alongside it. When paired with physical wallbreakers like Emboar and Hariyama, Zoroark can have its specially defensive checks like Scrafty and Gastrodon overpowered while together they can chip away at shared checks like Milotic and Scream Tail. Fairy- and Fighting-types like Grimmsnarl and Flamigo force Zoroark out, so checks to these Pokemon like Salazzle and Bellibolt make for strong teammates. In return, Zoroark can chip away at bulky Water- and Ground-types they struggle against, such as Qwilfish and Gligar. While Zoroark can play mind games with Illusion, how healthy a Pokemon is can easily give away who's out on the battlefield, so it must be paired with teammates that have access to entry hazard removal like Altaria, Alolan Sandslash, and Tatsugiri.</p>"
      },
      "Choice Scarf": {},
      "Nasty Plot": {},
      "Swords Dance": {
        "description": "<p>Zoroark stands out as a very strong Swords Dance user, leveraging the lack of defensive Dark-resistant Pokemon; the various Dark-weak staples like Galarian Slowbro, Delphox, and Golurk; and Illusion allowing it to disguise itself as other Swords Dance users to give it setup opportunities and tear holes in the opposing team. Knock Off and Sucker Punch are great STAB options that give Zoroark a devastating mix of wallbreaking power and priority, with Sucker Punch allowing it to pick off weakened Choice Scarf users like Staraptor and Rotom-C. Aerial Ace allows Zoroark to hit Fighting-types like Heracross and Emboar that would survive a +2 Knock Off as well as weakening all Paldean Tauros formes, while Low Kick removes Coalossal, Regirock, and Duraladon consistently; both of these options let it remove or severely weaken Scrafty and Wo-Chien. A Life Orb in conjunction with Tera Dark gives Zoroark outstanding power at +2; it gains great odds to OHKO physically defensive bulwarks like Bellibolt and Mudsdale after a single layer of Spikes, as well as always OHKOing Milotic, Altaria, and specially defensive Alolan Sandslash. Heavy-Duty Boots forgoes the power on Life Orb in favor of more bluffing potential and less chip damage, getting more setup opportunities as a result. Black Glasses can be used to hit similar damage benchmarks compared to Life Orb without taking recoil; however, it misses out on the guaranteed OHKOs stated above and has worse odds to OHKO Bellibolt and Mudsdale under the same circumstances.</p> <p>Swords Dance Zoroark is an effective wallbreaker but struggles with faster Pokemon that resist Sucker Punch and slower priority users that resist Sucker Punch, like Skuntank, Paldean Tauros-W, and Choice Scarf users like Flamigo, so checks to these Pokemon are highly recommended. Bellibolt and Houndstone are solid switch-ins on bulkier playstyles, while Paldean Tauros-F and Decidueye can use Skuntank and Paldean Tauros-W, respectively, as setup fodder or can easily revenge kill them with priority after Zoroark has weakened them. Zoroark heavily appreciates partners that it can disguise itself as effectively; some notable ones include Bruxish, Scyther, and Delphox, since Zoroark disguised as them can take advantage of their switch-ins like Milotic and Meloetta. Bruxish and Scyther's access to Swords Dance as well as Scyther's and Delphox's Speed tiers make it hard to tell if it's Zoroark or not.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 414072, "username": "Hera"}, {"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}, {"user_id": 414072, "username": "Hera"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Golurk": {
    "sets": {
      "Choice Band": {
        "description": "<p>Golurk is a potent wallbreaker with limited switch-ins thanks to its incredible STAB combination, which is resisted by only a few Pokemon in the tier. Golurk excels at dismantling common defensive cores thanks to its high Attack and great typing, which let it switch into and force out defensive staples like Galarian Slowbro and Bellibolt. Dynamic Punch lets Golurk 2HKO Wo-Chien while also hitting other Dark- and Normal-types like Scrafty and Snorlax and threatening confusion against everything else. Close Combat can be used as an alternative due to its higher Base Power, which lets it guarantee a 2HKO on Wo-Chien after Leech Seed recovery; however, Golurk misses out on the confusion, and the Defense and Special Defense drops make it more susceptible to being revenge killed. Ice Punch lets Golurk OHKO Bombirdier and Staraptor while also serving as a good middle ground into Gligar. Stone Edge can be used as an alternative that's stronger versus neutral targets and has a higher chance to land a critical hit; although, Golurk loses out on the ability to deal with Gligar. Tera Dark flips Golurk's Ghost and Dark weaknesses while also removing its Water and Ice weaknesses, allowing it to avoid revenge kill attempts from Pokemon like Skuntank, Bombirdier, and opposing Golurk. Tera Ghost can be used instead to further boost Golurk's power, letting it 2HKO Pokemon like Gligar and guaranteeing OHKOs against Pokemon like Rotom-H with Poltergeist while still removing its susceptibility to Water- and Ice-type moves to avoid revenge killing attempts from Pokemon like Paldean Tauros-W.</p> <p>Golurk works best alongside Pokemon that benefit from its wallbreaking abilities such as Choice Scarf Staraptor and Curse Arcanine, which struggle with Bellibolt and Gastrodon, respectively. While Golurk has the coverage to hit the likes of Staraptor, Bombirdier, and Wo-Chien, their presence on the opposing team hurts its ability to freely use its STAB moves and forces it to make more predictions, so teammates that can handle these Pokemon like Bellibolt, which checks Staraptor and Bombirdier, and Paldean Tauros-F, which helps against Wo-Chien, make excellent partners. Furthermore, Paldean Tauros-F offensively and defensively checks the Dark-types that threaten Golurk, and other Fighting-types like Paldean Tauros-W and Flamigo are similarly good partners for this purpose. Golurk is also forced out by Water- and Grass-types, so teammates that can switch into these Pokemon, like Milotic and Gastrodon for Inteleon and Tatsugiri as well as Skuntank for Decidueye, are incredible partners for Golurk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626934, "username": "Morge"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 414072, "username": "Hera"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "sapphiree"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Braviary-Hisui": {"sets": {"Agility": {}}},
  "Virizion": {"sets": {"Swords Dance": {"description": "<p>Stone Edge can be used instead of Zen Headbutt to nail Flying-types like Articuno and Charizard; it also hits foes like Decidueye and Vikavolt harder. However, without Zen Headbutt, Virizion is helpless against defensive Poison-types like Vileplume and Tera Poison users like Wo-Chien.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Calm Mind": {}}},
  "Meloetta": {"sets": {"Choice Specs": {}, "Choice Scarf": {}, "Assault Vest": {}}},
  "Delphox": {"sets": {"Nasty Plot": {}}},
  "Florges": {
    "sets": {
      "Wish": {},
      "Calm Mind": {
        "description": "<p>Florges finds itself used over other Calm Mind sweepers like Scream Tail and is one of PU's best bulky setup sweepers thanks to its great defensive typing, wide range of utility options, reliable recovery, and immunity to Dragon Tail. Florges has a wide variety of options for its third moveslot; Psychic Noise is coverage for Poison-types like Salazzle when Florges would want to avoid Terastallizing, and it also prevents Specially Defensive walls like Gastrodon and Wish Scream Tail from attempting to stall out Florges with their recovery. Tera Blast should be paired with Tera Ground, which allows Florges to break through Poison- and Fire-types like Galarian Slowbro, Coalossal, and Arcanine. Finally, Wish allows Florges to provide support for its team and gives it extra PP for recovery to pair with Synthesis; it is primarily used as a wall rather than a primary win condition, although it comes at the cost of not having coverage. The given EV spread allows Florges to obtain as much physical bulk as possible while also outspeeding Adamant Golurk as well as opposing walls such as Wo-Chien and Milotic. When not running Tera Blast, Tera Poison is ideal for a strong defensive typing, allowing Florges to set up against Pokemon like Galarian Slowbro and Bellibolt. Tera Ground should be paired with Tera Blast, (AC) and although it provides a worse defensive typing, it allows Florges to set up against Pokemon like Salazzle as well as Pokemon like Kilowattrel and Delphox.</p> <p>Florges is most commonly used on bulky balance teams looking for a secondary wincon that, when teamed with a primary wincon like Arcanine and Decidueye, can also function as a special wall or a Wish passer if need be. Even with investment, Florges's physical bulk is not good enough to set up against physical attackers like Paldean Tauros-F and Scyther, so physical walls like Bellibolt, Mudsdale, and Altaria make excellent partners. Likewise, in order for Florges to attempt a sweep without Tera Blast Ground, Fire- and Steel-types like Arcanine, Delphox, and Alolan Sandslash must be chipped or KOed, which can be achieved by Pokemon like Golurk, Inteleon, and Rotom-H. In return, Florges can soft check and threaten out their offensive checks like Zoroark and Goodra. Florges's ability to soft check and threaten Dark- and Fighting-types like Grimmsnarl, Zoroark, Scrafty, and Hariyama makes the likes of Galarian Slowbro, Galarian Articuno, and one's own Scrafty amazing partners. In return, these three can defensively or offensively check some of Florges's own checks like an opposing Galarian Slowbro and Bronzong. If Florges opts for Wish, the ability to pass Wish is extremely beneficial to offensive partners like Staraptor and Decidueye, which chip away at opposing walls like Milotic and Gastrodon that can phaze out Florges, allowing Florges to sweep; Wish is also beneficial for partner walls lacking reliable recovery like Mudsdale, Houndstone, and Gligar.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Clawitzer": {"outdated": true, "sets": {"Choice Specs": {"description": "<p>Aura Sphere 2HKOes Cryogonal and threatens common Tera Steel users like Poliwrath and Appletun. Dark Pulse hits Pokemon like Farigiraf, Veluza, and Trevenant harder than Clawitzer's other moves while also being decent neutral coverage. A Modest nature is generally preferred to maximize Clawitzer’s damage output, but a Timid nature can be used to outspeed threats like defensive Articuno. Tera Dragon further powers up Dragon Pulse and helps against Grass- and Electric-types like Arboliva and Rotom.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Goodra": {"sets": {"Heavy-Duty Boots": {}, "Choice Specs": {}}},
  "Avalugg-Hisui": {"sets": {"Entry Hazard Lead": {}, "Offensive": {}}},
  "Hoopa": {"sets": {"Choice": {}, "Substitute": {}}},
  "Decidueye": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Thanks to a great STAB combination that only a few Pokemon resist, a great boosting move in Swords Dance, a useful ability in Long Reach, and a good defensive typing, Decidueye is one of PU's strongest physical wallbreakers and sweepers. While Spirit Shackle is generally preferred for its increased accuracy, Poltergeist can be opted instead for its higher power, allowing Decidueye to OHKO Bellibolt with Tera Ghost after a Swords Dance, although its anti-synergy with Knock Off can make it unappealing. Shadow Sneak is useful priority to pick off faster weakened threats like Inteleon, Salazzle, and Delphox. Knock Off can be used to give Decidueye extra utility and punish common switch-ins like Staraptor and Wo-Chien, but it is very hard to justify using it over other moves, and it does not work well with Poltergeist. Spell Tag lets Decidueye OHKO Toxtricity with unboosted Poltergeist and Inteleon with +2 Shadow Sneak. Decidueye's choice of Tera type is flexible; Tera Ghost boosts the power of its Ghost-type STAB moves and gives Decidueye a better defensive typing, allowing it to spinblock Alolan Sandslash and set up on Pokemon like Delphox and Salazzle, while Tera Fairy allows Decidueye to take on Dark-type Pokemon like Zoroark and Scrafty.</p> <p>Decidueye excels on offensive or balance teams looking for a strong wallbreaker with sweeping and cleaning potential. Faster Normal-types like Staraptor, Meloetta, and Ambipom cannot be swept by Shadow Sneak and can threaten Decidueye in return, so checks to these Pokemon like Bellibolt and Gligar make good partners. Decidueye is also relatively frail, so slow pivots like Bellibolt, Gligar, and Milotic can help bring it in safely. Florges, Mudsdale, Paldean Tauros-W, and Skuntank can help switch into Decidueye's checks like opposing Skuntank, Bombirdier, Scrafty, and Galarian Articuno. Decidueye can struggle against offensive Fire-types like Arcanine and Paldean Tauros-F, so Pokemon like Mudsdale and Milotic make excellent partners. Decidueye's ability to beat common physical walls like Mudsdale, Galarian Slowbro, and Bellibolt make other physical sweepers like Arcanine, Ambipom, and Paldean Tauros-W valuable teammates. In turn, these three can take out Decidueye's offensive checks, like Staraptor and Zoroark, with priority to complement Decidueye's Shadow Sneak.</p>"
      },
      "All-Out Attacker": {}
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 414072, "username": "Hera"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "sapphiree"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Decidueye-Hisui": {"sets": {"Defensive Defog": {}, "Choice Band": {}}},
  "Lycanroc": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Entry Hazard Lead": {}}},
  "Mudsdale": {
    "sets": {
      "Physical Wall": {
        "description": "<p>With a great ability in Stamina and access to helpful utility moves such as Stealth Rock and Roar, Mudsdale cements itself as a helpful wall in PU that keeps physically offensive Pokemon like Paldean Tauros-F, Flamigo, Zoroark, Emboar, and Arcanine in check. Body Press lets Mudsdale put Stamina to good use, allowing it to get good damage off on Zoroark, Scrafty, and Tera Normal Arcanine. Heavy Slam, on the other hand, hits Flying-types neutrally while also letting Mudsdale hit Fairy-types that could otherwise easily set up in front of it like Scream Tail, Florges, and Grimmsnarl. However, Stone Edge hits Flying-types like Staraptor and Bombirdier super effectively while also threatening Rotom-H. Roar deters setup sweepers like Bulk Up Scrafty, Hariyama, and Calm Mind Galarian Slowbro before they get out of hand. Tera Water allows Mudsdale to take on Water-type wallbreakers like Paldean Tauros-W and Inteleon in a pinch, but it can no longer check Pawmot and Bellibolt as easily as before. On the other hand, Tera Steel grants Mudsdale the ability to check Fairy-types like Florges and Scream Tail, boosts Heavy Slam's damage output, and helps its matchup versus Galarian Articuno, Goodra, and Decidueye. However, this leaves Mudsdale open to being preyed on by Ground-, Fire-, and Fighting-types like Golurk, Arcanine, and Heracross, which it checked beforehand.</p> <p>When paired with a specially defensive Pokemon like Bronzong, Assault Vest Galarian Slowbro, or Milotic, Mudsdale can form a strong defensive core that's quite difficult to break through. Mudsdale easily checks Fire- and Fighting-types like Arcanine, Emboar, and Flamigo, so Pokemon weak to those types like Rotom-C, Duraludon, and Scrafty can take advantage of its defensive capabilities. Mudsdale tends to falter against Water- and Grass-types like Inteleon, Decidueye, and Rotom-C, making partners that can take on these threats like Milotic, Wo-Chien, and Goodra strong defensive options. With Mudsdale's lack of reliable recovery, it greatly appreciates Wish support from Pokemon like Scream Tail and Florges to circumvent this issue. Entry hazards also highlight Mudsdale's lack of reliable recovery, so partners like Defog Altaria, Decidueye, and Rapid Spin Alolan Sandslash help work around this weakness.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 414072, "username": "Hera"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 262594, "username": "Milak"}]}]}
  },
  "Salazzle": {
    "sets": {
      "Utility": {
        "description": "<p>With Salazzle's deep utility movepool, it can act as great support Pokemon that lacks passivity thanks to its high Speed and its nearly unresisted STAB combination's damage output. Fire Blast is preferred for pure damage, but Flamethrower can be used instead for higher accuracy. Toxic + Corrosion allow Salazzle to break through bulkier Pokemon in the tier that other Pokemon simply can't like Galarian Slowbro, Qwilfish, and Gastrodon. Encore helps Salazzle take advantage of Pokemon that would otherwise wall it like Milotic, Gastrodon, and Mudsdale; however, Knock Off can be used instead to cripple item-reliant Pokemon like Assault Vest Galarian Slowbro, Gligar, and Duraludon. Tera Grass allows Salazzle to check Inteleon, Paldean Tauros-W, and Golurk in a pinch. On the other hand, Tera Steel helps when facing Galarian Slowbro, Galarian Articuno, and Meloetta. Tera Ghost can also be used to ignore Fake Out and Extreme Speed from Ambipom and Arcanine, respectively, and in tandem with Encore, it can force them to continually do no damage to it, letting Salazzle attack freely.</p> <p>Salazzle easily handles Steel-types like Bronzong and Alolan Sandslash, so Pokemon that are checked by these walls work well alongside it like Florges, Galarian Articuno, and Grimmsnarl. If running Knock Off, Salazzle can help to chip away at opposing teams alongside entry hazard setters like Gligar, Gastrodon, and Alolan Sandslash. On top of this, Salazzle is also quite easily revenge killed by Choice Scarf users and naturally fast Pokemon like Staraptor, Flamigo, and Inteleon, so walls like Bellibolt and Gastrodon help it defensively.</p>"
      },
      "Nasty Plot": {}
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}]}]}
  },
  "Palossand": {"sets": {"Physically Defensive": {"description": "<p>Scorching Sands generally shouldn't be used alongside Sludge Bomb. Doing so makes Palossand more prediction reliant to avoid inducing foes like Wo-Chien with the less useful status.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Minior": {"sets": {"Shell Smash": {}}},
  "Bruxish": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Swords Dance": {}}},
  "Thwackey": {"outdated": true, "sets": {"Choice": {}}},
  "Inteleon": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Inteleon is a potent offensive threat and wallbreaker thanks to its phenomenal Special Attack, powerful STAB Hydro Pump, and incredible Speed tier, outpacing the vast majority of the metagame. Ice Beam grants Inteleon solid coverage to hit Water-resistant Pokemon such as Decidueye, Altaria, and Goodra. U-turn allows Inteleon to generate momentum, enabling it to take advantage of switch-ins like Gastrodon, Milotic, and Tatsugiri to safely bring in its teammates. Scald, while less powerful than Hydro Pump, is more consistent and can also potentially cripple switch-ins such as Paldean Tauros-W and Wo-Chein with a burn. Alternatively, Tera Blast Grass hits Water-type Pokemon such as Gastrodon, Milotic, and Paldean Tauros-W. Tera Water is the most common Tera type for Inteleon, allowing it to further power up its STAB Hydro Pump and Scald. Alternatively, Tera Grass grants Inteleon a decent defensive typing that lets it resist moves such as Earthquake from Golurk and Leaf Storm or Volt Switch from Rotom-C in a pinch.</p> <p>Inteleon pairs well with entry hazard setters, especially those that set Spikes, such as Gligar, Alolan Sandslash, Gastrodon, and Coalossal, as they can wear down its defensive answers. For example, one layer of Spikes guarantees a 2HKO against Assault Vest Galarian Slowbro with Hydro Pump. Alolan Sandslash and Coalossal also have the added benefit of Rapid Spin support to remove entry hazards set by foes, enabling Inteleon to come in more frequently to wallbreak and to stay out of the range of priority moves like Skuntank and Zoroark's Sucker Punch or Arcanine's Extreme Speed. Additionally, physically defensive Pokemon to check these priority users such as Bellibolt and Mudsdale can be useful partners, as Inteleon is quite frail. In particular, Dark-resistant Pokemon like Florges can handle Sucker Punch users such as Zoroark and Bombirdier. Inteleon can form pivot cores with other offensive pivots such as Flamigo, Kilowattrel, and Rotom-C to maintain pressure on teams. Inteleon has a poor defensive profile, so it also appreciates slow pivots such as Bellibolt and Decidueye, as they are able to bring it onto the field safely. Salazzle can offensively pressure some of Inteleon's checks like Wo-Chien and can lure in and cripple others with Toxic, such as Gastrodon and Milotic. In return, Inteleon is able to handle the likes of Coalossal and Naclstack for Salazzle.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 435539, "username": "BloodAce"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Coalossal": {"sets": {"Defensive": {}}},
  "Sandaconda": {"sets": {"Stealth Rock": {}}},
  "Cramorant": {"sets": {"Defog": {"description": "<p>Tera Ground lets Cramorant turn the tables on Electric-types like Eelektross and Rotom, block Volt Switch, and potentially tank coverage moves like Hisuian Sneasel's Gunk Shot in a pinch. Tera Fairy is another option to deal with Tera Dragon Clawitzer as well as check Dark-types like Spiritomb. EV spreads with more physical bulk are also valid to improve Cramorant's matchup against foes like Floatzel, Tera Fighting Passimian, and Poliwrath.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Toxtricity": {
    "sets": {
      "Shift Gear": {
        "description": "<p>Toxtricity offers the liberty to swap between the roles of a Shift Gear cleaner and Throat Spray + Boomburst wallbreaker with the same set. Very few walls can take its Punk Rock-boosted attacks after Throat Spray activates––Ghost / Ground-type Pokemon like Golurk and Palossand being the only exceptions––making the likes of Gastrodon, Coalossal, and Assault Vest Galarian Slowbro shoddy switch-ins at best. This threat creates setup opportunities for Toxtricity, which can then outspeed most of the metagame at +2 and clean late-game. Tera Blast Ghost is its best coverage move, nailing would-be checks like Decidueye, Golurk, Palossand, and Bronzong; importantly, the defensive benefits of Tera Ghost include more setup opportunities for Toxtricity and immunity to common priority attacks from Ambipom and Arcanine. Alternatively, Tera Normal offers a nuke of a Boomburst that outright OHKOes foes like Bellibolt and Mudsdale at +1. This comes at the cost of running the weaker Snarl to hit Ghost-types, and while Snarl offers good coverage without Terastallizing, it fails to reliably OHKO any of the metagame's Ghost-types and also makes Toxtricity completely walled by Soundproof Pokemon like Hisuian Electrode. A last alternative is Sludge Bomb, and in the same vein as Snarl, it can be a stronger option versus some walls like Wo-Chien without having to use Tera Normal Boomburst, but it fails to address some targets such as Golurk and Palossand.</p> <p>Sweepers such as Paldean Tauros-W and Decidueye alleviate some offensive tension that Toxtricity suffers from by targeting foes that could otherwise check it like Golurk, Goodra, and Gligar. Knock Off users like Skuntank and Scrafty help wear down walls like Mudsdale and Bellibolt so that they are KOed by a +1 Boomburst late-game. Specially offensive Knock Off users like Goodra and Salazzle also work for weakening special walls like Galarian Slowbro and Gastrodon; the former is in OHKO range from +1 Boomburst after Stealth Rock if it loses its Assault Vest. Toxtricity is often vulnerable to priority attackers after it takes damage when setting up, so teammates like Paldean Tauros-F and Staraptor are valid checks to the likes of Skuntank and Decidueye, respectively. This way, Toxtricity can be preserved and return the favor to these physically offensive teammates by putting pressure on physical walls like Mudsdale and Milotic.</p>"
      },
      "Choice Specs": {
        "description": "<p>The raw power of Choice Specs, Punk Rock-boosted Boomburst, and strong STAB moves, with the option to be even stronger with Terastallization, is hard to stomach. That power, along with the opportunity to pivot with Volt Switch on the few checks Toxtricity has like Decidueye, makes Toxtricity an effective wallbreaker and pivot. Ghost-types like Golurk and Palossand are not safe switch-ins to Toxtricity given that Snarl 2HKOes them, albeit locking into Snarl can be prediction reliant. Sludge Bomb offers chances to OHKO walls like Wo-Chien and Florges, although its damage is equal to Tera Normal Boomburst and its coverage fails to nail anything notable bar Soundproof Hisuian Electrode. Due to relying heavily on prediction and Terastallization, this set sees less use and is harder to fit on teams in comparison to Toxtricity's Shift Gear set.</p> <p>One of Toxtricity's shortcomings is its frailty, so it relies on pivots such as Scyther, Staraptor, and Ambipom to get in safely. These teammates make an offensive VoltTurn core with Toxtricity, which returns the favor by positioning them through Volt Switch on some of its potential switch-ins like Decidueye and Galarian Slowbro. Dark-types like Bombirdier and Skuntank are necessary to punish opposing Ghost-types once Toxtricity is locked into Boomburst. Similarly, teammates such as Decidueye and Kilowattrel are important to defeat Ground-types like Gligar and Gastrodon. Toxtricity's wallbreaking can pave the way for specially offensive teammates like Calm Mind Scream Tail and Choice Scarf Florges to clean late-game. Spikes support from Alolan Sandslash and Qwilfish is noteworthy in supporting Toxtricity's wallbreaking, as a single layer of Spikes creates favorable chances to OHKO walls like Gastrodon and Assault Vest Galarian Slowbro with +1 Tera Normal Boomburst.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Toxtricity-Low-Key": {"sets": {"Choice Specs": {"description": "<p>Toxtricity-Low-Key has no advantage over Base Toxtricity and also lacks Shift Gear, meaning it can't bluff its set and is incredibly predictable. As such, using Toxtricity-Low-Key isn't recommended.</p>"}}},
  "Grimmsnarl": {
    "sets": {
      "Bulk Up": {
        "description": "<p>Grimmsnarl is a threatening sweeper thanks to its ability to set up and use Substitute with priority because of Prankster. Thanks to its ability, Grimmsnarl can invest fully in its bulk, allowing it to take multiple hits before fainting. Grimmsnarl's STAB combination is also difficult to switch into, as it's unresisted by the entire tier. Sucker Punch helps Grimmsnarl pick off fast frail Pokemon like Inteleon, Kilowattrel, and Salazzle. Substitute allows it to take advantage of walls like Milotic, Gastrodon, and Bellibolt, letting it ignore status and set up freely. On top of this, it also helps Grimmsnarl scout Choice-locked Pokemon like Florges and Duraludon. Tera Steel grants it a resistance to Fairy-type attacks, as well as gaining a multitude of other resistances, notably helping Grimmsnarl versus Toxtricity's Boomburst, Staraptor's Brave Bird, and Bronzong's Heavy Slam. Similarly, Tera Poison helps Grimmsnarl take on Fairy-type attacks from Florges, but it trades Tera Steel's wide array of resistances for a resistance to common Fighting-type attacks from faster Pokemon like Heracross and Flamigo. However, it now has to deal with super effective Psychic Noise from both Scream Tail and Florges.</p> <p>Due to having to rely on Sucker Punch to hit Steel-types like Alolan Sandslash, Grimmsnarl commonly struggles against them; because of this, Grimmsnarl appreciates teammates that can pressure them like Salazzle, Delphox, and Golurk. Grimmsnarl's Substitute is easily broken by powerful wallbreakers like Inteleon and Staraptor, or it can be ignored by Toxtricity. So, Milotic, Bellibolt, and Bronzong make for great partners, being able to check these strong offensive threats. Grimmsnarl easily takes advantage of and sets up against special attacking walls like Gastrodon and Bellibolt. In order to get Grimmsnarl in against these Pokemon, it must be paired with teammates that force these walls in and can pivot like Inteleon and Flamigo. Grimmsnarl, due to being slow and having to rely on Sucker Punch to take care of faster threats, likes to have cleaners alongside it such as Choice Scarf users like Staraptor, Rotom-C, and Bruxish to finish up games after it's beaten the bulkier Pokemon. Grimmsnarl also struggles with sweeping early-game, so wallbreakers like Meloetta, Paldean Tauros-F, and Hariyama pair well to overwhelm shared checks such as Coalossal, Mudsdale, and Qwilfish. Scream Tail and Florges are both annoyances for Grimmsnarl, as they can both lock it into a move with Encore and Trick, respectively. In order to deal with these threats, partners like Skuntank, Salazzle, and Toxtricity work well in tandem with Grimmsnarl.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Alcremie": {"sets": {"Double Dance": {"description": "<p>If Alcremie is not being used on Grassy Terrain, it should hold Leftovers to maximize its recovery. 64 Speed EVs allow Alcremie to outspeed Sandaconda and Wo-Chien; this lets it attack before these foes can slow it down with Glare or either Leech Seed or Ruination, respectively.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Frosmoth": {"sets": {"Quiver Dance": {}}},
  "Copperajah": {"sets": {"Assault Vest": {"description": "<p>124 Speed EVs lets Copperajah outrun Bellibolt. Copperajah can use an EV spread of 252 Atk / 4 SpD / 252 Spe to maximize its offensive potential, though doing so seriously cuts into the bulk Assault Vest provides and often isn't necessary. Heavy Metal in tandem with moves like Heavy Slam and Heat Crash may seem appealing, but these options are generally unreliable, especially against common foes like Mudsdale.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Specially Defensive": {}}},
  "Duraludon": {"sets": {"Defensive": {}, "Choice": {}}},
  "Glastrier": {"sets": {"Swords Dance": {"description": "<p>Running more bulk investment is an option to make Glastrier harder to take down, which can be especially annoying for opponents if it opts for Substitute.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Calyrex": {"sets": {"Double Dance": {"description": "<p>Calyrex is not viable in PU, but this is considered its best set.</p> <p>The Speed investment lets +2 Calyrex outspeed Choice Scarf Alolan Dugtrio.</p>"}}},
  "Pawmot": {"sets": {"Offensive": {}}},
  "Naclstack": {"sets": {"Special Wall": {}}},
  "Bellibolt": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Bellibolt is a fantastic physically defensive wall and utility pivot thanks to its decent defensive typing, great abilities in Static and Electromorphosis, reliable recovery in Slack Off, and access to useful utility moves like Volt Switch and Toxic. Toxic prevents Pokemon such as Gastrodon and Golurk from coming in freely to take advantage of Bellibolt while also putting setup sweepers such as Decidueye and Florges on a timer. Volt Switch allows Bellibolt to be an effective slow pivot and generate momentum for its team. Muddy Water can be used to directly threaten Ground-types such as Golurk, Mudsdale, and Gligar while also hitting the likes of Coalossal and Rotom-H. Parabolic Charge can be used in lieu of Volt Switch or Muddy Water, dealing damage while also functioning as a source of recovery that reduces Bellibolt's reliance on Slack Off. It should, however, only be used with the Electromorphosis ability, as it is fairly weak and unreliable without the Charge boost. Soak, while a more niche and hard-to-fit option, has benefits such as nullifying foes' STAB attacks and notably allowing Bellibolt to turn the tables on Ground-types; it can also work well in tandem with Parabolic Charge and removes the immunity to Toxic from the likes of Alolan Sandslash, Bronzong, and Galarian Slowbro, which can be invaluable in making progress against them. However, Soak is extremely niche and very hard to fit over Volt Switch or Muddy Water. Bellibolt generally prefers utilizing Static over Electromorphosis to hinder contact attackers like Arcanine, Paldean Tauros-W, and Scyther with paralysis. However, Electromorphosis can boost Bellibolt's Electric-type STAB attacks after taking a hit and works especially well when combined with Parabolic Charge. Heavy-Duty Boots is Bellibolt's preferred item, which can be useful to increase longevity against entry hazard-stacking teams. Alternatively, Rocky Helmet synergizes with Static to further punish contact attackers such as Staraptor, Paldean Tauros-W, and Ambipom. Another option is Leftovers to grant Bellibolt residual healing, reducing its reliance on Slack Off at the cost of its ability to prevent hazard chip or wear down contact attackers as effectively. Tera Water removes Bellibolt's weakness to Ground-types, allows it to better take on attackers like Inteleon, Arcanine, and Bruxish, and also boosts the power of Muddy Water when targeting Ground-types.</p> <p>Bellibolt pairs well with frail offensive threats such as Inteleon, Flamigo, and Salazzle that appreciate its slow pivot support to get them onto the field safely. It can also form pivot cores with the aforementioned Inteleon and Flamigo as well as the likes of Scyther, which can handle Pokemon like Wo-Chien. Specially defensive walls such as Bronzong, Gastrodon, and Assault Vest Galarian Slowbro synergize well to handle the likes of Meloetta, Inteleon, and Toxtricity, respectively. Secondary physical walls such as Mudsdale, Milotic, and Galarian Slowbro can be useful to prevent Bellibolt from becoming overwhelmed by threats such as Skuntank, Paldean Tauros-W, and Flamigo. Mudsdale and Milotic can also help into setup sweepers like Scrafty and non-Taunt Grimmsnarl thanks to Roar and Haze, respectively. Powerful Ground-types such as Golurk can pressure Bellibolt, so switch-ins to these Ground-types such as Wo-Chien and Bombirdier are appreciated. Wo-Chien also helps into Nasty Plot Rotom-C and Swords Dance Decidueye. In return, Bellibolt is able to handle Pokemon like Scyther and Staraptor that it struggles with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 435539, "username": "BloodAce"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 414072, "username": "Hera"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Kilowattrel": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Kilowattrel is one of PU's best pivots and revenge killers able to revenge kill Pokemon like Paldean Tauros-W, Inteleon, and Scrafty thanks to a strong offensive typing in tandem with an amazing Speed stat, letting it outpace the entire unboosted metagame bar Hisuian Electrode, as well as its spammable STAB moves. U-turn allows Kilowattrel to pivot away from problematic matchups like Gastrodon, Coalossal, and Florges, and it is used over Volt Switch to reliably pivot away from Ground-types like Mudsdale and Gligar. Roost allows Kilowattrel to recover off damage against the switches it forces on Pokemon like Scrafty and Wo-Chien or against Pokemon it walls like Rotom-C and opposing Kilowattrel; Roost also lets it recover Toxic and Will-O-Wisp damage from Pokemon like Gligar and Altaria, respectively, although it removes Kilowattrel's Ground-type immunity, which can be unfavorable against Pokemon like Mudsdale. Kilowattrel's choice of ability is flexible; Competitive punishes Defog from Altaria and Scyther while also potentially allowing Kilowattrel to use Intimidate drops from Arcanine and Paldean Tauros-F to become a more threatening Special Attacker. Alternatively, Volt Absorb allows Kilowattrel to wall Pokemon like Hisuian Electrode, opposing Kilowattrel, and Pawmot lacking Ice Punch while also blocking Volt Switch from Pokemon like Bellibolt and Rotom-H. Kilowattrel's Tera Types are also flexible; both Tera Electric and Tera Flying boost Kilowattrel's STAB moves, allowing Kilowattrel to achieve rolls such as the OHKO on Zoroark and Galarian Articuno with Tera Electric Thunderbolt as well as the 2HKO and OHKO on Altaria and Wo-Chien, respectively, with Tera Flying Hurricane after Stealth Rock. Tera Ghost is an alternative option that can block Extreme Speed from Arcanine and Quick Attack from Scyther and let it function as an emergency spinblocker, it should also be run with Volt Absorb to pivot around Toxtricity if needed.</p> <p>Kilowattrel finds itself succeeding on offensive teams looking for a solid pivot that also operates as great speed control and a decent special attacker. Kilowattrel's ability to use U-turn relatively safely makes it an excellent partner for wallbreakers that can struggle to get themselves onto the battlefield like Golurk, Paldean Tauros-W, and Goodra. Kilowattrel can struggle against Ground-types like Gastrodon and Mudsdale as well as bulky special walls like Bronzong and Florges; therefore, checks to these threats like Inteleon, Decidueye, and Grass Knot Delphox all make excellent partners. . Kilowattrel's ability to revenge kill other faster attackers like Inteleon and Salazzle allows for Pokemon checked by these threats like Delphox and Decidueye to be good teammates. Decidueye in particular makes an excellent partner, as it can deal with all of the aforementioned walls especially well; in turn, Kilowattrel can chip away at Pokemon like Skuntank, Bombirdier, and Wo-Chien for Decidueye. Other pivots like Scyther, Gligar, and Ambipom can create a powerful VoltTurn core, pivoting often on balance staples like Galarian Slowbro, Bellibolt, and Mudsdale.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Grafaiai": {"sets": {"Utility": {}, "Terrain Sweeper": {"description": "<p>With 64 Speed EVs, +2 Grafaiai outspeeds Choice Scarf Floatzel and Hisuian Sneasel. Running less Speed is also viable if you want Grafaiai to be bulkier.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Scarf": {}}},
  "Bombirdier": {
    "sets": {
      "Offensive": {
        "description": "<p>Bombirdier is one of PU's best offensive pivots and Knock Off spreaders thanks to its great offensive typing, spammable STAB moves, wide variety of utility options, and a great defensive profile allowing it to take advantage of Pokemon like Decidueye, Golurk, and Gastrodon. Sucker Punch allows Bombirdier to pick off weakened faster threats and setup sweepers such as Inteleon, Choice Scarf Staraptor, Delphox, and Toxtricity. Bombirdier has a wide variety of options in its final slot; Taunt allows Bombirdier to deny setup attempts from Pokemon like Arcanine and Scream Tail, hazard-setting attempts from Mudsdale and Gligar, Defog from Altaria, and recovery attempts from Pokemon like the beforementioned Altaria, Milotic, and Palossand. Stealth Rock allows Bombirdier to support its team with entry hazards and allows it to free up a moveslot for teammates like Alolan Sandslash and Gastrodon. Roost allows Bombirdier to capitalize on the switches it forces on Pokemon like Bronzong and Decidueye and recover off damage and Brave Bird recoil. U-turn or Parting Shot allows Bombirdier to safely pivot into teammates, but both moves can be hard to fit over other options. Tera Dark boosts the power of Knock Off and Sucker Punch, allowing Bombirdier to achieve rolls such as OHKOing Bronzong and Toxtricity with minimal chip and 2HKOing Altaria while also removing its weakness to Electric- and Rock-type attacks, which is valuable against Pokemon like Kilowattrel and Minior.</p> <p>Bombirdier finds itself on a wide variety of teams ranging from bulky balance to hyper offense. Although it resists Knock Off, Bombirdier appreciates fellow Dark-resistant Pokemon such as Scrafty and Paldean Tauros-F that can switch into Knock Off for it, as Bombirdier requires Heavy-Duty Boots to be an effective pivot. Bombirdier's ability to take out walls like Galarian Slowbro, Gastrodon, and Wo-Chien allows for Pokemon checked by these threats such as Calm Mind Florges, Inteleon, and Decidueye to become much more potent offensive threats. Bombirdier struggles with bulkier walls who can cripple it with status like Bellibolt and Coalossal, so Pokemon who can check these threats like Mudsdale, Goodra, and Inteleon make good partners. While it is immune to Ground-type attacks, Bombirdier should be paired with other Pokemon that resist Ground such as Decidueye and Bronzong because it cannot reliably take on Ground-types such as Gligar and Mudsdale on its own.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 414072, "username": "Hera"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Orthworm": {
    "outdated": true,
    "sets": {
      "Coil": {"description": "<p>Iron Tail is stronger than Heavy Slam but less accurate before Orthworm uses Coil. Substitute is an option to protect Orthworm from status and weaker attackers as it sets up. The Speed investment lets Orthworm outrun Modest Clawitzer, but more Defense investment can be used if Clawitzer isn’t a concern. Tera Ghost helps against Fighting-types like Passimian and Hisuian Sneasel, but Tera Electric gives Orthworm no weaknesses due to Earth Eater.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Utility": {"description": "<p>Protect lets Orthworm scout and gain extra Leftovers recovery, while Coil reduces its passivity and also lets it serve as a wincon. Spikes is an option if Orthworm's team wants to set as many entry hazards as possible or already has a Stealth Rock user. Iron Defense boosts Body Press faster than Coil and also lets Orthworm more easily trade with physical attackers like Passimian and Floatzel. The Speed investment lets Orthworm outrun Modest Clawitzer, but more Defense investment can be used if Clawitzer isn’t a concern.</p> <p>Sample set. Stay tuned for updates!</p>"}
    }
  },
  "Houndstone": {"sets": {"Defensive": {"description": "<p>Rest and Sleep Talk should almost always be used alongside one another. While Houndstone can forgo Sleep Talk and gain an extra moveslot, this leaves it completely helpless while it's asleep. Poltergeist makes Houndstone less passive against foes like Lurantis but is generally less consistent than Night Shade due to its lower PP and accuracy. If Houndstone does use Poltergeist, though, it should run an Impish nature and maximum Attack IVs. Roar prevents bulky setup sweepers like Braviary, Poliwrath, and Farigiraf from exploiting Houndstone.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Offensive": {}}},
  "Flamigo": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>With its good Attack stat, spammable strong STAB moves in Brave Bird and Scrappy Close Combat, and the ability to pivot to facilitate opportunities for teammates, Choice Scarf Flamigo cements itself as the tier's premier revenge killer. Scrappy provides Flamigo with a handy Intimidate immunity, helping it versus the likes of Paldean Tauros-W and Arcanine. Roost gives it longevity, allowing it to function as a long-term check to Scrafty before Tera, as well as healing off Stealth Rock damage and recoil damage from Brave Bird. However, Roost is prediction reliant and is unreliable to lock into. A Jolly nature is preferred, but Flamigo can also opt for an Adamant nature to enhance its power, only losing out on Timid Hisuian Electrode and other Choice Scarf users with similar Speed tiers such as Rotom-C, Meloetta, and opposing Flamigo. Tera Fighting is used to augment Close Combat's power, most notably allowing it to 2HKO Bellibolt after Stealth Rock damage. This also gives Flamigo a Stealth Rock resistance, potentially giving it more opportunities to come in. Alternatively, Tera Flying can be used to boost Brave Bird, letting Flamigo 2HKO Galarian Slowbro after Stealth Rock, as well as OHKOing neutral targets such as Golurk, Delphox, and Goodra. However, Tera Flying gives Flamigo a Stealth Rock weakness, somewhat limiting its revenge killing capabilities.</p> <p>Choice Scarf Flamigo is best suited for bulky offense or balance teams that appreciate the speed control and revenge killing it provides, and it can leverage its pivoting ability to generate opportunities for wallbreakers such as Golurk and Choice Specs Meloetta. These two are good partners, as Flamigo's U-turn allows them to safely take advantage of common Flamigo switch-ins such as Bellibolt, Houndstone, and Galarian Slowbro and apply offensive pressure. Golurk is a particularly good partner, as it can directly switch into and take advantage of contact punishers such as Bellibolt and Coalossal without Flamigo needing to use U-turn, avoiding the risk of Static or Flame Body. Bellibolt forms a VoltTurn core with Flamigo while also handling faster threats such as Choice Scarf Staraptor and Choice Scarf Paldean Tauros-W that would revenge kill Flamigo. In return, Flamigo is able to check Scrafty, which would otherwise turn Bellibolt into setup fodder. Knock Off users such as Ambipom and Skuntank are good partners, as they force items such as Heavy-Duty Boots to be removed from targets like Bellibolt and Houndstone, making them susceptible to hazard chip damage so they are more easily overwhelmed by the pressure Flamigo puts on them. Ambipom forms a pivoting core with Flamigo and is able to revenge kill faster threats with its Fake Out. Paldean Tauros-W and Scyther are also good partners; when paired with Flamigo, they can easily overwhelm shared checks like Bellibolt, Bronzong, and Galarian Slowbro.</p>"
      },
      "Choice Band": {
        "description": "<p>Flamigo's unique traits of a powerful ability in Scrappy, an incredibly high Attack stat, the ability to pivot thanks to U-turn, and strong powerful STAB moves make it one of the strongest wallbreakers and physical attackers in the tier, although it is easily revenge killed. Close Combat is extremely spammable in tandem with Scrappy, targeting Pokemon like Golurk, Alolan Sandslash, and Duraludon. Brave Bird is a useful alternative STAB move that targets Pokemon like Heracross, Galarian Slowbro, and Florges. U-turn allows Flamigo to pivot out of awkward matchups like Bellibolt and Houndstone. Roost allows Flamigo to capitalize on the switches it forces against Pokemon like Scrafty and Wo-Chien and recover off damage from Stealth Rock and Brave Bird recoil, although its prediction reliance makes it risky to use. Tera Flying boosts Flamigo's more spammable Flying-type STAB move and achieves rolls like 2HKOing Gligar, whereas Tera Fighting boosts Close Combat, allowing it to OHKO Rotom-H and Bronzong with minimal chip damage. Tera Fighting also does not make Flamigo weak to Stealth Rock.</p> <p>Flamigo fits on offensive teams that want to have a powerful wallbreaker that can also bluff as a revenge killer. Flamigo's ability to OHKO Pokemon like Skuntank, both Paldean Tauros formes, and Scrafty means Pokemon threatened by these foes like Delphox, Galarian Articuno, Salazzle, and Ambipom all make stellar partners. Flamigo appreciates having the likes of Gligar and Gastrodon set up entry hazards to chip away at its few switch-ins like Bellibolt and Mudsdale and make it more difficult for revenge killers like Pawmot, Delphox, and Inteleon to switch in, while in turn Flamigo can KO both Wo-Chien and Paldean Tauros-W, which would threaten these two. Other offensive pivots like Kilowattrel and Bruxish can make a stellar pivot core with Flamigo that can be hard to stop. Choice Scarf users like Zoroark and Florges make good partners, as most people assume Flamigo will be Choice Scarf, allowing these more niche options to become a surprise.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 477404, "username": "sufys"}, {"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 567354, "username": "sapphiree"}]}]}
  },
  "Tatsugiri": {"sets": {"Offensive": {}}},
  "Farigiraf": {"sets": {"Offensive Trick Room": {}, "Double Dance": {}, "Wish": {}}},
  "Dudunsparce": {"sets": {"Utility": {}, "Calm Mind": {"description": "<p>Serene Grace can be used to give Dudunsparce better odds of breaking through walls via Special Defense drops or status. Rattled is more consistent, though, and punishes the use of moves like U-turn and Knock Off, the latter being easier to bait if Dudunsparce runs Tera Ghost.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Coil": {}}},
  "Scream Tail": {
    "sets": {
      "Wish": {},
      "Calm Mind": {
        "description": "<p>Calm Mind Scream Tail is a fearsome sweeper that also doubles as an effective revenge killer thanks to its high Speed, with Speed Booster Energy letting it outrun the entire unboosted metagame. Scream Tail compensates for its meager Special Attack with its impressive natural bulk, which often gives it multiple chances to boost and makes it difficult to take down. Boomburst being so immediately strong also helps, which can 2HKO neutral targets like Galarian Slowbro, Bellibolt, and Gligar at +1 with Stealth Rock chip damage. Flamethrower threatens Steel-types like Alolan Sandslash and Bronzong and offers coverage for Ghost-types like Decidueye and Houndstone. Substitute lets Scream Tail exploit passive foes like Bellibolt and Gastrodon and protects it against priority from threats like Arcanine. It is generally better at creating setup opportunities for Scream Tail than moves like Encore and Disable, since they don't block status or Clear Smog. Psychic Noise is a more proactive alternative that puts greater pressure on walls like Florges, Milotic, and Altaria in exchange for easier setup. It also gives Scream Tail a STAB option before Terastallizing and hits foes like Toxtricity, Golurk, and Coalossal harder than its other moves. 208 Speed EVs let Scream Tail outrun +2 Toxtricity and Choice Scarf users such as Paldean Tauros-W and Staraptor after using Booster Energy. Tera Normal boosts Boomburst, removes Scream Tail's weaknesses, and lets it potentially set up on Ghost-type attacks from the likes of Decidueye and Palossand.</p> <p>Hyper offense benefits a lot from Scream Tail pressuring incredibly fast threats like Inteleon, Kilowattrel, and Choice Scarf Staraptor and excels at paving the way for it to sweep. Scream Tail has a place on bulky offensive teams as well, where its set might not be immediately clear. Rock- and Steel-types like Coalossal and Copperajah are incredibly difficult for Scream Tail to bypass, making Water- and Fighting-types like Tatsugiri, Paldean Tauros-W, and Flamigo useful partners to have. In return, Scream Tail punishes Dragon- and Psychic-types like Goodra and Bruxish for them and can capitalize on their switch-ins, such as Gastrodon and Altaria. Arcanine naturally matches up well against Steel-types, puts pressure on specially bulky threats like Grimmsnarl and Dudunsparce, and can handle early- or mid-game revenge killing so that Scream Tail can conserve its Booster Energy. Pokemon like Toxtricity and Decidueye are great at threatening phazers like Milotic and Mudsdale, which can easily cut Scream Tail's sweep short, and they can bait in frail Pokemon like Salazzle and Zoroark for Scream Tail to revenge kill or set up on. Residual damage goes a long way in securing Scream Tail's sweep, since it is not strong enough to brute force its way through most Pokemon. For example, after one layer of Spikes, +1 Tera Normal Boomburst OHKOes Skuntank and can even 2HKO Florges and Assault Vest Galarian Slowbro. As such, Spikers like Smeargle on hyper offense and Gligar on balance can be very beneficial teammates. Pokemon like Skuntank, Salazzle, and the aforementioned Gligar can gradually wear walls like Mudsdale, Coalossal, and Florges down with Toxic and are good at pressuring other nuisances like Assault Vest Galarian Slowbro, Copperajah, and Duraludon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Wo-Chien": {"sets": {"RestTalk": {}, "Leech Seed": {}}}
}