{
  "Dragonite": {"sets": {"Tank": {}, "Extreme Speed": {}}},
  "Porygon2": {"sets": {"Download Support": {}}},
  "Deoxys-Attack": {
    "sets": {
      "Expanding Force": {
        "description": "<p>Deoxys-A is one of the most powerful special attackers in the metagame due to its monstrous Special Attack stat and blazing Speed stat. Expanding Force is the other Psychic-type move that should be used when Deoxys-A is in Psychic Terrain. Focus Blast is for Dark-types like Chien-Pao, Incineroar, and Kingambit. Due to Deoxys-A's abysmal bulk, Focus Sash ensures it can get a guaranteed move off. A Hasty nature prevents Porygon2 from getting a Special Attack boost while allowing Deoxys-A to use physical moves from partners like Incineroar and Chien-Pao. Despite Deoxys-A's high Special Attack and powerful STAB moves, it struggles to hit Gholdengo meaningfully, so Pokemon that can actively threaten it, like Incineroar, Landorus-T, and Ogerpon-H, are beneficial. Incineroar and Landorus-T also provide Deoxys-A with pivoting, while Ogerpon-H can redirect in a pinch. Tera Psychic is recommended to make Psycho Boost and Expanding Force as powerful as possible.</p> <h1>Notable Partners</h1> <p><strong>Indeedee-F</strong>: Indeedee-F is mandatory for this Deoxys-A set to shine, as it provides Psychic Terrain support, preventing priority moves such as Incineroar's Fake Out, Chien-Pao's Sucker Punch, and Dragonite's Extreme Speed from functioning, as well as boosting Deoxys-A's Expanding Force. It can also prevent Trick Room with Imprison. <strong>Bulky Support Pokemon</strong>: Fake Out users like Incineroar, and redirectors like Amoongus and Ogerpon-W are good partners, as they allow Deoxys-A to stay on the field for longer <strong>Haze Users</strong>: Haze users such as Chien-Pao and Volcanion are useful teammates due to their ability to clear stat changes, allowing Deoxys-A to function properly as a breaker. <strong>Pivoting</strong>: Due to Deoxys-A terrible bulk, it cannot switch into anything. Therefore, pivoting from the likes of bulky Landorus-T and Incineroar are appreciated.</p>"
      },
      "Extreme Speed": {
        "description": "<p>Deoxys-A becomes a terrifying revenge killer and mixed attacker with its ability to chip at weakened foes with Extreme Speed. Extreme Speed in conjunction with its ridiculous Attack makes it an attacker that can avoid priority attacks like Chien-Pao's Sucker Punch and Raging Bolt's Thunderclap. Superpower can be used to cover Dark-type threats like Chien-Pao and Kingambit. Focus Sash is required due to Deoxys-A's horrible bulk,and a Hasty nature prevents Porygon2's Download from giving it a Special Attack boost. Tera Stellar is the recommended Tera type, due to the plethora of coverage moves this set runs. Deoxys-A cannot damage Gholdengo very well, so Pokemon like Incineroar and Chien-Pao are recommended.</p> <h1>Notable Partners</h1> <p><strong>Priority Attackers</strong>: Pokemon that commonly use priority moves, such as Dragonite, Rillaboom, and Raging Bolt are good teammates, as they can form a priority spam core that can clean up foes very easily. Rillaboom deserves a special mention due to Grassy Surge removing Psychic Terrain from Indeedee. <strong>Haze Users</strong>: Haze users like Volcanion and Chien-Pao are good teammates since they can erase the stat drops from Psycho Boost, Superpower, and Incineroar and Landorus-T's Intimidate. Chien-Pao also forms a priority spam core with Deoxys-A. <strong>Bulky Support Pokemon</strong>: Fake Out users like Incineroar and redirectors like Sinistcha and Ogerpon-W are good partners, as they can circumvent Deoxys-A's frailty. <strong>Pivoting</strong>: Due to Deoxys-A's terrible bulk, it cannot switch into anything. Therefore, it appeciates pivoting from bulky Landorus-T and Incineroar.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}, {"username": "HiZo", "user_id": 438997}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Heatran": {"sets": {"Offensive": {}}},
  "Amoonguss": {
    "sets": {
      "Bulky Support": {
        "description": "<p>Amoonguss serves as the tier's prime disruptor thanks to its various powerful support moves alongside Regenerator, which can also be used by its ally to regain HP upon switching out. With its bulk, it can redirect and absorb various hits by using Rage Powder, as well as threatening to debilitate foes with Spore. Pollen Puff heals Amoonguss's ally even under the effects of Taunt, and Clear Smog negates attempts to set up against Amoonguss. Protect can be used over Clear Smog if Amoonguss's team has ample ways of beating setup Pokemon or does not have enough protection moves to share. Sitrus Berry is best for aiding in Amoonguss's longevity, allowing it to take more hits while redirecting attacks or spreading sleep. The EV spread allows it to survive two uses of Bleakwind Storm from Timid Tornadus with Sitrus Berry, and 28 Speed IVs allow it to underspeed base 50 Speed Pokemon with minimum investment such as Kingambit and Iron Hands. Unfortunately, Amoonguss struggles against opposing Grass-types and Gholdengo because of their immunity to Spore, so teammates like Heatran and Landorus-T are welcome to prevent Gholdengo from being on the battlefield. Amoonguss also struggles against Pokemon with Safety Goggles, so it appreciates Pokemon like Incineroar that can remove said item with Knock Off to help improve Spore's utility. Tera Water allows Amoonguss to resist Fire- and Ice-type attacks from Chien-Pao and Incineroar while preserving its resistance against Water-type attacks, while Tera Dark gives it an immunity to Psychic-type attacks from Pokemon like Deoxys-A and provides an immunity to Prankster-boosted moves, most importantly Taunt from Tornadus.</p> <h1>Notable Partners</h1> <p><strong>Fast Pokemon or Pokemon With Prankster</strong>: While Amoonguss is very slow, Prankster Pokemon such as Tornadus and Grimmsnarl solve this issue by allowing themselves and Amoonguss to have a Prankster-boosted Spore. Fast Pokemon such as Chien-Pao also appreciate being able to use Spore against slower Pokemon.</p> <p><strong>Other Defensive Utility Pokemon</strong>: Amoonguss is a good fit on bulkier teams thanks to giving its ally Regenerator and Clear Smog. Pokemon such as Ting-Lu and Incineroar appreciate Amoonguss's ability to give them Regenerator, greatly increasing their longevity, and in return, they give Amoonguss more utility moves in order to be less passive.</p> <p><strong>Setup Attackers</strong>: Pokemon such as Iron Hands and Gholdengo appreciate Amoonguss's ability to redirect attacks so they can set up safely. Furthermore, Swords Dance Ogerpon-H has Mold Breaker, giving Amoonguss the ability to use Spore on Gholdengo.</p> <p><strong>Trick Room Setters</strong>: Trick Room setters like Diancie or Porygon2 allow Amoonguss's poor Speed stat to shine, giving themselves and Amoonguss the chance to use Spore on both of the opposing Pokemon. These Pokemon also appreciate Amoonguss being able to redirect certain attacks to ensure Trick Room is set.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "HiZo", "user_id": 438997}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}, {"username": "Chromate", "user_id": 550768}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Tornadus": {"sets": {"Bulky Prankster": {}, "Focus Sash": {}}},
  "Landorus": {"sets": {"Sheer Force": {}}},
  "Landorus-Therian": {
    "sets": {
      "Bulky Pivot": {
        "description": "<p>Landorus-T serves as a strong, bulky attacker that supports its teammates with its fantastic ability Intimidate, which can be devastating for physical attackers like Iron Hands and Ogerpon-H. Taunt can stop Incineroar's Parting Shot and Amoongus's Spore, setup sweepers like Iron Hands and Ogerpon-W, and Trick Room users like Diancie and Porygon2. Sitrus Berry increases Landorus-T's longevity, while Safety Goggles helps against Spore. The given EV spread lets Landorus-T outspeed Deoxys-A in Tailwind and survive Freeze-Dry from Choice Specs Iron Bundle after Terastallizing and a critical hit-boosted Draco Meteor from Raging Bolt. Landorus-T struggles against super effective moves from Pokemon like Chien-Pao, Ogerpon-W, and Walking Wake without Terastallizing. Tera Water removes Landorus-T's Ice weakness, which can be helpful against Chien-Pao and Iron Bundle. Tera Grass is an alternative that can help against Water-types like Ogerpon-W and let Landorus-T ignore Sleep Powder and Rage Powder from Hisuian Lilligant and Sinistcha, respectively.</p> <h1>Notable Partners</h1> <p><strong>Other Defensive Pokemon</strong>: Other defensive Pokemon like Incineroar, Tornadus, and Amoonguss can be good teammates for Landorus-T, as they form good defensive backbones with it. Additionally, Incineroar makes a double Intimidate core, which neutralizes most physical attackers, with Landorus-T; Tornadus provides Prankster-boosted Stealth Rock and speed control with Tailwind; and Amoonguss shares Regenerator. <strong>Bulky Setup Pokemon</strong>: Bulky setup Pokemon such as Nasty Plot Gholdengo and Dragon Dance Dragonite appreciate the presence of Landorus-T, as it can help increase their survivability with Intimidate and help them secure KOs with entry hazards.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}, {"username": "HiZo", "user_id": 438997}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Volcanion": {"sets": {"Bulky Offense": {}}},
  "Incineroar": {"sets": {"Support": {}}},
  "Rillaboom": {"sets": {"Swords Dance": {}, "Bulky Pivot": {}}},
  "Indeedee-F": {"sets": {"Follow Me Support": {}}},
  "Iron Hands": {"sets": {"Swords Dance": {}}},
  "Gholdengo": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Gholdengo stands out as one of the best setup attackers, with its already massive Special Attack stat and reasonable bulk bolstered further by Nasty Plot and Recover. Additionally, it provides plenty of support thanks to Good as Gold making both itself and its partner immune to status moves including  Amoonguss's Spore and Incineroar's Parting Shot. Make It Rain is Gholdengo's standout move as an exceptionally high-powered spread attack, taking down the likes of Chien-Pao and Glimmora easily as well as Rillaboom at +2. Shadow Ball pressures other Ghost-types such as Sinistcha and opposing Gholdengo effectively while also hitting Steel-resistant foes such as Ogerpon-H well. Gholdengo can choose to run Recover in lieu of Protect if the rest of the team can provide the latter, making it incredibly hard to remove. As Gholdengo wants to sit on the field for as long as possible, Leftovers is the primary recovery item chosen to maximize healing; however, Sitrus Berry is a fine option for more immediate HP recovery. Gholdengo's inability to hit Incineroar for any meaningful damage make partners such as Ogerpon-W and Landorus greatly appreciated. The given bulk EVs allow Gholdengo to survive Landorus-T's Stomping Tantrum, Chien-Pao's Sucker Punch, and Heatran's Flash Fire-boosted Lava Plume. Its Speed allows it to outrun Choice Scarf Landorus-T in Tailwind. Tera Dragon is generally preferred to resist both Ogerpon-H's and Ogerpon-W's STAB moves; however, Tera Water is also fine as a good defensive typing overall.</p> <h1>Notable Partners</h1> <p><strong>Bulky Support Pokemon</strong>: The likes of Incineroar, Amoonguss, and Indeedee-F help make Gholdengo shine, with Intimidate nullifying physical attackers almost entirely and Fake Out, Rage Powder, and Follow Me providing safe opportunities to use Nasty Plot.</p> <p><strong>Other Setup Pokemon</strong>: Dragon Cheer Raging Bolt and Cosmic Power Deoxys-D appreciate Nasty Plot boosting their damage further, as well as the immunity to Taunt and Spore thanks to Good as Gold. Physical setup Pokemon such as Swords Dance Iron Hands particularly appreciate Good as Gold to provide them an immunity to Will-O-Wisp.</p> <p><strong>Pokemon With Immunity Abilities</strong>: Pokemon such as Heatran and Latios provide Gholdengo with Flash Fire and Levitate, respectively, making it immediately immune to types it would otherwise be weak to.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs turns Gholdengo into a behemoth of a special attacker, with it 2HKOing bulkier Pokemon such as Indeedee-F and Dragonite with its Tera Steel-boosted Make It Rain. Choice Specs also helps turn Shadow Ball into an OHKO against the likes of Latios, Sinistcha, and bulky Gholdengo. Dazzling Gleam is one of the best coverage options for Gholdengo, allowing it to deal significant damage to the plethora of Dragon-types in the metagame such as Raging Bolt and Walking Wake. Thunderbolt and Power Gem are alternative coverage options that improve Gholdengo's chances against Volcanion and Incineroar. Trick is an option that disrupts Trick Room setters such as Porygon2 as well as setup attackers like Iron Hands. Steel is Choice Specs Gholdengo's best Tera type, as it further boosts its strongest attack while also retaining its Dragon and Fairy resistances. Choice Specs is particularly good in Partners in Crime, as it allows Gholdengo to lock into its partner's move then later break the Choice lock by having its partner switch.</p> <h1>Notable Partners</h1> <p><strong>Tailwind Users</strong>: Whimsicott and Tornadus are Choice Specs Gholdengo's best friends, with Tailwind allowing it to deal massive damage immediately and its Good as Gold providing Whimsicott and Tornadus with a Taunt immunity. Whimsicott also offers Fake Tears to further boost Gholdengo's damage.</p> <p><strong>Setup Pokemon</strong>: Pokemon that require setup to be as threatening as possible such as Swords Dance Rillaboom appreciate the immediate bursts of damage that Gholdengo can provide.</p> <p><strong>Strong Special Attackers</strong>: Given that Gholdengo can break its Choice lock at any time by having its partner switch, a strong special attacker such as Volcanion and Landorus makes for a great partner. These also happen to pass it invaluable coverage for Fire- and Steel-types, letting it stand up to Incineroar and Heatran more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yuki", "user_id": 294287}], "teams": [{"name": "Quality checked by", "members": [{"username": "HiZo", "user_id": 438997}, {"username": "Chromate", "user_id": 550768}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Chien-Pao": {"sets": {"Offensive": {}}},
  "Sinistcha": {"sets": {"Hospitality Support": {}}},
  "Ogerpon-Wellspring": {"sets": {"Offensive Redirector": {}}},
  "Ogerpon-Hearthflame": {"sets": {"Offensive Redirector": {}}},
  "Raging Bolt": {"sets": {"Setup": {}, "Offensive": {}}}
}