{
  "Pikachu": {
    "sets": {
      "Imposter": {
        "description": "<p>Thanks to Light Ball, Pikachu is a niche Imposter user that can break past less-sturdy Imposter-proofers, although it forgoes defensive utility in exchange. When Pikachu transforms, only the ability, item, and HP EVs listed here matter. The listed moves, non-HP EVs, and nature will very rarely see use: since Pikachu outspeeds all other Imposter users like Chansey, it is extremely rare that Pikachu is not transformed. Nevertheless, Volt Switch provides a reasonably strong pivoting option against opposing transformed Imposter users, which cause Pikachu's Imposter to fail, while Glare can paralyze threats to aid Pikachu later on. Healing Wish and Spikes both provide some utility if Pikachu is no longer needed. Since Pikachu is extremely frail, it can easily fall to any strong move from opposing threats it wants to transform into. Therefore, significant team support is needed to realize its potential. Paralysis spam through Nuzzle and Glare ensures Pikachu always outspeeds opposing threats like Mega Mewtwo X, and it can also generate free turns. Knock Off invalidates Pikachu, so Knock Off absorbers, such as Arceus with a held Plate are recommended. Bulky special walls like Ice Scales Arceus-Ground and Ho-Oh check Mega Diancie and Arceus-Ghost, which Pikachu cannot safely transform into: the former can OHKO with Extreme Speed, and the latter Imposter-proofs itself.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 338877, "username": "TTTech"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Chansey": {
    "sets": {
      "Imposter": {
        "description": "<p>With Imposter, Chansey transforms into a version of the opposing Pokemon with bulk that is far greater and can be further bolstered by Eviolite. This provides a myriad of benefits, including blanket checking most Pokemon, scouting sets, and PP stalling less threatening foes. These traits make Imposter Chansey a valuable addition to almost every team. The given moves offer the most utility in the rare situations Chansey is not transformed, allowing it to Imposter-proof certain special attackers and act as a cleric. While Eviolite is usually the best item, Covert Cloak is useful against Spirit Shackle and Salt Cure users, and Spooky Plate allows Chansey to threaten Arceus-Ghost and Lunala that would otherwise defeat it with Judgment. Offensive threats such as Ultra Necrozma appreciate the information Imposter Chansey provides through scouting; physical attackers in particular highly appreciate moves like Burning Bulwark being discovered. Special attackers enjoy Imposter Chansey taking advantage of RegenVest users and potentially Imposter-proofing them. Imposter Chansey appreciates slow pivoting from Pokemon like Celesteela and Mega Steelix so it can safely scout. Specially defensive Pokemon like Ice Scales Arceus formes and Magic Guard Blissey can serve as checks to opposing Take Heart Arceus formes, which can beat Imposter Chansey one-on-one, while also checking Dragon-type attackers like Eternatus and Miraidon that can hit it hard.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Blissey": {
    "sets": {
      "Magic Guard": {
        "description": "<p>With naturally high Special Defense and HP along with a decent neutral typing against most attacks, Blissey is an effective special wall capable of checking various special threats like Eternatus and Miraidon. Magic Guard also gives Blissey an immunity to residual damage from sources such as Salt Cure and Thunder Cage, with the protection from the latter and its low Attack limiting healing from Strength Sap letting it check most Take Heart Arceus formes. Ruination is a way to make near-guaranteed progress barring a miss, and its consistent damage mitigates Blissey's otherwise-crippling passivity. Topsy-Turvy deters setup attempts from Take Heart and Nasty Plot users by inverting their boosts and likely forcing a switch, in which case Blissey can then pivot out with Teleport or Parting Shot. Blissey's ability to deny Strength Sap healing makes it a great pick on balance teams carrying physical attackers such as Mega Lucario, as Fur Coat walls with Strength Sap usually can't get past Blissey, and physical attackers can force Imposter users out if they switch in while Blissey is pivoting. Blissey's immense frailty means that reliable physical walls, such as Mega Slowbro, are mandatory to cover for it; Arceus-Ghost can also bypass Blissey with either Secret Sword or Triple Arrows, so Yveltal makes for a good teammate. Imposter-proof Blissey with any Regenerator user.</p>"
      },
      "Regenerator": {
        "description": "<p>Blissey uses its enormous special bulk and minimal Attack to simultaneously wall special threats and disrupt their Strength Sap recovery while maintaining momentum from Regenerator. Knock Off is a staple move on RegenVest users, while Wish in conjunction with Blissey's HP helps keep teammates healthy. Ruination reduces Blissey's passivity, though Salt Cure is an alternative that can be more effective into Pokemon like Celesteela and Flare Boost Flutter Mane. Clear Smog, Topsy-Turvy, and Glare prevent Blissey from being setup fodder, with the latter being particularly useful against Magic Guard Eternatus and Imposter users, while Stone Axe provides utility if setup control is not necessary. Assault Vest further amplifies Blissey's Special Defense against powerful wallbreakers like Mega Alakazam that could otherwise outdamage Regenerator healing, while Heavy-Duty Boots prevents entry hazard damage and allows Blissey to access the aforementioned status moves. Blissey pairs incredibly well with very fast offensive Pokemon like Mega Alakazam and Mega Sceptile, as it provides slow pivoting, Wish support to offset residual damage for Mega Alakazam and allow Mega Sceptile to forgo Strength Sap, and healing denial against special walls like Ice Scales Arceus formes, while they revenge-kill numerous threats that Blissey can pivot into, especially those that Blissey cannot beat by itself such as Eternatus and Flare Boost Flutter Mane. Strong physical attackers also work well, as they can offensively Imposter-proof Blissey without conceding momentum; particularly, Ash-Greninja can pick off chipped Ice Scales Arceus formes. Blissey cannot handle certain special attackers like Psystrike Mega Alakazam, Shell Side Arm Eternatus, and various Secret Sword users, mandating a secondary special wall like Ice Scales users. Depending on the moveset, Blissey can be Imposter-proofed by other RegenVest users or Magic Guard users.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ho-Oh": {
    "sets": {
      "Ice Scales": {
        "description": "<p>Ho-Oh is an effective special wall capable of checking dangerous special attackers like Simple Lunala and Mega Gardevoir. Teleport is a fantastic move for slowly pivoting in offensive teammates. Knock Off can crucially remove items from Ho-Ohs's checks like Miraidon, Imposter Chansey, and Mega Slowbro. Mortal Spin in combination with STAB-boosted V-create allows Ho-Oh to function as a strong entry hazard remover thanks to its solid matchup against most Steel types, and Mortal Spin can heavily punish Imposter users on the switch. Topsy-Turvy crucially removes stat boosts against foes like Simple Arceus-Ghost and Lunala. Ho-Oh requires suitable Knock Off absorbers like Dialga-O and Arceus formes because of its glaring Stealth Rock weakness. Ho-Oh also struggles against Miraidon, Primal Kyogre, and most Take Heart Arceus formes, so teammates that can deal with them like Blissey and RegenVest Mega Swampert can help. Imposter-proof Ho-Oh with the aforementioned Knock Off absorbers, although they should ideally have a method to punish the Imposter user back. Steel-types not weak to Fire such as Primordial Sea Celesteela and Registeel can be used to block the Imposter user's Mortal Spin, although they must carry a move to prevent the Imposter user from freely healing with Recover.</p>"
      },
      "Magic Guard": {
        "description": "<p>Good stats and the fabled STAB-boosted V-create make Ho-Oh a solid setup attacker. Magic Guard negates annoying chip damage from Mortal Spin and Salt Cure and allows for free use of Life Orb. Volt Tackle's very high PP and good damage output are excellent, as they allow Ho-Oh to both fish for paralysis on threats like Imposter users and also deal hefty damage, notably ensuring that Mega Slowbro can't wall it long-term. Swords Dance bolsters these moves even further, notably allowing V-create to OHKO neutral Arceus formes and Volt Tackle to 2HKO Mega Slowbro, in addition to preventing Imposter users and faster Pokemon like Eternatus and from permanently walling Ho-Oh with Strength Sap; alternatively, Headlong Rush allows Ho-Oh to hit foes like Eternatus and Fire-immune Steel-types like Registeel super effectively. Magic Guard Ho-Oh best fits on balance teams looking for a bulky setup attacker that wears down common walls and can potentially sweep late-game. Dragon-types are a notable thorn in Ho-Oh's side, particularly ones that use Strength Sap like Eternatus, so an ally that blocks Strength Sap like Magic Guard Blissey is a valuable teammate. Ho-Oh's damage potential also tanks without its Life Orb, so a Knock Off absorber like an Arceus forme is useful. Imposter-proof Swords Dance Ho-Oh with a Dragon-type teammate like Eternatus or Miraidon; Headlong Rush sets can be Imposter-proofed by any Fur Coat user, ideally one immune to or not bothered by potential paralysis.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Registeel": {
    "sets": {
      "Fire Immunity": {
        "description": "<p>Registeel takes advantage of Primordial Sea to rid itself of a Fire weakness, improving its matchups against Ultra Necrozma, Mega Sceptile, and Eternatus; Primordial Sea also isn't ignored by Mold Breaker, making it preferred over Well-Baked Body. Salt Cure and Knock Off help to cripple would-be switch-ins like Mega Garchomp and Mega Swampert as well as being overall annoying to Imposter users, while Stone Axe lets Registeel set entry hazards for its teammates. Glare and Nuzzle both help to cripple Pokemon that Registeel checks such as Eternatus and Mega Sceptile; with Glare, it can slow down Ground-types like Arceus-Ground and Mega Garchomp, while Nuzzle can paralyze Magic Bounce Pokemon like Yveltal. Alternatively, Mortal Spin lets Registeel remove entry hazards and prevent Imposter users from stealing its utility. Teleport is useful for slow pivoting into teammates without fail, while Parting Shot can weaken foes for the incoming teammate at the cost of being useless against Magic Bouce. Primordial Sea and Well-Baked Body both give a Fire immunity, with Primordial Sea not being affected by Mold Breaker and removing Desolate Land, while Well-Baked Body lets Registeel spinblock Primal Kyogre without taking boosted Scalds. Registeel struggles with Fighting- and Ground-types like Mega Lucario, Mega Blaziken, and Mega Garchomp, so having Fur Coat teammates like Miraidon, Arceus-Fairy, and Arceus-Ghost can help. Registeel can Imposter-proof itself for the most part, but when using Knock Off, having any Arceus forme will do, and with Glare and Parting Shot, having a Magic Bouncer like Mega Audino will work. Registeel helps to Imposter-proof Pokemon with Fire-type coverage like Mega Sceptile and Eternatus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kyogre-Primal": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Primal Kyogre is a useful special wall, pivot, and utility Pokemon, notably checking foes like Flutter Mane, Palkia-O, and Eternatus. Flip Turn allows Primal Kyogre to safely scout moves from opposing threats like Choice Specs Flutter Mane and then swap into the appropriate answer, be it an Imposter Pokemon or an Ice Scales user. Scald is typically preferred over Steam Eruption thanks to its higher PP, but some teams may appreciate the extra power of Steam Eruption. Knock Off cripples item-reliant Pokemon like Chansey, RegenVest Dialga, and RegenVest Celesteela along with removing Covert Cloak to let it status Pokemon it otherwise couldn't, such as Mega Audino. Mortal Spin's entry hazard removal and poison-inflicting capabilities make it a good all-around utility choice, especially since Primal Kyogre has an excellent matchup against many of the metagame's Steel-types, like Mega Steelix and Celesteela. Nuzzle can slow down wallbreakers like Eternatus and Choice Specs Flutter Mane, and Stone Axe can help wear down foes for allies. Primal Kyogre's fear of physical wallbreakers like Mega Garchomp, Ash-Greninja, and Ultra Necrozma makes reliable checks to them, like Fur Coat Mega Audino and Ice Scales Arceus-Ground, useful teammates. Special wallbreakers like Flutter Mane, Eternatus, and Miraidon appreciate Knock Off removing items from opposing RegenVest users and Ability Shields from Pokemon like Ice Scales Arceus-Ground. Imposter-proof Primal Kyogre with a Take Heart Arceus forme holding a Plate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 610920, "username": "vesp"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys": {"sets": {"Sheer Force": {}}},
  "Dialga-Origin": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Dialga-O acts as a reliable pivot and a check to some special attackers like Miraidon and Eternatus. Revelation Dance hits Flutter Mane and Mega Audino for major damage, preventing the former from using Dialga-O as a free Nasty Plot window and the latter from using it as a free Teleport window. Doom Desire can enable attackers that struggle to break through Fairy-type walls like Mega Garchomp and Ash-Greninja due to their one-sided wallbreaking nature shoehorning your opponent into specific response patterns; alternatively, Draco Meteor threatens Miraidon and Eternatus. Additionally, Revelation Dance + Draco Meteor hits both Flutter Mane and Dragon-type attackers, but Dialga-O can't provide Doom Desire support if this combination is run. Replacing either move with Doom Desire forces you to pick what Dialga-O can and can't beat, but it's still able to pivot into a teammate that takes care of foes that it struggles with. Knock Off removes key items such as Assault Vest from RegenVest Mega Steelix, Salt Cure heavily deters Steel-types that would otherwise endlessly wall Dialga-O, Rapid Spin acts as decent entry hazard removal, and Stone Axe can be used as a reliable way to set entry hazards. A Quiet nature is recommended for Revelation Dance to potentially KO Flutter Mane after three turns of burn damage and Draco Meteor to OHKO Miraidon, but a Sassy nature provides greater safety against threats like Mega Alakazam. Teammates that struggle to break through Fairy-types appreciate Dialga-O hitting them with Doom Desire, as mentioned previously, along with the slow pivoting it provides. Teammates vulnerable to Thunder Cage and Mortal Spin like Mega Slowbro also appreciate Dialga-O checking users of these moves. Dialga-O cannot break through Steel-types without Salt Cure, so a Pokemon that can pivot in and break them like Magic Guard Ho-Oh makes for a good partner. Dialga-O is heavily reliant on Assault Vest to actually check threats, so a partner that can absorb Knock Off like Arceus-Ghost also synergizes well with it. Imposter-proof Dialga-O with a neutral Ice Scales user, a Steel-type if it's not running Salt Cure, or Imposter Chansey if it's not running Knock Off.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Palkia-Origin": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Palkia-O is a strong setup sweeper that has an unremovable item and a strong matchup against the likes of Arceus-Ground and Ho-Oh. Speed Boost denies offensive counterplay from Pokemon like Ash-Greninja and Flutter Mane, and it prevents slow pivots like Teleport Blissey from forcing Palkia-O out via switching to Imposter users. Magic Guard can exploit defensive Pokemon that rely on status moves to deal damage, lets Palkia-O sit on common Knock Off users, and helps keep Dragon Energy's power high. Strength Sap is generally preferred for its greater amount of healing, but Recover can help against Strength Sap blockers like Mega Audino and Blissey. Pokemon like Ultra Necrozma and Mega Gardevoir appreciate Palkia-O beating Ho-Oh and Arceus-Ground, and they can help it beat checks like Mega Audino and Blissey in return. Speed Boost Palkia-O essentially ceases to function if statused, so a status absorber like a Take Heart Arceus forme can help. Teammates such as Blissey that can take on faster attackers like Eternatus and Flutter Mane are also greatly appreciated by Magic Guard variants. Imposter-proof Palkia-O with Ice Scales Mega Audino, Arceus-Fairy, or Imposter Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Giratina": {
    "outdated": true,
    "sets": {
      "Prankster": {
        "description": "<p>Prankster + Haze Giratina's huge bulk and recovery and disruption options allow it to function as a reliable answer to setup users. Giratina has a wide array of options it can use to disrupt foes attempting to set up: Glare paralyzes fast attackers such as Palkia-O, Encore keeps them locked into moves such as Nasty Plot, Parting Shot lets Giratina pivot and Destiny Bond trades a KO, and Entrainment helps force out ability-dependent attackers. Heavy-Duty Boots helps Giratina switch in more easily without fear of entry hazard chip, while Covert Cloak helps prevent status from moves like Mortal Spin and Nuzzle. Tera Fairy improves Giratina's matchup into opposing Dragon-types such as Koraidon while maintaining a Fighting-type resistance, whereas Tera Dark grants immunity to status moves from opposing Prankster users and a Ghost- and Dark-type resistance for Flutter Mane and Arceus-Dark. Great partners for Prankster Giratina include RegenVest Ting-Lu, Fur Coat Dondozo, and Imposter users thanks to their strong defensive synergy, which allows Giratina to get in more comfortably against Arceus-Ghost and Koraidon.</p>"
      },
      "Magic Bounce": {
        "description": "<p>Giratina is a great defensive Pokemon that provides utility and disruption with its immunity to Fighting and resistance to powerful attacks like V-create and Rising Voltage. Court Change makes Giratina effective at removing entry hazards against Mold Breaker entry hazard setters and Stone Axe Pokemon. Strength Sap helps with keeping strong physical attackers such as Groudon in check. Whirlwind bypasses Substitute to force out foes, whereas Encore can be used as another form of disruption. Scald is useful for spreading burns, especially against physical attackers such as Groudon and Zamazenta-C. Tera Fairy is great for the immunity to Dragon-type attacks from Koraidon, Eternatus, and Palkia-O, while Tera Dark is great for being resistant to Ghost- and Dark-type attacks from Arceus-Ghost and Hoopa-Unbound. Covert Cloak helps Giratina beat Imposter users and blocks troublesome status from Scald and Mortal Spin. Dondozo and RegenVest Ting-Lu are great partners for Giratina thanks to their physical bulk and complementary typings, which help Giratina against threats such as Eternatus and Arceus-Ghost.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 338877, "username": "TTTech"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}]}
  },
  "Arceus-Electric": {
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Electric's main draw is its Electric typing, which grants it both STAB on Thunder Cage and a resistance to it, giving Arceus-Electric a niche over other mostly neutral options like Arceus. Ice Beam provides generally good coverage, hitting Dragon- and Ground-types like Eternatus and Mega Garchomp that can otherwise switch into Thunder Cage safely. Secret Sword is an option that lets Arceus-Electric bypass Blissey, an otherwise hard stop to it that also denies Strength Sap healing. Leftovers provides crucial recovery for Ice Beam and Scald variants against Blissey, but Rocky Helmet is an option to harshly punish Ash-Greninja. Fur Coat variants can handle most physical threats but are notably weak to Mega Garchomp, making a teammate like Celesteela or a secondary Fur Coat user necessary. Ice Scales variants can struggle to answer powerful threats like Mega Alakazam and Flutter Mane long-term, making a secondary specially defensive teammate, such as a RegenVest user or Blissey, helpful. Arceus-Electric usually can Imposter-proof itself, but Pokemon like Imposter Chansey can act as a secondary Imposter-proofer if it is weakened or inflicted with Salt Cure.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Fairy": {
    "sets": {
      "Take Heart": {
        "description": "<p>Arceus-Fairy's excellent typing allows it to check dangerous wallbreakers depending on its ability, with Fur Coat variants checking threats like Ash-Greninja and Mega Garchomp, while Ice Scales variants can handle threats like Palkia-O and Nasty Plot Arceus-Ghost. Fairy's good neutral coverage also allows Arceus-Fairy to double as a potent bulky setup threat. Take Heart allows Arceus-Fairy to boost its offenses and set up alongside threats like Arceus-Ghost; it also shakes off debilitating status from Mortal Spin. Thunder Cage provides good general coverage, hitting Celesteela and Ho-Oh, and it inflicts chip damage to special walls like Ice Scales Arceus formes. Strength Sap allows Arceus-Fairy to win one-on-one against Imposter users thanks to Thunder Cage and helps neutralize physical wallbreakers like Mega Garchomp. Pixie Plate lets Arceus-Fairy act as a good Knock Off absorber, while Covert Cloak prevents it from being chipped by Mortal Spin and Salt Cure. Revelation Dance is a niche option for Covert Cloak sets to still hit rare Normalize users. Fur Coat Arceus-Fairy has a poor matchup against Mega Lucario, so Lucario checks like Mega Slowbro and Victini are good teammates, with the former acting as a secondary check to Sunsteel Strike Mega Garchomp and the latter checking Ultra Necrozma. Ice Scales Arceus-Fairy can struggle against threats like Flutter Mane and Poison move Eternatus; as a result, teammates like Primal Kyogre and Blissey are appreciated. Arceus-Fairy generally can Imposter-proof itself, but a Pokemon that can Imposter-proof it as a backup like Imposter Chansey is helpful for when it is at low health.</p>"
      },
      "Tidy Up": {
        "description": "<p>Arceus-Fairy is an effective entry hazard remover and check to various wallbreakers like Ash-Greninja, Mega Alakazam, and Mega Garchomp, depending on its ability. Fur Coat makes Arceus-Fairy a blanket check to physical attackers, while Ice Scales improves its matchup against special wallbreakers like the aforementioned Mega Alakazam and Miraidon. Beyond removing hazards, Tidy Up reduces Arceus-Fairy's overall passivity and gives it late-game sweeping potential when checks like Celesteela are gone. Spirit Shackle takes advantage of passive foes like Celesteela and Yveltal that don't have a move to remove Attack boosts and lets Arceus-Fairy potentially rack up boosts or switch to a teammate that can better exploit them; it also lets Arceus-Fairy trap Imposter users, which should always ensure the Imposter user faints and Arceus-Fairy gets +6 Attack. Strength Sap provides reliable recovery that lets Arceus-Fairy beat wallbreakers consisatently while also preventing it from being overwhelmed by physical setup sweepers and maintaining its ability to Imposter-proof itself. Covert Cloak allows Arceus-Fairy to completely wall passive foes reliant on moves like Mortal Spin and Salt Cure to make progress, forcing them out as a result, and it guarantees that Imposter users can't get past it via confusion. Arceus-Fairy's good utility makes it a solid fit on balance teams in need of hazard removal and a general check to physical attackers; its ability to remove said hazards makes teammates consistently annoyed by them, such as RegenVest users and wallbreakers like Ultra Necrozma, solid to use alongside it. Arceus-Fairy doesn't have a joyous time against Sunsteel Strike users like Mega Lucario and most Mega Garchomp, so Regenerator Celesteela is highly recommended to scout their moves beforehand. Arceus-Fairy also commonly invites in the likes of Celesteela and Dondozo, so teammates that take advantage of them like Mega Swampert and Magic Guard Miraidon are appreciated. Arceus-Fairy can Imposter-proof itself, as it wins the one-on-one against Imposter users through PP stalling, but a reasonably bulky Strength Sap user like Ho-Oh can help out if Arceus-Fairy is at very low HP and thus can't beat Imposter users without risking a Speed tie.</p>"
      },
      "Pixilate": {}
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 528036, "username": "Sulo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Fighting": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Arceus-Fighting distinguishes itself as a Take Heart Arceus forme through its Fighting-type STAB moves, letting it pressure Blissey, an otherwise difficult wall to surpass, much harder. Its Fighting typing also provides it with a useful resistance to Ash-Greninja's Wicked Blow, a resistance to Stealth Rock, and no weaknesses to common physical moves. Secret Sword heavily chunks Blissey and hits RegenVest Pokemon such as Primal Kyogre harder, though Revelation Dance has more PP, allows Arceus-Fighting to Imposter-proof itself, and isn't weakened by Fur Coat, making it generally better against Mega Audino. Thunder Cage provides general coverage and chip damage against Pokemon like Ho-Oh and Arceus-Fairy, as well as deterring Imposter users. Ice Beam is an alternative to punish Eternatus, particularly Magic Guard variants that otherwise wall Arceus-Fighting, and also hit Ultra Necrozma, although this means a teammate is required for Imposter-proofing. Leftovers helps provide additional healing to supplement Strength Sap, while Rocky Helmet mainly punishes Ash-Greninja's Surging Strikes. Arceus-Fighting can generally handle most physical threats well but is prone to letting in powerful special wallbreakers such as Mega Alakazam, Flutter Mane, and Eternatus. Thus, reliable special walls like Ice Scales Meloetta and RegenVest Dialga-O are useful teammates. Secret Sword means Arceus-Fighting can't Imposter-proof itself 100% of the time, so a teammate like Magic Guard Eternatus is recommended; Ice Beam sets can be covered by Ice Scales Mega Audino or Ho-Oh, with the former ideally holding Covert Cloak to prevent being frozen.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Arceus-Ghost": {
    "overview": "<p>Arceus-Ghost is one of the most defining centerpieces of Balanced Hackmons thanks to its built-in self Imposter-proofing due to Spooky Plate + Judgment that allows it to run Shore Up without worrying about Imposter, good bulk, great offensive typing, and versatility. It is able to soft check a lot of would-be annoyances such as RegenVest Celesteela without Nuzzle and Mega Lucario depending on its ability. Its ability to block Rapid Spin also differentiates it from other Arceus formes. However, Arceus-Ghost can be hard walled rather easily by certain walls such as Mega Audino and Meloetta. Its low immediate damage output can also lead to fast offensive threats like Eternatus forcing it out. Its ability choice of Magic Guard or Fur Coat also mean it either has limited defensive presence or is a physical wall that's weak to Choice Band Ash-Greninja, respectively.</p>",
    "comments": "<h3>Other Options</h3> <p>Thunder Cage can constantly chip down most bulkier walls and hits Celesteela hard, but Mortal Spin is generally better at chipping down walls on utility sets, which leaves Thunder Cage mostly just for Celesteela. Other offensive abilities such as Speed Boost and Good as Gold can be chosen over Fur Coat on the setup set, but this provides little defensive utility and would leave Arceus-Ghost with fewer opportunities to set up. Taunt is an option on the setup set to deny recovery and other utility such as Spikes and Topsy-Turvy, but giving up a moveslot for utility such as Knock Off or coverage is often not desirable. Plus, it either locks Arceus-Ghost into using Judgment as its only attack or means it has no recovery, both of which are very easily exploitable.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Arceus-Ghost struggles against most Dark-type foes in general, especially faster attackers such as Ash-Greninja. However, they dislike switching in on Secret Sword or Knock Off especially with entry hazards up. Magic Guard Yveltal in particular, however, is a great annoyance, as it completely halts anything Arceus-Ghost can do.</p> <p><strong>Normal-type Walls</strong>: Blissey and Mega Audino handily beat setup sets via Topsy-Turvy and their immunity to Judgment, although Blissey needs to watch out for Secret Sword. Utility sets are hard stopped by Magic Guard Blissey, and even if it is not running Magic Guard, Arceus-Ghost can only make progress through Knock Off and Spikes.</p> <p><strong>Faster Threats</strong>: Most faster threats, like Flutter Mane, Eternatus, and Mega Alakazam, threaten Arceus-Ghost out with direct damage. They can't really switch in, however.</p> <p><strong>Status Effects</strong>: Fur Coat Arceus-Ghost sets hate status, as chip damage from poison cuts heavily into its longevity, and paralysis completely cripples it. Magic Guard sets don't mind poison but still dislike paralysis.</p> <p><strong>Ice Scales + Take Heart Arceus Formes</strong>: Ice Scales Acreus amplified with Take Heart's Special Defense boosts means that all of Arceus-Ghost's attacks, including Secret Sword, will do basically no damage to these Arceus formes. Many of them also carry a Plate, which means they can easily sponge Knock Off.</p>",
    "sets": {
      "Utility": {
        "description": "<p>Arceus-Ghost can provide very consistent utility to its team with its immunity to item removal and built in self-Imposter-proofing through Judgment. Shore Up is the preferred healing move because it isn't blocked by the likes of Blissey and Mega Audino, but Strength Sap heals more HP at once and fares better against Choice Band users. Knock Off removes crucial items from walls like Heavy-Duty Boots and Covert Cloak from Mega Audino, making them susceptible to entry hazard damage or getting poisoned by Mortal Spin. Potentially removing Eviolite from Imposter users is also nice but should not be relied on, as these foes rarely want to switch in on Arceus-Ghost. Spikes takes advantage of Arceus-Ghost's conventional switch-ins, like Blissey, being passive and lacking hazard removal; alternatively, Rapid Spin and Mortal Spin provide hard-to-block hazard removal. Magic Guard is the preferred ability, as it provides an immunity to entry hazards and other chip damage such as Salt Cure and Mortal Spin, but Fur Coat makes Arceus-Ghost function as more of a wall capable of soft checking foes like Koraidon.</p> <p>Arceus-Ghost fits well on entry hazard-stacking teams, as it can easily provide item removal support and reliably block Rapid Spin. Teams that stack hazard-immune teammates also enjoy Arceus-Ghost as a Knock Off absorber. Most attackers such as Ash-Greninja or and Eternatus appreciate Arceus-Ghost stacking Spikes to wear away at their checks or, in Eternatus's case, directly damage checks like Ice Scales Arceus formes. Other teammates such as RegenVest Celesteela and Mega Audino also synergize well with Arceus-Ghost defensively alongside the occasional Imposter-proofing Arceus-Ghost can provide for them. Arceus-Ghost is particularly vulnerable to Dark-types and opposing Ghost-types that are faster such as Ash-Greninja, Yveltal, and Flutter Mane; therefore, checks to them like the aforementioned Mega Audino are valuable.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Arceus-Ground": {
    "sets": {
      "Ice Scales": {
        "description": "<p>Ice Scales Arceus-Ground fills a valuable niche as a special wall, self-Imposter-proof setup sweeper, and entry hazard remover; its Ground typing also offers a useful immunity to Thunder Cage and Volt Switch. Tidy Up supplements a strong Earthquake and allows Arceus-Ground to sweep late-game when its checks like Celesteela and Yveltal have been removed. Spirit Shackle is solely for Imposter users; after trapping one, Arceus-Ground can always boost to +6 and beat it one-on-one, putting the opponent in a heavily disadvantaged position. Strength Sap is necessary for Arceus-Ground to Imposter-proof itself, and it usually heals for more than Recover; Arceus-Ground being a physical attacker also prevents the bane of most Ice Scales Arceus formes, Magic Guard Blissey, from denying it healing. Earth Plate provides a damage boost to Earthquake and can't be removed with Knock Off or Trick, while Covert Cloak shuts down passive damage from Salt Cure and Mortal Spin, making boosting easier. Arceus-Ground's main drawback is that against teams with Strength Sap, Haze, or Topsy-Turvy Celesteela or Yveltal it's never sweeping; as a result, threats like Bolt Strike Mega Garchomp and Mega Lucario are useful teammates. Arceus-Ground can also struggle against Palkia-O and No Retreat Arceus-Ghost, so backup checks to them like Salt Cure users and Mega Audino help out. Arceus-Ground can almost always Imposter-proof itself thanks to Spirit Shackle, but if it's badly poisoned or if the Imposter user has a Covert Cloak, then some physical tank like Mega Slowbro or Yveltal can fulfil this role.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 338877, "username": "TTTech"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Water": {
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Water differentiates itself from other bulky Water-types such as Mega Slowbro and Dondozo through its good Speed tier and balanced bulk, which makes it more resilient to slower wallbreakers like Mega Garchomp. Its Special Defense also means it doesn't instantly fold to Electro Drift coverage, while the aforementioned Water-types are both OHKOed by any Tough Claws user with it. Fur Coat allows Arceus-Water to wall threats like Mega Garchomp and Ash-Greninja, albeit needing a Bold nature to dodge a potential 2HKO from Ash-Greninja's Flower Trick, while Ice Scales takes advantage of Water's lack of weaknesses to common special moves to serve as a decent answer to the likes of Mega Alakazam and Eternatus. Scald threatens burns on Pokemon like Mega Lucario and defensive switch-ins like RegenVest users. Due to Arceus-Water's weakness to Thunder Cage, Spirit Shackle is the safest option for Fur Coat variants to Imposter-proof themselves. Spirit Shackle variants can utilize Shore Up to not have recovery denied by Magic Guard Blissey. Covert Cloak is necessary to prevent Salt Cure's passive damage. Fur Coat variants still takes a lot of damage from coverage options like Electro Drift and Ash-Greninja's Flower Trick, so backup checks to these like Dragon-types and Fur Coat Fairy-types help. Ice Scales variants similarly can be pressured by strong moves such as Mega Alakazam's Psycho Boost, so having RegenVest teammates to scout for moves can be useful. Arceus-Water can generally Imposter-proof itself but can always be Imposter-proofed by Imposter Chansey as a backup.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kyurem-Black": {
    "sets": {
      "Choice Band": {
        "description": "<p>Kyurem-B's main niche compared to competitors like Mega Garchomp and Ash-Greninja lies in its immensely spammable Glacial Lance, which hits most physical walls for at least neutral damage while also being non-contact to avoid Rocky Helmet and Burning Bulwark. Bolt Strike 2HKOes Fur Coat Water-types like Mega Slowbro and Dondozo in addition to Primordial Sea Registeel. U-turn eases prediction and chips walls like Mega Slowbro. Headlong Rush and V-create both target Steel-types like Zacian-C, with the former OHKOing Primordial Sea Registeel and the latter OHKOing Mega Steelix. Kyurem-B's main weakness is its vulnerability to Stealth Rock, making strong entry hazard removal mandatory. Due to Glacial Lance's excellent neutral coverage and Kyurem-B's raw power, it forces most physical walls to remain healthy to avoid being KOed the next time it attacks, making Strength Sap blockers like Magic Guard Blissey and Magic Bounce users fantastic teammates. Kyurem-B is also very slow for a wallbreaker, making fast Pokemon such as Ash-Greninja and Koraidon desirable. Imposter-proof Kyurem-B with Fur Coat Pokemon such as Arceus-Ghost and Mega Audino.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kyurem-White": {"sets": {"Choice Specs": {}}},
  "Meloetta": {
    "sets": {
      "Ice Scales": {
        "description": "<p>Meloetta differentiates itself from other special walls like Arceus-Ground and Mega Audino through its typing, which provides an immunity to Moongeist Beam and a resistance to Psychic-type moves, making it an effective special wall against powerful metagame threats including Flutter Mane, Mega Alakazam, and No Retreat Lunala. Psystrike has high damage output against Flutter Mane and Blissey, more than negating the drawback of its damage being cut by both Fur Coat and Ice Scales. Block traps opposing Imposter users, deters Mega Alakazam from spamming Blue Flare to burn recovery PP, and threatens to trap and eliminate Take Heart Arceus formes. Topsy-Turvy shuts down setup attackers such as Take Heart Arceus formes, Torch Song Dragon-types, and No Retreat Lunala. Covert Cloak blocks a myriad of secondary effects like Eternatus's poison, while Leftovers helps offset chip damage from entry hazards and Thunder Cage. Meloetta is incredibly passive and cannot touch any Pokemon with recovery and without very poor Defense, requiring teammates such as Take Heart Arceus formes and Magic Guard users to minimize momentum loss. Due to not resisting Dragon, it can be pressured by strong Dragon Energy users such as Eternatus and Miraidon, making Steel- and Fairy-type Pokemon like Magearna and Arceus-Fairy helpful teammates. Meloetta's vulnerability to all forms of entry hazards as well as its tendency to get worn down by neutral special attacks can quickly drain recovery PP, so it highly appreciates teammates that provide reliable hazard removal, such as Mortal Spin RegenVest Pokemon and Tidy Up users.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Yveltal": {
    "sets": {
      "Defensive": {
        "description": "<p>Defensive Yveltal's main use case is as a sixth-teamslot option to cover Simple + No Retreat users like Arceus-Ghost and Lunala. Fur Coat makes Yveltal a decent check to Mega Garchomp sets lacking an Electric-type move, completely nullifies Tidy Up Arceus-Ground, and means Triple Arrows Arceus-Ghost needs many more flinches to get past it; alternatively, Magic Bounce can throw back Glare and Spikes, and it also provides a way of blocking Strength Sap without having to commit to running something like Blissey. Revelation Dance hits Fur Coat Arceus-Ghost hard, which can otherwise wall and spinblock Yveltal. Topsy-Turvy halts boosting threats and minimizes Simple Arceus-Ghost's ability to badger Yveltal with secondary effects. Teleport provides a pivoting option, helping offset Yveltal's tendency to lure in Arceus formes that can sponge Knock Off, while Rapid Spin clears entry hazards for its team and partners well with Revelation Dance. Yveltal's main use is on balance teams looking for an easy option to counter Simple Ghost-types that the rest of the team aren't equipped for. Rapid Spin Yveltal alone isn't typically reliable hazard removal in longer games, so a second removal option like a RegenVest user with Mortal Spin is recommended. Yveltal also tends to be Imposter bait; its only deterrent is Knock Off removing the Imposter user's Eviolite, which in slower games can be forgone in favor of making Yveltal a free Recover window, so allies that can directly harm the Imposter user like Ruination or Mortal Spin users are useful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Solgaleo": {
    "sets": {
      "Choice Scarf": {},
      "Primordial Sea": {
        "description": "<p>Primordial Sea Solgaleo is most notable for its ability to wall Eternatus, and it also serves as a solid defensive answer to threats like Ultra Necrozma, Desolate Land Mega Blaziken, and non-Headlong Rush Kyurem-B. Psychic Noise deals respectable damage against Eternatus and prevents it, along with potential switch-ins like Arceus formes, from using Strength Sap. Flip Turn is boosted by Primordial Sea and can deal minor chip damage, while Teleport provides slow pivoting despite Solgaleo's high Speed. Gigaton Hammer pressures Fairy-types like Mega Audino and dissuades Blissey from attempting to block Strength Sap. Spikes can help reduce Solgaleo's passivity against many defensive Pokemon. An Impish nature guarantees Solgaleo isn't 2HKOed by Sheer Force Ultra Necrozma's Bolt Strike, while Jolly allows Solgaleo to outrun Mega Blaziken and Mega Gardevoir. Solgaleo is useful when paired with threats like Ultra Necrozma, which usually require specific allies to Imposter-proof. Defensively, Solgaleo struggles against threats like Moongeist Beam users, Ash-Greninja, and Mega Garchomp, making walls like RegenVest Primal Kyogre and Fur Coat Fairy-types good teammates. Solgaleo can be Imposter-proofed by numerous options, but RegenVest users in particular do not care about Psychic Noise and can maintain momentum.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Lunala": {
    "sets": {
      "Simple": {
        "description": "<p>Simple + No Retreat Lunala distinguishes itself from Arceus-Ghost by having STAB-boosted Stored Power and high HP, allowing it to effectively dispatch of Arceus-Ghost's checks. After No Retreat, Stored Power reaches 220 Base Power, heavily threatening special walls like Mega Audino and Arceus formes. Final Gambit dispatches of hard walls like Yveltal, Meloetta, and Ice Scales Mega Audino, paving the way for teammates to sweep. Due to this, Lunala pairs extremely well with other Ghost-types, most notably Arceus-Ghost but also Flutter Mane and the niche Necrozma-DW. While a boosted Lunala can 2HKO most special walls, it never OHKOes them without heavy chip damage and gets forced out by Topsy-Turvy if it misses any KO, making entry hazard support and teammates such as Thunder Cage users very helpful. A healthy Ash-Greninja can force Lunala to use Final Gambit on it rather than the special walls, so walls like Fur Coat Audino with Rocky Helmet act as good teammates. Lunala usually Imposter-proofs itself due to Spooky Plate, but it is recommended to have a backup Imposter-proofer like Yveltal or Meloetta in case Lunala is in KO range of Stored Power or the opposing Imposter is holding a Spooky Plate.</p>"
      },
      "Ice Scales": {
        "description": "<p>Ice Scales Lunala is notable for its capability to check Eternatus as well as pivot into neutral threats like Mega Sceptile. The Psychic-type differentiates Lunala from other Eternatus answers by threatening direct damage, and Psystrike is the preferred choice to hit Blissey hard. Hex combined with Nuzzle or Glare provides a solid secondary STAB move capable of threatening Fur Coat Pokemon and Steel-types, and paralysis shuts down fast wallbreakers like Mega Sceptile. Judgment + Spooky Plate is an alternate option that lets Lunala Imposter-proof itself. Covert Cloak is necessary to prevent secondary effects like poison from Eternatus and Salt Cure. A Calm nature is typically preferred for more special bulk, but a Timid nature can be used to outspeed threats like Mega Gardevoir. Lunala can't check Moongeist Beam users like Flutter Mane and Mega Alakazam, so RegenVest users like Dialga-O that pose a particular threat to them are recommended. Blissey can also check them to an extent and provides an answer against Take Heart Arceus formes. Lunala is highly susceptible to Knock Off, so teammates like Take Heart Arceus formes and Magic Guard Pokemon can help switch into common Knock Off users. Lunala can paralyze Imposter users, but Hex variants require an Imposter-proof teammate like Imposter Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Pheromosa": {
    "sets": {
      "Choice Band": {
        "description": "<p>Pheromosa has one job on most teams: be the fastest thing on the field and fire off very strong U-turn. This allows it to both force out dangerous offensive threats and grab momentum at the same time. Sword of Ruin kicks up Pheromosa's power and makes it a decent supporting wallbreaker for an ally like Mega Garchomp. Glacial Lance chunks Dragon-types like Eternatus and Giratina for solid damage. Knock Off cuts into the longevity of most physical walls by removing their Leftovers and Heavy-Duty Boots, making it easier for an ally to pick them off; in addition, removing Covert Cloak opens these up to be poisoned by Mortal Spin. Pheromosa's best fit is on offense teams that are looking for a reliable way of scaring out fast threats that Imposter isn't very reliable into, like Ultra Necrozma and Ash-Greninja. Pheromosa lacks the power to beat Fur Coat users by itself, so another physical wallbreaker like Mega Garchomp is mandatory for it to be useful. Imposter-proof Pheromosa with bulky physical walls that don't mind Knock Off, like Fur Coat Arceus-Ghost.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Celesteela": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Celesteela utilizes its excellent defensive typing to act as a reliable pivot capable of soft checking numerous threats, including Mega Garchomp, Flutter Mane, Tidy Up Arceus-Ground, and Take Heart Arceus formes. Knock Off provides excellent utility, nullifying offensive threats by removing items like Life Orb and Choice Specs while relieving defensive Pokemon of items like Covert Cloak and Leftovers. Stone Axe helps reduce Celesteela's passivity by providing entry hazard support for teammates. Salt Cure deters Pokemon like Take Heart Arceus formes from using Celesteela as setup bait, and it deals good chip damage to Imposter users. Doom Desire is an option to support offensive teammates against walls like Mega Audino. Beak Blast punishes moves such as U-turn and deters moves like Bolt Strike and Electro Drift. Even with Assault Vest, Celesteela's natural bulk is only decent, so it requires sturdy teammates like Ice Scales Mega Audino and Ho-Oh to pivot into to help against powerful wallbreakers like Choice Specs Flutter Mane and Mega Alakazam. Celesteela's typing also leaves it vulnerable to threats like Miraidon and Fire-type coverage from Pokemon such as Eternatus, making walls like Magic Guard Blissey desirable teammates. Imposter users also pair well with Celesteela to defeat Take Heart Arceus formes after they have been hit by Salt Cure. Imposter-proofing Celesteela can be annoying, with Take Heart Arceus formes and Magic Guard Pokemon that do not mind losing their item being decent options to do so.</p>"
      },
      "Fur Coat": {
        "description": "<p>Fur Coat Celesteela acts as a decent physical wall for teams looking for a Ground immunity while soft checking Ash-Greninja and non-Mold Breaker Koraidon. Teleport brings in dangerous wallbreakers safely. Beak Blast, if it successfully burns, instantly kills any physical wallbreaker's hopes of dealing damage except mixed attackers with Electro Drift; it also outdamages Jungle Healing from Mega Garchomp. Knock Off annoys defensive switch-ins like Mega Audino by removing items like Covert Cloak, while Salt Cure can help rack up large amounts of passive damage and more directly threatens Imposter users. Stone Axe capitalizes on the switches Celesteela often forces by virtue of its typing by setting entry hazards, but it's notably worse against Imposter users. Recover provides reliable healing in the face of wallbreaker + Strength Sap blocker structures, while Strength Sap has higher burst healing against some teams, is easier to Imposter-proof, neutralizes Mega Garchomp, and helps versus Ash-Greninja. Rocky Helmet helps wear away at physical attackers without needing entry hazard support and throttles Ash-Greninja into spamming Wicked Blow, while Covert Cloak shuts off Salt Cure's crushing passive damage. Physical wallbreakers like Mega Garchomp appreciate Celesteela Imposter-proofing them and blocking Mortal Spin to keep hazards on the field to increase the odds of KOs. Celesteela can be vulnerable to Bolt Strike or Electro Drift users like Mega Lucario and mixed attackers like Ultra Necrozma, so sturdy walls to them like Miraidon and Ice Scales Arceus-Ground makes for good partners. Imposter-proof Celesteela with a Magic Bounce user, a Magic Guard user not deterred by burns or Knock Off like Arceus-Ghost, or a RegenVest user like Primal Kyogre.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Blacephalon": {
    "sets": {"Adaptability": {"description": "<p>Blacephalon is an incredibly threatening mixed wallbreaker. Choice Scarf makes Blacephalon effective speed control and grants a jump on Imposter users, while Life Orb boosts Blacephalon's damage to absurd levels, allowing V-create to potentially OHKO Arceus. Volt Switch lets Blacephalon act as an offensive pivot and chip checks like Ho-Oh and Mega Audino. Blue Flare cleanly 2HKOs Fur Coat Mega Audino. Trick can cripple defensive walls on teams where Choice Scarf isn't necessary. Strength Sap provides crucial longevity on Life Orb sets. Blacephalon being severely frail means slow pivots like Ho-Oh and Mega Swampert are required; weakness to Stealth Rock is also a critical flaw that makes reliable entry hazard removal options like Mortal Spin Ho-Oh and Primal Kyogre crucial. Imposter-proof Blacephalon with Fur Coat or Ice Scales users resistant to the other attacking side's move, such as Mega Audino, and Mega Swampert.</p>"}},
    "credits": {"writtenBy": [{"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}]}
  },
  "Melmetal": {"sets": {"RegenVest": {}}},
  "Zacian": {
    "sets": {
      "Defensive": {
        "description": "<p>Zacian's niche lies in its excellent Speed, allowing it to outspeed threats like Ash-Greninja, Flutter Mane, and Ultra Necrozma and thus check them better than its competition like Arceus-Fairy. Fur Coat lets Zacian check threats like Ash-Greninja and Mega Garchomp, while Ice Scales lets it soft check Flutter Mane and Ultra Necrozma. Strength Sap is generally preferred for its higher healing output and useful Attack drops, but Shore Up can be used on Ice Scales sets to more reliably heal against low Attack Pokemon such as Mega Alakazam and Flutter Mane. Magical Torque's higher damage output is useful against Pokemon like Mega Garchomp and Mega Alakazam, but Spirit Break is more effective to stave off boosting special attackers like Nasty Plot Flutter Mane and non-Poison-type move Eternatus. Glare and Topsy-Turvy both serve as tools against setup, with the former more effective and disruptive but also more difficult to Imposter-proof and useless against Flare Boost Flutter Mane. Spikes and Stone Axe help reduce Zacian's passivity by providing entry hazard support. Leftovers is useful to reduce the frequency that Zacian needs to recover, while Rocky Helmet harshly punishes Ash-Greninja. Ability Shield is a niche choice that improves its matchup against Moongeist Beam and non-STAB-boosted Sunsteel Strike users. Fur Coat Zacian can struggle against certain physical attackers like Zacian-C and Mega Lucario, so teammates that can cover them such as Fur Coat Arceus-Electric and Mega Swampert are appreciated. Ice Scales Zacian has trouble with Eternatus and repeated attacks from Mega Alakazam and Flutter Mane, making secondary special walls like RegenVest Primal Kyogre good teammates. Zacian can be Imposter-proofed by Pokemon like Fur Coat Take Heart Arceus formes, Imposter Chansey, and Magic Bounce Ho-Oh.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Zacian-Crowned": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Zacian-C is a decent sweeper, making great use of STAB Sunsteel Strike and its high Speed to find setup opportunities and begin a sweep. V-create can take down Fur Coat Celesteela with a bit of chip damage, but when using Headlong Rush, Zacian-C can take on Primordial Sea Solgaleo and Miraidon and doesn't lower its Speed. Magical Torque helps to deal with Miraidon and Ting-Lu as well as being a great way to revenge kill Mega Sceptile, Ultra Necrozma, and non-Shift Gear Mega Garchomp, while Bolt Strike helps against Ho-Oh and Mega Slowbro as well as Celesteela if not using V-create. Zacian-C struggles to reliably take down some physical walls like Mega Swampert and Celesteela depending on its coverage, so it enjoys having teammates like Choice Band Mega Garchomp, particularly if it uses Tough Claws Electro Drift, and Mega Blaziken that can take them down more reliably; they can also help pivot it onto the field. Zacian-C enjoys having teammates that use Nuzzle or Glare to paralyze Imposter users or Mega Alakazam, which is naturally faster than Zacian-C, as well having a teammate like Ice Scales Mega Audino or Ho-Oh that can help more reliably check Mega Alakazam. Zacian-C can be Impostor-proofed by Mega Swampert, Fur Coat Miraidon, and Mega Slowbro depending on its coverage moves.</p>"
      },
      "Utility": {
        "description": "<p>With blistering Speed outpacing nearly the entire tier, decent bulk, good Attack, and great typing, Zacian-C serves as a good utility Pokemon. Magical Torque and Gigaton Hammer can force switches against opposing offensive foes like Ash-Greninja and Flutter Mane, giving Zacian-C opportunities to set Spikes. The last moveslot can also be switched with either Spirit Shackle, removing Imposter entirely; Knock Off, removing important items from physical walls like Covert Cloak from Mega Slowbro and Celesteela; or Taunt, denying recovery and Spikes from these walls. Most wallbreakers, especially Magic Guard Eternatus, Ash-Greninja, and Koraidon, appreciate Zacian-C setting hazards and blocking Mortal Spin, or the other utility Zacian-C offers such as removing Imposter or items, along with the occasional Imposter-proofing Zacian-C can provide with its typing. Zacian-C's typing means that Eternatus that run Fire-type moves is a problem for it, so a check like RegenVest Primal Kyogre is recommended. Zacian-C's inability to hold Covert Cloak means a Covert Cloak Steel-type like Celesteela can provide additional fortitude against Mortal Spin. Zacian-C can be Imposter-proofed by neutral Fur Coat users or Steel-types with hazard removal like Mega Slowbro or RegenVest Mega Steelix if it's running Spikes or Taunt, Fur Coat Arceus formes holding a Plate if it's running Knock Off, or itself if it's running Spirit Shackle.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}, {"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 589755, "username": "rightclicker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Eternatus": {
    "overview": "<p>Eternatus is one of the most splashable and defining Pokemon in BH, capable of filling offensive and defensive roles through its excellent stat distribution, crucially outspeeding Arceus. Its Poison typing provides a crucial neutrality to Fairy and allows Eternatus to hit some of the most common specially defensive walls like Mega Audino super effectively, while its Dragon typing and naturally high HP allows it to heavily deter Imposter users from switching in. As a result, its Magic Guard set is one of the most defining offensive sets in the metagame, exerting strong pressure while retaining remarkably solid defensive capabilities. It can also serve a more defensive role with sets using Unaware or Regenerator that can blanket check a variety of setup users through its bulk, Speed, and typing that aids against common forms of passive damage, like poison and Thunder Cage. However, Eternatus's Speed leaves it outsped by and vulnerable to several prominent threats like Miraidon and Mega Alakazam. It is also highly reliant on maintaining high HP to retain Dragon Energy's power, which, when combined with its lower initial damage output, reduces its offensive consistency.</p>",
    "comments": "<h3>Other Options</h3> <p>For the Magic Guard set, Final Gambit is a niche alternative on more offensive teams or when coupled with Wish support as an option to clear out special walls for teammates like Mega Sceptile. Secret Sword is another niche alternative over Shell Side Arm or Strength Sap that hits Blissey and Chansey significantly harder and allows use of a stronger Poison-type STAB move like Malignant Chain, but it doesn't offer much else. Mold Breaker lets Eternatus bypass Well-Baked Body and Ice Scales to aid in wallbreaking, but the vulnerability to passive damage cuts into Dragon Energy's power much easier, it provides less defensive value, and Mold Breaker still can't beat Primordial Sea. Regenerator sets, sometimes with Choice Scarf, act as a decent pivot against threats like Mega Blaziken and Ash-Greninja and can provide utility through Spikes and Trick, although its offensive potential is low. A Fur Coat set seems appealing to act as a check to physical attackers like Sniper Ash-Greninja and Mega Blaziken, but it can be overwhelmed by the former after minor chip damage and has a glaring weakness to Mega Garchomp, rendering it mostly outclassed.</p> <h3>Checks and Counters</h3> <p><strong>Paralysis</strong>: Eternatus is very dependent on its Speed to function, making paralysis severely crippling and heavily reducing its offensive and defensive potential.</p> <p><strong>Faster Offensive Threats</strong>: Attackers like Mega Sceptile and Mega Alakazam outspeed and can OHKO Eternatus.</p> <p><strong>Fire-immune Steel-types</strong>: Steel-types with abilities that snuff Torch Song, such as Well-Baked Body or Primordial Sea Solgaleo and Arceus-Steel, are nigh immovable for Eternatus. Notably, Magearna with one of these abilities is immune to all of Eternatus's standard moves.</p> <p><strong>Ice Scales Walls</strong>: Select Ice Scales Pokemon such as Meloetta and Arceus-Ground shrug off Eternatus's attacks and can retaliate with super effective STAB moves, and unlike Blissey, they can safely withstand Shell Side Arm. However, they must hold Covert Cloak to prevent poison, as Arceus-Ground struggles to fit Take Heart, rendering them susceptible to repeated chip damage from entry hazards.</p> <p><strong>Chansey</strong>: Chansey's respectable physical bulk with Eviolite, in contrast to Blissey, allows it to comfortably handle Eternatus and notably deny recovery from Strength Sap.</p>",
    "sets": {
      "Magic Guard": {
        "description": "<p>Magic Guard Eternatus is a setup attacker that is difficult to wear down that differentiates itself from other similar attackers like Mega Sceptile and Miraidon through its ability to easily pressure Fairy-types and Blissey without losing a recovery move. Magic Guard makes Eternatus incredibly difficult to chip down, helping maintain Dragon Energy's power, and it also negates recoil from Life Orb, giving Eternatus a much-needed damage boost. Shell Side Arm seems odd with Eternatus's base 85 Attack, but with the Life Orb boost, it heavily pressures Blissey, an otherwise difficult wall to surmount. Torch Song compresses boosting and coverage for Steel-types like Celesteela in one slot. Strength Sap is the preferred recovery move to keep Eternatus healthy. A Naive nature ensures Eternatus outspeeds the Arceus formes and Ultra Necrozma, and it is opted over a Hasty nature, as it helps against attacks from Pokemon like Mega Blaziken and RegenVest users as well as increasing damage dealt to Imposter users with Dragon Energy.</p> <p>Magic Guard Eternatus fits on a variety of team structures thanks to its splashability. Thanks to Magic Guard, this set fits naturally on entry hazard-resilient teams as a source of offensive pressure, and it works well with other Magic Guard attackers like Mega Sceptile and Ultra Necrozma to overload their shared checks like Fire-immune Steel-types. Eternatus also synergizes excellently with hazard-stacking compositions, as checks like Ice Scales Pokemon cannot hold both Heavy-Duty Boots to negate hazards and Covert Cloak to prevent poison from Shell Side Arm. RegenVest users like Celesteela and Dialga-O pair well with Eternatus by providing Knock Off support against opposing RegenVest users while also checking faster offensive foes like Mega Alakazam and Mega Sceptile that threaten Eternatus. They can also sometimes provide paralysis support against Imposter users, rendering them useless against Eternatus. Blissey and Chansey can provide Wish support to help keep Eternatus healthy and allow it to forgo Strength Sap, and they also limit Strength Sap recovery from opposing Take Heart Arceus formes, helping Eternatus break through them easier. Eternatus also appreciates Knock Off absorbers like the Arceus formes and some aforementioned RegenVest Pokemon, as it is reliant on Life Orb for a significant amount of its damage output. Eternatus can be Imposter-proofed easily by Eviolite Chansey, either with Imposter + Jungle Healing or Heal Bell or with Magic Guard; other options include Fire-immune Steel-types and Take Heart Ice Scales Pokemon like the Arceus formes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589755, "username": "rightclicker"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Dondozo": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Dondozo uses its massive physical bulk and solid typing to check powerful physical wallbreakers including Mega Garchomp, non-mixed Mega Lucario, and Ash-Greninja. Strength Sap is the preferred recovery option to also slow down setup sweepers like Mega Garchomp, but Shore Up cannot be blocked by Magic Bounce or be limited by Pokemon like Blissey. Dondozo's extremely low Speed also makes it a great pivot capable of underspeeding common defensive staples like Parting Shot Mega Audino. Glare cripples all physical attackers excluding Jungle Healing users as well as deterring most special wallbreakers, while Knock Off provides support by removing crucial items like Assault Vest. Stone Axe and Spikes help reduce Dondozo's passivity against Teleport users and Take Heart Arceus formes. Covert Cloak prevents annoying secondary effects from moves like Salt Cure and Mortal Spin, which is valuable because Dondozo can be 2HKOed by coverage moves after slight chip damage; alternatively, Rocky Helmet punishes otherwise safe U-turns and prevents foes like Mega Garchomp from simply PP stalling Dondozo's healing. Dondozo cannot answer mixed threats such as Electro Drift Mega Garchomp, and thus checks to these Pokemon such as Fur Coat Arceus-Ghost are good teammates. Powerful special wallbreakers like Mega Alakazam and Mega Sceptile appreciate the slow pivoting and entry hazards Dondozo provides and in return can offensively Imposter-proof Dondozo. Dondozo can also be Imposter-proofed by Take Heart users and Electric-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Flutter Mane": {
    "sets": {
      "Flare Boost": {
        "description": "<p>Flutter Mane leverages its extremely rare offensive typing, good Speed, and decent Special Attack to be a very threatening wallbreaker and cleaner. Flame Orb + Flare Boost gives it a boost that can't be copied by Imposter users alongside a pseudo-immunity to status and Knock Off's item removal. With a Nasty Plot boost, Moongeist Beam does terrifying amounts of damage to Ice Scales users, having odds of OHKOing Ice Scales Arceus formes after Stealth Rock; Flutter Mane's Speed and power also let it offensively pressure other fast offensive threats, such as Ultra Necrozma and Ash-Greninja. Flutter Mane uses Pain Split, which Imposter users can't utilize effectively, as a burst healing option thanks to its low HP stat, offsetting burn damage and allowing it to beat Magic Guard Blissey one-on-one. Flutter Mane fits on balance and offense teams looking for a powerful special wallbreaker and late-game cleaner. Moongeist Beam ignores Ice Scales but not Assault Vest, making Knock Off users like RegenVest Primal Kyogre great partners. Imposter-proofing Flutter Mane can be done by any specially defensive Normal-type with Haze or Topsy-Turvy, usually Imposter Chansey, which can also trade Knock Off with RegenVest users.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Flutter Mane acts as a dangerous wallbreaker that utilizes its strong STAB combination and stats. Moongeist Beam cuts through Ice Scales, allowing Flutter Mane to bypass traditional special walls like Ice Scales Arceus formes, while Astral Barrage deals more damage to other checks like RegenVest users. Volt Switch grants Flutter Mane the option to pivot out on switch-ins like Primal Kyogre, Ice Scales Mega Audino, and Ho-Oh, while Knock Off allows it to cripple special walls by removing items like RegenVest users' Assault Vests, Ho-Oh's Heavy-Duty Boots, and Blissey's Leftovers. Beads of Ruin is an option over Adaptability to increase Volt Switch's chipping capabilities, but running it means Astral Barrage will no longer 2HKO Imposter users. Flutter Mane appreciates entry hazard support from the likes of RegenVest Mega Steelix, Primal Kyogre, and Mega Swampert, as this allows it to have an easier time threatening 2HKOs on the aforementioned Ice Scales walls like Arceus formes and Primal Kyogre. Flutter Mane necessitates a teammate that can threaten specially defensive Normal-types like Blissey, Ice Scales Mega Audino, and Ice Scales Arceus; this makes mixed attackers like Ultra Necrozma valuable. Imposter-proof Flutter Mane with a specially defensive Normal-type like Imposter Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}, {"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Iron Hands": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Iron Hands's immense physical bulk and typing make it one of the best answers to Ash-Greninja and Mega Lucario. Strength Sap is usually better thanks to its greater recovery and ability to reduce boosts from Tidy Up; however, Recover has a better matchup against Magic Bounce users. Knock Off removes items from common switch-ins like Mega Audino. Mortal Spin works well in combination with Thunderous Kick, poisons Imposter users, and allows Iron Hands to remove entry hazards for teammates like Ash-Greninja. Teleport lets Iron Hands in offensive threats such as Kyurem-B, Mega Lucario, and Ash-Greninja. Rocky Helmet allows Iron Hands to punish Ash-Greninja's Surging Strikes and generally chip wallbreakers like Mega Lucario. Iron Hands can wall most physical threats; however, its Ground weakness necessitates a teammate that can handle Mega Garchomp and Arceus-Ground such as Celesteela or a secondary Fur Coat user such as Arceus-Ghost. Iron Hands is virtually helpless against most Arceus-Ghost sets, so a solid check to it like Mega Audino or Meloetta is useful. Imposter-proof Iron Hands with a Pokemon that can take its utility moves, such as Arceus-Ghost or Mega Audino. Offensive Imposter-proofing with Pokemon such as Ultra Necrozma is also effective.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ting-Lu": {
    "sets": {
      "Defensive": {
        "description": "<p>Ting-Lu leverages its typing, massive defensive stats, and ability to counter Final Gambit Lunala to find use as a reasonable utility Pokemon. Fur Coat allows Ting-Lu to counter threats like Mega Garchomp, Ho-Oh, and Arceus-Ghost. Knock Off forces progress, removing items from foes such as Mega Audino. Salt Cure's residual damage limits Take Heart Arceus formes' ability to set up in front of Ting-Lu and reduces its passivity, while Parting Shot can still deal with Pokemon such as Arceus-Ghost when in combination with a revenge killer like Mega Alakazam. Topsy-Turvy neutralizes setup threats like Arceus-Ghost and Mega Garchomp. Covert Cloak protects Ting-Lu from Mortal Spin and Salt Cure. Ting-Lu best fits on teams looking for a good blanket physical wall and Simple Ghost-type answer. Ting-Lu struggles against Mega Lucario and Ash-Greninja, so backup checks like Fur Coat Celesteela are mandatory. Imposter-proof Ting-Lu with Knock Off absorbers like Arceus formes; Magic Bounce can also be useful against Parting Shot variants.</p>"
      },
      "RegenVest": {
        "description": "<p>RegenVest Ting-Lu leverages its massive mixed bulk, unique typing, and low Speed tier to act as a pivot into several of the tier's special attackers as well as defensive Pokemon to fire off its utility moves. U-turn and Knock Off are staple moves for RegenVest users. Nuzzle is primarily for Eternatus, which is otherwise difficult to punish, but if Ting-Lu can pivot into a revenge killer such as Mega Alakazam or Mega Sceptile, then Salt Cure can be opted for to annoy Take Heart Arceus formes. Stone Axe provides entry hazard support, while Mortal Spin poisons Imposter users and can act as a decent option for hazard removal, especially if paired with Salt Cure. Ting-Lu requires its Assault Vest to switch into any reasonably strong special attack it doesn't resist, so it needs secondary Knock Off absorbers like Take Heart Arceus formes and Imposter users. It is also vulnerable to threats like Flutter Mane, Palkia-O, and Ultra Necrozma with Magical Torque or Mountain Gale, so it appreciates a specially defensive teammate like Ice Scales Arceus-Fairy, and in return Ting-Lu scouts powerful attacks like Psycho Boost and Moongeist Beam. Depending on its moves, Ting-Lu can be Imposter-proofed by Take Heart Arceus formes or Electric-types like Arceus-Electric and Iron Hands.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 652656, "username": "Gambit"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Iron Valiant": {
    "sets": {
      "Pixilate": {
        "description": "<p>With Pixilate, a good offensive typing that lets it hit Imposter users super effectively, and decent stats, Iron Valiant is a decently strong mixed wallbreaker best suited to offensive teams. Boomburst has very high power and Extreme Speed gives Iron Valiant the ability to scare out faster offensive threats. V-create hits Steel-types like Celesteela and Registeel. For the last moveslot: Population Bomb can dent foes like Ice Scales Arceus formes without having Iron Valiant sacrifice itself, Explosion can enable its teammates by removing a key defensive piece, and Pain Split works well with its low HP stat and offsets Life Orb damage. Wallbreakers like Eternatus and Arceus-Ghost appreciate Iron Valiant breaking through slower walls with its mixed capabilities. Iron Valiant struggles against faster walls like Fur Coat Arceus-Fairy, so a teammate that can help deny their recovery like Magic Guard Blissey makes for a good partner. Imposter-proof Iron Valiant with a Fairy resistant Pokemon like Primordial Sea Solgaleo or Arceus-Fire.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Koraidon": {
    "sets": {
      "Choice Band": {
        "description": "<p>Koraidon distinguishes itself from similar Choice Band wallbreakers like Kyurem-B and Mega Garchomp with its high Speed that allows it to revenge kill offensive threats like Ash-Greninja, Stealth Rock resistance, STAB that removes the need for Bolt Strike, and ease of Imposter-proofing. Glaive Rush and Close Combat 2HKO most Fur Coat users after Stealth Rock with Teravolt. Gigaton Hammer smacks Fairy-types that would otherwise stonewall Koraidon's STAB moves like Mega Audino, and U-turn racks up small amounts chip damage, most notably making Mega Slowbro feasible to KO without extensive team support. Wallbreakers like Mega Garchomp and Ash-Greninja that struggle with Celesteela or Fairy-type physical walls appreciate Koraidon threatening these obstacles, and their raw power helps Koraidon in return. Koraidon struggles to actually get OHKOs due to its lower Attack compared to the competition, so chip damage support, Strength Sap blockers, and slow pivoting like Spikes users, Magic Guard Blissey, and RegenVest users such as Mega Swampert make for good partners. Imposter-proof Koraidon with an Arceus forme that isn't weak to any of its moves like Arceus-Ghost or naturally physically bulky Pokemon like Mega Slowbro.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Miraidon": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Miraidon is a resilient wall with strong offensive pressure that can also check Pokemon like Mega Lucario and Ash-Greninja. Torch Song provides coverage against Mega Steelix and boosts Miraidon's Special Attack, potentially facilitating a late-game sweep. Spikes can support Miraidon's offensive teammates and force progress against hard walls like Mega Swampert. Thunder Cage + Torch Song lets Miraidon damage most Steel-types well, making it an effective user of Mortal Spin. Will-O-Wisp threatens to burn offensive threats and some switch-ins like Mega Swampert. Take Heart is another way to boost Special Attack, and also means Miraidon cant be put on a permanent timer once it loses Covert Cloak. Miraidon struggles against Mega Garchomp and mixed attackers like Ultra Necrozma, so Pokemon like Celesteela and Arceus-Ground can pair well with it. Miraidon can be Imposter-proofed by itself in most cases due to Thunder Cage; however, Pokemon like Blissey and the aforementioned Arceus-Ground can Imposter-proof it in emergency situations.</p>"
      },
      "Magic Guard": {
        "description": "<p>With Magic Guard, Miraidon is a powerful wallbreaker that can exploit passive foes relying on Mortal Spin and Salt Cure to deal damage; its typing and Speed also allow it to soft check slower foes like Mega Lucario and Ash-Greninja. Torch Song hits Steel-types like Registeel and Mega Steelix while boosting Miraidon's Special Attack. Thunder Cage traps foes, deals good chip damage to special walls, and is an overall decent high-PP STAB move; alternatively, Volt Switch makes Miraidon a very effective pivot. Dragon Energy, when boosted by Life Orb, becomes a very powerful attack against foes taking chip from Thunder Cage. Strength Sap is a burst healing option that's easy to Imposter-proof and keeps Dragon Energy's Base Power high. Miraidon's ability to heavily chip down special walls makes other special attackers like Choice Specs Flutter Mane good partners; other teammates relying on passive damage such as Salt Cure users also appreciate Miraidon as an offensive Imposter-proofer. Miraidon will never beat Arceus-Ground and struggles against Magic Guard Blissey and specially defensive Mega Swampert, so allies like Ultra Necrozma and Simple Arceus-Ghost are useful. Imposter-proof Miraidon with Ice Scales Arceus-Ground or Magic Guard Blissey; Imposter Chansey can also work, but it's less reliable due to taking chip damage from Thunder Cage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}, {"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}, {"user_id": 548612, "username": "RoFnA"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  }
}