{
  "Gengar": {"sets": [{"name": "Sheer Force + Life Orb"}, {"name": "Trick"}]},
  "Tauros-Paldea-Blaze": {"sets": [{"name": "Bulk Up"}, {"name": "Choice Band"}]},
  "Tauros-Paldea-Aqua": {"sets": [{"name": "Choice Band"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}]},
  "Dragonite": {
    "sets": [
      {"name": "Dragon Dance", "description": "<p>Dragon Dance + Extreme Speed Aerilate Dragonite serves as a powerful offensive threat that can check sweepers like Chien-Pao. Earthquake hits non-Earth Eater Gholdengo and Sand Stream Garganacl, Fire Blast breaks through Fluffy Corviknight, and Ice Beam deals with Hippowdown, Garchomp, and Altaria. Heavy-Duty Boots affords the most longevity, whereas Sharp Beak and Life Orb are better suited for hyper offense teams. Dragonite does tend to struggle to break through bulky Fluffy and Intimidate walls, so it appreciates powerful wallbreakers like Sheer Force Gengar; in return, Dragonite can use Extreme Speed to cover faster offensive threats. Dragonite also appreciates teammates like Corviknight, which can provide Defog support for non-Heavy Duty Boots variants and defensively handle anti-priority users like Queenly Majesty Polteageist.</p> "},
      {"name": "Choice Band", "description": "<p>Choice Band Aerilate Dragonite serves as a potent offensive cleaner and revenge killer, capitalizing on its priority -ate Speed to threaten fast offensive Pokemon like Barraskewda and Chien-Pao. If forgoing recovery, Thunder Punch can help break through Corviknight. For the 4th moveslot, Earthquake is generally best to hit foes like non-Earth Eater Gholdnego and Kingambit, while Fire Blast is an option to break Fluffy Corviknight and Tera Blast chips neutral Fur Coat users like Hippowdown. This set appreciates Rapid Spin and Defog support from the likes of Corviknight and Iron Treads, respectively, which can also pivot Dragonite into offensive threats it normally couldn't switch into. Dragonite pairs up well with wallbreakers like Sheer Force Gengar to help break through physical walls; in return, Dragonite threatens fast offensive threats with Extreme Speed.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 611238, "username": "LordBox"}]}
  },
  "Slowking": {"sets": [{"name": "Defensive Pivot"}]},
  "Blissey": {
    "sets": [
      {"name": "Defensive Wall"},
      {
        "name": "Defensive",
        "description": "<p>With Ice Scales, Blissey is a titanic special wall that checks prominent attackers like Gholdengo and Iron Bundle; Good as Gold is an alternative to stop Taunt users like Chi-Yu, which otherwise take advantage of Blissey. Thunder Wave lets Blissey cripple foes such as Corviknight and Kingambit, which could otherwise switch into it free of charge, while Calm Mind helps Blissey keep up with foes like Nasty Plot Gholdengo, ensuring they do not break past it. Shadow Ball lets Blissey hit Ghost-types like Dragapult and Gholdengo, denying them setup opportunities. Heavy-Duty Boots is preferred to avoid entry hazard chip damage from repeated switch-ins, but Leftovers provides passive recovery. Physically defensive teammates like Fur Coat Avalugg and Flogres help cover the physical attackers that threaten Blissey, like Aerilate Dragonite and Dragon Rush Dragapult. Slow but powerful wallbreakers such as Slither Wing and Ceruledge appreciate Blissey paralyzing offensive foes, giving them more chances to wallbreak.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Gardevoir": {"sets": [{"name": "Tinted Lens"}, {"name": "Prankster"}]},
  "Garchomp": {
    "sets": [
      {
        "name": "Entry Hazard Setter",
        "description": "<p>With good natural bulk, a great typing, phazing, and both Spikes and Stealth Rock, Garchomp is an effective entry hazard setter that also checks common threats like Orichalcum Pulse Ceruledge. Swords Dance is an option over either entry hazard to pressure bulkier teams. Dragon Tail forces switches and potentially create a favorable situation for Garchomp and helps rack up even more entry hazard damage. As Garchomp does not have any reliable recovery, Leftovers is the preferred option to give Garchomp longevity, but Heavy-Duty Boots is great for opposing hazard-stack matchups. Due to Garchomp mainly being an entry hazard setter, it greatly appreciates teammates such as Good as Gold Skeledirge to keep the entry hazards up in the face of Defog and Rapid Spin. Garchomp also works well with offensive threats such as Sheer Force Gengar, as the entry hazards can wear down its checks into KO range. Garchomp struggles to check common attackers like Noivern and Greninja, so secondary checks like physically defensive Clodsire are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 537972, "username": "Codename C.A.T"}]}
  },
  "Hippowdon": {
    "sets": [{"name": "Fur Coat", "description": "<p>Fluffy Hippowdon is a remarkable physical wall thanks to its defensive stats, reliable recovery in Slack Off, and pure Ground typing, letting it check non-Mold Breaker offensive threats like Dragonite, Ceruledge, Kingambit, and Slither Wing. Whirlwind prevents foes like the aforementioned Dragonite from setting up. Rocky Helmet punishes the physical attackers it checks and lets it pseudo-spinblock Great Tusk, Cyclizar, and Iron Treads; alternatively, Leftovers gives it extra recovery without having to waste Slack Off PP. 25 Speed IVs let it underspeed Corviknight, allowing it to punish its Roost with Earthquake. Specially defensive walls like Corviknight, Florges, and Blissey can compensate for Hippowdon's poor Special Defense and check foes like Chi-Yu and Greninja. In return, they appreciate Hippowdon dealing with Ceruledge, Kingambit, and Slither Wing.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Rotom-Wash": {"sets": [{"name": "Choice Scarf"}, {"name": "Nasty Plot"}]},
  "Volcarona": {
    "sets": [
      {"name": "Physically Defensive", "description": "<p>Volcarona's great defensive typing and solid bulk makes it a good defensive pivot for threats such as non-Stakeout Iron Valiant and Slither Wing while checking Iron Bundle and Quaquaval with Desolate Land. Morning Sun gives Volcarona a boosted recovery under Desolate Land, and Will-O-Wisp enables Volcarona to cripple its switch-ins. The 32 Speed EVs allow Volcarona to outpace and burn uninvested Garchomp with Will-O-Wisp. Specially defensive walls like Ice Scales Corviknight appreciate Volcarona's ability to switch into to mixed threats like Iron Valiant. Specially offensive Ghosts like Dragapult and Gholdengo also appreciate Volcarona's ability to spread burns and allow them to utilize Hex at full power. Heavy-Duty Boots is vital for Volcarona's longevity, so it is recommended to pair Volcarona with a Knock Off switchin like Great Tusk or Iron Hands to mitigate the chance of being vulnerable to entry hazards.</p> "},
      {"name": "Fast Support"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 475288, "username": "Tranquility"}]}
  },
  "Greninja": {"sets": [{"name": "Choice item"}, {"name": "Magic Guard + Life Orb"}]},
  "Florges": {
    "sets": [
      {"name": "Defensive"},
      {
        "name": "Defensive",
        "description": "<p>Florges leverages its great defensive typing, high PP recovery move in Wish, and Fur Coat to blanket check physical threats such as Great Tusk, Dragonite, and Iron Valiant. Synthesis gives Florges more recovery PP at the cost of making Wish less safe to use. Calm Mind can turn Florges into a late-game wincon. Leftovers bolsters Florges's recovery, while Heavy-Duty Boots reduces the damage it takes from frequent switches in. Trick + Choice Scarf Florges can cripple foes like Corviknight and set up on them with Calm Mind; however, it forgoes Wish's recovery PP for this. Defensive partners like Ice Scales Corviknight and Toxapex can help Florges by switching into Steel- and Poison-types that threaten it, like Gholdengo and Iron Moth; in return, they appreciate Florges switching into physical attackers like Iron Hands and Roaring Moon for them. Offensive partners like Kingambit and Dragapult appreciate Florges's Wish giving them more chances to wallbreak.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Noivern": {"sets": [{"name": "Choice Specs"}, {"name": "Super Fang"}]},
  "Toxapex": {
    "sets": [{"name": "Prankster"}, {"name": "Ice Scales", "description": "<p>Ice Scales Toxapex utilizes its remarkable special bulk and valuable defensive typing to check offensive threats such as Chi-Yu, Dragapult, Iron Valiant, and non-Mold Breaker Iron Bundle. The combination of Toxic + Haze lets Toxapex shut down and eventually beat setup sweepers that try to overwhelm it such as Dragonite, Ceruledge, and Volcarona. Liquidation pressures Toxic-immune foes like Clodsire and Kingambit. Toxic Spikes is an option to spread status more easily, which works well with Hex users such as Gholdengo and Dragapult. Fur Coat users like Corviknight and Hippowdon can check threatening foes like Great Tusk and Iron Hands for it; Corviknight's Defog also relieves entry hazard pressure from Toxapex if not running Heavy-Duty Boots, while Hippowdon's Stealth Rock works well with Toxapex's poison to spread further passive damage.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Palossand": {"sets": [{"name": "Physically Defensive"}]},
  "Cinderace": {"sets": [{"name": "Heavy-Duty Boots"}, {"name": "Choice Band"}]},
  "Corviknight": {
    "sets": [
      {"name": "Physically Defensive"},
      {"name": "Specially Defensive"},
      {
        "name": "Specially Defensive",
        "description": "<p>Ice Scales Corviknight is a premier specially defensive pivot that can check prominent special attackers like Iron Bundle and Dragapult with its immense bulk and great typing while also providing entry hazard removal. Brave Bird is Corviknight's most consistent attack and 2HKOes or 3HKOes most special attackers, whereas Iron Head avoids recoil. Defog provides entry hazard control, which is very crucial for teams facing hazard-stacking threats like Ting-Lu and Garchomp, while U-turn provides slow pivoting support for offensive teammates. As a result, frail pokemon such as Dragapult, Iron Bundle, and Iron Moth are great teammates, as they appreciate Corviknight's ability to get them in safely. Ice Scales Corviknight struggles against strong physical attackers, so pairing it with a strong physical wall like Avalugg or Hippowdon is recommended. Even with Ice Scales, Corviknight can be susceptible to strong special attacking Fire-types like Chi-Yu and Iron Moth, so Regenerator Garchomp and Ting-Lu make good teammates. Corviknight is prone to having its Defog blocked by Good as Gold, so it's strongly recommended for it to be paired with spinners such as Great Tusk that can remove entry hazards if Corviknight is unable to.</p> "
      },
      {"name": "Physically Defensive", "description": "<p>Making use of Fur Coat to bolster its high Defense and good defensive typing, Corviknight serves as a strong physical wall that can switch into threatening attackers like non-Mold Breaker Great Tusk and Kingambit, and is a Defogger that isn't threatened by common entry hazard setters like Garchomp and Clodsire. U-turn and minimum Speed allow Corviknight to act as a slow pivot, safely bringing in offensive teammates like Volcarona and Dragonite. Corviknight's average Special Defense means that it has a hard time against special attackers, so it benefits from specially defensive teammates like Florges and Blissey. Corviknight also struggles to meaningfully damage Rock- and Steel-type foes like Garganacl and Iron Treads, so teammates like Iron Bundle and Chi-Yu that can handle these Pokemon are appreciated.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 475288, "username": "Tranquility"}, {"user_id": 439018, "username": "Theia"}]}
  },
  "Barraskewda": {"sets": [{"name": "Choice Band"}]},
  "Polteageist": {
    "sets": [
      {
        "name": "Shell Smash",
        "description": "<p>Polteageist is a dangerous setup sweeper and cleaner thanks to Shell Smash, Stored Power, and its excellent Special Attack, allowing it to sweep with a single turn of setup. Giga Drain provides coverage for Ting-Lu and Garganacl, Strength Sap gives Polteageist a way to restore its Focus Sash after chip damage and set up on weaker physical attackers, while Substitute allows for safe setup on status-reliant walls like Blissey. Focus Sash the preferred item to safely ensure Polteageist can use Shell Smash. Polteageist can often struggle to get itself onto the field safely, so it appreciates a slow pivot from Corviknight or Shed Tail Cyclizar who can also facilitate Polteageist's setup with screens or a passed Substitute. Polteageist pairs well with physical wallbreakers like Swords Dance Cinderace that can break through opposing walls. Due to its reliance on Focus Sash, Polteageist needs reliable entry hazard removal like Cyclizar and Great Tusk.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 611238, "username": "LordBox"}]}
  },
  "Hatterene": {"sets": [{"name": "Triage"}]},
  "Meowscarada": {"sets": [{"name": "Choice Scarf"}]},
  "Skeledirge": {
    "sets": [
      {
        "name": "Good as Gold",
        "description": "<p>Good as Gold Skeledirge's great bulk, typing, and movepool make it a decent deterrent to entry hazard removal and excellent status spreader. Will-O-Wisp + Hex spreads chip damage, neuters physical attackers, and gives Skeledirge the most firepower; Roar + Shadow Ball is a more consistent alternative that deters setup and racks up entry hazard chip. Teammates that can reliably set entry hazards long-term such as Fur Coat or Regenerator Garchomp and Regenerator Ting-Lu are great partners, as they greatly appreciate Skeledirge's ability to deter hazard-removing attempts. Pokemon that check the likes of Greninja and Noivern such as Sand Stream Garganacl and specially defensive Desolate Land Volcarona make for great defensive partners alongside Skeledirge. Strong wallbreakers such as Great Tusk and Cinderace appreciate Skeledirge’s ability to keep entry hazards up by preventing Corviknight's Defog—and potentially risk a spinblock against Great Tusk and Iron Treads—allowing them to further pressure the opposing team. 12 Speed EVs let Skeledirge outspeed and either damage or burn Corviknight.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 560990, "username": "BugGoBrrrrrr"}]}
  },
  "Quaquaval": {
    "sets": [
      {
        "name": "Making Waves (3 Attacks + Roost)",
        "description": "<p>Quaquaval provides a decent offensive presence and valuable utility. Its typing in Water / Fighting and Roost allow it to soft check and threaten out foes like Chi-Yu, Roaring Moon, and Iron Moth. It's a solid spinner because it threatens out common entry hazard setters like Great Tusk, Garganacl, and Ting-Lu and spinblockers like Skeledirge and  Gholdengo. Aqua Step or Rapid Spin's Speed boost allows it to outspeed would-be revenge killers such as Noivern and Chien-Pao, which lets Quaquaval potentially clean up late-game. Mystic Water + Primordial Sea provides more offensive presence and works well with Aqua Step for a recoil-less Water-type attack, while Magic Guard lets Quaquaval ignore Life Orb and Wave Crash recoil and lets it comfortably switch into entry hazards to make use of Rapid Spin. Rapid Spin variants pair well with hazard-stacking teammates like Garchomp and Ting-Lu; they also help switch into Desolate Land users like Iron Moth, Volcarona, and Ceruledge that wall Quaquaval, the latter of which can spinblock it reliably.</p> "
      },
      {"name": "Choice Band", "description": "<p>Choice Band Quaquaval is a solid wallbreaker thanks to its high-Base Power STAB moves backed up by a good Attack stat. Primordial Sea amplifies Wave Crash's power to even higher levels, but Sword of Ruin is an option to boost its other attacks, notably 2HKOing defensive Desolate Land Volcarona with Close Combat. Ice Spinner gives it coverage for Dragon-types such as Dragonite. U-turn lets Quaquaval gain momentum, taking advantage of Desolate Land users like Iron Moth, Ceruledge and Volcarona. Because of this, Quaquaval pairs well with teammates that can threaten them like Garchomp, Ting-Lu, and Dragonite; the former two also provide entry hazards to punish foes trying to switch around Quaquaval, while the latter appreciates Quaquaval wallbreaking early-game for it to sweep easier. A Jolly nature can be used to outspeed Slither Wing and neutral-natured Baxcalibur and Great Tusk.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Spidops": {"sets": [{"name": "Sticky Web"}]},
  "Garganacl": {
    "sets": [
      {"name": "Specially Defensive"},
      {"name": "Physically Defensive"},
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Garganacl is great physically defensive wall, able to check many strong attackers such as Aerilate Dragonite, Sword of Ruin Baxcalibur, and Orichalcum Pulse Ceruledge. Salt Cure is Garganacl's main method of damage, as it aggressively accrues chip damage on would-be switch-ins like Corviknight, Iron Treads, and opposing Garganacl. Body Press makes use of Garganacl's high Defense stat, threatening Pokemon such as Kingambit and Chi-Yu, while Stealth Rock takes advantage of the free turns Garganacl gets from switching into Pokemon like Dragonite. Iron Defense can be used alongside Body Press for more safety against Swords Dance users like Ceruledge and Iron Hands. Protect is an option to scout Choice-locked foes and increase the amount of recovery from Leftovers. Since Fur Coat Garganacl is weak to many special attackers such as Iron Bundle, Pokemon that can switch into these threats, such as Ice Scales Corviknight, make great partners. Strong wallbreakers such as Choice Specs Iron Bundle and Baxcalibur are also good teammates, as they greatly appreciate the damage that Garganacl forces onto walls like Ice Scales Corviknight and Fur Coat Iron Hands.</p> "
      },
      {
        "name": "Ice Scales",
        "description": "<p>Ice Scales Garganacl is an excellent specially defensive Pokemon, able to switch into threatening wallbreakers such as Desolate Land Iron Moth, Chi-Yu, and Aerilate Noivern. Salt Cure forces out the many Fire- and Flying-types that Garganacl switches in on, and its passive damage helps wear down the opposing team. Protect eases prediction against Choice-locked Pokemon and pairs well with Leftovers, while Iron Defense makes Garganacl an emergency check to physical attackers such as Aerilate Dragonite. Garganacl is weak to strong Water-types such as Iron Bundle, so teammates immune to Water such as Desolate Land Volcarona are good parters. Physically defensive Pokemon such as Fur Coat Clodsire are necessary teammates, as Garganacl is forced out by physical wallbreakers such as Great Tusk and Iron Hands. Strong offensive Pokemon such as Baxcalibur and Dragonite can take advantage of the damage Salt Cure forces onto defensive Pokemon, like opposing Garganacl and Fur Coat Hippowdon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 450411, "username": "Atha"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Armarouge": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Armarouge is a passable revenge killer that outspeeds naturally fast Pokemon like Cinderace, Noivern, and Chien-Pao, threatening them with its high-Base Power STAB attacks. Moreover, it can clean up late-game easily thanks to Psychic Surge, which protects it from common priority attacks such as Dragonite's Extreme Speed, Slither Wing's First Impression, and Kingambit's Sucker Punch. Trick cripples bulky foes it can't immediately threaten like Blissey, Florges, and Garganacl. Focus Blast hits Chi-Yu and Roaring Moon, while Psyshock 2HKOes Clodsire. Utility moves in Destiny Bond and Will-O-Wisp can also be used, with the former checking setup sweepers like Baxcalibur and Dragonite and the latter punishing switch-ins. Wallbreakers like Greninja can overwhelm shared checks and appreciate Armarouge's Psychic Terrain protecting them from the likes of Ceruledge's Shadow Sneak and Dragonite's Extreme Speed. Armarouge's susceptibility to entry hazards makes teammates like Defog Corviknight and Rapid Spin Great Tusk valuable options.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Ceruledge": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Ceruledge is an incredibly powerful wallbreaker due to its potent offensive typing, boosted Fire-type attacks, and stellar coverage. Shadow Sneak makes up for Ceruledge's lackluster Speed and can finish off faster Pokemon. Solar Blade and Close Combat provide coverage against foes that tank Ceruledge's STAB moves, such as Garganacl, Great Tusk, Chi-Yu, and Roaring Moon. Alternatively, Will-O-Wisp gives up coverage for the ability to cripple switch-ins like Garchomp and Hippowdon. Orichalcum Pulse is the preferred ability due to the Attack bonus, but Desolate Land provides it with some defensive utility by checking opposing Primordial Sea users. Due to Ceruledge's frailty, it appreciates pivoting and entry hazard removal from teammates like Corviknight, Great Tusk, and Iron Treads. Strong special attackers such as Greninja can pair with Ceruledge to break down each other's checks, such as Garganacl and Garchomp and Blissey and Corviknight, respectively.</p> "
      },
      {
        "name": "Choiced Attacker",
        "description": "<p>Ceruledge's sun-boosted Bitter Blade offers a combination of power and longevity scarcely seen in a wallbreaker. Choice Band Bitter Blade 2HKOes the majority of the metagame, while Choice Scarf Ceruledge outpaces Chien-Pao and Cinderace. Close Combat hits Garganacl and Well-Baked Body Steel-types, and Solar Blade hits Great Tusk. Will-O-Wisp cripples many of Ceruledge's switch-ins, such as Garganacl. On Choice Band sets, a Jolly Nature is useful for outpacing opposing Ceruledge and Gholdengo. The additional power offered by Orichalcum Pulse is significant, but Desolate Land can be used to offensively check Barraskewda. Ceruledge's Stealth Rock weakness and lackluster bulk make Defog and pivot support from a teammate like Corviknight very valuable. Great Tusk's offensive presence and Knock Off support greatly complements Ceruledge's own offensive prowess and burn spreading capabilities; defensive cores can quickly crumble under the weight of entry hazards, burn chip, and repeated subjection to Bitter Blade and Headlong Rush. Fast special attackers like Greninja and Noivern help deal with faster threats and Garganacl.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 580548, "username": "Shandeur"}, {"user_id": 546606, "username": "Tanny89k"}]}
  },
  "Kilowattrel": {"sets": [{"name": "Primordial Sea"}]},
  "Tinkaton": {
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>Tinkaton's decent bulk with Assault Vest and incredible defensive typing allow it to pivot into and check special attackers such as Noivern and Gengar. Knock Off is Tinkaton's most important move, as it hits Gholdengo and removes crucial items from common switch-ins such as Corviknight, Skeledirge, and Iron Treads. Skitter Smack lowers the Special Attack of bulky Calm Mind users such as Florges and powerful wallbreakers such as Chi-Yu, allowing Tinkaton and its teammates to more easily handle these threats. Play Rough and Ice Hammer both hit Dragon-types such as Roaring Moon hard; Play Rough also dents Fighting-types such as Slither Wing while Ice Hammer deals huge damage to Garchomp, Dragonite, and Clodsire. Physically defensive walls such as Hippowdon can deal with the physical wallbreakers that threaten Tinkaton, like Ceruledge and Great Tusk, and appreciate it relieving pressure against Greninja. Slower attackers such as Great Tusk, Baxcalibur, and Quaquaval benefit from Tinkaton handling fast revenge killers such as Noivern and Gengar for them.</p> "
      },
      {"name": "Stealth Rock"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 537558, "username": "memesketch"}]}
  },
  "Cyclizar": {
    "sets": [{"name": "Shed Tail", "description": "<p>Shed Tail, Regenerator, and good Speed give Cyclizar a unique role on offensive teams: safely bringing in powerful attackers like Cinderace, Noivern, and Dragonite multiple times per battle. Draco Meteor KOes opposing Cyclizar and picks off weakened foes. U-turn lets Cyclizar pivot out without self-damage, healing from Regenerator to potentially use Shed Tail again later. Rapid Spin and/or Knock Off provide further utility. Choice Scarf + Shed Tail is preferred against Chien-Pao and other fast threats, but Heavy-Duty Boots can be used to avoid entry hazard damage and the Choice lock. Cyclizar benefits greatly from a strong physical wall or Dazzling user to deal with priority attackers like Dragonite; strong attackers like Cinderace and Noivern are valuable for dealing with phazers like Hippowdon, or a Good as Gold user like Skeledirge or Gholdengo can block phazing moves outright.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 546606, "username": "Tanny89k"}]}
  },
  "Orthworm": {"sets": [{"name": "Shed Tail Support"}]},
  "Glimmora": {"sets": [{"name": "Corrosion"}]},
  "Houndstone": {"sets": [{"name": "Surge Surfer"}, {"name": "Choice Scarf"}]},
  "Dondozo": {"sets": [{"name": "Curse"}]},
  "Clodsire": {
    "sets": [
      {"name": "Specially Defensive"},
      {
        "name": "Specially Defensive",
        "description": "<p>With huge HP and Special Defense stats, Clodsire makes use of Ice Scales to serve as a strong special wall, or it can instead function as a versatile support Pokemon that utilizes Prankster to cripple opposing Pokemon and deter setup. Toxic allows Clodsire to wear down opposing walls, while Toxic Spikes punishes switching and and cripples pivoting foes; Poison Jab is a final option to hit Noivern and still spread status. Spikes and Stealth Rock are both good options for additional entry hazards, with Spikes damage stacking with Toxic Spikes poison and Stealth Rock punishing Flying-types switching into Clodsire. Haze is another option that lets Clodsire stop threatening setup sweepers like Volcarona, though it should almost always be run on Prankster variants. Frail offensive teammates like Iron Bundle and Iron Valiant appreciate Clodsire's ability to soak up strong special attacks, and Clodsire appreciates them taking out foes it's too passive to handle on its own. Clodsire also has below average Defense, so it benefits from being paired with physically defensive teammates like Fur Coat Corviknight and Avalugg.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 439018, "username": "Theia"}]}
  },
  "Kingambit": {
    "sets": [
      {"name": "Type Immunity"},
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Kingambit is a dangerous wallbreaker, owing to great base stats and Adaptability. After using Swords Dance, Kingambit threatens the entire tier, including incredibly bulky physical walls such as Fluffy Corviknight and Hippowdon. Sucker Punch picks off faster threats, such as Cinderance and Noivern, making it difficult to check offensively. Life Orb provides the highest damage boost to Kingambit's attacks; alternatively, Black Glasses provides a damage boost without digging into Kingambit's limited healthpool, while Leftovers allows Kingambit to reliably switch in on weaker attacks. Kingambit best fits on offense teams, which appreciate its massive damage output and can provide opportunities for it to switch in safely. Slow pivoting teammates, such as RegenVest Iron Treads and Corviknight, are recommended, as they can safely pivot Kingambit in and also clear entry hazards. 144 Speed EVs are used to outspeed uninvested Corviknight. Kingambit is incredibly threatened by Great Tusk, as it can easily live even boosted hits and threaten to OHKO back, so teammates like Florges and Noivern are appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}]}
  },
  "Great Tusk": {
    "sets": [
      {"name": "Defensive Spinner", "description": "<p>Rapid Spin, Knock Off, and great physical bulk make Great Tusk a fantastic utility spinner. It can check dangerous physical attackers such as Ceruledge, Slither Wing, Kingambit, and Roaring Moon and retaliate with its beefy Earthquake and Body Press. It matches up well against common entry hazard setters like Garganacl and Clodsire, and it threatens spinblockers with Knock Off; Knock Off also augments its teammates' entry hazards by removing Heavy-Duty Boots. Leftovers gives it much needed recovery—especially alongside Regenerator—but Heavy-Duty Boots prevents it from being overwhelmed by the entry hazards it must remove. Teammates such as Blissey and Slowking can cover opposing special attackers that target Great Tusk's lower Special Defense. In return, they appreciate Great Tusk dealing with physical attackers like opposing Great Tusk.</p> "},
      {
        "name": "Wallbreaker",
        "description": "<p>Choice Band Great Tusk is a dangerous wallbreaker thanks to its high-powered STAB moves and either Mold Breaker to bypass Fur Coat or Stakeout for the reliable power against non-Fur Coat targets. Knock Off has no immunities, unlike both STAB options, and removes key items like Leftovers from Corviknight. Ice Spinner breaks through defensive Dragonite and Garchomp with a clean OHKO. Fast specially offensive pivots like Iron Bundle, Dragapult, and Noivern can bring Great Tusk in safely to pressure their specially defensive switch-ins like Toxapex, Clodsire, and Blissey. Defensive pivots such as Corviknight and RegenVest Iron Hands are also good options, as they can switch into faster threats like Iron Bundle and Iron Moth, respectively, which force Great Tusk out. Dragonite and Ceruledge appreciate Great Tusk wallbreaking early-game by threatening Fur Coat users like Corviknight and Garganacl, which lets them clean up late-game more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Scream Tail": {
    "sets": [
      {"name": "Defensive"},
      {"name": "Choice Scarf"},
      {"name": "Pixilate", "description": "<p>Pixilate Boomburst Scream Tail functions as a bulky utility option and a potentially powerful setup threat. With Boomburst, Scream Tail can topple many threats such as Dragonite, Great Tusk, and Roaring Moon, making it far less passive than most walls. Calm Mind lets it serve as a bulky wincon, while Flamethrower deters Steel-types like Gholdengo from switching in and Stealth Rock lets it make progress against foes it cannot threaten like Ice Scales Clodsire. Scream Tail's great matchup into common Dark-, Fighting-, and Dragon-types makes it a great partner for offensive teammates that struggle with those foes, like Iron Bundle, Garchomp, and Iron Treads. Scream Tail struggles with Poison- and Fire-types such as Clodsire and Volcarona, as well as Steel-types if it does not run Flamethrower, so teammates such as Iron Bundle and Iron Treads are appreciated.</p> "},
      {"name": "Defensive", "description": "<p>Defensive Scream Tail serves as an answer to Fighting- and Dragon-types such as Iron Hands and Dragonite. Encore locks Pokemon into moves that they do not want to be locked into, such as Volcarona with Quiver Dance or Morning Sun, Blissey into Soft-Boiled, and Avalugg into Recover. Alternatively, Stealth Rock can be ran if the team needs entry hazard support. Fur Coat is the most common ability, but Regenerator allows it to better check opposing pivots like Iron Hands; alternatively, Prankster Encore can be used to deter opposing setup attempts. Scream Tail serves as a defensive answer to Fighting- and Dragon-types, so Pokemon such as Blissey and Kingambit are appreciated. It is unable to check several common physical attackers like Ceruledge and Kingambit, so secondary physically defensive teammates like Regenerator Iron Hands are appreciated.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 458971, "username": "NoahDeKnight"}]}
  },
  "Slither Wing": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Slither Wing’s massive Attack stat combined with STAB U-turn and First Impression allow it to be a great wallbreaker, revenge killer, and offensive pivot. Earthquake is an option to bash Skeledirge whereas Flare Blitz is better into Corviknight and bulky Fighting resistant foes such as Scream Tail on non-Tinted Lens sets. Tinted Lens is useful for revenge killing Dragonite, and Volcarona with First Impression after minimal chip, Sword of Ruin provides the most power against neutral targets, and Oricalchum Pulse is recommended for Flare Blitz variants. Special wallbreaker partners such as Noivern and Gengar break physical walls that trouble Slither Wing and appreciate Slither Wings's ability to break their checks in return. Slither Wing loves being partnered with bulky pivots such as Chilly Reception Slowking, Corviknight, and Desolate Land Volcarona to get it in safely against the opposing team and start punching holes in defensive cores. Slither Wing tends to invite in Fire-types onto the field, so fire resistant teammates such as Garchomp and Garganacl are appreciated.</p> "
      },
      {"name": "Pivot", "description": "<p>Good natural bulk, useful defensive typing, and an excellent support movepool make Slither Wing a good mixed defense pivot that repeatedly pivots and most notably switches into Ground-types like Great Tusk. Regenerator makes the most of its pivoting ability, but Unaware is an option for deterring setup. Will-O-Wisp allows it to punish switch-ins like Garchomp with a burn. Its massive Attack allows it to use STAB U-turn to maintain momentum while bringing in more offensive teammates like Chi-Yu and Greninja. Even with investment, Slither Wing struggles to check certain physical attackers like Ceruledge and Dragonite, so Pokemon like Garganacl and Corviknight make good teammates. Slither Wing also has difficulty against Fairy- and Flying-types like Scream Tail and Noivern, so it appreciates teammates like Iron Moth and Garganacl that are able to handle them.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 560990, "username": "BugGoBrrrrrr"}, {"user_id": 439018, "username": "Theia"}]}
  },
  "Sandy Shocks": {
    "sets": [
      {
        "name": "Hadron Engine",
        "description": "<p>Hadron Engine Sandy Shocks is a powerful attacker with good STAB coverage and utility in Spikes. Choice Scarf outspeeds major threats like Cinderace, Noiver, Choice Scarf Chi-Yu, and +2 Modest Polteageist, while Choice Specs better pressures opposing walls like Corviknight and Iron Treads. Spikes forces progress even when the opponent has a solid answer to Sandy Shocks, such as Ting-Lu. Sandy Shocks pairs well with strong attackers like Noivern and Gengar, as they take advantage of weakened special walls and Gengar can fire off Terrain-boosted Thunderbolts. Sandy Shocks also appreciates Pokemon that can switch into Ground-type attacks, such as Corviknight, which also gives a slow U-turn to bring Sandy Shocks in safely, and Garchomp, which can also help with stacking entry hazards. Entry hazard removal is particularly helpful, as the Pokemon that usually switch into Sandy Shocks, like Ting-Lu, will often use the opportunity to set entry hazards.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 225217, "username": "SparksBlade"}]}
  },
  "Iron Treads": {
    "sets": [{"name": "Regenerator Pivot", "description": "<p>RegenVest Iron Treads is a great specially defensive pivot and spinner. It is able to switch into prominent special attackers such as Gholdengo and threaten them out. Knock Off removes key items like Heavy-Duty Boots and deters spinblockers from switching in, and Volt Switch has excellent synergy with Regenerator. If its teammates already provide adequate entry hazard control, Iron Head and Ice Spinner are options to target Scream Tail and Dragonite, respectively. A Sassy nature with minimum Speed investment ensures the slowest possible pivot with Volt Switch. Iron Treads appreciates physically defensive teammates like Slowking, which can form a VoltTurn core to bring in powerful-but-frail teammates like Noivern and Cinderace.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 220859, "username": "Giagantic"}]}
  },
  "Iron Moth": {
    "sets": [
      {"name": "Offensive", "description": "<p>Iron Moth is a powerful special attacker that also provides good defensive utility thanks to Desolate Land and Morning Sun. Its near-unique offensive typing lets it threaten common walls like Corviknight and Scream Tail, especially when boosted by sun. U-turn can be used to maintain momentum against predicted switch-ins like Garchomp and Garganacl, while Toxic Spikes punishes switch-ins with status. Iron Moth complements Corviknight and Clodsire, as it covers their vulnerability to Primordial Sea Greninja. Pokemon like Kingambit and Dragonite appreciate Iron Moth taking advantage of their Steel-type checks like Corviknight.</p> "},
      {"name": "Specially Defensive", "description": "<p>Specially defensive Iron Moth uses its solid bulk, good defensive typing, and sun-boosted Morning Sun to consistently check foes like Volcarona and some Gholdengo variants. It's not entirely passive either, as the boosts from Fiery Dance under sun allow it to eventually overwhelm passive foes like Blissey, Scream Tail, and Florges. U-turn lets it gain momentum by pivoting out safely, and Toxic Spikes punishes grounded foes like Garganacl, Ting-Lu, and Iron Hands. Due to its devastating Ground weakness, Ground-immune Pokemon like Corviknight and Dragonite make good pairings with it. Iron Moth works well with wallbreakers like Great Tusk and Iron Bundle, as they appreciate being given free entry to threaten its switch-ins like Clodsire, Ting-Lu, and Garganacl. Iron Moth is a great complement to special walls like Corviknight and Clodsire, as it covers their type weaknesses.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}, {"user_id": 450411, "username": "Atha"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Baxcalibur": {
    "sets": [
      {"name": "Setup Sweeper"},
      {"name": "Setup Sweeper", "description": "<p>Baxcalibur is a powerful setup sweeper thanks to its great stats and fantastic STAB coverage. Dragon Dance patches up its below-average Speed to facilitate a late-game sweep, while Swords Dance is better suited for wallbreaking and cleaning up with Ice Shard. Earthquake is the preferred move on Dragon Dance sets to hit Iron Hands and Garganacl. Heavy-Duty Boots preserves Baxcalibur's bulk to make setup easier. Baxcalibur fits best on balance and bulky offense teams that appreciate its ability to both wallbreak and sweep. It pairs well with other strong wallbreakers such as Orichalcum Pulse Ceruledge, as they can overwhelm their shared checks. Special attackers such as Iron Bundle and Chi-Yu are good partners, as they threaten out the physically defensive Pokemon that can give Baxcalibur trouble.</p> "},
      {
        "name": "Wallbreaker",
        "description": "<p>Choice Band Baxcalibur is a threatening attacker that overwhelms common walls such as Hippowdon and Great Tusk with its powerful STAB moves, especially with Ice's vaunted offensive coverage. Ice Shard threatens many offensive Pokemon like Noivern, Sandy Shocks, and Great Tusk. Earthquake threatens the Steel- and Fire-types that resist Baxcalibur’s STAB moves such as Gholdengo and Skeledirge. Choice Band Baxcalibur fits best on bulky offense teams that appreciate its ability to force damage on walls for its teammates. Its weakness to Stealth Rock makes entry hazard removers like U-turn Corviknight, Iron Treads, and Great Tusk great teammates. Other physical attackers such as Ceruledge are good partners, as they can overload common physically defensive Pokemon such as Skeledirge. Special attackers such as Iron Valiant and Iron Bundle also make good partners, as they can threaten the physically defensive Pokemon that Baxcalibur has trouble breaking.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Gholdengo": {
    "sets": [
      {"name": "Choiced Attacker"},
      {"name": "Defensive Nasty Plot"},
      {"name": "Offensive Nasty Plot"},
      {
        "name": "Defensive Nasty Plot",
        "description": "<p>Gholdengo's incredible typing, great stats, and setup potential make it a potent wincon with plenty of defensive utility. With Fur Coat-boosted bulk or the immunity granted by Earth Eater or Well-Baked Body, Gholdengo can switch into foes like Aerilate Dragonite, Iron Moth, and Clodsire and can set up with Nasty Plot to wallbreak. Earth Eater and Well-Baked Body may also surprise the opponent, allowing Gholdengo to set up in key situations and gain a winning advantage. Alternatively, a set with Hex + Thunder Wave + Substitute lets Gholdengo make the most of advantageous situations and avoid having to switch out as often. To dually punish switches and remain healthy, Gholdengo should be paired with teammates that can set entry hazards and provide Defog support, like Ting-Lu and Ice Scales Corviknight, respectively. For immediate power, wallbreakers like Sheer Force Dragapult and Iron Valiant and Choice Band Baxcalibur and Great Tusk are excellent partners. Dragapult is a notably good partner, as it shares the same checks with Gholdengo, forming a core that can overload most special walls.</p> "
      },
      {
        "name": "Choiced Attacker",
        "description": "<p>Choice item Gholdengo uses its excellent typing and stats to frustrate offensive teams and Trick to cripple its defensive checks. Choice Scarf outspeeds key threats like Dragapult, Iron Bundle, and +1 Dragonite and neutral natured Baxcalibur, while Choice Specs puts more pressure on defensive teams. Regenerator allows Gholdengo to function as an offensive pivot and repeatedly check foes like Baxcalibur, while Good as Gold deters Defog attempts from Corviknight. Trick cripples most walls—such as Corviknight— by giving them a Choice Scarf or Choice Specs, making them much less effective at doing their jobs. Nasty Plot is a great option after using Trick, while Recover fits on the Good as Gold and Earth Eater variants. Gholdengo finds itself at home on balance and offense teams that can utilize its many helpful traits, such as preventing Defog and crippling specially defensive walls. Entry hazard setters like Ting-Lu pair well with Gholdengo, and other special attackers like Iron Bundle and Dragapult capitalize on Gholdengo taking out the opposing walls.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 450411, "username": "Atha"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 225217, "username": "SparksBlade"}]}
  },
  "Chien-Pao": {
    "sets": [{"name": "Choice Band", "description": "<p>Choice Band Chien-Pao is a threatening wallbreaker thanks to its high Speed and decent STAB coverage that hits common physically defensive walls like Gholdengo and Hippowdon. Sucker Punch picks off faster offensive threats such as Barraskewda and common Choice Scarf users; alternatively, Ice Shard is weaker but hits Roaring Moon super effectively. Sacred Sword beats Steel-types like Kingambit and bypasses Garganacl's Defense boosts. Chien-Pao's best fit is on balance teams that can provide it with safe switch-ins and take advantage of the holes it creates. Noivern and Ceruledge are recommended teammates, as both can help Chien-Pao beat the incredibly troublesome Dondozo and Toxapex. Corviknight and Iron Treads are both good teammates thanks to their ability to pivot Chien-Pao in safely, in addition to clearing Stealth Rock.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}]}
  },
  "Ting-Lu": {
    "sets": [
      {"name": "Specially Defensive", "description": "<p>Ting-Lu's absurd mixed bulk and unusual typing make it a formidable mixed wall, capable of checking several key threats such as Kingambit, Ceruledge, and Iron Moth. Ting-Lu's best entry hazard depends on its team, as it can form a strong hazard-stacking core with Stealth Rock and/or Spikes setters like Garganacl and Glimmora. Ruination spreads consistent damage, especially against Ground-immune foes like Dragonite and Noivern, and forces defensive Pokemon like Corviknight, Hippowdon, and Blissey to waste their recovery PP. Whirlwind forces entry hazard damage onto foes and ensures Ting-Lu isn't setup fodder for threats like Dragonite and Earth Eater Gholdengo. The Speed IVs let it underspeed Corviknight to punish its Roost with Earthquake. Foes like Scream Tail and Focus Blast Gengar can endanger Ting-Lu by targeting its weaknesses, so Corviknight is a good teammates that also provides Defog.</p> "},
      {"name": "RegenVest Wall", "description": "<p>Ting-Lu's excellent defensive stats and useful typing let it check a plethora of special attackers such as Gengar, Iron Moth and Gholdengo. Throat Chop lets it beat all Boomburst users and Ground-immune Gholdengo. Ruination + Sand Tomb traps and eliminates opposing Ting-Lu and Skeledirge, while also draining recovery PP from Hippowdon and Blissey. Some special attackers like Scream Tail can prove dangerous, so pairing Ting-Lu with Corviknight and Desolate Land Iron Moth are good options. Ting-Lu can switch into weaker physical attackers like Roaring Moon, but it should be used as help for the main physical wall on the team. Ting-Lu is vulnerable to opposing setup sweepers, so teammates like Unaware Corviknight are greatly appreciated. Corviknight can also reduce its weakness to entry hazards.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 375662, "username": "Isaiah"}, {"user_id": 430518, "username": "Lunaflare"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 345494, "username": "PociekMociek"}]}
  },
  "Chi-Yu": {
    "sets": [
      {
        "name": "Choice Item Attacker",
        "description": "<p>Chi-Yu's strong base stats and excellent STAB coverage make it a flexible offensive threat. Choice Specs provides maximum wallbreaking power, notably allowing it to OHKO Ice Scales Corviknight and physically defensive Ting-Lu with Desolate Land + Overheat, whereas Choice Scarf gives it the Speed to clean late-game and chase out faster threats like Dragapult and Chien-Pao. Desolate Land provides the most damage amplification and comes with an immunity to Water, whereas No Guard enables Chi-Yu to liberally spread burns with Inferno. Psychic is useful coverage to hit Clodsire and Iron Moth super effectively; alternatively, Will-O-Wisp allows Desolate Land sets to reliably spread burn, however Chi-Yu's poor bulk means it can be dangerous to use. Chi-Yu's best fit is on balance and offense teams that appreciate its high damage output, as well as its good matchups against common special walls like Ice Scales Corviknight and RegenVest Iron Treads. Bulky pivots, like the aforementioned Corviknight and Iron Treads, make particularly good Chi-Yu partners because both can clear entry hazards, particularly Stealth Rock.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Thanks to its high Special Attack and decent Speed, Chi-Yu is a potent wallbreaker that makes use of Nasty Plot and its unresisted STAB combination to tear through common walls like Ice Scales Corviknight, Garganacl, and Florges. Chi-Yu generally prefers to run Heavy-Duty Boots to avoid entry hazard damage, but Life Orb can be run on Sheer Force sets for extra power. Chi-Yu also has several Fire-type STAB moves to choose from: Fire Blast is the most powerful, Flamethrower is the most consistent option, and Inferno is used on No Guard sets to punish switch-ins like Garganacl and Ting-Lu with a burn. Chi-Yu does struggle against special walls like Clodsire and Blissey, so physically offensive Pokemon like Iron Valiant and Iron Hands make good teammates. Chi-Yu is also physically frail, so it appreciates teammates like Corviknight and Avalugg that can switch into strong physical attacks and Wish passers like Florges and Scream Tail that can help it stay healthy.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 439018, "username": "Theia"}]}
  },
  "Roaring Moon": {
    "sets": [{"name": "Choice Scarf", "description": "<p>Roaring Moon's Dragon / Dark typing and high special bulk enable it to switch into Gholdengo, Chi-Yu, Iron Moth, and other special attackers, setting it apart from other offensive pivots like Greninja and Iron Moth. Earthquake forces out Ground-weak Pokemon like Iron Moth and Kingambit. Iron Head and Stone Edge target Florges and Noivern, respectively. Roaring Moon fits best on teams in need of a pivot with both longevity and a Speed tier that exceeds the likes of Chien-Pao and Barraskewda. Roaring Moon struggles to break past physically defensive foes like Great Tusk and Iron Hands, so it appreciates having strong special attackers such as Armarouge and Gengar as teammates. Steel-types like Corviknight and physical walls like Great Tusk are great for patching up Roaring Moon's defensive blind spots.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 546606, "username": "Tanny89k"}]}
  }
}