{
  "Ninetales-Alola": {
    "sets": {
      "Snow Setter": {
        "description": "<ul> <li>Alolan Ninetales is the premier snow setter due to its Speed tier and utility. It enables offensive structures that flourish with Aurora Veil support, reducing damage from opposing Pokemon.</li> <li>Alolan Ninetales runs Freeze-Dry in order to force super effective damage on prominent Water-types like Ogerpon-W.</li> <li>Icy Wind is a strong speed control option that allows Alolan Ninetales and its teammates to outpace Chien-Pao and Ogerpon formes. Blizzard can be brought over Icy Wind as a stronger STAB option, allowing it to guarantee a OHKO on Landorus.</li> <li>Encore allows Alolan Ninetales to deter setup from Pokemon like Calm Mind Raging Bolt and bulky Swords Dance Ogerpon-W, which is normally threatening for Alolan Ninetales and its teammates, as well as locking opposing Pokemon like Incineroar and Iron Hands into Fake Out. Moonblast is a secondary STAB option that allows it to hit Incineroar for neutral damage and Chien-Pao for super effective damage. Protect can be chosen to aid Alolan Ninetales in preserving itself to reset snow later.</li> <li>The bulk investment on Alolan Ninetales allows it to survive two Hard Stone-boosted Diamond Storms from Adamant Diancie when behind Aurora Veil and Ivy Cudgel from Ogerpon-H and Ogerpon-C without Aurora Veil support.</li> <li>The Speed and Special Attack investment allows Alolan Ninetales to outspeed and OHKO Landorus with Blizzard or Freeze-Dry.</li> <li>Tera Ghost is the premier Tera type on Alolan Ninetales due to the Fake Out immunity, allowing it to drop Protect and ensure that Aurora Veil is set up, while also providing a Fighting-type immunity from threats like Iron Hands and a resistance to Glimmora's and Landorus's Sludge Bombs.</li> <li>Teams with Alolan Ninetales often play very offensively, benefitting from the extra bulk that its Aurora Veil provides by enabling setup threats like Raging Bolt, Galarian Moltres, and Kingambit. Kyurem is often Alolan Ninetales's best partner, as it benefits from the snow's Defense boost and an accurate Blizzard.</li> <li>Alolan Ninetales appreciates a strong Fake Out user, like Iron Hands or Incineroar, to allow it to set up Aurora Veil more freely.</li> <li>Alolan Ninetales appreciates Landorus, Iron Hands, Ogerpon-W, and Okidogi because they can offensively threaten prolific Steel- and Fire-types such as Gholdengo, Ogerpon-H, and Incineroar, which check Alolan Ninetales.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617069, "username": "LogIce"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509849, "username": "waffle2O2O"}, {"user_id": 553122, "username": "gephicka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Moltres-Galar": {"sets": {"Nasty Plot": {"description": "<p>The speed investment allows Moltres-G to outspeed Max Speed Booster Energy Gouging Fire and Choice Scarf Landorus-T in Tailwind.</p>"}}},
  "Dragonite": {
    "outdated": true,
    "overview": "<p>Thanks to the sheer power of Tera Normal Extreme Speed, Dragonite is one of DOU’s biggest threats, threatening to KO a large portion of the metagame. Dragonite also has excellent coverage, allowing it to hit any Pokémon that aren't afraid of Extreme Speed, such as Gholdengo and Iron Treads. Dragonite’s Dragon/Flying allows it to take attacks such as Chi-Yu's Heat Wave and Palafin's Jet Punch while also granting it immunity to Earthquakes from Garchomp and Great Tusk. Tera Normal also allows it to survive threatening Dragon- and Ice-type attacks. Inner Focus lets Dragonite avoid Attack drops from Intimidate and flinches from Fake Out. Dragonite is most commonly paired with Chien-Pao, as Sword of Ruin lowers the Defense of foes, allowing Extreme Speed to deal more damage. This pairing is preferred by offensive teams but can fit on other archetypes appreciate Dragonite's power and priority. Due to Dragonite's heavy dependence on Extreme Speed, Pokemon that can block priority moves such as Farigiraf, Tsareena, and Indeedee-F limit its effectiveness. Dragonite also struggles against Pokémon with high physical bulk that can take an Extreme Speed and threaten it in return such as Great Tusk, Iron Hands, Amoonguss, and Garganacl. Additionally, Dragonite is greatly hindered by Stealth Rock, which nullifies Multiscale and limits its longevity.</p>",
    "comments": "<h4>Other Options</h4> <ul> <li>Life Orb can be used on offensive teams that need Dragonite to be capable of switching moves while still dealing lots of damage.</li> <li>A mixed Life Orb set with Hurricane is a viable set on rain teams. Life Orb or Sharp Beak allows Dragonite to threaten an OHKO on Amoonguss.</li> <li>Iron Head Dragonite is useful on teams that want increased damage against Fairy-types such as Grimmsnarl and Sylveon.</li> <li>Running an Assault Vest on Dragonite gives it more bulk and allows it to switch between moves at the cost of decreasing its offensive presence.</li> <li>Weakness Policy Tailwind Dragonite can use Multiscale to tank a hit and leverage speed control while dealing increased damage.</li> </ul>",
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Extreme Speed allows Dragonite to KO opposing priority users such as Murkrow and Palafin before they can move.</li> <li>Dragon Claw gives Dragonite a strong STAB move in positions where using Extreme Speed is undesirable. It also threatens an OHKO on opposing Dragonite and Garchomp.</li> <li>Ice Spinner allows Dragonite to remove the priority-blocking Psychic Terrain, threaten an OHKO on opposing Dragonite and Garchomp, and hit the many Ground-types in the tier super effectively.</li> <li>Alternatively, Facade allows Dragonite to avoid the damage reduction from being burned and is boosted by Tera Normal.</li> <li>One of Fire Punch, Stomping Tantrum, or Earthquake is wanted to damage Steel-types. Fire Punch allows Dragonite to hit Grass- and Ice-types such as Amoonguss, Abomasnow, and Chien-Pao, while Earthquake allows it to hit Rock-, Electric-, and Fire-type Pokemon such as Glimmora, Iron Hands, and Armarouge. Earthquake is most useful on teams with teammates that are immune to Ground-type attacks.</li> <li>The given EV spread maximizes Dragonite's damage and bulk, as it does not need to invest in Speed thanks to Extreme Speed's priority.</li> <li>Multiscale can be used over Inner Focus on teams that want additional bulk and have a method of entry hazard removal.</li> <li>Choice Band lets Dragonite focus on spamming Extreme Speed and boosts its damage immensely.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 554572, "username": "Lemurro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 586432, "username": "big pichu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Mew": {"sets": {"Support": {}}},
  "Porygon2": {"sets": {"Trick Room": {"description": "<ul> <li>This EV Spread survives two Deoxys-A Expanding Forces in Psychic Terrain, as well as two Iron Hands Drain Punches.</li> </ul>"}}},
  "Entei": {"sets": {"Choice Band": {}}},
  "Tyranitar": {"outdated": true, "sets": {"Bulky Attacker": {}}},
  "Pelipper": {"sets": {"Rain Setter": {"description": "<ul> <li>This EV Spread survives Choice Specs Flutter Mane Moonblast and outspeeds Iron Bundle in Tailwind.</li> </ul>"}}},
  "Torkoal": {"outdated": true, "sets": {"TR Attacker": {}}},
  "Heatran": {
    "sets": {
      "Bulky": {},
      "Assault Vest": {
        "outdated": true,
        "description": "<p>Assault Vest Heatran uses its unique typing and defensive stats to match up well against common special attackers such as Flutter Mane and Gholdengo and threaten them back with its great offensive stats and wide coverage. While Heatran boasts an innately good defensive typing, Tera Grass allows it to turn its common weaknesses to Ground and Water into resistances, letting it match up better against the likes of Landorus-T and Palafin-H. Heat Wave is a spread STAB attack that chips away at foes, notably 2HKOing Amoonguss. Flash Cannon is Heatran's best way of hitting Fairy-types, as it OHKOes Diancie and 2HKOes Flutter Mane. Heavy Slam OHKOes Flutter Mane but is generally less reliable because it can be weakened by Intimidate and does less damage to Diancie and opposing Tera Grass Heatran mirror. Tera Blast hits Water- and Ground-types super effectively once Heatran has Terastallized, notably OHKOing Great Tusk and 2HKOing Bulk Up Palafin-H. Earth Power hits the Fire-types such as Volcanion, Chi-Yu, and opposing Heatran that otherwise resists all of Heatran's attacks. Heatran's base resistances let it take common Fairy-, Ice-, and Steel-type attacks such as Flutter Mane's Moonblast, Chien-Pao's Ice Spinner, and Gholdengo's Make It Rain much better. After Terastallization, Heatran matches up better against Palafin-H, Volcanion, and Iron Hands at the cost of receiving more damage from the aforementioned attacks. Heatran has a lot of defensive responsibilities on most teams, so Terastallization should not be used too frivolously. Heatran commonly finds itself in Fire / Water / Grass cores with Rillaboom and Palafin, as they complement each other offensively and defensively, with Rillaboom eradicating Water-types and Palafin punching through Fire-types. Iron Hands is a common Heatran partner that can pressure Palafin and Volcanion with Wild Charge and Chi-Yu and Tera Dark Kingambit with Drain Punch. Heatran has no form of recovery, so it appreciates teammates that can extend its longevity, such as Cresselia with Lunar Blessing and Amoonguss with Pollen Puff.</p>"
      }
    }
  },
  "Cresselia": {"outdated": true, "sets": {"Trick Room": {"description": "<p>This EV spread survives a Dark Pulse from Timid Choice Specs Chi-Yu.</p>"}}},
  "Whimsicott": {"sets": {"Tailwind Support": {"description": "<ul> <li>This EV Spread outspeeds Timid Glimmora and neutral nature Base 100s such as Chi-Yu.</li> </ul>"}, "Focus Sash Support": {"description": "<ul> <li>This set is more useful for Beat Up support, however if Moonblast is chosen, 36 HP / 220 SpA / 252 Spe can be used to OHKO Chien-Pao with Moonblast.</li> </ul>"}}},
  "Lilligant-Hisui": {"outdated": true, "sets": {"Sun Support": {}}},
  "Amoonguss": {
    "sets": {
      "Redirection Support": {
        "description": "<ul> <li> <p>Amoonguss is the tier’s premier redirector, neutralizing foes with Spore and sustaining its teammates with Pollen Puff. Its defensive prowess, coupled with Regenerator, provides the sustainability to soak up hits while supporting its team. Amoonguss pairs incredibly well with setup attackers such as Bulk Up Palafin-H and Swords Dance Iron Hands, which appreciate its redirection and healing capabilities and make up for its near-nonexistent offensive pressure. While Amoonguss is a great support Pokemon, it struggles against Fire-types like Heatran and Volcanion, and its utility is diminished by Cresselia's Lunar Blessing and Safety Goggles users.</p> </li> <li> <p>As the most consistent sleep user in the tier, Amoonguss's Spore forces switches to powder-immune foes. This is especially powerful in Trick Room, as Amoonguss can utilize its low Speed to render foes immobile before they can act.</p> </li> <li> <p>Rage Powder makes it easier for teammates to use setup moves like Swords Dance and Bulk Up or set field conditions such as Trick Room or Tailwind safely. In addition, it can draw attacks away from frail attackers like Chien-Pao, generating space for them.</p> </li> <li> <p>Pollen Puff heals teammates and damages foes in a pinch, allowing Amoonguss to provide value even during the effects of Taunt.</p> </li> <li> <p>Clear Smog enables Amoonguss to check setup threats like Bulk Up Palafin-H and Belly Drum Iron Hands. Protect is helpful in scouting foes’ moves, blocking Fake Out, and improving overall survivability.</p> </li> <li> <p>244 HP and 136 Special Defense EVs ensure that Amoonguss can take two Shadow Balls from Choice Specs Flutter Mane after Sitrus Berry recovery. The remaining EVs are dumped into Defense.</p> </li> <li> <p>28 Speed IVs let Amoonguss underspeed Iron Hands and Kingambit under Trick Room.</p> </li> <li> <p>Sitrus Berry improves Amoonguss's survivability when redirecting multiple attacks. Rocky Helmet can be used to rack up damage upon redirecting contact attacks such as Palafin-H's Jet Punch and punish U-turn from Rillaboom and Landorus-T.</p> </li> <li> <p>Tera Water turns Amoonguss's weaknesses to Fire- and Ice-type moves from foes such as Volcanion and Chien-Pao into resistances. Tera Dark can be used to improve its matchup against Indeedee-F and Armarouge teams and gain immunity to Prankster Taunt from Tornadus and Grimmsnarl.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 512635, "username": "AIRedzone"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 531334, "username": "zoe"}]}]}
  },
  "Volcarona": {"outdated": true, "sets": {"Quiver Dance": {}}},
  "Tornadus": {
    "sets": {
      "Bulky Tailwind": {
        "description": "<ul> <li>Tornadus takes advantage of a combination of Prankster and Tailwind to set nearly uncontested speed control. This allows it to ensure that its teammates can move first and remove or cripple threats before they can move.</li> <li>Bleakwind Storm allows Tornadus to take on an offensive presence, even after using up all of its support moves.</li> <li>Taunt is the best option for the third moveslot, as it can disrupt the foes' ability to use status moves, effectively crippling support options and ameliorating the risk of a foe setting up or inflicting status. However, priority Rain Dance and Sunny Day can be strong options for teams that are more weather dependent, and they can be beneficial for teams that are afraid of weather by providing the ability to reverse the opponent's weather.</li> <li>Protect allows Tornadus to survive an attack that can potentially KO it or delay setting up Tailwind. This can be particularly useful in Tailwind mirror matches, as setting Tailwind a turn later can allow for an extra turn where your team has Tailwind and the opponent's doesn't. If needed, this slot can be used for weather setting, but losing Protect can make it significantly more difficult for Tornadus to set Tailwind multiple times throughout the match.</li> <li>Covert Cloak allows Tornadus to safely set up Tailwind against Fake Out users such as Rillaboom and Incineroar. Note that Covert Cloak and Tera Ghost should not be used together, since they effectively do the same thing. Sitrus Berry can be used to boost Tornadus's long-term survivability, allowing it to set Tailwind multiple times per match.</li> <li>Tera Steel is an excellent defensive type, and it boosts Tornadus's survivability by giving it a resistance to lethal Ice-type attacks from Chien-Pao and Kyurem as well as common attacks from Pokemon like Gholdengo, Tornadus, Dragonite, and Glimmora. On the other hand, Tera Ghost and Tera Dark both prevent foes from disrupting Tornadus's support options by blocking Fake Out or Prankster Taunt, respectively.</li> <li>Tornadus's bulk allows it to survive significantly more than the other Prankster Tailwind setters. Tornadus needs to maximize its physical bulk in order to survive a Wild Charge from Assault Vest Iron Hands without needing to Terastallize. The physical bulk also allows Tornadus to set Tailwind multiple times per game and allows it to survive physical priority moves that can outprioritize and prevent Tailwind, such as Dragonite's Extremespeed.</li> <li>Tornadus pairs best with offensive threats that have middling Speed. Pokemon such as Gholdengo and Regidrago can take advantage of the boosted speed to outspeed major threats such as opposing Landorus and Chien-Pao.</li> </ul>"
      },
      "Focus Sash": {
        "description": "<ul> <li> <p>Tornadus is the defining Tailwind user in the DOU metagame. Prankster allows Tornadus to set Tailwind with an incredible degree of consistency. This, combined with its high Special Attack and Bleakwind Storm, has made Tornadus a cornerstone in offensive team compositions.</p> </li> <li> <p>Bleakwind Storm allows Tornadus to threaten the metagame's numerous common Grass-types, among them Ogerpon-W and Sinistcha.</p> </li> <li> <p>Running Focus Sash allows maximum investment into Special Attack and Speed. Critically, having maximum Speed enables Tornadus to outspeed and pressure Ogerpon-W and -H.</p> </li> <li> <p>Icy Wind provides another means of speed control. Though normally quite weak, it is able to 2HKO Landorus, one of the most common Pokemon in the metagame. The damage is also significant against the tier's many Focus Sash users, most notably Glimmora, Chien-Pao, and opposing Tornadus, breaking their Focus Sashes while simultaneously dropping their Speed and allowing Tornadus's partner to follow up. This move is most effective against opposing offensive Tailwind-based teams, as stacking both forms of speed control provides the edge against a team with just Tailwind.</p> </li> <li> <p>Taunt shuts down many support-oriented Pokemon entirely, preventing them from using highly disruptive moves like Spore, Trick Room, and Tailwind. Though because of Prankster, it is unable to affect Dark-types such as Incineroar and Ting-Lu and is blocked by Armor Tail and Psychic Terrain.</p> </li> <li> <p>Sunny Day activates Protosynthesis and boosts Fire-type attackers such as Chi-Yu and Ogerpon-H. Similarly, Rain Dance supports Water-types like Ogerpon-W in addition to increasing the accuracy of Bleakwind Storm and Sandsear Storm. Both of these weather options also have utility in disrupting opposing teams, weakening the corresponding typing and blocking weather-reliant effects like Aurora Veil and Swift Swim.</p> </li> <li> <p>Focus Sash's defensive properties allow Tornadus to forgo a defensive Tera type in favor of the utility of the Ghost typing. Tera Ghost's primary value is in evading Fake Out and the less common Extreme Speed, allowing Tornadus to set Tailwind on a critical turn and resume applying offensive pressure afterwards. In practice, however, Tornadus is not a common user of Terastallization, as it's usually more valuable to save it for one of the team's offensive powerhouses.</p> </li> <li> <p>As Tailwind is a common part of many teams, it is not uncommon to have your Tailwind essentially neutralized by a foe setting their own. In these Tailwind mirror matchups, it's often advised to try and offset your own Tailwind by a turn or two with the aim of having the Speed advantage after their Tailwind has ended. Opting to use Icy Wind can also provide an advantage during matched Tailwinds by lowering the Speed of both foes.</p> </li> <li> <p>Tornadus fits best on teams with offensive Pokemon that need their Speed patched up. Landorus, Gholdengo, and Regidrago are all great examples of offensive powerhouses that find themselves outsped by faster threats such as Chien-Pao and Ogerpon formes. Even slow Pokemon like Iron Hands and Ursaluna-B can greatly benefit from partnering with Tornadus. With some Speed investment, they're able to use the Tailwind to outspeed Landorus and Ogerpon-W while also benefiting from Tornadus's ability to check the Grass-types that trouble them both.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 159382, "username": "qrChar"}, {"user_id": 586432, "username": "big pichu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 550367, "username": "Smudge"}, {"user_id": 619632, "username": "Schister"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 391343, "username": "EthanLac"}, {"user_id": 649096, "username": "a blue banana"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Landorus": {
    "sets": {
      "Special Attacker": {
        "description": "<ul> <li> <p>Landorus is one of the strongest offensive Pokemon in the metagame with its powerful Sheer Force- and Life Orb-boosted attacks, which threaten much of the tier for super effective damage, including many metagame staples such as Archaludon, Incineroar, and Raging Bolt. It excels at forcing the opponent into defensive positions, creating opportunities to play aggressively with Landorus and its teammates.</p> </li> <li> <p>Earth Power annihilates targets weak to it and puts massive dents in most neutral targets. Sludge Bomb allows Landorus to hit Grass- and Flying-types such as Rillaboom, Ogerpon-W, and Tornadus, which resist or are immune to its Ground-type moves. Tera Poison elevates Sludge Bomb to a STAB move, which secures the OHKO on Assault Vest Rillaboom, bulky Ogerpon-W, and Alolan Ninetales as long as Aurora Veil is not active.</p> </li> <li> <p>Sandsear Storm gives Landorus the option of a strong spread move, making it even more difficult to play around and preventing foes with Follow Me or Rage Powder from redirecting its attacks. This move is especially potent when used in the rain, as it becomes a 100% accurate spread move, allowing Landorus to reliably apply offensive pressure to both targets simultaneously.</p> </li> <li> <p>Alternatively, Substitute gives Landorus the ability to safely fire off strong Earth Powers and Sludge Bombs while attracting attention to itself, which can supply its teammates with opportunities to set up or attack on their own. Substitute guarantees that Landorus will survive at least one attack while behind it, which it appreciates given its mediocre bulk that ordinarily leaves it vulnerable to getting OHKOed by super effective attacks or getting KOed by priority moves when weakened. Landorus's offensive pressure forces the opponent to switch and use Protect a lot, creating many opportunities for it to set up a Substitute. This is especially true when it is paired with Pokemon that can apply Fake Out pressure such as Rillaboom and Incineroar.</p> </li> <li> <p>While Tera Poison increases Landorus's offensive capabilities, a more defensive route can also be taken with Tera Steel, which turns its glaring 4x Ice weakness into a resistance, allowing it to flip the script on foes that would normally force it out such as Chien-Pao, Kyurem, and Alolan Ninetales. Additionally, Steel is a generally useful defensive typing with many miscellaneous resistances, including ones to common attacks such as Rillaboom's Grassy Glide and Tornadus's Bleakwind Storm, among others.</p> </li> <li> <p>Landorus appreciates teammates that can set up Tailwind such as Tornadus and Whimsicott, as it is naturally outsped and threatened with super effective damage by common Pokemon such as Ogerpon-W, Chien-Pao, and Alolan Ninetales. Effective speed control and positioning can allow Landorus to gain the advantage on these foes and others, making Pokemon that supply redirection support useful teammates as well, including Indeedee-F, Ogerpon-W, and Sinistcha. Teammates that struggle either offensively or defensively against Fire- and Steel-types, such as Gholdengo, Kingambit, and Kyurem, appreciate Landorus's ability to neutralize those threats.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609101, "username": "Iceberg77"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 550367, "username": "Smudge"}, {"user_id": 608134, "username": "bagel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Landorus-Therian": {"outdated": true, "sets": {"Support": {}, "Assault Vest": {}}},
  "Kyurem": {
    "overview": "<p>Kyurem boasts monstrous stats, powerful attacks, and a surprisingly useful typing to act as a terrifying threat in the DOU metagame. Its STAB Ice-type attacks hit common threats and utility Pokemon alike, such as Landorus, Rillaboom, and Tornadus, for super effective damage, and Freeze-Dry forces the format's few Water-types to stay on their toes. Earth Power and Flash Cannon both serve as effective coverage moves to keep Ice- and Dragon-resistant Pokemon at bay. Meanwhile, Ice / Dragon is an excellent defensive typing when combined with Kyurem's natural bulk, allowing it to stand strong in the face of Pokemon like Ogerpon-W. Kyurem's Speed stat, while falling short of the format's faster threats, is still high enough to outrun and threaten Pokemon such as Glimmora and Gholdengo. Kyurem's biggest downfall, however, is its utter reliance on snow. Without the 50% boost to its Defense and perfect accuracy on Blizzard, Kyurem struggles to stand out compared to other juggernauts like Iron Hands and Raging Bolt. In addition, many of Kyurem's checks also have strong matchups against the snow setters of the format, turning Pokemon like Gholdengo, Diancie, and Tyranitar from annoyances into serious threats to the team.</p>",
    "comments": "<h3>Checks and Counters</h3> <p><strong>Incineroar:</strong> Thanks to its natural bulk and Blizzard resistance, Incineroar is often able to switch in on Kyurem and threaten any of Fake Out, Knock Off, and Parting Shot, all of which cut into Kyurem's ability to continue dealing damage.</p> <p><strong>Iron Hands:</strong> Assault Vest Iron Hands is bulky enough to shrug off Blizzard and heal off the damage with Drain Punch, preventing Kyurem from using Blizzard if it wants to threaten it.</p> <p><strong>Steel-types:</strong> Pokemon such as Gholdengo and Kingambit can use their Blizzard resistance and STAB Steel-type attacks to force Kyurem to retreat, which grants them the opportunity to set up or deal heavy damage on their own.</p> <p><strong>Rock-types:</strong> Diancie and Tyranitar both have the bulk to take on Blizzard and the damage to beat Kyurem one-on-one. While it needs speed control, Glimmora can also threaten it with powerful Rock-type moves, especially Meteor Beam.</p> <p><strong>Weather Disruption:</strong> Because Kyurem is so reliant on snow, many teams can use their own weather to combat it. Torkoal and Tyranitar can directly threaten Kyurem, while Pelipper and Tornadus can take away snow at a crucial moment and allow a physical partner to deal full damage to Kyurem.</p> <p><strong>Entry Hazards:</strong> Common Stealth Rock setters like Glimmora and Ting-Lu may not beat Kyurem on their own, but Stealth Rock and Toxic Spikes can cut severely into Kyurem's health, making it less able to take on their teammates.</p>",
    "sets": {
      "Snow Assault Vest": {
        "description": "<ul> <li> <p>Snow and Assault Vest's defensive boosts combine to make Kyurem a juggernaut, capable of taking multiple consecutive hits while dealing heavy damage.</p> </li> <li> <p>Blizzard is Kyurem's most consistent damage option in snow, threatening both powerful attackers like Landorus and Dragonite and common support Pokemon like Tornadus and Sinistcha.</p> </li> <li> <p>Freeze-Dry expands Kyurem's reach and lets it threaten Water-types and Tera Water users like Amoonguss and Iron Hands, hitting Ogerpon-W and Pelipper especially hard.</p> </li> <li> <p>Earth Power becomes necessary to threaten Pokemon that take minimal damage from Kyurem's Ice-type attacks, like Gholdengo, Incineroar, Iron Hands, and Kingambit.</p> </li> <li> <p>Flash Cannon is a powerful tool for hitting opposing Diancie, Alolan Ninetales, and any Pokemon that may use Tera Fairy, such as Gholdengo and Raging Bolt.</p> </li> <li> <p>Glaciate can slot over Freeze-Dry or Flash Cannon, providing a surprisingly powerful speed control move greatly appreciated by the likes of Iron Hands or Kingambit.</p> </li> <li> <p>Draco Meteor is Kyurem's most powerful single attack, though a Dragon-type move is entirely optional on this set, and Draco Meteor's Special Attack drop may make it more difficult for Kyurem to stay in and trade hits with the opposing side.</p> </li> <li> <p>This EV spread lets Kyurem outspeed Timid Glimmora, avoid a 3HKO from Iron Hands's Drain Punch with Aurora Veil in snow, and always 2HKO maximum HP Kingambit with Earth Power.</p> </li> <li> <p>Steel is a potent defensive Tera type against Gholdengo and Glimmora and can provide a power boost for Flash Cannon, but it leaves Kyurem more vulnerable to threats like Iron Hands and Landorus. Tera Fairy is a more general option that flips multiple of Kyurem's weaknesses, turning the tables on Pokemon like Iron Hands and opposing Kyurem, but maintains the Steel weakness.</p> </li> <li> <p>Alolan Ninetales is all but required on teams with Kyurem; Snow Warning giving both a Defense boost and an accurate Blizzard is too good to ignore, and its Aurora Veil lets Kyurem double down on its already incredible bulk.</p> </li> <li> <p>This set greatly appreciates partners with healing capabilities to extend its survivability. Rillaboom and Sinistcha are the most common partners for this purpose, but Pollen Puff users like Amoonguss and Mew can provide the same benefit.</p> </li> </ul>"
      },
      "Snow Choice Specs": {
        "description": "<ul> <li> <p>Choice Specs gives Kyurem a substantial Special Attack boost that it can use to quickly and definitively end games.</p> </li> <li> <p>Choice Specs Blizzard is one of the strongest spread moves currently available in the format, hitting some notable KOs on foes such as Sinistcha that other items cannot.</p> </li> <li> <p>Freeze-Dry cleanly answers Water-type Pokemon that would want to switch in on Blizzard, and Choice Specs helps make up for its lower Base Power.</p> </li> <li> <p>Draco Meteor turns most offensive threats into mush and deals respectable damage to even the bulkiest Pokemon in the format such as Incineroar and Iron Hands.</p> </li> <li> <p>Earth Power hits Steel- and Fire-types, forcing them to make tough decisions about switching in, while Flash Cannon OHKOes Diancie.</p> </li> <li> <p>A Timid nature allows Kyurem to outspeed key Pokemon like Glimmora and Gholdengo, while a Modest nature sacrifices outspeeding those threats in order to maximize damage. Likewise, a little bit of Speed can be dropped from Timid Kyurem for added bulk, but these threats should be kept in mind when doing so.</p> </li> <li> <p>The chosen defensive Tera types enable Kyurem to continue dealing damage; Ghost provides an immunity to Fake Out from Pokemon such as Rillaboom, which is valuable on a Choice item set, but Fairy flips more weaknesses and grants an immunity to moves like Gouging Fire's Breaking Swipe and Raging Bolt's Draco Meteor.</p> </li> <li> <p>Tera Ice can be used to make Blizzard hurt more, and it notably allows Freeze-Dry to OHKO Terastallized Ogerpon-W.</p> </li> <li> <p>Alolan Ninetales is required as a teammate thanks to its Snow Warning ability, but Encore and Icy Wind are particularly useful to keep strong attacks off of Kyurem. Other good teammates include Fake Out users like Incineroar and Rillaboom to create space and more offensive threats such as Landorus to capitalize on Kyurem's damage output.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 27554, "username": "Arcticblast"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 619632, "username": "Schister"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Diancie": {
    "sets": {
      "Trick Room Sweeper": {
        "description": "<ul> <li> <p>Diancie is an effective offensive Trick Room setter due to its low Speed and high Attack, allowing it to punch holes in the opposing team. Its high defensive stats make it very difficult to take out in a single attack and demands whittling it down with multiple neutral attacks instead of super effective attacks, out of fear of activating Weakness Policy.</p> </li> <li> <p>Diamond Storm hits a lot of top threats, notably 2HKOing Chien-Pao, Dragonite, and Volcanion. Gaining Defense boosts from it also helps Diancie against physical attackers such as Rillaboom and Palafin.</p> </li> <li> <p>Body Press synergizes very well with Defense boosts from Diamond Storm, giving Diancie useful coverage to hit foes it would normally have a tough matchup against such as Kingambit and Hisuian Goodra.</p> </li> <li> <p>Trick Room allows Diancie to support itself and its teammates such as Iron Hands and Torkoal by turning their low Speed into an advantage. Diancie is an effective Trick Room setter as it is hard to remove and, unlike other Trick Room setters such as Cresselia, has the offensive capabilities to make the most of it.</p> </li> <li> <p>Foes must always be wary of Weakness Policy, as activating it turns Diancie into a fearsome sweeper. As such, Diancie forces opponents to either OHKO it or whittle it down with multiple neutral attacks, as a weak super effective attack into the bulky Diancie will put it in a commanding position. This is especially effective once Diancie has accrued enough Defense boosts, as even Rillaboom's Wood Hammer and Palafin's Wave Crash may not OHKO it anymore. Diancie can also use Mental Herb to guarantee it sets up Trick Room once against Taunt users such as Tornadus and Landorus-T.</p> </li> <li> <p>Tera Grass allows Diancie to resist the Grass-, Water-, and Ground-type attacks that would otherwise OHKO it before a Defense boost such as Rillaboom's Wood Hammer, Palafin's Wave Crash, and Landorus's Earth Power. It also removes Diancie's 4x Steel-type weakness, which helps it matchup better against Steel-type foes like Heatran and Gholdengo and Pokemon with Steel-type coverage such as Iron Hands. Tera Grass also grants Diancie an immunity to powder moves, preventing Amoonguss's Spore from affecting it and circumventing Rage Powder.</p> </li> <li> <p>Clear Body notably makes Diancie immune to Landorus-T's Intimidate and Grimmsnarl's Parting Shot, allowing Diancie to maintain a constant offensive presence on the field during its valuable Trick Room turns.</p> </li> <li> <p>A Sassy Nature and maximum HP investment allow Diancie to survive a Steam Eruption from Volcanion. 24 Defense EVs allow Diancie to survive a Jolly Ogerpon-Wellspring Ivy Cudgel.</p> </li> <li> <p>Diancie enables Trick Room attackers like Kingambit, Torkoal, and Glastrier to sweep alongside it. Diancie wants Fake Out support to help set up Trick Room more easily. Rillaboom is a Fake Out user that can eliminate Palafin and provide Grassy Terrain recovery, while Iron Hands functions better under Trick Room specifically and deals with Volcanion and Kingambit better. Amoonguss also acts as a great partner for Diancie, with its Rage Powder and Spore protecting it from the Ground, Water, and Steel attacks that would threaten it. Pollen Puff also helps to increase its longevity.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552611, "username": "NinjaSnapple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 550367, "username": "Smudge"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Volcanion": {"sets": {"Assault Vest": {}, "Leftovers": {}}},
  "Incineroar": {
    "sets": {
      "Defensive Pivot": {
        "description": "<ul> <li>Incineroar's combination of Intimidate, Fake Out, and Parting Shot is one of the strongest utility toolkits in the tier, facilitating both defensive and offensive play by maintaining good positioning and increasing the longevity of its teammates. While it is a top-tier supportive piece, Incineroar lacks strong damage output against neutral targets and relies on the teammates it supports to win the game.</li> <li>Fake Out generates free turns for teammates, providing opportunities for a teammate like Kingambit to set up with Swords Dance. Alternatively, it can allow a teammate to safely switch in, take a KO, or use a supportive move like Tailwind or Trick Room.</li> <li>Flare Blitz and Knock Off are strong, consistent damaging options. Flare Blitz offers more immediate damage that can OHKO Chien-Pao and threatens common Pokemon like Gholdengo and Rillaboom. On the other hand, Knock Off adds to Incineroar's utility, removing items like Clear Amulet, Porygon2's Eviolite, and Choice items. With Incineroar's low Speed stat, Parting Shot will often go last, so teammates can enter the field without the risk of being hit.</li> <li>The given EV spread allows Incineroar to survive Volcanion's Steam Eruption and Ogerpon-W's Tera Water Ivy Cudgel after Intimidate. However, Incineroar's EV spreads are extremely flexible depending on the needs of a team, whether it be offensive investment, more defensive EVs, or a higher Speed tier.</li> <li>Tera Ghost stops opposing Fake Out and grants an immunity to Fighting-type moves such as Iron Hands's Drain Punch. Tera Grass flips matchups against threatening  foes such as Ogerpon-W and Landorus and grants a Spore immunity.</li> <li>Incineroar fits easily on any team, but it is quite commonly paired with Rillaboom to have constant Fake Out and repositioning options or Ogerpon-W, which provides redirection support and further adds to the team's defensive capabilities while maintaining a strong offensive presence on its own. Strong attackers such as Landorus,Chien-Pao, and slower, setup-based teammates like Swords Dance Kingambit greatly appreciate Incineroar's utility.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 550367, "username": "Smudge"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 608134, "username": "bagel"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Kommo-o": {"sets": {"Iron Defense": {}, "Clangorous Soul": {"description": "<ul> <li>This EV Spread survives a Chien-Pao Ice Spinner and outspeeds Dragapult after Clangorous Soul.</li> </ul>"}}},
  "Rillaboom": {
    "sets": {
      "Assault Vest": {
        "description": "<ul> <li> <p>Rillaboom is a strong offensive pivot that can threaten large amounts of damage; it also provides Fake Out support for setup users like Kingambit, Gholdengo, and Raging Bolt and creates free turns for Pokemon such as Tornadus and Diancie to use their speed control options.</p> </li> <li> <p>Grassy Glide is a priority option that lets Rillaboom pick up KOs on chipped foes throughout the game and notably 2HKOes Chien-Pao and Ursaluna-B. Wood Hammer 2HKOes foes that do not resist Grass, including bulky Pokemon such as Volcanion, Landorus-T, and Iron Hands, as well as OHKOing non-Defense boosted Diancie and potentially uninvested Landorus.</p> </li> <li> <p>U-turn provides Rillaboom with an opportunity to pivot throughout the game and make heavy use of its support options. This allows it to keep Grassy Terrain in play as well as cycle Fake Out turns to support its teammates. Rillaboom's offensive presence and Fake Out support enable it to force more defensive plays from opponents, allowing it to pivot and flip matchups.</p> </li> <li> <p>High Horsepower can be brought instead of Wood Hammer or U-turn, which allows Rillaboom to hit Pokemon that often wall it, such as Archaludon, Gholdengo, Volcanion, and Chi-Yu. However, losing Wood Hammer or U-turn comes at the cost of being able to threaten fewer OHKOs and pivot less, respectively.</p> </li> <li> <p>Rillaboom's Grassy Terrain provides recovery for bulky partners like Raging Bolt and Volcanion, enables setup sweepers like Grassy Seed Chi-Yu and Kingambit, and removes Psychic Terrain for priority attackers like Chien-Pao and Kingambit. Due to Rillaboom's immense bulk and U-turn pivoting, its Terrain is able to be set up multiple times per battle easily.</p> </li> <li> <p>Assault Vest boosts Rillaboom's Special Defense, allowing it to switch in often and making it more effective against Pokemon like Gholdengo and Archaludon. Assault Vest allows Rillaboom to survive one Sludge Bomb from Landorus as well as one Bleakwind Storm from offensive Tornadus.</p> </li> <li> <p>Tera Fire allows Rillaboom to flip matchups against prolific Fire-, Ice- and Grass-types, such as Chi-Yu, Incineroar, Ogerpon-H, and Chien-Pao, which it struggles to combat defensively without using Tera. Tera Grass can also be used on teams where Rillaboom is needed to perform more offensively, boosting its STAB Grassy Glide and Wood Hammer. Tera Grass guarantees an OHKO with Wood Hammer and a 2HKO with Grassy Glide against Ting-Lu, Ogerpon-W, Landorus, and Walking Wake.</p> </li> <li> <p>Rillaboom has the flexibility to fit on almost any team because of its immense utility, power, and bulk. Key teammates include bulky setup Pokemon such as Kingambit, Raging Bolt, and Gholdengo, which appreciate its Grassy Terrain and Fake Out support, providing opportunities to set up and additional recovery. Priority attackers like Chien-Pao, Kingambit, and Dragonite appreciate Rillaboom's ability to remove Psychic Terrain. Landorus and Chi-Yu appreciate Rillaboom's offensive presence to threaten their common checks like Ogerpon-W as well as Fake Out support to deliver more turns of devastating attacks.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617069, "username": "LogIce"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 608134, "username": "bagel"}, {"user_id": 619632, "username": "Schister"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Grimmsnarl": {"outdated": true, "sets": {"Dual Screens": {"description": "<ul> <li>The given EV spread and nature allow Grimmsnarl to survive a Swords of Ruin-boosted Extreme Speed from a Choice Band Tera Normal Dragonite, then invests the remaining EVs into Special Defense.</li> </ul> <p>This is a sample set as we work on proper analyses. Stay tuned!</p>"}}},
  "Indeedee-F": {"sets": {"Redirection Support": {"description": "<ul> <li>The given EV Spread survives a Rillaboom Wood Hammer in Grassy Terrain.</li> </ul>"}}},
  "Dragapult": {"outdated": true, "sets": {"Choice Band": {}, "Special Attacker": {}}},
  "Regidrago": {
    "sets": {
      "Dragon Energy": {
        "description": "<ul> <li>With Draco Plate and Dragon's Maw, Regidrago's Dragon Energy hits most of the metagame for incredibly high neutral spread damage, offering great sweeping opportunities and removing important threats for its teammates.</li> <li>Draco Meteor gives Regidrago an option when not at full HP, and being a single-target move, it offers an even higher damage output.</li> <li>Earth Power, while often not getting 2HKOs, hits the Pokemon that resist Dragon Energy like Diancie and Gholdengo.</li> <li>Tera Dragon helps Dragon Energy pick up KOs, notably getting the OHKO on bulky Ogerpon-W, while Tera Steel gives Regidrago resistances to a lot of common moves like Tornadus's Bleakwind Storm and Gholdengo's Make It Rain and also improves the matchup against Chien-Pao + Dragonite by letting it resist Extreme Speed and Ice Spinner.</li> <li>Due to its middling Speed, Regidrago heavily relies on Tornadus's Tailwind support to hit first while being healthy and get maximum value from Dragon Energy. Tornadus can also use Icy Wind for additional speed control.</li> <li>Regidrago greatly appreciates Pokemon that can strongly hit opposing targets that resist Dragon Energy, like Gholdengo and Diancie, in return for its ability to blow through Pokemon like Ogerpon-W and Incineroar. Gholdengo can deal with Fairy-types like Alolan Ninetales and with Pokemon like Raging Bolt that often Terastallize into the Fairy typing to not get hit by Dragon-type moves. Ground-types like Landorus on Tailwind teams and Ursaluna-B on Trick Room teams are also great to remove Steel-types and Diancie.</li> <li>Ogerpon-H is one of the main beneficiaries of Regidrago's ability to remove Fire-types, in return removing Steel-types, improving the snow matchup,  and offering Follow Me support to help Regidrago dodge Sucker Punch and keep itself healthy. Ogerpon-W can also be an option that offers more reliable Follow Me support on defensive teams.</li> <li>Regidrago is often paired with Farigiraf or Indeedee-F, which disincentivizes priority moves like Fake Out and Sucker Punch, and they can use Trick Room against Tailwind users or to reverse Trick Room from opposing users.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 509849, "username": "waffle2O2O"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 587701, "username": "eragon"}]}]}
  },
  "Spectrier": {"sets": {"Nasty Plot": {"description": "<p>The Special Defense allows Spectrier to survive Gholdengo's Shadow Ball or Torkoal's Eruption. The Special Attack investment allows it to OHKO zero bulk Ogerpon Formes with a Nasty Plot boost, and the speed investment lets it outspeed Adamant Chien-Pao.</p>"}}},
  "Ursaluna": {"sets": {"Trick Room Attacker": {}}},
  "Ursaluna-Bloodmoon": {
    "overview": "<p>Ursaluna-B utilizes its extremely high special wallbreaking power to power through DOU. It is a threatening force due to few Pokemon in the tier resisting its STAB combination with the help of Mind's Eye, and it fits on both Trick Room and Tailwind-centric teams. Pokemon that would normally Terastallize into Ghost-types to be immune to its Normal-type STAB moves, such as Incineroar, Chien-Pao, and opposing Ursaluna-B, no longer have this option, allowing Ursaluna-B to fire off strong STAB moves like Blood Moon and Hyper Voice against foes for neutral damage. Ursaluna-B uses Earth Power to hit foes like Incineroar, Kingambit, Diancie, Iron Hands, and Gholdengo super effectively. Additionally, it has phenomenal natural bulk, often boosted by Assault Vest. However, Ursaluna-B frequently struggles against defining Pokemon like Ogerpon-W, Chien-Pao, and its brethren Ursaluna due to type matchups and its Speed tier.</p>",
    "comments": "<h3>Checks and Counters</h3> <p><strong>Gholdengo</strong>: Gholdengo is a premier threat to Ursaluna-B due to its high power and Make It Rain, hitting its lower Special Defense stat.</p> <p><strong>Ogerpon-W</strong>: Ogerpon-W's strong STAB attacks can prove troublesome, and its ability to Terastallize and receive a +1 Special Defense boost reduces Ursaluna-B's effectiveness in damaging it.</p> <p><strong>Chien-Pao</strong>: Chien-Pao reduces Ursaluna-B's defensive capabilities due to Sword of Ruin, fires off super effective Ice-type STAB attacks, and punishes Tera Ghost with Dark-type attacks.</p> <p><strong>Chi-Yu</strong>: Chi-Yu reduces Ursaluna-B's defensive capabilities due to Beads of Ruin, hitting it with strong Fire-type STAB attacks and allowing partners like Gholdengo and Tornadus to hit it for more damage.</p>",
    "sets": {
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest allows Ursaluna-B to enhance its immense natural bulk and improve matchups against faster special attackers like Gholdengo, Chi-Yu, and Landorus.</li> <li>Vacuum Wave priority allows Ursaluna-B to pick off Pokemon that commonly run Focus Sash like Chi-Yu, Tornadus, and Chien-Pao, threatening an OHKO on the latter after any Stealth Rock or Fake Out chip damage. Vacuum Wave also allows Ursaluna-B to maneuver around Sucker Punch users like Chien-Pao and Kingambit, which it 2HKOes.</li> <li>The best Tera types for Assault Vest Ursaluna-B are Ghost, Fairy, and Normal. Tera Ghost provides an important Fake Out and Fighting immunity, while Fairy is a strong defensive option for teams that may be weak to Chien-Pao and other Dark-types. Tera Normal boosts its already strong STAB moves, allowing it to OHKO Sinistcha, Ogerpon-W, and Dragonite after Stealth Rock chip damage.</li> <li>Sinistcha is a natural partner, providing healing and redirection for attacks that would threaten Ursaluna-B, such as Iron Hands's Fighting-type moves and Ogerpon-W's STAB moves after Terastallization.</li> <li>Ogerpon-W is a common partner due to its ability to redirect opposing attacks and its Water immunity.</li> <li>Speed control is a necessity with Ursaluna-B due to its low Speed tier. Pokemon like Sinistcha and Tornadus provide Trick Room or Tailwind to help its offensive pressure.</li> <li>The first EV spread allows Ursaluna-B to outspeed Tornadus and the Ogerpon formes in Tailwind. 100 HP EVs with the help of Assault Vest allow it to survive +2 Make It Rain from Gholdengo, Overheat from Modest Chi-Yu, and Icicle Crash from Adamant Chien-Pao.</li> <li>On more Trick Room-dominant teams, Ursaluna-B can opt to run no Speed EVs and invest fully in its HP.</li> </ul>"
      },
      "Life Orb": {
        "description": "<ul> <li>Life Orb boosts Ursaluna-B's already immense wallbreaking power, allowing it to pick up KOs on Pokemon it would normally be shy of OHKOing such as Landorus and Gholdengo.</li> <li>Protect provides Ursaluna-B with a way to stall out remaining Tailwind or Trick Room turns, which can be crucial for momentum and offensive pressure.</li> <li>Tera Normal is the premier choice for Life Orb Ursaluna-B, boosting STAB attacks for more damage and removing weaknesses to Ice, Water, and Grass; however, it keeps its weakness to Fighting, making it vulnerable to foes like Iron Hands.</li> <li>Tera Ghost provides an important Fake Out and Fighting immunity but makes Ursaluna-B weaker to common threats like Chien-Pao and Chi-Yu and reduces overall damage output compared to Tera Normal. Tera Ghost is also beneficial because common threats like Iron Hands, Diancie, and Ursaluna can underspeed Ursaluna-B in Trick Room, so it benefits from an immunity to Fighting- and Normal-type moves from these Pokemon.</li> <li>Speed control is a necessity due to its low Speed. Pokemon like Sinistcha, Diancie, and Cresselia provide Trick Room, and Roaring Moon and Tornadus set Tailwind to help Ursaluna-B's offensive pressure.</li> <li>The first EV spread allows Ursaluna-B to outspeed both the Ogerpon formes and Tornadus in Tailwind, as well as survive an Adamant Icicle Crash from Chien-Pao and Heat Wave from Modest Tera Fire Chi-Yu.</li> <li>No Speed investment allows Ursaluna-B to underspeed most common threats in the tier and should be run on Trick Room sets. However, Iron Hands, Diancie, and Ursaluna can underspeed it in Trick Room.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617069, "username": "LogIce"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 619632, "username": "Schister"}, {"user_id": 550367, "username": "Smudge"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Basculegion-F": {"sets": {"Rain Attacker": {}, "Choice Scarf": {}}},
  "Armarouge": {"outdated": true, "sets": {"TR Attacker": {}}},
  "Palafin": {
    "sets": {
      "Choice Band": {},
      "Bulk Up": {
        "outdated": true,
        "description": "<p>Bulk Up Palafin builds upon its natural bulk and Attack, letting it function as a strong priority attacker who uses its Defense to brazenly set up and become a threatening sweeper that is difficult to KO for common physical attackers like Chien-Pao, Landorus-T, and Kingambit. Jet Punch circumvents common speed control and is threatening against the frailer metagame, notably OHKOing Chi-Yu and Landorus at +1. Drain Punch is a reliable means of recovery in addition to Leftovers while also hitting popular Dark-types like Kingambit and Chien-Pao, as well as common Water-resistant or immune foes such as Rillaboom and Volcanion harder. Tera Grass provides an immunity to Amoonguss's Spore and Rage Powder, as well as resistances to Grass- and Electric-type attacks such as Rillaboom's Wood Hammer and Iron Hands's Wild Charge, which would otherwise OHKO Palafin. Palafin's base forme has poor damage output and bulk, so it is often ideal for it to lead and pivot out immediately to activate Zero to Hero. This is so crucial to Palafin's functioning that it is very telegraphed and easily exploitable with powerful attacks directed at it. To cover for this, Palafin may lead together with a Fake Out user or a redirector to reduce incoming damage. Bulk Up Palafin pairs well with partners that can remove Psychic Terrain, use Fake Out to generate free turns for Palafin to set up, and extend Palafin's longevity. Rillaboom fulfills all of these roles, with Grassy Terrain granting additional passive recovery. Cresselia is another good partner, as its Lunar Blessing heals Palafin and cures burn and poison, which would otherwise severely limit Palafin's offensive output or the turns it can stay on field. Amoonguss's Rage Powder redirects threatening attacks such as Iron Hands's Wild Charge, removes Toxic Spikes that reduce Palafin's longevity, and provides a major source of recovery for Palafin with Pollen Puff. Iron Hands is a Fake Out user whose Electric-type attacks eliminate opposing Water-types that resist Jet Punch. Grimmsnarl can also increase Palafin's bulk and create setup opportunities with its dual screens. As Amoonguss effortlessly walls Palafin and undoes its progress with Clear Smog, Palafin requires partners that deal with it effectively, like Heatran, Chien-Pao, and Chi-Yu.</p>"
      }
    }
  },
  "Glimmora": {
    "sets": {
      "Meteor Beam": {
        "description": "<ul> <li> <p>Meteor Beam is one of the most powerful single-turn attacks in the tier when used in conjunction with Power Herb to remove the charge turn and immediately get a +1 Special Attack increase.</p> </li> <li> <p>Sludge Bomb is a more reliable STAB attack that threatens Rillaboom, Ogerpon-W, and Ogerpon-H. Earth Power provides solid coverage that hits Steel-types like Kingambit and Gholdengo, which its STAB moves fail to hit effectively. Spiky Shield serves as an enhanced Protect that keeps Glimmora safe from damage while damaging foes that target it with contact moves.</p> </li> <li> <p>Glimmora's ability, Toxic Debris, serves as a way of punishing the foe for landing physical attacks on Glimmora by setting a layer of Toxic Spikes on their side.</p> </li> <li> <p>Both Toxic Debris and Spiky Shield discourage foes from targeting Glimmora with physical moves, as the chip damage from either of them can break Focus Sash and allow Glimmora and its teammates to nab KOs that would be missed otherwise.</p> </li> <li> <p>Tera Grass turns Glimmora's Ground and Water weaknesses into resistances while also giving it Rage Powder and Spore immunity. Tera Flying can be used instead to provide Glimmora with a full Ground-type immunity.</p> </li> <li> <p>While there may be some instances where it is better to be cautious in using Meteor Beam, as it can only be used once reliably, Glimmora generally wants to use it as soon as possible to get the Special Attack boost and allow for more powerful attacks on subsequent turns.</p> </li> <li> <p>Prankster Tailwind users like Tornadus and Whimsicott are great teammates for providing immediate speed control to make up for Glimmora's mediocre Speed. Pokemon that outspeed and OHKO Landorus before it can OHKO Glimmora like Ogerpon-W and Chien-Pao are also greatly appreciated partners. Chi-Yu also works well alongside Glimmora, boosting its damage output with Beads of Ruin and using Fire-type moves to hit Steel-types hard.</p> </li> </ul>"
      },
      "Hazards Setter": {}
    },
    "credits": {"writtenBy": [{"user_id": 154787, "username": "KennyJ"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 608134, "username": "bagel"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Farigiraf": {"outdated": true, "sets": {"TR Attacker": {}}},
  "Kingambit": {
    "sets": {
      "Swords Dance": {
        "description": "<ul> <li>Swords Dance, mixed with Kingambit's naturally high Attack as well as access to Defiant to scare off Intimidate users and priority in Sucker Punch, makes it one of the most effective setup sweepers in the metagame. Its respectable bulk, especially its base 120 Defense, often allows it to set up multiple Swords Dances in one match.</li> <li>Kowtow Cleave offers strong and consistent damage. It OHKOes Gholdengo and Indeedee-F without a boost and decimates bulky Pokemon like Amoonguss and Entei at +2, netting guaranteed KOs after minimal chip damage.</li> <li>Sucker Punch compensates for Kingambit's low Speed, OHKOing faster attackers such as Landorus and Ogerpon-W after a boost. It also allows Kingambit to revenge kill weakened foes when entering the field.</li> <li>Dread Plate (or Black Glasses) is vital for Kingambit to secure numerous benchmarks for OHKOs or 2HKOs on Pokemon such as Landorus with Sucker Punch and Ogerpon-W with Kowtow Cleave. Other items can be used in niche scenarios, such as Leftovers for gradual health recovery and Grassy Seed on teams with Rillaboom to become resilient to most physical attacks.</li> <li>Kingambit has a multitude of options for its Tera type. Tera Dark can be used to strengthen its attacks and reduce its weakness to Iron Hands's Fighting-type attacks to only 2x while removing its weaknesses to Incineroar's Flare Blitz, Ogerpon-H's Ivy Cudgel, and Landorus's Earth Power. Tera Dragon allows Kingambit to resist attacks from Ogerpon-H, Ogerpon-W, and Chi-Yu. Tera Flying grants an immunity to Landorus's Ground-type moves as well as another way to resist Iron Hands's attacks, but it gives Kingambit a much worse matchup against the faster Raging Bolt and Chien-Pao.</li> <li>Kingambit appreciates partners that can create space for it to set up a Swords Dance; this includes Fake Out users, such as Incineroar, Rillaboom, and Iron Hands, and redirection support from the likes of Sinistcha and Ogerpon-W. One bonus of running Incineroar is that it actually improves Kingambit's matchup against opposing Incineroar, as it can easily switch into Flare Blitz if necessary or at least reduce the damage Kingambit takes from an opposing Incineroar's Flare Blitz. Landorus fends off some of Kingambit's biggest threats like Iron Hands and Entei, while it appreciates Kingambit's ability to remove some of its threats like Ogerpon-W with a boosted Sucker Punch. Landorus is also one of Kingambit's best offensive checks due to its strong Earth Power, so Kingambit appreciates the support of Jolly Ogerpon-W and Chien-Pao to threaten it offensively.</li> <li>Kingambit's Defiant supports strong physical attackers such as Rillaboom, Ogerpon-W, and Chien-Pao by deterring opposing Intimidate users. Its Steel typing and opportunity to get a Defiant boost from Bleakwind Storm also make it one of the strongest Tornadus checks in the tier, which is appreciated by the aforementioned Grass-types. Gouging Fire can further boost Kingambit's Attack with Howl, while Kingambit deters Intimidate users, creating room for multiple turns of boosting.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 501951, "username": "zee"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 550367, "username": "Smudge"}, {"user_id": 608134, "username": "bagel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Iron Bundle": {
    "overview": "<p>Boasting a blistering base 136 Speed stat, outrun only by Dragapult, and impressive Special Attack, Iron Bundle is truly a force to be reckoned with in DOU. Its offense especially shines when paired with Chi-Yu, which greatly increases Iron Bundle's damage output with Beads of Ruin. Iron Bundle has excellent speed control with Icy Wind, which, when combined with its high Speed, can easily ensure that it and its allies outspeed the enemy team. However, Iron Bundle is a fairly fragile Pokemon, especially against powerful special attackers such as Chi-Yu and Gholdengo.</p>",
    "comments": "<h3>Other Options</h3> <p>Iron Bundle can run Encore over Icy Wind or Protect, easily locking most Pokemon into a move such as Protect or Fake Out thanks to its high Speed. On a snow team with Abomasnow, Iron Bundle can run Blizzard as a powerful spread attack, and it also can maximize its damage output with Tera Ice. Snow also boosts Iron Bundle's Defense, making it particularly more effective against priority spam teams with Dragonite and Palafin. 252 HP and 64 Special Defense EVs can be used with Assault Vest to survive an Overheat from Choice Scarf Chi-Yu, and Iron Bundle still has above 152 Speed EVs left for outspeeding Meowscarada. 40 HP EVs allow Iron Bundle to avoid a potential OHKO from Chien-Pao's Sacred Sword if Chien-Pao lacks a damage-boosting item, so an EV spread of 40 HP / 216 SpA / 252 Spe on less bulky sets could be used instead.</p>",
    "sets": {
      "Fast Sweeper": {
        "description": "<ul> <li> <p>Hydro Pump is by far Iron Bundle's strongest STAB move. Tera Water can further amplify its power.</p> </li> <li> <p>STAB Freeze-Dry allows Iron Bundle to hit Water-types hard. It is effective against rain teams, being able to OHKO Pelipper, OHKO Barraskewda, and hit Palafin hard.</p> </li> <li> <p>Icy Wind benefits Iron Bundle's slower allies. It functions well against fast Focus Sash Pokemon such as Chien-Pao and Meowscarada, both dealing damage to nullify the Focus Sash and lowering their Speed, which allows Iron Bundle's ally to KO the foe.</p> </li> <li> <p>Protect is used to predict and avoid attacks that threaten to KO Iron Bundle, extending its longevity. It can also help Iron Bundle stall out Trick Room and Tailwind turns.</p> </li> <li> <p>Tera Water increases the power of Hydro Pump and gives Iron Bundle a better defensive typing against Fire- and Steel-type Pokemon such as Chi-Yu and Gholdengo. Tera Ghost avoids Fake Out and Extreme Speed, letting Bundle act more freely. Both Tera types also reduce the damage taken from Stealth Rock.</p> </li> <li> <p>Booster Energy activates Iron Bundle's Quark Drive, making it among the very fastest Pokemon in Doubles OU. Boosted Iron Bundle outspeeds Gholdengo and Great Tusk in Tailwind, Choice Scarf Chi-Yu, and Weak Armor-boosted Armarouge. It also Speed ties Chlorophyll Lilligant in sun.</p> </li> <li> <p>Focus Sash complements Iron Bundle's lacking bulk, letting it survive attacks that would OHKO it.</p> </li> <li> <p>Life Orb increases Iron Bundle's overall damage output, enabling it to OHKO a few Pokemon such as Dragapult with Freeze-Dry. However, it doesn't help Iron Bundle preempt foes or take hits, making it far riskier than other items. Life Orb's recoil damage can also put Iron Bundle into KO range from Dragonite's Extreme Speed.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 216286, "username": "Fangame10"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 471503, "username": "YoBuddy"}, {"user_id": 230771, "username": "qsns"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Iron Hands": {
    "sets": {
      "Assault Vest": {
        "description": "<ul> <li> <p>Assault Vest complements Iron Hands's already impressive HP stat and physical bulk with even higher special bulk after heavy Special Defense investment. This enables Iron Hands to become one of the most impressive special walls in the tier, capable of shrugging off super effective Ground-type damage from Landorus's Earth Power and Sandsear Storm and easily switching in on most forms of neutral special damage from Pokemon like Gholdengo and Tornadus.</p> </li> <li> <p>Fake Out allows Iron Hands to support its partners and allow them to set up, attack with a free turn, or even just pivot out and reposition in the face of opposing offensive pressure.</p> </li> <li> <p>Wild Charge provides strong STAB damage into most of the metagame, capable of OHKOing opposing Tornadus and threatening 2HKOs on important neutral targets like Ogerpon-W and Offensive Gholdengo.</p> </li> <li> <p>Drain Punch hits many common Fighting-weak targets like Incineroar, Chien-Pao, and Kingambit for solid damage while allowing Iron Hands to recover respectable amounts of HP, adding to its already impressive longevity. As an alternative, Close Combat provides significantly stronger damage output, threatening 2HKOs on practically every neutral target in the format, including bulkier Pokemon like Ogerpon-W that normally avoid the 2HKO from Drain Punch. However, this comes at the cost of both losing out on Drain Punch's ability to extend Iron Hand's longevity and greatly weakening its defenses.</p> </li> <li> <p>The last moveslot is typically occupied by Ice Punch, which allows Iron Hands to OHKO opposing Landorus, which is one of the biggest offensive checks to Iron Hands and is naturally resistant to both of Iron Hands's STAB types. Ice Punch also enables Hands to hit Grass Types like Sinistcha and Rillaboom. Heavy Slam is a more niche option that primarily allows Iron Hands to OHKO opposing Diancie and Alolan Ninetales. Finally, Volt Switch allows Iron Hands to function as a slow, bulky pivot to help safely bring in offensive teammates like Chien-Pao and Landorus and make greater use of its access to Fake Out support.</p> </li> <li> <p>Tera Water allows Iron Hands to turn all of its weaknesses into neutralities with an all-around solid defensive typing. This particularly helps into offensive opponents like Chien-Pao and Landorus. However, this type swap makes Iron Hands weaker into opposing Iron Hands, Rillaboom, and Ogerpon-W. Tera Grass allows Iron Hands to resist Earth Power and more effectively play into opposing Landorus, while also granting resistances to Grass-type and Water-type damage from Rillaboom and Ogerpon-W. FIt also grants Iron Hands an immunity to Spore and Rage Powder, helping get around opposing Amoonguss and Sinistcha. However, this typing makes Iron Hands worse against opposing Tornadus and Chien-Pao. Tera Fairy gives Iron Hands a broadly neutral typing, allowing it to escape pins and more easily Terastallize out of its weaknesses without fear of becoming weak to another attack from the opposing side.</p> </li> <li> <p>The given EV spread allows Iron Hands to outspeed and OHKO Landorus, Tornadus, and Terastalized bulky Ogerpon-W under Tailwind while otherwise maximizing its special bulk.</p> </li> <li> <p>While Iron Hands is extremely versatile and can be played with basically any other viable Doubles partner, it is commonly paired with Chien-Pao to deal increased damage and help support Chien-Pao's fragility with Fake Out, while not being too bothered by its Sword of Ruin thanks to Iron Hands's impressive physical bulk. Iron Hands also pairs nicely with Tailwind setters like Tornadus, which allow Iron Hands to overcome its low natural Speed stat and attack before foes such as Landorus that would otherwise outspeed it. Other common partners include Ogerpon-W for Follow Me support, a Ground resistance, and the ability to offensively pressure opposing Landorus. Landorus itself is a valuable partner for further special attacking assistance against physically bulky Pokemon that would otherwise give Iron Hands trouble. Bulkier setup options like Nasty Plot Gholdengo or Diamond Storm Diancie can also give Iron Hands trouble if they are able to successfully get into position, as Iron Hands will struggle to remove them on its own.</p> </li> </ul>"
      },
      "Swords Dance": {
        "description": "<ul> <li> <p>Swords Dance Iron Hands is a threatening sweeper that can completely turn the game around if put into a situation where it can recover most of its health every turn with a boosted Drain Punch.</p> </li> <li> <p>Both Ice Punch and Fire Punch can hit Amoonguss and Sinistcha, which otherwise safely redirect Iron Hands's moves. Ice Punch checks Landorus, while Fire Punch is more useful on teams weak to Gholdengo, which otherwise walls Iron Hands.</p> </li> <li> <p>Protect allows Iron Hands to dodge Fake Out or a lethal attack, buying a turn for a partner to switch in and provide redirection, Tailwind, or Fake Out support.</p> </li> <li> <p>Iron Hands pairs well with Tailwind setters like Tornadus, since its Speed investment lets it outspeed threats like Landorus and the Ogerpon formes under Tailwind. Alternatively, minimum Speed investment Iron Hands can be used with Trick Room users like Sinistcha and Farigiraf.</p> </li> <li> <p>Iron Hands appreciates redirection support to help it set up or redirect attacks when at low HP, giving it a chance to recover with Drain Punch. Ogerpon-W has Follow Me and threatens Ground-types like Landorus. Sinistcha can protect Iron Hands with Rage Powder, provides healing with Hospitality and Life Dew, and can set Trick Room as a means of speed control.</p> </li> <li> <p>Clear Amulet prevents Intimidate from Incineroar and Landorus-T, guarantees higher immediate damage output, and has the added benefit of blocking Parting Shot and preventing the Attack drop from Gouging Fire's and Roaring Moon's Breaking Swipe.</p> </li> <li> <p>Tera Grass allows Iron Hands to bypass Rage Powder, grants it an immunity to Spore from Amoonguss, and makes it resist Ground-type moves from common threats like Landorus and Ursaluna-B, while Tera Water is a good neutral typing in the metagame.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 509849, "username": "waffle2O2O"}, {"user_id": 587701, "username": "eragon"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}, {"user_id": 550367, "username": "Smudge"}, {"user_id": 159382, "username": "qrChar"}, {"user_id": 509849, "username": "waffle2O2O"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Baxcalibur": {"sets": {"Dragon Dance": {"description": "<ul> <li>188 Speed EVs outspeeds Dragapult after a Dragon Dance.</li> </ul>"}}},
  "Gholdengo": {
    "sets": {
      "Nasty Plot": {
        "description": "<ul> <li> <p>Nasty Plot allows Gholdengo to become a potent wincon, capable of cleaning up weakened teams with its powerful spread damage. Its good defensive typing and incredible ability in Good as Gold give it plenty of opportunities to set up in front of common Pokemon such as Rillaboom, Tornadus, Whimsicott, and Amoonguss, since it resists all of their STAB moves and is not affected by Fake Out, Taunt, Encore, or Spore.</p> </li> <li> <p>Make It Rain becomes incredibly powerful when boosted by Nasty Plot and can severely damage anything that doesn't resist it. However, it drops Gholdengo's Special Attack after being used and is resisted by several common Pokemon, such as Incineroar and Iron Hands, meaning that it can't be freely used repeatedly, as opponents can play around Make It Rain until Gholdengo runs out of steam. This makes Make It Rain most effective when used against weakened teams that have their switch-in options limited, or in positions where the opponent is unable to protect their neutral targets from it.</p> </li> <li> <p>Shadow Ball gives Gholdengo an option against Steel-resistant Pokemon such as Iron Hands, Raging Bolt, and Ogerpon's Wellspring and Hearthflame Formes, allowing it to preserve its Nasty Plot boost and still maintain offensive pressure. Dazzling Gleam, in combination with Tera Fairy, is able to completely flip the script on Iron Hands and provide a neutral damage option against Incineroar and Swords Dance Kingambit.</p> </li> <li> <p>The given EV spread guarantees Gholdengo will survive a Sucker Punch from full from Adamant Chien-Pao while also allowing it to outspeed Modest Choice Scarf Chi-Yu when in Tailwind. Gholdengo's longevity can be increased with Leftovers, which becomes especially impactful when paired with Rillaboom's Grassy Terrain, doubling the amount of passive recovery received per turn. Alternatively, Metal Coat turns Make It Rain into even more of a nuke, which is useful on teams focused more around immediate offensive power.</p> </li> <li> <p>Tera Dragon grants Gholdengo crucial resistances to Fire and Water while maintaining its resistance to Grass, allowing it to resist all the STAB moves of both Ogerpon-W and Ogerpon-H. However, the gained weaknesses to Dragon, Ice, and Fairy leave it in a precarious spot against strong Dragon-types such as Regidrago and Raging Bolt while also making it vulnerable to foes it can normally beat such as Chien-Pao, Kyurem, and Whimsicott. Alternatively, Tera Fairy provides Gholdengo with a useful resistance to Dark and serves as a generally good defensive typing. Lastly, Tera Steel can be used to further strengthen Make It Rain while also dropping Gholdengo's weakness to Dark. The loss of Gholdengo's Ghost typing should always be kept in mind when considering whether to Terastallize it, as becoming vulnerable to Fake Out can severely hinder it in certain matchups.</p> </li> <li> <p>Incineroar and Kingambit are bulky foes that resist both of Gholdengo's STAB moves and threaten it back with super effective moves, so it appreciates teammates that can deal with these threats such as Landorus and Iron Hands. Speed control is very important for Gholdengo, as it prefers to move first despite its mediocre Speed tier teammates that provide Tailwind support such as Tornadus and Whimsicott make for natural partners. Teammates that provide redirection support, such as Ogerpon-W, Indeedee-F, and Amoonguss are also useful, as they can provide Gholdengo with free turns to set up and increase its longevity by keeping it safe. The same applies to Pokemon that can provide Fake Out support such as Rillaboom and Incineroar.</p> </li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li> <p>Choice Specs Gholdengo provides more immediate offense compared to Nasty Plot variants. Choice Specs-boosted Tera Steel Make It Rain can quickly overwhelm the opposing team, leaving the opponent scrambling to bring in their few Steel-resistant Pokemon. Shadow Ball acts as the secondary STAB move, hitting key targets such as Archaludon and opposing Gholdengo.</p> </li> <li> <p>Power Gem and Focus Blast provide answers to some of the common foes that resist Gholdengo's STAB coverage. Both moves hit Incineroar and Chi-Yu super effectively, while Focus Blast specifically lets it threaten Kingambit. Power Gem is usually the preferred option because of its consistency. Trick is able to severely disrupt the opponent's support or setup-oriented Pokemon such as Amoonguss. Trick can also be utilized against Sucker Punch users, causing their attack to fail and locking them down with a Choice item.</p> </li> <li> <p>Tera Steel is the Tera type of choice to push Make It Rain's damage even further. It also provides defensive benefits in removing Gholdengo's weakness to Ghost- and Dark-type attacks, notably opposing Gholdengo's Shadow Ball and the Sucker Punches coming from Chien-Pao and Kingambit.</p> </li> <li> <p>The EV spread maximizes Gholdengo’s Special Attack to focus on heavy damage output. The HP and Defense investment allow it to survive Jolly Chien-Pao's Sucker Punch without the need to Terastallize defensively. The Speed makes Gholdengo faster than Booster Energy Gouging Fire and Modest Choice Scarf Chi-Yu under Tailwind.</p> </li> <li> <p>Good as Gold allows Gholdengo to switch in against status-reliant Pokemon almost completely unthreatened by them. This most notably includes Amoonguss, as its presence in the metagame often demands teams to have Spore-immune answers.</p> </li> <li> <p>Gholdengo's Speed leaves it outpaced by many of the metagame's major threats, such as Landorus and Ogerpon-H; because of this, it is very frequently paired with Tailwind users to support it. Tornadus and Whimsicott both have the Prankster ability that make them particularly ideal in this role.</p> </li> <li> <p>Pokemon that can assist Gholdengo in breaking down the tougher Steel-resistant Pokemon are helpful. For instance, Landorus is particularly effective at taking down the Fire-, Electric-, and Steel-types with its powerful Ground-type STAB moves. Ogerpon-W is another strong partner for Gholdengo, offering Follow Me for redirection support in addition to being able to offensively threaten Landorus and many Fire- and Water-types. Rillaboom is also a fantastic partner, as it's efficient in removing Water-types. In addition, it's effective at luring in the Fire- and Steel-types that resist its Terrain-boosted Grass-type moves, wearing them down for Gholdengo to break through. Further still, Rillaboom is an effective pivot that can help secure Gholdengo's safe entrance onto the field.</p> </li> </ul>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 159382, "username": "qrChar"}, {"user_id": 609101, "username": "Iceberg77"}, {"user_id": 550367, "username": "Smudge"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 228280, "username": "DaAwesomeDude1"}, {"user_id": 550367, "username": "Smudge"}, {"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}, {"user_id": 608134, "username": "bagel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 712558, "username": "waffledogefern"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Chien-Pao": {
    "sets": {
      "Focus Sash Attacker": {
        "description": "<ul> <li>Ice Spinner can threaten to OHKO Tornadus and Landorus while also removing Rillaboom's Grassy Terrain and Indeedee-F's Psychic Terrain, allowing Chien-Pao to use Sucker Punch, while Icicle Crash has a decent chance to make foes flinch and avoids contact damage from Spiky Shield and Rocky Helmet, keeping Focus Sash intact against Ogerpon and Rocky Helmet Amoonguss.</li> <li>Sucker Punch can pick off targets that are on low HP and faster threats such as opposing Chien-Pao and Pokemon benefitting from Trick Room or Tailwind. Throat Chop can be used over Sucker Punch for a reliable Dark-type STAB move, since it is not negated by Follow Me from Ogerpon-W and Indeedee-F and can hit Pokemon setting up like Gholdengo while also preventing Ursaluna-B from using Hyper Voice and Incineroar from using Parting Shot.</li> <li>Sacred Sword is great coverage against Pokemon that resist or tank Chien-Pao's STAB combination such as Incineroar, Kyurem under snow, and opposing Chien-Pao. Throat Chop can be used over Sacred Sword for a better matchup against Nasty Plot Gholdengo and redirection users in exchange for a worse matchup against Kingambit, Incineroar, and opposing Chien-Pao.</li> <li>Tera Ghost makes Chien-Pao immune to Fake Out, dodging the flinch effect and preventing Fake Out from breaking the Focus Sash, while also becoming immune to Fighting-type attacks from Iron Hands and opposing Chien-Pao. Tera Stellar provides a helpful power boost and can let it generally OHKO Amoonguss, Ursaluna-B, and most Raging Bolt with Ice Spinner or Icicle Crash.</li> <li>Teams that have Chien-Pao have a lot of offensive pieces that benefit from Sword of Ruin lowering the Defense of opposing Pokemon, increasing the chances of OHKOs from offensive threats such as Ogerpon-W, Ogerpon-H, Iron Hands, and priority users such as Choice Band Dragonite packing Extreme Speed.</li> <li>Chien-Pao appreciates Pokemon like Landorus, Landorus-T, and Ogerpon-W that offensively threaten Fire-types like Gouging Fire and Incineroar, among other key problems for Chien-Pao such as Diancie and Iron Hands.</li> <li>Gouging Fire can be a good partner, supporting Chien-Pao with Howl to negate Intimidate while accentuating the physically focused offense already passively bolstered by Sword of Ruin.</li> </ul>"
      },
      "Offensive Icy Wind": {
        "description": "<ul> <li> <p>Icy Wind Chien-Pao is able to provide excellent speed control for its teammates such as Landorus, Ogerpon-H, and Ogerpon-W, allowing them to outspeed and OHKO threats like opposing Chien-Pao, Tornadus, and opposing Ogerpon formes.</p> </li> <li> <p>Chien-Pao's primary Ice-type STAB move is largely determined by its partners; Ice Spinner for its ability to clear Grassy and Psychic Terrain, while Icicle Crash is chosen for its increased power, ability to avoid Rocky Helmet chip damage that would break its Focus Sash, and inability to clear your own Terrain when run with Indeedee-F or Rillaboom.</p> </li> <li> <p>Sucker Punch is chosen to give Chien-Pao a priority option, allowing it to pick off weakened threats or squeeze off an extra hit after being brought down to its Focus Sash.</p> </li> <li> <p>Throat Chop gives Chien-Pao a way of hitting Pokemon like Farigiraf and Indeedee-F super effectively while also allowing it to attack Gholdengo and Terastallized Ogerpon-H without having to risk Sucker Punch failing.</p> </li> <li> <p>Icy Wind Chien-Pao is notable for its ability to function as the primary mode of speed control for priority-spam teams while also being able to excel in conjunction with Tailwind-setting teammates like Roaring Moon and Tornadus.</p> </li> <li> <p>Icy Wind allows Chien-Pao to aid its partners in preventing Toxic Debris or Aurora Veil from Glimmora and Alolan Ninetales, respectively. Icy Wind can break a possible Focus Sash on either Pokemon and enables Chien-Pao's slower partners like Gholdengo, Landorus, and Glimmora to outspeed and OHKO either Pokemon after Icy Wind chip damage.</p> </li> <li> <p>The Naive nature is chosen to allow Chien-Pao to guarantee the 2HKO against bulky Landorus with Icy Wind.</p> </li> <li> <p>Tera Ghost grants a crucial immunity to Fake Out, opposing Chien-Pao's Sacred Sword, Dragonite's Extreme Speed, and Iron Hands's Fighting-type attacks.</p> </li> <li> <p>Dragonite is one of Chien-Pao's premier partners, with Icy Wind support allowing Dragonite to more effectively use its non-priority options, allowing for more versatile Dragonite sets like Loaded Dice.</p> </li> <li> <p>The Ogerpon formes are another of Chien-Pao's preferred partners, with Icy Wind and Sword of Ruin support allowing the Ogerpon formes to eliminate key threats to themselves like Focus Sash Tornadus and opposing Ogerpon formes before they're able to retaliate.</p> </li> <li> <p>Chien-Pao also works extremely well alongside Landorus because Landorus pressures Chien-Pao's common checks like Incineroar and Iron Hands, and additionally, Chien-Pao is able to slow down Landorus's most common check, Ogerpon-W.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 553122, "username": "gephicka"}, {"user_id": 625105, "username": "forkuser"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509849, "username": "waffle2O2O"}, {"user_id": 617069, "username": "LogIce"}, {"user_id": 159382, "username": "qrChar"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ting-Lu": {"sets": {"Hazards Tank": {"description": "<p>Ting-Lu's Attack investment allows it to 2HKO Nasty Plot Gholdengo with Stomping Tantrum, its HP and Defense allow it to survive Rillaboom's Wood Hammer.</p>"}}},
  "Chi-Yu": {
    "outdated": true,
    "overview": "<p>Chi-Yu poses itself as one of the most menacing special attackers in DOU, with its high Special Attack, near unresisted STAB combination, and Beads of Ruin allowing it to hit the majority of the metagame extremely hard. Beads of Ruin also not only indirectly makes Chi-Yu hit harder but also empowers its special attacking teammates, with Iron Bundle and Gholdengo in particular being excellent partners due to their ability to either overwhelm shared checks like Ting-Lu or outright beat some of Chi-Yu's checks, such as Garchomp for the former and Glimmora for the latter. Furthermore, Chi-Yu has very good Speed, allowing it to naturally outspeed a considerable portion of the metagame. However, Chi-Yu is not without glaring weaknesses, as its HP and Defense are absurdly low, which leaves it vulnerable to common priority moves such as Palafin's Jet Punch and Dragonite's Extreme Speed. In addition, despite Dark / Fire being a good type combination offensively, it leaves Chi-Yu vulnerable defensively, as its weaknesses to Ground-, Rock- and Water-type moves in addition to Stealth Rock compromise its ability to switch in and fire off more attacks. Finally, Pokemon such as Glimmora, Ting-Lu, and Garchomp have the ability to potentially switch into Chi-Yu and threaten it out, with Ting-Lu's Tablets of Ruin being a particular annoyance due to it offsetting Beads of Ruin. However, it is important to note that Chi-Yu's strength is still to the magnitude that it can 2HKO all the aforementioned Pokemon under the right circumstances.</p>",
    "comments": "<h4>Other Options</h4> <p>EV investment into Chi-Yu's HP and Defense allows it to survive a significant number of moves it would normally be OHKOd by, notably Dragonite's Extreme Speed, while a Modest nature can be used on both sets to further increase the amount of damage Chi-Yu can do overall. However both options can cut into Chi-Yu's Speed, with the former also potentially lowering the amount of damage Chi-Yu can do depending on the amount of investment.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li> <p>Heat Wave allows Chi-Yu to pick off Pokemon like Choice Scarf Gholdengo and Chien-Pao, as well as being a good method of spreading damage.</p> </li> <li> <p>Dark Pulse can hit Ghost- and Psychic-types like Dragapult and Armarouge, as well as Pokemon that resist Fire-type moves, like Glimmora.</p> </li> <li> <p>Flamethrower and Overheat both give Chi-Yu the ability to focus its damage on a singular Pokemon, with Overheat being significantly stronger but far more punishing than Flamethrower.</p> </li> <li> <p>Snarl is useful for spread damage when both Pokemon on the field can take Heat Wave, as well as supporting its team.</p> </li> <li> <p>Choice Scarf lets Chi-Yu outrun almost the entire tier, allowing it to either threaten out Pokemon like Dragapult and Chien-Pao and pick off weakened targets.</p> </li> <li> <p>The EV spread and a Timid nature both maximizes the number of Pokemon Chi-Yu can outspeed along with its damage output.</p> </li> <li> <p>Tera Fire allows Chi-Yu to pick up KOs it normally wouldn't be able to otherwise, such as Amoonguss with Heat Wave, while Tera Ghost grants an immunity to Fake Out and Extreme Speed, blocking two common methods to stop Chi-Yu, as well as making it immune to Fighting-type moves, which it would normally be weak to, like Drain Punch from Iron Hands.</p> </li> </ul>"
      },
      "All Out Attacker": {
        "description": "<ul> <li> <p>Heat Wave provides excellent spread damage severely threatening Steel- and Grass-types like Gholdengo and Amoonguss while still being able to scorch neutral targets.</p> </li> <li> <p>Dark Pulse hits several Pokemon that resist Heat Wave, such as Glimmora, as well as Ghost- and Psychic-types like Armarouge and Dragapult hard, as well as just being a solid STAB move</p> </li> <li> <p>Flamethrower and Overheat deal more damage to a single target than Heat Wave, which can allow Chi-Yu break past Pokemon it normally wouldn't be able to, such as Ting-Lu. Overheat allows Chi-Yu to deal an insane amount of damage, accomplishing feats such as OHKOing Tera Normal Dragonite, while Flamethrower is weaker than Overheat by a significant margin but doesn't have the Special Attack drop and imperfect accuracy.</p> </li> <li> <p>Snarl provides a secondary spread attack that can hit deceptively hard, in addition to debuffing the opposing team, while Tera Blast can be utilized with Tera Grass in order to give Chi-Yu an option to hit Pokemon like Palafin and Iron Bundle. Protect should only be used with Life Orb, but can keep Chi-Yu safe for a turn while a teammate either repositions or sets speed control to assist it.</p> </li> <li> <p>Choice Specs and Life Orb both boost Chi-Yu's damage output to absurd levels, with the former allowing Chi-Yu to switch moves in exchange for the recoil and loss of power.</p> </li> <li> <p>Tera Fire exponentially increases the strength of Fire-type moves for Chi-Yu, while Tera Grass patches up Chi-Yu's weakness to Water-type moves, and Tera Ghost prevents Fake Out and Extreme Speed from slowing down or picking off Chi-Yu, in addition to turning the Fighting-type weakness to an immunity.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 531334, "username": "zoe"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 550367, "username": "Smudge"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Roaring Moon": {
    "outdated": true,
    "sets": {
      "Offensive Tailwind Setter": {
        "description": "<ul> <li>Roaring Moon has grown into the role of DOU's premier offensive Tailwind setter, using its blazing Speed to provide both damage and team support.</li> <li>Booster Energy lets Roaring Moon outspeed every other Pokemon in the format besides Booster Energy Iron Bundle. This ensures Roaring Moon is able to set Tailwind before being KOed and may even allow its partner to KO opposing threats instead.</li> <li>Breaking Swipe offers survivability for Roaring Moon and its partner as well as chip damage that can break the Focus Sash of Pokemon such as Chien-Pao and Iron Bundle.</li> <li>Acrobatics is immediately activated when Booster Energy is consumed and offers strong damage, nearly matching Roaring Moon's best STAB options, Throat Chop and Dragon Claw. With Tera Flying, it becomes Roaring Moon's best damage-dealing option, threatening massive damage on Pokemon such as Amoonguss and Great Tusk.</li> <li>Throat Chop can be used over either Breaking Swipe or Acrobatics as a consistent STAB option that hits Indeedee-F and Armarouge for super effective damage.</li> <li>Roaring Moon's defenses are decent, but both Dragon / Dark and Flying have notable weaknesses, especially to opposing Ice-types like Iron Bundle and Chien-Pao; Protect gives Roaring Moon the opportunity to avoid these attacks while its partner removes such threats. Protect can also be used to stall out field effects like weather, Trick Room, and an opponent's Tailwind.</li> <li>The listed EVs will boost Roaring Moon's Speed with Booster Energy. If an Attack boost is desired instead, 32 HP EVs can be moved into Attack.</li> <li>If being used on sun teams, Life Orb is preferred as the item. Sun will activate Protosynthesis without consuming Booster Energy, keeping Acrobatics at a measly 55 Base Power. Keep this in mind while facing sun teams as well.</li> <li>Taunt is an option to prevent opposing forms of speed control such as Tailwind and Trick Room.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 27554, "username": "Arcticblast"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 531334, "username": "zoe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Walking Wake": {
    "outdated": true,
    "sets": {
      "Sun Attacker": {
        "description": "<ul> <li>Walking Wake is a powerful special attacker and can function as a Water-type attacker on sun teams thanks to Hydro Steam and Protosynthesis.</li> <li>Hydro Steam is Walking Wake's primary STAB move. While it's simply good outside sun, there are very few things that can switch in on it in sun.</li> <li>Draco Meteor is Walking Wake's strongest move and can slam common Water-resistant Pokemon such as opposing Walking Wake and Palafin.</li> <li>Flamethrower is a strong sun-boosted coverage move that deals super effective damage to Pokemon like Amoonguss and Kingambit, which otherwise resist Walking Wake's STAB moves.</li> <li>Protect keeps Walking Wake safe against faster threats and through field effects and should always be used with Life Orb. Choice Specs Walking Wake should run Dragon Pulse as a consistent Dragon-type STAB option to lock into.</li> <li>Tera Fairy is chosen to remove Walking Wake's weaknesses to Dragon and Iron Bundle's Freeze-Dry. Tera Dragon can also be run to increase Draco Meteor's damage and grant Walking Wake an important Electric resistance against Iron Hands. Tera Water greatly increases Hydro Steam's damage while removing Walking Wake's weaknesses to Dragon- and Fairy-type moves.</li> <li>The EVs listed boost Walking Wake's Speed in sun. If a Special Attack boost is desired, move 8 EVs from Special Defense into Special Attack.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 27554, "username": "Arcticblast"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 531334, "username": "zoe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Sinistcha": {
    "sets": {
      "Trick Room": {
        "description": "<ul> <li> <p>Sinistcha faces competition from Grass-type redirectors like Ogerpon-W, Ogerpon-H and Amoongus. However, Sinistcha manages to gain a niche in bulky teams due to Hospitality healing either an ally just enough to survive an extra hit or a Pokemon that your opponent doesn't have the resources to deal with anymore like setup Raging Bolt and Iron Hands.</p> </li> <li> <p>Rage Powder allows Sinistcha to redirect attacks away from its partner, giving allies a safe opportunity to set up or attack without worrying about being targeted.</p> </li> <li> <p>Sitrus Berry recovery increases the chance of Sinistcha taking two attacks in the same turn, allowing it to set Trick Room or, the following turn, use Rage Powder or switch out to heal again with Hospitality on a later turn.</p> </li> <li> <p>Matcha Gotcha hits most of the metagame for neutral damage and threatens Diancie and both Ursaluna formes for super effective damage. The recovery provided by Matcha Gotcha allows Sinistcha to support its allies longer and survive both neutral and super effective attacks.</p> </li> <li> <p>Trick Room gives Sinistcha valuable speed control, allowing it to reverse the flow of the battle against Tailwind teams or to nullify an opposing Trick Room.</p> </li> <li> <p>Sinistcha's best partners are setup sweepers like Swords Dance Iron Hands, Calm Mind Raging Bolt, and Nasty Plot Galarian Moltres, all of which make good use of the healing and redirection it provides. Sinistcha also fits well on snow teams with Alolan Ninetales and Kyurem, as the added bulk given by Aurora Veil allows it to switch in multiple times.</p> </li> <li> <p>Shadow Ball 2HKOes Gholdengo, a Pokemon that otherwise sets up easily in front of Sinistcha. Life Dew can situationally heal bulky Pokemon like Ting Lu and Raging Bolt, while Protect positions around threatening attacks and blocks Tornadus’s Taunt.</p> </li> <li> <p>The given EV spread maximizes Sinistcha's bulk, allowing it to survive an Ice Spinner from Jolly Chien-Pao and Blizzard from maximum Special Attack Modest Kyurem while still almost threatening 2HKOs on Diancie and both Ursaluna formes.</p> </li> <li> <p>Tera Water makes the above Ice-type attacks a 3HKO and removes Sinistcha's Fire weakness, letting it handle Fire-types like Incineroar easier. Tera Water also helps against Gholdengo by removing the Ghost weakness and allowing Sinistcha to resist Make It Rain.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 509849, "username": "waffle2O2O"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 159382, "username": "qrChar"}, {"user_id": 617069, "username": "LogIce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}]}]}
  },
  "Okidogi": {"sets": {"Assault Vest": {"description": "<p>Okidogi's Speed investment lets it outspeed Dragapult and Adamant Choice Scarf Landorus-T in Tailwind.</p>"}}},
  "Ogerpon-Wellspring": {
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li>Ivy Cudgel is a strong STAB option that hits common threats like Landorus, Incineroar, and Diancie super effectively and threatens an OHKO on Flutter Mane while also dealing solid damage to neutral targets.</li> <li>Ogerpon-W has quite a few options for its Grass-type STAB attack to hit Water-resistant foes like Palafin, Volcanion, and opposing Ogerpon-W. Horn Leech has respectable power in addition to giving Ogerpon-W a way to sustain itself, which can be helpful considering how crucial its health is. Power Whip is a stronger option, allowing Ogerpon-W to hit some targets harder than it would with Ivy Cudgel such as Tyranitar and Ursaluna.</li> <li>Follow Me leverages Ogerpon-W's good typing to support its team and shield its teammates from threatening attacks and status moves, with Water Absorb allowing it to heal from Water-type attacks such as Palafin's Jet Punch and Volcanion's Steam Eruption. Encore punishes Fake Out, Protect, and speed control moves, forcing the Encore target to switch out or repeatedly use a detrimental move, generating momentum for Ogerpon-W's team.</li> <li>Ogerpon-W usually uses Spiky Shield, but on faster-paced teams, it might opt to drop this for Encore due to the utility of Follow Me being desired in addition to Encore's potential to swing the momentum of a game.</li> <li>In addition to the usual benefits, Ogerpon-W gains +1 Special Defense upon Terastallizing, considerably improving its matchups against Flutter Mane and Deoxys-A.</li> <li>The given EV spread lets Ogerpon-W outspeed Landorus and survive a Tera Stellar Chien-Pao Icicle Crash, with the rest of the EVs going into Attack to allow Power Whip to OHKO maximum HP Flutter Mane. Alternatively, an EV spread of 252 HP / 28 Atk / 84 Def / 72 SpD / 72 Spe with an Adamant nature can be used to survive a Choice Band Tera Normal Extreme Speed from Dragonite with Sword of Ruin active or a Choice Specs Tera Fairy Moonblast from maximum Special Attack Flutter Mane while still outspeeding Smeargle and Modest Glimmora.</li> <li>Tornadus makes a great partner for Ogerpon-W, as it provides Prankster Tailwind support and threatens Grass-types Ogerpon-W can't touch such as Rillaboom and opposing Ogerpon-W with Bleakwind Storm, and it can even strengthen Ivy Cudgel with Rain Dance. Flutter Mane threatens out Dragon-types like Baxcalibur and Raging Bolt that resist Ogerpon-W's STAB combination, and it appreciates the potential Follow Me support Ogerpon-W provides to draw strong priority attacks like Kingambit's Sucker Punch and Rillaboom's Grassy Glide away from it. Setup Pokemon such as Swords Dance Kingambit appreciate Ogerpon-W providing both Follow Me and Encore support to generate setup opportunities for them by either redirecting attacks or shutting down an opposing Pokemon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 531334, "username": "zoe"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 230771, "username": "qsns"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ogerpon-Hearthflame": {
    "sets": {
      "Cudgel Bonk": {
        "description": "<ul> <li>Ogerpon-H uses Wood Hammer to deal huge damage, allowing it to OHKO Diancie and both Ursaluna formes. Horn Leech can be used instead to increase its longevity at the cost of dealing a lot less damage.</li> <li>Ogerpon-H provides redirection, allowing its allies to set up or position safely. Ogerpon-H is particularly good at redirecting Spore from Amoonguss due to its immunity.</li> <li>Focus Energy can be run over Follow Me to increase Ogerpon-H's offensive prowess. This allows Ivy Cudgel to always be a critical hit, letting Ogerpon-H ignore Attack drops from Incineroar's Intimidate and damage reduction from Alolan Ninetales's Aurora Veil.</li> <li>When Ogerpon-H Terastallizes, Embody Aspect enables it to easily threaten Kyurem in snow through Aurora Veil with Ivy Cudgel, and it loses its weakness to Sludge Bomb from Landorus and Bleakwind Storm from Tornadus. Ogerpon-H is capable of OHKOing Landorus and 2HKOing Iron Hands and Cresselia with Ivy Cudgel thanks to Terastallization.</li> <li>Ogerpon-H is primarily used as an offensive threat, capable of OHKOing prominent offensive and support Pokemon, such as Gholdengo, Rillaboom, Amoonguss, and Sinistcha.</li> <li>Ogerpon-H synergizes well with Chien-Pao, since it can easily threaten Landorus and Tornadus, which Ogerpon-H is offensively threatened by due to their strong STAB move. Ogerpon-H threatens Steel-types Chien-Pao struggles against such as Gholdengo and Kingambit.</li> <li>Ground-types such as Landorus and Ursaluna-B greatly appreciate Ogerpon-H's ability to threaten Rillaboom, which threatens both with its potent Wood Hammer and Grassy Glide. Meanwhile, both can easily dispatch Raging Bolt, which Ogerpon-H struggles against.</li> <li>Dragon-type partners, such as Raging Bolt and Regidrago, appreciate Ogerpon-H KOing threats like Chien-Pao and Alolan Ninetales as well as common redirectors like Amoonguss and Sinistcha. Ogerpon-H's redirection utility additionally allows Raging Bolt to easily set up with Calm Mind. In return, Raging Bolt can easily dispatch Ogerpon-W, opposing Raging Bolt, and Roaring Moon, which threaten Ogerpon-H and are tricky for it to defeat. Meanwhile, Regidrago's Dragon Energy can remove Dragon-types that Ogerpon-H struggles to damage.</li> <li>Ogerpon-H supports Steel-types like Gholdengo and Kingambit exceptionally well. Ogerpon-H threatens opposing Steel-types its teammates struggle to damage as well as Ground-types that threaten them like the Ursaluna formes. In return, Gholdengo provides a strong special offensive presence to complement Ogerpon-H's physical offense, and Kingambit dissuades Intimidate cycling from Incineroar thanks to Defiant.</li> <li>Ogerpon-H works very well on a core of Gholdengo, Tornadus,and Regidrago, taking advantage of their offensive coverage and Tailwind support as well as providing its own offensive coverage as well as redirection.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589964, "username": "RauSakura"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 617069, "username": "LogIce"}, {"user_id": 586432, "username": "big pichu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ogerpon-Cornerstone": {"sets": {"Attacker": {}}},
  "Gouging Fire": {"sets": {"Howl Support": {}}},
  "Raging Bolt": {"sets": {"Assault Vest": {"description": "<ul> <li>This EV spread survives Icicle Crash from Adamant Chien Pao, OHKOes Max HP Tornadus with Thunderbolt, and outspeeds uninvested Rillaboom and Chien-Pao in Tailwind.</li> </ul>"}, "Calm Mind": {"description": "<ul> <li>This EV Spread survives a Life Orb Ice Spinner from Chien-Pao and +2 Kowtow Cleave from Kingambit.</li> </ul>"}}},
  "Iron Crown": {
    "sets": {
      "Fast Calm Mind Sweeper": {
        "description": "<ul> <li> <p>Iron Crown is one of the best sweepers of the tier that, thanks to Expanding Force, hits really hard even without boosts! With Booster Energy, Iron Crown outspeeds almost everything in the metagame, and while in Psychic Terrain, it can gain a significant advantage early-game or close games easily after Dark- and Steel-types in its path have been removed.</p> </li> <li> <p>Tachyon Cutter hits harder than Expanding Force when Psychic Terrain isn't up and helps against snow teams, OHKOing Alolan Ninetales before it can set up Aurora Veil. Notably, its two-hit nature allows Iron Crown to remove Focus Sash Pokemon like Chien-Pao and Glimmora with one move.</p> </li> <li> <p>Calm Mind makes Iron Crown hard to remove with special attackers, especially if it Terastallized, and also helps to KO bulkier Pokemon like Terastallized Assault Vest Iron Hands, Assault Vest Rillaboom, and Gholdengo.</p> </li> <li> <p>The EV spread is made to get the boost in Speed with Quark Drive while getting the maximum Special Attack possible, and the bulk investment is used to take a Flare Blitz from Incineroar.</p> </li> <li> <p>Iron Crown pairs perfectly with Indeedee-F by setting up Psychic Terrain, helping it set up Calm Mind with Follow Me, and enabling it with Helping Hand to pick up KOs on foes like Terastallized Ogerpon-W after a boost. Iron Crown appreciates Follow Me for setup, and for this reason, it's usually paired with Ogerpon-W or Ogerpon-H. Ogerpon-W helps in dealing with Landorus and Fire-types like Incineroar and Chi-Yu, which can threaten Iron Crown, while Ogerpon-H can remove Steel-types like Gholdengo and Kingambit, which would otherwise prevent a sweep. Both Ogerpon formes can also threaten Ting-Lu, a foe that's otherwise hard to remove.</p> </li> <li> <p>Landorus is another Pokemon that helps to remove Steel- and Fire-types. Tornadus is great too, since it threatens Rillaboom with Bleakwind Storm and makes sure that Iron Crown is always the fastest Pokemon by matching the Tailwind from opposing Tornadus and Roaring Moon.</p> </li> <li> <p>Tera Psychic increases Expanding Force's damage output further, helping to get KOs and putting a lot of pressure on the opponent, especially after a Calm Mind. It also allows Iron Crown to take neutral damage from Landorus's Earth Power, Incineroar's Flare Blitz, and Ogerpon-H's Ivy Cudgel. Tera Dragon allows Iron Crown to wall both Ogerpon-W and Ogerpon-H's STAB moves and take neutral damage from Gholdengo's Shadow Ball and Dark-type moves from Kingambit and Chien-Pao. The added resistances are especially useful in the Rillaboom matchup, since the STAB boost from Tera Psychic isn't as relevant without Psychic Terrain.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 509849, "username": "waffle2O2O"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 553122, "username": "gephicka"}, {"user_id": 617069, "username": "LogIce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  }
}