{
  "Ditto": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li>Ditto is a niche revenge killer that can also be used to attempt a reverse sweep, but it must be wary of threats that may counter it with a surprise Terastallization, such as Tera Fairy Miraidon, Tera Fire Koraidon, Tera Ice Iron Bundle, and Tera Water Gholdengo.</li> <li>Ditto doesn't add much value to teams on its own outside of helping overwhelm opposing checks. It is also strongly prediction reliant.</li> <li>Maximum bulk and minimum Speed allow Ditto to force opposing Ditto to trigger Imposter first and run out of PP quicker.</li> <li>Tera Fairy defeats Choice Scarf Miraidon, Koraidon, and Walking Wake that may try to attack it with a Dragon-type move.</li> <li>Ditto is rarely a reliable check for reasons explained earlier, so it appreciates support from backup checks, especially for potent threats that it fails to revenge kill such as Swords Dance Chien-Pao, Double Dance Miraidon, and Bulk Up Great Tusk. Thus, teammates like Toxapex, Skeledirge, Ting-Lu, Clodsire, and Iron Treads are good picks.</li> <li>Ditto's ability to revenge kill many strong threats makes teambuilding flexible, allowing offensive Pokemon like Miraidon, Iron Bundle, Chien-Pao, and Koraidon to fit more easily.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "pichus", "user_id": 374620}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "Aberforth", "user_id": 249382}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Mewtwo": {
    "sets": {
      "Nasty Plot": {
        "description": "<ul> <li>Mewtwo is a niche wallbreaker by courtesy of its access to Nasty Plot and usable Speed stat letting it outspeed Pokemon like Arceus and most Eternatus variants. Its ability to dismantle common defensive Pokemon, like most Arceus formes, and discourage Pokemon like Zacian-C from switching in, makes it a very hard Pokemon to deal with defensively.</li> <li>However, Mewtwo's Speed stat leaves it outsped by common Pokemon like Zacian-C, Koraidon, Miraidon, and Flutter Mane, all of which can heavily damage, if not outright OHKO, it.</li> <li>Grass Knot hits Mewtwo's biggest roadblock in Ting-Lu for massive damage.</li> <li>Flamethrower retains the hit on Zacian-C and Tera Steel Clodsire for big damage while also damaging other Tera Steel Pokemon like Giratina-O.</li> <li>Taunt allows Mewtwo to stop Defog attempts from the likes of Giratina-O and Corviknight while also denying recovery attempts from Skeledirge and Arceus formes. Moreover, Taunt also permits Mewtwo to antilead Ribombee and deny its Sticky Web, being one of the few Pokemon that can accomplish this without losing an important chunk of HP in the process.</li> <li>Earth Power can be used instead to greatly damage Zacian-C, Skeledirge, and tera Steel Pokemon like Clodsire.</li> <li>Tera Steel allows Mewtwo to resist both of Zacian-C's STAB moves while also resisting Extreme Killer Arceus's Extreme Speed, which is particularly important, as Extreme Killer Arceus is a very common offensive answer to Mewtwo.</li> <li>Heavy-Duty Boots allows Mewtwo to ignore entry hazards like Spikes and, most importantly, Toxic Spikes. Leftovers can be used instead as Mewtwo's only form of recovery. Lastly, Life Orb can be used to greatly increase Mewtwo's damage output, allowing it to have a favorable chance of OHKOing Ting-Lu after a Nasty Plot. A Modest nature can be used to ensure Mewtwo OHKOes Ting-Lu and Extreme Killer Arceus at +2 and works best on Sticky Web teams, as on them Mewtwo doesn't mind the loss in Speed and can break holes in teams more easily.</li> <li>It is advised to get Mewtwo on the field via smart double switches or U-turn from teammates like Koraidon, as per its underwhelming defensive typing, it doesn't get many opportunities to freely switch in. Once in the field, Mewtwo should dish out as much damage as possible or use Nasty Plot to break important Pokemon, like Calm Mind Arceus formes. Against faster foes without pivoting moves like Zacian-C, Mewtwo can freely Terastallize into a Steel-type to resist both of its STAB moves and hit back hard with an Earth Power or Flamethrower.</li> <li>Mewtwo struggles against faster foes, like Zacian-C, Koraidon, and Flutter Mane. Because of this, Pokemon like Landorus-T, Skeledirge, and Clodsire make for good partners. Landorus-T and Clodsire in particular help Mewtwo by spreading entry hazards, allowing it to net some KOs that it would normally miss, such as against Arceus-Steel, a Pokemon that now gets OHKOed by a +2 Flamethrower after a single layer of Spikes.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>Choice Specs Mewtwo is a strong and decently fast wallbreaker that crucially outspeeds Arceus. Its power and coverage give Mewtwo the ability to OHKO or 2HKO just about every Pokemon in the tier.</li> <li>However, Mewtwo can easily be revenge killed by Miraidon and Koraidon, both of which outspeed and threaten a KO on it after Stealth Rock.</li> <li>Psystrike capitalizes on the lack of Psychic-resistant foes, as even Zacian-C struggles to take more than two Psystrikes. It also helps against Calm Mind Arceus, especially Tera Poison variants.</li> <li>Ice Beam hits Pokemon like Giratina-O and Tera Flying users like Zacian-C. Mewtwo can use Tera Fire to resist Tera Flying Zacian-C's STAB moves and OHKO it with Ice Beam after minimal chip damage.</li> <li>Flamethrower hits Zacian-C and Tera Steel users. Koraidon's sun can ensure the OHKO on Zacian-C as well as 2HKO on max HP Arceus.</li> <li>Grass Knot is mainly used for hitting Mewtwo's worst enemy, Ting-Lu. It also hits Arceus-Ground, Kyogre, and Groudon much harder than Ice Beam, potentially scoring OHKOes if they run more offensive spreads.</li> <li>Tera Fire gives Mewtwo useful resistances against common revenge killing options like Koraidon's Flare Blitz and Zacian-C's STAB moves. If sun is active, Tera Fire Flamethrower can 2HKO bulky foes such as Clodsire and Koraidon.</li> <li>Choice Specs Mewtwo's most important partner is Koraidon, usually with Choice Scarf. Koraidon helps power up Mewtwo's Flamethrower and lures in Mewtwo's favorite targets such as bulky Arceus formes and other physical checks.</li> <li>Defensive partners like Clodsire, Ting-Lu, Skeledirge, Gliscor, and Landorus-T are appreciated to check threats like Miraidon, Koraidon, and Zacian-C.</li> <li>Miraidon and Calm Mind Arceus variants appreciate Mewtwo's effectiveness at breaking through specially bulky Pokemon like Ting-Lu, Clodsire, Iron Treads, and defensive Arceus formes.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}, {"username": "ox04", "user_id": 507268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "corvere", "user_id": 306317}, {"username": "ox04", "user_id": 507268}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Rose", "user_id": 511181}]}]}
  },
  "Skarmory": {"sets": {"Defensive": {"description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.759/\">new analyses</a>. These will update as the metagame continues to develop. Stay tuned!</p>"}}},
  "Blissey": {
    "outdated": true,
    "sets": {
      "Pink Blob (Specially Defensive)": {
        "description": "<ul> <li>Blissey functions as an blanket check to special attackers on balance and stall teams, being especially useful against hard-to-check special threats such as Calm Mind Miraidon, Chi-Yu, Iron Bundle, and Walking Wake.</li> <li>Seismic Toss is Blissey's only way to reliably deal damage to most opposing Pokemon, while Shadow Ball is able to do decent damage to Flutter Mane.</li> <li>Thunder Wave is extremely useful to cripple common switch-ins such as Koraidon and can also find use against Flutter Mane and Terastallized Miraidon.</li> <li>Blissey is a reliable setter of Stealth Rock, which can free up moveslots on Great Tusk and Iron Treads, but you should note that opposing Great Tusk and Iron Treads as well as Corviknight have little difficulty clearing entry hazards on Blissey.</li> <li>The Tera Type is quite flexible. Tera Ground is very useful against Calm Mind + Parabolic Charge Miraidon sets, as it completely negates their recovery and allows Blissey to force out them out.</li> <li>Tera Fire gives Blissey the ability to better take on Chi-Yu, with Heavy-Duty Boots negating the Stealth Rock weakness.</li> <li>Tera Ghost provides a Fighting-type immunity and allows Blissey to switch out of Dugtrio and Gothitelle.</li> <li>Solid defensive walls such as Skeledirge, Great Tusk, Dondozo, Scream Tail, and Dachsbun are good teammates to take on physical attackers like Koraidon that commonly come in on Blissey.</li> <li>Blissey is not capable of handling all Miraidon sets on its own, so Ting-Lu, Clodsire, and Iron Treads are heavily recommended teammates. In turn, these Ground-types have less pressure on them to stay healthy and can focus more on setting entry hazards.</li> <li>Care should be taken against Miraidon and Iron Bundle, which often use pivoting moves or Taunt to gain momentum on Blissey. Proper prediction with Blissey's teammates may be required to handle this.</li> <li>As a result, Rocky Helmet is an option, as it does damage to U-turn, Flip Turn, and Electro Drift users, making Miraidon and Iron Bundle unable to pivot on Blissey for free. If running Rocky Helmet, make sure you have plenty of Pokemon that can deal with entry hazards, such as Corviknight, Great Tusk, Iron Treads, and Hatterene.</li> <li>Flutter Mane is difficult for Blissey to reliably check due to Taunt and Psyshock sets, so Corviknight and Garganacl can help pick up the slack. In return, both appreciate Blissey being a safe switch-in to Iron Bundle.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "Aberforth", "user_id": 249382}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Ho-Oh": {
    "overview": "<p>Ho-Oh’s incredible stats, typing, and Regenerator make it one of the very best Pokemon in Ubers, being a great fit on many teams and performing well in nearly every battle. It is able to help its team stave off many threatening Pokemon like Koraidon, Extreme Killer Arceus, Necrozma-DM, and Calyrex-I. Even Pokemon like Miraidon and bulky Arceus formes that can take Ho-Oh’s STAB moves dislike getting burned by Sacred Fire. Unfortunately, Ho-Oh bears weaknesses to extremely dangerous Pokemon like Miraidon and Kyogre, making it not as hard to threaten as it might seem. Ironically, Ho-Oh’s greatest weakness is its high usage, as many Pokemon will run coverage specifically for it because of how common it is. For example, Zacian-C often runs Wild Charge, while Dragon Dance Arceus-Ground will often run Stone Edge. This, in conjunction with the fact that it needs to stay at high HP to check Scale Shot Koraidon, means it can get overwhelmed over the course of a game. Many physical attackers also run Tera Fire to gain an immunity to Sacred Fire burns and potentially use Ho-Oh as an opportunity to set up. Despite all of these, Ho-Oh is a fantastic Pokemon that every team must have a plan against and should be considered for any bulky team.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Whirlwind is the preferred option for setup threats that run Tera Fire to set up on Ho-Oh, most notably Koraidon, Necrozma-DM, and Calyrex-I. Earthquake can be used to hit Miraidon, which otherwise can switch into Ho-Oh and proceed to force it out. Earthquake with Tera Ground also punishes use of Tera Fire on boosting threats to set up on Ho-Oh, although phazing a boosting threat with Whirlwind is often easier and more consistent. Tera Fairy is useful to block Scale Shot from Koraidon, which otherwise 2HKOes it without a boost. Tera Ground gives Ho-Oh STAB on Earthquake and turns its weaknesses to Electric- and Rock-type attacks into resistances. This allows it to turn the tables on Arceus-Ground and Flutter Mane, which commonly run Rock-type coverage to beat Ho-Oh. In conjunction with its high Special Defense, Tera Ground allows Ho-Oh to act as a soft check to Miraidon. Tera Grass gives Ho-Oh resistances to Electric and Water, allowing it to act as a soft check to Miraidon and Kyogre in a pinch.</p> <p>Ho-Oh fits on many bulky teams as an important part of their defensive core, but it cannot act as a team’s sole defensive check to threats like Koraidon, Zacian-C, and Extreme Killer Arceus, as these Pokemon can either overwhelm Ho-Oh with strong attacks or commonly run coverage specifically for it. Thus, more concrete checks to these Pokemon like Arceus-Fairy and Necrozma-DM are appreciated. Ho-Oh also does not match up well into Miraidon and Kyogre, so checks to them like Arceus-Ground, Ting-Lu, and Eternatus are essential. In return, Ho-Oh’s biggest boon to its team is Sacred Fire, allowing it to reliably spread burns and sometimes forcing Terastallization out of Pokemon like Necrozma-DM. Both of these attributes can be taken advantage of by Pokemon like Koraidon, Miraidon, and Zacian-C, which enjoy their checks being burned or not being able to Terastallize to stop them.</p>"
      },
      "Offensive": {"description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.759/\">new analyses</a>. These will update as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "OreoSpeedruns", "user_id": 597293}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "corvere", "user_id": 306317}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Kyogre": {
    "overview": "<p>Despite Miraidon taking the spotlight of Ubers's top special wallbreaker, Kyogre is still one of the most threatening Pokemon in the tier, as it often breaks better than Miraidon thanks to teams preparing for it less. Kyogre also sports a surprising amount of defensive utility, as its Drizzle is very useful against Koraidon, and it has enough bulk to take on even physical threats such as Arceus-Ground and Calyrex-I. Kyogre is somewhat limited by its average Speed stat, lack of recovery making it worn down by repeated hits, and by how common Koraidon and Miraidon are, but outside of these flaws, Kyogre should be considered for nearly any bulky offense or balance team.</p>",
    "comments": "<h1>Other Options</h1> <p>Substitute is an option to allow Kyogre to bypass Eternatus and Clodsire's Toxic, but this set requires Thunder Wave and high bulk investment to work and is generally outclassed by more offensive sets that can threaten Koraidon, Miraidon, Arceus-Water, and opposing Kyogre more effectively. Rest is inadvisable thanks to Miraidon's Electric Terrain preventing its use. Mystic Water and Water Spout may be run on a Thunder Wave set. This gives Kyogre a 64.5% chance to 2HKO Eternatus with Water Spout at full HP, but this set is too vulnerable to entry hazard damage to be realistic.</p> <h1>Checks and Counters</h1> <p><strong>Eternatus</strong>: Eternatus is the most common hard check to Kyogre, as it outspeeds Kyogre and can Toxic stall it in conjunction with Recover. However, Eternatus must be careful of paralysis and Tera Poison.</p> <p><strong>Koraidon and Miraidon</strong>: Koraidon's sun severely weakens Kyogre's Water-type attacks, effectively negating any of Kyogre's wallbreaking ability. Miraidon has good special bulk and can power through even boosted Kyogre. However, both Pokemon loathe coming in on Ice Beam.</p> <p><strong>Clodsire</strong>: Thanks to Water Absorb, Clodsire can use Toxic against Kyogre and stall out Ice Beam with Recover. However, since Clodsire is slower, it runs the risk of being frozen by repeated Ice Beams, and boosted Ice Beams will 2HKO Clodsire. Tera Steel Clodsire hard walls Kyogre and has next to nothing to fear from it.</p> <p><strong>Water-types</strong>: Kyogre can pivot into opposing Kyogre using Ice Beam and trade with it using Thunder. Arceus-Water, especially Calm Mind variants, is a decent check to Kyogre sets that lack Thunder.</p> <p><strong>Giratina-O</strong>: Giratina-O is bulky, resists Water, and can shave off over half of Kyogre's HP with Poltergeist while often being faster than it. However, it must watch out for Ice Beam.</p> <p><strong>Arceus-Grass</strong>: Albeit rare, Arceus-Grass can hard wall anything Kyogre can throw at it, match Kyogre's boosts with Calm Mind, and do massive damage back with Grass Knot.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>Origin Pulse's higher power allows for some notable KOs, like OHKOing Ho-Oh outright and having a high chance to OHKO Zacian-C and Necrozma-DM after a layer of Spikes damage. Surf may be chosen for its perfect accuracy. Ice Beam nails Koraidon and Miraidon on the switch in and is Kyogre's best tool to pressure Eternatus and Clodsire. Thunder lets Kyogre break through Arceus-Water and opposing Kyogre, and its 30% paralysis chance is quite useful. Alternatively, Thunder Wave can be used to more directly cripple Eternatus on the switch in. Tera Fairy is usually chosen for its use against Koraidon, allowing Kyogre to take Scale Shot or Low Kick and retaliate back. Tera Poison has use for blocking Toxic from Eternatus, and it can let Kyogre absorb Toxic Spikes for teams that lack a Poison-type or Defog. Since Kyogre does not need the power of a boosting item, Heavy-Duty Boots is the best option, as it lets Kyogre pressure the opposing team without having to worry about entry hazard damage. It's also critical for the hyper offense matchup, as it allows Kyogre to survive +1 Arceus-Ground's Earthquake and +1 Necrozma-DM's Photon Geyser even with entry hazards up. The given EVs allow Kyogre to outspeed paralyzed Zacian-C and Deoxys-A, while the HP and Defense allow Kyogre to survive four hits from Koraidon's Scale Shot at +2, with the rest dumped into Special Attack. A more bulky spread of 248 HP / 164 Def / 80 SpA / 16 Spe with a Bold nature allows Kyogre to take one +2 Low Kick from Koraidon as well as +1 Arceus-Ground's Tera Ground-boosted Earthquake.</p> <p>Kyogre excels on bulky offense and balance teams thanks to its excellent wallbreaking ability and good defensive utility. Arceus-Fairy is a fantastic teammate, as the two together make for perhaps the safest core against Scale Shot Koraidon in the tier. Additionally, Arceus-Fairy can come in on the Choice Scarf Koraidon that Kyogre attracts with ease while also providing Thunder Wave support that may allow Kyogre to get past Eternatus. Choice Scarf Koraidon and Miraidon are good partners for cleaning up weakened teams and can bring in Kyogre easily with U-turn to take advantage of Ting-Lu, Arceus-Ground, and Ho-Oh switch-ins. Ground-types like Ting-Lu, Arceus-Ground, and Clodsire are highly recommended for dealing with Miraidon, which can OHKO even boosted Kyogre. Ting-Lu, Clodsire, and Gliscor also come with the benefit of Spikes support, chipping away at common switch-ins like Koraidon and Arceus-Water. Necrozma-DM can handle Eternatus and Zacian-C, with Kyogre coming in on Ho-Oh and Ground-types for it in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "OreoSpeedruns", "user_id": 597293}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Groudon": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Thanks to Groudon's excellent physical bulk, it soft checks numerous physical threats in the tier such as Arceus, physical variants of Arceus-Ground, Koraidon, and Zacian-C.</li> <li>16 EVs in Speed allow Groudon to outspeed uninvested Kyogre, Giratina-O, and Landorus-T. Alternatively, a spread of 252 HP / 252 Def / 4 SpD can be used to maximize Groudon's bulk.</li> <li>Precipice Blades is a powerful STAB option that OHKOes Zacian-C and Miraidon and has a chance to OHKO Eternatus, whereas Earthquake is a weaker STAB option that offers greater accuracy.</li> <li>Will-O-Wisp cripples physical threats Groudon switches into such as Arceus, Koraidon, and physical variants of Arceus-Ground.</li> <li>Spikes helps chip down switch-ins for the rest of the game due to the limited distribution of hazard removal in the tier. Alternatively, Stealth Rock can be used for the same purpose but Spikes is recommended as it hits all targets neutrally.</li> <li>Groudon tends to struggle against special wallbreakers such as Miraidon and Flutter Mane, so Protect is a great option to scout for a potential Choice item and increase its Leftovers recovery. Alternatively, Bulk Up can be used to beat physical setup sweepers such as Swords Dance Arceus formes and Koraidon.</li> <li>Leftovers is mandatory on Groudon, since it does not have any reliable recovery.</li> <li>Tera Fairy gives Groudon an immunity to Dragon-type attacks from the likes of Miraidon, Eternatus, and Koraidon.</li> <li>Tera Water lets Groudon resist Zacian-C's STAB Behemoth Blade, Calyrex-I's STAB Glacial Lance, and Koraidon's sun-boosted Fire-type attacks.</li> <li>Due to Groudon being unable to reliably check physical threats long-term, it’s best to have some form of speed control such as Choice Scarf Koraidon or a reliable wall such as Skeledirge alongside it.</li> <li>Breakers such as Miraidon and Flutter Mane really appreciate Groudon's ability to reliably set both sun, which boosts their Fire-type attacks, and Spikes, which allows them to wallbreak more effectively. Koraidon also has great synergy with Groudon as they both set sun. It also appreciates Spikes support from Groudon.</li> </ul>"
      },
      "Swords Dance": {
        "description": "<ul> <li>Swords Dance Groudon is a threatening wallbreaker that is able to pressure defensive Pokemon such as Skeledirge, Clodsire, and Ting-Lu.</li> <li>Crunch is chosen as the primary coverage move to hit Giratina-O super effectively and also hit Corviknight neutrally. Spikes and Stealth Rock make progress against the switches Groudon forces, but Fire Punch is another option that breaks through Corviknight while also synergizing with Drought and Tera Fire.</li> <li>The given EV spread outspeeds uninvested Giratina-O, Kyogre, and Landorus-T while maximizing bulk and damage output. An alternate spread with 252 Atk / 4 Def / 252 Spe and a Jolly nature can be used on Sticky Web teams as a sweeper.</li> <li>Lum Berry can be used to get past Will-O-Wisp users like Arceus and Giratina-O, though this cuts into Groudon's longevity.</li> <li>Tera Ground boosts Groudon's Precipice Blades to absurd levels, letting it OHKO even bulkier variants of Arceus at +2. Tera Fire lets Groudon avoid Will-O-Wisp entirely and powers up Fire Punch but makes it susceptible to being revenge killed by Arceus-Ground and opposing Groudon. Tera Fairy is an option to become immune to Miraidon's and Giratina's Draco Meteor, but the other Tera types are generally preferred thanks to their offensive power.</li> <li>Groudon is best used on bulky offense as an offensive entry hazard setter that can come in on slower Pokemon such as Clodsire, Skeledirge, and Ting-Lu and use them as setup fodder. Groudon forces switches thanks to its power, so use these chances to aggressively set hazards or use Swords Dance.</li> <li>Miraidon is a great partner for being able to pivot Groudon into Clodsire and Ting-Lu while also being able to pressure Groudon's checks like Giratina-O and Corviknight. The two Pokemon also share a check in Arceus-Ground, which they can overwhelm. Koraidon is a similarly good partner for sharing a check in defensive Arceus-Fairy, which they can overwhelm together. Koraidon also can U-turn into Groudon on incoming Skeledirge, which Groudon can use as an opportunity to set hazards or force a defensive Terastallization. Utility Arceus-Fairy can form a hazard stacking core with Groudon while also helping check Giratina-O, Koraidon, and Miraidon. Finally, Arceus-Water, Clodsire, and Eternatus are solid partners, as they all check Kyogre, which cannot switch into Groudon repeatedly but can threaten it out.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "GeniusFromHoenn", "user_id": 530778}, {"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "ox04", "user_id": 507268}, {"username": "Eledyr", "user_id": 415367}, {"username": "Manaphy", "user_id": 50695}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Rayquaza": {
    "sets": {
      "Dragon Dance": {
        "description": "<ul> <li>With Dragon Dance, Rayquaza serves as a threatening late-game sweeper with the ability to boost its already sky-high Attack and fix its issue with Speed.</li> <li>Heavy-Duty Boots is generally the preferred item thanks to nullifying Rayquaza's otherwise bad weakness to Stealth Rock, but Life Orb enables Rayquaza to perform ridiculous feats like guaranteeing an OHKO on Zacian-C after a single boost.</li> <li>Tera Flying further strengthens Rayquaza's already spammable Dragon Ascent, letting Life Orb Rayquaza crush bulky teams. At +1, Life Orb Tera Flying Dragon Ascent has good odds to 2HKO even the most physically defensive Corviknight.</li> <li>Tera Fire gives Rayquaza a valuable resistance to Fairy, letting it set up on Zacian-C, Arceus-Fairy, and Flutter Mane, while also letting it become immune to Will-O-Wisp from Groudon and Skeledirge.</li> <li>Extreme Speed allows Rayquaza to revenge kill weakened foes in a pinch, most notably Scale Shot Koraidon, Miraidon, and Extreme Killer Arceus.</li> <li>Substitute allows Rayquaza to block status-inducing moves like Will-O-Wisp from Skeledirge and Toxic from Clodsire, Toxapex, and Gliscor. It is generally not worth using with Life Orb because the combination cuts too much into Rayquaza's already awful longevity.</li> <li>Draco Meteor allows Rayquaza to beat Skeledirge and the rare Dondozo solo without Terastallizing. However, it has little practical use outside of this.</li> <li>A Naive nature should only ever be run when Rayquaza runs Draco Meteor. Jolly is the preferred nature in all other scenarios.</li> <li>Dragon Dance Rayquaza is best used on hyper offense teams that love its ability to punch big holes into bulky teams for its teammates to exploit late-game. Rayquaza is not much of a defensive presence, but it can be used to check dangerous Ground-types like Dragon Dance Arceus-Ground without sacrificing offensive output.</li> <li>Zacian-C forces out or baits Terastallization from Fairy- and Dragon-types that threaten Rayquaza, like Koraidon, Miraidon, and Arceus-Fairy, while being a ferocious offensive threat in its own right. Thus, it is an invaluable partner for Rayquaza.</li> <li>As Dragon Dance Rayquaza fits mainly on hyper offense teams, it should be paired with hyper offense leads like Glimmora and Meowscarada.</li> <li>Physical attackers that appreciate Rayquaza's ability to punch great holes into their checks are good partners for it, as they are made more dangerous late-game with their checks weakened. These include Extreme Killer Arceus, Scale Shot Koraidon, and Dragon Dance Arceus-Ground.</li> </ul>"
      },
      "Swords Dance": {
        "description": "<ul> <li>Swords Dance Rayquaza functions as a strong wallbreaker and a potential revenge killer or late-game cleaner thanks to Extreme Speed. Dragon Ascent is Rayquaza's go-to move with which it can 2HKO Skeledirge, Giratina-O, and most Arceus formes.</li> <li>Earthquake is a valuable coverage move that allows Rayquaza to hit Flying-resistant foes like Zacian-C and Miraidon for massive damage.</li> <li>Swords Dance allows Rayquaza to turn the aforementioned 2HKOs into OHKOs and 2HKO Corviknight with Dragon Ascent.</li> <li>Extreme Speed allows Rayquaza to pick off weakened targets or even sweep with the combination of Tera Normal and Swords Dance. After a Swords Dance, Tera Normal Extreme Speed can OHKO even Koraidon and Miraidon.</li> <li>Life Orb is crucial for this set because it gives Rayquaza the necessary power boost to score OHKOs and 2HKOs that it needs to.</li> <li>Jolly is necessary because it allows Rayquaza to get the jump on foes like the plethora of base 90 Speed Pokemon such as Kyogre as well as suicide leads such as Glimmora. On Sticky Web teams it's even more important because Adamant Rayquaza can't outrun -1 Speed Zacian-C.</li> <li>Swords Dance Rayquaza fits on more offensive teams where it can switch in on defensive Ground-types such as Landorus-T, Ting-Lu, and Clodsire. Rayquaza pairs exceptionally well with Sticky Web setters such as Ribombee, as they let it outspeed Zacian-C, previously faster Arceus formes, and non-Choice Scarf Koraidon and Miraidon, which can all be OHKOed after a Swords Dance.</li> <li>Rayquaza also pairs well with Extreme Killer Arceus and Kingambit because together they form a priority core that gives their team a very reliable safety net against common sweepers like Koraidon and Miraidon. Rayquaza also appreciates Taunt users like Miraidon and Arceus because they can prevent foes from setting up hazards or healing to try to stay out of range of Rayquaza's attacks.</li> </ul>"
      },
      "Suicide Lead": {
        "description": "<ul> <li>Rayquaza has a niche as a suicide lead over other Pokemon like Glimmora thanks to its base 150 Attack and Special Attack stats. This allows it to beat other common leads like the aforementioned Glimmora, as Draco Meteor ignores Toxic Debris, and Ribombee while also threatening other Pokemon, mainly physically bulky Pokemon like Landorus-T that are annoying to its teammates.</li> <li>Unfortunately for Rayquaza, the prevalence of Taunt Arceus hinders its ability to consistently lay down entry hazards. Furthermore, Scale Shot Koraidon is very common and is an effective anti-lead that beats Rayquaza. Other Pokemon like Zacian-C also take advantage of Rayquaza not being able to hit it with a super effective move and heavily threaten the opposing team. Lastly, Calm Mind variants of Arceus are bulky enough to utilize Rayquaza as setup fodder and freely boost themselves without much threat.</li> <li>Draco Meteor with maximum Special Attack investment allows Rayquaza to lure in and 2HKO common physical walls, such as Landorus-T, Toxapex, Skeledirge, and Groudon.</li> <li>Tera Fairy allows Rayquaza to be immune to Dragon-type attacks, with the most notable example being Scale Shot from Koraidon; this gives Rayquaza an opportunity to deal huge damage on Koraidon without sacrificing HP or abilities on important teammates like Zacian-C's Intrepid Sword. However, it's not entirely advised to Terastallize immediately, as it must be saved as an emergency option only.</li> <li>Rayquaza is a suicide lead that must prioritize setting entry hazards while dealing damage if the situation presents it. Other common hyper offense leads, like Ribombee and Glimmora, lose the one-on-one against Rayquaza, which means that only dedicated teams with Pokemon like Taunt Arceus and dual screens Grimmsnarl can beat and annoy Rayquaza.</li> <li>Rayquaza fits best on hyper offense teams with teammates that appreciate Stealth Rock being set and physically bulky Pokemon being heavily damaged. As a result, Koraidon, Zacian-C, and physical Arceus formes are good teammates. Zacian-C in particular helps Rayquaza against Scale Shot Koraidon, one Pokemon that can outright OHKO Rayquaza even through Focus Sash. Flutter Mane is another Fairy-type Pokemon that can help with Scale Shot Koraidon while also dealing with the Taunt Arceus formes that annoy Rayquaza and its team. Rayquaza cannot prevent Pokemon like Ribombee and Glimmora from getting their own entry hazards up; therefore, Pokemon that can remove them, like Great Tusk and Iron Treads, are good partners.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "ox04", "user_id": 507268}, {"username": "OreoSpeedruns", "user_id": 597293}, {"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "Taka", "user_id": 595062}, {"username": "corvere", "user_id": 306317}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "Rose", "user_id": 511181}]}]}
  },
  "Deoxys-Attack": {
    "overview": "<p>When one looks at Deoxys-A, the first thing that stands out is its astronomical attacking stats. Its incredible base 150 Speed is also extremely relevant, as it leaves already fast Pokemon like Zacian-C, Koraidon, and Miraidon in the dust. This, in conjunction with its deep movepool, makes Deoxys-A a fearsome wallbreaker and revenge killer capable of threatening everything in the game for at least neutral damage. However, another notable aspect of Deoxys-A’s stats is its pitiful bulk that leaves it OHKOed by every attack in the game, giving it very limited opportunities to safely switch in and actually use its power, as well as leaving it prone to revenge killing from Choice Scarf users like Koraidon and Miraidon and priority from Pokemon like Extreme Killer Arceus. It also has trouble OHKOing some targets like Ting-Lu and Necrozma-DM despite its tremendous power because of a lack of either investment or STAB on its coverage. It is also significantly less threatening after it uses Psycho Boost, letting Pokemon like Miraidon and Dragon Dance Necrozma-DM use it as setup fodder. Despite that, Deoxys-A is a high-reward Pokemon that is worth its high risk if played properly.</p>",
    "comments": "<h1>Other Options</h1> <p>Superpower is an option on lead Deoxys-A for wearing down Ting-Lu for teammates such as Arceus-Ground, Miraidon, and Necrozma-DM. Psychic can be used over Psycho Boost to not risk a miss against Glimmora and Koraidon, but the power of Psycho Boost is useful against Arceus formes. Thunder Wave can be used to cripple opposing defensive Arceus formes and Zacian-C. On mixed attacker sets, Nasty Plot is a high-risk option that takes advantage of Deoxys-A’s ability to force switches. This usually pairs well with Focus Blast to threaten an OHKO on Ting-Lu.</p> <h1>Checks and Counters</h1> <p><strong>Revenge Killers</strong>: While Deoxys-A is very fast, it is still outsped by some Pokemon such as Choice Scarf Koraidon and Miraidon. Flutter Mane also outspeeds Deoxys-A in sun. These Pokemon cannot switch into Deoxys-A, but they can reliably threaten to revenge kill it.</p> <p><strong>Priority</strong>: Deoxys-A's awful bulk leaves it prone to all forms of priority, such as Extreme Speed from Extreme Killer Arceus and Rayquaza, Shadow Sneak from Giratina-O, Sucker Punch from Chien-Pao and Kingambit, and Ice Shard from Chien-Pao. Tera Ghost can mitigate the weakness to Extreme Speed, but Deoxys-A cannot threaten Arceus if it is at full HP.</p> <p><strong>Psychic-resistant Pokemon</strong>: While Deoxys-A is indeed impossible to safely switch into, it is not so strong that it doesn't have any issues with power. Pokemon that resist Psycho Boost, like Necrozma-DM, Zacian-C, and Ting-Lu, can come into it after a KO and check it, as Deoxys-A cannot OHKO these Pokemon. Necrozma-DM in particular is troublesome for Deoxys-A, as it can use Deoxys-A as setup fodder after taking Psycho Boost.</p>",
    "sets": {
      "Mixed Attacker": {
        "description": "<p>This set aims to get as much leverage out of Deoxys-A's limited switch-in opportunities as possible. Psycho Boost severely damages almost everything that doesn't resist it, with even defensive Ho-Oh being 2HKOed. Shadow Ball and Low Kick are mainly used to hit Pokemon that resist Psycho Boost. Shadow Ball hits enemy Psychic-types like Necrozma-DM and Calyrex-I super effectively, while Low Kick hits Zacian-C, Ting-Lu, and Kingambit on the switch. Rock Slide targets Ho-Oh, having a chance to OHKO it from full HP. Tera Ghost not only avoids revenge killing attempts from Extreme Killer Arceus but also turns Shadow Ball into a powerful attack that can serve as a strong, spammable STAB move, even OHKOing offensive Dragon Dance Necrozma-DM after minimal chip damage and doing impressive damage to defensive Necrozma-DM.</p> <p>Since Deoxys-A is so frail, it requires support from pivots to get on the field safely. Therefore, Choice Scarf Koraidon and pivot Miraidon are excellent partners, as they provide reliable pivoting in the form of U-turn while being offensively threatening in their own right. They also love Deoxys-A threatening their checks. Choice Scarf Koraidon has trouble getting past physically defensive Arceus formes like Arceus-Fairy, Arceus-Ground, and Arceus-Water, which Deoxys-A can break with Koraidon's U-turn support. Miraidon and Deoxys-A have common checks in healthy Ting-Lu and Arceus-Ground, so Deoxys-A pairing with Miraidon means one can work to overwhelm these checks for the other to go berserk. Entry hazard support from Gliscor and Ting-Lu is also appreciated, as it cuts down on the prediction Deoxys-A needs to actually break bulky Pokemon like Necrozma-DM and Ting-Lu. Checks to Extreme Killer Arceus and Choice Scarf Koraidon and Miraidon are also recommended, such as Zacian-C, Ting-Lu, Arceus-Ground, and Arceus-Fairy.</p>"
      },
      "Lead": {
        "description": "<p>Thanks to its incredibly high Special Attack and Speed, Deoxys-A is an strong alternative to Deoxys-S and Glimmora as an entry hazard setter. Shadow Ball does considerable damage to opposing Deoxys-S and Necrozma-DM. Icy Wind limits Deoxys-S to one layer of hazards while giving teammates like Miraidon and Koraidon easier entry into opposing lead Miraidon, Arceus formes, and Zacian-C. Psycho Boost is Deoxys-A’s main damage option and prevents Glimmora from getting up multiple layers of entry hazards. Taunt is another option that prevents Ribombee from setting up Sticky Web, but this is not preferred, since Ribombee often runs Pounce anyways. Stealth Rock is an option as well to let Deoxys-A set up dual hazards, but Deoxys-A’s lack of longevity and bulk means it is often limited to a single layer. Tera Ghost is the primary Tera type for giving Deoxys-A an immunity to Extreme Speed, letting it 2HKO Necrozma-DM, and for blocking Rapid Spin from Iron Treads, Great Tusk, and Terapagos. Tera Steel is also an option for blocking Glimmora's Mortal Spin.</p> <p>Deoxys-A primarily fits on hyper offense for its ability to set up entry hazards and generate momentum for its teammates. Partners like Zacian-C, Miraidon, Necrozma-DM, and Koraidon appreciate Deoxys-A setting up hazards and chipping their checks, such as Necrozma-DM, Arceus-Ground, and Arceus-Fairy. However, since Deoxys-A doesn't run Taunt often, opposing Ting-Lu leads can be difficult to deal with. Partners like Zacian-C, Koraidon, Kyurem-B, and Calyrex-I help overwhelm Ting-Lu. Furthermore, opposing Extreme Speed users such as Deoxys-S, Arceus, and Rayquaza can limit Deoxys-A to a single hazard. Teammates such as defensive Calm Mind Arceus-Ground can help take these on and provide more defensive utility to the hyper offense teams that Deoxy-A fits in. Opposing Giratina-O can anti-lead Deoxys-A and threaten teammates such as Necrozma-DM, Tera Ghost Koraidon, and Calyrex-I, so partners like Chien-Pao, Miraidon and Kyurem-B that can threaten it out are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "OreoSpeedruns", "user_id": 597293}, {"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}, {"username": "Lasen", "user_id": 273339}, {"username": "Aberforth", "user_id": 249382}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Deoxys-Speed": {"sets": {"Lead": {"description": "<p>16 Speed EVs allow Deoxys-S to outspeed Zacian-C, Miraidon, and Koraidon.</p> <p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.759/\">new analyses</a>. These will update as the metagame continues to develop. Stay tuned!</p>"}}},
  "Gliscor": {
    "overview": "<p>Gliscor has several qualities that make it extremely frustrating for balance and bulky offense teams to deal with. For one, the combination of Poison Heal and Toxic Orb gives it an immunity to status and great passive recovery. Gliscor's Ground / Flying typing offers a myriad of resistances, including an immunity to Spikes and a neutrality to Stealth Rock. When combined with Poison Heal, this essentially makes Gliscor almost entirely unaffected by opposing entry hazards. Additionally, Gliscor has access to a support movepool that most Pokemon could only dream of, featuring Spikes, Toxic, Toxic Spikes, and Knock Off. As such, Gliscor is a fantastic pivot in Ubers, notably taking Sacred Fire from Ho-Oh with ease and setting up hazards on staple threats like Choice Scarf Koraidon and Ting-Lu. This makes Gliscor one of the best Pokemon to take advantage of the lack of entry hazard removal options in Ubers. However, Gliscor is held back by its lackluster stats for Ubers standards; its Defense, while decent, is nowhere near good enough to take on titans like Scale Shot Koraidon, meaning Gliscor has limited use against hyper offense teams. Gliscor is also setup bait for one of the most common threats in the tier, Necrozma-DM, which is only 4HKOed by Earthquake. Gliscor's pathetic Special Defense by Ubers standards leaves it forced out by the vast majority of special attackers.</p>",
    "comments": "<h1>Other Options</h1> <p>Swords Dance can be run to make Gliscor a surprisingly effective wallbreaker when combined with Earthquake and Knock Off. However, this set relies on the surprise factor quite a bit, so it's not very consistent. Bulldoze and Sand Tomb are both viable attacking options, with Bulldoze notably annoying Dragon Dance users like Arceus-Ground, but Earthquake and Knock Off generally have more use. Taunt is possible to prevent set up from opposing Pokemon, although its utility is usually not enough to justify it over Gliscor's other options. U-turn may be run as a momentum option, but the loss of Protect greatly reduces Gliscor's bulk.</p> <h1>Checks and Counters</h1> <p><strong>Necrozma-DM</strong>: Necrozma-DM takes little from Earthquake, is immune to Toxic, and can easily use Dragon Dance or Swords Dance on Gliscor without much worry. However, Necrozma-DM must be wary of Knock Off, especially if Spikes are on the field.</p> <p><strong>Special Attacks</strong>: Gliscor quickly falls apart against the many strong special attackers in Ubers, such as Miraidon, Kyogre, Eternatus, and Calm Mind Arceus formes. These Calm Mind Arceus formes like Arceus-Water or Arceus-Ground use Tera Poison or Steel to become immune to Gliscor's Toxic. Dragon Dance Arceus-Ground may run Ice Beam to quickly dispatch Gliscor as well, although specially defensive Gliscor is only 2HKOed.</p> <p><strong>Taunt</strong>: Taunt from various Arceus formes, Miraidon, and Landorus-T can completely stop Gliscor from doing anything useful.</p> <p><strong>Poison-immune Flying-types</strong>: While rare, Corviknight utterly walls Gliscor and can prevent it from gaining momentum with Defog. Skarmory is immune to Toxic and Earthquake and can Spikes or Whirlwind with impunity on Gliscor.</p> <p><strong>Orthworm</strong>: Orthworm is immune to Earthquake and Toxic and can use Gliscor as a free Shed Tail opportunity.</p> <p><strong>Ice-types</strong>: Calyrex-I and Chien-Pao have little issue OHKOing any Gliscor that has not used Tera Water.</p> <p><strong>Giratina-O</strong>: While it despises Toxic, Giratina-O can Defog away Gliscor's entry hazards and heavily damage Gliscor with Hex. Giratina-O can also use Tera Steel to become immune to Toxic.</p> <p><strong>Gliscor</strong>: Gliscor is ironically a check to itself, as it is immune to Toxic and Earthquake and takes little from Knock Off. Thus, the Gliscor that has more PP will win.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>The combination of Earthquake and Toxic works very well together, as Earthquake deals super effective damage to Steel- and Poison-types, which are immune to Toxic. Alternatively, Knock Off may be run in either slot to remove Heavy-Duty Boots from opposing Pokemon like Ho-Oh and Kyogre, and thus make Gliscor's hazard stacking more effective. Do note that the lack of Earthquake makes Gliscor unable to check threats like Zacian-C, while the loss of Toxic makes Gliscor very passive against Pokemon with reliable recovery like the various Arceus formes that don't mind Knock Off. Spikes and Toxic Spikes are both powerful entry hazard options; Spikes is less matchup-dependent than Toxic Spikes is, but Toxic Spikes can be devastating against teams without a Poison-type. Protect is highly recommended, as it provides an easy way to activate Toxic Orb, can stall for Poison Heal recovery, and has good synergy with Toxic. Gliscor can run both defensive and specially defensive sets; Defense investment is more common thanks to Gliscor's decent Defense stat allowing it to check physical attackers like Zacian-C, but Special Defense investment lets Gliscor act as a pseudo-check to Heavy-Duty Boots Miraidon and set up hazards more easily against Arceus formes and Eternatus. Tera Water is chosen for defensive Gliscor, as it covers Gliscor's Water- and Ice-type weaknesses and provides a useful resistance to Necrozma-DM's Sunsteel Strike and Zacian-C's Behemoth Blade. Tera Fairy is used on specially defensive sets to take Miraidon's Draco Meteor if needed.</p> <p>While Gliscor is helpful against physical threats like Koraidon, Zacian-C, and Arceus-Ground, it should never be your main check to them, as Gliscor's bulk simply won't hold up over time. Therefore, teammates like Necrozma-DM, Arceus-Fairy, Arceus-Water, and Skeledirge are excellent for their ability to better take on physical attackers. Necrozma-DM is also greatly appreciated for its ability to Knock Off Heavy-Duty Boots. Gliscor works well with other hazard setters like Ting-Lu, Arceus-Fairy, and Clodsire, which can set Stealth Rock or Spikes that Gliscor may be missing out on. Arceus-Water, Ting-Lu, defensive Swords Dance Necrozma-DM, and Arceus-Dark are good partners for handling Dragon Dance Necrozma-DM that may attempt to set up on Gliscor. For specially defensive Gliscor, alternate switch-ins to Miraidon such as Arceus-Ground, Arceus-Fairy, Zacian-C, and Flutter Mane are nigh-mandatory, as Gliscor cannot take repeated Draco Meteors reliably.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Aberforth", "user_id": 249382}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Dialga": {"sets": {"Choiced": {}}},
  "Dialga-Origin": {"sets": {"Stealth Rock Setter": {}}},
  "Palkia": {"sets": {"Substitute": {}}},
  "Palkia-Origin": {"sets": {"Wallbreaker": {}}},
  "Giratina": {"sets": {"Defog": {}}},
  "Giratina-Origin": {
    "overview": "<p>Giratina-O is most notable for being the only offensive Defog user in Ubers, giving it a distinct niche. Its high bulk and unique typing combined with Levitate give it great use against top metagame threats like Arceus-Ground, Extreme Killer Arceus, and Kyogre. While its offensive stats are a bit low by Ubers standards, it makes up for it with Griseous Core's boost and access to high-Base Power moves like Poltergeist, Draco Meteor, and Hex. Furthermore, Will-O-Wisp, Thunder Wave, and Shadow Sneak are all great utility options at Giratina-O's disposal. Giratina-O is also one of the best users of Terastallization in the tier, becoming extremely tanky with Tera Steel or Poison in combination with Levitate. However, Giratina-O has no reliable recovery and thus can be chipped down by Stealth Rock and Ruination damage over time. It also stacks weaknesses with Koraidon and Miraidon, two of the most common Pokemon in the tier.</p>",
    "comments": "<h1>Other Options</h1> <p>Shadow Ball is possible over Hex to have a stronger attack in the short term; this may notably help against Dragon Dance Arceus-Ground. Calm Mind sets are a possibility, but Giratina-O's lack of recovery really limits its ability to sweep.</p> <h1>Checks and Counters</h1> <p><strong>Support Arceus Formes</strong>: Arceus formes like Arceus-Fairy and Arceus-Water can shrug off any attack Giratina-O throws at them, though neither appreciate status.</p> <p><strong>Ho-Oh</strong>: Ho-Oh can handle most attacks from Giratina-O, as it has high bulk and is immune to Will-O-Wisp. However, Stone Edge, Thunder Wave, and Tera Ghost-boosted Poltergeist all threaten Ho-Oh.</p> <p><strong>Chip Damage</strong>: Giratina-O has no recovery, so damage from poison, burn, or Stealth Rock can add up over time. Ting-Lu's Ruination can also greatly reduce Giratina-O's ability to check threats.</p>",
    "sets": {
      "Physical Utility": {
        "description": "<p>Although it necessitates teammates like Necrozma-DM to not run Knock Off, Poltergeist is a strong Ghost-type attack that is very spammable due to how few Pokemon that resist Ghost there are in the tier. Dragon Tail is a decently strong Dragon-type attack that has utility for forcing out Extreme Killer Arceus, which often runs Taunt, and Ting-Lu. Of the two status options, Will-O-Wisp should be run with Defog, as it pressures Ting-Lu much more; Ting-Lu can otherwise heal off damage with Leftovers, pressure Giratina-O with Ruination, and set entry hazards. Thunder Wave pressures common switch-ins like Ho-Oh and Arceus-Fairy much more, and as such is preferred when not running Defog. Access to Defog is extremely few and far between in Ubers, and therefore Giratina-O's access to it provides immense utility. It can be critical for maintaining an advantage in entry hazard management, especially once opposing entry hazard setters like Ting-Lu are taken out of the picture. Despite this utility, other options are still available for more offensively-minded teams. Shadow Sneak is a useful priority move that becomes very strong when combined with Tera Ghost; the combination of Tera Ghost Poltergeist and Shadow Sneak will even take out Koraidon. Alternatively, Stone Edge can be used to KO Ho-Oh, which otherwise takes non-Tera Ghost Poltergeist without worry. The given EVs allow Giratina-O to survive +2 Tera Ghost Arceus's Shadow Claw as well as +2 Life Orb Arceus's Shadow Claw after Stealth Rock damage. The Speed EVs are enough to outspeed uninvested Gliscor, with the rest dumped into Attack. Tera Steel should be run on Defog sets, as it negates all of Giratina-O's normal weaknesses, allowing Giratina-O to turn the tide against many Pokemon such as Koraidon using Scale Shot and Gliscor using Toxic. Tera Poison is another option, as it provides similar utility to Tera Steel without being weak to Koraidon's Flare Blitz.</p> <p>Giratina-O is an excellent way to finish off most defensive cores in the tier, as its Defog support and ability to check Arceus-Ground, Extreme Killer Arceus, and Kyogre are very valuable. As such, classic defensive Pokemon like Necrozma-DM, Arceus-Fairy, Ting-Lu, and Arceus-Water are all fantastic partners. Miraidon deserves mention, since it can pressure Ting-Lu, Clodsire, and Gliscor extremely well, potentially leading to a huge advantage in entry hazard management. Giratina-O's Defog support can also enable some powerful wallbreakers like Choice Band Chien-Pao and Choice Specs Kyogre, which may not normally fit on most teams due to being too weak to entry hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Darkrai": {"sets": {"Choice Scarf": {}, "Nasty Plot": {}}},
  "Shaymin-Sky": {"sets": {"Choice Scarf": {}, "SubSeed": {}}},
  "Arceus": {
    "sets": {
      "Extreme Killer (Swords Dance)": {
        "description": "<ul> <li>The combination of Swords Dance and STAB Extreme Speed turns Arceus into a deadly setup sweeper.</li> <li>Shadow Claw hits Giratina-O and Skeledirge hard, especially if Arceus has Terastallized into the Ghost-type.</li> <li>Taunt denies opposing recovery and blocks status moves such as Will-O-Wisp from Giratina-O and Skeledirge, but Recover can let Arceus acquire multiple boosts, making it nigh unstoppable.</li> <li>Earthquake hits Toxapex and Zacian-C hard while doing respectable damage to Skeledirge.</li> <li>A Silk Scarf lets Arceus secure important benchmarks such as OHKOing offensive Kyogre at +2 with Extreme Speed. Alternatively, Leftovers offers more longevity, while Lum Berry offers extra insurance against status effects.</li> <li>The given EV spread and nature maximize Arceus's damage output and let it outspeed Adamant Rayquaza, with the rest of the EVs going into HP to facilitate setup.</li> <li>Tera Normal boosts Extreme Speed to absurd levels, letting Arceus OHKO offensive Koraidon at +2 if holding a Silk Scarf.</li> <li>Alternatively, Tera Ghost is useful for preventing Koraidon and Zacian-C from revenge killing it. It also boosts Shadow Claw against targets such as Giratina-O and Skeledirge.</li> <li>Tera Fire makes Arceus immune to burn, which is helpful against Skeledirge and Giratina-O.</li> <li>Swords Dance Arceus is a good fit on hyper offense and bulky offense, working best as a late-game sweeper when checks such as Corviknight, Zacian-C, and Skeledirge are weakened or removed. With Extreme Speed, Arceus also serves as an emergency check to opposing sweepers.</li> <li>Good teammates for Arceus include Zacian-C, Groudon, and Koraidon, which share similar checks such as Corviknight and Skeledirge and can wear them down for Arceus to sweep.</li> </ul>"
      },
      "Dragon Dance": {
        "description": "<ul> <li>Dragon Dance allows Arceus to outspeed opposing Arceus formes as well as turn the tables on faster Normal-resistant or immune Pokemon such as Zacian-C, Flutter Mane, Arceus-Ghost, and Tera Ghost Pokemon.</li> <li>Extreme Speed is a powerful priority move that lets Arceus revenge kill opposing sweepers as well as clean weakened teams late-game.</li> <li>Shadow Claw OHKOes Flutter Mane and hits Giratina-O, Skeledirge, and foes that have Terrastalized into the Ghost-type hard, especially if Arceus has Terastallized into the Ghost-type itself.</li> <li>Flare Blitz is a powerful coverage move that OHKOes Zacian-C at +1 and deals heavy damage to Corviknight and Tera Steel Giratina-O. Earthquake has no recoil and also has a good chance to OHKO Zacian-C at +1 after Stealth Rock, but it cannot hit Corviknight. Recover keeps Arceus healthy throughout a match and potentially lets it set up more than once.</li> <li>Silk Scarf is recommended to boost the power of Extreme Speed to secure benchmarks such as OHKOing offensive Kyogre at +1 with Tera Normal. Leftovers is another good option, especially alongside Recover, to let Arceus accrue multiple boosts. Lum Berry is useful for giving Arceus additional insurance against status moves such as Will-O-Wisp from Giratina-O or Skeledirge.</li> <li>The given EV spread maximizes Arceus's damage output while giving it enough Speed to outrun max Speed base 90 Pokemon, as well as uninvested Koraidon and Miraidon.</li> <li>Tera Normal with a Silk Scarf gives Extreme Speed the extra power needed to OHKO Miraidon and offensive Kyogre at +1 after Stealth Rock. However, Tera Ghost is also an option to boost the power of Shadow Claw and avoid being revenge killed by Koraidon and Zacian-C. Finally, Tera Fire makes Arceus immune to Will-O-Wisp.</li> <li>Arceus fits best on hyper offense and bulky offense, where it keeps opposing sweepers in check with its powerful priority while threatening to sweep itself.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "nimzowitsch", "user_id": 272785}], "teams": [{"name": "Quality checked by", "members": [{"username": "Manaphy", "user_id": 50695}, {"username": "Taka", "user_id": 595062}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "aurora", "user_id": 109385}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Arceus-Bug": {"sets": {"Calm Mind": {}}},
  "Arceus-Dark": {"sets": {"Calm Mind + Taunt": {}, "Defensive": {}}},
  "Arceus-Dragon": {"sets": {"Dragon Dance": {}}},
  "Arceus-Electric": {"sets": {"Calm Mind": {}}},
  "Arceus-Fairy": {
    "overview": "<p>Arceus-Fairy is a defensive behemoth that cements itself a place in Ubers as one of the best checks to Koraidon. An immunity to Dragon and a resistance to Low Kick give Arceus-Fairy ample opportunities to switch in while also forcing Koraidon to use Flare Blitz more often and decrease its longevity as a result. Furthermore, Arceus-Fairy's bulk and resistances make it a useful soft check to Pokemon such as Arceus, Giratina-O, Kyurem-B, Zekrom, Chien-Pao, Rayquaza, and even Miraidon and Flutter Mane. Good neutral coverage with Fairy-type Judgment allows Arceus-Fairy to take full advantage of its ample support movepool featuring Thunder Wave, Will-O-Wisp, Stealth Rock, and Taunt. Outside of being a bit passive against Necrozma-DM, Ho-Oh, and Zacian-C and having to play around opposing Terastallization carefully, Arceus-Fairy has little to no flaws and should be strongly considered for any balance team.</p>",
    "comments": "<h1>Other Options</h1> <p>Earth Power and Power Gem are coverage options for a fully dedicated Calm Mind set. The problem is that Arceus-Fairy always loses to either Necrozma-DM or Ho-Oh, so while these coverage options are viable, they require dedicated team support. Of the two, Earth Power is more plausible, as Ho-Oh may be crippled by Knock Off support. Losing access to status or Stealth Rock also leaves Arceus-Fairy more passive in general.</p> <h1>Checks and Counters</h1> <p><strong>Fairy-Resistant Tanks</strong>: Necrozma-DM, Ho-Oh, and Zacian-C take little damage from Judgment and can use Arceus-Fairy as an opportunity to set up, although none of them like taking Thunder Wave.</p> <p><strong>Tera Fire Users</strong>: Arceus-Fairy cannot burn common physical attackers like Koraidon and Necrozma-DM after they have used Tera Fire, which also greatly weakens the power of Judgment. Koraidon can notably guarantee the OHKO on Arceus-Fairy at +2 with Tera Fire Flare Blitz, necessitating Arceus-Fairy to use Tera Water itself. These Pokemon are still vulnerable to Thunder Wave, but they may still be able to sweep with enough boosts.</p> <p><strong>Chip Damage</strong>: Arceus-Fairy is vulnerable to all forms of status and entry hazard damage, which force it to use Recover more often and lose momentum.</p> <p><strong>Calm Mind</strong>: Calm Mind users like Arceus-Ground, Kyogre, and Arceus-Grass take little from Judgment and can use Calm Mind relatively freely as a result.</p>",
    "sets": {
      "Defensive Wall": {
        "description": "<p>This set gives Arceus-Fairy its best chance at taking on Koraidon. Thunder Wave is extremely useful for crippling all of Arceus-Fairy's most common switch-ins in Necrozma-DM, Ho-Oh, and Zacian-C. It is also a safe move to use against Koraidon should you expect it to use Tera Fire and is especially useful because Arceus-Fairy discourages all Ground- and Electric-types bar Clodsire from switching in. Will-O-Wisp more directly cripples physical attackers like Koraidon and Necrozma-DM, although it cannot hit Ho-Oh and Tera Fire users. The third moveslot is fairly flexible; Stealth Rock is a good option, as it frees up moveslots for Arceus-Fairy's teammates. Taunt prevents Clodsire and specially defensive Gliscor from being able to use Spikes and Toxic. Dragon Tail can be a good way to rack up entry hazard damage and can phaze setup sweepers that may not mind being hit with status, and it is highly recommended when running Will-O-Wisp. Calm Mind turns Arceus-Fairy into a dangerous setup sweeper, albeit one that requires significant team support to handle Necrozma-DM and especially Ho-Oh. It is a good option on teams that already have plentiful ways to spread status. Tera Water is mandatory in case Arceus-Fairy needs to take a boosted Flare Blitz from Koraidon, and it can be useful in a pinch against Necrozma-DM and Zacian-C. Tera Water in combination with Calm Mind can more easily clean up weakened teams, as Necrozma-DM won't have a coverage option to hit Arceus-Fairy. The EVs allow Arceus-Fairy to outspeed maximum Speed neutral-natured base 90 Pokemon such as Kyogre, with the rest being dumped into physical bulk.</p> <p>While Arceus-Fairy is a great wall, it's unable to take on notable physical attackers like Necrozma-DM and Zacian-C without Terastallizing. As a result, defensive Necrozma-DM is a fantastic partner, and the two together reasonably cover nearly all physical threats in the tier. Ting-Lu and Clodsire can take on Miraidon and appreciate Arceus-Fairy's Dragon immunity that allows it to pivot into Draco Meteor, making them fantastic teammates. Defensive Ho-Oh, Gliscor, and Eternatus can handle offensive Ho-Oh without much fear of Sacred Fire burns, with Eternatus having the added benefit of checking Kyogre and absorbing Toxic Spikes. Strong but relatively slow wallbreakers such as Kyogre, Swords Dance Necrozma-DM, and offensive Ho-Oh like the paralysis support that Arceus-Fairy can provide. Kyogre notably helps with the Koraidon matchup, as it can pivot into Flare Blitz and bring rain that negates Koraidon's ability, making it a great partner. Giratina-O can handle Arceus-Ground and provide much-appreciated Defog support.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Arceus-Fighting": {"sets": {"Cosmic Power": {}}},
  "Arceus-Fire": {"sets": {"Dragon Dance": {}}},
  "Arceus-Flying": {"sets": {"Calm Mind + Taunt": {}}},
  "Arceus-Ghost": {"sets": {"Dragon Dance": {}, "Calm Mind": {}}},
  "Arceus-Grass": {"sets": {"Calm Mind": {}, "3 Attacks": {}}},
  "Arceus-Ground": {
    "overview": "<p>Besides Koraidon and Miraidon, Arceus-Ground is perhaps the most terrifying setup sweeper in Ubers. Strong Ground-type STAB moves in combination with Rock-type coverage makes switching into Arceus-Ground a challenge in a tier where Ground-type checks are few and far between, demolishing many tier staples such as Necrozma-DM, Zacian-C, and Ho-Oh. Arceus-Ground can also take hits with relative ease thanks to its good bulk and the lack of super effective coverage against it, allowing it to boost multiple times. Arceus-Ground is one of the few checks to Miraidon in the tier and the only one that packs significant offensive pressure. Arceus-Ground is held back by its four-moveslot syndrome and inability to check Miraidon very reliably by itself, as it lacks the raw bulk that Ting-Lu has and the ability to run Heavy-Duty Boots that Clodsire provides. Additionally, other Arceus formes like Arceus-Fairy and Arceus-Water may provide better defensive utility, while Arceus can give great revenge killing support with Extreme Speed. Overall, Arceus-Ground is a staple of offense and balance structures alike.</p>",
    "comments": "<h1>Other Options</h1> <p>A support set featuring moves like Thunder Wave, Will-O-Wisp, and Stealth Rock is possible, although it has some issues. Calm Mind provides a way to handle Double Dance Miraidon and makes Arceus-Ground a great cleaner, so it generally has more utility. In addition, Ground-type Judgment has several immunities in the tier, forcing you to choose between Arceus-Ground being hard walled or having more support moves available. A physically defensive set of 52 HP / 232 Def / 24 SpD with a Relaxed nature with Earthquake / Ice Beam / Stealth Rock / Recover is an option, although not often seen due to the plethora of defensive Ground-types in the tier.</p> <h1>Checks and Counters</h1> <p><strong>Ground-immune Pokemon</strong>: Giratina-O is one of the most complete checks to Arceus-Ground, as it can tank Stone Edge and Power Gem very well and threaten back with Will-O-Wisp, Dragon Tail, and Poltergeist. Landorus-T is a severe annoyance to the Dragon Dance set thanks to Intimidate, though it must watch out for Ice Beam. Gliscor can rack up damage on predicted Taunts by using Earthquake and can cripple Calm Mind Arceus-Ground with Toxic.</p> <p><strong>Water-types</strong>: Bulky Kyogre sets tank any hit outside of a Tera Ground-boosted Earthquake and OHKO back, and it can go head-to-head with Calm Mind sets. Arceus-Water can similarly take any hit and severely damage Arceus-Ground with a super effective Judgment. Both must be careful of Calm Mind Arceus-Ground should it choose to Terastallize.</p> <p><strong>Arceus-Grass</strong>: While rare, Arceus-Grass is the best check to Arceus-Ground in the game, easily taking any hit and doing extreme damage back with Grass Knot.</p> <p><strong>Phazing</strong>: While they usually prefer to save their health for other threats like Miraidon and offensive Ho-Oh, both Ting-Lu and Ho-Oh can phaze Arceus-Ground in a pinch, as Ting-Lu can tank any hit thrown at it and Ho-Oh survives Power Gem at +1.</p> <p><strong>Chip Damage</strong>: Arceus-Ground is vulnerable to all forms of entry hazards and status effects, jeopardizing its ability to attain multiple boosts as well as check Miraidon.</p>",
    "sets": {
      "Dragon Dance": {
        "description": "<p>Dragon Dance turns Arceus-Ground into a devastating wallbreaker that can also clean up weakened teams with ease. Stone Edge hits Ho-Oh and does good damage to most Ground-immune targets like Landorus-T and Gliscor. Taunt prevents status from Pokemon like Skeledirge, Giratina-O, and Gliscor and is useful to prevent Whirlwind from Ting-Lu. Recover is highly recommended on non-hyper offense teams to provide Arceus-Ground with more longevity, which is critical for checking Miraidon in the long term. Ice Beam can more directly deal with Gliscor and Landorus-T, which often pivot in on Arceus-Ground. Tera Ground is usually preferred, as the power boost can be critical for Arceus-Ground to get past Pokemon like Koraidon and bulky Kyogre that otherwise survive a +1 Earthquake. Tera Ghost has some utility providing Fighting and Normal immunities, which prevents common revenge kill options like Choice Scarf Koraidon's Low Kick and Extreme Killer Arceus's Extreme Speed. The EVs outspeed all base 90 Speed Pokemon, with the rest dumped into HP.</p> <p>This set is a mainstay on hyper offense teams thanks to its strong wallbreaking power and ability to reasonably deal with Miraidon. It appreciates fellow setup sweepers such as Scale Shot Koraidon, Double Dance Miraidon, Zacian-C, and Dragon Dance Necrozma-DM that can help it break through defensive cores. Hyper offense leads such as Deoxys-S and Glimmora pair well with Arceus-Ground, helping it net KOs easier without the need to Terastallize; two layers of Spikes give it a good chance to OHKO Koraidon, and Stealth Rock helps damage Landorus-T and Gliscor, which may try to pivot around Arceus-Ground. Additionally, Grimmsnarl's dual screens support has notably potent synergy with Arceus-Ground, as its great bulk becomes even better, allowing it to get multiple Dragon Dance boosts with ease. If Arceus-Ground is on a more balanced team, another Miraidon check like Ting-Lu or specially defensive Gliscor is appreciated, as this Arceus-Ground set is not reliable at handling Miraidon multiple times by itself.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Arceus-Ground is an extremely potent win condition that doubles in use as a good Miraidon check. It has more bulk than Clodsire while also having the reliable recovery that Ting-Lu lacks, giving it a distinct niche. Calm Mind and an Electric immunity makes this set one of the few Pokemon in the game that can defeat Double Dance Miraidon one-on-one. Furthermore, thanks to its powerful Ground-type Judgment, specially defensive walls such as Eternatus and Clodsire are unable to freely use Toxic, and Power Gem heavily discourages Ho-Oh from forcing it out with Whirlwind. This makes Arceus-Ground the least reliant on using Tera to sweep successfully out of all the Arceus formes. Ice Beam is a fine option over Power Gem to more effectively deal with Gliscor and attempt to freeze foes. Tera Fairy is mainly chosen for helping against Miraidon which may otherwise break through Arceus-Ground, although its added resistance to Koraidon's Low Kick is appreciated. Tera Steel also helps against Miraidon, with the distinction of providing a Poison immunity that may be useful against specially defensive Gliscor and Eternatus. The set's EVs maximize special bulk, which is critical for handling Miraidon, and outspeed all neutral-natured base 90 Speed Pokemon. More offensive EV spreads are possible, although they require further teammate support for Miraidon. 132 HP / 252 SpA / 124 Spe with a Modest nature gives Arceus-Ground maximum offensive output, notably giving it a chance to OHKO Ho-Oh at +1, while outspeeding all positive-natured base 90 Speed Pokemon. 248 HP / 144 Def / 100 SpA / 16 Spe allow Arceus-Ground to 2HKO Clodsire unboosted and take two Flare Blitzes from Koraidon, giving it some physically defensive utility and making it harder to revenge kill.</p> <p>Arceus-Ground is extremely hard to stop late-game once its checks have been chipped down. Opposing Calm Mind Arceus formes often lose in a one-on-one battle thanks to this set's higher special investment, leaving only checks like Ting-Lu, Kyogre, and Ho-Oh that can phaze or overpower Arceus-Ground. Gliscor is an excellent teammate, as it patches up the lack of entry hazard support that forgoing Ting-Lu or Clodsire causes. In addition, Gliscor is a great switch-in to Ting-Lu, Ho-Oh, and Choice Scarf Koraidon, allowing it to use Toxic and set hazards early-game to great effect. Skeledirge is a fairly solid check to Scale Shot Koraidon that loves Arceus-Ground taking on Miraidon, which commonly switches in on it. Knock Off Necrozma-DM is a great lure for Kyogre and Ho-Oh, as getting rid of their Heavy-Duty Boots makes them much more susceptible to entry hazard damage. Eternatus can switch in on Kyogre, Ho-Oh, and Arceus-Grass and force them out with Toxic while also absorbing the Toxic Spikes that Arceus-Ground is vulnerable to. Miraidon is a good offensive partner for damaging Ting-Lu over time and switching in easily on Ho-Oh.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Aberforth", "user_id": 249382}]}, {"name": "Grammar checked by", "members": [{"username": "SolarBeam", "user_id": 470115}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Arceus-Ice": {"sets": {"Calm Mind": {}}},
  "Arceus-Poison": {"sets": {"Support": {}, "Iron Defense": {}}},
  "Arceus-Psychic": {"sets": {"Stored Power": {}}},
  "Arceus-Rock": {"sets": {"Calm Mind": {}}},
  "Arceus-Steel": {"sets": {"Calm Mind": {}}},
  "Arceus-Water": {
    "overview": "<p>Arceus-Water is a solid defensive pick in Ubers, being one of the best answers to hard-to-check threats like Dragon Dance Necrozma-DM, Arceus-Ground, offensive Ho-Oh, Calyrex-I, Chien-Pao, Rayquaza, and Kyogre lacking Thunder. While it cannot compare to Arceus-Fairy in terms of taking on Koraidon, its resistance to Flare Blitz makes Arceus-Water a decent check in combination with other Koraidon switch-ins like Landorus-T. Arceus-Water can spread burns and paralysis with relative freedom, as it discourages Ground-types from switching in and the use of Tera Fire, not to mention that Calm Mind makes it a decent setup sweeper in combination with massive Defense investment. The most notable flaw of Arceus-Water is that it invites arguably the most threatening Pokemon in the tier, Miraidon, to come in with little risk; it is also quite passive and vulnerable to being worn down over time.</p>",
    "comments": "<h1>Other Options</h1> <p>Dragon Dance sets are possible, but are too limited by Koraidon's sun and are generally outclassed by Extreme Killer Arceus and Arceus-Ground.</p> <h1>Checks and Counters</h1> <p><strong>Miraidon</strong>: Miraidon can come in quite easily, as it can stomach an Ice Beam without much worry and blow past even a boosted Arceus-Water.</p> <p><strong>Poison</strong>: Eternatus and Clodsire can take even a boosted Ice Beam and immediately threaten Arceus-Water with Toxic, though they must be wary of Tera Poison. Specially defensive Gliscor is not OHKOed by Ice Beam or Judgment and thus can retaliate with Toxic. All of the aforementioned Pokemon can also set Toxic Spikes, which is devastating for Arceus-Water's longevity.</p> <p><strong>Kyogre</strong>: Kyogre can switch in without too much worry and use Thunder or Thunder Wave, both of which can cripple Arceus-Water. However, Kyogre will lose to Calm Mind sets if it lacks Thunder.</p> <p><strong>Arceus-Grass</strong>: Though rare, Arceus-Grass can boost alongside Arceus-Water and deal devastating damage at any time with Grass Knot.</p> <p><strong>Sun</strong>: Though Koraidon itself prefers to not be on the field when Arceus-Water is, the sun that it brings cripples the damage output that Arceus-Water would normally provide.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>While Judgment has decent neutral coverage by itself, it's weakened by how common sun is, so a secondary attack is necessary. Ice Beam is usually chosen as the best option to hit switch-ins like Miraidon and Clodsire. Dragon Tail can rack up entry hazard damage and has good synergy with Arceus-Water's status options. Since Arceus-Water can often check most threats without status, Calm Mind is a great option to turn it into a solid win condition. Alternatively, Thunder Wave can cripple Ho-Oh and Tera Fire users like Koraidon, Necrozma-DM, and Calyrex-I, making it a safe option. Will-O-Wisp may be used to more solidly check physical threats. Do note that Tera Fire can put a stop to this, especially from Koraidon, which doesn't mind taking Judgment in the sun; therefore, Dragon Tail is highly recommended for Will-O-Wisp sets to mitigate this risk. Tera Fairy allows Arceus-Water to take boosted Scale Shot from Koraidon, while Tera Poison is possible on Calm Mind sets to prevent Arceus-Water from being crippled by Toxic from Eternatus, Clodsire, and specially defensive Gliscor. The EVs maximize Defense investment while outspeeding all neutral-natured base 90 Speed Pokemon.</p> <p>Arceus-Water works best when it has other walls to back it up against powerful wallbreakers like Koraidon. Landorus-T has fantastic synergy with Arceus-Water, checking Pokemon like Zacian-C and Zekrom, and its Intimidate and Rocky Helmet support makes Koraidon much easier to handle. Necrozma-DM can check Zacian-C and Kyurem-B and appreciates Arceus-Water handling Calyrex-I. Ting-Lu is the most solid switch-in to Miraidon that often come in on Arceus-Water, making it a highly recommended teammate. Meanwhile, Clodsire can absorb Toxic Spikes and check Miraidon and Kyogre. Miraidon can help against Kyogre sets that have Thunder while also bringing in Arceus-Water easily with U-turn. Skeledirge likes Arceus-Water dealing with Ho-Oh and can handle Koraidon and Zacian-C for it in return. Flutter Mane is a good offensive partner that forces difficult decisions on opposing Koraidon as to what move to choose; using anything but Flare Blitz allows Flutter Mane in for free, while Flare Blitz allows Arceus-Water to switch in easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Gothitelle": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<ul> <li>Shadow Tag Gothitelle can trap most defensive Pokemon, paving the way for its teammates to sweep.</li> <li>Trick facilitates trapping defensive walls like Ting-Lu and Great Tusk by locking them into an unfavorable move. Psychic targets Great Tusk and Toxapex, while Psyshock helps Gothitelle trap Clodsire better. Thunderbolt allows Gothitelle to trap Corviknight if it's not running U-turn or has a Choice item. Grass Knot KOes Great Tusk, Dondozo and hits Ting-Lu hard. Taunt is used to limit phazing attempts and Choice locked status moves, forcing the trapped Pokemon to use Struggle.</li> <li>Rest allows Gothitelle to more effectively PP stall foes and remain healthy.</li> <li>Choice Specs Gothitelle plays a more offensive role, aiming to rack up KOs. On the other hand, Choice Scarf variants are more likely to use Trick to beat opposing walls.</li> <li>32 HP and 4 Defense EVs allow Gothitelle to avoid being 2HKOed and 3HKOed from Ting-Lu's and Clodsire's Earthquake, respectively. 220 Speed EVs allow Choice Specs variants to outspeed defensive Great Tusk and Annihilape and Choice Scarf variants to outspeed offensive Great Tusk.</li> <li>Gothitelle usually uses its Tera type to trap and beat Choice locked foes it otherwise would not trap; Tera Fairy beats Miraidon and Koraidon Choice locked into Dragon moves, Tera Water tanks Koraidon's Flare Blitz and Iron Bundle's Ice Beam, and Tera Flying avoids Earthquake from Ting-Lu and Great Tusk.</li> <li>Gothitelle's favorite partners are powerful sweepers and cleaners such as Miraidon, Koraidon, Flutter Mane, Iron Bundle, Kingambit, and Chien-Pao, all of which appreciate Gothitelle removing one or more of their checks.</li> </ul>"
      },
      "Delay Goth (Trapper)": {
        "description": "<ul> <li>This Gothitelle set aims to trap and PP stall weak walls so that its offensive teammates can take over mid- to late-game. This Gothitelle set can come in on weak walls like Clodsire, Ting-Lu, Alomomola, and defensive Great Tusk and beat them by PP stalling them.</li> <li>Charm and Calm Mind are use to boost Gothitelle's survivability while PP stalling its foe.</li> <li>Taunt is used to stop phazing attempts and make the trapped Pokemon use their attacking PP, thus depleting their PP faster. Stored Power is an alternative for teams that benefit from having more wallbreaking potential or that have a good matchup against the Dark-types of the tier like Chien-Pao and Kingambit.</li> <li>The 24 Speed EVs allow Gothitelle to be faster than uninvested Corviknight, trapping it if it's not running U-turn. The Defense investment is used to tank hits well for PP stalling purposes, with attacks such as Ting-Lu's Earthquake being only a 4HKO.</li> <li>Tera Fairy is used for its solid defensive typing and ability to trap Choice-locked Dragon-types like Miraidon and Koraidon, Tera Water is an option for its overall great defensive typing, granting resistances to Chien-Pao's Icicle Crash, Koraidon's Flare Blitz, and Iron Bundle's Hydro Pump or Ice Beam. Lastly, Tera Ground is used to allow Gothitelle to trap Miraidon locked into an Electric move or defeat Double Dance sets one-on-one.</li> <li>Gothitelle's favorite partners are powerful sweepers and cleaners, especially setup sweepers that take advantage of defensive Pokemon having their PP drained to set up easily and without risk. Common examples include Swords Dance Koraidon, Swords Dance Chien-Pao, Double Dance Miraidon, and Calm Mind Flutter Mane.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mashing", "user_id": 537354}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Dawn of Ares", "user_id": 467437}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Alomomola": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<ul> <li>Alomomola is a bulky pivot against physical attackers such as Koraidon and Chien-Pao on balance or defensive teams.</li> <li>The decision between Play Rough and Chilling Water depends on your preference. Play Rough is important since it provides actual damage against Chien-Pao and Koraidon; on the other side, Chilling Water is an effective stop to Bulk Up Great Tusk and bulky Palafin, which otherwise are annoying Pokemon to deal with for defensive teams.</li> <li>Whirlpool is a better support option than Light Screen on more defensive teams, since its continuous damage and trapping allow Alomomola to break past some Pokemon, such as Ting-Lu. On the other hand, Light Screen is better for offensive teams, since it helps them switch against powerful special attackers such as Miraidon and Flutter Mane without sacrificing a Pokemon.</li> <li>Besides healing Alomomola with Protect, Wish helps its teammates not get worn down, especially walls without reliable recovery like Dondozo, Ting-Lu, and Great Tusk.</li> <li>The item choice depends on your team structure. If you have good entry hazard removal and need more damage against threats, then Rocky Helmet is the best choice. Leftovers is useful when you have good hazard removal but can also inflict good damage with your teammates; it also prevents some 2HKOs, for example from Choice Band Chien-Pao's Crunch. Without good hazard removal, Heavy-Duty Boots is the preferred choice.</li> <li>Run a Relaxed nature with Play Rough, or if you have Chilling Water + Whirlpool and wish to sacrifice some Speed for full Whirlpool damage. Otherwise, run Bold.</li> <li>Tera Fairy provides Alomomola with Fighting and Dark resistances, letting it switch in more comfortably and stop setup from Koraidon and Chien-Pao. Additionally, the Dragon immunity lets it sponge hits such as Koraidon's Dragon Claw and Outrage, or Draco Meteor from Miraidon.</li> <li>Special walls work well alongside Alomomola's physical defense, such as Ting-Lu, Clodsire, Blissey, and Corviknight.</li> <li>Other great partners are Toxapex and Dondozo, as Alomomola relieves pressure on them to check threats such as Koraidon, Chien-Pao, and Great Tusk. Dondozo is especially helpful here due to its Unaware ability. Unfortunately, you also stack weaknesses against common special attackers such as Miraidon and Iron Bundle; this should be considered while teambuilding.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mashing", "user_id": 537354}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Volcarona": {"sets": {"Quiver Dance": {}}},
  "Zekrom": {"sets": {"Dragon Dance": {}, "Mixed Dragon Dance": {"description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.759/\">new analyses</a>. These will update as the metagame continues to develop. Stay tuned!</p>"}}},
  "Landorus": {"sets": {"Wallbreaker": {}}},
  "Landorus-Therian": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Thanks to Intimidate and its useful typing, defensive Landorus-T is a good temporary measure against threatening physical attackers like Koraidon, Zacian-C, and Arceus-Ground.</li> <li>Rocky Helmet is the preferred item for punishing the use of contact moves from Pokemon like Koraidon, Zacian-C, and Arceus-Ground, giving Landorus-T a better chance to beat them one-on-one.</li> <li>However, Leftovers grants Landorus-T passive recovery, allowing it to somewhat offset Stealth Rock damage.</li> <li>Tera Fairy gives Landorus-T an immunity to Scale Shot from Koraidon, allowing it to deny Koraidon a Speed boost and potentially allow a teammate like Koraidon or Zacian-C to revenge kill the opposing Koraidon. Tera Fairy also has the added benefit of making Landorus-T immune to Draco Meteor, potentially allowing it to turn the tables on Miraidon.</li> <li>Tera Water lets Landorus-T better take Behemoth Blade from Zacian-C and Flare Blitz from Koraidon, potentially allowing it to beat them with higher HP than normal, as well as possibly allowing it to check Calyrex-I.</li> <li>Defensive Landorus-T is best used on bulky offense teams as a mid-game stopgap against physical threats, which lets its offensive teammates take advantage of them later in the game.</li> <li>Landorus-T is commonly used on teams that stack physical attackers and need a temporary measure against dangerous threats like Zacian-C and Arceus-Ground. Pokemon like Scale Shot Koraidon, Extreme Killer Arceus, and Zacian-C are good partners, as they appreciate Landorus-T's ability to stave off threats and preserve their HP.</li> <li>Ting-Lu is a fantastic partner, as it can switch into Pokemon Landorus-T cannot hope to stand up to, like Miraidon and various Calm Mind Arceus formes. Ting-Lu also doubles down on Landorus-T's Stealth Rock with its own Spikes, making its offensive teammates even more threatening later in the game.</li> <li>Kyogre is also a great partner, as it can threaten Pokemon that can give Landorus-T trouble or take advantage of its presence, like Calyrex-I, Gliscor, and opposing Landorus-T.</li> </ul>"
      },
      "Choice Scarf": {
        "description": "<ul> <li>Landorus-T is a decent Choice Scarf user thanks to its typing, access to U-turn, and a great ability in Intimidate, making it a good offensive pivot.</li> <li>Unlike other common Choice Scarf users, Landorus-T has the benefit of being immune to entry hazards like Toxic Spikes and Sticky Web from Glimmora and Ribombee, respectively. This allows Landorus-T to be an excellent anti-offense tool against hyper offense teams.</li> <li>U-turn is useful to generate momentum and bring in teammates safely when foes are forced to switch out.</li> <li>Due to the pressure Landorus-T applies on the opposing team such as when forcing out Zacian-C and Miraidon, it can also easily set up Stealth Rock.</li> <li>Stone Edge hits Flying-types and Tera Flying foes like Rayquaza and Zacian-C, respectively, providing good coverage alongside Earthquake. Tera Ground boosts Earthquake's power, notably allowing a 2HKO on neutral Arceus formes.</li> <li>Landorus-T fits well on bulky offense teams that require speed control and appreciate its ability to generate momentum. Wallbreakers such as Miraidon and Kyogre appreciate being brought in safely with U-turn.</li> <li>Special attackers such as Giratina-O are problematic for Landorus-T; therefore, specially defensive Ting-Lu is a solid teammate to help deal with it. Ting-Lu also grants hazards support, which Landorus-T is able to utilize well to pressure neutral targets, while Landorus-T is faster than many unboosted threats, granting it the ability to pressure them offensively.</li> <li>Kyogre is also an issue for Landorus-T, so pivots like Eternatus and Toxapex are good partners.</li> <li>Since Landorus-T does not run bulk in this set, secondary walls such as Groudon and Toxapex can be used to check physical attackers.</li> <li>Koraidon is also an excellent partner for Landorus-T, forming a good pivoting core with it to eliminate each other's checks in Giratina-O and Skeledirge, respectively.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "GeniusFromHoenn", "user_id": 530778}, {"username": "OreoSpeedruns", "user_id": 597293}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Eledyr", "user_id": 415367}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "Rose", "user_id": 511181}]}]}
  },
  "Kyurem-Black": {"sets": {"Dragon Dance": {"description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.759/\">new analyses</a>. These will update as the metagame continues to develop. Stay tuned!</p>"}}},
  "Ribombee": {"sets": {"Sticky Web": {}}},
  "Toxapex": {
    "sets": {
      "Physical Wall": {
        "description": "<ul> <li>Toxapex is an excellent physically defensive wall capable of taking on foes such as Koraidon and Zacian-C.</li> <li>Haze shuts down boosting attempts from the likes of Swords Dance Koraidon, Arceus, and Zacian-C.</li> <li>Toxic prevents checks like Miraidon, Groudon, and Arceus-Ground from coming in freely and forcing Toxapex out while also putting setup sweepers on a timer.</li> <li>If Toxapex runs Toxic Spikes, teammates such as Arceus-Ground can pressure Toxic Spikes absorbers like Eternatus and Clodsire. Poison Jab spreads poison to foes like Arceus-Fairy and Flutter Mane, and Ice Beam helps Toxapex greatly with Rayquaza while also helping against Landorus-T, Koraidon, and Gliscor.</li> <li>Rocky Helmet is preferred to chip down physical attackers and most pivots. Mental Herb is an alternative that helps Toxapex deal with Taunt Arceus formes.</li> <li>Tera Fairy makes Toxapex immune to Dragon-type moves, letting it deal with Scale Shot Koraidon, while Tera Ground helps Toxapex against Wild Charge Zacian-C.</li> <li>Toxapex makes good partners with other defensive Pokemon like Ting-Lu and Clodsire, which can check threats like Miraidon. In return, Toxapex can help deal with threats like Koraidon and Zacian-C.</li> <li>Offensive pivots like Miraidon, Koraidon, and Landorus-T also pair well with Toxapex, as they can bring it in more freely to handle their checks.</li> <li>Gliscor can switch into Ground-types such as Ting-Lu, non-Ice Beam Arceus-Ground, and Heavy-Duty Boots Miraidon, spread entry hazards, and check Koraidon and Zacian-C, preventing Toxapex from being worn down.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}]}]}
  },
  "Lunala": {"sets": {"Agility": {"description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.759/\">new analyses</a>. These will update as the metagame continues to develop. Stay tuned!</p>"}}},
  "Necrozma-Dusk-Mane": {
    "overview": "<p>Necrozma-DM is one of the best Pokemon in Ubers. Between its sky-high Attack stat, high defensive stats, passable Speed, and a deep movepool, it is able to fulfill a huge variety of roles, which gives it a place on a lot of teams ranging from hyper offense to bulky offense and even stall. Necrozma-DM's typing allows it to check threatening Pokemon that would otherwise be very difficult to switch into consistently, like Zacian-C, Eternatus, Deoxys-A, Gliscor, and some Arceus formes like Arceus-Fairy. Terastallization allows Necrozma-DM to beat threats that would otherwise check it, such as Ho-Oh and Koraidon, while allowing it to soft check other Pokemon like boosted Flutter Mane in a pinch. The omnipresence of Koraidon also helps Necrozma-DM, bolstering its Morning Sun recovery and giving it an option to stay healthy throughout the battle.</p> <p>However, Necrozma-DM is very slow even after a Dragon Dance boost. This makes it prone to getting outsped by a plethora of offensive Pokemon like Koraidon, Miraidon, Deoxys-A, Zacian-C, Flutter Mane, and Choice Scarf users like Kyogre, all of which can severely hurt Necrozma-DM if not outright OHKO it. While Necrozma-DM is bulky, it is not capable of tanking hits from boosted Pokemon and therefore might get overwhelmed by what it is supposed to check, like Zacian-C, forcing it to stay very healthy if it wants to fulfill its defensive role. Necrozma-DM is oftentimes forced to Terastallize in order to beat common Pokemon like Ho-Oh, Koraidon, and Arceus formes carrying Will-O-Wisp. Furthermore, some Arceus formes like Arceus-Ground are able to check every Necrozma-DM set.</p>",
    "comments": "<h1>Other Options</h1> <p>A Choice Band set might seem interesting due to its ability to 2HKO every Arceus forme with its STAB attacks while also 2HKOing Gliscor and Ting-Lu. However, this set's viability relies entirely on good positioning and prediction. Necrozma-DM's Speed stat also lets it down in being a wallbreaker, as it is outsped by a lot of common offensive Pokemon and thus cannot make use of its excellent defensive typing nearly as much when locked into one move. Choice Band Necrozma-DM would be best suited using a set consisting of Sunsteel Strike, Photon Geyser, Earthquake and Knock Off.</p> <p>A specially defensive spread with Tera Ground can be used so Necrozma-DM has an easier time setting up on Calm Mind Arceus formes and Miraidon. However, Necrozma-DM can no longer check physical attackers like Zacian-C with this set, as it gets OHKOed by a +3 Close Combat. Furthermore, Ho-Oh, Gliscor, and Ting-Lu are comfortably able to check this set.</p> <h1>Checks and Counters</h1> <p><strong>Water-types</strong>: By virtue of its resistance to Steel and access to Recover, Thunder Wave, and Will-O-Wisp, Arceus-Water is the best Necrozma-DM counter available, being able to heal off the damage done by it with Recover and not minding Dragon Dance too much due to being faster than Necrozma-DM even if it's at +1. This gives Arceus-Water complete control over the one-on-one interaction, forcing Necrozma-DM to Terastallize into the Fire typing if it wants to avoid getting burnt by Will-O-Wisp, which then risks being hit by a devastating Judgment. Arceus-Water even has access to Dragon Tail if it wants to phaze Necrozma-DM, which is a safer interaction for it. However, Lum Berry, Life Orb, and Tera Psychic variants all have a positive matchup against Arceus-Water. The sun constantly being up thanks to Koraidon also makes it hard for Arceus-Water to threaten Tera Fire Necrozma-DM. Kyogre is another troublesome Pokemon for Necrozma-DM; while it does not appreciate switching into it, it can threaten to OHKO it with its STAB moves while halving Morning Sun's recovery by summoning rain.</p> <p><strong>Ground-types</strong>: Arceus-Ground can switch directly into Necrozma-DM and shrug off its attacks thanks to its superb bulk and Recover. It can then use Necrozma-DM as setup bait for Dragon Dance or Calm Mind, forcing it to switch out. Pokemon like Landorus-T and Groudon are durable enough to the point where Necrozma-DM might struggle getting past them without an unreasonable amout of Dragon Dances. Landorus-T even has access to Taunt to shut down any setup or recovery attempts from it, while Groudon can use Necrozma-DM to freely use Spikes, spread burns with Will-O-Wisp or Lava Plume, and phaze it with Roar. Ting-Lu can set up Spikes on Necrozma-DM and phaze it with Whirlwind while not minding boosted attacks too much due to its high Defense.</p> <p><strong>Ho-Oh</strong>: Ho-Oh is bulky enough to constantly switch into Necrozma-DM, with Regenerator further helping it accomplish this role. Furthermore, Ho-Oh can threaten a burn with Sacred Fire, forcing Necrozma-DM to either Terastallize, use a Lum Berry, or switch out. However, Stone Edge or a boosted Photon Geyser can deal extreme damage to Ho-Oh.</p> <p><strong>Arceus-Dark</strong>: Arceus-Dark is one of the best counters to Necrozma-DM thanks to its immunity to Photon Geyser and access to Will-O-Wisp and Recover. Necrozma-DM can Terastallize into the Fire typing in order to comfortably beat Arceus-Dark one-on-one, but it must be careful of Judgment, especially if it has little to no bulk investment, as even an unboosted Judgment will hurt. Arceus-Dark can even fit other moves like Foul Play and Dragon Tail into its arsenal to better its matchup against a Terastallized Necrozma-DM. Sunsteel Strike variants, however, can outright beat Arceus-Dark, either taking it out or forcing a reactive Terastallization from it.</p> <p><strong>Faster Foes</strong>: Choice Scarf Pokemon like Koraidon, Miraidon, and Kyogre outspeed Necrozma-DM even after a Dragon Dance, with Koraidon and Miraidon outspeeding Necrozma-DM even after it has used Dragon Dance twice. Other Pokemon like Deoxys-A, Zacian-C, Flutter Mane, Miraidon, and boosted Dragon Dance Arceus formes will outspeed a boosted Necrozma-DM as well.</p> <p><strong>Physically Bulky Foes</strong>: Pokemon like Gliscor and Skarmory are bulky enough to withstand Necrozma-DM's attacks, with Skarmory having access to Iron Defense and Roost to become a very sturdy counter. Gliscor outspeeds unboosted Necrozma-DM and can proceed to either lay Spikes freely, heal off any damage done with Protect, or hit it with Earthquake for a solid 25%. Furthermore, Gliscor can also use Taunt to stop any Morning Sun healing. However, Necrozma-DM will use Gliscor as setup bait if it's not carrying Taunt in its moveset.</p> <p><strong>Opposing Necrozma-DM</strong>: Defensive Necrozma-DM is a good check to itself, being able to use Swords Dance alongside defensive Dragon Dance Necrozma-DM and easily 2HKO it. Using Tera Ground, defensive Necrozma-DM can even beat offensive Dragon Dance Necrozma-DM one-on-one by spamming Earthquake.</p> <p><strong>Giratina-O</strong>: Giratina-O is bulky enough to tank even boosted attacks from Necrozma-DM and threatens to burn it with Will-O-Wisp, phaze it with Dragon Tail, or 2HKO it with Poltergeist. Furthermore, Giratina-O can also Terastallize into the Steel typing to completely wall Necrozma-DM.</p> <p><strong>Orthworm</strong>: Albeit rare, Orthworm completely walls Necrozma-DM and uses Shed Tail for free against it.</p>",
    "sets": {
      "Defensive Dragon Dance": {
        "description": "<p>Defensive Dragon Dance Necrozma-DM is one of the best setup sweepers in the format thanks to how easy it is for it to find opportunities to set up due to its excellent bulk and the rarity of Pokemon that can actually punish its setup attempts. Sunsteel Strike is Necrozma-DM's main STAB move that, despite its low PP, is very spammable due to how hard it hits most neutral targets, as well as Fairy-type Pokemon such as Arceus-Fairy, Zacian-C, Flutter Mane, and Tera Fairy users like Kyogre. If Necrozma-DM instead wants to hit Water-type Pokemon like Kyogre and Arceus-Water for neutral damage, Photon Geyser is also an option. Photon Geyser also has the added benefit of hitting one of Necrozma-DM's best checks in Ho-Oh for solid damage without needing Stealth Rock on the field. It is worth noting that both moves also hit Unaware Skeledirge quite hard. Running Photon Geyser and Sunsteel Strike in the same moveset is advised against due to its inability to hit opposing Necrozma-DM hard. Knock Off is Necrozma-DM's best option alongside Sunsteel Strike because it lets it remove key items like Ho-Oh and Kyogre's Heavy-Duty Boots, giving Necrozma-DM an opportunity to take them out later after it has used Dragon Dance if they're sufficiently worn down. Knock Off can also help Necrozma-DM remove other items like Gliscor's Toxic Orb if it didn't use Protect to activate its ability. Earthquake is the other option to consider over Knock Off and one that works best when used alongside Photon Geyser to hit the aforementioned Pokemon for high damage, particularly opposing Necrozma-DM and Zacian-C, which take less damage from Photon Geyser than they do from Sunsteel Strike. Earthquake also targets Tera Electric Pokemon like Kyurem-B and Zekrom that otherwise would break past Necrozma-DM. Tera Fire is Necrozma-DM's best type to Terastallize into because of its great defensive profile, letting it turn the tables against Koraidon and Flutter Mane while also becoming immune to Will-O-Wisp and Sacred Fire's chance to burn. The given EVs allow Necrozma-DM to avoid the OHKO from Zacian-C's +3 Tera Fighting Close Combat. Another EV spread to run is 252 HP / 136 Def / 120 Spe with an Impish nature; this allows Necrozma-DM to outspeed Deoxys-A after two Dragon Dance uses. However, Zacian-C then has a very high chance of OHKOing Necrozma-DM with a +3 Close Combat.</p> <p>Defensive Dragon Dance Necrozma-DM is a key piece in many bulky offense teams due to the role compression that it brings to them; checking Zacian-C while being a good wallbreaker or sweeper that can set up on Gliscor is invaluable for them. However, it might still struggle to sweep because of its poor Speed and need of multiple Dragon Dances to actually be faster than most offensive threats. Because of this, Necrozma-DM heavily appreciates teammates like Ho-Oh, Arceus-Water, Arceus-Fairy, Ting-Lu, Landorus-T, and Gliscor that can check the majority of Pokemon that might overwhelm it, such as Koraidon, Zacian-C, Calyrex-I, and Kyurem-B. Arceus formes also help Necrozma-DM by switching into Knock Off, preventing it from losing its item and, therefore, preventing it from taking entry hazard damage. Pokemon with access to entry hazards like the aforementioned Ting-Lu and Arceus formes can help Knock Off variants of Necrozma-DM overwhelm checks to it like Ho-Oh and Kyogre; Thunder Wave Arceus-Fairy in particular is a good teammate, as it can cripple Ho-Oh for Necrozma-DM. Choice Scarf Koraidon in particular is one of Necrozma-DM's best partners because it revenge kills many of the threats that it can't reliably check by itself like Zacian-C while bolstering Morning Sun's recovery.</p>"
      },
      "Offensive Dragon Dance": {
        "description": "<p>Dragon Dance Necrozma-DM can run an all-out offensive spread to hit as hard as possible. EdgeQuake coverage hits everything from opposing offensive Necrozma-DM, Miraidon, and Eternatus to Ho-Oh very hard, meaning that the Pokemon that actually check Necrozma-DM are limited to Pokemon like Arceus-Water, Kyogre, Ting-Lu, Arceus-Dark, defensive Necrozma-DM, and Landorus-T. Photon Geyser can be an option over Stone Edge if Necrozma-DM wishes to turn the tables on Arceus-Water and Kyogre. The combination of Sunsteel Strike and Photon Geyser allows Necrozma-DM to defeat every aforementioned check, with its counterplay becoming even more limited to faster foes like Choice Scarf Koraidon, although Ho-Oh becomes better suited to taking it on, as it survives a +1 Photon Geyser. However, Ho-Oh can get OHKOed by a +1 Photon Geyser if Necrozma-DM is running Life Orb and Tera Psychic. Lum Berry is the primary item of choice to help Necrozma-DM against status from Pokemon like Arceus-Water that might want to paralyze or burn Necrozma-DM, and it is best used with Photon Geyser, as a +1 Photon Geyser 2HKOes Arceus-Water after Stealth Rock and OHKOes it at +2 with Tera Psychic. Occa Berry allows Necrozma-DM to survive a Flare Blitz from Koraidon, letting it boost with Dragon Dance or use Sunsteel Strike or Photon Geyser for massive damage. This, however, heavily worsens Necrozma-DM's matchup against status and might force it to Terastallize into the Fire typing more often than not to play around that. Life Orb empowers Necrozma-DM's attacks to insane levels, allowing it to OHKO offensive Ho-Oh and Kyogre with Photon Geyser while 2HKOing Arceus-Water through burn. A +1 Life Orb Sunsteel Strike also has a chance to OHKO Arceus-Dark after a single round of Stealth Rock damage. Tera Fire allows Necrozma-DM to have an easier time setting up on Koraidon, Ho-Oh, and Will-O-Wisp variants of Arceus, whereas Tera Psychic empowers Photon Geyser to the point of giving Necrozma-DM a tool to potentially OHKO Ho-Oh at +1 while also resisting Koraidon's Low Kick.</p> <p>Necrozma-DM fits best on hyper offense teams that can capitalize on the damage it causes to opposing physical walls. Physical attackers like Koraidon, Zacian-C, Calyrex-I, and Rayquaza are all good partners because they also share common checks with Necrozma-DM in Arceus-Water, Arceus-Fairy, and opposing Necrozma-DM and can wear them down together. Grimmsnarl can ease setup for Necrozma-DM with dual screens, Ribombee can help with Necrozma-DM's middling Speed, and Deoxys-S can get entry hazards on the field for Necrozma-DM to better deal with its checks like Giratina-O, Arceus-Water, and Arceus-Ground.</p>"
      },
      "Trick Room": {
        "description": "<p>Trick Room makes Necrozma-DM a scary anti-offense Pokemon and late-game sweeper that can very quickly turn the tides in its favor thanks to Terastallization and powerful neutral coverage. Running Trick Room allows Necrozma-DM to fully invest in bulk, allowing it to survive hits that it would otherwise not be able to, such as unboosted Flare Blitz and Modest Origin Pulse from Koraidon and Kyogre, respectively. Photon Geyser and Earthquake provide Necrozma-DM with near-perfect neutral coverage, only missing out on select Pokemon like Skarmory and Tera Steel Giratina-O. Lum Berry allows Necrozma-DM to beat most Arceus formes one-on-one, mainly Arceus-Water that would try to burn Necrozma-DM with Will-O-Wisp. This lets Necrozma-DM set up without any fear of getting statused. Life Orb gives Photon Geyser the needed extra power to OHKO maximum Defense Ho-Oh at +2; however, Necrozma-DM needs two free turns to use the appropriate moves and thus can be played around with ease. Weakness Policy is an option as well to take advantage of Necrozma-DM's monstrous bulk, assuming it survives a super effective hit. This can prove to be a game-ender, as a +2 Necrozma-DM is very difficult for worn-down or unprepared teams to face. However, both Life Orb and Lum Berry are far better options if Necrozma-DM wants an offensive item because Weakness Policy variants are prone to getting statused. Lastly, Mental Herb might seem odd on a Pokemon like Necrozma-DM, but it helps it to play around Taunt from Pokemon like Miraidon, Deoxys formes, Arceus formes, and even Gliscor that would try and stop Necrozma-DM from using Trick Room. Tera Fire allows Necrozma-DM to avoid getting burnt by Will-O-Wisp Arceus formes and Sacred Fire from Ho-Oh while turning its Fire-type weakness into a resistance to beat Koraidon one-on-one.</p> <p>Trick Room Necrozma-DM fits best on hyper offense teams that want an anti-offense option that can beat Pokemon like Calyrex-I while simultaneously wanting very potent late-game insurance. Good teammates include Calyrex-I, Koraidon, Zacian-C, Rayquaza, and Kyurem-B thanks to their ability to break past common physically defensive walls like Arceus-Water, Arceus-Fairy, Groudon, and Landorus-T. Pokemon like Deoxys-A and Glimmora make for good partners as well for their ability to soften these physical walls with entry hazards. This set, however, does not fit well onto Sticky Web hyper offense teams because it is counterproductive.</p>"
      },
      "Defensive": {
        "description": "<p>Defensive Necrozma-DM takes advantage of its excellent bulk and defensive typing, which makes it one of the most reliable Stealth Rock setters and pivots. Maximum Defense investment allows Necrozma-DM to avoid the 2HKO from even +3 Zacian-C's Wild Charge, and Heavy-Duty Boots provides further protection against entry hazards. Sunsteel Strike is used because defensive Necrozma's primary role is to check Zacian-C, Extreme Killer Arceus, and Calyrex-I, which are all hit harder by Sunsteel Strike than Photon Geyser. Due to the tendency of these Pokemon to use Tera Fire, Earthquake is used as a form of counterplay, which also ensures a 2HKO against Zacian-C, Zekrom, and Tera Electric Kyurem-B. Swords Dance is used to increase Necrozma-DM's damage output and therefore do a better job at checking the Pokemon it's supposed to, with the added benefit of outdamaging defensive Dragon Dance Necrozma-DM. Swords Dance can even turn the tables against Gliscor, whose Earthquake barely scratches Necrozma-DM. Necrozma-DM can also be a consistent Stealth Rock user due to its stellar defensive profile. Alternatively, Necrozma-DM can ensure its switch-ins take Stealth Rock damage with Knock Off. Knock Off is useful for the same reasons it is on the defensive Dragon Dance set. This seriously helps out its teammates that may be blanket checked by Ho-Oh, as Necrozma-DM can do a great job at luring it. Covert Cloak can be used instead of Heavy-Duty Boots to allow Necrozma-DM to safely stay in and use Knock Off against Ho-Oh or hit it with a Swords Dance-boosted attack, as not even offensive Ho-Oh's Sacred Fire 2HKOs Necrozma-DM. However, this does necessitate good hazard control from teammates as to not leave Necrozma-DM vulnerable to hazards. Tera Ground is used on this set, as it is a great neutral defensive type, and it can be used to turn the tables on Zekrom and Tera Electric Kyurem-B by becoming immune to Electric-type attacks. Additionally, it allows Necrozma-DM to get an extra hit off against Miraidon targeting it with Electro Drift.</p> <p>Defensive Necrozma-DM fits best on balance teams in need of a reliable check to Zacian-C and Extreme Killer Arceus. Its favorite partners are similar to defensive Dragon Dance Necrozma-DM, and include fellow hazard setters and Choice Scarf Koraidon. Arceus-Fairy is a good partner for Necrozma-DM, as it can use Thunder Wave against Ho-Oh to allow Necrozma-DM to outspeed it. Arceus-Fairy can also set Stealth Rock if Necrozma-DM is not running it. Arceus-Fairy benefits from having defensive Necrozma-DM as a partner because Necrozma-DM can check opposing Necrozma-DM that threaten Arceus-Fairy. Other notable partners for Necrozma-DM are Pokemon that help with Ho-Oh and Fire-type attacks in general, like Arceus-Water, Gliscor, and Eternatus. Covert Cloak sets really appreciate Giratina-O because it can offer Defog support to remove entry hazards, as well as providing a way to better deal with Arceus-Ground. Pokemon that appreciate Necrozma-DM's ability to effectively pressure Ho-Oh with Knock Off and Stealth Rock, like Arceus-Fairy, Koraidon, and Ho-Oh, love having it as a partner.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}, {"username": "ox04", "user_id": 507268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Manaphy", "user_id": 50695}, {"username": "Aberforth", "user_id": 249382}, {"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}, {"username": "SolarBeam", "user_id": 470115}]}]}
  },
  "Magearna": {"sets": {"Double Dance": {}, "Trick Room Setter": {}}},
  "Corviknight": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<ul> <li>Corviknight's high physical bulk gives it a strong defensive presence in the tier. It is one of the few consistent counters to strong Ground-types like Great Tusk, physical attackers like Chien-Pao, and some special attackers like non-Choice Specs Iron Bundle. Furthermore, its access to Defog also makes it a solid entry hazard remover, though it struggles against Gholdengo.</li> <li>Body Press provides Corviknight with a way to leverage its high Defense stat, doing significant damage to Fighting-weak Pokemon.</li> <li>Brave Bird allows Corviknight to threaten Flutter Mane and Great Tusk. Alternatively, Iron Head can be used to threaten the former while avoiding recoil damage.</li> <li>Maximum HP investment and enough Defense to check Chien-Pao is combined with Leftovers and 96 Special Defense EVs, which allows Corviknight to take two Mystical Fires from most Flutter Mane, as well as giving it the ability to take on non-Choice Specs Iron Bundle and weaker attacks like Freeze-Dry from Choice Specs Iron Bundle.</li> <li>Tera Steel or Flying can be used to shed the weaknesses of Corviknight's dual typing: Tera Steel allows Corviknight to resist Ice-type attacks from Chien-Pao, while Tera Flying allows Corviknight to resist Great Tusk's Fighting-type attacks. Depending on your choice, Terastallization also amplifies the power of either Iron Head or Brave Bird.</li> <li>Corviknight works well as a part of a defensive core with Pokemon like Ting-Lu and Blissey, which can handle threats like Miraidon that obliterate Corviknight. Additionally, Corviknight makes a great partner for offensive threats like Chi-Yu, which appreciate a teammate that easily switches into Ting-Lu, or Great Tusk, which appreciates opposing Great Tusk being worn down.</li> </ul>"
      },
      "Specially Defensive": {
        "description": "<ul> <li>Specially defensive Corviknight can switch into foes like Flutter Mane, Iron Bundle, Gholdengo, and Glimmora.</li> <li>U-turn is used to make Corviknight an effective defensive pivot that can maintain momentum against foes that force it out such as Miraidon and Koraidon.</li> <li>Mirror Armor allows Corviknight to check Mystical Fire Flutter Mane, which would otherwise beat it. Alternatively, when paired with Pressure, Protect enables Corviknight to avoid being 2HKOed by Hydro Pump from Choice Specs Iron Bundle, as well as allowing Corviknight to deplete PP with Pressure more effectively.</li> <li>Corviknight can use Tera Steel to get rid of its weakness to Electric and better take on Ice-type moves from Iron Bundle. Alternatively, it can opt to use Tera Ground to become immune to Miraidon's powerful Electro Drift.</li> <li>Specially defensive Corviknight needs help dealing with strong physical wallbreakers such as Chien-Pao from teammates like Dondozo and Scream Tail. Furthermore, Pokemon that are especially threatened by Flutter Mane and Iron Bundle, such as Koraidon, Great Tusk, and Skeledirge, are able to rely on specially defensive Corviknight as a consistent switch-in.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Drifting", "user_id": 342456}], "teams": [{"name": "Quality checked by", "members": [{"username": "SiTuM", "user_id": 274590}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Hatterene": {
    "outdated": true,
    "sets": {
      "Bulky Calm Mind": {
        "description": "<ul> <li>Hatterene is mostly used to deny entry hazards on offensive teams to allow threats to come in unscathed, and stall teams so they have breaking power and an easier time against hazards.</li> <li>The combination of Draining Kiss and Calm Mind with Defense investment helps Hatterene take hits from common walls like Great Tusk and Ting-Lu well, using them for recovery or setup.</li> <li>Psyshock and Stored Power are interchangeable, as Psyshock is better on more balance and offensive teams due to its immediate power, while Stored Power fits better on bulkier teams, helping them break past walls the teams would otherwise struggle with like Dondozo.</li> <li>Mystical Fire is useful coverage to hit Steel-types, such as Corviknight and Iron Treads, while Protect is used to scout double switches, scout Choice item uses, and rack up Leftovers recovery.</li> <li>The Speed EVs are to outspeed Dondozo.</li> <li>Tera Water provides Hatterene with a Fire resistance and Ghost neutrality to better deal with Koraidon and Flutter Mane. Additionally, Tera Water Hatterene resists Steel-type moves from Kingambit and Corviknight and resists Ice- and Water-type moves, allowing Hatterene to tank hits from Chien-Pao and Iron Bundle more effectively.</li> <li>Tera Flying gives Hatterene immunity to Ground-type moves from Ting-Lu and Great Tusk while also resisting Fighting moves from Koraidon and Great Tusk. It also gives Hatterene a Spikes immunity, giving it easier entry against offensive teams.</li> <li>Stealth Rock-weak Pokemon such as Chien-Pao, Chi-Yu, and Iron Bundle are great partners to Hatterene, since they benefit from Hatterene denying Stealth Rock.</li> <li>Koraidon and Miraidon are great partners, since Hatterene can break their most common checks, being Great Tusk and Toxapex for Koraidon, and Ting-Lu and Clodsire for Miraidon. Hatterene benefits from the breaking power of the Dragon-types, since they can remove offensive threats that annoy Hatterene like Flutter Mane and Miraidon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mashing", "user_id": 537354}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "ox04", "user_id": 507268}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Grimmsnarl": {
    "outdated": true,
    "sets": {
      "Dual Screens": {
        "description": "<ul> <li>Grimmsnarl is a prominent part of Ubers hyper offense teams as the most reliable dual screens setter in the tier.</li> <li>Taunt stops would-be setup sweepers, prevents entry hazards from Pokemon like Froslass and Glimmora, and stops Corviknight from using Defog.</li> <li>Play Rough is mandatory to deal decent damage to one of the most common Pokemon in the tier in Ting-Lu, which is immune to Taunt and can use Grimmsnarl as setup bait for Spikes, damage it greatly with Ruination, and phaze any incoming Pokemon with Whirlwind. In a pinch, Play Rough also does good damage to Miraidon and Koraidon.</li> <li>Tera Ghost is chosen to prevent Great Tusk and Iron Treads from using Rapid Spin, while Tera Steel provides useful resistances, most notably to Fairy-type attacks.</li> <li>Grimmsnarl works well when paired with a suicide lead such as Froslass or Glimmora, as they can set up Spikes and Toxic Spikes, thereby giving any setup sweepers a much easier time sweeping.</li> <li>Dual screens support gives Pokemon such as Calm Mind Miraidon, Swords Dance Koraidon, and Swords Dance Chien-Pao an easier time setting up and makes revenge killing them significantly harder.</li> <li>Iron Moth is a notable teammate for being a strong setup sweeper that can also absorb Toxic Spikes.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "corvere", "user_id": 306317}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Zacian": {"sets": {"Choice Band Wallbreaker": {}}},
  "Zacian-Crowned": {"sets": {"Wallbreaker": {}}},
  "Zamazenta-Crowned": {"sets": {"IronPress": {}}},
  "Eternatus": {
    "overview": "<p>Eternatus is the premier dedicated Kyogre check in Ubers, able to tank even boosted Ice Beams and stall Kyogre out with Toxic and Recover. Additionally, its access to, and ability to absorb, Toxic Spikes give it great utility in a tier where hazard removal options are few. Eternatus can also take Ho-Oh's Sacred Fire with ease, as well as scare out the majority of Calm Mind Arceus formes. Outside of being a wall, Eternatus can pull off a threatening Meteor Beam set which works excellently on hyper offense teams, and Choice Scarf lets Eternatus be a decent revenge killer that also absorbs Toxic Spikes. It can be difficult to fit Eternatus on some teams, as it lacks the sheer role compression of Clodsire, and it stacks weaknesses with some of the most common Pokemon in the tier, Koraidon and Miraidon. Meteor Beam Eternatus can have a hard time getting past Ho-Oh once Meteor Beam is used, and Ting-Lu and Arceus-Ground are a hard stop to it. Furthermore, Necrozma-DM and Zacian-C can be a huge nuisance for the defensive set, as they can shrug off most of its attacks and use it as a setup opportunity.</p>",
    "comments": "<h1>Other Options</h1> <p>Leftovers can be run over Heavy-Duty Boots when provided with Defog support. Dragon Tail can be used to phaze out Tera Poison users as well as rack up Toxic Spikes damage, but it is generally not as useful as Toxic at dealing with most Kyogre and Arceus formes. Sludge Bomb is a more offensive alternative to Toxic, but relying on its 30% chance to poison can be unreliable for dealing with special threats. Cosmic Power sets can be difficult for the opposing team to deal with, as Eternatus is immune to poison and has reliable recovery. Unfortunately, these sets tend to get phazed out by Ting-Lu and Ho-Oh before accomplishing much, and are limited by Recover's 8 PP.</p> <h1>Checks and Counters</h1> <p><strong>Steel-types</strong>: Necrozma-DM and Zacian-C are the most common switch-ins to Eternatus, as they are immune to poison and can quickly become powerful offensive threats when given a chance to set up. However, neither of them like taking Flamethrower or Fire Blast, especially in the sun.</p> <p><strong>Ground-types</strong>: Clodsire hard walls most Eternatus sets, taking on Dynamax Cannon and using Eternatus as an opportunity to set entry hazards. It's worth noting that Eternatus can often stall out Clodsire's Earthquake with Pressure. Additionally, offensive Eternatus is capable of blasting through Clodsire, provided it has a Special Attack boost. Ting-Lu and Arceus-Ground both fear Toxic, but can threaten Eternatus back with powerful Earthquakes and Ground-type Judgment. Specially defensive Gliscor can tank Dynamax Cannon and set hazards on Eternatus.</p> <p><strong>Ice-types</strong>: Chien-Pao and Calyrex-I, though neither likes directly switching in, both threaten to OHKO Eternatus and may run Heavy-Duty Boots to avoid Toxic Spikes.</p> <p><strong>Tera Poison</strong>: A timely Tera Poison from Kyogre or Calm Mind Arceus formes like Arceus-Water and Arceus-Ground can turn the tables against Eternatus, though these Pokemon typically run another Tera type such as Fairy.</p> <p><strong>Paralysis</strong>: Eternatus must be careful to avoid being paralyzed, as it makes successfully checking Kyogre much harder. Kyogre may paralyze Eternatus on the switch with Thunder Wave or fish for it with Thunder. Other Pokemon like Arceus-Fairy, Arceus-Water, and Giratina-O commonly run Thunder Wave, so Eternatus must be careful when switching in on them.</p> <p><strong>Blissey</strong>: While only seen on stall, Blissey hard walls all Eternatus sets and can heal status from its teammates with Heal Bell.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>While Toxic and Toxic Spikes may seem redundant together, Toxic is critical for dealing with Kyogre, as it often runs Heavy-Duty Boots. Toxic Spikes are a great way to pressure the opposing team, especially those lacking Poison-types or Defog users. Even against such teams, Toxic Spikes can still be advantageous when combined with smart double switching. Toxic Spikes are also one of the few ways to make progress against Necrozma-DM, Zacian-C, and Clodsire, all of which wall Eternatus. Flamethrower can be used when combined with Koraidon's sun, as it has a 76% chance to 2HKO defensive Necrozma-DM, and it can also heavily dent Zacian-C. Tera Fairy allows Eternatus to get the jump on Koraidon and Miraidon's Dragon-type attacks. Alternatively, Tera Grass provides great utility against Arceus-Ground, letting Eternatus Toxic it without worry. The given EVs let Eternatus outspeed neutral-natured max Speed Arceus formes, with the rest dumped into Special Defense and HP to better take on Kyogre. It is possible to run less Speed EVs; 212 HP / 252 Def / 44 Spe with a Calm nature allows Eternatus to outrun positive-natured base 90 Speed Pokemon while providing more special bulk.</p> <p>Eternatus excels on balance teams that aim to win in the long-term, as its immediate damage potential is rather low. Against hyper offense structures such as Sticky Webs teams, Eternatus's Toxic Spikes can greatly limit the opposing team's sweeping potential. Critical defensive Pokemon like Arceus-Fairy, Ting-Lu, and Arceus-Water are all vulnerable to both Toxic Spikes and Kyogre, so Eternatus is a fantastic teammate with them, since it can deal with both. Defensive Dragon Dance Necrozma-DM is a highly recommended partner for checking Zacian-C and providing Knock Off support. Ho-Oh, Landorus-T, and Corviknight are good teammates for providing a Ground immunity, with Corviknight having the added bonus of Defog support.</p>"
      },
      "Meteor Beam Attacker": {
        "description": "<p>This set leverages Eternatus's great bulk, speed, power, and ease of setup to become one of the most dangerous late-game sweepers in the metagame. 88 Speed EVs allow Eternatus to outrun unboosted Jolly Rayquaza and Kyurem-B, as well as the entire metagame after a single Agility, even outspeeding +1 Koraidon. The rest of Eternatus's EVs are invested into its HP, letting it easily survive hits when setting up and avoiding an OHKO from unboosted Koraidon’s Dragon Claw. Tera Fire aids Eternatus even further in taking hits while setting up, crucially giving it Ice- and Steel-type resistances and a neutrality to Koraidon’s Dragon Claw. Tera Fire also strengthens Eternatus's Fire Blast, which, in conjunction with Koraidon’s sun and a Meteor Beam boost, can perform absurd feats like easily 2HKOing would-be checks in Clodsire and Ting-Lu, being favored to OHKO defensive Arceus-Ground, and always OHKOing Necrozma-DM, while Tera Dragon strengthens Dynamax Cannon, giving Eternatus more consistency in sweeping late-game thanks to Dynamax Cannon's perfect accuracy. Aside from giving Eternatus a much-needed power boost, Meteor Beam is great for destroying Ho-Oh, an otherwise great check, as well as hitting Tera Fire Calyrex-I super effectively, as Calyrex-I will usually Terastallize into the Fire typing to resist Fire Blast and threaten Eternatus. Fire Blast is used to hit Steel-types that wall the combination of Meteor Beam and Dynamax Cannon, most notably Necrozma-DM and Zacian-C. Sludge Bomb should only ever be used over Agility on Sticky Web teams, and even then, while it destroys Arceus-Fairy and Tera Fairy Pokemon like Ho-Oh, Kyogre, and Miraidon, it has little practical use outside of this. This set is not a perfect sweeper, however, as it cannot set up as easily as it might seem due to the prevalence of Pokemon that irritate it like Ting-Lu and Arceus-Ground.</p> <p>Eternatus is a great choice for offensive teams that struggle with Toxic Spikes and Kyogre, as it removes Toxic Spikes and can decently check Kyogre when healthy. Koraidon makes for a good pairing with Eternatus, as it appreciates Eternatus removing Toxic Spikes and checking Kyogre and Arceus-Fairy, whereas Eternatus loves Koraidon not only threatening its checks but also for its sun, which strengthens its own Fire-type coverage. Pokemon that can overwhelm defensive Ground-types that check Eternatus, like Miraidon and Calyrex-I, are also appreciated. Entry hazard leads like Deoxys-A, Deoxys-S, and Glimmora are great for Eternatus, as the immediate chip damage is greatly helpful for a Pokemon that aims to claim OHKOs as much as it does. Eternatus is also useful when supported by Pokemon that can ward off Koraidon and Miraidon, Eternatus’s greatest nemeses. Kyogre, Arceus-Fairy, and Ting-Lu can do this decently and support Eternatus in other ways; for example, Ting-Lu can set Spikes.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}, {"username": "OreoSpeedruns", "user_id": 597293}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}, {"username": "ox04", "user_id": 507268}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Urshifu": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Urshifu-Rapid-Strike": {"sets": {"Choice Band": {}}},
  "Regieleki": {"sets": {"Dual Screens": {}}},
  "Spectrier": {"sets": {"Nasty Plot": {}, "Choice Specs": {}}},
  "Calyrex-Ice": {
    "sets": {
      "Offensive Trick Room": {
        "description": "<ul> <li>Thanks to its great bulk, breathtaking offensive profile, and access to Trick Room, Calyrex-I is a ferocious wallbreaker for offensive teams.</li> <li>Calyrex-I being an offensive Ice-type is great in Ubers, where there are very few Ice-resistant Pokemon and many targets hit super effectively by Ice, such as Koraidon, Miraidon, Ting-Lu, and Arceus-Ground.</li> <li>An Adamant Nature allows Calyrex-I to outspeed Ting-Lu outside of Trick Room and threaten it without fear of taking a Ruination.</li> <li>Heavy-Duty Boots is almost always the preferred item because of Calyrex-I's crippling weakness to entry hazards, but Calyrex-I can occasionally leverage its huge bulk to take advantage of Weakness Policy.</li> <li>Tera Fire gives Calyrex-I an immunity to Will-O-Wisp from its best check, Skeledirge, while giving it a Fire and Steel resistance, allowing it to set up on even Koraidon and Zacian-C.</li> <li>While Tera Fire is generally preferred for its better defensive capabilities, Tera Ground is an alright option that grants Calyrex-I STAB on High Horsepower, allowing it to OHKO Zacian-C without a boost.</li> <li>Because of Calyrex-I's absurd wallbreaking prowess, it is best used on offensive teams as a mid-game wallbreaker or late-game sweeper once its checks are weakened. Because its bulk is so great, Calyrex-I can come in and set up on many Pokemon that can't damage it much, like Ting-Lu, Landorus-T, and defensive Eternatus.</li> <li>Koraidon is an excellent partner, as it and Calyrex-I can weaken their shared checks like Skeledirge, Toxapex, and Kyogre for each other. Calyrex-I also loves Koraidon giving it free switches with a strong U-turn.</li> <li>Kyogre can threaten Calyrex-I's checks for it, as can Calyrex-I for Kyogre. Kyogre is also decently slow, so it appreciates the support of Trick Room if Calyrex-I itself is KOed while Trick Room is active.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "OreoSpeedruns", "user_id": 597293}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Ursaluna-Bloodmoon": {"sets": {"Bear": {}}},
  "Basculegion": {"sets": {"Agility Sweeper": {}}},
  "Skeledirge": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Skeledirge functions as a catch-all check to the strongest physical attackers in Ubers, notably taking on Koraidon, Zacian-C, and some variants of E-Killer Arceus.</li> <li>Unaware fully prevents Swords Dance Koraidon and Zacian-C from breaking down Skeledirge through pure force, in contrast to other physical walls like Groudon and Toxapex. Unaware even lets Skeledirge have some use against special attackers like Calm Mind + Will-O-Wisp Arceus-Fairy.</li> <li>Torch Song is a good STAB move that boosts Skeledirge's Special Attack each time it's used, making it a good way to force out foes and turning Skeledirge into a potential late-game wincon.</li> <li>There are two options for the secondary attacking move. Hex pairs very well with Will-O-Wisp, becoming a 130-Base Power STAB move. On the other hand, Earth Power is very useful against Pokemon that use Tera Fire to avoid burns, such as Koraidon, and it also hits Miraidon and Eternatus switch-ins hard.</li> <li>The combination of reliable recovery with Slack Off and Heavy-Duty Boots means that Skeledirge can easily stay healthy throughout the game and not worry about entry hazards.</li> <li>Tera Fairy is useful against Choice Band Koraidon in particular, as it can break through Skeledirge with Dragon Claw or Outrage; the downside is that Tera Fairy makes Skeledirge vulnerable to Zacian-C's Behemoth Blade. Tera Flying gives Skeledirge an immunity to Ground-type moves, which can be helpful against Arceus-Ground and Stomping Tantrum Koraidon. Tera Water provides a good all-around neutral defensive type to use which maintains an Ice-type resistance for Chien-Pao and Calyrex-I.</li> <li>Skeledirge offers a great deal of role compression to teams thanks to its ability to reliably check so many offensive threats.</li> <li>Skeledirge's main flaw is that it can be passive and vulnerable to double switches, U-turn, and Taunt.</li> <li>Koraidon can often take advantage of the predictable switch to Skeledirge to bring in deadly offensive threats such as Chi-Yu, Walking Wake, and Kyogre with U-turn. As a result, it may be advantageous to anticipate U-turn in these scenarios.</li> <li>Taunt is often employed as a method to bypass Skeledirge's Will-O-Wisp, especially by Koraidon and E-Killer Arceus. If you expect the foe to use Taunt, taking advantage of the situation and gaining Special Attack boosts with Torch Song is a great way to limit their ability to wallbreak.</li> <li>Ting-Lu and Clodsire are excellent teammates for Skeledirge, as they cover most of the special attackers that come in on it, especially Miraidon, while Skeledirge can in turn handle most physical threats. Together they form a solid defensive backbone.</li> <li>Skeledirge is unable to take on Ground-type physical attackers like Arceus-Ground, Tera Ground Zacian-C, and Groudon without using Tera itself. As a result, Pokemon that resist or are immune to Ground like Corviknight, Giratina-O, Landorus-T, and Arceus-Grass make for good partners. Corviknight has the additional benefit of solidifying the matchup against E-Killer Arceus.</li> <li>Arceus-Fairy is useful as a backup check to Koraidon, and it makes it much more difficult for Koraidon to get easy momentum with U-turn.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Espathra": {
    "outdated": true,
    "sets": {
      "Calm Mind": {
        "description": "<ul> <li>Espathra's niche is sweeping with its unique combination of Calm Mind, Speed Boost, and STAB Stored Power.</li> <li>Dazzling Gleam super effectively hits Dark-types, which are immune to Stored Power, like Chien-Pao, Ting-Lu, and Grimmsnarl.</li> <li>Substitute protects Espathra from potential status conditions that might stop its sweep, like from Clodsire's Toxic.</li> <li>Protect, instead, allows Espathra to scout Choice-locked foes, such as Choice Specs Miraidon. In addition, Protect lets Espathra freely boost its Speed and get Leftovers recovery.</li> <li>Roost keeps Espathra healthy and makes it less susceptible to priority attacks, like Chien-Pao and Kingambit's Sucker Punch. Roost also allows Espathra to beat Ting-Lu not packing Whirlwind one-on-one.</li> <li>Tera Fairy turns Espathra's Dark weakness into a resistance, letting it survive the aforementioned Sucker Punch, as well as bolstering its Dazzling Gleam.</li> <li>Tera Fighting also turns Espathra's Dark weakness into a resistance. Paired with Tera Blast, it beats the aforementioned Dark-types, Kingambit and Chien-Pao, and Steel-types like Iron Treads.</li> <li>112 EVs in Speed allow Espathra to outspeed the entire unboosted metagame at +1, including Iron Bundle. At +2, it can even outspeed +1 Iron Valiant.</li> <li>The rest of its EVs are poured into physical bulk for survivability, since Calm Mind will boost Special Defense anyway. Electric Seed further improves Espathra's physical bulk while also giving it another boost to Stored Power. Leftovers gives Espathra long-term recovery, and it can be optimized with Calm Mind and the choice of Substitute, Protect, or Roost.</li> <li>Espathra functions best on offensive teams to sweep after its checks have been weakened. Espathra is very frail and it usually can't switch in safely more than once, so it must fully commit to a sweep once it hits the field.</li> <li>Fighting-types like Koraidon and Great Tusk make for good partners, as they threaten Dark- and Steel-types that resist or are immune to Espathra's Stored Power.</li> <li>Strong Dark-types like Chien-Pao and Chi-Yu resist Dark- and Ghost-type attacks, which target Espathra, while also threatening Ghost- and Psychic-types. The former threaten Espathra, and the latter resist Stored Power.</li> <li>Miraidon is a necessary partner if Espathra is holding Electric Seed, as Electric Terrain activates the item.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "OreoSpeedruns", "user_id": 597293}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Eledyr", "user_id": 415367}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Palafin": {
    "outdated": true,
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Wave Crash is a very strong STAB move. With Stealth Rock support and Tera Water's power boost, it crushes walls Palafin normally might struggle to break, like Toxapex and Corviknight, and always OHKOes Miraidon.</li> <li>Close Combat is a strong, reliable coverage move that hits many of Palafin's checks like Corviknight and Koraidon for solid damage, while also hitting Water-types barring Toxapex for neutral damage.</li> <li>Ice Punch allows Palafin to hit Dragon-types like the very common Koraidon and Miraidon while also hitting Water Absorb Clodsire. However, it cannot OHKO Koraidon and is not guaranteed to OHKO Miraidon.</li> <li>Zen Headbutt allows Palafin to hit Toxapex super effectively, as well as potentially OHKOing Koraidon and having fantastic odds to 2HKO Miraidon.</li> <li>Tera Water powers up Palafin's Water-type moves and allows Palafin to achieve feats like 2HKOing Miraidon with Jet Punch from full HP if rain is up.</li> <li>Choice Band Palafin functions best on offensive teams to revenge kill threats like Flutter Mane or to break walls for its teammates mid-game. Remember, base Palafin needs to be used very early in a game to transform into its Hero Form.</li> <li>Pelipper is a great partner for Palafin, as it checks Koraidon decently and replaces its sun with rain, strengthening Palafin's powerful Water-type attacks.</li> <li>Koraidon sets up sun and resists Water-type attacks Palafin throws at it, so Palafin appreciates teammates that threaten Koraidon, like Iron Bundle and Flutter Mane. Also, Palafin is weakened by the sun Koraidon sets up, so it is best not to pair Palafin and Koraidon together.</li> <li>Miraidon is a good partner, as it destroys Alomomola, a great counter to Palafin, and can safely bring Palafin onto the field with either U-turn or Volt Switch. Miraidon also appreciates Palafin threatening Ground-type Pokemon that can take Miraidon's Electric-type attacks, like Ting-Lu, Iron Treads, and Clodsire.</li> </ul>"
      },
      "Bulk Up": {
        "description": "<ul> <li>Jet Punch's strong priority allows this Palafin set to still be threatening to offensive builds, while Drain Punch keeps Palafin healthy against bulkier teams.</li> <li>Taunt allows Palafin to prevent common responses to setup sweepers from working, such as Whirlwind from Ting-Lu and Haze from Toxapex, while also preventing Pokemon like Annihilape from setting up alongside it.</li> <li>Fairy is the Tera type of choice to allow Palafin to resist both of Koraidon's STAB attacks and potentially set up on Choice Scarf variants of it. Fairy also removes Palafin's weakness to Iron Bundle's Freeze-Dry and Miraidon's Electric moves.</li> <li>Palafin struggles to deal with Koraidon or Miraidon, which can come in on this set easily, especially given that Zero to Hero forces Palafin to switch at least once before it can be offensively threatening. As a result, this Palafin needs teammates that can defensively handle these threats. Ting-Lu and Iron Treads both help with Miraidon, and Pokemon like Great Tusk, Scream Tail, and Skeledirge can provide defensive solidity against Koraidon.</li> <li>This Palafin set functions best with a sturdy defensive backbone alongside it, to mitigate the impact of Zero to Hero. As a result, it does not work as well on more hyper offensive playstyles.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "OreoSpeedruns", "user_id": 597293}, {"username": "Aberforth", "user_id": 249382}], "teams": [{"name": "Quality checked by", "members": [{"username": "ox04", "user_id": 507268}, {"username": "Mashing", "user_id": 537354}, {"username": "corvere", "user_id": 306317}, {"username": "Eledyr", "user_id": 415367}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Orthworm": {
    "outdated": true,
    "sets": {
      "Shed Tail": {
        "description": "<ul> <li>Orthworm faciliates setup sweepers on hyper offense teams thanks to its Ground immunity and access to Shed Tail. Unlike Cyclizar, Orthworm is able to pass slow Shed Tails due to its low Speed.</li> <li>Orthworm has access to both Stealth Rock and Spikes, helping it wear down walls for its setup sweeper teammates. Stealth Rock is usually preferred for limiting Chien-Pao, Chi-Yu, and Iron Bundle, but Spikes can be used if your team already has a Stealth Rock setter. Body Press punishes Kingambit and Chien-Pao trying to wear down and set up on Orthworm. Iron Head is a STAB move that lets Orthworm hit Flutter Mane trying to Taunt it.</li> <li>Tera Water allows Orthworm to safely set up Shed Tail on Koraidon. Tera Ghost lets Orthworm completely blank Fighting-type attacks from Koraidon and Great Tusk while preventing Rapid Spin users from removing entry hazards set by both Orthworm and its teammates. However, Terastallizing Orthworm instead of one of its teammates is often not worth it.</li> <li>Sitrus Berry provides Orthworm with the flexibility to take an attack and use Shed Tail, but Mental Herb is an option to block Taunt.</li> <li>Grimmsnarl is a fantastic partner, as it provides screens support that improves Orthworm's longevity and further eases setup for teammates behind Shed Tail.</li> <li>Entry hazard setters such as Glimmora and Froslass can wear down opponents in conjunction with Orthworm's hazards and Shed Tail, making it easier for teammates to break through walls.</li> <li>Setup sweepers such as Koraidon, Miraidon, Kingambit, Iron Moth, and Espathra appreciate Orthworm's Shed Tail preventing status while giving them some leeway to boost. Koraidon in particular also appreciates Orthworm walling Great Tusk without Fighting-type moves and deterring Great Tusk from using Ground-type moves. Swords Dance Chien-Pao and Calm Mind Flutter Mane similarly appreciate Orthworm's Shed Tail easing setup by compensating for their lower bulk.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Eledyr", "user_id": 415367}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Glimmora": {
    "outdated": true,
    "sets": {
      "Suicide Lead": {
        "description": "<ul> <li>Glimmora stands out as one of the best suicide leads in the metagame thanks to its signature ability in Toxic Debris and great utility movepool consisting of Stealth Rock, Spikes, and Memento. Its high Special Attack alongside STAB and coverage options in Power Gem and Earth Power let it threaten most foes including Miraidon, Iron Bundle, and Iron Treads.</li> <li>Tera Ghost Glimmora prevents common spinners like Iron Treads and Great Tusk from removing the entry hazards that Glimmora sets. Glimmora also benefits from Tera Ghost removing its 4x weakness to Ground-type attacks, letting it threaten these spinners with its coverage more reliably. However, given the nature of Glimmora as a dedicated lead, Terastallizing is not generally recommended.</li> <li>Dazzling Gleam threatens Fighting-types like Koraidon and Great Tusk, as well as Miraidon. Its signature move, Mortal Spin, lets Glimmora act as an entry hazard remover and also cripples Stealth Rock setters like Ting-Lu and Great Tusk with poison.</li> <li>Mortal Spin is a good option when facing setup sweepers that Glimmora cannot threaten if it doesn't have the right coverage like Swords Dance + Flame Charge Koraidon, Double Dance Miraidon, and Bulk Up Annihilape.</li> <li>Memento allows a teammate to come in easily while also preventing entry hazard removal attempts.</li> <li>Glimmora likes offensive staples like Miraidon and Koraidon that can take advantage of the entry hazards it sets up. They both threaten to OHKO Defog Corviknight.</li> <li>Glimmora also appreciates Ghost-types such as Annihilape, Flutter Mane, and Gholdengo, while they appreciate the entry hazards that Glimmora sets.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "GeniusFromHoenn", "user_id": 530778}], "teams": [{"name": "Quality checked by", "members": [{"username": "Eledyr", "user_id": 415367}, {"username": "Lasen", "user_id": 273339}, {"username": "Trade", "user_id": 213053}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Dondozo": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Dondozo is a solid physical wall due to its incredible physical bulk and Unaware. Dondozo fits well on bulky teams where it can switch into physical attackers such as Koraidon, Great Tusk, and Chien-Pao.</li> <li>Liquidation hits Ground- and Fire-types such as Great Tusk, Iron Treads, and Skeledirge. Earthquake lets Dondozo lure in and deal huge damage to Miraidon.</li> <li>Curse makes Dondozo less passive and gives it sweeping potential. Protect lets Dondozo scout for Choice item users such as Koraidon, Miraidon, and Iron Bundle while also recovering health.</li> <li>Rest is the only recovery option for Dondozo and can be used with Sleep Talk to deal with physical attackers such as Koraidon and Chien-Pao better. However, Miraidon's extensive presence in the metagame makes Rest unreliable.</li> <li>Tera Steel lets Dondozo resist Moonblast from Flutter Mane and Freeze-Dry from Iron Bundle. Alternatively, Tera Fairy allows Dondozo to resist Fighting- and Dark-type moves from Koraidon and Chien-Pao while it also gains an immunity to Dragon-type moves.</li> <li>Tera Ground gives Dondozo an immunity to Electric-type moves and can allow it to catch Miraidon by surprise and KO it using a boosted Earthquake.</li> <li>Entry hazard removal options such as Corviknight, Iron Treads, and Great Tusk are great teammates, as foes can take advantage of Dondozo being worn down due to hazards. Dugtrio is a good teammate, as it can trap and KO Miraidon, making Dondozo incredibly tough to stop.</li> <li>Dondozo appreciates special walls such as Ting-Lu, Corviknight, and Blissey that can switch into threats such as Miraidon and Flutter Mane. In return, Dondozo checks their threats in Koraidon, Chien-Pao and Great Tusk.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Manaphy", "user_id": 50695}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Annihilape": {
    "outdated": true,
    "sets": {
      "Bulk Up": {
        "description": "<ul> <li>Annihilape is a solid setup sweeper due to its good Attack stat, decent bulk, and unresisted STAB combination. It can take advantage of Pokemon such as Corviknight, Blissey, and Clodsire.</li> <li>Bulk Up gives Annihilape the potential to sweep while also making it progressively harder to KO.</li> <li>Taunt allows Annihilape to stay healthy and also stops bulkier Pokemon such as Corviknight, Clodsire, and Toxapex from recovering their health. Rest can alternatively be used with Chesto Berry to get rid of status and recover health, but it fails when Electric Terrain is up.</li> <li>Drain Punch allows Annihilape to recover health and damage foes such as Ting-Lu and Iron Treads.</li> <li>Rage Fist, along with Taunt, makes Annihilape incredibly threatening for slow walls such as Dondozo and Ting-Lu, as their attacks do little damage to Annilhilape while also boosting Rage Fist's power.</li> <li>Tera Water allows Annihilape to take hits from special attackers such as Iron Bundle, Chi-Yu, and Flutter Mane while also letting it resist Flare Blitz from Koraidon.</li> <li>Tera Fairy gives Annihilape an immunity against Dragon-type moves from Koraidon and Miraidon while also letting Annihilape take neutral damage from Ghost-type moves from Gholdengo and Flutter Mane, OHKOing them in return with boosted Rage Fist.</li> <li>Annihilape reaches its full potential on dual screens hyper offense teams, where it can easily take hits while setting up.</li> <li>Special walls such as Ting-Lu and Corviknight are good teammates on balance teams, as Pokemon such as Miraidon, Flutter Mane, and Iron Bundle threaten Annihilape. Corviknight is also able to remove entry hazards for Annihilape. Kingambit as a teammate overwhelms Alomomola and Skeledirge, which are common checks to it and Annihilape.</li> <li>Entry hazard setters such as Glimmora, Froslass, Toxapex, and Clodsire can lure in Corviknight, presenting Annhilape with a great setup opportunity by forcing Corviknight to either use Defog and activate Annihilape's Defiant or give Rage Fist a boost by attacking.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Eledyr", "user_id": 415367}, {"username": "corvere", "user_id": 306317}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Clodsire": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Clodsire's special bulk combined with its Ground typing makes it one of the best answers to Miraidon, notably thanks to its ability to absorb Toxic Spikes, which would otherwise trouble other defensive Pokemon such as Ting-Lu.</li> <li>Toxic prevents Clodsire from being overly passive and allows it to outlast Iron Bundle.</li> <li>Clodsire is a decent setter of both Spikes and Stealth Rock, freeing up moveslots on teammates like Great Tusk. However, opposing spinners as well as Corviknight have very little issue removing entry hazards against Clodsire.</li> <li>Water Absorb is the preferred ability, as it deters Iron Bundle's Hydro Pump and more comfortably tanks Draco Meteor from Miraidon, since Unaware would otherwise ignore the Draco Meteor special attack drop. It also checks Tera Water Miraidon, which is an important trait it possesses over Ting-Lu. Unaware checks non-Life Orb Calm Mind Miraidon while beating Calm Mind + Taunt Flutter Mane, as well as making Iron Moth's Fiery Dance boosts less of a threat.</li> <li>Clodsire can use Tera Steel to take Miraidon's Draco Meteor far more easily while being able to take on Iron Bundle's STAB moves in conjunction with Water Absorb.</li> <li>Both defensive and balanced teams enjoy Clodsire answering most Miraidon sets, helping fend off Flutter Mane, freeing up moveslots on other entry hazard setters, and pressuring opposing defensive Pokemon with Toxic.</li> <li>Dondozo pairs with Clodsire nicely, as it appreciates Clodsire's ability to switch in on Miraidon's Electro Drift, while Dondozo can take on Chien-Pao and Great Tusk for it.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Wooper Person", "user_id": 558813}], "teams": [{"name": "Quality checked by", "members": [{"username": "Manaphy", "user_id": 50695}, {"username": "corvere", "user_id": 306317}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Kingambit": {
    "sets": {
      "Setup Sweeper": {
        "description": "<ul> <li>Kingambit is a very threatening sweeper in Ubers thanks to Supreme Overlord, which grants it a guaranteed presence in the late-game. This is coupled with its access to Swords Dance, which not only enhances its already strong late-game but also gives it a tool to break holes in the opposing team during the early- and mid-game without needing teammates to faint. Kingambit's typing also allows it to be, at the very minimum, a one-time switch-in to very threatening Pokemon to the offensive teams it usually sees play in, like Flutter Mane.</li> <li>Unfortunately, the prevalence of Tera Fairy in the metagame means that Sucker Punch will, most of the time, be resisted. This, coupled with the fast-paced nature of the metagame, makes Kingambit a relatively slow and ineffective revenge killer when unboosted. Koraidon and Zacian-C are top-tier threats that resist Kingambit's Dark-type STAB attacks and can OHKO or heavily dent it. Lastly, Intimidate Landorus-T helps opposing offensive teams pivot into Kingambit more easily, especially if Kingambit is not running Leftovers, as it will not passively heal the damage it takes from foes pivoting out</li> <li>The listed EV spread allows Kingambit to outspeed Skeledirge while maximizing its offensive prowess. The HP EVs help Kingambit tank hits from Pokemon like Flutter Mane and Calm Mind Arceus a little better, giving it a favorable chance to avoid the 2HKO from Judgment and Earth Power from Arceus-Fairy.</li> <li>Low Kick hits Koraidon hard while also allowing Kingambit to hit Pokemon like Tera Steel Giratina-O and Extreme Killer Arceus supereffectively. However, this leaves Kingambit hopelessly walled by Arceus-Fairy.</li> <li>Tera Dark empowers Kingambit's Dark-type STAB attacks to absurd levels, giving it a chance to OHKO Koraidon with 5 fainted allies after a Swords Dance. Tera Dark also removes Kingambit's Ground-type weakness, allowing it to boost itself or hit Pokemon like Landorus-T more comfortably. Tera Flying is another option that makes Kingambit immune to Ground-type attacks, giving it the opportunity to freely set up or hit Pokemon like non-Whirlwind Ting-Lu, Landorus-T, Groudon, and Gliscor, while also giving it a resistance to Koraidon's Fighting-type attacks and a neutrality to its Flare Blitz. Tera Fire gives Kingambit a resistance to both of Zacian-C's STAB types and an immunity to burn from Pokemon like Groudon, Alomomola, and Skeledirge, the last of which can also leverage Tera Fairy to resist Kingambit's Kowtow Cleave.</li> <li>Kingambit fits best on offensive teams, as they can weaken opposing Pokemon to the point where Kingambit sweeping is likely. Teammates like Koraidon, Zacian-C, Miraidon, Flutter Mane, and Arceus can help Kingambit by weakening its checks and breaking holes. Kingambit can revenge kill and potentially sweep through the broken holes in return. Spikes from Pokemon like Groudon and Meowscarada can weaken Zacian-C and Koraidon for Kingambit. Lastly, Pokemon that can switch in on Landorus-T, like Calm Mind Arceus formes, are also good partners, as Kingambit doesn't appreciate taking Rocky Helmet damage.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Great Tusk": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<ul> <li>Tera Ground can turn Headlong Rush into a devastating STAB attack that can break through bulky targets Great Tusk normally wouldn’t, such as Scream Tail and Dondozo.</li> <li>Tera Fighting lets Great Tusk crush Corviknight with Close Combat, which severely hurts defensive structures reliant on it. This opens up powerful teammates like Flutter Mane and Iron Bundle.</li> <li>Earthquake makes Great Tusk harder to revenge kill than Headlong Rush does, as it doesn’t drop its defenses.</li> <li>Rapid Spin works well for teams weak to entry hazards. It's a great way to support powerful threats weak to Stealth Rock, like Chien-Pao, Chi-Yu, and Iron Bundle.</li> <li>Knock Off provides fantastic item-removing support, and it especially cripples walls reliant on Leftovers like Scream Tail and Dondozo, allowing its team to more easily break past them.</li> <li>Play Rough can be used to OHKO Koraidon without Terastallizing, as well as beating opposing Great Tusk. However, it has very little practical use outside of this.</li> <li>Choice Scarf Great Tusk functions most effectively as a wallbreaker in the early- and mid-game, suited best for offensive structures that struggle with physical walls like the aforementioned Scream Tail and Dondozo. When building teams, remember Great Tusk must use Terastallization to actually break through said walls, so it may be hard for teammates to Terastallize.</li> <li>Choice Band Great Tusk only functions well on Sticky Web teams, where the stronger and slower set appreciates Sticky Web dropping foes' Speed.</li> <li>Koraidon is a great partner, setting up sun and activating Protosynthesis for Great Tusk. It further resists Water- and Grass-type moves aimed at Great Tusk, weakening the former. Koraidon also effectively baits in Skeledirge, which Great Tusk reliably threatens.</li> <li>Miraidon is also a great partner, as it can threaten Flying-types, like Corviknight and the rarer Pelipper and Dragonite. This helps to make Great Tusk’s Headlong Rush much more spammable.</li> <li>Gholdengo is also a good partner for Great Tusk, as it resists Ice-, Fairy-, and Grass-type moves aimed at Great Tusk, and it can threaten to KO Ice- and Fairy-types with super effective STAB Make It Rain. In addition, Gholdengo also blocks all hazard removal, helping to wear down walls for Great Tusk's team to eventually break through.</li> </ul>"
      },
      "Offensive Utility": {
        "description": "<ul> <li>Great Tusk is the best offensive Stealth Rock or Rapid Spin user in the tier thanks to its solid typing and good physical bulk.</li> <li>If Great Tusk is paired with Pokemon such as Corviknight, then Stealth Rock can be run instead of Rapid Spin. If paired with teammates that set Stealth Rock, then the best set would be Rapid Spin / Headlong Rush / Close Combat / Knock Off. Knock Off makes progress on Corviknight and covers the Air Balloon Gholdengo matchup.</li> <li>Tera Ground lets Great Tusk deal incredible damage with Headlong Rush while also letting it survive Flutter Mane's Moonblast from full HP. Tera Steel flips the Fairy matchup and lets Great Tusk take on Ice- and Dragon-type attacks, but the additional weaknesses to Fighting and Ground make Great Tusk unable to take on Koraidon, Ting-Lu, and Iron Treads easily.</li> <li>Great Tusk can be used to take on entry hazard setters like Ting-Lu and Iron Treads one-on-one by forcing them out and removing hazards. Jolly is usually preferred to outspeed Gholdengo, Modest Chi-Yu, and Glimmora, but Adamant lets Tera Ground Headlong Rush OHKO Koraidon and specially defensive Annihilape after one layer of Spikes or Stealth Rock.</li> <li>Great Tusk should be used aggressively to force out and keep entry hazards off the field against other setters, such as Ting-Lu and Iron Treads, since Great Tusk is generally difficult to switch into. Great Tusk pairs well with Koraidon thanks to Orichalcum Pulse's sun, letting Great Tusk become an incredibly potent wallbreaker, and Great Tusk can clear entry hazards so that Koraidon can repeatedly come in. Miraidon also appreciates Great Tusk, as it forces out common checks such as Clodsire, Ting-Lu, and Iron Treads. Great Tusk also appreciates Blissey being able to take on all of the special attackers that force Great Tusk out, such as Flutter Mane, Miraidon, and Iron Bundle.</li> </ul>"
      },
      "Setup Sweeper": {
        "description": "<ul> <li>Bulk Up allows Great Tusk to be a threatening sweeper. It can comfortably set up on common physical walls like Ting-Lu, Iron Treads, Corviknight, and defensive Great Tusk.</li> <li>The STAB combination of Headlong Rush and Close Combat hits most physical walls for at least neutral damage. Earthquake may be used as the Ground-type STAB move to avoid defensive drops, but it is a weaker move, and it can't secure important OHKOs and 2HKOs at +1 Attack against some physical walls such as Toxapex, Scream Tail, and Alomomola.</li> <li>A Jolly nature is used to outspeed all viable unboosted Pokemon after one Rapid Spin. An Adamant nature makes Great Tusk stronger while still letting it outspeed unboosted Iron Bundle at +1 Speed, but it misses out on outspeeding maximum Speed Gholdengo and tying Jolly Great Tusk.</li> <li>Terastallizing into the Ground typing boosts Headlong Rush and guarantees some additional OHKOs and 2HKOs on foes like Toxapex and Scream Tail. Additionally, getting rid of the Fighting typing lets Great Tusk survive Fairy-type attacks such as Dazzling Gleam from Miraidon and Moonblast from Flutter Mane without Life Orb or Choice Specs, and it facilitates taking Dazzling Gleam and Play Rough from Scream Tail and Alomomola.</li> <li>Alternatively, using Tera Steel gives Great Tusk resistances to Fairy-type attacks, Ice-type attacks from Chien-Pao and Iron Bundle, and Draco Meteor from Miraidon, allowing it to surprise them with a strong attack.</li> <li>Koraidon is a solid partner because its sun activates Great Tusk's Protosynthesis, making its attacks even stronger. In return, Great Tusk can break through or strongly dent common Koraidon checks like Scream Tail, Alomomola, and Skeledirge, which allows Koraidon to clean more easily. Miraidon is also an excellent teammate, since Great Tusk can easily hard switch into its common checks and either threaten them with its attacks or set up on them.</li> <li>Special attackers like Miraidon, Flutter Mane, and Iron Bundle hugely threaten Great Tusk, so it is recommended to pair it with appropriate special walls like Blissey, Ting-Lu, Iron Treads, and Clodsire. Gothitelle is a less popular pick but it helps eliminate bulky checks like Dondozo and Pelipper, allowing Great Tusk to sweep more easily.</li> </ul>"
      },
      "Defensive": {
        "description": "<ul> <li>Thanks to its solid physical bulk under sun and good defensive typing, Great Tusk acts as one of the best checks to Koraidon while also providing teams with entry hazard removal and a fantastic switch-in to other Ground-types in the tier such as Ting-Lu, Clodsire, and Iron Treads.</li> <li>Play Rough threatens a KO on Koraidon after entry hazard damage. Knock Off can be used to take on Air Balloon Gholdengo and wear down foes that want to switch into Great Tusk such as Corviknight and Annihilape, but it is generally outclassed by the sheer utility of Rapid Spin and Stealth Rock. The combination of Knock Off and Body Press can be used to pressure Corviknight switch-ins.</li> <li>Bulk Up is an option to boost alongside opposing Great Tusk and Swords Dance Kingambit and Koraidon.</li> <li>Great Tusk can Terastallize into the Fairy typing to take on physical attackers such as Koraidon, Chien-Pao, and Palafin in sun. However, be wary of Terastallizing against Koraidon that can still Terastallize themselves, as Choice Band Tera Fire Koraidon can take on Great Tusk one-on-one. Great Tusk can also Terastallize into the Ground typing or the Water typing, with both options removing its weakness to Fairy. The former also lets it fire off stronger Earthquakes as well, while the latter provides useful resistances to Fire moves from Koraidon as well as Ice- and Water-type moves, barring Freeze-Dry, from Iron Bundle.</li> <li>Great Tusk fits on most teams as a bulky Stealth Rock setter and Koraidon check. Great Tusk can utilize Rocky Helmet to punish the use of U-turn, though this hurts its longevity, as it then loses Leftovers's passive recovery.</li> <li>Great Tusk pairs well with defensive Scream Tail and Blissey, both of which can take on Iron Bundle while also providing Wish support for Great Tusk. Blissey can also take on Chi-Yu and Miraidon, while Scream Tail can take on Iron Valiant.</li> <li>Great Tusk also pairs well with Gholdengo, as it appreciates Great Tusk forcing out Koraidon while preventing hazard removal in exchange. Choice Scarf Chi-Yu is a good partner due to its ability to pressure faster special attackers that trouble Great Tusk such as Iron Bundle and Flutter Mane. Great Tusk also pairs well with Miraidon, as non-Heavy-Duty Boots Miraidon appreciates it removing entry hazards and taking on Clodsire, Iron Treads, and Ting-Lu. Finally, Koraidon is a good partner, as it can set up sun, pivot into Great Tusk, and force out most hazard removal options besides opposing defensive Great Tusk.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "OreoSpeedruns", "user_id": 597293}, {"username": "Taka", "user_id": 595062}, {"username": "pichus", "user_id": 374620}], "teams": [{"name": "Quality checked by", "members": [{"username": "ox04", "user_id": 507268}, {"username": "Fc", "user_id": 511624}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "autumn", "user_id": 384270}, {"username": "aurora", "user_id": 109385}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Flutter Mane": {
    "overview": "<p>Flutter Mane carves itself a niche as one of the most threatening wallbreakers in Ubers thanks to its incredibly powerful STAB combination, near-unrivaled Speed that is boosted further under sun, good coverage options, and great defensive typing, allowing it to operate as a solid revenge killer against Pokemon like Extreme Killer Arceus. Its GhostFairy typing allows it to target a variety of threats, particularly the big three Pokemon in the tier—Miraidon, Koraidon, and Necrozma-DM— as well as Pokemon like Ting-Lu and Extreme Killer Arceus. However, Flutter Mane struggles to find opportunities to switch in safely thanks to its mediocre physical bulk and vulnerability to entry hazards. Likewise, some special walls like Ho-Oh and Arceus-Water can take an attack and potentially threaten to status Flutter Mane or flat out KO it.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Psyshock is Flutter Mane's best option against Clodsire and Eternatus. Alternatively, Mystical Fire can be used, being Flutter Mane's best option against Pokemon like Zacian-C and being boosted under sun. Power Gem is extremely valuable coverage, allowing it to OHKO offensive and defensive Ho-Oh after a bit of chip. Tera Fairy boosts Moonblast, allowing Flutter Mane to hit damage thresholds like 2HKOing Calm Mind Kyogre and Ting-Lu after a slight amount of chip while giving it a useful resistance to Dark-type attacks like Chien-Pao and Kingambit's Sucker Punch, although it removes its immunity to Extreme Speed. Tera Stellar is an option, giving Flutter Mane a one-time boost to any of its attacks, allowing it to outright OHKO any Ho-Oh variant while still retaining its valuable immunity to Extreme Speed. However, it is worthless after Flutter Mane uses a move, as that move will then not be boosted for the rest of the game.</p> <p>When using Flutter Mane, Koraidon is a near-obligatory partner; Koraidon sets up sun, which enables Protosynthesis, as well as pivoting Flutter Mane into Pokemon it can beat like Landorus-T, opposing Koraidon, and Necrozma-DM. Other pivots like Miraidon and Landorus-T give Flutter Mane a safe opportunity to come into the field and wallbreak safely. Offensive Pokemon like Extreme Killer Arceus, Deoxys-A, and Kyogre all appreciate Flutter Mane wearing down their checks like Necrozma-DM and Miraidon. Physical attackers like Zacian-C, Groudon, and Ho-Oh make it difficult for Flutter Mane to come in safely and wallbreak; Pokemon that can take on these threats like one's own Ho-Oh, Necrozma-DM, and Arceus-Water all make good partners. Spikes support from Clodsire and Ting-Lu can give Flutter Mane extra support and chip Arceus into the range of Tera Fairy-boosted Moonblast. Flutter Mane has a terrible matchup against Sticky Web teams, as it has terrible bulk and is forced to gain a Special Attack boost from Protosynthesis when affected by Sticky Web, so partners like Extreme Killer Arceus and Calyrex-I can ease the matchup. Flutter Mane covers the Fairy-type teamslot on teams, giving them flexibility with picking an Arceus forme and Tera types.</p>"
      },
      "Life Orb": {
        "description": "<p>This set takes advantage of Flutter Mane's great strength and coverage to become a fearsome wallbreaker. Power Gem lets Flutter Mane destroy Ho-Oh, an otherwise perfect counter to Flutter Mane, but has very little practical use otherwise. Calm Mind lets Flutter Mane reliably break through defensive Arceus formes like Arceus-Ground and Arceus-Fairy for the benefit of teammates like Koraidon and Miraidon. Psyshock hits Clodsire and Eternatus, while Mystical Fire hits Zacian-C, but both have little practical use beyond hitting their intended targets. Tera Fairy is the preferred Tera type with Calm Mind. Tera Stellar is preferred when not running Calm Mind, as Flutter Mane's coverage moves can struggle to OHKO their intended targets. For example, Ho-Oh and Zacian-C can normally survive Power Gem and Mystical Fire, respectively, from full HP. However, with Tera Stellar, Flutter Mane's coverage moves are favored to OHKO these Pokemon. Tera Stellar is also useful for boosting Moonblast's power while keeping Flutter Mane's immunity to Extreme Speed from Extreme Killer Arceus, allowing Flutter Mane to pick it off from higher HP.</p> <p>Choice Scarf Koraidon is Flutter Mane's best friend, as Koraidon provides Flutter Mane with sun and pivot support. Koraidon also appreciates Flutter Mane threatening Koraidon's checks for it, like Landorus-T and Ho-Oh. Another good partner is Miraidon, which can work with Flutter Mane to overwhelm shared checks such as Arceus-Ground and Arceus-Fairy. Spikes support from Gliscor and Ting-Lu are generally good for wallbreakers like Flutter Mane, but Flutter Mane in particular enjoys Spikes weakening its checks, as it's not easy to revenge kill courtesy of its impressive Speed and good defensive typing. Thus, Spikes allows Flutter Mane to continue being threatening even against fast-paced offensive teams, especially as its low bulk makes it somewhat difficult to safely get on the field; it can also be forced out by Pokemon like Zacian-C if not carrying Mystical Fire. Entry hazard control in the form of Giratina-O's Defog is also an option to increase Flutter Mane's longevity, as otherwise Flutter Mane gets worn down very quickly by entry hazards and Life Orb recoil.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}, {"username": "OreoSpeedruns", "user_id": 597293}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}, {"username": "Manaphy", "user_id": 50695}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Iron Treads": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<ul> <li>A decent defensive typing allows Iron Treads to act as a check to Miraidon and Flutter Mane, and use the opportunity to remove or set entry hazards.</li> <li>Knock Off cripples common switch-ins such as Ting-Lu and Corviknight, while Volt Switch keeps momentum for your team.</li> <li>16 IVs in Defense mean that Iron Treads will receive a Special Defense boost in Electric Terrain, helping with switching into Miraidon.</li> <li>Iron Treads can use Tera Fairy to remove its weaknesses to Fighting and Fire, which can be helpful versus Koraidon and Chien-Pao, and with taking coverage from Miraidon and Flutter Mane. However, it loses its immunity to Electric and resistance to Fairy. Iron Treads can alternatively use Tera Ground for an extra boost to Earthquake, but it suffers from similar demerits as Tera Fairy.</li> <li>Since both Miraidon and Flutter Mane have Fire-type coverage options, Iron Treads appreciates being paired with Pokemon such as Ting-Lu that can handle those attacks. Choice Scarf Koraidon and Booster Energy Flutter Mane are also good teammates, as they can revenge kill Miraidon and Flutter Mane while benefitting from Iron Treads removing entry hazards.</li> <li>Skeledirge's ability to check Koraidon and Iron Valiant also makes it a great partner for Iron Treads. Teammates that can switch into Great Tusk such as Dondozo and Alomomola also pair well, with Alomomola even providing Wish support to increase Iron Treads's longevity.</li> </ul>"
      },
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest allows Iron Treads to utilize an offensive spread while still letting it be a fairly safe option against Miraidon and Flutter Mane.</li> <li>Iron Head allows Iron Treads to beat Tera Fairy Miraidon.</li> <li>Knock Off can remove crucial items from foes like Ting-Lu, Great Tusk, and Corviknight.</li> <li>Volt Switch is useful for grabbing momentum on non-Ground-type foes that switch in on Iron Treads like Corviknight, Koraidon, Dondozo, and Pelipper.</li> <li>A Jolly nature gives Iron Treads a Speed boost from Quark Drive, which is often crucial to be able to beat Choice Specs Miraidon one-on-one, and lets it pick off foes that would normally outspeed it without Electric Terrain.</li> <li>Ground is the preferred Tera type to boost the power of Earthquake while weakening incoming Fire- and Fighting-type attacks; alternatively, other Tera types can provide defensive utility but not any offensive boost.</li> <li>This set works best on offensive teams where it is paired up with teammates that are weak to Fairy-type moves, such as Miraidon, Koraidon, Great Tusk, and Chien-Pao. Iron Treads allows these Pokémon to be played more freely because it can reliably deal with Flutter Mane and opposing Miraidon while applying offensive pressure itself.</li> <li>Flutter Mane is another great teammate because Iron Treads lures Corviknight and weakens it with Knock Off or Volt Switch, this gives Flutter Mane an easier time to break through enemy teams.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "SparksBlade", "user_id": 225217}, {"username": "ox04", "user_id": 507268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "Fc", "user_id": 511624}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "Lunaflare", "user_id": 430518}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Iron Bundle": {
    "outdated": true,
    "sets": {
      "Heavy-Duty Boots": {
        "description": "<ul> <li>Freeze-Dry and Hydro Pump make Iron Bundle incredibly threatening with perfect coverage.</li> <li>Taunt can be used to stop recovery and status attempts from walls like Corviknight, while Flip Turn can gain momentum. Encore is effective at PP stalling recovery attempts from Pokemon while also locking Pokemon into suboptimal moves like Stealth Rock to take advantage of.</li> <li>Tera Ice boosts Freeze-Dry's and Ice Beam's power to high levels and also removes the neutrality to Freeze-Dry from opposing Iron Bundle, making a potential mirror match safer.</li> <li>Tera Water Iron Bundle has immense power on Hydro Pump; Tera Water also removes its Fighting-type weakness and Fire-type neutrality, which helps against Choice Scarf Great Tusk and Koraidon trying to revenge kill it.</li> <li>Iron Bundle has to use its high Speed to force out frail Pokemon or force defensive Terastallization, both of which it can take advantage of.</li> <li>Getting Iron Bundle safe switch-ins on defensive Pokemon that are threatened by Hydro Pump is the best way to use its offensive capabilities, allowing for defensive answers to be Taunted or pivoted on to wear down opposing teams.</li> <li>Pelipper and Miraidon are strong teammates for Iron Bundle, providing rain and Electric Terrain support to power it up.</li> <li>Entry hazard setters are also very strong, since Iron Bundle appreciates checks like Corviknight and Annihilape being worn down. It also can use Taunt to stop Defog Corviknight and pressure the premier spinners in Great Tusk and Iron Treads.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>The combination of Hydro Pump and Freeze-Dry gives Iron Bundle an unresisted STAB combination, making it extremely threatening with Choice Specs.</li> <li>Flip Turn allows Iron Bundle to pivot in order to gain momentum, while Ice Beam OHKOes Koraidon and uninvested Miraidon.</li> <li>Tera Ice allows Iron Bundle to further boost its Ice-type moves and resist Freeze-Dry from opposing Iron Bundle and Ditto. Tera Water is a good option on teams with rain support in order to let it 2HKO Heavy-Duty Boots Blissey in rain after slight chip.</li> <li>Choice Specs allows Iron Bundle to 2HKO walls such as Ting-Lu, Corviknight, and Scream Tail with Hydro Pump as well as Toxapex with Freeze-Dry.</li> <li>Miraidon is a great teammate, as it can lure in Pokemon weak to Hydro Pump such as Ting-Lu and Iron Treads and pivot into Iron Bundle using U-turn. It also sets Electric Terrain, giving Iron Bundle a Speed boost upon entry.</li> <li>Entry hazard removal options such as Corviknight, Iron Treads, and defensive Great Tusk are great teammates, as Iron Bundle can get worn down pretty quickly from repeatedly switching into Stealth Rock.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Fc", "user_id": 511624}, {"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "ox04", "user_id": 507268}, {"username": "Lasen", "user_id": 273339}, {"username": "Manaphy", "user_id": 50695}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Baxcalibur": {
    "outdated": true,
    "sets": {
      "Dragon Dance": {
        "description": "<ul> <li>Baxcalibur functions as a niche wallbreaker and occasional sweeper for hyper offense teams. Glaive Rush and Icicle Spear are fantastic STAB moves that hit most of the tier for super effective or neutral damage.</li> <li>Earthquake provides good coverage against common defensive Pokemon such as Toxapex and Skeledirge.</li> <li>Baxcalibur competes heavily with Chien-Pao as an offensive Ice-type, as they fill a similar role on teams. The key difference is Baxcalibur's ability to boost its Speed. Another key difference is Baxcalibur's Dragon typing, which gives it weaknesses to common Dragon- and Fairy-type moves. This stacks weaknesses with Koraidon and Miraidon.</li> <li>Tera Fairy provides Baxcalibur with a Dragon immunity to better deal with Koraidon and Miraidon, as well as a resistance to Fighting-type moves from Pokemon such as Koraidon and Great Tusk. It also ensures Kingambit and Chien-Pao cannot easily revenge kill Baxcalibur with Sucker Punch.</li> <li>Tera Steel grants Baxcalibur important resistances to types like Dragon and Fairy, as well as a Toxic immunity, giving it setup potential against certain walls like Toxapex.</li> <li>Grimmsnarl is a great partner: it provides dual screens support, easing Baxcalibur's setup and entry into the match. Another good partner is Hatterene or another form of hazard control, since denying Stealth Rock assists Baxcalibur in setting up.</li> <li>Miraidon is a recommended teammate, as it can provide both sweeping potential and wallbreaking power and appreciates Baxcalibur breaking down Clodsire and Ting-Lu. Another recommended teammate is Koraidon, since it appreciates Baxcalibur removing walls like Toxapex and Skeledirge.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mashing", "user_id": 537354}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Gholdengo": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li>Choice Scarf Gholdengo outspeeds the entire unboosted metagame, can use Trick to weaken defensive teams, and also blocks Defog and Rapid Spin to keep pressure on defensive Pokemon with entry hazards.</li> <li>Focus Blast deals more damage to Ting-Lu, Chi-Yu, and Iron Treads, while Nasty Plot and Recover can be used after Gholdengo's Choice Scarf has been removed via Trick to turn it into a setup sweeper or give it longevity, respectively.</li> <li>Tera Fighting powers up Focus Blast, which allows Gholdengo to potentially 2HKO Ting-Lu. Alternatively, Gholdengo can use Tera Steel on sets not using Focus Blast to boost Make It Rain and remove its weaknesses to Flutter Mane's and Chien-Pao's STAB moves.</li> <li>Gholdengo should almost always be switched in if Corviknight is on the field and be used sparingly against Great Tusk and Iron Treads if a Rapid Spin is predicted, but this is risky due to its Earthquake weakness.</li> <li>Spikes setters like Ting-Lu and Clodsire on balance teams as well as Froslass on hyper offense teams appreciate Gholdengo keeping up Spikes and it acting as a revenge killer for their respective archetypes.</li> <li>Pokemon like Calm Mind Miraidon, Calm Mind Flutter Mane, and Swords Dance Chien-Pao also benefit from Gholdengo using Trick on defensive Pokemon, forcing them to either heal or be locked into an unfavorable attack while they set up. Gholdengo can also clean up weakened teams if these Pokemon are used to wallbreak first.</li> </ul>"
      },
      "Nasty Plot": {
        "description": "<ul> <li>Nasty Plot + Recover Gholdengo is the best option for preventing entry hazard removal in the tier.</li> <li>Tera Steel bolsters Make It Rain's power, allowing Gholdengo to overwhelm threats such as Koraidon, defensive Great Tusk, Ting-Lu, and bulky Tera Fairy Miraidon after a Nasty Plot boost while removing its Ghost typing.</li> <li>Tera Normal blocks incoming Ghost-type attacks from the likes of Flutter Mane, Choice Scarf Houndstone, and opposing Gholdengo.</li> <li>Air Balloon provides a temporary measure against Ground-type attacks from Pokemon such as Great Tusk and Iron Treads, allowing Gholdengo to sometimes switch into them.</li> <li>Gholdengo best fits on hyper offense and balance teams that aim to preserve their own entry hazards for as long as possible.</li> <li>Frail leads such as Froslass and Masquerain appreciate their entry hazards staying intact against Great Tusk, Iron Treads, Corviknight, and Glimmora.</li> <li>Glimmora and Ting-Lu make for good teammates on balance teams in particular, as they provide similar entry hazard support while having sufficient power and bulk to punish threats.</li> <li>Wallbreakers such as Miraidon, Koraidon, and Chi-Yu appreciate multiple entry hazards to further overwhelm the opposition with their tremendous attacks and power.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Fc", "user_id": 511624}, {"username": "LeBarBURR", "user_id": 473574}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "Aberforth", "user_id": 249382}, {"username": "corvere", "user_id": 306317}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "aurora", "user_id": 109385}]}]}
  },
  "Chien-Pao": {
    "outdated": true,
    "sets": {
      "All-out Attacker": {
        "description": "<ul> <li>Ice Spinner is an alternative to Icicle Crash because of its better accuracy, but it is slightly weaker, cannot flinch, and is a contact move.</li> <li>Ice Shard hits Miraidon and Koraidon for super effective damage, 2HKOing the former, and 2HKOes Flutter Mane reliably. Sucker Punch may be considered over Ice Shard, as it does more damage to Iron Bundle and can KO Flutter Mane, but it misses out on revenge killing Koraidon and is often prediction-reliant.</li> <li>Sacred Sword allows Chien-Pao to OHKO Chi-Yu, Kingambit, and opposing Chien-Pao, which otherwise resist its STAB moves.</li> <li>Chien-Pao can use Tera Dark to make Crunch stronger and 2HKO Corviknight and Toxapex if it gets lucky with a Defense drop. Chien-Pao can also use Tera Ice in order to 2HKO Corviknight more reliably and boost Ice Shard damage—notably against Miraidon, Flutter Mane, and Koraidon. Lastly, Tera Electric Chien-Pao with Tera Blast can easily break through bulky checks like Toxapex, Corviknight, and Dondozo.</li> <li>Chien-Pao fits best with other strong wallbreakers that benefit from the removal of defensive walls. These include Koraidon, Miraidon, Iron Bundle, and offensive Great Tusk.</li> <li>Defensive partners like Ting-Lu, Great Tusk, and Skeledirge are mandatory to handle fast and strong threats like Koraidon and Miraidon, as Chien-Pao cannot OHKO them if they are at  full health. Additionally, Great Tusk and Ting-Lu can set up entry hazards, which is crucial for getting chip on defensive walls.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Icicle Crash 2HKOes Corviknight and avoids Rocky Helmet, while Ice Spinner is more accurate and has the bonus of removing Electric Terrain.</li> <li>Sacred Sword hits checks such as Kingambit and opposing Chien-Pao. Another option is to run a double priority combination with Ice Shard and Sucker Punch. Sucker Punch hits very crucial Pokemon that Ice Shard can't, such as Tera Fire Koraidon, Tera Fire Flutter Mane, and Iron Bundle.</li> <li>An Adamant nature allows Chien-Pao to achieve ridiculous feats such as revenge killing Flutter Mane from 90% HP with Ice Shard. A Jolly nature lets Chien-Pao Speed tie with Koraidon, Miraidon, opposing Jolly Chien-Pao, and Flutter Mane, giving Chien-Pao the freedom to click its strongest moves less reluctantly.</li> <li>Tera Dark allows Chien-Pao to 2HKO the entire tier while letting it still switch into weaker moves such as Shadow Ball. Tera Ice gives Chien-Pao the ability to OHKO Flutter Mane with Ice Shard, making it a terrific late-game cleaner.</li> <li>Choice Band Chien-Pao is a wallbreaker that is best suited for bulky offense structures that love its revenge killing and wallbreaking capabilities.</li> <li>Pokemon like Iron Treads, Hatterene, and Koraidon, which can provide entry hazard control or pivoting, are excellent teammates for Chien-Pao.</li> </ul>"
      },
      "Swords Dance": {
        "description": "<ul> <li>Swords Dance makes Chien-Pao immensely threatening, letting it break through bulky foes such as Toxapex, Great Tusk, and Corviknight.</li> <li>Ice Spinner is a more reliable option thanks to its perfect accuracy, but Icicle Crash's power and flinch chance greatly help out against all foes that can take a hit from Chien-Pao, such as Corviknight and Great Tusk.</li> <li>Ice Shard is a reliable priority attack mainly used to better deal with Miraidon and Koraidon.</li> <li>Sucker Punch can be used as a stronger but prediction-reliant alternative that OHKOes Flutter Mane without a boost and OHKOes the likes of Iron Bundle and Miraidon after a boost. It also provides a favorable roll to OHKO Koraidon if it has Terastallized into the Fire typing.</li> <li>Tera Dark boosts Crunch, allowing Chien-Pao to more reliably beat physically defensive Corviknight and Toxapex. Tera Dark Chien-Pao holding Life Orb can OHKO both Pokemon after a Swords Dance boost.</li> <li>Tera Ice can be used instead to boost Chien Pao's Ice-type attacks. This also makes Ice Shard a better revenge killing option.</li> <li>Sacred Sword can be used to hit foes that resist Chien-Pao's STAB moves, like Kingambit and opposing Chien-Pao.</li> <li>Life Orb is the primary item choice because it gives Chien-Pao a lot of power while allowing it to run a Jolly nature and not lose out on potential OHKOs.</li> <li>Heavy-Duty Boots sacrifices a lot of power but gives Chien-Pao the ability to ignore entry hazards, allowing it to come in and potentially set up multiple times throughout a game.</li> <li>Black Glasses in conjunction with an Adamant nature can be used as an alternative to Life Orb to not have recoil while still being able to OHKO the likes of Corviknight and Toxapex after obtaining a Swords Dance boost and using Tera Dark.</li> <li>This set can be used as both an early-game wallbreaker and a late-game sweeper thanks to Chien-Pao's strong STAB attacks and priority moves.</li> <li>Chien-Pao has very little defensive utility, so having a defensive core for it to fall back on is recommended for balance teams. On offensive teams, it can afford to run Focus Sash to take at least one hit from foes that would usually threaten it out.</li> <li>Great Tusk is Chien-Pao's best teammate, as Great Tusk can handle one of Chien-Pao's hardest checks in Koraidon and provide Rapid Spin support. Rapid Spin also helps keep Focus Sash intact.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}, {"username": "pichus", "user_id": 374620}, {"username": "ox04", "user_id": 507268}], "teams": [{"name": "Quality checked by", "members": [{"username": "ox04", "user_id": 507268}, {"username": "Lasen", "user_id": 273339}, {"username": "corvere", "user_id": 306317}, {"username": "Manaphy", "user_id": 50695}, {"username": "Fc", "user_id": 511624}]}, {"name": "Grammar checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "deetah", "user_id": 297659}, {"username": "aurora", "user_id": 109385}]}]}
  },
  "Ting-Lu": {
    "overview": "<p>Ting-Lu's titanic bulk makes it the premier special wall and check to Miraidon in Ubers. Unlike Arceus-Ground and Clodsire, Ting-Lu is able to take on Miraidon and generate momentum in the process thanks to Vessel of Ruin and a fantastic support movepool featuring Spikes, Ruination, and Whirlwind. Other special threats such as Calm Mind Arceus-Ground and offensive Eternatus are hurt in viability by Ting-Lu's presence alone. Ting-Lu's physical bulk should not be underestimated either, as it can take on threats like Dragon Dance Necrozma-DM and Zekrom when needed. These incredible defenses come at the cost of lacking any form of reliable recovery, making Ting-Lu extremely vulnerable to entry hazard damage, Knock Off, and status. As such, some teams may prefer either Clodsire due to its superior role compression in checking Kyogre, absorbing Toxic Spikes, and ability to run Heavy-Duty Boots or Arceus-Ground for its better offensive presence and reliable recovery. Effective use of Ting-Lu requires careful management of its HP so that it fulfills its role of setting entry hazards early-game and staying healthy enough to check threats late-game.</p>",
    "comments": "<h1>Other Options</h1> <p>Heavy-Duty Boots may be run over Leftovers, as it better preserves Ting-Lu's longevity should Spikes be set on its side of the field. However, Leftovers is usually preferred, as Ting-Lu itself likes to tank some hits early-game to set its own Spikes, and Heavy-Duty Boots removes Ting-Lu's only form of healing. Taunt is an option to harass opposing Ting-Lu and prevent setup from incoming Pokemon such as Gliscor, but Whirlwind can achieve similar results and offers more utility for checking threats.</p> <h1>Checks and Counters</h1> <p><strong>Gliscor</strong>: Gliscor is the most notable threat to Ting-Lu, as it can heal off any Ruination damage with Poison Heal and use it as an easy chance to set entry hazards or use Toxic.</p> <p><strong>Chip Damage</strong>: Ting-Lu is completely vulnerable to all forms of entry hazard and status effect chip damage, which can rack up quickly thanks to its lack of recovery.</p> <p><strong>Knock Off</strong>: Knock Off from Necrozma-DM and Gliscor removes Ting-Lu's only form of recovery, devastating Ting-Lu's longevity.</p> <p><strong>Physical Attackers</strong>: Despite Ting-Lu's massive physical bulk, it is vulnerable to super effective coverage from strong physical attackers like Koraidon, Zacian-C, Calyrex-I, Kyurem-B, and Chien-Pao. Also, Ho-Oh is immune to Earthquake and can heal off Ruination damage with Regenerator while being able to cripple Ting-Lu with a burn from Sacred Fire. These threats may come in on Ting-Lu easily with support from U-turn Miraidon.</p> <p><strong>Kyogre</strong>: Kyogre is one of the few special attackers that is not bothered by Ting-Lu thanks to its rain-boosted STAB Water-type attacks, although it hates directly switching in.</p> <p><strong>Taunt</strong>: Taunt prevents Ting-Lu from using Spikes and Whirlwind, so Taunt users like Arceus-Ground and Landorus-T can prove severely annoying.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Whirlwind prevents opposing setup threats such as Double Dance Miraidon and Calm Mind Arceus-Ground from snowballing out of control. This can also rack up entry hazard damage and is a decent way to maintain momentum against an incoming Gliscor. Protect can also be used in this moveslot, which allows for more Leftovers recovery and scouting of Choice item users and Tera types. Stealth Rock may be chosen in the fourth slot to save moveslots for Ting-Lu's teammates, but it makes Ting-Lu less reliable at checking threats in general. Ting-Lu will very rarely need to Terastallize, as its natural typing provides a strong Electric immunity against Miraidon. Tera Steel provides a Fairy and Dragon resistance, which can be critical for handling Calm Mind + Tera Fairy or Tera Dragon Miraidon sets. It has the additional benefit of an immunity to Toxic from Gliscor and Eternatus. Tera Fairy provides a Dragon immunity against Miraidon, allowing Ting-Lu to better answer Tera Dragon sets holding either Calm Mind or Choice Specs while making Ting-Lu resistant or immune to Koraidon's STAB moves. However, this comes at the expense of not resisting Fairy versus Tera Fairy Miraidon. Tera Poison is useful against Koraidon, Zacian-C, and Tera Fairy Miraidon, and it allows Ting-Lu to absorb Toxic Spikes. Tera Water allows Ting-Lu to take Kyogre's STAB moves while also resisting Koraidon's Flare Blitz and Necrozma-DM's Sunsteel Strike. It also lets Ting-Lu check the rare, but otherwise hard to check, Chi-Yu and Walking Wake.</p> <p>Ting-Lu struggles against physical threats such as Koraidon, Zacian-C, and Arceus, so it is best paired with Pokemon that can switch into them reliably such as defensive Necrozma-DM, Arceus-Fairy, Gliscor, Arceus-Water, Skeledirge, and Landorus-T. Gliscor deserves special mention, as it can allow Ting-Lu to run Stealth Rock or alternatively allow Gliscor itself to run Toxic Spikes, forming an impressive hazard-stacking core. Necrozma-DM is also notable for having Knock Off, which makes Ting-Lu's Spikes even more deadly. Fairy-types like Arceus-Fairy, Zacian-C, and Flutter Mane are useful for their Dragon immunity, which forces Miraidon to predict between its Dragon- and Electric-type coverage, potentially allowing Ting-Lu to switch in for free. Eternatus and Arceus-Grass are valuable teammates for their ability to take on Kyogre, with Eternatus notably absorbing Toxic Spikes, which severely threaten Ting-Lu. Giratina-O is a great partner that can check Arceus-Ground and Extreme Killer Arceus while providing Defog support, which massively increases Ting-Lu's longevity. Revenge killers like Choice Scarf Koraidon and Miraidon greatly appreciate chip damage from Ting-Lu's Ruination and Spikes for cleaning up weakened teams, and they may take on Miraidon should Ting-Lu not be healthy enough to do so.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Aberforth", "user_id": 249382}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Chi-Yu": {
    "outdated": true,
    "sets": {
      "Feesh (Offensive Wallbreaker)": {
        "description": "<ul> <li>Overheat hits extremely hard and can 2HKO even the bulkiest of Pokemon. Fire Blast and Flamethrower can be used to KO foes without Chi-Yu suffering a Special Attack drop, with Flamethrower having perfect accuracy.</li> <li>The only reason to run Timid over Modest is to outspeed Jolly Great Tusk, Jolly Annihilape, and fast Iron Treads with Special Defense investment.</li> <li>Tera Fire allows Chi-Yu to turn 2HKOs to OHKOs, for example OHKOing opposing Chi-Yu with Overheat. Tera Fire also lets it 2HKO any prominent special wall, including Toxapex, Blissey, and Ting-Lu, OHKOing them with sun.</li> <li>Choice Specs Chi-Yu is a wallbreaker, suited best for offensive teams. Koraidon is an excellent teammate because it sets sun and pivots Chi-Yu in with U-turn. Koraidon and Chi-Yu also threaten each other's checks, like Koraidon threatening Blissey and Garganacl and Chi-Yu threatening Skeledirge and Dondozo.</li> <li>Helpful teammates are those that can get Chi-Yu in safely and force out its few checks. Corviknight and Koraidon are noteworthy examples, pivoting into special walls such as Ting-Lu. Lures such as Heavy Slam Koraidon and Great Tusk, which beat Dachsbun, and Psyshock Flutter Mane, which beats Toxapex and Blissey, are also appreciated teammates.</li> </ul>"
      },
      "Choice Scarf": {
        "description": "<ul> <li>Fire Blast is Chi-Yu's strongest STAB move without any stat drops. Psychic is an alternative that 2HKOes common switch-ins such as Dachsbun and Toxapex. Overheat facilitates revenge killing, hitting even Pokemon that resist it such as Koraidon hard, and is a better midground play.</li> <li>Memento serves as a way to facilitate sweepers like Swords Dance + Flame Charge Koraidon that Chi-Yu is usually paired with.</li> <li>Tera Fire powers up Flamethrower and Overheat to nuclear levels, turning 2HKOs against Pokemon such as Koraidon into OHKOs. Tera Dark nullifies Chi-Yu's Stealth Rock weakness while making Dark Pulse 2HKO Dachsbun and Toxapex. Tera Grass should only be used with Tera Blast; it gives Chi-Yu nice resistances to Ground and Water and allows Chi-Yu to OHKO Great Tusk and 2HKO Ting-Lu after Spikes damage.</li> <li>Choice Scarf Chi-Yu is a revenge killer best suited for offensive teams.</li> <li>Pokemon that can get Chi-Yu safely into the field, such as Koraidon, Miraidon, and Corviknight, are excellent teammates for it. Koraidon also sets up sun, further boosting Chi-Yu's Fire-type attacks.</li> <li>Ting-Lu and Glimmora can set entry hazards to guarantee some 2HKOs, such as against opposing Ting-Lu.</li> </ul>"
      },
      "Nasty Plot": {
        "description": "<ul> <li>Nasty Plot Chi-Yu can threaten to KO foes it couldn't otherwise, such as Ting-Lu and Blissey. Overheat hits extremely hard and threatens to OHKO Ting-Lu at +2. Flamethrower is valuable for its perfect accuracy.</li> <li>A Modest nature alongside Life Orb lets Chi-Yu OHKO Ting-Lu at +2. Heavy-Duty Boots can be used instead to give Chi-Yu more opportunities to switch in, but the loss of power is notable.</li> <li>Chi-Yu fits best on offensive teams with Pokemon such as Cyclizar and Grimmsnarl that can facilitate its setup. Sticky Web support from Masquerain is also useful, as it lets Chi-Yu outrun Pokemon like Koraidon and Miraidon and KO them at +2.</li> <li>Chi-Yu's best partner is Koraidon, since it sets up sun, can safely bring Chi-Yu into play with U-turn, and threatens Blissey. Other good partners are special attackers that benefit from special walls being neutered by Chi-Yu, such as Miraidon, Flutter Mane, and Gholdengo. Great Tusk is also greatly appreciated, as it can remove Stealth Rock and threatens Blissey and Ting-Lu for Chi-Yu. Chi-Yu can deal with Corviknight and Dondozo in return.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mashing", "user_id": 537354}, {"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "Manaphy", "user_id": 50695}, {"username": "Fc", "user_id": 511624}, {"username": "Eledyr", "user_id": 415367}]}, {"name": "Grammar checked by", "members": [{"username": "Lunaflare", "user_id": 430518}, {"username": "Adeleine", "user_id": 517429}, {"username": "Lumii", "user_id": 493772}, {"username": "UT", "user_id": 523866}, {"username": "aurora", "user_id": 109385}]}]}
  },
  "Roaring Moon": {
    "outdated": true,
    "sets": {
      "Dragon Dance": {
        "description": "<ul> <li>With Dragon Dance and Acrobatics, Roaring Moon is a strong sweeper on offensive teams, with coverage to beat almost all Pokemon.</li> <li>Tera Flying allows Roaring Moon to set up on Great Tusk and Body Press Corviknight and boosts Acrobatics's power to achieve feats such as OHKOing Toxapex and Ting-Lu after two Dragon Dances and entry hazard or slight chip damage.</li> <li>Crunch is more reliable, having a chance to drop Defense with no potential drawback, while Jaw Lock has the potential to give Roaring Moon a free chance to set up when paired with Roost, assuming a favorable target is trapped. If an unfavorable target is trapped, however, it has a major downside, making it less consistent.</li> <li>Roost gives Roaring Moon more opportunities to use Dragon Dance, turning weaker Pokemon like Brave Bird Corviknight and Whirpool Alomomola into setup fodder.</li> <li>Earthquake hits Kingambit, Garganacl, and Iron Treads, which can otherwise survive hits and wear down Roaring Moon.</li> <li>Taunt stops defensive Pokemon like Haze Toxapex, Will-O-Wisp Skeledirge, and Whirlwind Ting-Lu from dealing with Roaring Moon, making it devastating against bulkier teams if positioned right.</li> <li>Hyper offense leads such as Glimmora, Froslass, and Grimmsnarl all give Roaring Moon good support to break through a team more easily.</li> <li>Choice Scarf Great Tusk, Tera Fire Koraidon, and Tera Fairy Miraidon can all be used to bait Chien-Pao and take it out, helping Roaring Moon greatly, as it is one of the most reliable revenge killers that can be used against it.</li> <li>On bulkier teams, Roaring Moon requires teammates that can switch into Ice-type moves from Chien-Pao and Iron Bundle, making Toxapex and specially defensive Corviknight great partners. The latter can also pivot with U-turn, giving Roaring Moon more chances to set up on defensive Pokemon.</li> </ul>"
      },
      "Full Moon (Choice Band)": {
        "description": "<ul> <li>Earthquake lets Roaring Moon break past Pokemon that would otherwise check it, like Garganacl, Toxapex, and especially Kingambit.</li> <li>Iron Head lets Roaring Moon hit Fairy-types like Iron Valiant and Tera Fairy Garganacl and Skeledirge super effectively.</li> <li>U-turn lets Roaring Moon generate offensive momentum for its team and is especially useful against targets Roaring Moon scares out, like Skeledirge without Tera Fairy and Gholdengo.</li> <li>The given EVs and a Jolly nature ensure Roaring Moon's Speed is boosted in sunlight, letting it get the jump on crucial threats like unboosted non-Choice Scarf Koraidon and Miraidon and threaten them with its STAB Dragon Claw. The remaining 36 Special Defense EVs improve Roaring Moon's chances to survive Iron Bundle's Ice Beam after Stealth Rock while giving it a chance to survive Overheat in sun from Modest Choice Specs Chi-Yu.</li> <li>Tera Dark strengthens Roaring Moon's Crunch to the point where it always 2HKOs physically defensive Corviknight and always 3HKOs Dondozo while easing predictions with Earthquake against Garganacl.</li> <li>Tera Steel lets Roaring Moon resist otherwise super effective Ice-, Fairy-, and Dragon-type attacks from the likes of Iron Bundle, Flutter Mane, Koraidon, and Miraidon. Tera Steel also powers up Roaring Moon's Iron Head.</li> <li>Tera Fairy allows Roaring Moon to resist Fighting-type attacks while becoming immune to Dragon-type attacks, letting it defeat Koraidon and Iron Valiant, both of which outspeed and threaten to OHKO Roaring Moon otherwise.</li> <li>Roaring Moon loves the support of Koraidon, as it activates Roaring Moon's Protosynthesis via Orichalcum Pulse and reliably threatens Pokemon such as Koraidon, Miraidon, and Ice-types like Chien-Pao and Iron Bundle. In return, Roaring Moon threatens non-Terastallized Skeledirge.</li> <li>Koraidon and Roaring Moon both struggle with defensive Great Tusk, so they can team up with Iron Bundle and Chien-Pao, which threaten all Great Tusk sets. Iron Bundle and Chien-Pao also threaten Koraidon and Miraidon, with Iron Bundle naturally outspeeding non-Choice Scarf variants and Chien-Pao threatening them with priority Ice Shard.</li> <li>Defensive Great Tusk and Ting-Lu also work well with Roaring Moon, as they can set up entry hazards for Roaring Moon's team and check Koraidon and Miraidon, respectively. Great Tusk in particular can use Rapid Spin, giving Roaring Moon more opportunities to switch in, while Ting-Lu can phaze threatening boosters like Espathra with Whirlwind and set up Spikes.</li> <li>Specially defensive Corviknight can check Flutter Mane and Iron Bundle, both of which outspeed and threaten Roaring Moon, and can Defog hazards away, giving Roaring Moon more opportunities to switch in.</li> <li>Roaring Moon can easily pivot into Chi-Yu, which takes advantage of the sun set by Koraidon and threatens walls like Great Tusk, Corviknight, Ting-Lu, and Terastallized Skeledirge.</li> <li>Gholdengo also makes for a decent partner, as not only does it have perfect defensive synergy with Roaring Moon, but it can also reliably block all common forms of hazard removal. This allows Roaring Moon’s team to keep up hazards, in particular Spikes, for it to eventually break down walls.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Fc", "user_id": 511624}, {"username": "OreoSpeedruns", "user_id": 597293}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "Aberforth", "user_id": 249382}, {"username": "ox04", "user_id": 507268}]}, {"name": "Grammar checked by", "members": [{"username": "Lunaflare", "user_id": 430518}, {"username": "autumn", "user_id": 384270}, {"username": "aurora", "user_id": 109385}]}]}
  },
  "Koraidon": {
    "overview": "<p>Koraidon is arguably the most impactful Pokemon in Ubers and is used on the majority of teams. Extremely high Speed and Attack boosted by Orichalcum Pulse and the high Base Power of its moves make Koraidon a nightmare to switch into. Scale Shot combined with Loaded Dice gives Koraidon the tools to break past would-be checks such as Ho-Oh without much trouble, leaving very few reliable checks to it; in fact, Koraidon's incredible breaking power makes dedicated checks such as Arceus-Fairy viable by its sheer presence alone. Despite Scale Shot Koraidon's attention-grabbing power, Koraidon's most used set is in fact Choice Scarf, which provides massive amounts of utility. It's able to revenge kill nearly the entire tier, clean up weakened teams with ease, provide momentum with U-turn, and serve as a pseudo-check to powerful wallbreakers like Extreme Killer Arceus, Kyogre, and Dragon Dance Necrozma-DM. Koraidon is somewhat held back by its reliance on moves like Flare Blitz, which has a lot of recoil, and Scale Shot, which can fail to achieve certain KOs should it miss or not get the right amount of hits. Furthermore, despite the lack of proper checks to Koraidon, it is often pivoted into by Pokemon such as Zacian-C, Flutter Mane, Kyogre, and Landorus-T, which can either absorb a Dragon-type move and KO back or cripple Koraidon through Drizzle or Intimidate. As such, Koraidon requires proper prediction to realize its full potential.</p>",
    "comments": "<h1>Other Options</h1> <p>Tera Steel is possible on Choice Scarf sets, as it helps against Extreme Killer Arceus while also providing a useful Dragon-type resistance for opposing Koraidon and Miraidon. Flame Charge may be run on Scale Shot sets. In particular, Flame Charge helps against Zacian-C and Flutter Mane that may try to switch in on Scale Shot, which eases prediction greatly. However, this comes at the cost of the sheer power of Flare Blitz, and this forces Koraidon to Terastallize more often to raise Flame Charge's Base Power. Taunt also has potential on Scale Shot sets, as it prevents moves like Ho-Oh's Whirlwind and Gliscor's Toxic, but Low Kick and Substitute generally have more utility. Choice Band gives Koraidon absurd breaking power from the get-go; however, Choice Band's move limitation greatly hinders Koraidon's sweeping ability, not to mention that Scale Shot Koraidon already packs enough power. Temper Flare is generally outclassed by Flare Blitz.</p> <h1>Checks and Counters</h1> <p><strong>Arceus-Fairy</strong>: Arceus-Fairy is the most common check to Koraidon, as it absorbs Scale Shot and Low Kick with ease and can tank unboosted Flare Blitz. Koraidon can use Tera Fire to take Judgment, and a +2 or Tera Fire Flare Blitz is severely threatening to Arceus-Fairy, but Arceus-Fairy can use Tera Water and paralyze Koraidon back, crippling it for the rest of the game.</p> <p><strong>Fairy-types and Tera Fairy</strong>: Zacian-C and Flutter Mane can take anything but Flare Blitz and force Koraidon out with their super effective coverage and higher Speed. Fairy is also an extremely common Tera type and is prominent on many physical walls, as well as on some special walls like Eternatus and Ting-Lu.</p> <p><strong>Skeledirge</strong>: Thanks to Unaware, Skeledirge can shrug off anything that Koraidon throws at it outside of Scale Shot. Koraidon needs at least a high damage roll four-hit Scale Shot followed by a five-hit Scale Shot to guarantee the 2HKO on Skeledirge, meaning that Skeledirge can wall Koraidon even when switching in on Scale Shot provided Koraidon doesn't get the required luck. Should Koraidon use any other move when Skeledirge switches in, Skeledirge will have no problem walling Koraidon. If Skeledirge is in danger of being KOed, it can always use Tera Fairy to stop Koraidon in its tracks.</p> <p><strong>Kyogre</strong>: Kyogre dislikes switching in on any moves outside of Flare Blitz, but Kyogre's Drizzle negates Orichalcum Pulse and lowers Flare Blitz's power. This makes Kyogre a decent pivot into Koraidon, especially in combination with other checks.</p> <p><strong>Physically Defensive Pokemon</strong>: Arceus-Water has high Defense and is one of the few Pokemon capable of taking two five-hit Scale Shots in a row. It also resists Flare Blitz and can burn or paralyze Koraidon. However, Arceus-Water cannot reliably check +2 Koraidon, especially if entry hazards are on the field, as a +2 Low Kick has an 81.3% chance to OHKO after one layer of Spikes damage. Landorus-T cannot wall Koraidon by itself, but it can be used as a useful pivot into it, lowering its Attack with Intimidate and providing chip damage with Rocky Helmet. Groudon has enough raw physical bulk to tank anything Koraidon can throw at it, but Groudon is limited by its lack of reliable recovery. Ho-Oh can phaze Koraidon with Whirlwind or smack it with Brave Bird, but it risks being KOed by Outrage or a boosted five-hit Scale Shot. Necrozma-DM does not like taking Flare Blitz at all, but it can be used in a pinch to check unboosted Koraidon or to make Koraidon use Flare Blitz more often and suffer recoil damage as a result. Gliscor can use Choice Scarf Koraidon as an easy opportunity to set entry hazards.</p> <p><strong>Chip Damage</strong>: Koraidon is vulnerable to all forms of entry hazards and status, in addition to commonly taking Flare Blitz recoil and Rocky Helmet damage. Due to this, Koraidon can be chipped over the course of a game quite quickly.</p> <p><strong>Priority</strong>: Scale Shot drops Koraidon's Defense, making priority options a common way to revenge kill it. Extreme Speed from Arceus can easily take down a weakened Koraidon, although Arceus needs to watch out for Tera Ghost or Steel. Chien-Pao's Ice Shard is a good way to take out Koraidon that have not Fire-type Terastallized into the Fire typing. Sucker Punch from Chien-Pao and Kingambit may take out a Terastallized Koraidon.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Thanks to how heavy Ubers is as a whole, Low Kick is chosen for its high Base Power without any drawbacks. Close Combat has consistent power, which may come in handy against weakened or Terastallized Ho-Oh and Gliscor, although one must be careful of its Defense drops. Outrage, while sometimes risky, does perform some notable feats such as 2HKOing defensive Ho-Oh; Dragon Claw may be run instead, as it is risk-free. Flare Blitz has massive power when under the sun, and it becomes even more powerful when boosted by Tera Fire, OHKOing defensive Necrozma-DM 50% of the time. Tera Ghost is useful for the Normal and Fighting immunities that it provides, helping Koraidon take on Extreme Killer Arceus and opposing Koraidon.</p> <p>Choice Scarf Koraidon is an extremely common sight on nearly any team type outside of hyper offense. All of them appreciate Koraidon's ability to check Extreme Killer Arceus and provide sun to weaken Kyogre. As Koraidon tends to attract physically defensive switch-ins, it can use U-turn to bring in powerful special wallbreakers that may otherwise have a hard time switching in, such as Miraidon, Kyogre, Flutter Mane, and even Walking Wake and Chi-Yu. Koraidon must be wary of its HP, as it can easily be worn down through entry hazard damage, Flare Blitz recoil, and Rocky Helmet chip. Due to this, Koraidon works well with most mainstay defensive Pokemon in Ubers, like Necrozma-DM, Ting-Lu, Ho-Oh, Gliscor, Arceus-Fairy, Arceus-Ground, and Arceus-Water, as they let Koraidon save itself for when it's needed to revenge kill or clean weakened teams. Additional checks to Kyogre are especially appreciated, as Koraidon can easily be 2HKOed by Kyogre's Ice Beam; Miraidon, Eternatus, Clodsire, Calm Mind Arceus-Water, and Thunder Kyogre are good options for this.</p>"
      },
      "Scale Shot": {
        "description": "<p>With its incredible power, speed, ease of setup, and lack of reliable checks, Scale Shot Koraidon is the most influential and dangerous sweeper in the entire metagame. In conjunction with Loaded Dice, Scale Shot is a powerful attack that allows Koraidon to threaten the many Dragon-types in Ubers, such as Koraidon, Miraidon, Eternatus, and Giratina-O. It is a bit luck-dependent, however, as it sometimes needs to hit a certain number of times to achieve certain KOs. For example, after a Swords Dance boost, Scale Shot must hit five times to OHKO defensive Ho-Oh. In addition to the staples of Scale Shot, Flare Blitz, and Swords Dance, this set has a lot of versatility when it comes to its last move and Tera type. Low Kick dispatches Extreme Killer Arceus trying to revenge kill it with Extreme Speed, as Koraidon is bulky enough to survive Extreme Speed after a Scale Shot. Opposing Koraidon, Miraidon, Zacian-C, Kyogre, and Necrozma-DM also fall to Low Kick after a Swords Dance, meaning Koraidon does not have to risk missing Scale Shot or taking recoil damage from Flare Blitz, especially against Zacian-C, which commonly tries to switch into Koraidon to absorb Scale Shot. Substitute scouts for any potential Terastallizations attempting to slow Koraidon down, most notably Tera Fairy on several Pokemon like Miraidon and defensive Arceus formes such as Arceus-Ground and Arceus-Water. In conjunction with Tera Ghost, Substitute is also useful for turning Pokemon like Arceus-Water, Gliscor lacking Earthquake, and Skeledirge into setup fodder. Tera Ghost gives Koraidon an immunity to Low Kick from opposing Koraidon and, more importantly, Extreme Speed from Extreme Killer Arceus, letting it use these Pokemon as setup fodder, especially if running Substitute. Tera Fire, on the other hand, gives Koraidon a Fairy resistance, immunity to Will-O-Wisp and Sacred Fire burns from Ho-Oh, and STAB on Flare Blitz, letting it turn the tables on Zacian-C and Arceus-Fairy, which are good checks to unboosted Koraidon.</p> <p>Scale Shot Koraidon is best used on hyper offense teams that can easily overwhelm its checks, but it can also be used as a ferocious sweeper on bulky teams. It loves pairing with Miraidon, as Miraidon can pivot to Koraidon for it to set up on Miraidon's common checks in Ting-Lu and Clodsire. Double Dance Miraidon also pairs extremely well with Scale Shot Koraidon on hyper offense. Zacian-C is also a superb Koraidon partner, as the two can overwhelm their shared checks, such as Ho-Oh, Landorus-T, and defensive Arceus formes like Arceus-Ground and Arceus-Water. Dragon Dance Necrozma-DM can switch into Arceus-Fairy and lure and heavily damage Skeledirge with a boosted Photon Geyser, making it a solid partner. Entry hazard support in the form of leads like Deoxys-S and Glimmora and bulkier hazard stackers like Gliscor is greatly appreciated, as Arceus-Fairy, Koraidon's best check, takes enormous damage from a Swords Dance-boosted Flare Blitz and is cleanly OHKOed after Stealth Rock and a single layer of Spikes.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Manaphy", "user_id": 50695}, {"username": "OreoSpeedruns", "user_id": 597293}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Aberforth", "user_id": 249382}, {"username": "Manaphy", "user_id": 50695}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Miraidon": {
    "overview": "<p>Miraidon's absurd Speed tier, Hadron Engine-boosted power, and strong STAB combination make it a devastating wallbreaker that forces most teams to use both a Ground-type and a Dragon resistance in order to pivot around it. Furthermore, Miraidon's access to Calm Mind, Taunt, Agility, and boosting items makes it incredibly versatile and difficult to play around. However, Miraidon can have a hard time coming onto the field thanks to its Dragon- and Ground-type weaknesses and low physical bulk. Furthermore, Choice Scarf Koraidon, Zacian-C, and Extreme Killer Arceus being prevalent means that Miraidon cannot stay on the field too long. Nonetheless, Miraidon's great Speed tier, utility in Taunt and U-turn, and raw power make it a staple on many teams, and no team is complete without multiple forms of counterplay to it.</p>",
    "comments": "<h1>Other Options</h1> <p>An alternative Double Dance set can be run with Solar Beam over Calm Mind and Tera Grass. When paired with a Life Orb, Tera Grass-boosted Solar Beam can OHKO Ting-Lu and specially defensive Arceus-Ground. However, this set relies on Koraidon's sun being up to work and is more Tera-reliant than Miraidon's standard Double Dance set. Tera Blast Ice is another option on both Double Dance and Calm Mind sets to give Miraidon BoltBeam coverage, but this option also comes with the weaknesses of the Ice typing, a reliance on Terastallization, and a lack of power compared to standard Tera Dragon sets. Tera Fairy is an option on non-Double Dance sets that lets you flip the matchup into Koraidon and opposing Miraidon. However, this comes at the risk of being revenge killed by Zacian-C and threatened by Sunsteel Strike from Necrozma-DM. An alternate EV spread of 208 HP / 252 SpA / 48 Spe is an option on Double Dance sets that lets you outspeed Rayquaza and Kyurem without using Agility.</p> <h1>Checks and Counters</h1> <p><strong>Ting-Lu</strong>: Ting-Lu is capable of taking any unboosted attack from Miraidon and can either threaten it out with its powerful Earthquake or use Miraidon's presence as a chance to set up entry hazards. It can also Terastallize into a type that resists Draco Meteor such as Tera Steel or Fairy. However, Ting-Lu's lack of recovery means that it can only pivot into Miraidon a limited amount of times and must be wary of a +1 Tera Dragon Life Orb Draco Meteor, +1 Tera Fairy Life Orb Dazzling Gleam, or a +1 Life Orb Solar Beam, as these threaten to OHKO Ting-Lu after one layer of Spikes.</p> <p><strong>Ground-types</strong>: Bulky Arceus-Ground, Clodsire, specially defensive Gliscor, and Iron Treads can pivot into Miraidon's Electro Drift and take at least one unboosted Draco Meteor. They can also Terastallize into a type that resists Draco Meteor such as Tera Steel or Fairy. Arceus-Ground and Clodsire additionally have access to recovery moves that let them check Miraidon long-term, unlike Ting-Lu. However, they can struggle against Taunt variants of Miraidon and can be OHKOed by Choice Specs and Calm Mind sets.</p> <p><strong>Revenge Killers</strong>: Choice Scarf Koraidon and Miraidon, as well as Zacian-C, outspeed and threaten to OHKO Miraidon with their STAB attacks. However, Koraidon and Miraidon can only enter on a predicted Electro Drift. Extreme Killer Arceus can revenge kill Miraidon if it is heavily chipped, but must be wary of Tera Ghost. Iron Bundle in Electric Terrain also outspeeds Miraidon and threatens to OHKO it with either Choice Specs-boosted Ice Beam or simply Tera Ice-boosted Ice Beam.</p> <p><strong>Dragon Resists</strong>: Zacian-C, Arceus-Fairy, and Flutter Mane can pivot into Miraidon's Draco Meteor and threaten it out with a strong Fairy-type attack. Necrozma-DM can also pivot into Draco Meteor and run Tera Ground paired with Earthquake to threaten Miraidon. However, all of the aforementioned Pokemon are heavily threatened by Electro Drift and must be wary of switching into a predicted attack.</p> <p><strong>Blissey</strong>: Blissey can pivot into any of Miraidon's attacks and is never 2HKOed by Choice Specs- or Life Orb-boosted attacks. However, Blissey must be wary of Taunt blocking its use of Recover. Furthermore, Blissey can only touch Miraidon with Seismic Toss and must be wary of a potential Tera Ghost Miraidon.</p> <p><strong>Arceus-Grass</strong>: Arceus-Grass resists Miraidon's Electro Drift and can pivot into its Draco Meteor. However, it must be wary of Overheat on Choice Specs sets and can be outdamaged by Tera Dragon sets.</p>",
    "sets": {
      "Pivot": {
        "description": "<p>Miraidon's natural power and access to U-turn make it a strong pivot for offensive teams. Heavy-Duty Boots maximizes Miraidon's longevity against entry hazard-stacking teams and gives it an advantage against Sticky Web teams. Miraidon can use U-turn to bring in Koraidon, Arceus, Kyogre, and Chien-Pao on its checks, such as Ting-Lu, Clodsire, and Arceus-Ground. Taunt prevents Arceus formes and Clodsire from using Recover while limiting hazards and setup from the likes of Arceus, Necrozma-DM, and Ting-Lu. Tera Dragon powers up Miraidon's Draco Meteor, letting it 2HKO Arceus formes and Clodsire and hit Ting-Lu even harder. Tera Steel gives Miraidon the ability to avoid Toxic from Clodsire and Eternatus while letting it resist the likes of Scale Shot and Dragon Claw from Koraidon, Draco Meteor from opposing Miraidon, Play Rough from Zacian-C, Extreme Speed from Arceus, and Judgment from Arceus-Fairy. Tera Ghost sheds Miraidon's weaknesses while also preventing Extreme Killer Arceus from consistently revenge killing it.</p> <p>Miraidon is quite fast but can still be revenge killed by Choice Scarf Koraidon and Zacian-C. As such, Ho-Oh and Necrozma-DM pair well with it. Necrozma-DM's access to Knock Off especially helps Miraidon and its teammates win the hazard war. Hazard setters such as Ting-Lu and Gliscor appreciate Miraidon limiting both hazards from opposing setters and preventing recovery while also checking opposing Miraidon and Ground-types such as Arceus-Ground, Clodsire, and Ting-Lu. Pivot Miraidon also pairs especially well with Choice Scarf Koraidon thanks to their shared access to U-turn, letting them form a strong pivot core that can wear down Pokemon in conjunction with hazards. Finally, Miraidon pairs well with Calm Mind Arceus formes such as Arceus-Fairy and Arceus-Ground, as Miraidon's strong Draco Meteors and access to Taunt let it wear down special walls such as Arceus-Fairy, Arceus-Ground, Arceus-Grass, Clodsire, and Ting-Lu for them.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Miraidon is the strongest wallbreaker in Ubers and has the power to 2HKO Arceus formes and Clodsire without the use of Terastallization. Overheat is the standard coverage move on Choice Specs sets, as it offers a midground between hitting Ground-types such as Arceus-Ground, Clodsire, and Ting-Lu and Fairy-types such as Arceus-Fairy, Flutter-Mane, and Zacian-C. U-turn and Volt Switch are both options for the set, but Volt Switch requires the player to be more aggressive against opposing Ground-types. Tera Dragon lets Miraidon 2HKO Ting-Lu and defensive Necrozma-DM while also OHKOing Ho-Oh. Tera Electric powers up Miraidon's Electro Drift and Volt Switch immensely, making them much harder to pivot around with Electric resistances such as Koraidon and Eternatus. Tera Fire is an option that pairs well with Overheat, as it lets Miraidon OHKO both Arceus formes and Clodsire in sun without any need for prediction, but it is generally outclassed thanks to the lack of defensive utility and Stealth Rock weakness that it brings.</p> <p>Miraidon's ability to break special walls, such as Clodsire for Calm Mind Arceus-Fairy and Kyogre and Ting-Lu for Calm Mind Arceus-Ground, is appreciated. In return, they can pivot into Miraidon's revenge killers, such as Koraidon, Zacian-C, and opposing Miraidon. Physical wallbreakers such as Koraidon, Dragon Dance Necrozma-DM, and Zacian-C can wear down shared checks such as Arceus-Ground while giving Miraidon a turn of free entry. Koraidon in particular is a very strong partner for being able to pivot Miraidon into Ho-Oh, and the two of them can wear down Arceus-Fairy together. Finally, Miraidon's reliance on prediction makes it necessary to have teammates that can pivot into the aforementioned Ground- and Fairy-types, such as Ho-Oh and Necrozma-DM.</p>"
      },
      "Double Dance": {
        "description": "<p>Double Dance Miraidon utilizes its high Speed, decent bulk, and immediate power to become a fearsome sweeper. Although Electro Drift is the preferred option for its power against Arceus formes, Necrozma-DM, and Zacian-C, Parabolic Charge is an option to increase Miraidon's longevity. Dazzling Gleam is an option over Dragon Pulse that pairs well with Tera Fairy to break Ting-Lu. Electric Seed's Defense boost lets Miraidon set up easily against physical attackers, including Extreme Killer Arceus, Choice Scarf Koraidon, Necrozma-DM, and Zacian-C lacking Play Rough. Leftovers gives Miraidon some flexibility to set up when pivoting into play. Finally, Life Orb boosts Miraidon's damage output massively, letting its Electro Drift OHKO Zacian-C without a Calm Mind boost. Tera Dragon is preferred for its power boost to Dragon Pulse, letting Miraidon 2HKO Clodsire and Ting-Lu with one layer of Spikes up after a Calm Mind boost while also letting it more easily set up on Arceus-Ground and Ting-Lu. Tera Fairy gives Miraidon the ability to set up on Koraidon and opposing Miraidon and powers up Dazzling Gleam enough to OHKO Ting-Lu when using a Life Orb, although Miraidon cannot beat Clodsire with this set. 8 Speed EVs allows Miraidon to outspeed Iron Bundle in Electric Terrain after an Agility boost.</p> <p>Double Dance Miraidon is best on hyper offense teams, where other teammates like Koraidon and Zacian-C can wear down opposing Pokemon enough to let Miraidon easily sweep. Agility Eternatus is a strong teammate, since it can help wear down Miraidon's checks in Arceus-Ground, Clodsire, and Ting-Lu while absorbing Toxic Spikes. Glimmora, Deoxys-S, and Deoxys-A are good partners for setting entry hazards to wear down Miraidon's checks. Arceus-Ground and Necrozma-DM can help wear down a shared check in Ting-Lu, and Miraidon can pivot into Arceus-Water and Kyogre for them. Other hyper offense support Pokemon such as Grimmsnarl and Orthworm can help Miraidon set up, with the former letting Miraidon set up more easily under dual screens and the latter setting up Shed Tail against on Ground-types.</p>"
      },
      "Wallbreaker": {
        "description": "<p>This Miraidon set is a strong wallbreaker without the prediction reliance of Choice Specs Miraidon. Parabolic Charge is an option over Electro Drift in order to make up for Life Orb recoil, but Electro Drift's higher power lets Miraidon OHKO Zacian-C and Arceus-Fairy unboosted. Dragon Pulse provides a more spammable alternative to Draco Meteor that still 2HKOes Arceus-Ground and Clodsire after a Calm Mind boost. Taunt prevents recovery from Arceus formes and Clodsire, and Substitute eases prediction against Ground- and Fairy-type cores as well as against Terastallization. However, Substitute and Life Orb can significantly decrease Miraidon's longevity, so Draco Plate is generally preferred when running Substitute. Draco Plate is an alternative over Life Orb for similar power without the recoil. Tera Dragon is the preferred Tera type thanks to the significant power increase. Tera Dragon-boosted Draco Meteor Miraidon has a 50% chance to OHKO Ting-Lu after a Calm Mind, and a Modest nature guarantees the OHKO. Alternatively, Tera Bug paired with Substitute turns some of Miraidon's checks into setup fodder, as Arceus-Ground's Earthquake and Judgment and Clodsire's Earthquake do not break through Substitute. Solar Beam is another option that threatens to OHKO Ting-Lu after a Calm Mind boost and has no charge turn in sun.</p> <p>This Miraidon set fits on offensively minded teams that don't mind the lack of longevity in exchange for its wallbreaking power. Sticky Web teams appreciate Miraidon's wallbreaking power to open up setup sweepers like Koraidon and Basculegion-M late-game and can make up for Miraidon's lack of Speed. Arceus-Ground and Necrozma-DM appreciate Miraidon potentially removing Ting-Lu. Entry hazard support from Clodsire, Ting-Lu, Glimmora, and Gliscor can wear down Ting-Lu and Arceus formes into range of Miraidon's unboosted attacks. Choice Scarf Koraidon and Zacian-C can revenge kill Miraidon, so checks to them such as Ho-Oh, Necrozma-DM, and Gliscor are appreciated.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Miraidon is a potent form of speed control that leverages its power and great Speed tier to be a strong alternative to Choice Scarf Koraidon. Miraidon's access to U-turn lets it bring teammates into the Ground-types it cannot power through immediately, such as Kyogre, Koraidon, Arceus-Fairy, and Chien-Pao. Tera Dragon powers up Miraidon's Draco Meteor and Dragon Pulse, letting Draco Meteor 2HKO Clodsire. Tera Electric powers up Miraidon's Electro Drift and Volt Switch but can be risky to use before opposing Ting-Lu, Clodsire, and Arceus-Ground are eliminated. Tera Steel gives Miraidon a resistance to Dragon-type coverage and Extreme Speed, letting Miraidon revenge kill Extreme Killer Arceus, Scale Shot Koraidon, and Flutter Mane in sun in a pinch.</p> <p>Miraidon's Speed tier makes it the fastest revenge killer in the tier, only tied with Choice Scarf Koraidon and outsped by Iron Bundle in Electric Terrain. However, it struggles with Ground-types such as Ting-Lu and Clodsire, which freely pivot into it and use it to set up entry hazards. Physical wallbreakers such as Koraidon, Necrozma-DM, and Zacian-C can pressure the aforementioned Ground-types. Koraidon in particular is a very strong partner for being able to pivot Miraidon into Ho-Oh, and the two of them can wear down Arceus-Fairy together. This also frees up Koraidon's item slot, letting Koraidon run sweeper sets instead. Miraidon appreciates partners that can set entry hazards such as Gliscor, Ting-Lu, and Clodsire. Gliscor can remove Heavy-Duty Boots from opposing Pokemon while setting Spikes and Toxic Spikes, and Clodsire can absorb Toxic Spikes for Miraidon. Miraidon being locked into any of its STAB moves is exploitable, so having checks to Electric-type resists, such as Koraidon, Miraidon, and the aforementioned Ground-types, and Dragon-type resists, such as Arceus-Fairy, Zacian-C, and Necrozma-DM, is appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "Manaphy", "user_id": 50695}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Walking Wake": {
    "outdated": true,
    "sets": {
      "Wallbreaker": {
        "description": "<ul> <li>Walking Wake is one of the most dangerous sun wallbreakers in Ubers, capable of 2HKOing even the bulkiest of Water resists and special walls alike.</li> <li>Hydro Steam is Walking Wake's most spammable move; in sun, it 2HKOes Koraidon, OHKOes Flutter Mane, and 2HKOes Toxapex, making it very hard for teams to have a consistent switch-in to it.</li> <li>Dragon Pulse, albeit weaker than Draco Meteor, doesn't come with any drawbacks, making it a much better move to spam if lowering Walking Wake's Special Attack is not desired.</li> <li>Tera Water turns Walking Wake into an unwallable Pokemon, 2HKOing defensive walls like Blissey and OHKOing offensive pivots like Assault Vest Flutter Mane in sun. Tera Fairy can be used instead, as it gives Walking Wake useful resistances to Sucker Punch from Chien-Pao and Kingambit while also making it immune to Dragon-type attacks from Koraidon and Miraidon. Lastly, Tera Steel gives Walking Wake a resistance to Iron Bundle's Ice-type attacks, mainly Freeze Dry.</li> <li>A Modest nature lets Walking Wake wallbreak with extreme ease, allowing for Draco Meteor to 2HKO Clodsire in sun. Alternatively, a Timid nature gets the jump on Timid Chi-Yu and opposing Modest Walking Wake, although the difference in power is very noticeable.</li> <li>Walking Wake is best suited for offensive sun teams and should be used as such, making use of its unique typing to switch into Pokemon like Chi-Yu and counterattack with a nuclear Hydro Steam.</li> <li>Walking Wake is somewhat slow for Ubers standards, so fast partners like Choice Scarf Koraidon and Flutter Mane are a must to compensate for its Speed stat. Koraidon's sun also greatly powers up Walking Wake's attacks.</li> <li>Secondary wallbreakers such as Flutter Mane and Chi-Yu are also recommended, as Walking Wake's Speed hinders its performance as a standalone wallbreaker. Defensive teammates like Clodsire and Great Tusk are also helpful, as they check Miraidon, Flutter Mane, and Koraidon, respectively.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "ox04", "user_id": 507268}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Ogerpon-Hearthflame": {"sets": {"Swords Dance": {}}}
}