{
  "Venusaur": {"sets": {"Sun Sweeper": {}}},
  "Blastoise": {"sets": {"Shell Smash": {}}},
  "Vileplume": {"sets": {"Phyiscally Defensive": {}}},
  "Slowbro": {"sets": {"Defensive": {}, "Calm Mind": {}}},
  "Slowbro-Galar": {"sets": {"Defensive": {}}},
  "Muk-Alola": {"sets": {"RestTalk": {}}},
  "Cloyster": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Shell Smash Sweeper": {}}},
  "Gengar": {"sets": {"Choice Scarf": {}, "Hex + Will-O-Wisp": {}, "Nasty Plot": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Ditto": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Imposter": {"description": "<p>Tera Steel makes Ditto immune to Toxic Spikes and take less from Stealth Rock. It also lets Ditto revenge kill Belly Drum Hariyama. A Quiet nature and the Special Attack investment is in case Ditto transforms into a Future Sight user like Slowbro.</p>"}}},
  "Vaporeon": {"sets": {"Defensive": {}}},
  "Articuno-Galar": {"sets": {"Calm Mind": {}}},
  "Zapdos-Galar": {"sets": {"Choice Scarf": {}, "Choice Band": {}}},
  "Moltres": {"sets": {"Physically Defensive": {"description": "<p>96 Speed EVs lets it outrun max Speed Adamant Bisharp.</p>"}, "Fast Pivot": {"description": "<p>184 Speed EVs with Jolly Nature lets it outrun max Speed Jolly Gyarados and Slither Wing.</p>"}}},
  "Mew": {"sets": {"Nasty Plot": {}, "Double Dance": {}}},
  "Typhlosion-Hisui": {"sets": {"3 Attacks + Will-O-Wisp": {}, "Choice Scarf": {}}},
  "Feraligatr": {"sets": {"Dragon Dance": {}}},
  "Politoed": {"sets": {"Rain Setter": {}}},
  "Quagsire": {"sets": {"Physically Defensive": {}}},
  "Espeon": {"sets": {"Choice Specs": {}, "Calm Mind": {}, "Choice Scarf": {}}},
  "Umbreon": {"sets": {"Wish Support": {}}},
  "Forretress": {"sets": {"Support": {}}},
  "Kingdra": {"sets": {"Rain Sweeper": {}}},
  "Raikou": {"sets": {"Calm Mind": {}, "Offensive Pivot": {}}},
  "Entei": {"sets": {"Choice Band": {}}},
  "Suicune": {"sets": {"Calm Mind": {}}},
  "Swampert": {"sets": {"Defensive Utility": {}}},
  "Gardevoir": {"sets": {"Choice Scarf": {}}},
  "Breloom": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Flygon": {"sets": {"Choice Scarf": {}}},
  "Crawdaunt": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Milotic": {"sets": {"Defensive": {}}},
  "Salamence": {"sets": {"Special Attacker": {}, "Dragon Dance": {}}},
  "Deoxys-Defense": {"sets": {"Utility": {}}},
  "Torterra": {"sets": {"Shell Smash Sweeper": {}}},
  "Infernape": {"sets": {"Physical Attacker": {}, "Nasty Plot": {}}},
  "Empoleon": {"sets": {"Specially Defensive": {}}},
  "Floatzel": {"sets": {"Choice Band": {}}},
  "Gastrodon": {"sets": {"Specially Defensive": {}}},
  "Bronzong": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Stealth Rock": {}, "Bulky Setup Sweeper": {}}},
  "Lucario": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Nasty Plot": {}}},
  "Hippowdon": {"sets": {"Physically Defensive": {"description": "<p>Whirlwind gets blocked by Wind Rider but does not get blocked by Bisharp's Throat Chop, so it is chosen over Roar due to the latter being more relevant.</p>"}}},
  "Toxicroak": {"sets": {"Swords Dance": {}}},
  "Magnezone": {"sets": {"Choice Specs": {}, "Assualt Vest": {}}},
  "Rhyperior": {"sets": {"Stealth Rock": {}}},
  "Yanmega": {"sets": {"Speed Boost Sweeper": {}}},
  "Porygon-Z": {"sets": {"Choice": {}}},
  "Froslass": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Spikes Lead": {}}},
  "Rotom-Heat": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Azelf": {"sets": {"Expert Belt": {}, "Choice Scarf": {}, "Offensive Stealth Rock": {}}},
  "Cresselia": {"sets": {"Bulky Calm Mind": {"description": "<p>136 Speed EVs allows Cresselia to outspeed Modest Volcanion.</p>"}, "Fast Calm Mind": {"description": "<p>216 Speed EVs with Timid Nature allows Cresselia to outspeed Max Speed positive nature Hoopa-Unbound.</p>"}}},
  "Conkeldurr": {"sets": {"Guts Wallbreaker": {}}},
  "Krookodile": {"sets": {"Choice Scarf": {}, "Stealth Rock": {}, "Bulk Up": {}, "Choice Band": {}}},
  "Zoroark-Hisui": {"sets": {"Choice": {}, "Nasty Plot": {}}},
  "Cinccino": {"sets": {"Tidy Up": {}}},
  "Reuniclus": {"sets": {"Calm Mind Sweeper": {}}},
  "Amoonguss": {"sets": {"Defensive": {}}},
  "Galvantula": {"sets": {"Webs Lead": {}}},
  "Mienshao": {"sets": {"Life Orb": {}, "Choice Scarf": {}}},
  "Bisharp": {"sets": {"Swords Dance": {}}},
  "Cobalion": {
    "sets": {
      "Iron Defense + Body Press": {},
      "Choice Specs": {
        "description": "<p>While its Special Attack might not seem that threatening at first, Cobalion uses its good Speed stat, natural bulk, and defensive type combination to fire off many hits on metagame staples like Mimikyu, Cyclizar, and Kleavor. Its STAB attacks can hit most Pokemon in the tier for huge neutral or super effective damage. It easily threatens out common Fairy-types like Gardevoir, Enamorus-T, and Mimikyu as well as naturally bulky targets like Volcanion and Jirachi, which it can usually 2HKO. STAB Vacuum Wave lets Cobalion be an effective revenge killer against weakened sweepers like Revavroom and Maushold. Volt Switch allows it to pivot out on checks like Moltres, Slowbro, and Basculegion-F to bring in a teammate that threatens them. With Focus Blast, Cobalion can notably always OHKO Assault Vest Cyclizar with standard EVs and Kleavor. On the other hand, Aura Sphere boasts perfect accuracy; it might miss out on some important OHKOs such as the aforementioned Assault Vest Cyclizar and Kleavor, but it can still OHKO important targets such as opposing Cobalion. Both Focus Blast and Aura Sphere highly weaken one of the best checks to physically oriented Cobalion sets, Hippowdon. Tera Fighting is used for even more damage on its Fighting-type STAB attacks, and Tera Electric grants Cobalion an immunity to paralysis from Pokemon such as Jirachi, lets Cobalion hit even harder with Volt Switch, and removes its weakness to priority Mach Punch from Breloom and Conkeldurr.</p> <p>Choice Specs Cobalion can fit on many archetypes, including hyper offense, bulky offense, and balance. It can bait out the checks to Cobalion's IronPress set such as Hippowdon and Moltres, which clears the way for physical threats like Revavroom and Maushold. It can also provide opportunities to bring in frail teammates like Gengar and Barraskewda through Volt Switch. Cobalion is one of the few special attackers that can threaten Fezandipiti and Chansey for decent immediate damage without setup, forcing them to heal off the damage every time they switch into its attacks, which lets it safely switch into teammates that can threaten them out like Bisharp, Okidogi, and Galarian Zapdos. Special cleaners and sweepers like Jirachi, Gardevoir, and Blastoise enjoy getting their main checks weakened by Cobalion as well. Choice Specs Cobalion enjoys support from entry hazard setters like Forretress, Hippowdon, and Empoleon to chip down its targets as well.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance Cobalion sets itself apart from other physical setup sweepers such as Terrakion and Revavroom by trading sheer breaking power in exchange for a fantastic defensive profile, which lets it also act as an answer to many common Pokemon and find plenty of switch-in opportunities. Stone Edge nails Flying-type Pokemon such as Moltres and Salamence that would normally answer Cobalion's other sets. Leftovers allows it to shrug off Stealth Rock damage, as well as resisted attacks such as Maushold's Population Bomb and Jirachi's Iron Head, which, in conjunction with its good defensive typing and natural bulk, lets Cobalion get many opportunities to enter the field throughout the game. Air Balloon is an option that allows Cobalion to switch aggressively into Ground-type Pokemon such as Hippowdon early in the game. Note that Hippowdon variants without Stone Edge cannot hit Cobalion while its Air Balloon has not been popped yet, which turns them into setup fodder. After its Air Balloon has been popped, Cobalion can act as an excellent Knock Off absorber due to it not having to worry about losing its Leftovers, its Dark resistance, and its Justified ability giving it an Attack boost. Tera Ghost turns the tables against Fighting-type Pokemon such as Mienshao, Terrakion, and opposing Cobalion by turning Cobalion's Fighting weakness into an immunity. Tera Flying follows this idea but turns Cobalion's Fighting weakness into a resistance while also granting an immunity to Ground, which helps against Ground-type attacks such as Hippowdon's Earthquake, Enamorus-T Earth Power, and Revavroom's High Horsepower. Tera Fighting elevates Close Combat's power even higher, which can help it break past common answers such as Hippowdon while removing Cobalion's Fighting and Ground weaknesses. Cobalion does not need to Terastallize to function efficiently, but it is a fairly common Tera user, as it appreciates the ability to combine its natural bulk with another typing to answer different matchups and create setup opportunities against would-be checks.</p> <p>This set is one of the cornerstones of the bulky offense archetype due to Cobalion's typing and bulk, which lets it act as a check or counter to a variety of common Pokemon. Thanks to Swords Dance and its great Speed tier, it can threaten KOs or break defensive cores. This set requires the opponent's physical walls to already be chipped decently in order to efficiently break apart balance cores, so Spikes support from Pokemon such as Gastrodon, Deoxys-D, and Forretress is very appreciated. Moltres provides an immunity to Ground-type attacks and a resistance to Fighting-type attacks, acts as a pivot with U-turn, and spreads burn through Flame Body and Will-O-Wisp to further chip at walls. Fezandipiti brings a 4x resistance to Fighting-type attacks and is adept at breaking down walls through poison and Taunt while Cobalion answers the Steel-types that Fezandipiti struggles against, but be wary that both Fezandipiti and Cobalion are weak to Ground-type attacks. Special attackers threaten Cobalion due to its lackluster Special Defense, so Pokemon such as Assault Vest Cyclizar, specially defensive Empoleon, and Gastrodon are good teammates. Grass Knot Jirachi can bait in and smack bulky Ground-types such as Hippowdon and Quagsire while being a solid switch-in against Choice Scarf Gardevoir. Iron Leaves and Galarian Zapdos are powerful wallbreakers that share checks with Cobalion and help overwhelm said checks. Healing Wish support from teammates such as Gardevoir and Enamorus-T circumvents Cobalion's lack of a recovery option and can also heal off status, allowing for more aggressive plays and extending its longevity.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 584113, "username": "Some random guy ya"}, {"user_id": 614438, "username": "fluff!!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 598717, "username": "Sneakyplanner"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Terrakion": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Stealth Rock": {}}},
  "Thundurus": {"sets": {"Nasty Plot": {}, "Offensive Pivot": {}}},
  "Chesnaught": {"sets": {"Spikes": {}}},
  "Talonflame": {"sets": {"Utility": {}}},
  "Dragalge": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Utility": {"description": "<p>132 Speed EVs are to outrun uninvested Sylveon.</p>"}, "Choice Specs": {"description": "<p>172 Speed EVs are to outrun uninvested Umbreon and Vaporeon.</p>"}}},
  "Klefki": {"sets": {"Spikes": {}}},
  "Noivern": {"sets": {"Offensive Pivot": {}}},
  "Diancie": {"sets": {"Stealth Rock": {}}},
  "Volcanion": {"sets": {"Offensive": {}}},
  "Incineroar": {"sets": {"Defensive Pivot": {}}},
  "Oricorio-Pom-Pom": {"sets": {"Quiver Dance Sweeper": {}}},
  "Lycanroc-Dusk": {"sets": {"Swords Dance": {}, "Choice Band": {}}},
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Salazzle": {"sets": {"Substitute + Toxic": {}, "Offensive": {}}},
  "Tsareena": {"sets": {"Rapid Spin": {}}},
  "Palossand": {"sets": {"Defensive": {}}},
  "Mimikyu": {"sets": {"Swords Dance": {}}},
  "Necrozma": {"sets": {"Stealth Rock": {}, "Offensive Trick Room": {}, "Dragon Dance": {}}},
  "Inteleon": {"sets": {"Choice Specs": {}}},
  "Barraskewda": {"sets": {"Rain Sweeper": {}}},
  "Toxtricity": {"sets": {"Wallbreaker": {}, "Offensive Pivot": {}, "Shift Gear": {}}},
  "Regidrago": {"sets": {"Choice Specs": {}, "Dragon Dance": {}, "Choice Scarf": {}}},
  "Kleavor": {"sets": {"Lead": {}, "Choice Scarf": {}}},
  "Basculegion-F": {"sets": {"Choice Scarf": {}, "Choice Specs": {}, "Rain Wallbreaker": {}}},
  "Overqwil": {"sets": {"Rain Sweeper": {}, "Defensive": {}}},
  "Enamorus-Therian": {
    "sets": {
      "Calm Mind": {"description": "<p>116 Speed EVs lets it outrun uninvested Empoleon.</p>"},
      "Choice Specs": {
        "description": "<p>Choice Specs Enamorus-T is a potent wallbreaker, capable of punching holes in any team with its powerful Moonblasts. Earth Power synergizes well with Moonblast, dealing super effective damage against the Fire-, Poison-, and Steel-types that resist Fairy such as Jirachi, Fezandipiti, and Volcanion. Mystical Fire offers coverage against foes that resist Fairy whose typing or ability grant them more resistance to Ground such as Amoonguss, Forretress, and Bronzong while also providing an option to prevent opposing Calm Mind users from boosting their Special Attack. Healing Wish allows you to sacrifice Enamorus-T to fully heal and remove status from an important teammate such as a chipped sweeper like Cobalion or Okidogi or an important part of its team's defensive core. 116 Speed EVs allow Enamorus-T to outspeed uninvested base 60 Speed Pokemon such as Empoleon and Swampert. 136 HP EVs result in slightly less damage taken from Stealth Rock. Tera Fairy boosts its already incredible Moonblasts to another level, turning 2HKOs into OHKOs against targets such as Hippowdown and Iron Leaves and dealing enough damage to where Moltres cannot outheal it with Roost. Tera Ground guarantees OHKOs against the Fairy-resistant foes weak to Ground, while also turning Enamorus-T's Poison, Rock, and Electric weaknesses into resistances or immunities.</p> <p>Choice Specs Enamorus-T fits best on balanced teams with VoltTurn support from Pokemon such as Cobalion, Galarian Zapdos, and Jirachi to get it in safely. Due to its low Speed, Enamorus-T is best brought in against the slow walls it wants to threaten or Pokemon that lack the moves to deal with it effectively, including Hippowdon and Slowbro. The standard moveset struggles to hit Fairy-resistant foes that are immune to Ground, most notably Moltres and Rotom-H, so Enamorus-T appreciates teammates that can either answer them or remove their Heavy Duty Boots, like Trick Gardevoir or Knock Off Cyclizar and Galarian Zapdos. When paired with Sand Stream Hippowdon, Enamorus-T can opt to use Weather Ball, which cleanly OHKOes Moltres and does significant damage to Rotom-H, but due to the move's reliance on the weather it is usually not worth sacrificing the flexibility of another move. Due to its weakness to Stealth Rock, Choice Specs Enamorus-T wants entry hazard control, such as Rapid Spin Cyclizar or Forretress. Enamorus-T is also a great option for team styles that mitigate or take advantage of its low Speed, such as Sticky Web from Araquanid or the less viable Trick Room set by Cresselia, due to its immediate power and access to Healing Wish.</p>"
      },
      "Double Dance": {
        "description": "<p>With its already good defensive stats and setup moves in Iron Defense and Calm Mind, Double Dance Enamorus-T is an excellent wincon that is difficult to remove once it starts setting up. Draining Kiss is important to help keep it healthy while or after setting up. Earth Power gives Enamorus-T coverage against the Steel-, Poison-, and Fire-type Pokemon that resist Draining Kiss with the exception of Moltres and Rotom-H. Leftovers gives Enamorus-T some recovery while it sets up. The EV spread gives it enough Speed to outspeed uninvested Registeel and anything slower while being as bulky as possible. Enamorus-T benefits a lot from Terastallization; Tera Water gives it a resistance to Steel, which helps it take on Iron Head users such as Cobalion and Jirachi. Tera Steel removes its Electric weakness and grants it a resistance to Steel as well as an immunity to Poison, which provides it with a Toxic immunity and helps it take Revavroom’s Gunk Shot and Gengar’s Sludge Bomb and Sludge Wave; this does requires being more careful around Fire-types, however. Both Tera types also give Enamorus-T a resistance to Ice, which prevents Pokemon like Ice Beam Empoleon from weakening it to the point where it can be revenge killed.</p> <p>Enamorus-T fits best on bulky offensive teams that allow it to set up and sweep late-game once its checks have been chipped or removed. Moltres is one of Enamorus-T’s best answers, so teammates that can lure it in such as Stone Edge Cobalion and Mienshao are good to have. Enamorus-T also appreciates entry hazard support, as they can chip down Fire-types that it struggles with, so hazard setters like the aforementioned Cobalion and Hippowdon are good partners. Because this set does not run Heavy-Duty Boots, hazard removal is important to ensure that Enamorus-T is as healthy as possible when attempting a sweep, so teammates like Cyclizar and Maushold are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 555741, "username": "MachJacob"}, {"user_id": 651420, "username": "DaRotomMachine"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 359771, "username": "GoldCat"}, {"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Maushold": {"sets": {"Tidy Up": {}}},
  "Maushold-Four": {"sets": {"Tidy Up": {}}},
  "Armarouge": {"sets": {"Calm Mind": {}, "Weakness Policy": {}}},
  "Bellibolt": {"sets": {"Mr. Belli (Defensive)": {}}},
  "Kilowattrel": {"sets": {"Offensive Pivot": {}}},
  "Grafaiai": {"sets": {"Unburden Sweeper": {}, "Choice Scarf": {}, "Offensive Pivot": {}}},
  "Revavroom": {"sets": {"Shift Gear": {}, "Choice Scarf": {}}},
  "Cyclizar": {"sets": {"Rapid Spin": {}, "Assault Vest": {}}},
  "Scream Tail": {"sets": {"Wish Support": {}}},
  "Slither Wing": {"sets": {"Bulky Pivot": {}, "Choice Band": {}}},
  "Wo-Chien": {"sets": {"Leech Seed": {}, "RestTalk": {}}},
  "Iron Leaves": {"sets": {"Swords Dance": {}}},
  "Okidogi": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Munkidori": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Fezandipiti": {"sets": {"Calm Mind": {}, "Pivot": {}}}
}