{
  "Arcanine-Hisui": {"sets": [{"name": "Choice Band (Rock)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Choice Scarf (Rock)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Simon Science", "user_id": 258247}, {"username": "TheRealBigC", "user_id": 532450}]}]}},
  "Slowbro": {"sets": [{"name": "Physically Defensive (Psychic)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Muk-Alola": {"sets": [{"name": "Specially Defensive Sludge (Poison)", "description": "<p>Ice Punch may be used to ease the Ground and Flying matchup, though it will not OHKO Landorus.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Pengairxan", "user_id": 622813}]}]}},
  "Cloyster": {
    "sets": [
      {
        "name": "Shell Smash Sweeper (Ice)",
        "description": "<p>Cloyster is one of Ice's best setup sweepers thanks to its access to Shell Smash in addition to its high Defense stat, which gives it opportunity to set up on the tier's physical attackers like Garchomp, Iron Treads, and Ceruledge. Icicle Spear targets opposing Flying-, Ground- and Dragon-type Pokemon such as Kilowattrel, Clodsire, and Walking Wake while breaking Focus Sash on Pokemon such as Breloom. Rock Blast benefits from Skill Link and threatens Fire-types like Ceruledge after a boost and other Ice-type Pokemon like Chien-Pao. Ice Shard is useful for revenge killing faster Choice Scarf Pokemon that are weakened like Flutter Mane, Meowscarada, and Roaring Moon. Hydro Pump is the alternative in order to not be walled by opposing Steel-types like Kingambit and Forretress. It is also beneficial for threatening Paldean Tauros-F, which is a significant issue to Ice teams, as well as Skeledirge and Torkoal, easing the Fire matchup. Maximum Speed investment with a Jolly nature allows +2 Cloyster to outspeed Choice Scarf users such as Walking Wake, Hydreigon and Indeedee; a Naive nature with the remaining 4 EVs going into Special Attack should be used if opting for Hydro Pump to not reduce its damage. Skill Link is the best ability to run on Cloyster since it guarantees Icicle Spear and Rock Blast hit 5 times. White Herb is Cloyster's preferred item, as it is able to offset the Defense drops of Shell Smash, which makes Cloyster harder to revenge kill. Focus Sash is the alternative to always guarantee one turn of setup from full health, but it is less preferred since Cloyster is harder to OHKO under snow or Aurora Veil.</p> <p>Cloyster's best partner on Ice is Abomasnow. Abomasnow allows Cloyster to have an easier time to set up thanks to it setting snow, which, combined with Aurora Veil, allows it to set up on Pokemon that can usually threaten it out like offensive Great Tusk and Cinderace. Abomasnow also has Leech Seed support to improve Cloyster's longevity and handles Unaware Pokemon Quagsire and Dondozo with its STAB Giga Drain. Cloyster is able to threaten Fire's weather setter Torkoal after a boost, which benefits Abomasnow, as it can come back in to reset the weather for its teammates. Cloyster also appreciates Chien-Pao as an offensive partner, as Swords Dance sets are able to weaken its defensive checks like Toxapex, Kingambit and Rotom-W. Choice Scarf sets are also able to clean up late-game more easily thanks to Cloyster's sweeping. Baxcalibur is also one more offensive partner for Cloyster, as its ability to switch into Will-o-Wisp from Pokemon like Sableye and Rotom-W supports Cloyster's sweeping capabilities, while Cloyster offers additional support against the Dragon-types that threaten Baxcalibur like Dragonite, Roaring Moon, and Hydreigon. Choice Band Baxcalibur can also wear down defensive walls like Corviknight and Skeledirge, which gives Cloyster an easier sweep. Glaceon also pairs well with Cloyster, as it can threaten defensive Water-type Pokemon like Toxapex, Rotom-W, and Dondozo with Freeze-Dry. Avalugg can support Cloyster with its Rapid Spin to remove hazards, so Cloyster can come in easier and set up. Avalugg is also able to handle Cloyster's offensive checks like Great Tusk under snow. Froslass is Ice's only viable option for Spikes, which Cloyster appreciates, as defensive Pokemon like Hatterene and Iron Hands aren't able to check it properly after a boost.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TTK", "user_id": 307004}], "teams": [{"name": "Ice analysis by", "members": [{"username": "TTK", "user_id": 307004}]}, {"name": "Quality checked by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "CrossHeart", "user_id": 593863}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Tauros-Paldea-Blaze": {"sets": [{"name": "Bulk Up (Fighting)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Gyarados": {"sets": [{"name": "Defensive Dragon Dance (Flying)", "description": "<p>Outspeeds Great Tusk at +1, OHKO'es Flutter Mane with Waterfall at +1, 3HKO'ed by Specs Flutter Mane's Moonblast.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Flying Set by", "members": [{"username": "Trichotomy", "user_id": 284954}]}]}},
  "Ditto": {"sets": [{"name": "Choice Scarf", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Zapdos": {
    "sets": [
      {"name": "Choice Specs (Electric)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "SubRoost (Electric)", "description": "<p>Substitute isnt broken by Toxapex's moves. 100 SpA EVs may be considered to increase bulk and always OHKO Urshifu-R.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "SubRoost (Flying)", "description": "<p>Substitute isnt broken by Toxapex's moves. 100 SpA EVs may be considered to increase bulk and always OHKO Urshifu-R.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}]}]}
  },
  "Zapdos-Galar": {"sets": [{"name": "Choice Band (Fighting)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Choice Scarf (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "Dead by Daylight", "user_id": 571069}]}]}},
  "Moltres-Galar": {"sets": [{"name": "Nasty Plot (Dark)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Nasty Plot (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Dead by Daylight", "user_id": 571069}, {"username": "Giyu", "user_id": 574288}]}]}},
  "Dragonite": {
    "sets": [
      {
        "name": "Dragon Dance (Dragon)",
        "description": "<p>Dragonite is a great setup sweeper boasting nearly unresisted coverage, a useful Flying typing, and a convenient ability in Multiscale, allowing for an easier time setting up. Outrage is preferred due to the lack of Fairy-types and its utter power, allowing Dragonite to sweep opposing Dragon teams with the help of Baxcalibur and Dragapult late-game. Earthquake allows Dragonite to nail Poison- and Steel-type switch-ins such as Toxapex, Clodsire, and Gholdengo. Alternatively, Fire Punch threatens would-be checks like Corviknight and Air Balloon Gholdengo. Extreme Speed picks off weakened threats such as Greninja and Iron Valiant attempting to revenge kill it, while Encore may be used to lock physical walls like Dondozo, Quagsire, and Ting-Lu into a move, either letting Dragonite deal extra chip damage or effortlessly set up in front of them. A Jolly nature allows Dragonite to outpace Chien-Pao and Dragapult after a Dragon Dance so that Dragonite can OHKO them with Outrage, at the cost of power.</p> <p>Dragonite appreciates Baxcalibur's immunity to Will-O-Wisp from threats such as Sableye and Skeledirge, neutrality to Ice-type moves, and ability to threaten Ting-Lu. In return, Dragonite checks troublesome Fighting-types like Quaquaval and Slither Wing. Cyclizar's Shed Tail in conjunction with Multiscale grants Dragonite many chances to set up and prevents it from being affected by status effects inflicted by Toxapex, Amoonguss, and Skeledirge. Garchomp sets up entry hazards in the form of Stealth Rock and Spikes, chipping down Dragonite's switch-ins such as Forretress, Kingambit, and Quagsire. Dragapult breaks past walls such as Dondozo and Corviknight and prevents Rapid Spin users like Great Tusk and Iron Treads from clearing Garchomp's entry hazards. Dragalge's secondary Poison typing and commendable bulk allow it to check Fairy-types like Iron Valiant and Flutter Mane, and it supports Dragonite's sweeping with Toxic Spikes, notably wearing down Ting-Lu, Slowbro, and Quagsire. Choice Scarf Roaring Moon is a great revenge killer and method of speed control, as it outpaces and deals with Choice Scarf Baxcalibur, Chien-Pao, and Choice Specs Greninja. Walking Wake is another plausible Choice Scarf user due to its ability to threaten Chien-Pao and singlehandedly sweep Fire teams.</p> "
      },
      {
        "name": "Choice Band (Flying)",
        "description": "<p>Dragonite's high base Attack combined with Choice Band allows it to clean up many offensive teams with Extreme Speed, while Outrage can break through bulky teams such as Poison and Water. Multiscale can be very helpful to survive a super effective attack from foes such as Hydreigon. Outrage is a powerful STAB move that breaks defensive cores, 2HKOing physical walls such as Toxapex, Quagsire, and Amoonguss. Fire Punch and Earthquake punish Steel-types such as Corviknight and Iron Treads, as well as the aforementioned Poison-types. Brick Break can be helpful to target Dark-types such as Kingambit, and it removes dual screens against Dark and Fairy teams to help its teammates break. Iron Head can be used to deal with Fairy-types such as Hatterene, while Waterfall can be used in rain archetypes to deal with types such as Ground.</p> <p>Corviknight can deal with Ice-type Pokemon like Chien-Pao with Iron Head and can pivot with U-turn. Kilowattrel can also pivot Dragonite in with Volt Switch and can help it deal with physical walls like Dondozo and Iron Defense Corviknight. Choice Specs Iron Jugulis is also a great partner that appreciates Dragonite dealing with special walls such as Clodsire, Slowking, and Dragalge, while Iron Jugulis deals with phyisical walls such as Toxapex and Amoonguss. Bombirdier can provide entry hazard support with Stealth Rock and prevent foes such as Ting-Lu from setting up their own hazards with Taunt while also offering extra pivoting with Parting Shot to help Dragonite find more occasions to wallbreak. Gyarados is another teammate that can deal with some Ice-types such as Chien-Pao, but the lack of recovery can wear it down very quickly. In exchange, Dragonite can weaken down foes such as Toxapex and Amoonguss to potentially allow Gyarados to clean up teams with Dragon Dance.</p> "
      },
      {"name": "Dragon Dance (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}, {"username": "AtraX Madara", "user_id": 513753}], "teams": [{"name": "Dragon analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Flying analysis by", "members": [{"username": "AtraX Madara", "user_id": 513753}]}, {"name": "Quality check by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}, {"username": "sasha", "user_id": 510532}]}, {"name": "Grammar check by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Azumarill": {
    "sets": [
      {
        "name": "Belly Drum Sweeper (Fairy)",
        "description": "<p>Azumarill is Fairy's premier setup sweeper with immense damage output thanks to Huge Power alongside Belly Drum, which allows Azumarill to handle threats to the type such as Glimmora and Iron Treads. Aqua Jet patches up its below-average Speed tier and threatens faster threats like Iron Moth, Sandy Shocks, and Flutter Mane. Aqua Jet can also sweep late-game, especially against types that lack Water-resistant Pokemon like Steel. Play Rough breaks through sturdier threats that are not OHKOed by Aqua Jet like Hydreigon and Iron Hands. It also threatens opposing Dragon-types like Roaring Moon and Dragalge. Liquidation can be used over Play Rough to OHKO Pokemon like Corviknight, Unaware Clodsire, and Bronzong after Belly Drum. Ice Spinner specifically hits Water Absorb Clodsire and Amoonguss for super effective damage. Body Slam is also another option to significantly threaten Toxapex at +6 Attack while still being able to target the aforementioned Clodsire and Amoonguss for neutral damage. Trailblaze can be used to always beat Quagsire as well. 4 HP EVs are given to make Azumarill's HP an even number so when it activates Belly Drum from full HP, it can activate its Sitrus Berry immediately.</p> <p>One of Azumarill's best partners on Fairy teams is Klefki. Klefki sets up dual screens, which leads to Azumarill having an easier time setting up and sweeping. Klefki also sets Spikes for Azumarill, allowing Azumarill to secure KOs easier after a Belly Drum, particularly against Amoonguss and Toxapex after one layer of Spikes. Klefki also hinders Azumarill's offensive checks like Breloom with Thunder Wave. In return, Azumarill threatens opposing Fire- and Ground-types that threaten Klefki like Cinderace and Great Tusk. Azumarill forms a potent offensive core with Flutter Mane, which threatens the physical walls that may impede Azumarill's sweep like Unaware Quagsire and Toxapex, while Azumarill handles special walls like specially defensive Ting-Lu, Assault Vest Iron Hands, and Blissey. Azumarill also appreciates Iron Valiant as an offensive partner, as special sets can answer physical walls like Dondozo and hinder Azumarill's checks like Toxapex by using Trick, and—like with Flutter Mane—Azumarill can deal considerable damage to threats like Clodsire and Gholdengo. Magic Bounce Hatterene also assists Azumarill, as it bounces back entry hazards—particularly Toxic Spikes—which limits Azumarill's sweeping capabilities. Hatterene also has a strong matchup into Ground, Poison, and Water teams; Azumarill appreciates the latter two, since Hatterene is able to threaten Pokemon like Amoonguss and Toxapex.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TTK", "user_id": 307004}], "teams": [{"name": "Fairy analysis by", "members": [{"username": "TTK", "user_id": 307004}]}, {"name": "Quality checked by", "members": [{"username": "Tuudi", "user_id": 574228}, {"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Quagsire": {
    "sets": [
      {
        "name": "Unaware Wall (Ground)",
        "description": "<p>Quagsire is an excellent option for Ground teams due to its physical bulk and Unaware, checking a wide range of physical attackers like Chien-Pao and Baxcalibur. Earthquake in conjunction with Toxic wears down Pokemon like Dragonite as well as Quaquaval and Brambleghast, as they commonly switch in to remove Quagsire's entry hazards. Stealth Rock or Spikes wear down threats like Greninja, Iron Valiant, and Scovillain. Body Press is a viable alternative to deal more damage to Chien-Pao, Baxcalibur, and Kingambit.</p> <p>Quagsire's ability to wall setup sweepers like Dragonite, Azumarill, and Mimikyu is heavily appreciated by its teammates. Water Absorb Clodsire switches into attacks from Greninja, Meowscarada, and Kilowattrel. Iron Treads is an invaluable teammate to remove entry hazards with Rapid Spin and checking Fairy-types like Hatterene and Flutter Mane. Great Tusk, Garchomp, and Sandy Shocks value Quagsire's entry hazards, as it aids in their wallbreaking. Choice Scarf Great Tusk checks Choice Specs Flutter Mane, Chien-Pao, and Greninja and removes held items from Sableye, Corviknight, and Amoonguss to make them more susceptible to Quagsire's entry hazards. Garchomp threatens Grass-types like Amoonguss, Toedscruel, and Brambleghast with its Fire-type coverage and wears down walls such as Toxapex. Sandy Shocks is valued as a Water-type answer, threatening Pelipper, Dondozo, and Slowking as well as Corviknight. Furthermore, it beats Fire teams with Power Gem by taking advantage of sun with Protosynthesis.</p> "
      },
      {"name": "Physically Defensive (Water)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Ground analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Ashbala", "user_id": 518038}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Slowking-Galar": {"sets": [{"name": "Assault Vest (Poison)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Assault Vest (Psychic)", "description": "<p>Guarantees a 2HKO on Heatran after Stealth Rock damage.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Pengairxan", "user_id": 622813}]}]}},
  "Forretress": {"sets": [{"name": "Entry Hazard Support (Bug)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Scizor": {
    "sets": [
      {
        "name": "Swords Dance (Bug)",
        "description": "<p>Thanks to its Steel typing, solid bulk, powerful STAB priority, and decent coverage moves, Scizor answers types such as Fairy, Ice, Rock, Ground, and Water. Swords Dance allows Scizor to OHKO the likes of Dragapult and Cyclizar. Technician-boosted Bullet Punch is Scizor's most spammable attack, serving as a priority STAB move to revenge kill sweepers like Belly Drum Azumarill and Flutter Mane. Close Combat answers Steel teams and threaten slower walls like Ting-Lu and Corviknight. Trailblaze allows Scizor to outspeed threats like Great Tusk and Hydreigon at +1 Speed and hits Quagsire and Gastrodon. Fury Cutter provides an additional Technician-boosted STAB move and is mainly used in tandem with Metronome to break Dondozo. Thief offers coverage and allows Life Orb Scizor to answer Gholdengo and 2HKO Skeledirge thanks to the boost from Technician, though Life Orb isn't recommended outside of these scenarios. Alternatively, Metal Coat enhances the power of Bullet Punch without drawbacks. The EV spread maximizes Scizor's damage output and allows it to outspeed uninvested Rotom forms and Adamant Azumarill.</p> <p>Volcarona is the perfect partner for Scizor, as it's less threatened by Fire-types and can sweep through most Steel, Psychic, and Ground teams. It takes care of Pokemon such as Gholdengo and Klefki; in return, Scizor handles Rock-types like Glimmora and Lycanroc-D and weakens the opposing team to facilitate Volcarona's late-game sweep. Slither Wing offers great coverage against types that Scizor struggles to beat, threatening Electric- and Rock-types with Earthquake, Flying- and Water-types with Wild Charge, and Steel-types with Flare Blitz or Close Combat. Similar to Scizor, Lokix gets two powerful STAB priority moves in First Impression and Sucker Punch which, paired with Tinted Lens, allow it to OHKO faster threats like Greninja, Gengar, and Kilowattrel after chip damage. These priority moves, along with Masquerain's Sticky Web support, allow Bug teams to compensate for their generally slower Speed tier. Another good partner to Scizor is Guts Heracross, which can sponge status moves targeting its teammates and sweep through teams that have been weakened by Scizor. With its combination of Sleep Powder and Energy Ball, Vivillon can take out threats that give Bug teams trouble, particularly Dondozo. Rabsca and Forretress provide substantial support; Rabsca's Revival Blessing offers Scizor a second chance at breaking down the opponent's team, while Forretress's entry hazard stacking and Rapid Spin combination allows its teammates to switch in more safely and make holes in the opposing team.</p> "
      },
      {"name": "Choice Band (Bug)", "description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. These will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Swiffix", "user_id": 547532}], "teams": [{"name": "Bug analysis by", "members": [{"username": "Swiffix", "user_id": 547532}]}, {"name": "Quality checked by", "members": [{"username": "CrossHeart", "user_id": 593863}, {"username": "Neko", "user_id": 542526}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Blissey": {"sets": [{"name": "Defensive", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Tyranitar": {"sets": [{"name": "Choice Band (Rock)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Pelipper": {
    "sets": [
      {"name": "Rain Setter (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {
        "name": "Rain Setter (Water)",
        "description": "<p>Pelipper provides rain for Water teams, which enables Barraskewda and wallbreakers like Azumarill and Walking Wake. Hurricane is the STAB move of choice, bypassing the accuracy check in rain while nailing Water-resistant Grass-types, such as Amoonguss, Meowscarada, and Breloom. Roost allows Pelipper to come in multiple times throughout the match to re-set rain if need be. U-turn let's it slow pivot into threats such as Quaquaval and Barraskewda. Knock Off cripples foes, while Surf gives a secondary STAB move boosted by rain, allowing Pelipper to wear down Pokemon like Gholdengo and Kingambit. Heavy-Duty Boots allows it to switch in and set rain even if Stealth Rock is up. An alternative EV spread of 248 HP / 48 Def / 212 Spe with a Timid nature can be used to outspeed Adamant Breloom.</p> <p>Barraskewda is the obvious partner choice thanks to its ridiculous Speed with Swift Swim in rain. It also appreciates Pelipper's slow pivoting with U-turn due to its lack of bulk. Walking Wake is another great rain attacker, since its STAB Dragon-type moves hit most Water-resistant and immune foes, such as opposing Gastrodon and Amoonguss, hard. Quaquaval appreciates Pelipper's slow pivoting to come in safely and can potentially snowball through teams with rain-boosted Aqua Step and Moxie. Quaquaval can also get rid of entry hazards should Pelipper get hit by Knock Off, provided it has Rapid Spin. Gastrodon and Quagsire are also really good partners thanks to their Electric immunities. Both also provide entry hazards, pressuring opponents, and Pelipper can use hazard removal turns to pivot out with U-turn or heal with Roost. Rotom-W can form a VoltTurn core with Pelipper, allowing the team to gain momentum easily and bring in Pokemon fairly safely. Rotom-W can also switch into opposing Electric-types like Magnezone, Iron Hands, and Sandy Shocks if necessary. Toxapex provides a Fighting resistance, a Grass neutrality, and another pivot thanks to its ability, Regenerator. Slowking checks threats such as Indeedee and Walking Wake, and it's another slow pivot thanks to Chilly Reception and Regenerator, bringing Pelipper in safely to set the rain. Both Toxapex and Slowking can also easily pivot into Pelipper with Eject Button, since Regenerator means they won't lose too much health from an attack. Azumarill can take advantage of rain with priority in Aqua Jet, as well as bringing a very strong Water-type STAB move.</p> "
      },
      {"name": "Choice Specs (Water)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "kenn", "user_id": 604741}], "teams": [{"name": "Water analysis by", "members": [{"username": "kenn", "user_id": 604741}]}, {"name": "Quality checked by", "members": [{"username": "Felines", "user_id": 290520}, {"username": "Giyu", "user_id": 574288}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Breloom": {
    "sets": [
      {
        "name": "Focus Sash (Fighting)",
        "description": "<p>Breloom is a solid choice for Fighting teams thanks to Spore alongside super powerful Technician-boosted STAB moves Bullet Seed and Mach Punch, alleviating some of the pressure from the Water and Dark matchups. Spore gives Breloom setup opportunities and impedes otherwise major threats to the team such as Flying-types like Corviknight and Pelipper and Poison-types such as Toxapex, Iron Moth, and Clodsire. Focus Sash guarantees it can use Spore at least once—provided Breloom can keep itself at full HP—and also gives Breloom the opportunity to use Swords Dance as well. Bullet Seed is a fantastic STAB move that threatens Water-types like Dondozo and Quagsire. Mach Punch provides Breloom with a super strong STAB move with priority to not only circumvent its below average Speed but also threatens faster Pokemon such as Meowscarada, Iron Treads, and Cyclizar. Swords Dance allows Breloom to not only power up its STAB moves but takes advantage of the setup opportunities that Spore can provide. Bulldoze, however, can apply pressure to Poison-types such as Skuntank and Toxapex while also putting the foe at a potential Speed disadvantage.</p> <p>Setup sweepers such as Paldean Tauros-F and Lucario appreciate Breloom's ability to potentially impede their checks such as Toxapex, Dondozo, and Quagsire, giving them ample setup opportunities. Paldean Tauros-F handles the Dark matchup fairly easily thanks to it avoiding being burned by Sableye while also resisting Meowscarada's and Chien-Pao's STAB moves. Lucario can threaten Fairy-types such as Flutter Mane and Iron Valiant with its STAB Bullet Punch. Assault Vest Iron Hands is another great partner that can handle the special attacking Fairy-types such as Flutter Mane and Hatterene while also handling Flying-types such as Dragonite and Iron Jugulis which could otherwise threaten Breloom out. Entry hazard control from Great Tusk is imperative to allow Breloom to keep its Focus Sash intact. Great Tusk also helps Breloom by providing Stealth Rock, which racks up chip damage with the switches Breloom can force. Gallade is a great partner that can threaten Poison-types such as Amoonguss and Toxapex. Iron Valiant is another fantastic partner for Breloom, providing Future Sight support to ward off the Poison-types that like to switch into both of Breloom's STAB moves. Its Fairy STAB moves also ease the Dark and Dragon matchups as well as being quite useful in the Fighting mirror.</p> "
      },
      {
        "name": "Focus Sash (Grass)",
        "description": "<p>Thanks to its high Attack, great ability in Technician, and a STAB priority move, Breloom is a staple on Grass teams as a late-game cleaner. Besides boosting Mach Punch, Technician provides Grass teams with powerful Rock-type coverage in its Rock Tomb. These two moves and Focus Sash allow Breloom to handle an assortment of major threats to grass teams, including Volcarona, Chien-Pao, Iron Jugulis, Kilowattrel, Choice Specs Greninja, and Kingambit. With Bullet Seed or Close Combat, it also can function as a good wallbreaker. Spore is an amazing utility move to stop threats and force out Pokemon like Skeledirge. However, with the use of other Spore users like Amoonguss and Toedscruel, Spore can be replaced with Swords Dance. With it, Breloom can set up when opponents predict it will use Spore, increasing its late-game cleaning potential. An Adamant nature is standard, but Jolly Breloom can outspeed Adamant Dragonite, Adamant Cetitan, and Choice Specs Pelipper.</p> <p>Other offensive teammates like Meowscarada and Rotom-C benefit from Breloom forcing out threats with Spore or breaking through Pokemon like Toxapex, Corviknight, or Ting-lu with its high Attack stat and Spore. In exchange, Meowscarada handles Psychic-types such as Gallade and Espathra. Setup Pokemon like Substitute Rotom-C work especially well with Breloom, as they can come in freely on a slept enemy or a physical wall Breloom draws in. The type's more passive defensive Pokemon also support Breloom, with Amoonguss dealing with Fairy-types and Wo-Chien, by using Leech Seed on a foe, allowing chipped Breloom to switch in and restore its Focus Sash protection. Breloom also enjoys Spikes or Toxic Spikes Brambleghast or Toedscruel to chip foes into KO range, including Toxapex and Iron Hands after a Swords Dance. Aurora Veil from Abomasnow can increase Breloom's chances to set up with Swords Dance. Breloom is weak against bulkier Pokemon with multi-hit moves, which can instantly KO it through Focus Sash, like Icicle Spear from Baxcalibur. Thus, entry hazards to wear them down and physical walls, like Body Press Abomasnow, are very important. Once chipped, Breloom's frailty and low Speed make it weak to faster priority users and to other offensive Pokemon not bothered by Mach Punch. To handle the latter, such as Flutter Mane and Paldean Tauros-B, faster teammates like Choice Scarf Meoscarada and Rotom-C can be very helpful.</p> "
      },
      {"name": "Choice Band (Grass)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "kenn", "user_id": 604741}, {"username": "Winemom87", "user_id": 479620}], "teams": [{"name": "Fighting analysis by", "members": [{"username": "kenn", "user_id": 604741}]}, {"name": "Grass analysis by", "members": [{"username": "Winemom87", "user_id": 479620}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}, {"username": "Ashbala", "user_id": 518038}, {"username": "AtraX Madara", "user_id": 513753}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Sableye": {
    "sets": [
      {
        "name": "Stallbreaker (Dark)",
        "description": "<p>Sableye is a good choice for Dark teams due to its Fighting immunity, great array of utility moves such as Will-O-Wisp and Taunt, and reliable recovery, letting it disrupt opposing teams and assist its teammates in either breaking through opposing teams or staving off attacks. Prankster Will-O-Wisp lets Sableye neutralize threats to Dark-type teams such as Great Tusk and Dragonite by burning them before they can make a move. Taunt lets it shut down set up attempts from Pokemon such as Dragon Dance Baxcalibur and Bulk Up Corviknight or hinder opposing defensive Pokemon, such as Toxapex and Clodsire. Taunt also blocks entry hazards from going up, which is huge for Dark due to its lack of entry hazard control. Alternatively, Encore lets Sableye halt the aforementioned setup attempts and gain more momentum from them. Knock Off capitalizes on the switches that Sableye forces by knocking off crucial items from Pokemon such as Toxapex or Dondozo. Alternatively, Night Shade deals steady damage throughout the game. Finally, Recover gives Sableye longevity to continually check the aforementioned threats. Heavy-Duty Boots lets Sableye come in and out without worrying about residual damage from entry hazards.</p> <p>Some great teammates for Sableye include Skuntank and Kingambit, as both of them boast a critical neutrality to Fairy that lets them take hits such as Choice Scarf Iron Valiant's and Flutter Mane's Moonblasts and force both out. In return, Sableye can complement Skuntank's chip damage from Toxic Spikes through its utility moves and ease Kingambit's setup through item removal and spreading burns. Ting-Lu is another good teammate, as it can set entry hazards to further wear away at the opposing team while also acting as an emergency soft check to Fairy-types if it is running Heavy Slam. Reciprocally, Sableye can accentuate the effect of Ting-Lu's entry hazards by removing Heavy-Duty Boots and taking Fighting-type moves such as Slither Wing's and Great Tusk's Close Combats. Chien-Pao, Meowscarada, and Greninja all greatly appreciate Sableye's ability to grind down the opposing team with Knock Off and Will-O-Wisp, while also liking Sableye's ability to hinder walls such as Toxapex and Dondozo and keep entry hazards off the field with Taunt. Lokix is a decent teammate, as it greatly assists in the Dark-type mirror matchup, where Sableye can do nothing due to Prankster being nullified by Dark-types.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Dead by Daylight", "user_id": 571069}], "teams": [{"name": "Dark analysis by", "members": [{"username": "Dead by Daylight", "user_id": 571069}]}, {"name": "Quality checked by", "members": [{"username": "CrossHeart", "user_id": 593863}, {"username": "Ashbala", "user_id": 518038}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Torkoal": {
    "sets": [
      {
        "name": "Sun Setter",
        "description": "<p>Torkoal is an essential member of Fire teams, providing valuable role compression by setting up sun and Stealth Rock, removing entry hazards, and tanking physical attacks. STAB Lava Plume provides decent damage and a high chance to burn, which proves particularly useful against physical attackers like Mimikyu and Iron Hands. Body Press allows Torkoal uses Torkoal's high Defense to heavily damage the likes of Kingambit, Blissey, and Tyranitar, as well as preventing Roaring Moon and Hydreigon from setting up freely. Alternatively, Yawn can be used to force a switch, allowing Torkoal to freely bring a teammate that can benefit from the sun. Heat Rock provides more turns of sun for allies to benefit from, but Heavy-Duty Boots greatly increases Torkoal's longevity. If using the latter, getting fewer turns of sun also allows Fire teams to better manage opposing Protosynthesis sweepers, such as Flutter Mane or Sandy Shocks.</p> <p>Thanks to Chlorophyll and its unique typing, Scovillain pairs well with Torkoal, as the sun allows it to outspeed and KO foes such as Great Tusk, Iron Treads, and Quaquaval. Choice Specs Scovillian can significantly damage to Toxapex with Solar Beam and even 2HKO Clodsire in the sun with Flamethrower. Cinderace is another wallbreaker that thrives under the sun and appreciates Stealth Rock chipping at the opposing team. It can run Court Change, allowing for more entry hazard control if you're running Heat Rock Torkoal, or use a Choice Scarf to defeat foes like Flutter Mane and Choice Specs Greninja. Iron Moth can use sun and Fire Blast to OHKO foes such as Iron Jugulis and Sableye. Ceruledge scares out Flutter Mane, which can otherwise become problematic due to Power Gem and Protosynthesis boosting its Speed in sun. Thanks to its great defensive stats and Unaware, Skeledirge is an amazing partner for Torkoal, handling setup sweepers such as Curse Dondozo and Belly Drum Azumarill for it. Also, sun weakens Water-type moves for Skeledirge and boosts its Torch Song. Rotom-H can tank special hits Torkoal can't withstand from the likes of Iron Valiant, as well as providing a valuable Ground immunity, which allows it to come in on foes such as Clodsire, Sandy Shocks, and Ting-Lu. Volcarona can dismantle Dark-type teams and occasionally weaken physical attackers thanks to Flame Body.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Swiffix", "user_id": 547532}], "teams": [{"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Salamence": {"sets": [{"name": "Choice Scarf (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Staraptor": {
    "sets": [
      {
        "name": "Kamikaze (Normal)",
        "description": "<p>A great addition to Normal-type teams, Staraptor checks threats such as Choice Band Breloom, Great Tusk, Quaquaval, and non-Choice Scarf Iron Valiant and provides muscle power against Steel- and Dragon-type teams. Brave Bird makes short work of the aforementioned Fighting-types, as well as bulky Grass-types like Wo-Chien and Amoonguss, and threatens specially defensive Toxapex and Skeledirge with a 2HKO if they switch into it. Close Combat is what gives Staraptor its amazing wallbreaking potential, OHKOing Kingambit, Chien-Pao, Greninja, and Cyclizar while KOing Baxcalibur after Stealth Rock damage and threatening Iron Treads with a 2HKO. Final Gambit, boosted by 28 HP EVs, OHKOes targets Staraptor wouldn't otherwise beat, such as Rotom-W, physically defensive Toxapex, Hatterene, Klefki, and Forretress after Stealth Rock damage—denying dual screens and/or entry hazards from the last two. Alternatively, Double-Edge threatens checks like Rotom-W and Kilowattrel. Finally, U-turn allows this reckless bird to pivot into a teammate, if there really is nothing else it can do, such as against Gholdengo or Corviknight. Equipping a Choice Scarf will let it outspeed Greninja, Flutter Mane, and Walking Wake, which otherwise force it out, and threaten them instead.</p> <p>A great partner for Staraptor is Hisuian Zoroark. When it uses Illusion to disguise as Staraptor, pairing its Fighting immunity with Staraptor's Ground immunity, an apparent \"Staraptor\" could be immune to either type. This uncertainty completely dismantles Great Tusk. Furthermore, disguised as Staraptor, it can bait in an unsuspecting Corviknight, Gholdengo, or Dondozo to cripple or OHKO it. Maushold is another great partner thanks to Tidy Up, which keeps both Stealth Rock and Reflect off the field for Staraptor to not worry about. Also, its Population Bomb can break through Ting-Lu and non-Rocky Helmet Toxapex for Staraptor. A less prominent partner that also provides hazard removal, as well as Knock Off support, is Cyclizar. With Stealth Rock breaking Sturdy and further advancing Staraptor's wallbreaking, Blissey is another highly appreciated teammate to set it up, provide Healing Wish and Heal Bell support, and check both Sandy Shocks and Choice Scarf Greninja for Staraptor. Indeedee, likewise, offers Healing Wish support, as well as checking Poison-types like Toxapex and Glimmora that Staraptor struggles with. Lastly, making good use of Staraptor's U-turn, Ditto is a teammate that can turn a bleak situation into a winning one, copying setup sweepers such as Dragonite and Chien-Pao to reverse sweep opponents.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Petele", "user_id": 548107}], "teams": [{"name": "Normal analysis by", "members": [{"username": "Petele", "user_id": 548107}]}, {"name": "Quality checked by", "members": [{"username": "Ashbala", "user_id": 518038}, {"username": "Giyu", "user_id": 574288}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Gastrodon": {
    "sets": [
      {
        "name": "The Slug (Ground)",
        "description": "<p>Gastrodon's great bulk, typing, and ability allow it to function as a sturdy mixed wall and check to Water-types for Ground teams, letting Clodsire use Unaware. Earth Power targets Gholdengo, Iron Moth, and Skeledirge, while Earthquake deals more damage to Clodsire and Flutter Mane. Ice Beam hits Dragonite, Garchomp, and Kilowattrel. Alternatively, Clear Smog may be used to prevent Espathra and Dondozo from setting up, while Chilling Water eases matchups against physical attackers such as Quaquaval, Scizor, and Iron Treads. Stealth Rock and Spikes are interchangeable depending on what its teammate Ting-Lu is using. Gastrodon prefers maximum Defense investment to check Pokemon like Barraskewda and Quaquaval; however, an EV spread of 252 HP / 68 Def / 188 SpD with a Bold nature can be used to prevent a 2HKO from Choice Specs Greninja's Ice Beam.</p> <p>Gastrodon's immunity to Water-type attacks and ability to set entry hazards is heavily appreciated by Clodsire, Great Tusk, and Garchomp. Clodsire completes the hazard stack core with Toxic Spikes and answers threats such as Meowscarada and Flutter Mane as well as setup sweepers like Hydreigon, Volcarona, and Gholdengo due to Unaware. Choice Scarf Great Tusk outpaces and deals with threats such as Choice Specs Flutter Mane, Baxcalibur, and Gallade; furthermore, Great Tusk removes Heavy-Duty Boots from common users like Sableye, Amoonguss, and Brambleghast with Knock Off, enhancing Gastrodon's hazard stacking. Garchomp's Fire-type coverage is valued for threatening roadblocks such as Corviknight, Amoonguss, and Breloom, and Sandy Shocks checks Water-types like Pelipper, Quaquaval, and Slowking as well as Corviknight. Iron Treads removes hazards with Rapid Spin, easing Gastrodon's pivoting if its held item were removed, and checks Fairy-types like Flutter Mane, Mimikyu, and Giga Drain Hatterene. Ting-Lu aids in setting hazards and wears down common pivots with Ruination and Whirlwind, taking advantage of both Pokemon's hazards.</p> "
      },
      {"name": "Specially Defensive (Water)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Ground analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Felines", "user_id": 290520}]}, {"name": "Grammar check by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Skuntank": {
    "sets": [
      {
        "name": "Specially Defensive (Poison)",
        "description": "<p>Skuntank fills a very important role on Poison teams by packing a much-desired Psychic immunity, which allows it to switch into Psychic-type moves from many common threats such as Greninja, Flutter Mane, and Hatterene. It proceeds to force them out with its hard hitting Poison Jab-which can spread poison around, while Sucker Punch picks them off should they be weakened enough. Protect is also very valuable in scouting their coverage moves, letting Skuntank accumulate Black Sludge recovery, and stalling out poison damage. Aftermath punishes contact attackers like Kingambit and Azumarill, which allows teammates such as Toxicroak to safely come in and finish them off. Skuntank can run Play Rough to threaten common Dark-types of the metagame, such as Chien-Pao and Hydreigon.</p> <p>Physically defensive Amoonguss and Toxapex are valuable teammates that deal with the physical attackers that threaten Skuntank, like Mimikyu, Quaquaval, and Dondozo. Amoonguss also deals with threatening Ground-types such as Great Tusk, Quagsire, and Sandy Shocks thanks to its good bulk, Grass-type STAB move, and Ground neutrality. Toxapex, on the other hand, deals with threats like Chien-Pao, Cloyster, and Scizor with Infestation and Haze while laying down Toxic Spikes. Specially defensive Clodsire complements Skuntank by dealing with special attackers it can't handle by itself, such as Gholdengo, Magnezone, and Volcarona. Iron Moth deals with the multitude of Steel-types like Gholdengo, Iron Treads, and Corviknight that Skuntank can't do much against. Corrosion Glimmora and Salazzle help cripple Steel-types and opposing Poison-types with Toxic, with each also providing different utilities; Glimmora packs Poison's only entry hazard removal thanks to Mortal Spin, which allows Skuntank to come in safely, while Salazzle's Encore acts as a counterplay against powerful setup sweepers such as Volcarona and Kingambit.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Pengairxan", "user_id": 622813}], "teams": [{"name": "Poison analysis by", "members": [{"username": "Pengairxan", "user_id": 622813}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}, {"username": "Mateeus", "user_id": 321991}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Garchomp": {"sets": [{"name": "Entry Hazard Support (Dragon)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Lucario": {"sets": [{"name": "Swords Dance (Fighting)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Toxicroak": {"sets": [{"name": "Swords Dance (Fighting)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Abomasnow": {"sets": [{"name": "Hail Setter (Ice)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Magnezone": {"sets": [{"name": "Choice Specs (Electric)", "description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. These will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Gallade": {"sets": [{"name": "Choice Scarf (Psychic)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Choice Scarf (Fighting)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Froslass": {"sets": [{"name": "Entry Hazard Lead (Ice)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Rotom-Wash": {
    "sets": [
      {
        "name": "Nasty Plot (Electric)",
        "description": "<p>Rotom-W is a great Nasty Plot sweeper for Electric teams due to Levitate and its bulk, which lets it greatly ease the Ground matchup. Stored Power deals with Unaware and Water Absorb users such as Quagsire and Clodsire, letting it threaten the entirety of Ground teams in conjunction with Hydro Pump. Substitute lets it avoid status and take advantage of passive Pokemon such as Klefki and Toxapex, eases prediction, and forces its checks such as Greninja and Ting-Lu to take damage. The given EV spread prevents Rotom-W's Substitute from breaking to Clodsire's Poison Jab while outspeeding threats such as Gholdengo and Kleavor.</p> <p>Teammates such as Choice Scarf Sandy Shocks and Iron Hands love Rotom-W's ability to deal with or wear down bulky Pokemon such as Clodsire and Gastrodon, allowing them to clean up types like Poison and Water late-game. In return, Choice Scarf Sandy Shocks deals with fast threats such as Choice Specs Greninja, Flutter Mane, and Scovillain, while Iron Hands pressures matchups such as Dark and Dragon due to its sheer bulk and coverage in Ice Punch. Pawmot can revive Rotom-W with Revival Blessing, which allows it to take more risks. Additionally, Pawmot has good coverage moves in Seed Bomb and Ice Punch, which lets it break down types such as Water, Flying, and Ground alongside Rotom-W. Choice Specs Kilowattrel deals with fast threats such as Choice Specs Iron Valiant, Choice Specs Greninja, and Volcarona, removes Grass-types like Amoonguss and Breloom, and pivots Rotom-W in with Volt Switch or U-turn. Assault Vest users such as Magnezone and Eelektross deal with special attackers such as Flutter Mane, Hatterene, and Greninja for Rotom-W they also tend to invite in passive Pokemon, which provide it more setup opportunities.</p> "
      },
      {"name": "Physically Defensive (Electric)", "description": "<p>48 Speed EVs outspeeds Azumarill.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Nasty Plot (Water)", "description": "<p>Outspeeds Adamant Scizor, 144 HP alongside 112 Def lets its Substitute not be broken by Clodsire's Poison Jab.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Neko", "user_id": 542526}], "teams": [{"name": "Electric analysis by", "members": [{"username": "Neko", "user_id": 542526}]}, {"name": "Quality checked by", "members": [{"username": "CrossHeart", "user_id": 593863}, {"username": "Ashbala", "user_id": 518038}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Heatran": {
    "sets": [{"name": "Choice Scarf (Steel)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Specially Defensive (Steel)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Stallbreaker (Fire)", "description": "<p>Heavy Slam OHKOs Flutter Mane.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}],
    "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "Neko", "user_id": 542526}]}]}
  },
  "Samurott-Hisui": {"sets": [{"name": "Choice Scarf (Water)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "TheRealBigC", "user_id": 532450}]}]}},
  "Lilligant-Hisui": {"sets": [{"name": "Victory Dance (Fighting)", "description": "<p>Sleep Powder may be considered to improve setup opportunities.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Dead by Daylight", "user_id": 571069}]}]}},
  "Zoroark-Hisui": {
    "sets": [
      {
        "name": "Utility (Ghost)",
        "description": "<p>Hisuian Zoroark is essential on Ghost teams due to its immunity to opposing Ghost-type moves, favorable Speed, and unique ability. It is an incredible asset in the Ghost matchup, as it allows you to play mind games against an opponent using Flutter Mane and Dragapult by disguising itself as Gholdengo and takes advantage of Substitute by forcing a lot of switches. Hex in conjunction with Will-O-Wisp deals superb damage against threats like Flutter Mane, Amoonguss, and Quagsire and negates passive recovery on walls such as Corviknight, Toxapex, and Ting-Lu. Furthermore, Will-O-Wisp lets you play around Sucker Punch users like Kingambit and burns other physical attackers such as Scizor that pose a threat to teammates like Flutter Mane and Mimikyu. Knock Off further cripples the aforementioned walls and removes Heavy-Duty Boots from foes, enhancing Brambleghast's Spikes, while Nasty Plot allows Hisuian Zoroark to capitalize on Substitute and use passive walls such as Toxapex, Brambleghast, and Dragalge as setup fodder. Leftovers and 252 HP EVs let Hisuian Zoroark take full advantage of Substitute and potentially sustain a few neutral attacks.</p> <p>Flutter Mane appreciates Hisuian Zoroark luring in walls like Clodsire, Gastrodon, and Amoonguss and wearing them down with Hex and Will-O-Wisp. In return, it removes threatening Dark-types like Chien-Pao, Greninja, and Iron Jugulis. Dragapult checks Hydreigon, Baxcalibur, and Gholdengo and pivots into Hisuian Zoroark with U-turn. Gholdengo threatens Fairy-types such as Iron Valiant, Hatterene, and Flutter Mane and supports Hisuian Zoroark's Hex with Thunder Wave. Hisuian Zoroark also likes to disguise itself as the previously mentioned Dragapult and Gholdengo due to them also using Substitute and Hex, potentially tricking opponents and forming a very formidable Hex spam core. Mimikyu aids against Dark-types like Kingambit and Roaring Moon and provides useful priority in Shadow Sneak. Additionally, Mimikyu appreciates Hisuian Zoroark withering down and burning the majority of opposing teams, letting Mimikyu clean up late-game without any complications. Brambleghast helps Hisuian Zoroark chip down opposing teams with Spikes, removes entry hazards with Rapid Spin, and checks Water-types such as Rotom-W, Slowking, and Barraskewda. Skeledirge walls setup sweepers such as Volcarona and Mimikyu as well as general threats like Iron Valiant, Scizor, and Magnezone.</p> "
      },
      {
        "name": "Choice Specs (Normal)",
        "description": "<p>Hisuian Zoroark is a crucial member of any good Normal team, offering good power along with an invaluable immunity to Fighting, letting it take attacks such as Choice Band Breloom's Mach Punch and Choice Scarf Iron Valiant's Close Combat that would otherwise threaten the type. Additionally, it can win the Ghost matchup with good prediction, which is a type that Normal teams usually struggle against. Trick lets Hisuian Zoroark ruin defensive answers, such as Toxapex and Ting-Lu, that would otherwise take its attacks with ease. Flamethrower allows Hisuian Zoroark to hit Steel-types like Corviknight and Iron Treads more reliably than Focus Blast, while Grass Knot hits Dondozo, which would otherwise take Hisuian Zoroark's attacks. Focus Blast lets Hisuian Zoroark eliminate troublesome Dark-types such as Hydreigon and Ting-Lu. Illusion lets Hisuian Zoroark bait in defensive answers to other threats, such as Corviknight and Toxapex switching into Maushold, and hinder them with Trick while also giving it a safe opportunity to switch into Fighting-type attacks.</p> <p>Maushold greatly appreciates Hisuian Zoroark's ability to remove Ghost- and Steel-types, alongside its ability to hinder and remove Rocky Helmet from Pokemon such as Toxapex and Corviknight, to enable it to clean up with Population Bomb. In return, Maushold can remove entry hazards with Tidy Up and break through answers to Hisuian Zoroark such as the aforementioned Toxapex and Ting-Lu. Choice Scarf Staraptor is another great partner, as it provides a safe switch-in to Choice Scarf Great Tusk, which tends to lock into Headlong Rush, while dealing high amounts of damage itself to enable Hisuian Zoroark to clean up the rest of an opponent's team. It also provides a form of speed control against faster threats such as Dragapult. Cyclizar also provides a safe switch-in with Shed Tail while keeping hazards off the field with Rapid Spin. In return, Hisuian Zoroark can use these switch-in opportunities to hit the aforementioned Steel-types hard. Ditto can turn setup attempts on a Choice-locked Hisuian Zoroark on their heads, while Blissey can take strong special hits such as Sandy Shocks's STAB moves. Indeedee provides Psychic Terrain support to improve Hisuian Zoroark's matchup against Kingambit, and it can also use a Choice Scarf to deal with fast threats such as Choice Specs Iron Valiant and Choice Scarf Flamigo and provide Healing Wish support.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}, {"username": "Dead by Daylight", "user_id": 571069}], "teams": [{"name": "Ghost analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Normal analysis by", "members": [{"username": "Dead by Daylight", "user_id": 571069}]}, {"name": "Quality checked by", "members": [{"username": "Swiffix", "user_id": 547532}, {"username": "maroon", "user_id": 305839}, {"username": "Neko", "user_id": 542526}, {"username": "Giyu", "user_id": 574288}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "deetah", "user_id": 297659}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Amoonguss": {
    "sets": [
      {"name": "Mixed Wall (Grass)", "description": "<p>Survives Choice Specs Greninja's Ice Beam.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {
        "name": "Physically Defensive (Poison)",
        "description": "<p>Amoonguss provides Poison teams with breathing room against Ground-type attacks from behemoths like Choice Scarf Great Tusk, Garchomp, and Choice Scarf Sandy Shocks due to its status as the only viable Poison team option with a Ground neutrality, which helps it form a defensive core alongside Toxapex and Skuntank. Growth lets Amoonguss threaten Ground teams by breaking through Water Absorb Clodsire after enough boosts. Alternatively, Toxic or Spore may be used to double Stomping Tantrum's power against Steel- and Poison-types like Gholdengo and Gengar that can pivot into Amoonguss and use it as setup fodder. Giga Drain and Synthesis provide Amoonguss with ample recovery to sustain itself in the Water and Ground matchups. A Relaxed nature is used to not dampen the power of Amoonguss's Stomping Tantrum, while Defense EVs are prioritized to help against physical Ground-types like Choice Scarf Great Tusk and Iron Treads.</p> <p>Toxapex forms an effective physically defensive Regenerator core alongside Amoonguss, as it deals with Fire- and Ice-types such as Paldean Tauros-F and Chien-Pao that give Amoonguss trouble while wearing down the opposing team with a combination of Toxic Spikes and Rocky Helmet. Skuntank deals with Psychic- and Ghost-types such as Espathra and Flutter Mane and uses Sucker Punch to pick off threats such as Dragapult late-game. It can also run Fire Spin to trap and forcibly remove Hatterene—a Pokemon that greatly threatens Amoonguss and prevents Skuntank from setting Toxic Spikes against Fairy and Psychic teams with ease. Unaware Clodsire is a specially defensive wall that deals with nearly all special attackers including Volcarona, Hydreigon, and non-Psyshock Flutter Mane. It also sets Spikes, which Amoonguss benefits from due to its ability to force switches, and is able to heavily damage Kingambit in a pinch. Glimmora provides entry hazard support by setting Stealth Rock and can use Toxic in combination with Corrosion to debilitate Steel- and Poison-types that Amoonguss hates such as Corviknight and Toxapex. It can remove entry hazards with Mortal Spin, which helps with Amoonguss's longevity in case its Heavy-Duty Boots have been removed, and is also the primary way of dealing with Skeledirge. Iron Moth can don a Choice Scarf to deal with boosted threats such as Swords Dance Chien-Pao and Dragon Dance Baxcalibur, which shatter Poison teams, or run a Substitute set to better deal with Kingambit. Both Glimmora and Iron Moth can also run Air Balloon, which is greatly appreciated when up against Choice Specs Sandy Shocks or Choice Band Great Tusk, as these two have a good chance to overwhelm Amoonguss in the long run.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Neko", "user_id": 542526}], "teams": [{"name": "Poison analysis by", "members": [{"username": "Neko", "user_id": 542526}]}, {"name": "Quality checked by", "members": [{"username": "Aqua Jet", "user_id": 531302}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Hydreigon": {
    "sets": [
      {
        "name": "Nasty Plot (Dragon)",
        "description": "<p>Hydreigon's great stats, unresisted coverage, and useful ability let it serve as an excellent wallbreaker on Dragon teams, checking threats like Gholdengo, Iron Treads, and Toxapex. Dark Pulse targets Ghost- and Psychic-types such as Gholdengo, Gengar, and Armarouge. Flamethrower threatens Steel-types like Iron Treads, Corviknight, and Kingambit, while Earth Power aids in the Poison matchup, hitting Clodsire, Skuntank, and Toxapex. Alternatively, Flash Cannon may be used to threaten Fairy-types like Flutter Mane, Iron Valiant, and Gardevoir behind Substitute. Substitute alongside Leftovers makes Hydreigon difficult to revenge kill and offers more setup opportunities against passive Pokemon such as Amoonguss, Klefki, and Forretress. Alternatively, Taunt prevents Ting-Lu from phazing Hydreigon with Whirlwind as well as obstructing Clodsire, Dondozo, and Gastrodon's recovery attempts. Draco Meteor is a niche option to OHKO opposing Dragon-types like Baxcalibur and Dragalge; however, Draco Meteor negates Nasty Plot boosts and requires Hydreigon to give up useful utility.</p> <p>Hydreigon's ability to break past physical walls such as Quagsire, Skeledirge, and Dondozo is heavily appreciated by Baxcalibur and Dragonite. In return, Baxcalibur checks Clodsire, Dragonite, and opposing Hydreigon, while Dragonite threatens Quaquaval and Cinderace. Cyclizar sets up Shed Tail for non-Substitute Hydreigon, allowing for more setup opportunities and freeing up a moveslot for Hydreigon. Furthermore, Cyclizar removes Stealth Rock off the field with Rapid Spin, preserving Hydreigon's ability to set up. Dragapult combats Flutter Mane, Gallade, and opposing Dragon-types, while Hydreigon forces Kingambit off the field and switches into Shadow Sneak from Brambleghast and Ceruledge. Garchomp sets up entry hazards to enhance Hydreigon's wallbreaking capabilities and helps to take care of Clodsire and Volcarona. Dragalge is valued as a check to Fairy-types like Flutter Mane and Iron Valiant as well as an entry hazard setter, aiding in the Dark and Fairy matchups with Toxic Spikes.</p> "
      },
      {"name": "Choice Scarf (Dragon)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Nasty Plot (Dark)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Dragon analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "Swiffix", "user_id": 547532}, {"username": "sasha", "user_id": 510532}]}, {"name": "Grammar check by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Volcarona": {
    "sets": [
      {
        "name": "The Original Moth (Bug)",
        "description": "<p>Volcarona performs as a solid late-game setup sweeper for Bug teams, threatening to sweep any unprepared team thanks to Quiver Dance. Flamethrower is the go-to STAB move for Volcarona, as it hits Steel- and Ice-types such as Corviknight, Gholdengo, and Chien-Pao. Optionally, Fiery Dance can be used over Flamethrower, which has an additional effect of boosting Special Attack, but Flamethrower is preferred due to a higher Base Power. Psychic primarily covers Poison-types like Toxapex, Glimmora, and Iron Moth, but it also hits Fighting-types such as Quaquval and Great Tusk. Morning Sun provides reliable recovery, which allows Volcarona to further set up and threaten to sweep. Alternatively, Giga Drain targets Water- and Ground-type Pokemon such as Quagsire, Greninja, and Gastrodon. Bug Buzz can be used over Psychic to hit Dark- and Psychic-types such as Hydreigon, Ting-Lu, and Espathra. Heavy-Duty Boots keeps Volcarona safe from entry hazards, while Flame Body debilitates physical attackers. A Timid nature allows Volcarona to outspeed Choice Scarf Flamigo after a single Quiver Dance boost.</p> <p>Volcarona and Scizor make a great pair, as Scizor—thanks to its Steel-typing—helps Volcarona by switching into Toxic from Clodsire, and it deals with Rock-types such as Tyranitar and Lycanroc thanks to Bullet Punch. Volcarona appreciates entry hazard support from Forretress, which pressures and wears down the opposing team. Choice Scarf Heracross helps against Steel- and Dark-types—such as Iron Treads and Kingambit—and Flying-types—like Kilowattrel—with Close Combat and Stone Edge, respectively; in return, Volcarona helps deal with Corviknight, which Heracross struggles to break. Slither Wing threatens Flying- and Water-types such as Iron Jugulis, Pelipper, and Greninja with Wild Charge, and threatens Corviknight with Flare Blitz. It can safely pivot in Volcarona, enabling its sweep. Both Slither Wing and Heracross pressure specially defensive walls such as Clodsire and Blissey, which Volcarona struggles to break. Lokix helps against Ghost-, Psychic- and Dark-types like Skeledirge, Espathra, Armarouge, Meowscarada, and Greninja thanks to First Impression, Throat Chop, and Sucker Punch. Volcarona appreciates Sticky Web support from Masquerain or Spidops to deal with Choice Scarf Pokemon such as Iron Treads and Iron Moth.</p> "
      },
      {"name": "Bulky Quiver Dance (Bug)", "description": "<p>These are the sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. These will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {
        "name": "Quiver Dance (Fire)",
        "description": "<p>A potent offensive presence, Volcarona's access to Quiver Dance provides the backbone to its sweeping capabilities. Bug Buzz is Volcarona's main attacking option and can be combined with Swarm to increase damage as Volcarona loses HP while setting up, allowing Volcarona to OHKO checks like offensive Garchomp after one Quiver Dance. Psychic is essential, as it allows Volcarona to hit one of Fire's strongest checks, Toxapex, but also super effectively damages Poison-types and Fighting-types such as Glimmora and Quaquaval. The last slot is interchangeable, though generally Flamethrower is preferred as a STAB move that can also take advantage of sun support on Fire teams and is essential to for the Flying matchup, allowing it to hit Corviknight and Kilowattrel. Giga Drain can be used to give Volcarona a better chance of breaking through Water and Ground teams and give it a recovery option. Similarly, Morning Sun gives Volcarona more setup opportunities. Flame Body can also be used to threaten burns on Pokemon such as Kingambit and Dragonite, which oftentimes revenge kill Volcarona. Given its all-around solid defensive stats, Volcarona finds a myriad of opportunities to set up and takes advantage of the maximum Speed spread given to capitalize on the boosts as much as possible, outspeeding Pokemon such as Choice Scarf Great Tusk or Choice Scarf Dragapult after one or two Quiver Dances boosts, respectively</p> <p>Generally, Volcarona is best saved for mid- to late-game, when the opposing team has been chipped down and Volcarona has an opportunity to sweep after setting up. Utilizing its offensive teammates such as Scovillian, Cereludge, Cinderace, and Paldean Tauros-F to slowly chip down defensive walls such as Dodonzo, Ting-Lu, and Blissey provides better opportunity for Volcarona to sweep later in the game. Paldean Tauros-F is specifically useful with its ability to remove dual screens, preventing Volcarona's setup from being hindered. Rotom-H also provides excellent support, aiding in the Water matchup if Giga Drain is not used and providing pivot support to switch Volcarona in. Skeledirge and Talonflame provide defensive support to wear down offensive threats such as Dragonite. Torkoal providing sun support on Fire aids Volcarona, not only increasing Flamethrower's damage output, but giving Volcarona the opportunity to survive attacks like Choice Specs Greninja's Surf, giving it an opportunity to set up.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ashbala", "user_id": 518038}, {"username": "Azick", "user_id": 468541}], "teams": [{"name": "Bug analysis by", "members": [{"username": "Ashbala", "user_id": 518038}]}, {"name": "Fire analysis by", "members": [{"username": "Azick", "user_id": 468541}]}, {"name": "Quality checked by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "CrossHeart", "user_id": 593863}, {"username": "Neko", "user_id": 542526}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Tornadus-Therian": {"sets": [{"name": "Nasty Plot", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Giyu", "user_id": 574288}]}]}},
  "Thundurus-Therian": {"sets": [{"name": "Offensive Pivot (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Nasty Plot (Electric)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Giyu", "user_id": 574288}]}]}},
  "Landorus": {"sets": [{"name": "Wallbreaker (Ground)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Nasty Plot (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Giyu", "user_id": 574288}]}]}},
  "Landorus-Therian": {
    "sets": [
      {"name": "Choice Scarf (Ground)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Bulk Up (Flying)", "description": "<p>Substitute isn't broken by Amoonguss's Foul Play or Giga Drain.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Pivot (Flying)", "description": "<p>Outspeeds Glimmora.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Choice Scarf (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [], "teams": [{"name": "Ground Set by", "members": [{"username": "RoyalReloaded", "user_id": 246753}]}]}
  },
  "Meloetta": {"sets": [{"name": "Choice Specs (Normal)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Ultraman1", "user_id": 598658}]}]}},
  "Greninja": {
    "sets": [
      {
        "name": "Choice Specs (Dark)",
        "description": "<p>Greninja is a staple for Dark teams thanks to its blitzing Speed tier that outpaces Cinderace and Iron Valiant. Protean + Choice Specs allows it to take full advantage of its coverage moves to OHKO and 2HKO common threats. Hydro Pump 2HKOes specially defensive Corviknight after Stealth Rock; however, Surf is a safer option while still OHKOing Iron Valiant after Stealth Rock. Ice Beam targets threats such as Dragonite and Clodsire. Grass Knot can 2HKO Ting Lu and Gastrodon while OHKOing Dondozo after Stealth Rock. Extrasensory targets Poison- and Fighting-types such as Toxapex and Quaquaval.</p> <p>Meowscarada forms a dual Protean core with Greninja to break each other's checks; Greninja can break Toxapex for Meowscarada, while Meowscarada can break Iron Hands for Greninja. Chien-Pao and Greninja form a dangerous core that shatters teams without a proper Ice-resistant Pokemon. Chien-Pao is also capable of breaking Steel-types such as Kingambit with Sacred Sword. Kingambit can take on Fairy-type Pokemon for Greninja, such as Flutter Mane and Hatterene, while it can break past physical walls such as Quagsire in return. Ting-Lu can stack Stealth Rock and Spikes allowing Greninja to more easily score OHKOs such as against Corviknight and Dondozo and take care of Hatterene and Flutter Mane with Heavy Slam for Greninja. Sableye switches into Fighting-type attacks such as Great Tusk's Close Combat; additionally, it can block Rapid Spin, keeping entry hazards up for Greninja. Skuntank is amazing in the Fairy matchup, as it can check threats such as Choice Scarf Iron Valiant and trap Klefki with Fire Spin. Skuntank also absorbs and sets Toxic Spikes for Greninja.</p> "
      },
      {
        "name": "Choice Specs (Water)",
        "description": "<p>Thanks to a wide array of coverage options alongside Protean, Choice Specs Greninja is a devastating special wallbreaker that can dismantle several types, including Grass, Ground, Water, and Poison. Its naturally high Speed tier is invaluable to outpace and threaten fast foes such as Iron Valiant and Sandy Shocks. Aside from hitting Psychic- and Ghost-types like Bronzong and Gholdengo, Dark Pulse's lack of immunities makes it a spammable attack that can be used to muscle past neutral Pokemon such as Corviknight with flinches. Ice Beam covers a large portion of the metagame, including Dragon, Ground, Grass, and Flying teams, decimating prominent foes like Hydreigon, Clodsire, Amoonguss, and Iron Jugulis. It's also Greninja's hardest hitting attack against Skuntank, which is important in the Poison matchup. Extrasensory pressures Poison- and Fighting-types like Toxapex and Assault Vest Iron Hands and prevents Greninja from being picked off by Breloom's Mach Punch. Grass Knot rounds out its coverage, significantly damaging Ting-Lu, Iron Treads, and Water-types such as Gastrodon and Dondozo.</p> <p>Choice Specs Greninja appreciates being paired with other wallbreakers like Barraskewda and Quaquaval that can handle Normal and Steel teams. They break through bulky Pokemon like Blissey and Kingambit that Greninja struggles with; they are also potent late-game cleaners that enjoy Greninja's ability to threaten Storm Drain Gastrodon and their physically defensive checks like Amoonguss, Toxapex, Slowbro, and Dondozo. Moreover, Barraskewda under rain excels at tearing down fast offensive teams that Greninja can struggle with, as it can threaten out Meowscarada, boosted Volcarona, and Choice Scarf Iron Moth. Quaquaval can also run Rapid Spin to let Greninja enter the field multiple times to wallbreak without worry, preventing it from being chipped down into KO range of priority attacks like Dragonite's Extreme Speed, Scizor's Bullet Punch, and Baxcalibur's Ice Shard. Pivot support from Slowking is helpful to bring Greninja in safely on foes like Dragalge and Gastrodon, letting it fire off attacks freely. Defensive teammates such as Toxapex, Dondozo, Gastrodon, and Quagsire can switch into potential revenge killers like Meowscarada, Chien-Pao, Dragapult, and Slither Wing, respectively; notably, Gastrodon and Quagsire also provide entry hazards to take advantage of the countless switches that Greninja forces, putting the likes of Ting-Lu, Toxapex, and Assault Vest Iron Hands into Greninja's KO range, as well as switch into and check Electric-types such as Choice Scarf Sandy Shocks and Assault Vest Iron Hands.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}, {"username": "maroon", "user_id": 305839}], "teams": [{"name": "Dark analysis by", "members": [{"username": "maroon", "user_id": 305839}]}, {"name": "Water analysis by", "members": [{"username": "royalfluxh", "user_id": 493260}]}, {"name": "Quality checked by", "members": [{"username": "maroon", "user_id": 305839}, {"username": "Neko", "user_id": 542526}, {"username": "Ashbala", "user_id": 518038}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ken", "user_id": 594478}, {"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Hawlucha": {"sets": [{"name": "Swords Dance (Fighting)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Goodra-Hisui": {
    "sets": [{"name": "Specially Defensive (Dragon)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Specially Defensive (Steel)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Assault Vest (Steel)", "description": "<p>Outspeeds Adamant Azumarill.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}],
    "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "Neko", "user_id": 542526}]}]}
  },
  "Klefki": {
    "sets": [
      {
        "name": "Dual Screens (Fairy)",
        "description": "<p>Klefki is a popular choice for Fairy-type teams due to Prankster, dual screens, and Spikes. This set excels at enabling setup sweepers such as Mimikyu and Azumarill providing them with boosted bulk and chipping the opposing team thanks to Spikes. With maximum HP and Defense EVs and Foul Play, Klefki efficiently counters opposing Swords Dance and Dragon Dance sweepers such as Scizor and Dragonite. Alternatively, it can use Thunder Wave to cripple fast threats like Flutter Mane and Iron Valiant. Klefki’s Steel typing also provides a useful immunity against Poison-type teams and blocks Glimmora's Mortal Spin, ensuring that entry hazards remain on the opposing field.</p> <p>Belly Drum Azumarill is an excellent partner for Klefki, as the dual screens greatly facilitate setting up with Belly Drum and sweeping opposing teams. Additionally, Spikes provide some chip damage to ensure OHKOs on foes like Meowscarada. Choice Specs Flutter Mane can also take advantage of the chip damage from Klefki's Spikes to power through teams and more easily defeat walls such as Toxapex, Quagsire, and Amoonguss. Calm Mind Flutter Mane benefits both dual screens to set up and sweep and from Thunder Wave slowing down threats like Barraskewda. Iron Valiant appreciates Klefki slowing down faster foes like Flutter Mane, Cinderace, and Dragapult with Thunder Wave, allowing it to defeat them. Iron Valiant also provides a much-needed offensive pressure against Steel-types like Kingambit and works as a devastating offensive core when paired with Flutter Mane. Hatterene and Klefki form a strong defensive core, with the former’s Magic Bounce punishing any attempt from Pokemon such as Ting-Lu and Forretress to set entry hazards, while the latter can come in on Poison-type moves, potentially forcing a switch on a Choice locked Pokemon like Greninja in the process. The additional bulk that Hatterene receives from the dual screens even allows it to take a stand against foes such as Glimmora, Clodsire, and Toxapex, preventing them from setting their hazards while countering them.</p> "
      },
      {"name": "Dual Screens (Steel)", "description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. These will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Swiffix", "user_id": 547532}], "teams": [{"name": "Quality checked by", "members": [{"username": "Aqua Jet", "user_id": 531302}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Hoopa-Unbound": {
    "sets": [{"name": "Choice Band (Dark)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Choice Scarf (Psychic)", "description": "<p>Ice Punch OHKOs Landorus while Drain Punch OHKOs Chien-Pao.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Substitute (Psychic)", "description": "<p>Outspeeds Kingambit.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}],
    "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}]}]}
  },
  "Volcanion": {"sets": [{"name": "Water Absorb (Fire)", "description": "<p>96 Speed EVs outspeeds Adamant Azumarill, but 172 Speed EVs may be used to outspeed Jolly Azumarill, though that nature is not preferred on Azumarill.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Wallbreaker (Water)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "iBones", "user_id": 475928}, {"username": "Giyu", "user_id": 574288}]}]}},
  "Lycanroc-Dusk": {"sets": [{"name": "Choice Band (Rock)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Toxapex": {
    "sets": [
      {
        "name": "Physically Defensive (Water)",
        "description": "<p>Thanks to its typing and its incredible bulk, Toxapex is able to check many physical attackers in Monotype such as Meowscarada and Quaquaval. Safety Goggles allows it to avoid Spore and check Breloom, which otherwise would overwhelm Water-type teams. Its Poison-type STAB moves hit Grass- and Fairy-types such as Breloom and Iron Valiant for super effective damage while also spreading poison to chip down switch-ins such as Great Tusk and Garchomp. Poison Jab can hit Hatterene and Flutter Mane harder than Sludge Bomb. Recover allows Toxapex to remain healthy, while Haze prevents foes such as Volcarona and Quaquaval from setting up. Toxic can be used to stall out foes such as the aforementioned Volcarona and Quaquaval, and it can punish switch-ins that can try to use Toxapex as setup fodder such as Dragapult. Toxic Spikes can punish teams without entry hazard removal such as Dark and Fairy. Black Sludge can be used for passive recovery, and Rocky Helmet can be used to wear down physical attackers such as Chien-Pao. Eject Button can be an option on rain teams to get free pivoting to wallbreakers such as Floatzel and Barraskewda.</p> <p>Quaquaval is a great teammate that can remove hazards to keep Toxapex healthy. Dondozo and Quagsire can help Toxapex deal with setup sweepers such as Chien-Pao and Dragapult. Quagsire and Gastrodon provide a useful Electric immunity and can stack entry hazards up along with Toxapex. Rotom-W can check Ground-types for Toxapex. In exchange, Toxapex can switch on Grass-type Pokemon such as Breloom and Meowscarada. Slowking can fulfil a pivoting core on Water teams and check Psychic-types such as Indeedee and Armarouge. Toxapex's inability to hit Steel-types such as Kingambit and Iron Treads can be very huge, so teammates that do well against them such as Quaquaval and Greninja are great partners.</p> "
      },
      {"name": "Physically Defensive (Poison)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Mixed Wall (Water)", "description": "<p>Is not 2HKO'ed by Thunder Punch from non-Choice Band Meowscarada or Thunderbolt from Choice Scarf Flutter Mane.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "AtraX Madara", "user_id": 513753}], "teams": [{"name": "type analysis by", "members": [{"username": "AtraX Madara", "user_id": 513753}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Mimikyu": {
    "sets": [
      {
        "name": "Swords Dance (Fairy)",
        "description": "<p>Mimikyu is one of Fairy's premier setup sweepers thanks to Disguise near guaranteeing one free turn to set up Swords Dance to boost its Attack. Play Rough is Mimikyu's strongest STAB move and allows Mimikyu to secure a OHKO on Iron Hands after a Swords Dance and also deals with bulky Great Tusk. Shadow Sneak lets Mimikyu revenge kill weakened offensive threats like Iron Moth and faster Ghost-type Pokemon such as Flutter Mane and Dragapult. Shadow Claw lets Mimikyu break past bulkier Ghost-type Pokemon such as Gholdengo and Skeledirge more readily compared to Shadow Sneak, while Drain Punch is an alternative that threatens opposing Steel-types such as Magnezone and Kingambit. Mimikyu's preferred item is Life Orb to boost its damage output as much as possible.</p> <p>One of Mimikyu's best partners on Fairy teams is Klefki. Mimikyu appreciates Spikes from Klefki, which allows Mimikyu to take down Pokemon easier after a Swords Dance boost. In return, Mimikyu can block Rapid Spin, allowing Klefki's hazards to stay up during the course of the game. Flutter Mane is often paired with Mimikyu since it can threaten physically defensive pokemon that give Mimikyu a hard time like Amoonguss, Quagsire, and Forretress and also faster offensive threats like Iron Moth and Kilowattrel. Mimikyu is able to break through specially defensive Pokemon like Dragalge which gives Flutter Mane an easier time. Hatterene is also a good partner for Mimikyu, as it can bounce back debilitating status conditions like Will-O-Wisp from Sableye and Thunder Wave from Klefki and also bounces back hazards, which helps with Mimikyu's longevity since it runs Life Orb. Furthermore, Mimikyu with its Disguise up can check opposing Ghost-type Pokemon like Flutter Mane and Gholdengo for Hatterene. Iron Valiant is also one of Mimikyu's best offensive teammates, as special sets are able to threaten other physically defensive Pokemon like Dondozo. Additionally, Iron Valiant is useful for Mimikyu in the Ground matchup, where a Choice Specs set can check answers to Mimikyu, such as Quagsire and Clodsire, using Psyshock. Azumarill can use Belly Drum against Steel teams and weaken foes like Orthworm and revenge kill Iron Treads with Aqua Jet.</p> "
      },
      {
        "name": "Swords Dance (Ghost)",
        "description": "<p>Mimikyu is a staple on Ghost-type teams, as Disguise allows it to deal with Dark-types and faster threats such as Barraskewda. Swords Dance can further take advantage of Disguise. Play Rough threatens Dark- and Fighting-types such as Meowscarada, Krookodile, and Quaquaval. Shadow Sneak picks off faster threats that could otherwise revenge kill Mimikyu, such as Dragapult and Flutter Mane. Drain Punch helps against Steel-types like Kingambit and offers some recovery—Disguise's recoil, entry hazards, and Life Orb damage can wear Mimikyu down pretty easily. Wood Hammer can potentially be used over Drain Punch to hit Pokemon such as Quagsire better, but the recoil damage isn't appreciated. Mimikyu's mediocre Attack forces it to use Life Orb to significantly damage neutral targets.</p> <p>All of Mimikyu's teammates appreciate its ability to take on Dark-type teams. Froslass and Brambleghast can place Spikes to help Mimikyu clean up and use Taunt or Rapid Spin, respectively, so opposing entry hazards don't wear it down. Choice Scarf Flutter Mane helps Mimikyu against both Dark- and Dragon-type teams by taking down faster threats that could KO it after Disguise has been removed, such as Meowscarada and Chien-Pao, which resist Shadow Sneak. Nasty Plot Gholdengo deals with bulkier teams like Ground and Poison teams, as well as absorbing Toxic from bulky walls such as Toxapex. Furthermore, Gholdengo can also run Trick with a Choice item, which can cripple annoying walls such as Quagsire and Dondozo to help Mimikyu deal with them. Polteageist can clean up Poison teams after Skuntank is KOed, as well as Ground, Water, and Fighting teams. Spiritomb can tank some Dark-type attacks so that Mimikyu needn't waste Disguise's protection. Skeledirge can take some hits from foes like Iron Valiant and Dragalge for the same benefit. Dragapult can use a Dragon Dance set to boost against faster Pokemon that threaten Mimikyu, such as Iron Moth.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TTK", "user_id": 307004}, {"username": "AtraX Madara", "user_id": 513753}], "teams": [{"name": "Fairy analysis by", "members": [{"username": "TTK", "user_id": 307004}]}, {"name": "Ghost analysis by", "members": [{"username": "AtraX Madara", "user_id": 513753}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "maroon", "user_id": 305839}, {"username": "Ashbala", "user_id": 518038}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Cinderace": {
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<p>Cinderace is a valuable asset to Fire teams due to its mix of offensive presence and utility. Pyro Ball lets Cinderace threaten out Sableye trying to take High Jump Kick on Dark-type teams while also dealing high amounts of general damage under sun. Libero-boosted High Jump Kick provides valuable coverage, notably hitting Ting-Lu trying to set entry hazards while dealing large amounts of damage to Pokemon with a Fire resistance trying to switch in on its Pyro Ball, such as Hydreigon and Garganacl. Low Kick is an alternative, letting Cinderace deal decent damage to most heavy foes such as Ting-Lu and Iron Hands without the large risk of High Jump Kick's crash damage. Court Change lets Cinderace force the opposing team to deal with their own hazards while making it unlikely that hazards go up again. U-turn lets Cinderace keep momentum against foes it cannot threaten out like defensive Great Tusk and Garchomp. Alternatively, Sucker Punch lets Cinderace pick off weakened threats such as Flutter Mane and Baxcalibur. Heavy-Duty Boots lets Cinderace come in repeatedly to remove hazards without worrying about residual damage from them.</p> <p>Rotom-H is a great teammate for Cinderace, as its Ground immunity lets it come in on Great Tusk while threatening Water-types such as Toxapex and Dondozo—that Cinderace can't do much against—with its Electric-type STAB moves. Additionally, Rotom-H can beat Poison teams with its Substitute + Nasty Plot set, which Cinderace greatly appreciates. In return, Cinderace can pivot Rotom-H in with U-turn and keep Stealth Rock off its side of the field. Torkoal is another good teammate for Cinderace, as it provides sun to boost Cinderace's Pyro Ball damage to astronomical levels, provides entry hazard support to chip switch-ins, threatens Chien-Pao and physical Dragapult with a burn, and supplies a secondary source of hazard removal. In return, Cinderace can threaten out Ting-Lu, which might try to switch into Torkoal, while also keeping hazards off against Ghost teams. Scovillain deals with the aforementioned Water-types as well as Gastrodon while appreciating Cinderace removing the hazards that hurt Scovillain's longevity. Volcarona appreciates Cinderace chipping away at the opposing team, facilitating an endgame sweep. In return, Volcarona can hit Dark-types such as Ting-Lu and Hydreigon hard with Bug Buzz, ruin Gastrodon through Giga Drain, and damage Poison-types such as Iron Moth, Toxapex, and Glimmora with Psychic. Skeledirge is able to come in on physical hits like Iron Hands's Earthquake and force it out with the threat of a burn. Finally, Ceruledge can remove Ghost-types such as Dragapult that Cinderace can't do much against. In return, Cinderace can eliminate Dark-types and keep hazards off the field for both.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Dead by Daylight", "user_id": 571069}], "teams": [{"name": "Quality checked by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "Aqua Jet", "user_id": 531302}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Corviknight": {
    "sets": [
      {
        "name": "Defog (Flying)",
        "description": "<p>Corviknight has easily cemented itself as a staple on Flying teams, acting as an extremely versatile defensive wall that can also remove entry hazards for its teammates. Iron Head allows Corviknight to handle Flutter Mane and other Fairy-types such as Mimikyu and Hatterene. Body Press hits Chien-Pao, Kingambit, and other Dark- and Steel-types hard. On the other hand, U-turn safely brings in stronger attackers like Dragonite, Iron Jugulis, and Kilowattrel, providing extra counterplay against Pokemon such as Volcarona and Gholdengo, which commonly switch into Corviknight. Pressure is the preferred ability for PP stalling Stealth Rock, while Mirror Armor counters Flutter Mane and Hatterene, which would otherwise overwhelm Corviknight with Mystical Fire. With the listed EV spread and a Careful nature, Corviknight avoids a 2HKO from Flutter Mane's Shadow Ball while guaranteeing Iron Head OHKOes Flutter Mane in return. The remaining EVs are put into Defense to ease its matchup against physical threats such as Chien-Pao, Kingambit, and Baxcalibur.</p> <p>Corviknight's capability to take on many offensive threats combined with its Steel typing makes it a stellar asset that almost any offensive Pokemon benefits from. For instance, Iron Jugulis appreciates Corviknight removing Flutter Mane, and Flamigo struggles with Ice Shard variants of Chien-Pao, which Corviknight can safely switch into. Dragonite greatly benefits from Corviknight's ability to soak up Ice-, Fairy-, and Dragon-type attacks while also covering Corviknight's weaknesses to Fire- and Electric-types such as Cinderace, Magnezone, and Volcarona. Gyarados can also act as a reliable wincon against types like Fire and Ground while also making Chien-Pao significantly more managable with Intimidate. Additionally, Kilowattrel is a great offensive pivot to pair with Corviknight, as it removes threats that could harm Corviknight like Greninja, Volcarona, and Azumarill while also absorbing Electric-type attacks. In return, Corviknight counters Iron Treads and Ting-Lu, which threaten Kilowattrel. Pelipper can be paired with Kilowattrel and Corviknight to form a potent rain core that softens the impact of Fire moves and gives Kilowattrel a Water-type Weather Ball, OHKOing many Fire-types that annoy Corviknight including Skeledirge and Rotom-H. Corviknight appreciates having Talonflame as an alternative option against physical attackers, as Talonflame is able to hold off Chien-Pao and burn Great Tusk, Iron Hands, and Dragonite, tremendously easing Corviknight's role.</p> "
      },
      {"name": "Bulk Up (Steel)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Snapteryx", "user_id": 588449}], "teams": [{"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}, {"username": "Ashbala", "user_id": 518038}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Drednaw": {
    "sets": [
      {
        "name": "Shell Smash (Rock)",
        "description": "<p>Drednaw is a fierce setup sweeper, capable of turning the tide against unfavorable matchups like Ground, Steel, and Water. Stone Edge is Drednaw's hardest hitting move, dealing with Chien-Pao, Pelipper, and Dragonite. Liquidation hits troublesome Ground-types like Great Tusk, Iron Treads, and Ting-Lu. Earthquake threatens Water Absorb Clodsire, Toxapex, and Kingambit, while Strong Jaw-boosted Crunch nails switch-ins such as Slowbro, Brambleghast, and Bronzong. Swift Swim is preferred to aid Rock in the matchup against Water rain teams; however, Strong Jaw allows Drednaw to muscle through the aforementioned roadblocks when using Crunch. Air Balloon improves Drednaw's performance in the Ground matchup, allowing for more setup opportunities, while White Herb retains Drednaw's defensive stats to have an improved chance against priority move users like Azumarill, Mimikyu, and Kingambit.</p> <p>Garganacl's ability to pressure Gastrodon, Quagsire, and Corviknight with Salt Cure is heavily appreciated, easing Drednaw's time sweeping. Glimmora's colorful movepool allows it to check a myriad of threats like Breloom, Meowscarada, and Iron Valiant with Sludge Wave, Great Tusk, Quagsire, and Quaquaval using Energy Ball, Gholdengo, Toxapex, and Toxicroak with Earth Power, and finally Hydreigon, Chien-Pao, and Gallade using Dazzling Gleam. Choice Band Tyranitar heavily dents walls such as Corviknight, Slowbro, and Toxapex and sets up sand to increase Drednaw's bulk. Lycanroc aids in the Dark matchup due to its useful coverage in Close Combat and Play Rough and takes out faster foes like Chien-Pao and Flutter Mane with Accelerock. Coalossal provides entry hazards in Spikes and Stealth Rock, removes entry hazards with Rapid Spin, and helps against Gholdengo and Meowscarada due to its Fire typing.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Rock analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "Swiffix", "user_id": 547532}, {"username": "sasha", "user_id": 510532}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Barraskewda": {"sets": [{"name": "Swift Swim (Water)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Hatterene": {
    "sets": [
      {
        "name": "Calm Mind (Psychic)",
        "description": "<p>With its good bulk, Calm Mind, Magic Bounce, and secondary Fairy typing, Hatterene serves as a strong wincon versus types such as Dark and Dragon that otherwise threaten Psychic-type teams. Psyshock is Hatterene’s hardest-hitting move against special walls such as Dragalge and Clodsire. Draining Kiss provides useful coverage against Dark- and Dragon-types and meaningful recovery. Mystical Fire hits Steel-types that otherwise stonewall Hatterene, while Nuzzle supports its teammates by spreading paralysis. The given EV spread lets Hatterene outspeed Toxapex, which could otherwise clear its Calm Mind boosts with Haze.</p> <p>Hatterene struggles with breaking through Pokemon that can handle its STAB attacks and coverage, with Steel-types being a notable example. Because of this, Armarouge is a wonderful partner for Hatterene, as it can pressure the aforementioned Steel-types while also not having to worry about entry hazards due to Hatterene's Magic Bounce. Espathra forms a strong offensive core with Hatterene that can threaten a wide range of types such as Water, Dragon, and Ground once Hatterene breaks down Espathra's checks. This core can be enabled further by setting up dual screens with Scream Tail. Indeedee and Gallade ease pressure from Ghost- and Dark-types, respectively. The former's Psychic Surge can power up Hatterene's Psyshock, and the latter can check Steel-types for Hatterene thanks to its strong Fighting-type STAB attacks.</p> "
      },
      {
        "name": "Calm Mind (Fairy)",
        "description": "<p>Hatterene is a near-essential Pokemon on Fairy teams thanks to Magic Bounce and its Psychic typing, only further bolstered by its wide setup and support coverage that allows it to remove Pokemon like Toxapex, Clodsire, and Chien-Pao. Magic Bounce is especially notable, as it is the only form of entry hazard denial for Fairy teams. Calm Mind turns Hatterene into a deadly sweeper, notably stopping unboosted Flutter Mane from OHKOing it, instead OHKOing Flutter Mane in return after a single boost with Psyshock and letting Hatterene overheal Ting-Lu's Earthquake with Draining Kiss. Psyshock also lets Hatterene break through Unaware Clodsire, Dragalge, and Assault Vest Iron Hands, whereas Psychic 2HKOes Amoonguss and Toxapex as well as generally hitting targets for more damage overall. Draining Kiss gives Hatterene much-needed recovery, allowing it to heal against neutral and super effective targets, notably Dark-types like Chien-Pao and Ting-Lu. It can even beat Heavy Slam Ting-Lu with Reflect support from Klefki and Grimmsnarl. Mystical Fire threatens Steel-types like Scizor, Pressure Corviknight, and Gholdengo, which would otherwise safely switch into Hatterene and force it out. Alternatively, Giga Drain allows Hatterene to surprise foes like Gastrodon and Quagsire with an OHKO and generally allows Hatterene to win the Ground- and rainless Water-type matchups alone with minimal support; it can even be used sometimes over Draining Kiss depending on the team's needs, although the amount of HP regained is substantially less. Nuzzle can be used over Mystical Fire or Giga Drain to better support the team via paralysis. The given EVs let Hatterene outspeed an uninvested Toxapex so it can attack before its Calm Mind boosts are removed by Haze, with the rest of the EVs put into Defense to maximize bulk. If preferred, however, 204 Special Attack EVs and a Modest nature can be used instead to have increased offensive potential, although at the cost of being more reliant on dual screens support; most notably, this lets Psyshock often OHKO Clodsire and Psychic always 2HKO both Unaware Clodsire and Quagsire. Heavy-Duty Boots is also an option over Leftovers as to more safely switch in when entry hazards are up, either from those that Hatterene could not block or simply was too pressured to switch into, although this does remove a large source of longevity.</p> <p>Dual screens support from Klefki and Grimmsnarl is almost essential, as it allows Hatterene to be much more aggressive with its Calm Mind boosts and switch-in opportunities. These teammates also provide extra support in Spikes from the former and both Taunt and Parting Shot from the latter, and in return, they can use Hatterene to block entry hazards from being set up, especially from Bombirdier and Ting-Lu. Flutter Mane and Iron Valiant can remove threats to Hatterene like Gholdengo, Skeledirge, Kingambit, and Chien-Pao as to facilitate setup opportunities for Hatterene, and they can rely on Hatterene to block hazards, especially Stealth Rock and Spikes. Tinkaton can neutralize Fairy- and Poison-type threats like Flutter Mane, Mimikyu, opposing Tinkaton, and Skuntank, which would otherwise impede on Hatterene's sweep, and set Stealth Rock and spread paralysis via Thunder Wave to ease sweeping opportunities further. Trick support from Iron Valiant and Gardevoir also helps Hatterene sweep, as this prevents bulkier Pokemon like Unaware Clodsire and Quagsire, Toxapex, and Dondozo from healing any damage taken and instead becoming setup fodder. Gardevoir also helps in the rain and sun matchups, as Trace copying Swift Swim and Chlorophyll removes the burden that Barraskewda, Floatzel, and Scovillain place by outspeeding and OHKOing all three. Azumarill and Mimikyu can support Hatterene as extra sweepers in order to overload the enemy's defensive core and majorly help in the Steel-type matchup that Hatterene dreads so much, notably pressuring Iron Treads, Kingambit, Corviknight, and Gholdengo.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "CrossHeart", "user_id": 593863}, {"username": "Clas", "user_id": 545372}], "teams": [{"name": "Psychic Analysis by", "members": [{"username": "CrossHeart", "user_id": 593863}]}, {"name": "Fairy analysis by", "members": [{"username": "Clas", "user_id": 545372}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Ashbala", "user_id": 518038}, {"username": "Giyu", "user_id": 574288}, {"username": "Aqua Jet", "user_id": 531302}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Grimmsnarl": {
    "sets": [
      {
        "name": "Dual Screens (Dark)",
        "description": "<p>Grimmsnarl's access to Prankster, as well as Reflect and Light Screen, makes it invaluable on hyper offensive variants of Dark teams and as a way to take on opposing Dark teams. Prankster lets Grimmsnarl set up priority Reflect and Light Screen, making it easier for teammates to set up. Grimmsnarl's access to Parting Shot allows it to bring in a teammate immediately, but Taunt is also a viable option to prevent Defog and opposing leads setting up entry hazards. Thunder Wave also can be used as a form of speed control. Spirit Break lets Grimmsnarl threaten opposing Dark-type setup sweepers such as Hydreigon and Chien-Pao that may leverage their Prankster immunity to set up on Grimmsnarl. Grimmsnarl should be used aggressively early-game to capitalize on its teammates' sweeping potential.</p> <p>Teammates such as Swords Dance Chien-Pao, Nasty Plot Hydreigon, Swords Dance Kingambit, and Dragon Dance Roaring Moon all appreciate Grimmsnarl reducing the damage they take while setting up with dual screens. Entry hazard setters like Ting-Lu can be useful to help wear down opposing defensive Pokemon so that Grimmsnarl's teammates can sweep. Choice Scarf Meowscarada is appreciated for being able to revenge kill Pokemon such as Great Tusk and Iron Valiant. Chien-Pao and Kingambit can utilize Grimmsnarl's dual screens to break through opposing teams, and Hydreigon can break through Steel-types that may threaten Grimmsnarl out. Greninja can threaten out Cinderace and prevent it from using Court Change while also being able to revenge kill Iron Valiant.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}], "teams": [{"name": "Dark analysis by", "members": [{"username": "Taka", "user_id": 595062}]}, {"name": "Quality checked by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "Neko", "user_id": 542526}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Frosmoth": {"sets": [{"name": "Quiver Dance (Bug)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Ultraman1", "user_id": 598658}]}]}},
  "Indeedee": {"sets": [{"name": "Choice Scarf (Normal)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Dragapult": {
    "sets": [
      {
        "name": "Choice Specs (Dragon)",
        "description": "<p>As the fastest unboosted Pokemon in the Monotype metagame, Choice Specs Dragapult is an excellent offensive threat that deals with Flutter Mane, Iron Valiant, and Greninja for Dragon teams. Draco Meteor and Shadow Ball are helpful against a variety of types lacking the necessary immunities and can be used to decimate types such as Dark, Flying, Fairy, and Ghost. Flamethrower roasts Steel-types such as Corviknight and Scizor without the risk of getting stalled by Pressure, and Thunderbolt nails Toxapex and Dondozo and cleans Water teams late-game. Alternatively, U-turn brings in team mates like Baxcalibur, Garchomp, and Hydreigon, which take advantage of common switch-ins such as Ting Lu, Clodsire, and Kingambit. Infiltrator lets Dragapult bypass dual screens, which is sorely needed to properly deal with Flutter Mane.</p> <p>Since Dragapult excels at cleaning teams with its natural speed, wallbreakers like Nasty Plot Hydreigon, Baxcalibur, and Choice Band Haxorus, as well as entry hazard setters such as Garchomp and Dragalge are excellent teammates. Dragonite loves Dragapult's ability to wear down or outright remove Steel-, Water-, and Ghost-types such as Klefki, Toxapex, and Skeledirge, allowing it to clean up types such as Fairy, Water, and Fire with a Dragon Dance or Choice Band set. Choice Scarf users like Baxcalibur, Hydreigon, and Roaring Moon are appreciated, as these deal with opposing Choice Scarf users such as Gallade and Gholdengo, which revenge kill Dragapult with ease. Cyclizar provides entry hazard removal and can pass a Shed Tail to Dragapult, allowing it to get in the field safely.</p> "
      },
      {
        "name": "Dragon Dance (Ghost)",
        "description": "<p>Dragon Dance gives Dragapult the ability to not just boost its fantastic Speed to new heights, allowing it to outspeed fast Choice Scarf users such as Meowscarada and Roaring Moon, but also beef up its decent Attack stat. Dragon Darts is a reliable, hard-hitting Dragon-type STAB move that allows Dragapult to break Breloom's Focus Sash and Dragonite's Multiscale. Phantom Force is Dragapult's best choice for Ghost-tpye STAB move, as otherwise it is walled by any Fairy- or Steel-type, while Disable can disrupt Choice-locked Pokemon from potentially breaking its Substitute or attacking Dragapult in general. Substitute allows Dragapult to ease prediction and also adds a layer of protection against status moves, allowing it to set up on more passive Pokemon such as Toxapex and Amoonguss. It also synergizes well with Disable, allowing Dragapult to set up with ease. Will-O-Wisp is another option over Disable to allow Clodsire and Quagsire to become setup bait, while also crippling Kingambit and Ting-Lu; however, Disable is more consistent. Leftovers allows Dragapult to use Substitute multiple times throughout a game and be more annoying overall with Disable, while Dragon Fang is a good choice to boost Dragon Darts.</p> <p>Skeledirge is a fantastic partner, as it can wall Fairy-types such as Choice Scarf Iron Valiant and Hatterene while also threatening foes like Kingambit that can easily take out Dragapult with their STAB priority moves. Gholdengo is another fantastic partner that can threaten Fairy-types like Klefki and Flutter Mane, if Gholdengo uses a Choice Scarf, and take care of physical walls such as opposing Skeledirge. Brambleghast is another good partner, as it can keep entry hazards off of the field, allowing Dragapult to come in multiple times, as well as providing Spikes support to soften up Steel-types such as Gholdengo and Iron Treads. Hisuian Zoroark provides the team with not just a Ghost immunity, but also can easily use Illusion to disguise itself as Dragapult and lure in foes that would normally threaten it, such as Kingambit, Chien-Pao, and opposing Dragapult, to open up for a potential Dragapult sweep. Flutter Mane is another great partner thanks to its ability to handle opposing Dragon-types such as Baxcalibur, Roaring Moon, and Walking Wake. It can also provide immediate speed control if need be to take care of other Choice Scarf users that could revenge kill Dragapult before it gets a Dragon Dance up. Mimikyu is an amazing wallbreaker that can either help wear down physical walls for Dragapult to clean up or can take advantage of Dragapult punching holes in the opponent's team to clean up itself. Mimikyu can also heavily threaten opposing Ghost-types for Dragapult like Choice Scarf Flutter Mane, Dragapult, and Choice Scarf Gholdengo thanks to its STAB priority in Shadow Sneak. It also provides a one-time check to setup sweepers such as Chien-Pao and Kingambit thanks to its ability Disguise.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Neko", "user_id": 542526}, {"username": "kenn", "user_id": 604741}], "teams": [{"name": "Dragon analysis by", "members": [{"username": "Neko", "user_id": 542526}]}, {"name": "Ghost analysis by", "members": [{"username": "kenn", "user_id": 604741}]}, {"name": "Quality checked by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "Ashbala", "user_id": 518038}, {"username": "Neko", "user_id": 542526}, {"username": "Felines", "user_id": 290520}]}, {"name": "Grammar checked by", "members": [{"username": "Dead by Daylight", "user_id": 571069}, {"username": "autumn", "user_id": 384270}, {"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Urshifu-Rapid-Strike": {"sets": [{"name": "Swords Dance (Water)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Havens", "user_id": 391540}]}]}},
  "Zarude": {"sets": [{"name": "Swords Dance (Grass)", "description": "<p>Decent in the Steel matchup. Black Glasses lets it 2HKO Skeledirge with Crunch.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Neko", "user_id": 542526}]}]}},
  "Regieleki": {"sets": [{"name": "Entry Hazard Support", "description": "<p>28 Atk EVs may be invested if using Wild Charge to OHKO Flutter Mane.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Havens", "user_id": 391540}]}]}},
  "Regidrago": {"sets": [{"name": "Choice Specs", "description": "<p>Modest nature guarantees the 2HKO on Corviknight with Dragon Energy.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Ultraman1", "user_id": 598658}]}]}},
  "Glastrier": {"sets": [{"name": "Swords Dance", "description": "<p>240 Speed EVs outspeeds Corviknight.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "Neko", "user_id": 542526}]}]}},
  "Spectrier": {"sets": [{"name": "Nasty Plot", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Calm Mind", "description": "<p>200 Speed EVs outspeeds Choice Band Meowscarada, 16 HP EVs in tandem with 140 Def EVs prevents Spectrier's Substitute from being broken by special walls such as Assault Vest Iron Hands and Ting-Lu.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Neko", "user_id": 542526}]}]}},
  "Kleavor": {"sets": [{"name": "Choiced Attacker (Rock)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Choice Scarf (Bug)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "MikuChan", "user_id": 466388}]}]}},
  "Ursaluna": {"sets": [{"name": "Guts Wallbreaker (Normal)", "description": "<p>144 Speed EVs may be used to outpace Corviknight and 2HKO it with Fire Punch. This Speed investment also lets Ursaluna outspeed Pokemon with a similar speed tier as it, such as Kingambit, Iron Hands, and Azumarill.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "iBones", "user_id": 475928}]}]}},
  "Basculegion": {"sets": [{"name": "Choice Band (Water)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "TheRealBigC", "user_id": 532450}]}]}},
  "Basculegion-F": {"sets": [{"name": "Swift Swim (Water)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Ultraman1", "user_id": 598658}]}]}},
  "Sneasler": {"sets": [{"name": "Unburden Sweeper (Poison)", "description": "<p>Night Slash with Close Combat lets Sneasler make quick work of Steel teams, while Acrobatics lets it greatly damage Great Tusk. Gunk Shot lets Sneasler OHKO Amoongus and Rotom-W at +2.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Choice Scarf (Fighting)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "Neko", "user_id": 542526}]}]}},
  "Overqwil": {"sets": [{"name": "Entry Hazard Support (Poison)", "description": "<p>56 Spe EVs outspeeds Jolly Azumarill.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "TheRealBigC", "user_id": 532450}]}]}},
  "Enamorus": {
    "sets": [
      {"name": "Mixed Attacker (Fairy)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Contrary Attacker (Fairy)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Choice Scarf (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Mixed Attacker (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}, {"username": "DreamPrince", "user_id": 274634}, {"username": "Giyu", "user_id": 574288}]}]}
  },
  "Enamorus-Therian": {"sets": [{"name": "Calm Mind (Fairy)", "description": "<p>The last moveslot can utilize Grass Knot to beat Unaware Quagsire or Substitute to avoid status, but being able to make progress against Steel-types like Heatran is generally preferred.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "MikuChan", "user_id": 466388}]}]}},
  "Meowscarada": {
    "sets": [
      {
        "name": "Choice Scarf (Dark)",
        "description": "<p>Meowscarada is a fantastic revenge killer for any Dark team due to its great Speed, coverage moves, and ability in Protean. Flower Trick makes Meowscarada a great late-game cleaner against Ground and Water teams, or just in general, taking out threats such as Great Tusk, Greninja, and Flutter Mane. Knock Off can target Ghost- and Psychic-type Pokemon, such as Gholdengo and Espathra, while removing items from walls such as Toxapex's Black Sludge, Klefki's Light Clay, and Skeledirge's Heavy-Duty Boots. Play Rough allows Meowscarada to clean through weakened Dragon teams, and it's a useful move late-game against other Dark teams. Alternatively, Meowscarada can run Toxic Spikes to cripple foes such as Great Tusk. U-turn picks up momentum for its team on forced switches, for example against Greninja. Choice Scarf plus its Speed and Protean allows it to take on threats such as Greninja, Choice Scarf Great Tusk, and Choice Specs Flutter Mane.</p> <p>Greninja and Meowscarada can break through each other's checks: Greninja can beat Toxapex and Corviknight for Meowscarada, while Choice Scarf Meowscarada can revenge kill Flutter Mane for Greninja. Chien-Pao can prevent walls such as Toxapex from healing with Taunt, allowing Meowscarada to better pressure Water teams; it can also pressure Flying- and Dragon-types for Meowscarada, beating threats such as Dragonite. Chien-Pao can also break past walls such as Clodsire and Amoonguss for Meowscarada. Kingambit is an incredible late-game sweeper, picking off faster threats like Choice Scarf Flutter Mane with Sucker Punch, and it beats down Fairy-types such as Hatterene for Meowscarada. In return, Meowscarada can pick off Iron Valiant, allowing Kingambit to better pressure Fairy teams. Ting-Lu sets Stealth Rock and Spikes, allowing Meowscarada to clean more easily late-game. Additionally, it can check slower Pokemon such as Toxapex, Corviknight, and Clodsire with Taunt alongside Earthquake or Ruination. It can also stomach strong special attacks such as Choice Specs Flutter Mane's Moonblast, OHKOing Flutter Mane in return with Heavy Slam. Sableye can switch into Fighting-type attacks for Meowscarada, such as Great Tusk's Close Combat, and either cripple their users with Prankster Will-O-Wisp or force them to switch with Prankster Encore. Sableye can also prevent Pokemon like Clodsire and Brambleghast from setting entry hazards thanks to Prankster Taunt. Skuntank can ease the Fairy matchup by beating Hatterene one-on-one, which lets Meowscarada set Toxic Spikes safely. It can also trap Klefki with Fire Spin, preventing dual screens from staying on the field for too long. Finally, Hydreigon can take on walls such as Toxapex for Meowscarada with Substitute + Nasty Plot, safely setting up and overpowering them.</p> "
      },
      {
        "name": "Choice Scarf (Grass)",
        "description": "<p>Meowscarada finds itself as the best revenge killer to threatening setup sweepers such as Dragonite, Hydreigon, and Armarouge available to Grass teams thanks to its good offensive stats paired with a strong ability in Protean. This is further supported by a great Speed tier, which allows it to serve as a strong cleaner in multiple matchups such as versus Water, Fighting, Dark and Ghost teams with a Choice Scarf. Flower Trick enables Meowscarada to break through Defense boosted Pokemon such as Curse Dondozo, as well as Pokemon behind dual screens such as Flutter Mane. Play Rough provides the Fairy coverage that enables Meowscarada to threaten Fighting, Dragon, and Dark teams. U-turn is used to allow Meowscarada to pivot out against checks to it, such as Toxapex and Skeledirge, to bring in a teammate that can break through it, such as Breloom and Toedscruel, while also maintaining momentum.</p> <p>While Meowscarada is an effective cleaner, it cannot exactly break through certain Pokemon by itself. Choice Band Breloom is a great teammate for Meowscarada, as it can break through Meowscarada's checks such as Toxapex, Kingambit, and Clodsire. Meowscarada is also vulnerable to Pokemon with strong priority and revenge killers faster than it such as Breloom and Choice Scarf Flutter Mane. Defensive walls such as Amoonguss and Wo-Chien can switch into said priority attacks and revenge killing attempts for Meowscarada. Amoonguss in particular also removes Toxic Spikes, which can be useful for Meowscarada and its teammates. Brambleghast and Toedscruel provide entry hazard removal in Rapid Spin, while also setting up hazards of their own in Spikes. Abomasnow gives an important Ice neutrality to Grass teams, which in tandem with the Defense boost provided by Snow allows it to serve as an answer to Ice-type threats such as Chien-Pao and Baxcalibur. Swords Dance Iron Leaves and Rotom-C provide counterplay to Corviknight that Grass teams otherwise lack, with the former appreciating Meowscarada pivoting out to it when facing Poison-types such as Dragalge and Toxapex, threatening Poison teams in general with its Psychic-type STAB moves and Fighting-type coverage attacks, while the latter forms a pivoting core with Meowscarada.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "CrossHeart", "user_id": 593863}, {"username": "maroon", "user_id": 305839}], "teams": [{"name": "Dark analysis by", "members": [{"username": "maroon", "user_id": 305839}]}, {"name": "Grass analysis by", "members": [{"username": "CrossHeart", "user_id": 593863}]}, {"name": "Quality checked by", "members": [{"username": "sasha", "user_id": 510532}, {"username": "Neko", "user_id": 542526}, {"username": "Ashbala", "user_id": 518038}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Skeledirge": {
    "sets": [
      {
        "name": "Physically Defensive (Fire)",
        "description": "<p>Skeledirge is a great choice for Fire teams as a non-passive physically defensive wall. With Will-O-Wisp and Unaware, it can check physical set-up sweepers such as Dragon Dance Dragonite or Belly Drum Azumarill that threaten Fire. Additionally, Torch Song lets Skeledirge fire back against these threats while raising its Special Attack and reducing passitivity. Hex pairs incredibly well with Will-O-Wisp, as it threatens large amounts of damage on burned foes, while Shadow Ball is a more consistent STAB option that hits opposing Skeledirge for more immediate damage. Heavy-Duty Boots lets Skeledirge avoid entry hazards chipping away at it whenever it switches in.</p> <p>Volcarona is a great teammate for Skeledirge, as it can threaten Dark-types that annoy Skeledirge such as Ting-Lu and Kingambit. In return, Skeledirge can burn physical attackers, like Dragonite, giving Volcarona more setup opportunities. Paldean Tauros-F is also a good teammate, since it can threaten the aforementioned Dark-types with its Fighting STAB while also having Intimidate to help neutralize physical attackers that Skeledirge cannot handle on its own, such as Roaring Moon. Additionally, its Choice Scarf set can outspeed and KO Greninja. Torkoal pairs well with Skeledirge due to its ability to both remove entry hazards with Rapid Spin and set them up, all while also powering up Skeledirge's Torch Song. Cinderace is a fairly good partner as well due to High Jump Kick, letting it remove Dark-types aiming to threaten Skeledirge, while also being able to remove entry hazards with Court Change and hit Poison-types such as Clodsire and Toxapex with Zen Headbutt. Scovillain is a good partner, since it can remove Water-types such as Dondozo and Rotom-W with its Grass STAB. Both Talonflame and Air Balloon Iron Moth alleviate Skeledirge's weakness to threats such as Great Tusk and Ting-Lu.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Dead by Daylight", "user_id": 571069}], "teams": [{"name": "Fire analysis by", "members": [{"username": "Dead by Daylight", "user_id": 571069}]}, {"name": "Quality checked by", "members": [{"username": "Felines", "user_id": 290520}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Quaquaval": {
    "sets": [
      {"name": "Choice Scarf (Fighting)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {
        "name": "Rapid Spin (Water)",
        "description": "<p>Quaquaval is a great pick for Water teams due to its unique access to Rapid Spin, threatening presence in the Steel and Dark matchups, and potential to snowball unsuspecting teams. Close Combat targets Steel- and Dark-types like Kingambit, Chien-Pao, and Hydreigon. Alternatively, Brick Break may be used to retain Quaquaval's defensive stats and clear dual screens in the Ice and Fairy matchups at the cost of extra damage. Aqua Step enables Quaquaval to function as a potential late-game cleaner and threatens Pokemon like Volcarona, Skeledirge, and Unaware Clodsire. Rapid Spin is used to clear entry hazards, aiding against entry hazard-stacking teams. The given EV spread allows Quaquaval to outpace Flutter Mane and Chien-Pao after a single Rapid Spin or Aqua Step boost, OHKO Flutter Mane after one Moxie boost, and better deal with priority moves from Breloom and Kingambit.</p> <p>Greninja breaks past troublesome walls like Toxapex, Sableye, and Water Absorb Clodsire due to its wide range of coverage. Toxapex serves as an answer to threats like Meowscarada, Breloom, and Iron Valiant, sets up Toxic Spikes, and hinders Pokemon like Rotom-W, Dragonite, and Quagsire with Toxic. Gastrodon and Quagsire are valued for their Electric-type immunity against Pokemon like Rotom-W, Sandy Shocks, and Magnezon as well as their entry hazards, supporting Quaquaval as a cleaner. Pelipper can set rain to boost Quaquaval's Aqua Step and pressures Grass-types like Breloom, Infiltrator Brambleghast, and Meowscarada with Hurricane. Slowking can safely pivot into Quaquaval with Chilly Reception and aids in late-game cleaning with Future Sight.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Water analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "sasha", "user_id": 510532}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar check by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Lokix": {
    "sets": [
      {
        "name": "All Out Attacker (Bug)",
        "description": "<p>With access to nearly unresisted First Impression and U-turn due to Tinted Lens, Lokix is an amazing revenge killer for Bug teams. Its ability to scare out many common threats such as Espathra, Chien-Pao, and Dragapult is highly valuable. Lokix struggles to break past many physically defensive walls like Quagsire, Dondozo, and Corviknight; however, it can pivot in teammates—such as Vivillon and Volcarona—that can beat them. A Choice Band with an Adamant nature maximizes Lokix's damage output and can utilise Axe Kick to lure and defeat Steel-types like Kingambit and Iron Treads. Alternatively, Life Orb avoids a Choice lock and makes use of Sucker Punch to pick off threats that First Impression alone cannot such as Gholdengo and Flutter Mane. Throat Chop lets Lokix deal good unresisted STAB damage and prevents Skeledirge from using Torch Song, which is extremely valuable and one of the reasons Lokix is a necessity for Bug teams.</p> <p>Lokix is highly susceptible to entry hazards and is often not quite strong enough to OHKO many Pokemon. Forretress is a great entry hazard remover and entry hazard setter, fixing both of those issues. Forretress also has a good defensive profile, acting as a sponge for absorbing damage, and it can even form a VoltTurn core with Lokix. Scizor removes Fairy-types that threaten Lokix such as Hatterene and Iron Valiant and allows Lokix to clean up after it has done enough damage. Volcarona takes care of Steel-types that don't fall to Axe Kick such as Corviknight and Scizor. Lokix can remove Ghost-types—such as Gholdengo, Dragapult, and Flutter Mane—to enable Slither Wing and Heracross, letting them spam their powerful Fighting-type moves and clean up after Lokix. Frosmoth can deal with many bulky Ground-types—such as Garchomp, Great Tusk, and Ting-Lu—and Vivillon improves the Fighting-type matchup by beating Great Tusk, Gallade, and Paldean Tauros-W and can answer Dondozo with the combination of Sleep Powder and Energy Ball. Masquerain can set up Sticky Web, which gives Lokix an amazing Speed advantage versus Iron Treads, Iron Moth, and Walking Wake, making Life Orb Lokix immensely threatening.</p> "
      },
      {"name": "Swords Dance (Dark)", "description": "<p>Excellent for the Dark mirror and revenge-kills threats such as Barraskewda.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. These will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}], "teams": [{"name": "Bug analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Dark set by", "members": [{"username": "Fraolain", "user_id": 479708}, {"username": "Dieu Amphibien", "user_id": 482111}]}, {"name": "Quality checked by", "members": [{"username": "CrossHeart", "user_id": 593863}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Pawmot": {"sets": [{"name": "Choice Scarf (Electric)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Maushold": {"sets": [{"name": "Tidy Up", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Garganacl": {
    "sets": [
      {
        "name": "IronPress",
        "description": "<p>Garganacl eases the Water and Steel matchups thanks to its signature move, Salt Cure. Iron Defense allows Garganacl to set up, tanking super effective physical hits due to its astronomical base 130 Defense, while also boosting the power of Body Press, which helps nail Dark- and Steel-types such as Ting-Lu, Chien-Pao, and Kingambit. Curse is another option that can buff its Attack, boosting the damage of Salt Cure, but it prevents Garganacl from easily stonewalling physical attackers—such as Dragonite and defensive Quaquaval—and also lowers Garganacl's Speed. Salt Cure is a fantastic STAB move, neutering setup sweepers such as Mimikyu, Corviknight, and Hatterene, as it puts them on a timer, which Garganacl can potentially stall out as it sets up or heals via Recover. Purifying Salt is particularly useful, as it allows Garganacl to absorb incoming status moves such as Toxic from Quagsire or Toxapex as well as Will-O-Wisp from Dragapult or Sableye and punish them with Salt Cure. Garganacl is also able to tank Ghost-type STAB moves from the likes of Choice-locked Flutter Mane and Dragapult. Leftovers is the best item to provide passive recovery; however, Heavy-Duty Boots can allow Garganacl to come in without taking entry hazard damage, as entry hazard stacking is extremely common. As an alternative to the given EVs, 52 Defense EVs with an Impish nature let Garganacl potentially overwhelm Choice Band Scizor, Tinkaton, and defensive Quaquaval if used with Iron Defense.</p> <p>Tyranitar is an amazing partner for Garganacl, as it sets sand. Tyranitar can also be used as one of the few special attackers Rock teams have access to to nail physical walls such as Great Tusk with Ice Beam; it is also Rock's best check to Kingambit due to it being able to survive a boosted Sucker Punch and OHKO back with Fire Blast. Choice Scarf Glimmora can take on Grass- and Fighting-types such as Breloom and Iron Valiant that may threaten Garganacl out. Glimmora also has fantastic coverage, being able to take on Steel-types such as Gholdengo with Earth Power and Water-types such as Gastrodon and Quagsire with Energy Ball. Glimmora can also provide Toxic Spikes support thanks to its ability, Toxic Debris, which can help Garganacl further wear down and pressure the opposing Pokemon. Teammates that utilize Air Balloon such as Iron Thorns and Drednaw can switch into powerful Ground-type attacks aimed at Garganacl. Drednaw can also utilize its Water-type STAB move to take out opposing Ground-types such as Iron Treads, Unaware Clodsire, and Ting-Lu. Furthermore, Drednaw can also turn the tide against rain Water teams thanks to its ability, Swift Swim. Lycanroc-D is also a really good partner for Garganacl that appreciates its ability to wear down foes so it can clean up late-game. Coalossal is also a good partner that can not only burn foes but also lay down entry hazards. Coalossal can also clear its side of the field as well with Rapid Spin, alleviating chip damage on the team. It also acts as a soft check to Scizor and Meowscarada due to its neutralities and can potentially neuter them with Flame Body.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "kenn", "user_id": 604741}], "teams": [{"name": "Rock analysis by", "members": [{"username": "kenn", "user_id": 604741}]}, {"name": "Quality checked by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "Ashbala", "user_id": 518038}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Armarouge": {"sets": [{"name": "Calm Mind (Psychic)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Ceruledge": {"sets": [{"name": "Swords Dance (Fire)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Swords Dance (Ghost)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Kilowattrel": {
    "sets": [
      {
        "name": "Choice Specs (Flying)",
        "description": "<p>Kilowattrel is an essential component to Flying teams, providing an Electric immunity, pivot support, an excellent Speed tier that allows it to outspeed Choice Specs Greninja and Iron Valiant, and a range of hard-hitting attacks. With rain support, Thunder can be used as Kilowattrel's hard-hitting STAB attack to hit Pokemon—such as Toxapex—that Flying teams can struggle to take down. Thunderbolt is a fine substitute on Flying teams that do not utilize rain. Volt Switch allows Kilowattrel to pivot, making use of Kilowattrel's high Speed tier to get off damage while not being Choice locked. Hurricane couples with the preceding moves to cover Kilowattrel's STAB combination, specifically hitting Ground-types such as Quagsire and Gastrodon. The last slot depends on whether rain is being taken advantage of: on rain teams, Weather Ball can be used to hit Ground-types such as Unaware Clodsire, while Air Slash is another option for non-rain teams that can make up for Hurricane's lower accuracy. Choice Specs allows Kilowattrel to hit extremely hard, letting it OHKO Pokemon such as Azumarill with Volt Switch and Amoonguss with Hurricane. Volt Absorb provides the only Electric immunity for Flying-type teams.</p> <p>Corviknight is one of Kilowattrel's greatest assets; beyond providing a neutral switch-in to Ice-type attacks—especially in the cases of Chien-Pao and Choice Scarf Greninja—Corviknight provides a physical wall that Kilowattrel can pivot into. It is also Flying's most common Defogger, which is essential, as Kilowattrel is susceptible to Stealth Rock damage, hindering its pivoting. Pelipper is very useful in supporting Kilowattrel, as rain support ensures accuracy of Kilowattrel's Thunder and Hurricane, and U-turn on Pelipper ensures safe pivoting. Talonflame is another defensive supporter, covering Kilowattrel's weakness to Ice-types and offering another Defogger. Dragonite hits the specially defensive walls that Kilowattrel struggles with such as Clodsire and Blissey. Gyarados finds great support from Kilowattrel; as Kilowattrel punches holes in defensive Pokemon such as Amoonguss and Toxapex, Gyarados will have a better chance to sweep late-game. While Kilowattrel has excellent Speed itself, Choice Scarf users such as Flamigo and Salamence can revenge kill Pokemon such as Dragapult and Flutter Mane that outspeed Kilowattrel. Bombirdier offers Stealth Rock support and uses Knock Off to remove key items such as Leftovers on Gastrodon, which puts it into 2HKO range of Hurricane after Stealth Rock damage.</p> "
      },
      {"name": "Metronome (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Offensive Ground Immunity (Electric)", "description": "<p>These are the sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. These will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Offensive Electric Immunity (Flying)", "description": "<p>These are the sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. These will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Azick", "user_id": 468541}], "teams": [{"name": "Flying analyses by", "members": [{"username": "Azick", "user_id": 468541}]}, {"name": "Flying set by", "members": [{"username": "mushamu", "user_id": 362454}]}, {"name": "Quality checked by", "members": [{"username": "Ashbala", "user_id": 518038}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Toedscruel": {"sets": [{"name": "Entry Hazard Support (Grass)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Scovillain": {
    "sets": [
      {
        "name": "Sun Sweeper (Fire)",
        "description": "<p>Scovillain is one of Fire's best sweepers thanks to Chlorophyll. Under sun, Scovillain outspeeds a multitude of threats such as non-Choice Scarf Greninja and Chien-Pao. Growth is run for Scovillain to boost its damage output while under sun, letting it secure KOs more easily. Giga Drain threatens Pokemon like Ting-Lu, allowing Scovillain's teammates to break through them late-game, and it also aids in improving Scovillain's longevity by recovering its HP. Fire Blast can be used to have a chance of 2HKOing Skeledirge and Clodsire under sun, but Flamethrower is the preferred Fire-type STAB move, since its accuracy is higher than Fire Blast's. Stomping Tantrum hits opposing Fire-types such as Iron Moth. Solar Beam is an alternative to Stomping Tantrum, OHKOing the aforementioned Ting-Lu and Toxapex after Growth in sun. Life Orb and 32 Attack EVs maximize Scovillain's power, letting it 2HKO specially defensive Clodsire with Stomping Tantrum after Stealth Rock damage. If opting for Solar Beam, the remaining EVs go into HP. A Naive nature allows Scovillain to outspeed Choice Scarf users like Great Tusk and Iron Moth under sun while not losing out on Stomping Tantrum damage.</p> <p>Torkoal is a mandatory partner for Scovillain, as its ability to set up sun allows Scovillain to outspeed many faster threats like Iron Treads, Iron Jugulis, and Quaquaval, dealing heavy chip damage or outright KOing them. Scovillain appreciates Torkoal getting rid of entry hazards; in return, Scovillain deals with Water- and Ground-types like Gastrodon, Quagsire, and Sandy Shocks. Paldean Tauros-F is a great offensive partner for Scovillain, granting benefits such as breaking dual screens from Pokemon like Klefki and Grimmsnarl, which impede Scovillain's sweeping ability. Paldean Tauros-F is also able to check specially defensive walls like Blissey; in return, Scovillain breaks past bulky Water-types like Slowking and Toxapex after one Growth under sun. Cinderace can offer alternate entry hazard removal with Court Change, which helps Scovillain's longevity. Furthermore, Cinderace's Speed tier allows it to handle offensive Pokemon that naturally outpace Scovillain outside of sun like Hydreigon and Iron Treads, the former of which Scovillain cannot hit neutrally. Scovillain also appreciates Volcarona as an offensive partner thanks to its non-weather-reliant sweeping potential in Quiver Dance, dealing with Dragon-types such as Hydreigon and Garchomp, while Scovillain can weaken Volcarona's checks like Ting-Lu, Unaware Clodsire, and Toxapex throughout the course of the game.</p> "
      },
      {
        "name": "Choice Specs (Fire)",
        "description": "<p>Scovillain turns up the heat on its Fire Blast with a Choice Specs set, burning up Clodsire and Skeledirge, which usually have no problem with its Growth set. It's notably also strong enough to score a 2HKO on physically defensive Toxapex after minimal chip damage, allowing Scovillain to beat Poison teams if it hits every move. Alternatively, Overheat has better accuracy and still 2HKOes Skeledirge and Clodsire, but the Special Attack drop makes it less spammable. Giga Drain threatens a 2HKO on Pelipper, which may be tempted to come into Scovillain to block Solar Beam, and also provides Scovillain a form of recovery. A Timid nature lets it outspeed threats such as Choice Scarf Gengar and Protosynthesis-boosted Choice Specs Walking Wake to burn them to a crisp, while a Modest nature has better odds of 2HKOing Toxapex with Giga Drain and OHKOing Baxcalibur with Flamethrower at the cost of outspeeding only up to non-Speed boosting Choice Scarf Sandy Shocks.</p> <p>Torkoal is a mandatory teammate, as it sets sun, which Scovillain needs to boost its Speed with Chlorophyll, and provides entry hazard support with its ability to set Stealth Rock and remove entry hazards with Rapid Spin. Other forms of entry hazard support in Defog Talonflame and Court Change Cinderace are also appreciated; they also have access to U-turn, which allows Scovillain to get in more times to wallbreak. Ceruledge packs Shadow Sneak to deal with Flutter Mane, which otherwise outspeeds and dispatches Scovillain with ease. In return, Scovillain obliterates bulky Unaware walls like Quagsire, Dondozo, and Skeledirge, all of which hinder Swords Dance Ceruledge from cutting down Water and Ghost teams. Similarly, Volcarona and Iron Moth love Scovillain's ability to eliminate bulky walls like Clodsire and Ting-Lu, allowing them to clean up Poison and Ground teams late-game. Skeledirge deals with Kingambit and Choice Scarf Meowscarada, which threaten Scovillain with priority or by outspeeding it and picking it off.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TTK", "user_id": 307004}, {"username": "Neko", "user_id": 542526}], "teams": [{"name": "Fire analysis by", "members": [{"username": "TTK", "user_id": 307004}, {"username": "Neko", "user_id": 542526}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Ashbala", "user_id": 518038}, {"username": "Swiffix", "user_id": 547532}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}, {"username": "Dead by Daylight", "user_id": 571069}]}]}
  },
  "Espathra": {
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>The combination of Calm Mind, Speed Boost, and Stored Power makes Espathra one of the most terrifying sweepers. Stored Power's base power quickly raises with the combination of Speed Boost and Calm Mind, reaching astronomical levels that can break through foes which resist it like Corviknight, Hatterene, and Gholdengo. With enough boosts, Stored Power is powerful enough to break through Unaware walls like Skeledirge, Dondozo and Clodsire. Dazzling Gleam complements Stored Power well, as it can beat Dark-types which would otherwise wall Espathra such as Sableye, Meowscarada, and Greninja. Heavy-Duty Boots lets Espathra ignore entry hazards when switching in and couples well with Roost to increase Espathra's longevity, letting it set up easily. Alternatively, Leftovers in conjunction with Substitute and Roost or Protect lets Espathra safely get Speed boosts while also being able to scout foes' moves. 44 Speed EVs let Espathra outspeed Dragapult at +1 Speed, while the rest are placed into HP and Defense, giving Espathra bulk to set up with ease against Physical Attackers such as Garchomp, Great Tusk and Corviknight.</p> <p>Espathra appreciates teammates that can accentuate its offensive prowess. Scream Tail can set dual screens and paralyze opponents with Thunder Wave to make setting up easie while also setting Stealth Rock and can even Wish pass to Espathra. Gallade, along with Scream Tail with the set of Substitute, Bulk Up, Drain Punch and Play Rough can also punish Dark-types like Chien-Pao and Kingambit. Iron Leaves can beat Barraskewda under rain, which otherwise outspeeds Espathra even at +2 Speed. Iron Leaves also beats bulky Ground-types like Ting-Lu, which could phaze Espathra with Whirlwind, or Clodsire and Quagsire, both of which would require a lot of boosts to break with Stored Power. Indeedee is a Ghost-type switch-in and sets up Psychic Terrain for Espathra, protecting it from priority attacks like Chien-Pao's Sucker Punch. Indeedee is also able to Healing Wish to give Espathra a second chance to sweep. Stored Power Armarouge forms a dangerous core with Espathra, which can break for Espathra, clean after it, and also beat Steel teams. Hatterene bounces back entry hazards for Espathra if it forgoes Heavy-Duty Boots while also beating Dark- and Dragon-types. Chilly Reception Slowking can pivot to Espathra safely while acting as a sponge for hits.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}], "teams": [{"name": "Psychic analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Tinkaton": {"sets": [{"name": "Utility (Fairy)", "description": "<p>Outspeeds and OHKOs Glimmora with Gigaton Hammer. Exceptional in the Fairy mirror.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Bombirdier": {"sets": [{"name": "Entry Hazard Support (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Cyclizar": {"sets": [{"name": "Shed Tail (Dragon)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Glimmora": {"sets": [{"name": "Entry Hazard Support (Poison)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}, {"name": "Choice Scarf (Rock)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Dondozo": {
    "sets": [
      {
        "name": "Curse + Resttalk",
        "description": "<p>Dondozo is a staple on rainless Water teams due to its phenomenal bulk and ability to check setup sweepers such as Gholdengo and Chien-Pao, thanks to Unaware. Dondozo faces competition from Quagsire as the team's Unaware user, as Quagsire has an immunity to Electric-type attacks and can stack entry hazards; however, it drops to Grass-type attacks. Curse allows Dondozo to apply offensive pressure, boosting its attack and allowing it to better hit targets such as Baxcalibur and Kingambit while also allowing it to better tank hits in return. Rest allows Dondozo to shrug off status and gives it longevity, allowing it to constantly absorb powerful attacks for Water teams, such as Great Tusk's Headlong Rush. Sleep Talk enables Dondozo to further take advantage of Rest, allowing it to continue to setup or attack its target while asleep. Dondozo takes advantage of its STAB through the use of Waterfall, doing more damage, but Avalanche allows Dondozo to OHKO Meowscarada, as well as pressure Water-immune Pokemon such as Clodsire and Gastrodon. Its EV spread allows Dondozo to tank attacks from Gholdengo and Flutter Mane, due to its already high physical defense, which may be further boosted by Curse.</p> <p>Choice Specs Greninja is an insane wallbreaker, with coverage allowing it to take on a variety of Pokemon such as an opposing Dondozo or Ting-Lu with Grass Knot, Garchomp with Ice Beam, Amoonguss and Clodsire with Extrasensory, and Espathra with Dark Pulse. Toxapex absorbs Toxic Spikes for Dondozo, spreads Toxic, and shrugs off Grass-type attacks such as Flower Trick from Choice Scarf Meowscarada and Grass Knot from Greninja. Gastrodon provides an Electric immunity and it can tank attacks from special attackers such as Flutter Mane; however, it needs to be wary of Energy Ball. Gastrodon can also stack Spikes or set Stealth Rock, wearing down foes for Dondozo. The defensive core of Dondozo, Toxapex, and Gastrodon also gives Water teams opportunities to scout powerful attacks by allowing for each to switch-in for another, such as Dondozo switching in for Gastrodon or Toxapex to tank Chien-Pao's Crunch. Earthquake also allows it to take on Poison- and Electric-type Pokemon such as Clodsire and Sandy Shocks. Quaquaval can remove hazards with Rapid Spin for Dondozo and offensive Quaquaval sets can take on common threats to Water teams such as Greninja after one Aqua Step or Meowscarada after two.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "maroon", "user_id": 305839}], "teams": [{"name": "Water analysis by", "members": [{"username": "maroon", "user_id": 305839}]}, {"name": "Quality checked by", "members": [{"username": "Swiffix", "user_id": 547532}, {"username": "AtraX Madara", "user_id": 513753}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Clodsire": {
    "sets": [
      {
        "name": "Toxic Spikes (Ground)",
        "description": "<p>Due to its remarkable bulk, unique dual-typing, and two great abilities, Clodsire is a mainstay on Ground teams. Water Absorb stops common Water-type threats like Quaquaval, Dondozo, and Pelipper in their tracks, while Unaware walls setup sweepers such as Gholdengo, Mimikyu, and Volcarona. Poison Jab hits threats like Meowscarada, Rotom-C, and Iron Valiant, while Gunk Shot provides more power against bulkier foes such as Hatterene and Azumarill. Toxic Spike eases the Dark and Fairy matchups due to their lack of entry hazard removal and applies pressure on teams in general, completing Ground's entry hazard stacking core. Toxic may be used instead to punish Pokemon like Rotom-W and Hydreigon, which freely switch-in to Clodsire otherwise. The given EV spread avoids the 2HKO from both Choice Scarf Greninja's Ice Beam and Choice Scarf Meowscarada's Flower Trick.</p> <p>Great Tusk, Iron Treads, and Ting-Lu appreciate Clodsire checking the aforementioned Water-types as well as other threats such as Iron Valiant and Flutter Mane. In return, Choice Scarf Great Tusk pressures Ice- and Dark-types like Chien-Pao, Baxcalibur, and Choice Specs Greninja. Iron Treads clears entry hazards and threatens Hatterene, and Ting-Lu sets up entry hazards and switches into Psychic-type attacks from Espathra and Indeedee. Unaware Clodsire synergizes very well with Gastrodon, as it checks the aforementioned Grass-types, while Gastrodon switches into Water-type attacks from Dondozo and Barraskewda. Sandy Shocks threatens Flying-types like Corviknight and Pelipper and secures the Fire matchup. Quagsire pairs well with Water Absorb Clodsire, as it checks Chien-Pao, Baxcalibur, and Great Tusk. Furthermore, Quagsire is capable of using Toxic to free up a moveslot for Toxic Spike on Clodsire, expanding the team's hazard stacking ability.</p> "
      },
      {
        "name": "Specially Defensive (Poison)",
        "description": "<p>Due to its exceptional Special Defense and ability in Unaware, Clodsire is a wall that checks threats like Hydreigon, Volcarona, and Flutter Mane for Poison teams. Earthquake lets it chip down and eventually beat threats like Volcarona, Iron Valiant, and Gholdengo, while Low Kick deals with the aforementioned Nasty Plot Hydreigon and can heavily damage Kingambit in a pinch. Spikes lets Clodsire take advantage of forced switches and synergizes well with Glimmora, Toxapex, and Skuntank, all together forming Poison's entry hazard-stacking core. Alternatively, Curse turns Clodsire into a threatening wincon and lets it deal with physical attackers. 56 Def EVs may be considered so Clodsire tanks a fully boosted Supreme Overlord Kowtow Cleave from Kingambit and deals heavy damage to it with Low Kick.</p> <p>Amoonguss and Toxapex are physically defensive walls that complement Clodsire, as they take on threats such as Great Tusk, Scizor, and Quaquaval, which force Clodsire out. Amoonguss can also run Growth, which helps in the Ground matchup, while Toxapex also chips down the opposing team by setting Toxic Spikes and wearing down threats like Chien-Pao with Infestation, Baneful Bunker, and Rocky Helmet. Skuntank is a Psychic-immune teammate that switches into Hatterene, Espathra, and Indeedee, and it can set Toxic Spikes better against types like Fairy and Psychic by trapping switch-ins such as Klefki and Bronzong with Fire Spin. Glimmora provides entry hazard support and removal with Stealth Rock and Mortal Spin, respectively, and it can run Air Balloon or Choice Scarf to handle Ground-types such as Great Tusk and Iron Treads due to its great coverage. Glimmora can also run Corrosion with Toxic and Mortal Spin, improving the Poison matchup and putting defensive Pokemon such as opposing Clodsire and Amoongus on a timer. Iron Moth is another plausible Choice Scarf user, as it handles Steel- and Dragon-types like Iron Treads and Baxcalibur, though it can also run a set with Substitute to handle Kingambit and break down types such as Flying and Water better.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}, {"username": "Neko", "user_id": 542526}], "teams": [{"name": "Ground analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Poison analysis by", "members": [{"username": "Neko", "user_id": 542526}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Aqua Jet", "user_id": 531302}, {"username": "Swiffix", "user_id": 547532}, {"username": "maroon", "user_id": 305839}, {"username": "sasha", "user_id": 510532}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Kingambit": {
    "sets": [
      {
        "name": "Swords Dance (Dark)",
        "description": "<p>Kingambit is a potent wallbreaker and sweeper on Dark teams, having an excellent secondary typing, great stats, and an amazing ability to tie it all together. Swords Dance allows Kingambit to capitalize on its already great Attack stat, letting it threaten defensive walls such as Toxapex, Amoonguss, and Corviknight. Making up for its lack of Speed, Sucker Punch fits perfectly on Kingambit. In tandem with three boosts from Supreme Overlord, Sucker Punch OHKOes Flutter Mane; it also OHKOes Volcarona after Swords Dance in tandem with two Supreme Overlord boosts. Kowtow Cleave is a reliable heavy-hitting STAB attack, and Iron Head hits Fairy-types such as Hatterene and Azumarill. Supreme Overlord is one of Kingambit's main selling points, allowing it to 2HKO Specially Defensive Corviknight and almost always 2HKO Quagsire after Stealth Rock. The Speed EVs allow Kingambit to outspeed both Corviknight and Skeledirge, both which otherwise can threaten Kingambit with Body Press and Will-O-Wisp, respectively. Leftovers are used to support Kingambit's solid defensive stats, giving it a form of recovery.</p> <p>Kingambit functions as an excellent late-game sweeper, making use of its ability and setup potential; thus, Kingambit greatly appreciates entry hazard support from Ting-Lu to pressure offensive teams who lack hazard removal. Greninja and Hydreigon cover physically defensive walls, hitting Pokemon such as Great Tusk and Amoonguss that Kingambit would otherwise struggle with. Sableye provides an important Fighting-type immunity to make up for Kingambit's typing. Skuntank can be used in combination with Kingambit to ease the Fairy-type matchup and set Toxic Spikes, chipping foes and making it easier for Kingambit to sweep late-game. Chien-Pao and Meowscarda help make up for some of Kingambit's type weaknesses. Chien-Pao can hit Ground-types such as Garchomp and Great Tusk. Meowscarda can make use of Choice Scarf combined with Play Rough to hit Fighting-types such as Iron Valiant while also hitting Ground- and Water-types such as Quagsire.</p> "
      },
      {
        "name": "Swords Dance (Steel)",
        "description": "<p>Kingambit serves as one of the best attackers for the Steel type, boasting impressive physical bulk and monstrous Attack, and the latter gets boosted further by Supreme Overlord and Swords Dance. Its base 50 Speed leaves something to be desired but is supplemented by Sucker Punch. Kowtow Cleave allows it to break through walls that don't resist it such as Skeledirge, which poses a major complication for Steel teams, as well as 2HKOing Quagsire if all teammates have fainted. Sucker Punch can allow Kingambit to defeat threats like Barraskewda and Flutter Mane, which can massively threaten Steel teams. Iron Head damages Pokemon that don't mind Sucker Punch or Kowtow Cleave, such as Ting-Lu or Azumarill. Alternatively, Brick Break destroys dual screens and OHKOes other Kingambit trying to take its STAB moves. 140 Speed EVs allow Kingambit to outspeed walls such as uninvested Skeledirge and Corviknight. Black Glasses boosts its Dark-type moves to dangerous levels without it having to set up Swords Dance, but Leftovers may be used to increase Kingambit's survivability. Chople Berry has a niche in allowing Kingambit to survive Fighting-type moves such as Chien-Pao's Sacred Sword, while Heavy Duty Boots helps it pivot in and out to exert pressure on the opponent without getting chipped.</p> <p>Scizor's U-turn safely pivots Kingambit in to wallbreak while dealing substantial chip damage; also, its Bullet Punch deals with threats to Kingambit such as Chien-Pao and Iron Valiant, and Close Combat allows it to check threats such as Iron Treads and Ting-Lu. Goldengo is an excellent partner to freely switch into Fighting-type moves and Will-O-Wisp. Corviknight serves as a potent check to Chien-Pao and clears entry hazards to increase Kingambit's longevity, Magnezone breaks through bulky Water-types such as Toxapex and Dondozo, and it preserves momentum through Volt Switch. Iron Treads serves as another hazard clearer, can set up Stealth Rock to chip any walls Kingambit wants to break through, and can serve as speed control with a Choice Scarf. Klefki sets up dual screens, which allow Kingambit to use Swords Dance far more easily. Tinkaton can wall any Fairy-type moves meant to chip or finish off Kingambit, such as Flutter Mane's Moonblast, and KO many of their users with Gigaton Hammer. Orthworm's Shed Tail can be used with Kingambit to great effect, allowing it to freely use Swords Dance and threaten to sweep the opponent's team.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Azick", "user_id": 468541}, {"username": "Arkter", "user_id": 319437}], "teams": [{"name": "Dark analysis by", "members": [{"username": "Azick", "user_id": 468541}]}, {"name": "Steel analysis by", "members": [{"username": "Arkter", "user_id": 319437}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Ashbala", "user_id": 518038}, {"username": "maroon", "user_id": 305839}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ken", "user_id": 594478}, {"username": "Dead by Daylight", "user_id": 571069}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Offensive Utility (Fighting)",
        "description": "<p>Boasting impressive bulk, Great Tusk is a physical wall for Fighting teams that can pivot in and out around hard hitting physical attackers such as Iron Hands and Kingambit. Earthquake is a powerful STAB move that threatens Poison-types such as Clodsire and Toxapex. Knock Off complements Great Tusk's ability to spin by strongly hitting Ghost-types such as Brambleghast, Gholdengo, and Dragapult hard while also removing Heavy-Duty Boots. Lastly, Great Tusk provides Stealth Rock support for the team, which helps to break Focus Sash on Breloom. Heavy-Duty Boots is the premier choice, as it allows Great Tusk to spin away hazards without being poisoned by Toxic Spikes or worn down by Spikes. Leftovers is a solid alternative to provide Great Tusk with passive recovery, but generally avoiding hazard damage is more important. The EV spread outpaces neutral nature Tyranitar and uninvested Brambleghast while maximizing Great Tusk's physical bulk.</p> <p>Assault Vest Iron Hands is a great partner to Great Tusk, sponging special hits aimed at it while also threatening Pokemon such as Choice Specs Pelipper and Hatterene. Iron Hands also appreciates Great Tusk's ability to keep entry hazards off the field so it doesn't get worn down. Wallbreakers such as Iron Valiant and Breloom appreciate Great Tusk's ability to threaten Poison-types such as Clodsire and Skuntank, allowing them to continue rampaging against the opponent. Due to it being an amazing special attacker, Iron Valiant in particular can threaten physical walls like Quagsire, Sableye, and Dondozo, which like to switch into Great Tusk. Choice Scarf users such as Flamigo, Quaquaval, and Slither Wing pressure special attackers faster than Great Tusk such as Choice Specs Greninja, Dragapult, and opposing Iron Valiant. Gallade is also a really nice partner to handle Pokemon such as Amoonguss, who would otherwise beat Great Tusk one-on-one, thanks to its Psychic STAB attacks.</p> "
      },
      {
        "name": "Choice Scarf (Ground)",
        "description": "<p>Choice Scarf Great Tusk is an exceptional revenge killer because of its great bulk, terrifying Attack stat, and unique STAB combination, allowing it to pummel many threats like Chien-Pao, Baxcalibur, and Flutter Mane. Earthquake may be used instead of Headlong Rush to avoid contact and the stat drops at the cost of dealing less damage. Ice Spinner hits Dragonite and Garchomp. Knock Off greatly hinders Leftovers-reliant Pokemon like Bronzong and Rotom-W, and it leaves common Heavy-Duty Boots users such as Slowbro and Amoonguss to be susceptible to entry hazards from teammates like Clodsire and Ting-Lu.</p> <p>Iron Treads, Quagsire, and Ting-Lu are great switch-ins to faster threats such as Choice Scarf Greninja and Gengar, as well as Baxcalibur after a Dragon Dance. Clodsire appreciates the removal of Ground-types like Ting-Lu and Iron Treads as well as the aforementioned Ice-types and Gastrodon appreciates the removal of Grass-types such as Meowscarada and Breloom. In return, Clodsire and Gastrodon switch into Water-type attacks from Quaquaval and Pelipper and set entry hazards to enhance Great Tusk's wallbreaking. Furthermore, Clodsire cripples Quagsire and Rotom-W with Toxic and Gastrodon prevents setup with Clear Smog. Sandy Shocks and Garchomp can aid against Corviknight and Amoonguss to alleviate Steel and Poison matchups, respectively.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "kenn", "user_id": 604741}, {"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Fighting analysis by", "members": [{"username": "kenn", "user_id": 604741}]}, {"name": "Ground analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "roxie", "user_id": 481576}, {"username": "Neko", "user_id": 542526}, {"username": "Felines", "user_id": 290520}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Flutter Mane": {
    "sets": [
      {
        "name": "Choice Specs (Fairy)",
        "description": "<p>Flutter Mane has a powerful dual STAB combination in Moonblast and Shadow Ball, as well as a plethora of coverage moves that allow it to choose its good matchups. Mystical Fire hits Steel-types such as Klefki and Iron Treads. Psyshock allows Flutter Mane to punish specially defensive switch-ins like Dragalge, Blissey, and Clodsire. Flutter Mane can run Power Gem to pressure Fire teams, OHKOing foes like Volcarona and Torkoal, and it also benefits from Protosynthesis allowing it to outspeed Scovillain under the sun. Additionally, Flutter Mane usually goes with either Thunderbolt or Energy Ball. Both are useful against Water teams, with the former helping against Toxapex and Pelipper while the latter deals with Gastrodon and Quagsire. Choice Specs further enhances Flutter Mane's wallbreaking power, allowing it to overwhelm foes such as Ting-Lu after some chip damage.</p> <p>On Fairy teams, Flutter Mane is a menacing wallbreaker that excels at taking down slower foes such as Hydreigon, Skeledirge, and Corviknight. When paired with Iron Valiant, Flutter Mane forms an offensive core that's able to alternate between Fairy-, Ghost-, and Fighting-type STAB to take down a wide range of enemies. Flutter Mane can handle Psychic-type foes such as Espathra and Hatterene, while Iron Valiant takes care of Steel-types like Kingambit and Iron Treads. Flutter Mane can fall back on either Hatterene or Tinkaton when faced with an unfavorable matchup. Both of these Pokemon provide dependable defensive options and some type of entry hazard control, but Hatterene is particularly useful due to it breaking down walls like Dondozo and Clodsire. Flutter Mane also pairs well with setup sweepers like Belly Drum Azumarill and Swords Dance Mimikyu, as it is able to poke holes in the opponent's team, allowing them to clean late-game. In return, Azumarill can take care of priority users, such as Ceruledge and Chien-Pao. In terms of support options, Flutter Mane can rely on Fairy's Prankster users, Klefki and Grimmsnarl, to set up dual screens, therefore allowing it to withstand hits such as Mimikyu's Shadow Sneak and Gholdengo's Make It Rain. Grimmsnarl can then bring in Flutter Mane relatively safely thanks to Parting Shot. Klefki's Spikes and Tinkaton's Stealth Rocks also support Flutter Mane in breaking its checks such as Iron Hands and Ting Lu. Entry hazard stacking proves particularly useful against less bulky teams, as it highly limits their capacity to scout Flutter Mane without having to sacrifice a member in the process.</p> "
      },
      {
        "name": "Choice Scarf (Ghost)",
        "description": "<p>Choice Scarf Flutter Mane is an incredibly potent revenge killer and late-game cleaner thanks to its strong STAB combination, solid coverage options, and blazing Speed tier. Notably, it outspeeds faster Pokemon like Dragapult, boosted threats such as Baxcalibur and Quaquaval, and Choice Scarf users like Greninja and Meowscarada, all of which can threaten the offensive teams that Flutter Mane is part of. Mystical Fire threatens Steel-types such as Corviknight and Iron Treads, while Psyshock revenge kills Choice Scarf Iron Moth and hits specially bulky Pokemon like Clodsire. Thunderbolt pressures Corviknight better and 2HKOes physically defensive Toxapex after Stealth Rock, while Energy Ball takes care of Gastrodon.</p> <p>Spikes from the likes of Brambleghast and Froslass are terrific support options, chipping down bulky foes like Toxapex and Ting-Lu that would otherwise switch into Flutter Mane freely. Thanks to Good as Gold blocking Defog and its Ghost-typing, Gholdengo is a notable partner to keep Spikes up. Brambleghast also helps threaten Gastrodon and provides Rapid Spin support as well. Wallbreakers like Mimikyu and Gholdengo can pressure the opposition early-game, allowing for Flutter Mane to clean up late-game with ease; moreover, Mimikyu can overwhelm Steel-types like Kingambit and Iron Treads with Drain Punch, while Gholdengo can make use of Trick to cripple walls like Clodsire and Corviknight. Setup sweepers such as Dragon Dance Dragapult and Swords Dance Ceruledge are valuable teammates that function as back-up late-game cleaners, especially against types Flutter Mane can struggle with such as Poison and Steel. Moreover, Ceruledge and Mimikyu have the added benefit of safely revenge killing opposing fast threats Flutter Mane can't handle easily, like Choice Scarf Flutter Mane and Dragon Dance Dragapult, with Shadow Sneak. Skeledirge is a notable partner to compensate for Flutter Mane's lack of physical bulk, taking on Bullet Punch users like Scizor and Lucario as well as being fantastic in the Steel, Fighting, and Bug matchups.</p> "
      },
      {"name": "All-Out Attacker (Ghost)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Swiffix", "user_id": 547532}, {"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Fairy analysis by", "members": [{"username": "Swiffix", "user_id": 547532}]}, {"name": "Ghost analysis by", "members": [{"username": "royalfluxh", "user_id": 493260}]}, {"name": "Quality checked by", "members": [{"username": "maroon", "user_id": 305839}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "UT", "user_id": 523866}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Slither Wing": {"sets": [{"name": "Choice Scarf (Fighting)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Sandy Shocks": {
    "sets": [
      {"name": "Entry Hazard Support (Electric)", "description": "<p>Provides Speed Protosynthesis. Can do an EV spread of  252 SpA / 4 SpD / 252 Spe to 2HKO physically defensive Quagsire instead.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Gravity (Ground)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {"name": "Choice Specs (Ground)", "description": "<p>A spread of 44 HP / 208 SpA / 4 SpD / 252 Spe may be considered to obtain a Speed-boosting Protosynthesis.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ]
  },
  "Iron Treads": {
    "sets": [
      {
        "name": "Special Tank (Ground)",
        "description": "<p>Iron Treads complements Ground team's defensive core with its Steel typing—which lets it deal with Fairy- and Ice-types such as Hatterene and Cryogonal— and provides further utility with Rapid Spin. Knock Off dissuades Ghost-types like Gholdengo and Skeledirge from spinblocking and potentially weakens Choice item users such as Meowscarada and Greninja after taking their hit, letting its teammates such as Choice Scarf Great Tusk and Clodsire handle them better. Heavy Slam smashes Fairy-types such as Hatterene and Flutter Mane, while Iron Head better deals with Chien-Pao and Baxcalibur. Protect lets Iron Treads scout common Choice item Pokemon such as Greninja, Flutter Mane, and Iron Valiant while accruing Leftovers recovery. A Jolly nature with 8 Speed EVs lets Iron Treads outspeed Adamant Baxcalibur and Timid Armarouge.</p> <p>Offensively-inclined teammates such as Choice Scarf Great Tusk, Choice Specs Sandy Shocks, and Garchomp appreciate Iron Treads removing entry hazards and checking Hatterene. In return, Great Tusk deals with Chien-Pao, Kingambit, and Choice Specs Greninja; Sandy Shocks breaks down walls such as Corviknight and Skeledirge that take advantage of Iron Treads and is a great asset in the Fire matchup; and Garchomp deals with Water- and Dragon-types such as Barraskewda and Hydreigon. Ting-Lu wears down the opposing team with entry hazards + Whirlwind deals with Chien-Pao and Baxcalibur in a pinch, and runs Throat Chop and Taunt to stop setup threats such as Corviknight and Skeledirge that pose a threat to Ground teams. Water Absorb Clodsire and Gastrodon deals with Water-types such as Dondozo, Quaquaval, and Barraskewda as well as walling Meowscarada and Ice Beam Greninja, respectively, as long as Iron Treads keeps the field free of entry hazards. Alternatively, Clodsire can use Unaware instead to check most special attackers, including Volcarona, Rotom-C, and Gholdengo. Similarly, Unaware Quagsire checks physical setup sweepers such as Belly Drum Azumarill, Dragon Dance Dragapult, and Swords Dance Chien-Pao and Mimikyu, and it further wears down the opposing team with Toxic and entry hazards.</p> "
      },
      {
        "name": "Choice Scarf (Steel)",
        "description": "<p>Choice Scarf Iron Treads gives Steel teams a much appreciated revenge killer as well as counterplay against Fire-types such as Tauros-Paldea-Blaze and Volcarona, which can overwhelm Steel teams with ease. Heavy Slam utilizes Iron Treads's fairly hefty size to hit Fairy-types such as Hatterene and Mimikyu hard; however, Iron Head can be used as a more consistent STAB to nail heavier targets such as Chien-Pao, Baxcalibur, and Garganacl. Ice Spinner provides great coverage alongside Iron Treads's STAB moves, nailing Grass-types such as Meowscarada before Protean activates and Amoonguss while also nailing Garchomp and Dragonite. Knock Off provides good team support by getting rid of the foe's item, such as Heavy-Duty Boots and Leftovers from the likes of Dragonite, Volcarona, and Garchomp, whereas Volt Switch allows Iron Treads to pivot out of Pokemon that wall it such as Corviknight and Dondozo.</p> <p>Corviknight is a fantastic partner for Iron Treads, as it can take Fighting- and Ground-type moves while Iron Treads takes on Electric-types such as Iron Hands and Magnezone for Corviknight. Corviknight can also keep entry hazards off the field with Defog, aiding in Iron Treads's longevity and letting it forgo Rapid Spin. Gholdengo is another great partner, as it not only also helps against Fighting-types that Corviknight can't handle such as Iron Valiant, but it also overwhelms physical walls such as Great Tusk, Corviknight, and Dondozo. Entry hazards from Pokemon such as Tinkaton, Orthworm, and Bronzong also aid in Iron Treads sweeping. Tinkaton specifically ensures Stealth Rock being set due to Mold Breaker while having a decent offensive presence thanks to Gigaton Hammer being so powerful. Orthworm provides a Ground immunity, easing pressure off other teammates such as Corviknight, all while also having Spikes and Stealth Rock. Bronzong can not only set up Stealth Rock, but it can also take on Fire-type moves that are aimed at Iron Treads. Kingambit is a great mid- to late-game sweeper that appreciates Iron Treads's ability to punch holes early game or clean up after Kingambit has punched holes itself, providing the team with multiple avenues of winning.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "kenn", "user_id": 604741}, {"username": "Neko", "user_id": 542526}], "teams": [{"name": "Ground analysis by", "members": [{"username": "Neko", "user_id": 542526}]}, {"name": "Steel analysis by", "members": [{"username": "kenn", "user_id": 604741}]}, {"name": "Quality checked by", "members": [{"username": "CrossHeart", "user_id": 593863}, {"username": "maroon", "user_id": 305839}, {"username": "sasha", "user_id": 510532}, {"username": "Swiffix", "user_id": 547532}, {"username": "Ashbala", "user_id": 518038}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Iron Hands": {
    "sets": [
      {"name": "Swords Dance (Electric)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "},
      {
        "name": "Assault Vest (Fighting)",
        "description": "<p>Iron Hands is the premier specially defensive pivot on Fighting teams thanks to its massive HP stat in conjunction with Assault Vest. It is bulky enough to respond to the strongest special attackers in the tier, such as Flutter Mane, Iron Valiant, Greninja, and Iron Moth. Drain Punch provides much needed recovery while using Assault Vest while Thunder Punch is used instead of Wild Charge to avoid chip damage. Heavy Slam hits Fairy-types like Hatterene and allows it to revenge kill Flutter Mane. Despite these strengths, Iron Hands is unable to freely switch in on Flutter Mane and Greninja, as they often run Choice Specs and heavily damage Iron Hands or 2HKO it altogether. Volt Switch allows Iron Hands to keep momentum when it forces switches, allowing it to pivot on physically bulky switch-ins like Skeledirge and Amoonguss. Earthquake is a strong coverage option that hits Poison-types like Clodsire and Iron Moth. Rock Slide is an alternative option to hit Kilowattrel and deal with Volcarona without risking a burn from Flame Body.</p> <p>Great Tusk appreciates Iron Hands's ability to tank neutral special hits like Water-type attacks from Greninja and Pelipper and force them out. In return, Great Tusk takes Ground-type attacks from opposing Great Tusk and Ting-Lu. Furthermore, Great Tusk removes Ting-Lu's Spikes and Clodsire's Toxic Spikes, which cut into Iron Hands's longevity. Breloom and Gallade assist Iron Hands with the Ground and Psychic matchups, respectively, threatening foes like Quagsire and Gastrodon for the former, and Amoonguss and Clodsire for the latter. Breloom appreciates Iron Hands switching into Fire-type attacks from Volcarona and forcing Flying-types like Iron Jugulis to switch. Iron Valiant appreciates Iron Hands's slow Volt Switch, allowing Iron Valiant to switch in freely against opposing Fighting teams. Iron Valiant also threatens common physically defensive Pokemon like Dondozo, Skeledirge, Ting-Lu, and Great Tusk. Choice Scarf users such as Quaquaval and Paldean Tauros-F check threats to Iron Hands like Choice Specs Greninja and Flutter Mane, while Iron Hands handles defensive checks such as Calm Mind Hatterene with Heavy Slam in return.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TTK", "user_id": 307004}], "teams": [{"name": "Fighting analysis by", "members": [{"username": "TTK", "user_id": 307004}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "sasha", "user_id": 510532}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Iron Jugulis": {"sets": [{"name": "Choice Specs (Flying)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Iron Moth": {
    "sets": [
      {
        "name": "Choice Scarf (Poison)",
        "description": "<p>Iron Moth fills its role on Poison teams as an offensive powerhouse and potent revenge killer thanks to its high Speed, great Special Attack, and wide movepool of devastating options to blast any obstacle with. Its STAB Flamethrower melts through Steel-types such as Corviknight, Scizor, and Gholdengo that its teammates are unable to handle. Discharge eviscerates Flying- and Water-types like Pelipper, Talonflame, and Toxapex. Dazzling Gleam fells the mighty Dark- and Dragon-types of the tier such as Hydreigon, Sableye, and Dragapult. For its last moveslot, Energy Ball is a nice option in the Ground matchup, being able to threaten Quagsire, Great Tusk, and Sandy Shocks along with hitting Rotom-W in the Water- and Electric-type matchups, while U-turn allows Iron Moth to safely pivot out of unfavorable matchups against Tyranitar and Dragonite and pairs nicely with Poison's Regenerator Pokemon. Fiery Dance can be an alternative to Flamethrower, with its Special Attack boosting capabilities pairing nicely with Choice Scarf to make Iron Moth unstoppable.</p> <p>Iron Moth greatly appreciates bulky teammates like Amoonguss and Skuntank providing safe switches against threats that are either bulky enough to survive Iron Moth's attacks, like Garchomp, Dondozo, and specially bulky Iron Treads, or threaten to outspeed and KO it, like Chien-Pao and Meowscarada. Physically bulky Amoonguss is Iron Moth's best friend, being able to take on nearly every physical attacker and Ground-type like Garchomp, Dondozo, Meowscarada, and Iron Hands thanks to its Ground neutrality, reliable recovery, and Spore. Physically bulky Toxapex handles most other physical threats Amoonguss is unable to, such as Chien-Pao and Ceruledge, while setting up Toxic Spikes. Specially bulky Skuntank provides a safe answer to bulky Psychic-types like Hatterene and Slowbro as well as Ghost-types like Flutter Mane and Gengar thanks to its high special bulk, good typing, and useful STAB moves. Specially defensive Clodsire provides entry hazard support with Stealth Rock, along with checking threats like Volcarona, Kilowattrel, and Blissey. Corrosion Glimmora can also provide hazard support and use Toxic to wear down opposing special walls like Clodsire, Iron Treads, Ting-Lu, and Iron Hands. Dry Skin Toxicroak deals with Barraskewda and Floatzel, which outspeed Iron Moth, along with switching into Aqua Jets from Belly Drum Azumarill thanks to its immunity to Water-type moves. It also checks many of the Dark-types Iron Moth can't handle, such as Ting-Lu, Tyranitar, and Kingambit, thanks to its Fighting-type STAB move of choice.</p> "
      },
      {"name": "Choice Scarf (Fire)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Pengairxan", "user_id": 622813}], "teams": [{"name": "Poison analysis by", "members": [{"username": "Pengairxan", "user_id": 622813}]}, {"name": "Quality checked by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "Neko", "user_id": 542526}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar checked by", "members": [{"username": "Dead by Daylight", "user_id": 571069}, {"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Iron Thorns": {"sets": [{"name": "Dragon Dance (Electric)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Baxcalibur": {
    "sets": [
      {
        "name": "Dragon Dance (Dragon)",
        "description": "<p>Dragon Dance Baxcalibur is an excellent setup sweeper boasting coverage to ease the Poison matchup and serves as a great wincon versus typings like Ground, Flying, and Dragon. Additionally, Baxcalibur's neutrality to Ice-type attacks allows it to combat Chien-Pao lacking Fighting-type coverage and Ice Beam Greninja. Ice Shard allows Baxcalibur to use an Adamant nature to revenge kill weakened targets such as Choice Scarf Great Tusk, Dragapult, and Flutter Mane. Alternatively, Glaive Rush may be used instead to deal more damage to Chien-Pao and opposing Baxcalibur. Icicle Spear in conjunction with Loaded Dice is a potent combination, dealing enough damage to break past Quagsire and Corviknight with an Adamant nature. Icicle Crash is a great option instead, as it doesn't require an item to function well; however, it has a decreased Base Power. Earthquake is a great coverage move, allowing Baxcalibur to threaten Skeledirge, Kingambit, and Gholdengo.</p> <p>Baxcalibur is capable of switching into Will-O-Wisps from the likes of Sableye and Skeledirge with its ability Thermal Exchange, keeping other physical attackers like Dragonite, Garchomp, and Roaring Moon safe. Cyclizar is an exceptional teammate, as it uses Shed Tail to keep Baxcalibur safe from status ailments induced by Toxapex and Grimmsnarl as it sets up with Dragon Dance. Furthermore, Cyclizar removes entry hazards such as Stealth Rock with Rapid Spin. Dragapult is capable of outpacing threats like Choice Specs Flutter Mane and opposing Baxcalibur as well as pressuring Dondozo with Thunderbolt. Garchomp eases Baxcalibur's sweeping by setting entry hazards and phazing opposing Pokemon through Dragon Tail to rack up damage. Dragalge sets up Toxic Spikes and checks Flutter Mane and Iron Valiant thanks to its Fairy-type neutrality along with STAB Gunk Shot. Hydreigon threatens physical walls like Slowbro, Dondozo, and Toxapex by disabling their recovery options with Taunt and setting up on them using Nasty Plot. Walking Wake is a great faster teammate that relieves pressure off of Baxcalibur to check Chien-Pao.</p> "
      },
      {
        "name": "Dragon Dance (Ice)",
        "description": "<p>Baxcalibur is a potent offensive threat for any Ice-type team with its impressive Attack, Dragon Dance, great STAB moves, and coverage which let it beat common defensive staples like Rotom-W, Corviknight, and Toxapex. However, it struggles to break through Unaware walls, such as Quagsire and Dondozo, and Pokemon that resist its STAB Combination and threaten it, such as Scizor and Azumarill. Thermal Exchange lets it switch into and punish Will-O-Wisp users such as Rotom-W and Sableye and Fire-type moves from Ceruledge and Fire Spin Skuntank. Glaive Rush hits Rotom-W, Toxapex, Volcarona and Quaquaval, while Ice-type STAB moves let it threaten Meowscarada, Ting-Lu, and Great Tusk. Earthquake is a great option to hit Steel-types such as Gholdengo and Kingambit super effectively, while Ice Shard lets it pick off weakened Pokemon and Choice Scarf users such as Meowscarada, Flamigo, and Dragapult. An Adamant nature maximizes Baxcalibur's power while outspeeding Pokemon like Flutter Mane and Chien-Pao at +1; however, a Jolly nature outspeeds Gholdengo and Quaquaval and Speed ties Choice Scarf Great Tusk at +1.</p> <p>Baxcalibur appreciates teammates that can provide it with setup opportunities. Froslass can set Spikes and stop opposing hazards with Taunt, spread burns, and use Destiny Bond to KO opposing threats to Baxcalibur. Abomasnow provides Baxcalibur with snow's defense boost and Aurora Veil to help it set up while also checking Dondozo and Quagsire. Swords Dance Chien-Pao can break Skeledirge, Iron Valiant, and Kingambit and can pick off Pokemon that Baxcalibur has weakened with Ice Shard or Sucker Punch. Alternatively, Choice Scarf Chien-Pao can effectively clean up the battle once Baxcalibur has dealt significant damage. Avalugg and Cloyster can both remove hazards for Baxcalibur in case its Heavy-Duty Boots have been removed. Cloyster can also clean up after Baxcalibur with Shell Smash, while Avalugg can beat Kingambit, Iron Treads, and more with Iron Defense + Body Press if Baxcalibur forgoes Earthquake. Cryogonal's combination of Freeze-Dry and Rapid Spin can help Baxcalibur deal with Quagsire while also removing entry hazards that Ice-type teams often struggle with.</p> "
      },
      {"name": "Choice Band (Dragon)", "description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. These will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}, {"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Ice analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Dragon analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "maroon", "user_id": 305839}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "UT", "user_id": 523866}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Gholdengo": {
    "sets": [
      {
        "name": "Nasty Plot (Steel)",
        "description": "<p>Boasting an impressive Special Attack stat, Gholdengo provides Steel teams with a fantastic special attacker, which are scarce on said type. Nasty Plot lets Gholdengo overwhelm walls such as Gastrodon and Amoonguss. Shadow Ball is a fantastic STAB move that has great neutral coverage and allows Gholdengo to threaten Pokemon such as Skeledirge and Gallade. Focus Blast hits Dark-types that resist Shadow Ball like Kingambit and Ting-Lu. A single Nasty Plot boost enables Gholdengo's Focus Blast to OHKO physically defensive Ting-Lu after a layer of Spikes. The last slot is extremely flexible; Make It Rain is a powerful STAB move that hits harder than Shadow Ball against Dark-types like Grimmsnarl and Fairy-types such as Hatterene and Azumarill. Substitute can be used instead to give Gholdengo some security against faster threats that can take it out such as Chien-Pao, Flutter Mane, and Kingambit's Sucker Punch. Recover is also another option to keep Gholdengo healthy, since it can be worn down fairly easily. Good as Gold allows Gholdengo to switch into status-using Pokemon like Sableye and Grimmsnarl, allowing Gholdengo to set up on them. Air Balloon allows Gholdengo to switch into Pokemon like Great Tusk and Clodsire with ease as well as avoid Spikes as long as it stays intact. This allows Gholdengo to be a decent spinblocker as well.</p> <p>Kingambit is a fantastic partner, as it not only resists Dark-type moves directed at Gholdengo, but it also has STAB priority in Sucker Punch to threaten opposing Ghost-types that can take out Gholdengo such as Dragapult and Flutter Mane. Kingambit also appreciates Gholdengo's ability to take on Breloom so as to not be revenge killed. Scizor appreciates Gholdengo's ability to take care of physical walls, allowing it to clean up with STAB Bullet Punch. Scizor can also pivot into Gholdengo on physical walls such as Skeledirge, allowing Gholdengo to threaten the opposing Pokemon easier. Nasty Plot Lucario is another fantastic partner thanks to its ability to get rid of Dark-types for Gholdengo and pressure special walls. Choice Scarf Iron Treads also appreciates Gholdengo's ability to break physical walls such as opposing Corviknight and Great Tusk early-game so that it can sweep late-game. Dual screens support from Klefki allows Gholdengo to have an easier time setting up and potentially sweeping. Another good partner for Gholdengo is Corviknight, as it removes entry hazards while also providing a Ground immunity once Air Balloon is gone. Corviknight can also run a Bulk Up or Iron Defense set that appreciates Pokemon like Skeledirge being taken care of while helping Gholdengo have an easier time breaking stall. Orthworm is another good choice, as it provides Shed Tail support as well as having access to Spikes and Stealth Rock. Bronzong is also an amazing partner as well, as it can not only set up Stealth Rock, but it can also tank Fire-type moves thanks to Heatproof.</p> "
      },
      {
        "name": "Choice Scarf (Ghost)",
        "description": "<p>Choice Scarf Gholdengo's ability to revenge kill threats such as Flutter Mane, Chien-Pao lacking Sucker Punch, and Dragapult, come into status-spreading Pokemon such as Klefki and Breloom due to Good as Gold, and inconvenience bulkier teams by preventing all forms of entry hazard removal with its ability and typing make it a prime pick for Ghost teams. Make it Rain greatly weakens Dark- and Normal-types such as Hydreigon and Indeedee, and it OHKOes Flutter Mane, Iron Valiant, and Chien-Pao. Shadow Ball lets Gholdengo clean types such as Psychic and Ghost late-game. Trick neutralizes defensive pivots such as Corviknight, Ting-Lu, and Clodsire, which typically switch into it. The last move of choice is dependent on what the Ghost team lacks; Focus Blast gives the team another way to defeat Choice Specs Greninja, Thunderbolt cleans Water- and Flying-teams, or Nasty Plot which turns Gholdengo into a massive threat against bulkier teams especially after their main specially defensive wall has been given a Choice Scarf with Trick.</p> <p>As Gholdengo provides the needed revenge killing capabilities on Ghost teams, teammates such as Flutter Mane and Dragapult are free to run sets like Choice Specs and Dragon Dance, respectively. Both also break down walls such as Clodsire and Gastrodon; in return, Gholdengo deals with Chien-Pao and Choice Scarf Gallade. Skeledirge walls most physical attackers and Fire-types such as Scovillain and Volcarona. Mimikyu provides a safety net against offensive types like rain Water and Ghost, checking Barraskewda and Choice Scarf Flutter Mane for the team, and it loves Gholdengo shutting down defensive walls such as Toxapex with Trick. Entry hazard setters in Brambleghast and Froslass are is also greatly appreciated, as they can set, remove, or prevent entry hazards for Gholdengo; in return, Gholdengo prevents their entry hazards from getting removed by Glimmora. Brambleghast also switches into Ground-types such as Ting-Lu and Great Tusk and deals with Water-types like Gastrodon and Dondozo, while Froslass can spread paralysis with Thunder Wave and bring down an opposing Pokemon with its Destiny Bond.</p> "
      },
      {"name": "Nasty Plot (Ghost)", "description": "<p>Survives Chien-Pao's Crunch and Choice Scarf Flutter Mane's Shadow Ball after Stealth Rock and OHKOs both back.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Neko", "user_id": 542526}, {"username": "kenn", "user_id": 604741}], "teams": [{"name": "Steel analysis by", "members": [{"username": "kenn", "user_id": 604741}]}, {"name": "Ghost analysis by", "members": [{"username": "Neko", "user_id": 542526}]}, {"name": "Quality checked by", "members": [{"username": "Swiffix", "user_id": 547532}, {"username": "maroon", "user_id": 305839}, {"username": "sasha", "user_id": 510532}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Wo-Chien": {"sets": [{"name": "Mixed Wall (Grass)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]},
  "Chien-Pao": {
    "sets": [
      {
        "name": "All-Out Attacker (Dark)",
        "description": "<p>Chien-Pao is an imposing force for any Dark team with its sky-high Speed, blitzing past threats like Iron Valiant and Greninja, and great Attack. Sword of Ruin lets it beat physical walls like Ting-Lu, Garganacl, and Toxapex, though it doesn't have great bulk, has to watch out for super effective priority moves from Scizor, Lokix, and Slither Wing, and struggles to break past walls like Dondozo and Quagsire. With Swords Dance, it can boost up to beat even the likes of Corviknight and Toxapex if it has Crunch. Fighting-type coverage picks off Dark-types like Kingambit and Greninja. Sacred Sword picks off weakened Garganacl, while Brick Break destroys opposing Dark or Fairy team's dual screens. Ice Shard stops common revenge killers like Choice Scarf Meowscarada, Flutter Mane, and Great Tusk.</p> <p>As Chien-Pao focuses on breaking down foes with its sheer power and Speed, it appreciates support from its teammates. Ting-Lu can set up Stealth Rock and Spikes, while Skuntank can set up Toxic Spikes and pressure Fairy-types, all of which make wallbreaking for Chien-Pao easier. Grimmsnarl provides Chien-Pao with dual screens support, making setting up easier. Sableye can burn opposing Pokemon and cripple them with Taunt and Knock Off, removing Heavy-Duty Boots and making foes susceptible to entry hazards, while also acting as a Fighting-type move switch-in. Choice Specs Greninja can clean up after Chien-Pao has done enough damage while also countering Fire-types that would annoy Chien-Pao such as Skeledirge and Cinderace if Chien-Pao does not have Crunch. Hydreigon can break Steel-types for Chien-Pao if it forgoes Fighting-type coverage or Swords Dance, beating Fighting-neutral Steel-types like Corviknight and Scizor. Choice Scarf Meowscarada is able to threaten Pokemon that counter Chien-Pao such as Quaquaval and Choice Scarf users such as Iron Valiant, Gholdengo, and Great Tusk while also being able to pivot to Chien-Pao with U-turn.</p> "
      },
      {
        "name": "Swords Dance Sweeper (Ice)",
        "description": "<p>Chien-Pao's high Speed, solid Attack, and good offensive typing allow it to be a very potent setup sweeper. Icicle Crash is preferred over Ice Spinner for its flinch chance and higher Base Power, the latter of which—among other things—allows it to always 2HKO Sableye and bulky Great Tusk, while Ice Spinner may miss out on these 2HKOs. Crunch allows Chien-Pao to hit Skeledirge and Gholdengo—two problematic Pokemon for Ice teams. Sacred Sword and Brick Break both allow Chien-Pao to threaten Dark-, Steel-, and Ice-types such as Kingambit and opposing Chien-Pao. Sacred Sword is stronger and comes with the ability to ignore Defense boosts, while Brick Break removes Reflect and Light Screen, which is extremely helpful against teams with support from Grimmsnarl or Klefki. Psychic Fangs is an alternative option to Sacred Sword or Brick Break to hit Toxapex and Fighting-types such as Paldean Tauros-F. Sucker Punch is significantly stronger than Ice Shard and allows Chien-Pao to hit Pokemon like Gholdengo, Scizor, and Flutter Mane.</p> <p>This set very much appreciates Aurora Veil support from Abomasnow, as it allows Chien-Pao to set up on many Pokemon that would otherwise threaten it out as well as allowing it to survive revenge killing attempts from the likes of Choice Scarf Meowscarada and Extreme Speed Dragonite. Spikes support from Froslass is also greatly appreciated, as they wear down Pokemon that may otherwise be difficult for Chien-Pao to break, such as Dondozo and Klefki. Although Chien-Pao is able to fit on practically any team, it pairs especially well with other powerful sweepers such as Baxcalibur and Cloyster, weakening or even KOing their checks such as Air Balloon Gholdengo and Skeledirge. Baxcalibur in particular can take on Pokemon such as Toxapex and Paldean Tauros-F with a powerful Earthquake, allowing Chien-Pao to KO them and sweep the opposing team; furthermore, Choice Band Baxcalibur pressures Chien-Pao answers such as Quagsire and Corviknight. Baxcalibur's Thermal Exchange also allows it to switch into Will-O-Wisp that would cripple Chien-Pao as well as be an emergency switch-in to a Fire-type attack. Shell Smash Cloyster appreciates the removal of Skeledirge and Froslass.</p> "
      },
      {
        "name": "Choice Band Wallbreaker (Ice)",
        "description": "<p>Choice Band Chien-Pao is a potent mid-game threat, powerful wallbreaker, and good late-game cleaner. Additionally, it is capable of breaking through physically defensive Pokemon such as Corviknight and Quagsire, both of which tend to be tough matchups for many other Ice staples. Icicle Crash is preferred over Ice Spinner for its flinch chance and slightly higher Base Power, notably being favored to 2HKO Azumarill and OHKO offensive Pelipper, neither of which are feats Ice Spinner is capable of. Sacred Sword and Brick Break provide crucial coverage for Pokemon such as Kingambit and opposing Chien-Pao, and Sucker Punch allows Chien-Pao to KO faster Pokemon such as Choice Scarf Gholdengo.</p> <p>This set heavily appreciates Spikes from Froslass to wear down its switch-ins, sometimes allowing it to grab KOs it would otherwise miss out on; for example, Crunch always 2HKOes physically defensive Toxapex with one layer of Spikes, but it is favored to not 2HKO without any Spikes. Rapid Spin support from Avalugg is also appreciated, allowing Chien-Pao more opportunities to enter the field. Since this set focuses on opening holes in teams, setup sweepers are excellent partners for it, as Chien-Pao can dent or remove their checks to allow the sweep to happen much more easily. Shell Smash Cloyster in particular appreciates Chien-Pao's ability to beat Gholdengo and significantly damage other Pokemon such as Corviknight that Cloyster may otherwise struggle to break through. Dragon Dance Baxcalibur appreciates Chien-Pao's ability to 2HKO Quagsire and physically defensive Corviknight, which normally would stop Baxcalibur in its tracks. Finally, Belly Drum Cetitan appreciates Chien-Pao's ability to break Unaware walls such as Skeledirge and Quagsire; in return, Cetitan acts as speed control if snow is in effect, aiding in Chien-Pao's weakness to Choice Scarf users such as Iron Moth.</p> "
      },
      {"name": "Choice Band (Dark)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}, {"username": "TL The Legend", "user_id": 514605}], "teams": [{"name": "Dark analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Ice analysis by", "members": [{"username": "TL The Legend", "user_id": 514605}]}, {"name": "Quality checked by", "members": [{"username": "maroon", "user_id": 305839}, {"username": "Neko", "user_id": 542526}, {"username": "Aqua Jet", "user_id": 531302}, {"username": "Ashbala", "user_id": 518038}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ken", "user_id": 594478}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "Defensive Hazard Setter (Dark)",
        "description": "<p>Ting-Lu is a fantastic asset for Dark teams due to its access to entry hazards and great bulk, supported further by Vessel of Ruin weakening special attackers such as Iron Valiant and Hatterene. Earthquake is a reliable STAB move that hits most of the metagame for decent damage while also scaring Clodsire out and preventing it from setting Toxic Spikes. Heavy Slam hits Fairy-types that would otherwise overpower Ting-Lu, such as Flutter Mane and Iron Valiant, while also threatening Hatterene trying to bounce back hazards. Stealth Rock and Spikes allow Ting-Lu to support wallbreakers such as Meowscarada or Greninja. Whirlwind allows Ting-Lu to phase out setup sweepers such as Dragonite and Curse Dondozo and rack up entry hazard damage, while Ruination provides consistent damage against other walls such as Amoonguss and Corviknight that don't mind any of Ting-Lu's other moves.</p> <p>Wallbreakers such as Meowscarada, Chien-Pao, Kingambit, and Greninja all appreciate Ting-Lu's ability to set entry hazards, as they wear down common defensive answers such as Toxapex, Iron Treads, and Dondozo. In return, they can scare out threats to Ting-Lu; Meowscarada can deal with Greninja, Chien-Pao and Greninja can threaten Great Tusk, and Kingambit can force out Fairy-types such as Hatterene. Skuntank is a good partner as well, since it offers a crucial neutrality to Fairy, threatens Fairy-types, and sets and clears Toxic Spikes, augmenting Ting-Lu's entry hazards and improving its longevity. Additionally, Skuntank can utilize Fire Spin to further chip down teams and trap Klefki, improving Ting-Lu's matchup against Fairy. In return, Ting-Lu can assist in Ground matchups through its bulk. Sableye is also a great partner due to its Fighting immunity, taking attacks Ting-Lu can't such as Great Tusk's and Iron Hands's Close Combat.</p> "
      },
      {
        "name": "Physically Defensive (Ground)",
        "description": "<p>Ting-Lu's exceptional bulk and utility options make it an invaluable asset to Ground teams, walling threats like Dragapult, Espathra, and Hydreigon. Earthquake threatens Pokemon such as Gholdengo, Kingambit, and Volcarona. Alternatively, Throat Chop hits Espathra for more damage and shuts down Air Balloon Gholdengo. Ruination allows Ting-Lu to quickly wear down the likes of opposing Ting-Lu, Hatterene, and Dragonite, while Body Press may be used to deal more damage to Chien-Pao, Kingambit, and Hydreigon. Spikes or Stealth Rock in conjunction with Whirlwind sets Ting-Lu apart from other entry hazard setters; it's capable of wearing down the opponent's defensive core and weakens threats such as Greninja, Meowscarada, and Baxcalibur. Additionally, Whirlwind phazes threatening sweepers like Scizor and Ceruledge.</p> <p>Ting-Lu's entry hazards are heavily appreciated by Great Tusk, which threatens out Choice Specs Flutter Mane, Gallade, and Greninja; Sandy Shocks, which deals with Water-types like Pelipper, Quaquaval, and Dondozo; and Garchomp, which threatens Corviknight, Rotom-C, and Breloom with its Fire-type coverage. Furthermore, Choice Scarf Great Tusk removes Heavy-Duty Boots from Sableye and Brambleghast via Knock Off to enhance Ting-Lu's phazing, which enables Clodsire and Gastrodon as entry hazard setters to wither down threats such as Greninja and Ceruledge more efficiently. Water Absorb Clodsire adds a Water immunity, can switch into attacks from Greninja, Quaquaval, and Meowscarada, and helps wear down the opposing team with Toxic Spikes or Toxic. Gastrodon walls Water-type Pokemon like Pelipper, Dondozo, and Rotom-W and assists with spreading entry hazards. Iron Treads eases Ting-Lu's pivoting by removing entry hazards with Rapid Spin and checks Fairy-types like Flutter Mane and Hatterene. Quagsire stalls out physical setup sweepers such as Mimikyu, Chien-Pao, and Iron Hands and also helps wear down defensive cores using Toxic.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Dead by Daylight", "user_id": 571069}], "teams": [{"name": "Dark analysis by", "members": [{"username": "Dead by Daylight", "user_id": 571069}]}, {"name": "Ground analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "Swiffix", "user_id": 547532}, {"username": "maroon", "user_id": 305839}, {"username": "sasha", "user_id": 510532}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Lumii", "user_id": 493772}]}]}
  },
  "Iron Valiant": {
    "sets": [
      {
        "name": "Choice Specs (Fighting)",
        "description": "<p>Iron Valiant is a special attacker with an unmatched Speed tier in a sea of physical attackers, making it a solid pick for Fighting teams. It also has a spammable Fairy STAB move in Moonblast, which allows it to ease the Dark match up by threatening Sableye while also neutering opposing Fighting-types such as Great Tusk and Breloom. Thunderbolt hits Water- and Flying-types such as Dondozo and Corviknight. Psyshock hits Poison-types such as Toxapex, Amoonguss, and Clodsire, whereas Future Sight can apply pressure to opponents like Toxapex for teammates such as Breloom and Gallade. Shadow Ball hits Ghost-types such as Gholdengo and Skeledirge. Aura Sphere can be used instead as a hard-hitting STAB move, while Trick is a neat option that cripples potential switch-ins such as Toxapex, Amoonguss, Clodsire, and Skuntank.</p> <p>Wallbreakers such as Breloom and Gallade appreciate Iron Valiant's ability to take out physical walls as well as its ability to pressure the opponent with Future Sight. Assault Vest Iron Hands is a fantastic partner as well thanks to its ginormous HP stat that lets it deal with Fairy-types such as Flutter Mane and Hatterene that can outspeed or wall Iron Valiant. Choice Scarf users such as Flamigo, Quaquaval, and Slither Wing pressure Pokemon faster than Iron Valiant such as Greninja, Dragapult, and Cinderace. Tauros-F is another fantastic partner thanks to its ability to shatter dual screens with Raging Bull, making Iron Valiant more effective in matchups against Dark, Fairy, and Ice, all while avoiding burns thanks to its part Fire typing, which helps against Ghost and Dark teams.</p> "
      },
      {
        "name": "Choice Scarf (Fairy)",
        "description": "<p>Iron Valiant is a very valuable asset for Fairy teams with the combination of its amazing Speed tier, typing, and offensive stats. One of Iron Valiant's best qualities for Fairy teams is its access to Fighting-type STAB moves to counter Steel-types. Thunderbolt is a good option to hit Corviknight, Dondozo, and Toxapex super effectively and make cleaning up against Flying and Water teams easier after the Ground-type is removed. Energy Ball is a good alternative to more easily beat specially defensive Gastrodon and Rotom-W, but Grass Knot is an option to beat Dondozo after Spikes. Psyshock is a good tool versus Poison-types like Clodsire, Iron Moth and Amoonguss, while Shadow Ball lets it hit Skeledirge and Gholdengo that otherwise wall Iron Valiant. Trick is another great option to hinder defensive switch-ins like Toxapex, Corviknight, and Clodsire if Iron Valiant forgoes the moves to deal with them. Choice Scarf makes Iron Valiant an excellent revenge killer, being able to outrun threats such as Dragapult, Chien-Pao, and slower Choice Scarf users like Iron Moth and Gholdengo.</p> <p>Iron Valiant has amazing coverage, which makes it an effective cleaner; however, it cannot run all of them at once. Hence, it appreciates teammates that can cover what it cannot, and it also appreciates teammates that help it switch in, as it is quite frail. Klefki can set up dual screens, which aids it in switching, and also set up Spikes, which makes it easier for Iron Valiant to clean. Klefki is also a good switch-in against opposing Fairy-types like Mimikyu. Flutter Mane and Mimikyu can weaken teams to let Iron Valiant clean up or they can clean up after it. They also deal with Ghost-types such as Gholdengo, Flutter Mane, and Skeledirge if it forgoes Shadow Ball. Azumarill checks Fire-types such as Paldean Tauros-F, Volcarona, and Iron Moth and Ground-types such as Iron Treads and Clodsire. Hatterene is a great partner, as it can break through Poison-types like Glimmora, Toxapex, and Amoonguss while also preventing entry hazards. Tinkaton can set up Stealth Rock and is a good counter to Fairy-types that check Iron Valiant otherwise such as Hatterene, Flutter Mane, and opposing Iron Valiant.</p> "
      },
      {"name": "Choice Band (Fairy)"},
      {"name": "Special Attacker (Fairy)", "description": "<p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. These will be updated as the metagame continues to develop. Stay tuned!</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}, {"username": "kenn", "user_id": 604741}], "teams": [{"name": "Fighting analysis by", "members": [{"username": "kenn", "user_id": 604741}]}, {"name": "Fairy analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Quality checked by", "members": [{"username": "CrossHeart", "user_id": 593863}, {"username": "Giyu", "user_id": 574288}, {"username": "Neko", "user_id": 542526}, {"username": "Aqua Jet", "user_id": 531302}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Lunaflare", "user_id": 430518}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Walking Wake": {
    "sets": [
      {
        "name": "Choice Scarf (Dragon)",
        "description": "<p>Walking Wake is a great Choice Scarf user for Dragon teams due to its part-Water typing and coverage, allowing it to revenge kill a plethora of threats such as Chien-Pao, Baxcalibur, and Scizor. It also outspeeds common Choice Scarf users such as Great Tusk, Flamigo, and Iron Treads, which lets it clean Ground, Flying, and Fire teams late-game. With strong STAB moves in Draco Meteor and Hydro Pump, Walking Wake blows past Baxcalibur and Great Tusk. Flamethrower roasts Steel-types like Scizor and Gholdengo, though it lacks the firepower to 2HKO specially defensive Corviknight. Hydro Steam, emboldened by sun, lets Walking Wake demolish Fire teams. Alternatively, Dragon Pulse provides a weaker but more consistent STAB attack, which is great against opposing Dragon teams. The given EV spread and Timid nature cause Protosynthesis to boost Speed, allowing Walking Wake to outspeed Chlorophyll Scovillain and Choice Scarf Cinderace.</p> <p>Choice Specs Dragapult is an excellent teammate, as it can wear down or eliminate bulky threats such as Corviknight and Hatterene and is also fast enough to deal with Choice Specs Flutter Mane for Walking Wake. Baxcalibur, Hydreigon, and Haxorus appreciate Walking Wake providing speed control, allowing them to wallbreak more effectively. These teammates also batter down defensive walls such as Clodsire, Gholdengo, and Toxapex, making cleaning up with Walking Wake much easier. Dragalge can pivot into Fairy-type moves from Choice Scarf Meowscarada and Choice Scarf Iron Valiant as well as set Toxic Spikes to further wear down the opposing team. This also synergizes well with Garchomp, which sets entry hazards in Spikes and Stealth Rock, phazes the opposition with Dragon Tail or Roar, and pressures Poison- and Steel-types like Clodsire and Klefki. Cyclizar gets rid of entry hazards for Walking Wake, allowing it to come onto the field more.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Neko", "user_id": 542526}], "teams": [{"name": "Dragon analysis by", "members": [{"username": "Neko", "user_id": 542526}]}, {"name": "Quality checked by", "members": [{"username": "Ashbala", "user_id": 518038}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Iron Leaves": {"sets": [{"name": "Swords Dance (Grass)", "description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p> "}]}
}