{
  "Dugtrio": {
    "sets": [
      {
        "name": "Teach Me How to Duggy (Trapper)",
        "description": "<ul> <li>Dugtrio functions as a valuable revenge killer and trapper for Miraidon, being able to OHKO it with a bit of chip damage or Tera Ground.</li> <li>Dugtrio can trap other threats, most notably Chi-Yu but also Iron Bundle without Electric Terrain, Choice Band Chien-Pao not using Ice Shard, Iron Treads, Toxapex, Clodsire, and Blissey.</li> <li>Stealth Rock can be used to quickly set up entry hazards should Dugtrio's trapping abilities no longer be required.</li> <li>Memento will greatly weaken the offensive abilities of whatever is on the field, allowing Dugtrio's teammates to set up. It can also be used in cases where Dugtrio cannot KO a boosting threat.</li> <li>As Dugtrio often forces a reactionary Terastallization from the opponent, Tera Ground is chosen for the extra power in general, and for taking out non-Terastallized Miraidon from full health.</li> <li>Tera Fairy is an alternative option, as Fairy Tera Blast can take out Koraidon and weakened Great Tusk. Fairy's resistances can be useful against Sucker Punch Kingambit as well as Miraidon and Koraidon Choice-locked into a Dragon-type move.</li> <li>Sucker Punch can be helpful damage in a pinch against weakened faster threats like Life Orb Flutter Mane in sun.</li> <li>The given EVs allow Dugtrio to always survive a -2 Draco Meteor from Miraidon and outspeed +1 base 100 Speed Pokemon such as Chi-Yu.</li> <li>Take care when trapping Miraidon, as Terastallizing to a type other than Electric allows it to take an Earthquake it would otherwise faint to.</li> <li>Dugtrio should only be used on team archetypes that are designed to excel once Miraidon and Chi-Yu are eliminated, particularly bulkier teams that appreciate the aforementioned wallbreakers being gone.</li> <li>Miraidon itself works as a fantastic teammate, as it doesn't have to worry about opposing Miraidon revenge killing it, and Dugtrio trapping Iron Treads, Clodsire, and Blissey makes sweeping much easier.</li> <li>Corviknight is a fantastic partner for taking on Chien-Pao and letting Dugtrio come in on Miraidon with U-turn.</li> <li>RestTalk Dondozo is another great teammate, as Curse makes it extremely hard to stop once Miraidon is eliminated, and it checks a myriad of offensive threats that Dugtrio struggles against like Koraidon, Chien-Pao, and Palafin.</li> <li>Dugtrio cannot always check Miraidon by itself, so Pokemon like Ting-Lu, Iron Treads, and Clodsire are highly recommended. These Pokemon can also set entry hazards, which makes Dugtrio's job significantly easier.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 50695, "username": "Manaphy"}]}
  },
  "Cloyster": {"sets": [{"name": "Lead", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Chansey": {"sets": [{"name": "Pink Blob", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Ditto": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<ul> <li>Ditto is a niche revenge killer that can also be used to attempt a reverse sweep, but it must be wary of threats that may counter it with a surprise Terastallization, such as Tera Fairy Miraidon, Tera Fire Koraidon, Tera Ice Iron Bundle, and Tera Water Gholdengo.</li> <li>Ditto doesn't add much value to teams on its own outside of helping overwhelm opposing checks. It is also strongly prediction reliant.</li> <li>Maximum bulk and minimum Speed allow Ditto to force opposing Ditto to trigger Imposter first and run out of PP quicker.</li> <li>Tera Fairy defeats Choice Scarf Miraidon, Koraidon, and Walking Wake that may try to attack it with a Dragon-type move.</li> <li>Ditto is rarely a reliable check for reasons explained earlier, so it appreciates support from backup checks, especially for potent threats that it fails to revenge kill such as Swords Dance Chien-Pao, Double Dance Miraidon, and Bulk Up Great Tusk. Thus, teammates like Toxapex, Skeledirge, Ting-Lu, Clodsire, and Iron Treads are good picks.</li> <li>Ditto's ability to revenge kill many strong threats makes teambuilding flexible, allowing offensive Pokemon like Miraidon, Iron Bundle, Chien-Pao, and Koraidon to fit more easily.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 374620, "username": "pichus"}]}
  },
  "Dragonite": {"sets": [{"name": "Dragon Dance", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Azumarill": {"sets": [{"name": "Physically Offensive"}, {"name": "Defensive", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Slowking": {
    "sets": [
      {
        "name": "Slowking",
        "description": "<ul> <li>Slowking acts as a slow pivot with the unique ability to summon snow thanks to the move Chilly Reception. This allows Slowking to safely bring in wallbreakers against defensive Pokemon such as Toxapex while also making them less prone to being revenge killed by Protosynthesis users.</li> <li>Future Sight lets Slowking help wallbreakers such as Koraidon and Chien Pao break past defensive Pokemon such as Toxapex and Clodsire.</li> <li>Chilling Water lets Slowking take on physical setup sweepers such as Palafin and Great Tusk one-on-one.</li> <li>Thunder Wave can be used to cripple wallbreakers that switch into Slowking such as Flutter Mane and Iron Bundle. Surf is also an option to pressure Great Tusk, Iron Treads, and Chi-Yu more after switching in.</li> <li>Heavy-Duty Boots lets Slowking pivot without worrying about entry hazards. Kasib Berry can be used to better take on Flutter Mane, but the lack of Heavy-Duty Boots makes Slowking significantly more weak to entry hazards, so teammates such as Great Tusk and Iron Treads are required for entry hazard removal.</li> <li>Tera Fairy allows Slowking to take Dark- and Dragon-type attacks such as Koraidon's Outrage, Chien-Pao's Crunch, and Chi-Yu's Dark Pulsewhile maintaining a resistance to Fighting-type attacks such as Koraidon and Great Tusk's Close Combat.</li> <li>Slowking fits best on bulky offense teams that appreciate Slowking's ability to pivot in strong wallbreakers with Chilly Reception against passive walls.</li> <li>Chien-Pao is a fantastic partner for Slowking because Chien-Pao appreciates Slowking's Future Sight being able to break past Toxapex and Chilly Reception safely bringing Chien-Pao in. Iron Bundle is another fantastic partner because it appreciates Slowking's Chilly Reception and is able to freely use Blizzard, making it a much more effective wallbreaker. Koraidon also benefits from Slowking's Future Sight breaking through Toxapex and Chilly Reception both safely pivoting it in and resetting sun turns. Additionally, both of the aforementioned Ice-types get Defense boosts in snow, which can be useful for surviving neutral attacks such as Earthquake from Great Tusk, Iron Treads, and Ting-Lu and Jet Punch from Palafin.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 595062, "username": "Takatk"}]}
  },
  "Scizor": {"sets": [{"name": "Choice Band", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Blissey": {
    "sets": [
      {
        "name": "Pink Blob (Specially Defensive)",
        "description": "<ul> <li>Blissey functions as an blanket check to special attackers on balance and stall teams, being especially useful against hard-to-check special threats such as Calm Mind Miraidon, Chi-Yu, Iron Bundle, and Walking Wake.</li> <li>Seismic Toss is Blissey's only way to reliably deal damage to most opposing Pokemon, while Shadow Ball is able to do decent damage to Flutter Mane.</li> <li>Thunder Wave is extremely useful to cripple common switch-ins such as Koraidon and can also find use against Flutter Mane and Terastallized Miraidon.</li> <li>Blissey is a reliable setter of Stealth Rock, which can free up moveslots on Great Tusk and Iron Treads, but you should note that opposing Great Tusk and Iron Treads as well as Corviknight have little difficulty clearing entry hazards on Blissey.</li> <li>The Tera Type is quite flexible. Tera Ground is very useful against Calm Mind + Parabolic Charge Miraidon sets, as it completely negates their recovery and allows Blissey to force out them out.</li> <li>Tera Fire gives Blissey the ability to better take on Chi-Yu, with Heavy-Duty Boots negating the Stealth Rock weakness.</li> <li>Tera Ghost provides a Fighting-type immunity and allows Blissey to switch out of Dugtrio and Gothitelle.</li> <li>Solid defensive walls such as Skeledirge, Great Tusk, Dondozo, Scream Tail, and Dachsbun are good teammates to take on physical attackers like Koraidon that commonly come in on Blissey.</li> <li>Blissey is not capable of handling all Miraidon sets on its own, so Ting-Lu, Clodsire, and Iron Treads are heavily recommended teammates. In turn, these Ground-types have less pressure on them to stay healthy and can focus more on setting entry hazards.</li> <li>Care should be taken against Miraidon and Iron Bundle, which often use pivoting moves or Taunt to gain momentum on Blissey. Proper prediction with Blissey's teammates may be required to handle this.</li> <li>As a result, Rocky Helmet is an option, as it does damage to U-turn, Flip Turn, and Electro Drift users, making Miraidon and Iron Bundle unable to pivot on Blissey for free. If running Rocky Helmet, make sure you have plenty of Pokemon that can deal with entry hazards, such as Corviknight, Great Tusk, Iron Treads, and Hatterene.</li> <li>Flutter Mane is difficult for Blissey to reliably check due to Taunt and Psyshock sets, so Corviknight and Garganacl can help pick up the slack. In return, both appreciate Blissey being a safe switch-in to Iron Bundle.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 50695, "username": "Manaphy"}]}
  },
  "Tyranitar": {"sets": [{"name": "Defensive", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Pelipper": {
    "sets": [
      {
        "name": "Utility Pivot",
        "description": "<ul> <li>Pelipper's unique typing and ability allow it to check strong physical attackers like Koraidon, Great Tusk, and Iron Treads.</li> <li>Heavy-Duty Boots is essential for Pelipper to switch in frequently without worrying about Stealth Rock damage; however, Damp Rock may be considered on offensive rain teams and other builds that have solid entry hazard removal.</li> <li>Pelipper's access to reliable recovery and Knock Off lets it switch into and cripple passive Pokemon like Ting-Lu, Corviknight, and defensive variants of Iron Treads and Great Tusk.</li> <li>0 Speed IVs make Pelipper slower than Corviknight and Ting-Lu, allowing it to safely pivot into a teammate.</li> <li>Pelipper can Terastallize into the Ground typing to absorb the rare Wild Charge from Koraidon and Iron Treads while also letting it survive an Electric-type attack from Miraidon and Gothitelle in a pinch and pivot to a teammate that checks them. Alternatively, Tera Fairy Pelipper can wall every Koraidon set.</li> <li>Most special attackers in the tier threaten Pelipper, so it is necessary to pair it with special walls such as Ting-Lu, Iron Treads, Corviknight, and Clodsire. Physical walls like Skeledirge and defensive Great Tusk are also greatly appreciated as backup checks to Koraidon, since Choice Band and Wild Charge variants can break through Pelipper.</li> <li>Offensive teammates such as Iron Bundle, Palafin, Tera Water Miraidon, and Floatzel benefit from Pelipper's ability to set rain and pivot safely into them.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 537354, "username": "Mashing"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 374620, "username": "pichus"}]}
  },
  "Masquerain": {
    "sets": [
      {
        "name": "Sticky Web",
        "description": "<ul> <li>Masquerain is a solid Sticky Web setter in Ubers with decent utility.</li> <li>Tailwind allows Masquerain's teammates to outspeed Choice Scarf users like Koraidon and Miraidon, Booster Energy Flutter Mane, and Quark Drive-boosted Iron Bundle with Heavy-Duty Boots for a few turns, as these foes are not slowed down enough by Sticky Web.</li> <li>Whirlwind phazes sweepers that may try to set up on Masquerain, especially Swords Dance + Flame Charge Koraidon, Calm Mind Miraidon, and Substitute + Bulk Up Great Tusk.</li> <li>If opponents exploit Masquerain's passive nature by spamming switches to stall out Tailwind turns, U-turn lets it preserve momentum. Alternatively, Stun Spore cripples lead Pokemon like Iron Bundle, Chien-Pao, and Koraidon that try to stop Masquerain from setting up Sticky Web.</li> <li>Tera Ghost can block Rapid Spin from Iron Treads and Great Tusk in a pinch.</li> <li>It is essential to pair Masquerain with Pokemon that block entry hazard removal, such as Gholdengo, Annhilape, and Taunt users like Flutter Mane and Iron Bundle.</li> <li>Masquerain fits only on hyper offense teams: having multiple strong teammates such as Koraidon, Miraidon, Chien-Pao, Great Tusk, and Iron Bundle is necessary to capitalize on Sticky Web.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 374620, "username": "pichus"}]}
  },
  "Garchomp": {"sets": [{"name": "Bulky Lead", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Hippowdon": {"sets": [{"name": "Defensive", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Froslass": {
    "sets": [
      {
        "name": "Spikes Lead",
        "description": "<ul> <li>Thanks to its Ghost typing and Cursed Body, Froslass is one of the best suicide leads in Ubers. It is unique for having a strong chance of preventing Glimmora from gaining an entry hazard advantage. Great Tusk and Iron Treads also cannot easily anti-lead Froslass with Rapid Spin.</li> <li>Cursed Body sometimes allows Froslass to set more entry hazards than it would normally. In combination with Focus Sash, it has a 51% chance of activating on contact moves.</li> <li>Taunt and Icy Wind are both effective at preventing setup from opposing Pokemon. Taunt also prevents Defog from Corviknight.</li> <li>The last slot is flexible. Thunder Wave can prove useful against faster leads such as Koraidon, as well as crippling Corviknight.</li> <li>Shadow Ball hits Taunt Iron Bundle and Hatterene for great damage.</li> <li>Destiny Bond is a strong tool to play mindgames and force switches, which can be used to set more Spikes layers.</li> <li>Tera Steel is chosen in case blocking Glimmora's Mortal Spin is necessary. Tera Dark can be used to block Taunt from Grimmsnarl.</li> <li>Froslass works best with hyper offense setup sweepers such as Calm Mind Miraidon, Swords Dance Chien-Pao, and Calm Mind Flutter Mane, all of which can sweep much easier with Spikes support. Flutter Mane is a particularly notable teammate for blocking Rapid Spin once Froslass is eliminated.</li> <li>Grimmsnarl is an effective partner for further supporting hyper offense teammates by setting dual screens. Spikes also does significant damage to Grimmsnarl's nemesis, Ting-Lu.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 507268, "username": "ox04"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 50695, "username": "Manaphy"}]}
  },
  "Gothitelle": {
    "sets": [
      {
        "name": "Choice Item",
        "description": "<ul> <li>Shadow Tag Gothitelle can trap most defensive Pokemon, paving the way for its teammates to sweep.</li> <li>Trick facilitates trapping defensive walls like Ting-Lu and Great Tusk by locking them into an unfavorable move. Psychic targets Great Tusk and Toxapex, while Psyshock helps Gothitelle trap Clodsire better. Thunderbolt allows Gothitelle to trap Corviknight if it's not running U-turn or has a Choice item. Grass Knot KOes Great Tusk, Dondozo and hits Ting-Lu hard. Taunt is used to limit phazing attempts and Choice locked status moves, forcing the trapped Pokemon to use Struggle.</li> <li>Rest allows Gothitelle to more effectively PP stall foes and remain healthy.</li> <li>Choice Specs Gothitelle plays a more offensive role, aiming to rack up KOs. On the other hand, Choice Scarf variants are more likely to use Trick to beat opposing walls.</li> <li>32 HP and 4 Defense EVs allow Gothitelle to avoid being 2HKOed and 3HKOed from Ting-Lu's and Clodsire's Earthquake, respectively. 220 Speed EVs allow Choice Specs variants to outspeed defensive Great Tusk and Annihilape and Choice Scarf variants to outspeed offensive Great Tusk.</li> <li>Gothitelle usually uses its Tera type to trap and beat Choice locked foes it otherwise would not trap; Tera Fairy beats Miraidon and Koraidon Choice locked into Dragon moves, Tera Water tanks Koraidon's Flare Blitz and Iron Bundle's Ice Beam, and Tera Flying avoids Earthquake from Ting-Lu and Great Tusk.</li> <li>Gothitelle's favorite partners are powerful sweepers and cleaners such as Miraidon, Koraidon, Flutter Mane, Iron Bundle, Kingambit, and Chien-Pao, all of which appreciate Gothitelle removing one or more of their checks.</li> </ul> "
      },
      {
        "name": "Delay Goth (Trapper)",
        "description": "<ul> <li>This Gothitelle set aims to trap and PP stall weak walls so that its offensive teammates can take over mid- to late-game. This Gothitelle set can come in on weak walls like Clodsire, Ting-Lu, Alomomola, and defensive Great Tusk and beat them by PP stalling them.</li> <li>Charm and Calm Mind are use to boost Gothitelle's survivability while PP stalling its foe.</li> <li>Taunt is used to stop phazing attempts and make the trapped Pokemon use their attacking PP, thus depleting their PP faster. Stored Power is an alternative for teams that benefit from having more wallbreaking potential or that have a good matchup against the Dark-types of the tier like Chien-Pao and Kingambit.</li> <li>The 24 Speed EVs allow Gothitelle to be faster than uninvested Corviknight, trapping it if it's not running U-turn. The Defense investment is used to tank hits well for PP stalling purposes, with attacks such as Ting-Lu's Earthquake being only a 4HKO.</li> <li>Tera Fairy is used for its solid defensive typing and ability to trap Choice-locked Dragon-types like Miraidon and Koraidon, Tera Water is an option for its overall great defensive typing, granting resistances to Chien-Pao's Icicle Crash, Koraidon's Flare Blitz, and Iron Bundle's Hydro Pump or Ice Beam. Lastly, Tera Ground is used to allow Gothitelle to trap Miraidon locked into an Electric move or defeat Double Dance sets one-on-one.</li> <li>Gothitelle's favorite partners are powerful sweepers and cleaners, especially setup sweepers that take advantage of defensive Pokemon having their PP drained to set up easily and without risk. Common examples include Swords Dance Koraidon, Swords Dance Chien-Pao, Double Dance Miraidon, and Calm Mind Flutter Mane.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 467437, "username": "Dawn of Ares"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 537354, "username": "Mashing"}]}
  },
  "Alomomola": {"sets": [{"name": "Defensive Pivot", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Hawlucha": {
    "sets": [
      {
        "name": "Unburden Sweeper",
        "description": "<ul> <li>Hawlucha is a niche pick as a potentially threatening Unburden sweeper that only fits on hyper offense teams and is reliant on Miraidon's Electric Terrain to function.</li> <li>Taunt can be used to shut down phazing attempts from Pokemon like Ting-Lu, status moves like Toxic from Clodsire, setup attempts from opposing sweepers like Bulk Up Palafin and Espathra, and recovery attempts from Skeledirge, Corviknight, and Toxapex.</li> <li>Substitute lets Hawlucha take any one hit, despite its frailty, giving it an opportunity to set up with Swords Dance. Substitute also blocks status moves like Toxic from Clodsire and Toxapex and Will-O-Wisp from Skeledirge.</li> <li>Protect lets Hawlucha scout for potential Terastallizations like Tera Fairy Miraidon or Tera Ghost Ting-Lu.</li> <li>Roost allows Hawlucha to stay healthy over the course of its sweep, keeping it out of range of priority like Chien-Pao's Sucker Punch.</li> <li>140 EVs in Speed allow Hawlucha to outrun +1 Iron Bundle and +2 Miraidon when Unburden is active.</li> <li>Tera Fighting removes Hawlucha’s Flying type and powers up Close Combat, letting it OHKO Miraidon and removing its weakness to Chien-Pao’s Ice Shard.</li> <li>Hawlucha is an all-or-nothing late-game sweeper that, has to fully commit to a sweep once it activates Unburden's speed boost. For this reason, it's only a decent pick on hyper offensive teams.</li> <li>Miraidon is a necessary partner, activating Hawlucha’s Electric Seed with the Electric Terrain it sets via Hadron Engine. It also threatens Dondozo, a physical wall and Unaware Pokemon that can halt Hawlucha’s sweep. Hawlucha also threatens Clodsire, Iron Treads, and Ting-Lu, all of which check or counter setup variants of Miraidon, allowing Miraidon to clean up should Hawlucha’s sweep fail.</li> <li>Iron Bundle threatens all three common Unaware Pokemon in Dondozo, Clodsire, and Skeledirge, as well as Toxapex, paving the way for Hawlucha to sweep.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 415367, "username": "Eledyr"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}]}
  },
  "Toxapex": {
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<ul> <li>Toxic prevents strong attackers like Miraidon, Iron Bundle, and Great Tusk and walls like Ting-Lu from switching into Toxapex for free and threatening it. Baneful Bunker is useful to scout attacks from Miraidon, Iron Bundle, and Flutter Mane and to get a surprise poison on Koraidon and Chien-Pao, especially if they are locked into an attack.</li> <li>Chilling Water allows Toxapex to beat Taunt + Bulk Up Palafin and Quaquaval and helps it be less passive against Great Tusk and Iron Treads. Alternatively, Surf deals more damage to Chien-Pao, Annihilape, Chi-Yu, and Gholdengo.</li> <li>Rocky Helmet secures decent chip damage on Pokemon that try to exploit Toxapex's passive nature, such as Choice Scarf Koraidon using U-turn to pivot to another teammate or Chien-Pao using Crunch. However, Eject Button is an option to absorb a hit and get immediate momentum in the game.</li> <li>Tera Ground Toxapex can comfortably survive otherwise super effective attacks from Great Tusk, Iron Treads, and Dugtrio, while Tera Fairy is helpful to weaken attacks such as Freeze-Dry from Iron Bundle, Crunch from Chien-Pao, and Outrage from Koraidon.</li> <li>Toxapex cannot reliably beat Swords Dance and Choice Band variants of Chien-Pao and Koraidon on its own, so it must be paired with backup checks such as Skeledirge, Alomomola, Great Tusk, and Corviknight. Ting-Lu, Iron Treads, and Clodsire are good special walls that check strong special attackers and set entry hazards so they can't switch into Toxapex for free.</li> <li>Toxapex creates many opportunities for wallbreakers and sweepers like Chien-Pao, Kingambit, Annihilape, Iron Bundle, Miraidon, and Koraidon to flourish while functioning as a solid check to the Pokemon that revenge kill them.</li> <li>Toxapex acts as a pivot that can scout for attacks, especially from passive Pokemon, as it absorbs their hits and weakens them with Rocky Helmet damage or Toxic to bring them in range of attacks from its teammates.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 249382, "username": "Aberforth"}, {"user_id": 306317, "username": "corvere"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 374620, "username": "pichus"}]}
  },
  "Corviknight": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<ul> <li>Corviknight's high physical bulk gives it a strong defensive presence in the tier. It is one of the few consistent counters to strong Ground-types like Great Tusk, physical attackers like Chien-Pao, and some special attackers like non-Choice Specs Iron Bundle. Furthermore, its access to Defog also makes it a solid entry hazard remover, though it struggles against Gholdengo.</li> <li>Body Press provides Corviknight with a way to leverage its high Defense stat, doing significant damage to Fighting-weak Pokemon.</li> <li>Brave Bird allows Corviknight to threaten Flutter Mane and Great Tusk. Alternatively, Iron Head can be used to threaten the former while avoiding recoil damage.</li> <li>Maximum HP investment and enough Defense to check Chien-Pao is combined with Leftovers and 96 Special Defense EVs, which allows Corviknight to take two Mystical Fires from most Flutter Mane, as well as giving it the ability to take on non-Choice Specs Iron Bundle and weaker attacks like Freeze-Dry from Choice Specs Iron Bundle.</li> <li>Tera Steel or Flying can be used to shed the weaknesses of Corviknight's dual typing: Tera Steel allows Corviknight to resist Ice-type attacks from Chien-Pao, while Tera Flying allows Corviknight to resist Great Tusk's Fighting-type attacks. Depending on your choice, Terastallization also amplifies the power of either Iron Head or Brave Bird.</li> <li>Corviknight works well as a part of a defensive core with Pokemon like Ting-Lu and Blissey, which can handle threats like Miraidon that obliterate Corviknight. Additionally, Corviknight makes a great partner for offensive threats like Chi-Yu, which appreciate a teammate that easily switches into Ting-Lu, or Great Tusk, which appreciates opposing Great Tusk being worn down.</li> </ul> "
      },
      {
        "name": "Specially Defensive",
        "description": "<ul> <li>Specially defensive Corviknight can switch into foes like Flutter Mane, Iron Bundle, Gholdengo, and Glimmora.</li> <li>U-turn is used to make Corviknight an effective defensive pivot that can maintain momentum against foes that force it out such as Miraidon and Koraidon.</li> <li>Mirror Armor allows Corviknight to check Mystical Fire Flutter Mane, which would otherwise beat it. Alternatively, when paired with Pressure, Protect enables Corviknight to avoid being 2HKOed by Hydro Pump from Choice Specs Iron Bundle, as well as allowing Corviknight to deplete PP with Pressure more effectively.</li> <li>Corviknight can use Tera Steel to get rid of its weakness to Electric and better take on Ice-type moves from Iron Bundle. Alternatively, it can opt to use Tera Ground to become immune to Miraidon's powerful Electro Drift.</li> <li>Specially defensive Corviknight needs help dealing with strong physical wallbreakers such as Chien-Pao from teammates like Dondozo and Scream Tail. Furthermore, Pokemon that are especially threatened by Flutter Mane and Iron Bundle, such as Koraidon, Great Tusk, and Skeledirge, are able to rely on specially defensive Corviknight as a consistent switch-in.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 274590, "username": "SiTuM"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 342456, "username": "Drifting"}]}
  },
  "Hatterene": {"sets": [{"name": "Calm Mind", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Grimmsnarl": {
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<ul> <li>Grimmsnarl is a prominent part of Ubers hyper offense teams as the most reliable dual screens setter in the tier.</li> <li>Taunt stops would-be setup sweepers, prevents entry hazards from Pokemon like Froslass and Glimmora, and stops Corviknight from using Defog.</li> <li>Play Rough is mandatory to deal decent damage to one of the most common Pokemon in the tier in Ting-Lu, which is immune to Taunt and can use Grimmsnarl as setup bait for Spikes, damage it greatly with Ruination, and phaze any incoming Pokemon with Whirlwind. In a pinch, Play Rough also does good damage to Miraidon and Koraidon.</li> <li>Tera Ghost is chosen to prevent Great Tusk and Iron Treads from using Rapid Spin, while Tera Steel provides useful resistances, most notably to Fairy-type attacks.</li> <li>Grimmsnarl works well when paired with a suicide lead such as Froslass or Glimmora, as they can set up Spikes and Toxic Spikes, thereby giving any setup sweepers a much easier time sweeping.</li> <li>Dual screens support gives Pokemon such as Calm Mind Miraidon, Swords Dance Koraidon, and Swords Dance Chien-Pao an easier time setting up and makes revenge killing them significantly harder.</li> <li>Iron Moth is a notable teammate for being a strong setup sweeper that can also absorb Toxic Spikes.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 306317, "username": "corvere"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 50695, "username": "Manaphy"}]}
  },
  "Dragapult": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<ul> <li>Dragapult's niche comes from its unparalleled natural Speed, making it the fastest Pokemon in Ubers. This, in conjunction with Infiltrator, allows it to revenge kill every unboosted Pokemon in the metagame while ignoring Substitute and dual screens.</li> <li>However, Dragapult is very weak by Ubers standards, provides almost no defensive utility to a team, and usually fails to fulfill its niche as a revenge killer due to the prevalence of Speed-boosting Quark Drive and Protosynthesis Pokemon in Ubers.</li> <li>Hex becomes stronger than Shadow Ball when boosted by status; it should only be used with Will-O-Wisp or with Toxic Spikes support from Pokemon like Toxapex and Clodsire.</li> <li>Will-O-Wisp cripples common Dragapult switch-ins such as Ting-Lu, Toxapex, and Clodsire.</li> <li>Tera Ghost lets Dragapult 2HKO Toxapex with Shadow Ball and Clodsire with a boosted Hex; it also retains Dragapult's useful Fighting immunity while giving it a neutrality to Dragon- and Fairy-type attacks, letting it survive a Dragon Claw from Choice Scarf Koraidon in a pinch.</li> <li>Dragapult is a revenge killer best suited for bulky offense teams that can't afford to run frail Speed-boosting Pokemon.</li> <li>Strong wallbreakers like Choice Band Koraidon and Chien-Pao are recommended as teammates, as Dragapult lacks immediate breaking power. Defensive Pokemon like Ting-Lu, Toxapex, and Clodsire are also helpful, as they can setup Spikes or spread status to help Dragapult break more easily.</li> </ul> "
      },
      {
        "name": "Pivot",
        "description": "<ul> <li>Dragapult is a good pivot in Ubers thanks to its high Speed stat and support moves like Will-O-Wisp and U-turn; its decent bulk also lets it switch into walls like Toxapex and Corviknight without fearing much, making it a surprisingly decent annoyance against bulkier teams.</li> <li>The given EVs allow for Dragon Darts to 2HKO Clodsire after Spikes damage.</li> <li>U-turn lets Dragapult pivot out of checks like Ting-Lu. Substitute can be used instead, easing prediction and allowing Dragapult to click Will-O-Wisp more freely.</li> <li>A boosted Hex will chip down every Dragapult check bar Blissey, making it potentially dangerous if entry hazards are up.</li> <li>Heavy-Duty Boots allows Dragapult to switch in without fear of entry hazards such as Spikes and Toxic Spikes. Leftovers is Dragapult's only form of recovery.</li> <li>Tera Ghost lets Dragapult 2HKO Corviknight with a boosted Hex after Stealth Rock damage while retaining its useful immunity to Fighting. Tera Dragon can be used instead, as it allows Dragapult to 2HKO Blissey, but it doesn't offer much outside of that; Dragon is also a bad defensive typing in Ubers.</li> <li>Pivot Dragapult is best suited for entry hazard-stacking teams, as these teams greatly appreciate Dragapult's ability to outspeed and keep in check various threats to them, such as Iron Bundle. Dragapult appreciates entry hazards weakening its checks in return.</li> <li>Pokemon that can spread status for Dragapult, such as Toxapex, Clodsire, and Skeledirge, also make good partners.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 306317, "username": "corvere"}]}
  },
  "Skeledirge": {
    "sets": [
      {
        "name": "Unaware Wall",
        "description": "<ul> <li>Will-O-Wisp cripples common Skeledirge switch-ins such as Toxapex and Ting-Lu, and it also forces out Koraidon. Hex, in conjuction with Will-O-Wisp, helps Skeledirge beat foes that otherwise wouldn't take much damage from its attacks, such as Toxapex and Alomomola.</li> <li>Earth Power hits Pokemon that would wall Skeledirge completely, such as Garganacl, while still hitting Toxapex hard. Earth Power also hits Tera Fire Koraidon, which can potentially beat Skeledirge one-on-one if Torch Song is its only attacking move, as Hex without a status condition does not always break Koraidon's Substitute with a Torch Song boost.</li> <li>Skeledirge is best suited for bulky offense and stall teams alike, as those styles of teams specifically appreciate its walling capabilities. For example, it can wall non-Stomping Tantrum Koraidon, Choice Specs Iron Valiant, and non-Earthquake Slither Wing.</li> <li>Tera Fairy helps Skeledirge check Pokemon that would otherwise overwhelm it, such as Koraidon locked into Outrage and Chien-Pao locked into Crunch. Tera Water is also an option to check Palafin and rain teams, and it retains Skeledirge's Fire resistance.</li> <li>Pokemon that appreciate walls like Ting-Lu and Toxapex being burned make for great partners, like Miraidon and Kingambit. Other Koraidon and Chien-Pao checks such as Toxapex and Great Tusk make for great partners too, as Skeledirge appreciates not being the only check to them. Lastly, Blissey walls Iron Bundle and Miraidon for Skeledirge, and in return Skeledirge checks Koraidon.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 306317, "username": "corvere"}]}
  },
  "Pawmot": {
    "sets": [
      {
        "name": "Revival Blessing",
        "description": "<ul> <li>Pawmot has a distinct niche as the best Revival Blessing user in the tier.</li> <li>Tera Electric removes the downside of Double Shock, making it much safer to click.</li> <li>Mach Punch helps pick off weakened foes such as Chien-Pao, Iron Bundle, and Tera Steel Koraidon.</li> <li>Leppa Berry's purpose is to attempt to revive as many teammates as possible throughout a game.</li> <li>Pawmot best fits on hyper offense teams, bringing back fainted teammates, but it also has a niche on bulkier teams.</li> <li>Koraidon, Life Orb Chien-Pao and Flutter Mane, and offensive Great Tusk often end up being KOed rather quickly through recoil for the former three and defensive drops for the latter. This makes them excellent targets for Pawmot's Revival Blessing. Choice Specs Chi-Yu is similarly left helpless after consecutive Overheat uses.</li> <li>On bulkier teams, bringing back a self-sufficient wincon such as a fainted Annihilape or Skeledirge can be a viable strategy.</li> <li>Entry hazard setters such as Glimmora and Froslass pair up nicely with the hyper offense aspects of the teams Pawmot finds itself on. Pawmot also beats the best Defogger in the tier in Corviknight.</li> <li>Iron Bundle is a fantastic partner, beating the various Ground-types that switch into Pawmot such as Great Tusk, Iron Treads, and Clodsire.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Maushold": {"sets": [{"name": "Tidy Up", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Dachsbun": {"sets": [{"name": "Defensive", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Arboliva": {"sets": [{"name": "Grassy Terrain", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Garganacl": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<ul> <li>The combination of Purifying Salt and access to reliable recovery and Iron Defense makes Garganacl a solid late-game wincon.</li> <li>Body Press gains power very quickly with Iron Defense boosts and provides great coverage in tandem with Salt Cure.</li> <li>Tera Fairy allows Garganacl to continue to set up against Great Tusk and Koraidon, which often switch in to handle Garganacl. Fairy also has few weaknesses in general.</li> <li>Tera Water lets Garganacl take on Water-type attacks from Iron Bundle and Palafin.</li> <li>Tera Steel is the best option to use on a sand team.</li> <li>Garganacl with Special Defense investment works as a great check to Flutter Mane.</li> <li>Pokemon such as Skeledirge, Toxapex, and Scream Tail have a hard time doing any damage to Garganacl, making Koraidon a great partner.</li> <li>Garganacl is unable to take on Miraidon and Iron Bundle. As such, Ting-Lu is recommended for dealing with Miraidon, while Corviknight, Blissey, and specially defensive Scream Tail can handle Iron Bundle.</li> <li>While Garganacl works well regardless of the weather, Hippowdon deserves special mention as a teammate for providing sand support, greatly increasing Garganacl's Special Defense.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 306317, "username": "corvere"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 50695, "username": "Manaphy"}]}
  },
  "Ceruledge": {"sets": [{"name": "Swords Dance", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Scovillain": {"sets": [{"name": "Moody", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Espathra": {
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li>Espathra's niche is sweeping with its unique combination of Calm Mind, Speed Boost, and STAB Stored Power.</li> <li>Dazzling Gleam super effectively hits Dark-types, which are immune to Stored Power, like Chien-Pao, Ting-Lu, and Grimmsnarl.</li> <li>Substitute protects Espathra from potential status conditions that might stop its sweep, like from Clodsire's Toxic.</li> <li>Protect, instead, allows Espathra to scout Choice-locked foes, such as Choice Specs Miraidon. In addition, Protect lets Espathra freely boost its Speed and get Leftovers recovery.</li> <li>Roost keeps Espathra healthy and makes it less susceptible to priority attacks, like Chien-Pao and Kingambit's Sucker Punch. Roost also allows Espathra to beat Ting-Lu not packing Whirlwind one-on-one.</li> <li>Tera Fairy turns Espathra's Dark weakness into a resistance, letting it survive the aforementioned Sucker Punch, as well as bolstering its Dazzling Gleam.</li> <li>Tera Fighting also turns Espathra's Dark weakness into a resistance. Paired with Tera Blast, it beats the aforementioned Dark-types, Kingambit and Chien-Pao, and Steel-types like Iron Treads.</li> <li>112 EVs in Speed allow Espathra to outspeed the entire unboosted metagame at +1, including Iron Bundle. At +2, it can even outspeed +1 Iron Valiant.</li> <li>The rest of its EVs are poured into physical bulk for survivability, since Calm Mind will boost Special Defense anyway. Electric Seed further improves Espathra's physical bulk while also giving it another boost to Stored Power. Leftovers gives Espathra long-term recovery, and it can be optimized with Calm Mind and the choice of Substitute, Protect, or Roost.</li> <li>Espathra functions best on offensive teams to sweep after its checks have been weakened. Espathra is very frail and it usually can't switch in safely more than once, so it must fully commit to a sweep once it hits the field.</li> <li>Fighting-types like Koraidon and Great Tusk make for good partners, as they threaten Dark- and Steel-types that resist or are immune to Espathra's Stored Power.</li> <li>Strong Dark-types like Chien-Pao and Chi-Yu resist Dark- and Ghost-type attacks, which target Espathra, while also threatening Ghost- and Psychic-types. The former threaten Espathra, and the latter resist Stored Power.</li> <li>Miraidon is a necessary partner if Espathra is holding Electric Seed, as Electric Terrain activates the item.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 415367, "username": "Eledyr"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}]}
  },
  "Palafin": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<ul> <li>Wave Crash is a very strong STAB move. With Stealth Rock support and Tera Water's power boost, it crushes walls Palafin normally might struggle to break, like Toxapex and Corviknight, and always OHKOes Miraidon.</li> <li>Close Combat is a strong, reliable coverage move that hits many of Palafin's checks like Corviknight and Koraidon for solid damage, while also hitting Water-types barring Toxapex for neutral damage.</li> <li>Ice Punch allows Palafin to hit Dragon-types like the very common Koraidon and Miraidon while also hitting Water Absorb Clodsire. However, it cannot OHKO Koraidon and is not guaranteed to OHKO Miraidon.</li> <li>Zen Headbutt allows Palafin to hit Toxapex super effectively, as well as potentially OHKOing Koraidon and having fantastic odds to 2HKO Miraidon.</li> <li>Tera Water powers up Palafin's Water-type moves and allows Palafin to achieve feats like 2HKOing Miraidon with Jet Punch from full HP if rain is up.</li> <li>Choice Band Palafin functions best on offensive teams to revenge kill threats like Flutter Mane or to break walls for its teammates mid-game. Remember, base Palafin needs to be used very early in a game to transform into its Hero Form.</li> <li>Pelipper is a great partner for Palafin, as it checks Koraidon decently and replaces its sun with rain, strengthening Palafin's powerful Water-type attacks.</li> <li>Koraidon sets up sun and resists Water-type attacks Palafin throws at it, so Palafin appreciates teammates that threaten Koraidon, like Iron Bundle and Flutter Mane. Also, Palafin is weakened by the sun Koraidon sets up, so it is best not to pair Palafin and Koraidon together.</li> <li>Miraidon is a good partner, as it destroys Alomomola, a great counter to Palafin, and can safely bring Palafin onto the field with either U-turn or Volt Switch. Miraidon also appreciates Palafin threatening Ground-type Pokemon that can take Miraidon's Electric-type attacks, like Ting-Lu, Iron Treads, and Clodsire.</li> </ul> "
      },
      {
        "name": "Bulk Up",
        "description": "<ul> <li>Jet Punch's strong priority allows this Palafin set to still be threatening to offensive builds, while Drain Punch keeps Palafin healthy against bulkier teams.</li> <li>Taunt allows Palafin to prevent common responses to setup sweepers from working, such as Whirlwind from Ting-Lu and Haze from Toxapex, while also preventing Pokemon like Annihilape from setting up alongside it.</li> <li>Fairy is the Tera type of choice to allow Palafin to resist both of Koraidon's STAB attacks and potentially set up on Choice Scarf variants of it. Fairy also removes Palafin's weakness to Iron Bundle's Freeze-Dry and Miraidon's Electric moves.</li> <li>Palafin struggles to deal with Koraidon or Miraidon, which can come in on this set easily, especially given that Zero to Hero forces Palafin to switch at least once before it can be offensively threatening. As a result, this Palafin needs teammates that can defensively handle these threats. Ting-Lu and Iron Treads both help with Miraidon, and Pokemon like Great Tusk, Scream Tail, and Skeledirge can provide defensive solidity against Koraidon.</li> <li>This Palafin set functions best with a sturdy defensive backbone alongside it, to mitigate the impact of Zero to Hero. As a result, it does not work as well on more hyper offensive playstyles.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 537354, "username": "Mashing"}, {"user_id": 306317, "username": "corvere"}, {"user_id": 415367, "username": "Eledyr"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}, {"user_id": 249382, "username": "Aberforth"}]}
  },
  "Cyclizar": {
    "sets": [
      {
        "name": "vroom vroom (Shed Tail)",
        "description": "<ul> <li>Cyclizar’s niche is in its ability to pass Substitutes to threatening sweepers, finding use solely on hyper offense teams.</li> <li>Rapid Spin works well for teams weak to entry hazards. It’s a good way to support threats weak to Stealth Rock, like Chien-Pao, Chi-Yu, and Iron Bundle.</li> <li>Draco Meteor can be used over Rapid Spin to do big damage to Koraidon, Miraidon, and Iron Bundle for teams weak to them. However, it has no practical use outside of this.</li> <li>U-turn lets Cyclizar scout for switches and bring its teammates in even when it’s low on HP, giving itself Regenerator recovery and eventually letting it use Shed Tail again.</li> <li>Knock Off provides item removal, which helps its team break past otherwise irritating walls like Toxapex and Dondozo. Offensive Pokemon like Koraidon also really don’t like losing items such as Choice Scarf.</li> <li>Choice Scarf is the preferred item on Cyclizar, as it allows it to easily use Shed Tail for a teammate as soon as it hits the field. However, Heavy-Duty Boots can be used on teams weak to entry hazards.</li> <li>Cyclizar is a vital component on dual screens hyper-offense teams, as Cyclizar can feed its team free Substitutes, giving its teammates an easier time setting up and sweeping in combination with the bulk afforded by dual screens support.</li> <li>Grimmsnarl sets up dual screens reliably, letting Cyclizar use Shed Tail easily and letting the rest of its team go to work.</li> <li>Espathra is an excellent partner, as the free Substitute and dual screens set up by Cyclizar and Grimmsnarl let Espathra take hits and avoid status attempts, making it hard to stop.</li> <li>Swords Dance Flame Charge Koraidon is also a good partner, as with dual screens and a Substitute, it has an easier time setting up while also avoiding the otherwise ruinous Will-O-Wisp from Skeledirge.</li> <li>Double Dance Miraidon loves the Substitute passed to it by Cyclizar, as it makes it significantly harder to revenge kill, allowing Miraidon to take over a game more easily.</li> <li>Other frail sweepers like Nasty Plot Chi-Yu and Calm Mind Flutter Mane also appreciate Cyclizar’s Substitute, as it allows them to freely set up.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 415367, "username": "Eledyr"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}]}
  },
  "Glimmora": {
    "sets": [
      {
        "name": "Suicide Lead",
        "description": "<ul> <li>Glimmora stands out as one of the best suicide leads in the metagame thanks to its signature ability in Toxic Debris and great utility movepool consisting of Stealth Rock, Spikes, and Memento. Its high Special Attack alongside STAB and coverage options in Power Gem and Earth Power let it threaten most foes including Miraidon, Iron Bundle, and Iron Treads.</li> <li>Tera Ghost Glimmora prevents common spinners like Iron Treads and Great Tusk from removing the entry hazards that Glimmora sets. Glimmora also benefits from Tera Ghost removing its 4x weakness to Ground-type attacks, letting it threaten these spinners with its coverage more reliably. However, given the nature of Glimmora as a dedicated lead, Terastallizing is not generally recommended.</li> <li>Dazzling Gleam threatens Fighting-types like Koraidon and Great Tusk, as well as Miraidon. Its signature move, Mortal Spin, lets Glimmora act as an entry hazard remover and also cripples Stealth Rock setters like Ting-Lu and Great Tusk with poison.</li> <li>Mortal Spin is a good option when facing setup sweepers that Glimmora cannot threaten if it doesn't have the right coverage like Swords Dance + Flame Charge Koraidon, Double Dance Miraidon, and Bulk Up Annihilape.</li> <li>Memento allows a teammate to come in easily while also preventing entry hazard removal attempts.</li> <li>Glimmora likes offensive staples like Miraidon and Koraidon that can take advantage of the entry hazards it sets up. They both threaten to OHKO Defog Corviknight.</li> <li>Glimmora also appreciates Ghost-types such as Annihilape, Flutter Mane, and Gholdengo, while they appreciate the entry hazards that Glimmora sets.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 415367, "username": "Eledyr"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 213053, "username": "Trade"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 530778, "username": "GeniusFromHoenn"}]}
  },
  "Houndstone": {
    "sets": [
      {
        "name": "What the dog doin? (Offensive)",
        "description": "<ul> <li>Houndstone functions as a wallbreaker and occasional revenge killer for sand teams once some teammates have fainted.</li> <li>Body Press is used to hit Blissey, as well as Tera Normal Flutter Mane.</li> <li>Play Rough is ideal for Choice Band sets to hit common switch-ins such as Koraidon and Ting-Lu. Will-O-Wisp is useful on Spell Tag sets to cripple Koraidon.</li> <li>Choice Band provides more upfront power, allowing Play Rough to OHKO Koraidon and 3HKO Ting-Lu. Spell Tag provides flexibility, easing prediction against teams with Normal-types and making Flutter Mane much easier to deal with by using Shadow Sneak.</li> <li>The given EVs allow Houndstone to outspeed Iron Bundle in sand without Electric Terrain. The rest is dumped into HP.</li> <li>Either Hippowdon or Tyranitar is a mandatory teammate to provide sand so that Houndstone can function. Hippowdon acts as a Koraidon switch-in, while Tyranitar can check Chi-Yu.</li> <li>If not using Hippowdon, a solid Koraidon check such as Great Tusk is highly recommended, as Koraidon's sun can severely limit Houndstone.</li> <li>Pelipper is another Pokemon that will get rid of sand upon entry, so be sure to pack anti-rain options.</li> <li>Houndstone is severely limited by its average Speed even in sand, as well as reliant on fallen teammates to power up Last Respects. This makes Houndstone generally unreliable as a wallbreaker or revenge killer, though it is extremely strong in certain circumstances. As such, be sure to pack alternative wallbreakers and revenge killers.</li> <li>Miraidon is a good teammate, as it can provide both revenge killing and wallbreaking power and appreciates Houndstone breaking down Koraidon and Ting-Lu.</li> </ul> "
      },
      {
        "name": "Defensive",
        "description": "<ul> <li>Houndstone carves a niche in the metagame as a bulky spinblocker that can comfortably switch into Great Tusk and Iron Treads.</li> <li>Will-O-Wisp prevents physical attackers from setting up on Houndstone and spreads status on passive Pokemon like Corviknight, Toxapex, and Ting-Lu.</li> <li>Rest gets rid of status and helps Houndstone remain healthy throughout the game.</li> <li>Houndstone's EVs and ability make it surprisingly bulky, allowing it to survive even a Tera Dark Crunch from Choice Band Chien-Pao and OHKO back with Body Press.</li> <li>Tera Water grants Houndstone a resistance to Fire-type moves, which are otherwise super effective because of its ability. Additionally, it gives Houndstone a neutral typing against threats like Chien-Pao, Kingambit, and Annihilape.</li> <li>Houndstone's primary role is to act as a spinblocker with some defensive utility, so it is essential to pair it with Pokemon that set entry hazards such as Ting-Lu, Clodsire, Great Tusk, and Iron Treads, as well as strong wallbreakers like Chien-Pao, Koraidon, Annihilape, Miraidon, and Iron Bundle that make the most out of the chip damage.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 306317, "username": "corvere"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 583793, "username": "Sabelette"}, {"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 374620, "username": "pichus"}, {"user_id": 50695, "username": "Manaphy"}]}
  },
  "Cetitan": {"sets": [{"name": "Slush Rush Sweeper", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Dondozo": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<ul> <li>Dondozo is a solid physical wall due to its incredible physical bulk and Unaware. Dondozo fits well on bulky teams where it can switch into physical attackers such as Koraidon, Great Tusk, and Chien-Pao.</li> <li>Liquidation hits Ground- and Fire-types such as Great Tusk, Iron Treads, and Skeledirge. Earthquake lets Dondozo lure in and deal huge damage to Miraidon.</li> <li>Curse makes Dondozo less passive and gives it sweeping potential. Protect lets Dondozo scout for Choice item users such as Koraidon, Miraidon, and Iron Bundle while also recovering health.</li> <li>Rest is the only recovery option for Dondozo and can be used with Sleep Talk to deal with physical attackers such as Koraidon and Chien-Pao better. However, Miraidon's extensive presence in the metagame makes Rest unreliable.</li> <li>Tera Steel lets Dondozo resist Moonblast from Flutter Mane and Freeze-Dry from Iron Bundle. Alternatively, Tera Fairy allows Dondozo to resist Fighting- and Dark-type moves from Koraidon and Chien-Pao while it also gains an immunity to Dragon-type moves.</li> <li>Tera Ground gives Dondozo an immunity to Electric-type moves and can allow it to catch Miraidon by surprise and KO it using a boosted Earthquake.</li> <li>Entry hazard removal options such as Corviknight, Iron Treads, and Great Tusk are great teammates, as foes can take advantage of Dondozo being worn down due to hazards. Dugtrio is a good teammate, as it can trap and KO Miraidon, making Dondozo incredibly tough to stop.</li> <li>Dondozo appreciates special walls such as Ting-Lu, Corviknight, and Blissey that can switch into threats such as Miraidon and Flutter Mane. In return, Dondozo checks their threats in Koraidon, Chien-Pao and Great Tusk.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 50695, "username": "Manaphy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 532881, "username": "Frozoid"}]}
  },
  "Annihilape": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<ul> <li>Annihilape is a solid setup sweeper due to its good Attack stat, decent bulk, and unresisted STAB combination. It can take advantage of Pokemon such as Corviknight, Blissey, and Clodsire.</li> <li>Bulk Up gives Annihilape the potential to sweep while also making it progressively harder to KO.</li> <li>Taunt allows Annihilape to stay healthy and also stops bulkier Pokemon such as Corviknight, Clodsire, and Toxapex from recovering their health. Rest can alternatively be used with Chesto Berry to get rid of status and recover health, but it fails when Electric Terrain is up.</li> <li>Drain Punch allows Annihilape to recover health and damage foes such as Ting-Lu and Iron Treads.</li> <li>Rage Fist, along with Taunt, makes Annihilape incredibly threatening for slow walls such as Dondozo and Ting-Lu, as their attacks do little damage to Annilhilape while also boosting Rage Fist's power.</li> <li>Tera Water allows Annihilape to take hits from special attackers such as Iron Bundle, Chi-Yu, and Flutter Mane while also letting it resist Flare Blitz from Koraidon.</li> <li>Tera Fairy gives Annihilape an immunity against Dragon-type moves from Koraidon and Miraidon while also letting Annihilape take neutral damage from Ghost-type moves from Gholdengo and Flutter Mane, OHKOing them in return with boosted Rage Fist.</li> <li>Annihilape reaches its full potential on dual screens hyper offense teams, where it can easily take hits while setting up.</li> <li>Special walls such as Ting-Lu and Corviknight are good teammates on balance teams, as Pokemon such as Miraidon, Flutter Mane, and Iron Bundle threaten Annihilape. Corviknight is also able to remove entry hazards for Annihilape. Kingambit as a teammate overwhelms Alomomola and Skeledirge, which are common checks to it and Annihilape.</li> <li>Entry hazard setters such as Glimmora, Froslass, Toxapex, and Clodsire can lure in Corviknight, presenting Annhilape with a great setup opportunity by forcing Corviknight to either use Defog and activate Annihilape's Defiant or give Rage Fist a boost by attacking.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 415367, "username": "Eledyr"}, {"user_id": 306317, "username": "corvere"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 532881, "username": "Frozoid"}]}
  },
  "Clodsire": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<ul> <li>Clodsire's special bulk combined with its Ground typing makes it one of the best answers to Miraidon, notably thanks to its ability to absorb Toxic Spikes, which would otherwise trouble other defensive Pokemon such as Ting-Lu.</li> <li>Toxic prevents Clodsire from being overly passive and allows it to outlast Iron Bundle.</li> <li>Clodsire is a decent setter of both Spikes and Stealth Rock, freeing up moveslots on teammates like Great Tusk. However, opposing spinners as well as Corviknight have very little issue removing entry hazards against Clodsire.</li> <li>Water Absorb is the preferred ability, as it deters Iron Bundle's Hydro Pump and more comfortably tanks Draco Meteor from Miraidon, since Unaware would otherwise ignore the Draco Meteor special attack drop. It also checks Tera Water Miraidon, which is an important trait it possesses over Ting-Lu. Unaware checks non-Life Orb Calm Mind Miraidon while beating Calm Mind + Taunt Flutter Mane, as well as making Iron Moth's Fiery Dance boosts less of a threat.</li> <li>Clodsire can use Tera Steel to take Miraidon's Draco Meteor far more easily while being able to take on Iron Bundle's STAB moves in conjunction with Water Absorb.</li> <li>Both defensive and balanced teams enjoy Clodsire answering most Miraidon sets, helping fend off Flutter Mane, freeing up moveslots on other entry hazard setters, and pressuring opposing defensive Pokemon with Toxic.</li> <li>Dondozo pairs with Clodsire nicely, as it appreciates Clodsire's ability to switch in on Miraidon's Electro Drift, while Dondozo can take on Chien-Pao and Great Tusk for it.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 306317, "username": "corvere"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 558813, "username": "Wooper Person"}]}
  },
  "Dudunsparce": {"sets": [{"name": "Defensive", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Kingambit": {
    "sets": [
      {
        "name": "Setup Sweeper",
        "description": "<ul> <li>Supreme Overlord makes Kingambit a threatening late-game sweeper and revenge killer.</li> <li>144 Speed EVs allow Kingambit to outspeed uninvested Alomomola, Skeledirge, and Corviknight.</li> <li>Tera Flying allows Kingambit to survive otherwise super effective hits from Great Tusk, Iron Treads, non-Choice Band Koraidon, and Annihilape, allowing it to set up or dent these threats with a strong attack. Tera Ghost may be used to grant immunity to Fighting-type moves without a weakness to Ice-type attacks from Iron Bundle and Chien-Pao.</li> <li>Teammates such as defensive Great Tusk, Skeledirge, Corviknight, and Toxapex are good checks to physical threats like Koraidon, Great Tusk, and Chien-Pao. Special walls such as Ting-Lu, Iron Treads, and Clodsire check fast special attackers like Miraidon and Iron Bundle while setting entry hazards for Kingambit. Setting entry hazards and spreading status is especially crucial, as most Kingambit checks have no viable recovery options.</li> <li>Strong wallbreakers like Koraidon, offensive Great Tusk, and Chien-Pao support Kingambit late-game. Choice Scarf Koraidon is an excellent partner, as it outspeeds and threatens Kingambit's checks, and together they are able to overwhelm most of their shared checks.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 374620, "username": "pichus"}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Choice Item",
        "description": "<ul> <li>Tera Ground can turn Headlong Rush into a devastating STAB attack that can break through bulky targets Great Tusk normally wouldn’t, such as Scream Tail and Dondozo.</li> <li>Tera Fighting lets Great Tusk crush Corviknight with Close Combat, which severely hurts defensive structures reliant on it. This opens up powerful teammates like Flutter Mane and Iron Bundle.</li> <li>Earthquake makes Great Tusk harder to revenge kill than Headlong Rush does, as it doesn’t drop its defenses.</li> <li>Rapid Spin works well for teams weak to entry hazards. It's a great way to support powerful threats weak to Stealth Rock, like Chien-Pao, Chi-Yu, and Iron Bundle.</li> <li>Knock Off provides fantastic item-removing support, and it especially cripples walls reliant on Leftovers like Scream Tail and Dondozo, allowing its team to more easily break past them.</li> <li>Play Rough can be used to OHKO Koraidon without Terastallizing, as well as beating opposing Great Tusk. However, it has very little practical use outside of this.</li> <li>Choice Scarf Great Tusk functions most effectively as a wallbreaker in the early- and mid-game, suited best for offensive structures that struggle with physical walls like the aforementioned Scream Tail and Dondozo. When building teams, remember Great Tusk must use Terastallization to actually break through said walls, so it may be hard for teammates to Terastallize.</li> <li>Choice Band Great Tusk only functions well on Sticky Web teams, where the stronger and slower set appreciates Sticky Web dropping foes' Speed.</li> <li>Koraidon is a great partner, setting up sun and activating Protosynthesis for Great Tusk. It further resists Water- and Grass-type moves aimed at Great Tusk, weakening the former. Koraidon also effectively baits in Skeledirge, which Great Tusk reliably threatens.</li> <li>Miraidon is also a great partner, as it can threaten Flying-types, like Corviknight and the rarer Pelipper and Dragonite. This helps to make Great Tusk’s Headlong Rush much more spammable.</li> <li>Gholdengo is also a good partner for Great Tusk, as it resists Ice-, Fairy-, and Grass-type moves aimed at Great Tusk, and it can threaten to KO Ice- and Fairy-types with super effective STAB Make It Rain. In addition, Gholdengo also blocks all hazard removal, helping to wear down walls for Great Tusk's team to eventually break through.</li> </ul> "
      },
      {
        "name": "Offensive Utility",
        "description": "<ul> <li>Great Tusk is the best offensive Stealth Rock or Rapid Spin user in the tier thanks to its solid typing and good physical bulk.</li> <li>If Great Tusk is paired with Pokemon such as Corviknight, then Stealth Rock can be run instead of Rapid Spin. If paired with teammates that set Stealth Rock, then the best set would be Rapid Spin / Headlong Rush / Close Combat / Knock Off. Knock Off makes progress on Corviknight and covers the Air Balloon Gholdengo matchup.</li> <li>Tera Ground lets Great Tusk deal incredible damage with Headlong Rush while also letting it survive Flutter Mane's Moonblast from full HP. Tera Steel flips the Fairy matchup and lets Great Tusk take on Ice- and Dragon-type attacks, but the additional weaknesses to Fighting and Ground make Great Tusk unable to take on Koraidon, Ting-Lu, and Iron Treads easily.</li> <li>Great Tusk can be used to take on entry hazard setters like Ting-Lu and Iron Treads one-on-one by forcing them out and removing hazards. Jolly is usually preferred to outspeed Gholdengo, Modest Chi-Yu, and Glimmora, but Adamant lets Tera Ground Headlong Rush OHKO Koraidon and specially defensive Annihilape after one layer of Spikes or Stealth Rock.</li> <li>Great Tusk should be used aggressively to force out and keep entry hazards off the field against other setters, such as Ting-Lu and Iron Treads, since Great Tusk is generally difficult to switch into. Great Tusk pairs well with Koraidon thanks to Orichalcum Pulse's sun, letting Great Tusk become an incredibly potent wallbreaker, and Great Tusk can clear entry hazards so that Koraidon can repeatedly come in. Miraidon also appreciates Great Tusk, as it forces out common checks such as Clodsire, Ting-Lu, and Iron Treads. Great Tusk also appreciates Blissey being able to take on all of the special attackers that force Great Tusk out, such as Flutter Mane, Miraidon, and Iron Bundle.</li> </ul> "
      },
      {
        "name": "Setup Sweeper",
        "description": "<ul> <li>Bulk Up allows Great Tusk to be a threatening sweeper. It can comfortably set up on common physical walls like Ting-Lu, Iron Treads, Corviknight, and defensive Great Tusk.</li> <li>The STAB combination of Headlong Rush and Close Combat hits most physical walls for at least neutral damage. Earthquake may be used as the Ground-type STAB move to avoid defensive drops, but it is a weaker move, and it can't secure important OHKOs and 2HKOs at +1 Attack against some physical walls such as Toxapex, Scream Tail, and Alomomola.</li> <li>A Jolly nature is used to outspeed all viable unboosted Pokemon after one Rapid Spin. An Adamant nature makes Great Tusk stronger while still letting it outspeed unboosted Iron Bundle at +1 Speed, but it misses out on outspeeding maximum Speed Gholdengo and tying Jolly Great Tusk.</li> <li>Terastallizing into the Ground typing boosts Headlong Rush and guarantees some additional OHKOs and 2HKOs on foes like Toxapex and Scream Tail. Additionally, getting rid of the Fighting typing lets Great Tusk survive Fairy-type attacks such as Dazzling Gleam from Miraidon and Moonblast from Flutter Mane without Life Orb or Choice Specs, and it facilitates taking Dazzling Gleam and Play Rough from Scream Tail and Alomomola.</li> <li>Alternatively, using Tera Steel gives Great Tusk resistances to Fairy-type attacks, Ice-type attacks from Chien-Pao and Iron Bundle, and Draco Meteor from Miraidon, allowing it to surprise them with a strong attack.</li> <li>Koraidon is a solid partner because its sun activates Great Tusk's Protosynthesis, making its attacks even stronger. In return, Great Tusk can break through or strongly dent common Koraidon checks like Scream Tail, Alomomola, and Skeledirge, which allows Koraidon to clean more easily. Miraidon is also an excellent teammate, since Great Tusk can easily hard switch into its common checks and either threaten them with its attacks or set up on them.</li> <li>Special attackers like Miraidon, Flutter Mane, and Iron Bundle hugely threaten Great Tusk, so it is recommended to pair it with appropriate special walls like Blissey, Ting-Lu, Iron Treads, and Clodsire. Gothitelle is a less popular pick but it helps eliminate bulky checks like Dondozo and Pelliper, allowing Great Tusk to sweep more easily.</li> </ul> "
      },
      {
        "name": "Defensive",
        "description": "<ul> <li>Thanks to its solid physical bulk under sun and good defensive typing, Great Tusk acts as one of the best checks to Koraidon while also providing teams with entry hazard removal and a fantastic switch-in to other Ground-types in the tier such as Ting-Lu, Clodsire, and Iron Treads.</li> <li>Play Rough threatens a KO on Koraidon after entry hazard damage. Knock Off can be used to take on Air Balloon Gholdengo and wear down foes that want to switch into Great Tusk such as Corviknight and Annihilape, but it is generally outclassed by the sheer utility of Rapid Spin and Stealth Rock. The combination of Knock Off and Body Press can be used to pressure Corviknight switch-ins. A set of Earthquake, Stealth Rock, Knock Off, and Rapid Spin can also be used for similar utility.</li> <li>Great Tusk can Terastallize into the Fairy typing to take on physical attackers such as Koraidon, Chien-Pao, and Palafin in sun. However, be wary of Terastallizing against Koraidon that can still Terastallize themselves, as Choice Band Tera Fire Koraidon can take on Great Tusk one-on-one. Great Tusk can also Terastallize into the Ground typing or the Water typing, with both options removing its weakness to Fairy. The former also lets it fire off stronger Earthquakes as well, while the latter provides useful resistances to Fire moves from Koraidon as well as Ice- and Water-type moves, barring Freeze-Dry, from Iron Bundle.</li> <li>Great Tusk fits on most teams as a bulky Stealth Rock setter and Koraidon check. Great Tusk can utilize Rocky Helmet to punish the use of U-turn, though this hurts its longevity, as it then loses Leftovers's passive recovery.</li> <li>Great Tusk pairs well with defensive Scream Tail and Blissey, both of which can take on Iron Bundle while also providing Wish support for Great Tusk. Blissey can also take on Chi-Yu and Miraidon, while Scream Tail can take on Iron Valiant.</li> <li>Great Tusk also pairs well with Gholdengo, as it appreciates Great Tusk forcing out Koraidon while preventing hazard removal in exchange. Choice Scarf Chi-Yu is a good partner due to its ability to pressure faster special attackers that trouble Great Tusk such as Iron Bundle and Flutter Mane. Great Tusk also pairs well with Miraidon, as non-Heavy-Duty Boots Miraidon appreciates it removing entry hazards and taking on Clodsire, Iron Treads, and Ting-Lu. Finally, Koraidon is a good partner, as it can set up sun, pivot into Great Tusk, and force out most hazard removal options besides opposing defensive Great Tusk.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 511624, "username": "Fc"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 109385, "username": "Aurora"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}, {"user_id": 595062, "username": "Takatk"}, {"user_id": 374620, "username": "pichus"}]}
  },
  "Scream Tail": {
    "sets": [
      {
        "name": "I Have No Tail And I Must Scream (Physical Wall)",
        "description": "<ul> <li>Scream Tail is a nice option for bulkier balance teams thanks to its huge invested bulk and access to support moves like Wish and Encore, making it a much-needed check to very threatening Pokemon like Koraidon and offensive Great Tusk.</li> <li>Encore takes advantage of Pokemon that want to take advantage of Scream Tail's passivity, such as Swords Dance Koraidon, locking them into an unfavorable move for Scream Tail's teammates to deal with them.</li> <li>Perish Song works as a pseudo-OHKO move, letting Scream Tail scare out setup sweepers like Swords Dance Koraidon and Chien-Pao as well as bulkier Pokemon like Iron Defense Garganacl and Bulk Up Annihilape.</li> <li>The given EVs let Scream Tail outspeed Adamant Great Tusk while maximizing physical bulk.</li> <li>Tera Water allows Scream Tail to check Pokemon that would overwhelm it like Choice Band Koraidon locked into Flare Blitz and Choice Band Chien-Pao locked into Icicle Crash. It also lets Scream Tail check Palafin and rain teams in general. Alternatively, Tera Poison retains Scream Tail's Fighting-type resistance while enabling it to absorb Toxic Spikes.</li> <li>Physically defensive Scream Tail should be sent into Pokemon like Koraidon to punish moves like U-turn and Flare Blitz with Rocky Helmet.</li> <li>Koraidon can potentially lure Scream Tail and take it out with a Choice Band-boosted Flare Blitz or Heavy Slam. Because of this, revenge killers to it such as Choice Scarf Koraidon are wanted. Koraidon's sun also increases Scream Tail's bulk further.</li> <li>Pokemon that can take special hits such as Ting-Lu, Blissey, and specially defensive Corviknight are recommended, as they check Pokemon like Miraidon and Iron Bundle that can overwhelm Scream Tail.</li> <li>Offensive Pokemon like Koraidon, Chien-Pao, and Great Tusk are also recommended, as they appreciate Scream Tail healing them with Wish.</li> </ul> "
      },
      {
        "name": "Allied Mastercomputer (Mixed Wall)",
        "description": "<ul> <li>Scream Tail can also run a more specially defensive EV spread to check Pokemon like Iron Bundle.</li> <li>The given EVs allow Scream Tail to check Iron Bundle while still being able to pivot into Choice Scarf Koraidon and defensive Great Tusk.</li> <li>Tera Steel allows Scream Tail to completely wall Iron Bundle while also taking on Flutter Mane's STAB attacks. Alternatively, Tera Water variants check rain teams and Palafin while also helping against Choice Specs Chi-Yu in sun, while Tera Poison retains Scream Tail's useful resistances to Fighting-type attacks while allowing it to absorb Toxic Spikes from Pokemon like Toxapex and Clodsire.</li> <li>Scream Tail should always be sent into Pokemon like Iron Bundle and weaker ones like defensive Great Tusk to heal either itself or one of its teammates with Wish or lock a Pokemon like Corviknight or Toxapex into an unfavorable move with Encore.</li> <li>Strong attackers like Koraidon, Chien-Pao, and Chi-Yu make for excellent partners, as they greatly appreciate Scream Tail's Wishes.</li> <li>Other defensive Pokemon such as Corviknight and Iron Treads, help Scream Tail by checking Pokemon like Flutter Mane and Miraidon, as well as Chien-Pao in Corviknight's case.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 306317, "username": "corvere"}]}
  },
  "Flutter Mane": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<ul> <li>Flutter Mane functions as a great wallbreaker and revenge killer thanks to its already high Special Attack and Choice Specs, allowing it to break through unprepared teams with its dual unresisted STAB moves.</li> <li>Mystical Fire 2HKOes specially defensive Iron Treads and serves as a way to hit Corviknight.</li> <li>Psyshock is preferred in the last slot as a way to threaten specially defensive walls such as Blissey and Clodsire. Thunderbolt can be used to 2HKO Mirror Armor Corviknight and Toxapex.</li> <li>Flutter Mane can Terastallize into the Fairy typing to further increase its damage output.</li> <li>Flutter Mane pairs extremely well with Koraidon, as it can set up sun to further boost Flutter Mane's already impressive Speed. Koraidon can also pivot out via U-turn against Pokemon such as Great Tusk and Skeledirge, which Flutter Mane can threaten.</li> <li>Physically defensive Corviknight is a great partner for Flutter Mane that can come in on attacks that target Flutter Mane's weaker physical defenses while also providing it safe entry via a slow U-turn.</li> <li>This set appreciates entry hazard support from Great Tusk, which can also threaten Flutter Mane's checks such as Clodsire, Blissey, and Iron Treads.</li> </ul> "
      },
      {
        "name": "Wallbreaker",
        "description": "<ul> <li>Flutter Mane can deal incredible damage to every Pokemon in the metagame due to its great coverage, notably 2HKOing most defensive foes.</li> <li>Calm Mind allows Flutter Mane to OHKO Ting-Lu with Tera Fairy-boosted Moonblast, as well as defensive Great Tusk with Shadow Ball. Taunt can be used instead to stop bulky Pokemon like Blissey, Clodsire, Corviknight, and Toxapex from recovering health, giving Flutter Mane the advantage against bulkier teams.</li> <li>Thunderbolt covers specially defensive Corviknight and Toxapex, whereas Mystical Fire hits Iron Treads.</li> <li>Psyshock is a great option to strongly hit Blissey and Clodsire; Clodsire is an important target, as it otherwise walls Calm Mind + Life Orb variants due to Unaware.</li> <li>Booster Energy can be used instead of Life Orb to boost Speed upon entry, but the drop off in damage is noticeable.</li> <li>Tera Fairy allows Flutter Mane to dish out great levels of damage and lets it resist Sucker Punch from Chien-Pao. Tera Ghost allows Flutter Mane to 2HKO Corviknight and Toxapex. Tera Fire lets Flutter Mane resist Ice Shard from Chien-Pao and Ice Beam and Freeze-Dry from Iron Bundle, while Tera Normal makes it immune to Shadow Ball from opposing Flutter Mane.</li> <li>Entry hazard removal from the likes of Corviknight, Great Tusk, and Iron Treads is appreciated, as residual damage can stack up quickly between entry hazards and Life Orb recoil.</li> <li>Koraidon acts as a great teammate, setting sun for Flutter Mane's Protosynthesis to trigger.</li> </ul> "
      },
      {
        "name": "Assault Vest",
        "description": "<ul> <li>Psyshock allows Flutter Mane to 2HKO Clodsire and hit Blissey harder than any other move at Flutter Mane's disposal.</li> <li>Thunderbolt is a roll to 2HKO Corviknight after Stealth Rock chip damage and will always 2HKO it if Flutter Mane has a Protosynthesis boost.</li> <li>Tera Fairy boosts Flutter Mane's Moonblast damage output while removing its Ghost typing, which allows Flutter Mane to avoid being 2HKOed by opposing Flutter Mane's Shadow Ball. Tera Psychic is an option to OHKO Clodsire and 2HKO Blissey in the sun while guaranteeing the OHKO on Iron Moth that Flutter Mane might be trying to check.</li> <li>The EV investment allows Flutter Mane to outspeed Chi-Yu and survive two Moonblasts from opposing Choice Specs Flutter Mane.</li> <li>This Flutter Mane acts as both a good blanket check to the special attackers in the tier and an unexpectedly powerful bulky attacker that can turn the tables on Pokemon like Miraidon, Iron Bundle, Iron Moth, Espathra, and Chi-Yu.</li> <li>With no recovery and a vulnerability to entry hazards, Flutter Mane cannot be your only answer to these threats, especially Miraidon. As such, this Flutter Mane is best used on offensive teams that wish to have a one-time check to threatening special attackers.</li> <li>Koraidon is appreciated as a teammate, as it sets up sun that boosts Flutter Mane's damage output while also weakening opposing Iron Bundle's Water moves, letting Flutter Mane come in on it with greater ease.</li> <li>Rapid Spin users like Great Tusk and Iron Treads enable Flutter Mane to take more hits from opposing offensive threats and appreciate this Flutter Mane's ability to damage common answers such as Corviknight. Rapid Spin is preferred over Defog due to the offensive nature of the teams this Flutter Mane fits on.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 213053, "username": "Trade"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 50695, "username": "Manaphy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 528036, "username": "Sulo"}, {"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 536989, "username": "MTB"}, {"user_id": 532881, "username": "Frozoid"}, {"user_id": 249382, "username": "Aberforth"}]}
  },
  "Slither Wing": {"sets": [{"name": "Choice Band", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Iron Treads": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<ul> <li>A decent defensive typing allows Iron Treads to act as a check to Miraidon and Flutter Mane, and use the opportunity to remove or set entry hazards.</li> <li>Knock Off cripples common switch-ins such as Ting-Lu and Corviknight, while Volt Switch keeps momentum for your team.</li> <li>16 IVs in Defense mean that Iron Treads will receive a Special Defense boost in Electric Terrain, helping with switching into Miraidon.</li> <li>Iron Treads can use Tera Fairy to remove its weaknesses to Fighting and Fire, which can be helpful versus Koraidon and Chien-Pao, and with taking coverage from Miraidon and Flutter Mane. However, it loses its immunity to Electric and resistances to Dragon and Fairy. Iron Treads can alternatively use Tera Ground for an extra boost to Earthquake, but it suffers from similar demerits as Tera Fairy.</li> <li>Since both Miraidon and Flutter Mane have Fire-type coverage options, Iron Treads appreciates being paired with Pokemon such as Ting-Lu that can handle those attacks. Choice Scarf Koraidon and Booster Energy Flutter Mane are also good teammates, as they can revenge kill Miraidon and Flutter Mane while benefitting from Iron Treads removing entry hazards.</li> <li>Skeledirge's ability to check Koraidon and Iron Valiant also makes it a great partner for Iron Treads. Teammates that can switch into Great Tusk such as Dondozo and Alomomola also pair well, with Alomomola even providing Wish support to increase Iron Treads's longevity.</li> </ul> "
      },
      {
        "name": "Assault Vest",
        "description": "<ul> <li>Assault Vest allows Iron Treads to utilize an offensive spread while still letting it be a fairly safe option against Miraidon and Flutter Mane.</li> <li>Iron Head allows Iron Treads to beat Tera Fairy Miraidon.</li> <li>Knock Off can remove crucial items from foes like Ting-Lu, Great Tusk, and Corviknight.</li> <li>Volt Switch is useful for grabbing momentum on non-Ground-type foes that switch in on Iron Treads like Corviknight, Koraidon, Dondozo, and Pelipper.</li> <li>A Jolly nature gives Iron Treads a Speed boost from Quark Drive, which is often crucial to be able to beat Choice Specs Miraidon one-on-one, and lets it pick off foes that would normally outspeed it without Electric Terrain.</li> <li>Ground is the preferred Tera type to boost the power of Earthquake while weakening incoming Fire- and Fighting-type attacks; alternatively, other Tera types can provide defensive utility but not any offensive boost.</li> <li>This set works best on offensive teams where it is paired up with teammates that are weak to Fairy-type moves, such as Miraidon, Koraidon, Great Tusk, and Chien-Pao. Iron Treads allows these Pokémon to be played more freely because it can reliably deal with Flutter Mane and opposing Miraidon while applying offensive pressure itself.</li> <li>Flutter Mane is another great teammate because Iron Treads lures Corviknight and weakens it with Knock Off or Volt Switch, this gives Flutter Mane an easier time to break through enemy teams.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 225217, "username": "SparksBlade"}, {"user_id": 507268, "username": "ox04"}]}
  },
  "Iron Bundle": {
    "sets": [
      {
        "name": "Heavy-Duty Boots",
        "description": "<ul> <li>Freeze-Dry and Hydro Pump make Iron Bundle incredibly threatening with perfect coverage.</li> <li>Taunt can be used to stop recovery and status attempts from walls like Corviknight, while Flip Turn can gain momentum. Encore is effective at PP stalling recovery attempts from Pokemon while also locking Pokemon into suboptimal moves like Stealth Rock to take advantage of.</li> <li>Tera Ice boosts Freeze-Dry's and Ice Beam's power to high levels and also removes the neutrality to Freeze-Dry from opposing Iron Bundle, making a potential mirror match safer.</li> <li>Tera Water Iron Bundle has immense power on Hydro Pump; Tera Water also removes its Fighting-type weakness and Fire-type neutrality, which helps against Choice Scarf Great Tusk and Koraidon trying to revenge kill it.</li> <li>Iron Bundle has to use its high Speed to force out frail Pokemon or force defensive Terastallization, both of which it can take advantage of.</li> <li>Getting Iron Bundle safe switch-ins on defensive Pokemon that are threatened by Hydro Pump is the best way to use its offensive capabilities, allowing for defensive answers to be Taunted or pivoted on to wear down opposing teams.</li> <li>Pelipper and Miraidon are strong teammates for Iron Bundle, providing rain and Electric Terrain support to power it up.</li> <li>Entry hazard setters are also very strong, since Iron Bundle appreciates checks like Corviknight and Annihilape being worn down. It also can use Taunt to stop Defog Corviknight and pressure the premier spinners in Great Tusk and Iron Treads.</li> </ul> "
      },
      {
        "name": "Choice Specs",
        "description": "<ul> <li>The combination of Hydro Pump and Freeze-Dry gives Iron Bundle an unresisted STAB combination, making it extremely threatening with Choice Specs.</li> <li>Flip Turn allows Iron Bundle to pivot in order to gain momentum, while Ice Beam OHKOes Koraidon and uninvested Miraidon.</li> <li>Tera Ice allows Iron Bundle to further boost its Ice-type moves and resist Freeze-Dry from opposing Iron Bundle and Ditto. Tera Water is a good option on teams with rain support in order to let it 2HKO Heavy-Duty Boots Blissey in rain after slight chip.</li> <li>Choice Specs allows Iron Bundle to 2HKO walls such as Ting-Lu, Corviknight, and Scream Tail with Hydro Pump as well as Toxapex with Freeze-Dry.</li> <li>Miraidon is a great teammate, as it can lure in Pokemon weak to Hydro Pump such as Ting-Lu and Iron Treads and pivot into Iron Bundle using U-turn. It also sets Electric Terrain, giving Iron Bundle a Speed boost upon entry.</li> <li>Entry hazard removal options such as Corviknight, Iron Treads, and defensive Great Tusk are great teammates, as Iron Bundle can get worn down pretty quickly from repeatedly switching into Stealth Rock.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 50695, "username": "Manaphy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}, {"user_id": 532881, "username": "Frozoid"}]}
  },
  "Iron Hands": {"sets": [{"name": "Swords Dance", "description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.539/\">new analyses</a>. These will  update as the metagame continues to develop. Stay tuned!</p> "}]},
  "Iron Moth": {
    "sets": [
      {
        "name": "Agility",
        "description": "<ul> <li>Iron Moth functions as a late-game cleaner with the combination of Agility and Booster Energy and aids hyper offense teams by absorbing Toxic Spikes.</li> <li>Psychic lets Iron Moth break past Clodsire and Toxapex, 2HKOing both after minimal chip. Sludge Wave can be run instead to deal with the plethora of foes that wish to Terastallize into the Fairy typing.</li> <li>Tera Fairy should be used in conjunction with Dazzling Gleam to OHKO Koraidon and Miraidon and improve the Chien-Pao matchup by making Iron Moth harder to revenge kill with priority.</li> <li>Alternatively, Tera Grass boosts Energy Ball, allowing it to 2HKO Ting-Lu and OHKO Garganacl, and removes Iron Moth's weaknesses to Ground and Rock.</li> <li>Iron Moth functions best on offensive teams, where it can set up on and pick off weakened foes.</li> <li>Koraidon is a good partner, as it sets sun, can bring Iron Moth in safely with U-turn, and can help overwhelm their shared checks, such as Skeledirge, Dachsbun, and Pelipper.</li> <li>Spikes setters such as Glimmora and Froslass are also appreciated, allowing Iron Moth to get KOs it otherwise would not be able to such as the 2HKO on Garganacl and the OHKO on Great Tusk.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 507268, "username": "ox04"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 273339, "username": "Lasen"}]}
  },
  "Baxcalibur": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<ul> <li>Baxcalibur functions as a niche wallbreaker and occasional sweeper for hyper offense teams. Glaive Rush and Icicle Spear are fantastic STAB moves that hit most of the tier for super effective or neutral damage.</li> <li>Earthquake provides good coverage against common defensive Pokemon such as Toxapex and Skeledirge.</li> <li>Baxcalibur competes heavily with Chien-Pao as an offensive Ice-type, as they fill a similar role on teams. The key difference is Baxcalibur's ability to boost its Speed. Another key difference is Baxcalibur's Dragon typing, which gives it weaknesses to common Dragon- and Fairy-type moves. This stacks weaknesses with Koraidon and Miraidon.</li> <li>Tera Fairy provides Baxcalibur with a Dragon immunity to better deal with Koraidon and Miraidon, as well as a resistance to Fighting-type moves from Pokemon such as Koraidon and Great Tusk. It also ensures Kingambit and Chien-Pao cannot easily revenge kill Baxcalibur with Sucker Punch.</li> <li>Tera Steel grants Baxcalibur important resistances to types like Dragon and Fairy, as well as a Toxic immunity, giving it setup potential against certain walls like Toxapex.</li> <li>Grimmsnarl is a great partner: it provides dual screens support, easing Baxcalibur's setup and entry into the match. Another good partner is Hatterene or another form of hazard control, since denying Stealth Rock assists Baxcalibur in setting up.</li> <li>Miraidon is a recommended teammate, as it can provide both sweeping potential and wallbreaking power and appreciates Baxcalibur breaking down Clodsire and Ting-Lu. Another recommended teammate is Koraidon, since it appreciates Baxcalibur removing walls like Toxapex and Skeledirge.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "corvere"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 537354, "username": "Mashing"}]}
  },
  "Gholdengo": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<ul> <li>Choice Scarf Gholdengo outspeeds the entire unboosted metagame, can use Trick to weaken defensive teams, and also blocks Defog and Rapid Spin to keep pressure on defensive Pokemon with entry hazards.</li> <li>Focus Blast deals more damage to Ting-Lu, Chi-Yu, and Iron Treads, while Nasty Plot and Recover can be used after Gholdengo's Choice Scarf has been removed via Trick to turn it into a setup sweeper or give it longevity, respectively.</li> <li>Tera Fighting powers up Focus Blast, which allows Gholdengo to potentially 2HKO Ting-Lu. Alternatively, Gholdengo can use Tera Steel on sets not using Focus Blast to boost Make It Rain and remove its weaknesses to Flutter Mane's and Chien-Pao's STAB moves.</li> <li>Gholdengo should almost always be switched in if Corviknight is on the field and be used sparingly against Great Tusk and Iron Treads if a Rapid Spin is predicted, but this is risky due to its Earthquake weakness.</li> <li>Spikes setters like Ting-Lu and Clodsire on balance teams as well as Froslass on hyper offense teams appreciate Gholdengo keeping up Spikes and it acting as a revenge killer for their respective archetypes.</li> <li>Pokemon like Calm Mind Miraidon, Calm Mind Flutter Mane, and Swords Dance Chien-Pao also benefit from Gholdengo using Trick on defensive Pokemon, forcing them to either heal or be locked into an unfavorable attack while they set up. Gholdengo can also clean up weakened teams if these Pokemon are used to wallbreak first.</li> </ul> "
      },
      {
        "name": "Nasty Plot",
        "description": "<ul> <li>Nasty Plot + Recover Gholdengo is the best option for preventing entry hazard removal in the tier.</li> <li>Tera Steel bolsters Make It Rain's power, allowing Gholdengo to overwhelm threats such as Koraidon, defensive Great Tusk, Ting-Lu, and bulky Tera Fairy Miraidon after a Nasty Plot boost while removing its Ghost typing.</li> <li>Tera Normal blocks incoming Ghost-type attacks from the likes of Flutter Mane, Choice Scarf Houndstone, and opposing Gholdengo.</li> <li>Air Balloon provides a temporary measure against Ground-type attacks from Pokemon such as Great Tusk and Iron Treads, allowing Gholdengo to sometimes switch into them.</li> <li>Gholdengo best fits on hyper offense and balance teams that aim to preserve their own entry hazards for as long as possible.</li> <li>Frail leads such as Froslass and Masquerain appreciate their entry hazards staying intact against Great Tusk, Iron Treads, Corviknight, and Glimmora.</li> <li>Glimmora and Ting-Lu make for good teammates on balance teams in particular, as they provide similar entry hazard support while having sufficient power and bulk to punish threats.</li> <li>Wallbreakers such as Miraidon, Koraidon, and Chi-Yu appreciate multiple entry hazards to further overwhelm the opposition with their tremendous attacks and power.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}, {"user_id": 306317, "username": "corvere"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}, {"user_id": 473574, "username": "LeBarBURR"}]}
  },
  "Chien-Pao": {
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<ul> <li>Ice Spinner is an alternative to Icicle Crash because of its better accuracy, but it is slightly weaker, cannot flinch, and is a contact move.</li> <li>Ice Shard hits Miraidon and Koraidon for super effective damage, 2HKOing the former, and 2HKOes Flutter Mane reliably. Sucker Punch may be considered over Ice Shard, as it does more damage to Iron Bundle and can KO Flutter Mane, but it misses out on revenge killing Koraidon and is often prediction-reliant.</li> <li>Sacred Sword allows Chien-Pao to OHKO Chi-Yu, Kingambit, and opposing Chien-Pao, which otherwise resist its STAB moves.</li> <li>Chien-Pao can use Tera Dark to make Crunch stronger and 2HKO Corviknight and Toxapex if it gets lucky with a Defense drop. Chien-Pao can also use Tera Ice in order to 2HKO Corviknight more reliably and boost Ice Shard damage—notably against Miraidon, Flutter Mane, and Koraidon. Lastly, Tera Electric Chien-Pao with Tera Blast can easily break through bulky checks like Toxapex, Corviknight, and Dondozo.</li> <li>Chien-Pao fits best with other strong wallbreakers that benefit from the removal of defensive walls. These include Koraidon, Miraidon, Iron Bundle, and offensive Great Tusk.</li> <li>Defensive partners like Ting-Lu, Great Tusk, and Skeledirge are mandatory to handle fast and strong threats like Koraidon and Miraidon, as Chien-Pao cannot OHKO them if they are at  full health. Additionally, Great Tusk and Ting-Lu can set up entry hazards, which is crucial for getting chip on defensive walls.</li> </ul> "
      },
      {
        "name": "Choice Band",
        "description": "<ul> <li>Icicle Crash 2HKOes Corviknight and avoids Rocky Helmet, while Ice Spinner is more accurate and has the bonus of removing Electric Terrain.</li> <li>Sacred Sword hits checks such as Kingambit and opposing Chien-Pao. Another option is to run a double priority combination with Ice Shard and Sucker Punch. Sucker Punch hits very crucial Pokemon that Ice Shard can't, such as Tera Fire Koraidon, Tera Fire Flutter Mane, and Iron Bundle.</li> <li>An Adamant nature allows Chien-Pao to achieve ridiculous feats such as revenge killing Flutter Mane from 90% HP with Ice Shard. A Jolly nature lets Chien-Pao Speed tie with Koraidon, Miraidon, opposing Jolly Chien-Pao, and Flutter Mane, giving Chien-Pao the freedom to click its strongest moves less reluctantly.</li> <li>Tera Dark allows Chien-Pao to 2HKO the entire tier while letting it still switch into weaker moves such as Shadow Ball. Tera Ice gives Chien-Pao the ability to OHKO Flutter Mane with Ice Shard, making it a terrific late-game cleaner.</li> <li>Choice Band Chien-Pao is a wallbreaker that is best suited for bulky offense structures that love its revenge killing and wallbreaking capabilities.</li> <li>Pokemon like Iron Treads, Hatterene, and Koraidon, which can provide entry hazard control or pivoting, are excellent teammates for Chien-Pao.</li> </ul> "
      },
      {
        "name": "Swords Dance",
        "description": "<ul> <li>Swords Dance makes Chien-Pao immensely threatening, letting it break through bulky foes such as Toxapex, Great Tusk, and Corviknight.</li> <li>Ice Spinner is a more reliable option thanks to its perfect accuracy, but Icicle Crash's power and flinch chance greatly help out against all foes that can take a hit from Chien-Pao, such as Corviknight and Great Tusk.</li> <li>Ice Shard is a reliable priority attack mainly used to better deal with Miraidon and Koraidon.</li> <li>Sucker Punch can be used as a stronger but prediction-reliant alternative that OHKOes Flutter Mane without a boost and OHKOes the likes of Iron Bundle and Miraidon after a boost. It also provides a favorable roll to OHKO Koraidon if it has Terastallized into the Fire typing.</li> <li>Tera Dark boosts Crunch, allowing Chien-Pao to more reliably beat physically defensive Corviknight and Toxapex. Tera Dark Chien-Pao holding Life Orb can OHKO both Pokemon after a Swords Dance boost.</li> <li>Tera Ice can be used instead to boost Chien Pao's Ice-type attacks. This also makes Ice Shard a better revenge killing option.</li> <li>Sacred Sword can be used to hit foes that resist Chien-Pao's STAB moves, like Kingambit and opposing Chien-Pao.</li> <li>Life Orb is the primary item choice because it gives Chien-Pao a lot of power while allowing it to run a Jolly nature and not lose out on potential OHKOs.</li> <li>Heavy-Duty Boots sacrifices a lot of power but gives Chien-Pao the ability to ignore entry hazards, allowing it to come in and potentially set up multiple times throughout a game.</li> <li>Black Glasses in conjunction with an Adamant nature can be used as an alternative to Life Orb to not have recoil while still being able to OHKO the likes of Corviknight and Toxapex after obtaining a Swords Dance boost and using Tera Dark.</li> <li>This set can be used as both an early-game wallbreaker and a late-game sweeper thanks to Chien-Pao's strong STAB attacks and priority moves.</li> <li>Chien-Pao has very little defensive utility, so having a defensive core for it to fall back on is recommended for balance teams. On offensive teams, it can afford to run Focus Sash to take at least one hit from foes that would usually threaten it out.</li> <li>Great Tusk is Chien-Pao's best teammate, as Great Tusk can handle one of Chien-Pao's hardest checks in Koraidon and provide Rapid Spin support. Rapid Spin also helps keep Focus Sash intact.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 306317, "username": "corvere"}, {"user_id": 50695, "username": "Manaphy"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 297659, "username": "deetah"}, {"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 306317, "username": "corvere"}, {"user_id": 374620, "username": "pichus"}, {"user_id": 507268, "username": "ox04"}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<ul> <li>Ting-Lu is a key Pokemon for many playstyles in SV Ubers, ranging from stall to bulky offense.</li> <li>Whirlwind helps Ting-Lu against Substitute users like Flutter Mane and Baxcalibur and other threatening hyper offense Pokemon such as Agility + Calm Mind Miraidon.</li> <li>Tera Steel lets Ting-Lu check Pokemon such as Flutter Mane, Chien-Pao, and Iron Bundle. Tera Ghost, on the other hand, lets Ting-Lu soft check physical attackers such as Great Tusk, Koraidon locked into Close Combat, Iron Hands, and Iron Valiant. Tera Fire is another option that lets Ting-Lu soft check and beat Chi-Yu one-on-one. Lasty, Tera Fairy is also an option to check Dragon-types and have an overall good defensive typing against Pokemon that would normally overwhelm Ting-Lu, such as Choice Specs Miraidon.</li> <li>Ting-Lu works best as a defensive pivot on bulky offense teams, capitalizing on its massive natural bulk and ability Vessel of Ruin to set Spikes against Pokemon like Miraidon and Chi-Yu, tank big hits, and recover HP with Protect.</li> <li>Pokemon that appreciate Ting-Lu's ability to wear down opposing Ground-types with Spikes, such as Miraidon and Koraidon, are excellent partners for it. Other defensive Pokemon such as Iron Treads, Corviknight, and Blissey relieve pressure of Ting-Lu by helping to check Miraidon; they also check Flutter Mane, and Corviknight additionally helps check Chien-Pao.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}], "writtenBy": [{"user_id": 306317, "username": "corvere"}]}
  },
  "Chi-Yu": {
    "sets": [
      {
        "name": "Feesh (Offensive Wallbreaker)",
        "description": "<ul> <li>Overheat hits extremely hard and can 2HKO even the bulkiest of Pokemon. Fire Blast and Flamethrower can be used to KO foes without Chi-Yu suffering a Special Attack drop, with Flamethrower having perfect accuracy.</li> <li>The only reason to run Timid over Modest is to outspeed Jolly Great Tusk, Jolly Annihilape, and fast Iron Treads with Special Defense investment.</li> <li>Tera Fire allows Chi-Yu to turn 2HKOs to OHKOs, for example OHKOing opposing Chi-Yu with Overheat. Tera Fire also lets it 2HKO any prominent special wall, including Toxapex, Blissey, and Ting-Lu, OHKOing them with sun.</li> <li>Choice Specs Chi-Yu is a wallbreaker, suited best for offensive teams. Koraidon is an excellent teammate because it sets sun and pivots Chi-Yu in with U-turn. Koraidon and Chi-Yu also threaten each other's checks, like Koraidon threatening Blissey and Garganacl and Chi-Yu threatening Skeledirge and Dondozo.</li> <li>Helpful teammates are those that can get Chi-Yu in safely and force out its few checks. Corviknight and Koraidon are noteworthy examples, pivoting into special walls such as Ting-Lu. Lures such as Heavy Slam Koraidon and Great Tusk, which beat Dachsbun, and Psyshock Flutter Mane, which beats Toxapex and Blissey, are also appreciated teammates.</li> </ul> "
      },
      {
        "name": "Choice Scarf",
        "description": "<ul> <li>Fire Blast is Chi-Yu's strongest STAB move without any stat drops. Psychic is an alternative that 2HKOes common switch-ins such as Dachsbun and Toxapex. Overheat facilitates revenge killing, hitting even Pokemon that resist it such as Koraidon hard, and is a better midground play.</li> <li>Memento serves as a way to facilitate sweepers like Swords Dance + Flame Charge Koraidon that Chi-Yu is usually paired with.</li> <li>Tera Fire powers up Flamethrower and Overheat to nuclear levels, turning 2HKOs against Pokemon such as Koraidon into OHKOs. Tera Dark nullifies Chi-Yu's Stealth Rock weakness while making Dark Pulse 2HKO Dachsbun and Toxapex. Tera Grass should only be used with Tera Blast; it gives Chi-Yu nice resistances to Ground and Water and allows Chi-Yu to OHKO Great Tusk and 2HKO Ting-Lu after Spikes damage.</li> <li>Choice Scarf Chi-Yu is a revenge killer best suited for offensive teams.</li> <li>Pokemon that can get Chi-Yu safely into the field, such as Koraidon, Miraidon, and Corviknight, are excellent teammates for it. Koraidon also sets up sun, further boosting Chi-Yu's Fire-type attacks.</li> <li>Ting-Lu and Glimmora can set entry hazards to guarantee some 2HKOs, such as against opposing Ting-Lu.</li> </ul> "
      },
      {
        "name": "Nasty Plot",
        "description": "<ul> <li>Nasty Plot Chi-Yu can threaten to KO foes it couldn't otherwise, such as Ting-Lu and Blissey. Overheat hits extremely hard and threatens to OHKO Ting-Lu at +2. Flamethrower is valuable for its perfect accuracy.</li> <li>A Modest nature alongside Life Orb lets Chi-Yu OHKO Ting-Lu at +2. Heavy-Duty Boots can be used instead to give Chi-Yu more opportunities to switch in, but the loss of power is notable.</li> <li>Chi-Yu fits best on offensive teams with Pokemon such as Cyclizar and Grimmsnarl that can facilitate its setup. Sticky Web support from Masquerain is also useful, as it lets Chi-Yu outrun Pokemon like Koraidon and Miraidon and KO them at +2.</li> <li>Chi-Yu's best partner is Koraidon, since it sets up sun, can safely bring Chi-Yu into play with U-turn, and threatens Blissey. Other good partners are special attackers that benefit from special walls being neutered by Chi-Yu, such as Miraidon, Flutter Mane, and Gholdengo. Great Tusk is also greatly appreciated, as it can remove Stealth Rock and threatens Blissey and Ting-Lu for Chi-Yu. Chi-Yu can deal with Corviknight and Dondozo in return.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 50695, "username": "Manaphy"}, {"user_id": 511624, "username": "Fc"}, {"user_id": 415367, "username": "Eledyr"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "Lunaflare"}, {"user_id": 517429, "username": "Adeleine"}, {"user_id": 493772, "username": "lumii"}, {"user_id": 523866, "username": "UT"}, {"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 537354, "username": "ILoveMashing"}, {"user_id": 306317, "username": "corvere"}]}
  },
  "Roaring Moon": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<ul> <li>With Dragon Dance and Acrobatics, Roaring Moon is a strong sweeper on offensive teams, with coverage to beat almost all Pokemon.</li> <li>Tera Flying allows Roaring Moon to set up on Great Tusk and Body Press Corviknight and boosts Acrobatics's power to achieve feats such as OHKOing Toxapex and Ting-Lu after two Dragon Dances and entry hazard or slight chip damage.</li> <li>Crunch is more reliable, having a chance to drop Defense with no potential drawback, while Jaw Lock has the potential to give Roaring Moon a free chance to set up when paired with Roost, assuming a favorable target is trapped. If an unfavorable target is trapped, however, it has a major downside, making it less consistent.</li> <li>Roost gives Roaring Moon more opportunities to use Dragon Dance, turning weaker Pokemon like Brave Bird Corviknight and Whirpool Alomomola into setup fodder.</li> <li>Earthquake hits Kingambit, Garganacl, and Iron Treads, which can otherwise survive hits and wear down Roaring Moon.</li> <li>Taunt stops defensive Pokemon like Haze Toxapex, Will-O-Wisp Skeledirge, and Whirlwind Ting-Lu from dealing with Roaring Moon, making it devastating against bulkier teams if positioned right.</li> <li>Hyper offense leads such as Glimmora, Froslass, and Grimmsnarl all give Roaring Moon good support to break through a team more easily.</li> <li>Choice Scarf Great Tusk, Tera Fire Koraidon, and Tera Fairy Miraidon can all be used to bait Chien-Pao and take it out, helping Roaring Moon greatly, as it is one of the most reliable revenge killers that can be used against it.</li> <li>On bulkier teams, Roaring Moon requires teammates that can switch into Ice-type moves from Chien-Pao and Iron Bundle, making Toxapex and specially defensive Corviknight great partners. The latter can also pivot with U-turn, giving Roaring Moon more chances to set up on defensive Pokemon.</li> </ul> "
      },
      {
        "name": "Full Moon (Choice Band)",
        "description": "<ul> <li>Earthquake lets Roaring Moon break past Pokemon that would otherwise check it, like Garganacl, Toxapex, and especially Kingambit.</li> <li>Iron Head lets Roaring Moon hit Fairy-types like Iron Valiant and Tera Fairy Garganacl and Skeledirge super effectively.</li> <li>U-turn lets Roaring Moon generate offensive momentum for its team and is especially useful against targets Roaring Moon scares out, like Skeledirge without Tera Fairy and Gholdengo.</li> <li>The given EVs and a Jolly nature ensure Roaring Moon's Speed is boosted in sunlight, letting it get the jump on crucial threats like unboosted non-Choice Scarf Koraidon and Miraidon and threaten them with its STAB Dragon Claw. The remaining 36 Special Defense EVs improve Roaring Moon's chances to survive Iron Bundle's Ice Beam after Stealth Rock while giving it a chance to survive Overheat in sun from Modest Choice Specs Chi-Yu.</li> <li>Tera Dark strengthens Roaring Moon's Crunch to the point where it always 2HKOs physically defensive Corviknight and always 3HKOs Dondozo while easing predictions with Earthquake against Garganacl.</li> <li>Tera Steel lets Roaring Moon resist otherwise super effective Ice-, Fairy-, and Dragon-type attacks from the likes of Iron Bundle, Flutter Mane, Koraidon, and Miraidon. Tera Steel also powers up Roaring Moon's Iron Head.</li> <li>Tera Fairy allows Roaring Moon to resist Fighting-type attacks while becoming immune to Dragon-type attacks, letting it defeat Koraidon and Iron Valiant, both of which outspeed and threaten to OHKO Roaring Moon otherwise.</li> <li>Roaring Moon loves the support of Koraidon, as it activates Roaring Moon's Protosynthesis via Orichalcum Pulse and reliably threatens Pokemon such as Koraidon, Miraidon, and Ice-types like Chien-Pao and Iron Bundle. In return, Roaring Moon threatens non-Terastallized Skeledirge.</li> <li>Koraidon and Roaring Moon both struggle with defensive Great Tusk, so they can team up with Iron Bundle and Chien-Pao, which threaten all Great Tusk sets. Iron Bundle and Chien-Pao also threaten Koraidon and Miraidon, with Iron Bundle naturally outspeeding non-Choice Scarf variants and Chien-Pao threatening them with priority Ice Shard.</li> <li>Defensive Great Tusk and Ting-Lu also work well with Roaring Moon, as they can set up entry hazards for Roaring Moon's team and check Koraidon and Miraidon, respectively. Great Tusk in particular can use Rapid Spin, giving Roaring Moon more opportunities to switch in, while Ting-Lu can phaze threatening boosters like Espathra with Whirlwind and set up Spikes.</li> <li>Specially defensive Corviknight can check Flutter Mane and Iron Bundle, both of which outspeed and threaten Roaring Moon, and can Defog hazards away, giving Roaring Moon more opportunities to switch in.</li> <li>Roaring Moon can easily pivot into Chi-Yu, which takes advantage of the sun set by Koraidon and threatens walls like Great Tusk, Corviknight, Ting-Lu, and Terastallized Skeledirge.</li> <li>Gholdengo also makes for a decent partner, as not only does it have perfect defensive synergy with Roaring Moon, but it can also reliably block all common forms of hazard removal. This allows Roaring Moon’s team to keep up hazards, in particular Spikes, for it to eventually break down walls.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}, {"user_id": 507268, "username": "ox04"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}, {"user_id": 597293, "username": "OreoSpeedruns"}]}
  },
  "Iron Valiant": {
    "sets": [
      {
        "name": "Mixed",
        "description": "<ul> <li>Life Orb Iron Valiant is a strong wallbreaker that can threaten common walls such as Corviknight, Ting-Lu, Clodsire, Skeledirge, Blissey, and Toxapex.</li> <li>Thunderbolt is a good coverage move to hit Corviknight and Toxapex hard and is especially powerful under Electric Terrain. Psyshock is Iron Valiant's strongest option for breaking through Clodsire.</li> <li>Knock Off lets Iron Valiant wear down potential checks by removing Leftovers and Heavy-Duty Boots. Shadow Ball hits most targets neutrally and Skeledirge and Scream Tail, which would otherwise wall it, super effectively. However, this option is outclassed by Knock Off and Psyshock.</li> <li>Tera Fairy makes Iron Valiant's Moonblast immensely strong while maintaining its Dragon immunity and resistance to Sucker Punch from Kingambit and Chien-Pao.</li> <li>Iron Valiant fits on offensive teams thanks to its ability to outspeed and KO common offensive foes while under Electric Terrain, such as Miraidon, Koraidon, Chien-Pao, and Great Tusk, while pressuring walls including Ting-Lu, Corviknight, Clodsire, and Toxapex. However, Life Orb recoil and the ever-present entry hazards make it difficult for Iron Valiant to maintain pressure in longer games, and common, faster wallbreakers, such as Scarf Koraidon, Iron Bundle, and Protosynthesis-boosted Flutter Mane, force Iron Valiant out.</li> <li>Miraidon is a fantastic partner for Iron Valiant thanks to it providing Electric Terrain support and pivoting Iron Valiant in with U-turn. In return, Iron Valiant can take on Ting-Lu, Clodsire, Blissey, and Chien-Pao for Miraidon while switching into Dragon moves from opposing Miraidon and Koraidon.</li> <li>Wallbreakers like Iron Bundle, Chien-Pao, and Flutter Mane appreciate Iron Valiant breaking through Corviknight and Toxapex while they take on Skeledirge for Iron Valiant.</li> <li>Great Tusk and Skeledirge are great teammates for dealing with Koraidon, which can take on any of Iron Valiant's attacks with Tera Fire and set up sun to make it harder for Iron Valiant to revenge kill Flutter Mane.</li> <li>Specially defensive Corviknight is a fantastic partner for soft checking Iron Bundle and Flutter Mane while removing entry hazards with Defog. Great Tusk also clears hazards, making it easier for Iron Valiant to consistently come in during a match.</li> </ul> "
      },
      {
        "name": "Swords Dance",
        "description": "<ul> <li>Swords Dance Iron Valiant functions as a decent setup sweeper for offensive teams, thanks to its good coverage and high Speed with Quark Drive and Booster Energy.</li> <li>Knock Off annihilates Gholdengo and is Iron Valiant's best option against Skeledirge.</li> <li>Alternatively, Shadow Sneak OHKOes Flutter Mane after a Swords Dance boost, which otherwise outspeed Iron Valiant in the sun.</li> <li>Iron Valiant excels against teams that rely on defensive Great Tusk as their main check to physical attackers, so teammates that appreciate Great Tusk being gone, such as Koraidon, are recommended.</li> <li>Skeledirge completely walls Iron Valiant, with Iron Valiant only being able to remove it's Heavy-Duty Boots with Knock Off. This is exacerbated thanks to the nature of Booster Energy only activating once.</li> <li>As a result, special attackers such as Miraidon, Iron Moth, and Chi-Yu are recommended, with Miraidon's Electric Terrain allowing Iron Valiant to keep Booster Energy longer, while the latter two's burn immunity grants them an easy time switching in.</li> <li>Lures to Skeledirge such as Outrage or Stomping Tantrum Koraidon are also useful.</li> <li>Even after Booster Energy is activated, Speed-boosted Iron Bundle and Flutter Mane as well as Choice Scarf Koraidon and Miraidon can revenge kill Iron Valiant without much issue. Due to this, Grimmsnarl is a helpful teammate, as its Reflect and Light Screen support makes revenge killing Iron Valiant more difficult.</li> <li>Spikes support from Froslass or Glimmora is greatly appreciated, as a layer of Spikes will guarantee the OHKO on Great Tusk from +2 Tera Fairy Spirit Break, not to mention Iron Valiant's Knock Off naturally pairs well with entry hazards.</li> </ul> "
      },
      {
        "name": "Booster Energy",
        "description": "<ul> <li>Booster Energy Iron Valiant is a good anti-offense Pokemon, as it outspeeds and revenge kills many hyper offense staples such as Koraidon, Chien-Pao, and Miraidon.</li> <li>Thunderbolt hits Toxapex and Corviknight hard, while Focus Blast is Iron Valiant's strongest STAB option against Tera Steel Pokemon like Ting-Lu which would otherwise check Iron Valiant. Focus Blast also 2HKOes Blissey after a Calm Mind boost, something that Psyshock fails to do.</li> <li>Psyshock hits Unaware Clodsire and the rare Iron Moth for super effective damage. Shadow Ball, on the other hand, hits Skeledirge, Iron Valiant's biggest roadblock, but it doesn't offer much outside of that.</li> <li>Tera Fairy powers up Moonblast while retaining Iron Valiant's useful defensive niche against Sucker Punch from Pokemon like Chien-Pao and Kingambit. However, Tera Electric Thunderbolt 2HKOes Toxapex and Corviknight without a boost. It also makes Iron Valiant immune to Thunder Wave and removes its weakness to Steel-type attacks.</li> <li>Booster Energy Iron Valiant is best suited for offensive teams and, as such, should be used offensively, using its perfect coverage to break enemy walls and revenge kill threats to its team.</li> <li>Miraidon is Iron Valiant's best teammate, as it sets Electric Terrain, letting Iron Valiant conceal its item; it also powers up Thunderbolt and can get Iron Valiant safely into the field with U-turn. Iron Valiant, in return, deals with Pokemon like Ting-Lu, Clodsire, and Blissey for Miraidon. Other hyper offense Pokemon like Chien-Pao, Flutter Mane, Gholdengo, and Dragonite appreciate Iron Valiant for its good matchup against other offensive teams.</li> </ul> "
      },
      {
        "name": "Choice Specs",
        "description": "<ul> <li>Choice Specs Iron Valiant is a potent offensive threat that is difficult to switch into thanks to its spammable STAB attacks and high Speed under Electric Terrain.</li> <li>Thunderbolt breaks through Corviknight and Toxapex and is further boosted by Electric Terrain. Shadow Ball pressures Skeledirge and Scream Tail, but Psyshock is an option to beat Clodsire, which would wall this set otherwise.</li> <li>Fairy is Iron Valiant's best Tera type, as it makes its Moonblast incredibly difficult to switch into, threatening to OHKO Flutter Mane, while maintaining its Dragon immunity and resistance to Sucker Punch from Kingambit and Chien-Pao.</li> <li>Iron Valiant fits on offensive teams that appreciate its ability to take on common Dark- and Dragon-types such as Ting-Lu, Chien-Pao, Kingambit, Miraidon, and Koraidon. Iron Valiant also helps break past walls such as Clodsire, Corviknight, and Toxapex, which are roadblocks for its teammates such as Flutter Mane and Iron Bundle.</li> <li>Miraidon is the best partner for Iron Valiant thanks to powering up Thunderbolt, boosting its Speed because of Quark Drive, and pivoting into Iron Valiant with U-turn. Similarly, wallbreakers such as Iron Bundle, Flutter Mane, and Chien-Pao appreciate Iron Valiant breaking Corviknight and Toxapex, and they can take on Skeledirge for Iron Valiant in return. Finally, Skeledirge uses Corviknight as setup fodder, and Great Tusk threatens Tera Fire Koraidon for Iron Valiant.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}, {"user_id": 415367, "username": "Eledyr"}, {"user_id": 306317, "username": "corvere"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 467437, "username": "Dawn of Ares"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 595062, "username": "Takatk"}, {"user_id": 306317, "username": "corvere"}, {"user_id": 50695, "username": "Manaphy"}]}
  },
  "Koraidon": {
    "sets": [
      {
        "name": "Swords Dance + Flame Charge",
        "description": "<ul> <li>Collision Course can be used for universal damage and to threaten Ting-Lu more reliably, while Iron Head can beat certain checks like Dachsbun and Tera Fairy Skeledirge.</li> <li>Heavy Slam can be used to KO Scream Tail without Terastallizing into a Steel-type, unlike Iron Head, which requires it to do so. Otherwise, it makes dealing with Tera Fairy Skeledirge and Tera Fairy Koraidon or Miraidon more difficult.</li> <li>Koraidon can use Tera Fire to power up Flame Charge and avoid a burn from Skeledirge, while Tera Steel Koraidon helps prevent revenge killing attempts from Choice Scarf Dragon-types like Miraidon and opposing Koraidon. Both also allow it to resist Fairy, helping against Flutter Mane and Quark Drive-boosted Iron Valiant.</li> <li>Swords Dance Koraidon is a sweeper, making it best used on offensive teams mid- or late-game.</li> <li>With high natural bulk, Koraidon typically can set up on defensive walls like Corviknight and Ting-Lu. It also appreciates having Terastallization available for the defensive benefits.</li> <li>Entry hazard leads pair best with Koraidon to fuel hyper offense teams. Pokemon like Masquerain, Froslass, and Glimmora do this the best, while Grimmsnarl provides good support with dual screens.</li> <li>Other setup sweepers like Miraidon, Chien-Pao, and Flutter Mane are also great teammates, as they can break through walls to facilitate a Koraidon sweep, or Koraidon can do the same for them depending on the matchup.</li> <li>Offensive Great Tusk appreciates the sun provided by Koraidon while also removing entry hazards with Rapid Spin, which is especially important if Toxic Spikes are set up or if Koraidon Terastallizes into a Fire-type.</li> </ul> "
      },
      {
        "name": "Choice Scarf",
        "description": "<ul> <li>Koraidon's high Speed boosted by a Choice Scarf makes it a great revenge killer and pivot.</li> <li>Dragon Claw provides a secondary STAB option, while Flare Blitz takes advantage of Koraidon's sun and hits Steel-types hard, especially when boosted by Tera Fire.</li> <li>U-turn can gain a large amount of momentum thanks to the switches Koraidon naturally forces.</li> <li>Tera Fighting allows Koraidon's Fighting-type STAB to clean up weakened teams and lets Koraidon take some Ice-type attacks.</li> <li>Tera Steel gives Koraidon useful resistances to Ice- and Fairy-type attacks and boosts the power of Heavy Slam, which does massive damage to Scream Tail and Dachsbun.</li> <li>Stronger STAB options in Close Combat and Outrage can be run, with Outrage notably having a decent shot to 2HKO Skeledirge, although both moves come with significant risks.</li> <li>Koraidon pairs extremely well with strong wallbreakers such as Chi-Yu and Choice Band Chien-Pao, which can take advantage of common switch-ins to Koraidon such as Skeledirge and Scream Tail. Chi-Yu is especially noteworthy, as its Fire-type moves become massively powerful under the sun.</li> </ul> "
      },
      {
        "name": "Swords Dance",
        "description": "<ul> <li>Swords Dance allows Koraidon to boost its already great Attack stat and become an incredibly threatening wallbreaker. It can easily set up on Pokemon such as Corviknight, Blissey, and Ting-Lu.</li> <li>Close Combat is a strong STAB move that allows Koraidon to OHKO foes such as Miraidon and offensive Great Tusk after a Defense drop.</li> <li>Collision Course hits Pokemon such as Ting-Lu and Alomomola reliably without any drawbacks.</li> <li>Flare Blitz OHKOes Corviknight and can 2HKO defensive Great Tusk after Swords Dance.</li> <li>Stomping Tantrum allows Koraidon to deal with Skeledirge and Toxapex, which otherwise wall it. A combination of Close Combat on the switch and Stomping Tantrum the next turn doubles Stomping Tantrum's power allowing Koraidon to OHKO its premier check in Skeledirge, allowing it to wallbreak consistently and effectively.</li> <li>Tera Fire boosts Flare Blitz to a very high level, allowing Koraidon to 2HKO Skeledirge and Toxapex after slight chip damage. Tera Fire also stops Chien-Pao, Iron Bundle, and Flutter Mane from revenge killing Koraidon, and it can block Skeledirge's Will-O-Wisp.</li> <li>Tera Steel allows Koraidon to resist Ice-, Dragon-, and Fairy-type moves from foes such as Chien-Pao, Miraidon, and Flutter Mane, while Tera Fairy makes it immune to Dragon-type moves such as Draco Meteor from Miraidon or Dragon Claw from opposing Koraidon.</li> <li>Some other wallbreakers such as Chi-Yu and Flutter Mane appreciate Koraidon setting up sun. In return, they threaten walls such as Alomomola, Toxapex, and Skeledirge that trouble Koraidon.</li> <li>Entry hazard removers such as Great Tusk, Iron Treads, and Corviknight are good teammates, as Koraidon wears itself down easily due to Life Orb and Flare Blitz recoil. A weakened Koraidon can be easily revenge killed by Flutter Mane and Iron Bundle, so it appreciates Corviknight's ability to switch into them.</li> </ul> "
      },
      {
        "name": "Choice Band",
        "description": "<ul> <li>Close Combat is preferred over Collision Course due to its higher power, but Collision Course doesn't have any drawbacks, making it a better move for cleaning weakened teams if needed.</li> <li>Flare Blitz is very strong with a sun boost and potential Tera Fire, while Heavy Slam can reliably 2HKO Scream Tail and OHKO Dachsbun, the latter of which notably hard counters Koraidon.</li> <li>Dragon Claw is more reliable than Outrage, since being locked into Outrage leaves Koraidon susceptible to being revenge killed by common fast Pokemon like Flutter Mane and Chien-Pao. However, it does miss a few notable 2HKOs without entry hazard damage, such as against Alomomola and Toxapex.</li> <li>Tera Fire greatly boosts the power of Flare Blitz, letting Koraidon 2HKO some of the bulkiest Fire-resistant Pokemon like Skeledirge and Toxapex. Tera Fighting similarly boosts Close Combat to the point where it has a chance to 2HKO the best defensive Fighting-resistant Pokemon in Toxapex and Pelipper; after minimal chip damage, they are always 2HKOed. Tera Steel removes the weakness to Ice- and Fairy-types just as Tera Fire does, but it also provides a resistance to Dragon, making it very valuable defensively against Miraidon and opposing Koraidon.</li> <li>Koraidon is best played aggressively, pressuring common walls like Ting-Lu and using U-turn to weaken its switch-ins, or breaking through teams without a Ghost-type with immediate Close Combat pressure.</li> <li>Choice Scarf Chi-Yu revenge kills other Pokemon around Koraidon's Speed tier such as Chien-Pao, Flutter Mane, and Iron Bundle, all while greatly appreciating the sun boost and pivoting Koraidon gives.</li> <li>Other fast offensive threats like Flutter Mane and Choice Band Chien-Pao, as well as fast revenge killers like Choice Scarf Great Tusk and Gholdengo, appreciate it when Koraidon weakens defensive Pokemon to allow them to sweep.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 213053, "username": "Trade"}, {"user_id": 415367, "username": "Eledyr"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 507268, "username": "ox04"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 517429, "username": "Adeleine"}, {"user_id": 430518, "username": "Lunaflare"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}, {"user_id": 50695, "username": "Manaphy"}, {"user_id": 532881, "username": "Frozoid"}]}
  },
  "Miraidon": {
    "sets": [
      {
        "name": "Pivot",
        "description": "<ul> <li>Electric- and Dragon-type STAB moves allow Miraidon to force out a large portion of the metagame and gain momentum by pivoting with U-turn.</li> <li>Tera Blast with Tera Water targets Ground-types that resist Electro Drift and would take advantage of a Draco Meteor Special Attack drop, such as Ting-Lu and Iron Treads.</li> <li>Overheat can instead be used to beat Iron Treads without needing to Terastallize.</li> <li>Among its viable Tera types, Water is also Miraidon's best bet defensively, removing its weaknesses to Dragon- and Fairy-type moves and resisting Steel-type moves from Gholdengo and Iron Treads. Tera Dragon is used with Overheat, powering up Draco Meteor when Tera Blast isn't run.</li> <li>Pivot Miraidon should be used aggressively, taking advantage of its high Special Attack to force out foes and use U-turn, wearing down its most common checks like Ting-Lu.</li> <li>When a team is sufficiently worn down, Miraidon can use Electro Drift and Tera Blast or Draco Meteor to clean thanks to its high Speed.</li> <li>Entry hazard setters are greatly appreciated, especially Spikes setters, to help wear down Ground-types for Miraidon. Ting-Lu, Great Tusk, and Clodsire can all set hazards.</li> <li>Tera Water Miraidon appreciates Pelipper setting rain to power up Tera Blast, and Pelipper also checks physical Choice Scarf users like Koraidon and Great Tusk, which can revenge kill Miraidon. Tera Dragon Miraidon instead prefers support from Koraidon to power up Overheat, and it usually appreciates Koriadon running Choice Scarf to revenge kill foes.</li> </ul> "
      },
      {
        "name": "Choice Specs",
        "description": "<ul> <li>Overheat punishes Steel-types that would switch into Miraidon's STAB moves, such as Iron Treads.</li> <li>U-turn and Volt Switch are both great pivoting options; U-turn eases prediction because it's not blocked by Ground-types like Iron Treads, Ting-Lu, and Clodsire, while Volt Switch hits way harder.</li> <li>After Terastallizing, Tera Dragon Miraidon OHKOes Clodsire after Spikes and 2HKOes Ting-Lu. Tera Fairy allows Miraidon to take on opposing Miraidon and Koraidon locked into Dragon-type moves; also, removing its weaknesses to Ice and Ground lets it KO foes like Iron Bundle and Great Tusk. Tera Electric can be used to 2HKO Blissey and KO Koraidon after minimal chip damage.</li> <li>Quark Drive users like Iron Bundle and Iron Treads can deal with faster threats and other unboosted base 135 Speed foes, like Koraidon and Flutter Mane, respectively. Miraidon setting Electric Terrain activates Quark Drive for them. Setup sweepers like Bulk Up Great Tusk and Swords Dance Chien-Pao can pick off weakened foes and also force out opposing Ground-types.</li> </ul> "
      },
      {
        "name": "Double Dance",
        "description": "<ul> <li>The combination of Calm Mind and Agility allows Miraidon to threaten a vast majority of the metagame, using passive walls such as Corviknight, Dondozo, and Blissey as setup fodder. With Agility and 8 EVs in Speed, Miraidon can outrun Timid Iron Bundle under Electric Terrain.</li> <li>Parabolic Charge greatly increases Miraidon's longevity. For example, after two Calm Mind boosts, Parabolic Charge outheals Blissey's Seismic Toss. Electro Drift can also be used for its significantly higher Base Power, threatening to immediately OHKO would-be offensive checks such as Flutter Mane and Chi-Yu.</li> <li>Dazzling Gleam threatens Great Tusk and Koraidon, while Dragon Pulse is a solid alternative STAB option.</li> <li>Tera Fairy removes Miraidon's weaknesses to Ice- and Fairy-type attacks, allowing it to take on threats like Chien-Pao and Flutter Mane.</li> <li>Miraidon likes teammates such as Grimmsnarl, which let it set up more freely.</li> <li>Offensive checks to Unaware Clodsire, such as Koraidon, Iron Bundle, and Bulk Up + Taunt Annihilape, are greatly appreciated, as Miraidon cannot break through it.</li> </ul> "
      },
      {
        "name": "Calm Mind",
        "description": "<ul> <li>Calm Mind turns Miraidon into a powerful wallbreaker, using passive walls such as Corviknight, Dondozo, and Blissey as setup fodder.</li> <li>Electro Drift is a powerful STAB move, while Parabolic Charge increases Miraidon's staying power greatly. Both are boosted by Electric Terrain from Hadron Engine.</li> <li>Draco Meteor should only be used with Tera Dragon and Life Orb, as, after Terastallizing, it has solid chances to OHKO Ting-Lu at +1 and 2HKOes Clodsire. Dazzling Gleam can be used instead with Tera Fairy and Life Orb, as it OHKOes Koraidon, OHKOes Great Tusk, and 2HKOes Ting-Lu after Terastralizing Fairy and with a Life Orb. Dragon Pulse is a STAB option with no drawbacks, but the loss in power is significant.</li> <li>Overheat threatens Steel-types such as Iron Treads and Kingambit. Substitute can be used instead to set up safely against passive walls such as Corviknight, Dondozo, and Garganacl. Substitute + Parabolic Charge lets Miraidon act as a solid wincon, recovering from chip damage behind its Substitute and cleaning a weakened team. However, without Overheat, Iron Treads walls Miraidon completely.</li> <li>Besides boosting Dazzling Gleam, Tera Fairy removes Miraidon's weaknesses to Ice and Ground, which lets it beat foes like Iron Bundle and Great Tusk.</li> </ul> "
      },
      {
        "name": "Choice Scarf",
        "description": "<ul> <li>Choice Scarf makes Miraidon an effective revenge killer, late-game sweeper, and pivot, taking advantage of its great Speed, naturally amazing offenses, and access to U-turn.</li> <li>Electro Drift is a strong STAB move that is capable of OHKOing many foes like Chien-Pao, Chi-Yu, offensive Gholdengo, and Flutter Mane after Stealth Rock.</li> <li>Draco Meteor's biggest advantage is its ability to OHKO opposing Miraidon and Koraidon. It also gives Miraidon crucial coverage against Ground-types.</li> <li>Dazzling Gleam can be used as a more consistent alternative to Draco Meteor, since it hits almost all the same targets while also hitting Ting-Lu for super effective damage. The biggest problem with using Dazzling Gleam over Draco Meteor is that Miraidon struggles even more against Clodsire.</li> <li>Overheat provides crucial coverage against Iron Treads and often serves as a good midground because of its high Base Power.</li> <li>U-turn helps Miraidon pivot out of the Ground-type Pokemon that commonly switch into it. Teammates like Iron Bundle can capitalize on this.</li> <li>Tera Fairy is the preferred option because it helps Miraidon deal with opposing Miraidon and Koraidon and removes its weaknesses to Ice- and Fairy-type moves. It also helps Miraidon better deal with Sucker Punch as a bonus.</li> <li>Tera Electric is useful for removing Miraidon's Dragon, Ice, and Fairy weaknesses while powering up its best move in Electro Drift. This is most useful late-game after opposing Ground-types are removed.</li> <li>Iron Bundle, Chien-Pao, Great Tusk, and Koraidon are good teammates for this set, since they are strong attackers that can threaten out common specially defensive Ground-types such as Ting-Lu and Iron Treads.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 50695, "username": "Manaphy"}, {"user_id": 249382, "username": "Aberforth"}, {"user_id": 511624, "username": "Fc"}, {"user_id": 306317, "username": "corvere"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 528036, "username": "Sulo"}, {"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 511624, "username": "Fc"}, {"user_id": 415367, "username": "Eledyr"}, {"user_id": 507268, "username": "ox04"}]}
  },
  "Walking Wake": {
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<ul> <li>Walking Wake is one of the most dangerous sun wallbreakers in Ubers, capable of 2HKOing even the bulkiest of Water resists and special walls alike.</li> <li>Hydro Steam is Walking Wake's most spammable move; in sun, it 2HKOes Koraidon, OHKOes Flutter Mane, and 2HKOes Toxapex, making it very hard for teams to have a consistent switch-in to it.</li> <li>Dragon Pulse, albeit weaker than Draco Meteor, doesn't come with any drawbacks, making it a much better move to spam if lowering Walking Wake's Special Attack is not desired.</li> <li>Tera Water turns Walking Wake into an unwallable Pokemon, 2HKOing defensive walls like Blissey and OHKOing offensive pivots like Assault Vest Flutter Mane in sun. Tera Fairy can be used instead, as it gives Walking Wake useful resistances to Sucker Punch from Chien-Pao and Kingambit while also making it immune to Dragon-type attacks from Koraidon and Miraidon. Lastly, Tera Steel gives Walking Wake a resistance to Iron Bundle's Ice-type attacks, mainly Freeze Dry.</li> <li>A Modest nature lets Walking Wake wallbreak with extreme ease, allowing for Draco Meteor to 2HKO Clodsire in sun. Alternatively, a Timid nature gets the jump on Timid Chi-Yu and opposing Modest Walking Wake, although the difference in power is very noticeable.</li> <li>Walking Wake is best suited for offensive sun teams and should be used as such, making use of its unique typing to switch into Pokemon like Chi-Yu and counterattack with a nuclear Hydro Steam.</li> <li>Walking Wake is somewhat slow for Ubers standards, so fast partners like Choice Scarf Koraidon and Flutter Mane are a must to compensate for its Speed stat. Koraidon's sun also greatly powers up Walking Wake's attacks.</li> <li>Secondary wallbreakers such as Flutter Mane and Chi-Yu are also recommended, as Walking Wake's Speed hinders its performance as a standalone wallbreaker. Defensive teammates like Clodsire and Great Tusk are also helpful, as they check Miraidon, Flutter Mane, and Koraidon, respectively.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}]}], "writtenBy": [{"user_id": 306317, "username": "corvere"}]}
  }
}