{
  "Charizard": {
    "comments": "<h3>Other Options</h3> <p>Charizard has Dragon Dance and Swords Dance in its arsenal for setting up without sacrificing half of its HP, but Charizard's Attack isn't amazing without multiple boosts, so Charizard needs teams to be significantly worn down before it can sweep. Solar Power might make Charizard look appealing as a sun attacker, but sun is an unreliable team style, Charizard is worn down quickly by Stealth Rock and Solar Power, and it faces competition from Scovillain as a sun sweeper. All-out attacker Charizard can run Focus Blast for greater damage against Rock-types, Snorlax, and Dudunsparce, but Scorching Sands has reliable accuracy and lets Charizard fish for burns on these targets. Belly Drum Charizard can run Tera Ground to turn the tables on Rock-types and Electric-types, and the boost in power to Earthquake lets Charizard reliably OHKO Regirock, Rhydon, and Naclstack. Tera Dark on Belly Drum Charizard can protect Charizard from moves affected by Prankster coming from foes like Grafaiai and Sableye.</p> <h3>Checks and Counters</h3> <p><strong>Faster Revenge Killers</strong>: Jolteon requires little chip damage to revenge kill Charizard, and Choice Specs Jolteon can OHKO Charizard outright. Choice Scarf users like Qwilfish, Magneton, and Rotom also have super effective STAB moves to revenge kill Charizard with less chip damage, and they also gain momentum against it with their pivot moves. Grafaiai, Sneasel, and Mismagius are strong attackers faster than Charizard, but few revenge killers can switch into it safely or repeatedly. Floatzel is unique as a fast physical revenge killer that doesn't fear burns thanks to Water Veil.</p> <p><strong>Rock-types</strong>: Regirock and Rhydon are difficult for Charizard to break on its own, and both still threaten Charizard even when they're burned. Sturdy on Hisuian Avalugg can help it survive even a +6 Earthquake from Belly Drum Charizard and retaliate with a strong Mountain Gale or Rock Blast, but its low special bulk leaves it very vulnerable to all-out attacker Charizard. Naclstack is an excellent wall to all-out attacker Charizard thanks to Recover, Purifying Salt shielding it from burns, and great bulk with Eviolite, but Belly Drum Charizard can OHKO it with a +6 Earthquake.</p> <p><strong>Specially Bulky Pokemon</strong>: Snorlax and Dudunsparce can use all-out attacker Charizard as an opportunity to set up. Dudunsparce can remain healthy with Roost, and Snorlax doesn't mind damage or burns thanks to Rest. Muk dislikes burns but can take repeated hits from Charizard and wear it down with Poison Jab and Knock Off.</p> <p><strong>Bulky Water-types</strong>: Cramorant comfortably walls all-out attacker Charizard thanks to Roost. Lanturn only minds burns cutting into its passive recovery, and it can gain momentum from Charizard with Volt Switch or threaten to spread burns with Scald.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Charizard's high Speed, great Special Attack, and unique offensive and defensive typing make it a great all-out attacker, checking many common Grass-types like Whimsicott and Hisuian Decidueye. Charizard's Hurricane is one of its strongest attacks and has few common resistances. Flamethrower has more reliable accuracy than Hurricane, destroys Steel-types like Magneton and Orthworm that can otherwise handle Hurricane, and melts Ice-types like Frosmoth, Glastrier, and Sneasel. Scorching Sands covers Rock-types like Regirock and Rhydon, lets Charizard fish for burns, and is a more accurate move than Hurricane against foes like Typhlosion. Will-O-Wisp punishes physical attackers like Snorlax, Dudunsparce, and Regirock that would otherwise try to take advantage of Charizard. Tera Ground stops fast Electric-types like Jolteon and Choice Scarf Magneton from taking advantage of Charizard with Volt Switch and flips its major 4x Rock weakness into a resistance to better handle Sandaconda and Regirock. Offensively, Tera Ground gives Charizard great odds to 2HKO Lanturn and always 3HKO defensive Muk after Stealth Rock chip.</p> <p>Charizard appreciates pivots like Jolteon and Whimsicott bringing it in safely on Pokemon that check them like Orthworm and Magneton; Charizard also benefits from these teammates checking Water-types like Floatzel, Lanturn, and Clawitzer that it otherwise struggles with. Regirock is a great teammate for Charizard, as it can check special walls like Snorlax and Dunsparce for Charizard and is an even sturdier wall to the threats Charizard burns with Will-O-Wisp. Grass-type partners like Virizion, Hisuian Decidueye, and Dipplin cover Charizard's weaknesses and are complemented by Charizard handling Whimsicott. Charizard is a great check to Palossand, one of the toughest walls for Hisuian Sneasel and Toxicroak, so they benefit from having Charizard as a partner while they threaten one of Charizard's biggest checks in Regirock.</p>"
      },
      "Belly Drum": {
        "description": "<p>After a Belly Drum, Charizard becomes a deadly sweeper capable of OHKOing most Pokemon that don't resist Acrobatics. Even physical walls like Weezing and Palossand are KOed by +6 Acrobatics after Stealth Rock damage. Earthquake wrecks bulky Pokemon that resist Acrobatics like Magneton, and at +6, Charizard's Earthquake OHKOes even Regirock after Stealth Rock damage, Rhydon after Spikes damage, and Naclstack. Earthquake has a small perk of avoiding negative contact effects such as Rocky Helmet damage from Qwilfish. Flame Charge makes Charizard harder to revenge kill by fast Pokemon like Jolteon and Choice Scarf Rotom, and at +6, it is likely to OHKO Orthworm after Stealth Rock damage. Sitrus Berry restores some of Charizard's health given that Stealth Rock and Belly Drum both take 50% of its HP, and it easily allows Charizard to consume its item and maximize damage from Acrobatics. Tera Flying boosts Acrobatics, allowing Charizard to reliably OHKO physical walls like Sandaconda and Palossand and take neutral damage from Aqua Jet users like Qwilfish and Veluza that can revenge kill it.</p> <p>Belly Drum Charizard usually has just one chance to sweep, so it primarily features on hyper offensive teams built around fast-paced setup sweepers. Charizard benefits immensely from teammates that set entry hazards, enabling it to OHKO foes like Palossand, Rhydon, and Regirock, all of which could otherwise survive its onslaught; offensive teammates like Hisuian Avalugg and Primeape can reliably set Stealth Rock, and Qwilfish and Hisuian Qwilfish can set Spikes for Charizard. Sandslash is an excellent partner for Charizard, as it can set up hazards, remove hazards with Rapid Spin, and check Rock- and Electric-types for Charizard. Parting Shot users like Grafaiai and Alolan Persian can weaken foes and ease Charizard's time setting up. Memento users like Mismagius and Whimsicott can put Charizard in a good position to sweep by debuffing foes. Offensive pivots like Mesprit and Whimsicott can bring Charizard into favorable matchups against Pokemon they lure in like Orthworm and Articuno. Other physical attackers like Hisuian Decidueye, Glastrier, and Toxicroak can break holes in teams so that Charizard can clean up afterwards, and they all appreciate its great Speed and potential to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Sandslash": {"sets": {"Rapid Spin": {}, "Swords Dance": {}}},
  "Venomoth": {"outdated": true, "sets": {"Offensive Quiver Dance": {}, "Quiver Dance + Disable": {}}},
  "Dugtrio-Alola": {"outdated": true, "sets": {"Fast Attacker": {}}},
  "Persian-Alola": {"outdated": true, "sets": {"Defensive Pivot": {}, "Choice Scarf": {}, "Nasty Plot": {}}},
  "Primeape": {"outdated": true, "sets": {"Offensive Stealth Rock": {}, "Bulk Up": {}, "Suicide Lead": {}}},
  "Poliwrath": {"outdated": true, "sets": {"Bulk Up": {}}},
  "Victreebel": {"sets": {"Sun Sweeper": {}}},
  "Magneton": {"sets": {"Offensive Pivot": {}, "Choice Specs": {}, "Choice Scarf": {}}},
  "Dodrio": {"sets": {"Swords Dance": {}}},
  "Muk": {"outdated": true, "sets": {"Defensive": {}, "Assault Vest": {}}},
  "Exeggutor-Alola": {"sets": {"Choice Specs": {}, "Offensive Trick Room": {}, "Bulky Attacker": {}}},
  "Hitmonlee": {"sets": {"Swords Dance": {}}},
  "Hitmonchan": {"sets": {"Bulky Rapid Spin": {}, "Swords Dance": {}}},
  "Weezing": {"sets": {"Physical Wall": {}}},
  "Rhydon": {"sets": {"Bulky Stealth Rock": {}, "Swords Dance": {}}},
  "Tauros": {"outdated": true, "sets": {"All-Out Attacker": {}}},
  "Jolteon": {
    "overview": "<p>With Speed only eclipsed by Hisuian Electrode backed up with good power, Jolteon establishes itself as a premier fast pivot. Its fast Volt Switch makes it an easy candidate on VoltTurn teams, and its adequate coverage with Alluring Voice and Shadow Ball discourages specially bulky Pokemon like Virizion and Mesprit from switching into it. Jolteon's decent set variety means it can be a deadly Calm Mind sweeper or a dangerous wallbreaker with Choice Specs. Jolteon's defensive utility with Volt Absorb and passable special bulk also makes it a situational switch-in to special attackers like Articuno, Cramorant, and Rotom. However, the lacking power of its coverage moves causes it to struggle quite hard against specially defensive Pokemon like Snorlax and Dudunsparce as well as Ground-types like Rhydon. Said Ground-types make Jolteon quite reliant on Terastalization to bypass its checks, which causes it to demand for more team support. Jolteon also faces competition from Hisuian Electrode, which boasts higher Speed and an additional Grass subtyping that allow it to beat Ground-types instead of being walled by them.</p>",
    "comments": "<h3>Other Options</h3> <p>On Choice Specs sets, Tera Blast Water can be used as a coverage move to drench Ground-types like Sandaconda and Sandslash. Tera Blast Ice and Tera Blast Fire both threaten Jolteon's Grass-type checks, with the former even targeting Ground-types. However, slotting Tera Blast makes Jolteon more reliant on team support to weaken its checks, and Terastalizing Jolteon into an Ice- or Fire-type requires entry hazard removal. Jolteon still gets walled by Grass-types if running Tera Blast Water. Tera Blast Flying allows Jolteon to beat Hisuian Electrode and gives it an immunity to Ground-type moves, though it once again demands hazard removal.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Specially defensive Pokemon like Snorlax and Regirock are not particularly bothered by even Choice Specs Jolteon, as they have the bulk to weather repeated hits and can threaten huge damage on it back with their respective STAB moves.</p> <p><strong>Ground-types</strong>: Specially bulky Ground-types like Toedscool and Rhydon are Jolteon's biggest obstacles, preventing it from pivoting and threatening to OHKO it with their STAB moves. They can proceed to set up Stealth Rock against it, with the latter even using it setup fodder. However, Ground-types that have mediocre special bulk like Sandaconda, Sandslash, and Palossand, must be wary of Jolteon's Choice Specs-boosted coverage.</p> <p><strong>Grass-types</strong>: Shaymin's excellent natural bulk and Hisuian Electrode's resistances to Jolteon's entire moveset bar Shadow Ball make them the two most reliable Grass-type switch-ins, with both able to threaten it back with their own STAB moves. Other Grass-types like Hisuian Decidueye, Alolan Exeggutor, and Virizion are similarly effective but must watch out for coverage options.</p> <p><strong>Revenge Killers</strong>: Despite being the second fastest unboosted Pokemon in the metagame, Jolteon has mediocre longevity and can get picked off easily by faster Choice Scarf users like Bruxish, Passimian, and Mesprit without too much trouble; the aformentioned Hisuian Electrode can even pick off Jolteon without using a Choice Scarf. All of these Pokemon can also pivot on it in return, causing Jolteon's teammates to lose momentum. Slower cleaners or wallbreakers with priority moves like Sneasel and offensive Hisuian Decidueye can exploit Jolteon's low physical bulk without too much prior damage.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>After one Calm Mind boost, Jolteon's Thunderbolt 2HKOes unboosted Orthworm. Volt Switch maintains momentum and allows it to escape bad matchups like Snorlax, Regirock, and Virizion. Jolteon's fourth moveslot is flexible and can depend on the team's need for coverage. Alluring Voice discourages certain Grass-types like Virizion and Hisuian Decidueye from switching in and also targets Dragon-types like Dipplin and Alolan Exeggutor that would be comfortable switching into its Electric-type STAB moves. It also hits Tera Dragon users like Sandaconda and Regirock, walls that would otherwise switch into Jolteon without too much trouble. Shadow Ball hits Psychic-types like Uxie and Mesprit harder than any of its STAB moves do while also hitting Ghost-types like Palossand and Mismagius quite hard. While Jolteon's Tera type is flexible, Tera Blast Ice synergizes the best when striking back at its overall checks, hitting Ground-types like Sandaconda and Rhydon and Dragon-types like Alolan Exeggutor and Dipplin. However, this comes at the cost of using up the Terastallization slot. Tera Fairy and Tera Ghost, on the other hand, strengthen Alluring Voice and Shadow Ball, respectively, and make Jolteon slightly better at taking Fighting-type attacks from Pokemon like Passimian and Virizion. Volt Absorb allows Jolteon to switch in against predicted Electric-type attacks from Pokemon like Rotom and opposing Jolteon.</p> <p>Jolteon's blistering Speed makes it a prime candidate for VoltTurn teams, pairing well with pivots like Mesprit, Passimian, and Hisuian Decidueye. In addition to pivoting, they all can provide utility with Knock Off. Knock Off support works especially well with Jolteon, as its Volt Switch is able to put more pressure on Pokemon reliant on items like Leftovers and Heavy-Duty Boots for longevity, such as walls like Snorlax and Hisuian Decidueye. Wallbreakers like Bruxish and Glastrier benefit from Jolteon's Volt Switch and can capitalize on its checks. Grass- and Water-types like Shaymin, Virizion, Qwilfish, and Poliwrath can switch in and force out the Ground-types Jolteon struggles against and delay its need to Terastallize. Similarly, checks to Grass-types like Qwilfish formes and Articuno can similarly benefit Jolteon either through entry hazard and status support or through pivoting, respectively, allowing it to Terastallize as a later time. Hisuian Electrode stands out as Jolteon's worst matchup, possessing a quadruple resistance to Jolteon's STAB moves, higher Speed, and an immunity to Alluring Voice; checks to Hisuian Electrode like Hisuian Decidueye and Alolan Exegutor can blank its Volt Switch and threaten the opposition with their powerful STAB moves. Deterrents to Snorlax like Regirock and Toxicroak are valuable for pressuring it to Terastalize sooner, which can be exploited by teammates like Qwilfish formes and Hisuian Sneasel.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs boosts Jolteon's decent power to more threatening levels while still leveraging its excellent Speed. Volt Switch allows Jolteon to escape from walls like Snorlax and Regirock and maintain momentum for its team. Alluring Voice and Shadow Ball are Jolteon's strongest options for coverage against Ground-type foes; the former strikes at Fighting- and Dragon-types like Virizion and Alolan Exeggutor, while the latter pressures Ghost-types like Palossand and Rotom. Despite Jolteon's frailty, Volt Absorb gives it limited defensive utility by making it a situational switch-in against Electric-types like Rotom, opposing Jolteon, and Hisuian Electrode.</p> <p>While Choice Specs's enhanced power makes Jolteon more threatening as a pivot, it still struggles to tackle Ground- and Grass-types. Water- and Grass-types like Bruxish, Clawitzer, Virizion, and Hisuian Decidueye are great candidates to threaten these walls. Jolteon can form VoltTurn cores with fellow pivots like Passimian, Qwilfish formes, and Grafaiai, keeping momentum while threatening Jolteon's checks like Snorlax and Alolan Exeggutor. Water-types like Bruxish and Clawitzer pair excellently with Jolteon, threatening out Ground-types like Rhydon and Palossand that intend to block Jolteon's Volt Switch while maintaining a VoltTurn core. Similarly, checks to Grass-types like Charizard and Hisuian Sneasel can take advantage of Jolteon's Volt Switch and threaten heavy damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528485, "username": "DerpySuX"}]}]}
  },
  "Snorlax": {
    "overview": "<p>Continuing its dramatic fall from grace from the higher tiers, Snorlax now establishes itself as a dominant force in ZU with its Curse sets. Thanks to its overall outstanding bulk and offensive versatility, Snorlax is quite difficult to stop once it gets stat boosts, even when factoring in Rest turns. Snorlax isn't just limited to late-game cleaning, either — it can also use said bulk and Thick Fat to function as a reliable sponge to common special attackers like the Oricorio formes, Jolteon, and Typhlosion while also being a good paralysis spreader with Body Slam. Walls comfortable switching into Body Slam also have to be aware of Heat Crash, limiting the consistency of its switch-ins. However, its low Speed and reliance on Rest or Protect for recovery make it quite easy to pressure it into passivity and cost momentum for its team. Snorlax's lack of resistances also makes it easy for Fighting-types like Virizion and Passimian to pressure it to Terastallize earlier than expected, which forces careful play to ensure a successful sweep.</p>",
    "comments": "<h3>Other Options</h3> <p>Snorlax's coverage move is quite flexible -— Crunch hits Ghost-types like Palossand and Drifblim harder, while Heavy Slam more heavily pressures Tera Fairy setup sweepers like Mesprit and Dudunsparce. However, Crunch is usually noticeably weaker compared to Heat Crash, and Heavy Slam worsens its matchup against Steel-types and Tera Steel Pokemon and is still walled by Rock-types. Sleep Talk over Curse makes Snorlax more consistent as a special wall at the cost of its late-game potential. Heavy-Duty Boots is a notable alternative to Leftovers, allowing Snorlax to fare better against entry hazards and easing the need for hazard removal. However, Snorlax usually appreciates the passive recovery from Leftovers better. Offensive sets like Choice Band are usable to surprise the opposition but are held back by Snorlax's low Speed and giving up quite a lot of its bulk.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Rock-types like Hisuian Avalugg, Regirock, and Rhydon are not particularly bothered by even a boosted Snorlax and can set up Stealth Rock or pressure it with repeated uses of Body Press, with the latter two even using it as setup fodder.</p> <p><strong>Fighting-types and Fighting-type Coverage</strong>: Fighting-types like Hisuian Decidueye, Virizion, and Passimian can threaten huge damage on Snorlax with their Fighting-type STAB moves, though none of them particularly enjoy it Terastallizing to Fairy. Toxicroak can even threaten Snorlax even when the latter Terastallizes with its Poison-type STAB moves. Pokemon with Fighting-type coverage like Clawitzer, Glasterier, and Braviary can also pressure it into Terastallizing sooner than expected.</p> <p><strong>Strong Wallbreakers</strong>: Strong physical wallbreakers like Glastrier, Dodrio, and Braviary can strike at Snorlax's initially lower physical bulk and cause it to use Rest sooner than expected.</p> <p><strong>Coil Sweepers</strong>: Coil sweepers like Orthworm and Dudunsparce can consistently keep up and eventually overpower Snorlax with their Steel typing and Dragon Tail, respectively, though the latter would need to PP stall a Terastallized Snorlax to win. While Sandaconda cannot outright beat Snorlax without critical hits, it can outlast Snorlax by PP stalling and can brush off status with Shed Skin.</p> <p><strong>Item Removal</strong>: Snorlax's Leftovers is an essential part for it to wall and sweep teams; Knock Off users like Grafaiai, Mesprit, and Dodrio endanger its chances of sweeping and follow up with strong STAB moves in their arsenals. Trick and Switcheroo users like Whimsicott, Grafaiai, and Mismagius can outright neuter Snorlax's sweeping potential with a Choice item, forcing it out.</p> <p><strong>Residual Damage</strong>: Snorlax hates taking residual damage, with common entry hazard setters like Orthworm, Qwilfish, and Sandaconda making it more difficult for Snorlax to sweep; the latter two can also rack up additional chip damage with Rocky Helmet. Status like burn and poison also forces Snorlax to use Rest, causing it to become more passive. Snorlax also can quickly get worn down by VoltTurn users like Mesprit, Whimsicott, and Jolteon as a switch-in to them, risking losing momentum against them.</p>",
    "sets": {
      "CurseLax": {
        "description": "<p>STAB Body Slam not only functions as Snorlax's primary attacking move but also threatens incoming switch-ins like Qwilfish formes and Hisuian Decidueye with the chance of paralysis. Heat Crash is a powerful coverage move that hits both Ghost-types like Rotom, Mismagius, and Oricorio-G that would freely switch into Body Slam and Tera Steel users like Hisuian Decidueye. Rest fully restores Snorlax's health and removes existing status conditions at the expense of making it passive for two turns. Alternatively, Protect scouts for Choice-locked foes like Passimian and Rotom and racks up additional Leftovers recovery at the cost of being unable to remove status. Tera Fairy turns its Fighting weakness into a resistance and provides an immunity to Dragon-type moves from foes like Dipplin and Alolan Exeggutor. Tera Fairy Snorlax also benefits from Poison- and Steel-type moves being uncommon. Thick Fat strengthens its defensive profile by making it a consistent switch-in to Fire- and Ice-types like Typhlosion, Charizard, and Frosmoth.</p> <p>Snorlax excels mid- or late-game as a setup sweeper that can take advantage of Fighting-types and wallbreakers being worn down. Physical walls like Qwilfish, Hisuian Decidueye, and Sandaconda shore up Snorlax's lower physical bulk and can provide entry hazards to wear down switch-ins like opposing Qwilfish and Dudunsparce; they are also excellent as Knock Off absorbers to preserve Snorlax's Leftovers. Choice item wallbreakers like Whimsicott and Jolteon can simulataneously provide wallbreaking and pivoting support for Snorlax to enter the field safely; they can help discourage physical walls like Palossand and Qwilfish formes from freely switching in. Poison-types like Qwilfish and Weezing can help with Snorlax's weakness to Fighting-types and provide additional utility. Rock-types like Regirock, Rhydon, and Hisuian Avalugg can easily ward off anything Snorlax can do, so checks to them like Virizion, Hisuian Decidueye, and Weezing are helpful to consistently force them out. Palossand stands out, as it can not only check the aformentioned Rock-types but also Fighting-types thanks to its excellent bulk and typing. Due to Snorlax's utility as a special wall and susceptibility to residual damage, Defoggers like Hisuian Decidueye and Cramorant are critical in preventing Snorlax from being worn down by hazards; the lack of hazards make it far more consistent walling foes and sweeping throughout a game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Articuno": {"sets": {"Special Wall": {}}},
  "Typhlosion": {
    "overview": "<p>Choice Specs Typhlosion is an insanely powerful special attacker in a tier without much in the way of sturdy Fire-resistant Pokemon. Much of its power comes from its move Eruption, which has unparalleled strength with Typhlosion at full health and can OHKO most neutral targets such as Mesprit and Passimian. With Typhlosion's Speed tier, it outspeeds much of the unboosted metagame, meaning that it can frequently come in and pick up KOs. However, Choice Specs Typhlosion struggles against faster Pokemon such as Grafaiai and Choice Scarf users like Passimian that can damage it before it moves and limit its power; it's also checked by the few Pokemon that can take on its Eruption reliably such as Snorlax and Cramorant, necessitating a team to have good answers to them such as Regirock and Articuno, respectively. On the other hand, the Choice Scarf set misses some OHKOs such as against Mesprit and Palossand, but it outspeeds common Choice Scarf users like Rotom and Passimian and fast attackers like Sneasel and Jolteon. Typhlosion's Eruption is limited by Stealth Rock as well as other damaging entry hazards, meaning it requires hazard removal support from the likes of Cramorant and Hisuian Decidueye.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Eruption is Typhlosion main STAB attack, dealing insane damage at full health, even being able to 2HKO Fire-resistant Pokemon like Regirock and Appletun with the help of Tera Fire. Fire Blast and Flamethrower are to be used when Typhlosion gets weakened; both options are valid and come down to personal preference between power and accuracy. Fire Blast namely gives better odds to OHKO threats such as Sandslash and Passimian. Focus Blast gives Typhlosion a chance to 2HKO Snorlax, which can easily take Fire-type attacks, as well as being its strongest move against Rock-types like Regirock and Rhydon. Scorching Sands targets Fire-types such as opposing Typhlosion and Pyroar as well as some bulky Water-types like Lanturn and Qwilfish, and it is a more accurate option to threaten Rock-types. Flash Fire lets Typhlosion switch into powerful Fire-type attacks without losing power on Eruption, but this leaves it vulnerable to Trace Porygon2. Blaze boosts Typhlosion's secondary Fire-type STAB attack to insane levels in late-game scenarios, becoming about as strong as full-power Eruption.</p> <p>As a powerful wallbreaker, Typhlosion naturally benefits special cleaners such as Jolteon and Oricorio-G that appreciate special walls getting weakened. If opting for Flash Fire, its immunity to Fire-type moves makes it a great teammate for Fire-weak Pokemon such as Glastrier and Hisuian Decidueye. Typhlosion appreciates VoltTurn support that can force in walls to get nuked by it, such as Articuno, Lanturn, Qwilfish, and Mesprit as well as the aforementioned Jolteon and Hisuian Decidueye. Typhlosion has trouble breaking through Fire-resistant Pokemon, including Snorlax, Cramorant, and Appletun, which makes counters to these threats such as Orthworm and Articuno attractive. Entry hazard removal is also appreciated from Pokemon such as Sandslash and Hitmonlee to keep Typhlosion at full health as long as possible. Healing Wish Pokemon like Shaymin and Mesprit can give Typhlosion a second chance at full health Eruptions later in the match. Defensive pivots that can take on revenge killers such as Choice Scarf Passimian and Floatzel, like Palossand and Qwilfish, respectively, make for great partners.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 648292, "username": "budgetplayer"}, {"user_id": 369076, "username": "Tuthur"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Lanturn": {"sets": {"Defensive Pivot": {}}},
  "Bellossom": {"outdated": true, "sets": {"Bulky Quiver Dance": {}}},
  "Qwilfish": {
    "comments": "<h3>Other Options</h3> <p>Qwilfish can Terastallize into a Ghost-type to block Rapid Spin attempts, but this makes it significantly weaker against Pokémon like Oricorio-G and Hisuian Qwilfish. Defensive Qwilfish sets can run Leftovers to heal gradually throughout a game, but this recovery is often mitigated by having to switch into entry hazards multiple times per game. Qwilfish can strengthen its offensive potential by equipping a Choice Band, unleashing strong Aqua Jets and Flip Turns while still switching into a variety of physical attacks.</p> <h3>Checks and Counters</h3> <p><strong>Psychic-types</strong>: Strong Psychic-type attackers in ZU, including Mesprit, Veluza, and Indeedee-F, can threaten to outspeed and knock out Qwilfish. While these Pokemon don't love switching in against Qwilfish, they can afford to take a hit and deal massive damage in return.</p> <p><strong>Electric-types</strong>: Although their low bulk makes them struggle to switch into Qwilfish's attacks, Electric-type pivots like Rotom and Morpeko can outspeed and threaten an OHKO on Qwilfish. This can sometimes force opponents to use Terastallization on Qwilfish, limiting their offensive resources late-game. There additionally are Electric-type attackers with strong defensive profiles, such as Magneton and Vikavolt, that can switch into Qwilfish effectively.</p> <p><strong>Ground-types and Ground-type coverage</strong>: Qwilfish's Water-type STAB attacks may threaten out many Ground-types, but strong Ground-type attackers like Sandaconda, Palossand, and Sandslash can retaliate with super effective damage of their own. Many wallbreakers also pack Ground-type attacks that can heavily chip a Qwilfish looking to switch in, including Passimian, Glastrier, and Charizard.</p> <p><strong>Special Attackers</strong>: Due to its lack of Special Defense, Qwilfish struggles to handle hits from special wallbreakers like Rotom, Mismagius, and Clawitzer. On the other hand, setup sweepers like Oricorio-G, Frosmoth, and Dudunsparce can set up in its face, although they don't enjoy getting poisoned.</p> <p><strong>Entry Hazards</strong>: While Qwilfish can feel like a defensive stalwart, its lack of reliable recovery makes it especially prone to Stealth Rock and Spikes. If setters like Palossand, Orthworm, and Regirock can keep hazards on the field, Qwilfish can later get overwhelmed by wallbreakers it would normally check efficiently.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>As a result of its defensive profile synergizing well with its threatening attacks and serviceable Speed tier, Qwilfish is an incredibly versatile Choice Scarf user that can surprise opponents expecting a defensive set. Choice Scarf Qwilfish provides both offensive and defensive value, revenge killing weakened foes while using Intimidate to switch into attackers in a pinch. Gunk Shot sets Qwilfish apart from other Water-type attackers, letting it dismantle Grass-types like Hisuian Decidueye, Alolan Exeggutor, and Virizion. Liquidation is a similarly powerful STAB attack that helps it revenge kill weakened foes like Grafaiai and Sneasel. Flip Turn lets Qwilfish quickly pivot into a partner that can better handle walls like Orthworm and Weezing that switch into it. These forced switches also provide Qwilfish with the opportunity to lay down Spikes, allowing it to bluff a defensive set on certain occasions only for it to surprise the opponent with a revenge kill later on in the game. Barb Barrage is an alternative fourth move, being a more reliably accurate Poison-type attack that can also poison and thus wear down switch-ins like Regirock and Poliwrath. Lastly, Destiny Bond trades KOs with boosted threats like Braviary and Glastrier to prevent sweeps.</p> <p>Offense teams that need a combination of an offensive and defensive presence love the versatility provided by Qwilfish. Being able to finish off weakened Pokemon synergizes well with wallbreakers that specialize in dealing heavier damage, including Whimsicott, Magneton, and Glastrier. Finishing off foes assists setup sweepers like Oricorio-G, Frosmoth, and Virizion. Qwilfish's defensive utility means that it can still switch into wallbreakers like Hisuian Decidueye and can support extremely frail pivots like Jolteon, Rotom, and Grafaiai. While it primarily focuses on revenge killing, Qwilfish's pivoting with Flip Turn can result in lots of chip damage in tandem with entry hazards set up by Orthworm, Sandslash, or Mesprit. The latter two Pokemon, alongside other Knock Off users like Sneasel and Passimian, can remove Heavy-Duty Boots to ensure hazards help chip down foes. More defensively oriented teams also feature walls like Articuno and Snorlax that greatly appreciate Flip Turn switching them in. Ghost-types like Palossand and Sableye can block Rapid Spin and wall Toxicroak, one of Qwilfish's prominent checks.</p>"
      },
      "Swords Dance": {
        "description": "<p>Despite competition from other Swords Dance users in the tier, Qwilfish can still consistently set up to sweep thanks to its defensive typing and access to Intimidate. Qwilfish can turn the tables on would-be checks like Orthworm and Regirock by setting up Swords Dance in front of them. Liquidation and Gunk Shot are two powerful STAB moves that take out walls like Sandaconda, Snorlax, and Dipplin. Aqua Jet allows it to get the jump on faster foes like Sneasel, Jolteon, and Charizard, typically grabbing a KO after a boost and enough chip damage. This also makes Qwilfish an apt revenge killer, with Tera Water making Aqua Jet even stronger after a Swords Dance boost. Leftovers supports Qwilfish on top of its already great ability and typing, granting it significantly more staying power than other setup sweepers.</p> <p>Swords Dance Qwilfish provides a bulky dynamic to offensive teams looking to overwhelm foes with a variety of strong attacks. Pivots like Articuno, Mesprit, and Rotom can effectively bring in Qwilfish while also chipping walls like Regirock and Dudunsparce. Other wallbreakers like Toxicroak, Grafaiai, and Whimsicott can chip down the opposing team. to make its sweep easier. A more aggressive team with several sweepers like Virizion, Sneasel, and Frosmoth can let Qwilfish help overwhelm opposing teams. More balanced teams can also effectively use Swords Dance Qwilfish as a way to surprise opponents expecting a more defensive set. Since Qwilfish is purely invested in its offense, it's still important to support Qwilfish with a strong defensive backbone including walls such as Snorlax, Hisuian Decidueye, and Sandslash. Entry hazard setters like Sandaconda, Palossand, and Orthworm also chip down foes over the course of a longer game, possibly giving Qwilfish the chance to OHKO Snorlax after a boost.</p>"
      },
      "Defensive Pivot": {
        "description": "<p>As one of the most splashable Pokemon in ZU, Qwilfish threatens to deter physical wallbreakers with Intimidate, making it a premier Spikes setter with the longevity to set multiple layers up. Furthermore, by Terastallizing into a Ground-type, Qwilfish can surprise Electric-type foes, including Rotom and Jolteon. Flip Turn hits prominent Pokemon like Sandaconda, Oricorio, and Rhydon for super effective damage while allowing a teammate to switch in. Barb Barrage may hit Pokemon such as Hisuian Decidueye and Virizion for super effective damage, but switch-ins also dislike this move due to the poison chance. It can run a variety of moves for its fourth moveslot, but Taunt's capability of shutting down utility moves such as Recover and Defog make it the most preferable. Nevertheless, Pain Split is a valid alternative if one wants a semi-recovery option to increase its longevity, which is especially valuable against foes with high HP like Snorlax and Dudunsparce. Toxic and Thunder Wave are also good options to more reliably inflict status. Rocky Helmet's chip damage makes Qwilfish a fantastic punisher of spammable contact moves like U-turn and Knock Off, but Heavy-Duty Boots greatly helps Qwilfish's longevity.</p> <p>Qwilfish's versatility makes it a seamless fit onto many team styles, but balance and bulky offense teams especially love its entry hazard setting and defensive pivoting. By chipping down foes with its STAB combination while laying down layers of Spikes, late-game cleaners like Passimian and Mesprit can more easily take down worn out opponents. These threats also boast the ability to pivot, creating VoltTurn cores that bolster offensive pressure. By pivoting with Flip Turn, Qwilfish can safely bring in frail attackers like Jolteon, Dodrio, and Typhlosion, which can all wreak havoc when they're given the chance to enter the field healthy. Ghost-types like Oricorio-G and Mismagius are especially nice partners, since they provide an immunity to Rapid Spin to keep Spikes on the field. Grass-types like Hisuian Decidueye, Virizion, and Whimsicott also provide type synergy with Qwilfish, as their offensive and defensive strengths are bolstered by Qwilfish's overall utility. Qwilfish's defensive profile also makes life easier for bulky partners like Snorlax and Articuno, as Qwilfish can switch into threatening Fighting-types like Passimian, Hisuian Decidueye, and Hitmonchan. In return, those walls can more easily take on the special attacks that may scare Qwilfish out. Other defensive Pokemon like Sandaconda and Palossand can reinforce a team's physical backbone while also being immune to Volt Switch users that threaten to OHKO Qwilfish.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528055, "username": "viet noa"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 594256, "username": "GraveBee"}, {"user_id": 649096, "username": "a blue banana"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Qwilfish-Hisui": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Hisuian Qwilfish's Eviolite-boosted bulk, Intimidate, and great typing make it an amazing defensive utility Pokemon. Thanks to its typing, Hisuian Qwilfish can check specially offensive setup sweepers like Mesprit, Farigiraf, and Mismagius thanks to its immunity to Stored Power and lack of weaknesses to common special coverage moves like Draining Kiss and Dazzling Gleam. Barb Barrage is a great STAB move for Hisuian Qwilfish, as it wears down Pokemon with its high chance to poison and powers up when its targets are poisoned, and walls like Regirock and Palossand do not appreciate being poisoned. Barb Barrage is great against the Grass-types Hisuian Qwilfish checks, such as Hisuian Decidueye, Virizion, and Dipplin, as well as Fairy-type Pokemon like Whimsicott and Tera Fairy Mesprit and Mismagius. Crunch is a stronger STAB move for foes that aren't yet poisoned and has great coverage against other specially offensive threats like Mesprit, Oricorio-G, and Mismagius. Hisuian Qwilfish's excellent defensive profile gives it plenty of opportunities to set up Spikes as it threatens out Grafaiai, Mesprit, and Dipplin and pressures the most common hazard remover: Hisuian Decidueye. Toxic more reliably statuses foes compared to Barb Barrage, and Toxic poison is deadlier to walls like Dudunsparce, Regirock, and Palossand. Taunt lets Hisuian Qwilfish shut down opposing defensive Pokemon like Dudunsparce, Orthworm, and Weezing to prevent them from recovering or supporting their teams. Haze removes boosts from specially offensive setup sweepers that Hisuian Qwilfish checks, such as Mesprit, Farigiraf, and Virizion. Intimidate lets Hisuian Qwilfish work as a stopgap to physical attackers like Grafaiai, Swords Dance Virizion, and Swords Dance Qwilfish. Tera Dragon lends Hisuian Qwilfish new resistances to Electric, Fire, and Water to make it a better check to special attackers like Typhlosion, Jolteon, and Cramorant.</p> <p>Hisuian Qwilfish fits on bulky offensive teams looking to compress a solid defensive backbone and entry hazard setter into one slot. Offensive Pokemon like Typhlosion, Charizard, and Jolteon are great beneficiaries of Spikes set by Hisuian Qwilfish, as common checks to them like Snorlax and Regirock are prone to being overwhelmed by residual damage. Roar Articuno and Dragon Tail Dipplin and Dudunsparce can put Spikes set by Hisuian Qwilfish to good use by quickly racking up residual damage. Sandslash's Earthquake and Rapid Spin are very threatening to Hisuian Qwilfish, so good checks to Sandslash like Hisuian Decidueye, Dipplin, and Orthworm help Hisuian Qwilfish, and Palossand can spinblock for Hisuian Qwilfish as a bonus. Grass-types in particular, such as Whimsicott, Virizion, and Shaymin, make great partners for Hisuian Qwilfish by covering its sole weakness to Ground. Hisuian Qwilfish can struggle against specially offensive foes like Jolteon, Typhlosion, and Charizard, so special walls like Snorlax, Regirock, and Dudunsparce can help deal with these foes while appreciating the residual damage that Hisuian Qwilfish spreads. Several physical attackers like Hisuian Decidueye and Sneasel ignore Intimidate while others like Passimian and Braviary can benefit from it, so physical sponges like Dipplin, Regirock, Palossand, and Sandaconda cover these foes for Hisuian Qwilfish. Teammates such as Passimian, Hisuian Decidueye, and Regirock appreciate Hisuian Qwilfish for checking special attackers like Mesprit, Mismagius, and Farigiraf for them.</p>"
      },
      "Swords Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 643347, "username": "marillvibes"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Sneasel": {"outdated": true, "sets": {"Fast Attacker": {}, "Choice Band": {}}},
  "Sneasel-Hisui": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Piloswine": {"outdated": true, "sets": {"Stealth Rock": {}, "Choice Band": {}}},
  "Porygon2": {"sets": {"Specially Defensive": {}}},
  "Smeargle": {"sets": {"Suicide Lead": {}}},
  "Sceptile": {"sets": {"Choice Specs": {}, "Swords Dance": {}}},
  "Medicham": {"outdated": true, "sets": {"Choice Scarf": {}, "Choice Band": {}, "All-Out Attacker": {}}},
  "Whiscash": {"outdated": true, "sets": {"Wall": {}}},
  "Regirock": {
    "comments": "<h3>Other Options</h3> <p>On paper, Sturdy gives a healthy Regirock a guaranteed turn to set up Stealth Rock, but between Regirock being so bulky and entry hazards being ubiquitous, it's unlikely that Regirock would be at risk of being OHKOed from full HP outside of uncommonly strong hits like Clawitzer's Water Pulse or Alolan Exeggutor's Leaf Storm. Regirock is totally dependent on the passive recovery from Leftovers to be a reliable wall, so even items like Heavy-Duty Boots and Rocky Helmet are suboptimal. Stone Edge is generally stronger than Rock Blast but has unreliable accuracy and poor PP, and it and Rock Slide cannot break past Substitute Pokemon. Curse can be used as a setup move over Iron Defense to power up Regirock's Rock Blast, but the extra Defense from Iron Defense is more useful to stonewall physical attackers, and Regirock's Body Press is more powerful and reliable than its STAB move anyway. Protect can enhance Regirock's recovery from Leftovers and allow Regirock to scout common Choice item attackers like Jolteon, Whimsicott, and Floatzel but it makes Regirock much more passive. Tera Ghost lets Regirock become immune to Fighting-type moves from major offensive threats like Hitmonlee, Toxicroak, and Passimian while preserving Regirock's ability to check Snorlax and enabling it to block Rapid Spin from Sandslash and Toedscruel. Tera Grass helps Regirock manage its common Grass, Water, and Ground weaknesses, whereas Tera Water lets Regirock better handle Glastrier, and Tera Steel shares Tera Poison's poison immunity and Grass resistance while giving Regirock an easier time against Mesprit and Farigiraf. Regirock can run a Careful nature to patch up its relatively lower special bulk, but Regirock is often tasked with taking on physical attackers, and more Defense investment benefits its IronPress combination.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Palossand counters Regirock and uses it as an opportunity to set up Stealth Rock, recover with Shore Up, or threaten Regirock and its teammates with burns from Scorching Sands. Sandaconda has great longevity, while Sandslash and Toedscruel can remove Regirock's entry hazards with Rapid Spin, but all three must be wary of Regirock boosting too much with Iron Defense.</p> <p><strong>Special Attackers</strong>: Regirock's lower special bulk leaves it prone to being overwhelmed by special attackers like Mesprit, Jolteon, and Rotom. Magneton can hit Regirock super effectively with its STAB Flash Cannon. However, most special attackers are physically frail, and Magneton takes a lot of damage from Regirock's Body Press. Many special attackers also cannot KO Regirock without significant chip or several boosts.</p> <p><strong>Fighting-types</strong>: Regirock's Fighting weakness can lead it to fall victim to Fighting-types like Hitmonlee, Passimian, and Hisuian Decidueye, the last of which can remove Regirock's Stealth Rock. However, Regirock can turn the tables on physically offensive Fighting-types with its IronPress combination and Terastallization. Specially offensive variants of Toxicroak and Virizion further exploit Regirock's lower Special Defense and circumvent Iron Defense boosts.</p> <p><strong>Grass-types</strong>: Whimsicott, Hisuian Electrode, and Sceptile can blow through Regirock with their strong super effective STAB moves, and Whimsicott is distinguished for avoiding a 2HKO from Regirock's Body Press after Stealth Rock. Alolan Exeggutor annihilates Regirock, while Dipplin can phaze Regirock with Dragon Tail and use Recover to wall it back.</p> <p><strong>Water-types</strong>: Swords Dance Qwilfish and Veluza both Body Press and can rely on their Water-type STAB moves to break through Regirock. Clawitzer can OHKO Regirock with Water Pulse but cannot switch into Regirock's Body Press more than once with Stealth Rock up.</p> <p><strong>Knock Off, Trick, and Switcheroo</strong>: Regirock relies on its Leftovers for recovery, so Knock Off users like Sneasel, Mesprit, and Grafaiai are disruptive to Regirock. Mespirit and Hisuian Sneasel can use Trick and Switcheroo to disrupt Regirock by giving it their Choice items.</p> <p><strong>Residual damage</strong>: Burns and poison neutralize Regirock's already limited passive recovery. Burns from Will-O-Wisp users like Weezing and Rotom halve Regirock's damage output, while Toxic from Hisuian Qwilfish, Dudunsparce, and Toedscruel puts Regirock on a timer. Entry hazards like Stealth Rock and Spikes cause Regirock to struggle to stay healthy.</p> <p><strong>Taunt and Encore</strong>: Encore users like Whimsicott and Grafaiai can lock Regirock into a move to exploit it though neither enjoy taking Body Press. Qwilfish and Primeape can use Taunt to stop Regirock from setting up Stealth Rock or Iron Defense. Sableye can run Taunt or Encore and does not fear Regirock's Body Press.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Thanks to its titanic Defense, Regirock can stonewall popular physical attackers like Snorlax and Dudunsparce and use them as an opportunity to set up Stealth Rock. Rock Blast deals reliable damage to Typhlosion, Oricorio-G, and Charizard and breaks Substitute on users like Frosmoth and Rotom. Body Press crushes Normal-types like Snorlax and Dudunsparce, Ice-types like Glastrier and Sneasel, and Steel-types like Orthworm and Magneton. Iron Defense boosts Regirock's physical bulk and powers up Body Press, turning Regirock into a bulky setup sweeper capable of suffocating physical attackers like Snorlax and overwhelming walls like Sandaconda. Thunder Wave slows down setup sweepers like Hitmonlee and fast Pokemon like Whimsicott but makes Regirock more passive. Clear Body helpfully denies stat debuffs from Intimidate, Shadow Ball, and Triple Arrows. 16 Defense EVs and an Impish nature is a useful jump point to balance Regirock's bulk. Tera Poison helps with Regirock's Grass and Fighting weaknesses and gives it an immunity to poison.</p> <p>Regirock fits best on teams looking for a physically defensive backbone that can set up Stealth Rock. While Regirock has great physical bulk, its typing and comparatively lesser special bulk leave it more prone to strong special attacks. Specially defensive partners like Snorlax, Articuno, and Hisuian Qwilfish complement Regirock's physical bulk and can intercept special attackers like Hisuian Electrode, Whimsicott, and Mesprit. Hisuian Decidueye and Toedscruel can form entry hazard cores with Regirock and help keep it from taking entry hazard chip damage. Other Grass-type partners like Alolan Exeggutor, Dipplin, and Virizion are also appreciated by Regirock, as they can cover its Ground, Grass, and Water weaknesses by taking on Sandslash, opposing Dipplin, and Clawitzer, while Regirock can take on threatening Flying-types like Oricorio-G and Articuno.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Floatzel": {"sets": {"Choice Band": {}, "Bulk Up": {}, "Choice Scarf": {}}},
  "Drifblim": {"sets": {"Defog": {}}},
  "Mismagius": {"sets": {"Choice Specs": {}, "Nasty Plot": {}, "Calm Mind": {}}},
  "Spiritomb": {"sets": {"Physical Wall": {}}},
  "Toxicroak": {"sets": {"Swords Dance": {}, "Nasty Plot": {}}},
  "Abomasnow": {"outdated": true, "sets": {"Aurora Veil": {}, "Choice Specs": {}}},
  "Magmortar": {"outdated": true, "sets": {"All-Out Attacker": {}}},
  "Rotom": {"sets": {"Choice Scarf": {}, "Utility": {}, "Nasty Plot": {}}},
  "Rotom-Frost": {"outdated": true, "sets": {"Nasty Plot": {}}},
  "Mesprit": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Mesprit is a great revenge killer to handle fast Pokemon like Jolteon and Hisuian Sneasel. Dazzling Gleam is Mesprit's best complementary coverage move for Psychic, covering Dark-types like Sneasel and Sableye. U-turn lets Mesprit keep up offensive momentum against switch-ins like Orthworm, Farigiraf, and Snorlax. Healing Wish lets Mesprit give teammates like Virizion, Snorlax, and Glastrier a second chance to set up and sweep. Mesprit can alternatively use Trick to make a defensive Pokemon like Snorlax, Orthworm, or Dudunsparce less threatening. Tera Fairy Mesprit is a more effective offensive and defensive answer to Sneasel, Toxicroak, and Passimian given their Dark-type coverage moves, and Tera Fairy lets Mesprit not play guessing games with Psychic and Dazzling Gleam against Tera Dark Pokemon like the aforementioned Toxicroak and Passimian. Tera Steel has good synergy with Levitate and gives Mesprit several new resistances to more easily answer Whimsicott, Sandslash, and Farigiraf.</p> <p>Offensive pivots like Jolteon and Magneton make great cores with Mesprit and appreciate Mesprit's Levitate to more easily play around Ground-types. Fighting-types like Hisuian Decidueye, Virizion, and Passimian are great offensive checks to Steel-types like Orthworm and Perrserker and specially defensive Normal-types like Snorlax and Dudunsparce, all of which give Mesprit trouble, and they appreciate Mesprit offensively checking Poison-types like Toxicroak, Weezing, and Hisuian Sneasel. Mesprit benefits from Ground-type teammates like Sandslash and Sandaconda patching up its poor matchup against Hisuian Qwilfish, while it can check foes like Virizion and Hisuian Decidueye for them. Setup sweepers like Oricorio-G, Regirock, and Frosmoth benefit from Mesprit providing them second chances to sweep with Healing Wish or making foes more exploitable with Trick. Physical wallbreakers like Hisuian Decidueye, Glastrier, and Toxicroak all benefit from Healing Wish giving them an additional chance for breaking, as they can break special walls that Mesprit cannot.</p>"
      },
      "Nasty Plot Sweeper": {
        "description": "<p>Nasty Plot Mesprit is a fearsome mid- or late-game sweeper thanks to the combination of Levitate and a somewhat high base 105 Special Attack stat. Its biggest perk is the ability to set up in front of most bulkier Pokémon. Mesprit can choose between Encore and Substitute as its setup tool; Substitute can be very good versus bulkier teams, as Mesprit can tank a hit from most of the passive mons such as Regirock and Lanturn if not being hit super effectively, obtaining a free turn to either set up Nasty Plot or fire off an attack. Encore helps to circumvent Mesprit's passivity and can take advantage of checks that need to set up or use status moves like Haze to wall Mesprit, like Articuno for the Haze case, and Dudunsparce for the set up. Psyshock is great to deal with specially defensive Pokémon such as Snorlax and Calm Mind users, like Dudunsparce. Draining Kiss allows Mesprit to outlast Dark-type checks such as Spiritomb and Sneasel while healing in the process, Thunderbolt allows it to hit Water- and Flying-types such as Cramorant and Clawitzer. Tera Fairy lets Mesprit set up in front of the aforementioned Dark-types, grants immunity to Dragon Tail from Dipplin, Appletun, and Dudunsparce, and increases the power of Draining Kiss, letting Mesprit restore more HP on the aforementioned threats and making it even harder to take down. Tera Steel improves Mesprit's defensive capabilities, making it take neutral damage from Dark- and Ghost-type attacks and giving it a Bug resistance, while only being weak to Fighting- and Fire-type moves due to Levitate. Tera Electric boosts the power of Thunderbolt and removes all of Mesprit's weaknesses.</p> <p>Nasty Plot Sweeper Mesprit works well with specific entry hazard setters and Fighting-types. Hazard setters like Orthworm and Hisuian Qwilfish both cover each other's weaknesses and let Mesprit get rolls it wouldn't otherwise, such as KOing Honchkrow with Tera Fairy Draining Kiss after Stealth Rock chip damage. Fighting-types such as Scarf Passimian, Virizion, or Hitmonlee deserve a highlight, as when paired with Mesprit, they provide good coverage for it, pressuring Dark- and Steel-types with their STAB moves and Ghost-types with Knock Off. Each of them offers additional utility, with Virizion being bulky enough to enter in and provide wallbreaking prowess, Passimian having access to U-turn to let Mesprit in safely and Knock Off to offer utility, and Hitmonlee providing support with Knock Off and Rapid Spin. Secondary wallbreakers that don't rely on Setup to make progress such as Clawitzer and Magneton will also appreciate being by Mesprit's side. Some cleaners also enjoy Mesprit's ability to make progress so they can clean late-game, such as Dodrio and Hisuian Sneasel.</p>"
      },
      "Choice Specs": {},
      "Defensive Pivot": {}
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 644300, "username": "Estragos"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 652656, "username": "Gambit_Gamin"}]}]}
  },
  "Shaymin": {"sets": {"Offensive Utility": {}, "Choice Scarf": {}}},
  "Gurdurr": {"outdated": true, "sets": {"Bulky Attacker": {}}},
  "Whimsicott": {
    "overview": "<p>Blessed with the rare Fairy typing and an excellent Speed tier, Whimsicott makes for an excellent revenge killer and utility Pokemon. Whimsicott's unique typing allows it to beat many dangerous threats like Hisuian Decidueye and Virizion. A powerful Moonblast and pivoting coupled with Choice Specs allow Whimsicott to break past bulkier threats like Hisuian Qwilfish and Glastrier. However, Whimsicott's low offensive stats leave it often wanting for power, especially without Choice Specs, and it's incapable of fitting every move it wants. Furthermore, lack of reliable recovery and only average bulk makes it unable to consistently check the Pokemon it's supposed to like Regirock and Sandaconda.</p>",
    "comments": "<h3>Other Options</h3> <p>Psychic is an option that nails Poison-types like Weezing and Grafaiai. However, this comes at the cost of either losing U-turn's pivoting or the utility of Switcheroo or Encore. Whimsicott can use a SubSeed set to mess up its usual defensive checks like Snorlax and Orthworm and be a general nuisance. This set struggles to find setup opportunities however and relies heavily on getting a free Substitute on a forced switch.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Whimsicott's 4x weakness to Poison and inability to hit Poison-types with its STAB attacks makes Poison-types like Grafaiai and Weezing good checks. However, these Pokemon lack reliable recovery and can thus be worn down over a game.</p> <p><strong>Steel-types</strong>: Steel-types like Magneton and Orthworm can take Whimsicott's STAB attacks with ease. Orthworm can start setting entry hazards or set up with Coil or Iron Defense, while Magneton can generate momentum with Volt Switch.</p> <p><strong>Fire-types</strong>: As Whimsicott's STAB attacks do little to them, Fire-types like Charizard, Typhlosion, and Magmortar can use Whimsicott as an entry point to start firing off powerful attacks. These Pokemon aren't usually defensively invested however and can struggle to switch in consistently.</p> <p><strong>Special Walls</strong>: Special walls like Dudunsparce, Snorlax, and Articuno aren't bothered by Whimsicott's attacks and can use it to start forcing progress with entry hazards, status, pivoting, or boosts. However, Switcheroo completely ruins these walls, especially Articuno, and Encore can force them to repeat their status moves, allowing Whimsicott to safely bring in a teammate.</p> <p><strong>Choice Scarf Users</strong>: Many common Choice Scarf users like Grafaiai, Qwilfish, and Gunk Shot Passimian get the jump on Whimsicott and can easily take it out.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Whimsicott takes advantage of its high Speed and Moonblast to be a powerful cleaner and revenge killer. U-turn lets It scout for switches and pivot out of unfavorable matchups like Weezing and Orthworm, allowing it to bring in a more suitable teammate. Switcheroo allows Whimsicott to cripple its defensive checks, greatly hindering special walls like Dudunsparce, Orthworm, and especially Articuno, letting Whimsicott and its teammates break past them later in the game. However, Whimsicott loses a substantial amount of power without its Choice Specs, so one must be careful about when to use Switcheroo. Infiltrator allows Whimsicott to bypass Substitute from foes like Glastrier and opposing Whimsicott.</p> <p>Choice Specs Whimsicott best fits on balance and bulky offense teams looking for a fast offensive cleaner that also provides some defensive utility. Whimsicott loves entry-hazard stacking teammates like Qwilfish and Orthworm to help push its otherwise average damage output. It can't handle Fire-types like Charizard and Typhlosion, so answers to them like Regirock and Snorlax help immensely. Whimsicott can in return take advantage of the Grass- and Fighting-types like Hisuian Decidueye and Passimian that these Pokemon are at a disadvantage against. Whimsicott struggles with Poison-types like Weezing and Grafaiai who resist its STAB attacks and threathen it with 4x super effective attacks, so answers like Qwilfish and Sandaconda make for great teammates. Whimsicott pairs well with offensive Fire-types like Typhlosion and Charizard that handle the Steel-types like Orthworm that it has difficulties breaking past, and in return, it handles their Water and Rock-type answers such as Regirock and Lanturn. Special sweepers such as Mesprit and Oricorio-G enjoy pairing with Whimsicott for its capability to pressure and cripple special walls like Snorlax and Hisuian Qwilfish.</p>"
      },
      "Offensive Pivot": {
        "description": "<p>Whimsicott leverages its superb Speed and access to Prankster to be a competent offensive pivot. Giga Drain is used for its ability to give Whimsicott staying power in longer games. Encore is key to this set, allowing it to force defensive foes into unfavorable moves like Stealth Rock and Recover, as well as shutting down setup sweepers like Oricorio-G and Snorlax by locking them into their setup moves. U-turn pairs beautifully with Encore, scouting any forced switches and allowing Whimsicott to bring in powerful teammates like Glastrier and Typhlosion. Tera Steel gives Whimsicott an immunity to Poison-type attacks from Grafaiai and Hisuian Qwilfish and a resistance to Flying-type attacks from Dodrio and Braviary as well as Ice-type attacks from Sneasel in a pinch. However, this still leaves Whimsicott vulnerable to Fire-type attacks from Charizard and Typhlosion and makes it weak to Fighting, making it unable to reliably switch into Hisuian Decidueye and Virizion. Tera Fire provides emergency resistances to Ice and Fire, but this makes Whimsicott unable to safely check Ground- and Rock-types like Sandaconda and Regirock.</p> <p>Balance teams enjoy Whimsicott's pivoting and Prankster Encore helping them deal with bulky defensive Pokemon and dangerous setup sweepers. Powerful physical wallbreakers like Glastrier and Passimian pair well with Whimsicott, as it baits in special walls like Articuno and can bring these teammates in with U-turn. Ground-types like Palossand and Sandaconda make for excellent partners, as Whimsicott helps them handle the Water- and Grass-types like Floatzel and Virizion that they struggle with, while they can handle Poison-types like Grafaiai that scare Whimsicott out. Fire-types like Charizard and Magmortar can easily gain entry on Whimsicott, so Fire-resistant teammates like Regirock, Rhydon, and Snorlax are helpful partners. Partners such as Charizard or Passimian that threaten Steel-types like Orthworm and Magneton can come in after a U-turn on these Steel-types to fire off attacks. Electric-types like Jolteon and Magneton appreciate Whimsicott's ability to handle Ground-types like Sandaconda, and in return, they handle the Flying-types like Dodrio and Articuno that Whimsicott struggles to beat. Other offensive pivots like Grafaiai and Floatzel can form a powerful VoltTurn core with Whimsicott, quickly racking up damage against walls like Regirock and Qwilfish, especially with entry hazards up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Lilligant": {"sets": {"Sun Sweeper": {}}},
  "Eelektross": {"outdated": true, "sets": {"Defensive Pivot": {}, "Coil": {}}},
  "Braviary": {"sets": {"Bulk Up": {}}},
  "Virizion": {"sets": {"Swords Dance": {}, "Calm Mind": {}}},
  "Pyroar": {"sets": {"Special Attacker": {}}},
  "Malamar": {"sets": {"RestTalk": {}, "Choice Scarf": {}}},
  "Clawitzer": {"sets": {"Choice Specs": {}}},
  "Avalugg-Hisui": {"outdated": true, "sets": {"Suicide Lead": {}, "Offensive Utility": {}}},
  "Decidueye-Hisui": {
    "overview": "<p>Hisuian Decidueye's unique bag of tricks, including its powerful Triple Arrows, rare utility in Defog, Swords Dance, U-turn, and Sucker Punch gives it a unique place as either a fearsome setup sweeper that tears through defensive teams or a defensive Defog-packing pivot that removes entry hazards in the face of the most common setters like Orthworm and Sandaconda. Its typing makes defensive sets adept at checking many threats like Brute Bonnet, Floatzel, and Lycanroc. However, Hisuian Decidueye's low speed makes it difficult for it to face up against offensive teams, as many revenge killers like Passimian and Virizion can easily take it out without fearing offensive sets's priority attacks. Hisuian Decidueye has trouble fitting every move it wants, especially on offensive sets, often leaving it walled by common foes like Charizard and Qwilfish. Lastly, Hisuian Decidueye faces competition from other Grass-types like Whimsicott and other Fighting-types like Passimian; it especially faces competition from Virizion, which shares its typing.</p>",
    "comments": "<h3>Other Options</h3> <p>Brave Bird seems tempting to nail Whimsicott on the switch-in but is quite bad otherwise and hard to fit. Scope Lens is a potential option on Swords Dance sets, letting Hisuian Decidueye have near-guarenteed critical hits on Triple Arrows and Leaf Blade, but this lacks the utility of Lum Berry. Defensive sets can invest varying degrees of speed to outpace threats like Glastrier, Orthworm, and Sandaconda.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Weezing is a near-perfect wall to Hisuian Decidueye, taking minimal damage from its attacks and threatening it in return with super effective attacks or status conditions. Grafaiai threatens Hisuian Decidueye with Gunk Shot, or it can use encore to lock Hisuian Decidueye into an unfavorable move and force it to switch out, potentially gaining momentum with U-turn. Qwilfish greatly annoys defensive sets, easily setting up entry hazards on it, but must be wary of Swords Dance, since Intimidate is blocked by Scrappy, and a +2 Leaf Blade deals huge damage. Hisuian Qwilfish is unthreathened by Sucker Punch and can take Hisuian Decidueye out with a Poison-type attack, but it doesn't take Triple Arrows very well and hates having its Eviolte removed by Knock Off.</p> <p><strong>Flying-types</strong>: Hisuian Decidueye's 4x weakness to Flying makes it incredibly threatened by the likes of Dodrio, Oricorio-G, Oricorio-F, and Braviary, which can use it as an opportunity to set up. Cramorant is a shakier switch-in but can assist its team in pivoting around Triple Arrows. However, these Pokemon must think twice about switching in directly in fear of Knock Off or Triple Arrows.</p> <p><strong>Fire-types</strong>: Fire-types like Charizard and Pyroar put immense pressure on Hisuian Decidueye with their super effective STAB attacks. Will-O-Wisp lets them dance around Sucker Punch, reducing the effectiveness of Hisuian Decidueye's sweeping potential. Typhlosion doesn't enjoy Sucker Punch but likewise scares Hisuian Decidueye out. Knock Off ruins these Pokemon, however, making them wary of switching in.</p> <p><strong>Psychic-types</strong>: Mesprit offensively threatens Hisuian Decidueye with Psychic-type STAB moves, sets up Stealth Rock, can use Encore to lock it into a status move. Nasty Plot sets can set up a Substitute on Swords Dance Hisuian Decidueye's Sucker Punch, but Mesprit has to be wary of Knock Off, Shadow Sneak, and even U-turn from defensive sets. Farigiraf's Armor Tail and Indeedee-Fs Psychic Terrain block Sucker Punch completely, allowing them to fire at Decidueye unhindered. Knock Off does remove their items and greatly damages them, however, and U-turn also deals good damage while potentially putting them into precarious positions.</p> <p><strong>Ice-types</strong>: Sneasel and Frosmoth outpace Hisuian Decidueye and can destroy it with super effective attacks. They can also play around Sucker Punch with Ice Shard and Substitute, respectively. Glastrier has the bulk to take a Triple Arrows from Hisuian Decidueye and hit back with Icicle Crash. All of them are unable to switch in directly, however.</p> <p><strong>Faster Attackers</strong>: Several faster revenge killers like Whimsicott, Passimian, and Virizion outspeed Hisuian Decidueye and resist Sucker Punch, letting them retaliate with their own powerful attacks. Other faster special attackers like Jolteon and Magneton outspeed and threaten Hisuian Decidueye.</p> <p><strong>Status Conditions</strong>: Will-o-Wisp from Weezing and Charizard takes Hisuian Decidueye out of commision, severely weakening its attacks. Toxic from Qwilfish and Hisuian Qwilfish eats away at Hisuian Decidueye's HP and stops potential sweeps in their tracks. Lum Berry on Swords Dance sets can alleviate this problem once a game, but defensive sets can't afford to use this item.</p>",
    "sets": {
      "Defog": {
        "description": "<p>With its great matchups into many of the tier's hazard setters like Sandaconda and Orthworm, Hisuian Decidueye is an excellent user of the rare Defog while also serving as a good check to several offensive threats like Floatzel, Brute Bonnet, and Rhydon. Roost provides Hisuian Decidueye with reliable recovery. U-turn lets Hisuian Decidueye grab momentum against the switches it forces against Pokemon like Dudunsparce and Regirock. Knock Off removes items from otherwise-safe switch-ins like Charizard and Cramorant. Scrappy lets Triple Arrows nail Ghost-types like Spiritomb and Sableye and also blocks Intimidate from both Qwilfish. Tera Steel improves Hisuian Decidueye's matchup into hazard setters like Froslass and Qwilfish as well as threats like Whimsicott, Mesprit, and Sneasel.</p> <p>Hisuian Decidueye is immensely helpful for balance teams to remove hazards that would otherwise pressure them greatly. Defensive walls that struggle with hazards, such as Regirock and Porygon-2, love Hisuian Decidueye removing hazards to make them far harder to be taken down. Regirock in particular is an excellent partner in crime, with it stonewalling the Fire- and Flying-types like Typhlosion, Charizard, and Oricorio-G that greatly threaten Hisuian Decidueye while Hisuian Decidueye handles the Grass-, Ground-, and Water-types that Regirock struggles to handle, notably Virizion, Pallosand, and Floatzel. Snorlax also helps cover Fire-types for Hisuian Decidueye while appreciating the removal of entry hazards as well as Hisiuan Decidueye's positive matchup into counters like Orthworm and Regirock. Typhlosion is another notable teammate that enjoys Hisuian Decidueye's hazard removal and slow pivoting as well as its capability to deal with Rock- and Water-types like Rhydon and Lanturn that check Typhlosion. Psychic-types like Mesprit and Farigiraf can use Hisuian Decidueye as setup fodder, so teammates that deal with them like Hisuian Qwilfish and Magneton are useful teammates for Hisuian Decidueye. Weezing and Qwilfish can easily enter on Hisuian Decidueye and spread status or reestablish hazards, annoying it greatly, so teammates like Magneton and Mesprit are helpful in scaring them back. Whimsicott is a notable threat that can liberally switch into Hisuian Decidueye and start firing off attacks, so special walls that deal with it like Articuno and Dudunsparce help immensely. Hisuian Sneasel can take advantage of Hisuian Decidueye to start setting up, so teammates that can deal with it such as Pallosand and Weezing, are useful partners. Other pivots such as Grafaiai, Floatzel, and Jolteon, can form a powerful VoltTurn core with Hisuian Decidueye and appreciate it removing hazards to allow them to come in more times over the course of a game.</p>"
      },
      "Swords Dance": {
        "description": "<p>Hisuian Decidueye can take advantage of the many switches it forces to set up Swords Dance. Triple Arrows is the prefered Fighting-type STAB option for its lack of drawback and capability to brute force past foes with its myriad secondary effects. Leaf Blade threatens Ground-types like Sandaconda and Palossand. Knock Off annoys common switch-ins like Charizard and Rotom and allows Hisuian Decidueye to force progress before it's primed to sweep. Sucker Punch picks off faster Pokemon like Mespirit and Oricorio-G. Shadow Sneak hits some foes that resist Sucker Punch like Passimian, Hisuian Sneasel, and Hitmonlee. slightly harder but is generally not worth the loss of power against neutral targets. On certain teams like Sticky Webs offense, Hisuian Decidueye may opt to drop priority. Lum Berry lets Hisuian Decidueye shrug off status conditions like Will-O-Wisp from Weezing and Charizard once. Tera Dark boosts the power of Sucker Punch and Knock Off while giving Hisuian Decidueye a Psychic immunity, improving its matchup against Mesprit. Scrappy lets Hisuian Decidueye hit Ghost-types like Froslass, Spiritomb, and Sableye with Triple Arrows, with the added benefit of blocking Intimidate from Qwilfish and Hisuian Qwilfish.</p> <p>Hisuian Decidueye's unique capability to tear defensive Pokemon apart makes it a great pick on many teams ranging from semistall to hyper offense. Fellow Fighting-types like Passimian and Hisuian Sneasel enjoy teaming up with Hisuian Decidueye, overwhelming the few Fighting-type checks like Weezing and Charizard. Special attacking teammates like Mesprit and Whimsicott enjoy Hisuian Decidueye pressuring their checks like Snorlax, Dudunsparce, and Orthworm, and in return, they threaten physical walls like Qwilfish and Dipplin, respectively. Switch-ins to Fire-types like Lanturn and Regirock help Hisuian Decidueye deal with the likes of Charizard and Typhlosion. As Hisuian Decidueye can't touch Weezing, Pokemon that can deal with it such as Mesprit, Farigiraf and Magneton are great teammates. Entry hazard setters like Froslass, Qwilfish, and Orthworm greatly help Hisuian Decidueye sweep, especially if it's running Knock Off to remove Heavy-duty Boots. Whimsicott is a notable threat that easily switches into Hisuian Decidueye and threatens it back; as such, defensive answers to it like Charizard and Articuno are great partners. Dipplin can take Hisuian Decidueye's attacks and phaze it with Dragon Tail, so teammates that can scare it out like Whimsicott and Charizard make for great teammates. Pivots like Articuno, Jolteon and Grafaiai help bring Hisuian Decidueye in on foes like Orthworm and Dudunsparce, giving it setup opportunities.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 452572, "username": "missangelic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 327515, "username": "Zrp200"}]}]}
  },
  "Vikavolt": {"sets": {"Sticky Web Pivot": {}}},
  "Oricorio": {"sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Oricorio-Pa'u": {"outdated": true, "sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Oricorio-Sensu": {
    "overview": "<p>With its superb typing and access to Quiver Dance, Oricorio-G is a scary sweeper that aims to get boosts in the mid to late-game to clean up the enemy team. Its Ghost / Flying typing gives it a myriad of resistances, allowing it to check and set up on common Pokemon like Virizion and Toxicroak. Flying / Ghost STAB attacks are nearly unresisted, hitting everything save Naclstack and Morpeko for at least neutral damage while hitting many common Pokemon like Bruxish and Virizion super effectively. Offensive sets allow Oricorio-G to be a terrifying sweeper that can easily clean up mid- to late-game, while its defensive set uses its great typing to set up multiple times and slowly take apart bulkier teams. However, Oricorio-G has trouble setting up due to its deceptive frailty when uninvested and can struggle to threaten much without numerous boosts when invested into bulk. It's also quite reliant on Terastallization to bypass its answers like Sneasel and Snorlax.</p>",
    "comments": "<h3>Other Options</h3> <p>Substitute can be used over Taunt to shut down Dudunsparce as a check but doesn't do much else for Oricorio-G. Oricorio-G can be used as a defensive Defogger, but this role is better done by Drifblim.</p> <h3>Checks and Counters</h3> <p><strong>Normal-types</strong>: Snorlax and Dudunsparce are two of Oricorio-Gs best walls, as they can easily take it's moves with their huge bulk, and can threaten it in return with Crunch or Heat Crash from Snorlax and Toxic or Dragon Tail from Dudunsparce. However, Snorlax struggles with hazards and lack of reliable recovery, and both walls can be countered with Tera Fighting. Offensive Normal-types like Braviary and Indeedee-F can also switch into Oricorio-Gs moves and threaten it out.</p> <p><strong>Rock-types</strong>: Regirock and Rhydon can easily take hits from Oricorio-G and either cripple it or phaze it. Rhydon also threatens huge damage on Oricorio-G with its Rock-type moves. However, these Pokemon have no reliable recovery and can be worn down over the course of a game. Naclstack is also a huge annoyance due to it resisting both its STAB moves pre-Terastallization, and being able to wear it down with Salt Cure, and remain healthy with Recover.</p> <p><strong>Steel-types</strong>: While few, Steel-types like Orthworm and Magneton completely shut down bulky Oricorio-G and can set up on it or attack it back. Magneton threatens it with powerful super effective attacks, while Orthworm can set Stealth Rock and use Coil on it. However, these two Pokemon lack reliable recovery, allowing them to be worn down over the course of the game.</p> <p><strong>Electric-types</strong>: Electric-types like Jolteon and Hisuian Electrode can switch into Oricorio-G and severely damage it with their STAB moves. All Electric-types bar Rotom can also take any of Oricorio-Gs unboosted attacks and generate momentum on it with Volt Switch.</p> <p><strong>Special Walls</strong>: Offensive Oricorio-G gets completely shut down by Articuno, and, while bulky Oricorio-G can deny Haze and Roar with Taunt, it must be wary of being PP stalled out of its only attacking move. Hisuian Qwilfish can also beat Oricorio-G with Toxic and Pain Split while being generally unthreatened by its attacks. Other more uncommon special walls like Muk and Malamar can also shrug off its attacks and cripple it in return.</p> <p><strong>Strong Physical Attackers</strong>: Fast and powerful physical attackers like Sneasel and Bruxish can capitalize on Oricorio-G’s lower physical bulk and threatens it out with super effective attacks. However, these attackers tend to have difficulty switching in and can be outsped and KOed, should Oricorio-G get a boost prior. Glastrier is an exception to this with its huge bulk and can easily scare Oricorio-G out.</p>",
    "sets": {
      "Offensive Quiver Dance": {
        "description": "<p>Oricorio-G aims to be as offensively threatening as possible, with its STAB moves of Revelation Dance and Hurricane being near-unresisted, hitting most of the tier for at least neutral damage. Revelation Dance acts like a pseudo-Tera Blast that changes type when Terastallized, letting Oricorio-G tailor its coverage to beat certain types of Pokemon. Tera Fighting allows Oricorio-G to better threaten Normal-types like Dudunsparce, Dark-types like Sneasel, Steel-types like Orthworm, and Rock-types like Rhydon. Tera Ground hits Electric-types like Jolteon as well as the Poison- and Rock-types while giving it resistances to these types.</p> <p>Offensive Oricorio-G best fits on offensive teams alongside other setup sweepers like Virizion, Sneasel and Mesprit. They mutually benefit from each other softening up opposing walls like Articuno and Hisuian Qwilfish to enable a final sweep. Fighting-types like Toxicroak and Hisuian Sneasel threaten the Normal- and Dark-types that Oricorio-G struggles breaking past, easing its need to Terastallize. Defensive answers to Normal-types like Regirock and Palosand are appreciated as well. Oricorio-G also appreciates special wallbreakers like Clawitzer and Alolan Exeggutor that weaken the opposing team's special walls such as Snorlax. Entry hazard setters like Rhydon and Qwilfish help wear down foes to allow an easier sweep for Oricorio-G.</p>"
      },
      "Bulky Quiver Dance": {
        "description": "<p>Bulky Oricorio-G leverages its great defensive typing and decent bulk to be a threatening late-game Quiver Dance sweeper. Air Slash is used over Revelation Dance for its lack of immunities prior to Terastallization. Roost helps Oricorio-G stave off chip damage and stay healthy. Taunt denies opposing setup and recovery moves as well as status moves like Toxic from Qwilfish and Dudunsparce, Haze from Articuno, and Roar from Piloswine. Heavy-Duty Boots gives Oricorio-G an immunity to Stealth Rock, giving it more opportunities to switch in and set up. Grassy Seed is an alternative on Grassy Terrain teams to give Oricorio-G a Defense boost, giving it much needed physical bulk to take strong neutral attacks like Bruxish's Psychic Fangs. Tera Steel gives Oricorio-G a Rock resistance and a Poison immunity, while Tera Fairy gives it a Dark resistance and a Dragon immunity while still being resistant to Fighting.</p> <p>Balance teams can easily fit Oricorio-G for its myriad of immunities and potential to sweep late-game. Oricorio-G struggles with Rock- and Steel-type Pokemon such as Regirock and Orthworm, so Ground- and Water-type teammates like Qwilfish and Sandslash are good options for teammates. Fighting-type teammates like Virizion and Passimian are excellent partners, as they can also threaten Rock- and Steel- types as well as bulky Normal-types like Snorlax and Dudunsparce. Checks to Electric-type Pokemon such as Hisuian Decidueye and Toedscruel cover Oricorio-Gs weakness to them. Special wallbreakes like Whimsicott and Sceptile can help Oricorio-G to wear down special walls or clean up after it. Strong physical attackers like Bruxish and Passimian can also help threaten special walls that Oricorio-G struggles with like Articuno and Hisuian Qwilfish, and in return, it can take advantage of their checks like Dipplin and Sandaconda. Oricorio-G greatly benefits from entry hazard-stacking teammates like the aforementioned Qwilfish and Sandaconda, as they chip away at its checks, and Oricorio-G can double as a spinblocker for them. On Grassy Terrain teams it synergizes well with other setup sweepers like Farigiraf and Mesprit; on these teams, it aims to break apart bulky cores that its teammates may struggle with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 652656, "username": "Gambit_Gamin"}]}]}
  },
  "Lycanroc": {"sets": {"Swords Dance": {}, "Suicide Lead": {}}},
  "Lurantis": {"outdated": true, "sets": {"Defog": {}}},
  "Passimian": {
    "comments": "<h3>Other Options</h3> <p>With a Choice Band equipped, Passimian 2HKOes non-Colbur Bery Palossand sets with Knock Off and physically defensive Sandaconda with Close Combat. However, Passimian's base 80 Speed leaves it very susceptible to faster offensive Pokemon like Jolteon, Charizard, and Whimsicott.</p> <h3>Checks and Counters</h3> <p><strong>Physically Defensive Pokemon</strong>: Dipplin and Sandaconda have the longevity and bulk to withstand repeated attacks from Passimian, and neither are particularly punished by Knock Off or its coverage moves. Gunk Shot can threaten Dipplin, but it suffers from poor accuracy and fails to 2HKO it. Weezing is a standout defensive check to Passimian between having great physical bulk, threatening to Will-O-Wisp Passimian, and punishing U-turn with Rocky Helmet.</p> <p><strong>Ghost-types</strong>: Palossand, Sableye, and Spiritomb cause Passimian to lose momentum when it's locked into Close Combat, and all three can burn it. Spiritomb dislikes losing its Leftovers to Knock Off though. Mismagius and Oricorio-G can use Passimian to set up if it's locked into Close Combat or Earthquake, but neither of them can switch into Knock Off.</p> <p><strong>Status</strong>: Will-O-Wisp from Rotom and Charizard debilitates Passimian, though they struggle to switch into its coverage moves safely. Paralysis leaves Passimian easily outsped and makes it poor speed control, so Regirock, Magneton, Porygon2, and Dudunsparce can punish Passimian trying to switch in on them with Thunder Wave or Glare.</p> <p><strong>Faster Choice Scarf Users</strong>: Rotom, Typhlosion, and Mismagius can outspeed and deal significant damage to Passimian, though none of them switch into the combination of Close Combat and Knock Off safely.</p> <p><strong>Fairy-types and Tera Fairy Pokemon</strong>: Whimsicott resists or takes neutral damage from most of Passimian's moves but must be wary of Gunk Shot, and Close Combat can 2HKO it after Stealth Rock damage. Tera Fairy users like Mesprit, Mismagius, and Jolteon can take advantage of Passimian's limited coverage to take a hit from it and KO it at the cost of burning Terastallization. Even Pokemon vulnerable to Passimian such as Snorlax and Dudunsparce can use Tera Fairy to defensively flip their matchups and wall Passimian, opening opportunities for themselves to set up.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Passimian is an excellent fast offensive pivot and revenge killer thanks to its strong STAB attacks, good physical bulk, Stealth Rock resistance, and resistance to priority moves like Accelerock from Lycanroc and Sucker Punch from Hisuian Decidueye and Brute Bonnet. Passimian OHKOes fast offensive threats like Lycanroc and Sneasel and KOes Typhlosion, Brute Bonnet, and Grafaiai after Stealth Rock damage. Knock Off makes Mesprit, Mismagius, and Oricorio-G unsafe switch-ins to Passimian, and it makes helpful progress by removing items from defensive checks like Palossand, Weezing, and Spiritomb. U-turn lets Passimian keep up momentum against switch-ins like Dipplin and Sableye. Earthquake is Passimian's best coverage move for Poison-types like Neutralizing Gas Weezing, Qwilfish, Hisuian Sneasel, and Muk. Gunk Shot OHKOes Whimsicott, is Passimian's best move against Dipplin, and keeps Passimian offensively relevant against Tera Fairy users like Snorlax, Dudunsparce, and Jolteon. Rock Slide hits Flying-types like Charizard, Cramorant, and Oricorio-F. Tera Fighting allows Passimian to outright OHKO offensive foes like Virizion and Typhlosion and 2HKO defensive foes like Hisuian Decidueye, Regirock, and Sandaconda after one layer of Spikes. Tera Dark improves Passimian's matchups against Mesprit and Farigiraf, powers up Knock Off to hurt Palossand and Spiritomb more, and denies Prankster-boosted moves from Grafaiai and Sableye. Defiant is Passimian's only viable ability, but it's useful for boosting Passimian against Intimidate Qwilfish formes and punishing Sticky Web and Defog Hisuian Decidueye.</p> <p>Passimian punishing Defog with Defiant and removing Heavy-Duty Boots with Knock Off makes it a great team player for entry hazard-stacking teams including Qwilfish, Sandslash, or Hisuian Qwilfish. Passimian's momentum is greatly appreciated by wallbreakers like Typhlosion, Clawitzer, and Alolan Exeggutor. Passimian luring in physically defensive Pokemon like Sandaconda and Dipplin enables partners like Mesprit and Whimsicott to take advantage of them when Passimian pivots out with U-turn, and in turn, Passimian threatens Steel-types like Orthworm and Magneton for them. Ghost-types like Palossand, Mismagius, and Oricorio-G can exploit Passimian locked into Close Combat, Earthquake, or Gunk Shot, so teammates like Dudunsparce, Snorlax, and Hisuian Qwilfish are great teammates. Likewise, Passimian appreciates specially offensive teammates like Mesprit, Farigiraf, and Charizard that can exploit physically defensive Pokemon like Weezing and Dipplin that it lures in. Once Passimian can form pivot cores with Pokemon like Jolteon, Magneton, and Lanturn, it can trap foes in the vortex and wear down mutual Ground-type checks such as Palossand, Sandaconda, and Sandslash. Physical wallbreakers like Choice Band Sneasel, Glastrier, and Choice Band Floatzel can open up holes in defensive cores to pave the way for Passimian to clean up late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Palossand": {
    "comments": "<h3>Other Options</h3> <p>A Colbur Berry can dull the initial damage from Knock Off if Palossand is facing off against strong attackers like Hitmonlee, Passimian, or Toxicroak, but the passive benefits of Rocky Helmet and Heavy-Duty Boots carry over better if Palossand Terastallizes. The additional power of Earth Power is less useful to Palossand compared to fishing for status with Scorching Sands and Sludge Bomb. Tera Dark affords Palossand more flexibility against Bruxish, Rotom, and Prankster-boosted status moves from Grafaiai and Whimsicott.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Virizion and Hisuian Decidueye can threaten Palossand and can set up to break past its physical bulk. Specially offensive Grass-types like Whimsicott, Hisuian Electrode, Sceptile, and Alolan Exeggutor take advantage of Palossand's poorer special bulk. Hisuian Decidueye and Lurantis can remove Palossand's Stealth Rock, and the both of them and Dipplin can use Palossand as an opportunity to set up. All Grass-types must be wary of Sludge Bomb though, and Scorching Sands's burn chance is problematic for physically offensive ones.</p> <p><strong>Ice-types</strong>: Bulky Ice-types like Frosmoth and Glastrier threaten Palossand and can use it to set up. Articuno is similarly bulky and only dislikes a lucky Sludge Bomb poison. Sneasel can break through Palossand, but neither it nor Glastrier want to take a burn from Scorching Sands, and chip damage from Rocky Helmet adds up on Sneasel if it uses Triple Axel. Palossand blocks Rapid Spin from Hisuian Avalugg and threatens it with Scorching Sands but takes a lot of damage from Mountain Gale.</p> <p><strong>Water-types</strong>: Bruxish, Floatzel, and Veluza can break past Palossand’s great bulk with their powerful Water-type STAB moves but must consider Water Compaction, Tera, and Palossand’s Shadow Ball. Clawitzer has few issues breaking Palossand. Cramorant's special bulk and Ground immunity let it consistently use Defog against Palossand.</p> <p><strong>Special Attackers</strong>: Special wallbreakers like Mesprit and Jolteon break past Palossand’s much lower special bulk but are vulnerable to Shadow Ball and Scorching Sands. Bulky special sweepers like Calm Mind Dudunsparce, Farigiraf, and Oricorio-G can exploit Palossand’s underwhelming damage output to set up, but the former two don’t enjoy taking an unlucky status, while Oricorio-G is weak to Shadow Ball and needs a Special Defense boost to comfortably set up on Palossand.</p> <p><strong>Flying-types</strong>: Oricorio-F and Braviary can capitalize on Palossand's difficulty in dealing damage to them to use it as setup fodder. Oricorio-G is weak to Shadow Ball but can use Quiver Dance to help itself get out of KO range and can target Palossand due to its low special bulk.</p> <p><strong>Trick and Switcheroo</strong>: A Choice-lock is terrible for Palossand's ability to wall foes, so Rotom and Mesprit are very disruptive if they swap a Choice item onto it with Trick.</p> <p><strong>Status</strong>: Toxic from Dudunsparce, Grafaiai, and Hisuian Qwilfish puts Palossand on a timer and makes it more reliant on using Shore Up, but neither of them tolerate burns from Palossand's Scorching Sands very well. Grafaiai can use Poison Touch, and Dudunsparce can use Poison Jab to fish for poisons on Palossand even if they drop Toxic.</p> <p><strong>Taunt and Encore</strong>: Grafaiai and Whimsicott can use Encore to lock Palossand into a status move or weak move to exploit it, but they are weak to Scorching Sands and Sludge Bomb, respectively. Primeape can use Taunt to stop Palossand from setting up Stealth Rock or recovering but dislikes Scorching Sands. Sableye can irritate Palossand with Taunt or Encore.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Palossand's great physical bulk, unique typing, and access to recovery enable it to wall many physical attackers such as Passimian, Snorlax, and Regirock. Palossand's Ghost typing enables it to block Rapid Spin from Sandslash and can help it in a pinch against Hisuian Avalugg despite Palossand's Ice weakness, which adds to Palossand's reliability as an entry hazard setter. Palossand's decent Special Attack and STAB Shadow Ball's neutral coverage are acceptably strong and keep Palossand from being too passive. Scorching Sands is a nice complementary STAB move that can spread burns, making Palossand’s role as a physical wall even easier by stifling physical sweepers such as Snorlax without Rest and Coil Dudunsparce. Sludge Bomb is an alternative to threaten Grass-types that check Palossand like Hisuian Decidueye and Whimsicott. Tera Dragon lets Palossand flip its weaknesses versus Water- and Grass-types, whereas Tera Water trades a Grass resistance for an Ice resistance, and both have great synergy with Water Compaction. Tera Poison grants Palossand a poison immunity and Grass resistance for Grass-type counters like Whimsicott and Dipplin while retaining a good defensive matchup against Fighting-type moves.</p> <p>Palossand is a great addition to teammates looking for a partner that provides role compression of taking on physical attackers and setting up Stealth Rock. Specially defensive Pokemon form great bulky cores with Palossand. Snorlax can use Thick Fat to take on challenging Ice-type attackers like Frosmoth and Articuno for Palossand, and it appreciates Palossand dealing with Fighting-type threats to it like Passimian and Hitmonlee. Articuno threatens Water- and Grass-types like Clawitzer and Whimsicott for Palossand with its Freeze-Dry, and in turn, it enjoys Palossand providing protection against problematic physical attackers like Regirock and Snorlax. Dudunsparce can take on special attackers like Sceptile and Mismagius for Palossand, using its great bulk, Toxic, and Dragon Tail to mitigate setup opportunities Palossand offers, while Dudunsparce appreciates Palossand taking on Fighting-types like Toxicroak and Hisuian Sneasel that would threaten to break it or cause it to Terastallize prematurely. Hisuian Decidueye and Lurantis resist many of Palossand’s weaknesses and can support Rocky Helmet Palossand by using Defog to help with hazard chip damage. Dipplin can absorb Knock Off for Palossand thanks to Sticky Hold, and other Grass-types such as Whimsicott and Virizion can also threaten the Grass- and Water-types Palossand struggles with, such as Bruxish. Qwilfish and Hisuian Qwilfish enjoy Palossand keeping their Spikes up, while Palossand appreciates Intimidate and hazard stacking to wear down the Pokemon it walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Appletun": {"outdated": true, "sets": {"Special Wall": {}, "Iron Defense": {}}},
  "Sandaconda": {
    "overview": "<p>Sandaconda is a good defensive Pokemon in SV ZU thanks to its bulk and Shed Skin. The increased reliability of Rest as recovery lends Sandaconda the longevity to check Pokemon like Grafaiai, Toxicroak, and Passimian. Options like Stealth Rock, Glare, and Coil diversify Sandaconda into a great support Pokemon or a bulky setup sweeper. Sandaconda is an excellent Terastallization user to boot, enhancing its defensive profile to become even tougher to break or enabling its own sweeps. However, Shed Skin does not make Rest perfectly reliable, hampering Sandaconda's consistency. Physical attackers like Hisuian Decidueye, Glastrier, and Virizion are very problematic for Sandaconda and coerce it to burn Terastallization for its team. Despite its Electric immunity, Sancaonda's lower special bulk can leave it to be overwhelmed by coverage and additional STAB attacks from Jolteon, Magneton, and Rotom. Sandaconda also faces competition from Regirock, another Stealth Rock setter that much more reliably takes on physical attackers like Snorlax, Glastrier, and Sneasel.</p>",
    "comments": "<h3>Other Options</h3> <p>Sandaconda has access to Body Press, which does hit Orthworm and Snorlax harder, but Rock Blast and Scale Shot provide better general coverage against most Pokemon immune to Ground. High Horsepower can be run instead of Earthquake if Thwackey is a teammate.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Most Grass-types take little damage from Earthquake and threaten Sandaconda out with their STAB moves. Dipplin, Appletun, and Lurantis can wall Sandaconda in longer games. Defog Hisuian Decidueye and Toedscruel can remove Sandaconda's Stealth Rock and Rocky Helmet. Whimsicott and Calm Mind Virizion can easily take advantage of Sandaconda, though they don't appreciate Glare hurting their great Speed stats. Shaymin shrugs off paralysis from Glare thanks to Natural Cure. Tera Dragon and Scale Shot can give Coil Sandaconda some recourse against some Grass-types but can make its position against Pokemon like Dipplin, Whimsicott, and Dazzling Gleam Shaymin worse.</p> <p><strong>Pokemon Immune to Ground</strong>: Ground-immune walls like Articuno and Cramorant can walk on Sandaconda, while Orthworm can use it as fodder for setting up Coil or entry hazards. Mesprit and Mismagius can use Sandaconda to set up, block its Glare with Substitute, and use Tera Fairy to completely wall sets with Scale Shot. The Oricorio formes can set up on Sandaconda and use Taunt to deny Glare. However, Ground-immune Pokemon weak to Rock, such as Charizard and the Oricorio formes, must be wary of Rock Blast or Stone Edge. Only Vikavolt and Rotom are immune to Glare.</p> <p><strong>Special Attackers</strong>: Sandaconda's lower special bulk leaves it easily overwhelmed by Typhlosion, Jolteon, and Magneton, though all of them are OHKOed by Earthquake and must be wary of Sandaconda catching them with a defensive Terastallization. Calm Mind Dudunsparce is bulky enough to set up in front of Sandaconda.</p> <p><strong>Water-types</strong>: Cramorant threatens Sandaconda with Surf, is immune to Earthquake, and can remove Sandaconda's Stealth Rock with Defog, but Sandaconda can punish it switching in with a Rock Blast or Glare. Clawitzer, Floatzel, Veluza hit Sandaconda for strong super effective damage and generally tolerate an Earthquake. Qwilfish is capable of finishing off Sandaconda but is vulnerable to Earthquake.</p> <p><strong>Ice-types</strong>: Sneasel is powerful enough to overwhelm Sandaconda with a boost or some chip damage and can pick off Sandaconda's offensive Scale Shot set with Ice Shard even if Sandaconda has a boost, though it takes a lot of Rocky Helmet chip damage from Sandaconda when it uses Triple Axel. Glastrier is bulky enough to take two five-hit Rock Blasts from Sandaconda and threatens it with a strong Icicle Crash. While Frosmoth hits Sandaconda on its weaker special side, it is physically frail and very threatened by Rock Blast.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Sandaconda is a great wall thanks to its natural bulk, Shed Skin, and Ground typing. Common physical attackers like Grafaiai, Toxicroak, and Regirock struggle to break through Sandaconda, and its great defensive profile enables it to consistently set up Stealth Rock. Rock Blast lets Sandaconda strike foes such as Articuno, Charizard, and Mismagius that it cannot touch with Earthquake. Alternatively, Glare lets Sandaconda spread paralysis and punish Pokemon like Hisuian Decidueye, Orthworm, and Virizion that it would deal little damage to anyway. Rest and Shed Skin can keep Sandaconda healthy, especially as it takes on Poison Touch Grafaiai sets and Hisuian Qwilfish, although the inconsistency of Shed Skin can leave it out to dry. Rocky Helmet helps Sandaconda further wear down physical attackers like Snorlax, Regirock, and Dudunsparce trying to break through it, and it enables Sandaconda to punish U-turn from pivots like Hisuian Decidueye, Grafaiai, and Passimian. Tera Poison makes Sandaconda a more reliable wall to physical attackers like Passimian, Sneasel, and Hitmonlee. Tera Ghost makes Sandaconda an even more sturdy wall to physical setup sweepers like Snorlax, Dudunsparce, and Regirock, improves its matchups against other physical attackers like Passimian and Toxicroak, and lets it spinblock Sandslash and Hisuian Avalugg. Tera Water helps Sandaconda handle Floatzel, Sneasel, and Glastrier.</p> <p>Sandaconda is a good physical wall for balanced teams looking to compress entry hazard setting on a teammate that isn't bothered as much by residual damage and status compared to Regirock, Orthworm, and Sandslash. Bulkier offensive teams also benefit from the utility and bulk Sandaconda offers in Glare and absorbing status from Weezing, specially defensive Dudunsparce, and Hisuian Qwilfish for offensive teammates. Hisuian Qwilfish makes an excellent hazard-stacking core with Sandaconda, and they complement each other's defensive flaws; Hisuian Qwilfish defensively answers Grass-types like Hisuian Decidueye, Virizion, and Whimsicott and Levitate Pokemon like Mesprit and Mismagius, while Sandaconda deals with Toxicroak, Sandslash, and Muk. Sandaconda's Water weakness makes teammates like Lanturn, Whimsicott, and Dipplin helpful for managing Cramorant, Clawitzer, and Floatzel. Sandaconda is not offensively threatening to walls like Cramorant and Articuno, so teammates like Magneton and Charizard can compensate for Sandaconda's poor matchup against them and have an easier time against said targets if Sandaconda has paralyzed them with Glare. Sandaconda invites in hazard setters like Palossand and Orthworm due to its passivity, so teamamates that can remove hazards like Hisuian Decidueye and Cramorant make good partners for Sandaconda.</p>"
      },
      "Coil": {
        "description": "<p>Sandaconda serves as a deadly late-game threat with the powerful combination of Coil, Rest, and Shed Skin. Earthquake hits most of the tier for at least neutral damage, while Sandaconda's other attacking move hits Pokemon that are immune to Earthquake like Bombirdier, Oricorio formes, and Braviary. Scale Shot allows Sandaconda to boost its Speed, outspeeding the entire unboosted metagame except for Hisuian Electrode at +1 and outpacing common Choice Scarf users like Typhlosion at +2. Alternatively, Stone Edge doesn't drop Sandaconda's Defense and has more immediate potential to threaten Flying-types like Oricorio formes, Bombirdier, and Charizard. Rest acts as excellent recovery to keep Sandaconda healthy and combines well with Shed Skin to make it more reliable and help it serve as a wall in early- and mid-game scenarios, especially when combined with Tera Dragon to flip matchups on common Water- and Grass-types like Swords Dance Qwilfish and Hisuian Decidueye. Coil Sandaconda can opt to run less Speed in exchange for more bulk, with 224 Speed EVs and a neutral nature being enough to outpace base 110 Speed Pokemon at +1 and still outpace Choice Scarf Bruxish at +2; however, running these Speed EVs means it no longer outspeeds common Chlorophyll sweepers like Victreebel and faster Choice Scarf users like Mismagius and Floatzel at +2. Sandaconda can also opt to run Attack investment instead of HP, but this makes it more difficult to wall the foes it's tasked with setting up on late-game.</p> <p>Levitate users such as Mesprit and Mismagius serve as potentially problematic Pokemon, since they are immune to Earthquake and can become fully immune to Sandaconda's moves, if it's running Scale Shot, with Tera Fairy, so specially bulky teammates like Hisuian Qwilfish and Snorlax as well as faster teammates like Hisuian Electrode can be extremely helpful to counteract them. Orthworm poses similar issues due to Earth Eater and Iron Defense, so wallbreakers that threaten it like Charizard and Typhlosion are invaluable as teammates. These two as well as Bombirdier and Glastrier also threaten Grass-types, which cause problems for Sandaconda pre-Terastallization. Water-types pose similar issues while also often carrying super effective coverage for Terastallized Sandaconda, so teammates like Snorlax, Poliwrath, and Virizion benefit it greatly. In return for all of these potential partners' help, Sandaconda turns many physical attackers into setup fodder. Some common examples of Pokemon completely walled by it late-game include Passimian, Hisuian Qwilfish, and Rhydon; after Terastallization, this list expands to include other offensive threats like Bruxish, Qwilfish, and Hisuian Decidueye.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Cramorant": {"sets": {"Defog": {}}},
  "Frosmoth": {"sets": {"Quiver Dance": {}}},
  "Morpeko": {"outdated": true, "sets": {"Offensive Utility": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Glastrier": {
    "overview": "<p>Glastrier's defining role is that of a bulky physical wallbreaker. It has outstanding bulk for ZU; furthermore, its stellar base 145 Attack, Icicle Crash, and all the coverage it needs including Close Combat and High Horsepower make it extremely difficult to switch into. Lastly, Glastrier can boost its Attack even further with Swords Dance, allowing it to potentially OHKO or 2HKO almost the entire metagame. Defensive staples like Palossand, Snorlax, and Appletun are often forced to Terastallize or switch out versus it. This means that Glastrier's most reliable defensive counterplay is somewhat specific, being limited to almost exclusively both forms of Qwilfish, Regirock, and Orthworm, none of which have reliable recovery, and the latter two of which often require Terastallization to fully check Glastrier.</p>",
    "comments": "<h3>Other Options</h3> <p>Glastrier can opt to run Heavy Slam alongside Tera Steel over High Horsepower to hit light foes like Mesprit and Steel-weak foes like Tera Fairy Dipplin and Dudunsparce. However, trading out High Horsepower for Heavy Slam tends to be overkill, as Glastrier's standard three-move coverage sufficiently hits all relevant foes; furthermore, giving up High Horsepower makes it struggle more against foes like Hisuian Qwilfish. Glastrier can also consider running Substitute to ease prediction, but all of its coverage moves are near mandatory, and without Swords Dance, Glastrier can struggle to threaten the walls it needs to.</p> <h3>Checks and Counters</h3> <p><strong>Faster Attackers</strong>: Glastrier's awful Speed means it can often be a target for offensive threats like Typhlosion, Charizard, Passimian, and Hisuian Decidueye, though it often has to be chipped in order to not take them down with it.</p> <p><strong>Qwilfish</strong>: Both forms of Qwilfish can be quite problematic for Glastrier; regular Qwilfish resists every move except High Horsepower, which it takes relatively little damage from after Intimidate, while Hisuian Qwilfish sports better overall bulk due to its Eviolite. Furthermore, both can use Glastrier's massive HP stat against it with Pain Split, allowing them to trade positively with it and poison it with Barb Barrage or Toxic.</p> <p><strong>Bulky Threats</strong>: Iron Press users like Orthworm and Regirock can match Glastrier's setup and threaten it out, though they may at times require Terastallization to do so. Poliwrath and Snorlax can do the same with Bulk Up and Curse, respectively, though Snorlax must Terastallize first. Weezing is able to neuter Glastrier with Will-O-Wisp and can switch in fairly safely, only fearing boosted Icicle Crash.</p> <p><strong>Status</strong>: Glastrier gets worn down rapidly by poison from Pokemon like Qwilfish and Muk as well as burn from Pokemon like Weezing and Mismagius; burn also neuters its damage.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance Glastrier acts as a fearsome wallbreaker, leveraging its outstanding bulk and the threat of its attacks to create setup opportunities for itself. Close Combat takes on bulky Pokemon that resist Icicle Crash like Orthworm and Thick Fat Snorlax. High Horsepower is near mandatory to hit Qwilfish and serves as effective coverage for Fire-types. Tera Ground gives Glastrier a resistance to Rock while boosting the power of High Horsepower, while Tera Water and Fairy flip Glastrier's weaknesses to common offensive types like Fire and Fighting. 252 Speed EVs allows it to outspeed slower walls like Dudunsparce and Porygon2, while the bulk investment lets it take on powerful attacks from various threats in the tier.</p> <p>Glastrier greatly appreciates teammates that can help bring it in safely like Jolteon, Qwilfish, and Mesprit, since it often has to take a hit after switching in due to its poor Speed. Glastrier also works well alongside other wallbreakers like Choice Specs Jolteon, Hisuian Decidueye, and Charizard, as they are able to break down checks like Snorlax, Regirock, and Qwilfish for each other. Due to its many weaknesses as an Ice-type, Glastrier loves teammates it can fall back on to support it; some of these teammates include Snorlax, Palossand, Regirock, and Qwilfish. As a wallbreaker, Glastrier does exceedingly well alongside Pokemon like Grafaiai, Oricorio formes, and Typhlosion that can often take advantage of the holes that Glastrier makes in defensive cores through removal of foes like Snorlax, Dudunsparce, and Porygon2.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Arboliva": {"outdated": true, "sets": {"Choice Specs": {}, "Bulky Attacker": {}, "Physically Defensive": {}}},
  "Naclstack": {"outdated": true, "sets": {"Stealth Rock": {}, "IronPress": {}}},
  "Grafaiai": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}, "Swords Dance": {}}},
  "Toedscruel": {"outdated": true, "sets": {"Offensive Rapid Spin": {}}},
  "Orthworm": {
    "sets": {
      "Defensive": {
        "description": "<p>Orthworm is an excellent defensive Pokemon thanks to its great physical bulk, Steel typing, and complementary immunity to Ground from Earth Eater. Common Pokemon like Coil Dudunsparce, Snorlax, and Sandaconda struggle to break through Orthworm on their own, while other Pokemon like Grafaiai, Farigiraf, and Mesprit must either dedicate a coverage move for Orthworm or Terastallize. Orthworm's fantastic defensive profile gives it ample opportunities to switch in and set up entry hazards with Stealth Rock and Spikes for its teammates. Orthworm is also a resilient hazard setter against hazard removers like Sandslash and offensive Hisuian Avalugg. Heavy Slam has the best immediate power and coverage of Orthworm's attacks against foes like Grafaiai and Articuno, deals super effective damage to Froslass, and wrecks Whimsicott and Tera Fairy Pokemon such as Jolteon and Mesprit. Body Press is strong against Dudunsparce, Snorlax, and Glastrier, and it 2HKOes heavier foes and foes that resist Heavy Slam such as Magneton, Hisuian Avalugg, and Jolteon. The increased resilience and additional power to Body Press provided by Iron Defense enable Orthworm to beat physical attackers like Brute Bonnet, set up on setup sweepers such as Coil Dudunsparce and Snorlax, and overwhelm physically defensive Pokemon such as Hisuian Decidueye and Regirock lacking Iron Defense. Orthworm can lean into its hazard setting capabilities by running Stealth Rock and Spikes, taking advantage of Choice item attackers like Mesprit and Grafaiai and accepting its own lack of longevity as a defensive Pokemon. Protect helps Orthworm maximize recovery from Leftovers and scout Choice item attackers like Passimian, Magneton, and Typhlosion. Tera Ghost makes Orthworm more secure against Fighting-type physical attacks like Close Combat from Passimian, Glastrier, and Lycanroc, Body Press from Regirock and opposing Orthworm, and Low Kick from Grafaiai. Tera Ghost also enables Orthworm to block Rapid Spin from Sandslash and Hisuian Avalugg to preserve the entry hazards it sets. Tera Electric leaves Orthworm without weaknesses, so it can more efficiently set hazards and take on physical attackers. Orthworm's EVs are tailored to patch up its lower special bulk to enable it to take on special attackers like Mesprit, Farigiraf, and Whimsicott more comfortably while still giving it enough physical bulk to survive a +2 Low Kick from Grafaiai, Close Combat from Passimian, and 2 Low Kicks from Sneasel.</p> <p>Orthworm is a good fit for bulky offense teams looking for an entry hazard setter, and its limited longevity is a better fit for the playstyle compared to more passive hazard setters like Dudunsparce, Palossand, and Sandaconda. Offensive Pokemon such as Charizard, Jolteon, and Typhlosion adore checks to them like Snorlax and Regirock taking residual damage from Orthworm's entry hazards. Grafaiai, Mesprit, and Hisuian Decidueye commonly run Knock Off, which complements Orthworm's entry hazards by removing Heavy-Duty Boots from Pokemon such as Palossand, Dudunsparce, and Charizard and helping wear them down. Charizard can comfortably take Orthworm's attacks and threaten it out, so Orthworm appreciates support from partners like Snorlax, Floatzel, Lanturn, and Cramorant that can threaten Charizard and other Fire-types like Typhlosion. Hazard removers like Hisuian Decidueye and Cramorant are appreciated by Orthworm because residual damage from Spikes racks up quickly on it and limits its defensive capabilities. Rapid Spin users like Sandslash, Hitmonlee, and Cryogonal remove entry hazards without removing Orthworm's entry hazards. Fighting-types like Hisuian Decidueye, Virizion, and Passimian can overpower Orthworm with their super effective STAB moves, so checks to them such as Mesprit, Oricorio-G, and Weezing are appreciated. Orthworm is a great partner for Pokemon vulnerable to Ground-types such as Lycanroc, Qwilfish, and Jolteon locked into Electric-type moves.</p>"
      },
      "Coil": {}
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Veluza": {"sets": {"Fillet Away Sweeper": {}}},
  "Farigiraf": {"sets": {"Double Dance": {}}},
  "Dudunsparce": {
    "sets": {
      "Coil": {},
      "Calm Mind": {},
      "Specially Defensive": {
        "description": "<p>Specially defensive Dudunsparce is a good defensive Pokemon in ZU, as it has great bulk, reliable recovery in Roost, and several useful utility options. Body Slam is the STAB move of choice, as its high paralysis chance with Serene Grace makes Dudunsparce surprisingly challenging to switch into safely. Dudunsparce is a decent Stealth Rock setter thanks to its bulk giving it opportunities to set up entry hazards and its longevity enabling it to set them up again if they're removed. Dragon Tail allows Dudunsparce to phaze out foes and rack up hazard chip damage. It also prevents Dudunsparce from being setup fodder for Nasty Plot Mesprit, Mismagius, Farigiraf and Calm Mind Dudunsparce unless they Terastallize Fairy. Toxic can be used over either of these moves to let Dudunsparce spread additional status and allows it to pressure Ghost-types such as Mismagius and Oricorio-G on the switch. It is also Dudunsparce's best way to pressure very bulky foes like Articuno, Regirock, and Palossand. Tera Fairy has great synergy with Dudunsparce's Normal typing, as it gives Dudunsparce a Fighting resistance while also equipping it with a generally solid defensive typing. This notably allows it to keep Stealth Rock on the field versus the common Defog Hisuian Decidueye. On the other hand, Tera Dragon powers up Dragon Tail and grants Dudunsparce notable resistances to Water-, Electric-, and Fire-type attacks, letting it match up better into threats such as Charizard, Typhlosion, Floatzel, and Jolteon. However, Floatzel and Jolteon run coverage moves that hit Dragon-types super effectively, so it must be used with caution.</p> <p>This Dudunsparce set fits well onto balance teams due to its longevity as an entry hazard setter and useful defensive profile. Physically defensive teammates such as Regirock, Sandaconda, and Spiritomb appreciate Dudunsparce shoring up their lesser special bulk and can form a solid defensive core with it. These teammates take on strong physical attackers like Snorlax, Hisuian Sneasel, and Braviary for Dudunsparce. Slow offensive teammates such as Glastrier, Magneton, and Clawitzer really appreciate paralysis support as well as Dudunsparce's Dragon Tail racking up hazard damage. Spikes setters such as Qwilfish, Hisuian Qwilfish, and Sandslash are also good teammates in order to maximize Dragon Tail's utility even further. Slower late-game sweepers such as Brute Bonnet, Swords Dance Hisuian Decidueye, and Nasty Plot Mesprit also appreciate the extra chip damage and paralysis support. On the other hand, faster cleaners such as Jolteon, Grafaiai, and Sneasel appreciate Dudunsparce chipping the opponent's team with Dragon Tail and Toxic damage. Dudunsparce's Normal typing doesn't provide it with any resistances and leaves it weak to common Fighting-types such as Hisuian Decidueye, Passimian, and Hisuian Sneasel. Teammates such as Qwilfish, Palossand, and Dipplin can help out against these Fighting-types; Qwilfish deals with Hisuian Decideye and Hisuian Sneasel, while Dipplin and Palossand can help take down Passimian. A special mention also goes to Weezing, which checks all of these Fighting-types and helps to wear them down with Rocky Helmet and burns. It can also set Toxic Spikes, which Dudunsparce can help facilitate with Dragon Tail, and it absorbs attempts to poison Dudunsparce from foes such as Qwilfish and Grafaiai, as Dudunsparce is vulnerable to the status condition. Charizard also threatens Dudunsparce with a status condition, in this case burn from Will-O-Wisp, so teammates such as Naclstack and RestTalk Lanturn can help to fully cover this threat.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Brute Bonnet": {"sets": {"Offensive": {}, "Choice Band": {}}},
  "Dipplin": {
    "comments": "<h3>Other Options</h3> <p>Dipplin's shallow movepool leaves little room for variety. Tera Water eliminates its Ice weakness and defensively answers Floatzel and Glastrier, but it does not fix Dipplin's vulnerability to Articuno's Freeze-Dry and worsens its matchups against Grass-type physical attackers like Hisuian Decidueye, Virizion, and Brute Bonnet that it would otherwise check.</p> <h3>Checks and Counters</h3> <p><strong>Whimsicott</strong>: The Grass / Fairy typing leaves Whimsicott barely scratched by Dipplin's Giga Drain and immune to Dragon Tail. Even without Choice Specs, Whimsicott has a 93.4% chance to 2HKO Dipplin with Moonblast. Even if Dipplin Terastallizes, pivot Whimsicott sets can lock Dipplin into a non-damaging move with Encore and whittle it down.</p> <p><strong>Ice-type Pokemon and Coverage</strong>: Articuno 2HKOes Dipplin with Freeze-Dry, has great bulk and Roost, can remove Dipplin's boosts with Haze or Roar if it Terastallizes, and can PP stall Dipplin with Pressure. Cryogonal has Freeze-Dry, recovery, and Haze similar to Articuno but isn't as bulky. Sneasel, Glastrier, and Hisuian Avalugg overcome Dipplin's massive Defense by exploiting its 4x Ice weakness, but Dipplin Terastallizing sours their positive matchups against it. Frosmoth OHKOes Dipplin with Ice Beam and can still overpower it even if it Terastallizes thanks to its high Special Attack. Choice Band Floatzel 2HKOes Dipplin with Ice Spinner.</p> <p><strong>Flying-types</strong>: Charizard 2HKOes Dipplin with Hurricane and can switch in while Dipplin uses Growth, Recover, or Giga Drain. The Oricorio formes similarly 2HKO Dipplin with Hurricane, threaten to set up on Dipplin with Quiver Dance, and can Taunt Dipplin. Braviary can use Bulk Up and Brave Bird to power through Dipplin while avoiding Dragon Tail with Substitute. Uninvested Cramorant has a 49.2% chance to 2HKO Dipplin with Hurricane. Dodrio can cut through Dipplin's physical bulk if it gains a Swords Dance boost.</p> <p><strong>Strong Special Attackers</strong>: Choice Specs Jolteon 2HKOes Dipplin with Alluring Voice. Shaymin can exploit the Special Defense drops from Seed Flare and one of its coverage moves to break through Dipplin, and it has the bulk to take boosted hits from Dipplin. Alolan Exeggutor takes a big chunk of damage from Dragon Tail but can switch in on Recover, Growth, or Giga Drain and exploit the negative priority of Dragon Tail to blow Dipplin away with Draco Meteor. Vikavolt 2HKOes Dipplin with Bug Buzz and can comfortably take attacks from Dipplin. Clawitzer must be wary of Giga Drain but has a 68.8% chance to OHKO Dipplin with a Choice Specs-boosted Dragon Pulse.</p> <p><strong>Tera Fairy Users</strong>: Dipplin's dependence on Dragon Tail to phaze setup sweepers makes it setup fodder for Tera Fairy users like Nasty Plot Mesprit, Calm Mind Jolteon, and Mismagius. Coil Dudunsparce has a harder time breaking through Dipplin compared to Calm Mind users but can phaze Dipplin with Dragon Tail or fish for poison with Poison Jab to wear it down. Snorlax must fish for paralysis with Body Slam but can overcome Dipplin in the long run with luck.</p> <p><strong>Residual Damage</strong>: Dipplin relies on its Eviolite for its bulk and is vulnerable to damaging entry hazards, which force it to use its limited Recover more often and become more passive. Toxic from Dudunsparce, Hisuian Qwilfish, and Qwilfish puts Dipplin on a timer and prevents it from gaining enough boosts to sweep. Even burns from switching into ideal foes like Palossand hurt Dipplin's longevity and dampen the power of its Dagon Tail. Weezing can fish for a poison on Dipplin with Sludge Bomb, burn it with Will-O-Wisp, and wash away its boosts with Haze.</p> <p><strong>Haze and Phazing</strong>: Weezing and Muk can wipe Dipplin's boosts with Haze and threaten it with their Poison-type STAB moves, and they have the bulk to take even boosted hits from Dipplin. Dudunsparce can phaze Dipplin first with Dragon Tail before getting phazed itself.</p> <p><strong>Encore</strong>: Sableye can switch in as Dipplin sets up and lock it into a non-damaging move like Growth or Recover. Even if Dipplin Terastallizes to improve its matchups against them, Mesprit and Grafaiai can still disrupt it.</p>",
    "sets": {
      "Growth": {
        "description": "<p>Dipplin is a fantastic check to physical attackers like Hisuian Decidueye, Regirock, and Passimian thanks to its substantial physical bulk and ability to absorb Knock Off. Dipplin's walling capabilities give it many opportunities to set up Growth against passive or ineffective foes like Sandaconda and Brute Bonnet to function as a bulky sweeper. Dragon Tail phazes setup sweepers that might try to break through Dipplin such as Snorlax, Virizion, and Calm Mind Dudunsparce. Giga Drain keeps Dipplin healthy as it attacks to make it less reliant on Recover to quickly devour Pokemon weak to Grass like Regirock, Palossand, and Sandaconda. Sticky Hold distinguishes Dipplin from other NFE Pokemon dependent on their Eviolite such as Rhydon and Porygon2 by protecting Dipplin from Knock Off, Switcheroo, and Trick from users like Grafaiai and Mesprit. Tera Poison improves Dipplin's matchups against Fighting-types like Hisuian Sneasel, allowing it to maintain good matchups against Poison-types like Grafaiai and Hisuian Qwilfish as well as an immunity to poison at the cost of vulnerability to Mesprit and Farigiraf. Tera Fairy protects Dipplin from Dragon Tail users like Coil Dudunsparce and opposing Dipplin, and it improves Dipplin's vulnerability to Alolan Exeggutor and Appletun. Tera Steel turns the tables against checks like Glastrier, Sneasel, and Tera Fairy Mesprit and protects Dipplin from poison from Grafaiai, the Qwilfish formes, and Muk at the cost of worsening its matchups against Fighting-types.</p> <p>Dipplin's capability to absorb Knock Off makes it a great partner to Pokemon that are reliant on their items, including Articuno, Regirock, and Hisuian Qwilfish. Snorlax is an excellent partner to handle threats to Dipplin like Articuno, Typhlosion, and Charizard, and Dipplin takes physical attacks and Knock Off from Hisuian Decidueye, Passimian, and Lycanroc for Snorlax in return. Dipplin amplifies residual damage from entry hazard stacking thanks to Dragon Tail, so hazard setters like Hisuian Qwilfish, Orthworm, Qwilfish, and Sandslash have great synergy with Dipplin. Knock Off users like Mesprit, Passimian, and Grafaiai can remove Heavy-Duty Boots from foes to ensure they take damage from entry hazards when Dipplin uses Dragon Tail. Teammates weak to Water and Grass like Regirock, Sandaconda, and Sandslash appreciate Dipplin taking on Floatzel, Brute Bonnet, Lanturn, and Virizion for them. Teammates like Charizard, Typhlosion, and Orthworm can handle special attackers with Fairy- and Ice-type coverage for Dipplin, offensively checking Whimsicott, Frosmoth, and Articuno. Regirock, Naclstack, and Rhydon help Dipplin by defensively answering Flying-types like Dodrio, Charizard, and the Oricorio formes for it. Dipplin is vulnerable to being overwhelmed by chip damage from hazards, so it depends on partners with hazard removal like Cramorant and Sandslash to mitigate this vulnerability.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  }
}