{
  "Chansey": {
    "sets": [
      {
        "name": "Imposter",
        "description": "<p>With Imposter, Chansey transforms into a far bulkier version of the opposing Pokemon, which can be further bolstered by Eviolite. This provides a myriad of benefits, including blanket checking most Pokemon, scouting sets, and PP stalling less threatening foes. While Eviolite is usually the best item, Covert Cloak is useful against Nuzzle and Spirit Shackle users. The given moves offer the most utility in the rare situations Chansey is not transformed, like phazing Substitute users, pivoting, and acting as a cleric. Offensive threats such as Palkia-O and Miraidon appreciate the information Imposter Chansey provides through scouting. Imposter Chansey appreciates slow pivoting from Pokemon like Dondozo and RegenVest Ting-Lu for safe scouting; these Pokemon can also provide Knock Off support, aiding against Judgment users like Miraidon that can otherwise defeat Imposter Chansey. Tera Normal gives Chansey a STAB boost on Judgment, improving its matchup into Pokemon like Miraidon, while Tera Fire and Tera Ghost are useful against V-create users and trapping moves, respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 338877, "username": "TTTech"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 355040, "username": "Chessking345"}]}
  },
  "Slaking": {
    "sets": [
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Slaking is a reliable physical wall that can both deal damage and spread status. Body Slam threatens many physical attackers such as Groudon and opposing Slaking with paralysis. Toxic punishes Arceus-Ghost for switching in and using Slaking as setup fodder, whereas Ceaseless Edge allows Slaking to support its teammates and provides more instant damage than Toxic, which benefits teammates like Choice Band Groudon. Knock Off removes items like Covert Cloak and Rocky Helmet to more freely use Body Slam against targets like support Arceus formes and Groudon; alternatively, Victory Dance allows Slaking to outrun and threaten Palkia-O, Miraidon, and Koraidon. Covert Cloak blocks Nuzzle paralysis from Pokemon like RegenVest users. Fur Coat Slaking's best fit is on balance teams that want a reliable, non-passive Fur Coat wall without giving up the Arceus slot. Teammates like Gorilla Tactics Groudon enjoy Slaking's presence, as Knock Off ensures opposing walls' bulk is stretched even thinner. Imposter-proof Knock Off variants with Arceus-Ghost, though Slaking can trade paralysis with the Imposter user in a pinch; Imposter-proof Toxic variants with Covert Cloak Cotviknight.</p> "
      },
      {
        "name": "Population Bomb",
        "description": "<p>Population Bomb Slaking is a terrifying wallbreaker thanks to Population Bomb's huge damage output, crushing even resistant targets like Hisuian Goodra and Dialga-O. Magic Guard negates chip damage from entry hazards and Rocky Helmet, the latter of which will almost always KO Slaking if using Population Bomb. With Magic Guard, Tidy Up + Wide Lens makes Slaking a reliable source of entry hazard removal while also allowing it to outrun Eternatus and Miraidon, whereas Coil + Life Orb offers higher damage. Flame Orb + Guts blocks crippling burns at the cost of forcing Coil and either itself or an ally into using Knock Off. V-create offers a more immediate damaging option against opposing Steel-types, notably OHKOing Zacian-C unboosted; alternatively, Wicked Blow deals heavy damage to Ghost-types like Arceus-Ghost and Giratina, and Toxic allows Slaking to wear them down in the long run while also dissuading Imposter users from switching in. Population Bomb Slaking best fits on bulky offense teams that can wear down Slaking's hardest checks like Arceus-Ghost and Prankster Giratina. A Spooky Plate Imposter user is recommended to turn the tables on Fur Coat Arceus-Ghost, although Hoopa-U can fit the bill on more offensive teams. Imposter-proof Slaking with a Giratina or Fur Coat Arceus-Ghost.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 338877, "username": "TTTech"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}]}
  },
  "Dondozo": {
    "sets": [
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Dondozo is a great defensive Pokemon with its high physical bulk and typing, which allows it to wall physical attackers such as Slaking and Groudon. Spikes supports offensive teammates, while Haze stops foes like Tidy Up Groudon and Slaking from setting up. Knock Off removes items such as Covert Cloak and Leftovers, and Scald burns provide chip damage on foes. Flip Turn makes it easier to pivot into offensive teammates such as Miraidon, since Taunt, Dark-types, and Magic Bounce don't block it; alternatively, Parting Shot makes the foe easier to handle for Dondozo's teammates, but it's stopped by Taunt and Good as Gold. Heavy-Duty Boots, notably eases Dondozo's pivoting, while Rocky Helmet punishes contact moves such as U-turn and V-create. Covert Cloak protects against secondary effects like confusion from Magical Torque and burns from Scald. Tera Fire allows Dondozo to resist Magical Torque and Grass-type moves from Arceus-Fire, and it maintains Dondozo's resistance to Fire-type moves such as V-create. Dondozo appreciates defensive teammates with typing synergy such as RegenVest Ting-Lu, which helps protect Dondozo from threatening Pokemon such as Miraidon.</p> "
      },
      {
        "name": "Prankster",
        "description": "<p>Prankster Dondozo with Haze can reliably check physical setup sweepers such as Slaking and Groudon thanks to its huge physical bulk. Entrainment forces out Pokemon dependent on their abilities, Encore can lock foes into unfavorable moves such as setup moves or V-create, and Glare debilitates fast attackers such as Koraidon and Palkia-O. Parting Shot allows Dondozo to maintain momentum against opposing threats such as Miraidon with its priority pivoting and attack stat reduction, making it easier for teammates such as Ting-Lu to take hits from them; alternatively, Flip Turn provides a pivoting option unaffected by Taunt, Dark-types, and Magic Bounce. Heavy-Duty Boots, notably eases Dondozo's pivoting, while Covert Cloak protects it from status conditions from moves such as Nuzzle, Mortal Spin, and Magical Torque. Tera Fire improves Dondozo's matchup against Arceus-Fire with Grass-type coverage and lets it resist V-create and Magical Torque, whereas Tera Dark makes Dondozo immune to status moves from other Prankster users and improves its matchup against Ghost- and Dark-types. RegenVest Hisuian Goodra, Ting-Lu, and Fur Coat users synergize with Dondozo, covering threats such as Miraidon, Groudon, and Palkia-O.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 338877, "username": "TTTech"}]}
  },
  "Flutter Mane": {"sets": [{"name": "Pixilate"}]},
  "Ting-Lu": {
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>RegenVest Ting-Lu is a reliable special wall and a premier Miraidon check. Regenerator gives Ting-Lu reliable recovery without conflicting with Assault Vest. Nuzzle discourages dangerous attackers like Zacian-C and Palkia-O from switching in. U-turn allows Ting-Lu to safely bring in teammates thanks to its low Speed. Ceaseless Edge forces chip damage on foes, letting offensive teammates wallbreak more easily. Knock Off removes items like Heavy-Duty Boots and Covert Cloak, making Ting-Lu's own utility more effective; it also punishes Imposter users attempting to gain Regenerator. Ting-Lu fits best on balance teams, which appreciate its ability to spread paralysis and safely bring in teammates thanks to its huge bulk. Dangerous wallbreakers like Miraidon, Zacian-C, and Palkia-O help maximize the effectiveness of U-turn pivoting. Ting-Lu is unable to naturally check Palkia-O and Quiver Dance Arceus-Water, so a teammate that helps shore up this weakness, such as Arceus-Grass or Hisuian Goodra, is appreciated. Tera Fairy provides an immunity to Dragon, allowing Ting-Lu to block Dragon Energy from Palkia-O and Choice Specs Miraidon; alternatively, Tera Grass provides a Water resistance, covering for Palkia-O's Water Spout and coverage from Miraidon.</p> "
      },
      {"name": "Prankster"},
      {"name": "Magic Bounce"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 338877, "username": "TTTech"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}]}
  },
  "Koraidon": {"sets": [{"name": "Gorilla Tactics"}]},
  "Miraidon": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Miraidon is a fierce wallbreaker that can reliably threaten nearly the entire tier with its lethal offensive typing. Volt Switch helps maintain momentum and can scout opposing Terastallization. Trick ruins Ice Scales users like Hisuian Goodra and Arceus-Grass lacking a held Plate, and Steam Eruption threatens burns and targets Ground-types like Ting-Lu and Clodsire; Grass Knot hits many of the same targets but makes Miraidon easier to Imposter-proof. Miraidon's massive damage potential and ability to break down defensive cores makes it an excellent fit on offense. Palkia-O and Final Gambit Eternatus make good partners, as they can help remove Ground-types and weaken special walls with Dragon Energy. Terastallizing into one of its original types is useful to supercharge Miraidon's damage output; however, Tera Steel can be useful to get a surprise KO on Zacian-C, and Tera Fairy is useful for blanking an Imposter user's Dragon Energy. Imposter-proofing is generally done with a specially defensive Ground-type teammate like Ting-Lu or Groudon.</p> "
      },
      {
        "name": "Setup Sweeper",
        "description": "<p>Miraidon's typing and good stats make it a potent setup sweeper. Nasty Plot provides higher immediate power, whereas Quiver Dance makes setting up easier, enables the use of a Modest nature, and allows Miraidon to outspeed and threaten Zacian-C. Draco Plate + Judgment is used so Miraidon can fully self Imposter-proof, in addition to being usable at low HP, unlike Dragon Energy. Miraidon's best fit is on bulky teams that appreciate its instant damage output, potential to sweep, on top of its innate self-Imposter-proofing and good matchup into common Prankster users. Teammates that can help destroy Ice Scales users, such as Final Gambit Eternatus and Pixilate Enamorus are appreciated. Miraidon should be careful when Terastallizing, as this removes its 4x Electric-type resistance and makes it more vulnerable to being PP stalled by Imposter; however, Tera Electric or Tera Dragon are useful for damage output, and Nasty Plot sets enjoy having Tera Steel for Zacian-C.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 445464, "username": "augustakira"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}]}
  }
}