{
  "Dragonite": {"sets": [{"name": "Dragon Dance"}, {"name": "Choice Band"}]},
  "Blissey": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>With Ice Scales, Blissey is a titanic special wall that checks prominent attackers like Gholdengo and Iron Bundle; Good as Gold is an alternative to stop Taunt and Pain Split users like Flutter Mane, which otherwise take advantage of Blissey. Thunder Wave lets Blissey cripple foes such as Corviknight and Kingambit, which could otherwise switch into it free of charge, while Calm Mind helps Blissey keep up with foes like Nasty Plot Gholdengo, ensuring they do not break past it. Shadow Ball lets Blissey hit Ghost-types like Flutter Mane, Dragapult, and Gholdengo, denying them setup opportunities. Heavy-Duty Boots is preferred to avoid entry hazard chip damage from repeated switch-ins, but Leftovers provides passive recovery. Physically defensive teammates like Fur Coat Avalugg and Flogres help cover the physical attackers that threaten Blissey, like Aerilate Dragonite and Dragon Rush Dragapult. Slow but powerful wallbreakers such as Slither Wing and Ceruledge appreciate Blissey paralyzing offensive foes, giving them more chances to wallbreak.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Garchomp": {"sets": [{"name": "Entry Hazard Setter", "description": "<p>A spread of 252 HP / 4 Def / 252 SpD should be used with Ice Scales to be a specially defensive wall.</p> "}]},
  "Hippowdon": {"sets": [{"name": "Fur Coat"}]},
  "Volcarona": {"sets": [{"name": "Physically Defensive"}, {"name": "Fast Support"}]},
  "Florges": {"sets": [{"name": "Defensive", "description": "<p>An EV spread of 252 HP / 252 Def / 4 SpD should be used on Fur Coat variants.</p> "}]},
  "Avalugg": {"sets": [{"name": "Fur Coat"}]},
  "Noivern": {"sets": [{"name": "Choice Specs"}, {"name": "Super Fang"}]},
  "Toxapex": {"sets": [{"name": "Ice Scales"}]},
  "Palossand": {"sets": [{"name": "Fur Coat"}]},
  "Corviknight": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Ice Scales Corviknight is a premier specially defensive pivot that can check prominent special attackers like Flutter Mane, Iron Bundle, and Dragapult with its immense bulk and great typing while also providing entry hazard removal. Brave Bird is Corviknight's most consistent attack and 2HKOes or 3HKOes most special attackers, whereas Iron Head OHKOes Flutter Mane and avoids recoil. Defog provides entry hazard control, which is very crucial for teams facing hazard-stacking threats like Ting-Lu and Garchomp, while U-turn provides slow pivoting support for offensive teammates. As a result, frail pokemon such as Dragapult, Iron Bundle, and Iron Moth are great teammates, as they appreciate Corviknight's ability to get them in safely. Ice Scales Corviknight struggles against strong physical attackers, so pairing it with a strong physical wall like Avalugg or Hippowdon is recommended. Even with Ice Scales, Corviknight can be susceptible to strong special attacking Fire-types like Chi-Yu and Iron Moth, so Regenerator Garchomp and Ting-Lu make good teammates. Corviknight is prone to having its Defog blocked by Good as Gold, so it's strongly recommended for it to be paired with spinners such as Great Tusk that can remove entry hazards if Corviknight is unable to.</p> "
      },
      {"name": "Physically Defensive", "description": "<p>Making use of Fur Coat to bolster its high Defense and good defensive typing, Corviknight serves as a strong physical wall that can switch into threatening attackers like non-Mold Breaker Great Tusk and Kingambit, and is a Defogger that isn't threatened by common entry hazard setters like Garchomp and Clodsire. U-turn and minimum Speed allow Corviknight to act as a slow pivot, safely bringing in offensive teammates like Volcarona and Dragonite. Corviknight's average Special Defense means that it has a hard time against special attackers, so it benefits from specially defensive teammates like Florges and Blissey. Corviknight also struggles to meaningfully damage Rock- and Steel-type foes like Garganacl and Iron Treads, so teammates like Iron Bundle and Chi-Yu that can handle these Pokemon are appreciated.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 475288, "username": "Tranquility"}, {"user_id": 439018, "username": "Theia"}]}
  },
  "Dragapult": {
    "sets": [
      {"name": "Sheer Force + Life Orb", "description": "<p>Sheer Force + Life Orb Dragapult, in addition to being the fastest unboosted threat in the metagame, is one of the few credible mixed attackers, making it great for picking apart Fur Coat + Ice Scales defensive cores. Dragon Rush nails common specially defensive walls like Blissey and Ice Scales Clodsire and Garganacl while Thunderbolt beats bulky Waters like Toxapex. Fire Blast hits Steel-types like Corviknight and Iron Treads, while Will-O-Wisp punishes switch-ins Dragapult cannot reliably overwhelm like Ting-Lu. Dragapult pairs extremely well with pivots like Corviknight, Slither Wing, and Slowking, as they can get it on the field in advantageous positions where it can fire off Shadow Ball. Dragapult does struggle against bulky foes it cannot hit super effectively like Florges, so a secondary, more dedicated wallbreaker like Kingambit or Great Tusk is recommended.</p> "},
      {
        "name": "Hadron Engine",
        "description": "<p>Choice Specs Hadron Engine Dragapult is a premier wallbreaker and pivot that takes advantage of Electric Terrain to overwhelm common Ice Scales users. Shadow Ball and Draco Meteor provide it with consistent and powerful STAB attacks, respectively. Thunderbolt is a strong coverage move that is also boosted by Electric Terrain, denting RegenVest Kingambit and giving Dragapult a chance to 2HKO Ice Scales Corviknight and Toxapex after Stealth Rock. Strong physical attackers like Great Tusk and Iron Valiant pair well with Dragapult, which brings them in with U-turn on Pokemon they can threaten out, such as Blissey and Iron Treads. In return, Dragapult breaks through Fur Coat users like Hippodown and Corviknight for them. Dragapult is forced out by priority users such as Aerilate Dragonite and Triage Flutter Mane, so Pokemon that can switch into them like Gholdengo and Clodsire are recommended. Dragapult pairs well with defensive pivots like Corviknight and Iron Hands that can safely bring it onto the field to outspeed and threaten a majority of offensive threats, such as Flutter Mane and Chein-Pao. Entry hazards setters like Ting-Lu and Palossand can set Spikes and Stealth Rock, respectively, which helps Dragapult break past switch-ins like Kingambit more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}, {"user_id": 450411, "username": "Atha"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}, {"user_id": 414072, "username": "Heracross2.0"}]}
  },
  "Skeledirge": {
    "sets": [
      {
        "name": "Good as Gold",
        "description": "<p>Good as Gold Skeledirge's great bulk, typing, and movepool make it a decent deterrent to entry hazard removal and excellent status spreader. Will-O-Wisp + Hex spreads chip damage, neuters physical attackers, and gives Skeledirge the most firepower; Roar + Shadow Ball is a more consistent alternative that deters setup and racks up entry hazard chip. Teammates that can reliably set entry hazards long-term such as Fur Coat or Regenerator Garchomp and Regenerator Ting-Lu are great partners, as they greatly appreciate Skeledirge's ability to deter hazard-removing attempts. Pokemon that check the likes of Flutter Mane and Iron Bundle such as Ice Scales Corviknight and specially defensive Desolate Land Volcarona make for great defensive partners alongside Skeledirge. Strong wallbreakers such as Great Tusk, Iron Bundle, Iron Valiant, and Flutter Mane appreciate Skeledirge’s ability to keep entry hazards up by preventing Corviknight's Defog—and potentially risk a spinblock against Great Tusk and Iron Treads—allowing them to further pressure the opposing team. 12 Speed EVs let Skeledirge outspeed and either damage or burn Corviknight.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 560990, "username": "BugGoBrrrrrr"}]}
  },
  "Quaquaval": {"sets": [{"name": "Making Waves"}, {"name": "Choice Band"}]},
  "Garganacl": {"sets": [{"name": "Fur Coat"}, {"name": "Ice Scales"}]},
  "Armarouge": {"sets": [{"name": "Choice Scarf"}]},
  "Ceruledge": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Item"}]},
  "Tinkaton": {"sets": [{"name": "RegenVest"}, {"name": "Stealth Rock"}]},
  "Cyclizar": {
    "sets": [
      {
        "name": "Shed Tail",
        "description": "<p>Shed Tail, Regenerator, and good Speed give Cyclizar a unique role on offensive teams: safely bringing in powerful attackers like Flutter Mane, Iron Valiant, and Dragonite multiple times per battle. Draco Meteor KOes opposing Dragapult and Cyclizar and picks off weakened foes. U-turn lets Cyclizar pivot out without self-damage, healing from Regenerator to potentially use Shed Tail again later. Rapid Spin and/or Knock Off provide further utility. Choice Scarf + Shed Tail is preferred against Flutter Mane, Iron Bundle, Dragapult, and other fast threats, but Heavy-Duty Boots can be used to avoid entry hazard damage and the Choice lock. On Choice Scarf sets, 24 Special Attack EVs are enough to OHKO Dragapult with Draco Meteor. Cyclizar benefits greatly from a strong physical wall or Dazzling user to deal with priority attackers like Dragonite; strong attackers like Flutter Mane and Iron Valiant are valuable for dealing with phazers like Iron Hands and Hippowdon, or a Good as Gold user like Skeledirge or Gholdengo can block phazing moves outright.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 546606, "username": "Tanny89k"}]}
  },
  "Clodsire": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>With huge HP and Special Defense stats, Clodsire makes use of Ice Scales to serve as a strong special wall, or it can instead function as a versatile support Pokemon that utilizes Prankster to cripple opposing Pokemon and deter setup. Toxic allows Clodsire to wear down opposing walls, while Toxic Spikes punishes switching and and cripples pivoting foes; Poison Jab is a final option to hit Noivern and still spread status. Spikes and Stealth Rock are both good options for additional entry hazards, with Spikes damage stacking with Toxic Spikes poison and Stealth Rock punishing Flying-types switching into Clodsire. Haze is another option that lets Clodsire stop threatening setup sweepers like Volcarona and Flutter Mane, though it should almost always be run on Prankster variants. Frail offensive teammates like Iron Bundle and Iron Valiant appreciate Clodsire's ability to soak up strong special attacks, and Clodsire appreciates them taking out foes it's too passive to handle on its own. Clodsire also has below average Defense, so it benefits from being paired with physically defensive teammates like Fur Coat Corviknight and Avalugg.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 439018, "username": "Theia"}]}
  },
  "Kingambit": {"sets": [{"name": "Swords Dance"}]},
  "Great Tusk": {
    "sets": [
      {"name": "Defensive Spinner", "description": "<p>Rapid Spin, Knock Off, and great physical bulk make Great Tusk a fantastic utility spinner. It can check dangerous physical attackers such as Ceruledge, Slither Wing, Kingambit, and Roaring Moon and retaliate with its beefy Earthquake and Body Press. It matches up well against common entry hazard setters like Garganacl and Clodsire, and it threatens spinblockers with Knock Off; Knock Off also augments its teammates' entry hazards by removing Heavy-Duty Boots. Leftovers gives it much needed recovery—especially alongside Regenerator—but Heavy-Duty Boots prevents it from being overwhelmed by the entry hazards it must remove. Teammates such as Blissey and Slowking can cover opposing special attackers that target Great Tusk's lower Special Defense. In return, they appreciate Great Tusk dealing with physical attackers like opposing Great Tusk.</p> "},
      {"name": "Wallbreaker", "description": "<p>Choice Band Great Tusk is a dangerous wallbreaker thanks to its high-powered STAB moves and Mold Breaker to bypass Fur Coat. Knock Off has no immunities, unlike both STAB options, and removes key items like Leftovers from Corviknight. Ice Spinner breaks through defensive Dragonite and Garchomp with a clean OHKO. Fast specially offensive pivots like Iron Bundle, Dragapult, and Noivern can bring Great Tusk in safely to pressure their specially defensive switch-ins like Toxapex, Clodsire, and Blissey. Defensive pivots such as Corviknight and RegenVest Iron Hands are also good options, as they can switch into faster threats like Flutter Mane and Iron Moth, respectively, which force Great Tusk out. Dragonite and Ceruledge appreciate Great Tusk wallbreaking early-game by threatening Fur Coat users like Corviknight and Garganacl, which lets them clean up late-game more easily.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Scream Tail": {"sets": [{"name": "Pixilate", "description": "<p>A more offensive EV spread with 4 Def / 252 SpA / 252 Spe can be used, but has a harder time setting up with Calm Mind.</p> "}, {"name": "Defensive"}]},
  "Flutter Mane": {
    "sets": [
      {"name": "Sheer Force Life Orb"},
      {
        "name": "Choice Specs Wallbreaker",
        "description": "<p>Choice Specs Flutter Mane is a dangerous wallbreaker and late-game cleaner. Hadron Engine allows Flutter Mane to OHKO specially frail targets like Chi-Yu and physically defensive Hippowdon, and it notably allows Thunderbolt to 2HKO Ice Scales Corviknight. Mold Breaker ignores Ice Scales on walls like Garganacl and Ting-Lu, allowing Flutter Mane to 2HKO them without needing to predict with Thunderbolt. This comes at the cost of raw power, however, which can be particularly detrimental against RegenVest users like Iron Treads. Psyshock hits Chansey and Blissey on their weaker Defense, on top of hitting Clodsire super effectively; alternatively, Mystical Fire hits Steel-types like Iron Treads. Flutter Mane best fits on balance and offense teams that create multiple opportunities for it to come in and cause damage. Defensive pivots like Iron Treads and Corviknight excel at giving Flutter Mane wallbreaking chances, and they can also switch in on faster threats like Dragapult and opposing Flutter Mane. Flutter Mane can struggle to break dedicated special walls, such as Ice Scales Blissey, so mixed attacking teammates like Sheer Force Iron Valiant can support it well.</p> "
      },
      {"name": "Queenly Majesty", "description": "<p>Queenly Majesty Flutter Mane is a fast and powerful cleaner that reliably revenge kills Dragapult, Iron Bundle, and Aerilate Dragonite. Mystical Fire hits Steel-types like Iron Treads, Thunderbolt is its strongest option against Corviknight and Toxapex, Psyshock does passable damage to Clodsire, and Hex is its strongest move if its teammates can reliably inflict status. Teammates that are susceptible to priority such as Iron Moth and Chien-Pao appreciate Flutter Mane's ability to pick off priority users and allow them to be more dangerous to opposing teams. Flutter Mane appreciates being brought in by a slow pivot like Corviknight or Chilly Reception Slowking. Flutter Mane can also struggle to break through specially defensive walls such as Ice Scales Corviknight, so pairing it with a strong physical attacker like Great Tusk or Iron Valiant is recommended.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 450411, "username": "Atha"}, {"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 475288, "username": "Tranquility"}]}
  },
  "Slither Wing": {
    "sets": [
      {"name": "Choice Band"},
      {"name": "Pivot", "description": "<p>Good natural bulk, useful defensive typing, and an excellent support movepool make Slither Wing a good mixed defense pivot that repeatedly pivots and most notably switches into Ground-types like Great Tusk. Regenerator makes the most of its pivoting ability, but Fur Coat and Unaware are options for greater bulk or deterring setup, respectively. Will-O-Wisp allows it to punish switch-ins like Iron Valiant and Iron Hands with a burn. Its massive Attack allows it to use STAB U-turn to maintain momentum while bringing in more offensive teammates like Chi-Yu and Iron Bundle. Even with investment, Slither Wing struggles to check certain physical attackers like Ceruledge and Dragonite, so Pokemon like Fur Coat Garganacl and Corviknight make good teammates. Slither Wing also has difficulty against Fairy- and Flying-types like Scream Tail and Noivern, so it appreciates teammates like Iron Moth and Garganacl that are able to handle them.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 439018, "username": "Theia"}]}
  },
  "Sandy Shocks": {"sets": [{"name": "Hadron Engine"}]},
  "Iron Treads": {
    "sets": [{"name": "Regenerator Pivot", "description": "<p>RegenVest Iron Treads is a great specially defensive pivot and spinner. It is able to switch into prominent special attackers such as Gholdengo and Flutter Mane and threaten them out. Knock Off removes key items like Heavy-Duty Boots and deters spinblockers from switching in, and Volt Switch has excellent synergy with Regenerator. If its teammates already provide adequate entry hazard control, Iron Head and Ice Spinner are options to target Flutter Mane and Dragonite, respectively. A Sassy nature with minimum Speed investment ensures the slowest possible pivot with Volt Switch. Iron Treads appreciates physically defensive teammates like Fur Coat Slowking, which can form a VoltTurn core to bring in powerful-but-frail teammates like Iron Bundle and Dragapult.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 220859, "username": "Giagantic"}]}
  },
  "Iron Bundle": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Iron Bundle is a terrifying wallbreaker with incredible Speed and unresisted STAB coverage. Primordial Sea counters Desolate Land and allows Hydro Pump to OHKO most non-Ice Scales foes, while Mold Breaker breaks through walls like Ice Scales Corviknight. For the last slot, U-turn is used to pivot against Water-immune foes like Desolate Land Volcarona, while Flip Turn hits Pokemon like Ice Scales Blissey and Corviknight harder. Defensive pivots such as Corviknight help Iron Bundle safely switch into and pressure threats like Flutter Mane and Iron Moth. Strong physical attackers like Baxcalibur and Great Tusk are also good teammates, as Iron Bundle often forces in specially defensive walls that these Pokemon can threaten; Rapid Spin Great Tusk can also double as entry hazard removal. Pokemon who can set entry hazards like Ting-Lu and Garchomp are great partners for Iron Bundle, as they help it wear down its checks faster.</p> "
      },
      {"name": "Magic Guard Disrupter"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  },
  "Iron Hands": {
    "sets": [
      {"name": "RegenVest"},
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Iron Hands uses its titanic bulk to check prominent attackers like Ceruledge and Kingambit while its solid Attack and Swords Dance prevent it from being passive. Drain Punch provides much-needed recovery as well as threatens Pokemon like Blissey and Cyclizar. Thunder Punch hits Fighting-resistant foes like Iron Moth and Flutter Mane, while Ice Punch covers Pokemon like Dragonite and Garchomp. Earthquake provides coverage for Pokemon like Clodsire that Iron Hands would otherwise struggle against. Iron Hands can also use Volt Switch alongside its low Speed to serve as a bulky slow pivot to safely bring in frail offensive teammates like Flutter Mane and Iron Bundle. Because of its below average Special Defense, Iron Hands pairs well with specially defensive teammates like Blissey and Ice Scales Corviknight. Iron Hands also struggles against Fairy-types like Iron Valiant and Scream Tail, so it appreciates teammates like Gholdengo and Iron Moth that can take them on.</p> "
      },
      {
        "name": "Triage",
        "description": "<p>Iron Hand is the premier Belly Drum + Triage user thanks to its excellent bulk, Attack and STAB Drain Punch. With a free turn of setup, it can sweep frailer teams or clean up weakened balance teams. Ice Punch is a good coverage move to deal with threats such as Great Tusk and Hippowdon that otherwise can check it, while Earthquake is another coverage option that can better deal with Fur Coat Gholdengo. The 132 Speed EVs outpace Skeledirge, which would otherwise check Iron Hands with Will-O-Wisp. Frailer offensive teammates such as Iron Moth and Flutter Mane appreciate Iron Hands's ability to break through their common checks such as Garganacl and Ice Scales Corviknight. Iron Hands appreciates being brought in safely by slow pivots like Corviknight or by Shed Tail Cyclizar. Iron Hands can also have a tough time dealing with Fur Coat and Unaware walls like Hippowdon, so pairing it with a strong special attacker like Iron Bundle to deal with them is recommended.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 439018, "username": "Theia"}, {"user_id": 475288, "username": "Tranquility"}]}
  },
  "Iron Moth": {
    "sets": [
      {"name": "Offensive", "description": "<p>Iron Moth is a powerful special attacker that also provides good defensive utility thanks to Desolate Land and Morning Sun. Its near-unique offensive typing lets it threaten common walls like Ice Scales Corviknight and Scream Tail, especially when boosted by sun. U-turn can be used to maintain momentum against predicted switch-ins like Garchomp and Garganacl, while Toxic Spikes punishes switch-ins with status. Iron Moth complements Ice Scales Corviknight and Clodsire, as it covers their vulnerability to Iron Bundle. Pokemon like Dragapult, Flutter Mane, and Dragonite appreciate Iron Moth taking advantage of their Steel-type checks like Corviknight.</p> "},
      {
        "name": "Specially Defensive",
        "description": "<p>Specially defensive Iron Moth uses its solid bulk, good defensive typing, and sun-boosted Morning Sun to consistently check foes like Iron Bundle, Volcarona, and some Iron Valiant variants. It's not entirely passive either, as the boosts from Fiery Dance under sun allow it to eventually overwhelm passive foes like Blissey, Scream Tail, and Florges. U-turn lets it gain momentum by pivoting out safely, and Toxic Spikes punishes grounded foes like Garganacl, Ting-Lu, and Iron Hands. Due to its devastating Ground weakness, Ground-immune Pokemon like Corviknight and Dragonite make good pairings with it. Iron Moth works well with wallbreakers like Great Tusk and Iron Bundle, as they appreciate being given free entry to threaten its switch-ins like Clodsire, Ting-Lu, and Garganacl. Iron Moth is a great complement to common special walls like Ice Scales Corviknight and Clodsire, as it covers several of their weaknesses like Iron Bundle and Volcarona.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 375662, "username": "Isaiah"}, {"user_id": 450411, "username": "Atha"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 521275, "username": "The Dragon Master"}, {"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Baxcalibur": {"sets": [{"name": "Setup Sweeper"}, {"name": "Wallbreaker"}]},
  "Gholdengo": {
    "sets": [
      {
        "name": "Defensive Nasty Plot",
        "description": "<p>Gholdengo's incredible typing, great stats, and setup potential make it a potent wincon with plenty of defensive utility. With Fur Coat-boosted bulk or the immunity granted by Earth Eater or Well-Baked Body, Gholdengo can switch into foes like Aerilate Dragonite, Iron Moth, and Clodsire and can set up with Nasty Plot to wallbreak. Earth Eater and Well-Baked Body may also surprise the opponent, allowing Gholdengo to set up in key situations and gain a winning advantage. Alternatively, a set with Hex + Thunder Wave + Substitute lets Gholdengo make the most of advantageous situations and avoid having to switch out as often. To dually punish switches and remain healthy, Gholdengo should be paired with teammates that can set entry hazards and provide Defog support, like Ting-Lu and Ice Scales Corviknight, respectively. For immediate power, wallbreakers like Sheer Force Dragapult and Iron Valiant and Choice Band Baxcalibur and Great Tusk are excellent partners. Dragapult and Flutter Mane are notably good partners, as they share the same checks with Gholdengo, forming a core that can overload most special walls.</p> "
      },
      {"name": "Choice Item"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 450411, "username": "Atha"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 375662, "username": "Isaiah"}]}
  },
  "Chien-Pao": {"sets": [{"name": "Choice Band"}]},
  "Ting-Lu": {"sets": [{"name": "Specially Defensive"}]},
  "Chi-Yu": {"sets": [{"name": "Choiced Attacker"}, {"name": "Nasty Plot"}]},
  "Roaring Moon": {"sets": [{"name": "Regenerator"}]},
  "Iron Valiant": {
    "sets": [{"name": "Sheer Force", "description": "<p>Iron Valiant's great offensive stats and wide movepool make it a great Sheer Force wallbreaker. Its coverage is almost perfect: barring the use of abilities that provide an immunity to Iron Valiant's attacks, Corviknight, Skeledirge, Gholdengo, Iron Moth, and Clodsire are all at risk of being OHKOed or 2HKOed after minor chip damage. To more reliably defeat Ghost-types, Iron Valiant can even run Shadow Ball instead of Thunderbolt or Knock Off over Psychic-type coverage. A Naive nature is used to maximize the amount of targets Iron Valiant outspeeds, such as Iron Moth, Iron Treads, and Garchomp. Iron Valiant fits best on balance teams that appreciate its ability to pave the way for other dangerous attackers like Dragapult and Great Tusk. Iron Valiant appreciates allies that can keep the field clear of entry hazards, such as Corviknight and Avalugg, and also switch in on dangerous priority like Dragonite's Extreme Speed.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}]}
  }
}