{
  "Cloyster": {"sets": [{"name": "Shell Smash"}]},
  "Dragonite": {"sets": [{"name": "Dragon Dance"}, {"name": "Choice Band"}]},
  "Azumarill": {
    "sets": [
      {
        "name": "Belly Drum",
        "description": "<p>Azumarill is a premier Belly Drum sweeper armed with Huge Power, a strong priority move in Jet Punch, which can be pushed to its maximum power with Tera, and wall breaking capabilities with Surging Strikes. Azumarill's Water / Fairy typing frequently gives it safe opportunities to setup Belly Drum against Dragon- and Dark-types such as Roaring Moon and Weavile. Hyper Drill is a neutral coverage move that can hit Toxapex for massive damage and doesn't trigger Baneful Bunker. Other physical attackers like Kingambit and Roaring Moon appreciate Azumarill's ability to break through physically defensive walls such as Ting-Lu and Great Tusk. Azumarill is prone to chip damage from Garchomp or Rocky Helmet Toxapex, so having an attacker that can deal with both like Iron-Valiant is advised. Azumarill also can have a tough time getting in and setting up a Belly Drum, so pairing it with screens support via Grimmsnarl, Shed Tail from Cyclizar, or pivots such as Corviknight is recommended.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 220859, "username": "Giagantic"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 475288, "username": "Tranquility"}]}
  },
  "Scizor": {"sets": [{"name": "Swords Dance"}]},
  "Tyranitar": {"sets": [{"name": "Support"}]},
  "Garchomp": {"sets": [{"name": "Defensive Spiker"}, {"name": "Setup Attacker"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot"}]},
  "Toxapex": {"sets": [{"name": "Physically Defensive Pivot"}, {"name": "RegenVest Pivot"}]},
  "Corviknight": {"sets": [{"name": "Physically Defensive Pivot"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Skeledirge": {"sets": [{"name": "Unaware Wall"}]},
  "Garganacl": {"sets": [{"name": "Specially Defensive Wall"}]},
  "Palafin": {"sets": [{"name": "Taunt + Bulk Up"}]},
  "Cyclizar": {"sets": [{"name": "Shed Tail"}, {"name": "Choice Scarf"}]},
  "Annihilape": {"sets": [{"name": "Bulk Up + Taunt"}, {"name": "Bulk Up + Chesto Berry"}, {"name": "Choice Scarf"}]},
  "Kingambit": {"sets": [{"name": "Swords Dance"}]},
  "Great Tusk": {"sets": [{"name": "Physically Defensive"}]},
  "Slither Wing": {"sets": [{"name": "Choice Band"}]},
  "Iron Treads": {"sets": [{"name": "Offensive Spinner"}]},
  "Iron Hands": {"sets": [{"name": "Swords Dance"}, {"name": "Big Drummer Boy"}]},
  "Gholdengo": {"sets": [{"name": "Defensive Nasty Plot"}, {"name": "Choice Scarf"}]},
  "Ting-Lu": {"sets": [{"name": "Defensive"}]},
  "Roaring Moon": {"sets": [{"name": "Choice Band"}, {"name": "Itemless Acrobatics"}, {"name": "Choice Scarf"}]},
  "Iron Valiant": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Iron Valiant leverages its strong attacks, great typing, and good Speed tier to act as a potent special attacker. Fleur Cannon, its most powerful move, threatens common defensive Pokemon such as Garganacl and Ting-Lu; Moonblast trades power for consistent damage. Vacuum Wave picks off frail, weakened, or faster Pokemon, allowing Iron Valiant to revenge kill Kingambit and Roaring Moon, even after setup. Psyshock pressures specially defensive Pokemon, such as Clodsire, Blissey, and specially defensive Toxapex, while Thunderbolt hits Corviknight and physically defensive Toxapex. Choice Specs Iron Valiant fits best on balance or bulky offense teams that appreciate its immense wallbreaking ability. It pairs well with strong physical attackers such as Roaring Moon and Choice Band Dragonite, as they can work together to pressure each others checks. Entry hazard setters like Garchomp and Great Tusk also make good partners, as they chip Iron Valiant's checks enough for it to beat them. Iron Valiant isn't very bulky, so it appreciates bulky teammates such as Ting-Lu and Garganacl; Ting-Lu can also use Parting Shot to help Iron Valiant enter the field safely. Cyclizar can clear hazards and pivot Iron Valiant in with Shed Tail.</p> "
      },
      {
        "name": "Physical Life Orb",
        "description": "<p>Life Orb Iron Valiant uses its powerful moves and coverage to wallbreak and threaten a large portion of the tier. Triple Arrows threatens most defensive Pokémon, such as Garganacl and Ting-Lu, with its chance to drop Defense and flinch. Zen Headbutt hits Toxapex and Clodsire, which resist Iron Valiant's STAB moves, and Iron Hands, which can be problematic for non-Magical Torque Iron Valiant. Mach Punch revenge kills offensive Pokemon such as Roaring Moon and Kingambit. Knock Off wears down Iron Valiant's checks by removing their Leftovers or Heavy-Duty Boots, while Magical Torque gives it another strong STAB to hit the many Dark- and Fighting-types of the tier, such as Grimmsnarl and Iron Hands, respectively. Life Orb Iron Valiant's lack of longevity makes it fit best on bulky offense teams. It pairs well with defensive pivots who can help it safely switch in, such as Ting-Lu and Corviknight, and entry hazards setters who help it wear down its checks, such as Iron Treads and Great Tusk. Other physical attackers such as Garchomp and Slither Wing make good partners, as together they can overwhelm most defensive cores.</p> "
      },
      {"name": "Choice Band"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 220859, "username": "Giagantic"}, {"user_id": 464398, "username": "LBDC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 525446, "username": "Ducky"}]}
  }
}