{
  "Dugtrio": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Dugtrio is a consistent trapper that distinguishes itself from Gothitelle by being able to revenge kill some premier threats like Koraidon, Miraidon, Chi-Yu, and Iron Bundle. Stone Edge hits Chien-Pao and Iron Bundle for maximum damage. Tera Fairy + Tera Blast allows it to trap and OHKO unboosted Koraidon, Choice Band Chien-Pao that isn't locked into Ice Shard, and weakened offensive Great Tusk and Walking Wake. Additionally, it can dispatch Choice item Koraidon, Walking Wake, and Miraidon locked into Outrage or Draco Meteor. Memento gives setup opportunities to teammates on a trapped Pokemon Dugtrio can't do much against, such as Great Tusk, while Final Gambit trades it for more damage on Iron Bundle, Koraidon, and unboosted Tera Fairy Miraidon. Choice Scarf Dugtrio is used on balance teams but has no defensive utility and fails to beat Double Dance Miraidon, Iron Bundle in Electric Terrain, Swords Dance + Flame Charge Koraidon, and Swords Dance Chien-Pao. Thus, it is crucial to pair it with checks to these threats such as Iron Treads, Clodsire, Toxapex, Alomomola, and Dondozo. Pelipper and Corviknight are solid walls that can also pivot Dugtrio in, establishing opportunities for it to trap Pokemon. Miraidon, Walking Wake, Iron Bundle, Chien Pao, and offensive Great Tusk appreciate Dugtrio getting rid of the Pokemon that check or revenge kill them. Dugtrio can also fit on stall teams since it traps strong threats and prevents them from getting multiple KOs, including Gothitelle, which is a major hindrance to bulkier structures.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pichus", "user_id": 374620}], "teams": [{"name": "Quality checked by", "members": [{"username": "Guard", "user_id": 360582}, {"username": "Fc", "user_id": 511624}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Cloyster": {"sets": [{"name": "Spikes"}]},
  "Tauros-Paldea-Blaze": {"sets": [{"name": "Defensive"}]},
  "Tauros-Paldea-Aqua": {"sets": [{"name": "Defensive"}]},
  "Ditto": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Ditto is a niche revenge killer in Anything Goes that can handle some strong setup sweepers like Swords Dance Koraidon, non-Double Dance Miraidon, Iron Moth, Gholdengo, and others like Chien-Pao, Great Tusk, Dragonite, and Iron Bundle once they are weakened. From there, it can attempt a reverse sweep. Ditto's EVs and IVs minimize Speed and maximize bulk: this helps against opposing Ditto by triggering its own Imposter latest to make the foe run out of PP first, as well as minimizing Struggle damage. Tera Fairy elevates Ditto against a Choice Scarf Miraidon or Koraidon that will likely attack Ditto with a Dragon-type move. Ditto eases the pressure on the defensive backbone of a team by revenge killing some common threats, so it is advised to fit more offensive wallbreakers on the team like Chien-Pao, Miraidon, Koraidon, and Iron Bundle. However, Ditto still fails to revenge kill bulkier sweepers like Double Dance Miraidon, Bulk Up Koraidon and Great Tusk, and Quark Drive and Protosynthesis users like Iron Valiant, Iron Bundle, and Flutter Mane. Additionally, most sweepers can take advantage of Ditto with a surprise Terastallization, such as Tera Fire Koraidon, Tera Fairy Miraidon, and Tera Water Gholdengo. Thus, backup checks to them like defensive Great Tusk, Ting-Lu, Iron Treads, Clodsire, Alomomola, and Toxapex are appreciated. These teammates additionally check wallbreakers like Iron Bundle, Chien-Pao, and Great Tusk.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pichus", "user_id": 374620}], "teams": [{"name": "Quality checked by", "members": [{"username": "Guard", "user_id": 360582}, {"username": "Fc", "user_id": 511624}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Dragonite": {"sets": [{"name": "Dragon Dance"}]},
  "Scizor": {"sets": [{"name": "Choice Band"}]},
  "Blissey": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Blissey's impressive special bulk makes it an effective blanket check to a multitude of the tier's powerful special attackers, such as Miraidon, Iron Bundle, Chi-Yu, and Walking Wake. Seismic Toss somewhat allows Blissey to make up for its low offenses by dealing consistent damage to a majority of the tier. Thunder Wave can cripple the Pokemon that Blissey checks and punish foes attempting to switch in and threaten it, such as Koraidon and Chien-Pao. Tera Ground provides an immunity to Miraidon's Electric-type attacks, notably denying Parabolic Charge variants from healing. Alternatively, Tera Water can be used to resist Fire- and Water-type attacks from Chi-Yu and Walking Wake at the cost of making Blissey unable to check Miraidon. Tera Fire maintains the ability to take on Chi-Yu but instead trades the Water resistance for a lack of weakness to Miraidon's Electric-type moves. Heavy-Duty Boots prevents Blissey from being worn down by entry hazards, whereas Utility Umbrella is an option on teams with sufficient hazard control to reduce the damage it takes from Chi-Yu, Walking Wake, and Iron Bundle's sun and rain-boosted attacks. Blissey functions best on balance and stall teams, where it should be paired with physical walls such as Toxapex, Corviknight, Alomomola, Skeledirge, and Dondozo, which can take on threats like Koraidon, Chien-Pao, Great Tusk, Breloom, and Kingambit for it. Blissey is unable to handle Choice Specs and Life Orb Miraidon sets by itself without Tera Ground, so secondary checks in Clodsire, Ting-Lu, and Iron Treads are also viable teammates. Utility Umbrella sets benefit from the hazard removal capabilities of Great Tusk, Corviknight, and Iron Treads. Additionally, Miraidon and Koraidon appreciate Blissey's ability to take on Iron Bundle, making them effective partners.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "Frozoid", "user_id": 532881}, {"username": "pichus", "user_id": 374620}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Tyranitar": {"sets": [{"name": "Defensive"}]},
  "Pelipper": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Pelipper is a strong wall because it can check most Koraidon and Great Tusk sets while setting rain. Hurricane nails Koraidon and Great Tusk if they try to set up on Pelipper. Knock Off allows it to cripple common switch-ins like Ting-Lu, Great Tusk, Iron Treads, Corviknight, and Clodsire. Alternatively, Surf is a fairly strong STAB move in rain that punishes Tera Fire Koraidon and Chi-Yu, and it still pressures passive switch-ins. With minimum Speed to be slower than Ting-Lu and Corviknight, U-turn gives safe entry to a teammate of its choice. U-turn also lets it escape Gothitelle, harming it and preserving momentum, as it tries to hard switch in. Tera Fairy is used to defeat a Koraidon locked into Outrage or Wild Charge, which would otherwise break through Pelipper, and also to deal with Thunderbolt from Gothitelle, Crunch from Chien-Pao, and Dark Pulse from Chi-Yu in a pinch. Miraidon and Iron Bundle are the biggest threats to Pelipper, able to switch into it multiple times fairly easily. Hence, it is mandatory to pair Pelipper with appropriate checks like Clodsire, Blissey, and Iron Treads, which will additionally set entry hazards to stop them from switching in for free. Clodsire especially gives solid support by tanking rain-boosted Water-type moves from Iron Bundle, Tera Water Miraidon, and Walking Wake. Physical attackers like Swords Dance Koraidon and Chien-Pao can easily break through Pelipper, so it is advised to have backup checks to them like Great Tusk, Skeledirge, and Garganacl. These threats can also be checked offensively with Palafin, Floatzel, Iron Bundle, Walking Wake, and Miraidon, which also make the most out of Pelipper's rain. Dugtrio can trap and eliminate Miraidon and Iron Bundle once they are weakened; also, Pelipper lets Dugtrio get many trapping opportunities thanks to its slow U-turn pivoting. Pelipper is prone to losing its item to Knock Off, so it is essential to pair it with entry hazard removers such as Great Tusk, Iron Treads, and Corviknight.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pichus", "user_id": 374620}], "teams": [{"name": "Quality checked by", "members": [{"username": "Guard", "user_id": 360582}, {"username": "Fc", "user_id": 511624}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Masquerain": {"sets": [{"name": "Sticky Web"}]},
  "Breloom": {
    "sets": [
      {
        "name": "The Loom",
        "description": "<p>Breloom is a potent sweeper for offensive teams due to its strong priority and ability to force and exploit switches. Mach Punch massively threatens faster Pokemon like Chi-Yu and Iron Bundle, and it lets Breloom function as a formidable revenge killer and even sweep through weakened teams once boosted. Bullet Seed hits Great Tusk and bulky Water-types, like Toxapex, Alomomola, and Dondozo, and it avoids Rocky Helmet damage, preserving Focus Sash. Spore shuts down slower defensive Pokemon, like Corviknight, Toxapex, and Pelipper, offering Breloom free opportunities to use Swords Dance. Close Combat can be used instead on Life Orb sets, as it puts Miraidon into Mach Punch range if it tries to switch in, OHKOes Corviknight at +2. Focus Sash is the preferred item, as it gives more opportunities for Breloom to set up and allows it to avoid revenge killing attempts, but Life Orb can be used instead, notably OHKOing Miraidon and Koraidon with +2 Tera Fighting Mach Punch and improving Breloom's ability to revenge kill Koraidon and Great Tusk. Tera Fighting increases Mach Punch damage, and it lets Breloom survive an Ice Shard from Chien-Pao. Breloom fits best on offensive teams as a wallbreaker and sweeper that especially threatens balance teams. Entry hazard support from Glimmora, Cloyster, or Froslass is appreciated to put offensive Pokemon into Mach Punch KO range. Toxic Spikes may seem like poor synergy because poison prevents Spore, but Spore's main targets—Corviknight, Toxapex, and Pelipper—are unaffected by Toxic Spikes, and the increased damage on Miraidon and Koraidon is helpful. Hatterene is a good partner, as it prevents entry hazards, preserving Breloom's Focus Sash. Kingambit is a powerful sweeper that helps to handle Flutter Mane and Ice Shard Chien-Pao, which can stop Breloom from sweeping. Fast allies like Koraidon, Flutter Mane, and Chien-Pao can force in slower Pokemon, like Toxapex and Corviknight, for Breloom to exploit, and they also put pressure on Gholdengo and Skeledirge, which effectively wall Breloom. Miraidon prevents Breloom from using Spore on grounded Pokemon, so ways to threaten it—such as Chien-Pao or Flutter Mane—are greatly appreciated.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TaxFraud", "user_id": 584685}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "pichus", "user_id": 374620}]}, {"name": "Grammar checked by", "members": [{"username": "Yourfavoritetransfem", "user_id": 629345}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Floatzel": {"sets": [{"name": "Choice Band"}]},
  "Garchomp": {"sets": [{"name": "Lead"}]},
  "Hippowdon": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Hippowdon is an uncommon defensive Pokemon that checks Pokemon like Koraidon, Great Tusk, and Kingambit thanks to its impressive bulk and Sand Stream. While it can set Stealth Rock, it struggles to do so reliably because of its inability to pressure Corviknight and Great Tusk. Whirlwind phazes foes that attempt to set up in front of Hippowdon, such as Swords Dance Koraidon, Bulk Up Great Tusk, and Swords Dance Tera Flying Kingambit, while also potentially deterring setup attempts by attackers that could expect to force it out, like Miraidon and Chien-Pao. Tera Fairy resists Koraidon's Fighting-type STAB moves and is immune to Koraidon's Outrage and Miraidon's Draco Meteor. Alternatively, Tera Water provides a resistance to attacks such as Koraidon's Flare Blitz, Chien-Pao's Icicle Crash and Ice Spinner, and Palafin's Wave Crash. Hippowdon benefits from being paired with Pokemon able to take on Chien-Pao for it, such as Toxapex and Garganacl, with the former also being able to absorb Toxic Spikes for Hippowdon and the latter benefitting from a Special Defense boost from sand. Special walls such as Clodsire, specially defensive Corviknight, and Blissey are essential to take on dangerous special attackers like Miraidon, Iron Bundle, Flutter Mane, and Walking Wake for Hippowdon. Teammates able to set entry hazards are also appreciated to allow chip damage to quickly rack up when paired with sand, Rocky Helmet, and Whirlwind. Between Earthquake and Whirlwind, Hippowdon is unable to touch Air Balloon Gholdengo, so counterplay to it, such as Ruination Ting-Lu and Kingambit, is recommended. Offensive Houndstone is a very niche potential partner that notably benefits from being paired with Hippowdon thanks to Sand Rush, which somewhat offsets the issue of its low Speed, potentially allowing a boosted Last Respects to clean up an opponent's team.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "Guard", "user_id": 360582}, {"username": "Geysers", "user_id": 426798}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Froslass": {
    "sets": [
      {
        "name": "Spikes Lead",
        "description": "<p>Froslass is an effective entry hazard lead for hyper offense teams, as it can both block Rapid Spin without Terastallizing and deny hazards from opposing leads such as Glimmora, Iron Treads, and Great Tusk via Taunt. In addition to keeping hazards away, Taunt prevents setup attempts from slower Pokemon such as Great Tusk and Annihilape, and it thwarts Corviknight attempting to Defog away Froslass's Spikes. Destiny Bond can potentially take a slower Pokemon down with Froslass or force a switch, buying time to lay more layers of Spikes. Thunder Wave cripples faster leads, particularly Flame Charge Koraidon, and slows them down for Destiny Bond. Cursed Body can be situationally useful to disable attacks from foes holding Choice items, forcing them to switch. Tera Dark makes Froslass immune to Grimmsnarl's Prankster Taunt, whereas Tera Steel blocks Glimmora's Mortal Spin. Froslass should be used on hyper offense teams to support dangerous setup sweepers such as Calm Mind + Agility Miraidon, Swords Dance + Flame Charge Koraidon, and Swords Dance Chien-Pao by weakening opposing Pokemon with Spikes. Gholdengo can notably block Rapid Spin, Defog, and Mortal Spin, ensuring hazards stay up. Grimmsnarl is another good teammate, as it can support the aforementioned setup sweepers via Light Screen and Reflect.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "Guard", "user_id": 360582}, {"username": "Geysers", "user_id": 426798}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Gothitelle": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Gothitelle is a wallbreaker that enables its teammates by trapping and removing various walls. Thunderbolt targets Corviknight, Alomomola, Toxapex, and Pelipper, while Grass Knot OHKOes Dondozo, Hippowdon, and defensive Great Tusk, 2HKOes Garganacl, and 2HKOes Ting-Lu and Iron Treads with Tera Grass. Psyshock is chosen over Psychic to more effectively remove Blissey and Clodsire. Trick is a decent midground option that cripples Pokemon Gothitelle might not otherwise beat, like Tera Steel Ting-Lu and Corviknight, but it comes at the cost of greatly reducing Gothitelle's wallbreaking potential, so it should generally be used sparingly. Tera Fairy is used to trap Miraidon, Walking Wake, and Koraidon locked into their Dragon-type STAB moves, and it lets Gothitelle revenge kill weakened Chi-Yu and Chien-Pao locked into a Dark-type STAB move. Alternatively, Tera Grass allows it to 2HKO Ting-Lu and Iron Treads while weakening strong attacks from Great Tusk, Ting-Lu, and Iron Treads. Gothitelle fits best on balance teams, where it can make powerful teammates like Miraidon, Koraidon, Iron Bundle, and Chien-Pao into wincons, since it removes many of their common checks. Gothitelle is frail and dislikes hard switching into the walls it seeks to remove, so it greatly appreciates pivots such as Flip Turn Iron Bundle and U-turn users such as Miraidon, Koraidon, and Corviknight. After Gothitelle has picked up a KO, many offensive Pokemon force it out, so standard defensive backbones consisting of Pokemon like Toxapex, Iron Treads, Great Tusk, Clodsire, and Skeledirge are vital.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Geysers", "user_id": 426798}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Amoonguss": {"sets": [{"name": "Defensive"}]},
  "Alomomola": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Alomomola is a solid defensive pivot that sets itself apart from Toxapex as a result of its lack of Ground-type weakness and access to Wish, with the former quality letting it check Great Tusk in addition to Pokemon such as Choice Scarf Koraidon, Chien-Pao, and Palafin-H. However, Alomomola is quite passive, succumbs to Koraidon and Chien-Pao after they have boosted their Attack or Terastallized, and is easily trapped by Gothitelle. Whirlpool's passive damage makes up for Alomomola's poor offenses and prevents double switches from the opponent. Play Rough hits Koraidon and Chien-Pao decently hard, and it prevents Miraidon from switching into Alomomola relatively freely. Minimum Speed investment ensures that Corviknight cannot exploit Alomomola to get off a slower U-turn to gain momentum. Tera Fairy resists Koraidon's Fighting-type STAB moves as well as Chien-Pao's Crunch, and it is immune to Dragon-type attacks such as Koraidon's Outrage and Choice-locked Miraidon and Walking Wake's Draco Meteor. Rocky Helmet prevents passivity by punishing Pokemon like Koraidon, Great Tusk, and Chien-Pao. Alomomola appreciates being paired with special walls that can check Pokemon like Miraidon, Iron Bundle, and Flutter Mane for it, such as Clodsire, Blissey, Iron Treads, and Ting-Lu. The latter two also especially benefit from Alomomola's Wish due to their lack of reliable recovery. Skeledirge and Gholdengo are also effective partners since they check Breloom for Alomomola. Alomomola requires an entry hazard remover in Great Tusk, Corviknight, or Iron Treads, as it is likely 2HKOed by Choice Scarf Koraidon's Close Combat or Choice Band Chien-Pao's Crunch after Stealth Rock. Alomomola should also be used in tandem with secondary defensive Koraidon checks such as defensive Great Tusk or Skeledirge—which also checks Breloom for it—or speed control in the form of Iron Bundle, Choice Scarf Great Tusk, Choice Scarf Koraidon, or Choice Scarf Miraidon to revenge kill Koraidon and Chien-Pao at +2.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Guard", "user_id": 360582}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Volcarona": {"sets": [{"name": "Quiver Dance"}]},
  "Sylveon": {"sets": [{"name": "Calm Mind"}]},
  "Toxapex": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Toxapex is a potent physical wall that is capable of taking on offensive threats such as Koraidon, Chien-Pao, and rain staples including Palafin and Floatzel. Haze shuts down attempts of boosting past Toxapex from the likes of Swords Dance Koraidon, Chien-Pao, and Kingambit. Toxic punishes strong attackers that can threaten Toxapex such as Miraidon, Iron Bundle, and Great Tusk, and it can hinder walls for Toxapex's teammates. Toxic Spikes can instead be used in conjunction with Pokemon that prevent hazard removal, such as Gholdengo and Annihilape, to pester the opposing team long-term. Infestation can trap and deal chip damage, notably to Pokemon like Corviknight, Iron Treads, and opposing Toxapex, which are immune to Toxic. Alternatively, Baneful Bunker lets Toxapex scout foes like Miraidon, Koraidon, Chien-Pao, and Choice Specs Iron Bundle while possibly poisoning them, at the risk of letting them set up on it. Rocky Helmet somewhat offsets Toxapex's passive nature by dealing chip damage and wearing down Pokemon like Koraidon and Chien-Pao, potentially putting them into KO range from a partner and dissuading them from freely using U-turn and Crunch, respectively. Tera Fairy makes Toxapex immune or resistant to attacks like Choice Band Koraidon's Outrage and Choice Band Chien-Pao's Crunch while also making Toxapex neutral to super effective hits from Iron Bundle, Great Tusk, Dugtrio, and Gothitelle. Toxapex is useful on many team styles thanks to its great bulk and Regenerator. Pokemon that are susceptible to being revenge killed by Choice Scarf Koraidon and Ice Shard Chien-Pao, like Miraidon, opposing Koraidon, and Iron Bundle, appreciate Toxapex facing these threats for them. Another notable mention is Gothitelle, which benefits from Infestation's trapping ability, allowing it to switch in and trap defensive Pokemon without fear of them switching out the same turn. Toxapex benefits from being paired with Pokemon such as Ting-Lu, Clodsire, Iron Treads, and Corviknight, which are able to check Miraidon, Iron Bundle, and Great Tusk for it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Guard", "user_id": 360582}]}, {"name": "Grammar checked by", "members": [{"username": "Band", "user_id": 301217}]}]}
  },
  "Corviknight": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Corviknight is one of the most versatile defensive pivots in AG, checking a myriad offensive threats such as Iron Bundle, Great Tusk, Chien-Pao, and Flutter Mane while providing its team with invaluable entry hazard control. Iron Head OHKOes Flutter Mane and hits Chien-Pao hard. Alternatively, Body Press 2HKOes Iron Bundle and OHKOes Chien-Pao, but Brave Bird is also an option to hit Great Tusk and Annihilape harder and chip potential switch-ins more. The given EVs maximize Corviknight's physical bulk while ensuring that it always avoids a 2HKO from unboosted Iron Bundle's Hydro Pump. If Iron Head is used, Corviknight should instead run a spread of 252 HP / 4 Atk / 156 Def / 96 SpD to guarantee an OHKO on Flutter Mane. Tera Steel allows Corviknight to resist Ice moves, making it a better check to Chien-Pao, while also allowing it to take a hit from Double Dance Miraidon and avoid being 2HKOed by Gothitelle. Alternatively, Tera Water provides decent overall defensive utility while also letting Corviknight pivot into Flare Blitz from Koraidon in a pinch. A Relaxed nature and minimum Speed IVs ensure that Corviknight will U-turn after most defensive Pokemon, allowing it to generate safer switches for its teammates. Corviknight fits well on all manner of balance teams as a member of the defensive core, so teammates like Toxapex, Skeledirge, Ting-Lu, and Clodsire fit well alongside it thanks to their ability to handle Koraidon and Miraidon. Additionally, Corviknight works as a great enabler to common offensive Pokemon like Miraidon, Koraidon, and Chien-Pao, bringing them in freely with U-turn, and benefits greatly from their ability to pressure its biggest threat in Gholdengo.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Geysers", "user_id": 426798}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Fc", "user_id": 511624}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Barraskewda": {"sets": [{"name": "Choice Band"}]},
  "Hatterene": {"sets": [{"name": "Calm Mind"}]},
  "Grimmsnarl": {
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>Grimmsnarl is the premier dual screens setter on hyper offense teams thanks to Prankster. Its dual screens effectively double the bulk of its teammates, allowing them to more easily set up and making them harder to revenge kill. Play Rough targets Pokemon such as Koraidon, Chien-Pao, and Ting-Lu, OHKOing the former two and 2HKOing the latter after minimal chip. Parting Shot lets Grimmsnarl pivot into a teammate, preserving Grimmsnarl to potentially reset dual screens later and allowing said teammate an opportunity to safely set up due to the foe's lowered offenses. Taunt prevents opposing Pokemon from setting up or laying entry hazards, and it also stops Corviknight from using Defog. Tera Ghost allows Grimmsnarl to prevent Rapid Spin from Iron Treads and Great Tusk, whereas Tera Steel blocks Glimmora's Mortal Spin. Due to the increased durability they provide, setup sweepers such as Calm Mind + Agility Miraidon, Swords Dance Koraidon, Swords Dance Chien-Pao, and Calm Mind Espathra appreciate Grimmsnarl's dual screens. Suicide leads in Glimmora, Froslass, and Cloyster can lay entry hazards to weaken foes, potentially into range of an offensive teammate's attack. Gholdengo and Annihilape are good partners, as they can prevent Rapid Spin and deny or punish Defog attempts for Grimmsnarl lacking Taunt, helping dual screens and entry hazards from their teammates stay up.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "Frozoid", "user_id": 532881}, {"username": "pichus", "user_id": 374620}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Dragapult": {"sets": [{"name": "Dragon Dance"}, {"name": "Pivot"}, {"name": "Choice Specs"}]},
  "Skeledirge": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Skeledirge is a decent Koraidon check, reliably beating Choice Scarf and Swords Dance + Flame Charge sets while pivoting into and scouting Choice Band Koraidon. Skeledirge is notably immune to trapping by Dugtrio and Gothitelle, which ensures its viability as an alternative to the more passive Toxapex. Torch Song is Skeledirge's most reliable STAB move and gives it the potential to snowball late-game into a sweeper. Will-O-Wisp prevents physical attackers like Koraidon, Great Tusk, and Chien-Pao from setting up on it and also annoys passive Pokemon like Toxapex, Ting-Lu, and Alomomola. Earth Power punishes Miraidon and Chi-Yu as they switch in while also letting it beat Garganacl and Tera Fire Koraidon. Alternatively, Hex complements Will-O-Wisp, doing heavy damage to neutral targets such as Toxapex and Pelipper. Fairy is Skeledirge's preferred Tera Type, granting it a valuable immunity to Koraidon's Outrage and allowing it to absorb otherwise supereffective attacks like Crunch from Chien-Pao and Earthquake or Headlong Rush from Great Tusk. Skeledirge fits best on balance teams that appreciate its ability to neuter Koraidon and can effectively handle the numerous Pokemon that can threaten Skeledirge, such as Great Tusk, Miraidon, and Iron Bundle. As a result, ideal teammates include revenge killers such as Choice Scarf Miraidon and Choice Band Chien-Pao and defensive staples like Corviknight, Clodsire, and Ting-Lu.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Geysers", "user_id": 426798}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Guard", "user_id": 360582}]}, {"name": "Grammar checked by", "members": [{"username": "lotiasite", "user_id": 302985}]}]}
  },
  "Pawmot": {"sets": [{"name": "Volt Absorb Fairy"}]},
  "Maushold": {"sets": [{"name": "Tidy Up"}]},
  "Dachsbun": {"sets": [{"name": "Defensive"}]},
  "Garganacl": {"sets": [{"name": "Defensive"}]},
  "Ceruledge": {"sets": [{"name": "Swords Dance"}]},
  "Scovillain": {"sets": [{"name": "SubSeed"}]},
  "Espathra": {
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Espathra's combination of Calm Mind, Speed Boost, and Stored Power makes it a threatening sweeper that can quickly spiral out of control, with Stored Power's rising Base Power ensuring it can break past even Blissey and bulky Unaware Pokemon, such as Skeledirge and Dondozo. Dazzling Gleam can hit Dark-types such as Chien-Pao, Ting-Lu, and Grimmsnarl super effectively. Tera Blast with Tera Fighting also allows Espathra to nail Dark-types, including Chi-Yu—unlike Dazzling Gleam—as well as Steel-types like Iron Treads and Kingambit. Roost keeps Espathra healthy, making it less susceptible to common priority moves such as Chien-Pao's Ice Shard. Substitute blocks status moves such as Clodsire and Toxapex's Toxic, and it makes Espathra harder to revenge kill. Protect allows Espathra to accumulate a turn of Leftovers recovery and a Speed increase from Speed Boost, which also boosts Stored Power. Electric Seed increases Espathra's Defense, complementing Calm Mind's Special Defense boosts, and contributes towards Stored Power's Base Power. Leftovers synergizes with Substitute and Protect by providing passive recovery. Tera Fairy lets Espathra resist Sucker Punch from Chien-Pao and Kingambit and boosts Dazzling Gleam. Tera Fighting similarly provides a resistance to Dark-type attacks, in addition to making Tera Blast useful, at the cost of leaving Espathra completely reliant on Terastallizing to hit Dark-types. The Speed EVs given allow +2 Speed Espathra to outspeed Iron Bundle in Electric Terrain, which activates its Quark Drive, while the special bulk ensures Espathra survives Choice Scarf Miraidon's Electro Drift and fast Walking Wake's Draco Meteor at +1 Special Defense. The Defense EVs notably let Espathra survive Choice Scarf Tera Fire Koraidon's Flare Blitz when paired with Electric Seed. Espathra appreciates being on more offensive teams, as it is frail and likely cannot threaten to sweep more than once. Since it summons Electric Terrain, Miraidon is an essential partner if Espathra is running Electric Seed. The two Pokemon can also weaken Iron Treads, Clodsire, and Whirlwind Ting-Lu for each other. Fighting-type teammates such as Koraidon and Great Tusk can threaten the Dark- and Steel-types that resist Espathra's Stored Power. Suicide leads in Glimmora, Froslass, and Cloyster can set up entry hazards to weaken opposing Pokemon for Espathra, and they fit well on the offensive teams it finds itself on. Grimmsnarl can effectively double Espathra's poor bulk thanks to Light Screen and Reflect.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "Frozoid", "user_id": 532881}, {"username": "pichus", "user_id": 374620}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Palafin": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Palafin is a potent wallbreaker and revenge killer for rain teams thanks to its Hero forme boasting the highest base Attack stat in the game and the strong priority move Jet Punch. Flip Turn allows Palafin to generate momentum for its team by pivoting out on its checks, bar Clodsire, to bring in a teammate that can threaten them. Zen Headbutt 2HKOes Toxapex, OHKOes Clodsire, and OHKOes Koraidon after one layer of Spikes. Jet Punch is a useful tool that can deal with faster offensive Pokemon such as Tera Fairy Miraidon, Chien-Pao, Great Tusk, and Flutter Mane, turning Palafin into a potent cleaner late-game. Tera Water boosts Wave Crash to impressive levels of damage in rain, allowing it to achieve feats such as 2HKOing Toxapex, Pelipper, and Alomomola, 2HKOing Dondozo after Stealth Rock, and OHKOing Miraidon. Pelipper is an excellent partner for Palafin, as it sets rain and checks Koraidon—whose sun weakens Palafin's Water-type moves. Miraidon is another good teammate, as it threatens the bulky Water-types that check Palafin, such as Toxapex, Alomomola, and Dondozo, and safely brings in Palafin via U-turn, while Palafin threatens Ground-types such as Ting-Lu and Iron Treads for Miraidon. Similarly, Iron Bundle can pivot Palafin in with U-turn and target Water-types for it with Freeze Dry while Palafin threatens special walls for Iron Bundle. Iron Bundle also offensively checks faster Pokemon that resist Water like Miraidon and Koraidon for Palafin, and it benefits from the rain support Palafin is often paired with. Palafin also appreciates being paired with checks to Miraidon, Iron Bundle, and Walking Wake—which resist Jet Punch and OHKO Palafin in return—such as Iron Treads, specifically for the former, and Clodsire and Blissey for all three. Dugtrio can also be utilized to trap Clodsire and Toxapex as well as faster threats such as Miraidon and Koraidon, freeing up Palafin to wallbreak with its most common defensive checks removed and without fear of being revenge killed.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Guard", "user_id": 360582}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Cyclizar": {"sets": [{"name": "Shed Tail"}]},
  "Glimmora": {
    "sets": [
      {
        "name": "Lead",
        "description": "<p>Glimmora is one of the metagame's best suicide leads because of its access to utility moves such as Stealth Rock, Spikes, and Memento as well as its signature ability Toxic Debris. Earth Power threatens Iron Treads and Gholdengo, which could otherwise block Mortal Spin, and does a lot of damage to Pokemon like Chi-Yu, Miraidon, Skeledirge, and Toxapex. Alternatively, Power Gem can OHKO lead Iron Bundle and Chien(AH)-Pao. Memento grants a free switch for Glimmora's teammates, such as Double Dance Koraidon and Miraidon, Great Tusk, and Chien-Pao to set up, and it also blocks potential attempts at hazard removal. Tera Ghost can block Rapid Spin from Great Tusk and Iron Treads if necessary. Glimmora best fits on hyper offense teams with Pokemon like Taunt Iron Bundle, Annihilape, and Gholdengo to block entry hazard removal, and setup sweepers such as Swords Dance Koraidon, Calm Mind Miraidon, and Swords Dance Chien-Pao to take advantage of the entry hazards it lays. Grimmsnarl is also a good partner that can set up dual screens and use Prankster Taunt to prevent Defog or entry hazards from foes.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ponchlake", "user_id": 574634}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Fc", "user_id": 511624}]}, {"name": "Grammar checked by", "members": [{"username": "Band", "user_id": 301217}]}]}
  },
  "Houndstone": {"sets": [{"name": "Choice Band"}, {"name": "Defensive"}]},
  "Dondozo": {
    "sets": [
      {
        "name": "Defensive Wall",
        "description": "<p>Good defensive stats and Unaware make Dondozo a solid defensive wall that can withstand physical attackers such as Swords Dance Koraidon, Swords Dance Chien-Pao, and Bulk Up Great Tusk. Earthquake 2HKOes Miraidon and Gholdengo after minimal chip damage, while Body Press OHKOes Chien-Pao and 2HKOes Iron Bundle. With Curse, Dondozo can spiral out of control and gain good sweeping potential. Sleep Talk can be used as an alternative with Rest to stop Pokemon from freely switching into Dondozo during its sleep turns. Miraidon's substantial presence makes Rest unreliable, so Protect can be used instead to scout for Choice item users such as Miraidon, Koraidon, Chien-Pao, and Iron Bundle. With Leftovers, Dondozo can recover much-needed health constantly. Alternatively, Rocky Helmet punishes physical attackers such as Koraidon, Chien-Pao, and Great Tusk, so they can't attack for free. Tera Fairy allows Dondozo to resist Dark- and Fighting-type moves from Chien-Pao and Koraidon, respectively, while also gaining immunity to Dragon-type moves from the latter. Tera Ground removes Dondozo's Electric weakness and can catch Miraidon off guard. Dondozo fits well on balance and stall teams where it has support from specially defensive walls such as Clodsire and Blissey that can check Miraidon, Walking Wake, and Iron Bundle. Entry hazard removal options such as Corviknight, Great Tusk, and Iron Treads keep Dondozo healthy, stopping foes from taking advantage of a weakened Dondozo. Dugtrio is a great teammate, as it can trap and KO Miraidon, making Dondozo incredibly hard to deal with.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "pichus", "user_id": 374620}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Annihilape": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Annihilape is a potent sweeper and wallbreaker due to the combination of Taunt and Bulk Up allowing it to set up on many passive Pokemon, and its high bulk makes it difficult to revenge kill. Taunt forces slower Pokemon to attack Annihilape, denying status from Skeledirge, Toxapex, and Clodsire, and it also prevents Haze Toxapex and Whirlwind Ting-Lu from removing Bulk Up boosts. Rage Fist's Base Power scaling lets Annihilape break through Pokemon with high Defense or Unaware, such as Alomomola or Skeledirge. Drain Punch hits Dark-types that resist Rage Fist and helps keep Annihilape healthy. The given EV spread maximizes Leftovers recovery and lets Annihilape outspeed Gothitelle, which would otherwise cripple it with Trick; the remaining EVs are put into Special Defense, helping it survive hits from Chi-Yu, Iron Bundle, and Miraidon. Tera Water allows Annihilape to resist Koraidon's Flare Blitz, Iron Bundle's Hydro Pump, and Chi-Yu's Overheat as well as being an overall good defensive typing, with Tera Fairy being an alternative that blocks Dragon-type attacks from Walking Wake, Koraidon, and Miraidon. Koraidon and Miraidon are good partners for their ability to use U-turn to get Annihilape in safely to set up on Pokemon that check them. Powerful wallbreakers that can break through Annihilape's bulk like Miraidon are a big issue, so dual screens support from Grimmsnarl or a strong defensive core is greatly appreciated. Entry hazard removal from Great Tusk, Iron Treads, and Corviknight is helpful to allow multiple setup attempts per game and remove the especially obnoxious Toxic Spikes. Annihilape is a good spinblocker that deters Defog Corviknight because of Defiant, so entry hazard setters like Ting-Lu, Clodsire, Great Tusk, Iron Treads, and Toxapex, which also have solid defensive utility, are helpful. Annihilape struggles to find opportunities against offensive teams, so speed control like Iron Bundle and Choice Scarf Koraidon is appreciated. Annihilape checks anti-offense threats like Iron Bundle and Choice Scarf Chi-Yu, and it heavily pressures defensive cores, making it a good addition to offensive teams.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TaxFraud", "user_id": 584685}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Clodsire": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Great special bulk and immunity to Electric-type moves make Clodsire a good wall and a solid check to Miraidon and Walking Wake. A combination of Toxic + Earthquake ensures that offensive threats like Koraidon and Chien-Pao and walls like Ting-Lu and Great Tusk cannot switch into Clodsire for free. Clodsire also acts as a good entry hazard setter, as it has access to Spikes, Stealth Rock, and Toxic Spikes. Alternatively, Counter can be used to eliminate defensive Great Tusk, Choice Scarf Koraidon Choice locked into Dragon Claw, and Chien-Pao Choice locked into Crunch. Water Absorb is preferred, as it makes Clodsire immune to Hydro Pump from Iron Bundle and Water-type STAB moves from Walking Wake while also making it so it doesn't ignore the Special Attack drop from Miraidon's Draco Meteor, which Unaware doesn't allow. With Tera Steel and Water Absorb, Clodsire acts as a good Iron Bundle and Walking Wake check while taking Draco Meteor from Miraidon, Psyshock from Flutter Mane, and Ice-type STAB moves from Chien-Pao better. Alternatively, Tera Fire can be used to retain the Ice resistance while also gaining a resistance to Chi-Yu's nuclear Fire-type moves. 32 Defense EVs let Clodsire survive Earthquake from bulky Great Tusk. Great Tusk, Chien-Pao, and Koraidon force Clodsire out, so physically defensive Pokemon such as Toxapex, Corviknight, and Dondozo are good teammates. Gholdengo and Annihilape are also good teammates, as they can block hazard removal attempts from Corviknight, which otherwise can easily remove hazards against Clodsire. Clodsire can't deal with Choice Specs Miraidon properly, so faster Pokemon such as Iron Bundle and Choice Scarf users such as Tera Fairy Dugtrio and Koraidon are good teammates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Guard", "user_id": 360582}]}, {"name": "Grammar checked by", "members": [{"username": "Band", "user_id": 301217}]}]}
  },
  "Kingambit": {
    "sets": [
      {
        "name": "Setup Sweeper",
        "description": "<p>Kingambit is a strong late-game sweeper thanks to Supreme Overlord and a strong priority in Sucker Punch. Low Kick can be used over Iron Head to punish Ting-Lu, opposing Kingambit, and Tera Dark Chien-Pao, but is generally outclassed by Iron Head's consistency. The given EV spread allows Kingambit to outspeed uninvested Corviknight, Skeledirge, and Alomomola. Tera Flying lets Kingambit take on Ground- and Fighting-type attacks, turning Great Tusk and Iron Treads into setup fodder. Alternatively, Tera Dark—when used with Black Glasses—boosts Kingambit's Dark-type attacks to impressive levels, allowing it to accomplish feats such as OHKOing Miraidon with +2 Sucker Punch. Leftovers allows Kingambit to come in repeatedly on bulky Pokemon such as Toxapex and non-Body Press Corviknight to wear them down, whereas Black Glasses increases the likelihood of Kingambit sweeping. Kingambit fits on offensive teams that appreciate it cleaning up after other setup sweepers and wallbreakers have broken through or weakened its checks. Offensive Pokemon such as Chien-Pao, Great Tusk, and Koraidon are great teammates, as they can weaken walls like Dondozo, Corviknight, and Great Tusk for Kingambit, and vice versa. Entry hazard setters such as Glimmora, Froslass, and Great Tusk are appreciated to wear down Kingambit's checks, since they tend to not have reliable recovery. On non-hyper offense teams, Kingambit appreciates defensive support to fall back on, such as Great Tusk or Toxapex for Koraidon and Ting-Lu, Clodsire, or Iron Treads for Miraidon.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Frozoid", "user_id": 532881}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<p>Great Tusk is a strong wallbreaker owing to its high Attack stat and decent bulk, which lets it hard switch into numerous Pokemon and threaten them. Knock Off is used to cripple walls like Pelipper, Alomomola, Corviknight, Air Balloon Gholdengo, and defensive Great Tusk, which can otherwise comfortably switch into Great Tusk. Rapid Spin lets it remove entry hazards and also outspeed the entire unboosted metagame at +1 Speed. An Adamant nature is preferred for maximum power; however, it can outspeed Timid Gholdengo and Chi-Yu with a Jolly nature. Tera Ground significantly boosts Headlong Rush, notably making it OHKO Toxapex and Koraidon while 2HKOing Alomomola. It also removes Great Tusk's weakness to Fairy-type attacks, notably Dazzling Gleam from Miraidon and Moonblast from Flutter Mane. Alternatively, Tera Fighting lets it break through Corviknight with more ease and be less weak to Chien-Pao and Iron Bundle. Koraidon is a phenomenal teammate, as it sets sun to activate Protosynthesis, and it can also bring Great Tusk in via U-turn. Similarly, Miraidon and Iron Bundle can also pivot into Great Tusk, which lets it threaten all their checks. Standard defensive teammates like Clodsire, Corviknight, Toxapex, and Iron Treads are appreciated for helping Great Tusk check offensive threats, and offensive Great Tusk needs this help more than defensive variants. Gothitelle is a great teammate, as it can comfortably trap and remove every Pokemon that checks Great Tusk. Other strong wallbreakers like Choice Specs Iron Bundle, Chi-Yu, and Choice Band Chien-Pao appreciate Great Tusk's support, as it can switch into their checks and force them out, as well as removing entry hazards for them.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Great Tusk is a defensive staple in the metagame due to its high physical bulk and solid utility thanks to Stealth Rock and the ability to remove them from its side using Rapid Spin. Knock Off cripples Ting-Lu and opposing Great Tusk by blocking their passive recovery from Leftovers and removes Heavy-Duty Boots from Pelipper and Rocky Helmet from Toxapex and Alomomola. Alternatively, Play Rough deals high damage to Chien-Pao and Koraidon. Leftovers offers much-needed passive recovery, while Rocky Helmet punishes physical attackers such as Koraidon, Chien-Pao, and opposing Great Tusk, especially stopping Koraidon from freely pivoting against Great Tusk into teammates like Chi-Yu and Walking Wake. 40 Speed EVs allows Great Tusk to outspeed Chi-Yu at +1. Tera Fairy makes Great Tusk immune to Dragon-type moves from Koraidon and Miraidon. With Tera Water, Great Tusk resists Ice-type moves from Chien-Pao and Flare Blitz from Koraidon. Tera Ghost grants an immunity to Fighting-type moves from Koraidon and Rapid Spin from opposing Great Tusk and Iron Treads. Koraidon is a great teammate, as it can set up sun for Great Tusk, while it, in return, threatens or cripples walls that check Koraidon, making it easier for Koraidon to deal with them. Great Tusk gets easily pressured by special attackers such as Iron Bundle, Flutter Mane, and Miraidon, so special walls such as Corviknight, Blissey, and Clodsire are appreciated as teammates.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Great Tusk's high Attack stat and powerful STAB moves make it a premier revenge killer with Choice Scarf, capable of threatening OHKOes on Miraidon, Iron Bundle, and Chien-Pao. Knock Off and Rapid Spin capitalize on Great Tusk's ability to force switches, potentially crippling the likes of Corviknight, Pelipper, and Alomomola and removing entry hazards in a pinch. Moreover, Knock Off is very useful for popping Gholdengo's Air Balloon. Stone Edge is an alternative to Rapid Spin, enabling a 2HKO on Pelipper and Tera Flying Kingambit. Tera Ground amps up Headlong Rush against foes such as Tera Fairy Miraidon and Annihilape, as well as 2HKOing common Tera Fairy walls like Toxapex and Skeledirge. Tera Fighting boosts Close Combat instead, securing a 2HKO on Corviknight. Tera Fighting also retains a handy resistance to Chien-Pao and Kingambit's Sucker Punch while eliminating an exploitable weakness to Chien-Pao's Ice Shard. Both Tera types provide the necessary boost to OHKO Koraidon and 2HKO Alomomola after Stealth Rock damage. Great Tusk boasts perfect offensive synergy with Miraidon by pressuring Clodsire, Iron Treads, and Ting-Lu. In return, Miraidon scares out Corviknight, Pelipper, and Alomomola. Koraidon pairs nicely with Great Tusk as well, activating Protosynthesis, threatening Corviknight, and overwhelming shared checks in Pelipper, bulky Great Tusk, and Alomomola. In exchange, Great Tusk frightens Toxapex and Skeledirge. Gothitelle traps and removes Corviknight, Pelipper, Alomomola, bulky Great Tusk, and Dondozo, facilitating a late-game sweep. Similarly, special attacking partners like Iron Bundle, Chi-Yu, Walking Wake, and Flutter Mane greatly pressure the aforementioned checks. Great Tusk requires defensive support to fall back on, as it is incapable of revenge killing Choice Scarf and Flame Charge Koraidon, boosted Chien-Pao with Ice Shard, Iron Bundle under Electric Terrain, Flutter Mane under sun, and Choice Scarf and Agility Miraidon, so Toxapex and Clodsire are solid teammates. Lastly, Choice Scarf Great Tusk is easily exploitable once it's locked into Rapid Spin, so Corviknight is a convenient partner that offers additional entry hazard removal with Defog and helps check Chien-Pao, Flutter Mane, and Iron Bundle.</p> "
      },
      {
        "name": "Offensive Bulk Up",
        "description": "<p>Bulk Up pushes Great Tusk's physical stats into the stratosphere, magnifying its capabilities as a wincon that can brute force through traditional checks like Corviknight and defensive Great Tusk lacking Bulk Up. While boasting less firepower than Headlong Rush, Earthquake has more PP and avoids defense drops, Toxapex's Baneful Bunker, and Rocky Helmet damage from defensive Great Tusk and Alomomola. Boosted Close Combat hits Corviknight for massive amounts of damage and OHKOes Breloom lacking Focus Sash. Alternatively, boosted Knock Off OHKOes offensive Air Balloon Gholdengo and cripples Pelipper and Dondozo. Rapid Spin allows Great Tusk to outpace the entire unboosted metagame after one use and remove entry hazards from Ting-Lu, Clodsire, and Iron Treads. Alternatively, Substitute can set up a buffer against revenge killers—especially special variants such as Miraidon, Iron Bundle, and Flutter Mane—in the process of boosting past a check like Corviknight. It also allows Great Tusk to avoid status, easing setup against Pokemon such as Toxapex and Clodsire. Tera Ground powers up Great Tusk's main STAB move, notably securing an OHKO on Iron Bundle with Headlong Rush and Toxapex with +1 Earthquake. Tera Steel grants resistances to Ice-, Flying-, Fairy-, and Dragon-type moves instead, potentially flipping the matchup against Chien-Pao, Brave Bird Corviknight, Flutter Mane, and Miraidon. It also allows Headlong Rush variants to avoid Baneful Bunker's poison. Paired with Knock Off, Tera Steel can even allow Great Tusk to overwhelm Pelipper lacking Surf. A Jolly nature may be used to outspeed Modest Chi-Yu, but is generally inferior to an Adamant nature due to a noticeable drop in power. Great Tusk fits well on both balance and offensive teams as a threatening wincon that can compress entry hazard removal. It is imperative to pair Great Tusk with teammates that can take advantage of obstacles like Pelipper, Alomomola, and Dondozo; Breloom on hyper offense, Gothitelle and Walking Wake on balance, and Miraidon and Iron Bundle on both archetypes can help in this regard. Similarly, Koraidon and Chien-Pao can lure in or overwhelm these shared obstacles on both balance and hyper offense; the former also activates Great Tusk's Protosynthesis. Focus Sash Breloom especially appreciates Great Tusk removing entry hazards, overwhelming Corviknight, and potentially luring Air Balloon Gholdengo in and punishes it with Knock Off. Great Tusk requires a defensive backbone on balance teams against the likes of Miraidon, Iron Bundle, Chien-Pao, and Flutter Mane. A core consisting of Clodsire, Toxapex, and Corviknight can help check these threats. Defog Corviknight is especially crucial in case Rapin Spin is forgone for Substitute. Moreover, both Clodsire and Toxapex can absorb Toxic Spikes, alleviating a lot of pressure from Rapid Spin variants.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pichus", "user_id": 374620}, {"username": "Frozoid", "user_id": 532881}, {"username": "Guard", "user_id": 360582}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Frozoid", "user_id": 532881}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Fc", "user_id": 511624}, {"username": "Geysers", "user_id": 426798}, {"username": "TaxFraud", "user_id": 584685}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Dawn of Ares", "user_id": 467437}, {"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Scream Tail": {"sets": [{"name": "Defensive"}]},
  "Flutter Mane": {"sets": [{"name": "Assault Vest"}, {"name": "Expert Belt"}]},
  "Slither Wing": {"sets": [{"name": "Choice Band"}, {"name": "Defensive"}]},
  "Iron Treads": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Iron Treads is a decent check to Flutter Mane and Miraidon—especially Calm Mind + Agility variants of the latter—due to its serviceable bulk and useful defensive typing. Knock Off can cripple common switch-ins such as Great Tusk, Ting-Lu, and Corviknight. Rapid Spin makes Iron Treads one of the best entry hazard removers in the metagame, but Volt Switch can be used instead to help keep up the momentum for its team if another entry hazard remover is present. Occa Berry weakens Overheat and Mystical Fire from Miraidon and Flutter Mane, respectively. Alternatively, Leftovers can be used for greater longevity. 16 Defense IVs ensure that Iron Treads's Special Defense is boosted in Electric Terrain, allowing it to more effectively check Miraidon. Tera Fairy provides a resistance to Koraidon's Close Combat, neutrality to Miraidon and Flutter Mane's coverage moves, and immunity to Miraidon's Draco Meteor. Tera Water instead lets Iron Treads resist Fire-type attacks from the aforementioned Miraidon and Flutter Mane, Water-type attacks from Palafin-H and Iron Bundle, as well as Iron Bundle's Ice Beam. Iron Treads is able to support offensive teammates that are susceptible to entry hazards such as Choice Specs Iron Bundle and Choice Band Chien-Pao thanks to Rapid Spin, and it can also aid Miraidon and Koraidon by switching into Fairy- and Dragon-type moves aimed at them. Iron Treads requires teammates such as Corviknight, Toxapex, Pelipper, and Alomomola that can check Iron Bundle, Koraidon, Chien-Pao, and Great Tusk for it. It especially benefits from being paired with one of the latter two, as Pelipper can set up rain to weaken Fire-type attacks, while Alomomola can heal it via Wish. Due to its reliance on prediction to handle Overheat Miraidon, Iron Treads also appreciates having another Miraidon check like Clodsire, Ting-Lu, or Blissey.</p> "
      },
      {"name": "Offensive Utility"}
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Geysers", "user_id": 426798}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Iron Bundle": {
    "sets": [
      {
        "name": "Heavy-Duty Boots",
        "description": "<p>Iron Bundle is a phenomenal wallbreaker with perfect neutral coverage that also outpaces key threats like Koraidon, Miraidon, Chien-Pao, and Flutter Mane. Ice Beam in tandem with Tera Ice allows Iron Bundle to have a favorable chance at OHKOing Miraidon while also cleanly OHKOing Koraidon. Alternatively, Substitute + Encore takes advantage of Pokemon such as Corviknight, Clodsire, and Blissey making Iron Bundle much more difficult to force out. Substitute also enables Iron Bundle to easily outplay Sucker Punch from Chien-Pao and Kingambit, as well as safely scout for opposing Terastallization. Encore can also rapidly deplete the limited PP of recovery moves from the aforementioned Corviknight, Blissey, and Clodsire. Taunt is also an option to shut down recovery attempts and status moves altogether, while U-turn can be used to pivot out on Iron Bundle's checks and gain momentum. Tera Ice, in addition to powering up Ice Beam and Freeze-Dry, resists opposing Freeze-Dry, while Tera Water Hydro Pump 2HKOes Ting-Lu and specially defensive Corviknight after Stealth Rock. Iron Bundle appreciates partners such as Pelipper and Miraidon which can boost Hydro Pump and its Speed, respectively, with the former also being able to check Choice Scarf Koraidon and safely bring it in thanks to U-turn. Dugtrio and Gothitelle also make for good teammates, as they can can trap and subsequently cripple or remove Clodsire and Blissey. In addition, physical threats including Koraidon, Chien-Pao, and Great Tusk appreciate the free switches Iron Bundle provides via Flip Turn or Pokemon it has afflicted with Encore.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Iron Bundle is a great wallbreaker due to its unresisted STAB combination of Hydro Pump + Freeze-Dry boosted by Choice Specs and good Speed tier, which outspeeds common base 135 Speed Pokemon such as Chien-Pao, Koraidon, and Miraidon. Ice Beam is its strongest Ice-type STAB move and OHKOes Koraidon and Miraidon, while Flip Turn pivots on Blissey and gains momentum. With Tera Ice, Iron Bundle cleanly OHKOes Miraidon and Toxapex with Freeze-Dry and also resists Freeze-Dry from Ditto and opposing Iron Bundle. Alternatively, Tera Water with rain support boosts Hydro Pump to an incredible level, allowing Iron Bundle to 2HKO Blissey after slight chip. Choice Specs enables Iron Bundle to 2HKO Corviknight, Scream Tail, and Ting-Lu. Entry hazard removal options such as Corviknight, Great Tusk, and Iron Treads are greatly appreciated by Iron Bundle, as it can wear down pretty easily due to its Stealth Rock weakness. Miraidon is a good teammate as it sets Electric Terrain and activates Quark Drive, giving Iron Bundle a Speed boost while also luring in Ting-Lu and Iron Treads. Pelipper sets up rain for Iron Bundle while also being a good Koraidon check.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}, {"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "lotiasite", "user_id": 302985}, {"username": "Guard", "user_id": 360582}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Iron Hands": {"sets": [{"name": "Swords Dance"}, {"name": "Assault Vest"}]},
  "Iron Moth": {
    "sets": [
      {
        "name": "Agility",
        "description": "<p>Iron Moth is a threatening Agility user on hyper offense teams that can clean up or weaken opposing teams, outspeeding the entire unboosted metagame after a single Agility. It also notably absorbs Toxic Spikes, which is otherwise very annoying for offensive teams. Fiery Dance is the Fire-type STAB move of choice, as it gives Iron Moth potential to snowball out of control. Psychic hits Toxapex and Clodsire super effectively, always 2HKOing the former and 2HKOing the latter after minimal chip damage, and is Iron Moth's best way to pressure Skeledirge. Dazzling gleam nails Dark- and Dragon-type Pokemon such as Ting-Lu, Miraidon, and Koraidon, whereas Energy Ball hits Ting-Lu harder and instead deals super effective damage to Garganacl and bulky Water-types such as Alomomola and Dondozo. Tera Fairy boosts Dazzling Gleam, allowing Iron Moth to OHKO Miraidon and 2HKO Ting-Lu after minimal chip damage, and lets Iron Moth resist Sucker Punch from Chien-Pao and Kingambit, making it harder to revenge kill. Alternatively, Tera Grass boosts Energy Ball, enabling it to always 2HKO Ting-Lu and OHKO Garganac and Dondozo, and turns Iron Moth's Ground- and Water-type weaknesses into resistances. The given EVs allow Iron Moth to survive an unboosted Dragon Claw from Koraidon and Psyshock from Flutter Mane, with the remainder being put into Speed, notably allowing it to outspeed a Quark Drive-boosted Iron Bundle at +2. Entry hazards from typical hyper offense leads like Glimmora, Froslass, and Cloyster can weaken foes into Iron Moth's KO range. Miraidon is another good partner, as they can weaken their shared checks in Clodsire, Ting-Lu, and Blissey for the other. Grimmsnarl can set Light Screen and Reflect for Iron Moth, making it easier for it to safely use Agility and harder to revenge kill. Other hyper offense staples such as Koraidon, Chien-Pao, and Great Tusk are good teammates, as they can threaten Clodsire and Ting-Lu for it, whilst Iron Moth threatens Toxapex and Corviknight for them in return. Koraidon can also notably lure Skeledirge and remove it with Stomping Tantrum as well as boost Iron Moth's Fiery Dance via sun.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "Frozoid", "user_id": 532881}, {"username": "Guard", "user_id": 360582}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Baxcalibur": {"sets": [{"name": "Dragon Dance"}]},
  "Gholdengo": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Gholdengo is a strong revenge killer with a unique typing that gives it nearly perfect coverage. Gholdengo's ability and typing make it immune to Defog, Rapid Spin, Mortal Spin, and status moves, giving it a niche over other special attackers. Trick is useful to cripple special walls like Blissey, Iron Treads, Clodsire, and Ting-Lu by locking them into unfavorable moves, thus supporting teammates like Miraidon and Iron Bundle. Focus Blast targets Chi-Yu, Kingambit, and Iron Treads. Alternatively, Recover may be used to grant Gholdengo longevity, while Nasty Plot helps it function as a cleaner in the late-game. Tera Water gives it a better defensive typing by allowing it to deal better with Choice Scarf Koraidon. Tera Ghost gets rid of Gholdengo's Ground-type weakness while retaining immunity to Rapid Spin and strengthens Shadow Ball. Lastly, Tera Fighting weakens otherwise super effective hits from Chien-Pao and Kingambit to allow Gholdengo to revenge kill them while also boosting Focus Blast to deal more damage to Ting-Lu, Chi-Yu, and Iron Treads. Gholdengo works best with entry hazard setters and defensive walls such as Ting-Lu, Clodsire, Great Tusk, and Iron Treads, as well as strong attackers like Chien-Pao, Miraidon, Koraidon, and Iron Bundle, that appreciate Gholdengo's ability to revenge kill, block hazard removal, and cripple walls. Toxapex and Alomomola are useful to check Swords Dance + Flame Charge Koraidon and Sucker Punch Chien-Pao, as they are not revenge killed by Gholdengo.</p> "
      },
      {
        "name": "Nasty Plot Sweeper",
        "description": "<p>Gholdengo is a threatening setup sweeper on hazard stack teams due to its unique typing and ability. The combination of Shadow Ball and Make it Rain offers nearly perfect coverage. Recover ensures longevity, allowing it to switch into walls repeatedly, notably Corviknight and Blissey; alternatively, Focus Blast easily breaks Ting-Lu and Iron Treads. Air Balloon makes it immune to Ground-type attacks from Iron Treads and Great Tusk, allowing Gholdengo to comfortably switch into them if expecting Rapid Spin. Tera Water gives it a stronger defensive typing, notably against Koraidon and Iron Bundle. Tera Ghost is an option that removes the Ground-type weakness, while still retaining the ability to block Rapid Spin. Gholdengo requires support from entry hazard setters such as Ting-Lu, Glimmora, and Great Tusk. Iron Treads and Clodsire are solid entry hazard setters that also check Miraidon, which is a huge threat for Gholdengo. Physical walls like Toxapex and Alomomola are able to switch into and chip revenge killers like Koraidon and Chien-Pao via Rocky Helmet, making it easier for Gholdengo to sweep. Teammates such as Koraidon, Chien-Pao, Miraidon, and Iron Bundle make the most out of Gholdengo's wallbreaking power and ability to block entry hazard removal.</p> "
      },
      {"name": "Defensive"}
    ],
    "credits": {"writtenBy": [{"username": "pichus", "user_id": 374620}], "teams": [{"name": "Quality checked by", "members": [{"username": "Seldanna", "user_id": 471586}, {"username": "Guard", "user_id": 360582}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Wo-Chien": {"sets": [{"name": "Defensive"}]},
  "Chien-Pao": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Chien-Pao is one of the most formidable wallbreakers in AG thanks to its incredible Speed tier, outpacing almost the entire metagame, and massive firepower. Icicle Crash is the preferred Ice-type STAB move due to its higher power, flinch chance to potentially beat walls like Corviknight and Garganacl, and avoidance of adverse contact effects like Baneful Bunker and Rocky Helmet; however, Ice Spinner is more consistent and can also remove Electric Terrain. Ice Shard gives Chien-Pao a powerful way to revenge kill opposing offensive threats, notably threatening Flutter Mane, Koraidon, Miraidon, and Choice Scarf Great Tusk. Sucker Punch is also an option, as it hits Choice Scarf Chi-Yu and Iron Bundle much harder while still threatening Flutter Mane and Miraidon. In the last slot, Sacred Sword hits Garganacl and OHKOes Kingambit and Chi-Yu, which would otherwise switch in fairly safely and force Chien-Pao out. Alternatively, running Ice Shard and Sucker Punch together is also an option, allowing Chien-Pao to pressure both Iron Bundle and Koraidon effectively while also ensuring that it beats other Chien-Pao consistently. An Adamant nature is preferable as it guarantees a 2HKO on Toxapex after Stealth Rock with Crunch while also getting favorable rolls against Corviknight and Ting-Lu, although Jolly is also viable in order to speed tie with unboosted Miraidon, Koraidon, and Flutter Mane. Chien-Pao's best Tera type is Dark, which drastically boosts Crunch, making it much easier for it to break through Alomomola, Corviknight, and Toxapex while guaranteeing an OHKO on Iron Bundle with Sucker Punch. Tera Ice is also viable, notably netting an OHKO against Miraidon and a good chance to OHKO Koraidon with Ice Shard. Chien-Pao fits well on all manner of balance teams, pairing extremely well with Miraidon thanks to their ability to effectively pressure each other's checks, with Chien-Pao threatening Clodsire, Ting-Lu, and Iron Treads while Miraidon threatens Corviknight, Alomomola, and Toxapex. Gothitelle is also a great teammate that can trap and remove Chien-Pao's checks, notably beating Toxapex and Alomomola. Due to its frailty and its tendency to be forced out after locking into a move, Chien-Pao needs a sturdy defensive backbone to support it, so balance staples like Corviknight, Ting-Lu, Toxapex, and Skeledirge can all be good teammates for their ability to handle Pokemon like Koraidon, Great Tusk, and Miraidon which might attempt to take advantage of Chien-Pao.</p> "
      },
      {
        "name": "Setup Sweeper",
        "description": "<p>Chien-Pao is one of the most threatening sweepers in Anything Goes due to its solid typing, ability, and stats. Swords Dance allows Chien-Pao to break through walls such as Toxapex, Alomomola, and Corviknight. Ice Spinner can be considered over Icicle Crash due to its perfect accuracy, but it is a slightly weaker contact move that cannot flinch. Sucker Punch is the preferred priority move option, allowing it to OHKO Flutter Mane without a boost, as well as Iron Bundle and Miraidon after a Swords Dance. Alternatively, Ice Shard OHKOes Koraidon, Miraidon, and Flutter Mane at +2 Attack after Stealth Rock. Heavy-Duty Boots is the best item on this set, but Life Orb and Focus Sash are solid picks on hyper offense builds and other teams with good entry hazard control. Life Orb lets Chien-Pao get some crucial OHKOs at +2 Attack, notably against Miraidon and Koraidon with Ice Shard and Corviknight and Toxapex with Crunch. Tera Dark makes its Dark-type moves stronger while shedding the weaknesses from its Ice typing, notably reducing Stealth Rock damage and weakening Iron Head and Body Press from Corviknight as well as Torch Song from Skeledirge. Chien-Pao fits best on offensive teams and flourishes with other wallbreakers like Miraidon, Koraidon, Iron Bundle, and offensive Great Tusk. On bulkier builds, teammates like defensive Great Tusk, Ting-Lu, and Iron Treads set entry hazards while checking fast Pokemon like Koraidon and Miraidon. If forgoing Heavy-Duty Boots, it is essential to pair Chien-Pao with lead entry hazard setters like Glimmora and Froslass on offensive teams and Iron Treads and Great Tusk on bulkier teams, as they additionally prevent opposing entry hazards from going up.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "pichus", "user_id": 374620}, {"username": "Geysers", "user_id": 426798}], "teams": [{"name": "Quality checked by", "members": [{"username": "Seldanna", "user_id": 471586}, {"username": "Guard", "user_id": 360582}, {"username": "pichus", "user_id": 374620}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Ting-Lu is a great entry hazard setter with defensive utility, checking threatening special attackers like Miraidon and Gholdengo. It setting both Stealth Rock and Spikes while providing an invaluable Electric immunity makes it a balance staple. Ruination can be used over one of the entry hazards to threaten potential switch-ins like Great Tusk, Koraidon, opposing Ting-Lu, Air Balloon Gholdengo, and Corviknight, which would otherwise come in freely and force Ting-Lu out. Whirlwind lets Ting-Lu deter setup attempts by Tera Fairy Miraidon or simply force out foes to inflict entry hazard damage. Alternatively, Protect can be used for more Leftovers recovery and scouting attacks, although it must be used carefully to avoid Chien-Pao, Koraidon, and Miraidon getting a free turn to set up. Ghost is the preferred Tera type to block Rapid Spin from Iron Treads and Great Tusk, as well as removing Ting-Lu's weaknesses to Iron Bundle's and Koraidon's STAB moves, which lets it effectively check them. Alternatively, Tera Steel grants immunity to Toxic, makes Ting-Lu a solid check to Iron Bundle and Flutter Mane, and eases the matchup against Double Dance Tera Fairy Miraidon. Ting-Lu is most effectively paired with Pokemon like Toxapex, Skeledirge, and Alomomola that can handle physical attackers, notably Koraidon, Chien-Pao, Iron Treads, and Great Tusk, that force it out. Ting-Lu isn't a particularly consistent Miraidon check, notably struggling against Calm Mind and Choice Specs Miraidon sets, so backup checks such as Iron Treads and Clodsire can also be very useful. If Ting-Lu is running Spikes, spinners like Iron Treads and Great Tusk can be tremendously valuable, removing enemy entry hazards while leaving your own Spikes intact. It also greatly appreciates teammates such as Miraidon, Koraidon, Iron Bundle, and Chien-Pao that can pressure opposing hazard removers, and in turn they appreciate Ting-Lu's hazards chipping down their checks. Gholdengo and Annihilape can also be good teammates because they outright block or severely punish hazard removal, respectively.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Geysers", "user_id": 426798}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Fc", "user_id": 511624}]}, {"name": "Grammar checked by", "members": [{"username": "Estarossa", "user_id": 461329}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Chi-Yu": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Chi-Yu is a potent revenge killer and a strong wallbreaker with good resistances, allowing it to check threats like Chien-Pao, Gholdengo, and Kingambit while also threatening balance and bulky offensive teams. Overheat is its strongest STAB move, which allows it to OHKO the bulkiest Pokemon like Blissey and Ting-Lu especially when boosted by Tera Fire and sun. Dark Pulse lets it pressure Fire-resistant foes like Miraidon, Toxapex, Pelipper, Alomomola, and Garganacl more easily. Fire Blast is a stronger option than Flamethrower that doesn't drop Special Attack, which lets Chi-Yu break through Garganacl and Blissey after minimal chip damage when boosted by sun and Tera Fire. Alternatively, Psychic may be used to deal greater damage to Toxapex and Koraidon. Tera Fire is mandatory to boost Chi-Yu's strength and let it spam its Fire-type moves more freely. Choice Scarf Chi-Yu is unreliable at breaking stall teams, so it is necessary to pair it with wallbreakers that perform this role such as Choice Band Chien-Pao, offensive Great Tusk, Gothitelle, and Swords Dance + Life Orb Koraidon. Koraidon in particular is mandatory to have as a teammate, as it sets sun, which makes up for the power lost by opting for Choice Scarf on Chi-Yu. Additionally, it also creates many opportunities for Chi-Yu to switch in safely thanks to U-turn and Chi-Yu's ability to exploit common Koraidon checks. Defensive partners like Great Tusk, Iron Treads, Clodsire, and Toxapex can set and remove entry hazards for Chi-Yu, allowing it to freely switch in multiple times and break teams more easily, and they also check strong revenge killers like Choice Scarf Koraidon, Miraidon, and Quark Drive-boosted Iron Bundle.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Chi-Yu is one of the metagame's most devastating wallbreakers. Beads of Ruin and a high Special Attack stat let it consistently force a KO whenever it comes in. Overheat allows Chi-Yu to OHKO or 2HKO even bulky resistant foes, with Flamethrower having perfect accuracy and not dropping Chi-Yu's Special Attack. Dark Pulse allows Chi-Yu to immediately threaten Fire-resistant Pokemon like Toxapex, Skeledirge, and Garganacl, 2HKOing or OHKOing them without sun. Fire Blast can reach important damage thresholds, such as 2HKOing Blissey, without the Special Attack drop that accompanies Overheat, with Psychic instead preventing Toxapex from scouting Chi-Yu's move. Tera Fire turns Chi-Yu's 2HKOs against Pokemon like Toxapex and Double Dance Miraidon into OHKOs under sun, and it guarantees 2HKOs on even the bulkiest defensive Pokemon like Blissey and Garganacl, OHKOing them in sun and with minor chip damage. A Modest nature is preferred, but a Timid nature can be considered if Jolly Great Tusk is an issue. Koraidon is an incredible partner, setting sun and bringing Chi-Yu in with U-turn; in exchange, Chi-Yu greatly threatens all of Koraidon's checks. Pivots such as Corviknight and the aforementioned Koraidon are greatly appreciated, as they can let Chi-Yu switch in without worrying about its poor bulk. Entry hazard removal from Great Tusk, Corviknight, or Iron Treads is very helpful due to Chi-Yu's weakness to Stealth Rock and its tendency to switch out after a KO. Chi-Yu is often forced out by faster Pokemon like Miraidon and Koraidon, so defensive switch-ins to them like Clodsire, Toxapex, Ting-Lu, and Corviknight are good partners.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TaxFraud", "user_id": 584685}, {"username": "pichus", "user_id": 374620}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "lotiasite", "user_id": 302985}, {"username": "Fc", "user_id": 511624}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Tea Guzzler", "user_id": 577920}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Roaring Moon": {"sets": [{"name": "Dragon Dance"}]},
  "Iron Valiant": {
    "sets": [
      {
        "name": "Mixed Attacker",
        "description": "<p>Mixed Iron Valiant is a wallbreaker with wide-reaching coverage for the majority of defensive pokemon; it can also revenge kill faster offensive threats thanks to Quark Drive. Thunderbolt lets it break through Toxapex and Corviknight, notably OHKOing them in Electric Terrain after minimal chip. Thunderbolt is also Iron Valiant's best method of hitting Skeledirge, 2HKOing it under Electric Terrain. Psyshock lets Iron Valiant break through Clodsire. Alternatively, Knock Off removes items from switch-ins like Skeledirge and Corviknight, but its outclassed by Psyshock on most teams. Tera Fairy powers up Iron Valiant's Moonblast while maintaining its resistance to Chien-Pao and Kingambit's Sucker Punch and Breloom's Mach Punch, as well as maintaining its immunity to Dragon-type moves. Iron Valiant is best used on offensive teams, which appreciate it taking on common walls like Ting-Lu, Clodsire, Toxapex, and Corviknight, as well as it threatening offensive pokemon such as non-Choice Scarf Miraidon and Koraidon, Kingambit, Chien-Pao, and Choice Scarf Chi-Yu and Great Tusk under Electric Terrain. Miraidon is a fantastic partner because it sets Electric Terrain for Iron Valiant. Additionally, Miraidon can pivot into Iron Valiant so it can threaten its checks. Cleaners such as Swords Dance Chien-Pao, Swords Dance Koraidon, Kingambit, Breloom, and Iron Bundle appreciate Iron Valiant softening up their checks early-game for them. Choice Scarf Miraidon and Koraidon, Flutter Mane under sun, and Iron Bundle outspeed and threaten out Iron Valiant, so checks to them such as Clodsire, specially defensive Corviknight, defensive Great Tusk, Skeledirge, and Toxapex are appreciated. Corviknight and Great Tusk in particular can also remove entry hazards, alllowing Iron Valiant to switch in more freely,increasing its longevity. Gothitelle also pairs well with Iron Valiant, as it traps defensive Pokemon such as Clodsire and Toxapex. This is especially important for Knock Off variants of Iron Valiant, as they cannot break through Clodsire.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Koraidon": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Flame Charge gives Koraidon solid sweeping potential by allowing it to outrun most Choice Scarf users. Swords Dance provides maximum damage potential, allowing Koraidon to reliably break past most walls. Low Kick hits Pokemon such as Great Tusk, Ting-Lu, and Garganacl hard and without any drawbacks; alternatively, Drain Punch is a weaker option that boosts Koraidon's resiliency. Wild Charge deals with Pelipper and Toxapex, which otherwise wall Koraidon. Stomping Tantrum may be run to overwhelm Skeledirge instead, while also denting Toxapex after a boost. Outrage overwhelms all of these checks in one slot, but it also makes Koraidon susceptiple to revenge killers such as Iron Bundle and Flutter Mane. Tera Fire boosts Flame Charge and lets Koraidon resist Ice- and Fairy-type moves from Iron Bundle, Chien-Pao, and Flutter Mane while also making it immune to Will-O-Wisp from Skeledirge. Tera Steel can be run with Iron Head, providing key resistances to Ice, Fairy, and Dragon. Special attackers such as Flutter Mane, Walking Wake, and Chi-Yu appreciate Koraidon setting up sun. In return, they pressure Koraidon's checks in Skeledirge, Pelipper, and Great Tusk. Koraidon's ability to pressure special walls such as Ting-Lu and Clodsire is appreciated by Pokemon such as Flutter Mane, Miraidon, and Gholdengo. This set fits well on hyper offense teams, so support from entry hazard setters like Glimmora, Masquerain, and Froslass as well as dual screens support from Grimmsnarl is appreciated. Miraidon and Chien-Pao are good teammates, as they can pressure Toxapex and Skeledirge, respectively. Great Tusk is a great teammate, as it can take advantage of Koraidon's sun and break through Toxapex and Skeledirge while also pressuring Pelipper with Knock Off.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Koraidon is an excellent revenge killer, taking out non-Choice Scarf Koraidon and Miraidon, Iron Bundle outside of Electric Terrain, and Chi-Yu with ease. U-turn lets Koraidon generate momentum for its team thanks to the many switches it forces. Close Combat is Koraidon's strongest Fighting-type STAB move, but Collision Course avoids dropping defenses. Dragon Claw is a secondary STAB option that OHKOes opposing Koraidon and Miraidon, but Wild Charge hits Water-types such as Pelipper and Toxapex. Flare Blitz allows Koraidon to threaten Corviknight, Gholdengo, Flutter Mane, and Tera Fairy Miraidon. Tera Fire further boosts Flare Blitz while also thwarting Will-O-Wisp attempts from Skeledirge and letting Koraidon resist the common Fairy- and Ice-type moves aimed at it. Wallbreakers such as Chi-Yu, Great Tusk, Choice Band Chien-Pao, Choice Specs Walking Wake, and Miraidon make excellent partners for Koraidon, as it can bring them in safely with U-turn. Chi-Yu, Walking Wake, and Great Tusk especially enjoy Koraidon being able to set up sun for them, which boosts the former's Fire-type attacks and activates the latter two's Protosynthesis. Koraidon also appreciates having hazard removal options in Great Tusk, Iron Treads, and Corviknight to avoid being too quickly worn down by the combination of entry hazards damage, Flare Blitz recoil, and Rocky Helmet damage from common Koraidon checks. In addition, defensive counterplay in the form of bulky Pokemon such as Corviknight, Ting-Lu, Iron Treads, Toxapex, or Clodsire is required to handle Pokemon that Koraidon cannot outspeed and reliably revenge kill, such as Flame Charge Koraidon, Iron Bundle under Electric Terrain, Agility Miraidon, Ice Shard Chien-Pao, and Flutter Mane.</p> "
      },
      {
        "name": "All-out Attacker",
        "description": "<p>Great Attack and Speed stats along with a solid moveset make Koraidon an incredible wallbreaker. Close Combat hits Steel- and Dark-types such as Iron Treads and Ting-Lu. Flare Blitz OHKOes Corviknight, Iron Treads, and Gholdengo and allows Koraidon to deal with Scream Tail better. Flare Blitz also breaks through Toxapex, Great Tusk, and Skeledirge if they have Terastallized into the Fairy type. Stomping Tantrum 2HKOes Skeledirge and Toxapex. Additionally, Skeledirge switching into Close Combat on the previous turn doubles Stomping Tantrum's power, allowing Koraidon to OHKO Skeledirge. Wild Charge OHKOes Pelipper and 2HKOes Toxapex. Alternatively, Outrage is a good all-around Dragon-type STAB option that still hits Pelipper and Alomomola but makes it vulnerable to Tera Fairy from checks such as Pelipper and Toxapex as well as revenge killers such as Flutter Mane and Iron Bundle. Tera Fire boosts Flare Blitz, lets Koraidon ward off Will-O-Wisp from Skeledirge, and lets it resist Ice- and Fairy-type moves from Pokemon such as Chien-Pao and Iron Bundle, Double Dance Miraidon, and Flutter Mane. Entry hazard removal options such as Corviknight, Great Tusk, and Iron Treads are good teammates, as Koraidon can easily get worn down due to Life Orb and Flare Blitz recoil as well as Rocky Helmet chip from Alomomola and Toxapex. Corviknight can also switch into Iron Bundle and Flutter Mane, which can KO Koraidon after minimal chip. Offensive Pokemon such as Great Tusk, Walking Wake, and Chi-Yu take full advantage of Koraidon's ability to set up sun. Miraidon pressures Koraidon's checks like Great Tusk and Skeledirge well and appreciates Koraidon's ability to pressure its checks like Iron Treads and Ting-Lu as well.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Koraidon is a threatening wallbreaker thanks to its strong STAB moves and massive firepower. U-turn is a safe midground that lets Koraidon generate momentum for its team while gradually whittling down checks like Skeledirge, Scream Tail, and Great Tusk. Heavy Slam can be used over Flare Blitz to hit Dachsbun and Scream Tail at the cost of making Koraidon even more dependent on predictions to break through Corviknight. Tera Fire is Koraidon's Tera type of choice because it boosts Flare Blitz's damage output and grants a resistance to Ice- and Fairy-type moves from Chien-Pao, Iron Bundle, Miraidon, and Flutter Mane. Choice Band Koraidon fits best on balance teams that appreciate its massive firepower and can give it the support it needs to excel. Notable offensive teammates include Chi-Yu, Great Tusk, and Miraidon which all appreciate it setting sun and can pressure its few checks in Toxapex, Skeledirge, and Great Tusk. Koraidon is extremely prediction-reliant and susceptible to revenge killing from Pokemon like Flutter Mane, Iron Bundle, Chien-Pao, Miraidon, and Choice Scarf Koraidon, so it needs a solid defensive core to support it with balance staples like Corviknight, Toxapex, Clodsire, Ting-Lu, Skeledirge, and Iron Treads.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Geysers", "user_id": 426798}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "Guard", "user_id": 360582}, {"username": "Frozoid", "user_id": 532881}]}, {"name": "Grammar checked by", "members": [{"username": "lotiasite", "user_id": 302985}, {"username": "UT", "user_id": 523866}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Miraidon": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Miraidon is an extremely threatening wallbreaker due to its great stats along with its good movepool. Draco Meteor + Electro Drift make a great STAB combination, allowing Miraidon to hit almost every Pokemon in the metagame at least neutrally. Overheat is a great coverage move that lets Miraidon KO Iron Treads, which otherwise walls Miraidon pretty easily. Parabolic Charge is an alternative to Electro Drift on sets with Substitute in order to recover health while also making Miraidon a good late-game cleaner. Tera Dragon lets Miraidon OHKO Ting-Lu and Clodsire using Draco Meteor after a single Calm Mind boost. Entry hazard removal options such as Corviknight, Great Tusk, and Iron Treads are great teammates, as Miraidon can wear down quickly due to Life Orb recoil and hazards; those teammates can also soak up offensive pressure from Pokemon such as Iron Bundle, Koraidon, and Flutter Mane, respectively. Corviknight can also pivot Miraidon in, giving it a great opportunity to set up. Physical attackers such as Great Tusk, Koraidon, and Chien-Pao are good teammates, as they can easily force out special walls such as Blissey, Clodsire, and Ting-Lu, making it easier for Miraidon to sweep.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Miraidon can break through all of its checks owing to its excellent stats and stellar movepool, making it the strongest wallbreaker in Anything Goes. Overheat hits Iron Treads and also eases predictions against defensive cores such as Corviknight + Great Tusk. Tera Dragon boosts Draco Meteor, notably allowing Miraidon to 2HKO Ting-Lu while also getting rid of its weakness to Dugtrio. A Timid nature allows Miraidon to Speed tie against Koraidon and Chien-Pao, but Modest may be used to further boost its strength. Miraidon is threatened by revenge killers like Iron Bundle, Chien-Pao, and Choice Scarf users like Koraidon, Miraidon, and Great Tusk, so special walls like Clodsire and Blissey and physical walls like Toxapex, Great Tusk, and Alomomola are used to soak the offensive pressure. Dugtrio can trap Iron Bundle, Clodsire, and Iron Treads, as well as opposing Miraidon and Koraidon locked into Dragon-type moves with Tera Fairy.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Miraidon is a powerful cleaner and revenge killer, forcing out many of the tier's most powerful wallbreakers such as Choice Band Koraidon, Choice Specs Miraidon, and Great Tusk while threatening to sweep late-game after its checks have been removed. Overheat is a nice midground option that lets Miraidon take out Corviknight and Iron Treads while threatening Ground-types without risking being locked into a move that has immunities. U-turn takes advantage of Miraidon's ability to threaten most of the metagame to generate momentum for its teammates. Miraidon's preferred Tera type is Fairy, which allows it to force a 50/50 against opposing Choice Scarf Miraidon and Koraidon. Tera Fairy also removes Miraidon's Ice-weakness, allowing it to survive hits from Iron Bundle and Chien-Pao. Alternatively, Tera Dragon can be used to substantially increase the damage done by Draco Meteor, allowing Miraidon to heavily damage Ting-Lu and more effectively break Clodsire. Tera Electric is a third option, maximizing the power of Electro Drift once opposing Ground-types have been removed. Choice Scarf Miraidon fits well on many balance teams that appreciate the revenge killing that it offers. It pairs especially well with Pokemon that can wear down its Ground-type checks, notably Chien-Pao, Great Tusk, and other Miraidon. Defensively, balance staples like Clodsire, Corviknight, Iron Treads, Ting-Lu, and Toxapex are greatly appreciated, as they can deal with Pokemon like opposing Miraidon, Great Tusk, Koraidon, and Chien-Pao that can potentially come in for free after Miraidon has picked up a KO. Gothitelle is also an especially good partner thanks to its ability to trap and remove many of Miraidon's most effective checks, notably beating Ting-Lu, Clodsire, and Blissey, clearing the way for it to sweep late-game. Similarly, Dugtrio is also a decent partner, as it can trap and eliminate opposing Choice Scarf Miraidon and Koraidon that have locked into Dragon Moves and Choice Band Chien-Pao that hasn't locked into Ice Shard while also beating Blissey, Clodsire, and chipped Iron Treads.</p> "
      },
      {
        "name": "Double Dance",
        "description": "<p>Double Dance Miraidon is one of the most potent sweepers and wincons in the AG metagame. It outspeeds the entire metagame after using Agility, and can muscle through defensive Pokemon after a boost or two from Calm Mind. Parabolic Charge greatly improves Miraidon's longevity, and Electric Terrain makes up for its low Base Power, notably letting Miraidon outheal Blissey's Seismic Toss after two Calm Mind boosts. Dazzling Gleam hits Ting-Lu, Great Tusk, and opposing Dragon-types for super effective damage. Tera Fairy enables setup on the Ice-, Ground-, and Dragon-type attacks that would otherwise threaten it, boosts the power of Dazzling Gleam, and limits revenge killing attempts from Koraidon, Miraidon, Chien-Pao, and Iron Bundle. The given EV spread allows Miraidon to outspeed Quark Drive-boosted Iron Bundle after an Agility and maximizes Leftovers recovery; the rest is put into Special Attack and Defense. Gothitelle and Dugtrio are phenomenal partners for their ability to trap Clodsire and Iron Treads, removing defensive counterplay to Miraidon. Chien-Pao and Great Tusk are able to bait in physically defensive Pokemon like Toxapex, Corviknight, and Alomomola for Miraidon to set up on and greatly threaten Clodsire and Iron Treads. With dual screens support from Grimmsnarl, Miraidon is able to set up on more Pokemon, and revenge killing it becomes even more difficult. Toxic Spikes is a major hindrance, so Poison-types like Toxapex and Clodsire, or hazard removal from Iron Treads or Corviknight is greatly appreciated.</p> "
      },
      {
        "name": "Offensive Pivot",
        "description": "<p>Miraidon is a great offensive pivot that is able to force plenty of switches due to its high Speed and incredible firepower. Heavy-Duty Boots allows Miraidon to continuously threaten the opposing team without accruing entry hazard damage. U-turn scouts for potential switches and generates momentum for teammates and is chosen over Volt Switch for the ability to pivot out against Ground-types like Ting-Lu and Clodsire. Overheat hits Iron Treads for super effective damage and alleviates predictions against teams with both Ground-types and Dragon-resistant foes, notably being a safe midground option against Corviknight and chipped Great Tusk. Tera Dragon maximizes Draco Meteor damage and increases the chances of breaking through Clodsire and Ting-Lu while also allowing Miraidon to beat Dugtrio that attempt to trap it. Trapping support from Gothitelle and Dugtrio is greatly appreciated, allowing Miraidon to bypass its limited pool of checks with ease. Koraidon, Great Tusk, Chien-Pao, and Iron Bundle are all great partners for their ability to threaten Miraidon's checks and provide opportunities for wallbreaking by forcing in Pokemon like Corviknight and Toxapex. In return, they benefit greatly from Miraidon's ability to generate momentum and bring them in safely to threaten its own checks. A strong defensive backbone is helpful to make the most of the longevity provided by Heavy-Duty Boots, so defensive Pokemon like Toxapex, Corviknight, and Clodsire are potent teammates that also check revenge killers like Choice Scarf Koraidon, Iron Bundle, and Chien-Pao. Fellow pivots like Iron Bundle, Koraidon, and Corviknight create potent VoltTurn cores with Miraidon that can wear down the opponent and give Miraidon the most opportunities. Entry hazard support from Ting-Lu or Clodsire allows Miraidon to wear down and outlast its checks, especially in tandem with VoltTurn support, so Gholdengo and Annihilape are valuable partners for their ability to deter Defog and Rapid Spin.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TaxFraud", "user_id": 584685}, {"username": "pichus", "user_id": 374620}, {"username": "Frozoid", "user_id": 532881}, {"username": "Geysers", "user_id": 426798}], "teams": [{"name": "Quality checked by", "members": [{"username": "pichus", "user_id": 374620}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Geysers", "user_id": 426798}, {"username": "Guard", "user_id": 360582}, {"username": "Seldanna", "user_id": 471586}, {"username": "lotiasite", "user_id": 302985}]}, {"name": "Grammar checked by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "UT", "user_id": 523866}, {"username": "lotiasite", "user_id": 302985}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Walking Wake": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>A good Special Attack stat, good typing, and Choice Specs make Walking Wake a devastating wallbreaker. Hydro Steam is a powerful STAB option that is extremely difficult to switch into under sun, especially with the Protosynthesis boost. It notably 2HKOes Toxapex, Miraidon, and Koraidon, as well as OHKOing Corviknight and Iron Bundle. Draco Meteor OHKOes Dragon-types such as Koraidon, Miraidon, and opposing Walking Wake, preventing them from switching in, while also 2HKOing Water Absorb Clodsire and OHKOing Toxapex in sun. Flamethrower lets Walking Wake deal with Tera Steel Clodsire. Hydro Pump provides a strong Water-type STAB move outside of sun, and it can also be used with Pelipper's rain, boosting Walking Wake's damage output to massive levels. Alternatively, Dragon Pulse can be used for greater consistency than Draco Meteor, but note that it doesn't 2HKO Clodsire. Tera Water boosts Walking Wake's Hydro Steam to an insane level, allowing it to 2HKO Blissey and OHKO Assault Vest Flutter Mane in sun. Tera Water also lets Walking Wake survive Moonblast from Flutter Mane, Dragon Claw from Koraidon, and Freeze-Dry from Iron Bundle in a pinch. Because Walking Wake can be easily revenge killed, it fits best on balance teams alongside walls such as Clodsire, Corviknight, and Toxapex. Physical attackers like Koraidon and Chien-Pao are good teammates, as they pressure Walking Wake's checks in Blissey and Water Absorb Clodsire. Koraidon in particular sets sun for Walking Wake, and it potentially lets Walking Wake in safely through U-turn, allowing it to pressure Koraidon's checks in Skeledirge, Pelipper, and Toxapex.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Geysers", "user_id": 426798}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Iron Leaves": {"sets": [{"name": "Swords Dance"}]}
}