{
  "Ivysaur": {"sets": {"Defensive": {}, "Offensive": {}}},
  "Wartortle": {"sets": {"Shell Smash": {}, "Defensive": {}}},
  "Pikachu": {"sets": {"Special Attacker": {}}},
  "Clefairy": {
    "overview": "<p>Despite its appearance and seemingly low stats, Clefairy is a deceptively sturdy wall in the NFE metagame, using its access to several great utility moves like Knock Off, Stealth Rock, and Thunder Wave to much success. Capable of running either physically or specially defensive sets, Clefairy is flexible in supporting its teammates, such as using Stealth Rock to allow partners like Gabite and Piloswine to focus more on their offensive capabilities. Magic Guard is a useful tool that allows Clefairy to avoid taking residual entry hazard chip damage while sponging status for its teammates without taking residual damage. While Clefairy does offer immense upside as a utility machine, it does compete for the role with Tinkatuff, a dominant figure in the tier. While Tinkatuff is generally better than Clefairy because of its Steel typing, it does not have access to recovery, which makes Clefairy a capable choice for teams that want their Knock Off and Thunder Wave user to stick around.</p>",
    "comments": "<h3>Other Options</h3> <p>Clefairy has access to Calm Mind, which can be used with attacks like Draining Kiss and Flamethrower to hit a large swath of the metagame for nice damage after a few boosts. Healing Wish can allow powerful wallbreakers like Girafarig and Piloswine a second chance to break through the opposition. Trick can be used to disrupt foes as well, opting to steal Eviolite from the foe rather than using Knock Off to remove it or using an unfavorable item like a Choice Scarf to disrupt a switch-in such as Misdreavus or Tinkatuff.</p> <h3>Checks and Counters</h3> <p><strong>Item Disruption</strong>: Clefairy can struggle to function as a wall once its Eviolite is removed, rendering it less effective against Knock Off users like Monferno, Servine, and Thwackey. Switcheroo and Trick users, such as Frogadier, Girafarig, and Misdreavus can also disrupt Clefairy by giving it an unsavory Choice item.</p> <p><strong>Poison-types</strong>: Koffing, because of its ability Neutralizing Gas removing the effect of Magic Guard, can threaten Clefairy out and use Toxic Spikes to disrupt. Alolan Grimer and Ivysaur can threaten big damage against Clefairy with their STAB attacks while also using Knock Off to remove Eviolite from whatever switches into them.</p> <p><strong>Steel-types</strong>: Hisuian Sliggoo can use its powerful Steel-type STAB attacks to obliterate Clefairy, while Tinkatuff can wall non-Night Shade Clefairy with ease and disrupt it with Encore and Knock Off. Pawniard can use Clefairy as a relatively safe entry point, setting up with Swords Dance or threatening big damage with Iron Head immediately.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Clefairy offers incredible utility, giving teams a sturdy Knock Off user that can also establish Stealth Rock and disrupt foes with Thunder Wave, all valuable tools that help against the premier entry hazard removal option in the tier, Quaxwell. Encore can similarly disrupt the opponent, though it is prediction-reliant, as most things will be faster than Clefairy without being paralyzed. Night Shade can be used to provide consistent damage output, though it can't hit Dunsparce, Girafarig, and Vigoroth, giving them opportunities to set up in front of Clefairy. Magic Guard allows Clefairy to sponge status moves and other forms of residual damage for its teammates, such as Toxic from Dunsparce, Salt Cure from Naclstack, and Will-O-Wisp from Misdreavus, though it does still suffer the effects of paralysis and takes boosted damage from Hex while statused. A specially defensive EV spread with a Calm nature lets Clefairy focus on checking Pokemon like Drakloak, Frogadier, and Misdreavus, while a physically defensive EV spread with a Bold nature can let it check Monferno and Piloswine.</p> <p>A natural fit on balance and bulky offense teams, Clefairy can use its utility to free up a moveslot on teammates like Dunsparce, Gabite, Misdreavus, and Piloswine. Clefairy uses its bulk and general longevity to disrupt the opposition drastically, allowing offensive teammates, like Frogadier and Girafarig, to clean late-game after Eviolites are removed from walls such as Dunsparce, Misdreavus, and Tinkatuff. Teammates that appreciate the paralysis spread by Clefairy include Hex users like Drakloak and Misdreavus, which can use the boosted damage to break through special walls like opposing Clefairy and Tinkatuff. Frogadier is a notable partner for Clefairy, as it uses Spikes to create an entry hazard-stacking core that, with Misdreavus as a spinblocker, can rack up hazard chip damage. While Clefairy is fairly bulky and can use Moonlight to stick around for longer, it is generally frail once its Eviolite is removed and can struggle to wall the stronger setup sweepers and wallbreakers in the tier, such as Nasty Plot Girafarig, Contrary + Leaf Storm Servine, and Swords Dance Thwackey. To help with this, Hisuian Sliggoo can cover a lot of these threats because of its own bulk and Steel typing, and it can capitalize on Clefairy removing Eviolites on foes to maximize the damage output of its own strong STAB attacks like Draco Meteor and Flash Cannon. Koffing and Pawniard can also help sponge Knock Offs for Clefairy, with Koffing providing great offensive pressure with Toxic Spikes and Pawniard being a reliable wallbreaker. Fighting-types like Pignite can help Clefairy break through the bulkier Normal- and Steel-types that it can struggle against, like Dunsparce and Hisuian Sliggoo. Gabite can similarly help break through these Pokemon while also threatening Koffing and other Poison-types like Glimmet.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Gloom": {"sets": {"Defensive Utility": {}}},
  "Weepinbell": {"sets": {"Utility": {}}},
  "Grimer-Alola": {"sets": {"Defensive": {}}},
  "Koffing": {"sets": {"Defensive": {}}},
  "Seadra": {"sets": {"RestTalk Pivot": {}}},
  "Dragonair": {"sets": {"Dragon Dance": {}}},
  "Murkrow": {"sets": {"Nasty Plot": {}}},
  "Misdreavus": {"sets": {"Utility": {}}},
  "Girafarig": {"sets": {"Nasty Plot": {}, "Choice Item": {}}},
  "Dunsparce": {"sets": {"Calm Mind": {}, "Utility": {}, "Coil": {}}},
  "Piloswine": {
    "overview": "<p>With its impressive stats, versatile movepool, good typing, and notable ability, Piloswine cements itself as one of the premier staples of the metagame. All these traits allow it to function as an excellent wallbreaker, entry hazard setter, revenge killer, and Thunder Wave absorber. As a hazard setter, being unsusceptible to Taunt owing to its ability is a major plus point. While Eviolite provides bulk and flexibility, Choice Band enables Piloswine to capitalize on its unresisted STAB combination to dismantle opposing teams. However, despite its strength and bulk, it lacks longevity due to the absence of non-Rest recovery moves and faces competition from other Stealth Rock setters like Tinkatuff and Dunsparce, which have relatively better longevity, better matchup against the tier's premier hazard removal option in Quaxwell, and greater overall utility.</p>",
    "comments": "<h3>Other Options</h3> <p>Trailblaze over Ice Shard or Stealth Rock with more Speed EVs is an option for Piloswine. For instance, it outspeeds Frogadier at +2 with 104 Speed EVs. Trailblaze transforms Piloswine into a good late-game cleaner, potentially bypassing checks like Thwackey at low HP and finishing off foes like Misdreavus. This alternative also helps it in winning mirror matchups. However, if you drop Stealth Rock, it's advisable to run another setter like Tinkatuff, or if you drop Ice Shard, consider other revenge killers like Thwackey and Choice Scarf Frogadier. Similarly, Curse is an option over Stealth Rock, making Piloswine a dangerous late-game cleaner and enabling it to beat its former checks such as Thwackey and Raboot.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Quaxwell can switch into any move from Piloswine and use Rapid Spin to remove Stealth Rock. It can do so multiple times thanks to Roost and threatens Piloswine out with its STAB moves. Other Water-types like Wartortle and Frogadier can check Piloswine with their STAB attacks too. Wartortle also has Rapid Spin to remove Stealth Rock and is bulky enough to switch into Piloswine once or twice; Frogadier is relatively frailer but stronger.</p> <p><strong>Misdreavus</strong>: Misdreavus is immune to Piloswine's Ground-type moves, can take its Ice-type moves thanks to its bulk, and has Pain Split for longevity. Will-O-Wisp renders Piloswine ineffective.</p> <p><strong>Wallbreakers and Revenge Killers</strong>: Thwackey can check Piloswine, but it usually needs support to get Piloswine weakened to Grassy Glide range, generally with Knock Off, strong super effective moves, or pivoting moves, as it would rather not risk Wood Hammer. Raboot, Monferno, and Pignite heavily damage Piloswine with their Fighting-type moves. Pokemon such as Choice Specs Girafarig, Servine, and Pawniard do a decent job in picking Piloswine off.</p> <p><strong>Normal-types</strong>: Dunsparce and Vigoroth are physically bulky enough to easily take all of Piloswine's STAB moves. Dunsparce cripples Piloswine with Toxic, while Vigoroth can turn Piloswine into setup fodder or use its utility and STAB moves to hinder Piloswine.</p>",
    "sets": {
      "Offensive Stealth Rock": {
        "description": "<p>Piloswine's strong matchups against the tier's other dominant entry hazard setters, such as Tinkatuff and Koffing, and the tier's premier Defogger, Vullaby, allow it to excel as a highly effective Stealth Rock setter. As a wallbreaker, its unresisted STAB combination is extremely threatening to unprepared teams and those that have been weakened by Knock Off, hazards, or other residual damage. High Horsepower allows Piloswine to work effectively even in Grassy Terrain, but Earthquake is also a viable alternative due to its extra power and accuracy. Ice Shard allows Piloswine to pick off weakened threats like Girafarig and Fraxure.</p> <p>Piloswine is a strong fit for most archetypes, and it's especially effective on bulky offense and balance teams. Misdreavus is a stellar teammate for Piloswine; its spinblocking ability, which allows it to handle Quaxwell, complements Piloswine's Stealth Rock setting perfectly. In addition, Misdreavus can spread status to support Piloswine's wallbreaking or work in tandem with it to dismantle the opposing team through setup and cleaning. Frogadier is also a superb partner, forming an entry hazard-stacking core with Piloswine; moreover, it provides pivoting support to Piloswine, creating valuable entry opportunities. In a similar vein, Koffing sets Toxic Spikes to maximize hazard pressure; it also acts as a great switch-in to many foes that Piloswine is weak to, handling Grass-types like Thwackey and Servine and absorbing Fighting-type moves from threats like Raboot, Monferno, and Pignite. In general, wallbreakers and cleaners appreciate Piloswine's Stealth Rock support and offensive pressure; Thwackey, Girafarig, Fraxure, and Raboot synergize extremely well with Piloswine, working hand in hand with it to dismantle defensive cores, which may include Pokemon like Dunsparce, Ivysaur, Quaxwell, and Koffing. Thwackey, in particular, is an excellent teammate for Piloswine, dealing with pesky Water-types that check Piloswine, namely Quaxwell, Wartortle, and Frogadier. Thwackey also offers invaluable Knock Off, pivoting, and passive recovery support, bolstering Piloswine's wallbreaking prowess and longevity. In return, Piloswine deals with foes that can prove to be problematic for Thwackey, such as Koffing, Vullaby, and Tinkatuff. Piloswine appreciates Knock Off support a ton; thus, Knock Off users such as Monferno, Pignite, and Vigoroth make amazing teammates, pairing nicely with Piloswine and amplifying its offensive pressure, even allowing it to reach thresholds like 2HKOing maximum Defense Quaxwell that has lost its Eviolite with minimum chip damage. Piloswine is vulnerable to Misdreavus, particularly Will-O-Wisp variants, so Normal-types such as Dunsparce as well as the aforementioned Vigoroth, Monferno, and Pignite are exemplary partners. Defensively, Quaxwell is a remarkable teammate, providing Rapid Spin support to ensure Piloswine's side of the field is free of hazards, thus maximizing hazard pressure on the opposing team. Quaxwell also acts as a switch-in to multiple Pokemon that Piloswine can struggle against, especially if it's chipped or if its Eviolite has been removed by Knock Off, such as Frogadier, Pignite, Monferno, and Raboot; in exchange, Piloswine can deal with foes that Quaxwell is weak to, like Drakloak, Fraxure, and Girafarig. Wartortle is also a good teammate in this regard, though it has less longevity, which is a fair trade for the added offensive pressure. Ivysaur defensively takes care of Grass- and Water-types like Thwackey and Quaxwell for Piloswine, while Piloswine takes care of threats like Girafarig and Tinkatuff.</p>"
      },
      "Choice Band": {
        "description": "<p>Thanks to its insane Attack and amazing movepool, Choice Band Piloswine is one of the deadliest wallbreakers and revenge killers of the metagame. High Horsepower is the preferred move under Thwackey's Grassy Terrain, while Earthquake serves as a more consistent option outside of it. Ice Shard picks off foes like Fraxure, Gabite, and low-HP Girafarig. 124 Speed EVs ensure Piloswine outspeeds Quaxwell without Speed investment. Maximum Attack and Speed investment can also be used to not risk Speed tier shenanigans.</p> <p>Piloswine fits on bulky offense and balance teams. It is best paired with entry hazard setters like Tinkatuff, Frogadier, and Koffing to relentlessly pressure foes like Quaxwell and wallbreak as effectively as possible. Tinkatuff and Koffing also act as Knock Off absorbers, aiding Piloswine in keeping its Choice Band, and they also check Grass-types like Thwackey, Ivysaur, and Servine. Tinkatuff can also try to steal Quaxwell's Eviolite with Pickpocket, invalidating it as a potential Piloswine answer. Monferno and Pignite provide Knock Off support and offensively pressure Misdreavus + Quaxwell structures Piloswine may face some difficulty against. Special stallbreakers and wallbreakers such as Misdreavus and Choice Specs Girafarig can work in tandem with Piloswine to absolutely dismantle opposing defensive cores with Pokemon like Quaxwell, Misdreavus, Ivysaur, Tinkatuff, and Dunsparce. Piloswine is vulnerable to Will-O-Wisp from Misdreavus, so Girafarig is an especially noteworthy partner, along with Pokemon like Dunsparce, Vigoroth, and previously mentioned Fire-types, all of which can absorb burns and check Misdreavus. Thwackey and Ivysaur check pesky Water-types that check Piloswine, namely Frogadier, Wartortle, and Quaxwell, while also providing Knock Off support and, in Thwackey's case, passive recovery. In return, Piloswine handles Tinkatuff and Vullaby for them. Piloswine likes taking as little chip damage as possible, so hazard control options such as Quaxwell, Wartortle, and Vullaby are appreciated. Fraxure can take advantage of the holes Piloswine blows into opposing teams to set up and sweep. Servine is also an excellent partner for similar reasons and aids Piloswine by checking Water-types and providing Glare support, potentially mitigating its issue of having mediocre Speed. Pikachu also checks Water-types and provides Volt Switch support to Piloswine, bringing it in on forced switches and enabling its wallbreaking.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 558636, "username": "zastra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 451786, "username": "Mirbro"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Stantler": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Calm Mind": {}}},
  "Marshtomp": {"sets": {"Offensive Stealth Rock": {}, "Defensive": {}}},
  "Vigoroth": {"sets": {"Bulk Up": {}}},
  "Meditite": {"sets": {"Wallbreaker": {}, "Choice Scarf": {}}},
  "Dusclops": {"sets": {"Defensive": {}}},
  "Grotle": {"sets": {"Shell Smash": {}}},
  "Monferno": {
    "sets": {
      "Swords Dance": {},
      "All-Out Attacker": {},
      "Nasty Plot": {
        "description": "<p>Monferno is a surprising special setup sweeper, as it’s more commonly expected to be physical. It can lure in physical walls like Gabite or physically defensive Clefairy. Once it has set up, Monferno becomes a potent late-game cleaner, using its powerful, mostly unresisted STAB moves to threaten the opposition. Focus Blast provides essential coverage, dealing with foes like Hisuian Sliggoo, Piloswine, and Quaxwell. Vacuum Wave can pick up KOs on damaged faster foes like Girafarig or Frogadier. Timid nature ensures that Monferno outspeeds and OHKOs foes like Thwackey and allows it to deal sufficient damage without the need for the extra power that Modest would provide.</p> <p>Monferno fits well on offensive teams thanks to its ability to clean up weakened foes late-game. It also excels on balance teams, where it supports physically offensive teammates like Vigoroth, Thwackey, and Piloswine by luring and removing physical walls such as Quaxwell and Koffing that would otherwise hinder their progress. Monferno pairs well with hazard setters like Tinkatuff, Frogadier, and Gabite, which can lay down Stealth Rock and Spikes to weaken the opponent, facilitating Monferno’s sweeps. A layer of Stealth Rock or Spikes enables Monferno, once boosted, to secure the OHKO range on bulkier foes such as defensive Tinkatuff with Fire Blast, or Coil Dunsparce and defensive Gabite with Focus Blast. Wallbreakers like Piloswine and Thwackey are essential teammates, as they clear out key defensive checks such as Mareanie and Quaxwell, respectively. Paralysis absorbers, such as Eelektrik and Piloswine, help mitigate Monferno’s vulnerability to paralysis, which could otherwise allow slower threats like Pignite or Piloswine to outspeed and threaten it. Thunder Wave spreaders are also valuable to provide additional speed control; teammates like Clefairy or Tinkatuff stop faster Pokemon, such as Murkrow or Frogadier, otherwise able to get the jump on Monferno. Grass-types like Servine or Thwackey are helpful dealing with the likes of Quaxwell or Gabite while resisting both Water- and Ground-type moves. Knock Off users like Vigoroth or Thwackey are valuable additions to the team, as they ease Monferno's need for setting up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 687940, "username": "Zhenox"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}]}
  },
  "Prinplup": {"sets": {"Defensive Pivot": {}}},
  "Gabite": {
    "overview": "<p>Gabite uses its powerful Dragon and Ground typing in conjunction with Swords Dance to become a potentially devastating setup sweeper in the NFE metagame. Sitting at a comfortable speed tier ahead of other offensive threats like Monferno and Thwackey, Gabite is a solid choice for teams that need a powerful wallbreaker and setup option. On top of this, Gabite can establish Stealth Rock for its team and use its Ground typing to absorb paralysis attempts from the likes of Hattrem and Tinkatuff. While these traits are quite tantalizing, Gabite does suffer from having poor matchups into other NFE staples like Misdreavus, which can threaten to burn Gabite with Will-O-Wisp, and Piloswine, which can revenge kill Gabite with Ice Shard after minor chip damage.</p>",
    "comments": "<h3>Other Options</h3> <p>Scale Shot can be used to provide a Speed boost, helping outpace Frogadier, Girafarig, and Misdreavus, though it does mean Gabite is much less threatening offensively, as it relies on the multi-hit nature of the move. Similarly, Gabite can opt for a fully offensive set, using a Choice Scarf to outspeed the aforementioned Pokemon without needing to rely on Scale Shot and coverage moves like Iron Head to hit Fairy-types harder, like Clefairy.</p> <h3>Checks and Counters</h3> <p><strong>Faster Wallbreakers</strong>: Gabite is slower than notable revenge killers like Drakloak and Frogadier, both of which can threaten an OHKO with Draco Meteor and Ice Beam, respectively.</p> <p><strong>Piloswine</strong>: Piloswine's Ice Shard threatens an OHKO after Gabite takes minor chip damage.</p> <p><strong>Defensive Misdreavus</strong>: Misdreavus can outpace Gabite with ease, thus threatening a Will-O-Wisp to neutralize Gabite offensively.</p> <p><strong>Dunsparce</strong>: Dunsparce is quite difficult for Gabite to break through and can use Ice Beam to threaten an OHKO.</p> <p><strong>Wartortle</strong>: Wartortle can be problematic for Gabite, as it can use the threat of Ice Beam to get a free Shell Smash opportunity.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Gabite is a solid choice as an offensive setup option that also offers excellent utility in Stealth Rock and its Ground typing, which helps against notable entry hazard setters like Koffing and Tinkatuff. Substitute can be used to block status attempts from slower foes like Body Slam Dunsparce and Will-O-Wisp Koffing, allowing Gabite to use Swords Dance more freely; alternatively, Gabite can use Stealth Rock to free up a moveslot for teammates like Dunsparce and Tinkatuff. The given EV spread maximizes its damage output, with Adamant granting more immediate wallbreaking power at the expense of being slower than Monferno and Thwackey.</p> <p>Gabite is a fine addition to many team structures, notably finding a role on balance and bulky offense teams as an offensive setup sweeper and wallbreaker. While Gabite can use its Ground typing to find setup opportunities against common foes like Koffing, Monferno, and Tinkatuff, it struggles with capitalizing on its boosts with the abundance of threats that can OHKO it, like Drakloak, Frogadier, and Piloswine. Teammates like Tinkatuff can help handle these threats by providing Knock Off support while sponging attacks from Drakloak and Frogadier. Quaxwell can also help handle them by providing slow pivots with Flip Turn, entry hazard removal with Rapid Spin, and it can take hits from Frogadier. Misdreavus makes an excellent partner too, as it can threaten Will-O-Wisp on Piloswine to limit the damage output of Ice Shard while acting as a spinblocker against opposing Quaxwell. Ivysaur, Monferno, and Pignite are fine teammates for Gabite as well, offering Knock Off support to help remove Eviolite from physical walls, like opposing Ivysaur and Vullaby, to make wallbreaking easier for Gabite. Paralysis spreaders like Dunsparce, Misdreavus, and Tinkatuff can enable Gabite offensively, allowing it to use Substitute to set up against paralyzed foes a bit more safely. Frogadier, as a partner to Stealth Rock Gabite, can create powerful hazard-stacking cores with Misdreavus as the spinblocker. Girafarig and Vigoroth are great teammates to help Gabite get through Misdreavus, with Girafarig providing a special wallbreaker to go with Gabite's physical wallbreaking. Raboot can help Gabite set up by providing safe entry points against common switch-ins like Koffing.</p>"
      },
      "Choice Scarf": {},
      "Defensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 558636, "username": "zastra"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Hippopotas": {"sets": {"Defensive Stealth Rock": {}}},
  "Servine": {"sets": {"Offensive Contrary": {}, "Bulky Contrary": {}}},
  "Pignite": {
    "overview": "<p>Pignite is a powerful wallbreaker in the NFE metagame, using its powerful Fire- and Fighting-type STAB attacks to break through teams while having exceptional coverage in Knock Off and High Horsepower. Pignite is no slouch defensively either, with great natural bulk that makes it capable of trading blows with powerful foes like Monferno, Raboot, and Vigoroth as needed. On top of this, it has access to Bulk Up which can make it even more imposing. While Pignite is a robust option for teams, it isn't without flaws; though it can usually sponge an attack or two from opposing wallbreakers, it can struggle to hit at times because of how slow it is. Monferno is a similar wallbreaker to Pignite that trades a little bit of power for more utility in U-turn, Slack Off, and Stealth Rock, which makes it slightly more favorable for some team compositions. Faster wallbreakers like Frogadier, Gabite, and Wartortle can all give Pignite problems, with the latter two capable of using it as setup fodder. To circumvent this, Pignite can use Sucker Punch to inflict damage before being KOed or even take down an unsuspecting revenge killer like Frogadier or Misdreavus.</p>",
    "comments": "<h3>Other Options</h3> <p>Bulk Up furthers Pignite's offensive and defensive capabilities and works well in conjunction with Sucker Punch to secure potential KOs against faster foes like Frogadier and Girafarig. Drain Punch is a weaker STAB attack than Close Combat but offers healing and doesn't lower its defenses. Choice Band sets rely more on prediction but can offer tremendous power, making Pignite much harder to wall.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Quaxwell is capable of sponging Pignite's attacks with ease while recovering any damage with Roost. Frogadier and Wartortle are faster wallbreakers that can threaten to revenge kill Pignite. Mareanie tanks most attacks thrown its way as well, easily recovering the damage with Regenerator.</p> <p><strong>Faster Wallbreakers</strong>: Given how slow Pignite is, nearly every wallbreaker in the tier can revenge kill it with ease once it has been chipped a bit. Notable examples include Gabite and Girafarig, though Girafarig has to look out for Sucker Punch. Fraxure can sponge an attack and use Pignite as setup fodder, as can Monferno though to a lesser extent.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Pignite is an effective wallbreaker, as its excellent Fire / Fighting typing can hit much of the metagame for large damage. Knock Off removes Eviolites to make wallbreaking easier for itself and teammates while also hitting Ghost- and Psychic-types like Drakloak, Misdreavus, and Girafarig hard. High Horsepower can be used to nail Fire- and Poison-types like Monferno, Koffing, Mareanie, and opposing Pignite; Sucker Punch is an alternative that helps circumvent its lower Speed to hit faster wallbreakers like Frogadier and Girafarig first. An Adamant nature allows Pignite to maximize its damage output while still outpacing foes like Piloswine and bulky Tinkatuff. Blaze can boost the power of Flare Blitz to the point of achieving notable damage rolls, including a 2HKO on Clefairy and a chance to OHKO Misdreavus after Stealth Rock chip damage.</p> <p>Pignite is a natural fit on balance and bulky offense teams that need a powerful wallbreaker and additional Knock Off support. Faster wallbreakers like Frogadier and Girafarig can benefit from having Pignite remove Eviolites and wear teams down mid-game, allowing them to more effectively clean late-game. Entry hazard support from teammates like Gabite, Tinkatuff, and the aforementioned Frogadier can go a long way in chipping down the opposition, making would-be checks to Pignite like Mareanie and Quaxwell less capable of walling it over the course of a game. Drakloak and Misdreavus can help spinblock against Quaxwell to ensure the hazards on the foes' side stay active, along with spreading status via Thunder Wave and Will-O-Wisp to help Pignite in its efforts to wallbreak. Frogadier and Wartortle are especially threatening foes for Pignite, so teammates that can keep them in check, such as Dunsparce, Misdreavus, and Tinkatuff, are vital. Specially defensive Clefairy can also wall these threats while providing Stealth Rock and Knock Off support. Quaxwell pairs well with Pignite, tanking Ground- and Water-type attacks thrown its way from the likes of Piloswine and Frogadier while providing hazard removal to keep it healthy. Thwackey checks the Water-types that threaten Pignite, such as Frogadier and Quaxwell, while using U-turn to provide safe entry points against foes like Ivysaur and Koffing that may try to check Thwackey. The Grassy Terrain provided by Thwackey also lowers the damage of Piloswine's Earthquake, allowing Pignite to more comfortably take it on if needed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 451786, "username": "Mirbro"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}]}
  },
  "Dewott": {"sets": {"Swords Dance": {}, "Special Pivot": {}}},
  "Krokorok": {"sets": {"Offensive Stealth Rock": {}, "Choice Item": {}}},
  "Scraggy": {"sets": {"Bulk Up": {}, "Dragon Dance": {}}},
  "Duosion": {"sets": {"Double Dance": {}, "Defensive Pivot": {}}},
  "Eelektrik": {"sets": {"Defensive Pivot": {}}},
  "Lampent": {"sets": {"Choice Item": {}, "Calm Mind": {}}},
  "Fraxure": {
    "sets": {
      "Setup Sweeper": {},
      "Choice Band": {
        "description": "<p>Fraxure is one of the best wallbreakers and revenge killers in the metagame owing to its colossal Attack and amazing movepool. First Impression is its primary revenge killing tool, being able to pick off several top-tier threats such as Girafarig, Thwackey, and Frogadier. Dragon Claw, unlike Outrage, doesn't lock Fraxure in and helps it avoid being crippled by Fairy-types like Clefairy and Tinkatuff. Stomping Tantrum hits Tinkatuff, 2HKOes Koffing, and OHKOes Pawniard after Stealth Rock damage. An Adamant nature maximizes Fraxure's offensive potential, letting it hit thresholds like always 2HKOing Quaxwell with Outrage and maximum Defense Tinkatuff with Stomping Tantrum.</p> <p>Fraxure fits on bulky offense and balance teams as a dedicated physical wallbreaker and anti-offense revenge killer. It works best when paired with pivots and entry hazard setters, as they provide it with entry opportunities and facilitate its wallbreaking. Frogadier excels in both roles, making it a wonderful partner. Quaxwell, Raboot, and Thwackey provide pivoting support and handle Piloswine, one of the best checks to Fraxure; moreover, Quaxwell provides Rapid Spin support, ensuring Fraxure stays for long in the game. Fraxure can't afford to take Knock Off because it loses too much power; Tinkatuff helps by acting as a Knock Off absorber and also provides Stealth Rock and Knock Off support. Other hazard-setting teammates include Piloswine and Koffing. Piloswine can also act as a Tinkatuff switch-in in case Fraxure is Choice-locked into a move other than Stomping Tantrum. Fraxure is vulnerable to Misdreavus, which can burn it and render it useless. Thus, Normal-types like Girafarig, Dunsparce, and Vigoroth are great teammates. Special wallbreakers work excellently with Fraxure, ripping apart defensive cores with ease. Choice Specs Drakloak, Hisuian Sliggoo, and aforementioned Girafarig are all suited for the job. Fraxure appreciates Knock Off support a lot because Eviolite removal makes it even deadlier in its job. Thus, Pokemon like Monferno, Pignite, Vullaby as well as the previously mentioned Thwackey and Vigoroth pair amazingly with it, with Vullaby even providing Defog support. Fraxure often gets Choice-locked in the wrong move, so having a solid defensive core backing it up is of utmost importance, especially on balance teams. Defensive options to pair Fraxure with include Pokemon like Ivysaur, Misdreavus, and the aforementioned Quaxwell and Koffing.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 558636, "username": "zastra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Mienfoo": {"sets": {"Offensive Pivot": {}}},
  "Pawniard": {"sets": {"Swords Dance": {}, "Stealth Rock": {}}},
  "Rufflet": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Bulk Up": {}}},
  "Vullaby": {"sets": {"Defensive Utility": {}}},
  "Zweilous": {"sets": {"Wallbreaker": {}}},
  "Quilladin": {"sets": {"Spikes": {}, "Bulk Up": {}}},
  "Braixen": {"sets": {"Calm Mind": {}}},
  "Frogadier": {
    "overview": "<p>Frogadier stands out as a stellar offensive pivot, revenge killer, and, if it's running Heavy-Duty Boots, the best Spikes setter of the metagame thanks to its versatile movepool and great Speed tier. These traits cement Frogadier as a centerpiece in the metagame's most dominant structures, particularly entry hazard-stacking teams with Spikes. Choice Specs Frogadier's offensive potential is matched by few, and the Choice Scarf variant is the fastest Pokemon in the metagame, making it one of the most effective revenge killers. However, it's limited by Thwackey and Water-types, though the latter can be hindered by Choice item variants' Switcheroo.</p>",
    "comments": "<h3>Other Options</h3> <p>Hydro Pump can be used over Surf as a stronger but less accurate option; Hydro Pump 2HKOes Eviolite Girafarig after Stealth Rock, while Surf fails to accomplish this. Gunk Shot over Ice Beam with a Naive nature is an alternative, transforming Frogadier's Grass weakness into a resistance and allowing it to potentially turn the tables on foes like Thwackey. Grass Knot is also a niche option, 2HKOing Quaxwell and Wartortle that have lost their Eviolite after minor chip damage, usually from entry hazards; it also removes Frogadier's Grassy Glide weakness.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Quaxwell and Wartortle can shrug off its moves and use Rapid Spin to clear Spikes. Wartortle, however, has a limit to how long it can keep Frogadier at bay because it lacks a good recovery move. Quaxwell is comparatively better at answering Frogadier long-term thanks to Roost giving it great longevity. Niche Water-types such as Mareanie, Dewott, and Seadra are also decent answers to Frogadier. However, Choice item Frogadier can hinder all these Water-types with Switcheroo.</p> <p><strong>Grass-types</strong>: Thwackey's Grassy Glide is a nightmare for Frogadier. Other Grass-types like Ivysaur and Servine can also check it. These Grass-types, however, do fear switching into Frogadier's Ice Beam.</p> <p><strong>Special Walls</strong>: Frogadier fails to deal significant damage to Pokemon like Dunsparce, Vigoroth, Duosion, Clefairy, and Tinkatuff, but all of these can threaten it in return. However, it is worth noting that Tinkatuff fails to check Frogadier long-term.</p> <p><strong>Dragon-types</strong>: Hisuian Sliggoo, Choice Specs Drakloak, and First Impression Fraxure can revenge kill Frogadier.</p>",
    "sets": {
      "Spikes Pivot": {
        "description": "<p>Spikes lets Frogadier heavily pressure the opposing team while also making it immune to Thunder Wave due to Protean. Ice Beam hits Grass- and Dragon-types like Thwackey, Ivysaur, Fraxure, and Drakloak and removes its Grass weakness, allowing it to always survive Eviolite Thwackey's Grassy Glide. U-turn allows it to escape problematic matchups, such as Quaxwell and Wartortle, and generate momentum by bringing its teammates in on advantageous matchups.</p> <p>Frogadier fits on offense and balance teams focused on setting entry hazards. Ghost-types are nearly mandatory teammates for Frogadier, providing spinblocking support to ensure Spikes stay up on the field in a metagame where Rapid Spin is the primary hazard removal method. Misdreavus is generally the go-to option thanks to its wide array of utility moves, but Drakloak is also a viable alternative due to its good typing, Speed tier, and movepool. Pawniard is also a decent partner for Frogadier, punishing Defog attempts from Vullaby with Defiant—even though Defog is relatively uncommon—and using the Attack boost to potentially clean or dent the opposing team. Frogadier pairs excellently with other hazard setters like Tinkatuff, Piloswine, Gabite, and Koffing, supporting it in relentlessly pressuring the opposing team with hazards and other utility or damage-dealing moves. Tinkatuff and Koffing also help Frogadier in dealing with Grass-types, most notably Thwackey, which can easily revenge kill Frogadier with Grassy Glide. Strong Pokemon such as Thwackey, Pikachu, Raboot, Pignite, and Girafarig heavily appreciate Frogadier's Spikes support, which enables them to wallbreak or clean with ease. Thwackey assists Frogadier by dealing with threats like Quaxwell and Wartortle, while Frogadier threatens Fire-types like Raboot, Monferno, and Pignite for Thwackey. Pikachu is a good partner for similar reasons, and it appreciates Frogadier threatening Ground-types such as Piloswine and Gabite. Setup variants of Dunsparce and Vigoroth are also terrific teammates, being excellent wincons. Defensive teammates for Frogadier include Pokemon like Quaxwell and Ivysaur. Quaxwell provides the much-needed Rapid Spin support, ensuring Frogadier's team is unaffected by hazards while the opposing team writhes in agony due to them. Ivysaur fends off pesky Grass- and Water-types for Frogadier.</p>"
      },
      "Choice Specs": {},
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 558636, "username": "zastra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 451786, "username": "Mirbro"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Fletchinder": {"sets": {"Utility": {}, "Swords Dance": {}}},
  "Sliggoo-Hisui": {"sets": {"Choice Specs": {}, "Acid Spray": {}}},
  "Dartrix": {"sets": {"Physically Defensive": {}, "Swords Dance": {}}},
  "Charjabug": {"sets": {"Sticky Web": {}}},
  "Cutiefly": {"sets": {"Sticky Web Lead": {}}},
  "Mareanie": {"sets": {"Utility": {}}},
  "Hakamo-o": {"sets": {"Double Dance": {}, "Defensive": {}}},
  "Thwackey": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Raboot": {"sets": {"Offensive Pivot": {}, "Swords Dance Sweeper": {}}},
  "Carkol": {"sets": {"Physically Defensive": {}}},
  "Hattrem": {"sets": {"Physically Defensive": {}, "Fast Utility": {}}},
  "Morgrem": {"sets": {"Dual Screens": {}, "Choice Specs": {}}},
  "Drakloak": {"sets": {"RestTalk": {}, "Choice Specs": {}}},
  "Crocalor": {"sets": {"Physically Defensive": {}, "Specially Defensive": {}}},
  "Quaxwell": {"sets": {"Defensive": {}}},
  "Naclstack": {"sets": {"Stealth Rock": {}, "Iron Defense": {}}},
  "Toedscool": {"sets": {"Utility": {}}},
  "Tinkatuff": {"sets": {"Defensive Utility": {}, "Offensive Utility": {}}},
  "Varoom": {"sets": {"Defensive Pivot": {}}},
  "Glimmet": {"sets": {"Hazard Lead": {}, "Physically Defensive": {}}},
  "Arctibax": {"sets": {"Swords Dance": {}}}
}