{
  "Venusaur": {"sets": {"Custap Berry": {}}},
  "Ninetales-Alola": {"sets": {"Encore + Disable": {}, "Sitrus Berry": {}, "Life Orb": {}}},
  "Muk-Alola": {"sets": {"AV": {}}},
  "Zapdos": {"sets": {"Clear Amulet": {}, "Life Orb": {}, "Pressure Stall": {}, "Choice Specs": {}}},
  "Zapdos-Galar": {"sets": {"Choice Band": {}}},
  "Moltres-Galar": {"sets": {"Custap Berry": {}, "Weakness Policy": {}, "Assault Vest": {}}},
  "Azumarill": {"sets": {"Life Orb": {}, "Kebia Berry": {}, "Choice Band": {}, "AV": {}, "Stall": {"description": "<ul> <li>Chilling Water allows Azumarill to chip the foe down while reducing their Attack, giving it better chances versus Taunt Great Tusk.</li> <li>Sap Sipper lures in Grass-types such as most offensive Choice Band Meowscarada.</li> <li>The HP, Special Defense investment, and Calm nature allow Azumarill to defeat Timid Choice Specs Iron Valiant most of the time.</li> <li>Use Charm or Amnesia to lower the foe's damage output until Azumarill is forced to use Rest.</li> </ul>"}}},
  "Scizor": {"sets": {"Life Orb": {}}},
  "Donphan": {"sets": {"Choice Band": {}}},
  "Tyranitar": {"sets": {"Choice Band": {}}},
  "Swampert": {"sets": {"Assault Vest": {}}},
  "Salamence": {"sets": {"Life Orb": {}}},
  "Metagross": {
    "sets": {
      "Weakness Policy": {
        "description": "<ul> <li>Heavy Slam is for Fairy-types like Iron Valiant and Whimsicott as well as light Pokemon such as Meowscarada and Porygon-Z.</li> <li>Meteor Mash can be used for consistent damage, being particularly useful against heavy Rock- and Ice-type Pokemon</li> <li>Bullet Punch is useful for securing KOs on faster Pokemon, Encore + Disable Pokemon such as Iron Valiant and Alolan Ninetales, and pinch Berry users such as Sneasler.</li> <li>Earthquake is for Hisuian Goodra and Metagross mirror matchups.</li> <li>Psychic Fangs is for Pecharunt and some Urshifu-R sets. It also helps break Reflect from Pokemon like Primarina and Kyurem.</li> <li>Hone Claws allows Metagross to set up against Counter users like Hisuian Goodra, which cannot be OHKOed by Metagross's Earthquake, allowing it to OHKO Hisuian Goodra with +1 Earthquake.</li> <li>The bulk EVs let Metagross survive Modest Choice Specs Kyurem's Earth Power and Adamant Choice Band Haxorus's Earthquake. The rest of the EVs are put into Attack for more Regidrago reliability.</li> <li>If Metagross is not running Hone Claws to set up Attack against Counter Hisuian Goodra, it can chip away at Hisuian Goodra's HP with Bullet Punch, since Counter won't do much, then it can KO Hisuian Goodra when it's in Earthquake's KO range.</li> <li>Since Metagross is weak to Fire-, Dark-, and Ground-type moves, a Water- or Fairy-type Pokemon like Manaphy or Primarina makes a good teammate.</li> </ul>"
      },
      "Assault Vest": {
        "description": "<ul> <li>Heavy Slam is for Primarina, Iron Valiant, and Sylveon.</li> <li>Bullet Punch lets Metagross deal with Encore + Disable Iron Valiant and KO Haxorus and Custap or Sitrus Berry Primarina after Heavy Slam.</li> <li>Earthquake beats Iron Crown and is the best option Raging Bolt.</li> <li>Psychic Fangs gives Metagross a better matchup against Pecharunt and Reflect Primarina, while Ice Punch gives Metagross the best odds against non-Choice Band Regidrago, Assault Vest Landorus-T, and Life Orb Landorus.</li> <li>The HP and Defense EVs allow Metagross to survive Knock Off from Jolly Choice Band Meowscarada. The Special Defense EVs allow Metagross to take 2 Thunderbolts from Booster Energy Raging Bolt. The remaining EVs are put into Attack to maximize odds against Choice Band Earthquake Haxorus.</li> <li>Assault Vest Metagross has the most reliable matchups of any Metagross set against Regidrago and Primarina. It is important to note that Choice Band Regidrago can 2HKO Metagross with Earthquake before Metagross can with Ice Punch, so it is recommended to run a partner that can deal with that set.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Heavy Slam is used to defeat non-Custap Berry Primarina, while Meteor Mash allows Metagross to beat Kyurem. Both moves do well into Sylveon, Porygon-Z, and Azumarill.</li> <li>Psychic Fangs is for Pecharunt and Iron Hands.</li> <li>Bullet Punch targets Iron Valiant and Alolan Ninetales.</li> <li>Earthquake hits Iron Crown, Hisuian Goodra, Registeel, and has favorable odds to beat most Raging Bolt sets.</li> <li>The HP investment allows Metagross to survive Earthquake from Choice Band Iron Hands, while the Special Defense EVs allow it to survive Dark Pulse from Choice Specs Porygon-Z. The Attack EVs and an Adamant nature allow it to beat Encore + Disable Iron Valiant due to Struggle 2HKOing after a Bullet Punch.</li> <li>An alternative EV spread of 232 HP / 236 Atk / 40 Def can be used to survive Focus Blast from Timid Choice Specs Iron Valiant and Earthquake from Choice Band Haxorus. The remaining EVs are put in Attack for maximum damage output.</li> <li>Choice Band Metagross should almost always use the move that does the most damage to an opposing Pokemon. Notable exceptions to this rule are Alolan Ninetales and Iron Valiant, as Bullet Punch allows Metagross to beat Encore + Disable variants of these Pokemon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 568493, "username": "ZackPalace"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 563325, "username": "delemon"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}, {"user_id": 500233, "username": "RTM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Registeel": {"sets": {"Specially Defensive": {}, "Defensive": {}}},
  "Garchomp": {"sets": {"Haban Berry": {}}},
  "Rhyperior": {"sets": {"Choice Band": {}, "Custap Berry": {}, "Assault Vest": {}}},
  "Porygon-Z": {"sets": {"Fast Choice Specs": {}, "Bulky Choice Specs": {}, "Life Orb": {}, "Choice Scarf": {}, "Custap Berry": {}}},
  "Cresselia": {"sets": {"Clear Amulet": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Manaphy": {"sets": {"Fast Stall": {}, "Sitrus Berry": {}, "Clear Amulet": {}}},
  "Darkrai": {"sets": {"Choice Scarf": {}, "Choice Specs": {}}},
  "Serperior": {"sets": {"Subseed": {}, "Assault Vest": {}}},
  "Whimsicott": {"sets": {"Babiri Berry": {}, "Occa Berry": {}, "Kebia Berry": {}}},
  "Haxorus": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Roseli Berry": {}, "Rocky Helmet": {}}},
  "Volcarona": {"sets": {"Life Orb": {}, "Chilan Berry": {}}},
  "Landorus-Therian": {"sets": {"Choice Band": {}, "Life Orb": {}, "Assault Vest": {}}},
  "Kyurem": {"sets": {"Choice Specs": {}, "Anti-Porygon-Z": {}, "Haban Berry": {}, "Choice Scarf": {}, "Weakness Policy": {}, "Assault Vest": {}}},
  "Greninja": {"sets": {"Life Orb": {}}},
  "Sylveon": {"sets": {"Life Orb": {}, "Custap Berry": {}, "Weakness Policy": {}, "Babiri Berry": {}}},
  "Goodra-Hisui": {"sets": {"Chople Berry": {}}},
  "Diancie": {"sets": {"Weakness Policy": {}, "Choice Specs": {}}},
  "Hoopa-Unbound": {
    "sets": {
      "Choice Band": {},
      "Bulky Choice Band": {},
      "Fast Choice Specs": {},
      "Bulky Choice Specs": {},
      "Choice Scarf": {"description": "<ul> <li>Hyperspace Fury should be used against Cresselia, Dragapult, Serperior, and Pecharunt.</li> <li>Gunk Shot is for non-defensive Ogerpon-W and Meowscarada.</li> <li>Focus Blast is for Chien-Pao and Porygon-Z.</li> <li>Thunderbolt is for non-Maranga Berry Corviknight, while Rock Tomb is for non-bulky Volcarona.</li> <li>The HP and Special Defense EVs let Hoopa-U survive Timid Choice Scarf Porygon-Z's Hyper Beam. Maximum Speed EVs and a Jolly nature allow Hoopa-U to outspeed Modest Choice Scarf Porygon-Z and Dragapult and Speed tie opposing Choice Scarf Hoopa-U. The remaining EVs are in Attack.</li> <li>Hoopa-U should use the strongest move it has in most cases. Other cases include trying to outplay a potential Custap Berry foe like Custap Berry Porygon-Z, picking a more accurate move in case two moves can KO, and using Hyperspace Fury to bypass Substitute and Protect.</li> </ul>"},
      "Assault Vest": {},
      "Custap": {}
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 493772, "username": "Lumii"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Volcanion": {"sets": {"Assault Vest": {}, "Anti-Archaludon": {}, "Choice Specs": {}, "Specially Defensive": {}, "Choice Scarf": {}}},
  "Primarina": {
    "sets": {
      "Weakness Policy": {},
      "Custap Berry": {},
      "Choice Specs": {
        "description": "<ul> <li>Hydro Cannon is Primarina's strongest attack and should be used against both Landorus formes, non-Custap Berry Skeledirge, and non-Substitute Volcarona.</li> <li>Moonblast defeats Regidrago, Haxorus, and Garchomp.</li> <li>Energy Ball should be used against Rhyperior and is Primarina's best way to deal with non-Sap Sipper Azumarill.</li> <li>Liquid Voice + Uproar makes Primarina defeat Registeel and gives it an option to defeat Custap Berry Skeledirge and Substitute Volcarona, while Psychic Noise + Torrent allows it to beat Whimsicott reliably. Torrent Primarina is also more consistent agaisnt bulkier Choice Specs Hoopa sets, as Moonblast does not always OHKO them.</li> <li>The HP and Defense EVs allow Primarina to survive Earthquake from Choice Band Landorus-T, while the Special Defense EVs allow it to survive Sludge Wave from Timid Choice Specs Landorus.</li> <li>Choice Specs Primarina, unlike other Primarina sets, loses to Encore + Disable Iron Valiant sets, so it is important to use a teammate that can defeat the aforementioned sets.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 563650, "username": "bern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Rillaboom": {"sets": {"Life Orb": {}, "SubSeed": {}, "Specially Defensive SubSeed": {}, "Assault Vest": {}}},
  "Corviknight": {"sets": {"Maranga Berry": {}}},
  "Dragapult": {"sets": {"Choice Band": {}, "Choice Specs": {}}},
  "Urshifu": {"sets": {"Custap Berry": {}, "Assault Vest": {}, "Chople Berry": {}}},
  "Regidrago": {
    "sets": {
      "Assault Vest": {},
      "Haban Berry": {},
      "Choice Scarf": {
        "description": "<ul> <li>Choice Scarf Regidrago can surprise many Pokemon that rely on their Speed to reliably beat it, such as Meowscarada and Chien-Pao.</li> <li>Outrage should be used on most targets, since it is the most reliable of its Dragon-type moves. Thanks to Dragon's Maw, it 2HKOes many neutral targets like Zapdos and OHKOes frail Pokemon like Meowscarada and Greninja.</li> <li>Draco Meteor helps against Pokemon like Chien-Pao and Great Tusk, whose much lower Special Defense can be exploited.</li> <li>Dragon Energy should only be used if it can cleanly OHKO a target&amp;emdash;such as against Choice Specs Darkrai&amp;emdash;because its high power can significantly decrease after being damaged. This means it should not use it against priority users like Ice Shard Chien-Pao or potentially faster Choice Scarf users like Hisuian Arcanine.</li> <li>Earthquake is Regidrago's only useful coverage move for this set, allowing it to OHKO non-Air Balloon Heatran and 2HKO Sturdy Magnezone.</li> <li>Maximum Speed investment gives the best chances in the mirror matchup, the 132 Attack EVs allow Regidrago to OHKO no bulk Volcarona, and the remaining EVs are put into Special Attack. This set uses a Naive nature because Regidrago is a mixed attacker, and a Defense-lowering nature would make Regidrago occasionally lose to Choice Band Ice Shard from Chien-Pao. The lost Special Defense is rarely relevant.</li> </ul>"
      },
      "Choice Specs": {},
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 518399, "username": "Itchy"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 500233, "username": "RTM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Spectrier": {"sets": {"Life Orb": {}, "Choice Specs": {}, "Sitrus Berry + Disable": {}}},
  "Ursaluna": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Earthquake is for Raging Bolt, Gouging Fire, Iron Crown, and non-Air Balloon Pecharunt.</li> <li>Giga Impact is used for Choice Scarf Porygon-Z and non-Choice Band Azumarill.</li> <li>Avalanche targets Landorus, Landorus-T, and Garchomp.</li> <li>Gunk Shot is for Sylveon and Azumarill, while Low Kick is the best move against opposing Ursaluna, Ursaluna-B, and Air Balloon Heatran.</li> <li>Bulletproof helps against Choice Specs Iron Valiant and some Hoopa-U sets, while Guts helps against Will-O-Wisp users like Volcarona, Spectrier, and Weakness Policy + Will-O-Wisp Dragapult.</li> <li>The HP and Defense EVs allow Ursaluna to survive Hammer Arm from Choice Band Landorus-T, while the Special Defense EVs allow it to take Hyper Beam from Life Orb Sylveon. The remaining EVs are put in Attack.</li> <li>Choice Band Ursaluna should click the most damaging move against its foe unless multiple moves OHKO, in which case it is best to click the most accurate of said choices. Against Substitute users like Volcarona, it is usually better to use Earthquake to avoid a recharge turn with Giga Impact.</li> </ul>"
      },
      "Guts": {},
      "Assault Vest": {}
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 563650, "username": "bern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Ursaluna-Bloodmoon": {"sets": {"Chople Berry": {}, "Choice Scarf": {}, "Assault Vest": {}}},
  "Meowscarada": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Skeledirge": {"sets": {"Custap Berry": {}, "Air Balloon": {}, "Maranga Berry": {}}},
  "Maushold-Four": {"sets": {"The Maus": {}}},
  "Bellibolt": {"sets": {"Custap Berry": {}, "Life Orb": {}}},
  "Tinkaton": {"sets": {"The Tink": {}}},
  "Annihilape": {"sets": {"Bulky Choice Band": {}, "Fast Choice Band": {}, "Fast Bulk Up": {}, "Defensive Bulk Up": {}, "Weakness Policy": {}}},
  "Great Tusk": {"sets": {"Choice Band": {}, "Bulky Choice Band": {}, "Booster Energy (Attack)": {}, "Choice Scarf": {}, "Booster Energy (Speed)": {}, "Custap Berry": {}, "Assault Vest": {}}},
  "Iron Hands": {"sets": {"Booster Energy (Attack)": {}, "Anti-Gouging Fire": {}}},
  "Iron Moth": {"sets": {"Power Herb": {}}},
  "Baxcalibur": {"sets": {"Fast Choice Band": {}, "Bulky Choice Band": {}, "Chople Berry": {}}},
  "Chien-Pao": {"sets": {"Choice Band": {}}},
  "Iron Valiant": {
    "sets": {
      "Encore + Disable": {
        "description": "<ul> <li>Iron Valiant's main attack is very interchangeable. Moonblast is the most reliable and is usually the one that works in the most matchups like opposing Iron Valiant and Walking Wake, while Low Kick is extremely helpful in the Gouging Fire matchup and can help it break through Steel-type Pokemon like Hisuian Goodra and Registeel, though, it's scared of Counter from the former.</li> <li>The Speed EVs allow it to outspeed Gouging Fire after a Dragon Dance, with the remaining EVs going into Defense so it can bulk physical hits and fire back with its Encore + Disable setup.</li> <li>To utilize Encore + Disable effectively, you usually have to use Protect on the first turn to scout the foe's first move. If you are certain it is a Choice-locked Pokemon, you can just use Disable on the second turn and force it to use Struggle, and if it utilizes a status move, you are free to use Encore on its move and attack with your main STAB move; otherwise, it is recommended to use Encore on the second turn to take a hit, then Protect on the third turn, then Disable on the fourth turn, and, once Encore is over, you use Encore again. This ensures 2 turns of Struggle from the foe, at which point Iron Valiant should be able to KO it. On more passive Pokemon that have moves that do little damage like Registeel, and in some rare cases like Gouging Fire if you only have Moonblast, it sometimes can be better to opt out of using Protect and just use your main attack.</li> <li>Iron Valiant fits best on teams that can cover their main weakness to Steel-type Pokemon; therefore, Fire-type Pokemon like Volcarona and Gouging Fire make great teammates. In return, Iron Valiant can handle threats like Choice Specs Greninja and Choice Band Ursaluna. Iron Valiant also appreciates Pecharunt and Hisuian Goodra being extremely consistent against Fairy-types, as these can easily deal with them while it deals with Ground-type Pokemon like Great Tusk and the previously mentioned Ursaluna.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>Moonblast and Focus Blast are Iron Valiant's main STAB moves, OHKOing targets that are weak to them such as non-Assault Vest Raging Bolt, both Urshifu formes, and Flame Orb Ursaluna.</li> <li>Thunderbolt's main use is to 2HKO Corviknight, which Iron Valiant's usual sets can't do much against, though it has to watch out for Expert Belt Corviknight.</li> <li>Iron Valiant's last move varies depending on what its team needs. Psyshock takes care of Iron Moth, while Icy Wind can usually beat both Landorus formes, though it has to watch out for Assault Vest Landorus-T with Fly.</li> <li>A Modest nature maximizes damage and ensures some OHKOs like non-Chople Berry Hisuian Goodra but for most matchups like non-bulky Ogerpon-W, Iron Moth, and non-Speed Booster Energy Walking Wake, it is better to run a Timid nature.</li> <li>Iron Valiant's HP and Special Defense EVs let it survive a Special Attack Booster Energy Raging Bolt's Thunderclap so it's safe to OHKO back with Moonblast, with the remaining EVs used on Speed and Special Attack to maximize its ability to outspeed and threaten frail threats.</li> <li>Iron Valiant really struggles to put a dent on Fairy-type Pokemon like Sylveon and Primarina, so Poison- and Steel-type Pokemon like Pecharunt and Hisuian Goodra can be really helpful to shut down these threats.</li> <li>Iron Valiant can struggle with Psychic-types like Iron Crown and Metagross, as it can't do much damage to them, so Dark-types like Meowscarada, Darkrai, and Hoopa-U work as good partners for it.</li> </ul>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 563325, "username": "delemon"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 652656, "username": "Gambit_Gamin"}]}]}
  },
  "Walking Wake": {"sets": {"Fast Booster Energy (Special Attack)": {}, "Breaking Swipe": {}, "Snarl": {}, "Booster Energy (Speed)": {}}},
  "Fezandipiti": {"sets": {"Life Orb": {}}},
  "Ogerpon-Wellspring": {"sets": {"Offensive": {}, "Charm": {}, "Specially Defensive": {}, "Leech Seed": {}, "Defensive": {}}},
  "Hydrapple": {"sets": {"Haban Berry": {}, "Yache Berry": {}}},
  "Gouging Fire": {
    "sets": {
      "Fast Booster Energy (Attack)": {
        "description": "<ul> <li>Dragon Dance allows Gouging Fire to beat most Ogerpon-W sets, Darkrai, and Meowscarada by allowing it to outspeed and OHKO them.</li> <li>Flare Blitz is Gouging Fire's best option against Steel-types like Corviknight, Metagross, and Iron Crown as well as Grass-types like Serperior.</li> <li>Outrage allows Gouging Fire to beat Skeledirge, non-Choice Scarf Volcanion, non-Haban Berry Raging Bolt, and non-Haban Berry or non-Choice Scarf Regidrago.</li> <li>Burning Bulwark helps against non-Choice Band Haxorus and Custap Berry Sylveon, while Earthquake allows Gouging Fire to secure its matchup against non-Air Balloon Volcanion.</li> <li>Fast Booster Energy Gouging Fire sacrifices surviving hits from Pokemon like Sylveon in order to have better matchups against most Regidrago sets and opposing Gouging Fire. However, Haban Berry or Choice Scarf Regidrago and Haban Berry Gouging Fire can still win, so it is recommended to have secondary answers to deal with those sets on a team.</li> </ul>"
      },
      "Bulky Booster Energy (Attack)": {
        "description": "<ul> <li>Dragon Dance allows Gouging Fire to beat most Ogerpon-W sets by allowing it to outspeed and OHKO them.</li> <li>Flare Blitz is Gouging Fire's best option against Steel-types like Corviknight, Metagross, and Scizor as well as Grass-types like Serperior.</li> <li>Outrage allows Gouging Fire to beat Skeledirge, non-Choice Scarf Volcanion, non-Haban Berry Raging Bolt, and non-Custap Berry Hoopa-U.</li> <li>Burning Bulwark helps against Haxorus and Custap Berry Sylveon, while Earthquake allows Gouging Fire to secure its matchup against non-Air Balloon Volcanion.</li> <li>The HP EVs allow Gouging Fire to survive Earthquake from Choice Band Metagross, while the Special Defense EVs allow it to survive Hyper Beam from Life Orb Sylveon. The Speed EVs allow Gouging Fire to outspeed Ogerpon-W after using Dragon Dance. The rest of the EVs are put in Attack.</li> <li>Bulky Booster Energy Gouging Fire sacrifices matchups against some faster Pokemon like Regidrago to have a better matchup against bulkier Pokemon like Sylveon. It also can use Dragon Dance more effectively when bulky, as it is able to survive more hits.</li> <li>It is recommended to use Dragon Dance against Pokemon that get outsped by +1 Gouging Fire, such as Ogerpon-W.</li> <li>Against Encore + Disable Iron Valiant, it is recommended to use Dragon Dance on the first turn then use Flare Blitz on the second. If locked into Dragon Dance through Encore, Iron Valiant cannot KO Gouging Fire unless running Low Kick.</li> </ul>"
      },
      "Haban Berry": {},
      "Clear Amulet": {}
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 518399, "username": "Itchy"}, {"user_id": 563650, "username": "bern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Raging Bolt": {
    "sets": {
      "Haban Berry": {},
      "Booster Energy (Special Attack)": {
        "description": "<ul> <li>Thunderbolt is Raging Bolt's most consistent STAB attack and beats Primarina, non-Assault Vest Metagross, and Volcanion.</li> <li>Draco Meteor is Raging Bolt's strongest STAB attack and should be used against Skeledirge.</li> <li>Thunderclap allows Raging Bolt to get KOs after using Thunderbolt and Draco Meteor and helps in matchups against some Hoopa-U sets as well as against Custap Berry users like Primarina and the Urshifu formes.</li> <li>Taunt allows Raging Bolt to beat Pecharunt and Ogerpon-W.</li> <li>The HP and Defense EVs allow Raging Bolt to survive the Choice Band Urshifu formes' Close Combat, while the Special Defense EVs allow it to survive Moonblast from Wacan Berry and Assault Vest Primarina. The Speed EVs allow Raging Bolt to outspeed Modest Primarina. The remaining EVs are put in Special Attack to maximize power for best odds against specially defensive Primarina.</li> <li>Draco Meteor into Thunderclap is stronger than Thunderbolt into Thunderclap, so in matchups where there is no recovery from the foe, such as against non-Sitrus Berry Annihilape, it is better to use Draco Meteor into Thunderclap.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 520168, "username": "Murm"}]}, {"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Iron Boulder": {"sets": {"Choice Band": {}, "Booster Energy (Speed)": {}}},
  "Iron Crown": {
    "sets": {
      "Fast Weakness Policy": {
        "description": "<ul> <li>Fast Weakness Policy Iron Crown aims to switch up otherwise disadvantageous matchups such as Haxorus as well as Choice Band Ground-types such as Landorus-T by boosting itself with Iron Defense, then obtaining a Weakness Policy boost to threaten an OHKO on the next turn with Stored Power.</li> <li>Tachyon Cutter is Iron Crown's best Steel-type STAB move, being able to immediately pressure Fairy-Type Pokemon such as Iron Valiant and Sylveon. Tachyon Cutter has other niches in breaking foes' Substitute, such as against SubSeed Ogerpon-W and Serperior.</li> <li>Upon activation of Weakness Policy, Stored Power's Base Power increases by 80. Combined with any prior boosts Iron Crown may have obtained, this makes Stored Power its strongest Psychic-type STAB option.</li> <li>Psyshock can be used to disrupt the matchup versus other Calm Mind users that resist Stored Power such as opposing Iron Crown and Cresselia, albeit using Psyshock may miss out on important KOs that Stored Power would otherwise obtain.</li> <li>Psychic Noise may be used to prevent recovery moves from Pokemon such as Cresselia that would otherwise be able to deal with Iron Crown. Psychic Noise also deals additional damage to Iron Valiant and Alolan Ninetales compared to Iron Crown's other Psychic-type options.</li> <li>Calm Mind is used in matchups versus special attacking Pokemon such as Primarina and Cresselia in order to boost up Iron Crown's Special Attack and Special Defense to a point where it does not take much damage from their attacks while threatening KOs with Tachyon Cutter and Stored Power.</li> <li>The EVs are used to outspeed maximum Speed Haxorus and to tie the mirror matchup versus opposing Iron Crown. The bulk is meant to tank an Adamant Choice Band Great Tusk Headlong Rush after one Iron Defense.</li> <li>An alternative EV spread of 96 HP / 112 Def / 48 SpA / 252 Spe with a Timid Nature can be used to have a slightly better chance against Donphan with Tachyon Cutter after a Weakness Policy boost while still surviving Choice Band Great Tusk's Headlong Rush.</li> </ul>"
      },
      "Defensive Weakness Policy": {}
    },
    "credits": {"writtenBy": [{"user_id": 149971, "username": "Nuxl"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 563650, "username": "bern"}, {"user_id": 481149, "username": "bea"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Pecharunt": {"sets": {"Air Balloon": {}, "Leftovers": {}, "Maranga": {}, "Amulet": {}}}
}