{
  "Venusaur": {
    "sets": {
      "Physically Defensive (Grass)": {
        "description": "<p>Mega Venusaur excels as a wall on Grass teams, effectively tanking Fire- and Ice-type hits with its Thick Fat ability. It relies on Sludge Bomb as its main attack, dealing with Grass- and Fairy-types—such as Rillaboom and Iron Valiant—while also poisoning walls like Mega Sableye, Iron Hands, and Porygon2. Synthesis provides reliable healing, which, combined with Leech Seed and Sludge Bomb's poison, allows Mega Venusaur to wear down foes such as Garchomp. Hidden Power Fire handles Steel-types like Mega Scizor, Ferrothorn, and Gholdengo, although Earth Power can also be used to answer Steel-, Poison- and Fire-types such as Heatran and Iron Moth. The Speed EVs allow Mega Venusaur to outpace Adamant Azumarill. Mega Venusaur's teammates greatly appreciate its ability to handle threats like Mega Diancie and Mega Scizor and clear Toxic Spikes. Ferrothorn and Cradily form a solid defensive core, absorbing hits from Flying- and Psychic-types such as Galarian Moltres and Tapu Lele, while Mega Venusaur tanks Fire-, Ice-, and Fighting-type attacks. Whimsicott and Tapu Bulu help with the Dragon matchup, and Celebi handles the problematic Poison-types like Toxapex and Nidoking. Rillaboom and Breloom provide strong priority, allowing them to threaten faster threats such as Nihilego. Rillaboom also sets up Grassy Terrain to supply additional passive recovery along with Mega Venusaur's Leech Seed, boosting longevity. Meowscarada and Zarude serve as speedy wallbreakers that are capable of breaking through walls such as Clodsire and Skeledirge. Both also benefit from pivoting into Mega Venusaur to tank attacks from the aforementioned Fighting-, Fire-, and Ice-types.</p>"
      },
      "Physically Defensive (Poison)": {"description": "<p>Outspeeds Adamant Azumarill.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Swiffix", "user_id": 547532}], "teams": [{"name": "Grass analysis by", "members": [{"username": "Swiffix", "user_id": 547532}]}, {"name": "Quality checked by", "members": [{"username": "maroon", "user_id": 305839}, {"username": "Giyu", "user_id": 574288}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Charizard": {
    "sets": {
      "Dragon Dance (Fire)": {
        "description": "<p>Mega Charizard X is a ferocious wallbreaker and setup sweeper, aiding Fire teams in matchups like Dragon, Fire, and Electric. Tough Claws-boosted Flare Blitz fires off nuclear-powered attacks, heavily denting walls such as Mandibuzz, Gliscor, and Mega Sableye. Dragon Claw, also powered up by Tough Claws, threatens Garchomp, Rotom-W, and Kommo-o. Earthquake threatens switch-ins like Toxapex, Skeledirge, and Heatran, while Roost increases Mega Charizard X's longevity and mitigate recoil damage from Flare Blitz. Alternatively, Thunder Punch may be used to deal more damage to Slowbro, Pelipper, and Tapu Fini while still retaining super effective coverage against Toxapex. Volcarona is an exceptional teammate, as it threatens physical walls such as Slowbro, Toxapex, and Hippowdon after a Quiver Dance. Torkoal supports Mega Charizard X with sun to boost Flare Blitz's power and remove rain, Stealth Rock to wear down switch-ins, and Rapid Spin to remove entry hazards. Rotom-H sets up Reflect and Light Screen to ease Mega Charizard X's setup process and offers pivoting with Volt Switch. Choice Scarf Blacephalon is a great late-game cleaner and is appreciated to wear down troublesome walls like Skeledirge and Slowbro as well as cripple Toxapex and Porygon2 with Trick. Heatran traps and withers down Toxapex with Magma Storm and prevents Stealth Rock from being set up using Taunt. Cinderace provides entry hazard control with Court Change and brings Mega Charizard X in using U-turn.</p>"
      },
      "Drought Wallbreaker (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Quality check by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar check by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Raichu-Alola": {"sets": {"Surge Surfer (Electric)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Nidoking": {"sets": {"Wallbreaker (Poison)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Ninetales-Alola": {
    "sets": {
      "Aurora Veil (Ice)": {
        "description": "<p>With access to Snow Warning and Aurora Veil, a great typing, and a key Speed tier that lets it deal with the likes of Keldeo and Urshifu-R, Alolan Ninetales proves to be extremely useful for Ice teams. Freeze-Dry makes it a menace in the Water matchup, dealing heavy damage to Swampert, Gastrodon, and Pelipper. Encore enables Alolan Ninetales to disrupt walls and slower setup sweepers like Ting-Lu and Tapu Fini. Alolan Ninetales's teammates appreciate its supportive capabilities; setup sweepers like Swords Dance Weavile and Dragon Dance Baxcalibur have a lot more setup opportunities, and offensive Pokemon like Galarian Darmanitan have an easier time switching in. Cloyster is a stellar partner; its defensive set removes entry hazards with Rapid Spin and sets Spikes to wear down Keldeo and Toxapex for Alolan Ninetales, while Shell Smash variants can more easily set up with its assistance. SubRoost Kyurem helps Alolan Ninetales pressure Water teams with its own Freeze-Dry and checks Fighting-types like Galarian Zapdos with a Chople Berry. Piloswine lays down Stealth Rock and switches into and checks a variety of Fire-types that Alolan Ninetales hates, such as Volcarona and Iron Moth.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mateeus", "user_id": 321991}], "teams": [{"name": "Ice analysis by", "members": [{"username": "Mateeus", "user_id": 321991}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Slowbro": {"sets": {"Defensive (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Muk-Alola": {"sets": {"Assault Vest (Poison)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Cloyster": {"sets": {"Physically Defensive (Ice)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Shell Smash Sweeper (Ice)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Gengar": {"sets": {"Choiced Attacker (Ghost)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Pinsir": {"sets": {"Swords Dance (Bug)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Ditto": {
    "sets": {
      "Scarf Imposter": {
        "description": "<p>Ditto solidifies itself to once again be the goo that holds balanced and offensive Normal teams together thanks to its incredibly strong ability in Imposter. Reversing the momentum of fast offensive threats such as Iron Valiant, Mega Charizard X, and Excadrill allows Ditto to force counterplay against offensive teams. Ditto can also take advantage of entry hazard setters and removers, such as Ferrothorn, Kleavor, and Zapdos, using their own longevity or utility against them. In order to take advantage of Pokémon that use either Return or Frustration, such as Mega Altaria or Mega Pinsir, Ditto likes to run 128 Happiness instead of 252 or 0. Walls like Blissey and Porygon2 appreciate Ditto being able to prevent threats such as Baxcalibur and Spectrier from using them as setup fodder, while Ditto appreciates both defensive switch-ins and slow pivots via their use of Teleport. Mega Lopunny is a staple on Normal teams that accents Ditto's role expertly; many of the offensive threats and setup sweepers that revenge kill Mega Lopunny, such as Mega Charizard X, Kommo-o, and Galarian Moltres, are usually very weak to their own sets or coverage. Mega Lopunny can lure a threat in and pivot with U-turn, allowing Ditto to come in safely and transform. Ditto appreciates Mega Lopunny's Speed tier and fast pivot with U-turn, as well as potentially setting up Ditto with Encore Sets to stop foes from using Substitute or setting up completely. Hisuian Zoroark makes for another stellar teammate for Ditto, as Hisuian Zoroark disguised as a passive Pokemon, such as Blissey, or another offensive threat, such as Diggersby or Mega Lopunny, can lead to Hisuian Zoroark wallbreaking and netting KOs on vital foes, making it easier for Ditto to sweep once it has transformed. While Ditto is immune to Sticky Web, it is susceptible to other hazards such as Stealth Rock and Toxic Spikes, so forms of hazard control such as Staraptor or Cyclizar are appreciated. Staraptor is another defensive option, while Cyclizar can enable Ditto to utilize Transform with a Substitute from Shed Tail. Smeargle on more offense-oriented teams' pairs well with Ditto, as Smeargle can set hazards with Stone Axe or Ceaseless Edge and spread status with Nuzzle, Mortal Spin, or Spore, allowing Ditto to exploit the opposing team easier. Smeargle will usually give up Sticky Web when paired with Ditto so as to not hinder Ditto's revenge killing prowess.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Illecent Excaliburn", "user_id": 475589}], "teams": [{"name": "Normal Analysis By", "members": [{"username": "Illecent Excaliburn", "user_id": 475589}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Giyu", "user_id": 574288}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Aerodactyl": {"sets": {"Offensive (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned</p>"}}},
  "Zapdos": {
    "sets": {
      "Choice Specs (Electric)": {
        "description": "<p>With Choice Specs equipped, Zapdos's already amazing Special Attack is boosted to even greater heights, turning it into an incredible wallbreaker. Its Flying typing also grants an invaluable Ground immunity for Electric teams. Hurricane is Zapdos's most powerful move, threatening a variety of Pokemon that resist or are immune to Electric such as Mega Venusaur and Gastrodon. Heat Wave beats Steel-types such as Mega Scizor, Iron Treads, and Ferrothorn, thus making it an incredible asset in the Steel and Grass matchups. Hidden Power Ice cleanly OHKOes Gliscor, Landorus-T, and Garchomp; alternatively, Hidden Power Grass can be used if reliably eliminating Gastrodon and Swampert is more important. Volt Switch lets Zapdos switch out of its checks like Tyranitar and Blissey, keeping momentum in favor of Zapdos's team. As dangerous as Zapdos is, it is highly susceptible to Stealth Rock; hence, Rotom-W is a great partner that can use Defog while also helping Zapdos beat Ground-types thanks to Hydro Pump. Iron Hands and Zeraora help Zapdos wallbreak by wearing down special walls like Heatran, Blissey, and Clodsire. Regieleki and Alolan Raichu can take advantage of Zapdos weakening teams and removing Ground-types so that they can clean up with their deadly Rising Voltage later in the game.</p>"
      },
      "Physically Defensive Pivot (Electric)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}], "teams": [{"name": "Electric analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Quality checked by", "members": [{"username": "Mateeus", "user_id": 321991}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Zapdos-Galar": {"sets": {"Choice Scarf (Fighting)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Moltres-Galar": {
    "sets": {
      "Double Dance (Dark)": {
        "description": "<p>With access to both Nasty Plot and Agility as well as a Special Attack-boosting ability in Berserk, Galarian Moltres is a great late-game sweeper for Dark teams. In addition, its part-Flying typing provides Dark teams with a great offensive option against Fighting and Bug teams, as well as a greatly appreciated neutrality to the aforementioned types. After one Nasty Plot boost, Galarian Moltres 2HKOes physically defensive Toxapex, physically defensive Ting-Lu, and Celesteela. After one Agility boost, it is able to outspeed would-be faster Pokemon such as Choice Scarf Iron Valiant, Regieleki, and +1 Volcarona, as well as Mega Swampert in rain. With Flyinium Z , a Nasty Plot-boosted Supersonic Skystrike OHKOes Mega Diancie, Tapu Koko, and specially defensive Toxapex. An unboosted Supersonic Skystrike is still able to OHKO Terrakion after Stealth Rock damage. Hisuian Samurott provides entry hazard support in order to wear down incoming foes into OHKO range for Galarian Moltres, and in return, Galarian Moltres can threaten the Grass- and Fighting-types the two of them struggle with such as Mega Venusaur and Urshifu-R. Grimmsnarl is another great teammate, as it is able to set up dual screens to further make Galarian Moltres difficult to KO, and it can also run Taunt to prevent Stealth Rock from being set. Because of Galarian Moltres's part-Flying-typing, it is vulnerable to Stealth Rock. Because of this vulnerability, it appreciates hazard control from Mega Sableye's Magic Bounce, and Mega Sableye is also able to cripple opposing foes with Will-O-Wisp and Knock Off. Choice Band users such as Weavile, Roaring Moon, and Meowscarada can check walls Galarian Moltres struggles with like Dondozo and Clodsire. In return, Meowscarada and Weavile appreciate Galarian Moltres matching up well against Volcarona and Roaring Moon appreciates Galarian Moltres matching up well against Great Tusk. Lastly, Galarian Moltres can be paired with other sweepers such as Swords Dance Weavile and Dragon Dance Roaring Moon to soften each other's checks to enable each other to sweep. For example, Weavile is able to threaten Ting-Lu and Clodsire, while Galarian Moltres is able to handle Choice Scarf Gholdengo in return. When Galarian Moltres is not able to complete an outright sweep, it can set up for Choice Scarf users such as Meowscarada and Greninja to clean up.</p>"
      },
      "Nasty Plot (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "CaptainDaimyo", "user_id": 602431}], "teams": [{"name": "Dark analysis by", "members": [{"username": "CaptainDaimyo", "user_id": 602431}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Bka Onon", "user_id": 532439}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Dragonite": {"sets": {"Dragon Dance (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}]}]}},
  "Crobat": {"sets": {"Utility (Poison)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Azumarill": {"sets": {"Belly Drum (Fairy)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Scizor": {
    "sets": {
      "Offensive Swords Dance (Steel)": {
        "description": "<p>Mega Scizor makes for a strong wallbreaker and sweeper on Steel teams thanks to its access to Swords Dance, high Attack stat, and well-rounded bulk. Bullet Punch is Mega Scizor's strongest STAB move, and its priority allows it to revenge kill faster threats such as Mega Diancie, Iron Valiant, and Mega Lopunny. Close Combat is Mega Scizor's strongest coverage move, enabling it to more easily beat Corviknight, Ting-Lu, and Heatran. After a Swords Dance boost, Mega Scizor becomes strong enough to 2HKO Celesteela, opposing Mega Scizor, and physically defensive Gastrodon. Knock Off removes essential items such as Heavy-Duty Boots from Tornadus-T and Black Sludge from Toxapex, and it also provides Mega Scizor with strong coverage against Aegislash, Skeledirge, and Gholdengo. Alternatively, Trailblaze can also be used to 2HKO bulky Water- or Ground-type Pokemon most other Steel-types struggle with such as Mega Swampert and Gastrodon, as well as potentially OHKO Azumarill and Rotom-W after a Swords Dance boost and Stealth Rock damage. 132 Speed EVs are invested in order for Mega Scizor to outspeed Jolly Azumarill as well as Hydreigon and Urshifu-S after a Trailblaze. Heatran and Ferrothorn are great teammates because they are able to set entry hazards to wear down incoming foes, and Heatran also has the added benefit of providing a Fire immunity thanks to its ability. Ferrothorn can also provide passive healing for Mega Scizor via the use of Leech Seed. In return, Mega Scizor is able to threaten faster Fighting-types such as Sneasler and Iron Valiant with Bullet Punch. Gholdengo is able to threaten Toxapex and Tapu Lele, and it along with Aegislash can also hinder foes with Toxic and Thunder Wave respectively if they are running defensive sets, easing set up for Mega Scizor. In return, Mega Scizor can remove Dark-types such as Meowscarada, Ting-Lu, and Galarian Moltres. Specially defensive Celesteela is an excellent special wall that can wall Choice Specs Tapu Lele and Mega Altaria, while also being able to spread status and use Leech Seed to aid Mega Scizor in its sweeping. As Mega Scizor is more vulnerable to hazards compared to other Steel-types, it appreciates hazard removal from the likes of Corviknight, Excadrill, and Iron Treads. Excadrill and Iron Treads also have the added merit of handling Fire-types like Victini and Ogerpon-H. Excadrill can also bypass Mega Sableye's Magic Bounce and inflict poison on it thanks to Mold Breaker, while Iron Treads can threaten both Landorus formes with Ice Spinner.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "CaptainDaimyo", "user_id": 602431}], "teams": [{"name": "Steel analysis by", "members": [{"username": "CaptainDaimyo", "user_id": 602431}]}, {"name": "Quality checked by", "members": [{"username": "Bka Onon", "user_id": 532439}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Shuckle": {
    "sets": {
      "Sticky Web (Rock)": {
        "description": "<p>Shuckle is an essential member of any hyper offensive Rock team due to its access to Sticky Web, which allows teammates such as Mega Diancie and Terrakion to dominate the Steel and Dark matchups. With Mental Herb, it isn't scared to set up entry hazards in front of common Taunt users such as Deoxys-S and Zeraora. Encore shuts down setup sweepers such as Mega Scizor and bulky walls such as Hippowdon and Ferrothorn, locking them into their setup and recovery moves. Shuckle can generate momentum after setting up hazards by using Final Gambit, allowing teammates such as Shell Smash Omastar, Mega Diancie, and Choice Band Tyranitar to come in and start exerting pressure. Toxic can also be used to punish more passive Pokemon such as Gastrodon and Hippowdon. Mega Diancie can bounce back any hazards or status moves directed at Shuckle and provides amazing offensive pressure and coverage against Poison-, Steel-, and Dragon-types. Sticky Web allows Choice Band Tyranitar to outspeed Choice Specs Gholdengo and Nidoking, both of which are threats to Rock. Omastar and Minior benefit from Stealth Rock breaking potential Focus Sashes and are great partners to have in the Grass and Fighting matchups. Thanks to Sticky Web, Omastar outspeeds Sand Rush Excadrill after one shell smash and +1 Spe Nihilego outspeeds Barraskewda in the rain. Power Herb Nihilego is able to sweep teams as well with Meteor Beam and amazing coverage. Thanks to Sticky Web, Choice Scarf Terrakion outspeeds Choice Scarf Meowscarada and Greninja, which are threats to Rock teams. Hisuian Arcanine is able to deal massive damage, OHKOing Pokemon such as Choice Scarf Heatran, Mega Gallade, and Corviknight after Stealth Rock.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Don Bork", "user_id": 623713}], "teams": [{"name": "Rock analysis by", "members": [{"username": "Don Bork", "user_id": 623713}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Piloswine": {
    "sets": {
      "Specially Defensive Wall (Ice)": {
        "description": "<p>Piloswine is one of Ice teams' best specially defensive walls, capable of filling some of Ice teams' biggest roles of being an entry hazard setter and Electric immunity. Thick Fat coupled with Eviolite gives Piloswine tremendous bulk, with which it can check dangerous Fire-type threats to Ice such as Volcarona and Mega Charizard Y by disposing of them with Rock Slide. 12 EVs in Attack guarantees an OHKO on offensive Volcarona. Another one of Piloswine's amazing traits is its Ground typing, which makes it a great asset in the Electric matchup by preventing a Volt Switch onslaught while also letting it hit Electric-types super effectively with STAB Earthquake. Toxic is an option to put defensive switch-ins such as Skeledirge and Rotom-W on a timer, helping Piloswine's teammates overpower them, but Roar is an alternative choice to force out threats that may use it to set up, such as Mega Scizor, and to rack up hazard damage from its Stealth Rock and Cloyster's Spikes to wear down threats such as Urshifu-R and Mega Venusaur. Piloswine appreciates Alolan Ninetales's snow and Aurora Veil, which let it wall the opposition more easily. Piloswine is, however, extremely vulnerable to Water-types, so partnering it with Kyurem or Arctozolt is appreciated, as they can easily break Water teams. Substitute Baxcalibur also threatens Poison teams, which can cripple Piloswine with Toxic. Weavile with a Z-Crystal is also a good Knock Off absorber for Piloswine, as losing Eviolite ruins Piloswine; Weavile also forces immense progress by removing key items from Celesteela and Skeledirge, which become susceptible to Stealth Rock afterwards, or outright breaking through them with a Z-Move. Galarian Darmanitan and Shell Smash Cloyster can threaten Steel teams with Flare Blitz and Hydro Pump or Hidden Power Fire, respectively. The Stealth Rocks and Toxic spread by Piloswine also accentuates the breaking power of teammates such as Swords Dance or Dragon Dance Baxcalibur and Belly Drum Cetitan. IronPress Avalugg and defensive Cloyster with Hidden Power Fire are also good partners in being able to shut down Mega Scizor. Avalugg, Articuno, and Cloyster are also capable of removing entry hazards, with the latter two also being able to pivot in Piloswine with U-turn and Teleport, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}], "teams": [{"name": "Ice analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "red fintans", "user_id": 637479}, {"username": "Milak", "user_id": 262594}]}]}
  },
  "Porygon2": {"sets": {"The Duck": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Blissey": {"sets": {"Specially Defensive (Normal)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Tyranitar": {"sets": {"Choice Band (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Swampert": {"sets": {"Rain Sweeper (Water)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Specially Defensive (Water)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Swampert-Mega": {},
  "Pelipper": {"sets": {"Rain Setter (Water)": {"description": "<p>Underspeeds Hippowdon, allowing Rain to be set last.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Sableye": {
    "sets": {
      "Mixed Wall (Dark)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Mixed Wall (Ghost)": {
        "description": "<p>Mega Sableye is a staple on bulkier Ghost teams due to its Dark typing, great abilities before and after Mega Evolution, and great defensive stats. Knock Off hinders Chansey and Porygon2 for Mega Sableye's wallbreaking teammates and eases the matchup against Landorus and Nidoking. Due to Sableye's meager HP and need for longevity, Recover's a must-have utility option, further enabling Metal Burst. Protect allows Sableye to Mega Evolve safely, ensuring it can utilize Magic Bounce later into the game. Metal Burst retaliates against Fairy-types such as Mega Diancie, while Dazzling Gleam eliminates Mega Sableye's passivity in front of Hydreigon and Roaring Moon. Will-O-Wisp in conjunction with Prankster renders physical attackers like Mega Gallade, Dragonite, and Mamoswine less threatening. The given EV spread avoids a 2HKO from Life Orb Nidoking's Earth Power, assuming Mega Sableye uses Knock Off after the first Earth Power. Mimikyu threatens Dark-types such as Mandibuzz, Galarian Moltres, and opposing Mega Sableye. Gholdengo checks Fairy-types such as Tapu Lele, Mega Diancie, and Iron Valiant as well as preventing foes from removing entry hazards set by Froslass and Galarian Corsola. Blacephalon handles opposing Gholdengo and utilizes Choice Scarf to clean through Steel, Ghost, and Psychic teams once Heatran, Mega Sableye, and Galarian Slowking, respectively, are removed. Skeledirge has great synergy with Mega Sableye, appreciating the prevention of opposing Stealth Rock and in return walling Volcarona, Mega Lopunny, and Alolan Ninetales.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Ghost analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "CrossHeart", "user_id": 593863}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Altaria": {
    "sets": {
      "Offensive Dragon Dance (Dragon)": {
        "description": "<p>Mega Altaria's unique typing and offensive potential allow it to serve as a valuable setup sweeper that checks threats like Kommo-o, Roaring Moon, Iron Hands, and Keldeo. Pixilate-boosted Return checks the aforementioned Dragon-types as well as Fighting- and Dark-types such as Terrakion, Mega Sableye, and Mandibuzz. Earthquake is essential coverage, as it hits Steel- and Fire-types like Heatran and Magnezone and—in conjunction with Return—eases the Dark and Electric matchups. Roost increases Mega Altaria's longevity so it can continuously Dragon Dance throughout the match or use its bulk to switch into threats. The given EV spread allows Mega Altaria to survive Mega Lopunny's Triple Axel. Choice Specs Kyurem is a great teammate, as it breaks past the likes of Toxapex, Corviknight, and Dondozo for Mega Altaria. Garchomp sets up Stealth Rock and Spikes, wearing down Mega Altaria's switch-ins. Kommo-o breaks past Steel-types like Skarmory, Aegislash, and defensive Celesteela as well as other troublesome walls like Toxapex and Hippowdon for Mega Altaria. Roaring Moon threatens obstacles such as Mega Diancie, Choice Specs Greninja, and Skeledirge.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Dragon analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "Mateeus", "user_id": 321991}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar check by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Latias": {"sets": {"Choice Scarf (Dragon)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Choice Scarf (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Jirachi": {"sets": {"Specially Defensive (Psychic)": {"description": "<p>20 Spe EVs lets it outspeed Breloom and Pokemon around that speed tier</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Z-Happy Hour (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Choice Scarf (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Deoxys-Speed": {"sets": {"Nasty Plot (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned</p>"}}},
  "Staraptor": {"sets": {"Physically Defensive (Normal)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Gastrodon": {
    "sets": {
      "Physically Defensive (Ground)": {
        "description": "<p>Gastrodon is a mainstay on Ground teams due to its vast utility options, great bulk along with reliable recovery, and a stellar ability in Storm Drain, checking a myriad of Water-types like Mega Swampert, Barraskewda, and Keldeo. Scald threatens physical attackers such as Dragonite, Mega Lopunny, and Mimikyu with a burn. Thanks to Gastrodon's bulk, it is able to stack multiple layers of Spikes to wear down opposing teams. Alternatively, Stealth Rock can be used, freeing a moveslot from a teammate such as Garchomp or Hippowdon. Toxic puts troublesome walls such as Mantine, Ting-Lu, and Araquanid on a timer. Earthquake may be used alongside a Relaxed nature to break Calm Mind Keldeo's Substitute. All of Gastrodon's teammates appreciate its ability to switch into Water-type attacks. Unaware Clodsire checks Grass-types such as Meowscarada and Tapu Bulu as well as setup sweepers Gastrodon can't beat like Volcarona and Galarian Moltres. Iron Treads removes entry hazards with Rapid Spin so Gastrodon can better perform its defensive duties. Wallbreakers like Landorus and Great Tusk appreciate Gastrodon's entry hazard support so that they can net more damage. Mamoswine acts as a secondary Ice-type switch-in that checks the likes of SubRoost Kyurem and Alolan Ninetales, relieving pressure off of Gastrodon.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Ground analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "Mateeus", "user_id": 321991}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Lopunny": {
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Mega Lopunny is the best Mega Evolution available for Normal teams due to its blistering Speed tier, great offensive prowess, and unique ability in Scrappy. Fake Out lets Mega Lopunny serve as an exceptional revenge killer, dealing with worn down foes like Meowscarada, Barraskewda, and Alolan Raichu. It also puts Pokemon like Keldeo, Cinderace, and Tapu Koko in range of its other attacks safely. With Scrappy, Close Combat notably lets Mega Lopunny take on threats like Mega Sableye, Aegislash, and Gholdengo, threatening the defensive cores of Dark and Steel teams. U-turn enables Mega Lopunny to work as a potent offensive pivot, escaping unfavorable situations against walls like Slowbro and Mega Venusaur while keeping momentum. Triple Axel threatens common switch-ins such as Gliscor and Mandibuzz, while Return is Mega Lopunny's hardest-hitting move against most Psychic- and Fairy-types, such as Tapu Lele and Iron Valiant. Blissey is a great teammate, taking on the likes of Volcarona and Zapdos thanks to its bulk while offering support in the form of Stealth Rock, Toxic, and Teleport. Staraptor switches into Fighting-type attacks from Pokemon like Great Tusk, Buzzwole, and Tapu Bulu, and its access to Defog and U-turn also prolongs Mega Lopunny's longevity and lets it switch in unscathed. Special attackers like Hisuian Zoroark and Porygon-Z are able to break past physical walls Mega Lopunny can't, like Skeledirge, Corviknight, and Slowbro. Hisuian Zoroark also prevents Fighting-types from spamming their STAB moves aimed at Mega Lopunny.</p>"
      },
      "Wallbreaker (Normal)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Mateeus", "user_id": 321991}]}, {"name": "Grammar checked by", "members": [{"username": "Deezcastforms", "user_id": 423085}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Garchomp": {"sets": {"Defensive Entry Hazard Setter (Dragon)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Offensive Entry Hazard Setter (Dragon)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Swords Dance (Ground)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Garchomp-Mega": {},
  "Weavile": {"sets": {"Choice Scarf (Ice)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Gliscor": {"sets": {"Stallbreaker (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Mamoswine": {"sets": {"Choice Band (Ground)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Gallade": {
    "sets": {
      "Swords Dance (Fighting)": {
        "description": "<p>For Fighting teams, Mega Gallade is one of the best choices, courtesy of its incredible offensive power, typing, and Speed, being the best counter to Fighting's biggest roadblock, Toxapex. Swords Dance increases Mega Gallade's power to the maximum, letting it freely overpower the likes of Mandibuzz and Celesteela. Zen Headbutt beautifully complements a Fighting-type STAB move, as it lets Mega Gallade easily break through any opposing Poison-types that may be annoying walls such as Mega Venusaur, Toxapex, and Clodsire. Knock Off is another tool in Mega Gallade's arsenal, which lets it take care of Psychic- and Ghost-types—such as Gholdengo, Slowbro, and Aegislash—and wears down Celesteela into range of Close Combat finishing it off. Triple Axel is another option to easily take care of Flying-types such as Landorus-T, Dragonite, and Enamorus. Shadow Sneak can also be considered to pick off faster weakened threats such as Gengar, Choice Scarf Blacephalon, and Mega Alakazam. With all its benefits, Mega Gallade has a few checks in Skeledirge and defensive Gholdengo; hence, offensive Great Tusk and Urshifu-R are great partners in helping take these down. Defensive Great Tusk also helps in setting and removing entry hazards, which is appreciated by Mega Gallade. Mega Gallade is also easily revenge killed by faster offensive threats such as Tornadus-T and Choice Scarf Blacephalon, so Assault Vest Iron Hands is a good check to stop these in their tracks and deal good damage back while also being able to pivot in Mega Gallade with Volt Switch. Breloom and Lilligant-H also helps significantly in the Water matchup against the likes of Mega Swampert and Barraskewda; they can also put opposing foes to sleep to make Gallade's setup easier. Choice Scarf Sneasler helps in the Fairy matchup against the likes of Choice Scarf Tapu Lele and Tapu Koko while also being able to set and absorb Toxic Spikes and can U-Turn to pivot in Mega Gallade safely. Iron Valiant is also an amazing partner in the form of a specially offensive threat, complementing Mega Gallade, as it can easily take care of Mega Sableye. Choice Scarf Iron Valiant also outspeeds Mega Swampert under rain and Regieleki under Electric Terrain, making it a great revenge killer if Mega Gallade gets knocked out.</p>"
      },
      "Swords Dance (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}], "teams": [{"name": "Type analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Rotom-Wash": {
    "sets": {
      "Bulky Pivot (Electric)": {
        "description": "<p>With its access to Levitate, Rotom-W is nearly mandatory on all Electric teams. Its Ground immunity and Water-type resistance make Pokemon like Mega Swampert unable to bother it; it also has access to Hydro Pump to hit annoying Ground-types such as Great Tusk and Hippowdon. Rotom-W is also a really good blanket check to Ice- and Fire-types like Mamoswine, Victini, and Galarian Darmanitan. Volt Switch provides great momentum, which is needed in hyper offense teams. In addition to providing momentum, Rotom-W has access to Will-O-Wisp and Toxic, crippling foes such as Mega Garchomp and Mimikyu with Will-O-Wisp, while Toxic punishes switch-ins such as Gastrodon and Kyurem. Defog lets Rotom-W compress roles, freeing up Zapdos to run Choice Specs, while Rotom-W prevents hazards from hurting teammates. Pain Split is another option, as it massively improves Rotom-W's longevity; however, this requires Zapdos to run Defog. The 44 invested Speed EVs ensure Rotom-W outspeeds Jolly Azumarill so that it can punish Azumarill for setting up Belly Drum with Will-O-Wisp or Volt Switch. Zapdos covers Rotom-W's weakness to Grass-types with access to Hurricane and Heat Wave, being able to OHKO the likes of Mega Venusaur and Ferrothorn, respectively, while also being immune to Mold Breaker Excadrill's Earthquake. Regieleki can be used as a Rapid Spinner, removing pressure from Rotom-W to function as the only hazard removal while also luring in Ground-types that Rotom-W can punish such as Iron Treads or Great Tusk. With access to Taunt and having an amazing Speed tier, Zeraora can prevent hazards from coming up and allow Rotom-W to switch in freely and get off a strong Hydro Pump or gain a lot of momentum and Volt Switch into one of its offensive teammates. Zeraora also pressures Hydreigon and Gholdengo, which can use Rotom-W as setup fodder. Iron Hands provides the coverage and bulk against Pokemon like Dragon Dance Dragonite, Volcarona, and SubRoost Kyurem that Rotom-W can't deal with while also putting a lot of pressure on Normal teams, as Rotom-W can Volt Switch against Blissey into Iron Hands and force Blissey to tank a hit or switch out. Alolan Raichu gives Rotom-W's slow Volt Switch a lot of value as it is strong but frail, being able to deal with Ice-types like Baxcalibut with Focus Blast and Poison-types like Mega Venusaur and Clodsire with Psyshock. Magnezone provides a valuable Poison immunity while also checking other threats like Tapu Lele, Meowscarada, and Alolan Ninetales.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Don Bork", "user_id": 623713}], "teams": [{"name": "Electric analysis by", "members": [{"username": "Don Bork", "user_id": 623713}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Giyu", "user_id": 574288}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Azelf": {"sets": {"Entry Hazard Lead": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Heatran": {
    "sets": {
      "Specially Defensive (Steel)": {
        "description": "<p>Heatran is a mainstay on Steel teams due to its ability, Flash Fire, letting it switch into threats like Blacephalon, Victini, and Iron Moth. Lava Plume makes Heatran annoying to switch into thanks to its burn chance, while Magma Storm softens walls like Toxapex and Rotom-W by trapping them. Earth Power threatens Poison- and Fire-types and makes Heatran an important asset against opposing Steel teams by hitting opposing Heatran. Roar lets Heatran phaze the likes of Nasty Plot Hydreigon and Z-Celebrate Victini and synergizes well with Stealth Rock to deal extra damage. Alternatively, Toxic cripples walls like Mantine and Rotom-W, as well as Pokemon that fancy switching into Heatran such as Volcarona and Mega Charizard Y. Substitute pairs well with Toxic and allows Heatran to be massively annoying against types like Steel, Electric, and Psychic by capitalizing on the many switches it forces in these matchups. Thanks to their typing and bulk, Corviknight and Celesteela are excellent teammates to check Ground- and Fighting-types like Mamoswine and Great Tusk for Heatran. Setup sweepers like Mega Scizor and Z-Happy Hour Jirachi appreciate Heatran wearing down teams with burn and Toxic. Iron Treads removes entry hazards with Rapid Spin and deals with Mega Charizard Y, Zeraora, and Cinderace with its Choice Scarf set. Ferrothorn checks Water-types like Mega Swampert and Urshifu-R and aids Heatran with Spikes and Leech Seed.</p>"
      },
      "Offensive Utility (Fire)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Steel analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Mateeus", "user_id": 321991}]}, {"name": "Grammar check by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Victini": {
    "sets": {
      "Choice Band (Psychic)": {
        "description": "<p>Victini is a great wallbreaker on Psychic teams due to its well-rounded coverage and signature move in V-create, easing the matchup against Steel, Grass, and Ice teams. Bolt Strike threatens bulky Water-types such as Toxapex, Slowbro, and Tapu Fini that resist V-create. U-turn preserves Psychic's momentum and allows Victini to switch out of Pokemon that wall it like Dragonite and Mega Altaria. Trick cripples common switch-ins such as Storm Drain Gastrodon, Toxapex, and Skeledirge, while Brick Break lets Victini further threaten Steel and Dark teams by hitting Heatran and Mega Tyranitar hard. Choice Scarf Tapu Lele is an excellent teammate due to its ability to check Dark- and Dragon-types like Weavile, Kommo-o, and Hydreigon. It also sets up Psychic Terrain, protecting Victini from priority moves from the likes of Mimikyu and Azumarill. Jirachi and Celebi aid in Victini's wallbreaking by setting up Stealth Rock and replenishing its HP with Healing Wish. Furthermore, they form a pivot core with Victini that deals sizable chip damage while keeping momentum. Latias also provides Healing Wish support and removes entry hazards with Defog to preserve Victini's longevity. Mega Gallade and Victini can each weaken certain physical walls for the other to dispose of such as Ting-Lu and Skeledirge. Deoxys-S breaks through roadblocks like Toxapex, Garchomp, and Swampert and aids in cleaning weakened Flying and Water teams. Slowbro switches into most Water- and Ground-types that threaten Victini, like Urshifu-R and Excadrill, and it brings Victini into the field with Teleport.</p>"
      },
      "Choice Scarf (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned</p>"}
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Psychic analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Mateeus", "user_id": 321991}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Whimsicott": {"sets": {"Offensive Utility (Grass)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Darmanitan-Galar": {"sets": {"Choice Scarf": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Zoroark-Hisui": {"sets": {"Z-Happy Hour (Ghost)": {}, "Choiced Attacker (Ghost)": {}, "Utility (Ghost)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Utility (Normal)": {}, "Z-Happy Hour (Normal)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Ferrothorn": {
    "sets": {
      "Entry Hazard Wall (Grass)": {
        "description": "<p>Ferrothorn is a highly reliable wall in Grass teams, boasting good defensive stats, recovery, and an immunity to Poison. It's an incredible asset for Grass teams, as it can manage notable threats such as Kyurem, Tapu Lele, and Melmetal. Gyro Ball capitalizes on its low Speed and threatens Fairy-types and fast foes like Alolan Ninetales and Tapu Lele. However, Iron Head provides more consistent damage against slower foes like Hatterene and is less susceptible to PP stalling, which is particularly useful against Kyurem if Ferrothorn isn't running Body Press. Depending on its teammates, Ferrothorn can opt for Stealth Rock or Spikes, as Cradily can also set up Stealth Rock, while Meowscarada has access to Spikes and Toxic Spikes. With the combination of Leech Seed and Leftovers, Ferrothorn gains substantial recovery each turn, enabling it to wear down and punish switch-ins such as Heatran, Aegislash, and Nidoking. Protect serves as a scouting tool and extends the benefits of Leech Seed and Leftovers, while Body Press allows Ferrothorn to utilize its high Defense and deal significant damage to Steel- and Dark-types, like Melmetal and Weavile. When in conjunction with Gyro Ball, Body Press ensures that Substitute Kyurem won't be able to PP stall Ferrothorn, and when used with Iron Head, it guarantees an OHKO against Weavile. The featured EV spread both prevents a 2HKO from Choice Band Weavile's Icicle Crash and lets Ferrothorn almost always beat SubRoost Kyurem.</p> <p>Ferrothorn forms a formidable defensive core with Mega Venusaur, as the latter's typing and ability enable it to come in on Fighting- and Ice-types such as Iron Valiant, Iron Moth, and Galarian Darmanitan. Additionally, Mega Venusaur's Sludge Bomb can poison foes, allowing Ferrothorn's combination of Leech Seed and Protect to wear them down more quickly. Cradily is another valuable partner, providing natural special bulk and a favorable matchup against Blacephalon and Nidoking. Offensive partners such as Rillaboom, Meowscarada, Iron Leaves, and Zarude greatly appreciate Ferrothorn weakening the opposing team with entry hazards and Leech Seed. In return, Rillaboom sets up Grassy Terrain for additional recovery and provides strong priority damage, while Choice Scarf Meowscarada can revenge kill threats such as boosted Kommo-o. Whimsicott and Celebi handle Fighting-types such as Iron Valiant and Kommo-o, which would otherwise pose a threat to Ferrothorn. Whimsicott also punishes setup sweepers like Volcarona or Mega Scizor, which could otherwise use Ferrothorn as setup fodder, while Celebi helps ease the Poison matchup, as well as the Steel matchup in a pinch.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Swiffix", "user_id": 547532}], "teams": [{"name": "Type analysis by", "members": [{"username": "Swiffix", "user_id": 547532}]}, {"name": "Quality checked by", "members": [{"username": "maroon", "user_id": 305839}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Mandibuzz": {"sets": {"Physically Defensive (Dark)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Hydreigon": {"sets": {"Nasty Plot (Dark)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Volcarona": {
    "sets": {
      "Offensive Quiver Dance (Bug)": {
        "description": "<p>Volcarona is one of Bug's strongest setup sweepers, with a respectable Speed stat, high Special Attack, and great coverage. In addition to being one of very few special attacking options on Bug, Volcarona helps apply pressure in a variety of matchups thanks to its strong STAB moves and coverage. Fire Blast can be used over Fiery Dance for more immediate damage output. Giga Drain deals with Water- and Ground-types, most notably Swampert, Gastrodon, and Rotom-Wash. Bug Buzz can be used instead for Volcarona to overwhelm types like Dragon, Dark, and Psychic with Quiver Dance-boosted STAB attacks. Hidden Power Ground hits Heatran, allowing Volcarona to break Steel's immunity-based defensive core that can otherwise give Bug teams problems. Alternatively, Psychic can be used to damage bulky Poison-types, like Toxapex and Mega Venusaur, that can wall physical attackers like Heracross and Buzzwole. These physical attackers, in addition to Lokix and Scizor, are able to break through specially defensive walls, like Chansey and Mantine, that Volcarona struggles against. Araquanid and Armaldo provide helpful entry hazards in Sticky Web and Stealth Rock, respectively, to make sweeping mid- or late-game much easier.</p>"
      },
      "Offensive Quiver Dance (Fire)": {
        "description": "<p>Volcarona is one of the top setup sweepers that Fire has access to, with Quiver Dance allowing it to become a dangerous threat to teams unequipped to deal with it defensively. Psychic allows Volcarona to pressure Fighting and Poison teams, especially after one Quiver Dance, which lets Volcarona outspeed and beat Keldeo, Glimmora, and Crobat. Similarly, Giga Drain does the same to Water and Ground teams after one Quiver Dance, threatening Tapu Fini, Gastrodon, and Hippowdon. Bug Buzz covers the Psychic and Dark matchups very well and allows it to hit Roaring Moon, Ting-Lu, and Latias, which would otherwise be a challenge to deal with. Heavy-Duty Boots prevents Volcarona from being worn down by entry hazards, most notably Stealth Rock, which would otherwise stop Volcarona from being able to set up safely. Psychium Z lets Volcarona OHKO Toxapex with a +1 Shattered Psyche and beat otherwise troublesome threats like +1 Kommo-o, Iron Hands, and Clodsire. Cinderace and Mega Charizard X are especially good partners due to their ability to break through special walls such as Blissey, Clodsire, and Galarian Slowking with relative ease. Entry hazard removers such as Torkoal, Rotom-H, and Court Change Cinderace are near necessities if Volcarona is running Psychium Z. Torkoal and Rotom-H can also provide excellent utility in the form of Stealth Rock and dual screens, respectively, to help Volcarona sweep more easily. Volcanion is also an excellent partner for Volcarona that, thanks to its Water immunity, can act as a strong pivot into Pokemon like Azumarill and Mantine, which could revenge kill it or clear Quiver Dance boosts with Haze.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "style.css", "user_id": 537941}, {"username": "Captainbruh1008", "user_id": 610704}], "teams": [{"name": "Bug analysis by", "members": [{"username": "style.css", "user_id": 537941}]}, {"name": "Fire analysis by", "members": [{"username": "Captainbruh1008", "user_id": 610704}]}, {"name": "Quality checked by", "members": [{"username": "Bka Onon", "user_id": 532439}, {"username": "Mateeus", "user_id": 321991}, {"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Estarossa", "user_id": 461329}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Cobalion": {"sets": {"Utility (Fighting)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Terrakion": {
    "sets": {
      "Choice Scarf (Rock)": {
        "description": "<p>Terrakion is the ideal Choice Scarf user for Rock teams due to its high Speed stat and access to powerful coverage moves in Earthquake and Close Combat. Close Combat provides coverage against Steel-, Normal-, and Dark-types such as Heatran, Mega Lopunny, and Greninja. Earthquake does heavy damage against Electric-types such as Zeraora and Tapu Koko as well as against Poison-types like Toxapex and Clodsire. Poison Jab is able to pressure Grass- and Fairy-types that Rock teams struggle to deal with, being able to OHKO Tapu Bulu and Whimsicott as well as deal high amounts of damage to Azumarill and Tapu Lele. Choice Scarf allows Terrakion to be an amazing revenge killer, outspeeding threats like Mega Lopunny and Zeraora. Terrakion pairs well with Shuckle, as its Stealth Rock and Sticky Web support allows Terrakion to net more KOs and outspeed faster Pokemon like Regieleki, Choice Scarf Meowscarada, and Adamant Barraskewda under rain. Terrakion also pairs well with Mega Diancie, which softens the likes of Great Tusk, Corviknight, and Toxapex for Terrakion thanks to its coverage. Alolan Golem helps Terrakion with the Steel matchup by trapping Pokemon such as Mega Scizor, Corviknight, and Celesteela with its ability Magnet Pull. Nihilego is able to help with the Fairy matchup with Sludge Wave dealing big damage to Pokemon such as Tapu Fini and Clefable. Tyranitar helps Terrakion by setting up sand, which boosts Terrakion's Special Defense stat, allowing it to survive Surf from Choice Scarf Greninja and Dazzling Gleam from Tapu Koko. Tyranitar also provides Pursuit support against faster Choice Scarf users such as Latias while also being able to break walls for Terrakion, allowing it to clean teams more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Don Bork", "user_id": 623713}], "teams": [{"name": "Rock analysis by", "members": [{"username": "Don Bork", "user_id": 623713}]}, {"name": "Quality checked by", "members": [{"username": "Mateeus", "user_id": 321991}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Lumii", "user_id": 493772}]}]}
  },
  "Tornadus-Therian": {
    "sets": {
      "Nasty Plot Wallbreaker": {
        "description": "<p>A colorful movepool, a great Speed tier, and Regenerator make Tornadus-T one of Flying's best wallbreakers. Bleakwind Storm can be used if Tornadus-T is paired with Mega Charizard Y, as its accuracy is not affected by sun. Focus Blast grants Tornadus-T excellent neutral coverage and is able to hit most Steel- and Rock-types, like Heatran and Tyranitar, hard. Heat Wave, however, has the benefit of nailing Jirachi, Gholdengo, and Corviknight, which makes it a better option against Psychic, Ghost, and, if using Knock Off, Steel teams. In the last slot, Taunt is preferred, so Tornadus-T can safely set up on walls like Toxapex and Ting-Lu, but Knock Off's ability to cripple the likes of defensive Heatran and Galarian Slowking is worth considering. Tornadus-T has a very poor matchup against Electric-types, so Pokemon that can deal with them, such as Landorus-T and Gliscor, are must-haves. They're also able to lay down Stealth Rock and have access to Defog, making them incredible teammates. Similarly, Corviknight and Celesteela stomach most Ice-type attacks aimed at Tornadus-T, thanks to their bulk and Steel typing. Mega Charizard Y forms a terrifying wallbreaking duo alongside Tornadus-T that breaks down shared checks such as Heatran and Blissey. Setup sweepers like Dragon Dance Dragonite and Agility Thundurus-T greatly appreciate Tornadus-T weakening or removing walls for them. 88 HP and 8 Special Defense EVs can be used over Special Attack to ensure Tornadus-T lives an Ice Beam from Choice Scarf Greninja from full health.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Mateeus", "user_id": 321991}], "teams": [{"name": "Flying analysis by", "members": [{"username": "Mateeus", "user_id": 321991}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Thundurus-Therian": {"sets": {"Electrium Z (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Landorus": {
    "sets": {
      "Gravity (Ground)": {
        "description": "<p>Due to its potent ability, admirable offensive stats, and great coverage, Landorus cements itself as a staple wallbreaker on Ground teams. Sludge Wave hits Grass-types like Tapu Bulu and Celebi as well as other Fairy-types such as Tapu Lele and Clefable, easing the Fairy and Grass matchups due to unresisted coverage. Focus Blast breaks through Kyurem, Ting-Lu, and Ferrothorn. Rock Polish enables Landorus as a late-game cleaner, shutting down revenge killing abilities from faster foes like Tapu Koko, Choice Scarf Galarian Darmanitan, and Greninja, while Nasty Plot allows Landorus to easily break past the likes of Blissey and Mega Sableye and become terrifying with Gravity-aided Earth Power spam. Rock Slide is another option to hit Volcarona, as it is dangerous once set up, as well as Mantine, Zapdos, and Araquanid; however, using it is very situational and forces Landorus to use an unpreferred nature. Gravity allows Landorus to ease the Flying and Steel matchups and easily spam Earth Power, increasing its potential to new heights and also supporting its teammates like Choice Band Sand Rush Excadrill. Gastrodon is a great teammate due to its ability to soak up Water-type moves from foes like Barraskewda and Mega Swampert, while Gastrodon appreciates Landorus's ability to threaten Grass-types with Sludge Wave. Mamoswine is heavily valued as a sponge for Ice-type moves due to its ability Thick Fat, taking on SubRoost Kyurem and Alolan Ninetales. In return, Mamoswine cleans up Flying teams once Landorus deals with Celesteela, Corviknight, or Skarmory. Choice Scarf or Bulk Up Great Tusk forms a great wallbreaking core, taking out threats like Triple Axel Mega Lopunny and Dragonite, while also appreciating Gravity support. Clodsire provides entry hazards to chip down walls for Landorus, switches into revenge killers like Meowscarada and Tapu Koko, and counters Volcarona with Unaware so Landorus doesn't need to use Rock Slide. Mega Steelix is valued in the Ice and Fairy matchups, taking on Alolan Ninetales, Tapu Koko, Azumarill, and Weavile. Mega Garchomp and Garchomp threaten specially defensive walls like Slowking, Blissey, and Mantine while also providing a Water neutrality with decent defensive stats.</p>"
      },
      "Wallbreaker (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/monotype-analyses.762/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Ground analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar check by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Landorus-Therian": {
    "sets": {
      "Choice Scarf (Flying)": {
        "description": "<p>Choice Scarf Landorus-T is one of the best revenge killers Flying teams have access to, outrunning threats like Tapu Koko, Mega Diancie, and Terrakion while boasting great firepower. It's also very desirable thanks to its defensive traits, which include an immunity to Electric-type attacks and Intimidate. U-turn takes advantage of the switches Landorus-T forces, allowing it to pivot out of walls that come in on it such as Corviknight and Mega Venusaur. Similarly, Knock Off cripples some of the bulky Pokemon it invites in, like Porygon2 and Ferrothorn, by removing their items. Stone Edge notably hits Kyurem the hardest and is Landorus-T's best move versus Flying-types like Zapdos and Pelipper. Alternatively, Explosion lets Landorus-T score a surprise KO against an offensive threat it normally cannot OHKO, such as Keldeo or Mega Lopunny. Special wallbreakers like Galarian Moltres, Tornadus-T, and Mega Charizard Y are great partners to deal with the aforementioned physical walls Landorus-T draws in. Thundurus-T relieves pressure from Landorus-T by acting as a secondary Electric immunity and is a great asset against the Water and Flying teams Landorus-T can't do much to. Mega Aerodactyl is able to form a powerful revenge killing core alongside Landorus-T while providing Stealth Rock support for it to clean teams more easily. Corviknight switches into most Ice-type attacks aimed at Landorus-T, removes Stealth Rock with Defog, and is able to bring Landorus-T safely onto the field via its slow U-turn.</p>"
      },
      "Bulk Up (Ground)": {"description": "<p>Ferrothorn's Power Whip does not break Substitute at +1 Def or -1 Atk from Intimidate.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Mateeus", "user_id": 321991}], "teams": [{"name": "Flying analysis by", "members": [{"username": "Mateeus", "user_id": 321991}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Kyurem": {
    "sets": {
      "Choice Specs (Dragon)": {
        "description": "<p>Choice Specs Kyurem is a terrifying wallbreaker with an impeccable STAB combination and coverage movepool, beating threats to Dragon teams like Toxapex, Dragonite, and Mamoswine. Draco Meteor is Kyurem's most powerful move, notably wearing down typical switch-ins like Mega Sableye and Volcarona. Freeze-Dry is highly effective in the Water matchup by answering would-be checks like Swampert, Gastrodon, and Slowking. Focus Blast catches Ferrothorn and Tyranitar off guard should they expect a STAB move, while Earth Power hits Alolan Muk, Galarian Slowking, and Heatran for more damage. Mega Altaria is heavily appreciated as an answer to Dragon-types like Kommo-o, Roaring Moon, and Walking Wake. Garchomp provides entry hazards like Stealth Rock and Spikes to ease Kyurem's wallbreaking. Latias checks Fighting-types such as Iron Hands, Galarian Zapdos, and Terrakion, is able to replenish Kyurem's health with Healing Wish, and removes troublesome entry hazards—especially Stealth Rock, given Kyurem's Rock weakness—with Defog. Dragalge sets up Toxic Spikes and checks Fairy-types like Tapu Koko and Clefable. Kommo-o checks Steel-types like Heatran and defensive Celesteela and blocks attempts to set hazards with Taunt.</p>"
      },
      "Substitute + Roost (Ice)": {
        "description": "<p>Kyurem is a stellar stallbreaker for Ice teams by utilizing Pressure, Substitute, and Roost to beat or force out walls such as Toxapex, Ferrothorn, and Mega Sableye. Kyurem's good bulk and typing also allow it to function as a defensive pivot, consistently checking threats like Heatran, Rotom-W, and Rillaboom. Moreover, it shrugs a hit from and beats the likes of Galarian Zapdos and Urshifu-R one-on-one if using a Chople Berry. Freeze-Dry lands a strong hit on Water-types like Toxapex and Gastrodon, turning Kyurem into a valuable asset in that matchup. Alongside it, Earth Power grants Kyurem near-perfect neutral coverage by nailing Steel- and Fire-types such as Magnezone and Skeledirge. The given EV spread allows Kyurem's Substitute to live one Seismic Toss from Blissey. Alolan Ninetales provides Snow and Aurora Veil support, bolstering Kyurem's defensive utility while preventing Celesteela and Heatran from breaking its Substitute. Defensive Cloyster is able to remove entry hazards with Rapid Spin, set up Spikes to help Kyurem stallbreak more easily, and switch into physical Steel-type attacks from Mega Scizor and Melmetal. Similarly, Piloswine lays down Stealth Rock and deals with Fire- and Rock-types that Kyurem loses to, such as Volcarona and Mega Diancie. Setup sweepers like Swords Dance Weavile and Shell Smash Cloyster greatly appreciate Kyurem wearing down walls so they can clean up late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}, {"username": "Mateeus", "user_id": 321991}], "teams": [{"name": "Dragon analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Ice analysis by", "members": [{"username": "Mateeus", "user_id": 321991}]}, {"name": "Quality check by", "members": [{"username": "Mateeus", "user_id": 321991}, {"username": "CrossHeart", "user_id": 593863}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar check by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Greninja": {"sets": {"Choice Scarf (Water)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Diggersby": {"sets": {"Swords Dance (Normal)": {}, "Choice Band (Normal)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Klefki": {
    "sets": {
      "Screen Setter (Fairy)": {
        "description": "<p>Klefki is the ideal dual screens setter on Fairy due to its Steel typing, which negates Poison-type attacks from Nihilego and Alolan Muk and ability to fend off threats like Mega Scizor with Foul Play. Klefki is a better option than Grimmsnarl due to its typing and ability to set up Spikes, which, like its screens, go up quickly with Prankster. This support allows for Pokemon like Tapu Bulu and Azumarill from setting up and sweeping, teams. Foul Play prevents Pokemon like Mega Scizor and Mimikyu to set up and sweep while Thunder Wave cripples foes and allows Mega Diancie to outspeed threats such as +1 Mega Charizard X and Nihilego, which will normally beat Klefki one on one. Setting up Spikes creates solid chip damage on Alolan Muk and Gholdengo, allowing for late-game sweeping from its teammates Iron Valiant and Choice Scarf Tapu Lele. Mega Diancie punishes opponents trying to set up entry hazards against Klefki and beats Fire-types such as Heatran and Mega Charizard Y. Tapu Bulu helps Klefki with Grassy Terrain, which halves the damage it takes from Earthquake, making Pokemon such as Iron Treads and Mamoswine not hit as hard.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Don Bork", "user_id": 623713}], "teams": [{"name": "Type analysis by", "members": [{"username": "Don Bork", "user_id": 623713}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Mateeus", "user_id": 321991}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Diancie": {
    "sets": {
      "Mixed Wallbreaker (Rock)": {
        "description": "<p>Mega Diancie is the ideal Mega Evolution for Rock teams due to its ability to check Dragon-types like Kommo-o, punish passive Pokemon and entry hazard setters such as Toxapex and Klefki with Magic Bounce, and be a mixed wallbreaker that threatens Great Tusk and Galarian Slowking. Diamond Storm does considerable damage to special walls like Blissey and Alolan Muk and can also provide a Defense boost. Psychic heavily damages Mega Venusaur, Toxapex, and Nidoking, which eases the matchup against Poison teams. Earth Power deals heavy damage to Steel-type Pokemon like Heatran and Iron Treads and is paired nicely with Mystical Fire to damage Skarmory and Corviknight. On a hyper offensive team, Mega Diancie runs four attacks for coverage. With Shuckle's Sticky Web up, its good Speed tier becomes more devastating and outspeeds Pokemon like Mega Gallade and Zeraora. Mega Diancie also pairs well with Omastar and Terrakion, as Omastar takes care of the Ground matchup with a well-timed Shell Smash, while Terrakion's access to Earthquake and Close Combat takes care of most Steel-types. On bulky offense, Mega Diancie prefers to run Spikes, as the chip damage sets up a potential late-game cleanup from more offensive Pokemon on the team like Terrakion and Nihilego. Garganacl pairs well with Spikes, as Salt Cure forces a lot of Pokemon to switch out and take additional chip damage.</p>"
      },
      "Mixed Wallbreaker (Fairy)": {
        "description": "<p>Mega Diancie is a valuable asset to Fairy teams, featuring Magic Bounce to deflect entry hazards and status, wide coverage, and strong offensive capabilities with its high Speed. Diamond Storm often increases Mega Diancie's bulk and threatens foes like Enamorus and Mega Charizard Y. Moonblast handles threats like Mega Sableye and Latias. Earth Power can be used to counter Steel teams, OHKOing Heatran, Excadrill, and Magnezone, while dealing heavy damage to the likes of Skeledirge and Garganacl. Mystical Fire targets Steel-types that don't mind Earth Power, such as Ferrothorn, Celesteela, and Mega Scizor under Psychic Terrain. Alternatively, Mega Diancie can run Nature Power and use the various terrains set by its teammates to expand its wallbreaking abilities. Stealth Rock can be used to allow Mega Diancie to set its own hazard, but four attacks are recommended given Mega Diancie's wide coverage. Klefki provides Spikes and dual screens support which allows Mega Diancie to OHKO threats like Gholdengo, and it can also carry Thunder Wave to let Mega Diancie outspeed and take out threats like Mega Gallade and Mega Aerodactyl. Tapu Koko takes on Water-types and aids in the Steel matchup by forcing out Corviknight and Celesteela. Tapu Bulu counters Ground- and Water-types like Great Tusk and Urshifu-R, while Tapu Lele takes on Poison-types and prevents priority moves from Azumarill and Mega Scizor. Iron Valiant is a great partner for the Steel matchup, but it also benefits from Tapu Koko's Electric Terrain to outspeed and take out faster threats such as Zeraora and Greninja. All of these teammates appreciate Mega Diancie's ability to bounce hazards back to the opponent, as Fairy teams do not possess entry hazard removal.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Don Bork", "user_id": 623713}, {"username": "Swiffix", "user_id": 547532}], "teams": [{"name": "Rock analysis by", "members": [{"username": "Don Bork", "user_id": 623713}]}, {"name": "Fairy analysis by", "members": [{"username": "Swiffix", "user_id": 547532}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}, {"username": "maroon", "user_id": 305839}, {"username": "Giyu", "user_id": 574288}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Diancie-Mega": {"credits": {"writtenBy": [{"username": "Don Bork", "user_id": 623713}, {"username": "Swiffix", "user_id": 547532}], "teams": [{"name": "Rock analysis by", "members": [{"username": "Don Bork", "user_id": 623713}]}, {"name": "Fairy analysis by", "members": [{"username": "Swiffix", "user_id": 547532}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}, {"username": "maroon", "user_id": 305839}, {"username": "Giyu", "user_id": 574288}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}, {"username": "Adeleine", "user_id": 517429}]}]}},
  "Toxapex": {
    "sets": {
      "Physically Defensive (Water)": {
        "description": "<p>Toxapex is an incredible asset to Water teams due to its great defensive profile and wide range of utility options. Scald burns physical attackers such as Dragonite and Mega Lopunny, as well as Garchomp and Mega Gallade attempting to switch in. Poison Jab threatens Fairy- and Grass-types like Tapu Bulu, Iron Valiant, and Rillaboom. Toxic Spikes enhances offensive teammates such as Barraskewda, Mega Swampert, and Greninja, while Toxic lessens Toxapex's passivity, putting Gastrodon, Tornadus-T, and Mega Altaria on a timer. Haze allows Toxapex to shut down setup sweepers like Mega Scizor, Mimikyu, and Mega Altaria. Knock Off bothers item-reliant walls such as Porygon2, Galarian Corsola, and Celesteela. Black Sludge allows Toxapex to outlast tankier foes with the help of chip damage from Toxic Spikes and Toxic, while Heavy-Duty Boots enables it as a pivot, letting it sponge attacks without worrying about entry hazards. Teammates appreciate Toxapex absorbing Toxic Spikes and fighting off Grass-types like Meowscarada and Breloom. Toxapex appreciates Slowking and Rotom-W taking Psychic- and Ground-type moves, respectively. Mega Swampert switches into Electric-types like Tapu Koko, Zapdos, and Magnezone and threatens Poison-types like opposing Toxapex, Clodsire, and Nidoking. Gastrodon forms a great defensive core with Toxapex, taking on the aforementioned Electric-types and providing entry hazards to further chip down pivots such as Meowscarada, Mega Lopunny, and Iron Moth. Greninja checks Ground-types like Clodsire, Garchomp, and Landorus and aids in the Flying matchup. Urshifu-R checks Pokemon like Kyurem and Hydreigon, which take advantage of Toxapex. Pelipper provides a Ground immunity against Landorus-T, Iron Treads, and Great Tusk and synergizes well with Toxapex against Grass teams.</p>"
      },
      "Z-Haze (Poison)": {
        "description": "<p>Toxapex is a main-stay on Poison teams due to its defensive typing, impeccable ability, ridiculous bulk, and utility moves like Toxic, Knock Off, and Haze. Scald allows Toxapex to spread burns on physical attackers such as Landorus-T, Dragonite, and Mega Scizor. Toxic puts threats like Rotom-W, Baxcalibur, and Urshifu-R on a timer and spreads chip damage on offensive teams like Dragon, Psychic, and Fire. Knock Off is another great option to bother Pokemon like Galarian Corsola and Celesteela. Haze, paired with Icium Z, shuts down setup sweepers like Z-Happy Hour Jirachi and Clangorous Soulblaze Kommo-o, immediately regaining its health to continue walling them. Toxic Spikes are an option instead of Toxic or Knock Off; however, Toxapex has other teammates capable of setting them up and it increases Toxapex's passivity. The given EV spread avoids an OHKO from +1 SpA Jirachi's Psychic, allowing Toxapex to activate its Z-Crystal. Mega Venusaur and Crobat are excellent teammates due to their Ground-type neutrality and immunity, respectively, checking Landorus-T, Great Tusk, and Mamoswine, while the former also threatens Ferrothorn with Hidden Power Fire. Due to Toxapex's Psychic-type weakness, Alolan Muk and Galarian Slowking are notable teammates, checking Tapu Lele, Deoxys-S, and Latias; Galarian Slowking, in particular, forms a very strong Regenerator core with Toxapex. Clodsire and Nidoking patch up Toxapex's Electric-type weakness, and Nidoking specifically threatens Steel teams with its wide array of coverage. Galarian Weezing provides another Ground-type immunity and removes entry hazards with Defog as well as serving as a concrete answer to Baxcalibur. Sneasler appreciates Toxapex's ability to chip down foes, offering more opportunities for setup. Iron Moth threatens Steel-types like Celesteela, Ferrothorn, and Gholdengo, which are otherwise difficult to break for Poison teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Water analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Poison analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Swiffix", "user_id": 547532}, {"username": "Bka Onon", "user_id": 532439}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Araquanid": {"sets": {"Sticky Web (Bug)": {"description": "<p>Outspeeds Celesteela. Waterium Z in conjunction with Liquidation nabs a 2HKO on Celesteela, while also ensuring an OHKO Mega Charizard-X.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Mimikyu": {
    "sets": {
      "Swords Dance (Ghost)": {
        "description": "<p>Mimikyu is an outstanding asset to Ghost teams, boasting both a valuable part-Fairy typing and a unique ability that complements revenge killing and late-game cleaning. Play Rough hits threatening Dark- and Dragon-types like Galarian Moltres, Mandibuzz, and Kommo-o. Shadow Claw notably allows Mimikyu to threaten Psychic teams even under Psychic Terrain, while Drain Punch deals more damage to Steel-types such as Iron Treads, Magnezone, and Excadrill and can mitigate Life Orb recoil. Shadow Sneak enables Mimikyu to revenge kill weakened foes and pick off faster threats like Blacephalon, Gengar, and Victini. Disguise almost always allows Mimikyu to set up a Swords Dance or revenge kill faster foes that Shadow Sneak cannot deal enough damage to. Mega Sableye is heavily appreciated due to its ability Magic Bounce, which adds to Mimikyu's longevity by bouncing back entry hazards and status moves aimed at it. Wallbreakers like Gholdengo wear down bulkier teams by checking walls such as Corviknight, Mega Venusaur, and Toxapex, which lets Mimikyu have an easier time cleaning up late-game. Blacephalon and Skeledirge threaten the Steel-types Mimikyu struggles against, like Ferrothorn, Corviknight, and Mega Scizor. They can also cripple troublesome walls such as Toxapex and Gastrodon with Trick and Will-O-Wisp, respectively. Hisuian Zoroark is deeply valued for its Ghost-type immunity, as it can catch Gholdengo and Gengar off guard.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Ghost analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Mateeus", "user_id": 321991}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Kommo-o": {
    "sets": {
      "Setup Sweeper (Fighting)": {
        "description": "<p>An incredible asset for Fighting teams, Kommo-o is often the best wincon on the type thanks to Clangorous Soulblaze, which helps it overcome otherwise difficult matchups such as Dragon, Flying, and Water. Flamethrower takes care of Steel-type Pokemon neutral to Drain Punch like Mega Scizor and Corviknight. Taunt allows Kommo-o to block status moves from defensive Pokemon like Toxapex, Swampert, and Gliscor, preventing them from resetting its boosts with Haze or statusing it with Toxic. Alternatively, Clangorous Soul powers up Kommo-o without using its Z-Move, letting its Clangorous Soulblaze outright OHKO Toxapex and Hippowdon, at the cost of longevity. Bulletproof is Kommo-o's preferred ability to better handle Gholdengo or Aegislash in the Steel matchup. Unboosted Kommo-o's average Speed tier leaves it outsped by threats to Fighting teams like Tornadus-T and Tapu Lele, so Choice Scarf users like Galarian Zapdos and Terrakion are great partners to assist it against them. Iron Valiant's Fairy typing and wide coverage movepool lets it deal with opposing Dragon-types, and it forms a wallbreaking core with Kommo-o by pressuring the likes of Mega Sableye and Ting-Lu. Cobalion and Great Tusk provide Stealth Rock, which maximizes Kommo-o's opportunities to wallbreak after using Clangorous Soulblaze. Great Tusk can also remove entry hazards for Kommo-o with Rapid Spin, and Cobalion has the added bonus of checking Fairy-types like Mega Diancie. Mega Gallade can pressure Poison-, Ground-, and Flying-types like Toxapex, Ting-Lu, and Landorus-T for Kommo-o. It can also outspeed and revenge kill offensive threats to it like Kyurem and Garchomp.</p>"
      },
      "Mixed Omni-Boost Sweeper (Dragon)": {
        "description": "<p>Kommo-o is an exceptional setup sweeper due to its great mixed offensive stats, respectable defenses, and exclusive access to Clangorous Soulblaze; this makes it an amazing tool to clean up Steel, Dark, and Dragon teams late-game. Drain Punch threatens Steel- and Normal-types like Heatran, Blissey, and Porygon-2 as well as increasing Kommo-o's longevity, making it harder for revenge killers to shut it down after using its Z-Move. Additionally, Drain Punch is Kommo-o's best move to hit Ditto, as it copies its ability Soundproof. Flamethrower targets Fighting-resistant or -immune Steel-types such as Mega Scizor, Celesteela, and Aegislash. Taunt is preferred to shut down phazers like Haze Toxapex and Hippowdon and bulky walls like Porygon2 and Clodsire, which can inconvenience Kommo-o with Toxic. Meanwhile, Clangorous Soul allows for more boosts and breaking power, notably enabling Clangorous Soulblaze to OHKO the aforementioned Hippowdon and Toxapex. Furthermore, Clangorous Soulblaze allows Kommo-o to set up on Fairy-types and Soundproof Pokemon like Alolan Ninetales, Trace Porygon2, and opposing Kommo-o. Soundproof prevents revenge killing attempts from Ditto or opposing Kommo-o, and a Naive nature permits Kommo-o to outpace Mega Aerodactyl, Mega Lopunny, and Zeraora after obtaining the omni-boost. Mega Altaria is a wonderful teammate, as it helps weaken and clean up opposing Dragon teams; In return, it appreciates Kommo-o dealing with the aforementioned Steel-types. Kyurem aids in matchups against Flying-types like Tornadus-T, Mantine, and Dragonite, as well as Fairy-types such as Azumarill, Tapu Fini, and Mega Altaria. Choice Scarf Latias and Roaring Moon provide speed control; the former offers healing and setup opportunities with Healing Wish, while the latter checks Psychic-types like Deoxys-S, Victini, and Latias. Garchomp offers entry hazards support to pressure and chip down Kommo-o's switch-ins and aids in the Steel matchup with Earthquake. Hisuian Goodra is a huge help in the Fairy matchup, taking on Tapu Lele, Iron Valiant, and Mega Diancie. Mega Latios threatens Flying-type threats with its BoltBeam coverage; in addition, when paired with Garchomp, it puts a lot of pressure on Poison teams, which Kommo-o tends to struggle against. Cyclizar provides entry hazard control with Rapid Spin and extra protection for Kommo-o with Shed Tail, encouraging the use of Clangorous Soul over Taunt. Baxcalibur is excellent in the Dark and Flying matchups, dispatching threats like Choice Scarf Meowscarada and Enamorus with its Swords Dance or Dragon Dance set, and it also ravages Poison teams with Galarian Slowking, which Kommo-o might not be able to handle. In return, Kommo-o removes the aforementioned Steel- and Normal-types that can easily wall Baxcalibur or use it to reverse sweep, specifically Ditto.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "TTK", "user_id": 307004}, {"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Fighting analysis by", "members": [{"username": "TTK", "user_id": 307004}]}, {"name": "Quality checked by", "members": [{"username": "Mateeus", "user_id": 321991}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}, {"name": "Dragon analysis", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "Swiffix", "user_id": 547532}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar check by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Tapu Koko": {
    "sets": {
      "Choice Specs (Electric)": {
        "description": "<p>Tapu Koko is a dominant force within Electric teams due to its exceptional ability, Electric Surge, which its teammates benefit from. Tapu Koko further boasts a good Speed tier and valuable Fairy-typing, rendering it a menacing threat in its own right. Dazzling Gleam levels the playing field in the Dragon matchup, eliminating foes such as Kommo-o, Roaring Moon, Baxcalibur, and Mega Altaria, but it's also useful against threats like Mega Lopunny and non-Choice Scarf Great Tusk. Grass Knot provides much needed coverage against troublesome Ground-types, most notably taking care of Swampert, Quagsire, Gastrodon, and Mamoswine. Volt Switch pairs wells with Tapu Koko's speed, allowing it to escape unfavorable matchups and bring in teammates like Zapdos against the likes of Mega Venusaur or Mega Scizor. Hidden Power Ice can be used to deal with Ground-types that aren't threatened by Grass Knot such as Garchomp and Landorus-T. Alternatively, Thunderbolt can be run to increase Tapu Koko's damage output, giving it a chance to OHKO foes like Mega Diancie. Rotom-W and Zapdos are excellent partners to Tapu Koko, as they provide a necessary Ground immunity as well as Defog support, which allows Tapu Koko to pivot more freely. Rotom-W further helps by handling Ground-types and spreading burns to strong physical attackers like Mega Garchomp, Iron Valiant, Dragonite, and Mega Swampert in rain, while Zapdos walls and makes use of Heat Wave to deal with Steel-types like Ferrothorn and Iron Treads and Hurricane to counter pesky Grass- and Fighting-types like Tapu Bulu, Mega Venusaur, and Mega Gallade. Alolan Raichu's Surge Surfer fully capitalizes on Electric Terrain, turning it into a serious revenge killer, capable of outspeeding threats such as Sand Rush Excadrill, Mega Aerodactyl, and Iron Valiant under Quark Drive. Iron Hands and Zeraora are prominent partners for Tapu Koko complementing it as Physical breakers, both being able to take care of foes such as defensive Zapdos, Ursaluna and Alolan Muk which hinder Tapu Koko and other Special attackers. Iron Hands has more bulk and longevity, but Zeraora brings near unmatched Speed to the table. Both of them also appreciate Tapu Koko's ability to remove Mega Sableye and Skeledirge and luring in and critically damaging Landorus-Therian with Hidden Power Ice. Regieleki brings raw Electric-type power in the form of a boosted Rising Voltage, which is capable of sweeping teams that don't have an answer to it, and it also provides hazard removal thanks to Rapid Spin. Magnezone provides an immunity to Poison, which Tapu Koko appreciates, and more importantly traps and removes threats such as Mega Scizor and Excadrill with Hidden Power Fire.</p>"
      },
      "Pivot (Fairy)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Swiffix", "user_id": 547532}], "teams": [{"name": "Electric analysis by", "members": [{"username": "Swiffix", "user_id": 547532}]}, {"name": "Quality check by", "members": [{"username": "Giyu", "user_id": 574288}, {"username": "Bka Onon", "user_id": 532439}]}, {"name": "Grammar check by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Tapu Lele": {
    "sets": {
      "Choice Scarf (Psychic)": {
        "description": "<p>Choice Scarf Tapu Lele is one of Psychic teams' greatest revenge killers. Its decent Speed tier and astounding offensive prowess combined with its great typing makes it extremely threatening because with access to STAB Moonblast, it is Psychic's best check to most Dark-type threats. Tapu Lele's presence also sets up Psychic Terrain, shielding itself and its team from dangerous priority such as Mimikyu's Shadow Sneak and Mega Scizor's Bullet Punch. Focus Blast lets it easily take care of the pesky Steel-types that resist its STAB attacks such as Ferrothorn, Heatran, and Iron Treads. Future Sight lets Tapu Lele set up an attack for later and then switch out to a teammate such as Victini or Mega Gallade to help it set up or get a KO. Shadow Ball lets it beat Gholdengo and clean up against Psychic and Ghost teams, while Thunderbolt gives it general coverage versus foes like Mantine and Celesteela. Tapu Lele is often not able to beat specially defensive walls such as Alolan Muk and Blissey; hence, it appreciates partnering up with Mega Gallade to eliminate them. Mega Alakazam is a good partner, as it helps in the Electric and Water matchups courtesy of Trace copying Surge Surfer and Swift Swim, respectively, and it appreciates Tapu Lele's Psychic Terrain boosting its Expanding Force. Slowbro sponges hits from faster Choice Scarf users such as Terrakion and Galarian Zapdos, and can also pivot Tapu Lele in with Teleport to wreak havoc. Victini and Armarouge can eliminate Steel-types, especially Aegislash and Gholdengo, easing the burden for Tapu Lele. Jirachi can slow teams down with Thunder Wave and pivot Tapu Lele into physical walls such as Mandibuzz and Slowbro with U-turn.</p>"
      },
      "Choice Specs (Fairy)": {},
      "Calm Mind (Fairy)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned</p>"}
    },
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}], "teams": [{"name": "Psychic analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Tapu Bulu": {
    "sets": {
      "Swords Dance (Fairy)": {
        "description": "<p>Tapu Bulu is a fearsome wallbreaker, boasting synergistic coverage moves that help Fairy teams in a variety of matchups like Water, Poison, and Ground. Close Combat targets Steel-types like Heatran and Ferrothorn. Should Fightinium Z be used, All-Out Pummeling heavily damages the likes of Celesteela and Corviknight after a Swords Dance boost. High Horsepower heavily damages Aegislash and Gholdengo and lets Tapu Bulu be a massive asset against Steel and Water teams by hitting Toxapex for heavy damage. Substitute allows Tapu Bulu to set up on passive Pokemon such as Toxapex, Swampert, and Mega Sableye, while Zen Headbutt is its best move against Mega Venusaur and Crobat. Klefki is a great teammate, as it sets up Spikes to ease Tapu Bulu's wallbreaking as well as Reflect and Light Screen to provide more setup opportunities. Mega Diancie threatens Flying- and Fire-types like Zapdos, Dragonite, and Volcarona for Tapu Bulu. In return, Tapu Bulu checks Gastrodon, Heatran, and Clodsire, letting Mega Diancie have more leeway on its moveset. Similarly, Tapu Koko is heavily appreciated, as it also deals with Flying-types like Tornadus-T and Mega Charizard Y and relieves Tapu Bulu of having to use Fightinium Z, or waste its Z-Move, to threaten Corviknight and Celesteela.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Fairy analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "Mateeus", "user_id": 321991}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar check by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Nihilego": {"sets": {"Choice Item User (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Meteor Beam (Rock)": {"description": "<p>The EV Spread lets Nihilego obtain a Speed-boosting Beast Boost.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Buzzwole": {"sets": {"Choice Scarf (Bug)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Celesteela": {
    "sets": {
      "Physically Defensive (Flying)": {"description": "<p>Avoids the 2HKO from Choice Specs Greninja's Ice Beam.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Mixed Wall (Steel)": {
        "description": "<p>Boasting incredible defensive stats, an assortment of utility options, and a wonderful typing, Celesteela cements itself as a staple on Steel teams, easing the Ground and Fairy matchups as well as forcing progress against opposing Steel teams due to Flamethrower and Leech Seed. Flamethrower targets Steel-types that resist Heavy Slam such as Corviknight, Iron Treads, and Mega Scizor, while Air Slash threatens Fighting-types like Mega Gallade, Great Tusk, and Kommo-o. Alternatively, Toxic may be used to put bulkier Pokemon such as Ting-Lu and Gastrodon on a timer, however, without Flamethrower, Celesteela is extremely passive in front of the aforementioned Steel-types, as well as Ferrothorn and Gholdengo which are immune to Leech Seed. Giga Drain is another option to improve the Water and Ground matchups, hitting Gastrodon, Mega Swampert, and Slowbro as well as improving longevity, however, it's a lot more matchup reliant than the other listed options. Protect in conjunction with Leech Seed is Celesteela's main method of forcing progress, spreading chip damage while also massively boosting its longevity. The given EV spread allows Celesteela to survive two consecutive uses of Close Combat from the likes of Mega Lopunny in addition to Choice Scarf Buzzwole and Terrakion. Heatran is by far Celesteela's most advantageous teammate due to its immunity to Fire-type moves letting it take on threats such as Volcarona and Blacephalon. In return, Celesteela walls Ground-types like Clodsire and Hippowdon. Ferrothorn is an essential teammate due to its ability to check Water-types such as Barraskewda, Mega Swampert, and Rotom-W as well as provide utility in the form of entry hazards and additional Leech Seed support, wearing down teams greatly. Furthermore, Ferrothorn is a great answer to Electric-type Pokemon like Tapu Koko, Rotom-W, and Alolan Raichu. Ghost-type teammates such as Aegislash and Gholdengo alleviate the Fighting matchup, lessening the amount of pressure put onto Celesteela as a primary switch-in and also removing threats like Skeledirge, Slowbro, and Toxapex. Choice Scarf Iron Treads and Excadrill provide an immunity against the aforementioned Electric-type Pokemon, while the former checks Landorus with Ice Spinner and the latter hinders Mega Sableye with Toxic. Furthermore, Excadrill and Iron Treads are Steel's best answers to Ogerpon-H. Mega Scizor is a great pivot into Knock Off and can take on Fighting-types due to its neutrality to them and access to Roost. Assault Vest Melmetal is a great blanket check to special attackers like Tapu Koko, Kyurem, and Gholdengo, while Hisuian Goodra is an excellent sponge for Water-type attacks, walling Volcanion, Choice Specs Pelipper, and Basculegion-F.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Steel analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Bka Onon", "user_id": 532439}]}, {"name": "Grammar check by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Blacephalon": {
    "sets": {
      "Choice Scarf (Fire)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Choice Scarf (Ghost)": {
        "description": "<p>Boasting an astonishing Special Attack stat, great Speed tier, and deadly STAB combination, Blacephalon is an esteemed revenge killer on Ghost teams, easily cleaning through weakened Steel, Fairy, and Flying teams due to Beast Boost. Fire Blast provides more power to OHKO foes like Tapu Koko and Great Tusk at the cost of lowered accuracy. Hidden Power Ice targets Ground- and Dragon-types that aren't threatened by Blacephalon's STAB combination such as Garchomp, Landorus-T, and Dragonite. Alternatively, Blacephalon may use Psyshock to break through Clodsire, Kommo-o, and Nihilego. Trick immobilizes switch-ins like Alolan Muk, Iron Hands, and Blissey but can also be used on the aforementioned targets of Psyshock. With a Choice Scarf, Blacephalon manages to outpace Weavile, Choice Scarf Landorus-T, and Tapu Koko, allowing it to revenge kill them. Mimikyu is a great wallbreaker, capable of weakening Dark, Fighting, and Dragon teams, setting Blacephalon up for success late-game. Mega Sableye prevents the setting of Stealth Rock, allowing Blacephalon to pivot freely. Gholdengo threatens Fairy-type Pokemon like Mega Diancie and Clefable and takes advantage of passive Blacephalon switch-ins like Toxapex and Blissey. Hisuian Zoroark's immunity to Ghost-type moves is heavily appreciated, and it lures in Dark-types such as Hydreigon, Mega Tyranitar, and Ting-Lu with Illusion, hitting them with Focus Blast. Furthermore, Hisuian Zoroark can bluff other Blacephalon switch-ins—such as Heatran and Toxapex—to eliminate them, easing Blacephalon's job later into the match. Froslass and Galarian Corsola offer entry hazards to wear down Blacephalon's switch-ins and spread status ailments to ease Blacephalon's sweeping.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Giyu", "user_id": 574288}], "teams": [{"name": "Ghost analysis by", "members": [{"username": "Giyu", "user_id": 574288}]}, {"name": "Quality check by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar check by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Zeraora": {"sets": {"Choice Band (Electric)": {}, "Bulk Up (Electric)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Rillaboom": {"sets": {"Choice Band": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Cinderace": {"sets": {"Swords Dance (Fire)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned</p>"}}},
  "Barraskewda": {
    "sets": {
      "Rain Sweeper": {
        "description": "<p>Barraskewda functions as one of the best sweepers on rain Water teams, in part thanks to its high Speed tier, which is increased further under rain due to its ability Swift Swim, allowing it to outspeed the entire tier, as well as its strong coverage options to threaten Water-resistant Pokemon. Liquidation is Barraskewda's strongest spammable STAB option, which under rain 2HKOes Water-resistant targets like Kommo-o after hazard support and OHKOes neutral targets like Iron Valiant and Gholdengo. Flip Turn allows Barraskewda to pivot out of Pokemon like Corviknight and Rotom-W, which are not OHKOed by rain-boosted(AH) Liquidation, while still dealing respectable damage and maintaining momentum to get in its teammates to deal with these Pokemon. Close Combat is the strongest coverage move that Barraskewda has access to and it most notably threatens Ferrothorn, which is able to take Liquidation from Barraskewda. Psychic Fangs in conjunction with an Adamant nature lets Barraskewda 2HKO Mega Venusaur and Toxapex, and its secondary effect of destroying dual screens, while situational, is useful in the Fairy matchup. Crunch is an alternative option to let Barraskewda target Psychic-types like Latios, Mega Latias, and Slowbro, which are able to switch into Liquidation. Poison Jab is also an option to target specifically Tapu Bulu and Azumarill, which resist Liquidation and Close Combat. Barraskewda can run a Jolly nature in order to outspeed base 130 Speed Pokemon outside of rain, in particular Tapu Koko, while also being faster than Mega Lopunny, whereas an Adamant nature can also be run to achieve the aforementioned results with Psychic Fangs. Pelipper is a mandatory partner of Barraskewda, as it not only sets rain but also offers a slow U-turn as a form of pivoting, which lets Barraskewda get on the field safely, and its ability to threaten opposing Grass teams with Hurricane helps Barraskewda get past Pokemon like Mega Venusaur. Mega Swampert can form a potent Swift Swim offensive core with Barraskewda, with its superior bulk and defensive typing allowing it to stay in on certain Pokemon like Baxcalibur to achieve the 2HKO with Earthquake. Swampert also works well with Barraskewda, offering hazard support in Stealth Rock to weaken opposing Pokemon so Barraskewda can secure KOs. It also provides slow pivoting with Flip Turn, and its Ground typing is a must to stave off opposing Electric-types like Regieleki, which are faster than Barraskewda outside of rain. Toxapex is also a strong defensive teammate for Barraskewda, being able to cripple Barraskewda's checks with Toxic and also handle setup sweepers like Mega Altaria and Mega Scizor with Haze. Greninja is able to break past physically defensive walls like opposing Toxapex, Mega Scizor,(AC) and Mega Venusaur, which are reliable answers to Barraskewda, while Greninja appreciates Barraskewda being able to handle specially defensive walls like Blissey and Ting-Lu. Furthermore, Greninja offers Spikes support, which also assists Barraskewda in wallbreaking more efficiently.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Wrriten by", "members": [{"username": "TTK", "user_id": 307004}]}, {"name": "Water analysis by", "members": [{"username": "TTK", "user_id": 307004}]}, {"name": "Quality check by", "members": [{"username": "Swiffix", "user_id": 547532}, {"username": "Neko", "user_id": 542526}]}, {"name": "Grammar check by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Urshifu-Rapid-Strike": {"sets": {"Choice Band (Water)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Kleavor": {
    "sets": {
      "Choice Scarf (Bug)": {
        "description": "<p>Choice Scarf Kleavor is one of the best answers to Flying- and Fire-types, like Tornadus-T, Mega Charizard-Y, and Skeledirge, for Bug teams, thanks to its Sharpness-boosted Stone Axe, which has the added utility of automatically setting Stealth Rock. Close Combat synergizes well with Kleavor's STAB moves, crushing Steel-types like Iron Treads. U-turn allows Kleavor to pivot out of Great Tusk and Skarmory to bring in teammates like Araquanid or Volcarona. Night Slash banishes Ghost-types like Gholdengo, Knock Off softens walls like Corviknight and Porygon2 for its teammates, and X-Scissor takes down Slowbro to make way for Mega Pinsir. Araquanid and Galvantula are excellent teammates, as these set up Sticky Web to patch up Kleavor's unassuming speed, even when using a Choice Scarf, allowing it to outspeed Choice Scarf Blacephalon. Additionally, they also help in dealing with pesky Fire- and Flying-types like Volcarona and Landorus, respectively. Physical setup sweepers benefit from Kleavor's ability to set hazards offensively, Knock Off items from walls, and deal with Skeledirge and Slowbro, which often wall Mega Pinsir, Scizor, and Mega Scizor. In return, they deal with Fighting- and Fairy-types like Great Tusk and Mega Diancie. Quiver Dance Volcarona appreciates Skeledirge removed, as this lets it clean up Ghost teams at +1; it can also be brought in against passive walls like Slowbro and Skarmory. Forretress provides Rapid Spin and loves Kleavor's ability to set Stealth Rock, as this allows it to run other hazards like Toxic Spikes or Volt Switch to better support the team. Lokix provides great offensive support with its access to priority in First Impression and Sucker Punch to finish off teams weakened by Kleavor through entry hazards and repeated Knock Offs. It is also a secondary check to Skeledirge, which Bug teams appreciate.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Neko", "user_id": 542526}], "teams": [{"name": "Bug analysis by", "members": [{"username": "Neko", "user_id": 542526}]}, {"name": "Quality checked by", "members": [{"username": "Bka Onon", "user_id": 532439}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Sneasler": {
    "sets": {
      "Choice Scarf (Fighting)": {
        "description": "<p>Choice Scarf Sneasler is an extremely fast revenge killer that decimates Choice Scarf Tapu Lele, Quark Drive-boosted Iron Valiant, and Adamant Sand Rush Excadrill for Fighting teams. Close Combat and Dire Claw have near-perfect synergy, aside from Dire Claw's ability to punish passive answers—like Toxapex and Slowbro—that swap into its STAB moves. U-turn pivots Sneasler out of switch-ins such as Skeledirge, Aegislash, and Gliscor, bringing in Choice Specs Iron Valiant and Mega Gallade. Switcheroo further punishes walls like Corviknight if the extra speed is unneeded. Alternatively, Rock Slide lets it revenge kill Quiver Dance Volcarona, freeing up a moveslot on Iron Hands, while Toxic Spikes greatly pressure Fairy teams wary of Dire Claw. Night Slash can also be the final move for Sneasler, as it notably hits Gholdengo and Aegislash, but pivoting out of these threats is usually the better option. Choice Scarf Sneasler is a late-game cleaner, so wallbreakers and setup sweepers such as the aforementioned Kommo-o and Mega Gallade are appreciated, as these deal with Corviknight, Gliscor, and Toxapex. Kommo-o also benefits from Sneasler dealing with Fairy-types, as this allows Kommo-o to use Clangorous Soulblaze. Choice Specs Iron Valiant loves being pivoted in safely against physical walls like Skeledirge and Mega Sableye, which wall Sneasler. Assault Vest Iron Hands is a soft check against Gholdengo and Volcarona and can pivot Sneasler in against walls, which it can inconvenience. Hisuian Lilligant and Breloom deal with Gastrodon and Quagsire and also ease the Water and Ground matchups. As with the other setup sweepers, these also love the setup opportunities Sneasler opens up by being able to punish walls with Dire Claw's additional effects or with Switcheroo. Entry hazard support from Cobalion and Great Tusk is also appreciated, and these provide a secondary answer to Mimikyu and Zeraora, respectively. These teammates also appreciate Sneasler's ability to remove Toxic Spikes, greatly easing the matchup against Water and Poison teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Neko", "user_id": 542526}], "teams": [{"name": "Fighting analysis by", "members": [{"username": "Neko", "user_id": 542526}]}, {"name": "Quality checked by", "members": [{"username": "Swiffix", "user_id": 547532}, {"username": "Bka Onon", "user_id": 532439}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Enamorus": {"sets": {"Choice Scarf (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}]}]}},
  "Meowscarada": {
    "sets": {
      "Choice Scarf (Dark)": {
        "description": "<p>Thanks to its fantastic movepool and Protean, Choice Scarf Meowscarada is the best revenge killer available for Dark teams, outrunning the likes of Regieleki, Speed-boosted Kommo-o, and Mega Swampert under rain. Flower Trick is Meowscarada's most powerful move, picking off weakened foes such as Tapu Lele and Terrakion. Play Rough is essential, as it deals with many threats to Dark teams like Galarian Zapdos, Mega Gallade, and Iron Valiant. U-turn allows Meowscarada to switch out of unfavorable situations, pivoting into powerful teammates such as Galarian Moltres and Mega Tyranitar while keeping momentum for the team. Knock Off cripples defensive switch-ins—such as Toxapex, Ferrothorn, and Clefable—as well as offensive Pokemon like Zeraora and Iron Treads. Toxic Spikes can be run instead to better pressure Normal, Fairy, and Fighting teams. Meowscarada's teammates appreciate its ability to check a myriad of threats as well as its revenge killing capabilities. Wallbreakers like Galarian Moltres and Hydreigon are great partners to deal with physical walls like Celesteela and Mega Venusaur. Ting-Lu and Tyranitar provide entry hazard support for Meowscarada—ensuring it is able to net more KO's—and are great defensive pivots for it to fall back upon. Similarly, Mega Sableye provides a Fighting immunity, bounces back status moves, and prevents entry hazards from going up, letting Meowscarada switch in unscathed.</p>"
      },
      "Choice Scarf (Grass)": {
        "description": "<p>Meowscarada is an excellent choice for Grass teams thanks to its high Speed and Protean, enabling it to be a threatening revenge killer that can outspeed common threats such as Choice Scarf Iron Valiant and Gholdengo. Flower Trick is Meowscarada's best STAB option and is capable of dealing with weakened Pokemon like Clodsire and Spectrier. Flower Trick's guaranteed critical hit is also very useful in the Fairy matchup and lets Meowscarada revenge kill Azumarill and a weakened Tapu Lele behind Reflect. U-turn allows Meowscarada to maintain an advantage against its defensive checks like Corviknight by being able to pivot into its teammates like Scovillain. Knock Off is a tool to cripple Meowscarada's defensive switch-ins like Toxapex and Klefki in addition to the aforementioned Corviknight. Play Rough is a strong coverage option to threaten opposing Dragon-type Pokemon like Kommo-o, Kyurem, and Latios, which Grass teams tend to struggle against. Low Kick is a less frequent option but lets Meowscarada OHKO Bisharp while threatening Heatran with a 2HKO; however, Play Rough is preferred to have an easier time against Dragon teams. Meowscarada has an easier time revenge killing foes with entry hazard support from Ferrothorn and Cradily. Ferrothorn appreciates Meowscarada's ability to check Fighting-types like Mega Gallade, Iron Valiant and Galarian Zapdos with STAB Play Rough. Hisuian Lilligant is also a fantastic offensive partner for Meowscarada. It is able to check the Flying-types that switch into Meowscarada like Celesteela and Landorus-T while also assisting in the Dragon matchup, outspeeding common Pokemon like Garchomp and Dragonite. Hisuian Lilligant also makes the Steel matchup easier for Grass; its ability to threaten Heatran is appreciated by Meowscarada, while Meowscarada can threaten Gholdengo with Knock Off, which Lilligant cannot beat. Mega Venusaur is also a mandatory defensive partner for Meowscarada; its Bug neutrality and bulk allows it to act as a consistent check to Mega Scizor, which easily switches into any move of Meowscarada, and Venusaur is able to check it with Hidden Power Fire. Mega Venusaur also checks opposing Fairy-types for Meowscarada like Tapu Koko, Mega Diancie, and Iron Valiant, while Meowscarada is able to threaten the Psychic-types that force out Mega Venusaur such as Latios, Mega Alakazam, and Victini. Whismicott is one of the best hazard removal options on Grass, and Meowscarada appreciates not having Stealth Rock and Spikes chip it down, because it comes in often to threaten a KO. Whimsicott's Fairy typing also allows Meowscarada and its teammates not to be overwhelmed by Dragon-types like Garchomp, and it can encore Calm Mind Mega Latias. Celebi with Nasty Plot and Groundium Z can break defensive Steel-types like Heatran and Hisuian Goodra while also being able to threaten opposing Poison-types like Alolan Muk and Toxapex.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Illecent Excaliburn", "user_id": 475589}, {"username": "TTK", "user_id": 307004}], "teams": [{"name": "Dark analysis by", "members": [{"username": "Illecent Excaliburn", "user_id": 475589}]}, {"name": "Grass analysis by", "members": [{"username": "TTK", "user_id": 307004}]}, {"name": "Quality checked by", "members": [{"username": "Neko", "user_id": 542526}, {"username": "Giyu", "user_id": 574288}, {"username": "Mateeus", "user_id": 321991}, {"username": "Bka Onon", "user_id": 532439}, {"username": "Swiffix", "user_id": 547532}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Skeledirge": {"sets": {"Physically Defensive (Ghost)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Garganacl": {"sets": {"Iron Defense": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Cyclizar": {"sets": {"Shed Tail (Dragon)": {"description": "<p>164 Atk Evs lets it OHKO Mega Diancie with Iron Head.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}]}]}},
  "Glimmora": {"sets": {"Entry Hazard Support (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Clodsire": {"sets": {"Specially Defensive (Ground)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Specially Defensive (Poison)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Great Tusk": {"sets": {"Utility (Fighting)": {}, "Choiced Attacker (Fighting)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Bulk Up (Ground)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Iron Treads": {"sets": {"Choice Scarf (Ground)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Iron Hands": {"sets": {"Assault Vest (Electric)": {"description": "<p>Survives Dragonite's +2 Earthquake and is not 2HKO'ed by Mega Charizard-Y. Outspeeds Blissey and OHKO's Garchomp with Ice Punch under Electric terrain.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Gholdengo": {"sets": {"Choiced Attacker (Ghost)": {}, "Nasty Plot (Ghost)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Ting-Lu": {"sets": {"Mixed Wall (Dark)": {"description": "<p>Not 2HKO'ed by Choice Scarf Tapu Lele and OHKO'es it back with Heavy Slam.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Physically Defensive (Ground)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Roaring Moon": {"sets": {"Choice Scarf (Dragon)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Iron Valiant": {
    "sets": {
      "Swords Dance (Fairy)": {
        "description": "<p>Iron Valiant's combination of stats, typing, and coverage makes it an excellent wallbreaker for Fairy teams, capable of outrunning Mega Diancie, Nihilego, and Iron Treads. At +2 Attack, All-Out Pummeling OHKOes troublesome walls such as physically defensive Celesteela and Corviknight. Spirit Break notably breaks Mega Sableye, enabling Iron Valiant to greatly pressure Dark and Ghost teams. Knock Off deals with Ghost-types like Gholdengo and Aegislash, allowing Iron Valiant to heavily dent Steel. It also removes important items from Clodsire, Klefki, and Toxapex. Shadow Sneak can be used over Knock Off to pick off weakened foes like Blacephalon. Iron Valiant loves Klefki's ability to set dual screens and Spikes, as this allows Iron Valiant to set up more easily and deal with bulkier cores better. Tapu Lele sets Psychic Terrain, neutralizing Mega Scizor's Bullet Punch, and it also deals with Poison-types Iron Valiant has a hard time with, such as Mega Venusaur and Toxapex. Tapu Koko's Electric Terrain activates Iron Valiant's Quark Drive, letting it outspeed the likes of Mega Lopunny and Mega Swampert under rain. Tapu Bulu improves the Water and Ground matchups and removes bulky Water-types like Toxapex and Dondozo. Mega Diancie and Azumarill love Iron Valiant's ability to soften walls, as it allows them to clean up late-game.</p>"
      },
      "Choice Scarf (Fighting)": {
        "description": "<p>Iron Valiant is one of Fighting teams' best assets with amazing qualities between its typing, Speed, and offenses. Choice Scarf accentuates its Speed further and lets it outspeed many threats to Fighting teams such as Tornadus-T, Tapu Koko, and Choice Scarf users such as Tapu Lele and Galarian Zapdos. Its STAB Moonblast is one of its best qualities, being able to easily beat Mega Sableye and OHKO most opposing Fighting- and Dragon-types such as Buzzwole and Mega Altaria. Thunderbolt is great coverage to hit Flying- and Water-types like Tornadus-T and Toxapex that otherwise wall Iron Valiant, while Energy Ball lets it deal with Mega Swampert, which it can outspeed even under rain, Rotom-W, and Gastrodon more easily. Shadow Ball prevents Iron Valiant from being walled by Gholdengo, Skeledirge, and Aegislash while also improving the Psychic matchup. Knock Off and Trick cripple defensive switch-ins such as Toxapex, Celesteela, and Clodsire by removing or replacing important items and forcing them to go without passive recovery or be Choice locked. Iron Valiant is also a great asset in the Fairy and Electric matchups, as it uses opposing Tapu Koko's Electric Surge to activate its own Quark Drive and outspeed even Regieleki and Alolan Raichu under Electric Terrain. Iron Valiant appreciates support from Mega Gallade, as it easily takes care of Poison-types like Clodsire, Mega Venusaur, and Alolan Muk. Iron Hands and Great Tusk are great teammates for the Electric matchup while also beating the likes of Toxapex, Galarian Moltres, and Gholdengo. Cobalion and Great Tusk can set up Stealth Rock and even clear entry hazards in the case of the latter. Cobalion also helps against Fairy-types such as Tapu Bulu and Tapu Lele, while Great Tusk helps deal with Tapu Koko and Assault Vest Iron Hands. Choice Band Urshifu-R is a great ally to beat Fire-types such as Volcarona and Skeledirge and Ground-types such as Landorus-T and Excadrill. Kommo-o deals with bulky Water-, Fire-, and Grass-types like Toxapex, Skeledirge, and Mega Venusaur with its massive Clangorus Soulblaze in conjunction with Taunt. Breloom is also a natural counter to Water-types, being able to deal with Swampert, and hindering defensive walls such as Toxapex with Spore. Galarian Zapdos is another great teammate that can weaken foes and safely get in Iron Valiant with U-turn.</p>"
      },
      "Bolt-Beam Swords Dance (Fairy)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"username": "Bka Onon", "user_id": 532439}], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Fairy analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Fighting analysis by", "members": [{"username": "Bka Onon", "user_id": 532439}]}, {"name": "Quality checked by", "members": [{"username": "Mateeus", "user_id": 321991}, {"username": "Neko", "user_id": 542526}, {"username": "CrossHeart", "user_id": 593863}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Sulo", "user_id": 528036}, {"username": "Lumii", "user_id": 493772}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Ogerpon-Wellspring": {"sets": {"Swords Dance (Water)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}]}]}},
  "Ogerpon-Hearthflame": {"sets": {"Swords Dance (Grass)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Swords Dance (Fire)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}]}]}},
  "Ogerpon-Cornerstone": {"sets": {"Swords Dance (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set by", "members": [{"username": "Bka Onon", "user_id": 532439}]}]}}
}