{
  "Charizard": {"sets": {"Sun Attacker": {"description": "<ul> <li>The set shown above is a standard set.</li> <li>An alternative EV spread of 192 HP / 28 SpA / 36 SpD / 252 Spe (Modest Nature) survives Thunderclap from Raging Bolt. Another alternative EV spread of 148 HP / 84 Def / 24 SpA / 252 Spe (Modest Nature) survives Double-Edge from Mega Salamence. Both EV spreads outspeed Glimmora.</li> </ul>"}}},
  "Kangaskhan": {"sets": {"Seismic Toss": {"description": "<ul> <li>The given EV spread allows Mega Kangaskhan to survive two Sacred Sword from Chien-Pao when there is Grassy Terrain recovery and outspeed Scarfed Chi-Yu during Tailwind.</li> </ul>"}, "Setup Attacker": {"description": "<ul> <li>The set shown above is a standard set.</li> </ul>"}}},
  "Dragonite": {"sets": {"Choice Band": {}}},
  "Gardevoir": {"sets": {"Special Attacker": {"description": "<ul> <li>The given EV spread allows Mega Gardevoir to survive Shadow Ball from Flutter mane while still able to outspeed scarfed Chi-Yu during Tailwind, allocating the remaining EVs into Special Attack.</li> <li>Psyshock will deal greater damage to Flutter Mane, but Expanding Force is preferred if Indeedee-F or Tapu Lele is on the same team for Psychic Terrain.</li> </ul>"}}},
  "Salamence": {"sets": {"Mixed Attacker": {"description": "<ul> <li>The given EV spread allows Mega Salamence to 2HKO Iron Hands with Double Edge while maximizing its Speed, allocating the remaining EVs into Special Attack.</li> </ul>"}, "Setup Attacker": {"description": "<ul> <li>The given EV spread allows Mega Salamence to survive Dazzling Gleam from a terastallized Flutter Mane while still outspeeding Glimmora.</li> </ul>"}}},
  "Jirachi": {"sets": {"Follow Me Support": {"description": "<ul> <li>The given EV spread survives Spectral Thief from Marshadow, allocating the remaining EVs into Special Defense.</li> <li>Jirachi has numerous support moves, and its last two move slots should be selected to best support the player's team.</li> </ul>"}}},
  "Deoxys-Attack": {"sets": {"Expanding Force": {}}},
  "Heatran": {"sets": {"Bulky, Special Attacker": {"description": "<ul> <li>The given EV spread allows Heatran to outspeed Chien-Pao and Flutter Mane during Tailwind while maximizing its Special Attack, allocating the remaining EVs into HP.</li> </ul>"}}},
  "Amoonguss": {"sets": {"Redirection Support": {"description": "<ul> <li>The given EV spread allows Amoonguss to survive a Heat Wave from Mega Charizard Y, allocating the remaining EVs into Defense.</li> <li>An alternative EV spread of 240 HP / 208 Def / 60 SpD allows Amoonguss to survive an Icicle Crash from Chien-Pao.</li> </ul>"}}},
  "Tornadus": {"sets": {"Tailwind Setter": {"description": "<ul> <li>The set shown above is a standard set.</li> <li>An alternative EV spread of 248 HP / 244 Def / 16 SpA (Bold Nature) survives 3 hits of Icicle Spear (Adamant Nature) from Kyurem-Black.</li> </ul>"}}},
  "Landorus": {"sets": {"Special Attacker": {}}},
  "Kyurem-Black": {"sets": {"Setup Attacker": {"description": "<ul> <li>The given EV spread allows Kyurem-Black to survive two Seismic Toss from Mega Kangaskhan and maximize its Speed which will outspeed Zeraora after a Dragon Dance. The remaining EVs are invested into its Attack.</li> </ul>"}}},
  "Diancie": {"sets": {"Trick Room Setter": {"description": "<ul> <li>The given EV spread allows Diancie to survive Steam Eruption from Volcanion and Ivy Cudgel from Ogerpon-Wellspring.</li> <li>An alternative EV set of 204 HP / 144 Atk / 160 Spe (Adamant Nature) allows Diancie to outspeed Tornadus during Tailwind and lose no Attack power, allocating the remaining EVs to HP.</li> </ul>"}}},
  "Incineroar": {"sets": {"Fake Out Support": {"description": "<ul> <li>The given EV spread allows Incineroar to survive a Drain Punch from Iron Hands after receiving damage from Stealth Rocks and outspeed Ogerpon during Tailwind. The remaining EVs are allocated to Attack.</li> <li>When Darkinium Z is used with Parting Shot, the Pokemon that is sent out has its HP fully restored.</li> </ul>"}}},
  "Tapu Fini": {"sets": {"Calm Mind": {}, "Choice Specs": {"description": "<ul> <li>The given EV spread allows Tapu Fini to survive Wild Charge from Iron Hands and outspeed Deoxys-A during Tailwind, allocating the remaining EVs to Special Attack.</li> </ul>"}}},
  "Marshadow": {"sets": {"Physical Attacker": {}}},
  "Rillaboom": {"sets": {"Assault Vest": {"description": "<ul> <li>The given EV spread allows Rillaboom to survive a Heat Wave from Mega Charizard Y or an Icicle Crash from Chien-Pao. The given EV spread also allows Rillaboom to outspeed Deoxys-A during Tailwind, allocating the remaining EVs in Attack.</li> </ul>"}}},
  "Indeedee-F": {"sets": {"Terrain Setter": {"description": "<ul> <li>The EV spread allows a terastallized Indeedee-F to OHKO Flutter Mane with Psyshock as long as Flutter Mane has no bulk investment, allocating the remaining EVs to HP and Defense.</li> </ul>"}}},
  "Dracovish": {"sets": {"Sand Rush": {}, "Strong Jaw": {}}},
  "Ursaluna-Bloodmoon": {"sets": {"Trick Room Attacker": {}}},
  "Glimmora": {"sets": {"Hazard Setter": {}, "Meteor Beam": {}}},
  "Flutter Mane": {"sets": {"Choice Specs": {"description": "<ul> <li>The given EV spread allows Flutter Mane survive a Sucker Punch from Kingambit, outspeed Tapu Koko, and OHKO Tapu Koko with Moonblast.</li> </ul>"}, "Glass Cannon": {}}},
  "Iron Hands": {"sets": {"Fake Out Attacker": {}, "Setup Attacker": {"description": "<ul> <li>The given EV spread provides Iron Hands just enough Attack power to OHKO Mega Salamence with no bulk investment and outspeed Landorus-I during Tailwind.</li> </ul>"}}},
  "Chien-Pao": {"sets": {"Physical Attacker": {}}},
  "Chi-Yu": {"sets": {"Choice Attacker": {}}},
  "Archaludon": {"sets": {"Assault Vest": {}}}
}