{
  "Iron Moth": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Astrolotl and Ceruledge</strong>: Specially defensive Astrolotl is Iron Moth's most common counter, stomaching even its sun-boosted Choice Specs Tera Fire Overheat and threatening to KO it back with Stomping Tantrum. In combination with a Poison-resistant Pokemon like Venomicon, Iron Moth can cede crucial momentum, providing the opponent with an opportunity for a comeback. Flash Fire Ceruledge is Iron Moth's hardest counter, being immune to Overheat and Fiery Dance,  resistant to Solar Beam and Sludge Wave, and able to strike back with a boosted Shadow Sneak. However, Iron Moth can run Tera Ground + Tera Blast specifically to circumvent these counters.</p> <p><strong>Stealth Rock</strong>: Stealth Rock wears down Iron Moth exceptionally quickly. This is particularly notable with its Choice Specs set, which needs to switch out often to reset Overheat's Special Attack drops.</p> <p><strong>Priority</strong>: Sucker Punch Kingambit and Extreme Speed Dragonite can prey on Iron Moth's weak physical defense. Kingambit must be wary of Tera Fairy Iron Moth, however.</p> <p><strong>Faster Foes</strong>: Roaring Moon, Cinderace, Meowscarada, Greninja, and Psyshock Iron Valiant can pick off Iron Moth before it can respond.</p> <p><strong>Special Tanks</strong>: Clodsire, Skeledirge, Arghonaut, and Ting-Lu can easily tank most moves from Booster Energy Iron Moth, but they are 2HKOed by its sun-boosted Choice Specs Overheat with any prior damage or if it Terastallizes.</p> <p><strong>Rain Teams</strong>: Pelipper can override Jumbao's sun with rain, which weakens Iron Moth's best attacks. Floatzel and Quaquaval hit Iron Moth's weak physical defense.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h1>Set Details</h1> <p>Choice Specs Iron Moth is the strongest wallbreaker available for sun teams. Its Tera Fire Overheat under sun can 2HKO Arghonaut and Skeledirge, two of the best special walls in the metagame, and still deal massive damage to frailer targets at -2. Solar Beam more reliably 2HKOes Arghonaut, Toxapex, and Garganacl so that Iron Moth isn't required to Terastallize to be effective. Fiery Dance lets Iron Moth snowball and end games once the opposing team has no remaining Unaware users and is sufficiently weakened. Sludge Wave 2HKOes Astrolotl and Dragonite and OHKOes Cinderace outside of sun, which could otherwise tank an Overheat and pivot around the weakened hit. Ground-type Tera Blast OHKOes Ceruledge, Astrolotl, Skeledirge, and opposing Iron Moth with a surprise hit.</p> <p>Drought Jumbao is a required teammate to set up sun. Healing Wish can help Iron Moth offset Stealth Rock damage and get into battle late-game. Other Protosynthesis users like Roaring Moon and Great Tusk fit fantastically alongside Iron Moth. Roaring Moon's Choice Band-boosted attacks complement Iron Moth's strong special attacks, and its U-turn can bring Iron Moth in safely against a Fairy- or Steel-type switch-in. Great Tusk can remove entry hazards and switch into strong physical attackers like Roaring Moon and Kingambit. In return, Iron Moth very easily switches into Jumbao, one of Great Tusk's hard counters. Eject Button Hatterene is a fantastic teammate that helps keep Stealth Rock off the field and give Iron Moth a crucial free switch.</p>"
      },
      "Booster Energy": {
        "description": "<h1>Set Details</h1> <p>Booster Energy Iron Moth fits best on hyper offense teams where Booster Energy's one-time use can be easily justified. Although it faces some competition  from Quiver Dance Volcarona, its instant power and higher natural Speed tier gives it a niche over Volcarona. Fiery Dance allows Iron Moth to snowball quickly, while Sludge Wave forces Arghonaut and Garganacl to think twice before Terastallizing into a Fairy-type. Energy Ball 2HKOes Arghonaut, Krilowatt, and Garganacl, but Psychic maintains coverage against Arghonaut while pressuring Venomicon, Dragapult, and Clodsire harder. Ground-type Tera Blast allows Iron Moth to push past Skeledirge, Astrolotl, Clodsire, and Ceruledge, which would otherwise give it serious trouble. Dazzling Gleam is best when Iron Moth is Tera Fairy, hitting Roaring Moon and Dragapult more effectively. Tera Fairy allows Iron Moth to stomach Roaring Moon's STAB moves and Kingambit's Sucker Punch, removing them for a surprise KO. Agility helps Iron Moth sweep better, but it displaces a coverage move and is generally outclassed by Volcarona as a setup sweeper. Tera Grass is the best option, turning Iron Moth's severe Ground weakness into a resistance and boosting Energy Ball. An EV spread of 124 Def / 132 SpA / 252 Spe can be used so that Booster Energy raises Iron Moth's Speed, but the drop in power is noticeable. Booster Energy Iron Moth can also fit on sun teams to thwart typical counterplay to its Choice Specs set. Solar Beam should be run to OHKO specially defensive Garganacl at +1 and with Quark Drive active. However, Choice Specs is usually more effective against unprepared teams.</p> <p>Iron Moth fits excellently on hyper offense teams. Entry hazard setters like Meowscarada, Greninja, and Garchomp enable Iron Moth to net KOs more easily. Rapid Spin users like Caribolt and Great Tusk remove Stealth Rock to help Iron Moth leverage its good special bulk. Other hyper offense sweepers like Dragon Dance Roaring Moon, Swords Dance Iron Valiant, Dragon Dance Dragonite, and Scale Shot + Swords Dance Miasmaw tend to struggle with Jumbao, which Iron Moth can help deal with. Supreme Overlord Kingambit can clean up games after Iron Moth has broken holes and fainted.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "snake", "user_id": 227784}], "teams": [{"name": "Quality checked by", "members": [{"username": "spoo", "user_id": 251944}, {"username": "Lasen", "user_id": 273339}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Syclant": {"sets": {"Offensive Pivot": {}}},
  "Revenankh": {"sets": {"Bulk Up": {}}},
  "Pyroak": {"sets": {"Contrary Tank": {}}},
  "Fidgit": {"sets": {"Persistent": {}}},
  "Stratagem": {"sets": {"Meteor Beam": {}}},
  "Arghonaut": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Fairy-types</strong>: Common Fairy-types such as Jumbao and Iron Valiant take a pittance from Arghonaut's attacks and can break through it easily with their STAB moves. Hatterene deserves a special mention, as it can bounce back Arghonaut's Spikes with Magic Bounce. However, Tera Fairy Arghonaut can wall most Iron Valiant sets and phazes it.</p> <p><strong>Poison-types</strong>: Venomicon, Toxapex, and Amoonguss wall Arghonaut with ease and threaten it out with Hurricane or Sludge Bomb. Venomicon-E and Plasmanta can both hit Arghonaut super effectively before and after Terastallizing thanks to their STAB combinations; the former can also absorb Knock Off.</p> <p><strong>Powerful Wallbreakers</strong>: Strong wallbreakers such as Choice Band Great Tusk, Breloom, and Iron Moth are capable of 2HKOing Arghonaut even after it Terastallizes. Meowscarada and Krilowatt deal significant damage to Arghonaut before it Terastallizes, but Arghonaut has little to fear from them after Terastallizing. Furthermore, Krilowatt must be careful when switching in, since it is heavily crippled by Knock Off.</p> <p><strong>Miasmaw</strong>: Miasmaw ignores Unaware thanks to Neutralizing Gas, making it extremely difficult for Arghonaut to handle. After a Swords Dance, Miasmaw can easily 2HKO Arghonaut with Scale Shot or Gunk Shot and OHKO Tera Fairy Arghonaut with the latter move. However, Miasmaw dislikes being phazed due to its Stealth Rock weakness.</p> <p><strong>Status</strong>: Toxic from Pokemon such as Clodsire and Snaelstrom puts Arghonaut on a timer, greatly reducing its ability to stay in and wall powerful threats. On the other hand, burn from threats such as Astrolotl, Rotom-W, and Dragapult makes Arghonaut significantly more passive, reducing its ability to pressure resilient threats such as Gholdengo.</p>",
    "sets": {
      "Unaware Wall": {
        "description": "<h1>Set Details</h1> <p>Great mixed bulk and Unaware make Arghonaut one of the metagame's most formidable walls, capable of taking on threats such as Gholdengo, Volcarona, Stratagem, and Kingambit. Additionally, Arghonaut's ability to force switches and strong matchup into Equilibra make it an excellent user of Spikes. Circle Throw phazes common setup sweepers such as Dragonite and Baxcalibur and whittles down the opposing team in conjunction with Spikes. Knock Off is Arghonaut's best way to force progress against walls such as Garganacl and Venomicon and deals heavy damage to Ghost-types trying to switch into Circle Throw such as Dragapult and Gholdengo. Leftovers provides Arghonaut with extra longevity and makes it less reliant on Recover, while Covert Cloak shields it from chip damage from Salt Cure and other bothersome secondary effects such as Special Defense drops from Shadow Ball. The given EVs allow Arghonaut to avoid the 2HKO from Baxcalibur's Glaive Rush and from Krilowatt's Tera Water Surf. Tera Fairy flips many of Arghonaut's bad matchups, letting it check a wide array of threats including Venomicon lacking Sludge Bomb, Krilowatt, Iron Valiant, and Dragapult.</p> <p>Arghonaut fits mostly on balance and stall teams that appreciate its ability to blanket check various offensive threats and force progress with Knock Off and Spikes. Stealth Rock setters such as Venomicon, Garganacl, and Ting-Lu are strong partners that can stack entry hazards with Arghonaut. Venomicon additionally handles threats to Arghonaut such as offensive Great Tusk, Meowscarada, and Iron Valiant, while Garganacl appreciates Arghonaut removing Covert Cloak from opposing Arghonaut and Gholdengo. Ground-types such as Equilibra, Great Tusk, and Garchomp can deal with Electric- and Poison-types such as Iron Hands and Toxapex, while in return Arghonaut can switch into Greninja lacking Grass Knot. Skeledirge forms a formidable Unaware core with Arghonaut, taking on Jumbao, Venomicon, and Iron Valiant while Arghonaut covers it against threats like Snaelstrom, Garganacl, and Choice Band Roaring Moon. Bulky setup sweepers such as Naviathan, Ceruledge, and Hatterene take advantage of Arghonaut whittling down their checks with Spikes and Knock Off over the course of the game.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "quziel", "user_id": 297859}, {"username": "Da Pizza Man", "user_id": 221710}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Kitsunoh": {"sets": {"Utility": {}}},
  "Cyclohm": {"sets": {"Physically Defensive": {}}},
  "Colossoil": {"sets": {"Flame Orb": {}}},
  "Krilowatt": {"sets": {"Offensive Pivot": {}}},
  "Voodoom": {"sets": {"Choice Specs Pivot": {}}},
  "Tomohawk": {"sets": {"Physical Wall": {}, "HazeHawk": {}}},
  "Necturna": {"sets": {"Shell Smash": {}}},
  "Mollux": {"sets": {"Utility Wall": {}}},
  "Aurumoth": {"sets": {"Nasty Plot": {}}},
  "Malaconda": {"sets": {"Drought": {}}},
  "Cawmodore": {"sets": {"Belly Drum": {}}},
  "Volkraken": {"sets": {"Choiced Wallbreaker": {}}},
  "Plasmanta": {"sets": {"Rain Wallbreaker": {}}},
  "Naviathan": {"sets": {"Dragon Dance": {}}},
  "Crucibelle": {"sets": {"Utility Pivot": {}}},
  "Kerfluffle": {"sets": {"Valiant At Home": {}}},
  "Pajantom": {"sets": {"Choice Band": {}}},
  "Jumbao": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Fire-types</strong>: Jumbao has nothing in its arsenal to meaningfully damage Fire-types such as Skeledirge, Volcarona, Iron Moth, and Ceruledge, all of which can take advantage of it by setting up or firing off a powerful attack. While Cinderace has to be more wary of repeated hits, it can switch into Jumbao at least once with relative impunity and force it out.</p> <p><strong>Poison-types</strong>: Amoonguss switches into Jumbao relatively well and can use Spore as it is forced out but must watch out for Tera Blast Fire. Toxapex, Clodsire, and Venomicon can wall Jumbao and use it as an opportunity to set entry hazards or force progress with Toxic or Knock Off. Venomicon-E outspeeds Jumbao and can take at least one hit and OHKO back with Gunk Shot or Brave Bird.</p> <p><strong>Steel-types</strong>: Steel-types such as Corviknight, Gholdengo, and Bulletproof Equilibra can wall and KO Jumbao with their STAB attacks, but they take significant damage from Tera Blast Fire if Jumbao Terastallizes.</p> <p><strong>Faster Pokemon</strong>: If Jumbao does not hold a Choice Scarf, it is vulnerable to faster attackers with super effective coverage such as Greninja, Dragapult, and Stratagem.</p>",
    "sets": {
      "Drought Wallbreaker": {
        "description": "<h1>Set Details</h1> <p>Jumbao is one of the best Pokemon in the metagame thanks to its excellent offensive stats, defensive utility, and incredible ability in Drought, which enables a host of powerful offensive partners. Tera Blast Fire pressures the Steel- and Poison-types that resist Jumbao's STAB combination, such as Gholdengo, Corviknight, and Venomicon. Alternatively, if Jumbao is paired with teammates that rely on Terastallizing, Focus Blast can be used to retain the OHKO on Kingambit. Synthesis lets Jumbao continuously keep sun up with Heat Rock and outlast Pokemon such as Great Tusk and Roaring Moon. Tera Fire allows Jumbao to take advantage of Tera Blast Fire's coverage and improves its matchup against Steel-types such as Scizor and Gholdengo by removing its Steel weakness.</p> <p>Jumbao can fit comfortably on a variety of playstyles from bulky offense to balance thanks to the team support it provides through Drought. Fire-types such as Skeledirge, Cinderace, Ceruledge, and Iron Moth and Protosynthesis users such as Roaring Moon, Sandy Shocks, and Great Tusk are Jumbao's best offensive partners, as they all become extremely dangerous under sun. Since Jumbao is incredibly vulnerable to opposing Fire-types, defensive Pokemon that can handle them, such as Toxapex, Arghonaut, Ting-Lu, and Garganacl, are excellent partners. The latter three can also set entry hazards to help Jumbao wallbreak, while Toxapex can handle opposing Jumbao and Glimmora. Toxapex and Hatterene can create momentum for sun teams with Eject Button, the latter of which also keeps entry hazards off the field for Fire-type teammates. Bulky Steel-types such as Corviknight and Equilibra can check Poison-types that Jumbao struggles to break such as Amoonguss and Venomicon and appreciate Jumbao handling their checks, such as Krilowatt and Great Tusk.</p>"
      },
      "Choice Scarf": {
        "description": "<h1>Set Details</h1> <p>Choice Scarf Jumbao picks off normally faster threats such as Dragapult, Iron Valiant, and Krilowatt and supports offensive teammates with Healing Wish. Drought allows Jumbao to use Solar Beam quicker and provide sun support for teammates such as Great Tusk and Cinderace. Trace, on the other hand, allows Jumbao to copy valuable abilities such as Toxapex's Regenerator and Venomicon-E's Tinted Lens; however, it requires Jumbao to run Leaf Storm to retain a powerful Grass-type STAB move because of Solar Beam's two-turn wait outside of sun. Tera Fire with Tera Blast grants Jumbao coverage to hit Steel-types such as Corviknight and Gholdengo and resistances to key attacks such as Gholdengo's Make It Rain, Iron Valiant's Moonblast, and Baxcalibur's Ice Shard. Focus Blast, on the other hand, lets Jumbao OHKO Kingambit without Terastallizing.</p> <p>Choice Scarf Jumbao is a strong asset to bulky offense teams, providing them with speed control and incredibly useful Healing Wish support. Defensive pivots that lack reliable recovery, such as Great Tusk, Ting-Lu, Equilibra, and Rotom-W, benefit immensely from Jumbao's ability to bring them back to full health late in the game, which gives them the freedom to take more hits early on. These Pokemon can also handle the Steel- and Fire-types that can take Jumbao's STAB attacks, such as Cinderace, Gholdengo, and Iron Moth. Pivots like Rotom-W, Corviknight, and Cinderace can bring Jumbao in safely against Pokemon it threatens, such as Krilowatt and Hydreigon. Bulky setup sweepers such as Hatterene and Kingambit can break down teams for Jumbao to clean late-game and greatly appreciate Jumbao giving them a second chance to sweep with Healing Wish. Poison-types such as Toxapex, Venomicon, and Clodsire wall Jumbao, so wallbreakers that can threaten them, such as Dragapult, Baxcalibur, and Smokomodo, are good teammates. Lastly, if Jumbao opts to use Drought, it can set sun to support Fire-types such as Skeledirge and Iron Moth and Protosynthesis users such as Great Tusk and Roaring Moon.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "Da Pizza Man", "user_id": 221710}]}, {"name": "Grammar checked by", "members": [{"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Caribolt": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Grass-types</strong>: Grass-types like Jumbao, Pyroak, and Amoonguss wall Caribolt's STAB combination, forcing it out.</p> <p><strong>Faster Attackers</strong>: Before Caribolt uses Rapid Spin, Pokemon like Cinderace and Ice Beam Greninja can outspeed and OHKO it. Fast Dragon-types like Dragapult, Roaring Moon, and Astrolotl can switch in to check Caribolt once, but they cannot do so if Caribolt reaches both +1 Speed and +2 Attack.</p> <p><strong>Strong Priority Attacks</strong>: Strong priority attacks from Kingambit, Dragonite, and Revenankh can circumvent Caribolt's Speed boosts and KO it after it has taken some chip damage from Double-Edge.</p>",
    "sets": {
      "talahbolt (Swords Dance)": {
        "description": "<h1>Set Details</h1> <p>Caribolt is a nuclear wallbreaker for offensive teams. Double-Edge with Galvanize can break through even the tier's most stalwart walls, 2HKOing Pokemon like Skeledirge and Garganacl with ease, especially once Caribolt Terastallizes. Horn Leech provides some modicum of recovery to compensate for Double-Edge's recoil. Rapid Spin both increases Caribolt's Speed, giving it sweeping potential, and supports teammates weak to Stealth Rock like Baxcalibur and Iron Moth, allowing them to forego Heavy-Duty Boots. Leftovers helps make up for Double-Edge's recoil alongside Horn Leech, while Magnet powers up Caribolt's Electric-type attacks even further. A Jolly nature is preferred to outspeed Choice Scarf Jumbao at +1 Speed and Krilowatt at +0, but Adamant is an option to deal as much damage as possible, supporting its hyper offense teammates. Tera Grass is an option to turn Ground-types like Equilibra and Great Tusk into setup fodder, but Caribolt's main focus should be on wallbreaking as much as possible for its teammates.</p> <p>Caribolt is best utilized on hyper offense teams, which appreciate its incredible wallbreaking ability. Stealth Rock-weak Pokemon like Iron Moth, Baxcalibur, and Venomicon-E appreciate Caribolt removing the hazard, allowing Iron Moth and Baxcalibur to run more offensive items over Heavy-Duty Boots. Other physical sweepers like Dragon Dance Roaring Moon and Dragonite love Caribolt powering through Unaware walls like Skeledirge and Arghonaut; Roaring Moon pairs particularly well with Caribolt, as it can threaten the Grass-types like Jumbao and Amoonguss that give Caribolt trouble with Tera Flying + Acrobatics. This love is shared by special sweepers like Iron Valiant and Hatterene, which need Skeledirge off the table before attempting a sweep. Caribolt appreciates entry hazards weakening physically bulky Ground-types like Great Tusk and Ting-Lu—which can beat Caribolt if it Terastallizes—into KO range of its attacks, so pairing it with a dedicated lead like Greninja or Meowscarada is suggested.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "dex", "user_id": 277988}], "teams": [{"name": "Quality checked by", "members": [{"username": "snake", "user_id": 227784}, {"username": "spoo", "user_id": 251944}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Smokomodo": {"sets": {"Bone Zone": {}}},
  "Snaelstrom": {"sets": {"Stealth Rock": {}, "Bulky Swords Dance": {}}},
  "Equilibra": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Water-types</strong>: Rotom-W hard counters Equilibra, as it takes negligible damage from any of Equilibra's moves and threatens it with Hydro Pump. Arghonaut similarly brushes off Equilibra's attacks and threatens to cripple it with Knock Off. Greninja and Krilowatt can switch in on Flash Cannon and threaten to deal significant damage to Equilibra, but they are 2HKOed by Earth Power.</p> <p><strong>Bulky Flying-types</strong>: Bulky Flying-types such as Corviknight, Venomicon, and Tomohawk give Equilibra trouble, as they don’t take much damage from Equilibra's moves and force it out with super effective attacks.</p> <p><strong>Ground-types</strong>: Offensive Great Tusk sets OHKO Equilibra with Close Combat, while defensive sets can either deal significant damage with Body Press or cripple it with Knock Off. Other bulky Ground-types such as Ting-Lu and Clodsire are easily capable of dealing with Bulletproof Equilibra, but it has little to fear from them if it forgoes Bulletproof for Levitate.</p> <p><strong>Item Manipulation</strong>: Equilibra heavily relies on the passive recovery granted by Leftovers, so it must be careful when switching in on Pokemon with Knock Off or Trick, such as Iron Treads and Gholdengo, so as not to risk taking a significant blow to its longevity.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<h1>Set Details</h1> <p>Equilibra's solid typing, great stats, and access to Rapid Spin make it one of the premier defensive pivots and entry hazard removers in the metagame. Levitate is the recommended ability, as it drastically improves Equilibra's matchups against opposing Ground-types, such as Clodsire and Garchomp, while also presenting more opportunities to clear entry hazards without worrying about taking Spikes damage. Alternatively, Bulletproof blocks Focus Blast from Pokemon such as Gholdengo and Jumbao and Shadow Ball from Ghost-types such as Dragapult and Hisuian Zoroark. Protect allows Equilibra to scout the foe's moves and get additional healing from Leftovers, while Pain Split gives it an alternative form of recovery, lowering its reliance on Leftovers. Alternatively, Aura Sphere allows Equilibra to beat opposing Levitate Equilibra and improves its matchup against Dark-types such as Roaring Moon and Colossoil. The given EV spread allows Equilibra to avoid an OHKO from Choice Specs Greninja's Hydro Pump, survive the combination of Moonblast into Close Combat from mixed Tera Fairy Iron Valiant, and outspeed Adamant Breloom after getting a Speed boost from Rapid Spin. Tera Water allows Equilibra to tank Fire-type attacks from Pokemon such as Iron Moth, Astrolotl, and Skeledirge. Alternatively, Tera Flying flips Equilibra's matchups against Fighting-types such as Great Tusk and Breloom on their heads while allowing Bulletproof Equilibra to safely stay in against opposing Ground-types.</p> <p>Equilibra struggles against Water- and Flying-types, so Electric-types such as Caribolt, Iron Hands, and Plasmanta make for great partners. Water-types such as Arghonaut and Rotom-W synergize well with Equilibra, since they can switch in on Fire-type attacks aimed at it; they, in turn, appreciate Equilibra's ability to absorb Electric-type attacks and pressure Jumbao, one of their greatest threats. Venomicon is one of the best defensive partners for Equilibra, since it walls many of the Fighting- and Ground-types that Equilibra struggles against such as Great Tusk; in return, Equilibra deals with Pokemon that Venomicon struggles against, such as Stratagem and Hatterene. Equilibra relies heavily on Leftovers for recovery, so it appreciates support from teammates that don't mind taking Knock Off, like Corviknight and Toxapex. Thanks to Equilibra's ability to consistently keep entry hazards off the field, it works well with teammates that are worn down by them, such as Snaelstrom, Iron Moth, and Loaded Dice Baxcalibur.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Da Pizza Man", "user_id": 221710}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "quziel", "user_id": 297859}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Astrolotl": {"sets": {"Offensive Utility": {}}},
  "Miasmaw": {"sets": {"Swords Dance": {}}},
  "Chromera": {"sets": {"Choice Specs": {}}},
  "Venomicon": {"sets": {"Book": {}}},
  "Venomicon-Epilogue": {"sets": {"E-Book": {}, "Stealth Rock Pivot": {}}},
  "Saharaja": {"sets": {"Standard Camel": {}}},
  "Hemogoblin": {"sets": {"Bulk Up": {}}}
}