{
  "Dragonite": {
    "overview": "<ul> <li> <p>Dragonite's great movepool, well-rounded stats, great ability in Inner Focus that makes it immune to Fake Out and Intimidate from Incineroar, and stellar matchups into threats like Urshifu-R, Rillaboom, and Ogerpon-W makes Dragonite a great Pokemon in Regulation F.</p> </li> <li> <p>When holding a Choice Band, Dragonite becomes one of the scariest Pokemon in the metagame for its breaking power. Its best partner, Chien-Pao, supports it with Sword of Ruin and pressures Pokemon that prevent Extreme Speed, such as Indeedee and Flutter Mane. Dragonite and Chien-Pao also are good into Rillaboom and Ogerpon-W, making Dondozo and Tatsugiri, which struggle with these two, great partners as well.</p> </li> <li> <p>Flutter Mane is also a great partner, as it breaks through Iron Hands and Gholdengo for Dragonite, while Dragonite is a great switch into Scarf Urshifu-R and Rillaboom.</p> </li> </ul>",
    "sets": {
      "Choice Band": {
        "description": "<ul> <li> <p>Extreme Speed is a priority move that hits the majority of the metagame for neutral damage, making it ideal to lock into.</p> </li> <li> <p>Aerial Ace allows Dragonite to OHKO Pokemon like Urshifu-R, Rillaboom, and Amoongus without having to be lock into Outrage. Aqua Jet is secondary priority and allows it to double up with its partner on Ghost-types like Flutter Mane, and Ice Spinner allows it to remove Indeedee-F's Psychic Terrain while still having coverage for Pokemon like Rillaboom and Amoongus.</p> </li> <li> <p>Outrage is used as its Dragon-type STAB move and allows it to OHKO almost the entire metagame.</p> </li> <li> <p>Stomping Tantrum gives coverage into Steel-types like Kingambit and Archaludon.</p> </li> <li> <p>The Speed EVs allow Dragonite to outspeed Dragapult in Tailwind, with the remaining EVs maximize its Attack and round out its bulk, allowing it to live attacks such as Choice Specs Flutter Mane's Dazzling Gleam</p> </li> <li> <p>Normal is used as the Tera type, boosting Dragonite's Extreme Speed to stellar levels of power and removing its weaknesses to common Fairy- and Ice-type moves.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Porygon2": {"sets": {"Mixed Support": {}}},
  "Entei": {"sets": {"Choice Band": {}, "Bulky Attacker": {}}},
  "Registeel": {"sets": {"IronPress": {}}},
  "Latias": {
    "overview": "<ul> <li> <p>Latias is an exceptional Tailwind setter thanks to its great bulk, defensive typing, Levitate, and solid Speed. It also checks common threats such as Landorus and Urshifu-R.</p> </li> <li> <p>Assault Vest Kingambit is a great partner, beating most of Latias's counters like Flutter Mane, Gholdengo, and, to an extent, Incineroar. It also makes great use of Tailwind, and Latias beats most of its counters as well.</p> </li> <li> <p>Latias can be very tough to remove especially if it Terastallizes into a Poison-type, which, when combined with Levitate, has only one weakness and many valuable resistances. This becomes extra apparent when using Recover, which lets it clean up late-game when positioned well, especially if Mist Ball gets some Special Attack drops.</p> </li> </ul>",
    "sets": {"Bulky Tailwind Setter": {"description": "<ul> <li> <p>Ice Beam is great coverage in general and very important for OHKOing Landorus, one of Latias's best and most important matchups.</p> </li> <li> <p>Rocky Helmet lets Latias punish common and important moves like Fake Out and U-turn. It also breaks Chien-Pao's Focus Sash if it opts to run Ice Spinner and heavily discourages the prevalent Urshifu-R from attacking it.</p> </li> <li> <p>The Speed EVs allow it to outspeed max Speed Landorus, the Special Attack EVs let it OHKO Urshifu-R and Landorus more consistently, and the rest of the EVs are used to optimize its bulk.</p> </li> <li> <p>Tera Poison, when paired with Levitate, makes Latias very difficult to break, as Psychic-types, besides opposing Latias, are not common, and the Poison typing offers resistances to many relevant offensive types, the most important of which being Fairy, because of Flutter Mane.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "Robbie35646", "user_id": 562330}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sole Survivor", "user_id": 518634}]}, {"name": "Grammar checked by", "members": [{"username": "yoko", "user_id": 617542}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Whimsicott": {"sets": {"Offensive Utility": {}, "Sun Setter": {}}},
  "Amoonguss": {
    "overview": "<ul> <li> <p>Amoonguss excels as a support Pokemon thanks to its great defensive typing and toolkit. Regenerator gives Amoonguss longevity and allows it to constantly answer Urshifu-R, Iron Hands, and Flutter Mane with Rage Powder throughout the game.</p> </li> <li> <p>Amoonguss appreciates Incineroar allowing it to pivot to activate Regenerator, as well as the Intimidate and Fake Out support Incineroar provides after pivoting in. Incineroar also helps Amoonguss by pressuring the powder-immune Grass-types and weakening threats like Chien-Pao and opposing Incineroar, while Amoonguss can keep it healthy through Pollen Puff and protect it from Pokemon like Urshifu-R and Flutter Mane in return.</p> </li> <li> <p>Amoonguss also pairs well with frail offensive Pokemon like Urshifu-R, which threatens problematic Fire-types like Incineroar and Entei. Amoonguss can also protect Urshifu-R from Flutter Mane and Raging Bolt through Rage Powder.</p> </li> <li> <p>Amoonguss struggles against Pokemon like Entei and Chi-Yu, which threaten to OHKO it, as well as Grass-types like Rillaboom or opposing Amoonguss who can ignore it. Ogerpon-W with Follow Me can be an issue because it restricts Amoonguss from putting foes to sleep.</p> </li> </ul>",
    "sets": {
      "Bulky Support": {
        "description": "<ul> <li> <p>Amoonguss can use Spore to disable the majority of the metagame and enable offensive partners in the process. It can also use Pollen Puff to keep its partners healthy as well as pressure Ogerpon-W with super effective chip damage</p> </li> <li> <p>Amoonguss can utilize Sitrus Berry for burst healing and to survive the 2HKO from Choice Specs Flutter Mane's Shadow Ball. It can also opt for Rocky Helmet to punish physical attackers, especially Urshifu-R.</p> </li> <li> <p>The HP EVS optimize Sitrus Berry recovery, and in conjunction with the Defense and Special Defense EVs, it survives the OHKO from Adamant Chien-Pao Ice Spinner and the 2HKO from Gholdengo's Shadow Ball, respectively.</p> </li> <li> <p>Amoonguss makes use of Tera Water, as it synergizes with its original typing while keeping a resistance to Water. This enables it to take on Entei, Chien-Pao, and Incineroar while keeping its role as a consistent Urshifu-R answer. This is great for Amoonguss as many of these Pokemon like to partner together.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sole Survivor", "user_id": 518634}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Volcarona": {
    "overview": "<ul> <li> <p>Volcarona is a great setup Pokemon thanks to the superb Quiver Dance and great stats across the board. Volcarona can consistently set up in front of Rillaboom, Raging Bolt, Gholdengo, and, to an extent, Flutter Mane, thanks to its typing and a relatively fast Quiver Dance.</p> </li> <li> <p>Volcarona appreciates redirection from Ogerpon-W and Amoonguss, Intimidate Pokemon such as Incineroar and Landorus-T, and Fake Out Pokemon like Rillaboom. All of these generate free turns for Volcarona to set up for a sweep. Rillaboom also provides it with Grassy Terrain recovery, which can make Volcarona extremely hard to bring down.</p> </li> <li> <p>Volcarona struggles against Fire-type physical attackers like Incineroar, Entei, and Terastallized Ogerpon-H, which wall it and threaten it for massive damage without the fear of being burned. Urshifu-R and Ogerpon-W also force a Terastallization, though they can be handled if Volcarona sets up enough Quiver Dances.</p> </li> </ul>",
    "sets": {
      "Quiver Dance": {
        "description": "<ul> <li> <p>Volcarona prefers Flamethrower as its Fire-type STAB move for the OHKO on Amoonguss at +1 and the OHKOs on Assault Vest Rillaboom and Kingambit when at +2. Giga Drain is Volcarona's choice of coverage to hit Urshifu-R, as well as the recovery helping it stick on the field longer.</p> </li> <li> <p>Leftovers' recovery is most effective, as Volcarona is intended to stay on the field from start to finish, Giga Drain and common support enables this.</p> </li> <li> <p>The EVs allow Volcarona to survive Ogerpon-W's Ivy Cudgel, and, when Terastallized and at +1 Special Defense, two Special Attack Booster Energy Flutter Mane Dazzling Gleams. The Speed investment allows for Volcarona to outspeed unboosted Iron Bundle after a Quiver Dance, and the remaining EVs are used to maximize damage.</p> </li> <li> <p>Even when boosted, Volcarona will struggle against the aforementioned Fire-types, so Landorus and Urshifu-R make great teammates. Volcarona is a great answer to Flutter Mane and Rillaboom in return.</p> </li> <li> <p>Volcarona runs Tera Dragon, as it synergizes with its original typing. This helps against Urshifu-R and resists both of Ogerpon-W's STAB moves, without bringing weaknesses to the Fire- and Flying-types it already struggles with. Volcarona's Fire typing handles the Fairy- and Ice- weaknesses, making Terastallization all the more safe.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Tornadus": {"sets": {"Offensive Tailwind": {}, "Bulky": {}}},
  "Landorus": {"sets": {"Life Orb": {}}},
  "Landorus-Therian": {
    "overview": "<ul> <li> <p>Historically one of the best physical attackers in VGC, Landorus-T provides damage control in the form of Intimidate while serving as a very effective offensive pivot for balance teams.</p> </li> <li> <p>However, it is currently overshadowed by its Incarnate forme, Landorus, which is able to outdamage Landorus-T, while also facing steep competition from fellow Intimidate user Incineroar. SV also introduced a number of ways to mitigate the effects of Intimidate, further dampening the effectiveness of Landorus-T.</p> </li> <li> <p>Despite these hurdles, Tera Blast finally grants Landorus-T a consistent Flying-type STAB move, allowing it to hit Grass-type checks like Amoonguss, Ogerpon-W and Rillaboom, only missing the OHKO on the former.</p> </li> <li> <p>Equipped with a Choice Scarf for speed control, Landorus-T serves as a consistent check against Electric- and Fire-types. Notable examples include Raging Bolt, Iron Hands, Incineroar, and Entei.</p> </li> <li> <p>Some popular Landorus-T checks include Chien-Pao and Latias, which are able to OHKO it with Ice-type attacks. Ogerpon-W can also force Landorus-T to Terastallize in order to check it, before itself Terastallizing to remove its Flying-type weakness and do huge damage back. This is also true for Urshifu-R.</p> </li> <li> <p>Landorus-T also finds itself struggling to deal enough damage to secure OHKOs against bulkier targets due to its lack of access to strong single target attacks in SV, unlike in previous generations. Chien-Pao is a good partner in this aspect, boosting Landorus-T's damage with its ability, helping to secure OHKOs against Amoonguss and Entei.</p> </li> <li> <p>Other popular teammates include Raging Bolt and Rillaboom to help check Water-types, while Landorus-T can function as a switch in against Landorus. Flutter Mane is able to check both Chien-Pao and Latias, while Intimidate ensures that Flutter Mane survives an attack from opposing Chien-Pao, despite its lacking physical bulk. Landorus-T also helps Flutter Mane by threatening Fairy-resistant foes such as Gholdengo and Tera Poison Landorus.</p> </li> <li> <p>Overall, Landorus-T is still a solid attacker, but faces numerous challenges in Regulation F which prevents it from functioning at its full potential.</p> </li> </ul>",
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li> <p>Choice Scarf allows Landorus-T to outspeed the majority of the format and attack or pivot out against Chien-Pao, breaking a potential Focus Sash.</p> </li> <li> <p>Stomping Tantrum is Landorus-T's most consistent Ground-type STAB move.</p> </li> <li> <p>Tera Flying Tera Blast provides Landorus-T with a usable Flying-type STAB move, allowing it to check Grass- and Fighting-type Pokemon. Tera Flying also removes Landorus-T's weakness to Water, helping it to better check Ogerpon-W and Urshifu-R and avoid being OHKOed by their respective STAB moves. However, Landorus-T has to be careful Terastallizing against Electric-type Pokemon like Iron Hands and Raging Bolt, as Tera would remove its Electric immunity.</p> </li> <li> <p>Rock Slide is a good spread move, allowing Landorus-T to hit Pokemon like opposing Landorus and Tornadus, which are immune to Ground-type moves, without wasting its Tera. Fast Rock Slide also provides a chance to flinch opposing Pokemon before they take action, giving Landorus-T and its teammates an out if push comes to shove.</p> </li> <li> <p>U-turn lets Landorus-T function as a pivot to reapply Intimidate and remove itself from a disadvantageous matchup. It can also do respectable damage against some of its checks, like Chien-Pao, Ogerpon-W and Latias.</p> </li> <li> <p>Adamant can be used over Jolly for more damage, but puts Landorus-T at risk of being outsped by Choice Scarf Urshifu-R.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Yuichi", "user_id": 435812}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Incineroar": {"sets": {"Support": {}}},
  "Rillaboom": {"sets": {"Offensive Pivot": {}, "Priority Attacker": {}}},
  "Indeedee-F": {"sets": {"Psyspam Support": {}}},
  "Urshifu": {"sets": {"Glass Cannon": {}}},
  "Urshifu-Rapid-Strike": {"sets": {"Choice Scarf": {}, "Mystic Water": {}}},
  "Regidrago": {"sets": {"Offensive": {}}},
  "Glimmora": {
    "overview": "<ul> <li> <p>Glimmora is a strong offensive threat with access to a good STAB combination and the powerful move Meteor Beam, which, when used with the Power Herb, can melt many targets, such as Assault Vest Entei and Incineroar. With Toxic Debris and signature move Mortal Spin, Glimmora can punish physical attackers and passive play, and, when combined with the threat of Meteor Beam, make it impossible to ignore while also requiring careful positioning to properly handle.</p> </li> <li> <p>Glimmora has traditionally fit best on Dondozo teams, as the combination of Toxic Debris and Mortal Spin means your foes almost guaranteed to be afflicted with poison, putting your opponent on a timer. Assault Vest on Glimmora is especially effective on Dondozo teams, as the extra longevity helps it spread poison better and stall out even longer, making up for the lowered damage output.</p> </li> <li> <p>With Meteor Beam, Glimmora can utilize its high Special Attack stat and good offensive typing as a damage dealer. Tornadus and Ogerpon-W are good partners; Tornadus provides speed control and can launch powerful Bleakwind Storms into Fighting-types that resist Meteor Beam and Ogerpon-W redirects potential Water- or Ground-type attacks while pressuring threats like Urshifu-R and Landorus. In return, Glimmora can threaten Grass-types, which resists both Ogerpon-W's STAB moves.</p> </li> <li> <p>Glimmora's poor defensive typing, combined with its middling bulk and average Speed, makes Glimmora a glass cannon. Glimmora is weak to many prominent offensive threats such as Urshifu-R, Landorus, and Gholdengo. Glimmora also struggles to handle Rock-resistant foes such as Iron Hands, Kingambit, and Urshifu-R. Even then, many of these foes will concede Toxic Spikes while taking out Glimmora; for instance, Urshifu-R will set up both layers of Toxic Spikes if it attacks Glimmora. Amoonguss is another difficult match up, as it absords Toxic Spikes and takes Glimmora's attacks comfortably, while threatening a Spore.</p> </li> </ul>",
    "sets": {
      "Meteor Beam": {
        "description": "<p>Meteor Beam's power against most neutral targets is devastating. The Special Attack boost allows Glimmora to output offensive pressure with Sludge Bomb even after Power Herb is consumed.</p> <ul> <li> <p>Earth Power is used as coverage for the Steel-types that resist Glimmora's STAB combination. Energy Ball is also an option to utilize the Tera Grass STAB boost and to hit Pokemon that resist Meteor Beam such as Urshifu-R but makes it so that Steel-types resist all of Glimmora's attacks.</p> </li> <li> <p>The Special Attack investment along with the Modest nature is necessary to pick up a OHKO on Landorus, Walking Wake, and Terastillized Urshifu-R with Meteor Beam. The OHKO on Landorus and Urshifu turns the match up against hyper offensive teams completely on its head, especially with speed control support from Tornadus.</p> </li> <li> <p>The Defense investment is enough to guarantee surviving Rillaboom's Wood Hammer and a favourable roll of taking Kingambit's Iron Head. The Special Defensive investment lets it live Gholdengo's Make it Rain and Latias's Mist Ball. The rest of the EVs are invested into Speed, which allows Glimmora to outspeed Choice Scarf Landorus-T when in Tailwind.</p> </li> <li> <p>Tera Grass has better synergy with Glimmora's original typing and provides an immunity to spore, but gives Glimmora weakness to common. Threats such as Chien-Pao. Tera Water, defensively, is a stronger neutral type into the metagame, but has fewer relevant resistances to common threats.</p> </li> </ul>"
      },
      "Bulky Attacker": {"description": "<ul> <li> <p>Both Earth Power and Energy Ball are fine options, but Energy Ball can do more damage against neutral targets if Glimmora Terastallizes into a Grass type.</p> </li> <li> <p>Mortal Spin is used as the final move for a more consistent method to spread poison than Toxic Debris.</p> </li> <li> <p>The Assault Vest gives Glimmora much more longevity, as it allows it to comfortably tank special attacks while still dissuading physical attackers with the threat of Toxic Spikes. On teams where being able to spread poison is important, Assault Vest is a good option.</p> </li> <li> <p>The special bulk allows Glimmora to live many strong super effective attacks, such as Choice Specs Gholdengo's Make it Rain; it also makes Choice Specs Flutter Mane's Shadow Ball a 3HKO. Glimmora still lives a Rillaboom Wood Hammer with the HP investment.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "Choruto", "user_id": 646006}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}, {"username": "Sole Survivor", "user_id": 518634}]}]}
  },
  "Kingambit": {"sets": {"Swords Dance": {}, "Assault Vest": {}}},
  "Flutter Mane": {
    "overview": "<ul> <li> <p>Flutter Mane's extraordinary Special Attack and Speed combined with its fantastic offensive typing makes it one of the most effective cleaners in the format, 2HKOing the majority of the metagame. Flutter Mane can also play a supportive role for its team thanks to Icy Wind and Speed Booster Energy.</p> </li> <li> <p>Offensive sets appreciate Pokemon that bring speed control like Latias and Tornadus, as well as Pokemon that provide it with longevity like Incineroar and Amoonguss. Supportive sets instead become the speed control and help support slower offensive Pokemon like Urshifu-R and Chi-Yu. Chi-Yu works particularly well as a partner, bolstering Flutter Mane's damage with Beads of Ruin and checking Steel-types like Kingambit while Flutter Mane takes care of Fighting-types like Urshifu-R in return.</p> </li> <li> <p>Bulky Assault Vest users that can take a boosted Moonblast and OHKO Flutter Mane in response like Kingambit and Rillaboom are some of its toughest matchups. Flutter Mane also faces issues into faster threats like Chien-Pao and Choice Scarf Urshifu-R. Additionally, redirectors like Indeedee-F and Ogerpon-W mitigate its damage output when on the field.</p> </li> </ul>",
    "sets": {
      "Offensive": {"description": "<ul> <li> <p>Flutter Mane is an effective cleaner thanks to Moonblast, which is its strongest STAB move, and Dazzling Gleam, which provides spread damage.</p> </li> <li> <p>Special Attack Booster Energy is Flutter Mane's strongest boosting item if it wants to keep Protect. Fairy Feather can be used instead, allowing it to retain its offensive boosts when switching at the cost of damage.</p> </li> <li> <p>The EV spread is built to survive an Ice Spinner from Jolly Chien-Pao and to outspeed Tornadus, with the remaining EVs boosting Flutter Mane's Special Attack</p> </li> <li> <p>Flutter Mane appreciates Tera Fairy to further boost its damage on Moonblast and Dazzling Gleam . This also removes its Ghost weakness and makes it resist Dark-type attacks, allowing it to better deal with opposing Flutter Mane and survive a potential Sucker Punch from Pokemon like Kingambit.</p> </li> </ul>"},
      "Choice Specs": {"description": "<ul> <li> <p>Choice Specs is Flutter Mane's strongest boosting item and allows it to do immediate damage.</p> </li> <li> <p>Flutter Mane utilizes Icy Wind as a speed control option and as coverage to threaten chipped Landorus. Thunderbolt and Power Gem are strong coverage options for important Pokemon like Tera Water Urshifu-R and Incineroar, respectively.</p> </li> <li> <p>The above spread allows Flutter Mane to survive a Surging Strikes from a Choice Scarf Urshifu-R while outspeeding Adamant Chien-Pao. The remaining EVs are used to maximise its Special Attack.</p> </li> <li> <p>Flutter Mane takes advantage of Tera Fairy by removing its Ghost weakness and giving it a Dark resistance, allowing it to better deal with opposing Flutter Mane and survive a potential Sucker Punch from Pokemon like Chien-Pao. Tera Fairy also allows Flutter Mane to secure an OHKO on Tera Water Urshifu-R.</p> </li> </ul>"},
      "Speed-Boosting Support": {"description": "<ul> <li> <p>Flutter Mane requires Icy Wind to accomplish its role as speed control, forcing it to pick between Dazzling Gleam and Moonblast.</p> </li> <li> <p>Speed Booster Energy allows Flutter Mane to outspeed the majority of the metagame.</p> </li> <li> <p>With Booster Energy, Flutter Mane can outspeed opposing Chien-Pao at -1 and Modest Gholdengo in Tailwind. The defensive investment lets it survive Adamant Chien-Pao's Ice Spinner and Gholdengo's Make It Rain.</p> </li> <li> <p>Tera Fairy is appreciated to gain more of an offensive presence and helps against opposing Flutter Mane, as Speed Booster Energy Flutter Mane is unable to OHKO opposing Flutter Mane with Shadow Ball.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yuichi", "user_id": 435812}]}, {"name": "Grammar checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Iron Bundle": {"sets": {"Glass Cannon": {}}},
  "Iron Hands": {
    "overview": "<ul> <li> <p>With great physical bulk and Attack, plus Assault Vest to shore up its special bulk, Iron Hands can stick on the field for a long time and deal plenty of damage, allowing it to serve as a bulky pivot. Fake Out also provides Iron Hands with utility.</p> </li> <li> <p>Thanks to Iron Hands's bulk and power, it is able to take on a variety of Pokemon. Notable good matchups include both Urshifu formes, Kingambit, Tornadus and Raging Bolt.</p> </li> <li> <p>Landorus and Landorus-T are extremely bad matchups for Iron Hands not running Ice Punch, and Landorus-T also has Intimidate to lower its damage output. Other notable bad matchups include Amoonguss and Latias, which can wall Iron Hands's STAB moves and punish it with Rocky Helmet, as well as Rillaboom, which can consistently beat it with Wood Hammer.</p> </li> <li> <p>Despite Incineroar being weak to Iron Hands, thanks to Intimidate, Incineroar's higher Speed that lets it use Fake Out first, and Parting Shot, Incineroar can easily halve the damage output of Iron Hands.</p> </li> </ul> <p>*Iron Hands fits best on balance teams, where it contributes to the pivot-heavy playstyle. Tailwind teams can also utilize Iron Hands as a defensive backbone and bulky pivot.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>Wild Charge is better than Thunder Punch, as the power allows for a lot of extra OHKOs to be taken, such as one on Urshifu-R.</p> </li> <li> <p>Drain Punch is preferable for longevity, and while Close Combat can hit certain Pokemon like Incineroar harder, Iron Hands is meant to stick on the field, so a drop in both defenses as a side effect of using its Fighting-type STAB move goes against Iron Hands's best traits.</p> </li> <li> <p>Ice Punch fixes the matchup vs both Landorus formes, Heavy Slam turns the tables on Flutter Mane, and Volt Switch is an option to turn Iron Hands into a pivot and provide it with a way to reset Attack drops from Intimidate.</p> </li> <li> <p>Assault Vest maximizes Iron Hands's low special bulk.</p> </li> <li> <p>An Adamant nature and Attack EVs take advantage of Iron Hands' massive Attack stat. Maximum Special Defense investment takes full advantage of Assault Vest. The Speed EVs outspeeds Urshifu-R under Tailwind and some slower Incineroar.</p> </li> <li> <p>Using Tera defensively allows Iron Hands to avoid weaknesses like Fairy and Ground. Tera Grass allows it to ignore Amoonguss's Rage Powder and Spore, as well as providing it with a resistance to the STAB moves of Landorus and Urshifu-R. Tera Water allows Iron Hands to resist Urshifu-R's Surging Strikes, as well as not adding a weakness to Ice- and Flying-types for Urshifu-R's common partners like Tornadus and Chien-Pao to take advantage of. Tera Fairy is an overall good defensive type, as it is neutral into most of the metagame, but it's especially good for beating opposing Iron Hands and performing better into Raging Bolt.</p> </li> </ul> <p>Written by: https://www.smogon.com/forums/members/soulboyvgc.558405/</p> <p>Quality checked by: https://www.smogon.com/forums/members/lameliarleo.641287/</p> <p>Grammar checked by: https://www.smogon.com/forums/members/yoko.617542/ https://www.smogon.com/forums/members/tbolt.555379/</p>"
      }
    }
  },
  "Gholdengo": {"sets": {"Nasty Plot": {}}},
  "Chien-Pao": {
    "overview": "<ul> <li> <p>Chien-Pao is an excellent offensive Pokemon bearing a great offensive typing and a fantastic Speed tier. Chien-Pao is capable of taking on the majority of the format, and it's especially strong against Tornadus and Landorus thanks to its typing and Sword of Ruin.</p> </li> <li> <p>Incineroar has Intimidate and resists both of Chien-Pao's STAB attacks, which makes it difficult for Chien-Pao to deal with, therefore Urshifu-R is a strong partner as it utilizes Sword of Ruin and pressures Incineroar.</p> </li> <li> <p>Chien-Pao also struggles to take on Urshifu-R and Iron Hands, which take any of its attacks comfortably and threaten it in return.</p> </li> </ul>",
    "sets": {
      "Glass Cannon": {
        "description": "<ul> <li> <p>Ice Spinner is an alternative Ice-type STAB move that provides increased accuracy and a way for teams to handle Rillaboom and Indeedee-F in exchange for higher power and a flinch chance. However, it prevents Chien-Pao from attacking Rocky Helmet Amoonguss and Latias as freely.</p> </li> <li> <p>Chien-Pao uses Sacred Sword as coverage for relevant Pokemon such as Incineroar and Kingambit.</p> </li> <li> <p>Chien-Pao utilizes Focus Sash to make up for its poor defensive typing combined with its lackluster bulk, as it allows it to stay an extra turn on the field to help partners exploit Sword of Ruin, which is significant for offensive compositions.</p> </li> <li> <p>With Tera Stellar, Chien-Pao has the option to pick up OHKOs on Pokemon it usually wouldn't be able to OHKO, such as Flutter Mane and Amoonguss. However, it has to be wary of pivots and foes using Protect, as the power boost is temporary. Chien-Pao can also use Tera Ghost to remove its Fighting weakness and become immune to priority moves like Fake Out, which is crucial for Focus Sash.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Robbie35646", "user_id": 562330}]}, {"name": "Grammar checked by", "members": [{"username": "yoko", "user_id": 617542}, {"username": "Clouds", "user_id": 356215}]}]}
  },
  "Chi-Yu": {
    "overview": "<ul> <li> <p>Chi-Yu is the strongest offensive Pokemon in the format, thanks to a high Special Attack stat and Beads of Ruin. Chi-Yu threatens to OHKO the majority of the format, including Amoonguss, Rillaboom, Kingambit, and Gholdengo, with it also walling the latter two. Chi-Yu also outspeeds them with minimal investment, making it a great counter to the common Grass- and Steel-types.</p> </li> <li> <p>While Chi-Yu has fantastic damage, it also has a lackluster Speed tier, which makes Tornadus, Whimsicott, and Speed Booster Energy Flutter Mane great partners; the former two being consistent sun setters, and all of them can pressure Fighting-types such as Urshifu-R that Chi-Yu may be afraid of. Chi-Yu also pairs well with the majority of special attackers, helping them with Beads of Ruin.</p> </li> <li> <p>Incineroar and Urshifu-R resist Chi-Yu's STABs and threaten to either mitigate its damage output or OHKO it. Bulky Assault Vest Pokemon that hit it super effectively like Entei and Iron Hands are also great options against it.</p> </li> </ul>",
    "sets": {
      "Choice Specs": {"description": "<ul> <li> <p>Snarl is used as general utility and as a way to counter Psychic Terrain threats like Hatterene and Iron Crown. Chi-Yu can opt for Tera Blast instead to OHKO frailer Urshifu-R and Flutter Mane without committing to Overheat.</p> </li> <li> <p>The defensive investment allows for Chi-Yu to survive a Tera Fairy Special Attack Booster Energy Moonblast from Flutter Mane, and, when Terastallized, Urshifu-R's Mystic Water Surging Strikes. The Speed EVs allow Chi-Yu to outspeed Adamant Urshifu-R, and the remaining EVs are put into Special Attack to maximize offensive pressure.</p> </li> <li> <p>Chi-Yu uses Tera Ghost to negate its Fighting weakness and become immune to priority like Fake Out and Extreme Speed, which is crucial, as it can't Protect.</p> </li> </ul>"},
      "Glass Cannon": {"description": "<ul> <li> <p>Chi-Yu uses Overheat over Snarl for OHKOs on Landorus and Tera Grass Entei.</p> </li> <li> <p>Focus Sash can make up for Chi-Yu's poor bulk and mediocre defensive typing.</p> </li> <li> <p>Chi-Yu uses Tera Ghost to avoid Fighting-type moves and priority moves like Fake Out and Extreme Speed, preserving its Focus Sash and allowing for aggressive plays.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Walking Wake": {"sets": {"Life Orb": {}}},
  "Ogerpon-Wellspring": {"sets": {"Follow Me Support": {}}},
  "Ogerpon-Hearthflame": {
    "overview": "<ul> <li> <p>With a solid stat spread, incredible damage output with Terastallization, a unique typing and access to utility such as Follow Me, Ogerpon-H can provide some unique assets to a team.</p> </li> <li> <p>Ogerpon-H has a strong STAB combination that is only walled by Fire- and Dragon-types. Because of this, some of its best partners include Urshifu-R, Landorus and Flutter Mane, which are all powerful attackers that pair well with Ogerpon-H and enjoy Follow Me support. Another strong partner is Kingambit, which dissuades Intimidate from weakening Ogerpon-H, while Follow Me provides an opportunity for Swords Dance Kingambit to set up.</p> </li> <li> <p>Ogerpon-H becomes an extremely powerful offensive threat once Terastallized, being able to OHKO metagame staples like Flutter Mane, Urshifu-R, Rillaboom, and Landorus. Ogerpon-H also has a fantastic matchup against Amoonguss; not only is it able to completely ignore Amoongus's Spore and Rage Powder, but it is also able to OHKO it with Ivy Cudgel or with Wood Hammer should Amoonguss Terastallize into a Water-type. Additionally, Mystic Water variants of Urshifu-R get outsped and OHKOed.</p> </li> <li> <p>Bad matchups for Ogerpon-H include Pokemon such as Entei and Raging Bolt that can wall its STAB combation. For this reason, as well as Intimidate hampering Ogerpon-H's offensive capabilities, Incineroar is a very stable check to it. Lastly, despite having solid bulk, powerful threats that can outspeed Ogerpon-H can OHKO it such as Choice Scarf Urshifu-R. However, with speed control or Fake Out support from Pokemon like Rillaboom, Ogerpon-H can take on Choice Scarf Urshifu-R.</p> </li> </ul>",
    "sets": {"Offensive": {"description": "<ul> <li> <p>Horn Leech trades Wood Hammer's power for greater longevity.</p> </li> <li> <p>Follow Me is by far the best third move on this Pokemon, but if the team does not require a redirector, Ogerpon-H can use Grassy Glide; if this is the case, it is almost always paired with Rillaboom to ensure Grassy Glide is a priority move. Alternatively, Stomping Tantrum allows it to hit opposing Fire-types such as Entei and Chi-Yu.</p> </li> <li> <p>The Speed EVs allow Ogerpon-H to outspeed Modest Landorus and Adamant Urshifu-R. The Attack EVs with the Adamant nature allow it to OHKO Flutter Mane after Terastallization even when Ogerpon-H is Intimidated.</p> </li> <li> <p>The bulk investment allows Ogerpon-H to live most Choice Scarf Urshifu-R's Tera Water Surging Strikes while having a favorable roll to survive Timid Landorus's Sludge Bomb.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "SoulboyVGC", "user_id": 558405}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sole Survivor", "user_id": 518634}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Archaludon": {
    "overview": "<ul> <li> <p>Archaludon can utilize its above-average bulk, solid Special Attack stat, and great Ability in Stamina to check and OHKO threats such as Urshifu-R, Incineroar, and Raging Bolt.</p> </li> <li> <p>Archaludon's access to Stamina and Body Press combined with its resistances and great physical bulk make it an amazing check to Pokemon such as Rillaboom and the Ogerpon formes and also allow it to act as a wincon.</p> </li> <li> <p>Archaludon appreciates teammates like Amoonguss and Sinistcha that provide it with recovery through Pollen Puff and Hospitality, as well as Rage Powder for redirection. Rillaboom provides Fake Out support, as well as passive healing through Grassy Terrain and priority with Grassy Glide that discourages the opponent from leading with Urshifu-R. Dual screens from Grimmsnarl and damage reduction from Incineroar's Intimidate or Snarl are also useful for keeping Archaludon alive to stack Stamina or Electro Shot stat increases.</p> </li> <li> <p>Archaludon fits well on rain teams thanks to its Grass and Electric resistances. It appreciates teammates such as Pelipper that can check opposing Ground- and Fighting-types like Landorus and both Urshifu formes; Pelipper's rain support also allows Electro Shot to charge in one turn, OHKOing Urshifu-R and Tornadus. Archaludon also functions well on Trick Room teams due to many of its checks being faster than it, such as both Urshifu formes, Landorus, and Chien-Pao running Sacred Sword. Farigiraf pairs notably well with Archaludon on Trick Room teams due to the protection from priority it provides and its access to Psychic Noise, which disables Iron Hands's Drain Punch.</p> </li> </ul>",
    "sets": {
      "Rain Sweeper": {
        "description": "<ul> <li> <p>Archaludon's Defense EVs allow it to survive Adamant Choice Scarf Urshifu-R's and Urshifu-S's Close Combat, meaning it can take a hit, boost itself with Electro Shot, and OHKO Urshifu-R on the same turn, provided rain is currently active. The Special Defense investment prevents it from being 2HKOed by Special Attack Booster Energy Flutter Mane's Moonblast.</p> </li> <li> <p>Archaludon does not particularly require Special Attack investment thanks to Electro Shot boosting this stat, but 36 Special Attack EVs with a Modest nature give Archaludon an extra point in Special Attack because of how stat calculation works.</p> </li> <li> <p>28 Speed EVs are to outspeed Choice Scarf Urshifu-R, Urshifu-S and Landorus when Archaludon is under Tailwind.</p> </li> <li> <p>Draco Meteor and Electro Shot OHKO Pokemon such as Raging Bolt, Urshifu-R, and Tornadus. Flash Cannon OHKOes Flutter Mane after one Electro Shot boost, and Body Press is good to threaten an OHKO on Chien-Pao, and significant damage on Incineroar, especially after a Stamina boost.</p> </li> <li> <p>Tera Grass gives Archaludon a resistance to Ground-type moves such as Landorus's Sandsear Storm and Earth Power, and immunity to Spore and Rage Powder. Meanwhile, Tera Fairy gives it a Fighting resistance and Dragon immunity to beat Urshifu and opposing Dragon-types respectively.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "UserOmega", "user_id": 637876}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sole Survivor", "user_id": 518634}]}, {"name": "Grammar checked by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Raging Bolt": {
    "overview": "<ul> <li> <p>Raging Bolt, with a higher Special Attack than Flutter Mane, massive HP, and good defenses, serves its role as a bulky damage dealer exceptionally well.</p> </li> <li> <p>Don't let Raging Bolt's middling Speed fool you; it's signature move, Thunderclap, makes sure that isn't an issue in a lot of situations, making the Tornadus + Urshifu-R matchup virtually trivial.</p> </li> <li> <p>Raging Bolt pairs insanely well with Rillaboom and Incineroar, providing Fake Out pressure for Raging Bolt to either setup with the Calm Mind set or deal massive damage with the 3 Attacks set. Rillaboom also provides more longevity in Grassy Terrain for Raging Bolt, which can make it immensely difficult to KO. Chien-Pao and Choice Scarf Urshifu-R are also excellent partners at dealing with Raging Bolt's worst matchup, Landorus.</p> </li> <li> <p>That said, Raging Bolt does still have bad matchups despite its strengths, one of which is the aforementioned Landorus, due to it being able to threaten OHKOs against Raging Bolt with Earth Power. Chien-Pao can also be a tricky matchup, as it can deal massive damage with Ice Spinner or Icicle Crash and cause mindgames with Sucker Punch and Thunderclap. Flutter Mane is able to deal huge damage to Raging Bolt even when it Terastallizes, and can very comfortably take unboosted Thunderclaps.</p> </li> </ul>",
    "sets": {
      "3 Attacks": {
        "description": "<ul> <li> <p>Thunderbolt is there for good consistent damage, especially with Tera Electric with Magnet, while Thunderclap helps make up for Raging Bolt's middling Speed. Draco Meteor is a more powerful option, being able to OHKO Pokémon like Landorus when used with Booster Energy. However, it can be forced to switch out and lose the boost when using Booster Energy.</p> </li> <li> <p>Magnet is the most consistent item option, especially when paired with Tera Electric, drastically increasing Raging Bolt's damage. Booster Energy is another option, as it not only boosts its Electric-type moves, but it also boosts Draco Meteor. Safety Goggles prevents Amoonguss from redirecting Thunderclaps away from Urshifu-R.</p> </li> <li> <p>The Speed investment allows Raging Bolt to outspeed Dragapult, Flutter Mane, and Chien-Pao while under Tailwind, allowing it to hit them with its stronger options like Thunderbolt and Draco Meteor. The HP is optimized for Life Orb chip if used.</p> </li> <li> <p>Tera Electric will often be the strongest and most consistent option. Tera Grass is a good option to not only resist Ground-type moves from Landorus, but also if you want to ignore Amoonguss' Spore and redirection with Rage Powder without running Safety Goggles. Finally, Tera Fairy is just a strong neutral Tera type to pair with such amazing bulk.</p> </li> </ul>"
      },
      "Calm Mind": {
        "description": "<ul> <li> <p>Thunderclap is a good main STAB move, as it allows Raging Bolt to focus less on Speed and go all out on bulk investment, as it will be able to boost up then hit most foes before they can retaliate.</p> </li> <li> <p>While Dragon Pulse is usually an underwhelming move, it serves as a strong neutral STAB move into Pokemon that resist Electric-type attacks when paired with Calm Mind.</p> </li> <li> <p>In some situations, Thunderbolt can be used over Protect, due to Raging Bolt being bulky enough to where Protect isn't mandatory on Calm Mind sets, and for consistency against support Pokémon such as Follow Me Ogerpon-W where Thunderclap would fail.</p> </li> <li> <p>Leftovers is preferred over Booster Energy on the Calm Mind set, providing immense longevity with Grassy Terrain from Rillaboom. However, Booster Energy can be used if you need that extra damage, as the Special Attack boost changes many calculations, for example, being able to OHKO bulky Flutter Mane at +1 with Helping Hand and Protosynthesis where you'd be unable to without Booster Energy.</p> </li> <li> <p>The Defense EVs with the HP EVs allow Raging Bolt to live Icicle Crash from Adamant Chien-Pao. The HP EVs make the HP optimized for Leftovers and Grassy Terrain recovery. The bulk investment ensures that Raging Bolt is able to tank 2 unboosted Moonblasts from Timid Flutter Mane at +1 Special Defense after Leftovers and Grassy Terrain recovery combined with Protect. The Special Defense EVs hit an even number to be optimal for the Calm Mind boost.</p> </li> <li> <p>Tera Grass lets Raging Bolt resist Ground-type moves and provides an immunity to Spore and Rage Powder, so Thunderclap can't be redirected away from Urshifu-R.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "CbuttyVGC", "user_id": 615665}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yuichi", "user_id": 435812}]}, {"name": "Grammar checked by", "members": [{"username": "yoko", "user_id": 617542}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Iron Crown": {
    "overview": "<ul> <li> <p>Iron Crown is an excellent choice for offensive teams looking to take advantage of the powerful move Expanding Force thanks to its well-rounded stats and access to Booster Energy. It performs best against frailer offensive teams consisting of Pokemon that do not resist Expanding Force, such as Tornadus, Landorus, and Urshifu-R.</p> </li> <li> <p>Although it can be used as a sweeper early-game to soften opposing teams, it is usually better to save Iron Crown for the late-game when its checks have been sufficiently weakened for it to sweep.</p> </li> <li> <p>Indeedee-F is by far Iron Crown's best teammate, offering role compression as a Psychic Terrain setter and redirector. Access to Helping Hand also further amplifies its partner's ridiculous damage output.</p> </li> <li> <p>Iron Crown's best counters are Dark- and Steel-types, namely Incineroar, Kingambit, Archaludon, and Gholdengo, all of which resist both of Iron Crown's STAB moves.</p> </li> <li> <p>Therefore, Iron Crown appreciates Pokemon that can help remove these threats consistently, such as Landorus, Entei, and Urshifu-R. In return, Iron Crown can pressure opposing Urshifu-R and Amoonguss.</p> </li> <li> <p>Rillaboom is another noteworthy check, as it is able to safely pivot in and override Psychic Terrain, weakening Expanding Force significantly. Other Pokemon with access to Ice Spinner like Chien-Pao and Dragonite can also be used to remove Psychic Terrain.</p> </li> <li> <p>Faster Pokemon like Chien-Pao and Flutter Mane serve as good checks as well, but they have to watch out for Follow Me from Indeedee-F as they are vulnerable to Tachyon Cutter.</p> </li> </ul>",
    "sets": {
      "Booster Energy": {
        "description": "<ul> <li> <p>Expanding Force is Iron Crown's go-to STAB move, allowing it to devastate foes under Psychic Terrain.</p> </li> <li> <p>Tachyon Cutter helps secure the OHKO on Pokemon like Chien-Pao and Whimsicott, which commonly hold Focus Sash.</p> </li> <li> <p>Tera Water is a naturally good defensive typing that, when coupled with Tera Blast, gives Iron Crown an out against the aforementioned Dark- and Steel-type Pokemon, which otherwise counter it. Focus Blast can be used over Tera Blast to secure the OHKO on Kingambit, but is rather inconsistent and is unable to hit Gholdengo.</p> </li> <li> <p>An alternative spread of 76 HP / 4 Def / 172 SpA / 4 SpD / 252 Spe allows Iron Crown to outspeed Flutter Mane and Chien-Pao thanks to Speed Booster Energy.</p> </li> <li> <p>This set can also be run with a Modest nature to maximize Iron Crown's damage output, at the risk of underspeeding opposing Pokemon in the same Speed tier such as Modest Landorus and both Urshifu formes.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Yuichi", "user_id": 435812}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  }
}