{
  "Charizard": {"sets": [{"name": "Choice Specs"}]},
  "Arcanine": {"sets": [{"name": "Utility"}]},
  "Slowbro": {"sets": [{"name": "Defensive"}]},
  "Cloyster": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Gengar": {"sets": [{"name": "Choice Specs"}]},
  "Chansey": {"sets": [{"name": "Defensive"}]},
  "Tauros-Paldea-Blaze": {"sets": [{"name": "Physically Defensive"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}]},
  "Ditto": {"sets": [{"name": "Imposter"}]},
  "Dragonite": {
    "sets": [
      {
        "name": "Offensive Dragon Dance",
        "description": "<p>Multiscale combined with solid natural bulk, a high Attack stat, and Dragon Dance enable Dragonite become a deadly set-up sweeper. Extreme Speed is an excellent move for any physical sweeper, due to its high power and initiative over other priority users such as Kingambit. Earthquake provides coverage against bulky foes such as Toxapex, Garganacl, and Clodsire. Fire Punch OHKOes Scizor and 2HKOes physically defensive Corviknight after a Dragon Dance and Stealth Rock. Alternatively, Ice Spinner hits opposing Dragonite, Great Tusk, and Dragapult super effectively, notably OHKOing Dragapult after a Dragon Dance. Heavy-Duty Boots + Roost improves Dragonite's longevity and possibly enables it to retain Multiscale and obtain multiple boosts; preserving Multiscale is particularly useful for surviving Draco Meteor from Timid Choice Specs Dragapult. However, the loss of coverage against targets such as Corviknight and Air Balloon Gholdengo is noticeable. Tera Normal turns Extreme Speed into an incredibly powerful STAB priority move capable of shredding offensive teams after a single boost, and a timely typing change also removes Dragonite's weaknesses to Ice, Fairy, and Dragon, which can buy a free turn to set up. An Adamant nature is preferred since it maximizes the power of Extreme Speed, which often makes makes Speed stats irrelevant, but a Jolly nature can also be used to outspeed the Normal-immune Dragapult after a Dragon Dance, which is especially useful if Dragonite is running Ice Spinner.</p> <p>Offensive Dragon Dance Dragonite regularly serves as a potent win con on offensive teams that can also act as a revenge killer against fast and frail threats. Multiscale Dragonite's considerable bulk, as well as Ghost immunity with Tera Normal provides significant defensive utility for offensive teams. In particular, teams using frail offensive Pokemon such as Iron Valiant appreciate the defensive utility Dragonite brings. In return, these Pokemon can help wallbreak for a late-game Dragonite sweep. Entry hazard support from Great Tusk, Glimmora, and Garchomp is appreciated to weaken Pokemon such as Iron Valiant into range of boosted Extreme Speed. Dual screens support from Grimmsnarl and Shed Tail support from Orthworm are potential options that can supplement Dragonite's already great bulk and virtually guarantee the ability to acquire multiple boosts. Since Dragonite struggles against bulky Unaware users such as Dondozo and Skeledirge, a teammate that can switch into and check these Pokemon, such as Rotom-W, is appreciated. Rotom-W can cripple these physical walls with Trick, gain momentum against them with Volt Switch, and absorb Will-O-Wisp from Skeledirge.</p> "
      },
      {
        "name": "Bulky Dragon Dance",
        "description": "<p>With the combination of its solid natural bulk, valuable typing, reliable recovery in Roost, and Multiscale, Dragonite can accrue multiple Dragon Dance boosts and become a dangerous bulky setup sweeper. It can set up on common Pokemon such as Great Tusk lacking Bulk Up or Ice Spinner, non-Will-O-Wisp Volcarona, and even super effective attacks from Iron Valiant and Choice Specs Dragapult thanks to Multiscale. Extreme Speed alongside Tera Normal lets Dragonite clean up late-game, OHKOing faster threats like Meowscarada and potentially Cinderace at +1. It also outprioritizes Meowscarada's Sucker Punch as well as Grimmsnarl's Prankster-boosted Reflect and Thunder Wave. Earthquake covers Normal-resistant and -immune Pokemon, including foes like Dragapult, non-Air Balloon Gholdengo, Garganacl, and Kingambit. 144 HP EVs allow Dragonite to survive Tera Fairy Iron Valiant's Moonblast at +1 through Multiscale. Aside from strengthening Dragonite's Extreme Speed, Tera Normal sheds off its weaknesses to give it setup opportunities against would-be threats like Dragapult and Hatterene. Heavy-Duty Boots keeps Multiscale intact by ignoring Stealth Rock.</p> <p>Bulky Dragon Dance Dragonite fits well on bulky offense. A defensive backbone consisting of Pokemon like Ting-Lu, Gholdengo, and Corviknight is valuable to check threats like Dragapult and Iron Valiant, which would threaten Dragonite prior to boosting; in return, Dragonite can answer threats like Roaring Moon, Cinderace, and Volcarona for them. Garchomp, Glimmora, and Ting-Lu can reliably set entry hazards, which rack up chip damage onto walls such as Dondozo, Great Tusk, and Garganacl and puts revenge killers like Iron Valiant into guaranteed KO range of +1 Tera Normal Extreme Speed. Wallbreakers such as Breloom and Great Tusk can punch holes early-game and overwhelm Dragonite's checks, such as Corviknight, Dondozo, Skeledirge, and defensive Great Tusk. Moreover, Breloom can incapacitate foes with Spore to give setup opportunities for Dragonite, while Great Tusk can use Knock Off to cripple Corviknight and Dondozo and pop Gholdengo's Air Balloon. Other setup sweepers are great partners; Volcarona can threaten Corviknight, use Tera Steel Rotom-W as setup fodder, and spread burns with Flame Body and Will-O-Wisp against physical attackers such as Iron Valiant, Iron Hands, and Roaring Moon to further support Dragonite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 272785, "username": "nimzowitsch"}]}
  },
  "Azumarill": {"sets": [{"name": "Choice Band"}, {"name": "Assault Vest"}]},
  "Umbreon": {"sets": [{"name": "Specially Defensive"}]},
  "Slowking": {"sets": [{"name": "Specially Defensive"}]},
  "Scizor": {"sets": [{"name": "Choice Band"}, {"name": "Offensive Pivot"}, {"name": "Offensive Swords Dance"}]},
  "Blissey": {"sets": [{"name": "Defensive"}]},
  "Tyranitar": {"sets": [{"name": "Choice Band"}, {"name": "Defensive"}]},
  "Pelipper": {"sets": [{"name": "Rain Setter"}]},
  "Masquerain": {"sets": [{"name": "Sticky Web"}]},
  "Breloom": {"sets": [{"name": "Focus Sash"}, {"name": "Choice Band"}]},
  "Torkoal": {"sets": [{"name": "Defensive"}]},
  "Salamence": {"sets": [{"name": "Dragon Dance"}]},
  "Floatzel": {"sets": [{"name": "Rain Breaker"}]},
  "Gastrodon": {"sets": [{"name": "Specially Defensive"}]},
  "Garchomp": {"sets": [{"name": "Tank"}, {"name": "Swords Dance"}, {"name": "Mixed"}]},
  "Hippowdon": {"sets": [{"name": "Specially Defensive"}]},
  "Magnezone": {"sets": [{"name": "Choice Specs"}]},
  "Gallade": {"sets": [{"name": "Swords Dance"}]},
  "Rotom-Heat": {"sets": [{"name": "Specially Defensive Pivot"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot"}, {"name": "Trick"}]},
  "Amoonguss": {"sets": [{"name": "Defensive"}]},
  "Alomomola": {"sets": [{"name": "Defensive"}]},
  "Haxorus": {"sets": [{"name": "Swords Dance"}]},
  "Hydreigon": {"sets": [{"name": "Nasty Plot"}]},
  "Volcarona": {"sets": [{"name": "Bulky Quiver Dance"}, {"name": "Offensive Quiver Dance"}]},
  "Talonflame": {"sets": [{"name": "Defensive Utility"}]},
  "Sylveon": {"sets": [{"name": "Specially Defensive Calm Mind"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Klefki": {"sets": [{"name": "Trick Room Setter"}]},
  "Avalugg": {"sets": [{"name": "Defensive"}]},
  "Toxapex": {"sets": [{"name": "The Pex"}]},
  "Mimikyu": {"sets": [{"name": "Swords Dance"}]},
  "Cinderace": {"sets": [{"name": "Offensive Pivot"}]},
  "Corviknight": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Physically defensive Corviknight is a fantastic check to dangerous attackers like Garchomp, Roaring Moon, and Dragonite an effective slow pivot; and one of the few viable entry hazard removers. The choice between Brave Bird and Body Press comes down to team need; Brave Bird nails Great Tusk and has no immunities, while Body Press is Corviknight's best option against Kingambit and Chien-Pao. Leftovers is the preferred item to provide extra longevity, but Rocky Helmet can further punish physical attackers, especially on weak hits like Scizor's and Meowscarada's U-turn. Tera Water serves as an emergency check to dangerous Fire-types like Cinderace, while Tera Ground surprises Iron Hands.</p> <p>Corviknight is a fantastic slow pivot, making it a great partner for frail-but-powerful teammates like Chien-Pao and Iron Valiant. It is also one of the few viable Defoggers, allowing it to partner up with teammates like Dragonite, Chien-Pao, and Volcarona that loathe Stealth Rock. Be warned, Corviknight is utterly unable to Defog against Gholdengo, so secondary entry hazard removal like Great Tusk and a reliable switch-in like Ting-Lu are recommended. Corviknight is unable to handle powerful physical Fire-types like Cinderace and Ceruledge and Electric-types like Iron Hands. Teammates that can cover these weaknesses like Dondozo and Great Tusk are wonderful partners. Its middling special bulk makes teammates like Slowking and Ting-Lu valuable. Slowking has the added benefit of being another slow pivot as well, while Ting-Lu forms a strong entry hazard core with Corviknight and threatens Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 487308, "username": "BT89"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Barraskewda": {"sets": [{"name": "Rain Sweeper"}]},
  "Polteageist": {"sets": [{"name": "Shell Smash"}]},
  "Hatterene": {"sets": [{"name": "Calm Mind"}, {"name": "Healing Wish"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Pincurchin": {"sets": [{"name": "Terrain Setter"}]},
  "Indeedee": {"sets": [{"name": "Choice Scarf"}, {"name": "Terrain Setter"}]},
  "Dragapult": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Possessing OU's highest unboosted Speed tier makes Choice Specs Dragapult a very remarkable special wallbreaker, revenge killer, and offensive pivot. It outspeeds and threatens common offensive threats like Cinderace, Iron Moth, and even boosted foes like Adamant Dragonite after a Dragon Dance. Moreover, it's immune or resistant to common priority attacks like the aforementioned Dragonite's Extreme Speed, Breloom's Mach Punch, and Slither Wing's First Impression, which makes it much harder to revenge kill. It is also able to switch into and check Rotom-W. A coverage move in either Flamethrower or Thunder lets Dragapult nail Corviknight, with the former also hitting other Steel-types like Kingambit and Iron Treads, while the latter pressures Toxapex and Tera Water Garganacl. Infiltrator allows Dragapult to bypass Grimmsnarl's dual screens, Orthworm's Shed Tail, and Substitute users like Gholdengo, which gives it an edge against hyper offense teams. Tera Ghost maintains an immunity to Dragonite's Extreme Speed and strengthens Shadow Ball—its most spammable attack—notably guaranteeing the 2HKO on Corviknight and Assault Vest Iron Treads after Terastallizing. Tera Fairy prevents Dragapult from being picked off by opposing Dragapult and Sucker Punch from Chien-Pao, Kingambit, and Meowscarada. Finally, Tera Dragon turns Draco Meteor into an even more powerful nuke. This takes advantage of the lack of prominent bulky Steel- and Fairy-types in the metagame, notably chunking answers to Ghost-types like Purifying Salt Garganacl and Ting-Lu and 2HKOing Unaware Clodsire.</p> <p>Choice Specs Dragapult fits perfectly on bulky offense and VoltTurn teams. Physical wallbreakers like Chien-Pao and Great Tusk appreciate Dragapult's U-turn bringing them in safely, and they are able to pressure its switch-ins like Clodsire, Ting-Lu, Blissey, and Garganacl. Entry hazard removers like Corviknight and Great Tusk allow Dragapult to pivot throughout the game unperturbed; the former can also pivot it in safely via U-turn, letting it threaten Gholdengo, which tends to switch into Corviknight to block its Defog. Furthermore, Corviknight and Great Tusk provide the necessary defensive backbone to switch into boosted threats such as Roaring Moon, as well as revenge kill attempts from Sucker Punch users like Kingambit and Chien-Pao. Gholdengo forms a Ghost spam core with Dragapult, as it can overwhelm a shared check in Ting-Lu, use non-Calm Mind Blissey as setup fodder, and either cripple Tera Water Garganacl with Trick or straight up dent Tera Fairy variants. Entry hazards from Ting-Lu, Garchomp, and Garganacl can quickly put foes into Dragapult's KO range, especially as it tends to force a lot of switches; in return, Dragapult spinblocks foes like Great Tusk and Iron Treads in a pinch. Setup sweepers like Volcarona, Iron Valiant, and Swords Dance Chien-Pao appreciate Dragapult wallbreaking early-game for them to clean up late-game easily.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Dragapult utilizes its near-unresisted STAB moves, its blistering Speed stat, and its excellent Attack stat to function as a strong physical wallbreaker. The choice for the second move depends on what Tera type Dragapult chooses. Tera Dragon Dragapult uses Phantom Force for a Ghost-type STAB move, but Tera Ghost uses Tera Blast, since, unlike Phantom Force, it is not a two-turn move. Sucker Punch allows Dragapult to revenge kill weakened sweepers such as opposing Dragapult, as well as Iron Moth and Tera Flying Roaring Moon after some chip damage. However, be careful when using Sucker Punch, since opponents can predict it and set up. An Adamant nature gives Dragapult extra wallbreaking power, at the cost of being outsped by threats like Chien-Pao. Alternatively, a Jolly nature allows Dragapult to outspeed the entirety of the unboosted metagame. With Tera Dragon, Dragapult's Dragon Darts becomes harder to switch into; it 2HKOes walls Dragapult normally struggles with such as Ting-Lu. Tera Dragon Dragapult is also less susceptible to Sucker Punch, albeit at the cost of losing its immunity to Dragonite's Extreme Speed.</p> <p>Iron Valiant is a fantastic partner, since it's able to check Dark-types such as Kingambit and Ting-Lu. Hazard removal from Pokemon like Great Tusk, Cinderace, and Corviknight make for good partners, since Dragapult's lack of longevity makes it difficult to switch in when hazards are up. Great Tusk and Corviknight are able to beat both Scizor and opposing Great Tusk, while Cinderace can threaten bulky Steel-types such as Corviknight. Dragapult benefits from entry hazards from the likes of Great Tusk, Ting-Lu, and Garganacl, since it can more effectively wallbreak with entry hazards up. Other pivots such as Scizor and Rotom-W appreciate that Dragapult's U-turn can bring them in. In return, Scizor can revenge kill Ice-types such as Chien-Pao, while Rotom-W can check both Corviknight and defensive Great Tusk. Paralysis support from Rotom-W can shutdown offensive Pokemon like opposing Dragapult and Roaring Moon. Lastly, Gholdengo makes for a good teammate, since it can spinblock and deny Defog and can help Dragapult overwhelm shared checks like Kingambit and Ting-Lu.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>Unlike its more offensively oriented Choice item sets, this Dragapult set goes for a more multifunctional approach. Dragapult's unmatched Speed tier, in conjunction with STAB Dragon Darts, allows it to snipe key offensive threats such as Roaring Moon, Iron Moth, and Cinderace with some prior chip damage. This often means that Dragapult will force a lot of switches which can be capitalized on with Will-O-Wisp to spread status and power up Hex. Will-O-Wisp also allows Dragapult to avoid Sucker Punch, which can come in handy against Cinderace, Kingambit, and Meowscarada. With a burn and Stealth Rock up, Hex 2HKOs Defensive Corviknight, Amoonguss, and Dondozo, allowing Dragapult to pick apart balanced cores. Finally, U-Turn rounds out the set, letting Dragapult keep momentum up even against hard counters like Ting-Lu and Garganacl. 252 Speed EVs with a Hasty nature ensure that Dragapult outspeeds the entire unboosted tier. 76 Attack EVs ensure an OHKO on Roaring Moon with Dragon Darts, while the rest of the EVs are put into Special Attack. Although Dragapult does not typically find itself needing to Terastallize very often, Ghost is most commonly used to power up Hex even further. For example, Tera Ghost Hex does a minimum of 84% to a burnt Defensive Great Tusk. In a pinch however, Terastallization can be used defensively to avoid OHKOs like from Chien-Pao's Ice Shard.</p> <p>Because of the amount of utility it provides, Dragapult appreciates plentiful chip damage from its teammates, as it lacks immediate power. All forms of entry hazards are greatly appreciated due to Dragapult's ability to force out the opponent, so entry hazard setters like Garganacl, Great Tusk, Glimmora and Ting-Lu form good teammates. Stealth Rock is particularly important since it secures important 2HKOs with Hex. Among the entry hazard setters, Garganacl has fantastic synergy with Dragapult, as it is able to set up Stealth Rock while also chipping down foes with Salt Cure. Partners that can spread status such as Rotom-W and Skeledirge are also excellent teammates. Since Ting-Lu and Garganacl stonewall this set, teammates that scare them out such as Offensive Great Tusk and Banded Meowscarada are great partners. Tera Flying Covert Cloak Gholdengo forms a particularly potent Ghost spam core with Dragapult, as it can turn common counters to Dragapult such as Ting-Lu, Clodsire, and Garganacl into setup fodder. Physical sweepers like Chien-Pao and Kingambit appreciate having their counters like Corviknight and Great Tusk crippled with burns and have solid type synergy with Dragapult. Due to this set being most potent in the mid- to late-game, it's more at home in teams with solid defensive backbones that can sponge hits. Defensive pokemon such as Ting-Lu, Hatterene, Great Tusk, Clodsire, and Amoonguss can all soak damage for Dragapult from common checks like Garganacl, Ting-Lu, and Kingambit while setting up entry hazards, spreading status, or dealing chip damage, allowing Dragapult to clean up later in the game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 518399, "username": "Itchy"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 40598, "username": "hamiltonion"}]}
  },
  "Meowscarada": {"sets": [{"name": "Pivot"}, {"name": "Choice Band"}, {"name": "Lead"}]},
  "Skeledirge": {"sets": [{"name": "Bulky Attacker"}, {"name": "Substitute"}]},
  "Quaquaval": {"sets": [{"name": "Bulk Up"}, {"name": "Swords Dance"}]},
  "Lokix": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Pawmot": {"sets": [{"name": "Utility"}, {"name": "Offensive"}]},
  "Maushold": {"sets": [{"name": "Skill"}]},
  "Garganacl": {
    "sets": [
      {
        "name": "IronPress",
        "description": "<p>The combination of Iron Defense + Body Press lets Garganacl serve as a bulky and dangerous setup sweeper, allowing it to beat Pokemon it otherwise loses to, such as Dragonite, Roaring Moon, and Kingambit. Salt Cure wears down common switch-ins such as Great Tusk, Gholdengo, Rotom-W, and Hatterene, as well as passive Pokemon like Toxapex and Corviknight, and forces them to burn recovery PP more often. Recover keeps Garganacl healthy throughout a game to check Pokemon like Ceruledge and Iron Moth and makes it more sustainable as a wincon. Purifying Salt prevents it from being crippled by Pokemon like Toxapex, Rotom-W, and Clodsire. It also provides a handy Ghost resistance, letting Garganacl potentially switch in on predicted Ghost-type moves from Pokemon like Dragapult and Skeledirge. Leftovers provides valuable passive recovery, reducing Garganacl's reliance on Recover. Maximum Special Defense EVs and a Careful nature maximize Garganacl's bulk, making it easier for Garganacl to switch in on Pokemon such as Iron Moth, Volcarona, and Dragapult and use them as setup fodder. Tera Water provides incredibly valuable resistances, letting Garganacl potentially check Gholdengo and Scizor while retaining its ability to pivot in on Fire-types like Cinderace. Tera Fairy allows Garganacl to turn the tables on Great Tusk while also preventing Breloom from revenge killing it. However, this does remove its resistance to Fire, making it more susceptible to Pokemon like Skeledirge and Ceruledge. Tera Ghost prevents Fighting-types like Iron Hands and Great Tusk from reliably revenge killing Garganacl, letting it use them as setup fodder. It does negate the Ghost resistance provided by Purifying Salt, however, so another switch-in to Dragapult's Shadow Ball should be used.</p> <p>Checks to strong wallbreakers like Iron Valiant and Breloom are good teammates; examples include the likes of Toxapex, Amoonguss, and Corviknight. While Garganacl is given a Ghost resistance from Purifying Salt, it cannot fully check Dragapult and Gholdengo prior to Terastallization, with the latter completely countering it if it uses Covert Cloak. As such, Pokemon like Ting-Lu and Clodsire make for great teammates. Pokemon like Corviknight and Scizor appreciate Garganacl checking Fire-types like Ceruledge and Skeledirge. Corviknight is notable in that it also forms a strong defensive core with Garganacl, checking Meowscarada for it. Entry hazard removers like Great Tusk and the aforementioned Corviknight are appreciated, as Garganacl is heavily pressured by entry hazards and cannot set up reliably if it is worn down. Frail, offensive Pokemon like Cinderace appreciate chip damage being forced onto their checks and having a strong defensive Pokemon to fall back on. Pokemon like Ting-Lu, Kingambit, and Iron Valiant can pave the way for Garganacl to clean late-game, wearing down or significantly pressuring its checks in Gholdengo, Meowscarada, and Fighting-types like Iron Hands and Great Tusk.</p> "
      },
      {"name": "Stealth Rock"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}]}
  },
  "Ceruledge": {"sets": [{"name": "Bulk Up"}, {"name": "Swords Dance"}]},
  "Kilowattrel": {"sets": [{"name": "Rain Sweeper"}]},
  "Scovillain": {"sets": [{"name": "Sun Sweeper"}]},
  "Rabsca": {"sets": [{"name": "Trick Room Setter"}]},
  "Orthworm": {"sets": [{"name": "Shed Tail Support"}]},
  "Glimmora": {"sets": [{"name": "Focus Sash"}, {"name": "Choice Scarf"}]},
  "Cetitan": {"sets": [{"name": "Slush Rush Sweeper"}]},
  "Dondozo": {
    "sets": [
      {
        "name": "Wall",
        "description": "<p>Dondozo is one of OU's premier walls, capable of shutting down dangerous setup sweepers like Roaring Moon. Liquidation is Dondozo's STAB move of choice due to its lack of recoil, but Wave Crash's power has some merit against foes like Ting-Lu, Skeledirge, and Clodsire. While weaker, Waterfall is another option that has more PP than Liquidation, allowing Dondozo to perform better against stall; however, its use case is rare. Body Press makes use of Dondozo's massive Defense stat and punishes Pokemon like Tera Normal Dragonite and Kingambit. Rest + Sleep Talk provides Dondozo with good sustainability without making it too passive, while Yawn is an option that forces out sweepers Dondozo cannot consistently deal with, like mixed Iron Valiant. On Yawn sets, Leftovers over Heavy-Duty Boots can be beneficial, as Dondozo is vulnerable when it is asleep without Sleep Talk. Grass is the preferred Tera type for eliminating Dondozo's original weaknesses; this is particularly helpful against Meowscarada and Iron Hands. Dragon, however, is an option that keeps Dondozo's resistance to Fire intact, albeit making it weak to Fairy-types like Azumarill and Iron Valiant.</p> <p>Entry hazard setters like Clodsire and Ting-Lu pair perfectly with Dondozo, playing into its desire to outlast foes long-term with chip damage in the form of entry hazards, status, or Ruination. Both also check special attackers like Iron Valiant and Gholdengo, which Dondozo tends to struggle with. Garganacl deserves a special mention as a teammate due to its ability to wear down foes with Salt Cure; it, in turn, appreciates Dondozo taking on Great Tusk and Kingambit. Hatterene provides Dondozo teams with an excellent sweeper and appreciates Dondozo taking care of physical wallbreakers like Dragapult, and Kingambit. It also can help by blocking opposing entry hazards with Magic Bounce, letting Dondozo more comfortably tank a Knock Off from Great Tusk or Iron Treads. Similarly, entry hazard removal from Corviknight or Great Tusk is also helpful; Corviknight also deals with Meowscarada, which can force Dondozo to Terastallize early. Choice Scarf Gholdengo can help pressure opposing Dondozo while dealing with Dragapult and Iron Valiant.</p> "
      },
      {
        "name": "Curse",
        "description": "<p>Curse Dondozo is a deceptively strong sweeper that provides good defensive utility before it attempts a sweep. Liquidation is preferred over Wave Crash due to its lack of recoil; however, Wave Crash is an option if a stronger STAB move is desired. Waterfall has higher PP than Liquidation, but it is usually a weaker option. Body Press makes use of Dondozo's naturally high Defense stat and Curse's boosts, while Protect lets Dondozo accumulate Leftovers recovery. However, these two moves can be dropped for the combination of Rest and Sleep Talk, which affords Dondozo greater longevity at the cost of relying on Sleep Talk to call the right move. Leftovers is preferred over Heavy-Duty Boots, as Dondozo will be on the field for many turns in a row to adequately set up with Curse; however, if a team requires it to play more defensively, Heavy-Duty Boots is fine choice. Grass is Dondozo's Tera type of choice, removing its original weaknesses while giving it an important resistance to Ground. Maximum investment in special bulk allows Dondozo to become nigh-unbreakable once it sets up.</p> <p>Entry hazard removal is key for Dondozo if it does not run Heavy-Duty Boots; good options include Great Tusk, Iron Treads, and Corviknight. Though Dondozo can have quite the offensive presence once it sets up, it is best to run it alongside consistent wallbreakers like Dragapult, Gholdengo, and Iron Valiant, which can help break open holes for it to sweep late-game. Similarly, entry hazards from teammates like Garchomp and Glimmora can facilitate Dondozo's sweep. Trick users like Meowscarada and Gholdengo can cripple Dondozo checks like Clodsire and Skeledirge, causing them to lose to Dondozo over the course of the game. While Dondozo is a great sweeper, it is far from consistent at generating setup opportunities; accordingly, it is best to pair it with another bulky sweeper like Iron Defense Garganacl or Hatterene, which can weaken or bait out answers to bulky sweepers like Trick users and Unaware Clodsire.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Clodsire": {"sets": [{"name": "Defensive"}]},
  "Kingambit": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Supreme Overlord Kingambit is a terrifying revenge killer and sweeper. Dark / Steel is a great offensive typing that can hit Pokemon such as Skeledirge, Gholdengo, Dragapult, Garganacl, and Iron Valiant super effectively as well as Great Tusk, Ting-Lu, and Corviknight neutrally. Tera Flying completely reverses Kingambit's weaknesses and resistances and can catch Pokemon looking to KO Kingambit with Fighting- and Ground-type moves like Iron Valiant and Great Tusk, off guard. Alternatively, Kingambit can opt for Tera Ghost to better counter Tera Normal Dragonite, as Earthquake becomes neutral against Kingambit and Extreme Speed is ineffective. Similarly, Tera Fairy can be chosen because Kingambit then resists Roaring Moon's Crunch, which cannot OHKO Kingambit without Tera Steel. Kingambit chooses to run 144 Speed EVs to reliably outspeed Corviknight and Swords Dance Iron Hands; the rest of its investment is in HP to maximize bulk.</p> <p>Kingambit fits very well on hyper and bulky offense teams, as it works very well coming in after its teammates have fallen, such as Iron Valiant, Gholdengo, Breloom, and Dragonite. On hyper offense particularly, Grimmsnarl and Glimmora both work as great leads that set up screens and entry hazards, respectively. Kingambit checks opposing offensive Pokemon such as Dragapult, Gholdengo, and Meowscarada thanks to its defensive typing but loses out against revenge killers such as Breloom and other threats like Calm Mind Iron Valiant, Iron Hands, Dodonzo, and Great Tusk; as such, Kingambit appreciates defensive support from Great Tusk, Skeledirge, and Rotom-W and offensive support from Iron Valiant, Gholdengo, and Dragapult.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 5542641, "username": "Coolcodename"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 540138, "username": "Milo"}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Great Tusk is the best offensive Rapid Spin user and a fantastic wallbreaker thanks to its typing, bulk, and high-Base Power STAB attacks. Great Tusk takes on a plethora of physical attackers in the tier, including Kingambit, Garchomp, and Scizor while also threatening entry hazard setters such as Glimmora, Ting-Lu, Clodsire, and Garganacl. Knock Off prevents Air Balloon Gholdengo from completely spinblocking Great Tusk, and it also removes items such as Rocky Helmet, Leftovers, and Heavy-Duty Boots from defensive Pokemon that commonly switch into Great Tusk such as Dondozo, Corviknight, and Hatterene. Ice Spinner lets Great Tusk take on Dragonite, Roaring Moon, and Garchomp more easily, though the lack of Close Combat leaves Great Tusk walled by Corviknight and Rotom-W. Maximum Speed investment paired with a Jolly nature ensures that Great Tusk is able to outspeed Rotom-W, non-Choice Scarf Gholdengo, and Jolly Dragonite. Tera Fighting makes Great Tusk much better at taking on Water-types such as Quaquaval while making Close Combat significantly harder to switch into; alternatively, Tera Steel lets Great Tusk flip its type weaknesses and take on Pokemon like Iron Valiant, and Tera Flying Roaring Moon. Heavy-Duty Boots prevents Great Tusk from being worn down by Toxic Spikes and Spikes, letting it remove entry hazards consistently throughout a match; however, Leftovers provides Great Tusk with a form of recovery. Booster Energy is a niche option that provides Great Tusk with a one-time boost to its Attack, making it an immediately threatening wallbreaker without the use of Terastallization.</p> <p>Great Tusk takes on Dark-type Pokemon such as Kingambit, and Ting-Lu, so Pokemon weak to Dark such as Dragapult, Gholdengo, Slowking, and Skeledirge appreciate Great Tusk; Slowking and Dragapult in particular are able to pivot in Great Tusk with Chilly Reception and U-turn, respectively. Great Tusk is also able to take on entry hazard setters such as Ting-Lu and Garchomp and remove entry hazards from the field, so Pokemon that can be overwhelmed by hazards such as Dondozo, Ting-Lu, and Garganacl appreciate Great Tusk's presence. Great Tusk struggles to take on faster special attackers such as Iron Valiant, Dragapult, and Volcarona, so special walls such as Clodsire, Ting-Lu, and Toxapex are great partners. Great Tusk also has difficulty with physical walls such as Dondozo, Tera Water and Tera Fairy Garganacl, and Tera Fairy Skeledirge. Spikes support from Ting-Lu, Glimmora, and Garchomp wears down these checks into range of Great Tusk's attacks, especially when paired with Knock Off. Wallbreakers such as Choice Specs Iron Valiant, Gholdengo, Iron Hands, and Breloom make for good partners by being able to overwhelm shared checks; Gholdengo is a noteworthy wallbreaker for also blocking opposing hazard removal. Torkoal is also an excellent partner for Great Tusk, setting up the sun to activate Protosynthesis and weaken Water-type attacks, while supporting other wallbreakers that can pressure the aforementioned physical walls, such as Choice Band Roaring Moon, Scovillain, and Slither Wing.</p> "
      },
      {
        "name": "Physically Defensive",
        "description": "<p>Great Tusk has a solid niche as a defensive Pokemon by virtue of its utility, movepool, bulk, and typing. It can adequately check Pokemon like Kingambit, Cinderace, and Iron Hands, threatening them with a strong Earthquake in return. Stealth Rock lets Great Tusk compress even more roles, chipping away at the opposition. If another Stealth Rock user is already on the team, however, Body Press can take advantage of its high Defense stat and better threaten the likes of Ting-Lu and Roaring Moon. Body Press also lets Great Tusk catch Rotom-W with greater chip damage than Knock Off does on the switch. Knock Off provides valuable item removal, getting rid of Leftovers from Pokemon like Dondozo, Corviknight, and Hatterene, as well as Heavy-Duty Boots from Volcarona and Dragonite. Additionally, Knock Off is Great Tusk's only initial way to hit Air Balloon Gholdengo, which can't OHKO this defensive set. Rapid Spin, besides clearing entry hazards, also allows Great Tusk to outspeed faster foes like Focus Sash Glimmora and Gholdengo. Tera Fighting gets rid of Great Tusk's Ground typing, giving it a better matchup against Pokemon like Quaquaval and Floatzel while also strengthening Body Press if it is used. Alternatively, Tera Steel can give Great Tusk valuable resistances to Fairy, and Grass, turning the tables on Hatterene and Meowscarada. Leftovers greatly increases Great Tusk's longevity; however, Rocky Helmet can be used to wear down Pokemon like Scizor and Cinderace over time.</p> <p>After Great Tusk sets Stealth Rock, Corviknight effortlessly switches in and uses Defog to remove entry hazards, so Pokemon like Cinderace, Gholdengo, and Rotom-W that handle it are great partners. With no good way to hit Flying-types and Pokemon that use Tera Flying, Great Tusk can be set up on very quickly, most notably against the likes of Dragonite and Roaring Moon;even though the former dislikes Knock Off. Therefore, checks to these such as Dondozo and Corviknight are appreciated. A different Stealth Rock setter like Garganacl or Ting-Lu lets Great Tusk comfortably run Body Press without losing out on anything major. Ting-Lu also forms a potent entry hazard-stacking core with Great Tusk via Spikes. Further, it takes on the special attackers that Great Tusk struggles with, like Gholdengo, Choice Specs Dragapult, and Volcarona. Great Tusk is forced out by wallbreakers like Iron Valiant and Quaquaval, so teammates that can check them like Amoonguss and Toxapex are welcome. Pokemon like Ceruledge, and Iron Moth appreciate the entry hazard removal that Great Tusk provides. Great Tusk's defensive qualities greatly help frail wallbreakers like Dragapult, and Iron Valiant, as these Pokemon need strong defensive Pokemon to fall back on very often.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>The combination of high Attack, powerful STAB moves, a decent movepool, and well-rounded physical bulk allows Great Tusk to function as a strong physical wallbreaker. It can support teams offensively with Knock Off and Rapid Spin as well as defensively through its ability to check Kingambit, Cinderace, and Choice Band Roaring Moon. Its dual STAB moves are able to OHKO or severely damage several key offensive Pokemon in the metagame such as Kingambit, and Tera Normal Dragonite. Knock Off allows Great Tusk to remove Leftovers from walls such as Corviknight and Dondozo. It can also remove important items from more offensive Pokemon, such as Heavy-Duty Boots from Dragonite, Volcarona, and bulky pivot Roaring Moon, and it can provide coverage against Air Balloon Gholdengo, which otherwise checks this set. Ice Spinner hits Dragon-types that Headlong Rush isn't as strong against like bulky Garchomp and Dragonite. Alternatively, Rapid Spin can be run if the team is still in need of entry hazard removal. With Tera Fighting, Close Combat becomes much stronger, guaranteeing OHKOs against offensive Scizor sets. Tera Fighting also improves Great Tusk's matchups against Dondozo, Rotom-W, and opposing Great Tusk. With Tera Steel, Great Tusk can better handle Grass- and Fairy-types such as Meowscarada and Hatterene, and it can also shrug off attacks it normally can't, such as Meowscarada's Flower Trick and Dragapult's Draco Meteor. When running Great Tusk on sun teams, an alternate EV spread making Speed its highest stat can be considered due to Protosynthesis boosting Speed; this allows Great Tusk to outspeed otherwise faster Pokemon like Dragapult, and Choice Scarf Gholdengo.</p> <p>Rotom-W, Skeledirge, and Torkoal make for good teammates, since their status spreading can help weaken foes and help Great Tusk wallbreak more efficiently. Rotom-W is able to paralyze faster Pokemon such as Iron Valiant and boosted Quaquaval, allowing Great Tusk to outspeed them. Skeledirge is able to spread burn, capitalize on foes afflicted with status with a boosted Hex, and check Iron Valiant sets lacking Shadow Ball. Lastly, Torkoal is able to force switches thanks to Yawn, spread status with Lava Plume, and set up sun to make Great Tusk an even scarier wallbreaker. Great Tusk appreciates entry hazard support from the likes of Garganacl and Ting-Lu, since it can wallbreak more easily thanks to the chip damage they provide. Great Tusk is able to keep their hazards up in exchange while simultaneously removing hazards set by foes. Sweepers that are vulnerable to hazards like Iron Moth and Tera Flying Roaring Moon appreciate Great Tusk being able to remove hazards and beat walls such as Ting-Lu, allowing them to sweep more easily late-game. Lastly, other offensive Pokemon such as Kingambit and Dragonite make for good partners, since Great Tusk is able to weaken or cripple their common checks in Iron Valiant.</p> "
      },
      {
        "name": "Bulk Up",
        "description": "<p>Bulk Up Great Tusk can act as both a defensive backbone and a potential late-game sweeper, able to set up in front of Pokemon such as Dragonite, Iron Treads, Cinderace, Dragon Dance Dragapult, and opposing Great Tusk. Knock Off provides item removal against defensive walls like Dondozo and Corviknight, as well as coverage against Air Balloon Gholdengo that would otherwise wall Great Tusk. Rapid Spin lets Great Tusk provide entry hazard removal for the team in games where it would not be able to win with Bulk Up, while allowing it to boost its Speed in games where it can sweep with Bulk Up. Body Press is another option that gives Great Tusk a way to more immediately hit Dark-types such as Meowscarada, Roaring Moon, and Ting-Lu. Tera Water turns Great Tusk's Water and Ice weaknesses into resistances, allowing it to better take hits from Azumarill, Quaquaval, and Floatzel. On the other hand, Tera Steel lets Great Tusk take on Grass-type attacks such as Breloom's Bullet Seed and Meowscarada's Flower Trick, Flying-type attacks like Roaring Moon's Acrobatics, and if need be, Fairy-type attacks such as Iron Valiant's Moonblast.</p> <p>Bulk Up Great Tusk appreciates specially defensive teammates like Toxapex and Garganacl that can help play around fast special attackers such as Choice Specs Iron Valiant and Choice Specs Dragapult. In return, Garganacl and Toxapex appreciate the presence of a Terastallized Great Tusk as they can get overwhelmed by Kingambit and Belly Drum Azumarill. Teammates such as Gholdengo, Iron Valiant, and Dragapult can help break through physically defensive Pokemon like Rotom-W, Dondozo, and Skeledirge that Bulk Up Great Tusk can struggle against. Gholdengo in particular is a great partner, as it can struggle against Cinderace and Dragonite, both of which Great Tusk covers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 277988, "username": "dex"}, {"user_id": 487308, "username": "BT89"}, {"user_id": 554264, "username": "Coolcodename"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 109385, "username": "Aurora"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 548068, "username": "SetsuSetsuna"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 595062, "username": "Takatk"}]}
  },
  "Scream Tail": {"sets": [{"name": "Defensive"}]},
  "Brute Bonnet": {"sets": [{"name": "Offensive"}]},
  "Slither Wing": {"sets": [{"name": "Defensive"}, {"name": "Choice Band"}]},
  "Sandy Shocks": {"sets": [{"name": "Choice Specs"}]},
  "Iron Treads": {"sets": [{"name": "Offensive"}, {"name": "Utility"}]},
  "Iron Hands": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Iron Jugulis": {"sets": [{"name": "Choice Specs"}]},
  "Iron Moth": {"sets": [{"name": "Offensive"}, {"name": "Booster Energy"}]},
  "Iron Thorns": {"sets": [{"name": "Offensive"}]},
  "Baxcalibur": {"sets": [{"name": "Offensive"}]},
  "Gholdengo": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Gholdengo utilizes its high Special Attack and its great offensive typing to become a fast revenge killer. Gholdengo can effectively hit offensive threats such as Dragapult and Iron Valiant with its STAB moves. Trick allows Gholdengo to cripple defensive Pokemon such as Dodonzo, Corviknight, and Clodsire. Its typing also allows it to switch into foes such as Iron Valiant and Iron Hands in a pinch, as it either resists or is immune to most of their attacks. Focus Blast is ideal for Gholdengo to hit Kingambit and other foes such as a weakened Ting-Lu, but Nasty Plot can be run instead to take advantage of stopping defensive Pokemon with Trick and having a free turn to set up and do a great amount of damage. Recover can also be run, taking a more defensive approach to give Gholdengo a free turn to heal. Gholdengo prefers Fighting as a Tera type, as it removes its prior weaknesses, meaning it is not threatened by Kingambit's Sucker Punch or Skeledirge's Torch Song. It also boosts the power of Focus Blast, reliably removing the former. To counter different foes, Gholdengo can instead opt for Tera Flying to have better ground against Great Tusk and Iron Treads.</p> <p>Teammates such as Kingambit and Iron Valiant appreciate Gholdengo's offensive pressure, as it can help against shared checks such as Great Tusk and Amoonguss. With this role, Gholdengo prefers to have a clean switch after a teammate has fainted in order to pressure the opponent. Similarly, entry hazard setters such as Garchomp, Garganacl, and Ting-Lu appreciate Gholdengo for its Good as Gold ability and its Ghost typing, preventing all forms of hazard removal excluding Court Change. Gholdengo is mainly vulnerable to priority moves such as Kingambit's Sucker Punch. Dragonite also presents an issue for it with Multiscale in conjunction with Earthquake, not to mention it can set up twice in front of Gholdengo. This can be avoided with a carefully timed Trick or help from defensive Great Tusk and Skeledirge. Similarly, depending on its Choice lock, Roaring Moon and Cinderace can take advantage of Gholdengo with Crunch and Sucker Punch, respectively. As a result of this, Garchomp and Garganacl pair well with Gholdengo, acting as a defensive backbone with type advantage and great bulk. Iron Valiant can be a great revenge killer against these threats with great Speed and coverage.</p> "
      },
      {
        "name": "Air Balloon",
        "description": "<p>Thanks to its great typing and Good as Gold, Gholdengo is a setup sweeper that's notably difficult to deal with. Having an additional Ground immunity with Air Balloon further improves Gholdengo's already great typing, letting it switch in on Pokemon that otherwise threaten it, such as Garchomp and Iron Treads. This is especially useful against the latter, as Air Balloon strengthens Gholdengo's ability to block entry hazard removal. Maximum Speed investment is for outspeeding Dragonite and uninvested Great Tusk. 252 Special Attack EVs and Nasty Plot makes Gholdengo's STAB moves very threatening against neutral foes. Fighting and Dark Tera types give Gholdengo the option to Terastallize defensively; notably, Tera Fighting lessens the impact of moves like Crunch from Roaring Moon. Tera Dark is useful in a pinch to resist attacks such as Shadow Ball from Dragapult and opposing Gholdengo.</p> <p>Entry hazard setters like Great Tusk and Glimmora are the most profitable teammates for Gholdengo, as its ability and typing ensure that their entry hazards stay around as long as Gholdengo does. Hyper offense staples such as Iron Valiant benefit greatly from the constant presence of entry hazards to break down bulkier cores; in return, Gholdengo gets teammates that synergize with its role as a wallbreaker, applying heavy pressure throughout a game to Pokemon like Ting-Lu and Rotom-W. Offensive Pokemon that outspeed and OHKO Gholdengo, such as Cinderace, Roaring Moon, and Knock Off variants of Great Tusk, threaten to completely shut down Gholdengo; defensive teammates like Garganacl, Dondozo and Skeledirge can help mitigate some of these weaknesses.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Gholdengo can utilize its natural bulk, great typing, and immunity to status moves for a more defensive role on balance and stall teams. It can switch into several key offensive threats such as Iron Valiant, Scizor and Breloom and completely shut down multiple defensive Pokemon such as Amoonguss and Corviknight. With Good as Gold, Gholdengo can act as a reliable means of spinblocking and denying Defog. Recover provides Gholdengo with a means of improving its longevity, letting it switch into the aforementioned threats multiple times throughout a match. Thunder Wave allows Gholdengo to cripple threats it can lure in, like Iron Moth and Roaring Moon. Gholdengo can capitalize on the status it spreads with Hex, letting it deal high damage once its targets have been paralyzed. Gholdengo can take advantage of switches it forces by setting up Nasty Plot, letting it exert a high offensive threat level, and enabling it to win potential stalemates against bulkier Pokemon such as Corviknight and Dondozo. Alternatively, Make It Rain can be used to immediately KO Garganacl and Iron Valiant. Tera Flying improves Gholdengo's matchups against Ground-types like Great Tusk and Iron Treads. This completely flips the matchup in Gholdengo's favor, as it can use them as a point of entry to set up Nasty Plot. Tera Fairy, on the other hand, grants Gholdengo a resistance to Dark-type attacks, allowing it to survive Crunch from Roaring Moon and paralyze it with Thunder Wave. Gholdengo's item choice is quite flexible and largely depends on its team structure. Leftovers offers passive recovery, which is quite valuable to preserve Recover PP. Covert Cloak grants Gholdengo an immunity to the secondary effects of various moves, allowing it to counter Garganacl by nullifying the chip damage from Salt Cure. It is also useful to allow Gholdengo to switch into a wider pool of moves, like Hatterene's Nuzzle, with far less risk. Heavy-Duty Boots nullifies entry hazard damage, allowing Gholdengo to switch in and out with little issue. A physically defensive EV spread allows Gholdengo to more reliably check Pokemon such as Garganacl, Corviknight, and Scizor.</p> <p>Defensive Gholdengo fits on a variety of teams, but it particularly shines on balance and stall teams. Its ability to nullify most forms of hazard control is most useful to entry hazard setters such as Garchomp, Ting-Lu, and Great Tusk. These Pokemon also appreciate Gholdengo's ability to check Hatterene, which can bounce back hazards with Magic Bounce. If Gholdengo is utilizing Covert Cloak, it will be a great teammate to Pokemon like Dodonzo, Toxapex, and Corviknight, which struggle against Garganacl due to Salt Cure. Gholdengo can pivot into many key status moves such as Will-O-Wisp and is therefore a great ally to Pokemon that are common targets of them, such as Dragonite, Great Tusk, and Meowscarada. When not running Tera Flying, Ground-types like Great Tusk, Ting-Lu, and Clodsire can use Gholdengo as an entry point to either deal high damage to it with Earthquake or set up entry hazards. Corviknight is thus a great partner, as it can switch into them with ease and clear entry hazards they may set up with Defog. Hatterene is another good teammate, since it can completely shut down attempts to set up entry hazards with Magic Bounce. Gholdengo is also quite vulnerable to a few other offensive threats, such as Volcarona, Cinderace, and Kingambit, so bulky Water-types like Dondozo and Toxpaex can switch into these Pokemon and prevent setup via Unaware and Haze, respectively, which Gholdengo will greatly appreciate. Garchomp and Great Tusk can switch into Cinderace and Kingambit and threaten them out with Earthquake, and they can also benefit from Gholdengo's Thunder Wave support, allowing them to more reliably check Cinderace and Iron Moth.</p> "
      },
      {"name": "Choice Specs"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 487308, "username": "BT89"}, {"user_id": 554264, "username": "Coolcodename"}, {"user_id": 197439, "username": "chimp"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 359575, "username": "Nichalho"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 177111, "username": "Magcargo"}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "Defensive Hazards",
        "description": "<p>Ting-Lu is an incredible entry hazard setter for bulky offense and balance teams alike thanks to its combination of gargantuan defensive stats, good utility movepool, and an amazing defensive ability in Vessel of Ruin. It also has a great typing that lets it answer threats such as Gholdengo, Choice Specs Dragapult, Iron Moth, and Ceruledge. Whirlwind is incredibly useful for thwarting setup Pokemon like Roaring Moon and Volcarona. Ruination lets Ting-Lu deal consistent damage to bulky Pokemon like Corviknight, Rotom-W, and Hatterene. Tera Poison lets Ting-Lu act as an answer to Iron Valiant while giving it an immunity to poison damage from Clodsire’s Toxic and letting it absorb Toxic Spikes from the likes of Glimmora and Iron Moth. Meanwhile, Tera Fairy is a generally solid defensive typing, letting it more reliably check Pokemon such as Dragapult and Great Tusk. Maximum Special Defense, in tandem with Ting-Lu's ability, makes it a more consistent check to special attackers such as Choice Specs Dragapult and Volcarona.</p> <p>Ting-Lu’s premier defensive profile makes it most proficient on bulky offense and balance teams that can supply enough offensive momentum to make up for Ting-Lu’s relative passivity. Pokemon that can supplement offensive prowess to make up for Ting-Lu's passivity such as Iron Valiant and Kingambit make for excellent partners, as they can assist against threats like opposing Iron Valiant, Dondozo, and Great Tusk. Without Ruination, Ting-Lu is utterly helpless against Corviknight, so Pokemon that can threaten it such as Gholdengo and Cinderace make for excellent partners. Bulky Water-types like Dondozo and Toxapex appreciate Ting-Lu's immunity to Electric while being quite helpful against Pokemon like Kingambit and Quaquaval in return. Other defensive Pokemon like Garganacl and Corviknight also make for excellent partners, being helpful against Pokemon like Scizor while appreciating Ting-Lu’s ability to check Gholdengo and Choice Specs Dragapult. Additional entry hazard setters such as Garganacl and Great Tusk allow Ting-Lu to fit Ruination into its moveset more capably, so it is less passive in the face of Ground-immune threats like Corviknight and Air Balloon Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 487306, "username": "BT89"}]}
  },
  "Roaring Moon": {
    "sets": [
      {
        "name": "Booster Energy",
        "description": "<p>Dragon Dance Roaring Moon is one of the tier's most threatening late-game setup sweepers due to its high offensive stats, strong coverage moves, and decent bulk. Earthquake is a strong, consistent coverage option that hits Kingambit, Garganacl, Iron Hands, and Clodsire super effectively. Roost, on the other hand, gives Roaring Moon access to reliable recovery, which gives it more setup opportunities throughout the game even if its Booster Energy is already used up. Acrobatics has fantastic coverage, as it hits Great Tusk, Iron Valiant, and Breloom super effectively and should always be run alongside Tera Flying to maximize its power. Iron Head is a viable alternative to Acrobatics and should always be run alongside Tera Steel, as it deals with Fairy-types like Iron Valiant and Hatterene simultaneously. Tera Flying removes all of Roaring Moon's baseline weaknesses bar Ice, gives it a resistance to Fighting- and Bug-type attacks, a Ground immunity, and a STAB boost to Acrobatics. Tera Steel, though more niche, allows Roaring Moon to resist Hatterene's Dazzling Gleam, Scizor's Bullet Punch, and Tera Normal Dragonite's Extreme Speed. A Jolly nature is typically run to outspeed Booster Energy Iron Valiant after a Dragon Dance, but Adamant is a decent alternative, particularly on teams that allow Roaring Moon to obtain more than one Dragon Dance boost. After a Dragon Dance, Adamant Roaring Moon can more easily OHKO defensive variants of Gholdengo and Great Tusk.</p> <p>Dragon Dance Roaring Moon best functions on offensive teams, pairing well with setup sweepers that can wear down each other's checks. Iron Valiant can opt out of running Psyshock, since Roaring Moon breaks past Clodsire for it, and Breloom can more effectively utilize its STAB moves and Spore once Roaring Moon eliminates Gholdengo. Dondozo and Tera Fairy Skeledirge are major threats to Roaring Moon due to their ability to ignore its boosts with Unaware, while strong priority users like Dragonite and Breloom can revenge kill Roaring Moon thanks to its low Defense. Ting-Lu can force Roaring Moon out with Whirlwind, and Choice Band Iron Hands survives a boosted Earthquake from full health and can OHKO Roaring Moon with Close Combat. Iron Valiant offers immediate damage against Dondozo, Iron Hands, and Ting-Lu due to its excellent mixed coverage. Offensive Great Tusk and Technician Breloom can help wear down Ting-Lu with their super effective STAB moves, and Breloom's Technician-boosted Bullet Seed can also break past Dondozo. Grimmsnarl's ability to set up dual screens allows Roaring Moon to set up multiple Dragon Dances and survive attacks from Dragonite. Orthworm is a niche option that sets entry hazards and provides a slow Shed Tail to get Roaring Moon in safely behind a Substitute, allowing for much easier setup opportunities against opposing status users like Rotom-W and protecting it from priority moves from Dragonite and Breloom.</p> "
      },
      {"name": "Choice Band"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "lunaflare"}]}], "writtenBy": [{"user_id": 408271, "username": "Dreadfury"}]}
  },
  "Iron Valiant": {
    "sets": [
      {"name": "Choice Specs"},
      {
        "name": "Mixed",
        "description": "<p>High attacking stats and a wide array of coverage moves make Iron Valiant a devastating mixed attacker that can 2HKO common defensive walls physically and specially; Moonblast and Thunderbolt threaten physically defensive Pokemon like Great Tusk, Corviknight, and Dondozo, while Close Combat and Psyshock deal with specially defensive foes like Ting-Lu and Clodsire. Its Quark Drive-boosted Speed from Booster Energy turns it into a potent late-game cleaner, letting it outspeed would-be revenge killers like Dragapult, and Choice Scarf Gholdengo, which is further enforced by its unique typing that resists Sucker Punch from Kingambit. However, it can also be used to revenge kill boosted threats like Baxcalibur and Dragonite in a pinch, especially since Iron Valiant can take on the latter's +1 Tera Normal Extreme Speed from full health. Tera Fairy boosts Iron Valiant's Moonblast while still retaining its defensive profile to take on Sucker Punch. Alternatively, Tera Electric amplifies Thunderbolt's damage, notably allowing it to 2HKO would-be checks like Toxapex, specially defensive Dondozo and Tera Water Garganacl, and offensive Gholdengo after Stealth Rock, as well as preventing Iron Valiant from being revenge killed by Scizor's Bullet Punch.</p> <p>Mixed Iron Valiant is commonly seen on offense and bulky offense teams. Due to the lack of a damage boosting item or setup move, it can still fall short of threatening bulky Pokemon like Amoonguss, and without Shadow Ball or Knock Off, Skeledirge and defensive Gholdengo as well; thus, Pokemon that can deal with them such as Great Tusk, and Kingambit make good teammates. Particularly, the aforementioned Pokemon can overwhelm a shared check in Corviknight and are generally effective as early-game wallbreakers that can open up Iron Valiant to clean up late-game easily. Entry hazards from teammates like Garchomp, Ting-Lu, and Glimmora can chip down foes like Garganacl, Amoonguss, and Tera Grass Dondozo. A sturdy defensive backbone with the likes of Corviknight and Ting-Lu can help check offensive threats that threaten Iron Valiant out, such as a boosted Roaring Moon, opposing Iron Valiant, and Gholdengo. Pivots like Dragapult, Scizor, and Rotom-W can compensate for Iron Valiant's lack of bulk by bringing it in safely on foes like Ting-Lu, Great Tusk, and Blissey, respectively; the latter can also cripple Amoonguss with either Trick or Will-O-Wisp. Gholdengo is a great partner, as it reliably prevents the much-needed entry hazards from being removed by Rapid Spin and Defog, threatens Skeledirge and Tera Fairy Garganacl, and appreciates Iron Valiant dealing with foes like Corviknight and Dark-types like Ting-Lu, Kingambit, and Roaring Moon in return.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Iron Valiant utilizes a deadly combination of offensive power, coverage, and Speed to function as one of the best sweepers in OU. After a Quark Drive boost, Iron Valiant outspeeds and OHKOes a plethora of premier offensive threats in the tier, such as Dragapult, Meowscarada, and Roaring Moon. Thunderbolt allows Iron Valiant to damage Corviknight and bulky Water-types like Dondozo, Azumarill, Toxapex, and Tera Water Garganacl, while Psyshock scores a 2HKO on any Clodsire looking to stop Iron Valiant's sweep. With Calm Mind, Iron Valiant can switch roles from an endgame sweeper to a powerful wallbreaker. After one Calm Mind, Moonblast 2HKOes defensive Garganacl, and +1 Tera Electric Thunderbolt 2HKOes specially defensive Slowking and OHKOes Corviknight. Tera Fairy powers up Moonblast, which can now 2HKO Garganacl and Hatterene. Tera Electric boosts the power of Thunderbolt, which secures important 2HKOs on specially defensive Dodonzo, Corviknight, and Toxapex, lets Iron Valiant survive Scizor's Bullet Punch, and grants Iron Valiant an immunity to paralysis from Hatterene's Nuzzle.</p> <p>Iron Valiant relies heavily on its super-effective coverage moves for damage output. As a result, it struggles to make progress against Pokemon like Volcarona, Skeledirge, and Gholdengo. Thus, teammates like Clodsire and Ting-Lu are good defensive partners for Iron Valiant, with the added benefit of being able to set up entry hazards. Iron Moth has strong offensive synergy with Iron Valiant, being able to threaten Amoonguss, Iron Treads, and Tera Fairy Garganacl, while also being able to chip down special walls like Clodsire. On offense teams, Iron Valiant complements powerful wallbreakers like Nasty Plot Gholdengo, and Kingambit, since they can overwhelm defensive cores and open up the path for Iron Valiant to sweep. Finally, Iron Valiant is highly reliant on Booster Energy to sweep, as it cannot normally outspeed common revenge-killers like Dragapult, Cinderace, and Meowscarada. Therefore, it is important to time when to switch in to Iron Valiant to ensure defensive counters like Skeledirge and Volcarona are either removed or heavily damaged so it can sweep or break through the opposing team effectively. Along these lines, it is important to conserve Iron Valiant's health, since it can survive key priority moves such as Extreme Speed from Tera Normal Dragonite after a Dragon Dance. Therefore, Pokemon that can remove entry hazards, such as Great Tusk and Iron Treads, are great teammates for Iron Valiant.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}, {"user_id": 277988, "username": "dex"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 430518, "username": "lunaflare"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 40598, "username": "hamiltonion"}]}
  }
}