{
  "Venusaur": {"sets": {"Chlorophyll Sweeper": {}, "Tank": {}}},
  "Charizard": {
    "sets": {
      "Drought Wallbreaker": {
        "description": "<p>Mega Charizard Y's immense power combined with Drought makes it an extremely dangerous wallbreaker that threatens common defensive staples like Alomomola, Melmetal, and Ferrothorn while also supporting its teammates via sun. Weather Ball is the preferred Fire-type STAB move, as it is perfectly accurate, quite powerful, and 2HKOs Pelipper in the rain after Stealth Rock. However, Fire Blast can be used to get better damage rolls onto Garchomp and defensive Landorus-T while also hitting Kommo-o through Bulletproof. Solar Beam provides crucial coverage for Water-types, such as Alomomola, Slowbro, and Rotom-W. Scorching Sands allows Mega Charizard Y to hit Heatran, Toxapex, and Mega Tyranitar super effectively; it also pressures them with burns, which is also useful against other switch-ins, such as Kommo-o and Garchomp. On the other hand, Focus Blast is far more threatening to Mega Tyranitar and still hits Heatran, but it leaves Mega Charizard Y struggling to pressure Toxapex. Roost allows Mega Charizard Y to stay healthy throughout a match; this is important given its extreme vulnerability to Stealth Rock.</p> <p>Entry hazard removal is absolutely imperative when using Mega Charizard Y due to its 4x weakness to Stealth Rock. Great Tusk is a standout partner that can clear hazards while also benefitting from Mega Charizard Y's sun due to Protosynthesis. It also offensively pressures common Mega Charizard Y switch-ins, like Mega Tyranitar and Toxapex. A secondary form of entry hazard removal, such as Terapagos or Defog Kartana, is required as well. Raging Bolt is another notable beneficiary of Mega Charizard Y, as it appreciates sun boosting its Special Attack and gaining access to a powerful Fire-type Weather Ball that lets it pressure Ferrothorn and Assault Vest Kingambit. Hisuian Samurott is also a good teammate due to it being able to set Spikes to wear down Mega Charizard Y’s checks, such as Toxapex and Garchomp; in return, Mega Charizard Y threatens Clefable and Ferrothorn for Hisuian Samurott. Mega Charizard Y also appreciates Future Sight support from Slowbro and Galarian Slowking. This is especially potent with Focus Blast variants, as common Future Sight switch-in Mega Tyranitar does not want to take a Focus Blast, and it allows these variants to overcome their lack of coverage for Toxapex. They, along with Alomomola, can also function as slow pivots to get Mega Charizard Y in safely. Faster offensive threats such as Zamazenta appreciate Mega Charizard Y wallbreaking for them early so they can potentially clean up late-game. Kingambit is another great partner that can Pursuit trap foes that are problematic for Mega Charizard Y, most notably Mega Latios and Mega Latias, while also removing items from Moltres and Toxapex.</p>"
      },
      "Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Nidoking": {"sets": {"Wallbreaker": {}}},
  "Clefable": {
    "sets": {
      "Utility": {
        "description": "<p>Clefable is a standout utility piece, possessing a wide variety of utility options along with incredible longevity due to its immunity to entry hazards as well as Toxic from the likes of Alomomola and Toxapex through Magic Guard; this invulnerability to common forms of chip damage allows it to serve as a sturdy check to the likes of Mega Lopunny and Hisuian Samurott for many teams. Clefable is a good user of Stealth Rock due to its positive matchups versus most hazard removal options such as Great Tusk, Terapagos, and Zapdos. Thunder Wave cripples Pokemon that may try to switch in on Clefable, such as Mega Charizard Y and Mega Scizor, allowing for them to be more easily handled. Thunder Wave Clefable also pairs nicely with Hex Gholdengo. Knock Off is Clefable’s most spammable move, removing the items of key targets like Heatran, Ferrothorn, Melmetal, and Toxapex. Leftovers is the item of choice on Clefable to help it check Mega Lopunny and Dragonite in the long term while also helping it avoid a 2HKO from Great Tusk’s Headlong Rush. Leftovers also prevents the need for Clefable to waste Soft-Boiled PP in order to stay healthy.</p> <p>Clefable fits on balance and bulky offense teams, where its longevity, useful role compression and ability to stave off physical attackers like Zamazenta and Hisuian Samurott are valuable. Pokemon like Kingambit and Terapagos appreciate Clefable checking threats like Dragonite, Mega Lopunny, and Urshifu-R and removing items from their checks such as Ferrothorn and Toxapex. Clefable also forms a terrific core with Spikes setters like Ferrothorn and Hisuian Samurott, as it sets up Stealth Rock to further the chip damage of Spikes and removes Heavy-Duty Boots from Pokemon like Zapdos and Terapagos. Although Clefable has solid longevity, its bulk is less than desirable to be a sole check to threats like Mega Medicham and Garchomp. As such, Pokemon that reinforce its defenses such as Mega Latias and Great Tusk are helpful teammates. Clefable also has issues with a myriad of Steel-types, such as Melmetal, Gholdengo, Kingambit, and Mega Scizor. Teammates that help with these threats, like Zamazenta, Zapdos, and Volcarona, are appreciated.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Clefable serves as a resilient setup sweeper, taking advantage of its bulk, excellent defensive typing, and useful abilities in Magic Guard and Unaware. Magic Guard notably provides Clefable with an extremely valuable immunity to entry hazards, in addition to negating Toxic from the likes of Gliscor and acting as a status absorber for the rest of the team, especially if it has already been poisoned. Unaware makes it a strong check to foes that rely on boosting their stats like Swords Dance Garchomp and Bulk Up Great Tusk. Calm Mind boosts allow Clefable to check additional threats like Mega Diancie, making it much less passive against most foes. Moonblast's Special Attack drop chance makes Clefable even harder to break for foes like Tapu Lele. Knock Off removes key items like Leftovers and Heavy-Duty Boots from foes that are not threatened by even boosted Moonblast, such as Toxapex, Heatran, and Volcarona. Alternatively, Flamethrower targets Steel-types, such as Mega Scizor and Gholdengo, and Thunder pressures walls like Corviknight and Toxapex while hitting Heatran for neutral damage, although its accuracy can be unreliable. Thunder is preferred over Thunderbolt thanks to its higher paralysis chance and damage, but the latter is also a viable option. Soft-Boiled is required to provide Clefable reliable and immediate recovery. Leftovers is another source of longevity, providing passive recovery for longer matchups. Life Orb enables valuable damage rolls, like 2HKOing Ting-Lu with one boosted Moonblast and OHKOing Urshifu-R with unboosted Moonblast, and additionally has no drawback thanks to Magic Guard. If Clefable's ability is Unaware, then Heavy-Duty Boots is required to protect it from Spikes and particularly Toxic Spikes, which is important for its setup sweeper role and its ability to check the opposing setup sweepers mentioned above.</p> <p>Clefable fits on balance teams that appreciate its ability to set up on physical threats like non-Heavy Slam Zamazenta and act as a bulky wincon. Pokemon like Mega Tyranitar and Kingambit appreciate Clefable's ability to pressure foes like Mega Medicham, Mega Lopunny, and Dragonite. In return, Mega Tyranitar pressures troublesome walls for Clefable, such as Galarian Slowking and Heatran, and sets up Stealth Rock, while Kingambit threatens checks like Gholdengo and Galarian Slowking. Entry hazards like Stealth Rock and Spikes synergize incredibly with Clefable, as they help it secure KOs more reliably and clean up late-game, wearing down checks like Heatran. Therefore, entry hazard setters like Ferrothorn, Ting-Lu, and Gliscor are solid partners. Gliscor, in particular, is also capable of crippling the opposing team with Knock Off and removing items like Heavy-Duty Boots from Zapdos. Gliscor also helps Clefable by absorbing Knock Off and status for Unaware Clefable. There are a few Steel-type Pokemon that can take on boosted Moonblast effortlessly, such as Heatran, Melmetal, and Gholdengo. As a result, Clefable appreciates teammates that threaten these Pokemon, such as Great Tusk, Mega Lopunny, and Volcarona. Despite Clefable's great bulk, it still has trouble setting up in front of offensive Steel-types like Kingambit and Mega Scizor; therefore, defensive checks like Zamazenta and Zapdos are great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}, {"user_id": 658067, "username": "Ineros"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}, {"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Ninetales": {"sets": {"Sun Setter": {}}},
  "Slowbro": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Slowbro takes advantage of its stellar physical bulk, Regenerator, and Teleport to act as an excellent bulky pivot. Scald is preferred for its good chance to permanently hinder most physical attackers such as Mega Scizor and Landorus-T while also deterring foes like Zapdos and Gholdengo. Body Press can be used while holding a Colbur Berry to survive a hit from Mega Tyranitar, Kingambit, and Hisuian Samurott, allowing Slowbro to retaliate with Body Press. Future Sight is used in combination with Teleport to help offensive teammates such as Mega Lopunny, Urshifu-R, and Zamazenta break Pokemon like Toxapex and Alomomola. Thunder Wave is an alternative to Slack Off that punishes Pokemon such as Volcarona and Ogerpon-W that attempt to set up in front of Slowbro and permanently hinders switch-ins like Tapu Lele and Tornadus-T that Slowbro otherwise struggles against. Heavy-Duty Boots affords Slowbro much more freedom to pivot, while Rocky Helmet punishes weak contact moves, such as Landorus-T's U-turn, and resisted hits from Pokemon such as Urshifu-R and Mega Medicham.</p> <p>Slowbro fits best on balance and bulky offense teams that feature Pokemon such as Urshifu-R and Zamazenta that benefit from its Future Sight and pivoting capabilities while answering Kingambit and Hisuian Samurott, which Slowbro struggles to beat. Slowbro can also be paired with fellow Regenerator users such as Tornadus-T to form a double Regenerator core, with Tornadus-T answering Grass-type Pokemon such as Kartana and Ogerpon-W. Teammates like Ferrothorn and Gliscor can help against Tapu Koko and Raging Bolt, which Slowbro struggles against. In return, Slowbro deals with Urshifu-R and Mega Medicham. Dark-type Pokemon such as Mega Tyranitar, Kingambit, and Ting-Lu pair well with Slowbro, as they deal with Gholdengo, which easily breaks Slowbro; the former two teammates have the added boon of Pursuit to forcibly remove Gholdengo and help stave off Choice-locked Tapu Lele.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 526618, "username": "omarsgarciav"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 658067, "username": "Ineros"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Weezing-Galar": {"sets": {"Defensive": {}}},
  "Chansey": {"sets": {"Little Pink Blob": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Ditto": {"sets": {"Those Who Know:": {}}},
  "Zapdos": {
    "sets": {
      "Defensive": {
        "description": "<p>Zapdos is a key defensive piece on teams due to its typing and bulk, letting it handle Pokemon like Great Tusk, Urshifu-R, and Zamazenta, crippling them with Static for its teammates. Heat Wave allows Zapdos to deal meaningful damage to Pokemon that would usually come in against it, like Gholdengo and Ferrothorn, as well as letting it become a stopgap for Kingambit. Defog allows it to remove entry hazards for its teammates as well as itself if loses its Heavy-Duty Boots, as it has a good matchup against common hazard setters like Ferrothorn and Landorus-T. Hidden Power Ice allows it to get a surprise 2HKO on Gliscor, as well as giving Zapdos a more reliable option against Garchomp and Landorus-T. 72 Speed EVs allow Zapdos to outspeed Modest Heatran.</p> <p>Zapdos can easily be slot in on a defensive backbone on bulky offense and balance teams looking for a solid defensive pivot, since it is able to easily take a hit and bring in its teammates. Pokemon like Mega Medicham and Kingambit can also take advantage of the paralysis that Zapdos spreads to outspeed Pokemon like Zamazenta and Iron Valiant that would otherwise threaten them. Kingambit in particular can threaten Pokemon like Gholdengo, Mega Latios, and Weavile that would normally force Zapdos out while also trapping Pokemon like Gholdengo and Galarian Slowking, while Zapdos can chip down Fighting-types like Great Tusk and Zamazenta, which would normally stop a Kingambit sweep. Pokemon like Ogerpon-W and Weavile also appreciate Zapdos bringing them in on Pokemon like Heatran and Raging Bolt, respectively, while also eliminating Ground-types like Garchomp, Gliscor, and Ting-Lu so that Zapdos can keep on pivoting without worrying about Volt Switch being blocked. Knock Off users like the aforementioned Weavile as well as Gliscor, Mega Tyranitar, and Kingambit can also prove annoying for Zapdos, as they can remove its Heavy-Duty Boots, forcing it to take Stealth Rock damage and get chipped down over the course of the game, so Pokemon that can deal with these foes, like Zamazenta and Urshifu-R, or Pokemon that can absorb Knock Off from these Pokemon for Zapdos, like Mega Tyranitar and your own Gliscor, can go a long way in keeping Zapdos healthy. Great Tusk in particular can remove hazards for Zapdos should its Heavy-Duty Boots get removed by Knock Off, so it can still switch into Great Tusk's checks for it like Urshifu-R and Alomomola without getting chipped down.</p>"
      },
      "Offensive": {
        "description": "<p>Zapdos serves as a great wallbreaker, boasting natural bulk that allows it to take hits from physical attackers like Rillaboom and Urshifu-R and threaten them with paralysis through Static. If rain is active, Weather Ball lets Zapdos nuke defensive Ground-types such as Iron Treads, Gliscor, and Landorus-T, while Supersonic Skystrike can be used to finish off weakened defensive Pokemon like Ferrothorn and Galarian Slowking or on important turns when the risk of missing a Hurricane would prove way too costly.</p> <p>Zapdos can be a great addition to offense teams where its ability to inflict foes with paralysis is greatly appreciated. Zapdos has the ability to loosely check Fighting-types like Zamazenta, Great Tusk, and Mega Medicham, which can go a long way for teammates like Kingambit and Ferrothorn. The aforementioned Fighting-types can also be great teammates to Zapdos, as they help in dealing with Pokemon like Ting-Lu and Mega Tyranitar. Additionally, Great Tusk can remove Stealth Rock. When used on rain, staples like Barraskewda and Mega Swampert appreciate Zapdos's help in dealing with bulky Water-types such as Alomomola and Slowbro as well as Grass-types like Ogerpon-W and Ferrothorn. Galarian Slowking and Raging Bolt are both frustrating for Zapdos to break, so teammates such as Pursuit Kingambit or bulky Ground-types like Iron Treads and Ting-Lu are good to deal with them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574893, "username": "Dahness"}, {"user_id": 591294, "username": "Lightniong"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 591294, "username": "Lightniong"}, {"user_id": 632421, "username": "Medasus"}, {"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 662575, "username": "boppydop!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 697682, "username": "earthfromthefuture"}, {"user_id": 583607, "username": "PowerOfMemes"}]}]}
  },
  "Moltres": {
    "sets": {
      "Defensive": {
        "description": "<p>Moltres holds a strong place in the metagame thanks to its unique defensive profile, letting it check dangerous threats like Great Tusk, Mega Charizard Y, and Volcarona, and its good natural bulk lets it help out versus threats such as Gholdengo. U-turn allows Moltres to retain momentum for its team; this is important, as it can be somewhat passive into threats such as Heatran, Alomomola, and Toxapex on its own depending on its moveset, and it often relies on giving its teammates free switches to revenge kill or force out foes. Hurricane gives Moltres a strong STAB move that threatens Zamazenta, Volcarona, and Great Tusk. Toxic allows Moltres to cripple potential switch-ins like Mega Charizard Y, Mega Tyranitar, Ting-Lu, and Alomomola. Scorching Sands allows Moltres to appreciably threaten Heatran while also allowing it to potentially spread burns against foes such as Toxapex. Defog is a possibility in this moveslot if the team needs entry hazard removal and cannot fit it elsewhere, but Moltres is a poor defogger overall, as it doesn't reliably beat many of the tier's entry hazard setters, it is very weak to Knock Off, and Defog takes up a valuable moveslot. Roost allows Moltres to stay healthy throughout the match. A physically defensive EV spread allows Moltres to better check Great Tusk, Melmetal, and Zamazenta, whereas a specially defensive spread allows it to better check Mega Charizard Y, Gholdengo, and Volcarona. Flame Body helps Moltres punish contact moves from Melmetal, Mega Lopunny, and Kingambit with a potential burn. Heavy-Duty Boots is mandatory thanks to Moltres's extreme weakness to Stealth Rock, which severely impacts its ability to function as a pivot.</p> <p>Moltres fits well on bulky offense and balance teams thanks to its solid defensive profile and ability to retain momentum with U-turn. A Knock Off absorber is an important teammate, as Moltres loses a significant amount of its efficacy without Heavy-Duty Boots. Teammates such as Gliscor, Mega Scizor, and Great Tusk are good choices as a result. Moltres also pairs well with Dragon-types such as Dragonite, Mega Latios, and Kommo-o, which can shore up Moltres's weakness to common Water-types such as Ogerpon-W, Urshifu-R, and Mega Swampert, as well as helping it check Mega Charizard Y, while they appreciate Moltres checking Fairy-types like Iron Valiant. In a similar vein, Moltres benefits from Ground-types such as Great Tusk, Landorus-T, and Ting-Lu, as they can check Rock- and Electric-types such as Mega Tyranitar and Raging Bolt, while Moltres can check Grass-types such as Rillaboom, Serperior, and Kartana in return. Moltres is a good pivot thanks to its ability to take a hit from and force out common Pokemon like Landorus-T, Mega Charizard Y, and Great Tusk, so frail wallbreakers, such as Mega Medicham, Weavile, and Ogerpon-W, that appreciate getting free switch-in opportunities are good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Dragonite": {
    "sets": {
      "Dragon Dance + Z-Move": {
        "description": "<p>Dragonite is an elite offensive Pokemon that can disrupt common balance structures when holding a Z-crystal; common switch-ins to Dragonite like offensive Great Tusk, Landorus-T, and Gliscor fall to +1 Devastating Drake. Dragonite also has great defensive utility, using Multiscale to effectively set up Dragon Dance in front of foes such as Ogerpon-W and Urshifu-R. Earthquake grants Dragonite the opportunity to hit Pokemon such as Heatran and Toxapex, which can discourage any Stealth Rock-setting or Haze attempts, respectively. It also threatens other Steel-type Pokemon like Kingambit and Melmetal. Fire Punch discourages bulky Steel-types that don't mind Earthquake such as Ferrothorn, Air Balloon Gholdengo, and Corviknight from coming in freely. A Jolly nature is usually preferred, as it allows Dragonite to outspeed foes like Zamazenta and Tapu Koko at +1.</p> <p>This variant of Dragonite is found on more offensive structures, where it is paired with Pokemon such as Mega Diancie; it can deny any attempts of entry hazard setting from the opposition, as this Dragonite set lacks Heavy-Duty Boots. Dragonite, in return, provides a valuable Water- and Grass-resistant teammate for Mega Diancie to aid against foes such as Rillaboom and Choice Scarf Urshifu-R. These teams appreciate Dragonite providing a valuable Water-resistant ally, as it is an effective answer to foes like Ogerpon-W and Urshifu-R. Kingambit values Dragonite weakening its checks, such as Great Tusk and Zamazenta, to give it a more favorable end-game. In return, Kingambit can remove key items from checks like Corviknight and Great Tusk to enable Dragonite to use its moves more freely. Heatran is also an effective partner, since it is able to answer Pokemon Dragonite doesn't immediately threaten such as Clefable while also being a good answer to Choice Scarf Tapu Lele, which still threatens Dragonite after a Dragon Dance. Even at +1 Speed, Dragonite is still outsped by Choice Scarf users like Landorus-T and Tapu Lele, so it appreciates partners like Air Balloon Gholdengo as a partner to potentially use those foes as setup fodder. Spinners such as Great Tusk and Terapagos are also effective teammates, as they can provide hazard removal through Rapid Spin to ensure Dragonite does not take Stealth Rock damage to keep Multiscale intact. Great Tusk and Dragonite often form a core to overwhelm their shared checks, such as Alomomola, Slowbro, and Skarmory. Volcarona also appreciates Dragonite being able to provide a crucial Water resistance, helping it against Pokemon such as Ogerpon-W. At the same time, Volcarona can find setup opportunities versus Choice Scarf Tapu Lele, which usually comes in to revenge kill Dragonite with Moonblast. Dragonite values hazard-setting leads such as Mega Diancie and Landorus-T, as the latter is able to provide Taunt to keep opposing hazards off whereas the former denies hazards through Magic Bounce while breaking down the opposition with its strong STAB moves.</p>"
      },
      "Offensive Dragon Dance": {
        "description": "<p>Dragonite is a very unique sweeper, as it is able to set up reliably in the face of offensive Pokemon like Urshifu-R, Ogerpon-W, and Mega Charizard Y. Earthquake allows it to target foes such as Gholdengo, Heatran, and Toxapex, preventing them from staying in to spread status through moves such as Thunder Wave from the former and Toxic from the latter two. Ice Spinner grants Dragonite the ability to threaten foes like Gliscor and Landorus-T, which are usually key defensive pillars of their teams, and stops them from coming in for free to land Toxic on Dragonite. Ice- and Ground-type coverage additionally hits a vast amount of Pokemon in the metagame. Roost gives Dragonite the longevity to answer Pokemon like Ogerpon-W and Urshifu-R and also provides more setup opportunities, which allows Dragonite to break through foes like Toxapex and Ferrothorn. Extreme Speed can be used over Roost, as it helps Dragonite pick off weakened faster Pokemon like Iron Valiant and Tapu Koko that would normally outspeed and threaten it. Dual Wingbeat hits Pokemon such as Great Tusk and Zamazenta significantly harder.</p> <p>Dragonite is used on a plethora of different bulky offense and balance teams, as they appreciate Dragonite's defensive utility, with it being able to switch into offensive Water-types like Urshifu-R and Ogerpon-W and find many different opportunities to set up Dragon Dance. Pokemon like Mega Diancie appreciate Dragonite's ability to respond to foes like Choice Scarf Urshifu-R and Landorus-T. In return, Mega Diancie can pressure Dragonite's checks like Ferrothorn with Mystical Fire and Zapdos with Diamond Storm. Dragonite can have a difficult time in the face of Pokemon such as Choice Scarf Tapu Lele that still outspeed it after a Dragon Dance, so it values the presence of Steel-types like Gholdengo and Heatran to switch into it. Scale Shot Garchomp and Icicle Spear Kyurem also outspeed and break through Dragonite's Multiscale. Therefore, allies such as Choice Scarf Tapu Lele and Speed Booster Energy Speed Iron Valiant are appreciated to outspeed and threaten these foes. Kingambit also helps versus Air Balloon Gholdengo, which Dragonite does not immediately threaten. Volcarona is also an effective partner, as it can respond to Pokemon that directly threaten Dragonite like Choice Scarf Tapu Lele and Speed Booster Energy Iron Valiant, the former of which blocks Dragonite's Extreme Speed with Psychic Terrain. Great Tusk is an effective partner, since it is able to wear down checks such as Landorus-T with both Stealth Rock and Ice Spinner, letting Dragonite break through opposing teams more easily mid-game. Great Tusk can also help break through Toxapex with Headlong Rush and hit Ferrothorn with Close Combat. In return, Dragonite responds to Water-types like Urshifu-R and Ogerpon-W that force out Great Tusk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 697682, "username": "earthfromthefuture"}]}]}
  },
  "Slowking-Galar": {"sets": {"Defensive Pivot": {}, "Assault Vest": {"description": "<p>224 SpD EVs with a Calm nature lets Slowking-Galar live Mega Charizard Y's Fire Blast twice from full HP.</p>"}}},
  "Steelix": {"sets": {"Tank": {"description": "<p>The given EVs allow Mega Steelix to outspeed Toxapex, survive +1 Devastating Drake from Modest Raging Bolt after one layer of Spikes, and OHKO Raging Bolt back with Earthquake.</p>"}}},
  "Scizor": {
    "sets": {
      "Bulky Swords Dance": {
        "description": "<p>Mega Scizor functions as an excellent late-game wincon due to its access to strong priority in Technician-boosted Bullet Punch, as well as being an excellent defensive piece, being able to switch in reliably on threats such as Iron Valiant, Kartana, and Rillaboom. Knock Off can be used in order to cripple would-be switch-ins such as Gholdengo, Zapdos, and Moltres. U-turn allows Mega Scizor to pivot out and gain momentum on threats such as Heatran and Mega Charizard Y switching in as well as defensive Pokemon such as Corviknight, Ferrothorn, and Alomomola. Sand Tomb is a more niche option that can be used in order to deal large damage to non-Air Balloon Heatran, as well as trapping Pokemon such as Toxapex switching in. 112 Defense EVs allow Mega Scizor to live 2 Mega Lopunny Close Combats after Stealth Rock and 20 Speed EVs allow Mega Scizor to outspeed uninvested Heatran.</p> <p>Mega Scizor fits well on offense, bulky offense and balance teams due to its defensive capabilities as well as its ability to clean up in the later stages of the game with Swords Dance and Bullet Punch. Mega Scizor is extremely vulnerable to Fire-type moves from Pokemon such as Heatran, Volcarona, and Mega Charizard Y, meaning switch-ins such as Heatran, Toxapex, and Alomomola are appreciated. Mega Scizor also struggles to break through Steel-type Pokemon such as Kingambit, Melmetal, and Ferrothorn, making Fighting-types such as Urshifu-R and Zamazenta excellent partners. In return, Fighting-types benefit from Mega Scizor breaking through Fairy-type Pokemon such as Clefable and Iron Valiant. Mega Scizor provides an excellent switch-in to Psychic-types such as Tapu Lele, making teammates that benefit from this such as Great Tusk and Toxapex great partners. Mega Scizor also appreciates Stealth Rock setters such as Landorus-T, as they chip switch-ins such as Heatran and Corviknight, while Mega Scizor can help setters by removing Heavy-Duty Boots from Pokemon such as Moltres and Zapdos, making them vulnerable to Stealth Rock.</p>"
      },
      "Offensive Swords Dance": {
        "description": "<p>Offensive Mega Scizor punches through the opposition with its three-attacks set thanks to its great base Attack stat, colorful coverage options, and surprisingly good natural bulk. Bullet Punch, when boosted by STAB and Technician, lets Mega Scizor beat faster threats like Roaring Moon and all-out attacking Zamazenta despite its mediocre base Speed stat. Close Combat hits Steel-types that normally stuff Mega Scizor, like Heatran and Kingambit, while being a great neutral option when boosted against the likes of Raging Bolt, opposing Mega Scizor, and Urshifu-R. Knock Off 2HKOes defensive and OHKOes offensive Gholdengo, which is otherwise a major annoyance, after a boost, while providing good utility into the likes of Toxapex and Moltres without needing a Swords Dance boost. Sand Tomb is a good alternative, as it directly breaks through Toxapex and other checks like Iron Moth while still retaining the ability to scare off Gholdengo, but it forgoes any chance of beating Moltres.</p> <p>This particular Mega Scizor set fits best on hyper offense teams, which want Mega Scizor's cleanup ability and defensive utility without the drawbacks of being checked by annoyances like Toxapex and Heatran; not having Roost is not very noticeable due to these teams' plan to win quickly. Entry hazard setters like suicide lead Landorus-T, Glimmora, and Iron Treads greatly help Mega Scizor's wallbreaking ability by chipping foes like Toxapex and Raging Bolt down into range of Mega Scizor's attacks. They also pair well with Knock Off, allowing Mega Scizor to use said hazards to heavily pressure Moltres and Volcarona. Dragon-types like Roaring Moon, Dragonite, and Raging Bolt are great partners, as they set up on Fire-types like Heatran and Moltres that otherwise stop Mega Scizor while loving Mega Scizor's ability to beat Fairy-types like Iron Valiant and Tapu Koko and clean up once they are finished wallbreaking. Kingambit forms a great priority spamming duo with Mega Scizor, letting one wallbreak for the other to clean while appreciating Mega Scizor's neutrality to Ground and Fighting as well as its Fairy resistance, which let it switch into foes like Choice Scarf Urshifu-R, defensive Great Tusk, entry hazard setter Garchomp, and Mega Diancie.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 542295, "username": "Wildfiree"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Heracross": {"sets": {"Wallbreaker": {}}},
  "Skarmory": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Skarmory is one of the purest physical walls available, as its great defensive typing and superb physical bulk lets it take on most of the tier's dangerous physical attackers, such as Great Tusk, Melmetal, Zamazenta, and Roaring Moon. Iron Defense allows Skarmory to beat boosting physical attackers like Roaring Moon, Mega Mawile, Swords Dance Gliscor, and Kingambit. Body Press immediately threatens Kingambit, Mega Tyranitar, and Mega Lopunny while also doing significant general damage when boosted. It can also dissuade Pokemon such as Heatran and Terapagos from easily switching in to remove Skarmory or the entry hazards it sets. Spikes are quite effective in the metagame, as they hit and chip down several very prominent defensive Pokemon, most notably Ferrothorn, Gholdengo, and Melmetal. Skarmory also gets many opportunities to set them up thanks to its ability to easily switch into common Pokemon like Gliscor, Great Tusk, and Landorus-T. 96 Speed EVs allow Skarmory to outrun Adamant Kingambit and Ursaluna. Rocky Helmet chips down physical attackers such as Melmetal, Urshifu-R, and Great Tusk, the latter of which is especially notable, as it will take damage should it try to spin away Skarmory's Spikes.</p> <p>Skarmory's limitations as a defensive Pokemon lead it to fit best on bulky balance and stall teams, as they greatly appreciate Skarmory's prowess as a catch-all physical wall that can use Spikes to force progress, and it notably beats several prominent wallbreakers, most notably Kingambit and Mega Mawile. While Skarmory has an impressive physically defensive profile, its poor Special Defense and reliance on Body Press to do damage leave it helpless against prominent special attackers such as Gholdengo, Tapu Lele, Mega Diancie, and Calm Mind Clefable. The latter three are especially problematic, as many teams expect their Steel-type to at least help out versus them, whereas Skarmory needs a teammate to pick up its slack. Gholdengo and Galarian Slowking can help out with the Fairy-types, while Heatran or Ting-Lu can help out with opposing Gholdengo. These teammates appreciate Skarmory handling powerful physical threats such as Great Tusk, Garchomp, and Ursaluna. Skarmory also greatly appreciates a check to Fire-types such as Mega Charizard Y and Moltres, as they can switch into it without much trouble. Toxapex is an excellent partner that checks these dangerous Fire-types as well as Mega Diancie. Toxapex in turn greatly appreciates Skarmory checking dangerous Ground-types like Landorus-T and Great Tusk. Dragon-types such as Roaring Moon, Mega Latios, and Dragonite can come in on these threats multiple times, and they also take pressure off of Skarmory to beat Ogerpon-W, which can occasionally cause trouble for Skarmory when boosted. Skarmory in turn takes care of powerful physical threats that can trouble these teammates, such as Mega Tyranitar, Mega Lopunny, and Weavile. Electric-types such as Raging Bolt and Zapdos are also problematic, so Ground-types such as Gliscor, Landorus-T, and Ting-Lu are good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Blissey": {"sets": {"Pink Blob": {}}},
  "Tyranitar": {
    "sets": {
      "Offensive Utility": {
        "description": "<p>Mega Tyranitar is a valuable asset for a variety of teams due to the sheer role compression it provides. It can act as an entry hazard setter; an offensive threat with its STAB moves, coverage, and high Attack stat; and a trapper with its effective usage of Pursuit, allowing it to remove offensive threats such as Choice-locked Tapu Lele and Gholdengo. Due to its incredible capabilities as an offensive threat, it can check many common special attackers such as Raging Bolt, Mega Charizard Y lacking Focus Blast, and Terapagos while dealing significant damage and threatening them with Pursuit. Even though Stone Edge is very powerful with STAB, other options can also be run, such as Ice Punch for doing significant damage to Landorus-T and Great Tusk while scoring an OHKO on Gliscor and Garchomp as well as Low Kick for hitting Steel-types such as Ferrothorn, Kingambit, and Melmetal that would otherwise threaten Mega Tyranitar. Stealth Rock is a priority on Mega Tyranitar due to its great bulk and ability to check common entry hazard removal options such as Terapagos, Zapdos, and Tornadus-T lacking Focus Blast. Even though Mega Tyranitar is an exceptional Stealth Rock setter, Low Kick can be run if there is already another Stealth Rock setter on the team. Knock Off has excellent synergy with Stealth Rock, as it can remove items like Heavy-Duty Boots from common users such as Alomomola and Toxapex, making them vulnerable to hazards. 164 Speed EVs allow Mega Tyranitar to outspeed non-Speed invested Landorus-T and maximum Speed invested Jolly Kingambit.</p> <p>Mega Tyranitar fits best on many balance and bulky offense teams that can benefit heavily from its role compression. It can also fit on entry hazard stacking teams, as it can set hazards and use Knock Off to remove foes' Heavy-Duty Boots while also setting sand to deal additional chip damage. Even though Mega Tyranitar has great offensive and defensive stats, its lackluster typing holds it back significantly. It struggles against powerful Fighting-types such as Zamazenta, Mega Lopunny, and Great Tusk along with viable Fairy-types such as Iron Valiant, Tapu Lele, and Mega Mawile. Teammates such as Gholdengo, Clefable, and Zapdos can check most of the Pokemon mentioned above, while Iron Valiant and Melmetal can offensively threaten Tapu Lele and opposing Iron Valiant. Additionally, Future Sight users such as Tapu Lele and Galarian Slowking can form powerful cores with Mega Tyranitar, as they help it in breaking the aforementioned Zamazenta, Great Tusk, and Iron Valiant. In return, Mega Tyranitar can weaken Pokemon that can safely switch into Future Sight such as Kingambit if running Low Kick and Gholdengo with Knock Off. As a teammate, Gholdengo can block Rapid Spin from Great Tusk and blocks Defog from physically defensive Corviknight.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652550, "username": "Retereereeeree"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 662575, "username": "boppydop!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Swampert": {
    "sets": {
      "Rain Sweeper": {
        "description": "<p>Mega Swampert is an amazing wallbreaker on rain teams due to its ability to outspeed most offensive threats like Dragapult, Tapu Lele, and Zamazenta with Swift Swim and threaten them with strong attacks that are further boosted by rain. Its Ground typing is also useful for these types of teams, as it gives them a Pokemon that can reliably take on Electric types like Raging Bolt and Tapu Koko. Flip Turn lets Mega Swampert lure in checks to it like Alomomola and Rotom-W and bring in teammates like Raging Bolt and Archaludon that can reliably take on these Pokemon. Stealth Rock takes advantage of the multiple switches that Mega Swampert and its teammates force to rack up chip damage against foes such as Ferrothorn and Mega Venusaur for Mega Swampert eventually being able to break through. Ice Punch hits Pokémon such as Rillaboom, Dragonite and Zapdos, while Superpower deals with Ferrothorn as well as being the best option against Ogerpon-W.</p> <p>Mega Swampert is exclusively found on rain teams. Due to this, Pelipper is a required teammate, and it can get Mega Swampert in with U-turn against foes such as Raging Bolt. Because Mega Swampert struggles breaking through bulky Water-types such as Alomomola and Slowbro and also struggles with Grass types such as Rillaboom and Tangrowth, Pokemon like Zapdos and Tornadus-T are amazing partners, as they can reliably take them out for Mega Swampert. Mega Swampert outside of rain also has a very middling Speed tier, allowing Pokémon like Ogerpon-W and Zamazenta to effectively revenge kill it, and even in rain it is still outsped by options like Speed Booster Energy Iron Valiant, so Pokemon like Raging Bolt and Barraskewda are effective partners to deal with these Pokemon. Raging Bolt in particular, as well as Archaludon, further help Mega Swampert against Grass-types by using them as setup fodder.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 591294, "username": "Lightniong"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}]}]}
  },
  "Pelipper": {
    "sets": {
      "Rain Setter": {
        "description": "<p>Thanks to Drizzle, Pelipper establishes itself as rain teams' dedicated weather setter and the archetype's most important supporting piece. Scald punishes threats like Dragonite and Roaring Moon for using Pelipper as setup fodder as well as Mega Tyranitar for switching in to replace the weather. Additionally, it cripples walls that can be very hard for rain teams to break through like Ferrothorn, Alomomola, and Toxapex. U-turn makes Pelipper an effective pivot; in conjunction with minimum Speed investment, it can comfortably take hits from foes and safely bring in teammates like Mega Swampert and Archaludon afterwards. More specifically, being as slow as possible allows Pelipper to underspeed Ting-Lu and Clefable as well as Speed tie with Alomomola, potentially preventing it from gaining momentum. Not only does Roost allow Pelipper to keep itself healthy so that it can repeatedly set up rain throughout the game in the face of Stealth Rock, Roost also lets Pelipper switch into and check foes like Great Tusk, Urshifu-R, and Zamazenta more consistently. Pelipper can run Defog to act as the team's entry hazard remover, especially due to its positive matchup against the tier's common hazard setters such as Great Tusk, Gliscor, Landorus-T, and Heatran. However, if the team has another form of hazard removal, Pelipper can opt to run Hurricane instead; on top of synergizing well with Drizzle, the move allows Pelipper to immediately threaten Zamazenta and, more importantly, Ogerpon-W, which is a tough matchup for rain. Knock Off is a niche option to cripple walls like Toxapex, Ferrothorn, and Alomomola, allowing Pelipper's offensive teammates to overwhelm them more easily.</p> <p>Pelipper is exclusively found on rain teams and is essentially required for the archetype. Mega Swampert is Pelipper's best friend, as the rain makes it stronger and enables its Swift Swim, allowing it to outspeed the entire unboosted metagame. Its Electric immunity is also valuable, providing rain teams, especially Pelipper itself, a stopgap against the likes of Tapu Koko and Raging Bolt. Similarly, the team's own Raging Bolt and Zapdos are great teammates, and they threaten bulky Water-types like Alomomola, Toxapex, and Slowbro, which Pelipper draws in and pivots on. Pelipper's rain allows them to take advantage of Thunder as well as Hurricane and run Water-type Weather Ball to deal with their Ground-type checks like Gliscor and Ting-Lu more easily. Defensively, Raging Bolt helps check Ogerpon-W and Mega Charizard Y, the latter of which can remove Pelipper's rain, while Zapdos takes on Zamazenta and Mega Lopunny for rain teams. Other wallbreakers in rain include offensive Water-types like Urshifu-R and Barraskewda as well as Archaludon; Urshifu-R gives rain teams a way to threaten Ferrothorn and Kingambit, Barraskewda is an even faster Swift Swim user than Mega Swampert, and Archaludon can make use of Electro Shot to accumulate boosts and snowball games while providing defensive value in checking threats like Ogerpon-W and Zapdos. Other Steel-types, like Iron Treads and Ferrothorn, that focus more on utility are also valuable, as they take advantage of the weather to do better against Pokemon with Fire-type coverage like Terapagos and Mega Diancie. On top of that, both of them in particular are sturdy checks to Tapu Koko and Raging Bolt, and Iron Treads also provides hazard removal with Rapid Spin, mitigating Pelipper's Stealth Rock weakness and even letting it forgo Defog. In return, Pelipper is great at checking Ground- and Fighting-types that would threaten the aforementioned Steel-types and Raging Bolt out like Zamazenta, Urshifu-R, Great Tusk, and Landorus-T. Tornadus-T can take advantage of the weather for a fully accurate STAB move, be a check to Kartana and—if holding an Assault Vest—Iron Valiant, and become the team's hazard removal instead if necessary.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493260, "username": "Marnie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 658067, "username": "Ineros"}, {"user_id": 591294, "username": "Lightniong"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}]}]}
  },
  "Shedinja": {"sets": {"Dual Status": {}}},
  "Sableye": {"sets": {"Defensive": {}}},
  "Mawile": {"sets": {"Swords Dance": {}, "All-Out Attacker": {}}},
  "Medicham": {
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Mega Medicham is a destructive wallbreaker that is hugely threatening to several common defensive staples like Ferrothorn, Toxapex, Great Tusk, and Melmetal. Its immense power even allows it to 2HKO bulky neutral targets like Corviknight and Alomomola. Fake Out allows Mega Medicham to pressure faster and more offensive Pokemon like Mega Lopunny, Iron Moth, and Ogerpon-W. This lets Mega Medicham act as a revenge killer if these threats are weakened, and it chips much of the metagame decently. Ice Punch blows past Landorus-T, Gliscor, and Dragonite with ease. Bullet Punch alongside Fake Out improves Mega Medicham's revenge killing capabilities versus offensive teams, and it notably applies significant pressure onto Mega Diancie and Iron Valiant. Fire Punch hits Gholdengo, which is a very common check, and almost always OHKOes Mega Scizor. Fire Punch's targets are very specific, however, which makes it less consistent than Ice Punch and Bullet Punch on a game-to-game basis.</p> <p>Pursuit trapping checks is hugely beneficial to Mega Medicham. Assault Vest Kingambit and Weavile can trap and remove checks such as Gholdengo, Mega Latios, Mega Latias, Dragapult, and Slowbro. Mega Medicham threatens several Pokemon that are irritating for them in return, such as Great Tusk, Alomomola, and Toxapex. Mega Medicham's poor defensive profile makes it hard to switch into battle safely, so it appreciates slow pivots like Alomomola, Galarian Slowking, and defensive Landorus-T that can ease prediction and help it get on the field. A solid defensive backbone is advised when using Mega Medicham, as several very common offensive threats revenge kill it with ease, including Dragapult, Mega Latios, and Ogerpon-W. Teammates like Toxapex, Ferrothorn, Ting-Lu, and Assault Vest Kingambit are very helpful in this regard. Hisuian Samurott is another great teammate that checks threatening Ghost- and Psychic-types like Gholdengo and Mega Latios while also laying down Spikes, and it can use Flip Turn to pivot Mega Medicham into battle. Other forms of entry hazard support, like Spikes from Ferrothorn and Stealth Rock from Great Tusk, Landorus-T, and Ting-Lu, are generally very helpful, as they help wear down checks such as Gholdengo. Fast late-game cleaners like Zamazenta, Dragapult, Iron Valiant, and Cinderace appreciate Mega Medicham blowing up opposing defenses before they come into battle to sweep later on.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 662575, "username": "boppydop!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Torkoal": {"sets": {"Sun Setter": {}}},
  "Salamence": {"sets": {"Dragon Dance + Z-Move": {}}},
  "Latias": {"sets": {"Offensive Utility": {}, "Calm Mind": {}}},
  "Latios": {"sets": {"Wallbreaker": {}}},
  "Lopunny": {
    "sets": {
      "Offensive": {
        "description": "<p>With virtually perfect coverage thanks to Scrappy and a high Attack stat, Mega Lopunny is an excellent choice of speed control that can help pressure the many bulky Steel-types in the tier, such as Ferrothorn, Gholdengo, and Kingambit. Fake Out is one of Mega Lopunny's most valuable tools, as it can revenge kill weakened threats such as Speed Booster Energy Iron Valiant and Scale Shot Garchomp. U-turn makes use of Mega Lopunny's ability to force out many Pokemon by generating momentum to continue applying pressure, but Quick Attack can be used instead to further improve Mega Lopunny's revenge killing capabilities. Triple Axel is another option that can OHKO Gliscor, Landorus-T, and Dragonite, as well as dealing heavy damage to Great Tusk and Mega Latios.</p> <p>Mega Lopunny is a staple for many balance and bulky offense teams as a great speed control and revenge killer. Wallbreakers such as Raging Bolt, Tapu Lele, and Kyurem appreciate Mega Lopunny bringing them onto the field and in return can threaten out its checks such as Toxapex, Great Tusk, and Zapdos. Mega Lopunny can also help put pressure on their checks in return, such as Gholdengo and Ferrothorn. Other pivots such as Landorus-T and Tapu Koko can form a VoltTurn core with Mega Lopunny, with the former setting Stealth Rock and both being able to break Toxapex. In return, Mega Lopunny helps break Ting-Lu and Ferrothorn. Since Mega Lopunny forces a lot of switches, entry hazard setters such as Ting-Lu, Hisuian Samurott, and Ferrothorn make good teammates. Due to Mega Lopunny's low defenses and weakness to hazards, defensive Pokemon such as Gholdengo, Ferrothorn, and Zapdos also make great partners, as they can switch into Fairy-, Fighting-, and Flying-type attacks from Iron Valiant and opposing Zapdos. Hazard removal from Terapagos, Zapdos, and Great Tusk is also greatly appreciated to prevent Mega Lopunny from accumulating too much chip damage from hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 660324, "username": "GigaBytes7"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 632421, "username": "Medasus"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Garchomp": {
    "sets": {
      "Offensive Swords Dance": {},
      "TankChomp": {
        "description": "<p>Garchomp leverages its good defensive typing and decent bulk to become a solid tank that checks several prominent Pokemon, including Mega Charizard Y, Heatran, and Volcarona. Toxic allows Garchomp to deal with Mega Charizard Y and bulky Volcarona while also punishing several Pokemon that would otherwise switch in easily, such as Great Tusk, Zamazenta, and Moltres. Protect allows Garchomp to rack up Toxic damage, keep itself as healthy as possible with Leftovers, and scout Choice-locked foes such as Choice Scarf Hisuian Samurott and Choice-locked Tapu Lele. Garchomp is a solid entry hazard setter, as it can pressure some common hazard removal options, most notably Great Tusk, Terapagos, and Zapdos, with Toxic. Dragon Tail is a good alternative if the team has other hazard setters, as it lets Garchomp rack up hazard damage and temporarily remove foes that might try to set up on it, such as Air Balloon Gholdengo, Swords Dance Gliscor, and Swords Dance Kartana. Leftovers allows Garchomp to stay healthy throughout the game and synergizes well with Protect, while Rough Skin punishes contact moves from the likes of Urshifu-R, Hisuian Samurott, and Great Tusk. The given EV spread allows Garchomp to best check special attackers like Mega Charizard Y and Volcarona, while the Speed EVs allow it to outrun Modest Heatran. 40 Speed EVs with a Jolly Nature let Garchomp outrun Raging Bolt, but the reduction in bulk makes Garchomp noticeably worse against Gholdengo and Heatran, and Garchomp can't safely switch into Raging Bolt anyway.</p> <p>This Garchomp set fits well on offense and bulky offense teams, as it has limited longevity but provides these teams with much needed role compression in checking Mega Charizard Y, Heatran, and Volcarona while also setting up entry hazards. Garchomp does well supporting offensive teammates that dislike these specific threats, such as Gholdengo, Kingambit, and Kartana. Gholdengo is an especially good teammate, as it can deny hazard removal attempts from Terapagos and Zapdos, which is important as Garchomp has limited longevity and will likely not be able to repeatedly set up hazards in longer games. Alomomola is another solid teammate, as it can pivot into threatening physical attackers such as Great Tusk, Mega Lopunny, and Zamazenta that Garchomp cannot reliably handle, due to the frequency with which they run Ice-type coverage. It also can Wish pass to keep Garchomp healthy. Knock Off users such as Kingambit, Kartana, and Mega Scizor can remove Heavy-Duty Boots from the likes of Zapdos, Moltres, and Terapagos, therefore letting Garchomp's hazards make significant progress by themselves. Fast and powerful offensive teammates such as Tapu Koko and Zamazenta appreciate Garchomp taking a few strong hits from the likes of Mega Charizard Y, Gholdengo, and Heatran, and they can make up for Garchomp's lack of longevity by generating significant offensive pressure. The aforementioned teammates can also help revenge kill certain faster threats that Garchomp dislikes, such as Ogerpon-W, Kartana, and Mega Diancie.</p>"
      },
      "Swords Dance + Loaded Dice": {
        "description": "<p>Garchomp serves as a dangerous cleaner due to Loaded Dice giving the possibility of boosting its Speed and dealing damage at the same time. It is able to leverage its great typing to find setup opportunities against Pokemon like Mega Charizard Y and unboosted Volcarona. Fire Fang gives it great coverage against Mega Scizor, Corviknight, and Ferrothorn.</p> <p>Garchomp fits best on bulky offense and hyper offense structures, where its combination of Swords Dance and Scale Shot can quickly overwhelm the opposing team if not taken care of properly. It uses its powerful combination of STAB moves to prey on a lot of bulky Pokemon like Toxapex, Dragonite, and Galarian Slowking, to the benefit of teammates like Volcarona, Raging Bolt, and Iron Valiant. Garchomp's typing leaves it weak to attacks from notable Pokemon like Tapu Lele, Iron Valiant, and Weavile while also not being able to do much against Landorus-T, which can come in very often to drop Garchomp's Attack via Intimidate. Mega Scizor is a great solution to this problem, as it can take hits from the aforementioned Pokemon while being able to consistently force Landorus-T out. Urshifu-R can also be a great teammate for it, as it can lure in Toxapex and Raging Bolt, which then get removed by Garchomp. The Defense drops from Scale Shot leave Garchomp vulnerable to strong priority users like Weavile, Dragonite, and Kingambit. Tapu Lele's Psychic Surge is able to circumvent this issue by making these priority moves unable to hit. In exchange, Garchomp is able to take care of Tapu Lele's counters like Gholdengo and Heatran. Tapu Lele is also able to eliminate Great Tusk, which also presents itself as a threat to Garchomp by being able to shrug off its hits easily and KO it in return with an Ice Spinner.</p>"
      },
      "Mixed Attacker": {}
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 574893, "username": "Dahness"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 662575, "username": "boppydop!"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Hippowdon": {"sets": {"Defensive": {}}},
  "Weavile": {"sets": {"Choice Band": {}, "Offensive": {}}},
  "Magnezone": {"sets": {"Iron Defense + Body Press": {}}},
  "Tangrowth": {"sets": {"Physically Defensive": {}, "Assault Vest": {}}},
  "Gliscor": {
    "sets": {
      "Utility": {
        "description": "<p>Utility Gliscor cements itself as one of the best defensive options in the tier thanks to its fantastic defensive typing, ability, and utility movepool. Gliscor is very good at spreading Toxic, as it forces out several common Pokemon that would otherwise absorb the move, such as Toxapex, Gholdengo, and Heatran. U-turn allows Gliscor to maintain momentum versus switch-ins such as Skarmory, Zapdos, and Ogerpon-W for more offensive teammates such as Roaring Moon, Ogerpon-W, and Iron Valiant that appreciate getting free switches into battle. Knock Off is a decent option to remove crucial items from Ferrothorn, Zapdos, and Moltres. However, Toxic is by far the preferred option, especially on balance teams, thanks to how challenging it is to switch into, how effective Gliscor is at racking up chip damage via forcing switches, and how good it is at spreading the status condition. Gliscor is a good entry hazard setter, as it annoys many hazard removal options like Zapdos, Great Tusk, and Terapagos with either Toxic or Knock Off should they try to switch into it. Alternatively, Gliscor is one of the tier's best Defoggers, as it can switch into hazard setters like specially defensive Garchomp, Heatran, and defensive Landorus-T with little issue and remove the hazards they set as they switch out. Protect synergizes very well with Toxic and allows Gliscor to scout Choice-locked foes such as Choice Specs Iron Valiant, Choice Scarf Tapu Lele, and Choice Band Rillaboom as well as potential Hidden Power Ice from foes like Zapdos and Landorus-T. It also combines with Poison Heal to make Gliscor shockingly hard to wear down even without a reliable recovery move. Roost gives Gliscor more reliable recovery and allows it to effectively heal off hits that do well over 50% damage, such as Moonblast from Tapu Lele and Zen Headbutt from Mega Medicham. This is preferred on sets without Toxic, but Protect's synergy with Toxic and ability to stall turns out makes it the preferred option on most balance teams. Toxic Orb allows Gliscor to activate Poison Heal, making Gliscor extremely difficult to wear down. 36 Defense EVs allow Gliscor to take an Ivy Cudgel from Ogerpon-W at full health, while the rest is dumped into Special Defense to allow Gliscor to more effectively check the likes of Heatran, Gholdengo, and Volcarona. 96 Speed EVs with a Jolly Nature can be run to allow Gliscor to outrun Timid Raging Bolt, but this significantly cuts into Gliscor's bulk and hampers its ability to check foes such as Gholdengo and Mega Diancie.</p> <p>Gliscor is a staple on balance teams thanks to the defensive stability and seemingly endless utility it provides them with, but it can also fit on bulky offense thanks to its great movepool giving it a lot of flexibility. Toxapex is a premier partner for Gliscor, as it assists Gliscor in pivoting around dangerous Water- and Ice-type attacks from the likes of Urshifu-R, Terapagos, and Ogerpon-W. In return, Gliscor can check threats to Toxapex such as Raging Bolt, Heatran, and Choice Scarf Landorus-T; additionally, the two of them together are extremely challenging to wear down thanks to their unique abilities. Other Water-type partners such as Alomomola and Slowbro can help to pivot around these as well while also giving Gliscor more buffer versus threats such as Great Tusk and Dragonite, although they aren't Ogerpon-W answers. Gliscor works very well on balance teams that try to stack Spikes, as it tends to force a lot of switches; a Spikes setter such as Ferrothorn, Skarmory, or Mega Diancie works well as a result. Gliscor can also run Spikes itself if another Stealth Rock setter, such as Great Tusk, Mega Tyranitar, or Heatran works better on your team. Offensively minded teammates such as Great Tusk, Mega Lopunny, Gholdengo, and Zamazenta appreciate Gliscor getting them in safely with U-turn or wearing down defensive foes via Toxic, Knock Off, or entry hazards. Mega Lopunny and Zamazenta are notable thanks to their superior Speed tiers letting them clean up late-game after the opponent's team has been worn down, while Gholdengo can help Gliscor keep its hazards up thanks to Good as Gold blocking opposing Defog attempts.</p>"
      },
      "Swords Dance": {
        "description": "<p>With Swords Dance, Gliscor is able to act as a bulky setup sweeper that can overwhelm defensive teams in mid- to late-game scenarios. This is because of the valuable resistances and immunities its typing affords, its bulk, and Poison Heal, allowing it to set up in front of common Pokemon such as Raging Bolt, Landorus-T, and Heatran. Facade allows Gliscor to hit Pokemon that resist or are immune to Earthquake such as Moltres, Rillaboom, and Zapdos. Alternatively, Knock Off hits Air Balloon Gholdengo, and can remove items from counters such as Dondozo and Corviknight to support its team. Roost allows Gliscor to challenge Pokemon it likes to switch in on such as Zapdos and Gholdengo more effectively. The EV spread uses 112 Speed EVs with a Jolly nature to outspeed maximum Speed Timid Heatran.</p> <p>Swords Dance Gliscor fits best on bulky offense and balance structures due to its ability to set up on and remove passive Pokemon like Landorus-T, Clefable, and Toxapex, but it struggles against Pokemon with immediate offensive power such as Urshifu-R, Weavile, and Ogerpon-W. Ferrothorn and Toxapex are excellent defensive partners, as they are able to check Pokemon that threaten Gliscor like Ogerpon-W, Urshifu-R, and Weavile, forcing them to switch out. They are also able to set Stealth Rock, Spikes, and Toxic Spikes, which can grant Gliscor opportunities to switch in again due to its good matchup against entry hazard removal options such as Zapdos, Moltres and Landorus-T. Gliscor can struggle with some bulky Water-types like Dondozo and Alomomola, so the likes of Tapu Koko, Ogerpon-W and Raging Bolt are able to pressure these Pokemon. Gliscor also doesn't appreciate the presence of bulky Grass-types like Ferrothorn and Rillaboom, so Moltres, Heatran, and Raging Bolt having the ability to threaten is appreciated. Powerful offensive options such as Kyurem, Terapagos, and Ogerpon-W can easily deal with Gliscor, so reliable defensive options that can switch in on these offensive threats like Ferrothorn, Gholdengo, and Mega Venusaur are valuable partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 607465, "username": "EatFoods"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Porygon-Z": {"sets": {"Z-Conversion": {"description": "<p>The given Speed EVs allows Porygon-Z to outspeed Great Tusk unboosted. Z-Conversion causes Porygon-Z to become an Electric-type on top of its omniboost.</p>"}}},
  "Rotom-Wash": {
    "sets": {
      "Defensive Pivot": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Rotom-W acts as a niche speed control option, being able to leverage its amazing defensive typing and access to Levitate to switch in on Landorus-T and Gliscor and threaten them with its STAB moves. Volt Switch allows Rotom-W to gain momentum on switch-ins such as Ferrothorn, Raging Bolt and Roaring Moon while also hitting Hydro Pump-resistant foes such as Toxapex and Alomomola for good damage. Trick can be used in order to cripple defensive pieces that would otherwise beat Rotom-W such as Ferrothorn and Galarian Slowking. After using Trick, Will-O-Wisp can be used in order to weaken Roaring Moon, Garchomp and Ogerpon-W, all of which might otherwise switch in on Rotom-W's STAB moves, while Thunder Wave is another option to slow down special attacking sweepers such as Volcarona and Iron Valiant.</p> <p>Choice Scarf Rotom-W fits predominantly on bulky offense teams, where its ability to switch in on Landorus-T, Gliscor, and Great Tusk and gain momentum is appreciated. Rotom-W struggles to break through Grass-types such as Ferrothorn and Serperior, meaning Fire-types such as Heatran and Volcarona are appreciated in order to break these as well as defensively answer them. In return, Rotom-W provides a Ground-immune switch-in against Garchomp, Gliscor, and Landorus-T and can threaten them with Hydro Pump. Rotom-W is also prone to faster threats such as Mega Lopunny and Choice Scarf Tapu Lele due to its lack of reliable recovery, meaning consistent switch-ins to them such as Toxapex and Gholdengo respectively are appreciated, with both also absorbing Toxic from Melmetal for Rotom-W. Rotom-W also finds itself prone to entry hazard chip damage across the course of a game due to its lack of Leftovers or Heavy-Duty Boots, meaning hazard removal options such as Great Tusk, Defog Gliscor, and Terapagos are all great partners. In exchange, Rotom-W can switch in on and force out bulky Water-types such as Slowbro and Alomomola, which would otherwise switch in on them comfortably. Rotom-W's ability to deal heavy damage to Flying-types like Moltres and Corviknight is appreciated by teammates like Garchomp and Zamazenta, which in return can break through bulky Steel-types such as Ferrothorn and Melmetal, which would otherwise cause Rotom-W trouble. Wallbreakers such as Mega Latios and Zamazenta appreciate Rotom-W being able to get them in on foes they specialize against, such as defensive pieces like Mega Venusaur and Toxapex for the former and Steel-types like Heatran and Ferrothorn for the latter; Rotom-W can also bring Pursuit trappers such as Kingambit and Weavile in on Psychic-types such as opposing Mega Latios and Galarian Slowking. Trick can also annoy defensive teams, being able to cripple bulkier Pokemon such as Ferrothorn and Ting-Lu to the benefit of teammates like Zapdos, Raging Bolt, and Tapu Koko, all of which would otherwise be walled by them. Rotom-W can also form a VoltTurn core with partners like Mega Scizor and Mega Lopunny, with Rotom-W being able to switch in on their would-be answers such as Toxapex and Alomomola. In return Mega Lopunny can threaten Ferrothorn, and Mega Scizor can pivot into offensive Grass-types such as Rillaboom and Kartana for Rotom-W.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Heatran": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Heatran's well-rounded stats, great typing, and unique ability allow it to be one of the best specially defensive Pokemon in the tier, capable of sponging hits from Volcarona, Tapu Lele, and Tapu Koko. Earth Power hits Fire-resistant foes such as opposing Heatran, Toxapex, and Raging Bolt. Toxic is useful to wear down Pokemon such as Ting-Lu and Alomomola, preventing them from reliably switching in. Heatran also functions as a consistent Stealth Rock user, threatening foes with entry hazard removal such as Terapagos lacking Earth Power and Tornadus-T. If Stealth Rock is already being used by another teammate, Taunt can be used to shut down defensive Pokemon like Toxapex and Galarian Slowking allowing Heatran to trap them more effectively. Taunt also prevents Substitute Volcarona and Calm Mind Raging Bolt from spiraling out of control. Protect both enables more passive damage from Magma Storm and Toxic to build up and grants Heatran additional healing from Leftovers, as well as allowing Heatran to scout common Choice item users such as Tapu Lele and Iron Valiant. 40 Speed EVs allow Heatran to outspeed Adamant Kingambit and Mega Mawile.</p> <p>Heatran is easily removed by Ground- and Water-type Pokemon such as Landorus-T, Urshifu-R, and Gliscor, meaning teammates that can handle these threats, such as Mega Latios, Zapdos, and Rillaboom, are greatly appreciated. Rillaboom in particular is good, since the Grassy Terrain it sets provides Heatran with another source of passive healing, which can greatly assist in Heatran's longevity to check foes like Raging Bolt and Mega Latios for teammates like Toxapex and Great Tusk. Heatran's offensive pressure is helpful for wearing down threats like Raging Bolt and Toxapex for teammates like Tapu Koko and Mega Lopunny. In return, Tapu Koko can handle Water-types like Hisuian Samurott and Alomomola.</p>"
      },
      "Offensive": {
        "description": "<p>Offensive Heatran serves as an effective wallbreaker with its powerful Magma Storm and Z-Moves while also functioning as a reliable Stealth Rock setter, pressuring common entry hazard control like Tornadus-T and Terapagos. Earth Power grants key coverage against opposing Fire-resistant foes like Toxapex, Mega Diancie, and opposing Heatran. Grassium Z with Solar Beam is the main combination, as it allows Heatran to lure and OHKO Water-types such as Alomomola, Slowbro, and Mega Swampert while also dealing a good amount of damage to Mega Tyranitar and Garchomp. Alternatively, Toxic cripples threats like Ting-Lu, Mega Latios, and Mega Charizard Y, while Hidden Power Ice threatens Gliscor, Landorus-T, and Garchomp. Taunt stops walls such as Galarian Slowking and Toxapex from pivoting out or using a recovery move, letting Heatran overwhelm them with Magma Storm's chip damage. Heatran can also use Firium Z to hit foes with a powerful Inferno Overdrive, which OHKOes most Landorus-T sets. However, without the combination of Solar Beam + Grassium Z, Heatran won't break past the Water-types mentioned above. Air Balloon is another option, granting Heatran an immunity to Ground-type attacks like Landorus-T's Earthquake, Mega Charizard Y's Scorching Sands, and Mega Diancie's Earth Power, letting it beat or force out Ground-types 1-on-1 when paired with Hidden Power Ice. Air Balloon also helps Heatran against opposing Heatran by avoiding Earth Power and threatening it back with its own Earth Power. Modest nature allows Heatran to OHKO defensive Landorus-T with Inferno Overdrive, while Timid nature helps Heatran outrun Raging Bolt.</p> <p>Heatran fits best on bulky offense and balance teams, where its ability to trap and remove problematic walls shines the most. Volcarona and Raging Bolt are teammates that appreciate this ability, as they both benefit from Heatran trapping and removing walls like Toxapex and Galarian Slowking. Offensive Pokemon like Kingambit, Tapu Lele, and Mega Diancie benefit from Heatran's ability to pressure opposing Steel-types like Melmetal, Ferrothorn, and Gholdengo, and they also appreciate its access to Stealth Rock. Due to its weakness to Ground-type attacks, teammates like Landorus-T, Zapdos, and Tornadus-T are appreciated. Pokemon like Ogerpon-W, Urshifu-R, and Rillaboom are great partners thanks to their ability to threaten opposing Ground-type Pokemon, such as Ting-Lu and Great Tusk, for Heatran. Rillaboom, in particular, provides Grassy Terrain support that offers passive healing, something Z sets lack, for improved longevity. Despite the combination of Grassium Z and Solar Beam, Heatran is generally weak against Water-type foes like Slowbro, Alomomola, and Ogerpon-W; therefore, Pokemon that can handle them, such as Tapu Koko, Raging Bolt, and Ferrothorn, are great partners. Heatran also likes partners that can switch into Fighting-types, like Iron Valiant, Zamazenta, and Mega Lopunny, that threaten Heatran with an OHKO; these include Pokemon like Landorus-T, Gholdengo, and Zapdos. Teammates that carry entry hazards removal, like Gliscor and Terapagos, are solid teammates for Heatran due to its vulnerability to entry hazards and complete lack of recovery without Leftovers. Although Heatran is a solid check to offensive Pokemon like Volcarona and Tapu Lele, its lack of recovery doesn't allow it to repeatedly switch into their attacks. Therefore, defensive Pokemon that check these threats, such as Toxapex and Gholdengo, are solid partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}, {"user_id": 613028, "username": "Illouri"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 662575, "username": "boppydop!"}, {"user_id": 475916, "username": "Sputnik"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Cresselia": {"sets": {"Trick Room Setter": {}}},
  "Manaphy": {
    "sets": {
      "Tail Glow + 3 Attacks": {},
      "Rain Wallbreaker": {
        "description": "<p>Manaphy is an effective wallbreaker on rain teams, using Tail Glow to sharply boost its Special Attack and threaten bulky Pokemon like Alomomola, Toxapex, and Slowbro with a powerful rain-boosted Hydro Vortex. Thanks to Hydration and Rest, it also turns common status users into setup fodder, giving it free turns against defensive staples, such as Toxapex, that would normally cripple it with Toxic. However, despite its power, Manaphy can be difficult to fit on rain teams, which are already strapped for slots and often prioritize speed control, entry hazard removal, or stronger immediate wallbreakers. Psychic allows Manaphy to overwhelm Toxapex and Mega Venusaur without expending its Z-Move. Alternatively, Ice Beam can be used in order to preserve the Z-Move against the likes of Raging Bolt, Mega Latios, and Dragonite. Hydro Vortex is essential to Manaphy's wallbreaking power, allowing it to break through even the bulkiest of Pokemon like Ferrothorn, Galarian Slowking, and Rotom-W after a Tail Glow boost in rain. Modest nature is preferred over Timid to enable valuable damage rolls with Hydro Vortex such as OHKOing Rotom-W after a Tail Glow boost under rain.</p> <p>Manaphy thrives exclusively on rain teams, where it can fully capitalize on its wallbreaking potential. As a result, rain support from Pelipper is mandatory, as it enables Manaphy to fully utilize Hydration alongside Rest for reliable recovery while significantly boosting Hydro Vortex's power, allowing Manaphy to secure key KOs after a Tail Glow boost against walls like Galarian Slowking and Blissey. Late-game cleaners like Mega Swampert and Barraskewda pair well with Manaphy, taking advantage of it using key checks like Slowbro and Alomomola as setup fodder. Mega Swampert, in particular, is mandatory on rain teams and also serves as a solid Electric-type check. Ferrothorn is a great partner for Manaphy, as it pivots into threats Manaphy struggles against, such as Tapu Koko and Ogerpon-W. Additionally, Ferrothorn supports Manaphy by offering Knock Off to remove key items from walls like Assault Vest Tornadus-T and Toxapex or by spreading Thunder Wave to slow down faster threats such as Mega Lopunny and Ogerpon-W, making it easier for Manaphy to break through. It also provides valuable entry hazard support like Stealth Rock and Spikes, which chips away at teams and helps Manaphy secure more KOs. Manaphy is vulnerable against faster Grass-types such as Kartana, Serperior, Ogerpon-W, and Grassy Glide Rillaboom. Therefore, Zapdos and Archaludon are good partners because of their ability to easily pivot into said Grass-types and threaten them out. In return, Manaphy helps break through bulky Ground-types that might otherwise slow down Zapdos and Archaludon, such as Ting-Lu, Gliscor, and Garchomp.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Victini": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Victini functions as a niche late-game cleaner and revenge killer, due to its ability to outspeed Pokemon such as Tapu Koko and Mega Lopunny as well as threaten important defensive pieces such as Ferrothorn and Gholdengo with V-create. U-turn is used to gain momentum on switch-ins such as Heatran, Alomomola, and Raging Bolt that would otherwise reliably answer it. Trick is used in order to cripple defensive switch-ins such as Alomomola, Toxapex, and Ting-Lu, allowing teammates to break through them more reliably. Bolt Strike is an option to hit Water-types such as Toxapex, which would otherwise be able to shut down Victini with Haze, and Alomomola, as well as Moltres and Mega Charizard Y, while Final Gambit allows Victini to trade for would-be answers such as Landorus-T and Garchomp. 252 HP EVs are only used on Final Gambit sets in order to maximise its damage against foes such as the aforementioned Landorus-T and Gliscor.</p> <p>Choice Scarf Victini fits predominantly on bulky offense and sun teams, where its ability to clean up late-game and pivot into breakers is appreciated. Victini finds itself vulnerable to defensive pieces such as Landorus-T and Ting-Lu, both of which can switch in on V-create and threaten Victini with Earthquake, meaning that Flying-type partners such as Gliscor, Tornadus-T, and Zapdos are appreciated. Dragonite can also switch into Victini comfortably and use it as setup fodder, meaning answers to it such as Clefable are appreciated. As well as this, due to Victini's lack of Heavy-Duty Boots, entry hazards such as Stealth Rocks and Spikes make it hard for Victini to come in and pivot, meaning hazard removal options such as Great Tusk, Defog Landorus-T, and Terapagos are appreciated, with the former two also threatening Heatran for it. In return, Victini can threaten Grass-types such as Ferrothorn and Serperior for them. Victini can often find itself struggling to break through bulky Water-types such as Toxapex and Alomomola, meaning Pokemon that threaten these such as Tapu Koko and Tapu Lele are appreciated, with Victini in return breaking through Steel-types such as Gholdengo, Ferrothorn, and Kingambit for them. Tapu Lele also provides an immunity to Kingambit's Sucker Punch and Urshifu-R's Aqua Jet, while Tapu Koko can pivot into Victini directly with U-turn. Victini also appreciates the sun support of Mega Charizard Y, as it boosts the power of its V-create to new heights, allowing it to OHKO Galarian Slowking and Zapdos after chip damage, with Victini in return being able to use U-turn to pivot into it against foes such as Alomomola and Landorus-T, giving it more opportunities to break.</p>"
      },
      "Pivot": {},
      "Z Celebrate": {
        "description": "<p>Z-Celebrate Victini acts as a niche setup sweeper, where its combination of Z-Celebrate and Stored Power can make it a threatening late-game cleaner. Z-Celebrate's omniboost makes Victini a potent sweeper due to its enhanced bulk and offenses making it difficult to revenge kill. When combined with Z-Celebrate, Stored Power becomes able to muscle through neutral targets such as Landorus-T and Alomomola while also breaking Toxapex, which would otherwise stop its sweep with Haze. Focus Blast is used in order to hit Heatran, Roaring Moon and Ting-Lu, all of which could otherwise comfortably switch in on Victini, with the latter being able to phase it out via Whirlwind, removing its boosts entirely.</p> <p>Z-Celebrate Victini fits exclusively on hyper offense, where its ability to clean late-game is appreciated. Victini can often find it hard to find setup opportunities against faster foes such as Ogerpon-W and Choice Scarf Urshifu-R, so teammates that can pressure these such as Raging Bolt and Booster Energy Roaring Moon are appreciated. In return, Victini can break through Steel-types such as Ferrothorn and Melmetal for these. Victini can also often struggle to break through Pokemon that resist its STAB moves, such as Mega Latios and Slowbro, meaning Dark-types such as Kingambit, Roaring Moon, and Hisuian Samurott are appreciated. In return, Victini can come in on Fighting- and Fairy-types such as Tapu Lele and Iron Valiant and find setup opportunities on them. Victini also appreciates entry hazard support from leads such as Glimmora, Landorus-T, and Mega Diancie in order to whittle down any of its answers, enabling it to clean late-game, while also denying opposing hazards, which is appreciated as Victini finds itself vulnerable to Stealth Rock. Dual screens support from setters like Tapu Koko is also appreciated in order to let it set up on Pokemon that would otherwise threaten it such as Non-Ghostium Z Gholdengo and Mega Diancie.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Serperior": {"sets": {"Substitute Attacker": {}, "Glare + 3 Attacks": {}}},
  "Samurott-Hisui": {
    "sets": {
      "Offensive": {
        "description": "<p>Hisuian Samurott is a powerful wallbreaker that provides offensive pressure alongside entry hazard support with a unique typing that allows it to temporarily check Gholdengo and Kingambit when running Sacred Sword. Ceaseless Edge has its Base Power amplified by Sharpness to deal decent damage while passively setting Spikes that can’t be blocked by Taunt or Magic Bounce. Razor Shell is the preferred option for a Water-type STAB move, as the chance to lower Defense can come in handy when breaking through Toxapex and Corviknight, though Aqua Cutter can be considered for its perfect accuracy and non-contact nature. Sucker Punch is a priority move that hits surprisingly hard once boosted, and it can pick up KOs on weakened sweepers like Volcarona and stop revenge killing attempts from the likes of Dragapult. Lastly, Sacred Sword gives Hisuian Samurott the ability to OHKO Kingambit and Mega Tyranitar while immediately dealing significant damage versus Melmetal and Terapagos without Tera Shell intact. Optionally, Swords Dance can boost Hisuian Samurott’s wallbreaking capabilities to impressive thresholds, being able to 2KHO Ferrothorn and nearly OHKO Ogerpon-W with a boosted Sucker Punch, and Encore locks foes into passive moves like recovery moves from the likes of Corviknight and Alomomola and setup moves from sweepers like Iron Valiant. Hisuian Samurott has a few options for an item, with Black Glasses boosting both Dark-type attacks, which offer better rolls against more physically defensive variants of Ferrothorn and Toxapex while also boosting Sucker Punch versus Mega Charizard Y and faster Landorus-T. Heavy-Duty Boots and Protective Pads both improve Hisuian Samurott’s longevity by allowing it to switch in with hazards on the field for the former and avoid contact punishment from the likes of Rocky Helmet users, Static Zapdos, and Ferrothorn for the latter.</p> <p>Hisuian Samurott fits best on entry hazard-stacking teams due to its unique ability to set hazards while attacking. While Hisuian Samurott is powerful, its middling Speed and typing leave it vulnerable to a variety of revenge killers like Tapu Koko and Mega Lopunny. Teammates such as Landorus-T and Gholdengo can switch into faster threats such as Zamazenta and Tapu Lele, and the latter is also able to effectively block forms of hazard removal. Partners like Tapu Koko and Great Tusk benefit from Hisuian Samurott being able to weaken their checks like Ferrothorn and Corviknight, with the former being able to threaten Defoggers like Tornadus-T. Hisuian Samurott can work with offensive partners like Iron Valiant, Swords Dance Garchomp, and Mega Scizor, appreciating Spikes chip damage on checks such as Gholdengo, Toxapex, and Alomomola.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Hisuian Samurott is able to utilize Sharpness-boosted attacks paired with a Choice Scarf to effectively act as speed control. Ceaseless Edge supports its teammates with Spikes while being a very low-risk move against a multitude of targets such as Mega Latios. Aqua Cutter can be an alternative option over Razor Shell, as it forgoes power and Defense drops for 100% accuracy and ability to avoid contact. Sacred Sword hits Dark-types, securing the OHKO versus Kingambit and Mega Tyranitar, deals more damage to Steel-types like Melmetal and Ferrothorn, and damages Normal-types like Terapagos and Mega Lopunny, OHKOing the latter. Knock Off can be an option, which aims to remove the items off of checks such as Zapdos and Toxapex. Flip Turn can let Hisuian Samurott pivot out while not committing to a Choice-locked Water-type move, and it additionally breaks Terapagos's Tera Shell and pivots in teammates. It allows Hisuian Samurott to generate momentum by escaping bad matchups like against Zamazenta and Clefable while wearing them down.</p> <p>Wallbreakers such as Mega Diancie and Iron Valiant can make use of the pivoting from Flip Turn to threaten the Fighting- and Dark-types that can switch into Hisuian Samurott. Swords Dance Landorus-T and Z-Move Garchomp pair nicely with Hisuian Samurott, as they can lure and take out entry hazard removal options like Great Tusk and Corviknight while setting Stealth Rock. Furthermore, Hisuian Samurott often has issues with frailty and the inability to beat common hazard removal options, so partners such as Raging Bolt can pressure bulky Water-types that check Hisuian Samurott, such as Alomomola and Toxapex, and hazard removal options, like Tornadus-T and Corviknight, while also being able to switch into Zapdos and Urshifu-R. Gholdengo can block Defog and Rapid Spin while utilizing its great bulk to switch into the Fairy-type and Fighting-type moves directed at Hisuian Samurott and take advantage of Hisuian Samurott's passive checks like Toxapex and Ferrothorn.</p>"
      },
      "Assault Vest": {
        "description": "<p>Along with the utility that Hisuian Samurott usually brings, the extra bulk provided by Assault Vest allows it to better check Gholdengo and allow it to pick up surprise KOs on Pokemon such as Mega Diancie. Knock Off can remove items such as Heavy-Duty Boots from Alomomola and Toxapex and Leftovers from Ferrothorn, which makes the Spikes it sets even more impactful; Flip Turn can be run instead to help generate momentum, or Sacred Sword can be used to OHKO Kingambit. The given EV spread lets Hisuian Samurott survive a Moonblast from Mega Diancie or Solar Beam from Mega Charizard Y from full HP along with outspeeding uninvested Gliscor.</p> <p>Assault Vest Hisuian Samurott fits best on bulky offense teams that appreciate the utility and role compression it brings. Due to it being quite slow, faster Pokemon such as Zamazenta and Tapu Lele can come in to revenge kill it, so defensive Pokemon like Landorus-T and Gholdengo are helpful teammates that can switch into these threats. Gholdengo in particular can switch into Fighting- and Fairy-type attacks as well as block all forms of entry hazard removal. Pokemon that set Stealth Rock, such as Great Tusk and Landorus-T, are also appreciated, since they can stack even more hazards and accumulate extra chip damage on the opposing team; they also appreciate Hisuian Samurott removing Heavy-Duty Boots from Toxapex and Alomomola. Fairy- and Fighting-type Pokemon such as Mega Diancie, Iron Valiant, and Zamazenta greatly appreciate Hisuian Samurott being able to set hazards and chip down their checks like Ferrothorn and Gholdengo and its ability to switch into Gholdengo; in return, they threaten the Dark- and Fighting-types like Roaring Moon and opposing Zamazenta that Hisuian Samurott struggles with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 660324, "username": "GigaBytes7"}, {"user_id": 662575, "username": "boppydop!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 674261, "username": "Flames Of Elixir"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Excadrill": {"sets": {"Swords Dance": {}}},
  "Alomomola": {
    "sets": {
      "Defensive": {
        "description": "<p>Alomomola's massive HP stat allows it to be an effective user of Wish to support its ability to give teammates safe entry through Flip Turn. It can make use of Toxic to wear down opposing Pokemon that switch in on it and Pokemon that try setting up on it such as Terapagos, Ogerpon-W, and Great Tusk. Alomomola also appreciates Protect as a way to ensure it is able to use Wish and regain its own HP safely, scout opposing Pokemon's moves, notably Choice-locked attackers such as Tapu Lele as well as being able to build up Toxic damage on foes like Garchomp and Terapagos. Heavy-Duty Boots are another great tool for Alomomola, allowing it to safely switch into hazards to gain back health safely with Regenerator and use Wish to support teammates. The EV spread and Relaxed nature used allows Alomomola to comfortably sponge up hits from strong physical attackers such as Kingambit, Urshifu-R, and Great Tusk, while a Sassy nature allows it to have a more comfortable matchup into Mega Diancie and Terapagos. Alomomola makes use of 8 HP EVs to remain at an odd number HP stat so it can switch into hazards more optimally if its Heavy-Duty Boots are removed.</p> <p>Slower Pokemon that lack reliable recovery, like Ursaluna, Kingambit, and Melmetal, appreciate Alomomola's ability to bring them in safely and recover their HP with Wish against bulky Pokemon like Ting-Lu and Ferrothorn. Frail Pokemon such Iron Valiant also appreciate Alomomola's ability to safely get them on the field with Flip Turn. Alomomola's vulnerability to Grass- and Electric-type Pokemon like Rillaboom, Tapu Koko, and Kartana make Raging Bolt and Ferrothorn excellent partners due to their ability to easily shrug them off and regain whatever health is lost through Alomomola's ability to safely Wish pass into these Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 607465, "username": "EatFoods"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Ferrothorn": {
    "sets": {
      "Defensive": {
        "description": "<p>Ferrothorn is an excellent defensive Steel-type and entry hazard setter, since its Grass typing lends it resistances to Water and Electric as well as a neutrality to Ground, allowing it to more comfortably handle Pokemon like Ogerpon-W, Mega Swampert, Tapu Koko, and Raging Bolt, which other Steel-types like Mega Scizor and Gholdengo have more trouble against; being a Steel-type also naturally improves its matchup against Melmetal, Tapu Lele, and Rillaboom. Iron Barbs lets Ferrothorn pressure foes like Urshifu-R, Mega Lopunny, Melmetal lacking Protective Pads, and U-turn users like Landorus-T, forcing them to play more carefully lest they rack up chip damage very quickly with contact moves. Leech Seed is Ferrothorn's most reliable recovery, allowing it to pressure other passive Pokemon like Toxapex and Gliscor into wasting their healing moves, deal valuable chip damage to switch-ins that have no means of healing such as Cinderace and Heatran, and gradually recover HP with each use. Knock Off allows Ferrothorn to punish Heavy-Duty Boots users like Zapdos, Toxapex, and Tornadus-T as well as Leftovers users like Landorus-T, which is extremely valuable in forcing progress by making foes more susceptible to hazards or removing their recovery. Body Press allows Ferrothorn to surprise Kingambit and Kyurem, dealing massive damage to both and avoiding getting PP stalled by Kyurem; it also lets Ferrothorn hit Heatran on the switch and damage opposing Ferrothorn instead of idling. Gyro Ball snags Fairy-types like Tapu Lele and Iron Valiant on the switch and is better neutral coverage against foes like Dragonite, although it should be run with a Relaxed nature and 0 Speed IVs. Thunder Wave is niche, providing great value against offense teams, but since it is easily blocked by Gholdengo, it is often undesirable. Spikes is used over Stealth Rock when another setter is present on the team. The Special Defense EVs allow Ferrothorn to survive Choice Specs Tapu Lele's Focus Blast from full HP. Leftovers is nigh mandatory, providing much more consistent healing than Leech Seed and taking advantage of Ferrothorn's ability to sit on the field for many turns at a time. Rocky Helmet is a viable alternative, punishing U-turn users like Landorus-T and Urshifu-R as well as Rapid Spin from Great Tusk much harder; overall, it rewards risky play compared to Leftovers’s relative safety and should therefore allow Ferrothorn to be used more aggressively.</p> <p>Most wallbreakers pair well with Ferrothorn, taking advantage of the entry hazards it sets to break through defensive targets, but those that switch in on Ferrothorn's counters such as Gholdengo, Zamazenta, and Mega Charizard Y are particularly good; these wallbreakers include Kingambit, Mega Charizard Y, Tapu Lele, and Mega Tyranitar; Kingambit and Mega Tyranitar can also Pursuit trap Gholdengo. Gholdengo itself is also a good teammate, as it can deny Defog and switch in more easily against Pokemon like Tapu Lele and Iron Valiant. Ferrothorn's defensive utility is also appreciated by teammates like Toxapex and Landorus-T, which struggle with Electric-types like Tapu Koko and Water- and Ice-types like Hisuian Samurott and Kyurem, all of which Ferrothorn helps check. However, Ferrothorn does have a host of issues that require some support to cover. Ferrothorn's glaring Fire weakness is not even its biggest problem, given that having teammates like Toxapex, Heatran, and Alomomola around can easily blank Fire-type moves from the likes of Mega Charizard Y and opposing Heatran. Its main problem stems from its lack of instant recovery, making it more inclined to offensively oriented teams. Having Leftovers removed by Knock Off from foes like Kingambit, Mega Tyranitar, and opposing Ferrothorn or getting burned by Scald from foes like Toxapex renders it unable to heal without Leech Seed, and Leech Seed fails against Gholdengo and common Grass-types like Ogerpon-W and opposing Ferrothorn. Therefore, Ferrothorn is best played more offensively, using its unique defensive utility, Leech Seed, and Iron Barbs to force switches and hazard chip damage, granting immediate momentum when played aggressively while also not punishing the user for playing more carefully. Teammates that can absorb Knock Off, like Mega Tyranitar, and those that can absorb Will-O-Wisp, like Heatran and Clefable, are incredibly valuable teammates. Finally, Pokemon that can cover Ferrothorn's Fighting weakness are good defensively, including the aforementioned Gholdengo as well as Zapdos, Landorus-T, and Toxapex.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 637479, "username": "red fintans"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 674261, "username": "Flames Of Elixir"}, {"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Volcarona": {
    "sets": {
      "Offensive Quiver Dance": {
        "description": "<p>Quiver Dance Volcarona is a powerful wincon for many teams that are able to remove its few checks. This is thanks to Quiver Dance, which can allow it to outspeed and KO a worn-down team. At base 100 Speed, one Quiver Dance boost allows Volcarona to outspeed fast Pokemon like Mega Lopunny and Tapu Koko while also outspeeding common Choice Scarf Pokemon like Tapu Lele and Urshifu-R, meaning offensive counterplay against a boosted Volcarona is quite limited. Flamethrower is a strong, consistent STAB option; however, Fiery Dance gives Volcarona a chance to gain Special Attack boosts while still dealing respectable damage. Bug Buzz is a reliable move that notably lands the most damage on Mega Tyranitar, Ogerpon-W, and Ting-Lu. Hidden Power Ground can be used to hit common checks like Heatran and Toxapex, as they resist Volcarona’s STAB moves and can threaten it with either Toxic or their STAB moves, with Toxapex being able to beat Volcarona by itself with Haze. Physical priority moves, like Mega Lopunny’s Fake Out and Mega Scizor’s Bullet Punch, are commonly used to bypass Volcarona’s Speed boosts and hinder a sweep, and Flame Body is an opportunity to punish them for it. Heavy-Duty Boots is largely used to ignore the effects of Stealth Rock, as it can instantly deplete half of Volcarona’s health; however, negating the effects of Toxic Spikes and Sticky Web are also beneficial to a Volcarona sweep.</p> <p>Volcarona fits on offensive teams that can wear down or remove specific Pokemon that can prevent its sweep. For example, Pokemon like Moltres, Toxapex, and defensive Garchomp are clear roadblocks to a Volcarona sweep due to their advantageous typing, with the latter two using Toxic to wear Volcarona down. As a result, strong wallbreakers with complementary STABs of Ground or Fairy such as Great Tusk, Landorus-T, and Tapu Lele allow such Pokemon to be removed to facilitate a Volcarona sweep. Volcarona also struggles against priority, namely, Sucker Punch from Kingambit and Hisuian Samurott and Fake Out from Mega Lopunny. Tapu Lele acts as a great deterrent to such priority, also shutting down weaker attempts to end Volcarona’s sweep like Urshifu-R's Aqua Jet. Volcarona may have certain matchups where it may struggle to sweep, especially against bulkier teams. However, it can still leverage its potential threat level along with Quiver Dance to remove physical walls, like defensive Great Tusk. This can be taken advantage of by physical sweepers like Dragonite and your own Great Tusk, which both appreciate not needing to spend their Z-Move on it. Entry hazard support from teammates allows Volcarona to muscle through checks like the aforementioned Toxapex as well as offensive checks like Mega Charizard Y and Mega Tyranitar; Pokemon that can do this include Glimmora, Mega Diancie, and Landorus-T. Volcarona’s teammates can also take advantage of Toxapex’s passivity. In particular, sweepers that threaten Toxapex like Mega Latios, Tapu Lele, and Garchomp can force it to switch out, allowing them to grab a free setup turn.</p>"
      },
      "Bulky Quiver Dance": {
        "description": "<p>Volcarona's unique typing allows it to check Pokemon such as Iron Valiant, Melmetal, and Rillaboom as well as be a good pivot into Pokemon such as Zamazenta lacking Stone Edge, Mega Lopunny, and Kartana, potentially weakening them with a burn from Flame Body. At the same time, it retains its setup sweeping potential with Quiver Dance. Hidden Power Ground is necessary to hit opposing Fire-types, most notably Heatran, Iron Moth, and Cinderace, as well as Raging Bolt and Toxapex super effectively. Roost gives Volcarona much needed longevity, allowing it to pivot into strong attacks more reliably, such as Choice Specs Iron Valiant's Moonblast while also letting it set up on Pokemon such as Ferrothorn, Mega Venusaur, and Terapagos. The given EV spread allows Volcarona to outspeed Zamazenta after a Quiver Dance; the rest is dumped into physical defense, notably letting it avoid the OHKO from +2 Iron Valiant's Knock Off.</p> <p>While fitting well on balance and bulky offense builds, Volcarona trades power and coverage for longevity, worsening its weakness against bulky Dragon-types such as Roaring Moon, Dragonite, and Garchomp. Thus, Fairy-type teammates such as Tapu Koko and Tapu Lele are strong partners; the former additionally breaks through bulky Water-types like Toxapex and Alomomola for Volcarona, while the latter protects it from strong priority moves such as Kingambit's Sucker Punch and Urshifu-R's Aqua Jet. Dragon-type teammates, such as the aforementioned Roaring Moon and Garchomp, also appreciate Volcarona, since they need it to soft-check Fairy- and Steel-types they don't like dealing with, such as Iron Valiant, Mega Scizor, and Gholdengo, both offensively and defensively; Volcarona also takes care of Great Tusk for the former. In return, they are able to break through the bulky Fire-types that Volcarona struggles with, most notably Moltres and Mega Charizard Y, since they're immune to Hidden Power Ground. Garchomp is also able to provide Stealth Rock support, which helps Volcarona dismantle defensive cores including Mega Latios and Mega Tyranitar quicker, making up for the drop in power this set has; other Stealth Rock setters such as Landorus-T are also good options. On the defensive side, Volcarona appreciates bulky Water- and Grass-types such as Tapu Fini, Toxapex, Ferrothorn, and Tangrowth that can pivot into strong Water-type attacks from Hisuian Samurott, Urshifu-R, and Barraskewda on Rain teams, with Tapu Fini in particular protecting Volcarona from harmful status conditions such as poison from Alomomola and Gliscor, as well as checking Dragon-types such as Roaring Moon and Dragonite.</p>"
      },
      "Substitute + Swarm": {}
    },
    "credits": {"writtenBy": [{"user_id": 576909, "username": "BananaBro_Chaos"}, {"user_id": 604820, "username": "Sami"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 542295, "username": "Wildfiree"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 632421, "username": "Medasus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Tornadus-Therian": {
    "sets": {
      "Pivot": {
        "description": "<p>Tornadus-T is an effective pivot due to Regenerator, a Speed tier higher than threats such as Iron Valiant and Ogerpon-W, and its ability to effectively switch into Pokemon like Great Tusk and Kartana. Bleakwind Storm is preferred for higher accuracy, but Hurricane, especially when used with Flyinium Z, can be used for the extra power boost; even without the Z boost, it guarantees the OHKO on Ogerpon-W after Stealth Rock. Knock Off is vital to remove items such as Leftovers and Heavy-Duty Boots from Pokemon like Clefable, Heatran, and Toxapex, hindering their longevity. Heat Wave hits Gholdengo, Ferrothorn, and Mega Scizor. Defog is a potential option if a team does not have another form of entry hazard removal, especially since Tornadus-T has decent matchups against hazard setters such as Landorus-T and Great Tusk. However, losing the coverage to hit the aforementioned Steel-types is less than ideal. Heavy-Duty Boots allows Tornadus-T to gain Regenerator recovery even in the face of Stealth Rock; however, Flyinium Z can also be used to make attempts at revenge killing foes like unboosted Roaring Moon, Garchomp, and Mega Charizard Y more efficient. The given EVs help Tornadus-T survive a Stone Edge from Zamazenta after Stealth Rock and outspeed Iron Valiant.</p> <p>Tornadus-T fits on balance and bulky offense teams where its high Speed and vast amount of utility options are appreciated. Pokemon like Slowbro and Gholdengo appreciate Tornadus-T's ability to switch in on Grass- and Ground-types such as Landorus-T and Ogerpon-W, with the former also creating a Regenerator core that allows the pair to switch back and forth effortlessly against passive foes such as Toxapex and Gliscor. Wallbreakers such as Ogerpon-W and Tapu Lele take advantage of Tornadus-T's ability to pivot on defensive pieces these wallbreakers prey on, such as Gliscor and Toxapex. Electric-types such as Zapdos, Tapu Koko, and Raging Bolt are problematic for Tornadus-T, as they prevent it from gaining momentum easily, so checks to these Pokemon like Gliscor, Heatran, and Ting-Lu are all stellar partners. In return, Tornadus-T can ease matchups against foes like Great Tusk, Landorus-T, and Ogerpon-W. Tornadus-T can struggle to force progress against Steel-types such as Kingambit, Gholdengo, and Heatran, so teammates that can take advantage of Tornadus-T pivoting on them such as Urshifu-R and Garchomp are appreciated.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Tornadus-T acts as a formidable wallbreaker, taking advantage of its impressive Speed, solid Special Attack, and wide coverage options to set up with Nasty Plot; additionally its decent bulk and Regenerator allow it to exploit passive Pokemon, such as Corviknight and Alomomola, for setup opportunities. Nasty Plot allows Tornadus-T to boost its decent Special Attack to even greater heights, letting it break through defensive Pokemon like Toxapex, Gliscor, and Ferrothorn. Bleakwind Storm is an alternative STAB move with greater accuracy than Hurricane, although it is slightly weaker. Heat Wave hits Pokemon that are not threatened by Tornadus-T's STAB move, such as Gholdengo, Zapdos, and Ferrothorn. Focus Blast provides crucial coverage against Rock- and Steel-type foes that take little damage from Tornadus-T's STAB move and Heat Wave, such as Mega Tyranitar and Heatran, and also hits Ting-Lu for super effective damage. Taunt blocks Toxic from foes like Gliscor and Toxapex and Thunder Wave from Ferrothorn while additionally letting Tornadus-T effectively beat stall by itself. Flyinium Z allows Tornadus-T to secure KOs against the likes of Toxapex, Mega Diancie, and Mega Charizard Y, all of which get OHKOed after one Nasty Plot boost.</p> <p>Tornadus-T thrives on more offensively oriented team compositions, where it can contribute by setting up and breaking through opposing teams to support its allies. Its ability to pressure foes like Great Tusk, Ogerpon-W, and Iron Valiant opens up teammates such as Gholdengo, Heatran, and Ting-Lu to play more freely. Other Pokemon that appreciate Tornadus-T's wallbreaking capabilities include Urshifu-R and Raging Bolt, as they benefit from Tornadus-T's ability to pressure their respective checks like Slowbro and Ferrothorn. Ting-Lu, Garchomp, and Gliscor are also solid partners thanks to their ability to handle Electric- and Rock-type foes like Zapdos, Tapu Koko, and Mega Diancie that threaten Tornadus-T. Landorus-T also handles these threats, as well as providing Defog support, which Tornadus-T greatly appreciates due to its Stealth Rock weakness. Ferrothorn is another notable partner, as it can switch into any attack from the likes of Tapu Koko while also providing entry hazards for Tornadus-T. Terapagos is also a solid teammate for Tornadus-T because it provides Rapid Spin support, which Tornadus-T greatly appreciates due to its Stealth Rock weakness, and it is also a natural fit for offensive teams that Tornadus-T thrives in.</p>"
      },
      "Assault Vest": {
        "description": "<p>Using the Assault Vest in combination with Regenerator makes Tornadus-T a good pivot as well as a stellar blanket check and scout to most special attackers such as Iron Valiant, Tapu Lele, and Terapagos. Its excellent Speed tier also means Tornadus-T can revenge kill threats such as Ogerpon-W, unboosted Roaring Moon, and Iron Valiant lacking Booster Energy. Bleakwind Storm is preferred for its greater accuracy compared to Hurricane and not being hindered by Mega Charizard Y’s sun, but Hurricane can be considered for its greater power, especially on rain teams, as it can OHKO Ogerpon-W after Stealth Rock. U-turn maintains momentum for wallbreakers such as Tapu Lele and Hisuian Samurott. Heat Wave hits a plethora of Steel-types such as Gholdengo, Kingambit, and Ferrothorn. Knock Off allows Tornadus-T to force meaningful progress against balance structures, removing important items from Toxapex, Ting-Lu, Heatran, and Terapagos. The given EVs allow Tornadus-T to outspeed unboosted Roaring Moon while netting a 2HKO on offensive Kingambit.</p> <p>Tornadus-T can fit on both balance and offensive teams. Wallbreakers such as Raging Bolt and Ogerpon-W appreciate Tornadus-T giving them free entry against foes like Toxapex and Gliscor via U-turn while switching in on revenge killers such as Iron Valiant and Choice Scarf Tapu Lele. Pokemon like Toxapex and Slowbro form good Regenerator cores with Tornadus-T, as they, combined with Tornadus-T, can constantly switch back and forth against passive foes such as Ferrothorn and utility Gliscor. Entry hazard removal such as Terapagos, Great Tusk, and Landorus-T ease Tornadus-T’s Stealth Rock weakness, meaning it can more easily gain Regenerator recovery. Steel-types such as Heatran and bulky Gholdengo can stop Tornadus-T in its tracks, so partners like Garchomp and Mega Lopunny are solid teammates, especially because Tornadus-T can pivot them in against these foes. Pursuit users like Mega Tyranitar and Weavile are able to trap Tornadus-T and hinder its ability to consistently check foes like Iron Valiant, so insurance against these Pokemon like Zamazenta and Toxapex is appreciated. Teammates such as Ting-Lu and Ferrothorn also appreciate Tornadus-T removing Heavy-Duty Boots from Toxapex and Alomomola, allowing their hazards to affect them and effectively checking threats such as Iron Valiant and Great Tusk. In return, they stop dangers to Tornadus-T such as Raging Bolt and Zapdos. Finally, Tornadus-T can form VoltTurn cores with Pokemon like Tapu Koko and Iron Crown, which help keep up momentum and rack up chip damage alongside Tornadus-T.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}, {"user_id": 658067, "username": "Ineros"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 542295, "username": "Wildfiree"}, {"user_id": 632421, "username": "Medasus"}, {"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 681606, "username": "BrisingrDraconis"}]}]}
  },
  "Landorus-Therian": {
    "sets": {
      "Defensive": {
        "description": "<p>Boasting an excellent defensive typing alongside solid physical bulk bolstered by Intimidate, Landorus-T is able to act as a blanket check to most physical attackers. Taunt allows it to deny a plethora of common status moves, such as entry hazards from Ferrothorn and Ting-Lu, recovery attempts from Toxapex and Alomomola, Defog from Zapdos and Corviknight, Toxic from Gliscor and Moltres, and setup moves from Zamazenta and Mega Scizor. Toxic is an alternative that more immediately pressures Zapdos and Moltres while also wearing down Regenerator pivots such as Tornadus-T and Alomomola, which otherwise shrug off any of Landorus-T's attacks, and punishing setup attempts from the likes of Volcarona and Garchomp. Earth Power is an alternative to the standard Earthquake that deals significantly higher damage to Great Tusk and Zamazenta and also deals full damage in Grassy Terrain. Rocky Helmet is the item of choice, as it punishes weak contact moves, such as Tapu Koko's and Moltres's U-turn, that are further weakened by Intimidate. The given EV spread allows Landorus-T to outspeed Great Tusk without a Protosynthesis Speed boost, with a Jolly nature if using Earthquake as the Ground-type attack and Timid if it is Earth Power.</p> <p>Landorus-T's most glaring weakness is its lack of recovery, and thus fits best on more offensive teams that can more effectively take advantage of its limited turns while also appreciating Landorus-T's ability to easily handle Mega Lopunny and Zamazenta, which otherwise threaten most offensive structures. Teammates that can set up entry hazards such as Hisuian Samurott, Ferrothorn, and Toxapex appreciate Landorus-T utilizing Taunt to prevent most Defog users from removing their hazards. Landorus-T's ability to pivot via U-turn is greatly appreciated by frailer Pokemon such as Mega Medicham and Iron Valiant that otherwise struggle to safely enter the field. Another weakness of Landorus-T is its lackluster special bulk, which can be mitigated by teammates such as Ferrothorn, Toxapex, and Mega Scizor. These teammates also cover Landorus-T's type weaknesses, the former two covering its weakness to Water-type attacks from the likes of Urshifu-R and Ogerpon-W, while the latter two resist Ice-type attacks from foes such as Weavile and Kyurem.</p>"
      },
      "Swords Dance": {
        "description": "<p>Offensive Landorus-T can be a true terror, as this set allows it to break through Pokemon that would normally switch into it, such as Gliscor, Alomomola, and Great Tusk. Swords Dance makes Landorus-T very threatening to slower teams, enabling it to break through Pokemon that would normally check it such as Ferrothorn and Alomomola. Stone Edge lets Landorus-T target foes like Zapdos and Mega Charizard Y. This set has a good matchup against most entry hazard removal options in the tier, so it keeps Stealth Rock up against foes like Corviknight and opposing Landorus-T. This can also dissuade Pokemon like Mega Charizard Y and non-Heavy-Duty Boots Dragonite from coming in on it. Fly targets foes like Great Tusk, Zamazenta, and Rillaboom. When running Fly, Flyinium Z should be used, as it gives Landorus-T the opportunity to OHKO Great Tusk and Zamazenta while also luring in Pokemon like Alomomola for big damage. With Rockium Z, Landorus-T can KO foes like Skarmory and Corviknight with the combination of +2 Continental Crush and Stone Edge; otherwise, these two would come in comfortably on Landorus-T.</p> <p>This variant of Landorus-T is usually found on more offensive structures. These teams appreciate Landorus-T's Electric immunity to block Volt Switch and Raging Bolt's Thunderclap. Landorus-T's ability to pressure physical walls like Alomomola can enable teammates like Kingambit and Melmetal. These teammates appreciate Landorus-T being able to pressure their switch-ins, such as Great Tusk and Zamazenta, with Flyinium Z or Rockium Z for Corviknight. Landorus-T in turn appreciates Kingambit spamming Knock Off. Iron Valiant appreciates Landorus-T being able to remove its checks, such as Toxapex and Galarian Slowking, so that it can clean up in the late-game. Landorus-T is vulnerable to Water-type Pokemon such as Ogerpon-W and Urshifu-R, so it appreciates Pokemon like Raging Bolt and Dragonite to switch in and force these foes out. Landorus-T can struggle with Ice-types, as they outspeed and OHKO it; therefore, teammates like Ferrothorn and Kingambit are appreciated.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Landorus-T functions as an excellent late-game cleaner and revenge killer due to its ability to outspeed Pokemon such as Tapu Koko and Mega Diancie and threaten important defensive pieces such as Heatran, Gholdengo, and Kingambit with Earthquake. It can also leverage its excellent defensive typing and Intimidate to perform as a switch-in to Garchomp, Dragonite, and opposing Landorus-T. Stone Edge hits Flying-types such as Zapdos, Mega Charizard Y, and Moltres, OHKOing the latter two. Defog allows Landorus-T to capitalize on forced switches by removing entry hazards, while Explosion allows it to deal large damage to Pokemon such as Ogerpon-W and Rotom-W and gain momentum when at low HP. 8 HP EVs allow Landorus-T to switch in on Stealth Rock one extra time.</p> <p>Choice Scarf Landorus-T largely fits on bulky offense teams, where its high Speed and ability to threaten common defensive pieces such as Gholdengo and Kingambit are appreciated. However, Landorus-T struggles to break Flying-types such as opposing Landorus-T, Gliscor, and Zapdos. This means teammates that can break these such as Kyurem and Weavile are appreciated; in return, Landorus-T breaks Steel-types such as Kingambit and Melmetal for them and can bring them in safely via U-turn. Landorus-T also finds it difficult to break through common defensive pieces such as Ferrothorn and Ting-Lu, meaning Fighting-types that beat them such as Zamazenta, Urshifu-R, and Mega Lopunny are all appreciated. In return, Landorus-T breaks through Toxapex and revenge kills Tapu Koko and Mega Diancie for them. Landorus-T finds itself vulnerable to Water-types such as Choice Scarf Urshifu-R as well as rain sweepers such as Mega Swampert and Barraskewda. This means switch-ins such as Mega Latios and Ferrothorn are enjoyed, with Landorus-T breaking Steel-types and Mega Tyranitar for the former. Landorus-T also struggles with strong priority from Pokemon such as Weavile, meaning teammates such as Tapu Lele are appreciated, with Landorus-T breaking Steel- and Poison-types for it and allowing it to use Moonblast more freely.</p>"
      },
      "Lead": {
        "description": "<p>Landorus-T is one of the best suicide leads in the tier, as its huge Attack stat, great defensive typing, and useful utility movepool allow it to consistently set up Stealth Rock and deny the foe from setting it up itself. Taunt stops any Pokemon slower than Landorus-T, including Glimmora, Gliscor, Clefable, and other Landorus-T, from either setting up entry hazards, setting up boosts, or using Defog. Explosion is useful for OHKOing or heavily chunking Pokemon like Great Tusk, Terapagos, Ogerpon-W, and Tornadus-T that could either remove Landorus-T’s hazards or use it as setup fodder; it also provides a free switch-in for a teammate to start applying pressure. Focus Sash allows Landorus-T to take almost any hit, allowing it to set up Stealth Rock or chip foes down with Earthquake or Explosion.</p> <p>Landorus-T is an amazing Pokemon on hyper offense teams, as it can easily set up Stealth Rock and chip down foes for its teammates to start pressuring the opposing team. Pokemon like Garchomp and Volcarona appreciate Landorus-T chipping their checks with hazard damage while also being able to heavily damage Pokemon like Great Tusk and Clefable with Explosion. Pokemon that can hit Landorus-T multiple times, either through multi-hit moves from Weavile and Urshifu-R or from Fake Out from Mega Lopunny and Mega Medicham, can render it useless, as it can’t set up Stealth Rock in front of these Pokemon. Therefore, teammates like Volcarona, Dragonite, and Mega Scizor are useful to force out these Pokemon before Landorus-T comes in. Pokemon that can easily remove Landorus-T’s hazards like Great Tusk, Tornadus-T, and Gliscor can also be very problematic, so teammates like your own Great Tusk, Air Balloon Gholdengo, and Ogerpon-W can threaten them and consistently deny them chances to remove hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 542295, "username": "Wildfiree"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528036, "username": "Sulo"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 657738, "username": "vaderaven"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Kyurem": {
    "sets": {
      "SubRoost": {},
      "Offensive": {
        "description": "<p>With Heavy-Duty Boots, Kyurem can leverage its decent natural bulk and perfect movepool to clobber otherwise solid answers. Ice Beam and Freeze-Dry are fantastic STAB options; the latter is able to maul structures reliant on bulky Water-types to stymy the assault of powerful Ice Beams. Hidden Power Fire and Earth Power serve as excellent coverage to hit the Steel-types that would otherwise be able to survive the onslaught, with Hidden Power Fire targeting Ferrothorn and Mega Scizor and Earth Power chunking Gholdengo and Galarian Slowking for more damage while maiming defensive Heatran. Draco Meteor, while less broadly applicable in its targets, can secure important interactions, OHKOing Raging Bolt, Roaring Moon, and Mega Latios, which would otherwise survive an Ice Beam from full health. Roost enables Kyurem to shrug off the chip damage it can often accumulate throughout a game at the expense of further offensive prowess.</p> <p>Kyurem finds itself most fitting on bulkier teams that can provide it with opportunities to switch out reliably. With the ability to outspeed almost every Ground-type in the tier, Kyurem can find ample opportunities to exploit its coverage and extremely powerful STAB combination, especially against bulkier and slower structures. Kyurem is a one-stop-shop to handle common Gliscor and Toxapex structures while also doing extremely well versus offenses reliant on Alomomola and Slowbro to be their defensive backbone. Kyurem is not without weaknesses—its middling Speed tier and weak defensive typing means it is often outpaced and forced out by threatening offensive staples such as Zamazenta and Mega Diancie. Kyurem thus pairs extremely well with teammates that form a strong defensive core that it can rely on to absorb some of the pressure it inevitably incurs. Ting-Lu and Pecharunt serve to stymy the assault from Mega Latios and the aforementioned Zamazenta, respectively. Galarian Slowking is an extremely powerful defensive partner, with invaluable resistances to Fighting- and Fairy-type attacks as well as access to Thunder Wave, crippling the faster threats that would otherwise force Kyurem out. Galarian Slowking also boasts access to Chilly Reception, which provides a slow pivot to get Kyurem onto the field safely with the bonus of snow, boosting its already solid Defense. Pecharunt with Parting Shot serves a similar role, with its Fighting immunity and Fairy resistance making it a reliable answer to the ever-threatening Iron Valiant, Zamazenta, Urshifu-R, and Ogerpon-W that can all force Kyurem into a corner. Bulky Gholdengo provides additional offensive pressure along with a robust answer to Tapu Lele, and it can serve to soften targets for Kyurem to clean through or trade out with offensive powerhouses that would deny Kyurem from wreaking havoc. Bulky Gholdengo retains access to Thunder Wave to provide the aforementioned paralysis that Kyurem exploits so well. Mega Lopunny and Zamazenta make for excellent offensive partners, being able to rely on Kyurem to handle the bulkier structures that they tend to otherwise struggle against.</p>"
      },
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"user_id": 661238, "username": "slopcat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Chesnaught": {"sets": {"Defensive": {}}},
  "Greninja": {"sets": {"Battle Bond": {}}},
  "Hawlucha": {
    "sets": {
      "Unburden Sweeper": {
        "description": "<p>Hawlucha acts as a threatening setup sweeper, being able to use its combination of Unburden and Swords Dance to clean up games. Substitute is used in order to find setup opportunities against foes such as Alomomola and Ferrothorn as well as Ground-types like Landorus-T and Gliscor, allowing Hawlucha to take advantage of their inability to hit it hard enough to break its Substitute. Hawlucha can also avoid Thunderclap from Raging Bolt and Sucker Punch from Kingambit. 228 Speed EVs are used to let Hawlucha outspeed maximum Speed Volcarona at +2 after Unburden activates. Electric, Grassy, and Psychic Seed are used with their respective Terrains in order to activate Hawlucha's Unburden, doubling its Speed as well as boosting the Base Power of Acrobatics to 110.</p> <p>Hawlucha fits on hyper offense and bulky offense teams, where its ability to clean up games is appreciated. In order to activate Hawlucha's Unburden, it needs Terrain support from a teammate like Tapu Koko for Electric Terrain, Rillaboom or Tapu Bulu for Grassy Terrain, or Tapu Lele for Psychic Terrain. These Pokemon can also whittle down Hawlucha’s checks such as Gholdengo, Toxapex, and Slowbro. Hawlucha struggles to beat Electric-types such as Zapdos and Tapu Koko, meaning Pokemon that can switch into them such as Iron Treads and Ting-Lu are valued. In return, Hawlucha can turn Gliscor and Alomomola into setup fodder, which is appreciated because they would otherwise come in on Iron Treads and Ting-Lu relatively comfortably. If not yet boosted, Hawlucha struggles to break through Psychic- and Fairy-types such as Tapu Lele, Clefable, and Slowbro. All of these foes survive neutral Acrobatics and threaten Hawlucha with their STAB moves, meaning Steel-types such as Melmetal and Gholdengo are enjoyed. In return, Hawlucha can break through other Steel-types such as Heatran for them. Due to Hawlucha struggling to break through bulky Pokemon such as Gholdengo without boosts, entry hazard setters such as Mega Diancie, Iron Treads, and Landorus-T are beneficial, as their residual damage whittles down Hawlucha's checks over the course of a game. Teammates such as Kingambit and Mega Gyarados are also helpful to beat the aforementioned Gholdengo, with Hawlucha in return beating Fighting-types such as Zamazenta and Great Tusk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 643347, "username": "calmvibes"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Diancie": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Mega Diancie is a very potent wallbreaker that applies a lot of offensive pressure to bulky offense and balance builds, threatening Pokemon such as Zapdos, Raging Bolt, and Great Tusk. Mega Diancie’s coverage further cements its role as a wallbreaker; for example, Earth Power hits foes such as Heatran, Gholdengo, Melmetal, and Toxapex that would otherwise come in safely on its STAB moves. Mystical Fire provides even more coverage, hitting foes such as Ferrothorn and Mega Scizor. Power Gem avoids the drawback of possibly forcing Mega Diancie to run a nature that decreases Defense or Special Defense, improving its ability to take on Pokemon such as Raging Bolt. Diamond Storm can be used as well with 28 Attack EVs to improve the matchup versus Pokemon such as Galarian Slowking, scoring a 2HKO on it. Mega Diancie does well versus common forms of entry hazard removal such as Terapagos lacking Earth Power, Great Tusk, Zapdos, and Tornadus-T. Mega Diancie is a unique hazard setter that can set up hazards while denying common opposing hazard setters in Heatran and Mega Tyranitar.</p> <p>Mega Diancie fits on bulky offense teams and pairs well with Pokemon such as Great Tusk, Ferrothorn, and Landorus-T that appreciate it due to its ability to threaten and force out Pokemon such as Mega Charizard Y, Volcarona, Zapdos, and Hisuian Samurott with its STAB attacks. In return, Great Tusk and Landorus-T check threats such as Mega Lopunny, Iron Head Kingambit, and Assault Vest Melmetal, which threaten Mega Diancie directly. Landorus-T also brings Mega Diancie in safely with a U-turn against Pokemon that like to come in on it such as Tornadus-T, Mega Charizard Y, and Great Tusk, which Mega Diancie punishes. Mega Diancie tends to struggle with fast offensive Water-types such as Ogerpon-W, Choice Scarf Urshifu-R, and Mega Swampert in the rain. Thus, Pokemon such as Dragonite, Raging Bolt, and Ferrothorn can keep these foes in check.</p>"
      },
      "Lead": {
        "description": "<p>Mega Diancie functions as an amazing hyper offense lead, being able to set up Stealth Rock behind Substitute while also denying opposing entry hazards via Magic Bounce. Mega Diancie's main niche over other hazard setters is its ability to deny hazards from pokemon such as Glimmora and Landorus-T, as well as blocking taunt and encore from Pokemon like Tornadus-T and Iron Valiant, making it harder for them to deny hazards. Endeavor lets Mega Diancie heavily chip Moonblast switch-ins like Moltres, Corviknight, and Heatran when at low HP. Staying in base forme is often an option in order to set Stealth Rock on faster Pokemon due to Diancie's superior bulk. 240 HP EVs allow Mega Diancie to set Substitute four times as opposed to three, leaving Mega Diancie at 1 HP to use Endeavor with.</p> <p>Being a hyper offense lead, Mega Diancie's main function is to set entry hazards to enable one of the archetype's many sweepers to punch through defensive cores and win the game, often being able to give them free switch ins by wearing itself down via Substitute. Examples of Pokemon that benefit from these hazards include Kingambit, Volcarona, and Great Tusk, since they all appreciate Stealth Rock chipping down Pokemon such as Corviknight, Heatran, and Landorus-T for them to break through more easily. However, lead Mega Diancie can sometimes be threatened by super effective attacks from faster foes such as Choice Scarf Urshifu-R, as well as by strong priority moves from Pokemon such as Choice Band Rillaboom and Mega Scizor. These can be taken care of by partners such as Dragonite, which can safely switch in on Urshifu-R, Landorus-T, and Rillaboom, and Volcarona, which switches in on and threatens Rillaboom and Mega Scizor with its strong STAB moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 658067, "username": "Ineros"}, {"user_id": 514772, "username": "sealoo"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Hoopa-Unbound": {"sets": {"Choice Band": {}, "Assault Vest": {"description": "<p>252 HP EVs and 56 Special Defense EVs let Hoopa-U live a Never-Ending Nightmare from a boosted Gholdengo when at full HP, 64 Attack EVs let it OHKO Kingambit with Drain Punch after Stealth Rock, and 16 Speed EVs let it outspeed Adamant Kingambit.</p>"}}},
  "Volcanion": {"sets": {"Wallbreaker": {}, "Choice Specs": {}}},
  "Primarina": {"sets": {"Offensive Calm Mind": {}, "Bulky Calm Mind": {}, "Assault Vest": {}}},
  "Ribombee": {"sets": {"Sticky Web": {"description": "<p>192 Defense EVs let Ribombee live a Surging Strikes from Urshifu-R at full HP.</p>"}}},
  "Toxapex": {
    "sets": {
      "The Pex": {
        "description": "<p>Armed with a superb defensive typing, excellent mixed bulk, one of the best abilities in the game, and an extremely disruptive support movepool, Toxapex entrenches itself as a staple defensive piece in the metagame. These traits allow Toxapex to counter several dangerous Pokemon, such as Zamazenta, Mega Charizard Y, and Urshifu-R. Scald lets Toxapex reliably spread burn onto several Toxic-immune Pokemon, notably Melmetal, Ferrothorn, and Kingambit. On the other hand, Knock Off can remove important items from the likes of Zapdos, Moltres, and Melmetal. Toxic combines with Scald or Knock Off to make Toxapex quite challenging to switch into and allows it to ruin threats such as Roaring Moon, Ogerpon-W, and Moltres. Toxapex is also the tier's best user of Toxic Spikes, which are very challenging for common Pokemon like Great Tusk, Raging Bolt, and Ogerpon-W to deal with. Haze allows Toxapex to sit on boosting threats such as Volcarona, Zamazenta, and Iron Valiant. Recover keeps Toxapex healthy while staying in battle, combining with Regenerator to make Toxapex extremely hard to wear down. Heavy-Duty Boots allows Toxapex to pivot into entry hazards without fear of being worn down, letting it more easily check threats such as Mega Charizard Y. Rocky Helmet can be used to chip physical attackers such as Zamazenta and Hisuian Samurott while also punishing U-turn attempts from the likes of Mega Lopunny, Mega Scizor, and Urshifu-R. Black Sludge gives Toxapex passive recovery, allowing it to better stay healthy versus opponents such as Volcarona and Mega Lopunny, and it has niche use versus Trick users such as Iron Valiant. The given EV spread allows Toxapex to take a +2 Power Whip from Ogerpon-W at full health, while the rest of the EVs are dumped into Special Defense to improve matchups versus Mega Charizard Y and Volcarona.</p> <p>Toxapex is a staple on bulkier playstyles thanks to its absurd longevity and ability to force progress through spreading chip damage. Gliscor is a notable teammate, as it has great defensive synergy with Toxapex; it appreciates Toxapex checking Water-types such as Urshifu-R and Hisuian Samurott, while in return it deals with Electric-types such as Raging Bolt and Zapdos. The two are also generally hard to break thanks to their immense longevity when paired together, and they can outlast many common threats such as Landorus-T, Ogerpon-W, and Great Tusk if played well. Toxapex does well on hazard stack teams, as it forces quite a few switches, uses Knock Off to remove Heavy-Duty Boots from foes such as Great Tusk, Terapagos, and Zapdos, and punishes many of the tier's hazard removal options with Toxic or a Scald burn. Ferrothorn is an exemplary partner that can set Stealth Rock and Spikes while also checking certain Grass-types that Toxapex has to be very careful around, most notably Ogerpon-W. Gholdengo is another excellent partner, as it checks dangerous Psychic-types like Tapu Lele and Mega Medicham and prevents opposing hazard removal thanks to Good as Gold and its Ghost typing. Gholdengo, as well as the previously mentioned Ferrothorn, appreciate Toxapex pivoting into dangerous Fire-types like Mega Charizard Y and Volcarona. Slow-paced, bulky wincons, such as Swords Dance Gliscor, bulky Volcarona, and Calm Mind Clefable, appreciate Toxapex spreading chip damage and synergize very well with Toxic Spikes, as they become very hard to beat when the opponent's team is getting slowly worn down while they stay healthy with their recovery moves and boost up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}]}]}
  },
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Kommo-o": {"sets": {"Offensive Z-Move": {}, "Defensive": {"description": "<p>32 Defense EVs with an Impish nature let Kommo-o take Mega Lopunny's Close Combat twice from full HP after Stealth Rock.</p>"}}},
  "Tapu Koko": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Tapu Koko is a very consistent offensive pivot that can fit on a variety of teams, threatening a plethora of Water- and Flying-types such as Toxapex, Slowbro, Tornadus-T, and Zapdos. Tapu Koko also has a remarkable ability to consistently switch into the tier's Electric-types such as Zapdos and Raging Bolt, the aforementioned Flying-types, and Fighting-types such as Zamazenta while also having a Speed tier that outruns many threats such as Ogerpon-W and Tornadus-T. Hidden Power Ice enables Tapu Koko to hit foes such as Landorus-T, Gliscor, and Garchomp while also doing significant damage to Great Tusk. Dazzling Gleam can be used to hit foes such as Raging Bolt and Great Tusk much harder than Hidden Power Ice, though it is significantly weaker against Gliscor and Landorus-T. U-turn allows Tapu Koko to pivot out of Pokemon that handle it defensively such as Galarian Slowking and Ting-Lu while also wearing them down. Volt Switch can be used to avoid chip from contact while dealing decent damage, though it is able to be blocked by Ground-type Pokemon such as Great Tusk and Landorus-T. Electrium Z is used to give Tapu Koko a one-time boost to its already strong Thunderbolt and help it pick off weakened threats such as Melmetal and Heatran and OHKO Pokemon such as Ogerpon-W and Mega Diancie. Fairium Z can be used as an alternative to immediately OHKO foes such as Great Tusk and Raging Bolt.</p> <p>Pokemon such as Iron Valiant and Hawlucha appreciate Tapu Koko’s Electric Surge setting Electric Terrain and activating their abilities. The former also appreciates Tapu Koko beating defensive Pokemon such as Toxapex and Tornadus-T. Landorus-T also likes Tapu Koko as a partner, as it likes its Flying-type checks such as Tornadus-T, Zapdos, and Corviknight being answered by Tapu Koko. In return, Landorus-T brings it in with a U-turn on Pokemon such as Tornadus-T and it immediately threatens Pokemon such as Galarian Slowking, which walls Tapu Koko. Tapu Koko struggles to break through specially bulky Pokemon such as Ferrothorn, Galarian Slowking and Ting-Lu, so it appreciates powerful physical wallbreakers such as Mega Medicham, Urshifu-R as well as Pursuit support from Kingambit and Mega Tyranitar. In return, Tapu Koko is able to easily pivot them in with U-turn on these aforementioned checks in addition to checking the Flying-type Pokemon that they struggle with.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Tapu Koko makes use of its fast Speed and explosive power to act as a great early-game wallbreaker, dealing out large damage even against neutral targets like Tapu Lele, Gholdengo, and Zapdos. Tapu Koko's Speed allows it to outspeed Pokemon already considered fast, such as Ogerpon-W, Mega Diancie, and Mega Charizard Y. As Tapu Koko breaks down walls like Alomomola and Slowbro, Pokemon like Hawlucha can use that opportunity to clean up easily late-game. Either Volt Switch or U-turn allows Tapu Koko to exert pressure while providing pivoting for the team, with the former being a respectable offensive move itself, while the latter is undeterred by Ground-types such as Garchomp. Hidden Power Ice allows Tapu Koko to do massive damage to Ground-types such as Landorus-T and Great Tusk, notably OHKOing Landorus-T.</p> <p>Tapu Koko fits best on offensive teams, as its Speed, wallbreaking power, and pivoting options are most appreciated by its offensively minded teammates. Due to Tapu Koko's Electric Terrain and its wallbreaking prowess, Quark Drive Pokemon are the clearest beneficiaries, especially those that seek to sweep late-game like Swords Dance Iron Valiant and Iron Moth. Other sweepers also synergize with Tapu Koko, largely since it puts major pressure on some of their checks. For example, Hawlucha appreciates the removal of Slowbro, Moltres, and Toxapex, while Dragonite appreciates the removal of Corviknight and Moltres. Tapu Koko's STAB moves can be walled by several Pokemon, such as Clodsire, Ferrothorn, and Iron Treads. As a result, it appreciates help from the likes of Mega Medicham, Weavile, and Great Tusk. Mega Medicham especially makes for a fierce wallbreaking duo with Tapu Koko, with the former able to dismantle Galarian Slowking and Ferrothorn, two Pokemon that can easily wall Tapu Koko. In return, Tapu Koko can pressure Pokemon that Mega Medicham may struggle to hit, notably Gholdengo and Slowbro.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Tapu Koko serves as a potent special attacker and wincon, thanks to Terrain-boosted Thunderbolt and its great Speed stat, allowing it to outspeed common foes that are considered fast, such as Mega Diancie and Ogerpon-W. Using its Calm Mind boosts, Tapu Koko deals a great amount of damage to neutral targets, such as Ogerpon-W, Gholdengo, and Tapu Lele. Tapu Koko can even OHKO Electric-resistant and -immune threats, such as Raging Bolt and Gliscor after Stealth Rock chip using Twinkle Tackle boosted by Fairium Z after one Calm Mind boost. Calm Mind boosts make Tapu Koko capable of setting up in front of foes like Clefable and Raging Bolt. Roost offers reliable recovery, increasing Tapu Koko's longevity by shrugging off attacks from foes like Raging Bolt and healing off entry hazard damage.</p> <p>Calm Mind Tapu Koko fits well on balance teams that appreciate its ability to both revenge kill fast threats like Ogerpon-W and act as a wincon late-game. Pokemon like Urshifu-R and Volcarona benefit from Tapu Koko's ability to pressure bulky Water- and Flying-type foes, such as Toxapex and Moltres; Urshifu-R appreciates the removal of Toxapex and Alomomola while Volcarona appreciates the removal of Moltres and Toxapex. In return, Volcarona and Urshifu-R deal with troublesome walls like Ferrothorn and Ting Lu. Entry hazards like Stealth Rock and Spikes synergize incredibly with Tapu Koko, as they help it secure KOs more reliably and clean up late-game, wearing down checks like Heatran and Ferrothorn. Therefore, entry hazard setters like Ferrothorn, Ting-Lu, and Gliscor are solid partners. Ferrothorn is a notable hazard-setting partner, as it is also able to switch in on troublesome foes for Tapu Koko, such as Melmetal and Ting Lu. There are several Pokemon that can take on Tapu Koko's STAB combination even after Calm Mind boosts, such as Galarian Slowking and Heatran. As a result, Tapu Koko appreciates teammates that threaten these Pokemon, such as Great Tusk and Mega Medicham. Tapu Koko is vulnerable to Ground-types, such as Choice Scarf Landorus-T and Iron Treads, especially because the latter can also take hits from Tapu Koko; therefore, defensive checks like Alomomola and Zapdos are great partners due to their ability to switch in on these Ground-types.</p>"
      },
      "Dual Screens": {
        "description": "<p>Tapu Koko's high Speed allows it to act as a good dual screens lead for hyper offense structures. U-turn gives Tapu Koko a source of momentum for and way to pivot into its teammates, notably being able to pivot against Ground-types such as Landorus-T and Great Tusk that Tapu Koko struggles with. Taunt allows Tapu Koko to deny opposing setup from foes, whether it be entry hazards like Spikes from Ferrothorn or boosting moves like Quiver Dance from Volcarona; this is essential so that Tapu Koko is not completely passive as it sets up, which is especially important to make sure its teammates are not overwhelmed by hazards or boosted threats afterwards.</p> <p>Because of its ability to set Electric Terrain as it sets up dual screens, Quark Drive Pokemon such as Iron Valiant, Iron Moth, and Iron Crown make for fantastic partners, which are able to utilize Tapu Koko's dual screens to set up more comfortably. Iron Moth in particular is able to threaten Corviknight from removing screens via Defog and check Gholdengo, which sets up on Tapu Koko thanks to Good as Gold ignoring Taunt. Similarly, Hawlucha makes for a fantastic teammate, since it is able to reliably set up on the Ground-types that Tapu Koko doesn't like, such as Landorus-T and Iron Treads, while having Taunt to prevent Defog attempts from Zapdos and Tornadus-T; in return, Tapu Koko's Electric Terrain triggers Unburden for Hawlucha through Electric Seed to outspeed threats like Mega Swampert in rain, and boosted Iron Valiant, letting the two handle opposing offense teams more comfortably. Typical offensive threats such as Garchomp, Gholdengo, and Volcarona all appreciate dual screens support for their setup, with the former also being able to set up Stealth Rock to soften up walls while Gholdengo helps maintain dual screens by blocking Defog from Tornadus-T and Corviknight. Terapagos is a strong partner too, being able to remove hazards that Tapu Koko cannot deny safely, such as from Landorus-T, Great Tusk, and Gliscor.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 564420, "username": "Lialiabeast"}, {"user_id": 576909, "username": "BananaBro_Chaos"}, {"user_id": 604820, "username": "Sami"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 658067, "username": "Ineros"}, {"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 493260, "username": "Marnie"}, {"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Tapu Lele": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Tapu Lele functions as a great speed control option while still retaining its devastating STAB combination and good wallbreaking power. Its STAB moves threaten a myriad of foes such as Zamazenta, Great Tusk, and unboosted Garchomp that would otherwise outspeed Tapu Lele, while Focus Blast nails Steel-types like Melmetal, Ferrothorn, and Kingambit. Hidden Power Fire allows Tapu Lele to hit Mega Scizor and Gholdengo super effectively, while Psyshock lets Tapu Lele break through specially defensive walls, 2HKOing Galarian Slowking as an example. Future Sight allows Tapu Lele to set up its teammates that otherwise struggle with Poison-types and physical walls, like Zamazenta or Mega Lopunny, to pose an even larger threat considering their best checks like Toxapex and Alomomola are reticent to switch in lest they get blasted.</p> <p>Tapu Lele fits well on balance teams looking for a way to solve their speed control problems while retaining good power. Fighting-types like the aforementioned pair as well as Urshifu-R make natural partners for Tapu Lele, as both break one another's checks; the Fighting-types break through troublesome Steel-types like Ferrothorn and specially defensive Heatran so that Tapu Lele does not have to risk Focus Blast's accuracy woes while Tapu Lele scares out Poison-types like Toxapex to let the trio of Fighting-types break through. Said Fighting-types also help wonders against Pursuit trappers such as Mega Tyranitar and Kingambit attempting to trap and remove Tapu Lele. Mega Tyranitar is another great partner for Tapu Lele, as it removes a pair of Tapu Lele's biggest checks in Gholdengo and Galarian Slowking thanks to Pursuit while dealing major damage to specially defensive stopgaps such as Heatran. Hazard setters like Gliscor and Ferrothorn also pair well with Tapu Lele, as they weaken Tapu Lele's checks like offensive Gholdengo and Ferrothorn into range of being KOed by one of Tapu Lele's STAB options or Hidden Power Fire, lessening its burden of prediction.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Tapu Lele functions as a potent wallbreaker, being able to muscle through common defensive cores with its STAB move combination and coverage. Moonblast and Psychic largely cover each other's weaknesses, making it difficult for defensive pieces such as Ting-Lu and Toxapex to switch in. Psyshock hits Pokemon with high Special Defense, such as Blissey and Galarian Slowking. Focus Blast targets Steel-types such as Kingambit, Heatran, and Melmetal, while Hidden Power Fire threatens Mega Scizor, Gholdengo, and Ferrothorn more reliably. Focus Blast is generally preferred to avoid getting fully walled by Heatran, which can otherwise switch in reliably.</p> <p>Fighting-types such as Urshifu-R and Zamazenta appreciate Tapu Lele's ability to punch through checks such as Toxapex and Mega Venusaur. In return, both teammates break through Steel-types, and Urshifu-R beats Moltres, enabling Tapu Lele to use its STAB moves more freely; they also beat Pursuit trappers that can sometimes be problematic for Tapu Lele. Tapu Lele also appreciates Pursuit users such as Mega Tyranitar and Kingambit trapping Ghost-types such as Gholdengo. Tapu Lele often finds itself vulnerable to faster threats such as Roaring Moon, meaning fast teammates such as Speed Booster Energy Iron Valiant are appreciated. Tapu Lele also appreciates Spikes setters such as Ting-Lu and Ferrothorn, with Ting-Lu providing a good switch-in to both Gholdengo and Roaring Moon, which Tapu Lele struggles with. Tapu Lele values Spikes, as it chips common checks such as Heatran, allowing Tapu Lele to clean up games more easily. In general, setup sweepers benefit from Psychic Terrain support, notably including Dragonite, Scale Shot Garchomp, and Volcarona, as it gives them an immunity to powerful priority moves from Pokemon such as Kingambit and Mega Lopunny. Tapu Lele also breaks Pokemon such as Ting-Lu for these teammates.</p>"
      },
      "Offensive Z-Move": {
        "description": "<p>Tapu Lele is a fearsome wallbreaker, attributing its success to its Psychic Terrain-boosted attacks, ability to threaten metagame staples such as Gliscor, Toxapex, Raging Bolt, and Great Tusk, and lack of prediction mandated by a Choice item. Focus Blast allows Tapu Lele to hit the Steel-types that would plague it, such as Melmetal, Kingambit, Ferrothorn, and Heatran. Psyshock is an option over Psychic to hit Pokemon like Volcarona, Galarian Slowking, and Blissey; however, Psychic is usually preferred due to its higher damage against targets like Moltres and Gliscor. Hidden Power Fire and Future Sight are other options over Calm Mind; the former is a consistent way of hitting Ferrothorn, Mega Scizor, and Gholdengo, whereas the latter pairs well with wallbreakers like Zamazenta and Ogerpon-W while also being Tapu Lele’s strongest form of Shattered Psyche. With Fightinium Z, Tapu Lele OHKOes Melmetal lacking Assault Vest and Assault Vest Kingambit while also having a favorable roll to OHKO Ferrothorn after Stealth Rock. Psychium Z gives Tapu Lele a burst of power that guarantees the OHKO on Pokemon like Clefable, Tornadus-T, and Gliscor.</p> <p>Tapu Lele is a good option on offense and bulky offense teams that appreciate it punching holes in fat and balance teams, which have limited ways of pivoting around it. Pokemon like Kingambit, Zamazenta, and Ogerpon-W like Tapu Lele breaking through their checks such as Toxapex, Raging Bolt, and Great Tusk. These Pokemon also appreciate the potential Future Sight support Tapu Lele can give. Tapu Lele likes Pursuit from Weavile, Mega Tyranitar, and Kingambit, as they help remove checks such as Gholdengo, Iron Crown, and Assault Vest Tornadus-T. Tapu Lele has a middling Speed tier that allows threats like Ogerpon-W and Mega Charizard Y to easily outpace and revenge kill it. Therefore, teammates like Garchomp, Ferrothorn, and Kingambit are appreciated. However, it should be noted that Psychic Terrain blocks Kingambit’s Sucker Punch.</p>"
      },
      "Assault Vest": {
        "description": "<p>This set aims to bolster Tapu Lele's special bulk, allowing it to soft-check Pokemon like Raging Bolt and opposing Tapu Lele while still breaking through physically defensive foes such as Landorus-T and Great Tusk. Psychic is good at chunking physical walls like Garganacl and Gliscor, while Psyshock works well against Galarian Slowking, Blissey, and Clodsire. Focus Blast lets Tapu Lele beat out most Steel-types like Kingambit and Iron Treads along with Mega Tyranitar, while Hidden Power Fire enables Tapu Lele to incinerate Mega Scizor, Ferrothorn, and Gholdengo. 176 Speed EVs on Tapu Lele allow it to outrun Adamant maximum Speed Rillaboom and Hisuian Samurott.</p> <p>Assault Vest Tapu Lele fits well on offensive teams that need it to sponge special attacks while also threatening foes like Great Tusk and Raging Bolt. It also has the ability to block priority moves, which is appreciated by Gholdengo and Iron Valiant, since they're protected against Kingambit and Mega Scizor, respectively, among others. Steel-type teammates like Melmetal and Heatran pair nicely with Tapu Lele, due to it threatening out Fighting-types like Great Tusk and Iron Valiant that these Pokemon would otherwise lose to; in return, they beat foes like Roaring Moon and Gholdengo for it. Tapu Lele is weak to physical attacks, so physical walls like Landorus-T and Great Tusk are a good fit with it to cover for physical threats like Heavy Slam Zamazenta and Garchomp, while Tapu Lele takes special attacks from the likes of Kyurem and Raging Bolt. Pivoting moves like U-turn from the aforementioned Landorus-T and Moltres are also appreciated for safely bringing in Tapu Lele. Hawlucha is good to consider with Psychic Seed, allowing it to activate Unburden and clean Steel-types like Melmental and Kingambit, while Tapu Lele helps it deal with Poison-types like Toxapex and Clodsire with its Psychic-type STAB moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542721, "username": "Amuetur"}, {"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 632421, "username": "Medasus"}, {"user_id": 658067, "username": "Ineros"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 589016, "username": "Danbear02"}, {"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Tapu Bulu": {"sets": {"Offensive Z-Move": {}, "Defensive": {"description": "<p>220 HP EVs maximize Grassy Terrain recovery, and 92 Defense EVs let Tapu Bulu take Return from Mega Lopunny twice at full HP.</p>"}}},
  "Tapu Fini": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Buzzwole": {"sets": {"Physical Wall": {}}},
  "Celesteela": {"sets": {"Defensive": {"description": "<p>16 Defense EVs with a Relaxed Nature lets Celesteela live Mega Lopunny's Combat from full.</p>"}}},
  "Kartana": {
    "sets": {
      "Paper Cut": {},
      "Paper Plane": {},
      "Paper Fan": {
        "description": "<p>Kartana functions as a unique offensive Defogger. It uses its good defensive typing and access to reliable recovery in Synthesis to offensively check threatening Ground-types while removing the entry hazards that they set. Its ability to threaten common hazard setters such as Gliscor, Ting-Lu, Great Tusk, and Hisuian Samurott makes it a decent Defogger even in spite of its relatively mediocre matchup versus Gholdengo. Knock Off is the preferred coverage move, as it applies some pressure to Gholdengo. It also removes items from Pokemon such as Zapdos, Moltres, and Dragonite that this Kartana set cannot pressure much otherwise, although Dragonite and bulky Gholdengo can still set up on it. Sacred Sword is an alternative that allows Kartana to check Kingambit and pressure Ferrothorn and Melmetal more appreciably than Knock Off, although being a Defogger that cannot pressure Gholdengo at all is not preferable. Grassium Z alongside 120 EVs in Attack allows Kartana to OHKO offensive Garchomp with Bloom Doom. 136 EVs are put into HP to allow Kartana to take a couple more hits and notably allow it to take a Ogerpon-W Superpower from full health.</p> <p>Kartana fits well on certain offensive teams that value its ability to offensively check Ground-types such as Great Tusk, Garchomp, and Ting-Lu. It does this while removing entry hazards and remaining fairly threatening on its own terms. It is an especially good fit on sun teams anchored by Mega Charizard Y, as they require multiple forms of hazard removal and tend to dislike facing many of the tier's Ground-types, especially Garchomp. Kartana's Synthesis also gains a boost when under sun. Kartana's inability to break bulky Gholdengo without significant support is a major hinderance, so teams utilizing it must have other ways to pressure it. Strong Ground- and Fire-types such as Great Tusk, Garchomp, Mega Charizard Y, and Heatran can assist Kartana in taking down Gholdengo and can take advantage of Kartana often forcing Gholdengo to use Recover. They can also pressure Mega Scizor, which is another problematic matchup. Kartana also synergizes well with hazard setters on its own team, as it can potentially beat Gholdengo with Spikes support and force a Knock Off onto foes reliant on Heavy-Duty Boots. Spikes setters such as Gliscor or Stealth Rock setters such as Great Tusk, Garchomp, and Kommo-o are therefore good partners. Kartana's horrible Special Defense prevents it from switching into virtually any special attacker, so teammates such as Galarian Slowking, Gliscor, and Moltres are good teammates. These three are also capable of slotting in pivoting moves, which allows them to keep up momentum for Kartana's offensive teammates. Kartana also often appreciates a second Steel-type, as it defensively functions very differently from other Steel-types due to its inability to check threats such as Tapu Lele, Mega Latios, and Mega Diancie. Gholdengo, Heatran, and Melmetal are good teammates as a result.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 591294, "username": "Lightniong"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 240732, "username": "Astra"}]}]}
  },
  "Blacephalon": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Melmetal": {
    "sets": {
      "Toxic + Protect": {
        "description": "<p>The combination of Toxic and Protect allows Melmetal to force chip damage onto foes by inflicting them with debilitating status while keeping itself healthy. This makes Melmetal hard to wear down over the course of a game. Earthquake smacks many Toxic-immune Steel-resistant Pokemon, such as Heatran, Toxapex, and Gholdengo. Protect lets Melmetal force even more Toxic damage onto foes, therefore allowing it to consistently chip them down. It also allows Melmetal to scout for dangerous coverage moves, such as Fighting-type coverage from Tapu Lele and Gholdengo and Fire-type coverage from Zapdos, as well as ease prediction against common Choice item users like Landorus-T, Zamazenta, and Tapu Lele. Leftovers combined with Protect makes it quite hard to wear down Melmetal over time. The given EV spread allows Melmetal to take a +2 Supreme Overlord-boosted Knock Off from Kingambit at full health and outspeed Toxapex.</p> <p>Melmetal fits well onto balance and bulky offense teams. These teams appreciate Melmetal's bulk allowing them to stave off threats such as Tapu Lele, Terapagos, and Tornadus-T while forcing progress against defensive cores consisting of common Pokemon such as Alomomola, Zapdos, Moltres, and Landorus-T. Melmetal struggles to pressure certain Steel-types, most notably Ferrothorn and Skarmory, and it is forced out by other common Pokemon like Heatran, Gliscor, and Air Balloon Gholdengo. Fire-types like Mega Charizard Y, Volcarona, and Iron Moth are choices that can pressure Ferrothorn, Skarmory, and Gholdengo, while Ground- and Fighting-types like Landorus-T and Iron Valiant threaten Heatran. Late-game cleaners, such as Iron Valiant, Kingambit, and Zamazenta, appreciate Melmetal chipping down standard defensive cores consisting of Pokemon such as Ting-Lu, Zapdos, and Alomomola, therefore giving them an easier time cleaning up late-game. Swords Dance Iron Valiant is notable for its ability to break through Gliscor, another obstacle in Melmetal's goal to make progress. Alomomola is another great partner, using Wish to keep Melmetal healthy while checking several foes that are problematic for it, such as Landorus-T, Urshifu-R, and Great Tusk. Other specially bulky partners such as Toxapex, Ting-Lu, and specially defensive Garchomp can shore up Melmetal's rather mediocre special bulk while also checking Mega Charizard Y, Volcarona, and Heatran.</p>"
      },
      "Assault Vest": {
        "description": "<p>Melmetal gains impressive mixed bulk when equipped with an Assault Vest, allowing it to check threats such as Tapu Lele, Mega Diancie, and Terapagos while dishing out significant damage in return. Ice Punch slams Landorus-T, Garchomp, and Gliscor on the switch. It is also Melmetal's best way to hit Zapdos, but it needs to be careful due to the risk of getting paralyzed by Static. Thunder Punch hits Alomomola, Moltres, and Slowbro, although Flame Body from Moltres makes pressuring it this way risky; it is also the best way to pressure Toxapex if not running Earthquake. Earthquake allows Melmetal to hit Heatran, Kingambit, and Gholdengo hard. Superpower can be used instead in order to threaten Ferrothorn and Kartana while still hitting Heatran and Kingambit, but the stat drops are detrimental, and Melmetal loses its best way to hit Gholdengo. The given EV spread gives Melmetal enough bulk to take two Focus Blasts from Tapu Lele and enough speed to outrun Toxapex.</p> <p>Assault Vest Melmetal works best on bulky offense and offense teams, as they appreciate its combination of bulk and wallbreaking power while being able to work around its limited longevity. Melmetal's lack of recovery leaves it very vulnerable to chip damage, especially from Spikes. Entry hazard removal from the likes of Landorus-T, Great Tusk, and Terapagos is therefore very important. Great Tusk is notable, as it appreciates Melmetal checking dangerous Psychic- and Grass-types, like Tapu Lele and Ogerpon-W, and it can use Ice Spinner to threaten dangerous Ground-types like Landorus-T and Gliscor. Alomomola is another notable partner, as it can get Melmetal into battle safely with Flip Turn while also passing it Wishes to keep it healthy. Alomomola also helps to check Fire-types like Heatran and Ground-types like Landorus-T and Great Tusk. Fast, frail offensive threats like Iron Valiant and Urshifu-R love Melmetal taking hits from revenge killers like Choice Scarf Tapu Lele, Raging Bolt, and Kingambit while also breaking down the opposing team with its powerful attacks, therefore letting them clean up later.</p>"
      },
      "Thunder Wave": {
        "description": "<p>Melmetal's ability to reliably spread Thunder Wave while remaining quite dangerous offensively makes it a great support Pokemon. It can also become deadly in mid- to late-game scenarios thanks to its tendency to paraflinch its way through otherwise decent checks like Toxapex, Ferrothorn, and Slowbro with Double Iron Bash. Thunder Wave allows Melmetal to spread paralysis onto potential switch-ins such as Mega Charizard Y and Volcarona. Thunder Punch pressures Alomomola, Toxapex, and Moltres. Superpower is the preferred coverage move, as it hits threats like Ferrothorn, Kingambit, Heatran, and Kartana hard. Earthquake can be considered instead, however, as it hits Gholdengo while also hitting Heatran harder than Superpower. Protective Pads prevents Melmetal from being threatened by contact-punishing traits like Rocky Helmet on Landorus-T and Alomomola, Iron Barbs on Ferrothorn, Static on Zapdos, and Flame Body on Moltres and Volcarona. Punching Glove should be used instead if running Earthquake, as it prevents Double Iron Bash and Thunder Punch from making contact while slightly boosting their power. 92 Speed EVs allow Melmetal to outrun a paralyzed Heatran and Ting-Lu.</p> <p>Melmetal fits on team styles ranging from offense to balance thanks to its unique blend of support combined with strong offensive pressure. Thunder Wave Melmetal does well with teammates centered around benefitting from paralysis. Strong, slow wallbreakers like Mega Medicham, Ursaluna, and Mega Tyranitar love having fast threats slowed down. They can form a deadly double wallbreaking core with Melmetal, which remains dangerous in its own right and can check revenge killers such as Kartana, Ogerpon-W, and Tapu Lele. Hex Gholdengo is also a great partner, as it can unleash a fully powered up Hex onto paralyzed foes; Teammates that deal with threatening Ground-types such as Landorus-T, Great Tusk, and Gliscor are also good to have, as Melmetal cannot paralyze them and is forced out by them. Water- and Grass-types, such as Ogerpon-W, Urshifu-R, and Rillaboom, can threaten them offensively, while defensive checks like Zapdos and Alomomola work as well.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rillaboom": {
    "sets": {
      "Choice Band": {
        "description": "<p>Rillaboom is a viable wallbreaker and cleaner thanks to Grassy Surge giving its STAB moves higher power and providing priority to Grassy Glide. U-turn allows Rillaboom to keep up momentum for its team and gives it utility versus teams packing several Grass-resistant Pokemon. Superpower allows Rillaboom to slam Ferrothorn, Heatran, and Kingambit. Knock Off 2HKOes all variants of Gholdengo and allows Rillaboom to remove items from the likes of Zapdos, Moltres, and Corviknight. High Horsepower is an option that OHKOes offensive Gholdengo, OHKOes uninvested Raging Bolt after Stealth Rock, and still hits Steel-types like Heatran, Melmetal, and Kingambit hard, but the benefits are generally very marginal compared to what Superpower and Knock Off offer. Choice Band combined with an Adamant nature allow Rillaboom to hit as hard as possible, and, combined with Grassy Surge, notably makes Wood Hammer 2HKO even bulky resists such as Galarian Slowking and Kingambit.</p> <p>Rillaboom makes for an interesting addition to teams thanks to its unique offensive profile alongside providing its team with Grassy Terrain support. Grassy Terrain is excellent support for several of the tier's Steel-types, as it removes their weakness to Earthquake and provides them with additional recovery. Melmetal, Gholdengo, and Kingambit are notable beneficiaries that also switch into Ice- and Bug-type attacks from Mega Scizor, Kyurem, and Weavile for Rillaboom. They can also help pressure their shared checks in Moltres, Zapdos, and Corviknight via Knock Off from Kingambit, status from Melmetal, or raw wallbreaking power from Gholdengo. Rillaboom greatly dislikes Fire-types, as Heatran, Mega Charizard Y, and Moltres all have a 4x resistance to its STAB moves and threaten it in return. Bulky Water- and Dragon-types such as Toxapex, Mega Latios, Raging Bolt, and Dragonite can safely come in on these threats and force them out, although Toxapex fears being trapped by Heatran. Roaring Moon, Alomomola, and Slowbro are less ironclad against these specific threats but make up for that via their pivoting moves to get Rillaboom in safely and create a pivoting core with it. Rillaboom's Grassy Glide makes it adept at revenge killing faster Water-, Ground-, and Rock-types such as Urshifu-R, Mega Diancie, and Great Tusk. This is appreciated by teammates such as Moltres, Heatran, and Kingambit, which often find themselves forced out by these threats and therefore appreciate Rillaboom acting as insurance versus them.</p>"
      },
      "Bulky Swords Dance": {
        "description": "<p>Rillaboom makes for a solid revenge killer thanks to its high Attack and access to Grassy Glide, allowing it to shut down faster offensive threats such as Ogerpon-W, Tapu Lele, and Mega Diancie. Its good HP stat and Grass typing also give it a niche defensive profile, doing well against Water- and Ground-types such as Urshifu-R, offensive Landorus-T, and the aforementioned Ogerpon-W. Swords Dance allows Rillaboom to punish switches into defensive Pokemon such as Ferrothorn, boosting its Attack to make Rillaboom a strong wallbreaker if positioned well. Drain Punch allows Rillaboom to hit Steel-types such as Heatran and Kingambit, easily OHKOing the latter with entry hazard support, while also enabling Rillaboom to beat Ferrothorn one-on-one, with its healing effect negating damage taken when setting up. Alternatively, Superpower notably OHKOes Melmetal when boosted, after a layer of Spikes. Knock Off hits Gholdengo, Pecharunt, and Galarian Slowking, all of which would otherwise counter Rillaboom. It also removes Heavy-Duty Boots off of Flying-type Pokemon such as Tornadus-T, Zapdos, and Moltres, preventing them from reliably switching in. The given EV spread allows Rillaboom to outspeed uninvested Gliscor while hitting as hard as possible, the rest being dumped in bulk, notably allowing Rillaboom to avoid the OHKO from Moltres's Flamethrower.</p> <p>Rillaboom works best on bulky offense and balance teams that can support it with a strong defensive backbone as well as with partners that synergise with it offensively, and they appreciate Rillaboom wearing down foes such as Ferrothorn, Zapdos and Toxapex. Rillaboom works well with Steel-types such as Gholdengo, Melmetal, and Heatran, since they are all able to handle the powerful Ice- and Dragon-types that Rillaboom cannot, such as Kyurem, Mega Latios, and Raging Bolt; Heatran is an especially good partner, since it is also able to handle Fire-types, such as Moltres and Mega Charizard Y, that Rillaboom struggles with, and it can also setup Stealth Rock, allowing Rillaboom to break through and revenge kill foes such as Landorus-T and Ogerpon-W more easily. In return, Rillaboom's Grassy Surge weakens Earthquake from opposing Ground-types such as Garchomp and Gliscor while also providing passive recovery for Melmetal and Heatran, shoring up their recovery issues. Rillaboom also does well against opposing Water-types such as Hisuian Samurott for Fire-types, such as Volcarona, Cinderace, and the aforementioned Heatran. Offensive partners such as Mega Diancie, Iron Valiant, and Raging Bolt all appreciate Rillaboom breaking past defensive cores involving Ferrothorn, Alomomola, and Gliscor with Swords Dance as well as revenge killing would-be checks to them such as Choice Scarf Urshifu-R and Tapu Koko, so that they can successfully sweep and clean through opposing teams more easily; Mega Diancie and Iron Valiant are also further checks to Dragon-types such as Garchomp and Dragonite.</p>"
      },
      "Swords Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 604820, "username": "Sami"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 632421, "username": "Medasus"}, {"user_id": 662575, "username": "boppydop!"}, {"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Cinderace": {"sets": {"Pivot": {}, "Setup Sweeper": {}}},
  "Corviknight": {"sets": {"Physically Defensive": {}, "Bulk Up + Substitute": {}}},
  "Barraskewda": {"sets": {"Rain Wallbreaker": {}}},
  "Hatterene": {"sets": {"Calm Mind": {}, "Healing Wish": {}}},
  "Grimmsnarl": {"sets": {"Dual Screens": {}}},
  "Zamazenta": {
    "sets": {
      "All-Out Attacker": {
        "description": "<p>All-out attacking Zamazenta is a fearsome wallbreaker thanks to its great base Attack stat alongside colorful coverage, allowing it to hit a large portion of the metagame for tons of damage. Its defensive profile also allows it to stick around as a check to Dark-types like Kingambit and Hisuian Samurott. Crunch complements Close Combat well, 2HKOing Ghost- and Psychic-types like offensive Gholdengo and Galarian Slowking that easily take Close Combat. Stone Edge snipes Moltres and Zapdos attempting to inflict a Flame Body burn or a Static paralysis onto Zamazenta while taking on two offensive checks in the form of Volcarona and Mega Charizard Y. Ice Fang allows Zamazenta to majorly damage Gliscor and Landorus-T, while Heavy Slam lets Zamazenta deal with troubling Fairy-types trying to use it as a way to enter the field such as Tapu Lele and Iron Valiant. Heavy-Duty Boots give Zamazenta more chances to throw off its powerful attacks.</p> <p>Zamazenta fits well on balance and offensive teams alike, threatening and being able to come in on metagame staples like Kingambit, Hisuian Samurott, and Mega Tyranitar. Physically defensive walls such as Great Tusk and Toxapex can shrug off hits from Zamazenta all day long, so a partner that threatens them such as Tapu Lele is a nice addition to let Zamazenta force progress. Additionally, Tapu Lele can set Future Sight, preventing these checks from switching in as easily. In return, Zamazenta smashes Steel-types that can parry Tapu Lele's attacks like Assault Vest Melmetal. Zamazenta greatly appreciates entry hazard setters such as Hisuian Samurott and Landorus-T that force answers like Toxapex and opposing Landorus-T to take damage every time they attempt to check Zamazenta. It also appreciates Hisuian Samurott scaring the aforementioned Ghost- and Psychic-types away from Zamazenta as well as Landorus-T threatening Poison-types like the aforementioned Toxapex. Kingambit traps and removes Mega Latios and Galarian Slowking for Zamazenta as well as removing items like Leftovers or Heavy-Duty Boots from shared checks like Corviknight or physically defensive Toxapex to make Zamazenta's life easier. Finally, Steel-types like Gholdengo and Heatran form a great core with Zamazenta, as they are able to beat down Zamazenta's walls like Galarian Slowking and defensive Gholdengo while taking on threatening Fairy-types like Choice Scarf Tapu Lele and Iron Valiant, protecting Zamazenta from being revenge killed as easily.</p>"
      },
      "Iron Defense + Body Press": {
        "description": "<p>With a nearly unmatched Speed tier and superb bulk further boosted by Dauntless Shield, Zamazenta doubles as both a setup sweeper and an offensive check to a plethora of dangerous physical attackers, such as Kingambit, Ogerpon-W and Garchomp. Zamazenta can exploit these threats with Iron Defense, simultaneously making it more difficult to revenge kill and boosting the power of Body Press. Crunch targets Gholdengo, which is immune to Body Press, and Galarian Slowking, while Stone Edge hits Volcarona, Moltres, and Zapdos while avoiding Flame Body and Static from them. With Substitute, Zamazenta can avoid status moves from passive Pokemon such as Alomomola and Gliscor while also providing a buffer to frail revenge killers such as Iron Valiant. Alternatively, Zamazenta can use Roar to force out Pokemon that attempt to boost alongside it, such as Skarmory, Corviknight, and opposing Zamazenta. Roar also provides a means of making progress against the defensive teams Zamazenta generally struggles against when paired with Spikes setters such as Ting-Lu, Ferrothorn, and Gliscor. Rest, with Chesto Berry, provides instant recovery and lets Zamazenta beat checks reliant on status moves such as the aforementioned Alomomola and Gliscor; it also gives Zamazenta another chance to sweep if it had already been afflicted with status earlier in the game, such as through Flame Body from Volcarona. However, this comes with the opportunity cost of losing coverage or utility while making Zamazenta much more vulnerable to Knock Off from the likes of Kingambit and Mega Tyranitar, threats Zamazenta is often tasked with switching into. Finally, with Attack investment, Zamazenta can run Heavy Slam to more immediately threaten Fairy types such as Clefable and particularly Iron Valiant as well as Tapu Lele. Specifically, 200 Atk enables Zamazenta to OHKO Tapu Lele, 2HKO Clefable after Leftovers, and OHKO Iron Valiant after one layer of Spikes. However, other options are generally more useful in most matchups. 132 Atk / 124 Def / 252 Spe guarantees a 2HKO on Offensive Gholdengo with Crunch and an OHKO on Specially Defensive Moltres with Stone Edge, while 252 HP / 4 Def / 252 Spe maximizes its mixed bulk. A spread of 4 Atk / 252 Def / 252 Spe can also be run to maximize Body Press damage on resisted targets such as Landorus-T, though this makes Zamazenta more easily revenge killed by special attackers such as Iron Valiant.</p> <p>Zamazenta's fantastic anti-offense capabilities in its Speed tier and defensive utility enable it to fit on offense and balance teams alike. Zamazenta generally has weaker matchups against balance and defensive teams, which often carry multiple checks and counters such as Toxapex, Gholdengo, and Clefable, sometimes leaving it nearly incapable of making progress on its own. For these reasons, powerful wallbreakers such as Kingambit, Garchomp, Ogerpon-Wellspring, and Raging Bolt are necessary to account for these poor matchups, also benefitting from Zamazenta's capacity to switch into their offensive checks such as Mega Lopunny and Weavile. Pursuit support from Kingambit, Mega Tyranitar, and Weavile is highly recommended, especially when dropping Crunch, in order to trap the Psychic- and Ghost-types that may otherwise check or counter Zamazenta such as Slowbro, Gholdengo, and Pecharunt. Moreover, despite Zamazenta's solid mixed bulk, it can still be forced out by special attackers such as Raging Bolt, Tapu Lele, and Iron Valiant. As a result, specially defensive Pokemon such as Assault Vest Melmetal, Ting-Lu, and Moltres are great partners, complementing Zamazenta's ability to blanket check most physical attackers. Kingambit is arguably Zamazenta's best partner, enjoying Zamazenta's incredible speed and ability to switch into its checks, such as Great Tusk and Mega Lopunny, while using its highly complementary offensive and defensive profile to check and trap threats to Zamazenta such as Choice-locked Tapu Lele and Gholdengo not carrying Focus Blast. Kingambit's Knock Off also removes Rocky Helmet from Landorus-T and Heavy-Duty Boots from the likes of Zapdos and Moltres, weakening Zamazenta's checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 573467, "username": "Moisture99"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Urshifu-R is a good late-game cleaner and revenge killer due to its ability to threaten defensive Pokemon like Heatran, Gliscor, Great Tusk, Landorus-T, and Ferrothorn with its powerful STAB moves. It also sports a great Speed stat, allowing it to outspeed the majority of the unboosted metagame, including Mega Lopunny and Zamazenta. Surging Strikes's guaranteed critical hit chance means Urshifu-R ignores the Attack drop from Landorus-T's Intimidate and the Defense boost from Zamazenta's Dauntless Shield. U-turn helps Urshifu-R to keep up momentum throughout the course of a game, and also take advantage of defensive switch-ins like Toxapex and Alomomola for its teammates to set up on. Aqua Jet allows Urshifu-R to pick up KOs on Pokemon that are at low HP but outspeed it, like Speed Booster Energy Iron Valiant and Unburden Hawlucha. Ice Spinner is a great tool in assuring high damage on important targets like Dragonite and Mega Latios.</p> <p>Urshifu-R is a great choice on more balance-oriented teams as the speed control option, and it loves the company of teammates like Landorus-T, which helps Urshifu-R by setting up Stealth Rock and forming a good pivoting core with it. Mega Diancie is great at helping Urshifu-R deal with bulky Dragon-types like Dragonite and Kyurem, and it can take a Choice Specs Moonblast from Iron Valiant and KO it back; it can also set up entry hazards. While Landorus-T only has the option of setting up Stealth Rock, Gliscor can choose to be a Spikes setter helping to cut into the health of the bulky Water-types that wall Urshifu-R even further. Urshifu-R has the ability to break most Steel-types, most notably Ferrothorn, so it can pave the way for Steel-weak Pokemon like Tapu Lele; in return, Tapu Lele is able to help Urshifu-R with most Dragon-types, most notably Dragonite, which it struggles to hit if it is not running Ice Spinner. One of the biggest Urshifu-R checks is Iron Valiant, which can take all of its attacks and KO it back with Moonblast. Mega Scizor can safely switch into Iron Valiant's moves and threaten high damage with Bullet Punch. Urshifu-R's powerful Close Combat neutralizes Dark-types such as Kingambit and Mega Tyranitar, which paves the way for teammates like Mega Latios and Mega Latias. Their strong special STAB moves are also a boon for Urshifu-R, as they can take advantage of bulky Water-types like Alomomola and Toxapex, which otherwise wall it. Electric-types like Raging Bolt and Tapu Koko are also great in this regard, with Urshifu-R being able to help with Ground-types like Iron Treads and Gliscor in return. Urshifu-R is heavily hindered by abilities and items that punish it for making contact, most notably Static from Zapdos and Flame Body from Moltres, as they are able to switch into Urshifu-R's Close Combat and U-turn and punish it via status conditions. Bulkier Gholdengo sets are also a big Urshifu-R deterrent, as it can tank both of its STAB moves and hit back hard with Shadow Ball or ruin it with Thunder Wave. Thus, Urshifu-R appreciates the presence of Pokemon like Mega Tyranitar and Kingambit, as they can Pursuit trap Gholdengo, with Mega Tyranitar also being able to safely get rid of Zapdos and Moltres.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance Urshifu-R functions as an amazing late-game cleaner due to its ability to boost its Speed with Trailblaze and its Attack with Swords Dance. Trailblaze allows Urshifu-R to outspeed the majority of the tier, including common Pokemon such as Mega Lopunny and even Choice Scarf users such as Tapu Lele and Landorus-T; it is best used to finish off low HP foes as a way to safely boost Speed. Aqua Jet is also an option in order to revenge kill Mega Diancie, Volcarona, and Tapu Koko at low HP. Protective Pads is used in order to ignore Static from Zapdos, Flame Body from Moltres and Volcarona, and contact damage from Ferrothorn, allowing it to break more freely.</p> <p>Urshifu-R fits primarily on hyper offense and bulky offense teams, where its strong STAB moves coupled with Swords Dance allow it to shred through defensive structures with ease. Urshifu-R is able to break through defensive pieces such as Landorus-T, Great Tusk, and Gliscor with its strong Surging Strikes, which is appreciated by teammates such as Gholdengo and Kingambit. In return, Gholdengo can beat problems such as Toxapex and Iron Valiant, and Kingambit can put pressure on switch-ins such as Slowbro. Urshifu-R is also able to threaten Steel-types such as Kingambit and Melmetal with its STAB boosted Close Combat, allowing teammates such as Tapu Lele to break through teams more easily. In return, Tapu Lele breaks through Toxapex and Mega Venusaur for Urshifu-R. Urshifu-R finds itself weak to Grass-types such as Ogerpon-W and Kartana, both of which outspeed unboosted Urshifu-R, meaning switch-ins such as Raging Bolt and Ferrothorn are appreciated. As well as this, Ferrothorn can set Stealth Rock for Urshifu-R, chipping switch-ins such as non Heavy-Duty Boots Dragonite and Raging Bolt. Urshifu-R also has trouble setting up against opposing offense and can easily be revenge killed by Pokemon such as Iron Valiant and Choice Scarf Tapu Lele before setting up, meaning switch-ins such as Gholdengo and Galarian Slowking are appreciated, with the latter also being able to bring Urshifu-R in safely via Chilly Reception.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Urshifu-R acts as a formidable wallbreaker, boasting a high Attack stat, an excellent offensive typing, and a great combination of coverage moves to break through weakened teams. Thanks to its typing, Urshifu-R can effectively break down defensive Pokemon like Ting-Lu, Garganacl, and Ferrothorn. Urshifu-R generates momentum with U-turn, pivoting out of unfavorable matchups like Toxapex while dealing considerable chip damage to foes like Ogerpon-W and Rillaboom. Aqua Jet revenge kills weakened faster threats like Volcarona, Iron Moth, Tapu Koko, and Iron Valiant. Alternatively, Urshifu-R can use Ice Spinner to threaten Pokemon, which resist both its STAB moves, like Dragonite and Mega Latias, while Thunder Punch targets bulky Water-types, such as Toxapex and Alomomola.</p> <p>Urshifu-R's wallbreaking ability and pivoting are appreciated by offensive and balanced teams. Iron Valiant and Tapu Lele form a great offensive core with Urshifu-R, as they benefit from Urshifu-R's ability to remove their checks like Ferrothorn and Moltres. In return, Iron Valiant and Tapu Lele can deal with troublesome foes like Raging Bolt. Volcarona appreciates Urshifu-R's ability to deal with the likes of Heatran and Ting-Lu while easily pivoting into Grass-types such as Rillaboom. Pokemon like Tapu Koko and Dragapult form a solid pivoting core, bringing each other in on their checks. Urshifu-R comes in against foes like Ferrothorn and Melmetal while Tapu Koko and Dragapult come in against walls like Toxapex and Tangrowth. Entry hazard setters, such as Landorus-T and Ferrothorn, are great partners for Urshifu-R, as it benefits from Stealth Rock and Spikes wearing down switch-ins like Ogerpon-W late-game. Ferrothorn also switches into Tapu Koko and Iron Valiant, which would revenge kill Urshifu-R with ease.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}, {"user_id": 574893, "username": "Dahness"}, {"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 589016, "username": "Danbear02"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 594972, "username": "Murphy Lawden"}]}]}
  },
  "Ursaluna": {"sets": {"Swords Dance": {}}},
  "Enamorus": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Meowscarada": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Skeledirge": {"sets": {"Defensive": {"description": "<p>132 Defense EVs let Skeledirge live Zen Headbutt from Mega Medicham twice at full HP.</p>"}}},
  "Garganacl": {"sets": {"Stealth Rock": {}}},
  "Ceruledge": {"sets": {"Swords Dance": {}}},
  "Tinkaton": {"sets": {"Utility": {}}},
  "Glimmora": {"sets": {"Lead": {}, "Meteor Beam": {}}},
  "Dondozo": {"sets": {"Wall": {}}},
  "Clodsire": {"sets": {"Defensive": {}}},
  "Kingambit": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Kingambit is a highly threatening sweeper thanks to Swords Dance boosting its already high Attack, powerful STAB priority in Sucker Punch, and a unique ability in Supreme Overlord. Kingambit also provides a team with notable defensive utility, as it checks dangerous foes such as Gholdengo, Mega Latios, and Iron Crown thanks to its typing and access to Sucker Punch. Knock Off is Kingambit's most powerful STAB move under most circumstances, and it can remove items from Pokemon that check it, such as Great Tusk, Zamazenta, and Landorus-T. Sucker Punch is mandatory to make up for Kingambit's low Speed, allowing it to revenge kill faster threats such as the aforementioned Gholdengo and Mega Latios as well as others such as Ogerpon-W, Volcarona, and Iron Moth. Low Kick is the preferred coverage to hit foes such as opposing Kingambit, Melmetal, Ferrothorn, and Ting-Lu, as it OHKOes all of them after Stealth Rock at +2. Iron Head is an alternative that hits Clefable and Mega Diancie, but its targets are generally less important and Kingambit must be very healthy if it hopes to beat the latter one-on-one. Black Glasses gives Kingambit a notable boost to its Dark-type STAB moves, letting it hit important benchmarks such as OHKOing offensive Gholdengo as well as, at +2, Ogerpon-W with Sucker Punch and greatly improving Knock Off's damage rolls into important defensive Pokemon such as Alomomola and Toxapex, especially with Supreme Overlord active. Air Balloon gives Kingambit a one-time opportunity to dodge revenge killing attempts by or set up in the face of Ground-types such as Landorus-T, Gliscor, and Garchomp. Leftovers gives Kingambit passive recovery and improves its longevity, letting it check Gholdengo throughout a game for its team. An Adamant nature is preferred to hit as hard as possible, but Jolly allows Kingambit to, at worst, Speed tie with opposing Kingambit as well as outrun a few other notable threats such as Moltres, Ursaluna, and Mega Mawile. Supreme Overlord powers up Kingambit as its allies faint; this becomes incredibly dangerous in late-game scenarios, as Kingambit gains a large damage boost if many or all of its teammates have been taken down. Defiant can be situationally useful on certain hyper offense teams that value its ability to punish Defog attempts from Gliscor, Zapdos, and Landorus-T, as well as punishing Intimidate from the last one; this is generally best used with Air Balloon to protect Kingambit from Gliscor and Landorus-T. However, Supreme Overlord is generally more consistent, and hyper offense teams often have better ways to punish or outright deny Defog.</p> <p>Kingambit fits on many offensive teams thanks to the immense amount of pressure it exerts while also giving such teams a check to dangerous Ghost- and Psychic-types such as Gholdengo, Iron Crown, and Mega Latios. Kingambit's presence as a top threat in the metagame means that every team has a method of dealing with it, usually through faster Dark-resistant Pokemon such as Great Tusk, Zamazenta, Iron Valiant, and Hisuian Samurott; these are often backed up by secondary answers such as defensive Landorus-T, Alomomola, and Moltres. Kingambit can help itself out early-game by spamming Knock Off into these threats in order to remove Heavy-Duty Boots from Great Tusk, Zamazenta, and Alomomola. This strategy pairs very well with entry hazard setters, making teammates such as Landorus-T, Ferrothorn, and Gliscor great partners. The latter two are also capable of setting Spikes, which wear down Fighting-types like Urshifu-R for Kingambit. A teammate that can pivot into Fighting-types is also mandatory, as Kingambit tends to invite them into battle. Zapdos, Moltres, defensive Landorus-T, and Toxapex are good teammates as a result. Psychic- and Fairy-type offensive teammates also pair well with Kingambit, since they scare many of its Fighting- and Dark-type answers. Mega Latios, Iron Crown, Mega Diancie, or Iron Valiant combine with Kingambit to create a brutal offensive core, while the Psychic-types in particular appreciate Kingambit threatening Galarian Slowking and Gholdengo. Despite being a Steel-type, Kingambit fears Tapu Lele due to Psychic Terrain blocking Sucker Punch and it commonly carrying coverage moves that target Kingambit's weaknesses, so solid Tapu Lele checks such as Gholdengo and Melmetal are good teammates.</p>"
      },
      "Offensive Utility": {
        "description": "<p>Leveraging its great natural bulk alongside significant defensive investment and an item to further boost its longevity, Kingambit is able to act as a powerful defensive tool against Pokemon such as Gholdengo and Terapagos while remaining a threatening late-game cleaner. Knock Off is Kingambit's main STAB option, boasting a high Base Power and a powerful secondary effect, particularly against Heavy-Duty Boots users such as Zapdos and Moltres and Rocky Helmet users such as Alomomola and Landorus-T. Pursuit allows Kingambit to forcibly remove most Gholdengo sets while also heavily limiting most dedicated special walls, such as Blissey, Clodsire, and Galarian Slowking, and guaranteeing that Terapagos's Tera Shell is broken. Sucker Punch allows Kingambit to bypass its middling Speed stat, deterring fast and offensive Pokemon that would otherwise be problematic for Kingambit, such as offensive Volcarona, Mega Charizard Y, Focus Blast variants of Gholdengo, and Mega Medicham, while also allowing it to pick off weakened foes such as Garchomp and Ogerpon-W. Low Kick is used mainly to hit opposing Kingambit while also hitting Ting-Lu and Ferrothorn and OHKOing Mega Tyranitar. Iron Head is an alternative option, allowing Kingambit to immediately threaten Iron Valiant, Tapu Koko, and Clefable while also quickly wearing down Great Tusk and all-out attacker Zamazenta. Leftovers is the premier item for utility Kingambit, allowing it to stick around for longer games. Most Kingambit should use Supreme Overlord for its excellent and consistent effect, though Defiant is a viable alternative to specifically punish Landorus-T, KOing it with Knock Off into Sucker Punch, both at +1 Attack, and also punish Defog attempts from the likes of Zapdos and Corviknight. The EV spread allows Kingambit to outspeed Clefable lacking Speed investment.</p> <p>Pokemon such as Mega Medicham and Tapu Lele benefit from Gholdengo's absence. Iron Defense variants of Zamazenta and Mega Medicham particularly benefit from Kingambit's ability to deal with the aforementioned Ghost-types, as they are difficult for them to break while also being able to cripple them with status effects. Access to Knock Off allows Kingambit to remove Heavy-Duty Boots from foes such as Alomomola, Zapdos, and Moltres for the benefit of hazard-setting teammates such as Toxapex, Ferrothorn, and Mega Diancie. Kingambit struggles against faster Pokemon such as Zamazenta, Great Tusk, Landorus-T, and Kartana. Partners such as Zapdos and Moltres can aid Kingambit by answering multiple of these Pokemon at once. Bulkier Pokemon such as Melmetal, Ting-Lu, and Toxapex are able to consistently answer Kingambit defensively, so Tapu Lele, Ogerpon-W, and Raging Bolt are greatly appreciated for their ability to immediately threaten these Pokemon. It is worth noting that a significant majority of the Kingambit checks mentioned are susceptible to losing their item to Knock Off.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 526618, "username": "omarsgarciav"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 674261, "username": "Flames Of Elixir"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 697682, "username": "earthfromthefuture"}, {"user_id": 583607, "username": "PowerOfMemes"}]}]}
  },
  "Great Tusk": {
    "sets": {
      "Offensive Utility": {
        "description": "<p>Great Tusk is a behemoth of role compression. It provides an imposing offensive presence, access to entry hazards and hazard removal, and a defensive profile that enables it to check certain physical attackers such as Kingambit and Mega Tyranitar all in one slot. Rapid Spin enables the removal of hazards in the face of nearly every hazard setter in the tier such as Heatran, Garchomp, and Ting-Lu, which is specially given the difficulty of spinblocking Great Tusk, which is able to threaten massive damage on Gholdengo and Pecharunt. Additionally, Ice Spinner is necessary for threatening Flying-types such as Landorus-T, Gliscor, and Zapdos. Great Tusk is a good Stealth Rock setter given its ability to force switches against foes such as Galarian Slowking and Gholdengo and to threaten removal options such as Landorus-T and opposing Great Tusk if carrying Icium Z. Close Combat can be run to deny Ogerpon-W a safe switch in and better pressure Skarmory, Corviknight, and Rotom-W. Alternatively, Knock Off is an option for making progress against Great Tusk's checks, such as through removing Heavy-Duty Boots from Alomomola, Moltres, and Zapdos, as well as hitting Air Balloon Gholdengo for more damage. Stone Edge OHKOes Moltres and Volcarona, as well as 2HKOes Zapdos without making contact. Heavy-Duty Boots protects Great Tusk from Spikes and particularly Toxic Spikes, which is important given its role as hazard removal. Leftovers is another source of longevity, providing passive recovery for longer matchups in exchange for increased vulnerability to offensive hazard pressure. Booster Energy makes Great Tusk nigh unwallable, enabling it to threaten 2HKOs on standard Alomomola, Corviknight, and Rotom-W with its STAB options. Booster Energy sets should always carry Close Combat to maximize allbreaking potential. Subzero Slammer lets Great Tusk OHKO Tornadus-T and Zapdos, as well as Landorus-T even after Intimidate, while weakening the effect of Knock Off from the likes of Kingambit and Mega Tyranitar. Finally, Rocky Helmet provides a source of chip damage against the physical attackers Great Tusk switches into, including punishing U-turn from pivots such as Landorus-T and Mega Scizor.</p> <p>Great Tusk's ability to perform a plethora of roles leads it to fit best on offense and bulky offense due to its lack of longevity. However, it is also effective on balance teams, especially with the right teammates such as Alomomola, as its traits are highly coveted nonetheless. Great Tusk is often forced out by special attackers, such as Tapu Lele and Mega Charizard Y, meaning teammates such as Melmetal and Toxapex are strong teammates. Great Tusk is also not a blanket check to physical attackers, as its somewhat double-edged defensive typing leaves it with common weaknesses to attacks from Ogerpon-W, Weavile, and Kartana. As a result, defensive Pokemon with complementary typings such as Ferrothorn and Alomomola are effective partners. In particular, the latter can also provide Great Tusk with Wish support to mitigate its lack of longevity. With regards to its offensive profile, Great Tusk appreciates the ability of powerful special wallbreakers such as Raging Bolt and Tapu Lele to break through its checks such as Alomomola and Skarmory. In return, Great Tusk can exploit their checks such as Ting-Lu, Ferrothorn, and Melmetal as opportunities to set up Stealth Rock or remove entry hazards with ease. On offense teams, Great Tusk can pair well with other physical attackers such as Kingambit and Swords Dance Iron Valiant, being able to overwhelm or threaten common switch-ins such as Landorus-T and Moltres. Finally, Great Tusk forms a powerful core with Mega Charizard Y, providing premium hazard removal to address its crippling Stealth Rock weakness, the ability to switch into powerful physical attackers such as Mega Tyranitar, and threatening Mega Charizard Y's checks such as Dragonite, Toxapex, and Raging Bolt. In exchange, Mega Charizard Y's Drought provides Great Tusk with a Protosynthesis boost at no cost to the item slot while using Great Tusk's switch-ins such as Alomomola and Slowbro as wallbreaking opportunities.</p>"
      },
      "Defensive": {
        "description": "<p>Defensive Great Tusk acts as important glue on teams due to its incredible role compression by acting as a defensive wall, setting entry hazards, and clearing them. Utilizing its high bulk and HP, defensive Great Tusk acts as a great check to many metagame staples such as all-out attacker Zamazenta, Kingambit, Mega Lopunny, and Mega Tyranitar. Earthquake is the preferred STAB move on Great Tusk, but Headlong Rush can also be run for better damage rolls, such as an OHKO on offensive Gholdengo and a 2HKO on Kartana, at the cost of lowering its defenses. Moreover, Headlong Rush isn't weakened by Grassy Terrain. Ice Spinner is used mainly to threaten Landorus-T, Gliscor, and Dragonite while also hitting Zapdos and opposing Great Tusk super effectively. Great Tusk can freely remove hazards, since spinblockers like Dragapult and Gholdengo are threatened by moves such as Ice Spinner and Earthquake, respectively, and Knock Off. The last slot on this set is flexible; running Stealth Rock turns Great Tusk into an effective hazard setter, threatening most hazard removal options such as Landorus-T and opposing Great Tusk with Ice Spinner. Knock Off can also be run to remove key items, like Heavy-Duty Boots from the likes of Zapdos, Tornadus-T, and Moltres as well as Leftovers from Landorus-T and opposing Great Tusk, with the added benefit of being able to hit Air Balloon Gholdengo and Dragapult super effectively. Body Press is an option in the final slot to surprise Ferrothorn, Ting-Lu, and Terapagos that has had its Tera Shell broken. 40 Speed EVs allow defensive Great Tusk to outspeed base 90s like Moltres as well as other prominent threats such as uninvested Landorus-T and bulky Gholdengo. Heavy-Duty Boots prevents Great Tusk from taking too much chip damage from hazards, while Leftovers helps in checking the threats and increases Great Tusk's longevity. Rocky Helmet is another item that can be run on Great Tusk to punish many physical attackers that either attack it recklessly or try to gain momentum like Landorus-T, Zamazenta, and Kingambit.</p> <p>Defensive Great Tusk fits best on balance and bulky offense teams, which value its role compression. The main attributes hindering Great Tusk are its typing and lack of longevity. Thus, Great Tusk appreciates partners like Alomomola, which helps with its lack of longevity by Wish passing; additionally, Alomomola is able to switch into common Water-types like Hisuian Samurott and Urshifu-R. It also appreciates Pokemon such as Volt Switch Raging Bolt and Zapdos that can reliably switch in against common Flying-types such as Zapdos, Tornadus-T, and Mega Charizard Y and Water-types like Ogerpon-W while also threatening them offensively. Steel-type partners like Mega Scizor and Melmetal are greatly valued due to their ability to switch into fast Fairy-type foes like Tapu Lele. Moreover, the hazards set up by Great Tusk pressure many switch-ins on entry, forcing progress over time. Being able to remove the items on checks to Raging Bolt like Leftovers from Ting-Lu and Assault Vest from Melmetal allows Raging Bolt to break through switch-ins with its STAB moves aided by Great Tusk's hazards. Furthermore, these teammates appreciate Great Tusk's ability to spin away hazards for them and can continue to check threats to Great Tusk. Defensive Great Tusk also pairs extremely well with Mega Charizard Y, which appreciates Great Tusk removing Stealth Rock and checking Pokemon such as Mega Tyranitar. In return, Mega Charizard Y is able to break through walls like Alomomola, Clefable, Skarmory, and Corviknight. Mega Charizard Y also sets up sun, granting Great Tusk a Defense boost due to Protosynthesis, which allows it to better wall physical attackers.</p>"
      },
      "Bulk Up": {
        "description": "<p>Great Tusk's already great Attack and physical bulk combined with Bulk Up make it a premier setup sweeper that can use its bulk to set up with ease on Pokemon like Dragonite, Garchomp, and Mega Scizor. Ice Spinner takes care of most Pokemon immune to Headlong Rush like Landorus-T, Zapdos, Mega Latios, and Gliscor, among others, while also dealing with Grass-types like Rillaboom and Meowscarada. Rapid Spin is an amazing utility move for Great Tusk, as the extra boosts to Great Tusk's Speed help it avoid revenge killing attempts from Speed Booster Energy Iron Valiant and Choice Scarf Tapu Lele and let it boost Speed after its Booster Energy is used up. Rapid Spin also removes entry hazards for Great Tusk's teammates to clean up after it. The EV spread guarantees Great Tusk gains a Speed boost from its Booster Energy, allowing it to threaten Pokemon it would normally be threatened by, like Mega Diancie, Dragapult, and Mega Medicham.</p> <p>Bulk Up sets are most commonly used on hyper offense teams that appreciate another setup sweeper that can threaten common Pokemon like Landorus-T, Kingambit, and Raging Bolt for its teammates to cleave through. These teams also appreciate Great Tusk's ability to remove entry hazards, which is extremely helpful for Pokemon like Mega Charizard Y and Z-Move Dragonite. Great Tusk is easily revenge killed by Pokemon like mixed Iron Valiant and Choice Scarf users like Tapu Lele and Urshifu-R even with the Speed boost. Therefore, Pokemon that can switch into these Pokemon such as Mega Scizor for Tapu Lele and Kartana and Dragonite for Urshifu-R are appreciated. Great Tusk is weak to special attackers like the aforementioned Iron Valiant, Tapu Lele, Terapagos, and Volcarona, so Pokemon like Kingambit, Raging Bolt, Roaring Moon and your own Terapagos can be useful. Great Tusk also thuds into Pokemon that can take both of its moves, like Ogerpon-W, Moltres, Slowbro, and Alomomola, so Pokemon like your own Ogerpon-W, Raging Bolt, and Gholdengo are great partners that can chip down these Pokemon for Great Tusk to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 573467, "username": "Moisture99"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 674261, "username": "Flames Of Elixir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 589016, "username": "Danbear02"}]}]}
  },
  "Iron Treads": {"sets": {"Lead": {}, "Specially Defensive": {}, "Offensive Utility": {}}},
  "Iron Hands": {"sets": {"Swords Dance": {"description": "<p>140 Speed EVs allow Iron Hands to outspeed Corviknight.</p>"}}},
  "Iron Moth": {"sets": {"Booster Energy": {}, "Offensive Pivot": {}}},
  "Gholdengo": {
    "sets": {
      "Offensive Nasty Plot": {
        "description": "<p>Gholdengo is a good wallbreaker and glue for offense and hyper offense teams thanks to its access to Nasty Plot, its ability, Good as Gold, and its typing, which blocks entry hazard removal from Terapagos and Tornadus-T while also having useful resistances to threats such as Tapu Lele and Iron Valiant. Nasty Plot allows Gholdengo to OHKO Pokemon such as Heatran and Tapu Koko at +2. Make It Rain is a powerful STAB move that can allow a boosted Gholdengo to take down Pokemon that Shadow Ball can't, such as Gliscor, offensive Garchomp, and Landorus-T, OHKOing all of them after a boost. Recover can be slotted over Make It Rain in order to increase Gholdengo’s longevity, allowing it to check threats like Iron Valiant and Tapu Lele for longer. Focus Blast is a move that complements Gholdengo’s Ghost-type STAB moves, punching holes into would-be switch-ins like Kingambit, Ting-Lu, and Heatran. Air Balloon allows Gholdengo to spinblock and threaten Great Tusk, Iron Treads, and Terapagos lacking Flamethrower. Ghostium Z is a powerful option, and when used in tandem with Nasty Plot, it allows Gholdengo to OHKO specially defensive Garchomp, Moltres, and Toxapex while also OHKOing the previously mentioned Heatran without relying on the shaky accuracy of Focus Blast. Fightinium Z is another option that allows Gholdengo to bypass Focus Blast’s limited accuracy, notably OHKOing Ting-Lu and Assault Vest Melmetal after a boost.</p> <p>Gholdengo acts as a valuable asset for most offensive team structures with its ability to deny hazard control while also having incredible wallbreaking potential. Pokemon such as Glimmora, Ting-Lu, and Hisuian Samurott benefit from Gholdengo’s ability to keep hazards up. Additionally, the latter two enjoy Gholdengo’s unique typing, which can help blanket check Fairy- and Fighting-type foes such as Tapu Lele and Mega Medicham. Other Pokemon that enjoy Gholdengo’s wallbreaking capabilities include Raging Bolt and Urshifu-R, as they benefit immensely from Gholdengo removing and overwhelming checks like Ferrothorn and Slowbro. Gholdengo fears Pokemon such as Kingambit and Hisuian Samurott; therefore, Pokemon that can reliably deal with these Dark-types, such as Great Tusk and Zamazenta, are greatly appreciated. Having Pokemon immune to Ground-type attacks is helpful against threats such as Great Tusk and Garchomp, even if Gholdengo is holding an Air Balloon. As such, Pokemon like Landorus-T, Zapdos, and Moltres are outstanding partners. Moltres is an especially great teammate due to its ability to check the fearsome Fire-types in the metagame that Gholdengo struggles against, like Mega Charizard Y and Volcarona.</p>"
      },
      "Bulky Nasty Plot": {
        "description": "<p>Bulky Nasty Plot Gholdengo functions as a great defensive piece thanks to its amazing typing, access to reliable recovery, and its near-complete shutdown of entry hazard removal methods, as well as being a reliable offensive threat. Nasty Plot allows Gholdengo to take advantage of the foes it forces out, like Corviknight, Zamazenta lacking Crunch, and Toxapex, to enable it to break apart bulkier special walls such as Assault Vest Melmetal. Focus Blast nails otherwise-impassable Dark- and Normal-types like Ting-Lu, Hisuian Samurott, Kingambit, and Ursaluna, preventing them from either setting up entry hazards or Pursuit trapping it. It also destroys Steel-types like specially defensive Heatran and Ferrothorn after a boost. Recover allows Gholdengo to stay healthy in the face of weak attacks from foes like Toxapex, Ferrothorn, and Alomomola, letting it get more setup opportunities without fearing being chipped down. It also allows Gholdengo to check threatening Fighting-, Fairy-, and Psychic-types like Zamazenta, Tapu Lele, and Galarian Slowking throughout the game. The given EV spread allows Gholdengo to take a Choice Scarf Landorus-T's Earthquake from full health as well as outspeed defensive Landorus-T and Jolly Kingambit. Ghostium Z and Fightinium Z give Gholdengo one-time options to remove most foes in its path: Ghostium Z blasts specially defensive Toxapex and Assault Vest Tornadus-T, denying them the ability to utilize Regenerator to check Gholdengo's teammates later in the game, while Fightinium Z allows for Gholdengo to beat back its otherwise-solid answers in Ting-Lu and Blissey while ignoring Focus Blast's accuracy woes. Leftovers lets Gholdengo conserve Recover PP against the likes of Toxapex, while Air Balloon lets Gholdengo stuff Gliscor, gain setup opportunities against Landorus-T, and block Rapid Spin from Great Tusk to keep hazards on the field.</p> <p>Gholdengo's great typing, which lets it deal with troublesome Fighting-, Fairy-, and Psychic-types like the aforementioned Zamazenta and Tapu Lele, as well as its amazing offensive power after a boost and its ability to block hazard removal attempts, lets it find a home on balance teams. Gholdengo greatly appreciates teammates like Zamazenta and Iron Valiant, as they are able to ward off the dangerous Dark-types like Kingambit and Hisuian Samurott that take advantage of Gholdengo. In return, Gholdengo threatens the Poison-types like Toxapex that wall them to setup and wreak havoc, as well as checking threatening Psychic- and Fairy-types like Choice Scarf Tapu Lele. Hazard setters like Gliscor and Hisuian Samurott are great partners as well due to Gholdengo's near-complete dominance over most hazard control options. Both also offer unique defensive pairings with Gholdengo; Gliscor deals with Ground-types like Ting-Lu and Landorus-T by putting them on a timer with Toxic, while Hisuian Samurott takes on Fire-types like Heatran. Hazard removal options for Gholdengo like Moltres and Great Tusk allow Gholdengo to check the threats it needs to, like all-out attacking Zamazenta and Choice Specs Iron Valiant, without dealing with Spikes damage. Another good defensive partner for Gholdengo is Heatran, as it is able to put Volcarona and Moltres on a timer with Toxic while setting up Stealth Rock to chip down Gholdengo's checks like Hisuian Samurott over time.</p>"
      },
      "Thunder Wave + Hex": {
        "description": "<p>Gholdengo is a premier defensive piece due to its incredible ability and typing, which helps it check threats like Tapu Lele, Mega Medicham, and Zamazenta while also being immune to Great Tusk and Terapagos’s Rapid Spin and Defog from Tornadus-T and Zapdos. Focus Blast allows Gholdengo to hit would-be checks in Kingambit, Mega Tyranitar, and Terapagos without Tera Shell. Thunder Wave allows Gholdengo to slow down Pokemon such as Terapagos, Ogerpon-W, and Heatran. Hex is boosted to new heights because of Thunder Wave, and it severely damages Gliscor. Ghostium Z allows Gholdengo to greatly harm Pokemon that are unable to be paralyzed by Thunder Wave such as Raging Bolt, Zapdos, Great Tusk, and Landorus-T. Leftovers allows Gholdengo to have an easier time switching in against Pokemon like Tapu Lele and Iron Valiant repeatedly. Fightinium Z helps Gholdengo secure OHKOs on Assault Vest Kingambit, Mega Tyranitar, and Terapagos without Tera Shell while also being more reliable to hit with than Focus Blast. Air Balloon allows Gholdengo to be completely immune to Ground-type attacks from the likes of Gliscor and Great Tusk and block Rapid Spin from Great Tusk more effectively. The given EVs allow Gholdengo to outspeed uninvested Landorus-T and Jolly Kingambit while avoiding the OHKO from Choice Scarf Landorus-T.</p> <p>Gholdengo fits on various playstyles where its paralysis support and incredible defensive utility are valued. Teammates that set up entry hazards like Hisuian Samurott and Ting-Lu are perfect partners for Gholdengo because of it being an effective blocker of hazard removal from Terapagos and Great Tusk, especially if it is holding Air Balloon. Wallbreakers such as Mega Medicham and Ogerpon-W benefit from Gholdengo checking revenge killers like Tornadus-T, Choice Scarf Tapu Lele, and Zamazenta while also slowing down these faster threats with Thunder Wave. Gholdengo is unable to consistently break through Pokemon like Ting-Lu and Volcarona and is passive against Zapdos and Raging Bolt if it is unable to use a Z-Move. It is also easily outpaced by threats like Roaring Moon, Mega Lopunny, and Mega Charizard Y, limiting its ability to stay on the field safely. Teammates like Dragonite, Mega Tyranitar, and Zamazenta are great partners to help work around these issues. Iron Valiant is also a great partner for Gholdengo, as it appreciates Gholdengo paralyzing faster revenge killers like Tapu Lele and Tornadus-T, and in return, it takes care of Pokemon like Hisuian Samurott and Kingambit for Gholdengo.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 658067, "username": "Ineros"}, {"user_id": 669621, "username": "Spookcooke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 658067, "username": "Ineros"}, {"user_id": 662575, "username": "boppydop!"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 674261, "username": "Flames Of Elixir"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 657738, "username": "vaderaven"}, {"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Ting-Lu": {
    "sets": {
      "Defensive Hazard Setter": {
        "description": "<p>Ting-Lu's enormous HP combined with Vessel of Ruin makes it a fantastic defensive anchor against Pokemon such as Gholdengo, Volcarona, and Raging Bolt. This makes Ting-Lu a strong entry hazard setter as well, since many hazard removal options such as Terapagos and Moltres can't dissuade Ting-Lu from setting up hazards on them due to its bulk. To ensure it isn't completely passive against Flying-types, Ruination is necessary, which combined with hazard support allows Ting-Lu to force recovery from defensive Pokemon like Corviknight and Mega Latias. Spikes can be used instead of Stealth Rock if the team already has a Stealth Rock setter. Spikes also does better long-term damage if all three layers are set, especially to Pokemon that don't run Heavy-Duty Boots such as Gholdengo, Ferrothorn, and Mega Venusaur. Whirlwind is needed to ensure Ting-Lu isn't setup fodder against threats that don't mind taking Ruination such as Volcarona and Swords Dance Gliscor while also helping wear down opposing teams with Ting-Lu's hazards. Finally, Leftovers provides Ting-Lu with passive recovery, healing off weak attacks such as Tornadus-T's U-turn and Zapdos's Hurricane while also allowing it to survive attacks it otherwise wouldn't, such as avoiding the 2HKO from Choice Specs Tapu Koko's Dazzling Gleam.</p> <p>A major downside of Ting-Lu is its complete lack of recovery options, making Alomomola a fantastic partner that can also pivot into Water-types such as Urshifu-R and Barraskewda while healing Ting-Lu up with Wish. In return, Ting-Lu makes up for Alomomola's passivity against Gholdengo and Raging Bolt with its defensive profile combined with Whirlwind, wearing them down rapidly. Alomomola also handles Great Tusk for Ting-Lu, which would otherwise threaten Ting-Lu while removing its hazards easily. Another excellent defensive partner is Mega Venusaur, which is able to come in against the Water-, Fighting-, and Grass-types that threaten out Ting-Lu such as Kartana and Iron Valiant while appreciating Ting-Lu's hazard support to wear down opposing teams faster with its wide coverage. On offensive teams where they may not mind Ting-Lu's lack of longevity, Zamazenta, Iron Valiant, and Raging Bolt all appreciate the chip damage Ting-Lu provides with hazards wearing down defensive switch-ins such as Landorus-T, Mega Venusaur, and Kingambit. Gholdengo in particular is also able to block Defog attempts from Tornadus-T and Corviknight and Rapid Spin from Great Tusk especially if it is holding Air Balloon. Partners like Weavile and Ogerpon-W are also notable, since they can use Knock Off to remove Heavy-Duty Boots from targets like Alomomola and Toxapex, making them much easier to wear down in the long run.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604820, "username": "Sami"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Roaring Moon": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Roaring Moon serves as a devastating sweeper and progress maker due to its outstanding offensive capabilities, namely, its coveted access to Knock Off paired with exceptional coverage as well as a unique typing that grants it various setup opportunities. Devastating Drake hits phenomenally hard after a Dragon Dance, picking up the OHKO on Great Tusk and Multiscale Dragonite while dealing immense damage to Landorus-T and Alomomola. As an alternative, Acrobatics makes for excellent synergy with Attack Booster Energy and complements Knock Off by hitting Fighting-types like Great Tusk and Zamazenta for super effective damage. Earthquake nails Mega Diancie, Toxapex, and Steel-types like Melmetal and Kingambit.</p> <p>Offensive, balance, and hyper offensive structures love Roaring Moon's ability to be a dangerous wincon that can soft check Ogerpon-W as well as Mega Charizard Y and put immediate offensive pressure on the opposing team. Additionally, Roaring Moon excels at both making progress and cleaning late-game for various teammates. Bulky Gholdengo likes Roaring Moon switching into Hisuian Samurott and Heatran, and in return, Gholdengo can repeatedly switch into Fairy-types that deny Roaring Moon from making any progress such as Clefable. Iron Valiant can help chip shared checks with Roaring Moon such as Alomomola and Landorus-T. Volcarona is able to deal with bulky Steel-types like Melmetal and Ferrothorn, and in return, Roaring Moon can threaten significant damage to Volcarona's checks such as Garchomp and Ting-Lu using Devastating Drake.</p>"
      },
      "Pivot": {
        "description": "<p>When utilizing U-turn, Roaring Moon leverages its unique defensive attributes, namely, its high Speed tier; access to reliable recovery; and helpful typing, to become an effective offensive pivot. Roost allows Roaring Moon to patch up damage taken from checking various attackers such as Ogerpon-W and Mega Charizard Y. Earthquake is a necessity to threaten Heatran, Raging Bolt, and Mega Diancie, while also procuring more chip damage versus Melmetal. Heavy-Duty Boots allows Roaring Moon to continuously switch in and pivot despite any entry hazards on the field, while Protective Pads ignores contact punishment from the likes of Zapdos, Rocky Helmet Landorus-T, and Ferrothorn. The given EV spread allows Roaring Moon to outspeed Iron Valiant while avoiding the OHKO from Mega Charizard Y's Focus Blast.</p> <p>Various team structures, ranging from bulky balance to offense, can make use of the pivoting that Roaring Moon provides. Wallbreakers such as Ogerpon-W and Mega Charizard Y, the latter of which also provides sun for Roaring Moon's Protosynthesis, appreciate Roaring Moon inviting in Ground-types like Great Tusk and Steel-types like Ferrothorn, respectively. These wallbreakers also benefit from Roaring Moon's tendency to remove items with Knock Off, which—when paired with entry hazard setters such as Great Tusk and Heatran—can help remove the opposing team's Heavy-Duty Boots and ensure their checks get chipped. Defensive teammates like Gholdengo and Zapdos can switch into threats such as Choice Scarf Tapu Lele and Zamazenta, and in turn, Roaring Moon can chase away Hisuian Samurott and Heatran.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 662575, "username": "boppydop!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 674261, "username": "Flames Of Elixir"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 697682, "username": "earthfromthefuture"}, {"user_id": 583607, "username": "PowerOfMemes"}]}]}
  },
  "Iron Valiant": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs supplements Iron Valiant's power and offensive coverage, turning it into a powerful wallbreaker capable of blasting its way through bulky Pokemon such as Landorus-T, Gliscor, and Melmetal with ease. Thunderbolt provides a strong coverage option that allows Iron Valiant to 2HKO potential checks such as Toxapex, Mega Charizard Y, and Moltres, which otherwise wall its STAB combination. Alternatively, Vacuum Wave allows Iron Valiant to pick off weakened threats such as Mega Lopunny, Kingambit, or a boosted Terapagos in a pinch, whereas Trick allows Iron Valiant to cripple switch-ins such as Toxapex, Galarian Slowking, and Moltres without the need for prediction. Lastly, Shadow Ball ensures Iron Valiant can 2HKO defensive Gholdengo and Galarian Slowking after slight chip damage.</p> <p>Choice Specs Iron Valiant is a strong and versatile offensive option that fits on a variety of offense and balance teams alike. In particular, Iron Valiant benefits immensely from the support of Pursuit users such as Kingambit and Mega Tyranitar, which can help remove or forcibly weaken the few dedicated checks to it in Galarian Slowking and Assault Vest Tornadus-T, making it far more offensively threatening as a result. Similarly, entry hazard support from the likes of Landorus-T, Ting-Lu, and Ferrothorn is appreciated to ensure Iron Valiant can secure KOes against certain Pokemon such as Ogerpon-W, Mega Scizor, and Tapu Lele. Offensive teammates that work well with Iron Valiant include Gholdengo and Tapu Koko; each of them appreciates Iron Valiant's ability to break open soft checks such as Heatran and Ting-Lu, and in return, they can play around potential revenge killers such as Zamazenta or assist in weakening defensive pieces such as Zapdos and Toxapex. Most notably, Tapu Koko also sets up Electric Terrain to activate Iron Valiant's Quark Drive, granting it a valuable Speed boost that allows it to outpace naturally faster targets such as opposing Tapu Koko and Choice Scarf Urshifu-R.</p>"
      },
      "Mixed": {
        "description": "<p>Flexing not only its speed but also its versatility, mixed Iron Valiant excels as a cleaner, leveraging its wide movepool and powerful STAB combination to blast through weakened teams. Moonblast threatens many prominent targets, such as Raging Bolt and Zamazenta. Close Combat complements Moonblast nicely, damaging Steel-types such as Kingambit, Heatran, and Ferrothorn. Knock Off targets those that resist Iron Valiant's STAB moves, hitting key foes like crippling Moltres by removing its Heavy-Duty Boots. Encore discourages setup attempts from foes such as Volcarona and Dragonite, as well as punishing utility and recovery moves from defensive staples like Gliscor, Moltres, and Landorus-T. Alternatively, Destiny Bond allows Iron Valiant to force a trade even in a disadvantageous matchup, like against Volcarona or Gholdengo. Finally, Thunderbolt can threaten otherwise solid checks in Moltres, Toxapex, and Mega Charizard Y. 108 Attack EVs allow Iron Valiant to OHKO specially defensive Heatran after Stealth Rock. Booster Energy is preferred to ensure Iron Valiant can excel in its role as a cleaner, outspeeding all unboosted threats as well as all the relevant Choice Scarf users like Urshifu-R and Tapu Lele. Life Orb is a viable alternative if Iron Valiant is paired with Tapu Koko, ensuring 2HKOs on defensive Landorus-T with Moonblast as well as Alomomola and Toxapex with Thunderbolt while also securing an OHKO on SubRoost Kyurem with Close Combat and a chance to OHKO all-out attacker Zamazenta and Ferrothorn.</p> <p>Due to mixed Iron Valiant's dazzling array of skills, it fits best on offensive teams that appreciate its ability to clean up weakened teams as well as force trades against threats like Mega Charizard Y and Gholdengo for its teammates to exploit. Kingambit is a superb partner, as it greatly appreciates Iron Valiant blasting the Fighting-types that Kingambit struggles with, like Zamazenta and Great Tusk, while Kingambit can trap threats like Galarian Slowking and Gholdengo with Pursuit for Iron Valiant. Landorus-T and Great Tusk are also strong teammates, setting Stealth Rock to chip down potential switch-ins like Toxapex or Moltres, especially if Iron Valiant can remove its Heavy-Duty Boots, as well as directly threatening Iron Valiant checks like Toxapex and Galarian Slowking. In return, Iron Valiant can beat Urshifu-R, Weavile, and Kyurem. If Iron Valiant is running Life Orb, Tapu Koko is an essential pick, providing the Electric Terrain required to boost Iron Valiant's Speed, as well as threatening Moltres and Toxapex and boosting Iron Valiant's own Thunderbolt. Tapu Koko also provides easier entry for Iron Valiant through its speedy Volt Switch or U-turn. While powerful, Iron Valiant can struggle to break through healthy teams, especially against previously mentioned checks like Galarian Slowking and Toxapex, so offensive threats like Volcarona, Hisuian Samurott, and Tapu Lele are appreciated for their ability to wear down said checks for Iron Valiant to clean up. Iron Valiant is also threatened by some forms of priority like Bullet Punch from Mega Scizor and Mega Medicham, so the aforementioned Volcarona and Tapu Lele are excellent at shutting down these threats with the former's Flame Body and the latter's Psychic Terrain.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance Iron Valiant is a fantastic wallbreaker and setup sweeper, making use of its excellent coverage and Speed tier accentuated by Booster Energy to outpace and tear through common speed control options in Mega Lopunny and Choice Scarf Urshifu-R. Its effectiveness in this role is compounded by the ability to break past answers such as Galarian Slowking and Iron Crown that would otherwise check special sets. Knock Off not only allows Iron Valiant to cripple incoming checks such as Moltres and Toxapex but also serves as important coverage against the vast majority of Ghost- and Psychic-type Pokemon; at +2, it notably OHKOes offensive Gholdengo and Galarian Slowking and can 2HKO Slowbro lacking Colbur Berry. Ice Punch allows Iron Valiant to OHKO Landorus-T, Dragonite, and Gliscor at +2. However, Encore is also a strong alternative that allows Iron Valiant to facilitate additional setup opportunities by punishing the use of status moves such as Stealth Rock from Landorus-T or Quiver Dance from Volcarona. It also prevents Raging Bolt from reliably revenge killing Iron Valiant by locking it into Thunderclap. Spirit Break provides a secondary STAB option that lets Iron Valiant deal more damage to Fighting-types such as Great Tusk and Zamazenta as well as Fairy-types such as Tapu Koko and Clefable, notably OHKOing the former at +2.</p> <p>Iron Valiant's immense Attack and Speed tier make it a solid fit on various offense and hyper offense teams. Entry hazard setters such as Landorus-T, Hisuian Samurott, and Garchomp are essential for their ability to wear down Pokemon such as Hex Gholdengo and Tapu Lele to where a boosted Iron Valiant can pick them off late-game. Special attackers such as Calm Mind Raging Bolt, Quiver Dance Volcarona, and Nasty Plot Gholdengo can help pressure physically defensive stopgaps in Toxapex, Skarmory, and Zapdos early on, while Iron Valiant takes on specially defensive checks to these Pokemon such as Galarian Slowking and Ting-Lu in return. Similarly, accompanying physical sweepers such as Swords Dance Kingambit and Swords Dance Ogerpon-W pair excellently with Iron Valiant to help overwhelm shared physical checks such as Moltres and Alomomola. While Iron Valiant can use its Speed tier in conjunction with Booster Energy to revenge kill certain offensive threats in Mega Lopunny and Mega Swampert under rain in a vacuum, it often loses offensive flexibility while doing so, especially once it has depleted its Booster Energy. Thus, Iron Valiant appreciates being paired with teammates such as Iron Defense Zamazenta and Dragon Dance Dragonite as well as secondary Speed control options such as Booster Energy Iron Moth and Swords Dance Rillaboom that can help force these Pokemon out, ensuring that it doesn't have to deal with them outside of sweeping positions. Tapu Koko is also a notable offensive partner, as the Electric Terrain it provides allows Iron Valiant to retain its Speed boost outside of Booster Energy while being able to pressure some of Iron Valiant's checks in Moltres and Toxapex.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}, {"user_id": 616497, "username": "FayaWizard"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493260, "username": "Marnie"}, {"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Ogerpon-Wellspring": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-W is a very threatening wallbreaker that gets many opportunities to set up with Swords Dance, as it can threaten key defensive pieces like Landorus-T, Great Tusk, and Heatran with its STAB moves. Power Whip is the preferred option, as it OHKOes Great Tusk and Alomomola, but Horn Leech can keep Ogerpon-W healthy. Superpower hits potential switch-ins such as Ferrothorn and Archaludon. Play Rough can allow Ogerpon-W to target foes such as Dragonite, Raging Bolt, and Mega Latios, which would otherwise switch in comfortably.</p> <p>Ogerpon-W tends to fit on many different playstyles from hyper offense to balance, as it is a potent wallbreaker capable of threatening defensive teams. Its Water immunity is also appreciated against rain teams. Pokemon like Great Tusk and Landorus-T value Ogerpon-W's ability to break through bulky Water-types such as Alomomola, Slowbro, and Dondozo. In return, these two provide Stealth Rock support as well as an Electric immunity that can stop revenge killing attempts from Tapu Koko and Raging Bolt. In addition, both teammates can provide entry hazard removal, which Ogerpon-W appreciates, as it is vulnerable to chip damage. Ogerpon-W struggles with threats like Raging Bolt, Mega Latios, and Mega Latias, so Pursuit trappers like Kingambit and Mega Tyranitar are welcomed. Ogerpon-W does not like taking many hits, so it appreciates U-turn from teammates such as Landorus-T and Tapu Koko to enter the field safely against Pokemon that want to come in on them such as Alomomola for the former and Ting-Lu for the latter. Non-Superpower Ogerpon-W can struggle to dent checks such as Ferrothorn and Archaludon, so Pokemon like Zamazenta and Mega Lopunny are valued to make up for the lack of coverage. Non-Play Rough Ogerpon-W should have partners that can pressure checks like Dragonite and Raging Bolt like Great Tusk and Tapu Koko.</p>"
      },
      "Offensive Pivot": {
        "description": "<p>Ogerpon-W is an offensive pivot that threatens common defensive Pokemon like Landorus-T, Gliscor, and Heatran. Courtesy of its ability, Ogerpon-W can answer a plethora of offensive Water-types, such as Mega Swampert and Urshifu-R, while ignoring Scald and Flip Turn from Slowbro, Toxapex, and Alomomola. Power Whip OKHOes Ursaluna and Great Tusk after minor chip damage, whereas Horn Leech provides it with longevity in exchange for power. U-turn allows Ogerpon-W to pivot out of checks such as Raging Bolt, Ferrothorn, and Dragonite. Knock Off is used to cripple switch-ins like Dragonite and Ferrothorn by removing their Heavy-Duty Boots and Leftovers, respectively. Alternatively, Encore can lock certain defensive pieces into recovery moves such as Toxapex and Mega Scizor. Encore also helps Ogerpon-W avoid mind games against priority moves from Raging Bolt and Kingambit and denies faster Pokemon like Zamazenta from setting up on it. Taunt is also an option to deny entry hazard-setting attempts from walls such as Ferrothorn and Clefable while ensuring Ogerpon-W walls Toxapex and Alomomola. Spikes can be used to wear down checks such as Ferrothorn and Raging Bolt lacking Heavy-Duty Boots, as it has the remarkable ability to force switches.</p> <p>Ogerpon-W commonly fits on bulky offense and balance teams. Pokemon such as Great Tusk and Landorus-T appreciate its presence due to its ability to threaten foes such as Alomomola, Urshifu-R, and Moltres. In return, these teammates can provide entry hazard removal through Rapid Spin and Defog to prevent Ogerpon-W from being worn down quickly. Additionally, Landorus-T can bring it in with U-turn against Pokemon like Alomomola and Gliscor. Ogerpon-W is vulnerable to faster threats such as Iron Valiant and Zamazenta, so it appreciates teammates like bulky Volcarona and Landorus-T to answer Iron Valiant and check Zamazenta, respectively. Ogerpon-W also loves Spikes support from Pokemon like Mega Diancie to wear down checks such as Ferrothorn and Raging Bolt and help rack up chip damage in combination with U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Ogerpon-Cornerstone": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-C's most prominent feature as a wallbreaker is its unique STAB combination, which, when paired with its complementary coverage, becomes very difficult to resist. Additionally, Ogerpon-C boasts a sufficient Speed tier to outspeed foes like Kyurem and non-Choice Scarf Kartana as well as powerful Cornerstone Mask-boosted attacks, which help it further threaten Flying-types such as Mega Charizard Y and Zapdos, Water-types such as Alomomola and Slowbro, and Ground-types such as Great Tusk and Ting-Lu. Swords Dance is able to take advantage of this, augmenting Ogerpon-C's Attack to astronomical levels that allow it to more easily take on checks such as Landorus-T and Corviknight while scoring a 2KHO on Gholdengo and an OHKO on Gliscor both with Power Whip. Superpower nails pesky Steel-types such as Ferrothorn and Melmetal, while the more niche Knock Off catches Gholdengo by surprise while also generally supporting its team by removing the items off of common switch-ins such as Toxapex and Landorus-T. A valuable ability in Sturdy allows Ogerpon-C to act as an advantageous crutch against dangerous sweepers such as Roaring Moon and Iron Valiant, especially if they have already set up.</p> <p>Ogerpon-C shines brightest on offensive structures, where it's given as many wallbreaking opportunities as possible. Pivot Roaring Moon makes for a fantastic partner, as it's able to threaten one of Ogerpon-C's most common checks in Gholdengo and help chip down shared checks such as Landorus-T, and in return, Ogerpon-C can take advantage of Roaring Moon's own obstacles in Zapdos and Great Tusk. Similarly, Mega Scizor can support Ogerpon-C with Knock Off and make use of its impressive bulk to stave off revenge killers such as Choice Scarf Landorus-T and Mega Lopunny while also letting Ogerpon-C take care of threatening Fire-types such as Volcarona. Moltres's defensive profile also complements Ogerpon-C, providing pivoting with U-turn and deterring checks such as Iron Valiant and Gholdengo. Additionally, entry hazard removal from the likes of Terapagos, Great Tusk, and Landorus-T or hazard deterrents such as lead Mega Diancie and Iron Treads can help keep Ogerpon-C's Sturdy intact.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 662575, "username": "boppydop!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Archaludon": {
    "sets": {
      "Rain Wallbreaker": {
        "description": "<p>Thanks to Electro Shot, Archaludon becomes a staple wallbreaker for rain teams with huge snowball potential while possessing valuable defensive utility that turns it into a strong tank for the archetype. Its typing alongside Stamina and Assault Vest makes it difficult to take down both physically and specially, letting it accumulate boosts with Electro Shot and wallbreak with its offensive movepool more consistently while taking on the tier's offensive foes comfortably; it checks common threats to rain like Ogerpon-W and Zapdos and can even trade with and prevent revenge killing attempts from a huge slew of more threats, including Pokemon like Tapu Koko, Terapagos, and Weavile. Electro Shot also provides Archaludon with a strong neutral nuke against Steel-types like Gholdengo and Iron Crown that resist its STAB combination and neglect its Fighting coverage, but more importantly, an immediate and reliable way to nail bulky Water-types like Toxapex and Alomomola that can slow down the onslaught of rain-boosted Water-type moves from its teammates. Aura Sphere makes use of Electro Shot boosts and hits Kingambit and Ferrothorn hard, even ignoring the latter's Iron Barbs, but a Stamina-complemented Body Press can be considered instead to hit Blissey harder, drastically improving Archaludon's matchup against stall teams. Either Fighting-type coverage also hits other Steel-types like Heatran and Melmetal outside of rain and pressure Mega Tyranitar more than Flash Cannon, preventing it from replacing the weather more freely. 176 Speed EVs let Archaludon outpace neutral-natured base 75 Speed foes like Raging Bolt and Mega Scizor.</p> <p>Archaludon's expertise makes it the perfect fit for rain teams and rain teams only. Pelipper is undoubtedly the best teammate, as it reliably sets the rain with Drizzle for Archaludon to use Electro Shot. Moreover, it pivots Archaludon in safely against switch-ins like Zapdos and Toxapex via U-turn and switches into troublesome revenge killers like Urshifu-R, Great Tusk, and Zamazenta. Offensive Water-types found on rain teams like Mega Swampert, Urshifu-R, and Barraskewda can keep up the pressure against the opposition; they appreciate Archaludon exploiting the aforementioned bulky Water-types that they can pivot it into while pressuring bulky Ground-types such as Gliscor and Ting-Lu that are otherwise tough to break through and keeping up with faster offensive threats like Mega Diancie, Garchomp, and Mega Medicham that can overrun Archaludon. Zapdos is a strong offensive threat in rain itself that can also handle Mega Lopunny, Great Tusk, and Landorus-T for Archaludon defensively, with its Static potentially allowing Archaludon to outspeed otherwise faster foes like Dragonite, Urshifu-R, and Kartana; together, they can also overwhelm shared checks like Gliscor and Ting-Lu. Ferrothorn and Iron Treads provide entry hazards to take advantage of Archaludon's forced switches and check Ogerpon-W and Zapdos, respectively, so it's not overwhelmed easily. Iron Treads and the aforementioned Pelipper can also provide hazard removal, keeping Archaludon healthy to let it fully make use of its hit-taking abilities. In return, Archaludon handles threats like Ogerpon-W and Hisuian Samurott for Iron Treads.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493260, "username": "Marnie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Hydrapple": {"sets": {"Nasty Plot": {}}},
  "Raging Bolt": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Raging Bolt's amazing bulk, high Special Attack stat, and great typing both defensively and offensively allow it to become a dangerous wallbreaker and sweeper, threatening common defensive pieces like Toxapex, Moltres, and Zapdos. Draco Meteor brings Raging Bolt exceptional power, allowing it to OHKO Ground-types like Landorus-T, Garchomp, a Great Tusk trying to switch into it, the former with a Calm Mind boost. However, Dragon Pulse is a great option if you want consistent damage, threatening the opposition for longer at a time. Weather Ball is an amazing option when paired with weather teams, as it removes Grass-types like Ferrothorn and Rillaboom in sun and threatens Ground-types like Ting-Lu and Iron Treads in rain. Dragonium Z gives Raging Bolt a one-time nuke, letting it obliterate most non-resistant foes, such as Gliscor and Galarian Slowking, with a Calm Mind boost, opening up its teammates. Do note that Dragonium Z should only be used with Draco Meteor, as the damage reduction with Dragon Pulse is quite noticeable. Booster Energy boosts Raging Bolt's Special Attack, allowing it to get OHKOs on Pokemon that it would normally run from, such as Iron Valiant with Thunderclap and Gliscor with Draco Meteor, both at +1. Leftovers lets it switch into Pokemon like Mega Charizard Y and Ogerpon-W more consistently, allowing it to set up easily.</p> <p>Raging Bolt is best on more offensive teams that appreciate it wearing down other Pokemon like Toxapex, Moltres, and Ting-Lu. Its main weakness is Ground-types like Ting-Lu, Gliscor, Great Tusk, and Landorus-T, as they can come in on a Thunderbolt and threaten it out with a super effective Earthquake. Pokemon like Urshifu-R, Ogerpon-W, and Hisuian Samurott can help remove these foes for Raging Bolt, and in return, it can eliminate bulky Water-types like Toxapex, Alomomola, and Slowbro. Hisuian Samurott in particular, along with Ferrothorn and Heatran, can set up entry hazards for Raging Bolt in order to chip down Pokemon like Ferrothorn and Ting-Lu into KO range of its attacks quicker. Raging Bolt doesn't have the best Speed stat, and that can be taken advantage of by Pokemon like Weavile and Choice Scarf Tapu Lele, which can bypass its Thunderclap either through their own priority for the former or Psychic Terrain for the latter and threaten to KO it. Steel-types like Melmetal, Kingambit, and Mega Scizor help in this regard, as well as absorbing Fairy-type attacks from Pokemon like Mega Diancie and Iron Valiant; Kingambit can also threaten Galarian Slowking and Mega Latios, two Pokemon that Raging Bolt has trouble with. In return, Raging Bolt can chip down Toxapex, Moltres, and Zamazenta for Kingambit’s own sweep later in the game. Finally, Raging Bolt fits very well on weather-based teams. On sun teams, Raging Bolt's Protosynthesis is activated, allowing it to hit harder; it also synergizes well with Mega Charizard Y, as Mega Charizard Y can switch into the Ground-type moves that Raging Bolt baits out while also dealing with Ferrothorn. In return, Raging Bolt can deal with Toxapex, Moltres, and Dragonite, which would otherwise give Mega Charizard Y trouble. Rain, on the other hand, gives Raging Bolt a Weather Ball capable of demolishing the Ground-types that would otherwise give it much trouble. In return, Raging Bolt provides a check for Grass- and Electric-types like Rillaboom, Zapdos, and Ogerpon-W that would give rain teams trouble.</p>"
      },
      "Pivot": {
        "description": "<p>Raging Bolt is an excellent pivot, using its stellar offensive presence and ability to force out Pokemon such as Toxapex, Zapdos, and Moltres to gain momentum for its teammates. Not only that, Raging Bolt's solid defensive typing makes it have favorable matchups against Pokemon like Ogerpon-W and Mega Charizard Y. Thunderclap is a useful form of priority, being the main way Raging Bolt threatens out faster threats such as Urshifu-R, Iron Valiant, and Mega Medicham. Draco Meteor gives Raging Bolt the ability to hit Pokemon that would effortlessly block Volt Switch, such as Landorus-T and Gliscor. Taunt is an option over Thunderbolt, allowing Raging Bolt to stop entry hazards from being set up by the likes of Heatran and Ferrothorn and deny recovery for Pokemon like Mega Scizor, Blissey, and Garganacl. Heavy-Duty Boots lets Raging Bolt pivot safely in the face of hazards, particularly Spikes, while Dragonium Z gives Raging Bolt the ability to OHKO Gliscor and Landorus-T and muscle through weakened checks like Garganacl and Mega Tyranitar. Alternatively, Leftovers grants Raging Bolt more longevity to check Pokemon like Mega Charizard Y, Ogerpon-W, and Urshifu-R more consistently. When using Heavy-Duty Boots, an EV spread with maximum Special Attack and Speed is preferred. However, the second EV spread ensures Raging Bolt outspeeds defensive Landorus-T while also surviving a Landorus-T's Earthquake after Stealth Rock.</p> <p>Raging Bolt fits best on bulky offense and balance teams, where its pivoting abilities are much appreciated to keep momentum and bring in wallbreakers such as Mega Medicham and Kingambit against Pokemon like Ferrothorn, Galarian Slowking, and Mega Tyranitar. Raging Bolt checking Ogerpon-W and Tornadus-T is appreciated by teammates such as Alomomola and Great Tusk. In return, Alomomola provides Wish support, making up for Raging Bolt's poor longevity, and Great Tusk removes Spikes, which cut into Raging Bolt lacking Heavy-Duty Boots. Due to Raging Bolt's lack of power, it loves the Spikes set by teammates like Samurott-H and Ferrothorn, chipping down its checks such as opposing Ferrothorn and Heatran. Raging Bolt is also hindered by Ground-types that easily outpace it such as Garchomp and Great Tusk, since they also block its Volt Switch, stopping it from gaining momentum. Teammates that check these foes, such as Moltres and Landorus-T, are good partners for Raging Bolt.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 591294, "username": "Lightniong"}, {"user_id": 658067, "username": "Ineros"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 632421, "username": "Medasus"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 571069, "username": "Dead by Daylight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 681606, "username": "BrisingrDraconis"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Iron Boulder": {"sets": {"Swords Dance": {}}},
  "Iron Crown": {"sets": {"Offensive Pivot": {}, "Assault Vest": {}}},
  "Terapagos": {
    "sets": {
      "Offensive Utility": {
        "description": "<p>Acting as a top-tier entry hazard remover with its unique ability and vast movepool, Terapagos is a solid addition to many teams that appreciate its perks. Ice Beam can be used in order to OHKO Landorus-T, Gliscor, and Garchomp, as well as significantly damaging Raging Bolt. Calm Mind allows Terapagos to become very threatening and hard to take down, 2HKOing Moltres, Mega Charizard Y, and Toxapex with Tera Starstorm after a boost. The Special Defense raise allows Terapagos to use its bulk to challenge foes such as Tapu Lele and Gholdengo that can otherwise OHKO Terapagos lacking Tera Shell by using Fightinium Z. Flamethrower smacks Air Balloon Gholdengo as well as hit Ferrothorn and Mega Scizor for crippling damage. Earth Power allows Terapagos to nail Heatran and Glimmora while also hitting Mega Tyranitar for chip damage. Rapid Spin lets Terapagos assist its team with hazard removal while boosting Speed to allow it to threaten faster Pokemon like Tapu Koko, Mega Lopunny, and Zamazenta, setting it up for a potential sweep when used in conjunction with Calm Mind. Heavy-Duty Boots is vital in allowing Terapagos to keep its ability in the face of hazards, which can be useful for guaranteeing a Rapid Spin or stopping a potential sweep, such as from Dragonite, if packing Ice Beam.</p> <p>Terapagos fits on bulky offense and balance teams that appreciate its reliability in entry hazard removal, benefitting Pokemon such as Mega Charizard Y and Volcarona lacking Heavy-Duty Boots. Terapagos's Normal typing allows for it to switch into Ghost-type moves, which is vital in being a stopgap against Pokemon such as Gholdengo. Due toTerapagos's below average Speed and reliance on its ability, a defensive backbone is much appreciated with Pokemon such as Gholdengo and Zapdos, which can cover for Terapagos's Fighting weakness. Alomomola is a great teammate that can provide Wish passing, which is extremely valuable, as it allows Terapagos to regain Tera Shell if it has lost health beforehand.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 669621, "username": "Spookcooke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 571069, "username": "Dead by Daylight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527157, "username": "Kiwi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Pecharunt": {"sets": {"Defensive Pivot": {}, "Nasty Plot": {}}}
}