{
  "Clefable": {"sets": {"Unaware Wall": {}}},
  "Ninetales-Alola": {"sets": {"Aurora Veil": {}}},
  "Dragonite": {"sets": {"Dragon Dance": {"description": "<p>156 Speed outspeeds base 110 Pokemon at +1</p>"}}},
  "Mewtwo": {
    "sets": {
      "Life Orb": {
        "description": "<p>Mewtwo is an astonishing offensive stallbreaker and wallbreaker with Life Orb in Ubers UU. Psystrike allows Mewtwo to bypass blanket special walls like Calm Mind Clefable and Blissey, and Shadow Ball hits Giratina, Gholdengo, and Solgaleo hard. Alternatively, Fire Blast allows it to 2HKO Solgaleo and Magearna while still hitting Gholdengo. Focus Blast hits Dark-types such as Kingambit and Arceus-Dark and is needed over Aura Sphere to hit crucial KO ranges, such as 2HKOing Arceus-Dark and OHKOing Chi-Yu. Recover helps to offset Life Orb's recoil while also increasing Mewtwo's longevity, and it gets many opportunities to use this move due to all the switches it forces. Tera Fighting is mandatory to let Mewtwo's Focus Blast OHKO Arceus-Dark and turn its Dark and Bug weaknesses into resistances, which helps against Chi-Yu and Volcarona. Mewtwo appreciates entry hazard control from allies like Giratina and Great Tusk to help its longevity. Mandibuzz, specially defensive Arceus-Dark, and Solgaleo are often solid checks to Mewtwo, meaning Pokemon like Zamazenta-C and Zacian are good partners for it. In addition, Choice Scarf Chi-Yu and Zacian can outrun and threaten Mewtwo, making Arceus-Poison an especially potent partner, as it is the only reliable check to the combination of these Pokemon.</p>"
      },
      "Nasty Plot": {
        "description": "<p>With its astonishingly high Special Attack, good Speed, and varied coverage movepool, Mewtwo is one of Ubers UU's most threatening wallbreakers and setup sweepers. Psystrike allows Mewtwo to muscle through specially defensive walls like Blissey. Focus Blast gives Mewtwo coverage against Pokemon like Arceus-Dark, Kingambit, and Garganacl. Mewtwo's final moveslot is customizable; Shadow Ball targets Giratina, Deoxys, and opposing Mewtwo. Fire Blast gives Mewtwo coverage against Pokemon like Magearna, Solgaleo, and Arceus-Grass. Flamethrower can be opted for instead, trading power for consistency. However, it misses out on some important benchmarks Fire Blast reaches, such as not guaranteeing an OHKO on Solgaleo and Arceus-Grass after a Nasty Plot. Recover can be used to give Mewtwo more chances to sweep throughout a game, at the cost of its coverage. Expert Belt is the preferred item of choice, as it gives Mewtwo a power boost on targets it hits super effectively. Heavy-Duty Boots can be opted for instead, giving Mewtwo an immunity to entry hazards. Tera Steel gives Mewtwo a resistance to Zacian's STAB attacks and also provides it a resistance to Extreme Speed from Arceus formes and Deoxys. Tera Fighting can be opted for instead, boosting Focus Blast and giving a resistance to Kingambit's Sucker Punch as well as Solgaleo's and Great Tusk's Knock Off. Mewtwo fits best on offensive teams looking for a strong wallbreaker. Mewtwo struggles against faster threats like Zacian, Deoxys, and Choice Scarf Kyurem-W that can revenge kill it, so Pokemon that can take these threats on like Toxapex, Solgaleo, and Magearna can be nice to have as teammates. Pivoting from the likes of Landorus-T and Palafin can give Mewtwo a safe switch in to set up with Nasty Plot.</p>"
      },
      "Stalltwo": {"description": "<p>Mewtwo is a great stallbreaker thanks to its decent ability in Pressure, good bulk, high Speed tier, and amazing utility movepool. Taunt allows Mewtwo to counter utility Pokemon and special walls like Magearna and Cyclizar, while Will-O-Wisp cripples common physical attackers like Kingambit, Zacian, and Palafin. Psystrike is preferred to break through Blissey and Clefable. Tera Dark is an excellent defensive typing that allows Mewtwo to take on Kingambit and Spectrier. Mewtwo is a great check to foes like Blissey and Magearna, so Pokemon that appreciate this, like Kyurem-W and Kingambit, are good partners. Dark-types, like Kingambit, Chi-Yu and Arceus-Dark, completely wall it, so Pokemon like Zamazenta-C, Zacian, and Magearna are recommended to have.</p>"},
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}, {"username": "imperialorder241", "user_id": 626445}, {"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "nap00", "user_id": 610920}, {"username": "Bella", "user_id": 567483}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "sunny004", "user_id": 197240}, {"username": "Rose", "user_id": 511181}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Quagsire": {"sets": {"Unaware Wall": {}}},
  "Slowking-Galar": {
    "sets": {
      "Specially Defensive Pivot": {
        "description": "<p>Galarian Slowking is a fantastic specially defensive pivot in Ubers UU with Future Sight, a great defensive typing for the tier, Chilly Reception, and an excellent utility movepool. Future Sight makes stallbreaking much easier, amplifying wallbreakers like Chi-Yu due to the extra damage it provides. Flamethrower hits Magearna and Solgaleo, which are immune to Sludge Bomb and resist Future Sight. Toxic allows Galarian Slowking to cripple offensive Pokemon trying to switch in, like Palkia-O and Arceus formes, whereas Toxic Spikes allows it to shut down teams lacking a Poison-type while also crippling entry hazard-weak Pokemon like Arceus-Dark and Kyurem-W. Tera Water allows Galarian Slowking to resist Palafin's Water-type moves and handle Palkia-O better while shedding its Ground-type weakness, making it better at taking on Landorus. Alternatively, Tera Grass makes Galarian Slowking resistant to Ground and Water, meaning it still handles Palafin and Palkia-O well, at the cost of being weak to Kyurem-W and Chi-Yu. Lastly, Tera Fairy allows Galarian Slowking to shed its Dark-type weakness, flipping the matchup on against Chi-Yu and Arceus-Dark. Galarian Slowking forms good cores with physical walls, which can mitigate its mediocre physical bulk, and as a result, it pairs well with Great Tusk and Giratina. Galarian Slowking can also support less bulky wallbreakers that can struggle to get on the field safely, like Deoxys and Chi-Yu.</p>"
      },
      "Physically Defensive Pivot": {}
    },
    "credits": {"writtenBy": [{"username": "imperialorder241", "user_id": 626445}], "teams": [{"name": "Quality checked by", "members": [{"username": "Finchely", "user_id": 642468}, {"username": "Bella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Skarmory": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Skarmory is one of the tier's best entry hazard stackers and physical walls thanks to its excellent typing allowing it to check many prominent Pokemon like Zacian and Sneasler. Body Press is preferred on Skarmory over other attacks thanks to its Defense being significantly higher than its attacking stats. Iron Defense is typically run alongside Body Press to allow Skarmory to function as a wincon while also making it a better check to Pokemon like Zacian, Palafin, and Baxcalibur. Whirlwind can be used over Iron Defense to rack up entry hazard damage from the Spikes Skarmory sets and phaze foes trying to set up on it. Tera Water allows Skarmory to beat Pokemon like Tera Fire Zacian and Palafin. Skarmory has trouble with special attackers like Kyurem-W, Arceus-Dark, and Chi-Yu, which can easily OHKO it, so specially defensive walls like Giratina and Arceus-Dark form excellent cores with it. In exchange, Skarmory can check Pokemon like Zacian and Zamazenta-C for its teammates. Pokemon like Life Orb Mewtwo and Palkia-O appreciate Spikes chipping their checks like Solgaleo and Arceus-Dark into KO range of their coverage moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "nap00", "user_id": 610920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "imperialorder241", "user_id": 626445}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Blissey": {"sets": {"Calm Mind": {}}},
  "Lugia": {"sets": {"Specially Defensive": {}, "Calm Mind": {}}},
  "Torkoal": {"sets": {"Sun Setter": {}}},
  "Deoxys": {
    "sets": {
      "All-out Attacker": {
        "description": "<p>Deoxys is one of Ubers UU's best wallbreakers thanks to its great mixed attacking and Speed stats and deep coverage movepool that allows it to threaten most of the tier. Superpower deals good damage to Pokemon that resist Psycho Boost such as Arceus-Dark, Dialga, and Magearna. Shadow Ball hits Giratina and Psychic-types like Mewtwo, Hatterene, opposing Deoxys, and Solgaleo. Extreme Speed allows Deoxys to pick off low health priority and Choice Scarf users or such as Palafin, Kyurem-W, and Chi-Yu. Alternatively, Knock Off allows Deoxys to secure KOs on Pokemon like Spectrier and specially defensive Solgaleo. Tera Psychic is generally preferred to boost the power of Deoxys's Psycho Boost, although Tera Ghost and Tera Fighting can be viable options, with the former boosting the power of Shadow Ball and providing a nifty immunity to Extreme Speed and the latter allowing Deoxys to beat Kingambit and Arceus-Dark. Deoxys fits best on offensive teams looking for a strong and reliable revenge killer and wallbreaker. Bulkier walls like Magearna, Giratina, and Solgaleo can take an attack from Deoxys and OHKO it or chip away at it by setting up entry hazards and letting it take Life Orb damage, so Pokemon like Chi-Yu, Arceus-Dark, and Landorus that can deal with these threats are nice. Great Tusk is a notable partner; Deoxys deals with Pokemon like Mewtwo, Kyurem-W, and Clefable that Great Tusk potentially struggles with, and in return, Great Tusk deals with Pokemon like Kingambit and Arceus-Fire. Deoxys also appreciates having a teammate that can pivot it into the game safely; thus, Magearna, Solgaleo, Landorus-T, and Palafin all make excellent partners.</p>"
      },
      "Lead": {
        "description": "<p>Deoxys is one of the best leads in Ubers UU thanks to its solid offensive stats and good movepool allowing it to act as an offensive threat after setting up entry hazards. Psycho Boost is an amazing one-time nuke, dealing serious damage to most Pokemon that don't resist it. Superpower allows Deoxys to target Pokemon like Arceus-Dark, Dialga, and Kyurem-W. Generally, Deoxys prefers Stealth Rock in the final moveslot, allowing it to nearly guarantee it sets up both Stealth Rock and a layer of Spikes, although Taunt can be run instead allowing it to stop Pokemon from setting up or laying their own entry hazards. Focus Sash allows Deoxys to guarantee at least one layer of entry hazards. Tera Psychic boosts Deoxys's Psycho Boost, although Tera Ghost can be run instead, allowing it to spinblock Pokemon like Great Tusk and Cyclizar and block Extreme Speed from Arceus-Fire, which otherwise troubles it. Deoxys fits best on offense and hyper offense teams looking for a dedicated lead that can set up hazards consistently. Offensive threats like Mewtwo, Zacian, and Ogerpon-H appreciate the entry hazards Deoxys sets up to wear down their switch-ins like Arceus-Dark, Solgaleo, and Giratina. Pokemon like Spectrier and Gholdengo that can spinblock are also nice to have. If Deoxys is not running Taunt threats like Arceus-Fire, Arceus-Dark, and Mewtwo may try to use it as set-up fodder, so Pokemon like Zamazenta-C, Palafin, and Magearna that can counter these threats are helpful to have.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "nap00", "user_id": 610920}, {"username": "Leo Justice", "user_id": 587908}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Deoxys-Speed": {"sets": {"Hazard Lead": {}}},
  "Garchomp": {"sets": {"Suicide Lead": {}, "TankChomp": {}}},
  "Dialga": {"sets": {"Mixed Utility": {}, "Specially Defensive": {}, "Trick Room Setter": {}}},
  "Palkia": {"sets": {"Choice Scarf": {}, "Trick Room Setter": {}}},
  "Palkia-Origin": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Palkia-O's high Speed, outstanding power, and good movepool make it an excellent offensive threat and one of Ubers UU's top Pokemon. Fire Blast lets Palkia-O more easily KO certain Fire-weak Pokemon, such as Magearna and Solgaleo, though it doesn't do significantly more damage than Hydro Pump without Tera Fire. Earth Power is a perfectly accurate, albeit slightly weaker, alternative to its STAB moves against foes like Dialga and Solgaleo. Substitute helps Palkia-O take advantage of switches it forces and eases prediction against Kingambit's Sucker Punch. Thunder Wave ruins Arceus formes Palkia-O Speed ties with and faster attackers like Mewtwo and Zacian. Tera Fire lets Fire Blast OHKO foes like Kingambit and non-specially defensive Magearna and 2HKO Solgaleo in addition to making Palkia-O better at taking on Fairy-types like Zacian and Dragon-types like opposing Palkia-O and Choice Scarf Kyurem-W. However, it does give Palkia-O a Stealth Rock weakness. Tera Fairy lets Palkia-O take Dragon-type moves with no fear while also improving its matchup against Fairy-types. Tera Ground should generally be used with Earth Power to 2HKO Dialga and Solgaleo, OHKO Kingambit, and OHKO Magearna with Spikes support; it also helps Palkia-O beat opposing Dragon-types and Magearna, gives it a resistance to Stealth Rock, and gives it an immunity to Thunder Wave. Palkia-O best fits on offense and balance teams looking for a potent wallbreaker, paring nicely with sweepers like Zacian and Kingambit. Palkia-O appreciates Steel-type pivots such as Solgaleo, Magearna, and Corviknight, which switch into the foes that beat it such as Zacian and maintain momentum. Solgaleo has the added benefit of checking many other foes that outspeed Palkia-O, like Mewtwo, while Magearna can set up Spikes to help Palkia-O put foes like Kingambit and opposing Magearna into its KO range. Corviknight and other forms of entry hazard control such as Great Tusk and Mandibuzz are helpful at keeping Palkia-O healthy given its vulnerability to hazards, especially if it's running Tera Fire.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Finchely", "user_id": 642468}, {"username": "Bella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Giratina": {
    "sets": {
      "Defog": {
        "description": "<p>Defog Giratina is a mixed wall that can spread status, remove entry hazards, and phaze out offensive threats like Mewtwo, Palafin, and Zamazenta. Dragon Tail can work on Taunt users like Arceus-Dark and Arceus-Grass, whereas Roar phazes Substitute users like Palkia-O and Fairy-types like Magearna and Zacian. Will-O-Wisp punishes physical attackers like Zacian and Palafin for switching in, but Draco Meteor can be used instead to hit Pokemon like Palkia-O and Kyurem-W, which would otherwise be safe switch-ins, and make Giratina less passive. Tera Fairy fixes Giratina's Dark- and Dragon-type weaknesses, letting it check Pokemon like Palkia-O, Chi-Yu, and Arceus-Dark; alternatively, Tera Poison turns its Fairy-type weakness into a resistance, allowing it to check Pokemon like Zacian and Magearna for its team, at the cost of a Psychic-type weakness making it worse against Mewtwo and Deoxys. 12 Speed EVs allow Giratina to always outspeed Jolly Kingambit. Giratina is checked by Pokemon like Arceus-Dark, Zacian, and Kyurem-W, so Pokemon that can handle these threats like Arceus-Dark and Zamazenta-C are excellent partners. Giratina checks Pokemon like Palafin, Mewtwo, and Arceus-Poison for its teammates; as a result, offensive Pokemon like Zamazenta-C, Chi-Yu, and Zacian that are checked by these threats benefit greatly from its presence. Pokemon like Kyurem-W and Chi-Yu also benefit from Defog removing the entry hazards that are often used to keep them in check.</p>"
      },
      "Hex": {
        "description": "<p>Hex Giratina is one of Ubers UU's premier walls thanks to its excellent typing and excellent support movepool. Dragon Tail and Roar offset Giratina's passivity by phazing threats that might try to set up on it, like Zacian, Arceus-Dark, and Landorus; Dragon Tail being unaffected by Taunt typically makes it the preferred option, though Roar's ability to affect Fairy-types and ignore Substitute make it a solid option as well. Thunder Wave is typically preferred to Will-O-Wisp, as it can punish Giratina’s checks like Palkia-O, Zacian, and Chi-Yu for switching in, but Will-O-Wisp can be used instead for its ability to cripple physical threats like Zacian, both Urshifu formes, and Kingambit. Tera Poison allows Giratina to check Fairy-types like Zacian and removes its Dark-, Ice-, and Dragon-type weaknesses, whereas Tera Fairy turns its Dragon- and Dark-type weaknesses into resistances, improving its matchup into Arceus-Dark, Chi-Yu, and Kyurem-W. 12 Speed EVs allow Giratina to always outspeed Jolly Kingambit. Defense EVs can be used over Special Defense investment to check Pokemon like Palafin and Ogerpon-H better. Magearna and Skamory greatly appreciate Giratina's ability to spinblock and its ability to beat many of their checks, like Ogerpon-H, Great Tusk, and Palafin. Giratina's weaknesses to Kyurem-W, Zacian, Chi-Yu, Palkia-O, and Arceus-Dark make Pokemon like Chi-Yu, Arceus-Dark, Zacian, and Zamazenta-C excellent partners, since they can check these threats for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "nap00", "user_id": 610920}], "teams": [{"name": "Quality checked by", "members": [{"username": "imperialorder241", "user_id": 626445}, {"username": "Bella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Arceus-Dark": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Calm Mind Arceus-Dark is an incredibly potent sweeper and stallbreaker in Ubers UU. Its amazing bulk allows it to set up on the many special attackers in the tier, such as Kyurem-W, Chi-Yu, and Mewtwo, and Taunt stops Blissey and other Arceus formes from setting up alongside it with their own Calm Mind, blocks Encore from Magearna, and prevents phazing from Giratina, Skarmory, and Dialga. Recover allows it to increase its longevity and set up on some physical attackers, such as Solgaleo and Kingambit. Tera Fairy grants Arceus-Dark a resistance to Fighting-type moves from the likes of Urshifu-S, Deoxys, and Mewtwo, along with an immunity to Dragon Tail, the only phazing move that cannot be prevented by Taunt. Tera Poison turns its Fairy, Fighting, and Bug weaknesses into resistances, which is incredible for setting up on Zacian, Magearna, and Zamazenta-C. Arceus-Dark greatly benefits from the help of Pokemon that can deal with physical attackers, as Zacian and Zamazenta-C both offensively check it, so Dondozo, Lugia, Skarmory, physically defensive Solgaleo, and Magearna form good defensive cores with it. Other Pokemon that pair well with Arceus-Dark are Zamazenta-C and Annihilape, as both are Defense-boosting offensive sweepers that can wall and eliminate physical attackers for Arceus-Dark to freely take care of special attackers. Arceus-Dark is very entry hazard weak, so Pokemon like Giratina and Great Tusk that can remove hazards for Arceus-Dark are greatly appreciated. Giratina appreciates Arceus-Dark's ability to check Dark- and Ghost-types like Gholdengo and Spectrier, and Great Tusk appreciates Arceus-Dark beating common checks to it like Giratina, Skarmory, and Deoxys.</p>"
      },
      "Defensive": {
        "description": "<p>Arceus-Dark has extensive options as a defensive Pokemon in Ubers UU checking metagame threats like Palafin-H and Deoxys. Foul Play hits physical attackers like Arceus-Fire and Palafin-H hard while still scoring solid damage versus Psychic-types such as Mewtwo and Lugia. Arceus-Dark can run Will-O-Wisp to cripple physical attackers, like Zacian and Zamazenta-C switching in, or it can run Stealth Rock to give its team entry hazard support if a partner doesn't have the move. Roar phazes many setup sweepers, such as Arceus and Mewtwo, whereas Taunt blocks them from setting up altogether. Taunt also shuts down many lead Pokemon like Smeargle and Galvantula and can force your opponent on the back foot provided it wins a Speed tie against opposing Arceus-Dark. Tera Poison turns Dark's Fairy, Fighting, and Bug weaknesses into resistances, which is especially helpful versus Zacian and Volcarona. Tera Fairy gives similar resistances to Poison, but the neutrality to Psychic and Ground helps against Great Tusk and Deoxys, and the valuable Dragon immunity lets Arceus-Dark beat Kyurem-W. Arceus-Dark benefits from specially defensive partners like Blissey, Calm Mind Clefable, and Giratina due to being weak to special attackers such as Magearna and Palkia-O. Arceus-Dark also pairs well with Corviknight and Regieleki, as both can remove hazards to keep it healthy and pivot it onto the field.</p>"
      },
      "Support": {
        "description": "<p>Arceus-Dark's wide support movepool and good defensive typing make it an excellent support Pokemon for bulkier teams. Roar or Dragon Tail is used to stop setup sweepers such as Nasty Plot Mewtwo and Calm Mind Arceus variants. Roar can be prevented by Taunt; however, unlike Dragon Tail it can phaze Fairy-types and Pokemon behind Substitute. Taunt is an alternative option to prevent opposing Pokemon from boosting and allow Arceus-Dark to chip down passive wall Pokemon like Giratina and Solgaleo by preventing them from healing. The last moveslot is fairly flexible; Arceus-Dark can serve as an effective entry hazard setter with Stealth Rock, while Will-O-Wisp and Thunder Wave let it cripple offensive Pokemon like Palafin and Ogerpon-H. Tera Poison lets Arceus-Dark beat setup sweepers that can otherwise force it out like Zacian and Arceus-Fighting. Tera Fairy provides similar resistances as Poison while also providing an extremely useful immunity to Dragon, letting it better check threats like Palkia-O, while not causing a pesky weakness to the Psychic-type moves fired off from Pokemon such as Mewtwo and Deoxys. Arceus-Dark checks Pokemon like Chi-Yu and Kyurem-W, so it pairs well with Pokemon like Zamazenta-C, Mewtwo, Palkia-O and Solgaleo, which struggle against those threats. Physically defensive Pokemon like Great Tusk and Calm Mind Lugia complement Arceus-Dark well; the former can beat many Dark-resistant Pokemon that pressure it like both Urshifu formes while appreciating its ability to check Psychic-types, and the latter checks Fighting-types well and appreciates other setup sweepers being deterred from setting up. Giratina is another good teammate thanks to its typing letting it check sweepers that Arceus-Dark cannot, such as Arceus-Fire and Sneasler; in exchange, Arceus-Dark checks opposing Ghost- and Dark-types such as Spectrier and Chi-Yu and spreads status so Giratina can fire off powerful Hexes.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bice", "user_id": 236507}, {"username": "imperialorder241", "user_id": 626445}], "teams": [{"name": "Quality checked by", "members": [{"username": "SwordIsBored", "user_id": 489963}, {"username": "Leo Justice", "user_id": 587908}, {"username": "nap00", "user_id": 610920}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Arceus-Dragon": {"sets": {"Support": {}}},
  "Arceus-Electric": {
    "sets": {
      "Calm Mind": {
        "description": "<p>While it faces stiff competition from other Arceus formes like Arceus-Dark and Arceus-Fire, Arceus-Electric's offensive typing and near-unresisted coverage with Ice Beam makes it a dangerous setup sweeper. Electric-type Judgment deals to Pokemon like Palkia-O, Palafin, and Toxapex. Ice Beam allows Arceus-Electric to hit Pokemon that otherwise wall it like Great Tusk, Arceus-Grass, and Dialga. Tera Flying is generally preferred as it gives Arceus-Electric a valuable immunity to Ground-type attacks from Great Tusk and Landorus, though Tera Ice can be used to boost the power of Ice Beam. Arceus-Electric generally fits best on balance teams looking for a solid setup sweeper. Arceus-Electric's most immediate issue isGround-types like Great Tusk and Landorus that can threaten it. As such, Pokemon like Palkia-O, Kyurem-W, and Palafin that can threaten them out are naturally good partners. Arceus-Electric can also struggle to break through specially defensive walls like Giratina and Solgaleo, so partners like Kingambit, Chi-Yu, and Spectrier who can remove them form potent cores with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Finchely", "user_id": 642468}, {"username": "nap00", "user_id": 610920}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Arceus-Fighting": {"sets": {"Cosmic Power": {}}},
  "Arceus-Fire": {
    "sets": {
      "Extreme Killer": {
        "description": "<p>Extreme Killer Arceus-Fire is a good early-game wallbreaker and one of the most powerful late-game cleaners in the metagame thanks to its powerful Extreme Speed, which hits foes before they have a chance to revenge kill it. The combination of Swords Dance, Extreme Speed, and Tera Normal makes Arceus-Fire lethal if positioned correctly. Recover allows it to shrug off recoil damage from Flare Blitz with minimal difficulty. Tera Normal is essential for Arceus-Fire to have the necessary damage output to complete a sweep, as it cannot run a boosting item instead of Flame Plate; Tera Normal also removes its weaknesses to Ground- and Water-type attacks from the likes of Great Tusk, Landorus, and Palafin-H. 72 Speed EVs allow it to outspeed Timid Gholdengo. Arceus-Fire fits on a wide variety of teams, but it has a few notable partners. Arceus-Fire pairs especially well with Rillaboom, as it removes bulky Water-types like Dondozo for Arceus-Fire's sweep, and Grassy Terrain weakens Earthquake's damage and provides passive recovery. Hazard control from Great Tusk, Giratina, or Corviknight is also essential when using Arceus-Fire, as it suffers from a crippling weakness to Stealth Rock, greatly limiting its longevity. Arceus-Fire is vulnerable to Taunt and Encore users like Cyclizar, Magearna, and Ogerpon-H and Haze users like Toxapex, which can all prevent it from setting up. Teammates like Gholdengo, which is immune to all status moves, and Rillaboom, which typically does not use status or setup moves, are good partners to remedy this weakness. Arceus-Fire struggles to break through physical walls like Toxapex, Giratina, and Garganacl that resist its powerful Flare Blitz while also being able to take Extreme Speed, so partners like Landorus, Kyurem-W, and Zacian that can break through these threats form potent offensive cores with Arceus-Fire.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "olivia", "user_id": 620359}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "nap00", "user_id": 610920}, {"username": "imperialorder241", "user_id": 626445}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Arceus-Grass": {
    "sets": {
      "Calm Mind + Taunt": {
        "description": "<p>Arceus-Grass is a potent stallbreaker and sweeper in Ubers UU thanks to its excellent bulk and decent typing enabling it to repeatedly Calm Mind. Taunt blocks common anti-setup measures like Roar from Solgaleo and Giratina and Encore from Magearna and Ogerpon-H, allowing Arceus-Grass to stack massive amounts of boosts. Recover allows Arceus-Grass to check Pokemon like Palafin and Palkia-O throughout the course of the game, as well as giving it multiple attempts to sweep. Tera Poison grants Arceus-Grass a resistance to Poison-type attacks from Pokemon like Sneasler and Arceus-Poison, along with removing its other weaknesses like to Ice- and Fire-type moves from Kyurem-W and Chi-Yu. Alternatively, Tera Fairy can be opted for, as its ability to block Dragon Tail from the likes of Dialga and Giratina removes some of the only defensive counterplay to Arceus-Grass that's not covered by Taunt. Arceus-Grass is forced out by foes like Ogerpon-H, Tera Fire Zacian, and Dragon Dance Arceus-Poison, so Pokemon that can handle these threats like Toxapex, Giratina, and Landorus-T are excellent partners. Arceus-Grass can check Pokemon like Palkia-O, Palafin, and Landorus for its teammates, which Pokemon like Chi-Yu, Solgaleo, and Zamazenta-C appreciate. Arceus-Grass can struggle to break through Grass-resistant foes like Dialga and Galarian Slowking, so Pokemon like Chi-Yu and Landorus that can remove them pair excellently with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "nap00", "user_id": 610920}], "teams": [{"name": "Quality checked by", "members": [{"username": "imperialorder241", "user_id": 626445}, {"username": "Bella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Arceus-Poison": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Dragon Dance Arceus-Poison utilizes its solid defensive typing to set up on common offensive threats like Zacian, Ogerpon-H, and Arceus-Grass. Gunk Shot is usually the STAB move of choice as it is able to OHKO Zacian, but Poison Jab can be used instead as a more reliable, although much weaker, option. Earthquake hits Poison-resistant foes like Solgaleo, Toxapex, and Magearna hard, though Flare Blitz can be used instead in order to hit Skamory and Corviknight. Recover allows Arceus-Poison to wall Pokemon like Zacian and Arceus-Grass for the entire game, along with giving it the ability attempt to sweep multiple times. Tera Ground can be used to boost the power of Earthquake and is normally preferred, but Tera Flying provides a Ground immunity, allowing Arceus-Poison to set up on Pokemon like Great Tusk and Landorus, making it a solid alternative. Mewtwo and Deoxys can threaten an OHKO on Arceus-Poison, so Pokemon like Solgaleo, Magearna, and Chi-Yu that can handle these threats are excellent teammates. Pokemon like Palkia-O, Giratina, and Palafin appreciate Arceus-Poison's ability to beat their checks like Arceus-Grass, Zacian, and Dialga.</p>"
      },
      "E-Killer": {},
      "Support": {}
    },
    "credits": {"writtenBy": [{"username": "nap00", "user_id": 610920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "Leo Justice", "user_id": 587908}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Arceus-Psychic": {"sets": {"Cosmic Power": {}}},
  "Excadrill": {"sets": {"Sand Rush Sweeper": {}, "Lead": {}}},
  "Galvantula": {
    "sets": {
      "Sticky Web": {
        "description": "<p>Galvantula carves a out niche in Ubers UU thanks to it being the fastest available Sticky Web setter, having solid offenses, and having the ability to threaten out common forms of entry hazard control like Great Tusk and Mandibuzz. Energy Ball gives Galvantula coverage against Ground-types like Great Tusk and Landorus, although Bug Buzz is an option to give it a secondary STAB option hit Pokemon like Mewtwo, Arceus-Dark, and Deoxys. Thunder Wave allows Galvantula to cripple Pokemon like Zacian, Kyurem-W, and Arceus-Poison after setting up Sticky Web. Although Galvantula will not often Terastallize, Tera Ghost allows it to block Rapid Spin from Great Tusk and Cyclizar. Focus Sash guarantees Galvantula will set up Sticky Web and potentially fire off an attack or paralyze something afterwards. Galvantula should be exclusively used as a Sticky Web lead for hyper offense teams. The most obvious partners for Galvantula are Pokemon that appreciate having their faster offensive counters slowed down, as well as Pokemon commonly revenge killed by faster threats. As a result, Pokemon like Choice Specs Kyurem-W, Mewtwo, and Landorus all make solid teammates. Ghost-types like Gholdengo and Dragapult and Taunt users like Arceus formes can prevent Rapid Spin and Defog and keep Sticky Web up. Counter leads like Taunt Arceus-Dark, Deoxys, and Hatterene can prevent Sticky Web being set up and give Galvantula issues, so Pokemon like Hatterene and Palafin that can deal with these threats are good to have as partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "imperialorder241", "user_id": 626445}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Volcarona": {"sets": {"Quiver Dance": {"description": "<p>124 Speed is to outspeed Deoxys at +1</p>"}}},
  "Reshiram": {"sets": {"Choice Scarf": {}}},
  "Landorus": {"sets": {"Choice Scarf": {}, "Life Orb": {}}},
  "Landorus-Therian": {"sets": {"Choice Scarf": {}, "Defensive": {}}},
  "Kyurem-White": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Kyurem-W is one of the most dangerous Pokemon in Ubers UU thanks to its combination of high Special Attack, good coverage options, and usable defensive profile, making it one of the tier's most dangerous revenge killers and special attackers. Draco Meteor + Ice Beam is a great STAB combination, hitting the majority of the tier. Freeze-Dry gives Kyurem-W coverage for Water-types like Palafin and Toxapex. Fusion Flare gives Kyurem-White coverage for Steel-types like Magearna, Solgaleo, and Zamazenta-C. Tera Fire allows Kyurem-W to boost Fusion Flare as well as provides it with a nifty resistance to Fairy- and Steel-type attacks from the likes of Zacian, Magearna, Dialga, and Solgaleo. Kyurem-W fits best on balance and offensive teams looking for a strong revenge killer and special attacker. Kyurem-W struggles to break through specially defensive walls like Blissey and Solgaleo, so Pokemon that can deal with these walls like Arceus-Fire, Zamazenta-C, and Landorus-T, make good partners. Entry hazard control from Pokemon like Great Tusk and Corviknight increases Kyurem-W's longevity.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Kyurem-W is an unparalleled wallbreaker in Ubers UU. Draco Meteor is an nuclear bomb of an attack, easily OHKOing most neutral targets such as Dialga and Mewtwo. Ice Beam gives Kyurem-W a strong move versus Fairy-types such as Zacian and Clefable while also allowing it to hit Ground- and Flying-types, such as Great Tusk and Landorus, hard. Freeze-Dry allows Kyurem-W to OHKO Palafin and Palkia-O without dropping its Special Attack with Draco Meteor. Fusion Flare allows Kyurem-W to hit the Steel-types that would otherwise resist Ice and Dragon, such as Magearna and Solgaleo. Tera Fire is a must to power up its Fusion Flare while also helping against Zacian and Solgaleo by making its Fairy and Steel weaknesses into resistances. Kyurem-W is incredibly vulnerable to entry hazards due to its Stealth Rock weakness, meaning it appreciates hazard removal from Giratina or Great Tusk. Another great teammate that helps with hazard control is Hatterene, due to its immunity to Dragon-type moves helping against Arceus-Dragon and Garchomp, as its Magic Bounce ability provides a proactive way of preventing hazards. Kyurem-W also pairs well with slower pivots, such as Galarian Slowking and Solgaleo, as they help to get it onto the field safely. Kyurem-W is especially vulnerable to the many faster threats in the metagame, such as Zacian, Zamazenta-C, and Palkia-O, so it likes the support of Sticky Web from Galvantula and Smeargle or paralysis from Magearna and Giratina.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}, {"username": "imperialorder241", "user_id": 626445}], "teams": [{"name": "Quality checked by", "members": [{"username": "Leo Justice", "user_id": 587908}, {"username": "Finchely", "user_id": 642468}, {"username": "nap00", "user_id": 610920}]}, {"name": "Grammar checked by", "members": [{"username": "sunny004", "user_id": 197240}, {"username": "Rose", "user_id": 511181}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Toxapex": {
    "sets": {
      "Defensive": {
        "description": "<p>Toxapex's access to Regenerator, good defensive typing, and formidable bulk lets it excel at keeping physical threats like Zacian and Palafin at bay. Haze prevents foes like Ogerpon-H and Zacian from boosting repeatedly and subsequently breaking past Toxapex. While on the field, Toxic Spikes keep threats like Palkia-O, Kyurem-W, and Palafin from coming in lest they be put on a timer. Alternatively, Toxic is an option to make Toxapex a more threatening presence on the field, although it means Substitute from Pokemon like Palkia-O ruins it. Infestation lets Toxapex trap poisoned foes, forcing them to accumulate passive damage. Alternatively, Sludge Bomb gives Toxapex a means of pressuring Calm Mind + Taunt Arceus formes. If no other check is available, Toxapex can use Tera Dark to absorb a Psystrike or Kowtow Cleave from Mewtwo or Kingambit and neutralize it with Haze or Toxic. In a similar fashion, it can use Tera Grass to stomach a hit from Landorus, Arceus-Electric, or Great Tusk and cripple it with Toxic. Toxapex is a natural fit on bulky balance and is a staple on stall, as its staying power shines best in the long games such teams often face. Being a physical wall, Toxapex can form a strong defensive core with special walls like Solgaleo, Blissey, Arceus-Dark, and Magearna. Pokemon susceptible to passive damage like Landorus-T and Arceus formes appreciate Toxapex absorbing chip damage in their place so that they can be in top shape when they're needed. Toxapex is vulnerable to Pokemon like Great Tusk, Landorus, and Mewtwo; pair it with teammates that can cover these threats, such as Landorus-T, Skarmory, and Solgaleo.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tanny89k", "user_id": 546606}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Solgaleo": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Specially defensive Solgaleo is one of the tier's premier special walls, is an amazing pivot, and is even a solid phazer. Knock Off hits Psychic- and Ghost-type Pokemon like Mewtwo, Deoxys, and Giratina, though Sunsteel Strike can be used instead as strong STAB move, to deal more damage to opposing Arceus and threaten Zacian. Knock Off's item-removing effect synergizes excellently with Roar's phazing, allowing Solgaleo to remove Heavy-Duty Boots and force foes to take repeated entry hazard damage. Roar also prevents sweepers like Zacian, Mewtwo, and Zamazenta-C from setting up on it. Tera Water removes Solgaleo's Fire and Ground weaknesses, allowing it to check Pokemon like Arceus-Fire, Trailblaze Ogerpon-H, and Great Tusk. Tera Dark, on the other hand, allows it to check Dark- and Ghost-types, like Spectrier, Giratina, and Chi-Yu. Teleport assists in getting powerful wallbreakers like Chi-Yu, Deoxys, and Kyurem-W onto the field safely. Solgaleo can have trouble with Pokemon like Chi-Yu, Kingambit, Palafin, and Landorus, so Pokemon like Kyurem-W, Great Tusk, Zamazenta-C, Palkia-O, and Arceus-Dark that can check these threats are excellent partners.</p>"
      },
      "Trick Room Setter": {
        "description": "<p>Solgaleo is one of the tier's best Trick Room setters due to its amazing defenses, pivoting with Teleport that can let it bring in its teammates safely, and good typing. Knock Off can be used instead of Sunsteel Strike to hit Psychic- and Ghost-type Pokemon like Mewtwo and Deoxys; its item-removing effect also makes Solgaleo pair well with entry hazard setters like Great Tusk, as it can remove Heavy-Duty Boots to make hazards more potent. Tera Water removes Solgaleo's Fire and Ground weaknesses, which can let it check Pokemon like Arceus-Fire, Landorus, and Great Tusk. Solgaleo synergizes excellently with Pokemon like Magearna and Dialga, as they can help set up Trick Room for each other. Solgaleo also pairs well with Pokemon that can take advantage of Trick Room like Ursaluna, Kingambit, and Palkia, as it can pivot them in safely to help deal with threats like Chi-Yu, Spectrier, and Arceus-Fire. Solgaleo can often be threatened out by Pokemon like Kingambit, Chi-Yu, and Arceus-Fire, which makes partners like Zamazenta-C, Arceus-Dark, and Palkia appreciated. Solgaleo can also pair well with other slow pivots like Dialga and Galarian Slowking, as they can pivot each other in to help deal with Pokemon like Choice-locked Kyurem-W and Zamazenta-C.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "nap00", "user_id": 610920}], "teams": [{"name": "Quality checked by", "members": [{"username": "imperialorder241", "user_id": 626445}, {"username": "Bella", "user_id": 567483}, {"username": "Leo Justice", "user_id": 587908}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Magearna": {
    "sets": {
      "Utility": {
        "description": "<p>Magearna is one of the best defensive Pokemon in Ubers UU, thanks to its role compression as both a pivot and entry hazard stacker. Magearna provides its team with useful utility options like Spikes, Volt Switch, Encore, and Thunder Wave. Fleur Cannon is an extremely powerful move, being able to chunk most of the metagame hard, especially Fairy-weak Pokemon like Arceus-Dark, both Urshifu formes, and Kyurem-W, whereas Draining Kiss greatly improves Magearna's longevity, at the cost of increased passivity. Encore and Thunder Wave both attempt to offset Magearna's passivity, with Encore punishing Pokemon attempting to set up on it, like Zamazenta-C, Mewtwo, and Zacian, by locking them into a move. Alternatively, Thunder Wave provides speed control for its teammates and cripples offensive Pokemon, like Zacian, Palkia-O, and Mewtwo. Tera Water allows Magearna to check Pokemon like Arceus-Fire, Chi-Yu, and Great Tusk, which it wouldn’t be able to do otherwise. Tera Flying is another option, allowing it to check Pokemon like Landorus and Great Tusk while becoming immune to Spikes, though this comes at the cost of a Stealth Rock weakness. Magearna is pressured by offensive Pokemon like Chi-Yu, Landorus, and Ogerpon-H; as such, Pokemon like Giratina, Kyurem-W, and Arceus-Dark partner well with it. Magearna's unique combination of both Volt Switch and Spikes allows it to enable Pokemon like Palkia-O, Kyurem-W, and Chi-Yu fantastically, as their checks like Arceus-Dark, Solgaleo, and Palkia-O can't hold Heavy-Duty Boots.</p>"
      },
      "Double Dance": {
        "description": "<p>Magearna's excellent defensive typing, great bulk, Soul-Heart, which is synergistic with Stored Power, and good boosting options allow it to act as a niche setup sweeper in Ubers UU. Stored power can muscle through Pokemon like Dialga, Unaware walls such as Clefable, and even Calm Mind Blissey with enough boosts. Draining Kiss gives Magearna semi-reliable recovery. Shift Gear makes Magearna faster, allowing it to outpace checks like Arceus-Fire and Landorus. Iron Defense is a niche alternative, making Magearna incredibly difficult to KO on the physical side, which can be helpful against threats like Great Tusk and Arceus-Fire. Tera Water is an excellent defensive typing, allowing Magearna to set up on Pokemon like Great Tusk, Kingambit, and Palafin. Magearna fits best on hyper offense teams, although it also can work on balance teams as well. Because of how long it can take Magearna to get set up initially, dual screens and Aurora Veil from Regieleki, Deoxys, and Alolan Ninetales support Magearna well. The most threatening Pokemon to Magearna are Fire- and Ground-types like Arceus-Fire, Chi-Yu, and Great Tusk that prevent it from safely setting up. As a result, Pokemon like Palkia-O, Palafin, and Landorus-T that can deal with these threats can be helpful to have. Solgaleo completely stops Magearna, so Pokemon such as Arceus-Fire, both Landorus formes, and Kingambit are good teammates. Taunt and Encore users like Arceus-Dark and Ogerpon-H can give Magearna free switch-in opportunities to set up safely.</p>"
      },
      "Trick Room Setter": {
        "description": "<p>Magearna is an effective Trick Room setter because of its amazing typing, defenses, and pivoting capabilities. Eject Pack allows Magearna's Fleur Cannon to act as a pivoting move, which can be an effective way to deal large amounts of damage, as well as gain momentum on potential Ground-types seeking to block Volt Switch such as Great Tusk and Landorus. Steel Beam allows it to faint, letting another Pokemon come in whilst Volt Switch allows Magearna to pivot into a teammate safely so it can receive the benefits of Trick Room. Encore can be used over Volt Switch to lock foes into status moves, such as Arceus formes using Swords Dance or Calm Mind, which gives Magearna a free turn to use Trick Room or pivot into a teammate. Tera Water provides a resistance to Fire, allowing Magearna to set up Trick Room or pivot against foes that would previously threaten it out such as Arceus-Fire and Chi-Yu, while Tera Flying can allow it to take advantage of Ground-types that hope to come in on its Volt Switch such as Great Tusk. Trick Room teams need multiple Trick Room setters, which makes other Pokemon like Solgaleo and Dialga, which also provide a defensive backbone, synergize well with Magearna. Ursaluna and Kingambit are good options for Pokemon that can take advantage of Trick Room. Other than that, Magearna pairs well with allies that cover its type weaknesses such as Landorus-T which can threaten Fire-types like Arceus-Fire and Ogerpon-H, provide a Ground-type immunity, and form a pivoting core with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "SwordIsBored", "user_id": 489963}, {"username": "Bella", "user_id": 567483}, {"username": "nap00", "user_id": 610920}], "teams": [{"name": "Quality checked by", "members": [{"username": "imperialorder241", "user_id": 626445}, {"username": "Finchely", "user_id": 642468}, {"username": "Bella", "user_id": 567483}, {"username": "nap00", "user_id": 610920}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Rillaboom": {"sets": {"Choice Band": {}, "Assault Vest": {"description": "<p>An Adamant nature and 52 Attack EVs allow Rillaboom to KO Palkia-O with Wood Hammer + Grassy Glide</p>"}}},
  "Corviknight": {"sets": {"Physically Defensive": {}}},
  "Hatterene": {"sets": {"Calm Mind": {}, "Eject Button": {}}},
  "Zacian": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Zacian is one of Ubers UU's best late-game cleaners and wallbreakers thanks to Intrepid Sword, its good Attack and Speed, decent bulk for an offensive threat, and its deep coverage movepool. Close Combat targets Pokemon like Zamazenta-C and Dialga. Zacian's last moveslot is relatively flexible; Tera Blast is generally preferred with either Tera Fire or Ground to hit Pokemon like Magearna, Solgaleo, Arceus-Fire, and Skarmory, although if they are not an issue, Psychic Fangs to hit Arceus-Poison and Toxapex without having to Terstallize and Crunch to hit Deoxys and Mewtwo are viable options. Tera Fire and Ground also provide immunities to burns and Thunder Wave, respectively. If Zacian is running Crunch, Tera Dark can be used to boost said move and provide an immunity to Psychic-type attacks from the likes of Deoxys and Mewtwo. Heavy-Duty Boots allows Zacian to stay healthy and be great in the Sticky Web matchup. Zacian best fits on offensive teams looking for a solid late-game cleaner. Zacian struggles against bulkier, physically defensive Pokemon like Magearna, Skarmory, and Toxapex, so Pokemon like Chi-Yu, Deoxys, and Arceus-Dark that can handle these threats are helpful to have. Zacian has four-moveslot syndrome, so it also appreciates support from teammates like Landorus-T and Chi-Yu that can deal with the Pokemon that Zacian can't hit, like Arceus-Fire and Skarmory. Pokemon like Choice Specs Kyurem-W, Mewtwo, and Giratina like having Zacian threaten out Pokemon they struggle against like Palkia-O and Kingambit. Entry hazard support from the likes of Deoxys and Dialga helps wear down Zacian's checks, allowing it to function as a more threatening cleaner; in return, Zacian removes Pokemon they have problems with like Kingambit, Palkia-O, and Arceus-Dark for them. Pivoting from the likes of Magearna, Landorus-T, Solgaleo, and Cyclizar gives Zacian a safe opportunity to set up Swords Dance; the later can also potentially pass Zacian a free Substitute with Shed Tail.</p>"
      },
      "Wallbreaker": {
        "description": "<p>Zacian's excellent Speed and power make it both a fantastic revenge killer and wallbreaker. Close Combat helps cover Steel-types switching in, dealing super effective damage to Pokemon like Dialga and Zamazenta-C and hitting Magearna neutrally. Crunch helps remove key targets like Gholdengo, Solgaleo, Mewtwo, and Galarian Slowking. Psychic Fangs is occasionally used to beat Poison-types like Toxapex and Arceus-Poison it otherwise has trouble removing, while Wild Charge allows Zacian to hit Corviknight, Skarmory, and Dondozo. Tera Fighting can boost Close Combat to extreme levels, allowing it to break through Pokemon like Magearna and Solgaleo. Tera Ground is notable for providing an immunity to Thunder Wave and a powerful option to break through checks like Toxapex, Magearna, and Solgaleo in Tera Blast Ground. Zacian best fits as a wallbreaker on bulky offense and balance teams. Great Tusk and Landorus-T are excellent partners for Zacian, being able to set up Stealth Rock to chip down foes and also threaten the Steel- and Poison-type Pokemon like Magearna and Arceus-Poison that it is weak to. Late-game cleaners like Arceus-Fire, Sneasler, and Arceus-Grass enjoy the gaps Zacian creates in defensive cores providing them with opportunities to set up and sweep weakened teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}, {"username": "olivia", "user_id": 620359}], "teams": [{"name": "Quality checked by", "members": [{"username": "Leo Justice", "user_id": 587908}, {"username": "nap00", "user_id": 610920}, {"username": "Bella", "user_id": 567483}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Zamazenta-Crowned": {
    "sets": {
      "IronPress": {
        "description": "<p>With its combination of robust defenses and good Attack, Zamazenta-C is an excellent mid- or late-game sweeper for bulkier teams. Body Press synergizes well with Iron Defense and Dauntless Shield, and when combined with Zamazenta-C's brilliant natural bulk, it can quickly clean up weakened teams. Behemoth Bash or Heavy Slam lets it Zamazenta-C answer Fairy-types, like Zacian and Tera Fairy Arceus-Dark, and Crunch lets it tackle Psychic- and Ghost-types, like Mewtwo, Giratina, Lugia, and Deoxys. 200 Speed EVs with a Jolly Nature allow it to outspeed Cyclizar, 112 Attack EVs let it have a favorable roll to 2HKO Mewtwo, and the rest of the EVs go into Defense to maximize Body Press's damage. Tera Water lets Zamazenta-C stay in on more opponents foes like Arceus-Fire, Palafin, Chi-Yu, and Kyurem-W, and Tera Flying lets you it resist Fighting-type moves from the likes of Mewtwo, Zacian, and Deoxys and be immune to Ground-type moves from Great Tusk, Landorus, and Ursaluna, though a weakness to Stealth Rock is added. Being able to check Magearna, Zacian, Dialga, Ursaluna-B, Arceus-Dark, Palafin, and Palkia-O, Zamazenta-C is appreciated by Giratina, Chi-Yu, Palkia-O, Arceus-Dark and Mewtwo. Zamazenta-C suffers from being worn down by entry hazards, so a hazard remover like Great Tusk or Giratina is needed. It also appreciates hazard support of its own from setters like Magearna and Dialga. Fighting-, Ground-, and Fire-resistant Pokemon like Arceus-Poison, Rillaboom, and Giratina are also a boon to Zamazenta-C, as they can stomach whatever hits come at it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Go make a sandwitch", "user_id": 275219}], "teams": [{"name": "Quality checked by", "members": [{"username": "nap00", "user_id": 610920}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Urshifu": {"sets": {"Choice Band": {}}},
  "Urshifu-Rapid-Strike": {"sets": {"Choice Scarf": {}}},
  "Regieleki": {
    "sets": {
      "Dual Screens": {
        "description": "<p>Thanks to having the highest Speed in Ubers UU and good utility options, Regieleki is a niche but effective dual screens lead. Volt Switch allows Regieleki to bring a partner onto the battlefield. Rapid Spinlets Regieleki remove entry hazards for Pokemon like Kyurem-W, although Explosion is an option to give it a one-time nuke that always brings a partner in safely. Tera Flying gives Regieleki an immunity to Ground-type attacks, which allows it to set up dual screens on Great Tusk and both Landorus formes. Alternatively, Tera Ghost allows Regieleki to be immunity to Extreme Speed from Arceus formes and Deoxys and operate as a spinblocker. Regieleki should only be used on hyper offense teams and should be sent in first or after a Pokemon like Deoxys-S has set up entry hazards. Setup sweepers like Nasty Plot Mewtwo and Zacian appreciate Regieleki setting up dual screens to help them set up more safely. Pokemon like Choice Specs Kyurem-W and Kingambit like Regieleki pivoting them onto the field safely. Gholdengo is a notable partner, as it blocks Defog and can use the dual screens Regieleki sets up to set up as well. Regieleki struggles against counter leads like Defog Giratina, Taunt Arceus, and Deoxys that prevent it from setting up dual screens, so Pokemon that can take these threats on like Zacian, Great Tusk, and Kingambit can be valuable.</p>"
      },
      "Offensive Utility": {}
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "imperialorder241", "user_id": 626445}, {"username": "nap00", "user_id": 610920}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Spectrier": {"sets": {"Choice Scarf": {}, "Nasty Plot Sweeper": {}}},
  "Ursaluna": {"sets": {"Trick Room Sweeper": {}}},
  "Sneasler": {"sets": {"Unburden Sweeper": {}, "Choice Scarf": {}}},
  "Garganacl": {"sets": {"Iron Defense": {}, "Curse": {}, "Stealth Rock": {}}},
  "Espathra": {"sets": {"Calm Mind": {"description": "<p>12 speed EVs allow you to outspeed base 120 Speed Pokemon at +1</p>"}}},
  "Palafin": {"sets": {"Choice Band": {}}},
  "Cyclizar": {"sets": {"Utility": {}}},
  "Dondozo": {"sets": {"Unaware Wall": {}}},
  "Annihilape": {"sets": {"Bulk Up": {}, "Choice Scarf": {}}},
  "Kingambit": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Kingambit is one of Ubers UU's most threatening wallbreakers and late-game cleaner thanks to its naturally high Attack, decent defenses, an incredible ability in Supreme Overlord, access to Swords Dance, and great offensive typing allowing it to threaten Pokemon like Solgaleo, Mewtwo, Giratina, and Clefable. While Kowtow Cleave is normally preferred to have a more consistent Dark-type STAB move than Sucker Punch, Low Kick is an option to hit threats like Dialga and opposing Kingambit for super effective damage. Sucker Punch is extremely valuable, allowing Kingambit to operate as a revenge killer against Pokemon like Mewtwo, Deoxys, and Choice Scarf Kyurem-W. Black Glasses boosts Kingambit's Dark-type STAB moves, making it a more powerful threat and achieve valuable damage thresholds like OHKOing offensive Arceus formes after a Swords Dance when five teammates have fallen. Alternatively, Leftovers can give Kingambit a slight amount of consistent recovery, and Lum Berry allows it to avoid crippling status from Pokemon like Dialga and Giratina. Tera Flying gives Kingambit a great defensive typing, flipping the matchup against Pokemon like Great Tusk, Landorus-T, and Zamazenta-C. 12 Speed EVs allow Kingambit to outspeed paralyzed Arceus formes. Kingambit fits best on offensive and hyper offensive teams looking for a powerful physical wallbreaker and late-game cleaner. Kingambit's inability to deal much damage against bulky Fighting-types like Great Tusk and Zamazenta-C can be problematic, so Pokemon that can take these threats on like Palkia-O, Landorus, Chi-Yu, and Palafin are nice to have. Kingambit can remove Psychic- and Ghost-types like Mewtwo, Giratina, and Gholdengo, which allows partner Pokemon like Zamazenta-C have an easier time attempting a sweep themselves.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "nap00", "user_id": 610920}, {"username": "imperialorder241", "user_id": 626445}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Great Tusk": {
    "sets": {
      "Offensive Utility": {
        "description": "<p>Thanks to its good typing, stats, and ample movepool, Great Tusk can serve as both an effective entry hazard remover and wallbreaker. Knock Off helps Great Tusk punish Pokemon that wall it such as Giratina, Skarmory, and Landorus. Close Combat lets Great Tusk hit threats such as Arceus-Dark and Ursaluna hard, while Stealth Rock lets Great Tusk compress the roles of hazard setter, wallbreaker, and hazard remover. Tera Dark is used to bolster Knock Off and grant Great Tusk an immunity to Psychic-type moves from the likes of Deoxys and Mewtwo, letting it punish them with a super effective Knock Off. Tera Water can instead be used to grant Great Tusk a resistance to Palafin's Water moves and Arceus-Fire's Flare Blitz. Hazard-weak wallbreakers, such as Chi-Yu and Kyurem-W, appreciate Great Tusk removing hazards for them; in exchange, they target the physical walls that Great Tusk loathes. Kyurem-W in particular forms an excellent offensive core with it, being able to offensively pressure its checks such as Giratina and Lugia. Arceus-Dark also makes a good partner for Great Tusk, as it covers Great Tusk's weakness to special attackers while also enjoying hazards being removed. Furthermore, Arceus-Dark pressures the Ghost-types that block Great Tusk's attempts to use Rapid Spin.</p>"
      },
      "Physically Defensive": {
        "description": "<p>Great Tusk is one of the best physically defensive Pokemon in Ubers UU. It has an excellent utility movepool, with options like Rapid Spin and Knock Off, to support its teammates. Bulk Up can allow Great Tusk to use its amazing bulk to sweep weakened teams, and Stealth Rock allows it to provide even more utility to its team in the form of entry hazard support. Knock Off allows Great Tusk to hit incoming Psychic- and Ghost-types that try to block Rapid Spin, notably Mewtwo, Deoxys, and Giratina, while also providing greatly helping its team by removing a foe's item. Rapid Spin allows Great Tusk to remove hazards, which enables Pokemon like Kyurem-W and Chi-Yu, while also boosting its Speed, potentially allowing it a shot at sweeping the opposing team. Tera Steel is the best defensive Tera type for Great Tusk, as it flips its many weaknesses into resistances, such as Fairy, Psychic, and Ice, which helps against Pokemon like Baxcalibur, Zacian and Deoxys. Tera Ground is also good to remove its Psychic and Fairy weaknesses against Pokemon like Mewtwo and Zacian while also boosting Earthquake. Most strong special attackers will beat Great Tusk, such as Mewtwo and Palkia-O; therefore, it mostly pairs well with special walls, such as Blissey and Arceus-Dark. Great Tusk also has a very strong synergy with Wish passers like Alomomola and Clefable, as they vastly increase its longevity as it has due to it having no natural recovery outside of Leftovers. Great Tusk is an excellent check to Pokemon like Urshifu-S and Kingambit due to its great typing and bulk, which can enable teammates like Magearna and Kyurem-W.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bice", "user_id": 236507}, {"username": "imperialorder241", "user_id": 626445}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "nap00", "user_id": 610920}, {"username": "Finchely", "user_id": 642468}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Iron Moth": {"sets": {"Booster Energy": {}}},
  "Baxcalibur": {"sets": {"Swords Dance": {}, "Dragon Dance": {}}},
  "Gholdengo": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Gholdengo is a fearsome setup sweeper in Ubers UU, in part due to its terrifyingly strong signature move, potent signature ability, and fantastic defensive typing. Make it Rain allows Gholdengo to output huge damage and hit important targets like Kyurem-W, Baxcalibur, and Zacian, whereas Shadow Ball offers incredible neutral coverage while hitting Mewtwo, Giratina, and Galarian Slowking extremely hard. Recover allows Gholdengo to have incredible longevity alongside its immunity to status moves. Tera Water allows Gholdengo to turn its Fire weakness into a resistance, helping against Chi-Yu and Kyurem-W, while also providing a resistance to Water, which assists against Palkia-O and Palafin. Air Balloon gives Gholdengo a temporary Ground immunity, giving it more entry points through an immunity to Spikes, Earth Power, and Earthquake from Great Tusk and Landorus. Gholdengo pairs excellently with entry hazard setters such as Magearna and Skarmory, as it blocks both Rapid Spin and Defog. It can also break through some walls with its sheer power, like Clefable and Arceus-Grass, giving teammates like Zacian an easier time cleaning up. Gholdengo struggles with faster offensive Pokemon that can halt its sweep and revenge kill it, such as Dragapult and Tera Fire Zacian, so Pokemon like Deoxys, Palafin, and Rillaboom can help Gholdengo by handing them. Pokemon with strong priority moves, like Kingambit and Palafin, can also halt its sweep and revenge kill it, so teammates like Zamazenta-C and Palkia-O, which can take Sucker Punch and Jet Punch, respectively, provide excellent support for it.</p>"
      },
      "Specially Defensive": {},
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"username": "imperialorder241", "user_id": 626445}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "Leo Justice", "user_id": 587908}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Chi-Yu": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Chi-Yu is one of the strongest revenge killers in Ubers UU thanks to its monstrous Special Attack and typing that lets it check threats like Zamazenta-C and Kingambit. Overheat is used alongside a Modest nature to OHKO Zacian after Stealth Rock damage; it is also useful to OHKO Magearna after it uses Calm Mind, a benchmark that Flamethrower misses on. Tera Blast coupled with Tera Fairy lets Chi-Yu OHKO Palkia-O and 2HKO Arceus-Dark, while Fire Blast is weaker than Overheat but does not lower Chi-Yu's Special Attack, potentially allowing it to sweep weakened teams. In adition to making Tera Blast useful, Tera Fairy provides a useful resistance to Dragon- and Fighting-type attacks from the likes of Palkia-O and Great Tusk and lets Chi-Yu switch in more times by removing its Rock weakness. Tera Fire bolsters Chi-Yu's Fire-type attacks to nuclear levels, allowing it to 2HKO Pokemon like Arceus-Dark after entry hazard damage. Good partners for Chi-Yu include entry hazard setters like Magearna and Great Tusk, which help it get some KOs more easily, such as against Arceus-Dark and Terastalized Solgaleo. Magearna, Landorus-T, and Solgaleo can safely get Chi-Yu in the field with their slow pivoting moves. Chi-Yu appreciates entry hazard removal from Great Tusk and Corviknight so it can be an effective revenge killer. Chi-Yu may struggle to revenge kill bulky foes like Blissey, Arceus-Dark, and Terastalized Solgaleo, so teammates that can deal with them like Great Tusk, Zacian, and Zamazenta-C are appreciated. Torkoal is a decent partner for Chi-Yu, as it bolsters its Fire-type attacks to atomic levels, making it capable of OHKOing and 2HKOing the majority of the tier. Lastly, Chi-Yu struggles against priority moves like Jet Punch and Extreme Speed, so teammates that can switch into these attacks, like Skarmory, Corviknight, Dialga, and Giratina, are appreciated.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Chi-Yu is one of the strongest wallbreakers in Ubers UU, being able to destroy almost everything in its path with its superb Special Attack stat and typing that lets it check Pokemon like Mewtwo and Kingambit; however, its middling Speed stat doesn't let it wallbreaker as consistently. Overheat OHKOes and 2HKOes the majority of the metagame, including Fire-resistant foes and bulky walls like Blissey; however, it comes at the cost of making Chi-Yu prone to getting revenge killed. Fire Blast is a weaker but more consistent option than Overheat, as it does not drop Chi-Yu's Special Attack while still incinerating everything. Tera Fire bolsters Chi-Yu's Fire-type attacks to ungodly levels, allowing it to OHKO even walls like Blissey after very minimal chip damage. Tera Blast Fairy is an option if Chi-Yu instead wants to OHKO Palkia-O and Arceus-Dark. Good teammates for Chi-Yu include fast wallbreakers like Zacian, Palkia-O, and Deoxys that can help make up for its middling Speed. Pokemon that can deal with Arceus formes like the aforementioned Palkia-O and Zacian are good teammates as well. Entry hazard removal from the likes of Great Tusk and Mandibuzz is also appreciated for Chi-Yu to wallbreak effectively. Lastly, Chi-Yu often gets significantly chipped or outright OHKOed if it doesnt OHKO the opposing threat. Therefore, pivots like Landorus-T, Great Tusk, and Solgaleo, that can get Chi-Yu in against targets in its KO range, are good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "nap00", "user_id": 610920}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Roaring Moon": {"sets": {"Dragon Dance": {}}},
  "Walking Wake": {"sets": {"Choice Specs": {}}},
  "Ogerpon-Hearthflame": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-H is an incredibly potent stallbreaker and sweeper in Ubers UU due to Mold Breaker and Swords Dance. Trailblaze allows Ogerpon-H to boost its Speed past that of usually faster Pokemon, such as Deoxys, Dragapult, Zacian, Choice Scarf Chi-Yu, and Choice Scarf Landorus. Power Whip and Horn Leech can be run as stronger Grass-type moves to hit Palafin and Great Tusk for super effective damage. Ivy Cudgel gives Ogerpon-H a strong, non-contact Fire-type STAB move to hit Magearna and Skarmory with while avoiding Rocky Helmet chip damage. Play Rough is for Dragon-types like Giratina and Reshiram that resist its STAB moves, whereas Knock Off is for general utility and hits Mewtwo and Lugia. Terastallizing Ogerpon-H gives it an Attack boost, letting it grab OHKOs on bulky neutral Pokemon like Zacian and Dialga without a Swords Dance boost. Ogerpon-H is best dealt with using offensive counterplay that takes advantage of its poor bulk, as Pokemon like Deoxys, Zacian, Choice Scarf Landorus, Chi-Yu, and Palafin can outrun and KO it. Defensively, almost nothing can take Ogerpon-H on, as Mold Breaker ignores Unaware, so only the likes of Moltres can safely handle it. Entry hazards are also a huge problem for Ogerpon-H, as it cannot hold Heavy-Duty Boots, meaning it will take significant chip damage when hitting the battlefield. Ogerpon-H especially appreciates support from Corviknight, which can help Ogerpon-H safely hit the field and remove hazards. Ogerpon-H also forms strong offensive cores with priority users like Rillaboom, Palafin, and Arceus formes due to them being able to eliminate the few faster threats in the metagame. Ogerpon-H also pairs uniquely well with Sticky Web Galvantula, as the foes' Speed drops let it move before everything in the unboosted metagame besides priority users, making it much more threatening.</p>"
      },
      "All Out Attacker": {}
    },
    "credits": {"writtenBy": [{"username": "imperialorder241", "user_id": 626445}], "teams": [{"name": "Quality checked by", "members": [{"username": "Finchely", "user_id": 642468}, {"username": "Leo Justice", "user_id": 587908}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  }
}