{
  "Mewtwo": {"sets": {"Setup Sweeper": {}}},
  "Ho-Oh": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Ho-Oh shines as an entry hazard control option that can cripple and scout a sizable portion of the metagame with little risk while also keeping itself healthy with Regenerator. Its Fire / Flying typing and solid mixed bulk enable it to come into a variety of foes such as Xerneas, Arceus-Ground, Arceus-Fairy, and Mega Salamence. Its typing specifically grants it an immunity to burns from the likes of Giratina-O and Arceus-Dark and Toxic Spikes from Eternatus.</li> <li>Sacred Fire acts as a solid STAB option that also lets Ho-Oh apply pressure on Steel-types—which are immune to Toxic—like Necrozma-DM and Zacian-C while also potentially crippling foes with a burn, rendering it difficult to switch into.</li> <li>Toxic allows Ho-Oh to cripple switch-ins such as Zygarde, Primal Groudon, Primal Kyogre, Giratina-O, opposing Ho-Oh, and support Arceus formes without Refresh.</li> <li>Whirlwind provides a phazing option to disrupt setup sweepers such as Necrozma-DM, Zygarde, and Xerneas.</li> <li>The given EV spread avoids an OHKO from Xerneas's Thunder after a Geomancy and maximizes physical bulk to avoid an OHKO from Zacian-C's Wild Charge at +2 Attack, and it also allows Ho-Oh to more comfortably handle foes such as Necrozma-DM, Mega Salamence, and physically offensive Arceus formes.</li> <li>Tera Grass gives Ho-Oh the option to consistently phaze Xerneas after a Geomancy independently of coverage by granting it a resistance to Electric-type moves and a neutrality to Rock-type moves for Hidden Power Rock variants. Such typing also helps against foes such as Marshadow, Arceus-Ground, and especially Zygarde, as Zygarde's Thousand Arrows hits the entire metagame for neutral or super effective damage otherwise. Tera Grass also makes it a good check for Water-types such as Palkia-O, Primal Kyogre, and Arceus-Water.</li> <li>Tera Ground gives Ho-Oh the option to outplay foes that try to hit it with super effective Rock- and Electric-type coverage like Marshadow, Xerneas, and Flutter Mane and also eases the matchup against Eternatus and Zekrom.</li> <li>Tera Dark provides Ho-Oh with the capability to easily check Psychic-, Dark-, and Ghost-types like Mega Mewtwo Y, Ultra Necrozma, Yveltal, and Lunala. With it, Ho-Oh can also ignore Taunt from Grimmsnarl, allowing it to remove dual screens with Defog.</li> <li>By Terastallizing, Ho-Oh minds Stealth Rock significantly less, which can be crucial if it loses its Heavy-Duty Boots, with Tera Ground in particular giving the most longevity via resisting the Rock-type. However, it also becomes vulnerable to other entry hazards such as Spikes and Toxic Spikes.</li> <li>Ho-Oh's utility and defensive traits let it fit well on balance and more defensive team structures that appreciate a hazard control option, pivot, and phazer.</li> <li>Avoid keeping Ho-Oh on targets that can use Knock Off to remove its Heavy-Duty Boots. Otherwise, Ho-Oh will be forced to either compromise its longevity and utility or Terastallize.</li> <li>Ho-Oh should be preserved at good health if the other team has strong threats that it's meant to check, such as Xerneas. When handling setup sweepers, it's more consistently reliable for Ho-Oh to use Whirlwind than to inflict a burn with Sacred Fire. However, this strategy shouldn't be relied on too much late-game, as Whirlwind fails when only a single foe remains.</li> <li>As it's tasked with answering many different threats, Ho-Oh can get overwhelmed if heavily relied on. Therefore, Pokemon such as Primal Groudon, Arceus-Poison, and Necrozma-DM help Ho-Oh as secondary answers to foes such as Xerneas and Zacian-C.</li> <li>Pokemon such as Marshadow, Zacian-C, Eternatus, and Primal Groudon often run super effective coverage that can KO Ho-Oh; as such, it appreciates allies that can come into them, which include Giratina-O, Arceus-Ground, and Necrozma-DM.</li> <li>Ho-Oh appreciates hazard setters because Sacred Fire, Toxic, and Whirlwind can force a lot of switches and thus deal massive amounts of chip damage, so Pokemon such as Primal Groudon and Eternatus are great allies in this regard.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bobsican", "user_id": 434487}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Weirdhamster", "user_id": 611966}]}, {"name": "Grammar checked by", "members": [{"username": "queez", "user_id": 229690}]}]}
  },
  "Salamence": {"sets": {"Dragon Dance": {}}},
  "Kyogre": {
    "sets": {
      "Wallbreaker": {
        "description": "<ul> <li>Primal Kyogre is a great wallbreaker thanks to an amazing movepool, high Special Attack, and a good ability in Primordial Sea.</li> <li>Water Spout is recommended due to its preposterous damage output, especially at full health under rain as it is able to 2HKO foes that resist it like Ferrothorn, OHKO neutral targets like Necrozma-DM, and a small chance to OHKO +2 Xerneas.</li> <li>Origin Pulse is an alternative that can be used for more consistent damage, especially when Primal Kyogre is chipped, but it has worse accuracy and also doesn't deal as much damage as Water Spout, as it fails to meet most of the benchmarks above.</li> <li>Ice Beam deals reliable damage against Zygarde-C, Eternatus, Mega Salamence, Giratina-O, and Primal Groudon on the switch in, and also can be used as a backup option if Primal Kyogre is chipped.</li> <li>Thunder is recommended to deal with opposing Primal Kyogre and Arceus-Water, which Primal Kyogre would otherwise struggle against.</li> <li>Calm Mind allows Primal Kyogre to 2HKO on walls like Ferrothorn, Primal Groudon, and specially defensive Eternatus as well as avoid the 2HKO from Meteor Beam Eternatus and opposing Primal Kyogre's Thunder.</li> <li>Primal Kyogre should be used early-game to blow holes in an opponents' defensive cores and it can easily use Calm Mind on Pokemon like Ho-Oh and Zygarde.</li> <li>Primal Kyogre best fits on bulky and hyper offense teams that appreciate its great bulk and monstrous Special Attack.</li> <li>Primal Kyogre has a shaky matchup against Primal Groudon, due to the unique interaction between Desolate Land and Primordial Sea as well as not switching into Primal Groudon very well. Therefore, Pokemon that Primal Groudon struggles against, like Zygarde-C and Arceus-Ground, are appreciated as teammates.</li> <li>Primal Kyogre also has average physical bulk and is threatened by strong physical attackers like Marshadow and Zacian-C. Therefore, defensive checks like Yveltal, Zygarde-C, and Ho-Oh are also beneficial as teammates. Yveltal and Ho-Oh can also remove entry hazards, a big obstacle for Primal Kyogre.</li> </ul>"
      },
      "Defensive Calm Mind": {}
    },
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bobsican", "user_id": 434487}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Groudon": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Primal Groudon is among the best support Pokemon in National Dex Ubers thanks to its great typing, impressive base stats, wide movepool, and incredible ability in Desolate Land.</li> <li>Stealth Rock provides chip damage to many staples of the tier like Arceus-Fairy, Primal Kyogre, and opposing Primal Groudon. Spikes is an option that deals more damage to Rock-resistant foes, like Arceus-Ground and Zygarde.</li> <li>Precipice Blade 2HKOes neutral targets like offensive variants of Xerneas and Primal Kyogre, and it has a solid chance to OHKO Eternatus as well as a small chance to OHKO opposing offensive Primal Groudon after one layer of Spikes.</li> <li>Rock Tomb hits Ho-Oh and Yveltal for super effective damage and is a great tool to cripple Speed-boosting foes like Mega Salamence, Ultra Necrozma, and Scale Shot and Dragon Dance Zygarde. Overheat is an option that hits neutral and Fire-weak targets like Arceus-Ground, Tera Grass Ho-Oh, and Ferrothorn for heavy damage.</li> <li>Toxic cripples common switch-ins to Primal Groudon such as Arceus-Ground, Zygarde, and Arceus-Dark and puts them on a timer. Roar can be used instead to phaze setup sweepers that would try to use Primal Groudon as setup fodder, like Dragon Dance and Calm Mind Arceus-Ground, Dragon Dance and trapper Zygarde, and Mega Salamence. If entry hazards are up, it can also be used to rack up damage against the opposing team.</li> <li>The given EV spread lets Primal Groudon survive two Low Kick from Choice Band Marshadow as well as a +2 Earthquake from Adamant Necrozma-DM. A Careful nature can be run for more safety against Xerneas while also surviving two Modest Dynamax Cannon from Eternatus. A Sassy nature can be used for the same role if it's using Overheat, and it still outruns uninvested Necrozma-DM.</li> <li>This set fits best on bulky offensive teams that need a solid entry hazard setter that is not passive against common Defoggers like Ho-Oh and Yveltal.</li> <li>As it has no form of recovery, Primal Groudon can struggle taking care of Geomancy Xerneas. Thus, a secondary phazer like Ho-Oh works well with it. Tera Grass Ho-Oh can also help Primal Groudon to deal with Primal Kyogre, which can be somewhat tricky for Primal Groudon to handle alone. Most of the time, trading HP against the opposing Primal Groudon is not wanted, so solid answers to it like Zygarde and Giratina-O are welcome additions. Good answers to Arceus-Ground are also recommended, such as defensive Primal Kyogre and the aforementioned Ho-Oh.</li> </ul>"
      },
      "Double Dance": {
        "description": "<ul> <li>Primal Groudon's huge Attack and great defensive profile make it a fantastic wallbreaker and sweeper with Swords Dance and Rock Polish.</li> <li>Stone Edge hits Flying-types such as Ho-Oh and Mega Salamence. Heat Crash is an alternative that provides a perfectly accurate Desolate Land-boosted STAB option that hits certain foes harder than Precipice Blades, such as Ferrothorn and Xerneas, though running it leaves Primal Groudon unable to hit foes such as Giratina-O for neutral damage. However, most Fire-resistant Flying-types, like Ho-Oh and Mega Salamence, still take heavy damage from Heat Crash.</li> <li>The given EV spread maximizes Primal Groudon's Attack while providing just enough Speed to outspeed Choice Scarf Xerneas and Yveltal after using Rock Polish, with the rest being dumped into HP to increase its bulk.</li> <li>Primal Groudon best fits on offense teams looking for a powerful threat that can act as a sweeper or wallbreaker depending on the situation. Typically, it should use Swords Dance against defensive teams and Rock Polish against offensive teams. Primal Groudon's ability, typing, and bulk also let it check some foes in a pinch, like Primal Kyogre, Xerneas, and Arceus.</li> <li>Entry hazard setters such as Deoxys-S can help chip Primal Groudon's checks, such as Zygarde-C and Arceus-Ground, into KO range. Grimmsnarl can provide dual screens support to help Primal Groudon set up, sometimes even allowing it to set up both Swords Dance and Rock Polish. Both of those teammates carry Taunt, which can stop the opposing team from setting up hazards, making it easier for Primal Groudon to set up.</li> <li>Offensive teammates such as Mega Salamence and Zacian-C can help Primal Groudon's team maintain offensive pressure, either by breaking holes for it or by taking advantage of the holes it makes.</li> <li>Certain physically bulky Ground-types, such as Arceus-Ground and Zygarde-C, can beat Primal Groudon one-on-one and sometimes even set up alongside it. Primal Kyogre is effective at handling these foes, while Flying-types like Yveltal and Mega Salamence can switch into them in a pinch.</li> </ul>"
      },
      "Utility Swords Dance": {},
      "Offensive Support": {},
      "Eruption": {
        "description": "<ul> <li>Primal Groudon is a potent mixed attacker thanks to its amazing stat spread, its Ground / Fire typing, and its expansive movepool. It switches into many staples, like Ferrothorn, Necrozma-DM, and Eternatus, and this breaks holes in many teams early-game if healthy enough.</li> <li>Eruption allows Primal Groudon to deal strong damage to foes that don't take as much damage from Precipice Blades, such as support Arceus formes like Arceus-Ground and Arceus-Dark, as well as Ferrothorn, and Xerneas. Eruption can also 2HKO foes that resist Fire, like non-defensive Eternatus and Zygarde before Power Construct.</li> <li>Precipice Blades is Primal Groudon's secondary STAB move, hitting Zacian-C, Primal Kyogre, and Necrozma-DM more reliably than Eruption when Primal Groudon is chipped.</li> <li>Rock Tomb can be used to deal super effective damage to common switch-ins, such as Ho-Oh and Mega Salamence, while also giving Primal Groudon a form of speed control against foes like Eternatus and Yveltal. Alternatively, Stone Edge can be used to deal heavier damage against Giratina-O and OHKO Ho-Oh after minimal chip damage.</li> <li>Swords Dance is recommended to reliably OHKO Necrozma-DM, Primal Kyogre, and Eternatus with Precipice Blades after a boost while also 2HKOing the majority of its checks, like Arceus-Ground and Zygarde-C.</li> <li>Stealth Rock is an alternative that can be used to soften up opposing staples like Arceus-Fairy, Arceus-Ground, and opposing Primal Groudon while also heavily damaging Mega Salamence and Yveltal. It also allows Primal Groudon to reliably OHKO Marshadow and Rayquaza after Stealth Rock damage.</li> <li>Eruption Primal Groudon fits best on bulky offense teams that appreciate a mixed wallbreaker that can blow holes in the opposing team early-game.</li> <li>Although Primal Groudon is a threatening early-game wallbreaker, it still cannot deal with the likes of Arceus-Ground, Zygarde-C, and Palkia-O, so it appreciates teammates that can deal with them, like Primal Kyogre, Palkia-O, and Arceus-Fairy.</li> <li>Primal Groudon appreciates entry hazard support from Eternatus and support Arceus formes like Arceus-Dark and Arceus-Ground, as they can chip most of Primal Groudon's aforementioned checks. In return, Primal Groudon can deal with Zacian-C and Primal Kyogre for them, respectively.</li> <li>It's important to keep Primal Groudon from needlessly being chipped, so having a teammate with entry hazard control such as Ho-Oh or Yveltal, is beneficial.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Eledyr", "user_id": 415367}, {"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bobsican", "user_id": 434487}, {"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "zastra", "user_id": 558636}, {"username": "Weirdhamster", "user_id": 611966}]}, {"name": "Grammar checked by", "members": [{"username": "zastra", "user_id": 558636}, {"username": "ken", "user_id": 594478}, {"username": "StupidFlandrs48", "user_id": 633500}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Rayquaza": {"sets": {"Setup Sweeper": {}, "Choice Band": {}}},
  "Deoxys-Attack": {"sets": {"Mixed Attacker": {}}},
  "Deoxys-Speed": {"sets": {"Lead": {}}},
  "Palkia-Origin": {"sets": {"Wallbreaker": {}}},
  "Giratina-Origin": {"sets": {"Physical Utility": {}, "Special Utility": {}}},
  "Arceus": {"sets": {"Extreme Killer": {}}},
  "Arceus-Dark": {"sets": {"Utility": {}}},
  "Arceus-Fairy": {"sets": {"Defensive": {}, "Calm Mind": {}}},
  "Arceus-Ghost": {"sets": {"Dragon Dance": {}}},
  "Arceus-Ground": {"sets": {"Calm Mind": {}, "Physical Setup Sweeper": {}, "Defensive": {}}},
  "Arceus-Water": {"sets": {"Utility": {}, "Defensive Calm Mind": {}, "Offensive Calm Mind": {}}},
  "Ferrothorn": {"sets": {"Specially Defensive": {}}},
  "Xerneas": {"sets": {"Geomancy": {}, "Choice Scarf": {}}},
  "Yveltal": {
    "sets": {
      "Defensive": {},
      "Specially Offensive": {
        "description": "<ul> <li>Dark Pulse is Yveltal's main attacking option. With Dark Aura and a Life Orb, it allows Yveltal to 2HKO many of the tier's defensive options, such as Necrozma-DM, Primal Groudon, and Zygarde.</li> <li>Oblivion Wing has solid neutral coverage with Dark Pulse, being able to hit the Fairy-, Fighting-, and Dark-types that would switch into Dark Pulse, such as Xerneas, Arceus-Dark, and opposing Yveltal.</li> <li>Taunt shuts down opposing setup, such as Xerneas's Geomancy and Arceus's Swords Dance, entry hazards, such as Primal Groudon's Stealth Rock, and status moves, such as Ho-Oh's Toxic; when combined with Oblivion Wing, it allows Yveltal to win duels against many Pokemon that would otherwise be able to take on Yveltal's attacks, such as support Arceus formes and defensive Eternatus.</li> <li>Knock Off cripples Pokemon, such as Ho-Oh, Chansey and Xerneas, by removing their item, while Sucker Punch allows Yveltal to punish faster Pokemon such as Deoxys-A, Ultra Necrozma, and Mega Mewtwo Y, making it a solid revenge killer.</li> <li>Tera Dark boosts Dark Pulse's power to ridiculous feats, such as being able to 2HKO specially defensive Eternatus, defensive Primal Kyogre, and Ho-Oh, as well as boosting Sucker Punch and Knock Off's damage. Tera Flying can also be used to increase Oblivion Wing's power, letting it hit Arceus-Dark, opposing Yveltal, and Xerneas harder, which in return gives Yveltal more longevity.</li> <li>Yveltal should be used as an offensive check to Pokemon like Primal Groudon, Marshadow, and Necrozma-DM. Switching into resisted moves such as Marshadow's Spectral Thief and Lunala's Moongeist Beam or attacks Yveltal is immune to such as Primal Groudon's Precipice Blades and Ultra Necrozma's Photon Geyser allows Yveltal to stay healthy throughout a game, which is important, as Yveltal can get worn down from Stealth Rock and Life Orb recoil. Oblivion Wing is best suited for use when Yveltal is at low HP, as it should mostly be using Dark Pulse for damage otherwise.</li> <li>Although much of the tier is 2HKOed by Yveltal, most of the metagame is able to 2HKO Yveltal as well, even with neutral moves, such as Necrozma-DM's Sunsteel Strike and Eternatus's Dynamax Cannon.</li> <li>Yveltal should avoid status as much as possible; Toxic from Ho-Oh and Giratina-O ruins its longevity in longer games, paralysis from Zygarde's Glare and Necrozma-DM's Thunder Wave limits its Speed so it's more likely to be KOed by faster threats, and burns from Ho-Oh and Arceus-Dark weaken the strength of Knock Off and Sucker Punch, the latter being problematic against more offensive teams where priority may be necessary for revenge killing.</li> <li>Due to Xerneas not running maximum Speed on its Geomancy sets, it could be worth it for Yveltal to use Taunt to prevent it from setting up, but this is risky and should be only used as a last resort since Yveltal is OHKOed by Xerneas's Moonblast.</li> <li>Yveltal's immediate power allows it to be an early-game wallbreaker for its team, which is good for offensive structures.</li> <li>Specially offensive Yveltal fits best on offensive teams. Primal Groudon is a good partner, as it is able to beat Pokemon like Zacian-C and Arceus-Fairy that would be hard for Yveltal to break, while Yveltal can break through Giratina-O and Zygarde for Primal Groudon in return; Yveltal is also able to come in on the Ground-type moves that would threaten Primal Groudon, barring Thousand Arrows from Zygarde, while Primal Groudon comes in on the Fairy- and Electric-type moves that threaten Yveltal, such as Xerneas's Moonblast and Primal Kyogre's Thunder. Ho-Oh can remove Stealth Rock for Yveltal, which improves its longevity, and it can also prevent Xerneas from sweeping as easily. Necrozma-DM is able to handle Fairy- and Ice-types such as Calyrex-I and Arceus-Fairy, and Yveltal can come into the Ghost-, Dark-, and Ground-type moves that Necrozma-DM struggles with, such as Marshadow's Spectral Thief, opposing Yveltal's Dark Pulse, and Primal Groudon's Precipice Blades.</li> <li>Powerful physical sweepers such as Zacian-C, Mega Salamence, Arceus-Ground, and Ultra Necrozma appreciate Yveltal removing common physical walls such as Zygarde, Giratina, Primal Groudon, and Dondozo, while they handle the special walls such as Ho-Oh and Chansey in return; Zacian-C in particular can break through opposing Yveltal and Arceus-Dark with Play Rough, letting Yveltal spam Dark Pulse more easily.</li> <li>Hazard hyper offense teams using suicide leads such as Deoxys-S, Smeargle, Shuckle, and Glimmora appreciate Yveltal stopping Defog attempts from Ho-Oh, Giratina, and support Arceus formes with Taunt, as well as removing Heavy-Duty Boots from Pokemon like Ho-Oh, defensive Eternatus, and Giratina with Knock Off.</li> </ul>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"username": "S0A0M0I0", "user_id": 604820}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bobsican", "user_id": 434487}, {"username": "Weirdhamster", "user_id": 611966}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Zygarde": {"sets": {"Coil": {}, "Dragon Dance": {}, "Trapper": {}}},
  "Lunala": {"sets": {"Calm Mind": {}, "Power Herb": {}, "Defensive": {}, "Choice Specs": {}}},
  "Necrozma-Dusk-Mane": {
    "sets": {
      "Ultra Special": {},
      "Ultra Physical": {},
      "Dragon Dance": {
        "description": "<ul> <li>Dragon Dance Necrozma-DM is a ferocious wallbreaker and cleaner that finds a home on bulky offense and balance teams. Necrozma-DM is able to leverage its bulk, typing, ability, and the possbility of bluffing the threat of Ultra Necrozma to force a switch or absorb an incoming attack such as Primal Groudon's Precipice Blades or Arceus-Dark's Foul Play and then use Dragon Dance.</li> <li>If Ho-Oh is sufficiently covered, Stone Edge can be substituted for Photon Geyser. This move still hits Ho-Oh hard while enabling Necrozma-DM to beat Dondozo, which would otherwise wall it. It has the added benefit of OHKOing Eternatus without the need to spend a turn stat boosting.</li> <li>Solganium Z allows Necrozma-DM to OHKO common switch-ins such as Arceus-Dark, Yveltal, and Zygarde with +1 Searing Sunraze Smash mid-game, clearing the way for its teammates.</li> <li>The extra bulk provided by 132 HP EVs allows Necrozma-DM to avoid OHKOs from some hits it otherwise wouldn't while still hitting important Speed benchmarks. For example, Necrozma-DM will survive Life Orb Marshadow's Poltergeist after Stealth Rock, defensive Primal Groudon's Precipice Blades after a single layer of Spikes, and defensive Primal Kyogre's +1 Scald. With 124 Speed EVs, Necrozma-DM has the ability to outspeed uninvested base 90s with a neutral nature such as defensive Primal Groudon and Ho-Oh. At +1 Necrozma-DM outspeeds fully invested Yveltal and Xerneas. At +2 Necrozma-DM outspeeds the entire unboosted metagame, only fearing priority moves such as Marshadow's Shadow Sneak or Yveltal's Sucker Punch.</li> <li>Alternatively, investing in 236 Speed EVs allows Necrozma-DM to outspeed fully invested base 120s at +1 such as Arceus-Ground and Mega Salamence. If Necrozma-DM uses Dragon Dance on the switch-in, it retains the ability to OHKO Mega Salamence with Searing Sunraze Smash with minimal chip after Intimidate removes Necrozma-DM's Attack boost.</li> <li>Due to a lack of recovery, Necrozma-DM needs to be cognisant of its HP, as any chip is permanent. Necrozma-DM frequently absorbs large hits while setting up or revenge killing certain threats, and taking chip may render it unable to do so. For example, Necrozma-DM always survives defensive Primal Groudon's Precipice Blades after a layer of Spikes but can be OHKOed if Stealth Rock is also on the field.</li> <li>Dragon Dance Necrozma-DM should not be used to fulfill the defensive duties typically associated with Necrozma-DM such as switching into an unscouted Xerneas or Zacian-C, though it can revenge kill them. It excels when used as a secondary check to them, with teammates such as Ho-Oh and Primal Groudon serving as primary checks.</li> <li>Necrozma-DM struggles heavily against offensive Primal Groudon, Marshadow, and physical Arceus-Ground. Offensive Primal Groudon is able to OHKO Necrozma-DM with its STAB moves. Marshadow is always able to revenge kill Necrozma-DM with Shadow Sneak and OHKO it with Poltergeist. Physical Arceus-Ground OHKOes Necrozma-DM with Tectonic Rage and can threaten to sweep if given the opportunity to use Dragon Dance. Zygarde is an excellent teammate on balance teams that can switch into all three of these Pokemon and provides valuable paralysis support, which allows Necrozma-DM to outspeed the entire unboosted metagame. Giratina-O is a good teammate on bulky offense teams that can switch into Primal Groudon and Arceus-Ground. Necrozma-DM also appreciates the Defog and status support provided by Giratina-O.</li> <li>Arceus-Fairy provides a Dark switch-in on balance teams, which helps mitigate the downside of misfiring Searing Sunraze Smash into the wrong target. It is a good check to Life Orb Yveltal, which is otherwise very threatening to balance teams and can revenge kill Necrozma-DM with Sucker Punch. Arceus-Fairy can also provide Stealth Rock and status support in the form of Will-O-Wisp and Toxic to chip opposing Pokemon into range of Necrozma-DM's attacks such as Primal Groudon, Zacian-C, and Arceus-Ground.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "bumboclaat", "user_id": 523420}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bobsican", "user_id": 434487}]}, {"name": "Grammar checked by", "members": [{"username": "Zrp200", "user_id": 327515}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Marshadow": {"sets": {"All-Out Attacker": {}, "Bulk Up": {}, "Choice Band": {}}},
  "Grimmsnarl": {"sets": {"Dual Screens": {}}},
  "Zacian-Crowned": {"sets": {"Standard": {}}},
  "Eternatus": {"sets": {"Defensive": {}, "Z-Move": {}, "Meteor Beam": {}}},
  "Flutter Mane": {"sets": {"Calm Mind": {}}}
}