{
  "Venusaur": {
    "sets": {
      "Physically Defensive (Grass)": {
        "description": "<p>Mega Venusaur excels as a wall on Grass teams, effectively tanking Fire- and Ice-type hits with its Thick Fat ability. It relies on Sludge Bomb as its main attack, dealing with Grass- and Fairy-types—such as Rillaboom and Iron Valiant—while also poisoning walls like Mega Sableye, Iron Hands, and Porygon2. Synthesis provides reliable healing, which, combined with Leech Seed and Sludge Bomb's poison, allows Mega Venusaur to wear down foes such as Garchomp. Hidden Power Fire handles Steel-types like Mega Scizor, Ferrothorn, and Gholdengo, although Earth Power can also be used to answer Steel-, Poison- and Fire-types such as Heatran and Iron Moth. The Speed EVs allow Mega Venusaur to outpace Adamant Azumarill. Mega Venusaur's teammates greatly appreciate its ability to handle threats like Mega Diancie and Mega Scizor and clear Toxic Spikes. Ferrothorn and Cradily form a solid defensive core, absorbing hits from Flying- and Psychic-types such as Galarian Moltres and Tapu Lele, while Mega Venusaur tanks Fire-, Ice-, and Fighting-type attacks. Whimsicott and Tapu Bulu help with the Dragon matchup, and Celebi handles the problematic Poison-types like Toxapex and Nidoking. Rillaboom and Breloom provide strong priority, allowing them to threaten faster threats such as Nihilego. Rillaboom also sets up Grassy Terrain to supply additional passive recovery along with Mega Venusaur's Leech Seed, boosting longevity. Meowscarada and Zarude serve as speedy wallbreakers that are capable of breaking through walls such as Clodsire and Skeledirge. Both also benefit from pivoting into Mega Venusaur to tank attacks from the aforementioned Fighting-, Fire-, and Ice-types.</p>"
      },
      "Physically Defensive (Poison)": {
        "description": "<p>Mega Venusaur finds a solid position on Poison teams thanks to its secondary Grass typing, good natural bulk, and helpful set of tools. Giga Drain threatens Water- and Ground-types like Barraskewda, Swampert, and Great Tusk. Hidden Power Fire is used to deal with Steel-type Pokemon such as Ferrothorn and Mega Scizor. Leech Seed provides recovery and forces out bulky targets such as Blissey. Earth Power threatens Fire- and Poison-type targets like non-Air Balloon Heatran and Toxapex. Sludge Bomb handles Fairy- and Grass-types like Mega Altaria, Tapu Koko, and Ogerpon-W along with being able to spread poison, thus chipping foes down. The given EV spread is used to maximize Mega Venusaur's bulk while still allowing it to outspeed Adamant Azumarill. Alolan Muk serves as a solid partner for Mega Venusaur, being a specially defensive wall capable of threatening Psychic- and Ghost-types like Tapu Lele, Galarian Slowking, Blacephalon, and Gholdengo. Galarian Slowking can handle threats such as Volcarona, Zapdos, and Kyurem, which easily blast through Mega Venusaur. Crobat provides Defog support, granting Mega Venusaur safe entry, and it can also deal with threats such as Mega Gallade with Brave Bird and Substitute Hydreigon with Infiltrator Toxic. Toxapex complements Mega Venusaur as a physically defensive wall, capable of taking on foes like Mega Scizor, Galarian Zapdos, and Weavile along with providing Z-Haze for boosted threats like Kommo-o. Offensive threats like Sneasler, Nidoking, and Nihilego appreciate Mega Venusaur being able to take hits from bulky Ground-types like Clodsire and Hippowdon. In response, Sneasler can remove specially defensive threats like Hisuian Goodra and Blissey thanks to its powerful Close Combat, Nidoking can remove threats like Corviknight, Gliscor, and Gholdengo thanks to its diverse and offensive movepool, and Nihilego can handle Fire- and Flying-type threats like Volcarona, Mega Charizard Y, and Tornadus-T.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 547532, "username": "Swiffix"}, {"user_id": 622813, "username": "Pengairxan"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 574288, "username": "Giyu"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 567354, "username": "sapphiree"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Charizard": {
    "sets": {
      "Dragon Dance (Fire)": {
        "description": "<p>Mega Charizard X is a ferocious wallbreaker and setup sweeper, aiding Fire teams in matchups like Dragon, Fire, and Electric. Tough Claws-boosted Flare Blitz fires off nuclear-powered attacks, heavily denting walls such as Mandibuzz, Gliscor, and Mega Sableye. Dragon Claw, also powered up by Tough Claws, threatens Garchomp, Rotom-W, and Kommo-o. Earthquake threatens switch-ins like Toxapex, Skeledirge, and Heatran, while Roost increases Mega Charizard X's longevity and mitigate recoil damage from Flare Blitz. Alternatively, Thunder Punch may be used to deal more damage to Slowbro, Pelipper, and Tapu Fini while still retaining super effective coverage against Toxapex. Volcarona is an exceptional teammate, as it threatens physical walls such as Slowbro, Toxapex, and Hippowdon after a Quiver Dance. Torkoal supports Mega Charizard X with sun to boost Flare Blitz's power and remove rain, Stealth Rock to wear down switch-ins, and Rapid Spin to remove entry hazards. Rotom-H sets up Reflect and Light Screen to ease Mega Charizard X's setup process and offers pivoting with Volt Switch. Choice Scarf Blacephalon is a great late-game cleaner and is appreciated to wear down troublesome walls like Skeledirge and Slowbro as well as cripple Toxapex and Porygon2 with Trick. Heatran traps and withers down Toxapex with Magma Storm and prevents Stealth Rock from being set up using Taunt. Cinderace provides entry hazard control with Court Change and brings Mega Charizard X in using U-turn.</p>"
      },
      "Sun Wallbreaker (Flying)": {
        "description": "<p>Mega Charizard Y makes for a great wallbreaker on Flying teams. Fire Blast, although it has lower accuracy, can be used over Flamethrower, notably 2HKOing Alolan Muk and Clodsire under sun. Solar Beam covers Water-types that resist Flamethrower like Swampert and Rotom-W, and thanks to sun, it does not need to charge. Focus Blast targets Dark- and Steel-types such as Hydreigon and Heatran. Alternatively, Scorching Sands can be used to target Heatran more reliably, as well as providing coverage against Toxapex and Iron Hands, the latter of which can be greatly hindered thanks to the burn chance. Hidden Power Electric can be run over Roost to greatly threaten Water teams in tandem with Solar Beam, threatening the likes of Pelipper, Mantine, and Gyarados. Dragonite and Mega Charizard Y form a great offensive pairing, with Mega Charizard Y threatening physically bulky threats like Mega Scizor and Corviknight for Dragonite, while Dragonite acts as a late-game sweeper and deals with Alolan Muk and Nihilego for Mega Charizard Y. Corviknight and Mantine are essential teammates, as they remove Stealth Rock with Defog, which would otherwise effectively leave Mega Charizard Y out of the match. Corviknight also brings Mega Charizard Y in with U-turn, while Mantine helps against rain teams, taking hits from Barraskewda and Mega Swampert. In turn, Mega Charizard Y takes out threats to them both like Rotom-W and Magnezone. It also appreciates entry hazard support from Landorus and Gliscor wearing down foes to help it wallbreak more easily, while both setters also provide an Electric immunity. In return, Mega Charizard Y handles Ice-types like Articuno and Mamoswine. Enamorus makes for a great partner because it handles Dark-types like Weavile and Greninja and provides Healing Wish support; it appreciates the removal of bulky Steel-types in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}, {"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 593863, "username": "CrossHeart"}, {"user_id": 637295, "username": "boomp"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}, {"user_id": 594478, "username": "ken"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Pidgeot": {
    "sets": {
      "Bird Jesus (Normal)": {
        "description": "<p>Mega Pidgeot is one of the premier special attackers Normal teams have access to because of its good Speed tier and a powerful, coveted STAB move in Hurricane that beats nuisances to Normal teams like Kommo-o and Ogerpon-W while never missing. Heat Wave complements Hurricane well by heavily damaging Steel-types like Jirachi, Ferrothorn, and Mega Scizor, which makes Mega Pidgeot very effective against Psychic, Grass, and Bug teams. Roost heightens Mega Pidgeot's longevity by taking advantage of defensive Pokemon that can't hit it very hard, such as Mega Sableye and Slowbro. In the last slot, Toxic's ability to cripple switch-ins like Iron Hands, Rotom-W, and Mantine is preferred, but U-turn is valuable to keep momentum and flee from checks such as Heatran and Alolan Muk. Ursaluna forms an incredible wallbreaking core with Mega Pidgeot; it is able to demolish special walls like Clodsire and Hisuian Goodra and can switch into Electric-type moves that target the bird. In return, Mega Pidgeot helps Ursaluna beat physical walls like Mega Venusaur and Skarmory, revenge kills Grass- and Fighting-types such as Ogerpon-W and Keldeo that threaten the bear, and is able to U-turn into Ursaluna so it activates its Flame Orb safely. Staraptor is a great defensive pivot that removes entry hazards for Mega Pidgeot and brings it into the field unscathed with U-turn. Similarly, Chansey, Blissey, and Porygon2 are very bulky partners that can switch into most attacks aimed at Mega Pidgeot and pivot into it via Teleport. Chansey and Blissey also lay down Stealth Rock to help Mega Pidgeot net more KOs, notably letting it OHKO Mega Venusaur and 2HKO Toxapex with Hurricane.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 321991, "username": "Mateeus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Raichu-Alola": {
    "sets": {
      "Surge Surfer (Electric)": {
        "description": "<p>Alolan Raichu surfs on Electric Terrain, blitzing past even the fastest Choice Scarf users in Greninja and Meowscarada and Swift Swim and Sand Rush users in Mega Swampert and Excadrill, which threaten to overwhelm Electric teams. Nasty Plot provides Alolan Raichu with the much-needed boost to OHKO Gliscor, Sinistcha, and Iron Hands with Shattered Psyche. Psyshock is preferred when using Life Orb, as it dispatches special walls like Clodsire and Galarian Slowking after minimal chip damage. Life Orb also lets Alolan Raichu OHKO Alolan Muk and Rotom-W with Rising Voltage at +2. Grass Knot and Focus Blast heavily damage Pokemon that scoff at its Electric- and Psychic-type moves like Mega Swampert, Iron Treads, and Hydreigon. However, it is to be noted that Alolan Raichu requires a Life Orb to have a shot at OHKOing Hydreigon. Normaum Z with Hyper Beam may be considered, as it pummels through targets Grass Knot covers on top of heavily damaging Mega Latias, which typically overwhelms Electric teams. Tapu Koko is a mandatory teammate for Alolan Raichu, as it sets Electric Terrain, deals with Dragon-types like Mega Altaria and Roaring Moon, and pressures Flying and Water teams extremely well due to its wide coverage. Physical attackers like Zeraora and Iron Hands help against special walls like Ting-Lu, Blissey, and Hisuian Goodra that Alolan Raichu struggles against. Ground-immune teammates like Zapdos and Rotom-W are appreciated, as they not only switch in against speedy threats like Sand Rush Excadrill and Choice Scarf Iron Treads when Electric Terrain ends but also deal with Grass- and Ground-types like Celebi and Great Tusk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542526, "username": "Neko"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 635656, "username": "Elvira"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 602431, "username": "CaptainDaimyo"}]}]}
  },
  "Nidoking": {
    "sets": {
      "Wallbreaker (Poison)": {
        "description": "<p>Nidoking finds a solid place on Poison teams as the premier special attacker thanks to Sheer Force and its solid movepool giving it a unique role of helping with the Steel matchup. Earth Power demolishes the Steel- and Poison-types that can easily come in on its teammates such as Heatran, Gholdengo, and Toxapex. Flamethrower deals with Steel-types not threatened by Earth Power such as Corviknight, Ferrothorn, and Scizor. Ice Beam removes problematic Ground- and Flying-types like Hippowdon, Gliscor, and Zapdos. Stealth Rock can help chip foes that can swap into Earth Power like Mega Charizard Y. Alternatively, Thunderbolt can be run to complete the BoltBeam coverage and hit Water-types like Pelipper, Dondozo, and Mantine, which otherwise wall Nidoking. Choice Scarf Sneasler forms a solid offensive core with Nidoking. Sneasler not only removes specially defensive targets like Hisuian Goodra and Blissey, but also removes faster targets like Mega Charizard Y and Volcarona if running Rock Slide, while Nidoking deals with threats that would stop Sneasler like Gholdengo and Toxapex. Mega Venusaur handles the Water- and Ground-type foes that would overwhelm Nidoking such as Barraskewda, Mega Gyarados, Swampert, and Mamoswine. Alolan Muk deals with Ghost- and Psychic-types such as Hisuian Zoroark, Alolan Raichu, and Tapu Lele, which pose a significant issue for Nidoking. Galarian Slowking can take on threats such as Choice Specs Latios and Tornadus-T and use Future Sight to help overwhelm special walls like Swampert. Crobat is immune to Ground-type moves from Pokemon like Great Tusk, can use Defog to remove entry hazards to provide safe entry for Nidoking, and can deal with threats like Mega Gallade</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 622813, "username": "Pengairxan"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Clefable": {"sets": {"Calm Mind": {"description": "<p>60 Spe EVs lets Clefable outspeed Corviknight.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Ninetales-Alola": {
    "sets": {
      "Aurora Veil (Ice)": {
        "description": "<p>With access to Snow Warning and Aurora Veil, a great typing, and a key Speed tier that lets it deal with the likes of Keldeo and Urshifu-R, Alolan Ninetales proves to be extremely useful for Ice teams. Freeze-Dry makes it a menace in the Water matchup, dealing heavy damage to Swampert, Gastrodon, and Pelipper. Encore enables Alolan Ninetales to disrupt walls and slower setup sweepers like Ting-Lu and Tapu Fini. Alolan Ninetales's teammates appreciate its supportive capabilities; setup sweepers like Swords Dance Weavile and Dragon Dance Baxcalibur have a lot more setup opportunities, and offensive Pokemon like Galarian Darmanitan have an easier time switching in. Cloyster is a stellar partner; its defensive set removes entry hazards with Rapid Spin and sets Spikes to wear down Keldeo and Toxapex for Alolan Ninetales, while Shell Smash variants can more easily set up with its assistance. SubRoost Kyurem helps Alolan Ninetales pressure Water teams with its own Freeze-Dry and checks Fighting-types like Galarian Zapdos with a Chople Berry. Piloswine lays down Stealth Rock and switches into and checks a variety of Fire-types that Alolan Ninetales hates, such as Volcarona and Iron Moth.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 321991, "username": "Mateeus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Arcanine-Hisui": {"sets": {"Choiced Attacker (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Alakazam": {"sets": {"Focus Sash": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Slowbro": {"sets": {"Defensive (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Muk-Alola": {
    "sets": {
      "Assault Vest (Poison)": {
        "description": "<p>Assault Vest Alolan Muk finds a pivotal role on Poison teams, with its high special bulk and secondary Dark typing providing a much-needed immunity to Psychic-type attacks. Knock Off provides a strong STAB option with immense utility by removing held items. Poison Jab is Alolan Muk's most consistent STAB move, being able to reliably spread poison and make progress thanks to Poison Touch. Pursuit is used to trap Choice-locked threats like Hisuian Zoroark, Greninja, and Tapu Lele for solid damage. For Alolan Muk's final moveslot, Drain Punch provides some much-needed recovery and hits Steel- and Dark-type threats like Heatran and Hydreigon for solid damage. Alternatively, Shadow Sneak can allow Alolan Muk to pick off weakened threats, while Rock Slide checks Volcarona and Mega Charizard Y. The EV spread maximizes Alolan Muk's special bulk, with the 12 Defense EVs allowing it to survive an unboosted Victini's V-create after Stealth Rock. Crobat complements Alolan Muk thanks to its secondary Flying typing, which can support Alolan Muk against threats like Great Tusk, Clodsire, and Mega Gallade. Mega Venusuar helps Alolan Muk by dealing with Water- and Ground-type threats including Barraskewda, Mega Swampert, and Mamoswine. Galarian Slowking pairs with Alolan Muk to create a specially defensive core by handling threats such Choice Specs Latios, Tornadus-T, and Kyurem. Toxapex handles powerful physical threats like Kleavor, Mega Lopunny, and Weavile and has Z-Haze for special attackers that can overwhelm Alolan Muk like Kommo-o. Choice Scarf Sneasler can remove threats to Alolan Muk such as Excadrill, Hisuian Arcanine, and non-Choice Scarf Iron Boulder with its powerful Close Combat. Nidoking can remove walls that can sit on Alolan Muk, including Toxapex, Ferrothorn, and Corviknight, thanks to its strong coverage moves.</p>"
      },
      "Specially Defensive (Dark)": {
        "description": "<p>Alolan Muk is an amazing defensive part of any Dark team, with its Poison typing and an amazing Special Defense stat providing Dark a comfortable switch-in to the likes of special Iron Valiant, Enamorus, Volcarona, and Tapu Lele. Poison Touch gives Alolan Muk the ability to poison common switch-ins such as Great Tusk, Rotom-W, and Zapdos. Poison Jab provides an accurate and solid way to deal damage to Fairy-types such as Tapu Lele and Tapu Koko. Knock Off makes progress against item-reliant Pokemon such as Porygon2 and Celesteela. Pursuit grants Alolan Muk the ability to trap Pokemon like Alolan Raichu, Gholdengo, and Galarian Slowking that attempt to switch out against it. Alternatively, Drain Punch gives Alolan Muk both another form of recovery and a tool to deal with Steel-types like Hisuian Goodra, Heatran, and Hydreigon. Finally, Protect can allow Alolan Muk to scout Choice-locked threats such as Meowscarada and Enamorus and take advantage of Black Sludge recovery. Investing 20 EVs in Attack helps Alolan Muk always break Kyurem's Substitute with Poison Jab. Mandibuzz is a great partner to complement Alolan Muk, as its immunity to Ground makes it easier to switch into threats such as Excadrill, Garchomp, and Great Tusk. and it has access to Defog to remove entry hazards that would whittle down Alolan Muk, allowing it to make the most out of Black Sludge. Furthermore, Mandibuzz checks physical setup sweepers like Scizor and Mega Gallade by using Foul Play. With its Ghost typing and Will-O-Wisp, Mega Sableye can handle threatening Fighting-types such as Sneasler, Iron Hands, and Mega Gallade. Mega Sableye is also excellent to pair with Alolan Muk, as it grants Dark a bulky Magic Bounce user. Meowscarada helps threaten out several Water- and Ground-type threats that threaten Alolan Muk like Choice Band Urshifu-R, Mega Swampert, and Great Tusk with its powerful Flower Trick. Both Hydreigon and Weavile appreciate having Alolan Muk on the team. as it can effectively Pursuit trap Tapu Lele. Alolan Muk complements Ting-Lu's hazard-stacking capabilities by spreading poison to wear down foes or removing Heavy-Duty Boots. Hydreigon is a wallbreaker that checks defensive Pokemon that Alolan Muk struggles to break like Hippowdon, opposing Alolan Muk, and Toxapex. Weavile checks Ground-, Dragon-, and Flying-types such as Garchomp, Mega Altaria, and Landorus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 635656, "username": "Elvira"}, {"user_id": 622813, "username": "Pengairxan"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 481576, "username": "roxie"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 612907, "username": "veti"}, {"user_id": 470115, "username": "SolarBeam"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Cloyster": {"sets": {"Physically Defensive (Ice)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Shell Smash Sweeper (Ice)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Gengar": {"sets": {"Choiced Attacker (Ghost)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Pinsir": {
    "sets": {
      "Swords Dance (Bug)": {
        "description": "<p>Mega Pinsir is a great late-game sweeper and one of Bug's best answers to Fighting-types thanks to its typing and Aerilate ability. Swords Dance boosts its power even further, overpowering foes such as Toxapex and Celesteela. Return is its main Flying-type STAB move, hitting Grass-, Bug-, and Fighting-types such as Mega Venusaur, Volcarona, and Kommo-o,. Using Frustration with 0 happiness is also an option, as it prevents Ditto from doing too much damage after copying Mega Pinsir. Quick Attack allows Mega Pinsir to revenge kill fast threats such as Iron Valiant, Ogerpon-H, and +1 Kommo-o. Close Combat nails Steel- and Rock-types such as Heatran, Ferrothorn, and Tyranitar, but Earthquake is also viable to hit Gholdengo and Aegislash, as well as Fire-types such as Torkoal and Volcanion. Mega Pinsir's secondary Flying typing makes it 4x weak to Stealth Rock, so it appreciates entry hazard removal from Rapid Spin users such as Forretress and Armaldo. Forretress also provides great defensive utility, taking physical Flying- and Rock-type moves with ease while having Volt Switch to pivot Mega Pinsir onto the field safely. Mega Pinsir appreciates entry hazards on the opposing side as well, such as Stealth Rock from Kleavor, Spikes and Toxic Spikes from Forretress, and Sticky Web from Araquanid and Galvantula. Furthermore, Kleavor can deal with Flying- and Fire-types such as Zapdos and Moltres, and Araquanid can deal with Fire-types as well as take on strong special attacks from the likes of Tapu Lele and Gholdengo, dealing damage back with Mirror Coat. Araquanid's access to Magic Coat allows it to deflect status and hazards as well. Scizor can check Ice- and Rock-types such as Baxcalibur and Ogerpon-C with its STAB Bullet Punch, as well as pivot with U-turn and remove Stealth Rock with Defog. Choice Scarf Buzzwole is a great partner and revenge killer, being able to wipe out the remaining foes if Mega Pinsir is knocked out. Volcarona appreciates Mega Pinsir's ability to deal with Kommo-o and Mega Venusaur, and in return, it acts as a special sweeper that can deal with physical walls such as Skarmory. Lokix is a great revenge killer thanks to its strong First Impression putting foes into range of Mega Pinsir's Quick Attack. Its access to Throat Chop and Knock Off also deals with Ghost-types, and the former prevents Skeledirge from using Torch Song, which would otherwise be a pain to deal with, while the latter removes items. Equipping Lokix with a Z-Crystal, such as Buginium Z or Darkinium Z, can deal massive damage to foes that would otherwise be difficult to break through.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 566051, "username": "lavarina"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ditto": {
    "sets": {
      "Scarf Imposter": {
        "description": "<p>Ditto solidifies itself to once again be the goo that holds balanced and offensive Normal teams together thanks to its incredibly strong ability in Imposter. Reversing the momentum of fast offensive threats such as Iron Valiant, Mega Charizard X, and Excadrill allows Ditto to force counterplay against offensive teams. Ditto can also take advantage of entry hazard setters and removers, such as Ferrothorn, Kleavor, and Zapdos, using their own longevity or utility against them. In order to take advantage of Pokémon that use either Return or Frustration, such as Mega Altaria or Mega Pinsir, Ditto likes to run 128 Happiness instead of 255 or 0. Walls like Blissey and Porygon2 appreciate Ditto being able to prevent threats such as Baxcalibur and Spectrier from using them as setup fodder, while Ditto appreciates both defensive switch-ins and slow pivots via their use of Teleport. Mega Lopunny is a staple on Normal teams that accents Ditto's role expertly; many of the offensive threats and setup sweepers that revenge kill Mega Lopunny, such as Mega Charizard X, Kommo-o, and Galarian Moltres, are usually very weak to their own sets or coverage. Mega Lopunny can lure a threat in and pivot with U-turn, allowing Ditto to come in safely and transform. Ditto appreciates Mega Lopunny's Speed tier and fast pivot with U-turn, as well as potentially setting up Ditto with Encore Sets to stop foes from using Substitute or setting up completely. Hisuian Zoroark makes for another stellar teammate for Ditto, as Hisuian Zoroark disguised as a passive Pokemon, such as Blissey, or another offensive threat, such as Diggersby or Mega Lopunny, can lead to Hisuian Zoroark wallbreaking and netting KOs on vital foes, making it easier for Ditto to sweep once it has transformed. While Ditto is immune to Sticky Web, it is susceptible to other hazards such as Stealth Rock and Toxic Spikes, so forms of hazard control such as Staraptor or Cyclizar are appreciated. Staraptor is another defensive option, while Cyclizar can enable Ditto to utilize Transform with a Substitute from Shed Tail. Smeargle on more offense-oriented teams' pairs well with Ditto, as Smeargle can set hazards with Stone Axe or Ceaseless Edge and spread status with Nuzzle, Mortal Spin, or Spore, allowing Ditto to exploit the opposing team easier. Smeargle will usually give up Sticky Web when paired with Ditto so as to not hinder Ditto's revenge killing prowess.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475589, "username": "Illecent Excaliburn"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 574288, "username": "Giyu"}, {"user_id": 547532, "username": "Swiffix"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Omastar": {"sets": {"Shell Smash (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Aerodactyl": {
    "sets": {
      "Offensive Utility (Flying)": {
        "description": "<p>By virtue of its great coverage as well as its sky-high Attack and Speed, Mega Aerodactyl finds a great spot on Flying teams as a late-game cleaner. Earthquake pairs well with Stone Edge, threatening the likes of Heatran and Hisuian Goodra and OHKOing Tapu Koko after Stealth Rock damage. Ice Fang is a great coverage option against Ground- and Dragon-types such as Landorus and Garchomp. Dual Wingbeat breaks through Fighting- and Grass-types such as Kommo-o, Mega Gallade, and Ogerpon-W. Pursuit allows Mega Aerodactyl to take advantage of foes like Victini and Latias that are forced out due to being Choice-locked into an undesirable move, and it punishes Gholdengo if it switches out expecting Earthquake. Stealth Rock aids both Mega Aerodactyl and its teammates in their wallbreaking or sweeping, while Taunt shuts down passive Pokemon such as Toxapex and Clodsire. Mantine and Corviknight are essential teammates, as they remove Stealth Rock with Defog so that Mega Aerodactyl finds more opportunities to switch in; they also provide a defensive backbone to shield Mega Aerodactyl from Water- and Ice-types like Mega Swampert and Choice Scarf Weavile. In return, Mega Aerodactyl deals with Fire- and Electric-types that the two of them hate like Volcarona, Zapdos, and Zeraora. Moltres is helpful in dealing with Mega Scizor and Ferrothorn. Landorus and Gliscor both set up entry hazards to aid Mega Aerodactyl in its cleaning when it's not running Stealth Rock; the two of them also act as stallbreakers, provide an Electric immunity, and bust through Toxapex. Despite its great Speed tier, Mega Aerodactyl is outsped by Kommo-o and Hisuian Lilligant at +1 and by Choice Scarf users such as Nihilego, making Choice Scarf Enamorus a great teammate that is able to revenge kill these threats. Special wallbreakers like Zapdos, Tornadus-T, and Thundurus-T deal with physically defensive walls like Celesteela, Slowbro, and Ferrothorn, which would otherwise wall Mega Aerodactyl; they can also pivot Mega Aerodactyl in against specially defensive walls like Galarian Slowking and Hisuian Goodra.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 532439, "username": "Bka Onon"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Zapdos": {
    "sets": {
      "Choice Specs (Electric)": {
        "description": "<p>With Choice Specs equipped, Zapdos's already amazing Special Attack is boosted to even greater heights, turning it into an incredible wallbreaker. Its Flying typing also grants an invaluable Ground immunity for Electric teams. Hurricane is Zapdos's most powerful move, threatening a variety of Pokemon that resist or are immune to Electric such as Mega Venusaur and Gastrodon. Heat Wave beats Steel-types such as Mega Scizor, Iron Treads, and Ferrothorn, thus making it an incredible asset in the Steel and Grass matchups. Hidden Power Ice cleanly OHKOes Gliscor, Landorus-T, and Garchomp; alternatively, Hidden Power Grass can be used if reliably eliminating Gastrodon and Swampert is more important. Volt Switch lets Zapdos switch out of its checks like Tyranitar and Blissey, keeping momentum in favor of Zapdos's team. As dangerous as Zapdos is, it is highly susceptible to Stealth Rock; hence, Rotom-W is a great partner that can use Defog while also helping Zapdos beat Ground-types thanks to Hydro Pump. Iron Hands and Zeraora help Zapdos wallbreak by wearing down special walls like Heatran, Blissey, and Clodsire. Regieleki and Alolan Raichu can take advantage of Zapdos weakening teams and removing Ground-types so that they can clean up with their deadly Rising Voltage later in the game.</p>"
      },
      "Physically Defensive Pivot (Electric)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 532439, "username": "Bka Onon"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Zapdos-Galar": {
    "sets": {
      "Choice Scarf (Fighting)": {
        "description": "<p>Galarian Zapdos is an excellent Choice Scarf user on Fighting teams thanks to its unique set of traits within the type. Steel Wing notably OHKOes a huge threat to these teams in Mega Diancie while also nailing Tapu Lele and Alolan Ninetales. Knock Off targets Psychic- and Ghost-types like Galarian Slowking, Jirachi, and Galarian Corsola. Finally, U-turn can bring in teammates while getting chip damage on the foe as well as switching Galarian Zapdos out of bad matchups like Slowbro and Gholdengo. Iron Valiant equipped with Choice Specs or a Z-Crystal is able to break through Pokemon that wall Galarian Zapdos such as Kyurem, Latias, Raging Bolt, and Tapu Koko. Mega Gallade is another great teammate for Galarian Zapdos, as it acts as a great setup sweeper and wallbreaker with Swords Dance and greatly improves the Poison matchup. Iron Hands also pairs well, as it has a neutrality to Flying and can hit Flying-types with Ice Punch or Thunder Punch and has access to a slow Volt Switch that can bring it in safely. Iron Hands's great bulk also allows it to take on otherwise problematic threats like Enamorus-T, Tornadus-T, and Pelipper. Great Tusk is a nice support Pokemon for Galarian Zapdos, as it provides an Electric-immunity as well as Rapid Spin and Stealth Rock support, helping Galarian Zapdos get more KOs. It's also a great physical wall and can take out threats such as Iron Hands and Zeraora. In return, Galarian Zapdos handles Grass-types like Ogerpon-W, Tapu Bulu, and Mega Venusaur for it. Finally, Hisuian Lilligant can be a good team member for Galarian Zapdos, as it provides sleep support, taking counters to Galarian Zapdos out of the picture and easing the Water and Ground matchups. Hisuian Lilligant and Galarian Zapdos also make a great late-game cleaning duo.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 637816, "username": "TheKingsLeap"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Moltres-Galar": {
    "sets": {
      "Double Dance (Dark)": {
        "description": "<p>With access to both Nasty Plot and Agility as well as a Special Attack-boosting ability in Berserk, Galarian Moltres is a great late-game sweeper for Dark teams. In addition, its part-Flying typing provides Dark teams with a great offensive option against Fighting and Bug teams, as well as a greatly appreciated neutrality to the aforementioned types. After one Nasty Plot boost, Galarian Moltres 2HKOes physically defensive Toxapex, physically defensive Ting-Lu, and Celesteela. After one Agility boost, it is able to outspeed would-be faster Pokemon such as Choice Scarf Iron Valiant, Regieleki, and +1 Volcarona, as well as Mega Swampert in rain. With Flyinium Z , a Nasty Plot-boosted Supersonic Skystrike OHKOes Mega Diancie, Tapu Koko, and specially defensive Toxapex. An unboosted Supersonic Skystrike is still able to OHKO Terrakion after Stealth Rock damage. Hisuian Samurott provides entry hazard support in order to wear down incoming foes into OHKO range for Galarian Moltres, and in return, Galarian Moltres can threaten the Grass- and Fighting-types the two of them struggle with such as Mega Venusaur and Urshifu-R. Grimmsnarl is another great teammate, as it is able to set up dual screens to further make Galarian Moltres difficult to KO, and it can also run Taunt to prevent Stealth Rock from being set. Because of Galarian Moltres's part-Flying-typing, it is vulnerable to Stealth Rock. Because of this vulnerability, it appreciates hazard control from Mega Sableye's Magic Bounce, and Mega Sableye is also able to cripple opposing foes with Will-O-Wisp and Knock Off. Choice Band users such as Weavile, Roaring Moon, and Meowscarada can check walls Galarian Moltres struggles with like Dondozo and Clodsire. In return, Meowscarada and Weavile appreciate Galarian Moltres matching up well against Volcarona and Roaring Moon appreciates Galarian Moltres matching up well against Great Tusk. Lastly, Galarian Moltres can be paired with other sweepers such as Swords Dance Weavile and Dragon Dance Roaring Moon to soften each other's checks to enable each other to sweep. For example, Weavile is able to threaten Ting-Lu and Clodsire, while Galarian Moltres is able to handle Choice Scarf Gholdengo in return. When Galarian Moltres is not able to complete an outright sweep, it can set up for Choice Scarf users such as Meowscarada and Greninja to clean up.</p>"
      },
      "Nasty Plot (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Dragonite": {
    "sets": {
      "Dragon Dance (Flying)": {
        "description": "<p>Dragonite makes for a great wallbreaker and late-game cleaner on Flying teams, outspeeding threats such as Zeraora and Mega Diancie after a Dragon Dance boost. Earthquake threatens Steel-, Poison-, and Rock-types like Gholdengo, Alolan Muk, and non-Choice Band Hisuian Arcanine. Roost grants Dragonite longevity as well as potentially reactivating Multiscale if its HP is restored to full. Substitute allows it to take advantage of passive Pokemon such as Toxapex, Will-O-Wisp Rotom-W, and Clodsire to set up Dragon Dance, but Roost is preferred since it grants Dragonite more opportunities to sweep. Heavy-Duty Boots is preferred so that Dragonite doesn't need to rely on entry hazard removal to switch in, while Leftovers grants it a form of longevity when it chooses to forego Roost. Mega Charizard Y is Dragonite's most important teammate, forming a great offensive pairing, with it threatening Ice-, Steel-, and Water-types such as Articuno, Alolan Ninetales, Corviknight, and Swampert, while Dragonite handles Galarian Slowking and Mega Charizard X. Corviknight and Celesteela deal with Fairy-, Ice-, and Rock-types such as Tapu Lele, Weavile, and Ogerpon-C; Corviknight also acts as a slow pivot to bring Dragonite in on Gholdengo. Choice Scarf Enamorus provides great speed control, outspeeding and threatening the likes of Mega Altaria and Iron Valiant while also dealing with Dark-types such as Mandibuzz and Mega Sableye. Additionally, Dragonite appreciates Healing Wish from Enamorus, as it can give Dragonite another opportunity to sweep. Thanks to Dragonite acting as a wallbreaker, it can enable fellow sweepers such as Mega Aerodactyl and Galarian Moltres. Mega Aerodactyl deals with Mega Lopunny and Articuno, while Galarian Moltres handles Tapu Bulu and Pecharunt.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Crobat": {
    "sets": {
      "Utility (Poison)": {
        "description": "<p>Crobat finds a solid role on Poison teams thanks to its Ground immunity, high Speed, and solid utility movepool. Brave Bird deals with threats such as Iron Valiant, Mega Gallade, and Ogerpon-W. Infiltrator + Toxic is used to spread status against targets such as Substitute Hydreigon and Kyurem, while U-turn can be used to retain momentum against foes like Gholdengo. Defog provides longevity to teammates including Mega Venusaur and Alolan Muk by removing entry hazards so they can get the most out of their bulk. The EV spread allows Crobat to outspeed threats like Tornadus-T, Meowscarada, and Sneasler while still providing reasonable bulk, allowing it to take hits such as Freeze-Dry from Substitute Kyurem and +2 Dark Pulse from Hydreigon. Crobat greatly appreciates bulky teammates such as Toxapex and Mega Venusaur that can take Knock Off from the likes of Alolan Muk, Hisuian Goodra, and Ferrothorn, preventing it from losing its Heavy-Duty Boots. Mega Venusaur also complements Crobat by handling Ground-types such as Mega Swampert, Mamoswine, and Great Tusk. Alolan Muk provides a complementary Psychic immunity and can handle Psychic- and Ghost-type threats like Tapu Lele, Galarian Slowking, Blacephalon, and Gholdengo thanks to Knock Off and Pursuit. Nidoking can handle Electric-, Rock-, and Steel-type threats including Tapu Koko, Nihilego, Heatran, and Ferrothorn that can otherwise wall Crobat. Sneasler can similarly threaten Steel- and Rock-types threats like Hisuian Goodra, Tyranitar, and Ogerpon-C thanks to Close Combat, and it appreciates Crobat's ability to switch into bulky Ground-types like Clodsire and Hippowdon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 622813, "username": "Pengairxan"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Azumarill": {
    "sets": {
      "Z-Belly Drum (Fairy)": {
        "description": "<p>Azumarill's presence is greatly appreciated on Fairy teams, where it tends to be the Z-Crystal user of choice and a good answer to the Fire, Ground, Rock, Poison and Steel matchups. Z-Belly Drum guarantees a +6 boost to Azumarill's already impressive Attack, turning it into a redoubtable setup sweeper with access to priority, and it can even offer a second setup opportunity if Azumarill gets forced out with its Z-Move unused. Aqua Jet is Azumarill's answer to threats that outspeed it, such as Volcarona, Tapu Koko, and Nidoking. Aside from dealing with Ghost- and Psychic-types such as Slowbro, and Sinistcha, Knock Off is Azumarill's best coverage option against walls that resist its other attacks, such as Ferrothorn, Toxapex and Water Absorb Clodsire. Breakneck Blitz coming off Return beats Mega Venusaur as well as Icium Z Toxapex, which doesn't fear Knock Off. Alternatively, Liquidation could be used as a stronger STAB option for slower foes like Iron Hands, Ting-Lu, and Celesteela, which is important if a Jolly nature is used. Ice Spinner is an alternative that can be used to defeat both Ting-Lu and Mega Venusaur after some chip, along with getting rid of Psychic Terrain to allow for Aqua Jet to be used without being blocked. Klefki is an amazing partner for Azumarill, offering a Poison immunity and dual screens support to ease setup and spreading Spikes to chip the opposing team. Mega Diancie helps in the Fire and Flying matchups and provides entry hazard control, contributing to keeping Azumarill healthy as well as providing Stealth Rock to help its wallbreaking. Tapu Koko deals with Water-types such as Pelipper and Toxapex, making Azumarill's sweep easier down the line, and it also handles Steel- and Flying-types like Celesteela and Corviknight should Azumarill opt for Return. Tapu Bulu also aids in the Water and Electric matchup, handling foes like Quagsire and Rotom-W that Azumarill can struggle to bring down. Iron Valiant deals with most Fighting-types and, when paired with Tapu Koko, outspeeds and defeats faster foes such as Mega Lopunny and Mega Swampert under rain, but it competes with Azumarill for a Z-Crystal. Tapu Lele handles Poison-types like Mega Venusaur and Clodsire, but be cautious of Psychic Terrain preventing Azumarill from using Aqua Jet. Babiri Berry Clefable can be used as an alternative to Tapu Lele for checking Scizor, and it also handles Mega Venusaur well, as it can use it as setup fodder.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 547532, "username": "Swiffix"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 574288, "username": "Giyu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Slowking": {"sets": {"Specially Defensive (Water)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Slowking-Galar": {
    "sets": {
      "Assault Vest (Poison)": {
        "description": "<p>Assault Vest Galarian Slowking acts as Poison teams' specially defensive Regenerator wall,easily taking on threats like Choice Specs Latios and Zapdos. Future Sight is used to deal solid damage and create traps that physically attacking teammates such as Sneasler and Okidogi can make use of to break walls such as Blissey and Mega Venusaur, which would otherwise only take Future Sight or the physical hit. Ice Beam hits Flying-types like Enamorus, Zapdos, Landorus, and Thundurus-T. Flamethrower can be run over Sludge Bomb or Ice Beam and can threaten Steel-types like Ferrothorn and Celesteela. Finally, Earthquake beats Heatran, which can be problematic for Poison teams, but should only be used if Galarian Slowking is already running Flamethrower. The given EV spread lets it survive Choice Specs Psyshock from Tapu Lele after Stealth Rock damage. Sneasler and Okidogi pair excellently with Galarian Slowking, using their Fighting-type STAB moves to threaten Dark-types like Hydreigon and Ting-Lu along with specially defensive targets such as Hisuian Goodra and Blissey. They also majorly appreciate Galarian Slowking's Future Sight helping form a devastating combination that can break past physical walls like Mega Venusaur and Great Tusk with ease. Sneasler also appreciates Galarian Slowking as a safe target to pivot into with U-turn against special attackers like Thundurus-T. Alolan Muk complements Galarian Slowking by threatening Ghost-types such as Blacephalon and Gholdengo along with serving as a safe switch-in against Psychic-types like Tapu Lele, which can otherwise break past Galarian Slowking with Psyshock. Crobat provides a solid Ground Immunity and entry hazard removal in Defog, and it also helps deal with foes like Ogerpon-W and Mega Gallade that threaten Galarian Slowking. Mega Venusaur helps by removing problematic Ground- and Water-types like Mamoswine and Dondozo.</p>"
      },
      "Specially Defensive (Psychic)": {
        "description": "<p>Galarian Slowking finds a niche on Psychic teams thanks to its incredible solid Special Defense and strong support moves such as Toxic Spikes. Sludge Bomb can spread Poison along with dealing with Fairy-type threats like Primarina and Enamorus. Ice Beam deals with Flying- and Dragon-type threats such as Zapdos, Tornadus-T, Latios, and Raging Bolt. Chilly Reception allows Galarian Slowking to safely pivot into its teammates. Finally, Thunder Wave slows down faster targets such as Volcarona and Greninja, allowing a teammate to comfortably remove them. Heavy-Duty Boots allows Galarian Slowking to safely come in; however, Black Sludge can be used to gain passive recovery.</p> <p>Slowbro is a solid partner for Galarian Slowking, providing a Regenerator core for Psychic teams, with Slowbro being able to take on physical threats like Great Tusk, Barraskewda, and Cinderace, which threaten Galarian Slowking, while Galarian Slowking handles foes such as Primarina and Zapdos. Latios and Iron Boulder appreciate Galarian Slowking's Chilly Reception to safely pivot them in against threats like Kyurem and Iron Moth. Meanwhile, Galarian Slowking appreciates Latios removing threats such as Landorus, Gouging Fire, and Overqwil, along with Choice Scarf Iron Boulder emoving threats like Flutter Mane, Volcarona, and Tyranitar. Hoopa-U is appreciated for its ability to handle Ghost-type threats like Gholdengo, Spectrier, and Hisuian Zoroark and can use Knock Off to remove Heavy-Duty Boots from foes like Blissey to make Galarian Slowking's Toxic Spikes more potent. Galarian Slowking appreciates Hatterene's ability to block entry hazards along with its ability to take on Dark-type threats such as Hydreigon and Hisuian Samurott.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 622813, "username": "Pengairxan"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}, {"user_id": 510532, "username": "sasha"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Forretress": {"sets": {"Entry Hazard Support (Bug)": {"description": "<p>Counter lets Forretress deal with physical threats like Gouging Fire and Mega Aerodactyl which otherwise decimates Bug teams.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Steelix": {"sets": {"Curse (Ground)": {"description": "<p>An Impish nature lets Mega Steelix survive Azumarill's Aqua Jet after it has used Belly Drum.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Scizor": {
    "sets": {
      "Offensive Swords Dance (Steel)": {
        "description": "<p>Mega Scizor makes for a strong wallbreaker and sweeper on Steel teams thanks to its access to Swords Dance, high Attack stat, and well-rounded bulk. Bullet Punch is Mega Scizor's strongest STAB move, and its priority allows it to revenge kill faster threats such as Mega Diancie, Iron Valiant, and Mega Lopunny. Close Combat is Mega Scizor's strongest coverage move, enabling it to more easily beat Corviknight, Ting-Lu, and Heatran. After a Swords Dance boost, Mega Scizor becomes strong enough to 2HKO Celesteela, opposing Mega Scizor, and physically defensive Gastrodon. Knock Off removes essential items such as Heavy-Duty Boots from Tornadus-T and Black Sludge from Toxapex, and it also provides Mega Scizor with strong coverage against Aegislash, Skeledirge, and Gholdengo. Alternatively, Trailblaze can also be used to 2HKO bulky Water- or Ground-type Pokemon most other Steel-types struggle with such as Mega Swampert and Gastrodon, as well as potentially OHKO Azumarill and Rotom-W after a Swords Dance boost and Stealth Rock damage. 132 Speed EVs are invested in order for Mega Scizor to outspeed Jolly Azumarill as well as Hydreigon and Urshifu-S after a Trailblaze. Heatran and Ferrothorn are great teammates because they are able to set entry hazards to wear down incoming foes, and Heatran also has the added benefit of providing a Fire immunity thanks to its ability. Ferrothorn can also provide passive healing for Mega Scizor via the use of Leech Seed. In return, Mega Scizor is able to threaten faster Fighting-types such as Sneasler and Iron Valiant with Bullet Punch. Gholdengo is able to threaten Toxapex and Tapu Lele, and it along with Aegislash can also hinder foes with Toxic and Thunder Wave respectively if they are running defensive sets, easing set up for Mega Scizor. In return, Mega Scizor can remove Dark-types such as Meowscarada, Ting-Lu, and Galarian Moltres. Specially defensive Celesteela is an excellent special wall that can wall Choice Specs Tapu Lele and Mega Altaria, while also being able to spread status and use Leech Seed to aid Mega Scizor in its sweeping. As Mega Scizor is more vulnerable to hazards compared to other Steel-types, it appreciates hazard removal from the likes of Corviknight, Excadrill, and Iron Treads. Excadrill and Iron Treads also have the added merit of handling Fire-types like Victini and Ogerpon-H. Excadrill can also bypass Mega Sableye's Magic Bounce and inflict poison on it thanks to Mold Breaker, while Iron Treads can threaten both Landorus formes with Ice Spinner.</p>"
      },
      "Bulky Swords Dance (Steel)": {
        "description": "<p>Mega Scizor's neutrality to Ground and Fighting and role compression as a wall and sweeper make it a formidable asset for Steel teams. Knock Off hinders predicted checks that Mega Scizor lures in on the switch such as Celesteela, Porygon2, Skeledirge, and Rotom-W, notably removing Heavy-Duty Boots to enable entry hazards that are characteristic of Steel teams. The first EV spread with an Adamant nature maximizes damage output, notably OHKOing Hisuian Lilligant, Meowscarada, and Kyurem with +2 Bullet Punch; it also outspeeds Adamant Azumarill and has the rest invested in HP to optimize mixed bulk. The second EV spread with an Impish nature also outspeeds Adamant Azumarill and avoids a 2HKO after Stealth Rock from Mega Lopunny's Close Combat and Adamant Mega Swampert's Earthquake, yet requires a layer of Spikes to OHKO Hisuian Lilligant and Meowscarada with +2 Bullet Punch. Mega Scizor is extremely vulnerable to Fire-type moves, so Heatran is a solid partner to mitigate this weakness. As Mega Scizor can often have a difficult time sweeping because Bullet Punch is easy to resist, Excadrill and Iron Treads make an offensive core with Mega Scizor, as they can pressure the Fire-, Electric- and Steel-types that would check it; notably, the former can additionally handle Rotom-W and the latter offensively checks Landorus. Ferrothorn and Hisuian Goodra are also options to further complement and handle Water-types for it. Gholdengo can wear down the opposing team as it stallbreaks past foes such as Toxapex, Mega Sableye, and Hisuian Goodra, easing Mega Scizor's sweep late-game; it also acts as an additional check for Fighting-types Mega Scizor can't consistently switch into such as Iron Valiant. Corviknight can remove entry hazards, increasing the longevity of Mega Scizor and the rest of its team, as well as pivot to it with U-turn to ease switching. Skarmory is also an alternative that can set Spikes, letting Mega Scizor reach OHKOes that it wouldn't otherwise.</p>"
      },
      "Choice Band (Bug)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}, {"user_id": 623713, "username": "Don Bork"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Quality checked by", "members": [{"user_id": 532439, "username": "Bka Onon"}, {"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Shuckle": {
    "sets": {
      "Sticky Web (Rock)": {
        "description": "<p>Shuckle is an essential member of any hyper offensive Rock team due to its access to Sticky Web, which allows teammates such as Mega Diancie and Terrakion to dominate the Steel and Dark matchups. With Mental Herb, it isn't scared to set up entry hazards in front of common Taunt users such as Deoxys-S and Zeraora. Encore shuts down setup sweepers such as Mega Scizor and bulky walls such as Hippowdon and Ferrothorn, locking them into their setup and recovery moves. Shuckle can generate momentum after setting up hazards by using Final Gambit, allowing teammates such as Shell Smash Omastar, Mega Diancie, and Choice Band Tyranitar to come in and start exerting pressure. Toxic can also be used to punish more passive Pokemon such as Gastrodon and Hippowdon. Mega Diancie can bounce back any hazards or status moves directed at Shuckle and provides amazing offensive pressure and coverage against Poison-, Steel-, and Dragon-types. Sticky Web allows Choice Band Tyranitar to outspeed Choice Specs Gholdengo and Nidoking, both of which are threats to Rock. Omastar and Minior benefit from Stealth Rock breaking potential Focus Sashes and are great partners to have in the Grass and Fighting matchups. Thanks to Sticky Web, Omastar outspeeds Sand Rush Excadrill after one shell smash and +1 Spe Nihilego outspeeds Barraskewda in the rain. Power Herb Nihilego is able to sweep teams as well with Meteor Beam and amazing coverage. Thanks to Sticky Web, Choice Scarf Terrakion outspeeds Choice Scarf Meowscarada and Greninja, which are threats to Rock teams. Hisuian Arcanine is able to deal massive damage, OHKOing Pokemon such as Choice Scarf Heatran, Mega Gallade, and Corviknight after Stealth Rock.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 623713, "username": "Don Bork"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 547532, "username": "Swiffix"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Piloswine": {
    "sets": {
      "Specially Defensive Wall (Ice)": {
        "description": "<p>Piloswine is one of Ice teams' best specially defensive walls, capable of filling some of Ice teams' biggest roles of being an entry hazard setter and Electric immunity. Thick Fat coupled with Eviolite gives Piloswine tremendous bulk, with which it can check dangerous Fire-type threats to Ice such as Volcarona and Mega Charizard Y by disposing of them with Rock Slide. 12 EVs in Attack guarantees an OHKO on offensive Volcarona. Another one of Piloswine's amazing traits is its Ground typing, which makes it a great asset in the Electric matchup by preventing a Volt Switch onslaught while also letting it hit Electric-types super effectively with STAB Earthquake. Toxic is an option to put defensive switch-ins such as Skeledirge and Rotom-W on a timer, helping Piloswine's teammates overpower them, but Roar is an alternative choice to force out threats that may use it to set up, such as Mega Scizor, and to rack up hazard damage from its Stealth Rock and Cloyster's Spikes to wear down threats such as Urshifu-R and Mega Venusaur. Piloswine appreciates Alolan Ninetales's snow and Aurora Veil, which let it wall the opposition more easily. Piloswine is, however, extremely vulnerable to Water-types, so partnering it with Kyurem or Arctozolt is appreciated, as they can easily break Water teams. Substitute Baxcalibur also threatens Poison teams, which can cripple Piloswine with Toxic. Weavile with a Z-Crystal is also a good Knock Off absorber for Piloswine, as losing Eviolite ruins Piloswine; Weavile also forces immense progress by removing key items from Celesteela and Skeledirge, which become susceptible to Stealth Rock afterwards, or outright breaking through them with a Z-Move. Galarian Darmanitan and Shell Smash Cloyster can threaten Steel teams with Flare Blitz and Hydro Pump or Hidden Power Fire, respectively. The Stealth Rocks and Toxic spread by Piloswine also accentuates the breaking power of teammates such as Swords Dance or Dragon Dance Baxcalibur and Belly Drum Cetitan. IronPress Avalugg and defensive Cloyster with Hidden Power Fire are also good partners in being able to shut down Mega Scizor. Avalugg, Articuno, and Cloyster are also capable of removing entry hazards, with the latter two also being able to pivot in Piloswine with U-turn and Teleport, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 532439, "username": "Bka Onon"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 262594, "username": "Milak"}]}]}
  },
  "Corsola-Galar": {"sets": {"Physically Defensive": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Mantine": {"sets": {"Water Absorb (Flying)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Skarmory": {
    "sets": {
      "IronPress (Steel)": {
        "description": "<p>Providing a neutrality to Fighting and a immunity to Ground, Skarmory is a valuable option for Steel teams to mitigate their most common weaknesses and set entry hazards. Its IronPress combination enables Skarmory to act as a win condition, notably using foes such as Tapu Bulu, Mega Aerodactyl, and Excadrill as setup fodder. As Skarmory is passive against Ghost-types, Gholdengo is a solid partner, as it can apply offensive pressure against them and also keeps entry hazards set by Skarmory on the field to ease wearing down the opposing team. Heatran's high special bulk and Fire immunity support Skarmory by acting as a switch-in to foes that can easily overwhelm Skarmory such as Mega Latias, Volcarona, and Mega Pidgeot. Defensive Electric-resistant teammates such as Ferrothorn can switch into Electric-types that threaten Skarmory such as Tapu Koko, Rotom-W, and Zapdos; Ferrothorn also makes a hazard stacking core with it. Archaludon similarly checks Electric-types that threaten Skarmory and handles physical attackers Skarmory can't properly handle such as Ceruledge, Ogerpon-W, and Mega Charizard X. Iron Treads offensively checks Electric-types, as well as some foes Skarmory has trouble against such as Landorus and Gholdengo.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Kingdra": {"sets": {"Swift Swim (Water)": {"description": "<p>A Timid nature outspeeds Choice Scarf Roaring Moon.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Porygon2": {"sets": {"The Duck": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Blissey": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Blissey's high Special Defense stat is pivotal to its role as a wall. In addition to its great bulk, it gets access to great utility moves such as Teleport for momentum, Soft-Boiled for reliable recovery and longevity, Toxic to cripple foes, and Stealth Rock to put pressure on Mega Charizard X and Choice Scarf Cinderace. Seismic Toss additionally provides a consistent damaging move to chip incoming Pokemon without the means to recover and deal with special attackers such as Greninja and Landorus by taking hits. Blissey runs Heavy-Duty Boots to prevent passive chip from entry hazards to help it create momentum for its teammates. Staraptor pairs well with Blissey as part of Normal's defensive core with access to Intimidate and ability to take hits from threats such as Great Tusk and physically offensive Iron Valiant. It can also use Defog to remove hazards if Blissey's Heavy-Duty Boots have been removed by Knock Off. Since Blissey is able to take hits from Pokemon such as Gholdengo and Blacephalon, it can freely switch into them and then use Teleport to bring in one of Normal's offensive threats such as Ursaluna, Terapagos, or Mega Lopunny. Ursaluna and Mega Lopunny provide Normal with physical wallbreaking capabilities, while Calm Mind Terapagos can be used as a special wallbreaker. Terapagos can also be used as a bulkier presence to remove hazards with Rapid Spin and poison foes with Toxic. Hisuian Zoroark allows for mind games to be played, as its secondary typing provides an immunity to Fighting. In addition, it is able to disguise itself as a more passive Pokemon such as Blissey to provide a false sense of security to the opponent. Ditto provides a counter to setup Pokemon like Mega Scizor and Ceruledge, being able to transform into them and outspeeding them while also potentially reverse sweeping the opponent's team. Mega Pidgeot provides strong Flying-type coverage with Hurricane against Fighting-types such as Choice Specs Iron Valiant and Kommo-o.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 623713, "username": "Don Bork"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 532439, "username": "Bka Onon"}, {"user_id": 481576, "username": "roxie"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Tyranitar": {
    "sets": {
      "Choice Band (Rock)": {
        "description": "<p>Choice Band Tyranitar is the premier physical wallbreaker on Rock teams with its massive base 134 Attack stat and its access to Pursuit allowing it to revenge kill Gholdengo, Latias, and Hisuian Zoroark. Stone Edge deals huge damage to key Pokemon that Rock-types struggle with such as Corviknight, Celesteela, and Mega Venusaur. Knock Off means that Pokemon such as Gholdengo and Slowbro have to be careful when facing Tyranitar, along with removing valuable items from Toxapex and Empoleon. Fire Punch OHKOes the likes of Mega Scizor and Ferrothorn, both of which are threats to Rock teams. Earthquake helps with the Steel, Poison, and Rock mirror matchups by hitting Heatran, Clodsire, and Garganacl with a lot of power. Heavy Slam is also worth mentioning, as it can OHKO the likes of Tapu Bulu and Clefable and helps the Fairy matchup a tremendous amount. Ice Punch is an alternative as well, as it threatens to OHKO foes such as Landorus and Gliscor. Additionally, Tyranitar is able to set up sand, aiding teammates such as Garganacl, Cradilly, and Nihilego with a Special Defense boost. A Jolly nature allows Tyranitar to outspeed Choice Specs Iron Valiant outside of Electric Terrain and Mega Diancie while Sticky Web is up and OHKO both with Heavy Slam. This does, however, cause a loss of power, making the Steel and Poison matchups much harder by not 2HKOing Corviknight and Mega Venusaur with Stone Edge. Shuckle can set up Sticky Web, which allows Tyranitar to outspeed threats such as Gholdengo and Nidoking. Mega Diancie is a great special wallbreaker that Tyranitar needs on its team to deal with the Fighting-types that threaten it such as Kommo-o and Great Tusk. Cradily gives Tyranitar a switch-in to Ground-type moves that can reliably take hits and proceed to use Recover to maintain its health while also setting up Stealth Rock. Choice Scarf Terrakion pairs amazingly with Tyranitar by taking the physical wallbreaking load off of Tyranitar and splitting it between the two powerhouses. Terrakion is able to revenge kill Mega Lopunny while also benefitting from Tyranitar's Pursuit trapping ability. As a wall, Garganacl appreciates Tyranitar removing Leftovers from Pokemon such as Hippowdon and Ting-Lu. Ogerpon-C creates additional pressure in the Ground and Water matchups, complementing Tyranitar's power with great coverage. Nihilego helps with Tyranitar's weakness to Fairy-types, providing great Special Defense in sand, as well as Poison coverage. Although Tyranitar has great bulk, Rhyperior and Omastar are better checks to Scizor, a huge threat to the Rock type. Rhyperior's great bulk and ability allow it to beat Scizor, while Omastar's neutrality to Steel-type moves allows it to beat Scizor one-on-one.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 623713, "username": "Don Bork"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Celebi": {"sets": {"Nasty Plot (Grass)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Swampert": {
    "sets": {
      "Rain Sweeper (Water)": {
        "description": "<p>Mega Swampert is a mainstay on rain-based Water teams due to its ability Swift Swim, part-Ground typing, great role compression, and fearsome wallbreaking ability, heavily improving the Electric, Poison, and Dragon matchups. Earthquake nails Water-resistant foes like Toxapex, Hisuian Goodra, and Water Absorb Clodsire as well as Electric-types such as Tapu Koko, Iron Hands, and Zeraora. Furthermore, with sufficient chip damage, it's capable of overwhelming Ferrothorn and Gastrodon. Waterfall is nicely complemented by rain as it outdamages Ice Punch when combatting Flying-types like Zapdos and Corviknight. Waterfall is notably preferred over Liquidation due to its higher PP and potential to break through walls, such as the aforementioned Corviknight, via flinching. Ice Punch targets Dragon- and Grass-types like Dragonite, Latias, and Tapu Bulu due to their resistances to Mega Swampert's STAB combination. Flip Turn allows Mega Swampert to escape unfavorable situations and form pivoting cores with teammates like Pelipper, Greninja, and Barraskewda. Alternatively, Stealth Rock may be used to take advantage of Mega Swampert's ability to force switches, while other options such as Stone Edge and Toxic may be used to threaten Mantine, Pelipper, and Rotom-W which wall it otherwise. A Jolly nature is preferred to outpace Choice Scarf Thundurus-T, Volcarona after one Quiver Dance, and opposing Mega Swampert. However, an Adamant nature may be used for higher damage rolls against Kommo-o, Mega Venusaur, and Gastrodon. Pelipper is a perfect teammate, as it provides rain with Drizzle, slowly pivots into Mega Swampert with U-turn, and removes entry hazards with Defog. In return, Mega Swampert provides an immunity against the aforementioned Electric-type moves and threatens Rock-types such as Terrakion and Mega Diancie. Toxapex provides a buffer against Grass-types like Rillaboom and Meowscarada as well as Kommo-o while also providing Toxic Spikes to enhance Mega Swampert's wallbreaking capabilities. Furthermore, Toxapex appreciates Mega Swampert forcing out Heatran and Gholdengo, as they easily take advantage of Toxapex's passivity. Urshifu-R and Barraskewda deal with threats like Ferrothorn, Hydreigon, and Kyurem, while Mega Swampert removes Toxapex and Water Absorb Clodsire. Other Swift Swim users like Basculegion-F and Barraskewda take on threats like Slowbro and Tapu Koko outside of rain, respectively. Greninja provides speed control outside of rain and beats Fairy-types such as Tapu Bulu and Alolan Ninetales with Gunk Shot as well as overloads shared Water-resistant foes like Ferrothorn and Mega Venusaur with a Choice Specs set. Empoleon is a good teammate as it can free up Mega Swampert's Stealth Rock moveslot and switch into Freeze-Dry users like Kyurem and Alolan Ninetales.</p>"
      },
      "Specially Defensive (Water)": {
        "description": "<p>Swampert provides great defensive coverage for Water teams thanks to its crucial immunity to Electric, as well as support with Stealth Rock and Flip Turn. Roar allows Swampert to phaze out setup sweepers that it can take hits from such as Mega Charizard X and Galarian Moltres; notably, the both of them are especially vulnerable to Stealth Rock due to their lack of recovery. Flip Turn allows Swampert to take advantage of its low Speed to bring in a teammate safely. Greninja serves as a great partner, as not only can it threaten Grass-types such as Mega Venusaur, Sinistcha, and Ogerpon-W, but it also takes on a myriad of threats like Great Tusk, Mega Latias, and Slowbro with its coverage. Toxapex forms a defensive partnership with Swampert, as it can stack hazards with Toxic Spikes as well as take on Grass- and Fairy-types such as Meowscarada, Tapu Bulu, and Azumarill, while Swampert can switch into a predicted Electric-type attack from Regieleki and Mangezone. Ogerpon-W appreciates Swampert taking on Poison-types it dislikes like Toxapex and Water Absorb Clodsire, and in return, it eases the Ground matchup by taking out the Landorus formes and Excadrill. Pelipper provides a Ground immunity, and it takes on Fighting-types like Buzzwole and Keldeo; Barraskewda can also be used alongside Pelipper so that rain teams can opt to use this version over Mega Swampert instead. Hisuian Samurott can also stack entry hazards with Ceaseless Edge, and it assists in the Ghost matchup by taking on the likes of Sinistcha and non-Choice Scarf Gholdengo. Keldeo and Urshifu-R deal with Kyurem, which can remove Swampert with Freeze-Dry.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}, {"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 558636, "username": "zastra"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Pelipper": {
    "sets": {
      "Rain Setter (Water)": {
        "description": "<p>Pelipper is one of Water's most valuable Pokemon thanks to its ability to set up rain to activate Swift Swim for its teammates and its various utility options. Hurricane under rain is able to consistently hit Grass- and Fighting-types like Mega Venusaur and Ogerpon-W. Alternatively, Scald punishes switch-ins like Iron Hands and Zeraora with a potential bur, and it also targets Hippowdon. U-turn in tandem with its low Speed allows Pelipper to bring in its teammates safely. With 9 Speed IVs, Pelipper underspeeds Hippowdon, guaranteeing it sets up rain after Hippowdon's sand. Mega Swampert, Barraskewda, and Kingdra appreciate Pelipper's rain, as it activates their Swift Swim to outspeed and threaten Tapu Koko, Alolan Raichu, and Mega Latias, respectively. Ogerpon-W is another beneficiary of rain, as it further boosts the power of Ivy Cudgel. Notably, Ivy Cudgel now outright OHKOes Thundurus-T, has a high chance of OHKOing Alolan Muk after Stealth Rock damage, and guarantees a 2HKO on Galarian Weezing when unboosted. Urshifu-R and Keldeo can deal with Kyurem and bulky Steel-types such as Ferrothorn, Celesteela, and Empoleon. Toxapex sets up Toxic Spikes or spreads poison directly with Toxic to aid Pelipper's teammates; it is also great in the Fairy matchup, handling the likes of Tapu Bulu, Tapu Fini, and Azumarill.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Breloom": {"sets": {"Swords Dance (Grass)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Shedinja": {"sets": {"Dual Status User (Ghost)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Sableye": {
    "sets": {
      "Mixed Wall (Dark)": {
        "description": "<p>Mega Sableye is a relevant defensive backbone for Dark teams because it serves as a switch-in to Fighting-type moves and is a good punisher of entry hazard setters such as Archaludon, Klefki, and Clodsire thanks to its solid mixed bulk and Magic Bounce. Metal Burst lets Mega Sableye reduce its passivity by damaging foes more than Knock Off, notably OHKOing Kommo-o after withstanding Clangorous Soulblaze and Mega Diancie. Protect is an alternative that lets it safely Mega Evolve when it's threatened by foes such as Mega Diancie and Mega Lopunny, ensuring that it can block entry hazards mid-game with Magic Bounce and easing its prediction against Choice-locked foes such as Galarian Darmanitan and Enamorus. The given EV spread allows Mega Sableye to avoid an OHKO from Mega Diancie's Moonblast and a 2HKO from Excadrill's Earthquake. Mega Sableye is forced out by Fairy-types such as Iron Valiant and Tapu Koko, so Alolan Muk and Ting-Lu are good partners to mitigate this weakness; the latter also sets hazards up, which Mega Sableye can maintain by blocking Rapid Spin from Excadrill, Iron Treads, and Terapagos. Mandibuzz complements Mega Sableye by checking Fighting-types it can't consistently handle such as Mega Lopunny and Great Tusk and providing hazard control as further backup if Mega Sableye is unable to keep entry hazards off of its side of the field. As Mega Sableye cripples foes throughout a battle, setup sweepers such as Hydreigon and Weavile and cleaners like Choice Scarf Meowscarada find easier setup opportunities to KO foes on the other team.</p>"
      },
      "Mixed Wall (Ghost)": {
        "description": "<p>Mega Sableye is a staple on bulkier Ghost teams due to its Dark typing, great abilities before and after Mega Evolution, and great defensive stats. Knock Off hinders Chansey and Porygon2 for Mega Sableye's wallbreaking teammates and eases the matchup against Landorus and Nidoking. Due to Sableye's meager HP and need for longevity, Recover's a must-have utility option, further enabling Metal Burst. Protect allows Sableye to Mega Evolve safely, ensuring it can utilize Magic Bounce later into the game. Metal Burst retaliates against Fairy-types such as Mega Diancie, while Dazzling Gleam eliminates Mega Sableye's passivity in front of Hydreigon and Roaring Moon. Will-O-Wisp in conjunction with Prankster renders physical attackers like Mega Gallade, Dragonite, and Mamoswine less threatening. The given EV spread avoids a 2HKO from Life Orb Nidoking's Earth Power, assuming Mega Sableye uses Knock Off after the first Earth Power. Mimikyu threatens Dark-types such as Mandibuzz, Galarian Moltres, and opposing Mega Sableye. Gholdengo checks Fairy-types such as Tapu Lele, Mega Diancie, and Iron Valiant as well as preventing foes from removing entry hazards set by Froslass and Galarian Corsola. Blacephalon handles opposing Gholdengo and utilizes Choice Scarf to clean through Steel, Ghost, and Psychic teams once Heatran, Mega Sableye, and Galarian Slowking, respectively, are removed. Skeledirge has great synergy with Mega Sableye, appreciating the prevention of opposing Stealth Rock and in return walling Volcarona, Mega Lopunny, and Alolan Ninetales.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 593863, "username": "CrossHeart"}, {"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 547532, "username": "Swiffix"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 594478, "username": "ken"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Torkoal": {
    "sets": {
      "Sun Setter": {
        "description": "<p>Torkoal provides great support for Fire teams thanks to its ability to set sun and Stealth Rock as well as remove entry hazards with Rapid Spin. Lava Plume can potentially burn offensive threats like Dragonite and Iron Hands. Body Press allows Torkoal to use its great physical bulk to its advantage by threatening Dark-types such as Roaring Moon and Tyranitar. Heat Rock allows Torkoal's sun to support teammates for longer, but Heavy-Duty Boots can also be used so that Torkoal can switch in more freely without fearing entry hazards and have an easier time removing them. Yawn is an option that pairs well with Stealth Rock because it forces switches. Volcarona makes for a great partner, as it appreciates the sun Torkoal sets so that its Flamethrower can hit new benchmarks, notably OHKOing Landorus and 2HKOing Empoleon and Alolan Muk after a boost, as well as now being able to survive a Hydro Pump from Choice Specs Greninja to set up one Quiver Dance. In return, Volcarona is able to deal with Fighting- and Ground-types such as Kommo-o, Swampert, and Great Tusk thanks to its coverage. Cinderace threatens Normal- and Rock-type foes such as Porygon2, Ogerpon-C, and Hisuian Arcanine and can don a Choice Scarf to dispatch speedy threats such as Choice Scarf Iron Treads and Tapu Lele. Heatran deals with problematic walls such as Toxapex and Archaludon by trapping them with Magma Storm and removing them with Earth Power as well as Diancie with Flash Cannon. Heatran also runs Stealth Rock so that Torkoal can opt to use another option such as Yawn. Late-game sweepers and cleaners such as Mega Charizard X, Ceruledge, and Blacephalon appreciate the sun Torkoal provides so that they can mop up more efficiently.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Altaria": {
    "sets": {
      "Offensive Dragon Dance (Dragon)": {
        "description": "<p>Mega Altaria's unique typing and offensive potential allow it to serve as a valuable setup sweeper that checks threats like Kommo-o, Roaring Moon, Iron Hands, and Keldeo. Pixilate-boosted Return checks the aforementioned Dragon-types as well as Fighting- and Dark-types such as Terrakion, Mega Sableye, and Mandibuzz. Earthquake is essential coverage, as it hits Steel- and Fire-types like Heatran and Magnezone and—in conjunction with Return—eases the Dark and Electric matchups. Roost increases Mega Altaria's longevity so it can continuously Dragon Dance throughout the match or use its bulk to switch into threats. The given EV spread allows Mega Altaria to survive Mega Lopunny's Triple Axel. Choice Specs Kyurem is a great teammate, as it breaks past the likes of Toxapex, Corviknight, and Dondozo for Mega Altaria. Garchomp sets up Stealth Rock and Spikes, wearing down Mega Altaria's switch-ins. Kommo-o breaks past Steel-types like Skarmory, Aegislash, and defensive Celesteela as well as other troublesome walls like Toxapex and Hippowdon for Mega Altaria. Roaring Moon threatens obstacles such as Mega Diancie, Choice Specs Greninja, and Skeledirge.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Latias": {
    "sets": {
      "Calm Mind (Dragon)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Choice Scarf (Psychic)": {
        "description": "<p>Choice Scarf Latias is an effective form of speed control on Psychic teams, differentiating itself from other Choice Scarf users like Tapu Lele and Iron Boulder with its excellent utility options such as Healing Wish. Latias's part-Dragon typing alongside Levitate lets it switch into and threaten many Electric- and Ground-type attackers such as Alolan Raichu and Landorus. Trick is preferred over Defog, as it allows Latias to shift its Choice Scarf to special walls like Ting-Lu and Blissey that would otherwise trouble it. However, Defog can be used over Trick to allow it to clear entry hazards for its teammates thanks to its great Speed. Healing Wish lets Latias stand out from other Choice Scarf users by allowing it to give one of its teammates a second chance in battle. Victini is a fantastic teammate for Latias because it that helps break through Steel-type Pokemon such as Gholdengo and Skarmory. Similarly, Mega Gallade can support Latias by breaking down Steel- and Dark-type Pokemon such as Heatran, Hisuian Goodra, Tyranitar, and Ting-Lu. In return, Latias can provide Healing Wish and Defog support for both Mega Gallade and Victini, check Zapdos for Mega Gallade, and check Ground- and Water-type Pokemon such as Garchomp and Ogerpon-W for Victini. Choice Scarf Tapu Lele is an excellent teammate for Latias, threatening Dark-type Pokemon such as Mega Sableye and Weavile. Jirachi is also a great teammate because it can deal with Fairy-type Pokemon such as Tapu Lele and Choice Scarf Iron Valiant, sponge attacks from Pokemon like Kyurem and opposing Latias, set up entry hazards, and provide safe switch-ins for Latias with U-turn.</p>"
      },
      "Choice Scarf (Dragon)": {
        "description": "<p>Choice Scarf Latias is a premier revenge killer on Dragon teams for its decent revenge killing capabilities, as it's able to outspeed common threats to Dragon teams such as Iron Valiant, Choice Specs Greninja, and Mega Garchomp while providing useful utility options in Defog and Healing Wish. Psychic lets Latias revenge kill troublesome Fighting-type Pokemon such as Hisuian Lilligant and Mega Lopunny. However, Psyshock can instead be used to hit Assault Vest Iron Hands and Clodsire harder. Defog allows Latias to work as emergency entry hazard removal thanks to its great Speed. Trick can be used over Defog to allow Latias to cripple special walls like Galarian Slowking and Blissey. Healing Wish lets Latias restore the health and status of one of its teammates, allowing them to have a second chance in the battle. Mega Altaria and Roaring Moon are superb partners that threaten the Dark- and Ghost-type Pokemon that Latias is weak to such as Tyranitar and Gholdengo. Kyurem is another great offensive partner, as it can destroy threats that Latias struggles against such as Mamoswine and Ting-Lu; in return, Latias can inconvenience special walls like Blissey and Galarian Slowking with Trick, beat Fighting-type Pokemon such as Keldeo and Urshifu-R for Kyurem, and provide Healing Wish support for it to take advantage of. Garchomp is also a great partner that pressures Steel-type Pokemon that Latias struggles against. It can also punish most physical attacks directed at Latias with Rough Skin if using a defensive set, while its Swords Dance set takes advantage of special walls that Latias struggles with such as Blissey and Galarian Slowking. Garchomp can also set up hazards, which allow Latias to OHKO threats such as Greninja for its team. Kommo-o is also a fantastic partner for Latias, as it beats Steel- and Dark-type Pokemon such as Mega Scizor and Ting-Lu while also appreciating Healing Wish support for a second assault. Archaludon is a great partner for Latias as well, as it provides a buffer against threats such as Roaring Moon and Mega Altaria that would otherwise beat Latias or take advantage of it while also setting up hazards for Latias.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 629771, "username": "ImZer0"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}, {"user_id": 635656, "username": "Elvira"}, {"user_id": 602431, "username": "CaptainDaimyo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Jirachi": {"sets": {"Specially Defensive (Psychic)": {"description": "<p>20 Spe EVs lets it outspeed Breloom and Pokemon around that speed tier</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Z-Happy Hour (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Choice Scarf (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Deoxys-Speed": {"sets": {"Nasty Plot (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned</p>"}}},
  "Empoleon": {
    "sets": {
      "Specially Defensive (Water)": {
        "description": "<p>Empoleon is one of Water's best options for role compression thanks to its wide array of utility options. Furthermore, its great special bulk coupled with a great defensive typing allows it to easily shrug off hits from some of the biggest threats to Water teams such as Tapu Lele and Kyurem. Defog removes entry hazards, allowing its teammates to switch in more safely, and it also removes opponents' dual screens to ease the Fairy matchup. Alternatively, Empoleon can run Stealth Rock to wear down foes over time to aid its offensive partners. Flash Cannon targets Fairy-types such as Mega Diancie and Tapu Lele. Knock Off targets Ghost- and Psychic-types like Hisuian Zoroark and Jirachi while removing items from foes that rely on them like Rotom-W and Corviknight. Alternatively, Flip Turn allows Empoleon to take advantage of its low Speed by acting as a slow pivot to bring its teammates in safely. Pelipper pairs well with Empoleon, as the two of them form a pivoting core, and it appreciates Empoleon taking on Tapu Lele and Kyurem. In return, Pelipper can run Defog so that Empoleon can choose to run Stealth Rock instead. Rain-boosted sweepers like Mega Swampert and Barraskewda appreciate Empoleon taking on Kyurem's Freeze-Dry and Choice Scarf Tapu Lele, respectively, and in return, it provides an Electric immunity and can sweep under rain. Urshifu-R and Keldeo appreciate Empoleon setting up Stealth Rock and challenging Fairy-types; in return, the two of them challenge Steel-types such as Ferrothorn and Hisuian Goodra. Choice Specs Greninja, with its great coverage, handles a myriad of threats to Empoleon such as non-Choice Scarf Iron Valiant, Great Tusk, and the Landorus formes, and it appreciates Defog and Stealth Rock support in return. Choice Scarf Hisuian Samurott can stack Spikes with Ceaseless Edge, and it takes on Ghost- and Psychic-types if Empoleon forgoes Knock Off. Ogerpon-W's Ground-resistant typing allows it to deal with the likes of the Landorus formes, Great Tusk, and Mamoswine in the Ground matchup.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Staraptor": {"sets": {"Physically Defensive (Normal)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Gastrodon": {
    "sets": {
      "Physically Defensive (Ground)": {
        "description": "<p>Gastrodon is a mainstay on Ground teams due to its vast utility options, great bulk along with reliable recovery, and a stellar ability in Storm Drain, checking a myriad of Water-types like Mega Swampert, Barraskewda, and Keldeo. Scald threatens physical attackers such as Dragonite, Mega Lopunny, and Mimikyu with a burn. Thanks to Gastrodon's bulk, it is able to stack multiple layers of Spikes to wear down opposing teams. Alternatively, Stealth Rock can be used, freeing a moveslot from a teammate such as Garchomp or Hippowdon. Toxic puts troublesome walls such as Mantine, Ting-Lu, and Araquanid on a timer. Earthquake may be used alongside a Relaxed nature to break Calm Mind Keldeo's Substitute. All of Gastrodon's teammates appreciate its ability to switch into Water-type attacks. Unaware Clodsire checks Grass-types such as Meowscarada and Tapu Bulu as well as setup sweepers Gastrodon can't beat like Volcarona and Galarian Moltres. Iron Treads removes entry hazards with Rapid Spin so Gastrodon can better perform its defensive duties. Wallbreakers like Landorus and Great Tusk appreciate Gastrodon's entry hazard support so that they can net more damage. Mamoswine acts as a secondary Ice-type switch-in that checks the likes of SubRoost Kyurem and Alolan Ninetales, relieving pressure off of Gastrodon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Lopunny": {
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Mega Lopunny is the best Mega Evolution available for Normal teams due to its blistering Speed tier, great offensive prowess, and unique ability in Scrappy. Fake Out lets Mega Lopunny serve as an exceptional revenge killer, dealing with worn down foes like Meowscarada, Barraskewda, and Alolan Raichu. It also puts Pokemon like Keldeo, Cinderace, and Tapu Koko in range of its other attacks safely. With Scrappy, Close Combat notably lets Mega Lopunny take on threats like Mega Sableye, Aegislash, and Gholdengo, threatening the defensive cores of Dark and Steel teams. U-turn enables Mega Lopunny to work as a potent offensive pivot, escaping unfavorable situations against walls like Slowbro and Mega Venusaur while keeping momentum. Triple Axel threatens common switch-ins such as Gliscor and Mandibuzz, while Return is Mega Lopunny's hardest-hitting move against most Psychic- and Fairy-types, such as Tapu Lele and Iron Valiant. Blissey is a great teammate, taking on the likes of Volcarona and Zapdos thanks to its bulk while offering support in the form of Stealth Rock, Toxic, and Teleport. Staraptor switches into Fighting-type attacks from Pokemon like Great Tusk, Buzzwole, and Tapu Bulu, and its access to Defog and U-turn also prolongs Mega Lopunny's longevity and lets it switch in unscathed. Special attackers like Hisuian Zoroark and Porygon-Z are able to break past physical walls Mega Lopunny can't, like Skeledirge, Corviknight, and Slowbro. Hisuian Zoroark also prevents Fighting-types from spamming their STAB moves aimed at Mega Lopunny.</p>"
      },
      "Wallbreaker (Normal)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 423085, "username": "Deezcastforms"}, {"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Garchomp": {"sets": {"Defensive Entry Hazard Setter (Dragon)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Offensive Entry Hazard Setter (Dragon)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Swords Dance (Ground)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Weavile": {
    "sets": {
      "Swords Dance (Dark)": {
        "description": "<p>Swords Dance Weavile makes for a great cleaner against types like Flying, Ground, and Dragon, as it deals with nuisances like Celesteela, Landorus, and Mega Altaria. Icium Z-boosted Icicle Crash lets Weavile break through and OHKO defensive walls like Celesteela, Gastrodon, and Ferrothorn after minimal chip damage at +2 and immediately remove Mega Diancie and bulkier variants of Mega Altaria. Although it is less consistent than Icicle Crash, Triple Axel provides Weavile with much higher wallbreaking power and the ability to immediately remove Ogerpon-C at the cost of making it vulnerable to contact damage from Skarmory and Ferrothorn and checked more easily by Archaludon. However, this lets Weavile use Heavy-Duty Boots instead of Icium Z due to Triple Axel's higher damage ceiling than Icicle Crash. Knock Off removes key items from switch-ins like Rotom-W, Archaludon, and Celesteela, making them easier for Weavile to overwhelm later. Ice Shard picks off faster threats like Mega Aerodactyl and Choice Scarf users like Meowscarada, Roaring Moon, and Enamorus. Ting-Lu provides entry hazard support, which helps Weavile gain the appropriate thresholds for OHKOing defensive walls like Celesteela, and it also deals with special attackers like Volcarona, Tapu Lele, and Tapu Koko. Nasty Plot Hydreigon and Galarian Moltres form a potent wallbreaking core with Weavile, with the former dealing with Slowbro, Archaludon, and Toxapex and the latter handling faster threats like Latios and Enamorus. Weavile also fits on hyper offense teams, with teammates like Grimmsnarl providing dual screens support to give it more room to set up and Dragon Dance Mega Tyranitar battering down opposing teams for it to clean up later. If slotted in on balance teams, Weavile greatly appreciates Mega Sableye and Mandibuzz keeping entry hazards off the field and taking on Fighting-types like Sneasler. Mandibuzz also checks physical setup sweepers like Mega Scizor with Foul Play and pivots Weavile in with U-turn.</p>"
      },
      "Choice Scarf (Ice)": {
        "description": "<p>Choice Scarf Weavile is an excellent revenge killer on Ice teams because of its powerful STAB combination, access to Pursuit, and an incredible Speed stat that allows it to outspeed threats like Mega Aerodactyl, Mega Lopunny, and Choice Scarf users like Iron Boulder, Blacephalon, and Tapu Lele. Pursuit allows Weavile to trap and eliminate foes like Blacephalon and Iron Boulder that threaten Ice teams, while Punishment threatens Z-Celebrate Victini and Z-Happy Hour users like Jirachi and Hisuian Zoroark. Knock Off hinders defensive switch-ins like Corviknight, Ferrothorn, and Toxapex by removing their Leftovers or Heavy-Duty Boots. Low Kick targets foes like Heatran, Iron Treads, and Mega Tyranitar. Kyurem, Alolan Ninetales, and Arctozolt are excellent partners for their ability to break through bulky Water-types like Toxapex, Rotom-W, and Swampert, which Weavile struggles against. Arctozolt, Galarian Darmanitan, Cetitan, and Kyurem can also wear down or eliminate Steel-types like Skarmory, Corviknight, Ferrothorn, and Archaludon, allowing Weavile to clean up late-game. Cloyster and Piloswine set entry hazards, which, in conjunction with Weavile's Knock Off removing Heavy-Duty Boots, can wear down bulky foes. Additionally, Cloyster also provides entry hazard removal with Rapid Spin, increasing Weavile's survivability, while Piloswine can check Fire-types like Volcarona and Heatran.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542526, "username": "Neko"}, {"user_id": 594972, "username": "Murphy Lawden"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 635656, "username": "Elvira"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Gliscor": {
    "sets": {
      "Stallbreaker (Flying)": {
        "description": "<p>Gliscor is a great addition to Flying teams, as its part-Ground typing allows it to be a useful asset in the Electric and Rock matchups, threatening the likes of Magnezone, Zeraora, and Hisuian Arcanine. Knock Off removes important items such as Heavy-Duty Boots from Volcarona, Tornadus-T, and Dragonite and Leftovers from Corviknight. Taunt shuts down entry hazard attempts as well as attempts to remove its teammates' hazards with Defog. Roost grants Gliscor a form of longevity on top of Poison Heal. 244 HP and 20 Defense EVs allow it to survive a V-create from Choice Band Victini, while 8 Speed EVs outspeed Modest Raging Bolt. Corviknight and Mantine remove hazards with Defog so Gliscor can switch in more safely. Additionally, Corviknight provides slow pivoting and threatens Fairy-types like Tapu Lele and Mega Diancie, while Mantine handles Water-types like Barraskewda and Mega Swampert. Thundurus-T takes pressure off Gliscor by providing an additional Electric immunity; it also threatens Water- and Flying-types such as Urshifu-R, Swampert, Mantine, and Corviknight with its coverage. It appreciates Gliscor removing Clodsire and blocking entry hazard setup with Taunt. Late-game sweepers such as Mega Charizard Y and Galarian Moltres appreciate Gliscor's stallbreaking against Toxapex, Clodsire, and Heatran so they can start their own sweep. In return, Mega Charizard Y handles Ferrothorn, Gastrodon, and Alolan Ninetales, while Galarian Moltres handles Ghost- and Psychic-types such as Gholdengo, Ceruledge, and Slowbro.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 635656, "username": "Elvira"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Mamoswine": {
    "sets": {
      "Choice Band (Ground)": {
        "description": "<p>Mamoswine is an incredible Choice Band user for Ground-type teams thanks to its raw power and excellent STAB coverage, making it a force to be reckoned with. Ice Shard helps it pick off faster Pokemon that can threaten it, such as Thundurus-T, Enamorus, and Latias. Knock Off heavily weakens Pokemon reliant on their items, such as Corviknight, Porygon2, and Celesteela, making them much easier for Mamoswine to take advantage of later on. Alternatively, Superpower is Mamoswine’s best option for beating bulky Pokemon such as Blissey, Ferrothorn, and Rotom-W. Landorus is an outstanding teammate for Mamoswine to have, as it can threaten physical walls Mamoswine would rather not face, such as Mega Venusaur, Tapu Fini, and Slowbro, and help it beat Ground-immune Pokemon such as Skarmory and Rotom-W with Gravity. Scale Shot Mega Garchomp and Sand Rush Excadrill appreciate Mamoswine wearing down bulky Pokemon such as Celesteela and Gliscor for them to clean up late-game. Ting-Lu and Hippowdon help Mamoswine do its job more effectively by setting up entry hazards, allowing it to net more KOs. They also can rack up chip damage with Whirlwind, and Hippowdon sets sand for further residual damage. Clodsire and Gastrodon can safely switch into Water-type moves that threaten Mamoswine, and they can set hazards to help its wallbreaking. Clodsire, in particular, is able to switch into Grass-type attacks from the likes of Choice Scarf Meowscarada, Ogerpon-W, and Brambleghast, and it can inflict status and set Toxic Spikes up, limiting the longevity of stall Pokemon such as Slowbro, Ting-Lu, and Blissey. Gastrodon is an excellent Water Absorb user that can ease up Water matchups for Mamoswine, as it can safely wall Water-type Pokemon such as Choice Specs Walking Wake, Dondozo, and Mega Swampert with the proper moveset to take advantage of later on.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 655366, "username": "RodentTamer"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Gallade": {
    "sets": {
      "Swords Dance (Fighting)": {
        "description": "<p>For Fighting teams, Mega Gallade is one of the best choices, courtesy of its incredible offensive power, typing, and Speed, being the best counter to Fighting's biggest roadblock, Toxapex. Swords Dance increases Mega Gallade's power to the maximum, letting it freely overpower the likes of Mandibuzz and Celesteela. Zen Headbutt beautifully complements a Fighting-type STAB move, as it lets Mega Gallade easily break through any opposing Poison-types that may be annoying walls such as Mega Venusaur, Toxapex, and Clodsire. Knock Off is another tool in Mega Gallade's arsenal, which lets it take care of Psychic- and Ghost-types—such as Gholdengo, Slowbro, and Aegislash—and wears down Celesteela into range of Close Combat finishing it off. Triple Axel is another option to easily take care of Flying-types such as Landorus-T, Dragonite, and Enamorus. Shadow Sneak can also be considered to pick off faster weakened threats such as Gengar, Choice Scarf Blacephalon, and Mega Alakazam. With all its benefits, Mega Gallade has a few checks in Skeledirge and defensive Gholdengo; hence, offensive Great Tusk and Urshifu-R are great partners in helping take these down. Defensive Great Tusk also helps in setting and removing entry hazards, which is appreciated by Mega Gallade. Mega Gallade is also easily revenge killed by faster offensive threats such as Tornadus-T and Choice Scarf Blacephalon, so Assault Vest Iron Hands is a good check to stop these in their tracks and deal good damage back while also being able to pivot in Mega Gallade with Volt Switch. Breloom and Lilligant-H also helps significantly in the Water matchup against the likes of Mega Swampert and Barraskewda; they can also put opposing foes to sleep to make Gallade's setup easier. Choice Scarf Sneasler helps in the Fairy matchup against the likes of Choice Scarf Tapu Lele and Tapu Koko while also being able to set and absorb Toxic Spikes and can U-Turn to pivot in Mega Gallade safely. Iron Valiant is also an amazing partner in the form of a specially offensive threat, complementing Mega Gallade, as it can easily take care of Mega Sableye. Choice Scarf Iron Valiant also outspeeds Mega Swampert under rain and Regieleki under Electric Terrain, making it a great revenge killer if Mega Gallade gets knocked out.</p>"
      },
      "Swords Dance (Psychic)": {
        "description": "<p>Mega Gallade is a potent wallbreaker on Psychic teams thanks to its greatly appreciated Dark neutrality and good coverage in Knock Off and Triple Axel. Swords Dance allows Mega Gallade to grab a boost on a forced switch and potentially win the game with its high base Speed and astronomical Attack after one boost. Knock Off is crucial to hit opposing Psychic- and Ghost-types such as Slowbro and Gholdengo that would otherwise wall this set, and its item removal is always handy in breaking defensive teams reliant on Heavy-Duty Boots down with Stealth Rock damage and removing key items from Celesteela and Toxapex. Finally, Zen Headbutt does massive work against Poison teams after a single Swords Dance and deals high amounts of damage to Fighting-resistant Pokemon such as Buzzwole and Toxapex. Triple Axel is another alternative, allowing Mega Gallade to hit Flying- and Dragon-types such as Landorus-T and Garchomp. Shadow Sneak can allow Mega Gallade to outspeed and take out Ghost-types such as Choice Scarf Gholdengo and Choice Scarf Blacephalon that could otherwise beat it. Tapu Lele forms a wallbreaking core with Mega Gallade, as they both threaten common checks to each other. Tapu Lele beats Mega Sableye with Moonblast, while Mega Gallade crushes Steel-types such as Heatran and Celesteela that trouble Tapu Lele with Close Combat. Jirachi can take Fairy-type attacks such as Tapu Lele's Moonblast aimed for Mega Gallade, as well as paralyze threats and beat them down with Thunder Wave and Serene Grace-boosted Iron Head, letting Mega Gallade break through them with a timely paralysis. Finally, Jirachi provides Stealth Rock support and a safe pivot in with U-turn. Victini provides speed control with Choice Scarf and defeats Steel-types such as Choice Scarf Gholdengo that Mega Gallade is forced out by while appreciating Mega Gallade's ability to pound Heatran to dust. Deoxys-S provides entry hazard and dual screens support, which Mega Gallade can take advantage of with Knock Off and Swords Dance to break through bulkier teams. Slowbro provides crucial momentum with Teleport while also being able to annoy teams with Scald burns and Future Sight and switch in repeatedly through Regenerator. Celebi can break through troubling physical walls such as Hippowdon and Dondozo that Mega Gallade struggles to make progress against. Finally, Choice Scarf Latias can both remove entry hazards with Defog and use Healing Wish to give Mega Gallade a second chance to break through the opposing team.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 532439, "username": "Bka Onon"}, {"user_id": 571069, "username": "Dead by Daylight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 547532, "username": "Swiffix"}, {"user_id": 593863, "username": "CrossHeart"}, {"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rotom-Wash": {
    "sets": {
      "Bulky Pivot (Electric)": {
        "description": "<p>With its access to Levitate, Rotom-W is nearly mandatory on all Electric teams. Its Ground immunity and Water-type resistance make Pokemon like Mega Swampert unable to bother it; it also has access to Hydro Pump to hit annoying Ground-types such as Great Tusk and Hippowdon. Rotom-W is also a really good blanket check to Ice- and Fire-types like Mamoswine, Victini, and Galarian Darmanitan. Volt Switch provides great momentum, which is needed in hyper offense teams. In addition to providing momentum, Rotom-W has access to Will-O-Wisp and Toxic, crippling foes such as Mega Garchomp and Mimikyu with Will-O-Wisp, while Toxic punishes switch-ins such as Gastrodon and Kyurem. Defog lets Rotom-W compress roles, freeing up Zapdos to run Choice Specs, while Rotom-W prevents hazards from hurting teammates. Pain Split is another option, as it massively improves Rotom-W's longevity; however, this requires Zapdos to run Defog. The 44 invested Speed EVs ensure Rotom-W outspeeds Jolly Azumarill so that it can punish Azumarill for setting up Belly Drum with Will-O-Wisp or Volt Switch. Zapdos covers Rotom-W's weakness to Grass-types with access to Hurricane and Heat Wave, being able to OHKO the likes of Mega Venusaur and Ferrothorn, respectively, while also being immune to Mold Breaker Excadrill's Earthquake. Regieleki can be used as a Rapid Spinner, removing pressure from Rotom-W to function as the only hazard removal while also luring in Ground-types that Rotom-W can punish such as Iron Treads or Great Tusk. With access to Taunt and having an amazing Speed tier, Zeraora can prevent hazards from coming up and allow Rotom-W to switch in freely and get off a strong Hydro Pump or gain a lot of momentum and Volt Switch into one of its offensive teammates. Zeraora also pressures Hydreigon and Gholdengo, which can use Rotom-W as setup fodder. Iron Hands provides the coverage and bulk against Pokemon like Dragon Dance Dragonite, Volcarona, and SubRoost Kyurem that Rotom-W can't deal with while also putting a lot of pressure on Normal teams, as Rotom-W can Volt Switch against Blissey into Iron Hands and force Blissey to tank a hit or switch out. Alolan Raichu gives Rotom-W's slow Volt Switch a lot of value as it is strong but frail, being able to deal with Ice-types like Baxcalibut with Focus Blast and Poison-types like Mega Venusaur and Clodsire with Psyshock. Magnezone provides a valuable Poison immunity while also checking other threats like Tapu Lele, Meowscarada, and Alolan Ninetales.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 623713, "username": "Don Bork"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 574288, "username": "Giyu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Heatran": {
    "sets": {
      "Specially Defensive (Steel)": {
        "description": "<p>Heatran is a mainstay on Steel teams due to its ability, Flash Fire, letting it switch into threats like Blacephalon, Victini, and Iron Moth. Lava Plume makes Heatran annoying to switch into thanks to its burn chance, while Magma Storm softens walls like Toxapex and Rotom-W by trapping them. Earth Power threatens Poison- and Fire-types and makes Heatran an important asset against opposing Steel teams by hitting opposing Heatran. Roar lets Heatran phaze the likes of Nasty Plot Hydreigon and Z-Celebrate Victini and synergizes well with Stealth Rock to deal extra damage. Alternatively, Toxic cripples walls like Mantine and Rotom-W, as well as Pokemon that fancy switching into Heatran such as Volcarona and Mega Charizard Y. Substitute pairs well with Toxic and allows Heatran to be massively annoying against types like Steel, Electric, and Psychic by capitalizing on the many switches it forces in these matchups. Thanks to their typing and bulk, Corviknight and Celesteela are excellent teammates to check Ground- and Fighting-types like Mamoswine and Great Tusk for Heatran. Setup sweepers like Mega Scizor and Z-Happy Hour Jirachi appreciate Heatran wearing down teams with burn and Toxic. Iron Treads removes entry hazards with Rapid Spin and deals with Mega Charizard Y, Zeraora, and Cinderace with its Choice Scarf set. Ferrothorn checks Water-types like Mega Swampert and Urshifu-R and aids Heatran with Spikes and Leech Seed.</p>"
      },
      "Offensive Utility (Fire)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Victini": {
    "sets": {
      "Choice Band (Psychic)": {
        "description": "<p>Victini is a great wallbreaker on Psychic teams due to its well-rounded coverage and signature move in V-create, easing the matchup against Steel, Grass, and Ice teams. Bolt Strike threatens bulky Water-types such as Toxapex, Slowbro, and Tapu Fini that resist V-create. U-turn preserves Psychic's momentum and allows Victini to switch out of Pokemon that wall it like Dragonite and Mega Altaria. Trick cripples common switch-ins such as Storm Drain Gastrodon, Toxapex, and Skeledirge, while Brick Break lets Victini further threaten Steel and Dark teams by hitting Heatran and Mega Tyranitar hard. Choice Scarf Tapu Lele is an excellent teammate due to its ability to check Dark- and Dragon-types like Weavile, Kommo-o, and Hydreigon. It also sets up Psychic Terrain, protecting Victini from priority moves from the likes of Mimikyu and Azumarill. Jirachi and Celebi aid in Victini's wallbreaking by setting up Stealth Rock and replenishing its HP with Healing Wish. Furthermore, they form a pivot core with Victini that deals sizable chip damage while keeping momentum. Latias also provides Healing Wish support and removes entry hazards with Defog to preserve Victini's longevity. Mega Gallade and Victini can each weaken certain physical walls for the other to dispose of such as Ting-Lu and Skeledirge. Deoxys-S breaks through roadblocks like Toxapex, Garchomp, and Swampert and aids in cleaning weakened Flying and Water teams. Slowbro switches into most Water- and Ground-types that threaten Victini, like Urshifu-R and Excadrill, and it brings Victini into the field with Teleport.</p>"
      },
      "Z-Celebrate (Fire)": {
        "description": "<p>Victini is an excellent user of Z-Celebrate, which not only boosts its natural bulk, but also its amazing offensive potential. Stored Power in tandem with Z-Celebrate can easily shred through bulky Pokemon such as Toxapex and Gliscor. Focus Blast is a great form of coverage for Victini, as it can break down Dark-, Rock-, and Steel-types such as Tyranitar, Hisuian Arcanine, and Heatran; its low accuracy is also boosted by Victory Star. Alternatively, after a boost, Thunderbolt can threaten Water- and Flying-type Pokemon such as non-Choice Scarf Greninja, Pelipper, and Mega Charizard Y. Torkoal is an excellent teammate to pair with Victini, as not only does it provide sun to boost Victini's Searing Shot, notably giving it a favorable roll to take out Tapu Lele after a boost, but it also provides entry hazard removal in Rapid Spin. Torkoal can also set Stealth Rock of its own, which breaks Sturdy of foes like Skarmory and Ogerpon-C, allowing Victini to sweep. Cinderace can break through bulky Pokemon such as Blissey with itsLibero-boosted STAB High Jump Kick while also using Court Change to remove hazards for Victini. Rotom-H provides an immunity to Ground-types with Levitate and assists by setting up dual screens, letting Victini take advantage of them to set up; it also has a niche in being another hazard removal teammate with Defog. Volcarona's Bug typing and access to Quiver Dance and Bug Buzz can check threatening Dark-types such as Meowscarada, Roaring Moon, and Hydreigon. Mega Charizard X is a powerful wallbreak that, paired alongside Victini, can take out Dragon-type threats such as Dragonite after its Multiscale is worn down and Kyurem. Ceruledge is another offensive setup sweeper that can take out Ghost-type Pokemon like Blacephalon and a weakened Iron Boulder with Shadow Sneak.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}, {"user_id": 635656, "username": "Elvira"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 321991, "username": "Mateeus"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 594478, "username": "ken"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Excadrill": {
    "sets": {
      "Swords Dance (Ground)": {
        "description": "<p>Having multiple ways to boost its Speed and holding a nearly unresisted STAB combination, Excadrill is a potent setup sweeper for Ground-type sand teams, as it can take advantage of forced switches by posing as its Choice Band set. Corkscrew Crash lets Excadrill overwhelm multiple checks, OHKOing Tornadus-T when unboosted; Sinistcha, Mega Latias, and Mega Sableye at +2; and Mega Venusaur at +2 after Stealth Rock damage. Rapid Spin lets Excadrill compress utility by removing entry hazards for its team while also raising its Speed; Rapid Spin is also a good move to finish foes off to make Excadrill more difficult to revenge kill. Excadrill appreciates Hippowdon, which is a sand setter required to easily enable Sand Rush. Excadrill can struggle against Water-types that are immune to Ground such as Rotom-W and Pelipper, so it appreciates Gastrodon and Clodsire as allies to pivot to; in turn they can support Excadrill by setting entry hazards or crippling the aforementioned foes with status. Flying-types such as Mega Charizard Y, Zapdos, and Skarmory can also be problematic for Excadrill to deal with, so checks such as Mega Garchomp and Mamoswine are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Whimsicott": {
    "sets": {
      "Utility (Grass)": {
        "description": "<p>Whimsicott is a unique and effective pivot option for Grass teams by virtue of its Prankster ability and many viable support moves. U-turn provides Whimsicott with a means to pivot into another teammate in order to maintain momentum. Alternatively, Knock Off can be used over U-turn to take advantage of Encore forcing switches by providing important item removal. The given EV spread makes Whimsicott as fast as possible while maximizing the damage of its Moonblast, letting it 2HKO Mega Sableye and Mandibuzz, and OHKO pokemon like Iron Valiant. Heavy-Duty Boots allows Whimsicott to switch in several times per match without being worn down by entry hazards. Ferrothorn is an excellent partner, since its Steel typing lets it wall Poison- and Steel-type attacks that threaten Whimsicott, and its entry hazards also pair well with Whimsicott's ability to force switches. Celebi is an excellent partner for Whimsicott thanks to its ability to threaten Poison and Steel teams that can make Whimsicott's opportunities to switch in very limited. Ogerpon-C benefits greatly from Whimsicott clearing away hazards so that it can make use of Sturdy to tank a hit it otherwise can't, and it appreciates Encore to help create setup opportunities. A Sunny Day set with Heat Rock can turn Whimsicott into a makeshift sun setter for teams that utilize Chlorophyll sweepers like Venusaur, Hisuian Lilligant, and Scovillain.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 582231, "username": "DimLug"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 572981, "username": "Aera"}]}]}
  },
  "Darmanitan-Galar": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Galarian Darmanitan easily applies offensive pressure thanks to the sheer damage output of its moves and Speed with the combo of Gorilla Tactics + Choice Scarf, allowing it to act as a potent revenge killer and wallbreaker for Ice teams. Flare Blitz provides coverage against Steel-types including Corviknight and Ferrothorn. Earthquake further complements Galarian Darmanitarian's moveset to provide nearly unresisted coverage alongside its STAB Icicle Crash, OHKOing Fire-types that resist its other moves such as Ceruledge and Heatran. U-turn allows Galarian Darmanitan to gain momentum on predicted switches and wears down checks over time. As Galarian Darmanitan can struggle with Water-types such as Toxapex, Slowbro, and Araquanid, Kyurem and Alolan Ninetales make for formidable partners, as they hit these foes super effectively with Freeze-Dry and can take advantage of their passivity to apply further pressure on the opposing team. Getting Choice locked into the wrong move often forces Galarian Darmanitan to switch out; therefore, Piloswine and Articuno act as defensive partners to resort to in such scenarios. Articuno and Cloyster can provide entry hazard control to mitigate Galarian Darmanitan's weakness to Stealth Rock, raising its longevity, with the former also providing pivoting to ease Galarian Darmanitan's entry into the field. Other offensive partners such as Weavile and Cetitan can complement Galarian Darmanitan in applying offensive pressure to overwhelm opposing walls and potentially sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Zoroark-Hisui": {
    "sets": {
      "Z-Happy Hour (Ghost)": {
        "description": "<p>With a Ghost immunity, Hisuian Zoroark covers a crucial weakness for its team and makes use of it alongside Illusion to bluff as any of its allies efficiently and gain opportunities to set up and sweep. Focus Blast is unresisted alongside Shadow Ball and hits Dark-types that could be difficult to answer otherwise such as Hydreigon and Mega Tyranitar. Hyper Voice provides a complementary STAB option that shines in neutral matchups, 2HKOing Mega Venusaur and Toxapex after a boost, but Flamethrower complements Focus Blast to hit Steel-types such as Corviknight and Scizor. Hisuian Zoroark's sole weakness to Dark can lure in checks that can threaten a good portion of its team such as Alolan Muk and Mandibuzz. Mega Sableye is a good partner to check them in turn, and it can also prevent entry hazards from being set on its side with Magic Bounce to increase Hisuian Zoroark's longevity and allow it to bluff with Illusion further. Mimikyu discourages Dark-type attacks thanks to its Fairy typing, giving a safe option for Hisuian Zoroark to bluff as with Illusion, and an intact Disguise also lures the opposing team to expect setup and either bring in a physical wall or use utility moves such as Taunt and Will-O-Wisp that don't hinder Hisuian Zoroark as much they would Mimikyu, easing setup. Hisuian Zoroark's Illusion in general can be used to bluff as other Pokemon to lure counterplay to them that it exploits; for example, as Gholdengo, it can discourage status moves by pretending to have Good as Gold, and as Sinistcha, it can revenge kill unsuspecting foes that would normally outspeed Sinistcha.</p>"
      },
      "Z-Happy Hour (Normal)": {
        "description": "<p>Hisuian Zoroark provides defensive utility relevant to its team by being immune to Fighting, allowing it to easily pose as any of its allies with Illusion to find setup opportunities and sweep. Focus Blast and Shadow Ball provide unresisted coverage, allowing Hisuian Zoroark to defeat checks such as Mega Tyranitar, Heatran, and Hydreigon. Flamethrower hits foes it wouldn't OHKO otherwise, even after a boost, such as Ferrothorn, Corviknight after minimal chip, and opposing Hisuian Zoroark. Flamethrower alongside Focus Blast considerably eases the Steel matchup for its team, but Hyper Voice is an alternative that deals the most damage in neutral matchups, OHKOing Tapu Koko and Tornadus-T at +1 after Stealth Rock. Hyper Voice can also be used to trigger Breakneck Blitz over Z-Happy Hour to allow Hisuian Zoroark to lure in and overwhelm foes such as Keldeo, Hisuian Lilligant, and Landorus in a pinch. As Hisuian Zoroark lures in Dark-types to check it, Mega Lopunny is a solid partner to keep momentum against such foes, especially as Hisuian Zoroark can bluff as Mega Lopunny more effectively than other teammates, as both hold an item that cannot be removed by Trick or Switcheroo. Mega Lopunny also pressures special walls that Hisuian Zoroark can otherwise struggle with, such as Mega Sableye, Blissey, and Alolan Muk. Entry hazard control by Staraptor is also valuable to ensure Hisuan Zoroark's bluffing capabilities and raise its longevity; Staraptor can also provide a slow pivot to let Hisuian Zoroark come in safely. Chansey and Blissey can set Stealth Rock to let Hisuian Zoroark more easily threaten a sweep and can support it by providing safe pivoting for it with Teleport. In particular, it is easier for Hisuian Zoroark to disguise as Chansey due to a shared vulnerability to entry hazards.</p>"
      },
      "Choiced Attacker (Ghost)": {"description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Utility (Ghost)": {"description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Utility (Normal)": {"description": "<p>This is a sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 635656, "username": "Elvira"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Galvantula": {
    "sets": {
      "Sticky Web (Bug)": {
        "description": "<p>Galvantula serves as an excellent Sticky Web lead, supporting its offensive team members with speed control. Thunder in conjunction with Compound Eyes gives Galvantula an offensive presence, takes on opposing hazard-setting leads, threatens paralysis, and dents Water- and Flying-types. Energy Ball threatens bulky Ground-types like Great Tusk, Hippowdon, Swampert, and Gastrodon. Hidden Power Ice deals with Flying- and Dragon-types like Gliscor, the Landorus formes, Garchomp, and Dragonite. Thunder Wave can be used over Hidden Power Ice to paralyze setup sweepers and fast threats that can't be effectively slowed down with Sticky Web, most notably Dragonite, Galarian Zapdos, Mega Aerodactyl, opposing Mega Pinsir, and Volcarona, without having to rely on Thunder to do so. This comes at the cost of losing coverage against Pokemon that resist both Thunder and Energy Ball, however. Sticky Web lowers the amount of Quiver Dance boosts needed for Volcarona to outspeed Regieleki, Unburden Sneasler, and Sand Rush Excadrill, making its setup more efficient. Sticky Web also allows choice Scarf users like Kleavor and Buzzwole to outspeed those Pokemon, limiting the amount of revenge killing options against them and improving their effectiveness against Fire- and Rock-types by taking care of Choice Scarf Blacephalon, Hisuian Arcanine, and Iron Boulder. Sticky Web gives Mega Pinsir more opportunities to use Return instead of Quick Attack to increase its damage output or Earthquake to KO Pokemon that would usually threaten it like Choice Scarf Nihilego and Hisuian Arcanine. Scizor can OHKO or force Diancie out before it can Mega Evolve to allow Galvantula to set up Sticky Web against Fairy- and Rock-teams.</p>"
      },
      "Agility (Bug)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 670267, "username": "Jópie Trópí"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}, {"name": "Quality checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Ferrothorn": {
    "sets": {
      "Entry Hazard Wall (Grass)": {
        "description": "<p>Ferrothorn is a highly reliable wall in Grass teams, boasting good defensive stats, recovery, and an immunity to Poison. It's an incredible asset for Grass teams, as it can manage notable threats such as Kyurem, Tapu Lele, and Melmetal. Gyro Ball capitalizes on its low Speed and threatens Fairy-types and fast foes like Alolan Ninetales and Tapu Lele. However, Iron Head provides more consistent damage against slower foes like Hatterene and is less susceptible to PP stalling, which is particularly useful against Kyurem if Ferrothorn isn't running Body Press. Depending on its teammates, Ferrothorn can opt for Stealth Rock or Spikes, as Cradily can also set up Stealth Rock, while Meowscarada has access to Spikes and Toxic Spikes. With the combination of Leech Seed and Leftovers, Ferrothorn gains substantial recovery each turn, enabling it to wear down and punish switch-ins such as Heatran, Aegislash, and Nidoking. Protect serves as a scouting tool and extends the benefits of Leech Seed and Leftovers, while Body Press allows Ferrothorn to utilize its high Defense and deal significant damage to Steel- and Dark-types, like Melmetal and Weavile. When in conjunction with Gyro Ball, Body Press ensures that Substitute Kyurem won't be able to PP stall Ferrothorn, and when used with Iron Head, it guarantees an OHKO against Weavile. The featured EV spread both prevents a 2HKO from Choice Band Weavile's Icicle Crash and lets Ferrothorn almost always beat SubRoost Kyurem.</p> <p>Ferrothorn forms a formidable defensive core with Mega Venusaur, as the latter's typing and ability enable it to come in on Fighting- and Ice-types such as Iron Valiant, Iron Moth, and Galarian Darmanitan. Additionally, Mega Venusaur's Sludge Bomb can poison foes, allowing Ferrothorn's combination of Leech Seed and Protect to wear them down more quickly. Cradily is another valuable partner, providing natural special bulk and a favorable matchup against Blacephalon and Nidoking. Offensive partners such as Rillaboom, Meowscarada, Iron Leaves, and Zarude greatly appreciate Ferrothorn weakening the opposing team with entry hazards and Leech Seed. In return, Rillaboom sets up Grassy Terrain for additional recovery and provides strong priority damage, while Choice Scarf Meowscarada can revenge kill threats such as boosted Kommo-o. Whimsicott and Celebi handle Fighting-types such as Iron Valiant and Kommo-o, which would otherwise pose a threat to Ferrothorn. Whimsicott also punishes setup sweepers like Volcarona or Mega Scizor, which could otherwise use Ferrothorn as setup fodder, while Celebi helps ease the Poison matchup, as well as the Steel matchup in a pinch.</p>"
      },
      "Hazard Setter (Steel)": {
        "description": "<p>As a check to Water- and Ground-types that can support its team with a wide variety of utility options, Ferrothorn is a notable defensive asset for Steel teams. Protect allows Ferrothorn to maximize the HP it gains per turn between Leftovers and Leech Seed, as well as easing prediction against Choice-locked foes such as Enamorus, Galarian Darmanitan, and Hisuian Arcanine. Power Whip minimizes passivity against the foes it's meant to check, notably OHKOing Mega Swampert and Gastrodon. Knock Off provides utility by removing Heavy-Duty Boots from foes such as Volcarona, Mantine, and Victini, leaving them vulnerable to the entry hazard stacking that is characteristic of Steel teams. The given EV spread with a Careful nature avoids a 2HKO from Landorus's Earth Power, with the rest invested in Defense to ease checking foes such as Mega Swampert, Ogerpon-W, and Mega Aerodactyl. The alternate EV spread with an Impish nature instead maximizes physical bulk, notably avoiding a 2HKO from Ogerpon-C's Low Kick. As Ferrothorn is easy to force out by Fire-type moves, Heatran is a solid partner to make a defensive core with it, especially because it can also set Stealth Rock, allowing Ferrothorn to run Spikes to hazard stack further; this can be further complemented with a check to Fighting-types in Gholdengo, which keeps entry hazards set by Ferrothorn on the other side of the field by blocking hazard removal. Offensive Pokemon such as Mega Scizor and Excadrill benefit from Ferrothorn wearing down and hindering the opposing team for a late-game sweep, mitigating Ferrothorn's passivity issues. Chople Berry is a niche alternative over Leftovers, as it enables Ferrothorn to withstand an attack from Fighting-types such as Keldeo and Urshifu-R, then KO back with Power Whip.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 547532, "username": "Swiffix"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 623713, "username": "Don Bork"}]}, {"name": "Quality checked by", "members": [{"user_id": 305839, "username": "maroon"}, {"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Mandibuzz": {
    "sets": {
      "Physically Defensive (Dark)": {
        "description": "<p>As a check to physical attackers with multiple utility options, Mandibuzz is a characteristic component for defensive backbones in Dark teams. Foul Play minimizes passivity, notably 2HKOing all Ogerpon formes, offensive Mega Scizor, Excadrill, and +6 Azumarill. U-turn lets Mandibuzz gain momentum by safely leaving potentially unfavorable matchups, bringing in checks that could struggle to switch in otherwise. Toxic lets Mandibuzz hinder entry hazard setters such as Ting-Lu, Araquanid, and Great Tusk, easing the use of Defog. Brave Bird hits some foes its team can otherwise struggle with, for example, OHKOing Hisuian Lilligant and 2HKOing Tapu Bulu and Buzzwole. The given EV spread allows Mandibuzz to outspeed Adamant Azumarill, with the rest invested in physical bulk to better handle foes such as Dragonite, Mega Lopunny, and Mega Scizor. Ting-Lu can switch into Electric- and Rock-types that can easily force out Mandibuzz like Tapu Koko, Zapdos, and Hisuian Arcanine. Alolan Muk can also further complement a defensive core, as it mitigates a weakness to Fairy-types such as Iron Valiant, Mega Diancie, and Mega Altaria. Offensive Pokemon such as Weavile, Meowscarada, and Hydreigon benefit from Mandibuzz's utility, mitigating its passivity issues.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Hydreigon": {
    "sets": {
      "Nasty Plot (Dark)": {
        "description": "<p>Hydreigon is a threatening wallbreaker for Dark teams due to its high Special Attack stat, colorful coverage options, and a great ability in Levitate, which allows it to dominate Steel, Poison, Ground, and rainless Water matchups. Draco Meteor in tandem with Dragonium Z allows Hydreigon to OHKO Archaludon without a boost, outright OHKO physically defensive Ting-Lu and Alolan Muk at +2, and OHKO Hisuian Goodra at +2 after a layer of Spikes. Flamethrower threatens Steel-types like Ferrothorn, Mega Scizor, and Celesteela. Substitute provides safety against status moves from defensive Pokemon like Toxapex, Gliscor, and Ferrothorn, allowing Hydreigon to set up freely. Earth Power targets foes like Toxapex, Archaludon, Alolan Muk, and non-Air Balloon Heatran. Ting-Lu is a great partner, providing entry hazard support that makes it easier for Hydreigon to break through bulky foes, most notably allowing it to OHKO Assault Vest Iron Hands with a +2 Devastating Drake. It can also handle Volcarona with Rock Slide. Alolan Muk can handle Fairy-types like Tapu Koko, Tapu Lele, and Clefable, and, in return, Hydreigon provides a Ground immunity and threatens foes like Hippowdon. Mega Sableye provides a Fighting immunity and can cripple foes like Mega Gallade, Great Tusk, and Iron Hands with Will-O-Wisp. Additionally, Mega Sableye can use Metal Burst to get a surprise OHKO on Mega Diancie. Weavile is able to break through special walls like Blissey, Clodsire, and Alolan Muk. Choice Scarf Meowscarada revenge kills faster threats like Iron Valiant, Greninja, and Roaring Moon. In return, Hydreigon deals with physical walls like Ferrothorn, Archaludon, Skarmory, and Toxapex for them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 594972, "username": "Murphy Lawden"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Volcarona": {
    "sets": {
      "Offensive Quiver Dance (Bug)": {
        "description": "<p>Volcarona is one of Bug's strongest setup sweepers, with a respectable Speed stat, high Special Attack, and great coverage. In addition to being one of very few special attacking options on Bug, Volcarona helps apply pressure in a variety of matchups thanks to its strong STAB moves and coverage. Fire Blast can be used over Fiery Dance for more immediate damage output. Giga Drain deals with Water- and Ground-types, most notably Swampert, Gastrodon, and Rotom-Wash. Bug Buzz can be used instead for Volcarona to overwhelm types like Dragon, Dark, and Psychic with Quiver Dance-boosted STAB attacks. Hidden Power Ground hits Heatran, allowing Volcarona to break Steel's immunity-based defensive core that can otherwise give Bug teams problems. Alternatively, Psychic can be used to damage bulky Poison-types, like Toxapex and Mega Venusaur, that can wall physical attackers like Heracross and Buzzwole. These physical attackers, in addition to Lokix and Scizor, are able to break through specially defensive walls, like Chansey and Mantine, that Volcarona struggles against. Araquanid and Armaldo provide helpful entry hazards in Sticky Web and Stealth Rock, respectively, to make sweeping mid- or late-game much easier.</p>"
      },
      "Offensive Quiver Dance (Fire)": {
        "description": "<p>Volcarona is one of the top setup sweepers that Fire has access to, with Quiver Dance allowing it to become a dangerous threat to teams unequipped to deal with it defensively. Psychic allows Volcarona to pressure Fighting and Poison teams, especially after one Quiver Dance, which lets Volcarona outspeed and beat Keldeo, Glimmora, and Crobat. Similarly, Giga Drain does the same to Water and Ground teams after one Quiver Dance, threatening Tapu Fini, Gastrodon, and Hippowdon. Bug Buzz covers the Psychic and Dark matchups very well and allows it to hit Roaring Moon, Ting-Lu, and Latias, which would otherwise be a challenge to deal with. Heavy-Duty Boots prevents Volcarona from being worn down by entry hazards, most notably Stealth Rock, which would otherwise stop Volcarona from being able to set up safely. Psychium Z lets Volcarona OHKO Toxapex with a +1 Shattered Psyche and beat otherwise troublesome threats like +1 Kommo-o, Iron Hands, and Clodsire. Cinderace and Mega Charizard X are especially good partners due to their ability to break through special walls such as Blissey, Clodsire, and Galarian Slowking with relative ease. Entry hazard removers such as Torkoal, Rotom-H, and Court Change Cinderace are near necessities if Volcarona is running Psychium Z. Torkoal and Rotom-H can also provide excellent utility in the form of Stealth Rock and dual screens, respectively, to help Volcarona sweep more easily. Volcanion is also an excellent partner for Volcarona that, thanks to its Water immunity, can act as a strong pivot into Pokemon like Azumarill and Mantine, which could revenge kill it or clear Quiver Dance boosts with Haze.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537941, "username": "style.css"}, {"user_id": 610704, "username": "Captainbruh1008"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 532439, "username": "Bka Onon"}, {"user_id": 321991, "username": "Mateeus"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 461329, "username": "Estarossa"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Cobalion": {"sets": {"Utility (Fighting)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Terrakion": {
    "sets": {
      "Choice Scarf (Rock)": {
        "description": "<p>Terrakion is the ideal Choice Scarf user for Rock teams due to its high Speed stat and access to powerful coverage moves in Earthquake and Close Combat. Close Combat provides coverage against Steel-, Normal-, and Dark-types such as Heatran, Mega Lopunny, and Greninja. Earthquake does heavy damage against Electric-types such as Zeraora and Tapu Koko as well as against Poison-types like Toxapex and Clodsire. Poison Jab is able to pressure Grass- and Fairy-types that Rock teams struggle to deal with, being able to OHKO Tapu Bulu and Whimsicott as well as deal high amounts of damage to Azumarill and Tapu Lele. Choice Scarf allows Terrakion to be an amazing revenge killer, outspeeding threats like Mega Lopunny and Zeraora. Terrakion pairs well with Shuckle, as its Stealth Rock and Sticky Web support allows Terrakion to net more KOs and outspeed faster Pokemon like Regieleki, Choice Scarf Meowscarada, and Adamant Barraskewda under rain. Terrakion also pairs well with Mega Diancie, which softens the likes of Great Tusk, Corviknight, and Toxapex for Terrakion thanks to its coverage. Alolan Golem helps Terrakion with the Steel matchup by trapping Pokemon such as Mega Scizor, Corviknight, and Celesteela with its ability Magnet Pull. Nihilego is able to help with the Fairy matchup with Sludge Wave dealing big damage to Pokemon such as Tapu Fini and Clefable. Tyranitar helps Terrakion by setting up sand, which boosts Terrakion's Special Defense stat, allowing it to survive Surf from Choice Scarf Greninja and Dazzling Gleam from Tapu Koko. Tyranitar also provides Pursuit support against faster Choice Scarf users such as Latias while also being able to break walls for Terrakion, allowing it to clean teams more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 623713, "username": "Don Bork"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 493772, "username": "Lumii"}]}]}
  },
  "Tornadus-Therian": {
    "sets": {
      "Nasty Plot Wallbreaker": {
        "description": "<p>A colorful movepool, a great Speed tier, and Regenerator make Tornadus-T one of Flying's best wallbreakers. Bleakwind Storm can be used if Tornadus-T is paired with Mega Charizard Y, as its accuracy is not affected by sun. Focus Blast grants Tornadus-T excellent neutral coverage and is able to hit most Steel- and Rock-types, like Heatran and Tyranitar, hard. Heat Wave, however, has the benefit of nailing Jirachi, Gholdengo, and Corviknight, which makes it a better option against Psychic, Ghost, and, if using Knock Off, Steel teams. In the last slot, Taunt is preferred, so Tornadus-T can safely set up on walls like Toxapex and Ting-Lu, but Knock Off's ability to cripple the likes of defensive Heatran and Galarian Slowking is worth considering. Tornadus-T has a very poor matchup against Electric-types, so Pokemon that can deal with them, such as Landorus-T and Gliscor, are must-haves. They're also able to lay down Stealth Rock and have access to Defog, making them incredible teammates. Similarly, Corviknight and Celesteela stomach most Ice-type attacks aimed at Tornadus-T, thanks to their bulk and Steel typing. Mega Charizard Y forms a terrifying wallbreaking duo alongside Tornadus-T that breaks down shared checks such as Heatran and Blissey. Setup sweepers like Dragon Dance Dragonite and Agility Thundurus-T greatly appreciate Tornadus-T weakening or removing walls for them. 88 HP and 8 Special Defense EVs can be used over Special Attack to ensure Tornadus-T lives an Ice Beam from Choice Scarf Greninja from full health.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 321991, "username": "Mateeus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 547532, "username": "Swiffix"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Thundurus-Therian": {
    "sets": {
      "Electrium Z (Flying)": {
        "description": "<p>Thundurus-T makes for a great setup sweeper on Flying teams thanks to its access to Agility, high Special Attack, and great coverage. Hidden Power Ice forms a great BoltBeam combination with Thunderbolt, threatening Ground-types such as the Landorus formes, Gliscor, and Garchomp, with the removal of the former two allowing it to sweep Flying teams late-game. Grass Knot handles certain Ground-types better than Hidden Power Ice such as Great Tusk, Gastrodon, and physically defensive Ting-Lu. Agility allows Thundurus-T to outspeed and threaten normally faster foes such as Iron Valiant, Enamorus, and rain-boosted Mega Swampert. Gigavolt Havoc allows Thundurus-T to immediately remove bulky threats such as Rotom-W, Hatterene, and Mega Gallade as well as hindrances to its sweep like specially defensive Celesteela, Toxapex, and Ogerpon-W. Gliscor and Landorus make for great partners, as they alleviate pressure from Thundurus-T, cover the Electric matchup, and set up entry hazards. Additionally, Gliscor provides pivoting via U-turn and removes items such as Heavy-Duty Boots from Dragonite and Zapdos, while Landorus's coverage allows it to cover threats such as Mega Charizard X, Tyranitar, and Tapu Bulu. Entry hazard removal from Corviknight and Mantine is appreciated by Thundurus-T due to its vulnerability to Stealth Rock. Additionally, Corviknight and Celesteela handle Fairy- and Rock-types like Tapu Bulu, Mega Diancie, and Iron Boulder. Early-game wallbreakers such as Tornadus-T and Mega Charizard Y remove walls that Thundurus-T struggles with such as Mega Venusaur and Ferrothorn. In return, they appreciate Thundurus-T's Electric immunity. Choice Scarf Enamorus provides great speed control, with it potentially being able to sweep through Dragon and Dark teams that lack a proper answer; it also provides Healing Wish support to potentially re-enable a sweep from Thundurus-T. In return, it handles Steel-types for Thundurus-T like Corviknight and Mega Scizor. Thundurus-T's ability to threaten walls such as Toxapex, Great Tusk, and Ting-Lu can also enable other sweepers like Dragonite, Mega Aerodactyl, and Galarian Moltres to start a sweep of their own.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Landorus": {
    "sets": {
      "Gravity (Ground)": {
        "description": "<p>Due to its potent ability, admirable offensive stats, and great coverage, Landorus cements itself as a staple wallbreaker on Ground teams. Sludge Wave hits Grass-types like Tapu Bulu and Celebi as well as other Fairy-types such as Tapu Lele and Clefable, easing the Fairy and Grass matchups due to unresisted coverage. Focus Blast breaks through Kyurem, Ting-Lu, and Ferrothorn. Rock Polish enables Landorus as a late-game cleaner, shutting down revenge killing abilities from faster foes like Tapu Koko, Choice Scarf Galarian Darmanitan, and Greninja, while Nasty Plot allows Landorus to easily break past the likes of Blissey and Mega Sableye and become terrifying with Gravity-aided Earth Power spam. Rock Slide is another option to hit Volcarona, as it is dangerous once set up, as well as Mantine, Zapdos, and Araquanid; however, using it is very situational and forces Landorus to use an unpreferred nature. Gravity allows Landorus to ease the Flying and Steel matchups and easily spam Earth Power, increasing its potential to new heights and also supporting its teammates like Choice Band Sand Rush Excadrill. Gastrodon is a great teammate due to its ability to soak up Water-type moves from foes like Barraskewda and Mega Swampert, while Gastrodon appreciates Landorus's ability to threaten Grass-types with Sludge Wave. Mamoswine is heavily valued as a sponge for Ice-type moves due to its ability Thick Fat, taking on SubRoost Kyurem and Alolan Ninetales. In return, Mamoswine cleans up Flying teams once Landorus deals with Celesteela, Corviknight, or Skarmory. Choice Scarf or Bulk Up Great Tusk forms a great wallbreaking core, taking out threats like Triple Axel Mega Lopunny and Dragonite, while also appreciating Gravity support. Clodsire provides entry hazards to chip down walls for Landorus, switches into revenge killers like Meowscarada and Tapu Koko, and counters Volcarona with Unaware so Landorus doesn't need to use Rock Slide. Mega Steelix is valued in the Ice and Fairy matchups, taking on Alolan Ninetales, Tapu Koko, Azumarill, and Weavile. Mega Garchomp and Garchomp threaten specially defensive walls like Slowking, Blissey, and Mantine while also providing a Water neutrality with decent defensive stats.</p>"
      },
      "Wallbreaker (Flying)": {
        "description": "<p>By virtue of its STAB moves, coverage options, and helpful ability in Sheer Force, Landorus makes for a great wallbreaker, matching up well against Dragon, Electric, and Psychic teams and handling the likes of Raging Bolt and Kyurem. Focus Blast targets Dark- and Ice-types like Hydreigon, Piloswine, and Kyurem and can 2HKO switch-ins like Rotom-W, Skarmory, and Ferrothorn. Alternatively, Rock Slide in tandem with a neutral nature and 4 Attack EVs can be used to target Flying- and Bug-types such as Mega Charizard Y, Zapdos, and Volcarona; it also breaks Gholdengo's Air Balloon and hits Ice-types more accurately than Focus Blast. Sludge Wave takes on Grass- and Fairy-types such as Tapu Bulu and Celebi. Stealth Rock wears down incoming foes so that Landorus and its teammates can wallbreak and sweep more efficiently, and it breaks Sturdy from Ogerpon-C. Alternatively, Rock Polish allows Landorus to serve as a cleaner as well by outspeeding and threatening Choice Scarf Weavile, Greninja, and Meowscarada. Tornadus-T makes for a great teammate, taking on problematic Grass- and Fighting-types such as Ogerpon-C, Hisuian Lilligant, and Mega Gallade. Corviknight and Mantine both remove Stealth Rock with Defog so Landorus has an easier time switching in. Corviknight also threatens Ice-types such as Weavile and Alolan Ninetales and provides slow pivoting with U-turn, while Mantine fares well against Water-types like Barraskewda and Mega Swampert. Mega Aerodactyl not only threatens Ice-types, but its coverage also allows it to threaten opposing Landorus, Garchomp, and Tornadus-T; it can also run Stealth Rock so Landorus can run Rock Polish instead. Landorus's wallbreaking opens up sweeping opportunities for Galarian Moltres and Dragonite, which appreciate the removal of their checks such as Alolan Muk and Iron Hands.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}, {"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 547532, "username": "Swiffix"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Landorus-Therian": {
    "sets": {
      "Choice Scarf (Flying)": {
        "description": "<p>Choice Scarf Landorus-T is one of the best revenge killers Flying teams have access to, outrunning threats like Tapu Koko, Mega Diancie, and Terrakion while boasting great firepower. It's also very desirable thanks to its defensive traits, which include an immunity to Electric-type attacks and Intimidate. U-turn takes advantage of the switches Landorus-T forces, allowing it to pivot out of walls that come in on it such as Corviknight and Mega Venusaur. Similarly, Knock Off cripples some of the bulky Pokemon it invites in, like Porygon2 and Ferrothorn, by removing their items. Stone Edge notably hits Kyurem the hardest and is Landorus-T's best move versus Flying-types like Zapdos and Pelipper. Alternatively, Explosion lets Landorus-T score a surprise KO against an offensive threat it normally cannot OHKO, such as Keldeo or Mega Lopunny. Special wallbreakers like Galarian Moltres, Tornadus-T, and Mega Charizard Y are great partners to deal with the aforementioned physical walls Landorus-T draws in. Thundurus-T relieves pressure from Landorus-T by acting as a secondary Electric immunity and is a great asset against the Water and Flying teams Landorus-T can't do much to. Mega Aerodactyl is able to form a powerful revenge killing core alongside Landorus-T while providing Stealth Rock support for it to clean teams more easily. Corviknight switches into most Ice-type attacks aimed at Landorus-T, removes Stealth Rock with Defog, and is able to bring Landorus-T safely onto the field via its slow U-turn.</p>"
      },
      "Bulk Up (Ground)": {"description": "<p>Ferrothorn's Power Whip does not break Substitute at +1 Def or -1 Atk from Intimidate.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 321991, "username": "Mateeus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Kyurem": {
    "sets": {
      "Choice Specs (Dragon)": {
        "description": "<p>Choice Specs Kyurem is a terrifying wallbreaker with an impeccable STAB combination and coverage movepool, beating threats to Dragon teams like Toxapex, Dragonite, and Mamoswine. Draco Meteor is Kyurem's most powerful move, notably wearing down typical switch-ins like Mega Sableye and Volcarona. Freeze-Dry is highly effective in the Water matchup by answering would-be checks like Swampert, Gastrodon, and Slowking. Focus Blast catches Ferrothorn and Tyranitar off guard should they expect a STAB move, while Earth Power hits Alolan Muk, Galarian Slowking, and Heatran for more damage. Mega Altaria is heavily appreciated as an answer to Dragon-types like Kommo-o, Roaring Moon, and Walking Wake. Garchomp provides entry hazards like Stealth Rock and Spikes to ease Kyurem's wallbreaking. Latias checks Fighting-types such as Iron Hands, Galarian Zapdos, and Terrakion, is able to replenish Kyurem's health with Healing Wish, and removes troublesome entry hazards—especially Stealth Rock, given Kyurem's Rock weakness—with Defog. Dragalge sets up Toxic Spikes and checks Fairy-types like Tapu Koko and Clefable. Kommo-o checks Steel-types like Heatran and defensive Celesteela and blocks attempts to set hazards with Taunt.</p>"
      },
      "Substitute + Roost (Ice)": {
        "description": "<p>Kyurem is a stellar stallbreaker for Ice teams by utilizing Pressure, Substitute, and Roost to beat or force out walls such as Toxapex, Ferrothorn, and Mega Sableye. Kyurem's good bulk and typing also allow it to function as a defensive pivot, consistently checking threats like Heatran, Rotom-W, and Rillaboom. Moreover, it shrugs a hit from and beats the likes of Galarian Zapdos and Urshifu-R one-on-one if using a Chople Berry. Freeze-Dry lands a strong hit on Water-types like Toxapex and Gastrodon, turning Kyurem into a valuable asset in that matchup. Alongside it, Earth Power grants Kyurem near-perfect neutral coverage by nailing Steel- and Fire-types such as Magnezone and Skeledirge. The given EV spread allows Kyurem's Substitute to live one Seismic Toss from Blissey. Alolan Ninetales provides Snow and Aurora Veil support, bolstering Kyurem's defensive utility while preventing Celesteela and Heatran from breaking its Substitute. Defensive Cloyster is able to remove entry hazards with Rapid Spin, set up Spikes to help Kyurem stallbreak more easily, and switch into physical Steel-type attacks from Mega Scizor and Melmetal. Similarly, Piloswine lays down Stealth Rock and deals with Fire- and Rock-types that Kyurem loses to, such as Volcarona and Mega Diancie. Setup sweepers like Swords Dance Weavile and Shell Smash Cloyster greatly appreciate Kyurem wearing down walls so they can clean up late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}, {"user_id": 321991, "username": "Mateeus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 593863, "username": "CrossHeart"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 493260, "username": "Marnie"}]}]}
  },
  "Keldeo": {"sets": {"Calm Mind (Water)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Choice Specs (Fighting)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Greninja": {
    "sets": {
      "Choice Scarf (Water)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Choice Specs (Water)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Choice Specs (Dark)": {
        "description": "<p>Choice Specs Greninja is one of Dark's best wallbreakers thanks to its amazing Speed and coverage, which is further boosted by Protean. Hydro Pump targets Fire-, Rock-, and Ground-types like Torkoal, Heatran, Mega Diancie, and Hippowdon. Sludge Wave threatens Grass- and Fairy-types such as Tapu Bulu, Mega Altaria, and non-Choice Scarf Iron Valiant. Alternatively, Dark Pulse nails Ghost- and Psychic-types such as Gholdengo, Hisuian Zoroark, and Slowbro, while Trick lets Greninja weaken special walls that it cannot threaten otherwise like Alolan Muk, Hisuian Goodra, and Blissey. Sludge Wave is the preferred option out of the three, however, due to nailing threats that many of Greninja's teammates struggle with like Ogerpon-W and non-Choice Scarf Tapu Lele. Ice Beam allows Greninja to handle Dragon- and Flying-types like Garchomp, Mega Latias, and the Landorus formes. Extrasensory targets Poison- and Fighting-types like Toxapex, Mega Venusaur, Okidogi, and Keldeo. Choice Scarf Meowscarada provides speed control and forms a Protean core with Greninja, with it outspeeding and taking on Swampert, Choice Scarf Roaring Moon, and Choice Scarf Iron Valiant. Ting-Lu sets up entry hazards to aid Greninja's wallbreaking, giving Greninja a good chance to OHKO Latias after Stealth Rock damage, and it also handles Steel-types such as Excadrill, Gholdengo, and Iron Crown. Furthermore, it provides an Electric immunity, which allows it to take on Electric-types like Tapu Koko, terrain-boosted Alolan Raichu, and Zeraora. Choice Scarf Hydreigon, Mandibuzz, and Galarian Moltres aid Greninja in the Ground matchup due to their immunities. Hydreigon also deals with Choice Scarf Gholdengo and Choice Scarf Kleavor with its STAB moves; Mandibuzz removes entry hazards with Defog and pivots Greninja in with U-turn; and Galarian Moltres can sweep late-game with Agility and Nasty Plot after Greninja wallbreaks. Alolan Muk's great special bulk helps Greninja deal with Fairy-types like Tapu Koko, Tapu Lele, and Enamorus. In return, Alolan Muk appreciates Greninja taking on Ground-types like Great Tusk and Garchomp. Greninja's wallbreaking opens the door for sweeping and cleaning opportunities from the likes of Galarian Moltres and Weavile.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}, {"name": "Quality checked by", "members": [{"user_id": 635656, "username": "Elvira"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Diggersby": {"sets": {"Swords Dance (Normal)": {}, "Choice Band (Normal)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Dragalge": {"sets": {"Specially Defensive (Dragon)": {"description": "<p>24 Speed IVs lets Dragalge underspeed Toxapex</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Goodra-Hisui": {
    "sets": {
      "Specially Defensive (Dragon)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "AcidPress (Dragon)": {
        "description": "<p>Hisuian Goodra is a potent defensive backbone for Dragon teams, as thanks to its great typing and defensive stats, it acts as both a solid check to opposing Dragon-, Fairy-, and Ice-types and a special wall to foes such as Kyurem, Tapu Lele, and Mega Latias. Its IronPress combination also lets it act as a win condition. Protect raises Hisuian Goodra's longevity by letting it heal further with Leftovers and scout for super effective coverage from foes, but Rest can be used instead for further longevity at the cost of even more passivity; this can be mitigated with Chesto Berry, however. Shell Armor prevents foes from breaking past Hisuian Goodra's Defense boosts with a critical hit, but Sap Sipper provides an immunity to Leech Seed from foes such as Ferrothorn, Celesteela, and Mega Venusaur. As Hisuian Goodra can struggle with Fighting- and Ground-types such as Great Tusk, Mega Swampert, and Mega Lopunny, Mega Altaria and Latias make for good partners to check them, making a defensive core with Hisuian Goodra. This Hisuian Goodra set can struggle with Ghost-types such as Gholdengo, Ceruledge, and Mega Sableye, so partners such as Kommo-o, Garchomp, and Roaring Moon mitigate Hisuian Goodra's passivity against them. Roaring Moon in particular can also act as an offensive check to Fairy-types like Iron Valiant and Mega Diancie, which can otherwise overwhelm Hisuian Goodra.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Klefki": {
    "sets": {
      "Screen Setter (Fairy)": {
        "description": "<p>Klefki is the ideal dual screens setter on Fairy due to its Steel typing, which negates Poison-type attacks from Nihilego and Alolan Muk and ability to fend off threats like Mega Scizor with Foul Play. Klefki is a better option than Grimmsnarl due to its typing and ability to set up Spikes, which, like its screens, go up quickly with Prankster. This support allows for Pokemon like Tapu Bulu and Azumarill from setting up and sweeping, teams. Foul Play prevents Pokemon like Mega Scizor and Mimikyu to set up and sweep while Thunder Wave cripples foes and allows Mega Diancie to outspeed threats such as +1 Mega Charizard X and Nihilego, which will normally beat Klefki one on one. Setting up Spikes creates solid chip damage on Alolan Muk and Gholdengo, allowing for late-game sweeping from its teammates Iron Valiant and Choice Scarf Tapu Lele. Mega Diancie punishes opponents trying to set up entry hazards against Klefki and beats Fire-types such as Heatran and Mega Charizard Y. Tapu Bulu helps Klefki with Grassy Terrain, which halves the damage it takes from Earthquake, making Pokemon such as Iron Treads and Mamoswine not hit as hard.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 623713, "username": "Don Bork"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Diancie": {
    "sets": {
      "Mixed Wallbreaker (Rock)": {
        "description": "<p>Mega Diancie is the ideal Mega Evolution for Rock teams due to its ability to check Dragon-types like Kommo-o, punish passive Pokemon and entry hazard setters such as Toxapex and Klefki with Magic Bounce, and be a mixed wallbreaker that threatens Great Tusk and Galarian Slowking. Diamond Storm does considerable damage to special walls like Blissey and Alolan Muk and can also provide a Defense boost. Psychic heavily damages Mega Venusaur, Toxapex, and Nidoking, which eases the matchup against Poison teams. Earth Power deals heavy damage to Steel-type Pokemon like Heatran and Iron Treads and is paired nicely with Mystical Fire to damage Skarmory and Corviknight. On a hyper offensive team, Mega Diancie runs four attacks for coverage. With Shuckle's Sticky Web up, its good Speed tier becomes more devastating and outspeeds Pokemon like Mega Gallade and Zeraora. Mega Diancie also pairs well with Omastar and Terrakion, as Omastar takes care of the Ground matchup with a well-timed Shell Smash, while Terrakion's access to Earthquake and Close Combat takes care of most Steel-types. On bulky offense, Mega Diancie prefers to run Spikes, as the chip damage sets up a potential late-game cleanup from more offensive Pokemon on the team like Terrakion and Nihilego. Garganacl pairs well with Spikes, as Salt Cure forces a lot of Pokemon to switch out and take additional chip damage.</p>"
      },
      "Mixed Wallbreaker (Fairy)": {
        "description": "<p>Mega Diancie is a valuable asset to Fairy teams, featuring Magic Bounce to deflect entry hazards and status, wide coverage, and strong offensive capabilities with its high Speed. Diamond Storm often increases Mega Diancie's bulk and threatens foes like Enamorus and Mega Charizard Y. Moonblast handles threats like Mega Sableye and Latias. Earth Power can be used to counter Steel teams, OHKOing Heatran, Excadrill, and Magnezone, while dealing heavy damage to the likes of Skeledirge and Garganacl. Mystical Fire targets Steel-types that don't mind Earth Power, such as Ferrothorn, Celesteela, and Mega Scizor under Psychic Terrain. Alternatively, Mega Diancie can run Nature Power and use the various terrains set by its teammates to expand its wallbreaking abilities. Stealth Rock can be used to allow Mega Diancie to set its own hazard, but four attacks are recommended given Mega Diancie's wide coverage. Klefki provides Spikes and dual screens support which allows Mega Diancie to OHKO threats like Gholdengo, and it can also carry Thunder Wave to let Mega Diancie outspeed and take out threats like Mega Gallade and Mega Aerodactyl. Tapu Koko takes on Water-types and aids in the Steel matchup by forcing out Corviknight and Celesteela. Tapu Bulu counters Ground- and Water-types like Great Tusk and Urshifu-R, while Tapu Lele takes on Poison-types and prevents priority moves from Azumarill and Mega Scizor. Iron Valiant is a great partner for the Steel matchup, but it also benefits from Tapu Koko's Electric Terrain to outspeed and take out faster threats such as Zeraora and Greninja. All of these teammates appreciate Mega Diancie's ability to bounce hazards back to the opponent, as Fairy teams do not possess entry hazard removal.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 623713, "username": "Don Bork"}, {"user_id": 547532, "username": "Swiffix"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 593863, "username": "CrossHeart"}, {"user_id": 305839, "username": "maroon"}, {"user_id": 574288, "username": "Giyu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Toxapex": {
    "sets": {
      "Physically Defensive (Water)": {
        "description": "<p>Toxapex is an incredible asset to Water teams due to its great defensive profile and wide range of utility options. Scald burns physical attackers such as Dragonite and Mega Lopunny, as well as Garchomp and Mega Gallade attempting to switch in. Poison Jab threatens Fairy- and Grass-types like Tapu Bulu, Iron Valiant, and Rillaboom. Toxic Spikes enhances offensive teammates such as Barraskewda, Mega Swampert, and Greninja, while Toxic lessens Toxapex's passivity, putting Gastrodon, Tornadus-T, and Mega Altaria on a timer. Haze allows Toxapex to shut down setup sweepers like Mega Scizor, Mimikyu, and Mega Altaria. Knock Off bothers item-reliant walls such as Porygon2, Galarian Corsola, and Celesteela. Black Sludge allows Toxapex to outlast tankier foes with the help of chip damage from Toxic Spikes and Toxic, while Heavy-Duty Boots enables it as a pivot, letting it sponge attacks without worrying about entry hazards. Teammates appreciate Toxapex absorbing Toxic Spikes and fighting off Grass-types like Meowscarada and Breloom. Toxapex appreciates Slowking and Rotom-W taking Psychic- and Ground-type moves, respectively. Mega Swampert switches into Electric-types like Tapu Koko, Zapdos, and Magnezone and threatens Poison-types like opposing Toxapex, Clodsire, and Nidoking. Gastrodon forms a great defensive core with Toxapex, taking on the aforementioned Electric-types and providing entry hazards to further chip down pivots such as Meowscarada, Mega Lopunny, and Iron Moth. Greninja checks Ground-types like Clodsire, Garchomp, and Landorus and aids in the Flying matchup. Urshifu-R checks Pokemon like Kyurem and Hydreigon, which take advantage of Toxapex. Pelipper provides a Ground immunity against Landorus-T, Iron Treads, and Great Tusk and synergizes well with Toxapex against Grass teams.</p>"
      },
      "Z-Haze (Poison)": {
        "description": "<p>Toxapex is a main-stay on Poison teams due to its defensive typing, impeccable ability, ridiculous bulk, and utility moves like Toxic, Knock Off, and Haze. Scald allows Toxapex to spread burns on physical attackers such as Landorus-T, Dragonite, and Mega Scizor. Toxic puts threats like Rotom-W, Baxcalibur, and Urshifu-R on a timer and spreads chip damage on offensive teams like Dragon, Psychic, and Fire. Knock Off is another great option to bother Pokemon like Galarian Corsola and Celesteela. Haze, paired with Icium Z, shuts down setup sweepers like Z-Happy Hour Jirachi and Clangorous Soulblaze Kommo-o, immediately regaining its health to continue walling them. Toxic Spikes are an option instead of Toxic or Knock Off; however, Toxapex has other teammates capable of setting them up and it increases Toxapex's passivity. The given EV spread avoids an OHKO from +1 SpA Jirachi's Psychic, allowing Toxapex to activate its Z-Crystal. Mega Venusaur and Crobat are excellent teammates due to their Ground-type neutrality and immunity, respectively, checking Landorus-T, Great Tusk, and Mamoswine, while the former also threatens Ferrothorn with Hidden Power Fire. Due to Toxapex's Psychic-type weakness, Alolan Muk and Galarian Slowking are notable teammates, checking Tapu Lele, Deoxys-S, and Latias; Galarian Slowking, in particular, forms a very strong Regenerator core with Toxapex. Clodsire and Nidoking patch up Toxapex's Electric-type weakness, and Nidoking specifically threatens Steel teams with its wide array of coverage. Galarian Weezing provides another Ground-type immunity and removes entry hazards with Defog as well as serving as a concrete answer to Baxcalibur. Sneasler appreciates Toxapex's ability to chip down foes, offering more opportunities for setup. Iron Moth threatens Steel-types like Celesteela, Ferrothorn, and Gholdengo, which are otherwise difficult to break for Poison teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 547532, "username": "Swiffix"}, {"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Araquanid": {
    "sets": {
      "Sticky Web (Bug)": {
        "description": "<p>Araquanid is the best defensive Sticky Web setter and a staple on Bug teams, as its ability Water Bubble combined with its high Special Defense gives it valuable defensive utility against Fire-types and special attackers. Liquidation threatens Fire- and Ground-types as well as physically frail Pokemon that don't resist Water like Iron Valiant, Enamorus, and Sneasler. Toxic punishes bulky switch-ins like Mantine, Rotom-W, Porygon2, and Volcanion. Magic Coat counters entry hazards and status spread from Pokemon like Shuckle, Celesteela, and Klefki that will attempt to exploit Araquanid's passivity. Leech Life is a niche option that gives Araquanid minor recovery and threatens Pokemon like Ogerpon-W, Hydreigon, Latios, and Latias. Mirror Coat is an option for Water-resistant foes and omniboost sweepers like Pelipper, Kommo-o, and Hisuian Zoroark, as Araquanid can comfortably take an attack and OHKO them in return. The given EV spread maximizes Araquanid's bulk while also outspeeding base 50 Speed Pokemon with no investment like Ursaluna, Ting-Lu, Hippowdon, and Alolan Muk, which are all threatened by Liquidation. Araquanid synergizes best with teammates that utilize the speed control Sticky Web provides and appreciate the elimination of Pokemon it counters. Volcarona greatly benefits from the removal of Fire-types like Heatran and Victini, making the opening for a sweep easier. With the Sticky Web speed decrease, Volcarona is able to outspeed its checks after only one Quiver Dance and deals with the Grass and Electric types Araquanid is countered by. Choice Scarf Kleavor is a great Stealth Rock setter that takes out Hisuian Arcanine, provides momentum with U-turn, and benefits from Sticky Web. Strong physical attackers like Heracross, Scizor, and Mega Pinsir break walls that Araquanid can't touch like Toxapex, Tapu Fini, and Ferrothorn; they also excel with Sticky Web support, letting them set up and outspeed their checks like Kyurem, Ceruledge, and Tapu Lele.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 664824, "username": "Bows"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Mimikyu": {
    "sets": {
      "Swords Dance (Ghost)": {
        "description": "<p>Mimikyu is an outstanding asset to Ghost teams, boasting both a valuable part-Fairy typing and a unique ability that complements revenge killing and late-game cleaning. Play Rough hits threatening Dark- and Dragon-types like Galarian Moltres, Mandibuzz, and Kommo-o. Shadow Claw notably allows Mimikyu to threaten Psychic teams even under Psychic Terrain, while Drain Punch deals more damage to Steel-types such as Iron Treads, Magnezone, and Excadrill and can mitigate Life Orb recoil. Shadow Sneak enables Mimikyu to revenge kill weakened foes and pick off faster threats like Blacephalon, Gengar, and Victini. Disguise almost always allows Mimikyu to set up a Swords Dance or revenge kill faster foes that Shadow Sneak cannot deal enough damage to. Mega Sableye is heavily appreciated due to its ability Magic Bounce, which adds to Mimikyu's longevity by bouncing back entry hazards and status moves aimed at it. Wallbreakers like Gholdengo wear down bulkier teams by checking walls such as Corviknight, Mega Venusaur, and Toxapex, which lets Mimikyu have an easier time cleaning up late-game. Blacephalon and Skeledirge threaten the Steel-types Mimikyu struggles against, like Ferrothorn, Corviknight, and Mega Scizor. They can also cripple troublesome walls such as Toxapex and Gastrodon with Trick and Will-O-Wisp, respectively. Hisuian Zoroark is deeply valued for its Ghost-type immunity, as it can catch Gholdengo and Gengar off guard.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Kommo-o": {
    "sets": {
      "Setup Sweeper (Fighting)": {
        "description": "<p>An incredible asset for Fighting teams, Kommo-o is often the best wincon on the type thanks to Clangorous Soulblaze, which helps it overcome otherwise difficult matchups such as Dragon, Flying, and Water. Flamethrower takes care of Steel-type Pokemon neutral to Drain Punch like Mega Scizor and Corviknight. Taunt allows Kommo-o to block status moves from defensive Pokemon like Toxapex, Swampert, and Gliscor, preventing them from resetting its boosts with Haze or statusing it with Toxic. Alternatively, Clangorous Soul powers up Kommo-o without using its Z-Move, letting its Clangorous Soulblaze outright OHKO Toxapex and Hippowdon, at the cost of longevity. Bulletproof is Kommo-o's preferred ability to better handle Gholdengo or Aegislash in the Steel matchup. Unboosted Kommo-o's average Speed tier leaves it outsped by threats to Fighting teams like Tornadus-T and Tapu Lele, so Choice Scarf users like Galarian Zapdos and Terrakion are great partners to assist it against them. Iron Valiant's Fairy typing and wide coverage movepool lets it deal with opposing Dragon-types, and it forms a wallbreaking core with Kommo-o by pressuring the likes of Mega Sableye and Ting-Lu. Cobalion and Great Tusk provide Stealth Rock, which maximizes Kommo-o's opportunities to wallbreak after using Clangorous Soulblaze. Great Tusk can also remove entry hazards for Kommo-o with Rapid Spin, and Cobalion has the added bonus of checking Fairy-types like Mega Diancie. Mega Gallade can pressure Poison-, Ground-, and Flying-types like Toxapex, Ting-Lu, and Landorus-T for Kommo-o. It can also outspeed and revenge kill offensive threats to it like Kyurem and Garchomp.</p>"
      },
      "Mixed Omni-Boost Sweeper (Dragon)": {
        "description": "<p>Kommo-o is an exceptional setup sweeper due to its great mixed offensive stats, respectable defenses, and exclusive access to Clangorous Soulblaze; this makes it an amazing tool to clean up Steel, Dark, and Dragon teams late-game. Drain Punch threatens Steel- and Normal-types like Heatran, Blissey, and Porygon-2 as well as increasing Kommo-o's longevity, making it harder for revenge killers to shut it down after using its Z-Move. Additionally, Drain Punch is Kommo-o's best move to hit Ditto, as it copies its ability Soundproof. Flamethrower targets Fighting-resistant or -immune Steel-types such as Mega Scizor, Celesteela, and Aegislash. Taunt is preferred to shut down phazers like Haze Toxapex and Hippowdon and bulky walls like Porygon2 and Clodsire, which can inconvenience Kommo-o with Toxic. Meanwhile, Clangorous Soul allows for more boosts and breaking power, notably enabling Clangorous Soulblaze to OHKO the aforementioned Hippowdon and Toxapex. Furthermore, Clangorous Soulblaze allows Kommo-o to set up on Fairy-types and Soundproof Pokemon like Alolan Ninetales, Trace Porygon2, and opposing Kommo-o. Soundproof prevents revenge killing attempts from Ditto or opposing Kommo-o, and a Naive nature permits Kommo-o to outpace Mega Aerodactyl, Mega Lopunny, and Zeraora after obtaining the omni-boost. Mega Altaria is a wonderful teammate, as it helps weaken and clean up opposing Dragon teams; In return, it appreciates Kommo-o dealing with the aforementioned Steel-types. Kyurem aids in matchups against Flying-types like Tornadus-T, Mantine, and Dragonite, as well as Fairy-types such as Azumarill, Tapu Fini, and Mega Altaria. Choice Scarf Latias and Roaring Moon provide speed control; the former offers healing and setup opportunities with Healing Wish, while the latter checks Psychic-types like Deoxys-S, Victini, and Latias. Garchomp offers entry hazards support to pressure and chip down Kommo-o's switch-ins and aids in the Steel matchup with Earthquake. Hisuian Goodra is a huge help in the Fairy matchup, taking on Tapu Lele, Iron Valiant, and Mega Diancie. Mega Latios threatens Flying-type threats with its BoltBeam coverage; in addition, when paired with Garchomp, it puts a lot of pressure on Poison teams, which Kommo-o tends to struggle against. Cyclizar provides entry hazard control with Rapid Spin and extra protection for Kommo-o with Shed Tail, encouraging the use of Clangorous Soul over Taunt. Baxcalibur is excellent in the Dark and Flying matchups, dispatching threats like Choice Scarf Meowscarada and Enamorus with its Swords Dance or Dragon Dance set, and it also ravages Poison teams with Galarian Slowking, which Kommo-o might not be able to handle. In return, Kommo-o removes the aforementioned Steel- and Normal-types that can easily wall Baxcalibur or use it to reverse sweep, specifically Ditto.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 307004, "username": "TTK"}, {"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 547532, "username": "Swiffix"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Tapu Koko": {
    "sets": {
      "Choice Specs (Electric)": {
        "description": "<p>Tapu Koko is a dominant force within Electric teams due to its exceptional ability, Electric Surge, which its teammates benefit from. Tapu Koko further boasts a good Speed tier and valuable Fairy-typing, rendering it a menacing threat in its own right. Dazzling Gleam levels the playing field in the Dragon matchup, eliminating foes such as Kommo-o, Roaring Moon, Baxcalibur, and Mega Altaria, but it's also useful against threats like Mega Lopunny and non-Choice Scarf Great Tusk. Grass Knot provides much needed coverage against troublesome Ground-types, most notably taking care of Swampert, Quagsire, Gastrodon, and Mamoswine. Volt Switch pairs wells with Tapu Koko's speed, allowing it to escape unfavorable matchups and bring in teammates like Zapdos against the likes of Mega Venusaur or Mega Scizor. Hidden Power Ice can be used to deal with Ground-types that aren't threatened by Grass Knot such as Garchomp and Landorus-T. Alternatively, Thunderbolt can be run to increase Tapu Koko's damage output, giving it a chance to OHKO foes like Mega Diancie. Rotom-W and Zapdos are excellent partners to Tapu Koko, as they provide a necessary Ground immunity as well as Defog support, which allows Tapu Koko to pivot more freely. Rotom-W further helps by handling Ground-types and spreading burns to strong physical attackers like Mega Garchomp, Iron Valiant, Dragonite, and Mega Swampert in rain, while Zapdos walls and makes use of Heat Wave to deal with Steel-types like Ferrothorn and Iron Treads and Hurricane to counter pesky Grass- and Fighting-types like Tapu Bulu, Mega Venusaur, and Mega Gallade. Alolan Raichu's Surge Surfer fully capitalizes on Electric Terrain, turning it into a serious revenge killer, capable of outspeeding threats such as Sand Rush Excadrill, Mega Aerodactyl, and Iron Valiant under Quark Drive. Iron Hands and Zeraora are prominent partners for Tapu Koko complementing it as Physical breakers, both being able to take care of foes such as defensive Zapdos, Ursaluna and Alolan Muk which hinder Tapu Koko and other Special attackers. Iron Hands has more bulk and longevity, but Zeraora brings near unmatched Speed to the table. Both of them also appreciate Tapu Koko's ability to remove Mega Sableye and Skeledirge and luring in and critically damaging Landorus-Therian with Hidden Power Ice. Regieleki brings raw Electric-type power in the form of a boosted Rising Voltage, which is capable of sweeping teams that don't have an answer to it, and it also provides hazard removal thanks to Rapid Spin. Magnezone provides an immunity to Poison, which Tapu Koko appreciates, and more importantly traps and removes threats such as Mega Scizor and Excadrill with Hidden Power Fire.</p>"
      },
      "Fast Pivot (Fairy)": {
        "description": "<p>Boasting a great Speed tier and solid coverage, Tapu Koko not only provides Electric Terrain to enable Iron Valiant, but also provides a means to deal with Flying's defensive core for Fairy teams thanks to its access to Thunderbolt and Hidden Power Ice. Thunderbolt is Tapu Koko's most spammable attack, which it uses to eliminate roadblocks such as Corviknight, Celesteela, and Toxapex, but Discharge can be used to spread paralysis against faster foes. Hidden Power Ice threatens Ground-types such as Landorus and Gliscor. U-turn is its preferred pivot option, as Tapu Koko lures in Ground-types like Ursaluna and Great Tusk that block Volt Switch, which Iron Valiant and Tapu Bulu can then handle. That said, it can also run Toxic to wear down walls like Zapdos and Hippowdon, or Taunt to shut down entry hazard and dual screens setters like Klefki, Jirachi, and Galvantula or setup sweepers like Volcarona. Roost extends Tapu Koko's longevity and thus its opportunities to pivot. Heavy-Duty Boots pairs well with Tapu Koko's role as a pivot, but Expert Belt increases its chances to OHKO Landorus with Hidden Power Ice and Toxapex with Thunderbolt. Tapu Koko's partner in crime on Fairy teams is Iron Valiant, which appreciates being pivoted into for Quark Drive to be activated and returns the favor by dealing with Steel-types like Heatran and Hisuian Goodra, and even some Poison-types like Alolan Muk and Mega Venusaur when using a Fightinium Z and Psychium Z, respectively. Mega Diancie provides some form of hazard control with Magic Bounce, which Tapu Koko especially appreciates if it's not running Heavy-Duty Boots, and it can handle troublesome Flying- and Fire-types such as Volcarona and Mega Charizard Y. Klefki is another great partner, as it sets up screens, allowing Tapu Koko to pivot more freely, and provides a valuable immunity to Poison. Tapu Lele and Tapu Bulu serve as powerful wallbreakers that can weaken the opposing team to allow Tapu Koko to clean late-game. Tapu Lele handles foes such as Clodsire, Mega Venusaur, Nidoking, and even Mega Scizor when running Hidden Power Fire, while Tapu Bulu powers through Ground-types that don't fear Tapu Koko's Hidden Power Ice, such as Mega Swampert, Gastrodon, and Hippowdon. Belly Drum Azumarill also helps in the Ground matchup,and it can utilize its priority move Aqua Jet to eliminate faster threats such as Gengar and Nihilego.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 547532, "username": "Swiffix"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 574288, "username": "Giyu"}, {"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 594478, "username": "ken"}, {"user_id": 572981, "username": "Aera"}]}]}
  },
  "Tapu Lele": {
    "sets": {
      "Choice Scarf (Psychic)": {
        "description": "<p>Choice Scarf Tapu Lele is one of Psychic teams' greatest revenge killers. Its decent Speed tier and astounding offensive prowess combined with its great typing makes it extremely threatening because with access to STAB Moonblast, it is Psychic's best check to most Dark-type threats. Tapu Lele's presence also sets up Psychic Terrain, shielding itself and its team from dangerous priority such as Mimikyu's Shadow Sneak and Mega Scizor's Bullet Punch. Focus Blast lets it easily take care of the pesky Steel-types that resist its STAB attacks such as Ferrothorn, Heatran, and Iron Treads. Future Sight lets Tapu Lele set up an attack for later and then switch out to a teammate such as Victini or Mega Gallade to help it set up or get a KO. Shadow Ball lets it beat Gholdengo and clean up against Psychic and Ghost teams, while Thunderbolt gives it general coverage versus foes like Mantine and Celesteela. Tapu Lele is often not able to beat specially defensive walls such as Alolan Muk and Blissey; hence, it appreciates partnering up with Mega Gallade to eliminate them. Mega Alakazam is a good partner, as it helps in the Electric and Water matchups courtesy of Trace copying Surge Surfer and Swift Swim, respectively, and it appreciates Tapu Lele's Psychic Terrain boosting its Expanding Force. Slowbro sponges hits from faster Choice Scarf users such as Terrakion and Galarian Zapdos, and can also pivot Tapu Lele in with Teleport to wreak havoc. Victini and Armarouge can eliminate Steel-types, especially Aegislash and Gholdengo, easing the burden for Tapu Lele. Jirachi can slow teams down with Thunder Wave and pivot Tapu Lele into physical walls such as Mandibuzz and Slowbro with U-turn.</p>"
      },
      "Choice Scarf (Fairy)": {
        "description": "<p>Tapu Lele's Psychic Surge ability and complementary STAB types along with excellent coverage moves allow it to shine as a cleaner on Fairy teams. Psychic is its preferred Psychic-type STAB move, which it uses to take out Poison-types such as Toxapex, Nidoking, and Mega Venusaur, though it can also run Psyshock to hit Clodsire harder. Moonblast deals with Dark- and Dragon-types like Mega Sableye, Galarian Moltres, Kommo-o, and Latias. Focus Blast checks threats such as Heatran and Iron Treads. Hidden Power Fire OHKOes most Mega Scizor sets, while Thunderbolt threatens a wider selection of Water- and Flying-types like Celesteela, Mantine, and Mega Charizard Y. Shadow Ball could also be used to provide coverage against Aegislash and Gholdengo. Thanks to Psychic Surge, Tapu Lele shuts down priority moves from revenge killers and setup sweepers such as Mega Scizor's Bullet Punch, Azumarill's Aqua Jet, and Dragonite's Extreme Speed, allowing it to KO them with Hidden Power Fire, Thunderbolt, and Moonblast, respectively. Choice Scarf allows Tapu Lele to outspeed threats such as Zeraora, Choice Scarf Excadrill, Tapu Koko, and Mega Lopunny. Tapu Lele pairs well with wallbreakers like Tapu Bulu and Azumarill that can weaken or eliminate its checks, with the former taking care of Meowscarada, Rotom-W, and Gastrodon, while the latter handles Volcarona, Choice Scarf Blacephalon, and Landorus. Tapu Koko helps in the Water- and Flying-type matchups by dealing with Landorus and Corviknight and offers a great Speed tier and coverage. Iron Valiant answers Steel-types like Hisuian Goodra and uses All-Out Pummeling to eliminate Dark-types like Alolan Muk, one of the best counters to Tapu Lele, and Ting-Lu, which could tank a few hits from Tapu Lele and threaten it with Poison Jab or Heavy Slam. The duo of Tapu Koko and Iron Valiant further assists Tapu Lele's late-game cleaning, as Tapu Koko activates Iron Valiant's Quark Drive, allowing it to outspeed common Choice Scarf users that are faster than Tapu Lele like Terrakion, Blacephalon, and Nihilego. Klefki's utility moves, such as Spikes, Thunder Wave, and dual screens, make it an excellent supporting partner. Thanks to Foul Play, Klefki is also able to answer bulky Swords Dance Mega Scizor, which could otherwise tank a Hidden Power Fire from Tapu Lele and KO it. Mega Diancie contributes to keeping Tapu Lele healthy by threatening hazard setters with Magic Bounce as well as Fire-types like Mega Charizard Y and Volcarona, which can be troublesome to deal with for Tapu Lele. Mimikyu is a great partner in the Ghost matchup, being able to threaten fast foes such as Blacephalon. Ribombee's Sticky Web allows Tapu Lele to outrun faster Choice Scarf users such as Sneasler, Iron Valiant, and Gengar.</p>"
      },
      "Calm Mind (Fairy)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 532439, "username": "Bka Onon"}, {"user_id": 547532, "username": "Swiffix"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 532439, "username": "Bka Onon"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Tapu Bulu": {
    "sets": {
      "Swords Dance (Fairy)": {
        "description": "<p>Tapu Bulu is a fearsome wallbreaker, boasting synergistic coverage moves that help Fairy teams in a variety of matchups like Water, Poison, and Ground. Close Combat targets Steel-types like Heatran and Ferrothorn. Should Fightinium Z be used, All-Out Pummeling heavily damages the likes of Celesteela and Corviknight after a Swords Dance boost. High Horsepower heavily damages Aegislash and Gholdengo and lets Tapu Bulu be a massive asset against Steel and Water teams by hitting Toxapex for heavy damage. Substitute allows Tapu Bulu to set up on passive Pokemon such as Toxapex, Swampert, and Mega Sableye, while Zen Headbutt is its best move against Mega Venusaur and Crobat. Klefki is a great teammate, as it sets up Spikes to ease Tapu Bulu's wallbreaking as well as Reflect and Light Screen to provide more setup opportunities. Mega Diancie threatens Flying- and Fire-types like Zapdos, Dragonite, and Volcarona for Tapu Bulu. In return, Tapu Bulu checks Gastrodon, Heatran, and Clodsire, letting Mega Diancie have more leeway on its moveset. Similarly, Tapu Koko is heavily appreciated, as it also deals with Flying-types like Tornadus-T and Mega Charizard Y and relieves Tapu Bulu of having to use Fightinium Z, or waste its Z-Move, to threaten Corviknight and Celesteela.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Nihilego": {"sets": {"Choice Item User (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Meteor Beam (Rock)": {"description": "<p>The EV Spread lets Nihilego obtain a Speed-boosting Beast Boost.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Buzzwole": {"sets": {"Bulk Up (Bug)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Celesteela": {
    "sets": {
      "Physically Defensive (Flying)": {
        "description": "<p>With an amazing defensive typing and defensive stats, Celesteela is a great wall on Flying teams, taking hits from the likes of Iron Boulder, Weavile, and Mega Diancie. Celesteela takes advantage of its weight to threaten Rock-, Ice-, and Fairy-types such as Ogerpon-C, Nihilego, Weavile, and Tapu Lele with Heavy Slam. Leech Seed provides additional recovery for Celesteela on top of Leftovers and wears down foes that lack recovery like Barraskewda and Latias. Protect allows Celesteela to both guarantee recovery from Leftovers and scout moves from Choice-locked foes like Blacephalon and Zeraora. Toxic spreads status to foes on top of Leech Seed, wearing down walls such as Mantine in the process. Air Slash threatens Fighting- and Grass-types such as Mega Gallade, Keldeo, and Hisuian Lilligant. Flamethrower threatens the aforementioned Grass-types as well as Steel-types like Gholdengo, Ferrothorn, and Corviknight. 248 HP and 48 Special Defense EVs allow Celesteela to avoid a 2HKO from Choice Specs Greninja's Ice Beam and Choice Scarf Iron Valiant's Thunderbolt, while the remaining EVs are invested into Defense so it can take hits from Mega Lopunny and Mega Gallade. Mantine forms a defensive pairing with Celesteela, as its Water typing and its ability Water Absorb makes it great against Fire- and Water-types like Volcarona, Mega Charizard Y, and Urshifu-R. Gliscor's Ground typing and STAB Earthquake make it an important asset in the Electric matchup, and it helps Celesteela make progress against opposing teams with entry hazards, spread status with Toxic, and remove items with Knock Off. Landorus threatens Fire- and Electric-types such as Heatran, Ceruledge, and Raging Bolt. In return, it appreciates Celesteela checking Ice- and Fairy-types like Weavile, Iron Valiant, and Alolan Ninetales. Galarian Moltres and Dragonite appreciate Celesteela removing threats such as Enamorus and Ogerpon-C so they can begin sweeping. In return, Galarian Moltres takes out Ghost-types like Ceruledge and Blacephalon for Celesteela, while Dragonite handles Steel- and Electric-types such as Heatran, Magnezone, and Raging Bolt.</p>"
      },
      "Mixed Wall (Steel)": {
        "description": "<p>Boasting incredible defensive stats, an assortment of utility options, and a wonderful typing, Celesteela cements itself as a staple on Steel teams, easing the Ground and Fairy matchups as well as forcing progress against opposing Steel teams due to Flamethrower and Leech Seed. Flamethrower targets Steel-types that resist Heavy Slam such as Corviknight, Iron Treads, and Mega Scizor, while Air Slash threatens Fighting-types like Mega Gallade, Great Tusk, and Kommo-o. Alternatively, Toxic may be used to put bulkier Pokemon such as Ting-Lu and Gastrodon on a timer, however, without Flamethrower, Celesteela is extremely passive in front of the aforementioned Steel-types, as well as Ferrothorn and Gholdengo which are immune to Leech Seed. Giga Drain is another option to improve the Water and Ground matchups, hitting Gastrodon, Mega Swampert, and Slowbro as well as improving longevity, however, it's a lot more matchup reliant than the other listed options. Protect in conjunction with Leech Seed is Celesteela's main method of forcing progress, spreading chip damage while also massively boosting its longevity. The given EV spread allows Celesteela to survive two consecutive uses of Close Combat from the likes of Mega Lopunny in addition to Choice Scarf Buzzwole and Terrakion. Heatran is by far Celesteela's most advantageous teammate due to its immunity to Fire-type moves letting it take on threats such as Volcarona and Blacephalon. In return, Celesteela walls Ground-types like Clodsire and Hippowdon. Ferrothorn is an essential teammate due to its ability to check Water-types such as Barraskewda, Mega Swampert, and Rotom-W as well as provide utility in the form of entry hazards and additional Leech Seed support, wearing down teams greatly. Furthermore, Ferrothorn is a great answer to Electric-type Pokemon like Tapu Koko, Rotom-W, and Alolan Raichu. Ghost-type teammates such as Aegislash and Gholdengo alleviate the Fighting matchup, lessening the amount of pressure put onto Celesteela as a primary switch-in and also removing threats like Skeledirge, Slowbro, and Toxapex. Choice Scarf Iron Treads and Excadrill provide an immunity against the aforementioned Electric-type Pokemon, while the former checks Landorus with Ice Spinner and the latter hinders Mega Sableye with Toxic. Furthermore, Excadrill and Iron Treads are Steel's best answers to Ogerpon-H. Mega Scizor is a great pivot into Knock Off and can take on Fighting-types due to its neutrality to them and access to Roost. Assault Vest Melmetal is a great blanket check to special attackers like Tapu Koko, Kyurem, and Gholdengo, while Hisuian Goodra is an excellent sponge for Water-type attacks, walling Volcanion, Choice Specs Pelipper, and Basculegion-F.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}, {"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 532439, "username": "Bka Onon"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Blacephalon": {
    "sets": {
      "Choice Scarf (Fire)": {
        "description": "<p>Choice Scarf Blacephalon is a great late-game cleaner and provides great speed control on Fire teams, outspeeding and removing various offensive threats like Tapu Lele and Nihilego. Psyshock targets Poison- and Fighting-types like Nihilego and Keldeo. Trick allows Blacephalon to shift its Choice Scarf to passive walls like Ting-Lu and Mantine, restricting their options. Hidden Power Ice targets Dragon- and Ground-types such as Garchomp and the Landorus formes. Ninetales and Torkoal set up sun for Blacephalon to make Flamethrower its strongest cleaning option, notably OHKOing Iron Valiant, Enamorus, and Tornadus-T after Stealth Rock. Additionally, Ninetales provides Healing Wish support, while Torkoal sets up Stealth Rock and removes entry hazards with Rapid Spin so Blacephalon can switch in more easily. Cinderace also provides entry hazard control with Court Change, with it potentially being able to steal foes' dual screens; and it handles Dark-, Normal-, and Psychic-types like Tyranitar, Blissey, and Iron Boulder with High Jump Kick and Sucker Punch, respectively. It also brings Blacephalon in with U-turn. In return, Cinderace appreciates Blacephalon dealing with Ghost-types, which can switch in on a predicted High Jump Kick. Early-game wallbreakers such as Choice Band Victini and Hisuian Arcanine remove walls for Blacephalon. Victini breezes through Water- and Flying-types such as Empoleon and Mantine, while Hisuian Arcanine revenge kills boosted sweepers such as Alolan Raichu and Volcarona with Extreme Speed. Thanks to Blacephalon's great Speed tier, which lets it take out threats like Garchomp, it can enable late-game sweepers such as Volcarona, Z-Celebrate Victini, and Mega Charizard X.</p>"
      },
      "Choice Scarf (Ghost)": {
        "description": "<p>Boasting an astonishing Special Attack stat, great Speed tier, and deadly STAB combination, Blacephalon is an esteemed revenge killer on Ghost teams, easily cleaning through weakened Steel, Fairy, and Flying teams due to Beast Boost. Fire Blast provides more power to OHKO foes like Tapu Koko and Great Tusk at the cost of lowered accuracy. Hidden Power Ice targets Ground- and Dragon-types that aren't threatened by Blacephalon's STAB combination such as Garchomp, Landorus-T, and Dragonite. Alternatively, Blacephalon may use Psyshock to break through Clodsire, Kommo-o, and Nihilego. Trick immobilizes switch-ins like Alolan Muk, Iron Hands, and Blissey but can also be used on the aforementioned targets of Psyshock. With a Choice Scarf, Blacephalon manages to outpace Weavile, Choice Scarf Landorus-T, and Tapu Koko, allowing it to revenge kill them. Mimikyu is a great wallbreaker, capable of weakening Dark, Fighting, and Dragon teams, setting Blacephalon up for success late-game. Mega Sableye prevents the setting of Stealth Rock, allowing Blacephalon to pivot freely. Gholdengo threatens Fairy-type Pokemon like Mega Diancie and Clefable and takes advantage of passive Blacephalon switch-ins like Toxapex and Blissey. Hisuian Zoroark's immunity to Ghost-type moves is heavily appreciated, and it lures in Dark-types such as Hydreigon, Mega Tyranitar, and Ting-Lu with Illusion, hitting them with Focus Blast. Furthermore, Hisuian Zoroark can bluff other Blacephalon switch-ins—such as Heatran and Toxapex—to eliminate them, easing Blacephalon's job later into the match. Froslass and Galarian Corsola offer entry hazards to wear down Blacephalon's switch-ins and spread status ailments to ease Blacephalon's sweeping.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}, {"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}, {"user_id": 547532, "username": "Swiffix"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Zeraora": {
    "sets": {
      "Physical Wallbreaker": {
        "description": "<p>Choice Band Zeraora is a fearsome wallbreaker on Electric teams thanks to its incredible Speed stat and respectable Attack. Close Combat threatens foes like Blissey, Ferrothorn, and Hisuian Goodra that try to wall Zeraora or its teammates, while Knock Off scares off Ghost- and Psychic-types like Sinistcha, Galarian Slowking, and Jirachi. Play Rough hits Dragon- and Fighting-types like Mega Altaria, Hydreigon, and Mega Gallade for massive damage. Tapu Koko complements Zeraora by providing Electric Terrain to amp up Plasma Fists, notably allowing Zeraora to OHKO Mega Diancie with the power boost while hitting Dark-, Dragon-, and Ground-types like Mega Sableye, Mega Altaria, and the Landorus formes with its strong Dazzling Gleam and Hidden Power Ice. Tapu Koko appreciates Zeraora dispatching specially defensive walls like Chansey, Alolan Muk, and Hisuian Goodra with its strong Plasma Fists and Close Combat. Both Rotom-W and Zapdos are great teammates by virtue of their Ground immunity; Rotom-W can pivot Zeraora in on the aforementioned walls, wash away Ground-types with Hydro Pump, and remove entry hazards with Defog, while Zapdos greatly appreciates said walls being broken down and demolishes Grass-types like Mega Venusaur in return. Iron Hands provides a defensive sponge against Choice Scarf users such as Hisuian Arcanine, Kleavor, and Gholdengo and provides entry points thanks to its slow Volt Switch. After a Nasty Plot, Alolan Raichu can deal with troubling Poison- and Ground-types like Mega Venusaur, Water Absorb Clodsire, and Hippowdon thanks to its strong Z-Psyshock and Grass Knot, greatly aiding Zeraora's wallbreaking efforts.</p>"
      },
      "Bulk Up (Electric)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 571069, "username": "Dead by Daylight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 635656, "username": "Elvira"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Melmetal": {"sets": {"Substitute": {"description": "<p>12 Speed EVs let Melmetal outspeed and utilize Substitute against walls such as Toxapex and Galarian Corsola, while the given bulk investment ensures its Substitute survives Amoonguss's Foul Play or Slowbro's Scald.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Rillaboom": {"sets": {"Choice Band": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Cinderace": {
    "sets": {
      "Offensive Utility": {
        "description": "<p>Cinderace acts as role compression on Fire teams, being able to apply offensive pressure on foes like Azumarill and non-Choice Scarf Hydreigon with its coverage, remove entry hazards with Court Change, and revenge kill faster threats such as Iron Boulder and Ceruledge with Sucker Punch. Pyro Ball and Gunk Shot can be used over Sucker Punch, with the former handling Bug- and Steel-types like Scizor and Corviknight and the latter taking on Fairy-types like Clefable and non-Choice Scarf Iron Valiant. High Jump Kick allows Cinderace to deal with Normal-, Rock-, and Dark-types such as Blissey, Mega Tyranitar, and Ting-Lu. Iron Head is a niche option that allows Cinderace to lure in and remove Mega Diancie in the Fairy matchup. With U-turn, Cinderace can pivot out of unfavorable matchups such as Toxapex and Great Tusk and bring in a teammate that can deal with them. Heatran and Iron Moth are such teammates, with the former handling Toxapex by trapping it with Magma Storm and removing it with Earth Power and the latter taking Great Tusk out with Energy Ball. When it forgoes Sucker Punch, Cinderace appreciates Choice Scarf Blacephalon taking on Ghost-types such as Gholdengo and Ceruledge, which can switch into High Jump Kick, and in return, Cinderace takes on Dark-types for Blacephalon. Torkoal sets up sun to boost Pyro Ball when it's being run and places Stealth Rock to further aid Cinderace. Notably, sun-boosted Pyro Ball 2HKOes Mega Sableye. When Cinderace runs Sucker Punch, its ability to revenge kill faster and weakened threats like Iron Boulder enables setup sweepers such as Mega Charizard X, Volcarona, Z-Celebrate Victini, and Ceruledge to start their own sweep, and the latter two specifically appreciate Court Change support so they can find an opportunity to switch in.</p>"
      },
      "Swords Dance (Fire)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned</p>"},
      "Choice Scarf": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}, {"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Corviknight": {
    "sets": {
      "Defensive Pivot (Flying)": {
        "description": "<p>With crucial neutralities to Rock and Ice, as well as several other resistances that let it wall several metagame threats such as Mamoswine, Mega Lopunny, and Iron Boulder, Corviknight is a solid entry hazard remover and pivot that mitigates the weakness to Stealth Rock commonly found on Flying teams. Body Press minimizes its passivity, notably hitting foes such as Mega Lopunny, Weavile, and Ogerpon-C, but Iron Head can be used instead to hit Fairy-types like Iron Valiant, Mega Diancie, and Alolan Ninetales. Pressure ensures that Corviknight doesn't run out of Defog PP as easily because it can switch into foes setting up Stealth Rock and lower their PP, such as Piloswine, Archaludon, and Ferrothorn, but Mirror Armor can be used instead to avoid a 2HKO from Mega Diancie's Mystical Fire. The first EV spread, even if Corviknight loses Leftovers, avoids a 2HKO from Mega Gallade's Close Combat, a 2HKO from Mega Lopunny's Close Combat after Stealth Rock, and an OHKO from Great Tusk's +1 All-Out Pummeling. However, the alternate EV spread still avoids a 2HKO from Mega Lopunny's Close Combat, and it avoids a 2HKO from Choice Specs Protean Greninja's Ice Beam with Leftovers recovery. Mantine is a solid partner for Corviknight, as it can switch into Fire-types such as Mega Charizard Y, Volcarona, and Heatran, and it also forms a defensive core by more consistently handling special attackers for it. Corviknight's role compression also allows Mantine to run Toxic over Defog, or if Mantine is desired as a Defogger instead, Corviknight can run Iron Head + Body Press. Gliscor and Landorus are also good allies to switch into Electric-types that force out Corviknight such as Zapdos, Raging Bolt, Zeraora, and Alolan Raichu, in turn also forming a pivoting core with Corviknight. Offensive Pokemon such as Mega Charizard Y, Mega Aerodactyl, and Tornadus-T appreciate Corviknight's slow pivoting to safely be brought onto the field; in return, they act as offensive checks to foes that Corviknight can't threaten by itself such as Great Tusk, Mega Gallade, and Ogerpon-W.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Barraskewda": {
    "sets": {
      "Rain Sweeper (Water)": {
        "description": "<p>Barraskewda functions as one of the best sweepers on rain Water teams, in part thanks to its high Speed tier, which is increased further under rain due to its ability Swift Swim, allowing it to outspeed the entire tier. Flip Turn allows Barraskewda to pivot out of Pokemon like Corviknight and Rotom-W, which are not OHKOed by rain-boosted Liquidation, while still dealing respectable damage and maintaining momentum to get in its teammates to deal with these Pokemon. Close Combat is the strongest coverage move that Barraskewda has access to and it most notably threatens Ferrothorn, which is able to take Liquidation from Barraskewda. Psychic Fangs in conjunction with an Adamant nature lets Barraskewda 2HKO Mega Venusaur and Toxapex, and its secondary effect of destroying dual screens, while situational, is useful in the Fairy matchup. Crunch is an alternative option to let Barraskewda target Psychic-types like Latios, Mega Latias, and Slowbro, which are able to switch into Liquidation. Poison Jab is also an option to target Fairy-types like Tapu Bulu and Azumarill, which resist Liquidation and Close Combat. A Jolly nature is preferred to outspeed Tapu Koko and Mega Lopunny, whereas an Adamant nature can also be run to achieve the aforementioned results with Psychic Fangs. Pelipper is a mandatory partner of Barraskewda, as it not only sets rain but also offers a slow U-turn as a form of pivoting, which lets Barraskewda get on the field safely, and its ability to threaten opposing Grass teams with Hurricane helps Barraskewda get past Pokemon like Mega Venusaur. Mega Swampert can form a potent Swift Swim offensive core with Barraskewda, wearing down each other's checks such as Ferrothorn and Porygon2. Swampert also works well with Barraskewda, offering hazard support in Stealth Rock to weaken opposing Pokemon so Barraskewda can secure KOs. It also provides slow pivoting with Flip Turn, and its Ground typing is a must to stave off opposing Electric-types like Regieleki, which are faster than Barraskewda outside of rain. Toxapex is also a strong defensive teammate for Barraskewda, being able to cripple Barraskewda's checks with Toxic and also handle setup sweepers like Mega Altaria and Mega Scizor with Haze. Greninja is able to break past physically defensive walls like opposing Toxapex, Mega Scizor, and Mega Venusaur, which are reliable answers to Barraskewda, while Greninja appreciates Barraskewda being able to handle specially defensive walls like Blissey and Ting-Lu.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 307004, "username": "TTK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 547532, "username": "Swiffix"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Hatterene": {"sets": {"Calm Mind (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Arctozolt": {"sets": {"Slush Rush (Ice)": {"description": "<p>A Naughty nature lets Arctozolt OHKO Physically Defensive Toxapex with Bolt Beak after Stealth Rock damage and should be in tandem with Freeze-Dry to fully threaten Water teams as it deals with Swampert. On the other hand, a Naive nature lets Arctozolt outspeed Zeraora and Choice Scarf Excadrill under Snow, making Stomping Tantrum a better choice if using the aforementioned nature.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Choice Band (Water)": {
        "description": "<p>Choice Band Urshifu-R is a strong wallbreaker on Water teams, taking on bulky foes like Ferrothorn, Archaludon, Kyurem, and Mandibuzz. Aqua Jet is a strong priority option to pick off faster albeit weakened sweepers and cleaners such as Ceruledge and Sneasler. Thunder Punch targets Water- and Flying-types like Toxapex, Pelipper, and Mantine, while Ice Spinner handles Dragon- and Ground-types such as Dragonite and Clodsire. However, Aqua Jet is preferred, since it stops opposing sweepers and cleaners in their tracks to enable its teammates to sweep or clean late-game. U-turn allows Urshifu-R to pivot out of unfavorable matchups, such as against Mantine and Dragonite, and bring a teammate in to deal with them. Pelipper is not only neutral to Grass, but it also sets up rain to boost Urshifu-R's Water-type STAB attacks, turning it into a potential late-game cleaner with rain-boosted Aqua Jet. It notably has a good chance of OHKOing Alolan Raichu with Aqua Jet under rain, and rain further makes Surging Strikes harder to switch into. Additionally, Pelipper removes entry hazards with Defog and pivots it in safely with U-turn. Swift Swim users such as Mega Swampert and Barraskewda thus make for great teammates as well, as they appreciate Urshifu-R's wallbreaking so they can clean late-game. Mega Swampert also provides an Electric immunity to deal with the likes of Tapu Koko, Regieleki, and Zeraora. Toxapex and Empoleon are great defensive partners due to their part-Poison and part-Steel typings, respectively, that allow them to take on Fairy-types such as Mega Diancie and Alolan Ninetales, which Urshifu-R dislikes. Additionally, they can stack entry hazards with Toxic Spikes and Stealth Rock, respectively, to aid Urshifu-R in wallbreaking, and Toxapex also removes boosts from setup sweepers with Haze. Greninja forms a strong wallbreaking duo with Urshifu-R, with it taking on the likes of Sinistcha, the Ogerpon formes, and non-Choice Scarf Iron Valiant for Urshifu-R, while it appreciates the removal of Ferrothorn and Empoleon in return. Ogerpon-W eases the Ground matchup thanks to its resistance, handling the Landorus formes and Garchomp in the process.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Regieleki": {"sets": {"Terrain Attacker": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Kleavor": {
    "sets": {
      "Choice Scarf (Bug)": {
        "description": "<p>Choice Scarf Kleavor is one of the best answers to Flying- and Fire-types, like Tornadus-T, Mega Charizard-Y, and Skeledirge, for Bug teams, thanks to its Sharpness-boosted Stone Axe, which has the added utility of automatically setting Stealth Rock. Close Combat synergizes well with Kleavor's STAB moves, crushing Steel-types like Iron Treads. U-turn allows Kleavor to pivot out of Great Tusk and Skarmory to bring in teammates like Araquanid or Volcarona. Night Slash banishes Ghost-types like Gholdengo, Knock Off softens walls like Corviknight and Porygon2 for its teammates, and X-Scissor takes down Slowbro to make way for Mega Pinsir. Araquanid and Galvantula are excellent teammates, as these set up Sticky Web to patch up Kleavor's unassuming speed, even when using a Choice Scarf, allowing it to outspeed Choice Scarf Blacephalon. Additionally, they also help in dealing with pesky Fire- and Flying-types like Volcarona and Landorus, respectively. Physical setup sweepers benefit from Kleavor's ability to set hazards offensively, Knock Off items from walls, and deal with Skeledirge and Slowbro, which often wall Mega Pinsir, Scizor, and Mega Scizor. In return, they deal with Fighting- and Fairy-types like Great Tusk and Mega Diancie. Quiver Dance Volcarona appreciates Skeledirge removed, as this lets it clean up Ghost teams at +1; it can also be brought in against passive walls like Slowbro and Skarmory. Forretress provides Rapid Spin and loves Kleavor's ability to set Stealth Rock, as this allows it to run other hazards like Toxic Spikes or Volt Switch to better support the team. Lokix provides great offensive support with its access to priority in First Impression and Sucker Punch to finish off teams weakened by Kleavor through entry hazards and repeated Knock Offs. It is also a secondary check to Skeledirge, which Bug teams appreciate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542526, "username": "Neko"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 532439, "username": "Bka Onon"}, {"user_id": 547532, "username": "Swiffix"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Ursaluna": {"sets": {"Swords Dance (Normal)": {"description": "<p>A Jolly nature is more desireable as most defensive walls only invest enough Speed for Adamant Azumarill, which speedties with Ursaluna.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Sneasler": {
    "sets": {
      "Choice Scarf (Fighting)": {
        "description": "<p>Choice Scarf Sneasler is an extremely fast revenge killer that decimates Choice Scarf Tapu Lele, Quark Drive-boosted Iron Valiant, and Adamant Sand Rush Excadrill for Fighting teams. Close Combat and Dire Claw have near-perfect synergy, aside from Dire Claw's ability to punish passive answers—like Toxapex and Slowbro—that swap into its STAB moves. U-turn pivots Sneasler out of switch-ins such as Skeledirge, Aegislash, and Gliscor, bringing in Choice Specs Iron Valiant and Mega Gallade. Switcheroo further punishes walls like Corviknight if the extra speed is unneeded. Alternatively, Rock Slide lets it revenge kill Quiver Dance Volcarona, freeing up a moveslot on Iron Hands, while Toxic Spikes greatly pressure Fairy teams wary of Dire Claw. Night Slash can also be the final move for Sneasler, as it notably hits Gholdengo and Aegislash, but pivoting out of these threats is usually the better option. Choice Scarf Sneasler is a late-game cleaner, so wallbreakers and setup sweepers such as the aforementioned Kommo-o and Mega Gallade are appreciated, as these deal with Corviknight, Gliscor, and Toxapex. Kommo-o also benefits from Sneasler dealing with Fairy-types, as this allows Kommo-o to use Clangorous Soulblaze. Choice Specs Iron Valiant loves being pivoted in safely against physical walls like Skeledirge and Mega Sableye, which wall Sneasler. Assault Vest Iron Hands is a soft check against Gholdengo and Volcarona and can pivot Sneasler in against walls, which it can inconvenience. Hisuian Lilligant and Breloom deal with Gastrodon and Quagsire and also ease the Water and Ground matchups. As with the other setup sweepers, these also love the setup opportunities Sneasler opens up by being able to punish walls with Dire Claw's additional effects or with Switcheroo. Entry hazard support from Cobalion and Great Tusk is also appreciated, and these provide a secondary answer to Mimikyu and Zeraora, respectively. These teammates also appreciate Sneasler's ability to remove Toxic Spikes, greatly easing the matchup against Water and Poison teams.</p>"
      },
      "Choice Scarf (Poison)": {
        "description": "<p>Sneasler finds a role as Poison's premier Choice Scarf user thanks to its incredible Speed allowing it to outpace opposing Choice Scarf users like Iron Treads and Tapu Lele, as well as its great Attack and movepool. Dire Claw allows Sneasler to potentially inflict status onto threats like Dragonite and Tornadus-T attempting to check it. U-turn allows Sneasler to pivot out of threats that wall it like Great Tusk and Clodsire. Switcheroo messes with opposing walls such as Corviknight and Clodsire, while Rock Slide is a strong option to check threats such as Volcarona and Mega Charizard Y. Nidoking and Sneasler pair excellently together, creating a great offensive core, as Nidoking can set Stealth Rock to provide chip damage and remove targets like Toxapex, Corviknight, and Zapdos that prove problematic to Sneasler, while Sneasler can remove faster threats and special walls such as Kyurem, Enamorus, and Blissey. Galarian Slowking can take on special threats such as Choice Specs Latios and Tornadus-T, along with using Future Sight to pair with Sneasler's Close Combat to deal immense damage to threats. Alolan Muk provides great support by dealing with and Pursuit trapping Ghost- and Psychic-type foes that Sneasler cannot handle such as Blacephalon, Hisuian Zoroark, and Deoxys-S. Crobat provides entry hazard removal and removes targets like Mega Gallade that can cause significant issues. Mega Venusaur can handle Ground- and Water-type threats such as Great Tusk, Hippowdon, Urshifu-R, and Dondozo. Toxapex can handle powerful priority attacks from the likes of Scizor, Hisuian Arcanine, and Mimikyu attempting to pick Sneasler off by punishing their users with Scald burns and removing their boosts with Haze.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542526, "username": "Neko"}, {"user_id": 622813, "username": "Pengairxan"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 547532, "username": "Swiffix"}, {"user_id": 532439, "username": "Bka Onon"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Enamorus": {
    "sets": {
      "Choice Scarf (Flying)": {
        "description": "<p>Enamorus provides great speed control for Flying teams, outspeeding and threatening a myriad of common threats such as Mega Altaria, boosted Kommo-o, Mega Lopunny, Hisuian Lilligant, and Choice Specs Greninja. Earth Power pairs well with Moonblast, hitting Poison-, Steel-, and Fire-types that resist Moonblast like Toxapex, Heatran, and Cinderace. On the other hand, Mystical Fire targets the likes of Ferrothorn, Skarmory, and Corviknight; however, Earth Power is preferred due to the greater number of targets it hits. Superpower not only hits threats like Empoleon and Ogerpon-C, but it can also help Enamorus snowball through Normal and Rock teams thanks to Contrary boosting. Healing Wish allows Enamorus to cure status and grant longevity to a weakened teammate. Gliscor and Landorus both provide entry hazard support and Electric immunity, and Landorus also wallbreaks to enable a sweep from Enamorus. Corviknight and Mantine remove Stealth Rock for Enamorus with Defog, and they can switch into Sneasler and Mega Swampert, respectively. Mega Charizard Y and Tornadus-T both handle bulky threats like Mega Venusaur and Swampert. In return, Enamorus provides Healing Wish support. Mega Aerodactyl forms a great revenge killing core with Enamorus, handling Pokemon like Tornadus-T and Galarian Slowking for Enamorus while also appreciating Enamorus removing Choice Scarf Nihilego.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}]}]}
  },
  "Meowscarada": {
    "sets": {
      "Choice Scarf (Dark)": {
        "description": "<p>Thanks to its fantastic movepool and Protean, Choice Scarf Meowscarada is the best revenge killer available for Dark teams, outrunning the likes of Regieleki, Speed-boosted Kommo-o, and Mega Swampert under rain. Flower Trick is Meowscarada's most powerful move, picking off weakened foes such as Tapu Lele and Terrakion. Play Rough is essential, as it deals with many threats to Dark teams like Galarian Zapdos, Mega Gallade, and Iron Valiant. U-turn allows Meowscarada to switch out of unfavorable situations, pivoting into powerful teammates such as Galarian Moltres and Mega Tyranitar while keeping momentum for the team. Knock Off cripples defensive switch-ins—such as Toxapex, Ferrothorn, and Clefable—as well as offensive Pokemon like Zeraora and Iron Treads. Toxic Spikes can be run instead to better pressure Normal, Fairy, and Fighting teams. Meowscarada's teammates appreciate its ability to check a myriad of threats as well as its revenge killing capabilities. Wallbreakers like Galarian Moltres and Hydreigon are great partners to deal with physical walls like Celesteela and Mega Venusaur. Ting-Lu and Tyranitar provide entry hazard support for Meowscarada—ensuring it is able to net more KO's—and are great defensive pivots for it to fall back upon. Similarly, Mega Sableye provides a Fighting immunity, bounces back status moves, and prevents entry hazards from going up, letting Meowscarada switch in unscathed.</p>"
      },
      "Choice Scarf (Grass)": {
        "description": "<p>Meowscarada is an excellent choice for Grass teams thanks to its high Speed and Protean, enabling it to be a threatening revenge killer that can outspeed common threats such as Choice Scarf Iron Valiant and Gholdengo. Flower Trick is Meowscarada's best STAB option and is capable of dealing with weakened Pokemon like Clodsire and Spectrier. Flower Trick's guaranteed critical hit is also very useful in the Fairy matchup and lets Meowscarada revenge kill Azumarill and a weakened Tapu Lele behind Reflect. U-turn allows Meowscarada to maintain an advantage against its defensive checks like Corviknight by being able to pivot into its teammates like Scovillain. Knock Off is a tool to cripple Meowscarada's defensive switch-ins like Toxapex and Klefki in addition to the aforementioned Corviknight. Play Rough is a strong coverage option to threaten opposing Dragon-type Pokemon like Kommo-o, Kyurem, and Latios, which Grass teams tend to struggle against. Low Kick is a less frequent option but lets Meowscarada OHKO Bisharp while threatening Heatran with a 2HKO; however, Play Rough is preferred to have an easier time against Dragon teams. Meowscarada has an easier time revenge killing foes with entry hazard support from Ferrothorn and Cradily. Ferrothorn appreciates Meowscarada's ability to check Fighting-types like Mega Gallade, Iron Valiant and Galarian Zapdos with STAB Play Rough. Hisuian Lilligant is also a fantastic offensive partner for Meowscarada. It is able to check the Flying-types that switch into Meowscarada like Celesteela and Landorus-T while also assisting in the Dragon matchup, outspeeding common Pokemon like Garchomp and Dragonite. Hisuian Lilligant also makes the Steel matchup easier for Grass; its ability to threaten Heatran is appreciated by Meowscarada, while Meowscarada can threaten Gholdengo with Knock Off, which Lilligant cannot beat. Mega Venusaur is also a mandatory defensive partner for Meowscarada; its Bug neutrality and bulk allows it to act as a consistent check to Mega Scizor, which easily switches into any move of Meowscarada, and Venusaur is able to check it with Hidden Power Fire. Mega Venusaur also checks opposing Fairy-types for Meowscarada like Tapu Koko, Mega Diancie, and Iron Valiant, while Meowscarada is able to threaten the Psychic-types that force out Mega Venusaur such as Latios, Mega Alakazam, and Victini. Whismicott is one of the best hazard removal options on Grass, and Meowscarada appreciates not having Stealth Rock and Spikes chip it down, because it comes in often to threaten a KO. Whimsicott's Fairy typing also allows Meowscarada and its teammates not to be overwhelmed by Dragon-types like Garchomp, and it can encore Calm Mind Mega Latias. Celebi with Nasty Plot and Groundium Z can break defensive Steel-types like Heatran and Hisuian Goodra while also being able to threaten opposing Poison-types like Alolan Muk and Toxapex.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475589, "username": "Illecent Excaliburn"}, {"user_id": 307004, "username": "TTK"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 574288, "username": "Giyu"}, {"user_id": 321991, "username": "Mateeus"}, {"user_id": 532439, "username": "Bka Onon"}, {"user_id": 547532, "username": "Swiffix"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Skeledirge": {"sets": {"Physically Defensive (Ghost)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Lokix": {"sets": {"Swords Dance (Bug)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Garganacl": {"sets": {"Iron Defense": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Ceruledge": {
    "sets": {
      "Swords Dance (Fire)": {
        "description": "<p>Ceruledge is a strong late-game sweeper on Fire teams that checks Ghost- and Psychic-types thanks to its powerful STAB moves, setup in Swords Dance, and a great ability in Weak Armor, punishing physical attackers that hit it. At +2, Ceruledge 2HKOes Great Tusk and has a good chance to OHKO Gliscor after Stealth Rock damage with Poltergeist. Shadow Sneak allows Ceruledge to take out boosted albeit weakened Pokemon like Dragonite, Alolan Raichu, Iron Boulder, and opposing Ceruledge. With Focus Sash, Ceruledge ensures its Weak Armor is activated from most physical attacks, and it lets Ceruledge set up Swords Dance once. Cinderace and Torkoal are great partners for Ceruledge, as they provide entry hazard control with Court Change and Rapid Spin, respectively, so that its Focus Sash is kept intact. Additionally, Torkoal sets up sun to further boost Ceruledge's Bitter Blade and Stealth Rock to aid its sweeping, while Cinderace targets Dark-types such as Ting-Lu, Hydreigon, and Tyranitar, which can pose challenges to Ceruledge's sweeping. Wallbreakers such as Choice Band Victini and Mega Charizard X remove bulky Pokemon that Ceruledge dislikes. Victini takes on Water-types such as Tapu Fini, Urshifu-R, and Dondozo, while Mega Charizard X breaks past Heatran. In return, Victini appreciates Ceruledge handling Psychic-types like Iron Boulder and Mega Latias. Hisuian Arcanine revenge kills boosted sweepers such as Roaring Moon so that Ceruledge can sweep, and it can threaten Flying-types such as Galarian Moltres and Zapdos. Ceruledge can also enable other sweepers and cleaners such as Volcarona by removing Pokemon that threaten them such as Skeledirge so they can start their own sweep.</p>"
      },
      "Swords Dance (Ghost)": {
        "description": "<p>With its high Attack stat, powerful STAB combination, access to Swords Dance, and a great ability in Weak Armor, Ceruledge becomes an incredible wallbreaker for Ghost teams, hitting walls like Heatran, Hisuian Goodra, and Alolan Muk. At +2, Poltergeist outright OHKOs non-Unaware Clodsire and OHKO Mega Sableye, Swampert, and Heatran after a layer of Spikes. Bitter Blade allows Ceruledge to deal with Steel-types like Ferrothorn, Celesteela, and Mega Scizor while restoring its HP, letting it reactivate Focus Sash if not already consumed. Shadow Sneak allows Ceruledge to revenge kill weakened threats like Barraskewda, Iron Boulder, and opposing Ceruledge while also letting it clean opposing Ghost teams. Focus Sash guarantees that Ceruledge activates Weak Armor if it's hit with a physical attack while setting up with Swords Dance. Weak Armor's activation allows Ceruledge to outspeed faster threats like Mega Lopunny and Choice Scarf users like Meowscarada, Iron Boulder, and the Landorus formes. Mimikyu handles Dark-types like Mandibuzz, Ting-Lu, and Hydreigon, and, in return, Ceruledge can deal with Steel- and Poison-types like Ferrothorn, Mega Scizor, and Mega Venusaur. Sinistcha boasts Water and Ground resistances, which allow it to check foes like Ogerpon-W, Urshifu-R, and Great Tusk. Mega Sableye provides entry hazard control, allowing Ceruledge to maintain its Focus Sash. Galarian Corsola and Brambleghast set entry hazards, which makes it easier for Ceruledge to break through bulky foes. Additionally, Brambleghast provides entry hazard removal with Rapid Spin while also providing the same resistances as Sinistcha. Hisuian Zoroark, Gengar, and Gholdengo are excellent partners that help Ceruledge against physical walls like Archaludon, Toxapex, and Great Tusk. In return, Ceruledge deals with special walls such as Clodsire, Blissey, Swampert, and Hisuian Goodra.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 481576, "username": "roxie"}, {"user_id": 637295, "username": "boomp"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Brambleghast": {"sets": {"Entry Hazard Support (Ghost)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Glimmora": {"sets": {"Entry Hazard Support (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/natdex-mono-analyses.828/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Dondozo": {"sets": {"Curse": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Clodsire": {
    "sets": {
      "Water Absorb (Ground)": {
        "description": "<p>Due to its incredible bulk and the ability to neutralize Water-type moves with Water Absorb, Clodsire is a staple for Ground teams, as it is able to stop threats such as Pelipper, Tapu Fini, and Rotom-W. Poison Jab not only spreads status but also lets it hit Grass- and Fairy-type Pokemon such as Tapu Bulu, Ogerpon-W, and Enamorus. Pairing Haze up with Icium Z allows Clodsire the ability to recover any damage from setup sweepers such as Volcarona, Ogerpon-W, and Kommo-o. The given EV spread allows Clodsire avoid a 2KHO from Choice Scarf Meowscarada with Flower Trick, unboosted Ogerpon-W with Horn Leech, and Choice Scarf Greninja with Ice Beam. Landorus provides an immunity to Ground-type moves that threaten Clodsire and offensively threatens Pokemon like Tapu Bulu, Celebi, and Archaludon. Hippowdon is a phenomenal defensive teammate, as it provides Stealth Rock support along with setting sand upon switching in. Hippowdon also defensively supports Clodsire by checking the likes of Ceruledge, Great Tusk, and Iron Hands. Excadrill, in conjunction with sand, is a powerful wallbreaker for Clodsire that can outspeed many Pokemon and deal raw damage with a Choice Band, checking threats such as Tapu Lele, Greninja, and Mega Gallade. Garchomp is an effective teammate that assists by checking Dragon-type threats such as Kommo-o and Kyurem. Mamoswine is another great teammate for Clodsire, as its Ice typing and powerful STAB moves assists in checking threats like the Landorus formes and Dragonite. Both Mamoswine and Garchomp deal offensive pressure to Steel- and Flying types such as Celesteela and Corviknight, which Clodsire cannot do on its own.</p>"
      },
      "Unaware (Poison)": {
        "description": "<p>Clodsire is an incredible specially defensive wall for Poison teams thanks to its solid stats and ability in Unaware, making it a solid check into special threats such as Hydreigon, Volcarona, and Gholdengo. Low Kick is used to break Hydreigon's Substitute along with popping Air Balloon from Heatran, while Poison Jab can be used to spread poison and do consistent damage to Flying-types like Zapdos and Tornadus-T. Clodsire's access to both Spikes and Stealth Rock provides it with good opportunities to set entry hazards, with Stealth Rock being preferred because it damages every Pokemon. Alternatively, Curse can patch up Clodsire's poor physical stats and make it a win condition. Mega Venusaur serves as a great defensive compliment to Clodsire with its ability to handle Water- and Ground-types like Barraskewda, Urshifu-R, Great Tusk, and Excadrill. Alolan Muk supports Clodsire by dealing with special attackers that threaten Clodsire like Latios, Tapu Lele, and Celebrate Victini. Crobat provides a solid Ground immunity, Defog to remove entry hazards while checking threats like Mega Gallade and Ogerpon-W, and Toxic to help outlast opponents. Choice Scarf Nihilego supports Clodsire by removing Ice- and Flying-types like Weavile, Mega Aerodactyl, the Landorus formes, and Mega Charizard Y. Choice Scarf Sneasler can help remove problematic faster threats like Choice Scarf Excadrill, Weavile, and Choice Scarf Tapu Lele while greatly appreciating Clodsire's hazards to damage Porygon2 and Rotom-W, along with its ability to use Switcheroo to force an unwanted Choice Scarf onto targets like Corviknight.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 622813, "username": "Pengairxan"}, {"user_id": 635656, "username": "Elvira"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 649096, "username": "a blue banana"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Great Tusk": {
    "sets": {
      "Utility (Fighting)": {},
      "Choiced Attacker (Fighting)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Bulk Up (Ground)": {
        "description": "<p>Great Tusk is a deadly wallbreaker on Ground teams, possessing excellent stats, a potent STAB combination, and access to utility moves like Knock Off and Rapid Spin. Close Combat threatens Ice- and Dark-types such as Baxcalibur, Hydreigon, and Hisuian Samurott as well as OHKOing walls like Celesteela, Corviknight, Mega Scizor, and Rotom-W with the aid of Fightinium Z after a Bulk Up boost, easing the Steel matchup for Great Tusk's team. Earthquake hits Pokemon like Skeledirge, Gholdengo, and Toxapex, while Ice Spinner nails Landorus-T, Dragonite, and Zapdos, allowing Great Tusk to boast unresisted coverage in combination with Close Combat. Rapid Spin allows Great Tusk to gain a Speed boost to easily snowball against slower teams and remove entry hazards for teammates; however, Knock Off is great for Air Balloon Gholdengo and weakened Slowbro as well as generally forcing progress against teams by removing their items. Gastrodon and Clodsire are essential teammates for Great Tusk due to their immunities to Water-type attacks, letting them fend off Barraskewda, Urshifu-R, and Keldeo. Gastrodon also has an appreciated neutrality to Ice-type attacks, letting it check Choice Scarf Weavile, and Clodsire is neutral to Grass-type attacks, letting it wall Meowscarada. It can also wall Fairy-types like Tapu Koko, Tapu Fini, and Iron Valiant. Furthermore, Gastrodon and Clodsire provide chip damage via Toxic and entry hazards, wearing down walls like Slowbro, Swampert, and Mantine that give Great Tusk a hard time. Landorus forms a potent wallbreaking core with Great Tusk, breaking Slowbro, Dondozo, and Mandibuzz as well as offering Gravity, letting Great Tusk more easily spam Earthquake. In return, Landorus appreciates Great Tusk threatening Ice Shard users like Mamoswine and Baxcalibur. Mega Steelix is an excellent teammate, as it fights off Azumarill, Weavile, and Alolan Ninetales, making it a huge asset in the Fairy and Ice matchups. Ting-Lu forms an entry hazard-stacking core with Gastrodon and Clodsire, wearing down teams exponentially faster with the help of Whirlwind. Additionally, Ting-Lu switches into attacks from revenge killers like Blacephalon, Latias, and Hisuian Zoroark. Mamoswine appreciates Great Tusk breaking Celesteela and Corviknight; in return, Mamoswine utilizes Thick Fat to fight the aforementioned Ice-types and provides speed control with Choice Scarf, outpacing Mega Diancie, Enamorus, and Tapu Koko. Choice Scarf Iron Treads outpaces and OHKOes the aforementioned Fairy-types, most notably Iron Valiant, and provides pivoting support via Volt Switch.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Iron Treads": {
    "sets": {
      "Choice Scarf (Ground)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Choice Scarf (Steel)": {
        "description": "<p>Iron Treads is a great Choice Scarf user on Steel teams due to its great Speed tier, notably allowing it to outpace Volcarona after a Quiver Dance and Mega Charizard X after a Dragon Dance. It also has a great variety of coverage moves, aiding against Landorus and the aforementioned Fire-types. Earthquake targets threats such as Heatran, Zeraora, Sneasler, and Gholdengo. Iron Head hits Fairy-types like Tapu Bulu, Iron Valiant, and Enamorus, while Volt Switch allows Iron Treads to maintain momentum and pivot out of unfavorable switch-ins like Pelipper and Slowbro. Ice Spinner hits Ground- and Dragon-types such as Landorus, Dragonite, and Garchomp while also aiding in the Flying matchup, removing Tornadus-T, Zapdos, and Gliscor. Furthermore, Ice Spinner removes Psychic Terrain for Mega Scizor, which relies on Bullet Punch. Stone Edge threatens Fire- and Flying-types like Volcarona, Articuno, and Mega Charizard Y. Alternatively, Knock Off pressures defensive switch-ins such as Rotom-W, Celesteela, and Ferrothorn while also being Iron Treads's best move against Air Balloon Gholdengo and Latias. Iron Treads can provide emergency entry hazard removal via Rapid Spin for faster-paced Steel teams. Hard Press is a niche option to remove frail targets like Meowscarada; however, Iron Head allows Iron Treads to revenge kill weakened Pokemon. Gholdengo is an excellent teammate that greatly capitalizes on Z-Moves, offers a Fighting-type immunity, and acts as a situational Ground-type immunity with Air Balloon. It also removes walls like Slowbro, Corviknight, and defensive Great Tusk. In return, Iron Treads offers a valuable answer to Fire-types such as Cinderace, Volcanion, and Victini. Heatran absorbs Fire-type attacks from faster threats like Choice Scarf Blacephalon and Iron Moth, in addition to setting up Stealth Rock to wear down switch-ins for Iron Treads. Celesteela and Corviknight offer a Ground-type immunity, walling Sand Rush Excadrill and Hippowdon. Furthermore, Corviknight provides slow pivoting via U-turn, while Celesteela pressures foes with residual chip damage using Toxic and Leech Seed. In exchange, Iron Treads threatens Electric-type Pokemon like Tapu Koko, Regieleki, and Sandy Shocks, as well as Fire teams, removing Hisuian Arcanine and Ceruledge once its Focus Sash has been broken. Ferrothorn is a great buffer against Water- and Ground- types like Gastrodon, Swampert, Mamoswine, and Slowking. Additionally, Ferrothorn boasts an array of utility options such as Leech Seed, Knock Off, and Spikes, wearing down Iron Treads's switch-ins and allowing for a free Stone Edge moveslot.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574288, "username": "Giyu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 532439, "username": "Bka Onon"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Iron Hands": {"sets": {"Assault Vest (Electric)": {"description": "<p>Survives Dragonite's +2 Earthquake and is not 2HKO'ed by Mega Charizard-Y. Outspeeds Blissey and OHKO's Garchomp with Ice Punch under Electric terrain.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Iron Moth": {
    "sets": {
      "Choice Scarf (Poison)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Choice Scarf (Fire)": {
        "description": "<p>Choice Scarf Iron Moth makes for a great cleaner on Fire teams by virtue of its diverse moveset and being able to outspeed Mega Swampert and non-Choice Scarf Greninja. Energy Ball handles Water-, Rock-, and Ground-types like Greninja, Mega Diancie, and Great Tusk. Sludge Wave targets the Ogerpon formes as well as Fairy-types such as Enamorus and Tapu Koko. Dazzling Gleam covers threats such as Hydreigon and Kommo-o. Torkoal sets up sun to boost Iron Moth's Fiery Dance to make it a more terrifying snowballing option and Stealth Rock to aid Iron Moth's cleaning, notably breaking Focus Sash and Sturdy from their users. Both Torkoal and Cinderace also serve as entry hazard control with Rapid Spin and Court Change, respectively, and the latter can bring Iron Moth in with U-turn to keep momentum. Mega Charizard X and Hisuian Arcanine pair well with Iron Moth, as they take on Heatran and Blissey, which otherwise wall Iron Moth. Heatran itself serves as a great partner, as due to its access to Magma Storm and Taunt, it can shut down and eliminate walls such as Toxapex. In return, Heatran appreciates Iron Moth taking on Ground-types such as Great Tusk, Mega Swampert, and Gastrodon. Thanks to Iron Moth's ability to take on bulky foes such as Mega Sableye and Tapu Fini as well as speedy Pokemon such as Iron Treads and Choice Scarf Enamorus, it can enable late-game sweepers such as Ceruledge and Volcarona to begin their own sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}, {"name": "Quality checked by", "members": [{"user_id": 635656, "username": "Elvira"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Gholdengo": {
    "sets": {
      "Z-Move (Ghost)": {
        "description": "<p>Having a typing with a lot of relevant resistances, an immunity to status moves thanks to Good as Gold, and great longevity by virtue of having Recover, Gholdengo is a potent stallbreaker for Ghost teams. Shadow Ball hits most foes for neutral damage, with Never-Ending Nightmare at +2 OHKOing foes such as Mega Sableye, Galarian Slowking, and Corviknight. Make It Rain lets Gholdengo hit foes such as Alolan Muk, Mandibuzz, and Kommo-o, as well as OHKO Ice- and Fairy-type foes such as Mamoswine, Alolan Ninetales, and Iron Valiant, and at +2, this move OHKOes Gliscor, Hippowdon, and Ursaluna. The given EV spread allows Gholdengo to outspeed Adamant Mamoswine and avoid a 2HKO from Mega Scizor's Knock Off, Ogerpon-C's Knock Off after Stealth Rock, and Choice Specs Tapu Lele's Thunderbolt. Mega Sableye forms a good defensive core with Gholdengo, as Mega Sableye mitigates its vulnerability to Dark- and Ghost-type foes such as Meowscarada, Greninja, and Hisuian Zoroark, while Gholdengo handles Fairy-types including Tapu Lele and Iron Valiant. Sinistcha can switch into Ground-types such as Garchomp, Mega Swampert, and Great Tusk that Gholdengo is vulnerable to. Fire-types such as Ceruledge and Skeledirge are solid partners that can check other Fire-types that force out Gholdengo such as Cinderace, Victini, and Volcarona.</p>"
      },
      "Choiced Attacker (Ghost)": {},
      "Choice Scarf (Steel)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}, {"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 572981, "username": "Aera"}]}]}
  },
  "Ting-Lu": {"sets": {"Mixed Wall (Dark)": {"description": "<p>Not 2HKO'ed by Choice Scarf Tapu Lele and OHKO'es it back with Heavy Slam.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Physically Defensive (Ground)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Roaring Moon": {
    "sets": {
      "Choice Scarf (Dragon)": {
        "description": "<p>Roaring Moon is the fastest Choice Scarf user Dragon teams have access to, blitzing past opposing Choice Scarf threats like Latias and Enamorus, while also outspeeding Iron Valiant under Electric Terrain. Iron Head targets Mega Diancie and Alolan Ninetales; though it doesn't OHKO Iron Valiant, Tapu Lele, and Mega Altaria, Iron Head deals enough damage to pick these Pokemon off late-game. U-turn lets Roaring Moon keep up the momentum against walls that usually switch into it, such as Ferrothorn, Skarmory, and Archaludon. Knock Off, aside from dealing with Ghost-types like Blacephalon and Gengar, also strips switch-ins like Staraptor, Rotom-W, and Corviknight of their items, making it easier for Dragon teams to overwhelm these defensive Pokemon late-game. Roaring Moon is unfortunately still outsped by even faster Choice Scarf users like Greninja and Meowscarada, or Swift Swim and Sand Rush Pokemon like Barraskewda and Excadrill, so switch-ins to these threats like Hisuian Goodra, Archaludon, or Mega Latias are appreciated. Archaludon and Hisuian Goodra also help a lot against a plethora of threats, with Archaludon providing Stealth Rock while weathering physical assaults from Mega Altaria, Weavile, and opposing Roaring Moon. Whereas Hisuian Goodra takes minimal damage from Tapu Lele and SubRoost Kyurem while also having the ability to phaze out threats Roaring Moon struggles to handle like Autotomize Celesteela or Volcarona. Kyurem and Z-move Kommo-o wear down the defensive cores of Water, Flying, Poison, Steel, and Normal teams which can provide an opening for Roaring Moon to clean up these teams late-game. Mega Altaria and Mega Latias love Roaring Moon removing Mega Diancie and Iron Valiant, as this opens up an opportunity for them to overwhelm Fairy and Fighting teams late-game. Garchomp wears down Steel- and Poison-types like Skarmory and Toxapex that Roaring Moon has trouble with, sets Spikes, and can phaze out threats like Volcarona and Unburden Sneasler that take advantage of Roaring Moon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542526, "username": "Neko"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Iron Valiant": {
    "sets": {
      "Swords Dance (Fairy)": {
        "description": "<p>Iron Valiant's combination of stats, typing, and coverage makes it an excellent wallbreaker for Fairy teams, capable of outrunning Mega Diancie, Nihilego, and Iron Treads. At +2 Attack, All-Out Pummeling OHKOes troublesome walls such as physically defensive Celesteela and Corviknight. Spirit Break notably breaks Mega Sableye, enabling Iron Valiant to greatly pressure Dark and Ghost teams. Knock Off deals with Ghost-types like Gholdengo and Aegislash, allowing Iron Valiant to heavily dent Steel. It also removes important items from Clodsire, Klefki, and Toxapex. Shadow Sneak can be used over Knock Off to pick off weakened foes like Blacephalon. Iron Valiant loves Klefki's ability to set dual screens and Spikes, as this allows Iron Valiant to set up more easily and deal with bulkier cores better. Tapu Lele sets Psychic Terrain, neutralizing Mega Scizor's Bullet Punch, and it also deals with Poison-types Iron Valiant has a hard time with, such as Mega Venusaur and Toxapex. Tapu Koko's Electric Terrain activates Iron Valiant's Quark Drive, letting it outspeed the likes of Mega Lopunny and Mega Swampert under rain. Tapu Bulu improves the Water and Ground matchups and removes bulky Water-types like Toxapex and Dondozo. Mega Diancie and Azumarill love Iron Valiant's ability to soften walls, as it allows them to clean up late-game.</p>"
      },
      "Choice Scarf (Fighting)": {
        "description": "<p>Iron Valiant is one of Fighting teams' best assets with amazing qualities between its typing, Speed, and offenses. Choice Scarf accentuates its Speed further and lets it outspeed many threats to Fighting teams such as Tornadus-T, Tapu Koko, and Choice Scarf users such as Tapu Lele and Galarian Zapdos. Its STAB Moonblast is one of its best qualities, being able to easily beat Mega Sableye and OHKO most opposing Fighting- and Dragon-types such as Buzzwole and Mega Altaria. Thunderbolt is great coverage to hit Flying- and Water-types like Tornadus-T and Toxapex that otherwise wall Iron Valiant, while Energy Ball lets it deal with Mega Swampert, which it can outspeed even under rain, Rotom-W, and Gastrodon more easily. Shadow Ball prevents Iron Valiant from being walled by Gholdengo, Skeledirge, and Aegislash while also improving the Psychic matchup. Knock Off and Trick cripple defensive switch-ins such as Toxapex, Celesteela, and Clodsire by removing or replacing important items and forcing them to go without passive recovery or be Choice locked. Iron Valiant is also a great asset in the Fairy and Electric matchups, as it uses opposing Tapu Koko's Electric Surge to activate its own Quark Drive and outspeed even Regieleki and Alolan Raichu under Electric Terrain. Iron Valiant appreciates support from Mega Gallade, as it easily takes care of Poison-types like Clodsire, Mega Venusaur, and Alolan Muk. Iron Hands and Great Tusk are great teammates for the Electric matchup while also beating the likes of Toxapex, Galarian Moltres, and Gholdengo. Cobalion and Great Tusk can set up Stealth Rock and even clear entry hazards in the case of the latter. Cobalion also helps against Fairy-types such as Tapu Bulu and Tapu Lele, while Great Tusk helps deal with Tapu Koko and Assault Vest Iron Hands. Choice Band Urshifu-R is a great ally to beat Fire-types such as Volcarona and Skeledirge and Ground-types such as Landorus-T and Excadrill. Kommo-o deals with bulky Water-, Fire-, and Grass-types like Toxapex, Skeledirge, and Mega Venusaur with its massive Clangorus Soulblaze in conjunction with Taunt. Breloom is also a natural counter to Water-types, being able to deal with Swampert, and hindering defensive walls such as Toxapex with Spore. Galarian Zapdos is another great teammate that can weaken foes and safely get in Iron Valiant with U-turn.</p>"
      },
      "Bolt-Beam Swords Dance (Fairy)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 532439, "username": "Bka Onon"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Quality checked by", "members": [{"user_id": 321991, "username": "Mateeus"}, {"user_id": 542526, "username": "Neko"}, {"user_id": 593863, "username": "CrossHeart"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}, {"user_id": 528036, "username": "Sulo"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Walking Wake": {"sets": {"Choice Specs (Water)": {"description": "<p>The EV spread provides a Speed Protosynthesis boost under sun.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Sinistcha": {
    "sets": {
      "Calm Mind (Ghost)": {
        "description": "<p>Sinistcha is the most physically defensive Ground-resistant Pokemon Ghost teams have access to, which is useful for dealing with Excadrill and Mega Swampert. It also pressures Grass-neutral Pokemon like Clodsire and Toxapex on Water and Ground teams with ease. Matcha Gotcha improves Sinistcha's longevity and lets it fish for burns against the aforementioned Pokemon neutral to Grass as well as common switch-ins like Celesteela and Alolan Muk. Substitute lets Sinistcha avoid status from Toxapex and gives it more turns to threaten a burn on would-be checks like Iron Hands and Mega Lopunny and chip down answers like Choice Specs Zapdos. Shadow Ball is usually preferred for its consistent damage output without relying on burns, but Hex lets Sinistcha further pressure opposing threats after they are burned. 96 Speed EVs let Sinistcha outspeed Adamant Azumarill, while the remaining EVs are poured into maximizing its bulk to weather Choice Band Excadrill, Ogerpon-W, and Mega Swampert better. Physical setup sweepers like Mimikyu and Ceruledge form a decent wallbreaking core with Sinistcha, dealing with special walls like Hisuian Goodra and Alolan Muk, while Sinistcha obliterates physical walls like Hippowdon and Great Tusk. Gholdengo loves Sinistcha's ability to remove Ground-types and in turn is able to wear down or remove Alolan Muk and Mantine, deal with prominent Knock Off users like Meowscarada if using a Z-Crystal, and take on Flying-types like Mega Aerodactyl and Articuno for it. Mega Sableye also absorbs Knock Off and can wear down opposing teams for Sinistcha with its ability to spread status and remove items.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542526, "username": "Neko"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}, {"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 635656, "username": "Elvira"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Okidogi": {"sets": {"Bulk Up (Poison)": {"description": "<p>52 Speed EVs outspeeds uninvested Rotom-W.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Ogerpon-Wellspring": {
    "sets": {
      "Swords Dance (Water)": {
        "description": "<p>Ogerpon-W is a strong wallbreaker on Water teams by virtue of its great Attack, which can be further boosted by Swords Dance; great Speed; a unique resistance to Ground, improving that matchup; and a selection of coverage options it can choose from. Horn Leech not only lets Ogerpon-W recover HP, but it also targets the likes of Urshifu-R, Slowbro, and Mantine, which can otherwise shrug off an Ivy Cudgel. At +2, Play Rough targets Dragon- and Fighting-types such as Kyurem, Kommo-o, and Iron Hands. After a Swords Dance boost, Superpower is great against Steel-types like Hisuian Goodra, Archaludon, and Ferrothorn; unboosted, it also OHKOes Kyurem after Stealth Rock chip. Taunt shuts down passive walls such as Toxapex, Gastrodon, and Thunder Wave Archaludon to force them out and get the opportunity to set up, while after a boost, Knock Off targets Sinistcha. Swampert provides entry hazard support to help Ogerpon-W wallbreak and pivoting with Flip Turn; its Electric immunity improves the matchup against the type, handling the likes of Zeraora, Iron Hands, and Regieleki. Empoleon and Pelipper remove hazards in Defog so that Ogerpon-W does not get worn down. Additionally, Empoleon threatens Fairy-types such as Tapu Lele and Alolan Ninetales, as well as Tornadus-T and Kyurem, while Pelipper sets up rain to boost Ogerpon-W's Ivy Cudgel, handles Grass-types like Meowscarada and Mega Venusaur, and brings it in safely with U-turn. In return, Empoleon appreciates Ogerpon-W handling Ground-types such as Great Tusk and the Landorus formes, while Pelipper appreciates the removal of Hisuian Arcanine, the Landorus formes, and Gholdengo. Choice Scarf Tapu Fini, with its amazing bulk, handles fast Fighting- and Dragon-types like Iron Valiant, Mega Lopunny, and Dragon Dance Roaring Moon and can shift its Choice Scarf to walls like Toxapex and Clodsire with Trick so Ogerpon-W can handle them more easily. Choice Specs Greninja, with its colorful coverage boosted by Protean, handles a multitude of threats like opposing Ogerpon-W, Tapu Bulu, and Mega Venusaur. When paired with Pelipper, Ogerpon-W's wallbreaking opens up the door for rain-boosted sweepers and cleaners such as Mega Swampert and Barraskewda.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Quality checked by", "members": [{"user_id": 542526, "username": "Neko"}, {"user_id": 637295, "username": "boomp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Ogerpon-Cornerstone": {
    "sets": {
      "Setup Sweeper (Grass)": {
        "description": "<p>Ogerpon-C is a formidable choice on Grass teams that holds its own over its Rock typing, coupled with it's amazing Attack and Speed, makes it a formidable threat to the Bug-, Fire-, Ice-, and Flying-types that threaten Grass teams such as Volcarona, Mega Charizard Y, Alolan Ninetales, and Tornadus-T with the powerful and accurate Ivy Cudgel. Swords Dance can boost Ogerpon-C's Attack to a threatening level, boosting Ivy Cudgel even more to break through formidable walls such as Corviknight and Celesteela. Horn Leech grants recovery for Ogerpon-C while also regaining Sturdy once it gets back to full. At +2, Superpower breaks through Steel- and Dark-type Pokemon like Archaludon, Heatran, and Hydreigon. Choice Scarf Meowscarada can handle any threatening Dragon-types for Ogerpon-C such as Roaring Moon, MegaAltaria, and Kommo-o with its Protean-boosted Play Rough while also removing Heavy-Duty Boots from Dragonite and Leftovers from Corviknight with Knock Off. Mega Venusaur is a defensive teammate for Ogerpon-C that can take threatening Fire- and Ice-type moves with its ability, Thick Fat, such as Meowscarada's Triple Axel. Ferrothorn is another defensive teammate that can provide entry hazard support and take on physical threats such as Melmetal and Weavile. Sinistcha is a great late-game setup sweeper that can become a wincon alongside Ogerpon-C with access to Calm Mind and Strength Sap. Breloom provides a form of priority with Technician-boosted Mach Punch and can put foes to sleep with Spore.</p>"
      },
      "Swords Dance (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 635656, "username": "Elvira"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 532439, "username": "Bka Onon"}]}, {"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 481576, "username": "roxie"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Archaludon": {"sets": {"Physically Defensive (Dragon)": {"description": "<p>16 Speed EVs outspeeds Great Tusk and 12 SpD EVs lets it survive Mega Diancie's Earth Power.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Hydrapple": {"sets": {"Nasty Plot (Grass)": {"description": "<p>172 Speed EVs lets Hydrapple outspeed Pelipper.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Raging Bolt": {"sets": {"Calm Mind (Electric)": {"description": "<p>164 Speed EVs outspeeds uninvested Gliscor.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}},
  "Iron Boulder": {
    "sets": {
      "Choice Scarf (Psychic)": {
        "description": "<p>Choice Scarf Iron Boulder cleaves through speedy threats like opposing Choice Scarf users such as Meowscarada, Enamorus, and Roaring Moon as well as generally fast Pokemon like Ogerpon-W, Mega Lopunny, and Mega Aerodactyl. Close Combat smashes Steel-types aiming to take on Mighty Cleave such as Heatran and Hisuian Goodra and is Iron Boulder's main way to revenge kill the aforementioned Dark-types. Earthquake threatens Alolan Muk, which can swap in against Iron Boulder due to its immunity to Zen Headbutt, and OHKOes Electric-types like Alolan Raichu and Regieleki. Megahorn deals with Ogerpon-W, which greatly threatens Psychic's most common physical wall in Slowbro, while Zen Headbutt lets it clean Fighting teams late-game. Alternatively, Iron Boulder can choose to run Throat Chop to deal with Ghost-types more effectively or Iron Head to finish off Mega Altaria and OHKO Alolan Ninetales and Mega Diancie. Strong wallbreakers like Mega Gallade, Nasty Plot Deoxys-S, Choice Specs Tapu Lele, and Choice Band Victini support Iron Boulder by either greatly weakening or outright removing defensive walls like Celesteela, Archaludon, and Porygon2, which helps it clean Flying, Dragon, and Normal teams late-game. Entry has from Jirachi and Celebi are helpful to offset Iron Boulder's mediocre damage. Jirachi can pivot Iron Boulder in with U-turn, while Celebi can swap into Ground- and Water-types like Mega Swampert and Ogerpon-W. Mega Latias swaps into predicted Ground- and Grass-type moves and appreciates Iron Boulder weakening or removing Alolan Muk to attempt to set up a sweep with Calm Mind.</p>"
      },
      "Swords Dance (Psychic)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"},
      "Choice Scarf (Rock)": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 542526, "username": "Neko"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}, {"user_id": 542526, "username": "Neko"}]}, {"name": "Quality checked by", "members": [{"user_id": 637295, "username": "boomp"}, {"user_id": 321991, "username": "Mateeus"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Terapagos": {"sets": {"Calm Mind": {"description": "<p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}},
  "Pecharunt": {"sets": {"Physically Defensive (Ghost)": {"description": "<p>28 Speed EVs lets it outspeed Jolly Azumarill.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}, "Nasty Plot (Ghost)": {"description": "<p>28 Speed EVs lets it outspeed Jolly Azumarill.</p> <p>This is the sample set before we work on <a href=\"https://www.smogon.com/forums/forums/national-dex-analyses.765/\">new analyses</a>. This will be updated as the metagame continues to develop. Stay tuned!</p>"}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 508532, "username": "TheShowdownHoedown"}]}]}}
}