{
  "Magneton": {
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>Magneton distinguishes itself as a good offensive pivot through its Steel typing, which lets it check Pokemon such as Bruxish, Jolteon, and Scyther, and the fact that it is difficult to switch into due to the combination of its high Special Attack stat and Analytic. Volt Switch allows Magneton to bring in frail teammates such as Zoroark, Medicham, and Bruxish safely. Flash Cannon is able to threaten Sandaconda, which blocks Magneton's Volt Switch, and Tera Fairy Drifblim, Umbreon, and Vaporeon. Magnet Rise is notable to wall Sandaconda, preventing it from forcing Magneton out. Tera Blast lets Tera Fairy Magneton threaten Dark- and Dragon-types that check it such as Umbreon and Appletun, or it hits Ground-types that cause Magneton trouble like Whiscash and Sandaconda if it is Tera Grass. Tera Fairy flips the script on Fighting-types, like Passimian and Paldean Tauros, while Tera Grass comes with the added benefit of giving Magneton resistances to Ground- and Water-type moves, which can be useful against Sandaconda and Bruxish.</p> <p>Magneton fits well in VoltTurn cores with Pokemon such as Passimian, Scyther, and Bombirdier. Magneton can struggle against special walls such as Eelektross, Chansey, and Appletun, so Magneton appreciates teammates that can break these Pokemon, such as Passimian, Bruxish, and Mabosstiff. Magneton is liable to be chipped down over time by entry hazards due to its lack of recovery, so it appreciates Defoggers such as Drifblim, Lurantis, and Scyther. Additionally, Magneton does not like its Eviolite being removed by Knock Off, which makes Pokemon such as Umbreon and Qwilfish that can absorb Knock Off great partners. Magneton can also struggle versus Ground-types not threatened by Flash Cannon, like Camerupt and Whiscash, so Water- and Grass-types such as Appletun and Vaporeon make for helpful teammates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "plznostep", "user_id": 595639}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pokeslice", "user_id": 509790}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Muk": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Muk serves as a great tank and Haze user in SV NU, checking various special attackers such as Vivillon and Zoroark and threatening them with Poison Jab and Drain Punch respectively. Poison Touch and Poison Jab let Muk effortlessly spread poison, even on Pokemon immune to Toxic Spikes such as Drifblim and Eelektross. Drain Punch hits Steel-types such as Copperajah and Terastallized Appletun that would otherwise wall Muk. Haze stops setup sweepers such as Vivillon and Calm Mind Vaporeon from setting up. Toxic Spikes lets Muk take advantage of free turns and cripple the opposing team with poison. Tera Dark allows Muk to beat threats like Bruxish and Zoroark after baiting them into their powerful Dark- and Psychic-type attacks and retaliate back while also being able to use Haze against boosted Stored Power users like Veluza and Farigiraf. Alternatively, Tera Water provides an overall better defensive typing, more specifically easing the matchup against offensive Water-types like Calm Mind Vaporeon and Choice Specs Clawitzer. Muk struggles with Pokemon such as Sandaconda, which does not fear its poison due to Shed Skin and can threaten it back with Earthquake. As a result, Muk appreciates teammates such as Rotom, Eelektross, and Cacturne, which can switch into Sandaconda and force it out. Muk is physically frail, making physical walls such as Sandaconda and Drifblim great partners, with the latter also getting rid of entry hazards, which chip Muk down throughout a game.</p> "
      },
      {
        "name": "Curse",
        "description": "<p>Curse Muk checks specially offensive threats while having the additional benefit of acting as a wincon. Curse boosts Muk's above-average Attack and below-average Defense, complementing its good Special Defense. Drain Punch not only hits special attackers like Zoroark, Rotom-F, and Dudunsparce but also gives Muk longevity, solidifiying its sweeping potential. Shadow Sneak provides Muk with a form of priority, allowing it to revenge kill Ghost-types like Haunter and Rotom or faster threats like Bruxish and Veluza. Poison Touch in combination with Poison Jab gives Muk a 51% chance to poison foes, wearing them down in the process. Sticky Hold prevents Muk from being crippled by Trick from Rotom or Knock Off from Passimian. Tera Water serves as a strong defensive typing, while Tera Dark can be used to help Muk combat Pokemon like Bruxish and Farigiraf. Lurantis pairs well with this particular Muk set, removing Pokemon like Sandaconda, Haze Vaporeon, and Taunt Qwilfish. Zoroark and Passimian can scare away Psychic-types like Bruxish, Indeedee-F, and Medicham that hinder Muk's ability to set up and sweep.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "plznostep", "user_id": 595639}, {"username": "poh", "user_id": 298730}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Haunter": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Haunter is a great Choice Scarf user and late-game cleaner in NU because it outspeeds other notable Choice Scarf users such as Rotom, Passimian, and Bruxish and has perfect coverage for the tier. Shadow Ball threatens Ghost- and Psychic-types such as Drifblim, Rotom, and Medicham, while Focus Blast threatens Normal- and Dark-types such as Dudunsparce, Ursaring, and Umbreon that can comfortably switch into Shadow Ball. Trick lets Haunter punish walls such as Chansey, Poison Touch Muk, and Umbreon by crippling them with a Choice Scarf. Sludge Bomb threatens Pokemon such as Appletun and Cacturne and can inflict poison on special walls like Eelektross, which pressures them throughout the match. It can also threaten various Pokemon such as Tera Fairy Umbreon and Drifblim. Nasty Plot can be run instead to give Haunter a boosting option after it has gotten rid of its Choice Scarf via Trick, threatening Pokemon such as Umbreon much more effectively. Destiny Bond can be used as a last resort to neutralize dangerous setup sweepers such as Coil Eelektross, Coil Sandaconda, and Bulk Up Ursaring as well as punish offensive threats such as Passimian, Zoroark, and Scyther that may attempt to revenge kill Haunter after it has lost its Choice Scarf. Tera Ghost is able to increase Haunter's cleaning potential by powering up Shadow Ball. Tera Fighting can be used to assist Haunter versus Pokemon such as Cacturne and Lycanroc by granting resistances to Sucker Punch and Accelerock, and it also powers up Focus Blast. Haunter has horrible bulk and cannot take even resisted hits well, so it is advised that you pair it with pivots such as Eelektross, Passimian, and Scyther. Furthermore, Haunter struggles with special walls such as Chansey, Umbreon, and Muk, so powerful physical attackers such as Passimian and Medicham can assist in solving this issue.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "plznostep", "user_id": 595639}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pokeslice", "user_id": 509790}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "Clouds", "user_id": 356215}]}]}
  },
  "Electrode": {"sets": [{"name": "Offensive Pivot"}]},
  "Chansey": {"sets": [{"name": "Utility"}]},
  "Scyther": {"sets": [{"name": "Pivot"}, {"name": "Swords Dance"}]},
  "Tauros-Paldea-Combat": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Paldean Tauros is a terrific Bulk Up sweeper with its great Speed and wide offensive movepool. After using Trailblaze, Paldean Tauros outspeeds Choice Scarf users like Passimian and Rotom. Stone Edge is great coverage for common Fighting-resistant foes like Haunter, Scyther, and Drifblim, while Tera Electric lets Paldean Tauros hit the aforementioned Flying-types and Vaporeon with Tera Blast and offers an immunity to paralysis. Tera Rock Stone Edge and Tera Electric Tera Blast both allow Paldean Tauros to OHKO Drifblim. Leftovers aids its general longevity, while Lum Berry allows it to set up safely once against status users like Rotom and Drifblim. Offensive Pokemon like Choice Scarf Rotom and Zoroark appreciate Paldean Tauros forcing out foes like Umbreon and Chansey; in return, they can check Ghost-types like opposing Rotom and Drifblim. Defensive teammates like Vaporeon and Chansey can sponge special attacks and either help its longevity with Wish or its offensive capabilities with Thunder Wave.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Vaporeon": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Vaporeon checks Pokemon like Sandaconda, Bruxish, and Oricorio-F thanks to its immense natural bulk and plethora of utility moves while keeping its teammates healthy with Wish. Haze is the preferred option on Vaporeon, shutting down setup sweepers such as Calm Mind Dudunsparce and Veluza; alternatively, Calm Mind can be used as a late-game win condition. 196 Defense EVs with a Bold nature allow Vaporeon to avoid a 2HKO from Passimian's Close Combat, Choice Band Mabosstiff's Crunch, and Bruxish's Psychic Fangs. The remaining 60 Special Defense EVs help Vaporeon take under 50% from both Rotom's and Jolteon's Volt Switch and blank special wallbreakers such as Choice Specs Zoroark more effectively. Tera Dark, in conjunction with Water Absorb, helps Vaporeon wall Bruxish's and Veluza's STAB moves and beat them one-on-one thanks to Haze. Tera Fairy betters its matchup into Fighting-types, Dark-types, and Coil Eelektross. Tera Steel gives Vaporeon immunities to Toxic and Toxic Spikes from Muk, adding to its longevity, as well as a Grass-type resistance to help against Pokemon like Lurantis. Pokemon with abilities that absorb Water-type attacks, such as Toxicroak and Cacturne, are the biggest threat to Vaporeon, so Drifblim, Sandaconda, and Muk all make great partners. Grass-type Pokemon such as Appletun and Lurantis can also switch in and scare out Vaporeon, so packing a check like Scyther, Pyroar, or Oricorio-F is recommended.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Pokeslice", "user_id": 509790}], "teams": [{"name": "Quality checked by", "members": [{"username": "Rabia", "user_id": 336073}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Jolteon": {
    "sets": [
      {
        "name": "Calm Mind Sweeper",
        "description": "<p>The fastest Pokemon available in the tier, Jolteon is an amazing setup sweeper thanks to Calm Mind and its great coverage found through Terastallization. Volt Switch whittles down special walls like Chansey and Muk while safely bringing in a teammate better suited to taking them on such as Bruxish or Sandaconda. An Ice-type Tera Blast gives Jolteon a move to hit Ground- and Grass-types like Sandaconda and Appletun super effectively. Heavy-Duty Boots allows Jolteon to safely pivot in and out of battle without being worn down by entry hazards, especially if it's Terastallized, although it may also use a Life Orb for extra damage output. Jolteon is quite frail, making it vulnerable to revenge killing from Choice Scarf users like Passimian, Bruxish, and Mabosstiff. Passimian, Mabosstiff and Bruxish are also great offensive partners that hit Jolteon's defensive checks in Chansey and Muk. A great defensive partner is Drifblim; it switches into Ground- and, when Jolteon has Terastallized, Fighting-type moves.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "outbackrabbit", "user_id": 399621}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Umbreon": {
    "overview": "<p>Umbreon's amazing utility movepool and peerless bulk make it a top-notch support Pokemon and check to many top tier threats, like Bruxish, Zoroark, and Mabosstiff. Despite its great bulk, Umbreon's offenses are quite lackluster, though this can be somewhat alleviated by STAB Foul Play to punish setup sweepers attempting to exploit Umbreon's passivity, like Coil Eelektross and Bulk Up Ursaring. Setup sweepers that don't mind taking a Foul Play, like Calm Mind Dudunsparce and Quiver Dance Oricorio, can easily take advantage of it. Umbreon also dislikes the plethora of Fighting-types in the tier, like Passimian, Medicham, and Paldean Tauros.</p> ",
    "comments": "<h1>Other Options</h1> <p>Umbreon has a myriad of utility options at its disposal, including being able to set up with Calm Mind. Unfortunately, due to Umbreon's terrible Special Attack, a Calm Mind set typically requires too many boosts to be effective. Umbreon can fit two utility moves if it chooses to use Moonlight instead of Wish and Protect, but the limited PP can become a detriment in longer games. Umbreon can beat setup sweepers that typically take advantage of it, such as Quiver Dance Oricorio and Calm Mind Vaporeon, with Tera Ghost and Curse. Umbreon can also use Taunt and a few extra Speed EVs to stop setup sweepers like Sandaconda and Vaporeon or other support Pokemon like Vespiquen and Muk from using their own status moves. Lastly, Umbreon can trap an unsuspecting foe with Mean Look and wear it down with Foul Play or even drop its stats with Tickle to more easily take it out.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: NU has a plethora of Fighting-types, such as Crabominable, Medicham, and Passimian. Umbreon can Terastallize to reverse this weakness, but that always comes with a new set of weaknesses and removes the option to Terastallize later. Other Pokemon like Scyther and Zangoose have a powerful Close Combat that can threaten Umbreon as well.</p> <p><strong>Opposing Utility Moves: Regardless of Synchronize, a poisoned Umbreon, whether by Toxic or Toxic Spikes, is extremely impaired and struggles to fulfill its role. Trick from a Choice Scarf Haunter or Rotom can completely ruin Umbreon despite it being a suitable check to them otherwise. Taunt from Pokemon like Bombirdier, Qwilfish, and opposing Umbreon can limit Umbreon to only an exploitable Foul Play.</p> <p><strong>Special Setup Sweepers: Setup sweepers that don't mind Foul Play, mainly special attackers like Oricorio, Vivillon, and a Terastallized Farigiraf can easily boost against Umbreon.</p> ",
    "sets": [
      {
        "name": "Wish Support",
        "description": "<h1>Set Details</h1> <p>Foul Play is surprisingly powerful with STAB, letting Umbreon threaten even neutral physical attackers. Umbreon's immense bulk lets it spread status with Thunder Wave or Yawn to support its teammates, and Wish can keep teammates that lack reliable recovery such as Perrserker and Eelektross healthy. While Pokemon like Tera Ground Oricorio and Coil Eelektross are immune to Thunder Wave, Yawn can shut down their setup attempts nicely. Synchronize can deter or punish careless status moves used by the likes of Dudunsparce and Drifblim. Umbreon prefers a Poison or Fairy Tera type to turn the tables on Fighting-types and take U-turn better. Tera Poison also provides a Fairy resistance and an immunity to Toxic and Toxic Spikes from common users like Muk, Qwilfish, and Vespiquen.</p> <p>Umbreon appreciates Drifblim and Qwilfish for their Fighting resistance. Drifblim can remove entry hazards and take advantage of Umbreon's status moves with Hex, while Qwilfish can consistently punish Fighting-type moves and U-turn from Pokemon like Passimian and Scyther with Poison Point and Rocky Helmet. Bruxish and Rotom appreciate Umbreon's resistance to Ghost- and Dark-type attacks and its ability to inflict paralysis and sleep.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}], "teams": [{"name": "Quality checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Pokeslice", "user_id": 509790}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Qwilfish": {
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<p>Qwilfish is a premier physical wall in the tier owing to its great defensive typing and abilities, as well as a bevy of amazing utility moves including the highly coveted Spikes and Toxic. Qwilfish can wear down the opposition with its combination of Spikes and Toxic and even prevent Defog and recovery moves with Taunt. Waterfall is used over Liquidation to potentially cause flinching, which works wonders in conjunction with Toxic, although Surf can be used for a 2HKO on Sandaconda and more damage on other physically bulky Pokemon like Drifblim and Klawf. Despite Intimidate being such a high-value ability, Qwilfish typically prefers Poison Point to punish U-turn from the likes of Passimian and Scyther while not activating Passimian's Defiant in the process. Protect can be used with Leftovers for some extra recovery and also to scout moves from Choice item users like Rotom, Bruxish, and Zoroark. Upon scouting these Pokemon, Qwilfish can invert its weakness to Electric- or Psychic-type moves with a timely Terastallization to a respective Ground or Dark typing, letting it spread more poison and set more Spikes. Umbreon is a great defensive partner, sponging general special attacks while boasting an immunity to Psychic. In return, Qwilfish heavily punishes Fighting-type attacks and U-turn, while also resisting Fairy. Phasers like Dragon Tail Dudunsparce and Eelektross make great use of the Spikes Qwilfish sets up, racking up damage for a faster Pokemon to more easily sweep. Choice Scarf Passimian takes advantage of hazard damage while also punishing Defog with its Defiant ability.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}], "teams": [{"name": "Quality checked by", "members": [{"username": "Rabia", "user_id": 336073}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Ursaring": {
    "overview": "<p>Ursaring is an amazing wallbreaker in NU. Eviolite + Bulk Up Ursaring makes for a fantastic sweeper, while Flame Orb sets make great use of Trailblaze, which makes Ursaring more difficult to revenge kill, and makes for a great status absorber for its teammates. However, Bulk Up Ursaring only has room for one attack, leaving it lacking in coverage, and Flame Orb Ursaring's poor defenses and Speed leave it subject to easy revenge killing.</p> ",
    "comments": "<h1>Other Options</h1> <p>Ursaring can use Toxic Orb to benefit from Quick Feet, but this set often falls short in both Speed and power. Bulk Up Ursaring can forgo Sleep Talk in favor of another coverage move, but this leaves it quite vulnerable after Rest. Crunch can be used over Play Rough for overall better coverage, but Tera Fairy's defensive attributes and STAB Play Rough are better in most situations. Ursaring can drop a setup move altogether on the RestTalk set, making for a great special tank with a little extra coverage, typically using Body Slam for STAB and Play Rough or Crunch to hit Ghost-types.</p> <h1>Checks and Counters</h1> <p><strong>Anti-setup Pokemon</strong>: Bulk Up Ursaring is quite hard to get going against common anti-setup Pokemon like Haze Vaporeon, Strength Sap Drifblim, and Trick Rotom. Tera Fairy at least allows Ursaring an immunity to Dragon Tail, but there are plenty of Encore, Haze, and similar utility move users available that can make it difficult for Ursaring to sweep.</p> <p><strong>Fighting-types and Coverage: NU is teeming with Fighting-types ready to punch Ursaring in the face; Medicham, Toxicroak, Passimian, and Paldean Tauros pressure Ursaring to switch out or Terastallize for fear of being KOed. Pokemon with Fighting-type coverage like Scyther and Eelektross can chunk Ursaring enough to force it to use Rest before it can accumulate enough boosts to be a threat.</p> ",
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<h1>Set Details</h1> <p>Ursaring only gets to pick one offensive move, so Play Rough is preferred for its great offensive coverage and lack of immunities, but Body Slam has more immediate damage and can spread paralysis. With Tera Fairy, Ursaring inverts its weakness to Fighting and gains STAB on Play Rough. Tera Ghost takes subverting its weakness to the extreme, turning the tables on the many Fighting-types in the tier. 88 Speed EVs outspeed Vaporeon and Umbreon, which hamper Ursaring with Haze or Foul Play. The remaining EVs are put into Special Defense to allow Ursaring to wall special attackers while boosting Defense with Bulk Up.</p> <p>Although its bulk often prevents it from being outright overpowered, Ursaring's setup attempts can be thwarted by utility Pokemon such as Haze Muk and Vaporeon and Encore Cacturne and Zoroark. Wallbreakers like Medicham and Zoroark and entry hazard setters like Qwilfish and Sandaconda assist in breaking through and wearing them down. Knock Off users like Bombirdier, Klawf, and Passimian can leave Eviolite Ursaring vulnerable to following attacks. Knock Off absorbers like Sandaconda and Umbreon make for great teammates. Because it lacks Heavy-Duty Boots or Leftovers to offset hazard damage, Ursaring appreciates hazard control from the likes of Drifblim and Lurantis. Pokemon vulnerable to status infliction like Toxicroak and Vaporeon appreciate the fact that Ursaring punishes the use of status moves like Will-O-Wisp from Drifblim and Glare from Sandaconda.</p> "
      },
      {
        "name": "Trailblaze Sweeper",
        "description": "<h1>Set Details</h1> <p>Trailblaze lets Ursaring take advantage of passive Pokemon like Chansey and Vaporeon to outspeed faster threats like Scyther and Zoroark after one use and Choice Scarf Passimian after two. Guts Facade easily 2HKOes physically bulky Pokemon like Sandaconda and Dudunsparce. Tera Ghost allows Ursaring to effectively bait Fighting-type moves and boosts Shadow Claw, which can be used to hit Ghost-types like Drifblim and Rotom. Swords Dance allows Ursaring to muscle past setup sweepers like Coil Sandaconda, Eelektross, and Curse Muk while also giving Facade enough power to defeat Steel-types like Perrserker and Tera Steel Eelektross. Alternatively, Close Combat immediately threatens Steel-types like Perrserker and Tera Steel users like Appletun and Eelektross. Tera Fighting and Tera Grass are alternative options used to boost Ursaring's other moves. Tera Grass notably improves Ursaring's matchup against physically bulky Pokemon like Sandaconda and Vaporeon.</p> <p>Slow pivots like Eelektross and Perrserker help Ursaring enter the battlefield safely, mitigating its frailty and burn-induced timer. Healing Wish from Chansey or Indeedee-F can allow Ursaring another opportunity to shred through the opposition. Oricorio-F and Drifblim can ease the matchup against Fighting-types and use Defog to ensure Ursaring takes minimal damage when hitting the field, and Oricorio-F also has U-turn to bring in Ursaring more often.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pokeslice", "user_id": 509790}, {"username": "Rabia", "user_id": 336073}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Medicham": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Medicham is a solid revenge killer and late-game cleaner. Pure Power gives Medicham an edge over Passimian, one of its main sources of competition, by allowing its Close Combat to 2HKO bulky foes like Vaporeon before Terastallization. Zen Headbutt's Base Power is good against foes like Tera Fairy Chansey, but Psycho Cut is an alternative that doesn't make contact, which helps against Rocky Helmet users, Drifblim, and Poison Point Qwilfish. Thunder Punch and Ice Punch hit Bruxish and Sandaconda respectively, and Flying-types like Drifblim and Oricorio-F. Trick punishes defensive switch-ins like Sandaconda and is especially beneficial to use against bulky teams, since they are generally slower than Medicham anyway. Tera Fighting enhances Medicham's wallbreaking and cleaning potential by powering up Close Combat, and it lets Medicham resist Toxicroak and Bombirdier's Sucker Punch. Partners that commonly run Choice Scarf, such as Zoroark and Rotom, can revenge kill foes instead of Medicham early-on, keeping its set a mystery. Zoroark can also use Illusion to lure in and eliminate Ghost-types, which reduces how many predictions Medicham needs to make, while Rotom checks Flying-types and blanks Sandaconda and Choice Scarf Toxicroak.</p> "
      },
      {
        "name": "Wallbreaker",
        "description": "<p>Medicham's damage output is unrivaled thanks to Pure Power in tandem with Life Orb or a Choice Band. Zen Headbutt is a powerful STAB option that hits Poison-types like Qwilfish and Muk, as they can easily take a Close Combat. Psycho Cut is a weaker alternative that avoids contact effects like Poison Point and Rocky Helmet from the likes of Qwilfish and Sandaconda. Trailblaze allows Medicham to pull off sweeps and patch up its offensive shortcoming in its middling Speed. Trick is used with Choice Band to cripple walls such as Drifblim and Tera Fairy users like Chansey and Umbreon. Ice Punch is great neutral coverage for walls like Drifblim and Sandaconda. Tera Fighting gives Choice Band sets a favorable roll to KO Sandaconda after minimal chip or a single layer of Spikes. Tera Steel allows Medicham to defensively check fast revenge killers like Scyther and Zangoose on top of boosting Bullet Punch's damage output. Medicham struggles against bulky Ghost-types like Drifblim and Rotom, which makes Zoroark, Choice Scarf Rotom, and Haunter great offensive partners. Special sweepers like Dudunsparce, Oricorio, and Jolteon appreciate Medicham's ability to break past Chansey, Umbreon, and Vaporeon. Medicham also enjoys pivots like Scyther, Rotom, and Eelektross; it especially likes the latter two, which threaten out Sandaconda, Qwilfish, and Drifblim.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "asa", "user_id": 400292}, {"username": "Lucario", "user_id": 189361}], "teams": [{"name": "Quality checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Camerupt": {"sets": [{"name": "Defensive Utility", "description": "<p>Fire Spin and Grass Tera Blast can effectively lure otherwise undesirable matchups like Sandaconda and Vaporeon. 88 Speed allows Camerupt to outspeed the likes of Muk, Crocalor, and Perrserker</p> "}]},
  "Cacturne": {
    "sets": [
      {
        "name": "Offensive Spikes",
        "description": "<p>Cacturne is an amazing offensive Spiker in NU. Due to its strength and typing, it finds many opportunities to switch in on and threaten tier staples like Sandaconda, Qwilfish, and Drifblim. Cacturne is also good at taking advantage of Water-types like Bruxish and Vaporeon thanks to Water Absorb, giving it more chances to set up Spikes and dish out heavy damage. Drain Punch offsets Life Orb recoil and threatens Chansey, Umbreon, and Steel-types like Perrserker and Tera Steel Eelektross. Stomping Tantrum has a chance to 2HKO Muk while still hitting Steel-types hard. Dark Pulse reliably pressures Defoggers like Drifblim and Lurantis as well as Hattrem. A Naive nature lets Cacturne outspeed Modest Clawitzer without sacrificing any power. Tera Dark makes Sucker Punch and Dark Pulse stronger, allowing the former to OHKO foes like Jolteon and Medicham with minimal chip. Passimian is an excellent teammate for Cacturne, since it dissuades Defog attempts with Defiant, can remove foes' Heavy-Duty Boots with Knock Off, and reliably pressures special walls. In return, Cacturne offers Passimian safety from Bruxish, offensively checks Ghost-types, and can facilitate late-game cleaning with Spikes. Setup sweepers like Jolteon and Vivillon become much harder to stop when backed by Spikes and also match up well against Defoggers like Braviary and Lurantis.</p> "
      },
      {"name": "Swords Dance Sweeper"}
    ],
    "credits": {"writtenBy": [{"username": "asa", "user_id": 400292}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Zangoose": {"sets": [{"name": "Swords Dance"}]},
  "Vespiquen": {"sets": [{"name": "Pivot"}]},
  "Drifblim": {
    "sets": [
      {
        "name": "Defog",
        "description": "<p>Drifblim is one of the best Defoggers in SV NU, with reliable recovery in Strength Sap and a great defensive typing allowing it to check many of the tier's best physical attackers like Toxicroak, Zangoose, and Sandaconda. Hex is a great STAB option to hit Psychic- and Ghost-types such as Bruxish, Medicham, and Rotom, and it has great synergy with Drifblim's status moves. Air Slash allows Drifblim to hit Normal-types and Dark-types neutrally while also potentially wearing down defensive Pokemon like Umbreon and Chansey with a combination of flinches and paralysis. Will-O-Wisp can help discourage physical attackers from switching in, such as Bombirdier and Lycanroc, and is useful to burn dangerous setup sweepers such as Coil Eelektross and Curse Muk. Thunder Wave is another status option, notably improving Drifblim's matchup into Pokemon such as Pyroar and Oricorio. Defog allows Drifblim to keep hazards off the field from Pokemon such as Qwilfish and Sandaconda, and with maximum Defense investment, Drifblim can even take a Defiant-boosted Knock Off from Passimian. Tera Fairy can improve Drifblim's matchup against Dark-types like Mabosstiff and Zoroark while retaining its matchup versus Fighting-types; it can also be useful for getting rid of Drifblim's Stealth Rock weakness if it has lost its Heavy-Duty Boots. However, this makes Drifblim's matchup into Poison-types such as Toxicroak much worse. Tera Ground can block a Volt Switch and allow Drifblim to hit Rotom and Eelektross hard before forcing them to switch out.</p> <p>Drifblim can struggle with powerful special attackers such as Eelektross, Pyroar, and Zoroark, which can switch in thanks to Drifblim's passivity and threaten it. As a result, special walls such as Chansey, Muk, and Umbreon can be great partners. Sticky Hold Muk can also absorb Knock Off for Drifblim from physical attackers such as Passimian.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "plznostep", "user_id": 595639}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Spiritomb": {"sets": [{"name": "Calm Mind"}]},
  "Toxicroak": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Toxicroak stands out as a very potent late-game sweeper thanks to Swords Dance and Dry Skin, which allow it to switch in and set up on common Water-types like Vaporeon and Qwilfish. Its access to Sucker Punch allows it to revenge kill threats like Choice Scarf Medicham, Bruxish, and Rotom, though it has to be aware of the former two's Tera types and the latter's Will-O-Wisp. Tera Dark gives it a useful Psychic immunity to better the odds versus opposing Bruxish while increasing the power of Sucker Punch. Alternatively, Tera Fighting Toxicroak is able to OHKO Sandaconda, which usually checks it, after a Swords Dance. Toxicroak struggles against the aforementioned Drifblim and Rotom and, without Tera Fighting, Sandaconda. Teammates such as Vaporeon, Eelektross, and Rotom can switch in on its checks and bring it into battle safely. Pokemon that appreciate Toxicroak's presence include Oricorio, Clawitzer, and Bruxish, as they struggle against bulky Pokemon that lose to Toxicroak like Vaporeon, Umbreon, and Chansey.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Thanks to its access to Nasty Plot, Toxicroak can threaten Pokemon like Sandaconda and Drifblim that beat physical variations of it. Dark Pulse enables it to get around Pokemon that resist its STAB combination, including Ghost-types like Drifblim, Rotom, and Spiritomb as well as Poison-types like Muk and Qwilfish. Alternatively, Vacuum Wave is a solid STAB move with priority to help it revenge kill faster threats like Zoroark, Lycanroc, and Tera Ice Jolteon. Tera Fighting heavily increases Focus Blast's already high damage output, allowing Toxicroak to rip through bulkier teams. Tera Fighting Toxicroak can run a Modest nature to give it a favorable chance to 2HKO Muk at +2 with Focus Blast; however, it becomes noticeably slower, getting outpaced by Mabosstiff, Bombirdier, and Braviary. Tera Dark Toxicroak better checks Bruxish while also boosting Dark Pulse's power.</p> <p>Without the use of its Tera type, Toxicroak struggles against bulkier teams that often include Muk or Crocalor, so Pokemon that put pressure on them like Sandaconda and Bruxish pair well with it. Bruxish, as well as other Water-types like Clawitzer, appreciate Toxicroak checking bulky Water-types like Vaporeon and Qwilfish. Toxicroak often relies on Spikes from users such as Qwilfish, Vespiquen, and Cacturne to chip away at foes that it can't handle on its own. Since Toxicroak can lure in and remove Ghost-types like Rotom and Drifblim, Pokemon like Scyther and Coil Eelektross appreciate its support.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Toxicroak differentiates itself from other Choice Scarf users, such as Passimian, by virtue of its defensive utility, being immune to Water-type attacks and absorbing Toxic Spikes. It also doesn't Speed tie with other common Choice Scarf attackers, namely Passimian and Medicham. Close Combat and Gunk Shot can sweep through even remotely weakened teams, especially with a Tera-Fighting Close Combat. Gunk Shot hits Fairy-types that resist Close Combat such as Dachsbun, Florges, and Tera Fairy Drifblim. Earthquake threatens Poison-types such as Muk and Qwilifish. Rock Slide hits Pokemon such as Drifblim and Vespiquen, which may otherwise be troublesome for Toxicroak to deal with. Despite its low-Base Power, Ice Punch is a relatively safe midground option that lacks the type immunities Toxicroak's other moves have while hitting common checks like Sandaconda, Drifblim, and Scyther for decent damage.</p> <p>Toxicroak struggles with Pokemon that are not threatened by its STAB combination, such as Rotom, Drifblim, and other physical walls such as Sandaconda. Powerful special attackers like Eelektross, Zoroark, and Pyroar can alleviate this issue.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Lucario", "user_id": 189361}, {"username": "plznostep", "user_id": 595639}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pokeslice", "user_id": 509790}, {"username": "Rabia", "user_id": 336073}, {"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "Rabia", "user_id": 336073}, {"username": "Tea Guzzler", "user_id": 577920}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Rotom": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Rotom stands out as a fantastic user of Choice Scarf thanks to its nearly unresisted STAB combination, high Speed tier, and three immunities. Will-O-Wisp lets Rotom cripple opposing physical sweepers such as Passimian, Medicham, and Scyther on top of Toxicroak using Sucker Punch. Trick is very useful to dismantle walls that rely on their item like Sandaconda, Eelektross, and Chansey. Tera Electric and Tera Ghost boost Rotom's STAB attacks even further with no drawbacks, though note that Tera Ghost exposes Rotom to Sandaconda's Glare. Tera Dark is useful for beating Sucker Punch Toxicroak and making Rotom a good lure for Zoroark. Thanks to Rotom's ease switching into opposing Sandaconda, teammates weak to it like Toxicroak, Lycanroc, Perrserker, and Scyther make for great partners; the latter two can even form a VoltTurn core with it. Bruxish, Medicham, and Mabosstiff help Rotom get around common special walls like Umbreon, Muk, and Chansey. Some walls that Rotom benefits from teaming up with include Umbreon, Vaporeon, and Muk thanks to their ability to take on common wallbreakers that can revenge kill Rotom such as Mabosstiff, Bruxish, and Pyroar.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Rotom takes advantage of common Pokemon such as Sandaconda and Chansey that typically can't threaten it to set up. Will-O-Wisp eases setup and helps weaken checks such as Eelektross and Appletun. Tera Ghost helps Rotom get by Eelektross and Muk while retaining its Fighting immunity, whereas Tera Fairy can catch Dark-type revenge killers like Zoroark and Choice Scarf Mabosstiff off guard.</p> <p>Rotom's quite customizable: Substitute / Nasty Plot / Thunderbolt or Discharge / Shadow Ball limits revenge killers and makes it easier to choose an offensive Tera type. Protect can be used instead of Will-O-Wisp to scout Choice item revenge killers like Zoroark, Passimian, and Bruxish. These options lack the same consistency as the listed set, though.</p> <p>Pivots like Passimian, Scyther, and Oricorio formes are great to bring Rotom in against Sandaconda and Chansey, affording it easy setup opportunities. If Rotom is running Volt Switch, pair it with physical wallbreakers such as Bruxish and Toxicroak that can take on blanket special walls like Muk and Umbreon that commonly try to check it.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>Rotom is an excellent bulky pivot, forcing out common staples like Scyther and Qwilfish with Volt Switch while having a positive matchup against Sandaconda, the most common Volt Switch absorber in the tier. Will-O-Wisp neuters physical attackers such as Passimian and Toxicroak and powers up Hex to chunk special walls like Eelektross and Muk. Protect racks up Leftovers recovery and burn damage while scouting moves from Choice item users such as Zoroark, Bruxish, and Passimian. Tera Electric powers up Volt Switch and removes Rotom's weaknesses to Dark and Ghost, improving its matchup against Mabosstiff, Umbreon, Haunter, and opposing Rotom. Tera Steel gives Rotom a great defensive typing with Levitate, which allows it to shrug off Sandaconda's Ground- and Rock-type coverage as well as take resisted damage from common moves like Lurantis's Leaf Storm and Lycanroc's Stone Edge. Because of Rotom's vulnerability to chip damage, it benefits greatly from reliable entry hazard removal from Pokemon such as Scyther and Lurantis. Powerful wallbreakers such as Ursaring and Medicham appreciate Rotom pivoting them safely into play. Rotom is quite vulnerable to faster attackers such as Zoroark and Bruxish, so it appreciates being paired with defensive stops to these threats, such as Muk and Umbreon. Passimian is a fantastic partner that forms a VoltTurn core with Rotom and revenge kills its offensive checks; it also appreciates Rotom weakening Sandaconda.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Lucario", "user_id": 189361}, {"username": "Rabia", "user_id": 336073}, {"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "poh", "user_id": 298730}, {"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}, {"username": "Sabelette", "user_id": 583793}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Rotom-Frost": {"sets": [{"name": "Choice Scarf"}, {"name": "Nasty Plot"}]},
  "Basculin": {"sets": [{"name": "Choice Band"}]},
  "Zoroark": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Zoroark stands out as a powerful offensive Dark-type Pokemon thanks to its combination of high Speed, great coverage, and a powerful STAB Dark Pulse that can be powered up further by Terastallization. Sludge Bomb is generally preferred over Flamethrower for its ability to easily 2HKO Florges and punish a Tera Fairy Umbreon. Flamethrower can still hit Steel-types like Perserrker and Terastallized Eelektross. U-turn generates momentum and can allow Zoroark and its team to maintain offensive pressure while also keeping its Illusion of other U-turn users like Passimian and Scyther in tact. Trick is a fine alternative to cripple the likes of Chansey and Umbreon, Pokemon that can otherwise handle Zoroark quite well.</p> <p>Choice Scarf Passimian is among the absolute best teammates for Choice Specs Zoroark thanks to Zoroark's ability to disguise itself as Passimian to lure in and weaken the likes of Sandaconda and Drifblim to open up an opportunity for Passimian to sweep late-game. Zoroark's access to U-turn is also helpful for getting other fast, frail teammates such as Bruxish, Toxicroak, and Zangoose into battle more comfortably. Jolteon, Oricorio, and Vivillon are fast special sweepers that can capitalize on the holes that Choice Specs Zoroark will inevitably open up on the opposing team. VoltTurn teammates, such as Scyther, Magneton, and Eelektross, form great momentum cores with Zoroark to keep up offensive pressure. In particular, Eelektross can slowly pivot into Zoroark to help get around its frailty issues. Sandaconda and Qwilfish are bulky entry hazard setters that can amplify Zoroark's tendency to pivot a lot early on and also take hits for Zoroark when its forced out by faster Pokemon like Choice Scarf Passimian, Lycanroc, and Jolteon.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Zoroark distinguishes itself from other Choice Scarf users with its ability to outspeed and KO Choice Scarf Passimian, making it a great partner for Pokemon such as Eelektross, Mabosstiff, and Rotom. Thanks to Illusion, Zoroark can effectively bait in Passimian by disguising as a Pokemon that it would usually want to attack, such as Bruxish, Lurantis, or Jolteon. Psychic hit Passimians, although it fails to secure the KO without some prior chip. To help secure that extra damage, Choice Scarf Zoroark pairs fantastically with Rocky Helmet users like Sandaconda and Qwilfish, which consistently switch into Passimian. Sludge Bomb is used to hit Pokemon that have Terastallized into a Fairy-type, but Trick can be used to cripple special walls like Vaporeon, Umbreon, and Chansey. Because Choice Scarf Zoroark lacks the power of Choice Specs, it appreciates Spikes support from Vespiquen and Qwilfish to rack up damage on the opposing team so that it can consistently clean in the late-game. Physical wallbreakers that take advantage of the previously mentioned special walls that Choice Scarf Zoroark baits in like Toxicroak, Medicham, and Crabominable also make for fantastic partners, especially when factoring in the Illusion mind games possible when Zoroark disguises as them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "EonX", "user_id": 91480}, {"username": "Pokeslice", "user_id": 509790}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}, {"username": "Rabia", "user_id": 336073}]}, {"name": "Grammar checked by", "members": [{"username": "hidin", "user_id": 589564}, {"username": "UT", "user_id": 523866}, {"username": "asa", "user_id": 400292}]}]}
  },
  "Eelektross": {
    "sets": [
      {
        "name": "Coil",
        "description": "<p>Eelektross makes for one of the most potent bulky setup sweepers in the tier due to its lack of weaknesses and access to the highly coveted Coil. Eelektross' defensive profile, notably boasting a paralysis and Ground immunity, grants it safe entry against tier staples like Sandaconda, Chansey, and Jolteon, and it can even set up Coil in front of them. Drain Punch allows Eelektross to maintain its health while boosting. Dragon Tail lets Eelektross beat opposing setup sweepers like Coil Sandaconda, Bulk Up Ursaring, and Curse Muk. Instead of Dragon Tail, Eelektross can use a move like Substitute or Rest to greatly help against status inducers such as Rotom, Drifblim, and Qwilfish. The former two can otherwise easily outspeed and burn Eelektross and eventually beat it down with boosted Hex. Tera Steel prevents Toxic from Muk, Qwilfish, and Vespiquen and retains an amazing defensive profile thanks to Levitate. Entry hazards set by the likes of Qwilfish and Sandaconda allow Eelektross to rack up damage against incoming checks like Rotom and Lurantis with Dragon Tail. Drifblim and the aforementioned Qwilfish also appreciate Eelektross's Electric resistance.</p> "
      },
      {
        "name": "Assault Vest",
        "description": "<p>Assault Vest Eelektross is a premier defensive pivot. Its lack of weaknesses, immunity to Spikes and Toxic Spikes, and excellent Assault Vest-boosted special bulk allow it to check common special attackers like Jolteon, Zoroark, and Oricorio. Its low Speed tier paired with 0 Speed IVs allows it to take hits and then safely bring in frailer teammates like Haunter, Zoroark, and Bruxish with U-turn. As such, it fits well on VoltTurn cores with the likes of Bombirdier, Passimian, and Scyther, wearing down the opposing team with pivot moves. Discharge is prefered over Thunderbolt due to the increased paralysis chance. Giga Drain threatens Sandaconda while providing some recovery. Dragon Tail phazes foes, pairing well with Spikes support from the likes of Qwilfish and Cacturne, and keeps Tera Ground Quiver Dance users such as Oricorio and Vivillon in check despite their Discharge immunity. Drain Punch is an alternative that still allows Eelektross to defeat Tera Ground Quiver Dance users while hitting common special attackers like Zoroark and Pyroar super effectively. Acid Spray is a viable alternative that lets Eelektross defeat setup sweepers even when they are the only remaining opposing Pokemon. Tera Steel is preferred, as it improves Eelektross's matchup against common special attackers like Indeedee-F and non-Tera Fire Vivillon while gaining an immunity to Qwilfish's Toxic.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}, {"username": "Tuthur", "user_id": 369076}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}, {"username": "poh", "user_id": 298730}, {"username": "Rabia", "user_id": 336073}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Clawitzer": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>With Choice Specs and the unique Mega Launcher ability, Clawitzer uses its exceptional coverage to be one of the most devastating wallbreakers in NU. Tera Dragon not only maintains Clawitzer's Water and Fire resistances, but it also turns Clawitzer's Grass and Electric weaknesses into resistances. Further, it gives Clawitzer a more powerful STAB move in Dragon Pulse, which guarantees a 2HKO on common special walls like Umbreon and Assault Vest Eelektross after Stealth Rock. Aura Sphere hits Chansey and Steel-types like Perrserker and Tera Steel Eelektross. U-turn can be used in the fourth moveslot to bring in teammates like Passimian and Toxicroak, which better deal with healthy special walls like Chansey and Umbreon or Tera Fairy threats, allowing Clawitzer to use Dragon Pulse more freely. Flash Cannon can also be used to hit Tera Fairy Pokemon like Chansey, Umbreon, and Vaporeon, which are immune to Dragon Pulse and Water Pulse, in Vaporeon's case. Without Terastallizing, Electric-types like Rotom, Jolteon, and Magneton pose a threat to Clawitzer. Appletun and Electric immunities like Sandaconda and Jolteon work as partners to eat up their moves and restore any HP they lose.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Oathkeeper", "user_id": 83980}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Crabominable": {"sets": [{"name": "Assault Vest Tank"}]},
  "Oricorio": {
    "sets": [
      {
        "name": "Quiver Dance",
        "description": "<p>Oricorio-F is one of the tier's premier setup sweepers because of its ability to take advantage of special attackers that cannot threaten it like Drifblim and Lurantis. Oricorio-F is especially formidable when Terastallizing, in part because its signature move, Revelation Dance, changes typing along with it. Hurricane is the preferred coverage option for its high Base Power and chance to confuse its target, but Air Slash can be used instead for irs higher accuracy at the cost of a significant power drop. It should also be noted that Taunt can be used over either Revelation Dance or Flying-type coverage to allow Oricorio-F to set up on certain defensive checks such as Chansey, Umbreon, and Crocalor, which can cause Oricorio-F trouble. 252 Speed EVs allow Oricorio-F to outspeed Bruxish and common Choice Scarf users like Passimian and Rotom at +1 Speed. Oricorio-F appreciates Terastallizing into a Grass-type to set up on common Water-types like Vaporeon, Qwilfish, and Bruxish while adding an Electric resistance that lets Oricorio-F not fear Electric-types like Eelektross, Rotom, and Jolteon. Alternatively, Tera Ground can be used to surprise Electric-types and gain a free turn of setup while avoiding Thunder Wave from the likes of Chansey and Umbreon. To effectively pull off a sweep, Oricorio-F appreciates the removal of special walls such as Chansey, Vaporeon, and Assault Vest Eelektross from the field, which makes physical wallbreakers that can take advantage of them like Mabosstiff and Toxicroak powerful partners. Oricorio-F also appreciates defensive answers to Bruxish's and Lycanroc's Accelerock, such as Lurantis and Sandaconda, as both can threaten to revenge kill Oricorio-F, although a well-timed Tera can bait both of them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Pokeslice", "user_id": 509790}], "teams": [{"name": "Quality checked by", "members": [{"username": "Rabia", "user_id": 336073}]}, {"name": "Grammar checked by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Lycanroc": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>With blazing Speed, versatile coverage, and high power, Lycanroc is an excellent cleaner. Close Combat targets Steel- and Fighting-types like Perrserker, Magneton, Paldean Tauros, and Passimian. It is also Lycanroc's strongest attack against Sandaconda. Accelerock picks off weakened Choice Scarf users like Rotom formes, Zoroark, and Haunter. Tera Flying allows Lycanroc to set up on Pokemon with otherwise super effective moves, like Passimian's Close Combat and Sandaconda's Earthquake, and also pick off Fighting-types like Passimian, Medicham, and Toxicroak.</p> <p>Without prior damage, Lycanroc will struggle to achieve KOs and needs partners to rack up damage beforehand, as Pokemon like Sandaconda and Paldean Tauros can safely check it. Wallbreakers like Mabosstiff, Medicham, and Choice Specs Zoroark can help rack up damage. Pivots like Choice Scarf Rotom and Eelektross are helpful to give it safe entry, bypassing its low bulk. Against bulkier teams, Spikes and Toxic Spikes users like Qwilfish and Vespiquen can wear down foes, allowing Lycanroc to clean teams more easily.</p> "
      },
      {
        "name": "Dedicated Lead",
        "description": "<p>Lycanroc is the fastest viable Stealth Rock setter in NU, making it a great dedicated lead. Taunt prevents defensive Pokemon like Sandaconda, Chansey, and Qwilfish from using their utility moves or setting up entry hazards. Focus Sash allows Lycanroc to survive a hit from offensive Pokemon like Medicham and Magneton, enabling Endeavor to do maximum damage. Once Lycanroc has consumed its Focus Sash and brought Pokemon down to one HP with Endeavor, it can then pick them off with Accelerock. Due to being only used as a lead, Lycanroc will not be Terastallizing often, although Tera Ghost is used to block Rapid Spin in matchups where keeping up Stealth Rock is worth the usage of Terastallization.</p> <p>Setup sweepers like Bruxish, Toxicroak, and Paldean Tauros that can capitalize from Stealth Rock are appreciated, making it difficult for Defoggers like Drifblim and Oricorio formes to clear hazards safely. Passimian and Lurantis can discourage Defog attempts via Defiant and Contrary, respectively. Although rare, Hattrem can completely wall Lycanroc, so Pokemon like Nasty Plot Rotom and Misdreavus can deter Hattrem from switching in. Other hazard setters, like Qwilfish and Cacturne, can also set up Spikes or Toxic Spikes to accumulate even more residual damage.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Lurantis": {
    "sets": [
      {
        "name": "Defog",
        "description": "<p>Not only is Lurantis one of the few Pokemon with access to Defog, but it also has solid bulk, reliable recovery, and a typing that fares well into many top threats like Bruxish, Eelektross, and Sandaconda. Contrary + Leaf Storm lets Lurantis accrue boosts very quickly, and Tera Blast can patch up any holes in its coverage; Tera Electric hits Flying-types like Drifblim and Oricorio-F, and Tera Fire hits Steel-types like Perrserker and Tera Steel Eelektross. Pollen Puff is an option to hit Grass-types like Appletun and Lurantis without relying on Terastallization. Lurantis is hampered by its weaknesses to U-turn and Poison-types like Muk and Toxicroak, making physical walls like Sandaconda and Drifblim great teammates. Lurantis also works excellently with entry hazard setters, as Contrary can punish Defog. Special walls like Chansey, Bombirdier, and Muk can take consecutive boosted Leaf Storms, so powerful physical attackers like Passimian and Bruxish pair well with Lurantis. 48 Speed EVs let it Chansey and Muk, giving Lurantis an edge against them should they be weakened.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pokeslice", "user_id": 509790}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Passimian": {
    "sets": [{"name": "Choice Scarf", "description": "<p>Choice Scarf Passimian is an elite revenge killer and pivot in NU thanks to its great Speed and excellent offensive prowess. Knock Off cripples item-reliant Pokemon like Oricorio-F, Scyther, and Chansey while also targeting Ghost-types like Haunter and Rotom. U-turn pivots out of bad matchups, such as Sandaconda, Qwilfish, and Terastallized Vespiquen. Earthquake targets Poison-types like Qwilfish, Muk, and Toxicroak, while Rock Slide hits Rotom-S and Vivillon. Defiant allows Passimian to capitalize on Defog users like Drifblim and Braviary. Passimian is quite vulnerable to contact effects from Pokemon like Qwilfish, Rocky Helmet Sandaconda, and Drifblim; special attackers like Jolteon, Rotom, and Zoroark can discourage them from switching in while also forming VoltTurn cores with it.</p> "}],
    "credits": {"writtenBy": [{"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Bruxish": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Bruxish's Speed tier coupled with Strong Jaw-boosted Psychic Fangs lends it great wallbreaking capability. Its high Base Power STAB moves are nearly unresisted, and it has enough coverage moves to get around potential checks like Cacturne and Vaporeon. Poison Fang hits Grass-types like Cacturne and Appletun while also badly poisoning common walls like Vaporeon and Umbreon. Crunch targets Psychic-types like Hattrem and Oricorio-P while also securing the OHKO on Farigiraf. Tera Dark further boosts Strong Jaw-boosted Crunch and helps Bruxish get past the aforementioned Cacturne and Vaporeon. Tera Fairy coupled with Tera Blast helps its matchup versus Cacturne while also resisting Sucker Punch from Pokemon like Toxicroak and Honckrow. Teammates should be pivots that bring Bruxish safely on the field like Eelektross, Passimian, and Rotom. Pokemon like Oricorio and Clawitzer appreciate Bruxish targeting their checks like Chansey and Eelektross.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Strong Jaw-boosted Psychic Fangs and Crunch turn Bruxish into a dominant offensive force in NU. It also has Aqua Jet, which lets it revenge kill weakened faster threats like Zoroark and Choice Scarf Passimian and sweep after boosting with Swords Dance. Bruxish's Speed tier is also great, allowing it to outspeed Rotom, Mabosstiff, and Bombirdier. Tera Blast can be used in the fourth moveslot in conjunction with Tera Fairy to give Bruxish a better defensive typing while also being able to beat common walls to it like Cacturne and Tera Dark Toxicroak and Vaporeon. Tera Dark combined with Strong Jaw, however, gives Crunch a deadly bite with it becoming a third STAB move to nail opposing Bruxish and Veluza. Alternatively, Tera Water makes Aqua Jet even more dangerous for the aforementioned faster threats. If Bruxish is not running Tera Fairy + Tera Blast, having a partner like Toxicroak or Rotom to deal with Tera Dark Toxicroak and Vaporeon is appreciated.</p> "
      },
      {"name": "Choice Scarf", "description": "<p>Choice Scarf Bruxish outspeeds other common Choice Scarf users like Passimian and Rotom, making it a very effective late-game cleaner. While it forgoes boosting elements like Choice Band and Swords Dance, Bruxish still boasts a good offensive presence with its powerful STAB moves. Tera Dark further boosts its Strong Jaw-boosted Crunch, and prevents Bruxish from being revenge killed by Sucker Punch users like Toxicroak and Zoroark. Choice Scarf Bruxish can surprise and OHKO common Choice Scarf users like Passimian and Rotom that expect to be faster, so teammates that appreciate their removal like Pyroar, Lycanroc, and Vivillon make good partners.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Oathkeeper", "user_id": 83980}, {"username": "poh", "user_id": 298730}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}, {"username": "Rabia", "user_id": 336073}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Lumii", "user_id": 493772}, {"username": "hidin", "user_id": 589564}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Appletun": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Appletun acts as one of the tier's premier special walls thanks to its fantastic defensive typing and plethora of utility options, which let it consistently check Pokemon like Lurantis, Jolteon, and Eelektross. Although Appletun might seem passive, Apple Acid prevents special walls like Umbreon and Ursaring from sitting on it because of the Special Defense drops. Leech Seed helps weaken Poison-, Flying-, and Bug-types like Muk, Oricorio-F, and Scyther that are all capable of shrugging off Apple Acid while also allowing Appletun to check powerful setup sweepers like Coil Eelektross and Dudunsparce thanks to the extra health it provides. Dragon Tail adds another option to deal with setup sweepers while forcing Pokemon that want to switch into Appletun to take another round of entry hazards, working wonderfully in tandem with Spikes setters like Qwilfish. Alternatively, Dragon Pulse makes for a powerful STAB coverage option that can hit Grass-resistant foes like Scyther and Drifblim. Heavy-Duty Boots helps Appletun check strong special attackers like Zoroark, Rotom, and boosted Veluza, but Leftovers can also be used for the extra recovery. Tera Steel helps Appletun flip the script on Pokemon like Scyther, Muk, and Tera Ice Jolteon that traditionally answer it. Tera Steel also helps Appletun against Pokemon like Ursaring, Indeedee-F, and Clawitzer that all pack super effective coverage for it.</p> <p>Because of Appletun's weakness to Poison-types like Muk and Swalot, Sandaconda and Qwilfish make for fantastic defensive partners, also sporting Rocky Helmet to punish U-turns targeted at Appletun. Additionally, Electric-types like Rotom and Eelektross can threaten Flying-types like Scyther and Oricorio-F.</p> "
      },
      {"name": "Choice Specs"}
    ],
    "credits": {"writtenBy": [{"username": "Pokeslice", "user_id": 509790}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Sandaconda": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Sandaconda is one of the best Pokemon in NU and provides teams with several forms of useful utility, including blocking Volt Switch, setting Stealth Rock, spreading paralysis, and sponging Knock Off. Shed Skin lets Sandaconda absorb status and, in combination with Rest, support its team and take on physical attackers like Toxicroak throughout the game. Stone Edge threatens Defoggers and Flying-types like Drifblim and Vivillon and hits Eelektross and Rotom neutrally. Rocky Helmet wears physical attackers like Passimian and Muk down and discourages the use of moves like U-turn, while Leftovers provides Sandaconda passive recovery and makes it less reliant on Rest. Tera Ghost lets Sandaconda completely wall most Fighting-types and other threats such as Zangoose. Tera Dragon is another option that keeps Water- and Grass-types like Bruxish and Lurantis from immediately overwhelming Sandaconda. 80 Speed EVs allow Sandaconda to outrun Drifblim.</p> <p>Sandaconda can fit well on many different playstyles and will almost always do something for its team. Sandaconda's main flaw is its mediocre special bulk, which, coupled with its weakness to Eelektross's Giga Drain, means it shouldn't be a team's sole response to Electric-types. Pokemon like Chansey, Muk, and Umbreon can serve as backup checks to such foes and also check other special attackers like Cacturne and Zoroark. In addition, Chansey can run Stealth Rock for Sandaconda, thus allowing it to make room for both Glare and EdgeQuake coverage; Muk puts Sandaconda's grounded switch-ins on a timer with Toxic Spikes and annoys setup sweepers like Dudunsparce and Coil Eelektross with Haze; and Umbreon can keep Sandaconda healthy with Wish so it doesn't have to spend as much time asleep. Slower wallbreakers like Medicham and Clawitzer very much appreciate Glare slowing teams down and making them harder to play around.</p> "
      },
      {"name": "Coil", "description": "<p>With rock-solid physical bulk, Shed Skin, and good offensive power, Sandaconda makes for a deadly mid- and late-game Coil sweeper, setting up on Pokemon like Passimian, Muk, and Umbreon. Stone Edge targets Pokemon resistant or immune to Earthquake, like Rotom, Drifblim, and Oricorio. Rest keeps Sandaconda healthy and works well with Shed Skin. Tera Dragon lets Sandaconda set up on Water-types like Vaporeon, Bruxish, and Floatzel as well as Lurantis, while Tera Ghost blanks Fighting-types like Toxicroak and Medicham. Prior to Terastallization, Sandaconda is vulnerable to Water- and Grass-types like Vaporeon, Bruxish, and Cacturne, so checks to them like Toxicroak, your own Cacturne, and Muk can help. Other special attackers like special Dudunsparce and Eelektross can exploit Sandaconda's low special bulk, so special walls like Crabominable and Chansey are good teammates.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "asa", "user_id": 400292}, {"username": "5Dots", "user_id": 543866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Rabia", "user_id": 336073}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Perrserker": {
    "sets": [
      {
        "name": "Assault Vest Pivot",
        "description": "<p>Perrserker's Steel typing and access to U-turn make it an excellent defensive pivot. With an Assault Vest, Perrserker can sponge a hit from special attackers like Appletun, Jolteon, and Zoroark and retaliate back with Tough Claws-boosted moves. Close Combat hits staples like Chansey and Jolteon, as well as Tera Steel users like Appletun and Eelektross. Seed Bomb hits Sandaconda without worrying about Rocky Helmet, as well as Water-types like Bruxish and Vaporeon. Tough Claws-boosted Fake Out is a great contingency against setup sweepers, allowing Perrserker to get free damage against them by pivoting in and out until Fake Out KOes. Perrserker uses Tera Ghost to turn the tables on Fighting-types like Passimian and Toxicroak, but Tera Fighting or Grass can be used to boost its coverage move. Perrserker's ability to pivot effectively means powerful breakers that appreciate free entry like Bruxish and Clawitzer make for great partners; these two in particular also greatly threaten common Perrserker checks like Sandaconda and Oricorio-F. Perrserker also works effectively with other pivots like Rotom and Scyther to create strong VoltTurn cores.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}], "teams": [{"name": "Quality checked by", "members": [{"username": "Rabia", "user_id": 336073}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Crocalor": {"sets": [{"name": "Defensive"}]},
  "Dachsbun": {"sets": [{"name": "Defensive"}]},
  "Mabosstiff": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Mabosstiff is fast enough to surprise and revenge kill normally faster threats like Rotom, Haunter, and Choice Scarf Passimian while still being annoying to switch into thanks to Stakeout. Play Rough nails Dark- and Fighting-types like Umbreon, Tera Dark Vaporeon, and Passimian. Psychic Fangs 2HKOes defensive Poison-types like Muk and Qwilfish after some chip and OHKOes Toxicroak. Destiny Bond can remove unsuspecting threats like Scyther as well as setup sweepers like Eelektross, Ursaring, and Jolteon, with Choice Scarf usually letting Mabosstiff act first. Use Destiny Bond carefully, though, as it becomes much easier to play around once it's been revealed. Tera Dark boosts Crunch's power, but Tera Fairy can be used instead to strengthen Play Rough and get rid of Mabosstiff's Fighting and Bug weaknesses. Entry hazard support from Qwilfish and Chansey is very helpful, allowing Mabosstiff to 2HKO walls like Sandaconda on the switch in with Tera Dark Crunch as well as clean with greater ease. Strong wallbreakers like Medicham, Ursaring, and Clawitzer are good at making up for Mabosstiff's low raw damage output. In return, Mabosstiff can potentially create openings for them with Destiny Bond and check nuisances like Indeedee-F and Toxicroak.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Mabosstiff is an amazing wallbreaker in NU due to its great offensive typing and coverage coupled with Stakeout. Stakeout's boost means even the most reliable Dark-resistant Pokemon like Paldean Tauros and Umbreon struggle to switch in consistently. This often forces Pokemon weak to Crunch like Bruxish, Drifblim, and Farigiraf to Terastallize or give up a KO to a Stakeout boosted attack. Play Rough takes out Dark-resistant foes like Paldean Tauros, Umbreon, and Passimian. Psychic Fangs hits Qwilfish and Fighting-types, like Passimian and Toxicroak, with an added niche of breaking screens. Retaliate is difficult to switch into after a teammate has been KOed. Facade can keep a statused Mabosstiff useable. Tera Dark boosts Crunch's damage output while Tera Fairy powers up Play Rough and grants a resistance to U-Turn and Fighting moves from Passimian. Offensive checks to Mabosstiff, like Scyther and Choice Scarf Passimian, can often gain momentum by forcing it out, so teammates with a Rocky Helmet like Sandaconda and especially Poison Point Qwilfish are helpful. Fast sweepers and late-game cleaners like Choice Scarf Passimian and Quiver Dance Vivillon appreciate Mabosstiff's wallbreaking, as they may otherwise be worn down by the opposing team.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "asa", "user_id": 400292}, {"username": "skippergamez", "user_id": 620268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pokeslice", "user_id": 509790}, {"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Bombirdier": {"sets": [{"name": "Dedicated Lead"}, {"name": "Choice user"}]},
  "Veluza": {
    "overview": "<p>Fillet Away in conjunction with Sharpness-boosted STAB moves turns Veluza into a terrifying sweeper capable of shredding teams with only a single turn of setup. Veluza is an excellent choice for hyper offense teams, where it acts as a deadly wallbreaker and late-game cleaner. Veluza can easily find setup opportunities against passive foes, such as Vaporeon, and Choice-locked foes, such as a Passimian that just used Close Combat. Although Veluza is extremely powerful after setting up, it may not always get the chance to do so due to its frailty. Veluza's defensive typing is also relatively poor; it is weak to common attacks, including pivoting moves like U-turn from Scyther and Volt Switch from Rotom. Furthermore, Veluza's speed and firepower are rather mediocre prior to setup.</p> ",
    "comments": "<h1>Other Options</h1> <p>Tera Ground enables Veluza to turn the tables on a Jolteon or Rotom trying to grab momentum with Volt Switch. Tera Electric is another option that lets Veluza avoid paralysis from Chansey and Sandaconda while also turning its Electric weakness into a resistance.</p> <h1>Checks and Counters</h1> <p><strong>Offensive Pressure: Veluza's mediocre bulk and need to sacrifice half of its health to set up means that sufficient offensive pressure can prevent it from taking over a game.</p> <p><strong>U-turn and Volt Switch</strong>: Veluza's poor defensive typing renders it weak to both U-turn and Volt Switch, which means that foes such as Jolteon and Scyther can easily gain momentum on or KO it.</p> <p><strong>Cacturne: Cacturne is immune to Psycho Cut and Aqua Cutter, enabling it to completely wall any Veluza not running Tera Fairy Tera Blast.</p> ",
    "sets": [
      {
        "name": "Physical Sweeper",
        "description": "<h1>Set Details</h1> <p>Fillet Away is one of the best setup moves in the game, doubling Veluza's Speed and power at the cost of half its health. Aqua Cutter and Psycho Cut are both boosted by Sharpness, and after a Fillet Away will OHKO many neutral targets, such as Rotom, Mabosstiff, and Clawitzer. For Veluza's last move, Substitute can be used to ease prediction, facilitate setup, and avoid Sucker Punch. Aqua Jet can also be used to revenge kill weakened foes and, after setup, outprioritize other priority moves such as Lycanroc's Accelerock. Tera Blast is an option with Tera Fairy to blast past Cacturne, which otherwise completely walls it. Otherwise, Tera Water is good choice to further boost the power of Veluza's Aqua Cutter, giving it a guaranteed OHKO on specially defensive Umbreon after Stealth Rock. Sitrus Berry helps Veluza set up sucessfully, and 4 HP EVs ensure that it will activate after a Fillet Away. An Adamant nature is preferred to maximize Veluza's damage output, but a Jolly nature enables Veluza to outspeed Timid Farigiraf prior to setup and Choice Scarf Zoroark post-setup.</p> <p>Veluza's incredible Speed and power after setup make it an excellent choice for hyper offense teams. Entry hazard support from Lycanroc and Qwilfish can help chip Veluza's checks into range of its attacks. Bulk Up Paldean Tauros is a great partner for Veluza, as it can easily switch into and set up against Pokemon that give Veluza trouble, such as Cacturne. In return, Veluza can set up on Pokemon used to revenge kill or force out Paldean Tauros, like a Choice Scarf Indeedee-F locked into Psychic or Psyshock. Paldean Tauros also helps Veluza break past shared walls in Vaporeon and Tera Water Sandaconda, enabling one of them to sweep late-game. Other good offensive partners to pair with Veluza include Jolteon and Quiver Dance Vivillon. Jolteon provides an Electric immunity for the team while also giving Veluza points of entry through Volt Switch. Vivillon threatens Cacturne, and its Sleep Powder may cripple one of Veluza's checks, allowing it to sweep. Indeedee-F is another good teammate for Veluza, as Psychic Terrain shields Veluza from priority attacks, such as Sucker Punch, while boosting the power of Psycho Cut to absurd levels.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "nimzowitsch", "user_id": 272785}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}, {"username": "Deezcastforms", "user_id": 423085}]}]}
  },
  "Farigiraf": {"sets": [{"name": "Stored Power"}]},
  "Dudunsparce": {
    "sets": [
      {
        "name": "Coil",
        "description": "<p>Coil Dudunsparce is an imposing setup sweeper that is difficult to take down thanks to its excellent bulk and great longevity with Roost. It can boost through common walls such as Sandaconda and Muk and support its team by spreading paralysis with Serene Grace-boosted Body Slam. Dragon Tail allows Dudunsparce to beat opposing setup sweepers such as Eelektross and Muk by forcing them out, while Bite hits Ghost-types such as Rotom and Haunter as well as Tera Ghost users such as Sandaconda and opposing Dudunsparce. The given EV spread allows Dudunsparce to outspeed Vaporeon as well as paralyzed Pyroar and Scyther and improves its matchup against special attackers such as Oricorio-F and Zoroark. Tera Ghost lets Dudunsparce turn the tables on Fighting-types such as Toxicroak and Medicham, while Tera Fairy gives Dudunsparce a generally strong defensive typing that improves its matchup against Tera Dragon Clawitzer and Dark-types such as Zoroark and Cacturne; it also makes it immune to Dragon Tail from Eelektross and Appletun, which prevents them from stopping Dudunsparce's setup. Slow wallbreakers such as Toxicroak and Cacturne greatly appreciate Dudunsparce's ability to spread paralysis to faster foes and can reciprocate by taking on Vaporeon. Before setting up, Dudunsparce struggles against powerful physical attackers such as Bruxish, Medicham, and Ursaring, so it appreciates partners like Vaporeon, Drifblim, and Sandaconda that can switch into them. Muk, Chansey, and Umbreon can deal with special attackers that are too strong for Dudunsparce to handle, such as Pyroar, Clawitzer, and Haunter.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Dudunsparce's solid bulk, access to Roost, and relative lack of type weaknesses make it a dangerous Calm Mind sweeper. The sheer power of STAB Boomburst makes up for Dudunsparce's mediocre Special Attack and tends to dissuade Fighting-types and other offensive checks from switching directly into it. Shadow Ball targets Ghost-types such as Drifblim and Rotom. Alternatively, Flamethrower hits Frosmoth and Steel-types like Copperajah, Magneton, and Tera Steel Eelektross harder; however, since these Pokemon lack recovery, it is often better to simply wear them down before trying to sweep. Rattled punishes weaker Dark- and Ghost-type attacks, which foes will likely use if they expect Dudunsparce to Terastallize or if it already has, as well as U-turn and Paldean Tauros's Intimidate. 84 Speed EVs allow Dudunsparce to outrun Umbreon and Haze Vaporeon, thus easing setup versus them; make sure the former does not have Thunder Wave before committing to this, though. Tera Ghost gives Dudunsparce an edge against Fighting-types and powers up Shadow Ball. Dudunsparce seriously struggles against special walls like Muk, Copperajah, and Assault Vest Crabominable, so it should be paired with strong physical attackers like Mabosstiff and Passimian that can pressure them. Zoroark is another option that goes even further in baiting in special walls, as well as Ghost-types, thanks to Illusion. Paralysis support from Pokemon like Sandaconda, Qwilfish, and Umbreon improves Dudunsparce's matchup against offense and decreases the number of hits it has to take while setting up. Sandaconda and Qwilfish also set up entry hazards to wear down Dudunsparce's switch-ins and can punish Fighting-types like Medicham and Passimian with Rocky Helmet, while Umbreon can use Wish to help it stay healthy and conserve Roost's limited PP.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "memesketch", "user_id": 537558}, {"username": "asa", "user_id": 400292}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}, {"username": "Rabia", "user_id": 336073}]}]}
  }
}