{
  "Charizard": {"sets": [{"name": "Drought Wallbreaker"}, {"name": "Dragon Dance"}]},
  "Slowbro": {"sets": [{"name": "Defensive Pivot"}]},
  "Chansey": {"sets": [{"name": "Pink Blob (Defensive)"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}, {"name": "Dragon Dance + Flyinium Z"}]},
  "Ditto": {"sets": [{"name": "SUS"}]},
  "Dragonite": {"sets": [{"name": "Dragon Dance"}]},
  "Scizor": {"sets": [{"name": "Bulky Swords Dance"}, {"name": "Swords Dance + 3 Attacks"}]},
  "Blissey": {"sets": [{"name": "Pink Blob (Defensive)"}]},
  "Tyranitar": {"sets": [{"name": "Stealth Rock"}, {"name": "Assault Vest"}]},
  "Pelipper": {"sets": [{"name": "Rain Setter"}]},
  "Medicham": {"sets": [{"name": "Wallbreaker"}]},
  "Torkoal": {"sets": [{"name": "Sun Setter"}]},
  "Gastrodon": {"sets": [{"name": "Defensive Entry Hazard Setter"}]},
  "Garchomp": {"sets": [{"name": "Suicide Lead"}, {"name": "Offensive Stealth Rock"}, {"name": "Defensive"}, {"name": "Swords Dance"}]},
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot"}, {"name": "Choice Scarf"}]},
  "Alomomola": {"sets": [{"name": "Defensive"}]},
  "Volcarona": {"sets": [{"name": "Quiver Dance"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Toxapex": {"sets": [{"name": "The Pex"}]},
  "Cinderace": {"sets": [{"name": "Swords Dance"}, {"name": "Offensive Pivot"}]},
  "Corviknight": {"sets": [{"name": "Defensive Pivot"}]},
  "Barraskewda": {"sets": [{"name": "Choice Band"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Dragapult": {"sets": [{"name": "Dragon Dance"}, {"name": "Choice Specs"}]},
  "Meowscarada": {"sets": [{"name": "Offensive Pivot"}]},
  "Skeledirge": {"sets": [{"name": "Unaware Wall"}]},
  "Garganacl": {"sets": [{"name": "IronPress"}]},
  "Espathra": {"sets": [{"name": "Calm Mind"}]},
  "Cyclizar": {"sets": [{"name": "Shed Tail Utility"}]},
  "Glimmora": {"sets": [{"name": "Suicide Lead"}]},
  "Dondozo": {"sets": [{"name": "Unaware Wall"}]},
  "Annihilape": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Annihilape's amazing bulk and the fantastic Rage Fist make it an amazing late-game wincon and wallbreaker. Bulk Up makes it harder for foes such as Great Tusk and Dragonite to break through it, as well as allowing it to break through defensive Pokemon like Buzzwole and Mega Scizor. Taunt prevents status, recovery, and set up from Pokemon like Skeledirge, Mega Scizor, and Landorus-T while also forcing foes to damage Annihilape, boosting the power of Rage Fist. Rage Fist lacks no switch-in once boosted up and allows Annihilape to demolish Pokemon that wouldn't mind it unboosted, such as Gholdengo and Mega Scizor. It also notably invalidates Unaware, enabling it to break through Pokemon like Clodsire and Skeledirge. Drain Punch provides Annihilape with some additional recovery, preventing it from being worn down quickly. Rest combined with Chesto Berry can be used over Taunt, as it provides Annihilape with a one-time way to recover HP and status, as well as being the premier way to heal from strong incoming hits, but it can be easily exploited if the foe is able to chip down Annihilape enough. Tera Water is the premier option, as it boosts Annihilape's defensive profile, giving it resists to moves like Urshifu-R's Surging Strikes and Gholdengo's Make It Rain. Fairy is another option that gives Annihilape nice resistances to moves like Mega Lopunny's Close Combat and an immunity to Draco Meteor or Dragon Darts from Dragapult. Tera Fire gives Annihilape an immunity to Will-O-Wisp from Pokemon like Skeledirge and Rotom-W while giving it a Fairy resistance as well, preventing the likes of Mega Diancie and Iron Valiant from revenge killing it. Notably, all of these types give Annihilape a Flying- and Ghost-type neutrality, preventing Pokemon such as Tornadus-T, Dragapult, and Gholdengo from revenge killing it as easily. 28 Speed EVs help Annihilape outspeed Pokemon such as Mega Tyranitar, Gholdengo, and Rotom-W. The other EVs maximize its special bulk, letting it take hits comfortably from Pokemon like Heatran and Volcarona. Dual screens setters like Tapu Koko and Grimmsnarl let Annihilape tank hits more easily. Entry hazard support from Pokemon like Ting-Lu, Ferrothorn, and Heatran to wear down Pokemon like Iron Valiant and Tapu Lele is appreciated. Allies like Heatran and Tyranitar handle Pokemon such as Tapu Lele, Iron Valiant, and Tornadus-T, with Annihilape cleaning up once the aformentioned threats are removed.</p> "
      },
      {
        "name": "Entry Hazard Lead",
        "description": "<p>Annihilape carves a niche in being a Stealth Rock user that is immune to Rapid Spin from foes like Great Tusk and Iron Treads. Annihilape being a Defog deterrent due to Defiant, as well as its bulk and Final Gambit picking up easy KOs also strengthens this niche. Final Gambit lets Annihilape safely bring in a teammate while dealing massive damage due to its large HP stat. Taunt denies other entry hazards from being set up by Pokemon like Ting-Lu and preventing the use of Defog from Pokemon like Rotom-W and Tornadus-T on the switch. Defog can also activate Defiant, giving Annihilape way more offensive output for Rage Fist and making it easier to pick up a KO. Annihilape won't be Terastallizing often, but Tera Ghost can be used to boost the power of Rage Fist in scenarios where it is boosted, and it gives Annihilape neutralities to moves like Mega Diancie's Moonblast and Tornadus-T's Hurricane or Bleakwind Storm. Annihilape fits on hyper offense exclusively, so Pokemon that benefit from entry hazards being simultaneously denied and set up, such as Espathra and Dragonite, are good partners. Pokemon like Tornadus-T and Mega Diancie are very big problems for Annihilape, so partners like Gholdengo and Mega Scizor are very valuable. Final Gambit removing Pokemon like Great Tusk and Tornadus-T can also be a big help to teammates like Kingambit and Dragonite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidingflames"}]}
  },
  "Clodsire": {"sets": [{"name": "Defensive Entry Hazard Setter"}]},
  "Kingambit": {"sets": [{"name": "Swords Dance"}]},
  "Great Tusk": {"sets": [{"name": "Offensive Utility"}]},
  "Slither Wing": {"sets": [{"name": "Choice Band"}]},
  "Iron Treads": {"sets": [{"name": "Utility"}, {"name": "Assault Vest"}]},
  "Iron Hands": {"sets": [{"name": "Defensive Swords Dance"}, {"name": "Choice Band"}]},
  "Iron Moth": {"sets": [{"name": "Offensive"}]},
  "Baxcalibur": {"sets": [{"name": "Dragon Dance"}]},
  "Gholdengo": {"sets": [{"name": "Nasty Plot"}]},
  "Chien-Pao": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Ting-Lu": {"sets": [{"name": "Defensive Entry Hazard Setter"}]},
  "Iron Valiant": {"sets": [{"name": "Calm Mind"}, {"name": "Mixed Attacker"}, {"name": "Choice Specs"}]}
}