{
  "Weezing-Galar": {
    "sets": {
      "Bulky Support": {
        "description": "<h4>Set Details</h4> <ul> <li>Galarian Weezing is a great disruptive support Pokemon that can support offensive teams by shutting down the abilities that many teams depend on with Neutralizing Gas. Galarian Weezing has a good matchup against teams that rely on Grimmsnarl to take hits, as it is able to disrupt it with Taunt before it can set up dual screens, allowing powerful partners like Koraidon and Calyrex-S to sweep through teams. Neutralizing Gas also makes it a lot harder for Miraidon and Kyogre, which are quite reliant on their respective field effects, to damage Galarian Weezing's partners.</li> <li>Taunt allows Galarian Weezing to effectively shut down Grimmsnarl, Amoonguss, and Brute Bonnet, as well as preventing the opposing team's Trick Room. Will-O-Wisp can easily cripple physical attackers such as Zamazenta-C, Calyrex-I, and Iron Hands. Toxic Spikes and Poison Gas negate recovery on Terapagos and Calyrex-I while also making it easier for a partner Calyrex-S to clean up a team that has been chipped down. Strange Steam is guaranteed to OHKO Koraidon while getting around Wide Guard, and Dazzling Gleam is a slightly weaker spread option that can consistently chip down enemies. Play Rough is a physical Fairy-type STAB move that allows Galarian Weezing to do much much more damage to Assualt Vest Iron Hands and Miraidon.</li> <li>Covert Cloak prevents Fake Out flinches from Iron Hands, Incineroar, and Rillaboom, allowing it to support its team without being slowed down and making it easier to stop Trick Room. Rocky Helmet does good chip damage to Koraidon, Zamazenta-C, and Iron Hands. It's also useful to break Urshifu-R or Chien-Pao's Focus Sash. Safety Goggles gives Galarian Weezing an immunity to Brute Bonnet and Amoonguss's Spore and Rage Powder.</li> <li>The EVs guarantee Galarian Weezing can survive a Behemoth Bash or Heavy Slam from Zamazenta-C, allowing Galarian Weezing to burn it with Will-O-Wisp. Galarian Weezing is also guaranteed to survive a Choice Specs Miraidon Electro Drift without Terrain, forcing the opponent to double target Galarian Weezing. The Speed investment lets Galarian Weezing outspeed Grimmsnarl and shut down its supportive capabilities with Taunt.</li> <li>Tera Water is used to give Galarian Weezing resistances to Calyrex-I's Glacial Lance, Koraidon's Flare Blitz, and Zamazenta-C's Behemoth Bash and Heavy Slam. Tera Dark grants Galarian Weezing an immunity to Calyrex-S's Psychic and a resistance to its Astral Barrage.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Incineroar, Tornadus, and Flutter Mane can all outspeed Galarian Weezing and use Taunt, reducing its effectiveness on the field. Zacian-C's Behemoth Blade can OHKO Galarian Weezing with a good roll, and its Steel typing gives it a resistance to Dazzling Gleam and Strange Steam as well as an immunity to Poison Gas and Toxic Spikes. Amoonguss can also check Galarian Weezing, as Spore can completely shut it down, and Amoonguss easily shrugs off Strange Steam and Dazzling Gleam while having an immunity to Poison Gas and removing Toxic Spikes on entry.</li> <li>Galarian Weezing is a good partner for Koraidon and Calyrex-S, as it turns off many of the main defensive tools of balance teams. Although Neutralizing Gas forces Koraidon to use the Ability Shield, shutting down Incineroar's Intimidate and Grimmsnarl's Prankster makes it much easier for Koraidon to sweep through teams unchecked. Disabling abilities like Protosynthesis, Quark Drive, and Prankster allows Calyrex-S to outspeed almost everything in the metagame and pressure teams with Astral Barrage. Koraidon is able to heavily threaten Incineroar, Amoonguss, and Zacian-C, while Calyrex-S can help against Flutter Mane.</li> <li>Galarian Weezing pairs well with Dondozo and Tatsugiri, as it is able to spread status with Poison Gas and Toxic Spikes, allowing Dondozo to clean up late-game while taking little damage from foes and healing with Leftovers.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 696399, "username": "R0gue_VGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589964, "username": "RauSakura"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ho-Oh": {
    "sets": {
      "Bulky Utility": {
        "description": "<h4>Set Details</h4> <ul> <li>Ho-Oh's amazing bulk, great ability, and solid defensive typing let it stand in the way of many offensive threats in the format and support its team with Tailwind. It's far from passive, though; it has great Attack and two excellent STAB moves, meaning that it often wins damage trades against frailer offensive Pokemon.</li> <li>Sacred Fire's burn chance is a massive boon for Ho-Oh, threatening to cripple bulky physical attackers like Calyrex-I and Zamazenta-C unless they Terastallize into a Fire-type.</li> <li>Clear Amulet allows Ho-Oh to ignore Incineroar's Intimidate and Parting Shot, which would otherwise reduce its damage, and Icy Wind, which would reduce the benefit Ho-Oh receives from its own Tailwind. Leftovers can be used if Ho-Oh wants to prioritize remaining healthy to dish out damage over time and pairs especially well with Regenerator and Protect.</li> <li>76 Attack EVs and an Adamant nature allow Ho-Oh to OHKO maximum HP Rillaboom and uninvested Koraidon with Brave Bird; it also allows Helping Hand-boosted Brave Bird to OHKO uninvested Calyrex-S. 68 Speed EVs allow Ho-Oh to get the jump on Ogerpon-C after the latter's Speed has been reduced by Icy Wind. Investing in Defense improves Ho-Oh's otherwise mediocre physical bulk; it is greatly favored to not be 2HKOed by Calyrex-I's Glacial Lance and +3 Zamazenta-C's Body Press. Its solid natural special bulk ensures that it never is 2HKOed by Life Orb Calyrex-S's Astral Barrage or Psychic.</li> <li>Tera Grass lets Ho-Oh resist the Water- and Electric-type attacks like Surging Strikes and Electro Drift that would otherwise threaten it. It also removes Ho-Oh's weakness to Rock, letting it take an attack like Ogerpon-C's Ivy Cudgel in a pinch.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Water-types like Kyogre and Urshifu-R threaten Ho-Oh greatly. Kyogre weakens Ho-Oh's Sacred Fire by setting rain, while Urshifu-R bypasses Protect, reducing Ho-Oh's ability to play around it. Electric-types like Miraidon, Raging Bolt, and Iron Hands are also problematic for Ho-Oh; the first two have the extra benefit of resisting Ho-Oh's STAB combination. Similarly, Rock-type attacks like Ogerpon-C's Ivy Cudgel and Lunala's Meteor Beam are immensely threatening to Ho-Oh. Ho-Oh also lacks initial damage output, so it can struggle to break opposing bulky threats like Terapagos and Lunala.</li> <li>Ho-Oh benefits damage dealers that want a bulky ally they can fall back on while also providing utility in Tailwind. Its best Restricted Pokemon partner is Choice Specs Miraidon, as it threatens opposing Water-types while using its insane power to blast through the bulky threats that Ho-Oh struggles to handle. The sun set by Koraidon and Groudon also helps with Water-types while boosting the damage of Sacred Fire; the former resists Water and can get through Terapagos, the latter is better against Electric-types, and both resist Rock. However, it easily supports other offensive Restricted Pokemon like Calyrex-S thanks to its great bulk and Tailwind.</li> <li>While Ho-Oh has great bulk, it still wants help against Calyrex-I and setup variants of Calyex-S. Foul Play Farigiraf is a good check to both. It also offers additional speed control in Trick Room and supports Ho-Oh with Helping Hand. Electric- and Grass-types are also great help for Ho-Oh to deal with opposing Water- and Electric-types. Some examples are Iron Hands, Raging Bolt, and Rillaboom.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 555379, "username": "Tbolt"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 53807, "username": "aim"}]}, {"name": "Quality checked by", "members": [{"user_id": 650323, "username": "Pengu"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Whimsicott": {
    "sets": {
      "Tailwind Support": {
        "description": "<h4>Set Details</h4> <ul> <li>Whimsicott uses its toolkit of support moves and solid defensive typing to aid its team. Prankster allows Whimsicott to get off Tailwind and Encore consistently. It can shrug off strong attacks like Close Combat from both Urshifu formes and return considerable damage to them with Moonblast. It also threatens heavy damage into Koraidon.</li> <li>Encore can punish moves such as Fake Out, Calm Mind, and Protect. Light Screen helps Whimsicott's team survive powerful attacks such as Astral Barrage from Calyrex-S, Electro Drift and Draco Meteor from Miraidon, and Moongeist Beam and Meteor Beam from Lunala.</li> <li>Covert Cloak prevents Fake Out from stopping Whimsicott from supporting its team.</li> <li>The Speed investment allows Whimsicott to always outspeed Tornadus. The special bulk investment allows it to almost always survive Astral Barrage from Tera Ghost Calyrex-S and Electro Drift from Choice Specs Miraidon. Dazzling Gleam from Choice Specs Tera Fairy Miraidon will never OHKO Whimsicott. It also survives Tera Starstorm from +1 Special Attack Terapagos and +1 Meteor Beam from Lunala.</li> <li>Tera Dark stops Prankster Encore and Taunt from opposing Whimsicott or Tornadus from disrupting Whimsicott's support moves. It also serves as a good defensive typing into Calyrex-S and Lunala.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Whimsicott is not strong into opposing Trick Room, as Tailwind would be detrimental and Trick Room setters like Calyrex-I and Lunala can switch out before being targeted by Encore. Farigiraf's Armor Tail and Indeedee-F's Psychic Terrain shut down Encore, which also prevents Whimsicott from punishing things like Protect and Trick Room.</li> <li>Koraidon can threaten an OHKO with Flare Blitz or Flame Charge onto Whimsicott, and Tera Fire keeps Koraidon safe from Moonblast. Galarian Weezing prevents priority Tailwind from being set up thanks to Neutralizing Gas. Incineroar also threatens an OHKO with Flare Blitz, can use Knock Off to remove Covert Cloak to use Fake Out later, and cannot be disrupted by Encore. Zamazenta-C can OHKO Whimsicott without being threatened by it.</li> <li>Miraidon, Lunala, and the Urshifu formes appreciate Tailwind allowing them to outspeed foes such as Calyrex-S, Flutter Mane, and Chien-Pao. Lunala in particular appreciates Whimsicott's Moonblast pressuring opposing Dark-types such as Chien-Pao and Urshifu-S. Lunala also likes the presence of Tailwind combined with its Trick Room to force the opponent to cover for both speed modes. Miraidon, in return for Whimsicott's support, threatens Flying-types Whimsicott is weak to such as Tornadus and Ho-Oh. Both Urshifu formes help Whimsicott by beating Incineroar, and Urshifu-S can OHKO Indeedee-F and Farigiraf.</li> <li>The combination of Fake Out from Pokemon like Iron Hands and Incineroar with Encore can punish Protect if it is used to avoid Fake Out. Foes are deterred from using Protect to scout what Choice Specs Miraidon will lock itself into due to the pressure exerted by Encore. Choice Specs Miraidon can also threaten heavy damage or an OHKO into Galarian Weezing and Koraidon even when Hadron Engine is not active. Miraidon also helps the threat of Encore stay active, as it can OHKO Indeedee-F and Farigiraf when Electric Terrain is on the field.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528197, "username": "ProssettiVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 678488, "username": "poketitanterra"}, {"user_id": 650323, "username": "Pengu"}, {"user_id": 589964, "username": "RauSakura"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Amoonguss": {
    "sets": {
      "Bulky Support": {
        "description": "<h4>Set Details</h4> <ul> <li>Amoonguss is an excellent support Pokemon in Regulation I, primarily thanks to a great movepool and unique typing. Amoonguss can consistently protect its teammates from Urshifu-R, Iron Hands, and Zamazenta-C by walling them throughout a game because of Regenerator.</li> <li>Amoonguss uses Pollen Puff to heal its bulkier allies and threaten a 2HKO on Brute Bonnet​; however, it can use Sludge Bomb to better threaten Ogerpon-H and Rillaboom. In niche situations, Amoonguss can also run Sludge Bomb or Clear Smog over Protect to maintain offensive pressure or deny opposing ​setup while healing its allies at the same time.</li> <li>Amoonguss prefers Rocky Helmet to cripple many physical threats it redirects towards itself, most notably Urshifu-R. Amoonguss can use Covert Cloak to gain an immunity to Fake Out, helping it apply more pressure with Spore and Rage Powder.</li> <li>The HP EVs give Amoonguss optimal health for Regenerator and, in conjunction with the Defense EVs, ensure Amoonguss survives Glacial Lance from Calyrex-I and Icicle Crash from Chien-Pao, with the rest dumped into Special Defense. 27 Speed IVs allow Amoonguss to be slower than minimum Speed base 50s like Ursaluna and Calyrex-I.</li> <li>Amoonguss uses Tera Water thanks to its resistance to Fire- and Ice-type STAB attacks from the likes of Incineroar and Chien-Pao. Amoonguss also appreciates maintaining its ​resistance to Water, ensuring it can still handle Urshifu-R. Tera Fire can also be used, as it grants Amoonguss the same crucial resistances​ but sacrifices its resistance to Water for a resistance to Grass-type moves, allowing it to adequately take on Ogerpon-H and still deal with Rillaboom.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Amoonguss struggles with its lack of presence once it is Taunted by Pokemon like Tornadus and Flutter Mane. Miraidon can threaten to OHKO it before it moves with Draco Meteor and deny Spore with its Electric Terrain. Other Pokemon that can OHKO Amoonguss are also troublesome, most notably Psychic Calyrex-S, Koraidon, Chi-Yu, and Ogerpon-H.</li> <li>Incineroar is easily Amoonguss's best partner, as it can check Calyrex-S, Chi-Yu, Chien-Pao, and Ogerpon-H, even weakening the last two with Intimidate. Incineroar can use Knock Off to remove Safety Goggles and threaten Grass-types with Flare Blitz, ensuring that Amoonguss is free to use Spore and Rage Powder. Incineroar appreciates Amoonguss's ability to redirect and switch into threatening Water- and Fighting-types like Urshifu-R, Iron Hands, and Zamazenta-C. They can also work as a pivot core thanks to their recyclable abilities and Incineroar's Fake Out.</li> <li>Amoonguss finds major success on Calyrex-S + Terapagos compositions; with Spore and Rage Powder, it allows Terapagos to safely set up in the face of the Fighting-types. Amoonguss can also heal up Terapagos, enabling ​setup opportunities and potentially gaining back Tera Shell.</li> <li>Urshifu-R is another one of Amoonguss's preferred partners, as it quickly takes care of Incineroar, Chi-Yu, and Chien-Pao​ while appreciating how well Amoonguss can handle Rillaboom and Raging Bolt.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589964, "username": "RauSakura"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Tornadus": {
    "sets": {
      "Bulky Tailwind": {
        "description": "<h4>Set Details</h4> <ul> <li>Tornadus is one of two viable priority Tailwind setters in the metagame, pairing excellently with Restricted Pokemon like Calyrex-S, Zamazenta-C, and Kyogre that appreciate its combination of weather control, speed control, and Flying-type STAB moves that allow it to threaten Restricted Pokemon like Koraidon as well as non-Restricted Pokemon like Amoonguss, Rillaboom, and the Urshifu formes.</li> <li>Bleakwind Storm is used for strong spread Flying-type STAB damage, while Hurricane is chosen to hit through the Wide Guard used by Zamazenta and Lunala while securing an OHKO on the Urshifu formes. Hurricane is only an option on Kyogre teams due to its inconsistency outside of rain. Rain Dance deactivates Koraidon's Orichalcum Pulse and significantly weakens its Fire-type moves while also setting up the rain for its own Water-type partners like Urshifu-R and Kyogre. Taunt is chosen to prevent status moves like Zamazenta-C's Wide Guard, Amoonguss's Spore, and Calyrex-I or Lunala's Trick Room that would disable or take advantage of Tornadus and its partners, Kyogre and Calyrex-S. Generally, Tornadus runs Protect on non-Covert Cloak sets in order to avoid flinches from Fake Out or on offensive teams that do not need Rain Dance and would prefer the increased staying power generated by Protect.</li> <li>Covert Cloak is chosen to allow Tornadus to set up Tailwind against Fake Out Pokemon like Incineroar and Rillaboom that would otherwise leave it vulnerable to being KOed or pressure it into using Protect . Rocky Helmet is chosen in order to allow Tornadus to punish Urshifu-R and Koraidon, forcing them to take significant recoil.</li> <li>The Speed investment allows Tornadus to outspeed maximum Speed Groudon and Kyogre, while the bulk investment allows Tornadus to survive Tera Water Surging Strikes from Urshifu-R or Thunderclap from Raging Bolt.</li> <li>Tera Dark is chosen to allow Tornadus to block Taunt from opposing Tornadus and Encore from opposing Whimsicott, while also providing it a key resistance to Calyrex-S's STAB moves.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Raging Bolt and Miraidon threaten to OHKO Tornadus with their STAB Electric-type moves, being able to OHKO it with a Special Attack Protosynthesis-boosted Thunderclap, which takes Tornadus out before it can move, or Volt Switch, which creates momentum for the opposing team, respectively. Tornadus also hates Pokemon that are able to set up Trick Room against it while threatening to OHKO it, with Restricted Pokemon like Calyrex-I and Meteor Beam Lunala being able dissuade Tornadus's Taunt with their offensive pressure. Indeedee-F and Farigaraf also present unique challenges to Tornadus, as the two of them are able to set up Trick Room while also blocking Tornadus's Prankster Taunt with their abilities. While Tornadus can OHKO Whimsicott, its Speed combined with Prankster Encore allow it to shut down Tornadus and punish it for using Tailwind or prevent it altogether with Taunt.</li> <li>Urshifu-R is Tornadus's premier partner, being able to take advantage of both the Tailwind and Rain Dance it sets up in order to do massive damage uncontested by Protect. Rillaboom is able to contest Indeedee-F and Miraidon's Terrains, threatening the former and switching in on the latter while also applying Fake Out pressure, allowing Tornadus to more effectively set Tailwind throughout the course of a game. Landorus is notable for its ability to OHKO both Raging Bolt and Miraidon while appreciating Tornadus's Tailwind allowing it to outspeed threats like Calyrex-S, Zamazenta-C, and the aforementioned Miraidon.</li> <li>Kyogre is another of Tornadus's primary partners, with Tornadus being able to hit Grass-types like Rillaboom, Amoonguss, and the Ogerpon formes super effectively with its Flying-type attacks for it while also being able to reset rain into opposing weather control. Tornadus appreciates Kyogre's ability to output immense damage into Trick Room setters like Calyrex-I, Lunala, Farigiraf, and Indeedee-F, allowing it to freely set Tailwind for its partners. Calyrex-S also greatly appreciates Tornadus's Tailwind, which allows it to gain an advantage against opposing Calyrex-S and Koraidon. Tornadus's Taunt support is vital for both Restricted Pokemon, as it is able to prevent Zamazenta-C and Lunala from using Wide Guard. Zacian-C is a also a notable partner because it appreciates Tornadus's ability to set Tailwind against Miraidon and Calyrex-S while taking advantage of its ability to set rain in the face of Koraidon. Zacian-C is also able to handle a lot of Tornadus's checks, since it is able to outspeed and OHKO Raging Bolt, Miraidon, and most Calyrex-I.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 553122, "username": "gephicka"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589964, "username": "RauSakura"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Incineroar": {
    "sets": {
      "Bulky Support": {
        "description": "<h4>Set Details</h4> <ul> <li>Incineroar is an outstanding Pokemon in Regulation I thanks to a combination of its great typing, Intimidate, and a movepool rich in disruption moves. This helps Incineroar act as a check to many Restricted Pokemon like Calyrex-S, Zacian-C, and Lunala after burning its Power Herb, as well as comfortably take on Pokemon like Rillaboom, Amoonguss, and Chien-Pao.</li> <li>Will-O-Wisp can be used over Flare Blitz to cripple physical attackers further, especially Zamazenta-C and Clear Amulet Calyrex-I without Tera Fire, which don't care for Intimidate. Taunt can be used over either Knock Off or Flare Blitz to disrupt Trick Room strategies and shut down Amoonguss, as well as deny Pokemon from using Protect or setting up. U-turn can be used over Parting Shot to still pivot in the face of Clear Amulet and Taunt users.</li> <li>Incineroar appreciates Safety Goggles to ignore Amoonguss's Spore and Rage Powder, but it can also gain great value from Rocky Helmet crippling Urshifu-R and breaking Chien-Pao's Focus Sash.</li> <li>The Defense EVs and Impish nature allows Incineroar to maximize survival odds of taking Surging Strikes from Urshifu-R and almost always survive Ursaluna's Guts-boosted Facade without an Intimidate drop, while the Special Defense investment ensures Incineroar avoids the 2HKO from Flutter Mane's Moonblast and Raging Bolt's Thunderbolt.</li> <li>Incineroar uses Tera Bug and Tera Ghost primarily to handle Fighting-types like Zamazenta-C and Iron Hands. Tera Bug offers Incineroar a resistance to Ground-type moves from Calyrex-I and Landorus, while Tera Ghost grants Incineroar a Fake Out immunity. Tera Water allows Incineroar to take Kyogre and Urshifu-R's Water-type STAB moves while retaining its resistance to Fire- and Ice-type moves from the likes of Chi-Yu and Calyrex-I.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Incineroar struggles against Pokemon that can OHKO it before it can utilize its disruptive moves, such as Zamazenta-C, Miraidon, Koraidon, and Urshifu-R with a damage-boosting item.</li> <li>Incineroar is a great fit on a plethora of teams, but it prefers Urshifu-R for an ally, as Unseen Fist lets it spectacularly take advantage of Incineroar's Fake Out, threatening Pokemon inclined to use Protect. Incineroar also handles Rillaboom and Amoonguss for Urshifu-R.</li> <li>Restricted Pokemon effective against Zamazenta-C, like Lunala, Koraidon, and Calyrex-S, have an easy time pairing up with Incineroar, especially as it takes on problematic Pokemon like Chien-Pao and opposing Calyrex-S. Miraidon is another great teammate as Incineroar can pressure Rillaboom and Amoonguss, which easily take Miraidon's attacks for their partners.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589964, "username": "RauSakura"}, {"user_id": 657713, "username": "Flarefox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Lunala": {
    "sets": {
      "Bulky Support": {
        "description": "<h4>Set Details</h4> <ul> <li>Lunala leverages its high bulk with Shadow Shield and wide movepool to support its team, mainly protecting it from spread attacks such as Astral Barrage and Glacial Lance with Wide Guard. Its high Special Attack and strong Ghost- and Fairy-type attacks allow it to weaken the opposing team over the course of a game, allowing its partners to clean up after it.</li> <li>Moonblast is a great option to hit Dark-types such as Incineroar and Normal-types like Ursaluna, as well as OHKO both Urshifu formes.</li> <li>Electric Seed allows Lunala to feel much less threatened by strong physical attacks such as Glacial Lance from Calyrex-I, Flare Blitz from Koraidon, and Headlong Rush from Ursaluna. This lets Lunala both set up and take down Trick Room or continue dealing damage.</li> <li>Lunala's Special Attack investment allows it to 3HKO many bulky Pokemon, such as Zamazenta-C, Calyrex-I after Terastallization, and Amoonguss with Moongeist Beam. Its bulk allows it to survive Tera Fire Flare Blitz from Ability Shield Koraidon under Neutralizing Gas and Timid Choice Specs Miraidon Electro Drift half of the time.</li> <li>Tera Fairy allows Lunala to resist Dark-type attacks such as Knock Off from Incineroar while being immune to Draco Meteor from Miraidon and removing Lunala's weakness to Ghost. It also allows Lunala to 3HKO Incineroar with Tera Fairy Moonblast.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Lunala often struggles to stay safe without Terastallizing, mainly due to Dark- and Ghost-type attacks from Incineroar, Chi-Yu, Lunala, and Calyrex-S. As such, it is not hard to force it to Terastallize. It can also struggle against Urshifu-R, ignoring the Defense boost with Surging Strikes and only being affected by Shadow Shield on the first hit.</li> <li>After Shadow Shield is broken, it can be quickly knocked out with strong neutral attacks such as Astral Barrage from Calyrex-S after Lunala has Terastallized, Electro Drift from Miraidon, and Flare Blitz from Koraidon. Lunala can also become very passive when weakened by moves such as Spirit Break, Parting Shot, and Snarl from Grimmsnarl and Incineroar.</li> <li>Lunala requires Miraidon as a partner to activate its Electric Seed and appreciates bulky partners to protect itself, such as Incineroar. It works very well with Assault Vest Miraidon, as it allows both Restricted Pokemon on the team to soak up damage and use consistent strong attacks to chunk down foes, and Lunala can protect Miraidon from Glacial Lance with Wide Guard.</li> <li>Ursaluna is also a great partner for it, as it can be very difficult to deny Trick Room from Lunala, allowing Ursaluna to get on the field and devastate with Facade or Headlong Rush, while Lunala cleans up foes that Ursaluna may not be able to take out in one hit. It also appreciates Pokemon that can clean up foes that are chipped down by Lunala, such as Urshifu-R.</li> </ul>"
      },
      "Offensive Support": {
        "description": "<h4>Set Details</h4> <ul> <li>Equipped with versatile support options, a phenomenal defensive ability paired with great bulk, and solid offensive coverage, Lunala can be an extremely flexible option for many teams. Utilizing the combination of its Ghost typing and Wide Guard, Lunala can have very advantageous matchups into popular Restricted Pokemon like the Calyrex formes, Kyogre, Zamazenta-C, and Koraidon by blocking their strong STAB moves like Glacial Lance, Astral Barrage, and Water Spout with Wide Guard and being immune to Body Press and Close Combat thanks to its typing.</li> <li>Using Meteor Beam paired with Power Herb gives Lunala a strong but risky burst option versus Pokemon like Incineroar and Ho-Oh that also increases the damage of its Moongeist Beam. Trick Room serves as a consistent speed control option thanks to Shadow Shield, allowing Lunala and its team to have more favorable matchups into faster-paced team compositions. Expanding Force is another choice when paired with Indeedee-F to deal consistent STAB spread damage, with Moonblast being a solid alternative for extra coverage against opposing Dark-types such as Chien-Pao, Grimmsnarl, and Urshifu-S.</li> <li>The bulk investment allows Lunala to survive Throat Chop from Chien-Pao and Astral Barrage from Calyrex-S with Shadow Shield active. The Speed investment is enough to still function both inside and outside of Trick Room; for example, it outspeeds threats like Rillaboom and maximum Speed Incineroar when Trick Room is not active while getting the jump on Urshifu when Trick Room is active. The remaining EVs are dumped into Special Attack.</li> <li>Tera Water provides a strong neutral typing while also giving it key resistances to powerful Fire- and Ice-type moves such as Koraidon's Tera Fire-boosted Flare Blitz and Calyrex-I's Glacial Lance. Tera Fairy acts as a strong alternative option, turning Lunala's Dark weakness into a resistance and increasing the damage of its Moonblasts, allowing it to pick up OHKOs on Pokemon such as Miraidon and Urshifu-R at +1.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Lunala mainly struggles against Dark- and Normal-type Pokemon like Terapagos, Ursaluna, and Incineroar that Lunala is unable to do reliable damage to if Meteor Beam has already been used. Grimmsnarl can also pose a major threat to Lunala, using Spirit Break and Light Screen to lower Lunala's already non-extraordinary damage while also potentially threatening huge damage if it has Foul Play. Farigiraf is especially an issue for Lunala, being able to tank a Meteor Beam and immune to Moongeist Beam. Farigiraf can also threaten good damage with Foul Play and deny Lunala of its Trick Room with a Trick Room of its own.</li> <li>Fighting-type Pokemon like Koraidon and Urshifu-R that also want a solid bulky partner serve as great teammates to cover for the Dark- and Normal-types that Lunala struggles with. Incineroar also works as a solid partner, providing Fake Out pressure to let Lunala set Trick Room or use Meteor Beam as well as Intimidate complementing Lunala's already superb bulk. Grimmsnarl also makes for a great partner for Lunala; setting up both Light Screen and Reflect to allow Lunala to stick on the field longer and fire off consistent damage with Moongeist Beam.</li> <li>Chi-Yu is another solid pair with Lunala, threatening opposing Ghost-types like Calyrex-S that Lunala could occasionally struggle against while having Beads of Ruin increasing Lunala's overall damage output. Indeedee-F also provides a lot of helpful tools for Lunala in the form of Follow Me, which redirects threatening attacks, and Psychic Terrain, which both blocks important priority moves in Trick Room like Sucker Punch and enables the use of Expanding Force.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 664689, "username": "PokeknightVGC"}, {"user_id": 668837, "username": "Carrotman"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 627748, "username": "Jesuuuus"}, {"user_id": 678488, "username": "poketitanterra"}, {"user_id": 589964, "username": "RauSakura"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Rillaboom": {
    "sets": {
      "Bulky Assault Vest": {
        "description": "<h4>Set Details</h4> <ul> <li>Rillaboom is a strong physical attacker and a flexible positional piece. Grassy Surge is able to power up its Grass-type attacks while giving its team passive recovery and Terrain control against Miraidon and Indeedee-F compositions. Its access to Fake Out and U-turn help partners set up and position safely. Its Grass-type STAB moves are valuable to hit the format's Water-types, such as Urshifu-R and Tera Water Calyrex-I.</li> <li>Rillaboom runs both Wood Hammer and Grassy Glide to give it access to both strong burst damage and a priority attack to pick off foes at low HP, such as Choice Scarf Urshifu and Calyrex-S. High Horsepower can also be run to hit Pokemon like Incineroar, Miraidon, and Raging Bolt, though it prefers to run U-turn to help the team position correctly and reset Fake Out pressure.</li> <li>Assault Vest patches up Rillaboom's mediocre Special Defense, allowing it to better take on special attackers such as Miraidon, Calyrex-S, and Kyogre. Its inability to use Protect is less relevant, as Rillaboom would often prefer to switch out when threatened in order to reset Fake Out pressure.</li> <li>The allocated bulk allows Rillaboom to survive Helping Hand Draco Meteor from Timid Choice Specs Miraidon in the Grassy Terrain or a +2 Astral Barrage from Life Orb or Tera Ghost Calyex-S. The Attack investment allows Rillaboom to OHKO bulky Flutter Mane with Wood Hammer.</li> <li>Tera Fire gives Rillaboom a resistance to the Ice and Fire-type attacks it was previously weak to, such as Chien-Pao's Icicle Crash, Calyrex-I's Glacial Lance, and Chi-Yu's Fire-type STAB moves. Tera Water gives similar defensive properties but doesn't leave Rillaboom weak to Calyrex-I's High Horsepower or Kyogre's Water-type STAB moves. In exchange, Tera Water Rillaboom gives up the immunity to getting burned and makes itself vulnerable against opposing Rillaboom.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Calyrex-I, Koraidon, Ogerpon-H, Chi-Yu, and Chien-Pao all threaten to OHKO Rillaboom with their respective Fire and Ice-type attacks.</li> <li>Rillaboom does not threaten Zamazenta-C or Zacian-C, while both threaten significant damage back.</li> <li>Incineroar and Urshifu-R commonly pair with Rillaboom to form a Fire / Water / Grass core on balance teams. Incineroar and Urshifu-R are strong into the likes of Calyrex-I, Ogerpon-H, Chi-Yu, and Chien-Pao.</li> <li>Calyrex-S and Terapagos appreciate Rillaboom's Fake Out support to allow them to set up, while Terapagos especially appreciates Rillaboom's Grassy Terrain recovery resetting Tera Shell. Calyrex-S can also remove opposing Koraidon.</li> <li>Zamazenta-C appreciates Rillaboom's ability to remove physically bulky Water-types such as Urshifu-R and Tera-Water Calyrex-I, and it can protect Rillaboom from Glacial Lance thanks to Wide Guard. Zamazenta-C can also remove Chien-Pao to free up Rillaboom.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 627748, "username": "Jesuuuus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 645750, "username": "iPetBigfoot"}, {"user_id": 668837, "username": "Carrotman"}, {"user_id": 650323, "username": "Pengu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Grimmsnarl": {
    "sets": {
      "Dual Screens Support": {
        "description": "<h4>Set Details</h4> <ul> <li>Grimmsnarl's main role is to set up Light Screen and Reflect to increase the bulk of its partners. Grimmsnarl can also be an annoying disruptor with Thunder Wave and sometimes Parting Shot. Setting up dual screens is very effective against hyper offensive teams using Koraidon and Calyrex-S, as these teams are normally quite frail, and surviving one extra attack can often be the difference maker in those matchups.</li> <li>Thunder Wave is a good option for disruption and speed control, allowing partners like Miraidon and Urshifu-R to outspeed Calyrex-S and Koraidon, while Parting Shot is good for further weakening foes and giving Grimmsnarl a strong pivoting option, which helps partners like Ho-Oh and Ursaluna activate their abilities of Regenerator and Guts, respectively, with less risk. Spirit Break OHKOes Koraidon before it Terastallizes, as well as being able to threaten both Urshifu formes, and it reduces the Special Attack of Pokemon such as Calyrex-S and Lunala. Foul Play allows Grimmsnarl to do significant damage to Calyrex-I, Calyrex-S, and Lunala.</li> <li>Light Clay allows Reflect and Light Screen to last longer, allowing for prolonged damage mitigation even after Grimmsnarl has fainted.</li> <li>The Special Defense investment allows Grimmsnarl to live a Moonblast from Timid Flutter Mane when Light Screen isn't up, and Grimmsnarl can also live a Choice Specs Miraidon Electro Drift when Light Screen is up. The Defense EVs let it survive Ursaluna's Guts-boosted Facade when behind Reflect.</li> <li>Tera Ghost helps Grimmsnarl avoid Fake Out from Iron Hands, Rillaboom, and Incineroar, which can be crucial to allow Grimmsnarl to get dual screens up or use an extra Thunder Wave. It also gives it an immunity to Zamazenta-C's Body Press and removes the Heavy Slam and Behemoth Bash weaknesses.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Urshifu-R ignores all of Grimmsnarl's damage mitigation with Surging Strikes, and some Choice Band variants can also OHKO Grimmsnarl with Surging Strikes. Taunt from Incineroar and Flutter Mane can effectively shut down Grimmsnarl's supportive ability, leaving it stuck using either Spirit Break or Foul Play. Galarian Weezing's Neutralizing Gas prevents Grimmsnarl from getting its dual screens off immediately, allowing Koraidon, which is usually paired with Galarian Weezing, to easily OHKO it with Tera Fire Flare Blitz.</li> <li>Dark-, Electric-, and Ground-types like opposing Grimmsnarl, Incineroar, Miraidon, and Landorus are immune to Prankster Thunder Wave, reducing Grimmsnarl's effectiveness on the field. Fake Out from Rillaboom, Iron Hands, and Incineroar is also detrimental to Grimmsnarl, as it stops Grimmsnarl from supporting its team. Spore from Amoonguss and Brute Bonnet can make it difficult for Grimmsnarl to get both screens up in a game.</li> <li>Grimmsnarl's dual screens are able to support most teams, but Miraidon, Ho-Oh, Lunala, and Calyrex-I especially enjoy Grimmsnarl's support because they typically favor bulkier playstyles. Miraidon is able to quickly remove Urshifu-R while also protecting Grimmsnarl from Spore with Electric Terrain, and Ho-Oh is a great check for Koraidon, as it resists all of its moves and threatens an OHKO with Brave Bird. Incineroar and Iron Hands provide support with Fake Out, which makes it easier to get both screens up, and Urshifu-R can threaten Taunt Incineroar and other Dark- and Ground-types, which are immune to Thunder Wave, with Close Combat and Surging Strikes.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 696399, "username": "R0gue_VGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 678488, "username": "poketitanterra"}, {"user_id": 646416, "username": "CodeVG"}, {"user_id": 589964, "username": "RauSakura"}, {"user_id": 650323, "username": "Pengu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Zamazenta-Crowned": {
    "sets": {
      "Bulky Attacker": {
        "description": "<h4>Set Details</h4> <ul> <li>With its incredible bulk, high damage, and good Speed, Zamazenta-C can be a very powerful threat to many teams. It can do great damage with Body Press and protect its allies well from Pokemon such as Calyrex-S, Chi-Yu, Miraidon, Kyogre and Terapagos-S with Wide Guard. It can also wall common threats such as Chien-Pao, Rillaboom, and Ogerpon-C.</li> <li>Behemoth Bash is a consistent damage choice for Zamazenta-C, as it can do good damage to Calyrex-I and Tera Fairy Miraidon and Raging Bolt. Heavy Slam does more damage against the general metagame but doesn't do much to the aforementioned Pokemon.</li> <li>The EV spread allows it to outspeed maximum speed Landorus. It also lets Zamazenta-C live Close Combat from Life Orb Koraidon.</li> <li>Tera Dragon switches all of Zamazenta-C's weaknesses to neutralities or resistances, and the added resistsances can be very useful against the likes of Koraidon, Miraidon, Urshifu-R, and Kyogre.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Zamazenta-C can struggle with Koraidon, which can do massive damage to it. Electric Seed Lunala sets can wall Zamazenta-C and do respectable damage with Moongeist Beam. Ho-Oh resists both of Zamazenta-C's STAB moves, can do good damage and burn it with Sacred Fire, and sets up Tailwind. Amoonguss can also cause Zamazenta-C trouble, since Amoonguss doesn't take much damage from it and can threaten back with Spore or redirect Zamazenta-C's attacks. Landorus can OHKO Zamazenta-C with Earth Power if it has Life Orb or outspeed it and do massive damage with Choice Scarf while resisting Body Press. Volcarona can also check Zamazenta-C incredibly well by resisting both of its STAB moves and having a chance to burn Zamazenta-C, heavily reducing its offensive capabilities.</li> <li>Calyrex-S is the most common Restricted Pokemon pairing with Zamazenta-C. Together, they have amazing coverage, and Zamazenta-C can protect it from opposing Calyrex-S's Astral Barrage with Wide Guard. Calyrex-S also deals with Koraidon and Amoonguss with Psychic. Miraidon can also be a strong partner for Zamazenta-C by doing incredible damage to a ton of its checks, such as Ho-Oh, Koraidon, and Amoonguss, and taking advantage of its defensive capabilities, with Zamazenta-C being a good partner to pivot to with Volt Switch. Chien-Pao works really well with Zamazenta-C, since it boosts Body Press's damage, allowing Zamazenta-C to OHKO Pokemon like Terapagos-S and Incineroar, and deals well with most of its checks, hitting Koraidon, Lunala, Amoonguss, and Landorus hard. Another common partner is Rillaboom, setting its Terrain to give Zamazenta-C even more survivability with its healing and allow it to survive Choice Specs Electro Drift from Miraidon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 660956, "username": "thacrow"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 650323, "username": "Pengu"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Choice Locked": {
        "description": "<h4>Set Details</h4> <ul> <li>Urshifu-R is one of the format's top offensive threats, thanks to its high Attack and strong STAB moves. Unseen Fist allows Urshifu-R to circumvent foes' Protect, which reduces the number of defensive plays the opponent can go for if you can position Urshifu-R correctly. Urshifu-R has especially strong matchups against Incineroar, Chi-Yu, Chien-Pao, and Terapagos.</li> <li>U-turn allows Urshifu-R to reposition while dealing chip damage to threats such as Rillaboom. Aqua Jet allows Urshifu-R to pick off faster foes at low HP. Coaching can be used to boost the Attack and Defense of teammates, usually Calyrex-I. Rock Tomb is a more niche option that can be used for speed control, and it's especially appreciated by Calyrex-S in the mirror matchup.</li> <li>Urshifu-R's Choice Scarf allows it to outspeed most of the metagame, most importantly Calyrex-S, ensuring it can get strong attacks off. Choice Band is a more niche option to boost Urshifu-R's damage output further, allowing it to 2HKO Calyrex-I with Surging Strikes or Close Combat.</li> <li>The allocated bulk allows Urshifu-R to survive Incineroar's Fake Out into Calyrex-S's Astral Barrage, while the Attack investment allows Tera Water Choice Scarf Urshifu-R to OHKO most Calyrex-S.</li> <li>Tera Water boosts the damage of Surging Strikes, which allows Choice Scarf Urshifu-R to OHKO most Calyrex-S. It also removes Urshifu-R's weakness to Psychic- and Fairy-type attacks. Tera Ghost gives an immunity to Fake Out as well as Zamazenta-C's Body Press and opposing Urshifu formes' Close Combat.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Raging Bolt can OHKO Urshifu-R with its priority Thunderclap. Flutter Mane and Whimsicott also threaten to OHKO Urshifu-R with Moonblast, with the former outspeeding it and the latter resisting all its STAB attacks. Amoonguss can safely redirect all of Urshifu-R's attacks and potentially deal damage back with Rocky Helmet.</li> <li>Koraidon's sun weakens the damage of Surging Strikes, while Life Orb Close Combat will OHKO Urshifu-R. Choice Specs Miraidon OHKOes Urshifu-R with any of its attacks.</li> <li>Rillaboom and Incineroar's pivot moves allow Choice Scarf Urshifu-R to get in position safely. Strong speed control options such as Tornadus's Prankster Tailwind and Lunala's Trick Room can ensure Choice Band Urshifu-R is always moving first.</li> <li>Tornadus's Bleakwind Storm and Chien-Pao's Icicle Crash threaten the Grass-types that are strong against Urshifu-R as well as Miraidon and Raging Bolt.</li> <li>Kyogre and Pelipper set the rain to power up Urshifu's Surging Strikes as well as overriding Koraidon's sun. Calyrex-I benefits from Urshifu-R's Coaching, which allows Calyrex-I to better take on Koraidon and Groudon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 627748, "username": "Jesuuuus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 645750, "username": "iPetBigfoot"}, {"user_id": 589964, "username": "RauSakura"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Calyrex-Ice": {
    "sets": {
      "Bulky Attacker": {
        "description": "<h4>Set Details</h4> <ul> <li>Calyrex-I is a physical attacker that uses its incredible bulk and high Attack to threaten the high number of Grass- and Dragon-type Pokemon such as Miraidon, Koraidon, Rillaboom, Amoonguss, and Raging Bolt that could be problematic for its teammates. Calyex-I also works well in Trick Room thanks to its low Speed and access to the move.</li> <li>Leech Seed allows Calyrex-I to work better into Pokemon that resist Glacial Lance such as Zamazenta-C while also giving it more of a staying presence because of the HP recovery. High Horsepower threatens Incineroar and Zamazenta-C, which resist Glacial Lance. Both moves help into Zamazenta-C; Leech Seed tries to stall out Zamazenta-C's health, while High Horsepower punishes Wide Guard.</li> <li>Leftovers is ran with Leech Seed to allow Calyrex-I to recover even more of its HP after each turn, while Clear Amulet sets allow Calyrex-I to be unhindered by Intimidate and Parting Shot from Incineroar.</li> <li>The Special Defense and HP investment let Calyrex-I survive Electro Drift from Choice Specs Miraidon while Electric Terrain is active. Calyrex-I can sometimes opt to run less Special Defense in order to invest more into Attack on Clear Amulet sets, but this comes at the cost of worse rolls into Choice Specs Miraidon and Life Orb Calyrex-S. The increased Attack investment allows Calyrex-I to threaten Koraidon with an OHKO if it doesn't Terastalize.</li> <li>Tera Water allows Calyrex-I to resist Water- and Fire-type moves that would previously threaten it such as Water Spout from Kyogre and Flare Blitz from Koraidon. Tera Fire gives Calyrex-I a resistance to the previously mentioned Fire-type attacks while also making it immune to Will-O-Wisp from Incineroar, though it makes Calyrex-I worse into Urshifu-R because Surging Strikes threatens it after Terastallizing and common Urshifu-R partners like Calyrex-S threaten Calyrex-I before Terastallizing. Both Tera types help into Zacian-C and Zamazenta-C, as they allow Calyrex-I to resist Steel-type attacks from the aforementioned foes.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Calyrex-I struggles against bulkier Pokemon such as Grimmsnarl, Terastallized Amoonguss, and Incineroar that aren't immediately threatened by Glacial Lance and can annoy Calyrex-I with Reflect, Spore, or Will-O-Wisp if it isn't Tera Fire. Offensive Pokemon such as Calyrex-S and Miraidon can also be problematic, as they threaten huge damage against Calyrex-I.</li> <li>Miraidon pairs very well with Calyrex-I, as it threatens the bulkier Pokemon that Calyrex-I struggles with and denies Spore from Amoonguss and Brute Bonnet, while Calyrex-I threatens the Grass-, Ground-, and Dragon-type Pokemon that resist Miraidon's Electric-type attacks. Calyrex-I also discourages Rillaboom, a common check to Miraidon. Kyogre is another good Restricted Pokemon to pair with Calyrex-I. Kyogre threatens Incineroar with its Water-type attacks and works well in the Trick Room that Calyrex-I sets up. The rain set up by Kyogre weakens Koraidon, which makes Calyrex-I harder to remove. Calyrex-I threatens Pokemon that resist Kyogre's Water-type attacks like Rillaboom and Raging Bolt.</li> <li>Grimmsnarl sets Light Screen and Reflect for Calyrex-I, boosting its defenses even further and making Leech Seed recovery more effective. Urshifu-R is another good partner, bypassing Protect from Pokemon that try to stall out Trick Room turns. Iron Hands and Farigiraf both pair well with Miraidon, Calyrex-I's main Restricted Pokemon partner, and work well in Calyrex-I's Trick Room.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 645750, "username": "iPetBigfoot"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 657713, "username": "Flarefox"}, {"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Calyrex-Shadow": {
    "sets": {
      "Glass Cannon": {
        "description": "<h4>Set Details</h4> <ul> <li>Focus Sash Calyrex-S is a strong attacker and disruptor capable of swinging games around, threatening many common Pokemon such as both Calyrex formes, Amoonguss, and Koraidon.</li> <li>Encore is great in scaring off many moves such as Fake Out from Rillaboom and Incineroar, Calm Mind from Terapagos, Protect, and much more. Disable, on the other hand, is useful to shut down powerful moves that can easily stop Calyrex-S, most notably Wide Guard from the likes of Lunala and Zamazenta-C. Nasty Plot can boost Calyrex-S's sweeping power, letting it OHKO Assault Vest Iron Hands with Psychic. Encore and Disable help Terapagos in particular, helping it to set up even in the face of threatening Fighting-types like Urshifu-R and Koraidon.</li> <li>Focus Sash increases Calyrex-S's survivability, allowing it to survive the many attacks that can OHKO it such as Moongeist Beam from Lunala and Electro Drift from Miraidon. Calyrex-S will be able to hit hard, live an attack, and then retaliate.</li> <li>Tera Ghost boosts the power of Astral Barrage, letting Calyrex-S always OHKO Tera Ghost Incineroar and Ursaluna while also OHKOing Lunala most of the time.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Dark-types like Incineroar and Chi-Yu are issues for Calyrex-S, as Calyrex-S has no good way of breaking through them. Farigiraf is another struggle for Calyrex-S thanks to Farigiraf's immunity to Astral Barrage and access to Foul Play. Even with Disable, Zamazenta-C and Lunala are still bothersome for Calyrex-S, with both using Wide Guard and Lunala in particular threatening huge damage into Calyrex-S with Moongeist Beam. Urshifu-R can threaten Calyrex-S, using Tera Water or Tera Stellar to OHKO Calyrex-S with Surging Strikes.</li> <li>Fighting-type Pokemon such as Urshifu-R and Zamazenta-C are great partners for Calyrex-S, providing good coverage into Dark-types while threatening opposing Zamazenta-C, letting Calyrex-S more freely use Astral Barrage. Calyrex-S is able to help these Fighting-type Pokemon by using Astral Barrage to break through Ghost-types like Flutter Mane.</li> <li>Dark-type Pokemon like Chi-Yu and Incineroar are able to break down Farigiraf and Lunala with Dark Pulse and Knock Off, respectively. Chi-Yu has the added benefit of threatening Zamazenta-C thanks to Overheat. Additionally, Chi-Yu's Beads of Ruins allows Calyrex-S to OHKO bulky Calyrex-I with Tera Ghost Astral Barrage and 2HKO Zamazenta-C with Psychic or Astral Barrage. Calyrex-S, in return, can threaten Pokemon like Iron Hands and Urshifu-R, which normally scare off the aforementioned Dark-types.</li> <li>Terapagos and Koraidon both heavily appreciate Focus Sash Calyrex-S's presence, as it threatens Fighting-types for Terapagos and helps out into Ghost-types for Koraidon. With Disable, Calyrex-S can also deny Wide Guard from the likes of Lunala, letting Terapagos freely Terastallize and use Tera Starstorm. This, in conjunction with Encore, can force the Wide Guard user to use Struggle. In return, Terapagos is able to be a reliable switch-in for Ghost-type attacks that heavily threaten Calyrex-S. Koraidon, on the other hand, is able to chunk many threats to Calyrex-S such as Lunala, Zamazemta-C, and Farigiraf, helping create openings for Calyrex-S to sweep.</li> <li>Rillaboom is a good partner to threaten Urshifu-R while also providing Fake Out support. Rillaboom can also use U-turn to chip down Lunala and Farigiraf, notably breaking Lunala's Shadow Shield.</li> </ul>"
      },
      "Setup Sweeper": {
        "description": "<h4>Set Details</h4> <ul> <li>Calyrex-S is an excellent sweeper, taking advantage of its high Speed and Special Attack coupled with a powerful spread move in Astral Barrage. Calyrex-S is often oppressive because it pressures Pokemon like Koraidon, both Calyrex formes, and Amoonguss to Terastallize to survive its STAB moves and threatens to snowball through teams if allowed to set up with Nasty Plot.</li> <li>On more offensive compositions, such as those with Miraidon and Chi-Yu, Encore can be opted for over Nasty Plot to punish defensive archetypes with Pokemon like Calm Mind Terapagos by discouraging setup.</li> <li>The damage boost from Life Orb is important for securing OHKOs on certain Pokemon such as Koraidon and Amoonguss with Psychic and non-Assault Vest Miraidon and Raging Bolt with Astral Barrage after a Nasty Plot.</li> <li>The Defense investment allows Calyrex-S to survive Tera Fire Flame Charge from Koraidon in the sun and almost always survive Tera Water Surging Strikes from Urshifu-R. Max Speed and a Timid nature are important for at least guaranteeing a Speed tie against opposing Calyrex-S and, by extension, outrunning Chien-Pao, Miraidon, and Koraidon. The remaining EVs are put into Special Attack to maximize its damage output.</li> <li>Tera Dark grants Calyrex-S a resistance to Dark- and Ghost-type moves, which is helpful for Chien-Pao's Sucker Punch, Lunala's Moongeist Beam, Incineroar's Knock Off, and opposing Calyrex-S's Astral Barrage.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Many common Pokemon have Ghost- or Dark-type moves that force Calyrex-S to Terastallize, including aforementioned threats like Chien-Pao, Incineroar, and Calyrex-S, as well as others like Miraidon with Snarl and Chi-Yu with both Snarl and Dark Pulse.</li> <li>Choice Scarf Chi-Yu is a major problem because it can outspeed and OHKO Calyrex-S with Dark Pulse or threaten significant damage with Overheat. In sun, Flutter Mane is also a threat because it outspeeds Calyrex-S and can OHKO it with Shadow Ball or Moonblast after Calyrex-S Terastallizes.</li> <li>Farigiraf is problematic because Calyrex-S can't deal much damage to it, while Farigiraf can set up Trick Room, which Calyrex-S struggles to operate under. Grimmsnarl can wall Calyrex-S and set up Light Screen to weaken its damage output while also being able to slow Calyrex-S down with Thunder Wave. Brute Bonnet can easily tank Calyrex-S's attacks and threaten it with Sucker Punch or put it to sleep with Spore.</li> <li>Pokemon with Wide Guard like Zamazenta-C and Lunala prevent Calyrex-S from sweeping with Astral Barrage.</li> <li>Incineroar and Rillaboom are great partners for Calyrex-S, as they provide Fake Out utility that helps it set up. Additionally, Incineroar can reduce foes' damage output with Intimidate and Parting Shot, while Rillaboom can help Calyrex-S withstand Miraidon's attacks by overriding its Terrain.</li> <li>Zamazenta-C is the most common Restricted Pokemon paired with this set because, with Body Press, it threatens Dark- and Normal-types that Calyrex-S struggle to hit like Terapagos, Incineroar, and Brute Bonnet. It also blocks spread moves with Wide Guard, protecting Calyrex-S against moves like Astral Barrage from opposing Calyrex-S, Glacial Lance from Calyrex-I, Heat Wave and Snarl from Chi-Yu, and Water Spout and Origin Pulse from Kyogre.</li> <li>Miraidon is a solid Restricted partner for this set, as both it and Calyrex-S apply fast offensive pressure. Typically, with Chi-Yu on the team boosting their damage, the two special wallbreakers can immediately overwhelm teams.</li> <li>Urshifu-R can also threaten the aforementioned Dark- and Normal-types with Close Combat and Incineroar and Chi-Yu with Surging Strikes. Choice Scarf Urshifu-R can outspeed and deal massive damage to opposing Calyrex-S. Additionally, it can break Chien-Pao's Focus Sash, allowing Calyrex-S to finish it off and receive the Grim Neigh boost.</li> <li>Amoonguss and Ogerpon-H protect Calyrex-S by redirecting attacks with Rage Powder and Follow Me, respectively. Amoonguss can help against Trick Room teams by outspeeding Pokemon like Calyrex-I in Trick Room and putting them to sleep with Spore. Additionally, Amoonguss can redirect Thunder Wave from Grimmsnarl, which isn't as much of an issue for Amoonguss because it is naturally slow. Ogerpon-H can safely redirect Spore from Brute Bonnet and Amoonguss as well as pressure both with Ivy Cudgel.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 646416, "username": "CodeVG"}, {"user_id": 650323, "username": "Pengu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589964, "username": "RauSakura"}, {"user_id": 645750, "username": "iPetBigfoot"}, {"user_id": 650323, "username": "Pengu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ursaluna": {
    "sets": {
      "Trick Room Sweeper": {
        "description": "<h4>Set Details</h4> <ul> <li>Ursaluna is one of the strongest non-Restricted physical sweepers in Regulation I, as it has an enormous Attack stat further bolstered by its ability. Ursaluna finds its place in the metagame as a powerful physical wallbreaker that is able to sweep under Trick Room. With its powerful STAB moves, it is able to OHKO many important Pokemon in the format, such as Miraidon, Koraidon, and Rillaboom, while outspeeding them under Trick Room.</li> <li>While Ursaluna is burned, and with maximum Attack and a Brave nature, Facade picks up OHKOs on almost all Koraidon, Miraidon, and Rillaboom, and it can OHKO Ho-Oh with a high roll. It can also 2HKO Calyrex-I and Iron Hands. Ursaluna's HP EVs are optimized to reduce burn chip damage. The Defense investment gives it a high chance to live Surging Strikes from Urshifu-R, and the remaining EVs in Special Defense give Ursaluna a high chance to avoid the 2HKO from Tera Stellar Terapagos-S's Tera Starstorm with two turns of burn damage.</li> <li>Headlong Rush and Earthquake are strong Ground-type STAB moves that allow Ursaluna to hit Ghost- and Steel-types that it struggles to hit with Facade. Although Headlong Rush makes Ursaluna more vulnerable to foes' attacks, it's necessary to pick up OHKOs on Calyrex-S and Iron Hands. Earthquake is a powerful spread option, doing significant damage to Miraidon and Koraidon, OHKOing Miraidon without Tera Fairy and Tera Fire Koraidon, while ignoring redirection from foes like the Ogerpon formes and Brute Bonnet. Earthquake does have the downside of hitting Ursaluna's ally, but this can be worked around with partners like Ho-Oh and Wide Guard Lunala. Protect is an essential move on Ursaluna, with its main use being to stall a turn to allow Flame Orb to activate. Protect can also let Ursaluna stay safe while a partner sets up Trick Room.</li> <li>Tera Ghost allows Ursaluna to avoid Fake Out from Rillaboom, Iron Hands, and Incineroar. It also protects Ursaluna from Fighting-type moves, such as Koraidon and Urshifu-R's Close Combat as well as Low Kick from Iron Hands. The main reason to run Tera Fairy is to give Ursaluna the advantage against Choice-locked Miraidon. Ursaluna's natural Ground typing stops Miraidon's Electric-type moves, and Tera Fairy blocks Draco Meteor. This means that Miraidon can only use Dazzling Gleam, which can not OHKO Ursaluna, while Facade OHKOes Miraidon back.</li> </ul> <h4>Teambuilding</h4> <ul> <li>The Urshifu formes, Koraidon, Zamazenta-C, and Iron Hands all pressure Ursaluna with powerful Fighting-type STAB moves, and Rillaboom and Calyrex-I also threaten OHKOs on Ursaluna. With minimum Speed, Ursaluna has to play around Speed ties with common threats like Iron Hands and Calyrex-I. Incineroar, when using Tera Bug or Ghost, can easily weaken Ursaluna with Intimidate and Parting Shot. As a physical attacker, Ursaluna can be severely weakened by Reflect from Grimmsnarl. Since Ursaluna's main role is as a sweeper, having its damage reduced makes it much more vulnerable to losing damage trades and having its Trick Room stalled out, especially against Pokemon like Iron Hands, Miraidon, and opposing Ursaluna.</li> <li>Ursaluna has a strong typing in the Regulation I metagame, with immunities to the main STAB moves of Miraidon, Calyrex-S, and Lunala, making it easier for Ursaluna to remove these Restricted Pokemon that can be very threatening for two of Ursaluna's best Restricted partners, Ho-Oh and Lunala. Miraidon also appreciates the wallbreaking power of Ursaluna, as it can quickly remove Rillaboom and Iron Hands, two Pokemon that Miraidon has a hard time KOing.</li> <li>Pivot moves used by Incineroar, Miraidon, and Urshifu-R allow Ursaluna to enter the field before the end of a turn, activating Flame Orb immediately without needing to stall a turn with Protect. Miraidon is able to threaten many of the Fighting-types that check Ursaluna with its Electro Drift and Dazzling Gleam while being able to pivot with Volt Switch. With help from Incineroar's Intimidate, Ursaluna can survive Urshifu-R's Close Combat and Iron Hands's Low Kick, and Parting Shot makes Incineroar a good slow pivot that can weaken a threatening target and switch in Ursaluna without taking any damage and with Flame Orb activated.</li> <li>Speed control options like Lunala's Trick Room and sometimes Ho-Oh's Tailwind set Ursaluna up to sweep through teams without having to worry about being KOed before taking KOs itself. Lunala's Moongeist Beam and Moonblast can threaten the Fighting- and Ghost-types that Ursaluna struggles with offensively and defensively. Ho-Oh's Sacred Fire threatens Calyrex-I and Rillaboom, and Wide Guard from Lunala protects Ursaluna from Calyrex-I's Glacial Lance. Urshifu-R is a good counter to Incineroar, which is otherwise a problem for Ursaluna.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 696399, "username": "R0gue_VGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 553122, "username": "gephicka"}, {"user_id": 645750, "username": "iPetBigfoot"}, {"user_id": 589964, "username": "RauSakura"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Farigiraf": {
    "sets": {
      "Electric Seed": {
        "description": "<h4>Set Details</h4> <ul> <li>Farigiraf is a great supportive pick for a team. Its good defensive typing makes it a solid Calyrex-S check, and with Electric Seed, it can also match up well into Calyrex-I. Farigiraf also has the ability to block various priority moves such as Fake Out, Sucker Punch, and Thunderclap, keeping Farigiraf and its partners safe.</li> <li>Foul Play can hit both Calyrex formes for heavy damage while dealing solid damage to other strong physical attackers such as Koraidon, Ogerpon, and Ursaluna. Psychic can be used to reliably hit Urshifu-R and Amoonguss, while Psychic Noise can stop recovery from Rillaboom's Grassy Terrain and Terapagos's and Ho-Oh's Leftovers and prevent Iron Hands from using Drain Punch.</li> <li>Electric Seed helps Farigiraf have a much better matchup against strong physical attacks such as Wood Hammer from Rillaboom and Throat Chop or Crunch from Chien-Pao. Electric Seed can also weaken the power of Knock Off from Incineroar, which Farigiraf would normally struggle against.</li> <li>The EV spread allows Farigiraf to live a Crunch or Throat Chop from Chien-Pao, Flare Blitz from Life Orb Koraidon, or Body Press from Zamazenta-C comfortably while letting it take a Draco Meteor from Special Attack Booster Energy Raging Bolt.</li> <li>Tera Water is great against Urshifu-R because it will resist Surging Strikes, and it lets Farigiraf more comfortably take Glacial Lance from Calyrex-I. Tera Dark packs a resistance to Wicked Blow from Urshifu-S, while letting Foul Play OHKO low bulk Calyrex-S and deal hefty damage to Calyrex-I, though it can be vulnerable to Close Combat from both Urshifu formes and Koraidon and Body Press from Zamazenta-C.</li> </ul> <h4>Teambuilding</h4> <ul> <li>The Urshifu formes can bypass the Electric Seed Defense boost with Surging Strikes and Wicked Blow, with Urshifu-S being able to OHKO Farigiraf. Farigiraf can also be vulnerable to strong special attacks like Electro Drift from Miraidon, Dark Pulse from Chi-Yu, and Water Spout and Origin Pulse from Kyogre. Dark-types such as Incineroar, Chien-Pao, and Grimmsnarl are good checks, since Farigiraf does negligible damage back. Taunt from Flutter Mane and Incineroar can also shut down Farigiraf's supportive capabilities.</li> <li>Miraidon is mandatory to pair alongside this set, helping Farigiraf activate Electric Seed and easily removing the Urshifu formes with Electro Drift and Dazzling Gleam while greatly appreciating Farigiraf's ability to block Fake Out and Sucker Punch, which may hinder Miraidon. Iron Hands and Calyrex-I like Farigiraf's ability to reliably set Trick Room and support with Helping Hand while having a good matchup into opposing Iron Hands and Calyrex-I. In return, Iron Hands can remove the Dark-types that Farigiraf struggles against.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 625105, "username": "hduser"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589964, "username": "RauSakura"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Brute Bonnet": {
    "sets": {
      "Bulky Support": {
        "description": "<h4>Set Details</h4> <ul> <li>Brute Bonnet uses its solid stats and supportive movepool to aid its team, threatening common metagame threats such as Calyrex-S and Lunala with Sucker Punch while resisting or being immune to their STAB attacks. It can beat out non-Restricted Pokemon such as Urshifu-R by shutting them down with Spore and finishing them with Seed Bomb. It can shut down most foes with Spore and protect its allies with Rage Powder.</li> <li>Moves like Sucker Punch and Seed Bomb prevent Brute Bonnet from being fully passive and ignored or shut down by Taunt. Seed Bomb threatens Urshifu-R and Kyogre. Pollen Puff can heal teammates and threatens opposing Brute Bonnet.</li> <li>Covert Cloak ignores Fake Out pressure, which can let Brute Bonnet put a foe to sleep without being stopped.</li> <li>The physical bulk investment allows Brute Bonnet to survive Close Combat from the Urshifu formes and Glacial Lance from Calyrex-I. The special bulk investment ensures Focus Sash Flutter Mane will not KO Brute Bonnet with Moonblast. With a Protosynthesis boost, it survives Icicle Crash from Tera Stellar Chien-Pao, Close Combat from Tera Stellar Urshifu formes almost every time, and +1 Body Press from Zamazenta-C.</li> <li>Tera Water turns the weaknesses to Fire- and Ice-type moves into resistances, which is helpful against Pokemon such as Chi-Yu and Calyrex-I, and dropping the weaknesses to Fairy- and Fighting-type attacks helps versus the Urshifu formes, Koraidon, and Flutter Mane.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Miraidon stops Brute Bonnet from putting grounded foes to sleep with Electric Terrain while also threatening to OHKO Brute Bonnet with Draco Meteor. It is weak to common metagame attacks such as Glacial Lance from Calyrex-I and Body Press from Zamazenta-C.</li> <li>Close Combat from the Urshifu formes threatens heavy damage. Follow Me users immune to Spore such as the Ogerpon formes and Safety Goggles Indeedee-F can shut down this Pokemon's Spore and Sucker Punch pressure while also ignoring Rage Powder.</li> <li>Koraidon can set sun and bolster Brute Bonnet's defensive capabilities, and it threatens the Urshifu formes and Miraidon with an OHKO. It in turn threatens Psychic-types like Lunala and Calyrex-S for Koraidon. Lunala and Calyrex-S appreciate Brute Bonnet's Sucker Punch pressure against Ghost-types such as opposing Lunala and Calyrex-S, which threaten them, and Rage Powder protects them from opposing Ghost- and Dark-type attacks like Chien-Pao's Sucker Punch, Flutter Mane's Shadow Ball, and Lunala's Moongeist Beam.</li> <li>Frail attackers like Flutter Mane and Chi-Yu enjoy redirection support from Rage Powder while also rounding out a sun team core. Flutter Mane threatens Fighting-type attackers like Koraidon and the Urshifu formes, and Chi-Yu threatens Grass-type Pokemon, such as Rillaboom and Amoonguss, which cannot be put to sleep.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528197, "username": "ProssettiVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 650323, "username": "Pengu"}, {"user_id": 589964, "username": "RauSakura"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Flutter Mane": {
    "sets": {
      "Glass Cannon": {
        "description": "<h4>Set Details</h4> <ul> <li>Flutter Mane's role is to capitalize on the Speed boost provided by its sun setter and to offer speed control while pressuring opposing Pokemon to Terastallize with its coverage. In sun, it outspeeds major offensive threats like Miraidon, Koraidon, Choice Scarf Urshifu-R, and Calyrex-S, threatening them with its STAB moves.</li> <li>Shadow Ball is useful for threatening Lunala, Calyrex-S, and opposing Flutter Mane more effectively. Icy Wind is Flutter Mane's preferred speed control option, as it slows down both foes—enabling Koraidon, which delivers far greater damage output, to clean up more easily. It also helps break Focus Sash.</li> <li>Taunt is a useful tool for shutting down opposing Trick Room setters like Lunala and Calyrex-I, blocking Spore from Amoonguss and Brute Bonnet, and preventing setup from threats like Terapagos. Taunt has niche uses such as stopping Parting Shot from Incineroar and preventing Protect and redirection on turns after Taunt is used, allowing your team to apply as much offensive pressure as possible before the sun runs out.</li> <li>Becuase it usually has Koraidon to set the sun for its Protosynthesis Speed boost, this Flutter Mane set can run full offensive investment and a Focus Sash instead of Booster Energy. Focus Sash is valuable for this more offensive Flutter Mane build due to its fragility, especially on the physical side.</li> <li>Tera Normal is mainly used as a countermeasure for Calyrex-S to gain an immunity to its Astral Barrage, though it can also be useful to gain an immunity to Lunala's Moongeist Beam. Tera Fairy is used to boost Moonblast's power, which lets it OHKO non-Assault Vest Miraidon outright as well as Tera Dragon Zamazenta-C and Brute Bonnet most of the time. Tera Stellar carries a similar benefit to Tera Fairy in terms of Moonblast OHKOs, though only on its first use, and it can also enable Shadow Ball to score surprise OHKOs on Pokemon such as Shadow Shield Lunala when Chi-Yu is on the field.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Bulky Restricted Pokemon like Zamazenta-C and Ho-Oh check this offensive Flutter Mane set, as they can comfortably take its hits and strike back with moves like Behemoth Bash or Heavy Slam and Sacred Fire, respectively.</li> <li>Priority move users such as Chien-Pao with Sucker Punch or Ice Shard and Rillaboom with Grassy Glide hinder the effectiveness of the set by breaking Focus Sash or picking up the KO when it is down to 1 HP before it can attack.</li> <li>Flutter Mane pairs well with Koraidon because it sets up the sun, triggering Flutter Mane's Protosynthesis Speed boost. In turn, Flutter Mane can provide speed control with Icy Wind, so Koraidon is able to outspeed Pokemon like Calyrex-S and threaten OHKOs with Close Combat or Flare Blitz.</li> <li>Flutter Mane is commonly paired with Choice Scarf Chi-Yu to round out a sun core because both Flutter Mane and Chi-Yu exert fast, immediate offensive pressure, with Chi-Yu's ability helping bolster Flutter Mane's damage output.</li> <li>Lastly, Pokemon with redirection such as Brute Bonnet and Indeedee-F can help Flutter Mane by protecting it from priority attacks like Raging Bolt's Thunderclap and Chien-Pao's Sucker Punch, particularly when Flutter Mane is taken down to 1 HP.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 646416, "username": "CodeVG"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 657713, "username": "Flarefox"}, {"user_id": 650323, "username": "Pengu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Chien-Pao": {
    "sets": {
      "Glass Cannon": {
        "description": "<h4>Set Details</h4> <ul> <li>Chien-Pao uses its high Speed and Ice- and Dark-type STAB attacks to threaten foes like Miraidon and Calyrex-S. Sword of Ruin bolsters its already high Attack stat, elevating the damage it can deal. Sword of Ruin additionally increases the damage its partners can deal, notably allowing Zamazenta-C to achieve more KOs with Body Press.</li> <li>Sucker Punch is used to threaten foes naturally faster than Chien-Pao such as Calyrex-S, while Crunch is used when Chien-Pao moves before its foe like when it is up against Lunala. Taunt is used to disrupt supportive foes such as Lunala and Amoonguss, preventing them from using Trick Room and Spore, respectively. Icicle Crash deals more damage and doesn't make contact, keeping Chien-Pao's Focus Sash intact against Rocky Helmet users like Amoonguss, with the downside of having the potential to miss. While Ice Spinner deals less damage, it won't miss and has the benefit of removing Terrain, weakening the damage dealt by Miraidon and its partners.</li> <li>Focus Sash guarantees Chien-Pao can survive at least one hit so it can revenge kill faster foes and be positioned flexibly. Life Orb increases the damage Chien-Pao deals, guaranteeing it can OHKO bulky Miraidon variants with Ice Spinner.</li> <li>The defensive investment allows Chien-Pao to survive Surging Strikes from Choice Scarf Urshifu-R. A Jolly nature allows Chien-Pao to outrun non-maximum Speed Miraidon, whereas an Adamant nature lets Chien-Pao OHKO Rillaboom with Icicle Crash.</li> <li>Tera Stellar boosts Chien-Pao's damage to greater heights, allowing it to OHKO Ursaluna with Icicle Crash and Tera Grass Ho-Oh with Ice Spinner. Tera Ghost, meanwhile, prevents Fake Out disruption while keeping Focus Sash intact and provides Chien-Pao with an immunity to Close Combat from Koraidon and Body Press from Zamazenta-C.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Bulky Restricted Pokemon like Zamazenta-C, Ho-Oh, and Kyogre are problematic for Chien-Pao. They threaten Chien-Pao, and it can't sufficiently damage them if they haven't Terastallized.</li> <li>Chien-Pao struggles to damage Dark-types like Incineroar and Grimmsnarl. They can also reduce Chien-Pao's damage with Intimidate, Will-O-Wisp, and Parting Shot from Incineroar and Reflect from Grimmsnarl.</li> <li>A partner Zamazenta-C synergizes well with Chien-Pao. Zamazenta-C threatens opposing Zamazenta-C, Incineroar, and Grimmsnarl, while Chien-Pao provides Sword of Ruin, letting Zamazenta-C OHKO Ogerpon-H with Body Press. Zamazenta-C also protects Chien-Pao from Kyogre's Water Spout and Origin Pulse with Wide Guard, forcing them to deal little damage with Ice Beam against Chien-Pao.</li> <li>Miraidon works well with Chien-Pao, KOing Ho-Oh and Kyogre while Chien-Pao threatens Rillaboom, which Miraidon struggles to damage.</li> <li>Urshifu-R appreciates Sword of Ruin letting it OHKO Ho-Oh with Surging Strikes; it also threatens Incineroar and Grimmsnarl while Chien-Pao removes Grass-types like Rillaboom and Amoonguss.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589964, "username": "RauSakura"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 650323, "username": "Pengu"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Chi-Yu": {
    "sets": {
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <ul> <li>Choice Scarf Chi-Yu functions as a fast and powerful attacker that can threaten many common Restricted Pokemon with heavy damage, including both Calyrex formes, Zamazenta-C, and Lunala, while bolstering its teammates' special damage output with Beads of Ruin.</li> <li>Although Snarl is Chi-Yu's weakest move, it allows it to chip foes while shutting down many Restricted Pokemon offensively, including Miraidon and Lunala, and breaking Focus Sash, which is notably used by Flutter Mane.</li> <li>Choice Scarf allows Chi-Yu to outspeed the majority of the format, notably including Calyrex-S and Choice Scarf Urshifu-R.</li> <li>Tera Ghost allows Chi-Yu to avoid Fake Out and alleviate some of Chi-Yu's weaknesses; it particularly provides an immunity to Fighting-type attacks from Zamazenta-C and Iron Hands. Tera Fire can be used as an alternative on teams with priority-blocking measures such as Indeedee-F and Farigiraf to bolster the damage of Heat Wave and Overheat, including guaranteeing an OHKO against Brute Bonnet and Zacian-C with Heat Wave and against Flutter Mane with Overheat.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Common metagame threats such as Incineroar, Urshifu-R, and Koraidon can resist its STAB moves and, in the case of the latter two, threaten to OHKO Chi-Yu. Raging Bolt and Iron Hands, due to their bulk and power, can also pressure Chi-Yu.</li> <li>Without Tera Ghost, Chi-Yu is vulnerable to Fake Out from the likes of Rillaboom and Incineroar. Opposing speed control, in the form of Tailwind and Trick Room, can cause many threats like Urshifu-R, Ogerpon-C, and Ursaluna to outspeed Chi-Yu and take advantage of its weak defenses.</li> <li>Additionally, Wide Guard users like Zamazenta-C and Lunala can take advantage of Chi-Yu locked into Snarl or Heat Wave.</li> <li>Due to its lack of bulk, priority moves can threaten Chi-Yu severely, namely Aqua Jet from Urshifu-R, Sucker Punch from Chien-Pao after Terastallizing, and Thunderclap from Raging Bolt.</li> <li>Strong partners for Chi-Yu include powerful special attackers, such as Calyrex-S and Miraidon, which can take advantage of its Beads of Ruin while threatening Urshifu-R and Koraidon.</li> <li>Koraidon also pairs very well with Chi-Yu, as not only do they form a powerful core offensively, with Chi-Yu threatening Lunala and Calyrex-S and Koraidon threatening Incineroar and Urshifu-R, but Koraidon also provides sun to bolster Chi-Yu's Fire-type attacks.</li> <li>Flutter Mane is another common partner for Chi-Yu, as it benefits from Beads of Ruin to bolster its damage output, while Flutter Mane can run Taunt to deny Wide Guard and Trick Room.</li> <li>Chi-Yu also appreciates redirection support to alleviate its frailty, commonly from Brute Bonnet and Indeedee-F, which can also provide support with Spore and Psychic Terrain, respectively.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 695310, "username": "sheepie_sheep1"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 650323, "username": "Pengu"}, {"user_id": 589964, "username": "RauSakura"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Koraidon": {
    "sets": {
      "Glass Cannon": {
        "description": "<h4>Set Details</h4> <ul> <li>Koraidon deals devastating physical damage in a metagame with few Fighting- and Fire-resistant Pokemon. Koraidon excels when it outspeeds and KOes its foes before they can attack. Koraidon has great matchups against Zamazenta-C, Terapagos, and Incineroar.</li> <li>Flame Charge is used to deal chip damage and increase Koraidon's Speed, allowing it to outrun Calyrex-S. Close Combat is the preferred Fighting-type STAB attack on Life Orb variants to maximize the damage Koraidon deals in exchange for increasing the damage it receives. Collision Course is used more commonly on Clear Amulet and Ability Shield variants; it has no drawbacks but deals less damage than Close Combat unless it is super effective. Close Combat is able to achieve an OHKO on Urshifu-R, while Collision Course only has a low chance to do so.</li> <li>Life Orb maximizes Koraidon's damage, allowing it to OHKO uninvested Miraidon with Close Combat as well as Incineroar after Intimidate. Clear Amulet prevents Koraidon from having its Attack stat lowered further by Intimidate cycling from Incineroar and prevents Speed drops by Icy Wind from Flutter Mane. Ability Shield is used exclusively on teams where Koraidon is paired with Galarian Weezing, allowing Koraidon to maintain its damage boost from Orichalcum Pulse and set up sun.</li> <li>The Attack investment and an Adamant nature allow Koraidon to OHKO Calyrex-S with Flare Blitz. The defensive investment lets Koraidon survive Brave Bird from Ho-Oh after Koraidon Terastallizes and Astral Barrage from Life Orb Calyrex-S. The Speed investment enables it to outrun Ogerpon-C. Alternatively an EV spread of 4 HP / 252 Atk / 252 Spe with a Jolly nature can be used to maximize damage and Speed to outrun non-maximum Speed Miraidon.</li> <li>Tera Fire grants Koraidon a resistance to Fairy- and Ice-type attacks such as Dazzling Gleam from Miraidon and Glacial Lance from Calyrex-I as well as enhancing the damage dealt by its Fire-type attacks, allowing Koraidon to OHKO +1 Zamazenta-C with Flare Blitz and Calyrex-I with Flame Charge. Tera Fire additionally provides Koraidon with an immunity to burns.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Koraidon struggles to sufficiently damage Lunala with Shadow Shield intact. Depending on its set, Lunala can easily threaten Koraidon with Moonblast or Meteor Beam after Koraidon has Terastallized. Flutter Mane threatens Koraidon with Moonblast, and it can slow down non-Clear Amulet sets with Icy Wind.</li> <li>Miraidon threatens to OHKO it with Dazzling Gleam and Draco Meteor. When Koraidon has Terastallized, Miraidon can deal devastating damage with Electro Drift and Volt Switch.</li> <li>Koraidon pairs well with Ghost-types such as Lunala and Calyrex-S to threaten opposing Lunala and Flutter Mane with Astral Barrage and Moongeist Beam, respectively. Flutter Mane threatens Miraidon with Moonblast and handles Lunala and opposing Flutter Mane with Shadow Ball, as well as providing speed control with Icy Wind to allow Koraidon to attack before its foes can.</li> <li>Brute Bonnet provides redirection with Rage Powder and can disrupt foes with Spore. Brute Bonnet additionally threatens Ghost-types and Calyrex-I with Sucker Punch.</li> <li>Galarian Weezing pairs well with Koraidon by disabling abilities such as Lunala's Shadow Shield thanks to Neutralizing Gas, allowing Koraidon to OHKO Lunala with Flare Blitz.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589964, "username": "RauSakura"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 657713, "username": "Flarefox"}, {"user_id": 650323, "username": "Pengu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Miraidon": {
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <ul> <li>Miraidon uses its high Speed and Special Attack to deal huge amounts of damage to almost the entire metagame. Miraidon's high damage output allows it to threaten to OHKO opposing Restricted Pokemon such as the Calyrex formes, Koraidon, and Kyogre, forcing defensive play around it.</li> <li>Volt Switch gives Miraidon the option to pivot out, dealing good chip damage while also getting an ally into a more advantageous position. Dazzling Gleam gives Miraidon a spread damage option while threatening the Dragon-types that resist Volt Switch and Electro Drift.</li> <li>Choice Specs boosts Miraidon's damage even further. The damage boost from Choice Specs when paired with a Modest nature allows Miraidon to OHKO non-specially defensive Calyrex-I with Draco Meteor or Electro Drift in Electric Terrain and Calyrex-S with Draco Meteor even if Electric Terrain isn't active. -A Modest nature guarantees that Tera Fairy Dazzling Gleam OHKOes all Miraidon not running an Assault Vest, while a Timid Nature lets Miraidon outspeed all Zamazenta-C and gives it the best chance to outspeed opposing Miraidon.</li> <li>Tera Fairy boosts Dazzling Gleam's damage while also granting Miraidon an immunity to Dragon-type attacks from opposing Miraidon and Raging Bolt.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Miraidon is very hard to check defensively, so most counterplay tries to outspeed and threaten it with an OHKO or a large amount of damage. Chien-Pao ties Miraidon in Speed and threatens to hit it for super effective damage while removing Electric Terrain with Ice Spinner. Calyrex-I threatens Miraidon once Trick Room has been set up.</li> <li>Rillaboom is a nuisance for Miraidon, resisting Volt Switch and Electro Drift while overriding Miraidon's Electric Terrain.</li> <li>Incineroar helps into Chien-Pao and Calyrex-I, as Intimidate and Parting Shot reduce Chien-Pao's damage and Will-O-Wisp is able to weaken even Clear Amulet Calyrex-I. Farigiraf also pairs well with Miraidon. Since Miraidon is unable to use Protect, Farigiraf can block Fake Out and boost Miraidon's damage even further with Helping Hand, letting it OHKO Rillaboom with Draco Meteor. Iron Hands pairs well with Farigiraf to give Miraidon teams a Trick Room mode. Miraidon also activates Iron Hand's Quark Drive, boosting its damage. Iron Hands can use Fake Out to give Miraidon a chance to attack without having to worry about taking a hit in return.</li> <li>Grimmsnarl and Whimsicott can provide speed control for Miriadon with Thunder Wave and Tailwind, respectively, while also providing damage reduction through Light Screen from both and Reflect from Grimmsnarl. Whimsicott can also use Encore to punish foes that use Protect in front of Miraidon's offensive pressure.</li> <li>For Restricted Pokemon partners, Calyrex-I threatens the Grass-, Dragon-, and Ground-types that resist or are immune to Miraidon's Electric-type attacks. Ho-Oh threatens to OHKO Rillaboom and sets Tailwind for Miraidon, allowing it to outspeed the entire metagame if they don't have their own Tailwind set. Lunala pairs well with Miraidon as a bulky Trick Room setter that punishes faster foes that try to outspeed and threaten Miraidon.</li> </ul>"
      },
      "Assault Vest": {
        "description": "<h4>Set Details</h4> <ul> <li>Assault Vest Miraidon is meant to serve a more flexible, defensive role in contrast to standard Choice Specs sets. Due to the introduction of a second Restricted Pokemon in Regulation I, it doesn't need to function as a team's main source of offense, meaning that it's able to use the Assault Vest to function as a bulky supportive option as opposed to offensive Choice Specs sets.</li> <li>Snarl is chosen in order to further neuter special attackers and allow Miraidon to apply pressure to opposing Restricted Pokemon through damage reduction in conjunction with the added bulk from its Assault Vest. Volt Switch allows Miraidon to act as a bulky pivot able to take hits from faster special attackers like Calyrex-S and reposition.</li> <li>Assault Vest augments Miraidon's ability to take on special attacking Restricted Pokemon like Calyrex-S, Kyogre, Lunala, and opposing Miraidon. Assault Vest also lets Miraidon position more flexibly than Choice-locked sets while letting Miraidon function as a more defensive Restricted Pokemon, with the Special Defense boost allowing Miraidon to live two Life Orb Astral Barrages and three unboosted Astral Barrages from Calyrex-S.</li> <li>20 Speed EVs are used to outspeed Kyogre and Groudon, while 212 Special Attack EVs lets Miraidon secure OHKOs on Pokemon like Incineroar, Calyrex-S, and Zamazenta-C with Tera Electric Electro Drift. The remaining EVs are placed into Miraidon's HP and defenses to maximize its general bulk.</li> <li>Tera Electric is used to allow Miraidon to make up for some of the damage lost from using Assault Vest, with it being instrumental in Miraidon's ability to secure key OHKOs on Pokemon like the aforementioned Incineroar. It also greatly aids Miraidon defensively by removing its weaknesses to opposing Miraidon's Draco Meteor and Dazzling Gleam, as well as Ice-type attacks from Calyrex-I and Chien-Pao.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Trading a lot of its damage output by dropping Choice Specs can often leave Miraidon lacking in damage against key threats. Rillaboom is able to take on Miraidon's hits and change its Terrain, and Iron Hands is able to take hits even better from Assault Vest Miraidon, with Draco Meteor doing a maximum of half of its HP and leaving Miraidon weakened and out of position.</li> <li>Calyrex-I is able to take a hit and OHKO Miraidon in return, Terapagos is able to clear Miraidon’s Terrain and set up against it, Koraidon is able to outspeed and deal massive damage with Life Orb Close Combat, and opposing Miraidon likely outspeeds it and can force Terastallization by threatening an OHKO with Choice Specs Draco Meteor.</li> <li>Assault Vest Miraidon functions excellently as a supporting piece alongside Trick Room-focused Restricted Pokemon like Calyrex-I and Lunala, which are able to help it turn the tables on faster Restricted Pokemon like Koraidon and opposing Miraidon, with Calyrex-I being able to threaten an OHKO on Rillaboom and opposing Miraidon and Lunala being able to take on Iron Hands and Koraidon. Electric Terrain is able to block Amoonguss and Brute Bonnet's Spore while giving Lunala a Defense boost from Electric Seed.</li> <li>Miraidon greatly appreciates Grimmsnarl's dual screen support, allowing it to even further outlast opposing Restricted Pokemon like the Calyrex formes as well as Chien-Pao, while Urshifu-R compliments Miraidon by applying immediate pressure on Terapagos and Chien-Pao. Incineroar is able to supplement Miraidon's physical bulk via Intimidate and Will-O-Wisp, helping it take physical attacks from Chien-Pao, Zamazenta-C, Life Orb Koraidon, non-Tera Fire Calyrex-I, and Iron Hands and allowing Miraidon to retaliate for significant damage. Incineroar's STAB moves are also very useful to Miraidon, as they damage key threats like Rillaboom, Chien-Pao, and the Calyrex formes, putting them into range of Miraidon's attacks.</li> </ul>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <ul> <li>Choice Scarf Miraidon is a fast and deadly attacker, pivoting around the battlefield and dealing good damage to top Pokemon such as Calyrex-S, Ho-Oh, and Koraidon while also setting Electric Terrain to deny sleep moves from Amoonguss, Brute Bonnet, and Smeargle.</li> <li>Volt Switch is amazing in helping Miraidon pivot and chip foes in the process. Snarl allows for damage mitigation from special attackers like Calyrex-S, Lunala, and opposing Miraidon. Dazzling Gleam can be run over Snarl to deal decent damage against foes like Iron Hands and Raging Bolt, although Snarl is generally preferred for its versatility.</li> <li>Choice Scarf allows Miraidon to outspeed the majority of the format, only losing to Booster Energy Iron Bundle and Flutter Mane while beating out some of the fastest Pokemon, including Calyrex-S and Choice Scarf Urshifu-R.</li> <li>Tera Electric lets Miraidon deal more damage with Electro Drift and Volt Switch, notably letting Miraidon OHKO Farigiraf and Calyrex-S with Electro Drift.</li> </ul> <h4>Teambuilding</h4> <ul> <li>While Choice Scarf Miraidon moves before a majority of the metagame, it lacks the damage output of Choice Specs sets. Like Choice Specs variants, Choice Scarf Miraidon struggles to break through bulky Electric-resistant foes such as Rillaboom and Amoonguss. With the power drop from forgoing Choice Specs, Miraidon misses KOs on many bothersome Pokemon, notably missing the OHKO on Tera Fire Koraidon and Calyrex-I with Electro Drift.</li> <li>Calyrex-I is a great offensive partner for Miraidon, threatening the aforementioned Electric-resistant Pokemon like Amoonguss that would otherwise stop Miraidon in its tracks. Miraidon can help out Calyrex-I by beating Water-types that resist Glacial Lance like Kyogre and Urshifu-R. Zamazenta-C is another great partner, using Wide Guard to defend Miraidon from Precipice Blades and Glacial Lance from Groudon and opposing Calyrex-I, respectively, while also spreading good damage to special walls such as Assault Vest Rillaboom and Iron Hands.</li> <li>Farigiraf not only is able to boost Miraidon's damage with Helping Hand but also blocks Fake Out with Armor Tail and either sets up or reverses Trick Room. Miraidon can also set up Electric Terrain for Farigiraf, denying Spore from Amoonguss and Brute Bonnet while also activating Farigiraf's Electric Seed. Pokemon like Iron Hands, Ogerpon-C, and Volcarona are able to create openings for Miraidon to safely attack with Fake Out, Follow Me, and Rage Powder, respectively, and all of them fend off strong attackers that threaten Miraidon, notably Calyrex-I.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 553122, "username": "gephicka"}, {"user_id": 645750, "username": "iPetBigfoot"}, {"user_id": 650323, "username": "Pengu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589964, "username": "RauSakura"}, {"user_id": 668837, "username": "Carrotman"}, {"user_id": 645750, "username": "iPetBigfoot"}, {"user_id": 657713, "username": "Flarefox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ogerpon-Hearthflame": {
    "sets": {
      "Offensive Redirector": {
        "description": "<h4>Set Details</h4> <ul> <li>With its immunity to Spore from Amoonguss and Brute Bonnet, Ogerpon-H is able to use Follow Me to support its allies while offensively putting pressure on common threats such as Rillaboom and Urshifu-R. Additionally, Ogerpon-H matches up well offensively into Calyrex-I and Zacian-C.</li> <li>Wood Hammer is the most common Grass-type STAB option on Ogerpon-H for its high and consistent damage output, notably OHKOing Urshifu-R. Grassy Glide can be used as a niche option when paired with Rillaboom for powerful priority in Grassy Terrain.</li> <li>This EV spread allows Ogerpon to almost always take a Tera Water Surging Strikes from Urshifu-R, a +1 Glacial Lance from most Calyrex-I, or a Choice Specs Draco Meteor from Timid Miraidon under Light Screen. It is also able to OHKO Rillaboom with Ivy Cudgel, outspeed Modest Landorus-I, and pick up an OHKO on both Calyrex formes with +1 Attack Tera Fire Ivy Cudgel.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Incineroar can be very problematic for Ogerpon-H, reducing its damage output with Intimidate and Parting Shot and resisting its STAB moves. Other Dragon- and Fire-types such as Koraidon and Chi-Yu can also threaten Ogerpon-H while resisting its STAB combination.</li> <li>Ogerpon-C can outspeed and threaten Ogerpon-H with an OHKO with Ivy Cudgel, while other fast threats, including Calyrex-S and Miraidon, can outspeed and threaten it with huge damage. Ogerpon-H can also struggle against powerful spread damage from Calyrex-I and Terapagos, which ignore Follow Me.</li> <li>Ogerpon-H pairs well with Calyrex-S and Zamazenta-C, as it can protect both from powerful attacks and notably allows Calyrex-S to set up, while Calyrex-S is able to threaten Koraidon and Zamazenta threatens Incineroar for Ogerpon-H. Miraidon also benefits greatly from redirection from Ogerpon-H as well as its ability to threaten Rillaboom with an OHKO using Ivy Cudgel, while Miraidon can threaten Incineroar and Dragon-types for Ogerpon-H.</li> <li>Calyrex-I also greatly appreciates redirection support, helping it to set up Trick Room and sweep, while Calyrex-I can hit the Dragon-types that can stifle Ogerpon-H's offense and allows Ogerpon-H to threaten faster foes with Trick Room.</li> <li>Urshifu-R is a strong partner for Ogerpon-H, as together, they form a potent offensive core. Urshifu-R appreciates redirection to safely dish out huge damage, while it can threaten Incineroar and, with Tera Water, KO Ogerpon-C and Calyrex-S for Ogerpon-H. Rillaboom is another strong partner, as Follow Me support allows for it to safely pivot with U-turn while Rillaboom's Grassy Terrain bolsters Ogerpon-H's Grass-type moves and provides priority to Ogerpon-H's Grassy Glide.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 695310, "username": "sheepie_sheep1"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 589964, "username": "RauSakura"}, {"user_id": 646416, "username": "CodeVG"}, {"user_id": 650323, "username": "Pengu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Ogerpon-Cornerstone": {
    "sets": {
      "Offensive Redirector": {
        "description": "<h4>Set Details</h4> <ul> <li>Ogerpon-C serves as an offensive threat with its strong STAB moves while providing redirection support paired with Sturdy, which guarantees Ogerpon-C can take a minimum of two hits, allowing for reliable redirection support in keeping its partners healthy. It also threatens Pokemon such as Chi-Yu, Tornadus, Kyogre, and Ho-Oh. Furthermore, Ogerpon-C mitigates Amoonguss and Brute Bonnet's effectiveness, as it is immune to Spore and can safely redirect Spore while ignoring Rage Powder, allowing it to maintain offensive pressure on their partners.</li> <li>Power Whip is used over Horn Leech, as it is able to achieve OHKOs where Horn Leech would not, with examples including Kyogre and Urshifu-R. Power Whip also deals no recoil damage unlike Wood Hammer, which would break Sturdy. However, Power Whip's main drawback is its lack of accuracy, making it a less consistent attacking option compared to its alternatives. Follow Me's great synergy with Sturdy allows for reliable redirection, which gives Ogerpon-C's partner a safer opportunity to switch in or set up.</li> <li>Terastallization can be a secondary supporting option if Ogerpon-C is not at full health, as removing its Grass Typing and gaining Embody Aspect would make Ogerpon-C able to wall specific foes like Ho-Oh, Tornadus, and Incineroar.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Ogerpon-C struggles against opposing Steel-types such as Zamazenta-C and Zacian-C, which can easily threaten Ogerpon-C without taking any meaningful damage in return.</li> <li>Urshifu-R can act as a check to Ogerpon-C, as Choice Scarf variants can easily OHKO it with Tera Water Surging Strikes or break Sturdy with U-turn. Iron Hands counters Ogerpon-C, threatening to break Sturdy with Fake Out and threatening it with a KO afterward with Drain Punch.</li> <li>Ogerpon-C performs well on Calyrex-S and Terapagos teams; it can help Terapagos set up safely with Follow Me while also putting Koraidon in a difficult position, as Koraidon is KOed by Psychic from Calyrex-S if Koraidon doesn't Terastallize into a Fire-type, and it is KOed by Ivy Cudgel from Ogerpon-C if it does.</li> <li>Incineroar has good synergy with Ogerpon-C in supporting their partners, as its slow Parting Shot allows Ogerpon-C to switch in safely without breaking Sturdy, and it also threatens Zacian-C with Flare Biltz. Incineroar is also able to mitigate Iron Hands's effectiveness with Intimidate, Fake Out, and Parting Shot, reliably keeping it in check.</li> <li>Ogerpon-C is a good option on Lunala compositions, since it can provide Follow Me support to let Lunala set up Trick Room and allows for a fast mode without Trick Room on those teams. Miraidon also pairs well with Ogerpon-C, as Follow Me can redirect Ground-type attacks from Landorus and Ursaluna while also threatening them back with Grass-type attacks, allowing Miraidon to have more opportunities to use Electro Drift, which threatens Zamazenta-C and Urshifu-R.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 678488, "username": "poketitanterra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646416, "username": "CodeVG"}, {"user_id": 650323, "username": "Pengu"}, {"user_id": 589964, "username": "RauSakura"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Terapagos": {
    "sets": {
      "Bulky Setup Sweeper": {
        "description": "<h4>Set Details</h4> <ul> <li>With its good natural bulk, a good matchup against Calyrex-S and Lunala thanks to being immune to their Ghost-type attacks, and Tera Shell, Terapagos can find many opportunities to get on the field and start setting up with Calm Mind. Terapagos can also disrupt and hinder Pokemon and strategies featuring weather and Terrain, making it have a good matchup against Miraidon while also disturbing Koraidon, Groudon, and Kyogre.</li> <li>Earth Power gives Terapagos a reliable way to hit Zamazenta-C and Incineroar, and it's also a way to get around Wide Guard against Zamazenta-C and Lunala.</li> <li>Leftovers increases Terapagos's longevity further and can reactivate Tera Shell, especially when paired with Grassy Terrain from Rillaboom, while Covert Cloak can prevent Fake Out flinches and Special Attack drops from Miraidon, Chi-Yu and Raging Bolt's Snarl and Spirit Break from Grimmsnarl.</li> <li>The EV spread alongside a Bold nature helps Terapagos live a Close Combat from Life Orb Koraidon and +1 Body Press from Zamazenta-C after Terastallizing, and the Speed investment helps Terapagos outrun Calyrex-S after being paralyzed. The investment in HP optimizes the recovery of Leftovers and Grassy Terrain. The investment in Speed on the second spread allows Terapagos to outrun faster versions of Incineroar, and with a Modest nature, Terapagos can hit Zamazenta-C, Miraidon, and Incineroar much harder with Earth Power after Terastallizing with a Calm Mind boost, though it does lose the ability to not reliably survive Life Orb Koraidon's Close Combat after Terastallizing.</li> </ul> <h4>Teambuilding</h4> <ul> <li>Terapagos can struggle against teams featuring Zamazenta-C, as it resists base Terapago's Tera Starstorm, can use Wide Guard to protect its teammates from Terapagos-S's Tera Starstorm, and threatens super effective damage with Body Press. Koraidon also has the ability to completely remove or inflict massive damage onto Terapagos and force it to Terastallize in order to remove Koraidon's sun. Other Fighting-types such as Iron Hands and both Urshifu formes can also do well against Terapagos, hitting it hard with Drain Punch and Close Combat, respectively.</li> <li>Taunt and Encore from the likes of Flutter Mane, Tornadus, Whimsicott, and Calyrex-S can prevent Terapagos from setting up with Calm Mind and shut it down. Snarl from Miraidon, Raging Bolt, and Chi-Yu and Spirit Break from Grimmsnarl can repeatedly negate Calm Mind boosts, which can slow down non-Covert Cloak Terapagos. Grimmsnarl can also use Light Screen to reduce Terapagos's damage output even further. Spore from Amoonguss and Brute Bonnet can also slow down Terapagos's progress.</li> <li>Calm Mind Terapagos relies heavily on its teammates support to help it sweep because of Calm Mind's slow nature and Terapagos's generally low damage output without Calm Mind, and without its support Terapagos can fall behind when it comes to Speed and power.</li> <li>Calyrex-S can use Disable to stop Fighting-type moves from Koraidon and Zamazenta-C that threaten Terapagos and Wide Guard from the likes of Zamazenta-C and Lunala, making the aforementioned checks more managable for Terapagos. It can also use Encore to lock Pokemon into moves like Fake Out, Taunt, Encore, Wide Guard, and Grimmsnarl's Light Screen or a disabled move, rendering them useless.</li> <li>Incineroar and Rillaboom can provide Fake Out support alongside pivoting moves such as Parting Shot and U-turn; Incineroar also has Intimidate and Will-O-Wisp to weaken physical threats like Koraidon and Iron Hands, while Rillaboom sets Grassy Terrain, increasing Terapagos's longevity further.</li> <li>Amoonguss and Ogerpon-C provide redirection in Rage Powder and Follow Me, respectively, keeping Terapagos safe. Amoonguss is an annoyance for the likes of Zamazenta-C, Urshifu-R, and Iron Hands by resisting their Fighting-type STAB moves while also taking Zamazenta-C's Heavy Slam and Behemoth Bash comfortably. Amoonguss can also heal Terapagos and restore Tera Shell with Pollen Puff. Ogerpon-C can redirect Spore from the likes of Amoonguss and Brute Bonnet, which Terapagos would normally struggle against, while threatening Urshifu-R with Power Whip.</li> <li>Flutter Mane can use Thunder Wave to allow Terapagos to outspeed common threats such as Calyrex-S, Zamazenta-C, and Koraidon. Flutter Mane can also threaten Koraidon, Iron Hands, and both Urshifu formes with Moonblast. Taunt can prevent Wide Guard, foes' Taunt, and Encore from being used.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 625105, "username": "hduser"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646416, "username": "CodeVG"}, {"user_id": 650323, "username": "Pengu"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  }
}