{
  "Venusaur": {"sets": {"Sun Sweeper": {}}},
  "Sandslash": {"sets": {"Sand Wallbreaker": {}, "Physical Wall": {}}},
  "Sandslash-Alola": {"sets": {"Specially Defensive Spinner": {"description": "<p>The Speed EVs help Alolan Sandslash to get the jump on Umbreon and Vaporeon.</p>"}}},
  "Ninetales": {"sets": {"Sun Setter": {}}},
  "Vileplume": {
    "overview": "<p>Vileplume is one of the premier physical walls in the NU tier. Its Grass / Poison typing allows it to resist common Fighting- and Water-type attacks from Mienshao, Breloom, and Basculegion. Vileplume excels in punishing foes for making contact, dealing damage with Rocky Helmet and spreading status with Effect Spore. Despite being a wall, Vileplume isn't completely passive; with Giga Drain and Sludge Bomb, it can threaten serious damage on Vaporeon, Sylveon, and Avalugg, and Vileplume can potentially poison foes with the latter. Leech Seed and Strength Sap further Vileplume's longevity and weaken checks like Registeel and Alolan Muk. Special wallbreakers like Dragalge, Chandelure, and Porygon-Z can easily overwhelm Vileplume. Defensive Steel-types such as Copperajah and Klefki that resist both of Vileplume's STAB moves wall it well but risk being worn down by Leech Seed.</p>",
    "comments": "<h3>Other Options</h3> <p>Growth can be used over Leech Seed, allowing Vileplume to take advantage of bulkier Pokemon that can't threaten it like Alolan Muk and Brute Bonnet, but losing out on Leech Seed means Vileplume can't take on or chip away at Steel-type checks like Registeel and Klefki. Heavy-Duty Boots can be used to ignore entry hazards and to decrease passivity by not needing to heal as often, but the sheer punishment of Rocky Helmet or healing of Leftovers is usually preferred. This value is often not seen long-term, as Vileplume is often tasked with taking Knock Off repeatedly.</p> <h3>Checks and Counters</h3> <p><strong>Special Wallbreakers</strong>: Special wallbreakers like Chandelure, Munkidori, and Porygon-Z can all easily beat Vileplume down with their powerful super effective and even neutral attacks.</p> <p><strong>Tentacruel</strong>: Tentacruel's Liquid Ooze poses a unique threat to Vileplume, which cannot meaningfully damage it with Giga Drain or Sludge Bomb. Liquid Ooze prevents Leech Seed from healing Vileplume and threatens to OHKO Vileplume if it attempts to use Strength Sap.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<h4>Set Details</h4> <p>Giga Drain hits offensive Ground-types like Swampert and Flygon that resist Sludge Bomb. However, Stun Spore can be run instead for extra utility, allowing Vileplume to spread paralysis for teammates. Leech Seed allows Vileplume to make progress against special walls like Registeel, Cresselia, and Dragalge. Effect Spore and Rocky Helmet can punish U-turn pivots like Mienshao and Flygon and other contact attackers like Paldean Tauros-W and Basculegion. Leftovers can be used to keep it from being too passive and having to heal up as often. Tera Water is used to resist Fire- and Ice-type attacks in a pinch from Chandelure, Mienshao, and Inteleon; on the other hand, Tera Fairy removes its weaknesses, notably to Fire and Psychic, while improving its matchup versus Fighting-types like Mienshao, Gallade, and Infernape.</p> <p>Defensive Steel-types like Copperajah and Registeel wall Vileplume's STAB moves, so Fighting-types like Mienshao and Gallade and Fire-types like Chandelure and Infernape pair well with it. Vileplume also needs support from more specially defensive teammates to take on special wallbreakers like Dragalge, Chandelure, and Inteleon. Options like Registeel, Incineroar, and Milotic can resist these wallbreakers' strong special attacks. Psychic-types like Assault Vest Gallade and Cresselia and Dark-types like Brute Bonnet and Alolan Muk also support Vileplume, helping it against Psychic-type threats like Munkidori, Indeedee-F, and Gallade. Powerful Fire-types like Infernape, Incineroar, Chandelure, and Hisuian Typhlosion also pose a threat to Vileplume, so teammates like Vaporeon, Swampert, and Diancie help it handle these threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Arcanine": {"sets": {"Offensive": {}}},
  "Victreebel": {"sets": {"Sun Sweeper": {}}},
  "Tentacruel": {"sets": {"Utility": {}}},
  "Slowbro": {
    "overview": "<p>Slowbro is the most versatile physical wall in the tier, checking most of the tier with its great defensive typing, access to Regenerator, and deep movepool. Its typing alone lets it check some of NU's best physical wallbreakers and sweepers like Lycanroc-D, Mienshao, and Cloyster, using them as an opportunity to set up with Calm Mind or Future Sight. Slowbro is also a fantastic user of Tera, luring in Dark-types like Alolan Muk and Brute Bonnet before it uses Tera Poison or Fairy, which make them useless against it. Slowbro has a lot of move versatility, too: Future Sight enables Fighting-type teammates to break each other's checks; Psychic Noise cripples opposing walls and bulky setup sweepers; Thunder Wave punishes switch-ins; and Calm Mind pairs well with Slowbro's high physical bulk, making it hard to KO both physically and specially and boosting its own damage output in the process. Regenerator keeps Slowbro alive longer, letting it switch in to any physical move whenever it wants without worrying too much about residual damage. Slowbro also has a wide range of items it can use; Covert Cloak to ignore Scald's burn and Psychic Noise's heal blocking, Rocky Helmet to further punish physical wallbreakers and pivots, and Leftovers to keep it healthy. Pressuring Slowbro isn't easy, but some strong special wallbreakers like Chandelure, Thundurus, and Choice Specs Noivern are able to force it out, even after a boost or two. Entry hazards are also a thorn in Slowbro's side, detracting from the HP restored by Regenerator. Slowbro also doesn't enjoy status, as it is a common target of Toxic, which sometimes forces it to Terastallize, while being burned forces it to use Slack Off more often.</p>",
    "comments": "<h3>Other Options</h3> <p>Slowbro can take on a more standard defensive set, swapping out Calm Mind for Thunder Wave to punish anything that tries to stay in against it. Defensive Slowbro can also use Foul Play to punish setup sweepers like Flygon, Feraligatr, and Gallade, which it otherwise struggles to KO. Future Sight enables wallbreakers like Mienshao, Lycanroc-D, and Gallade to get an early- or mid-game KO on Dark- and Steel-types trying to absorb Future Sight or the Poison- and Ground-types switching into those wallbreakers, often creating a lot of progress. Flamethrower can be used instead of a Psychic-type attack to hit Steel- and Grass-types like Registeel, Klefki, and Tsareena, but it lacks power when unboosted, and Slowbro generally doesn't like facing Grass-types. Nasty Plot pairs well with Future Sight, boosting Slowbro's Special Attack more than Calm Mind does, but it isn't reliable because Slowbro enjoys the boost to its Special Defense that Calm Mind gives. Heavy-Duty Boots ensures Slowbro doesn't take any entry hazard damage while switching in and gives it an immunity to Toxic Spikes, letting it switch in more often and support its team with Scald. Colbur Berry lets Slowbro take any Dark-type attack, such as Lycanroc-D's Crunch, Incineroar's Knock Off, and Krookodile's Knock Off, giving it the opportunity to retaliate with Scald. Assault Vest lets Slowbro tank more hits from special wallbreakers like Noivern, Mew, and Venusaur, but it makes Slowbro lose out on Slack Off's recovery and rely too heavily on Regenerator. Eject Button turns Slowbro into a one-time pivot, safely letting frail teammates like Lycanroc-D, Mienshao, and Thundurus in for free. Lastly, Slowbro can opt for Tera Water to retain part of its original typing while getting rid of its weakness to Ghost- and Dark-type attacks and boosting Scald's damage, but it isn't often used due to the defensive merits of Tera Poison and Fairy.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Alolan Muk, Assault Vest Brute Bonnet, and Calm Mind Sylveon are able to keep up with Slowbro's pace to beat it in a matchup, often forcing it to Terastallize. Alolan Muk, especially, matches up well into Slowbro, removing its item with Knock Off and threatening it with poison if it has not used Tera Poison.</p> <p><strong>Special Wallbreakers</strong>: Strong special wallbreakers such as Chandelure and Choice Specs variants of Noivern and Sylveon can all force Slowbro out due to their unboosted power, but if it has already set up with Calm Mind, then they aren't guaranteed to KO. Other sweepers like Nasty Plot Lucario and Scope Lens Kingdra can bait in Slowbro, but they can be exploited by Slowbro's teammates as well.</p> <p><strong>Dark-types</strong>: Alolan Muk, Krookodile, and Incineroar all pressure Slowbro with their powerful Dark-type attacks. However, they risk getting hit by Scald, and the former two don't want to get burned. Users of Tera Dark like Feraligatr and Lycanroc-D are able to KO Slowbro after a boost with super effective coverage, while Tera Dark Vaporeon is able to wall it thanks to Water Absorb and its new Psychic-type immunity.</p> <p><strong>Electric-types</strong>: Thundurus, Oricorio-E, and Raikou can all set up against Slowbro due to their threatening Electric-type attacks; Oricorio-E is also able to use Taunt to stop Slowbro's setup attempts, but it fears Psychic Noise stopping it from using Roost. Choice Specs users like Magnezone and Toxtricity also threaten an OHKO, but they can lose if Slowbro has set up and Terastallized.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<h4>Set Details</h4> <p>Calm Mind pairs well with Slowbro's great physical bulk, making it hard to KO after a boost. Psychic Noise is the STAB move of choice thanks to its matchup against bulky setup sweepers like Reuniclus, Mew, and especially opposing Slowbro without Covert Cloak, letting it win the matchup every time. Psychic Noise also helps against Unaware Quagsire, which can stall out Slowbro. Psyshock is a stronger option that lets Slowbro sweep easier, making it more of a threat early- and mid-game; Psyshock is also able to beat Tera Poison Slowbro reliably, even if the opposing Slowbro has Psychic Noise. Covert Cloak is Slowbro's go-to item because it gives it a winning matchup against opposing Slowbro, ignoring Scald's burn and Psychic Noise's heal blocking. Rocky Helmet punishes physical attackers and pivots such as Mienshao, Lycanroc-D, and Talonflame, forcing damage on them as Slowbro switches in. Leftovers lessens the need to use Slack Off. Tera Poison retains Slowbro's Fighting-type resistance, removes its weakness to Knock Off, and gives it an immunity to Toxic while simultaneously helping it in the matchup against Alolan Muk, letting Slowbro use it as setup fodder; however, Tera Poison comes with the downside of losing the matchup to other Psychic-types such as Mew, Reuniclus, and most notably other Slowbro. Tera Fairy also retains Slowbro's Fighting-type resistance and allows it to resist Dark-type attacks, but it opens up space to be KOed by Alolan Muk, Gunk Shot Krookodile, and Meteor Mash Lucario.</p> <p>Thanks to its great defensive typing paired with its physical bulk, Slowbro pairs well with Alolan Muk. Slowbro switches into strong physical wallbreakers that target Alolan Muk such as Krookodile, Mienshao, and Flygon while Alolan Muk can switch into special wallbreakers like Chandelure, Thundurus, and Calm Mind Reuniclus. Slowbro also enjoys having Mienshao as a partner to form a Regenerator core, as Slowbro helps deal with revenge killers like Choice Scarf Infernape and Talonflame as well as Poison-types like Vileplume that punish Mienshao. In return, Mienshao can KO Dark-type Pokemon like Incineroar, Brute Bonnet, and Krookodile that try to KO Slowbro. Variants of Slowbro not running Heavy-Duty Boots appreciate entry hazard removal from the likes of Tsareena, Brambleghast, and Talonflame or a grounded Poison-type like Alolan Muk or Vileplume. Ground-types that can switch into Electric-type attacks like Krookodile, Flygon, and Rhyperior aid Slowbro, giving it the opportunity to set up later in battle. Other physical wallbreakers like Lycanroc-D, Gallade, and Incineroar help beat bulky setup sweepers like Mew, Reuniclus, and opposing Slowbro, which Slowbro has a hard time fighting. Slowbro is able to take advantage of passive Pokemon like Talonflame, Klefki, and Registeel, making it easier for Pokemon like Mienshao, Choice Specs Dragalge, and Porygon-Z to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 583607, "username": "PowerOfMemes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Slowbro-Galar": {
    "overview": "<p>Galarian Slowbro establishes itself as a solid physical wall in NU thanks to Regenerator, letting it come in and check threats repeatedly without having to waste a turn healing. Its typing allows Galarian Slowbro to be immune to poison, allowing it to avoid Toxic from Umbreon, while letting it consistently check Fighting-types like Mienshao, Toxicroak, and Breloom. Galarian Slowbro's deep utility movepool lets it support its team by whittling away at walls like Incineroar and Diancie with Toxic or slowing down threats like Munkidori and Inteleon with Thunder Wave. It also has access to Calm Mind, which allows Galarian Slowbro to take advantage of common defensive walls like Talonflame and Vileplume by making it harder to KO and switch into as well. On the other hand, it can choose to be more immediately threatening with Assault Vest, as it allows Galarian Slowbro to make use of its vast coverage, and it helps act as a blanket check to special wallbreakers such as Munkidori, Dragalge, and Porygon-Z. However, Galarian Slowbro's typing makes it weak to common Ground- and Dark-types like Flygon, Incineroar, and Alolan Muk. Galarian Slowbro is also susceptible to being KOed by repeated special hits from wallbreakers like Inteleon, Toxtricity, and Porygon-Z due to its below average Special Defense. While Galarian Slowbro checks Fighting-types like Toxicroak and Breloom quite well, other physical wallbreakers with neutral STAB moves like Heracross, Paldean Tauros-W, and Basculegion can easily overpower it or force it to Terastallize.</p>",
    "comments": "<h3>Other Options</h3> <p>Iron Defense + Body Press can be used to turn the tables against Dark-types like Incineroar, Umbreon, and Alolan Muk, but Galarian Slowbro is still easily forced out by special wallbreakers. Nasty Plot can be used over Calm Mind, turning it into a terrifying sweeper, but unlike Calm Mind, it forces Galarian Slowbro to switch out when it's up against special wallbreakers like Dragalge and Munkidori. Trick Room can be used on Galarian Slowbro to take advantage of it's low Speed and decent Special Attack, but without a boost, it struggles to pick up KOs. Colbur Berry lets Galarian Slowbro tank any Dark-type attacks such as Incineroar and Alolan Muk's Knock Off and Toxicroak's Dark Pulse so that it can respond with an attack afterwards, but the utility of its other items usually outweighs the benefit to using it. Eject Button allows Galarian Slowbro to become a one-time pivot, letting it safely bring in setup sweepers like Swords Dance Incineroar, Dragon Dance Flygon, and Nasty Plot Toxicroak for free. Galarian Slowbro could also opt to go itemless, as it can then wall Brambleghast and reduce Knock Off damage from Incineroar and Mienshao.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Incineroar and Bombirdier can put a lot of pressure on Galarian Slowbro with their STAB attacks, but they have to be worried about getting poisoned by Sludge Bomb when switching in. Alolan Muk is especially noteworthy for being able to switch into its STAB attacks easily without worry of being poisoned, and it can respond with Knock Off.</p> <p><strong>Ground-types</strong>: Flygon, Swampert, and Gligar can tank its Poison-type attacks and threaten Galarian Slowbro with their STAB Earthquake. However, the former two have to fear getting poisoned, and they all have to be cautious about switching into Ice Beam, Grass Knot, or Surf.</p> <p><strong>Ghost-types</strong>: Chandelure, Hisuian Typhlosion, and Brambleghast can easily destroy Galarian Slowbro with their STAB attacks. However, the former two have to fear about switching into Surf, while Brambleghast has to worry about Sludge Bomb damage and switching into a Flamethrower.</p> <p><strong>Special Wallbreakers</strong>: Special wallbreakers like Choice Specs Meloetta and Inteleon can easily break through Galarian Slowbro and force it to switch out. Calm Mind users like Cresselia and Chandelure can put a lot of pressure on Galarian Slowbro too, but they have to be mindful of getting poisoned and switching into Psyshock and Surf, respectively.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<h4>Set Details</h4> <p>Sludge Bomb is Galarian Slowbro's preferred STAB move, as it hits Fairy-types like Sylveon and Florges while also threatening foes like Incineroar, Flygon, and Swampert with poison. However, Psyshock can be used over Sludge Bomb, allowing Galarian Slowbro to deal with Poison-types and special walls like Toxicroak, Tentacruel, and Diancie more easily, and it also helps overwhelm opposing special setup Pokemon like Sylveon and Oricorio-E. Flamethrower allows Galarian Slowbro to hit Steel-types switching in on Sludge Bomb like Copperajah, Bronzong, and Tera Steel Sylveon. Alternatively, Surf allows it to target Incineroar trying to blank an incoming Psyshock. Rocky Helmet punishes physical wallbreakers like Mienshao, Cinccino, and Breloom; it also pairs well with Regenerator, as it allows Galarian Slowbro to consistently switch in to rack up chip damage. Heavy-Duty Boots lets Galarian Slowbro avoid damage from entry hazards, meaning its Regenerator can't be negated, while Leftovers gives it passive recovery, minimizing the need to heal off damage with Slack Off. Tera Water lets it handle Water-, Ground-, and Fire-types like Basculegion, Flygon, and Incineroar; however, Galarian Slowbro loses its matchup against Grass-types like Tsareena and Breloom. Tera Fairy retains the Fighting-type resistance and allows it to resist Dark-type attacks from Incineroar and Umbreon but makes it weak to foes like Copperajah and Toxicroak.</p> <p>Galarian Slowbro pairs best with bulky Water-types like Vaporeon, Swampert, and Milotic to handle Ground-types such as Flygon and Swampert; in return, Galarian Slowbro checks Grass-types like Tsareena, Breloom, and Vileplume. Dark-types like Incineroar, Bombirdier, and Umbreon synergize well with Galarian Slowbro by beating Ghost-types like Chandelure and Brambleghast; in return, Galarian Slowbro handles Fighting-types like Mienshao, Toxicroak, and Breloom. Galarian Slowbro appreciates Fighting-type teammates like Toxicroak, Breloom, and Paldean Tauros-W, as they can check Dark-types like Incineroar, Umbreon, and Alolan Muk, which threaten it. Physical wallbreakers like Flygon, Mienshao, and Infernape appreciate Galarian Slowbro's positive matchup against physically defensive walls like Talonflame, Vileplume, and Avalugg. Galarian Slowbro can form a defensive backbone with special walls like Copperajah, Bronzong, and Diancie, as they can check special wallbreakers like Choice Specs Meloetta and Toxtricity, while Galarian Slowbro handles the physical wallbreakers like Breloom and Toxicroak.</p>"
      },
      "Assault Vest": {
        "description": "<h4>Set Details</h4> <p>Shell Side Arm is preferred over Sludge Bomb, as it will do more damage to special walls. However, Sludge Bomb can be used for its higher poison chance. Similarly, Psyshock hits special walls harder, but Psychic can be used for its raw power. Flamethrower allows it to hit Steel-types like Copperajah, Bronzong, and Klefki, while Earthquake targets Alolan Muk and Tentacruel with a trade-off of not hitting Bronzong and Orthworm. Ice Beam lets Galarian Slowbro hit Ground-types like Flygon and Gligar, while Surf targets Fire- and Rock-types like Chandelure, Talonflame, and Diancie. Grass Knot can be used as well to hit Water- and Ground-types like Swampert, Gastrodon, and Quagsire more effectively. The given Speed EVs outpace Quagsire. An alternative bulkier EV spread of 252 HP / 128 Def / 4 SpA / 80 SpD / 44 Spe can be run with a Relaxed nature to live a +2 Wave Crash from Paldean Tauros-W, ensure that Shell Side Arm is a special attack, but Galarian Slowbro can fail to put its coverage to great use at times if it doesn't invest heavily in its offenses. Tera Water lets Galarian Slowbro handle Fire- and Water-types like Choice Specs Chandelure and Inteleon. However, Tera Fairy retains the Fighting-type resistance while letting it handle Dark-types like Incineroar and Umbreon.</p> <p>Bulky Water- and Grass-types like Vaporeon, Milotic, and Tsareena are great partners for Galarian Slowbro, as they can check Ground-types like Flygon and Swampert. Dark-types like Incineroar, Umbreon, and Wo-Chien appreciate Galarian Slowbro for checking Fighting-types like Mienshao, Toxicroak, and Breloom. In return, they can handle the Ghost-types like Chandelure, Basculegion, and Hisuian Typhlosion. Galarian Slowbro's typing leaves it weak to common Knock Off users like Incineroar and Alolan Muk. Thus, it pairs well with Pokemon like Bellibolt, Swampert, and Toxicroak, as they can check the aforementioned Knock Off users. Defensive walls like Bellibolt, Sylveon, and Tsareena are great partners for Galarian Slowbro, as they can check physical wallbreakers like Basculegion and Infernape. Physical wallbreakers like Life Orb Mienshao and Choice Band users such as Paldean Tauros-W and Flygon are great partners to form a wallbreaking core with Galarian Slowbro. Special walls like Bronzong, Milotic, and Incineroar can check special wallbreakers like Meloetta, Inteleon, and Chandelure, since Galarian Slowbro can't always beat them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Muk": {
    "outdated": true,
    "sets": {
      "Utility": {
        "description": "<p>Muk serves as a great tank and Haze user in SV NU, checking various special attackers such as Vivillon and Zoroark and threatening them with Poison Jab and Drain Punch respectively. Poison Touch and Poison Jab let Muk effortlessly spread poison, even on Pokemon immune to Toxic Spikes such as Drifblim and Eelektross. Drain Punch hits Steel-types such as Copperajah and Terastallized Appletun that would otherwise wall Muk. Haze stops setup sweepers such as Vivillon and Calm Mind Vaporeon from setting up. Toxic Spikes lets Muk take advantage of free turns and cripple the opposing team with poison. Tera Dark allows Muk to beat threats like Bruxish and Zoroark after baiting them into their powerful Dark- and Psychic-type attacks and retaliate back while also being able to use Haze against boosted Stored Power users like Veluza and Farigiraf. Alternatively, Tera Water provides an overall better defensive typing, more specifically easing the matchup against offensive Water-types like Calm Mind Vaporeon and Choice Specs Clawitzer. Muk struggles with Pokemon such as Sandaconda, which does not fear its poison due to Shed Skin and can threaten it back with Earthquake. As a result, Muk appreciates teammates such as Rotom, Eelektross, and Cacturne, which can switch into Sandaconda and force it out. Muk is physically frail, making physical walls such as Sandaconda and Drifblim great partners, with the latter also getting rid of entry hazards, which chip Muk down throughout a game.</p>"
      },
      "Curse": {
        "description": "<p>Curse Muk checks specially offensive threats while having the additional benefit of acting as a wincon. Curse boosts Muk's above-average Attack and below-average Defense, complementing its good Special Defense. Drain Punch not only hits special attackers like Zoroark, Rotom-F, and Dudunsparce but also gives Muk longevity, solidifiying its sweeping potential. Shadow Sneak provides Muk with a form of priority, allowing it to revenge kill Ghost-types like Haunter and Rotom or faster threats like Bruxish and Veluza. Poison Touch in combination with Poison Jab gives Muk a 51% chance to poison foes, wearing them down in the process. Sticky Hold prevents Muk from being crippled by Trick from Rotom or Knock Off from Passimian. Tera Water serves as a strong defensive typing, while Tera Dark can be used to help Muk combat Pokemon like Bruxish and Farigiraf. Lurantis pairs well with this particular Muk set, removing Pokemon like Sandaconda, Haze Vaporeon, and Taunt Qwilfish. Zoroark and Passimian can scare away Psychic-types like Bruxish, Indeedee-F, and Medicham that hinder Muk's ability to set up and sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}, {"user_id": 298730, "username": "poh"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Muk-Alola": {
    "overview": "<p>Alolan Muk's useful defensive typing and high Special Defense allow it to be one of the top threats in the metagame. Common special attackers like Chandelure, Munkidori, and Indeedee are stopped in their tracks and forced out by it. On top of this, Alolan Muk isn't useless against bulkier Pokemon either; thanks to its access to Knock Off in combination with Poison Touch, it can slowly beat Sylveon, Talonflame, and Gastrodon. Poison Touch along with Poison Jab allow it to spread poison nearly uninhibited, letting it chip away at opposing teams quite easily. However, Alolan Muk is quite frail physically, often being forced out by pivots like Mienshao and Flygon and losing momentum. It is also weak to fairly common Ground-types like Flygon and Swampert, which then get free turns to set entry hazards or boost their offensive stats. Also, its reliance on unreliable and passive forms of recovery can let it be overwhelmed and taken advantage of.</p>",
    "comments": "<h3>Other Options</h3> <p>A more offensive Alolan Muk with an Assault Vest and a moveset of Knock Off / Poison Jab / Drain Punch / and one of Ice Punch, Rock Slide, Giga Drain, or Shadow Sneak can be used to take special hits while also pressuring foes, but, in doing so, it sacrifices a lot of longevity. Alolan Muk could also run Clear Smog to counteract setup sweepers trying to take advantage of its passivity.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-type Pokemon like Swampert, Flygon, and Mudsdale easily deal great damage to Alolan Muk with a super effective Earthquake, and they can capitalize on a forced switch by setting Stealth Rock or boosting.</p> <p><strong>Fighting-types</strong>: Fighting-types like Mienshao, Paldean Tauros-W, and Heracross, while not having a way to hit Alolan Muk super effectively, overwhelm it, taking advantage of its low Defense with their powerful Fighting-type attacks.</p> <p><strong>Poison-types</strong>: Poison-types like Vileplume and Toxicroak can wall Alolan Muk due to their immunity to poison. On top of that, Vileplume is able to set up Leech Seed or use Growth, while Toxicroak freely sets up with Swords Dance and can do this repeatedly with Leftovers and Drain Punch.</p> <p><strong>Physical Wallbreakers</strong>: Physical wallbreakers like Iron Thorns and Heracross easily overwhelm Alolan Muk with their Quark Drive- and Guts-boosted attacks due to its low Defense.</p> <p><strong>Setup Pokemon</strong>: With how passive Alolan Muk can be, especially with Rest, it can be setup fodder for Pokemon like Drednaw, Incineroar, and Flygon.</p>",
    "sets": {
      "Special Wall": {
        "description": "<h4>Set Details</h4> <p>Poison Jab is preferred for damage, but Poison Fang can be used to spread poison more easily. Rest + Sleep Talk offers recovery but is sometimes unreliable; alternatively, Drain Punch + Protect allows Alolan Muk to regain health while threatening Steel-types like Copperajah and Registeel. Tera Water can be used to better take Fire-type attacks from Hisuian Typhlosion and Chandelure, and it gifts Alolan Muk a strong defensive Tera type that can take on tons of Pokemon well. However, Tera Dragon helps Alolan Muk check a wide array of special attackers like Inteleon, Oricorio-E, and Rotom-H better than Tera Water does. Both Tera Water and Dragon help Alolan Muk when facing Ground-types, but they tend to leave it more susceptible to other physical wallbreakers like Tsareena and Brambleghast.</p> <p>Alolan Muk fails against physical attackers, especially Ground- and Fighting-types such as Flygon, Breloom, and Mienshao. So, Pokemon like Vileplume, Talonflame, and Swampert help to form a strong defensive core for the team. After using Knock Off, Alolan Muk is almost helpless against Steel-types like Registeel and Klefki as they set entry hazards or boost; its Drain Punch is just too weak. To counter this, teammates that can handle these foes such as Infernape, Chandelure, and Flygon pair well with Alolan Muk. Since it can deal with Psychic- and Ghost-types easily, Pokemon such as Mienshao, Brambleghast, and Munkidori greatly appreciate Alolan Muk's presence. Because of how easily Alolan Muk can remove items, hazard setters like Klefki, Swampert, and Quagsire have great synergy with it. On the flip side, with how many times Alolan Muk is forced to switch into an attack, hazards become an issue for it, jeopardizing its ability to take on Chandelure and Munkidori. To clear these hazards, Pokemon like Talonflame, Avalugg, and Tsareena pair perfectly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Cloyster": {
    "overview": "<p>Cloyster is one of the most powerful late-game sweepers in the tier. Its high Defense stat allows it to take a hit before boosting with Shell Smash, and once boosted, it is incredibly difficult to wall or outspeed. Physical attackers, particularly Choice Scarf users like Flygon and Basculegion, provide ample opportunity for Cloyster to set up. Skill Link only increases Cloyster's offensive capability, making Icicle Spear and Rock Blast more consistent and dangerous. Cloyster also has a wide variety of natural coverage options with Icicle Spear, Rock Blast, and Drill Run and often carries Tera Blast to effectively choose its counters. Heavy-Duty Boots, Focus Sash, and entry hazard control can all help give it clear opportunities to boost. However, its low Special Defense, relatively low Speed, and weakness to Stealth Rock can make setting up difficult. Revenge killing Cloyster can be difficult after a Shell Smash boost, as +2 Jolly Cloyster outspeeds all common Choice Scarf users, but priority moves, such as Vacuum Wave or Sucker Punch, can take it out. Checks to Cloyster depend largely on the coverage and Tera type it uses. Bulky Water-types, such as Slowbro, Vaporeon, and Unaware Quagsire, tend to do well but can be blown up by Tera Blast Electric and Grass. Steel-types like Registeel or Magnezone can resist many of Cloyster's attacks but struggle with Drill Run and Tera Ground.</p>",
    "comments": "<h3>Other Options</h3> <p>Cloyster can choose to run Liquidation as an alternate STAB move option, and it can also choose to run Ice Shard, primarily on Adamant sets, to hit the few Pokemon that outspeed and threaten it. Hydro Pump is niche but lets Cloyster always beat Avalugg after a Shell Smash boost. Tera Ghost is another option, particularly on slower Adamant sets, to gain an immunity against Fighting-type moves like Close Combat from revenge killers like Choice Scarf Mienshao. Tera Steel is potentially useful to resist Accelerock and give Cloyster additional resistances as it sets up.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Bulky Water-types can be extremely difficult for Cloyster to break without the use of Tera Blast Grass or Electric. Slowbro and Vaporeon both comfortably take hits from Cloyster, while Unaware Quagsire counters its gameplan entirely. Vileplume also baits Icicle Spear and can use Tera Water to resist it.</p> <p><strong>Steel-types</strong>: Without Drill Run or Tera Blast Ground, Cloyster struggles to break through Steel-types. Registeel and Magnezone, particularly if they have the opportunity to use Iron Defense, are serious checks to a potential sweep. Klefki also threatens to cripple Cloyster with priority Thunder Wave. Thundurus and Tsareena both have the potential to bait Icicle Spear, use Tera Steel to survive a hit, and KO Cloyster in return.</p> <p><strong>Revenge Killers</strong>: +2 Jolly Cloyster outspeeds every Choice Scarf user in the tier, so priority moves are the main source of revenge killing against it. Lycanroc-D's Accelerock, Brute Bonnet's Sucker Punch, and Mew and Lucario's Vacuum Wave can threaten to end a Cloyster sweep. Boosted Adamant Cloyster can be outsped by several Choice Scarf users, notably Munkidori, Mienshao, and Flygon. Chlorophyll Venusaur can also revenge kill a boosted Cloyster, but it requires a Timid nature to outspeed Jolly Cloyster.</p>",
    "sets": {
      "Shell Smash": {
        "description": "<h4>Set Details</h4> <p>Rock Blast is a useful coverage move that OHKOes Talonflame without a boost and 2HKOes Avalugg after a boost. Tera Blast gives Cloyster the coverage to break through the Water-types that would otherwise counter it entirely. At +2, Tera Blast Grass and Electric can OHKO Vaporeon and 2HKO Slowbro. Tera Blast Grass also notably has a chance to OHKO Unaware Quagsire. Drill Run provides super effective damage against the Steel-types that would otherwise wall Cloyster, and at +2, it OHKOes Magnezone and 2HKOes Registeel. Tera Electric and Ground also provide an immunity to the threat of Prankster Thunder Wave. Focus Sash guarantees an opportunity to use Shell Smash but requires support to keep entry hazards off the field. White Herb restores Cloyster's defenses after a Shell Smash, bolstering it against revenge kills. Heavy-Duty Boots protects Cloyster from its Stealth Rock weakness and preserves health to let it take a hit before boosting. Cloyster requires a Jolly nature to outspeed common Choice Scarf users, notably outspeeding Mienshao and Munkidori. An Adamant nature can hit a few additional breakpoints, giving Cloyster a chance to OHKO Registeel with +2 Tera Ground-boosted Drill Run and guaranteeing it an OHKO on specially bulky Diancie with +2 Tera Blast Grass.</p> <p>Cloyster works best on hyper offense teams that provide opportunities to sweep and wear down its checks. It benefits heavily from teammates that can chip or seriously damage the Water- and Steel-types that can wall it. Options like Tsareena and Brambleghast can threaten defensive Water-types like Slowbro and Quagsire while keeping entry hazards off the field, preserving Cloyster's health and Focus Sash. Ground- and Fighting-types like Krookodile, Mienshao, and Gallade can put a serious dent in Steel-types, and Gallade and Krookodile in particular threaten Slowbro with Leaf Blade and Knock Off, respectively. Hazard setters like Klefki, Flygon, and Mew can also support Cloyster's sweeping, wearing down foes that it cannot OHKO. Galvantula serves a similar role, setting up Sticky Web to allow Cloyster to run an Adamant nature and outrun Choice Scarf Infernape, Mienshao, and Munkidori after a boost. Other late-game cleaners like Mienshao or a Shell Smash Torterra benefit from Cloyster's damage output and can storm through teams whose physical walls have already taken multiple hits.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Electrode-Hisui": {"sets": {"Offensive Pivot": {"description": "<p>20 Defense EVs allow Electrode-Hisui to avoid a 2HKO from Choice Scarf Bruxish Wave Crash. Fairy Tera Blast hits Dragon-types like Goodra and Tatsugiri. The given Speed outruns Jolteon.</p>"}}},
  "Hitmonlee": {"sets": {"Terrain Sweeper": {}}},
  "Weezing": {"sets": {"Physical Wall": {}}},
  "Tauros": {
    "outdated": true,
    "sets": {
      "Wallbreaker": {
        "description": "<p>Tauros is a great wallbreaker and late-game sweeper thanks to its combination of Sheer Force + Life Orb attacks, good coverage, and solid Speed tier. Rock Slide hits Flying-types like Oricorio-F, Articuno, and Scyther. While both Earthquake and Close Combat hit Steel-types that otherwise come in safely, the former gives Tauros an advantageous matchup against Poison-types such as Qwilfish and Muk, whereas the latter hits Steel-types harder while also nuking Ice-types like Abomasnow and Glaceon. Tera Ghost makes Tauros immune to Fighting-type attacks from Medicham and Hisuian Sneasel, and Tera Blast lets it hit Psychic- and Ghost-types in Hattrem and Rotom for greater damage than its other attacks. Tera Fairy is another option that helps against Fighting-types, and Tera Blast Fairy lets it beat Sableye and Spiritomb, which can otherwise wall it. Assurance can be used instead in combination with Stealth Rock from a teammate to OHKO Rotom on the switch. Tera Normal with Body Slam can also be used to take care of checks like Sandaconda, which gets 2HKOed after Stealth Rock.</p> <p>Qwilfish and Froslass are good partners for Tauros, as it usually can’t KO its checks off the bat, so Spikes support is greatly appreciated—along with having a switch-in to Fighting-type attacks. Jolteon and Rotom are also amazing partners, as they can, together with Tauros, overwhelm Sandaconda with their Tera Blast Ice or Trick, respectively. A pivot such as Mesprit or Assault Vest Eelektross can use U-turn to draw in switch-ins like Appletun, Blissey, and Bombirdier, which Tauros can take advantage of.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Tauros-Paldea-Combat": {
    "outdated": true,
    "sets": {
      "Bulk Up": {
        "description": "<p>Paldean Tauros is a terrific Bulk Up sweeper with its great Speed and wide offensive movepool. After using Trailblaze, Paldean Tauros outspeeds Choice Scarf users like Passimian and Rotom. Stone Edge is great coverage for common Fighting-resistant foes like Haunter, Scyther, and Drifblim, while Tera Electric lets Paldean Tauros hit the aforementioned Flying-types and Vaporeon with Tera Blast and offers an immunity to paralysis. Tera Rock Stone Edge and Tera Electric Tera Blast both allow Paldean Tauros to OHKO Drifblim. Leftovers aids its general longevity, while Lum Berry allows it to set up safely once against status users like Rotom and Drifblim. Offensive Pokemon like Choice Scarf Rotom and Zoroark appreciate Paldean Tauros forcing out foes like Umbreon and Chansey; in return, they can check Ghost-types like opposing Rotom and Drifblim. Defensive teammates like Vaporeon and Chansey can sponge special attacks and either help its longevity with Wish or its offensive capabilities with Thunder Wave.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Tauros-Paldea-Blaze": {"sets": {"Bulk Up": {}, "Choice Item": {}}},
  "Tauros-Paldea-Aqua": {"sets": {"Bulk Up": {}, "Choice Item": {}}},
  "Vaporeon": {"sets": {"Defensive": {}}},
  "Articuno-Galar": {"sets": {"Calm Mind": {}, "Stored Power Sweeper": {}, "Future Sight Pivot": {}}},
  "Typhlosion": {"sets": {"Choice Item": {}}},
  "Typhlosion-Hisui": {"sets": {"All-out Attacker": {}, "Choice Item": {}}},
  "Feraligatr": {"sets": {"Setup Sweeper": {"description": "<p>Swords Dance + Aqua Jet can be used on Sticky Web teams.</p>"}}},
  "Quagsire": {"sets": {"Defensive": {}}},
  "Espeon": {"sets": {"Choice Specs": {}, "Rain Support": {}}},
  "Umbreon": {"sets": {"Utility": {}}},
  "Gligar": {"sets": {"Physical Wall": {}}},
  "Qwilfish-Hisui": {
    "sets": {
      "Defensive": {
        "description": "<p>With access to a deep utility movepool, great defensive abilities, and Eviolite, Hisuian Qwilfish can take on many offensive threats. Intimidate is useful to weaken physical attackers, allowing it to tank strong neutral attacks from the likes of Ursaring and Tauros. Hisuian Qwilfish can also make use of Poison Point to punish contact moves, even generally commitment-free moves like Scyther's and Mesprit's U-turn. Barb Barrage is preferred over stronger options like Poison Jab and Gunk Shot thanks to its high chance to poison, as well as dealing double damage to a poisoned target. Taunt dismantles setup sweepers such as Eelektross while also preventing Defog. Haze is an option over Taunt to prevent setup sweepers like Tera Steel Mesprit and Eelektross from exploiting Hisuian Qwilfish's passivity. Toxic can also be run over Taunt to take advantage of Defog users removing your Spikes and cripple opposing walls like Appletun, Articuno, and Eelektross. Crunch is an extra STAB option that beats Ghost- and Psychic-types like Froslass, Rotom, and Bruxish. Alternatively, Crunch punishes teams that have no grounded Poison-type or entry hazard control. Tera Grass enables Hisuian Qwilfish to set more Spikes against Sandaconda and gives Hisuian Qwilfish a resistance to Volt Switch, allowing it to more easily beat Rotom and Eelektross. Alternatively, Tera Ghost lets it spinblock Cryogonal and Avalugg. 56 Speed EVs allow Hisuian Qwilfish to outspeed maximum Speed Cacturne as well as neutral-nature Abomasnow and Farigiraf; Jolly allows Hisuian Qwilfish to always outspeed the latter two.</p> <p>Wallbreakers like Tauros and Mesprit benefit from Spikes weakening checks like Sandaconda and Hisuian Qwilfish that are somewhat easy to put in 2HKO range. To maximize the effect of Spikes and keep them up as long as possible, Hisuian Qwilfish appreciates help from Rotom, Cryogonal, and Articuno, which all put pressure onto Defog users like Braviary and Lurantis. Without Terastallizing, Hisuian Qwilfish folds to Sandaconda and other strong physical attackers that can switch into it like Toxicroak, Hisuian Sneasel, and both Tauros formes. To help solve this issue, Pokemon such as your own Sandaconda, Hattrem, and Drifblim can pivot into their attacks and threaten them with paralysis or burn. Hisuian Qwilfish is hindered by losing its Eviolite via Knock Off or Trick; pair it with Pokemon that can afford to lose their item such as Sandaconda, Sableye, and Sticky Hold Muk.</p>"
      },
      "Swords Dance": {
        "description": "<p>Hisuian Qwilfish is a potent rain sweeper. It has neutral coverage for every foe in NU bar Toxicroak and outspeeds every relevant revenge killer under rain. Even outside of rain, it's still a good option for late-game sweeping because its coverage and Eviolite-boosted bulk give it good leverage against most countermeasures the opponent could have. The major selling point to this set is Liquidation, as it always OHKOes Sandaconda after Hisuian Qwilfish uses Swords Dance and Terastallizes.</p> <p>If you're using Hisuian Qwilfish on a rain team, pairing it with rain setters like Sableye, Electrode, and Whiscash is a must. Additionally, you'll want Floatzel, which is great at weakening potential checks like Tera Water Sandaconda, Qwilfish, and Avalugg. Golduck is also a staple of NU rain teams and benefits from Hisuian Qwilfish weakening Toxicroak. If you're not using a rain team, simply pair Hisuian Qwilfish with wallbreakers like Medicham, Hisuian Sneasel, and Bruxish. Spikes support from options like Froslass and Cacturne helps too to weaken checks like Terastallized Sandaconda and Toxicroak.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Heracross": {"sets": {"Wallbreaker": {}, "Choice Scarf": {}, "Spikes Setter": {}}},
  "Sneasel": {"sets": {"Swords Dance": {}}},
  "Kingdra": {"sets": {"Rain Sweeper": {}}},
  "Smeargle": {"sets": {"Lead": {}}},
  "Raikou": {"sets": {"Calm Mind": {}}},
  "Sceptile": {"sets": {"Terrain Sweeper": {}}},
  "Swampert": {
    "overview": "<p>Swampert is an excellent wall. Its great defensive typing gives it resistances and immunities to Fire-, Poison-, and Electric-type attacks from the likes of Infernape, Alolan Muk, and Iron Thorns, and it threatens them with Earthquake. While there is some competition for the Water-type slot on teams, Swampert is unique in its ability to simultaneously threaten Electric-types and pivot out with Flip Turn, often slowly enough to bring its teammate in completely safely. On top of this, Swampert also has access to Knock Off, which is valuable utility to cripple item-reliant Pokemon like Talonflame, Avalugg, and Registeel, and Roar, which allows Swampert to challenge setup sweepers like Cresselia and Oricorio-E. However, its limited recovery options make Swampert vulnerable to being worn down over the course of a battle, meaning it won't be able to check these aforementioned setup sweepers long-term. Swampert's 4x weakness to Grass-type attacks also hampers it, as it struggles against common Grass-types like Tsareena, Breloom, and Brambleghast. On top of this, many Pokemon like Chandelure, Gallade, and Iron Thorns carry some way to surprise Swampert with Grass-type coverage, whether that be Energy Ball, Leaf Blade, or Tera Blast Grass.</p>",
    "comments": "<h3>Other Options</h3> <p>More offensive sets like Choice Band or bulkier ones that utilize Assault Vest can work, but it's difficult to fit another entry hazard setter that doesn't add on to Swampert's Grass-type weakness. Swampert can run special attacks like Hydro Pump, Earth Power, and Ice Beam; however, if Swampert goes this route, it struggles to fit these moves and its great utility options on the same set, as it wants all of Knock Off, pivoting, hazards, STAB moves, and powerful coverage.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types and Grass-type coverage</strong>: Foes like Vileplume and Breloom can be immensely threatening. Grass-types with Rapid Spin like Brambleghast and Tsareena are particularly dangerous foes because they can chase Swampert out while removing Stealth Rock simultaneously. Pokemon with Grass-type coverage like Grass Knot Infernape, Energy Ball Chandelure, and Tera Blast Grass Iron Thorns can typically KO Swampert without warning from high health.</p> <p><strong>Chip Damage</strong>: Swampert lacks reliable recovery, so it is vulnerable to repeated damage from entry hazards, status ailments from Vileplume's Effect Spore and Talonflame's Flame Body, and repeated attacks from foes it is meant to check like Mienshao, Munkidori, and Hisuian Typhlosion. Knock Off users like Incineroar and Alolan Muk only exacerbate this issue with their ability to remove Swampert's Leftovers.</p>",
    "sets": {
      "Utility Tank": {
        "description": "<h4>Set Details</h4> <p>Flip Turn allows Swampert to pivot out and bring in teammates to make progress. Knock Off supplies utility against foes that Swampert cannot hit well with its STAB moves, and it cripples item-reliant foes like Munkidori, Talonflame, and Avalugg. However, Roar prevents Swampert's passivity from getting taken advantage of by stopping setup sweepers like Oricorio-E and Paldean Tauros-W. The physically defensive EV spread is better into attackers like Flygon and Mienshao, but a specially defensive one assists against Electric-types like Rotom-H and Raikou. Tera Poison turns Swampert's 4x weakness to Grass-type attacks into a resistance and helps it more easily take on the myriad of Fighting-types like Mienshao, Infernape, and Breloom. Tera Fairy makes Swampert immune to Dragon-type attacks from threats like Dragalge and resistant to Dark- and Fighting-type attacks from foes such as Brute Bonnet and Mienshao while allowing it to continue checking Ground-types like Flygon. Tera Dragon gives Swampert resistances to Water-, Fire-, and Grass-type attacks, making it strong against common attackers like Basculegion-M, Incineroar, and Breloom. Tera Steel gives Swampert a wide array of resistances to more easily handle special attackers like Dragalge and Sylveon.</p> <p>Swampert benefits from the support of Grass-resistant teammates like Dragalge, Talonflame, and Incineroar, covering its biggest weakness. Swampert's Stealth Rock can be supplemented by Grass-resistant Spikes users like Klefki and Brambleghast to stack entry hazards, both of which also benefit from Swampert's Fire resistance. Ghost-type teammates like Brambleghast and Chandelure can also support Swampert's Stealth Rock by preventing Rapid Spin from opposing Tsareena and Avalugg. Knock Off users like Alolan Muk, Incineroar, and Mienshao can further support Swampert's entry hazards by removing items. While Swampert can take multiple hits, it lacks any reliable recovery, so pairing it with Wish passers like Sylveon and Florges or backup walls like Dragalge, Vileplume, Registeel, and Incineroar can be helpful. As Swampert lures in Grass-types like Tsareena and Vileplume, wallbreakers that can take advantage of Swampert's pivoting like Infernape, Dragalge, and Chandelure can threaten these foes and force others to switch in and take damage from Swampert's Stealth Rock.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ludicolo": {"sets": {"Rain Dance Sweeper": {}}},
  "Breloom": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Hariyama": {"sets": {"Belly Drum": {}, "Assault Vest": {}, "Guts Wallbreaker": {}, "Bulk Up": {}}},
  "Flygon": {
    "overview": "<p>Flygon's great set versatility makes it an elite Pokemon and one of the best Ground-types in NU. Choice Scarf Flygon fits on many teams, outspeeding and limiting many wallbreakers such as non-Choice Scarf Mienshao and Munkidori. Choice Band gives Flygon an incredibly spammable Earthquake and makes it a lot harder to switch into. Flygon can also pivot out with U-turn, allowing it to maintain offensive pressure and momentum. Dragon Dance Flygon can use Loaded Dice, which makes it a great late-game sweeper, and it also threatens lead entry hazard setters like Galvantula and Smeargle. However, as a Choice Scarf user, it faces competition from Mienshao and Infernape, both of which are faster than it and can revenge kill it with Close Combat. Additionally, Flygon's average Attack stat leaves it struggling when facing physical walls like Vaporeon, Vileplume, and Avalugg, as they can still take its attacks even after a Dragon Dance boost. Choice Scarf Flygon can be very easy to play around due to both of its STAB options having common immunities and resistances.</p>",
    "comments": "<h3>Other Options</h3> <p>Flygon can run a mixed set with Draco Meteor and Fire Blast, allowing it to hit physically defensive Pokemon like Avalugg, Orthworm, and Vileplume. It can also run a Choice Specs set with Tera Normal, which gives it a powerful Boomburst. However, both of these sets are not common due to Flygon's low Special Attack. Flygon can also run a utility set with Stealth Rock / Earthquake / Dragon Tail / U-turn with a bulkier EV spread. This set allows it to set entry hazards for its teammates and check foes like Copperajah, Iron Thorns, and Infernape. Sadly, Flygon lacks any recovery, making it very easy for it to get worn down by chip damage.</p> <h3>Checks and Counters</h3> <p><strong>Fairy-types</strong>: Sylveon and Florges are able to tank hits from Choice Scarf Flygon and KO it back with their STAB Fairy-type attacks; however, neither of them can handle Choice Band sets, and they are complete setup fodder against Tera Steel Dragon Dance Flygon.</p> <p><strong>Physically Defensive Pokemon</strong>: Physically defensive Pokemon such as Avalugg and Vileplume have enough bulk to win against any of Flygon's sets, but Vileplume has to be careful directly switching into +1 Flygon if entry hazards are present. Bulky Water-types like Vaporeon, Swampert, and Quagsire are bulky enough to tank a boosted attack and threaten Flygon back with status and Knock Off.</p> <p><strong>Priority Users and Faster Attackers</strong>: Infernape, Breloom, Brute Bonnet, and Basculegion can revenge kill Flygon after it has been weakened a bit. Choice Scarf users like Mienshao and Infernape can outspeed even Choice Scarf Flygon and destroy it with Close Combat.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <p>Outrage is one of Flygon's strongest STAB attacks for late-game cleaning, and it can 2HKO foes like Tsareena and Kilowattrel on a switch. Dragon Claw is a safer option to avoid getting locked into Outrage, but it's significantly weaker and is harder to revenge kill foes with. U-turn allows Flygon to maintain momentum and provide free switches to teammates. Flygon's last move is commonly Stone Edge, which allows it to hit Flying-types like Talonflame, Kilowattrel, and Oricorio-E. Alternatively, Stealth Rock allows it to set entry hazards for its teammates. Flygon can run Dragon Claw alongside Outrage so that it can still revenge kill foes like Kilowattrel and Tsareena without getting immediately destroyed by Fairy-types. First Impression can be used over Stone Edge, allowing Flygon to revenge kill weakened boosted and faster threats like Drednaw and Choice Scarf Munkidori. Tera Steel gives Flygon a resistance to Fairy- and Dragon-type attacks from Pokemon like Sylveon, Florges, and opposing Flygon. This also allows it to check some special wallbreakers like Meloetta, Dragalge, and Porygon-Z.</p> <p>Wallbreakers like Chandelure, Mienshao, and Breloom appreciate Choice Scarf Flygon for giving them free entry with U-turn. Flygon can form a VoltTurn core with special attackers like Kilowattrel, Rotom-C, and Toxtricity. They can threaten physical walls like Vaporeon, Avalugg, and Vileplume; in return, Flygon can pressure special walls like Alolan Muk and Copperajah. Choice Scarf Flygon struggles to break past bulky Water-types like Vaporeon, Swampert, and Quagsire, which tank its attacks and punish it with Scald, Knock Off, a slow Flip Turn, and Toxic. Grass-types like Brambleghast, Brute Bonnet, and Vileplume similarly appreciate Flygon's U-turn giving them free entry to handle the aforementioned bulky Water-types. Steel-types like Copperajah, Registeel, and Bronzong appreciate Flygon for checking Fire-types like Chandelure, Infernape, and Incineroar; in return, they can check Fairy-types like Sylveon, Florges, and Diancie. Choice Scarf Flygon appreciates entry hazard support from Copperajah, Diancie, and Swampert, as it can wear down foes to help with Choice Scarf Flygon's low damage output.</p>"
      },
      "Choice Band": {
        "description": "<h4>Set Details</h4> <p>Choice Band gives Flygon more immediate power, allowing it to always 2HKO Vileplume and Quagsire after Spikes damage with Earthquake. Outrage is still an option to allow Flygon to 2HKO Vaporeon and Quagsire, but Scale Shot is preferred so Flygon isn't easily revenge killed by Fairy-types, and it makes Flygon harder to revenge kill overall. First Impression revenge kills weakened foes like Porygon-Z, Munkidori, and Torterra. Alternatively, Throat Chop provides coverage for Bronzong and shuts down Hyper Voice Sylveon, whereas Stone Edge pops Talonflame on the switch. Tera Bug gives First Impression a power boost, allowing Flygon to KO Mew and do major damage to defensive Reuniclus. Tera Steel can sometimes be preferred over Tera Bug, since it's better defensively and allows Flygon to pivot without getting chipped heavily by Stealth Rock.</p> <p>Choice Band Flygon likes having entry hazard support from teammates like Klefki, Copperajah, and Diancie to wear down foes that can repeatedly switch into it. Many Pokemon that tend to struggle against bulky Water-types like Vaporeon and Milotic, such as Registeel, Infernape, and Basculegion, appreciate Choice Band Flygon's ability to 2HKO them on the switch. However, while it can 2HKO most bulky Water-types, it can't always beat them one-on-one, so it pairs well with Grass-types like Tsareena, Brambleghast, and Vileplume. Physically defensive Pokemon like Avalugg, Weezing, and Orthworm can take Flygon's attacks with ease, so it pairs best with Pokemon like Kilowattrel, Munkidori, and Chandelure that can handle these physical walls. Future Sight Galarian Articuno can be a great partner for Choice Band Flygon, allowing it to weaken physical walls like Milotic, Avalugg, and Vileplume.</p>"
      },
      "Dragon Dance": {
        "description": "<h4>Set Details</h4> <p>Dragon Dance with a Scale Shot boost allows Flygon to outspeed the entire tier, including common Choice Scarf users like Mienshao and Infernape. Dropping Scale Shot for Outrage is acceptable to run a different item, but this makes Flygon significantly more reliant on obtaining multiple Dragon Dance boosts to avoid being revenge killed. Substitute allows Flygon to take advantage of switches and passive Pokemon, giving it more turns to set up. With Tera Steel, Flygon can also exploit Pokemon like Vileplume and Brave Bird Talonflame for easier setup. Fire Punch allows Flygon to hit Grass-types like Tsareena, Vileplume, and Brute Bonnet, as well as Steel-types like Bronzong, Orthworm, and Tera Steel Flygon. Tera Steel allows it to be immune to Umbreon and Quagsire's Toxic. Tera Fire gives Fire Punch a much-needed power boost and retains the resistance to Fairy-type attacks that Tera Steel gives. If running Substitute, an alternate EV spread of 32 HP / 224 Atk / 252 Spe can be run to avoid Tera Steel Flygon's Substitute from being broken by Talonflame's Brave Bird.</p> <p>Dragon Dance Flygon appreciates entry hazard support from Klefki and Swampert to guarantee a 2HKO on Pokemon like Vileplume and Vaporeon. Toxic Spikes in particular is helpful, since it makes it a lot easier to break through physical walls like Quagsire and Swampert that would usually tank many hits from a Dragon Dance boost. Flygon is a perfect pick for hyper offense teams due to its Sticky Web immunity and because it can sweep opposing hyper offense teams. It can also punish lead hazard setters like Galvantula and Smeargle by setting up a Dragon Dance and breaking their Focus Sashes with Scale Shot. Other sweepers like Breloom, Drednaw, and Mienshao appreciate Dragon Dance Flygon's ability to weaken teams so they can win late-game. Choice Scarf users like Mienshao, Munkidori, and Infernape can force Flygon to switch out even if it's at +1 because they can still outspeed it. Thus, slow pivots like Toxtricity, Swampert, and Flip Turn Vaporeon can help by bringing Flygon in safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Cacturne": {
    "outdated": true,
    "sets": {
      "Offensive Spikes": {
        "description": "<p>Cacturne is an amazing offensive Spiker in NU. Due to its strength and typing, it finds many opportunities to switch in on and threaten tier staples like Sandaconda, Qwilfish, and Drifblim. Cacturne is also good at taking advantage of Water-types like Bruxish and Floatzel thanks to Water Absorb, giving it more chances to set up Spikes and dish out heavy damage. Dark Pulse reliably pressures Defoggers like Drifblim and Lurantis as well as Magic Bounce Hattrem. A Naive nature lets Cacturne outspeed Modest Clawitzer without sacrificing any power. Braviary is an excellent teammate for Cacturne, since it dissuades Defog attempts with Defiant and reliably pressures special walls. In return, Cacturne offers Braviary safety from Bruxish, offensively checks Ghost-types, and can facilitate late-game cleaning with Spikes. Setup sweepers like Hisuian Sneasel and Vivillon become much harder to stop when backed by Spikes and also match up well against Defoggers like Braviary and Lurantis.</p>"
      },
      "Swords Dance Sweeper": {}
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Altaria": {"sets": {"Utility": {}, "Trapper": {}}},
  "Milotic": {"sets": {"Physical Wall": {}}},
  "Registeel": {
    "overview": "<p>Thanks to its impressive mixed bulk and utility movepool, Registeel finds a home in the tier as one of the premier walls. Its typing has key resistances to Dragon, Fairy, and Rock, letting it stand in the way of threats like Dragalge, Sylveon, and Diancie. It also isn't completely passive; it can threaten common Fairy-types with its powerful Heavy Slam or even set up on and take out the defensive Pokemon that it walls, like Umbreon, with the devilish IronPress combination. Additionally, Registeel is a great entry hazard setter that has no issue finding opportunities to set Stealth Rock during a game. However, Registeel's typing can often be a burden, as its weaknesses are taken advantage of by common wallbreakers like Chandelure, Breloom, and Flygon. Additionally, Registeel is vulnerable to getting weakened over the course of a battle, as it relies on Leftovers as its only method of recovery. Lastly, Registeel's easy to exploit with slow and paralysis-immune Pokemon like Galarian Slowbro and Swampert that don't mind Thunder Wave, as well as Ghost-types like Hisuian Typhlosion and Chandelure.</p>",
    "comments": "<h3>Other Options</h3> <p>Registeel can run a set of Iron Defense / Amnesia / Body Press / Rest with a Chesto Berry to become a dangerous sweeper that's difficult to break through, but it is quite passive while boosting, is walled by Ghost-types, and can be crippled by Trick, Encore, and Taunt.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Fire-types like Infernape, Chandelure, and Incineroar can easily threaten out Registeel with their super effective STAB moves; however, they don't love switching into Earthquake or Thunder Wave. Talonflame's annoying because it easily removes Registeel's Stealth Rock with Defog and can inhibit any IronPress sweeping attempts with Will-O-Wisp.</p> <p><strong>Ground-types</strong>: Ground-types like Swampert and Flygon can shrug off Registeel's attacks and threaten it out with Earthquake, additionally being immune to Thunder Wave.</p> <p><strong>Fighting-types and Fighting-type Coverage</strong>: The likes of Mienshao and Paldean Tauros-W terrify Registeel with their strong Close Combat, and other attackers like Munkidori can use Focus Blast to handle Registeel. However, none of these Pokemon want to switch into Thunder Wave.</p> <p><strong>Passive Damage</strong>: Registeel is vulnerable to being chipped down by entry hazards, and this is particularly noticeable when its Leftovers has been removed by Knock Off or cancelled out by burn.</p>",
    "sets": {
      "Defensive Stealth Rock": {
        "description": "<h4>Set Details</h4> <p>Earthquake prevents Chandelure and Hisuian Typhlosion from walling Registeel, and it also chunks Poison-types like Alolan Muk and Dragalge. Thunder Wave is an immediate punishment to fast attackers like Infernape and Mienshao attempting to switch in on non-attacking moves. Alternatively, the IronPress combination can be used to take advantage of defensive Pokemon like Copperajah, Sylveon, and Umbreon. Tera Dragon gives Registeel useful resistances to many special attackers' strongest attacks, letting it sponge hits like Choice Specs-boosted Hydro Pump from Inteleon and Fire Blast from Chandelure in a pinch. Tera Ghost can be used to blank Fighting-type attacks from the likes of Mienshao and Toxicroak while notably blocking Rapid Spin. Tera Fairy can also be used to help against Fighting-types, additionally helping IronPress variants to check Dark-types like Brute Bonnet and Incineroar, but it's less effective against Toxicroak. Tera Water can be used to give Registeel a resistance to Water and Fire, which is useful against the likes of Basculegion, Inteleon, and Chandelure, while maintaining its resistance to Ice.</p> <p>Registeel fits best on balance teams alongside other defensive Pokemon as part of a core. Vaporeon and Florges are good examples, being able to pass Wish to Registeel to keep it healthy while also having useful resistances to Fire and Fighting, respectively. Spikes setters like Quagsire and Diancie complement Registeel's Stealth Rock, wearing down opposing Pokemon more consistently. Wallbreaking beneficiaries of hazard-stacking cores that Registeel is a part of include Sylveon, which can check Fighting-types and invite in and chip down Fire-types, and Inteleon, a wallbreaker that is incredibly threatening to Ground-types and can chunk defensive Water-types. Fighting- and Fire-type checks like Talonflame, Vileplume, Vaporeon, and Diancie make for good partners, being able to handle the likes of Mienshao and Chandelure. Additionally, Tsareena and Talonflame can tank Ground-, Fighting-, and Fire-type attacks and remove entry hazards for Registeel. Fighting-types like Mienshao and Breloom appreciate the entry hazards that Registeel sets and also benefit from its ability to check common answers to them like Munkidori and Sylveon. Vileplume partners with Registeel to create a solid defensive partnership, being able to spread paralysis alongside Registeel to help out partners like Chandelure and Paldean Tauros-F.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Torterra": {"sets": {"Shell Smash": {}}},
  "Infernape": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Nasty Plot": {}}},
  "Staraptor": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Floatzel": {"sets": {"Rain Wallbreaker": {}}},
  "Gastrodon": {"sets": {"Defensive": {}}},
  "Mismagius": {"sets": {"Choice Scarf": {}, "Substitute + Draining Kiss": {}}},
  "Bronzong": {"sets": {"Utility": {}, "IronPress": {}}},
  "Spiritomb": {"sets": {"Calm Mind": {}}},
  "Lucario": {
    "overview": "<p>Despite its middle-of-the-road Speed tier, Lucario is one of the most dangerous late-game sweepers thanks to its access to strong priority moves like Extreme Speed, Vacuum Wave, and Bullet Punch. Its set versatility makes it hard to play around; for example, Slowbro can be brought in predicting Swords Dance, only to be forced back out after discovering Lucario is running Nasty Plot. Its nearly unresisted STAB combination is often hard to switch into, especially when factoring in Extreme Speed to pick off Fighting-resistant Pokemon like Talonflame and Thundurus. With coverage like Crunch, Earthquake, and Shadow Ball, Lucario is able to beat down should-be checks like Basculegion, Chandelure, and Slowbro, which all resist its STAB combination. Terastallization further enhances Lucario's sweeping potential, giving boosted Extreme Speed the potential to OHKO Talonflame, bulky Noivern, and Choice Scarf Rotom-H as well as unboosted Shadow Ball achieving an OHKO on Slowbro after Stealth Rock. While fragile, Lucario has a great typing with a useful immunity to Poison-type attacks and resistance to common Dark-, Dragon-, and Grass-type moves, which gives it an opportunity to set up against Vileplume, Dragalge, and Brute Bonnet. Unfortunately, however, those moves are still dealing a significant amount of damage to Lucario. Lucario is too reliant on priority due to its Speed tier, as it is outsped by common threats like Flygon, Mienshao, and Krookodile. It is also very susceptible to Talonflame's burn as well as Rocky Helmet users like Slowbro and Vileplume due to its use of contact moves.</p>",
    "comments": "<h3>Other Options</h3> <p>Lucario has several other options to help its Speed. Bullet Punch can be used over Meteor Mash as an additional priority move, but it's weak even after a boost and only targets Lycanroc-D and faster, weakened Ghost-types. Trailblaze can be used to boost Lucario's Speed while dealing damage; it also hits Quagsire and Swampert for the most damage, but it still remains a rather weak and niche alternative. Agility can be used in place of Swords Dance and Nasty Plot while running Adamant and Modest, respectively, but without access to moves that boost its offenses further, Lucario has a harder time breaking walls, although it can have an easier time cleaning. Stone Edge can be used to hit Talonflame on the switch, but it doesn't offer much outside of that. While not optimal, Lucario can use Choice Band and Choice Specs to take on a wallbreaker role and have more immediate power; however, it can be easily exploited due to the number of foes that resist Lucario's STAB attacks. Swords Dance Lucario can use Tera Ghost to become immune to Close Combat from common revenge killers like Mienshao, Lycanroc-D, and Infernape, using them as an opportunity to set up, but the damage drop off with Extreme Speed becomes very noticeable. Lucario tends to have issues finding time to set up, so Leftovers can be used to take full advantage of its great defensive typing, giving it some longevity in battle. Lum Berry allows Lucario to play more aggressively against Talonflame without worrying about being burned.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Swampert, Quagsire, and Tera Poison Avalugg all feast on Lucario, being able to switch in on Swords Dance Lucario and either force it out or simply KO it. Slowbro uses Lucario as setup fodder thanks to its great defensive profile, though it can be caught off guard by Nasty Plot variants.</p> <p><strong>Adverse Contact and Status Effects</strong>: Status-inducing abilities like Talonflame's Flame Body, Vileplume's Effect Spore, and Bellibolt's Static all punish Lucario because of its use of contact moves. Lucario also has to be cautious of status moves like Will-O-Wisp from Talonflame and Hisuian Typlosion, Thunder Wave from Slowbro and Klefki, and Stun Spore from Vileplume and Wo-Chien. If Lucario has Terastallized, then it needs to worry about Toxic from Alolan Muk, Vileplume, Umbreon, and Bellibolt. Physical sets rely solely on contact moves, making some matchups against Rocky Helmet users like Slowbro and Vileplume less ideal than they already are.</p> <p><strong>Ghost-types</strong>: Chandelure, Hisuian Typhlosion, and Basculegion are all immune to Lucario's Close Combat and Extreme Speed while simultaneously resisting Meteor Mash; the former two have to be cautious of Earthquake, while all three should be wary of Crunch. Hisuian Typhlosion will always be faster than Lucario, while Chandelure and Basculegion have to use Choice Scarf to outspeed it, but all of them can easily OHKO Lucario. Users of Tera Ghost like Talonflame, Porygon-Z, and Galvantula hinder Lucario's ability to sweep due to their immunity to most of its moves.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h4>Set Details</h4> <p>Extreme Speed is Lucario's best friend, enabling it to revenge kill faster, weakened Pokemon like Mienshao, Thundurus, and Munkidori. Crunch gives Lucario super effective coverage to hit Ghost-type Pokemon, which are immune to Close Combat and Extreme Speed, such as Chandelure and Basculegion while simultaneously targeting Slowbro, which is 2HKOed after a Swords Dance boost. Meteor Mash aids Lucario against slower Fighting resistant Pokemon like Sylveon, Dragalge, and Vileplume. Earthquake hits the previously mentioned Dragalge and Chandelure for super effective damage as well as other physical walls such as Bellibolt and Tera Poison Slowbro. Air Balloon can be used over Life Orb to allow Lucario to switch into Choice-locked Earthquake from users like Krookodile and Flygon, giving it a safe opportunity to set up; however, Lucario misses out on Life Orb's extra damage, often forcing it to Terastallize more often than not. Inner Focus lets it ignore Intimidate from Krookodile and Incineroar as well as Ambipom's and Mienshao's Fake Out flinch. Jolly lets Lucario Speed tie with Porygon-Z and Brambleghast, but Adamant gives it a strong damage boost; however, it becomes noticeably slower, getting outpaced by Gallade, Chandelure, and Rotom-H. Tera Normal gives Lucario a much-needed boost to Extreme Speed's power, having the chance to OHKO Talonflame and Flygon. Becoming a Normal-type is great for Lucario offensively, but it isn't great defensively; it no longer walls RestTalk Alolan Muk and Vileplume and loses useful resistances to Dragon-, Dark-, and Grass-type moves, giving the upper hand to Dragalge, Brute Bonnet, Tsareena, and Vileplume; Choice Band Flygon becomes an effective revenge killer due to Lucario no longer resisting First Impression. Defensive Tera from foes like Tera Ghost Talonflame, Tera Poison Wo-Chien and Incineroar, and Tera Steel Noivern are commonly used as counterplay against this set.</p> <p>Sticky Web support from Galvantula greatly benefits Lucario, allowing it to outspeed Lycanroc-D and non-Choice Scarf variants of Krookodile and Mienshao. Lucario also enjoys entry hazards from other dedicated leads on hyper offense teams such as Lycanroc-D and Smeargle. Some other notable partners on those teams include non-lead Lycanroc-D, Thundurus, and Toxtricity, all of which punish some of Lucario's checks like Chandelure, Slowbro, and Swampert; in return, Lucario can KO Mienshao, Alolan Muk, and Sylveon that give them trouble. On bulky offense or balance builds, Lucario appreciates help from slow pivots like Dragalge and Magnezone, which handle the likes of Hisuian Typhlosion, Talonflame, and Vileplume. Knock Off support from Krookodile, Alolan Muk, and Wo-Chien helps wear down Ghost-types like Chandelure, Hisuian Typhlosion, and Basculegion; Wo-Chien is especially noteworthy alongside Vileplume, Umbreon, and Registeel for spreading paralysis, allowing Lucario to outspeed Choice Scarf users like Mienshao and Flygon. Pokemon that can wall Fighting- and Ground-type moves like Slowbro and Talonflame pair nicely with Lucario, giving it more opportunities to switch in and sweep.</p>"
      },
      "Nasty Plot": {
        "description": "<h4>Set Details</h4> <p>Nasty Plot takes advantage of Lucario's higher Special Attack stat and surprises common switch-ins like Slowbro and Chandelure. Lucario is often reliant on priority, so Vacuum Wave is the preferred Fighting-type move, OHKOing faster Pokemon like Shell Smash Cloyster as well as dealing massive damage to other threats like Lycanroc-D and Tera Steel Noivern, both of which can be used to stop Swords Dance Lucario. Aura Sphere, however, is much stronger, letting Lucario more reliably break through walls like Registeel and Copperajah; though without the priority, Lucario becomes much less of a threat. Flash Cannon helps against special walls like Sylveon, Florges, and Dragalge that aren't taking much damage from its other moves. Shadow Ball has great synergy with Lucario's Fighting-type attacks, hitting Fighting-resistant foes like Slowbro, Reuniclus, and Chandelure with super effective damage. Tera Ghost boosts Shadow Ball's damage, giving it a favorable roll to OHKO Slowbro while adding an immunity to Close Combat from revenge killers such as Mienshao, Lycanroc-D, and Infernape. It adds a weakness to Knock Off, however, making Lucario noticeably weaker against Alolan Muk and Tsareena. On the other hand, Tera Fighting helps a lot with the power of Vacuum Wave and Aura Sphere; the former can now OHKO Lycanroc-D as well as Krookodile after Spikes, and the latter can 2HKO specially defensive Swampert while unboosted.</p> <p>While Swords Dance Lucario can hit Fighting-resistant foes with Extreme Speed, Nasty Plot variants suffer due to its only priority being Vacuum Wave; because of this, it appreciates help from Thundurus, Lycanroc-D, and Magnezone to take down faster Fighting-resistant foes like Talonflame, Noivern, and Oricorio-E. Lucario appreciates Sticky Web support from Galvantula to help with its poor Speed, and in return, it can act as an emergency spinblocker with Tera Ghost. It often faces problems breaking past Poison-types like Alolan Muk and Dragalge, so Ground-types like Flygon, Krookodile, and Rhyperior help to knock them out; all three of them can also set Stealth Rock, which punishes Lucario's switch-ins even more. Some physical wallbreakers such as Lycanroc-D, Feraligatr, and Flygon appreciate Lucario's potential to break through Quagsire, Vileplume, and Slowbro; in return, they provide offensive pressure and can break through Alolan Muk, Assault Vest Reuniclus, and Tera Water Diancie. Slow pivots like Dragalge, Bellibolt, and Incineroar can safely bring in Lucario while providing other utility such as Toxic Spikes, Toxic, and Knock Off, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Toxicroak": {"sets": {"Swords Dance": {"description": "<p>The Speed EVs help to outpace Gallade, but an alternative spread of 28 HP / 252 Atk / 228 Spe can be used with an Adamant nature for more power while outspeeding Breloom and unboosted Cloyster.</p>"}, "Nasty Plot": {}}},
  "Abomasnow": {
    "sets": {
      "Special Attacker": {
        "description": "<p>Abomasnow is an amazing bulky wallbreaker thanks to its nearly unresisted STAB moves, coverage, and Aurora Veil alongside Snow boosting its defenses. Giga Drain is used for longevity, but Leaf Storm in tandem with Eject Pack works well to pivot and bring in a setup sweeper that can take advantage of its Aurora Veil. Earth Power takes care of Steel-types that can easily switch into Abomasnow safely like Magneton and Tera Steel Appletun. Ice Shard can be used to finish off Pokemon like Scyther and Mesprit, but it can be a wasted moveslot at times because you give up coverage or Aurora Veil. Leech Seed can be used to trade hits more easily with Blissey, which walls Abomasnow otherwise. A Timid nature is key to outspeed Modest Magneton and neutral-nature Samurott. A Choice Specs set can be run, but being locked into one move can be somewhat detrimental due to its Stealth Rock weakness and loss of bulk. Tera Ground helps with boosting Earth Power damage output and gives Abomasnow an Electric immunity for Magneton and Rotom, which use it to gain momentum otherwise.</p> <p>Great partners for Abomasnow are ones that can take care of its Fighting- and Flying-type weaknesses like Scyther, Qwilfish, and Rotom. Hattrem and Drifblim are also exceptional partners that, along with tanking Fighting-type attacks, deny entry hazards for non-Heavy-Duty Boots Abomasnow's longevity. Swords Dance Bruxish and Nasty Plot Mesprit are two good offensive partners that can take advantage of Abomasnow's Aurora Veil once Abomasnow takes care of their checks in Cacturne and Magneton. Tauros and Alolan Raichu also appreciate Abomasnow taking care of their checks like Lurantis and Sandaconda and, in turn, can help with breaking through Steel-types.</p>"
      },
      "Swords Dance": {
        "description": "<p>Thanks to its decent Attack stat in combination with Swords Dance and priority Ice Shard, Abomasnow can be a dangerous setup sweeper that takes advantage of the surprise factor that comes with the set, as it usually uses Swords Dance as a special wall like Blissey, Cryogonal, and Eelektross switches in. While Wood Hammer is more powerful, Seed Bomb can be used over it to still threaten Blissey without recoil. Ice Shard picks off weakened, faster threats like Scyther, Hisuian Sneasel, and Lilligant. Earthquake hits the Steel-types that resist Abomasnow’s STAB moves like Magneton and Tera Steel Appletun. Tera Fire allows Abomasnow to resist hits from Scyther, Pyroar, Magneton, and opposing Abomasnow, giving it a free turn to setup or attack while also granting an immunity to Will-O-Wisp from the likes of Drifblim and Rotom. Tera Ground can be used instead to boost the power of Earthquake, give Abomasnow a Stealth Rock resistance, and surprise Electric-types using Volt Switch.</p> <p>Ice Shard allows Abomasnow to take out offensive checks like Hisuian Sneasel and Scyther after a Swords Dance boost with minimal chip. To get this chip, Rocky Helmet Pokemon like Qwilfish and Sandaconda work well with Abomasnow, enabling it to facilitate a sweep. Flying- and Fighting-types like Scyther and Toxicroak threaten Abomasnow out, so checks like Rotom, Sableye, and Sandaconda pair well alongside it. Choice Scarf Mesprit pairs well with Abomasnow, threatening Fighting-types out and giving Abomasnow a second chance to sweep with the aid of Healing Wish. Articuno acts as a hard wall for Abomasnow, as it gets a Defense boost in snow and access to Haze. Pokemon like Magneton and Rotom can take advantage of Articuno by threatening it with Volt Switch to obtain momentum and crippling it with Trick, respectively. Pyroar also deals with Articuno quite well with Taunt, blocking Articuno’s Roost, in combination with Will-O Wisp, which lets Pyroar chip away at it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 262594, "username": "Milak"}, {"user_id": 192841, "username": "antemortem"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Magnezone": {"sets": {"Choice Specs": {}}},
  "Porygon-Z": {"sets": {"Choice Item": {"description": "<p>Tera Blast Ground can be used on Choice Specs sets to hit Steel-type Pokemon.</p>"}, "Agility": {}}},
  "Gallade": {
    "overview": "<p>With a gargantuan Attack alongside Sharpness, nothing in the tier can safely switch into Gallade. Its two STAB moves hit the tier for nearly unresisted coverage. Psychic-types like Cresselia and Galarian Slowbro that can pivot into Gallade's STAB combination are taken out by Dark-type coverage moves in Night Slash and Knock Off. Leaf Blade allows it to easily beat Diancie and defensive Water-types like Swampert, Milotic, Quagsire, and Vaporeon. Shadow Sneak allows Gallade to circumvent its relatively low Speed to pick off weakened threats, while Agility lets it clean after its teammates have weakened the opposing team. Scope Lens makes Gallade even harder to switch into, as Psycho Cut and Night Slash already have high critical hit ratio and can beat even bulky setup sweepers like Tera Poison Kee Berry Cresselia and Bronzong. Gallade is quite slow, being outpaced by lots of non-Choice Scarf Pokemon such as Brambleghast, Mienshao, and Flygon. This, combined with Gallade's low Defense, also leaves it open to be revenge killed by these Pokemon. Gallade also faces rough competition for the Fighting-type slot from the likes of Mienshao, Infernape, and Toxicroak, which are not nearly as easily revenge killed.</p>",
    "comments": "<h3>Other Options</h3> <p>Due to Gallade's weakness to contact effects such as Flame Body, Static, and Rocky Helmet, Protective Pads can work well on setup sets; it loses out on Life Orb boosting its attacks, though. Choice Scarf can be used too, but it’s a somewhat poor option, as Gallade remains easily outsped by faster Choice Scarf users like Flygon, Staraptor, and Mienshao. Knock Off can be used over Night Slash on some sets, but the extra and consistent power granted by Sharpness-boosted Night Slash is hard to give up. Aqua Cutter can be run over Leaf Blade to hit Talonflame, but then Gallade fails to threaten the tons of Water-types that love to switch in against it. Assault Vest can be run to take more hits, but with how Gallade then struggles a bit more against bulky setup sweepers like Bronzong and Kee Berry Cresselia, it typically isn't worth it. Gallade's only counter is Scream Tail, so as a fourth move, Poison Jab can be run to ensure you aren't beat by it as easily. Tera Fire can be used on Gallade to not worry about burns from Talonflame's Flame Body and Will-O-Wisp.</p> <h3>Checks and Counters</h3> <p><strong>Faster Pokemon</strong>: Faster Pokemon like Mienshao and Flygon all commonly carry Choice Scarf, negating Sticky Web, and they can easily take advantage of Gallade's low Speed and Defense to KO it even with a resisted hit before it can attack. Notably, Mienshao's Close Combat 2HKOes offensive Gallade after Stealth Rock.</p> <p><strong>Contact Move Punishment</strong>: With most of Gallade's attacks making contact, punishing items and abilities like Rocky Helmet, Static, Effect Spore, and Flame Body are quite a pain to deal with, cutting into its Speed, longevity, and wallbreaking capabilities, the former two already being a problem for Gallade.</p> <p><strong>Ghost-types</strong>: Faster Ghost-types like Brambleghast and Hisuian Typhlosion easily outspeed and KO Gallade with their Ghost-type STAB moves. Slower Ghost-types like Chandelure and Basculegion, on the other hand, are forced to run a Choice Scarf to outspeed and KO Gallade. All of these Ghost-types can take advantage of Gallade's strongest attack in Sacred Sword and switch in unharmed, but they fear Psycho Cut.</p>",
    "sets": {
      "Scope Lens": {
        "description": "<h4>Set Details</h4> <p>Sacred Sword lets Gallade break through even boosted targets like Curse Alolan Muk and Iron Defense Registeel. Night Slash hits Psychic-types like Cresselia, Galarian Slowbro, and Munkidori, which all resist its STAB moves. Leaf Blade allows Gallade to hit common bulky Water-type switch-ins like Swampert, Vaporeon, and Milotic. However, Shadow Sneak can be run to pick off weakened threats. Tera Dark is preferred to resist Ghost-type attacks and boost Night Slash's damage output, improving Gallade's matchup versus Bronzong and Cresselia. However, Tera Ghost can be run to boost Shadow Sneak's revenge killing prowess.</p> <p>Thanks to Gallade's ability to easily beat special walls such as Alolan Muk, Diancie, and Bronzong, it pairs well with special sweepers like Munkidori, Dragalge, and Inteleon, which can all pivot Gallade in and reap the benefits of its wallbreaking abilities. Poison-types like Vileplume and Dragalge can be easily handled by Gallade, so pairing Gallade with another Fighting-type like Mienshao or Infernape works amazingly. Thanks to Leaf Blade Gallade beating bulky Water-types like Swampert, Milotic, and Vaporeon, Pokemon that enjoy these walls gone like Inteleon, Incineroar, and Flygon are good partners. Gallade's low Speed and Defense leave it open to being revenge killed by faster physical attackers like Flygon or priority moves like Sucker Punch from Brute Bonnet. To counteract this issue, partners like Bellibolt, Wo-Chien, and Vileplume pair amazingly alongside Gallade; they can even paralyze foes via Static for the former and Stun Spore for the latter two. Additional paralysis support such as Thunder Wave from Klefki and Umbreon is also appreciated. Ghost-types like Brambleghast, Hisuian Typhlosion, and Choice Scarf Chandelure all easily outspeed Gallade and threaten it back with super effective STAB moves, making Dark-types like Alolan Muk, Scrafty, Incineroar, and Alolan Muk vital. Pivots like Talonflame, Mienshao, and Dragalge easily bring Gallade in versus bulky Water- and Steel-types, allowing it to force progress.</p>"
      },
      "Setup Sweeper": {
        "description": "<h4>Set Details</h4> <p>Swords Dance Gallade is a strong wallbreaker with no switch-ins, but Agility allows it to become a dangerous late-game cleaner. Night Slash hits Psychic-types like Galarian Slowbro and Cresselia. On the other hand, Shadow Sneak can be used on Swords Dance sets to bypass Gallade's low Speed and pick off a weakened threat. Life Orb is preferred to always 2HKO Unaware Quagsire with Sacred Sword. Lum Berry can be used instead to nullify debilitating contact effects such as Effect Spore and Flame Body and status moves like Will-O-Wisp and Thunder Wave from Talonflame and Klefki, respectively. Alternatively, Agility Gallade could also opt for Scope Lens for better chances against Bronzong and Cresselia; however, Gallade is weaker if it fails to land a critical hit. Tera Dark and Tera Ghost boost Night Slash and Shadow Sneak, respectively. On top of that, Tera Dark lets Gallade take a Ghost-type attack from Chandelure and Hisuian Typhlosion in a pinch and KO them in return, but it makes Gallade weak to the common U-turn, Infernape's and Mienshao's Close Combat, and most forms of priority like Flygon's First Impression and Breloom's Mach Punch. However, Tera Ghost allows Gallade to completely blank an incoming Fighting-type attack from these Pokemon, circumventing its low Defense.</p> <p>Due to Gallade's low Speed tier for being a sweeper, it pairs greatly with Galvantula, which can set up Sticky Web. However, even with Sticky Web up, Choice Scarf Pokemon like Mienshao, Munkidori, and Rotom-C easily outspeed Gallade, so Choice Scarf Chandelure and Hisuian Typhlosion can both counteract this and give Gallade a way to deal with opposing Ghost-types. Both Swords Dance Breloom and Shell Smash Drednaw pair well with Gallade, as together they can overwhelm each other’s checks like Talonflame, Vileplume, and Milotic. Another way to circumvent Gallade's low Speed is through paralysis from either Bellibolt's Static, Klefki's Thunder Wave, or Vileplume's Stun Spore. Without Leaf Blade, Gallade can't easily threaten a KO on bulky Water-types. This means Grass- and Electric-types like Tsareena, Rotom-C, and Kilowattrel make for great partners, as they all also provide extra utility in hazard control, Trick, and drawing in Steel-types, respectively. Faster physical attackers like Brambleghast, Flygon, Mienshao, and Infernape are difficult for Gallade to deal with, so defensive and offensive checks like Vileplume, Sylveon, Dragalge, and Inteleon make for excellent teammates. As Agility Gallade has difficulty sweeping right away, it requires wallbreakers or fellow setup sweepers, such as Inteleon, Incineroar, Flygon, and Drednaw, alongside entry hazard support from leads like Froslass and Brambleghast or supportive teammates like Klefki and Swampert to wear down opposing teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Froslass": {
    "sets": {
      "Spikes Utility": {
        "description": "<p>With excellent Speed, a diverse utility movepool, and Spikes, Froslass is an elite Spikes setter and spinblocker. Taunt shuts down opposing entry hazard setters like Qwilfish, Blissey, and Sandaconda while also preventing Defog from the likes of Braviary and Lurantis. Ice Beam puts additional pressure on the aforementioned Defoggers and targets other walls like Sandaconda and Appletun. Shadow Ball provides higher damage on targets like Mesprit and Ghost-types like Rotom and opposing Froslass. Will-O-Wisp cripples physical attackers like Coil Dudunsparce, Hisuian Sneasel, and Scyther. While Tera Dark is situational, it can become a Knock Off sponge and wall Sableye while inverting its Dark and Ghost weaknesses.</p> <p>Stealth Rock setters like Bombirdier and Sandaconda contribute to the hazard stacking Froslass provides, with the former removing opposing Heavy-Duty Boots with Knock Off. Wallbreakers like Bruxish and Pyroar can put foes into KO range faster thanks to the extra chip damage. VoltTurn users such as Scyther, Jolteon, and Magneton can not only help bring Froslass in safely, but also wear down other walls like Muk, Appletun, and Umbreon. Defensive walls like Blissey and Sandaconda can circumvent Froslass's low bulk with their reliable recovery and can sponge status moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Rotom": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Rotom stands out as a fantastic user of Choice Scarf thanks to its nearly unresisted STAB combination, high Speed tier, and three immunities. Will-O-Wisp lets Rotom cripple opposing physical sweepers such as Passimian, Medicham, and Scyther on top of Toxicroak using Sucker Punch. Trick is very useful to dismantle walls that rely on their item like Sandaconda, Eelektross, and Chansey. Tera Electric and Tera Ghost boost Rotom's STAB attacks even further with no drawbacks, though note that Tera Ghost exposes Rotom to Sandaconda's Glare. Tera Dark is useful for beating Sucker Punch Toxicroak and making Rotom a good lure for Zoroark. Thanks to Rotom's ease switching into opposing Sandaconda, teammates weak to it like Toxicroak, Lycanroc, Perrserker, and Scyther make for great partners; the latter two can even form a VoltTurn core with it. Bruxish, Medicham, and Mabosstiff help Rotom get around common special walls like Umbreon, Muk, and Chansey. Some walls that Rotom benefits from teaming up with include Umbreon, Vaporeon, and Muk thanks to their ability to take on common wallbreakers that can revenge kill Rotom such as Mabosstiff, Bruxish, and Pyroar.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Rotom takes advantage of common Pokemon such as Sandaconda and Chansey that typically can't threaten it to set up. Will-O-Wisp eases setup and helps weaken checks such as Eelektross and Appletun. Tera Ghost helps Rotom get by Eelektross and Muk while retaining its Fighting immunity, whereas Tera Fairy can catch Dark-type revenge killers like Zoroark and Choice Scarf Mabosstiff off guard.</p> <p>Rotom's quite customizable: Substitute / Nasty Plot / Thunderbolt or Discharge / Shadow Ball limits revenge killers and makes it easier to choose an offensive Tera type. Protect can be used instead of Will-O-Wisp to scout Choice item revenge killers like Zoroark, Passimian, and Bruxish. These options lack the same consistency as the listed set, though.</p> <p>Pivots like Passimian, Scyther, and Oricorio formes are great to bring Rotom in against Sandaconda and Chansey, affording it easy setup opportunities. If Rotom is running Volt Switch, pair it with physical wallbreakers such as Bruxish and Toxicroak that can take on blanket special walls like Muk and Umbreon that commonly try to check it.</p>"
      },
      "Utility": {
        "description": "<p>Rotom is an excellent bulky pivot, forcing out common staples like Scyther and Qwilfish with Volt Switch while having a positive matchup against Sandaconda, the most common Volt Switch absorber in the tier. Will-O-Wisp neuters physical attackers such as Passimian and Toxicroak and powers up Hex to chunk special walls like Eelektross and Muk. Protect racks up Leftovers recovery and burn damage while scouting moves from Choice item users such as Zoroark, Bruxish, and Passimian. Tera Electric powers up Volt Switch and removes Rotom's weaknesses to Dark and Ghost, improving its matchup against Mabosstiff, Umbreon, Haunter, and opposing Rotom. Tera Steel gives Rotom a great defensive typing with Levitate, which allows it to shrug off Sandaconda's Ground- and Rock-type coverage as well as take resisted damage from common moves like Lurantis's Leaf Storm and Lycanroc's Stone Edge. Because of Rotom's vulnerability to chip damage, it benefits greatly from reliable entry hazard removal from Pokemon such as Scyther and Lurantis. Powerful wallbreakers such as Ursaring and Medicham appreciate Rotom pivoting them safely into play. Rotom is quite vulnerable to faster attackers such as Zoroark and Bruxish, so it appreciates being paired with defensive stops to these threats, such as Muk and Umbreon. Passimian is a fantastic partner that forms a VoltTurn core with Rotom and revenge kills its offensive checks; it also appreciates Rotom weakening Sandaconda.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 537558, "username": "memesketch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 298730, "username": "poh"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 583793, "username": "Sabelette"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Rotom-Heat": {"sets": {"Choice Scarf": {}, "Nasty Plot": {}}},
  "Rotom-Mow": {"sets": {"Choice Scarf": {}, "Utility": {}, "Nasty Plot": {}}},
  "Uxie": {"sets": {"Utility": {}}},
  "Cresselia": {"sets": {"Calm Mind": {"description": "<p>56 Speed EVs help outpace Adamant Incineroar, but a faster spread of 252 HP / 40 Def / 216 Spe can be run alongside a Timid nature to outpace Jolly Gallade.</p>"}, "Choice Scarf": {}}},
  "Shaymin": {"sets": {"Healing Wish": {}, "Offensive": {}}},
  "Emboar": {"sets": {"Wallbreaker": {}}},
  "Samurott": {"sets": {"Mixed Wallbreaker": {}, "Swords Dance": {}}},
  "Leavanny": {"sets": {"Sticky Web Support": {}}},
  "Lilligant": {
    "sets": {
      "Quiver Dance Sweeper": {
        "description": "<p>Lilligant is a fearsome setup sweeper in NU thanks to the infamously potent combination of Quiver Dance + Terastallization. Tera patches up two of Lilligant's main weaknesses, being poor coverage and a poor defensive typing. Pollen Puff allows Lilligant to hit Grass-types like Appletun and Lurantis without having to rely on Tera Blast. It also doubles as nice coverage for Pokemon such as Umbreon and Mesprit, which pack the bulk and utility options to hinder a Lilligant sweep. Because Lilligant has Pollen Puff for Grass-types, it uses a Tera Blast type capable of threatening Flying-types, commonly Rock or Electric. Tera Rock has the added benefit of resisting Poison, letting Lilligant more easily deal with Muk or take a Poison-type attack from Hisuian Sneasel or Toxicroak in a pinch. Lilligant can opt to run Encore last in tandem with Tera Electric to take advantage of careless Thunder Wave users like Blissey and Umbreon, locking them into the move and granting Lilligant free setup opportunities. Sleep Powder can be used to grant even more setup opportunities, but without the added coverage, these setup opportunities are often moot. Life Orb is great for Lilligant, as Giga Drain can offset the recoil, and the added damage to special walls like Appletun and Bombirdier is greatly beneficial.</p> <p>Lilligant is often found on more offensive teams, both creating and using openings and momentum for and by its teammates. Dedicated leads like Bombirdier and Froslass are the forefront of generating early momentum for offensive Pokemon; the entry hazards and utility options like a respective Memento or Destiny Bond create ample opportunities for Lilligant and other offensive teammates like Hisuian Sneasel, Veluza, and Vivillon. Choice Scarf Mesprit and Rotom can invite in special walls like Blissey, Cryogonal, and Umbreon and Trick them, completely impairing their ability to check Lilligant effectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Krookodile": {
    "overview": "<p>Krookodile's Attack, useful utility movepool, and ability to cater to its team's needs by either checking fast threats or punishing and taking advantage of fatter walls solidify its position as one of the top threats of NU. With Intimidate, Krookodile excels at being an entry hazard setter thanks to its ability to maintain pressure while also having access to moves like Knock Off and Taunt to cripple bulkier Pokemon like Talonflame and Vaporeon that could come in freely and take advantage of it. Krookodile's great coverage in Gunk Shot and Stone Edge helps it target Grass-, Fairy-, and Flying-types like Tsareena, Brute Bonnet, Sylveon, and Noivern, which could switch in more easily otherwise. Krookodile puts this coverage to use exceptionally well with its Choice Scarf set, letting it outspeed would-be threats like Inteleon, Basculegion, and Lycanroc-D. The Speed Krookodile gains from Choice Scarf, along with the Attack boosts from Moxie, helps it sweep unprepared teams that can't offensively check it. However, its fairly middling Speed tier means common Choice Scarf users like Mienshao and Flygon easily outspeed it, and, if Krookodile manages to get a KO, a healthy defensive wall is still usually enough to force it out. Even against resisted attacks, Krookodile tends to take a lot of damage, and it can be overly reliant on Intimidate, meaning taking special attacks is quite difficult. Krookodile also tends to fail to do much to Pokemon like Slowbro and Vileplume after a Knock Off, forcing it to switch out afterward.</p>",
    "comments": "<h3>Other Options</h3> <p>A Choice Band set on Krookodile can be used, but it tends to get easily revenge killed due to its middling Speed. Rocky Helmet can be run on utility or bulkier sets, but most of the moves Krookodile would want to switch into to take advantage of the item's chip damage would be super effective. With either a Loaded Dice or a Lum Berry, Krookodile can be a dangerous setup sweeper with Moxie and a moveset of Knock Off / Earthquake / Scale Shot / Bulk Up.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types</strong>: Mienshao and Infernape both outspeed Krookodile and can finish it with a Close Combat. Lucario can use Choice Scarf Krookodile as set-up fodder, and Gallade can take any hit from it, letting Gallade either setup as well or just KO it. Scrafty also takes advantage of Krookodile by using it as setup fodder as Krookodile fails to do any meaningful damage to it.</p> <p><strong>Grass-types</strong>: Grass-types like Tsareena, Brute Bonnet, and Vileplume can take an Earthquake from Krookodile and threaten it with super effective STAB moves; however, the former two should be cautious of Gunk Shot. Torterra outspeeds non-Choice Scarf Krookodile after a Shell Smash and can OHKO it with Bullet Seed.</p> <p><strong>Water-types</strong>: Water-type physical walls like Swampert, Quagsire, and Slowbro can easily take attacks from Krookodile. Swampert lacks recovery, though, leaving it open to being whittled down over the course of a battle. Slowbro can be forced to Terastallize, however, leaving it open to be hit super effectively by Krookodile's other moves. More offensive Water-types, like Inteleon, Feraligatr, and Cloyster, can threaten to KO Krookodile after either taking a hit or easily outspeeding it.</p> <p><strong>Revenge Killers</strong>: Due to Krookodile's somewhat middling Speed, it's easily outsped by faster Choice Scarf users even when using one itself. Choice Scarf Mienshao, Infernape, Inteleon, and Flygon all outspeed Krookodile and can threaten to KO with minimal chip damage, if not outright OHKOing it.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <p>Stone Edge hits Flying-types like Talonflame and Noivern, while Gunk Shot hits Grass- and Fairy-types that take advantage of Krookodile like Tsareena, Sylveon, and Tera Fairy Slowbro. Intimidate provides it extra utility throughout the battle, letting it check physical attackers more easily, while Moxie, in conjunction with Choice Scarf, allows Krookodile to be a deadly wincon that can easily snowball. Tera Poison boosts Gunk Shot and provides Krookodile with defensive utility, letting it survive one Fighting- or Fairy-type attack while helping it take on a common Choice Scarf user in Mienshao. However, Tera Dark can be used instead to boost Krookodile's Knock Off to insane levels, paving the way for its sweep with Moxie.</p> <p>Faster Choice Scarf users like Mienshao, Infernape, and Flygon threaten Krookodile, so Pokemon like Vileplume and Slowbro help check them. Krookodile also has issues with beating bulky physical walls like Vileplume and Quagsire, so special wallbreakers like Munkidori, Chandelure, and Sylveon help to tear holes to aid in Krookodile's sweep. Krookodile easily checks fast Psychic- and Ghost-types like Munkidori and Hisuian Typhlosion, so teammates like Dragalge, Reuniclus, and Brambleghast can take advantage of this. Getting KOs can be difficult for Krookodile, meaning that pivots like Dragalge, Tsareena, and Mienshao, which can lure in Pokemon that are weak to Krookodile, are greatly appreciated. Assault Vest Gallade and Magnezone help check special attackers for Krookodile while also beating bulky Water-types like Swampert and Slowbro.</p>"
      },
      "Offensive Hazard Setter": {
        "description": "<h4>Set Details</h4> <p>With Knock Off Krookodile is a threatening entry hazard setter, as it's able to beat every hazard removal Pokemon in the metagame with the chip damage it racks up. Gunk Shot helps Krookodile deal with Grass-types like Tsareena and Brute Bonnet, but Stone Edge allows Krookodile to hit Flying-type switch-ins such as Noivern and Talonflame. Alternatively, Taunt lets Krookodile stop bulkier Pokemon like Swampert, Diancie, and Vileplume from setting up their hazards or recovering. Unlike Knock Off, Crunch alongside Black Glasses can 2HKO Slowbro after it consumes its Colbur Berry; the trade-off of this combination is that Krookodile then can't cripple item-reliant Pokemon like Talonflame and Swampert. Black Glasses simultaneously boosts Krookodile's Knock Off while also not revealing an item, allowing Krookodile to bluff having a Choice Scarf. Alternatively, Leftovers can be used instead for some recovery. With Tera Poison, Krookodile can check Mienshao and Tsareena in a pinch while boosting Gunk Shot; however, Tera Ghost allows it to be immune to both Fighting-type attacks and Rapid Spin while giving it multiple neutralities. Leading with Stealth Rock Krookodile tends to be detrimental, as common leads carry super effective attacks or U-turn like Mienshao and Flygon.</p> <p>Fighting-types such as Mienshao and Infernape easily outspeed Krookodile and threaten it with Close Combat, so pairing it with teammates like Dragalge, Slowbro, and Talonflame helps to alleviate this weakness. Bulky Grass- and Water-types like Tsareena, Vileplume, and Swampert are difficult for Krookodile to deal with, meaning it enjoys the support of Pokemon like Chandelure, Noivern, and Rotom-C. Special attackers like Inteleon, Venusaur, and Florges easily scare out Krookodile, so special walls like Copperajah, Magnezone, and Assault Vest Slowbro help take on these threats. With how easily Krookodile removes items, Spikes setters like Klefki and Brambleghast pair well with it, helping to weaken the opposing team. Pokemon such as Mienshao, Munkidori, and Gallade that take advantage of Krookodile's ability to take on Psychic- and Ghost-type attackers work well with it. Pokemon like U-turn Munkidori and Flip Turn Dragalge can bring in Krookodile against Alolan Muk, forcing progress against it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 168392, "username": "P Squared"}]}]}
  },
  "Scrafty": {"sets": {"Bulk Up": {}, "Dragon Dance": {}}},
  "Cinccino": {"sets": {"Tidy Up": {"description": "<p>Knock Off hits Ghost-types that blank Cinccino's STAB and Bullet Seed hits checks like certain physically defensive Pokemon like Swampert and Quagsire. Encore allows Cinccino to take advantage of passive Pokemon, gifting it more setup opportunities. Alternatively, Rock Blast can be run to hit Talonflame to avoid Flame Body burns, and Triple Axel can be used as a strong coverage move to nail Brambleghast, Gligar, Flygon, and Dragalge.</p>"}}},
  "Reuniclus": {
    "overview": "<p>Reuniclus can serve as both a solid special wall and a dangerous set up sweeper. With Assault Vest, it can take hits from common special attackers like Munkidori, Magnezone, and Dragalge, while its offensive set can set up with Calm Mind and even blow through checks. Its staying power is further bolstered by a combination of Regenerator, Magic Guard, and Recover. Psyshock and Focus Blast hit most of the tier for at least neutral damage, and Knock Off and Future Sight are useful utility. Psychic Noise allows Reuniclus to beat bulkier foes that would otherwise out-heal its damage. Energy Ball can also be a useful option, hitting several Psychic-resistant foes in the tier, including Slowbro and Krookodile. Dark-types like Alolan Muk and Krookodile can be problematic, however, due to their ability to hit Reuniclus hard with Knock Off. Psychic types like Slowbro and Mew can also be difficult, as they resist both of Reuniclus's main attacking options. Ghost-types, particularly strong attackers like Chandelure and Brambleghast seriously threaten Reuniclus as well. Additionally, Reuniclus's very low Speed stat also makes it vulnerable to being overwhelmed and revenge killed by many physical attackers, including Lycanroc-D, Mienshao, and Feraligatr.</p>",
    "comments": "<h3>Other Options</h3> <p>Trick Room is a reasonable option on offensive sets to take advantage of Reuniclus's very low Speed. Tera Blast Fighting is occasionally used as an accurate substitute for Focus Blast, but does require Terastallization to be useful.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Several Dark-types in NU easily switch into Reuniclus's STAB moves and threaten back with Knock Off. In particular, Alolan Muk, Incineroar, and Krookodile outspeed and deal significant damage to Reuniclus.</p> <p><strong>Psychic-types</strong>: Psychic-types resist both Reuniclus's Psychic-type STAB moves and Focus Blast, making them potent defensive answers. Slowbro and Mew can set up alongside or against Reuniclus and regularly carry coverage that hits for at least neutral damage.</p> <p><strong>Ghost-types</strong>: While they don't switch well into Reuniclus's attacks besides Focus Blast, common Ghost-type attackers like Chandelure, Brambleghast, and Hisuian Typhlosion can outspeed and KO Reuniclus.</p> <p><strong>Strong Physical Attackers</strong>: Reuniclus's low Speed leaves it vulnerable to being revenge killed and overwhelmed by strong physical attackers, particularly those with U-turn. Lycanroc-D, Feraligatr, Mienshao, and Infernape can all deal serious damage to Reuniclus, and the latter two can pivot on it.</p>",
    "sets": {
      "Assault Vest": {
        "description": "<h4>Set Details</h4> <p>Psychic Noise prevents foes from healing, allowing Reuniclus to actually wear down bulky foes like Slowbro and Quagsire. Future Sight can hit potential threats to Reuniclus after it has already switched out, which can be particularly overwhelming when combined with powerful physical wallbreakers like Choice Band Krookodile and Lycanroc-Dusk. Focus Blast 2HKOes the Steel- and Dark-types like Magnezone and Krookodile that might otherwise try to switch into Reuniclus's Psychic-type attacks,and it can nearly OHKO the latter. Energy Ball hits several bulky Pokemon that might switch into Reuniclus — most notably Slowbro, which is almost always 2HKOed — but outside of hitting Krookodile, makes Reuniclus's matchups against Dark and Steel-types like Incineroar and Registeel much worse. Knock Off provides excellent utility in removing the items of potential switch-ins like Incineroar and Mew. The given EV spread helps Reuniclus outspeed Quagsire and Slowbro, so it can beat them one-on-one with Psychic Noise. The rest is poured into Special Defense to maximize bulk. Tera Dark and Tera Fairy both allow Reuniclus to resist types normally super effective against it, such as Ghost and Dark. Tera Steel and Tera Dragon both work to resist strong neutral attacks from common special attackers, including Boomburst from Toxtricity as well as Grass- and Fire-type attacks from sun sweepers like Venusaur, Scovillain, and Typhlosion.</p> <p>Reuniclus benefits from teammates that can switch into dangerous Dark-types like Alolan Muk and Krookodile. Vileplume does well into both, threatening Effect Spore activations on Knock Off while not fearing poison from Alolan Muk. Offensively, Reuniclus benefits from Fighting-types like Mienshao and Gallade that can eliminate Steel- and Dark-types that would switch into Future Sight, like Copperajah, Magnezone, Krookodile, and Brute Bonnet. Gallade also seriously threatens Slowbro with Leaf Blade, which can try to pivot through Reuniclus's attacks as well. Pivots like Thundurus that can bait in foes like Alolan Muk and Krookodile and chip them down can also make Reuniclus's life much easier. Ghost-types like Brambleghast and Chandelure seriously threaten Reuniclus, so answers like Alolan Muk and Incineroar support it well.</p>"
      },
      "Calm Mind": {
        "description": "<h4>Set Details</h4> <p>Psychic Noise gives Reuniclus the ability to beat bulky foes like Quagsire and Slowbro, preventing them from healing off damage Reuniclus deals to them. Psyshock is able to challenge boosted foes like Calm Mind Slowbro and Sylveon. Focus Blast hits the Dark- and Steel-types that might otherwise wall Reuniclus, OHKOing Krookodile and — with Tera Fighting — 2HKOing Registeel. Magic Guard allows Reuniclus to avoid being worn down by entry hazards, take advantage of Life Orb, and ignore status like poison and burn. Colbur Berry can help Reuniclus take a Knock Off from Krookodile and Incineroar and respond with a free Focus Blast. The given EV spread allows Reuniclus to outspeed and beat Unaware Quagsire while having as much Defense as possible. Tera Fighting boosts the power of Focus Blast and grants Reuniclus important resistances to Dark-type moves and U-turn. Tera Steel and Tera Fairy work primarily defensively, allowing Reuniclus to take powerful Dark-, Ghost-, or Bug-type attacks that might otherwise threaten or KO it.</p> <p>Reuniclus benefits from the support of strong physical attackers, such as Flygon, Krookodile, and Mienshao, that can wear down special walls like Alolan Muk and opposing Reuniclus to open the way for Reuniclus to set up. Teammates such as Diancie and Vileplume that can switch into Knock Off from Incineorar and Krookodile, respectively, also work well. The latter in particular can threaten physical attackers that may try to wear down Reuniclus with a super effective U-turn, forcing them to risk activating Effect Spore. Other Pokemon that resist Dark-type attacks such as Fairy-types like Klefki and Sylveon can also be helpful. Ghost-types like Chandelure and Brambleghast can also easily knock out Reuniclus, so Pokemon that resist Ghost like Incineroar, Alolan Muk, and Krookodile pair well with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Galvantula": {
    "overview": "<p>By setting up Sticky Web, Galvantula can enable wallbreakers like Torterra, Indeedee-M, and Paldean Tauros-W that are otherwise easily revenge killed by faster Pokemon like Inteleon, Choice Scarf Mienshao, and Choice Scarf Hisuian Typhlosion. Galvantula also spreads paralysis quite easily with both Thunder and Thunder Wave. Galvantula, however, can be outsped and KOed by Pokemon with multi-hit moves like Scale Shot Flygon and Triple Axel Mienshao. Notably, Tsareena, one of the best hazard removers the tier has to offer, can use Rapid Spin to clear Sticky Web and then proceed to outspeed and KO Galvantula with Triple Axel or Knock Off the next turn. Another hurdle for Galvantula to overcome is Magic Bounce Espeon, as it always survives one hit from Galvantula as it switches in and can get severe damage off on it before bringing in a revenge killer to finish it off.</p>",
    "comments": "<h3>Other Options</h3> <p>Lunge or Pounce can be used to simultaneously ease setup for Galvantula's partners and prevent it from being taken advantage of as easily. Volt Switch can also be run to circumvent Galvantula's passivity by letting it pivot, and it can save Sticky Web for later if the hazard is removed. Energy Ball can be run to hit Pokemon like Diancie and specially defensive Swampert, but dropping Thunder Wave makes Galvantula quite passive overall. Swarm can be used over Compound Eyes with Thunderbolt replacing Thunder, as Galvantula can then OHKO Espeon with Bug Buzz after being knocked into Swarm range by Psychic. Infestation can be used to trap slower Pokemon, preventing any needless predictions to cover an opponent's switch to Magic Bounce Espeon.</p> <h3>Checks and Counters</h3> <p><strong>Entry Hazard Control</strong>: Due to Galvantula almost always being a lead, it can be easily countered by entry hazard control. Specifically, Magic Bounce Espeon, Taunt Iron Thorns, Defog Talonflame, and Rapid Spin Tsareena can all thwart hazard setting attempts by Galvantula and KO it without difficulty.</p> <p><strong>Multi-hit Moves</strong>: Some Pokemon carry Focus Sash-breaking multi-hit moves like Tsareena and Mienshao, which can run Triple Axel, and certain setup sweepers like Cinccino, Torterra, and Flygon, which typically run Tail Slap, Rock Blast, and Scale Shot, respectively.</p> <p><strong>Ground-types</strong>: Flygon and Torterra can easily boost in front of Galvantula, as they are not OHKOed and can KO Galvantula the next turn with their multi-hit moves. Since Energy Ball is quite rare on Galvantula, Diancie, Quagsire, and specially defensive Swampert can take advantage of it as well by setting their own hazards.</p>",
    "sets": {
      "SPYDER (Sticky Web Lead)": {
        "description": "<h4>Set Details</h4> <p>Sticky Web lets Galvantula enable potent slower setup sweepers like Flygon, Toxtricity, and Porygon-Z. Thunder + Compound Eyes allows Galvantula to hit as hard as possible with great accuracy. It can also spread paralysis to bulkier Pokemon like Dragalge and Registeel that can freely come in otherwise. Thunder Wave can reliably paralyze Flying-types and Pokemon with Levitate that are unaffected by Sticky Web like Talonflame and Cresselia. Tera Ghost on Galvantula is only used in niche situations where forcing Sticky Web to be up by spinblocking Pokemon like Tsareena, Avalugg, and Brambleghast is necessary or there is no strong need to Terastallize another teammate.</p> <p>Setup sweepers that are relatively slow, like Porygon-Z, Chandelure, and Indeedee-M, greatly appreciate foes suffering the Speed drop from Galvantula's Sticky Web. Other setup sweepers that are still outsped even after they boost their Speed like Torterra and Dragon Dance Flygon work magnificently with Galvantula. Galvantula's Sticky Web also tends to get cleared by Tsareena's Rapid Spin and Talonflame's Defog, so spinblockers and Defog deterrents like Chandelure, Hisuian Typhlosion, Kilowattrel, and Galarian Articuno help to dissuade these entry hazard removers. The former two can also run Choice Scarf so that the team has speed control in case Sticky Web is removed. Opposing Choice Scarf users can be difficult to deal with because Pokemon on Sticky Web teams tend to be relatively slow, meaning naturally fast Pokemon like Inteleon, Infernape, and Flygon can work to counteract this issue. Hazards are also quite annoying for Sticky Web teams, especially opposing Sticky Web. Thus, Tsareena can work well as both an offensive threat and a hazard remover. Another hazard remover that works on Sticky Web teams is Focus Sash Brambleghast, as it can also set up Spikes and dent defensive Pokemon with Curse.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Chandelure": {
    "overview": "<p>With Chandelure's tremendous Special Attack and STAB attacks, it can hit the entire tier for at least neutral damage, barring Incineroar. Chandelure, donning a Choice Specs, easily breaks through would-be checks like Diancie and Alolan Muk. However, with Choice Scarf, it becomes a dangerous revenge killer that’s able to check setup sweepers like Munkidori and Mienshao. Chandelure also learns Trick, which allows it to cripple walls and bulky setup sweepers alike such as Umbreon, Incineroar, and Cresselia. However, Chandelure has to deal with being extremely weak to entry hazards, limiting its opportunities to switch in. On top of that, Chandelure itself is quite easily revenge killed due to faster Choice Scarf users that are able to threaten it with their own STAB moves or through coverage moves like Flygon, Mienshao, and Meloetta.</p>",
    "comments": "<h3>Other Options</h3> <p>With a moveset of Will-O Wisp / Pain Split / Energy Ball / Hex, an EV spread of 252 HP / 252 Def / 4 Spe, and a Bold nature, Chandelure, with Heavy-Duty Boots, can become an effective physical wall, spreading burns on the opposing team quite easily; however, most things it would want to check typically carry super effective coverage in Knock Off. Heavy-Duty Boots Chandelure can also run Flame Charge or Trailblaze to pick off weakened threats and sweep with its boosted Speed. Chandelure can run Hex on a status spreading team; however, it must give up a powerful STAB attack, coverage, or Trick to do so. Choice Scarf Chandelure can run Memento on a hyper offense team to try to aid its teammates in setting up once it becomes useless. Chandelure can also run Heavy-Duty Boots or Air Balloon to circumvent its entry hazards weakness and Ground-type weakness, respectively. If it runs these, though, it becomes noticeably weaker and slower.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Dark-types are a pain for Chandelure mostly because they tend to be able to take one attack and retaliate with a Knock Off. Specifically, Incineroar is quite problematic, since it resists all of Chandelure's attacks and is quite specially defensive, but due its to lack of recovery and entry hazards weakness, Incineroar can be chipped over the course of a game and taken advantage of with Trick, giving Chandelure its Heavy-Duty Boots.</p> <p><strong>Ghost-types</strong>: While Chandelure is able to beat Ghost-types like Basculegion, Brambleghast, and Hisuian Typhlosion offensively, it struggles to switch into and take priority attacks from the former two, and more often that not, it will get outsped and KOed by the latter two.</p> <p><strong>Revenge Killers</strong>: With Chandelure's middling Speed, even with Choice Scarf, it is quite easily revenge killed by faster threats. Most notably, faster Choice Scarf users like Flygon and Mienshao threaten Chandelure through their super effective STAB attacks or coverage, respectively.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <p>Fire Blast is preferred to 2HKO Alolan Muk as to not let it switch in safely, but Flamethrower can be used to be more accurate. Energy Ball hits Fire-type checks such as Swampert and Diancie. Trick cripples walls like Umbreon and Incineroar, but Overheat allows Chandelure to overwhelm Incineroar and Assault Vest users like Alolan Muk and Meloetta over the course of a battle. Tera Grass allows Chandelure to take a Ground- or Water-type attack in a pinch while boosting its Energy Ball, but Tera Fire can be used to give it insane breaking power.</p> <p>Chandelure has issues with switching in, so Pokemon that can pivot like Mienshao, Flygon, and Dragalge pair well, drawing in defensive Psychic-, Grass-, and Steel-types such as Galarian Slowbro, Vileplume, and Copperajah for Chandelure to prey on. With Trick crippling specially defensive foes like Alolan Muk and Umbreon, a partner that can take advantage of this like Munkidori or Cresselia helps with overwhelming these shared checks. Pairing Chandelure with Fighting-types like Mienshao, Gallade, and Scrafty helps it take on Dark-types like Incineroar and Alolan Muk, which it tends to struggle against. With how vulnerable Chandelure is to entry hazards, it pairs greatly with hazards removal from Talonflame, Tsareena, and Tentacruel. Vileplume, Wo-Chien, and Tsareena are great teammates for Chandelure, as they check the Ground- and Water-types that scare it out like Flygon, Basculegion, and Inteleon; on top of that, the former two teammates can spread paralysis with Stun Spore.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <p>Fire Blast gives Chandelure a powerful STAB Fire-type attack, but Flamethrower can be run for a more accurate move. Energy Ball hits Fire-resistant Pokemon like Diancie, Vaporeon, and Swampert. Trick cripples walls and bulky setup sweepers like Alolan Muk and Scrafty. When backed into a corner, Tera Grass lets Chandelure take a Water- or Ground-type attack and boosts its Energy Ball, but Tera Fire can help it clean more easily.</p> <p>With how Chandelure fails to do much of anything versus Dark-types like Incineroar and Alolan Muk, partners that can overwhelm, chip away at, or cripple these Pokemon are vital. So, pair Chandelure with teammates like Munkidori, Klefki, and Meloetta. Chandelure's middling Speed means more common opposing Choice Scarf users like Mienshao, Flygon, and Hisuian Typhlosion will easily outspeed and OHKO it. Placing Chandelure on a hyper offense team with Sticky Web support from Galvantula and setup sweepers like Breloom, Drednaw, and Gallade helps it circumvent its disappointing Speed tier and provides it tons of wallbreakers to help it clean weakened teams in the end-game. Chandelure's weakness to being worn down by entry hazards stops it from revenge killing as often as it would want to, so teammates like Tsareena, Talonflame, and Tentacruel are crucial.</p>"
      },
      "Calm Mind": {}
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Mienshao": {
    "overview": "<p>Mienshao is the best offensive pivot in NU thanks to its high Attack stat, great Speed tier, and good coverage. Mienshao is able to threaten most of the tier with its STAB Close Combat, which enables it as a late-game sweeper. Its great Speed paired with Choice Scarf lets it outspeed unboosted Pokemon like Inteleon and Talonflame as well as boosted sweepers like Shell Smash Torterra and Dragon Dance Flygon. Knock Off punishes Mienshao's switch-ins like Galarian Slowbro, Dragalge, and Talonflame as well as Ghost-types that are immune to Close Combat like Chandelure and Brambleghast, while other coverage options like Stone Edge, Ice Spinner, and Poison Jab hit Flying- and Fairy-type switch-ins with super effective damage. On top of that, Regenerator pushes Mienshao above the competition, effectively letting it ignore entry hazards on the switch. Mienshao often plays into high-risk, high-reward scenarios; the threat of using Close Combat is high, as Fighting-resistant Pokemon like Talonflame, Galarian Slowbro, and Vileplume can all switch in and punish it with Flame Body, Rocky Helmet, and Effect Spore, respectively. Even with the risk of Rocky Helmet, Mienshao can still pivot with U-turn on predicted switches, giving it the upper hand. Mienshao's poor bulk is heavily expressed when facing priority users like Breloom and Basculegion as well as faster Choice Scarf users like Infernape and Munkidori.</p>",
    "comments": "<h3>Other Options</h3> <p>Mienshao can use Choice Band to take advantage of its high Attack stat; however, it opens up more opportunities for your opponent to revenge kill Mienshao. Lastly, Triple Axel can be used over Ice Spinner for a stronger Ice-type move, but it is less reliable. Protective Pads lets Mienshao avoid adverse affects for its contact moves like Rocky Helmet, Flame Body, and Effect Spore but provides little else. Assault Vest is another option on the wallbreaker set, giving Mienshao more longevity against special wallbreakers and revenge killers like Diancie and Porygon-Z.</p> <h3>Checks and Counters</h3> <p><strong>Flying-types</strong>: Pokemon like Talonflame and Kilowattrel outspeed non-Choice Scarf Mienshao, can switch into Close Combat, and threaten an OHKO with Brave Bird and Hurricane, respectively. Talonflame is also able to punish Mienshao thanks to Flame Body having a chance to burn. Oricorio-E is freely able to set up against a Choice-locked Mienshao, but it is 2HKOed by Tera Fighting Close Combat unless it runs a very bulky EV spread.</p> <p><strong>Ghost-types</strong>: Chandelure, Basculegion, and Brambleghast can safely switch in against Choice Scarf Mienshao that is locked into Close Combat and threaten it with an OHKO, but they all have to take caution against Knock Off and the possibility of Mienshao not running Choice Scarf, except Choice Scarf Chandelure and Basculegion.</p> <p><strong>Poison-types</strong>: Vileplume and Galarian Slowbro wall Mienshao thanks to adverse damage over time through Rocky Helmet, Toxic, and recovery; the former can also restore all of its HP while simultaneously making Mienshao weaker with Strength Sap. Munkidori resists Close Combat and is naturally faster than Mienshao, often forcing it out by bluffing Choice Scarf.</p> <p><strong>Psychic-types</strong>: Cresselia and Galarian Slowbro resist Mienshao's Close Combat and can force awkward predictions even while they are not on the field. They are both weak to Knock Off, but they can take the hit with the use of Terastallization and then use Mienshao as setup fodder.</p> <p><strong>Physical Walls</strong>: Blanket physical walls such as Slowbro, Avalugg, and Quagsire can make it hard for Mienshao to break through bulkier teams, as they can recover their HP easily and Terastallize if needed. Bulky Fairy-types like Sylveon and Florges resist most of Mienshao's moves, being able to exploit non-Poison Jab variants.</p> <p><strong>Priority Users</strong>: Tera Fighting Breloom as well as Aqua Jet Basculegion both possess strong priority to revenge kill Mienshao, often forcing it to switch out or Terastallize in situations it wouldn't want to.</p> <p><strong>Faster Pokemon</strong>: Choice Scarf Mienshao doesn't have this issue as much as the wallbreaker set, but Choice Scarf users like Munkidori and Infernape as well as Basculegion under rain will always outspeed Mienshao, giving them the opportunity to revenge kill it. Life Orb Mienshao is also outsped by Espeon, Kilowattrel, and Inteleon, all of which threaten it with a KO.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <p>Choice Scarf boosts Mienshao's Speed to become a premier revenge killer, outspeeding the faster threats in the tier like Inteleon, Cinccino, and Kilowattrel. With passable bulk paired with Regenerator, Choice Scarf Mienshao is a great lead, achieving an OHKO or 2HKO against most entry hazard setters and Choice Scarf leads like Flygon and Staraptor. Knock Off punishes Ghost- and Psychic-types like Basculegion, Chandelure, and Galarian Slowbro that try to switch in on Close Combat, while U-turn gives Mienshao momentum through pivoting. Stone Edge hits Flying-types like Talonflame and Kilowattrel that want to punish Mienshao using Close Combat. Ice Spinner hits the previously mentioned Kilowattrel as well as Grass- and Dragon-types like Brambleghast, Tsareena, and Dragalge, but it's usually best to use U-turn against them to bring in a better check or generally keep up momentum and weaken them at the same time. Poison Jab can be used for Fairy-types like Sylveon and Florges; this is not preferred because it isn't strong and can be exploited by Steel-types like Registeel, Lucario, and Copperajah as well as other Poison-resistant Pokemon like Swampert, Flygon, and Dragalge. Regenerator gives Mienshao a lot of longevity that it normally wouldn't have with its other abilities, letting it switch in on weaker attacks and hazards without worrying about losing HP. Tera Fighting gives Mienshao's Close Combat a lot of extra power, allowing it to 2HKO Quagsire, Kilowattrel, and Diancie, as well as having a roll to 2HKO Swampert. Tera Dark boosts Knock Off's damage and defensively helps Mienshao against Psychic-types like Galarian Slowbro, Cresselia, and Munkidori while gaining an immunity to Klefki's Thunder Wave.</p> <p>Mienshao appreciates being able to pivot into Pokemon that can take strong hits from Ghost-, Psychic-, and Fairy-types like Incineroar, Bombirdier, Dragalge, and Munkidori, all of which can pivot back into Mienshao if needed. Munkidori is most noteworthy because of its Toxic Chain ability, spreading Toxic on its U-turns to cripple Mienshao's Fairy- and Psychic-type checks like Sylveon, Florges, and Cresselia. This interaction can weaken the Close Combat switch-ins enough to enable Mienshao to freely click Close Combat later in the battle. Offensive threats that lure in Fairy-types like Breloom, Incineroar, and Tera Steel Flygon help at eliminating Mienshao's checks without weakening it or wasting Close Combat's PP. Choice Scarf variants of Munkidori and Infernape are often what will be used to revenge kill Mienshao; as such Cresselia is a good partner, resisting Munkidori's Psychic and being able to take on Infernape. Mienshao isn't weak to entry hazards thanks to Regenerator, but it is weak to teams that take advantage of it being Choice-locked. With that in mind, having a grounded Poison-type like Vileplume or Alolan Muk and a Defog user like Talonflame or Altaria really helps Mienshao stick around for longer, not having to rely so heavily on Regenerator. Pokemon that can take hits from Mienshao's hard switch-ins like Galarian Slowbro, Talonflame, and Vileplume are needed for its longevity, so Pokemon like Alolan Muk, Diancie, Swampert, and Copperajah all pair nicely with it. Mienshao can't do much to physical walls like Galarian Slowbro, Vileplume, and Tera Poison Avalugg, so it enjoys partnering with a strong wallbreaker like Basculegion or better yet with a special attacking one like Chandelure or Toxtricity. These wallbreakers appreciate Mienshao KOing faster Pokemon like Inteleon, Kilowattrel, and Flygon. Chandelure can also switch into Choice Scarf Infernape's Close Combat, preserving some momentum.</p>"
      },
      "Wallbreaker": {
        "description": "<h4>Set Details</h4> <p>Life Orb boosts Mienshao's power a lot with little drawback thanks to Regenerator, giving it the opportunity to 2HKO Quagsire as well as OHKO Tsareena after some prior damage. Close Combat and Knock Off make a nearly unresisted combination; the latter enables Mienshao to hit Ghost- and Psychic-types that switch in on Close Combat like Chandelure, Brambleghast, and Galarian Slowbro. Close Combat and Knock Off synergize better with Life Orb than Choice Scarf thanks to Mienshao not being locked into one move, giving it a better fighting chance against Psychic- and Ghost-type switch-ins. U-turn retains Mienshao's strong pivoting capability without forcing it to lock into a single move. Stone Edge lets Mienshao take care of Talonflame and Kilowattrel on switch-in. Poison Jab hits Fairy-types like Sylveon and Florges. Fake Out allows Mienshao to revenge kill faster, weaker threats like Kilowattrel, Munkidori, and Swift Swim Kingdra. Swords Dance boosts Mienshao's already high Attack, giving it more of a chance to break past physical walls like Galarian Slowbro, Swampert, and Vileplume. Regenerator gives Mienshao more opportunities to wallbreak while not caring too much about damage from entry hazards, Rocky Helmet, and Life Orb. Tera Fighting boosts Close Combat to absurd levels, but Tera Poison boosts Poison Jab's damage, allowing it to OHKO Tsareena and Florges after a Swords Dance boost. Tera Ghost gives Mienshao many immunities to moves to revenge killers like Close Combat from Infernape and Mach Punch from Breloom; however, it becomes weak to Toxicroak's and Brute Bonnet's Sucker Punch.</p> <p>Swords Dance Mienshao appreciates entry hazard support from Swampert, Diancie, Klefki, and Dragalge to guarantee some KOs it otherwise would not obtain. Toxic Spikes in particular help to break through physical walls like Swampert and Sylveon, which cannot afford to run Heavy-Duty Boots. Faster Pokemon like Talonflame, Inteleon, and Kilowattrel can revenge kill Mienshao, which opens up room for various different walls like Diancie, Milotic, Registeel, and Alolan Muk to be paired alongside it. Choice Scarf users like Staraptor, Flygon, and Basculegion can all work to KO Pokemon that try to use their higher Speed to force Mienshao to switch. Slow pivots like Dragalge, Swampert, and Eject Button Galarian Slowbro can all safely bring in Mienshao. If running U-turn, Dark-types like Bombirdier, Alolan Muk, and Incineroar can all be brought in safely on a predicted Psychic-type move from Indeedee, Meloetta, or Munkidori. A status absorber, especially one that can absorb burns, is very useful to keep Mienshao healthy enough to wallbreak at any time; thus, it naturally pairs well with Milotic, Rest Alolan Muk, and Talonflame.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 126266, "username": "Kiyo"}, {"user_id": 295647, "username": "etern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Golurk": {"sets": {"Choice Band": {}}},
  "Tornadus": {"sets": {"Rain Support": {}, "Bulk Up": {}}},
  "Thundurus": {
    "overview": "<p>Thundurus is a fantastic option on offensive teams thanks to its great mixed offensive stats, excellent Speed tier, amazing offensive movepool, and valuable Ground immunity. It can tweak its moveset to have coverage for just about any defensive check to it, and it's able to set up on some of the most common Choice Scarf users in Krookodile and Flygon. Sadly, though, this defensive utility is a bit hard to make use of, as Thundurus is quite frail and vulnerable to super effective coverage like Krookodile's and Flygon's Stone Edge. In fact, this fragility is such an issue that Mienshao's Tera Fighting Close Combat almost always 2HKOes Thundurus. Additionally, it's very vulnerable to Lycanroc-D's Accelerock as well as other fast attackers like Noivern and Choice Scarf Hisuian Typhlosion.</p>",
    "comments": "<h3>Other Options</h3> <p>Thundurus is not restricted to only being a special attacker and can instead use powerful physical moves to take advantage of unsuspecting foes. STAB Acrobatics allows Thundurus to break through Grass-types that typically give it trouble, like Tsareena and Wo-Chien. This can be accomplished by running an itemless pivot set or a setup sweeper set with Bulk Up + Sitrus Berry or the more gimmicky Swagger + Mirror Herb. It's worth noting, though, that this means Thundurus will take Stealth Rock damage, becoming much easier to revenge kill. Despite its weakness to Stealth Rock, Thundurus can still have a niche as a Choice Scarf user. Its particularly useful Speed tier allows it to outspeed Jolly Cloyster after a Shell Smash, as well as being faster than every other relevant Choice Scarf Pokemon in NU. This Speed can catch an opponent off guard, and with access to two different pivoting moves, it can keep them on the back foot. Thundurus is an acceptable rain setter, with its Electric-type moves threatening bulky Water-types for other attackers like Basculegion and Kingdra, and its U-turn chipping away at shared checks like Tsareena, Vileplume, and Wo-Chien. Finally, Nasty Plot sets can also be used effectively on weather teams by running Weather Ball as a coverage option. Snow gives Thundurus BoltBeam coverage, while rain and sun provide an effective 150-Base Power coverage move as well.</p> <h3>Checks and Counters</h3> <p><strong>Faster Attackers</strong>: While Thundurus does have a great Speed tier, its poor bulk leaves it vulnerable to revenge killers like Choice Scarf Mienshao and Krookodile and powerful priority moves such as Lycanroc-D's Accelerock and Lucario's Extreme Speed. These foes often force Thundurus to Terastallize, which can result in disaster if the opponent predicts correctly. Weather sweepers like Venusaur and Kingdra also pose a great threat, especially if Thundurus lacks Thunder Wave.</p> <p><strong>Setup Sweepers</strong> An unboosted Thundurus can't OHKO Speed-boosting sweepers such as Dragon Dance Flygon and Shell Smash Torterra and is too frail to survive boosted hits. While Thunder Wave can be used to slow down other threats that aren't immune to paralysis, it is often not a worthwhile trade because Thundurus is likely to faint in the process.</p> <p><strong>Special Walls</strong>: Thundurus has many potent coverage options but is unable to cover every defensive threat with just one moveset. Grass Knot is necessary to pressure Rhyperior, Focus Blast is necessary to break through Magnezone, Psychic is needed to deal significant damage to Vileplume and Dragalge, and Flash Cannon smashes Diancie. Additionally, pivot sets may lack the coverage and raw firepower to break many of the same threats, which can lead to a loss of momentum. Also, many generic special walls like Assault Vest Reuniclus and Alolan Muk lack weaknesses to Thundurus's common special attacks and retaliate effectively.</p>",
    "sets": {
      "Nasty Plot": {
        "description": "<h4>Set Details</h4> <p>Focus Blast gives Thundurus a high-power attack that hits many foes for strong neutral damage without the commitment of Terastallizing. It also super effectively damages several targets that are immune to or resist Thunderbolt, like Krookodile, Rhyperior, Magnezone, and Brute Bonnet. Without Focus Blast, the latter two can effectively wall Thundurus and threaten to KO it in return. Grass Knot is another option to hit Ground- and Rock-types super effectively, particularly those with a 4x Grass weakness like Swampert, Rhyperior, and Quagsire. Flash Cannon takes advantage of the STAB boost from Tera Steel, providing a more accurate and decently powerful attack that hits many targets for neutral damage. Notably, this allows Thundurus to break through Diancie, which threatens to KO Thundurus with Diamond Storm or, if Thundurus has Terastallized, Body Press. Lastly, Psychic directly targets Dragalge and Vileplume, but Tera Steel Flash Cannon is often more than enough to deal with them. In addition to buffing Flash Cannon's damage, Tera Steel also affords Thundurus more setup opportunities against foes like Vileplume and Tsareena and prevents Lycanroc-D's Accelerock from revenge killing it as easily. Heavy-Duty Boots is preferred to keep Thundurus out of KO range from Choice Scarf users like Flygon and Krookodile, but Life Orb helps defeat checks like Dragalge and Assault Vest Gallade.</p> <p>The goal of using Nasty Plot Thundurus is to take advantage of free setup turns and sweep through weakened teams. For this reason, it is best used on hyper offense teams with other threatening setup sweepers such as Cloyster and Lycanroc-D. Like with any hyper offense team, a reliable entry hazard lead like Sticky Web Galvantula can give Thundurus and its teammates some protection against revenge killing from grounded Choice Scarf users like Mienshao, Krookodile, and Munkidori, while a lead like Spikes Brambleghast, Stealth Rock Lycanroc, or Meteor Beam Mew can weaken foes just enough to put them within range of some moves after a boost. Finally, allies like Grimmsnarl and Choice Scarf Chandelure with stat-lowering moves like Parting Shot and Memento can weaken foes to the point where Thundurus can take a hit while setting up.</p>"
      },
      "Pivot": {
        "description": "<h4>Set Details</h4> <p>Grass Knot is excellent for hitting Ground-types like Swampert, Rhyperior, and Krookodile. U-turn is the preferred pivoting move for Thundurus, as it cannot be blocked by Ground-types and deals considerable damage to Grass-types like Tsareena, Brute Bonnet, and Wo-Chien, even without significant Attack investment. Alternatively, Volt Switch takes advantage of Thundurus's higher Special Attack and becomes a reliable way to weaken the enemy team once any Electric-immune Pokemon have been removed. Knock Off is one of Thundurus's most consistent progress-making tools, cutting down the longevity of bulky teams by removing key items like Leftovers, Assault Vest, and Heavy-Duty Boots. It also threatens to remove offensive items like Choice Scarf from foes that can't OHKO Thundurus like Flygon, leaving your own sweepers and Choice Scarf users less vulnerable to being revenge killed. In a pinch, Thundurus can use a priority Taunt or Thunder Wave with the help of Prankster, though the loss of coverage is quite detrimental. Tera Steel makes it harder for certain foes like Lycanroc-D and Noivern to revenge kill Thundurus, although it means Thundurus can no longer pivot into Choice-locked Earthquake from foes like Krookodile and Flygon. Since many Choice Scarf users barely pick up the KO against uninvested Thundurus, a slightly bulkier EV spread can be an effective choice. A spread like 116 HP / 20 Def / 120 SpA / 252 Spe survives hits from common Choice Scarf users from full HP like Chandelure's Overheat, Hisuian Typhlosion's Eruption, and Mienshao's and Krookodile's Stone Edge, at the cost of a reduced damage output.</p> <p>As an offensive pivot, Thundurus excels on teams that apply pressure through stacking entry hazards. For this reason, Klefki can be used to switch into super effective attacks aimed at Thundurus, and in return, Thundurus maximizes the effectiveness of Klefki's Spikes through forcing switches and removing durability items with Knock Off. Thundurus also pairs well with powerful physical wallbreakers such as Gallade, Lycanroc-D, and Choice Band Flygon. Thundurus can lure in walls that would typically check it while using U-turn to put its teammates in a position to deal massive damage. Similarly, Thundurus's U-turn frequently weakens foes like Alolan Muk, Tsareena, and Vileplume that expect a different attack, which benefits teammates such as Munkidori, Basculegion, and Flygon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 312113, "username": "Shengineer"}, {"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 583607, "username": "PowerOfMemes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Meloetta": {"sets": {"Choice Item": {}, "Relic Song": {}}},
  "Delphox": {"sets": {"Nasty Plot": {}}},
  "Talonflame": {
    "overview": "<p>In a tier with a number of powerful entry hazard setters, Talonflame soars to the top as a premier pivot with U-turn, spreading burns everywhere it goes with Will-O-Wisp while also being able to remove hazards with Defog. However, Talonflame is not only reserved as a utility option; it can act as a physical wall in a pinch thanks to its ability Flame Body and can invest in its bulk without losing out on Speed or power thanks to its high-Base Power STAB attacks like Brave Bird and Flare Blitz. Talonflame can force out Stealth Rock and Spikes setters like Registeel, Brambleghast, and Klefki by threatening them with Will-O-Wisp and using Defog to remove their hazards. Thanks to its high Speed, it can revenge kill fast threats like non-Choice Scarf variants of Mienshao, Flygon, and Infernape. However, its low offenses really stand out when trying to revenge kill bulkier wallbreakers and Pokemon that resist its STAB moves like Incineroar, Chandelure, and Oricorio-E, all of which can shrug off its attacks and don't care about being burned. Talonflame's reliance on Heavy-Duty Boots is made apparent when it commonly switches into Knock Off users like Mienshao, Copperajah, and Infernape, forcing it to take hazard damage every time it wants to switch in again. Talonflame's poor typing allows some other hazard setters to set up against it for free, like Swampert and Diancie.</p>",
    "comments": "<h3>Other Options</h3> <p>Talonflame can opt for Taunt over Will-O-Wisp, stopping any setup attempts from the likes of bulky Cresselia, Registeel, and Bronzong, but it makes Talonflame a little more passive, especially since it isn't dealing much damage to those Pokemon regardless. Overheat or Flamethrower can be used instead of the other two STAB attacks to hit Vileplume without worrying about Rocky Helmet and Effect Spore, but Overheat's poor accuracy paired with Talonflame's really low Special Attack stat makes it undesirable against most of the tier. Talonflame can boost its Attack with Swords Dance and Bulk Up, which allows it to use Gale Wings's priority boost; however, even after a boost, it is still weak and relies on less-than-ideal moves to sweep with.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Bellibolt, Kilowattrel, Oricorio-E, and Toxtricity have a positive matchup against Talonflame, as they can take a hit from its STAB attacks at any time and threaten to KO it or set up. Rotom-H is especially tricky for Talonflame, as it resists both of its STAB attacks, is immune to burn, and can give it a Choice Scarf with Trick, acting as a hard wall to it.</p> <p><strong>Item Removal</strong>: Common Knock Off users, like Copperajah, Alolan Muk, and Mienshao, and Trick users, like Porygon-Z, Munkidori, and Cresselia, can remove Talonflame's Heavy-Duty Boots, forcing it to take Stealth Rock damage every time it switches in.</p> <p><strong>Rock-types</strong>: Diancie is an entry hazard setter that beats Talonflame thanks to its Rock-type STAB attacks OHKOing it, freely letting it come in and set up hazards any time Talonflame is on the field. Iron Thorns can take advantage of Talonflame variants that lack Will-O-Wisp, giving it an opportunity to set up for free.</p> <p><strong>Water-types</strong>: Vaporeon and Milotic can tank hits from Talonflame, heal the damage off with ease, and retaliate with Scald. Offensive Water-types like Inteleon, Basculegion, and Paldean Tauros-W can also threaten Talonflame, but the first is quite frail, the former two don't like to be burned, and the latter can't switch in if Talonflame carries Brave Bird.</p>",
    "sets": {
      "Utility": {
        "description": "<h4>Set Details</h4> <p>Brave Bird and Flare Blitz have the same Base Power, accuracy, and recoil and can both hit Grass-types like Tsareena, Vileplume, and Brambleghast for super effective damage, so the option for which one you choose is mostly personal preference. Brave Bird additionally hits Fighting-types and Fire-resistant Pokemon like Mienshao, Chandelure, and Flygon. Flare Blitz is better against entry hazard setters; enables Talonflame to hit Steel-types and Flying-resistant Pokemon like Bronzong, Klefki, and Oricorio-E for more damage; and has a small chance to burn. Will-O-Wisp is a more reliable way of burning foes than Flame Body, letting Talonflame burn common switch-ins like Dragalge, Vaporeon, and Diancie and threaten hazard setters that often come in like Swampert, Diancie, and Dragalge. Tera Ghost gifts Talonflame an immunity to Breloom's Mach Punch and it ensures its low Defense isn't taken advantage of by powerful Choice Scarf Fighting-types like Infernape and Mienshao. Alternatively, Tera Ground gives Talonflame an immunity to Electric-type attacks from Kilowattrel and Rotom-H while giving it a Rock resistance, helping it against Diancie and Iron Thorns.</p> <p>Talonflame's main role is to pivot, and thanks to it drawing in Electric- and Rock-type Pokemon, it pairs well with Ground- and Grass-types like Flygon, Vileplume, and Brute Bonnet, which can all exploit its switch-ins. Pokemon that appreciate entry hazard removal like Alolan Muk, Vileplume, and Inteleon also pair well with it. Talonflame also enjoys tanking Fighting-type moves from Mienshao, Infernape, and Breloom, so teammates like Porygon-Z, Incineroar, and Registeel appreciate its presence in battle. Due to its passivity, Talonflame draws in Water-types like Milotic and Vaporeon, which leverages room for Electric- and Grass-type Pokemon like Toxtricity, Rotom-C, and Tsareena to switch in. Bulky offense teams appreciate Talonflame's ability to lure in Electric- and Rock-types due to their passivity in certain matchups, so pivoting into Torterra, Flygon, and Swampert can help create momentum. On balanced structures, Talonflame enjoys having switch-ins for Pokemon like Munkidori and Dragalge, so Steel- and Fairy-types like Bronzong, Copperajah, Klefki, and Sylveon synergize well with it. Diancie, Swampert, and Gastrodon can set up hazards in front of Talonflame without trouble, so Water- and Grass-types like Paldean Tauros-W, Basculegion, Brute Bonnet, and Vileplume can help by safely switching into and threatening to KO these foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 583607, "username": "PowerOfMemes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Florges": {"sets": {"Choice Item": {}, "Calm Mind": {"description": "<p>You can run Wish + Protect on the Calm Mind set to support teammates, but Florges's main niche over Sylveon comes from its access to Synthesis allowing for extra coverage to be run.</p>"}}},
  "Dragalge": {
    "overview": "<p>Dragalge is a staple in NU thanks to its great typing, utility movepool, and access to Adaptability, which let it successfully fulfill both offensive and defensive roles. Bulkier sets can come in on walls like Vileplume and take advantage of them by setting Toxic Spikes, causing the rest of their team to suffer. On the other hand, Choice Specs sets provide a ton of nuking power with Adaptability, allowing Dragalge to break through former counters like Umbreon and Registeel. However, Dragalge lacks good Speed, meaning it often can't retaliate before strong attackers overwhelm it. Bulkier sets are also held back due to a lack of access to recovery moves and Dragalge’s below-average HP. Dragalge’s typing too, at times, can be somewhat limiting, since Ground- and Steel-types are fairly common in NU.</p>",
    "comments": "<h3>Other Options</h3> <p>Scald can be used on bulkier Dragalge sets to try to burn checks like Copperajah and Klefki, but this causes Dragalge to lose out on pressure in Toxic Spikes or momentum in Flip Turn. A moveset consisting of Substitute / Sludge Bomb / Dragon Pulse / Focus Blast or Tera Blast Ground can be used with Leftovers to significantly capitalize on forced switches and take advantage of more passive Pokemon. But this can hurt Dragalge's longevity quite a bit, and, in general, opportunities aren’t too common.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-types like Flygon and Torterra are difficult to handle for Dragalge, as they’re always faster and can hit it with their powerful STAB Earthquake.</p> <p><strong>Steel-types</strong>: Steel-types like Registeel and Tera Steel Sylveon wall Dragalge's STAB moves, meaning they can come in and take advantage of it often and only fear Focus Blast. Also, Klefki loves to come in on any of Dragalge’s attacks and spread status or set Spikes.</p> <p><strong>Psychic-types</strong>: Dragalge struggles against the plethora of Psychic-types like Gallade, Indeedee, and Munkidori. All of these Pokemon easily scare out Dragalge with their Psychic-type STAB moves and also tend to be able to take a hit from it.</p> <p><strong>Special Walls</strong>: Special walls like Alolan Muk, Assault Vest Gallade, Bronzong, and Diancie take on Dragalge’s attacks easily and can threaten it with Knock Off, super effective damage, or a physical attack. All of these Pokemon don’t have a very reliable source of healing, though, so they tend to be whittled down over the course of a battle.</p>",
    "sets": {
      "Bulky Pivot": {
        "description": "<h4>Set Details</h4> <p>Toxic Spikes allows Dragalge to chip away at walls, while Dragon Tail can phaze Dragalge’s checks as well as setup sweepers. Flip Turn works amazingly on Dragalge, letting it act as a bulky pivot that can bring in powerful wallbreakers. The given EV spread allows Dragalge to outspeed Vileplume while giving it some physical bulk to aid with Fighting-types like Mienshao and Infernape. Tera Steel allows Dragalge to take Psychic-, Fairy-, and Dragon-type attacks from foes like Munkidori, Sylveon, and opposing Dragalge. On the other hand, Tera Water alleviates its weakness to Ground-type attacks while giving it an overall strong defensive typing.</p> <p>Toxic Spikes lowers switch rates when your opponent tries to play around them, so Pokemon that can scare out Poison-types and cause switches like Flygon and Future Sight Galarian Articuno can overwhelm your opponents. Partners that can bring in physically defensive Pokemon such as Mienshao and Infernape gift Dragalge with chances to set Toxic Spikes. In the face of Steel-types like Klefki and Copperajah, Dragalge fails to do much, so partners that can take advantage of its Flip Turn and deal with these pests, like Gallade, Mienshao, and Flare Blitz Talonflame, work well. Opposing Dragon- and Fairy-type Pokemon also cause issues for Dragalge, as they’re usually faster and can severely damage or KO Dragalge before it can react. Teammates that help alleviate this weakness such as Sylveon, Registeel, and Copperajah are appreciated. Dragalge’s limited HP also hinders it; to ensure its survival for longer, entry hazard removers or Wish users like Talonflame, Brambleghast, and Vaporeon can be used. Pokemon like Vileplume and Tsareena that can handle more offensive Ground-types such as Flygon and Torterra can help out Dragalge.</p>"
      },
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <p>Sludge Wave is preferred for damage output, but Sludge Bomb can more reliably poison specially defensive Pokemon like Gastrodon and Umbreon. Focus Blast can heavily dent many Steel-types on the switch-in like Registeel, Klefki, and Copperajah. Tera Blast Ground can be used instead to hit these targets more accurately and powerfully along with Alolan Muk; however, this comes at the cost of Terastallizing, making it not as favored of an option overall. For the last move, a way to pivot in Flip Turn is preferred to bring a partner in on a wall it would otherwise have trouble with. The given EVs let Dragalge outpace Vaporeon and Umbreon with the rest poured into HP. An alternative and bulkier EV spread of 120 HP / 252 SpA / 136 Spe can be run, as it gives Dragalge enough Speed to outrun uninvested Sylveon. Tera Poison grants Dragalge a resistance to Fairy while also powering Sludge Wave to preposterous levels; however, a more defensive Tera type like Tera Steel could be used to help Dragalge retaliate after surviving Psychic- and Dragon-type attacks.</p> <p>Dragalge’s low Speed tends to hinder it a lot, but this can be negated with pivot cores. Dragalge draws in Steel-types, but it can use Flip Turn to let Mienshao or Flygon handle them. On the other hand, Mienshao and Flygon themselves can use U-turn after drawing in a physical wall like Vileplume or Quagsire, which Dragalge preys on. Dragalge can also whittle down Steel-types like Copperajah and Registeel over time with a strong Focus Blast, so Pokemon that can take advantage of this such as Munkidori, Reuniclus, and Calm Mind Sylveon enjoy its presence. Special walls like Alolan Muk, Gastrodon, and Registeel love to come in on Dragalge, so strong physical wallbreakers like Gallade and Incineroar work well to deal with these checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Clawitzer": {
    "outdated": true,
    "sets": {
      "Choice Specs": {
        "description": "<p>With Choice Specs and the unique Mega Launcher ability, Clawitzer uses its exceptional coverage to be one of the most devastating wallbreakers in NU. Tera Dragon not only maintains Clawitzer's Water and Fire resistances, but it also turns Clawitzer's Grass and Electric weaknesses into resistances. Further, it gives Clawitzer a more powerful STAB move in Dragon Pulse, which guarantees a 2HKO on common special walls like Umbreon and Assault Vest Eelektross after Stealth Rock. Aura Sphere hits Chansey and Steel-types like Perrserker and Tera Steel Eelektross. U-turn can be used in the fourth moveslot to bring in teammates like Passimian and Toxicroak, which better deal with healthy special walls like Chansey and Umbreon or Tera Fairy threats, allowing Clawitzer to use Dragon Pulse more freely. Flash Cannon can also be used to hit Tera Fairy Pokemon like Chansey, Umbreon, and Vaporeon, which are immune to Dragon Pulse and Water Pulse, in Vaporeon's case. Without Terastallizing, Electric-types like Rotom, Jolteon, and Magneton pose a threat to Clawitzer. Appletun and Electric immunities like Sandaconda and Jolteon work as partners to eat up their moves and restore any HP they lose.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Sylveon": {
    "overview": "<p>Sylveon's great matchup against top threats like Mienshao and Flygon alongside its set versatility makes it one of the premier Fairy-types in NU. Wallbreaking sets can break through common special walls like Alolan Muk and Umbreon. Sylveon can also run a more defensive set, letting it heal up teammates that it naturally synergizes with like Incineroar, Registeel, and Swampert that lack reliable recovery. Sylveon has great Special Defense, letting it take on special wallbreakers like Inteleon and Diancie with little or no investment. However, both of Sylveon's roles are contested by another Fairy-type, namely Florges, as Florges has access to Trick for Choice Specs sets as a way to decommission Steel-types and special walls, and it has higher Speed, meaning its wallbreaking sets can outpace more threats and Wish passing sets can invest more in its Defense. On top of that, Sylveon must compete with other Wish passers such as Vaporeon and Umbreon, which can provide more utility at times with the former having access to Haze and Flip Turn, whereas the latter can provide Thunder Wave and Toxic. Sylveon is also walled immensely by Steel-types like Copperajah and Klefki, but their lack of recovery leaves them susceptible to being worn down over the course of a game. Wish sets also tend to be passive and easily taken advantage of by the aforementioned Steel-types and setup sweepers like Munkidori and Incineroar. Sylveon's subpar Defense can also let it be broken through, as it's typically forced to take Knock Off for its team all while being whittled away at by entry hazards.</p>",
    "comments": "<h3>Other Options</h3> <p>Due to Choice Specs Sylveon already having all the coverage it needs from its first three slots, it can run many moves for its last. Sylveon can opt for Quick Attack as a means to pick off weakened threats. Hyper Beam can be used as a nuke button that's able to chip away at Steel-types heavily but leaves it open the next turn. Sylveon can even forgo Choice Specs entirely and go for a Pixie Plate set that allows it to bluff Choice Specs, surprising its opponent when it changes up its moves; however, Sylveon's overall power drops. On Wish sets, Moonblast + Cute Charm can be run on bulkier teams, as Moonblast has higher PP than Hyper Voice, and if Sylveon is female, it can fish for immobilization via attraction against Pokemon forced to be male like Hitmonlee and Tornadus.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Registeel, Bronzong, and Copperajah all wall Sylveon and can use it to set entry hazards, as they easily threaten it out with their Steel-type STAB moves. While Klefki can also wall Sylveon, use it to set entry hazards, and paralyze it with Thunder Wave, it's more of a stalemate because Klefki fails to do significant damage to Sylveon unless it carries a rare move like Steel Beam. All of these Steel-types must be wary of Tera Blast Ground and, in Bronzong's case, Shadow Ball.</p> <p><strong>Poison-types</strong>: Alolan Muk, Munkidori, Vileplume, and Tentacruel can take a Hyper Voice and threaten back with super effective Poison-type attacks. Dragalge can also take a hit and threaten it, but it can only do this once per game.</p> <p><strong>Chip Damage</strong>: Sylveon, especially when defensive, tends to have to take Knock Off and U-turn for its team, and losing Heavy-Duty Boots or not running it in the first place means entry hazards also chip away at it. All of this combined with Wish taking two turns and possibly being cancelled out due to Roar from Swampert or Whirlwind from Copperajah means that Sylveon can be whittled away at and beaten by wallbreakers it normally beats, like Mienshao and Flygon.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <p>Psychic allows Sylveon to hit Poison-types like Dragalge, Vileplume, and Toxtricity super effectively. However, Psyshock can be run to hit Tentacruel and both Tera Poison Cresselia and Bronzong harder. Shadow Ball gives Sylveon a strong neutral move for the Steel-types that tend to switch into Sylveon like Klefki, Registeel, and Copperajah, and notably, it hits Bronzong super effectively. As Sylveon's last moveslot is its most flexible one, it prefers to run Draining Kiss as a secondary STAB move so that it doesn't get chipped away at as easily. Tera Blast Ground can instead be used to hit the aforementioned non-Bronzong Steel-types that could sit on Sylveon otherwise; however, due to this requiring Terastallization, it typically isn't run. A Modest nature is preferred for the extra damage output, but Timid can be run to outspeed Adamant Incineroar. Tera Fairy allows Sylveon to reach catastrophic levels of damage with its Hyper Voice, as it's now able to 2HKO Fairy-resistant Pokemon like Rotom-H and Vileplume.</p> <p>Sylveon's main roadblock from tearing apart teams is bulky Steel-types like Registeel, Copperajah, and Klefki; however, due to their lack of recovery, there are a few ways its teammates can whittle them down. Entry hazard setters like Brambleghast, Swampert, and Flygon can help to soften up these Steel-types for Sylveon's attacks. Another way to break through these Pokemon is teammates that carry super effective coverage to surprise these Steel-types like Close Combat Staraptor, Focus Blast or Tera Blast Ground Munkidori, and Focus Blast Dragalge. It can also go through more straightforward means such as having a partner like Mienshao, Incineroar, or Flygon to pressure these Steel-types. Incineroar, Flygon, and Infernape greatly enjoy Sylveon as a partner, as they can pivot it in on physically defensive Water-types like Milotic, Swampert, and Vaporeon that wall them. Choice Scarf users like Munkidori, Meloetta, and Porygon-Z enjoy Sylveon wearing away at Steel-types like Copperajah, Klefki, and Registeel. Sylveon easily dispatches Dark-types like Incineroar, Umbreon, and Alolan Muk. Teammates that benefit from this like Meloetta, Cresselia, and Brambleghast pair well alongside Sylveon, as they can form a wallbreaking core together.</p>"
      },
      "Wish": {
        "description": "<h4>Set Details</h4> <p>Calm Mind allows Sylveon to use defensive walls like Vaporeon and Talonflame in its favor, as it can set up on them to become more threatening. On the other hand, Roar prevents Sylveon from needing to risk certain Calm Mind wars like those versus Cresselia and Bronzong, and it doubles as a way to get extra chip damage on Steel-types trying to switch in, forcing them out to rack up entry hazard damage. The Speed EVs allow Sylveon to get the jump on Umbreon and Vaporeon, letting it threaten the former better and avoid having its stat boosts thrown away by the latter's Haze before it can get a hit off. Tera Steel is preferred, as it allows Sylveon to better handle Poison- and Steel-types like Vileplume and Copperajah, provides an immunity to Umbreon's and Quagsire's Toxic, and lets it soft check many special attackers in a pinch like Munkidori, Porygon-Z, and Toxtricity. Tera Poison, on the other hand, maintains Sylveon's matchup against Fighting-types while keeping Tera Steel's utility against Toxic users and poison from Alolan Muk. Alternatively, Tera Water provides a strong defensive typing that doesn't forfeit Sylveon's matchup against both Ground- and Fighting-types like Flygon, Mienshao, and Infernape. Leftovers prevents Sylveon from having to use Wish as often and lets it heal with Protect, but Heavy-Duty Boots is useful to circumvent entry hazard chip damage.</p> <p>Sylveon's access to Wish means it can support Pokemon without reliable recovery like Swampert, Bronzong, and Incineroar. Pokemon like Basculegion, Munkidori, and Registeel that are scared out by Brute Bonnet, Flygon, and Mienshao enjoy having Sylveon to check these threats. Alongside a specially defensive partner like Alolan Muk, Gastrodon, or Copperajah, Sylveon can help to form a defensive backbone for teams. Sylveon also appreciates wallbreakers like Mienshao, Flygon, and Chandelure, as they can pressure Steel-types that typically wall and take advantage of it like Klefki, Copperajah, and Bronzong. Due to Sylveon's reliance on Protect to safely heal, it's vulnerable to setup sweepers like Drednaw, Munkidori, and Gallade, meaning Choice Scarf revenge killers like Ditto and Mienshao or Pokemon with priority like Flygon pair well with it. Sylveon also tends to be a momentum sink, so pivots like Flygon, Incineroar, and Mienshao that do well versus common switch-ins like Alolan Muk, Registeel, and Copperajah can help regain lost momentum. As Sylveon can be easily chipped down by entry hazards and having to switch into Knock Off and U-turn from Pokemon like Mienshao, a second soft check to physical attackers is welcome, so partners like Talonflame, Vileplume, and Dragalge work well to fulfill this role.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Klefki": {
    "overview": "<p>Klefki is an incredibly crafty support Pokemon, making use of its incredible combination of ability, movepool, and typing to bring mayhem to the battlefield. Klefki's Prankster ability lets it scatter Spikes, spread paralysis with Thunder Wave, summon rain and sun, and even boost its own stats before the foe can act; it's a very malleable Pokemon that can find itself on almost any team due to its supportive capabilities. Klefki's highly coveted Steel / Fairy typing makes it a great sponge for special attacks, taking on the likes of Munkidori, Espeon, and Dragalge while also resisting Knock Off and U-turn. Although Klefki has many tricks up its sleeve, offense is not one of them, since it uses paltry base 80 offensive stats and often relies on Foul Play to not be a complete sitting duck. Any means to circumvent Prankster-affected moves such as Magic Bounce, Dark-types, and Taunt can generally spell doom for Klefki. Dark-types like Incineroar, Alolan Muk, and Tera Dark Drednaw can take advantage of Klefki's inability to status them. Despite Klefki's phenomenal defensive typing, its stats often leave much to be desired, meaning some special wallbreakers like Porygon-Z and Indeedee-M can eventually overwhelm it even in spite of a type disadvantage.</p>",
    "comments": "<h3>Other Options</h3> <p>Klefki can utilize its Prankster ability to run a Double Dance set; boosting its Defense with Iron Defense and special stats with Calm Mind while maintaining its health with Draining Kiss to turn Stored Power into an unwallable attack. Klefki can sport a Damp Rock or Heat Rock along with Rain Dance or Sunny Day, respectively, to facilitate those respective weather teams. Klefki can use Eject Button or Red Card in tandem with Prankster Recycle to repeatedly pivot itself or its foe out of play. Klefki can hold onto a Toxic Orb, which won't affect it, and use Switcheroo to bestow it onto an unsuspecting target like Oricorio-E, which can otherwise set up on Klefki safely.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-types like Swampert, Flygon, Gligar, and Swampert are immune to Klefki's Prankster Thunder Wave and threaten it with Earthquake, although they must be wary of Magnet Rise.</p> <p><strong>Bulky Setup Sweepers</strong>: Bulky setup sweepers that can take advantage of Klefki's passivity can be a huge issue for it. Calm Mind Pokemon like Cresselia, Chandelure, and Florges take minimal damage from Klefki's attacks and can accrue multiple boosts while it flounders helplessly.</p> <p><strong>Prankster-immune Pokemon</strong>: Many Pokemon that can ignore Klefki's Prankster-affected moves in one way or another can take advantage of Klefki's relative passivity. Magic Bounce Espeon, Dark-types, and Thunder Wave-immune Pokemon like Oricorio-E and Flygon find safe entry against Klefki and threaten it.</p>",
    "sets": {
      "Spikes Support": {
        "description": "<h4>Set Details</h4> <p>Foul Play enables Klefki to hit physical attackers for big damage it'd be unable to achieve using its own Attack stat, hitting Pokemon like Brambleghast and Gallade. Magnet Rise lets Klefki turn the tables on Ground-types like Flygon, Swampert, and Gligar with the former being weak to Dazzling Gleam. Maximum Special Defense investment lets Klefki deal with powerful special attackers in the tier like Munkidori and Dragalge. Tera Water lets Klefki take Fire-type attacks from Chandelure and Infernape in a pinch.</p> <p>Klefki's specially bulky nature makes it pair excellently with physical walls on balance teams, it is typically seen with Pokemon like Vaporeon and Swampert, as they can handle Fire-types like Infernape and Incineroar. Ghost-types like Chandelure and Brambleghast can block Rapid Spin to maintain Klefki's entry hazards, as do Defog deterrents like Galarian Articuno and Competitive Kilowattrel. Klefki's Prankster Thunder Wave is great speed control for slow, powerful wallbreakers like Choice Specs Chandelure and Toxtricity and Guts Heracross.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Avalugg": {"sets": {"Physically Defensive": {}}},
  "Noivern": {"sets": {"Utility": {}, "Choice Specs": {}}},
  "Diancie": {
    "overview": "<p>Diancie's great typing lets it switch in easily against common dangerous Fire- and Flying-, and Normal-types such as Chandelure, Talonflame, Oricorio-E, and Porygon-Z. With well-rounded stats, Diancie can easily go both offensive and defensive, with its sets being supported by its large movepool. Specially defensive Diancie is a great check to special wallbreakers like Chandelure, Kilowattrel and Hisuian Typhlosion, and it can carry Encore to circumvent its passivity when against setup sweepers. Trick Room sets can easily turn the tables versus faster, more offensive teams, as Diancie can outspeed and KO everything after it gets its Special Attack boost from Meteor Beam.</p>",
    "comments": "<h3>Other Options</h3> <p>Diancie can run Rock Polish for a more permanent Speed boost, but with its low-base Speed, it's easily outpaced by Choice Scarf users like Flygon, Inteleon, and Mienshao even after it boosts. A Sticky Web setter is great for this set, as it attempts to solve Diancie's low speed issue. If there is already a Stealth Rock user on Diancie's team, it can run Spikes instead so that it can continue to provide entry hazard support. Specially defensive sets can run a more specially oriented moveset, with moves like Moonblast, Earth Power, and Power Gem being run over Diamond Storm and Body Press. Diancie can also run a sweeper set with a moveset of Calm Mind / Iron Defense / Draining Kiss / Stored Power, which can take advantage of passive or weaker Pokemon quite well, but it can be easily overpowered by any wallbreaker or Trick, Encore and Taunt users. Diancie can also run offensive sets with Stealth Rock and Spikes, usually with Moonblast and Earth Power supporting it; however it is considered a bit suboptimal, since its bulk is usually appreciated to set entry hazards up safely.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Bulky Steel-types like Bronzong, Registeel, and Copperajah can easily switch in on Diancie and set up entry hazards, forcing it out or making it use Tera in order to survive an attack and KO them. In particular, Bronzong is quite bothersome for Diancie, as it walls its STAB attacks and is immune to Earth Power thanks to Levitate. However, all of these Steel-types lack a form of reliable recovery making them easily overwhelmed over the course of a battle. Both Bronzong and Registeel take a lot of damage from +2 Body Press and +1 Earth Power, respectively, so after some chip damage, Diancie can beat them.</p> <p><strong>Ground-types</strong>: Flygon, Swampert, and Gastrodon are trouble for Diancie, as they threaten Diancie out with their Ground-type STAB attacks and can take advantage of it by setting up entry hazards. If Diancie is running Moonblast, it can somewhat damage them, but if its not, it is an almost free switch-in for them, as Earth Power and Body Press aren't doing enough to threaten them.</p> <p><strong>Water-types</strong>: Offensive or defensive Water-types such as Inteleon, Basculegion, and Vaporeon can all threaten Diancie with their STAB attacks. They can also use Diancie for momentum and pivot with U-turn or Flip Turn, and they can even force Diancie to Terastallize or switch out. Inteleon and Basculegion both cannot deal with Diancie when under Trick Room, as they get defeated before they can act.</p> <p><strong>Grass-types</strong>: Offensive Grass-types such as Torterra and Tsareena make progress against and threaten Diancie; however they can't comfortably switch in on offensive sets. Torterra and Tsareena force Diancie to switch out or Terastallize, and the latter can even remove its Stealth Rock with Rapid Spin. Both of those Pokémon can't defeat Diancie when in Trick Room, as they get KOed first by +1 Moonblast</p>",
    "sets": {
      "Special Wall": {
        "description": "<h4>Set Details</h4> <p>With a specially defensive EV spread, Diancie is able to repeatedly switch into special attacks, giving it opportunities to set up Stealth Rock and fire off STAB Diamond Storm. Body Press hits Steel-types like Copperajah and Registeel trying to switch in on Diancie, and it can take advantage of Diamond Storm's chance to boost its Defense. Encore prevents Diancie's passivity from getting taken advantage of too easily by opposing hazard setters and setup sweepers, such as Klefki and Iron Thorns alike, but Moonblast can be used to be able to hit Ground-types like Swampert and Flygon harder. Tera types for this set are focused on flipping Diancie's matchups. Tera Water gives Diancie a resistance to Steel- and Water-type attacks, letting it finish off Copperajah and Inteleon while maintaining its Fire resistance. However, Tera Steel trades Diancie's matchup against Fire-types for a strong defensive typing thay can take on hits from Munkidori, Sylveon, and Tsareena without issue. Tera Dragon on the other hand lets Diancie take on Rotom-C and Araquanid, but it completely throws away its matchup against Dragalge and Florges.</p> <p>Fire-types like Incineroar and Talonflame make for strong partners because they threaten Steel- and Grass-types that force Diancie out, such as Bronzong, Registeel, Tsareena, and Brambleghast. The aforementioned Grass-types, along with Rotom-C, also have great synergy with Diancie, as it checks Fire- and Flying-types for them. In return, they handle Ground- and Water-types like Flygon, Swampert, and Inteleon. Diancie can't take on physical wallbreakers like Toxicroak and Mienshao too well, so physically defensive Pokemon like Swampert, Dragalge, and Talonflame pair well with it to help check these threats.</p>"
      },
      "Offensive Trick Room": {
        "description": "<h4>Set Details</h4> <p>With an offensive spread, the Trick Room set is capable of taking down many foes. Earth Power offers coverage for the Steel -and Poison-types that can take Diancie's Moonblast comfortably such as Registeel, Copperajah, and Tentacruel. Power Herb allows Diancie to immediately attack and get its Special Attack boost with Meteor Beam. Tera Grass gives Diancie a resistance to Grass-, Ground-, and Water-type attacks while giving it a neutrality to Steel-type moves, letting it set up Trick Room and attack more easily. Alternatively, Tera Ground is an option to boost Earth Power's damage, which is really appreciated to get KOs it wouldn't otherwise.</p> <p>A lead to set up entry hazards such as Brambleghast or Froslass makes for a great partner, as it can help chip checks like Registeel, Alolan Muk, and Tentacruel into range for a KO. Mienshao and Breloom enjoy how Diancie can come in on and take advantage of Talonflame, and with it being downed, they don't need to worry about being revenge killed as easily or getting burned. Pokemon like Flygon, Drednaw, Oricorio-E, Galarian Articuno, and Iron Thorns that can chip away at and weaken Steel-types like Registeel and Copperajah for Diancie pair well with it too.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 644300, "username": "Havocknight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Decidueye": {"sets": {"Swords Dance": {}, "Defog": {}}},
  "Incineroar": {
    "overview": "<p>The combination of Knock Off, good typing, and Intimidate makes Incineroar a great wallbreaker while being a solid defensive Pokemon. Sword Dance sets can make Incineroar into a great wallbreaker, since many defensive staples like Vileplume, Galarian Slowbro, and Registeel just drop to its Swords Dance-boosted STAB attacks. Also, Incineroar easily checks the common Ghost-, Grass-, and Steel-types like Chandelure, Brambleghast, and Klefki, meaning it can take advantage of its utility moves it can go for a more defensively-oriented pivot set if it wishes. It has Will-O-Wisp and Knock Off to cripple incoming physical wallbreakers like Toxicroak, Flygon, and Mienshao and item-reliant Pokemon like Talonflame, Avalugg, and Swampert, respectively. Defensive Incineroar is solid for handling special wallbreakers such as Hisuian Typhlosion, Porygon-Z, and Heavy-Duty Boots Munkidori. However, Incineroar's low Speed stat makes it very easy for wallbreakers with a middling Speed tier like Basculegion, Breloom, and Heracross to outspeed and destroy it with their own STAB attacks. Incineroar's reliance on Heavy-Duty Boots can be felt, since it has to be wary of switching into opposing Knock Off from Tsareena, Alolan Muk, and Wo-Chien. It even has to worry about switching into the Pokemon it checks best, Chandelure, as it carries Trick to cripple Incineroar. Incineroar also lacks any form of recovery, making it easily worn down over the course of a battle.</p>",
    "comments": "<h3>Other Options</h3> <p>Close Combat is an option to hit many foes neutrally like Swampert and Diancie while also hitting foes like Iron Thorns and opposing Incineroar super effectively. Flame Charge gives Incineroar the opportunity to become a late-game cleaner after picking off a weakened threat. Alternatively, Trailblaze can be used alongside Tera Grass to hit Water-types super effectively but it's pretty reliant on Terastallization to do good damage. Iron Head can be used on Swords Dance Incineroar to surprise Sylveon, Diancie, and Florges, but the ability to pivot, boost its Speed, or use a high-Base Power coverage move tends to be better overall. Weakness Policy + Power Trip sets can be used on hyper offense teams, letting Incineroar become a dangerous sweeper. Incineroar has a bunch of usable defensive Tera types, but they are really inconsistent for many teams. Tera Flying helps Incineroar take on Fighting- and Ground-type attacks, but it retains its weakness to Stealth Rock. Tera Grass gives Incineroar a resistance to Water- and Ground-type attacks but gives it a bad matchup against opposing Fire-types like Chandelure, Infernape, and Hisuian Typhlosion.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Vaporeon, Milotic, and Swampert can switch into its Flare Blitz and threaten Incineroar back with their own STAB attacks, but they have to be wary about switching into a boosted Knock Off from Swords Dance sets. Offensive Water-types like Inteleon and Basculegion, while they have to be worried about switching into its Knock Off, can easily destroy it. Quagsire is notable for shutting down Incineroar sweeps due to Unaware and punish it back by spreading Toxic or hitting Incineroar with its STAB Earthquake.</p> <p><strong>Ground-types</strong>: Flygon, Swampert, and Quagsire destroy Incineroar with their STAB Earthquake, but they have to be wary about switching into Will-O-Wisp from bulkier sets.</p> <p><strong>Fighting-types</strong>: Mienshao, Toxicroak, and Breloom outspeed Incineroar and destroy it with their STAB Fighting-type attacks. Infernape and Paldean Tauros-W resist both of Incineroar's STAB attacks and use it as setup fodder.</p> <p><strong>Rock-types</strong>: Diancie and Iron Thorns can tank Incineroar's STAB attacks very well and use it to set up Stealth Rock or hit it back with their STAB Rock-type attacks.</p> <p><strong>Item Displacement</strong>: Common Knock Off users like Tsareena, Alolan Muk, and Wo-Chien can threaten Incineroar by removing its Heavy-Duty Boots, making it a lot weaker to entry hazards. On top of this, Pokemon it would love to switch into like Chandelure, Munkidori, and Porygon-Z often carry Trick to cripple it.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h4>Set Details</h4> <p>U-turn allows Incineroar to pivot on, chip away at, and not get taken advantage of by its checks like Swampert and Diancie. Earthquake, on the other hand, provides a powerful attack that has no drawback that also hits the common Rock-, Poison-, and Fire-types like Iron Thorns, Dragalge, and opposing Incineroar. An Adamant nature can be used to allow Incineroar to 2HKO Pokemon like Alolan Muk and Talonflame, but a Jolly nature is useful for outspeeding foes like Modest Choice Specs Sylveon and unboosted Torterra. A specially defensive spread of 248 HP / 212 SpD / 48 Spe with a Careful nature can alternatively be used on Swords Dance sets, allowing Incineroar to safely handle Cresselia while letting it better pivot into foes like Chandelure, Munkidori, and Meloetta; the Speed EVs let Incineroar outpace foes like Brute Bonnet and Alolan Muk. Tera Poison gives Incineroar an immunity to poison from Alolan Muk and Vileplume while having a resistance to Fighting-type attacks. However, Tera Fairy provides a more well-rounded defensive typing that isn't weak to Ground-type attacks while still resisting Fighting-type attacks, giving opportunities for Incineroar to set up against Fighting-types like Mienshao, Toxicroak, and Breloom.</p> <p>Incineroar can partner with other pivots like Rotom-C, Flygon, and Swampert, which tend to draw in Grass-types like Brute Bonnet, Vileplume, and Tsareena for Incineroar to prey on and form a VoltTurn core able to chip away at each other's checks. Entry hazard removers like Brambleghast, Tsareena, and Tentacruel can be great partners, since they can remove entry hazards if Incineroar loses its Heavy-Duty Boots. Incineroar can struggle against bulky Water-types like Vaporeon, Quagsire, and Swampert that can tank its STAB attacks, so it pairs with Pokemon like Toxicroak, Rotom-C, and Vileplume, as they can check the aforementioned Water-types. Fairy- and Poison-types like Sylveon, Dragalge, and Vileplume appreciate Incineroar for checking Steel-types like Registeel, Klefki, and Bronzong; in return, they can check Fighting-types like Mienshao, Infernape, and Gallade.</p>"
      },
      "Defensive Pivot": {
        "description": "<h4>Set Details</h4> <p>Will-O-Wisp allows Incineroar to cripple its common switch-ins like Diancie, Swampert, and Gallade. Parting Shot can be used to weaken foes, pivot, and provide safety for setup sweepers. However, U-turn can be used because it allows Incineroar to pivot out from Diancie and Registeel that would usually be immune to Parting Shot due to their Clear Body ability. The given EV spread allows Incineroar to get the jump on Brute Bonnet while having as much special bulk as possible. Tera Fairy provides it the ability to check Dragon- and Fighting-types like Flygon, Mienshao, and Gallade while also letting it resist the omnipresent U-turn. Alternatively, Tera Dragon gives Incineroar the ability to check a myriad of special attackers like Toxtricity, Vileplume, and Inteleon. Tera Water is similar to Tera Dragon but replaces a Grass resistance for an Ice resistance, making Incineroar better against Inteleon.</p> <p>Grass-types like Tsareena, Brambleghast, and Vileplume are great partners for Incineroar, since they can handle bulky Water- and Ground-types such as Vaporeon, Swampert, and Gastrodon. Fighting-types like Mienshao, Toxicroak, and Infernape can force Incineroar to switch, so it best pairs with physically defensive Pokemon like Galarian Slowbro, Bellibolt, and Sylveon that can handle the aforementioned Fighting-types. Additionally, Sylveon can provide Incineroar with recovery by passing it a Wish. Wallbreakers like Inteleon, Munkidori, and Toxtricity appreciate Incineroar's slow Parting Shot, as they can get a free entry on Rock-, Fighting-, and Water-types that tend to switch in on Incineroar. Setup sweepers like Calm Mind Cresselia, Swords Dance Toxicroak, and Dragon Dance Flygon similarly appreciate Incineroar's Parting Shot weakening foes and it giving them more opportunities to set up. Incineroar's longevity is limited and can be cut severely if it loses its Heavy-Duty Boots, so it pairs well with entry hazard removers such as Tsareena, Tentacruel, and Brambleghast.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Oricorio-Pom-Pom": {
    "overview": "<p>Oricorio-E's access to both Quiver Dance and Taunt alongside Roost means, unlike other setup sweepers, it can repeatedly beat common counterplay like Haze, Toxic, Encore, Whirlwind, and Trick. Its typing is also a huge boon in this department, as it's immune to Klefki's Thunder Wave and resists popular physical attackers' STAB moves like Mienshao's Close Combat and Breloom's Bullet Seed while blanking Flygon's Earthquake entirely. On top of that, since these Pokemon are often Choice-locked, they can become setup fodder for Oricorio-E. However, Oricorio-E must have two turns to become fully set up, as many Pokemon that are faster than it like Mienshao, Munkidori, and Inteleon often carry Choice Scarf and can still outspeed it after one boost. It also struggles to get much done versus offensive teams because they excel at outspeeding and overpowering Oricorio-E before it can amass enough boosts. Flying-resistant Pokemon like Iron Thorns, Diancie, and Copperajah are also big roadblocks for Oricorio-E.</p>",
    "comments": "<h3>Other Options</h3> <p>Oricorio-E can run Hurricane for more breaking power, but it then gets completely walled by Wind Rider Brambleghast, especially if it lacks Revelation Dance. Oricorio-E can also run a support set with Air Slash / U-turn / Roost / Defog, but this is generally considered a waste of its other talents due to there being better options for entry hazard control.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Steel-types such as Registeel, Copperajah, and Bronzong can wall Oricorio-E, and when against non-Taunt sets, they can set entry hazards, phaze it, and start boosting themselves. Klefki is notable as well due to Prankster giving its status moves priority, meaning Oricorio-E must Terastallize into a Steel-type to avoid a Toxic Orb poisoning from its Switcheroo. However, Taunt shuts all of them down, barring Klefki, and both Registeel and Copperajah must be cautious of Tera Ground Revelation Dance sets.</p> <p><strong>Rock-types</strong>: Diancie walls Oricorio-E and forces it out with Diamond Storm or Meteor Beam. Because of this, it can typically take advantage of its free turn and set up hazards or Trick Room. Iron Thorns walls Oricorio-E as well, and it can take advantage of its free turns with Dragon Dance. But, these Rock-types must be cautious of Tera Ground Revelation Dance, as it easily deals with these threats.</p> <p><strong>Powerful Wallbreakers</strong>: Strong wallbreakers like Chandelure, Dragalge, and Staraptor have enough power to overwhelm Oricorio-E early on, and because of this, they can effectively stop setup. However, once Oricorio-E collects enough boosts, these Pokemon are no longer adequate answers.</p>",
    "sets": {
      "Quiver Dance": {
        "description": "<h4>Set Details</h4> <p>Air Slash circumvents Brambleghast's Wind Rider unlike Hurricane, and greater accuracy is preferred to higher power, as Oricorio-E can simply amass more boosts to compensate. Taunt is preferred, as Oricorio-E's sweep is easily stopped by status moves like Toxic, Roar, and Trick, and Oricorio-E is also typically tasked with having to take out bulkier Pokemon like Umbreon, Gastrodon, and Sylveon, so this helps block recovery as well. However, on builds that can already comfortably handle bulkier teams, Oricorio-E can opt for Revelation Dance to have a second STAB move to throw off, letting it deal with Haze users like Vaporeon and Milotic and opposing Oricorio-E more easily. Heavy-Duty Boots lets Oricorio-E not worry about Stealth Rock, but Grassy Seed can be run on Grassy Terrain teams to ease setup. The given EV spread allows unboosted Oricorio-E to outspeed Brambleghast and Porygon-Z with the rest put in Defense to help with setup. Tera Steel gives Oricorio-E resistances to common attacks like Inteleon's Ice Beam, Dragalge's Draco Meteor, and Cinccino's Tail Slap, and it also eases setup by providing a Toxic immunity. In contrast, Tera Fairy provides a strong defensive typing that maintains Oricorio-E's resistance to Fighting-type attacks. If Oricorio-E is running Revelation Dance, then it should opt for Tera Ground, as this lets it hit Iron Thorns, Diancie, and Copperajah, which otherwise resist Air Slash, super effectively.</p> <p>As most Oricorio-E sets run Air Slash as their only attack, Flying-resistant foes like Bronzong, Diancie, and Copperajah can stop it from sweeping. However, these checks lack reliable recovery, so they can be easily overwhelmed by wallbreakers such as Sylveon, Porygon-Z, and Toxtricity or setup sweepers such as Galarian Articuno, Cinccino, and Trick Room Diancie. These partners are especially effective when used alongside entry hazard setters like Klefki, Flygon, and Swampert. Lures like Iron Head Incineroar also synergize well with Oricorio-E, as they're good at surprise KOing its checks like the aforementioned Diancie. Pokemon that pressure these checks such as Chandelure, Flygon, and Mienshao are also appreciated because they can force them out, racking up hazard chip on them as they try to come back in. If it runs Grassy Seed, Oricorio-E requires Thwackey as a partner, and it appreciates Terrain sweepers like Grafaiai, Sceptile, and Hitmonlee because the former two can wear down Steel-types, while the latter can easily take them out. Revelation Dance sets, on the other hand, prefer to have partners like Heracross, Sylveon, and Choice Band Flygon that are better at breaking through bulkier teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Lycanroc-Dusk": {
    "overview": "<p>Lycanroc-D is one of the most effective revenge killers and wallbreakers that NU has to offer. It boasts one of the best base Speed stats in the tier and carries strong STAB priority in Accelerock for faster foes. Its strong, Tough Claws-boosted attacks, often boosted further by Swords Dance, deal immense damage even to neutral targets. It also has fantastic coverage, with Close Combat to burst through physical walls like Avalugg and Registeel, Crunch to break Slowbro and Reuniclus, and Psychic Fangs to crack Vileplume or Dragalge. The sheer variety of coverage available to it, including options like Sucker Punch and Stone Edge, makes predicting and countering Lycanroc-D incredibly difficult. Lycanroc-D's poor bulk is its main weakness; it can struggle to cleanly switch in, and finding time to set up a Swords Dance can be difficult. Life Orb recoil and entry hazards can further wear it down, limiting Lycanroc-D's staying power. Lycanroc-D can also be revenge killed by several of the Choice Scarf users in the tier, notably Mienshao, Flygon, and Krookodile. Walls like Swampert and Vileplume can also take a few hits if Lycanroc-D cannot set up with Swords Dance.</p>",
    "comments": "<h3>Other Options</h3> <p>Lycanroc-D can use Tera Ghost defensively in order to avoid Close Combat from revenge killing threats like Mienshao, but offensive Tera types are preferred to maximize damage output. A Focus Sash lead set with Stealth Rock / Accelerock / Close Combat / Taunt is a great enabler of hyper offense teams, as Lycanroc-D is still quite strong without a boosting move or item and is fast enough to reliably set its entry hazard.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Vileplume switches into most of Lycanroc-D's moves well, with the exception of Psychic Fangs. Rocky Helmet chip damage helps further wear Lycanroc-D down, and Effect Spore has the potential to activate on every one of Lycanroc-D's attacking options besides Stone Edge. Bulky Tsareena can take Close Combat, is immune to Accelerock, and can threaten Lycanroc-D with Rapid Spin or an OHKO with Power Whip. Venusaur in sun can also outspeed and threaten Lycanroc-D.</p> <p><strong>Water-types</strong>: Slowbro, Swampert, and Quagsire all take at least one hit from Lycanroc-D and threaten it back with super effective damage. Feraligatr and Basculegion can also threaten it offensively with Aqua Jet.</p> <p><strong>Ground-types</strong>: Swampert and Quagsire tank unboosted Close Combat adequately, while Flygon and Krookodile are capable of switching into anything but Close Combat while often using Choice Scarf to outspeed and potentially OHKO Lycanroc-D with Earthquake.</p> <p><strong>Revenge Killers</strong>: Very few threats in the tier can naturally outspeed Lycanroc-D, but for those that do, Lycanroc-D is forced to use a relatively weak priority move in Accelerock. Raikou, along with Choice Scarf users like Mienshao and Flygon, can take an Accelerock and threaten Lycanroc-D back with super effective attacks.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h4>Set Details</h4> <p>Lycanroc-D has significant power and Speed without any boosts, but Swords Dance pushes it even further. Accelerock is a strong priority STAB move that hits faster Pokemon like Talonflame, Noivern, and Thundurus for super effective damage. Close Combat is an excellent coverage move that hits large portions of the tier for neutral or super effective damage. Notably, it hits walls such as Avalugg and Registeel, almost always OHKOing Avalugg at +2. Pokemon resistant to Accelerock, such as Swampert and Rhyperior, also dislike switching into Close Combat, particularly after a Swords Dance boost. The addition of Tera Fighting allows an unboosted Lycanroc-D to 2HKO Swampert and Quagsire. Sucker Punch can replace Close Combat for an even stronger priority move on Tera Dark variants, letting Lycanroc-D OHKO Choice Scarf Mienshao. Crunch, often in combination with Tera Dark, allows Lycanroc-D to OHKO Slowbro at +2 after Stealth Rock, and always OHKOes Reuniclus. Alternatively, Psychic Fangs beats Poison-types like Vileplume, defensive Dragalge, and Tera Poison Slowbro with ease. Life Orb provides some immediate power without the boost of Swords Dance, giving it solid revenge killing potential upon entering the field.</p> <p>One of Lycanroc-D's primary weaknesses is its bulk, which makes it difficult to switch in, particularly when it also takes entry hazard damage. As a result, Lycanroc-D benefits greatly from pivoting teammates to bring it in without taking a hit. Slow pivots, such as Magnezone and Swampert, can take the hit themselves, safely bringing Lycanroc-D in, while fast, strong pivots like Noivern can scare out opposing Pokemon to bring Lycanroc-D in for free. Special attackers such as Dragalge, Magnezone, and Thundurus appreciate Lycanroc-D's ability to blow holes in special walls like Alolan Muk, and in return they can wear down common physical walls like Slowbro and Quagsire. On hyper offense teams, particularly those using Galvantula to set up Sticky Web, Lycanroc-D's threat potential is only increased, allowing it to outspeed dangerous Choice Scarf users like Mienshao and Infernape. Grass-types, primarily Rapid Spin users like Tsareena and Brambleghast, also pair well with Lycanroc-D, threatening common Ground-type checks like Swampert and Quagsire and removing the hazards that would otherwise chip away at Lycanroc-D's HP. Teammates like Slowbro and Talonflame can switch in on threatening revenge killers like Mienshao and Krookodile, and Slowbro can also help check opposing Talonflame, which threatens to cripple Lycanroc-D with Flame Body burns.</p>"
      },
      "All-out Attacker": {
        "description": "<h4>Set Details</h4> <p>Accelerock provides priority that's useful against the few threats in the tier that outspeed Lycanroc-D, dealing super effective damage to Noivern, Talonflame, and Thundurus. It also provides an option to pick off Shell Smash sweepers like Cloyster and some weakened Choice Scarf users, such as Chandelure and Hisuian Typhlosion. Close Combat can OHKO specially defensive Registeel, 2HKO Avalugg, and serve as a strong neutral coverage move in response to many other threats. Tera Fighting Close Combat can also guarantee 2HKOs on Swampert and Quagsire. Crunch cleanly 2HKOes Slowbro and Reuniclus, and Psychic Fangs 2HKOes Vileplume and OHKOes all but the most physically bulky Dragalge. Sucker Punch provides Lycanroc-D with a stronger priority move than Accelerock that's not resisted by the Choice Scarf Ground-types that try to revenge kill it. Stone Edge is a stronger STAB move than Accelerock, and unlike the rest of Lycanroc-D's options, it does not risk activating contact-based abilities like Effect Spore and Flame Body. With Choice Band, Stone Edge cleanly 2HKOes Vileplume. Life Orb provides less immediate power but more flexibility at the cost of some HP, while Choice Band provides maximum immediate damage at the cost of locking Lycanroc-D into a move.</p> <p>Slow pivots like Magnezone, Swampert, and Incineroar can take a hit and cleanly switch into Lycanroc-D, getting it onto the field without taking damage. Teammates like Tsareena, Brambleghast, and Feraligatr can break through bulky Water- and Ground-types that could otherwise tank multiple hits, such as Slowbro and Swampert. Strong special attackers, such as Magnezone, Thundurus, and Porygon-Z, support Lycanroc-D by breaking through the physical walls, like Slowbro and Quagsire, that can check it. Rapid Spin users like Tsareena and Brambleghast, as well as Defog users like Talonflame, pair well with Lycanroc-D, removing entry hazards that hurt its already limited longevity. Galvantula, as the premier Sticky Web setter in the tier, also pairs well with Lycanroc-D, allowing it to outspeed and OHKO Choice Scarf users like Mienshao and Infernape that would otherwise pose a threat to it. Defensively, teammates like Slowbro and Talonflame can take Close Combat and Earthquake from potential revenge killers like Mienshao and Krookodile, and Slowbro further checks Talonflame, which potentially threatens Lycanroc-D with a Flame Body burn on every attack except Stone Edge.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Mudsdale": {"sets": {"Defensive": {}}},
  "Salazzle": {"sets": {"Utility": {}, "Nasty Plot": {}}},
  "Tsareena": {
    "overview": "<p>Tsareena is NU's best entry hazard remover, and for good reason: it easily beats the plethora of Grass-weak hazard setters like Rhyperior, Swampert, and Diancie, and even Steel-types such as Klefki and Registeel are inconsistent at beating it one-on-one. While offensive Tsareena profiles as a solid wallbreaker that can take over games thanks to Rapid Spin's Speed boost, defensive sets are fantastic at checking the swathes of offensive Ground-types in NU, especially Krookodile and Flygon, and its access to Synthesis is a huge factor in it outclassing Brambleghast, its primary competition. Tsareena faces some very real struggles defensively, though, as almost every Ground-type it aims to check carries super effective coverage, like Gunk Shot from Krookodile and Megahorn from Rhyperior, that threatens to KO it with minimal chip damage required. Offensive sets aren't very fast without a Speed boost and easily pressured by other wallbreakers like Chandelure and Munkidori as well as fast utility options in Noivern and Talonflame. Meanwhile, defensive sets are quite easy to exploit due to their reliance on Knock Off with Pokemon like RestTalk Alolan Muk, Vileplume, and Dragalge.</p>",
    "comments": "<h3>Other Options</h3> <p>Tsareena has other usable Tera types than the ones listed, but they lack consistency across teams. Tera Dark is good for teams that lack a Ghost resistance and amps up Knock Off's damage, but it offers little else. Tera Ghost is a harder answer to Fighting-types than Tera Poison, but it's just as bad into Krookodile and gives Tsareena a horrible Alolan Muk matchup. Tera Fire is similar to Tera Dragon in helping Tsareena against Fire-types, although Tsareena gains a Water weakness. Choice Scarf sets are good at revenge killing priority-reliant setup sweepers like Lycanroc-D and Lucario and don't have to worry about Klefki's Thunder Wave.</p> <h3>Checks and Counters</h3> <p><strong>Flying-types</strong>: All of Talonflame, Noivern, and Acrobatics Thundurus outspeed Tsareena and beat it with relative ease. Talonflame hates losing its item, though, and both Noivern and Thundurus are vulnerable to Triple Axel from offensive sets.</p> <p><strong>Poison-types</strong>: Alolan Muk is a great Tsareena answer, especially if it's RestTalk. Other Poison-types like Dragalge, Vileplume, and Munkidori are good checks but less consistent. The former two cannot survive Knock Off followed by Triple Axel, while the latter is too frail to take Knock Off from either Tsareena set.</p> <p><strong>Fire-types</strong>: Incineroar counters Tsareena with ease, only fearing the rare High Jump Kick. Although Knock Off obliterates Chandelure and Hisuian Typhlosion, they both can spinblock Tsareena, tank its Power Whip, and OHKO it with their Fire-type attacks barring a well-timed Terastallization.</p>",
    "sets": {
      "Offensive": {
        "description": "<h4>Set Details</h4> <p>Tsareena doubles as a source of entry hazard removal and a potent wallbreaker. Knock Off punishes switch-ins such as Talonflame and Magnezone while obliterating Chandelure, and Triple Axel deletes opposing Grass-types like Vileplume, Venusaur, and Rotom-C as well as Noivern. If you wish to tap further into Tsareena's utility movepool, U-turn is optional over Triple Axel, still giving it an out against any of its checks while enabling its stronger teammates. High Jump Kick is another coverage move you can try, as it's Tsareena's best option for hitting Steel-type hazard setters like Copperajah and Registeel and does good damage to Incineroar. Heavy-Duty Boots lets Tsareena bypass hazard damage, which increases its proficiency as a spinner, but Lum Berry helps against Talonflame's Flame Body and Slowbro's Scald. Tsareena usually shouldn't be Terastallizing, but Tera Dragon potentially lets it KO a Chandelure or Hisuian Typhlosion with Knock Off and gives Tsareena a good sun matchup, while Tera Steel blanks Munkidori's STAB moves, potentially lets Tsareena beat Cloyster, and helps it against Alolan Muk.</p> <p>Tsareena is great at luring in and beating certain Poison-types like Dragalge, Vileplume, and Venusaur with Triple Axel; make sure to pair it with teammates like Mienshao, Thundurus, and Sylveon that can take advantage of this. Furthermore, Mienshao especially, as well as other physical attackers like Gallade and Infernape, appreciate Tsareena removing Talonflame's Heavy-Duty Boots and making it easier to overwhelm with Stealth Rock up. Similarly, teammates like Choice Specs Noivern, Chandelure, and Hisuian Typhlosion all appreciate Tsareena's Rapid Spin, and the latter two can beat Steel-type checks like Klefki, Registeel, and Magnezone for Tsareena. Talonflame is perhaps the most common switch-in to Tsareena, so Pokemon like Diancie and Slowbro that easily switch into it are helpful to have.</p>"
      },
      "Defensive": {
        "description": "<h4>Set Details</h4> <p>Bulky Tsareena is one of the tier's few good answers to the plethora of offensive Ground-types in NU, such as Flygon, Krookodile, and Rhyperior. Although they possess super effective coverage moves for it, they can't OHKO it, and Synthesis keeps Tsareena healthy throughout the game so it can stay out of KO range from these threats. The biggest boon to this set, though, is destroying Klefki; it can't do enough damage with Foul Play thanks to the bulk investment, and Power Whip or Trop Kick will slowly beat it down. Trop Kick can be used over Power Whip for its accuracy, but you lose out on useful damage rolls like 2HKOing Diancie, 2HKOing Assault Vest Reuniclus after Stealth Rock, and OHKOing Krookodile. The Speed EVs ensure Tsareena outspeeds Modest Diancie before it can attack with Meteor Beam, but Tsareena can go even faster if it wants, with relevant targets including Modest Magnezone, Torterra, and Adamant Feraligatr. Tsareena will rarely want to Terastallize, but Tera Poison is nice to consistently answer Fighting-types like Mienshao and non-Meteor Mash Lucario and makes Tsareena immune to poison from Alolan Muk at the cost of becoming weak to Earthquake; Tera Dragon aids against Fire-types like Hisuian Typhlosion and retains several resistances to types like Water, Grass, and Electric; and Tera Steel is useful for checking Fairy- and Poison-types such as Sylveon and Munkidori as well as Cloyster.</p> <p>Tsareena creates great defensive cores with common entry hazard setters like Diancie and Rhyperior. They resist Fire and Flying for Tsareena, while it takes on Water- and Ground-type attacks in return. Its Knock Off support is also favored by many offensive Pokemon, specifically Fighting-types like Mienshao, Gallade, and Infernape, since Tsareena so frequently draws in Talonflame and removes its Heavy-Duty Boots. Stealth Rock-weak Pokemon like Choice Specs Chandelure, Choice Specs Noivern, and itemless Thundurus also desire Tsareena for its Rapid Spin.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 295647, "username": "etern"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Palossand": {"sets": {"Physical Wall": {"description": "<p>Scorching Sands allows Palossand to possibly burn targets, but Earth Power provides more power. Sludge Bomb can be preferred over Shadow Ball to hit Grass-types upon switch-in and to fish for poison against bulkier Pokemon. No item allows Palossand to switch in to Poltergeist users like Brambleghast, and it can even wall it with Tera Dragon. On top of that, it receives decreased Knock Off damage, improving its matchup against Toxicroak even more. Alternatively, Leftovers provides recovery, and Rocky Helmet helps to punish physical attackers.</p>"}}},
  "Minior": {"sets": {"Shell Smash": {}}},
  "Thwackey": {"sets": {"Terrain Setter": {}}},
  "Inteleon": {
    "overview": "<p>Inteleon's Speed tier and sky-high Special Attack make it a formidable threat in NU. Not only is it blazing fast, but with Choice Specs, it's also quite powerful and can 2HKO many common special walls like Alolan Muk, Copperajah, and Assault Vest Galarian Slowbro on the switch with Hydro Pump. Even when facing Water-immune Pokemon like Gastrodon, Toxicroak, and Vaporeon, Inteleon still has a way to flip the matchup in its favor in its U-turn, which lets it bring in teammates like Breloom, Flygon, and Toxicroak to take advantage of these checks. On the other hand, Inteleon does face a bit of competition from Basculegion and Paldean Tauros-W, as the former can switch up its moves because it largely uses Mystic Water, the latter has Intimidate, and both have access to priority and easily fit coverage for Toxicroak; however, it isn't hindered by contact punishment such as Talonflame's Flame Body and Vileplume's Rocky Helmet and Effect Spore. It also has to deal with not being able to use its strongest move when up against teams with Water-immune Pokemon, which greatly halts Inteleon's progress-making, as it's almost always forced to use U-turn against them if it doesn't want to give up momentum.</p>",
    "comments": "<h3>Other Options</h3> <p>Inteleon can also run a Scope Lens + Sniper set that is similar to its Choice Specs moveset except with Hydro Pump being traded out for Snipe Shot. When landing a critical hit, Inteleon can dent many Pokemon, but its unreliability makes it weaker overall. Choice Scarf Inteleon reaches a blisteringly fast Speed tier and, with its high Special Attack and U-turn, easily revenge kills many setup sweepers and can create momentum. A moveset of Hydro Pump / Ice Beam / U-turn / Taunt can be run alongside Heavy-Duty Boots to bother passive Pokemon that would easily take advantage of Inteleon otherwise like Alolan Muk, Vaporeon, and Bronzong. Inteleon can drop U-turn in favor of running a second STAB move, like Surf or Snipe Shot, alongside Hydro Pump, letting it choose the right move depending on its situation; however, losing momentum versus Water-immune and -resistant Pokemon can be annoying at times. Tera Blast Grass can be run to snipe Water-immune Pokemon like Vaporeon and Gastrodon, but because Inteleon has to Terastallize to make use of it and already has access to U-turn, it typically is unnecessary and thus isn't used. Tera Dark can be used to boost Dark Pulse, letting Inteleon have a chance against checks like Vaporeon and Milotic, especially after they've been chipped.</p> <h3>Checks and Counters</h3> <p><strong>Water-immune Pokemon</strong>: All of Vaporeon, Gastrodon, and Toxicroak blank Inteleon's STAB attack, and the former two can take the rest of Inteleon's attacks decently well, though the latter drops to Ice Beam. However, with access to U-turn and strong coverage moves, Inteleon can find ways around these matchups.</p> <p><strong>Water- and Dragon-types</strong>: Basculegion and Milotic can switch into Inteleon's Hydro Pump and Ice Beam and proceed to use it for momentum, but neither of them enjoy switching in on a Dark Pulse. Similarly, Dragalge can take Inteleon's Hydro Pump decently but dislikes having to take an Ice Beam.</p> <p><strong>Grass-types</strong>: Brambleghast, Tsareena, and Breloom can take Inteleon's Hydro Pump and proceed to KO it with their Grass-type STAB moves, but they can't do this repeatedly. Similarly, bulkier Grass-types like Brute Bonnet and Vileplume can switch into Hydro Pump and threaten with Seed Bomb or Giga Drain, respectively; however, the former's lack of recovery and the latter's poor Special Defense leads them to being overwhelmed. On top of this, all of these Grass-types must fear Ice Beam.</p> <p><strong>Revenge Killers</strong>: Due to Inteleon's frailty, faster Pokemon like Kilowattrel and Choice Scarf users like Mienshao and Munkidori easily threaten Inteleon with a KO and can use it for momentum, but they fail to switch in reliably with their lack of bulk.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <p>Hydro Pump is the preferred STAB option due to its power, but it can be unreliable at times. Alternatively, Surf can be run for accuracy in exchange for power. Ice Beam complements Inteleon's Water-type STAB move really well by hitting Grass-types like Rotom-C and Vileplume super effectively. Dark Pulse provides Inteleon with a coverage move so that it isn't completely useless against Water-types like Vaporeon and Basculegion. U-turn allows Inteleon to pivot on even Water-immune Pokemon like Gastrodon and Vaporeon. Instead of Ice Beam or Dark Pulse, Inteleon could opt for Air Slash to better target Toxicroak and Paldean Tauros-W, but its lower Base Power means that it's worse at breaking through other Water-immune and -resistant Pokemon. Tera Water boosts Inteleon's STAB move to insane levels, but Tera Ghost allows Inteleon to avoid priority like Breloom's Mach Punch and resist Flygon's First Impression while blanking high-Base Power attacks like Mienshao's and Infernape's Close Combat.</p> <p>Inteleon forces in bulky Water-immune and -resistant Pokemon like Gastrodon, Vaporeon, and Tsareena, and it can capitalize on this with U-turn, letting it bring in a threat that takes advantage of them like Brambleghast, Toxicroak, or Incineroar. Toxicroak is an especially noteworthy partner, as it walls the most common Inteleon switch-in in Vaporeon and can use it as either setup fodder or a chance to throw out high-Base Power attacks. In return, Inteleon handles Fire- and Ground-types for the former two and can easily overwhelm physical walls Flygon brings in. Inteleon is quite powerful, but to achieve any of its 2HKOs, especially those against Water-type checks like Milotic and Vaporeon, it requires entry hazards to chip away at its foes; Copperajah, Bronzong, Gligar, and Klefki all synergize well to fill this role. Even without entry hazards, however, most special walls that do not resist Inteleon's STAB attacks like Bronzong, Alolan Muk, and Assault Vest Galarian Slowbro have a hard time switching in, as Bronzong is 2HKOed right away and Alolan Muk and Assault Vest Galarian Slowbro are 2HKOed after minimal chip damage. Special attacking partners like Diancie, Munkidori, and Nasty Plot Toxicroak make for good teammates, as they greatly appreciate Inteleon's ability to overwhelm their checks. Inteleon is threatened by Grass- and Electric-types like Tsareena, Rotom-C, and Kilowattrel, so Grass-types and Flying-resistant Pokemon like Vileplume, Wind Rider Brambleghast, and Diancie make for strong switch-ins to these threats. With Inteleon's frailty, it prefers to have slow pivots like Tsareena, Dragalge, and Incineroar, as they can draw out Fire- and Ground-types for Inteleon to threaten.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Drednaw": {"sets": {"Shell Smash": {}}},
  "Coalossal": {"sets": {"Physically Defensive": {}}},
  "Appletun": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<p>Appletun acts as one of the tier's premier special walls thanks to its fantastic defensive typing and plethora of utility options, which let it consistently check Pokemon like Lurantis, Jolteon, and Eelektross. Although Appletun might seem passive, Apple Acid prevents special walls like Umbreon and Ursaring from sitting on it because of the Special Defense drops. Leech Seed helps weaken Poison-, Flying-, and Bug-types like Muk, Articuno, and Scyther that are all capable of shrugging off Apple Acid while also allowing Appletun to check powerful setup sweepers like Coil Eelektross and Dudunsparce thanks to the extra health it provides. Dragon Tail adds another option to deal with setup sweepers while forcing Pokemon that want to switch into Appletun to take another round of entry hazards, working wonderfully in tandem with Spikes setters like Qwilfish. Alternatively, Dragon Pulse makes for a powerful STAB coverage option that can hit Grass-resistant foes like Scyther and Drifblim. Heavy-Duty Boots helps Appletun check strong special attackers like Pyroar, Rotom, and boosted Veluza consistently with hazards up, but Leftovers can also be used for the extra recovery. Tera Steel helps Appletun flip the script on Pokemon like Scyther, Muk, and Tera Ice Jolteon that traditionally answer it. Tera Steel also helps Appletun against Pokemon like Ursaring, Indeedee-F, and Clawitzer that all pack super effective coverage for it.</p> <p>Because of Appletun's weakness to Poison-types like Muk and Swalot, Sandaconda and Qwilfish make for fantastic defensive partners, also sporting Rocky Helmet to punish U-turns targeted at Appletun. Additionally, Electric-types like Rotom and Eelektross can threaten Flying-types like Scyther and Articuno.</p>"
      },
      "Choice Specs": {},
      "Eject Pack Pivot": {}
    },
    "credits": {"writtenBy": [{"user_id": 509790, "username": "Pokeslice"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Toxtricity": {"sets": {"Wallbreaker": {}}},
  "Grimmsnarl": {"sets": {"Offensive": {}, "Bulk Up": {}}},
  "Pincurchin": {"sets": {"Terrain Setter": {}}},
  "Indeedee": {"sets": {"Terrain Setter": {}, "Choice Item": {"description": "<p>Calm Mind should only be used on sets including Trick, so Indeedee can take advantage the newly Choice-locked target</p>"}, "Calm Mind": {}}},
  "Copperajah": {"sets": {"Defensive": {}}},
  "Basculegion": {"sets": {"Choice Item": {}, "Assault Vest Pivot": {"description": "<p>The allotted speed EVs allow Basculegion to outspeed base 60 Speed Pokemon such as Magnezone and Incineroar.</p>"}}},
  "Pawmot": {"sets": {"Wallbreaker": {}}},
  "Bellibolt": {"sets": {"Physically Defensive": {}}},
  "Kilowattrel": {"sets": {"Pivot": {}, "Rain Sweeper": {}}},
  "Mabosstiff": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Mabosstiff is fast enough to surprise and revenge kill normally faster threats like Rotom, Haunter, and Choice Scarf Passimian while still being annoying to switch into thanks to Stakeout. Play Rough nails Dark- and Fighting-types like Umbreon, Tera Dark Vaporeon, and Passimian. Psychic Fangs 2HKOes defensive Poison-types like Muk and Qwilfish after some chip and OHKOes Toxicroak. Destiny Bond can remove unsuspecting threats like Scyther as well as setup sweepers like Eelektross, Ursaring, and Jolteon, with Choice Scarf usually letting Mabosstiff act first. Use Destiny Bond carefully, though, as it becomes much easier to play around once it's been revealed. Tera Dark boosts Crunch's power, but Tera Fairy can be used instead to strengthen Play Rough and get rid of Mabosstiff's Fighting and Bug weaknesses. Entry hazard support from Qwilfish and Chansey is very helpful, allowing Mabosstiff to 2HKO walls like Sandaconda on the switch in with Tera Dark Crunch as well as clean with greater ease. Strong wallbreakers like Medicham, Ursaring, and Clawitzer are good at making up for Mabosstiff's low raw damage output. In return, Mabosstiff can potentially create openings for them with Destiny Bond and check nuisances like Indeedee-F and Toxicroak.</p>"
      },
      "Choice Band": {
        "description": "<p>Mabosstiff is an amazing wallbreaker in NU due to its great offensive typing and coverage coupled with Stakeout. Stakeout's boost means even the most reliable Dark-resistant Pokemon like Paldean Tauros and Umbreon struggle to switch in consistently. This often forces Pokemon weak to Crunch like Bruxish, Drifblim, and Farigiraf to Terastallize or give up a KO to a Stakeout boosted attack. Play Rough takes out Dark-resistant foes like Paldean Tauros, Umbreon, and Passimian. Psychic Fangs hits Qwilfish and Fighting-types, like Passimian and Toxicroak, with an added niche of breaking screens. Retaliate is difficult to switch into after a teammate has been KOed. Facade can keep a statused Mabosstiff useable. Tera Dark boosts Crunch's damage output while Tera Fairy powers up Play Rough and grants a resistance to U-Turn and Fighting moves from Passimian. Offensive checks to Mabosstiff, like Scyther and Choice Scarf Passimian, can often gain momentum by forcing it out, so teammates with a Rocky Helmet like Sandaconda and especially Poison Point Qwilfish are helpful. Fast sweepers and late-game cleaners like Choice Scarf Passimian and Quiver Dance Vivillon appreciate Mabosstiff's wallbreaking, as they may otherwise be worn down by the opposing team.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 620268, "username": "skippergamez"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509790, "username": "Pokeslice"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Brambleghast": {"sets": {"Offensive Utility": {}, "Defensive": {}, "Choice Band": {}}},
  "Bombirdier": {"sets": {"Stealth Rock": {"description": "<p>U-turn provides unwallable pivoting, but Parting Shot can be used to lower the foe's offenses but gets stopped by Magic Bounce Espeon and Clear Body Diancie and Registeel. The Speed EVs help to outpace Adamant Incineroar, letting Bombirdier use Knock Off and pivot before getting attacked.</p>"}}},
  "Orthworm": {"sets": {"Coil": {}, "Utility": {}}},
  "Flamigo": {"sets": {"Choice Item": {}}},
  "Cetitan": {"sets": {"Belly Drum": {}}},
  "Veluza": {
    "overview": "<p>Fillet Away in conjunction with Sharpness-boosted STAB moves turns Veluza into a terrifying sweeper capable of shredding teams with only a single turn of setup. Veluza is an excellent choice for hyper offense teams, where it acts as a deadly wallbreaker and late-game cleaner. Veluza can easily find setup opportunities against passive foes, such as Vaporeon, and Choice-locked foes, such as a Passimian that just used Close Combat. Although Veluza is extremely powerful after setting up, it may not always get the chance to do so due to its frailty. Veluza's defensive typing is also relatively poor; it is weak to common attacks, including pivoting moves like U-turn from Scyther and Volt Switch from Rotom. Furthermore, Veluza's speed and firepower are rather mediocre prior to setup.</p>",
    "comments": "<h3>Other Options</h3> <p>Tera Ground enables Veluza to turn the tables on a Jolteon or Rotom trying to grab momentum with Volt Switch. Tera Electric is another option that lets Veluza avoid paralysis from Chansey and Sandaconda while also turning its Electric weakness into a resistance.</p> <h3>Checks and Counters</h3> <p><strong>Offensive Pressure</strong>: Veluza's mediocre bulk and need to sacrifice half of its health to set up means that sufficient offensive pressure can prevent it from taking over a game.</p> <p><strong>U-turn and Volt Switch</strong>: Veluza's poor defensive typing renders it weak to both U-turn and Volt Switch, which means that foes such as Jolteon and Scyther can easily gain momentum on or KO it.</p> <p><strong>Cacturne</strong>: Cacturne is immune to Psycho Cut and Aqua Cutter, enabling it to completely wall any Veluza not running Tera Fairy Tera Blast.</p>",
    "sets": {
      "Physical Sweeper": {
        "description": "<h4>Set Details</h4> <p>Fillet Away is one of the best setup moves in the game, doubling Veluza's Speed and power at the cost of half its health. Aqua Cutter and Psycho Cut are both boosted by Sharpness, and after a Fillet Away will OHKO many neutral targets, such as Rotom, Mabosstiff, and Clawitzer. For Veluza's last move, Substitute can be used to ease prediction, facilitate setup, and avoid Sucker Punch. Aqua Jet can also be used to revenge kill weakened foes and, after setup, outprioritize other priority moves such as Lycanroc's Accelerock. Tera Blast is an option with Tera Fairy to blast past Cacturne, which otherwise completely walls it. Otherwise, Tera Water is good choice to further boost the power of Veluza's Aqua Cutter, giving it a guaranteed OHKO on specially defensive Umbreon after Stealth Rock. Sitrus Berry helps Veluza set up sucessfully, and 4 HP EVs ensure that it will activate after a Fillet Away. An Adamant nature is preferred to maximize Veluza's damage output, but a Jolly nature enables Veluza to outspeed Timid Farigiraf prior to setup and Choice Scarf Zoroark post-setup.</p> <p>Veluza's incredible Speed and power after setup make it an excellent choice for hyper offense teams. Entry hazard support from Lycanroc and Qwilfish can help chip Veluza's checks into range of its attacks. Bulk Up Paldean Tauros is a great partner for Veluza, as it can easily switch into and set up against Pokemon that give Veluza trouble, such as Cacturne. In return, Veluza can set up on Pokemon used to revenge kill or force out Paldean Tauros, like a Choice Scarf Indeedee-F locked into Psychic or Psyshock. Paldean Tauros also helps Veluza break past shared walls in Vaporeon and Tera Water Sandaconda, enabling one of them to sweep late-game. Other good offensive partners to pair with Veluza include Jolteon and Quiver Dance Vivillon. Jolteon provides an Electric immunity for the team while also giving Veluza points of entry through Volt Switch. Vivillon threatens Cacturne, and its Sleep Powder may cripple one of Veluza's checks, allowing it to sweep. Indeedee-F is another good teammate for Veluza, as Psychic Terrain shields Veluza from priority attacks, such as Sucker Punch, while boosting the power of Psycho Cut to absurd levels.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 423085, "username": "Deezcastforms"}]}]}
  },
  "Dudunsparce": {"sets": {"Coil": {}, "Calm Mind": {}}},
  "Scream Tail": {"sets": {"Utility": {}}},
  "Brute Bonnet": {"sets": {"Tank": {"description": "<p>Synthesis can be used instead of extra coverage on Covert Cloak sets.</p>"}}},
  "Iron Thorns": {"sets": {"Dragon Dance": {}, "Lead Entry Hazards Setter": {"description": "<p>23 Attack IVs alongside a Timid nature ensues Iron Thorns boosts its Speed with Booster Energy.</p>"}}},
  "Wo-Chien": {"sets": {"Defensive": {}}},
  "Munkidori": {
    "overview": "<p>Munkidori is a strong special attacker and pivot. Its typing allows it to hit much of the tier for at least neutral damage with its STAB moves, with Sludge Bomb and Sludge Wave targeting Fairy- and Grass-types like Sylveon and Tsareena, while Psychic and Psyshock target Poison- and Fighting-types like Vileplume and Breloom. Munkidori's Nasty Plot set loves to capitalize on the switches that it forces against these Pokemon, and with its excellent Speed tier, it can outspeed common threats like Mienshao and Flygon. Munkidori's U-turn is also incredibly potent, as it easily spreads poison with Toxic Chain to chip away at walls like Diancie, Incineroar, and Umbreon so that it can KO them more easily later. It also runs moves like Focus Blast and Tera Blast Ground to hit its poison-immune checks such as Steel-types like Copperajah and Registeel and Poison-types like Alolan Muk. Trick can also limit opposing setup sweepers like Cresselia and Iron Thorns or cripple specially defensive walls upon switch-in like Bronzong and Alolan Muk. However, Munkidori is vulnerable to opposing Dark-types like Incineroar and Brute Bonnet and can be limited by Steel-types if not carrying sufficient coverage. Its poor bulk also means it can be easily revenge killed by faster Choice Scarf users like Inteleon and Infernape or Pokemon with priority such as Sucker Punch Toxicroak and Aqua Jet Basculegion.</p>",
    "comments": "<h3>Other Options</h3> <p>Fake Out is a niche option that can be used on Toxic Chain sets with the intention of giving Munkidori as many opportunities as possible to poison the opposing Pokemon. Parting Shot can also be used as an alternative to U-turn, avoiding contact and lowering the foe's stats, but Munkidori's main draw is its ability to poison Pokemon without having to waste a turn using a status move like Toxic. Psychic Noise can also be used on pivot sets while attempting to chip down bulkier foes, preventing them from recovering while a more effective attacker switches in. Grass Knot is a niche option alongside Tera Grass to target potential threats like specially defensive Swampert and Gastrodon but leaves Munkidori helpless against Steel-types. Tera Fairy can also be used as an alternative to Tera Fighting that maintains Munkidori's resistance to Fighting-type attacks at the cost of the potential boost to Focus Blast. Frisk is an option to regularly gain information on the foe's items but loses the potential status effects and chip damage of Toxic Chain.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Dark-types, such as Incineroar, Brute Bonnet, and Tera Dark Toxicroak are immune to Munkidori's Psychic-type STAB moves and threaten it back with powerful moves like Knock Off and Sucker Punch. However, with access to moves like Sludge Wave, Focus Blast, Tera Blast Ground and the ability to Terastallize into a Dark-resistant Tera type, they must be cautious.</p> <p><strong>Steel-types</strong>: Steel-types such as Copperajah, Klefki, and Registeel can handle Munkidori's STAB attacks easily, forcing it to rely on coverage like Focus Blast and Tera Blast Ground or its teammates to break through. They also are immune to poison, preventing Munkidori from wearing them down with Toxic Chain.</p> <p><strong>Revenge Killers</strong>: While Munkidori, particularly with Choice Scarf, is quite fast, it can be outsped and its physical bulk is somewhat lacking, meaning faster Choice Scarf users like Inteleon and Infernape and priority such as Basculegion's Aqua Jet and Brute Bonnet's Sucker Punch can easily pick it off it its health gets low enough.</p> <p><strong>Specially defensive Poison-types</strong>: Alolan Muk and Assault Vest Galarian Slowbro can be difficult for Munkidori to break through due to their bulk, strong defensive typing, and immunity to being poisoned.</p>",
    "sets": {
      "Pivot": {
        "description": "<h4>Set Details</h4> <p>Sludge Bomb provides a greater chance of poisoning the foe, while Sludge Wave provides greater power. Psychic targets physically defensive walls like Vileplume and Galarian Slowbro, notably OHKOing Vileplume after Stealth Rock. However, Psyshock gives Munkidori an answer to specially defensive Poison-types like Tentacruel and Tera Poison Calm Mind Cresselia. U-turn lets Munkidori pivot and possibly poison specially defensive walls switching in like Diancie and Umbreon. Focus Blast targets Steel-types like Copperajah and Dark-types like Incineroar, 2HKOing both. Tera Blast Ground is a viable alternative that better targets Alolan Muk, which is 2HKOed after Stealth Rock. On Choice Scarf sets, Trick allows Munkidori to cripple walls like Alolan Muk and Registeel and setup sweepers like Dragon Dance Flygon and Calm Mind Cresselia. Heavy-Duty Boots allows Munkidori to pivot frequently and lets it not be locked into a move. On the other hand, Choice Scarf makes Munkidori one of the fastest Pokemon in the tier, as it is only outsped by opposing Choice Scarf users like Infernape and Inteleon. Tera Fighting works twofold; it lets Munkidori resist Dark-type attacks and boosts the power of Focus Blast. Tera Ground, however, should only be used alongside Tera Blast. A defensive Tera type of Tera Flying also works on Munkidori, as it helps it avoid Earthquake from Flygon and retains its Fighting resistance.</p> <p>Munkidori benefits from teammates that can break through special walls, such as Copperajah, Bronzong, and Alolan Muk, that it struggles to deal with itself. Physical wallbreakers like Gallade, Infernape, and Mienshao help to take care of the specially defensive Steel- and Dark- types that might otherwise give Munkidori trouble. In return, Munkidori handles physical walls like Vileplume, Dragalge, Sylveon, and Avalugg. Entry hazard setters like Swampert and Klefki can be useful teammates, as their hazards alongside Munkidori's constant pivoting and threat of poison can help wear down foes over time and get them into range for Munkidori to finish them off. The poison caused by Toxic Chain makes bulky teammates like Avalugg, Vaporeon, and Sylveon good teammates, as it lets them stall out foes more easily with poison chipping away at them.</p>"
      },
      "Nasty Plot": {
        "description": "<h4>Set Details</h4> <p>At +2, Psychic OHKOes Galarian Slowbro and Avalugg, while Psyshock OHKOes Vileplume. A Nasty Plot-boosted Sludge Wave OHKOes Assault Vest Brute Bonnet, while Sludge Bomb gives Munkidori a higher chance to poison foes. Focus Blast lets Munkidori deal with Umbreon and Copperajah more easily, but boosted Tera Blast Ground can be used, as it handles Alolan Muk and Incineroar more reliably. U-turn could also be used as a last move so that Munkidori can support its team early-game, but it then heavily relies on its teammates to deal with Steel-types. Heavy Duty-Boots allows Munkidori to repeatedly switch in without concern for entry hazard chip damage, letting it use Nasty Plot repeatedly over the course of a battle. Tera Fighting is used to further boost Focus Blast's damage while letting Munkidori resist Dark-type attacks, while Tera Ground is used alongside Tera Blast to blow through checks like Alolan Muk. Tera Flying is used defensively against opposing Ground-type attackers like Swampert or Flygon, providing additional opportunities to boost with Nasty Plot.</p> <p>Pokemon that can overwhelm opposing Steel- and Dark-types are appreciated by Munkidori, so teammates like Cinccino, Porygon-Z, and Brambleghast pair well with it. Hazard setters like Swampert, Diancie, and Klefki can set up Stealth Rock or Spikes to further wear down opposing walls, and on hyper offense builds, hazard-setting leads like Froslass and Brambleghast work well alongside Munkidori. Since Dark- and Ground-types like Incineroar, Tera Dark Toxicroak, and Choice Scarf Flygon threaten Munkidori, teammates such as Diancie, Dragalge, and Talonflame provide switch-ins for these sweep-ending threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  }
}