{
  "Charizard": {"sets": {"All-Out Attacker": {}, "Belly Drum": {}}},
  "Sandslash": {"sets": {"Rapid Spin": {}, "Swords Dance": {}}},
  "Venomoth": {"outdated": true, "sets": {"Offensive Quiver Dance": {}, "Quiver Dance + Disable": {}}},
  "Dugtrio-Alola": {"outdated": true, "sets": {"Fast Attacker": {}}},
  "Persian-Alola": {"outdated": true, "sets": {"Defensive Pivot": {}, "Choice Scarf": {}, "Nasty Plot": {}}},
  "Primeape": {"outdated": true, "sets": {"Offensive Stealth Rock": {}, "Bulk Up": {}, "Suicide Lead": {}}},
  "Poliwrath": {"outdated": true, "sets": {"Bulk Up": {}}},
  "Victreebel": {"sets": {"Sun Sweeper": {}}},
  "Magneton": {"sets": {"Offensive Pivot": {}, "Choice Specs": {}, "Choice Scarf": {}}},
  "Dodrio": {"sets": {"Swords Dance": {}}},
  "Muk": {"outdated": true, "sets": {"Defensive": {}, "Assault Vest": {}}},
  "Electrode-Hisui": {"sets": {"Offensive Pivot": {}}},
  "Exeggutor-Alola": {"sets": {"Choice Specs": {}, "Offensive Trick Room": {}, "Bulky Attacker": {}}},
  "Hitmonlee": {"sets": {"Terrain Sweeper": {}}},
  "Hitmonchan": {"sets": {"Bulky Rapid Spin": {}, "Swords Dance": {}}},
  "Weezing": {"sets": {"Physical Wall": {}}},
  "Rhydon": {"sets": {"Bulky Stealth Rock": {}, "Swords Dance": {}}},
  "Tauros": {"outdated": true, "sets": {"All-Out Attacker": {}}},
  "Jolteon": {
    "overview": "<p>With Speed only eclipsed by Hisuian Electrode backed up with good power, Jolteon establishes itself as a premier fast pivot. Its fast Volt Switch makes it an easy candidate on VoltTurn teams, and its adequate coverage with Alluring Voice and Shadow Ball discourages specially bulky Pokemon like Virizion and Mesprit from switching into it. Jolteon's decent set variety means it can be a deadly Calm Mind sweeper or a dangerous wallbreaker with Choice Specs. Jolteon's defensive utility with Volt Absorb and passable special bulk also makes it a situational switch-in to special attackers like Articuno, Cramorant, and Rotom. However, the lacking power of its coverage moves causes it to struggle quite hard against specially defensive Pokemon like Snorlax and Dudunsparce as well as Ground-types like Rhydon. Said Ground-types make Jolteon quite reliant on Terastalization to bypass its checks, which causes it to demand for more team support. Jolteon also faces competition from Hisuian Electrode, which boasts higher Speed and an additional Grass subtyping that allow it to beat Ground-types instead of being walled by them.</p>",
    "comments": "<h3>Other Options</h3> <p>On Choice Specs sets, Tera Blast Water can be used as a coverage move to drench Ground-types like Sandaconda and Sandslash. Tera Blast Ice and Tera Blast Fire both threaten Jolteon's Grass-type checks, with the former even targeting Ground-types. However, slotting Tera Blast makes Jolteon more reliant on team support to weaken its checks, and Terastalizing Jolteon into an Ice- or Fire-type requires entry hazard removal. Jolteon still gets walled by Grass-types if running Tera Blast Water. Tera Blast Flying allows Jolteon to beat Hisuian Electrode and gives it an immunity to Ground-type moves, though it once again demands hazard removal.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Specially defensive Pokemon like Snorlax and Regirock are not particularly bothered by even Choice Specs Jolteon, as they have the bulk to weather repeated hits and can threaten huge damage on it back with their respective STAB moves.</p> <p><em><strong>Ground-types</strong></em>: Specially bulky Ground-types like Toedscool and Rhydon are Jolteon's biggest obstacles, preventing it from pivoting and threatening to OHKO it with their STAB moves. They can proceed to set up Stealth Rock against it, with the latter even using it setup fodder. However, Ground-types that have mediocre special bulk like Sandaconda, Sandslash, and Palossand, must be wary of Jolteon's Choice Specs-boosted coverage.</p> <p><em><strong>Grass-types</strong></em>: Shaymin's excellent natural bulk and Hisuian Electrode's resistances to Jolteon's entire moveset bar Shadow Ball make them the two most reliable Grass-type switch-ins, with both able to threaten it back with their own STAB moves. Other Grass-types like Hisuian Decidueye, Alolan Exeggutor, and Virizion are similarly effective but must watch out for coverage options.</p> <p><em><strong>Revenge Killers</strong></em>: Despite being the second fastest unboosted Pokemon in the metagame, Jolteon has mediocre longevity and can get picked off easily by faster Choice Scarf users like Bruxish, Passimian, and Mesprit without too much trouble; the aformentioned Hisuian Electrode can even pick off Jolteon without using a Choice Scarf. All of these Pokemon can also pivot on it in return, causing Jolteon's teammates to lose momentum. Slower cleaners or wallbreakers with priority moves like Sneasel and offensive Hisuian Decidueye can exploit Jolteon's low physical bulk without too much prior damage.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>After one Calm Mind boost, Jolteon's Thunderbolt 2HKOes unboosted Orthworm. Volt Switch maintains momentum and allows it to escape bad matchups like Snorlax, Regirock, and Virizion. Jolteon's fourth moveslot is flexible and can depend on the team's need for coverage. Alluring Voice discourages certain Grass-types like Virizion and Hisuian Decidueye from switching in and also targets Dragon-types like Dipplin and Alolan Exeggutor that would be comfortable switching into its Electric-type STAB moves. It also hits Tera Dragon users like Sandaconda and Regirock, walls that would otherwise switch into Jolteon without too much trouble. Shadow Ball hits Psychic-types like Uxie and Mesprit harder than any of its STAB moves do while also hitting Ghost-types like Palossand and Mismagius quite hard. While Jolteon's Tera type is flexible, Tera Blast Ice synergizes the best when striking back at its overall checks, hitting Ground-types like Sandaconda and Rhydon and Dragon-types like Alolan Exeggutor and Dipplin. However, this comes at the cost of using up the Terastallization slot. Tera Fairy and Tera Ghost, on the other hand, strengthen Alluring Voice and Shadow Ball, respectively, and make Jolteon slightly better at taking Fighting-type attacks from Pokemon like Passimian and Virizion. Volt Absorb allows Jolteon to switch in against predicted Electric-type attacks from Pokemon like Rotom and opposing Jolteon.</p> <p>Jolteon's blistering Speed makes it a prime candidate for VoltTurn teams, pairing well with pivots like Mesprit, Passimian, and Hisuian Decidueye. In addition to pivoting, they all can provide utility with Knock Off. Knock Off support works especially well with Jolteon, as its Volt Switch is able to put more pressure on Pokemon reliant on items like Leftovers and Heavy-Duty Boots for longevity, such as walls like Snorlax and Hisuian Decidueye. Wallbreakers like Bruxish and Glastrier benefit from Jolteon's Volt Switch and can capitalize on its checks. Grass- and Water-types like Shaymin, Virizion, Qwilfish, and Poliwrath can switch in and force out the Ground-types Jolteon struggles against and delay its need to Terastallize. Similarly, checks to Grass-types like Qwilfish formes and Articuno can similarly benefit Jolteon either through entry hazard and status support or through pivoting, respectively, allowing it to Terastallize as a later time. Hisuian Electrode stands out as Jolteon's worst matchup, possessing a quadruple resistance to Jolteon's STAB moves, higher Speed, and an immunity to Alluring Voice; checks to Hisuian Electrode like Hisuian Decidueye and Alolan Exegutor can blank its Volt Switch and threaten the opposition with their powerful STAB moves. Deterrents to Snorlax like Regirock and Toxicroak are valuable for pressuring it to Terastalize sooner, which can be exploited by teammates like Qwilfish formes and Hisuian Sneasel.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs boosts Jolteon's decent power to more threatening levels while still leveraging its excellent Speed. Volt Switch allows Jolteon to escape from walls like Snorlax and Regirock and maintain momentum for its team. Alluring Voice and Shadow Ball are Jolteon's strongest options for coverage against Ground-type foes; the former strikes at Fighting- and Dragon-types like Virizion and Alolan Exeggutor, while the latter pressures Ghost-types like Palossand and Rotom. Despite Jolteon's frailty, Volt Absorb gives it limited defensive utility by making it a situational switch-in against Electric-types like Rotom, opposing Jolteon, and Hisuian Electrode.</p> <p>While Choice Specs's enhanced power makes Jolteon more threatening as a pivot, it still struggles to tackle Ground- and Grass-types. Water- and Grass-types like Bruxish, Clawitzer, Virizion, and Hisuian Decidueye are great candidates to threaten these walls. Jolteon can form VoltTurn cores with fellow pivots like Passimian, Qwilfish formes, and Grafaiai, keeping momentum while threatening Jolteon's checks like Snorlax and Alolan Exeggutor. Water-types like Bruxish and Clawitzer pair excellently with Jolteon, threatening out Ground-types like Rhydon and Palossand that intend to block Jolteon's Volt Switch while maintaining a VoltTurn core. Similarly, checks to Grass-types like Charizard and Hisuian Sneasel can take advantage of Jolteon's Volt Switch and threaten heavy damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528485, "username": "DerpySuX"}]}]}
  },
  "Snorlax": {
    "overview": "<p>Continuing its dramatic fall from grace from the higher tiers, Snorlax now establishes itself as a dominant force in ZU with its Curse sets. Thanks to its overall outstanding bulk and offensive versatility, Snorlax is quite difficult to stop once it gets stat boosts, even when factoring in Rest turns. Snorlax isn't just limited to late-game cleaning, either — it can also use said bulk and Thick Fat to function as a reliable sponge to common special attackers like the Oricorio formes, Jolteon, Typhlosion, and Hisuian Electrode while also being a good paralysis spreader with Body Slam. Walls comfortable switching into Body Slam also have to be aware of Heat Crash, limiting the consistency of its switch-ins. However, its low Speed and reliance on Rest or Protect for recovery make it quite easy to pressure it into passivity and cost momentum for its team. Snorlax's lack of resistances also makes it easy for Fighting-types like Virizion and Passimian to pressure it to Terastallize earlier than expected, which forces careful play to ensure a successful sweep.</p>",
    "comments": "<h3>Other Options</h3> <p>Snorlax's coverage move is quite flexible -— Crunch hits Ghost-types like Palossand and Drifblim harder, while Heavy Slam more heavily pressures Tera Fairy setup sweepers like Mesprit and Dudunsparce. However, Crunch is usually noticeably weaker compared to Heat Crash, and Heavy Slam worsens its matchup against Steel-types and Tera Steel Pokemon and is still walled by Rock-types. Sleep Talk over Curse makes Snorlax more consistent as a special wall at the cost of its late-game potential. Heavy-Duty Boots is a notable alternative to Leftovers, allowing Snorlax to fare better against entry hazards and easing the need for hazard removal. However, Snorlax usually appreciates the passive recovery from Leftovers better. Offensive sets like Choice Band are usable to surprise the opposition but are held back by Snorlax's low Speed and giving up quite a lot of its bulk.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Rock-types like Hisuian Avalugg, Regirock, and Rhydon are not particularly bothered by even a boosted Snorlax and can set up Stealth Rock or pressure it with repeated uses of Body Press, with the latter two even using it as setup fodder.</p> <p><strong>Fighting-types and Fighting-type Coverage</strong>: Fighting-types like Hisuian Decidueye, Virizion, and Passimian can threaten huge damage on Snorlax with their Fighting-type STAB moves, though none of them particularly enjoy it Terastallizing to Fairy. Toxicroak can even threaten Snorlax even when the latter Terastallizes with its Poison-type STAB moves. Pokemon with Fighting-type coverage like Clawitzer, Glasterier, and Braviary can also pressure it into Terastallizing sooner than expected.</p> <p><strong>Strong Wallbreakers</strong>: Strong physical wallbreakers like Glastrier, Braviary, and Bruxish can strike at Snorlax's initially lower physical bulk and cause it to use Rest sooner than expected; the latter can also pivot out with Flip Turn against predicted switch-ins.</p> <p><strong>Coil Sweepers</strong>: Coil sweepers like Orthworm and Dudunsparce can consistently keep up and eventually overpower Snorlax with their Steel typing and Dragon Tail, respectively, though the latter would need to PP stall a Terastallized Snorlax to win. While Sandaconda cannot outright beat Snorlax without critical hits, it can outlast Snorlax by PP stalling and can brush off status with Shed Skin.</p> <p><strong>Item Removal</strong>: Snorlax's Leftovers is an essential part for it to wall and sweep teams; Knock Off users like Grafaiai, Grookey, and Dodrio endanger its chances of sweeping and follow up with strong STAB moves in their arsenals. Trick users like Mesprit, Rotom, and Mismagius can outright neuter Snorlax's sweeping potential with a Choice item, forcing it out.</p> <p><strong>Residual Damage</strong>: Snorlax hates taking residual damage, with common entry hazard setters like Orthworm, Qwilfish, and Sandaconda making it more difficult for Snorlax to sweep; the latter two can also rack up additional chip damage with Rocky Helmet. Status like burn and poison also forces Snorlax to use Rest, causing it to become more passive. Snorlax also can quickly get worn down by VoltTurn users like Mesprit, Hisuian Electrode, and Jolteon as a switch-in to them, risking losing momentum against them.</p>",
    "sets": {
      "CurseLax": {
        "description": "<p>STAB Body Slam not only functions as Snorlax's primary attacking move but also threatens incoming switch-ins like Qwilfish formes and Hisuian Decidueye with the chance of paralysis. Heat Crash is a powerful coverage move that hits both Ghost-types like Rotom, Mismagius, and Oricorio-G that would freely switch into Body Slam and Tera Steel users like Hisuian Decidueye. Rest fully restores Snorlax's health and removes existing status conditions at the expense of making it passive for two turns. Alternatively, Protect scouts for Choice-locked foes like Passimian and Rotom and racks up additional Leftovers recovery at the cost of being unable to remove status. Tera Fairy turns its Fighting weakness into a resistance and provides an immunity to Dragon-type moves from foes like Dipplin and Alolan Exeggutor. Tera Fairy Snorlax also benefits from Poison- and Steel-type moves being uncommon. Thick Fat strengthens its defensive profile by making it a consistent switch-in to Fire- and Ice-types like Typhlosion, Charizard, and Frosmoth.</p> <p>Snorlax excels mid- or late-game as a setup sweeper that can take advantage of Fighting-types and wallbreakers being worn down. Physical walls like Qwilfish, Hisuian Decidueye, and Sandaconda shore up Snorlax's lower physical bulk and can provide entry hazards to wear down switch-ins like opposing Qwilfish and Dudunsparce; they are also excellent as Knock Off absorbers to preserve Snorlax's Leftovers. Choice item wallbreakers like Bruxish and Jolteon can simulataneously provide wallbreaking and pivoting support for Snorlax to enter the field safely; they can help discourage physical walls like Palossand and Qwilfish formes from freely switching in. Poison-types like Qwilfish and Weezing can help with Snorlax's weakness to Fighting-types and provide additional utility. Rock-types like Regirock, Rhydon, and Hisuian Avalugg can easily ward off anything Snorlax can do, so checks to them like Virizion, Hisuian Decidueye, and Weezing are helpful to consistently force them out. Palossand stands out, as it can not only check the aformentioned Rock-types but also Fighting-types thanks to its excellent bulk and typing. Due to Snorlax's utility as a special wall and susceptibility to residual damage, Defoggers like Hisuian Decidueye and Cramorant are critical in preventing Snorlax from being worn down by hazards; the lack of hazards make it far more consistent walling foes and sweeping throughout a game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Articuno": {"sets": {"Special Wall": {}}},
  "Typhlosion": {"sets": {"Choice Scarf": {}, "Choice Specs": {}}},
  "Bellossom": {"outdated": true, "sets": {"Bulky Quiver Dance": {}}},
  "Qwilfish": {"sets": {"Defensive Pivot": {}, "Choice Scarf": {}, "Swords Dance": {}}},
  "Qwilfish-Hisui": {"sets": {"Specially Defensive": {}, "Swords Dance": {}}},
  "Sneasel": {"outdated": true, "sets": {"Fast Attacker": {}, "Choice Band": {}}},
  "Sneasel-Hisui": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Piloswine": {"outdated": true, "sets": {"Stealth Rock": {}, "Choice Band": {}}},
  "Porygon2": {"sets": {"Specially Defensive": {}}},
  "Smeargle": {"sets": {"Suicide Lead": {}}},
  "Medicham": {"outdated": true, "sets": {"Choice Scarf": {}, "Choice Band": {}, "All-Out Attacker": {}}},
  "Whiscash": {"outdated": true, "sets": {"Wall": {}}},
  "Regirock": {"sets": {"Physical Wall": {}}},
  "Bastiodon": {"sets": {"IronPress": {}}},
  "Floatzel": {"sets": {"Choice Band": {}, "Bulk Up": {}, "Choice Scarf": {}}},
  "Drifblim": {"sets": {"Calm Mind": {}, "Defog": {}}},
  "Mismagius": {"sets": {"Choice Specs": {}, "Nasty Plot": {}, "Calm Mind": {}}},
  "Spiritomb": {"sets": {"Physical Wall": {}}},
  "Toxicroak": {"outdated": true, "sets": {"Swords Dance": {}, "Nasty Plot": {}}},
  "Abomasnow": {"outdated": true, "sets": {"Aurora Veil": {}, "Choice Specs": {}}},
  "Magmortar": {"outdated": true, "sets": {"All-Out Attacker": {}}},
  "Rotom": {"sets": {"Choice Scarf": {}, "Utility": {}, "Nasty Plot": {}}},
  "Rotom-Frost": {"outdated": true, "sets": {"Nasty Plot": {}}},
  "Mesprit": {"sets": {"Choice Scarf": {}, "Nasty Plot Sweeper": {}, "Choice Specs": {}, "Defensive Pivot": {}}},
  "Shaymin": {"sets": {"Offensive Utility": {}, "Choice Scarf": {}}},
  "Gurdurr": {"outdated": true, "sets": {"Bulky Attacker": {}}},
  "Lilligant": {"sets": {"Sun Sweeper": {}}},
  "Eelektross": {"outdated": true, "sets": {"Defensive Pivot": {}, "Coil": {}}},
  "Braviary": {"sets": {"Bulk Up": {}}},
  "Virizion": {"sets": {"Swords Dance": {}, "Calm Mind": {}}},
  "Pyroar": {"sets": {"Special Attacker": {}}},
  "Malamar": {"sets": {"RestTalk": {}, "Choice Scarf": {}}},
  "Clawitzer": {"sets": {"Choice Specs": {}}},
  "Avalugg-Hisui": {"outdated": true, "sets": {"Suicide Lead": {}, "Offensive Utility": {}}},
  "Decidueye-Hisui": {"sets": {"Defog": {}, "Swords Dance": {}}},
  "Vikavolt": {"sets": {"Sticky Web Pivot": {}}},
  "Oricorio": {"sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Oricorio-Pa'u": {"outdated": true, "sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Oricorio-Sensu": {
    "overview": "<p>With its superb typing and access to Quiver Dance, Oricorio-G is a scary sweeper that aims to get boosts in the mid to late-game to clean up the enemy team. Its Ghost / Flying typing gives it a myriad of resistances, allowing it to check and set up on common Pokemon like Virizion and Toxicroak. Flying / Ghost STAB attacks are nearly unresisted, hitting everything save Naclstack and Morpeko for at least neutral damage while hitting many common Pokemon like Bruxish and Virizion super effectively. Offensive sets allow Oricorio-G to be a terrifying sweeper that can easily clean up mid- to late-game, while its defensive set uses its great typing to set up multiple times and slowly take apart bulkier teams. However, Oricorio-G has trouble setting up due to its deceptive frailty when uninvested and can struggle to threaten much without numerous boosts when invested into bulk. It's also quite reliant on Terastallization to bypass its answers like Sneasel and Snorlax.</p>",
    "comments": "<h3>Other Options</h3> <p>Substitute can be used over Taunt to shut down Dudunsparce as a check but doesn't do much else for Oricorio-G. Oricorio-G can be used as a defensive Defogger, but this role is better done by Drifblim.</p> <h3>Checks and Counters</h3> <p><strong>Normal-types</strong>: Snorlax and Dudunsparce are two of Oricorio-Gs best walls, as they can easily take it's moves with their huge bulk, and can threaten it in return with Crunch or Heat Crash from Snorlax and Toxic or Dragon Tail from Dudunsparce. However, Snorlax struggles with hazards and lack of reliable recovery, and both walls can be countered with Tera Fighting. Offensive Normal-types like Braviary and Indeedee-F can also switch into Oricorio-Gs moves and threaten it out.</p> <p><strong>Rock-types</strong>: Regirock and Rhydon can easily take hits from Oricorio-G and either cripple it or phaze it. Rhydon also threatens huge damage on Oricorio-G with its Rock-type moves. However, these Pokemon have no reliable recovery and can be worn down over the course of a game. Naclstack is also a huge annoyance due to it resisting both its STAB moves pre-Terastallization, and being able to wear it down with Salt Cure, and remain healthy with Recover.</p> <p><strong>Steel-types</strong>: While few, Steel-types like Orthworm and Magneton completely shut down bulky Oricorio-G and can set up on it or attack it back. Magneton threatens it with powerful super effective attacks, while Orthworm can set Stealth Rock and use Coil on it. However, these two Pokemon lack reliable recovery, allowing them to be worn down over the course of the game.</p> <p><strong>Electric-types</strong>: Electric-types like Jolteon and Hisuian Electrode can switch into Oricorio-G and severely damage it with their STAB moves. All Electric-types bar Rotom can also take any of Oricorio-Gs unboosted attacks and generate momentum on it with Volt Switch.</p> <p><strong>Special Walls</strong>: Offensive Oricorio-G gets completely shut down by Articuno, and, while bulky Oricorio-G can deny Haze and Roar with Taunt, it must be wary of being PP stalled out of its only attacking move. Hisuian Qwilfish can also beat Oricorio-G with Toxic and Pain Split while being generally unthreatened by its attacks. Other more uncommon special walls like Muk and Malamar can also shrug off its attacks and cripple it in return.</p> <p><strong>Strong Physical Attackers</strong>: Fast and powerful physical attackers like Sneasel and Bruxish can capitalize on Oricorio-G’s lower physical bulk and threatens it out with super effective attacks. However, these attackers tend to have difficulty switching in and can be outsped and KOed, should Oricorio-G get a boost prior. Glastrier is an exception to this with its huge bulk and can easily scare Oricorio-G out.</p>",
    "sets": {
      "Offensive Quiver Dance": {
        "description": "<p>Oricorio-G aims to be as offensively threatening as possible, with its STAB moves of Revelation Dance and Hurricane being near-unresisted, hitting most of the tier for at least neutral damage. Revelation Dance acts like a pseudo-Tera Blast that changes type when Terastallized, letting Oricorio-G tailor its coverage to beat certain types of Pokemon. Tera Fighting allows Oricorio-G to better threaten Normal-types like Dudunsparce, Dark-types like Sneasel, Steel-types like Orthworm, and Rock-types like Rhydon. Tera Ground hits Electric-types like Jolteon as well as the Poison- and Rock-types while giving it resistances to these types.</p> <p>Offensive Oricorio-G best fits on offensive teams alongside other setup sweepers like Virizion, Sneasel and Mesprit. They mutually benefit from each other softening up opposing walls like Articuno and Hisuian Qwilfish to enable a final sweep. Fighting-types like Toxicroak and Hisuian Sneasel threaten the Normal- and Dark-types that Oricorio-G struggles breaking past, easing its need to Terastallize. Defensive answers to Normal-types like Regirock and Palosand are appreciated as well. Oricorio-G also appreciates special wallbreakers like Clawitzer and Alolan Exeggutor that weaken the opposing team's special walls such as Snorlax. Entry hazard setters like Rhydon and Qwilfish help wear down foes to allow an easier sweep for Oricorio-G.</p>"
      },
      "Bulky Quiver Dance": {
        "description": "<p>Bulky Oricorio-G leverages its great defensive typing and decent bulk to be a threatening late-game Quiver Dance sweeper. Air Slash is used over Revelation Dance for its lack of immunities prior to Terastallization. Roost helps Oricorio-G stave off chip damage and stay healthy. Taunt denies opposing setup and recovery moves as well as status moves like Toxic from Qwilfish and Dudunsparce, Haze from Articuno, and Roar from Piloswine. Heavy-Duty Boots gives Oricorio-G an immunity to Stealth Rock, giving it more opportunities to switch in and set up. Grassy Seed is an alternative on Grassy Terrain teams to give Oricorio-G a Defense boost, giving it much needed physical bulk to take strong neutral attacks like Bruxish's Psychic Fangs. Tera Steel gives Oricorio-G a Rock resistance and a Poison immunity, while Tera Fairy gives it a Dark resistance and a Dragon immunity while still being resistant to Fighting.</p> <p>Balance teams can easily fit Oricorio-G for its myriad of immunities and potential to sweep late-game. Oricorio-G struggles with Rock- and Steel-type Pokemon such as Regirock and Orthworm, so Ground- and Water-type teammates like Qwilfish and Sandslash are good options for teammates. Fighting-type teammates like Virizion and Passimian are excellent partners, as they can also threaten Rock- and Steel- types as well as bulky Normal-types like Snorlax and Dudunsparce. Checks to Electric-type Pokemon such as Hisuian Decidueye and Toedscruel cover Oricorio-Gs weakness to them. Special wallbreakes like Whimsicott and Sceptile can help Oricorio-G to wear down special walls or clean up after it. Strong physical attackers like Bruxish and Passimian can also help threaten special walls that Oricorio-G struggles with like Articuno and Hisuian Qwilfish, and in return, it can take advantage of their checks like Dipplin and Sandaconda. Oricorio-G greatly benefits from entry hazard-stacking teammates like the aforementioned Qwilfish and Sandaconda, as they chip away at its checks, and Oricorio-G can double as a spinblocker for them. On Grassy Terrain teams it synergizes well with other setup sweepers like Farigiraf and Mesprit; on these teams, it aims to break apart bulky cores that its teammates may struggle with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 652656, "username": "Gambit_Gamin"}]}]}
  },
  "Lurantis": {"outdated": true, "sets": {"Defog": {}}},
  "Passimian": {"sets": {"Choice Scarf": {}}},
  "Palossand": {
    "comments": "<h3>Other Options</h3> <p>A Colbur Berry can dull the initial damage from Knock Off if Palossand is facing off against strong attackers like Hitmonlee, Passimian, or Toxicroak, but the passive benefits of Rocky Helmet and Heavy-Duty Boots carry over better if Palossand Terastallizes. The additional power of Earth Power is less useful to Palossand compared to fishing for status with Scorching Sands and Sludge Bomb. Tera Dark affords Palossand more flexibility against Bruxish, Rotom, and Prankster-boosted status moves from Grafaiai and Whimsicott.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Virizion and Hisuian Decidueye can threaten Palossand and can set up to break past its physical bulk. Specially offensive Grass-types like Whimsicott, Hisuian Electrode, Sceptile, and Alolan Exeggutor take advantage of Palossand's poorer special bulk. Hisuian Decidueye and Lurantis can remove Palossand's Stealth Rock, and the both of them and Dipplin can use Palossand as an opportunity to set up. All Grass-types must be wary of Sludge Bomb though, and Scorching Sands's burn chance is problematic for physically offensive ones.</p> <p><strong>Ice-types</strong>: Bulky Ice-types like Frosmoth and Glastrier threaten Palossand and can use it to set up. Articuno is similarly bulky and only dislikes a lucky Sludge Bomb poison. Sneasel can break through Palossand, but neither it nor Glastrier want to take a burn from Scorching Sands, and chip damage from Rocky Helmet adds up on Sneasel if it uses Triple Axel. Palossand blocks Rapid Spin from Hisuian Avalugg and threatens it with Scorching Sands but takes a lot of damage from Mountain Gale.</p> <p><strong>Water-types</strong>: Bruxish, Floatzel, and Veluza can break past Palossand’s great bulk with their powerful Water-type STAB moves but must consider Water Compaction, Tera, and Palossand’s Shadow Ball. Clawitzer has few issues breaking Palossand. Cramorant's special bulk and Ground immunity let it consistently use Defog against Palossand.</p> <p><strong>Special Attackers</strong>: Special wallbreakers like Mesprit and Jolteon break past Palossand’s much lower special bulk but are vulnerable to Shadow Ball and Scorching Sands. Bulky special sweepers like Calm Mind Dudunsparce, Farigiraf, and Oricorio-G can exploit Palossand’s underwhelming damage output to set up, but the former two don’t enjoy taking an unlucky status, while Oricorio-G is weak to Shadow Ball and needs a Special Defense boost to comfortably set up on Palossand.</p> <p><strong>Flying-types</strong>: Oricorio-F and Braviary can capitalize on Palossand's difficulty in dealing damage to them to use it as setup fodder. Oricorio-G is weak to Shadow Ball but can use Quiver Dance to help itself get out of KO range and can target Palossand due to its low special bulk.</p> <p><strong>Trick and Switcheroo</strong>: A Choice-lock is terrible for Palossand's ability to wall foes, so Rotom and Mesprit are very disruptive if they swap a Choice item onto it with Trick.</p> <p><strong>Status</strong>: Toxic from Dudunsparce, Grafaiai, and Hisuian Qwilfish puts Palossand on a timer and makes it more reliant on using Shore Up, but neither of them tolerate burns from Palossand's Scorching Sands very well. Grafaiai can use Poison Touch, and Dudunsparce can use Poison Jab to fish for poisons on Palossand even if they drop Toxic.</p> <p><strong>Taunt and Encore</strong>: Grafaiai and Whimsicott can use Encore to lock Palossand into a status move or weak move to exploit it, but they are weak to Scorching Sands and Sludge Bomb, respectively. Primeape can use Taunt to stop Palossand from setting up Stealth Rock or recovering but dislikes Scorching Sands. Sableye can irritate Palossand with Taunt or Encore.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Palossand's great physical bulk, unique typing, and access to recovery enable it to wall many physical attackers such as Passimian, Snorlax, and Regirock. Palossand's Ghost typing enables it to block Rapid Spin from Sandslash and can help it in a pinch against Hisuian Avalugg despite Palossand's Ice weakness, which adds to Palossand's reliability as an entry hazard setter. Palossand's decent Special Attack and STAB Shadow Ball's neutral coverage are acceptably strong and keep Palossand from being too passive. Scorching Sands is a nice complementary STAB move that can spread burns, making Palossand’s role as a physical wall even easier by stifling physical sweepers such as Snorlax without Rest and Coil Dudunsparce. Sludge Bomb is an alternative to threaten Grass-types that check Palossand like Hisuian Decidueye and Whimsicott. Tera Dragon lets Palossand flip its weaknesses versus Water- and Grass-types, whereas Tera Water trades a Grass resistance for an Ice resistance, and both have great synergy with Water Compaction. Tera Poison grants Palossand a poison immunity and Grass resistance for Grass-type counters like Whimsicott and Dipplin while retaining a good defensive matchup against Fighting-type moves.</p> <p>Palossand is a great addition to teammates looking for a partner that provides role compression of taking on physical attackers and setting up Stealth Rock. Specially defensive Pokemon form great bulky cores with Palossand. Snorlax can use Thick Fat to take on challenging Ice-type attackers like Frosmoth and Articuno for Palossand, and it appreciates Palossand dealing with Fighting-type threats to it like Passimian and Hitmonlee. Articuno threatens Water- and Grass-types like Clawitzer and Whimsicott for Palossand with its Freeze-Dry, and in turn, it enjoys Palossand providing protection against problematic physical attackers like Regirock and Snorlax. Dudunsparce can take on special attackers like Sceptile and Mismagius for Palossand, using its great bulk, Toxic, and Dragon Tail to mitigate setup opportunities Palossand offers, while Dudunsparce appreciates Palossand taking on Fighting-types like Toxicroak and Hisuian Sneasel that would threaten to break it or cause it to Terastallize prematurely. Hisuian Decidueye and Lurantis resist many of Palossand’s weaknesses and can support Rocky Helmet Palossand by using Defog to help with hazard chip damage. Dipplin can absorb Knock Off for Palossand thanks to Sticky Hold, and other Grass-types such as Whimsicott and Virizion can also threaten the Grass- and Water-types Palossand struggles with, such as Bruxish. Qwilfish and Hisuian Qwilfish enjoy Palossand keeping their Spikes up, while Palossand appreciates Intimidate and hazard stacking to wear down the Pokemon it walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Bruxish": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Bruxish serves as an excellent revenge killer and cleaner that fits on many teams. Its high Speed allows it to outpace slower Choice Scarfer users like Passimian and naturally fast Pokemon like Jolteon. High-power STAB moves in Wave Crash and Psychic Fangs let Bruxish be threatening at any point in the game, as the combination is nearly unresisted. Psychic Fangs is easily more spammable over Wave Crash, as it doesn't have any recoil and hits Wave Crash-resistant Pokemon like Virizion and Qwilfish. Flip Turn lets Bruxish pivot out of unfavorable matchups and bring in its teammates. Crunch lets it hurt other Psychic-types such as Mesprit and opposing Bruxish. Aqua Jet allows Bruxish to pick off faster Choice Scarf users and unburden sweepers like Typhloshion and Grafaiai. Strong Jaw is necessary to make the otherwise low-Base Power Psychic Fangs and Crunch powerful, although Dazzling can be used to block Sucker Punch from the likes of Shiftry and Toxicroak. Tera Water powers Wave Crash to absurd levels, while Tera Dark gives Bruxish a STAB boost on Crunch.</p> <p>Bruxish best fits on balance and offensive teams that need speed control. It makes a great teammate for Grass-types like Whimsicott and Hisuian Decidueye, as it checks the Fire and Poison-types that threaten them. Physical sweepers like Swords Dance Virizion appreciate Bruxish softening up physical walls early-game, and Bruxish can clean up the weakened teams after they break through them. Bruxish's low bulk and tendency to wear itself down with recoil and entry hazards makes it difficult to get on the field, so pivots like Passimian and Jolteon can help Bruxish alleviate this weakness as well as form a VoltTurn core with it. Entry hazard setters like Qwilfish and Sandslash help wear down Bruxish's checks such as Orthworm. Hazard removers such as the aforementioned Sandslash can also clear hazards to help with Bruxish's longevity.</p>"
      },
      "Choice Band": {},
      "Swords Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Appletun": {"outdated": true, "sets": {"Special Wall": {}, "Iron Defense": {}}},
  "Sandaconda": {
    "sets": {
      "Physical Wall": {},
      "Coil": {
        "description": "<p>Sandaconda serves as a deadly late-game threat with the powerful combination of Coil, Rest, and Shed Skin. Earthquake hits most of the tier for at least neutral damage, while Sandaconda's other attacking move hits Pokemon that are immune to Earthquake like Bombirdier, Oricorio formes, and Braviary. Scale Shot allows Sandaconda to boost its Speed, outspeeding the entire unboosted metagame except for Hisuian Electrode at +1 and outpacing common Choice Scarf users like Typhlosion at +2. Alternatively, Stone Edge doesn't drop Sandaconda's Defense and has more immediate potential to threaten Flying-types like Oricorio formes, Bombirdier, and Charizard. Rest acts as excellent recovery to keep Sandaconda healthy and combines well with Shed Skin to make it more reliable and help it serve as a wall in early- and mid-game scenarios, especially when combined with Tera Dragon to flip matchups on common Water- and Grass-types like Swords Dance Qwilfish and Hisuian Decidueye. Coil Sandaconda can opt to run less Speed in exchange for more bulk, with 224 Speed EVs and a neutral nature being enough to outpace base 110 Speed Pokemon at +1 and still outpace Choice Scarf Bruxish at +2; however, running these Speed EVs means it no longer outspeeds common Chlorophyll sweepers like Victreebel and faster Choice Scarf users like Mismagius and Floatzel at +2. Sandaconda can also opt to run Attack investment instead of HP, but this makes it more difficult to wall the foes it's tasked with setting up on late-game.</p> <p>Levitate users such as Mesprit and Mismagius serve as potentially problematic Pokemon, since they are immune to Earthquake and can become fully immune to Sandaconda's moves, if it's running Scale Shot, with Tera Fairy, so specially bulky teammates like Hisuian Qwilfish and Snorlax as well as faster teammates like Hisuian Electrode can be extremely helpful to counteract them. Orthworm poses similar issues due to Earth Eater and Iron Defense, so wallbreakers that threaten it like Charizard and Typhlosion are invaluable as teammates. These two as well as Bombirdier and Glastrier also threaten Grass-types, which cause problems for Sandaconda pre-Terastallization. Water-types pose similar issues while also often carrying super effective coverage for Terastallized Sandaconda, so teammates like Snorlax, Poliwrath, and Virizion benefit it greatly. In return for all of these potential partners' help, Sandaconda turns many physical attackers into setup fodder. Some common examples of Pokemon completely walled by it late-game include Passimian, Hisuian Qwilfish, and Rhydon; after Terastallization, this list expands to include other offensive threats like Bruxish, Qwilfish, and Hisuian Decidueye.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Cramorant": {"sets": {"Defog": {}}},
  "Frosmoth": {"sets": {"Quiver Dance": {}}},
  "Morpeko": {"outdated": true, "sets": {"Offensive Utility": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Glastrier": {"sets": {"Swords Dance": {}, "Choice Band": {}}},
  "Arboliva": {"outdated": true, "sets": {"Choice Specs": {}, "Bulky Attacker": {}, "Physically Defensive": {}}},
  "Naclstack": {"outdated": true, "sets": {"Stealth Rock": {}, "IronPress": {}}},
  "Toedscruel": {"outdated": true, "sets": {"Offensive Rapid Spin": {}}},
  "Orthworm": {"sets": {"Defensive": {}, "Coil": {}}},
  "Veluza": {"sets": {"Fillet Away Sweeper": {}}},
  "Farigiraf": {"sets": {"Double Dance": {}}},
  "Dudunsparce": {"sets": {"Coil": {}, "Calm Mind": {}, "Specially Defensive": {}}},
  "Dipplin": {"sets": {"Growth": {}}}
}