{
  "Arcanine-Hisui": {
    "sets": {
      "Altarianite": {
        "description": "<p>Hisuian Arcanine serves as a formidable revenge killer and, if it's running Stealth Rock, entry hazard setter while also packing solid defensive utility thanks to having Intimidate before Mega Evolving, allowing it to soft check the likes of Weavile and Altarianite Regieleki. Altarianite grants Hisuian Arcanine access to Pixilate Extreme Speed, which lets it revenge kill common offensive staples such as Dragonite, Urshifu-R, and Hisuian Samurott. Stealth Rock lets Hisuian Arcanine set entry hazards and pressure hazard removers such as Corviknight and Metagrossite Great Tusk looking to come in. Stone Edge lets it threaten foes that resist its STAB moves, notably targeting Ho-Oh, Pinsirite Gouging Fire, and opposing Hisuian Arcanine. The given EVs let it outpace uninvested Solgaleo. Hisuian Arcanine struggles against bulky Water-types such as Arceus-Water and Toxapex, making teammates that can threaten them such as Raging Bolt, Raikou, and Zapdos appreciated. Other defensive staples such as Eternatus, Garganacl, and Red Orb Hippowdon trouble Hisuian Arcanine, so teammates that can reliably pressure these such as Landorus, Great Tusk, and Arceus-Ground are also appreciated. Defensive teammates such as Eternatus, Solgaleo, and Corviknight appreciate Hisuian Arcanine's ability to take on threats such as Magearna, Ho-Oh, and Weavile. Hisuian Arcanine dislikes entry hazards, so allies that can remove them such as Corviknight, Mandibuzz, and Great Tusk are necessary.</p>"
      },
      "Bulky Priority Attacker": {
        "description": "<p>Pinsirite Hisuian Arcanine is a great revenge killer in Mix and Mega due to its high Attack and powerful Aerilate-boosted Extreme Speed. Double-Edge chips down slower threats like Galarian Slowking and Ho-Oh. Morning Sun provides Hisuian Arcanine with much-enjoyed longevity and takes advantage of Red Orb users like Lugia switching in. Howl makes Hisuian Arcanine a good cleaner, allowing it to OHKO Tough Claws and Lopunnite Great Tusk with Extreme Speed and offensive Eternatus with Double-Edge, as well as improving its matchup against Venusaurite Corviknight and Solgaleo. Hisuian Arcanine is a good Stealth Rock setter because of its ability to pressure common Sablenite users such as Corviknight. Intimidate provides defensive utility before Hisuian Arcanine Mega Evolves, handling physical attackers like Gouging Fire and Dragonite. 72 Speed EVs allow Hisuian Arcanine to outpace Adamant Altarianite Dragonite. Hisuian Arcanine's ability to revenge kill fast threats such as Urshifu-R and Altarinate Hisuian Arcanine helps sweepers prone to revenge killing like Weavile and Lopunnite Iron Boulder. After Mega Evolving, Hisuian Arcanine gains a crippling Stealth Rock weakness, so entry hazard removers like Regieleki, Corviknight, and Great Tusk make for good partners. Hisuian Arcanine struggles to break through physical walls such as Garganacl and Toxapex, so checks to these such as Urshifu-R and Raging Bolt, respectively, make for good teammates. Ground-types like Arceus-Ground, Landorus, and Great Tusk have good synergy with Hisuian Arcanine; it is able to take on non-grounded Steel-types such as Corviknight and Latiasite Solgaleo that they struggle to break through, while they handle Rock-types and Venusaurite and Blue Orb Steel-types like Iron Boulder, Solgaleo, and Magearna in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Slither Wing", "user_id": 603931}, {"username": "skippergamez", "user_id": 620268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Quantum Tesseract", "user_id": 297239}, {"username": "Clas", "user_id": 545372}, {"username": "zastra", "user_id": 558636}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Dragonite": {"sets": {"Bulky -ate Speed": {}, "Offensive -ate Speed": {}}},
  "Slowking-Galar": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Galarian Slowking is a strong defensive Pokemon in Mix and Mega that utilizes its great movepool, good typing, and defensive profile to act as an effective pivot on team styles ranging from bulky offense to stall. Good defensive stats and typing alongside the Regenerator ability means Galarian Slowking isn't in a rush to Mega Evolve often, as it can lean on its solid natural bulk to check Pokemon such as Eternatus, Lugia, and Regieleki, allowing Regenerator to keep it healthy throughout the course of a game. Galarian Slowking's movesets rely on Chilly Reception and Slack Off and typically include a reliable STAB attack like Future Sight, Psychic, or Sludge Bomb. Flamethrower annoys many Steel-types, and Toxic and Toxic Spikes are both very potent limiting tools for many bulky Pokemon such as Calm Mind Arceus formes and Ho-Oh. It also acts as the best Trick Room setter in the tier, though teams dedicated to that playstyle are very inconsistent. Galarian Slowking can use a wide range of defensive EV spreads, ranging from max Defense with a Relaxed nature to max Special Defense with a Sassy nature, of which the most common are mixed with an emphasis on Special Defense. The given EV spread survives a Metagrossite Urshifu-R's Surging Strikes after Stealth Rock without the need to Mega Evolve. Latiasite grants a Ground immunity through Levitate to dodge Spikes, Earthquake, and Ground-type Judgment making Galarian Slowking very reliable at its job, which is the reason Latiasite is the most versatile item on most teams. Sablenite can be used as a role compression Mega Stone that grants superior bulk and Magic Bounce but at the cost of trading Regenerator for the ability to block entry hazards. Sablenite's natural opportunity cost usually dissuades its use on Galarian Slowking, and other Mega Stones such as Manectite and Venusaurite can be used to fulfill a specific niche, such as an emergency use of Intimidate or resistance to Red Orb users like Lugia and Ice-type attackers like Calyrex-I, but these stones typically struggle to have a better justification for use instead of Latiasite. Galarian Slowking is susceptible to physical attackers like Hisuan Samurott, Solgaleo and Kingambit, so being able to use Chilly Reception to switch into offensive teammates like Great Tusk and Dragonite that threaten these options is ideal. Defensive teammates like Corviknight and Mandibuzz complement Galarian Slowking well, with the latter also being able to take on Ghost-types attacks like Moongeist Beam and Poltergeist from Lunala and Ceruledge, respectively. Ice-type teammates like Chien-Pao, Weavile, and Baxcalibur, which benefit from the snow from Chilly Reception, make for good partners; Calyrex-I in particular can also make us of Trick Room set up by Galarian Slowking to become a terrifying wallbreaker and cleaner.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Career Ended", "user_id": 241786}], "teams": [{"name": "Quality checked by", "members": [{"username": "Clas", "user_id": 545372}, {"username": "zastra", "user_id": 558636}]}, {"name": "Grammar checked by", "members": [{"username": "Vertigo", "user_id": 543620}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Arceus-Fairy": {"sets": {"Bulky Calm Mind": {}}},
  "Arceus-Ground": {"sets": {"Calm Mind": {}, "Physical Sweeper": {}}},
  "Samurott-Hisui": {
    "sets": {
      "Offensive Spiker": {
        "description": "<p>Hisuian Samurott sets itself apart as the tier's best offensive entry hazard setter thanks to its ability to set up Spikes on even Sablenite users, high Attack and Speed stats, and amazing movepool, fitting on a wide variety of teams ranging from hyper offense to semi-stall. Swords Dance makes it a wonderful wallbreaker, letting it pressure foes like Arceus-Water and Corviknight better; alternatively, it can run Flip Turn to pivot out against common switch-ins like defensive Eternatus and Arceus-Fairy and gain momentum. Sucker Punch can be used to have better outs versus faster, weakened foes and notably versus Psychic-types like Agility Lunala, Iron Boulder, and Deoxys-S, while Taunt is an option to deny status, recovery, and hazards from foes like Toxapex, Arceus-Water, and Red Orb Hippowdon. Encore can also be used as the last move to lock foes such as the Arceus formes into a non-damaging move like Calm Mind, rendering them incapable of stopping Hisuian Samurott from stacking Spikes or setting up with Swords Dance. A wide range of offensive teammates benefit from Hisuian Samurott's ability to stack up Spikes, the most notable of them being setup sweepers such as Gouging Fire and offensive Eternatus and pivots like Urshifu-R and Galarian Zapdos. Hisuian Samurott is extremely vulnerable to Altarianite Extreme Speed users, especially Dragonite, so checks to them such as Hisuian Arcanine, Latiasite Solgaleo, and Arceus-Ground are appreciated. It also has a hard time against foes like Arceus-Fairy, Urshifu-R, and Raging Bolt, so partners like Eternatus, Red Orb Lugia, and Altarianite Dragonite should be acknowledged.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "zastra", "user_id": 558636}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "SpaceSpeakers", "user_id": 573194}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Landorus": {
    "sets": {
      "Red Orb Wallbreaker": {
        "description": "<p>Landorus is one of the tier's most terrifying wallbreakers thanks to its extremely strong STAB move combination and great Special Attack. The combination of sun-boosted Weather Ball and Earth Power lets it threaten common specially defensive walls such as Lunala, Lugia, and Galarian Slowking. U-turn lets Landorus avoid having to predict and helps bring in teammates safely, whereas Nasty Plot can boost its Special Attack crazy high, allowing it to OHKO physically defensive Arceus formes and 2HKO Sablenite Blissey. Stealth Rock helps chip down defensive walls, Taunt can help deny recovery and setup from the likes of Lunala, Eternatus, and Calm Mind Arceus formes, and Rock Slide helps Landorus take on Ho-Oh and Pinsirite Gouging Fire, which otherwise wall it, in which case a Naive nature should be run. Offensive pivots like Regieleki, Urshifu-R, and Galarian Zapdos appreciate Landorus's exceptional wallbreaking capabilities, as they can help pivot it in while also taking advantage of the weakened walls like Lunala, Eternatus, and Arceus formes. Landorus struggles greatly against Ho-Oh and Pinsirite Gouging Fire if it forgoes Rock Slide, so teammates that can reliably pressure these such as Iron Boulder and Garganacl are greatly appreciated. Landorus is fairly slow and vulnerable to faster threats such as Urshifu-R, Iron Boulder, and Speed-invested Arceus-Ground, so defensive teammates that can check these such as Corviknight, Lunala, and Latiasite Galarian Slowking are needed. Landorus is also prone to getting chipped down by entry hazards, so hazard removal from the likes of Corviknight, Regieleki, and Great Tusk can be helpful.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Slither Wing", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "Clas", "user_id": 545372}, {"username": "zastra", "user_id": 558636}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Solgaleo": {
    "sets": {
      "Bulky Calm Mind": {
        "description": "<p>Thanks to Solgaleo's amazing bulk, good Special Attack stat, and fantastic movepool, it sets itself apart as an excellent setup sweeper and tank. Psyshock helps it deal with Calm Mind users such as Arceus formes and Blissey and hits foes like Eternatus, Ho-Oh, and Urshifu-R harder, but Flash Cannon can be used instead to have better outs against foes like Garganacl, Altarianite Dragonite, and Lunala. Flamethrower can be used to deal with Steel-types like Corviknight, Magearna, and opposing Solgaleo, whereas Thunderbolt hits Hisuian Samurott, Mandibuzz, and Urshifu-R harder while still hitting Corviknight for super effective damage and Magearna and Solgaleo for neutral damage. Latiasite can be used to mitigate Solgaleo's weakness to Ground, helping it deal with foes such as Arceus-Ground, Great Tusk, and Earthquake Iron Boulder and Dragonite. Alternatively, Venusaurite can be used to remove Solgaleo's weakness to Fire, allowing it to deal with threats like Hisuian Arcanine and Ho-Oh. Solgaleo is a great glue on bulky offense and balance teams, being capable of switching into and taking down foes like Eternatus, -ate Speed users, and Arceus formes depending on its set, helping common partners like Urshifu-R, Gouging Fire, and Raging Bolt. However, Solgaleo cannot check Ground- and Fire-types simultaneously. It is also prone to being revenge killed by Dark-types such as Hisuian Samurott, Weavile, Chien-Pao, and Kingambit and Ghost-types like Lunala and Spectrier. Therefore, it appreciates teammates such as Arceus-Water, Arceus-Ground, and Eternatus when using Latiasite sets; Urshifu-R, Arceus-Water, and Corviknight when using Venusaurite sets; -ate Speed users like Hisuian Arcanine, Dragonite, and Regieleki for dealing with Dark-types; and the aforementioned Dark-types themselves for dealing with Lunala.</p>"
      },
      "Offensive Sweeper": {
        "description": "<p>Cameruptite Solgaleo is a threatening setup sweeper thanks to its impressive Special Attack stat, great defensive typing, and solid coverage, letting it tear through common special walls such as Galarian Slowking, Clodsire, and Arceus formes not carrying Calm Mind. Flamethrower gives it the ability to threaten Steel-types such as Magearna and opposing non-Venusaurite Solgaleo, while Thunderbolt lets it beat Dark-types like Mandibuzz and Hisuian Samurott. Agility is seen on more offensive teams, since it lets Solgaleo outpace common revenge killers such as Raikou, Urshifu-R, and Iron Boulder, whereas Morning Sun can turn Solgaleo into a stallbreaker that notably beats Blissey and various Calm Mind Arceus formes while also letting it check Regieleki, Eternatus, and non-Earthquake Dragonite. Cameruptite Solgaleo is often seen on more offensive team structures, and as a result, it benefits from fast, offensive pivots like Regieleki, Urshifu-R, and Hisuian Samurott that can weaken the opponents walls; the latter can also set up entry hazards which can chip checks to Solgaleo like Magearna if Solgaleo forgoes Flamethrower and Lunala. Calm Mind Lunala and Arceus-Ground can comfortably check Solgaleo, so teammates that can beat them like Weavile, Hisuian Samurott, and Chien-Pao are appreciated. Solgaleo also benefits from dual screens support from a teammate like Regieleki or Deoxys-S, as it gives Solgaleo easier setup opportunity.</p>"
      },
      "Physical Wallbreaker": {
        "description": "<p>Boasting well-rounded stats in combination with a great offensive movepool, Solgaleo can serve as a great wallbreaker, being able to pressure common walls and offensive threats such as Eternatus, Regieleki, and Dragonite. Psychic Fangs lets Solgaleo threaten Eternatus, Metagrossite Great Tusk, and Urshifu-R while also being its best option against Walking Wake and Red Orb users like Raikou and Raging Bolt, whereas Wild Charge lets it target down Hisuian Samurott, Ho-Oh, and Venusaurite Corviknight while still hitting Urshifu-R. Flare Blitz pressures Steel-types such as the aforementioned Corviknight as well as Magearna and opposing Solgaleo, whereas Crunch is an alternative that lets Solgaleo handle Lunala and Red Orb Lugia more reliably while also being effective against Slowbro and Venusaurite Solgaleo. Morning Sun helps Solgaleo offset recoil damage while also allowing it to soft check -ate Speed Regieleki and Dragonite as well as non-Flamethrower Eternatus over the course of a game. Metagrossite is preferred, as it allows Solgaleo to outspeed Eternatus, Arceus formes, and Dark-types such as Roaring Moon and Hisuian Samurott, while Aerodactylite can be run if an ally is already running Metagrossite, giving Solgaleo extra firepower at the cost of a worse Speed tier. Solgaleo struggles against bulky Ground- and Water-types such as Arceus-Ground, Hippowdon, and Arceus-Water, making teammates that can reliably pressure these such as Urshifu-R, Raging Bolt, and Walking Wake appreciated; Raging Bolt and Walking Wake also appreciate Solgaleo's ability to pressure their checks in Galarian Slowking and Clodsire in return. Solgaleo struggles against Red Orb users like Raging Bolt, Raikou, and Landorus, making Pokemon that can take these on like defensive Eternatus and Venusaurite Clodsire good partners.</p>"
      },
      "Defensive Pivot": {
        "description": "<p>Thanks to its amazing bulk, good defensive typing, and myriad of coverage and utility, Solgaleo is a strong defensive pivot. Future Sight allows Solgaleo to heavily damage Poison-types like Eternatus, Arceus-Poison, and Clodsire over a period of time and combo with Fighting-types like Urshifu-R and Galarian Zapdos for incredible wallbreaking power, although Sunsteel Strike can be used to hit Arceus-Fairy, Garganacl, and Iron Boulder for super effective damage. Psychic Fangs is the final option for the third coverage slot to reliably hit the aforementioned Poison-types. Earthquake is recommended in the last moveslot to nail Fire-types like non-Pinsirite Gouging Fire and Hisuian Arcanine, Red Orb users like Raging Bolt, and, if running Future Sight, can consistently deal with the previously mentioned Poison-types. Flamethrower can be used to threaten Pinsirite Magearna, Corviknight, and Levitate variants of Excadrill, Magearna, and Solgaleo. Flash Cannon is an alternative to Sunsteel Strike that has more PP, but it cannot threaten Arceus-Fairy, Garganacl, and Altarianite Dragonite as effectively as Sunsteel Strike. Sablenite is recommended due to the utility Magic Bounce provides by bouncing backing entry hazards from Pokemon like Eternatus, along with the defensive stat boosts Solgaleo receives, although Venusaurite can be used to ease the matchup against Eternatus and Fire-types like Hisuian Arcanine and Iron Moth. A Relaxed or Sassy nature can be used depending on the team. Thanks to Solgaleo's ability to underspeed slow pivots like Corviknight and Magearna, cleaners like Gouging Fire, Arceus, and Raging Bolt appreciate its presence. Even with Venusaurite, Solagleo has difficulty with Fire-types such as Raging Bolt, Landorus, and Gouging Fire. Therefore, Blue Orb users like Archaludon that can deal with Raging Bolt, Pokemon like Latiasite Toxapex and Ho-Oh that can handle Landorus, and Pokemon like Garganacl and Arceus-Water that can take care of Gouging Fire can all form a potent defensive core with Solgaleo. Solgaleo is also forced out by Dark-types like Hisuian Samurott, Darkrai, and Weavile. Therefore, Pokemon that resist Dark, like Arceus-Fairy, Hisuian Arcanine, and Magearna, are beneficial. Ironically, Dark-types like Weavile, Hisuian Samurott, and Darkrai are also good partners for Solgaleo, as they force out Lunala for it. In return, Solgaleo provides the aforementioned Dark-types with Future Sight support to soften Arceus-Fairy and Altarianite Hisuian Arcanine.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "zastra", "user_id": 558636}, {"username": "Slither Wing", "user_id": 603931}, {"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Clas", "user_id": 545372}, {"username": "zastra", "user_id": 558636}, {"username": "Career Ended", "user_id": 241786}, {"username": "Slither Wing", "user_id": 603931}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "Rose", "user_id": 511181}]}]}
  },
  "Lunala": {"sets": {"Meteor Beam": {}, "Physically Defensive": {}, "Specially Defensive": {}}},
  "Corviknight": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Thanks to its significant bulk, amazing typing, and access to U-turn and utility moves such as Defog and Roost, Corviknight functions incredibly as a defensive pivot and entry hazard remover. Sablenite makes Corviknight incredibly slow, improving its pivoting capabilities, and also gives it Magic Bounce, which can reflect hazards used by Pokemon like Arceus-Ground and Garganacl as well as Taunt from Deoxys-S, ensuring Corviknight can heal itself with Roost and keep its teammates such as Gouging Fire, Urshifu-R, and Raging Bolt from being chipped. U-turn helps provide momentum and allows safe switch-ins to frail attackers such as Nasty Plot Deoxys-S and Iron Boulder, which can threaten to sweep when positioned correctly. Brave Bird is used to deal decent damage against Fighting-types like Urshifu-R and Galarian Zapdos at the cost of recoil, while Body Press deals super effective damage versus the likes of Chien-Pao, Garganacl, and Iron Boulder but does less damage to neutral targets. Corviknight has a great matchup against many Pokemon, including Dragonite, Great Tusk, and Urshifu-R, thanks to its defensive traits and ability to bring in Pokemon like Hisuian Arcanine and Walking Wake to dispose of these threats. Some significant threats to Corviknight include Electric-types like Zapdos, Sandy Shocks, and Supercell Slam Regieleki as well as Fire-types such as Gouging Fire and Red Orb users like Landorus and Raging Bolt. Dragon-types like Eternatus and Arceus-Dragon are thus good teammates for their ability to handle the majority of Pokemon with these typings with ease. Corviknight can also be paired with Calm Mind Arceus-Ground, whose Judgment can threaten every relevant Electric- and Fire-type in the metagame bar Zapdos, which is threatened by Ice Beam. Additionally, Fire-types like Gouging Fire and non-Electric-type Red Orb users can be countered by Garganacl and Earth Power Arceus-Water.</p>"
      },
      "Setup Sweeper": {
        "description": "<p>Corviknight's great bulk and typing coupled with its ability to blanket check a large amount of the meta make it a great setup sweeper and answer on teams ranging from bulky offense to hard stall. Iron Defense + Body Press gives Corviknight the ability to boost faster and without recoil while threatening Steel-types like Archaludon, Magearna, and Solgaleo that may attempt to recklessly switch in or use it as setup fodder, whereas Bulk Up + Brave Bird does more damage and can potentially break through defensive Eternatus if Corviknight is not burned or forced out by Dragon Tail. Both Iron Defense and Bulk Up allow Corviknight to proactively check Pokemon like Dragonite and Dragon Dance Arceus-Ground, boosting itself while preventing them from being threats. U-turn gives Corviknight the ability to take advantage of Magic Bounce to its fullest and bring in a teammate safely, while Defog lets it act as a strong glue; it should be noted that Defog is typically better on bulkier teams that don't have room for Rapid Spin users like Regieleki and Great Tusk, but it is fine on teams with these as well. Sablenite is the preferred item for the much higher bulk, lower Speed, and Magic Bounce it provides, and it is viable with both a physically and specially defensive spread depending on the team's needs. Alternatively, Venusaurite frees up Sablenite for a teammate and reduces Corviknight's issues with Fire-type moves from Pokemon such as Gouging Fire, Hisuian Arcanine, and Flare Blitz Metagrossite Solgaleo but should be ran with a physically defensive EV spread, a Bold nature, and 31 Speed IVs to take advantage of its higher Speed stat, which notably lets it outspeed uninvested Hippowdown and Magearna. Corviknight's fantastic bulk and typing mean it supports a wide range of teammates; Pokemon like Urshifu-R, Raging Bolt, and Dragonite appreciate its ability to safely switch them in with U-turn while blocking entry hazards if holding Sablenite, whereas Defog helps Pokemon fit for bulkier teams like Giratina and Toxapex, especially if it forgoes Sablenite for Venusaurite. If Corviknight forgoes Defog for U-turn, it should be paired with spinners like Great Tusk and Regieleki, which can clear hazards on just the user's side while still benefitting from Corviknight's Magic Bounce. Despite its great bulk, Corviknight despises Garganacl's Salt Cure along with Fire- and Electric-type moves from the likes of Hisuian Arcanine, Red Orb users like Landorus and Raging Bolt, Supercell Slam Regieleki, and Eternatus, so answers like Arceus-Water, Eternatus, Arceus-Dragon, Arceus-Ground, Slowking-Galar, and Ho-Oh are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Clas", "user_id": 545372}, {"username": "Gambit_Gamin", "user_id": 652656}], "teams": [{"name": "Quality checked by", "members": [{"username": "zastra", "user_id": 558636}, {"username": "Clas", "user_id": 545372}, {"username": "Slither Wing", "user_id": 603931}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Eternatus": {
    "sets": {
      "Defensive": {
        "description": "<p>Leveraging excellent stats in combination with a great defensive typing, Eternatus stands as one of the tier's most flexible walls, being able to be tailored to take on the majority of the metagame. Dynamax Cannon acts as a great secondary STAB move, letting Eternatus more reliably threaten foes that resist Sludge Bomb such as Great Tusk and Landorus, whereas Toxic lets it pressure bulky setup sweepers such as Lunala, Lugia, and Arceus formes looking to set up on it while also annoying other defensive switch-ins like Mega-Evolved Garganacl, Ho-Oh, and Hippowdon. Dragon Tail also halts bulky setup sweepers like the aformentinoed ones and Arceus-Poison while having the benefit of racking up entry hazard chip. Flamethrower threatens foes that resist Sludge Bomb, notably targeting Steel-types such as Magearna, non-Venusaurite Corviknight, and Solgaleo. Toxic Spikes is a niche alternative, letting Eternatus pressure teams lacking a Poison-type, although it is less common due to the prevalence of Eternatus and Galarian Slowking. The given EVs let Eternatus outspeed maximum Speed Lunala and Lucarionite Raging Bolt; alternatively, it can forgo Defense EVs for more Speed. Rocky Helmet is preferred on physically defensive variants, as it lets Eternatus punish foes such as Urshifu-R, Hisuian Arcanine, and Hisuian Samurott more. Black Sludge grants it more longevity, while Heavy-Duty Boots gives it a permanent immunity to entry hazards. Thanks to Eternatus's well-rounded stats and typing, it finds itself a place on almost all balance or bulkier teams, soft checking common threats such as Regieleki and Hisuian Arcanine. Specially defensive walls such as Ho-Oh, Mandibuzz, and most Arceus formes make great partners, as they can take on strong special wallbreakers such as Walking Wake, Landorus, and setup Solgaleo that Eternatus struggles against. Eternatus also pairs well with Latiasite Steel-types such as Solgaleo and Magearna, as they are able to take on Dragon- and Ground-types such as opposing Eternatus, Arceus-Ground, and Great Tusk. In return, Eternatus takes on Red Orb users such as Raikou and Raging Bolt, as well as Fighting-types such as Urshifu-R and Galarian Zapdos. Eternatus also struggle versus Psychic-types such as Solgaleo and Deoxys-S, which makes teammates such as Lunala and Mandibuzz appreciated.</p>"
      },
      "Offensive": {
        "description": "<p>With its great defensive typing, sky high Special Attack stat, and good STAB combination, Eternatus acts as one of Mix and Mega's most threatening special wallbreakers. Fire Blast gives coverage into Steel-types like Solgaleo, Magearna, and Sablenite Corviknight; Flamethrower is a more consistent alternative, but the drop in power makes it lose out on damage thresholds like OHKOing Sablenite Corviknight after Stealth Rock. Recover increases Eternatus's survivability and lets it offset Life Orb recoil and other chip damage. Life Orb Eternatus is typically seen on more offensive teams looking for a solid wallbreaker. Pokemon that hard wall Eternatus like Blissey and Blue Orb Magearna and Pokemon that can use it as setup fodder like Iron Boulder and Calm Mind Venusaurite Solgaleo can give it a tough time. As a result, Pokemon like Great Tusk and Arceus-Ground that can deal with these threats are good teammates. Naturally faster threats like Weavile and Walking Wake and priority from Arceus can directly threaten Eternatus; this makes Pokemon that can handle these threats like Arceus-Fairy, Galarian Slowking, and Sablenite Corviknight good partners.</p>"
      },
      "Meteor Beam": {
        "description": "<p>Eternatus acts as a terrifying cleaner and setup sweeper, using its good natural bulk and typing to have an easier time against revenge killers. Meteor Beam allows Eternatus to lure in and OHKO Ho-Oh while providing extra firepower, and Fire Blast threatens Steel-types like Corviknight, Magearna, and Solgaleo, whereas Flamethrower is a weaker but more consistent alternative. Sludge Bomb nails Fairy-types like Arceus-Fairy, Altarianite Dragonite, and Altarianite Hisuian Arcanine, while Recover provides longevity, allowing Eternatus to have an easier time against revenge killers like Altarianite Regieleki and Metagrossite Urshifu-R. Meteor Beam and Power Herb's single-use nature requires Eternatus to be used with offensive pivots that can wear down the opposing team like Altarianite Regieleki, Red Orb Raikou, and Metagrossite Urshifu-R; in return, it can clean up the opposing team. Entry hazard users like Arceus formes, Hisuian Arcanine, and Hisuian Samurott make for great partners, wearing down Eternatus's checks like Galarian Slowking, Arceus-Ground, and non-Heavy-Duty Boots Lunala throughout the course of the game.</p>"
      },
      "Cosmic Power": {
        "description": "<p>Cosmic Power Eternatus acts as a deadly endgame cleaner thanks to its great bulk, good Speed tier, amazing Special Attack, and two outstanding setup moves in Cosmic Power and Meteor Beam. Meteor Beam powers up its damage output and nails foes like Ho-Oh, Corviknight, and Lugia. Dynamax Cannon can be used to hit foes like Galarian Slowking, Lunala, and Ground-types such as Arceus-Ground, Great Tusk, and Red Orb Landorus. Alternatively, Sludge Bomb can be used for better odds against Fairy-types like Arceus-Fairy and Altarianite Dragonite as well as to potentially cripple answers like Calm Mind Lunala and specially defensive Garganacl. 176 Speed EVs with a Timid nature allow Eternatus to outspeed fast Arceus formes. Wallbreakers and offensive pivots such as Tough Claws Solgaleo, Gouging Fire, and Urshifu-R synergize well with Eternatus, since they can threaten and chip down defensive foes like Garganacl and Galarian Slowking for it to effectively clean later, with pivots also being useful in bringing it in safely. Eternatus is one of the best checks to Red Orb users like Raging Bolt and Raikou, especially Calm Mind variants that can otherwise muscle past a lot of would-be checks if given the turns to set up; this makes it particularly attractive as a teammate to Pokemon like the aforementioned Urshifu-R, since those Red Orb users are some of the few roadblocks to it. Eternatus is weak to Steel-types like Calm Mind Solgaleo and Magearna, so checks to them such as Lunala, the aforementioned Gouging Fire, and Red Orb users like Raging Bolt, Lugia, and Landorus are appreciated. Latiasite variants of the aforesaid Steel-types as well as Water-types like Arceus-Water and Hisuian Samurott also make great partners, as Eternatus often struggles to break past Ground-types, especially if it's running Sludge Bomb. Additionally, Hisuian Samurott and other entry hazard setters like Garganacl and Great Tusk are great teammates because Eternatus benefits from its answers such as the previously mentioned Ground- and Steel-types being chipped. Great Tusk is also useful in removing hazards, enabling Eternatus and its teammates to take as little chip as possible and do their job with minimum hindrance.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "zastra", "user_id": 558636}, {"username": "Bella", "user_id": 567483}, {"username": "cat", "user_id": 580765}, {"username": "Slither Wing", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "Quantum Tesseract", "user_id": 297239}, {"username": "Clas", "user_id": 545372}, {"username": "zastra", "user_id": 558636}, {"username": "Slither Wing", "user_id": 603931}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Offensive Wallbreaker": {
        "description": "<p>Thanks to its great Attack, amazing Speed, and versatile movepool with powerful STAB moves, Urshifu-R distinguishes itself as a fantastic wallbreaker and offensive pivot. Ice Spinner hits foes that resist Urshifu-R's STAB attacks, such as Eternatus and Dragonite. Alternatively, Zen Headbutt can be used for better outs against Toxapex while still hitting Eternatus. U-turn allows Urshifu-R to switch out of bad matchups such as Arceus-Water and generate momentum. Metagrossite ensures that Urshifu-R can act as a fast pivot, outpacing foes like Eternatus, Scizorite Weavile, Lucarionite Walking Wake. Alternatively, Aerodactylite or Blue Orb can be used if another teammate like Galarian Zapdos is using Metagrossite to enhance Urshifu-R's wallbreaking potential, with Aerodactylite sets always 2HKOing defensive Eternatus with Ice Spinner and Blue Orb sets 2HKOing Arceus-Fairy with Surging Strikes, albeit at the cost of being outsped by the aforementioned Pokemon. Urshifu-R fits well with other offensive pivots, such as Raikou and Walking Wake, pressuring structures involving Pokemon like Eternatus and bulky Water-types like Arceus-Water and Toxapex. Setup sweepers like Raging Bolt, Gouging Fire, and Lunala also appreciate Urshifu-R's ability to safely pivot them in. Urshifu-R is vulnerable to -ate Speed users, such as Altarianite Regieleki, Hisuian Arcanine, and Dragonite, so teammates that help in dealing with them such as Arceus-Ground, Galarian Slowking, and Solgaleo are appreciated. Urshifu-R also has difficulty in dealing with bulky Arceus formes, especially Arceus-Fairy and Arceus-Water, so Pokemon that beat them such as Eternatus and the aforementioned Raging Bolt make great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "zastra", "user_id": 558636}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "SpaceSpeakers", "user_id": 573194}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Regieleki": {
    "sets": {
      "Altarianite Pivot": {
        "description": "<p>Regieleki is the best Pokemon in Mix and Mega, compressing the roles of revenge killer, entry hazard remover, and offensive pivot. Its strong movepool, great stats, and solid typing let it act as a great glue Pokemon for many playstyles, ranging from hyper offense to semi-stall. Utilizing the highest base Speed stat in the tier, and Pixilate-boosted, STAB Rapid Spin, Regieleki is quite difficult to prevent from spinning. Regieleki is also the only Pokemon with both Extreme Speed and a pivoting move. Extreme Speed gives it significant revenge killing prowess by letting it move before anything besides +2, Speed-invested Dragonite while a speedy Volt Switch gives it the maneuverability to weaken foes while bringing in a defensive teammate like Corviknight. Regieleki can use Explosion to trade KOs with foes, Supercell Slam to hit targets like Ho-Oh and Galarian Slowking, or Tera Blast to 2HKO checks like Ampharosite Skarmory and Pinsirite Great Tusk. It can even forgo Rapid Spin for one of these options, but there isn't a much better hazard remover than it, and will only be fruitful if it's paired with other consistent hazard removal options like Pinsirite Great Tusk and Sablenite Corviknight. Maximum Speed EVs let Regieleki always at least Speed tie with opposing Altarianite Regieleki; alternatively, due to its ludicrous base Speed, it can afford to run more specialized EV spreads that forgo max Speed for Defense or Special Attack investment. For example, a 252 Atk / 68 Def / 80 SpA / 108 Spe spread lets it survive opposing Altarianite Regieleki's Extreme Speed after Stealth Rock, outpace positive-natured base 160 Speed foes such as Cameruptite Deoxys-S and Manectite Spectrier, outpace +1 Pinsirite Dragonite, and do more damage to its Poison- and Fire-type answers like Arceus-Poison, Galarian Slowking, Hisuian Arcanine, and Ho-Oh. Due to its spinning prowess, Regieleki is a great teammate to Pokemon that dislike hazards such as Dragonite, Gouging Fire, and Red Orb users like Raging Bolt and Raikou. It appreciates having teammates that can break through roadblocks like Arceus-Ground, Clodsire, and defensive Eternatus which means progress-making choices like Hisuian Samurott, Urshifu-R, and Walking Wake partners.</p>"
      },
      "Dual Screens": {
        "description": "<p>Regieleki acts as an excellent dual screens setter on hyper offense teams, allowing teammates like Meteor Beam Eternatus, Dragon Dance Gouging Fire, and Swords Dance Urshifu-R to set up safely. Volt Switch allows it to pivot out into these aforementioned teammates and chips Corviknight, Explosion allows it to chunk threats like Hisuian Arcanine and Dragon Dance Dragonite while ensuring that a teammate can always come in safely, and Rapid Spin removes entry hazards from setters like Hisuian Arcanine, Garganacl, and Arceus formes attempting to take advantage of Regieleki's passivity. 196 HP and 252 Defense EVs with an Impish nature allow Regieleki to survive two uses of Extreme Speed from Altarianite Regieleki from full HP if it sets Reflect first, and 4 Speed EVs allow it to outspeed base 149 Speed Pokemon like Absolite Walking Wake and Lucarionite Shaymin-S. Regieleki should always be paired with setup sweepers that appreciate it setting dual screens like Dragon Dance Dragonite, Meteor Beam Lunala, and Swords Dance Kingambit, notably allowing them to set up safely and making them harder to revenge kill. Defoggers like Corviknight threaten to remove the dual screens Regieleki sets, so partners that can threaten them or punish their Defog attempts like Dragon Dance Gouging Fire, Swords Dance Lopunnite Iron Boulder, and Kingambit, which notably has Defiant before Mega Evolving, are appreciated.</p>"
      },
      "Offensive Pivot": {
        "description": "<p>With its nigh-unresisted STAB combination after Mega Evolving, incredible Speed tier, and useful utility options, Regieleki is one of Mix and Mega's most reliable offensive pivots and cleaners. Extreme Speed with Glalitite or Pinsirite gives Regieleki an Ice-type coverage move or Flying-type STAB attack, allowing it to threaten Pokemon like Arceus-Ground, Great Tusk, and Clodsire that would otherwise completely wall it and revenge kill setup sweepers like Dragonite. Explosion is a great one-time nuke that lets Regieleki to potentially OHKO Pokemon like Calm Mind Arceus formes and give a partner a safe switch in. Rapid Spin allows Regieleki to support teammates like Dragonite by removing entry hazards, but Supercell Slam can be for opted instead, giving Regieleki a powerful physical Electric-type STAB move against Pokemon looking to switch into Volt Switch like Solgaleo and Ho-Oh. The given EVs allow Regieleki to outspeed opposing Altarianite Regieleki. Regieleki can oftentimes struggle to muscle through physically defensive walls like Lunala and Arceus-Poison, so Pokemon like Arceus-Ground, Landorus, and Raging Bolt who can threaten these Pokemon are helpful. Pokemon like Urshifu-R, Galarian Zapdos, and Raikou can form powerful VoltTurn cores with Regieleki, as they threaten Pokemon like Great Tusk and Arceus that Regieleki can struggle against; in return, Regieleki can help chip away at Pokemon like Dragonite and Raging Bolt. While generally outclassed by Altarianite Regieleki, running Pinsirite or Glalitite on Regieleki is most common to free up a teammate like Dragonite or Hisuian Arcanine to run Altarianite. Regieleki's weaker Ice-type coverage means it is more reliant on Explosion and its Electric-type attacks to dent foes, but it has better overall coverage on most threats. Pinsirite Regieleki's Flying typing makes it more vulnerable to Stealth Rock, but its more powerful Extreme Speed easily punishes common Pixilate switch-ins like Galarian Slowking and Red Orb Landorus.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Career Ended", "user_id": 241786}, {"username": "Bella", "user_id": 567483}, {"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Clas", "user_id": 545372}, {"username": "zastra", "user_id": 558636}, {"username": "Slither Wing", "user_id": 603931}, {"username": "Career Ended", "user_id": 241786}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Great Tusk": {
    "sets": {
      "Pinsirite Offensive Spinner": {
        "description": "<p>Pinsirite Great Tusk serves as a fantastic bulky attacker, cleaner, and entry hazard remover thanks to its phenomenal movepool, strong Ground-type and Aerilate-boosted STAB moves, and ability to switch into a multitude of threats like Dragonite, Gouging Fire, Altarianite Regieleki, and Iron Boulder. Body Slam is notably difficult to switch into due to its paralysis chance. Rapid Spin removes entry hazards and turns Great Tusk into a major threat by letting it outspeed nearly the entire metagame, only losing to Chien-Pao and Deoxys-S. Bulk Up turns it into a fearsome setup sweeper that can even beat non-setup Corviknight, while Ice Spinner hits opposing Great Tusk and common Pinsirite users like Garganacl and Iron Boulder. The given EV spread allows Great Tusk to outspeed a Aerilate Dragonite, survive Adamant Aerodactylite Gouging Fire's +1 Flare Blitz, and OHKO Tough Claws variants of Gouging Fire with Headlong Rush. Great Tusk's incredible offensive and defensive utility means it often warrants itself on a variety of offense and faster balance teams, and so allows it to have a wide range of suitable partners. Pokemon that appreciate its ability to keep hazards off the field while being offensive menaces like Urshifu-R, Red Orb Raging Bolt, and Hisuian Arcanine warrant themselves as strong partners. Allies that resist Water- and Ice-type moves like Arceus-Water, Alomomola, and the aforementioned Red Orb Raging Bolt are also good teammates, being able to switch into or force out threats like Urshifu-R and Chien-Pao while having their own utility in the form of pivoting, hazards, status, setup, and Wish passing. Electric-types like Sandy Shocks and Raikou that can punish Flying-types like Corviknight and Pinsirite Garganacl that attempt to take advantage of Great Tusk's inability to dent them are also notable. Likewise, non-grounded, Flying-resistant Pokemon like Latiasite Magearna and Solgaleo that would otherwise wall Great Tusk can be accounted for with partners like Lunala, Scizorite Weavile, Flare Blitz Gouging Fire, and Red Orb Raikou.</p>"
      },
      "Offensive Wallbreaker": {}
    },
    "credits": {"writtenBy": [{"username": "Clas", "user_id": 545372}], "teams": [{"name": "Quality checked by", "members": [{"username": "zastra", "user_id": 558636}, {"username": "Slither Wing", "user_id": 603931}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Gouging Fire": {
    "sets": {
      "Pinsirite": {
        "description": "<p>Gouging Fire is a threatening setup sweeper and cleaner, putting its solid bulk, good typing, and massive Attack stat to good use while also resisting Pixilate Extreme Speed from Pokemon like Hisuian Arcanine and Dragonite after Mega Evolving. Dragon Dance allows Gouging Fire to outspeed most of the metagame after a single boost. Double-Edge has more breaking power and can heavily dent neutral foes like Eternatus, Galarian Slowking, and Arceus-Water, although Body Slam can be use if longevity is preferred, and the paralysis chance helps Gouging Fire's Speed. Flare Blitz hits Magearna and Corviknight, although Earthquake nails Raging Bolt and Raikou more reliably than any of Gouging Fire's other moves. Morning Sun gives Gouging Fire recovery in a pinch against passive walls like Ho-Oh, Galarian Slowking, and Lugia. The given EV spread allows Gouging Fire to survive Surging Strikes from Metagrossite Urshifu-R before Mega Evolving and outpace Iron Boulder after a Dragon Dance. Pinsirite is mandatory to flip matchups on Ground-types like Great Tusk, Arceus-Ground, and Landorus. Gouging Fire is extremely vulnerable to Stealth Rock after Mega Evolving, which makes entry hazard removal from Excadrill and Great Tusk and Sablenite users like Solgaleo, Corviknight, and Mandibuzz appreciated. Blue Orb users like Magearna and Archaludon can easily take any of non-Earthquake Gouging-Fire's attacks, so Ground-types like Landorus, Great Tusk, and Arceus-Ground are beneficial. Dual screens Regieleki is an amazing partner, as it makes set up easier and removes entry hazards via Rapid Spin. Gouging Fire also hates bulky Water- and Rock-types like Arceus-Water, Garganacl, and Toxapex, so Pokemon that can manage them, like Raging Bolt, Galarian Zapdos, and Thundurus, respectively, are beneficial. If Gouging Fire forgoes Flare Blitz however, it cannot break through Levitate variants of Solgaleo, Magearna, and Kingambit, so Pokemon like Raikou, Hisuian Arcanine, and Urshifu-R form great offensive cores with it.</p>"
      },
      "Tough Claws": {}
    },
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "Clas", "user_id": 545372}]}, {"name": "Grammar checked by", "members": [{"username": "Rose", "user_id": 511181}]}]}
  },
  "Raging Bolt": {"sets": {"Red Orb Wallbreaker": {"description": "<p>180 Speed EVs outspeeds uninvested Solgaleo and Lunala</p>"}, "Dragon-type Wallbreaker": {}}}
}