{
  "Arcanine-Hisui": {"sets": {"Magic Guard": {}}},
  "Muk-Alola": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>With a great defensive typing, solid special bulk, and Knock Off, Alolan Muk is a great RegenVest user, repeatedly entering the battle and disrupting fierce special attackers like Iron Moth and Zapdos. Knock Off provides critical utility and disruption, deters potential answers from switching into it, and provides decent uninvested damage output against neutral targets. Poison Fang semi-reliably spreads Toxic poison onto opposing walls, while Poison Jab can 2HKO Enamorus-T and Meowscarada. Rock Slide hits Zapdos, Volcanion, Talonflame, and Volcarona hard, punishing them for switching in. Ice Punch nails common switch-ins like Landorus-T and Garchomp, while Thunderbolt snipes Corviknight. Physical walls like Corviknight, Unaware Scream Tail, and Quaquaval are a natural pairing, as they can better deal with the physical attackers that threaten Alolan Muk like Garchomp, Chien-Pao, and Galarian Zapdos. Mixed attackers like Magic Guard Volcanion and Heatran threaten Alolan Muk out, so offensive answers to these like Sword of Ruin Garchomp, Chien-Pao, and Galarian Zapdos are recommended. Entry hazards wear down Alolan Muk over the course of the game and prevent it from properly dealing with repeated attacks from threats like Iron Moth and Iron Jugulis, so hazard removers like Iron Treads, Quaquaval, and Corviknight are all recommended teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540420, "username": "Gimmicky"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475288, "username": "Tranquility"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Gengar": {
    "sets": {
      "Sheer Force": {
        "description": "<p>Gengar makes for an amazing wallbreaker, breaking through offensive threats like Gholdengo, Great Tusk, and Enamorus-T, as well as having a decent Speed tier. Focus Blast hits Dark-types that try to switch in such as Chien-Pao and Roaring Moon as well as Steel-types such as Heatran and Hisuian Goodra. Nasty Plot turns Gengar into a threatening wallbreaker, allowing it to 2HKO RegenVest Hisuian Goodra and Manaphy with its coverage options. Sludge Wave hits Fairy- and Grass-types like Enamorus-T, Hisuian Electrode, and Ogerpon-W. Energy Ball hits Ground-types like Swampert and Great Tusk, while Thunderbolt hits non-Volt Absorb Corviknight and Mandibuzz. Gengar is great at threatening physical walls like Corviknight and Deoxys-D, so it partners well with physical wallbreakers like Galarian Zapdos and Chien-Pao; in return, they can pressure special walls that Gengar struggles to break through like Hisuian Goodra and Blissey. Due to Gengar's frailty, it struggles against faster threats such as Azelf, Roaring Moon, and Chien-Pao, so defensive switch-ins to them like Mandibuzz, Great Tusk, and Intimidate Corviknight make for good partners. Gengar greatly appreciates Knock Off support from Pokemon like Swampert, Manaphy, and Deoxys-D to remove Assault Vest from RegenVest Pokemon such as Swampert, Hisuian Goodra, and Meloetta, allowing it to have an easier time breaking past the opposing team.</p>"
      },
      "Normalize": {
        "description": "<p>Normalize Gengar not only threatens to remove opposing RegenVest pivots, often the best check to more conventional Gengar sets, but also reliably sets Toxic Spikes and wins one-on-one against slower setup threats like Swords Dance Iron Hands and Calm Mind Cresselia. Mean Look in conjunction with Skill Swap traps and removes opposing specially defensive walls like Swampert, Manaphy, and Empoleon that are aiming to check it. Skill Swap also reliably forces out and generates a free turn against any Pokemon slower than Gengar such as Sandy Shocks and Beads of Ruin Walking Wake, as they will be unable to hit it through Normalize. This makes Gengar one of the most reliable Toxic Spikes setters, as it threatens most common removal options like Corviknight and Great Tusk. Gengar is an excellent teammate for fast special cleaners like Azelf, Deoxys-S, and Iron Moth, as they benefit tremendously from opposing special walls being removed or weakened with Toxic Spikes. Gengar struggles against teams with fast Dark-types like Roaring Moon, Meowscarada, and Chien-Pao, as it cannot meaningfully damage them and is immensely threatened by them, making Pokemon like Fluffy Corviknight and physically defensive Manaphy great partners; they can also provide a slow pivot to get Gengar in safely. Weather Ball from Pokemon with Primordial Sea or Desolate Land bypasses Normalize, meaning Gengar cannot reliably force out common users like Walking Wake and Volcanion, so sturdy checks to them like RegenVest Swampert and Blissey make solid teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}, {"user_id": 620268, "username": "skippergamez"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 540420, "username": "Gimmicky"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Electrode-Hisui": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Hisuian Electrode is a great offensive pivot thanks to its amazing Speed, access to Volt Switch, and powerful STAB Chloroblast for Ground-types like Swampert, Great Tusk, and Sandy Shocks. Thunder Wave cripples switch-ins like Roaring Moon, Hisuian Goodra, and Ogerpon-H, potentially letting Hisuian Electrode's teammates outspeed and threaten them, while Leech Seed lets it chip down walls such as Blissey and Hisuian Goodra and heal. Worry Seed removes Volt Absorb from walls like Corviknight and Empoleon and Regenerator from Hisuian Goodra and Meloetta, letting it chip the latter two, especially with entry hazards on the field. Hisuian Electrode forms a great VoltTurn core with other offensive pivots like Barraskewda, Roaring Moon, and Slither Wing, as they can bring it in on physical walls like Corviknight and Great Tusk, and it can bring them in on special walls like Hisuian Goodra and Meloetta. Entry hazard setters like Heatran, Scream Tail, and Deoxys-D are great teammates thanks to hazards wearing down Hisuian Electrode's switch-ins like Roaring Moon, Hisuian Goodra, and Heatran; in return, it can threaten common hazard removers like Corviknight, Great Tusk, and Mandibuzz. Hisuian Electrode struggles to break through specially defensive walls like Blissey, Hisuian Goodra, and Meloetta, so physical wallbreakers like Ceruledge and Galarian Zapdos are appreciated. Hisuian Electrode is also frail and has a middling defensive typing, so slow, bulky pivots that can take a hit and safely pivot it in like Corviknight and Swampert make good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540420, "username": "Gimmicky"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Chansey": {
    "sets": {
      "Wall": {
        "description": "<p>Chansey acts as an extremely niche special wall and is typically found on fat or stall teams looking for a check to setup sweepers like Volcarona, Cresselia, and Iron Crown. Seismic Toss prevents Chansey from being a sitting duck, limiting its passivity by dealing decent chip damage. Heal Bell provides extremely valuable and rare utility by allowing Chansey to act as a cleric, removing status from teammates like Pecharunt and Mandibuzz. Stealth Rock allows it to provide more general utility for its team, allowing it to wear down offensive threats like Roaring Moon, Azelf, and Deoxys-S over time, whereas Thunder Wave debilitates foes while enabling teammates like Hex Gholdengo and Pecharunt. Protect is a niche option that lets it scout out which move a Choice-locked foe like Ceruledge, Roaring Moon, or Azelf will use, easing prediction and allowing the right play to be made. Unaware lets it comfortably check special setup sweepers like Thundurus, Iron Moth, and the aforementioned Volcarona. Chansey's relatively low Defense and susceptibility to Knock Off from users like Roaring Moon, Galarian Zapdos, and all Ogerpon formes make physically bulky Pokemon that can switch into them like Great Tusk, Fluffy Corviknight, and Iron Hands good teammates. Entry hazard removers like Great Tusk, Mandibuzz, and Corviknight are greatly appreciated due to Chansey's vulnerability to hazards, allowing it to more effectively act as a special wall.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475288, "username": "Tranquility"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Zapdos": {
    "sets": {
      "Primordial Sea": {
        "description": "<p>Zapdos functions as an offensive pivot thanks to its high Special Attack and typing while simultaneously checking threatening Fire-types like Iron Moth and Heatran thanks to Primordial Sea; this also allows it to fire off completely accurate Hurricanes, which OHKO the likes of Galarian Zapdos and Great Tusk. Thunder can be used to deal significant damage to the likes of RegenVest Manaphy and Gholdengo and potentially paralyze foes, while Weather Ball hits Ground-types like Sandy Shocks as well as Fire-types like Desolate Land Heatran, Cinderace, and Ceruledge. Volt Switch can be used instead if you're not running U-turn to deal more damage when pivoting, at the cost of being blocked by the likes of Swampert. U-turn helps Zapdos maintain momentum against special walls and safely bring in teammates. Zapdos struggles against most RegenVest Pokemon, like Hisuian Goodra, Meloetta, and especially Swampert, so it needs physically offensive teammates like Iron Boulder and Chien-Pao that can take care of them. Due to its Stealth Rock weakness, Zapdos prefers to keep its item and benefits from Pokemon like Corviknight and Great Tusk that can absorb Knock Off.</p>"
      },
      "No Guard": {
        "description": "<p>Zapdos leverages its great offensive stats and typing to be a solid offensive pivot, paralysis spreader, and wallbreaker. No Guard allows Zapdos to make use of its strong STAB moves, with Zap Cannon spreading paralysis against switch-ins such as Meloetta, Hisuian Goodra, and RegenVest Roaring Moon. U-turn lets Zapdos pivot out of tough matchups such as against Swampert and Volt Absorb Empoleon while also generating momentum. Heavy-Duty Boots in combination with Roost gives Zapdos great longevity and lets it check threats such as Dragonite and Great Tusk more effectively, while Choice Specs sets prefer Heat Wave, which is its best option against checks like Iron Treads and Volt Absorb Corviknight. Choice Specs also allow Zapdos to 2HKO Heatran and RegenVest Manaphy. Slow wallbreakers such as Ceruledge, Slither Wing, and all Ogerpon formes appreciate Zapdos's ability to both slow down foes and pivot them into favorable matchups. Zapdos struggles greatly against Swampert, so teammates like Azelf and Deoxys-S are appreciated, as they can overwhelm it alongside Zapdos. Zapdos has lackluster Speed and is threatened by foes such as Chien-Pao, Iron Boulder, and Barraskewda, which makes defensive Pokemon like physically defensive Manaphy and Corviknight good teammates. Faster teammates such as Barraskewda, Choice Scarf Roaring Moon, and Azelf are also appreciated, as they can force out the aforementioned threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}, {"user_id": 603931, "username": "Slither Wing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 552227, "username": "Kinetic"}, {"user_id": 611238, "username": "LordBox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 511181, "username": "Rose"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Zapdos-Galar": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Galarian Zapdos is an excellent wallbreaker whose power is further boosted by Sword of Ruin. Boasting two powerful STAB moves with excellent neutral coverage in Close Combat and Brave Bird, Galarian Zapdos can most notably 2HKO Deoxys-D and Intimidate Corviknight. Knock Off beats Gholdengo and hinders switch-ins like Fluffy Corviknight and defensive Zapdos, while U-turn allows for pivoting against Fluffy users. Adamant is the preferred nature for better odds to 2HKO Intimidate Corviknight, while Jolly allows Galarian Zapdos to Speed tie with the plethora of base 100 Speed Pokemon, at the cost of only 3HKOing Intimidate Corviknight. Galarian Zapdos is a relatively slow and frail wallbreaker and is forced out by offensive threats such as Azelf and Chien-Pao, so it appreciates being brought in by pivots such as Azelf and Iron Moth; in return, it can threaten special walls like Swampert and Hisuian Goodra for them. Slow pivots like Corviknight and Swampert are also appreciated, as they can take a hit for it and pivot it in safely, with the former also providing entry hazard control, extending Galarian Zapdos's longevity. Galarian Zapdos struggles against Fluffy walls such as Corviknight, so Fire-types such as Ceruledge and Iron Moth make for great teammates. Stealth Rock setters such as Great Tusk and Deoxys-D are also good teammates, allowing Galarian Zapdos to always 2HKO Intimidate Corviknight; in return, it can threaten opposing Great Tusk, preventing it from removing entry hazards. Galarian Zapdos's wallbreaking prowess is further empowered when paired with other offensive threats such as Barraskewda and Roaring Moon, as they can wear down shared checks like Fluffy Corviknight.</p>"
      },
      "Magic Guard": {
        "description": "<p>Galarian Zapdos is a threatening physical wallbreaker thanks to its high base Attack and powerful STAB moves in Brave Bird and Thunderous Kick. Magic Guard prevents chip damage from Stealth Rock as well as Rocky Helmet, which is commonly used by Corviknight and Skarmory. Thunderous Kick is used because the Defense drop it causes allows Galarian Zapdos to KO Pokemon like RegenVest Iron Hands with Brave Bird afterwards. Knock Off allows Galarian Zapdos to threaten switch-ins such as Gholdengo and Deoxys-D while OHKOing Iron Boulder. Galarian Zapdos can use U-turn to function as an offensive pivot as well as to switch out on uncomfortable matchups such as Corviknight, Skarmory, and Fluffy Mandibuzz, while Close Combat can be used as a second STAB option that, unlike Thunderous Kick, OHKOes Archaludon and has a very high chance to OHKO specially defensive Garganacl and Chansey. Galarian Zapdos struggles against physical walls such as Gholdengo, Corviknight, and Skarmory; special attacking wallbreakers like Sandy Shocks, Iron Moth, and Heatran are heavily appreciated, since they are able to counter them. Galarian Zapdos is also threatened by fast foes such as Dragonite, Iron Boulder, and Deoxys-S. Teammates like defensive Gholdengo and Fluffy Corviknight are appreciated to counter both Dragonite and Iron Boulder, while special walls like RegenVest Manaphy and Swampert can check Deoxys-S.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543620, "username": "Vertigo"}, {"user_id": 652656, "username": "Gambit_Gamin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 475288, "username": "Tranquility"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Dragonite": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Dragonite provides a variety of offensive utility, being an incredibly strong anti-offense tool, a potent setup sweeper, and a nigh-unparalleled late-game cleaner. Earthquake threatens Rock- and Steel-types like non-Earth Eater Garganacl, Kingambit, and Gholdengo, while Ice Spinner threatens select Electric-types like Sandy Shocks and Zapdos and removes Azelf's Psychic Terrain. Roost provides Dragonite with much-needed longevity, notably allowing it to turn Corviknight into setup fodder. Sharp Beak is an option over Life Orb to ensure that Dragonite does not wear itself down as quickly; alternatively, Heavy-Duty Boots improves its longevity, allowing it to pose a threat multiple times in a game and leverage its typing to act as a passable check to Water- and Fire-types like Barraskewda and Iron Moth. Dragonite's ability to clean late-game is appreciated by wallbreakers that can break open holes in the opposing team earlier in the game, like Volcarona and Chien-Pao. Its ability to act as potent speed control also allows it to make up for teammates that have middling Speed tiers like Ceruledge, Galarian Zapdos, and Archaludon. Dragonite's tendency to get forced out by Azelf means it requires a partner that can consistently switch into it like Empoleon, RegenVest Manaphy, or Swampert. When not using Heavy-Duty Boots, entry hazard control from teammates like Corviknight, Great Tusk, and Mandibuzz is a must-have.</p>"
      },
      "Mixed Attacker": {
        "description": "<p>Dragonite can leverage its solid Special Attack, its deep coverage movepool, and the sheer power of Aerilate Extreme Speed to be an incredibly effective mixed attacker and late-game cleaner while still bringing plenty of defensive utility. Thunderbolt cleanly eliminates Corviknight and Mandibuzz looking to soak up Extreme Speed, while Flamethrower OHKOes Fluffy Corviknight and threatens non-Well-Baked Body Gholdengo. Dragon Dance allows Dragonite to set up for a sweep, but Earthquake is also an option, guaranteeing damage against non-immune Steel-types like Empoleon, Gholdengo, and Heatran, as well as strongly hitting Azelf. Roost allows Dragonite some additional longevity, letting it more effectively use its high bulk and rich defensive typing. 100 Special Attack EVs guarantee a 2HKO on Corviknight after Leftovers if Dragonite is holding Life Orb, with the rest of the EVs being put into bulk to let Dragonite more effectively check threats like Ogerpon-W and Iron Moth. Heavy-Duty Boots is an option over Life Orb, giving Dragonite even more longevity, which lets it better check threats like Ogerpon-H and gives it more opportunities to switch in at the cost of a noticeable power drop, missing the guaranteed 2HKO against Pixilate Scream Tail. Dragonite's revenge killing capabilities are appreciated by powerful mid-game wallbreakers like Gholdengo, Scream Tail, and Latios, all of which can wear down a team over time for Dragonite to clean up. Dragonite's poor matchup against Psychic Surge users like Deoxys-S and Azelf demands a solid answer to them, be it an offensive one like Choice Scarf Roaring Moon or Hadron Engine Gholdengo or a bulky switch-in like Heatran or Empoleon. Dragonite can very easily be forced out by attackers like Primarina and Scream Tail and, without Heavy-Duty Boots, is extremely vulnerable to Stealth Rock, meaning bulky pivots like Manaphy and Meloetta and entry hazard removers like Corviknight and Great Tusk are recommended teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540420, "username": "Gimmicky"}, {"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 594122, "username": "Evie"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Mew": {
    "outdated": true,
    "sets": {
      "Choice Scarf Regenerator": {
        "description": "<p>Choice Scarf Regenerator Mew is a strong utility pivot that checks fast physical attackers with the combination of Will-O-Wisp + Volt Switch while still pressuring defensive cores with entry hazards and Trick. Ice Beam can be used as an alternative to Spikes to pressure Pokemon like Garchomp and Landorus-T. Trick can be used to neutralize support Pokemon and defensive pivots like Corviknight while serving as an emergency stop to bulky setup sweepers like Calm Mind Enamorus-T. 136 Speed EVs with a Timid nature ensure that Mew outspeeds Chien Pao, Hisuian Electrode, and +1 Jolly Quaquaval, as well as positive natured Slither Wing and Heatran after Trick. Bulky teammates like Corviknight, Garganacl, Zapdos, and Skeledirge benefit from Mew's ability to spread burns and set hazards, allowing them to absorb more hits from physical attackers and whittle down these attackers more quickly; Mew can also pressure fast attackers like Meowscarada and Talonflame that they struggle with. Additionally, late-game cleaners like Chien-Pao, Hisuian Arcanine, and Quaquaval benefit from Mew's ability to chip defensive switch-ins and hinder walls by giving them a Choice Scarf.</p>"
      },
      "Prankster": {
        "description": "<p>Prankster Mew is a good dual screens lead for hyper offense teams thanks to its good bulk, Speed, and movepool. Taunt blocks foes such as Garchomp, Landorus-T, and Iron Treads from setting entry hazards, Corviknight from clearing screens with Defog, and opposing setup sweepers like Volcarona from taking advantage of free turns. U-turn lets it pivot into its teammates and potentially re-set screens later in the game. Stealth Rock or Spikes can be used over U-turn to chip foes for teammates to KO. 96 Speed EVs and a Jolly Nature ensure that Mew always moves first against opposing leads like Prankster Corviknight and Masquerain, allowing Mew to hinder them with Taunt. Prankster Mew should only be used as a dual screens lead on hyper offense teams. Teammates such as Chien-Pao, Polteageist, Volcarona, and Roaring Moon all appreciate screens, which allow them to easily set up and make them less susceptible to revenge killers. The aforementioned Pokemon also provide good options for Mew to pivot into and gain momentum. Dark-type Pokemon such as Ting-Lu, Meowscarada, and Chien-Pao are immune to Prankster Taunt and can take advantage of Mew, so counters to them such as Zamazenta-C and Triage users, like Enamorus-T and Ursaluna, are good teammates.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>Life Orb Mew is a very dangerous mixed wallbreaker that can decimate various walls with its colorful coverage. Ice Beam hits Ground- and Flying-types such as Garchomp, Landorus-T, and Zapdos. Gunk Shot 2HKOes Scream Tail, which otherwise switches into Mew freely. Close Combat takes care of Blissey and Steel-types such as Hisuian Goodra, Kingambit, and Heatran. Flamethrower 2HKOes non-Well-Baked Body Corviknight and Zamazenta-C, dissuading the latter from using Mew as setup fodder. A Mild nature helps Mew exert as much pressure as possible with Ice Beam and Flamethrower, while a Hasty nature most notably lets it outspeed Hydreigon and Speed tie Zapdos. Magic Guard negates chip damage from Life Orb and entry hazards, helping Mew stay healthy for longer and allowing it to better utilize its natural bulk to come into play. Sheer Force is an alternative particularly if Mew is used alongside a teammate with Magic Guard, such as Hisuian Electrode. It greatly increases Mew's power, notably letting it OHKO Garchomp and Iron Treads and pressure otherwise solid checks such as Meloetta, at the cost of its longevity. Bulky pivots such as Corviknight, Quaquaval, Iron Treads, and Meloetta can take on fast threats to Mew such as Chien-Pao, Roaring Moon, and Iron Moth and switch Mew in safely. Fast offensive pivots such as Meowscarada and Sandy Shocks are also strong partners that can give Mew opportunities to come into play and clean up late-game after it softens up their checks. Garchomp and Ting-Lu can set entry hazards to help Mew break down its checks over time.</p>"
      },
      "Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"user_id": 226455, "username": "berry"}, {"user_id": 532881, "username": "Frozoid"}, {"user_id": 537558, "username": "memesketch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 475288, "username": "Tranquility"}, {"user_id": 517429, "username": "Adeleine"}, {"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Skarmory": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Skarmory is a premier physical wall and one of the best Spikers in the tier. Fluffy makes it a hard stop to prominent physical attackers like Zamazenta, Roaring Moon, and Iron Boulder, while Well-Baked Body hardwalls Ceruledge, Cinderace, and even a few specially-inclined attackers like Heatran and non-Discharge Iron Moth. Body Press has excellent synergy with Iron Defense, potentially turning it into a late-game wincon and hitting key targets like Kingambit, while Brave Bird hits Ceruledge and does more damage to Great Tusk and Galarian Zapdos. Leftovers is the preferred item to provide passive recovery, but Rocky Helmet is an alternative to punish pivots like Roaring Moon and Barraskewda on Fluffy variants. Whirlwind has good synergy with Spikes and prevents Skarmory from being setup fodder, while Iron Defense lets it set up alongside physically-inclined threats like Bulk Up Great Tusk. Skarmory pairs especially well with Knock Off users like Manaphy, Empoleon, and Great Tusk, as they can remove Heavy-Duty Boots to accentuate Spikes's effect. Skarmory struggles to check Electric-types like Iron Hands, Fire-types if not Well-Baked Body, and Chien-Pao, making teammates like Great Tusk and physically defensive Manaphy good partners. Skarmory has pitiful special bulk, so it needs strong RegenVest users and specially defensive teammates like Swampert and Blissey. Special attackers that are usually slowed by RegenVest pivots, such as Latios and Deoxys-S, appreciate Skarmory wearing them down with Spikes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Smeargle": {
    "sets": {
      "Sticky Web": {
        "description": "<p>Smeargle functions incredibly as an entry hazard lead on hyper offense teams thanks to its ability to lay Sticky Web and Stealth Rock via Stone Axe. Taunt can prevent hazards from Deoxys-D and Skarmory and sweepers such as Ogerpon-W and Dragonite from setting up, while Memento can allow safe switch-ins for other frail Pokemon like Gengar and Chien-Pao. Smeargle is exclusively used on hyper offense teams due to it more or less being a suicide lead. Some notable partners include frail attackers such as Swords Dance Iron Boulder and Sheer Force Gengar, which benefit greatly from Sticky Web and the safe switch-in Memento provides. Some counters to Smeargle include Roaring Moon and Chien-Pao, since they are both immune to Taunt and Memento, enabling them to use it as setup fodder; as a result, Fighting-types such as offensive Bulk Up Great Tusk and Iron Hands are good partners. Another Pokemon that annoys Smeargle is Great Tusk due to its hazard removal capabilities, making threats such as Swords Dance Ceruledge, Ogerpon-C, and Tail Glow Manaphy much appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit_Gamin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Blissey": {
    "sets": {
      "Special Wall": {
        "description": "<p>Blissey is a decent, albeit niche, wall and utility Pokemon in AAA with its ability to check most special attackers and extremely diverse movepool. Seismic Toss allows Blissey to not be completely passive and gives it consistent damage. Blissey's last two moveslots are flexible. Calm Mind + Shadow Ball is enough to beat the few special attackers that can otherwise defeat Blissey one-on-one such as Sheer Force Gengar and Gholdengo. Stealth Rock provides entry hazard support to free up a moveslot for a teammate, while Thunder Wave spreads status, crippling Pokemon like Azelf and Manaphy, and Heal Bell allows Blissey to operate as a cleric. Unaware allows Blissey to check special attackers attempting to set up on it like Gholdengo, Tail Glow Manaphy, and Iron Moth, while Well-Baked Body allows it to check Iron Moth while also giving it a more favorable matchup into Volcarona and Heatran. Magic Guard allows Blissey to avoid chip damage from entry hazards, letting it function as a better wall. Blissey most commonly runs Leftovers, as the extra healing can be extremely helpful, although on teams with more shaky hazard control, Heavy-Duty Boots can be opted for instead. A Calm nature is used to make Blissey function better as a special wall, notiably allowing it to always avoid the 2HKO from Sheer Force Gengar's Focus Blast. Blissey is most notably a special wall that does not require the use of Regenerator, which allows physical walls such as Great Tusk to run it instead. Blissey is most commonly seen on stall and fat team structures. Physically defensive walls like Corviknight and Deoxys-D are a must, as they help deal with Blissey's weakness to physical attackers and make a potent defensive core with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Swampert": {
    "sets": {
      "RegenVest": {
        "description": "<p>With an excellent defensive typing, solid bulk, Flip Turn, and good utility with Knock Off, Swampert is a premier RegenVest pivot that checks notable special attackers such as Gholdengo, Zapdos, and Iron Moth while also getting in offensive teammates with its slow pivoting. Stone Edge hits Zapdos, Volcarona, and Dragonite, while Mirror Coat can be used against setup attackers like Enamorus-T and strong special attackers such as Deoxys-S and Latios. Flying-types like Corviknight and Mandibuzz appreciate Swampert's Electric immunity, letting them reliably check physical attackers and remove entry hazards. Frail offensive Pokemon like Azelf, Chien-Pao, and Barraskewda benefit from Swampert, as its slow pivoting lets them come in more safely, and they can also take advantage of its Knock Off removing items from their common checks such as Deoxys-D and Corviknight. Swampert maintains much of its special bulk through its Assault Vest, so it's vital to have Knock Off absorbers such as Corviknight and Great Tusk for Swampert to more reliably check special attackers. Grass-resistant Pokemon like Heatran and Well-Baked Body Gholdengo are also good teammates for Swampert, as special attackers such as Iron Moth and Deoxys-S frequently run Grass-type coverage predominantly for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475288, "username": "Tranquility"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 611238, "username": "LordBox"}, {"user_id": 523866, "username": "UT"}, {"user_id": 552227, "username": "Kinetic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Latios": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Choice Specs Latios is a fearsome wallbreaker that can force progress in almost every matchup with its combination of powerful STAB attacks, effectively mixed coverage with Psyshock, and ability to finesse poor matchups with Flip Turn and Trick. Adaptability Luster Purge consistently OHKOes common slower offensive Pokemon like Zapdos without dropping Latios's Special Attack, but Trick can cripple an opposing Chansey or Deoxys-D or disrupt a setup sweeper like Cresselia. Adaptability provides the most overall power to the set, letting it reliably 2HKO common RegenVest pivots like Swampert and Manaphy with Psyshock, while Tinted Lens lets it 2HKO Meloetta and Empoleon with Psyshock and have a good chance to OHKO Corviknight and Gholdengo with Draco Meteor. Latios pairs well with fast cleaners like Deoxys-S and Hisuian Electrode, as they can readily take advantage of the opposing RegenVest user being removed from the match. Strong physical wallbreakers like Iron Boulder and the Ogerpon formes appreciate Latios bringing them in safely with Flip Turn and even chunking their checks like Corviknight that may try to eat a predicted Psyshock. Latios invites in powerful Dark-type revenge killers like Roaring Moon and Chien-Pao, making robust checks to these such as Fluffy Corviknight and Regenerator Primarina mandatory. Latios functions best with frequent entry to the field, making entry hazard removers like Corviknight and Great Tusk excellent partners. Slow pivots like Corviknight and Deoxys-D can help get it onto the field safely.</p>"
      },
      "Speed Control": {
        "description": "<p>Choice Scarf Latios is a reliable source of speed control and offensive pivot that sets itself apart from Azelf with its powerful Draco Meteor. Psyshock allows Latios to effectively have mixed coverage and 2HKO common RegenVest pivots like Swampert and Manaphy after Spikes, while Luster Purge is notably stronger against common offensive Pokemon like Hisuian Electrode, Cinderace, and Barraskewda and is more spammable than Draco Meteor. Adaptability is more consistent, as it is always active and does not announce itself, while Hadron Engine can support Electric-types and Surge Surfer users, disrupt opposing terrain from the likes of Azelf and Deoxys-S, and let Latios OHKO Corviknight with Thunderbolt. Trick is an option in the last slot to shut down bulky setup sweepers like Cresselia and cripple walls like Deoxys-D. Latios works best with slow pivots like Corviknight and Swampert that can get it onto the field in advantageous positions; similarly, Latios often provides easy entry to slow, wallbreaking teammates like Galarian Zapdos and Ceruledge with Flip Turn. Latios is heavily threatened by Chien-Pao and Roaring Moon, as they discourage it from using its Psychic-type moves and can even threaten it thanks to priority moves and Choice Scarf, respectively. Physically defensive Manaphy and Fluffy Corviknight, respectively, can provide insurance against these threats.</p>"
      },
      "Calm Mind": {
        "description": "<p>Latios leverages a good Speed tier, sky-high Special Attack, and Calm Mind to be one of the tier's most dangerous wallbreakers and sweepers. Psyshock greatly threatens common RegenVest users such as Swampert, Manaphy, and Meloetta. Recover provides additional longevity, allowing Latios to switch in against foes such as Heatran and Pecharunt and threaten to wallbreak multiple times in a single game. Calm Mind allows Latios to set up against passive foes such as Corviknight and Skarmory. Soul Dew notably makes Adaptability Draco Meteor a guaranteed 2HKO on Corviknight after a Calm Mind, but Leftovers is an option to give Latios more longevity. Adaptability is the preferred ability for consistent high damage, allowing Latios to reliably 2HKO Blissey and RegenVest Swampert with Psyshock, while Tinted Lens is an option to threaten an OHKO on Corviknight and Gholdengo with Draco Meteor after a Calm Mind and 2HKO Heatran and Hisuian Goodra with Psyshock after a boost. Latios works fantastically with other powerful special attackers such as Iron Moth, Zapdos, and Azelf, as they all appreciate RegenVest users and Blissey being weakened. Latios also appreciates slow, physically bulky pivots such as Corviknight, Mandibuzz, and physically defensive Manaphy, who which can both pivot it in safely and effectively check the offensive Dark-types that threaten Latios such as Roaring Moon, Meowscarada, and Chien-Pao. Latios also appreciates the aforementioned Corviknight and Mandibuzz, along with Great Tusk, for their consistent entry hazard removal, allowing it to enter the field and frequently threaten the foe.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}, {"user_id": 540420, "username": "Gimmicky"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 594122, "username": "Evie"}, {"user_id": 580765, "username": "cat"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 552227, "username": "Kinetic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Jirachi": {
    "sets": {
      "RegenVest": {
        "description": "<p>Jirachi sets itself apart from other RegenVest pivots by better checking the prevalent, powerful Psychic-types—Latios, Deoxys-S, Scream Tail, and Azelf—and providing Future Sight support to powerful physical wallbreakers like Zamazenta, Chien-Pao, and Ceruledge. Many of the best physical walls such as Corviknight and Manaphy survive by barely avoiding 2HKOs, which they fail to when switching into Future Sight as well, while others like Iron Hands, Great Tusk, and Pecharunt take far too much damage from Future Sight anyway. Doom Desire is an alternative with no immunities that also hits Scream Tail harder but otherwise has worse coverage against relevant targets. Psychic Noise denies recovery to Empoleon and Corviknight and punishes aggressive Iron Moth and Great Tusk switch ins. The last moveslot is extremely flexible; Thunderbolt for Corviknight, Iron Head for Scream Tail, Ice Punch for Dragonite, and Body Slam to fish for paralysis are some of the most notable options. Jirachi should be paired with physical wallbreakers on more offensive teams, as they best take advantage of its combination of slow pivoting and Future Sight. Fighting-types like Iron Hands and Zamazenta, Ceruledge, and the Ogerpon formes are excellent teammates that also appreciate Jirachi switching into fast Psychic-types like Deoxys-S and Azelf attempting to revenge kill them. Jirachi is weak to several common special attackers, most notably primal weather users like Iron Moth and Primarina, and Ghost-types such as Gengar and Gholdengo, so teammates that can offensively check them like other primal weather users and Roaring Moon are greatly appreciated. Since Jirachi is wholly dependent on Regenerator for recovery, it appreciates entry hazard removers like Great Tusk and Corviknight to maximize that recovery.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys-Defense": {
    "sets": {
      "Unaware": {
        "description": "<p>Boasting high defensive stats and a plethora of utility moves, Deoxys-D makes for an excellent Unaware wall that can check Iron Hands and setup Great Tusk while also providing additional utility like setting entry hazards and pivoting. Spikes is the preferred hazard, as Deoxys-D can usually set multiple layers, but Stealth Rock is an alternative for teams that lack a Stealth Rock setter otherwise, and Knock Off can be used to limit opposing setup threats like Iron Boulder and Quaquaval while also debilitating walls like Corviknight and Swampert. Teleport can be used in conjunction with Deoxys-D's low Speed to safely switch Pokemon in, while Thunder Wave can be used to cripple Iron Boulder and Dragonite. Leftovers is the preferred item for extra longevity, but Heavy-Duty Boots is an option on Teleport sets to enable easier pivoting. On teams that do not need setup control, Fluffy and Intimidate dramatically increase its physical bulk versus key targets like Iron Boulder. Defensive Pokemon like Corviknight and Mandibuzz appreciate Deoxys-D being able to take on setup threats such as Iron Hands and Iron Boulder, allowing them to better handle Dark-types like Roaring Moon. Offensive Pokemon like Galarian Zapdos, Chien-Pao, and Ceruledge appreciate Deoxys-D being able to weaken opposing walls with hazards or Knock Off, as well as potentially getting them in safely if it's running Teleport. Deoxys-D narrowly avoids 2HKOs from stronger wallbreakers like Iron Boulder, so hazard control options like Scrappy Great Tusk and Corviknight are highly recommended so that Deoxys-D can have more longevity.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475288, "username": "Tranquility"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 611238, "username": "LordBox"}, {"user_id": 552227, "username": "Kinetic"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys-Speed": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Deoxys-S is an incredible wallbreaker, boasting powerful Psychic Terrain-boosted Expanding Force alongside the highest relevant base Speed stat in the tier. Ice Beam hits Roaring Moon, Mandibuzz, and Dragonite for massive damage, while Knock Off debilitates foes, especially RegenVest users like Manaphy, Swampert, and Meloetta. Energy Ball hits Swampert and Iron Boulder; alternatively, Dark Pulse OHKOes Azelf and 2HKOes Gholdengo and Deoxys-D while still hitting Iron Boulder. Trick can debilitate defensive Pokemon, but it comes with the cost of weakening Deoxys-S. A Timid nature allows Deoxys-S to outspeed +1 Volcarona and Choice Scarf Sandy Shocks, while a Modest nature gives it more power, allowing it to always 2HKO defensive Gholdengo after slight chip damage. Other special wallbreakers like Iron Moth, Sandy Shocks, and Latios are appreciated, as they can break down shared checks such as RegenVest users like Manaphy, Swampert, Meloetta, and Hisuian Goodra with Deoxys-S. Deoxys-S is very frail, so slow pivots like Corviknight, Swampert, and Manaphy are very helpful. Additionally, entry hazard support from allies such as Great Tusk and Heatran can help chip would-be checks into range of a KO.</p>"
      },
      "Sheer Force": {
        "description": "<p>With its sky-high Speed stat and fantastic coverage, Deoxys-S is able to outspeed a significant portion of the metagame and threaten many common metagame threats with huge damage thanks to Sheer Force. Ice Beam OHKOes Zapdos and offensive Roaring Moon after some chip damage and 2HKOes Mandibuzz. Energy Ball 2HKOes RegenVest Swampert, while Thunderbolt can be run instead to threaten Corviknight. Focus Blast lets Deoxys-S damage Steel-types like Heatran and Hisuian Goodra, while Dark Pulse can be used instead to 2HKO Deoxys-D and Gholdengo. Knock Off is another option that can be used to debilitate opposing Pokemon like Swampert and Manaphy by removing their held items, making them easier for Deoxys-S and its teammates to deal with. Deoxys-S struggles against specially defensive Pokemon like Meloetta and Manaphy, so it pairs well with physically offensive partners like Chien-Pao, Meowscarada, and Galarian Zapdos that can effectively force them out. Due to its relative frailty and lack of recovery, Deoxys-S benefits from pivots like Corviknight and entry hazard removers like Great Tusk that allow it to come in safely. Entry hazard setters like Skarmory, Scream Tail, and Smeargle can also help weaken foes, making them easier for Deoxys-S to handle.</p>"
      },
      "Lead": {
        "description": "<p>Deoxys-S is one of the best hyper offense leads due to its high base Speed and access to dual screens, Taunt, and Stealth Rock. Taunt shuts down entry hazard setters like Deoxys-D and Smeargle; setup sweepers such as Thundurus-T, Manaphy, and Iron Boulder; and Defoggers like Corviknight. Pokemon such as Iron Moth and Chien-Pao that threaten Defog users pair well with Deoxys-S, since Defog threatens to remove dual screens after Deoxys-S has left the field. Mandibuzz is the biggest threat to Deoxys-S's dual screens, since its Defog cannot be blocked by Prankster Taunt. Since Deoxys-S is usually used as a suicide lead, it should only be used on hyper offense teams. Deoxys-S pairs well with setup sweepers like Manaphy, Roaring Moon, and Chien-Pao, since it's able to reliably get up dual screens, which allow them set up more easily and make harder to revenge kill. Pokemon weak to entry hazards such as Volcarona appreciate Deoxys-S's ability to block them from being set with Taunt. Dark-types, such as Dragon Dance Roaring Moon, are able to set up in front of Deoxys-S due to being immune to Prankster Taunt, so switch-ins like Great Tusk are required.</p>"
      },
      "Protean": {
        "description": "<p>Protean Deoxys-S is a fast mixed wallbreaker and late-game cleaner, using its wide list of coverage to its advantage. Thunderbolt is Deoxys-S's most spammable move, as it hits a majority of the metagame for solid damage such as Primarina, Manaphy, non-Volt Absorb Corviknight, and Gholdengo. Ice Beam is used to hit Ground- and Dragon-types hard, such as Great Tusk, Dragonite, and Roaring Moon. Energy Ball can be used to beat Swampert while also pressuring Water- and Ground-types instead of being forced to predict. Superpower acts as Deoxys-S's main physical attack, being able to hit specially defensive walls such as Hisuian Goodra, Blissey, and Meloetta. Knock Off helps Deoxys-S and its teammates by crippling RegenVest users to be taken on better later in the game. Entry hazards like Stealth Rock and Spikes let Deoxys-S potentially weaken defensive checks for itself and its teammates. Life Orb is used to more easily use Deoxys-S's mixed potential but can reduce how many times how many times its able to switch in. Choice Specs can be used instead as an easier way for Deoxys-S to hit 2HKO damage rolls on RegenVest Pokemon and give it more switch-in opportunities, but this gives it less flexibility and physical power. With 236 Speed EVs and a Naive nature, Deoxys-S is able to outrun +1 Jolly Garchomp as well as neutral Regieleki. Setup sweepers and Choice-locked Pokemon like Roaring Moon, Chien-Pao, and Manaphy appreciate Deoxys-S's presence, as it can help with weakening or taking out any of their checks such as Great Tusk, Primarina, and RegenVest users. Teams containing slower attackers also appreciate Deoxys-S, as it can act as a form of speed control. Deoxys-S does struggle with making it onto the field safely due to both hazards and having minimal bulk, so having a defensive pivot or a hazard remover would help it, like Great Tusk, Corviknight, or Mandibuzz.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}, {"user_id": 594122, "username": "Evie"}, {"user_id": 603640, "username": "Hiusi guy"}, {"user_id": 620268, "username": "skippergamez"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 523866, "username": "UT"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 558636, "username": "zastra"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Empoleon": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Empoleon's typing, bulk, and reliable recovery allow it to serve as an excellent special wall and pivot that doesn't use the Regenerator slot. Its typing gives it a good matchup versus Azelf, Choice Specs Deoxys-S, Primarina, and Gholdengo. Empoleon's highly customizable moveset can include utility options like Stealth Rock and Knock Off, Haze and Roar to deter setup, Surf for reliable damage against Pokemon like Corviknight, and Earthquake to hit Desolate Land users such as Iron Moth and Heatran. Volt Absorb counters Zapdos, Regieleki, and electric coverage from Pokemon like Latios and Deoxys-S, while Bulletproof checks Gengar, Gholdengo, and Weather Ball users like Primarina and Manaphy. A Sassy nature and 0 Speed IVs allow slow pivoting with Flip Turn, notably slower than that of minimum speed Corviknight, providing safe entry for offensive teammates such as Iron Moth, Chien-Pao, and Sandy Shocks. Empoleon is threatened by physical attackers like Roaring Moon, Slither Wing, and Barraskewda, so it appreciates physically defensive teammates like Great Tusk, Corviknight, and Mandibuzz. These teammates also help remove the entry hazards that can overwhelm Empoleon, and in return, benefit from its ability to switch into special threats. On bulkier teams, Empoleon can forgo a pivoting move to instead focus entirely on its utility and walling capabilities. On these structures, a secondary special wall like Blissey can be a good partner to check special attackers like Sandy Shocks and Enamorus-T that can hit Empoleon super effectively. Empoleon can struggle against Desolate Land users, especially if it lacks Earthquake, so checks to these such as Garchomp and Well-Baked Body Corviknight and Skarmory can be helpful teammates as well.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 596834, "username": "cumps"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 475288, "username": "Tranquility"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Garchomp": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Garchomp uses its good defensive typing and bulk to be an excellent entry hazard setter that can check a myriad of special attackers like Heatran, Sandy Shocks, and Hisuian Electrode. Spikes is usually preferred, but Stealth Rock can be used on offensive teams that are unlikely to get multiple layers of Spikes up. Stone Edge threatens Flying-types like Zapdos, while Flamethrower hits non-Well-Baked Body Corviknight and Earth Eater Gholdengo, discouraging the former from removing entry hazards. Stealth Rock can also be run in the last moveslot in conjunction with Spikes on bulkier teams that appreciate having both and that can threaten entry hazard removers like Corviknight and Great Tusk. A Sassy nature should be used if running Flamethrower; otherwise, Careful is preferred. Powerful attackers like Gengar and Latios appreciate Garchomp's Spikes support letting them break past walls like Hisuian Goodra and Empoleon easier. Frailer teammates like Azelf appreciate Garchomp's ability to switch into and threaten their switch-ins like Heatran and Gholdengo. Garchomp can't check certain special attackers like Primarina and Latios, making teammates that can deal with them like Empoleon ideal on less offensive teams. Garchomp also struggles against powerful physical attackers like Roaring Moon and Chien-Pao, making teammates that can handle them like Corviknight and Iron Hands good partners.</p>"
      },
      "Double Dance": {
        "description": "<p>Garchomp is a great cleaner and sweeper on offensive teams thanks to its excellent Attack, good bulk, and high-Base Power moves, and it has the ability to outspeed common offensive threats after a Scale Shot such as Iron Boulder, Zamazenta, and Roaring Moon. Stone Edge threatens Flying-types like Mandibuzz and Zapdos and hits Corviknight decently hard, and after using Swords Dance, Garchomp can OHKO offensive Great Tusk with Earthquake and 2HKO Fluffy Corviknight with Stone Edge. Life Orb gives Garchomp a decent chance of 2HKOing Corviknight at +1 and guarantees the OHKO on Choice Band Zamazenta at +2, while Loaded Dice offers more consistency to Scale Shot and avoids recoil from Life Orb. An Adamant nature lets Garchino 2HKO Unaware Scream Tail and Deoxys-D with Life Orb, while a Jolly nature lets it outspeed Choice Scarf Sandy Shocks and Modest Deoxys-S after a Scale Shot. Physical wallbreakers like Chien-Pao and Zamazenta appreciate Garchomp's cleaning ability once it gets set up; in return, they can help chip walls like Deoxys-D and Corviknight that it can struggle to break through, giving it an easier time cleaning. Garchomp's only decent Speed prior to setting up leaves it vulnerable to being KOed by threats like Latios and Roaring Moon, so teammates that can check them on hyper offense teams like Gholdengo and Zamazenta, respectively, are appreciated. Even after setup, faster Pokemon like Choice Scarf Azelf and priority users like Dragonite can threaten massive damage on Garchomp, making teammates that can deal with them like Roaring Moon and Gholdengo, respectively, good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 475288, "username": "Tranquility"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Lucario": {"sets": {"Magic Guard": {}}},
  "Azelf": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Thanks to Azelf's great Speed tier, expansive movepool, and extremely spammable STAB move under Psychic Surge in Expanding Force, it is one of AAA's most dangerous offensive pivots and cleaners. U-turn allows Azelf to generate momentum for its team while also providing solid damage into Pokemon like Roaring Moon and Chien-Pao as well as pivoting on RegenVest users like Swampert and Hisuian Goodra. The final two moveslots are very flexible. Knock Off debilitates switch-ins like Swampert, Manaphy, and Hisiuan Goodra. Dazzling Gleam threatens to OHKO offensive Roaring Moon and does good damage to Mandibuzz and Chien-Pao, while Flamethrower allows Azelf to still hit the latter while having coverage into Corviknight and non-Well-Baked Body Gholdengo. Trick can punish switch-ins like Hisuian Goodra and Manaphy while also debilitating other walls like Deoxys-D, but it makes Azelf a less reliable form of Speed control. Defensive pivots like Corviknight and Swampert give Azelf a Pokemon to fall back on and a slow pivot to get it in safely, while offensive pivots like Barraskewda and Roaring Moon appreciate Azelf setting up Psychic Terrain to get rid of their weakness to priority moves. Depending on its coverage, Azelf can struggle breaking through Steel- and Dark-type Pokemon like Hisuian Goodra and Mandibuzz as well as bulky special walls like Swampert and the rare Blissey, so wallbreakers like Great Tusk and Galarian Zapdos make excellent partners, as they can deal with these Pokemon, and the former also removes entry hazards Azelf can struggle against. Other offensive Pokemon that are weak to priority moves like Ogerpon-W, Roaring Moon, and Chien-Pao also make excellent partners with Azelf due to the Psychic Terrain it sets up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Heatran": {
    "sets": {
      "Desolate Land": {
        "description": "<p>Heatran's useful typing and high natural Special Attack make it an effective Stealth Rock setter capable of dissuading common entry hazard removers like Corviknight and Great Tusk from switching in. Desolate Land allows Heatran to soft check opposing Water-types such as offensive Manaphy and users of Primordial Sea like Zapdos, Primarina, and Ogerpon-W while also amplifying the power of Magma Storm. Solar Beam allows Heatran to 2HKO opposing RegenVest Swampert, which would otherwise easily switch into it. Will-O-Wisp allows Heatran to incapacitate opposing physical attackers like Roaring Moon, Dragonite, and Iron Boulder that may otherwise be willing to switch into it. Alternatively, Earth Power can hit opposing Heatran, Iron Moth, and Well-Baked Body Gholdengo, while Power Gem can hit opposing Primordial Sea Zapdos and Well-Baked Body Mandibuzz. 60 Speed EVs allow Heatran to outspeed uninvested Gholdengo, with the remaining EVs maximizing its special bulk to better check Pokemon like Azelf and Deoxys-S. Heatran struggles to offensively break through opposing specially defensive Pokemon such as RegenVest Manaphy and Swampert, so physically offensive wallbreakers like Roaring Moon and Chien-Pao are good teammates; in return, Heatran can keep up Stealth Rock in front of entry hazard removers like Corviknight. Heatran's 4x Ground weakness mandates teammates like Corviknight and Zapdos that can answer opposing Ground-types like Great Tusk. Pokemon using Primordial Sea such as Zapdos and Ogerpon-W can switch into and threaten Heatran, so teammates that can check these Pokemon such as Swampert and Dragonite are useful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 473082, "username": "abriel"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Cresselia": {
    "sets": {"Unaware": {"description": "<p>Cresselia's titanic bulk and access to Calm Mind allow it to pose a major threat to the opponent's team, turning other setup sweepers into fodder. It can also leverage its Psychic typing to check huge threats such as Azelf and Deoxys-S. Late game, Cresselia can function as a terrifying and offbeat set-up sweeper, boosting and using Moonblast to hit Dark-types such as Chien-Pao and Roaring Moon. Cresselia's ideal opportunity to set up is in front of passive walls like Manaphy, Swampert, and non-Unaware Blissey. Cresselia's best teammates are Pokemon that can take on Dark-Type moves like Corviknight and Great Tusk. Prankster Corviknight and Deoxys-S can set dual screens to make Cresselia's setup easier. Cresselia also appreciates teammates such as Mandibuzz, Blissey, and RegenVest Hisuian Goodra that can switch into Ghost-types.</p>"}},
    "credits": {"writtenBy": [{"user_id": 662581, "username": "aiko's band"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 594122, "username": "Evie"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Manaphy": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Manaphy's good natural bulk and bevy of utility moves let it serve as a great blanket special switch-in and bring in teammates with a slow U-turn. Scald's burn chance looms over physical attackers looking to take advantage of Manaphy's lower physical bulk. Knock Off is used to remove key items like Heavy-Duty Boots and Assault Vest from potential switch-ins like Swampert, Corviknight, and Desolate Land Iron Moth. Ice Beam dissuades Roaring Moon and Dragonite from setting up on Manaphy. Energy Ball is optionally usable to hit Swampert and opposing Manaphy. Manaphy is excellent at switching into attacks from Heatran, Gholdengo, and Primarina, utilizing a slow U-turn to bring in strong but frail wallbreakers like Chien-Pao and Iron Boulder. Great Tusk is a good partner, being immune to the Electric-type attacks Manaphy is weak to, doubling as a top tier entry hazard remover, switching into Knock Off attempts from the likes of Roaring Moon and Mandibuzz. Manaphy should be aware of Knock Off, as it is heavily reliant on Assault Vest to provide defensive value. Manaphy can be overwhelmed by teams with multiple special wallbreakers like Deoxys-S, Hisuian Electrode, Azelf, and Latios, so it should be run either with a secondary special wall or on more offensive teams that limit opposing wallbreakers. Investing in Defense is also an option, allowing Manaphy to switch into threats like Chien-Pao, Barraskewda, and Cinderace and pivot out while using Assault Vest to function as a mixed wall.</p>"
      },
      "Tail Glow": {
        "description": "<p>Manaphy is a potent late-game sweeper and wallbreaker with the combination of Tail Glow's immediate power boost, its good bulk, and its decent speed to overwhelm foes. It can use either Protosynthesis to restrict foes' ability to revenge kill it or Primordial Sea to help with wallbreaking and give it more switch-in opportunities. Scald is used as its main STAB move but can be substituted for Weather Ball on Primordial Sea sets as a stronger STAB move and a way to hit incoming Desolate Land Pokemon like Ceruledge and Heatran. Ice Beam helps deal with Dragon-types like Latios, Roaring Moon, and Dragonite. Energy Ball helps with taking on Water-types likes Swampert, Primarina, and opposing Manaphy. Finally, Tail Glow-boosted Psychic OHKOes Iron Moth and Toxapex and 2HKOes Desolate Land Ceruledge. Manaphy appreciates pivots such as Corviknight, Mandibuzz, and Deoxys-D that have the ability to safely get it onto the field to let it clean up games much easier and help it get through its sweep by providing entry hazard control. Manaphy is also able to help these pivots by providing offensive pressure and being able to end games for them. Manaphy struggles to deal with specially bulky walls such as Blissey, Hisuian Goodra, and Unaware Deoxys-D, so it partners up well with Pokemon like Galarian Zapdos, Roaring Moon, and Latios to help deal with them and pressure them into more unfavorable positions. Manaphy also works well on hyper offense teams if using Protosynthesis due to Booster Energy being single-use; on these teams, it likes to be supported by other special wallbreakers such as Latios, Gholdengo, and Azelf that can help to wear down specially bulky checks for Manaphy like Blissey, Iron Moth, and Ceruledge.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}, {"user_id": 620359, "username": "olivia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Samurott-Hisui": {
    "outdated": true,
    "sets": {
      "Choice Band": {
        "description": "<p>Hisuian Samurott is a decent wallbreaker due to Adaptability, Choice Band, and a great STAB combination that also pressures the ever-present Corviknight to choose between recovery and Defogging. Ceaseless Edge is a versatile move that deals good damage to foes while also setting up Spikes, helping Hisuian Samurott's teammates or even itself to pick off chipped foes later in the game. Knock Off provides utility by removing items from switch-ins such as Corviknight and Quaquaval. Sucker Punch is a good priority move that lets Hisuian Samurott deal heavy damage to faster foes such as Cinderace, Iron Moth, and Zapdos. Brick Break can be used instead to deal with dual screens leads such as Corviknight and Mew. Hisuian Samurott's ability to set up Spikes and pester defensive Pokemon such as Corviknight and Scream Tail by removing their items is appreciated by various offensive teammates such as Chien-Pao and Galarian Zapdos that can take advantage of chipped foes. Fluffy and Intimidate Quaquaval wall Hisuian Samurott very easily, so spinblockers such as Desolate Land Skeledirge and Ceruledge are good partners as they can pressure Quaquaval and block it from removing Spikes set by Hisuian Samurott. Hisuian Samurott is susceptible to getting revenge killed due to low Speed and bulk, so robust walls such as Corviknight and Meloetta that can pivot and provide safe switch in opportunities to it are appreciated.</p>"
      },
      "Swords Dance": {"description": "<p>After a Swords Dance boost, Hisuian Samurott becomes a terrifying wallbreaker that can dent physically defensive walls like Corviknight. Sucker Punch acts as speed control against Pokemon like Zapdos and Iron Moth. Ceaseless Edge forces defensive Pokemon, such as Corviknight, to switch in and choose between entry hazard removal or healing. Black Glasses is the item of choice, boosting its Dark-type moves without the recoil of Life Orb. Pokemon like Thundurus and Iron Moth are very useful teammates, as they compensate for Hisuian Samurott's average Speed tier and can heavily damage physical walls that counter Hisuian Samurott like Quaquaval and Zamazenta-C. In return, Hisuian Samurott wears down special walls with its ability to set up a layer of Spikes. Additionally, due to its unimpressive bulk, Hisuian Samurott relies on walls such as Corviknight and Hisuian Goodra to compensate for the lack of defensive utility it brings.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 532881, "username": "Frozoid"}, {"user_id": 629794, "username": "LOrd Fernado"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 450411, "username": "Atha"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Zoroark-Hisui": {
    "sets": {
      "Sheer Force": {
        "description": "<p>Hisuian Zoroark serves as a threatening sweeper and wallbreaker thanks to its great Special Attack, good Speed, and incredible moveset. Body Slam allows Hisuian Zoroark to hit specially defensive walls such as Manaphy, Swampert, and Meloetta. Focus Blast hits foes like Hisuian Goodra, Roaring Moon, Chien-Pao, Blissey, and Mandibuzz. Knock Off allows Hisuian Zoroark to remove crucial items like Manaphy's and Swampert's Assault Vests and Mandibuzz's Heavy-Duty Boots, helping it and its teammates break through these Pokemon and allowing it to be more self sufficient, as it does not rely on teammates to get rid of said items. Psychic is an alternative option that dents Iron Hands, Zamazenta, Great Tusk, and Iron Moth. Sheer Force lets Hisuian Zoroark hit harder to achieve feats such as 2HKOing non-Unaware Mandibuzz. A Timid nature should be used on sets with Nasty Plot, as a higher Attack is not needed. Teammates such as Iron Moth and Azelf appreciate Hisuian Zoroark's ability to force chip damage on special walls such as RegenVest Manaphy and Meloetta. Hisuian Zoroark is very frail, leaving it prone to revenge killing attempts from revenge killers like Roaring Moon and Azelf, so it appreciates slow pivots like Corviknight and Manaphy that can help it switch in safely. Hisuian Zoroark appreciates entry hazard setters like Great Tusk and Deoxys-D, as they can help chip walls that would otherwise beat it.</p>"
      },
      "Magic Guard": {
        "description": "<p>Hisuian Zoroark finds a niche on semi-stall and offensive teams as a progress maker or as an offensive pivot with its wide variety of utility options and ability to ignore passive damage thanks to Magic Guard. Knock Off cripples special walls by depraving RegenVest users such as Manaphy and Swampert of their Assault Vests or by limiting Blissey's, Empoleon's, and Mandibuzz's longevity by removing their Leftovers or Heavy-Duty Boots, allowing Hisuian Zoroark or teammates like Iron Moth and Azelf to break past them later in the game. Will-O-Wisp further weakens these special walls, forcing them to be worn down over time and notably enabling Hisuian Zoroark's Hex to break past them; it also cripples physical threats like Great Tusk and Iron Hands. U-turn allows Hisuian Zoroark to generate free momentum for its team while forcing its switch-ins to take chip damage from entry hazards as it pivots out, whereas Taunt denies Blissey and Empoleon recovery. Hisuian Zoroark should be paired with offensive entry hazard setters like Sandy Shocks, Pixilate Scream Tail, and Galvanize Kommo-o that can keep up the pressure on hazard removers to maximize its ability to wear the opposing team down over time. Sturdy checks to offensive threats that force Hisuian Zoroark out like Roaring Moon, Choice Scarf Gholdengo, and Azelf are needed, so good teammates that can stave them off like Great Tusk and Empoleon are recommended.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}, {"user_id": 594122, "username": "Evie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 594122, "username": "Evie"}, {"user_id": 528036, "username": "Sulo"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 475288, "username": "Tranquility"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Mandibuzz": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Mandibuzz is an excellent physical wall, leveraging its typing, excellent role compression, and good natural bulk to act as a valuable teammate, checking threats like Psychic Surge Deoxys-S, Azelf, and Choice Band Roaring Moon. U-turn, in combination with 0 Speed IVs and a Relaxed nature, allows Mandibuzz to act as a fantastic slow pivot, benefiting frail wallbreakers like Chien-Pao, Galarian Zapdos, and Latios, while Toxic allows it to cripple switch-ins like Great Tusk and Zapdos. Defog allows Mandibuzz to act as an excellent hazard control option that is appreciated by wallbreakers and pivots like Chien-Pao, Roaring Moon, and Azelf, while Knock Off can cripple other switch-ins like Corviknight, Magic Guard Quaquaval, and Galarian Zapdos. Unaware allows Mandibuzz to better check setup threats like Bulk Up Great Tusk, Dragon Dance Dragonite, and Swords Dance Ceruledge, while Well-Baked Body allows it to check Cinderace and Ogerpon-H while still checking the aforementioned Swords Dance Ceruledge, and Fluffy allows it to have an easier time checking wallbreakers like Choice Band Roaring Moon, Barraskewda, and Galarian Zapdos. Mandibuzz has a poor matchup against certain wallbreakers like Chien-Pao and Iron Boulder; thus, a secondary physical wall like Intimidate Corviknight is appreciated. Mandibuzz also appreciates special walls like RegenVest Hisuian Goodra, Manaphy, and Swampert that can switch into specially offensive threats like Zapdos, Iron Moth, and Sandy Shocks.</p>"
      },
      "Magic Guard": {
        "description": "<p>Mandibuzz is a solid physical wall with high defensive stats, a useful typing, and valuable utility moves in Defog, Toxic, and Knock Off. Magic Guard circumvents its normally crippling Stealth Rock weakness, letting it act as an excellent Knock Off absorber from the likes of Roaring Moon and Meowscarda, as well as a status absorber from Toxapex, Pecharunt, and opposing Mandibuzz. Foul Play allows Mandibuzz to beat physical setup sweepers such as Dragonite and Ceruledge, while Knock Off can limit the longevity of defensive walls and remove Assault Vests, enabling special attacking teammates like Primarina, Latios, and Azelf. Toxic can cripple walls such as Swampert and Scream Tail and shuts down bulky setup sweepers like Calm Mind Scream Tail and Bulk Up Great Tusk. Defog provides valuable entry hazard control, especially for Stealth Rock-weak wallbreakers Chien-Pao, Ceruledge, and Ogerpon-H, which Mandibuzz can also slow pivot in with U-turn alongside 0 Speed IVs and a Relaxed nature. Leftovers provides passive healing that can't be mitigated by indirect damage, while Rocky Helmet punishes contact moves, most notably U-turn from Corviknight and Roaring Moon. Mandibuzz naturally loses to many of the tier's common physical attackers, including Chien-Pao and Ogerpon-C, exacerbated by the fact that it lacks a true defensive ability or immunity; other physically defensive walls such as Corviknight and Toxapex help shore up these weaknesses. Although Mandibuzz can be an emergency switch-in to Psychic-types like Azelf, Deoxys-S, and Latios, it should generally not be relied on due to its uninvested special bulk and their various super effective coverage moves. Therefore, Mandibuzz appreciates specially defensive walls, such as Empoleon, Manaphy, and Swampert, to check the previously mentioned special attackers along with Gengar and Primarina.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Hydreigon": {"sets": {"Nasty Plot": {}}},
  "Volcarona": {
    "sets": {
      "Quiver Dance": {
        "description": "<p>Volcarona serves as a ferocious wallbreaker found on hyper offense teams, capable of denting large holes into specially defensive walls like Blissey and RegenVest Hisuian Goodra, allowing itself or its teammates to clean up late-game. Giga Drain chunks bulky Water-types like Swampert and Manaphy, while Psychic provides neutral coverage against foes that resist Fire- and Bug-type moves like Primordial Sea Zapdos and Ceruledge, and Bug Buzz acts as a more reliable secondary STAB move, sniping targets like Ogerpon-W and RegenVest Meloetta. While Sheer Force grants Volcarona stupefying levels of power, notably threatening an OHKO with Psychic against Zapdos, Turboblaze lets it melt Well-Baked Body Steel-types like Corviknight and Gholdengo into liquid metal. Life Orb is the preferred item, since Volcarona wants as much power as possible; however, Heavy-Duty Boots improves its longevity by allowing it to come in multiple times in a game without fear of being worn down by entry hazards. Teammates that appreciate Volcarona's wallbreaking capabilities like Deoxys-S and Tail Glow Manaphy should be paired with it to clean up late-game. Offensive Bulk Up Great Tusk is an excellent partner for Volcarona on hyper offensive teams, notably clearing hazards that impede Volcarona's wallbreaking ability. Dual screens setters like Corviknight and Deoxys-S are great partners for Volcarona, allowing it to safely set up with Quiver Dance and survive a hit in a pinch. Revenge killers like Dragonite, Choice Band Barraskewda, and Iron Boulder threaten Volcarona, so having a teammate that can use them as setup fodder like Cresselia or Dragon Dance Roaring Moon is recommended.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 475288, "username": "Tranquility"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Cobalion": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Cobalion serves as a Stealth Rock setter on offensive teams while also checking common anti-offense threats Choice Scarf Roaring Moon and Choice Band Chien-Pao. Its high-Base Power mixed STAB moves make it deceptively hard to switch into, as it can 2HKO both common specially defensive walls such as RegenVest Manaphy and Swampert and physical walls like Mandibuzz and Great Tusk. Against foes it cannot reliably damage, such as Iron Hands and Gholdengo, it is still able to outspeed them and pivot on them with Volt Switch. None of the common entry hazard removers want to switch into Cobalion, as Mandibuzz, Iron Treads, and Great Tusk are all 2HKOed by it, while Corviknight takes too much from Volt Switch to comfortably Defog. Cobalion's EVs are very customizable, and the given spread lets it outspeed Great Tusk, which it easily 2HKOes on the switch, and 2HKO Manaphy after Stealth Rock. Cobalion serves best on offensive teams that can take advantage of its combination of hazard setting, wallbreaking, pivoting, and temporary checking of Roaring Moon and Chien-Pao; as a result, powerful wallbreakers such as Latios, Deoxys-S, and Ceruledge make excellent teammates, especially as they are reliably revenge killed by the aforementioned Dark-types. Cobalion cannot meaningfully threaten common bulky offense staples like Iron Hands and Gholdengo, so it appreciates reliable switch-ins to them such as Great Tusk and Swampert. Cobalion also appreciates slow pivots that get it on the field safely like Corviknight and RegenVest Manaphy, as preserving its HP is crucial to stopping Roaring Moon from cleaning late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 552227, "username": "Kinetic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Terrakion": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Terrakion is a fearsome wallbreaker thanks to its good Attack stat, useful offensive typing, high-Base Power STAB moves, and ability to bypass Fluffy. Earthquake allows Terrakion to hit non-Earth Eater Gholdengo and have a slightly stronger and more accurate option against foes like Iron Hands and Pecharunt. Terrakion's last moveslot is very flexible, as it likes to use Close Combat or Stone Edge almost all of the time. Stealth Rock can help wear down the opposing team and chip would-be defensive checks into range of a 2HKO, while Quick Attack can pick off faster, weakened foes, and Poison Jab does more damage to Primarina and Scream Tail. Teammates such as Iron Boulder, Zamazenta, and Roaring Moon appreciate Terrakion's ability to break through Corviknight, which is one of their biggest roadblocks, and can clean up weakened teams. Terrakion is vulnerable to being revenge killed due to its middling Speed stat, so a strong defensive backbone featuring Pokemon like Corviknight, Great Tusk, and Manaphy is recommended. Terrakion fits best on balance and bulky offense teams that need a wallbreaker and can help it switch in safely, so slow pivots like the aforementioned Corviknight and Manaphy make for good teammates. Additionally, special pivots like Azelf and Hisuian Electrode can get it in on special walls such as RegenVest Meloetta and Hisuian Goodra, which it can threaten out.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 594122, "username": "Evie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Thundurus": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Thanks to Thundurus's wide variety of coverage, access to Nasty Plot, and high Speed that allows it to outspeed Iron Moth and the Ogerpon formes, it functions as a hard-hitting sweeper. Nasty Plot further boosts Thundurus's high Special Attack, allowing it to OHKO Scream Tail, defensive Gholdengo, and RegenVest Manaphy at +2, while Knock Off can be used on Magic Guard sets to remove Assault Vest from Hisuian Goodra, Meloetta, and Iron Hands. Focus Blast gives Thundurus super effective coverage against Roaring Moon, Heatran, and Volt Absorb Empoleon. Psychic enables Thundurus to hit Iron Hands, Great Tusk, and Landorus; alternatively, Grass Knot consistently 2HKOes Ting-Lu and Swampert while still OHKOing Great Tusk, at the cost of Sheer Force sets taking Life Orb recoil. Sheer Force avoids Life Orb chip damage and boosts Thundurus's power, allowing it to 2HKO Deoxys-D and max HP Scream Tail after Stealth Rock, while Magic Guard also avoids Life Orb damage and chip damage from Stealth Rock. Thundurus struggles to sweep opposing teams possessing fast revenge killers such as Roaring Moon, Azelf, and Choice Scarf Gholdengo; therefore, it requires allies like Corviknight and Empoleon that easily switch into these threats and pivot it in. Fast special attacking pivots such as Azelf and Iron Moth appreciate Thundurus's ability to wallbreak, as it allows them to clean more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit_Gamin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Thundurus-Therian": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Bolstering an incredible Special Attack stat combined with a great movepool makes Thundurus-T an extremely threatening wallbreaker. Focus Blast nails foes such as Hisuian Goodra, Volt Absorb Empoleon, and Volt Absorb Corviknight. Psychic hits Great Tusk and Iron Hands, while Grass Knot can let Thundurus-T lure in and take out Swampert while still hitting Great Tusk for super effective damage. Nasty Plot boosts Thundurus-T's Special Attack to nuclear levels, allowing it to OHKO Hisuian Goodra and Blissey with Focus Blast after slight chip damage. Fast specially offensive pivots such as Iron Moth, Choice Scarf Azelf, and Latios appreciate Thundurus-T's incredible wallbreaking power, as they can take advantage of weakened special walls such as Swampert, Manaphy, and Meloetta. Thundurus-T loves slow, defensive pivots such as Corviknight, physically defensive Manaphy, and Swampert, as they can take on faster threats such as Iron Boulder, Chien-Pao, and Azelf, which all threaten to KO it, while also being able to safely pivot it in. Entry hazard Removal from the likes of Corviknight, Great Tusk, and Mandibuzz is also helpful, as Thundurus-T is very vulnerable to Stealth Rock. Sticky Web support from a teammate like Smeargle or Ribombee is another option, as it can give Thundurus-T the opportunity to outpace previously mentioned revenge killers.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 603931, "username": "Slither Wing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Landorus": {
    "sets": {
      "Desolate Land": {
        "description": "<p>Landorus is a good wallbreaker, taking advantage of Desolate Land's Water-type protection, Weather Ball's type synergy, and its Ground-type STAB moves to blast through Pokemon such as Corviknight, Iron Moth, and Gholdengo. Earth Power is used for its consistency, while Sandsear Storm provides higher power, allowing it to have a chance to OHKO Jirachi and Pixilate Scream Tail after a Nasty Plot; additionally, Sandsear Storm has the ability to burn foes, which can help if it doesn't take the KO. Grass Knot helps Landorus take on bulky Ground-types such as Swampert and Great Tusk, while Stealth Rock lets Landorus support its teammates, weaken its own checks like Primarina and non-Heavy-Duty Boots Dragonite, and threaten common entry hazard removal options such as Corviknight and the aforementioned Great Tusk. Using Leftovers lets Landorus stay on the field longer, while Life Orb lets it OHKO Swampert and 2HKO Primarina with a +2 Grass Knot. Pokemon like Iron Moth, Azelf, and Deoxys-S appreciate Landorus for being able to take on checks like Swampert, Empoleon, and Iron Treads. Landorus struggles to deal with Pokemon that aren't weak to its moves like Manaphy, Blissey, and RegenVest Roaring Moon, so having teammates like Latios, Great Tusk, and Iron Hands will help with taking them down. Similarly, Landorus enjoys having teammates that can remove items with Knock Off such as Roaring Moon, Manaphy, and Azelf, helping it to break down RegenVest Pokemon like Meloetta and Manaphy as well as Pokemon with Heavy-Duty Boots like Dragonite and Mandibuzz. Landorus struggles to switch in on many Pokemon due to its frailty, so it appreciates slow pivots such as Corviknight and Primarina, which also help it by checking offensive Pokemon like Roaring Moon, Iron Boulder, and Walking Wake.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 594122, "username": "Evie"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Landorus-Therian": {
    "sets": {
      "Desolate Land": {
        "description": "<p>Due to its solid offenses and access to U-turn and Stealth Rock, Landorus-T functions as a mixed attacker, decent pivot, and entry hazard setter. Weather Ball + Desolate Land provides Landorus-T a way to hit physically defensive Pokemon such as Corviknight, Great Tusk, and Fluffy Mandibuzz. With U-turn, Landorus-T can switch out of bad matchups against the likes of Dragonite, Well-Baked Body Skarmory, and Primordial Sea Zapdos and bring in Pokemon like Azelf, Iron Hands, and Iron Boulder to check them. Thanks to Desolate Land, Landorus-T is able to successfully wall Empoleon, Barraskewda, and non-Ice Beam Swampert, as well as prevent them from pivoting. Landorus-T helps strong physical attackers such as Roaring Moon and Zamazenta, since they have some trouble breaking through physically defensive Pokemon like Corviknight and Fluffy Mandibuzz. Landorus-T also helps special attackers such as Gengar and Latios that have difficulty breaking through specially defensive Pokemon like Hisuian Goodra and Empoleon, which also don't like the hazard chip damage it provides. However, Landorus-T struggles against Dragonite and Well-Baked Body Pokemon such as Skarmory and Chesnaught; Corviknight and Deoxys-D can be used to check Dragonite, while Zapdos and Primarina are options for beating Skarmory and Chesnaught. Landorus-T also tends to struggle against mixed walls such as Manaphy and Ting-Lu; therefore, Iron Hands and Hisuian Electrode make for good partners.</p>"
      },
      "Physical Wall": {
        "description": "<p>Thanks to Landorus-T's wide range of utility, decent physical bulk improved by Fluffy, and incredible Attack stat, it functions as a physical wall and pivot that can set entry hazards. U-turn allows Landorus-T to pivot out on Flying-types that it forces in like Corviknight, Skarmory, and opposing Landorus-T and switch into Pokemon that can check these foes, such as Iron Moth, Zapdos, and Primarina. Taunt prevents the setting of entry hazards by Skarmory and Ting-Lu and the use of Roost and Defog by Corviknight and Mandibuzz. Stealth Rock allows Landorus-T to wear down a great deal of Pokemon, but it typically chips Choice-item Pokemon such as Azelf, Roaring Moon, and Latios. Rocky Helmet is the preferred item, as it allows Landorus-T to chip down U-turn Pokemon like Corviknight and non-Magic Guard Roaring Moon, but Leftovers can also be used to increase its longevity. 8 Speed EVs allow Landorus-T to outpace maximum Speed Modest Primarina, while the rest are poured into HP and Attack to increase its overall bulk and offense. Knock Off users like Roaring Moon and Manaphy make great partners for Landorus-T as they are able to remove Leftovers and Heavy-Duty Boots from Pokemon like Mandibuzz, Corviknight, and Great Tusk, allowing it and its teammates to make progress faster. Landorus-T struggles against physical attackers like Chien-Pao and Barraskewda, so physical walls like Corviknight and Manaphy make good partners. Stealth Rock quickly wears down Landorus-T, especially Rocky Helmet variants, so hazard removal options like Corviknight and Great Tusk are mandatory.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit_Gamin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 594122, "username": "Evie"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 475288, "username": "Tranquility"}, {"user_id": 552227, "username": "Kinetic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Meloetta": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Meloetta is a capable pivot thanks to its ability to switch into most special attackers like Gholdengo, Scream Tail, Deoxys-S, and Iron Moth. Knock Off gives Meloetta an option to support its teammates by removing key items such as Assault Vest from Swampert and Hisuian Goodra, while Thunderbolt hits Manaphy and non-Volt Absorb Corviknight for high damage. Low Kick lets Meloetta chip Hisuian Goodra and Heatran, but Energy Ball can be used instead to 2HKO Swampert after its Assault Vest has been removed. Good teammates include Pokemon like Roaring Moon, Galarian Zapdos, Barraskewda, Chien-Pao, and Ceruledge because Meloetta can safely get them into the field with a slow U-turn. Physical attackers like Roaring Moon and Chien-Pao naturally threaten Meloetta out, so Pokemon that can deal with them, like Corviknight, Great Tusk, and defensive Quaquaval, make for good partners. Lastly, Meloetta appreciates entry hazard removal from the likes of Corviknight, Great Tusk, and Mandibuzz, to keep its HP high enough to switch into strong attackers.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 306317, "username": "corvere"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Chesnaught": {
    "sets": {
      "Flame Body": {
        "description": "<p>Chesnaught's bulk, recovery, and useful resistances let it frustrate several common physical attackers, most notably Roaring Moon, Ogerpon-C, and Barraskewda, and Spikes provides utility in nearly every matchup. Flame Body has a 30% chance to end the usefulness of opposing offensive pivots, again, most notably Roaring Moon, and greatly frustrates Rapid Spin Great Tusk attempting to clear Spikes. Iron Defense is the preferred fourth move to set up alongside Bulk Up Great Tusk and Swords Dance users like Iron Hands and Garchomp, while Knock Off can help remove Heavy-Duty Boots to further accentuate Spikes. The given EV spread lets Chesnaught outpace Corviknight, giving it extra chances to fish for a burn, as Brave Bird will not 2HKO it after Iron Defense. Chesnaught mostly finds its home on stall teams, where it can find plenty of teammates to switch into its common weaknesses, especially Fire and Psychic, and can find multiple switch-in opportunities to try and activate Flame Body, which is one of the few ways for stall teams to punish pivoting. Chesnaught is especially horrified of Fire-types like Ceruledge and Cinderace, as they can obliterate it without fear of a burn, and it cannot touch Ghost-types like Gengar and Hisuian Zoroark without Knock Off, so teammates like Well-Baked Body Mandibuzz are strongly recommended.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Talonflame": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Despite its low Attack stat, Talonflame carves out a niche as a usable wallbreaker and potent stallbreaker. Roost keeps Talonflame healthy throughout the course of a game, allowing it to reliably act as an offensive check to threats like Ogerpon-H, Great Tusk, and Iron Moth. Bulk Up gives revenge killers like Dragonite and Choice Scarf Roaring Moon a harder time at attempting to revenge kill Talonflame while threatening to let it snowball out of control. Flare Blitz smacks Steel-types like Corviknight, Gholdengo, and Iron Treads, while Swords Dance provides greater damage potential, allowing Talonflame to threaten a 2HKO on Pecharunt and OHKO Dragonite from full HP. Taunt allows Talonflame to reliably act as a stallbreaker, preventing would-be checks like Well-Baked Body Corviknight, Unaware Scream Tail, and Deoxys-D from checking it, while Will-O-Wisp provides more utility, burning switch-ins like Garganacl, Primordial Sea Zapdos, and Archaludon. Talonflame requires support from Pokemon that can wear the opposing team down, so entry hazard setters like Great Tusk, Skarmory, and Empoleon are wonderful teammates for it. Talonflame's unimpressive bulk necessitates good teammates that can switch into revenge killers like Azelf, Barraskewda, and Hisuian Electrode; hence, the aforementioned hazard setters, Iron Moth, and Blissey all work as excellent partners for it. Talonflame also notably requires teammates such as RegenVest Swampert and Meloetta that can deal with Fire-immune Electric- and Steel-types like Well-Baked Body Gholdengo, Primordial Sea Zapdos, and Archaludon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 611238, "username": "LordBox"}, {"user_id": 475288, "username": "Tranquility"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Goodra-Hisui": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Hisuian Goodra is a great defensive Pokemon with access to strong STAB moves, phazing, and a wide range of coverage, making it capable of switching into special attackers such as Gholdengo, Iron Moth, and Deoxys-S while not being entirely passive. Dragon Tail lets Hisuian Goodra force out setup sweepers such as Gholdengo and Manaphy, as well as racking up chip damage. Knock Off is a great option against Gholdengo, and it also cripples switch-ins such as RegenVest Manaphy, Swampert, and Meloetta. Hisuian Goodra has many options to fill the last two moveslots based on its team's needs: Earthquake hits Ceruledge, Heatran, and opposing Hisuian Goodra, while Flamethrower hits Corviknight and does more damage to non-Well Baked Body Gholdengo than Knock Off when its item has been removed already. Thunderbolt hits non-Volt Absorb Corviknight and Manaphy, Ice Beam threatens Great Tusk and Dragonite, and Draco Meteor is a strong STAB move that can OHKO Latios and does significant damage to Roaring Moon. Hisuian Goodra lacks pivoting unlike other RegenVest users such as Manaphy and Meloetta, so it finds its place on bulkier teams that can afford hard switching. Hisuian Goodra pairs well with strong but frail offensive threats such as Galarian Zapdos, wearing down the opponent's team and giving these threats the opportunity to clean up. Entry hazard removers such as Corviknight are great partners for Hisuian Goodra, allowing it to make full use of Regenerator. It also pairs well with hazard setters such as Deoxys-S thanks to Knock Off's ability to remove Heavy-Duty Boots from foes and Dragon Tail's phazing. Hisuian Goodra heavily relies on its item to function, so it dislikes being hit by Knock Off from Roaring Moon and Manaphy; it also struggles against physical attackers such as Iron Boulder and Galarian Zapdos, so physically defensive Pokemon such as Corviknight and Deoxys-D are great partners, as they can take hits for it, with the former also being able to absorb Knock Off.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543620, "username": "Vertigo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Diancie": {"sets": {"Regenerator": {}, "Defensive": {"outdated": true}}},
  "Volcanion": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Primordial Sea Volcanion excels as a fantastic wallbreaker with its great Special Attack and offensive typing. Rain-boosted Steam Eruption combined with Choice Specs allows Volcanion to 2HKO most Pokemon in tier, including most specially defensive walls such as RegenVest Garchomp, Meloetta, and Alolan Muk. Weather Ball dissuades promient Desolate Land users that might want to switch in to Volcanion such as Cinderace and Iron Moth. Earth Power is a more reliable way to deal with Desolate Land users like Iron Moth and Heatran, and it's a reliable way to hit Hisuian Goodra without missing. Focus Blast 2HKOes a would-be check in RegenVest Roaring Moon, as well as Hisuian Goodra after Spikes chip. Volcanion pairs well with entry hazard setters like Ting-Lu and Garchomp, which help wear down common RegenVest Pokemon like Goodra and Hisuian Goodra, and hazards also guarantee a 2HKO on Meloetta. Due to Volcanion's Stealth Rock weakness it pairs well with hazard removers like Corviknight and Quaquaval, which can also help pivot it in safely. Volcanion also pairs well with offensive pivots like Zapdos and Roaring Moon, which can help bring it in on targets like Corviknight.</p>"
      },
      "Magic Guard": {
        "description": "<p>Magic Guard Volcanion serves as a great mixed wallbreaker with a typing that also offers defensive utility. Flare Blitz is notably able to 2HKO RegenVest users like Hisuian Goodra and Meloetta, and Steam Eruption's burn chance deters would-be switch-ins like defensive Quaquaval and Garchomp. Earth Power reliably threatens Toxapex and Desolate Land users such as Iron Moth, Skeledirge, and Cinderace. Taunt can be used to hinder defensive walls with recovery such as Scream Tail and Quaquaval, while Will-O-Wisp is able to reliably burn switch-ins like defensive Quaquaval and Garchomp. Flame Charge is also a niche option to outspeed common revenge killers to Volcanion like Zapdos, Hisuian Arcanine, and Choice Band Galarian Zapdos. Magic Guard helps Volcanion with its weakness to entry hazards while also negating recoil from Flare Blitz and Life Orb. Offensive pivots such as Slither Wing and Iron Moth can bring Volcanion in against defensive cores featuring staples like Intimidate Corviknight and RegenVest users. Fast late-game cleaners like Chien-Pao and Regieleki also appreciate Volcanion's ability to weaken defensive checks like Quaquaval and common RegenVest users, which can allow them to take over games, while also providing speed control against faster threats to Volcanion like Zapdos, Hisuian Electrode, and Roaring Moon. Volcanion's susceptibility to being revenge killed by aformetioned threats makes defensive partners such as Corviknight and Meloetta essential, as they can tank hits and also help pivot to bring in Volcanion safely. Despite being immune to hazards, Volcanion still lacks recovery, so a teammate that can grant it longevity like Wish Scream Tail is also appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603931, "username": "Slither Wing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 536333, "username": "KarpeChan"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Primarina": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Primarina is an excellent wallbreaker thanks to its great typing and strong, nearly unresisted STAB combination. Weather Ball lets Primarina 2HKO RegenVest Swampert while still being able to hit Desolate Land users such as Heatran. Flip Turn allows Primarina to pivot away from problematic matchups like Empoleon and Blissey as well as predicted switch-ins in order to maintain momentum, while Psychic lets it hit Poison-types such as Toxapex and Desolate Land Iron Moth. Primarina is relatively slow and struggles to switch in, so it appreciates other slow pivots such as Corviknight and Swampert; in return, it can threaten wallbreakers that come in on them such as Cinderace and Roaring Moon. Corviknight especially is a great partner, as it can also remove entry hazards, which wear down Primarina very quickly due to its lack of recovery and frequent pivoting. Primarina struggles against special walls such as Manaphy, Meloetta, and Bulletproof Empoleon, so physical wallbreakers such as Chien-Pao, Roaring Moon, and Iron Hands make for great teammates; in return, Primarina can apply pressure on physical walls such as Corviknight and Great Tusk for them, wearing down each other's checks.</p>"
      },
      "RegenVest": {
        "description": "<p>With its great typing and natural bulk, Primarina can pivot into and check several of the tier's prominent threats including Chien-Pao and Roaring Moon. Psychic Noise threatens Iron Moth and denies recovery to it and Heatran, which could otherwise block Flip Turn with Desolate Land. Energy Ball hits Water-types like Swampert and opposing Primarina, while Surf provides a spammable Water-type move that also hits Steel-types like Corviknight and Iron Treads. Physical walls like Deoxys-D and Pecharunt appreciate Primarina's ability to switch into Dark-types that threaten them out like Roaring Moon and Chien-Pao; in return, they can check threats like Iron Hands and Ogerpon-H that threaten Primarina. Frail offensive teammates like Deoxys-S, Azelf, and Chien-Pao appreciate Primarina's ability to switch into powerful attackers and safely pivot them in. Electric-types like Zapdos and Hisuian Electrode can easily break past Primarina, making Pokemon that can handle them like Roaring Moon and Volt Absorb Corviknight great teammates. Desolate Land users like Ceruledge, Heatran, and Iron Moth prevent Primarina from pivoting with Flip Turn and can threaten significant damage against it, making teammates that can deal with them like Primordial Sea Barraskewda and Zapdos appreciated. Primarina is also prone to getting worn down by entry hazards, so hazard removers like Corviknight and the aforementioned Great Tusk are good partners; it also forms a great defensive core with them, as it can help check Pokemon that pressure them like Chien-Pao and Roaring Moon, giving them more opportunities to remove hazards.</p>"
      },
      "Magic Guard": {},
      "Sheer Force": {}
    },
    "credits": {"writtenBy": [{"user_id": 543620, "username": "Vertigo"}, {"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 540420, "username": "Gimmicky"}, {"user_id": 475288, "username": "Tranquility"}, {"user_id": 552227, "username": "Kinetic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Toxapex": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Toxapex leverages its high defensive stats and plethora of useful utility moves to act as a stout defensive wall and disruptor. Prankster + Haze lets Toxapex shut down threatening setup sweepers such as Dragonite, Volcarona, and Stored Power Iron Crown. Corrosion + Toxic gives Toxapex the ability to punish Steel-types such as Corviknight, Gholdengo, and Desolate Land Heatran, which can otherwise shrug off Toxapex's attacks, while Toxic Spikes can pressure more offensively oriented teams. Chilling Water deters physical attackers such as Zamazenta and Great Tusk from switching into Toxapex, while Infestation can rack up chip damage on foes such as Corviknight and Empoleon. Black Sludge give Toxapex greater longevity, while Rocky Helmet punishes physical attackers such as Chien-Pao and Barraskewda, as well as general U-turn spam. Eject Button is a niche option that lets Toxapex pivot in teammates safely and check Poltergeist Ceruledge after activation. Toxapex fits best on stall teams due to its passivity and ability to check setup sweepers that could potentially run rampant. Certain wallbreakers such as Iron Boulder, Garchomp, and Iron Hands are able to power through Toxapex, so teammates that can check these such as Great Tusk and Corviknight are greatly appreciated; Toxapex can in return take on Chien-Pao and Fire-types such as Cinderace and Ogerpon-H. Toxapex is horrified by Electric- and Psychic-types such as Zapdos, Deoxys-S, and Azelf, so teammates that can reliably take these on such as Hisuian Goodra, Mandibuzz, and Meloetta are helpful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603931, "username": "Slither Wing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kommo-o": {
    "sets": {
      "Galvanize": {
        "description": "<p>Kommo-o finds a decent niche on offensive teams as a mixed attacker with strong coverage. Boomburst scares off walls such as Mandibuzz, Corviknight, and Manaphy. Clanging Scales threatens Great Tusk, Iron Hands, and Pecharunt, while Close Combat notably allows Kommo-o to smack special walls like Blissey, Swampert, and Volt Absorb Empoleon attempting to check it. Stealth Rock synergizes well with Kommo-o's ability to scare away entry hazard removers like the aforementioned Mandibuzz and Corviknight. Clangorous Soul allows it to act as a passable setup sweeper instead, preventing threats like Roaring Moon and Iron Boulder from revenge killing it while increasing its offensive capabilities. Life Orb is typically preferred for its consistent damage boost, but Throat Spray can be used on Clangorous Soul sets to avoid recoil. Kommo-o's lack of longevity necessitates either teammates that can make up for its absent defensive utility like Corviknight and Manaphy or offensive teammates that can keep up the pressure like Iron Moth and Chien-Pao. Select revenge killers like Dragonite, Choice Scarf Roaring Moon, and Azelf naturally outspeed Kommo-o even after a Clangorous Soul, so answers to them like Kingambit, Great Tusk, and Roaring Moon make for good partners. Kommo-o appreciates pivots like Azelf, Sandy Shocks, and Roaring Moon because they can pivot out on their checks like Blissey, Empoleon, and Corviknight and safely bring it in to start threatening the opposing team. Kommo-o greatly appreciates dual screens support from setters like Corviknight and Deoxys-S allowing it to have an easier time setting up with Clangorous Soul or supporting its teammates with Stealth Rock; alternatively, Sticky Web from Smeargle and Ribombee can help it outspeed Choice Scarf revenge killers like Latios, Azelf, and Roaring Moon after a Clangorous Soul.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 594122, "username": "Evie"}, {"user_id": 475288, "username": "Tranquility"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Cinderace": {
    "sets": {
      "Court Change": {
        "description": "<p>With Cinderace's high Speed, high-Base Power STAB move in Pyro Ball, and general utility, it makes for a decent offensive pivot. U-turn lets Cinderace pivot on checks like Manaphy, Primarina, Well-Baked Body Gholdengo, and Skarmory while also safely getting teammates in that can take these checks on such as Sandy Shocks, Iron Hands, and Galarian Zapdos. Court Change lets Cinderace support its teammates by potentially clearing its side of entry hazards and using them against the opponent while also being able to steal dual screens. Will-O-Wisp lets Cinderace cripple potential switch-ins such as Dragonite, Garchomp, and Great Tusk, but it can instead use Taunt to cripple defensive Pokemon like Deoxys-D, Scream Tail, and Pecharunt. With High Jump Kick Cinderace can cover Primordial Sea switch-ins such as Barraskewda and Ogerpon-W. Frail offensive Pokemon like Chien-Pao, Barraskewda, and Azelf appreciate the presence of Cinderace due to it not only allowing them easier entry onto the field but also removing checks to them such as Corviknight, Scream Tail, and Mandibuzz. Cinderace falters when having to deal with either Primordial Sea users like Zapdos and Primarina or Well-Baked Body users such as Gholdengo and Corviknight, so having teammates such as Swampert, Empoleon, and RegenVest Roaring Moon to check these Pokemon is immensely helpful. As a final note, Cinderace tends to be used on more offensive teams, but with Court Change not fully removing hazards, it's not recommended that you use multiple hazard-weak teammates with it.</p>"
      },
      "Magic Guard": {
        "description": "<p>Cinderace's high Speed, high Attack, and wide utility movepool make it a versatile attacker that can both dish out substantial damage and disrupt opposing Pokemon indirectly. High Jump Kick hits Garganacl while also being the best option against Well-Baked Body users such as Corviknight and Skarmory, and Gunk Shot hits Scream Tail, Primarina, and Primordial Sea Zapdos. Cinderace can use Will-O-Wisp to cripple would-be switch-ins such as Great Tusk, Garchomp, Swampert, and Dragonite, pivot out on them with U-turn, or carry Gunk Shot for maximum coverage. Swords Dance helps Cinderace wallbreak, while Taunt prevents foes from inflicting status, recovering, or controlling entry hazards, which Cinderace can control itself with Court Change. In particular, Taunt improves Cinderace's matchup against Unaware users such as Mandibuzz and Scream Tail by prohibiting their recovery. Life Orb amplifies Cinderace's damage output, while Focus Sash provides recourse against Pokemon that would otherwise OHKO it, allowing it to score surprise KOs or get off valuable utility moves in a pinch. Magic Guard removes Life Orb recoil, the chance for Focus Sash to be broken by indirect damage, and Cinderace's vulnerability to Entry Hazard damage. Cinderace's ability to pressure Corviknight and Skarmory is appreciated by other wallbreakers that can struggle to deal with them like Roaring Moon, Iron Boulder, and Barraskewda, all of which Cinderace can help enter the field with U-turn. Cinderace is threatened by faster Pokemon like Zamazenta and Deoxys-S, so defensive Pokemon that can switch into these such as Empoleon, Corviknight, and Mandibuzz are helpful partners. Well-Baked Body Gholdengo completely walls Cinderace, making partners that can force out or eliminate it like Roaring Moon, Chien-Pao, and Gengar valuable teammates.</p>"
      },
      "Choice Band": {
        "description": "<p>Cinderace leverages its high Attack and Speed stats alongside its high-Base Power moves to be a great offensive pivot and wallbreaker, threatening common physical walls like Corviknight, Mandibuzz, and Deoxys-D. High Jump Kick is Cinderace's best move against Well-Baked Body Steel-types, doing sizable damage to Corviknight and Skarmory and OHKOing Kingambit. U-turn lets Cinderace pivot out of problematic matchups like Ceruledge and Well-Baked Body Gholdengo while also threatening Latios, whereas Gunk Shot threatens Primarina and Primordial Sea Zapdos. Desolate Land gives Cinderace a very high chance of OHKOing offensive Great Tusk after Spikes damage and lets it come in and threaten out Primordial Sea users like Zapdos and, when they're locked into Water-type moves, Barraskewda and Ogerpon-W. Alternatively, Sword of Ruin lets High Jump Kick OHKO Ogerpon-W and 2HKO Well-Baked Body Corviknight after slight chip damage. Fast physical attackers like Roaring Moon and Chien-Pao appreciate Cinderace threatening their checks like non-Well-Baked Body Corviknight and RegenVest Primarina, letting them sweep once these foes have been removed. In return, they can pressure Well-Baked Body Steel-types that trouble Cinderace like Gholdengo and Corviknight. While fast, Cinderace is also frail and prone to getting revenge killed by faster foes like Iron Boulder and Choice Scarf Azelf, so teammates that can deal with them like Fluffy Corviknight and Empoleon are appreciated. Additionally, Cinderace is prone to getting worn down by entry hazards, making hazard removers like Great Tusk and the aforementioned Corviknight great partners.</p>"
      },
      "Swords Dance": {
        "outdated": true,
        "description": "<p>Cinderace's high Attack and Speed combined with great coverage options and Swords Dance turn it into a powerful wallbreaker and cleaner. High Jump Kick threatens Roaring Moon and OHKOes Well-Baked Body Kingambit, while Gunk Shot threatens to cripple switch-ins such as Manaphy, Zapdos, Kommo-o, and physically defensive Garchomp. Life Orb lets High Jump Kick OHKO RegenVest Roaring Moon and lets Gunk Shot 2HKO Primordial Sea Zapdos, while Heavy-Duty Boots increases Cinderace's longevity. Desolate Land lets Cinderace come in on and force out Primordial Sea users like Zapdos if safely pivoted in by a teammate while also letting +2 Life Orb-boosted Pyro Ball OHKO defensive Great Tusk. Sword of Ruin + Heavy-Duty Boots provides more damage on Cinderace's coverage moves at the cost of a worse matchup into Primordial Sea and lowered damage on Pyro Ball. Fast cleaners such as Barraskewda and Dragonite appreciate Cinderace's ability to pressure their walls like Corviknight and Scream Tail, opening up the way for them to sweep late-game. Special pivots like Azelf, Zapdos, and Latios are appreciated, as they can pivot Cinderace in against their switch-ins, such as Empoleon and Hisuian Goodra. Cinderace's frailty means it's easily revenge killed by most Pokemon faster than it like Chien-Pao and Choice Scarf Azelf, so teammates that can take a hit for it and pivot it in such as Corviknight and Manaphy are appreciated. Cinderace is also completely walled by Well-Baked Body Gholdengo, so teammates that can threaten it like Garchomp and Roaring Moon are appreciated.</p>"
      },
      "Utility": {
        "outdated": true,
        "description": "<p>Cinderace is a good utility pivot thanks to its high Speed and great supporting movepool. U-turn lets it pivot out against Well-Baked Body Pokemon like Corviknight, Gholdengo, and Kingambit, as well as Primordial Sea users like Zapdos, Ogerpon-W, and Manaphy. Court Change punishes opposing teams for setting entry hazards or dual screens. Super Fang can be used instead to chip switch-ins like Kommo-o, Garganacl, and Quaquaval that Cinderace cannot meaningfully damage otherwise. Taunt prevents status moves, entry hazards, and recovery, which can help against foes like Scream Tail, while Will-O-Wisp cripples checks like Garchomp, Kommo-o, and Primordial Sea Zapdos. Cinderace is threatened by Primordial Sea users like Barraskewda, Ogerpon-W, and Primarina, which force it out, making walls like defensive Zapdos, Kommo-o, and Empoleon pair well with it. Offensive pivots such as Galarian Zapdos, Meowscarada, and Sandy Shocks pair well with Cinderace, as they form a VoltTurn core with it, being able to pivot it in to threaten walls like Corviknight, Meloetta, Hisuian Goodra. In return, Cinderace can pivot these teammates in to threaten its switch-ins like Kommo-o, Garaganacl, and Quaquaval.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 596834, "username": "cumps"}, {"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 543620, "username": "Vertigo"}]}]}
  },
  "Inteleon": {
    "sets": {
      "Primordial Sea": {
        "description": "<p>Inteleon is a decent cleaner and wallbreaker thanks to its high Special Attack and Speed, threatening many offensive Pokemon like Great Tusk, Scream Tail, and Gholdengo. U-turn lets it pivot out of unfavorable matchups like RegenVest Manaphy and Primarina and forms a VoltTurn core with other pivots like Roaring Moon and Meowscarada. Mud Shot threatens Fire-types like Iron Moth and Ceruledge that could otherwise utilize Desolate Land to comfortably switch into a Weather Ball and OHKOes Heatran. Ice Beam snipes Dragon-types like Roaring Moon and Dragonite. Physical teammates like Zamazenta and Roaring Moon appreciate Inteleon's ability to threaten their switch-ins like Pecharunt and Great Tusk, respectively, letting them rip massive holes in the opponent's team once these foes are removed; in return, they can threaten walls like Empoleon and Manaphy, which Inteleon struggles against. Entry hazard support from the likes of Scream Tail and Ting-Lu helps Inteleon against special walls like Empoleon and RegenVest users like Manaphy and Primarina,(AC) which it otherwise struggles to break through. Inteleon is also vulnerable to being worn down by hazards, so teammates that can remove them like Corviknight and Great Tusk are good partners. Furthermore, Inteleon's frailty leaves it severely threatened by faster revenge killers like Chien-Pao and Choice Scarf Roaring Moon, making teammates that can deal with them like the aforementioned Corviknight and Great Tusk greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Corviknight": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Corviknight's unparalleled role compression as a physical wall, entry hazard remover, and slow pivot that doesn't need Regenerator makes it a defensive staple on the majority of teams. Fluffy provides the most protection against wallbreakers like Choice Band Galarian Zapdos, Iron Boulder, and Roaring Moon while not letting Corviknight fall victim to Scrappy Great Tusk, whereas Intimidate provides additional protection against Chien-Pao and Ogerpon-C at the cost of needing a secondary physical check to deal with the aforementioned threats reliably. Brave Bird is Corviknight's strongest neutral move and hits Ghost-types and key targets like Great Tusk and Galarian Zapdos, while Body Press fits well on Intimidate sets to do more damage to Roaring Moon, Ogerpon-C, and Chien-Pao. Corviknight is exceedingly passive, so it needs powerful and fast offensive teammates like Barraskewda and Azelf to re-gain momentum; in exchange, it provides them safe entry with its slow U-turn and entry hazard removal. Slower wallbreakers like Galarian Zapdos and Ceruledge also appreciate Corviknight's slow pivoting services. Corviknight, especially Fluffy variants, needs a teammate like Swampert, Manaphy, or Well-Baked Body Gholdengo to handle the Fire-types it cannot check. Hazard-weak teammates like Chien-Pao and the Ogerpon formes appreciate Corviknight's ability to remove hazards semi-reliably.</p>"
      },
      "Dual Screens": {"description": "<p>Prankster and an excellent defensive typing enable Corviknight to set dual screens multiple times a battle for hyper offense teams. Taunt lets Corviknight prevent opposing Corviknight from removing dual screens with Defog, stop Pokemon like Deoxys-D and Great Tusk from setting entry hazards, and prevent Pokemon like Dragonite and Gholdengo from setting up. U-turn is used to pivot out once dual screens have been set up. Prankster Corviknight should be used with setup sweepers that appreciate dual screens support such as Dragonite, Volcarona, and Iron Boulder. Fire-types like Iron Moth, Ceruledge, and Heatran and Electric-types like Zapdos can deal heavy damage to Corviknight, so having Dragon-types that can check them like Roaring Moon and Dragonite is appreciated.</p>"},
      "Immunity Ability": {
        "description": "<p>Corviknight's incredible Steel / Flying typing combined with its access to U-turn makes it a great defensive pivot, aided further by its abilities of Well-Baked Body or Volt Absorb. With Well-Baked Body, Corviknight can reliably check Fire-types such as Cinderace, Heatran, and Ogerpon-H, while Volt Absorb allows it to check many Electric-type Pokemon such as Zapdos, Sandy Shocks, and Hisuian Electrode. With Defog, Corviknight can help control entry hazards, and with the help of its abilities, it can clear them in front of hazard setters such as Desolate Land Landorus and Heatran with Well-Baked Body or Sandy Shocks and Archaludon with Volt Absorb. Corviknight will most often run Leftovers for extra healing, though it can also run Eject Button with Well-Baked Body to safely bring in a teammate once and be a better check to Ceruledge. With an EV spread of 252 HP / 252 Def / 4 SpD, Corviknight can better check Pokemon like Roaring Moon as well as Cinderace with Well-Baked Body, while with an alternate EV spread of 252 HP / 4 Def / 252 SpD, it can reliably check Pokemon like Latios as well as Zapdos with Volt Absorb; it should also be noted that Well-Baked Body sets prefer to be physically defensive, while Volt Absorb sets prefer to be specially defensive. Corviknight tends to be a great assistant to wallbreakers such as Ceruledge, Barraskewda, and Chien-Pao that appreciate entry hazards being removed as well as being pivoted onto the field safely. Corviknight can struggle against Pokemon that hit it hard regardless of its abilities such as Choice Band Roaring Moon, Zamazenta, and Chien-Pao, so having teammates such as Great Tusk, Scream Tail, and Primarina can help. Corviknight also struggles against special attackers like Gengar, Primarina, and Gholdengo, even if it is specially defensive, so partners like Blissey and Bulletproof Empoleon can check these foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}, {"user_id": 594122, "username": "Evie"}, {"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 375662, "username": "Isaiah"}, {"user_id": 475288, "username": "Tranquility"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Barraskewda": {
    "sets": {
      "Choice Band": {
        "description": "<p>With great offensive stats and a spammable move in Flip Turn, Barraskewda serves as an excellent offensive pivot that's capable of outpacing the majority of the metagame. Close Combat lets it deal with foes that resist its Water-type moves such as Roaring Moon, Ogerpon-W, and Empoleon, while Aqua Jet lets it pick off weakened foes that normally outspeed it such as Choice Scarf Sandy Shocks and Hisuian Electrode, as well as foes that have set up, such as Volcarona and Great Tusk. Drill Run and Psychic Fangs also threaten Water-resistant foes, with Drill Run OHKOing Desolate Land Fire-types such as Iron Moth, Heatran, and Ceruledge and Psychic Fangs threatening Quaquaval and Kommo-o. Barraskewda takes great advantage of weakened walls such as Corviknight and Deoxys-D, making physical wallbreakers such as Iron Boulder, Galarian Zapdos, and Ceruledge good partners. Specially offensive pivots such as Hisuian Electrode and Azelf form great VoltTurn cores with Barraskewda, since they're able to threaten each other's checks, with Barraskewda forcing out special walls such as Meloetta and Swampert while they threaten physical walls such as Corviknight and Quaquaval in return. Barraskewda is very frail and easily OHKOed by faster foes such as Choice Scarf Roaring Moon and Azelf, which makes defensive pivots such as Corviknight, Mandibuzz, and Swampert necessary. It also struggles a lot with entry hazards, making hazard removers such as Great Tusk and Corviknight appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603931, "username": "Slither Wing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Polteageist": {
    "sets": {
      "Shell Smash": {
        "description": "<p>With its unique access to Shell Smash and Stored Power, Polteageist carves itself a niche as a decent sweeper, aided by Queenly Majesty against priority moves from the likes of Slither Wing and Dragonite. Stored Power, after a Shell Smash boost, lets Polteageist blast through anything that isn't a Dark-type or a dedicated special wall. Giga Drain allows Polteageist to OHKO Swampert after slight chip damage as well as letting it deal great damage to both Ting-Lu and Chien-Pao. Polteageist can pair well with Pokemon like Dragonite, Zamazenta, and Iron Hands, which can bait in Pokemon that it can scare out such as Pecharunt and Deoxys-D. Polteageist struggles with getting onto the field to set up due to entry hazards invalidating its Focus Sash and it being frail, so it usually appreciates Taunt leads like Corviknight and Deoxys-S and entry hazard removers like Great Tusk. Polteageist also cannot hurt most Dark-types in a meaningful way, so it enjoys having teammates like Great Tusk, Zamazenta, and Iron Hands, which can help remove most of them. Even though Polteageist can outspeed most unboosted Pokemon after a Shell Smash boost, it still struggles with Deoxys-S and most Choice Scarf Pokemon such as Azelf, Roaring Moon, and Latios because they can easily outspeed it and KO it, so having speed control support from either Sticky Web or priority users like Dragonite is appreciated. Finally, Polteageist only works on offensive teams, as it's unable to provide much outside of setting up once and attempting to sweep, so supporting that sweep with teammates that provide either entry hazards, like Deoxys-S and Smeargle, or dual screens, like Corviknight and Regieleki, is a great boon to Polteageist.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 594122, "username": "Evie"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Zamazenta": {
    "sets": {
      "Choice Band": {
        "description": "<p>With Zamazenta's high Attack only compounded by Sword of Ruin and excellent Speed tier that allows it to outspeed nearly the entire unboosted metagame, it serves as a potent wallbreaker that is capable of 2HKOing even dedicated physical walls like Mandibuzz and defensive Great Tusk with Close Combat. Crunch 2HKOes Psychic- and Ghost-types like Deoxys-D, Pecharunt, and physically defensive Gholdengo variants that would switch into Close Combat. Stone Edge helps against Flying-types like Zapdos and Dragonite that might otherwise survive a hit and KO Zamazenta back. Heavy Slam covers Fairy-type switch-ins like Scream Tail and Primarina. Due to Zamazenta's lack of reliable recovery, it appreciates entry hazard removal support from Great Tusk and Corviknight, the latter of which can also serve as a slow pivot to bring it in safely and help preserve its HP so it can take advantage of its great natural bulk. Zamazenta benefits from Knock Off users like Roaring Moon and Iron Treads removing Rocky Helmets, keeping it from getting worn down. Entry hazard setters like Garchomp and Deoxys-D help to chip down the likes of Fluffy Corviknight and Great Tusk to make them easier for Zamazenta to KO. Zamazenta is susceptible to being revenge killed by Choice Scarf Azelf, Dragonite, and most Deoxys-S variants, so defensive walls like Deoxys-D, Hisuian Goodra, and Scream Tail that can switch into them are needed.</p>"
      },
      "IronPress": {}
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Zamazenta-Crowned": {
    "sets": {"IronPress": {"description": "<p>Zamazenta-C leverages its Fighting / Steel typing and high Defense and Speed to be a decent Body Press sweeper that's able to switch in and set up on common Pokemon like Corviknight, Chien-Pao, and Roaring Moon. Stone Edge helps against Zapdos, Iron Moth, and Ceruledge, while Substitute helps it set up against would-be switch-ins like Iron Hands and Great Tusk as well as shielding it from status afflictions from moves like Manaphy's Scald and Corrosion Pecharun't Toxic. Zamazenta-C plays best on offensive teams, so it appreciates entry hazards from Pokemon like Skarmory and Deoxys-D and dual screens support from Pokemon like Corviknight and Deoxys-S, which help it take KOs and set up, respectively. Zamazenta-C also appreciates Pokemon like Chien-Pao, Roaring Moon, and Gengar that are able to take down Deoxys-D, Gholdengo, and Pecharunt, as otherwise it is unable to make progress at all.</p>"}},
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 552227, "username": "Kinetic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Regieleki": {
    "sets": {
      "Dual Screens": {
        "description": "<p>With the highest base Speed in the game, Regieleki can enable high-powered setup sweepers like Manaphy, Dragonite, and Iron Hands on hyper offense teams as a dual screens lead, though it's more niche than other dual screens setters. With Refrigerate, Rapid Spin is a guaranteed way to remove entry hazards even in the face of Ghost-types like Gholdengo and Pecharunt. However, Regieleki isn't the best to rely on for Rapid Spin all of the time, so teammates like Great Tusk and Quaquaval can help as additional spinners. Explosion lets Regieleki get its teammates in safely, do massive damage to foes like Swampert, Great Tusk, and Roaring Moon, and prevent dual screens removal via Defog. Many setup sweepers, most notably Gholdengo, Ceruledge, and Iron Hands, appreciate Regieleki's dual screens support while also fending off priority from Pokemon like Slither Wing and Prankster Corviknight, which would otherwise prevent it from setting dual screens. Regieleki similarly doesn't enjoy Choice Scarf Roaring Moon and Meowscarada, as they are the only relevant Pokemon able to outspeed it instantly, so having checks to them such as Kingambit, Iron Hands, and Zamazenta can help. As a final note, Regieleki is exclusively a hyper offense lead meant to support Pokemon such as Iron Boulder, Volcarona, and Kingambit by providing them with extra opportunities to set up and win the game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Ursaluna-Bloodmoon": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Ursaluna-B uses its great Special Attack and physical bulk to be a decent Calm Mind sweeper. Calm Mind lets it boost past and break through foes like Corviknight and RegenVest Manaphy and Swampert, while Moonlight provides additional longevity, letting it use the aforementioned walls as setup fodder. Storm Drain turns RegenVest users like Swampert, Manaphy, and Primarina into setup fodder and lets it check Barraskewda; alternatively, Well-Baked Body lets Ursaluna-B counter Fire-types like Ceruledge lacking Close Combat, Iron Moth, and Heatran, letting it safely set up on them, while Fluffy lets it deal with physical attackers, using Dragonite as setup fodder and checking Fighting-types like Iron Hands and Great Tusk. 252 Special Attack EVs and a Modest nature lets Ursaluna-B OHKO Dragonite at +1 and defensive Great Tusk, while 252 Defense EVs and a Bold nature help Ursaluna-B better check physical attackers like Roaring Moon and Iron Boulder. 15 Speed IVs let Ursaluna-B underspeed Corviknight, preventing it from safely using Roost or U-turn to slow pivot to a teammate that can handle Ursaluna-B. Powerful special attackers like Azelf and Latios appreciate Ursaluna-B's ability to handle threats like Roaring Moon and pressure checks like Swampert for them; in return, they can threaten Fighting-types like Zamazenta and Great Tusk that could threaten it. Ursaluna-B's low Speed leaves it susceptible to threats that can OHKO it like Chien-Pao and Latios, so teammates that can deal with them like RegenVest Primarina are appreciated. Ursaluna-B's low Special Defense also lets powerful attackers like Latios and Deoxys-S OHKO it prior to setting up, so specially defensive teammates that can check them like Empoleon and Heatran are good pairings. Earth Eater users like Gholdengo and Empoleon can wall Ursaluna-B, so teammates that can threaten them like Roaring Moon and Scrappy Great Tusk are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475288, "username": "Tranquility"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Enamorus-Therian": {
    "sets": {
      "Sheer Force": {
        "description": "<p>Enamorus-T's excellent Special Attack, solid bulk, and plentiful coverage options make it a decent wallbreaker able to threaten common special walls like Swampert and Empoleon. Earth Power threatens Fire-types such as Heatran, Iron Moth, and Ceruledge as well as non-Ground-immune Empoleon and Gholdengo, while Mystical Fire threatens non-Well-Baked Body Steel-types like Corviknight, Gholdengo, and Kingambit. Superpower nails special walls like Blissey, Ground-immune Empoleon, and Hisuian Goodra, while Grass Knot specifically targets Swampert, guaranteeing a KO on it after a Moonblast. A Rash nature is used when running Superpower; otherwise, Modest is optimal. Special sweepers and cleaners like Scream Tail and Azelf appreciate Enamorus-T being able to threaten their walls like Swampert and Empoleon, letting them clean late-game. Entry hazard support from the likes of Ting-Lu and Garchomp is greatly appreciated, as it helps Enamorus-T break through walls like RegenVest Manaphy and Meloetta that it can otherwise struggle to break through. Enamorus-T's awful Speed leaves it outsped and OHKOed by many offensive threats like Iron Boulder, Gholdengo, and Chien-Pao, making teammates that can deal with them and pivot it in like Corviknight, RegenVest Swampert, and Primarina, respectively, good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Meowscarada": {
    "sets": {
      "Choice Item": {
        "description": "<p>Thanks to its high base Attack and Speed stats and U-turn, Meowscarada functions incredibly as an offensive pivot and wallbreaker. U-turn allows Meowscarada to switch out of problematic matchups such as Corviknight and Kingambit and into threats like Iron Moth and Iron Hands to scare them away. Trick enables Meowscarada to punish bulky walls like Corviknight, Skarmory, and Mandibuzz looking to switch in on it; alternatively, Triple Axel provides a way for Meowscarada to hit Dragonite, Mandibuzz, and Chesnaught for super effective damage. Meowscarada can use Choice Band to OHKO Deoxys-D, Scream Tail, and Garganacl after Stealth Rock, while Choice Scarf gives it the ability to outspeed incredibly fast foes such as Deoxys-S, Choice Scarf Azelf, and Roaring Moon. Since Meowscarada struggles against Corviknight, Skarmory, and Kingambit, it appreciates partners like Zapdos, Sandy Shocks, and Archaludon that can pressure them; in return, Meowscarada can threaten Swampert and Meloetta, which these teammates struggle against. While Meowscarada's Attack stat is adequate, it still appreciates entry hazard support from the likes of Deoxys-D, Garchomp, and Heatran, as Stealth Rock or one layer of Spikes allows Meowscarada to have a very high chance of OHKOing Deoxys-D and Scream Tail.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit_Gamin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Quaquaval": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Due to its incredible utility moves in Rapid Spin and Knock Off, longevity from Roost, and good typing, Quaquaval functions incredibly as an entry hazard remover and pivot and checks Pokemon like Chien-Pao, Roaring Moon, and Barraskewda. Quaquaval has a multitude of viable abilities, such as Scrappy to let Rapid Spin and Low Kick affect Ghost-types like Gholdengo and Ceruledge as well as Intimidate and Fluffy to further increase its bulk, allowing it to more safely switch in on top physical threats such as Roaring Moon and offensive Great Tusk. Thanks to U-turn, Quaquaval can allow frail attackers including Azelf and Meowscarada to safely switch in. Knock Off can be used for its general reliability and utility, while Low Kick wears down opposing Hisuian Goodra and Blissey. Quaquaval is quite vulnerable to special attackers such as Azelf, Deoxys-S, and Hisuian Electrode. To counter these significant threats, RegenVest users like Hisuian Goodra and Meloetta can be used to safely switch in on most of their attacks and threaten to deal decent chip damage to them with Knock Off or U-turn. Some teammates that benefit from Quaquaval's presence include Roaring Moon and Deoxys-S, as they don't enjoy taking Spikes damage, so they appreciate its hazard removing capabilities.</p>"
      },
      "Magic Guard": {
        "description": "<p>Quaquaval is a decent wallbreaker, using its strong STAB moves, and solid Attack stat to burst through bulky opponents foes like Great Tusk, Deoxys-D, and Skarmory. Brave Bird hits Desolate Land users such as Iron Moth, Volcarona, and Ceruledge on the switch-in, but Quaquaval can use Close Combat to help against Pokemon like Heatran and Manaphy, though this does have the drawback of making it easier to be revenge killed. Rapid Spin is used as not only entry hazard removal for Quaquaval and its teammates but also a way to let it outspeed and threaten foes like Hisuian Electrode, Galarian Zapdos, and Iron Boulder. Knock Off can be used to both remove items from Pokemon like Corviknight, Deoxys-D, and Mandibuzz, as well as hit Ghost-types such as Ceruledge and Gholdengo. U-turn is a less prominent option to be able to pivot on checks like Corviknight and Manaphy. Roost is used to keep Quaquaval healthy potentially allowing it to outlast its checks, while Swords Dance can be used as a way to let it end games by blasting through its checks like Corviknight, Gholdengo, and physically defensive Manaphy. Offensive Psychic-types such as Azelf, Iron Boulder, and Deoxys-S appreciate Quaquaval's presence, as it's able to take on Dark- and Steel-types such as Roaring Moon, Chien-Pao, and Gholdengo for them. Quaquaval is slow, and struggles to deal with faster foes such as Deoxys-S, Dragonite, and Latios, so it benefits from having teammates like Swampert, Corviknight, and Mandibuzz to help with checking them defensively and bringing it in safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}, {"user_id": 652656, "username": "Gambit_Gamin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Garganacl": {
    "sets": {
      "The Salt Cure": {
        "description": "<p>Garganacl is a tough defensive wall that uses Salt Cure to wear down defensive Pokemon, like Swampert, Great Tusk, and Corviknight, and utilizes its ability selection to check a variety of different Pokemon. Fluffy allows Garganacl to check Kingambit and Iron Boulder, Water Absorb lets it reliably switch in on defensive Manaphy as well as help with checking Choice-locked Water-types like Barraskewda and Primarina, and Earth Eater lets it check Roaring Moon and Dragonite running Earthquake. Stealth Rock lets Garganacl support its teammates by providing entry hazards, while with Iron Defense or Curse, Garganacl can set up on and more easily check Pokemon like Iron Hands, Ceruledge, and Dragonite, and boost Body Press or Earthquake, depending on the set. When using Body Press, Garganacl can more efficiently take on Chien-Pao as well as a majority of other Pokemon, while with Earthquake, it can deal with Iron Boulder and Pecharunt. Protect lets Garganacl deal extra damage with Salt Cure active as well as gain some extra Leftovers recovery. Garganacl can either use Leftovers or Heavy-Duty Boots, the former letting it gain more recovery through Protect and the latter helping Garganacl switch in more often. Garganacl provides great defensive support to frail offensive Pokemon, like Iron Moth, Gengar, and Galarian Zapdos, as a to check faster Pokemon like Roaring Moon, Dragonite, and Iron Boulder. Garganacl can struggle against special attackers, such as Deoxys-S, Azelf, and offensive Gholdengo, so having specially defensive teammates, like Hisuian Goodra, Manaphy, and Blissey, can help. Garganacl enjoys being on more defensive teams for having teammates that can take on physical attackers with it, such as Pecharunt, Mandibuzz, and Primarina, as it struggles to reliably check Pokemon like Chien-Pao, Zamazenta, and Barraskewda.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Ceruledge": {
    "sets": {
      "Choice Band": {
        "description": "<p>Ceruledge has the perfect combination of traits to become a terrifying wallbreaker, boasting two of the best offensive STAB typings, high-Base Power attacks, and a naturally good matchup against the tier's most common physical wall, Corviknight. Bitter Blade's healing is greatly appreciated to offset Stealth Rock chip damage, and Close Combat flips the table on potential answers such as Roaring Moon and Well-Baked Body Kingambit. Shadow Sneak makes Ceruledge a potent revenge killer and cleaner, picking off weakened setup sweepers like Volcarona and Ogerpon-C, and threatening to OHKO Iron Boulder, Gengar, and non-Psychic Surge Deoxys-S. An Adamant nature helps Ceruledge secure certain KOs, most notably OHKOing Swampert with Poltergeist, but Jolly allows it to outspeed Gholdengo and neutral-natured Great Tusk. Ceruledge requires slow pivots like Primarina, Corviknight, and Mandibuzz to get it onto the field, with the former covering Latios and the latter two providing valuable Defog support while also checking dangerous revenge killers like Roaring Moon and Dragonite. Ceruledge also pairs well with offensive pivots like Azelf and Zapdos, both of which require help to break past RegenVest users such as Manaphy and Swampert; in return, they give it more opportunities to come in to wallbreak. However, Ceruledge cannot be paired with Knock Off as this nullifies Poltergeist, limiting its synergy with the aforementioned RegenVests users and common Choice Scarf users like Roaring Moon and Meowscarada. Ceruledge is quite slow relative to other offensive wallbreakers, so it needs speed control in the form of Chien-Pao and Barraskewda, the latter of which also baits in and pivots on Corviknight and Skarmory.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance Ceruledge is one of the tier's most potent wallbreakers and setup sweepers thanks to its high base Attack, great STAB coverage, and Swords Dance. Shadow Sneak picks off weakened foes like Gholdengo and Iron Boulder and OHKOes frailer targets like Sheer Force Deoxys-S, while Close Combat nails potential Dark-type switch-ins like Roaring Moon. Sword of Ruin offers the most all-around damage amplification, while Desolate Land supercharges Bitter Blade and provides a useful immunity to Water; similarly, Life Orb provides extra power, letting Ceruledge achieve feats like OHKOing Deoxys-D, while Heavy-Duty Boots is useful on teams with weak entry hazard removal. Ceruledge can be overwhelmed by Pokemon like Barraskewda, Ogerpon-W, and Psychic Surge Deoxys-S, making defensive Pokemon like Corviknight and Deoxys-D good teammates. Ceruledge's low Speed means that it can easily be outsped by foes, making offensive Pokemon like Choice Scarf Azelf, Dragonite, and Chien-Pao good teammates that help make up for it thanks to their high Speed. Ceruledge's poor defenses and weakness to entry hazards makes slow, hazard-removing pivots like Corviknight and Mandibuzz ideal teammates. Because Ceruledge relies heavily on Poltergeist, it has poor synergy teammates that frequently use Knock Off such as Manaphy and Swampert.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 539679, "username": "GlalieGoesBoom"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 523866, "username": "UT"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Palafin": {
    "sets": {
      "Bulk Up": {},
      "Palafin": {
        "outdated": true,
        "description": "<p>Palafin's powerful priority offense and pivoting make it a dangerous threat even with its standard ability. Jet Punch from Palafin-H easily revenge kills dangerous threats like Kilowattrel, Sandy Shocks, and Talonflame, as well as Chien-Pao after minor chip damage. Palafin is heavily hampered by Desolate Land; to take down their users, Zen Headbutt from Palafin-H easily OHKOes Iron Moth and 2HKOes Ceruledge, while Close Combat flings Cinderace into the sun. Pivoting teammates such as Kilowattrel, Meowscarada, and Corviknight not only form dangerous pivoting cores with Palafin, but also position it to both activate Zero to Hero and fire off its powerful Jet Punch. Due to its frequent need to switch and reliance on a recoil move to wallbreak, Palafin requires effective entry hazard removers like Corviknight and Donphan; WishPass Scream Tail is also a great teammate to heal off chip damage. Even with its strong coverage moves, Palafin struggles mightily against opposing Desolate Land, so reliable switch-ins like Well-Baked Body Slither Wing are strongly recommended. Palafin struggles against Dondozo, making teammates that can punish it like Meowscarada and Spikes Garchomp good additions.</p>"
      }
    }
  },
  "Kingambit": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Kingambit acts as valuable sweeper and cleaner on offensive teams, providing a refreshing blend of offensive and defensive utility in the form of strong priority in Sucker Punch and the option of having a valuable type immunity. Swords Dance boosts Kingambit's Attack to nuclear levels, OHKOing physically defensive Manaphy and threatening to 2HKO Fluffy Corviknight with Kowtwo Cleave after light chip. Adaptability provides even more power; with Black Glasses, it can let Kingambit achieve feats like OHKOing threats such as Dragonite after a Swords Dance. Well-Baked Body allows Kingambit to check and set up on Ogerpon-H, Heatran, and Iron Moth and provides an immunity to burn, while Earth Eater turns Dragonite, Roaring Moon, and double dance Garchomp into setup fodder. The given EV spread allows Kingambit to outspeed RegenVest Manaphy and Jirachi. Kingambit requires teammates that can threaten Fighting-types like Great Tusk, Iron Hands, and Zamazenta, as these Pokemon can freely switch into it. As a result, Pokemon like Latios, Zapdos, and Pixilate Scream Tail make for good teammates with their ability to comfortably force them out. Offensive pivots that can break holes in the opposing team like the aforementioned Latios and Zapdos, Roaring Moon, and Barraskewda are strongly recommended to enable Kingambit to clean late-game. Entry hazard setters like Great Tusk, Empoleon, and the aforementioned Scream Tail pair well with Kingambit by helping to passively wittle down its checks like Corviknight, physically defensive Manaphy, and Zamazenta.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 594122, "username": "Evie"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 475288, "username": "Tranquility"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Great Tusk": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Great Tusk's gargantuan physical bulk and access to valuable utility moves make it a valuable defensive presence in the metagame, especially since it is the best user of Rapid Spin and one of the few viable forms of entry hazard control. Body Press, when coupled with maximum Defense investment, deals consistent damage to Corviknight, while Ice Spinner can be used to hit Flying-type switch-ins like both Zapdos formes and Dragonite. Knock Off debilitates switch-ins like Corviknight and Zapdos by removing their Leftovers and Heavy-Duty Boots, respectively. Alternatively, Great Tusk can use Stealth Rock if none of its teammates are capable of setting it. Bulk Up can also be considered to increase Great Tusk's offensive presence, but is typically less preferred than other utility options. Scrappy notably prevents Ghost-types like Gholdengo and Pecharunt from spinblocking Great Tusk. Alternatively, Regenerator provides Great Tusk with reliable recovery it otherwise lacks, while Fluffy allows it to better check attackers such as Roaring Moon and allows a teammate like Swampert to use Regenerator instead. Heavy-Duty Boots ensures Great Tusk can more reliably remove entry hazards by avoiding chip damage from them, while Leftovers provides recovery for non-Regenerator sets, and Rocky Helmet can be used to punish attackers that make contact. Offensive Pokemon that appreciate entry hazards off the field such as Azelf and Chien-Pao pair well with Great Tusk's Rapid Spin support. Due to its poor special bulk, Great Tusk appreciates specially bulky Pokemon, such as Heatran, Empoleon, and if not using Regenerator, RegenVest Pokemon such as Manaphy and Swampert. Certain physical wallbreakers such as Chien-Pao and Galarian Zapdos are significant threats to Great Tusk, so it appreciates a secondary physical wall capable of checking these Pokemon such as Corviknight or Skarmory.</p>"
      },
      "Offensive Bulk Up": {
        "description": "<p>Impressive offensive and defensive utility combined with the ability to remove entry hazards cements Great Tusk as a threatening sweeper that also takes on threats like Ceruledge, Iron Hands, and Roaring Moon. Ice Spinner lets Great Tusk hit Flying-types like Dragonite, Zapdos, and Mandibuzz, while Knock Off instead debilitates defensive switch-ins like Mandibuzz, Fluffy Corviknight, and opposing Great Tusk. Headlong Rush helps deal with Poison-types like Pecharunt and Iron Moth as well as being Great Tusk's best option against Fairy-types like Scream Tail. Scrappy + Rapid Spin grants Great Tusk hazard removal that's not blocked by Ghost-types like Gholdengo and Pecharunt. Scrappy also notably enables Great Tusk to turn Intimidate Corviknight into setup fodder. Hazard-weak Pokemon such as Chien-Pao, Ceruledge, and Ogerpon-H appreciate Great Tusk's role as a spinner; in return, they can help threaten physically defensive checks like Fluffy Corviknight and Deoxys-D, making it easier for it to set up. Due to its mediocre Special Defense, Great Tusk is forced out by common threats such as Azelf, Deoxys-S, and Latios, making specially defensive teammates such as RegenVest Swampert, Meloetta, and Manaphy necessary. Despite its fantastic natural physical bulk, Great Tusk is troubled by certain wallbreakers such as Chien-Pao, Galarian Zapdos, and all Ogerpon formes, making physically defensive teammates such as Intimidate Skarmory, Fluffy Corviknight, and Unaware Deoxys-D greatly appreciated.</p>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 473082, "username": "abriel"}, {"user_id": 603931, "username": "Slither Wing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Scream Tail": {
    "sets": {
      "Pixilate": {
        "description": "<p>Scream Tail is a good offensive Pokemon that takes advantage of Boomburst's high Base Power when combined with Pixilate to act as an entry hazard setter or a late-game setup sweeper. With its fantastic defenses, good defensive typing, and great Speed tier, which lets it outspeed the Ogerpon formes, Latios, and Terrakion, it can threaten most of the tier, notably entry hazard removers like Great Tusk and Mandibuzz and common offensive threats such as Dragonite, Iron Hands, Galarian Zapdos, and Roaring Moon. Stealth Rock takes advantage of the switches that Scream Tail forces against Pokemon like Great Tusk, chipping down walls for itself and its teammates to break through them, while Calm Mind provides it with opportunities to sweep late-game once Pokemon like Iron Moth and Heatran have been removed. Wish can help Scream Tail and its teammates like Great Tusk and Iron Hands that lack reliable recovery options restore HP. Protect lets Scream Tail scout out Choice-locked foes like Azelf, Deoxys-S, and Roaring Moon and recover HP safely with Leftovers or Wish. Scream Tail has a hard time breaking through stout specially defensive Pokemon like Swampert, Meloetta, and Manaphy without Calm Mind, making it appreciate offensive partners like Hisuian Electrode, Roaring Moon, and Iron Boulder. Scream Tail is very susceptible to being revenge killed by faster Pokemon like Iron Boulder and Barraskewda, which makes it appreciate having teammates that can offer it a defensive backbone like Fluffy Corviknight and Skarmory. Scream Tail can also appreciate Knock Off users like Roaring Moon and Empoleon, which can remove items like Assault Vest and Heavy-Duty Boots from Manaphy and Zapdos respectively. Spikes setters like Skarmory and Deoxys-D have great synergy with Scream Tail, spreading entry hazards with it, which can help break it through RegenVest users like Swampert and Manaphy.</p>"
      },
      "Unaware": {
        "description": "<p>Scream Tail uses its good bulk and great typing to be a superb Unaware wall, taking hits from boosted attackers such as Dragonite, Great Tusk, and Tail Glow Manaphy. It can also act as a Wish passer for teammates without reliable healing such as Roaring Moon, non-Regenerator Great Tusk, and Primarina. Calm Mind can be used in order to take on special threats like Zapdos and Deoxys-S, while Thunder Wave is an option to cripple switch-ins like Iron Moth, Gholdengo, and Ceruledge. Offensive Pokemon like Barraskewda, Roaring Moon, and Chien-Pao appreciate Scream Tail being able to take on Pokemon like Iron Hands, Great Tusk, and Dragonite while also providing them with healing. Scream Tail struggles with Ghost-types such as Gholdengo, Gengar, and Ceruledge, so having checks to them like Manaphy, Mandibuzz, and Roaring Moon can help.Teammates like Corviknight and Great Tusk can aid Scream Tail by removing the entry hazards that can wear it down. Finally, Scream Tail appreciates the presence of defensive checks to Chien-Pao, Ogerpon-W, and Iron Boulder such as Manaphy, Mandibuzz, and Corviknight, as it struggles to take them on repeatedly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Slither Wing": {
    "sets": {
      "Choice Band": {
        "description": "<p>Slither Wing's massive Attack stat alongside its powerful STAB moves makes it a strong wallbreaker, pivot, and revenge killer, able to threaten common physical walls like Corviknight, Deoxys-D, and Mandibuzz. First Impression lets Slither Wing pick off faster offensive threats like Chien-Pao, Latios, and Roaring Moon. Flare Blitz threatens Fluffy users like Corviknight, Zapdos, and Great Tusk as well as non-Well-Baked Body Gholdengo, while Earthquake threatens Ceruledge, Pecharunt, and non-Earth Eater Gholdengo. Tinted Lens helps Slither Wing revenge kill offensive threats like Dragonite, Zapdos, and Volcarona and boosts the power of U-turn against foes like Great Tusk, while Sword of Ruin lets Slither Wing OHKO Deoxys-D after entry hazard chip damage with U-turn, OHKO Fluffy Corviknight with Flare Blitz, OHKO Gholdengo with Earthquake, and 2HKO Defensive Great Tusk with Close Combat. While more niche, Scrappy lets it OHKO Gholdengo with Close Combat while still 2HKOing Intimidate Corviknight. Fast cleaners like Chien-Pao, Meowscarada, and Iron Boulder appreciate Slither Wing's ability to pressure their walls like Corviknight and Gholdengo, letting them sweep late-game once those walls have been chipped down or removed. Slither Wing's middling speed and only decent bulk leaves it vulnerable to offensive threats that do not fear First Impression like Ceruledge, Dragonite, and Azelf, making checks to them like Great Tusk, Corviknight, and Heatran, respectively, valuable teammates. Slither Wing is also prone to getting worn down by entry hazards, so hazard removers like Mandibuzz and the aforementioned Great Tusk and Corviknight are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Sandy Shocks": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Sandy Shocks leverages a great typing, solid Speed tier, and access to entry hazards and Volt Switch to be a solid offensive pivot. Volt Switch allows Sandy Shocks to pivot out of uncomfortable matchups such as Meloetta, RegenVest Roaring Moon, and Blissey. Entry hazards allow Sandy Shocks to consistently pressure foes, with Stealth Rock being a notable option over Spikes to hit Chien-Pao and Ceruledge, and they synergize well with its STAB moves which naturally threaten common hazard removers such as Corviknight and Great Tusk. Choice Scarf helps Sandy Shocks to alleviate its unimpressive Speed, turning it into a potent revenge killer and cleaner, outpacing threats such as Modest Deoxys-S, Iron Boulder, and Cinderace, while Heavy-Duty Boots allows it to bypass entry hazards, turning it into a more durable pivot and not locking it into a single move. Sandy Shocks works excellently with powerful physical pivots such as Meowscarada, Barraskewda, and Roaring Moon, threatening common physical walls such as Corviknight and Great Tusk and giving these physical wallbreakers opportunities while forming a potent VoltTurn core. Sandy Shocks is frail and struggles to switch in against non-Electric-types; defensive pivots such as Corviknight, Mandibuzz, and Swampert are all appreciated to help alleviate this.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540420, "username": "Gimmicky"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 611238, "username": "LordBox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Iron Treads": {
    "sets": {
      "RegenVest": {
        "description": "<p>Iron Treads is a niche RegenVest wall that offers valuable Rapid Spin utility, pivoting, and a unique typing that resists the tier's common Psychic- and Electric-type special attacks. Volt Switch provides pivoting while also chipping switch-ins like Corviknight and Manaphy, whereas Knock Off greatly reduces the longevity of defensive walls, notably Great Tusk and Swampert who would normally come in to absorb Volt Switch. Iron Treads is a pain to deal with for fast Electric-types, including Hisuian Electrode and non-Weather Ball Zapdos, and it can survive a Focus Blast from Thundurus or an Earth Power from Sandy Shocks. It also acts as a reliable answer to Azelf, Latios, and Gholdengo, threatening them with Knock Off while not being crippled by Trick. Iron Treads fits best on stall teams, providing much-needed hazard removal while relying on other specially defensive walls like Empoleon and Blissey to cover its weaknesses to common special attackers such as Primarina, Sandy Shocks, and Iron Moth. Iron Treads also appreciates physically defensive walls like Corviknight and Toxapex, as it naturally loses to some of the tier's most common physical wallbreakers such as Ceruledge, Chien-Pao, and Galarian Zapdos. Iron Treads can also be run as a role compression option on more offensive teams, as it can provide semi-reliable pivoting and Rapid Spin support for Chien-Pao and Ogerpon-H; in return, they threaten the Ground-types that Iron Treads struggles against such as the aforementioned Swampert and Great Tusk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 539679, "username": "GlalieGoesBoom"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Iron Hands": {
    "sets": {
      "Earth Eater": {
        "description": "<p>Swords Dance, huge bulk, and a good defensive typing allow Iron Hands to become an incredibly threatening wallbreaker. Earth Eater allows it to set up on would-be checks like Swampert, Great Tusk, and Sandy Shocks. Substitute allows it to take advantage of foes like Empoleon, Roaring Moon, and Chien-Pao, which are forced out by it, allowing it valuable turns to set up. 172 Special Defense EVs allow its Substitute and withstand a Scald from RegenVest Manaphy, while 196 Speed EVs let it outspeed Manaphy. It is next to impossible to OHKO a full health Iron Hands behind dual screens, so support from Prankster Corviknight and Deoxys-S on hyper offense teams can help by allowing it extra turns to set up and letting it beat would-be offensive checks like Latios and Primarina. Iron Hands struggles against Unaware Pokemon, in particular Deoxys-D and Scream Tail, so teammates that can threaten them like Gengar and Ceruledge make for good partners. Barraskewda and Chien-Pao are teammates that enjoy the presence of Iron Hands, as it is excellent at trading itself to remove would-be checks to them like physically defensive Primarina and Manaphy, Intimidate Corviknight, and Choice Scarf Roaring Moon. Strong special attackers like Deoxys-S, Azelf, and Latios can be troublesome for Iron Hands, forcing it out; as a result, bulky special walls like Swampert, Manaphy, and Blissey are appreciated by it.</p>"
      },
      "Surge Surfer": {
        "description": "<p>Surge Surfer Iron Hands is a great wallbreaker, leveraging the Speed boost procured by its ability to outspeed almost the entire unboosted metagame and set up with Swords Dance in order to break though opposing teams. It also has a great matchup against a lot of defensive staples such as Corviknight and Gholdengo. Ice Punch allows Iron Hands to hit Garchomp and foes that resist its STAB combination such as Latios, Dragonite, and Landorus-T for greater damage. Since Iron Hands is reliant on Electric Terrain to function, it must be paired with a Hadron Engine pivot such as Latios or Sandy Shocks, both of which can apply additional pressure on Great Tusk; in return, Iron Hands can beat Pokemon that Sandy Shocks is unable to hit such as Landorus-T. Iron Hands is not a conventional wallbreaker, and it can struggle to power through teams on its own; therefore, teammates such as Roaring Moon and Iron Boulder are appreciated, as they can apply pressure on Pokemon such as Deoxys-D and physically defensive Great Tusk, respectively, which Iron Hands struggles against. Pivots such as Roaring Moon and Galarian Zapdos are also great partners, as they can bait in Pokemon that Iron Hands can easily take advantage of to set up, such as Primarina and Corviknight.</p>"
      },
      "RegenVest": {
        "description": "<p>Iron Hands's great natural bulk and typing let it serve as a potent mixed wall and pivot, checking and scouting common threats like Gholdengo, Iron Moth, Chien-Pao, and Dragonite. Drain Punch provides a drawback-free STAB move with recovery, while Close Combat grants more immediate power, being able to 2HKO Swampert. Earthquake allows Iron Hands to threaten offensive wallbreakers like Gengar, Iron Moth, and Gholdengo, while Ice Punch can help to hit Ground-types like Great Tusk that can block Volt Switch and Flying-types like Zapdos and Dragonite. Iron Hands struggles with strong Psychic- and Fairy-type wallbreakers like Azelf and Primarina, so it appreciates partners like Empoleon and Mandibuzz that can help with these matchups. Iron Hands dislikes common defensive Ground-types like Great Tusk and Swampert that can block its attempt to pivot with Volt Switch, and it can struggle against particularly strong physical wallbreakers like Choice Band Galarian Zapdos, so it partners well with walls that can handle them like Corviknight and Deoxys-D. Frail offensive wallbreakers like Chien-Pao and Azelf appreciate Iron Hands's ability to safely pivot them onto the field and wall revenge killers like Choice Scarf Gholdengo and Roaring Moon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543620, "username": "Vertigo"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 620359, "username": "olivia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 528036, "username": "Sulo"}, {"user_id": 552227, "username": "Kinetic"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Iron Moth": {
    "sets": {
      "Desolate Land": {
        "description": "<p>Iron Moth functions as an offensive pivot that can also opt to spread status. U-turn allows Iron Moth to gain momentum on switch-ins such as Manaphy, Swampert, and Meloetta, as well as Fire-immune foes such as Well-Baked Body Gholdengo and Corviknight. Toxic and Toxic Spikes allow Iron Moth to chip down defensive Pokemon. Energy Ball is decent coverage against would-be switch-ins like Manaphy, Swampert, and Primordial Sea Barraskewda. Dazzling Gleam hits Dragon-types like Roaring Moon, Latios, and Dragonite. Discharge hits Manaphy and Well-Baked Body Corviknight and can notably paralyze Well-Baked Body Gholdengo. Desolate Land effectively grants Iron Moth a Water immunity, enabling it to switch into Ogerpon-W, Barraskewda, and Primarina for its team. Pokemon with setup moves like Ogerpon-W appreciate Iron Moth's ability to bait in RegenVest users like Manaphy and Meloetta and pivot on them. Iron Moth does pitiful damage to RegenVest users like Manaphy, Meloetta, and Hisuian Goodra, so it benefits from special wallbreakers like Deoxys-S, Scream Tail, and Latios that can lure in and help wear down shared checks; they also appreciate Iron Moth chipping said checks, especially with Toxic or Toxic Spikes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 594122, "username": "Evie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Gholdengo": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Gholdengo's naturally good offensive presence, fantastic typing, and access to reliable recovery combine to make it a staple defensive piece. Hex can be run over Shadow Ball in conjunction with Thunder Wave to increase its maximum Base Power while spreading paralysis to support Gholdengo's teammates. Well-Baked Body allows Gholdengo to wall Pokemon reliant on Fire-type moves to beat it, such as Iron Moth, Cinderace, and Ogerpon-H lacking Knock Off. Similarly, Earth Eater handles opposing Ground-types such as non-Scrappy Great Tusk. Bulletproof is used to negate Shadow Ball from Gengar, Hisuian Zoroark, and opposing Gholdengo. Gholdengo's natural typing allows it to use nearly any immunity ability effectively, so options like Water Absorb and Volt Absorb can also be used depending on the needs of its team, although these are generally less effective. 28 Speed EVs are used to outspeed minimally invested Great Tusk, with the remaining EVs being used to maximize Gholdengo's physical bulk to better check physical attackers. Gholdengo is particularly vulnerable to Dark-types like Roaring Moon and Chien-Pao, and many Pokemon like Iron Boulder and Ogerpon-C run Dark-type coverage specifically to hit all variants of it. Thus, Pokemon that can take hits from Dark-type attackers such as Corviknight and Great Tusk make good partners. Gholdengo cannot check most special attackers, so it appreciates having special walls such as Swampert and Manaphy as teammates. Finally, Gholdengo can be taken advantage of and used for momentum by RegenVest Pokemon such as Swampert and Meloetta, so it appreciates strong wallbreakers such as Roaring Moon and Galarian Zapdos to bust through these walls.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Thanks to its high base Special Attack that's further boosted by Adaptability, as well as its usable Speed that's improved by Choice Scarf, Gholdengo functions as a revenge killer and late-game cleaner. Trick allows Gholdengo to punish common switch-ins such as Swampert, Manaphy, and Empoleon, allowing teammates like Latios, Zapdos, and Primarina to deal more damage and beat their would-be checks. Recover, while it doesn't seem as though it would fit on a Choice Scarf Pokemon, is the preferred option in the fourth moveslot, as it greatly improves Gholdengo's longevity and becomes quite usable after it uses Trick. Focus Blast is a secondary option that provides a way for Gholdengo to hit bulky Steel-type Pokemon like Kingambit, Hisuian Goodra, and non-Bulletproof Empoleon; alternatively, Dazzling Gleam hits Roaring Moon, Latios, and Iron Hands. Adaptability, while boosting the power of Gholdengo's STAB moves and allows it to bluff immunity abilities such as Well-Baked Body and Earth Eater. Gholdengo threatens to outspeed and OHKO fast offensive threats such as Latios, Chien-Pao, and Iron Boulder but cannot switch safely into some of them. Gholdengo struggles against specially defensive walls such as Swampert, Empoleon, and Manaphy, so strong physical attackers like Ogerpon-H and Iron Hands can be used to beat them, and in return, while Ogerpon-H and Iron Hands appreciate Gholdengo's speed control. Gholdengo appreciates strong physical wallbreakers such as Roaring Moon and Zamazenta that improve its ability to clean, as well as slow pivots like Corviknight and Manaphy to help Gholdengo switch in safely.</p>"
      },
      "Hadron Engine": {},
      "Magic Guard": {},
      "Specially Defensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 473082, "username": "abriel"}, {"user_id": 652656, "username": "Gambit_Gamin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 552227, "username": "Kinetic"}, {"user_id": 523866, "username": "UT"}, {"user_id": 611238, "username": "LordBox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Chien-Pao": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Chien-Pao is a strong wallbreaker, being able to blast through many teams on its own. Its high Attack and Speed combined with its good STAB moves and Choice Band to bolster its damage even further make it extremely difficult to handle. Lash Out can be used over Crunch to hit Intimidate Corviknight harder. Ice Shard helps to pick up KOs on weakened, faster foes like Galarian Zapdos and Choice Scarf Roaring Moon; it can also OHKO frail targets like Hisuian Electrode from full HP. Sacred Sword hits Dark-, Steel-, and Rock-types like Kingambit, Heatran, and Garganacl. Chien-Pao can have a hard time breaking through defensive Pokemon like Intimidate Corviknight and Quaquaval, making partners like Ceruledge and Dragonite appreciated. Choice Scarf users like Gholdengo can be tough foes for Chien-Pao, forcing it out; this makes slow pivots like Meloetta and RegenVest Manaphy good teammates, as they can deal with these Choice Scarf users and also help bring it in safely after taking a hit. Chien-Pao's weakness to Stealth Rock can become a problem quickly if not accounted for, so entry hazard removers like Great Tusk and Mandibuzz are good partners.</p>"
      },
      "Swords Dance": {
        "description": "<p>Access to Swords Dance and a high Attack and Speed stat make Chien-Pao a powerful wallbreaker and sweeper. It also has a STAB combination that is resisted by few Pokemon; hits physical walls like Mandibuzz, Deoxys-D, and Great Tusk super effectively; and can OHKO many offensive threats like Slither Wing after a Swords Dance. Ice Shard picks off faster foes like Hisuian Electrode and, after some chip damage, Choice Scarf Roaring Moon and Sandy Shocks. Adaptability lets Chien-Pao OHKO Iron Moth and makes breaking through walls like Intimidate Corviknight easier, while Magic Guard offers more longevity. Special attackers like Latios and Azelf appreciate Chien-Pao being able to threaten their switch-ins like Gholdengo and Swampert, letting them rip massive holes in or sweep teams; they can also safely pivot it in, allowing more opportunities for it to deal significant damage. Chien-Pao appreciates other physical wallbreakers like Choice Band Roaring Moon and Galarian Zapdos helping break through walls like Intimidate Corviknight that it struggles to deal with. Chien-Pao is also prone to getting revenge killed by Choice Scarf users such as Latios and Azelf, so teammates that can switch into them and safely pivot it in like Swampert and Empoleon are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ting-Lu": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Thanks to its incredible defenses and solid utility movepool, Ting-Lu functions as an adequate physically defensive wall. Ting-Lu can use Spikes for entry hazard stack team archetypes, which benefit cleaners such as Azelf and Dragonite; alternatively, Stealth Rock allows Ting-Lu to provide general support for its team and deal chip damage to Corviknight, Chien-Pao, and Ceruledge. Ruination lets Ting-Lu chip would-be switch-ins like Zamazenta, Great Tusk, and Galarian Zapdos, while Taunt blocks recovery and hazard removal attempts from the likes of Corviknight. Whirlwind works well with Spikes and prevents setup attempts from Pokemon such as Dragonite and Earth Eater Gholdengo, while Protect allows Ting-Lu to gain additional Leftovers recovery and figure out what move opposing Choice item Pokemon like Chien-Pao, Latios, Terrakion, and Zamazenta are going to use. Regenerator is the preferred ability on Ting-Lu, as it lacks reliable recovery, while Magic Guard is a secondary option that lets it switch in more easily because it won't take hazard damage or poison damage from Toxic and Toxic Spikes, but Magic Guard should only be used if there is another Regenerator Pokemon on its team. Pecharunt greatly appreciates Ting-Lu's presence, thanks to Ting-Lu's ability to switch in on Pokemon such as Gholdengo and Iron Boulder; Ting-Lu also appreciates Pecharunt, since Pecharunt can check Pokemon that Ting-Lu tends to struggle against like Iron Hands and Zamazenta. Ting-Lu also has trouble with Spikes, so hazard removers such as Corviknight and Great Tusk are greatly appreciated. Strong Water-type wallbreakers such as Primordial Sea Ogerpon-W and Primarina can easily switch in on Ting-Lu and greatly threaten it, so Pokemon such as Empoleon and Manaphy are appreciated to counter them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit_Gamin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 594122, "username": "Evie"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Roaring Moon": {
    "sets": {
      "Choice Item": {
        "description": "<p>No matter which of Choice Band or Choice Scarf you decide to use, rest assured: Roaring Moon will be able to blast holes in the enemy team. A high Attack combined with the power of Sword of Ruin as well as a good Speed tier allows it to function as a potent wallbreaker or revenge killer, depending on your choice of item. Earthquake and Stone Edge allow Roaring Moon to hit Steel-types such as Heatran and Fairy-types such as Enamorus-T, which resists both of its STAB moves, respectively. Lash Out is a good option to punish Intimidate Corviknight. Choice Scarf allows Roaring Moon to act as excellent speed control, outspeeding and revenge killing threats like Azelf and Deoxys-S, while Choice Band lets it OHKO Unaware Deoxys-D and Galarian Zapdos. Roaring Moon struggles against Fluffy Corviknight and defensive Great Tusk, so partners such as Azelf and Ogerpon-H are appreciated; in return, it can threaten their checks like Gholdengo and Iron Moth.</p>"
      },
      "Magic Guard": {
        "description": "<p>Magic Guard Roaring Moon leverages its excellent offensive profile with Magic Guard to outlast its common checks and still put tremendous pressure on the opposing team with Knock Off, pivoting, and an excellent Speed tier. Some normally reliable Roaring Moon answers like Great Tusk, Iron Hands, and Fluffy Corviknight are prone to being worn down through the combination of U-turn, losing their Leftovers or Heavy-Duty Boots, and switching in, often through entry hazards, just for Roaring Moon to pivot out. Roost, combined with Roaring Moon's decent bulk, allows it to have a credible defensive profile as well and switch into weak or resisted attacks from the likes of Iron Moth and Hisuian Electrode. Earthquake is an option to hit Iron Moth, Kingambit, Primarina, and Iron Hands harder than Dragon Claw. Taunt is an option as well that lets Roaring Moon deny recovery attempts and entry hazards from the likes of Corviknight and Empoleon. Roaring Moon loves being included on hazard stacking balance teams, as it can easily remove Heavy-Duty Boots and pivot around to wear down its checks. As a result, teammates like Scream Tail, Ting-Lu, and Great Tusk make excellent partners. Roaring Moon is an excellent choice to wear down common defensive staples like Fluffy Corviknight and Great Tusk, making it a great teammate for Pokemon like Zamazenta and Iron Boulder to burst through opposing teams. Roaring Moon struggles with faster offensive threats like Zamazenta and lacks immediate power against bulkier threats like physically defensive Manaphy and Primarina; as a result, it needs reliable partners like Pecharunt to tank hits and either reliable hazard stackers or powerful wallbreakers like Latios to push through those structures.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Due to its high Attack and Speed further augmented by Dragon Dance, Roaring Moon functions incredibly as a threatening setup sweeper. Iron Head provides coverage for Fairy-types like Scream Tail, while Stone Edge nails Mandibuzz and can bypass Fluffy walls like Corviknight. Outrage is used to deal massive damage to physically bulky Pokemon such as Iron Hands at the cost of confusion; alternatively, Acrobatics can be used to handle Great Tusk and most Ogerpon formes after Weakness Policy's activation. Weakness Policy can easily be activated by a weak U-turn from Corviknight, Manaphy, or Azelf, while Life Orb provides consistent damage. Applicable partners include Prankster Corviknight for its dual screens support and ability to pivot Roaring Moon in safely, and Gholdengo, since it has incredible type synergy with Roaring Moon, being able to resist Fairy, Dragon, Bug, Ice, and having an immunity to Fighting. Roaring Moon struggles against defensive Great Tusk, especially Fluffy variants, and Fluffy Corviknight. With partners such as Azelf and Manaphy for Great Tusk and Iron Moth and Ogerpon-H for Corviknight, Roaring Moon's biggest checks and counters become quite threatened. Additionally, wallbreakers such as Choice Band Iron Boulder and Chien-Pao can both physically wear down defensive walls to clear the way for Roaring Moon to get a clean sweep.</p>"
      },
      "RegenVest": {
        "description": "<p>Roaring Moon's excellent set of resistances, great Speed and Attack, and solid bulk make it a serviceable bulky pivot without the passivity of other RegenVest Pokemon like Manaphy and Swampert; in particular, its great typing allows it to scout and offensively check and prominent special attackers like Gholdengo, Iron Moth, and Hisuian Electrode. U-turn allows it to maintain high momentum, pivoting out of difficult matchups like against Great Tusk and Fluffy Corviknight and healing off any chip damage with Regenerator. Earthquake allows it to hit Steel-types like Kingambit and Heatran, which would otherwise trouble it. Roaring Moon tends to play aggressively, with its average bulk contributing to it being seen mainly on offensive teams; therefore, hard-hitting offensive teammates like Ogerpon-C, Chien-Pao, and Azelf enjoy its presence. Roaring Moon cannot safely switch in on strong Dragon-types like Latios, so a secondary special wall like Empoleon or Scream Tail makes for an excellent partner. Entry hazards severely compromise Roaring Moon's longevity, and its lack of physical bulk makes it reliant on strong physical walls to take hits instead; as a result, physically defensive hazard removers like Great Tusk and Corviknight are nearly essential partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}, {"user_id": 543620, "username": "Vertigo"}, {"user_id": 620359, "username": "olivia"}, {"user_id": 652656, "username": "Gambit_Gamin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 475288, "username": "Tranquility"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 603931, "username": "Slither Wing"}, {"user_id": 552227, "username": "Kinetic"}, {"user_id": 523866, "username": "UT"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ogerpon-Wellspring": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Fantastic STAB coverage, a solid Speed tier, and good coverage options all make Ogerpon-W a force to be reckoned with, being able to shatter most of the tier's physical walls such as Corviknight, Gholdengo, and Mandibuzz after a Swords Dance. Power Whip packs more of a punch, letting it OHKO RegenVest Manaphy without a Swords Dance boost, while Horn Leech grants it more longevity. Knock Off lets it threaten Desolate Land users such as Iron Moth, Ceruledge, and Heatran, while Play Rough picks off Dragon-types such as Roaring Moon, Dragonite, and Latios. Trailblaze enables Ogerpon-W to act as more of a sweeper, letting it outspeed threats such as Iron Boulder, Chien-Pao, and Deoxys-S, while Spikes can be used to help chip down Hisuian Goodra and other walls for its teammates. Ogerpon-W pairs well with fast cleaners such as Iron Boulder and Choice Scarf Roaring Moon, as they appreciate its ability to pressure Fluffy users such as Corviknight and Great Tusk thanks to Ivy Cudgel not making contact. In spite of its solid speed, Ogerpon-W is still threatened by faster targets such as Chien-Pao, Choice Scarf Azelf, and Roaring Moon, making defensive pivots such as Corviknight and Swampert crucial in order to bring it in safely.</p>"
      },
      "All-Out Attacking": {}
    },
    "credits": {"writtenBy": [{"user_id": 603931, "username": "Slither Wing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ogerpon-Hearthflame": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Thanks to its great Attack stat, its strong STAB moves, and Swords Dance, Ogerpon-H is a powerful wallbreaker that's able to threaten common physical walls like Deoxys-D and non-Well-Baked Body Corviknight. Power Whip OHKOes defensive Great Tusk at +2 and has a good chance to OHKO offensive Great Tusk, while Horn Leech trades power for healing and a guaranteed chance to hit. Play Rough threatens Dragon-types like Dragonite and Roaring Moon looking to switch in, while Knock Off has a high chance of OHKOing Well-Baked Body Gholdengo at +2 and hinders switch-ins like Primordial Sea Zapdos and Well-Baked Body Mandibuzz and Corviknight. Fast cleaners like Choice Scarf Azelf and Chien-Pao appreciate Ogerpon-H's ability to threaten their switch-ins like RegenVest Swampert and Intimidate Corviknight, respectively, paving the way for them to clean late-game. Ogerpon-H's middling bulk and only decent Speed stat leave it threatened by many faster offensive foes like Roaring Moon and Iron Boulder, so teammates that can deal with them offensively like the aforementioned Choice Scarf Azelf and Chien-Pao or defensively like Great Tusk and Corviknight, which can also remove the entry hazards that Ogerpon-H is prone to getting worn down by, are appreciated. Entry hazard support from the likes of Great Tusk and Heatran is also appreciated, as it helps Ogerpon-H KO foes like Gholdengo and Deoxys-D.</p>"
      },
      "All-Out Attacking": {}
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ogerpon-Cornerstone": {
    "sets": {
      "Swords Dance": {
        "description": "<p>When boosted by the power of Rocky Payload and its Cornerstone Mask, Ogerpon-C is a devastating wallbreaker that's capable of threatening nearly the entire metagame due to the lack of capable Rock-resistant Pokemon. Power Whip is Ogerpon-C's strongest Grass-type attack, OHKOing specially defensive Manaphy and having a good chance to OHKO offensive Great Tusk, while Horn Leech can provide recovery if desired. For the last moveslot, Knock Off has a good chance of OHKOing Gholdengo at +2, Low Kick deals with Hisuian Goodra and Kingambit, and Trailblaze increases Ogerpon-C's effectiveness against faster teams. Other physical wallbreakers like Chien-Pao and Roaring Moon appreciate Ogerpon-C's presence, as together they can overwhelm physical walls such as Corviknight, Skarmory, and Great Tusk. Ogerpon-C's poor defensive typing and average Speed means it appreciates slow, bulky pivots such as Corviknight, RegenVest Swampert, and RegenVest Manaphy to provide it with safe entry onto the field. Its Speed also leaves it prone to getting picked off by faster offensive Pokemon such as Chien-Pao, so speedy teammates such as Barraskewda, Choice Scarf Azelf, and Choice Scarf Roaring Moon are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 473082, "username": "abriel"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 552227, "username": "Kinetic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Archaludon": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>With Regenerator, a solid defensive typing, and high physical bulk, Archaludon acts as a good physical wall that can wear down the opposing team. Dragon Tail phazes setup sweepers like Iron Hands, Dragonite, and all Ogerpon formes, and Heavy Slam hits Fairy-types such as Scream Tail and Florges. Alternatively, Iron Defense benefits Body Press's damage output and renders Archaludon's matchup against physical setup sweepers better. As Archaludon forces switches with Dragon Tail, Stealth Rock further increases the chip damage it deals to the opposing team. Rocky Helmet lets Archaludon wear down pivots such as Barraskewda, Cinderace, and Roaring Moon. Archaludon covers a variety of physical attackers such as all Ogerpon formes, Roaring Moon, and Barraskewda, but it is overwhelmed by offensive wallbreakers like Great Tusk, Zamazenta, and Galarian Zapdos, so allies such as Fluffy Corviknight and Skarmory are much appreciated. Archaludon also appreciates Pokemon like Hisuian Electrode and the Ogerpon formes beating Swampert, which it can't make much progress against. Archaludon has poor Special Defense, which makes it vulnerable to special wallbreakers such as Heatran, Iron Moth, and Gengar, so it appreciates specially defensive allies like Blissey and Empoleon.</p>"
      },
      "Offensive Entry Hazard Setter": {
        "description": "<p>Archaludon acts as a niche Stealth Rock setter that scares away common entry hazard removal options like Corviknight, Mandibuzz, and Great Tusk with the combination of Electro Shot and Draco Meteor. Furthermore, Electro Shot + Primordial Sea allows Archaludon to threaten to snowball at a moment's notice. Earthquake smacks Desolate Land Iron Moth and Heatran attempting to come in on Electro Shot, while Body Press chunks checks like Blissey and Volt Absorb Empoleon. Primordial Sea allows Archaludon to offensively counter Iron Moth and grants it a one-turn Electro Shot. Additionally, Archaludon's good typing and natural physical bulk allow it to take on Zapdos and all Ogerpon formes in a pinch, but it should never be relied on to check them. Archaludon greatly struggles with its lack of Speed; as a result, fast offensive pivots that can bring it in safely like Roaring Moon, Azelf, and Walking Wake pair well with it, especially considering its ability to force hazard damage on their switch-ins, like Corviknight, Empoleon, and Manaphy. Archaludon's low Special Defense and Speed cause it to be susceptible to special attackers like Walking Wake, Azelf, and Pixilate Scream Tail, making pivots that can safely switch in to them like Empoleon, RegenVest Manaphy, and Swampert good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 552227, "username": "Kinetic"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Iron Boulder": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Iron Boulder is one of the best single-button clickers imaginable; honestly, the other moves are mostly decorative. Sharpness- and Choice Band-boosted Mighty Cleave has excellent power and coverage, notably 2HKOing Unaware Deoxys-D and OHKOing most slower offensive Pokemon like Galarian Zapdos and Roaring Moon. Psycho Cut covers important targets like Great Tusk, Iron Hands, and Swampert, while Throat Chop reliably beats Gholdengo, and Sacred Sword beats Iron Treads and Hisuian Goodra. Iron Boulder has an awful defensive typing and greatly appreciates being brought in by slow pivots like Manaphy and Corviknight; thanks to its great Speed tier, it can usually force out the wallbreakers that come in on them in return. Iron Boulder also pairs well with other physically offensive threats like Barraskewda and Garchomp that can wear down opposing walls like Intimidate Corviknight with it. Fluffy walls such as Corviknight and Deoxys-D are extremely difficult for Iron Boulder to break past, so a strong Fire-type like Iron Moth or Ceruledge makes an excellent teammate.</p>"
      },
      "Swords Dance": {
        "description": "<p>With an amazing Speed stat and great STAB moves, Iron Boulder stands out as one of the tier's strongest wallbreakers. Swords Dance lets it tear through some of the tier's most common physical walls including Great Tusk, Deoxys-D, and non-Fluffy Corviknight. Iron Boulder has plenty of options as a last move: Sacred Sword helps deal with Steel-types like Hisuian Goodra, Kingambit, and Iron Treads, as well as Regenerator Ting-Lu; Throat Chop notably hits Gholdengo; and Earthquake acts as a midground option, hitting the aformentioned Sacred Sword targets and non-Earth Eater Gholdengo at the cost of not getting boosted by Sharpness. Iron Boulder appreciates offensive pivots like Barraskewda and Choice Scarf Roaring Moon, as they're able to clean up after it has weakened the physical walls. Iron Boulder also appreciates defensive pivots like Corviknight and Swampert, as they can bring it in safely. Despite its amazing Speed stat, it's still prone to getting revenge killed by faster targets like Chien-Pao, Hisuian Electrode, and Choice Scarf Roaring Moon, making defensive walls like Corviknight, Meloetta, and Great Tusk necessary. Iron Boulder lacks damage without a boost from Swords Dance, so entry hazard setters like Deoxys-D, Sandy Shocks, and Skarmory are greatly appreciated, as they help chip foes into its KO range.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}, {"user_id": 603931, "username": "Slither Wing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 611238, "username": "LordBox"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Iron Crown": {
    "sets": {
      "Double Dance": {
        "description": "<p>The combination of Calm Mind and Agility, which lets Iron Crown outspeed almost the entire metagame after just one use, gives it the potential to be a deadly setup sweeper. Stored Power gives Iron Crown scaling damage, letting it 2HKO offensive threats like Iron Moth and Zamazenta after one Agility and OHKO them after one Calm Mind with some chip damage. Additionally, it lets Iron Crown 2HKO specially defensive Garchomp and RegenVest Iron Hands at +4, which can be easily achieved by letting its Weakness Policy activate. Furthermore, with one Agility boost and after Weakness Policy has activated or Calm Mind has been used twice, it lets Iron Crown OHKO even Psychic-resistant Pokemon like Corviknight and Gholdengo and 2HKO most RegenVest users, like Manaphy and Swampert. Iron Crown is heavily reliant on setup moves to perform its role, so it is easily shut down by Taunt, can be stopped by dedicated special walls like Blissey and Chansey, and needs teammates like Chien-Pao and Ogerpon-H that can handle them. A dual screens setter like Corviknight or Deoxys-S is appreciated to help Iron Crown with both activating its Weakness Policy and setting up safely. Bulky Dark-types like Mandibuzz and Kingambit give Iron Crown a lot of trouble, so teammates like Galvanize Kommo-o and Iron Hands are needed to remove them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Theia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 580765, "username": "cat"}, {"user_id": 603931, "username": "Slither Wing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Pecharunt": {
    "sets": {
      "Prankster": {
        "description": "<p>Pecharunt uses its tremendous physical bulk, useful slate of resistances, and Prankster Parting Shot + Destiny Bond to anchor defensive cores, pivot to dangerous attackers, and eliminate opposing wincons in an emergency. Prominent physical attackers like Zamazenta, Iron Hands, and the Ogerpon formes struggle to break through it. Prankster Destiny Bond allows Pecharunt to trade itself for an opposing setup sweeper or cleaner that its team cannot handle, especially since it can alternate between Destiny Bond and its attacking move to keep the effect active. Malignant Chain is the preferred attack for its wonderful poison chance, but Shadow Ball is an option for its higher PP and ability to touch Corviknight. Heavy-Duty Boots is the preferred option to maximize Pecharunt's ability to pivot freely without the need to recover, especially since Pecharunt's removal of Toxic Spikes lets it support teams without strong entry hazard removal, but Black Sludge is an option on teams with very reliable entry hazard control. Colbur Berry is a niche item to better check Roaring Moon. Pecharunt struggles mightily against Roaring Moon, Kingambit, and Chien-Pao, as it cannot even pivot against them, so sturdy checks to them like Corviknight, Skarmory, and physically defensive Manaphy are strongly recommended. Pecharunt is petrified of Ceruledge, so teammates like Well-Baked Body Mandibuzz and Eject Button Garchomp are appreciated. Offensive teammates like Deoxys-S, Latios, and Roaring Moon love the free switches in Pecharunt generates with Parting Shot and its ability to switch into their revenge killers.</p>"
      },
      "Physical Wall": {
        "description": "<p>Pecharunt is a solid physical wall with a massive Defense stat and valuable Ghost typing that allows it to handle the tier's many strong Fighting-type wallbreakers like Iron Hands, Galarian Zapdos, and Slither Wing. Toxic is mandatory on Corrosion sets and has more consistency and PP than Malignant Chain, but Malignant Chain provides a secondary STAB option that immediately threatens Ogerpon-W and Ogerpon-H. Hex pairs nicely with Toxic and should always be used on Corrosion sets, but Shadow Ball grants a stronger immediate hit, especially against Steel-types like Corviknight and Empoleon. Pecharunt can safely pivot in frail offensive teammates like Chien-Pao, Ogerpon-C, and Sandy Shocks with Parting Shot, while also being a great switch-in to dangerous revenge killers like Barraskewda and Zamazenta that threaten them. Well-Baked Body allows Pecharunt to shut down Fire-type wallbreakers like Cinderace and Ogerpon-H, while Intimidate pushes its already tremendous walling capabilities even further, letting it act as a hard counter to the aforementioned Fighting-types. Earth Eater is another option that allows Pecharunt to handle Garchomp and Great Tusk, as well as letting it safely block the latter's Rapid Spin. Black Sludge provides passive healing, while itemless lets it wall Ceruledge with Well-Baked Body and take less damage from Knock Off Roaring Moon. Pecharunt is weak to some of the tier's common physical attackers, including Iron Boulder, Kingambit, and Chien-Pao, so it appreciates support from other physically defensive walls like Corviknight and Skarmory. Pecharunt's middling special bulk means that it struggles against the tier's special attackers, most notably Iron Moth, which it struggles to do meaningful damage against; RegenVest users such as Hisuian Goodra, Swampert, and Manaphy help cover these weaknesses.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}, {"user_id": 539679, "username": "GlalieGoesBoom"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Slither Wing"}, {"user_id": 523866, "username": "UT"}, {"user_id": 540420, "username": "Gimmicky"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 652656, "username": "Gambit_Gamin"}]}]}
  }
}