{
  "Venusaur": {"sets": {"Chlorophyll Sweeper": {}, "Tank": {}}},
  "Charizard": {
    "sets": {
      "Drought Wallbreaker": {
        "description": "<p>Mega Charizard Y's immense power combined with Drought makes it an extremely dangerous wallbreaker that threatens common defensive staples like Alomomola, Melmetal, and Ferrothorn while also supporting its teammates via sun. Weather Ball is the preferred Fire-type STAB move, as it is perfectly accurate, quite powerful, and 2HKOs Pelipper in the rain after Stealth Rock. However, Fire Blast can be used to get better damage rolls onto Garchomp and defensive Landorus-T while also hitting Kommo-o through Bulletproof. Solar Beam provides crucial coverage for Water-types, such as Alomomola, Slowbro, and Rotom-W. Scorching Sands allows Mega Charizard Y to hit Heatran, Toxapex, and Mega Tyranitar super effectively; it also pressures them with burns, which is also useful against other switch-ins, such as Kommo-o and Garchomp. On the other hand, Focus Blast is far more threatening to Mega Tyranitar and still hits Heatran, but it leaves Mega Charizard Y struggling to pressure Toxapex. Roost allows Mega Charizard Y to stay healthy throughout a match; this is important given its extreme vulnerability to Stealth Rock.</p> <p>Entry hazard removal is absolutely imperative when using Mega Charizard Y due to its 4x weakness to Stealth Rock. Great Tusk is a standout partner that can clear hazards while also benefitting from Mega Charizard Y's sun due to Protosynthesis. It also offensively pressures common Mega Charizard Y switch-ins, like Mega Tyranitar and Toxapex. A secondary form of entry hazard removal, such as Terapagos or Defog Kartana, is required as well. Raging Bolt is another notable beneficiary of Mega Charizard Y, as it appreciates sun boosting its Special Attack and gaining access to a powerful Fire-type Weather Ball that lets it pressure Ferrothorn and Assault Vest Kingambit. Hisuian Samurott is also a good teammate due to it being able to set Spikes to wear down Mega Charizard Y’s checks, such as Toxapex and Garchomp; in return, Mega Charizard Y threatens Clefable and Ferrothorn for Hisuian Samurott. Mega Charizard Y also appreciates Future Sight support from Slowbro and Galarian Slowking. This is especially potent with Focus Blast variants, as common Future Sight switch-in Mega Tyranitar does not want to take a Focus Blast, and it allows these variants to overcome their lack of coverage for Toxapex. They, along with Alomomola, can also function as slow pivots to get Mega Charizard Y in safely. Faster offensive threats such as Dragapult and Zamazenta appreciate Mega Charizard Y wallbreaking for them early so they can potentially clean up late-game; Dragapult notably does not mind Mega Latios and Mega Latias still being in play, as Mega Charizard Y can struggle to break through them, and it appreciates Mega Charizard Y overwhelming foes like Mega Tyranitar and Ting-Lu. Kingambit is another great partner that can Pursuit trap foes that are problematic for Mega Charizard Y, most notably Mega Latios, Mega Latias, and Dragapult, while also removing items from Moltres and Toxapex.</p>"
      },
      "Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Nidoking": {"sets": {"Wallbreaker": {}}},
  "Clefable": {
    "sets": {
      "Utility": {
        "description": "<p>Clefable is a standout utility piece, possessing a wide variety of utility options along with incredible longevity due to its immunity to entry hazards as well as Toxic from the likes of Alomomola and Toxapex through Magic Guard; this invulnerability to common forms of chip damage allows it to serve as a sturdy check to the likes of Mega Lopunny and Hisuian Samurott for many teams. Clefable is a good user of Stealth Rock due to its positive matchups versus most hazard removal options such as Great Tusk, Terapagos, and Zapdos. Thunder Wave cripples Pokemon that may try to switch in on Clefable, such as Mega Charizard Y and Mega Scizor, allowing for them to be more easily handled. Thunder Wave Clefable also pairs nicely with Hex users like Dragapult and Gholdengo. Knock Off is Clefable’s most spammable move, removing the items of key targets like Heatran, Ferrothorn, Melmetal, and Toxapex. Leftovers is the item of choice on Clefable to help it check Mega Lopunny and Dragonite in the long term while also helping it avoid a 2HKO from Great Tusk’s Headlong Rush. Leftovers also prevents the need for Clefable to waste Soft-Boiled PP in order to stay healthy. The given EV spread allows Clefable to guarantee it does not get 2HKOed by Choice Specs Dragapult after Leftovers recovery.</p> <p>Clefable fits on balance and bulky offense teams, where its longevity, useful role compression and ability to stave off physical attackers like Zamazenta and Hisuian Samurott are valuable. Pokemon like Kingambit and Terapagos appreciate Clefable checking threats like Dragonite, Mega Lopunny, and Urshifu-R and removing items from their checks such as Ferrothorn and Toxapex. Clefable also forms a terrific core with Spikes setters like Ferrothorn and Hisuian Samurott, as it sets up Stealth Rock to further the chip damage of Spikes and removes Heavy-Duty Boots from Pokemon like Zapdos and Terapagos. Although Clefable has solid longevity, its bulk is less than desirable to be a sole check to threats like Mega Medicham and Garchomp. As such, Pokemon that reinforce its defenses such as Mega Latias and Great Tusk are helpful teammates. Clefable also has issues with a myriad of Steel-types, such as Melmetal, Gholdengo, Kingambit, and Mega Scizor. Teammates that help with these threats, like Zamazenta, Zapdos, and Volcarona, are appreciated.</p>"
      },
      "Calm Mind": {}
    },
    "credits": {"writtenBy": [{"user_id": 658067, "username": "Ineros"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Ninetales": {"sets": {"Sun Setter": {}}},
  "Slowbro": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Slowbro takes advantage of its stellar physical bulk, Regenerator, and Teleport to act as an excellent bulky pivot. Scald is preferred for its good chance to permanently hinder most physical attackers such as Mega Scizor and Landorus-T while also deterring foes like Zapdos and Gholdengo. Body Press can be used while holding a Colbur Berry to survive a hit from Mega Tyranitar, Kingambit, and Hisuian Samurott, allowing Slowbro to retaliate with Body Press. Future Sight is used in combination with Teleport to help offensive teammates such as Mega Lopunny, Urshifu-R, and Zamazenta break Pokemon like Toxapex and Alomomola. Thunder Wave is an alternative to Slack Off that punishes Pokemon such as Volcarona, Ogerpon-W, and Dragapult that attempt to set up in front of Slowbro and permanently hinders switch-ins like Tapu Lele and Tornadus-T that Slowbro otherwise struggles against. Heavy-Duty Boots affords Slowbro much more freedom to pivot, while Rocky Helmet punishes weak contact moves, such as Landorus-T's U-turn, and resisted hits from Pokemon such as Urshifu-R and Mega Medicham.</p> <p>Slowbro fits best on balance and bulky offense teams that feature Pokemon such as Urshifu-R and Zamazenta that benefit from its Future Sight and pivoting capabilities while answering Kingambit and Hisuian Samurott, which Slowbro struggles to beat. Slowbro can also be paired with fellow Regenerator users such as Tornadus-T to form a double Regenerator core, with Tornadus-T answering Grass-type Pokemon such as Kartana and Ogerpon-W. Teammates like Ferrothorn and Gliscor can help against Tapu Koko and Raging Bolt, which Slowbro struggles against. In return, Slowbro deals with Urshifu-R and Mega Medicham. Dark-type Pokemon such as Mega Tyranitar, Kingambit, and Ting-Lu pair well with Slowbro, as they deal with Gholdengo and Dragapult, which easily break Slowbro: the former two teammates have the added boon of Pursuit to forcibly remove these Ghost-types and help stave off Choice-locked Tapu Lele.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 526618, "username": "omarsgarciav"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 658067, "username": "Ineros"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Weezing-Galar": {"sets": {"Defensive": {}}},
  "Chansey": {"sets": {"Little Pink Blob": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Ditto": {"sets": {"Those Who Know:": {}}},
  "Zapdos": {"sets": {"Defensive": {}, "Offensive": {}}},
  "Moltres": {
    "sets": {
      "Defensive": {
        "description": "<p>Moltres holds a strong place in the metagame thanks to its unique defensive profile, letting it check dangerous threats like Great Tusk, Mega Charizard Y, and Volcarona, and its good natural bulk lets it help out versus threats such as Dragapult and Gholdengo. U-turn allows Moltres to retain momentum for its team; this is important, as it can be somewhat passive into threats such as Heatran, Alomomola, and Toxapex on its own depending on its moveset, and it often relies on giving its teammates free switches to revenge kill or force out foes. Hurricane gives Moltres a strong STAB move that threatens Zamazenta, Volcarona, and Great Tusk. Toxic allows Moltres to cripple potential switch-ins like Mega Charizard Y, Mega Tyranitar, Ting-Lu, and Alomomola. Scorching Sands allows Moltres to appreciably threaten Heatran while also allowing it to potentially spread burns against foes such as Toxapex. Defog is a possibility in this moveslot if the team needs entry hazard removal and cannot fit it elsewhere, but Moltres is a poor defogger overall, as it doesn't reliably beat many of the tier's entry hazard setters, it is very weak to Knock Off, and Defog takes up a valuable moveslot. Roost allows Moltres to stay healthy throughout the match. A physically defensive EV spread allows Moltres to better check Great Tusk, Melmetal, and Zamazenta, whereas a specially defensive spread allows it to better check Mega Charizard Y, Gholdengo, and Volcarona. Flame Body helps Moltres punish contact moves from Melmetal, Mega Lopunny, and Kingambit with a potential burn. Heavy-Duty Boots is mandatory thanks to Moltres's extreme weakness to Stealth Rock, which severely impacts its ability to function as a pivot.</p> <p>Moltres fits well on bulky offense and balance teams thanks to its solid defensive profile and ability to retain momentum with U-turn. A Knock Off absorber is an important teammate, as Moltres loses a significant amount of its efficacy without Heavy-Duty Boots. Teammates such as Gliscor, Mega Scizor, and Great Tusk are good choices as a result. Moltres also pairs well with Dragon-types such as Dragonite, Mega Latios, and Kommo-o, which can shore up Moltres's weakness to common Water-types such as Ogerpon-W, Urshifu-R, and Mega Swampert, as well as helping it check Mega Charizard Y, while they appreciate Moltres checking Fairy-types like Iron Valiant. In a similar vein, Moltres benefits from Ground-types such as Great Tusk, Landorus-T, and Ting-Lu, as they can check Rock- and Electric-types such as Mega Tyranitar and Raging Bolt, while Moltres can check Grass-types such as Rillaboom, Serperior, and Kartana in return. Moltres is a good pivot thanks to its ability to take a hit from and force out common Pokemon like Landorus-T, Mega Charizard Y, and Great Tusk, so frail wallbreakers, such as Mega Medicham, Dragapult, and Ogerpon-W, that appreciate getting free switch-in opportunities are good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Dragonite": {"sets": {"Dragon Dance + Z-Move": {}, "Offensive Dragon Dance": {}}},
  "Slowking-Galar": {"sets": {"Defensive Pivot": {}, "Assault Vest": {"description": "<p>224 SpD EVs with a Calm nature lets Slowking-Galar live Mega Charizard Y's Fire Blast twice from full HP.</p>"}}},
  "Scizor": {
    "sets": {
      "Bulky Swords Dance": {
        "description": "<p>Mega Scizor functions as an excellent late-game wincon due to its access to strong priority in Technician boosted Bullet Punch, as well as being an excellent defensive piece, being able to switch in reliably on threats such as Iron Valiant, Kartana, and Rillaboom. Knock Off can be used in order to cripple would-be switch-ins such as Gholdengo, Zapdos, and Moltres. U-turn allows Mega Scizor to pivot out and gain momentum on threats such as Heatran and Mega Charizard Y switching in as well as defensive Pokemon such as Corviknight, Ferrothorn, and Alomomola. Sand Tomb is a more niche option that can be used in order to deal large damage to non-Air Balloon Heatran, as well as trapping Pokemon such as Toxapex switching in. 112 Defense EVs allow Mega Scizor to live 2 Mega Lopunny Close Combats after Stealth Rock and 20 Speed EVs allow Mega Scizor to outspeed uninvested Heatran.</p> <p>Mega Scizor fits well on offense, bulky offense and balance teams due to its defensive capabilities as well as ability to clean up in the later stages of the game with Swords Dance and Bullet Punch. Mega Scizor is extremely vulnerable to Fire-type moves from Pokemon such as Heatran, Volcarona, and Mega Charizard Y, meaning switch-ins such as Heatran, Toxapex, and Alomomola are appreciated. Mega Scizor also struggles to break through Steel-type Pokemon such as Kingambit, Melmetal, and Ferrothorn, making Fighting-types such as Urshifu-R and Zamazenta excellent partners. In return, Fighting-types benefit from Mega Scizor breaking through Fairy-type Pokemon such as Clefable and Iron Valiant. Mega Scizor provides an excellent switch-in to Psychic-types such as Tapu Lele, making teammates that benefit from this such as Great Tusk and Toxapex great partners. Mega Scizor also appreciates Stealth Rock setters such as Landorus-T, as they chip switch-ins such as Heatran and Corviknight, while Mega Scizor can help setters by removing Heavy-Duty Boots from Pokemon such as Moltres and Zapdos, making them vulnerable to Stealth Rock.</p>"
      },
      "Swords Dance + 3 Attacks": {}
    },
    "credits": {"writtenBy": [{"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Heracross": {"sets": {"Wallbreaker": {}}},
  "Skarmory": {"sets": {"Defensive": {}}},
  "Blissey": {"sets": {"Pink Blob": {}}},
  "Tyranitar": {
    "sets": {
      "Offensive Utility": {
        "description": "<p>Mega Tyranitar is a valuable asset for a variety of teams due to the sheer role compression it provides. It can act an entry hazard setter ; an offensive threat with its STAB moves, coverage, and high Attack stat ; and a trapper with its effective usage of Pursuit, allowing it to remove offensive threats such as Dragapult, Choice-locked Tapu Lele, and Gholdengo. Due to its incredible capabilities as an offensive threat, it can check many common special attackers such as Raging Bolt, Mega Charizard Y lacking Focus Blast, and Terapagos while dealing significant damage and threatening them with Pursuit. Even though Stone Edge is very powerful with STAB, other options like Ice Punch for doing significant damage to Landorus-T and Great Tusk while scoring an OHKO on Gliscor and Garchomp as well as Low Kick for hitting Steel-types that would otherwise threaten Mega Tyranitar such as Ferrothorn, Kingambit, and Melmetal can also be run. Stealth Rock is a priority on Mega Tyranitar due to its great bulk and ability to check common entry hazard removal options such as Terapagos, Zapdos, and Tornadus-T lacking Focus Blast. Even though Mega Tyranitar is an exceptional Stealth Rock setter, Low Kick can be run if there is already another Stealth Rock setter on the team. Knock Off has excellent synergy with Stealth Rock, as it can remove items like Heavy-Duty Boots from common users such as Alomomola and Toxapex, making them vulnerable to hazards. 164 Speed EVs allow Mega Tyranitar to outspeed non-Speed invested Landorus-T and maximum Speed invested Jolly Kingambit.</p> <p>Mega Tyranitar fits best on many balance and bulky offense teams that can benefit heavily from its role compression. It can also fit on entry hazard stacking teams, as it can set hazards and use Knock Off to remove foes' Heavy-Duty Boots while also setting sand to deal additional chip damage. Even though Mega Tyranitar has great offensive and defensive stats, its lackluster typing holds it back significantly. It struggles against powerful Fighting-types such as Zamazenta, Mega Lopunny, and Great Tusk along with viable Fairy-types such as Iron Valiant, Tapu Lele, and Mega Mawile. Teammates such as Gholdengo, Clefable, and Zapdos can check most of the Pokemon mentioned above, while Iron Valiant and Melmetal can offensively threaten Tapu Lele and opposing Iron Valiant. Additionally, Future Sight users such as Tapu Lele and Galarian Slowking can form powerful cores with Mega Tyranitar, as they help it in breaking the aforementioned Zamazenta, Great Tusk, and Iron Valiant. In return, Mega Tyranitar can weaken Pokemon that can safely switch into Future Sight such as Kingambit if running Low Kick and Gholdengo. Teammates like Gholdengo and Dragapult can block Rapid Spin from Great Tusk; Gholdengo additionally blocks Defog from physically defensive Corviknight.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652550, "username": "Retereereeeree"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 662575, "username": "boppydop!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Swampert": {
    "sets": {
      "Rain Sweeper": {
        "description": "<p>Mega Swampert is an amazing wallbreaker on rain teams due to its ability to outspeed most offensive threats like Dragapult, Tapu Lele, and Zamazenta with Swift Swim and threaten them with strong attacks that are further boosted by rain. Its Ground typing is also useful for these types of teams, as it gives them a Pokemon that can reliably take on Electric types like Raging Bolt and Tapu Koko. Flip Turn lets Mega Swampert lure in checks to it like Alomomola and Rotom-W and bring in teammates like Raging Bolt and Archaludon that can reliably take on these Pokemon. Stealth Rock takes advantage of the multiple switches that Mega Swampert and its teammates force to rack up chip damage against foes such as Ferrothorn and Mega Venusaur for Mega Swampert eventually being able to break through. Ice Punch hits Pokémon such as Rillaboom, Dragonite and Zapdos, while Superpower deals with Ferrothorn as well as being the best option against Ogerpon-W.</p> <p>Mega Swampert is exclusively found on rain teams. Due to this, Pelipper is a required teammate, and it can get Mega Swampert in with U-turn against foes such as Raging Bolt. Because Mega Swampert struggles breaking through bulky Water-types such as Alomomola and Slowbro and also struggles with Grass types such as Rillaboom and Tangrowth, Pokemon like Zapdos and Tornadus-T are amazing partners, as they can reliably take them out for Mega Swampert. Mega Swampert outside of rain also has a very middling Speed tier, allowing Pokémon like Ogerpon-W and Zamazenta to effectively revenge kill it, and even in rain it is still outsped by options like Booster Energy Iron Valiant, so Pokémon like Raging Bolt and Barraskewda are effective partners to deal with these Pokemon. Raging Bolt in particular, as well as Archaludon, further help Mega Swampert against Grass-types by using them as setup fodder.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 591294, "username": "Lightniong"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}]}]}
  },
  "Pelipper": {"sets": {"Rain Setter": {}}},
  "Shedinja": {"sets": {"Dual Status": {}}},
  "Sableye": {"sets": {"Defensive": {}}},
  "Mawile": {"sets": {"Swords Dance": {}, "All-Out Attacker": {}}},
  "Medicham": {
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Mega Medicham is a destructive wallbreaker that is hugely threatening to several common defensive staples like Ferrothorn, Toxapex, Great Tusk, and Melmetal. Its immense power even allows it to 2HKO bulky neutral targets like Corviknight and Alomomola. Fake Out allows Mega Medicham to pressure faster and more offensive Pokemon like Mega Lopunny, Iron Moth, and Ogerpon-W. This lets Mega Medicham act as a revenge killer if these threats are weakened, and it chips much of the metagame decently. Ice Punch blows past Landorus-T, Gliscor, and Dragonite with ease. Bullet Punch alongside Fake Out improves Mega Medicham's revenge killing capabilities versus offensive teams, and it notably applies significant pressure onto Mega Diancie and Iron Valiant. Fire Punch hits Gholdengo, which is a very common check, and almost always OHKOes Mega Scizor. Fire Punch's targets are very specific, however, which makes it less consistent than Ice Punch and Bullet Punch on a game-to-game basis.</p> <p>Pursuit trapping checks is hugely beneficial to Mega Medicham. Assault Vest Kingambit and Weavile can trap and remove checks such as Gholdengo, Mega Latios, Mega Latias, Dragapult, and Slowbro. Mega Medicham threatens several Pokemon that are irritating for them in return, such as Great Tusk, Alomomola, and Toxapex. Mega Medicham's poor defensive profile makes it hard to switch into battle safely, so it appreciates slow pivots like Alomomola, Galarian Slowking, and defensive Landorus-T that can ease prediction and help it get on the field. A solid defensive backbone is advised when using Mega Medicham, as several very common offensive threats revenge kill it with ease, including Dragapult, Mega Latios, and Ogerpon-W. Teammates like Toxapex, Ferrothorn, Ting-Lu, and Assault Vest Kingambit are very helpful in this regard. Hisuian Samurott is another great teammate that checks threatening Ghost- and Psychic-types like Gholdengo and Mega Latios while also laying down Spikes, and it can use Flip Turn to pivot Mega Medicham into battle. Other forms of entry hazard support, like Spikes from Ferrothorn and Stealth Rock from Great Tusk, Landorus-T, and Ting-Lu, are generally very helpful, as they help wear down checks such as Gholdengo. Fast late-game cleaners like Zamazenta, Dragapult, Iron Valiant, and Cinderace appreciate Mega Medicham blowing up opposing defenses before they come into battle to sweep later on.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 662575, "username": "boppydop!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Torkoal": {"sets": {"Sun Setter": {}}},
  "Salamence": {"sets": {"Dragon Dance + Z-Move": {}}},
  "Latias": {"sets": {"Offensive Utility": {}, "Calm Mind": {}}},
  "Latios": {"sets": {"Wallbreaker": {}}},
  "Lopunny": {"sets": {"Offensive": {}}},
  "Garchomp": {
    "sets": {
      "Offensive Swords Dance": {},
      "TankChomp": {
        "description": "<p>Garchomp leverages its good defensive typing and decent bulk to become a solid tank that checks several prominent Pokemon, including Mega Charizard Y, Heatran, and Volcarona. Toxic allows Garchomp to deal with Mega Charizard Y and bulky Volcarona while also punishing several Pokemon that would otherwise switch in easily, such as Great Tusk, Zamazenta, and Moltres. Protect allows Garchomp to rack up Toxic damage, keep itself as healthy as possible with Leftovers, and scout Choice-locked foes such as Choice Scarf Hisuian Samurott, Choice-locked Tapu Lele, and Choice Specs Dragapult. Garchomp is a solid entry hazard setter, as it can pressure some common hazard removal options, most notably Great Tusk, Terapagos, and Zapdos, with Toxic. Dragon Tail is a good alternative if the team has other hazard setters, as it lets Garchomp rack up hazard damage and temporarily remove foes that might try to set up on it, such as Air Balloon Gholdengo, Swords Dance Gliscor, and Swords Dance Kartana. Leftovers allows Garchomp to stay healthy throughout the game and synergizes well with Protect, while Rough Skin punishes contact moves from the likes of Urshifu-R, Hisuian Samurott, and Great Tusk. The given EV spread allows Garchomp to best check special attackers like Mega Charizard Y and Volcarona, while the Speed EVs allow it to outrun Modest Heatran. 40 Speed EVs with a Jolly Nature let Garchomp outrun Raging Bolt, but the reduction in bulk makes Garchomp noticeably worse against Gholdengo and Heatran, and Garchomp can't safely switch into Raging Bolt anyway.</p> <p>This Garchomp set fits well on offense and bulky offense teams, as it has limited longevity but provides these teams with much needed role compression in checking Mega Charizard Y, Heatran, and Volcarona while also setting up entry hazards. Garchomp does well supporting offensive teammates that dislike these specific threats, such as Gholdengo, Kingambit, and Kartana. Gholdengo is an especially good teammate, as it can deny hazard removal attempts from Terapagos and Zapdos, which is important as Garchomp has limited longevity and will likely not be able to repeatedly set up hazards in longer games. Alomomola is another solid teammate, as it can pivot into threatening physical attackers such as Great Tusk, Mega Lopunny, and Zamazenta that Garchomp cannot reliably handle, due to the frequency with which they run Ice-type coverage. It also can Wish pass to keep Garchomp healthy. Knock Off users such as Kingambit, Kartana, and Mega Scizor can remove Heavy-Duty Boots from the likes of Zapdos, Moltres, and Terapagos, therefore letting Garchomp's hazards make significant progress by themselves. Fast and powerful offensive teammates such as Tapu Koko, Dragapult, and Zamazenta appreciate Garchomp taking a few strong hits from the likes of Mega Charizard Y, Gholdengo, and Heatran, and they can make up for Garchomp's lack of longevity by generating significant offensive pressure. The aforementioned teammates can also help revenge kill certain faster threats that Garchomp dislikes, such as Ogerpon-W, Kartana, and Mega Diancie.</p>"
      },
      "Swords Dance + Loaded Dice": {
        "description": "<p>Garchomp serves as a dangerous cleaner due to Loaded Dice giving the possibility of boosting its Speed and dealing damage at the same time. It is able to leverage its great typing to find setup opportunities against Pokemon like Mega Charizard Y and unboosted Volcarona. Fire Fang gives it great coverage against Mega Scizor, Corviknight and Ferrothorn.</p> <p>Garchomp fits best on bulky offense and hyper offense structures, where its combination of Swords Dance and Scale Shot can quickly overwhelm the opposing team if not taken care of properly. It uses its powerful combination of STAB moves to prey on a lot of bulky Pokemon like Toxapex, Dragonite, and Galarian Slowking, to the benefit of teammates like Volcarona, Raging Bolt, and Iron Valiant. Garchomp's typing leaves it weak to attacks from notable Pokemon like Tapu Lele, Iron Valiant, and Weavile while also not being able to do much against Landorus-T, which can come in very often to drop Garchomp's Attack via Intimidate. Mega Scizor is a great solution to this problem, as it can take hits from the aforementioned Pokemon while being able to consistently force Landorus-T out. Urshifu-R can also be a great teammate for it, as it can lure in Toxapex and Raging Bolt, which then get removed by Garchomp. The Defense drops from Scale Shot leave Garchomp vulnerable to strong priority users like Weavile, Dragonite, and Kingambit. Tapu Lele's Psychic Surge is able to circumvent this issue by making these priority moves unable to hit. In exchange, Garchomp is able to take care of Tapu Lele's counters like Gholdengo and Heatran. Tapu Lele is also able to eliminate Great Tusk, which also presents itself as a threat to Garchomp by being able to shrug off its hits easily and KO it in return with an Ice Spinner.</p>"
      },
      "Mixed Attacker": {}
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 574893, "username": "Dahness"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 662575, "username": "boppydop!"}, {"user_id": 591294, "username": "Lightniong"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Hippowdon": {"sets": {"Defensive": {}}},
  "Weavile": {"sets": {"Choice Band": {}, "Offensive": {}}},
  "Magnezone": {"sets": {"Iron Defense + Body Press": {}}},
  "Tangrowth": {"sets": {"Physically Defensive": {}, "Assault Vest": {}}},
  "Gliscor": {
    "sets": {
      "Utility": {},
      "Swords Dance": {
        "description": "<p>With Swords Dance, Gliscor is able to act as a bulky setup sweeper that can overwhelm defensive teams in mid- to late-game scenarios. This is because of the valuable resistances and immunities its typing affords, its bulk, and Poison Heal, allowing it to set up in front of common Pokemon such as Raging Bolt, Landorus-T, and Heatran. Facade allows Gliscor to hit Pokemon that resist or are immune to Earthquake such as Moltres, Rillaboom, and Zapdos. Alternatively, Knock Off hits Air Balloon Gholdengo, and can remove items from counters such as Dondozo and Corviknight to support its team. Roost allows Gliscor to challenge Pokemon it likes to switch in on such as Zapdos and Gholdengo more effectively. The EV spread uses 112 Speed EVs to outspeed maximum Speed Timid Heatran.</p> <p>Swords Dance Gliscor fits best on bulky offense and balance structures due to its ability to set up on and remove passive Pokemon like Landorus-T, Clefable, and Toxapex, but it struggles against Pokemon with immediate offensive power such as Urshifu-R, Weavile, and Ogerpon-W. Ferrothorn and Toxapex are excellent defensive partners, as they are able to check Pokemon that threaten Gliscor like Ogerpon-W, Urshifu-R, and Weavile, forcing them to switch out. They are also able to set Stealth Rock, Spikes, and Toxic Spikes, which can grant Gliscor opportunities to switch in again due to its good matchup against entry hazard removal options such as Zapdos, Moltres and Landorus-T. Gliscor can struggle with some bulky Water-types like Dondozo and Alomomola, so the likes of Tapu Koko, Ogerpon-W and Raging Bolt are able to pressure these Pokemon. Gliscor also doesn't appreciate the pressence of bulky Grass-types like Ferrothorn and Rillaboom, so Moltres, Heatran, and Raging Bolt having the ability to threaten is appreciated. Powerful offensive options such as Kyurem, Terapagos, and Ogerpon-W can easily deal with Gliscor, so reliable defensive options that can switch in on these offensive threats like Ferrothorn, Gholdengo, and Mega Venusaur are valuable partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 607465, "username": "EatFoods"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Rotom-Wash": {"sets": {"Defensive Pivot": {}, "Nasty Plot": {"description": "<p>108 HP EVs lets Rotom-Wash live a +2 Knock Off from Kingambit.</p>"}, "Choice Scarf": {}}},
  "Heatran": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Heatran’s well-rounded stats, great typing, and unique ability allows it to be one of the best specially defensive Pokemon in the tier, capable of sponging hits from Volcarona, Choice Specs and Hex Dragapult, Tapu Lele, and Tapu Koko. Earth Power hits Fire-resistant foes such as opposing Heatran, Toxapex, and Raging Bolt. Toxic is useful to wear down Pokemon such as Ting-Lu and Alomomola, preventing them from reliably switching in. Heatran also functions as a consistent Stealth Rock user, threatening foes with hazard removal such as Terapagos lacking Earth Power and Tornadus-T. If Stealth Rock is already being used by another teammate, Taunt can be used to shut down defensive Pokemon like Toxapex and Galarian Slowking allowing Heatran to trap them more effectively. Taunt also prevents Substitute Volcarona and Calm Mind Raging Bolt from spiraling out of control. Protect both enables more passive damage from Magma Storm and Toxic to build up and grants Heatran with more healing from Leftovers, as well as allowing Heatran to scout common Choice-users such as Tapu Lele and Iron Valiant. 40 Speed EVs allows Heatran to outspeed Adamant Kingambit and Mega Mawile.</p> <p>Heatran is easily removed by Ground- and Water-type Pokemon such as Landorus-T, Urshifu-R, and Gliscor, meaning teammates that can handle these threats, such as Mega Latios, Zapdos, and Rillaboom, are greatly appreciated. Rillaboom in particular is good since the Grassy Terrain it sets provides Heatran with another source of passive healing, which can greatly assist in Heatran's longevity to check foes like Raging Bolt and Mega Latios for teammates like Toxapex and Great Tusk may dislike. Heatran’s offensive pressure is helpful for wearing down threats like Raging Bolt and Toxapex for teammates like Tapu Koko, Hex Dragapult, and Mega Lopunny. In return, Tapu Koko can handle Water-types like Hisuian Samurott and Alomomola, and Dragapult can check Zamazenta via weakening it with Will-O-Wisp.</p>"
      },
      "Offensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 613028, "username": "Illouri"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 662575, "username": "boppydop!"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Cresselia": {"sets": {"Trick Room Setter": {}}},
  "Manaphy": {"sets": {"Tail Glow + 3 Attacks": {}, "Rain Wallbreaker": {}}},
  "Victini": {"sets": {"Choice Scarf": {}, "Pivot": {}, "Celebrate + Stored Power": {}}},
  "Serperior": {"sets": {"Substitute Attacker": {}, "Glare + 3 Attacks": {}}},
  "Samurott-Hisui": {
    "sets": {
      "Offensive": {
        "description": "<p>Hisuian Samurott is a powerful wallbreaker that provides offensive pressure alongside entry hazard support with a unique typing that allows it to temporarily check Gholdengo and Kingambit when running Sacred Sword. Ceaseless Edge has its Base Power amplified by Sharpness to deal decent damage while passively setting Spikes that can’t be blocked by Taunt or Magic Bounce. Razor Shell is the preferred option for a Water-type STAB move, as the chance to lower Defense can come in handy when breaking through Toxapex and Corviknight, though Aqua Cutter can be considered for its perfect accuracy and non-contact nature. Sucker Punch is a priority move that hits surprisingly hard once boosted, and it can pick up KOs on weakened sweepers like Volcarona and stop revenge killing attempts from the likes of Dragapult. Lastly, Sacred Sword gives Hisuian Samurott the ability to OHKO Kingambit and Mega Tyranitar while immediately dealing significant damage versus Melmetal and Terapagos without Tera Shell intact. Optionally, Swords Dance can boost Hisuian Samurott’s wallbreaking capabilities to impressive thresholds, being able to 2KHO Ferrothorn and nearly OHKO Ogerpon-W with a boosted Sucker Punch, and Encore locks foes into passive moves like recovery moves from the likes of Corviknight and Alomomola and setup moves from sweepers like Iron Valiant. Hisuian Samurott has a few options for an item, with Black Glasses boosting both Dark-type attacks, which offer better roll against more physically defensive variants of Ferrothorn and Toxapex while also boosting Sucker Punch versus Mega Charizard Y and faster Landorus-T. Heavy-Duty Boots and Protective Pads both improve Hisuian Samurott’s longevity by allowing it to switch in with hazards on the field for the former and avoid contact punishment from the likes of Rocky Helmet users, Static Zapdos, and Ferrothorn for the latter.</p> <p>Hisuian Samurott fits best on entry hazard-stacking teams due to its unique ability to set hazards while attacking. While Hisuian Samurott is powerful, its middling Speed and typing leave it vulnerable to a variety of revenge killers like Tapu Koko and Mega Lopunny. Teammates such as Landorus-T and Gholdengo can switch into faster threats such as Zamazenta and Tapu Lele, and the latter is also able to effectively block forms of hazard removal. Partners like Tapu Koko and Great Tusk benefit from Hisuian Samurott being able to weaken their checks like Ferrothorn and Corviknight, with the former being able to threaten Defoggers like Tornadus-T. Hisuian Samurott can work with offensive partners like Iron Valiant, Swords Dance Garchomp, and Mega Scizor, appreciating Spikes chip damage on checks such as Gholdengo, Toxapex, and Alomomola.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Hisuian Samurott is able to utilize Sharpness-boosted attacks paired with a Choice Scarf to effectively act as speed control. Ceaseless Edge supports its teammates with Spikes while being a very low-risk move against a multitude of targets such as Mega Latios. Aqua Cutter can be an alternative option over Razor Shell, as it forgoes power and Defense drops for 100% accuracy and ability to avoid contact. Sacred Sword hits Dark-types, securing the OHKO versus Kingambit and Mega Tyranitar, deals more damage to Steel-types like Melmetal and Ferrothorn, and damages Normal-types like Terapagos and Mega Lopunny, OHKOing the latter. Knock Off can be an option, which aims to remove the items off of checks such as Zapdos and Toxapex. Flip Turn can let Hisuian Samurott pivot out while not committing to a Choice-locked Water-type move, and it additionally breaks Terapagos's Tera Shell and pivots in teammates. It allows Hisuian Samurott to generate momentum by escaping bad matchups like against Zamazenta and Clefable and wearing them down.</p> <p>Wallbreakers such as Mega Diancie and Iron Valiant can make use of the pivoting from Flip Turn to threaten the Fighting- and Dark-types that can switch into Hisuian Samurott. Swords Dance Landorus-T and Z-Move Garchomp pair nicely with Hisuian Samurott, as they can lure and take out entry hazard removal options like Great Tusk and Corviknight while setting Stealth Rock. Furthermore, Hisuian Samurott often has issues with frailty and the inability to beat common hazard removal options, so partners such as Raging Bolt can pressure bulky Water-types that check Hisuian Samurott, such as Alomomola and Toxapex, and hazard removal options, like Tornadus-T and Corviknight, while also being able to switch into Zapdos and Urshifu-R. Gholdengo can block Defog and Rapid Spin while utilizing its great bulk to switch into the Fairy-type and Fighting-type moves directed at Hisuian Samurott and take advantage of Hisuian Samurott's passive checks like Toxapex and Ferrothorn.</p>"
      },
      "Assault Vest": {"description": "<p>176 HP EVs and 72 SpD EVs live a Moonblast from Mega Diancie at full HP. 108 Speed EVs outspeed uninvested Iron Crown.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 662575, "username": "boppydop!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Excadrill": {"sets": {"Swords Dance": {}}},
  "Alomomola": {
    "sets": {
      "Defensive": {
        "description": "<p>Alomomola's massive HP stat allows it to be an effective user of Wish to support its ability to give teammates safe entry through Flip Turn. It can make use of Toxic to wear down opposing Pokemon that switch in on it and Pokemon that try setting up on it such as Terapagos, Ogerpon-W, and Great Tusk. Alomomola also appreciates Protect as a way to ensure it is able to use Wish and regain its own HP safely, scout opposing Pokemon's moves, notably Choice-locked attackers such as Dragapult and Tapu Lele as well as being able to build up Toxic damage on foes like Garchomp and Terapagos. Heavy-Duty Boots are another great tool for Alomomola, allowing it to safely switch into hazards to gain back health safely with Regenerator and use Wish to support teammates. The EV spread and Relaxed nature used allows Alomomola to comfortably sponge up hits from strong Physical attackers such as Kingambit, Urshifu-R, and Great Tusk, while a Sassy nature allows it to have a more comfortable matchup into Mega-Diancie and Terapagos. Alomomola makes use of 8 HP EVs to remain at an odd number HP stat so it can switch into hazards more optimally if it's Heavy-Duty Boots are removed.</p> <p>Slower Pokemon that lack reliable recovery, like Ursaluna, Kingambit, and Melmetal, appreciate Alomomola's ability to bring them in safely and recover their HP with Wish against bulky Pokemon like Ting-Lu and Ferrothorn. Frail Pokemon such Iron Valiant and Dragapult also appreciate Alomomola's ability to safely get them on the field with Flip Turn. Alomomola's vulnerability to Grass- and Electric-type Pokemon like Rillaboom, Tapu Koko, and Kartana make Raging Bolt and Ferrothorn excellent partners due to their ability to easily shrug them off and regain whatever health is lost through Alomomola's ability to safely Wish pass into these Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 607465, "username": "EatFoods"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Ferrothorn": {
    "sets": {
      "Defensive": {
        "description": "<p>Ferrothorn is an excellent defensive Steel-type and entry hazard setter, since its Grass typing lends it resistances to Water and Electric as well as a neutrality to Ground, allowing it to more comfortably handle Pokemon like Ogerpon-W, Mega Swampert, Tapu Koko, and Raging Bolt, which other Steel-types like Mega Scizor and Gholdengo have more trouble against; being a Steel-type also naturally improves its matchup against Melmetal, Tapu Lele, and Rillaboom. Iron Barbs lets Ferrothorn pressure foes like Urshifu-R, Mega Lopunny, Melmetal lacking Protective Pads, and U-turn users like Landorus-T, forcing them to play more carefully lest they rack up chip damage very quickly with contact moves. Leech Seed is Ferrothorn's most reliable recovery, allowing it to pressure other passive Pokemon like Toxapex and Gliscor into wasting their healing moves, deal valuable chip damage to switch-ins that have no means of healing such as Cinderace and Heatran, and gradually recover HP with each use. Knock Off allows Ferrothorn to punish Heavy-Duty Boots users like Zapdos, Toxapex, and Tornadus-T as well as Leftovers users like Landorus-T, which is extremely valuable in forcing progress by making foes more susceptible to hazards or removing their recovery. Body Press allows Ferrothorn to surprise Kingambit and Kyurem, dealing massive damage to both and avoiding getting PP stalled by Kyurem; it also lets Ferrothorn hit Heatran on the switch and damage opposing Ferrothorn instead of idling. Gyro Ball snags Fairy-types like Tapu Lele and Iron Valiant on the switch and 2HKOes Dragapult, preventing it from setting up to +2 with Dragon Dance, although it should be run with a Relaxed nature and 0 Speed IVs. Thunder Wave is niche, providing great value against offense teams, but since it is easily blocked by Gholdengo, it is often undesirable. Spikes is used over Stealth Rock when another setter is present on the team. The Defense EVs allow Ferrothorn to survive Adamant +1 Dragapult's Never-Ending Nightmare. Leftovers is nigh mandatory, providing much more consistent healing than Leech Seed and taking advantage of Ferrothorn's ability to sit on the field for many turns at a time. Rocky Helmet is a viable alternative, punishing U-turn users like Landorus-T and Urshifu-R as well as Rapid Spin from Great Tusk much harder; overall, it rewards risky play compared to Leftovers’s relative safety and should therefore allow Ferrothorn to be used more aggressively.</p> <p>Most wallbreakers pair well with Ferrothorn, taking advantage of the entry hazards it sets to break through defensive targets, but those that switch in on Ferrothorn's counters such as Gholdengo, Zamazenta, and Mega Charizard Y are particularly good; these wallbreakers include Kingambit, Mega Charizard Y, Tapu Lele, and Mega Tyranitar. Kingambit and Mega Tyranitar can Pursuit trap Gholdengo and Dragapult, the latter of which is frustrating due to often carrying Will-O-Wisp. Gholdengo itself is also a good teammate, as it can deny Defog and switch in more easily against Pokemon like Tapu Lele and Iron Valiant. Ferrothorn's defensive utility is also appreciated by teammates like Toxapex and Landorus-T, which struggle with Electric-types like Tapu Koko and Water- and Ice-types like Hisuian Samurott and Kyurem, all of which Ferrothorn helps check. However, Ferrothorn does have a host of issues that require some support to cover. Ferrothorn's glaring Fire weakness is not even its biggest problem, given that having teammates like Toxapex, Heatran, and Alomomola around can easily blank Fire-type moves from the likes of Mega Charizard Y, opposing Heatran, and Dragapult. Its main problem stems from its lack of instant recovery, making it more inclined to offensively oriented teams. Having Leftovers removed by Knock Off from foes like Kingambit, Mega Tyranitar, and opposing Ferrothorn or getting burned by Will-O-Wisp from foes like Dragapult renders it unable to heal without Leech Seed, and Leech Seed fails against Gholdengo and common Grass-types like Ogerpon-W and opposing Ferrothorn. Therefore, Ferrothorn is best played more offensively, using its unique defensive utility, Leech Seed, and Iron Barbs to force switches and hazard chip damage, granting immediate momentum when played aggressively while also not punishing the user for playing more carefully. Teammates that can absorb Knock Off, like Mega Tyranitar, and those that can absorb Will-O-Wisp, like Heatran and Clefable, are incredibly valuable teammates. Finally, Pokemon that can cover Ferrothorn's Fighting weakness are good defensively, including the aforementioned Gholdengo as well as Zapdos, Landorus-T, and Toxapex.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 637479, "username": "red fintans"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 674261, "username": "Flames Of Elixir"}, {"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Volcarona": {
    "sets": {
      "Offensive Quiver Dance": {
        "description": "<p>Quiver Dance Volcarona is a powerful wincon for many teams that are able to remove its few checks. This is thanks to Quiver Dance, which can allow it to outspeed and KO a worn-down team. At base 100 Speed, one Quiver Dance boost allows Volcarona to outspeed fast Pokemon like Mega Lopunny and Tapu Koko while also outspeeding common Choice Scarf Pokemon like Tapu Lele and Urshifu-R, meaning offensive counterplay against a boosted Volcarona is quite limited. Flamethrower is a strong, consistent STAB option; however, Fiery Dance gives Volcarona a chance to gain Special Attack boosts while still dealing respectable damage. Bug Buzz is a reliable move that notably lands the most damage on Mega Tyranitar, Ogerpon-W, and Ting-Lu. Hidden Power Ground can be used to hit common checks like Heatran and Toxapex, as they resist Volcarona’s STAB moves and can threaten it with either Toxic or their STAB moves, with Toxapex being able to beat Volcarona by itself with Haze. Physical priority moves, like Mega Lopunny’s Fake Out and Mega Scizor’s Bullet Punch, are commonly used to bypass Volcarona’s Speed boosts and hinder a sweep, and Flame Body is an opportunity to punish them for it. Heavy-Duty Boots is largely used to ignore the effects of Stealth Rock, as it can instantly deplete half of Volcarona’s health; however, negating the effects of Toxic Spikes and Sticky Web are also beneficial to a Volcarona sweep.</p> <p>Volcarona fits on offensive teams that can wear down or remove specific Pokemon that can prevent its sweep. For example, Pokemon like Moltres, Toxapex, and defensive Garchomp are clear roadblocks to a Volcarona sweep due to their advantageous typing, with the latter two using Toxic to wear Volcarona down. As a result, strong wallbreakers with complementary STABs of Ground or Fairy such as Great Tusk, Landorus-T, and Tapu Lele allow such Pokemon to be removed to facilitate a Volcarona sweep. Volcarona also struggles against priority, namely, Sucker Punch from Kingambit and Hisuian Samurott and Fake Out from Mega Lopunny. Tapu Lele acts a great deterrent to such priority, also shutting off weaker attempts to end Volcarona’s sweep like Urshifu-R's Aqua Jet. Volcarona may have certain matchups where it may struggle to sweep, especially against bulkier teams. However, it can still leverage its potential threat level along with Quiver Dance to remove physical walls, like defensive Great Tusk. This can be taken advantage of by physical sweepers like Dragonite and Dragapult, which both appreciate not needing to spend their Z-Move on it. Entry hazard support from teammates allows Volcarona to muscle through checks like the aforementioned Toxapex as well as offensive checks like Mega Charizard Y and Mega Tyranitar; Pokemon that can do this include Glimmora, Mega Diancie, and Landorus-T. Volcarona’s teammates can also take advantage of Toxapex’s passivity. In particular, sweepers that threaten Toxapex like Mega Latios, Tapu Lele, and Garchomp can force it to switch out, allowing them to grab a free setup turn.</p>"
      },
      "Bulky Quiver Dance": {},
      "Substitute + Swarm": {}
    },
    "credits": {"writtenBy": [{"user_id": 576909, "username": "BananaBro_Chaos"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 591294, "username": "Lightniong"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Tornadus-Therian": {"sets": {"Pivot": {}, "Nasty Plot": {}, "Assault Vest": {}}},
  "Landorus-Therian": {
    "sets": {
      "Defensive": {
        "description": "<p>Boasting an excellent defensive typing alongside solid physical bulk bolstered by Intimidate, Landorus-T is able to act as a blanket check to most physical attackers. Taunt allows it to deny a plethora of common status moves, such as entry hazards from Ferrothorn and Ting-Lu, recovery attempts from Toxapex and Alomomola, Defog from Zapdos and Corviknight, Toxic from Gliscor and Moltres, and setup moves from Zamazenta and Mega Scizor. Toxic is an alternative that more immediately pressures Zapdos and Moltres while also wearing down Regenerator pivots such as Tornadus-T and Alomomola that otherwise shrug off any of Landorus-T's attacks, and punishing setup attempts from the likes of Volcarona and Dragapult. Earth Power is an alternative to the standard Earthquake that deals significantly higher damage to Great Tusk and Zamazenta and also deals full damage in Grassy Terrain. Rocky Helmet is the item of choice, as it punishes weak contact moves, such as Tapu Koko and Moltres' U-turn, that are further weakened by Intimidate. The given EV spread allows Landorus-T to outspeed Great Tusk without a Protosynthesis Speed boost, with a Jolly nature if using Earthquake as the Ground-type attack and Timid if it is Earth Power.</p> <p>Landorus-T's most glaring weakness is its lack of recovery, and thus fits best on more offensive teams that can more effectively take advantage of its limited turns while also appreciating Landorus-T's ability to easily handle Mega Lopunny and Zamazenta, which otherwise threaten most offensive structures. Teammates that can set up entry hazards such as Hisuian Samurott, Ferrothorn, and Toxapex appreciate Landorus-T utilizing Taunt to prevent most Defog users from removing their hazards. Landorus-T's ability to pivot via U-turn is greatly appreciated by frailer Pokemon such as Mega Medicham, Iron Valiant, and Dragapult that otherwise struggle to safely enter the field. Another weakness of Landorus-T is its lackluster special bulk, which can be mitigated by teammates such as Ferrothorn, Toxapex, and Mega Scizor. These teammates also cover Landorus-T's type weaknesses, the former two covering its weakness to Water-type attacks from the likes of Urshifu-R and Ogerpon-W, while the latter two resist Ice-type attacks from foes such as Weavile and Kyurem.</p>"
      },
      "Swords Dance": {
        "description": "<p>Offensive Landorus-T can be a true terror, as this set allows it to break through Pokemon that would normally switch into it, such as Gliscor, Alomomola, and Great Tusk. Swords Dance makes Landorus-T very threatening to slower teams, enabling it to break through Pokemon that would normally check it such as Ferrothorn and Alomomola. Stone Edge lets Landorus-T target foes like Zapdos and Mega Charizard Y. This set has a good matchup against most entry hazard removal options in the tier, so it keeps Stealth Rock up against foes like Corviknight and opposing Landorus-T.This can also dissuade Pokemon like Mega Charizard Y and non-Heavy-Duty Boots Dragonite from coming in on it. Fly targets foes like Great Tusk, Zamazenta, and Rillaboom. When running Fly, Flyinium Z should be used, as it gives Landorus-T the opportunity to OHKO Great Tusk and Zamazenta while also luring in Pokemon like Alomomola for big damage. With Rockium Z, Landorus-T can KO foes like Skarmory and Corviknight with the combination of +2Continental Crush and Stone Edge; otherwise, these two would come in comfortably on Landorus-T.</p> <p>This variant of Landorus-T is usually found on more offensive structures. These teams appreciate Landorus-T's Electric immunity to block Volt Switch and Raging Bolt's Thunderclap. Landorus-T's ability to pressure physical walls like Alomomola can enable teammates like Kingambit and Melmetal. These teammates appreciate Landorus-T being able to pressure their switch-ins such as Great Tusk and Zamazenta with Flyinium Z and Rockium for Corviknight. Landorus-T appreciates Kingambit spamming Knock Off. Iron Valiant appreciates Landorus-T being able to remove its checks, such as Toxapex and Galarian Slowking, so that it can clean up in the late-game. Dragon Dance Dragapult values its checks in Ting-Lu and Ferrothorn being pressured by Landorus-T, especially non-Will-O-Wisp sets. Landorus-T is vulnerable to Water-type Pokemon such as Ogerpon-W and Urshifu-R, so it appreciates Pokemon like Raging Bolt and Dragonite to switch in and force these foes out. Landorus-T can struggle with Ice-types, as they outspeed and OHKO it; therefore,teammates like Ferrothorn and Kingambit are appreciated.</p>"
      },
      "Choice Scarf": {},
      "Lead": {
        "description": "<p>Landorus-T is one of the best suicide leads in the tier, as its huge Attack stat, great defensive typing, and useful utility movepool allow it to consistently set up Stealth Rock and deny the foe from setting it up itself. Taunt stops any Pokemon slower than Landorus-T, including Glimmora, Gliscor, Clefable, and other Landorus-T, from either setting up entry hazards, setting up boosts, or using Defog. Explosion is useful for OHKOing or heavily chunking Pokemon like Great Tusk, Terapagos, Ogerpon-W, and Tornadus-T that could either remove Landorus-T’s hazards or use it as setup fodder; it also provides a free switch-in for a teammate to start applying pressure. Focus Sash allows Landorus-T to take almost any hit, allowing it to set up Stealth Rock or chip foes down with Earthquake or Explosion.</p> <p>Landorus-T is an amazing Pokemon on hyper offense teams, as it can easily set up Stealth Rock and chip down foes for its teammates to start pressuring the opposing team. Pokemon like Dragon Dance Dragapult and Volcarona appreciate Landorus-T chipping their checks with hazard damage while also being able to heavily damage Pokemon like Great Tusk and Clefable with Explosion. Pokemon that can hit Landorus-T multiple times, either through multi-hit moves from Weavile and Urshifu-R or from Fake Out from Mega Lopunny and Mega Medicham, can render it useless, as it can’t set up Stealth Rock in front of these Pokemon. Therefore, teammates like Volcarona, Dragonite, and Mega Scizor are useful to force out these Pokemon before Landorus-T comes in. Pokemon that can easily remove Landorus-T’s hazards like Great Tusk, Tornadus-T, and Gliscor can also be very problematic, so teammates like your own Great Tusk, Air Balloon Gholdengo, and Ogerpon-W can threaten them and consistently deny them chances to remove hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 542295, "username": "Wildfiree"}, {"user_id": 591294, "username": "Lightniong"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 657738, "username": "vaderaven"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Kyurem": {"sets": {"SubRoost": {}, "Offensive": {}, "Choice Specs": {}}},
  "Chesnaught": {"sets": {"Defensive": {}}},
  "Greninja": {"sets": {"Battle Bond": {}}},
  "Hawlucha": {"sets": {"Unburden Sweeper": {"description": "<p>176 Speed EVs outspeed a +1 Dragapult after Unburden activates.</p>"}}},
  "Diancie": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Mega Diancie is a very potent wallbreaker that applies a lot of offensive pressure to bulky offense and balance builds, threatening Pokemon such as Zapdos, Raging Bolt, and Great Tusk. Mega Diancie’s coverage further cements its role as a wallbreaker; for example, Earth Power hits foes such as Heatran, Gholdengo, Melmetal, and Toxapex that would otherwise come in safely on its STAB moves. Mystical Fire provides even more coverage, hitting foes such as Ferrothorn and Mega Scizor. Power Gem avoids the drawback of possibly forcing Mega Diancie to run a nature that decreases Defense or Special Defense, improving its ability to take on Pokemon such as Raging Bolt and Dragapult. Diamond Storm can be used as well with 28 Attack EVs to improve the matchup versus Pokemon such as Galarian Slowking, scoring a 2HKO on it. Mega Diancie does well versus common forms of entry hazard removal such as Terapagos lacking Earth Power, Great Tusk, Zapdos, and Tornadus-T. Mega Diancie is a unique hazard setter that can set up hazards while denying common opposing hazard setters in Heatran and Mega Tyranitar.</p> <p>Mega Diancie fits on bulky offense teams and pairs well with Pokemon such as Great Tusk, Ferrothorn, and Landorus-T that appreciate it due to its ability to threaten and force out Pokemon such as Mega Charizard Y, Volcarona, Zapdos, and Hisuian Samurott with its STAB attacks. In return, Great Tusk and Landorus-T check threats such as Mega Lopunny, Iron Head Kingambit, and Assault Vest Melmetal, which threaten Mega Diancie directly. Landorus-T also brings Mega Diancie in safely with a U-turn against Pokemon that like to come in on it such as Tornadus-T, Mega Charizard Y, and Great Tusk, which Mega Diancie punishes. Mega Diancie tends to struggle with fast offensive Water-types such as Ogerpon-W, Choice Scarf Urshifu-R, and Mega Swampert in the rain. Thus, Pokemon such as Dragonite, Raging Bolt, and Ferrothorn can keep these foes in check.</p>"
      },
      "Lead": {
        "description": "<p>Mega Diancie functions as an amazing hyper offense lead, being able to set up Stealth Rock behind Substitute while also denying opposing entry hazards via Magic Bounce. Mega Diancie's main niche over other hazard setters is its ability to deny hazards from pokemon such as Glimmora and Landorus-T, as well as blocking taunt and encore from Pokemon like Tornadus-T and Iron Valiant, making it harder for them to deny hazards. Endeavor lets Mega Diance heavily chip Moonblast switch-ins like Moltres, Corviknight, and Heatran when at low HP. Staying in base forme is often an option in order to set Stealth Rock on faster Pokemon due to Diance's superior bulk. 244 HP EVs allow Diancie to set Substitute four times as opposed to three, leaving Mega Diancie at 1 HP to use Endeavor with.</p> <p>Being a hyper offense lead, Mega Diancie's main function is to set entry hazards to enable one of the archetype's many sweepers to punch through defensive cores and win the game, often being able to give them free switch ins by wearing itself down via Substitute. Examples of Pokemon that benefit from these hazards include Kingambit, Volcarona, and Great Tusk, since they all appreciate Stealth Rock chipping down Pokemon such as Corviknight, Heatran, and Landorus-T for them to break through more easily. However, lead Mega Diancie can sometimes be threatened by Super-Effective attacks from faster foes, such as Choice Scarf Urshifu-R, as well as by strong priority moves from Pokemon such as Choice Band Rillaboom and Mega Scizor. These can be taken care of by partners such as Dragonite, which can safely switch in on Urshifu-R, Landorus-T, and Rillaboom, and Volcarona, which switches in on and threatens Rillaboom and Mega Scizor with its strong STAB moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 658067, "username": "Ineros"}, {"user_id": 514772, "username": "sealoo"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Hoopa-Unbound": {"sets": {"Choice Band": {}, "Assault Vest": {"description": "<p>252 HP EVs and 56 Special Defense EVs lets Hoopa-U live a Never Ending Nightmare from a boosted Gholdengo at full HP. 64 Attack EVs lets Hoopa-U KO a Kingambit after Stealth Rock with Drain Punch, and 16 Speed EVs lets it outspeed Adamant Kingambit.</p>"}}},
  "Volcanion": {"sets": {"Wallbreaker": {}, "Choice Specs": {}}},
  "Primarina": {"sets": {"Offensive Calm Mind": {}, "Bulky Calm Mind": {}, "Assault Vest": {}}},
  "Ribombee": {"sets": {"Sticky Web": {"description": "<p>192 Defense EVs lets Ribombee live a Surging Strikes from a Urshifu-R at full HP.</p>"}}},
  "Toxapex": {"sets": {"The Pex": {"description": "<p>136 Defense EVs let Toxapex live a +2 Power Whip from Ogerpon-Wellspring from full HP.</p>"}}},
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Kommo-o": {"sets": {"Offensive Z-Move": {}, "Defensive": {"description": "<p>32 Defense EVs with an Impish nature let Kommo-o take Mega Lopunny's Close Combat twice from full HP after Stealth Rock.</p>"}}},
  "Tapu Koko": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Tapu Koko is a very consistent offensive pivot that can fit on a variety of teams, threatening a plethora of Water-and Flying-types such as Toxapex, Slowbro, Tornadus-T, and Zapdos. Tapu Koko also has a remarkable ability to consistently switch into the tier's Electric-types such as Zapdos and Raging Bolt, the aforementioned Flying-types, and Fighting-types such as Zamazenta while also having a Speed tier that outruns many threats such as Ogerpon-W and Tornadus-T. Hidden Power Ice enables Tapu Koko to hit foes such as Landorus-T, Gliscor, and Garchomp while also doing significant damage to Great Tusk. Dazzling Gleam can be used to hit foes such as Raging Bolt and Great Tusk much harder than Hidden Power Ice, though it is significantly weaker against Gliscor and Landorus-T. U-turn allows Tapu Koko to pivot out of Pokemon that handle it defensively such as Galarian Slowking and Ting-Lu while also wearing them down. Volt Switch can be used to avoid chip from contact while dealing decent damage, though it is able to be blocked by Ground-type Pokemon such a Great Tusk and Landorus-T. Electrium Z is used to give Tapu Koko a one-time boost to its already strong Thunderbolt and help it pick off weakened threats such as Melmetal and Heatran and OHKO Pokemon such as Ogerpon-W and Mega Diancie. Fairium Z can be used as an alternative to immediately OHKO foes such as Great Tusk and Raging Bolt.</p> <p>Pokemon such as Iron Valiant and Hawlucha appreciate Tapu Koko’s Electric Surge setting Electric Terrain and activating their abilities. The former also appreciates Tapu Koko beating defensive Pokemon such as Toxapex and Tornadus-T. Landorus-T also likes Tapu Koko as a partner, as it likes its Flying-type checks such as Tornadus-T, Zapdos, and Corviknight being answered by Tapu Koko. In return, Landorus-T brings it in with a U-turn on Pokemon such as Tornadus-T and it immediately threatens Pokemon such as Galarian Slowking, which walls Tapu Koko. Tapu Koko struggles to break through specially bulky Pokemon such as Ferrothorn, Galarian Slowking and Ting-Lu, so it appreciates powerful physical wallbreakers such as Mega Medicham, Urshifu-R as well as Pursuit support from Kingambit and Mega Tyranitar. In return, Tapu Koko is able to easily pivot them in with U-turn on these aforementioned checks in addition to checking the Flying-type Pokemon that they struggle with.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Tapu Koko makes use of its fast Speed and explosive power to act as a great early-game wallbreaker, dealing out large damage even against neutral targets like Tapu Lele, Gholdengo, and Zapdos. Tapu Koko's Speed allows it to outspeed Pokemon already considered fast, such as Ogerpon-W, Mega Diancie, and Mega Charizard Y. As Tapu Koko breaks down walls like Alomomola and Slowbro, Pokemon like Hawlucha can use that opportunity to clean up easily late-game. Either Volt Switch or U-turn allows Tapu Koko to exert pressure while providing pivoting for the team, with the former being a respectable offensive move itself, while the latter is undeterred by Ground-types such as Garchomp. Hidden Power Ice allows Tapu Koko to do massive damage to Ground-types such as Landorus-T and Great Tusk, notably OHKOing Landorus-T.</p> <p>Tapu Koko fits best on offensive teams, as its Speed, wallbreaking power, and pivoting options are most appreciated by its offensively minded teammates. Due to Tapu Koko's Electric Terrain and its wallbreaking prowess, Quark Drive Pokemon are the clearest beneficiaries, especially those that seek to sweep late-game like Swords Dance Iron Valiant and Iron Moth. Other sweepers also synergize with Tapu Koko, largely since it puts major pressure on some of their checks. For example, Hawlucha appreciates the removal of Slowbro, Moltres, and Toxapex, while Dragonite appreciates the removal of Corviknight and Moltres. Tapu Koko's STAB moves can be walled by several Pokemon, such as Clodsire, Ferrothorn, and Iron Treads. As a result, it appreciates help from the likes of Mega Medicham, Weavile, and Great Tusk. Mega Medicham especially makes for a fierce wallbreaking duo with Tapu Koko, with the former able to dismantle Galarian Slowking and Ferrothorn, two Pokemon that can easily wall Tapu Koko. In return, Tapu Koko can pressure Pokemon that Mega Medicham may struggle to hit, notably Gholdengo and Slowbro.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Tapu Koko serves as a potent special attacker and wincon, thanks to Terrain-boosted Thunderbolt and its great Speed stat, allowing it to outspeed common foes that are considered fast, such as Mega Diancie and Ogerpon-W. Using its Calm Mind boosts, Tapu Koko deals a great amount of damage to neutral targets, such as Ogerpon-W, Gholdengo, and Tapu Lele. Tapu Koko can even OHKO Electric-resistant and -immune threats, such as Raging Bolt and Gliscor after Stealth Rock chip using Twinkle Tackle boosted by Fairium-Z, after one Calm Mind boost. Calm Mind boosts make Tapu Koko capable of setting up in front of foes like Clefable and Raging Bolt. Roost offers reliable recovery, increasing Tapu Koko's longevity by shrugging off attacks from foes like Raging Bolt and healing off entry hazard damage.</p> <p>Calm Mind Tapu Koko fits well on balance teams that appreciate its ability to both revenge kill fast threats like Ogerpon-W and act as a wincon late-game. Pokemon like Urshifu-R and Volcarona benefit from Tapu Koko's ability to pressure bulky Water- and Flying-type foes, such as Toxapex and Moltres; Urshifu-R appreciates the removal of Toxapex and Alomomola while Volcarona appreciates the removal of Moltres and Toxapex. In return, Volcarona and Urshifu-R deal with troublesome walls like Ferrothorn and Ting Lu. Entry hazards like Stealth Rock and Spikes synergize incredibly with Tapu Koko, as they help it secure KOs more reliably and clean up late-game, wearing down checks like Heatran and Ferrothorn. Therefore, entry hazard setters like Ferrothorn, Ting-Lu, and Gliscor are solid partners. Ferrothorn is a notable hazard-setting partner, as it is also able to switch in on troublesome foes for Tapu Koko, such as Melmetal and Ting Lu. There are several Pokemon that can take on Tapu Koko's STAB combination even after Calm Mind boosts, such as Galarian Slowking and Heatran. As a result, Tapu Koko appreciates teammates that threaten these Pokemon, such as Great Tusk and Mega Medicham. Tapu Koko is vulnerable to Ground-types, such as Choice Scarf Landorus-T and Iron Treads, especially because the latter can also take hits from Tapu Koko; therefore, defensive checks like Alomomola and Zapdos are great partners due to their ability to switch in on these Ground-types.</p>"
      },
      "Dual Screens": {
        "description": "<p>Tapu Koko's high Speed allows it to act as a good dual screens lead for hyper offense structures. U-turn gives Tapu Koko a source of momentum for and way to pivot into its teammates, notably being able to pivot against Ground-types such as Landorus-T and Great Tusk that Tapu Koko struggles with. Taunt allows Tapu Koko to deny opposing setup from foes, whether it be entry hazards like Spikes from Ferrothorn or boosting moves like Quiver Dance from Volcarona; this is essential so that Tapu Koko is not completely passive as it sets up, which is especially important to make sure its teammates are not overwhelmed by hazards or boosted threats afterwards.</p> <p>Because of its ability to set Electric Terrain as it sets up dual screens, Quark Drive Pokemon such as Iron Valiant, Iron Moth, and Iron Crown make for fantastic partners, which are able to utilize Tapu Koko's dual screens to set up more comfortably. Iron Moth in particular is able to threaten Corviknight from removing screens via Defog and check Gholdengo, which sets up on Tapu Koko thanks to Good as Gold ignoring Taunt. Similarly, Hawlucha makes for a fantastic teammate, since it is able to reliably set up on the Ground-types that Tapu Koko doesn't like, such as Landorus-T and Iron Treads, while having Taunt to prevent Defog attempts from Zapdos and Tornadus-T; in return, Tapu Koko's Electric Terrain triggers Unburden for Hawlucha through Electric Seed to outspeed threats like Mega Swampert in rain, boosted Iron Valiant, and boosted Dragapult, letting the two handle opposing offense teams more comfortably. Typical offensive threats such as Garchomp, Gholdengo, and Dragapult all appreciate dual screens support for their setup, with the former also being able to set up Stealth Rock to soften up walls while Gholdengo helps maintain dual screens by blocking Defog from Tornadus-T and Corviknight. Terapagos is a strong partner too, being able to remove hazards that Tapu Koko cannot deny safely, such as from Landorus-T, Great Tusk, and Gliscor, while it and Kingambit also check Dragon Dance Dragapult, which is able to outspeed, set up on, and possibly remove Tapu Koko, especially with Infiltrator ignoring dual screens .</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 564420, "username": "Lialiabeast"}, {"user_id": 576909, "username": "BananaBro_Chaos"}, {"user_id": 604820, "username": "Sami"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 658067, "username": "Ineros"}, {"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 493260, "username": "Marnie"}, {"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Tapu Lele": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Tapu Lele functions as a great speed control option while still retaining its devastating STAB combination and good wallbreaking power. Its STAB moves threaten a myriad of foes such as Zamazenta, Great Tusk, and unboosted Dragapult that would otherwise outspeed Tapu Lele, while Focus Blast nails Steel-types like Melmetal, Ferrothorn, and Kingambit. Hidden Power Fire allows Tapu Lele to hit Mega Scizor and Gholdengo super effectively, while Psyshock lets Tapu Lele break through specially defensive walls, 2HKOing Galarian Slowking as an example. Future Sight allows Tapu Lele to set up its teammates that otherwise struggle with Poison-types and physical walls, like Zamazenta or Mega Lopunny, to pose an even larger threat considering their best checks like Toxapex and Alomomola are reticent to switch in lest they get blasted.</p> <p>Tapu Lele fits well on balance teams looking for a way to solve their speed control problems while retaining good power. Fighting-types like the aforementioned pair as well as Urshifu-R make natural partners for Tapu Lele, as both break one another's checks; the Fighting-types break through troublesome Steel-types like Ferrothorn and specially defensive Heatran so that Tapu Lele does not have to risk Focus Blast's accuracy woes while Tapu Lele scares out Poison-types like Toxapex to let the trio of Fighting-types break through. Said Fighting-types also help wonders against Pursuit trappers such as Mega Tyranitar and Kingambit attempting to trap and remove Tapu Lele. Mega Tyranitar is another great partner for Tapu Lele, as it removes a pair of Tapu Lele's biggest checks in Gholdengo and Galarian Slowking thanks to Pursuit while dealing major damage to specially defensive stopgaps such as Heatran. Hazard setters like Gliscor and Ferrothorn also pair well with Tapu Lele, as they weaken Tapu Lele's checks like offensive Gholdengo and Ferrothorn into range of being KOed by one of Tapu Lele's STAB options or Hidden Power Fire, lessening its burden of prediction.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Tapu Lele functions as a potent wallbreaker, being able to muscle through common defensive cores with its STAB move combination and coverage. Moonblast and Psychic largely cover each other's weaknesses, making it difficult for defensive pieces such as Ting-Lu and Toxapex to switch in. Psyshock hits Pokemon with high Special Defense, such as Blissey and Galarian Slowking. Focus Blast targets Steel-types such as Kingambit, Heatran, and Melmetal, while Hidden Power Fire threatens Mega Scizor, Gholdengo, and Ferrothorn more reliably. Focus Blast is generally preferred to avoid getting fully walled by Heatran, which can otherwise switch in reliably.</p> <p>Fighting-types such as Urshifu-R and Zamazenta appreciate Tapu Lele's ability to punch through checks such as Toxapex and Mega Venusaur. In return, both teammates break through Steel-types, and Urshifu-R beats Moltres, enabling Tapu Lele to use its STAB moves more freely they also beat Pursuit trappers that can sometimes be problematic for Tapu Lele. Tapu Lele also appreciates Pursuit users such as Mega Tyranitar and Kingambit trapping Ghost-types such as Dragapult. Tapu Lele often finds itself vulnerable to faster threats such as Dragapult, meaning fast teammates such as Choice Scarf Hisuian Samurott are appreciated. Tapu Lele also appreciates Spikes setters such as Ting-Lu and Ferrothorn, with Ting-Lu providing a good switch-in to both Gholdengo and Dragapult, which Tapu Lele struggles with. Tapu Lele values Spikes, as it chips common checks such as Heatran, allowing Tapu Lele to clean up games more easily. In general, setup sweepers benefit from Psychic Terrain support, notably including Dragonite, Dragon Dance Dragapult, and Volcarona, as it gives them an immunity to powerful priority moves from Pokemon such as Kingambit and Mega Lopunny. Tapu Lele also breaks Pokemon such as Ting-Lu for these teammates.</p>"
      },
      "Offensive Z-Move": {
        "description": "<p>Tapu Lele is a fearsome wallbreaker, attributing its success to its Psychic Terrain-boosted attacks, ability to threaten metagame staples such as Gliscor, Toxapex, Raging Bolt, and Great Tusk, and lack of prediction mandated by a Choice item. Focus Blast allows Tapu Lele to hit the Steel-types that would plague it, such as Melmetal, Kingambit, Ferrothorn, and Heatran. Psyshock is an option over Psychic to hit Pokemon like Volcarona, Galarian Slowking, and Blissey; however, Psychic is usually preferred due to its higher damage against targets like Moltres and Gliscor. Hidden Power Fire and Future Sight are other options over Calm Mind; the former is a consistent way of hitting Ferrothorn, Mega Scizor, and Gholdengo, whereas the latter pairs well with wallbreakers like Zamazenta and Ogerpon-W while also being Tapu Lele’s strongest form of Shattered Psyche. With Fightinium Z, Tapu Lele OHKOes Melmetal lacking Assault Vest and Assault Vest Kingambit while also having a favorable roll to OHKO Ferrothorn after Stealth Rock. Psychium Z gives Tapu Lele a burst of power that guarantees the OHKO on Pokemon like Clefable, Tornadus-T, and Gliscor.</p> <p>Tapu Lele is a good option on offense and bulky offense teams that appreciate it punching holes in fat and balance teams, which have limited ways of pivoting around it. Pokemon like Kingambit, Zamazenta, and Ogerpon-W like Tapu Lele breaking through their checks such as Toxapex, Raging Bolt, and Great Tusk. These Pokemon also appreciate the potential Future Sight support Tapu Lele can give. Tapu Lele likes Pursuit from Weavile, Mega Tyranitar, and Kingambit, as they help remove checks such as Gholdengo, Iron Crown, and Assault Vest Tornadus-T. Tapu Lele has a middling Speed tier that allows threats like Dragapult, Ogerpon-W, and Mega Charizard Y to easily outpace and revenge kill it. Therefore, teammates like Garchomp, Ferrothorn, and Kingambit are appreciated. However, it should be noted that Psychic Terrain blocks Kingambit’s Sucker Punch.</p>"
      },
      "Assault Vest": {}
    },
    "credits": {"writtenBy": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 632421, "username": "Medasus"}, {"user_id": 658067, "username": "Ineros"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 471780, "username": "Solaros & Lunaris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 589016, "username": "Danbear02"}, {"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Tapu Bulu": {"sets": {"Offensive Z-Move": {}, "Defensive": {"description": "<p>220 HP EVs maximize Grassy Terrain recovery, and 92 Defense EVs let Tapu Bulu take Return from Mega Lopunny twice at full HP.</p>"}}},
  "Tapu Fini": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Buzzwole": {"sets": {"Physical Wall": {}}},
  "Celesteela": {"sets": {"Defensive": {"description": "<p>16 Defense EVs with a Relaxed Nature lets Celesteela live Mega Lopunny's Combat from full.</p>"}}},
  "Kartana": {"sets": {"Paper Cut": {}, "Paper Plane": {}, "Paper Fan": {}}},
  "Blacephalon": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Melmetal": {
    "sets": {
      "Toxic + Protect": {
        "description": "<p>The combination of Toxic and Protect allows Melmetal to force chip damage onto foes by inflicting them with debilitating status while keeping itself healthy. This makes Melmetal hard to wear down over the course of a game. Earthquake smacks many Toxic-immune Steel-resistant Pokemon, such as Heatran, Toxapex, and Gholdengo. Protect lets Melmetal force even more Toxic damage onto foes, therefore allowing it to consistently chip them down. It also allows Melmetal to scout for dangerous coverage moves, such as Fighting-type coverage from Tapu Lele and Gholdengo and Fire-type coverage from Zapdos, as well as ease prediction against common Choice item users like Landorus-T, Zamazenta, and Tapu Lele. Leftovers combined with Protect makes it quite hard to wear down Melmetal over time. The given EV spread allows Melmetal to take a +2 Supreme Overlord-boosted Knock Off from Kingambit at full health, OHKO Dragapult with Double Iron Bash, and outspeed Toxapex.</p> <p>Melmetal fits well onto balance and bulky offense teams. These teams appreciate Melmetal's bulk allowing them to stave off threats such as Tapu Lele, Terapagos, and Tornadus-T while forcing progress against defensive cores consisting of common Pokemon such as Alomomola, Zapdos, Moltres, and Landorus-T. Melmetal struggles to pressure certain Steel-types, most notably Ferrothorn and Skarmory, and it is forced out by other common Pokemon like Heatran, Gliscor, and Air Balloon Gholdengo. Fire-types like Mega Charizard Y, Volcarona, and Iron Moth are choices that can pressure Ferrothorn, Skarmory, and Gholdengo, while Ground- and Fighting-types like Landorus-T and Iron Valiant threaten Heatran. Late-game cleaners, such as Iron Valiant, Dragapult, Kingambit, and Zamazenta, appreciate Melmetal chipping down standard defensive cores consisting of Pokemon such as Ting-Lu, Zapdos, and Alomomola, therefore giving them an easier time cleaning up late-game. Swords Dance Iron Valiant is notable for its ability to break through Gliscor, another obstacle in Melmetal's goal to make progress. Alomomola is another great partner, using Wish to keep Melmetal healthy while checking several foes that are problematic for it, such as Landorus-T, Urshifu-R, and Great Tusk. Other specially bulky partners such as Toxapex, Ting-Lu, and specially defensive Garchomp can shore up Melmetal's rather mediocre special bulk while also checking Mega Charizard Y, Volcarona, and Heatran.</p>"
      },
      "Assault Vest": {
        "description": "<p>Melmetal gains impressive mixed bulk when equipped with an Assault Vest, allowing it to check threats such as Tapu Lele, Choice Specs Dragapult, Mega Diancie, and Terapagos while dishing out significant damage in return. Ice Punch slams Landorus-T, Garchomp, and Gliscor on the switch. It is also Melmetal's best way to hit Zapdos, but it needs to be careful due to the risk of getting paralyzed by Static. Thunder Punch hits Alomomola, Moltres, and Slowbro, although Flame Body from Moltres makes pressuring it this way risky; it is also the best way to pressure Toxapex if not running Earthquake. Earthquke allows Melmetal to hit Heatran, Kingambit, and Gholdengo hard. Superpower can be used instead in order to threaten Ferrothorn and Kartana while still hitting Heatran and Kingambit, but the stat drops are detrimental, and Melmetal loses its best way to hit Gholdengo. The given EV spread gives Melmetal enough bulk to take two Focus Blasts from Tapu Lele and enough speed to outrun Toxapex.</p> <p>Assault Vest Melmetal works best on bulky offense and offense teams, as they appreciate its combination of bulk and wallbreaking power while being able to work around its limited longevity. Melmetal's lack of recovery leaves it very vulnerable to chip damage, especially from Spikes. Entry hazard removal from the likes of Landorus-T, Great Tusk, and Terapagos is therefore very important. Great Tusk is notable, as it appreciates Melmetal checking dangerous Psychic- and Grass-types, like Tapu Lele and Ogerpon-W, and it can use Ice Spinner to threaten dangerous Ground-types like Landorus-T and Gliscor. Alomomola is another notable partner, as it can get Melmetal into battle safely with Flip Turn while also passing it Wishes to keep it healthy. Alomomola also helps to check Fire-types like Heatran and Ground-types like Landorus-T and Great Tusk. Fast, frail offensive threats like Dragapult, Iron Valiant, and Urshifu-R love Melmetal taking hits from revenge killers like Choice Scarf Tapu Lele, Raging Bolt, and Kingambit while also breaking down the opposing team with its powerful attacks, therefore letting them clean up later.</p>"
      },
      "Thunder Wave": {
        "description": "<p>Melmetal's ability to reliably spread Thunder Wave while remaining quite dangerous offensively makes it a great support Pokemon. It can also become deadly in mid- to late-game scenarios thanks to its tendency to paraflinch its way through otherwise decent checks like Toxapex, Ferrothorn, and Slowbro with Double Iron Bash. Thunder Wave allows Melmetal to spread paralysis onto potential switch-ins such as Mega Charizard Y and Volcarona. Thunder Punch pressures Alomomola, Toxapex, and Moltres. Superpower is the preferred coverage move, as it hits threats like Ferrothorn, Kingambit, Heatran, and Kartana hard. Earthquake can be considered instead, however, as it hits Gholdengo while also hitting Heatran harder than Superpower. Protective Pads prevents Melmetal from being threatened by contact-punishing traits like Rocky Helmet on Landorus-T and Alomomola, Iron Barbs on Ferrothorn, Static on Zapdos, and Flame Body on Moltres and Volcarona. Punching Glove should be used instead if running Earthquake, as it prevents Double Iron Bash and Thunder Punch from making contact while slightly boosting their power. 92 Speed EVs allow Melmetal to outrun a paralyzed Heatran and Ting-Lu.</p> <p>Melmetal fits on team styles ranging from offense to balance thanks to its unique blend of support combined with strong offensive pressure. Thunder Wave Melmetal does well with teammates centered around benefitting from paralysis. Strong, slow wallbreakers like Mega Medicham, Ursaluna, and Mega Tyranitar love having fast threats slowed down. They can form a deadly double wallbreaking core with Melmetal, which remains dangerous in its own right and can check revenge killers such as Kartana, Ogerpon-W, and Tapu Lele. Hex Dragapult and Gholdengo are also great partners, as they can unleash a fully powered up Hex onto paralyzed foes; Dragapult in particular can assist by getting Melmetal in safely with U-turn, while Gholdengo can help check threatening Fighting-types like Mega Medicham and Iron Valiant. Teammates that deal with threatening Ground-types such as Landorus-T, Great Tusk, and Gliscor are also good to have, as Melmetal cannot paralyze them and is forced out by them. Water- and Grass-types, such as Ogerpon-W, Urshifu-R, and Rillaboom, can threaten them offensively, while defensive checks like Zapdos and Alomomola work as well.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rillaboom": {"sets": {"Choice Band": {}, "Bulky Swords Dance": {}, "Swords Dance": {}}},
  "Cinderace": {"sets": {"Pivot": {}, "Setup Sweeper": {}}},
  "Corviknight": {"sets": {"Physically Defensive": {}, "Bulk Up + Substitute": {}}},
  "Barraskewda": {"sets": {"Rain Wallbreaker": {}}},
  "Hatterene": {"sets": {"Calm Mind": {}, "Healing Wish": {}}},
  "Grimmsnarl": {"sets": {"Dual Screens": {}}},
  "Dragapult": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Dragapult functions as a good wallbreaker and anti-offense tool thanks to its combination of a blistering Speed stat, fairly reliable STAB moves in Draco Meteor and Shadow Ball, pivoting thanks to U-turn, and coverage to deal with some of its checks. U-turn allows Dragapult to chip down its few checks in Dark-types like Mega Tyranitar attempting to Pursuit trap it and Ting-Lu attempting to set up entry hazards. Flamethrower punishes pesky Steel-types like Melmetal, Ferrothorn, and Kingambit trying to check Dragapult, while Hydro Pump lets Dragapult deal significantly more damage to its other major checks in Mega Tyranitar, Ting-Lu, and specially defensive Heatran.</p> <p>Fighting-types like Zamazenta and Swords Dance Iron Valiant are great teammates for Dragapult, as they easily take on the Dark-types that plague Dragapult while appreciating its ability to break through physical walls like Corviknight and Gliscor in exchange. Steel- and Fire-types like Mega Scizor and Volcarona also fit well alongside Dragapult, as they offer a key resistance to Fairy-type moves from the likes of Choice Scarf Tapu Lele and Booster Energy Iron Valiant aiming to revenge kill Dragapult. Entry hazards set by the likes of Gliscor, Ferrothorn, and Hisuian Samurott also help Dragapult wallbreak, as they bring its checks like Ting-Lu, Mega Tyranitar, and Kingambit into range of being KOed by a Hydro Pump or Flamethrower, respectively. Great Tusk provides a great entry hazard control option thanks to Rapid Spin, allowing Dragapult to come in more frequently to throw off its attacks while appreciating Dragapult bringing it in on Dark-types thanks to U-turn.</p>"
      },
      "Offensive Pivot": {
        "description": "<p>Dragapult leverages its excellent Speed, serviceable offenses, and a good defensive profile to become a premier offensive pivot, outspeeding Pokemon such as Zamazenta and Tapu Koko. Hex takes advantage of Dragapult's ease of spreading status to allow it to 2HKO foes such as Zapdos and Tornadus-T and also exploits Gliscor's Poison Heal. Will-O-Wisp hinders physical attackers and neutralizes Leftovers recovery from the likes of Ting-Lu, Zamazenta, and Ferrothorn while also punishing Pursuit attempts from foes such as Kingambit and Mega Tyranitar, potentially even allowing Dragapult to win the interaction. Thunder Wave allows Dragapult to spread status against Fire-type Pokemon such as Volcarona, Moltres, and Heatran, though it loses out on Will-O-Wisp's chip damage and damage reduction. Dragon Darts hits foes such as Ting-Lu when running Thunder Wave or Volcarona when running Will-O-Wisp, as Dragapult is unable to status them, and they can comfortably switch into unboosted Hex. Draco Meteorgives Dragapult a significant boost to its immediate power due to its higher Base Power, eliminating the need to invest into both offensive stats, which is highlighted further when paired with Dragonium Z, OHKOing foes such as Hisuian Samurott and Raging Bolt while also KOing defensive Landorus-T after Stealth Rock damage. Heavy-Duty Boots is the default choice for Dragapult, as it allows it to pivot unhindered by entry hazards. The first EV spread should be used if using Dragon Darts and allows Dragapult to 2HKO Hisuian Samurott, while the second EV spread should only be used alongside Draco Meteor. Clear Body allows Dragapult to ignore Landorus-T's Intimidate and Sticky Web's Speed drop if not holding Heavy-Duty Boots, though Infiltrator is better against Aurora Veil and dual screens hyper offense teams, and it ignores Iron Defense Zamazenta's Substitute.</p> <p>Dragapult appreciates other teammates that can spread status, such as Thunder Wave Gholdengo, Toxapex, Moltres, and Zapdos. These hinder answers such as Ting-Lu, Hisuian Samurott, and Heatran while also allowing Dragapult to more easily boost its Hex. Dragapult appreciates Spikes support from the likes of Hisuian Samurott and Ferrothorn to help its unimpressive offensive profile, capitalizes on its ability to force many switches thanks to the threat of Will-O-Wisp, and quickly wears down common answers such as Kingambit and Mega Tyranitar. Dragapult also appreciates Knock Off support from the likes of Ferrothorn, Kingambit, and Mega Scizor to remove Heavy-Duty Boots from foes such as Moltres and Tapu Koko. Dragapult struggles against Pursuit users such as Kingambit and Mega Tyranitar, so Pokemon that check them such as Great Tusk and Zamazenta are powerful teammates. Dragapult can burn physical attackers such as Melmetal and Landorus-T to provide easier setup opportunities for teammates such as Ogerpon-W and Garchomp.</p>"
      },
      "Dragon Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 571069, "username": "Dead by Daylight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 662575, "username": "boppydop!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Zamazenta": {
    "sets": {
      "All-Out Attacker": {
        "description": "<p>All-out attacking Zamazenta is a fearsome wallbreaker thanks to its great base Attack stat alongside colorful coverage, allowing it to hit a large portion of the metagame for tons of damage. Its defensive profile also allows it to stick around as a check to Dark-types like Kingambit and Hisuian Samurott. Crunch complements Close Combat well, 2HKOing Ghost- and Psychic-types like offensive Gholdengo, Dragapult, and Galarian Slowking that easily take Close Combat. Stone Edge snipes Moltres and Zapdos attempting to inflict a Flame Body burn or a Static paralysis onto Zamazenta while taking on two offensive checks in the form of Volcarona and Mega Charizard Y. Ice Fang allows Zamazenta to majorly damage Gliscor and Landorus-T, while Heavy Slam lets Zamazenta deal with troubling Fairy-types trying to use it as a way to enter the field such as Tapu Lele and Iron Valiant. Heavy-Duty Boots give Zamazenta more chances to throw off its powerful attacks.</p> <p>Zamazenta fits well on balance and offensive teams alike, threatening and being able to come in on metagame staples like Kingambit, Hisuian Samurott, and Mega Tyranitar. Physically defensive walls such as Great Tusk and Toxapex can shrug off hits from Zamazenta all day long, so a partner that threatens them such as Tapu Lele is a nice addition to let Zamazenta force progress. Additionally, Tapu Lele can set Future Sight, preventing these checks from switching in as easily. In return, Zamazenta smashes Steel-types that can parry Tapu Lele's attacks like Assault Vest Melmetal. Zamazenta greatly appreciates entry hazard setters such as Hisuian Samurott and Landorus-T that force answers like Toxapex and opposing Landorus-T to take damage every time they attempt to check Zamazenta. It also appreciates Hisuian Samurott scaring the aforementioned Ghost- and Psychic-types away from Zamazenta as well as Landorus-T threatening Poison-types like the aforementioned Toxapex. Kingambit traps and removes Dragapult and Galarian Slowking for Zamazenta as well as removing items like Leftovers or Heavy-Duty Boots from shared checks like Corviknight or physically defensive Toxapex to make Zamazenta's life easier. Finally, Steel-types like Gholdengo and Heatran form a great core with Zamazenta, as they are able to beat down Zamazenta's walls like Galarian Slowking and defensive Gholdengo while taking on threatening Fairy-types like Choice Scarf Tapu Lele and Iron Valiant, protecting Zamazenta from being revenge killed as easily.</p>"
      },
      "Iron Defense + Body Press": {
        "description": "<p>With a nearly unmatched Speed tier and superb bulk further boosted by Dauntless Shield, Zamazenta doubles as both setup weeper and an offensive check to a plethora of dangerous physical attackers, such as Kingambit, Ogerpon-W and Garchomp. Zamazenta can exploit these threats with Iron Defense, simultaneously making it more difficult to revenge kill and boosting the power of Body Press. Crunch targets Gholdengo and Dragapult, which are immune to Body Press, while Stone Edge hits Volcarona, Moltres, and Zapdos while avoiding Flame Body and Static from them. With Substitute, Zamazenta can avoid status moves from passive Pokemon such as Alomomola and Gliscor while also providing a buffer to frail revenge killers such as Iron Valiant. Alternatively, Zamazenta can use Roar to force out Pokemon that attempt to boost alongside it, such as Skarmory, Corviknight, and opposing Zamazenta. Roar also provides a means of making progress into defensive teams Zamazenta generally struggles against when paired with Spikes setters such as Ting-Lu, Ferrothorn, and Gliscor. Rest, with Chesto Berry, provides instant recovery and lets Zamazenta beat checks reliant on status moves such as the aforementioned Alomomola and Gliscor; it also gives Zamazenta another chance to sweep if it had already been afflicted with status eariler in the game, such as through Flame Body from Volcarona. However, this comes with the opportunity cost of losing coverage or utility while making Zamazenta much more vulnerable to Knock Off from the likes of Kingambit and Mega Tyranitar, threats Zamazenta is often tasked with switching into. Finally, with Attack investment, Zamazenta can run Heavy Slam to more immediately threaten Fairy types such as Clefable and particularly Iron Valiant as well as Tapu Lele. Specifically, 200 Atk enables Zamazenta to OHKO Tapu Lele, 2HKO Clefable after Leftovers, and OHKO Iron Valiant after one layer of Spikes. However, other options are generally more useful in most matchups. 132 Atk / 124 Def / 252 Spe guarantees a 2HKO on Offensive Gholdengo with Crunch and an OHKO on Specially Defensive Moltres with Stone Edge, while 252 HP / 4 Def / 252 Spe maximises its mixed bulk. A spread of 4 Atk / 252 Def / 252 Spe can also be run to maximise Body Press damage on resisted targets such as Landorus-T, though this makes Zamazenta more easily revenge killed by special attackers such as Iron Valiant.</p> <p>Zamazenta's fantastic anti-offense capabilities in its Speed tier and defensive utility enable it to fit on offense and balance teams alike. Zamazenta generally has weaker matchups against balance and defensive teams, which often carry multiple checks and counters such as Toxapex, Gholdengo, and Clefable, sometimes leaving it nearly incapable of making progress on its own. For these reasons, powerful wallbreakers such as Kingambit, Garchomp, Ogerpon-Wellspring, and Raging Bolt are necessary to account for these poor matchups, also benefitting from Zamazenta's capacity to switch into their offensive checks such as Mega Lopunny and Weavile. Pursuit support from Kingambit, Mega Tyranitar, Weavile is highly recommended, especially when dropping Crunch, in order to trap the Psychic- and Ghost-types that may otherwise check or counter Zamazenta such as Slowbro, Gholdengo, and Dragapult. Moreover, despite Zamazenta's solid mixed bulk, it can still be forced out by special attackers such as Raging Bolt, Tapu Lele, Iron Valiant, and Dragapult. As a result, specially defensive Pokemon such as Assault Vest Melmetal, Ting-Lu, and Moltres are great partners, complementing Zamazenta's ability to blanket check most physical attackers. Kingambit is arguably Zamazenta's best partner, enjoying Zamazenta's incredible speed and ability to switch into its checks, such as Great Tusk and Mega Lopunny, while using its highly complementary offensive and defensive profile to check and trap threats to Zamazenta such as Dragapult, Choice-locked Tapu Lele, and Gholdengo not carrying Focus Blast. Kingambit's Knock Off also removes Rocky Helmet from Landorus-T and Heavy Duty-Boots from the likes of Zapdos and Moltres, weakening Zamazenta's checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 573467, "username": "Moisture99"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Urshifu-R is a good late-game cleaner and revenge killer due to its ability to threaten defensive Pokemon like Heatran, Gliscor, Great Tusk, Landorus-T, and Ferrothorn with its powerful STAB moves. It also sports a great Speed stat, allowing it to outspeed the majority of the unboosted metagame, including Mega Lopunny, Dragapult, and Zamazenta. Surging Strikes's guaranteed critical hit chance means Urshifu-R ignores the Attack drop from Landorus-T's Intimidate and the Defense boost from Zamazenta's Dauntless Shield. U-turn helps Urshifu-R to keep up momentum throughout the course of a game and also take advantage of defensive switch-ins like Toxapex and Alomomola for its teammates to set up on. Aqua Jet allows Urshifu-R to pick up KOs on Pokemon that are at low HP but outspeed it, like Speed Booster Energy Iron Valiant and Unburden Hawlucha. Ice Spinner is a great tool in assuring high damage on important targets like Dragonite and Dragapult.</p> <p>Urshifu-R is a great choice on more balance-oriented teams as the speed control option, and it loves the company of teammates like Landorus-T, which helps Urshifu-R by setting up Stealth Rock and forming a good pivoting core with it. Mega Diancie is great at helping Urshifu-R deal with bulky Dragon-types like Dragonite and Kyurem, and it can take a Choice Specs Moonblast from Iron Valiant and KO it back; it can also set up entry hazards. While Landorus-T only has the option of setting up Stealth Rock, Gliscor can choose to be a Spikes setter helping to cut into the health of the bulky Water-types that wall Urshifu-R even further. Urshifu-R has the ability to break a lot of Steel-types, most notably Ferrothorn, so it can pave the way for Steel-weak Pokemon like Tapu Lele; in return, Tapu Lele is able to help Urshifu-R with most Dragon-types, most notably Dragonite, which it struggles to hit if it is not running Ice Spinner. One of the biggest Urshifu-R checks is Iron Valiant, which can take all of its attacks and KO it back with Moonblast. Mega Scizor can safely switch into Iron Valiant's moves and threaten high damage with Bullet Punch. Urshifu-R's powerful Close Combat neutralizes Dark-types such as Kingambit and Mega Tyranitar, which paves the way for teammates like Mega Latios and Mega Latias. Their strong special STAB moves are also a boon for Urshifu-R, as they can take advantage of bulky Water-types like Alomomola and Toxapex, which otherwise wall it. Electric-types like Raging Bolt and Tapu Koko are also great in this regard, with Urshifu-R being able to help with Ground-types like Iron Treads and Gliscor in return. Urshifu-R is heavily hindered by abilities and items that punish it for making contact, most notably Static from Zapdos and Flame Body from Moltres, as they are able to switch into Urshifu-R's Close Combat and U-turn and punish it via status conditions. Dragapult also is as a big Urshifu-R deterrent, as it can tank both of its STAB moves and hit back hard with Draco Meteor or ruin it with Will-O-Wisp. Thus, Urshifu-R appreciates the presence of Pokemon like Mega Tyranitar and Kingambit, as they can Pursuit trap Dragapult, with Mega Tyranitar also being able to safely get rid of Zapdos and Moltres.</p>"
      },
      "Swords Dance": {},
      "Choice Band": {
        "description": "<p>Choice Band Urshifu-R acts as a formidable wallbreaker, boasting a high Attack stat, an excellent offensive typing, and a great combination of coverage moves to break through weakened teams. Thanks its typing, Urshifu-R can effectively break down defensive Pokemon like Ting-Lu, Garganacl, and Ferrothorn. Urshifu-R generates momentum with U-turn, pivoting out of unfavorable matchups like Toxapex while dealing considerable chip damage to foes like Ogerpon-W and Rillaboom. Aqua Jet revenge kills weakened faster threats like Volcarona, Iron Moth, Tapu Koko, and Iron Valiant. Alternatively, Urshifu-R can use Ice Spinner to threaten Pokemon, which resist both its STAB moves, like Dragonite and Mega Latias, while Thunder Punch targets bulky Water-types, such as Toxapex and Alomomola.</p> <p>Urshifu-R's wallbreaking ability and pivoting are appreciated by offensive and balanced teams. Iron Valiant and Tapu Lele form a great offensive core with Urshifu-R, as they benefit from Urshifu-R's ability to remove their checks like Ferrothorn and Moltres. In return, Iron Valiant and Tapu Lele can deal with troublesome foes like Raging Bolt. Volcarona appreciates Urshifu-R's ability to deal with the likes of Heatran and Ting-Lu while easily pivoting into Grass-types such as Rillaboom. Pokemon like Tapu Koko and Dragapult form a solid pivoting core, bringing each other in on their checks. Urshifu-R comes in against foes like Ferrothorn and Melmetal while Tapu Koko and Dragapult come in against walls like Toxapex and Tangrowth. Entry hazard setters, such as Landorus-T and Ferrothorn, are great partners for Urshifu-R, as it benefits from Stealth Rock and Spikes wearing down switch-ins like Ogerpon-W late-game. Ferrothorn also switches into Tapu Koko and Iron Valiant, which would revenge kill Urshifu-R with ease.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 564420, "username": "Lialiabeast"}, {"user_id": 574893, "username": "Dahness"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 589016, "username": "Danbear02"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 594972, "username": "Murphy Lawden"}]}]}
  },
  "Ursaluna": {"sets": {"Swords Dance": {}}},
  "Enamorus": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Meowscarada": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Skeledirge": {"sets": {"Defensive": {"description": "<p>132 Defense EVs let Skeledirge live Zen Headbutt from Mega Medicham twice at full HP.</p>"}}},
  "Garganacl": {"sets": {"Stealth Rock": {}}},
  "Ceruledge": {"sets": {"Swords Dance": {}}},
  "Tinkaton": {"sets": {"Utility": {}}},
  "Glimmora": {"sets": {"Lead": {}, "Meteor Beam": {}}},
  "Dondozo": {"sets": {"Wall": {}}},
  "Clodsire": {"sets": {"Defensive": {}}},
  "Kingambit": {
    "sets": {
      "Swords Dance": {},
      "Offensive Utility": {
        "description": "<p>Leveraging its great natural bulk alongside significant defensive investment and an item to further boost its longevity, Kingambit is able to act as a powerful defensive tool against Pokemon such as Gholdengo, Dragapult, and Terapagos while remaining a threatening late-game cleaner. Knock Off is Kingambit's main STAB option, boasting a high Base Power and a powerful secondary effect, particularly against Heavy-Duty Boots users such as Zapdos and Moltres and Rocky Helmet users such as Alomomola and Landorus-T. Pursuit allows Kingambit to forcibly remove most Dragapult and Gholdengo setswhile also heavily limiting most dedicated special walls, such as Blissey, Clodsire, and Galarian Slowking, and guaranteeing that Terapagos' Tera Shell is broken. Sucker Punch allows Kingambit to bypass its middling Speed stat, deterring fast and offensive Pokemon that would otherwise be problematic for Kingambit, such as offensive Volcarona, Mega Charizard Y, Focus Blast variants of Gholdengo, and Mega Medicham, while also allowing it to pick off weakened foes such as Garchomp and Ogerpon-W. Low Kick is used mainly to hit opposing Kingambit while also hitting Ting-Lu and Ferrothorn and OHKOing Mega Tyranitar. Iron Head is an alternative option, allowing Kingambit to immediately threaten Iron Valiant, Tapu Koko, and Clefable while also quickly wearing down Great Tusk and all-out attacker Zamazenta. Leftovers is the premier item for Kingambit, allowing it to stick around for longer games, though the added bulk from Assault Vest is useful for trapping Tapu Lele, Terapagos, Gholdengo, and Choice Specs variants of Dragapult, giving it a good chance to live a Focus Blast from uninvested Gholdengo. Most Kingambit should use Supreme Overlord for its excellent and consistent effect, though Defiant is a viable alternative to specifically punish Landorus-T, KOing it with Knock Off into Sucker Punch, both at +1 Attack, and also punish Defog attempts from the likes of Zapdos and Corviknight. The first EV spread allows Kingambit to outspeed Clefable without Speed investment. The alternative EV spread allows Assault Vest Kingambit to survive an unboosted Focus Blast from Tapu Lele.</p> <p>Pokemon such as Ogerpon-W and Volcarona appreciate Kingambit's ability to efficiently deal with Dragapult, while others such as Mega Medicham and Tapu Lele benefit from Gholdengo's absence. Iron Defense variants of Zamazenta and Mega Medicham particularly benefit from Kingambit's ability to deal with the aforementioned Ghost-types, as they are difficult for them to break while also being able to cripple them with status effects. Access to Knock Off allows Kingambit to remove Heavy-Duty Boots from foes such as Alomomola, Zapdos, and Moltres for the benefit of hazard setting teammates such as Toxapex, Ferrothorn, and Mega Diancie. Kingambit struggles against faster Pokemon such as Zamazenta, Great Tusk, Landorus-T, and Kartana. Partners such as Zapdos and Moltres can aid Kingambit by answering multiple of these Pokemon at once. Bulkier Pokemon such as Melmetal, Ting-Lu, and Toxapex are able to consistently answer Kingambit defensively, so Dragapult, Ogerpon-W, and Raging Bolt are greatly appreciated for their ability to immediately threaten these Pokemon. It is worth noting that a significant majority of the Kingambit checks mentioned are susceptible to losing their item to Knock Off.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 526618, "username": "omarsgarciav"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 674261, "username": "Flames Of Elixir"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Great Tusk": {
    "sets": {
      "Offensive Utility": {},
      "Defensive": {
        "description": "<p>Defensive Great Tusk acts as important glue on teams due to its incredible role compression by acting as a defensive wall, setting entry hazards, and clearing them. Utilizing its high bulk and HP, defensive Great Tusk acts as a great check to many metagame staples such as all-out attacker Zamazenta, Kingambit, Mega Lopunny, and Mega Tyranitar. Earthquake is the preferred STAB move on Great Tusk, but Headlong Rush can also be run for better damage rolls, such as an OHKO on offensive Gholdengo and a 2HKO on Kartana, at the cost of lowering its defenses. Moreover, Headlong Rush isn't weakened by Grassy Terrain. Ice Spinner is used mainly to threaten Landorus-T, Gliscor, and Dragonite while also hitting Zapdos and opposing Great Tusk super effectively. Great Tusk can freely remove hazards, since spinblockers like Dragapult and Gholdengo are threatened by moves such as Ice Spinner and Earthquake, respectively, and Knock Off. The last slot on this set is flexible ; runnning Stealth Rock turns Great Tusk into an effective hazard setter, threatening most hazard removal options such as Landorus-T and opposing Great Tusk with Ice Spinner. Knock Off can also be run to remove key items, like Heavy-Duty Boots from the likes of Zapdos, Tornadus-T, and Moltres as well as Leftovers from Landorus-T and opposing Great Tusk, with the added benefit of being able to hit Air Balloon Gholdengo and Dragapult super effectively. Body Press is an option in the final slot to surprise Ferrothorn, Ting-Lu, and Terapagos that has had its Tera Shell broken. 40 Speed EVs allow defensive Great Tusk to outspeed base 90s like Moltres as well as other prominent threats such as uninvested Landorus-T and bulky Gholdengo. Heavy-Duty Boots prevents Great Tusk from taking too much chip damage from hazards, while Leftovers helps in checking the threats and increases Great Tusk's longevity. Rocky Helmet is another item that can be run on Great Tusk to punish many physical attackers that either attack it recklessly or try to gain momentum like Landorus-T, Zamazenta, and Kingambit.</p> <p>Defensive Great Tusk fits best on balance and bulky offense teams, which value its role compression. The main attributes hindering Great Tusk are its typing and lack of longevity. Thus, Great Tusk appreciates partners like Alomomola, which helps with its lack of longevity by Wish passing; additionally, Alomomola is able to switch into common Water-types like Hisuian Samurott and Urshifu-R. It also appreciates Pokemon such as Volt Switch Raging Bolt and Zapdos that can reliably switch in against common Flying-types such as Zapdos, Tornadus-T, and Mega Charizard Y and Water-types like Ogerpon-W while also threatening them offensively. Steel-type partners like Mega Scizor and Melmetal are greatly valued due to their ability to switch into fast Fairy-type foes like Tapu Lele. Moreover, the hazards set up by Great Tusk pressure many switch-ins on entry, forcing progress over time. Being able to remove the items on checks to Raging Bolt like Leftovers from Ting-Lu and Assault Vest from Melmetal allows Raging Bolt to break through switch-ins with its STAB moves aided by Great Tusk's hazards. Furthermore, these teammates appreciate Great Tusk's ablilty to spin away hazards for them and can continue to check threats to Great Tusk . Defensive Great Tusk also pairs extremely well with Mega Charizard Y, which appreciates Great Tusk removing Stealth Rock and checking Pokemon such as Mega Tyranitar. In return, Mega Charizard Y is able to break through walls like Alomomola, Clefable, Skarmory, and Corviknight. Mega Charizard Y also sets up sun, granting Great Tusk a Defense boost due to Protosynthesis, which allows it to better wall physical attackers.</p>"
      },
      "Bulk Up": {
        "description": "<p>Great Tusk's already great Attack and physical bulk combined with Bulk Up make it a premier setup sweeper that can use its bulk to set up with ease on Pokemon like Dragonite, Garchomp, and Mega Scizor. Ice Spinner takes care of most Pokemon immune to Headlong Rush like Landorus-T, Zapdos, Mega Latios, and Gliscor, among others, while also dealing with Grass-types like Rillaboom and Meowscarada. Rapid Spin is an amazing utility move for Great Tusk, as the extra boosts to Great Tusk's Speed help it avoid revenge killing attempts from Speed Booster Energy Iron Valiant and Choice Scarf Tapu Lele and let it boost Speed after its Booster Energy is used up. Rapid Spin also removes entry hazards for Great Tusk's teammates to clean up after it. The EV spread guarantees Great Tusk gains a Speed boost from its Booster Energy, allowing it to threaten Pokemon it would normally be threatened by, like Mega Diancie, Dragapult, and Mega Medicham.</p> <p>Bulk Up sets are most commonly used on hyper offense teams that appreciate another setup sweeper that can threaten common Pokemon like Landorus-T, Kingambit, and Raging Bolt for its teammates to cleave through. These teams also appreciate Great Tusk's ability to remove entry hazards, which is extremely helpful for Pokemon like Mega Charizard Y and Z-Move Dragonite. Great Tusk is easily revenge killed by Pokemon like mixed Iron Valiant and Choice Scarf users like Tapu Lele and Urshifu-R even with the Speed boost. Therefore, Pokemon that can switch into these Pokemon such as Mega Scizor for Tapu Lele and Kartana and Dragonite for Urshifu-R are appreciated. Great Tusk is weak to special attackers like the aforementioned Iron Valiant, Tapu Lele, Terapagos, and Volcarona, so Pokemon like Kingambit, Raging Bolt, Roaring Moon and your own Terapagos can be useful. Great Tusk also thuds into Pokemon that can take both of its moves, like Ogerpon-W, Moltres, Slowbro, and Alomomola, so Pokemon like your own Ogerpon-W, Raging Bolt, and Gholdengo are great partners that can chip down these Pokemon for Great Tusk to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 591294, "username": "Lightniong"}, {"user_id": 674261, "username": "Flames Of Elixir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 604820, "username": "Sami"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 589016, "username": "Danbear02"}]}]}
  },
  "Iron Treads": {"sets": {"Lead": {}, "Specially Defensive": {}, "Offensive Utility": {}}},
  "Iron Hands": {"sets": {"Swords Dance": {}}},
  "Iron Moth": {"sets": {"Booster Energy": {}, "Offensive Pivot": {}}},
  "Gholdengo": {
    "sets": {
      "Nasty Plot": {},
      "Bulky Nasty Plot": {
        "description": "<p>Bulky Nasty Plot Gholdengo functions as a great defensive piece thanks to its amazing typing, access to reliable recovery, and its near-complete shutdown of entry hazard removal methods, as well as being a reliable offensive threat. Nasty Plot allows Gholdengo to take advantage of the foes it forces out, like Corviknight, Zamazenta lacking Crunch, and Toxapex, to enable it to break apart bulkier special walls such as Assault Vest Melmetal. Focus Blast nails otherwise-impassable Dark- and Normal-types like Ting-Lu, Hisuian Samurott, Kingambit, and Ursaluna, preventing them from either setting up entry hazards or Pursuit trapping it. It also destroys Steel-types like specially defensive Heatran and Ferrothorn after a boost. Recover allows Gholdengo to stay healthy in the face of weak attacks from foes like Toxapex, Ferrothorn, and Alomomola, letting it get more setup opportunities without fearing being chipped down. It also allows Gholdengo to check threatening Fighting-, Fairy-, and Psychic-types like Zamazenta, Tapu Lele, and Galarian Slowking throughout the game. The given EV spread allows Gholdengo to take a Choice Specs Dragapult's Shadow Ball from full health as well as outspeed defensive Landorus-T. Ghostium Z and Fightinium Z give Gholdengo one-time options to remove most foes in its path: Ghostium Z blasts specially defensive Toxapex and Assault Vest Tornadus-T, denying them the ability to utilize Regenerator to check Gholdengo's teammates later in the game, while Fightinium Z allows for Gholdengo to beat back its otherwise-solid answers in Ting-Lu and Blissey while ignoring Focus Blast's accuracy woes. Leftovers lets Gholdengo conserve Recover PP against the likes of Toxapex, while Air Balloon lets Gholdengo stuff Gliscor, gain setup opportunities against Landorus-T, and block Rapid Spin from Great Tusk to keep hazards on the field.</p> <p>Gholdengo's great typing, which lets it deal with troublesome Fighting-, Fairy- and Psychic-types like the aforementioned Zamazenta and Tapu Lele, as well as its amazing offensive power after a boost and its ability to block hazard removal attempts, lets it find a home on balance teams. Gholdengo greatly appreciates teammates like Zamazenta and Iron Valiant, as they are able to ward off the dangerous Dark-types like Kingambit and Hisuian Samurott that take advantage of Gholdengo. In return, Gholdengo threatens the Poison-types like Toxapex that wall them to setup and wreak havoc, as well as checking threatening Psychic- and Fairy-types like Choice Scarf Tapu Lele. Hazard setters like Gliscor and Hisuian Samurott are great partners as well due to Gholdengo's near-complete dominance over most hazard control options. Both also offer unique defensive pairings with Gholdengo; Gliscor deals with Ground-types like Ting-Lu and Landorus-T by putting them on a timer with Toxic, while Hisuian Samurott takes on Fire-types like Heatran. Hazard removal options for Gholdengo like Moltres and Great Tusk allow Gholdengo to check the threats it needs to, like all-out attacking Zamazenta and Choice Specs Iron Valiant, without dealing with Spikes damage. Another good defensive partner for Gholdengo is Heatran, as it is able to put Volcarona and Moltres on a timer with Toxic while setting up Stealth Rock to chip down Gholdengo's checks like Hisuian Samurott over time.</p>"
      },
      "Thunder Wave + Hex": {
        "description": "<p>Gholdengo is a premier defensive piece due to its incredible ability and typing, which helps it check threats like Tapu Lele, Mega Medicham, and Zamazenta while also being immune to Great Tusk and Terapagos’s Rapid Spin and Defog from Tornadus-T and Zapdos. Focus Blast allows Gholdengo to hit would-be checks in Kingambit, Mega Tyranitar, and Terapagos without Tera Shell. Thunder Wave allows Gholdengo to slow down Pokemon such as Terapagos, Ogerpon-W, and Heatran. Hex is boosted to new heights because of Thunder Wave, and it severely damages Gliscor. Ghostium Z allows Gholdengo to greatly harm Pokemon that are unable to be paralyzed by Thunder Wave such as Raging Bolt, Zapdos, Great Tusk, and Landorus-T. Leftovers allows Gholdengo to have an easier time switching in against Pokemon like Tapu Lele and Iron Valiant repeatedly. Fightinium Z helps Gholdengo secure OHKOs on Assault Vest Kingambit, Mega Tyranitar, and Terapagos without Tera Shell while also being more reliable to hit with than Focus Blast. Air Balloon allows Gholdengo to be completely immune to Ground-type attacks from the likes of Gliscor and Great Tusk and block Rapid Spin from Great Tusk more effectively. The given EVs allow Gholdengo to outspeed uninvested Landorus-T and Jolly Kingambit while avoiding the OHKO from Choice Specs Dragapult.</p> <p>Gholdengo fits on various playstyles where its paralysis support and incredible defensive utility are valued. Teammates that set up entry hazards like Hisuian Samurott and Ting-Lu are perfect partners for Gholdengo because of it being an effective blocker of hazard removal from Terapagos and Great Tusk, especially if it is holding Air Balloon. Wallbreakers such as Mega Medicham and Ogerpon-W benefit from Gholdengo checking revenge killers like Tornadus-T, Choice Scarf Tapu Lele, and Zamazenta while also slowing down these faster threats with Thunder Wave. Gholdengo is unable to consistently break through Pokemon like Ting-Lu and Volcarona and is passive against Zapdos and Raging Bolt if it is unable to use a Z-Move. It is also easily outpaced by threats like Dragapult, Mega Lopunny, and Mega Charizard Y, limiting its ability to stay on the field safely. Teammates like Dragonite, Mega Tyranitar, and Zamazenta are great partners to help work around these issues. Iron Valiant is also a great partner for Gholdengo, as it appreciates Gholdengo paralyzing faster revenge killers like Tapu Lele and Tornadus-T, and in return, it takes care of Pokemon like Hisuian Samurott and Kingambit for Gholdengo.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 658067, "username": "Ineros"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 662575, "username": "boppydop!"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 674261, "username": "Flames Of Elixir"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Ting-Lu": {
    "sets": {
      "Defensive Hazard Setter": {
        "description": "<p>Ting-Lu's enormous HP combined with Vessel of Ruin makes it a fantastic defensive anchor against Pokemon such as Gholdengo, Volcarona, and Raging Bolt. This makes Ting-Lu a strong entry hazard setter as well, since many hazard removal options such as Terapagos and Moltres can't dissuade Ting-Lu from setting up hazards on them due to its bulk. To ensure it isn't completely passive against Flying-types, Ruination is necessary, which combined with hazard support allows Ting-Lu to force recovery from defensive Pokemon like Corviknight and Mega Latias. Spikes can be used instead of Stealth Rock if the team already has a Stealth Rock setter. Spikes also does better long-term damage if all three layers are set, especially to Pokemon that don't run Heavy-Duty Boots such as Gholdengo, Ferrothorn, and Mega Venusaur. Whirlwind is needed to ensure Ting-Lu isn't setup fodder against threats that don't mind taking Ruination such as Volcarona and Swords Dance Gliscor while also helping wear down opposing teams with Ting-Lu's hazards. Finally, Leftovers provides Ting-Lu with passive recovery, healing off weak attacks such as Tornadus-T's U-turn and Dragapult's Shadow Ball while also allowing it to survive attacks it otherwise wouldn't, such as avoiding the 2HKO from Choice Specs Tapu Koko's Dazzling Gleam.</p> <p>A major downside of Ting-Lu is its complete lack of recovery options, making Alomomola a fantastic partner that can also pivot into Water-types such as Urshifu-R and Barraskewda while healing Ting-Lu up with Wish. In return, Ting-Lu makes up for Alomomola's passivity against Gholdengo and Raging Bolt with its defensive profile combined with Whirlwind, wearing them down rapidly. Alomomola also handles Great Tusk for Ting-Lu, which would otherwise threaten Ting-Lu while removing its hazards easily. Another excellent defensive partner is Mega Venusaur, which is able to come in against the Water-, Fighting-, and Grass-types that threaten out Ting-Lu such as Kartana and Iron Valiant while appreciating Ting-Lu's hazard support to wear down opposing teams faster with its wide coverage. On offensive teams where they may not mind Ting-Lu's lack of longevity, Zamazenta, Iron Valiant, and Dragapult all appreciate the chip damage Ting-Lu provides with hazards wearing down defensive switch-ins such as Landorus-T, Mega Venusaur, and Kingambit. Gholdengo in particular is also able to block Defog attempts from Tornadus-T and Corviknight and Rapid Spin from Great Tusk especially if it is holding Air Balloon. Partners like Weavile and Ogerpon-W are also notable, since they can use Knock Off to remove Heavy-Duty Boots from targets like Alomomola and Toxapex, making them much easier to wear down in the long run.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604820, "username": "Sami"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Iron Valiant": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs supplements Iron Valiant's power and offensive coverage, turning it into a powerful wallbreaker capable of blasting its way through bulky Pokemon such as Landorus-T, Gliscor, and Melmetal with ease. Thunderbolt provides a strong coverage option that allows Iron Valiant to 2HKO potential checks such as Toxapex, Mega Charizard Y, and Moltres, which otherwise wall its STAB combination. Alternatively, Vacuum Wave allows Iron Valiant to pick off weakened threats such as Mega Lopunny, Kingambit, or a boosted Terapagos in a pinch, whereas Trick allows Iron Valiant to cripple switch-ins such as Toxapex, Galarian Slowking, and Moltres without the need for prediction. Lastly, Shadow Ball ensures Iron Valiant can 2HKO defensive Gholdengo and Galarian Slowking after slight chip damage.</p> <p>Choice Specs Iron Valiant is a strong and versatile offensive option that fits on a variety of offense and balance teams alike. In particular, Iron Valiant benefits immensely from the support of Pursuit users such as Kingambit and Mega Tyranitar, which can help remove or forcibly weaken the few dedicated checks to it in Galarian Slowking and Assault Vest Tornadus-T, making it far more offensively threatening as a result. Similarly, entry hazard support from the likes of Landorus-T, Ting-Lu, and Ferrothorn is appreciated to ensure Iron Valiant can secure KOes against certain Pokemon such as Ogerpon-W, Mega Scizor, and Tapu Lele. Offensive teammates that work well with Iron Valiant include Dragapult, Gholdengo, and Tapu Koko; each of them appreciates Iron Valiant's ability to break open soft checks such as Heatran and Ting-Lu, and in return, they can play around potential revenge killers such as Zamazenta or assist in weakening defensive pieces such as Zapdos and Toxapex. Most notably, Tapu Koko also sets up Electric Terrain to activate Iron Valiant's Quark Drive, granting it a valuable Speed boost that allows it to outpace naturally faster targets such as Dragapult, opposing Tapu Koko, and Choice Scarf Urshifu-R.</p>"
      },
      "Mixed": {
        "description": "<p>Flexing not only its speed but also its versatility, mixed Iron Valiant excels as a cleaner, leveraging its wide movepool and powerful STAB combination to blast through weakened teams. Moonblast threatens many prominent targets, such as Dragapult, Raging Bolt, and Zamazenta. Close Combat complements Moonblast nicely, damaging Steel-types such as Kingambit, Heatran, and Ferrothorn. Knock Off targets those that resist Iron Valiant's STAB moves, hitting key foes like crippling Moltres by removing its Heavy-Duty Boots. Encore discourages setup attempts from foes such as Volcarona and Dragonite, as well as punishing utility and recovery moves from defensive staples like Gliscor, Moltres, and Landorus-T. Alternatively, Destiny Bond allows Iron Valiant to force a trade even in a disadvantageous matchup, like against Volcarona or Gholdengo. Finally, Thunderbolt can threaten otherwise solid checks in Moltres, Toxapex, and Mega Charizard Y. 108 Attack EVs allow Iron Valiant to OHKO specially defensive Heatran after Stealth Rock. Booster Energy is preferred to ensure Iron Valiant can excel in its role as a cleaner, outspeeding all unboosted threats as well as all the relevant Choice Scarf users like Urshifu-R and Tapu Lele. Life Orb is a viable alternative if Iron Valiant is paired with Tapu Koko, ensuring 2HKOs on defensive Landorus-T with Moonblast as well as Alomomola and Toxapex with Thunderbolt while also securing an OHKO on SubRoost Kyurem with Close Combat and a chance to OHKO All-Out Attacker Zamazenta and Ferrothorn.</p> <p>Due to mixed Iron Valiant's dazzling array of skills, it fits best on offensive teams that appreciate its ability to clean up weakened teams as well as force trades against threats like Mega Charizard Y and Gholdengo for its teammates to exploit. Kingambit is a superb partner, as it greatly appreciates Iron Valiant blasting the Fighting-types that Kingambit struggles with, like Zamazenta and Great Tusk, while Kingambit can trap threats like Galarian Slowking and Gholdengo with Pursuit for Iron Valiant. Landorus-T and Great Tusk are also strong teammates, setting Stealth Rock to chip down potential switch-ins like Toxapex or Moltres, especially if Iron Valiant can remove its Heavy-Duty Boots, as well as directly threatening Iron Valiant checks like Toxapex and Galarian Slowking. In return, Iron Valiant can beat Urshifu-R, Weavile, and Kyurem. If Iron Valiant is running Life Orb, Tapu Koko is an essential pick, providing the Electric Terrain required to boost Iron Valiant's Speed, as well as threatening Moltres and Toxapex and boosting Iron Valiant's own Thunderbolt. Tapu Koko also provides easier entry for Iron Valiant through its speedy Volt Switch or U-turn. While powerful, Iron Valiant can struggle to break through healthy teams, especially against previously mentioned checks like Galarian Slowking and Toxapex, so offensive threats like Volcarona, Hisuian Samurott, and Tapu Lele are appreciated for their ability to wear down said checks for Iron Valiant to clean up. Iron Valiant is also threatened by some forms of priority like Bullet Punch from Mega Scizor and Mega Medicham, so the aforementioned Volcarona and Tapu Lele are excellent at shutting down these threats with the former's Flame Body and the latter's Psychic Terrain.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance Iron Valiant is a fantastic wallbreaker and setup sweeper, making use of its excellent coverage and Speed tier accentuated by Booster Energy to outpace and tear through common speed control options in Dragapult, Mega Lopunny, and Choice Scarf Urshifu-R. Its effectiveness in this role is compounded by the ability to break past answers such as Galarian Slowking and Iron Crown that would otherwise check special sets. Knock Off not only allows Iron Valiant to cripple incoming checks such as Moltres and Toxapex but also serves as important coverage against the vast majority of Ghost- and Psychic-type Pokemon; at +2, it notably OHKOes offensive Gholdengo and Galarian Slowking and can 2HKO Slowbro lacking Colbur Berry. Ice Punch allows Iron Valiant to OHKO Landorus-T, Dragonite, and Gliscor at +2. However, Encore is also a strong alternative that allows Iron Valiant to facilitate additional setup opportunities by punishing the use of status moves such as Stealth Rock from Landorus-T or Quiver Dance from Volcarona. It also prevents Raging Bolt from reliably revenge killing Iron Valiant by locking it into Thunderclap. Spirit Break provides a secondary STAB option that lets Iron Valiant deal more damage to Fighting-types such as Great Tusk and Zamazenta as well as Fairy-types such as Tapu Koko and Clefable, notably OHKOing the former at +2.</p> <p>Iron Valiant's immense Attack and Speed tier make it a solid fit on various offense and hyper offense teams. Entry hazard setters such as Landorus-T, Hisuian Samurott, and Garchomp are essential for their ability to wear down Pokemon such as Hex Gholdengo and Tapu Lele to where a boosted Iron Valiant can pick them off late-game. Special attackers such as Calm Mind Raging Bolt, Quiver Dance Volcarona, and Nasty Plot Gholdengo can help pressure physically defensive stopgaps in Toxapex, Skarmory, and Zapdos early on, while Iron Valiant takes on specially defensive checks to these Pokemon such as Galarian Slowking and Ting-Lu in return. Similarly, accompanying physical sweepers such as Swords Dance Kingambit, Dragon Dance Dragapult, and Swords Dance Ogerpon-W pair excellently with Iron Valiant to help overwhelm shared physical checks such as Moltres and Alomomola. While Iron Valiant can use its Speed tier in conjunction with Booster Energy to revenge kill certain offensive threats in Mega Lopunny and Mega Swampert under rain in a vacuum, it often loses offensive flexibility while doing so, especially once it has depleted its Booster Energy. Thus, Iron Valiant appreciates being paired with teammates such as Iron Defense Zamazenta and Dragon Dance Dragonite as well as secondary Speed control options such as Booster Energy Iron Moth and Swords Dance Rillaboom that can help force these Pokemon out, ensuring that it doesn't have to deal with them outside of sweeping positions. Tapu Koko is also a notable offensive partner, as the Electric Terrain it provides allows Iron Valiant to retain its Speed boost outside of Booster Energy while being able to pressure some of Iron Valiant's checks in Moltres and Toxapex.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546157, "username": "Iride"}, {"user_id": 616497, "username": "FayaWizard"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493260, "username": "Marnie"}, {"user_id": 664887, "username": "wisteriapurple"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Ogerpon-Wellspring": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-W is a very threatening wallbreaker that gets many opportunities to set up with Swords Dance, as it can threaten key defensive pieces like Landorus-T, Great Tusk, and Heatran with its STAB moves. Power Whip is the preferred option, as it OHKOes Great Tusk and Alomomola, but Horn Leech can keep Ogerpon-W healthy. Superpower hits potential switch-ins such as Ferrothorn and Archaludon. Play Rough can allow Ogerpon-W to target foes such as Dragonite, Raging Bolt, and Dragapult, which would otherwise switch in comfortably.</p> <p>Ogerpon-W tends to fit on many different playstyles from hyper offense to balance, as it is a potent wallbreaker capable of threatening defensive teams. Its Water immunity is also appreciated against rain teams. Pokemon like Great Tusk and Landorus-T value Ogerpon-W’s ability to break through bulky Water-types such as Alomomola, Slowbro, and Dondozo. In return, these two provide Stealth Rock support as well as an Electric immunity that can stop revenge killing attempts from Tapu Koko and Raging Bolt. In addition, both teammates can provide entry hazard removal, which Ogerpon-W appreciates, as it is vulnerable to chip damage. Ogerpon-W struggles with threats like Dragapult, Mega Latios, and Mega Latias, so Pursuit trappers like Kingambit and Mega Tyranitar are welcomed. Ogerpon-W does not like taking many hits, so it appreciates U-turn from teammates such as Landorus-T and Dragapult to enter the field safely against Pokemon that want to come in on them such as Alomomola for the former and Mega Tyranitar for the latter. Non-Superpower Ogerpon-W can struggle to dent checks such as Ferrothorn and Archaludon, so Pokemon like Zamazenta and Mega Lopunny are valued to make up for the lack of coverage. Non-Play Rough Ogerpon-W should have partners that can pressure checks like Dragonite and Raging Bolt like Great Tusk and Tapu Koko.</p>"
      },
      "Offensive Pivot": {
        "description": "<p>Ogerpon-W is an offensive pivot that threatens common defensive Pokemon like Landorus-T, Gliscor, and Heatran. Courtesy of its ability, Ogerpon-W can answer a plethora of offensive Water-types, such as Mega Swampert and Urshifu-R, while ignoring Scald and Flip Turn from Slowbro, Toxapex, and Alomomola. Power Whip OKHOes Ursaluna and Great Tusk after minor chip damage, whereas Horn Leech provides it with longevity in exchange for power. U-turn allows Ogerpon-W to pivot out of checks such as Raging Bolt, Ferrothorn, and Dragonite. Knock Off is used to cripple switch-ins like Dragonite and Ferrothorn by removing their Heavy-Duty Boots and Leftovers, respectively, and also hits Dragapult super effectively. Alternatively, Encore can lock certain defensive pieces into recovery moves such as Toxapex and Mega Scizor. Encore also helps Ogerpon-W avoid mind games against priority moves from Raging Bolt and Kingambit and denies faster Pokemon like Zamazenta from setting up on it. Taunt is also an option to deny entry hazard-setting attempts from walls such as Ferrothorn and Clefable while ensuring Ogerpon-W walls Toxapex and Alomomola. Spikes can be used to wear down checks such as Ferrothorn and Raging Bolt lacking Heavy-Duty Boots, as it has the remarkable ability to force switches.</p> <p>Ogerpon-W commonly fits on bulky offense and balance teams. Pokemon such as Great Tusk and Landorus-T appreciate its presence due to its ability to threaten foes such as Alomomola, Urshifu-R, and Moltres. In return, these teammates can provide entry hazard removal through Rapid Spin and Defog to prevent Ogerpon-W from being worn down quickly. Additionally, Landorus-T can bring it in with U-turn against Pokemon like Alomomola and Gliscor. Ogerpon-W is vulnerable to faster threats such as Iron Valiant and Dragapult, so it appreciates teammates like bulky Volcarona and Pursuit Kingambit to answer Iron Valiant and trap Dragapult, respectively. Ogerpon-W also loves Spikes support from Pokemon like Mega Diancie to wear down checks such as Ferrothorn and Raging Bolt and help rack up chip damage in combination with U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 637479, "username": "red fintans"}, {"user_id": 471780, "username": "Solaros & Lunaris"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Ogerpon-Cornerstone": {"sets": {"Offensive": {}}},
  "Archaludon": {"sets": {"Rain Wallbreaker": {}}},
  "Hydrapple": {"sets": {"Nasty Plot": {}}},
  "Raging Bolt": {
    "sets": {
      "Calm Mind": {},
      "Pivot": {
        "description": "<p>Raging Bolt is an excellent pivot, using its stellar offensive presence and ability to force out Pokemon such as Toxapex, Zapdos, and Moltres to gain momentum for its teammates. Not only that, Raging Bolt's solid defensive typing makes it have favorable matchups against Pokemon like Ogerpon-W and Mega Charizard Y. Thunderclap is a useful form of priority, being the main way Raging Bolt threatens out faster threats such as Urshifu-R, Iron Valiant, and Mega Medicham. Draco Meteor gives Raging Bolt the ability to hit Pokemon that would effortlessly block Volt Switch, such as Landorus-T and Gliscor. Taunt is an option over Thunderbolt, allowing Raging Bolt to stop entry hazards from being set up by the likes of Heatran and Ferrothorn and deny recovery for Pokemon like Mega Scizor, Blissey, and Garganacl. Heavy-Duty Boots lets Raging Bolt pivot safely in the face of hazards, particularly Spikes, while Dragonium Z gives Raging Bolt the ability to OHKO Gliscor and Landorus-T and muscle through weakened checks like Garganacl and Mega Tyranitar. Alternatively, Leftovers grants Raging Bolt more longevity to check Pokemon like Mega Charizard Y, Ogerpon-W, and Urshifu-R more consistently. When using Heavy-Duty Boots, an EV spread with maximum Special Attack and Speed is preferred. However, the second EV spread ensures Raging Bolt outspeeds defensive Landorus-T while also surviving a Landorus-T's Earthquake after Stealth Rock.</p> <p>Raging Bolt fits best on bulky offense and balance teams, where its pivoting abilities are much appreciated to keep momentum and bring in wallbreakers such as Mega Medicham and Kingambit against Pokemon like Ferrothorn, Galarian Slowking, and Mega Tyranitar. Raging Bolt checking Ogerpon-W and Tornadus-T is appreciated by teammates such as Alomomola and Great Tusk. In return, Alomomola provides Wish support, making up for Raging Bolt's poor longevity, and Great Tusk removes Spikes, which cut into Raging Bolt lacking Heavy-Duty Boots. Due to Raging Bolt's lack of power, it loves the Spikes set by teammates like Samurott-H and Ferrothorn, chipping down its checks such as opposing Ferrothorn and Heatran. Raging Bolt is also hindered by Ground-types that easily outpace it such as Garchomp and Great Tusk, since they also block its Volt Switch, stopping it from gaining momentum. Teammates that check these foes, such as Moltres and Landorus-T, are good partners for Raging Bolt.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 658067, "username": "Ineros"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 571069, "username": "Dead by Daylight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}]}]}
  },
  "Iron Boulder": {"sets": {"Swords Dance": {}}},
  "Iron Crown": {"sets": {"Offensive Pivot": {}, "Assault Vest": {}}},
  "Terapagos": {"sets": {"Offensive Utility": {}}},
  "Pecharunt": {"sets": {"Defensive Pivot": {"description": "<p>104 Special Attack EVs lets Pecharunt break through Zamazenta's Substitute.</p>"}}}
}