{
  "Venusaur": {"sets": {"Chlorophyll Sweeper": {}, "Tank": {}}},
  "Charizard": {
    "sets": {
      "Drought Wallbreaker": {
        "description": "<p>Mega Charizard Y's immense power combined with Drought makes it an extremely dangerous wallbreaker that threatens common defensive staples like Alomomola, Melmetal, and Ferrothorn while also supporting its teammates via sun. Weather Ball is the preferred Fire-type STAB move, as it is perfectly accurate, quite powerful, and 2HKOs Pelipper in the rain after Stealth Rock. However, Fire Blast can be used to get better damage rolls onto Garchomp and defensive Landorus-T while also hitting Kommo-o through Bulletproof. Solar Beam provides crucial coverage for Water-types, such as Alomomola, Slowbro, and Rotom-W. Scorching Sands allows Mega Charizard Y to hit Heatran, Toxapex, and Mega Tyranitar super effectively; it also pressures them with burns, which is also useful against other switch-ins, such as Kommo-o and Garchomp. On the other hand, Focus Blast is far more threatening to Mega Tyranitar and still hits Heatran, but it leaves Mega Charizard Y struggling to pressure Toxapex. Roost allows Mega Charizard Y to stay healthy throughout a match; this is important given its extreme vulnerability to Stealth Rock.</p> <p>Entry hazard removal is absolutely imperative when using Mega Charizard Y due to its 4x weakness to Stealth Rock. Great Tusk is a standout partner that can clear hazards while also benefitting from Mega Charizard Y's sun due to Protosynthesis. It also offensively pressures common Mega Charizard Y switch-ins, like Mega Tyranitar and Toxapex. A secondary form of entry hazard removal, such as Terapagos or Defog Kartana, is required as well. Raging Bolt is another notable beneficiary of Mega Charizard Y, as it appreciates sun boosting its Special Attack and gaining access to a powerful Fire-type Weather Ball that lets it pressure Ferrothorn and Assault Vest Kingambit. Hisuian Samurott is also a good teammate due to it being able to set Spikes to wear down Mega Charizard Y’s checks, such as Toxapex and Garchomp; in return, Mega Charizard Y threatens Clefable and Ferrothorn for Hisuian Samurott. Mega Charizard Y also appreciates Future Sight support from Slowbro and Galarian Slowking. This is especially potent with Focus Blast variants, as common Future Sight switch-in Mega Tyranitar does not want to take a Focus Blast, and it allows these variants to overcome their lack of coverage for Toxapex. They, along with Alomomola, can also function as slow pivots to get Mega Charizard Y in safely. Faster offensive threats such as Dragapult and Zamazenta appreciate Mega Charizard Y wallbreaking for them early so they can potentially clean up late-game; Dragapult notably does not mind Mega Latios and Mega Latias still being in play, as Mega Charizard Y can struggle to break through them, and it appreciates Mega Charizard Y overwhelming foes like Mega Tyranitar and Ting-Lu. Kingambit is another great partner that can Pursuit trap foes that are problematic for Mega Charizard Y, most notably Mega Latios, Mega Latias, and Dragapult, while also removing items from Moltres and Toxapex.</p>"
      },
      "Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Nidoking": {"sets": {"Wallbreaker": {}}},
  "Clefable": {
    "sets": {
      "Utility": {
        "description": "<p>Clefable is a standout utility piece, possessing a wide variety of utility options along with incredible longevity due to its immunity to entry hazards as well as Toxic from the likes of Alomomola and Toxapex through Magic Guard; this invulnerability to common forms of chip damage allows it to serve as a sturdy check to the likes of Mega Lopunny and Hisuian Samurott for many teams. Clefable is a good user of Stealth Rock due to its positive matchups versus most hazard removal options such as Great Tusk, Terapagos, and Zapdos. Thunder Wave cripples Pokemon that may try to switch in on Clefable, such as Mega Charizard Y and Mega Scizor, allowing for them to be more easily handled. Thunder Wave Clefable also pairs nicely with Hex users like Dragapult and Gholdengo. Knock Off is Clefable’s most spammable move, removing the items of key targets like Heatran, Ferrothorn, Melmetal, and Toxapex. Leftovers is the item of choice on Clefable to help it check Mega Lopunny and Dragonite in the long term while also helping it avoid a 2HKO from Great Tusk’s Headlong Rush. Leftovers also prevents the need for Clefable to waste Soft-Boiled PP in order to stay healthy. The given EV spread allows Clefable to guarantee it does not get 2HKOed by Choice Specs Dragapult after Leftovers recovery.</p> <p>Clefable fits on balance and bulky offense teams, where its longevity, useful role compression and ability to stave off physical attackers like Zamazenta and Hisuian Samurott are valuable. Pokemon like Kingambit and Terapagos appreciate Clefable checking threats like Dragonite, Mega Lopunny, and Urshifu-R and removing items from their checks such as Ferrothorn and Toxapex. Clefable also forms a terrific core with Spikes setters like Ferrothorn and Hisuian Samurott, as it sets up Stealth Rock to further the chip damage of Spikes and removes Heavy-Duty Boots from Pokemon like Zapdos and Terapagos. Although Clefable has solid longevity, its bulk is less than desirable to be a sole check to threats like Mega Medicham and Garchomp. As such, Pokemon that reinforce its defenses such as Mega Latias and Great Tusk are helpful teammates. Clefable also has issues with a myriad of Steel-types, such as Melmetal, Gholdengo, Kingambit, and Mega Scizor. Teammates that help with these threats, like Zamazenta, Zapdos, and Volcarona, are appreciated.</p>"
      },
      "Calm Mind": {}
    },
    "credits": {"writtenBy": [{"user_id": 658067, "username": "Ineros"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 514772, "username": "sealoo"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Ninetales": {"sets": {"Sun Setter": {}}},
  "Slowbro": {"sets": {"Defensive Pivot": {}}},
  "Weezing-Galar": {"sets": {"Defensive": {}}},
  "Chansey": {"sets": {"Little Pink Blob": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Ditto": {"sets": {"Those Who Know:": {}}},
  "Zapdos": {"sets": {"Defensive": {}, "Offensive": {}}},
  "Moltres": {"sets": {"Defensive": {}}},
  "Dragonite": {"sets": {"Dragon Dance + Z-Move": {}, "Offensive Dragon Dance": {}}},
  "Slowking-Galar": {"sets": {"Defensive Pivot": {}, "Assault Vest": {"description": "<p>224 SpD EVs with a Calm nature lets Slowking-Galar live Mega Charizard Y's Fire Blast twice from full HP.</p>"}}},
  "Scizor": {"sets": {"Bulky Swords Dance": {}, "Swords Dance + 3 Attacks": {}}},
  "Heracross": {"sets": {"Wallbreaker": {}}},
  "Skarmory": {"sets": {"Defensive": {}}},
  "Blissey": {"sets": {"Pink Blob": {}}},
  "Tyranitar": {"sets": {"Offensive": {}}},
  "Swampert": {
    "sets": {
      "Rain Sweeper": {
        "description": "<p>Mega Swampert is an amazing wallbreaker on rain teams due to its ability to outspeed most offensive threats like Dragapult, Tapu Lele, and Zamazenta with Swift Swim and threaten them with strong attacks that are further boosted by rain. Its Ground typing is also useful for these types of teams, as it gives them a Pokemon that can reliably take on Electric types like Raging Bolt and Tapu Koko. Flip Turn lets Mega Swampert lure in checks to it like Alomomola and Rotom-W and bring in teammates like Raging Bolt and Archaludon that can reliably take on these Pokemon. Stealth Rock takes advantage of the multiple switches that Mega Swampert and its teammates force to rack up chip damage against foes such as Ferrothorn and Mega Venusaur for Mega Swampert eventually being able to break through. Ice Punch hits Pokémon such as Rillaboom, Dragonite and Zapdos, while Superpower deals with Ferrothorn as well as being the best option against Ogerpon-W.</p> <p>Mega Swampert is exclusively found on rain teams. Due to this, Pelipper is a required teammate, and it can get Mega Swampert in with U-turn against foes such as Raging Bolt. Because Mega Swampert struggles breaking through bulky Water-types such as Alomomola and Slowbro and also struggles with Grass types such as Rillaboom and Tangrowth, Pokemon like Zapdos and Tornadus-T are amazing partners, as they can reliably take them out for Mega Swampert. Mega Swampert outside of rain also has a very middling Speed tier, allowing Pokémon like Ogerpon-W and Zamazenta to effectively revenge kill it, and even in rain it is still outsped by options like Booster Energy Iron Valiant, so Pokémon like Raging Bolt and Barraskewda are effective partners to deal with these Pokemon. Raging Bolt in particular, as well as Archaludon, further help Mega Swampert against Grass-types by using them as setup fodder.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 591294, "username": "Lightniong"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 604820, "username": "Sami"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}]}]}
  },
  "Pelipper": {"sets": {"Rain Setter": {}}},
  "Shedinja": {"sets": {"Dual Status": {}}},
  "Sableye": {"sets": {"Defensive": {}}},
  "Mawile": {"sets": {"Swords Dance": {}, "All-Out Attacker": {}}},
  "Medicham": {
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Mega Medicham is a destructive wallbreaker that is hugely threatening to several common defensive staples like Ferrothorn, Toxapex, Great Tusk, and Melmetal. Its immense power even allows it to 2HKO bulky neutral targets like Corviknight and Alomomola. Fake Out allows Mega Medicham to pressure faster and more offensive Pokemon like Mega Lopunny, Iron Moth, and Ogerpon-W. This lets Mega Medicham act as a revenge killer if these threats are weakened, and it chips much of the metagame decently. Ice Punch blows past Landorus-T, Gliscor, and Dragonite with ease. Bullet Punch alongside Fake Out improves Mega Medicham's revenge killing capabilities versus offensive teams, and it notably applies significant pressure onto Mega Diancie and Iron Valiant. Fire Punch hits Gholdengo, which is a very common check, and almost always OHKOes Mega Scizor. Fire Punch's targets are very specific, however, which makes it less consistent than Ice Punch and Bullet Punch on a game-to-game basis.</p> <p>Pursuit trapping checks is hugely beneficial to Mega Medicham. Assault Vest Kingambit and Weavile can trap and remove checks such as Gholdengo, Mega Latios, Mega Latias, Dragapult, and Slowbro. Mega Medicham threatens several Pokemon that are irritating for them in return, such as Great Tusk, Alomomola, and Toxapex. Mega Medicham's poor defensive profile makes it hard to switch into battle safely, so it appreciates slow pivots like Alomomola, Galarian Slowking, and defensive Landorus-T that can ease prediction and help it get on the field. A solid defensive backbone is advised when using Mega Medicham, as several very common offensive threats revenge kill it with ease, including Dragapult, Mega Latios, and Ogerpon-W. Teammates like Toxapex, Ferrothorn, Ting-Lu, and Assault Vest Kingambit are very helpful in this regard. Hisuian Samurott is another great teammate that checks threatening Ghost- and Psychic-types like Gholdengo and Mega Latios while also laying down Spikes, and it can use Flip Turn to pivot Mega Medicham into battle. Other forms of entry hazard support, like Spikes from Ferrothorn and Stealth Rock from Great Tusk, Landorus-T, and Ting-Lu, are generally very helpful, as they help wear down checks such as Gholdengo. Fast late-game cleaners like Zamazenta, Dragapult, Iron Valiant, and Cinderace appreciate Mega Medicham blowing up opposing defenses before they come into battle to sweep later on.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 662575, "username": "boppydop!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Torkoal": {"sets": {"Sun Setter": {}}},
  "Salamence": {"sets": {"Dragon Dance + Z-Move": {}}},
  "Latias": {"sets": {"Offensive Utility": {}, "Calm Mind": {}}},
  "Latios": {"sets": {"Wallbreaker": {}}},
  "Lopunny": {"sets": {"Offensive": {}}},
  "Garchomp": {"sets": {"Offensive Swords Dance": {}, "TankChomp": {}, "Swords Dance + Scale Shot": {}, "Mixed Attacker": {}}},
  "Hippowdon": {"sets": {"Defensive": {}}},
  "Weavile": {"sets": {"Choice Band": {}, "Offensive": {}}},
  "Magnezone": {"sets": {"Iron Defense + Body Press": {}}},
  "Tangrowth": {"sets": {"Physically Defensive": {}, "Assault Vest": {}}},
  "Gliscor": {
    "sets": {
      "Utility": {},
      "Swords Dance": {
        "description": "<p>With Swords Dance, Gliscor is able to act as a bulky setup sweeper that can overwhelm defensive teams in mid- to late-game scenarios. This is because of the valuable resistances and immunities its typing affords, its bulk, and Poison Heal, allowing it to set up in front of common Pokemon such as Raging Bolt, Landorus-T, and Heatran. Facade allows Gliscor to hit Pokemon that resist or are immune to Earthquake such as Moltres, Rillaboom, and Zapdos. Alternatively, Knock Off hits Air Balloon Gholdengo, and can remove items from counters such as Dondozo and Corviknight to support its team. Roost allows Gliscor to challenge Pokemon it likes to switch in on such as Zapdos and Gholdengo more effectively. The EV spread uses 112 Speed EVs to outspeed maximum Speed Timid Heatran.</p> <p>Swords Dance Gliscor fits best on bulky offense and balance structures due to its ability to set up on and remove passive Pokemon like Landorus-T, Clefable, and Toxapex, but it struggles against Pokemon with immediate offensive power such as Urshifu-R, Weavile, and Ogerpon-W. Ferrothorn and Toxapex are excellent defensive partners, as they are able to check Pokemon that threaten Gliscor like Ogerpon-W, Urshifu-R, and Weavile, forcing them to switch out. They are also able to set Stealth Rock, Spikes, and Toxic Spikes, which can grant Gliscor opportunities to switch in again due to its good matchup against entry hazard removal options such as Zapdos, Moltres and Landorus-T. Gliscor can struggle with some bulky Water-types like Dondozo and Alomomola, so the likes of Tapu Koko, Ogerpon-W and Raging Bolt are able to pressure these Pokemon. Gliscor also doesn't appreciate the pressence of bulky Grass-types like Ferrothorn and Rillaboom, so Moltres, Heatran, and Raging Bolt having the ability to threaten is appreciated. Powerful offensive options such as Kyurem, Terapagos, and Ogerpon-W can easily deal with Gliscor, so reliable defensive options that can switch in on these offensive threats like Ferrothorn, Gholdengo, and Mega Venusaur are valuable partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 607465, "username": "EatFoods"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 637479, "username": "red fintans"}, {"user_id": 542295, "username": "Wildfiree"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Rotom-Wash": {"sets": {"Defensive Pivot": {}, "Nasty Plot": {"description": "<p>108 HP EVs lets Rotom-Wash live a +2 Knock Off from Kingambit.</p>"}, "Choice Scarf": {}}},
  "Heatran": {"sets": {"Specially Defensive": {}, "Offensive": {}}},
  "Cresselia": {"sets": {"Trick Room Setter": {}}},
  "Manaphy": {"sets": {"Tail Glow + 3 Attacks": {}, "Rain Wallbreaker": {}}},
  "Victini": {"sets": {"Choice Scarf": {}, "Pivot": {}, "Celebrate + Stored Power": {}}},
  "Serperior": {"sets": {"Substitute Attacker": {}, "Glare + 3 Attacks": {}}},
  "Samurott-Hisui": {
    "sets": {
      "Offensive": {
        "description": "<p>Hisuian Samurott is a powerful wallbreaker that provides offensive pressure alongside entry hazard support with a unique typing that allows it to temporarily check Gholdengo and Kingambit when running Sacred Sword. Ceaseless Edge has its Base Power amplified by Sharpness to deal decent damage while passively setting Spikes that can’t be blocked by Taunt or Magic Bounce. Razor Shell is the preferred option for a Water-type STAB move, as the chance to lower Defense can come in handy when breaking through Toxapex and Corviknight, though Aqua Cutter can be considered for its perfect accuracy and non-contact nature. Sucker Punch is a priority move that hits surprisingly hard once boosted, and it can pick up KOs on weakened sweepers like Volcarona and stop revenge killing attempts from the likes of Dragapult. Lastly, Sacred Sword gives Hisuian Samurott the ability to OHKO Kingambit and Mega Tyranitar while immediately dealing significant damage versus Melmetal and Terapagos without Tera Shell intact. Optionally, Swords Dance can boost Hisuian Samurott’s wallbreaking capabilities to impressive thresholds, being able to 2KHO Ferrothorn and nearly OHKO Ogerpon-W with a boosted Sucker Punch, and Encore locks foes into passive moves like recovery moves from the likes of Corviknight and Alomomola and setup moves from sweepers like Iron Valiant. Hisuian Samurott has a few options for an item, with Black Glasses boosting both Dark-type attacks, which offer better roll against more physically defensive variants of Ferrothorn and Toxapex while also boosting Sucker Punch versus Mega Charizard Y and faster Landorus-T. Heavy-Duty Boots and Protective Pads both improve Hisuian Samurott’s longevity by allowing it to switch in with hazards on the field for the former and avoid contact punishment from the likes of Rocky Helmet users, Static Zapdos, and Ferrothorn for the latter.</p> <p>Hisuian Samurott fits best on entry hazard-stacking teams due to its unique ability to set hazards while attacking. While Hisuian Samurott is powerful, its middling Speed and typing leave it vulnerable to a variety of revenge killers like Tapu Koko and Mega Lopunny. Teammates such as Landorus-T and Gholdengo can switch into faster threats such as Zamazenta and Tapu Lele, and the latter is also able to effectively block forms of hazard removal. Partners like Tapu Koko and Great Tusk benefit from Hisuian Samurott being able to weaken their checks like Ferrothorn and Corviknight, with the former being able to threaten Defoggers like Tornadus-T. Hisuian Samurott can work with offensive partners like Iron Valiant, Swords Dance Garchomp, and Mega Scizor, appreciating Spikes chip damage on checks such as Gholdengo, Toxapex, and Alomomola.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Hisuian Samurott is able to utilize Sharpness-boosted attacks paired with a Choice Scarf to effectively act as speed control. Ceaseless Edge supports its teammates with Spikes while being a very low-risk move against a multitude of targets such as Mega Latios. Aqua Cutter can be an alternative option over Razor Shell, as it forgoes power and Defense drops for 100% accuracy and ability to avoid contact. Sacred Sword hits Dark-types, securing the OHKO versus Kingambit and Mega Tyranitar, deals more damage to Steel-types like Melmetal and Ferrothorn, and damages Normal-types like Terapagos and Mega Lopunny, OHKOing the latter. Knock Off can be an option, which aims to remove the items off of checks such as Zapdos and Toxapex. Flip Turn can let Hisuian Samurott pivot out while not committing to a Choice-locked Water-type move, and it additionally breaks Terapagos's Tera Shell and pivots in teammates. It allows Hisuian Samurott to generate momentum by escaping bad matchups like against Zamazenta and Clefable and wearing them down.</p> <p>Wallbreakers such as Mega Diancie and Iron Valiant can make use of the pivoting from Flip Turn to threaten the Fighting- and Dark-types that can switch into Hisuian Samurott. Swords Dance Landorus-T and Z-Move Garchomp pair nicely with Hisuian Samurott, as they can lure and take out entry hazard removal options like Great Tusk and Corviknight while setting Stealth Rock. Furthermore, Hisuian Samurott often has issues with frailty and the inability to beat common hazard removal options, so partners such as Raging Bolt can pressure bulky Water-types that check Hisuian Samurott, such as Alomomola and Toxapex, and hazard removal options, like Tornadus-T and Corviknight, while also being able to switch into Zapdos and Urshifu-R. Gholdengo can block Defog and Rapid Spin while utilizing its great bulk to switch into the Fairy-type and Fighting-type moves directed at Hisuian Samurott and take advantage of Hisuian Samurott's passive checks like Toxapex and Ferrothorn.</p>"
      },
      "Assault Vest": {"description": "<p>176 HP EVs and 72 SpD EVs live a Moonblast from Mega Diancie at full HP. 108 Speed EVs outspeed uninvested Iron Crown.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 662575, "username": "boppydop!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Excadrill": {"sets": {"Swords Dance": {}}},
  "Alomomola": {
    "sets": {
      "Defensive": {
        "description": "<p>Alomomola's massive HP stat allows it to be an effective user of Wish to support its ability to give teammates safe entry through Flip Turn. It can make use of Toxic to wear down opposing Pokemon that switch in on it and Pokemon that try setting up on it such as Terapgos, Ogerpon-W, and Great Tusk. Alomomola also appreciates Protect as a way to ensure it is able to use Wish and regain its own HP safely, scout opposing Pokemon's moves, notably Choice-locked attackers such as Dragapult and Tapu Lele as well as being able to build up Toxic damage on foes like Garchomp and Terapagos. Heavy-Duty Boots are another great tool for Alomomola, allowing it to safely switch into hazards to gain back health safely with Regenerator and use Wish to support teammates. The EV spread and Relaxed nature used allows Alomomola to comfortably sponge up hits from strong Physical attackers such as Kingambit, Urshifu-R, and Great Tusk, while a Sassy nature allows it to have a more comfortable matchup into Mega-Diancie and Terapagos. Alomomola makes use of 8 HP EVs to remain at an odd number HP stat so it can switch into hazards more optimally if it's Heavy-Duty Boots are removed.</p> <p>Slower Pokemon that lack reliable recovery, like Ursaluna, Kingambit, and Melmetal, appreciate Alomomola's ability to bring them in safely and recover their HP with Wish against bulky Pokemon like Ting-Lu and Ferrothorn. Frail Pokemon such Iron Valiant and Dragapult also appreciate Alomomola's ability to safely get them on the field with Flip Turn. Alomomola's vulnerability to Grass- and Electric-type Pokemon like Rillaboom, Tapu Koko, and Kartana make Raging Bolt and Ferrothorn excellent partners due to their ability to easily shrug them off and regain whatever health is lost through Alomomola's ability to safely Wish pass into these Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 607465, "username": "EatFoods"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Ferrothorn": {
    "sets": {
      "Defensive": {
        "description": "<p>Ferrothorn is an excellent defensive Steel-type and entry hazard setter, since its Grass typing lends it resistances to Water and Electric as well as a neutrality to Ground, allowing it to more comfortably handle Pokemon like Ogerpon-W, Mega Swampert, Tapu Koko, and Raging Bolt, which other Steel-types like Mega Scizor and Gholdengo have more trouble against; being a Steel-type also naturally improves its matchup against Melmetal, Tapu Lele, and Rillaboom. Iron Barbs lets Ferrothorn pressure foes like Urshifu-R, Mega Lopunny, Melmetal lacking Protective Pads, and U-turn users like Landorus-T, forcing them to play more carefully lest they rack up chip damage very quickly with contact moves. Leech Seed is Ferrothorn's most reliable recovery, allowing it to pressure other passive Pokemon like Toxapex and Gliscor into wasting their healing moves, deal valuable chip damage to switch-ins that have no means of healing such as Cinderace and Heatran, and gradually recover HP with each use. Knock Off allows Ferrothorn to punish Heavy-Duty Boots users like Zapdos, Toxapex, and Tornadus-T as well as Leftovers users like Landorus-T, which is extremely valuable in forcing progress by making foes more susceptible to hazards or removing their recovery. Body Press allows Ferrothorn to surprise Kingambit and Kyurem, dealing massive damage to both and avoiding getting PP stalled by Kyurem; it also lets Ferrothorn hit Heatran on the switch and damage opposing Ferrothorn instead of idling. Gyro Ball snags Fairy-types like Tapu Lele and Iron Valiant on the switch and 2HKOes Dragapult, preventing it from setting up to +2 with Dragon Dance, although it should be run with a Relaxed nature and 0 Speed IVs. Thunder Wave is niche, providing great value against offense teams, but since it is easily blocked by Gholdengo, it is often undesirable. Spikes is used over Stealth Rock when another setter is present on the team. The Defense EVs allow Ferrothorn to survive Adamant +1 Dragapult's Never-Ending Nightmare. Leftovers is nigh mandatory, providing much more consistent healing than Leech Seed and taking advantage of Ferrothorn's ability to sit on the field for many turns at a time. Rocky Helmet is a viable alternative, punishing U-turn users like Landorus-T and Urshifu-R as well as Rapid Spin from Great Tusk much harder; overall, it rewards risky play compared to Leftovers’s relative safety and should therefore allow Ferrothorn to be used more aggressively.</p> <p>Most wallbreakers pair well with Ferrothorn, taking advantage of the entry hazards it sets to break through defensive targets, but those that switch in on Ferrothorn's counters such as Gholdengo, Zamazenta, and Mega Charizard Y are particularly good; these wallbreakers include Kingambit, Mega Charizard Y, Tapu Lele, and Mega Tyranitar. Kingambit and Mega Tyranitar can Pursuit trap Gholdengo and Dragapult, the latter of which is frustrating due to often carrying Will-O-Wisp. Gholdengo itself is also a good teammate, as it can deny Defog and switch in more easily against Pokemon like Tapu Lele and Iron Valiant. Ferrothorn's defensive utility is also appreciated by teammates like Toxapex and Landorus-T, which struggle with Electric-types like Tapu Koko and Water- and Ice-types like Hisuian Samurott and Kyurem, all of which Ferrothorn helps check. However, Ferrothorn does have a host of issues that require some support to cover. Ferrothorn's glaring Fire weakness is not even its biggest problem, given that having teammates like Toxapex, Heatran, and Alomomola around can easily blank Fire-type moves from the likes of Mega Charizard Y, opposing Heatran, and Dragapult. Its main problem stems from its lack of instant recovery, making it more inclined to offensively oriented teams. Having Leftovers removed by Knock Off from foes like Kingambit, Mega Tyranitar, and opposing Ferrothorn or getting burned by Will-O-Wisp from foes like Dragapult renders it unable to heal without Leech Seed, and Leech Seed fails against Gholdengo and common Grass-types like Ogerpon-W and opposing Ferrothorn. Therefore, Ferrothorn is best played more offensively, using its unique defensive utility, Leech Seed, and Iron Barbs to force switches and hazard chip damage, granting immediate momentum when played aggressively while also not punishing the user for playing more carefully. Teammates that can absorb Knock Off, like Mega Tyranitar, and those that can absorb Will-O-Wisp, like Heatran and Clefable, are incredibly valuable teammates. Finally, Pokemon that can cover Ferrothorn's Fighting weakness are good defensively, including the aforementioned Gholdengo as well as Zapdos, Landorus-T, and Toxapex.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 637479, "username": "red fintans"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 674261, "username": "Flames Of Elixir"}, {"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Volcarona": {"sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}, "Substitute + Swarm": {}}},
  "Tornadus-Therian": {"sets": {"Pivot": {}, "Nasty Plot": {}, "Assault Vest": {}}},
  "Landorus-Therian": {"sets": {"Defensive Pivot": {}, "Swords Dance": {}, "Choice Scarf": {}, "Lead": {}}},
  "Kyurem": {"sets": {"SubRoost": {}, "Offensive": {}, "Choice Specs": {}}},
  "Chesnaught": {"sets": {"Defensive": {}}},
  "Greninja": {"sets": {"Battle Bond": {}}},
  "Hawlucha": {"sets": {"Unburden Sweeper": {"description": "<p>176 Speed EVs outspeed a +1 Dragapult after Unburden activates.</p>"}}},
  "Diancie": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Mega Diancie is a very potent wallbreaker that applies a lot of offensive pressure to bulky offense and balance builds, threatening Pokemon such as Zapdos, Raging Bolt, and Great Tusk. Mega Diancie’s coverage further cements its role as a wallbreaker; for example, Earth Power hits foes such as Heatran, Gholdengo, Melmetal, and Toxapex that would otherwise come in safely on its STAB moves. Mystical Fire provides even more coverage, hitting foes such as Ferrothorn and Mega Scizor. Power Gem avoids the drawback of possibly forcing Mega Diancie to run a nature that decreases Defense or Special Defense, improving its ability to take on Pokemon such as Raging Bolt and Dragapult. Diamond Storm can be used as well with 28 Attack EVs to improve the matchup versus Pokemon such as Galarian Slowking, scoring a 2HKO on it. Mega Diancie does well versus common forms of entry hazard removal such as Terapagos lacking Earth Power, Great Tusk, Zapdos, and Tornadus-T. Mega Diancie is a unique hazard setter that can set up hazards while denying common opposing hazard setters in Heatran and Mega Tyranitar.</p> <p>Mega Diancie fits on bulky offense teams and pairs well with Pokemon such as Great Tusk, Ferrothorn, and Landorus-T that appreciate it due to its ability to threaten and force out Pokemon such as Mega Charizard Y, Volcarona, Zapdos, and Hisuian Samurott with its STAB attacks. In return, Great Tusk and Landorus-T check threats such as Mega Lopunny, Iron Head Kingambit, and Assault Vest Melmetal, which threaten Mega Diancie directly. Landorus-T also brings Mega Diancie in safely with a U-turn against Pokemon that like to come in on it such as Tornadus-T, Mega Charizard Y, and Great Tusk, which Mega Diancie punishes. Mega Diancie tends to struggle with fast offensive Water-types such as Ogerpon-W, Choice Scarf Urshifu-R, and Mega Swampert in the rain. Thus, Pokemon such as Dragonite, Raging Bolt, and Ferrothorn can keep these foes in check.</p>"
      },
      "Lead": {
        "description": "<p>Mega Diancie functions as an amazing hyper offense lead, being able to set up Stealth Rock behind Substitute while also denying opposing entry hazards via Magic Bounce. Mega Diancie's main niche over other hazard setters is its ability to deny hazards from pokemon such as Glimmora and Landorus-T, as well as blocking taunt and encore from Pokemon like Tornadus-T and Iron Valiant, making it harder for them to deny hazards. Endeavor lets Mega Diance heavily chip Moonblast switch-ins like Moltres, Corviknight, and Heatran when at low HP. Staying in base forme is often an option in order to set Stealth Rock on faster Pokemon due to Diance's superior bulk. 244 HP EVs allow Diancie to set Substitute four times as opposed to three, leaving Mega Diancie at 1 HP to use Endeavor with.</p> <p>Being a hyper offense lead, Mega Diancie's main function is to set entry hazards to enable one of the archetype's many sweepers to punch through defensive cores and win the game, often being able to give them free switch ins by wearing itself down via Substitute. Examples of Pokemon that benefit from these hazards include Kingambit, Volcarona, and Great Tusk, since they all appreciate Stealth Rock chipping down Pokemon such as Corviknight, Heatran, and Landorus-T for them to break through more easily. However, lead Mega Diancie can sometimes be threatened by Super-Effective attacks from faster foes, such as Choice Scarf Urshifu-R, as well as by strong priority moves from Pokemon such as Choice Band Rillaboom and Mega Scizor. These can be taken care of by partners such as Dragonite, which can safely switch in on Urshifu-R, Landorus-T, and Rillaboom, and Volcarona, which switches in on and threatens Rillaboom and Mega Scizor with its strong STAB moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}, {"user_id": 632421, "username": "Medasus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 658067, "username": "Ineros"}, {"user_id": 514772, "username": "sealoo"}, {"user_id": 637479, "username": "red fintans"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Hoopa-Unbound": {"sets": {"Choice Band": {}, "Assault Vest": {"description": "<p>252 HP EVs and 56 Special Defense EVs lets Hoopa-U live a Never Ending Nightmare from a boosted Gholdengo at full HP. 64 Attack EVs lets Hoopa-U KO a Kingambit after Stealth Rock with Drain Punch, and 16 Speed EVs lets it outspeed Adamant Kingambit.</p>"}}},
  "Volcanion": {"sets": {"Wallbreaker": {}, "Choice Specs": {}}},
  "Primarina": {"sets": {"Offensive Calm Mind": {}, "Bulky Calm Mind": {}, "Assault Vest": {}}},
  "Ribombee": {"sets": {"Sticky Web": {"description": "<p>192 Defense EVs lets Ribombee live a Surging Strikes from a Urshifu-R at full HP.</p>"}}},
  "Toxapex": {"sets": {"The Pex": {"description": "<p>136 Defense EVs let Toxapex live a +2 Power Whip from Ogerpon-Wellspring from full HP.</p>"}}},
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Kommo-o": {"sets": {"Offensive Z-Move": {}, "Defensive": {"description": "<p>32 Defense EVs with an Impish nature let Kommo-o take Mega Lopunny's Close Combat twice from full HP.</p>"}}},
  "Tapu Koko": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Tapu Koko is a very consistent offensive pivot that can fit on a variety of teams, threatening a plethora of Water-and Flying-types such as Toxapex, Slowbro, Tornadus-T, and Zapdos. Tapu Koko also has a remarkable ability to consistently switch into the tier's Electric-types such as Zapdos and Raging Bolt, the aforementioned Flying-types, and Fighting-types such as Zamazenta while also having a Speed tier that outruns many threats such as Ogerpon-W and Tornadus-T. Hidden Power Ice enables Tapu Koko to hit foes such as Landorus-T, Gliscor, and Garchomp while also doing significant damage to Great Tusk. Dazzling Gleam can be used to hit foes such as Raging Bolt and Great Tusk much harder than Hidden Power Ice, though it is significantly weaker against Gliscor and Landorus-T. U-turn allows Tapu Koko to pivot out of Pokemon that handle it defensively such as Galarian Slowking and Ting-Lu while also wearing them down. Volt Switch can be used to avoid chip from contact while dealing decent damage, though it is able to be blocked by Ground-type Pokemon such a Great Tusk and Landorus-T. Electrium Z is used to give Tapu Koko a one-time boost to its already strong Thunderbolt and help it pick off weakened threats such as Melmetal and Heatran and OHKO Pokemon such as Ogerpon-W and Mega Diancie. Fairium Z can be used as an alternative to immediately OHKO foes such as Great Tusk and Raging Bolt.</p> <p>Pokemon such as Iron Valiant and Hawlucha appreciate Tapu Koko’s Electric Surge setting Electric Terrain and activating their abilities. The former also appreciates Tapu Koko beating defensive Pokemon such as Toxapex and Tornadus-T. Landorus-T also likes Tapu Koko as a partner, as it likes its Flying-type checks such as Tornadus-T, Zapdos, and Corviknight being answered by Tapu Koko. In return, Landorus-T brings it in with a U-turn on Pokemon such as Tornadus-T and it immediately threatens Pokemon such as Galarian Slowking, which walls Tapu Koko. Tapu Koko struggles to break through specially bulky Pokemon such as Ferrothorn, Galarian Slowking and Ting-Lu, so it appreciates powerful physical wallbreakers such as Mega Medicham, Urshifu-R as well as Pursuit support from Kingambit and Mega Tyranitar. In return, Tapu Koko is able to easily pivot them in with U-turn on these aforementioned checks in addition to checking the Flying-type Pokemon that they struggle with.</p>"
      },
      "Choice Specs": {},
      "Calm Mind": {},
      "Dual Screens": {}
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 658067, "username": "Ineros"}, {"user_id": 526618, "username": "omarsgarciav"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Tapu Lele": {"sets": {"Choice Scarf": {}, "Choice Specs": {}, "Offensive Z-Move": {}, "Assault Vest": {}}},
  "Tapu Bulu": {"sets": {"Offensive Z-Move": {}, "Defensive": {"description": "<p>220 HP EVs maximize Grassy Terrain recovery, and 92 Defense EVs let Tapu Bulu take Return from Mega Lopunny twice at full HP.</p>"}}},
  "Tapu Fini": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Buzzwole": {"sets": {"Physical Wall": {}}},
  "Celesteela": {"sets": {"Defensive": {"description": "<p>16 Defense EVs with a Relaxed Nature lets Celesteela live Mega Lopunny's Combat from full.</p>"}}},
  "Kartana": {"sets": {"Swords Dance": {}, "Choice Scarf": {}, "Synthesis Utility": {}}},
  "Blacephalon": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Melmetal": {"sets": {"Toxic + Protect": {"description": "<p>220 HP EVs lets Melmetal live a +2 Knock Off from Kingambit with Supreme Overlord boosts, along with outspeeding Toxapex.</p>"}, "Thunder Wave": {"description": "<p>92 Speed EVs outspeed a paralyzed Heatran.</p>"}, "Assault Vest": {"description": "<p>72 HP EVs and 252 SpD EVs let Melmetal take two Focus Blasts from Tapu Lele.</p>"}}},
  "Rillaboom": {"sets": {"Choice Band": {}, "Bulky Swords Dance": {}, "Swords Dance": {}}},
  "Cinderace": {"sets": {"Pivot": {}, "Setup Sweeper": {}}},
  "Corviknight": {"sets": {"Physically Defensive": {}, "Bulk Up + Substitute": {}}},
  "Barraskewda": {"sets": {"Rain Wallbreaker": {}}},
  "Hatterene": {"sets": {"Calm Mind": {}, "Healing Wish": {}}},
  "Grimmsnarl": {"sets": {"Dual Screens": {}}},
  "Dragapult": {"sets": {"Choice Specs": {}, "Offensive Pivot": {}, "Dragon Dance": {}}},
  "Zamazenta": {"sets": {"All-Out Attacker": {}, "Iron Defense + Body Press": {}}},
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Urshifu-R is a good late-game cleaner and revenge killer due to its ability to threaten defensive Pokemon like Heatran, Gliscor, Great Tusk, Landorus-T, and Ferrothorn with its powerful STAB moves. It also sports a great Speed stat, allowing it to outspeed the majority of the unboosted metagame, including Mega Lopunny, Dragapult, and Zamazenta. Surging Strikes's guaranteed critical hit chance means Urshifu-R ignores the Attack drop from Landorus-T's Intimidate and the Defense boost from Zamazenta's Dauntless Shield. U-turn helps Urshifu-R to keep up momentum throughout the course of a game and also take advantage of defensive switch-ins like Toxapex and Alomomola for its teammates to set up on. Aqua Jet allows Urshifu-R to pick up KOs on Pokemon that are at low HP but outspeed it, like Speed Booster Energy Iron Valiant and Unburden Hawlucha. Ice Spinner is a great tool in assuring high damage on important targets like Dragonite and Dragapult.</p> <p>Urshifu-R is a great choice on more balance-oriented teams as the speed control option, and it loves the company of teammates like Landorus-T, which helps Urshifu-R by setting up Stealth Rock and forming a good pivoting core with it. Mega Diancie is great at helping Urshifu-R deal with bulky Dragon-types like Dragonite and Kyurem, and it can take a Choice Specs Moonblast from Iron Valiant and KO it back; it can also set up entry hazards. While Landorus-T only has the option of setting up Stealth Rock, Gliscor can choose to be a Spikes setter helping to cut into the health of the bulky Water-types that wall Urshifu-R even further. Urshifu-R has the ability to break a lot of Steel-types, most notably Ferrothorn, so it can pave the way for Steel-weak Pokemon like Tapu Lele; in return, Tapu Lele is able to help Urshifu-R with most Dragon-types, most notably Dragonite, which it struggles to hit if it is not running Ice Spinner. One of the biggest Urshifu-R checks is Iron Valiant, which can take all of its attacks and KO it back with Moonblast. Mega Scizor can safely switch into Iron Valiant's moves and threaten high damage with Bullet Punch. Urshifu-R's powerful Close Combat neutralizes Dark-types such as Kingambit and Mega Tyranitar, which paves the way for teammates like Mega Latios and Mega Latias. Their strong special STAB moves are also a boon for Urshifu-R, as they can take advantage of bulky Water-types like Alomomola and Toxapex, which otherwise wall it. Electric-types like Raging Bolt and Tapu Koko are also great in this regard, with Urshifu-R being able to help with Ground-types like Iron Treads and Gliscor in return. Urshifu-R is heavily hindered by abilities and items that punish it for making contact, most notably Static from Zapdos and Flame Body from Moltres, as they are able to switch into Urshifu-R's Close Combat and U-turn and punish it via status conditions. Dragapult also is as a big Urshifu-R deterrent, as it can tank both of its STAB moves and hit back hard with Draco Meteor or ruin it with Will-O-Wisp. Thus, Urshifu-R appreciates the presence of Pokemon like Mega Tyranitar and Kingambit, as they can Pursuit trap Dragapult, with Mega Tyranitar also being able to safely get rid of Zapdos and Moltres.</p>"
      },
      "Swords Dance": {},
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 574893, "username": "Dahness"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ursaluna": {"sets": {"Swords Dance": {}}},
  "Enamorus": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Meowscarada": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Skeledirge": {"sets": {"Defensive": {"description": "<p>132 Defense EVs let Skeledirge live Zen Headbutt from Mega Medicham twice at full HP.</p>"}}},
  "Garganacl": {"sets": {"Stealth Rock": {}}},
  "Ceruledge": {"sets": {"Swords Dance": {}}},
  "Tinkaton": {"sets": {"Utility": {}}},
  "Glimmora": {"sets": {"Lead": {}, "Meteor Beam": {}}},
  "Dondozo": {"sets": {"Wall": {}}},
  "Clodsire": {"sets": {"Defensive": {}}},
  "Kingambit": {
    "sets": {
      "Swords Dance": {},
      "Offensive Utility": {
        "description": "<p>Leveraging its great natural bulk alongside significant defensive investment and an item to further boost its longevity, Kingambit is able to act as a powerful defensive tool against Pokemon such as Gholdengo, Dragapult, and Terapagos while remaining a threatening late-game cleaner. Knock Off is Kingambit's main STAB option, boasting a high Base Power and a powerful secondary effect, particularly against Heavy-Duty Boots users such as Zapdos and Moltres and Rocky Helmet users such as Alomomola and Landorus-T. Pursuit allows Kingambit to forcibly remove most Dragapult and Gholdengo setswhile also heavily limiting most dedicated special walls, such as Blissey, Clodsire, and Galarian Slowking, and guaranteeing that Terapagos' Tera Shell is broken. Sucker Punch allows Kingambit to bypass its middling Speed stat, deterring fast and offensive Pokemon that would otherwise be problematic for Kingambit, such as offensive Volcarona, Mega Charizard Y, Focus Blast variants of Gholdengo, and Mega Medicham, while also allowing it to pick off weakened foes such as Garchomp and Ogerpon-W. Low Kick is used mainly to hit opposing Kingambit while also hitting Ting-Lu and Ferrothorn and OHKOing Mega Tyranitar. Iron Head is an alternative option, allowing Kingambit to immediately threaten Iron Valiant, Tapu Koko, and Clefable while also quickly wearing down Great Tusk and all-out attacker Zamazenta. Leftovers is the premier item for Kingambit, allowing it to stick around for longer games, though the added bulk from Assault Vest is useful for trapping Tapu Lele, Terapagos, Gholdengo, and Choice Specs variants of Dragapult, giving it a good chance to live a Focus Blast from uninvested Gholdengo. Most Kingambit should use Supreme Overlord for its excellent and consistent effect, though Defiant is a viable alternative to specifically punish Landorus-T, KOing it with Knock Off into Sucker Punch, both at +1 Attack, and also punish Defog attempts from the likes of Zapdos and Corviknight. The first EV spread allows Kingambit to outspeed Clefable without Speed investment. The alternative EV spread allows Assault Vest Kingambit to survive an unboosted Focus Blast from Tapu Lele.</p> <p>Pokemon such as Ogerpon-W and Volcarona appreciate Kingambit's ability to efficiently deal with Dragapult, while others such as Mega Medicham and Tapu Lele benefit from Gholdengo's absence. Iron Defense variants of Zamazenta and Mega Medicham particularly benefit from Kingambit's ability to deal with the aforementioned Ghost-types, as they are difficult for them to break while also being able to cripple them with status effects. Access to Knock Off allows Kingambit to remove Heavy-Duty Boots from foes such as Alomomola, Zapdos, and Moltres for the benefit of hazard setting teammates such as Toxapex, Ferrothorn, and Mega Diancie. Kingambit struggles against faster Pokemon such as Zamazenta, Great Tusk, Landorus-T, and Kartana. Partners such as Zapdos and Moltres can aid Kingambit by answering multiple of these Pokemon at once. Bulkier Pokemon such as Melmetal, Ting-Lu, and Toxapex are able to consistently answer Kingambit defensively, so Dragapult, Ogerpon-W, and Raging Bolt are greatly appreciated for their ability to immediately threaten these Pokemon. It is worth noting that a significant majority of the Kingambit checks mentioned are susceptible to losing their item to Knock Off.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 526618, "username": "omarsgarciav"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 674261, "username": "Flames Of Elixir"}]}, {"name": "Grammar checked by", "members": [{"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Great Tusk": {
    "sets": {
      "Offensive Utility": {},
      "Defensive": {
        "description": "<p>Defensive Great Tusk acts as important glue on teams due to its incredible role compression by acting as a defensive wall, setting entry hazards, and clearing them. Utilizing its high bulk and HP, defensive Great Tusk acts as a great check to many metagame staples such as all-out attacker Zamazenta, Kingambit, Mega Lopunny, and Mega Tyranitar. Earthquake is the preferred STAB move on Great Tusk, but Headlong Rush can also be run for better damage rolls, such as an OHKO on offensive Gholdengo and a 2HKO on Kartana, at the cost of lowering its defenses. Moreover, Headlong Rush isn't weakened by Grassy Terrain. Ice Spinner is used mainly to threaten Landorus-T, Gliscor, and Dragonite while also hitting Zapdos and opposing Great Tusk super effectively. Great Tusk can freely remove hazards, since spinblockers like Dragapult and Gholdengo are threatened by moves such as Ice Spinner and Earthquake, respectively, and Knock Off. The last slot on this set is flexible ; runnning Stealth Rock turns Great Tusk into an effective hazard setter, threatening most hazard removal options such as Landorus-T and opposing Great Tusk with Ice Spinner. Knock Off can also be run to remove key items, like Heavy-Duty Boots from the likes of Zapdos, Tornadus-T, and Moltres as well as Leftovers from Landorus-T and opposing Great Tusk, with the added benefit of being able to hit Air Balloon Gholdengo and Dragapult super effectively. Body Press is an option in the final slot to surprise Ferrothorn, Ting-Lu, and Terapagos that has had its Tera Shell broken. 40 Speed EVs allow defensive Great Tusk to outspeed base 90s like Moltres as well as other prominent threats such as uninvested Landorus-T and bulky Gholdengo. Heavy-Duty Boots prevents Great Tusk from taking too much chip damage from hazards, while Leftovers helps in checking the threats and increases Great Tusk's longevity. Rocky Helmet is another item that can be run on Great Tusk to punish many physical attackers that either attack it recklessly or try to gain momentum like Landorus-T, Zamazenta, and Kingambit.</p> <p>Defensive Great Tusk fits best on balance and bulky offense teams, which value its role compression. The main attributes hindering Great Tusk are its typing and lack of longevity. Thus, Great Tusk appreciates partners like Alomomola, which helps with its lack of longevity by Wish passing; additionally, Alomomola is able to switch into common Water-types like Hisuian Samurott and Urshifu-R. It also appreciates Pokemon such as Volt Switch Raging Bolt and Zapdos that can reliably switch in against common Flying-types such as Zapdos, Tornadus-T, and Mega Charizard Y and Water-types like Ogerpon-W while also threatening them offensively. Steel-type partners like Mega Scizor and Melmetal are greatly valued due to their ability to switch into fast Fairy-type foes like Tapu Lele. Moreover, the hazards set up by Great Tusk pressure many switch-ins on entry, forcing progress over time. Being able to remove the items on checks to Raging Bolt like Leftovers from Ting-Lu and Assault Vest from Melmetal allows Raging Bolt to break through switch-ins with its STAB moves aided by Great Tusk's hazards. Furthermore, these teammates appreciate Great Tusk's ablilty to spin away hazards for them and can continue to check threats to Great Tusk . Defensive Great Tusk also pairs extremely well with Mega Charizard Y, which appreciates Great Tusk removing Stealth Rock and checking Pokemon such as Mega Tyranitar. In return, Mega Charizard Y is able to break through walls like Alomomola, Clefable, Skarmory, and Corviknight. Mega Charizard Y also sets up sun, granting Great Tusk a Defense boost due to Protosynthesis, which allows it to better wall physical attackers.</p>"
      },
      "Bulk Up": {}
    },
    "credits": {"writtenBy": [{"user_id": 674261, "username": "Flames Of Elixir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 571069, "username": "Dead by Daylight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 589016, "username": "Danbear02"}]}]}
  },
  "Iron Treads": {"sets": {"Lead": {}, "Specially Defensive": {}, "Offensive Utility": {}}},
  "Iron Hands": {"sets": {"Swords Dance": {}}},
  "Iron Moth": {"sets": {"Booster Energy": {}, "Offensive Pivot": {}}},
  "Gholdengo": {"sets": {"Nasty Plot": {}, "Bulky Nasty Plot": {}, "Thunder Wave + Hex": {"description": "<p>100 SpD EVs let Gholdengo live Shadow Ball from a Choice Specs Dragapult at full HP.</p>"}}},
  "Ting-Lu": {
    "sets": {
      "Defensive Hazard Setter": {
        "description": "<p>Ting-Lu's enormous HP combined with Vessel of Ruin makes it a fantastic defensive anchor against Pokemon such as Gholdengo, Volcarona, and Raging Bolt. This makes Ting-Lu a strong entry hazard setter as well, since many hazard removal options such as Terapagos and Moltres can't dissuade Ting-Lu from setting up hazards on them due to its bulk. To ensure it isn't completely passive against Flying-types, Ruination is necessary, which combined with hazard support allows Ting-Lu to force recovery from defensive Pokemon like Corviknight and Mega Latias. Spikes can be used instead of Stealth Rock if the team already has a Stealth Rock setter. Spikes also does better long-term damage if all three layers are set, especially to Pokemon that don't run Heavy-Duty Boots such as Gholdengo, Ferrothorn, and Mega Venusaur. Whirlwind is needed to ensure Ting-Lu isn't setup fodder against threats that don't mind taking Ruination such as Volcarona and Swords Dance Gliscor while also helping wear down opposing teams with Ting-Lu's hazards. Finally, Leftovers provides Ting-Lu with passive recovery, healing off weak attacks such as Tornadus-T's U-turn and Dragapult's Shadow Ball while also allowing it to survive attacks it otherwise wouldn't, such as avoiding the 2HKO from Choice Specs Tapu Koko's Dazzling Gleam.</p> <p>A major downside of Ting-Lu is its complete lack of recovery options, making Alomomola a fantastic partner that can also pivot into Water-types such as Urshifu-R and Barraskewda while healing Ting-Lu up with Wish. In return, Ting-Lu makes up for Alomomola's passivity against Gholdengo and Raging Bolt with its defensive profile combined with Whirlwind, wearing them down rapidly. Alomomola also handles Great Tusk for Ting-Lu, which would otherwise threaten Ting-Lu while removing its hazards easily. Another excellent defensive partner is Mega Venusaur, which is able to come in against the Water-, Fighting-, and Grass-types that threaten out Ting-Lu such as Kartana and Iron Valiant while appreciating Ting-Lu's hazard support to wear down opposing teams faster with its wide coverage. On offensive teams where they may not mind Ting-Lu's lack of longevity, Zamazenta, Iron Valiant, and Dragapult all appreciate the chip damage Ting-Lu provides with hazards wearing down defensive switch-ins such as Landorus-T, Mega Venusaur, and Kingambit. Gholdengo in particular is also able to block Defog attempts from Tornadus-T and Corviknight and Rapid Spin from Great Tusk especially if it is holding Air Balloon. Partners like Weavile and Ogerpon-W are also notable, since they can use Knock Off to remove Heavy-Duty Boots from targets like Alomomola and Toxapex, making them much easier to wear down in the long run.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604820, "username": "Sami"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Iron Valiant": {"sets": {"Choice Specs": {}, "Mixed": {}, "Swords Dance": {}}},
  "Ogerpon-Wellspring": {
    "sets": {
      "Swords Dance": {},
      "Offensive Pivot": {
        "description": "<p>Ogerpon-W is an offensive pivot that threatens common defensive Pokemon like Landorus-T, Gliscor, and Heatran. Courtesy of its ability, Ogerpon-W can answer a plethora of offensive Water-types, such as Mega Swampert and Urshifu-R, while ignoring Scald and Flip Turn from Slowbro, Toxapex, and Alomomola. Power Whip OKHOes Ursaluna and Great Tusk after minor chip damage, whereas Horn Leech provides it with longevity in exchange for power. U-turn allows Ogerpon-W to pivot out of checks such as Raging Bolt, Ferrothorn, and Dragonite. Knock Off is used to cripple switch-ins like Dragonite and Ferrothorn by removing their Heavy-Duty Boots and Leftovers, respectively, and also hits Dragapult super effectively. Alternatively, Encore can lock certain defensive pieces into recovery moves such as Toxapex and Mega Scizor. Encore also helps Ogerpon-W avoid mind games against priority moves from Raging Bolt and Kingambit and denies faster Pokemon like Zamazenta from setting up on it. Taunt is also an option to deny entry hazard-setting attempts from walls such as Ferrothorn and Clefable while ensuring Ogerpon-W walls Toxapex and Alomomola. Spikes can be used to wear down checks such as Ferrothorn and Raging Bolt lacking Heavy-Duty Boots, as it has the remarkable ability to force switches.</p> <p>Ogerpon-W commonly fits on bulky offense and balance teams. Pokemon such as Great Tusk and Landorus-T appreciate its presence due to its ability to threaten foes such as Alomomola, Urshifu-R, and Moltres. In return, these teammates can provide entry hazard removal through Rapid Spin and Defog to prevent Ogerpon-W from being worn down quickly. Additionally, Landorus-T can bring it in with U-turn against Pokemon like Alomomola and Gliscor. Ogerpon-W is vulnerable to faster threats such as Iron Valiant and Dragapult, so it appreciates teammates like bulky Volcarona and Pursuit Kingambit to answer Iron Valiant and trap Dragapult, respectively. Ogerpon-W also loves Spikes support from Pokemon like Mega Diancie to wear down checks such as Ferrothorn and Raging Bolt and help rack up chip damage in combination with U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Ogerpon-Cornerstone": {"sets": {"Offensive": {}}},
  "Archaludon": {"sets": {"Rain Wallbreaker": {}}},
  "Hydrapple": {"sets": {"Nasty Plot": {}}},
  "Raging Bolt": {"sets": {"Calm Mind": {}, "Pivot": {}}},
  "Iron Boulder": {"sets": {"Swords Dance": {}}},
  "Iron Crown": {"sets": {"Offensive Pivot": {}, "Assault Vest": {}}},
  "Terapagos": {"sets": {"Offensive Utility": {}}},
  "Pecharunt": {"sets": {"Defensive Pivot": {"description": "<p>104 Special Attack EVs lets Pecharunt break through Zamazenta's Substitute.</p>"}}}
}