{
  "Charizard": {"sets": [{"name": "Choice Specs"}]},
  "Arcanine": {"sets": [{"name": "Utility"}]},
  "Slowbro": {"sets": [{"name": "Defensive"}]},
  "Cloyster": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Gengar": {"sets": [{"name": "Choice Specs"}]},
  "Chansey": {"sets": [{"name": "Defensive"}]},
  "Tauros-Paldea-Fire": {"sets": [{"name": "Physically Defensive"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}]},
  "Ditto": {"sets": [{"name": "Imposter"}]},
  "Dragonite": {"sets": [{"name": "Dragon Dance"}, {"name": "Bulky Dragon Dance"}]},
  "Azumarill": {"sets": [{"name": "Choice Band"}, {"name": "Assault Vest"}]},
  "Umbreon": {"sets": [{"name": "Specially Defensive"}]},
  "Slowking": {"sets": [{"name": "Specially Defensive"}]},
  "Scizor": {"sets": [{"name": "Choice Band"}, {"name": "Offensive"}, {"name": "Offensive Swords Dance"}]},
  "Blissey": {"sets": [{"name": "Defensive"}]},
  "Tyranitar": {"sets": [{"name": "Choice Band"}, {"name": "Defensive"}]},
  "Pelipper": {"sets": [{"name": "Rain Setter"}]},
  "Masquerain": {"sets": [{"name": "Sticky Web"}]},
  "Breloom": {"sets": [{"name": "Focus Sash"}, {"name": "Choice Band"}]},
  "Torkoal": {"sets": [{"name": "Defensive"}]},
  "Salamence": {"sets": [{"name": "Dragon Dance"}]},
  "Floatzel": {"sets": [{"name": "Rain Breaker"}]},
  "Gastrodon": {"sets": [{"name": "Specially Defensive"}]},
  "Garchomp": {"sets": [{"name": "Tank"}, {"name": "Swords Dance"}]},
  "Hippowdon": {"sets": [{"name": "Specially Defensive"}]},
  "Magnezone": {"sets": [{"name": "Choice Specs"}]},
  "Gallade": {"sets": [{"name": "Swords Dance"}]},
  "Rotom-Heat": {"sets": [{"name": "Specially Defensive Pivot"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot"}, {"name": "Trick"}]},
  "Amoonguss": {"sets": [{"name": "Defensive"}]},
  "Alomomola": {"sets": [{"name": "Defensive"}]},
  "Haxorus": {"sets": [{"name": "Swords Dance"}]},
  "Hydreigon": {"sets": [{"name": "Nasty Plot"}]},
  "Volcarona": {"sets": [{"name": "Quiver Dance"}]},
  "Talonflame": {"sets": [{"name": "Defensive Utility"}]},
  "Sylveon": {"sets": [{"name": "Specially Defensive Calm Mind"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Klefki": {"sets": [{"name": "Trick Room Setter"}]},
  "Avalugg": {"sets": [{"name": "Defensive"}]},
  "Toxapex": {"sets": [{"name": "The Pex"}]},
  "Mimikyu": {"sets": [{"name": "Swords Dance"}]},
  "Corviknight": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Physically defensive Corviknight is a fantastic check to dangerous attackers like Garchomp, Roaring Moon, and Dragonite, an effective slow pivot, and one of the few viable entry hazard removers. The choice between Brave Bird and Body Press comes down to team need; Brave Bird nails Great Tusk and has no immunities, while Body Press is Corviknight's best option against Kingambit and Chien-Pao. Leftovers is the preferred item to provide extra longevity, but Rocky Helmet can further punish physical attackers, especially on weak hits like Scizor's and Meowscarada's U-turn. Tera Water serves as an emergency check to dangerous Fire-types like Cinderace, while Tera Ground surprises Iron Hands and Iron Moth.</p> <p>Corviknight is a fantastic slow pivot, making it a great partner for frail-but-powerful teammates like Chien-Pao and Iron Valiant. It is also one of the few viable Defoggers, allowing it to partner up with teammates like Dragonite, Chien-Pao, and Volcarona that loathe Stealth Rock. Be warned, Corviknight is utterly unable to Defog against Gholdengo, so secondary entry hazard removal like Great Tusk and a reliable switch-in like Ting-Lu are recommended. Corviknight is unable to handle powerful physical Fire-types like Cinderace and Ceruledge and Electric-types like Iron Hands. Teammates that can cover these weaknesses like Dondozo and Great Tusk are wonderful partners. Its middling special bulk makes teammates like Slowking and Ting-Lu valuable. Slowking has the added benefit of being another slow pivot as well, while Ting-Lu forms a strong entry hazard core with Corviknight and threatens Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 487308, "username": "BT89"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Barraskewda": {"sets": [{"name": "Rain Sweeper"}]},
  "Polteageist": {"sets": [{"name": "Shell Smash"}]},
  "Hatterene": {"sets": [{"name": "Calm Mind"}, {"name": "Healing Wish"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Pincurchin": {"sets": [{"name": "Terrain Setter"}]},
  "Indeedee": {"sets": [{"name": "Choice Scarf"}, {"name": "Terrain Setter"}]},
  "Dragapult": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Possessing OU's highest unboosted Speed tier makes Choice Specs Dragapult a very remarkable special wallbreaker, revenge killer, and offensive pivot. It outspeeds and threatens common offensive threats like Cinderace, Iron Moth, and even boosted foes like Choice Scarf Rotom-W and Adamant Dragonite after a Dragon Dance. Moreover, it's immune or resistant to common priority attacks like the aforementioned Dragonite's Extreme Speed, Breloom's Mach Punch, and Slither Wing's First Impression, which makes it much harder to revenge kill. A coverage move in either Flamethrower or Thunder lets Dragapult nail Corviknight, with the former also hitting other Steel-types like Kingambit and Iron Treads, while the latter pressures Toxapex and Tera Water Garganacl. Infiltrator allows Dragapult to bypass Grimmsnarl's dual screens, Orthworm's Shed Tail, and Substitute users like Gholdengo, which gives it an edge against hyper offense teams. Tera Ghost maintains an immunity to Dragonite's Extreme Speed and strengthens Shadow Ball;its most spammable attack;notably guaranteeing the 2HKO on Corviknight and Assault Vest Iron Treads after Terastallizing. Tera Fairy prevents Dragapult from being picked off by opposing Dragapult and Sucker Punch from Chien-Pao, Kingambit, and Meowscarada. Finally, Tera Dragon turns Draco Meteor into an even more powerful nuke. This takes advantage of the lack of prominent bulky Steel- and Fairy-types in the metagame, notably chunking answers to Ghost-types like Purifying Salt Garganacl and Ting-Lu and 2HKOing Unaware Clodsire.</p> <p>Choice Specs Dragapult fits perfectly on bulky offense and VoltTurn teams. Physical wallbreakers like Chien-Pao and Great Tusk appreciate Dragapult's U-turn bringing them in safely, and they are able to pressure its switch-ins like Clodsire, Ting-Lu, Blissey, and Garganacl. Entry hazard removers like Corviknight and Great Tusk allow Dragapult to pivot throughout the game unperturbed; the former can also pivot it in safely via U-turn, letting it threaten Gholdengo, which tends to switch into Corviknight to block its Defog. Furthermore, Corviknight and Great Tusk provide the necessary defensive backbone to switch into boosted threats such as Roaring Moon, as well as revenge kill attempts from Sucker Punch users like Kingambit and Chien-Pao. Gholdengo forms a Ghost spam core with Dragapult, as it can overwhelm a shared check in Ting-Lu, use non-Calm Mind Blissey as setup fodder, and either cripple Tera Water Garganacl with Trick or straight up dent Tera Fairy variants. Entry hazards from Ting-Lu, Garchomp, and Garganacl can quickly put foes into Dragapult's KO range, especially as it tends to force a lot of switches; in return, Dragapult spinblocks foes like Great Tusk and Iron Treads in a pinch. Setup sweepers like Volcarona, Iron Valiant, and Swords Dance Chien-Pao appreciate Dragapult wallbreaking early-game for them to clean up late-game easily.</p> "
      },
      {"name": "Utility"},
      {"name": "Choice Band"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Meowscarada": {"sets": [{"name": "Pivot"}, {"name": "Choice Band"}, {"name": "Choice Scarf"}, {"name": "Lead"}]},
  "Skeledirge": {"sets": [{"name": "Bulky Attacker"}]},
  "Quaquaval": {"sets": [{"name": "Bulk Up"}, {"name": "Swords Dance"}]},
  "Lokix": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Pawmot": {"sets": [{"name": "Utility"}, {"name": "Offensive"}]},
  "Maushold": {"sets": [{"name": "Skill"}]},
  "Garganacl": {"sets": [{"name": "Defensive"}, {"name": "Stealth Rock"}]},
  "Ceruledge": {"sets": [{"name": "Bulk Up"}, {"name": "Swords Dance"}]},
  "Kilowattrel": {"sets": [{"name": "Rain Sweeper"}]},
  "Scovillain": {"sets": [{"name": "Sun Sweeper"}]},
  "Rabsca": {"sets": [{"name": "Trick Room Setter"}]},
  "Espathra": {"sets": [{"name": "Calm Mind"}]},
  "Orthworm": {"sets": [{"name": "Shed Tail Support"}]},
  "Glimmora": {"sets": [{"name": "Focus Sash"}, {"name": "Offensive"}]},
  "Cetitan": {"sets": [{"name": "Slush Rush Sweeper"}]},
  "Dondozo": {"sets": [{"name": "Wall"}, {"name": "Curse"}]},
  "Clodsire": {"sets": [{"name": "Defensive"}]},
  "Kingambit": {"sets": [{"name": "Offensive"}]},
  "Great Tusk": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Great Tusk has a solid niche as a defensive Pokemon by virtue of its utility, movepool, bulk, and typing. It can adequately check Pokemon like Kingambit, Cinderace, and Iron Hands, threatening them with a strong Earthquake in return. Stealth Rock lets Great Tusk compress even more roles, chipping away at the opposition. If another Stealth Rock user is already on the team, however, Body Press can take advantage of its high Defense stat and better threaten the likes of Ting-Lu and Roaring Moon. Body Press also lets Great Tusk catch Rotom-W with greater chip damage than Knock Off does on the switch. Knock Off provides valuable item removal, getting rid of Leftovers from Pokemon like Dondozo, Corviknight, and Hatterene, as well as Heavy-Duty Boots from Volcarona and Dragonite. Additionally, Knock Off is Great Tusk's only initial way to hit Air Balloon Gholdengo, which can't OHKO this defensive set. Rapid Spin, besides clearing entry hazards, also allows Great Tusk to outspeed faster foes like Focus Sash Glimmora and Gholdengo. Tera Fighting gets rid of Great Tusk's Ground typing, giving it a better matchup against Pokemon like Chien-Pao while also strengthening Body Press if it is used. Alternatively, Tera Steel can give Great Tusk valuable resistances to Fairy, Grass, and Ice, turning the tables on Hatterene and Chien-Pao. Leftovers greatly increases Great Tusk's longevity; however, Rocky Helmet can be used to wear down Pokemon like Scizor and Cinderace over time.</p> <p>After Great Tusk sets Stealth Rock, Corviknight effortlessly switches in and uses Defog to remove entry hazards, so Pokemon like Cinderace, Gholdengo, and Rotom-W that handle it are great partners. With no good way to hit Flying-types and Pokemon that use Tera Flying, Great Tusk can be set up on very quickly, most notably against the likes of Dragonite and Roaring Moon;even though the former dislikes Knock Off. Therefore, checks to these such as Dondozo and Corviknight are appreciated. A different Stealth Rock setter like Garganacl or Ting-Lu lets Great Tusk comfortably run Body Press without losing out on anything major. Ting-Lu also forms a potent entry hazard-stacking core with Great Tusk via Spikes. Further, it takes on the special attackers that Great Tusk struggles with, like Gholdengo, Choice Specs Dragapult, and Volcarona. Great Tusk is forced out by wallbreakers like Iron Valiant and Quaquaval, so teammates that can check them like Amoonguss and Toxapex are welcome. Pokemon like Chien-Pao, Ceruledge, and Iron Moth appreciate the entry hazard removal that Great Tusk provides. Great Tusk's defensive qualities greatly help frail wallbreakers like Dragapult, Iron Valiant, and Chien-Pao, as these Pokemon need strong defensive Pokemon to fall back on very often.</p> "
      },
      {"name": "Offensive"},
      {"name": "Choice Band"},
      {"name": "Bulk Up"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}]}
  },
  "Scream Tail": {"sets": [{"name": "Defensive"}]},
  "Brute Bonnet": {"sets": [{"name": "Offensive"}]},
  "Slither Wing": {"sets": [{"name": "Defensive"}, {"name": "Choice Band"}]},
  "Sandy Shocks": {"sets": [{"name": "Choice Specs"}]},
  "Iron Treads": {"sets": [{"name": "Offensive"}, {"name": "Utility"}, {"name": "Assault Vest"}]},
  "Iron Hands": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Iron Jugulis": {"sets": [{"name": "Choice Specs"}]},
  "Iron Moth": {"sets": [{"name": "Offensive"}, {"name": "Agility"}]},
  "Iron Thorns": {"sets": [{"name": "Offensive"}]},
  "Baxcalibur": {"sets": [{"name": "Offensive"}]},
  "Gholdengo": {
    "sets": [
      {"name": "Defensive"},
      {
        "name": "Air Balloon",
        "description": "<p>Thanks to its great typing and Good as Gold, Gholdengo is a setup sweeper that's notably difficult to deal with. Having an additional Ground immunity with Air Balloon further improves Gholdengo's already great typing, letting it switch in on Pokemon that otherwise threaten it, such as Garchomp and Iron Treads. This is especially useful against the latter, as Air Balloon strengthens Gholdengo's ability to block entry hazard removal. Maximum Speed investment is for outspeeding Dragonite and uninvested Great Tusk. 252 Special Attack EVs and Nasty Plot makes Gholdengo's STAB moves very threatening against neutral foes. Fighting and Dark Tera types give Gholdengo the option to Terastallize defensively; notably, Tera Fighting lessens the impact of moves like Crunch from Chien-Pao and Roaring Moon. Tera Dark is useful in a pinch to resist attacks such as Shadow Ball from Dragapult and opposing Gholdengo.</p> <p>Entry hazard setters like Great Tusk and Glimmora are the most profitable teammates for Gholdengo, as its ability and typing ensure that their entry hazards stay around as long as Gholdengo does. Hyper offense staples such as Chien-Pao and Iron Valiant benefit greatly from the constant presence of entry hazards to break down bulkier cores; in return, Gholdengo gets teammates that synergize with its role as a wallbreaker, applying heavy pressure throughout a game to Pokemon like Ting-Lu and Rotom-W. Offensive Pokemon that outspeed and OHKO Gholdengo, such as Cinderace, Chien-Pao, Roaring Moon, and Knock Off variants of Great Tusk, threaten to completely shut down Gholdengo; defensive teammates like Garganacl, Dondozo and Skeledirge can help mitigate some of these weaknesses.</p> "
      },
      {"name": "Choice Scarf"},
      {"name": "Choice Specs"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 487308, "username": "BT89"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 359575, "username": "Nichalho"}]}
  },
  "Chien-Pao": {
    "sets": [
      {
        "name": "All-out Attacker",
        "description": "<p>By virtue of its high Speed and Attack, excellent offensive STAB combination, and unique ability Sword of Ruin, Chien-Pao is one of the tier's defining wallbreakers and late-game cleaners. Icicle Crash is preferred over Ice Spinner as it avoids Rocky Helmet and Rough Skin chip and boasts higher power and a chance to flinch. However, Ice Spinner can also be used as a guaranteed safe option if your team cannot afford missing. Sacred Sword offers good coverage that hits important metagame threats that resist Chien-Pao's STAB combination, such as Kingambit. Tera Dark is the preferred option to eliminate Chien-Pao's Stealth Rock weakness and power up Crunch and Sucker Punch to monstrous levels, enabling Life Orb Chien-Pao to cleanly 2HKO Toxapex. Tera Ice is an alternative that boosts Ice Shard enough to always OHKO Dragapult after Stealth Rock damage.</p> <p>All-out attacking Chien-Pao is best used as a midgame wallbreaker on offensive teams that can take advantage of its high damage output and wide coverage to punch holes in the opposing defensive core. Late-game cleaners that can take advantage of Chien-Pao's wallbreaking capabilities include Iron Valiant and Dragon Dance Dragonite. Chien-Pao can struggle with bulky Water-types such as Dondozo, Azumarill, and physically defensive Quaquaval. Rotom-Wash is a good partner that can switch into these Water-types and either gain momentum with Volt Switch or cripple them with Will-O-Wisp. If running Life Orb over Heavy-Duty Boots, entry hazard control from Great Tusk or Hatterene is greatly appreciated. Great Tusk and Hatterene can also use their great physical bulk and quadruple resistance, respectively, to switch into Fighting-type attacks aimed at Chien-Pao.</p> "
      },
      {"name": "Choice Band"}
    ]
  },
  "Ting-Lu": {"sets": [{"name": "Defensive"}]},
  "Roaring Moon": {"sets": [{"name": "Booster Energy"}, {"name": "Bulky Pivot"}, {"name": "Choice Band"}]},
  "Iron Valiant": {"sets": [{"name": "Calm Mind"}, {"name": "Choice Specs"}, {"name": "Mixed"}]}
}