{
  "Arcanine-Hisui": {"sets": {"Choice Band": {}}},
  "Dragonite": {
    "overview": "<ul> <li> <p>Dragonite's great movepool, well-rounded stats, great ability in Inner Focus that makes it immune to Fake Out and Intimidate from Incineroar, and stellar matchups into threats like Urshifu-R, Rillaboom, and Ogerpon-W makes Dragonite a great Pokemon in Regulation F.</p> </li> <li> <p>When holding a Choice Band, Dragonite becomes one of the scariest Pokemon in the metagame for its breaking power. Its best partner, Chien-Pao, supports it with Sword of Ruin and pressures Pokemon that prevent Extreme Speed, such as Indeedee and Flutter Mane. Dragonite and Chien-Pao also are good into Rillaboom and Ogerpon-W, making Dondozo and Tatsugiri, which struggle with these two, great partners as well.</p> </li> <li> <p>Flutter Mane is also a great partner, as it breaks through Iron Hands and Gholdengo for Dragonite, while Dragonite is a great switch into Scarf Urshifu-R and Rillaboom.</p> </li> </ul>",
    "sets": {
      "Choice Band": {
        "description": "<ul> <li> <p>Extreme Speed is a priority move that hits the majority of the metagame for neutral damage, making it ideal to lock into.</p> </li> <li> <p>Aerial Ace allows Dragonite to OHKO Pokemon like Urshifu-R, Rillaboom, and Amoongus without having to be lock into Outrage. Aqua Jet is secondary priority and allows it to double up with its partner on Ghost-types like Flutter Mane, and Ice Spinner allows it to remove Indeedee-F's Psychic Terrain while still having coverage for Pokemon like Rillaboom and Amoongus.</p> </li> <li> <p>Outrage is used as its Dragon-type STAB move and allows it to OHKO almost the entire metagame.</p> </li> <li> <p>Stomping Tantrum gives coverage into Steel-types like Kingambit and Archaludon.</p> </li> <li> <p>The Speed EVs allow Dragonite to outspeed Dragapult in Tailwind, with the remaining EVs maximize its Attack and round out its bulk, allowing it to live attacks such as Choice Specs Flutter Mane's Dazzling Gleam</p> </li> <li> <p>Normal is used as the Tera type, boosting Dragonite's Extreme Speed to stellar levels of power and removing its weaknesses to common Fairy- and Ice-type moves.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Porygon2": {"sets": {"Mixed Support": {}}},
  "Smeargle": {
    "overview": "<ul> <li> <p>Smeargle is a Pokemon with access to a strong supportive movepool, allowing it to function as a niche supportive option with great role compression.</p> </li> <li> <p>Smeargle works well alongside Urshifu-S, especially Choice Band variants. Along with Follow Me support, Wide Guard can protect Urshifu from common super effective spread moves like Dazzling Gleam and Bleakwind Storm.</p> </li> <li> <p>Smeargle's biggest weakness is its abysmal stats, necessitating the use of Focus Sash in order to give it any survivability. Due to it's dreadful Attack stat, it cannot provide any offensive pressure outside of Endeavor, and so it is almost completely reliant on its partner to deal damage.</p> </li> </ul>",
    "sets": {"Support": {"description": "<ul> <li> <p>Burning Bulwark can be used to dissuade Fake Out and potentially burn physical attackers; however, Spiky Shield can be considered to block certain status effects and bypass opposing Focus Sashes.</p> </li> <li> <p>Decorate can punish passive play in front of Fake Out pressure and should be used alongside Pokemon slower than Smeargle in order to immediately threaten +2 attacks.</p> </li> <li> <p>The invested bulk allows Smeargle to survive a Tachyon Cutter from Iron Crown and almost always survive a Surging Strikes from Urshifu-R after Terastallizing into Grass.</p> </li> <li> <p>Tera Grass is generally preferred to be immune to Spore, though Tera Ghost can be used for a Fake Out immunity.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "Jesuuuus", "user_id": 627748}], "teams": [{"name": "Quality checked by", "members": [{"username": "Choruto", "user_id": 646006}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Entei": {
    "overview": "<ul> <li> <p>Entei is a strong offensive threat thanks to its amazing movepool, and access to Sacred Fire and Extreme Speed. Its great defensive stats combined with the immunity to Fake Out and Intimidate given by Inner Focus make it difficult to slow down. When next to Chien-Pao, It can threaten to OHKO metagame staples Kingambit, Rillaboom, and frailer Flutter Mane sets.</p> </li> <li> <p>As mentioned above, Chien-Pao is a great partner for Entei as Its Sword of Ruin ability helps Entei get KOs more easily. Chien-Pao can also remove Indeedee-F's Psychic Terrain with Ice Spinner, allowing Entei to click Extreme Speed. Another great partner for Entei is Raging Bolt, which, with its powerful Electric-type moves, especially Thunderclap, can pressure foes resistant to Sacred Fire such as Urshifu-R. Ogerpon-W is also a great partner that can redirect Urshifu-R's Surging Strikes or threaten it with a strong Horn Leech.</p> </li> <li> <p>Despite its strengths, Entei struggles against bulky Water- and Fire- types like Urshifu-R, Terastallized Ogerpon-W, Incineroar, and Gouging Fire, which resist Sacred Fire. All of them also either resist Chien-Pao's Ice-type STAB move or can mitigate it and Entei's damage output. Entei also faces issues against Farigiraf, which blocks Extreme Speed.</p> </li> </ul>",
    "sets": {"Bulky Attacker": {"description": "<ul> <li> <p>Snarl slows down strong special attackers such as Flutter Mane, Raging Bolt, and Iron Crown. Tera Blast can be used instead when using Tera Grass to hit Water-types.</p> </li> <li> <p>Assault Vest helps increase Entei's longevity against special attackers such as Flutter Mane, making Entei even harder to remove taking into account Sacred Fire's burn chance.</p> </li> <li> <p>The EV spread allows Entei to survive a 116 Special Attack Modest Earth Power from Landorus and, when Terastallized, almost always survive Mystic Water Urshifu-R's Tera Water-boosted Surging Strikes, the rest of the EVs are used to maximize its damage output.</p> </li> <li> <p>Tera Grass provides resistances to Water- and Ground- types like Urshifu-R and Landorus, as well as granting a Spore immunity. Tera Normal boosts Entei's Extreme Speed power while also removing its original weaknesses.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "Draxolotl", "user_id": 646065}, {"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Choruto", "user_id": 646006}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Pelipper": {
    "overview": "<ul> <li> <p>Pelipper's Drizzle ability, STAB Hurricane for Pokemon like Amoonguss and Ogerpon-W, and access to Tailwind, make it the premier rain setter.</p> </li> <li> <p>Pelipper is best paired with partners who benefit from like Archaludon and Choice Scarf Urshifu-R, both having incredibly hard-hitting moves in Rain being Electro Shot and Surging Strikes, respectively.</p> </li> <li> <p>Pelipper's mediocre bulk and Speed leave it especially vulnerable to fast threats like Flutter Mane and Chien-Pao. These, combined with Fake Out pressure, can prevent Pelipper from getting up Tailwind and minimize its impact on the game. Drizzle boosting opposing Water-types like Urshifu-R and Ogerpon-W's STAB moves can also make Pelipper disadvantageous long-term.</p> </li> </ul>",
    "sets": {
      "Rain Setter": {
        "description": "<ul> <li> <p>Pelipper can use Wide Guard over Protect to block spread move, most notably Iron Crown's Expanding Force. Pelipper utilizes Weather Ball to obtain strong boosted STAB, threatening Incineroar and Landorus.</p> </li> <li> <p>Pelipper utilizes Rocky Helmet to provide useful chip damage against Fake Out users, Ice Spinner Chien-Pao, and Urshifu-R, but can use Focus Sash for survivability or Damp Rock to extend rain for slower teams.</p> </li> <li> <p>When using Focus Sash, Pelipper should use an alternative spread of 4 Hp / 252 SpA / 252 Spe with a Modest or Timid nature instead, foregoing bulk.</p> </li> <li> <p>The EV spread helps Pelipper survive a Choice Specs Flutter Mane's Moonblast and almost always a Miracle Seed Rillaboom's Wood Hammer. The Speed investment allows Pelipper to outspeed Ogerpon when in Tailwind.</p> </li> <li> <p>Tera Steel helps Pelipper gain resistances to strong threats like Rillaboom and Flutter Mane, giving it a turn to set Tailwind or click Hurricane. Tera Flying can be used to boost Pelipper's damage output and, when fully invested in Special Attack, threaten Amoonguss for an OHKO. Tera Ghost makes Pelipper immune to common moves, being Fake Out and Extreme Speed.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Robbie35646", "user_id": 562330}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Torkoal": {"sets": {"Trick Room Sweeper": {}}},
  "Metagross": {"sets": {"Bulky Attacker": {}}},
  "Registeel": {
    "overview": "<p>*With an extremely high Defense stat and access to the coveted IronPress combination, Registeel serves the role of the format's late-game sweeper. Steel is an incredibly good typing defensively, and Clear Body stops Intimidate from the likes of Incineroar, which could otherwise prevent the OHKO on Flutter Mane with Heavy Slam.</p> <p>*Registeel fits best on balance teams that feature its favorite partners. Incineroar and Amoonguss can slow down the pace of the game, Latias provides crucial speed control in Tailwind, and Rillaboom's Grassy Surge and Fake Out is appreciated by Registeel. Additionally, Latias and Rillaboom threaten Urshifu-R. Similarly, Raging Bolt is also a good Registeel partner, being the premier Urshifu-R counter in the format.</p> <p>*Notable good matchups for Registeel include Rillaboom and Ogerpon-W, both of which get cleanly 2HKOed by Body Press after a single Iron Defense boost. Kingambit also does poorly against Registeel, as Swords Dance can be mitigated by Iron Defense and Body Press hits Kingambit very hard if it does not Terastallize.</p> <p>*However, not all physical attackers are helpless against the IronPress Registeel. Both Urshifu formes can pose a threat, depending on Registeel's choice of Tera type. Chien-Pao can threaten heavy damage with Sacred Sword if Registeel has not used Terastallization. Gholdengo is also a hard counter to Registeel, as it is immune to Body Press and resists Heavy Slam while also being able to set up with Nasty Plot and break through Registeel's high bulk.</p>",
    "sets": {"IronPress": {"description": "<p>*Heavy Slam allows Registeel to hit opposing Ghost-types like Flutter Mane. 52 Attack EVs allow Heavy Slam to OHKO bulky Flutter Mane.</p> <p>*Leftovers keeps it healthy throughout the game, with Protect providing additional turns of recovery.</p> <p>*Tera Water is the standard Tera Type for Registeel, allowing it to resist Urshifu-R's Surging Strikes and being a generally good defensive typing. However, with the rise of Urshifu-S, Tera Fairy is a viable option to resist Wicked Blow and Fighting-type moves while also being neutral into the majority of the metagame. Be careful using this, however as Teratallized Urshifu-R threatens a 2HKO with Surging Strikes, and Landorus can easily pin you with Earth Power and Sludge Bomb.</p> <p>*The Special Defense investment allows Registeel to almost always survive Timid Earth Power from Landorus. The rest of the Defense EVs along with an Impish nature maximize its damage output.</p>"}},
    "credits": {"writtenBy": [{"username": "SoulboyVGC", "user_id": 558405}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Latias": {
    "overview": "<ul> <li> <p>Latias is an exceptional Tailwind setter thanks to its great bulk, defensive typing, Levitate, and solid Speed. It also checks common threats such as Landorus and Urshifu-R.</p> </li> <li> <p>Assault Vest Kingambit is a great partner, beating most of Latias's counters like Flutter Mane, Gholdengo, and, to an extent, Incineroar. It also makes great use of Tailwind, and Latias beats most of its counters as well.</p> </li> <li> <p>Latias can be very tough to remove especially if it Terastallizes into a Poison-type, which, when combined with Levitate, has only one weakness and many valuable resistances. This becomes extra apparent when using Recover, which lets it clean up late-game when positioned well, especially if Mist Ball gets some Special Attack drops.</p> </li> </ul>",
    "sets": {"Bulky Tailwind Setter": {"description": "<ul> <li> <p>Ice Beam is great coverage in general and very important for OHKOing Landorus, one of Latias's best and most important matchups.</p> </li> <li> <p>Rocky Helmet lets Latias punish common and important moves like Fake Out and U-turn. It also breaks Chien-Pao's Focus Sash if it opts to run Ice Spinner and heavily discourages the prevalent Urshifu-R from attacking it.</p> </li> <li> <p>The Speed EVs allow it to outspeed max Speed Landorus, the Special Attack EVs let it OHKO Urshifu-R and Landorus more consistently, and the rest of the EVs are used to optimize its bulk.</p> </li> <li> <p>Tera Poison, when paired with Levitate, makes Latias very difficult to break, as Psychic-types, besides opposing Latias, are not common, and the Poison typing offers resistances to many relevant offensive types, the most important of which being Fairy, because of Flutter Mane.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "Robbie35646", "user_id": 562330}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sole Survivor", "user_id": 518634}]}, {"name": "Grammar checked by", "members": [{"username": "yoko", "user_id": 617542}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Heatran": {
    "overview": "<ul> <li> <p>Heatran is a niche bulky offensive threat thanks to its solid stats and great typing, bolstered by Flash Fire. This makes Heatran have an incredible matchup against most of the metagame, such as Flutter Mane and Gholdengo.</p> </li> <li> <p>Rillaboom is a great partner for Heatran, as it resists Heatran's prominent weaknesses, while also hitting Pokemon like Ogerpon-W and Urshifu-R for huge damage. Heatran also pairs well with Ogerpon-W, which supports Heatran with Follow Me, as well as threatening Urshifu-R and Landorus.</p> </li> <li> <p>Although Heatran resists a lot of attacks with its typing, it's weak to both of the Urshifu formes, Ogerpon-W, Landorus, and Iron Hands. Heatran also faces tough Fire- and Steel- competition, especially with Incineroar.</p> </li> </ul>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>The combination of Heatran's STAB moves, Heat Wave and Flash Cannon, can hit a lot of Pokemon in the metagame super-effectively, while Earth Power is a good coverage move that can hit Pokemon that resist Heatran's STAB combination, like Incineroar. Magma Storm is also another option as a Fire-type attack, as it traps the opponent, which works well with Leftovers.</p> </li> <li> <p>Leftovers is a good item choice for Heatran, as it can live two Shadow Balls from Flutter Mane with a Special Attack-Booster Energy, and with Rillaboom's Grassy Surge, Heatran can constantly restore HP. Life Orb can increase Heatran's damage output, making it more of a threat.</p> </li> <li> <p>228 HP, 84 Defense EVs, and 20 Special Defense EVs allow Heatran to take an Ivy Cudgel from Ogerpon-W, almost always survives a Sludge Bomb from Landorus after Heatran Terastallizes and Life Orb recoil, and finally, with 20 Speed EVs, Heatran outspeeds both Urshifu formes after a Speed drop.</p> </li> <li> <p>Tera Grass is an excellent Tera type for Heatran, allowing it to resist Water- and Ground-type moves from the likes of Pokemon like Urshifu-R and Landorus. Tera Fairy can allow Heatran to resist Urshifu-S's STAB moves and be a neutral type against the metagame.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "4Kuser", "user_id": 651372}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Cresselia": {"sets": {"Trick Room Support": {}}},
  "Whimsicott": {
    "overview": "<ul> <li> <p>Whimsicott's combination of a good supportive movepool, great Fairy typing allowing it to threaten Pokemon like both Urishifu formes, and Prankster makes it a good utility Pokemon in Regulation F.</p> </li> <li> <p>Whimsicott enjoys fast threats like Flutter Mane, Urshifu formes, and Landorus, which can exploit its Tailwind</p> </li> <li> <p>Whimsicott also can use Beat Up to form a niche but lethal combination with Pokemon like Terrakion.</p> </li> <li> <p>Whimsicott struggles against faster Pokemon with super effective STAB moves like Tornadus and Chien-Pao, so Pokemon who can deal with these two like Flutter Mane and Raging Bolt are helpful to have.</p> </li> </ul>",
    "sets": {
      "Sun Setter": {
        "description": "<ul> <li> <p>Moonblast keeps Whimsicott from being passive and hits threats like Raging Bolt and Urshifu-S for super effective damage.</p> </li> <li> <p>Whimsicott can opt for Beat Up instead, allowing it to trigger Annihilape's Rage Fist and Terrakion's Justified ability.</p> </li> <li> <p>Sunny Day activates Pokemon like Flutter Mane and Raging Bolts's abilities, making them more potent threats, as well as weakening Urshifu-R and Ogerpon-W.</p> </li> <li> <p>The fourth move slot is customizable; Fake Tears allows Whimsicott to weaken Pokemon for partners like Flutter Mane and Landorus, Encore locks foes into unfavorable moves like Protect and Fake Out, Taunt helps shut down more passive Pokemon like Amoonguss and opposing Whimsicott.</p> </li> <li> <p>The EV spread allows Whimsicott to live Tornadus's Bleakwind Storm and outspeed Maximum Speed Tornadus.</p> </li> <li> <p>Tera Water grants Whimsicott valuable resistances to Fire-, Ice-, and Steel-types like Incineroar, Chien-Pao, and Kingambit while generally being a great defensive typing.</p> </li> <li> <p>Covert Cloak allows Whimsicott to be immune to Fake Out.</p> </li> </ul>"
      },
      "Offensive Utility": {"description": "<ul> <li> <p>Protect is valuable for dealing with Fake Out, but it does not allow to fit Sunny Day.</p> </li> <li> <p>Tera Ghost makes Whimsicott immune to common priority moves like Fake Out and Extreme Speed as well as providing a resistance to Poison-type moves like Landorus' Sludge Bomb.</p> </li> <li> <p>Focus Sash allows Whimsicott to have another chance to set up Tailwind or support its team later on in the game, as its mediocre defensive stats and plethora of weaknesses otherwise leave it potentially OHKOd by most Pokemon in the metagame.</p> </li> <li> <p>Note that if Whimsicott is running Beat Up, an EV spread of 252 HP / 4 Def / 252 Spe with a Jolly Nature is more optimal.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Amoonguss": {
    "overview": "<ul> <li> <p>Amoonguss excels as a support Pokemon thanks to its great defensive typing and toolkit. Regenerator gives Amoonguss longevity and allows it to constantly answer Urshifu-R, Iron Hands, and Flutter Mane with Rage Powder throughout the game.</p> </li> <li> <p>Amoonguss appreciates Incineroar allowing it to pivot to activate Regenerator, as well as the Intimidate and Fake Out support Incineroar provides after pivoting in. Incineroar also helps Amoonguss by pressuring the powder-immune Grass-types and weakening threats like Chien-Pao and opposing Incineroar, while Amoonguss can keep it healthy through Pollen Puff and protect it from Pokemon like Urshifu-R and Flutter Mane in return.</p> </li> <li> <p>Amoonguss also pairs well with frail offensive Pokemon like Urshifu-R, which threatens problematic Fire-types like Incineroar and Entei. Amoonguss can also protect Urshifu-R from Flutter Mane and Raging Bolt through Rage Powder.</p> </li> <li> <p>Amoonguss struggles against Pokemon like Entei and Chi-Yu, which threaten to OHKO it, as well as Grass-types like Rillaboom or opposing Amoonguss who can ignore it. Ogerpon-W with Follow Me can be an issue because it restricts Amoonguss from putting foes to sleep.</p> </li> </ul>",
    "sets": {
      "Bulky Support": {
        "description": "<ul> <li> <p>Amoonguss can use Spore to disable the majority of the metagame and enable offensive partners in the process. It can also use Pollen Puff to keep its partners healthy as well as pressure Ogerpon-W with super effective chip damage</p> </li> <li> <p>Amoonguss can utilize Sitrus Berry for burst healing and to survive the 2HKO from Choice Specs Flutter Mane's Shadow Ball. It can also opt for Rocky Helmet to punish physical attackers, especially Urshifu-R.</p> </li> <li> <p>The HP EVS optimize Sitrus Berry recovery, and in conjunction with the Defense and Special Defense EVs, it survives the OHKO from Adamant Chien-Pao Ice Spinner and the 2HKO from Gholdengo's Shadow Ball, respectively.</p> </li> <li> <p>Amoonguss makes use of Tera Water, as it synergizes with its original typing while keeping a resistance to Water. This enables it to take on Entei, Chien-Pao, and Incineroar while keeping its role as a consistent Urshifu-R answer. This is great for Amoonguss as many of these Pokemon like to partner together.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sole Survivor", "user_id": 518634}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Volcarona": {
    "overview": "<ul> <li> <p>Volcarona is a great setup Pokemon thanks to the superb Quiver Dance and great stats across the board. Volcarona can consistently set up in front of Rillaboom, Raging Bolt, Gholdengo, and, to an extent, Flutter Mane, thanks to its typing and a relatively fast Quiver Dance.</p> </li> <li> <p>Volcarona appreciates redirection from Ogerpon-W and Amoonguss, Intimidate Pokemon such as Incineroar and Landorus-T, and Fake Out Pokemon like Rillaboom. All of these generate free turns for Volcarona to set up for a sweep. Rillaboom also provides it with Grassy Terrain recovery, which can make Volcarona extremely hard to bring down.</p> </li> <li> <p>Volcarona struggles against Fire-type physical attackers like Incineroar, Entei, and Terastallized Ogerpon-H, which wall it and threaten it for massive damage without the fear of being burned. Urshifu-R and Ogerpon-W also force a Terastallization, though they can be handled if Volcarona sets up enough Quiver Dances.</p> </li> </ul>",
    "sets": {
      "Quiver Dance": {
        "description": "<ul> <li> <p>Volcarona prefers Flamethrower as its Fire-type STAB move for the OHKO on Amoonguss at +1 and the OHKOs on Assault Vest Rillaboom and Kingambit when at +2. Giga Drain is Volcarona's choice of coverage to hit Urshifu-R, as well as the recovery helping it stick on the field longer.</p> </li> <li> <p>Leftovers' recovery is most effective, as Volcarona is intended to stay on the field from start to finish, Giga Drain and common support enables this.</p> </li> <li> <p>The EVs allow Volcarona to survive Ogerpon-W's Ivy Cudgel, and, when Terastallized and at +1 Special Defense, two Special Attack Booster Energy Flutter Mane Dazzling Gleams. The Speed investment allows for Volcarona to outspeed unboosted Iron Bundle after a Quiver Dance, and the remaining EVs are used to maximize damage.</p> </li> <li> <p>Even when boosted, Volcarona will struggle against the aforementioned Fire-types, so Landorus and Urshifu-R make great teammates. Volcarona is a great answer to Flutter Mane and Rillaboom in return.</p> </li> <li> <p>Volcarona runs Tera Dragon, as it synergizes with its original typing. This helps against Urshifu-R and resists both of Ogerpon-W's STAB moves, without bringing weaknesses to the Fire- and Flying-types it already struggles with. Volcarona's Fire typing handles the Fairy- and Ice- weaknesses, making Terastallization all the more safe.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Tornadus": {
    "overview": "<ul> <li> <p>Tornadus is one of the strongest support Pokemon bearing a great toolkit, including Tailwind, Taunt, Rain Dance, and Sunny Day. Prankster provides great speed and weather control. It has a great matchup against Rillaboom and Amoonguss, thanks to Bleakwind Storm, a great spread move which gives it a field presence, and Taunt.</p> </li> <li> <p>Tornadus has amazing synergy with Urshifu-R and fast Pokemon like Flutter Mane, Chien-Pao, and Landorus, which define the archetype of tailwind hyper offense.</p> </li> <li> <p>Tornadus can become vulnerable to certain threats like Urshifu-R, Chien-Pao, and opposing Taunt Tornadus depending on its item choice. Focus Sash struggles against Urshifu-R, and items like Covert Cloak and Mental Herb struggle against Chien-Pao. Rocky Helmet matches poorly into Fake Out and Taunt pressure.</p> </li> <li> <p>Tornadus struggles to create field pressure as a singular Pokemon. It cannot Taunt Pokemon like Farigiraf and Indeedee due to their respective abilities blocking priority. Chien-Pao, Raging Bolt, Iron Hands and Archaludon are bad matchups for it because of their ability to quickly remove it from the field.</p> </li> </ul>",
    "sets": {
      "Bulky Tailwind": {
        "description": "<ul> <li> <p>Bleakwind Storm provides good damage into Rillaboom and Ogerpon-W. Tailwind is the most effective speed control Tornadus has access to. Taunt helps shut down Amoonguss and helps to manage certain Trick Room Pokemon like Porygon2 and Dusclops, but Protect can be run instead to ensure Tailwind goes up. Rain Dance and Sunny Day serve as weather control, which enables your sweepers and disables opposing weather-based sweepers. Rain Dance pairs well with Urshifu-R and Ogerpon-W while Sunny Day powers up Chi-Yu and Flutter Mane.</p> </li> <li> <p>This given EV spread focuses on bulk, surviving Mystic Water Surging Strikes from Urshifu-R and Tera Fairy Choice Specs Moonblast from Flutter Mane. The low Speed investment ensures that Tornadus sets up its own weather.</p> </li> <li> <p>Rocky Helmet helps against Urshifu-R mirrors and provides good chip into opposing physical attackers making contact. Covert Cloak prevents Fake Out flinches from Incineroar and Rillaboom. It also negates any secondary effects from moves like Rock Slide and Icy Wind. This ensures that Tailwind goes up. Mental Herb helps to shrug off one Taunt.</p> </li> <li> <p>Tera Dark provides an immunity to Prankster Taunt, guaranteeing Tailwind. Tera Steel provides useful resistance to Chien-Pao and Flutter Mane's STAB moves. Both Tera types improve matchups into Psyspam and against Electric-type moves from Pokemon like Raging Bolt, Iron Hands and Archaludon.</p> </li> </ul>"
      },
      "Offensive Tailwind": {"description": "<ul> <li> <p>Focus Sash ensures Tornadus survives one attack and set up Tailwind. Protect becomes important to avoid Fake Out without committing the Tera early.</p> </li> <li> <p>Tornadus rarely Terastallizes, but Tera Ghost can ensure that it can more reliably set up Tailwind by negating Fake Out from Pokemon like Incineroar and Rillaboom, and Extreme Speed from Pokemon like Dragonite and Entei. Tera Flying increases its offensive pressure.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "fyfyy", "user_id": 641757}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Landorus": {
    "overview": "<ul> <li> <p>Landorus is one of the best special attackers in the format currently, as its Sheer Force and Life Orb boosted STAB moves devestate opposing teams and nail prominant threats like Archaludon, Kingambit, Incineroar, and Raging Bolt.</p> </li> <li> <p>However, Landorus has a very crowded Speed tier, thus speed control from Pokemon such as Latias and Tornadus is vital against faster checks like Chien-Pao and Choice Scarf Urshifu-R. Both Pokemon also act as excellent Urshifu-R checks themselves.</p> </li> <li> <p>Fake Out users like Rillaboom and Incineroar can be great teammates too, buying time for Landorus to set up Substitute. Rillaboom also serves as another answer to Urshifu-R, while Incineroar helps dampen the damage from opposing Chien-Pao. Other common Landorus checks include Pokemon that can comfortably ignore Earth Power, namely Latias and Tornadus.</p> </li> <li> <p>Ogerpon-W is also a particularly good teammate, as it can redirect and absorb attacks from Chien-Pao and Urshifu-R while dealing decent damage back.</p> </li> </ul>",
    "sets": {
      "Life Orb": {
        "description": "<p>*Earth Power serves as its main STAB attack, allowing it to hit the majority of the format for good damage.</p> <p>*Sludge Bomb is able to deal respectable damage against Ground-resistant foes, such as Rillaboom and Tornadus. Tera Poison can also elevate Sludge Bomb's damage and secure KOs against Rillaboom.</p> <p>*Tera Poison in conjunction with 132 HP and 4 Def EVs lets Landorus survive Surging Strikes from Tera Water Urshifu-R the majority of the time. The remaining EVs are used to maximize its Speed and Special Attack.</p> <p>*A timely Tera Poison lets Landorus live a Tera Fairy-boosted Choice Specs Moonblast from Flutter Mane, as well Ice-type attacks from Chien Pao.</p> <p>*Substitute allows Landorus to punish passive plays, mainly switches and Protect. A well-timed Substitute in front of a Kingambit also prevents Landorus from getting knocked out by a potential Sucker Punch. This move can be substituted for Sandsear Storm on Rain teams or when paired with Rain Dance Tornadus.</p> <p>*A Timid nature can be considered, allowing Landorus to outspeed faster Urshifu-R and Ogerpon-W variants, at the cost of damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Yuichi", "user_id": 435812}], "teams": [{"name": "Quality checked by", "members": [{"username": "Robbie35646", "user_id": 562330}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Landorus-Therian": {
    "overview": "<ul> <li> <p>Historically one of the best physical attackers in VGC, Landorus-T provides damage control in the form of Intimidate while serving as a very effective offensive pivot for balance teams.</p> </li> <li> <p>However, it is currently overshadowed by its Incarnate forme, Landorus, which is able to outdamage Landorus-T, while also facing steep competition from fellow Intimidate user Incineroar. SV also introduced a number of ways to mitigate the effects of Intimidate, further dampening the effectiveness of Landorus-T.</p> </li> <li> <p>Despite these hurdles, Tera Blast finally grants Landorus-T a consistent Flying-type STAB move, allowing it to hit Grass-type checks like Amoonguss, Ogerpon-W and Rillaboom, only missing the OHKO on the former.</p> </li> <li> <p>Equipped with a Choice Scarf for speed control, Landorus-T serves as a consistent check against Electric- and Fire-types. Notable examples include Raging Bolt, Iron Hands, Incineroar, and Entei.</p> </li> <li> <p>Some popular Landorus-T checks include Chien-Pao and Latias, which are able to OHKO it with Ice-type attacks. Ogerpon-W can also force Landorus-T to Terastallize in order to check it, before itself Terastallizing to remove its Flying-type weakness and do huge damage back. This is also true for Urshifu-R.</p> </li> <li> <p>Landorus-T also finds itself struggling to deal enough damage to secure OHKOs against bulkier targets due to its lack of access to strong single target attacks in SV, unlike in previous generations. Chien-Pao is a good partner in this aspect, boosting Landorus-T's damage with its ability, helping to secure OHKOs against Amoonguss and Entei.</p> </li> <li> <p>Other popular teammates include Raging Bolt and Rillaboom to help check Water-types, while Landorus-T can function as a switch in against Landorus. Flutter Mane is able to check both Chien-Pao and Latias, while Intimidate ensures that Flutter Mane survives an attack from opposing Chien-Pao, despite its lacking physical bulk. Landorus-T also helps Flutter Mane by threatening Fairy-resistant foes such as Gholdengo and Tera Poison Landorus.</p> </li> <li> <p>Overall, Landorus-T is still a solid attacker, but faces numerous challenges in Regulation F which prevents it from functioning at its full potential.</p> </li> </ul>",
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li> <p>Choice Scarf allows Landorus-T to outspeed the majority of the format and attack or pivot out against Chien-Pao, breaking a potential Focus Sash.</p> </li> <li> <p>Stomping Tantrum is Landorus-T's most consistent Ground-type STAB move.</p> </li> <li> <p>Tera Flying Tera Blast provides Landorus-T with a usable Flying-type STAB move, allowing it to check Grass- and Fighting-type Pokemon. Tera Flying also removes Landorus-T's weakness to Water, helping it to better check Ogerpon-W and Urshifu-R and avoid being OHKOed by their respective STAB moves. However, Landorus-T has to be careful Terastallizing against Electric-type Pokemon like Iron Hands and Raging Bolt, as Tera would remove its Electric immunity.</p> </li> <li> <p>Rock Slide is a good spread move, allowing Landorus-T to hit Pokemon like opposing Landorus and Tornadus, which are immune to Ground-type moves, without wasting its Tera. Fast Rock Slide also provides a chance to flinch opposing Pokemon before they take action, giving Landorus-T and its teammates an out if push comes to shove.</p> </li> <li> <p>U-turn lets Landorus-T function as a pivot to reapply Intimidate and remove itself from a disadvantageous matchup. It can also do respectable damage against some of its checks, like Chien-Pao, Ogerpon-W and Latias.</p> </li> <li> <p>Adamant can be used over Jolly for more damage, but puts Landorus-T at risk of being outsped by Choice Scarf Urshifu-R.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Yuichi", "user_id": 435812}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Incineroar": {
    "overview": "<ul> <li> <p>Incineroar serves as an extremely good utility Pokemon on all types of teams thanks to its ability Intimidate, as well as its good support movepool including Fake Out and Parting Shot; these traits have great synergy, together letting it come in to hinder the opposing team and pivot out the following turn.</p> </li> <li> <p>Rillaboom and Urshifu-R are good partners for Incineroar, forming a fantastic balance core with it, being able to pivot each other in to cover their respective weaknesses and put pressure on the majority of teams defensive structure.</p> </li> <li> <p>Incineroar can struggle against Water-types like Urshifu-R that force it out, making it appreciate redirection support from Pokemon like Amoonguss; Amoonguss can also provide it with healing and sleep support to make it even harder to remove, and Regenerator makes it consistently easy for it to pivot into Amoonguss. In return, Incineroar can force out other Grass-types like Rillaboom, Whimsicott, and opposing Amoonguss.</p> </li> </ul>",
    "sets": {
      "Offensive Support": {
        "description": "<ul> <li> <p>Knock Off can debilitate Pokemon like Latias, Dondozo, and opposing Incineroar; it also gives Incineroar great synergy with Pokemon like Amoonguss, as it can remove Safety Goggles from foes.</p> </li> <li> <p>Incineroar utilizes Sitrus Berry to extend its longevity late-game, letting it survive Surging Strikes from Urshifu-R, while Safety Goggles helps against Amoonguss.</p> </li> <li> <p>The given EV spread lets Incineroar notably survive two uses of Moonblast from Special Attack Flutter Mane and prevents it from being OHKOed by Iron Bundle's Hydro Pump. It also lets Incineroar outspeed Landorus when in Tailwind.</p> </li> <li> <p>Tera Water is a great defensive typing that allows Incineroar to escape its weaknesses, notably to Urshifu-R's Surging Strikes. Tera Ghost allows Incineroar to become immune to Fake Out and also assists against Dragonite; Tera Grass helps Incineroar answer Urshifu-R and Ogerpon-W and can aid against Amoonguss if Incineroar is not using Safety Goggles.</p> </li> </ul>"
      },
      "Assault Vest": {}
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Robbie35646", "user_id": 562330}]}, {"name": "Grammar checked by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Rillaboom": {
    "overview": "<ul> <li> <p>Rillaboom maintains its status as a premier Fake Out pivot thanks to U-turn, Grassy Glide, and Grassy Terrain. Rillaboom fits on many archetypes and has a wide range of playstyles. Rillaboom is a great counter to Water-types like Urshifu-R and Ogerpon-W, as it is able to switch into their attacks and pressure them for huge damage if not a KO.</p> </li> <li> <p>Assault Vest Rillaboom is the most common set currently, as it checks Flutter Mane, and can switch in on special threats and threaten with Fake Out or Grassy Glide.</p> </li> <li> <p>Common Rillaboom partners include Urshifu-R and Incineroar to complete the Fire / Water / Grass core, and more offensive sets pair well with Entei and Chien-Pao with priority spam. Other great partners are defensive Pokemon such as Calm Mind Raging Bolt that benefit from Grassy Terrain recovery and Fake Out.</p> </li> <li> <p>Common Rillaboom checks include Fire-types, Intimidate Pokemon to greatly reduce Rillaboom's damage output, and Pokemon that resist Grass. This includes Entei, Dragonite, and especially Incineroar.</p> </li> </ul>",
    "sets": {
      "Offensive Pivot": {"description": "<ul> <li> <p>Rillaboom is generally restricted to Fake Out, Wood Hammer, and Grassy Glide, with the 4th move usually being U-turn to pivot and sometimes High Horsepower to check Fire- and Steel-types, that would otherwise completely wall Rillaboom.</p> </li> <li> <p>Rillaboom may run Tera Grass to boost its already high levels of damage, or Tera Fire to stay in on common threats such as Incineroar and Chien-Pao and U-turn out to safely bring in a frailer Pokemon.</p> </li> <li> <p>The EV spread allows Rillaboom to almost always survive Entei's Sacred Fire and avoid the 2HKO from Protosythesis-boosted Flutter Mane's Moonblast while retaliating with a OHKO. Thanks to its priority moves, Rillaboom can afford to not invest in Speed.</p> </li> </ul>"},
      "Offensive Nuke": {
        "description": "<ul> <li> <p>Maximum Attack along with Tera Grass allows Rillaboom to always KO Flutter Mane with Sword of Ruin-boosted Grassy Glide. Protect is favored as the last move, as Rillaboom loses a lot of the bulk from the Assault Vest.</p> </li> <li> <p>This set generally looks for all-or-nothing plays, picking up OHKOs against common tanks such as Iron Hands, Farigiraf, and Ogerpon-W with Wood Hammer, and picking up KOs on frailer pokemon with Grassy Glide.</p> </li> <li> <p>This set can struggle against Intimidate, especially Incineroar, as the sudden drop to its Attack can severely minimize the obsurdity of Rillaboom's attacks, allowing bulkier Pokemon to survive a boosted Wood Hammer.</p> </li> <li> <p>The EV spread allows Rillaboom to survive Tera Stellar Ice Spinner from Chien-Pao at -1 and almost always take Fairy Feather Tera Fairy Flutter Mane's Moonblast. Rillaboom can afford to forgo Speed investment, as it already outspeeds common slow Pokemon like Farigiraf and Incineroar.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "sempra", "user_id": 590686}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Hatterene": {
    "overview": "<ul> <li> <p>Wielding the highest Special Attack of any Pokemon to get Expanding Force and Speed lower than even Amoonguss, Hatterene is the poster child for Trick Room variants of Psychic-type spam teams. It deals with many of the usual Trick Room answers, including Iron Hands and Amoonguss, even being immune to the latter's Spore due to Magic Bounce. Magic Bounce also prevents potential Taunt users from shutting down Trick Room.</p> </li> <li> <p>Hatterene requires two things to succeed; Trick Room and Psychic Terrain. Indeedee-F provides both with Psychic Surge, Trick Room, and Follow Me to help Hatterene set up its own Trick Room. It is nearly impossible to deny Trick Room against a lead of Hatterene and Indeedee-F. Torkoal and Ursaluna deal with Steel-types that resist both of Hatterene's STAB moves, and they also benefit from Trick Room.</p> </li> <li> <p>Aforementioned Steel-types like Gholdengo are tougher to break through for Hatterene, as well as Dark-types that take neutral damage from Dazzling Gleam, such as Incineroar, Kingambit, and Chi-Yu, the latter of which has Snarl to lower Hatterene's damage output. Assault Vest Raging Bolt running Snarl also slows Hatterene down, despite being weak to Dazzling Gleam. Rillaboom changing the terrain, weakening Expanding Force greatly, and allowing priority moves to go through can also be a huge blow to a gameplan involving Hatterene.</p> </li> <li> <p>Lastly, like most Trick Room sweepers, Hatterene is susceptible to Trick Room either being denied or fully stalled out, leaving it defenseless.</p> </li> </ul>",
    "sets": {"Bulky Life Orb Attacker": {"description": "<ul> <li> <p>Tera Psychic boosts Hatterene's damage output to scary levels, allowing it to OHKO Ursaluna-B and have a favorable roll to OHKO bulky Flutter Mane. Alternatively, Tera Fire is a great defensive typing against the Flutter Mane and Chi-Yu combination, as well as Gholdengo.</p> </li> <li> <p>212 HP EVs minimize Life Orb recoil, and 100 Defense EVs alongside them allow Hatterene to always survive Adamant Tera Dark Urshifu-S's Wicked Blow. The rest of the EVs are invested in Special Attack to maximize damage output, and a Quiet nature + 0 Speed IVs ensures you move before minimum Speed Amoonguss in Trick Room.</p> </li> </ul> <p>Written by: https://www.smogon.com/forums/members/soulboyvgc.558405/ Quality checked by: https://www.smogon.com/forums/members/lameliarleo.641287/ Grammar checked by: https://www.smogon.com/forums/members/clouds.356215/</p>"}}
  },
  "Indeedee-F": {"sets": {"Psyspam Support": {}}},
  "Urshifu": {
    "overview": "<ul> <li> <p>Urshifu-S is capable of dealing massive damage with its signature move Wicked Blow and high base Attack, as well as its amazing ability in Unseen Fist, which allows it to bypass Protect and apply constant pressure.</p> </li> <li> <p>Tornadus is a great partner for Urshifu-S, as it provides speed control with Tailwind and can launch powerful Bleakwind Storms into Fighting-types like Urshifu-R that resist Wicked Blow. Many of Urshifu-S's threats, such as Chien-Pao, Flutter Mane, and Urshifu-R naturally outspeed it, so strong speed control is vital. Ogerpon-W can Terastallize to better handle a lot of threats to Urshifu-S such as Chien-Pao, Flutter Mane. and Landorus, and support it with Follow Me. Rillaboom hits most Dark-resistant foes such as Iron Hands and Urshifu-R for high damage, and can support it with Fake Out and priority Grass Glide, which combined with a Sucker Punch from Urshifu-S can OHKO Flutter Mane. In return, Urshifu-S handles Rillaboom's weaknesses, hitting the plethora of Steel- and Dark-types that resist its Grass-type STAB moves such as Kingambit, Incineroar, and Gholdengo.</p> </li> <li> <p>Urshifu-S struggles to break through teams with strong Dark-resistant Pokemon or generally bulky supports like Urshifu-R, Iron Hands, and Tera Fairy Flutter Mane as well as redirection from Amoonguss and Fake Out from Incineroar. Due to its poor defensive typing, middling Speed and lack of coverage, it faces issues against faster teams and its many checks.</p> </li> </ul>",
    "sets": {
      "Focus Sash": {"description": "<ul> <li> <p>Close Combat hits common Dark-resistant Pokemon such as Incineroar and Kingambit. Sucker Punch provides priority and makes up for Urshifu-S's average Speed tier.</p> </li> <li> <p>Urshifu-S uses Tera Dark to fire off strong Wicked Blows or Tera Stellar to boost the damage output of its STAB moves. Tera-boosted Close Combat OHKOes common Incineroar at -1 Attack, and both Tera types will allow Urshifu-S to OHKO Flutter Mane, provided its boost is still intact for Dark-type moves.</p> </li> <li> <p>Focus Sash allows Urshifu-S to survive any one attack, making up for its poor defensive typing. In contrast to Choice items, it gives Urshifu-S the freedom to switch moves and use Detect when threatened, which is especially strong against Fake Out leads.</p> </li> <li> <p>The extra EVs in Defense are to maximize Urshifu-S's chance of surviving a use of Surging Strikes from Tera Water Mystic Water Urshifu-R.</p> </li> </ul>"},
      "Choice Band": {
        "description": "<ul> <li> <p>Choice Band is used to guarantee an OHKO on common targets like Landorus, Ogerpon-H, Flutter Mane, and even Tornadus that are not invested heavily in physical bulk. Even naturally bulky Pokemon such as Dragonite and Walking Wake can be OHKOed or put in the range for minimal damage to KO them.</p> </li> <li> <p>Poison Jab is excellent coverage, hitting the problematic Fairy-types that Urshifu-S normally struggles with. After Terastallization, you can guarantee an OHKO on almost all Rillaboom, Terastallized Flutter mane, and even bulkier pokemon like Tera Fairy Indeedee-F. U-turn is also a viable move as a pivot option.</p> </li> <li> <p>The Attack investment and Adamant nature are necessary to get the KOs mentioned earlier, such as the OHKO on Landorus and Tornadus. The Defense investment allows Urshifu-S to survive the combination of Tera Normal Choice Band Dragonite's Extreme Speed and Sucker Punch from Adamant Chien-Pao. The Special Defense EVs allow Urshifu-S to take a variety of strong attacks such as Earth Power from Landorus and Bleakwind Storm from Tornadus. The remaining EVs are placed in Speed.</p> </li> <li> <p>Tera Poison is chosen to resist the Fighting- and Fairy-type moves that would otherwise hit Urshifu-S super effectively. Urshifu-S is naturally immune to Psychic and has Dark-type moves to cover for the weakness, and it also naturally threatens Psychic-types like Farigiraf. Tera Dark is also an option, as the extra damage combined with Choice Band is absurd and, combined with good Tailwind support and redirection, is a good choice. However, it requires more careful positioning around threats, as Urshifu-S won't be able to Terastallize out of it's Fairy- and Fighting-type weaknesses.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Choruto", "user_id": 646006}], "teams": [{"name": "Quality checked by", "members": [{"username": "zee", "user_id": 501951}]}, {"name": "Grammar checked by", "members": [{"username": "Aera", "user_id": 572981}, {"username": "Clouds", "user_id": 356215}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "overview": "<ul> <li> <p>Urshifu-R is one of the most oppressive Pokemon in the game format due to its high Attack stat, powerful Surging Strikes, and Unseen Fist ability, which allows it to completely ignore Protect. Furthermore, its strong matchups against metagame staples Incineroar, Chien-Pao, and Landorus add to its viability.</p> </li> <li> <p>Urshifu-R is commonly paired with Tornadus, which provides it with Prankster Tailwind support, allowing it to outspeed the entire unboosted metagame; Tornadus also beats Urshifu-R's few checks, such as Ogerpon-W and Amoonguss. Chien-Pao is another common partner, decreasing foes' Defense with Sword of Ruin and checking Amoonguss and Tornadus; Urshifu-R, in return, helps Chien-Pao beat its checks such Entei and as the ubiquitous Incineroar. Incineroar and Rillaboom also make for excellent partners for Urshifu-R, as the trio forms a fundamentally strong Fire-Water-Grass Fire / Water / Grass core, covering each other's weaknesses.</p> </li> <li> <p>Due to all of its strong points, Urshifu-R always has a big target on its back, notably being checked by Pokemon such as Rocky Helmet Amoonguss and Speed Booster Energy Flutter Mane, which is commonly utilized on Tailwind teams, as it can outspeed and OHKO Urshifu-R if it does not Terastallize. Raging Bolt and Rillaboom also immensely pressure Urshifu-R with their priority moves in Thunderclap and Grassy Glide, the former of which may even OHKO Urshifu-R depending on Raging Bolt's Special Attack investment. Rillaboom can also disrupt Urshifu-R and its teammates with Fake Out. Iron Hands comfortably takes even Tera Water-boosted Surging Strikes and can potentially OHKO Urshifu-R back with Wild Charge, so players should be careful to position Urshifu-R into safe and advantageous situations.</p> </li> </ul>",
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li> <p>U-turn allows Urshifu-R to hit Ogerpon-W hard, get around Amoonguss, and pivot between its teammates like Incineroar and Rillaboom. Aqua Jet is a good option to revenge kill weakened Speed Booster Energy Flutter Mane and Sucker Punch Chien-Pao, as well as a way to get around Raging Bolt's Thunderclap. Ice Spinner can be utilized to remove Rillaboom's Grassy Terrain and Indeedee's Psychic Terrain. It also provides Urshifu-R with a way to hit Amoonguss.</p> </li> <li> <p>Choice Scarf lets Urshifu-R get the jump on and threaten an OHKO with Surging Strikes against Pokemon it normally cannot outrun, such as Flutter Mane, Chien-Pao, and Choice Scarf Landorus-T. As an added bonus, Choice Scarf also allows it to outspeed Dragapult.</p> </li> <li> <p>The Special Defense investment lets Urshifu-R always survive a maximum Special Attack Iron Bundle Freeze-Dry and, when Terastallized, a Choice Specs Moonblast from Flutter Mane. The Defense EVs allow Urshifu-R to withstand a Choice Band- and Tera Normal-boosted Extreme Speed from maximum Attack Tera Normal Dragonite with Sword of Ruin active.</p> </li> <li> <p>Urshifu-R is a great beneficiary of Terastallization, as Tera Water allows it to 2HKO almost the entire unresisted metagame while simultaneity getting rid of its Fairy and Flying weaknesses. Urshifu-R can also opt for Tera Poison or Grass, providing a resistance to Rillaboom's Grassy Glide and resistances to Flutter Mane and Raging Bolt's STAB moves, respectively. The latter keeps the Flying weakness but welcomes an immunity to Spore and Rage Powder.</p> </li> </ul>"
      },
      "Mystic Water": {"description": "<ul> <li> <p>Aqua Jet picks off weakened Flutter Mane, Chien-Pao, and Entei, which are normally faster than Urshifu-R.</p> </li> <li> <p>The Defense investment helps Urshifu-R take a Choice Band, Tera Normal Dragonite Extreme Speed from maximum Attack Dragonite even with Sword of Ruin active on the battlefield, as well as a Miracle Seed Rillaboom Grassy Glide. The Special Defense EVs let Urshifu-R almost always survive Thunderclap from Raging Bolt and Dazzling Gleam from Choice Specs Flutter Mane. The Speed EVs let Urshifu-R outspeed -1 Roaring Moon and Adamant Chien-Pao.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "Sole Survivor", "user_id": 518634}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Regidrago": {
    "overview": "<p>*Regidrago is a great offensive Pokemon that has immense damage output and can sweep teams easily thanks to Dragon's Maw and Dragon Energy.</p> <p>*When paired with Pokemon like Tornadus, the Ogerpon formes, and Indeedee that provide speed control, redirection, and priority immunity, respectively, it truly becomes difficult to hinder Regidrago's damage output. Gholdengo is one of its best partners, as it can effectively remove Flutter Mane and Chien-Pao, which are major threats for Regidrago.</p> <p>*Regidrago cannot damage the most influential Pokemon of the format  Flutter Manewith its STAB moves. Its middling Speed makes it vulnerable to faster threats, though with the right support that ensures that all the Fairy-, Steel-types, and common Focus Sash users like Chien-Pao are checked, it can absolutely steamroll teams.</p>",
    "sets": {"Dragon Fang": {"description": "<p>*Draco Meteor allows Regidrago to pick OHKOs when Dragon Energy isn't dealing much damage at low HP, and Earth Power allows it to damage to Steel types like Gholdengo and Kingambit.</p> <p>*Regidrago boosts its damage output with Dragon Fang that stacks on Dragon Maw and does insane damage.</p> <p>*Tera Steel is a great defensive Tera that allows it to resist its original weaknesses.</p>"}},
    "credits": {"writtenBy": [{"username": "fyfyy", "user_id": 641757}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Ursaluna": {"sets": {"Guts Attacker": {}}},
  "Ursaluna-Bloodmoon": {
    "overview": "<ul> <li> <p>Ursaluna-B is a great special attacker thanks to its great bulk and ability in Mind's Eye, which allows it to hit Ghost-types like Flutter Mane. Ursaluna-B also works very well on Trick Room teams, because of its low Speed. Pokemon like Urshifu-R, Landorus, non-Assault Vest Kingambit, and Rillaboom all fear getting OHKOed by Urslauna-B.</p> </li> <li> <p>Even though Ursaluna-B is strong under Trick Room, it still struggles against Amoongus, which can outspeed it under Trick Room and put it to sleep. Therefore, Pokemon like Flutter Mane and Ogerpon-W are recommended teammates. Ogerpon-W can protect Ursaluna-Bloodmoon from attacks like Urshifu-R's Surging Strikes and when Terastallized, Chien-Pao's Icicle Crash. Farigiraf is almost mandatory for this set, as it allows Ursaluna-B to truly shine by setting up an unblockable Trick Room.</p> </li> <li> <p>Ursaluna-B also cannot threaten Assault Vest Rillaboom very well, and Rillaboom can threaten it back with a super effective Grassy Glide or Wood Hammer.</p> </li> </ul>",
    "sets": {"Trick Room Sweeper": {"description": "<ul> <li> <p>Hyper Voice provides Ursaluna-B with a more spammable Normal-type STAB attack, especially during Blood Moon's cooldown.</p> </li> <li> <p>Life Orb is recommended, as it provides Ursaluna-B with a boost to its attacks, and Ursaluna-B doesn't mind the recoil due to its great bulk and ability to consistently move first under Trick Room.</p> </li> <li> <p>The given EV spread lets it live a Tera Fairy Moonblast from a Special Attack Booster Energy Flutter Mane. 0 Speed IVs and a Quiet nature allow it to function better under Trick Room.</p> </li> <li> <p>Tera Normal can be used to boost the damage output of Blood Moon and Hyper Voice to nuclear levels.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Glimmora": {
    "overview": "<ul> <li> <p>Glimmora is a strong offensive threat with access to a good STAB combination and the powerful move Meteor Beam, which, when used with the Power Herb, can melt many targets, such as Assault Vest Entei and Incineroar. With Toxic Debris and signature move Mortal Spin, Glimmora can punish physical attackers and passive play, and, when combined with the threat of Meteor Beam, make it impossible to ignore while also requiring careful positioning to properly handle.</p> </li> <li> <p>Glimmora has traditionally fit best on Dondozo teams, as the combination of Toxic Debris and Mortal Spin means your foes almost guaranteed to be afflicted with poison, putting your opponent on a timer. Assault Vest on Glimmora is especially effective on Dondozo teams, as the extra longevity helps it spread poison better and stall out even longer, making up for the lowered damage output.</p> </li> <li> <p>With Meteor Beam, Glimmora can utilize its high Special Attack stat and good offensive typing as a damage dealer. Tornadus and Ogerpon-W are good partners; Tornadus provides speed control and can launch powerful Bleakwind Storms into Fighting-types that resist Meteor Beam and Ogerpon-W redirects potential Water- or Ground-type attacks while pressuring threats like Urshifu-R and Landorus. In return, Glimmora can threaten Grass-types, which resists both Ogerpon-W's STAB moves.</p> </li> <li> <p>Glimmora's poor defensive typing, combined with its middling bulk and average Speed, makes Glimmora a glass cannon. Glimmora is weak to many prominent offensive threats such as Urshifu-R, Landorus, and Gholdengo. Glimmora also struggles to handle Rock-resistant foes such as Iron Hands, Kingambit, and Urshifu-R. Even then, many of these foes will concede Toxic Spikes while taking out Glimmora; for instance, Urshifu-R will set up both layers of Toxic Spikes if it attacks Glimmora. Amoonguss is another difficult match up, as it absords Toxic Spikes and takes Glimmora's attacks comfortably, while threatening a Spore.</p> </li> </ul>",
    "sets": {
      "Meteor Beam": {
        "description": "<p>Meteor Beam's power against most neutral targets is devastating. The Special Attack boost allows Glimmora to output offensive pressure with Sludge Bomb even after Power Herb is consumed.</p> <ul> <li> <p>Earth Power is used as coverage for the Steel-types that resist Glimmora's STAB combination. Energy Ball is also an option to utilize the Tera Grass STAB boost and to hit Pokemon that resist Meteor Beam such as Urshifu-R but makes it so that Steel-types resist all of Glimmora's attacks.</p> </li> <li> <p>The Special Attack investment along with the Modest nature is necessary to pick up a OHKO on Landorus, Walking Wake, and Terastillized Urshifu-R with Meteor Beam. The OHKO on Landorus and Urshifu turns the match up against hyper offensive teams completely on its head, especially with speed control support from Tornadus.</p> </li> <li> <p>The Defense investment is enough to guarantee surviving Rillaboom's Wood Hammer and a favourable roll of taking Kingambit's Iron Head. The Special Defensive investment lets it live Gholdengo's Make it Rain and Latias's Mist Ball. The rest of the EVs are invested into Speed, which allows Glimmora to outspeed Choice Scarf Landorus-T when in Tailwind.</p> </li> <li> <p>Tera Grass has better synergy with Glimmora's original typing and provides an immunity to spore, but gives Glimmora weakness to common threats such as Chien-Pao. Tera Water, defensively, is a stronger neutral type into the metagame, but has fewer relevant resistances to common threats.</p> </li> </ul>"
      },
      "Bulky Attacker": {"description": "<ul> <li> <p>Both Earth Power and Energy Ball are fine options, but Energy Ball can do more damage against neutral targets if Glimmora Terastallizes into a Grass type.</p> </li> <li> <p>Mortal Spin is used as the final move for a more consistent method to spread poison than Toxic Debris.</p> </li> <li> <p>The Assault Vest gives Glimmora much more longevity, as it allows it to comfortably tank special attacks while still dissuading physical attackers with the threat of Toxic Spikes. On teams where being able to spread poison is important, Assault Vest is a good option.</p> </li> <li> <p>The special bulk allows Glimmora to live many strong super effective attacks, such as Choice Specs Gholdengo's Make it Rain; it also makes Choice Specs Flutter Mane's Shadow Ball a 3HKO. Glimmora still lives a Rillaboom Wood Hammer with the HP investment.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "Choruto", "user_id": 646006}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}, {"username": "Sole Survivor", "user_id": 518634}]}]}
  },
  "Dondozo": {
    "overview": "<ul> <li> <p>Dondozo is a formidable threat thanks to its stats being doubled when combined with Tatsugiri's Commander ability. Due to its immense bulk, Dondozo is difficult to remove without adequate answers, easily sweeping through entire teams on its own.</p> </li> <li> <p>Dondozo performs best with offensive threats that can break apart teams for it and still function independently without needing to pivot. Examples include Chien-Pao and Dragonite, as well as Tornadus and a sweeper such as Urshifu-S or Flutter Mane. The two cores utilize strong speed control and get off massive damage early, allowing Dondozo to clean up. Glimmora is another excellent partner, as its ability and signature move put foes on a timer, forcing them to burn through Dondozo before fainting to Toxic poison.</p> </li> <li> <p>Dondozo struggles against Pokemon that can ignore its stat boosts, either by neutralizing or bypassing it entirely. Both Urshifu formes and Chien-Pao with Sacred Sword ignore Dondozo's Defense boost, with Chien-Pao both outspeeding and threatening Dondozo if it uses Tera Grass, and Urshifu-S dealing big damage with Wicked Blow and removing Dondozo's ability to stall with Protect. Incineroar and Gouging Fire are able to consistently weaken Dondozo with Breaking Swipe and Intimidate cycling respectively. A combination of Incineroar and Amoonguss is particularly difficult to handle, as Amoonguss can keep Incineroar safe with redirection and Incineroar is free to cycle Parting Shot and Intimidate.</p> </li> <li> <p>Dondozo requires much more experience to properly play compared to other sweepers, due to only making plays with one Pokemon for most of the game. While its not impossible to play into certain difficult matchups, especially with a strong composition and much practice, it necessitates significant reads and good positioning of Dondozo to win.</p> </li> </ul>",
    "sets": {
      "Offensive Sweeper": {
        "description": "<ul> <li> <p>Wave Crash is Dondozo's strongest Water-type move, OHKOing Pokemon like Tornadus and Gholdengo. Earthquake bypasses Follow Me from Ogerpon-W, and provides it a strong spread move thats picks off weakened foes.</p> </li> <li> <p>Rocky Helmet breaks Focus Sash on Chien-Pao and Urshifu, allowing for an OHKO. It also allows for big damage on Urshifu-R using Surging Strikes. Leftovers allows Dondozo to recover swathes of health, even more so by stalling with Protect. However, its harder to use now, as most threats to Dondozo can outdamage Leftovers recovery, especially so considering the Urshifu formes ignore Protect. Clear Amulet can be used to remove ways to weaken Dondozo, primarily Incineroar and Gouging Fire.</p> </li> <li> <p>20 Defense EVs ensure that Sacred Sword from Chien-Pao is a 4HKO and allow Dondozo to survive two Wicked Blows from Urshifu-S. 76 Special Defense EVs allow Dondozo to survive two Moonblasts from Tera Fairy Choice Specs Flutter Mane. The Attack investment ensures Wave Crash OHKOes Urshifu-S after Rocky Helmet damage and that Order Up 2HKOes Ogerpon-W and Urshifu-R.</p> </li> <li> <p>Tera Grass provides resistances to Grass- and Electric-type attacks, as well as giving an immunity to Spore from Amoonguss, which is otherwise difficult to deal with.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Choruto", "user_id": 646006}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Tatsugiri": {
    "overview": "<ul> <li>Tatsugiri is solely used to combine with Dondozo, and shouldn't be picked outside of that purpose.</li> </ul>",
    "sets": {
      "Choice Scarf Support": {
        "description": "<ul> <li> <p>Icy Wind is used as a late-game speed control option. Dragon Pulse is a more consistent STAB move compared to Draco Meteor and Muddy Water, at the cost of damage. Sleep Talk allows Tatsugiri to better answer Amoonguss, while Tera Blast hits Flutter Mane and Chien-Pao in the rare circumstances where Tatsugiri is Terastallized.</p> </li> <li> <p>Choice Scarf allows Tatsugiri to clean up late-game once Dondozo is down, either serving as speed control with Icy Wind to support its partner or dealing damage with Muddy Water and Draco Meteor.</p> </li> <li> <p>The given EVs allow Tatsugiri to outspeed Choice Scarf Landorus-T and survive an Icicle Crash from Chien-Pao and a Wicked Blow from Urshifu-S.</p> </li> <li> <p>Tera Steel gives Tatsugiri a resistance to Steel and Fairy and a generally better defensive profile. Tera Water can be used to boost Muddy Water's damage and remove its weakness to Flutter Mane's Fairy-type STAB moves, which is useful in some end-game scenarios.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Choruto", "user_id": 646006}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Farigiraf": {
    "overview": "<ul> <li> <p>Farigiraf's excellent bulk combined with Prankster Taunt and the immunity to Fake Out given by Armor Tail ability make Farigiraf an extremely consistent Trick Room setter. This is because its ability prevents Farigiraf from being taunted by the main Taunt user in the format, Tornadus, and the opponent can no longer use Fake Out to stall out Trick Room turns. Additionally, Armor Tail gives Farigiraf a great matchup against Pokemon that rely on priority like Rillaboom and Dragonite.</p> </li> <li> <p>The different Ogerpon formes are all great partners for Farigiraf, because the redirection means Trick Room is almost guaranteed to go up, while their Grass typing means that Spore is no longer an issue. Ogerpon-W has a great defensive typing and can easily tank most hits it redirects away from Farigiraf, Ogerpon-H hits Amoonguss and the Steel-types that resist Farigiraf's moves, and Ogerpon-C is particularly helpful for redirection due to its Sturdy ability. Rillaboom and Incineroar are also great partners, as Fake Out + Trick Room is a great combination due to the fact that Fake Out prevents both opponents from attacking Farigiraf before Trick Room goes up.</p> </li> <li> <p>Partners that are physically frail or weak to one of the big priority moves like Urshifu-R really enjoy having it as an ally. Flutter Mane is an excellent partner, as it can handily deal with the Dark-types that Farigiraf struggles against, and Ursaluna-B is a strong Trick Room sweeper that enjoys being immune to the Fake Out cycling from Incineroar and Rillaboom.</p> </li> <li> <p>Farigiraf can have a difficult time against Pokemon that can threaten to OHKO it both in and out of Terastallization, like Kingambit and Urshifu-S. Another issue is opposing Trick Room Pokemon, especially Torkoal and Amoonguss, the former being able to outspeed Farigiraf inside of Trick Room and OHKO it with Tera Fire-sun-boosted Eruptions, and the latter being able to put any Farigiraf that isn't running Safety Goggles to sleep and just being a general threat when Trick Room is up.</p> </li> </ul>",
    "sets": {
      "Bulky Support": {
        "description": "<ul> <li> <p>While Psychic and Trick Room are self-explanatory, Dazzling Gleam is a fantastic option to hit Dark-types. Psychic Noise is a good option, as it completely restricts the use of Horn Leech from the Ogerpon formes, and Drain Punch from Iron Hands, which Farigiraf's partners might be weak to; Psychic Noise also stops all Pokemon from healing from Rillaboom's Grassy Terrain. Imprison is used to block opposing Trick Room while also stopping opposing Flutter Mane from using Dazzling Gleam. Protect is just a generally consistent option, allowing Farigiraf to stick around to provide the team with priority blocking for longer.</p> </li> <li> <p>Sitrus Berry is generally preferred, as the extra recovery allows it to live important attack combos such as Chien-Pao's Icicle Crash into Entei's Sacred Fire; however, Safety Goggles is also a valid option, allowing it to ignore Spore from opposing Amoonguss, a common counter to Trick Room.</p> </li> <li> <p>With Sitrus Berry recovery, Farigiraf can always survive an Icicle Crash from Adamant Chien-Pao and a Sword of Ruin-boosted Sacred Fire from Entei. The Special Defense investment allows Farigiraf to live an unboosted Overheat from Timid Chi-Yu. The rest of the EVs were put into offense.</p> </li> <li> <p>Fairy is the best Tera type on Farigiraf in this format, allowing it to resist common Dark-type attacks from Urshifu-S and Kingambit. It also allows Farigiraf to deal more substantial chip damage with Tera Fairy Dazzling Gleam, allowing it to OHKO Urshifu-S.</p> </li> </ul>"
      },
      "Offensive": {
        "description": "<ul> <li> <p>Hyper Voice activates Throat Spray to inflict a lot of damage and boost subsequent Psychics. Psyshock deals less damage than Psychic overall, but it allows Farigiraf to hit Flutter Mane and Assault Vest Pokemon like Rillaboom harder.</p> </li> <li> <p>Throat Spray allows Farigiraf to put really good amounts of pressure unlike other Trick Room setters. Life Orb allows for more immediate damage and more pivoting ability, as you wont lose the damage boost when switching out, but provides less damage overall.</p> </li> <li> <p>The HP and Special Defense EVs allow Farigiraf to survive Tera Fairy Moonblast from Choice Specs Flutter Mane, Tera Normal Helping Hand-boosted Hyper Voice from Life Orb Ursaluna-B, as well as non-Tera Life Orb Blood Moon. The heavy amount of Special Attack investment allows Farigiraf to serve its role as an offensive Pokemon very well, especially after a Throat Spray boost. The Defense investment allows Farigiraf to take Surging Strikes from Tera Water Choice Scarf Urshifu-R.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "CbuttyVGC", "user_id": 615665}], "teams": [{"name": "Quality checked by", "members": [{"username": "Choruto", "user_id": 646006}, {"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Kingambit": {"sets": {"Swords Dance": {}, "Assault Vest": {}}},
  "Flutter Mane": {
    "overview": "<ul> <li> <p>Flutter Mane's extraordinary Special Attack and Speed combined with its fantastic offensive typing makes it one of the most effective cleaners in the format, 2HKOing the majority of the metagame. Flutter Mane can also play a supportive role for its team thanks to Icy Wind and Speed Booster Energy.</p> </li> <li> <p>Offensive sets appreciate Pokemon that bring speed control like Latias and Tornadus, as well as Pokemon that provide it with longevity like Incineroar and Amoonguss. Supportive sets instead become the speed control and help support slower offensive Pokemon like Urshifu-R and Chi-Yu. Chi-Yu works particularly well as a partner, bolstering Flutter Mane's damage with Beads of Ruin and checking Steel-types like Kingambit while Flutter Mane takes care of Fighting-types like Urshifu-R in return.</p> </li> <li> <p>Bulky Assault Vest users that can take a boosted Moonblast and OHKO Flutter Mane in response like Kingambit and Rillaboom are some of its toughest matchups. Flutter Mane also faces issues into faster threats like Chien-Pao and Choice Scarf Urshifu-R. Additionally, redirectors like Indeedee-F and Ogerpon-W mitigate its damage output when on the field.</p> </li> </ul>",
    "sets": {
      "Offensive": {"description": "<ul> <li> <p>Flutter Mane is an effective cleaner thanks to Moonblast, which is its strongest STAB move, and Dazzling Gleam, which provides spread damage.</p> </li> <li> <p>Special Attack Booster Energy is Flutter Mane's strongest boosting item if it wants to keep Protect. Fairy Feather can be used instead, allowing it to retain its offensive boosts when switching at the cost of damage.</p> </li> <li> <p>The EV spread is built to survive an Ice Spinner from Jolly Chien-Pao and to outspeed Tornadus, with the remaining EVs boosting Flutter Mane's Special Attack</p> </li> <li> <p>Flutter Mane appreciates Tera Fairy to further boost its damage on Moonblast and Dazzling Gleam . This also removes its Ghost weakness and makes it resist Dark-type attacks, allowing it to better deal with opposing Flutter Mane and survive a potential Sucker Punch from Pokemon like Kingambit.</p> </li> </ul>"},
      "Choice Specs": {"description": "<ul> <li> <p>Choice Specs is Flutter Mane's strongest boosting item and allows it to do immediate damage.</p> </li> <li> <p>Flutter Mane utilizes Icy Wind as a speed control option and as coverage to threaten chipped Landorus. Thunderbolt and Power Gem are strong coverage options for important Pokemon like Tera Water Urshifu-R and Incineroar, respectively.</p> </li> <li> <p>The above spread allows Flutter Mane to survive a Surging Strikes from a Choice Scarf Urshifu-R while outspeeding Adamant Chien-Pao. The remaining EVs are used to maximise its Special Attack.</p> </li> <li> <p>Flutter Mane takes advantage of Tera Fairy by removing its Ghost weakness and giving it a Dark resistance, allowing it to better deal with opposing Flutter Mane and survive a potential Sucker Punch from Pokemon like Chien-Pao. Tera Fairy also allows Flutter Mane to secure an OHKO on Tera Water Urshifu-R.</p> </li> </ul>"},
      "Speed-Boosting Support": {"description": "<ul> <li> <p>Flutter Mane requires Icy Wind to accomplish its role as speed control, forcing it to pick between Dazzling Gleam and Moonblast.</p> </li> <li> <p>Speed Booster Energy allows Flutter Mane to outspeed the majority of the metagame.</p> </li> <li> <p>With Booster Energy, Flutter Mane can outspeed opposing Chien-Pao at -1 and Modest Gholdengo in Tailwind. The defensive investment lets it survive Adamant Chien-Pao's Ice Spinner and Gholdengo's Make It Rain.</p> </li> <li> <p>Tera Fairy is appreciated to gain more of an offensive presence and helps against opposing Flutter Mane, as Speed Booster Energy Flutter Mane is unable to OHKO opposing Flutter Mane with Shadow Ball.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yuichi", "user_id": 435812}]}, {"name": "Grammar checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Iron Bundle": {
    "overview": "<ul> <li> <p>Iron bundle is the fastest threat in Regulation F thanks to Booster Energy and is used as a speed control option. It can threaten Landorus, Ogerpon-W, Incineroar, and Urshifu-R with super effective damage and an OHKO on the former two.</p> </li> <li> <p>Iron Bundle appreciates offensive Pokemon that take advantage of Icy Wind like Urshifu-S, Ogerpon-H, Choice Specs Flutter Mane, and Landorus. Flutter Mane and Landorus specifically threaten Kingambit and Urshifu for Iron Bundle.</p> </li> <li> <p>Iron Bundle is weak to priority attackers like Rillaboom, Chien-Pao, Dragonite, and Raging Bolt, since they can ignore Iron Bundle's Speed and Icy Wind's Speed drops while still pressuring it for huge damage if not an OHKO because of its low defenses.</p> </li> </ul>",
    "sets": {"Glass Cannon": {"description": "<ul> <li> <p>Icy Wind is used for speed control, Hydro Pump is used as the main Water-STAB move, and Freeze-Dry is preferred to threaten common Water-types like Urshifu-R and Ogerpon-W.</p> </li> <li> <p>Booster Energy is used to raise its Speed, which allows it to outspeed threats like Choice Scarf Urshifu-R, Booster Energy Flutter Mane, and Regidrago and Modest Landorus under Tailwind.</p> </li> <li> <p>Tera Ghost is used for an immunity to threatening priority moves like Fake Out and Extreme Speed.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "Flarefox_7", "user_id": 657713}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Iron Hands": {
    "overview": "<ul> <li> <p>With great physical bulk and Attack, plus Assault Vest to shore up its special bulk, Iron Hands can stick on the field for a long time and deal plenty of damage, allowing it to serve as a bulky pivot. Fake Out also provides Iron Hands with utility.</p> </li> <li> <p>Thanks to Iron Hands's bulk and power, it is able to take on a variety of Pokemon. Notable good matchups include both Urshifu formes, Kingambit, Tornadus and Raging Bolt.</p> </li> <li> <p>Landorus and Landorus-T are extremely bad matchups for Iron Hands not running Ice Punch, and Landorus-T also has Intimidate to lower its damage output. Other notable bad matchups include Amoonguss and Latias, which can wall Iron Hands's STAB moves and punish it with Rocky Helmet, as well as Rillaboom, which can consistently beat it with Wood Hammer.</p> </li> <li> <p>Despite Incineroar being weak to Iron Hands, thanks to Intimidate, Incineroar's higher Speed that lets it use Fake Out first, and Parting Shot, Incineroar can easily halve the damage output of Iron Hands.</p> </li> </ul> <p>*Iron Hands fits best on balance teams, where it contributes to the pivot-heavy playstyle. Tailwind teams can also utilize Iron Hands as a defensive backbone and bulky pivot.</p>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>Wild Charge is better than Thunder Punch, as the power allows for a lot of extra OHKOs to be taken, such as one on Urshifu-R.</p> </li> <li> <p>Drain Punch is preferable for longevity, and while Close Combat can hit certain Pokemon like Incineroar harder, Iron Hands is meant to stick on the field, so a drop in both defenses as a side effect of using its Fighting-type STAB move goes against Iron Hands's best traits.</p> </li> <li> <p>Ice Punch fixes the matchup vs both Landorus formes, Heavy Slam turns the tables on Flutter Mane, and Volt Switch is an option to turn Iron Hands into a pivot and provide it with a way to reset Attack drops from Intimidate.</p> </li> <li> <p>Assault Vest maximizes Iron Hands's low special bulk.</p> </li> <li> <p>An Adamant nature and Attack EVs take advantage of Iron Hands' massive Attack stat. Maximum Special Defense investment takes full advantage of Assault Vest. The Speed EVs outspeeds Urshifu-R under Tailwind and some slower Incineroar.</p> </li> <li> <p>Using Tera defensively allows Iron Hands to avoid weaknesses like Fairy and Ground. Tera Grass allows it to ignore Amoonguss's Rage Powder and Spore, as well as providing it with a resistance to the STAB moves of Landorus and Urshifu-R. Tera Water allows Iron Hands to resist Urshifu-R's Surging Strikes, as well as not adding a weakness to Ice- and Flying-types for Urshifu-R's common partners like Tornadus and Chien-Pao to take advantage of. Tera Fairy is an overall good defensive type, as it is neutral into most of the metagame, but it's especially good for beating opposing Iron Hands and performing better into Raging Bolt.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "SoulboyVGC", "user_id": 558405}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "yoko", "user_id": 617542}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Iron Jugulis": {
    "overview": "<ul> <li> <p>Iron Jugulis's great type combination and access to strong support moves such as Tailwind and Snarl make it a niche but powerful disruptive threat. With Booster Energy, Iron Jugulis is able to outspeed almost every other Pokemon in the format and use its great support options to apply pressure on the opponent with fast Snarls and Air Slashes. Its typing gives it an immunity to Prankster Taunt, as well as resistances to attacks from several common threats such as Rillaboom's Wood Hammer and Urshifu-S's Wicked Blow.</p> </li> <li> <p>Iron Jugulis is used on semi-Trick Room teams with Farigiraf and Ursaluna-B, as it forces opponents to respect both a potential Tailwind from Iron Jugulis and Trick Room from Farigiraf. Both Incineroar and Ogerpon-W are great partners for Iron Jugulis; Incineroar provides Fake Out support and weakens potential threats such as Chien-Pao with Intimidate, and Ogerpon-W provides redirection to allow Iron Jugulis to set up Tailwind more easily. Flutter Mane also forms a very strong and consistent pairing with Iron Jugulis, countering opposing Dark-types that Iron Jugulis would have trouble dealing with.</p> </li> <li> <p>While having a few strong resistances, Iron Jugulis's typing also means it's weak to common metagame threats such as Flutter Mane, especially the Speed Booster Energy variants, and Chien-Pao, which threaten an OHKO. Iron Jugulis also struggles against Pokemon that resist its STAB moves and can take advantage of its low damage output like Incineroar and Raging Bolt. Additionally, Iron Jugulis struggles to find a place on most teams due to it competing with Tornadus, which, unlike Iron Jugulis, has access to Prankster Tailwind, a strong Flying-type STAB move in the form of Bleakwind Storm, and Prankster Rain Dance and Sunny Day.</p> </li> </ul>",
    "sets": {
      "Tailwind Support": {
        "description": "<ul> <li> <p>Snarl is helpful to slow down the plethora of strong special attackers in the format.</p> </li> <li> <p>Booster Energy allows Iron Jugulis to fire off fast attacks like Snarl into opposing special attackers and set up Tailwind more easily, as well as outspeed threats such as Chien-Pao.</p> </li> <li> <p>The bulk allows Iron Jugulis to survive a Extreme Speed from Choice Band Tera Normal Dragonite with Sword of Ruin active, as well as an Icicle Crash from a -1 Attack Chien-Pao. After a Snarl, Iron Jugulis lives a Dazzling Gleam from Choice Specs Tera Fairy Flutter Mane, as well as Thunderbolt from Raging Bolt.</p> </li> <li> <p>Both Tera Poison and Steel are viable, but Poison is generally preferred thanks to the Fighting resistance and generally better synergy with Iron Jugulis's original type. In comparison, Tera Steel gives more resistances to powerful moves in the format like Blood Moon and Make it Rain, but it is weak to more types than Tera Poison.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "PokeknightVGC", "user_id": 664689}], "teams": [{"name": "Quality checked by", "members": [{"username": "Flarefox_7", "user_id": 657713}, {"username": "Choruto", "user_id": 646006}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Baxcalibur": {"sets": {"Clear Amulet": {}}},
  "Gholdengo": {"sets": {"Nasty Plot": {}}},
  "Chien-Pao": {
    "overview": "<ul> <li> <p>Chien-Pao is an excellent offensive Pokemon bearing a great offensive typing and a fantastic Speed tier. Chien-Pao is capable of taking on the majority of the format, and it's especially strong against Tornadus and Landorus thanks to its typing and Sword of Ruin.</p> </li> <li> <p>Incineroar has Intimidate and resists both of Chien-Pao's STAB attacks, which makes it difficult for Chien-Pao to deal with, therefore Urshifu-R is a strong partner as it utilizes Sword of Ruin and pressures Incineroar.</p> </li> <li> <p>Chien-Pao also struggles to take on Urshifu-R and Iron Hands, which take any of its attacks comfortably and threaten it in return.</p> </li> </ul>",
    "sets": {
      "Glass Cannon": {
        "description": "<ul> <li> <p>Ice Spinner is an alternative Ice-type STAB move that provides increased accuracy and a way for teams to handle Rillaboom and Indeedee-F in exchange for higher power and a flinch chance. However, it prevents Chien-Pao from attacking Rocky Helmet Amoonguss and Latias as freely.</p> </li> <li> <p>Chien-Pao uses Sacred Sword as coverage for relevant Pokemon such as Incineroar and Kingambit.</p> </li> <li> <p>Chien-Pao utilizes Focus Sash to make up for its poor defensive typing combined with its lackluster bulk, as it allows it to stay an extra turn on the field to help partners exploit Sword of Ruin, which is significant for offensive compositions.</p> </li> <li> <p>With Tera Stellar, Chien-Pao has the option to pick up OHKOs on Pokemon it usually wouldn't be able to OHKO, such as Flutter Mane and Amoonguss. However, it has to be wary of pivots and foes using Protect, as the power boost is temporary. Chien-Pao can also use Tera Ghost to remove its Fighting weakness and become immune to priority moves like Fake Out, which is crucial for Focus Sash.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Robbie35646", "user_id": 562330}]}, {"name": "Grammar checked by", "members": [{"username": "yoko", "user_id": 617542}, {"username": "Clouds", "user_id": 356215}]}]}
  },
  "Ting-Lu": {
    "overview": "<ul> <li> <p>Ting-Lu is an offensive threat with incredibly high defensive stats and massive HP. Thanks to Vessel of Ruin, it can slow down the metagame's special attacking composition, like Farigiraf + Ursaluna-B and Indeedee + Iron Crown.</p> </li> <li> <p>Ting-Lu synergizes well with Kommo-o, as the combination of Vessel of Ruin and Iron Defense makes Kommo-o difficult to remove and allows for a sweep. Ting-Lu appreciates Trick Room from Porygon2, while Porygon2 benefits from the added bulk from Ting-Lu's ability Vessel of Ruin.</p> </li> <li> <p>Due to its poor typing, Ting-Lu generally struggles against physical attackers that threaten it for super effective damage like the Urshifu formes, Ogerpon-W, and Rillaboom. It relies on teammates like Incineroar and Amoonguss to slow these threats down with Intimidate and redirection support.</p> </li> </ul>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>Heavy Slam allows it to OHKO Flutter Mane. Ruination consistently chips foes when they resist Stomping Tantrum or if Ting-Lu is Intimdated, making it a premier move for Ting-Lu as it stays on the field for a long time. Snarl slows down special attackers, which, in combination with Vessel of Ruin, allows Ting-Lu to shut down almost every special attacker.</p> </li> <li> <p>Ting-Lu uses Assault Vest to bolster its special bulk in combination with its ability, Vessel of Ruin.</p> </li> <li> <p>The EV spread allows Ting-Lu to survive Tera Fairy Choice Specs Flutter Mane Moonblast and avoid getting 2HKOed by Tera Fairy Choice Specs Dazzling Gleam from Flutter Mane. It also allows it to almost always take Tera Water 156 Adamant Surging Strikes from Urshifu-R and comfortably survive Tera-Water Ivy Cudgel from Ogerpon-W. The Attack investment ensures an OHKO on Flutter Mane with Heavy Slam when not Intimidated and a 2HKO on Incineroar and Raging Bolt with Stomping Tantrum.</p> </li> <li> <p>Tera Poison is the most consistent Tera type for Ting-Lu, as it provides a resistance to Flutter Mane's Moonblast, the STAB moves of Rillaboom, and Close Combat from the Urshifu formes. It also becomes neutral to Water-type attacks from Urshifu-R and Ogerpon-W.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "fyfyy", "user_id": 641757}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}, {"username": "SoulboyVGC", "user_id": 558405}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Chi-Yu": {
    "overview": "<ul> <li> <p>Chi-Yu is the strongest offensive Pokemon in the format, thanks to a high Special Attack stat and Beads of Ruin. Chi-Yu threatens to OHKO the majority of the format, including Amoonguss, Rillaboom, Kingambit, and Gholdengo, with it also walling the latter two. Chi-Yu also outspeeds them with minimal investment, making it a great counter to the common Grass- and Steel-types.</p> </li> <li> <p>While Chi-Yu has fantastic damage, it also has a lackluster Speed tier, which makes Tornadus, Whimsicott, and Speed Booster Energy Flutter Mane great partners; the former two being consistent sun setters, and all of them can pressure Fighting-types such as Urshifu-R that Chi-Yu may be afraid of. Chi-Yu also pairs well with the majority of special attackers, helping them with Beads of Ruin.</p> </li> <li> <p>Incineroar and Urshifu-R resist Chi-Yu's STABs and threaten to either mitigate its damage output or OHKO it. Bulky Assault Vest Pokemon that hit it super effectively like Entei and Iron Hands are also great options against it.</p> </li> </ul>",
    "sets": {
      "Choice Specs": {"description": "<ul> <li> <p>Snarl is used as general utility and as a way to counter Psychic Terrain threats like Hatterene and Iron Crown. Chi-Yu can opt for Tera Blast instead to OHKO frailer Urshifu-R and Flutter Mane without committing to Overheat.</p> </li> <li> <p>The defensive investment allows for Chi-Yu to survive a Tera Fairy Special Attack Booster Energy Moonblast from Flutter Mane, and, when Terastallized, Urshifu-R's Mystic Water Surging Strikes. The Speed EVs allow Chi-Yu to outspeed Adamant Urshifu-R, and the remaining EVs are put into Special Attack to maximize offensive pressure.</p> </li> <li> <p>Chi-Yu uses Tera Ghost to negate its Fighting weakness and become immune to priority like Fake Out and Extreme Speed, which is crucial, as it can't Protect.</p> </li> </ul>"},
      "Glass Cannon": {"description": "<ul> <li> <p>Chi-Yu uses Overheat over Snarl for OHKOs on Landorus and Tera Grass Entei.</p> </li> <li> <p>Focus Sash can make up for Chi-Yu's poor bulk and mediocre defensive typing.</p> </li> <li> <p>Chi-Yu uses Tera Ghost to avoid Fighting-type moves and priority moves like Fake Out and Extreme Speed, preserving its Focus Sash and allowing for aggressive plays.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Roaring Moon": {
    "overview": "<ul> <li> <p>Roaring Moon provides a niche as either a fast speed control option or setup sweeper thanks to the Prankster immunity provided by its Dark typing and access to Attack and Speed Booster Energy, further bolstered by its superb movepool. Roaring Moon's Dark-type STAB moves and excellent elemental resistances make it a great answer to Iron Crown and Gholdengo, as well as the Ogerpon formes.</p> </li> <li> <p>Roaring Moon appreciates partners such as Ogerpon-W, Amoonguss, and Incineroar, which help it to set up Tailwind or Dragon Dance through free turns, the former two handle threats like Urshifu-R and Flutter Mane exceptionally well. Ogerpon-W greatly benefits from Tailwind, while Amoonguss has superb defensive synergy with Roaring Moon; all partners enjoy Breaking Swipe as well. With Acrobatics, Dragon Dance Roaring Moon can help the former two by removing the powder-immune Grass-types and help Incineroar by threatening both Urshfiu formes. Flutter Mane is also a great beneficiary of Roaring Moon, handling opposing Flutter Mane and both Urshifu formes with Tailwind support, and Breaking Swipe protecting it from the physical attackers it's weak to.</p> </li> <li> <p>Roaring Moon's typing, while welcoming fantastic resistances, also invites weaknesses to some of the metagame's most popular threats like the aforementioned Flutter Mane, both Urshifu formes, and Chien-Pao. Roaring Moon can notably mitigate the latter two's damage output if running Breaking Swipe and break Urshifu-S and Chien-Pao's Focus Sash in the process but requires support against them. Incineroar also poses an issue for Roaring Moon, as it resists Knock Off and weakens Roaring Moon with Intimidate. Incineroar's Fake Out can also be used to stall Tailwind turns.</p> </li> </ul>",
    "sets": {
      "Dragon Dance Sweeper": {"description": "<ul> <li> <p>Dragon Dance allows Roaring Moon to be an effective sweeper and helps reset Intimidate Attack drops, making it harder to slow down.</p> </li> <li> <p>Roaring Moon utilizes Attack Booster Energy to activate Acrobatics, allowing for an OHKO on many centralizing Fighting- and Grass-types, such as the various Urshifu and Ogerpon formes, as well as Amoonguss after Terastalization.</p> </li> <li> <p>After Terastalization, the bulk investment allows Roaring Moon to always survive a Tera Water-boosted Surging Strikes from Urshifu-R and a Thunderclap from a Special Attack Booster Energy Raging Bolt. The Speed investment allows Roaring Moon to outspeed Adamant Urshifu formes.</p> </li> <li> <p>Roaring Moon uses Tera Flying to obtain a resistance to Fighting-type moves and to gain STAB on Acrobatics.</p> </li> </ul>"},
      "Tailwind Support": {"description": "<ul> <li> <p>Roaring Moon utilizes Breaking Swipe to weaken the metagame's plethora of physical attackers such as the Ogerpon formes and Rillaboom.</p> </li> <li> <p>Roaring Moon uses Speed Booster Energy to outspeed the entire unboosted metagame and get off Tailwind and Breaking Swipe more consistently.</p> </li> <li> <p>The HP combined with the Defense EVs allow for Roaring Moon to take Adamant Chien-Pao's Icicle Crash at -1. The Special Defense EVs allow Roaring Moon to almost always survive unboosted Flutter Mane's Dazzling Gleam, as well as a Dragon Pulse from Raging Bolt. The Speed investment lets Roaring Moon outspeed Speed Booster Energy Iron Crown, as well as Adamant Dragonite under Tailwind,</p> </li> <li> <p>Roaring Moon uses Tera Poison to obtain resistances to Fairy- and Fighting-type moves it was originally weak to, which is also a great neutral typing into the metagame.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Choruto", "user_id": 646006}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Walking Wake": {"sets": {"Life Orb": {}}},
  "Ogerpon": {
    "overview": "<ul> <li> <p>Ogerpon is a strong offensive Pokemon that is unique in being able to check many top Pokemon such as Incineroar and Flutter Mane thanks to its ability Defiant and Speed-boosting Embody Aspect after Terastallization. Combined with access to Follow Me and natural immunity to Spore, Ogerpon is capable of being a constant threat while still providing good supportive value.</p> </li> <li> <p>Ogerpon is almost exclusively used on teams built around Dondozo. With its ability Defiant, Ogerpon can be used to punish Incineroar and Gouging Fire, disincentivizing them from weakening both Dondozo and Chien-Pao and even picking up a clean OHKO on Incineroar with Superpower. Once Terastallized, It can outspeed and OHKO Flutter Mane and both Urshifu formes, which are difficult for Dondozo and Chien-pao or Dragonite to handle.</p> </li> <li> <p>Ogerpon struggles against Pokemon that resist Grass STAB as Tornadus and Raging Bolt as well as foes that outspeed it, either forcing Ogerpon to Terastallize or be unable to attack before fainting, such as Chien-Pao, which outspeeds and can survive one hit thanks to it usually holding a Focus Sash. Ogerpon's Grass typing means it's weak to common threats such as Chien-Pao and Gouging Fire, and its middling bulk makes it unable to take more than two attacks most of the time.</p> </li> </ul>",
    "sets": {
      "Offensive Redirector": {
        "description": "<ul> <li> <p>Superpower is used as coverage to hit Steel- and the plethora of Dark-types that resist Ivy Cudgel, such as Kingambit or Chi-yu. Follow Me can be used to redirect attention from the frailer Chien-Pao and Glimmora, making both exponentially harder to deal with, especially so considering Ogerpon resists Urshifu-R Surging Strike's, one of the best counters to Chien-Pao and Glimmora</p> </li> <li> <p>Covert Cloak is used to prevent a flinch from Fake Out, allowing Ogerpon to pressure Incineroar and its partner turn one. Additionally, blocking certain secondary effects such as Icy Wind's Speed drops from opposing Flutter Manes is useful.</p> </li> <li> <p>The Attack investment is necessary to guarantee an OHKO on Incineroar with Superpower, on Flutter Mane once Ogerpon Terastallizes, and to have the highest chance of an OHKO on Urshifu-R. The Speed investment allows Ogerpon to outspeed Choice Scarf Landorus-T after Terastallization. The rest of the EVs are used to round out Ogerpon's bulk.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Choruto", "user_id": 646006}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Ogerpon-Wellspring": {
    "overview": "<ul> <li> <p>Ogerpon-W has a very well-rounded stat spread, a solid typing, and an amazing movepool with great STAB moves, Spiky Shield, and Follow Me which helps it support frailer teammates.</p> </li> <li> <p>A great example of a less-bulky teammate is Flutter Mane; Ogerpon-W's ability to redirect moves away from Flutter Mane can help it break through the opposing team with its strong Tera Fairy Dazzling Gleam in just a few turns.</p> </li> <li> <p>Another great partner for Ogerpon-W is Kingambit, as it discourages Intimidate, which is one of the few ways to slow down Ogerpon-W's offensive capabilities, and Kingambit can even run a Swords Dance set to set-up with Follow Me support from Ogerpon-W.</p> </li> <li> <p>Ogerpon-W is also already a big threat on its own, as it pressures top threats such as Landorus, Incineroar, Flutter Mane, and Urshifu-R, being especially dangerous with Tera. Ogerpon-W does struggle against Rillaboom and Raging Bolt, which resist both  STAB types and can hit it super effectively after Tera.</p> </li> </ul>",
    "sets": {"Offensive Redirector": {"description": "<ul> <li> <p>Horn Leech is the Grass-type move of choice, as Ogerpon-W appreciates the extra longevity, which becomes especially notable when combined with the Special Defense boost provided by Terastallizing.</p> </li> <li> <p>The EV spread outspeeds Modest Landorus, OHKOes bulky Flutter Mane after Tera, and survives Rillaboom's terrain-boosted Wood Hammer.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "Robbie35646", "user_id": 562330}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Ogerpon-Hearthflame": {
    "overview": "<ul> <li> <p>With a solid stat spread, incredible damage output with Terastallization, a unique typing and access to utility such as Follow Me, Ogerpon-H can provide some unique assets to a team.</p> </li> <li> <p>Ogerpon-H has a strong STAB combination that is only walled by Fire- and Dragon-types. Because of this, some of its best partners include Urshifu-R, Landorus and Flutter Mane, which are all powerful attackers that pair well with Ogerpon-H and enjoy Follow Me support. Another strong partner is Kingambit, which dissuades Intimidate from weakening Ogerpon-H, while Follow Me provides an opportunity for Swords Dance Kingambit to set up.</p> </li> <li> <p>Ogerpon-H becomes an extremely powerful offensive threat once Terastallized, being able to OHKO metagame staples like Flutter Mane, Urshifu-R, Rillaboom, and Landorus. Ogerpon-H also has a fantastic matchup against Amoonguss; not only is it able to completely ignore Amoongus's Spore and Rage Powder, but it is also able to OHKO it with Ivy Cudgel or with Wood Hammer should Amoonguss Terastallize into a Water-type. Additionally, Mystic Water variants of Urshifu-R get outsped and OHKOed.</p> </li> <li> <p>Bad matchups for Ogerpon-H include Pokemon such as Entei and Raging Bolt that can wall its STAB combation. For this reason, as well as Intimidate hampering Ogerpon-H's offensive capabilities, Incineroar is a very stable check to it. Lastly, despite having solid bulk, powerful threats that can outspeed Ogerpon-H can OHKO it such as Choice Scarf Urshifu-R. However, with speed control or Fake Out support from Pokemon like Rillaboom, Ogerpon-H can take on Choice Scarf Urshifu-R.</p> </li> </ul>",
    "sets": {"Offensive": {"description": "<ul> <li> <p>Horn Leech trades Wood Hammer's power for greater longevity.</p> </li> <li> <p>Follow Me is by far the best third move on this Pokemon, but if the team does not require a redirector, Ogerpon-H can use Grassy Glide; if this is the case, it is almost always paired with Rillaboom to ensure Grassy Glide is a priority move. Alternatively, Stomping Tantrum allows it to hit opposing Fire-types such as Entei and Chi-Yu.</p> </li> <li> <p>The Speed EVs allow Ogerpon-H to outspeed Modest Landorus and Adamant Urshifu-R. The Attack EVs with the Adamant nature allow it to OHKO Flutter Mane after Terastallization even when Ogerpon-H is Intimidated.</p> </li> <li> <p>The bulk investment allows Ogerpon-H to live most Choice Scarf Urshifu-R's Tera Water Surging Strikes while having a favorable roll to survive Timid Landorus's Sludge Bomb.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "SoulboyVGC", "user_id": 558405}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sole Survivor", "user_id": 518634}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Ogerpon-Cornerstone": {
    "overview": "<ul> <li> <p>Ogerpon-C is a great offensive support Pokemon thanks to its high Attack, good offensive typing, access to Follow Me when paired with its solid defenses and ability, and great Speed, having great matchups into Pokemon like Tornadus and Entei.</p> </li> <li> <p>Ogerpon-C can pair well with offensive Pokemon like Landorus, Choice Scarf Urshifu-R, and Iron Hands that help deal with the Fighting-, Ice-, and Steel-types that threaten it like the Urshifu formes, Chien-Pao, and Archaludon. Ogerpon-C can also support Trick Room setters like Farigiriaf, as they have a much easier time setting Trick Room with Ogerpon-C redirecting moves away from them.</p> </li> <li> <p>Ogerpon-C can be overwhelmed by Pokemon like Gholdengo, Chien-Pao, and especially Urshifu-R, which bypasses its Sturdy ability by using Surging Strikes. Therefore it appreciates partners like Incineroar, Iron Hands, and Amoongus that check these Pokemon. In addition to this, they can also provide it with Fake Out support and redirection.</p> </li> </ul>",
    "sets": {"Redirection Support": {"description": "<ul> <li> <p>Ivy Cudgel synergizes well with Ogerpon-C's Grass-type moves, hitting Fire- and Flying-types like Tornadus, Incineroar, and Chi-Yu.</p> </li> <li> <p>Horn Leech provides Ogerpon-C with recovery, while Power Whip hits targets harder, threatening an OHKO on Urshifu-R.</p> </li> <li> <p>Follow Me lets it redirect moves away from its teammates like Sucker Punch and Spore from Chien-Pao and Amoonguss, respectively.</p> </li> <li> <p>Tera Rock bolsters Ivy Cudgel's damage, letting it guarantee an OHKO on Entei, and the Defense boost thanks to Embody Aspect can let it almost always survive Close Combat from Choice Scarf Urshifu-R.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Archaludon": {
    "overview": "<ul> <li> <p>Archaludon can utilize its above-average bulk, solid Special Attack stat, and great Ability in Stamina to check and OHKO threats such as Urshifu-R, Incineroar, and Raging Bolt.</p> </li> <li> <p>Archaludon's access to Stamina and Body Press combined with its resistances and great physical bulk make it an amazing check to Pokemon such as Rillaboom and the Ogerpon formes and also allow it to act as a wincon.</p> </li> <li> <p>Archaludon appreciates teammates like Amoonguss and Sinistcha that provide it with recovery through Pollen Puff and Hospitality, as well as Rage Powder for redirection. Rillaboom provides Fake Out support, as well as passive healing through Grassy Terrain and priority with Grassy Glide that discourages the opponent from leading with Urshifu-R. Dual screens from Grimmsnarl and damage reduction from Incineroar's Intimidate or Snarl are also useful for keeping Archaludon alive to stack Stamina or Electro Shot stat increases.</p> </li> <li> <p>Archaludon fits well on rain teams thanks to its Grass and Electric resistances. It appreciates teammates such as Pelipper that can check opposing Ground- and Fighting-types like Landorus and both Urshifu formes; Pelipper's rain support also allows Electro Shot to charge in one turn, OHKOing Urshifu-R and Tornadus. Archaludon also functions well on Trick Room teams due to many of its checks being faster than it, such as both Urshifu formes, Landorus, and Chien-Pao running Sacred Sword. Farigiraf pairs notably well with Archaludon on Trick Room teams due to the protection from priority it provides and its access to Psychic Noise, which disables Iron Hands's Drain Punch.</p> </li> </ul>",
    "sets": {
      "Rain Sweeper": {
        "description": "<ul> <li> <p>Archaludon's Defense EVs allow it to survive Adamant Choice Scarf Urshifu-R's and Urshifu-S's Close Combat, meaning it can take a hit, boost itself with Electro Shot, and OHKO Urshifu-R on the same turn, provided rain is currently active. The Special Defense investment prevents it from being 2HKOed by Special Attack Booster Energy Flutter Mane's Moonblast.</p> </li> <li> <p>Archaludon does not particularly require Special Attack investment thanks to Electro Shot boosting this stat, but 36 Special Attack EVs with a Modest nature give Archaludon an extra point in Special Attack because of how stat calculation works.</p> </li> <li> <p>28 Speed EVs are to outspeed Choice Scarf Urshifu-R, Urshifu-S and Landorus-T when Archaludon is under Tailwind.</p> </li> <li> <p>Draco Meteor and Electro Shot OHKO Pokemon such as Raging Bolt, Urshifu-R, and Tornadus. Flash Cannon OHKOes Flutter Mane after one Electro Shot boost, and Body Press is good to threaten an OHKO on Chien-Pao, and significant damage on Incineroar, especially after a Stamina boost.</p> </li> <li> <p>Tera Grass gives Archaludon a resistance to Ground-type moves such as Landorus's Sandsear Storm and Earth Power, and immunity to Spore and Rage Powder. Meanwhile, Tera Fairy gives it a Fighting resistance and Dragon immunity to beat Urshifu and opposing Dragon-types respectively.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "UserOmega", "user_id": 637876}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sole Survivor", "user_id": 518634}]}, {"name": "Grammar checked by", "members": [{"username": "TheRealBigC", "user_id": 532450}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Gouging Fire": {
    "overview": "<ul> <li> <p>Gouging Fire is a solid offensive support Pokemon with a good defensive typing. Breaking Swipe and Burning Bulwark give it a great matchup against physical attackers such as Rillaboom and Chien-Pao.</p> </li> <li> <p>Kingambit is one of the most prominent partners for Gouging Fire, because it prevents Incineroar from crippling Gouging Fire with Intimidate. Ogerpon-W fits well with Gouging Fire as well, as with Follow Me it can protect Gouging Fire from Ground- and Water-type moves, both of which Ogerpon-W resists.</p> </li> <li> <p>The Urshifu formes counter Gouging Fire, since they ignore Burning Bulwark and Breaking Swipe. Incineroar is also a good counter to Gouging Fire, cycling Intimidate and Parting Shot repeatedly until Gouging Fire is a sitting duck. Gouging Fire also struggles against special attackers like Flutter Mane and Landorus, which can hit it for big damage, the latter threatening it for an OHKO.</p> </li> </ul>",
    "sets": {
      "Offensive Support": {
        "description": "<ul> <li> <p>Heat Crash is a reliable way of dealing damage, and because Gouging Fire is so heavy, it will almost always do good damage against most of the metagame. Howl can be used to take advantage of passive playstyles and partially negate Intimidate, and with a Speed Booster Energy, it can support the Kingambit and Ogerpon-W in return.</p> </li> <li> <p>252 HP and 20 Defense EVs allow you to always live two Wicked Blows from Adamant Urshifu-S, and 164 Speed EVs with a Jolly Nature allow you to and outspeed Adamant Choice Scarf Landorus-T and Chien-Pao once the Booster Energy has been consumed.</p> </li> <li> <p>Tera Grass is a good defensive Tera type for Gouging Fire, as it lets Gouging Fire resist Ground-type moves like Landorus's Earth Power and makes it immune to Spore, which is crucial since Burning Bulwark doesn't Protect Gouging Fire from status moves. Tera Fairy is also a good option as well, as it lets Gouging Fire resist both of Urshifu-S's STAB moves and take neutral damage from the majority of the metagame.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "4Kuser", "user_id": 651372}], "teams": [{"name": "Quality checked by", "members": [{"username": "Choruto", "user_id": 646006}, {"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Raging Bolt": {
    "overview": "<ul> <li> <p>Raging Bolt, with a higher Special Attack than Flutter Mane, massive HP, and good defenses, serves its role as a bulky damage dealer exceptionally well.</p> </li> <li> <p>Don't let Raging Bolt's middling Speed fool you; it's signature move, Thunderclap, makes sure that isn't an issue in a lot of situations, making the Tornadus + Urshifu-R matchup virtually trivial.</p> </li> <li> <p>Raging Bolt pairs insanely well with Rillaboom and Incineroar, providing Fake Out pressure for Raging Bolt to either setup with the Calm Mind set or deal massive damage with the 3 Attacks set. Rillaboom also provides more longevity in Grassy Terrain for Raging Bolt, which can make it immensely difficult to KO. Chien-Pao and Choice Scarf Urshifu-R are also excellent partners at dealing with Raging Bolt's worst matchup, Landorus.</p> </li> <li> <p>That said, Raging Bolt does still have bad matchups despite its strengths, one of which is the aforementioned Landorus, due to it being able to threaten OHKOs against Raging Bolt with Earth Power. Chien-Pao can also be a tricky matchup, as it can deal massive damage with Ice Spinner or Icicle Crash and cause mindgames with Sucker Punch and Thunderclap. Flutter Mane is able to deal huge damage to Raging Bolt even when it Terastallizes, and can very comfortably take unboosted Thunderclaps.</p> </li> </ul>",
    "sets": {
      "3 Attacks": {
        "description": "<ul> <li> <p>Thunderbolt is there for good consistent damage, especially with Tera Electric with Magnet, while Thunderclap helps make up for Raging Bolt's middling Speed. Draco Meteor is a more powerful option, being able to OHKO Pokmon like Landorus when used with Booster Energy. However, it can be forced to switch out and lose the boost when using Booster Energy.</p> </li> <li> <p>Magnet is the most consistent item option, especially when paired with Tera Electric, drastically increasing Raging Bolt's damage. Booster Energy is another option, as it not only boosts its Electric-type moves, but it also boosts Draco Meteor. Safety Goggles prevents Amoonguss from redirecting Thunderclaps away from Urshifu-R.</p> </li> <li> <p>The Speed investment allows Raging Bolt to outspeed Dragapult, Flutter Mane, and Chien-Pao while under Tailwind, allowing it to hit them with its stronger options like Thunderbolt and Draco Meteor. The HP is optimized for Life Orb chip if used.</p> </li> <li> <p>Tera Electric will often be the strongest and most consistent option. Tera Grass is a good option to not only resist Ground-type moves from Landorus, but also if you want to ignore Amoonguss' Spore and redirection with Rage Powder without running Safety Goggles. Finally, Tera Fairy is just a strong neutral Tera type to pair with such amazing bulk.</p> </li> </ul>"
      },
      "Calm Mind": {
        "description": "<ul> <li> <p>Thunderclap is a good main STAB move, as it allows Raging Bolt to focus less on Speed and go all out on bulk investment, as it will be able to boost up then hit most foes before they can retaliate.</p> </li> <li> <p>While Dragon Pulse is usually an underwhelming move, it serves as a strong neutral STAB move into Pokemon that resist Electric-type attacks when paired with Calm Mind.</p> </li> <li> <p>In some situations, Thunderbolt can be used over Protect, due to Raging Bolt being bulky enough to where Protect isn't mandatory on Calm Mind sets, and for consistency against support Pokmon such as Follow Me Ogerpon-W where Thunderclap would fail.</p> </li> <li> <p>Leftovers is preferred over Booster Energy on the Calm Mind set, providing immense longevity with Grassy Terrain from Rillaboom. However, Booster Energy can be used if you need that extra damage, as the Special Attack boost changes many calculations, for example, being able to OHKO bulky Flutter Mane at +1 with Helping Hand and Protosynthesis where you'd be unable to without Booster Energy.</p> </li> <li> <p>The Defense EVs with the HP EVs allow Raging Bolt to live Icicle Crash from Adamant Chien-Pao. The HP EVs make the HP optimized for Leftovers and Grassy Terrain recovery. The bulk investment ensures that Raging Bolt is able to tank 2 unboosted Moonblasts from Timid Flutter Mane at +1 Special Defense after Leftovers and Grassy Terrain recovery combined with Protect. The Special Defense EVs hit an even number to be optimal for the Calm Mind boost.</p> </li> <li> <p>Tera Grass lets Raging Bolt resist Ground-type moves and provides an immunity to Spore and Rage Powder, so Thunderclap can't be redirected away from Urshifu-R.</p> </li> </ul>"
      },
      "Bulky Attacker": {}
    },
    "credits": {"writtenBy": [{"username": "CbuttyVGC", "user_id": 615665}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yuichi", "user_id": 435812}]}, {"name": "Grammar checked by", "members": [{"username": "yoko", "user_id": 617542}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Iron Crown": {
    "overview": "<ul> <li> <p>Iron Crown is an excellent choice for offensive teams looking to take advantage of the powerful move Expanding Force thanks to its well-rounded stats and access to Booster Energy. It performs best against frailer offensive teams consisting of Pokemon that do not resist Expanding Force, such as Tornadus, Landorus, and Urshifu-R.</p> </li> <li> <p>Although it can be used as a sweeper early-game to soften opposing teams, it is usually better to save Iron Crown for the late-game when its checks have been sufficiently weakened for it to sweep.</p> </li> <li> <p>Indeedee-F is by far Iron Crown's best teammate, offering role compression as a Psychic Terrain setter and redirector. Access to Helping Hand also further amplifies its partner's ridiculous damage output.</p> </li> <li> <p>Iron Crown's best counters are Dark- and Steel-types, namely Incineroar, Kingambit, Archaludon, and Gholdengo, all of which resist both of Iron Crown's STAB moves.</p> </li> <li> <p>Therefore, Iron Crown appreciates Pokemon that can help remove these threats consistently, such as Landorus, Entei, and Urshifu-R. In return, Iron Crown can pressure opposing Urshifu-R and Amoonguss.</p> </li> <li> <p>Rillaboom is another noteworthy check, as it is able to safely pivot in and override Psychic Terrain, weakening Expanding Force significantly. Other Pokemon with access to Ice Spinner like Chien-Pao and Dragonite can also be used to remove Psychic Terrain.</p> </li> <li> <p>Faster Pokemon like Chien-Pao and Flutter Mane serve as good checks as well, but they have to watch out for Follow Me from Indeedee-F as they are vulnerable to Tachyon Cutter.</p> </li> </ul>",
    "sets": {
      "Booster Energy": {
        "description": "<ul> <li> <p>Expanding Force is Iron Crown's go-to STAB move, allowing it to devastate foes under Psychic Terrain.</p> </li> <li> <p>Tachyon Cutter helps secure the OHKO on Pokemon like Chien-Pao and Whimsicott, which commonly hold Focus Sash.</p> </li> <li> <p>Tera Water is a naturally good defensive typing that, when coupled with Tera Blast, gives Iron Crown an out against the aforementioned Dark- and Steel-type Pokemon, which otherwise counter it. Focus Blast can be used over Tera Blast to secure the OHKO on Kingambit, but is rather inconsistent and is unable to hit Gholdengo.</p> </li> <li> <p>An alternative spread of 76 HP / 4 Def / 172 SpA / 4 SpD / 252 Spe allows Iron Crown to outspeed Flutter Mane and Chien-Pao thanks to Speed Booster Energy.</p> </li> <li> <p>This set can also be run with a Modest nature to maximize Iron Crown's damage output, at the risk of underspeeding opposing Pokemon in the same Speed tier such as Modest Landorus and both Urshifu formes.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Yuichi", "user_id": 435812}], "teams": [{"name": "Quality checked by", "members": [{"username": "LameLiarLeo", "user_id": 641287}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  }
}