{
  "Charizard": {"sets": [{"name": "Drought Wallbreaker"}, {"name": "Dragon Dance"}]},
  "Slowbro": {"sets": [{"name": "Defensive Pivot"}]},
  "Chansey": {"sets": [{"name": "Pink Blob (Defensive)"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}, {"name": "Dragon Dance + Flyinium Z"}]},
  "Ditto": {"sets": [{"name": "SUS"}]},
  "Dragonite": {
    "sets": [
      {
        "name": "Extreme Killer (Dragon Dance)",
        "description": "<p>Dragonite's high Attack stat, Dragon Dance, and Tera Normal make it a good user of Extreme Speed, being able to effectively clean late-game. Earthquake helps Dragonite eliminate Normal-resistant Pokemon such as Gholdengo, Kingambit, and Heatran. Roost improves Dragonite's longevity and enables it to acquire multiple boosts against passive opponents. Roost lets Dragonite check Volcarona and rain sweepers such as Barraskewda throughout the entire match. Ice Spinner is another choice that clears the priority-blocking Psychic Terrain and hits Great Tusk, Landorus-T, and Dragapult super effectively. Fire Punch can be used to hit bulky Steel-types not weak to Ground such as Corviknight, Mega Scizor, and Ferrothorn. An Adamant nature is usually preferred to maximize Extreme Speed's damage output, but a Jolly nature enables Dragonite to outspeed Tapu Koko and the Normal-immune Dragapult after a single Dragon Dance. Heavy-Duty Boots ensures that Dragonite will always retain Multiscale even if entry hazards are up, but if the team's entry hazard control is good, Silk Scarf is another option that boosts Extreme Speed's power. Dragonite fits well on offensive teams as a priority-using revenge killer and late-game cleaner. Entry hazard support from Great Tusk and Garchomp can help chip down bulky targets such as opposing Great Tusk into range of its attacks. Tapu Lele poses a serious threat to Dragonite, as not only does its Psychic Terrain block Extreme Speed on grounded targets, but with a Choice Scarf it can also outspeed and deal massive damage to Dragonite even after setup, especially if Dragonite has not Terastallized yet. Gholdengo is a good partner, as it can switch in on and threaten Tapu Lele and prevent the opponent from removing entry hazards. Dragonite often struggles against Unaware users such as Dondozo and Skeledirge, so Pokemon that can grab momentum against them are appreciated teammates. Rotom-W and Tapu Koko can come relatively freely on Dondozo and threaten it with a Volt Switch while Heatran and Mega Diancie can switch into and set up Stealth Rock against Skeledirge. Strong wallbreakers like Mega Medicham, Mega Charizard Y, and Zamazenta all take advantage of Pokemon that Dragonite tends to struggle with, such as Dondozo, allowing it to sweep more easily late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515767, "username": "Ryuji"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}]}
  },
  "Scizor": {
    "sets": [
      {
        "name": "Bulky Swords Dance",
        "description": "<p>Mega Scizor leverages its great bulk and solid defensive typing to serve as a sturdy check to many Pokemon—including Weavile, Kartana, and Tapu Lele—and a solid wincon as well. U-turn allows it to serve as a pivot: easily switching it out of checks such as Gholdengo, Urshifu-R, and Mega Charizard Y, it brings in teammates like Tapu Koko and Dragapult to deal with them. Close Combat can be used to dispose of Steel-types like Ferrothorn and Heatran much more quickly, greatly denting them on the switch. The given EV spread allows Mega Scizor to survive two Close Combats from Mega Lopunny after Stealth Rock and outspeed uninvested Heatran, with the HP and Special Defense EVs helping it check Tapu Lele and Espathra. Mega Scizor's pivot support is extremely valuable to Pokemon such as Tapu Koko, Rotom-W, and Zamazenta, which all also appreciate how well it exploits defensive Pokemon such as Clodsire, Ferrothorn, and Landorus-T. Rotom-W forms a strong VoltTurn core with Mega Scizor as well, with both pivoting out on their checks and racking up solid chip damage over time. Nasty Plot Tornadus-T appreciates Mega Scizor pressuring specially defensive walls and offensive Pokemon like Weavile and Clodsire, letting it go all-in as an offensive wallbreaker with ease. Mega Scizor wearing down Rotom-W and Heatran is also particularly useful for Tornadus-T, as these Pokemon can heavily damage or cripple Tornadus-T in one way or another. Mega Scizor being completely countered by Gholdengo mandates a Pursuit trapper like Weavile or Kingambit to pressure it. Skeledirge also hard counters Mega Scizor, encouraging the aforementioned teammates as well as Garganacl and Heatran.</p> "
      },
      {
        "name": "Swords Dance + 3 Attacks",
        "description": "<p>This set takes on a much more offensive role, using its solid defensive typing for easy entry points against Pokemon like Weavile, Kingambit, and Espathra, setting up, and threatening the vast majority of the metagame with its strong Technician-boosted attacks. Close Combat KOes Steel-types like Heatran and Ferrothorn, as well as providing a strong neutral hit against Rotom-W. Dual Wingbeat hits Clodsire and Toxapex for reliable neutral damage, hits Zamazenta super effectively, and breaks Substitute against Shed Tail hyper offense teams and Dragon Dance Dragapult. Knock Off is an alternative to hit Gholdengo reliably and remove items like Leftovers from Rotom-W and Heavy-Duty Boots from Tornadus-T, Skeledirge, and Volcarona. This allows a teammate or Mega Scizor to wear them down much more easily. Knock Off is especially relevant in Rotom-W's case, as removing Leftovers makes it easier to put into KO range of +2 Close Combat. Running Knock Off makes Toxapex a much worse matchup, however, so Pokemon like Great Tusk and Tapu Koko that can pressure it are appreciated. Sand Tomb can be used to reliably beat Clodsire, Toxapex, and Gholdengo, preventing them from reliably checking it. Offensive Mega Scizor fits much better on hyper offense teams, which appreciate its incredibly valuable—though short-term—defensive utility. Grimmsnarl is a perfect teammate, providing dual screens to let it set up against foes like Great Tusk, Dragonite, and Landorus-T; it also pivots Mega Scizor in and appreciates it baiting in Gholdengo, which prevents Grimmsnarl from pivoting as effectively. Gholdengo itself is also a notable partner, as it appreciates Mega Scizor dispatching the most popular Dark-types in Weavile and Kingambit. Entry hazards from suicide leads like Landorus-T and Garchomp allow Mega Scizor to clean late-game, as its foes must be chipped before any sweeping is done. Entry hazards particularly help in wearing down checks like Urshifu-R and bulkier Garchomp sets. Mega Scizor struggles against bulky Steel-resistant Pokemon like Rotom-W and Volcarona; Dragonite and Dragapult can take care of the latter, switching into Volcarona to set up as it switches into Mega Scizor, whereas Great Tusk can remove Leftovers from the former, making it easier for Mega Scizor to dispatch with +2 Close Combat. Physically defensive Unaware walls in Skeledirge and Dondozo completely wall Mega Scizor, so offensive Pokemon that can bait in or wear down these foes, including Calm Mind Espathra and Iron Valiant, make for solid partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 515767, "username": "Ryuji"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}]}
  },
  "Blissey": {"sets": [{"name": "Pink Blob (Defensive)"}]},
  "Tyranitar": {"sets": [{"name": "Stealth Rock"}, {"name": "Assault Vest"}]},
  "Pelipper": {
    "sets": [
      {
        "name": "Rain Setter",
        "description": "<p>Pelipper is a staple pick on rain teams thanks to its ability, Drizzle. Its physical bulk combined with Scald lets it check and potentially cripple foes such as Mega Lopunny, Mega Scizor, and Great Tusk. Hurricane is an alternative to Defog on teams that use Tornadus-T for entry hazard control, which offers better neutral coverage and the ability to hit foes such as Tangrowth and Tera Grass Heatran. Pelipper also operates as a slow pivot with U-turn, which is greatly appreciated by the team's wallbreakers to ensure that they can enter the field safely. Tera Ground offers an Electric immunity for threats such as Tapu Koko, whereas Tera Steel offers a strong defensive typing, letting Pelipper check Pokemon like Extreme Speed Dragonite in a pinch. As the premier rain setter, Pokemon that rely on rain to boost their power or operate effectively within it, such as Mega Swampert, Floatzel, Barraskewda, and Urshifu-R, make for common teammates. Mega Swampert offers a valuable Electric immunity for Pelipper, checking foes such as Tapu Koko. Tornadus-T can provide entry hazard control with Defog, letting Pelipper enter the field and summon rain without having to fear taking hazard damage. Ferrothorn takes advantage of Pelipper's typing and ability to form a solid defensive core and provide a robust blanket check for opposing rain. In return, Pelipper alleviates Ferrothorn's massive Fire weakness by setting rain, and it can check threats that Ferrothorn fails to cover, such as Mega Lopunny.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 385157, "username": "2020 idm boomer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 580037, "username": "TheSorcer3r"}]}
  },
  "Medicham": {"sets": [{"name": "Wallbreaker"}]},
  "Torkoal": {"sets": [{"name": "Sun Setter"}]},
  "Gastrodon": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Gastrodon finds itself a valuable role in National Dex primarily off its invaluable Water and Electric immunities, allowing it to handle terrifying rain sweepers such as Floatzel and Mega Swampert and answer Rotom-W perfectly. Scald lets Gastrodon threaten a burn against otherwise safe switch-ins such as Ferrothorn and Dragonite. Toxic better threatens defensive Pokemon such as opposing Gastrodon, Skeledirge, and Tornadus-T. Earthquake threatens Pokemon like Heatran, Clodsire, and Gholdengo. Relaxed should be selected as Gastrodon's nature if using Earthquake to not lower its damage output; Bold should be used otherwise. Tera Fairy can be used in a pinch to grant Gastrodon a resistance to Fighting against Urshifu-R and Barraskweda and a Dark resistance against Kingambit. The given EV spread maximizes Gastrodon's physical bulk to better take on the likes of Floatzel, Mega Swampert, and Urshifu-R. Gastrodon fits best on balance and bulky offense teams, which appreciate its defensive qualities while being able to supplement its passivity with offensive wallbreakers. Pokemon such as Tornadus-T and Gholdengo can switch into Grass-type coverage from Pokemon like Kartana and Ferrothorn; In return, Gastrodon provides entry hazard support to wear down answers such as Mega Tyranitar, Kingambit, and Clodsire. Strong, fast wallbreakers like Mega Diancie, Iron Valiant, and Zamazenta love having Gastrodon as a fallback measure against the myriad of Water-type revenge killers on rain such as Floatzel and Mega Swampert. If Gastrodon opts to use Spikes, it likes having Stealth Rock setters such as Heatran and Mega Diancie as partners to form an effective entry hazard-stacking core.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 589564, "username": "hidin"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 544502, "username": "ChrisPBacon"}]}
  },
  "Garchomp": {
    "sets": [
      {
        "name": "Offensive Stealth Rock",
        "description": "<p>Garchomp serves as an excellent wallbreaker that possesses great defensive utility, having an Electric-type immunity and being a check to Pokemon like Heatran and Volcarona. Outrage with Dragonium Z muscles through Pokemon like Great Tusk, Tangrowth, and Ting-Lu. Garchomp fits best on offensive teams; Pokemon like Volcarona, Mega Charizard Y, and Tapu Koko benefit from it breaking through Pokemon like Toxapex, Clodsire, and Dragonite. Tapu Koko makes a stellar partner because it can pivot on Garchomp targets in Clodsire, Gastrodon, and Gliscor. In return, Tapu Koko threatens Corviknight and Slowbro, two major roadblocks for Garchomp. Pokemon like Mega Scizor and Kingambit can pressure revenge killers such as Iron Valiant, Weavile, and Dragapult thanks to their strong priority while taking several attacks from them. Rotom-W switches into Pokemon that threaten Garchomp such as Great Tusk and Tornadus-T. Garchomp can take care of Pokemon Rotom-W pivots out on such as Gastrodon, Ferrothorn, and Gholdengo.</p> "
      },
      {
        "name": "TankChomp",
        "description": "<p>Garchomp possesses great role compression and is a good check to contact attackers like Mega Scizor, Dragonite, and Mega Lopunny. Toxic can cripple switch-ins such as Landorus-T, Tangrowth, and Rotom-W. Dragon Tail can stop any setup attempts from Volcarona, Mega Scizor, and Dragonite lacking Ice Spinner and can wear down Pokemon like Corviknight, Rotom-W, and Landorus-T. Alternatively, Flamethrower can rip through Pokemon like Kartana, Mega Scizor, and Ferrothorn. Tera Ghost lets Garchomp spinblock Great Tusk and switch into Fighting-type moves from Pokemon like Mega Medicham and Zamazenta, while Tera Water grants resistances to Gholdengo's Make It Rain and Ice- and Water-type moves from Weavile, Floatzel, and Urshifu-R as well as neutrality to Fairy-type attacks from Iron Valiant and Mega Diancie. Tera Steel gives it a Toxic immunity and improves Garchomp's matchup against Tapu Lele, Kartana, and Dragapult. The given Speed EVs with a Jolly Nature allows Garchomp to outspeed Timid Gholdengo, while maximizing its physical bulk. Teammates like Mega Scizor, Gholdengo, and Volcarona can cover Garchomp's Ice and Fairy weaknesses and threaten out a majority of Garchomp checks such as Iron Valiant, Weavile, and Mega Diancie. In return, Garchomp can switch into Rock- and Fire-type Pokemon like Heatran, Mega Tyranitar, and Volcarona. Knock Off Kingambit and Weavile support Garchomp by crippling common Defoggers like Tornadus-T and Landorus-T.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515767, "username": "Ryuji"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 589564, "username": "hidin"}]}
  },
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot"}, {"name": "Choice Scarf"}]},
  "Alomomola": {"sets": [{"name": "Defensive"}]},
  "Volcarona": {
    "sets": [
      {
        "name": "Offensive Quiver Dance",
        "description": "<p>Volcarona makes for a threatening late-game sweeper thanks to Quiver Dance, strong coverage moves, and a decent defensive profile. Fire Blast can be slotted over Flamethrower to hit much harder, notably OHKOing most variants of Gholdengo, but Flamethrower is usually better because of its consistency. Volcarona can utilize Giga Drain with Tera Grass to hit a plethora of Water-type Pokemon like Gastrodon, Rotom-W, and Urshifu-R hard, in addition to Ground- and Rock-types such as Great Tusk and Garganacl. Hidden Power Ground and Tera Ground help Volcarona bypass checks like Toxapex and Heatran after slight chip damage while also removing Volcaronra’s glaring Rock weakness. Psychic with Tera Psychic allows Volcarona to break through Clodsire and Toxapex more reliably, but it is inferior to either of the previously mentioned Tera types due to its greater vulnerability to being revenge killed, and it leaves Volcarona completely stonewalled by Heatran. Flame Body can threaten to burn physical attackers like Mega Lopunny and Zamazenta, crippling them. Maximum Speed investment and a Timid Nature lets Volcarona outrun Choice Scarf users such as Tapu Lele and Urshifu-R after a boost. Modest can be run to hit walls like Clodsire and Toxapex harder, but it leaves Volcarona much more vulnerable to the aforementioned Choice Scarf users. Volcarona’s defensive utility is appreciated by allies such as Urshifu-R and Kingambit, as it can check dangerous Fighting-types like Iron Valiant and Zamazenta in a pinch. Bulky Dragon-types like Dragonite and Garchomp can use it as setup fodder—with the latter additionally threatening Volcarona’s longevity with Toxic—so allies that can handle them such as Ferrothorn and Rotom-W are great partners to support Volcarona in its sweep. Heatran and Toxapex wall Volcarona if it doesn’t have Hidden Power Ground, so teammates like that can check them such as Garchomp and the aforementioned Rotom-W are much appreciated. Heatran also makes for a great ally, as it can eliminate or cripple Toxapex, Clodsire, and Skeledirge, which clears the way for Volcarona to clean up late-game.</p> "
      },
      {
        "name": "Bulky Quiver Dance",
        "description": "<p>Volcarona distinguishes itself as a bulky setup sweeper by boasting reliable recovery, Quiver Dance, and being able to check Zamazenta and Iron Valiant with its unique typing. Bug Buzz can hit Mega Gyarados, Garchomp, and Mega Latias harder, but Giga Drain can be run to hit Water-types such as Urshifu-R, Gastrodon, and Rotom-W. Psychic can also be ran to threaten Clodsire and Toxapex. Will-O-Wisp makes Volcarona more utility-oriented, threatening physical attackers like Zamazenta and Dragonite with a burn more reliably, crippling them. However, the lack of coverage leaves Volcarona walled easily by most Fire-resistant Pokemon. The given Speed EVs allow Volcarona to outspeed Dragapult after a Quiver Dance, with the rest invested in HP and Defense so that it will always be 3HKOed by Zamazenta and defensive Great Tusk’s Earthquake. Volcarona struggles with status conditions, as they can hinder its ability to check threats like Zamazenta and Iron Valiant in the long term, thus status absorbers like Gliscor and Toxapex make good partners; the former provides Defog support, a Knock Off absorber, and a Heatran check, and the latter helps prepare Volcarona’s sweep with Knock Off and status inducement. Volcarona can be easily exploited by setup sweepers like Garchomp, Dragapult, Mega Tyranitar, and Dragonite, and so checks like Rotom-W, Kingambit, Ferrothorn, and Tapu Lele can help to alleviate these matchups.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 589564, "username": "hidin"}, {"user_id": 241308, "username": "sanguine"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 603814, "username": "SoBalancedGuys"}]}
  },
  "Greninja": {"sets": [{"name": "Choice Scarf"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Toxapex": {"sets": [{"name": "The Pex"}]},
  "Cinderace": {"sets": [{"name": "Swords Dance"}, {"name": "Offensive Pivot"}]},
  "Corviknight": {"sets": [{"name": "Defensive Pivot"}]},
  "Barraskewda": {"sets": [{"name": "Choice Band"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Dragapult": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance Dragapult is one of the most dangerous setup sweepers in the tier due to its blazing Speed and immense power. After a Dragon Dance, Dragapult outspeeds all Choice Scarf and Booster Energy users, such as Kartana, Greninja, and Iron Valiant, making it extremely hard to stop if it sets up successfully. Ghostium Z-powered Phantom Force enables a boosted Dragapult to blast through bulky Steel-types such as Corviknight, Ferrothorn, and Heatran after slight chip damage. Dragapult's typing gives it opportunities to switch in and set up against certain Pokemon such as Volcarona, non-Ice Spinner Dragonite, and Urshifu-R locked into a Fighting-type move. Substitute is the preferred option in the last moveslot to ease prediction and facilitate setup while also avoiding priority. Substitute also allows Dragapult to play mind games with Kingambit. Fire Blast is another option that allows Dragapult to deal massive damage to physically defensive Ferrothorn and Mega Scizor, both of which can survive a boosted Never-Ending Nightmare at full health. Clear Body is the preferred ability to avoid stat drops from Intimidate, but Infiltrator can also be used to improve the matchup against dual screens and Shed Tail teams. A Jolly nature lets Dragapult outspeed Mega Lopunny and Tapu Koko prior to setting up. Dragon Dance Dragapult fits best on offensive teams, where it can function as a potent late-game cleaner with its Z-Move. Entry hazard support from Great Tusk, Garchomp, and Glimmora can help chip bulky foes such as Mega Tyranitar and Kingambit into range of Dragapult's attacks. Gholdengo can block attempts to remove entry hazards, as well as pressure certain physical walls that give Dragapult a hard time, such as Ferrothorn. Dragapult can struggle with bulky physical walls such as Dondozo, Garganacl, and post-Tera Skeledirge, so powerful special wallbreakers that can take advantage of these Pokemon, such as Tapu Lele and Mega Charizard Y, are greatly appreciated. Tapu Lele also provides Psychic Terrain, which thwarts revenge killing attempts from priority moves. A late-game cleaner such as Dragonite or Booster Energy Iron Valiant can take advantage of the holes Dragapult left behind in the enemy defensive core.</p> "
      },
      {
        "name": "Hex",
        "description": "<p>Despite Hex Dragapult's lack of immediate offensive presence, it can be a very annoying threat; it excels in getting around many of Dragapult's normal checks and counters, pivoting to dangerous teammates, and spreading status. Against common checks like Ting-Lu, Clodsire, and Toxapex, it can bring in Pokemon like Urshifu-R, Great Tusk, and Tapu Koko, respectively, to punish the opponent. Will-O-Wisp boosts Hex to monstrous levels and threatens to pacify physical attackers like Mega Lopunny, Zamazenta, and Kingambit. Dragon Darts is a strong physical move to better hit special walls like Clodsire, forcing it to recover lest Dragapult's teammates like Iron Valiant break through. With Tera Ghost, it can muscle through specially defensive Toxapex after burn and entry hazard damage with Hex, though Tera Fairy helps it tank hits from opposing Dragapult and Dark-type moves like Pursuit, and it can still check Zamazenta. Infiltrator allows it to check threats behind Substitutes, most notably Iron Defense Zamazenta and Shed Tail receivers like Dragonite. Dragapult struggles to break through Heatran, so Pokemon that can pressure it such as Garchomp and Rotom-W are great partners. It also must be careful around Pursuit trappers like Kingambit and Mega Tyranitar, as even after a burn they heavily chip it; teammates like Urshifu-R, Iron Valiant, and Great Tusk are thus mandatory to threaten said trappers. Pokemon like Tapu Lele and Mega Charizard Y very much appreciate Dragapult crippling and weakening Kingambit and Tyranitar, respectively, as this aids in the process of removing them. In return, Dragapult can clean up the opposing team after its checks are gone. Pivots like Rotom-W and Corviknight bring Dragapult in, with the former checking Heatran and forming a nice VoltTurn core with it, and the latter tanking Dragon- and Fairy-type moves for it. Entry hazards and Knock Off from the likes of Ferrothorn and Great Tusk weaken the opposition for Dragapult to clean, notably its checks like Toxapex and Clodsire.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Dragapult is a menacing wallbreaker, being able to threaten many teams with its STAB Shadow Ball and Draco Meteor. The former in particular is very spammable, as only a limited pool of Pokemon can switch into it. U-turn takes advantage of this limited pool, pressuring Shadow Ball switch-ins like Kingambit and Mega Tyranitar while bringing in teammates such as Urshifu-R and Zamazenta. Flamethrower hits Kingambit for massive damage, while Hydro Pump helps against Mega Tyranitar and Ting-Lu. Finally, Thunder pressures would-be checks, such as Toxapex. Ghost is the best Tera type for Dragapult, as it propels its Shadow Ball to a near-unstoppable level, making it even more spammable. Dragon boosts Draco Meteor's damage while making Dragapult less susceptible to Pursuit, while Tera Fairy purely helps it defensively: not only does it not fear Pursuit, but it's also not weak to Ice Shard or Sucker Punch from Weavile and Kingambit, respectively. Finally, it gives Dragapult a Dragon immunity, which allows you to beat Dragon Dance Dragapult after it burns the Z-Move. Dragapult must be wary of Pursuit from Mega Tyranitar and Kingambit, as they can both shrug off multiple Shadow Balls and remove it from the game. However, it can pivot around its checks, so Pokemon that can take advantage of and remove them make great partners, such as Urshifu-R, Zamazenta, and Iron Valiant. The latter two also share checks with Dragapult, like Clodsire and Toxapex, meaning they can overwhelm these checks. Dragapult also greatly appreciates Knock Off support from Tornadus-T, Weavile, or Ferrothorn, as its checks such as Ting-Lu, Kingambit, and Garganacl all rely a lot on their items. Finally, since checks such as the aforementioned Mega Tyranitar and Kingambit are very susceptible to Spikes, Dragapult appreciates its setters such as Ting-Lu, Ferrothorn, and Gastrodon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 515767, "username": "Ryuji"}, {"user_id": 529732, "username": "adem"}, {"user_id": 385157, "username": "2020 idm boomer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 603814, "username": "SoBalancedGuys"}, {"user_id": 272785, "username": "nimzowitsch"}, {"user_id": 515767, "username": "Ryuji"}]}
  },
  "Meowscarada": {"sets": [{"name": "Offensive Pivot"}]},
  "Skeledirge": {"sets": [{"name": "Unaware Wall"}]},
  "Garganacl": {"sets": [{"name": "IronPress"}]},
  "Espathra": {
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Espathra is one of the most threatening Pokemon on hyper offense teams, able to quickly spiral out of hand when teams lack hard counters to it. With Speed Boost + Calm Mind, even resistant foes fall to Stored Power once it gets a few turns to set up, like Tapu Lele and Heatran. Dazzling Gleam allows Espathra to hit Dark-types such as Weavile, Mega Tyranitar, and Kingambit. Tera Blast is a solid alternative with Tera Water to hit Mega Tyranitar, Ting-Lu, Heatran, and Kingambit much harder, but at the cost of requiring Terastallization to be effective. Roost prevents Espathra from being worn down quickly, and it allows it to easily accrue boosts on Pokemon such as Tornadus-T, Landorus-T, and Mega Diancie. Substitute lets it avoid crippling status from Toxapex, Heatran, and Gastrodon, allowing it to use them as setup fodder. Lastly, Protect lets Espathra safely accrue boosts and Leftovers recovery, and it can notably beat chipped Dragapult head-on without prior boosts. Water is the primary Tera type for its amazing defensive use, notably letting Espathra tear through rain teams with ease, unable to be revenge killed by Barraskewda and Floatzel's Aqua Jet. Water also lets it resist Scizor's Bullet Punch, and the Dark and Ghost neutralities help against Pokemon like Dragapult and Kingambit. Steel trades away the Water resistance and Tera Blast utility for an immunity to Toxic, as well as resisting Mega Scizor's U-turn and Dragonite's Extreme Speed, preventing them from revenge killing Espartha. The given EV spread allows Espathra to outspeed Dragapult at +1, with the remaining EVs in bulk letting it set up more easily. Dual screens greatly facilitate Espathra, allowing it to easily set up on offensive Pokemon, making both Tapu Koko and Grimmsnarl amazing partners, with the former also setting Electric Terrain to activate Espathra's Electric Seed. Cyclizar's Shed Tail allows Espathra to avoid status from the likes of Toxapex, Heatran, and Rotom-W, as well as phazing from Garchomp's Dragon Tail. Dedicated entry hazard leads such as Landorus-T, Annihilape, and Glimmora also work really well with Espathra, as they quickly wear down Espathra's checks like Kingambit and Ting Lu into KO range of its attacks. Fellow setup attackers such as Mega Gyarados, Volcarona, and Dragonite break down teams to facilitate a late-game sweep with Espathra. Espathra is greatly bothered by Dark-types such as Mega Tyranitar, Kingambit, Tera Dark Clodsire, and Ting-Lu, making Ghost-types such as Dragapult and Gholdengo great partners alongside it, as they wear down their shared checks. Iron Valiant is a notable partner with Electric Seed sets, as it's also able to take advantage of Electric Terrain via Quark Drive, as well as pressuring Clodsire and Gholdengo, dissuading the former from Terastallizing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 589564, "username": "hidinflames"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Cyclizar": {"sets": [{"name": "Shed Tail Utility"}]},
  "Glimmora": {"sets": [{"name": "Suicide Lead"}]},
  "Dondozo": {
    "sets": [
      {
        "name": "Curse",
        "description": "<p>Thanks to its massive physical bulk and ability, Unaware, Dondozo serves as a wall for physical setup sweepers, such as Dragonite, Kingambit, and Dragon Dance Dragapult. Dondozo also annoys rain teams, shutting down wallbreakers such as Floatzel, Barraskewda, and Mega Swampert. With Curse, Dondozo can also function as a late-game sweeper. Liquidation is preferred to Wave Crash given that it has more PP and does not incur recoil. However, Wave Crash can also be considered for its greater power. Leftovers is preferred to maximize longevity; however, Heavy-Duty Boots is worth consideration to fortify switches into entry hazards. Tera Grass transforms Dondozo's Electric and Grass weaknesses into resistances, turning common threats in Tapu Koko and Kartana into fodder and avoiding Leech Seed from Ferrothorn. Dondozo fits best on bulky offense and balance teams, as they greatly appreciate its ability to wall physical setup sweepers. Given its mediocre special bulk, special walls such as Clodsire and Ting-Lu make for good teammates, as they can switch into special attackers such as Tapu Koko, Tera Grass Volcarona, and Choice Specs Dragapult. Gholdengo is another good teammate since it checks dangerous special wallbreakers such as Tapu Lele and Iron Valiant that can play around Dondozo's commonly paired special walls. Other Pokemon that can beat these threats include Mega Scizor and Clodsire.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 385157, "username": "2020 idm boomer"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}]}
  },
  "Annihilape": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Annihilape's amazing bulk and the fantastic Rage Fist make it an amazing late-game wincon and wallbreaker. Bulk Up makes it harder for foes such as Great Tusk and Dragonite to break through it, as well as allowing it to break through defensive Pokemon like Buzzwole and Mega Scizor. Taunt prevents status, recovery, and set up from Pokemon like Skeledirge, Mega Scizor, and Landorus-T while also forcing foes to damage Annihilape, boosting the power of Rage Fist. Rage Fist lacks no switch-in once boosted up and allows Annihilape to demolish Pokemon that wouldn't mind it unboosted, such as Gholdengo and Mega Scizor. It also notably invalidates Unaware, enabling it to break through Pokemon like Clodsire and Skeledirge. Drain Punch provides Annihilape with some additional recovery, preventing it from being worn down quickly. Rest combined with Chesto Berry can be used over Taunt, as it provides Annihilape with a one-time way to recover HP and status, as well as being the premier way to heal from strong incoming hits, but it can be easily exploited if the foe is able to chip down Annihilape enough. Tera Water is the premier option, as it boosts Annihilape's defensive profile, giving it resists to moves like Urshifu-R's Surging Strikes and Gholdengo's Make It Rain. Fairy is another option that gives Annihilape nice resistances to moves like Mega Lopunny's Close Combat and an immunity to Draco Meteor or Dragon Darts from Dragapult. Tera Fire gives Annihilape an immunity to Will-O-Wisp from Pokemon like Skeledirge and Rotom-W while giving it a Fairy resistance as well, preventing the likes of Mega Diancie and Iron Valiant from revenge killing it. Notably, all of these types give Annihilape a Flying- and Ghost-type neutrality, preventing Pokemon such as Tornadus-T, Dragapult, and Gholdengo from revenge killing it as easily. 28 Speed EVs help Annihilape outspeed Pokemon such as Mega Tyranitar, Gholdengo, and Rotom-W. The other EVs maximize its special bulk, letting it take hits comfortably from Pokemon like Heatran and Volcarona. Dual screens setters like Tapu Koko and Grimmsnarl let Annihilape tank hits more easily. Entry hazard support from Pokemon like Ting-Lu, Ferrothorn, and Heatran to wear down Pokemon like Iron Valiant and Tapu Lele is appreciated. Allies like Heatran and Tyranitar handle Pokemon such as Tapu Lele, Iron Valiant, and Tornadus-T, with Annihilape cleaning up once the aformentioned threats are removed.</p> "
      },
      {
        "name": "Entry Hazard Lead",
        "description": "<p>Annihilape carves a niche in being a Stealth Rock user that is immune to Rapid Spin from foes like Great Tusk and Iron Treads. Annihilape being a Defog deterrent due to Defiant, as well as its bulk and Final Gambit picking up easy KOs also strengthens this niche. Final Gambit lets Annihilape safely bring in a teammate while dealing massive damage due to its large HP stat. Taunt denies other entry hazards from being set up by Pokemon like Ting-Lu and preventing the use of Defog from Pokemon like Rotom-W and Tornadus-T on the switch. Defog can also activate Defiant, giving Annihilape way more offensive output for Rage Fist and making it easier to pick up a KO. Annihilape won't be Terastallizing often, but Tera Ghost can be used to boost the power of Rage Fist in scenarios where it is boosted, and it gives Annihilape neutralities to moves like Mega Diancie's Moonblast and Tornadus-T's Hurricane or Bleakwind Storm. Annihilape fits on hyper offense exclusively, so Pokemon that benefit from entry hazards being simultaneously denied and set up, such as Espathra and Dragonite, are good partners. Pokemon like Tornadus-T and Mega Diancie are very big problems for Annihilape, so partners like Gholdengo and Mega Scizor are very valuable. Final Gambit removing Pokemon like Great Tusk and Tornadus-T can also be a big help to teammates like Kingambit and Dragonite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidingflames"}]}
  },
  "Clodsire": {"sets": [{"name": "Defensive Entry Hazard Setter"}]},
  "Kingambit": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Kingambit positions itself as a wallbreaker and late-game sweeper thanks to its signature ability in Supreme Overlord. Sucker Punch allows Kingambit to threaten faster opponents and would-be revenge killers such as Tornadus-T, Volcarona, and Mega Medicham. Tera Dark lets Kingambit strengthen its wallbreaking capabilities against bulkier teams. Tera Flying instead lets it play around potential revenge killers, putting them in checkmate situations by turning its Fighting and Ground weaknesses into resistances. 140 Speed EVs let Kingambit outspeed Skeledirge. Entry hazard leads such as Glimmora, Landorus-T, and Annihilape help Kingambit power through its checks by punishing switches. Kingambit is susceptible to faster Fighting-type Pokemon such as Great Tusk, Mega Lopunny, and Urshifu-R, as they will not succumb to a boosted Sucker Punch. Thus, wallbreakers like Dragapult, Dragonite, Espathra, and Iron Valiant that punish foes for using Fighting-type moves help form solid offensive cores; they can also pressure bulky Steel-types that check Kingambit, such as Ferrothorn, Corviknight, and Heatran. In return, Kingambit helps check Psychic-, Ghost-, and Fairy-types, such as Dragapult, Tapu Lele, and Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501070, "username": "peap"}, {"user_id": 241308, "username": "sanguine"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 385157, "username": "2020 idm boomer"}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<p>Great Tusk is an excellent Pokemon due to its amazing physical bulk, defensive typing, role compression, and movepool. It also has a very strong offensive presence and has utility moves in Rapid Spin and Stealth Rock to back it up. Headlong Rush is an amazing STAB move, letting Great Tusk force out Pokemon such as Heatran, Gholdengo, and Skeledirge very well. Earthquake can be used for a no-drawback STAB move, but the lack in power is certainly noticeable. Close Combat allows Great Tusk to annihilate Pokemon like Kingambit, and Ferrothorn, and it does a nice chunk to Rotom-W on the switch. Rapid Spin provides reliable entry hazard control, which is especially useful because Great Tusk forces out common Stealth Rock users like Heatran and Mega Tyranitar. It also lets Great Tusk outspeed foes like Iron Valiant, non-Choice Scarf Tapu Lele, and Tornadus-T. Ice Spinner lets Great Tusk hit Landorus-T, Dragonite, and Tornadus-T for good damage. Heavy-Duty Boots gives Great Tusk an entry hazard immunity and allows it to safely Rapid Spin, while Leftovers gives it passive recovery and lets it reliably check Pokemon like Kingambit and Garchomp. Booster Energy can be used to improve Great Tusk's already great offensive output, but since it is a one-time use item, it can be quite unreliable. Tera Water improves the matchup into Pokemon like Urshifu-R and Floatzel. Tera Ground removes Great Tusk's Fairy and Psychic weakness and bolsters its offensive output, letting it OHKO Pokemon like Iron Valiant, Choice Scarf Tapu Lele, and Volcarona. Tera Steel gives Great Tusk resistances to the majority of its weaknesses, letting it KO Pokemon such as Tornadus-T, Iron Valiant, Tapu Lele, and Tapu Koko after luring them. Gholdengo and Kingambit make excellent partners for Great Tusk, as Gholdengo safely handles Pokemon like Tapu Lele and Iron Valiant while Kingambit can force out and Pursuit Pokemon like Tornadus-T and Dragapult. Great Tusk is commonly used as setup fodder against Pokemon like Iron Valiant and Volcarona, so partners like Clodsire and Dragonite can support it in that case. Entry hazard setters like Ferrothorn appreciate Rapid Spin support from Great Tusk, as it lets them keep entry hazards up while removing opposing ones, preventing the team from being worn down quickly. Stealth Rock-weak wallbreakers like Nasty Plot Tornadus-T and Mega Charizard Y also appreciate entry hazard removal from Great Tusk, as it lets them come in multiple times and poke holes in the opposition.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208105, "username": "Jho"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidingflames"}]}
  },
  "Slither Wing": {"sets": [{"name": "Choice Band"}]},
  "Iron Treads": {"sets": [{"name": "Utility"}, {"name": "Assault Vest"}]},
  "Iron Hands": {"sets": [{"name": "Defensive Swords Dance"}, {"name": "Choice Band"}]},
  "Iron Moth": {"sets": [{"name": "Offensive"}]},
  "Baxcalibur": {"sets": [{"name": "Dragon Dance"}]},
  "Gholdengo": {"sets": [{"name": "Nasty Plot"}]},
  "Chien-Pao": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Ting-Lu": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Ting-Lu is an outstanding wall, utilizing its immense bulk, Vessel of Ruin, and useful defensive typing to check threats such as Dragapult, Espathra, and Tapu Koko well. With access to both Stealth Rock and Spikes, Ting-Lu is a flexible entry hazard setter that supports its teammates well. Ruination allows Ting-Lu to pressure Pokemon such as Rotom-W, Tornadus-T, Great Tusk, and Landorus-T, which don't care about its Earthquake. Rest is an option for more longevity across the length of a game, but it renders Ting-Lu useless for a few turns. Whirlwind works exceptionally well with other hazard setters like Ferrothorn and Mega Diancie, as it lets Ting-Lu wear down Pokemon quickly for its teammates, as well as phazing setup sweepers such as Espathra and Dragonite easily. Water is the primary Tera type for Ting-Lu, being overall solid defensively and letting it switch into Barraskewda and Weavile easily. Ghost is also a solid Tera type, as it lets Ting-Lu check Fighting-types like Zamazenta and Iron Valiant, as well as blocking Rapid Spin attempts from Great Tusk. Water-types such as Barraskewda, Urshifu-R, and Floatzel easily force Ting-Lu out, making Water-resistant teammates such as Ferrothorn, Slowbro, and Dragonite great partners. Due to Ting-Lu's susceptibility to Fighting-types like Mega Medicham, Great Tusk, and Zamazenta, Pokemon like Gholdengo, Tornadus-T, and Skeledirge work really well alongside it. Gholdengo in particular forms a potent defensive core with Ting-Lu, preventing its entry hazards from being Defogged. Wallbreakers such as Urshifu-R, Dragapult, and Iron Valiant all pair amazingly with Ting-Lu's hazard support. Lastly, due to Ting-Lu's susceptibility to hazard chip damage, entry hazard removers like Tornadus-T, Rotom-W, and Great Tusk are invaluable partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515767, "username": "Ryuji"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Iron Valiant": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Iron Valiant is a threatening wallbreaker, punching holes in teams with its good offensive stats and wide special movepool. Iron Valiant can't fit all its desired options, but its versatility means opponents must scout it. Thunderbolt helps deal with Pokemon like Toxapex and Corviknight. Psyshock dents Clodsire,which usually hard counters Iron Valiant otherwise, while Shadow Ball helps against Gholdengo and Skeledirge. Trick can cripple Iron Valiant's switch-ins such as Toxapex, Clodsire, and Corviknight. Fairy is the premier Tera type to boost its Moonblast to extreme levels, with it even denting resistant foes like Gholdengo and Victini. Electric is also a good choice, as it helps against Bullet Punch from Mega Scizor and Hurricane from Tornadus-T and Zapdos, and Thunderbolt becomes an extra STAB move. Steel works in the same vein, but it doesn't have any offensive utility, although it provides Iron Valiant a Toxic immunity and more resistances. This set appreciates pivots like Landorus-T, Tapu Koko, and Slowbro to pressure the opponent's team and bring it in. In particular, Tapu Koko also boosts Iron Valiant's Speed thanks to Electric Terrain activating Quark Drive, while Slowbro provides Future Sight support, helping Iron Valiant to push through Toxapex and Clodsire. Entry hazards from Pokemon like Ting-Lu, Garchomp, and Gastrodon help wear down Iron Valiant's checks, such as Gholdengo, Clodsire, and Toxapex. They also can switch into faster Pokemon that threaten Iron Valiant, such as Tapu Koko, Choice Scarf Rotom-W, and Choice Scarf Victini. Pursuit Kingambit, Weavile, and Mega Tyranitar can trap and remove Pokemon that Iron Valiant struggles to break through, like Gholdengo and Victini.</p> "
      },
      {
        "name": "Mixed Attacker",
        "description": "<p>Iron Valiant has the stats to be a good mixed attacker. The given EV spread allows it to OHKO Blissey with Close Combat. Psyshock helps deal with Clodsire, and Thunderbolt hits Corviknight and Toxapex. Knock Off is a good option, as it helps beat Gholdengo while usefully removing items from the likes of Skeledirge, Volcarona, and Corviknight. Fairy is the best Tera type for this set, as it lets Moonblast's damage skyrocket. Steel can make up for Iron Valiant's atrocious bulk, which is even worsened by the Naive nature, and Electric also brings some defensive use while giving Thunderbolt STAB. Both also help Iron Valiant against Tornadus-T and Mega Scizor, as it can resist Hurricane and Bullet Punch. Iron Valiant appreciates slow pivots like Landorus-T, Slowbro, and Corviknight bringing it in safely. Entry hazard control is required to ensure Iron Valiant's survivability. Therefore, Defoggers like Corviknight and Tornadus-T, Rapid Spin users like Great Tusk and Cyclizar, and even Magic Bounce users such as Mega Diancie are good partners.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Iron Valiant is a strong wallbreaker and a potent wincon due to its offensive pressure and Speed boost from Booster Energy. It already possesses a high base Speed, meaning it outpaces every relevant Choice Scarf user besides itself. Calm Mind helps it pressure supposed checks such as Toxapex, Corviknight, and Mega Scizor, although you'll need to Terastallize Iron Valiant to beat the latter. Thunderbolt helps it hit these threats, while Psyshock allows Iron Valiant to properly beat Clodsire and the aforementioned Toxapex. Steel is the best Tera type, as it lets Iron Valiant block poison and resist strong priority moves, such as Fake Out from Mega Lopunny and Bullet Punch from Mega Scizor. Electric is also a very strong option, as it still helps against Bullet Punch and allows Iron Valiant to bash through Skeledirge and the aforementioned Mega Scizor. Since Booster Energy only activates once, this set requires a lot of support before coming in and setting up. Therefore, it's limited to very offensive playstyles. Entry hazards from Garchomp, Ting-Lu, and Landorus-T are needed to weaken Iron Valiant's checks such as Toxapex, Clodsire, and Mega Scizor, helping it punch through them. Pokemon that share checks with Iron Valiant are also valuable teammates, like Dragon Dance Dragonite, Weavile, and Volcarona, as together they can overwhelm common checks like Corviknight and Toxapex. Iron Valiant also appreciates dual screens from Grimmsnarl or Tapu Koko. The latter brings Electric Terrain, which can be useful for Quark Drive and Thunderbolt in extended endgame scenarios. Finally, Swords Dance Kingambit and Sword Swords Dance Garchomp can deal with its checks like Toxapex and Clodsire.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Thanks to its high Speed and capable offensive stats, Iron Valiant is a very potent Choice Scarf user, revenge killing Dragonite and Zamazenta and cleaning up weakened teams. Close Combat and Moonblast hit a large variety of Pokemon, and Knock Off cripples foes while hitting Gholdengo and Skeledirge hard. Trick can be worth it over Thunderbolt's coverage, as it cripples checks like Toxapex and Clodsire. Tera Fairy helps Iron Valiant clean through weakened teams, and Steel allows it to reliably beat Dragonite while resisting priority moves from the likes of Mega Lopunny and Mega Scizor. Entry hazards from setters like Garchomp and Ting-Lu are heavily recommended to weaken Iron Valiant's checks such as Mega Scizor, Toxapex, and Clodsire. Trappers can remove Pokemon it tends to struggle against, such as Toxapex and Gholdengo. Therefore, Heatran, Kingambit, and Weavile are good teammates. Mega Charizard Y, Heatran, and the aforementioned Kingambit can break through Iron Valiant's aforementioned checks. Finally, defensive Pokemon, such as Mega Scizor, Gholdengo, and Heatran can cover for Iron Valiant once it gets forced out after revenge killing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 589564, "username": "hidin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 515767, "username": "Ryuji"}]}
  }
}