{
  "Arcanine": {
    "sets": [
      {
        "name": "Assault Vest",
        "description": "<ul> <li>Flare Blitz is a strong STAB move and enables Arcanine to defeat foes like Gholdengo, Corviknight, Meowscarada, and Breloom.</li> <li>Close Combat is a good coverage move that allows Arcanine to handle Roaring Moon and Tyranitar.</li> <li>Play Rough is an excellent option to deal with Goodra and Sableye.</li> <li>Outrage can be used to handle Choice item Dragapult and Goodra.</li> <li>Extreme Speed allows Arcanine to win some close matchups, like non-bulky Haxorus, and can be important against Iron Valiant and Espathra.</li> <li>The HP EVs allow Arcanine to survive Earthquake from Adamant Choice Band Baxcalibur and Power Gem from Modest Choice Specs Flutter Mane. The Speed EVs outspeed Bold Corviknight, and the remaining EVs are put in Attack for maximum damage output.</li> <li>An alternative EV spread of 116 HP / 144 Atk / 216 Def / 32 Spe can be run, allowing Arcanine to survive Giga Impact from Adamant Choice Band Slaking and Power Gem from Modest Choice Specs Flutter Mane.</li> <li>Magnezone is the one foe with Sturdy that Arcanine should be careful with, yet it can manage to win against Choice Specs Magnezone if Arcanine starts with Extreme Speed instead of Close Combat or Flare Blitz.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "bored_glitch"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 604981, "username": "TrainerPla"}]}
  },
  "Azumarill": {"sets": [{"name": "Assault Vest"}, {"name": "Choice Band"}, {"name": "Stall"}], "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 536219, "username": "fruan"}]}], "writtenBy": []}},
  "Donphan": {
    "sets": [
      {"name": "Choice Band"},
      {
        "name": "Lum Berry",
        "description": "<ul> <li>Sturdy is a valuable ability in the 1v1 metagame, giving Donphan a free turn to deal damage with its good offensive stats.</li> <li>Lum Berry allows Donphan to beat Will-O-Wisp users such as stall Arcanine and Skeledirge, preventing burns and Donphan's Sturdy from breaking.</li> <li>Counter makes use of Sturdy, retaliating against most physical attackers that Donphan cannot KO easily, such as Chien-Pao.</li> <li>Encore traps opposing Pokemon such as Espathra and Swords Dance Iron Hands into setup moves and locks foes such as Ting-Lu into weaker moves.</li> <li>Donphan can beat many physical attackers with Counter, although some prediction may be required versus Pokemon that have the option of using an attacking move, such as Swords Dance Haxorus and non-Choice item Meowscarada.</li> <li>Gunk Shot can be used to deal with Fairy-types such as Sylveon and Azumarill. However, Azumarill with Defense investment can tank a Gunk Shot, so it's not always reliable.</li> <li>Ice Shard gives Donphan priority and finishes off foes that are at low HP. It also gives Donphan a way to deal with Dragon- and Flying-types such as Salamence, Garchomp, and Dragapult.</li> <li>Rock Tomb lowers the opposing Pokemon's speed, Speed, letting Donphan go first and pull off a potential Encore on foes such as Attack-boosted Great Tusk.</li> <li>The HP and Defense EVs allow Donphan to tank an Outrage from Adamant Choice Band Haxorus, and maximum Attack ensures that Donphan can hit as hard as possible. The remaining EVs are put into Speed.</li> <li>An alternative EV spread of 8 HP / 240 Atk / 8 Def / 252 Spe with a Jolly nature only allows Donphan to tank Jolly Choice Band Haxorus, but comes with a faster Encore and Earthquake. The spread gives Donphan the capability to naturally outspeed Pokemon such as Sylveon and Azumarill.</li> </ul> "
      },
      {"name": "Endeavor"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 579035, "username": "bored_glitch"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 566051, "username": "lavarina"}]}
  },
  "Sableye": {
    "sets": [
      {"name": "Rocky Helmet"},
      {
        "name": "Trick + Disable",
        "description": "<ul> <li> <p>Trick gives the foe Sableye's Choice Scarf, allowing Sableye to use Disable and force it into using Struggle. This allows Sableye to beat threats like Dondozo, Iron Hands, and Donphan.</p> </li> <li> <p>Fling gets rid of any unwanted items, such as a given Assault Vest and Sableye's Choice Scarf.</p> </li> <li> <p>Recover allows Sableye to heal off damage dealt while stalling its foe.</p> </li> <li> <p>252 HP and Defense EVs with an Impish nature maximize Sableye's physical bulk.</p> </li> <li> <p>Sableye should almost always use Trick turn 1 and Disable turn 2, then repeatedly use Recover until the foe faints from Struggle recoil.</p> </li> <li> <p>An exception to this is with Choice item Pokemon like Choice Band Dondozo and Donphan, where Sableye should use Fling turn 1 and Disable turn 2, then spam Recover.</p> </li> <li> <p>Sableye struggles to beat Encore and Taunt users, like Annihilape and Skeledirge, and Pokemon that OHKO it, like Iron Valiant and Sylveon. Additionally, Sableye can not defeat Dark-types such as Meowscarada and Ting-Lu, due to its status moves not affecting them.</p> </li> </ul> "
      },
      {"name": "Defensive Roseli Berry"},
      {"name": "Specially Defensive Roseli Berry"}
    ],
    "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 536219, "username": "fruan"}]}, {"name": "Quality checked by", "members": [{"user_id": 576556, "username": "Tom1535"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 467437, "username": "Dawn of Ares"}]}], "writtenBy": [{"user_id": 579035, "username": "bored_glitch"}]}
  },
  "Sylveon": {"sets": [{"name": "Fake Tears Set Up"}, {"name": "Choice Specs"}], "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 536219, "username": "fruan"}]}], "writtenBy": []}},
  "Dragapult": {"sets": [{"name": "Choice Band"}, {"name": "Hex"}, {"name": "Choice Specs"}], "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 519863, "username": "Blanched"}, {"user_id": 546922, "username": "bo_bobson27"}]}], "writtenBy": []}},
  "Meowscarada": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<ul> <li>Meowscarada utilizes its amazing Speed, great Attack stat, Protean, and Choice Band to cement itself as a great Pokemon within the tier.</li> <li>Flower Trick allows Meowscarada to handle Water-, Ground-, and Rock-types like Dondozo, Ting-Lu, and Garganacl.</li> <li>Knock Off is a great option for hitting Ghost- and Psychic-types such as non-Choice Scarf Gholdengo and Espathra. It is also useful for dealing with Magnezone, preventing Meowscarada from being OHKOed by a Choice Specs-boosted Hyper Beam.</li> <li>Sucker Punch can be used to OHKO Choice item Dragapult and Flutter Mane; however this requires prediction in regards to the latter and is generally an inferior option to Knock Off.</li> <li>Giga Impact is Meowscarada's strongest move at its disposal, letting it take on threats such as Sylveon and Clodsire.</li> <li>Play Rough hits Dragon- and Fighting-types like Goodra, Garchomp, and Gallade.</li> <li>Other options include moves like Thunder Punch and Shadow Claw, which beats stall Azumarill and Counter Annihilape, respectively.</li> <li>Alternatively, Meowscarada can opt to run a Leech Seed set with Substitute, Protect, Leech Seed, and Flower Trick with an EV spread of 240 HP / 16 Def / 252 Spe and Mental Herb to have a more reliable matchup against Annihilape, Iron Hands, and non-Timid Flutter Mane.</li> <li>Against Pokemon that can tank a hit from Meowscarada, like Iron Hands and Great Tusk, it is best to use moves that won't make Meowscarada vulnerable to the opposing Pokemon's attacks. Using Flower Trick on Iron Hands can let you win the one-on-one against it, as your opponent may predict Meowscarada turning into a Fairy-type and use Heavy Slam; this also applies to non-Speed Booster Energy and Choice Scarf Great Tusk, where Meowscarada may need to use Play Rough on a predicted Close Combat or Flower Trick on a Headlong Rush.</li> <li>Be wary against Donphan, Meowscarada fails to deal with its Sturdy and Counter.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 506856, "username": "Potatochan"}, {"user_id": 519863, "username": "Blanched"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "bored_glitch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "lunaflare"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 430787, "username": "PA"}]}
  },
  "Skeledirge": {"sets": [{"name": "Defensive Will-O-Wisp"}], "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 455774, "username": "STABLE"}]}], "writtenBy": []}},
  "Dondozo": {"sets": [{"name": "Clear Amulet"}, {"name": "Sitrus Berry"}, {"name": "Choice Band"}], "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 536219, "username": "fruan"}, {"user_id": 546922, "username": "bo_bobson27"}]}], "writtenBy": []}},
  "Annihilape": {
    "sets": [
      {"name": "Sitrus Berry"},
      {"name": "Specially Defensive Weakness Policy"},
      {"name": "Defensive Weakness Policy"},
      {
        "name": "Roseli Berry",
        "description": "<p>*Defiant lets Annihilape counter stat-lowering strategies, such as Arcanine's Intimidate and Charm Azumarill.</p> <p>*Roseli Berry lets Annihilape beat Fairy-types that it usually struggles or outright can't win against, such as Sylveon and Azumarill, along with Pokemon with Fairy coverage such as Play Rough + Choice Band Meowscarada.</p> <p>*Bulk Up allows Annihilape to survive longer and boost Rage Fist's power, both by boosting Attack and taking hits, in front of foes such as Donphan.</p> <p>*Gunk Shot is Annihilape's strongest move against most Fairy-types, such as Azumarill and Sylveon.</p> <p>*Drain Punch nails Dark types, such as Ting-Lu and Chien Pao, alongside giving recovery against foes such as Donphan and Weakness Policy Ting-Lu.</p> <p>*Counter can OHKO physical attackers Annihilape cannot damage easily, such as non-Swords Dance Iron Hands and Azumarill.</p> <p>*Taunt and Encore are both used to disrupt various strategies. Taunt is better in denying offensive setup from foes, like opposing Annihilape, and blocking slower Taunt or Encore users such as uninvested Corviknight and Donphan. Encore better punishes defensive setup, such as Garganacl's Iron Defense and stall Arcanine.</p> <ul> <li>Annihilape's last moveslot comes with a lot of opportunity costs. Removing Drain Punch gives harder matchups against Dark-types like Ting-Lu. Not slotting Counter forces it to hit physical Fairy-types like Azumarill and Play Rough Meowscarada with Gunk Shot, which has lower accuracy. </ul> <p>*The HP and Special Defense investment with a Careful nature allows Annihilape to survive a Hyper Beam from Modest Choice Specs Sylveon. 116 Atk EVs let it 2HKO most Sylveon with Gunk Shot turn 1 and Rage Fist turn 2, minimizing miss chances. The remaining EVs are put in Speed to outspeed Modest Sylveon and Modest Magnezone.</p> <ul> <li>Annihilape struggles to deal with faster Pokemon with super effective STAB moves like Talonflame, most Dragapult, and faster Taunt users such as Booster Energy Great Tusk and Corviknight. </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 503725, "username": "smely socks"}, {"user_id": 501918, "username": "Here Comes Team Charm!"}, {"user_id": 536219, "username": "fruan"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "bored_glitch"}, {"user_id": 517652, "username": "DripLegend"}, {"user_id": 518399, "username": "Itchy"}, {"user_id": 576556, "username": "Tom1535"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 566051, "username": "lavarina"}]}
  },
  "Great Tusk": {
    "sets": [
      {"name": "Booster Energy (Speed)", "description": "<ul> <li>Bulk Up further boosts Great Tusk's naturally high Attack and Defense stats.</li> <li>Booster Energy lets Great Tusk outspeed Meowscarada, Annihilape, and Corviknight.</li> <li>Knock Off can be used to remove Choice items from Dragapult, Gholdengo, and Magnezone.</li> <li>Great Tusk’s EV spread allows for maximum Attack while still procuring the Speed boost from its Booster Energy. The HP investment increases Great Tusk's bulk and ensures its HP remains odd to have a better matchup against Leech Seed.</li> <li>Due to Great Tusk's low Special Defense stat, it's weak to bulky special attackers such as Weakness Policy or Air Balloon Gholdengo and Skeledirge.</li> <li>Great Tusk is strong against Pokemon that it is able to outspeed due to Booster Energy and should use a damaging move against Choice Specs Iron Bundle, Meowscarada, and Chien Pao.</li> </ul> "},
      {"name": "Booster Energy (Attack)"},
      {"name": "Choice Scarf", "description": "<ul> <li> <p>With maximum Attack and Speed EVs and Choice Scarf, Great Tusk can outspeed and OHKO Meowscarada, non-Speed Booster Energy Iron Bundle, and Chien-Pao.</p> </li> <li> <p>Head Smash is for Volcarona and Iron Jugulis.</p> </li> <li> <p>Heavy Slam is for bulky Flutter Mane sets and Choice Specs Sylveon.</p> </li> <li> <p>Alternatively, an EV spread of 164 Atk / 92 SpD / 252 Spe with Knock Off beats Modest Gholdengo, while some rolls, such as against Choice Specs Sylveon, become worse.</p> </li> <li> <p>Due to Great Tusk's low Special Defense, it is weak to special attackers like Skeledirge, Speed Booster Energy Iron Bundle, Babiri Berry Sylveon, and Iron Valiant.</p> </li> <li> <p>Since Great Tusk will be locked into an attacking move, opposing Annihilape can set up with Bulk Up and OHKO Great Tusk afterwards.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 541106, "username": "adam3560"}]}, {"name": "Quality checked by", "members": [{"user_id": 489963, "username": "SwordIsBored"}, {"user_id": 579035, "username": "bored_glitch"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 449859, "username": "DezShizzels"}]}
  },
  "Iron Hands": {"sets": [{"name": "Attack Booster"}, {"name": "Assault Vest"}], "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 536219, "username": "fruan"}, {"user_id": 546922, "username": "bo_bobson27"}]}], "writtenBy": []}},
  "Iron Valiant": {"sets": [{"name": "Encore + Disable"}, {"name": "Mixed Offense"}], "credits": {"teams": [{"name": "Set(s) created by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}], "writtenBy": []}}
}