{
  "Iron Moth": {
    "outdated": true,
    "comments": "<h4>Checks and Counters</h4> <p><strong>Astrolotl and Ceruledge</strong>: Specially defensive Astrolotl is Iron Moth's most common counter, stomaching even its sun-boosted Choice Specs Tera Fire Overheat and threatening to KO it back with Stomping Tantrum. In combination with a Poison-resistant Pokemon like Venomicon, Iron Moth can cede crucial momentum, providing the opponent with an opportunity for a comeback. Flash Fire Ceruledge is Iron Moth's hardest counter, being immune to Overheat and Fiery Dance,  resistant to Solar Beam and Sludge Wave, and able to strike back with a boosted Shadow Sneak. However, Iron Moth can run Tera Ground + Tera Blast specifically to circumvent these counters.</p> <p><strong>Stealth Rock</strong>: Stealth Rock wears down Iron Moth exceptionally quickly. This is particularly notable with its Choice Specs set, which needs to switch out often to reset Overheat's Special Attack drops.</p> <p><strong>Priority</strong>: Sucker Punch Kingambit and Extreme Speed Dragonite can prey on Iron Moth's weak physical defense. Kingambit must be wary of Tera Fairy Iron Moth, however.</p> <p><strong>Faster Foes</strong>: Roaring Moon, Cinderace, Meowscarada, Greninja, and Psyshock Iron Valiant can pick off Iron Moth before it can respond.</p> <p><strong>Special Tanks</strong>: Clodsire, Skeledirge, Arghonaut, and Ting-Lu can easily tank most moves from Booster Energy Iron Moth, but they are 2HKOed by its sun-boosted Choice Specs Overheat with any prior damage or if it Terastallizes.</p> <p><strong>Rain Teams</strong>: Pelipper can override Jumbao's sun with rain, which weakens Iron Moth's best attacks. Floatzel and Quaquaval hit Iron Moth's weak physical defense.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h5>Set Details</h5> <p>Choice Specs Iron Moth is the strongest wallbreaker available for sun teams. Its Tera Fire Overheat under sun can 2HKO Arghonaut and Skeledirge, two of the best special walls in the metagame, and still deal massive damage to frailer targets at -2. Solar Beam more reliably 2HKOes Arghonaut, Toxapex, and Garganacl so that Iron Moth isn't required to Terastallize to be effective. Fiery Dance lets Iron Moth snowball and end games once the opposing team has no remaining Unaware users and is sufficiently weakened. Sludge Wave 2HKOes Astrolotl and Dragonite and OHKOes Cinderace outside of sun, which could otherwise tank an Overheat and pivot around the weakened hit. Ground-type Tera Blast OHKOes Ceruledge, Astrolotl, Skeledirge, and opposing Iron Moth with a surprise hit.</p> <p>Drought Jumbao is a required teammate to set up sun. Healing Wish can help Iron Moth offset Stealth Rock damage and get into battle late-game. Other Protosynthesis users like Roaring Moon and Great Tusk fit fantastically alongside Iron Moth. Roaring Moon's Choice Band-boosted attacks complement Iron Moth's strong special attacks, and its U-turn can bring Iron Moth in safely against a Fairy- or Steel-type switch-in. Great Tusk can remove entry hazards and switch into strong physical attackers like Roaring Moon and Kingambit. In return, Iron Moth very easily switches into Jumbao, one of Great Tusk's hard counters. Eject Button Hatterene is a fantastic teammate that helps keep Stealth Rock off the field and give Iron Moth a crucial free switch.</p>"
      },
      "Booster Energy": {
        "description": "<h5>Set Details</h5> <p>Booster Energy Iron Moth fits best on hyper offense teams where Booster Energy's one-time use can be easily justified. Although it faces some competition  from Quiver Dance Volcarona, its instant power and higher natural Speed tier gives it a niche over Volcarona. Fiery Dance allows Iron Moth to snowball quickly, while Sludge Wave forces Arghonaut and Garganacl to think twice before Terastallizing into a Fairy-type. Energy Ball 2HKOes Arghonaut, Krilowatt, and Garganacl, but Psychic maintains coverage against Arghonaut while pressuring Venomicon, Dragapult, and Clodsire harder. Ground-type Tera Blast allows Iron Moth to push past Skeledirge, Astrolotl, Clodsire, and Ceruledge, which would otherwise give it serious trouble. Dazzling Gleam is best when Iron Moth is Tera Fairy, hitting Roaring Moon and Dragapult more effectively. Tera Fairy allows Iron Moth to stomach Roaring Moon's STAB moves and Kingambit's Sucker Punch, removing them for a surprise KO. Agility helps Iron Moth sweep better, but it displaces a coverage move and is generally outclassed by Volcarona as a setup sweeper. Tera Grass is the best option, turning Iron Moth's severe Ground weakness into a resistance and boosting Energy Ball. An EV spread of 124 Def / 132 SpA / 252 Spe can be used so that Booster Energy raises Iron Moth's Speed, but the drop in power is noticeable. Booster Energy Iron Moth can also fit on sun teams to thwart typical counterplay to its Choice Specs set. Solar Beam should be run to OHKO specially defensive Garganacl at +1 and with Quark Drive active. However, Choice Specs is usually more effective against unprepared teams.</p> <p>Iron Moth fits excellently on hyper offense teams. Entry hazard setters like Meowscarada, Greninja, and Garchomp enable Iron Moth to net KOs more easily. Rapid Spin users like Caribolt and Great Tusk remove Stealth Rock to help Iron Moth leverage its good special bulk. Other hyper offense sweepers like Dragon Dance Roaring Moon, Swords Dance Iron Valiant, Dragon Dance Dragonite, and Scale Shot + Swords Dance Miasmaw tend to struggle with Jumbao, which Iron Moth can help deal with. Supreme Overlord Kingambit can clean up games after Iron Moth has broken holes and fainted.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 227784, "username": "snake"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 251944, "username": "spoo"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493260, "username": "Marnie"}]}]}
  },
  "Syclant": {"sets": {"Tail Glow": {}}},
  "Revenankh": {"sets": {"Bulk Up": {}}},
  "Pyroak": {"sets": {"Contrary Tank": {}}},
  "Fidgit": {"sets": {"Persistent": {}}},
  "Stratagem": {
    "comments": "<h3>Other Options</h3> <p>Stratagem can forgo Power Herb and hold a Life Orb instead to be a powerful wallbreaker, notably 2HKOing Arghonaut with Energy Ball without needing Tera Grass. However, Life Orb chip damage makes revenge killing Stratagem easier. Stealth Rock can be run on such a set to give Stratagem some utility, and it often can place entry hazards with the switches it forces. However, Stratagem can struggle to wallbreak without a setup move. Calm Mind is also an option to let Stratagem quickly end games when given a setup opportunity, but Calm Mind is harder to set up with than Meteor Beam due to Stratagem's frailty. Earth Power can be used to OHKO Glimmora and Heatran at the cost of either valuable coverage or a setup move, weakening its ability to wallbreak past a large amount of the metagame.</p> <h3>Checks and Counters</h3> <p><strong>Specially Defensive Foes</strong>: Stratagem struggles to beat special walls such as Galarian Slowking, Cresceidon, Ting-Lu, and Equilibra. The former two can cripple it with Thunder Wave, Ting-Lu is able to remove the +1 boost with Whirlwind, and Equilibra can OHKO Stratagem with Flash Cannon. Stratagem is similarly threatened by Equilibra's Doom Desire sets, but it can often put the opponent in an awkward position due to the time it takes to land.</p> <p><strong>Arghonaut</strong>: Arghonaut is able to easily tank an Energy Ball from Stratagem and deal a large amount of damage with Circle Throw. If Arghonaut burns Tera, it can freely set Spikes on Stratagem.</p> <p><strong>Priority</strong>: Due to Stratagem's frailty, threats such as Hemogoblin, Kingambit, Rillaboom, and Revenankh can easily revenge kill it with Extreme Speed, Sucker Punch, Grassy Glide, and Drain Punch, respectively. However, Hemogoblin has to be wary of Tera Fire.</p> <p><strong>Faster Pokemon</strong>: Although Stratagem outspeeds the vast majority of the metagame, faster threats such as Dragapult, Zamazenta, and Deoxys-S greatly threaten it due to its frailty. Booster Energy threats such as Iron Valiant and Roaring Moon can pose similar problems.</p> <p><strong>Defensive Terastallization</strong>: As Stratagem cannot take a hit due to its pitiful bulk, Pokemon that Terastallize to resist Stratagem's attacks can beat it, such as Great Tusk using Tera Steel to survive Energy Ball and Gholdengo using Tera Water to take Fire Blast and then OHKO with Close Combat and Make it Rain, respectively.</p>",
    "sets": {
      "Meteor Beam": {
        "description": "<h4>Set Details</h4> <p>Meteor Beam Stratagem is a terrifying wallbreaker due to its blazing Speed stat, great coverage options, and excellence at breaking holes through walls such as Equilibra and Ting-Lu. It can also serve as an excellent wincon once checks such as Galarian Slowking and Arghonaut have been weakened. Due to its frailty, Stratagem usually needs to come in on a free switch such as when an ally is KOed, although it is able to switch into Landorus-T and Mollux relatively safely. Energy Ball provides coverage against Arghonaut, Cresceidon, and Ting-Lu, although Stratagem is not guaranteed to OHKO these foes. Fire Blast is essential coverage, allowing Stratagem to deal large amounts of damage to the Steel-types that would otherwise wall it such as Equilibra and Gholdengo. Tera Fire strengthens Fire Blast and allows Stratagem to beat Equilibra and Heatran consistently thanks to Levitate while also OHKOing offensive Gholdengo. It also allows Stratagem to resist Pixilate Extreme Speed from Hemogoblin and Grassy Glide from Rillaboom, making it harder to revenge kill. Tera Grass allows Stratagem to 2HKO Arghonaut and Ting-Lu at +1 while also OHKOing Cresceidon at +1 if Multiscale is broken prior.</p> <p>Stratagem fits best on hyper offense teams and can serve different uses depending on the matchup. Against balance structures, Stratagem serves as an excellent wallbreaker and paves the way for teammates such as Chuggalong and Iron Moth to sweep. Against hyper offense teams, Stratagem can easily be a late-game wincon, since it is hard to revenge kill once Booster Energy has been expended from threats such as Iron Valiant and Iron Moth. Entry hazard leads such as Glimmora and Deoxys-S make excellent teammates for it. Glimmora's Toxic Spikes support annoys walls such as Arghonaut and Ting-Lu, while Deoxys-S has an offensive presence with Psycho Boost. In return, Stratagem is able to offensively pressure hazard removers such as Great Tusk and Mollux, although it cannot prevent Equilibra from removing hazards. Deoxys-S can use a Life Orb and pair excellently with Stratagem by cleaning teams after it wallbreaks. Stratagem cannot easily beat special walls such as Equilibra, Heatran, and Galarian Slowking, so Pokemon that can easily defeat these threats such as Great Tusk, Ogerpon-W, and Miasmaw make excellent teammates. Chuggalong can switch into priority for Stratagem, having an especially great matchup against Rillaboom. Iron Moth can also fill a similar role as Chuggalong for Stratagem, but while it lacks the ability to deal with priority, it applies more immediate pressure. Both Chuggalong and Iron Moth appreciate Stratagem's ability to switch into Ground-type moves for them and weaken their checks such as Equilibra, Arghonaut, and Ting-Lu.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652323, "username": "Anchor9"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Arghonaut": {
    "comments": "<h3>Other Options</h3> <p>A set consisting of Bulk Up / Knock Off / Circle Throw / Recover with an EV spread of 248 HP / 224 Def / 18 SpD / 12 Spe can be utilized to turn Arghonaut into a sort of setup sweeper that outspeeds uninvested Mollux, but not only does it loses the mirror even harder, but it also requires the team support Arghonaut would usually provide. Ice Punch can be run to hit Gliscor and Landorus-T, but the utility of Arghonaut's other moves makes it niche at best. Toxic can be used over Spikes if there's another setter on the team, but Venomicon remains a hard counter. Tera Poison is an option that allows Arghonaut to be immune to Toxic and resist Fairy, but keeping the Psychic weakness and obtaining a Ground weakness is not worth it. Finally, Covert Cloak allows Arghonaut to best Garganacl and become a more consistent switch-in to Heatran, Mollux, and Pecharunt, but provides very little otherwise.</p> <h3>Checks and Counters</h3> <p><strong>Fairy-types</strong>: Offensive Fairy-types such as Hemogoblin, Iron Valiant, Primarina, and Enamorus all threaten Arghonaut and have ways to deal with it even if it Terrastalizes. Defensive Fairy-types like Clefable and Cresceidon both can similarly force it out. Only Iron Valiant and Clefable want to switch into Knock Off, however.</p> <p><strong>Flying-types</strong>: Venomicon, Zapdos, Gliscor, and Tomohawk can all shrug off Arghonaut's attacks and threaten it with either a strong STAB move or their utility options. The former two do not appreciate losing their item and so can't mindlessly switch in, and Gliscor's Poison Heal must be activated before it can switch in freely. Skarmory can't immediately threaten Arghonaut but can phaze Arghonaut out with Whirlwind. Venomicon-E threatens huge damage even after Arghonaut Terastallizes. Tera Flying Acrobatics Roaring Moon similarly threatens to KO Arghonaut after minimal damage.</p> <p><strong>Electric-types</strong>: Krilowatt, Caribolt, Raging Bolt, and Plasmanta can all hit Arghonaut super effectively, with Plasmanta even being able to beat it after Terastallizing. However, Arghonaut can take the others on after it Terastallizes into the Fairy-type, and Krilowatt is scared of switching into Arghonaut, as it gets crippled by Knock Off.</p> <p><strong>Grass-types</strong>: Ogerpon-W, Rillaboom, and Meowscarada all threaten to OHKO Arghonaut and can pivot out with U-turn on a predicted Tera Fairy. They also all can remove Arghonaut's item with their own Knock Off, making it easier to pick off by their teammates. Serperior threatens huge damage with Leaf Storm despite Arghonaut's Unaware and can even paralyze it with Glare.</p> <p><strong>Status</strong>: Gliscor, Snaelstrom, and Pecharunt can all badly poison Arghonaut, while Cresceidon, Gholdengo, and Zapdos can paralyze it through Thunder Wave or Static, making it significantly more passive. Similarly, Heatran, Rotom-W, Mollux, and Volcanion all threaten to burn it, making Arghonaut deal pitiful damage. All of the above also empower Hex users like Dragapult, Gholdengo, and the aforementioned Pecharunt.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Arghonaut is one of the best defensive pivots in CAP thanks to Unaware, strong defenses and a fantastic support movepool. Circle Throw phazes setup sweepers such as Roaring Moon, Volcarona, and Stratagem. It also forces out Equilibra, the tier's premier spinner, making it easier to stack layers of Spikes. Knock Off threatens the Ghost-types that try to switch into Circle Throw such as Dragapult and Gholdengo and puts pressure on foes that rely on Heavy-Duty Boots to switch into entry hazards such as Venomicon, Volcarona, and Dragonite. 248 HP and 224 Defense EVs with an Impish nature guarantee that Arghonaut survives +2 Miasmaw's five-hit Scale Shot, Hemogoblin's Bitter Blade into Tera Fairy-boosted Extreme Speed, and Kingambit's Tera Blast Fairy with five Supreme Overlord boosts. The remaining 32 EVs are put into Special Defense to better tank special attacks, allowing Arghonaut to survive Krilowatt's Surf and Thunderbolt combination, as well as avoiding being 2HKOed by its Tera Water-boosted Surf after Arghonaut has Terastallized. While Leftovers gives Arghonaut much-appreciated passive recovery, Heavy-Duty Boots can be run instead to ignore Spikes at the cost of being more reliant on Recover. Tera Fairy allows Arghonaut to completely change its defensive profile, letting it beat Hemogoblin, Tera Flying Roaring Moon, and Iron Valiant while stopping Miasmaw's Scale Shot.</p> <p>Arghonaut fits best on balance and stall teams, checking most setup sweepers and gaining momentum through the combination of Circle Throw and Spikes. Stealth Rock setters such as Clefable, Venomicon, and Heatran can aid in stacking hazards. Venomicon in particular is a great partner, taking defensive pressure off Arghonaut by checking Fairy-types like Hemogoblin and Iron Valiant as well as offensive Grass-types like Ogerpon-W and Meowscarada. Bulky Ground-types such as Equilibra, Ting-Lu, and Gliscor can help against offensive Electric-types such as Krilowatt, Caribolt, and Raging Bolt. The former two also help check opposing Psychic-types, while Gliscor can act as a solid Knock Off switch-in once its Poison Heal has activated. Equilibra can also remove hazards with Rapid Spin to keep Leftovers Arghonaut as healthy as possible. Offensive pivots such as Dragapult, Krilowatt, and Rillaboom appreciate the Spikes support and item removal that Arghonaut provides.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 273339, "username": "Lasen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Kitsunoh": {"sets": {"Utility": {}}},
  "Cyclohm": {"sets": {"Physically Defensive": {}}},
  "Colossoil": {"sets": {"Flame Orb": {}}},
  "Krilowatt": {"sets": {"Offensive Pivot": {}}},
  "Voodoom": {"sets": {"Choice Specs Pivot": {}}},
  "Tomohawk": {"sets": {"Physical Wall": {}, "HazeHawk": {}}},
  "Necturna": {"sets": {"Shell Smash": {}}},
  "Mollux": {"sets": {"Utility Wall": {}}},
  "Aurumoth": {"sets": {"Tail Glow": {}}},
  "Malaconda": {"sets": {"Drought": {}}},
  "Cawmodore": {"sets": {"Belly Drum": {}}},
  "Volkraken": {"sets": {"Choiced Wallbreaker": {}}},
  "Plasmanta": {"sets": {"Rain Wallbreaker": {}}},
  "Naviathan": {"sets": {"Dragon Dance": {}}},
  "Crucibelle": {"sets": {"Utility Pivot": {}}},
  "Kerfluffle": {"sets": {"Valiant At Home": {}}},
  "Pajantom": {"sets": {"Choice Band": {}}},
  "Jumbao": {
    "outdated": true,
    "comments": "<h4>Checks and Counters</h4> <p><strong>Fire-types</strong>: Jumbao has nothing in its arsenal to meaningfully damage Fire-types such as Skeledirge, Volcarona, Iron Moth, and Ceruledge, all of which can take advantage of it by setting up or firing off a powerful attack. While Cinderace has to be more wary of repeated hits, it can switch into Jumbao at least once with relative impunity and force it out.</p> <p><strong>Poison-types</strong>: Amoonguss switches into Jumbao relatively well and can use Spore as it is forced out but must watch out for Tera Blast Fire. Toxapex, Clodsire, and Venomicon can wall Jumbao and use it as an opportunity to set entry hazards or force progress with Toxic or Knock Off. Venomicon-E outspeeds Jumbao and can take at least one hit and OHKO back with Gunk Shot or Brave Bird.</p> <p><strong>Steel-types</strong>: Steel-types such as Corviknight, Gholdengo, and Bulletproof Equilibra can wall and KO Jumbao with their STAB attacks, but they take significant damage from Tera Blast Fire if Jumbao Terastallizes.</p> <p><strong>Faster Pokemon</strong>: If Jumbao does not hold a Choice Scarf, it is vulnerable to faster attackers with super effective coverage such as Greninja, Dragapult, and Stratagem.</p>",
    "sets": {
      "Drought Wallbreaker": {
        "description": "<h5>Set Details</h5> <p>Jumbao is one of the best Pokemon in the metagame thanks to its excellent offensive stats, defensive utility, and incredible ability in Drought, which enables a host of powerful offensive partners. Tera Blast Fire pressures the Steel- and Poison-types that resist Jumbao's STAB combination, such as Gholdengo, Corviknight, and Venomicon. Alternatively, if Jumbao is paired with teammates that rely on Terastallizing, Focus Blast can be used to retain the OHKO on Kingambit. Synthesis lets Jumbao continuously keep sun up with Heat Rock and outlast Pokemon such as Great Tusk and Roaring Moon. Tera Fire allows Jumbao to take advantage of Tera Blast Fire's coverage and improves its matchup against Steel-types such as Scizor and Gholdengo by removing its Steel weakness.</p> <p>Jumbao can fit comfortably on a variety of playstyles from bulky offense to balance thanks to the team support it provides through Drought. Fire-types such as Skeledirge, Cinderace, Ceruledge, and Iron Moth and Protosynthesis users such as Roaring Moon, Sandy Shocks, and Great Tusk are Jumbao's best offensive partners, as they all become extremely dangerous under sun. Since Jumbao is incredibly vulnerable to opposing Fire-types, defensive Pokemon that can handle them, such as Toxapex, Arghonaut, Ting-Lu, and Garganacl, are excellent partners. The latter three can also set entry hazards to help Jumbao wallbreak, while Toxapex can handle opposing Jumbao and Glimmora. Toxapex and Hatterene can create momentum for sun teams with Eject Button, the latter of which also keeps entry hazards off the field for Fire-type teammates. Bulky Steel-types such as Corviknight and Equilibra can check Poison-types that Jumbao struggles to break such as Amoonguss and Venomicon and appreciate Jumbao handling their checks, such as Krilowatt and Great Tusk.</p>"
      },
      "Choice Scarf": {
        "description": "<h5>Set Details</h5> <p>Choice Scarf Jumbao picks off normally faster threats such as Dragapult, Iron Valiant, and Krilowatt and supports offensive teammates with Healing Wish. Drought allows Jumbao to use Solar Beam quicker and provide sun support for teammates such as Great Tusk and Cinderace. Trace, on the other hand, allows Jumbao to copy valuable abilities such as Toxapex's Regenerator and Venomicon-E's Tinted Lens; however, it requires Jumbao to run Leaf Storm to retain a powerful Grass-type STAB move because of Solar Beam's two-turn wait outside of sun. Tera Fire with Tera Blast grants Jumbao coverage to hit Steel-types such as Corviknight and Gholdengo and resistances to key attacks such as Gholdengo's Make It Rain, Iron Valiant's Moonblast, and Baxcalibur's Ice Shard. Focus Blast, on the other hand, lets Jumbao OHKO Kingambit without Terastallizing.</p> <p>Choice Scarf Jumbao is a strong asset to bulky offense teams, providing them with speed control and incredibly useful Healing Wish support. Defensive pivots that lack reliable recovery, such as Great Tusk, Ting-Lu, Equilibra, and Rotom-W, benefit immensely from Jumbao's ability to bring them back to full health late in the game, which gives them the freedom to take more hits early on. These Pokemon can also handle the Steel- and Fire-types that can take Jumbao's STAB attacks, such as Cinderace, Gholdengo, and Iron Moth. Pivots like Rotom-W, Corviknight, and Cinderace can bring Jumbao in safely against Pokemon it threatens, such as Krilowatt and Hydreigon. Bulky setup sweepers such as Hatterene and Kingambit can break down teams for Jumbao to clean late-game and greatly appreciate Jumbao giving them a second chance to sweep with Healing Wish. Poison-types such as Toxapex, Venomicon, and Clodsire wall Jumbao, so wallbreakers that can threaten them, such as Dragapult, Baxcalibur, and Smokomodo, are good teammates. Lastly, if Jumbao opts to use Drought, it can set sun to support Fire-types such as Skeledirge and Iron Moth and Protosynthesis users such as Great Tusk and Roaring Moon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537558, "username": "memesketch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 221710, "username": "Da Pizza Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 467437, "username": "Dawn of Ares"}]}]}
  },
  "Caribolt": {
    "outdated": true,
    "comments": "<h4>Checks and Counters</h4> <p><strong>Grass-types</strong>: Grass-types like Jumbao, Pyroak, and Amoonguss wall Caribolt's STAB combination, forcing it out.</p> <p><strong>Faster Attackers</strong>: Before Caribolt uses Rapid Spin, Pokemon like Cinderace and Ice Beam Greninja can outspeed and OHKO it. Fast Dragon-types like Dragapult, Roaring Moon, and Astrolotl can switch in to check Caribolt once, but they cannot do so if Caribolt reaches both +1 Speed and +2 Attack.</p> <p><strong>Strong Priority Attacks</strong>: Strong priority attacks from Kingambit, Dragonite, and Revenankh can circumvent Caribolt's Speed boosts and KO it after it has taken some chip damage from Double-Edge.</p>",
    "sets": {
      "talahbolt (Swords Dance)": {
        "description": "<h5>Set Details</h5> <p>Caribolt is a nuclear wallbreaker for offensive teams. Double-Edge with Galvanize can break through even the tier's most stalwart walls, 2HKOing Pokemon like Skeledirge and Garganacl with ease, especially once Caribolt Terastallizes. Horn Leech provides some modicum of recovery to compensate for Double-Edge's recoil. Rapid Spin both increases Caribolt's Speed, giving it sweeping potential, and supports teammates weak to Stealth Rock like Baxcalibur and Iron Moth, allowing them to forego Heavy-Duty Boots. Leftovers helps make up for Double-Edge's recoil alongside Horn Leech, while Magnet powers up Caribolt's Electric-type attacks even further. A Jolly nature is preferred to outspeed Choice Scarf Jumbao at +1 Speed and Krilowatt at +0, but Adamant is an option to deal as much damage as possible, supporting its hyper offense teammates. Tera Grass is an option to turn Ground-types like Equilibra and Great Tusk into setup fodder, but Caribolt's main focus should be on wallbreaking as much as possible for its teammates.</p> <p>Caribolt is best utilized on hyper offense teams, which appreciate its incredible wallbreaking ability. Stealth Rock-weak Pokemon like Iron Moth, Baxcalibur, and Venomicon-E appreciate Caribolt removing the hazard, allowing Iron Moth and Baxcalibur to run more offensive items over Heavy-Duty Boots. Other physical sweepers like Dragon Dance Roaring Moon and Dragonite love Caribolt powering through Unaware walls like Skeledirge and Arghonaut; Roaring Moon pairs particularly well with Caribolt, as it can threaten the Grass-types like Jumbao and Amoonguss that give Caribolt trouble with Tera Flying + Acrobatics. This love is shared by special sweepers like Iron Valiant and Hatterene, which need Skeledirge off the table before attempting a sweep. Caribolt appreciates entry hazards weakening physically bulky Ground-types like Great Tusk and Ting-Lu—which can beat Caribolt if it Terastallizes—into KO range of its attacks, so pairing it with a dedicated lead like Greninja or Meowscarada is suggested.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 277988, "username": "dex"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Smokomodo": {"sets": {"Bone Zone": {}}},
  "Snaelstrom": {"sets": {"Stealth Rock": {}, "Bulky Swords Dance": {}}},
  "Equilibra": {
    "comments": "<h3>Other Options</h3> <p>If using Equilibra on a more offensive team where longevity is less of a priority, it can run an EV spread of 252 HP / 40 SpA / 216 Spe with a Modest nature to outspeed Adamant Hemogoblin and Kingambit, and it can run moves like Healing Wish and Aura Sphere instead of Pain Split to better support its team. It can also run an EV spread of 52 HP / 52 Def / 112 SpA / 40 SpD / 52 Spe with a Modest nature if offensive prowess is preferred over Speed or raw bulk. This spread lets Equilibra avoid the OHKO from Hemogoblin's Flare Blitz and Walking Wake's Hydro Steam out of sun, lets it outspeed Skeledirge, and invests heavily in Special Attack for incredibly powerful Doom Desires. Bulletproof can be run to hard wall every Gholdengo set and, in conjunction with Tera Fairy, also wall Darkrai and Chuggalong.</p> <h3>Checks and Counters</h3> <p><strong>Bulky Flying-types</strong>: Pokemon like Venomicon, Skarmory, Moltres, Zapdos, and Corviknight can all take Equilibra's hits well and retaliate with super efective moves.</p> <p><strong>Item Removal</strong>: Leftovers are essential for Equilibra if it wants to be kept healthy on a match. Knock Off from the likes of Gliscor, Arghonaut, and Clefable as well as Trick from Choice Scarf Gholdengo can make it way harder for it to stay healthy and would make it have to rely on Pain Split for healing.</p> <p><strong>Bulky Water-types</strong>: Pokemon like Arghonaut, Rotom-W, Cresceidon, and Primarina can tank Equilibra's attacks then hit back with super effective STAB moves.</p> <p><strong>Offensive Grass-types</strong>: Rillaboom, Ogerpon-W, and Serperior can sponge Equilibra's hits then strike back with their powerful STAB attacks. The former two can threaten an OHKO with Ivy Cudgel and Wood Hammer, with Ogerpon-W being an especially notable check, since it resists both of Equilibra's STAB attacks.</p> <p><strong>Physical Wallbreakers</strong>: Miasmaw, Zamazenta, and Gouging Fire can all heavily damage Equilibra, as they outpace Equilibra, target its weaker Defense stat, and can hit it super effectively. Roaring Moon and Greak Tusk can also heavily damage Equilibra while having the option to use Knock Off as a neutral option to remove Equilibra's Leftovers if it stays in or any switch-in's item.</p>",
    "sets": {
      "Defensive Spinner": {
        "description": "<p>Between its amazing defensive typing, high special bulk, and great matchups against common Ghost-types like Gholdengo and Dragapult, Equilibra is one of CAP's most reliable defensive pivots and entry hazard removal options. It fits primarily on balance teams, using its powerful Doom Desire to enable teammates and force checkmate scenarios where it can guarantee damage or a KO. Equilibra makes great use of Leftovers thanks to its many immunities and resilience to hazards, as with its immunity to Spikes, Toxic Spikes, and Sticky Web and 4x resistance to Stealth Rock, Heavy-Duty Boots is completely unnecessary. Pain Split maximizes Equilibra's recovery, which is useful to extend its longevity against bulkier teams; however, Protect can be used instead in order to maximize recovery from Leftovers, stall Doom Desire turns, scout Choice-locked foes and foes attempting to Tera, and block checkmate attempts done with opposing Doom Desire or Future Sight at the cost of leaving Equilibra without recovery if it loses its item. Flash Cannon can be used over Doom Desire if it needs to immediately pressure foes like Iron Valiant, Air Balloon Gholdengo, Enamorus, Gliscor, Rillaboom, and Hatterene. Maximum special bulk allows Equilibra to sponge powerful STAB attacks from special wallbreakers like Dragapult, Kyurem, and Darkrai and avoid being OHKOed by Focus Blast from +2 Gholdengo. Tera Water lets Equilibra take on Water- and Fire-type moves that would otherwise threaten it, whereas Tera Dragon is an alternative that offers a better matchup against Grass- and Electric-type foes like Caribolt and Krilowatt at the cost of a less useful defensive typing as a whole.</p> <p>Cresceidon appreciates Equilibra's ability to take on threatening Poison-types like Galarian Slowking and Chuggalong and to remove entry hazards if Cresceidon loses its Heavy-Duty Boots; in return, Cresceidon deals with strong Fighting-, Fire-, and Water-type wallbreakers that threaten Equilibra like Great Tusk, Gouging Fire, and Walking Wake. Arghonaut is another bulky Water-type that checks powerful physical wallbreakers like Zamazenta and Cinderace, can absorb Knock Off, and appreciates Equilibra checking Gliscor and keeping the field clear of hazards. Wallbreakers like Kyurem, Dragapult, and Ogerpon-W pair well with Equilibra, as the pressure it provides with Doom Desire is very valuable. Venomicon and Equilibra cover each other's weaknesess very well, as Venomicon can switch into the physical wallbreakers like Rillaboom, Hemogoblin, and Ogerpon-W that Equilibra fears, while Equilibra tanks the hits of the special wallbreakers like Stratagem and Kyurem that Venomicon can't take on.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 566431, "username": "Gaboswampert"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Astrolotl": {"sets": {"Offensive Utility": {}}},
  "Miasmaw": {
    "comments": "<h3>Other Options</h3> <p>Heavy-Duty Boots can be used over Loaded Dice on teams without much entry hazard control, as it alleviates Miasmaw's weakness to hazards, but it makes Scale Shot far less consistent at dealing damage. Fire Fang is a usable alternative to Tera Blast Fire that gives Miasmaw access to Fire-type coverage without Terastallizing, but it is generally not recommended, as it deals significantly less damage. First Impression allows Miasmaw to double as a revenge killer, but it requires Miasmaw to give up valuable coverage and does next to nothing to help it perform its primary role as a sweeper.</p> <h3>Checks and Counters</h3> <p><strong>Entry Hazards</strong>: Miasmaw's typing leaves it very vulnerable to all forms of entry hazards, which, in conjunction with its low physical bulk, greatly limit the number of opportunities it gets to set up.</p> <p><strong>Skarmory and Corviknight</strong>: Unless Miasmaw is running Tera Blast Fire, it is countered by Skarmory and Corviknight, as they resist Scale Shot, are immune to Miasmaw's other coverage moves, and can offset any boosts Miasmaw gains from Swords Dance by using Iron Defense. However, these Pokemon take massive damage from the aforementioned Tera Blast Fire.</p> <p><strong>Revenge Killers</strong>: If Miasmaw is unable to land a Scale Shot, its middling Speed leaves it very vulnerable to getting revenge killed by faster Pokemon such as Weavile and Dragapult. Even after using Scale Shot, Miasmaw must still be wary of Life Orb Deoxys-S, as it outspeeds and OHKOes Miasmaw with Psycho Boost after Stealth Rock damage. Similarly, Choice Scarf users such as Darkrai and Enamorus can take care of Miasmaw with Ice Beam and Moonblast, respectively, though the former requires that Miasmaw has taken prior damage, and the latter is not a common Pokemon in the tier.</p> <p><strong>Priority</strong>: As Miasmaw is quite frail on the physical side, especially after having its Defense dropped from repeated uses of Scale Shot, it is extremely vulnerable to Sucker Punch from the likes of Kingambit and Hisuian Samurott. Similarly, Extreme Speed users such as Dragonite and Hemogoblin are perfectly capable of revenge killing Miasmaw, but this measure may prove ineffective should Miasmaw Terastallize into a Ghost-type.</p> <p><strong>Physically Bulky Pokemon</strong>: Dondozo, despite having Unaware shut off by Neutralizing Gas, serves as a perfectly serviceable check for Miasmaw, as it takes minimal damage from Scale Shot and OHKOes Miasmaw in return with Avalanche. Arghonaut can switch in when Miasmaw sets up and forces it out with Circle Throw or cripples it with Knock Off. In a similar vein, Great Tusk usually avoids the OHKO from +2 Scale Shot and can easily finish Miasmaw off with Ice Spinner. Zamazenta takes little damage from Miasmaw's attacks after a boost from Iron Defense and deals significant damage with Heavy Slam or forces it out with Roar. However, these Pokemon need to be relatively healthy to safely deal with Miasmaw.</p> <p><strong>Fast Status Spreaders</strong>: Cresceidon can switch in on the turn Miasmaw uses Swords Dance or Scale Shot and cripples it with Thunder Wave or Encore, or it can deal a large amount of damage with Moonblast, but it cannot deal with Miasmaw after it has set up, as it is OHKOed by +2 Gunk Shot. Dragapult can severely limit Miasmaw's effectiveness as a sweeper with Thunder Wave or Will-O-Wisp, or it can outright OHKO it with Dragon Darts. However, Dragapult cannot switch in directly, and it is unable to check Miasmaw at +1 Speed, since it is torn to shreds by Scale Shot.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h4>Set Details</h4> <p>Miasmaw is a deadly physical sweeper, and it owes its success to its sky-high Attack stat, access to Scale Shot, and incredibly powerful ability in Neutralizing Gas. Together, these qualities allow it to circumvent common counterplay for sweepers such as Arghonaut and Pixilate Extreme Speed from Hemogoblin and allow it to easily decimate weakened teams after a single Swords Dance boost. Earthquake serves as Miasmaw's main coverage move, hitting Steel-types that would otherwise take little damage from Scale Shot such as Equilibra, Heatran, and Kingambit. Gunk Shot is the preferred option for the last moveslot, as it allows Miasmaw to dispatch otherwise bothersome Fairy-types such as Cresceidon, Iron Valiant, and Clefable that would attempt to block Scale Shot. However, if Miasmaw is backed by teammates that can deal with these Pokemon, it can instead choose to run Substitute to protect itself from priority moves and harmful status conditions. When used alongside Tera Ghost, it can also generate opportunities to turn Extreme Speed users such as Hemogoblin and Dragonite into setup fodder. Tera Blast can be run alongside Tera Fire to provide coverage against Skarmory and Corviknight, both of which Miasmaw otherwise struggles against. Loaded Dice is generally recommended to ensure that Scale Shot deals consistently strong damage. Tera Ghost prevents Miasmaw from being revenge killed by Extreme Speed from the likes of Hemogoblin and Dragonite while also allowing it to serve as a situational spinblocker. Alternatively, Tera Poison improves Miasmaw's matchups against Fairy-types by patching up its Fairy weakness and strengthening Gunk Shot, notably allowing it to OHKO Cresceidon and Clefable prior to using Swords Dance.</p> <p>Miasmaw finds itself at home on hyper offense teams. Its typing leaves it extremely vulnerable to entry hazards, so running it alongside hazard control such as Caribolt, Great Tusk, or Hatterene is mandatory. Miasmaw struggles to break through Skarmory and Corviknight if it does not have access to Tera Blast Fire, so it appreciates being paired with a Fire-type that can take advantage of these Pokemon such as Iron Moth or Gouging Fire. Other strong Dragon-type sweepers such as Dragonite and Roaring Moon work well with Miasmaw, as not only do they help wear down each other's checks, but they also heavily appreciate Miasmaw's ability to deal with Hemogoblin, which would otherwise stop these Pokemon dead in their tracks as they take massive damage from Pixilate Extreme Speed. Miasmaw's physical frailty and weakness to hazards mean that it may have trouble finding ample opportunities to set up during a game, and, as a result, it is a good idea to pair it alongside a Pokemon that can set dual screens or Aurora Veil, such as Alolan Ninetales or Deoxys-S. Special wallbreakers such as Stratagem, Chuggalong, and Deoxys-S pair well with Miasmaw, as they can deal with many of the physically bulky Pokemon that may give Miasmaw trouble; in return, Miasmaw demolishes any special walls that would otherwise prevent them from making progress. Finally, Miasmaw gets good value from Spikes to help wear down physical walls, so Pokemon that can set Spikes such as Hisuian Samurott, Deoxys-S, and Glimmora naturally make for good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 221710, "username": "Da Pizza Man"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Chromera": {"sets": {"Calm Mind": {}, "Final Gambit": {}}},
  "Venomicon": {"sets": {"Book": {}, "Nasty Book": {}}},
  "Venomicon-Epilogue": {"sets": {"E-Book": {}}},
  "Saharaja": {"sets": {"Standard Camel": {}}},
  "Hemogoblin": {
    "comments": "<h3>Other Options</h3> <p>Explosion allows Hemogoblin to deal one last attack that will significantly dent even Fairy-resistant foes such as Venomicon and Skeledirge. At +2, it will even OHKO Multiscale Cresceidon. Explosion also gives a free switch-in to a teammate, grabbing huge amounts of momentum quickly. However, Explosion is unreliable, as it takes away valuable utility and can be hard to use with Hemogoblin’s low Speed. Will-O-Wisp can also be used to cripple threats like Great Tusk, Venomicon, and Kingambit but is mostly useless against checks such as Gliscor and Krilowatt. Choice Band gives Hemogoblin immediate power, allowing it to sweep with Extreme Speed more easily and break through Unaware Dondozo with Tera Fairy. However, this prevents Hemogoblin from using Bulk Up, leaves Hemogoblin vulnerable to all hazards, and is easily taken advantage of by Venomicon. Trick can be used in conjunction with Choice Band to cripple threats such as Venomicon and Equilibra with a hampering item. However, the lack of Choice Band or a setup move is noticeable, making Hemogoblin’s attacks rather weak. Tera Water allows Hemogoblin to more easily win mirror matchups against opposing Hemogoblin by resisting Flare Blitz, but otherwise is inferior to Tera Ground. Hemogoblin can also choose to run a specially defensive EV spread with a recovery move such as Moonlight or Wish and Tera Poison. This allows it to more easily set up on Venomicon while also making it more resilient into special wallbreakers such as Dragapult and Gholdengo. Wish also provides healing for teammates. However, doing so heavily reduces Hemogoblin's revenge killing potential due to a lack of Attack investment.</p> <h3>Checks and Counters</h3> <p><strong>Bulky Poison-types</strong>: Venomicon, Galarian Slowking, and Mollux can all tank Hemogoblin’s attacks and threaten it with Sludge Bomb. Pecharunt is more rare but does the same and threatens Toxic or Malignant Chain. All of them have to be wary of Hemogoblin Terastallizing, however.</p> <p><strong>Fast Fairy-resistant Pokemon</strong>: Iron Moth, Plasmanta, Venomicon-E, and Heatran can tank a Pixilate-boosted Extreme Speed and threaten back with Poison-type STAB moves and Earth Power for the latter. Heatran has the added danger of trapping Hemogoblin with Magma Storm.</p> <p><strong>Krilowatt</strong>: Krilowatt's great natural bulk lets it take a single Extreme Speed and force Hemogoblin out with the threat of a super effective Surf.</p> <p><strong>Bulky Ground-types</strong>: Gliscor and Landorus-T can absorb an attack from Hemogoblin and immediately threaten it back with Earthquake, while Great Tusk can threaten it with Headlong Rush and tank a hit at the cost of a defensive Tera.</p> <p><strong>Fairy-resistant Tera Users</strong>: Tera Poison and Tera Fire from threats such as Dragapult, Roaring Moon, and Great Tusk can completely shut down a revenge kill attempt from Hemogoblin, with Tera Fire also heavily reducing Flare Blitz's damage, forcing Hemogoblin to either get KOed itself, or switch out.</p> <p><strong>Unaware Users:</strong> Skeledirge and Dondozo are walls that are nearly impossible for Hemogoblin to break through. Skeledirge can slowly use Torch Song to chip its way through Hemogoblin’s HP, while Dondozo takes chunks of Hemogoblin’s health through Waterfall or Liquidation. Arghonaut can wall Hemogoblin too after burning Tera, freely setting Spikes if Hemogoblin lacks Taunt. Arghonaut can also force Hemogoblin out afterwards with Circle Throw.</p>",
    "sets": {
      "Bulk Up": {
        "description": "<p>Hemogoblin is an amazing late-game sweeper thanks to its combination of strong priority and a great offensive typing. Pixilate-boosted Extreme Speed allows Hemogoblin to easily KO weakened targets and pressure offensive threats. Its strength also lets Hemogoblin sweep through teams with frail offensive cores such as Dragapult and Iron Valiant with particular ease if it finds a setup opportunity. Flare Blitz dents threats that resist Extreme Speed, such as Equilibra and Gholdengo. Bulk Up raises Hemogoblin’s middling Attack, allowing it to always OHKO defensive Equilibra with Flare Blitz at +1 and offensive Great Tusk with Extreme Speed at +2. Bulk Up also makes it harder to revenge kill Hemogoblin, turning offensive Great Tusk’s Headlong Rush and Booster Energy Roaring Moon’s Earthquake into a 2HKO at +1. Taunt stops slower foes such as Venomicon, Arghonaut, and Clefable from recovering their HP, allowing Hemogoblin to slowly wear down its checks throughout the game. Spikes is an option to capitalize on forced switches. Tera Fairy maximizes Extreme Speed’s wallbreaking power, while Tera Poison allows Hemogoblin to beat Cresceidon and turn defensive Venomicon into setup fodder. Tera Ground with Tera Blast allows Hemogoblin to break past threats such as Heatran, Mollux, and Plasmanta, as well as allowing it to win the mirror matchup against opposing Hemogoblin. The EV spread allows Hemogoblin to maximize Attack while outspeeding Adamant Kingambit. Alternatively, Hemogoblin can run 76 Speed EVs to outspeed Venomicon while gaining bulk</p> <p>Both Hex and Choice Specs Dragapult provide great synergy with Hemogoblin. Dragapult provides great speed control and can beat Great Tusk and Iron Moth, which Hemogoblin can struggle against. Dragapult’s Will-O-Wisp can wear down Hemogoblin’s checks such as Cresceidon, Venomicon, and Great Tusk over time, allowing it to KO them with Extreme Speed. Ground-immune teammates such as Equilibra and Gliscor greatly assist Hemogoblin by checking threats such as Great Tusk and opposing Gliscor. Ogerpon-W threatens Gliscor and Skeledirge for Hemogoblin while easily switching into Water-types such as Krilowatt. Together they can navigate around Venomicon and overwhelm it. With Taunt from Hemogoblin and Encore from Ogerpon-W, Venomicon quickly gets chipped and cannot easily recover HP without giving Hemogoblin setup opportunities. Plasmanta is also a great teammate, although more niche; it easily breaks through walls such as Venomicon, Cresceidon, Dondozo, and Skeledirge that Hemogoblin would otherwise struggle against. Plasmanta is also a great check to Ogerpon-W, which greatly threatens Hemogoblin. Entry hazards and duel screens leads such as Glimmora and Deoxys-S found on hyper offense greatly benefit Hemogoblin, giving it easier sweeping and setup opportunities.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652323, "username": "Anchor9"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Cresceidon": {
    "comments": "<h3>Other Options</h3> <p>Haze can remove boosts from setup sweepers that are faster than Cresceidon such as Swords Dance Iron Valiant and +1 Speed Caribolt, but Encore and Thunder Wave have broader use cases. Ice Beam is an option to beat Gliscor more consistently, but provides very little coverage otherwise.</p> <h3>Checks and Counters</h3> <p><strong>Bulky Poison-types</strong>: Venomicon, Mollux, and Galarian Slowking can all take advantage of Cresceidon's typing and threaten it with their Poison-type moves. The former two can also use it as an opportunity to set hazards, while the latter can use Future Sight. Plasmanta stonewalls Cresceidon, resisting Moonblast and being immune to Scald and Thunder Wave while simultaneously threatening it out with its STAB options.</p> <p><strong>Krilowatt</strong>: Krilowatt is largely unbothered by Cresceidon's moves and threatens it with Thunderbolt or the opportunity to pivot with Volt Switch into one of its teammates that also threaten Cresceidon.</p> <p><strong>Grass-types</strong>: Offensive Grass-types like Ogerpon-W, Caribolt, and Rillaboom can threaten Cresceidon out with their Grass-type STAB moves or annoy it with Knock Off. Malaconda is bulky enough to set sun and pivot out with Parting Shot, all while threatening to cripple Cresceidon with Knock Off or Glare. None of them appreciate being paralyzed or burned, however, so they cannot switch in completely freely.</p> <p><strong>Snaelstrom</strong>: If Snaelstrom is already poisoned, it can use Cresceidon lacking Encore as setup fodder or at the bare minimum as an opportunity to set or remove hazards. It also threatens it with the somewhat rare Toxic. However, it cannot switch in before its Poison Heal has activated in fear of getting burned by Scald or paralyzed by Thunder Wave, as both render it effectively useless.</p> <p><strong>Status</strong>: Cresceidon despises every status condition, as burn and poison both interfere with its Multiscale, while paralysis undermines its defining characteristic in its great Speed.</p>",
    "sets": {
      "Fast Wall": {
        "description": "<p>Cresceidon is a fantastic wall that can fit on most balance and bulky offense teams thanks to its great defensive typing, incredible base 124 Speed, and two amazing defensive abilities in Multiscale and Rough Skin. Thunder Wave allows it to cripple foes that outspeed it, such as Stratagem, Deoxys-S, and Choice Scarf Enamorus, while Encore punishes setup sweepers and slower Pokemon using their utility moves. The combination of Heavy-Duty Boots and Multiscale allows Cresceidon to withstand practically any hit regardless of entry hazards set on the field, making it an effective defensive pivot. It also allows Cresceidon to be used as a \"Get Out of Jail Free Card\" by being thrown in front of almost any wallbreaker or sweeper and stopping it in its tracks by tanking a hit and paralyzing the foe. Rocky Helmet in conjunction with Rough Skin can be utilized instead to punish foes using contact moves such as Landorus-T's U-turn and Weavile's Triple Axel. It also punishes opponents who try to mindlessly use Knock Off with Pokemon like Arghonaut, Great Tusk, and Roaring Moon. Cresceidon can use Tera Poison to avoid being poisoned by Venomicon and Galarian Slowking's Sludge Bomb and foes using Toxic while also checking Hemogoblin better. Tera Dragon is an option to shed its Electric and Grass weaknesses, becoming a solid check to foes such as Ogerpon-W, Rillaboom, and Caribolt.</p> <p>Hex Dragapult is a fantastic partner, checking the Electric- and Grass-types that threaten Cresceidon and running through paralyzed foes. Despite its commendable bulk and Fairy typing, Cresceidon is not the best Knock Off switch-in, as Heavy-Duty Boots aids it in soft-checking foes like Gholdengo and Stratagem. As such, a second Knock Off switch-in such as Gliscor, Skarmory, or Landorus-T is appreciated. If Rocky Helmet is the preferred item, then hazard removal options such as Equilibra, Great Tusk, and Corviknight help Cresceidon stay healthy. Equilibra is generally a great match with Cresceidon, taking on Electric-types such as Caribolt and Raging Bolt for it, while Cresceidon answers Water- and Fire-types such as Arghonaut, Walking Wake, Gouging Fire, and Volcarona. Together, they also can effectively check Hemogoblin without needing to expend Terastallization, as Equilibra can outspeed paralyzed Hemogoblin and OHKO most variants with Earth Power. Gliscor, Gholdengo, and Garganacl all alleviate Cresceidon's status weakness by switching into Toxic and Thunder Wave from the opponent's walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 273339, "username": "Lasen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 221710, "username": "Da Pizza Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  }
}