{
  "Charizard": {"sets": [{"name": "Special Attacker", "description": "<p>Solar Power should only be used on sun teams, as it's virtually useless otherwise. Tera Blast should be used with Tera Steel to reliably beat Carbink.</p> <p>Sample set. Stay tuned for updates!</p> "}, {"name": "Mixed Dragon Dance"}, {"name": "Setup Sweeper"}]},
  "Raichu": {"sets": [{"name": "Nasty Plot"}, {"name": "Choice"}]},
  "Dugtrio": {"sets": [{"name": "Swords Dance"}]},
  "Dugtrio-Alola": {"sets": [{"name": "Wallbreaker"}, {"name": "Choiced Attacker"}]},
  "Persian-Alola": {"sets": [{"name": "Pivot"}, {"name": "Nasty Plot"}]},
  "Golduck": {"sets": [{"name": "Rain Sweeper"}, {"name": "Choice Scarf"}]},
  "Electrode": {"sets": [{"name": "Pivot"}, {"name": "Rain Setter"}]},
  "Flareon": {"sets": [{"name": "Wish Passer"}]},
  "Articuno": {"sets": [{"name": "Defensive Pivot"}, {"name": "Offensive Pivot"}]},
  "Dragonair": {"sets": [{"name": "Dragon Dance"}]},
  "Ampharos": {"sets": [{"name": "Assault Vest"}]},
  "Murkrow": {"sets": [{"name": "Weather Setter", "description": "<p>Thunder Wave supports teammates that are still rather slow even under rain or sun like Beartic and Scovillain, respectively. Taunt denies entry hazards, recovery, and status moves. Haze neutralizes setup sweepers like Masquerain, Lilligant, and Hisuian Sliggoo.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Misdreavus": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Defensive Misdreavus is the glue that holds PU together because of its ability to deal with many of the strongest physical attacking presences in the metagame, such as Lycanroc-N, Alolan Dugtrio, and Perserkerr. It has a very strong type for this tier, with very few Pokemon able to hit it for super effective damage. It is also the best Rapid Spin blocker in PU because of this. Will-O-Wisp is great for crippling physical attackers like Lycanroc-N, Gabite, and Alolan Dugtrio. Choosing to run Thunder Wave over Will-O-Wisp can make dealing with Alolan Dugtrio and Gabite more difficult. With Misdreavus able to spread status so well, Hex is the best choice for its STAB move. Power Gem is quad effective against Articuno, Masquerain, and Charizard; it also hits other popular Pokemon like Houndoom, Pyroar, and Rotom-F for super effective damage. Thunderbolt can be opted for instead to better hit Water-types like Golduck, Lumineon, Basculin, and Quaxwell. Taunt is also an option over the two attacking moves to disallow setup sweepers such as Gogoat and Carbink from boosting in front of Misdreavus; it also works well at stopping entry hazard setters such as Carbink, Gabite, and Camperupt. The EV spread allows for better recovery with Pain Split by keeping Misdreavus's HP a bit lower than if 252 HP EVs were used while still keeping its overall bulk by adding the EVs taken from HP into both defensive stats. 56 Speed EVs let it out speed neutral natured Honchkrow and Flapple, as well as Timid Glimmet and uninvested Drakloak. Tera Fighting and Tera Fairy both work well to provide a resistance to Dark-type moves from Pokemon like Honchkrow and Alolan Perisan. Although, Tera Fighting leaves Misdreavus vulnerable to Flying-type moves from Articuno, Charizard, and Masquerain and Psychic-type moves from Rabsca and Indeedee-F. On the other hand, Tera Fairy leaves it vulnerable to Steel-type moves from Perrserker and Alolan Dugtrio. Tera Electric is great for boosting Thunderbolt and giving Misdreavus zero weaknesses with its ability. Tera Rock boosts Power Gem, letting it OHKO Charizard and Masquerain.</p> <p>Misdreavus works well on balance teams looking for a catch-all defensive Pokemon to deal with many of the metagame's top threats. It also works great on entry hazard stacking teams since it is not bothered by the top Rapid Spin user, Quaxwell. Misdreavus thrives when given teammates like Carbink, Daschbun, and Tinkatuff to deal with Dark-types such as Alolan Persian, Houndoom, and Skuntank. These same Dark-type threats, Alolan Persian, Houndoom, and Skuntank, can help deal with Ghost-type foes like Banette, Drakloak, and opposing Misdreavus. Specially defensive walls like Articuno, Carbink, and Tinkatuff form a nice core with Misdreavus since it can cover physical Pokemon that give them trouble, like Lycanroc-N, Perrserker, and Alolan Dugtrio. Knock Off absorbers and status absorbers are highly recommended to keep Misdreavus healthy enough to deal with all of these Pokemon. Status absorbers are the likes of RestTalk Gabite, Dragonair, and Zangoose, while Knock Off absorbers are usually Dark-types like Alolan Persian and Skuntank.</p> "
      },
      {"name": "Offensive"}
    ],
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "uhBella", "user_id": 567483}, {"username": "Hera", "user_id": 414072}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Dunsparce": {"sets": [{"name": "Stealth Rock"}]},
  "Sneasel": {"sets": [{"name": "Swords Dance"}]},
  "Houndoom": {"sets": [{"name": "Nasty Plot"}, {"name": "Choice Scarf"}]},
  "Pupitar": {"sets": [{"name": "Dragon Dance", "description": "<p>The investment in bulk lets Pupitar avoid being OHKOed by Raichu's Surf from full after Stealth Rock and makes Jolly Honchkrow's Night Slash only a 3HKO. 152 Speed EVs allow Pupitar to outrun Raichu at +2. Stone Edge is stronger than Rock Slide but has less PP and lower accuracy. Tera Dragon and Tera Water both patch up Pupitar's Water weakness, but the former also lets it resist Grass- and Electric-type attacks while the latter helps more against Ice-type attacks.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Masquerain": {
    "sets": [
      {
        "name": "Quiver Dance",
        "description": "<p>Masquerain functions as a threatening Quiver Dance sweeper thanks to its high-powered STAB attacks and extensive coverage, including rare access to Hydro Pump, which allow it to pressure opposing teams without being overreliant on Terastallization. Hydro Pump hits Charizard, Pyroar, and Carbink and, together with Hurricane, provides neutral coverage for the entire metagame. Tera Blast Steel lets Masquerain beat targets such as Carbink and Articuno reliably, as well as set up more easily on targets like Gogoat and Misdreavus that can otherwise threaten it with coverage. Alternatively, Tera Water boosts Hydro Pump's damage output further and improves its matchup against Fire-types like Charizard. Other coverage options include Ice Beam, which helps Masquerain reliably beat Gabite, and Bug Buzz, which gives Masquerain a more reliable STAB move that can threaten Dark- and Psychic-types like Alolan Persian and Indeedee-F and deal neutral damage to threats like Raichu.</p> <p>Masquerain appreciates teammates like Raichu, Electrode, Alolan Persian, and Lumineon that can bring it in safely with pivoting moves. Raichu can also notably use Tera Water or Tera Ice to check fast Electric-types like Choice Scarf Rotom-F and generate free switch-in and setup opportunities for Masquerain with Encore. Ground-types like Whiscash, Alolan Dugtrio, and Gabite can reliably switch into and threaten Tinkatuff, which can cripple Masquerain with Thunder Wave or Encore; Whiscash also greatly helps against Choice Scarf Lycanroc-N, which outspeeds and can revenge kill Masquerain after one boost, and facilitates wallbreaking with Spikes, while Masquerain and Alolan Dugtrio can set up on each other's checks. Grass-types like Gogoat can switch into some Electric-types like Electrode and Pokemon like Whiscash that may threaten Masquerain with Rock-type coverage; they also pressure Pokemon like Carbink better alongside Masquerain. In return, Masquerain can pressure targets like Charizard and Articuno depending on its Tera type. Indeedee-F can provide Masquerain with Healing Wish support, allowing it to attempt setup more than once in a game, as well as Psychic Terrain to prevent priority users like Skuntank and Honchkrow from revenge killing Masquerain if it has already Terastallized.</p> "
      },
      {
        "name": "Sticky Web Lead",
        "description": "<p>With its combination of a good Speed tier, Intimidate, and solid offensive capability after setting Sticky Web, Masquerain is PU's premier Sticky Web lead. Hurricane is Masquerain's normal STAB move of choice, allowing it to hit Pokemon such as Gogoat and opposing Masquerain for good damage. However, Bug Buzz can be used instead, hitting mostly the same targets as Hurricane and being more accurate at the cost of power. Hydro Pump is coverage for Fire-types such as Charizard and Carkol, as well as Carbink and Alolan-Dugtrio, although Surf can be used instead of Hydro Pump, trading off power for accuracy. Masquerain's fourth moveslot is very flexible; U-turn can be used to pivot into a partner Pokemon after setting up Sticky Web and Quiver Dance can make Masquerain more offensively threatening after setting up Sticky Web. Ice Beam can OHKO Dartrix and Gabite, but it is hard to fit, as Masquerain normally finds more usage out of U-turn and Quiver Dance. Masquerain can Terastallize into the Ghost type to prevent spinners such as Quaxwell and Carkol from removing its Sticky Web. Masquerain can also run Heavy-Duty Boots to ease Sticky Web setup later in the game at the cost of being a less effective lead, as well as run Tera Steel for easier setup with Quiver Dance if spinblocking is not a concern.</p> <p>Masquerain's most common teammates are ones that take advantage of Sticky Web slowing down their grounded offensive checks, so wallbreakers such as Swords Dance Zangoose, Squawkabilly, and Choice Band Basculin-B are great partners. Ghost-types such as Misdreavus and Banette spinblock for Masquerain to keep Sticky Web on the field, and Sticky Web allows them to spread status more easily to normally faster threats such as opposing Basculin-B. Electric- and Rock-types such as Raichu and Choice Scarf Lycanroc-N help deal with the Flying-types that annoy Masquerain and its teammates, such as Rotom-S, as they are immune to Sticky Web.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "rien", "user_id": 474994}, {"username": "uhBella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "gum", "user_id": 434150}, {"username": "Hera", "user_id": 414072}]}, {"name": "Grammar checked by", "members": [{"username": "asa", "user_id": 400292}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Vigoroth": {"sets": [{"name": "Bulk Up"}]},
  "Swalot": {"sets": [{"name": "Defensive"}]},
  "Camerupt": {"sets": [{"name": "Specially Defensive"}, {"name": "Trick Room Attacker"}]},
  "Grumpig": {"sets": [{"name": "Nasty Plot", "description": "<p>136 Speed EVs let Grumpig outspeed Modest Glaceon. 44 SpA EVs allow unboosted Tera Ground Grumpig to KO offensive Skuntank with Earth Power after Stealth Rock damage.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Zangoose": {"sets": [{"name": "Toxic Boost"}]},
  "Whiscash": {"sets": [{"name": "Defensive"}]},
  "Banette": {"sets": [{"name": "Swords Dance"}]},
  "Vespiquen": {"sets": [{"name": "Spikes"}]},
  "Honchkrow": {"sets": [{"name": "Moxie Sweeper"}, {"name": "Special Attacker"}]},
  "Skuntank": {"sets": [{"name": "Physically Offensive", "description": "<p>Tera Blast should only be used if Skuntank opts for Tera Ground; this allows it to nail Steel-types like Perrserker and Tinkatuff, Hisuian Qwilfish, and opposing Skuntank.</p> <p>Sample set. Stay tuned for updates!</p> "}, {"name": "Nasty Plot"}, {"name": "Choice Scarf"}, {"name": "Specially Defensive"}]},
  "Gabite": {"sets": [{"name": "Stealth Rock"}, {"name": "RestTalk"}, {"name": "Swords Dance"}]},
  "Lumineon": {"sets": [{"name": "Defensive Pivot"}]},
  "Leafeon": {"sets": [{"name": "Wish", "description": "<p>X-Scissor hits opposing Grass-types like Flapple and Gogoat; if these Pokemon aren't a concern, Leafeon can run Yawn to force switches, Leech Seed for additional recovery, or Swords Dance to make up for its relative passivity.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Glaceon": {"sets": [{"name": "Calm Mind"}, {"name": "Choice Specs"}]},
  "Rotom-Frost": {"sets": [{"name": "Offensive Pivot"}, {"name": "Choice Scarf"}]},
  "Rotom-Fan": {"sets": [{"name": "Pivot"}, {"name": "Choice Scarf"}]},
  "Basculin": {"overview": "<p>Note: Despite the two variants being very similar, Basculin-Blue-Striped is generally considered superior due to having access to two viable abilities (Adaptability and Rock Head), which makes it harder for your opponent to predict which set you're using.</p> ", "sets": [{"name": "Adaptability"}, {"name": "Choice Specs"}]},
  "Sawsbuck": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Scarf"}]},
  "Beartic": {"sets": [{"name": "Rain Sweeper"}]},
  "Quilladin": {"sets": [{"name": "Defensive Spikes", "description": "<p>Stone Edge threatens Fire- and Flying-types like Charizard, Vespiquen, and Honchkrow. Poison Jab prevents Quilladin from being walled by opposing Grass-types, such as Gogoat and Lilligant. Leech Seed offers additional recovery and decreases how often Quilladin needs to use Synthesis. Tera Rock helps against the aforementioned Fire- and Flying-types on top of powering up Stone Edge, but Tera Ghost can be used instead for spinblocking.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Frogadier": {"sets": [{"name": "Choice Scarf"}]},
  "Pyroar": {"sets": [{"name": "Special Attacker"}, {"name": "Choice"}]},
  "Gogoat": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Gogoat is a solid defensive wincon, able to boost past special threats like Indeedee-F and Charizard late-game thanks to its great special bulk, usage of Terastallization, and recovery in Horn Leech and Milk Drink. It is also a solid switch-in to Water-types like Whiscash and Basculin, comfortably taking their STAB moves and threatening to OHKO them or set up. Bulk Up is what lets Gogoat become so threatening late-game, letting it take on physical attackers like Perserrker and Sawsbuck after a Bulk Up or two. Rock Slide is optimal coverage alongside Horn Leech, hitting Grass-type checks like Charizard, Honchkrow, and Articuno. Heavy-Duty Boots lets Gogoat ignore entry hazards, namely the otherwise debilitating Toxic Spikes. Water is the premier Tera type due to its overall defensive utility, reversing Gogoat's Fire weakness and making it take Flying- and Bug-type attacks more easily, which lets it set up on various foes it could not before such as Charizard, Rabsca, and Camerupt. However, Tera Rock gives Gogoat STAB on Rock Slide while still having it resist Fire and Flying, but it becomes vulnerable to Ground- and Steel-types like Gabite and Perrserker. Both Tera types keep Gogoat's usefulness as a Grass-type check due to Sap Sipper.</p> <p>Before Terastallizing or setting up, Gogoat is threatened by common offensive Pokemon like Charizard, Pyroar, and Rotom-F, so additional special walls like Carbink and Ampharos are recommended as partners. Carbink can also set entry hazards to wear down Gogoat's checks like Gabite and Tinkatuff, while Ampharos can bring Gogoat in with Volt Switch. Pokemon like Basculin and Alolan Dugtrio appreciate having a Pokemon that can come in on Electric- and Grass-types like Raichu and Leafeon. Misdreavus is particularly annoying for Gogoat, able to cripple it with Will-O-Wisp + Hex and use it at setup bait, so ways to dispose of or significantly weaken Misdreavus are appreciated. Wallbreakers like Nasty Plot Skuntank, special Honchkrow, and Indeedee-F can threaten Misdreavus while not caring about Will-O-Wisp, while paralysis from Tinkatuff and Alolan Persian can help Gogoat brute force its way past Misdreavus.</p> "
      },
      {"name": "Choice Band"},
      {"name": "Assault Vest"}
    ],
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "rien", "user_id": 474994}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Carbink": {"sets": [{"name": "Stealth Rock"}, {"name": "Iron Defense"}]},
  "Dartrix": {"sets": [{"name": "Defog"}]},
  "Crabominable": {"sets": [{"name": "Assault Vest"}, {"name": "Bulk Up"}, {"name": "Trick Room Attacker"}]},
  "Lycanroc-Midnight": {"sets": [{"name": "Choice Scarf"}]},
  "Mareanie": {"sets": [{"name": "Defensive"}]},
  "Thwackey": {"sets": [{"name": "Choice"}]},
  "Carkol": {"sets": [{"name": "Rapid Spin"}]},
  "Flapple": {"sets": [{"name": "Choice Band"}, {"name": "Choice Scarf"}, {"name": "Choice Specs"}, {"name": "Dragon Dance"}]},
  "Perrserker": {"sets": [{"name": "Stealth Rock"}, {"name": "Offensive"}]},
  "Falinks": {"sets": [{"name": "No Retreat"}, {"name": "Choice"}]},
  "Pincurchin": {"sets": [{"name": "Specially Defensive"}]},
  "Stonjourner": {"sets": [{"name": "Stealth Rock"}, {"name": "Double Dance"}]},
  "Indeedee-F": {"sets": [{"name": "Choice"}, {"name": "Calm Mind"}]},
  "Drakloak": {"sets": [{"name": "RestTalk"}, {"name": "Offensive Pivot"}]},
  "Calyrex": {"sets": [{"name": "Double Dance"}]},
  "Quaxwell": {"sets": [{"name": "Rapid Spin"}]},
  "Spidops": {"sets": [{"name": "Entry Hazard Lead"}, {"name": "Heavy-Duty Boots"}]},
  "Dachsbun": {"sets": [{"name": "Wish Passer", "description": "<p>The Speed investment lets Dachsbun outrun neutral-natured Honchkrow. An alternative EV spread is 252 HP / 60 Def / 132 SpD / 64 Spe, which, with an Impish nature, allows Dachsbun to OHKO Hasty Houndoom with Body Press while still checking special attackers.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Squawkabilly": {"sets": [{"name": "Guts Attacker"}, {"name": "Pivot"}, {"name": "Choice Scarf"}]},
  "Squawkabilly-Blue": {"sets": [{"name": "Guts Attacker"}, {"name": "Pivot"}, {"name": "Choice Scarf"}]},
  "Scovillain": {"sets": [{"name": "Sun Sweeper", "description": "<p>Scovillain should only use a Mild nature with 4 Attack EVs if it's running Stomping Tantrum; otherwise, it should opt for a Modest nature, invest the leftover EVs in Defense, and run 0 Attack IVs.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Rabsca": {"sets": [{"name": "Offensive Trick Room"}, {"name": "Bulky Setup"}, {"name": "Trick Room Setter"}]},
  "Tinkatuff": {"sets": [{"name": "Stealth Rock"}]},
  "Wugtrio": {"sets": [{"name": "Choice Band"}]},
  "Glimmet": {"sets": [{"name": "Suicide Lead"}, {"name": "Specially Defensive"}]}
}