{
  "Venusaur": {"sets": {"Sun Sweeper": {}}},
  "Blastoise": {"sets": {"Shell Smash": {}}},
  "Vileplume": {"sets": {"Phyiscally Defensive": {}}},
  "Slowbro": {"sets": {"Defensive": {}, "Calm Mind": {}}},
  "Slowbro-Galar": {"sets": {"Defensive": {}}},
  "Muk-Alola": {"sets": {"RestTalk": {}}},
  "Cloyster": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Shell Smash Sweeper": {}}},
  "Gengar": {"sets": {"Choice Scarf": {}, "Hex + Will-O-Wisp": {}, "Nasty Plot": {}}},
  "Chansey": {"sets": {"Defensive": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Ditto": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Imposter": {"description": "<p>Tera Steel makes Ditto immune to Toxic Spikes and take less from Stealth Rock. It also lets Ditto revenge kill Belly Drum Hariyama. A Quiet nature and the Special Attack investment is in case Ditto transforms into a Future Sight user like Slowbro.</p>"}}},
  "Vaporeon": {"sets": {"Defensive": {}}},
  "Zapdos-Galar": {"sets": {"Choice Scarf": {}, "Choice Band": {}}},
  "Mew": {"sets": {"Nasty Plot": {}, "Double Dance": {}}},
  "Typhlosion-Hisui": {"sets": {"3 Attacks + Will-O-Wisp": {}, "Choice Scarf": {}}},
  "Feraligatr": {"sets": {"Dragon Dance": {}}},
  "Politoed": {"sets": {"Rain Setter": {}}},
  "Quagsire": {"sets": {"Physically Defensive": {}}},
  "Espeon": {"sets": {"Choice Specs": {}, "Calm Mind": {}, "Choice Scarf": {}}},
  "Umbreon": {"sets": {"Wish Support": {}}},
  "Forretress": {"sets": {"Support": {}}},
  "Gligar": {"sets": {"Utility": {}}},
  "Kingdra": {"sets": {"Rain Sweeper": {}}},
  "Raikou": {"sets": {"Calm Mind": {}, "Offensive Pivot": {}}},
  "Entei": {"sets": {"Choice Band": {}}},
  "Suicune": {"sets": {"Calm Mind": {}}},
  "Swampert": {"sets": {"Defensive Utility": {}}},
  "Gardevoir": {"sets": {"Choice Scarf": {}}},
  "Breloom": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Flygon": {"sets": {"Choice Scarf": {}}},
  "Crawdaunt": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Milotic": {"sets": {"Defensive": {}}},
  "Salamence": {"sets": {"Special Attacker": {}, "Dragon Dance": {}}},
  "Jirachi": {
    "sets": {
      "Utility": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Jirachi provides speed control and offensive pivoting for many team structures. Defensively, Jirachi is a great team presence because of its great defensive typing and natural bulk, with 100 base stats across the board providing it with the longevity needed to switch into several attacks for its teammates. Iron Head is the most reliable STAB option for Jirachi to use since it has adequate base power, is neutral into a majority of the metagame, and boasts a high flinch rate. U-turn is a safe pivot move, allowing powerful partners to come in freely. Choice Scarf Jirachi uses Trick to hinder would-be checks like Amoonguss and Hippowdon, which can also greatly help teammates that struggle against these defensive walls like Revavroom and Terrakion. Healing Wish can give a second opportunity to a teammate that may otherwise not have enough health to get back into a game reliably. Using a Jolly nature with max Attack and Speed enables Jirachi to outspeed a majority of the tier, tying with other Choice Scarf users like Galarian Zapdos or Dragon Dance Salamence after a Speed boost. Tera Steel is run to maximize its damage output with Iron Head, which can allow Jirachi to potentially flinch its way through the opponent's physical wall, along with hitting several notable benchmarks like OHKOing Terrakion and 2HKOing Noivern and Galarian Zapdos.</p> <p>Choice Scarf Jirachi is primarily seen in offense and balance structures, where it can pack speed control, support, disruption, and a solid defensive profile into one slot. Jirachi is one of the best switch-ins to Fairy- and Poison-types in the tier, as well as having key resistances to Dragon- and Psychic-type attacks, making it a reliable option to take a Gardevoir or Fezandipiti Moonblast or Salamence Outrage. Teammates weak to Fairy-type moves, such as strong Dragon- or Fighting-types like Salamence and Terrakion, are grateful for Jirachi's presence on the team to fall back on. Taking advantage of Choice Scarf Jirachi's ability to hinder and chip at physically defensive walls like Amoonguss, Hippowdon, and Palossand, teammates such as Revavroom, Mimikyu, and Okidogi can position themselves to set up reliably. Teammates that lack recovery such as Armarouge and Galarian Zapdos can function as both mid-game breakers and late-game cleaners when paired with Healing Wish support from Jirachi.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamingoPokeman"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Deoxys-Defense": {"sets": {"Utility": {}}},
  "Torterra": {"sets": {"Shell Smash Sweeper": {}}},
  "Infernape": {"sets": {"Physical Attacker": {}, "Nasty Plot": {}}},
  "Empoleon": {"sets": {"Specially Defensive": {}}},
  "Floatzel": {"sets": {"Choice Band": {}}},
  "Gastrodon": {"sets": {"Specially Defensive": {}}},
  "Bronzong": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Stealth Rock": {}, "Bulky Setup Sweeper": {}}},
  "Lucario": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Nasty Plot": {}}},
  "Hippowdon": {
    "overview": "<p>Hippowdon is one of the best physical walls in the tier, excelling thanks to its high base HP and Defense as well as the difficult to break pure Ground typing. Hippowdon has the best raw physical bulk compared to other physical walls such as Slowbro, Chesnaught, and Amoonguss. This bulk allows it to take neutral hits exceptionally well, making it a safe switch-in to unresisted moves like Terrakion’s Close Combat and Galarian Zapdos’s Brave Bird. As it is taking these hits, it is wearing foes  down through passive damage from the sand it summons. It also has many chances to switch in, giving it plenty of opportunities to set up Stealth Rock. Hippowdon is the anchor for most balance teams in the tier, putting in work and making progress in basically every game. However, Hippowdon can struggle with particularly strong wallbreakers like Choice Band Okidogi or Galarian Zapdos because does not resist their STAB attacks and struggles to take them effectively, and it is also vulnerable to passive damage such as entry hazards.</p>",
    "comments": "<p>Other Options</p> <p>====</p> <p>Certain teams such as ones with Pokemon running Synthesis or that have teammates that dislike passive sandstorm chip such as Alolan Muk and Suicune would prefer Sand Force, effectively giving it no ability. Sand Force also makes it easier to Terastallize Hippowdon, since it doesn’t have to worry about its own sandstorm and has a better matchup into other Hippowdon due to its stronger Earthquake. Hippowdon can also run varying amounts of Special Defense in order to better match up against special attackers — for example, 140 Special Defense EVs to survive two Photon Geysers from Necrozma  — but Hippowdon often relies on maximum physical bulk to take neutral physical attacks.</p> <p>Checks and Counters</p> <p>====</p> <p><strong>Ground-immune Pokemon</strong>: Mono-Earthquake Hippowdon is unable to hit Ground-immune foes at all, making Rotom-H, Thundurus, Salamence, and Noivern incredibly safe switch-ins to it.</p> <p><strong>Grass-types</strong>: Hippowdon with Stone Edge can hit Ground-immune foes but can't do any real damage to Grass-types such as Chesnaught.</p> <p><strong>Special Attackers</strong>: Hippowdon's low Special Defense and reliance on Defense investment means it is vulnerable to special attacks even from uninvested attackers. Pokemon like Gengar and Gardevoir are attackers that Hippowdon does not want to switch in on, and bulky Pokemon with decent special damage such as Slowbro and Reuniclus are able to take Hippowdon's Earthquakes and threaten it in return.</p> <p><strong>Wallbreakers with Entry Hazard Support</strong>: Pokemon like Choice Band Okidogi, Terrakion, and Mienshao can overcome Hippowdon's raw physical bulk with the help of chip damage such as hazard support. Okidogi's Close Combat is favored to 2HKO Hippowdon from full with Stealth Rock up and is guaranteed to 2HKO with a single layer of Spikes.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Set Details</p> <p>===</p> <p>The tier is full of threatening physical attackers, and Hippowdon handles most of them with ease, switching into attacks from Pokemon like Terrakion, Revavroom, Kleavor, Krookodile, Maushold, and Bisharp. Hippowdon's sand provides passive damage and helps disarm other weather teams by removing their weather. Stealth Rock is the most common option, as Hippowdon makes a good setter due to its many chances to switch in and good matchup against Cyclizar, the tier's best spinner. Whirlwind gives Hippowdon the option to force out setup sweepers or rack up chip damage against foes trying to switch into Earthquake. Whirlwind is preferred over Roar due to Throat Chop Bisharp blocking the latter move. Stone Edge is a coverage  option to hit Flying-types trying to switch into the normally passive Hippowdon, allowing it to turn the tables on matchups like Thundurus or Noivern. Stone Edge also helps to break Air Balloon on Pokemon such as Revavroom that try to turn Hippowdon into a setup opportunity. Rocky Helmet is the most common item due to its importance in dealing with Maushold, a Pokemon that can otherwise threaten to sweep teams on its own, while also providing chip damage against physical attackers. However, teams with other answers to Maushold or that don’t need the passive damage can instead run Leftovers or Heavy-Duty Boots. Tera Ghost is an all-around strong defensive type that blocks Rapid Spin from Cyclizar, allows it to take on Terrakion even after a Swords Dance boost, and beats other Fighting types like Conkeldurr and Slither Wing. Tera Dragon removes Hippowdon's weaknesses to Grass and Water, being especially helpful against rain teams. Tera Poison gives Hippowdon a resistance to Grass, Fairy, and Fighting and makes Hippowdon immune to Toxic and able to absorb Toxic Spikes, being useful on teams that are otherwise weak to them.</p> <p>Hippowdon is common on bulky offense and balance teams. However, Hippowdon’s weaknesses must be accounted for in teambuilding, especially when considering the set it runs. Whirlwind Hippowdon needs to be paired with something that can handle Ground immune Pokemon like Noivern, Thundurus, and Rotom-H well. Assault Vest Cyclizar and Rotom-H are two Pokemon that can safely switch into them. While Hippowdon is able to switch into strong Fighting-type attacks from Pokemon like Terrakion and Mienshao when fully healthy, it loses this resilience with even just a little bit of chip damage. Therefore, Hippowdon should be paired with a more sturdy Fighting resistant Pokemon such as Slowbro or Reuniclus. Hippowdon without Whirlwind may require extra support for physical setup sweepers. Choice Scarf users faster than Salamence, such as Mienshao, Terrakion, Gengar, and Hisuian Zoroark, can all fill this role. Non-Stealth Rock Hippowdon should be paired with another Stealth Rock setter such as Empoleon or Jirachi.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598717, "username": "Sneakyplanner"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Toxicroak": {"sets": {"Swords Dance": {}}},
  "Magnezone": {"sets": {"Choice Specs": {}, "Assualt Vest": {}}},
  "Yanmega": {"sets": {"Speed Boost Sweeper": {}}},
  "Porygon-Z": {"sets": {"Choice": {}}},
  "Froslass": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Spikes Lead": {}}},
  "Rotom-Heat": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Azelf": {"sets": {"Expert Belt": {}, "Choice Scarf": {}, "Offensive Stealth Rock": {}}},
  "Cresselia": {"sets": {"Bulky Calm Mind": {"description": "<p>136 Speed EVs allows Cresselia to outspeed Modest Volcanion.</p>"}, "Fast Calm Mind": {"description": "<p>216 Speed EVs with Timid Nature allows Cresselia to outspeed Max Speed positive nature Hoopa-Unbound.</p>"}}},
  "Conkeldurr": {"sets": {"Guts Wallbreaker": {}}},
  "Krookodile": {"sets": {"Choice Scarf": {}, "Stealth Rock": {}, "Bulk Up": {}, "Choice Band": {}}},
  "Zoroark-Hisui": {"sets": {"Choice": {}, "Nasty Plot": {}}},
  "Cinccino": {"sets": {"Tidy Up": {}}},
  "Reuniclus": {"sets": {"Calm Mind Sweeper": {}}},
  "Amoonguss": {"sets": {"Defensive": {}}},
  "Mienshao": {"sets": {"Life Orb": {}, "Choice Scarf": {}}},
  "Bisharp": {"sets": {"Swords Dance": {}}},
  "Terrakion": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Stealth Rock": {}}},
  "Thundurus": {"sets": {"Nasty Plot": {}, "Offensive Pivot": {}}},
  "Chesnaught": {"sets": {"Spikes": {}}},
  "Talonflame": {"sets": {"Utility": {}}},
  "Dragalge": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Utility": {"description": "<p>132 Speed EVs are to outrun uninvested Sylveon.</p>"}, "Choice Specs": {"description": "<p>172 Speed EVs are to outrun uninvested Umbreon and Vaporeon.</p>"}}},
  "Klefki": {"sets": {"Spikes": {}}},
  "Noivern": {"sets": {"Offensive Pivot": {}}},
  "Diancie": {"sets": {"Stealth Rock": {}}},
  "Volcanion": {"sets": {"Offensive": {}}},
  "Incineroar": {"sets": {"Defensive Pivot": {}}},
  "Oricorio-Pom-Pom": {"sets": {"Quiver Dance Sweeper": {}}},
  "Lycanroc-Dusk": {"sets": {"Swords Dance": {}, "Choice Band": {}}},
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Salazzle": {"sets": {"Substitute + Toxic": {}, "Offensive": {}}},
  "Tsareena": {"sets": {"Rapid Spin": {}}},
  "Palossand": {"sets": {"Defensive": {}}},
  "Mimikyu": {"sets": {"Swords Dance": {}}},
  "Necrozma": {"sets": {"Stealth Rock": {}, "Offensive Trick Room": {}, "Dragon Dance": {}}},
  "Inteleon": {"sets": {"Choice Specs": {}}},
  "Barraskewda": {"sets": {"Rain Sweeper": {}}},
  "Toxtricity": {"sets": {"Wallbreaker": {}, "Offensive Pivot": {}, "Shift Gear": {}}},
  "Regidrago": {"sets": {"Choice Specs": {}, "Dragon Dance": {}, "Choice Scarf": {}}},
  "Kleavor": {"sets": {"Lead": {}, "Choice Scarf": {}}},
  "Basculegion-F": {"sets": {"Choice Scarf": {}, "Choice Specs": {}, "Rain Wallbreaker": {}}},
  "Overqwil": {"sets": {"Rain Sweeper": {}, "Defensive": {}}},
  "Maushold": {"sets": {"Tidy Up": {}}},
  "Maushold-Four": {"sets": {"Tidy Up": {}}},
  "Armarouge": {"sets": {"Calm Mind": {}, "Weakness Policy": {}}},
  "Bellibolt": {"sets": {"Mr. Belli (Defensive)": {}}},
  "Kilowattrel": {"sets": {"Offensive Pivot": {}}},
  "Revavroom": {
    "overview": "<p>Shift Gear Revavroom is one of the most threatening late-game sweepers in the tier, as with its access to Shift Gear and great defensive typing, all it needs is one boost to offensively overwhelm most of the tier. Setting up is made easier with its ability, Filter, which allows it to take a Flamethrower from Pokemon like Galarian Weezing and Noivern. Revavroom also has access to useful coverage moves that allow it to threaten Steel-, Poison-, and Fire-types. Nevertheless, Revavroom is quite frail, as its poor Special Defense and reliance on Air Balloon to set up can be exploited by Ground-types, especially Hippowdon, Krookodile, Quagsire, and Palossand, as they can take a +1 hit from full HP and OHKO it back.</p>",
    "comments": "<h3>Other Options</h3> <p>Revavroom can opt to run Tera Blast Grass, which threatens Water- and Ground-types such as Slowbro, Quagsire, Hippowdon, and Krookodile. Temper Flare is also an option to take down Steel-types with a Ground immunity such as Bronzong and Tera Steel Rotom-H, as well as helping against opposing Revavroom. Temper Flare can also be boosted with Tera Fire, making Revavroom immune to burn. Finally, Taunt is a solid option to completely wall and set up on Quagsire and Whirlwind Hippowdon with Air Balloon as well as to block Will-O-Wisp from Galarian Weezing. Tera Flying + Taunt is a good combination to completely shut down Whirlwind Hippowdon and Quagsire even after Air Balloon breaks. Revavroom can also opt to run Leftovers + Magnet Rise to get rid of its Ground weakness and set up on Ground-types more easily. Clear Amulet can also be used to block Intimidate from Krookodile and Salamence. Toxic is an option to put bulky Fire- and Water-type switch-ins on a timer. Toxic Spikes allows Revavroom to take advantage of the free turns it generates. Toxic and Toxic Spikes could be used on a Choice Scarf Revavroom set, which could be a decent source of role compression also capable of pivoting using Parting Shot.</p> <h3>Checks and Counters</h3> <p><strong>Levitate Steel-types</strong>: Steel-types with Levitate are immune to Gunk Shot and High Horsepower and resist Iron Head. As such, Pokemon such as Bronzong and Tera Steel Rotom-H are the sturdiest answers to Revavroom.</p> <p><strong>Bulky Ground-types</strong>: Revavroom fails to KO bulky Ground-types such as Hippowdon, Quagsire, and Palossand even after a Shift Gear boost, and they threaten to KO it.</p> <p><strong>Bulky Water-types</strong>: Bulky Water-types such as Slowbro, Quagsire, and Gastrodon deal with Revavroom quite well, potentially burning it with Scald in Slowbro's case or outright KOing it with Ground-type STAB moves in Quagsire and Gastrodon's cases. They do lose to Tera Grass variants, however.</p>",
    "sets": {
      "Shift Gear": {
        "description": "<h4>Set Details</h4> <p>Revavroom is a one-dimensional Pokemon that focuses solely on setting up with Shift Gear and sweeping the opposing team. With an Adamant nature, a single Shift Gear lets Revavroom outspeed all relevant Choice Scarf users. Revavroom has access to Gunk Shot and High Horsepower, which give it excellent coverage; Gunk Shot nearly or straight-out KOes defensive staples like Fezandipiti and Chesnaught after one Shift Gear, while High Horsepower hits Steel- and Poison-types, which resist or are immune to Gunk Shot. Iron Head gives it a reliable STAB move that also hits Ground-types. Tera Ground gives Revavroom an additional STAB move in High Horsepower, which allows it to grab crucial OHKOs such as Bisharp, Volcanion, and Fezandipiti after one Shift Gear boost.</p> <p>Revavroom is a staple on hyper offense teams, and its role is usually to clean late-game. Therefore, it prefers wallbreakers and other setup sweepers such as Terrakion, Basculegion-F, Shell Smash Blastoise, and Yanmega as partners. The usual gameplan with Revavroom is wearing down Steel- and Fire-types with it, allowing another sweeper such as Mimikyu or Blastoise to clean. The opposite is also true, as Blastoise and Yanmega can weaken bulky Ground- and Water-types for Revavroom to sweep late-game. Revavroom should usually be brought in after a teammate has been KOed to ensure that Air Balloon remains intact and it is at near full health, as it is frail defensively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231398, "username": "feen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Cyclizar": {
    "sets": {
      "Assault Vest": {
        "description": "<p>Assault Vest Cyclizar can safely switch into most special attackers and provide opportunities for its teammates to enter the game thanks to U-turn. Rapid Spin clears entry hazards while also granting Cyclizar a boost to Speed, which helps it outspeed most Choice Scarf users in the tier like Gardevoir and Gengar. It also gives even a paralyzed Cyclizar the opportunity to pivot out of slower opponents like Empoleon and Hippowdon. Knock Off can hit the tier's Pyschic-types such as Reuniclus and Slowbro for decent damage while also threatening the frail Ghost-types like Gengar and Hisuian Zoroark. Draco Meteor can be used to hit physical walls like Hippowdon and Slowbro. Dragon Tail is great at forcing opposing setup sweepers like Cresselia and Slowbro out. Facade can take advantage of status like burn or paralysis that Cyclizar may be inflicted by throughout the course of a game from opposing Reuniclus, Slowbro, and Thundurus. Assault Vest helps with its otherwise low natural bulk, which is also helped significantly by Regenerator recovery. Timid maximum Speed Cyclizar is faster than the majority of the tier, and the bulk provided allows it to survive a +2 Modest Blastoise Ice Beam along with taking two Ice Beams or Sludge Waves from other threats such as Basculegion-F and Gengar, respectively. Tera Fairy flips Cyclizar's weakness to Dragon-type moves into an immunity and gives a resistance to Fighting-type moves, helping against opposing Cyclizar, Salamence, and Slither Wing. Tera Steel makes Cyclizar resistant to Fairy- and Ice-type moves from the likes of Gardevoir and Empoleon, respectively. Tera Ghost makes it immune to Normal-type, allowing it to stop Rapid Spin attempts from opposing Cyclizar, while adding an immunity to Fighting-type attacks as well.</p> <p>Assault Vest Cyclizar can reliably slot onto balance or bulky offense teams as the main form of entry hazard removal while also providing item removal and pivoting. It can also be used on stall teams, though these structures often want another hazard removal option such as Defog Talonflame to reliably maintain hazard control. Cyclizar pairs well with other Regenerator Pokemon such as Amoonguss, Mienshao, and Slowbro, creating teams that are very difficult to break offensively and can provide pressure through status, hazard chip, and gradual damage. Strong offensive teammates like Crawdaunt, Conkeldurr, and Volcanion appreciate Cyclizar giving them free entry points. While Cyclizar can often keep hazards off the field, it is advised to still run hazard-resilient or Heavy-Duty Boots teammates, such as Amoonguss, Hisuian Goodra, and Mienshao, since Cyclizar may struggle against teams with Ghost-types like Palossand or Mimikyu. Assault Vest Cyclizar can struggle to retain HP against hazard-stacking archetypes, being unable to remove hazards against teams utilizing Tera Ghost on their hazard setters. To mitigate this dynamic, Cyclizar relies on pivoting into teammates who can apply offensive pressure to deny hazards from being established, like Basculegion-F, Gardevoir, and Volcanion.</p>"
      },
      "Heavy-Duty Boots": {}
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamingoPokeman"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 513635, "username": "Rarelyme"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Slither Wing": {"sets": {"Bulky Pivot": {}, "Choice Band": {}}},
  "Wo-Chien": {"sets": {"Leech Seed": {}, "RestTalk": {}}},
  "Okidogi": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Munkidori": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Fezandipiti": {"sets": {"Calm Mind": {}, "Pivot": {}}}
}