{
  "Ditto": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li>Ditto is a niche revenge killer that can also be used to attempt a reverse sweep, but it must be wary of threats that may counter it with a surprise Terastallization, such as Tera Fairy Miraidon, Tera Fire Koraidon, Tera Ice Iron Bundle, and Tera Water Gholdengo.</li> <li>Ditto doesn't add much value to teams on its own outside of helping overwhelm opposing checks. It is also strongly prediction reliant.</li> <li>Maximum bulk and minimum Speed allow Ditto to force opposing Ditto to trigger Imposter first and run out of PP quicker.</li> <li>Tera Fairy defeats Choice Scarf Miraidon, Koraidon, and Walking Wake that may try to attack it with a Dragon-type move.</li> <li>Ditto is rarely a reliable check for reasons explained earlier, so it appreciates support from backup checks, especially for potent threats that it fails to revenge kill such as Swords Dance Chien-Pao, Double Dance Miraidon, and Bulk Up Great Tusk. Thus, teammates like Toxapex, Skeledirge, Ting-Lu, Clodsire, and Iron Treads are good picks.</li> <li>Ditto's ability to revenge kill many strong threats makes teambuilding flexible, allowing offensive Pokemon like Miraidon, Iron Bundle, Chien-Pao, and Koraidon to fit more easily.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 374620, "username": "Lana"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Mewtwo": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<ul> <li>Mewtwo is a niche wallbreaker by courtesy of its access to Nasty Plot and usable Speed stat letting it outspeed Pokemon like Arceus and most Eternatus variants. Its ability to dismantle common defensive Pokemon, like most Arceus formes, and discourage Pokemon like Zacian-C from switching in, makes it a very hard Pokemon to deal with defensively.</li> <li>However, Mewtwo's Speed stat leaves it outsped by common Pokemon like Zacian-C, Koraidon, Miraidon, and Flutter Mane, all of which can heavily damage, if not outright OHKO, it.</li> <li>Grass Knot hits Mewtwo's biggest roadblock in Ting-Lu for massive damage.</li> <li>Flamethrower retains the hit on Zacian-C and Tera Steel Clodsire for big damage while also damaging other Tera Steel Pokemon like Giratina-O.</li> <li>Taunt allows Mewtwo to stop Defog attempts from the likes of Giratina-O and Corviknight while also denying recovery attempts from Skeledirge and Arceus formes. Moreover, Taunt also permits Mewtwo to antilead Ribombee and deny its Sticky Web, being one of the few Pokemon that can accomplish this without losing an important chunk of HP in the process.</li> <li>Earth Power can be used instead to greatly damage Zacian-C, Skeledirge, and tera Steel Pokemon like Clodsire.</li> <li>Tera Steel allows Mewtwo to resist both of Zacian-C's STAB moves while also resisting Extreme Killer Arceus's Extreme Speed, which is particularly important, as Extreme Killer Arceus is a very common offensive answer to Mewtwo.</li> <li>Heavy-Duty Boots allows Mewtwo to ignore entry hazards like Spikes and, most importantly, Toxic Spikes. Leftovers can be used instead as Mewtwo's only form of recovery. Lastly, Life Orb can be used to greatly increase Mewtwo's damage output, allowing it to have a favorable chance of OHKOing Ting-Lu after a Nasty Plot. A Modest nature can be used to ensure Mewtwo OHKOes Ting-Lu and Extreme Killer Arceus at +2 and works best on Sticky Web teams, as on them Mewtwo doesn't mind the loss in Speed and can break holes in teams more easily.</li> <li>It is advised to get Mewtwo on the field via smart double switches or U-turn from teammates like Koraidon, as per its underwhelming defensive typing, it doesn't get many opportunities to freely switch in. Once in the field, Mewtwo should dish out as much damage as possible or use Nasty Plot to break important Pokemon, like Calm Mind Arceus formes. Against faster foes without pivoting moves like Zacian-C, Mewtwo can freely Terastallize into a Steel-type to resist both of its STAB moves and hit back hard with an Earth Power or Flamethrower.</li> <li>Mewtwo struggles against faster foes, like Zacian-C, Koraidon, and Flutter Mane. Because of this, Pokemon like Landorus-T, Skeledirge, and Clodsire make for good partners. Landorus-T and Clodsire in particular help Mewtwo by spreading entry hazards, allowing it to net some KOs that it would normally miss, such as against Arceus-Steel, a Pokemon that now gets OHKOed by a +2 Flamethrower after a single layer of Spikes.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>Choice Specs Mewtwo is a strong and decently fast wallbreaker that crucially outspeeds Arceus. Its power and coverage give Mewtwo the ability to OHKO or 2HKO just about every Pokemon in the tier.</li> <li>However, Mewtwo can easily be revenge killed by Miraidon and Koraidon, both of which outspeed and threaten a KO on it after Stealth Rock.</li> <li>Psystrike capitalizes on the lack of Psychic-resistant foes, as even Zacian-C struggles to take more than two Psystrikes. It also helps against Calm Mind Arceus, especially Tera Poison variants.</li> <li>Ice Beam hits Pokemon like Giratina-O and Tera Flying users like Zacian-C. Mewtwo can use Tera Fire to resist Tera Flying Zacian-C's STAB moves and OHKO it with Ice Beam after minimal chip damage.</li> <li>Flamethrower hits Zacian-C and Tera Steel users. Koraidon's sun can ensure the OHKO on Zacian-C as well as 2HKO on max HP Arceus.</li> <li>Grass Knot is mainly used for hitting Mewtwo's worst enemy, Ting-Lu. It also hits Arceus-Ground, Kyogre, and Groudon much harder than Ice Beam, potentially scoring OHKOes if they run more offensive spreads.</li> <li>Tera Fire gives Mewtwo useful resistances against common revenge killing options like Koraidon's Flare Blitz and Zacian-C's STAB moves. If sun is active, Tera Fire Flamethrower can 2HKO bulky foes such as Clodsire and Koraidon.</li> <li>Choice Specs Mewtwo's most important partner is Koraidon, usually with Choice Scarf. Koraidon helps power up Mewtwo's Flamethrower and lures in Mewtwo's favorite targets such as bulky Arceus formes and other physical checks.</li> <li>Defensive partners like Clodsire, Ting-Lu, Skeledirge, Gliscor, and Landorus-T are appreciated to check threats like Miraidon, Koraidon, and Zacian-C.</li> <li>Miraidon and Calm Mind Arceus variants appreciate Mewtwo's effectiveness at breaking through specially bulky Pokemon like Ting-Lu, Clodsire, Iron Treads, and defensive Arceus formes.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 306317, "username": "katerina"}, {"user_id": 507268, "username": "ox04"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 306317, "username": "katerina"}, {"user_id": 507268, "username": "ox04"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Skarmory": {"outdated": true, "sets": {"Defensive": {}}},
  "Blissey": {
    "outdated": true,
    "sets": {
      "Pink Blob (Specially Defensive)": {
        "description": "<ul> <li>Blissey functions as an blanket check to special attackers on balance and stall teams, being especially useful against hard-to-check special threats such as Calm Mind Miraidon, Chi-Yu, Iron Bundle, and Walking Wake.</li> <li>Seismic Toss is Blissey's only way to reliably deal damage to most opposing Pokemon, while Shadow Ball is able to do decent damage to Flutter Mane.</li> <li>Thunder Wave is extremely useful to cripple common switch-ins such as Koraidon and can also find use against Flutter Mane and Terastallized Miraidon.</li> <li>Blissey is a reliable setter of Stealth Rock, which can free up moveslots on Great Tusk and Iron Treads, but you should note that opposing Great Tusk and Iron Treads as well as Corviknight have little difficulty clearing entry hazards on Blissey.</li> <li>The Tera Type is quite flexible. Tera Ground is very useful against Calm Mind + Parabolic Charge Miraidon sets, as it completely negates their recovery and allows Blissey to force out them out.</li> <li>Tera Fire gives Blissey the ability to better take on Chi-Yu, with Heavy-Duty Boots negating the Stealth Rock weakness.</li> <li>Tera Ghost provides a Fighting-type immunity and allows Blissey to switch out of Dugtrio and Gothitelle.</li> <li>Solid defensive walls such as Skeledirge, Great Tusk, Dondozo, Scream Tail, and Dachsbun are good teammates to take on physical attackers like Koraidon that commonly come in on Blissey.</li> <li>Blissey is not capable of handling all Miraidon sets on its own, so Ting-Lu, Clodsire, and Iron Treads are heavily recommended teammates. In turn, these Ground-types have less pressure on them to stay healthy and can focus more on setting entry hazards.</li> <li>Care should be taken against Miraidon and Iron Bundle, which often use pivoting moves or Taunt to gain momentum on Blissey. Proper prediction with Blissey's teammates may be required to handle this.</li> <li>As a result, Rocky Helmet is an option, as it does damage to U-turn, Flip Turn, and Electro Drift users, making Miraidon and Iron Bundle unable to pivot on Blissey for free. If running Rocky Helmet, make sure you have plenty of Pokemon that can deal with entry hazards, such as Corviknight, Great Tusk, Iron Treads, and Hatterene.</li> <li>Flutter Mane is difficult for Blissey to reliably check due to Taunt and Psyshock sets, so Corviknight and Garganacl can help pick up the slack. In return, both appreciate Blissey being a safe switch-in to Iron Bundle.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Ho-Oh": {
    "outdated": true,
    "overview": "<p>Ho-Oh’s incredible stats, typing, and Regenerator make it one of the very best Pokemon in Ubers, being a great fit on many teams and performing well in nearly every battle. It is able to help its team stave off many threatening Pokemon like Koraidon, Extreme Killer Arceus, Necrozma-DM, and Calyrex-I. Even Pokemon like Miraidon and bulky Arceus formes that can take Ho-Oh’s STAB moves dislike getting burned by Sacred Fire. Unfortunately, Ho-Oh bears weaknesses to extremely dangerous Pokemon like Miraidon and Kyogre, making it not as hard to threaten as it might seem. Ironically, Ho-Oh’s greatest weakness is its high usage, as many Pokemon will run coverage specifically for it because of how common it is. For example, Zacian-C often runs Wild Charge, while Dragon Dance Arceus-Ground will often run Stone Edge. This, in conjunction with the fact that it needs to stay at high HP to check Scale Shot Koraidon, means it can get overwhelmed over the course of a game. Many physical attackers also run Tera Fire to gain an immunity to Sacred Fire burns and potentially use Ho-Oh as an opportunity to set up. Despite all of these, Ho-Oh is a fantastic Pokemon that every team must have a plan against and should be considered for any bulky team.</p>",
    "comments": "<h4>Other Options</h4> <p>Flame Charge is an option on offensive Ho-Oh that prevents Zacian-C, Miraidon, and fast Arceus formes from revenge killing it, but this option is generally not preferred compared to the utility of Recover, Earthquake, and Substitute.</p> <h4>Checks and Counters</h4> <p><strong>Miraidon</strong>: Miraidon resists both of Ho-Oh's STAB moves and can use it as a chance to set up or throw out powerful STAB attacks. However, it has to watch out for Earthquake, and Heavy-Duty Boots variants are checked by Tera Grass and Tera Ground Ho-Oh.</p> <p><strong>Water-types</strong>: Arceus-Water can pivot into Ho-Oh throughout the entire game, threaten it out with Judgment, and heal any damage from it. However, Arceus-Water must be wary of Sacred Fire burns in conjunction with entry hazards, limiting how easily it can enter the field against Ho-Oh. Kyogre can pivot into Sacred Fire and force Ho-Oh out, but it must be wary of Brave Bird. Dondozo is a niche Pokemon found on stall structures that is able to pivot into and outlast Ho-Oh with Rest and its natural bulk. All of the aforementioned Pokemon must be cautious of maximum Speed Jolly offensive Ho-Oh, which can outspeed and threaten to both 2HKO Arceus-Water and Kyogre and 3HKO Dondozo with Tera Flying Brave Bird.</p> <p><strong>Knock Off Users</strong>: Ho-Oh must be wary of switching into Pokemon that have access to Knock Off, such as Necrozma-DM and Gliscor. However, if Stealth Rock is not on your side of the field or can be removed easily, then Ho-Oh can freely pivot into Knock Off users. Additionally, Ho-Oh can get past the issue of Stealth Rock by Terastallizing into another typing besides Flying.</p> <p><strong>Eternatus</strong>: Eternatus can switch into any of Ho-Oh's attacks and threaten it with Toxic or Meteor Beam. Furthermore, its access to Recover lets it pivot in throughout the game. However, Earthquake chips Eternatus heavily, and offensive Ho-Oh can power through it with Brave Bird.</p> <p><strong>Arceus-Ground</strong>: Arceus-Ground can pivot into Ho-Oh if it has physical bulk investment. Furthermore, its access to reliable recovery along with a strong Rock-type attack in Power Gem or Stone Edge means that Ho-Oh cannot freely enter in on it without scouting its coverage move. However, Sacred Fire burns and hazards can make it much more difficult for Arceus-Ground to pivot into Ho-Oh.</p> <p><strong>Rock-type Coverage Moves</strong>: Ho-Oh must watch out for Rock-type coverage moves specifically aimed for it. This includes Power Gem from Flutter Mane as well as Rock Slide and Rock Tomb from both Groudon and Landorus-T. Eternatus, Lunala, and Necrozma-DW can slot Meteor Beam in order to surprise Ho-Oh as well.</p> <p><strong>Tera Fire Pokemon</strong>: Pokemon that are pressured by Ho-Oh's Sacred Fire often opt for Tera Fire, such as Necrozma-DM, Calyrex-Ice, and Arceus. These Pokemon can use Ho-Oh as setup fodder after Terastallizing, and Arceus can use Taunt to prevent phazing.</p> <p><strong>Giratina</strong>: Giratina’s massive physical bulk lets it pivot into any of Ho-Oh's attacks and use Defog or Rest freely.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Whirlwind is the preferred option for setup threats that run Tera Fire to set up on Ho-Oh, most notably Koraidon, Necrozma-DM, and Calyrex-I. Earthquake can be used to hit Miraidon, which otherwise can switch into Ho-Oh and proceed to force it out. Earthquake with Tera Ground also punishes use of Tera Fire on boosting threats to set up on Ho-Oh, although phazing a boosting threat with Whirlwind is often easier and more consistent. Tera Fairy is useful to block Scale Shot from Koraidon, which otherwise 2HKOes it without a boost. Tera Ground gives Ho-Oh STAB on Earthquake and turns its weaknesses to Electric- and Rock-type attacks into resistances. This allows it to turn the tables on Arceus-Ground and Flutter Mane, which commonly run Rock-type coverage to beat Ho-Oh. In conjunction with its high Special Defense, Tera Ground allows Ho-Oh to act as a soft check to Miraidon. Tera Grass gives Ho-Oh resistances to Electric and Water, allowing it to act as a soft check to Miraidon and Kyogre in a pinch.</p> <p>Ho-Oh fits on many bulky teams as an important part of their defensive core, but it cannot act as a team’s sole defensive check to threats like Koraidon, Zacian-C, and Extreme Killer Arceus, as these Pokemon can either overwhelm Ho-Oh with strong attacks or commonly run coverage specifically for it. Thus, more concrete checks to these Pokemon like Arceus-Fairy and Necrozma-DM are appreciated. Ho-Oh also does not match up well into Miraidon and Kyogre, so checks to them like Arceus-Ground, Ting-Lu, and Eternatus are essential. In return, Ho-Oh’s biggest boon to its team is Sacred Fire, allowing it to reliably spread burns and sometimes forcing Terastallization out of Pokemon like Necrozma-DM. Both of these attributes can be taken advantage of by Pokemon like Koraidon, Miraidon, and Zacian-C, which enjoy their checks being burned or not being able to Terastallize to stop them.</p>"
      },
      "Offensive": {
        "description": "<p>Earthquake pressures Miraidon, one of Ho-Oh's most common switch-ins, and gives it a way to hit Tera Fire users like Necrozma-DM, Koraidon, and Calyrex-I. Substitute is an option to take advantage of Gliscor and gives Ho-Oh a chance to freely throw out its powerful STAB attacks. Tera Ground synergizes with Earthquake and makes Ho-Oh a reliable check to Miraidon by guaranteeing that Earthquake KOs it with an Adamant nature. Tera Flying powers up Brave Bird, letting it 2HKO opposing defensive Ho-Oh. 152 Speed EVs with a neutral nature allow Ho-Oh to outspeed maximum Speed neutral-natured Necrozma-DM. The alternate EV spread with maximum Speed investment and a Jolly nature allows Ho-Oh to get the jump on defensive Arceus formes, giving it the ability to 2HKO them with Tera Flying Brave Bird.</p> <p>Koraidon is an excellent partner for pivoting in Ho-Oh and setting sun, while Ho-Oh pressures opposing Ho-Oh and Arceus-Fairy as well as helping Koraidon break through Gliscor and Kyogre. Since this Ho-Oh variant has far less bulk than a defensive one, it appreciates secondary Koraidon checks such as Kyogre and Arceus-Fairy, both of which can paralyze Eternatus, opposing Arceus formes, and Ho-Oh with Thunder Wave. Kyogre is also a solid partner for helping Ho-Oh check Calyrex-I, which this set cannot do well. Although it does not enjoy eating sun-boosted Sacred Fires, Miraidon can pivot into Ho-Oh and force it out. As such, partners such as Ting-Lu, Gliscor, and Arceus-Ground pair well with Ho-Oh. In particular, Ting-Lu and Gliscor can set Spikes for Ho-Oh, letting it pressure Arceus-Water more easily. Arceus-Water and Kyogre are fantastic partners for taking advantage of Ho-Oh forcing Necrozma-DM, Arceus, and Calyrex-I to Terastallize into the Fire typing while helping Ho-Oh check Koraidon. Ho-Oh can also lure in Miraidon, Terastallize into the Ground typing, and defeat Miraidon for them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595062, "username": "Taka"}, {"user_id": 597293, "username": "OreoSpeedruns"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 595062, "username": "Taka"}, {"user_id": 50695, "username": "Manaphy"}, {"user_id": 306317, "username": "katerina"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Kyogre": {
    "outdated": true,
    "overview": "<p>Despite Miraidon taking the spotlight of Ubers's top special wallbreaker, Kyogre is still one of the most threatening Pokemon in the tier, as it often breaks better than Miraidon thanks to teams preparing for it less. Kyogre also sports a surprising amount of defensive utility, as its Drizzle is very useful against Koraidon, and it has enough bulk to take on even physical threats such as Arceus-Ground and Calyrex-I. Kyogre is somewhat limited by its average Speed stat, lack of recovery making it worn down by repeated hits, and by how common Koraidon and Miraidon are, but outside of these flaws, Kyogre should be considered for nearly any bulky offense or balance team.</p>",
    "comments": "<h4>Other Options</h4> <p>Substitute is an option to allow Kyogre to bypass Eternatus and Clodsire's Toxic, but this set requires Thunder Wave and high bulk investment to work and is generally outclassed by more offensive sets that can threaten Koraidon, Miraidon, Arceus-Water, and opposing Kyogre more effectively. Rest is inadvisable thanks to Miraidon's Electric Terrain preventing its use. Mystic Water and Water Spout may be run on a Thunder Wave set. This gives Kyogre a 64.5% chance to 2HKO Eternatus with Water Spout at full HP, but this set is too vulnerable to entry hazard damage to be realistic.</p> <h4>Checks and Counters</h4> <p><strong>Eternatus</strong>: Eternatus is the most common hard check to Kyogre, as it outspeeds Kyogre and can Toxic stall it in conjunction with Recover. However, Eternatus must be careful of paralysis and Tera Poison.</p> <p><strong>Koraidon and Miraidon</strong>: Koraidon's sun severely weakens Kyogre's Water-type attacks, effectively negating any of Kyogre's wallbreaking ability. Miraidon has good special bulk and can power through even boosted Kyogre. However, both Pokemon loathe coming in on Ice Beam.</p> <p><strong>Clodsire</strong>: Thanks to Water Absorb, Clodsire can use Toxic against Kyogre and stall out Ice Beam with Recover. However, since Clodsire is slower, it runs the risk of being frozen by repeated Ice Beams, and boosted Ice Beams will 2HKO Clodsire. Tera Steel Clodsire hard walls Kyogre and has next to nothing to fear from it.</p> <p><strong>Water-types</strong>: Kyogre can pivot into opposing Kyogre using Ice Beam and trade with it using Thunder. Arceus-Water, especially Calm Mind variants, is a decent check to Kyogre sets that lack Thunder.</p> <p><strong>Giratina-O</strong>: Giratina-O is bulky, resists Water, and can shave off over half of Kyogre's HP with Poltergeist while often being faster than it. However, it must watch out for Ice Beam.</p> <p><strong>Arceus-Grass</strong>: Albeit rare, Arceus-Grass can hard wall anything Kyogre can throw at it, match Kyogre's boosts with Calm Mind, and do massive damage back with Grass Knot.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>Origin Pulse's higher power allows for some notable KOs, like OHKOing Ho-Oh outright and having a high chance to OHKO Zacian-C and Necrozma-DM after a layer of Spikes damage. Surf may be chosen for its perfect accuracy. Ice Beam nails Koraidon and Miraidon on the switch in and is Kyogre's best tool to pressure Eternatus and Clodsire. Thunder lets Kyogre break through Arceus-Water and opposing Kyogre, and its 30% paralysis chance is quite useful. Alternatively, Thunder Wave can be used to more directly cripple Eternatus on the switch in. Tera Fairy is usually chosen for its use against Koraidon, allowing Kyogre to take Scale Shot or Low Kick and retaliate back. Tera Poison has use for blocking Toxic from Eternatus, and it can let Kyogre absorb Toxic Spikes for teams that lack a Poison-type or Defog. Since Kyogre does not need the power of a boosting item, Heavy-Duty Boots is the best option, as it lets Kyogre pressure the opposing team without having to worry about entry hazard damage. It's also critical for the hyper offense matchup, as it allows Kyogre to survive +1 Arceus-Ground's Earthquake and +1 Necrozma-DM's Photon Geyser even with entry hazards up. The given EVs allow Kyogre to outspeed paralyzed Zacian-C and Deoxys-A, while the HP and Defense allow Kyogre to survive four hits from Koraidon's Scale Shot at +2, with the rest dumped into Special Attack. A more bulky spread of 248 HP / 164 Def / 80 SpA / 16 Spe with a Bold nature allows Kyogre to take one +2 Low Kick from Koraidon as well as +1 Arceus-Ground's Tera Ground-boosted Earthquake.</p> <p>Kyogre excels on bulky offense and balance teams thanks to its excellent wallbreaking ability and good defensive utility. Arceus-Fairy is a fantastic teammate, as the two together make for perhaps the safest core against Scale Shot Koraidon in the tier. Additionally, Arceus-Fairy can come in on the Choice Scarf Koraidon that Kyogre attracts with ease while also providing Thunder Wave support that may allow Kyogre to get past Eternatus. Choice Scarf Koraidon and Miraidon are good partners for cleaning up weakened teams and can bring in Kyogre easily with U-turn to take advantage of Ting-Lu, Arceus-Ground, and Ho-Oh switch-ins. Ground-types like Ting-Lu, Arceus-Ground, and Clodsire are highly recommended for dealing with Miraidon, which can OHKO even boosted Kyogre. Ting-Lu, Clodsire, and Gliscor also come with the benefit of Spikes support, chipping away at common switch-ins like Koraidon and Arceus-Water. Necrozma-DM can handle Eternatus and Zacian-C, with Kyogre coming in on Ho-Oh and Ground-types for it in return.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Kyogre trades the defensive utility and wallbreaking prowess of other sets for the ability to revenge kill common threats such as Zacian-C, Arceus-Ground, and Deoxys-A. A full-power rain-boosted Water Spout is always capable of OHKOing the aforementioned Pokemon and deals significant damage to all neutral targets, having good odds to OHKO Necrozma-DM and, with the help of entry hazards, most Arceus formes. Additionally, Water Spout can 2HKO Miraidon, preventing it from switching in. Origin Pulse is Kyogre's best STAB move if Water Spout's power is weakened, as Surf is unable to reliably OHKO crucial targets such as Ho-Oh. Ice Beam hits Koraidon hard and is the only way for Kyogre to damage Clodsire. Thunder's perfect accuracy in rain and chance to paralyze foes makes it a safe move to use without the need for prediction, and it almost always 2HKOs Arceus-Water and opposing Kyogre, which resist Kyogre's other moves. A Timid nature with a Choice Scarf enables Kyogre to outspeed the entire unboosted metagame and is necessary to outspeed Zacian-C, Kyogre's most important target to revenge kill. Tera Water provides a considerable power increase to Kyogre's STAB moves, allowing it to overpower its checks and clean up weakened teams. For example, even the bulkiest Eternatus has a chance to be 2HKOed by Tera Water-boosted Water Spout.</p> <p>Because of its vulnerability to entry hazards and lack of defensive investment, Choice Scarf Kyogre requires dedicated support from its teammates to be effective. Kyogre should avoid taking damage at all costs, as Water Spout's Base Power is directly tied to Kyogre's health, so hazard control and pivot support are both invaluable to this set. Giratina-O and Corviknight can provide Defog support and handle Extreme Speed Arceus for Kyogre. Koraidon and Miraidon can bring Kyogre in safely with U-turn and appreciate Kyogre threatening their common switch-ins such as Ho-Oh, Ting-Lu, Gliscor, and Arceus-Ground. Koraidon and Kyogre together can also help overwhelm Arceus-Water, which can usually handle them individually. Choice Scarf Kyogre's ability to revenge kill Zacian-C gives teammates like Koraidon and Necrozma-DM the option to run setup sets that might otherwise struggle into teams with Zacian-C. Dragon Dance Necrozma-DM is an especially great partner, as it turns Choice Scarf Kyogre's two most difficult defensive answers, Clodsire and defensive Eternatus, into setup fodder. A reliable Koraidon answer like Arceus-Fairy is helpful for this set, since Koraidon can take Kyogre's STAB moves without fear and deal significant damage in return or set up with Swords Dance. Although Miraidon cannot safely switch into Kyogre, it can easily threaten to KO it with a super effective Electric-type move, so Ground-types like Arceus-Ground, Ting-Lu, Gliscor, and Clodsire are good partners. The latter three can set hazards, aiding Kyogre in softening foes that aren't relying on Heavy-Duty Boots.</p>"
      },
      "Choice Specs": {
        "description": "<p>In exchange for some of Kyogre's flexibility, Choice Specs makes Kyogre a devastating wallbreaker. Rain-boosted Water Spout annihilates anything outside of Koraidon, Eternatus, and Clodsire. Ice Beam always OHKOes Koraidon and 2HKOes Eternatus and Clodsire. Thunder blasts through Arceus-Water and opposing Kyogre, which resist the aforementioned moves. Origin Pulse provides an alternative strong STAB attack should Water Spout's power be weakened. The EVs allow Kyogre to always OHKO Koraidon, with the HP and Defense investment allowing Kyogre to live a four-hit +2 Scale Shot from it. 16 Speed EVs let Kyogre outspeed paralyzed Zacian-C and Deoxys-A. If bulk is not a concern, then spreads with more Speed investment can be run to more reliably outspeed other base 90 Speed Pokemon like opposing Kyogre and Giratina-O. Max Speed with a Timid nature can be run to outspeed support Arceus formes and is highly recommended for Sticky Web teams to outspeed Zacian-C. Tera Fairy and Tera Ground let Kyogre get the jump on Koraidon and Miraidon, respectively.</p> <p>Choice Specs Kyogre requires more support than other Kyogre sets, as its lack of Heavy-Duty Boots gives it less defensive utility and makes Water Spout liable to being weakened from entry hazard damage. Defog users like Giratina-O and Corviknight are highly recommended due to this, and combined with Kyogre, provide a strong defensive backbone against Arceus-Ground. Koraidon and Miraidon are great partners, as their U-turn on common switch-ins like Ho-Oh, Ting-Lu, and Gliscor lets Kyogre come in much easier and wreak havoc. Choice Specs Kyogre can often lure in and KO Choice Scarf Koraidon, so teammates like defensive Dragon Dance Necrozma-DM, Zacian-C, and Extreme Killer Arceus work well in combination. Arceus-Fairy provides critical security against Koraidon, especially as this Kyogre set cannot handle Koraidon as well as other Kyogre sets, and can help Kyogre break much easier with Thunder Wave support.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 547277, "username": "LillianOfficial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 597293, "username": "OreoSpeedruns"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Groudon": {
    "outdated": true,
    "overview": "<p>Groudon's titanic physical bulk, strong support movepool that includes Will-O-Wisp, Stealth Rock, and Spikes, and good defensive typing make it a solid physically defensive option against common threats like Zacian-C and Koraidon; it is also able to run Stealth Rock and Spikes on the same set, offering good role compression. It is no slouch offensively either, as even defensive sets can put out solid damage with its great base Attack and Precipice Blades, which wallbreaking sets take even further with Swords Dance. However, Groudon often struggles to find a niche on teams, as it is often left on the sidelines in favor of Arceus-Ground, which has recovery and better special bulk, Landorus-T and Gliscor, which have better abilities and typing and U-turn, and Ting-Lu, which can better check Miraidon. Offensive sets, while still immensely powerful, compete heavily with Koraidon and Arceus-Ground, which boast better Speed, Taunt, in Arceus-Ground's case, Recover, and in Koraidon's case, better power. Groudon can still find a niche with its excellent bulk, ability to run both Stealth Rock and Spikes on the same set, and damage output, but that niche is often dependent on the team already using a different Arceus forme and Koraidon being too busy to run Swords Dance.</p>",
    "comments": "<h4>Other Options</h4> <p>Defensive Groudon can consider a few other item choices, such as Rocky Helmet to punish U-turn, but it generally prefers the recovery from Leftovers. Offensive Groudon can consider more or even maximum Speed investment to get the jump on Kyogre, other Groudon, and Necrozma-DM, but it generally prefers the extra bulk to trade hits more reliably.</p> <h4>Checks and Counters</h4> <p><strong>Defensive Arceus Formes</strong>: Physically defensive Arceus-Water, -Fairy, and -Ground can more or less wall Groudon forever and cripple it with Will-O-Wisp.</p> <p><strong>Opposing Spikes Users</strong>: Groudon is reliant on Leftovers to have any form of recovery and relies on its bulk to check threats or set up, so opposing Spikes users like Gliscor dramatically reduce its effectiveness.</p> <p><strong>Calyrex-I</strong>: Calyrex-I can take any one hit and KO back with Glacial Lance; Groudon's best option is often Will-O-Wisp, but that can be ruined by an untimely Tera Fire. Calyrex-I still has to be wary of Groudon's Tera Water.</p> <p><strong>Special Attackers</strong>: Special attackers in general, and especially Kyogre, can take advantage of Groudon's weaker Special Defense and force it out. Most, however, do not appreciate switching into Precipice Blades.</p> <p><strong>Ho-Oh and Gliscor</strong>: Defensive Groudon sets are often utterly unable to touch Ho-Oh and Gliscor, so once the set is scouted, they can freely switch in to recover HP or set hazards. Offensive sets can effectively deal with them, though, so they cannot switch in freely.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Precipice Blades versus Earthquake is the eternal question between power and accuracy; Precipice Blades picks up the OHKO on Miraidon and Zacian-C, the latter of which Groudon is often tasked with checking, while Earthquake still does solid damage without missing. Stealth Rock is the most common choice in the third moveslot, as it lets Groudon set both Stealth Rock and Spikes for its team. Protect is a viable option if a teammate already provides Stealth Rock, as it helps make up for Groudon's lack of reliable recovery and scout common Choice item users like Miraidon and Koraidon. Will-O-Wisp cripples the physical threats Groudon is tasked with handling like Koraidon and Zacian-C while also annoying any non-burn-immune foe looking to switch in, while Roar has excellent synergy with Stealth Rock and Spikes and can remove a dangerous setup sweeper like Calm Mind Arceus-Ground in an emergency. 16 Speed EVs get the jump on uninvested Landorus-T, letting Groudon land a Will-O-Wisp or extra layer of hazards, as well as uninvested Kyogre. Tera Fairy's Dragon immunity can block Koraidon from getting a Speed boost with Scale Shot and potentially lets Groudon snipe Miraidon going for the KO, while Tera Water is an overall excellent defensive type that specifically checks Zacian-C's Behemoth Blade and Calyrex-I's Glacial Lance.</p> <p>Groudon's ability to set both Stealth Rock and Spikes in a single teamslot makes it well suited for offensive teammates like Koraidon, Miraidon, and Zacian-C, as they are often able to break through their checks with that extra chip damage. Groudon also pairs well with offensive Arceus formes, as it can provide some of the extra physical bulk they often do instead. Special attackers, chiefly Miraidon and Kyogre, can easily overwhelm Groudon, making specially defensive teammates in Ho-Oh and Arceus-Fairy excellent options; it is worth mentioning that Groudon teams often struggle into Miraidon, as Groudon is a Ground-type that does not answer Miraidon. Speaking of Ho-Oh, this Groudon set is literally unable to touch it, making a consistent answer like Arceus-Water necessary. Groudon can also struggle into a few specific physical attackers, chiefly Calyrex-I and Zacian-C long-term, so secondary answers to them like a revenge killer or Kyogre in Calyrex-I's case are strongly recommended.</p>"
      },
      "Swords Dance": {
        "description": "<p>Precipice Blades is chosen over Earthquake for its better power, namely OHKOing offensive variants of Arceus and having a good chance to OHKO 252 HP / 0 Def variants after a Swords Dance. Stone Edge is mandatory to hit Ho-Oh and other Ground-immune Pokemon like Gliscor and Giratina-O. Speaking of Gliscor, Substitute in conjunction with 44 Speed EVs lets Groudon turn Gliscor into setup fodder, blocking Toxic and taking next to no damage from U-turn. If Gliscor is not a concern, Heat Crash is a perfectly accurate option that also provides coverage for Tera Steel Giratina, Tera Grass Ho-Oh, Orthworm, and Corviknight. Tera Fairy lets Groudon check Koraidon and Miraidon in a pinch, Tera Ground lets +2 Precipice Blades secure the OHKO against even physically defensive Arceus, and Tera Fire can block an expected Will-O-Wisp and power up Heat Crash if used.</p> <p>Swords Dance Groudon is an excellent wallbreaker, so it pairs very well with Koraidon and Zacian-C, as they can go to town once Groudon weakens or removes their shared checks. Groudon loves to be brought in on foes it can set up on like Gliscor, Clodsire, and Necrozma-DM, so pivots like Koraidon are very much appreciated. Groudon is still quite slow and vulnerable to revenge killers, especially specially offensive ones like Miraidon and Kyogre, so specially defensive teammates like Arceus-Fairy are welcome. Spikes setters like Glimmora and Deoxys-S help Groudon secure OHKOes against defensive Arceus formes. Miraidon is an excellent teammate to pressure Kyogre and Arceus-Water and appreciates Power Herb-free Solar Beam and Groudon pressuring Arceus-Ground.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Rayquaza": {
    "outdated": true,
    "overview": "<p>Rayquaza poses quite a threat to offense and defense teams alike in Ubers. With sky-high offenses, a strong and spammable STAB move in Dragon Ascent, and two great setup move choices in Dragon Dance and Swords Dance, Rayquaza excels at dismantling bulky teams. A decent defensive profile, including a resistance to Water-type moves that lets it pivot into Kyogre's STAB moves and grants it an immunity to Ground-type moves and Sticky Web, and access to a strong Extreme Speed give Rayquaza valuable utility against offensive teams. However, its below-average Speed and weaknesses to some of the most threatening Pokemon in the tier, like Koraidon, Miraidon, and Extreme Killer Arceus, hold it back against offensive teams, while physically defensive Arceus formes hold it back against defensive teams. Additionally, it is hurt by Ho-Oh's presence, as it is weak to the Rock-type moves many Pokemon run to hit Ho-Oh, like Arceus-Ground's Stone Edge or Power Gem.</p>",
    "comments": "<h4>Other Options</h4> <p>Heavy-Duty Boots can be used to ignore Stealth Rock entirely. However, hyper offense teams, which Rayquaza finds itself on, can generally deal with Stealth Rock. Tera Fire can be used on the Dragon Dance set to gain an immunity to Will-O-Wisp. However, it is generally outclassed by Tera Steel.</p> <h4>Checks and Counters</h4> <p><strong>Faster Pokemon</strong>: Without a Dragon Dance, many Pokemon in Ubers outspeed Rayquaza and threaten it in return, including, but not limited to, Koraidon, Miraidon, Eternatus, and Chien-Pao. Choice Scarf Koraidon also outspeeds Rayquaza even after one Dragon Dance.</p> <p><strong>Ice-types</strong>: Calyrex-I is more than bulky enough to survive boosted Dragon Ascents from Rayquaza and threaten it back. Chien-Pao and Kyurem-B also outspeed and threaten unboosted Rayquaza but must be wary of Extreme Speed.</p> <p><strong>Priority</strong>: Rayquaza is quite susceptible to getting picked off by strong priority moves from the likes of Extreme Killer Arceus, Chien-Pao, and Kingambit.</p> <p><strong>Ice-type Coverage:</strong> Kyogre, Arceus-Water, and Calm Mind Arceus-Ground can run Ice Beam to OHKO Rayquaza, making setting up against them unsafe.</p> <p><strong>Rock-type Coverage</strong>: Calm Mind Arceus-Ground commonly runs Power Gem, while Necrozma-DM, Landorus-T, and Dragon Dance Arceus-Ground run Stone Edge, which can hinder Rayquaza's opportunities to set up.</p> <p><strong>Bulky Arceus Formes:</strong> Bulky Arceus formes like Fairy, Ground, and Water can survive +1 Dragon Ascent from full health and threaten Will-O-Wisp or Thunder Wave, severely hurting Rayquaza's ability to sweep. Arceus-Fairy in particular can threaten an OHKO with Judgment.</p> <p><strong>Corviknight:</strong> Although Corviknight is rare, it walls Rayquaza and can set up Iron Defense all over it.</p>",
    "sets": {
      "Dragon Dance": {
        "description": "<p>With Dragon Dance, Rayquaza can fix its Speed issue while boosting its already mighty Attack. In conjunction with Tera Flying, Dragon Ascent plows through sturdy physical walls like Ho-Oh, Arceus-Fairy, and Arceus-Water with minor chip damage. Earthquake hits Miraidon, Zacian-C, and Necrozma-DM, the few Flying-resistant Pokemon in the tier. Extreme Speed is valuable for threatening non-Tera Ghost Koraidon after a Scale Shot and picking off weakened foes like Chien-Pao and Miraidon. Jolly is usually the preferred nature to outspeed Zacian-C after a Dragon Dance and Choice Scarf Koraidon after two, but on Sticky Web teams that mitigate its Speed issue, Adamant is better for the extra power. Adamant Rayquaza also has the benefit of OHKOing Miraidon and Zacian-C with unboosted Earthquake from full health with Life Orb. Life Orb strengthens Dragon Ascent while allowing Rayquaza to 2HKO defensive Necrozma-DM with +1 Earthquake. Focus Sash allows Rayquaza to survive a hit from Pokemon that would normally destroy it like Miraidon and Calyrex-I, allowing Rayquaza to beat them one-on-one. Tera Flying strengthens Rayquaza's already spammable Dragon Ascent, allowing it to get KOs it normally wouldn't. Tera Normal powers up Rayquaza's Extreme Speed, making it a fearsome late-game cleaner. Tera Ground allows Earthquake to 2HKO Necrozma-DM and always OHKO Zacian-C and Miraidon at +1 without Life Orb. Tera Steel gives Rayquaza setup opportunities and avoids revenge killing attempts against Pokemon that would normally trouble it, like Zacian-C, Choice Scarf Koraidon, Extreme Killer Arceus, Arceus-Fairy, and Eternatus.</p> <p>Rayquaza fits on hyper offense teams that value its great initial power alongside strong priority. Ribombee's Sticky Web helps with Rayquaza's Speed issue, allowing it to run an Adamant nature. In return, Rayquaza's great power and immunity to Sticky Web allow it to threaten opposing Sticky Web teams. Glimmora can both set Spikes and deal with Stealth Rock with Mortal Spin, helping Rayquaza set up or get KOs without needing to Terastallize. Rayquaza shares many checks with Koraidon, making them natural partners that can wear down their checks for the other. Zacian-C can help Rayquaza against Koraidon and Miraidon, threatening to put Miraidon into range of Rayquaza's Extreme Speed and forcing Choice Scarf Koraidon to lock into Flare Blitz for Rayquaza to freely set up on.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance Rayquaza is a powerful offensive force that can function as both a wallbreaker and a potential late-game cleaner. Dragon Ascent is resisted by very few Pokemon in the tier, and with a Life Orb boost, it can 2HKO many common neutral targets such as Ho-Oh, Giratina-O, Eternatus, and most Arceus formes. Earthquake hits most Pokemon resistant to Flying for super effective damage, notably having a chance to OHKO Miraidon and Zacian-C and dealing significant damage to Necrozma-DM. Extreme Speed allows Rayquaza to pick off weakened foes and get the jump on anything faster than it. Tera Normal transforms Rayquaza into a potent win condition with Extreme Speed. After a Swords Dance, a Tera Normal-boosted Extreme Speed can crucially OHKO Koraidon and Miraidon. A Jolly nature is preferred to outspeed most Arceus formes and -1 Speed Zacian-C, which Adamant Rayquaza fails to do. Life Orb is the best item for Rayquaza to deal as much damage as possible, as without it, the aforementioned 2HKOs and OHKOs become more difficult to achieve.</p> <p>Rayquaza shines on hyper offense teams that can capitalize on its great offensive profile. Sticky Web support helps mitigate Rayquaza's mediocre Speed, allowing it to outspeed Zacian-C, Miraidon, and Koraidon if the latter two Pokemon are not running Choice Scarf. Physical attackers like Zacian-C, Koraidon, and Arceus-Ground make great teammates, as together they can overwhelm their shared checks—such as Ho-Oh, Landorus-T, and defensive Arceus formes—and clear the way for each other to sweep. Zacian-C is an especially fantastic teammate, since it can handle any super effective attacks thrown at Rayquaza, as well as Extreme Speed from Arceus, and together they wear down Necrozma-DM, which resists their STAB moves. Miraidon appreciates Rayquaza's ability to punish the passive Ground-types that commonly switch into it, such as Ting-Lu. Rayquaza is forced to take Life Orb recoil damage and defense drops from Dragon Ascent, making it very susceptible to priority users like Extreme Speed Arceus and Kingambit; as such, a reliable answer like Zacian-C or a Tera Ghost user, such as Koraidon, Miraidon, or Arceus, is needed as a teammate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 547277, "username": "LillianOfficial"}, {"user_id": 597293, "username": "OreoSpeedruns"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Deoxys-Attack": {
    "outdated": true,
    "overview": "<p>When one looks at Deoxys-A, the first thing that stands out is its astronomical attacking stats. Its incredible base 150 Speed is also extremely relevant, as it leaves already fast Pokemon like Zacian-C, Koraidon, and Miraidon in the dust. This, in conjunction with its deep movepool, makes Deoxys-A a fearsome wallbreaker and revenge killer capable of threatening everything in the game for at least neutral damage. However, another notable aspect of Deoxys-A’s stats is its pitiful bulk that leaves it OHKOed by every attack in the game, giving it very limited opportunities to safely switch in and actually use its power, as well as leaving it prone to revenge killing from Choice Scarf users like Koraidon and Miraidon and priority from Pokemon like Extreme Killer Arceus. It also has trouble OHKOing some targets like Ting-Lu and Necrozma-DM despite its tremendous power because of a lack of either investment or STAB on its coverage. It is also significantly less threatening after it uses Psycho Boost, letting Pokemon like Miraidon and Dragon Dance Necrozma-DM use it as setup fodder. Despite that, Deoxys-A is a high-reward Pokemon that is worth its high risk if played properly.</p>",
    "comments": "<h4>Other Options</h4> <p>Superpower is an option on lead Deoxys-A for wearing down Ting-Lu for teammates such as Arceus-Ground, Miraidon, and Necrozma-DM. Psychic can be used over Psycho Boost to not risk a miss against Glimmora and Koraidon, but the power of Psycho Boost is useful against Arceus formes. Thunder Wave can be used to cripple opposing defensive Arceus formes and Zacian-C. On mixed attacker sets, Nasty Plot is a high-risk option that takes advantage of Deoxys-A’s ability to force switches. This usually pairs well with Focus Blast to threaten an OHKO on Ting-Lu.</p> <h4>Checks and Counters</h4> <p><strong>Revenge Killers</strong>: While Deoxys-A is very fast, it is still outsped by some Pokemon such as Choice Scarf Koraidon and Miraidon. Flutter Mane also outspeeds Deoxys-A in sun. These Pokemon cannot switch into Deoxys-A, but they can reliably threaten to revenge kill it.</p> <p><strong>Priority</strong>: Deoxys-A's awful bulk leaves it prone to all forms of priority, such as Extreme Speed from Extreme Killer Arceus and Rayquaza, Shadow Sneak from Giratina-O, Sucker Punch from Chien-Pao and Kingambit, and Ice Shard from Chien-Pao. Tera Ghost can mitigate the weakness to Extreme Speed, but Deoxys-A cannot threaten Arceus if it is at full HP.</p> <p><strong>Psychic-resistant Pokemon</strong>: While Deoxys-A is indeed impossible to safely switch into, it is not so strong that it doesn't have any issues with power. Pokemon that resist Psycho Boost, like Necrozma-DM, Zacian-C, and Ting-Lu, can come into it after a KO and check it, as Deoxys-A cannot OHKO these Pokemon. Necrozma-DM in particular is troublesome for Deoxys-A, as it can use Deoxys-A as setup fodder after taking Psycho Boost.</p>",
    "sets": {
      "Mixed Attacker": {
        "description": "<p>This set aims to get as much leverage out of Deoxys-A's limited switch-in opportunities as possible. Psycho Boost severely damages almost everything that doesn't resist it, with even defensive Ho-Oh being 2HKOed. Shadow Ball and Low Kick are mainly used to hit Pokemon that resist Psycho Boost. Shadow Ball hits enemy Psychic-types like Necrozma-DM and Calyrex-I super effectively, while Low Kick hits Zacian-C, Ting-Lu, and Kingambit on the switch. Rock Slide targets Ho-Oh, having a chance to OHKO it from full HP. Tera Ghost not only avoids revenge killing attempts from Extreme Killer Arceus but also turns Shadow Ball into a powerful attack that can serve as a strong, spammable STAB move, even OHKOing offensive Dragon Dance Necrozma-DM after minimal chip damage and doing impressive damage to defensive Necrozma-DM.</p> <p>Since Deoxys-A is so frail, it requires support from pivots to get on the field safely. Therefore, Choice Scarf Koraidon and pivot Miraidon are excellent partners, as they provide reliable pivoting in the form of U-turn while being offensively threatening in their own right. They also love Deoxys-A threatening their checks. Choice Scarf Koraidon has trouble getting past physically defensive Arceus formes like Arceus-Fairy, Arceus-Ground, and Arceus-Water, which Deoxys-A can break with Koraidon's U-turn support. Miraidon and Deoxys-A have common checks in healthy Ting-Lu and Arceus-Ground, so Deoxys-A pairing with Miraidon means one can work to overwhelm these checks for the other to go berserk. Entry hazard support from Gliscor and Ting-Lu is also appreciated, as it cuts down on the prediction Deoxys-A needs to actually break bulky Pokemon like Necrozma-DM and Ting-Lu. Checks to Extreme Killer Arceus and Choice Scarf Koraidon and Miraidon are also recommended, such as Zacian-C, Ting-Lu, Arceus-Ground, and Arceus-Fairy.</p>"
      },
      "Lead": {
        "description": "<p>Thanks to its incredibly high Special Attack and Speed, Deoxys-A is an strong alternative to Deoxys-S and Glimmora as an entry hazard setter. Shadow Ball does considerable damage to opposing Deoxys-S and Necrozma-DM. Icy Wind limits Deoxys-S to one layer of hazards while giving teammates like Miraidon and Koraidon easier entry into opposing lead Miraidon, Arceus formes, and Zacian-C. Psycho Boost is Deoxys-A’s main damage option and prevents Glimmora from getting up multiple layers of entry hazards. Taunt is another option that prevents Ribombee from setting up Sticky Web, but this is not preferred, since Ribombee often runs Pounce anyways. Stealth Rock is an option as well to let Deoxys-A set up dual hazards, but Deoxys-A’s lack of longevity and bulk means it is often limited to a single layer. Tera Ghost is the primary Tera type for giving Deoxys-A an immunity to Extreme Speed, letting it 2HKO Necrozma-DM, and for blocking Rapid Spin from Iron Treads, Great Tusk, and Terapagos. Tera Steel is also an option for blocking Glimmora's Mortal Spin.</p> <p>Deoxys-A primarily fits on hyper offense for its ability to set up entry hazards and generate momentum for its teammates. Partners like Zacian-C, Miraidon, Necrozma-DM, and Koraidon appreciate Deoxys-A setting up hazards and chipping their checks, such as Necrozma-DM, Arceus-Ground, and Arceus-Fairy. However, since Deoxys-A doesn't run Taunt often, opposing Ting-Lu leads can be difficult to deal with. Partners like Zacian-C, Koraidon, Kyurem-B, and Calyrex-I help overwhelm Ting-Lu. Furthermore, opposing Extreme Speed users such as Deoxys-S, Arceus, and Rayquaza can limit Deoxys-A to a single hazard. Teammates such as defensive Calm Mind Arceus-Ground can help take these on and provide more defensive utility to the hyper offense teams that Deoxy-A fits in. Opposing Giratina-O can anti-lead Deoxys-A and threaten teammates such as Necrozma-DM, Tera Ghost Koraidon, and Calyrex-I, so partners like Chien-Pao, Miraidon and Kyurem-B that can threaten it out are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}, {"user_id": 595062, "username": "Taka"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Deoxys-Speed": {"outdated": true, "sets": {"Lead": {"description": "<p>16 Speed EVs allow Deoxys-S to outspeed Zacian-C, Miraidon, and Koraidon.</p> <p>These are sample sets before we work on <a href=\"https://www.smogon.com/forums/forums/ubers-analyses.759/\">new analyses</a>. These will update as the metagame continues to develop. Stay tuned!</p>"}}},
  "Gliscor": {
    "outdated": true,
    "overview": "<p>Gliscor has several qualities that make it extremely frustrating for balance and bulky offense teams to deal with. For one, the combination of Poison Heal and Toxic Orb gives it an immunity to status and great passive recovery. Gliscor's Ground / Flying typing offers a myriad of resistances, including an immunity to Spikes and a neutrality to Stealth Rock. When combined with Poison Heal, this essentially makes Gliscor almost entirely unaffected by opposing entry hazards. Additionally, Gliscor has access to a support movepool that most Pokemon could only dream of, featuring Spikes, Toxic, Toxic Spikes, and Knock Off. As such, Gliscor is a fantastic pivot in Ubers, notably taking Sacred Fire from Ho-Oh with ease and setting up hazards on staple threats like Choice Scarf Koraidon and Ting-Lu. This makes Gliscor one of the best Pokemon to take advantage of the lack of entry hazard removal options in Ubers. However, Gliscor is held back by its lackluster stats for Ubers standards; its Defense, while decent, is nowhere near good enough to take on titans like Scale Shot Koraidon, meaning Gliscor has limited use against hyper offense teams. Gliscor is also setup bait for one of the most common threats in the tier, Necrozma-DM, which is only 4HKOed by Earthquake. Gliscor's pathetic Special Defense by Ubers standards leaves it forced out by the vast majority of special attackers.</p>",
    "comments": "<h4>Other Options</h4> <p>Swords Dance can be run to make Gliscor a surprisingly effective wallbreaker when combined with Earthquake and Knock Off. However, this set relies on the surprise factor quite a bit, so it's not very consistent. Bulldoze and Sand Tomb are both viable attacking options, with Bulldoze notably annoying Dragon Dance users like Arceus-Ground, but Earthquake and Knock Off generally have more use. Taunt is possible to prevent set up from opposing Pokemon, although its utility is usually not enough to justify it over Gliscor's other options. U-turn may be run as a momentum option, but the loss of Protect greatly reduces Gliscor's bulk.</p> <h4>Checks and Counters</h4> <p><strong>Necrozma-DM</strong>: Necrozma-DM takes little from Earthquake, is immune to Toxic, and can easily use Dragon Dance or Swords Dance on Gliscor without much worry. However, Necrozma-DM must be wary of Knock Off, especially if Spikes are on the field.</p> <p><strong>Special Attacks</strong>: Gliscor quickly falls apart against the many strong special attackers in Ubers, such as Miraidon, Kyogre, Eternatus, and Calm Mind Arceus formes. These Calm Mind Arceus formes like Arceus-Water or Arceus-Ground use Tera Poison or Steel to become immune to Gliscor's Toxic. Dragon Dance Arceus-Ground may run Ice Beam to quickly dispatch Gliscor as well, although specially defensive Gliscor is only 2HKOed.</p> <p><strong>Taunt</strong>: Taunt from various Arceus formes, Miraidon, and Landorus-T can completely stop Gliscor from doing anything useful.</p> <p><strong>Poison-immune Flying-types</strong>: While rare, Corviknight utterly walls Gliscor and can prevent it from gaining momentum with Defog. Skarmory is immune to Toxic and Earthquake and can Spikes or Whirlwind with impunity on Gliscor.</p> <p><strong>Orthworm</strong>: Orthworm is immune to Earthquake and Toxic and can use Gliscor as a free Shed Tail opportunity.</p> <p><strong>Ice-types</strong>: Calyrex-I and Chien-Pao have little issue OHKOing any Gliscor that has not used Tera Water.</p> <p><strong>Giratina-O</strong>: While it despises Toxic, Giratina-O can Defog away Gliscor's entry hazards and heavily damage Gliscor with Hex. Giratina-O can also use Tera Steel to become immune to Toxic.</p> <p><strong>Gliscor</strong>: Gliscor is ironically a check to itself, as it is immune to Toxic and Earthquake and takes little from Knock Off. Thus, the Gliscor that has more PP will win.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>The combination of Earthquake and Toxic works very well together, as Earthquake deals super effective damage to Steel- and Poison-types, which are immune to Toxic. Alternatively, Knock Off may be run in either slot to remove Heavy-Duty Boots from opposing Pokemon like Ho-Oh and Kyogre, and thus make Gliscor's hazard stacking more effective. Do note that the lack of Earthquake makes Gliscor unable to check threats like Zacian-C, while the loss of Toxic makes Gliscor very passive against Pokemon with reliable recovery like the various Arceus formes that don't mind Knock Off. Spikes and Toxic Spikes are both powerful entry hazard options; Spikes is less matchup-dependent than Toxic Spikes is, but Toxic Spikes can be devastating against teams without a Poison-type. Protect is highly recommended, as it provides an easy way to activate Toxic Orb, can stall for Poison Heal recovery, and has good synergy with Toxic. Gliscor can run both defensive and specially defensive sets; Defense investment is more common thanks to Gliscor's decent Defense stat allowing it to check physical attackers like Zacian-C, but Special Defense investment lets Gliscor act as a pseudo-check to Heavy-Duty Boots Miraidon and set up hazards more easily against Arceus formes and Eternatus. Tera Water is chosen for defensive Gliscor, as it covers Gliscor's Water- and Ice-type weaknesses and provides a useful resistance to Necrozma-DM's Sunsteel Strike and Zacian-C's Behemoth Blade. Tera Fairy is used on specially defensive sets to take Miraidon's Draco Meteor if needed.</p> <p>While Gliscor is helpful against physical threats like Koraidon, Zacian-C, and Arceus-Ground, it should never be your main check to them, as Gliscor's bulk simply won't hold up over time. Therefore, teammates like Necrozma-DM, Arceus-Fairy, Arceus-Water, and Skeledirge are excellent for their ability to better take on physical attackers. Necrozma-DM is also greatly appreciated for its ability to Knock Off Heavy-Duty Boots. Gliscor works well with other hazard setters like Ting-Lu, Arceus-Fairy, and Clodsire, which can set Stealth Rock or Spikes that Gliscor may be missing out on. Arceus-Water, Ting-Lu, defensive Swords Dance Necrozma-DM, and Arceus-Dark are good partners for handling Dragon Dance Necrozma-DM that may attempt to set up on Gliscor. For specially defensive Gliscor, alternate switch-ins to Miraidon such as Arceus-Ground, Arceus-Fairy, Zacian-C, and Flutter Mane are nigh-mandatory, as Gliscor cannot take repeated Draco Meteors reliably.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Dialga": {"outdated": true, "sets": {"Choiced": {}}},
  "Dialga-Origin": {"outdated": true, "sets": {"Stealth Rock Setter": {}}},
  "Palkia": {"outdated": true, "sets": {"Substitute": {}}},
  "Palkia-Origin": {"outdated": true, "sets": {"Wallbreaker": {}}},
  "Giratina": {"outdated": true, "sets": {"Defog": {}}},
  "Giratina-Origin": {
    "outdated": true,
    "overview": "<p>Giratina-O is most notable for being the only offensive Defog user in Ubers, giving it a distinct niche. Its high bulk and unique typing combined with Levitate give it great use against top metagame threats like Arceus-Ground, Extreme Killer Arceus, and Kyogre. While its offensive stats are a bit low by Ubers standards, it makes up for it with Griseous Core's boost and access to high-Base Power moves like Poltergeist, Draco Meteor, and Hex. Furthermore, Will-O-Wisp, Thunder Wave, and Shadow Sneak are all great utility options at Giratina-O's disposal. Giratina-O is also one of the best users of Terastallization in the tier, becoming extremely tanky with Tera Steel or Poison in combination with Levitate. However, Giratina-O has no reliable recovery and thus can be chipped down by Stealth Rock and Ruination damage over time. It also stacks weaknesses with Koraidon and Miraidon, two of the most common Pokemon in the tier.</p>",
    "comments": "<h4>Other Options</h4> <p>Shadow Ball is possible over Hex to have a stronger attack in the short term; this may notably help against Dragon Dance Arceus-Ground. Calm Mind sets are a possibility, but Giratina-O's lack of recovery really limits its ability to sweep.</p> <h4>Checks and Counters</h4> <p><strong>Support Arceus Formes</strong>: Arceus formes like Arceus-Fairy and Arceus-Water can shrug off any attack Giratina-O throws at them, though neither appreciate status.</p> <p><strong>Ho-Oh</strong>: Ho-Oh can handle most attacks from Giratina-O, as it has high bulk and is immune to Will-O-Wisp. However, Stone Edge, Thunder Wave, and Tera Ghost-boosted Poltergeist all threaten Ho-Oh.</p> <p><strong>Chip Damage</strong>: Giratina-O has no recovery, so damage from poison, burn, or Stealth Rock can add up over time. Ting-Lu's Ruination can also greatly reduce Giratina-O's ability to check threats.</p>",
    "sets": {
      "Physical Utility": {
        "description": "<p>Although it necessitates teammates like Necrozma-DM to not run Knock Off, Poltergeist is a strong Ghost-type attack that is very spammable due to how few Pokemon that resist Ghost there are in the tier. Dragon Tail is a decently strong Dragon-type attack that has utility for forcing out Extreme Killer Arceus, which often runs Taunt, and Ting-Lu. Of the two status options, Will-O-Wisp should be run with Defog, as it pressures Ting-Lu much more; Ting-Lu can otherwise heal off damage with Leftovers, pressure Giratina-O with Ruination, and set entry hazards. Thunder Wave pressures common switch-ins like Ho-Oh and Arceus-Fairy much more, and as such is preferred when not running Defog. Access to Defog is extremely few and far between in Ubers, and therefore Giratina-O's access to it provides immense utility. It can be critical for maintaining an advantage in entry hazard management, especially once opposing entry hazard setters like Ting-Lu are taken out of the picture. Despite this utility, other options are still available for more offensively-minded teams. Shadow Sneak is a useful priority move that becomes very strong when combined with Tera Ghost; the combination of Tera Ghost Poltergeist and Shadow Sneak will even take out Koraidon. Alternatively, Stone Edge can be used to KO Ho-Oh, which otherwise takes non-Tera Ghost Poltergeist without worry. The given EVs allow Giratina-O to survive +2 Tera Ghost Arceus's Shadow Claw as well as +2 Life Orb Arceus's Shadow Claw after Stealth Rock damage. The Speed EVs are enough to outspeed uninvested Gliscor, with the rest dumped into Attack. Tera Steel should be run on Defog sets, as it negates all of Giratina-O's normal weaknesses, allowing Giratina-O to turn the tide against many Pokemon such as Koraidon using Scale Shot and Gliscor using Toxic. Tera Poison is another option, as it provides similar utility to Tera Steel without being weak to Koraidon's Flare Blitz.</p> <p>Giratina-O is an excellent way to finish off most defensive cores in the tier, as its Defog support and ability to check Arceus-Ground, Extreme Killer Arceus, and Kyogre are very valuable. As such, classic defensive Pokemon like Necrozma-DM, Arceus-Fairy, Ting-Lu, and Arceus-Water are all fantastic partners. Miraidon deserves mention, since it can pressure Ting-Lu, Clodsire, and Gliscor extremely well, potentially leading to a huge advantage in entry hazard management. Giratina-O's Defog support can also enable some powerful wallbreakers like Choice Band Chien-Pao and Choice Specs Kyogre, which may not normally fit on most teams due to being too weak to entry hazards.</p>"
      },
      "Special Utility": {
        "description": "<p>Thunder Wave is Giratina-O's best option for punishing Ho-Oh and Arceus-Fairy, while Will-O-Wisp is a stronger option against Arceus, Dragon Dance Arceus-Ground, and Ting-Lu. Giratina-O's access to Defog gives it a unique niche on bulky offense and balance teams that can sufficiently pressure Ting-Lu. The given EV spread lets Giratina-O survive Shadow Claw from both Life Orb Arceus and Heavy-Duty Boots Tera Ghost Arceus after a Swords Dance and Stealth Rock damage while outspeeding uninvested Gliscor. Tera Steel lets Giratina-O stonewall Gliscor and Dragon Dance Necrozma-DM, pivot into Arceus-Fairy more easily, and take on Scale Shot Koraidon and Miraidon. Tera Poison is an alternative that still punishes Gliscor and Arceus-Fairy without giving Giratina-O a weakness to Low Kick and Flare Blitz from Koraidon and Close Combat from Zacian-C.</p> <p>Giratina-O pairs well with teams that appreciate its ability to both check Arceus-Ground, Necrozma-DM, and Extreme Killer Arceus and keep entry hazards off the field against Spikes stacking teams. Arceus-Fairy and Gliscor are strong partners for their ability to punish Ting-Lu while pivoting around Koraidon and Miraidon, respectively. Necrozma-DM is a great partner to pressure Ho-Oh with Knock Off, Stone Edge, or boosted Photon Geyser. This is appreciated, since Ho-Oh can pivot into Giratina-O and entirely wall Will-O-Wisp variants while also checking Arceus-Fairy. Teammates that use Choice items such as Choice Scarf Koraidon, Choice Specs Miraidon, Choice Specs Kyogre, Choice Specs Flutter Mane, and Choice Band Chien-Pao appreciate Giratina-O removing hazards from the field, letting them not take hazard damage when they switch in and thus giving them more opportunities against bulkier teams that can annoy Giratina-O. Other teammates that appreciate Defog include Calm Mind Kyogre with Leftovers, Draco Plate Miraidon, and defensive Arceus formes. Miraidon is an especially notable partner for forcing progress on Ting-Lu while pivoting around Ho-Oh, letting Giratina-O win the hazard war in the long run. Ting-Lu and Gliscor pair well with Giratina-O by checking Miraidon and complementing Giratina-O's ability to spread status with additional hazard damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 595062, "username": "Taka"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 274590, "username": "SiTuM"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Darkrai": {"outdated": true, "sets": {"Choice Scarf": {}, "Nasty Plot": {}}},
  "Shaymin-Sky": {"outdated": true, "sets": {"Choice Scarf": {}, "SubSeed": {}}},
  "Arceus": {
    "outdated": true,
    "overview": "<p>Arceus is debatably Ubers's most terrifying and dangerous setup sweeper thanks to a powerful STAB-boosted Extreme Speed, decent defenses, and a wide array of utility and coverage moves, letting it mix and match to win problematic matchups easily. Arceus also has an excellent defensive profile, allowing it to take on Ghost-types like Lunala and Flutter Mane. Extreme Speed allows Arceus to operate as a revenge killer, making it difficult for opposing setup sweepers like Scale Shot Koraidon, Miraidon, and Rayquaza to sweep. However, Arceus is not without its flaws, as physically bulky walls like Ting-Lu, Arceus-Water, and especially Necrozma-DM all check it and give it difficulty when attempting to sweep. Furthermore, while more uncommon, Arceus often struggles to beat bulky Ghost-types like Tera Ghost Koraidon, Tera Ghost Miraidon, Giratina-O, Lunala, and Skeledirge, as they can tank unboosted Shadow Claw and cripple Arceus with status. Arceus's lack of resistances and weakness to status moves like Will-O-Wisp, Toxic, and Thunder Wave can make it potentially hard to switch onto the battlefield safely. Despite that, Arceus is still one of the best Pokemon in Ubers, and every team must prep for it if they do not want to get easily cleaned by it.</p>",
    "sets": {
      "Swords Dance Extreme Killer": {
        "description": "<p>Shadow Claw is Arceus's best option into Pokemon like Necrozma-DM, Giratina-O, and Skeledirge if it does not run Earthquake, making it valuable coverage. Arceus's final moveslot is extremely flexible; Taunt shuts down recovery and status from Pokemon like defensive Arceus formes and Giratina-O and also prevents it from being phazed by Pokemon like Ho-Oh. Recover allows Arceus to negate chip damage, potentially set up multiple times in a game, and also take on Calm Mind Arceus variants. Earthquake allows Arceus to hit Pokemon like Zacian-C and Necrozma-DM for better damage than Shadow Claw. On Silk Scarf and Life Orb sets, Double-Edge is an option to OHKO Gliscor after a Swords Dance and deal heavy damage to opposing bulky Arceus formes. Generally, Arceus most commonly runs Heavy-Duty Boots to negate entry hazard damage, allowing it to sweep more easily. Silk Scarf is an option instead, allowing Arceus to achieve thresholds like OHKOing Miraidon after a Swords Dance and Koraidon after a Swords Dance and layer of Spikes. Although niche, Lum Berry gives Arceus the one-time ability to avoid crippling status from Pokemon like Ho-Oh and Giratina-O, while Leftovers can be used to slightly negate chip damage. Tera Fire is the preferred Tera type, as it allows Arceus to set up against Ho-Oh, check Koraidon and Zacian-C, and become immune to Will-O-Wisp. An alternative is Tera Ghost, giving Arceus the ability to set up on Pokemon like Zacian-C, opposing Extreme Speed Arceus, and Choice Scarf Koraidon. Finally, Tera Normal can be used to boost Extreme Speed, allowing Arceus to achieve thresholds like OHKOing Koraidon and offensive Eternatus after a Swords Dance.</p> <p>Arceus fits on practically every playstyle, but it best fits on more offensive structures looking for a late-game cleaner that can also potentially operate as a mid-game wallbreaker and revenge killer. One of Arceus's bigger issues is Necrozma-DM, which sponges the majority of its attacks and checks it; Pokemon that can lure in Necrozma-DM and chip it down like Zacian-C and Calyrex-I thus make excellent partners. Other physical attackers like Koraidon and Rayquaza can be good partners to wear down shared checks like Arceus-Water and Arceus-Fairy. Arceus also baits out Terastallization, which is useful to prevent Pokemon like Scale Shot Koraidon from being walled by Tera Fairy. Pokemon like Flutter Mane, Kingambit, and Chien-Pao can all wear down bulky Ghost-types that Arceus struggles with like Giratina-O. Miraidon can take out Pokemon like Ho-Oh, Zacian-C, and Necrozma-DM, all of which Arceus can struggle against. Arceus also appreciates entry hazard support from teammates like Ting-Lu and Gliscor on balance teams and Glimmora and Deoxys-S on hyper offense teams, as they put Koraidon into OHKO range by +2 Extreme Speed.</p>"
      },
      "Bulk Up": {
        "description": "<p>Between its great natural bulk, ability to boost its Defense with Bulk Up, and singular weakness, Bulk Up Arceus has incredible survivability and is capable of beating many popular physical attackers and walls like Necrozma-DM, Ho-Oh, and Arceus-Fairy. Extreme Speed and Shadow Claw provide nearly perfect neutral coverage in Ubers. With Tera Fire and Taunt, Arceus sets up on nearly every passive and some offensive Pokemon in the tier, most notably turning Ho-Oh and Zacian-C into setup fodder. 56 EVs in Speed allow Arceus to outspeed unboosted Adamant Rayquaza and Kyurem-B while also outspeeding Zacian-C after Sticky Web. Leftovers is the preferred item for its passive recovery, allowing Arceus to comfortably run Taunt, but Heavy-Duty Boots can be used with Recover on teams that are susceptible to Toxic Spikes. Do note, however, that this significantly worsens the matchup into Ho-Oh.</p> <p>This Arceus set fits great on both bulky teams and Sticky Web hyper offense teams as a stallbreaker and sweeper that is difficult for even offensive teams to pick off. On bulky teams, Landorus-T is an excellent partner that can act as a short-term check to Pokemon like Koraidon and Zacian-C, accumulating chip damage on them to the point that Arceus can revenge kill them with Extreme Speed. With Sticky Web support on hyper offense, Bulk Up Arceus gains the ability to outspeed many Pokemon that might give it trouble setting up, most notably Koraidon and Zacian-C. More than many other Pokemon, Bulk Up Arceus hates Toxic Spikes. Thus, Eternatus is an excellent partner, being a remover of Toxic Spikes, Kyogre check, and a sweeper facilitated by Arceus breaking down Eternatus's checks. Checking Miraidon and Kyogre is especially important, as they are among the few Pokemon that can threaten Arceus even if boosted. The aforementioned Eternatus can check Kyogre and remove Toxic Spikes, and Ting-Lu can check Miraidon and set Spikes. Miraidon and Zacian-C can overwhelm defensive Arceus-Ground and Arceus-Water, which can survive even boosted Extreme Speeds and threaten Arceus.</p>"
      },
      "Stall": {
        "description": "<p>Defensive Arceus makes use of its fantastic bulk to wall many offensive tier staples such as Necrozma-DM, Arceus-Ground, Extreme Killer Arceus, Calyrex-I, and Kyurem-B. It can even survive a Close Combat from Zacian-C and cripple it with Will-O-Wisp, though it cannot switch directly into it. Its ability to run Heavy-Duty Boots lets it fit onto teams without dedicated hazard control, allowing it to constantly re-enter the field without being whittled down by hazards. Iron Defense turns Arceus into an excellent physical check, being able to beat many common physical attackers as well as Pokemon such as Koraidon and Zacian-C, which might have coverage against it. Dragon Tail provides phazing and allows Arceus to rack up hazard damage on switch-ins with entry hazards, as well as shutting down sweepers at the cost of HP if they choose to attack instead of using setup moves. While Arceus will not always Terastallize, it can use it to great effect against teams running Koraidon or Zacian-C. Tera Water helps wall Tera Fire Pokemon, as well as resisting attacks such as Necrozma-DM's Sunsteel Strike, Zacian-C's Behemoth Blade, and Calyrex-I's Glacial Lance. Tera Fairy is an excellent defensive typing that especially improves the matchup against Koraidon. A Bold Nature can be run over Impish if Arceus chooses to run Foul Play as its only damaging move.</p> <p>Despite the set name, Stall Arceus is not limited only to stall; it can be used on bulky balance teams as well. Regardless of team composition, Arceus requires hazard support from partners such as Gliscor, Clodsire and Necrozma-DM. It also appreciates the support of Knock Off absorbers such as Gliscor to help prevent Arceus from losing its Heavy-Duty Boots, which would leave it vulnerable to hazards. As Foul Play and Will-O-Wisp both target opposing physical attackers, Arceus tends to invite in special attackers such as Miraidon and Kyogre, so it likes to be paired with special walls such as Blissey, Clodsire, or Ting-Lu. Finally, Ho-Oh is another excellent partner, preventing physical attackers from wearing Arceus down with Regenerator and helping it preserve Recover PP. As Arceus cannot take every physical attack, it fits well on teams with other bulky Pokemon such as Ho-Oh, Skarmory, Skeledirge, and Dondozo. On more offensive teams, Arceus likes being paired with pivots like Miraidon, Koraidon, and Iron Bundle as well as powerful wallbreakers like Kyogre and Miraidon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}, {"user_id": 597293, "username": "OreoSpeedruns"}, {"user_id": 668571, "username": "Insolence"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 297659, "username": "deetah"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Arceus-Bug": {"outdated": true, "sets": {"Calm Mind": {}}},
  "Arceus-Dark": {"outdated": true, "sets": {"Calm Mind + Taunt": {}, "Defensive": {}}},
  "Arceus-Dragon": {"outdated": true, "sets": {"Dragon Dance": {}}},
  "Arceus-Electric": {"outdated": true, "sets": {"Calm Mind": {}}},
  "Arceus-Fairy": {
    "outdated": true,
    "overview": "<p>Arceus-Fairy is a defensive behemoth that cements itself a place in Ubers as one of the best checks to Koraidon. An immunity to Dragon and a resistance to Low Kick give Arceus-Fairy ample opportunities to switch in while also forcing Koraidon to use Flare Blitz more often and decrease its longevity as a result. Furthermore, Arceus-Fairy's bulk and resistances make it a useful soft check to Pokemon such as Arceus, Giratina-O, Kyurem-B, Zekrom, Chien-Pao, Rayquaza, and even Miraidon and Flutter Mane. Good neutral coverage with Fairy-type Judgment allows Arceus-Fairy to take full advantage of its ample support movepool featuring Thunder Wave, Will-O-Wisp, Stealth Rock, and Taunt. Outside of being a bit passive against Necrozma-DM, Ho-Oh, and Zacian-C and having to play around opposing Terastallization carefully, Arceus-Fairy has little to no flaws and should be strongly considered for any balance team.</p>",
    "comments": "<h4>Other Options</h4> <p>Earth Power and Power Gem are coverage options for a fully dedicated Calm Mind set. The problem is that Arceus-Fairy always loses to either Necrozma-DM or Ho-Oh, so while these coverage options are viable, they require dedicated team support. Of the two, Earth Power is more plausible, as Ho-Oh may be crippled by Knock Off support. Losing access to status or Stealth Rock also leaves Arceus-Fairy more passive in general.</p> <h4>Checks and Counters</h4> <p><strong>Fairy-Resistant Tanks</strong>: Necrozma-DM, Ho-Oh, and Zacian-C take little damage from Judgment and can use Arceus-Fairy as an opportunity to set up, although none of them like taking Thunder Wave.</p> <p><strong>Tera Fire Users</strong>: Arceus-Fairy cannot burn common physical attackers like Koraidon and Necrozma-DM after they have used Tera Fire, which also greatly weakens the power of Judgment. Koraidon can notably guarantee the OHKO on Arceus-Fairy at +2 with Tera Fire Flare Blitz, necessitating Arceus-Fairy to use Tera Water itself. These Pokemon are still vulnerable to Thunder Wave, but they may still be able to sweep with enough boosts.</p> <p><strong>Chip Damage</strong>: Arceus-Fairy is vulnerable to all forms of status and entry hazard damage, which force it to use Recover more often and lose momentum.</p> <p><strong>Calm Mind</strong>: Calm Mind users like Arceus-Ground, Kyogre, and Arceus-Grass take little from Judgment and can use Calm Mind relatively freely as a result.</p>",
    "sets": {
      "Defensive Wall": {
        "description": "<p>This set gives Arceus-Fairy its best chance at taking on Koraidon. Thunder Wave is extremely useful for crippling all of Arceus-Fairy's most common switch-ins in Necrozma-DM, Ho-Oh, and Zacian-C. It is also a safe move to use against Koraidon should you expect it to use Tera Fire and is especially useful because Arceus-Fairy discourages all Ground- and Electric-types bar Clodsire from switching in. Will-O-Wisp more directly cripples physical attackers like Koraidon and Necrozma-DM, although it cannot hit Ho-Oh and Tera Fire users. The third moveslot is fairly flexible; Stealth Rock is a good option, as it frees up moveslots for Arceus-Fairy's teammates. Taunt prevents Clodsire and specially defensive Gliscor from being able to use Spikes and Toxic. Dragon Tail can be a good way to rack up entry hazard damage and can phaze setup sweepers that may not mind being hit with status, and it is highly recommended when running Will-O-Wisp. Calm Mind turns Arceus-Fairy into a dangerous setup sweeper, albeit one that requires significant team support to handle Necrozma-DM and especially Ho-Oh. It is a good option on teams that already have plentiful ways to spread status. Tera Water is mandatory in case Arceus-Fairy needs to take a boosted Flare Blitz from Koraidon, and it can be useful in a pinch against Necrozma-DM and Zacian-C. Tera Water in combination with Calm Mind can more easily clean up weakened teams, as Necrozma-DM won't have a coverage option to hit Arceus-Fairy. The EVs allow Arceus-Fairy to outspeed maximum Speed neutral-natured base 90 Pokemon such as Kyogre, with the rest being dumped into physical bulk.</p> <p>While Arceus-Fairy is a great wall, it's unable to take on notable physical attackers like Necrozma-DM and Zacian-C without Terastallizing. As a result, defensive Necrozma-DM is a fantastic partner, and the two together reasonably cover nearly all physical threats in the tier. Ting-Lu and Clodsire can take on Miraidon and appreciate Arceus-Fairy's Dragon immunity that allows it to pivot into Draco Meteor, making them fantastic teammates. Defensive Ho-Oh, Gliscor, and Eternatus can handle offensive Ho-Oh without much fear of Sacred Fire burns, with Eternatus having the added benefit of checking Kyogre and absorbing Toxic Spikes. Strong but relatively slow wallbreakers such as Kyogre, Swords Dance Necrozma-DM, and offensive Ho-Oh like the paralysis support that Arceus-Fairy can provide. Kyogre notably helps with the Koraidon matchup, as it can pivot into Flare Blitz and bring rain that negates Koraidon's ability, making it a great partner. Giratina-O can handle Arceus-Ground and provide much-appreciated Defog support.</p>"
      },
      "Iron Defense + Calm Mind": {
        "description": "<p>Leveraging its great bulk and typing, Arceus-Fairy can utilize Iron Defense and Calm Mind to become an excellent late-game wincon and act as a defensive anchor on bulkier teams and defensive cores to take on the dangerous Koraidon. Iron Defense allows it to set up in front of threats such as Koraidon and physical Arceus formes lacking Taunt, while Calm Mind helps Arceus-Fairy to OHKO or 2HKO foes with Judgment and become nigh-unstoppable when paired with Defense boosts. Tera Poison stops Eternatus from crippling Arceus-Fairy with Toxic, removes its weakness to Zacian-C's Behemoth Blade, gives it a resistance to offensive Eternatus's Sludge Bomb, and lets it act as a Toxic Spikes absorber later on in the game if Arceus-Fairy's partner Eternatus has been knocked out. Tera Water allows Arceus-Fairy to resist Koraidon's Flare Blitz, Kyogre's Water Spout and Origin Pulse, Zacian-C's Behemoth Blade, and Necrozma-DM's Sunsteel Strike. However, it makes Arceus-Fairy weak to Zacian-C's Wild Charge and Kyogre's Thunder. The Speed EVs allow Arceus-Fairy to outpace maximum investment base 90 Speed Pokemon, such as Kyogre, Zekrom, and Groudon, while the rest are dumped into physical bulk.</p> <p>Iron Defense + Calm Mind Arceus-Fairy is incredibly potent in late-game scenarios where it is the last Pokemon standing, which prevents it from being phazed by Whirlwind or Dragon Tail if it has Terastallized. However, due to the limited PP of Recover, Arceus-Fairy should refrain from taking too much damage early on to preserve its ability for a late-game sweep. Eternatus can absorb Toxic Spikes for Arceus-Fairy in late-game scenarios, letting it set up more easily. Eternatus can also switch into Ho-Oh, which frequently forces Arceus-Fairy to switch out, and cripple it with Toxic. Kyogre can take on Koraidon for Arceus-Fairy much more comfortably by deactivating Orichalcum Pulse and weakening Flare Blitz with Drizzle. Landorus-T could provide entry hazard support with Stealth Rock, since this Arceus-Fairy set is not running it, while also serving as a temporary check to the dangerous Zacian-C. Defensive Ho-Oh can help check Steel-types such as Zacian-C and Necrozma-DM, which could pressure Arceus-Fairy, especially with hazards up. Ho-Oh can check opposing special Arceus formes and Eternatus, though Ho-Oh could also run offensive sets, and Arceus-Fairy and Kyogre could take on the task of checking Koraidon instead. As Arceus-Fairy is vulnerable to entry hazards, teammates that could help with hazard control, such as Giratina-O and Terapagos, should also be considered.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 651906, "username": "Pigbeeef"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 249382, "username": "Aberforth"}, {"user_id": 306317, "username": "katerina"}, {"user_id": 507268, "username": "ox04"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 452572, "username": "missangelic"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Arceus-Fighting": {"outdated": true, "sets": {"Cosmic Power": {}}},
  "Arceus-Fire": {"outdated": true, "sets": {"Dragon Dance": {}}},
  "Arceus-Flying": {"outdated": true, "sets": {"Calm Mind + Taunt": {}}},
  "Arceus-Ghost": {
    "outdated": true,
    "overview": "<p>Arceus-Ghost finds itself in a rather unique position in the tier, being the best Ghost-type in a tier run by Koraidon and also carrying an immunity to Extreme Killer Arceus's Extreme Speed. This, along with having a largely unresisted STAB type, means that Arceus-Ghost is able to find many safe opportunities to come in and wreck havoc against some of the major tier staples. It can be an offensive powerhouse on the right teams and a solid support Pokemon on others, but it does find itself held back by its lack of useful resistances. While few Pokemon can hit it super effectively, it can be still overshadowed by Arceus formes with better defensive typings.</p>",
    "comments": "<h4>Other Options</h4> <p>Tera Fighting can be used over Tera Stellar if a Timid spread is opted for and the team can still aptly handle Ho-Oh. Taunt and Will-O-Wisp can also have uses on support sets over Dragon Tail and Calm Mind, but they can struggle to make progress against special attackers and can give free entry points for them. A sacrificial lead set running Stealth Rock, Healing Wish, Taunt, and Judgment is possible, as Arceus-Ghost is able to spinblock, but it is usually outclassed by the same set on Arceus-Fairy.</p> <h4>Checks and Counters</h4> <p><strong>Ting-Lu</strong>: Not even +1 Tera Stellar Focus Blast can get close to an OHKO on Ting-Lu, which can then phaze Arceus-Ghost, and support sets find themselves quickly overwhelmed by Ruination, as well as Ting-Lu using Arceus-Ghost as a free opportunity to set up entry hazards.</p> <p><strong>Kingambit</strong>: Arceus-Ghost can struggle into Kingambit, as it cannot threaten Kingambit if it does not have Focus Blast, and even when it does, Kingambit can threaten to OHKO Arceus-Ghost with Sucker Punch with minimal chip or just a few fallen allies. Kingambit can also use Arceus-Ghost as a free setup opportunity and threaten to sweep through the entire team.</p> <p><strong>Faster Setup Pokemon</strong>: Setup threats such as Swords Dance Koraidon, Calm Mind Miraidon, and Swords Dance Zacian-C completely obliterate Arceus-Ghost and can even use it as a safe opportunity to set up, as it cannot threaten to KO them outright.</p> <p><strong>Arceus</strong>: Thanks to its immunity to Ghost-type Judgment, Arceus can safely switch into Arceus-Ghost and threaten it with Taunt or use it as setup fodder for Swords Dance.</p>",
    "sets": {
      "Calm Mind + 3 Attacks": {
        "description": "<p>This set aims to be a setup sweeper that can also prevent Iron Treads from being able to use Rapid Spin. Ghost-type Judgment is naturally resisted by very few Pokemon such as Arceus and Ting-Lu, neither of which appreciate taking a Focus Blast. Power Gem allows Arceus-Ghost to hit Ho-Oh, which can otherwise stomach a Judgment and phaze Arceus-Ghost. A Modest nature in conjunction with Tera Stellar allows for +1 Arceus-Ghost to OHKO opposing Arceus and Ho-Oh with Focus Blast and Power Gem, respectively, while also ensuring that Judgment can OHKO Zacian-C at +1.</p> <p>This set is usually found on Sticky Web teams, as it can spinblock for its teammates while also being able to outspeed most of the unboosted metagame and work well alongside Pokemon such as Swords Dance Koraidon and Zacian-C, which both appreciate Ho-Oh being pressured. It can also free up Tera types for its teammates, as they will not need to run Tera Ghost to deal with Arceus. The major drawback to Arceus-Ghost is the opportunity cost of not being able to run Extreme Killer or Arceus-Ground as the Arceus forme of choice on a team. These Pokemon have far more snowballing potential, as they can use Swords Dance and Dragon Dance while also being far less entry hazard- and Tera-reliant.</p>"
      },
      "Support": {
        "description": "<p>Support Arceus-Ghost attempts to capitalize on the lack of Ghost-weak Pokemon on most teams while also providing entry hazard-stacking offense with a valuable Rapid Spin immunity, leveraging its strong natural bulk to both act as a soft check to physical attackers and also find late-game setup opportunities. It acts as a soft check to threats such as Choice Scarf Koraidon and Calyrex-I, giving it a unique role as an Arceus forme that can keep Koraidon in check without being easily exploited by Zacian-C. Ghost-type Judgment is incredibly strong, with only one relevant Ghost-resistant Pokemon and one Ghost-immune Pokemon in the entire tier in Ting-Lu and Arceus, respectively, although note that both Pokemon as well as other special walls such as Whirlwind Ho-Oh do shut it down incredibly well. Thankfully, Dragon Tail allows Arceus-Ghost to punish most of these Pokemon by forcing them off the field, with the exception of Arceus-Fairy and Tera Fairy Ho-Oh. Recover is the preferred final move of choice, as this set is not an all-out attacker but rather leverages its bulk to be an unbreakable late-game sweeper. Tera Water provides Arceus-Ghost with a resistance to Koraidon's Flare Blitz while also allowing Arceus-Ghost to survive Glacial Lance from Calyrex-I and Steel-type attacks from Zacian-C and Necrozma-DM, allowing it to safely dispatch them if they've set up. Tera Fairy maintains Arceus-Ghost's ability to check Koraidon while also providing an immunity to Dragon-type attacks from it and Miraidon. Tera Poison allows Arceus-Ghost to become immune to being poisoned by Eternatus's Toxic and Toxic Spikes while still keeping a resistance to Koraidon's Fighting-type STAB moves. A Timid nature and 56 Speed EVs allow Arceus-Ghost to outspeed all unboosted base 95 and slower Pokemon while also covering for defensive Arceus formes and Ho-Oh so that it can safely use Dragon Tail against them first.</p> <p>This set is usually found on entry hazard-reliant balance builds that desperately want a spinblocker, but it can also be seen on standard hyper offense teams for similar reasons. It works well alongside bulky hazard setters such as Landorus-T, Gliscor, and Ting-Lu; Eternatus can also work here, as Toxic Spikes can be incredibly deadly for opposing teams if they are unable to remove them. Sadly, support Arceus-Ghost does run into a plethora of issues, most notably because it isn't Arceus-Fairy or -Water and therefore does not resist Koraidon's harder-to-check attacking moves in Scale Shot, Outrage and Flare Blitz as well as Draco Meteor from Miraidon and Origin Pulse from Kyogre. Ghost is not a premier typing for an Arceus forme to have, as having a defensive backbone where one of its core parts is unable to safely check either Koraidon or Miraidon can lead to Arceus-Ghost and its teammates being more easily pressured into Terastallizing to handle either of these threats, which can lead to teams having far weaker Terastallization flexibility.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 564960, "username": "Princess Autumn"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 249382, "username": "Aberforth"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Arceus-Grass": {"outdated": true, "sets": {"Calm Mind": {}, "3 Attacks": {}}},
  "Arceus-Ground": {
    "outdated": true,
    "overview": "<p>Besides Koraidon and Miraidon, Arceus-Ground is perhaps the most terrifying setup sweeper in Ubers. Strong Ground-type STAB moves in combination with Rock-type coverage makes switching into Arceus-Ground a challenge in a tier where Ground-type checks are few and far between, demolishing many tier staples such as Necrozma-DM, Zacian-C, and Ho-Oh. Arceus-Ground can also take hits with relative ease thanks to its good bulk and the lack of super effective coverage against it, allowing it to boost multiple times. Arceus-Ground is one of the few checks to Miraidon in the tier and the only one that packs significant offensive pressure. Arceus-Ground is held back by its four-moveslot syndrome and inability to check Miraidon very reliably by itself, as it lacks the raw bulk that Ting-Lu has and the ability to run Heavy-Duty Boots that Clodsire provides. Additionally, other Arceus formes like Arceus-Fairy and Arceus-Water may provide better defensive utility, while Arceus can give great revenge killing support with Extreme Speed. Overall, Arceus-Ground is a staple of offense and balance structures alike.</p>",
    "comments": "<h4>Other Options</h4> <p>A support set featuring moves like Thunder Wave, Will-O-Wisp, and Stealth Rock is possible, although it has some issues. Calm Mind provides a way to handle Double Dance Miraidon and makes Arceus-Ground a great cleaner, so it generally has more utility. In addition, Ground-type Judgment has several immunities in the tier, forcing you to choose between Arceus-Ground being hard walled or having more support moves available. A physically defensive set of 52 HP / 232 Def / 24 SpD with a Relaxed nature with Earthquake / Ice Beam / Stealth Rock / Recover is an option, although not often seen due to the plethora of defensive Ground-types in the tier.</p> <h4>Checks and Counters</h4> <p><strong>Ground-immune Pokemon</strong>: Giratina-O is one of the most complete checks to Arceus-Ground, as it can tank Stone Edge and Power Gem very well and threaten back with Will-O-Wisp, Dragon Tail, and Poltergeist. Landorus-T is a severe annoyance to the Dragon Dance set thanks to Intimidate, though it must watch out for Ice Beam. Gliscor can rack up damage on predicted Taunts by using Earthquake and can cripple Calm Mind Arceus-Ground with Toxic.</p> <p><strong>Water-types</strong>: Bulky Kyogre sets tank any hit outside of a Tera Ground-boosted Earthquake and OHKO back, and it can go head-to-head with Calm Mind sets. Arceus-Water can similarly take any hit and severely damage Arceus-Ground with a super effective Judgment. Both must be careful of Calm Mind Arceus-Ground should it choose to Terastallize.</p> <p><strong>Arceus-Grass</strong>: While rare, Arceus-Grass is the best check to Arceus-Ground in the game, easily taking any hit and doing extreme damage back with Grass Knot.</p> <p><strong>Phazing</strong>: While they usually prefer to save their health for other threats like Miraidon and offensive Ho-Oh, both Ting-Lu and Ho-Oh can phaze Arceus-Ground in a pinch, as Ting-Lu can tank any hit thrown at it and Ho-Oh survives Power Gem at +1.</p> <p><strong>Chip Damage</strong>: Arceus-Ground is vulnerable to all forms of entry hazards and status effects, jeopardizing its ability to attain multiple boosts as well as check Miraidon.</p>",
    "sets": {
      "Dragon Dance": {
        "description": "<p>Dragon Dance turns Arceus-Ground into a devastating wallbreaker that can also clean up weakened teams with ease. Stone Edge hits Ho-Oh and does good damage to most Ground-immune targets like Landorus-T and Gliscor. Taunt prevents status from Pokemon like Skeledirge, Giratina-O, and Gliscor and is useful to prevent Whirlwind from Ting-Lu. Recover is highly recommended on non-hyper offense teams to provide Arceus-Ground with more longevity, which is critical for checking Miraidon in the long term. Ice Beam can more directly deal with Gliscor and Landorus-T, which often pivot in on Arceus-Ground. Tera Ground is usually preferred, as the power boost can be critical for Arceus-Ground to get past Pokemon like Koraidon and bulky Kyogre that otherwise survive a +1 Earthquake. Tera Ghost has some utility providing Fighting and Normal immunities, which prevents common revenge kill options like Choice Scarf Koraidon's Low Kick and Extreme Killer Arceus's Extreme Speed. The EVs outspeed all base 90 Speed Pokemon, with the rest dumped into HP.</p> <p>This set is a mainstay on hyper offense teams thanks to its strong wallbreaking power and ability to reasonably deal with Miraidon. It appreciates fellow setup sweepers such as Scale Shot Koraidon, Double Dance Miraidon, Zacian-C, and Dragon Dance Necrozma-DM that can help it break through defensive cores. Hyper offense leads such as Deoxys-S and Glimmora pair well with Arceus-Ground, helping it net KOs easier without the need to Terastallize; two layers of Spikes give it a good chance to OHKO Koraidon, and Stealth Rock helps damage Landorus-T and Gliscor, which may try to pivot around Arceus-Ground. Additionally, Grimmsnarl's dual screens support has notably potent synergy with Arceus-Ground, as its great bulk becomes even better, allowing it to get multiple Dragon Dance boosts with ease. If Arceus-Ground is on a more balanced team, another Miraidon check like Ting-Lu or specially defensive Gliscor is appreciated, as this Arceus-Ground set is not reliable at handling Miraidon multiple times by itself.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Arceus-Ground is an extremely potent win condition that doubles in use as a good Miraidon check. It has more bulk than Clodsire while also having the reliable recovery that Ting-Lu lacks, giving it a distinct niche. Calm Mind and an Electric immunity makes this set one of the few Pokemon in the game that can defeat Double Dance Miraidon one-on-one. Furthermore, thanks to its powerful Ground-type Judgment, specially defensive walls such as Eternatus and Clodsire are unable to freely use Toxic, and Power Gem heavily discourages Ho-Oh from forcing it out with Whirlwind. This makes Arceus-Ground the least reliant on using Tera to sweep successfully out of all the Arceus formes. Ice Beam is a fine option over Power Gem to more effectively deal with Gliscor and attempt to freeze foes. Tera Fairy is mainly chosen for helping against Miraidon which may otherwise break through Arceus-Ground, although its added resistance to Koraidon's Low Kick is appreciated. Tera Steel also helps against Miraidon, with the distinction of providing a Poison immunity that may be useful against specially defensive Gliscor and Eternatus. The set's EVs maximize special bulk, which is critical for handling Miraidon, and outspeed all neutral-natured base 90 Speed Pokemon. More offensive EV spreads are possible, although they require further teammate support for Miraidon. 132 HP / 252 SpA / 124 Spe with a Modest nature gives Arceus-Ground maximum offensive output, notably giving it a chance to OHKO Ho-Oh at +1, while outspeeding all positive-natured base 90 Speed Pokemon. 248 HP / 144 Def / 100 SpA / 16 Spe allow Arceus-Ground to 2HKO Clodsire unboosted and take two Flare Blitzes from Koraidon, giving it some physically defensive utility and making it harder to revenge kill.</p> <p>Arceus-Ground is extremely hard to stop late-game once its checks have been chipped down. Opposing Calm Mind Arceus formes often lose in a one-on-one battle thanks to this set's higher special investment, leaving only checks like Ting-Lu, Kyogre, and Ho-Oh that can phaze or overpower Arceus-Ground. Gliscor is an excellent teammate, as it patches up the lack of entry hazard support that forgoing Ting-Lu or Clodsire causes. In addition, Gliscor is a great switch-in to Ting-Lu, Ho-Oh, and Choice Scarf Koraidon, allowing it to use Toxic and set hazards early-game to great effect. Skeledirge is a fairly solid check to Scale Shot Koraidon that loves Arceus-Ground taking on Miraidon, which commonly switches in on it. Knock Off Necrozma-DM is a great lure for Kyogre and Ho-Oh, as getting rid of their Heavy-Duty Boots makes them much more susceptible to entry hazard damage. Eternatus can switch in on Kyogre, Ho-Oh, and Arceus-Grass and force them out with Toxic while also absorbing the Toxic Spikes that Arceus-Ground is vulnerable to. Miraidon is a good offensive partner for damaging Ting-Lu over time and switching in easily on Ho-Oh.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Arceus-Ice": {"outdated": true, "sets": {"Calm Mind": {}}},
  "Arceus-Poison": {"outdated": true, "sets": {"Support": {}, "Iron Defense": {}}},
  "Arceus-Psychic": {"outdated": true, "sets": {"Stored Power": {}}},
  "Arceus-Rock": {"outdated": true, "sets": {"Calm Mind": {}}},
  "Arceus-Steel": {"outdated": true, "sets": {"Calm Mind": {}}},
  "Arceus-Water": {
    "outdated": true,
    "overview": "<p>Arceus-Water is a solid defensive pick in Ubers, being one of the best answers to hard-to-check threats like Dragon Dance Necrozma-DM, Arceus-Ground, offensive Ho-Oh, Calyrex-I, Chien-Pao, Rayquaza, and Kyogre lacking Thunder. While it cannot compare to Arceus-Fairy in terms of taking on Koraidon, its resistance to Flare Blitz makes Arceus-Water a decent check in combination with other Koraidon switch-ins like Landorus-T. Arceus-Water can spread burns and paralysis with relative freedom, as it discourages Ground-types from switching in and the use of Tera Fire, not to mention that Calm Mind makes it a decent setup sweeper in combination with massive Defense investment. The most notable flaw of Arceus-Water is that it invites arguably the most threatening Pokemon in the tier, Miraidon, to come in with little risk; it is also quite passive and vulnerable to being worn down over time.</p>",
    "comments": "<h4>Other Options</h4> <p>Dragon Dance sets are possible, but are too limited by Koraidon's sun and are generally outclassed by Extreme Killer Arceus and Arceus-Ground.</p> <h4>Checks and Counters</h4> <p><strong>Miraidon</strong>: Miraidon can come in quite easily, as it can stomach an Ice Beam without much worry and blow past even a boosted Arceus-Water.</p> <p><strong>Poison</strong>: Eternatus and Clodsire can take even a boosted Ice Beam and immediately threaten Arceus-Water with Toxic, though they must be wary of Tera Poison. Specially defensive Gliscor is not OHKOed by Ice Beam or Judgment and thus can retaliate with Toxic. All of the aforementioned Pokemon can also set Toxic Spikes, which is devastating for Arceus-Water's longevity.</p> <p><strong>Kyogre</strong>: Kyogre can switch in without too much worry and use Thunder or Thunder Wave, both of which can cripple Arceus-Water. However, Kyogre will lose to Calm Mind sets if it lacks Thunder.</p> <p><strong>Arceus-Grass</strong>: Though rare, Arceus-Grass can boost alongside Arceus-Water and deal devastating damage at any time with Grass Knot.</p> <p><strong>Sun</strong>: Though Koraidon itself prefers to not be on the field when Arceus-Water is, the sun that it brings cripples the damage output that Arceus-Water would normally provide.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>While Judgment has decent neutral coverage by itself, it's weakened by how common sun is, so a secondary attack is necessary. Ice Beam is usually chosen as the best option to hit switch-ins like Miraidon and Clodsire. Dragon Tail can rack up entry hazard damage and has good synergy with Arceus-Water's status options. Since Arceus-Water can often check most threats without status, Calm Mind is a great option to turn it into a solid win condition. Alternatively, Thunder Wave can cripple Ho-Oh and Tera Fire users like Koraidon, Necrozma-DM, and Calyrex-I, making it a safe option. Will-O-Wisp may be used to more solidly check physical threats. Do note that Tera Fire can put a stop to this, especially from Koraidon, which doesn't mind taking Judgment in the sun; therefore, Dragon Tail is highly recommended for Will-O-Wisp sets to mitigate this risk. Tera Fairy allows Arceus-Water to take boosted Scale Shot from Koraidon, while Tera Poison is possible on Calm Mind sets to prevent Arceus-Water from being crippled by Toxic from Eternatus, Clodsire, and specially defensive Gliscor. The EVs maximize Defense investment while outspeeding all neutral-natured base 90 Speed Pokemon.</p> <p>Arceus-Water works best when it has other walls to back it up against powerful wallbreakers like Koraidon. Landorus-T has fantastic synergy with Arceus-Water, checking Pokemon like Zacian-C and Zekrom, and its Intimidate and Rocky Helmet support makes Koraidon much easier to handle. Necrozma-DM can check Zacian-C and Kyurem-B and appreciates Arceus-Water handling Calyrex-I. Ting-Lu is the most solid switch-in to Miraidon that often come in on Arceus-Water, making it a highly recommended teammate. Meanwhile, Clodsire can absorb Toxic Spikes and check Miraidon and Kyogre. Miraidon can help against Kyogre sets that have Thunder while also bringing in Arceus-Water easily with U-turn. Skeledirge likes Arceus-Water dealing with Ho-Oh and can handle Koraidon and Zacian-C for it in return. Flutter Mane is a good offensive partner that forces difficult decisions on opposing Koraidon as to what move to choose; using anything but Flare Blitz allows Flutter Mane in for free, while Flare Blitz allows Arceus-Water to switch in easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Gothitelle": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<ul> <li>Shadow Tag Gothitelle can trap most defensive Pokemon, paving the way for its teammates to sweep.</li> <li>Trick facilitates trapping defensive walls like Ting-Lu and Great Tusk by locking them into an unfavorable move. Psychic targets Great Tusk and Toxapex, while Psyshock helps Gothitelle trap Clodsire better. Thunderbolt allows Gothitelle to trap Corviknight if it's not running U-turn or has a Choice item. Grass Knot KOes Great Tusk, Dondozo and hits Ting-Lu hard. Taunt is used to limit phazing attempts and Choice locked status moves, forcing the trapped Pokemon to use Struggle.</li> <li>Rest allows Gothitelle to more effectively PP stall foes and remain healthy.</li> <li>Choice Specs Gothitelle plays a more offensive role, aiming to rack up KOs. On the other hand, Choice Scarf variants are more likely to use Trick to beat opposing walls.</li> <li>32 HP and 4 Defense EVs allow Gothitelle to avoid being 2HKOed and 3HKOed from Ting-Lu's and Clodsire's Earthquake, respectively. 220 Speed EVs allow Choice Specs variants to outspeed defensive Great Tusk and Annihilape and Choice Scarf variants to outspeed offensive Great Tusk.</li> <li>Gothitelle usually uses its Tera type to trap and beat Choice locked foes it otherwise would not trap; Tera Fairy beats Miraidon and Koraidon Choice locked into Dragon moves, Tera Water tanks Koraidon's Flare Blitz and Iron Bundle's Ice Beam, and Tera Flying avoids Earthquake from Ting-Lu and Great Tusk.</li> <li>Gothitelle's favorite partners are powerful sweepers and cleaners such as Miraidon, Koraidon, Flutter Mane, Iron Bundle, Kingambit, and Chien-Pao, all of which appreciate Gothitelle removing one or more of their checks.</li> </ul>"
      },
      "Delay Goth (Trapper)": {
        "description": "<ul> <li>This Gothitelle set aims to trap and PP stall weak walls so that its offensive teammates can take over mid- to late-game. This Gothitelle set can come in on weak walls like Clodsire, Ting-Lu, Alomomola, and defensive Great Tusk and beat them by PP stalling them.</li> <li>Charm and Calm Mind are use to boost Gothitelle's survivability while PP stalling its foe.</li> <li>Taunt is used to stop phazing attempts and make the trapped Pokemon use their attacking PP, thus depleting their PP faster. Stored Power is an alternative for teams that benefit from having more wallbreaking potential or that have a good matchup against the Dark-types of the tier like Chien-Pao and Kingambit.</li> <li>The 24 Speed EVs allow Gothitelle to be faster than uninvested Corviknight, trapping it if it's not running U-turn. The Defense investment is used to tank hits well for PP stalling purposes, with attacks such as Ting-Lu's Earthquake being only a 4HKO.</li> <li>Tera Fairy is used for its solid defensive typing and ability to trap Choice-locked Dragon-types like Miraidon and Koraidon, Tera Water is an option for its overall great defensive typing, granting resistances to Chien-Pao's Icicle Crash, Koraidon's Flare Blitz, and Iron Bundle's Hydro Pump or Ice Beam. Lastly, Tera Ground is used to allow Gothitelle to trap Miraidon locked into an Electric move or defeat Double Dance sets one-on-one.</li> <li>Gothitelle's favorite partners are powerful sweepers and cleaners, especially setup sweepers that take advantage of defensive Pokemon having their PP drained to set up easily and without risk. Common examples include Swords Dance Koraidon, Swords Dance Chien-Pao, Double Dance Miraidon, and Calm Mind Flutter Mane.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537354, "username": "Mashing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 467437, "username": "Dawn of Ares"}, {"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Alomomola": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<ul> <li>Alomomola is a bulky pivot against physical attackers such as Koraidon and Chien-Pao on balance or defensive teams.</li> <li>The decision between Play Rough and Chilling Water depends on your preference. Play Rough is important since it provides actual damage against Chien-Pao and Koraidon; on the other side, Chilling Water is an effective stop to Bulk Up Great Tusk and bulky Palafin, which otherwise are annoying Pokemon to deal with for defensive teams.</li> <li>Whirlpool is a better support option than Light Screen on more defensive teams, since its continuous damage and trapping allow Alomomola to break past some Pokemon, such as Ting-Lu. On the other hand, Light Screen is better for offensive teams, since it helps them switch against powerful special attackers such as Miraidon and Flutter Mane without sacrificing a Pokemon.</li> <li>Besides healing Alomomola with Protect, Wish helps its teammates not get worn down, especially walls without reliable recovery like Dondozo, Ting-Lu, and Great Tusk.</li> <li>The item choice depends on your team structure. If you have good entry hazard removal and need more damage against threats, then Rocky Helmet is the best choice. Leftovers is useful when you have good hazard removal but can also inflict good damage with your teammates; it also prevents some 2HKOs, for example from Choice Band Chien-Pao's Crunch. Without good hazard removal, Heavy-Duty Boots is the preferred choice.</li> <li>Run a Relaxed nature with Play Rough, or if you have Chilling Water + Whirlpool and wish to sacrifice some Speed for full Whirlpool damage. Otherwise, run Bold.</li> <li>Tera Fairy provides Alomomola with Fighting and Dark resistances, letting it switch in more comfortably and stop setup from Koraidon and Chien-Pao. Additionally, the Dragon immunity lets it sponge hits such as Koraidon's Dragon Claw and Outrage, or Draco Meteor from Miraidon.</li> <li>Special walls work well alongside Alomomola's physical defense, such as Ting-Lu, Clodsire, Blissey, and Corviknight.</li> <li>Other great partners are Toxapex and Dondozo, as Alomomola relieves pressure on them to check threats such as Koraidon, Chien-Pao, and Great Tusk. Dondozo is especially helpful here due to its Unaware ability. Unfortunately, you also stack weaknesses against common special attackers such as Miraidon and Iron Bundle; this should be considered while teambuilding.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537354, "username": "Mashing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Volcarona": {"outdated": true, "sets": {"Quiver Dance": {}}},
  "Zekrom": {"outdated": true, "sets": {"Dragon Dance": {}, "Mixed Dragon Dance": {}}},
  "Landorus": {"outdated": true, "sets": {"Wallbreaker": {}}},
  "Landorus-Therian": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>While Koraidon is much more common and preferred over Landorus-T as a Choice Scarf user, Landorus-T has several key advantages that make it worth using instead on some teams. Its typing gives it STAB on Earthquake and an immunity to Sticky Web, allowing it to revenge kill non-Terastallized Zacian-C even when Sticky Web is up. This frees Koraidon to run more offensive sets, like Swords Dance and Choice Band. Furthermore, with Stone Edge, it is able to threaten Ho-Oh,while Koraidon needs significant chip or Terastallization to do so; do note that it is not guaranteed to OHKO defensive Ho-Oh from full HP. Access to Intimidate also allows it to help play around powerful physical attackers like Zacian-C, Koraidon, and Dragon Dance Arceus-Ground, though it cannot safely switch in more than once. Crunch is useful to KO Lunala when Shadow Shield is broken and hits Giratina-O without Terastallizing. A Jolly nature is needed for Landorus-T to be able to outrun Zacian-C and is useful for outrunning Timid Choice Scarf Kyogre. Tera Ground strengthens Earthquake, allowing Landorus-T to more easily revenge kill Koraidon, Dragon Dance Arceus-Ground, and Kyogre. Alternatively, Tera Fairy gives resistances to Dragon and Dark, which are useful against Kingambit and Outrage-locked Koraidon. Tera Fairy can also be used with Tera Blast to OHKO Koraidon and hit Giratina-O harder than Crunch.</p> <p>Choice Scarf Landorus-T is best used to provide offensive partners free switches with its fast U-turn and free up partners to use more threatening sets. Koraidon and Arceus-Fairy in particular are great partners, as they are free to run Choice Band and Calm Mind sets, respectively, without needing to worry as much about Zacian-C revenge killing them or being slowed down by Sticky Web. Offensive partners like Koraidon, Zacian-C, Kyogre, Lunala, and Arceus-Fairy appreciate Landorus-T's U-turn giving them opportunities to safely switch in on Pokemon they threaten, like Kyogre, Giratina-O, and opposing Landorus-T. Arceus-Fairy in particular is an important partner for Landorus-T, as it can handle Swords Dance Koraidon, preserving HP on Landorus-T. Landorus-T's disappointing power on neutral targets can leave it prone to being set up on by bulky setup sweepers like Lunala, Calyrex-I, and opposing Calm Mind Arceus formes like Fairy and Ghost, so teammates that can handle them like Kyogre, Ho-Oh, and Kingambit are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 249382, "username": "Aberforth"}, {"user_id": 374620, "username": "Lana"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Kyurem-Black": {
    "outdated": true,
    "overview": "<p>Chillingly powerful is quite the accurate description for Kyurem-B. With an Attack stat that eclipses even Calyrex-I, BoltBeam coverage, Dragon Dance, and Teravolt to boot, Kyurem-B is easily capable of ripping through bulky teams, with even Necrozma-DM struggling to stand up to its Fusion Bolt with Tera Electric and Miraidon's Electric Terrain. Its solid natural bulk also allows it to set up against passive Pokemon like Gliscor and Arceus-Water lacking Will-O-Wisp, and it threatens the specially defensive Ground-types used to stave off Miraidon like Arceus-Ground, Ting-Lu, and Clodsire. Unfortunately, Kyurem-B's part-Ice typing is a massive hindrance defensively, limiting its opportunities to set up despite its solid natural bulk. It can also be outsped by Choice Scarf Koraidon even after a boost or picked off by priority like Arceus's Extreme Speed or Kingambit's Sucker Punch. It also is not exactly the fastest Pokemon in the world, which in conjunction with its meager defensive profile limits what Kyurem-B can accomplish against offensive teams.</p>",
    "comments": "<h4>Other Options</h4> <p>Tera Fire with Tera Blast can be used to destroy Necrozma-DM and Zacian-C at +1 while also avoiding burns from Ho-Oh. However, it is largely unnecessary given how strong +1 Tera Electric Fusion Bolt is.</p> <h4>Checks and Counters</h4> <p><strong>Arceus-Fairy</strong>: Arceus-Fairy can easily take everything Kyurem-B throws at it, has reliable recovery, and can threaten Kyurem-B with super effective Judgment or Will-O-Wisp.</p> <p><strong>Ho-Oh</strong>: Ho-Oh can survive +1 Fusion Bolt and threaten to burn Kyurem-B with Sacred Fire or phaze it with Whirlwind. Tera Fairy Ho-Oh also survives everything +1 Kyurem-B can throw at it.</p> <p><strong>Speed Control</strong>: Choice Scarf Koraidon outspeeds Kyurem-B even after a Dragon Dance and threatens it in return. Extreme Killer Arceus and Kingambit threaten to pick off Kyurem-B with Extreme Speed or Sucker Punch.</p> <p><strong>Residual Damage</strong>: Kyurem-B has no recovery and is vulnerable to all forms of residual damage, even being weak to Stealth Rock.</p> <p><strong>Steel-types</strong>: While they're not hard counters, Necrozma-DM and Zacian-C resist Icicle Spear, can take +1 Fusion Bolt, and retaliate with super effective STAB moves, and Necrozma-DM can heal off the damage. They must, however, be wary of Kyurem-B Terastallizing into an Electric-type.</p> <p><strong>Trick Room Pokemon</strong>: Pokemon like Necrozma-DM, Calyrex-I, and the rare Necrozma-DW can take boosted attacks from Kyurem-B and turn the tables on it with Trick Room.</p> <p><strong>Ditto:</strong> While it's rare, Ditto can reliably revenge kill Kyurem-B. It must, however, watch out for Substitute on dual screens teams.</p>",
    "sets": {
      "Dragon Dance": {
        "description": "<p>With Dragon Dance, Kyurem-B can boost its Attack to even greater levels while also fixing its Speed issue. Icicle Spear and Fusion Bolt provide perfect coverage in Ubers, and Fusion Bolt's power can be increased further with Tera Electric and Miraidon's Electric Terrain. Tera Electric is also useful for the Steel resistance it provides, allowing Kyurem-B to set up on and threaten Zacian-C and Necrozma-DM without Earthquake, which would normally check it quite easily. Loaded Dice makes Icicle Spear and Scale Shot reliably strong STAB moves. Scale Shot is usually preferred over Substitute thanks to Kyurem-B's meager defensive profile, but Substitute can be used on dual screens hyper offense teams where its defensive problems are mitigated to set up freely on Gliscor and Arceus-Water and avoid revenge killing attempts from Choice Scarf Koraidon and Extreme Killer Arceus. Jolly is usually the preferred nature to let Kyurem-B outspeed Zacian-C with one Speed boost and Choice Scarf Koraidon with two, but Adamant is superior on Sticky Web teams where its Speed issue is mitigated.</p> <p>Due to being relatively weak without Terastallization and its defensive shortcomings, Kyurem-B fits best on hyper offense teams. Grimmsnarl's dual screens aid Kyurem-B further with setting up and even allows it to run Subsitute. Ribombee's Sticky Web mitigates Kyurem-B's Speed issue and allows it to run an Adamant nature. On both styles, Miraidon is a near-mandatory partner, setting up Electric Terrain for Kyurem-B to boost its Fusion Bolt and getting it in safely with U-turn. In return, Kyurem-B threatens Ground-types used to check Miraidon, like Gliscor, Ting-Lu, and Arceus-Ground. Necrozma-DM can serve as a check to Zacian-C and Arceus before Kyurem-B is ready to sweep, making it a good partner. Despite not being very apt defensively, Kyurem-B can switch into and set up on Kyogre once, making it a solid partner for Koraidon and Arceus-Ground. Kyurem-B also appreciates these Pokemon immediately threatening Necrozma-DM, which it can struggle against even if Necrozma-DM does not carry Sunsteel Strike.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 306317, "username": "katerina"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ribombee": {
    "outdated": true,
    "overview": "<p>Ribombee is the only viable Sticky Web user in Ubers. It has a niche as a lead for hyper offense teams that is capable of preventing Koraidon from using Scale Shot while potentially paralyzing a threat with Stun Spore. It is just fast enough to outrun Pokemon that commonly run Taunt, like Arceus, while discouraging Koraidon and Miraidon from staying in on it thanks to its STAB Moonblast. Unfortunately for Ribombee, it can be played around by select antileads like Iron Treads and other leads like Glimmora, both of which can prevent Sticky Web from going up pretty consistently. The presence of Zacian-C in the tier can also make Ribombee's job harder, as its user will have to decide to either use Sticky Web or risk Stun Spore missing.</p>",
    "comments": "<h4>Other Options</h4> <p>Choice Scarf can be run on Ribombee to outspeed Taunt Miraidon and use Sticky Web before Miraidon can attack. This makes Ribombee consistently able to get Sticky Web up in almost every game. Its only downside, however, is that Ribombee then gets OHKOed by any attack thrown at it, mainly Choice Scarf Koraidon's Flare Blitz.</p> <p>Quiver Dance is an option for Ribombee to break Zacian-C's Substitute with Moonblast in one turn. However, Substitute Zacian-C is very rare and thus not worth preparing for generally, and Ribombee much prefers using other moves like Stun Spore.</p> <p>Tera Ghost can be run instead of Tera Steel to prevent Arceus's Extreme Speed from revenge killing Ribombee; this gives the Ribombee user more turns to damage Arceus with Moonblast or cripple it with Stun Spore. However, Ribombee much rather prefers being immune to Glimmora's Mortal Spin, as Arceus can be dealt with very easily.</p> <h4>Checks and Counters</h4> <p><strong>Taunt</strong>: Taunt Miraidon prevents Ribombee from using Sticky Web, thus nullifying its threat. However, it gets 2HKOed by Moonblast, making the interaction a tricky mindgame. Other Pokemon like Deoxys-S can annoy Ribombee with attacks like Psycho Boost or Extreme Speed after Taunting it while setting free Stealth Rock or Spikes. While weak to Moonblast, Grimmsnarl can prevent Ribombee's Sticky Web with its Prankster Taunt. It also can use Light Screen and Parting Shot to turn Ribombee into setup fodder for one of its teammates.</p> <p><strong>Entry Hazard Removal</strong>: Glimmora can keep Sticky Web off the field with Mortal Spin while breaking Ribombee's Focus Sash and potentially forcing it to use Tera Steel to ensure that Mortal Spin fails. Corviknight can comfortably set up on Ribombee with Iron Defense while clearing Sticky Web away with Defog, making it a potential threat to Ribombee's team afterwards if said team has no special attackers.</p> <p><strong>Trick Room Users</strong>: Trick Room can turn the tables on Ribombee and its Sticky Web, as the decrease in Speed by one stage can allow for the foe's Trick Room Necrozma-DM to be faster than Ribombee's team. Other Trick Room users like Calyrex-I also work similarly to Necrozma-DM.</p> <p><strong>Heavy-Duty Boots</strong>: Pokemon like Miraidon commonly run Heavy-Duty Boots, which renders Sticky Web useless. Other common users of Heavy-Duty Boots include Kyogre, Chien-Pao, Arceus, and Koraidon.</p> <p><strong>Hatterene</strong>: Hatterene's Magic Bounce completely nullifies Ribombee's Sticky Web.</p> <p><strong>Orthworm</strong>: Orthworm can use Shed Tail to bring a teammate like Zacian-C or Agility Miraidon into play to break through Ribombee's team with extreme ease.</p>",
    "sets": {
      "Sticky Web": {
        "description": "<p>Sticky Web keeps threats like Zacian-C, Koraidon, non-Heavy-Duty Boots Miraidon, and most Arceus formes in check and allows for the use of non-Speed boosting natures on common hyper offense teammates like Miraidon. Moonblast targets Pokemon that could try to antilead Ribombee, like Taunt Miraidon; if Miraidon decides to Taunt Ribombee to prevent Sticky Web from going up, it will get 2HKOed by Moonblast. Stun Spore is Ribombee's best option against foes such as Ho-Oh and Arceus formes, as they don't mind Moonblast too much and run Heavy-Duty Boots to negate Sticky Web. Alternatively, Psychic Noise can be used to 2HKO Glimmora while negating Recover from Pokemon like Arceus and Clodsire, as well as Roost from Corviknight. Tailwind is a more immediate option that allows for teammates like Necrozma-DM to be faster than Heavy-Duty Boots foes like Miraidon and Zacian-C, as well as Flying-types like offensive Ho-Oh. Pounce can be used as an alternative, as it helps Ribombee beat Miraidon one-on-one if it uses Taunt instead of breaking Ribombee's Focus Sash with Electro Drift while also helping Ribombee eventually use Sticky Web against Deoxys-S and Deoxys-A. However, Deoxys-S is not common enough to justify its use.</p> <p>Tera Steel gives Ribombee a Poison immunity, which helps against Glimmora by not letting it use Mortal Spin to clear Sticky Web.</p> <p>Ribombee should be only used on hyper offense teams. Good teammates include Koraidon, Miraidon, Necrozma-DM, Zacian-C, Arceus formes, and other threats like Kyurem-B, Chien-Pao, and Kingambit. Kyurem-B and Rayquaza especially like Sticky Web because it lets them outspeed Arceus formes. Grimmsnarl can be another good teammate due to its ability to further support Ribombee's team with dual screens, allowing for an even easier time setting up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 306317, "username": "katerina"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Toxapex": {
    "outdated": true,
    "sets": {
      "Physical Wall": {
        "description": "<ul> <li>Toxapex is an excellent physically defensive wall capable of taking on foes such as Koraidon and Zacian-C.</li> <li>Haze shuts down boosting attempts from the likes of Swords Dance Koraidon, Arceus, and Zacian-C.</li> <li>Toxic prevents checks like Miraidon, Groudon, and Arceus-Ground from coming in freely and forcing Toxapex out while also putting setup sweepers on a timer.</li> <li>If Toxapex runs Toxic Spikes, teammates such as Arceus-Ground can pressure Toxic Spikes absorbers like Eternatus and Clodsire. Poison Jab spreads poison to foes like Arceus-Fairy and Flutter Mane, and Ice Beam helps Toxapex greatly with Rayquaza while also helping against Landorus-T, Koraidon, and Gliscor.</li> <li>Rocky Helmet is preferred to chip down physical attackers and most pivots. Mental Herb is an alternative that helps Toxapex deal with Taunt Arceus formes.</li> <li>Tera Fairy makes Toxapex immune to Dragon-type moves, letting it deal with Scale Shot Koraidon, while Tera Ground helps Toxapex against Wild Charge Zacian-C.</li> <li>Toxapex makes good partners with other defensive Pokemon like Ting-Lu and Clodsire, which can check threats like Miraidon. In return, Toxapex can help deal with threats like Koraidon and Zacian-C.</li> <li>Offensive pivots like Miraidon, Koraidon, and Landorus-T also pair well with Toxapex, as they can bring it in more freely to handle their checks.</li> <li>Gliscor can switch into Ground-types such as Ting-Lu, non-Ice Beam Arceus-Ground, and Heavy-Duty Boots Miraidon, spread entry hazards, and check Koraidon and Zacian-C, preventing Toxapex from being worn down.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 449990, "username": "DC"}]}]}
  },
  "Lunala": {
    "outdated": true,
    "overview": "<p>Lunala possesses a small niche in Ubers as a setup sweeper thanks to its spammable STAB move, access to Agility, and good natural bulk courtesy of Shadow Shield. Its Ghost typing allows it to pressure notable threats like Necrozma-DM, Calyrex-I, and some Extreme Killer Arceus. However, Lunala faces direct competition from its fellow Ghost-types, Necrozma-DW, which fills an almost identical niche and is considerably stronger, and Flutter Mane, which boasts a better secondary typing and much better Speed. To make matters worse, even after a Special Attack boost, it lacks the power to get past many common defensive Pokemon in the tier, such as Ho-Oh, Eternatus, Ting-Lu, and Calm Mind Arceus formes. Additionally, Lunala's vulnerability to entry hazards and dependence on Tera to pick up KOs makes it difficult to justify on most teams.</p>",
    "comments": "<h4>Other Options</h4> <p>Psyshock can be used to beat Eternatus, Clodsire, and the rare Blissey, but it leaves Lunala completely walled by Ting-Lu and is largely useless against the rest of the tier. Calm Mind can be used with Heavy-Duty Boots as a boosting option over Meteor Beam. However, being unable to threaten Ho-Oh can be detrimental to Lunala's chances of sweeping, and Lunala will rarely get more than one turn to set up, so the immediate power of Meteor Beam is preferable.</p> <h4>Checks and Counters</h4> <p><strong>Ting-Lu</strong>: A healthy Ting-Lu can tank any attack Lunala throws at it and phaze it out with Whirlwind, set up entry hazards, or weaken it with Ruination.</p> <p><strong>Ho-Oh</strong>: Once Lunala has used its Power Herb, Ho-Oh can comfortably phaze it out, wasting Lunala's boost from Meteor Beam, and heal off the damage with Regenerator.</p> <p><strong>Entry Hazards</strong>: Since Lunala is required to run Power Herb, it is hit by all forms of entry hazards, which break its Shadow Shield and can put it in range of being revenge killed or outright prevent it from setting up.</p> <p><strong>Dark-types</strong>: Although rare, Arceus-Dark, Kingambit and Chien Pao's Dark typing and the latter two's priority Sucker Punch make Lunala's prospects of sweeping grim. They have to fear a potential Focus Blast, but Arceus-Dark cannot be OHKOed unless Lunala Terastallizes Fighting, and Sucker Punch has favorable odds to OHKO Lunala even through Shadow Shield if Chien Pao is holding a Life Orb or Choice Band and Kingambit has multiple allies fainted.</p> <p><strong>Special Walls</strong>: Walls like Eternatus, Clodsire, and Blissey can shut down Lunala through status or by stalling out the low PP of its moves.</p>",
    "sets": {
      "Agility": {
        "description": "<p>Agility aims to take advantage of Lunala's fantastic Ghost-type STAB move and respectable Special Attack to transform it into a threatening sweeper. 200 Speed EVs and a Timid nature allow Lunala to outspeed the entire metagame, including even +1 Speed Koraidon and Miraidon, after an Agility boost. The remaining EVs are invested into its HP to better take hits while setting up. Focus Blast, in combination with Moongeist Beam, gives Lunala perfect neutral coverage, and it crucially hits Dark-type Pokemon like Ting-Lu, Arceus-Dark, Kingambit, and Chien-Pao for super effective damage, easily OHKOing the latter two. Focus Blast also allows Lunala to 2HKO Extreme Killer Arceus, though Lunala must be wary of a potential Shadow Claw. Moonblast is a perfectly accurate alternative that forms similarly great coverage with Moongeist Beam and always OHKOes Koraidon, but it deals significantly less damage to Ting-Lu and fails to 2HKO Arceus and OHKO Kingambit. Meteor Beam not only gives Lunala a Special Attack boost, but it also OHKOes Ho-Oh, which is an otherwise problematic check for Lunala to deal with. Tera Ghost boosts the power of Moongeist Beam, which, after a Special Attack boost, allows Lunala to OHKO many neutral targets, such as Koraidon, Miraidon, and Zacian-C. Tera Ghost also removes Lunala's 4x weakness to Dark- and Ghost-type moves, allowing it to survive them if Shadow Shield is intact. Tera Fighting is an option when Lunala is running Focus Blast to, with a Special Attack boost, have a chance to OHKO Ting-Lu after damage from entry hazards and always OHKO Arceus and Arceus-Dark, while Tera Fairy allows Lunala to always OHKO Miraidon and 2HKO Ting-Lu with a boosted Moonblast. Both Tera Fighting and Tera Fairy negate Lunala's weaknesses to Dark and Ghost, with Tera Fairy having the additional benefit of an immunity to the numerous Dragon-type moves used in Ubers, notably enabling Lunala to check Koraidon with Shadow Shield intact.</p> <p>Lunala finds itself almost exclusively on hyper offense teams that cannot fit a more potent option, such as Necrozma-DW, where its single-use setup is not a problem. Special sweepers like Eternatus and Miraidon alongside Lunala can overwhelm checks like Ting-Lu and Clodsire and clear the way for each other to sweep. Dedicated leads, such as Glimmora, Deoxys-S, and Deoxys-A, can hinder opposing teams from setting entry hazards while setting entry hazards themselves to weaken foes for Lunala. Ho-Oh lures like Zacian-C, Scale Shot Koraidon, and Necrozma-DM running Stone Edge make for great teammates, since Lunala has a much easier time sweeping once Ho-Oh is removed. In return, Lunala's ability to shut down dangerous sweepers, such as Extreme Killer Arceus and Calyrex-I, in an emergency with Shadow Shield frees teammates to run offensive Tera types; for example, Tera Grass on Miraidon with Solar Beam or forgoing Tera Ghost on Arceus and Koraidon in favor of Tera Normal and Tera Fire, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 547277, "username": "LillianOfficial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Necrozma-Dusk-Mane": {
    "overview": "<p>Necrozma-DM is one of the best Pokemon in Ubers. Between its sky-high Attack stat, high defensive stats, passable Speed, and a deep movepool, it is able to fulfill a huge variety of roles, which gives it a place on a lot of teams ranging from hyper offense to bulky offense and even stall. Necrozma-DM's typing allows it to check threatening Pokemon that would otherwise be very difficult to switch into consistently, like Zacian-C, Eternatus, Deoxys-A, Gliscor, and some Arceus formes like Arceus-Fairy. Terastallization allows Necrozma-DM to beat threats that would otherwise check it, such as Ho-Oh and Koraidon, while allowing it to soft check other Pokemon like boosted Flutter Mane in a pinch. The omnipresence of Koraidon also helps Necrozma-DM, bolstering its Morning Sun recovery and giving it an option to stay healthy throughout the battle.</p> <p>However, Necrozma-DM is very slow even after a Dragon Dance boost. This makes it prone to getting outsped by a plethora of offensive Pokemon like Koraidon, Miraidon, Deoxys-A, Zacian-C, Flutter Mane, and Choice Scarf users like Kyogre, all of which can severely hurt Necrozma-DM if not outright OHKO it. While Necrozma-DM is bulky, it is not capable of tanking hits from boosted Pokemon and therefore might get overwhelmed by what it is supposed to check, like Zacian-C, forcing it to stay very healthy if it wants to fulfill its defensive role. Necrozma-DM is oftentimes forced to Terastallize in order to beat common Pokemon like Ho-Oh, Koraidon, and Arceus formes carrying Will-O-Wisp. Furthermore, some Arceus formes like Arceus-Ground are able to check every Necrozma-DM set.</p>",
    "comments": "<h3>Other Options</h3> <p>A Choice Band set might seem interesting due to its ability to 2HKO every Arceus forme with its STAB attacks while also 2HKOing Gliscor and Ting-Lu. However, this set's viability relies entirely on good positioning and prediction. Necrozma-DM's Speed stat also lets it down in being a wallbreaker, as it is outsped by a lot of common offensive Pokemon and thus cannot make use of its excellent defensive typing nearly as much when locked into one move. Choice Band Necrozma-DM would be best suited using a set consisting of Sunsteel Strike, Photon Geyser, Earthquake and Knock Off.</p> <p>A specially defensive spread with Tera Ground can be used so Necrozma-DM has an easier time setting up on Calm Mind Arceus formes and Miraidon. However, Necrozma-DM can no longer check physical attackers like Zacian-C with this set, as it gets OHKOed by a +3 Close Combat. Furthermore, Ho-Oh, Gliscor, and Ting-Lu are comfortably able to check this set.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: By virtue of its resistance to Steel and access to Recover, Thunder Wave, and Will-O-Wisp, Arceus-Water is the best Necrozma-DM counter available, being able to heal off the damage done by it with Recover and not minding Dragon Dance too much due to being faster than Necrozma-DM even if it's at +1. This gives Arceus-Water complete control over the one-on-one interaction, forcing Necrozma-DM to Terastallize into the Fire typing if it wants to avoid getting burnt by Will-O-Wisp, which then risks being hit by a devastating Judgment. Arceus-Water even has access to Dragon Tail if it wants to phaze Necrozma-DM, which is a safer interaction for it. However, Lum Berry, Life Orb, and Tera Psychic variants all have a positive matchup against Arceus-Water. The sun constantly being up thanks to Koraidon also makes it hard for Arceus-Water to threaten Tera Fire Necrozma-DM. Kyogre is another troublesome Pokemon for Necrozma-DM; while it does not appreciate switching into it, it can threaten to OHKO it with its STAB moves while halving Morning Sun's recovery by summoning rain.</p> <p><strong>Ground-types</strong>: Arceus-Ground can switch directly into Necrozma-DM and shrug off its attacks thanks to its superb bulk and Recover. It can then use Necrozma-DM as setup bait for Dragon Dance or Calm Mind, forcing it to switch out. Pokemon like Landorus-T and Groudon are durable enough to the point where Necrozma-DM might struggle getting past them without an unreasonable amout of Dragon Dances. Landorus-T even has access to Taunt to shut down any setup or recovery attempts from it, while Groudon can use Necrozma-DM to freely use Spikes, spread burns with Will-O-Wisp or Lava Plume, and phaze it with Roar. Ting-Lu can set up Spikes on Necrozma-DM and phaze it with Whirlwind while not minding boosted attacks too much due to its high Defense.</p> <p><strong>Ho-Oh</strong>: Ho-Oh is bulky enough to constantly switch into Necrozma-DM, with Regenerator further helping it accomplish this role. Furthermore, Ho-Oh can threaten a burn with Sacred Fire, forcing Necrozma-DM to either Terastallize, use a Lum Berry, or switch out. However, Stone Edge or a boosted Photon Geyser can deal extreme damage to Ho-Oh.</p> <p><strong>Arceus-Dark</strong>: Arceus-Dark is one of the best counters to Necrozma-DM thanks to its immunity to Photon Geyser and access to Will-O-Wisp and Recover. Necrozma-DM can Terastallize into the Fire typing in order to comfortably beat Arceus-Dark one-on-one, but it must be careful of Judgment, especially if it has little to no bulk investment, as even an unboosted Judgment will hurt. Arceus-Dark can even fit other moves like Foul Play and Dragon Tail into its arsenal to better its matchup against a Terastallized Necrozma-DM. Sunsteel Strike variants, however, can outright beat Arceus-Dark, either taking it out or forcing a reactive Terastallization from it.</p> <p><strong>Faster Foes</strong>: Choice Scarf Pokemon like Koraidon, Miraidon, and Kyogre outspeed Necrozma-DM even after a Dragon Dance, with Koraidon and Miraidon outspeeding Necrozma-DM even after it has used Dragon Dance twice. Other Pokemon like Deoxys-A, Zacian-C, Flutter Mane, Miraidon, and boosted Dragon Dance Arceus formes will outspeed a boosted Necrozma-DM as well.</p> <p><strong>Physically Bulky Foes</strong>: Pokemon like Gliscor and Skarmory are bulky enough to withstand Necrozma-DM's attacks, with Skarmory having access to Iron Defense and Roost to become a very sturdy counter. Gliscor outspeeds unboosted Necrozma-DM and can proceed to either lay Spikes freely, heal off any damage done with Protect, or hit it with Earthquake for a solid 25%. Furthermore, Gliscor can also use Taunt to stop any Morning Sun healing. However, Necrozma-DM will use Gliscor as setup bait if it's not carrying Taunt in its moveset.</p> <p><strong>Opposing Necrozma-DM</strong>: Defensive Necrozma-DM is a good check to itself, being able to use Swords Dance alongside defensive Dragon Dance Necrozma-DM and easily 2HKO it. Using Tera Ground, defensive Necrozma-DM can even beat offensive Dragon Dance Necrozma-DM one-on-one by spamming Earthquake.</p> <p><strong>Giratina-O</strong>: Giratina-O is bulky enough to tank even boosted attacks from Necrozma-DM and threatens to burn it with Will-O-Wisp, phaze it with Dragon Tail, or 2HKO it with Poltergeist. Furthermore, Giratina-O can also Terastallize into the Steel typing to completely wall Necrozma-DM.</p> <p><strong>Orthworm</strong>: Albeit rare, Orthworm completely walls Necrozma-DM and uses Shed Tail for free against it.</p>",
    "sets": {
      "Defensive Dragon Dance": {
        "description": "<p>Defensive Dragon Dance Necrozma-DM is one of the best setup sweepers in the format thanks to how easy it is for it to find opportunities to set up due to its excellent bulk and the rarity of Pokemon that can actually punish its setup attempts. Sunsteel Strike is Necrozma-DM's main STAB move that, despite its low PP, is very spammable due to how hard it hits most neutral targets, as well as Fairy-type Pokemon such as Arceus-Fairy, Zacian-C, Flutter Mane, and Tera Fairy users like Kyogre. If Necrozma-DM instead wants to hit Water-type Pokemon like Kyogre and Arceus-Water for neutral damage, Photon Geyser is also an option. Photon Geyser also has the added benefit of hitting one of Necrozma-DM's best checks in Ho-Oh for solid damage without needing Stealth Rock on the field. It is worth noting that both moves also hit Unaware Skeledirge quite hard. Running Photon Geyser and Sunsteel Strike in the same moveset is advised against due to its inability to hit opposing Necrozma-DM hard. Knock Off is Necrozma-DM's best option alongside Sunsteel Strike because it lets it remove key items like Ho-Oh and Kyogre's Heavy-Duty Boots, giving Necrozma-DM an opportunity to take them out later after it has used Dragon Dance if they're sufficiently worn down. Knock Off can also help Necrozma-DM remove other items like Gliscor's Toxic Orb if it didn't use Protect to activate its ability. Earthquake is the other option to consider over Knock Off and one that works best when used alongside Photon Geyser to hit the aforementioned Pokemon for high damage, particularly opposing Necrozma-DM and Zacian-C, which take less damage from Photon Geyser than they do from Sunsteel Strike. Earthquake also targets Tera Electric Pokemon like Kyurem-B and Zekrom that otherwise would break past Necrozma-DM. Tera Fire is Necrozma-DM's best type to Terastallize into because of its great defensive profile, letting it turn the tables against Koraidon and Flutter Mane while also becoming immune to Will-O-Wisp and Sacred Fire's chance to burn. The given EVs allow Necrozma-DM to avoid the OHKO from Zacian-C's +3 Tera Fighting Close Combat. Another EV spread to run is 252 HP / 136 Def / 120 Spe with an Impish nature; this allows Necrozma-DM to outspeed Deoxys-A after two Dragon Dance uses. However, Zacian-C then has a very high chance of OHKOing Necrozma-DM with a +3 Close Combat.</p> <p>Defensive Dragon Dance Necrozma-DM is a key piece in many bulky offense teams due to the role compression that it brings to them; checking Zacian-C while being a good wallbreaker or sweeper that can set up on Gliscor is invaluable for them. However, it might still struggle to sweep because of its poor Speed and need of multiple Dragon Dances to actually be faster than most offensive threats. Because of this, Necrozma-DM heavily appreciates teammates like Ho-Oh, Arceus-Water, Arceus-Fairy, Ting-Lu, Landorus-T, and Gliscor that can check the majority of Pokemon that might overwhelm it, such as Koraidon, Zacian-C, Calyrex-I, and Kyurem-B. Arceus formes also help Necrozma-DM by switching into Knock Off, preventing it from losing its item and, therefore, preventing it from taking entry hazard damage. Pokemon with access to entry hazards like the aforementioned Ting-Lu and Arceus formes can help Knock Off variants of Necrozma-DM overwhelm checks to it like Ho-Oh and Kyogre; Thunder Wave Arceus-Fairy in particular is a good teammate, as it can cripple Ho-Oh for Necrozma-DM. Choice Scarf Koraidon in particular is one of Necrozma-DM's best partners because it revenge kills many of the threats that it can't reliably check by itself like Zacian-C while bolstering Morning Sun's recovery.</p>"
      },
      "Offensive Dragon Dance": {
        "description": "<p>Dragon Dance Necrozma-DM can run an all-out offensive spread to hit as hard as possible. EdgeQuake coverage hits everything from opposing offensive Necrozma-DM, Miraidon, and Eternatus to Ho-Oh very hard, meaning that the Pokemon that actually check Necrozma-DM are limited to Pokemon like Arceus-Water, Kyogre, Ting-Lu, Arceus-Dark, defensive Necrozma-DM, and Landorus-T. Photon Geyser can be an option over Stone Edge if Necrozma-DM wishes to turn the tables on Arceus-Water and Kyogre. The combination of Sunsteel Strike and Photon Geyser allows Necrozma-DM to defeat every aforementioned check, with its counterplay becoming even more limited to faster foes like Choice Scarf Koraidon, although Ho-Oh becomes better suited to taking it on, as it survives a +1 Photon Geyser. However, Ho-Oh can get OHKOed by a +1 Photon Geyser if Necrozma-DM is running Life Orb and Tera Psychic. Lum Berry is the primary item of choice to help Necrozma-DM against status from Pokemon like Arceus-Water that might want to paralyze or burn Necrozma-DM, and it is best used with Photon Geyser, as a +1 Photon Geyser 2HKOes Arceus-Water after Stealth Rock and OHKOes it at +2 with Tera Psychic. Occa Berry allows Necrozma-DM to survive a Flare Blitz from Koraidon, letting it boost with Dragon Dance or use Sunsteel Strike or Photon Geyser for massive damage. This, however, heavily worsens Necrozma-DM's matchup against status and might force it to Terastallize into the Fire typing more often than not to play around that. Life Orb empowers Necrozma-DM's attacks to insane levels, allowing it to OHKO offensive Ho-Oh and Kyogre with Photon Geyser while 2HKOing Arceus-Water through burn. A +1 Life Orb Sunsteel Strike also has a chance to OHKO Arceus-Dark after a single round of Stealth Rock damage. Tera Fire allows Necrozma-DM to have an easier time setting up on Koraidon, Ho-Oh, and Will-O-Wisp variants of Arceus, whereas Tera Psychic empowers Photon Geyser to the point of giving Necrozma-DM a tool to potentially OHKO Ho-Oh at +1 while also resisting Koraidon's Low Kick.</p> <p>Necrozma-DM fits best on hyper offense teams that can capitalize on the damage it causes to opposing physical walls. Physical attackers like Koraidon, Zacian-C, Calyrex-I, and Rayquaza are all good partners because they also share common checks with Necrozma-DM in Arceus-Water, Arceus-Fairy, and opposing Necrozma-DM and can wear them down together. Grimmsnarl can ease setup for Necrozma-DM with dual screens, Ribombee can help with Necrozma-DM's middling Speed, and Deoxys-S can get entry hazards on the field for Necrozma-DM to better deal with its checks like Giratina-O, Arceus-Water, and Arceus-Ground.</p>"
      },
      "Trick Room": {
        "description": "<p>Trick Room makes Necrozma-DM a scary anti-offense Pokemon and late-game sweeper that can very quickly turn the tides in its favor thanks to Terastallization and powerful neutral coverage. Running Trick Room allows Necrozma-DM to fully invest in bulk, allowing it to survive hits that it would otherwise not be able to, such as unboosted Flare Blitz and Modest Origin Pulse from Koraidon and Kyogre, respectively. Photon Geyser and Earthquake provide Necrozma-DM with near-perfect neutral coverage, only missing out on select Pokemon like Skarmory and Tera Steel Giratina-O. Lum Berry allows Necrozma-DM to beat most Arceus formes one-on-one, mainly Arceus-Water that would try to burn Necrozma-DM with Will-O-Wisp. This lets Necrozma-DM set up without any fear of getting statused. Life Orb gives Photon Geyser the needed extra power to OHKO maximum Defense Ho-Oh at +2; however, Necrozma-DM needs two free turns to use the appropriate moves and thus can be played around with ease. Weakness Policy is an option as well to take advantage of Necrozma-DM's monstrous bulk, assuming it survives a super effective hit. This can prove to be a game-ender, as a +2 Necrozma-DM is very difficult for worn-down or unprepared teams to face. However, both Life Orb and Lum Berry are far better options if Necrozma-DM wants an offensive item because Weakness Policy variants are prone to getting statused. Lastly, Mental Herb might seem odd on a Pokemon like Necrozma-DM, but it helps it to play around Taunt from Pokemon like Miraidon, Deoxys formes, Arceus formes, and even Gliscor that would try and stop Necrozma-DM from using Trick Room. Tera Fire allows Necrozma-DM to avoid getting burnt by Will-O-Wisp Arceus formes and Sacred Fire from Ho-Oh while turning its Fire-type weakness into a resistance to beat Koraidon one-on-one.</p> <p>Trick Room Necrozma-DM fits best on hyper offense teams that want an anti-offense option that can beat Pokemon like Calyrex-I while simultaneously wanting very potent late-game insurance. Good teammates include Calyrex-I, Koraidon, Zacian-C, Rayquaza, and Kyurem-B thanks to their ability to break past common physically defensive walls like Arceus-Water, Arceus-Fairy, Groudon, and Landorus-T. Pokemon like Deoxys-A and Glimmora make for good partners as well for their ability to soften these physical walls with entry hazards. This set, however, does not fit well onto Sticky Web hyper offense teams because it is counterproductive.</p>"
      },
      "Defensive": {
        "description": "<p>Defensive Necrozma-DM takes advantage of its excellent bulk and defensive typing, which makes it one of the most reliable Stealth Rock setters and pivots. Maximum Defense investment allows Necrozma-DM to avoid the 2HKO from even +3 Zacian-C's Wild Charge, and Heavy-Duty Boots provides further protection against entry hazards. Sunsteel Strike is used because defensive Necrozma's primary role is to check Zacian-C, Extreme Killer Arceus, and Calyrex-I, which are all hit harder by Sunsteel Strike than Photon Geyser. Due to the tendency of these Pokemon to use Tera Fire, Earthquake is used as a form of counterplay, which also ensures a 2HKO against Zacian-C, Zekrom, and Tera Electric Kyurem-B. Swords Dance is used to increase Necrozma-DM's damage output and therefore do a better job at checking the Pokemon it's supposed to, with the added benefit of outdamaging defensive Dragon Dance Necrozma-DM. Swords Dance can even turn the tables against Gliscor, whose Earthquake barely scratches Necrozma-DM. Necrozma-DM can also be a consistent Stealth Rock user due to its stellar defensive profile. Alternatively, Necrozma-DM can ensure its switch-ins take Stealth Rock damage with Knock Off. Knock Off is useful for the same reasons it is on the defensive Dragon Dance set. This seriously helps out its teammates that may be blanket checked by Ho-Oh, as Necrozma-DM can do a great job at luring it. Covert Cloak can be used instead of Heavy-Duty Boots to allow Necrozma-DM to safely stay in and use Knock Off against Ho-Oh or hit it with a Swords Dance-boosted attack, as not even offensive Ho-Oh's Sacred Fire 2HKOs Necrozma-DM. However, this does necessitate good hazard control from teammates as to not leave Necrozma-DM vulnerable to hazards. Tera Ground is used on this set, as it is a great neutral defensive type, and it can be used to turn the tables on Zekrom and Tera Electric Kyurem-B by becoming immune to Electric-type attacks. Additionally, it allows Necrozma-DM to get an extra hit off against Miraidon targeting it with Electro Drift.</p> <p>Defensive Necrozma-DM fits best on balance teams in need of a reliable check to Zacian-C and Extreme Killer Arceus. Its favorite partners are similar to defensive Dragon Dance Necrozma-DM, and include fellow hazard setters and Choice Scarf Koraidon. Arceus-Fairy is a good partner for Necrozma-DM, as it can use Thunder Wave against Ho-Oh to allow Necrozma-DM to outspeed it. Arceus-Fairy can also set Stealth Rock if Necrozma-DM is not running it. Arceus-Fairy benefits from having defensive Necrozma-DM as a partner because Necrozma-DM can check opposing Necrozma-DM that threaten Arceus-Fairy. Other notable partners for Necrozma-DM are Pokemon that help with Ho-Oh and Fire-type attacks in general, like Arceus-Water, Gliscor, and Eternatus. Covert Cloak sets really appreciate Giratina-O because it can offer Defog support to remove entry hazards, as well as providing a way to better deal with Arceus-Ground. Pokemon that appreciate Necrozma-DM's ability to effectively pressure Ho-Oh with Knock Off and Stealth Rock, like Arceus-Fairy, Koraidon, and Ho-Oh, love having it as a partner.</p>"
      },
      "Stored Power": {
        "description": "<p>Necrozma-DM can function as a formidable bulky special sweeper under the right conditions. This set thrives on hyper offense teams as a blanket check to common anti-offense tools like Trick Room Calyrex-I, opposing Necrozma-DM, Iron Defense + Calm Mind Arceus formes, and Zacian-C. By boosting its defenses, Necrozma-DM becomes nearly unkillable, leveraging Stored Power to counter-sweep. 140 Special Defense EVs ensure that even Modest Eternatus requires three consecutive Fire Blasts to KO Necrozma-DM from full HP, granting ample opportunity to set up Calm Mind. Meanwhile, 120 Defense EVs with a Bold nature allow Necrozma-DM to survive two Low Kicks from a Jolly Koraidon 98% of the time, enabling it to safely switch into a Choice Scarf-locked Koraidon, recover HP under sun, bolster its defenses with Iron Defense, and set up on it further. Tera Poison eliminates Necrozma-DM's Fire weakness, grants a Fighting resistance, and retains its Toxic immunity, which is critical for a slow setup sweeper. Tera Water turns its Fire weakness into a resistance, removes its Ground and Dark weaknesses, and adds a Water resistance. This allows Necrozma-DM to set up against threats like non-Choice Specs Kyogre and significantly improves its durability against the devastating Tera Fire Koraidon, albeit at the risk of being poisoned by Eternatus or Gliscor.</p> <p>Necrozma-DM's inability to damage Dark-types and the time required for it to set up are the key limitations. Koraidon, Arceus-Fairy, and Zacian-C are ideal partners to handle Dark-types like Ting-Lu and Kingambit. Special attackers such as Eternatus, Mewtwo, or and Lunala can overwhelm Ting-Lu and Ho-Oh early, denying their ability to phaze and thus paving the way for Necrozma-DM to sweep later. Ribombee provides critical speed control through paralysis and Sticky Web to help Necrozma-DM to improve the matchup against Taunt variants of Calm Mind Arceus, which completely shut down this set. In return, Necrozma-DM supports these teammates by absorbing Ice-type attacks from Calyrex-I, tanking Zacian-C's Behemoth Blade and Play Rough, and acting as a last resort against Iron Defense + Calm Mind Arceus if its teammates cannot take it down.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 306317, "username": "katerina"}, {"user_id": 507268, "username": "ox04"}, {"user_id": 566610, "username": "LouisIX"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 597293, "username": "OreoSpeedruns"}, {"user_id": 249382, "username": "Aberforth"}, {"user_id": 306317, "username": "katerina"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 595062, "username": "Taka"}, {"user_id": 374620, "username": "Lana"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 470115, "username": "SolarBeam"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Magearna": {"outdated": true, "sets": {"Double Dance": {}, "Trick Room Setter": {}}},
  "Corviknight": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<ul> <li>Corviknight's high physical bulk gives it a strong defensive presence in the tier. It is one of the few consistent counters to strong Ground-types like Great Tusk, physical attackers like Chien-Pao, and some special attackers like non-Choice Specs Iron Bundle. Furthermore, its access to Defog also makes it a solid entry hazard remover, though it struggles against Gholdengo.</li> <li>Body Press provides Corviknight with a way to leverage its high Defense stat, doing significant damage to Fighting-weak Pokemon.</li> <li>Brave Bird allows Corviknight to threaten Flutter Mane and Great Tusk. Alternatively, Iron Head can be used to threaten the former while avoiding recoil damage.</li> <li>Maximum HP investment and enough Defense to check Chien-Pao is combined with Leftovers and 96 Special Defense EVs, which allows Corviknight to take two Mystical Fires from most Flutter Mane, as well as giving it the ability to take on non-Choice Specs Iron Bundle and weaker attacks like Freeze-Dry from Choice Specs Iron Bundle.</li> <li>Tera Steel or Flying can be used to shed the weaknesses of Corviknight's dual typing: Tera Steel allows Corviknight to resist Ice-type attacks from Chien-Pao, while Tera Flying allows Corviknight to resist Great Tusk's Fighting-type attacks. Depending on your choice, Terastallization also amplifies the power of either Iron Head or Brave Bird.</li> <li>Corviknight works well as a part of a defensive core with Pokemon like Ting-Lu and Blissey, which can handle threats like Miraidon that obliterate Corviknight. Additionally, Corviknight makes a great partner for offensive threats like Chi-Yu, which appreciate a teammate that easily switches into Ting-Lu, or Great Tusk, which appreciates opposing Great Tusk being worn down.</li> </ul>"
      },
      "Specially Defensive": {
        "description": "<ul> <li>Specially defensive Corviknight can switch into foes like Flutter Mane, Iron Bundle, Gholdengo, and Glimmora.</li> <li>U-turn is used to make Corviknight an effective defensive pivot that can maintain momentum against foes that force it out such as Miraidon and Koraidon.</li> <li>Mirror Armor allows Corviknight to check Mystical Fire Flutter Mane, which would otherwise beat it. Alternatively, when paired with Pressure, Protect enables Corviknight to avoid being 2HKOed by Hydro Pump from Choice Specs Iron Bundle, as well as allowing Corviknight to deplete PP with Pressure more effectively.</li> <li>Corviknight can use Tera Steel to get rid of its weakness to Electric and better take on Ice-type moves from Iron Bundle. Alternatively, it can opt to use Tera Ground to become immune to Miraidon's powerful Electro Drift.</li> <li>Specially defensive Corviknight needs help dealing with strong physical wallbreakers such as Chien-Pao from teammates like Dondozo and Scream Tail. Furthermore, Pokemon that are especially threatened by Flutter Mane and Iron Bundle, such as Koraidon, Great Tusk, and Skeledirge, are able to rely on specially defensive Corviknight as a consistent switch-in.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 342456, "username": "Drifting"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 274590, "username": "SiTuM"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Hatterene": {
    "outdated": true,
    "sets": {
      "Bulky Calm Mind": {
        "description": "<ul> <li>Hatterene is mostly used to deny entry hazards on offensive teams to allow threats to come in unscathed, and stall teams so they have breaking power and an easier time against hazards.</li> <li>The combination of Draining Kiss and Calm Mind with Defense investment helps Hatterene take hits from common walls like Great Tusk and Ting-Lu well, using them for recovery or setup.</li> <li>Psyshock and Stored Power are interchangeable, as Psyshock is better on more balance and offensive teams due to its immediate power, while Stored Power fits better on bulkier teams, helping them break past walls the teams would otherwise struggle with like Dondozo.</li> <li>Mystical Fire is useful coverage to hit Steel-types, such as Corviknight and Iron Treads, while Protect is used to scout double switches, scout Choice item uses, and rack up Leftovers recovery.</li> <li>The Speed EVs are to outspeed Dondozo.</li> <li>Tera Water provides Hatterene with a Fire resistance and Ghost neutrality to better deal with Koraidon and Flutter Mane. Additionally, Tera Water Hatterene resists Steel-type moves from Kingambit and Corviknight and resists Ice- and Water-type moves, allowing Hatterene to tank hits from Chien-Pao and Iron Bundle more effectively.</li> <li>Tera Flying gives Hatterene immunity to Ground-type moves from Ting-Lu and Great Tusk while also resisting Fighting moves from Koraidon and Great Tusk. It also gives Hatterene a Spikes immunity, giving it easier entry against offensive teams.</li> <li>Stealth Rock-weak Pokemon such as Chien-Pao, Chi-Yu, and Iron Bundle are great partners to Hatterene, since they benefit from Hatterene denying Stealth Rock.</li> <li>Koraidon and Miraidon are great partners, since Hatterene can break their most common checks, being Great Tusk and Toxapex for Koraidon, and Ting-Lu and Clodsire for Miraidon. Hatterene benefits from the breaking power of the Dragon-types, since they can remove offensive threats that annoy Hatterene like Flutter Mane and Miraidon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537354, "username": "Mashing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 507268, "username": "ox04"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Grimmsnarl": {
    "outdated": true,
    "overview": "<p>Grimmsnarl finds its place in Ubers as a part of hyper offense teams thanks to its ability to set dual screens with Prankster, allowing more powerful threats to set up safely. Grimmsnarl does not have any viability outside of these team structures due to its middling stats, but the strength of these team styles thanks to the abundance of setup sweepers in Ubers makes it an important consideration in the metagame.</p>",
    "comments": "<h4>Other Options</h4> <p>Grimmsnarl can run Thunder Wave to slow down opposing offensive Pokemon, especially Zacian-C that try to set up in front of it; however, other top threats like Miraidon and Arceus-Ground are immune to Thunder Wave, and Grimmsnarl typically finds more utility with Taunt. Grimmsnarl can opt to run Spirit Break over Play Rough, trading some power for a guaranteed Special Attack drop on the opposing Pokemon. Foul Play is another offensive option that can take advantage of Attack-boosting foes like Koraidon and Calyrex-I, but Grimmsnarl is often threatened out by these Pokemon instead.</p> <h4>Checks and Counters</h4> <p><strong>Steel- and Fairy-types</strong>: Grimmsnarl is threatened by a plethora of the metagame's top Pokemon, including Zacian-C, Arceus-Fairy, Kingambit, and Necrozma-DM, all of which can deal significant damage to it or threaten set up in front of it and keep it from setting up screens for its teammates.</p> <p><strong>Taunt</strong>: While it is immune to Taunt from opposing Grimmsnarl, other Pokemon such as the Arceus formes, Miraidon, and Landorus-T often carry it, quickly and easily shutting down Grimmsnarl, especially if it isn't running an attacking move.</p> <p><strong>Phazers</strong>: While Grimmsnarl itself isn't necessarily threatened by phazers, the teammates it supports are, as they are prevented from setting up behind the provided screens.</p> <p><strong>Toxic Spikes</strong>: Toxic Spikes are particularly effective against screens-based hyper offense teams, as they put Pokemon on a timer regardless of the extra defenses and setup opportunities provided by the screens, almost requiring a teammate like Eternatus that can absorb them.</p>",
    "sets": {
      "Dual Screens": {
        "description": "<p>Grimmsnarl's main and only utility is as a dual screens setter on hyper offense teams. It makes use of Taunt to shut down entry hazard setters like Landorus-T and Glimmora, block Defog from Giratina-O, stop opposing Taunt users like various Arceus formes, and prevent Pokemon like Zacian-C, Koraidon, and Miraidon from setting up. Play Rough lets Grimmsnarl threaten Dark-types like Ting-Lu and opposing Grimmsnarl that are immune to Prankster Taunt as well as dealing decent damage to both Koraidon and Miraidon. Parting Shot can be used instead to generate momentum and setup opportunities for Grimmsnarl's teammates. 80 Special Defense EVs allow Grimmsnarl to live two Electro Drifts from Miraidon through Light Screen, with the rest invested to maximize physical bulk. Grimmsnarl should rarely, if ever, be the target of Terastallization, but Tera Ghost can be used to allow it to spinblock Iron Treads and lets it take advantage of the Ghost type's immunities against Choice-locked Koraidon and Extreme Speed from Arceus, while Tera Steel also helps Grimmsnarl avoid being revenge killed by Arceus while flipping its Fairy and Poison weaknesses.</p> <p>Grimmsnarl is exclusively found on hyper offense teams, where it pairs well with setup sweepers that make use of the screens and pivoting it provides, such as Koraidon, Miraidon, and Calyrex-I. In turn, hyper offense teams that rely on Grimmsnarl benefit from the ability of these powerful teammates to remove Steel-types like Necrozma-DM and Zacian-C that Grimmsnarl struggles to set up screens against. Ting-Lu and Ho-Oh can both use Whirlwind to phaze out sweepers, with the former able to set up entry hazards without much issue in front of Grimmsnarl and the latter able to pivot into attacks and stall out screen turns with Regenerator. Koraidon and Miraidon, respectively, can force out these Pokemon and use them as setup opportunities.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Maia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Zacian": {"outdated": true, "sets": {"Choice Band Wallbreaker": {}}},
  "Zacian-Crowned": {
    "overview": "<p>An absurd Speed stat, ability, and typing make Zacian-C one of the premier physical threats in the Ubers metagame. After a single Swords Dance, it threatens OHKOs or 2HKOs on even the tier's premier walls like Ho-Oh, Arceus-Fairy, and Necrozma-DM while its ability Intrepid Sword is active. It outspeeds nearly the entire unboosted metagame, making it a fantastic revenge killer, late-game sweeper, and cleaner. Its Steel / Fairy typing allows it to resist Extreme Speed from Extreme Killer Arceus, pivot into Dragon-type moves from Koraidon, and resist Calm Mind-boosted attacks from Arceus-Fairy and Arceus-Flying. While it is extremely powerful, Zacian-C is reliant on its ability to give it the power needed to break through most threats, limiting its defensive utility until it is ready to wallbreak or sweep. It also struggles to raise its Speed, leaving it extremely vulnerable to being revenge killed by Choice Scarf Pokemon such as Koraidon and Kyogre.</p>",
    "comments": "<h3>Other Options</h3> <p>Thanks to its phenomenal base typing, Zacian-C can pick and choose its Tera type to best cover the needs of the team, allowing it to fill a variety of roles:</p> <p>Tera Steel allows Zacian-C to muscle through its checks like Landorus-T and Necrozma-DM with pure power. This frees up move slots so it can run Substitute or Trailblaze. It also gives Behemoth Blade a high chance to OHKO opposing Zacian-C, Koraidon, and Rayquaza.</p> <p>Tera Dark boosts Crunch's damage output, allowing it to OHKO Lunala through Shadow Shield and 2HKO Necrozma-DM and Skeledirge. It also grants an immunity to Psychic-type attacks, such as Photon Geyser and Psystrike, and allows Zacian-C to resist Ghost-type attacks from Lunala, Giratina-O, and Flutter Mane.</p> <p>Tera Stellar allows Zacian-C to boost all its coverage with one Tera type, allowing it to break through its checks without changing its fantastic defensive profile. With the Intrepid Sword boost, Tera Stellar Behemoth Blade has a high chance of OHKOing an opposing Zacian-C, Koraidon, or Rayquaza. Tera Stellar Wild Charge OHKOes defensive Kyogre. A +1 Behemoth Blade into a Tera Stellar Wild Charge has a high chance of 2HKOing Ho-Oh and guarantees the KO if the Behemoth Blade is also Tera Stellar-boosted. +3 Tera Stellar Close Combat OHKOes offensive Necrozma-DM, though dual STAB moves are typically run with Tera Stellar because they receive a larger boost.</p> <p>Substitute can be run over an attacking move, sacrificing coverage for the ability to dodge status and safely set up. It is particularly efficient against Sticky Web teams that do not run Choice Scarf Ribombee. However, giving up a coverage move greatly hurts Zacian-C's ability to break through walls like Ho-Oh, requiring team support.</p> <h3>Checks and Counters</h3> <p><strong>Landorus-T:</strong> Intimidate allows Landorus-T to negate the Intrepid Sword attack boost. It is immune to Wild Charge, resists Close Combat, and threatens Zacian-C back with a super effective Earthquake, which is guaranteed to KO after a round of Rocky Helmet chip damage.</p> <p><strong>Choice Scarf Pokemon:</strong> Zacian-C cannot boost its Speed, so Choice Scarf Koraidon outspeeds it and threatens an OHKO with Flare Blitz or Tera Fighting Low Kick. Similar to Koraidon, Choice Scarf Kyogre outspeeds and OHKOes with Water Spout, though it cannot safely switch into Zacian-C.</p> <p><strong>Necrozma-DM:</strong> Necrozma-DM resists both of Zacian-C's STAB moves, allowing it to check it. However, offensive sets are OHKOed by +3 Tera Fighting Close Combat, and defensive sets faint to a +3 Behemoth Blade into Close Combat while struggling to KO Zacian-C back. It is commonly paired with priority or another check like Gliscor to help deal with a boosted Zacian-C. Iron Defense + Stored Power sets wall all variants of Zacian-C that do not carry Sacred Sword but struggle to make progress in return.</p> <p><strong>Ho-Oh:</strong> Once Intrepid Sword has been spent, Zacian-C cannot break through Ho-Oh, allowing it to pivot in and check Zacian-C. However, Ho-Oh cannot blindly switch in while the Intrepid Sword boost is active due to the threat of Wild Charge.</p> <p><strong>Dondozo:</strong> Unaware allows Dondozo to comfortably wall every Zacian-C set. However, it is too passive to fit on non-stall teams, and can easily be exploited by Zacian-C's teammates.</p> <p><strong>Skeledirge:</strong> Like Dondozo, Unaware lets Skeledirge ignore Intrepid Sword's attack boost. This allows it to comfortably switch into Zacian-C and prevent it from making any progress against bulkier teams.</p> <p><strong>Gliscor:</strong> Defensive Gliscor can use its bulk to survive any Intrepid Sword-boosted attack and threatens Zacian-C back with Earthquake.</p>",
    "sets": {
      "Ultimutt": {
        "description": "<p>Wild Charge allows Zacian-C to break through Flying- and Water-types that would otherwise resist its attacks, such as Ho-Oh, defensive Kyogre, and Arceus-Water. Close Combat is a strong option to damage Necrozma-DM, as it 2HKOs 2HKOing when boosted by Tera Fighting. It also allows Zacian-C to OHKO Arceus and Kingambit while dealing heavy damage to any Pokemon that uses Tera Fire to resist its STAB moves, notably Tera Fire Koraidon. Crunch can be run as a coverage option to damage Lunala, Skeledirge, and Necrozma-DM. Tera Flying allows Zacian-C to ignore Ground-type attacks from Landorus-T, Arceus-Ground, and Groudon, giving it a free turn to set up. Tera Electric can be used to avoid paralysis from support Arceus and boost Wild Charge damage if Zacian-C is unboosted or has lost the Intrepid Sword boost. On a set with Crunch, it can prevent Imposter Ditto from turning the tables on it. Tera Fire grants resistance to Koraidon's Flare Blitz and opposing Zacian-C's Behemoth Blade, as well as preventing burns from Sacred Fire and Will-O-Wisp.</p> <p>Zacian-C's Fairy typing allows it to prevent opposing Scale Shot Koraidon from boosting its Speed, denying setup for one of the most dangerous sweepers in the metagame. Ribombee is a fantastic partner for Zacian-C, as its Sticky Web provide much-needed speed control, allowing it to outspeed opposing Choice Scarf Koraidon and Kyogre as well as preventing Speed ties in the mirror matchup. Zacian-C's main roadblocks are physical walls like Landorus-T and Necrozma-DM, so it appreciates the support of strong special threats like Kyogre, Lunala, Arceus-Flying, and Arceus-Ghost, which help break them down. Physical sweepers such as Scale Shot Koraidon, Necrozma-DM, Kingambit, and Extreme Killer Arceus benefit greatly from Zacian-C forcing foes to Terastallize and weakening enemy walls. On bulkier teams, sturdy defensive options like Ho-Oh and Arceus-Water can status opposing Pokemon, while Choice Scarf Koraidon provides additional speed control. Entry hazards from Deoxys-S, Landorus-T, Ting-Lu, and Glimmora wear down foes, allowing Zacian-C to revenge kill or sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 668571, "username": "Insolence"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 50695, "username": "Manaphy"}, {"user_id": 374620, "username": "Lana"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Zamazenta-Crowned": {"outdated": true, "sets": {"IronPress": {}}},
  "Eternatus": {
    "sets": {
      "Life Orb": {
        "description": "<p>Eternatus has solidified itself as the premier special attacker in the Ubers tier. Eternatus thrives on its exceptional bulk, great typing, and consistent damage output, allowing it to adapt to many team compositions. A Timid nature mainly helps Eternatus to keep its Speed advantage against most foes except Koraidon and Deoxys-A, while Modest secures critical KOes such as Fire Blast OHKOing Zacian-C and Dynamax Cannon having a 70% chance to 2HKO maximum HP Kyogre. Sludge Bomb not only threatens lethal damage to Arceus-Fairy, but it also pressures passive checks like Ho-Oh and Blissey by threatening poison, which drains their recovery PP and enables Eternatus to win prolonged encounters. Tera Dragon amplifies Dynamax Cannon, enabling feats like 2HKOing physically defensive Ho-Oh and 3HKOing Ting-Lu. It is best suited for wallbreaking, as it offers minimal defensive utility aside from removing its Psychic/ and Ground weaknesses. Tera Fire, on the other hand, grants STAB on Fire Blast and eliminates its Dragon and Psychic weaknesses, which is crucial against Koraidon, Mewtwo, and opposing Eternatus. It also lets Eternatus resist Steel and Fairy-type attacks, easing pressure against Zacian-C and Necrozma-DM.</p> <p>Eternatus's versatility lets it thrive on diverse array of team structures. On hyper offense, it serves as a durable pivot that pressures teams early with Life Orb-boosted attacks and Recover, which stalls out their attacking PP and opens them up to other special attacking teammates. On balance or bulky teams, it acts as a late-game sweeper, supported by entry hazards and status to wear down foes. Its ability to absorb Toxic Spikes is invaluable for teammates like the Arceus formes and Koraidon. Notably, Koraidon's sun support enhances Fire Blast's potency, while Eternatus's resistances to Fire and Water aid Zacian-C and Necrozma-DM in handling Ho-Oh and pivoting into Kyogre, though caution is advised against Kyogre, as it 2HKOes Eternatus with Choice Scarf Water Spout or negates its Speed advantage through Thunder Wave. Special attackers like Arceus with Judgment and Mewtwo appreciate Eternatus overwhelming shared checks such as Blissey, Ho-Oh, and Ting-Lu. Eternatus's combination of raw power, status-spreading utility, and unmatched bulk makes it a nightmare for defensive teams, especially with the low PP of recovery moves and absence of cleric support in the tier. Pressure synergizes seamlessly with Recover, enabling it to stall out the moves of foes over time.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 566610, "username": "LouisIX"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 274590, "username": "SiTuM"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Urshifu": {"outdated": true, "sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Urshifu-Rapid-Strike": {"outdated": true, "sets": {"Choice Band": {}}},
  "Regieleki": {"outdated": true, "sets": {"Dual Screens": {}}},
  "Spectrier": {"outdated": true, "sets": {"Nasty Plot": {}, "Choice Specs": {}}},
  "Calyrex-Ice": {
    "outdated": true,
    "overview": "<p>Calyrex-I is one of the most potent wallbreakers and sweepers in the Ubers tier thanks to its monstrous Attack, powerful STAB move in Glacial Lance, and phenomenal bulk. As an offensive Ice-type, it can threaten the many common Dragon- and Ground-type Pokemon seen in Ubers, such as Koraidon, Miraidon, Eternatus, Ting-Lu, and Arceus-Ground. However, it is hindered by its poor defensive typing and Speed outside of Trick Room, which makes it heavily dependent on Terastallization in some matchups, and the high usage of its checks like Necrozma-DM, Zacian-C, Kyogre, and defensive Arceus formes means most teams will be well-prepared against it. Nevertheless, while in Trick Room, Calyrex-I is a nearly unmatched offensive force that can quickly overwhelm teams if it's left unchecked for even a single turn.</p>",
    "comments": "<h4>Other Options</h4> <p>Close Combat is an option over High Horsepower to OHKO Air Balloon Kingambit and deal more significant damage to Kyogre and Arceus-Water, but it is noticeably weaker against Necrozma-DM and Zacian-C, and the Defense drops make Calyrex-I much easier to KO. A Choice Band set that utilizes Tera Ice can overpower even the bulkiest Ice-resistant Pokemon after only a single Chilling Neigh boost. However, Calyrex-I's weakness to entry hazards and status as well as its inability to set Trick Room for itself while holding a Choice Band necessitates dedicated Trick Room and Healing Wish support from multiple teammates, which is often impractical. Mental Herb can be used to block Taunt from the likes of Miraidon and the Arceus formes when attempting to set up, but Calyrex-I is too infrequently targeted with Taunt to justify its use over other items, which Calyrex-I will almost always get value from.</p> <h4>Checks and Counters</h4> <p><strong>Arceus-Water</strong>: The combination of Arceus-Water's typing, fantastic Defense, and access to moves like Will-O-Wisp and Dragon Tail leaves Calyrex-I with scarce hope of ever breaking past it, even with Terastallization.</p> <p><strong>Necrozma-DM</strong>: With its Steel typing and Prism Armor ability, Necrozma-DM can comfortably tank attacks from Calyrex-I, even after a Swords Dance boost, and threaten heavy damage in return. Necrozma-DM can also use an unboosted Calyrex-I as fodder to set up its own Swords Dance or Dragon Dance boosts. However, with Terastallization, Calyrex-I can set up on Necrozma-DM and potentially beat it, especially if Necrozma-DM is lacking a setup move.</p> <p><strong>Kyogre</strong>: Kyogre has sufficient bulk to avoid being 2HKOed by High Horsepower with only minimal defensive investment, and it can comfortably 2HKO Calyrex-I in the rain. Kyogre's presence also deters Calyrex-I from Terastallizing into a Fire-type to break past its teammates. However, Kyogre's lack of reliable recovery prevents it from repeatedly switching in against Calyrex-I and allows it to be worn down by Calyrex-I's teammates.</p> <p><strong>Ice-resistant Pokemon</strong>: When they're healthy, Ice-resistant Pokemon such as Zacian-C, Kingambit, and Chien-Pao can avoid being OHKOed by Calyrex-I and deal significant damage in return, usually defeating Calyrex-I outside of Trick Room. However, they are susceptible to falling to Calyrex-I when Trick Room is in effect or if Calyrex-I has enough boosts. Additionally, many Pokemon run Ice-resistant Tera types, such as Tera Steel on Giratina-O and Arceus-Ground and Tera Water on Arceus-Fairy and Gliscor.</p> <p><strong>Air Balloon Kingambit</strong>: An Air Balloon replaces Kingambit's Ground weakness with an immunity, which denies Calyrex-I the opportunity to OHKO Kingambit with High Horsepower after a Swords Dance. This allows it to beat Calyrex-I even in Trick Room unlike other Kingambit sets that can be removed by a boosted High Horsepower.</p> <p><strong>Unaware Walls</strong>: Unaware walls impede Calyrex-I's offensive output considerably, though they are typically found only on stall teams. Skeledirge can threaten to burn it with Will-O-Wisp and heal any damage taken with Slack Off—however, it does take considerable damage from High Horsepower—while Dondozo's typing and gargantuan physical bulk allow it to slowly wear down Calyrex-I without fear of being KOed.</p>",
    "sets": {
      "Offensive Trick Room": {
        "description": "<p>Heavy-Duty Boots is typically the best item for Calyrex-I, since it helps Calyrex-I leverage its good natural bulk and more easily find setup opportunities by negating its crippling weakness to entry hazards. However, on teams that can keep hazards off the field, Calyrex-I can occasionally make use of other items. An Occa Berry allows Calyrex-I to avoid being OHKOed by Koraidon's Flare Blitz or comfortably tank a rare Fire-type move from Miraidon or Eternatus, affording Calyrex-I additional setup opportunities or a surprise KO without the need to Terastallize. Weakness Policy makes use of Calyrex-I's ability to withstand most super effective attacks, especially on teams with screens support, and provides it with sufficient boosts to tear through opposing teams. For example, Calyrex-I has favorable odds to OHKO even the bulkiest Necrozma-DM with High Horsepower after a Swords Dance and Weakness Policy boost. Tera Fire is an invaluable defensive option for Calyrex-I to flip its weaknesses to Steel- and Fire-type moves into resistances—crucially helping it against Necrozma-DM, Zacian-C, and Koraidon—while also avoiding being burned by moves such as Will-O-Wisp and Ho-Oh's Sacred Fire. Tera Ground can be used instead to boost the power of High Horsepower, notably OHKOing Zacian-C without need for a boost and Necrozma-DM and most Kyogre after a Swords Dance, and remove all of Calyrex-I's weaknesses, but it leaves Calyrex-I still vulnerable to being burned. A Brave nature with 0 Speed IVs is preferred to move first in Trick Room against nearly all foes and, at worst, Speed tie with Kingambit and opposing Calyrex-I, but an Adamant nature with at least 22 Speed IVs can be used to be faster than Ting-Lu outside of Trick Room if Kingambit and opposing Calyrex-I are not a concern.</p> <p>Calyrex-I is a cornerstone of many offense teams in Ubers thanks to its ability to punch holes in defensive cores and alleviate the danger of fast hyper offense teams, especially those with Sticky Web support, courtesy of Trick Room. Zacian-C and Necrozma-DM make good teammates, as they share many of the same checks with Calyrex-I, for example Arceus-Water and opposing Necrozma-DM; together, they can pressure their shared checks enough for each other to sweep. Necrozma-DM is also a competent user of Trick Room, and it can potentially take Calyrex-I's place—or vice versa—should it fall while Trick Room is in effect. Other physical sweepers like Koraidon, Arceus-Ground, and Extreme Killer Arceus appreciate Calyrex-I's ability to overwhelm common defensive walls, such as Arceus-Fairy and Ho-Oh, with boosted Glacial Lances. Miraidon is a good partner for Calyrex-I, since it threatens to OHKO the Water-types that Calyrex-I dislikes facing, and it can use U-turn to bring Calyrex-I in on Ground-types like Ting-Lu, Arceus-Ground, and Clodsire that it can use as setup fodder. Screens support from Grimmsnarl makes Calyrex-I practically impossible to OHKO and difficult to even 2HKO, enabling it to boost an extra time with Swords Dance or take on a foe it might not usually be able to beat. Calyrex-I benefits greatly from the support of Spikes setters, such as Deoxys-S, Glimmora, Gliscor, and Ting-Lu, to help break through its most potent counter, Arceus-Water, and punish the frequent switches Calyrex-I forces.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 547277, "username": "LillianOfficial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ursaluna-Bloodmoon": {"outdated": true, "sets": {"Bear": {}}},
  "Skeledirge": {
    "outdated": true,
    "overview": "<p>Skeledirge in Ubers is a unique check to one of the most threatening Pokemon in the tier, Koraidon, thanks to its access to Unaware. Koraidon must be careful against Skeledirge, as it can burn Koraidon or potentially OHKO it with Alluring Voice, all while Skeledirge has the option to Tera Fairy to avoid Scale Shot. While Skeledirge is at risk of being 2HKOed by Koraidon's Scale Shot, this is reliant on Koraidon getting 9 total hits of Scale Shot over two turns with sun up. Due to these factors, while Skeledirge cannot always handle Koraidon reliably by itself, Skeledirge's mere presence on the team forces opposing Koraidon to play very carefully, often preventing Koraidon's setup opportunities entirely. Outside of Koraidon, Skeledirge is excellent against most physical threats in the tier; notably, it can counter Zacian-C and take on Extreme Killer Arceus and Calyrex-I quite well. Torch Song provides Skeledirge with a way to not be too passive, and it can let it sweep in certain late-game scenarios. This, however, does not prevent Skeledirge from easily being taken advantage of by special threats such as Miraidon and Kyogre.</p>",
    "comments": "<h4>Other Options</h4> <p>Other Tera types such as Tera Flying are possible, but typically, Tera Fairy is too useful against Koraidon to give up. Alluring Voice may seem tempting to use, but it fails to OHKO Koraidon and is generally outclassed by other options.</p> <h4>Checks and Counters</h4> <p><strong>Special Attackers</strong>: Miraidon, Kyogre, Eternatus, and other special attackers don't take too much damage from switching in on Skeledirge and can easily force it out with their strong attacks. Kyogre in particular doesn't mind any coverage move and can take great advantage of Skeledirge.</p> <p><strong>Ho-Oh</strong>: Ho-Oh is immune to burns and can wall Skeledirge with its titanic special bulk.</p> <p><strong>Taunt</strong>: Taunt prevents Skeledirge from healing or using Will-O-Wisp, though predicted Taunts can be taken advantage of by Torch Song.</p> <p><strong>Tera Fire</strong>: Tera Fire prevents burns and provides a resistance to Torch Song, though Tera Fire users must be wary of Earth Power or Alluring Voice's confusion.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Hex is a strong attacking option that takes advantage of Will-O-Wisp and does great damage against Gliscor, 2HKOing at +1. Earth Power nails Miraidon on the switch, and it gives Skeledirge a good way to damage Tera Fire users like Koraidon, Arceus, and Calyrex-I. Will-O-Wisp's burns can do useful chip damage against nearly anything that switches in, and it cripples any physical attacker hit by it. Tera Fairy is mandatory for Skeledirge to take on Koraidon should Skeledirge be too low on HP. Care should be taken when facing Koraidon, as ideally, Tera Fairy should only be used as a last resort. If Skeledirge only takes four hits of Scale Shot upon switching in, it can repeatedly use Slack Off in order to stall out sun turns, or to hope for a Scale Shot miss. In general, being aware of when sun fades is very useful, as Koraidon cannot hope to break Skeledirge without it.</p> <p>Skeledirge needs teammates that can handle the special attackers that it is weak to. Checks to Miraidon like Ting-Lu and Arceus-Ground are great options, while Eternatus, Koraidon, Miraidon, and Clodsire help against Kyogre. Necrozma-DM and Arceus-Ground are some of few physical attackers that can get past Skeledirge, so checks to them like Arceus-Water, Arceus-Dark, Kyogre, and Bulldoze Gliscor are valuable partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Espathra": {
    "outdated": true,
    "sets": {
      "Calm Mind": {
        "description": "<ul> <li>Espathra's niche is sweeping with its unique combination of Calm Mind, Speed Boost, and STAB Stored Power.</li> <li>Dazzling Gleam super effectively hits Dark-types, which are immune to Stored Power, like Chien-Pao, Ting-Lu, and Grimmsnarl.</li> <li>Substitute protects Espathra from potential status conditions that might stop its sweep, like from Clodsire's Toxic.</li> <li>Protect, instead, allows Espathra to scout Choice-locked foes, such as Choice Specs Miraidon. In addition, Protect lets Espathra freely boost its Speed and get Leftovers recovery.</li> <li>Roost keeps Espathra healthy and makes it less susceptible to priority attacks, like Chien-Pao and Kingambit's Sucker Punch. Roost also allows Espathra to beat Ting-Lu not packing Whirlwind one-on-one.</li> <li>Tera Fairy turns Espathra's Dark weakness into a resistance, letting it survive the aforementioned Sucker Punch, as well as bolstering its Dazzling Gleam.</li> <li>Tera Fighting also turns Espathra's Dark weakness into a resistance. Paired with Tera Blast, it beats the aforementioned Dark-types, Kingambit and Chien-Pao, and Steel-types like Iron Treads.</li> <li>112 EVs in Speed allow Espathra to outspeed the entire unboosted metagame at +1, including Iron Bundle. At +2, it can even outspeed +1 Iron Valiant.</li> <li>The rest of its EVs are poured into physical bulk for survivability, since Calm Mind will boost Special Defense anyway. Electric Seed further improves Espathra's physical bulk while also giving it another boost to Stored Power. Leftovers gives Espathra long-term recovery, and it can be optimized with Calm Mind and the choice of Substitute, Protect, or Roost.</li> <li>Espathra functions best on offensive teams to sweep after its checks have been weakened. Espathra is very frail and it usually can't switch in safely more than once, so it must fully commit to a sweep once it hits the field.</li> <li>Fighting-types like Koraidon and Great Tusk make for good partners, as they threaten Dark- and Steel-types that resist or are immune to Espathra's Stored Power.</li> <li>Strong Dark-types like Chien-Pao and Chi-Yu resist Dark- and Ghost-type attacks, which target Espathra, while also threatening Ghost- and Psychic-types. The former threaten Espathra, and the latter resist Stored Power.</li> <li>Miraidon is a necessary partner if Espathra is holding Electric Seed, as Electric Terrain activates the item.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 415367, "username": "Eledyr"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Palafin": {
    "outdated": true,
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Wave Crash is a very strong STAB move. With Stealth Rock support and Tera Water's power boost, it crushes walls Palafin normally might struggle to break, like Toxapex and Corviknight, and always OHKOes Miraidon.</li> <li>Close Combat is a strong, reliable coverage move that hits many of Palafin's checks like Corviknight and Koraidon for solid damage, while also hitting Water-types barring Toxapex for neutral damage.</li> <li>Ice Punch allows Palafin to hit Dragon-types like the very common Koraidon and Miraidon while also hitting Water Absorb Clodsire. However, it cannot OHKO Koraidon and is not guaranteed to OHKO Miraidon.</li> <li>Zen Headbutt allows Palafin to hit Toxapex super effectively, as well as potentially OHKOing Koraidon and having fantastic odds to 2HKO Miraidon.</li> <li>Tera Water powers up Palafin's Water-type moves and allows Palafin to achieve feats like 2HKOing Miraidon with Jet Punch from full HP if rain is up.</li> <li>Choice Band Palafin functions best on offensive teams to revenge kill threats like Flutter Mane or to break walls for its teammates mid-game. Remember, base Palafin needs to be used very early in a game to transform into its Hero Form.</li> <li>Pelipper is a great partner for Palafin, as it checks Koraidon decently and replaces its sun with rain, strengthening Palafin's powerful Water-type attacks.</li> <li>Koraidon sets up sun and resists Water-type attacks Palafin throws at it, so Palafin appreciates teammates that threaten Koraidon, like Iron Bundle and Flutter Mane. Also, Palafin is weakened by the sun Koraidon sets up, so it is best not to pair Palafin and Koraidon together.</li> <li>Miraidon is a good partner, as it destroys Alomomola, a great counter to Palafin, and can safely bring Palafin onto the field with either U-turn or Volt Switch. Miraidon also appreciates Palafin threatening Ground-type Pokemon that can take Miraidon's Electric-type attacks, like Ting-Lu, Iron Treads, and Clodsire.</li> </ul>"
      },
      "Bulk Up": {
        "description": "<ul> <li>Jet Punch's strong priority allows this Palafin set to still be threatening to offensive builds, while Drain Punch keeps Palafin healthy against bulkier teams.</li> <li>Taunt allows Palafin to prevent common responses to setup sweepers from working, such as Whirlwind from Ting-Lu and Haze from Toxapex, while also preventing Pokemon like Annihilape from setting up alongside it.</li> <li>Fairy is the Tera type of choice to allow Palafin to resist both of Koraidon's STAB attacks and potentially set up on Choice Scarf variants of it. Fairy also removes Palafin's weakness to Iron Bundle's Freeze-Dry and Miraidon's Electric moves.</li> <li>Palafin struggles to deal with Koraidon or Miraidon, which can come in on this set easily, especially given that Zero to Hero forces Palafin to switch at least once before it can be offensively threatening. As a result, this Palafin needs teammates that can defensively handle these threats. Ting-Lu and Iron Treads both help with Miraidon, and Pokemon like Great Tusk, Scream Tail, and Skeledirge can provide defensive solidity against Koraidon.</li> <li>This Palafin set functions best with a sturdy defensive backbone alongside it, to mitigate the impact of Zero to Hero. As a result, it does not work as well on more hyper offensive playstyles.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}, {"user_id": 249382, "username": "Aberforth"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 537354, "username": "Mashing"}, {"user_id": 306317, "username": "katerina"}, {"user_id": 415367, "username": "Eledyr"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Orthworm": {
    "outdated": true,
    "sets": {
      "Shed Tail": {
        "description": "<ul> <li>Orthworm faciliates setup sweepers on hyper offense teams thanks to its Ground immunity and access to Shed Tail. Unlike Cyclizar, Orthworm is able to pass slow Shed Tails due to its low Speed.</li> <li>Orthworm has access to both Stealth Rock and Spikes, helping it wear down walls for its setup sweeper teammates. Stealth Rock is usually preferred for limiting Chien-Pao, Chi-Yu, and Iron Bundle, but Spikes can be used if your team already has a Stealth Rock setter. Body Press punishes Kingambit and Chien-Pao trying to wear down and set up on Orthworm. Iron Head is a STAB move that lets Orthworm hit Flutter Mane trying to Taunt it.</li> <li>Tera Water allows Orthworm to safely set up Shed Tail on Koraidon. Tera Ghost lets Orthworm completely blank Fighting-type attacks from Koraidon and Great Tusk while preventing Rapid Spin users from removing entry hazards set by both Orthworm and its teammates. However, Terastallizing Orthworm instead of one of its teammates is often not worth it.</li> <li>Sitrus Berry provides Orthworm with the flexibility to take an attack and use Shed Tail, but Mental Herb is an option to block Taunt.</li> <li>Grimmsnarl is a fantastic partner, as it provides screens support that improves Orthworm's longevity and further eases setup for teammates behind Shed Tail.</li> <li>Entry hazard setters such as Glimmora and Froslass can wear down opponents in conjunction with Orthworm's hazards and Shed Tail, making it easier for teammates to break through walls.</li> <li>Setup sweepers such as Koraidon, Miraidon, Kingambit, Iron Moth, and Espathra appreciate Orthworm's Shed Tail preventing status while giving them some leeway to boost. Koraidon in particular also appreciates Orthworm walling Great Tusk without Fighting-type moves and deterring Great Tusk from using Ground-type moves. Swords Dance Chien-Pao and Calm Mind Flutter Mane similarly appreciate Orthworm's Shed Tail easing setup by compensating for their lower bulk.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595062, "username": "Taka"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 415367, "username": "Eledyr"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Glimmora": {
    "outdated": true,
    "overview": "<p>Glimmora is one of the best suicide leads in the Ubers metagame due to its ability to set multiple sets of entry hazards quickly while preventing opposing leads from setting their own. Its movepool allows it to match up well against other standard Ubers leads. Its decent Special Attack and Speed allow it to move before uninvested Pokemon, safely set hazards, and put down chip damage before fainting without being used as setup fodder. Many Ubers Pokemon, such as the various Arceus formes, cannot run Heavy-Duty Boots, leaving them vulnerable to entry hazards, especially Toxic Spikes. Due to the limited distribution of viable hazard control in the tier, it can be difficult for offensive teams to deal with Glimmora, forcing them to avoid hitting it with a physical attack to prevent Toxic Debris from activating.</p>",
    "comments": "<h4>Other Options</h4> <p>An alternative spread of 76 Def / 180 SpA / 252 Spe with a Timid nature improves the lead matchup against Koraidon. An 84 EV Special Attack Dazzling Gleam has an unfavorable roll to OHKO Koraidon, so increasing Special Attack greatly improves the odds. However, this comes at the cost of giving five-hit Scale Shot from Jolly Koraidon having a chance to KO Glimmora, and Glimmora always faints to a five- hit Scale Shot from Adamant Koraidon.</p> <p>Earth Power can be run over Mud Shot for its increased base power on offensive EV spreads. This additional damage can result in certain moves being an OHKO instead of a 2HKO with Mud Shot, most notably non-Dragon Dance Necrozma-DM, as well as 2HKOing Zacian-C. In the vast majority of situations, the speed control provided by Mud Shot is preferred.</p> <h4>Checks and Counters</h4> <p><strong>Heavy-Duty Boots</strong>: Pokemon with Heavy-Duty Boots ignore the hazards Glimmora sets.</p> <p><strong>Steel-types</strong>: Steel-types like Necrozma-DM, Zacian-C, Kingambit, Orthworm, and Corviknight ignore the Toxic Spikes placed by Glimmora's ability and block it from using Mortal Spin to clear hazards.</p> <p><strong>Necrozma-DM</strong>: Necrozma-DM blocks Mortal Spin and can use Glimmora to set up. Defensive sets can set up Stealth Rock before healing off damage with Morning Sun and threaten Knock Off on Glimmora's teammates. Glimmora can use Mud Shot to prevent Dragon Dance sets from setting up, but the super effective hit and Speed reduction are both beneficial for Trick Room sets. It can also use Covert Cloak to ignore the Speed drops from Mud Shot and freely set up on Glimmora.</p> <p><strong>Entry Hazard Removal</strong>: Giratina-O can use Defog to remove hazards and can use Tera Steel to prevent Glimmora using Mortal Spin to poison it or remove hazards. Corviknight is immune to Glimmora's Ground-type attacks and resists its common attacking options, allowing it to freely set up Iron Defense or use Defog. Iron Treads can use Rapid Spin to break Focus Sash and negate the Speed drop from Mud Shot while simultaneously removing hazards.</p> <p><strong>Opposing Poison-types</strong>: Once Glimmora has fainted, opposing Poison-types like Eternatus and Clodsire can switch in and remove the Toxic Spikes laid by Toxic Debris. The same is true in the other direction, as Glimmora can enter the field to clear hazards laid by opposing Toxic Spikes setters.</p>",
    "sets": {
      "Suicide Lead": {
        "description": "<p>Mortal Spin is used to remove opposing entry hazards such as Ribombee's Sticky Web and cripple opposing bulky Pokemon such as Kyogre and various Arceus formes. Mud Shot provides extremely valuable disruption, allowing Glimmora to outspeed opposing leads such as Deoxys-A, Miraidon, and Zacian-C after a Speed drop and get up hazards. Mud Shot also prevents Dragon Dance Necrozma-DM from using Glimmora as setup fodder. 172 Defense EVs allow Glimmora to always live a five-hit Scale Shot from Jolly Koraidon and retaliate with a super effective Dazzling Gleam. Memento can be used instead to let Glimmora sacrifice itself to give its team valuable offensive momentum. Tera Ghost prevents Glimmora's entry hazards from being removed by Rapid Spin but is almost never used due to its status as a suicide lead.</p> <p>Glimmora is limited in usage to hyper offense teams, where its ability to set hazards and provide diruption is unmatched. It is generally paired with powerful wallbreakers such as Choice Scarf Koraidon, Zacian-C, and Miraidon, as well as setup sweepers such as Necrozma-DM, Kyurem-B, Scale Shot Koraidon, Kingambit, Miraidon, and Extreme Killer Arceus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 668571, "username": "Insolence"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 249382, "username": "Aberforth"}, {"user_id": 306317, "username": "katerina"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Dondozo": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Dondozo is a solid physical wall due to its incredible physical bulk and Unaware. Dondozo fits well on bulky teams where it can switch into physical attackers such as Koraidon, Great Tusk, and Chien-Pao.</li> <li>Liquidation hits Ground- and Fire-types such as Great Tusk, Iron Treads, and Skeledirge. Earthquake lets Dondozo lure in and deal huge damage to Miraidon.</li> <li>Curse makes Dondozo less passive and gives it sweeping potential. Protect lets Dondozo scout for Choice item users such as Koraidon, Miraidon, and Iron Bundle while also recovering health.</li> <li>Rest is the only recovery option for Dondozo and can be used with Sleep Talk to deal with physical attackers such as Koraidon and Chien-Pao better. However, Miraidon's extensive presence in the metagame makes Rest unreliable.</li> <li>Tera Steel lets Dondozo resist Moonblast from Flutter Mane and Freeze-Dry from Iron Bundle. Alternatively, Tera Fairy allows Dondozo to resist Fighting- and Dark-type moves from Koraidon and Chien-Pao while it also gains an immunity to Dragon-type moves.</li> <li>Tera Ground gives Dondozo an immunity to Electric-type moves and can allow it to catch Miraidon by surprise and KO it using a boosted Earthquake.</li> <li>Entry hazard removal options such as Corviknight, Iron Treads, and Great Tusk are great teammates, as foes can take advantage of Dondozo being worn down due to hazards. Dugtrio is a good teammate, as it can trap and KO Miraidon, making Dondozo incredibly tough to stop.</li> <li>Dondozo appreciates special walls such as Ting-Lu, Corviknight, and Blissey that can switch into threats such as Miraidon and Flutter Mane. In return, Dondozo checks their threats in Koraidon, Chien-Pao and Great Tusk.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 532881, "username": "Frozoid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 50695, "username": "Manaphy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Annihilape": {
    "outdated": true,
    "sets": {
      "Bulk Up": {
        "description": "<ul> <li>Annihilape is a solid setup sweeper due to its good Attack stat, decent bulk, and unresisted STAB combination. It can take advantage of Pokemon such as Corviknight, Blissey, and Clodsire.</li> <li>Bulk Up gives Annihilape the potential to sweep while also making it progressively harder to KO.</li> <li>Taunt allows Annihilape to stay healthy and also stops bulkier Pokemon such as Corviknight, Clodsire, and Toxapex from recovering their health. Rest can alternatively be used with Chesto Berry to get rid of status and recover health, but it fails when Electric Terrain is up.</li> <li>Drain Punch allows Annihilape to recover health and damage foes such as Ting-Lu and Iron Treads.</li> <li>Rage Fist, along with Taunt, makes Annihilape incredibly threatening for slow walls such as Dondozo and Ting-Lu, as their attacks do little damage to Annilhilape while also boosting Rage Fist's power.</li> <li>Tera Water allows Annihilape to take hits from special attackers such as Iron Bundle, Chi-Yu, and Flutter Mane while also letting it resist Flare Blitz from Koraidon.</li> <li>Tera Fairy gives Annihilape an immunity against Dragon-type moves from Koraidon and Miraidon while also letting Annihilape take neutral damage from Ghost-type moves from Gholdengo and Flutter Mane, OHKOing them in return with boosted Rage Fist.</li> <li>Annihilape reaches its full potential on dual screens hyper offense teams, where it can easily take hits while setting up.</li> <li>Special walls such as Ting-Lu and Corviknight are good teammates on balance teams, as Pokemon such as Miraidon, Flutter Mane, and Iron Bundle threaten Annihilape. Corviknight is also able to remove entry hazards for Annihilape. Kingambit as a teammate overwhelms Alomomola and Skeledirge, which are common checks to it and Annihilape.</li> <li>Entry hazard setters such as Glimmora, Froslass, Toxapex, and Clodsire can lure in Corviknight, presenting Annhilape with a great setup opportunity by forcing Corviknight to either use Defog and activate Annihilape's Defiant or give Rage Fist a boost by attacking.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 532881, "username": "Frozoid"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 415367, "username": "Eledyr"}, {"user_id": 306317, "username": "katerina"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Clodsire": {
    "outdated": true,
    "overview": "<p>Clodsire, despite its low base stat total, has a niche in Ubers thanks to the large amount of role compression it offers. Along with Ting-Lu and Arceus-Ground, Clodsire is one of the main checks to Miraidon. Compared to them, Clodsire sports both reliable recovery and the ability to run an item. Thanks to Water Absorb, Clodsire is also a decent check to Kyogre, and due to its Poison typing, it can absorb and set Toxic Spikes. However, Clodsire certainly suffers from being a \"jack of a trades, master of none\"; its low bulk compared to other Miraidon checks leaves it having to use Recover more often than not, which can make it a large momentum drain. This low bulk leaves Clodsire reliant on Terastallization to check certain setup Miraidon and Kyogre sets. It also has a pathetic offensive presence, relying on Toxic alone to dissuade switch-ins. It's critical to use Clodsire for its great role compression to free up the rest of its teammates to gain more momentum.</p>",
    "comments": "<h4>Other Options</h4> <p>Poison Jab is an alternative to Toxic that can still inflict poison while being usable under Taunt. Mental Herb allows Clodsire to avoid Taunt, which is often used against it from Miraidon. Ideally, this will let Clodsire set up entry hazards early-game, but it comes at the risk of Clodsire being easily worn down by Spikes damage. Counter is a niche option that may catch physical attackers off guard. Unaware might seem tempting to use against boosting Miraidon, but it also means Draco Meteor remains full power against Clodsire. It also loses Clodsire's valuable matchup against Kyogre.</p> <h4>Checks and Counters</h4> <p><strong>Poison-immune Pokemon</strong>: Clodsire's main way to threaten switch-ins is through Toxic, so Pokemon immune to Toxic can easily take advantage of it. Necrozma-DM and Gliscor are the most prominent examples, but other Pokemon such as Corviknight and Skarmory exist as well. Giratina-O may use Tera Steel on Clodsire to Defog on it with impunity.</p> <p><strong>Taunt</strong>: Without a Mental Herb, Clodsire is nearly completely shut down by Taunt. Commonly, Miraidon may use Taunt against Clodsire after it switches-in on Draco Meteor to prevent Recover, though this does put Miraidon at risk of being hit by Earthquake. Other Taunt users such as Arceus-Fairy have little to fear from Clodsire.</p> <p><strong>Heavy-Duty Boots</strong>: Outside of Toxic, Clodsire is heavily reliant on setting entry hazards to do damage long-term, so teams with many Heavy-Duty Boots users are problematic for it.</p> <p><strong>Physical Attackers</strong>: While Clodsire's physical bulk is not terrible, it is unable to take on the vast majority of the strong physical attackers in Ubers.</p> <p><strong>Freeze</strong>: Boosted Kyogre sets can break past Clodsire outright, but they cannot break a Terastalized Clodsire. Still, Kyogre may attempt to get past Clodsire by repeatedly using Ice Beam against it and hoping to freeze it.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Clodsire uses its decent special bulk to pivot in on Miraidon, Kyogre, or Eternatus and set up entry hazards. Toxic is Clodsire's best option to do any significant damage to switch-ins like Ho-Oh and Ting-Lu, and it allows Clodsire to check Kyogre more reliably. Spikes is Clodsire's most exclusive entry hazard option, but Stealth Rock and Toxic Spikes are also valid choices, especially if it is paired with another entry hazard setter like Gliscor. Heavy-Duty Boots lets Clodsire avoid Spikes damage entirely. Leftovers is an option, as it provides Clodsire more longevity against teams whose only entry hazard options are Stealth Rocks or Toxic Spikes. Tera Steel and Fairy let Clodsire take on Miraidon's Dragon-type moves in a pinch while also making Kyogre's Ice Beam do pitiful damage to it. While Tera Fairy's immunity to Dragon can allow Clodsire to take more advantage of Miraidon on the turn it Terastallizes, Steel keeps Clodsire's Poison immunity and gives it a useful Ice resistance.</p> <p>While Clodsire provides strong role compression, it works much better when given teammates that can help take the edge of off its worse matchups. A Fairy-type like Arceus-Fairy, Zacian-C, or Flutter Mane is highly recommended, as this allows for pivoting opportunities against Miraidon, forcing it to predict between its Dragon- and Electric-type moves. Furthermore, additonal Ground-types such as Arceus-Ground, Gliscor, and Iron Treads are much appreciated for their help against Miraidon. Switch-ins to Necrozma-DM and Gliscor are highly recommended, as both are immune to Toxic and don't care about Earthquake. Arceus-Water, Ho-Oh, and Arceus-Dark are good options against Necrozma-DM, while your own Necrozma-DM or Gliscor can help against opposing Gliscor. Corviknight notably is good against both. All of the aforementioned teammates greatly enjoy Clodsire's ability to pivot into Kyogre.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Kingambit": {
    "outdated": true,
    "overview": "<p>Kingambit is one of the most dangerous late-game sweepers in the tier thanks to its unique ability Supreme Overlord. A great Attack stat coupled with Swords Dance and STAB Sucker Punch allow it to plow through weakened teams if given just a little leeway, accentuated by its solid natural bulk and ability to set up on prominent Pokemon like Necrozma-DM, assisted further by its item and Tera type. Unfortunately, the plethora of Dark-resistant Pokemon, notably Koraidon, Zacian-C, and Will-O-Wisp Arceus-Fairy, as well as Tera Fairy users like Miraidon and Kyogre hold Kingambit back. It can also be difficult to set up with Kingambit without expending Terastallization or Kingambit's HP, only exacerbated by its lack of recovery. Thus, it can sometimes be forced to stay in the back for much of the game. Kingambit is also relatively weak without any boosts and is thus quite reliant on its teammates being KOed to be of much use. Nevertheless, Kingambit is not a threat to be taken lightly when seeing it at Team Preview, lest it run through many minimally chipped teams.</p>",
    "comments": "<h4>Other Options</h4> <p>Tera Ghost provides Kingambit an immunity to Fighting and Extreme Speed. However, it is outclassed by Tera Flying, as the Ground immunity it provides far outweighs Tera Ghost’s Extreme Speed immunity. Heavy-Duty Boots ensures Kingambit can remain healthy throughout a game despite entry hazards, but Air Balloon also helps with entry hazards while giving Kingambit a Ground immunity, helping it find opportunities to set up. 252 Speed EVs can be used to outspeed defensive Ho-Oh, but the loss of bulk is very noticeable and generally not worth it.</p> <h4>Checks and Counters</h4> <p><strong>Dark-resistant Pokemon and Tera types</strong>: Several Pokemon in Ubers resist Dark or can viably Terastallize into a Dark-resistant Tera type, including Koraidon, Zacian-C, Ting-Lu, Arceus-Fairy, Miraidon, and Arceus-Ground.</p> <p><strong>Bulky Arceus formes</strong>: Arceus-Fairy, Arceus-Ground, and Arceus-Water can threaten Will-O-Wisp on Kingambit. While they must tread carefully around Tera Fire or Lum Berry, they have the bulk to survive +2 Sucker Punch even with five Supreme Overlord boosts, and Arceus-Ground and Arceus-Water can threaten super effective Judgments if Kingambit Terastallizes into a Fire-type.</p> <p><strong>Ho-Oh</strong>: Despite being susceptible to Tera Fire or Lum Berry, Ho-Oh outspeeds Kingambit, can take even boosted Sucker Punches, and threatens Kingambit with Sacred Fire or Whirlwind.</p> <p><strong>Landorus-T</strong>: Landorus-T's good physical bulk bolstered with Intimidate allows it to switch into Kingambit, and it can stop Kingambit from setting up with Taunt and rack up chip damage with Rocky Helmet. However, it does not have reliable recovery, so it must be wary of getting worn down.</p> <p><strong>Corviknight</strong>: Although Corviknight is rare, Corviknight can take boosted Kowtow Cleaves from Kingambit even with five Supreme Overlord boosts and retaliate with the combination of Iron Defense and Body Press.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Despite only having one set, Kingambit's choice of item and Tera type are quite malleable depending on its team. Black Glasses strengthens Kingambit's Dark-type STAB moves and is especially notable in conjunction with Tera Dark, allowing it to OHKO even Tera Fire Calyrex-I at +2 with three Supreme Overlord boosts. Air Balloon's one-time Ground immunity helps Kingambit check and find setup opportunities against Pokemon like Necrozma-DM and Arceus-Ground. Lum Berry allows Kingambit to shrug off a Sacred Fire burn from Ho-Oh, freeing it from the need to run Tera Fire. Tera Dark boosts the power of Kingambit's Dark-type STAB moves more than Black Glasses without taking up the item slot, allowing Kingambit to run a different item and OHKO Ho-Oh from full HP with +2 Sucker Punch after five Supreme Overlord boosts. Tera Fire allows Kingambit to set up on Ho-Oh and Koraidon by giving it a Fire resistance and immunity to burn. It is most common with Air Balloon, as it cancels Fire's weakness to Ground. Tera Flying gives Kingambit a permanent Ground immunity, allowing it to easily set up on Pokemon like Arceus-Ground, Ting-Lu, and Landorus-T that would normally cause it trouble. Maximum HP EVs allow Kingambit to survive many strong hits, including having a 75% chance to survive Miraidon's Electro Drift after Stealth Rock.</p> <p>Kingambit fits on hyper offense teams as a late-game sweeper and revenge killer for threats like Necrozma-DM, Calyrex-I, and even Scale Shot Koraidon with its Defense dropped. Necrozma-DM itself is a great partner, as it can lure in and weaken Ho-Oh by running Knock Off or Stone Edge or overwhelm it with the power of +2 Photon Geyser outright. Kingambit complements Extreme Killer Arceus quite well; not only are they both individually threatening, but combined, they are able to revenge kill Scale Shot Koraidon after a Defense drop no matter Koraidon's Tera type. Bulk Up Arceus is similarly good for Kingambit, as it can deal with Ho-Oh with Tera Fire and Taunt, clearing a path for Kingambit if it doesn’t win outright. Bulk Up Arceus can also overwhelm Kyogre for Kingambit or vice versa. Entry hazards from Glimmora or Ting-Lu also help Kingambit blow through even Dark-resistant foes with greater ease. Gliscor is also a good teammate, as it can easily annoy common physical walls like Ho-Oh and Arceus-Ground.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 306317, "username": "katerina"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Great Tusk": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<ul> <li>Tera Ground can turn Headlong Rush into a devastating STAB attack that can break through bulky targets Great Tusk normally wouldn’t, such as Scream Tail and Dondozo.</li> <li>Tera Fighting lets Great Tusk crush Corviknight with Close Combat, which severely hurts defensive structures reliant on it. This opens up powerful teammates like Flutter Mane and Iron Bundle.</li> <li>Earthquake makes Great Tusk harder to revenge kill than Headlong Rush does, as it doesn’t drop its defenses.</li> <li>Rapid Spin works well for teams weak to entry hazards. It's a great way to support powerful threats weak to Stealth Rock, like Chien-Pao, Chi-Yu, and Iron Bundle.</li> <li>Knock Off provides fantastic item-removing support, and it especially cripples walls reliant on Leftovers like Scream Tail and Dondozo, allowing its team to more easily break past them.</li> <li>Play Rough can be used to OHKO Koraidon without Terastallizing, as well as beating opposing Great Tusk. However, it has very little practical use outside of this.</li> <li>Choice Scarf Great Tusk functions most effectively as a wallbreaker in the early- and mid-game, suited best for offensive structures that struggle with physical walls like the aforementioned Scream Tail and Dondozo. When building teams, remember Great Tusk must use Terastallization to actually break through said walls, so it may be hard for teammates to Terastallize.</li> <li>Choice Band Great Tusk only functions well on Sticky Web teams, where the stronger and slower set appreciates Sticky Web dropping foes' Speed.</li> <li>Koraidon is a great partner, setting up sun and activating Protosynthesis for Great Tusk. It further resists Water- and Grass-type moves aimed at Great Tusk, weakening the former. Koraidon also effectively baits in Skeledirge, which Great Tusk reliably threatens.</li> <li>Miraidon is also a great partner, as it can threaten Flying-types, like Corviknight and the rarer Pelipper and Dragonite. This helps to make Great Tusk’s Headlong Rush much more spammable.</li> <li>Gholdengo is also a good partner for Great Tusk, as it resists Ice-, Fairy-, and Grass-type moves aimed at Great Tusk, and it can threaten to KO Ice- and Fairy-types with super effective STAB Make It Rain. In addition, Gholdengo also blocks all hazard removal, helping to wear down walls for Great Tusk's team to eventually break through.</li> </ul>"
      },
      "Offensive Utility": {
        "description": "<ul> <li>Great Tusk is the best offensive Stealth Rock or Rapid Spin user in the tier thanks to its solid typing and good physical bulk.</li> <li>If Great Tusk is paired with Pokemon such as Corviknight, then Stealth Rock can be run instead of Rapid Spin. If paired with teammates that set Stealth Rock, then the best set would be Rapid Spin / Headlong Rush / Close Combat / Knock Off. Knock Off makes progress on Corviknight and covers the Air Balloon Gholdengo matchup.</li> <li>Tera Ground lets Great Tusk deal incredible damage with Headlong Rush while also letting it survive Flutter Mane's Moonblast from full HP. Tera Steel flips the Fairy matchup and lets Great Tusk take on Ice- and Dragon-type attacks, but the additional weaknesses to Fighting and Ground make Great Tusk unable to take on Koraidon, Ting-Lu, and Iron Treads easily.</li> <li>Great Tusk can be used to take on entry hazard setters like Ting-Lu and Iron Treads one-on-one by forcing them out and removing hazards. Jolly is usually preferred to outspeed Gholdengo, Modest Chi-Yu, and Glimmora, but Adamant lets Tera Ground Headlong Rush OHKO Koraidon and specially defensive Annihilape after one layer of Spikes or Stealth Rock.</li> <li>Great Tusk should be used aggressively to force out and keep entry hazards off the field against other setters, such as Ting-Lu and Iron Treads, since Great Tusk is generally difficult to switch into. Great Tusk pairs well with Koraidon thanks to Orichalcum Pulse's sun, letting Great Tusk become an incredibly potent wallbreaker, and Great Tusk can clear entry hazards so that Koraidon can repeatedly come in. Miraidon also appreciates Great Tusk, as it forces out common checks such as Clodsire, Ting-Lu, and Iron Treads. Great Tusk also appreciates Blissey being able to take on all of the special attackers that force Great Tusk out, such as Flutter Mane, Miraidon, and Iron Bundle.</li> </ul>"
      },
      "Setup Sweeper": {
        "description": "<ul> <li>Bulk Up allows Great Tusk to be a threatening sweeper. It can comfortably set up on common physical walls like Ting-Lu, Iron Treads, Corviknight, and defensive Great Tusk.</li> <li>The STAB combination of Headlong Rush and Close Combat hits most physical walls for at least neutral damage. Earthquake may be used as the Ground-type STAB move to avoid defensive drops, but it is a weaker move, and it can't secure important OHKOs and 2HKOs at +1 Attack against some physical walls such as Toxapex, Scream Tail, and Alomomola.</li> <li>A Jolly nature is used to outspeed all viable unboosted Pokemon after one Rapid Spin. An Adamant nature makes Great Tusk stronger while still letting it outspeed unboosted Iron Bundle at +1 Speed, but it misses out on outspeeding maximum Speed Gholdengo and tying Jolly Great Tusk.</li> <li>Terastallizing into the Ground typing boosts Headlong Rush and guarantees some additional OHKOs and 2HKOs on foes like Toxapex and Scream Tail. Additionally, getting rid of the Fighting typing lets Great Tusk survive Fairy-type attacks such as Dazzling Gleam from Miraidon and Moonblast from Flutter Mane without Life Orb or Choice Specs, and it facilitates taking Dazzling Gleam and Play Rough from Scream Tail and Alomomola.</li> <li>Alternatively, using Tera Steel gives Great Tusk resistances to Fairy-type attacks, Ice-type attacks from Chien-Pao and Iron Bundle, and Draco Meteor from Miraidon, allowing it to surprise them with a strong attack.</li> <li>Koraidon is a solid partner because its sun activates Great Tusk's Protosynthesis, making its attacks even stronger. In return, Great Tusk can break through or strongly dent common Koraidon checks like Scream Tail, Alomomola, and Skeledirge, which allows Koraidon to clean more easily. Miraidon is also an excellent teammate, since Great Tusk can easily hard switch into its common checks and either threaten them with its attacks or set up on them.</li> <li>Special attackers like Miraidon, Flutter Mane, and Iron Bundle hugely threaten Great Tusk, so it is recommended to pair it with appropriate special walls like Blissey, Ting-Lu, Iron Treads, and Clodsire. Gothitelle is a less popular pick but it helps eliminate bulky checks like Dondozo and Pelipper, allowing Great Tusk to sweep more easily.</li> </ul>"
      },
      "Defensive": {
        "description": "<ul> <li>Thanks to its solid physical bulk under sun and good defensive typing, Great Tusk acts as one of the best checks to Koraidon while also providing teams with entry hazard removal and a fantastic switch-in to other Ground-types in the tier such as Ting-Lu, Clodsire, and Iron Treads.</li> <li>Play Rough threatens a KO on Koraidon after entry hazard damage. Knock Off can be used to take on Air Balloon Gholdengo and wear down foes that want to switch into Great Tusk such as Corviknight and Annihilape, but it is generally outclassed by the sheer utility of Rapid Spin and Stealth Rock. The combination of Knock Off and Body Press can be used to pressure Corviknight switch-ins.</li> <li>Bulk Up is an option to boost alongside opposing Great Tusk and Swords Dance Kingambit and Koraidon.</li> <li>Great Tusk can Terastallize into the Fairy typing to take on physical attackers such as Koraidon, Chien-Pao, and Palafin in sun. However, be wary of Terastallizing against Koraidon that can still Terastallize themselves, as Choice Band Tera Fire Koraidon can take on Great Tusk one-on-one. Great Tusk can also Terastallize into the Ground typing or the Water typing, with both options removing its weakness to Fairy. The former also lets it fire off stronger Earthquakes as well, while the latter provides useful resistances to Fire moves from Koraidon as well as Ice- and Water-type moves, barring Freeze-Dry, from Iron Bundle.</li> <li>Great Tusk fits on most teams as a bulky Stealth Rock setter and Koraidon check. Great Tusk can utilize Rocky Helmet to punish the use of U-turn, though this hurts its longevity, as it then loses Leftovers's passive recovery.</li> <li>Great Tusk pairs well with defensive Scream Tail and Blissey, both of which can take on Iron Bundle while also providing Wish support for Great Tusk. Blissey can also take on Chi-Yu and Miraidon, while Scream Tail can take on Iron Valiant.</li> <li>Great Tusk also pairs well with Gholdengo, as it appreciates Great Tusk forcing out Koraidon while preventing hazard removal in exchange. Choice Scarf Chi-Yu is a good partner due to its ability to pressure faster special attackers that trouble Great Tusk such as Iron Bundle and Flutter Mane. Great Tusk also pairs well with Miraidon, as non-Heavy-Duty Boots Miraidon appreciates it removing entry hazards and taking on Clodsire, Iron Treads, and Ting-Lu. Finally, Koraidon is a good partner, as it can set up sun, pivot into Great Tusk, and force out most hazard removal options besides opposing defensive Great Tusk.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 597293, "username": "OreoSpeedruns"}, {"user_id": 595062, "username": "Taka"}, {"user_id": 374620, "username": "Lana"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 511624, "username": "Fc"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 109385, "username": "aurora"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Flutter Mane": {
    "outdated": true,
    "overview": "<p>Flutter Mane carves itself a niche as one of the most threatening wallbreakers in Ubers thanks to its incredibly powerful STAB combination, near-unrivaled Speed that is boosted further under sun, good coverage options, and great defensive typing, allowing it to operate as a solid revenge killer against Pokemon like Extreme Killer Arceus. Its Ghost / Fairy typing allows it to target a variety of threats, particularly the big three Pokemon in the tier—Miraidon, Koraidon, and Necrozma-DM— as well as Pokemon like Ting-Lu and Extreme Killer Arceus. However, Flutter Mane struggles to find opportunities to switch in safely thanks to its mediocre physical bulk and vulnerability to entry hazards. Likewise, some special walls like Ho-Oh and Arceus-Water can take an attack and potentially threaten to status Flutter Mane or flat out KO it.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Psyshock is Flutter Mane's best option against Clodsire and Eternatus. Alternatively, Mystical Fire can be used, being Flutter Mane's best option against Pokemon like Zacian-C and being boosted under sun. Power Gem is extremely valuable coverage, allowing it to OHKO offensive and defensive Ho-Oh after a bit of chip. Tera Fairy boosts Moonblast, allowing Flutter Mane to hit damage thresholds like 2HKOing Calm Mind Kyogre and Ting-Lu after a slight amount of chip while giving it a useful resistance to Dark-type attacks like Chien-Pao and Kingambit's Sucker Punch, although it removes its immunity to Extreme Speed. Tera Stellar is an option, giving Flutter Mane a one-time boost to any of its attacks, allowing it to outright OHKO any Ho-Oh variant while still retaining its valuable immunity to Extreme Speed. However, it is worthless after Flutter Mane uses a move, as that move will then not be boosted for the rest of the game.</p> <p>When using Flutter Mane, Koraidon is a near-obligatory partner; Koraidon sets up sun, which enables Protosynthesis, as well as pivoting Flutter Mane into Pokemon it can beat like Landorus-T, opposing Koraidon, and Necrozma-DM. Other pivots like Miraidon and Landorus-T give Flutter Mane a safe opportunity to come into the field and wallbreak safely. Offensive Pokemon like Extreme Killer Arceus, Deoxys-A, and Kyogre all appreciate Flutter Mane wearing down their checks like Necrozma-DM and Miraidon. Physical attackers like Zacian-C, Groudon, and Ho-Oh make it difficult for Flutter Mane to come in safely and wallbreak; Pokemon that can take on these threats like one's own Ho-Oh, Necrozma-DM, and Arceus-Water all make good partners. Spikes support from Clodsire and Ting-Lu can give Flutter Mane extra support and chip Arceus into the range of Tera Fairy-boosted Moonblast. Flutter Mane has a terrible matchup against Sticky Web teams, as it has terrible bulk and is forced to gain a Special Attack boost from Protosynthesis when affected by Sticky Web, so partners like Extreme Killer Arceus and Calyrex-I can ease the matchup. Flutter Mane covers the Fairy-type teamslot on teams, giving them flexibility with picking an Arceus forme and Tera types.</p>"
      },
      "Life Orb": {
        "description": "<p>This set takes advantage of Flutter Mane's great strength and coverage to become a fearsome wallbreaker. Power Gem lets Flutter Mane destroy Ho-Oh, an otherwise perfect counter to Flutter Mane, but has very little practical use otherwise. Calm Mind lets Flutter Mane reliably break through defensive Arceus formes like Arceus-Ground and Arceus-Fairy for the benefit of teammates like Koraidon and Miraidon. Psyshock hits Clodsire and Eternatus, while Mystical Fire hits Zacian-C, but both have little practical use beyond hitting their intended targets. Tera Fairy is the preferred Tera type with Calm Mind. Tera Stellar is preferred when not running Calm Mind, as Flutter Mane's coverage moves can struggle to OHKO their intended targets. For example, Ho-Oh and Zacian-C can normally survive Power Gem and Mystical Fire, respectively, from full HP. However, with Tera Stellar, Flutter Mane's coverage moves are favored to OHKO these Pokemon. Tera Stellar is also useful for boosting Moonblast's power while keeping Flutter Mane's immunity to Extreme Speed from Extreme Killer Arceus, allowing Flutter Mane to pick it off from higher HP.</p> <p>Choice Scarf Koraidon is Flutter Mane's best friend, as Koraidon provides Flutter Mane with sun and pivot support. Koraidon also appreciates Flutter Mane threatening Koraidon's checks for it, like Landorus-T and Ho-Oh. Another good partner is Miraidon, which can work with Flutter Mane to overwhelm shared checks such as Arceus-Ground and Arceus-Fairy. Spikes support from Gliscor and Ting-Lu are generally good for wallbreakers like Flutter Mane, but Flutter Mane in particular enjoys Spikes weakening its checks, as it's not easy to revenge kill courtesy of its impressive Speed and good defensive typing. Thus, Spikes allows Flutter Mane to continue being threatening even against fast-paced offensive teams, especially as its low bulk makes it somewhat difficult to safely get on the field; it can also be forced out by Pokemon like Zacian-C if not carrying Mystical Fire. Entry hazard control in the form of Giratina-O's Defog is also an option to increase Flutter Mane's longevity, as otherwise Flutter Mane gets worn down very quickly by entry hazards and Life Orb recoil.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}, {"user_id": 597293, "username": "OreoSpeedruns"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}, {"user_id": 50695, "username": "Manaphy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Iron Treads": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<ul> <li>A decent defensive typing allows Iron Treads to act as a check to Miraidon and Flutter Mane, and use the opportunity to remove or set entry hazards.</li> <li>Knock Off cripples common switch-ins such as Ting-Lu and Corviknight, while Volt Switch keeps momentum for your team.</li> <li>16 IVs in Defense mean that Iron Treads will receive a Special Defense boost in Electric Terrain, helping with switching into Miraidon.</li> <li>Iron Treads can use Tera Fairy to remove its weaknesses to Fighting and Fire, which can be helpful versus Koraidon and Chien-Pao, and with taking coverage from Miraidon and Flutter Mane. However, it loses its immunity to Electric and resistance to Fairy. Iron Treads can alternatively use Tera Ground for an extra boost to Earthquake, but it suffers from similar demerits as Tera Fairy.</li> <li>Since both Miraidon and Flutter Mane have Fire-type coverage options, Iron Treads appreciates being paired with Pokemon such as Ting-Lu that can handle those attacks. Choice Scarf Koraidon and Booster Energy Flutter Mane are also good teammates, as they can revenge kill Miraidon and Flutter Mane while benefitting from Iron Treads removing entry hazards.</li> <li>Skeledirge's ability to check Koraidon and Iron Valiant also makes it a great partner for Iron Treads. Teammates that can switch into Great Tusk such as Dondozo and Alomomola also pair well, with Alomomola even providing Wish support to increase Iron Treads's longevity.</li> </ul>"
      },
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest allows Iron Treads to utilize an offensive spread while still letting it be a fairly safe option against Miraidon and Flutter Mane.</li> <li>Iron Head allows Iron Treads to beat Tera Fairy Miraidon.</li> <li>Knock Off can remove crucial items from foes like Ting-Lu, Great Tusk, and Corviknight.</li> <li>Volt Switch is useful for grabbing momentum on non-Ground-type foes that switch in on Iron Treads like Corviknight, Koraidon, Dondozo, and Pelipper.</li> <li>A Jolly nature gives Iron Treads a Speed boost from Quark Drive, which is often crucial to be able to beat Choice Specs Miraidon one-on-one, and lets it pick off foes that would normally outspeed it without Electric Terrain.</li> <li>Ground is the preferred Tera type to boost the power of Earthquake while weakening incoming Fire- and Fighting-type attacks; alternatively, other Tera types can provide defensive utility but not any offensive boost.</li> <li>This set works best on offensive teams where it is paired up with teammates that are weak to Fairy-type moves, such as Miraidon, Koraidon, Great Tusk, and Chien-Pao. Iron Treads allows these Pokémon to be played more freely because it can reliably deal with Flutter Mane and opposing Miraidon while applying offensive pressure itself.</li> <li>Flutter Mane is another great teammate because Iron Treads lures Corviknight and weakens it with Knock Off or Volt Switch, this gives Flutter Mane an easier time to break through enemy teams.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 225217, "username": "SparksBlade"}, {"user_id": 507268, "username": "ox04"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Iron Bundle": {
    "outdated": true,
    "overview": "<p>Iron Bundle is one of the foremost speed control options in Ubers thanks to its fantastic offensive typing and the fact that it is one of the few Pokemon surpassing the critical base 135 Speed tier. Hydro Pump and Freeze-Dry give Iron Bundle perfect coverage, and Ice Beam deals considerable damage to many prominent threats in the tier, such as Koraidon, Miraidon, Eternatus, and Arceus-Ground. Unfortunately, Iron Bundle is hampered by its dreadful defensive typing and special bulk, which leaves most teams with abundant means of OHKOing it; for example, even uninvested attacks such as Judgment from the Arceus formes and Dynamax Cannon from defensive Eternatus can OHKO Iron Bundle. As a result, Iron Bundle has difficulty getting safely onto the battlefield without the help of pivoting moves from its teammates. Additionally, Iron Bundle must be wary of potential status moves from the likes of defensive Arceus formes, Kyogre, Giratina-O, Eternatus, and Gliscor, since paralysis renders Iron Bundle completely useless, while poison and burn exacerbate Iron Bundle's problems with longevity.</p>",
    "comments": "<h4>Other Options</h4> <p>Tera Water is an option to boost the power of Hydro Pump, enabling Iron Bundle to 2HKO common defensive Pokemon such as Necrozma-DM and Arceus-Fairy as well as improving its matchup against Zacian-C. However, the defensive utility of Tera Ghost and the damage benchmarks achieved by Tera Ice are typically more valuable to the teams Iron Bundle finds itself on. Flip Turn can be used in the last moveslot to maintain momentum against the switches Iron Bundle often forces, but the utility of Taunt or Encore is one of the primary motives for using Iron Bundle and is almost never worth forgoing. A power boosting item like Choice Specs or Life Orb allows Iron Bundle to accomplish notable KOs without the need to Terastallize, such as OHKOs against Koraidon and Miraidon with Ice Beam and most Arceus-Ground with Hydro Pump and 2HKOs against Necrozma-DM, Arceus-Fairy, and Calyrex-I with Hydro Pump. Iron Bundle's atrocious longevity and complete dependence on prediction with these items makes them difficult to justify using, though.</p> <h4>Checks and Counters</h4> <p><strong>Zacian-C</strong>: Zacian-C not only resists Iron Bundle's Ice-type moves, but it also is one of the few Pokemon in Ubers that naturally outspeeds Iron Bundle, and with its Intrepid Sword boost, it can comfortably OHKO Iron Bundle with nearly all of its moves.</p> <p><strong>Kyogre</strong>: Although Freeze-Dry deals super effective damage, a bulky Kyogre cannot be 2HKOed unless Iron Bundle Terastallizes Ice, and Kyogre can OHKO Iron Bundle with Thunder or even a resisted Origin Pulse or Water Spout.</p> <p><strong>Choice Scarf Users</strong>: With a Choice Scarf, Pokemon that Iron Bundle usually outspeeds like Koraidon, Eternatus, and Kyogre can gain the Speed advantage and OHKO it as long as Electric Terrain is not active. Koraidon is especially bothersome, as its sun hinders Iron Bundle's damage output with Hydro Pump. It should be noted, however, that Koraidon and Eternatus cannot safely switch into Ice Beam.</p> <p><strong>Priority Moves</strong>: Iron Bundle's poor bulk makes it vulnerable to being picked off by priority moves like Extreme Speed and Sucker Punch. Encore can shut down most priority users, but this requires Iron Bundle to Terastallize or correctly predict the use of setup moves, which can prove fatal should the opponent decide to immediately attack Iron Bundle rather than set up.</p>",
    "sets": {
      "Heavy-Duty Boots": {
        "description": "<p>Heavy-Duty Boots mitigates Iron Bundle's crippling weakness to entry hazards, allowing it to repeatedly come in and threaten the myriad of Pokemon it outspeeds and hits for super effective damage, such as Koraidon, Miraidon, and Arceus-Ground. Taunt prevents walls like defensive Arceus formes, Ting-Lu, and Necrozma-DM from using recovery or status moves. Additionally, Iron Bundle is one of the fastest Taunt users in the tier, letting it block entry hazards from dedicated leads or shut down setup sweepers in an emergency. Encore is an alternative option that performs better against foes attempting to use setup moves at the cost of being unable to prevent status moves and hazards. Tera Ghost gives Iron Bundle immunities to Extreme Speed and Fighting-type moves, which helps it significantly against Arceus, Rayquaza, and Choice Scarf Koraidon. Tera Ice boosts the power of Iron Bundle's Ice-type moves, allowing it to OHKO Koraidon and Miraidon with Ice Beam and 2HKO Kyogre with Freeze-Dry.</p> <p>Although Iron Bundle boasts a phenomenal Speed stat and offensive typing, it needs the help of its teammates to overcome its terrible defensive profile and lack of power. Miraidon is an ideal teammate, since it can wallbreak for Iron Bundle, bring it in safely with U-turn, and give it a Quark Drive boost by setting Electric Terrain, enabling Iron Bundle to outspeed even Choice Scarf Koraidon, Zacian-C, and Dragon Dance Arceus formes. Additionally, Iron Bundle threatens the Ground-types that frequently switch in against Miraidon. Kyogre can set rain to strengthen Iron Bundle's Hydro Pump, and together, they can overwhelm bulky Water-resistant Pokemon such as Arceus-Water and Eternatus. Entry hazard support from the likes of Ting-Lu, Gliscor, Necrozma-DM, and Arceus-Fairy wears down foes for Iron Bundle. Ting-Lu and Gliscor can also switch into any Electric-type attacks thrown at Iron Bundle. Zacian-C naturally outspeeds Iron Bundle and OHKOes it with most of its attacks; as such, a reliable answer like Necrozma-DM is needed as a teammate. Necrozma-DM also handles Extreme Speed Arceus for Iron Bundle and pressures bulky teams with Knock Off. Koraidon checks like Arceus-Fairy and Ho-Oh are helpful teammates, since Iron Bundle cannot beat Koraidon if it is at full health or has Tera available.</p>"
      },
      "Choice Specs": {
        "outdated": true,
        "description": "<ul> <li>The combination of Hydro Pump and Freeze-Dry gives Iron Bundle an unresisted STAB combination, making it extremely threatening with Choice Specs.</li> <li>Flip Turn allows Iron Bundle to pivot in order to gain momentum, while Ice Beam OHKOes Koraidon and uninvested Miraidon.</li> <li>Tera Ice allows Iron Bundle to further boost its Ice-type moves and resist Freeze-Dry from opposing Iron Bundle and Ditto. Tera Water is a good option on teams with rain support in order to let it 2HKO Heavy-Duty Boots Blissey in rain after slight chip.</li> <li>Choice Specs allows Iron Bundle to 2HKO walls such as Ting-Lu, Corviknight, and Scream Tail with Hydro Pump as well as Toxapex with Freeze-Dry.</li> <li>Miraidon is a great teammate, as it can lure in Pokemon weak to Hydro Pump such as Ting-Lu and Iron Treads and pivot into Iron Bundle using U-turn. It also sets Electric Terrain, giving Iron Bundle a Speed boost upon entry.</li> <li>Entry hazard removal options such as Corviknight, Iron Treads, and defensive Great Tusk are great teammates, as Iron Bundle can get worn down pretty quickly from repeatedly switching into Stealth Rock.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 547277, "username": "LillianOfficial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 249382, "username": "Aberforth"}, {"user_id": 306317, "username": "katerina"}, {"user_id": 273339, "username": "Lasen"}, {"user_id": 274590, "username": "SiTuM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Baxcalibur": {
    "outdated": true,
    "sets": {
      "Dragon Dance": {
        "description": "<ul> <li>Baxcalibur functions as a niche wallbreaker and occasional sweeper for hyper offense teams. Glaive Rush and Icicle Spear are fantastic STAB moves that hit most of the tier for super effective or neutral damage.</li> <li>Earthquake provides good coverage against common defensive Pokemon such as Toxapex and Skeledirge.</li> <li>Baxcalibur competes heavily with Chien-Pao as an offensive Ice-type, as they fill a similar role on teams. The key difference is Baxcalibur's ability to boost its Speed. Another key difference is Baxcalibur's Dragon typing, which gives it weaknesses to common Dragon- and Fairy-type moves. This stacks weaknesses with Koraidon and Miraidon.</li> <li>Tera Fairy provides Baxcalibur with a Dragon immunity to better deal with Koraidon and Miraidon, as well as a resistance to Fighting-type moves from Pokemon such as Koraidon and Great Tusk. It also ensures Kingambit and Chien-Pao cannot easily revenge kill Baxcalibur with Sucker Punch.</li> <li>Tera Steel grants Baxcalibur important resistances to types like Dragon and Fairy, as well as a Toxic immunity, giving it setup potential against certain walls like Toxapex.</li> <li>Grimmsnarl is a great partner: it provides dual screens support, easing Baxcalibur's setup and entry into the match. Another good partner is Hatterene or another form of hazard control, since denying Stealth Rock assists Baxcalibur in setting up.</li> <li>Miraidon is a recommended teammate, as it can provide both sweeping potential and wallbreaking power and appreciates Baxcalibur breaking down Clodsire and Ting-Lu. Another recommended teammate is Koraidon, since it appreciates Baxcalibur removing walls like Toxapex and Skeledirge.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537354, "username": "Mashing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Gholdengo": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li>Choice Scarf Gholdengo outspeeds the entire unboosted metagame, can use Trick to weaken defensive teams, and also blocks Defog and Rapid Spin to keep pressure on defensive Pokemon with entry hazards.</li> <li>Focus Blast deals more damage to Ting-Lu, Chi-Yu, and Iron Treads, while Nasty Plot and Recover can be used after Gholdengo's Choice Scarf has been removed via Trick to turn it into a setup sweeper or give it longevity, respectively.</li> <li>Tera Fighting powers up Focus Blast, which allows Gholdengo to potentially 2HKO Ting-Lu. Alternatively, Gholdengo can use Tera Steel on sets not using Focus Blast to boost Make It Rain and remove its weaknesses to Flutter Mane's and Chien-Pao's STAB moves.</li> <li>Gholdengo should almost always be switched in if Corviknight is on the field and be used sparingly against Great Tusk and Iron Treads if a Rapid Spin is predicted, but this is risky due to its Earthquake weakness.</li> <li>Spikes setters like Ting-Lu and Clodsire on balance teams as well as Froslass on hyper offense teams appreciate Gholdengo keeping up Spikes and it acting as a revenge killer for their respective archetypes.</li> <li>Pokemon like Calm Mind Miraidon, Calm Mind Flutter Mane, and Swords Dance Chien-Pao also benefit from Gholdengo using Trick on defensive Pokemon, forcing them to either heal or be locked into an unfavorable attack while they set up. Gholdengo can also clean up weakened teams if these Pokemon are used to wallbreak first.</li> </ul>"
      },
      "Nasty Plot": {
        "description": "<ul> <li>Nasty Plot + Recover Gholdengo is the best option for preventing entry hazard removal in the tier.</li> <li>Tera Steel bolsters Make It Rain's power, allowing Gholdengo to overwhelm threats such as Koraidon, defensive Great Tusk, Ting-Lu, and bulky Tera Fairy Miraidon after a Nasty Plot boost while removing its Ghost typing.</li> <li>Tera Normal blocks incoming Ghost-type attacks from the likes of Flutter Mane, Choice Scarf Houndstone, and opposing Gholdengo.</li> <li>Air Balloon provides a temporary measure against Ground-type attacks from Pokemon such as Great Tusk and Iron Treads, allowing Gholdengo to sometimes switch into them.</li> <li>Gholdengo best fits on hyper offense and balance teams that aim to preserve their own entry hazards for as long as possible.</li> <li>Frail leads such as Froslass and Masquerain appreciate their entry hazards staying intact against Great Tusk, Iron Treads, Corviknight, and Glimmora.</li> <li>Glimmora and Ting-Lu make for good teammates on balance teams in particular, as they provide similar entry hazard support while having sufficient power and bulk to punish threats.</li> <li>Wallbreakers such as Miraidon, Koraidon, and Chi-Yu appreciate multiple entry hazards to further overwhelm the opposition with their tremendous attacks and power.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511624, "username": "Fc"}, {"user_id": 473574, "username": "LeBarBURR"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}, {"user_id": 306317, "username": "katerina"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 109385, "username": "aurora"}]}]}
  },
  "Chien-Pao": {
    "outdated": true,
    "overview": "<p>Chien-Pao possesses the coveted-yet-crowded base 135 Speed tier and can even get the jump on its peers with Ice Shard and Sucker Punch, making it a nice revenge killer and late-game cleaner; Ice Shard in particular stands out in a metagame with numerous fast Dragon-types. Its Dark / Ice STAB combination matches up well into defensive staples like Necrozma-DM, Arceus-Ground, and Ting-Lu, and Icicle Crash can also potentially flinch through otherwise solid counterplay like Ho-Oh. However, Chien-Pao is exceedingly frail and entry hazard-weak, making getting it onto the field safely, let alone multiple times, quite difficult. This also means it offers exactly no defensive utility to its team. Due to the low Base Power of its moves, it is also relatively weak by Ubers standards without finding a turn to use Swords Dance, which is hard to find due to its frailty. Chien-Pao is also scared to death of Zacian-C, which outspeeds it and resists both STAB types. Kingambit also provides heavy competition, as it has substantially better bulk, resists Stealth Rock, and boasts an even stronger Sucker Punch late-game, at the cost of much worse Speed. Ultimately, Chien-Pao's Speed, priority, and STAB combination make it a noteworthy cleaner, but it still finds itself more limited compared to metagame staples like Koraidon and Zacian-C.</p>",
    "comments": "<h4>Other Options</h4> <p>An all-out attacker set with Heavy-Duty Boots can be used for the maximum amount of coverage and priority while still changing moves in the early- and mid-game, but it generally lacks power compared to the above sets and struggles to even 2HKO defensive staples like Arceus. Sacred Sword provides coverage for Arceus and Kingambit and does non-pitiful damage to Zacian-C, but Chien-Pao struggles to justify it over its primary STAB moves and priority options. Tera Ghost can catch out Extreme Speed Arceus but otherwise is far worse than damage-amplifying Tera types. Focus Sash can be run on hyper offense structures to take a hit but requires significant entry hazard counterplay.</p> <h4>Checks and Counters</h4> <p><strong>Zacian-C</strong>: Zacian-C outspeeds Chien-Pao and resists its STAB combination.</p> <p><strong>Defensive Arceus</strong>: Arceus-Water and -Fairy avoid the 2HKO from almost any of Chien-Pao's attacks and can retaliate with Will-O-Wisp or Judgement. Arceus-Fairy has a low chance to be 2HKOed by Life Orb Tera Ice Icicle Crash, however.</p> <p><strong>Extreme Killer Arceus</strong>: Extreme Killer Arceus completely nullifies Chien-Pao's Speed and priority advantages while not being OHKOed by any common move.</p> <p><strong>Choice Scarf users</strong>: Choice Scarf users like Koraidon can revenge kill Chien-Pao, especially with a well-timed Tera.</p> <p><strong>Iron Bundle</strong>: Iron Bundle outspeeds Chien-Pao, can force 50/50s with Encore, and KOes it after some chip.</p> <p><strong>Zamazenta</strong>: Zamazenta’s bulk lets it take any attack and OHKO with Body Press.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance Chien-Pao is a threatening late-game cleaner once Arceus formes that are not weak to Chien-Pao's STAB moves have been chipped sufficiently. Icicle Crash is Chien-Pao's strongest STAB move, provides key coverage against the plethora of Ground-types, and can provide a flinch in a pinch all while dodging Rocky Helmet. Crunch is Chien-Pao's most reliable secondary STAB move, hitting Necrozma-DM, Arceus-Water, and Kyogre, while Sucker Punch is its strongest priority move by far against neutral targets. Ice Shard is notable to revenge kill Koraidon and Miraidon while also not failing against setup moves and can be run over either Dark STAB move. Life Orb is the preferred item to secure the OHKO against defensive Necrozma-DM and 2HKO against Arceus-Water after Swords Dance, and given Chien-Pao’s frailty, the recoil is often insignificant. Heavy-Duty Boots allows Chien-Pao to be played aggressively in the early-to-mid-game to help break down the opposing core itself and pick off weakened targets, while Black Glasses still secures key KOs like Necrozma-DM without recoil. Jolly is the preferred nature to Speed tie Koraidon, Miraidon, and opposing Chien-Pao while outspeeding Arceus, Mewtwo, and +1 Necrozma-DM and Iron Treads, but Adamant is an option, especially on double priority sets that care less about the Speed tier.</p> <p>Chien-Pao thrives best when it is tasked with cleaning up a weakened team. As such, powerful physical wallbreakers like Koraidon and Arceus-Ground that can lure in and weaken their shared checks like Arceus-Fairy are excellent teammates. Chien-Pao also loves entry hazards being up on the opposing side, making teammates like Gliscor and Ting-Lu wonderful partners. Chien-Pao is helpless against Zacian-C, making a strong answer to it like Ho-Oh a great teammate. Additionally, strong opposing priority users like Arceus offset Chien-Pao's biggest advantage, so a reliable answer to it like defensive Arceus-Ground is recommended. Especially if running Life Orb, Chien-Pao struggles to get onto the field without taking tremendous chip damage, making pivoting teammates like Gliscor, Koraidon, and Miraidon valuable partners; Miraidon especially draws in the Ground-types like Ting-Lu and Gliscor that Chien-Pao feasts on. Extreme Killer Arceus is an excellent teammate, as they form a strong priority core together; Arceus also often forces Tera Ghost on opposing setup sweepers, making them weaker to Chien-Pao's Sucker Punch. Glimmora is a useful partner especially on hyper offense teams to provide entry hazard support and clear Stealth Rock with Mortal Spin.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band gives Chien-Pao the best chance to 2HKO walls like Necrozma-DM and revenge kill Miraidon and Koraidon after moderate chip. Icicle Crash is the main STAB option thanks to its flinch chance and better Base Power while also avoiding Rocky Helmet, while Ice Spinner doesn't miss and can reset Miraidon's Electric Terrain. Crunch is its most reliable Dark-type STAB move, hitting Arceus-Water, Kyogre, and Necrozma-DM. Double priority in Sucker Punch and Ice Shard lets it pack both power and coverage, nailing anything that might be faster including Iron Bundle, Miraidon, and even Calyrex-I in Trick Room. Tera Dark and Ice can both be used to power up Chien-Pao's STAB attacks; Tera Ice has a chance to OHKO both Miraidon and Koraidon with Ice Shard, while Tera Dark secures the 2HKO against Ho-Oh and has a high chance to 2HKO Arceus-Water.</p> <p>Choice Band Chien-Pao is a useful revenge killer and wallbreaker for offensive teams. Since it forgoes Heavy-Duty Boots and would love to switch in multiple times to mitigate the effect of Choice-lock, it pairs well with Iron Treads, which can clear entry hazards and even pivot Chien-Pao in. Zacian-C can easily revenge kill Chien-Pao and even grab a Swords Dance if locked into Sucker Punch or Ice Shard, making strong counterplay like Landorus-T and defensive Arceus-Ground or revenge killers like Choice Scarf Koraidon mandatory teammates. Physically offensive teammates like Koraidon and Necrozma-DM appreciate being able to clean teams Chien-Pao has weakened; alternatively, they can punch holes for Chien-Pao to clean up. Extreme Killer Arceus is an excellent teammate, as it forms a powerful priority core with Chien-Pao and can draw out Tera Ghost for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Ting-Lu": {
    "outdated": true,
    "overview": "<p>Ting-Lu's titanic bulk makes it the premier special wall and check to Miraidon in Ubers. Unlike Arceus-Ground and Clodsire, Ting-Lu is able to take on Miraidon and generate momentum in the process thanks to Vessel of Ruin and a fantastic support movepool featuring Spikes, Ruination, and Whirlwind. Other special threats such as Calm Mind Arceus-Ground and offensive Eternatus are hurt in viability by Ting-Lu's presence alone. Ting-Lu's physical bulk should not be underestimated either, as it can take on threats like Dragon Dance Necrozma-DM and Zekrom when needed. These incredible defenses come at the cost of lacking any form of reliable recovery, making Ting-Lu extremely vulnerable to entry hazard damage, Knock Off, and status. As such, some teams may prefer either Clodsire due to its superior role compression in checking Kyogre, absorbing Toxic Spikes, and ability to run Heavy-Duty Boots or Arceus-Ground for its better offensive presence and reliable recovery. Effective use of Ting-Lu requires careful management of its HP so that it fulfills its role of setting entry hazards early-game and staying healthy enough to check threats late-game.</p>",
    "comments": "<h4>Other Options</h4> <p>Heavy-Duty Boots may be run over Leftovers, as it better preserves Ting-Lu's longevity should Spikes be set on its side of the field. However, Leftovers is usually preferred, as Ting-Lu itself likes to tank some hits early-game to set its own Spikes, and Heavy-Duty Boots removes Ting-Lu's only form of healing. Taunt is an option to harass opposing Ting-Lu and prevent setup from incoming Pokemon such as Gliscor, but Whirlwind can achieve similar results and offers more utility for checking threats.</p> <h4>Checks and Counters</h4> <p><strong>Gliscor</strong>: Gliscor is the most notable threat to Ting-Lu, as it can heal off any Ruination damage with Poison Heal and use it as an easy chance to set entry hazards or use Toxic.</p> <p><strong>Chip Damage</strong>: Ting-Lu is completely vulnerable to all forms of entry hazard and status effect chip damage, which can rack up quickly thanks to its lack of recovery.</p> <p><strong>Knock Off</strong>: Knock Off from Necrozma-DM and Gliscor removes Ting-Lu's only form of recovery, devastating Ting-Lu's longevity.</p> <p><strong>Physical Attackers</strong>: Despite Ting-Lu's massive physical bulk, it is vulnerable to super effective coverage from strong physical attackers like Koraidon, Zacian-C, Calyrex-I, Kyurem-B, and Chien-Pao. Also, Ho-Oh is immune to Earthquake and can heal off Ruination damage with Regenerator while being able to cripple Ting-Lu with a burn from Sacred Fire. These threats may come in on Ting-Lu easily with support from U-turn Miraidon.</p> <p><strong>Kyogre</strong>: Kyogre is one of the few special attackers that is not bothered by Ting-Lu thanks to its rain-boosted STAB Water-type attacks, although it hates directly switching in.</p> <p><strong>Taunt</strong>: Taunt prevents Ting-Lu from using Spikes and Whirlwind, so Taunt users like Arceus-Ground and Landorus-T can prove severely annoying.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Whirlwind prevents opposing setup threats such as Double Dance Miraidon and Calm Mind Arceus-Ground from snowballing out of control. This can also rack up entry hazard damage and is a decent way to maintain momentum against an incoming Gliscor. Protect can also be used in this moveslot, which allows for more Leftovers recovery and scouting of Choice item users and Tera types. Stealth Rock may be chosen in the fourth slot to save moveslots for Ting-Lu's teammates, but it makes Ting-Lu less reliable at checking threats in general. Ting-Lu will very rarely need to Terastallize, as its natural typing provides a strong Electric immunity against Miraidon. Tera Steel provides a Fairy and Dragon resistance, which can be critical for handling Calm Mind + Tera Fairy or Tera Dragon Miraidon sets. It has the additional benefit of an immunity to Toxic from Gliscor and Eternatus. Tera Fairy provides a Dragon immunity against Miraidon, allowing Ting-Lu to better answer Tera Dragon sets holding either Calm Mind or Choice Specs while making Ting-Lu resistant or immune to Koraidon's STAB moves. However, this comes at the expense of not resisting Fairy versus Tera Fairy Miraidon. Tera Poison is useful against Koraidon, Zacian-C, and Tera Fairy Miraidon, and it allows Ting-Lu to absorb Toxic Spikes. Tera Water allows Ting-Lu to take Kyogre's STAB moves while also resisting Koraidon's Flare Blitz and Necrozma-DM's Sunsteel Strike. It also lets Ting-Lu check the rare, but otherwise hard to check, Chi-Yu and Walking Wake.</p> <p>Ting-Lu struggles against physical threats such as Koraidon, Zacian-C, and Arceus, so it is best paired with Pokemon that can switch into them reliably such as defensive Necrozma-DM, Arceus-Fairy, Gliscor, Arceus-Water, Skeledirge, and Landorus-T. Gliscor deserves special mention, as it can allow Ting-Lu to run Stealth Rock or alternatively allow Gliscor itself to run Toxic Spikes, forming an impressive hazard-stacking core. Necrozma-DM is also notable for having Knock Off, which makes Ting-Lu's Spikes even more deadly. Fairy-types like Arceus-Fairy, Zacian-C, and Flutter Mane are useful for their Dragon immunity, which forces Miraidon to predict between its Dragon- and Electric-type coverage, potentially allowing Ting-Lu to switch in for free. Eternatus and Arceus-Grass are valuable teammates for their ability to take on Kyogre, with Eternatus notably absorbing Toxic Spikes, which severely threaten Ting-Lu. Giratina-O is a great partner that can check Arceus-Ground and Extreme Killer Arceus while providing Defog support, which massively increases Ting-Lu's longevity. Revenge killers like Choice Scarf Koraidon and Miraidon greatly appreciate chip damage from Ting-Lu's Ruination and Spikes for cleaning up weakened teams, and they may take on Miraidon should Ting-Lu not be healthy enough to do so.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 249382, "username": "Aberforth"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Chi-Yu": {
    "outdated": true,
    "sets": {
      "Feesh (Offensive Wallbreaker)": {
        "description": "<ul> <li>Overheat hits extremely hard and can 2HKO even the bulkiest of Pokemon. Fire Blast and Flamethrower can be used to KO foes without Chi-Yu suffering a Special Attack drop, with Flamethrower having perfect accuracy.</li> <li>The only reason to run Timid over Modest is to outspeed Jolly Great Tusk, Jolly Annihilape, and fast Iron Treads with Special Defense investment.</li> <li>Tera Fire allows Chi-Yu to turn 2HKOs to OHKOs, for example OHKOing opposing Chi-Yu with Overheat. Tera Fire also lets it 2HKO any prominent special wall, including Toxapex, Blissey, and Ting-Lu, OHKOing them with sun.</li> <li>Choice Specs Chi-Yu is a wallbreaker, suited best for offensive teams. Koraidon is an excellent teammate because it sets sun and pivots Chi-Yu in with U-turn. Koraidon and Chi-Yu also threaten each other's checks, like Koraidon threatening Blissey and Garganacl and Chi-Yu threatening Skeledirge and Dondozo.</li> <li>Helpful teammates are those that can get Chi-Yu in safely and force out its few checks. Corviknight and Koraidon are noteworthy examples, pivoting into special walls such as Ting-Lu. Lures such as Heavy Slam Koraidon and Great Tusk, which beat Dachsbun, and Psyshock Flutter Mane, which beats Toxapex and Blissey, are also appreciated teammates.</li> </ul>"
      },
      "Choice Scarf": {
        "description": "<ul> <li>Fire Blast is Chi-Yu's strongest STAB move without any stat drops. Psychic is an alternative that 2HKOes common switch-ins such as Dachsbun and Toxapex. Overheat facilitates revenge killing, hitting even Pokemon that resist it such as Koraidon hard, and is a better midground play.</li> <li>Memento serves as a way to facilitate sweepers like Swords Dance + Flame Charge Koraidon that Chi-Yu is usually paired with.</li> <li>Tera Fire powers up Flamethrower and Overheat to nuclear levels, turning 2HKOs against Pokemon such as Koraidon into OHKOs. Tera Dark nullifies Chi-Yu's Stealth Rock weakness while making Dark Pulse 2HKO Dachsbun and Toxapex. Tera Grass should only be used with Tera Blast; it gives Chi-Yu nice resistances to Ground and Water and allows Chi-Yu to OHKO Great Tusk and 2HKO Ting-Lu after Spikes damage.</li> <li>Choice Scarf Chi-Yu is a revenge killer best suited for offensive teams.</li> <li>Pokemon that can get Chi-Yu safely into the field, such as Koraidon, Miraidon, and Corviknight, are excellent teammates for it. Koraidon also sets up sun, further boosting Chi-Yu's Fire-type attacks.</li> <li>Ting-Lu and Glimmora can set entry hazards to guarantee some 2HKOs, such as against opposing Ting-Lu.</li> </ul>"
      },
      "Nasty Plot": {
        "description": "<ul> <li>Nasty Plot Chi-Yu can threaten to KO foes it couldn't otherwise, such as Ting-Lu and Blissey. Overheat hits extremely hard and threatens to OHKO Ting-Lu at +2. Flamethrower is valuable for its perfect accuracy.</li> <li>A Modest nature alongside Life Orb lets Chi-Yu OHKO Ting-Lu at +2. Heavy-Duty Boots can be used instead to give Chi-Yu more opportunities to switch in, but the loss of power is notable.</li> <li>Chi-Yu fits best on offensive teams with Pokemon such as Cyclizar and Grimmsnarl that can facilitate its setup. Sticky Web support from Masquerain is also useful, as it lets Chi-Yu outrun Pokemon like Koraidon and Miraidon and KO them at +2.</li> <li>Chi-Yu's best partner is Koraidon, since it sets up sun, can safely bring Chi-Yu into play with U-turn, and threatens Blissey. Other good partners are special attackers that benefit from special walls being neutered by Chi-Yu, such as Miraidon, Flutter Mane, and Gholdengo. Great Tusk is also greatly appreciated, as it can remove Stealth Rock and threatens Blissey and Ting-Lu for Chi-Yu. Chi-Yu can deal with Corviknight and Dondozo in return.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537354, "username": "Mashing"}, {"user_id": 306317, "username": "katerina"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 50695, "username": "Manaphy"}, {"user_id": 511624, "username": "Fc"}, {"user_id": 415367, "username": "Eledyr"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "Lunaflare"}, {"user_id": 517429, "username": "Adeleine"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 523866, "username": "UT"}, {"user_id": 109385, "username": "aurora"}]}]}
  },
  "Roaring Moon": {
    "outdated": true,
    "sets": {
      "Dragon Dance": {
        "description": "<ul> <li>With Dragon Dance and Acrobatics, Roaring Moon is a strong sweeper on offensive teams, with coverage to beat almost all Pokemon.</li> <li>Tera Flying allows Roaring Moon to set up on Great Tusk and Body Press Corviknight and boosts Acrobatics's power to achieve feats such as OHKOing Toxapex and Ting-Lu after two Dragon Dances and entry hazard or slight chip damage.</li> <li>Crunch is more reliable, having a chance to drop Defense with no potential drawback, while Jaw Lock has the potential to give Roaring Moon a free chance to set up when paired with Roost, assuming a favorable target is trapped. If an unfavorable target is trapped, however, it has a major downside, making it less consistent.</li> <li>Roost gives Roaring Moon more opportunities to use Dragon Dance, turning weaker Pokemon like Brave Bird Corviknight and Whirpool Alomomola into setup fodder.</li> <li>Earthquake hits Kingambit, Garganacl, and Iron Treads, which can otherwise survive hits and wear down Roaring Moon.</li> <li>Taunt stops defensive Pokemon like Haze Toxapex, Will-O-Wisp Skeledirge, and Whirlwind Ting-Lu from dealing with Roaring Moon, making it devastating against bulkier teams if positioned right.</li> <li>Hyper offense leads such as Glimmora, Froslass, and Grimmsnarl all give Roaring Moon good support to break through a team more easily.</li> <li>Choice Scarf Great Tusk, Tera Fire Koraidon, and Tera Fairy Miraidon can all be used to bait Chien-Pao and take it out, helping Roaring Moon greatly, as it is one of the most reliable revenge killers that can be used against it.</li> <li>On bulkier teams, Roaring Moon requires teammates that can switch into Ice-type moves from Chien-Pao and Iron Bundle, making Toxapex and specially defensive Corviknight great partners. The latter can also pivot with U-turn, giving Roaring Moon more chances to set up on defensive Pokemon.</li> </ul>"
      },
      "Full Moon (Choice Band)": {
        "description": "<ul> <li>Earthquake lets Roaring Moon break past Pokemon that would otherwise check it, like Garganacl, Toxapex, and especially Kingambit.</li> <li>Iron Head lets Roaring Moon hit Fairy-types like Iron Valiant and Tera Fairy Garganacl and Skeledirge super effectively.</li> <li>U-turn lets Roaring Moon generate offensive momentum for its team and is especially useful against targets Roaring Moon scares out, like Skeledirge without Tera Fairy and Gholdengo.</li> <li>The given EVs and a Jolly nature ensure Roaring Moon's Speed is boosted in sunlight, letting it get the jump on crucial threats like unboosted non-Choice Scarf Koraidon and Miraidon and threaten them with its STAB Dragon Claw. The remaining 36 Special Defense EVs improve Roaring Moon's chances to survive Iron Bundle's Ice Beam after Stealth Rock while giving it a chance to survive Overheat in sun from Modest Choice Specs Chi-Yu.</li> <li>Tera Dark strengthens Roaring Moon's Crunch to the point where it always 2HKOs physically defensive Corviknight and always 3HKOs Dondozo while easing predictions with Earthquake against Garganacl.</li> <li>Tera Steel lets Roaring Moon resist otherwise super effective Ice-, Fairy-, and Dragon-type attacks from the likes of Iron Bundle, Flutter Mane, Koraidon, and Miraidon. Tera Steel also powers up Roaring Moon's Iron Head.</li> <li>Tera Fairy allows Roaring Moon to resist Fighting-type attacks while becoming immune to Dragon-type attacks, letting it defeat Koraidon and Iron Valiant, both of which outspeed and threaten to OHKO Roaring Moon otherwise.</li> <li>Roaring Moon loves the support of Koraidon, as it activates Roaring Moon's Protosynthesis via Orichalcum Pulse and reliably threatens Pokemon such as Koraidon, Miraidon, and Ice-types like Chien-Pao and Iron Bundle. In return, Roaring Moon threatens non-Terastallized Skeledirge.</li> <li>Koraidon and Roaring Moon both struggle with defensive Great Tusk, so they can team up with Iron Bundle and Chien-Pao, which threaten all Great Tusk sets. Iron Bundle and Chien-Pao also threaten Koraidon and Miraidon, with Iron Bundle naturally outspeeding non-Choice Scarf variants and Chien-Pao threatening them with priority Ice Shard.</li> <li>Defensive Great Tusk and Ting-Lu also work well with Roaring Moon, as they can set up entry hazards for Roaring Moon's team and check Koraidon and Miraidon, respectively. Great Tusk in particular can use Rapid Spin, giving Roaring Moon more opportunities to switch in, while Ting-Lu can phaze threatening boosters like Espathra with Whirlwind and set up Spikes.</li> <li>Specially defensive Corviknight can check Flutter Mane and Iron Bundle, both of which outspeed and threaten Roaring Moon, and can Defog hazards away, giving Roaring Moon more opportunities to switch in.</li> <li>Roaring Moon can easily pivot into Chi-Yu, which takes advantage of the sun set by Koraidon and threatens walls like Great Tusk, Corviknight, Ting-Lu, and Terastallized Skeledirge.</li> <li>Gholdengo also makes for a decent partner, as not only does it have perfect defensive synergy with Roaring Moon, but it can also reliably block all common forms of hazard removal. This allows Roaring Moon’s team to keep up hazards, in particular Spikes, for it to eventually break down walls.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511624, "username": "Fc"}, {"user_id": 597293, "username": "OreoSpeedruns"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 249382, "username": "Aberforth"}, {"user_id": 507268, "username": "ox04"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 109385, "username": "aurora"}]}]}
  },
  "Koraidon": {
    "overview": "<p>Koraidon is arguably the most impactful Pokemon in Ubers and is used on the majority of teams. Extremely high Speed and Attack boosted by Orichalcum Pulse and the high Base Power of its moves make Koraidon a nightmare to switch into. Scale Shot combined with Loaded Dice gives Koraidon the tools to break past would-be checks such as Ho-Oh without much trouble, leaving very few reliable checks to it; in fact, Koraidon's incredible breaking power makes dedicated checks such as Arceus-Fairy viable by its sheer presence alone. Despite Scale Shot Koraidon's attention-grabbing power, Koraidon's most used set is in fact Choice Scarf, which provides massive amounts of utility. It's able to revenge kill nearly the entire tier, clean up weakened teams with ease, provide momentum with U-turn, and serve as a pseudo-check to powerful wallbreakers like Extreme Killer Arceus, Kyogre, and Dragon Dance Necrozma-DM. Koraidon is somewhat held back by its reliance on moves like Flare Blitz, which has a lot of recoil, and Scale Shot, which can fail to achieve certain KOs should it miss or not get the right amount of hits. Furthermore, despite the lack of proper checks to Koraidon, it is often pivoted into by Pokemon such as Zacian-C, Flutter Mane, Kyogre, and Landorus-T, which can either absorb a Dragon-type move and KO back or cripple Koraidon through Drizzle or Intimidate. As such, Koraidon requires proper prediction to realize its full potential.</p>",
    "comments": "<h3>Other Options</h3> <p>Tera Steel is possible on Choice Scarf sets, as it helps against Extreme Killer Arceus while also providing a useful Dragon-type resistance for opposing Koraidon and Miraidon. Flame Charge may be run on Scale Shot sets. In particular, Flame Charge helps against Zacian-C and Flutter Mane that may try to switch in on Scale Shot, which eases prediction greatly. However, this comes at the cost of the sheer power of Flare Blitz, and this forces Koraidon to Terastallize more often to raise Flame Charge's Base Power. Taunt also has potential on Scale Shot sets, as it prevents moves like Ho-Oh's Whirlwind and Gliscor's Toxic, but Low Kick and Substitute generally have more utility. Choice Band gives Koraidon absurd breaking power from the get-go; however, Choice Band's move limitation greatly hinders Koraidon's sweeping ability, not to mention that Scale Shot Koraidon already packs enough power. Temper Flare is generally outclassed by Flare Blitz.</p> <h3>Checks and Counters</h3> <p><strong>Arceus-Fairy</strong>: Arceus-Fairy is the most common check to Koraidon, as it absorbs Scale Shot and Low Kick with ease and can tank unboosted Flare Blitz. Koraidon can use Tera Fire to take Judgment, and a +2 or Tera Fire Flare Blitz is severely threatening to Arceus-Fairy, but Arceus-Fairy can use Tera Water and paralyze Koraidon back, crippling it for the rest of the game.</p> <p><strong>Fairy-types and Tera Fairy</strong>: Zacian-C and Flutter Mane can take anything but Flare Blitz and force Koraidon out with their super effective coverage and higher Speed. Fairy is also an extremely common Tera type and is prominent on many physical walls, as well as on some special walls like Eternatus and Ting-Lu.</p> <p><strong>Skeledirge</strong>: Thanks to Unaware, Skeledirge can shrug off anything that Koraidon throws at it outside of Scale Shot. Koraidon needs at least a high damage roll four-hit Scale Shot followed by a five-hit Scale Shot to guarantee the 2HKO on Skeledirge, meaning that Skeledirge can wall Koraidon even when switching in on Scale Shot provided Koraidon doesn't get the required luck. Should Koraidon use any other move when Skeledirge switches in, Skeledirge will have no problem walling Koraidon. If Skeledirge is in danger of being KOed, it can always use Tera Fairy to stop Koraidon in its tracks.</p> <p><strong>Kyogre</strong>: Kyogre dislikes switching in on any moves outside of Flare Blitz, but Kyogre's Drizzle negates Orichalcum Pulse and lowers Flare Blitz's power. This makes Kyogre a decent pivot into Koraidon, especially in combination with other checks.</p> <p><strong>Physically Defensive Pokemon</strong>: Arceus-Water has high Defense and is one of the few Pokemon capable of taking two five-hit Scale Shots in a row. It also resists Flare Blitz and can burn or paralyze Koraidon. However, Arceus-Water cannot reliably check +2 Koraidon, especially if entry hazards are on the field, as a +2 Low Kick has an 81.3% chance to OHKO after one layer of Spikes damage. Landorus-T cannot wall Koraidon by itself, but it can be used as a useful pivot into it, lowering its Attack with Intimidate and providing chip damage with Rocky Helmet. Groudon has enough raw physical bulk to tank anything Koraidon can throw at it, but Groudon is limited by its lack of reliable recovery. Ho-Oh can phaze Koraidon with Whirlwind or smack it with Brave Bird, but it risks being KOed by Outrage or a boosted five-hit Scale Shot. Necrozma-DM does not like taking Flare Blitz at all, but it can be used in a pinch to check unboosted Koraidon or to make Koraidon use Flare Blitz more often and suffer recoil damage as a result. Gliscor can use Choice Scarf Koraidon as an easy opportunity to set entry hazards.</p> <p><strong>Chip Damage</strong>: Koraidon is vulnerable to all forms of entry hazards and status, in addition to commonly taking Flare Blitz recoil and Rocky Helmet damage. Due to this, Koraidon can be chipped over the course of a game quite quickly.</p> <p><strong>Priority</strong>: Scale Shot drops Koraidon's Defense, making priority options a common way to revenge kill it. Extreme Speed from Arceus can easily take down a weakened Koraidon, although Arceus needs to watch out for Tera Ghost or Steel. Chien-Pao's Ice Shard is a good way to take out Koraidon that have not Terastallized into the Fire typing. Sucker Punch from Chien-Pao and Kingambit may take out a Terastallized Koraidon.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Thanks to its high power and Speed, Choice Scarf Koraidon is by far the most common revenge killer in Ubers. Low Kick sports 120 Base Power against the vast majority of Ubers, and its lack of stat drops can let Koraidon clean up weakened teams much more easily than Close Combat. Despite this, Close Combat is notably useful against stall teams, as it hits Alomomola much harder as well as some other targets like Terastallized Ho-Oh and Gliscor. Outrage is an extremely strong Dragon-type STAB move that always 2HKOes defensive Ho-Oh. Dragon Claw, while weaker, avoids the situation of Koraidon being taken advantage of while locked into Outrage. Flare Blitz is very powerful under the sun and is Koraidon's best option to hit Fairy-types. Tera Ghost stops Extreme Killer Arceus in its tracks, while Tera Fire boosts Flare Blitz even further and stops Fairy-type attacks or a boosted Behemoth Blade from devastating Koraidon.</p> <p>Choice Scarf Koraidon is a very common sight on balance and bulky offense teams. The utility Koraidon provides through U-turn bringing in wallbreakers like Kyogre, Zacian-C, offensive Ho-Oh, and Eternatus is unmatched in the tier. Its high Speed backed by Choice Scarf lets Koraidon function as a check to Zacian-C, Dragon Dance Arceus-Ground, and Necrozma-DM, and it is one of the best emergency options against opposing Scale Shot or Flame Charge Koraidon. The sun it provides makes it a great pivot on Kyogreas well. However, care should be taken to not overly rely on Choice Scarf Koraidon to deal with certain threats. For example, Sticky Web can be a huge thorn in Koraidon's side, letting common wallbreakers like Zacian-C and Dragon Dance Arceus-Ground and Kyurem-B have no problem outspeeding Koraidon. As such, having a strong defensive core featuring Pokemon like Ho-Oh, Landorus-T, Eternatus, Ting-Lu, Arceus-Fairy, and Arceus-Water can be critical for Koraidon's success. Priority users like Extreme Killer Arceus, Giratina-O, and Kingambit can also take some pressure off Koraidon by providing additional revenge killers.</p>"
      },
      "Scale Shot": {
        "description": "<p>Scale Shot will always hit four to five times when backed by Loaded Dice, which gives Koraidon a powerful Dragon-type STAB that also allows it to outspeed nearly the entire tier after a single use. Scale Shot's sheer power gives Koraidon a way to muscle past Unaware Pokemon like Skeledirge and Dondozo, and at +2, it will OHKO defensive Ho-Oh provided it hits five times. Close Combat's consistent 120 base power is stronger than Low Kick against Ho-Oh, Gliscor, and Alomomola, but Low Kick is usually used to avoid Close Combat's stat drops, and it has the same base power against the majority of the tier. Flare Blitz rounds out Koraidon's coverage and is extremely powerful under the sun. When backed by Tera Fire, Flare Blitz is able to OHKO defensive Arceus-Fairy at +2 and Landorus-T at +1. Tera Fire also provides some nifty resistances to Arceus-Fairy's Judgment and Zacian-C's Behemoth Blade and protects Koraidon from being burned by Sacred Fire or Will-O-Wisp. Tera Ghost is an option for its immunity to Arceus's Extreme Speed, which can be critical for Koraidon to maintain a sweep after multiple Defense drops.</p> <p>Scale Shot Koraidon is a premiere offensive threat, as it is both a powerful wallbreaker and sweeper. As such, Scale Shot Koraidon is one of, if not the most, well-prepped for Pokemon in the entire Ubers tier. Many teams have multiple methods of counter-play against it, from traditional checks like Arceus-Fairy, Arceus-Water, and Skeledirge, to abilities that can weaken it like Kyogre's Drizzle and Landorus-T's Intimidate, to priority options like Arceus's Extreme Speed, as well as the commonality of Tera Fairy on Pokemon like Ho-Oh and Kyogre. Wallbreaking with Koraidon requires recognizing when the opponent will Terastallize and making opportunistic switches. Considering this, it's wise to partner Koraidon with additional physically offensive Pokemon. Zacian-C is a great option for this, as it puts pressure on common defensive Pokemon like Landorus-T and Ho-Oh while being a great answer to Extreme Killer Arceus. Extreme Killer Arceus itself is a good partner that can clean up teams weakened by Koraidon's onslaught. Dragon Dance Arceus-Ground is also notable for applying pressure to Kyogre and Arceus-Water, both of which are common ways to deal with Koraidon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 50695, "username": "Manaphy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 374620, "username": "Lana"}, {"user_id": 249382, "username": "Aberforth"}, {"user_id": 274590, "username": "SiTuM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 277988, "username": "dex"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Walking Wake": {
    "outdated": true,
    "sets": {
      "Wallbreaker": {
        "description": "<ul> <li>Walking Wake is one of the most dangerous sun wallbreakers in Ubers, capable of 2HKOing even the bulkiest of Water resists and special walls alike.</li> <li>Hydro Steam is Walking Wake's most spammable move; in sun, it 2HKOes Koraidon, OHKOes Flutter Mane, and 2HKOes Toxapex, making it very hard for teams to have a consistent switch-in to it.</li> <li>Dragon Pulse, albeit weaker than Draco Meteor, doesn't come with any drawbacks, making it a much better move to spam if lowering Walking Wake's Special Attack is not desired.</li> <li>Tera Water turns Walking Wake into an unwallable Pokemon, 2HKOing defensive walls like Blissey and OHKOing offensive pivots like Assault Vest Flutter Mane in sun. Tera Fairy can be used instead, as it gives Walking Wake useful resistances to Sucker Punch from Chien-Pao and Kingambit while also making it immune to Dragon-type attacks from Koraidon and Miraidon. Lastly, Tera Steel gives Walking Wake a resistance to Iron Bundle's Ice-type attacks, mainly Freeze Dry.</li> <li>A Modest nature lets Walking Wake wallbreak with extreme ease, allowing for Draco Meteor to 2HKO Clodsire in sun. Alternatively, a Timid nature gets the jump on Timid Chi-Yu and opposing Modest Walking Wake, although the difference in power is very noticeable.</li> <li>Walking Wake is best suited for offensive sun teams and should be used as such, making use of its unique typing to switch into Pokemon like Chi-Yu and counterattack with a nuclear Hydro Steam.</li> <li>Walking Wake is somewhat slow for Ubers standards, so fast partners like Choice Scarf Koraidon and Flutter Mane are a must to compensate for its Speed stat. Koraidon's sun also greatly powers up Walking Wake's attacks.</li> <li>Secondary wallbreakers such as Flutter Mane and Chi-Yu are also recommended, as Walking Wake's Speed hinders its performance as a standalone wallbreaker. Defensive teammates like Clodsire and Great Tusk are also helpful, as they check Miraidon, Flutter Mane, and Koraidon, respectively.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 306317, "username": "katerina"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 507268, "username": "ox04"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Ogerpon-Hearthflame": {"outdated": true, "sets": {"Swords Dance": {}}}
}