{
  "Quagsire": {"sets": [{"name": "Unaware Wall"}]},
  "Cinderace": {
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>With its high Attack and Speed stats, good coverage moves, and inability to be worn down by entry hazards thanks to Heavy-Duty Boots, Cinderace is a versatile pivot that is able to outspeed and offensively respond to various threats such as Latios and Clefable. Pyro Ball is Cinderace's main STAB move, allowing it to hit Steel-types such as Celesteela and Excadrill while also dealing significant damage to other defensive Pokemon such as Buzzwole and Amoonguss; it notably preserves Libero's type-changing ability in the process. U-turn, besides allowing Cinderace to maintain momentum by bringing in a teammate like Hydreigon, can also wear down defensive Pokemon such as Slowbro. Gunk Shot gives Cinderace useful coverage for Pokemon such as Tapu Fini and Mega Altaria, and it also lets Cinderace force out Calm Mind Clefable more reliably. Alternatively, High Jump Kick is an option to OHKO Mega Tyranitar and Hydreigon, as well as 2HKO physically defensive Ting-Lu, which U-turn cannot do. Sucker Punch lets Cinderace revenge kill chipped sweepers such as Agility Iron Moth and Z-Celebrate variants of Victini after their respective boosts while also threatening Choice Scarf users such as Blacephalon. Tera Fire is preferred to strengthen Pyro Ball's damage output against neutral targets, letting it OHKO offensive Pokemon such as Galarian Moltres after Stealth Rock and giving it favorable odds to 2HKO the likes of physically defensive Galarian Slowking and Iron Hands. Cinderace fits best on offensive teams that can supply it with the tools needed to break through defensive Pokemon; entry hazard setters such as Mega Tyranitar, Ting-Lu, and Iron Treads can support Cinderace in this manner, with Mega Tyranitar also being able to trap or force Slowbro and Skeledirge to Terastallize with Pursuit after Cinderace pivots against them. Similarly, defensive Pokemon such as Celesteela, Slowbro, and Tapu Fini appreciate Cinderace's ability to threaten out the likes of Aegislash, Meowscarada, and Scizor; in return, they can help sponge the Water- and Ground-type moves aimed at Cinderace or provide Future Sight or Taunt support in the case of the latter two. Powerful wallbreakers such as Latios and Gengar also appreciate the safe entry Cinderace can facilitate against most physically defensive Pokemon it commonly invites in on top of Cinderace being able to force out the Steel-types that would otherwise threaten them, like Aegislash and Scizor.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance turns Cinderace into a threatening wallbreaker, using its immense power to break through most defensive Pokemon that would otherwise switch into it comfortably. At +2, Breakneck Blitz manages to OHKO the likes of Slowbro and physically defensive Moltres after Libero, and it is also effective at nullifying the possibility of other walls like Buzzwole and Amoonguss Terastallizing against it. High Jump Kick is a necessary coverage option to let Cinderace reliably KO Mega Tyranitar and Ting-Lu. Cinderace fits best on hyper offense teams that benefit from its ability to break open defensive cores; as Cinderace is often revenge killed by faster Pokemon such as Sand Rush Excadrill and Choice Scarf Latias, other Pokemon that can take advantage of these revenge killers like Dragon Dance Gyarados, Swords Dance Scizor, and Air Balloon Aegislash become valuable teammates, as they also appreciate Cinderace's innate ability to threaten common walls such as Buzzwole and Skarmory. Mega Gyarados in particular helps overwhelm Unaware Clefable and Skeledirge for Cinderace, which would otherwise stop it from being able to safely set up against them. Cinderace also appreciates having dual screens support from Grimmsnarl to improve its setup opportunities, while anti-entry hazard options such as Excadrill and Iron Treads can help alleviate Cinderace's crippling Stealth Rock weakness.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  }
}