{
  "Syclant": {"sets": [{"name": "Offensive Pivot"}]},
  "Revenankh": {"sets": [{"name": "Bulk Up"}]},
  "Pyroak": {"sets": [{"name": "Contrary Tank"}]},
  "Fidgit": {"sets": [{"name": "Persistent"}]},
  "Stratagem": {"sets": [{"name": "Meteor Beam"}]},
  "Arghonaut": {"sets": [{"name": "Mixed Wall"}]},
  "Kitsunoh": {"sets": [{"name": "Utility"}]},
  "Cyclohm": {"sets": [{"name": "Physically Defensive"}]},
  "Colossoil": {"sets": [{"name": "Flame Orb"}]},
  "Krilowatt": {"sets": [{"name": "Offensive Pivot"}]},
  "Voodoom": {"sets": [{"name": "Choice Specs Pivot"}]},
  "Tomohawk": {"sets": [{"name": "Physical Wall"}, {"name": "HazeHawk"}]},
  "Necturna": {"sets": [{"name": "Shell Smash"}]},
  "Mollux": {"sets": [{"name": "Utility Wall"}]},
  "Aurumoth": {"sets": [{"name": "Nasty Plot"}]},
  "Malaconda": {"sets": [{"name": "Drought"}]},
  "Cawmodore": {"sets": [{"name": "Belly Drum"}]},
  "Volkraken": {"sets": [{"name": "Choiced Wallbreaker"}]},
  "Plasmanta": {"sets": [{"name": "Rain Wallbreaker"}]},
  "Naviathan": {"sets": [{"name": "Dragon Dance"}]},
  "Crucibelle": {"sets": [{"name": "Utility Pivot"}]},
  "Kerfluffle": {"sets": [{"name": "Valiant At Home"}]},
  "Pajantom": {"sets": [{"name": "Choice Band"}]},
  "Jumbao": {"sets": [{"name": "Drought Wallbreaker"}]},
  "Caribolt": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Grass-types</strong>: Grass-types like Jumbao, Pyroak, and Amoonguss wall Caribolt's STAB combination, forcing it out.</p> <p><strong>Faster Attackers: Before Caribolt uses Rapid Spin, Pokemon like Cinderace and Ice Beam Greninja can outspeed and OHKO it. Fast Dragon-types like Dragapult, Roaring Moon, and Astrolotl can switch in to check Caribolt once, but they cannot do so if Caribolt reaches both +1 Speed and +2 Attack.</p> <p><strong>Strong Priority Attacks: Strong priority attacks from Kingambit, Dragonite, and Revenankh can circumvent Caribolt's Speed boosts and KO it after it has taken some chip damage from Double-Edge.</p> ",
    "sets": [
      {
        "name": "talahbolt (Swords Dance)",
        "description": "<h1>Set Details</h1> <p>Caribolt is a nuclear wallbreaker for offensive teams. Double-Edge with Galvanize can break through even the tier's most stalwart walls, 2HKOing Pokemon like Skeledirge and Garganacl with ease, especially once Caribolt Terastallizes. Horn Leech provides some modicum of recovery to compensate for Double-Edge's recoil. Rapid Spin both increases Caribolt's Speed, giving it sweeping potential, and supports teammates weak to Stealth Rock like Baxcalibur and Iron Moth, allowing them to forego Heavy-Duty Boots. Leftovers helps make up for Double-Edge's recoil alongside Horn Leech, while Magnet powers up Caribolt's Electric-type attacks even further. A Jolly nature is preferred to outspeed Choice Scarf Jumbao at +1 Speed and Krilowatt at +0, but Adamant is an option to deal as much damage as possible, supporting its hyper offense teammates. Tera Grass is an option to turn Ground-types like Equilibra and Great Tusk into setup fodder, but Caribolt's main focus should be on wallbreaking as much as possible for its teammates.</p> <p>Caribolt is best utilized on hyper offense teams, which appreciate its incredible wallbreaking ability. Stealth Rock-weak Pokemon like Iron Moth, Baxcalibur, and Venomicon-E appreciate Caribolt removing the hazard, allowing Iron Moth and Baxcalibur to run more offensive items over Heavy-Duty Boots. Other physical sweepers like Dragon Dance Roaring Moon and Dragonite love Caribolt powering through Unaware walls like Skeledirge and Arghonaut; Roaring Moon pairs particularly well with Caribolt, as it can threaten the Grass-types like Jumbao and Amoonguss that give Caribolt trouble with Tera Flying + Acrobatics. This love is shared by special sweepers like Iron Valiant and Hatterene, which need Skeledirge off the table before attempting a sweep. Caribolt appreciates entry hazards weakening physically bulky Ground-types like Great Tusk and Ting-Lu—which can beat Caribolt if it Terastallizes—into KO range of its attacks, so pairing it with a dedicated lead like Orthworm, Greninja, or Meowscarada is suggested.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "dex", "user_id": 277988}], "teams": [{"name": "Quality checked by", "members": [{"username": "snake", "user_id": 227784}, {"username": "spoo", "user_id": 251944}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Smokomodo": {"sets": [{"name": "Bone Zone"}]},
  "Snaelstrom": {"sets": [{"name": "Bulky Swords Dance"}]},
  "Equilibra": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Water-types</strong>: Rotom-W hard counters Equilibra, as it takes negligible damage from any of Equilibra's moves and threatens it with Hydro Pump. Arghonaut similarly brushes off Equilibra's attacks and threatens to cripple it with Knock Off. Greninja and Krilowatt can switch in on Flash Cannon and threaten to deal significant damage to Equilibra, but they are 2HKOed by Earth Power.</p> <p><strong>Bulky Flying-types: Bulky Flying-types such as Corviknight, Venomicon, and Tomohawk give Equilibra trouble, as they don’t take much damage from Equilibra's moves and force it out with super effective attacks.</p> <p><strong>Ground-types: Offensive Great Tusk sets OHKO Equilibra with Close Combat, while defensive sets can either deal significant damage with Body Press or cripple it with Knock Off. Other bulky Ground-types such as Ting-Lu and Clodsire are easily capable of dealing with Bulletproof Equilibra, but it has little to fear from them if it forgoes Bulletproof for Levitate.</p> <p><strong>Item Manipulation: Equilibra heavily relies on the passive recovery granted by Leftovers, so it must be careful when switching in on Pokemon with Knock Off or Trick, such as Iron Treads and Gholdengo, so as not to risk taking a significant blow to its longevity.</p> ",
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<h1>Set Details</h1> <p>Equilibra's solid typing, great stats, and access to Rapid Spin make it one of the premier defensive pivots and entry hazard removers in the metagame. Bulletproof is the recommended ability, as it blocks Focus Blast from Pokemon such as Gholdengo and Jumbao and Shadow Ball from Ghost-types such as Dragapult and Hisuian Zoroark. Alternatively, Levitate drastically improves Equilibra's matchups against opposing Ground-types, such as Clodsire and Garchomp, while also presenting more opportunities to clear entry hazards without worrying about taking Spikes damage. Protect allows Equilibra to scout the foe's moves and get additional healing from Leftovers, while Pain Split gives it an alternative form of recovery, lowering its reliance on Leftovers. Alternatively, Aura Sphere allows Equilibra to beat opposing Levitate Equilibra and improves its matchup against Dark-types such as Roaring Moon and Colossoil. The given EV spread allows Equilibra to avoid an OHKO from Choice Specs Greninja's Hydro Pump, survive the combination of Moonblast into Close Combat from mixed Tera Fairy Iron Valiant, and outspeed Adamant Breloom after getting a Speed boost from Rapid Spin. Tera Flying flips Equilibra's matchups against Fighting-types such as Great Tusk and Breloom on their heads while allowing Bulletproof Equilibra to safely stay in against opposing Ground-types. Alternatively, Tera Water allows Equilibra to check Fire-types such as Iron Moth, Astrolotl, Skeledirge, and Volcarona.</p> <p>Equilibra struggles against Water- and Flying-types, so Electric-types such as Caribolt, Iron Hands, and Plasmanta make for great partners. Water-types such as Arghonaut and Rotom-W synergize well with Equilibra, since they can switch in on Fire-type attacks aimed at it; they, in turn, appreciate Equilibra's ability to absorb Electric-type attacks and pressure Jumbao, one of their greatest threats. Venomicon is one of the best defensive partners for Equilibra, since it walls many of the Fighting- and Ground-types that Equilibra struggles against such as Great Tusk; in return, Equilibra deals with Pokemon that Venomicon struggles against, such as Stratagem and Hatterene. Equilibra relies heavily on Leftovers for recovery, so it appreciates support from teammates that don't mind taking Knock Off, like Corviknight and Toxapex. Thanks to Equilibra's ability to consistently keep entry hazards off the field, it works well with teammates that are worn down by them, such as Snaelstrom, Iron Moth, and Loaded Dice Baxcalibur.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Da Pizza Man", "user_id": 221710}], "teams": [{"name": "Quality checked by", "members": [{"username": "Lasen", "user_id": 273339}, {"username": "quziel", "user_id": 297859}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}, {"username": "Rabia", "user_id": 336073}]}]}
  },
  "Astrolotl": {"sets": [{"name": "Offensive Utility"}]},
  "Miasmaw": {"sets": [{"name": "Swords Dance"}]},
  "Chromera": {"sets": [{"name": "Choice Specs"}]},
  "Venomicon": {"sets": [{"name": "Book"}, {"name": "Utility Wall"}]},
  "Venomicon-Epilogue": {"sets": [{"name": "E-Book"}, {"name": "Stealth Rock Pivot"}]},
  "Saharaja": {"sets": [{"name": "Standard Camel"}]}
}