{
  "Venusaur": {"sets": {"Custap Berry": {}}},
  "Ninetales-Alola": {"sets": {"Encore + Disable": {}, "Sitrus Berry": {}, "Life Orb": {}}},
  "Muk-Alola": {"sets": {"AV": {}}},
  "Zapdos": {"sets": {"Clear Amulet": {}, "Life Orb": {}, "Pressure Stall": {}, "Choice Specs": {}}},
  "Zapdos-Galar": {"sets": {"Choice Band": {}}},
  "Moltres-Galar": {"sets": {"Custap Berry": {}, "Weakness Policy": {}, "Assault Vest": {}}},
  "Azumarill": {"sets": {"Life Orb": {}, "Kebia Berry": {}, "Choice Band": {}, "AV": {}, "Stall": {"description": "<ul> <li>Chilling Water allows Azumarill to chip the foe down while reducing their Attack, giving it better chances versus Taunt Great Tusk.</li> <li>Sap Sipper lures in Grass-types such as most offensive Choice Band Meowscarada.</li> <li>The HP, Special Defense investment, and Calm nature allow Azumarill to defeat Timid Choice Specs Iron Valiant most of the time.</li> <li>Use Charm or Amnesia to lower the foe's damage output until Azumarill is forced to use Rest.</li> </ul>"}}},
  "Scizor": {"sets": {"Life Orb": {}}},
  "Donphan": {"sets": {"Choice Band": {}}},
  "Tyranitar": {"sets": {"Choice Band": {}}},
  "Swampert": {"sets": {"Assault Vest": {}}},
  "Salamence": {"sets": {"Life Orb": {}}},
  "Metagross": {
    "sets": {
      "Weakness Policy": {
        "description": "<ul> <li>Heavy Slam is for Fairy-types like Iron Valiant and Whimsicott as well as light Pokemon such as Meowscarada and Porygon-Z.</li> <li>Meteor Mash can be used for consistent damage, being particularly useful against heavy Rock- and Ice-type Pokemon</li> <li>Bullet Punch is useful for securing KOs on faster Pokemon, Encore + Disable Pokemon such as Iron Valiant and Alolan Ninetales, and pinch Berry users such as Sneasler.</li> <li>Earthquake is for Hisuian Goodra and Metagross mirror matchups.</li> <li>Psychic Fangs is for Pecharunt and some Urshifu-R sets. It also helps break Reflect from Pokemon like Primarina and Kyurem.</li> <li>Hone Claws allows Metagross to set up against Counter users like Hisuian Goodra, which cannot be OHKOed by Metagross's Earthquake, allowing it to OHKO Hisuian Goodra with +1 Earthquake.</li> <li>The bulk EVs let Metagross survive Modest Choice Specs Kyurem's Earth Power and Adamant Choice Band Haxorus's Earthquake. The rest of the EVs are put into Attack for more Regidrago reliability.</li> <li>If Metagross is not running Hone Claws to set up Attack against Counter Hisuian Goodra, it can chip away at Hisuian Goodra's HP with Bullet Punch, since Counter won't do much, then it can KO Hisuian Goodra when it's in Earthquake's KO range.</li> <li>Since Metagross is weak to Fire-, Dark-, and Ground-type moves, a Water- or Fairy-type Pokemon like Manaphy or Primarina makes a good teammate.</li> </ul>"
      },
      "Assault Vest": {
        "description": "<ul> <li>Heavy Slam is for Primarina, Iron Valiant, and Sylveon.</li> <li>Bullet Punch lets Metagross deal with Encore + Disable Iron Valiant and KO Haxorus and Custap or Sitrus Berry Primarina after Heavy Slam.</li> <li>Earthquake beats Iron Crown and is the best option Raging Bolt.</li> <li>Psychic Fangs gives Metagross a better matchup against Pecharunt and Reflect Primarina, while Ice Punch gives Metagross the best odds against non-Choice Band Regidrago, Assault Vest Landorus-T, and Life Orb Landorus.</li> <li>The HP and Defense EVs allow Metagross to survive Knock Off from Jolly Choice Band Meowscarada. The Special Defense EVs allow Metagross to take 2 Thunderbolts from Booster Energy Raging Bolt. The remaining EVs are put into Attack to maximize odds against Choice Band Earthquake Haxorus.</li> <li>Assault Vest Metagross has the most reliable matchups of any Metagross set against Regidrago and Primarina. It is important to note that Choice Band Regidrago can 2HKO Metagross with Earthquake before Metagross can with Ice Punch, so it is recommended to run a partner that can deal with that set.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Heavy Slam is used to defeat non-Custap Berry Primarina, while Meteor Mash allows Metagross to beat Kyurem. Both moves do well into Sylveon, Porygon-Z, and Azumarill.</li> <li>Psychic Fangs is for Pecharunt and Iron Hands.</li> <li>Bullet Punch targets Iron Valiant and Alolan Ninetales.</li> <li>Earthquake hits Iron Crown, Hisuian Goodra, Registeel, and has favorable odds to beat most Raging Bolt sets.</li> <li>The HP investment allows Metagross to survive Earthquake from Choice Band Iron Hands, while the Special Defense EVs allow it to survive Dark Pulse from Choice Specs Porygon-Z. The Attack EVs and an Adamant nature allow it to beat Encore + Disable Iron Valiant due to Struggle 2HKOing after a Bullet Punch.</li> <li>An alternative EV spread of 232 HP / 236 Atk / 40 Def can be used to survive Focus Blast from Timid Choice Specs Iron Valiant and Earthquake from Choice Band Haxorus. The remaining EVs are put in Attack for maximum damage output.</li> <li>Choice Band Metagross should almost always use the move that does the most damage to an opposing Pokemon. Notable exceptions to this rule are Alolan Ninetales and Iron Valiant, as Bullet Punch allows Metagross to beat Encore + Disable variants of these Pokemon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 568493, "username": "ZackPalace"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 563325, "username": "delemon"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}, {"user_id": 500233, "username": "RTM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Registeel": {"sets": {"Specially Defensive": {}, "Defensive": {}}},
  "Garchomp": {"sets": {"Haban Berry": {}}},
  "Rhyperior": {"sets": {"Choice Band": {}, "Custap Berry": {}, "Assault Vest": {}}},
  "Porygon-Z": {"sets": {"Fast Choice Specs": {}, "Bulky Choice Specs": {}, "Life Orb": {}, "Choice Scarf": {}, "Custap Berry": {}}},
  "Cresselia": {"sets": {"Clear Amulet": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Manaphy": {"sets": {"Fast Stall": {}, "Sitrus Berry": {}, "Clear Amulet": {}}},
  "Darkrai": {"sets": {"Choice Scarf": {}, "Choice Specs": {}}},
  "Serperior": {"sets": {"Subseed": {}, "Assault Vest": {}}},
  "Whimsicott": {"sets": {"Babiri Berry": {}, "Occa Berry": {}, "Kebia Berry": {}}},
  "Haxorus": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Roseli Berry": {}, "Rocky Helmet": {}}},
  "Volcarona": {"sets": {"Life Orb": {}, "Chilan Berry": {}}},
  "Landorus-Therian": {"sets": {"Choice Band": {}, "Life Orb": {}, "Assault Vest": {}}},
  "Kyurem": {"sets": {"Choice Specs": {}, "Anti-Porygon-Z": {}, "Haban Berry": {}, "Choice Scarf": {}, "Weakness Policy": {}, "Assault Vest": {}}},
  "Greninja": {"sets": {"Life Orb": {}}},
  "Sylveon": {"sets": {"Life Orb": {}, "Custap Berry": {}, "Weakness Policy": {}, "Babiri Berry": {}}},
  "Goodra-Hisui": {"sets": {"Chople Berry": {}}},
  "Diancie": {"sets": {"Weakness Policy": {}, "Choice Specs": {}}},
  "Hoopa-Unbound": {
    "sets": {
      "Choice Band": {},
      "Bulky Choice Band": {},
      "Fast Choice Specs": {},
      "Bulky Choice Specs": {},
      "Choice Scarf": {"description": "<ul> <li>Hyperspace Fury should be used against Cresselia, Dragapult, Serperior, and Pecharunt.</li> <li>Gunk Shot is for non-defensive Ogerpon-W and Meowscarada.</li> <li>Focus Blast is for Chien-Pao and Porygon-Z.</li> <li>Thunderbolt is for non-Maranga Berry Corviknight, while Rock Tomb is for non-bulky Volcarona.</li> <li>The HP and Special Defense EVs let Hoopa-U survive Timid Choice Scarf Porygon-Z's Hyper Beam. Maximum Speed EVs and a Jolly nature allow Hoopa-U to outspeed Modest Choice Scarf Porygon-Z and Dragapult and Speed tie opposing Choice Scarf Hoopa-U. The remaining EVs are in Attack.</li> <li>Hoopa-U should use the strongest move it has in most cases. Other cases include trying to outplay a potential Custap Berry foe like Custap Berry Porygon-Z, picking a more accurate move in case two moves can KO, and using Hyperspace Fury to bypass Substitute and Protect.</li> </ul>"},
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest Hoopa-U is a strong check to powerful special attackers like Porygon-Z and Volcanion.</li> <li>Psychic Noise deals strong damage to Fighting-types like Iron Valiant, as well as threatening victories against Pokemon that make use of their recovery to win battles, such as stall Azumarill and Pecharunt.</li> <li>Knock Off allows Hoopa-U to damage other Psychic-types like Cresselia and Iron Crown while removing important items like Custap Berry from Sylveon and Life Orb from Porygon-Z that could otherwise threaten Hoopa-U's ability to win the matchup.</li> <li>Gunk Shot threatens KOs against Fairy-type Pokemon like Primarina and Sylveon.</li> <li>Drain Punch is used to defeat various Pokemon that Hoopa-U may want to recover HP from, such as non-Chople Berry Hisuian Goodra and Porygon-Z.</li> <li>The HP and Special Defense EVs are used to bulk +2 Life Orb Porygon-Z's Hyper Beam after Knock Off, and the Speed EVs outspeed neutral-natured maximum investment base 50 speed Pokemon like Donphan. The rest of the EVs are dumped into Attack.</li> <li>This set aims to act as a blanket check to many special attackers in the tier, such as Primarina and Porygon-Z. However, Assault Vest Hoopa-U may lack the immediate fire power to deal enough damage to Pokemon like Corviknight or have enough Speed to defeat other Pokemon like faster Hoopa-U.</li> </ul>"
      },
      "Custap Berry": {
        "description": "<ul> <li>Psychic hits Poison-types like Pecharunt and Fighting-types like Urshifu-R, while Hyperspace Fury hits foes like Dragapult and Skeledirge.</li> <li>Hyperspace Fury is useful because it ignores Spiky Shield from Ogerpon-W and Protect from other Custap Berry Pokemon.</li> <li>Gunk Shot helps against Grass-types like Leech Seed Ogerpon-W and Whimsicott. It can also reliably hit Dark-types like Darkrai.</li> <li>The HP and Defense investment helps Hoopa-U survive a Play Rough from Ogerpon-W, and the Speed EVs let it outspeed Donphan, but be careful because it has a chance to OHKO Hoopa-U with Earthquake. The remaining EVs are in Attack for maximum damage.</li> <li>Against SubSeed Ogerpon-W, always use Gunk Shot until it is in range of Hyperspace Fury.</li> <li>Pair Hoopa-U with something that can win against bulky Steel-types like Corviknight, Hisuian Goodra, and Registeel because Hyperspace Fury doesn't do enough damage, and they can KO it in return or use Iron Defense. Some good Pokemon for role that are Smack Down Landorus, Ursaluna-B, and Volcarona.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 149971, "username": "Nuxl"}, {"user_id": 555423, "username": "Akeras"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}, {"user_id": 316445, "username": "lost heros"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Volcanion": {"sets": {"Assault Vest": {}, "Anti-Archaludon": {}, "Choice Specs": {}, "Specially Defensive": {}, "Choice Scarf": {}}},
  "Primarina": {
    "sets": {
      "Weakness Policy": {
        "description": "<ul> <li>Primarina is one of the strongest Pokemon in 1v1 thanks to its unique typing, important role compression, and variety of sets.</li> <li>The combination of Weakness Policy and Charm or Reflect allows Primarina to take care of slower threats that aim to defeat it with their super effective moves, such as Iron Hands with Supercell Slam and Donphan and Ursaluna with Gunk Shot.</li> <li>Charm can work multiple times, which can help if Primarina is trying to stall a foe or to get to Torrent range to fire off an extremely strong Hydro Cannon, while Reflect can take care of Clear Amulet Pokemon, an item these Pokemon can run to be a hard counter to the Charm variant.</li> <li>Hydro Cannon can KO Ursaluna and Donphan after a boost from Weakness Policy on the former and a Draining Kiss on the latter.</li> <li>Draining Kiss and Moonblast can threaten Regidrago and both Urshifu formes, and while Draining Kiss is especially helpful for the Donphan matchup, Moonblast can also be utilized for overall damage against Haxorus and Gouging Fire.</li> <li>Calm Mind lets it set up in front of potential threats like Clear Amulet Cresselia.</li> <li>Thanks to its huge investment in Speed, Primarina can outrun Ursaluna, Iron Hands, and Donphan while threatening KOs in return, with its Defense and HP maximized for the best rolls against Choice Band Haxorus and Gouging Fire.</li> <li>Primarina should be used in teams where its weaknesses to Grass, Electric, and Poison are patched up, so it really likes pairing with Dragon-types like Regidrago and Gouging Fire, Steel-types like Corviknight and Hisuian Goodra, or Psychic-types like Hoopa-U and Iron Crown.</li> </ul>"
      },
      "Custap Berry": {
        "description": "<ul> <li>Custap Berry Primarina looks to flip matchups it usually loses, like Choice Specs Kyurem, and provide reliability against Landorus-T; it achieves this by surviving attacks it would normally be OHKOed by with Endure, moving first on the second turn with Custap Berry, and firing back with its extremely strong attacks.</li> <li>Hydro Cannon can hit both Ursaluna formes, Skeledirge, and Great Tusk, and it's boosted by Torrent if Primarina is at or below 1/3rd of its maximum HP, which is often reached when Primarina loses enough health for Custap Berry to activate the following turn, allowing it to outspeed and wash out these Pokemon with little issue.</li> <li>Moonblast hits Haxorus, Iron Valiant, Regidrago, and both Urshifu formes.</li> <li>Encore helps against Pokemon that attempt to set up on or attack Primarina like non-Choice Scarf or Specs Porygon-Z and Weakness Policy Metagross, while Calm Mind helps it boost against the likes of Passho Berry Volcarona.</li> <li>Primarina's HP and Defense EVs help it survive a Timid Life Orb Landorus's Sludge Wave as well as an Adamant Choice Band Urshifu's Poison Jab, with the remaining EVs going into Special Attack.</li> <li>Primarina finds itself struggling against Grass-, Electric- and Poison-types like offensive Ogerpon-W, Raging Bolt, and Pecharunt, so it appreciates having partners that can deal with these threats like Gouging Fire, Hoopa-U, and Iron Crown.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>Hydro Cannon is Primarina's strongest attack and should be used against both Landorus formes, non-Custap Berry Skeledirge, and non-Substitute Volcarona.</li> <li>Moonblast defeats Regidrago, Haxorus, and Garchomp.</li> <li>Energy Ball should be used against Rhyperior and is Primarina's best way to deal with non-Sap Sipper Azumarill.</li> <li>Liquid Voice + Uproar makes Primarina defeat Registeel and gives it an option to defeat Custap Berry Skeledirge and Substitute Volcarona, while Psychic Noise + Torrent allows it to beat Whimsicott reliably. Torrent Primarina is also more consistent agaisnt bulkier Choice Specs Hoopa sets, as Moonblast does not always OHKO them.</li> <li>The HP and Defense EVs allow Primarina to survive Earthquake from Choice Band Landorus-T, while the Special Defense EVs allow it to survive Sludge Wave from Timid Choice Specs Landorus.</li> <li>Choice Specs Primarina, unlike other Primarina sets, loses to Encore + Disable Iron Valiant sets, so it is important to use a teammate that can defeat the aforementioned sets.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 536219, "username": "fruan"}, {"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}, {"user_id": 316445, "username": "lost heros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Rillaboom": {"sets": {"Life Orb": {}, "SubSeed": {}, "Specially Defensive SubSeed": {}, "Assault Vest": {}}},
  "Corviknight": {"sets": {"Maranga Berry": {}}},
  "Dragapult": {"sets": {"Choice Band": {}, "Choice Specs": {}}},
  "Urshifu": {"sets": {"Custap Berry": {}, "Assault Vest": {}, "Chople Berry": {}}},
  "Regidrago": {
    "sets": {
      "Assault Vest": {},
      "Haban Berry": {
        "description": "<ul> <li>This Regidrago set is made to counter some Dragon-type Pokemon such as opposing non-Choice Specs, Gouging Fire, and Raging Bolt, as Regidrago's Haban Berry allows it to take one Dragon-type move from these Pokemon before KOing them.</li> <li>Breaking Swipe has the advantage of lowering foes' Attack, which helps Regidrago against the likes of Iron Hands and Donphan. It should notably be used against Gouging Fire on the first turn.</li> <li>Outrage is Regidrago's strongest and most reliable physical attack, whereas Dragon Energy can hit slower Pokemon such as Ursaluna-B and Skeledirge very hard without lowering its Special Attack.</li> <li>Thanks to the EV spread, Regidrago is able to tank any hit from Timid Choice Specs Latios and Choice Band Dragapult, survive Adamant Attack Booster Energy Gouging Fire's Scale Shot with four hits, and outspeed every base 110 Speed Pokemon like Ogerpon-W, Latios, and Iron Moth at +1.</li> <li>Poison- and Steel-types such as Pecharunt, Metagross, and Iron Crown make great teammates, as they can beat Fairy-types like Primarina, Sylveon, and Iron Valiant, which completely wall Regidrago.</li> <li>Regidrago also appreciates pairing with Fire- and Ground-types such as Gouging Fire, Volcanion, and the Ursaluna formes to handle Steel-types like Corviknight, Metagross, and Iron Crown.</li> </ul>"
      },
      "Choice Scarf": {
        "description": "<ul> <li>Choice Scarf Regidrago can surprise many Pokemon that rely on their Speed to reliably beat it, such as Meowscarada and Chien-Pao.</li> <li>Outrage should be used on most targets, since it is the most reliable of its Dragon-type moves. Thanks to Dragon's Maw, it 2HKOes many neutral targets like Zapdos and OHKOes frail Pokemon like Meowscarada and Greninja.</li> <li>Draco Meteor helps against Pokemon like Chien-Pao and Great Tusk, whose much lower Special Defense can be exploited.</li> <li>Dragon Energy should only be used if it can cleanly OHKO a target&amp;emdash;such as against Choice Specs Darkrai&amp;emdash;because its high power can significantly decrease after being damaged. This means it should not use it against priority users like Ice Shard Chien-Pao or potentially faster Choice Scarf users like Hisuian Arcanine.</li> <li>Earthquake is Regidrago's only useful coverage move for this set, allowing it to OHKO non-Air Balloon Heatran and 2HKO Sturdy Magnezone.</li> <li>Maximum Speed investment gives the best chances in the mirror matchup, the 132 Attack EVs allow Regidrago to OHKO no bulk Volcarona, and the remaining EVs are put into Special Attack. This set uses a Naive nature because Regidrago is a mixed attacker, and a Defense-lowering nature would make Regidrago occasionally lose to Choice Band Ice Shard from Chien-Pao. The lost Special Defense is rarely relevant.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>Regidrago is one of the strongest attackers in the tier. Boosted by Choice Specs, it can demolish defensive threats such as Pecharunt and Cresselia.</li> <li>Dragon Energy has a whopping 150-Base Power if Regidrago is at full HP. This makes it its best option against Pokemon that normally wouldn't be fast enough to strike it first, such as non-Choice Scarf Cresselia and Ursaluna.</li> <li>Draco Meteor is great against Pokemon that are fast enough to hit Regidrago but aren't tanky enough to survive one attack from it such as both Urshifu formes and non-Endure Sneasler.</li> <li>Dragon Pulse has situational usage as a third Dragon-type STAB move without the drawbacks of the other two moves, and it is useful against Pokemon like Volcarona and SubSeed Ogerpon-W that may use Substitute on the first turn to anticipate Regidrago's Draco Meteor decreasing its Special Attack.</li> <li>Earth Power is Regidrago's best way to hit Steel-types such as non-Air Balloon Heatran and Metagross. However, Regidrago may fail to OHKO most Pokemon that resist its Dragon-type STAB moves, so good partners for it are ones that can handle Steel and Fairy-types, like Ursaluna, Metagross, and Corviknight.</li> <li>The Defense EVs allow Regidrago to bulk Adamant Choice Scarf Landorus-T's Outrage, allowing it to OHKO Landorus-T with Draco Meteor. Regidrago's Speed EVs are to maximize its ability to outspeed other base 80 Pokemon such as opposing Regidrago, and the rest of the EVs are placed in Special Attack.</li> <li>Compared to Regidrago's other sets, Choice Specs allows it to obtain a destructive level of power to blast through bulky Pokémon like Ursaluna and Cresselia. However, it does lose some matchups won by other sets such as Choice Scarf beating faster threats like Play Rough Meowscarada and Assault Vest having the bulk for strong special attacks like Choice Specs Porygon-Z's Hyper Beam, so teammates that can appropriately handle these situations such as Corviknight will help Choice Specs Regidrago flourish.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Outrage is the main attacking move of Regidrago, being able to OHKO threats like Hoopa-U and non-Haban Berry Raging Bolt.</li> <li>Scale Shot is useful to boost Speed and to break Substitute, especially in the Ogerpon-W and Serperior matchups.</li> <li>Earthquake hits foes like non-Air Balloon Heatran, Hisuian Arcanine, and Assault Vest or Choice Band Metagross. It also forces Tinkaton to run Air Balloon.</li> <li>For the 4th moveslot, Fire Fang is an option that helps against Corviknight without Iron Defense, Scizor, and Air Balloon Tinkaton. Regidrago can also use Hammer Arm for Air Balloon Heatran.</li> <li>The bulk EVs allow Regidrago to survive Choice Band Jolly Hoopa-U's attacks, and the Speed EVs are for better odds against opposing Regidrago.</li> <li>If the opposing team is using a Dragon-type without a Fairy- or Steel-type, then it is likely to be holding a Haban Berry. Regidrago can OHKO these Haban Berry Dragon-types such as opposing Regidrago, Raging Bolt, and Gouging Fire with at least four hits from Scale Shot.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 149971, "username": "Nuxl"}, {"user_id": 555423, "username": "Akeras"}, {"user_id": 661113, "username": "Valteyek"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 500233, "username": "RTM"}, {"user_id": 563650, "username": "bern"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 149971, "username": "Nuxl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Spectrier": {"sets": {"Life Orb": {}, "Choice Specs": {}, "Sitrus Berry + Disable": {}}},
  "Ursaluna": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Earthquake is for Raging Bolt, Gouging Fire, Iron Crown, and non-Air Balloon Pecharunt.</li> <li>Giga Impact is used for Choice Scarf Porygon-Z and non-Choice Band Azumarill.</li> <li>Avalanche targets Landorus, Landorus-T, and Garchomp.</li> <li>Gunk Shot is for Sylveon and Azumarill, while Low Kick is the best move against opposing Ursaluna, Ursaluna-B, and Air Balloon Heatran.</li> <li>Bulletproof helps against Choice Specs Iron Valiant and some Hoopa-U sets, while Guts helps against Will-O-Wisp users like Volcarona, Spectrier, and Weakness Policy + Will-O-Wisp Dragapult.</li> <li>The HP and Defense EVs allow Ursaluna to survive Hammer Arm from Choice Band Landorus-T, while the Special Defense EVs allow it to take Hyper Beam from Life Orb Sylveon. The remaining EVs are put in Attack.</li> <li>Choice Band Ursaluna should click the most damaging move against its foe unless multiple moves OHKO, in which case it is best to click the most accurate of said choices. Against Substitute users like Volcarona, it is usually better to use Earthquake to avoid a recharge turn with Giga Impact.</li> </ul>"
      },
      "Guts": {
        "description": "<ul> <li>With Guts, Ursaluna becomes an insanely threatening Pokemon capable of OHKOing a great portion of the metagame upon activation of its Flame Orb. Toxic Orb may alternatively be used to deal with Pokemon that learn Trick such as Cresselia.</li> <li>After being burned, Facade is able to muscle through Pokemon that would otherwise deal with Choice Band Ursaluna such as Kee Berry Cresselia and is capable of OHKOing many frail Pokemon such as Sylveon.</li> <li>Headlong Rush threatens KOs on Pokemon such as Gouging Fire and Pecharunt.</li> <li>Avalanche allows Ursaluna to respond to opposing Ground- and Dragon-type Pokemon that would get the first strike, being able to OHKO threats like Choice Band Landorus-T and Choice Scarf Haxorus.</li> <li>Swords Dance allows Ursaluna to boost itself in matchups where it cannot immediately threaten a KO, overwhelming threats that focus on boosting themselves such as Iron Crown.</li> <li>Taunt may be used to shut down matchups that could otherwise outplay Guts Ursaluna, such as against SubSeed Whimsicott.</li> <li>The bulk EVs are used to survive Modest Porygon-Z's Hyper Beam without a boosting item and Choice Band Landorus-T's Hammer Arm. The rest of the EVs maximize Ursaluna's Attack.</li> <li>While Guts Ursaluna has the ability to switch moves and disrupt defensive threats like Iron Crown, the lack of immediate firepower that Choice Band would grant can cause Ursaluna to lose some matchups like against Regidrago and slower non-Custap Berry Primarina.</li> </ul>"
      },
      "Assault Vest": {}
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 149971, "username": "Nuxl"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 563650, "username": "bern"}, {"user_id": 518399, "username": "Itchy"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Ursaluna-Bloodmoon": {"sets": {"Chople Berry": {}, "Choice Scarf": {}, "Assault Vest": {}}},
  "Meowscarada": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Choice Specs": {}}},
  "Skeledirge": {"sets": {"Custap Berry": {}, "Air Balloon": {}, "Maranga Berry": {}}},
  "Maushold-Four": {"sets": {"The Maus": {}}},
  "Bellibolt": {"sets": {"Custap Berry": {}, "Life Orb": {}}},
  "Tinkaton": {"sets": {"The Tink": {}}},
  "Annihilape": {"sets": {"Bulky Choice Band": {}, "Fast Choice Band": {}, "Fast Bulk Up": {}, "Defensive Bulk Up": {}, "Weakness Policy": {}}},
  "Great Tusk": {"sets": {"Choice Band": {}, "Bulky Choice Band": {}, "Booster Energy (Attack)": {}, "Choice Scarf": {}, "Booster Energy (Speed)": {}, "Custap Berry": {}, "Assault Vest": {}}},
  "Iron Hands": {"sets": {"Booster Energy (Attack)": {}, "Anti-Gouging Fire": {}}},
  "Iron Moth": {"sets": {"Power Herb": {}}},
  "Baxcalibur": {"sets": {"Fast Choice Band": {}, "Bulky Choice Band": {}, "Chople Berry": {}}},
  "Chien-Pao": {"sets": {"Choice Band": {}}},
  "Iron Valiant": {
    "sets": {
      "Encore + Disable": {
        "description": "<ul> <li>Iron Valiant's main attack is very interchangeable. Moonblast is the most reliable and is usually the one that works in the most matchups like opposing Iron Valiant and Walking Wake, while Low Kick is extremely helpful in the Gouging Fire matchup and can help it break through Steel-type Pokemon like Hisuian Goodra and Registeel, though, it's scared of Counter from the former.</li> <li>The Speed EVs allow it to outspeed Gouging Fire after a Dragon Dance, with the remaining EVs going into Defense so it can bulk physical hits and fire back with its Encore + Disable setup.</li> <li>To utilize Encore + Disable effectively, you usually have to use Protect on the first turn to scout the foe's first move. If you are certain it is a Choice-locked Pokemon, you can just use Disable on the second turn and force it to use Struggle, and if it utilizes a status move, you are free to use Encore on its move and attack with your main STAB move; otherwise, it is recommended to use Encore on the second turn to take a hit, then Protect on the third turn, then Disable on the fourth turn, and, once Encore is over, you use Encore again. This ensures 2 turns of Struggle from the foe, at which point Iron Valiant should be able to KO it. On more passive Pokemon that have moves that do little damage like Registeel, and in some rare cases like Gouging Fire if you only have Moonblast, it sometimes can be better to opt out of using Protect and just use your main attack.</li> <li>Iron Valiant fits best on teams that can cover their main weakness to Steel-type Pokemon; therefore, Fire-type Pokemon like Volcarona and Gouging Fire make great teammates. In return, Iron Valiant can handle threats like Choice Specs Greninja and Choice Band Ursaluna. Iron Valiant also appreciates Pecharunt and Hisuian Goodra being extremely consistent against Fairy-types, as these can easily deal with them while it deals with Ground-type Pokemon like Great Tusk and the previously mentioned Ursaluna.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>Moonblast and Focus Blast are Iron Valiant's main STAB moves, OHKOing targets that are weak to them such as non-Assault Vest Raging Bolt, both Urshifu formes, and Flame Orb Ursaluna.</li> <li>Thunderbolt's main use is to 2HKO Corviknight, which Iron Valiant's usual sets can't do much against, though it has to watch out for Expert Belt Corviknight.</li> <li>Iron Valiant's last move varies depending on what its team needs. Psyshock takes care of Iron Moth, while Icy Wind can usually beat both Landorus formes, though it has to watch out for Assault Vest Landorus-T with Fly.</li> <li>A Modest nature maximizes damage and ensures some OHKOs like non-Chople Berry Hisuian Goodra but for most matchups like non-bulky Ogerpon-W, Iron Moth, and non-Speed Booster Energy Walking Wake, it is better to run a Timid nature.</li> <li>Iron Valiant's HP and Special Defense EVs let it survive a Special Attack Booster Energy Raging Bolt's Thunderclap so it's safe to OHKO back with Moonblast, with the remaining EVs used on Speed and Special Attack to maximize its ability to outspeed and threaten frail threats.</li> <li>Iron Valiant really struggles to put a dent on Fairy-type Pokemon like Sylveon and Primarina, so Poison- and Steel-type Pokemon like Pecharunt and Hisuian Goodra can be really helpful to shut down these threats.</li> <li>Iron Valiant can struggle with Psychic-types like Iron Crown and Metagross, as it can't do much damage to them, so Dark-types like Meowscarada, Darkrai, and Hoopa-U work as good partners for it.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Spirit Break OHKOes Regidrago, Haxorus, Hoopa-U, and both Urshifu formes.</li> <li>Close Combat deals huge damage to non-Chople Berry Hisuian Goodra and Ursaluna, Registeel, Kyurem, non-Choice Scarf Porygon-Z, and non-Brave Bird or Iron Head Corviknight.</li> <li>Ice Punch lets Iron Valiant deal with both Landorus formes, though it has a chance of not beating Fly Landorus-T.</li> <li>Poison Jab helps against non-Kebia Berry Whimsicott and Serperior, while Liquidation can take care of frail and non-Passho Berry Volcarona.</li> <li>Iron Valiant struggles against Psychic- and Fairy-type Pokemon like Iron Crown, Metagross, Primarina, and Sylveon, so Pokemon like Hoopa-U, Darkrai, and Pecharunt are really helpful. In return, Iron Valiant can help them deal with Fighting- and Ground-type Pokemon like Iron Hands, Great Tusk, and Landorus.</li> <li>Iron Valiant also struggles to beat Water-type Pokemon like Manaphy, Azumarill, and bulky Ogerpon-W, so Pokemon like Zapdos and Raging Bolt can help with these threats, while Iron Valiant deals with the previously mentioned Ground-types along with Ice-type Pokemon like Chien-Pao and Kyurem.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 563325, "username": "delemon"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 652656, "username": "Gambit_Gamin"}]}]}
  },
  "Walking Wake": {"sets": {"Fast Booster Energy (Special Attack)": {}, "Breaking Swipe": {}, "Snarl": {}, "Booster Energy (Speed)": {}}},
  "Fezandipiti": {"sets": {"Life Orb": {}}},
  "Ogerpon-Wellspring": {
    "sets": {
      "Offensive": {},
      "Charm": {
        "description": "<ul> <li>Charm + Synthesis allows Ogerpon-W to outlast slower physical attackers like Haxorus and most Gouging Fire sets. Synthesis can also help defeat Draco Meteor users like Speed Booster Energy Walking Wake.</li> <li>Ivy Cudgel is a reliable Water-type STAB move used to chip down the likes of Metagross, Gouging Fire, and Skeledirge.</li> <li>Power Whip is used primarily to take down other Water-types, most notably Primarina and Urshifu-R.</li> <li>If some of these Pokemon are already well-covered by a partner, Encore is worth considering. Encore can foil the plans of some setup Pokemon, such as Swords Dance Iron Hands, that would otherwise outlast Charm and then KO Ogerpon-W. Encore also allows for it to break through some stall Pokemon, such as Reflect + Calm Mind Cresselia.</li> <li>152 Speed EVs and a Jolly nature allow Ogerpon-W to outspeed Haxorus and Urshifu. The defensive investment gives the best chances to survive a Close Combat from Choice Band Urshifu, allowing Ogerpon-W to be sent in against both of its formes without having to guess at Team Preview.</li> </ul>"
      },
      "Specially Defensive": {
        "description": "<ul> <li>Power Whip is for Primarina and non-Sap Sipper Azumarill and is the best option against non-Defense boosting natured Sylveon.</li> <li>Ivy Cudgel is for non-Passho Berry Volcarona and Rhyperior.</li> <li>Knock Off should be used against Spectrier and Porygon-Z.</li> <li>Superpower guarantees the matchup against both Hisuian Goodra and bulkier Porygon-Z sets after Knock Off, while Encore allows Ogerpon-W to defeat Pokemon like Registeel.</li> <li>The Speed EVs allow Ogerpon-W to outspeed non-Choice Scarf Porygon-Z, while the HP and Special Defense EVs give it the best roll to survive Hyper Beam from Modest Porygon-Z after Ogerpon-W's Knock Off.</li> <li>If Power Whip and another move both KO an opposing Pokemon, it is best to use the other move due to accuracy.</li> <li>Against slower Pokemon that attempt to stall out Ogerpon-W, Encore can be used to lock them into a status move.</li> <li>Knock Off can also be used in some matchups to remove an opposing Custap Berry on the turn that Pokemon like Custap Berry Sylveon use Endure.</li> </ul>"
      },
      "Leech Seed": {},
      "Defensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 493772, "username": "Lumii"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}, {"user_id": 316445, "username": "lost heros"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Hydrapple": {"sets": {"Haban Berry": {}, "Yache Berry": {}}},
  "Gouging Fire": {
    "sets": {
      "Fast Booster Energy (Attack)": {
        "description": "<ul> <li>Dragon Dance allows Gouging Fire to beat most Ogerpon-W sets, Darkrai, and Meowscarada by allowing it to outspeed and OHKO them.</li> <li>Flare Blitz is Gouging Fire's best option against Steel-types like Corviknight, Metagross, and Iron Crown as well as Grass-types like Serperior.</li> <li>Outrage allows Gouging Fire to beat Skeledirge, non-Choice Scarf Volcanion, non-Haban Berry Raging Bolt, and non-Haban Berry or non-Choice Scarf Regidrago.</li> <li>Burning Bulwark helps against non-Choice Band Haxorus and Custap Berry Sylveon, while Earthquake allows Gouging Fire to secure its matchup against non-Air Balloon Volcanion.</li> <li>Fast Booster Energy Gouging Fire sacrifices surviving hits from Pokemon like Sylveon in order to have better matchups against most Regidrago sets and opposing Gouging Fire. However, Haban Berry or Choice Scarf Regidrago and Haban Berry Gouging Fire can still win, so it is recommended to have secondary answers to deal with those sets on a team.</li> </ul>"
      },
      "Bulky Booster Energy (Attack)": {
        "description": "<ul> <li>Dragon Dance allows Gouging Fire to beat most Ogerpon-W sets by allowing it to outspeed and OHKO them.</li> <li>Flare Blitz is Gouging Fire's best option against Steel-types like Corviknight, Metagross, and Scizor as well as Grass-types like Serperior.</li> <li>Outrage allows Gouging Fire to beat Skeledirge, non-Choice Scarf Volcanion, non-Haban Berry Raging Bolt, and non-Custap Berry Hoopa-U.</li> <li>Burning Bulwark helps against Haxorus and Custap Berry Sylveon, while Earthquake allows Gouging Fire to secure its matchup against non-Air Balloon Volcanion.</li> <li>The HP EVs allow Gouging Fire to survive Earthquake from Choice Band Metagross, while the Special Defense EVs allow it to survive Hyper Beam from Life Orb Sylveon. The Speed EVs allow Gouging Fire to outspeed Ogerpon-W after using Dragon Dance. The rest of the EVs are put in Attack.</li> <li>Bulky Booster Energy Gouging Fire sacrifices matchups against some faster Pokemon like Regidrago to have a better matchup against bulkier Pokemon like Sylveon. It also can use Dragon Dance more effectively when bulky, as it is able to survive more hits.</li> <li>It is recommended to use Dragon Dance against Pokemon that get outsped by +1 Gouging Fire, such as Ogerpon-W.</li> <li>Against Encore + Disable Iron Valiant, it is recommended to use Dragon Dance on the first turn then use Flare Blitz on the second. If locked into Dragon Dance through Encore, Iron Valiant cannot KO Gouging Fire unless running Low Kick.</li> </ul>"
      },
      "Haban Berry": {
        "description": "<ul> <li>Haban Berry Gouging Fire's main purpose is to defeat other Dragon-types such as opposing Gouging Fire, non-Haban Berry Regidrago, and Haban Berry Raging Bolt, in addition to having a fantastic matchup into most Steel- and Grass-types of the tier.</li> <li>Flare Blitz hits Steel- and Grass-types like Corviknight, Metagross, Serperior, and non-Occa Berry Whimsicott.</li> <li>Outrage serves as an answer for Raging Bolt, opposing Gouging Fire, and non-Haban Berry Regidrago.</li> <li>Scale Shot, while defeating SubSeed Pokemon like Ogerpon-W, can also beat opposing Haban Berry Dragon-type Pokemon like opposing Gouging Fire. It's also useful for Dragon-types with Substitute like Speed Booster Energy Roaring Moon, but most of the time Scale Shot's Defense drop can be a cause for concern, so it's usually better to use Outrage unless necessary.</li> <li>Dragon Dance can be used to outspeed and KO most fast threats like Meowscarada and Greninja, while Burning Bulwark can deal with Choice Scarf Unnerve Haxorus.</li> <li>Its Speed EVs allow it to outspeed non-Choice Scarf Regidrago and Hoopa-U, with enough EVs in bulk to take a Dragon Energy from Modest Choice Scarf Regidrago and a three-hit Scale Shot from Choice Band Regidrago. The remaining EVs are invested in Attack.</li> <li>If the opposing Regidrago is supposedly a Choice Band set, Haban Berry Gouging Fire should always Dragon Dance the first turn, as three hits from Scale Shot fail to KO it. However, if Regidrago supposedly has a Haban Berry, it's better to use Scale Shot, as it can't outspeed Gouging Fire with its own Scale Shot, which can use Outrage on the following turn.</li> <li>Most Haban Berry Gouging Fire teams are built around the fact that Gouging Fire can beat Dragon-type Pokemon, so it usually doesn't need counters to them like Primarina and Iron Crown. However, it is still nice to have them so that they can deter the opponent from choosing those Pokemon if they ever become a problem.</li> <li>Haban Berry Gouging Fire lacks a lot of firepower, missing out on KOs its Booster Energy variant would otherwise get, like Iron Crown and Cresselia, so it prefers having partners that can deal with them, like Meowscarada and Hoopa-U.</li> </ul>"
      },
      "Clear Amulet": {
        "description": "<ul> <li>Clear Amulet Gouging Fire's objective is to surprise foes like Hisuian Goodra and Sylveon by using Noble Roar and being immune to their Acid Spray and Fake Tears's stat drops respectively in order to stall them out and finish them off with Flare Blitz in the long run.</li> <li>Morning Sun allows Gouging Fire to recover HP, thus giving it a chance to stall more effectively.</li> <li>Dragon Dance is used to boost up Flare Blitz so that it doesn't get damaged by Counter from Hisuian Goodra, while Outrage can deal with other matchups like Volcanion and Skeledirge.</li> <li>Its Speed EVs are made so that it can outspeed non-Choice Scarf Hoopa-U, with its bulk made for best rolls against Primarina.</li> <li>Clear Amulet Gouging Fire has a very different matchup spread from other Gouging Fire, since it can effectively beat important Fairy-type Pokemon like Primarina and Sylveon. It's immune to the Speed drop from Icy Wind and is not scared of Encore from the former, and it's completely immune to Fake Tears from the latter.</li> <li>It also effectively deals with Dragon-type Pokemon like Hisuian Goodra and Steel-type Pokemon like Metagross, though it mostly has to carry Dragon Dance for Metagross.</li> <li>Clear Amulet Gouging Fire, unlike its regular sets, is much worse off against Pecharunt and Iron Valiant, so it likes having teammates like Iron Crown.</li> <li>Unlike its regular Attack Booster Energy sets, Gouging Fire lacks a lot of firepower, so it can struggle to get past many walls like Iron Crown and Cresselia.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 518399, "username": "Itchy"}, {"user_id": 563650, "username": "bern"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 149971, "username": "Nuxl"}, {"user_id": 316445, "username": "lost heros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Raging Bolt": {
    "sets": {
      "Haban Berry": {
        "description": "<ul> <li>Thunderbolt is the main Electric-type STAB move, but Thunder makes Raging Bolt more reliable against Primarina, as Thunder can OHKO it, so you don't have to worry about potential Weakness Policy or Encore after using Calm Mind or Charge. Thunderbolt should be used when it does neutral or super effective damage against frailer foes like Primarina, Corviknight, and Metagross without an Assault Vest. Against foes that can survive Draco Meteor followed by Thunderclap like Hoopa-U and Urshifu-S, it is safer to use Thunderbolt or Thunder into Draco Meteor.</li> <li>Draco Meteor hits Electric-resistant foes like Rillaboom and should be used against bulkier foes like Hoopa-U, Skeledirge, and Gouging Fire. It also 2HKOes Unaware Skeledirge.</li> <li>Thunderclap is a priority move that helps to KO low HP Pokemon like non-Assault Vest Metagross after one use of Thunderbolt. Draco Meteor into Thunderclap does slightly more damage than Thunderbolt into Thunderclap against neutral targets, but Thunder into Thunderclap does more. Thunderclap also counters Custap Berry users like Primarina and Hoopa-U by attacking on the turn they use their Custap Berry.</li> <li>Calm Mind and Charge are both here to boost Raging Bolt's power and special bulk. Both moves especially help against Primarina, though Charge is more reliable against it and Calm Mind is useful in more matchups like against Rillaboom, Iron Hands, and Spectrier.</li> <li>Haban Berry allows Raging Bolt to win against Dragon-types such as Regidrago and Gouging Fire, as it can OHKO them after surviving a Dragon-type move. However, if those Dragon-types are holding a Haban Berry, Raging Bolt can't OHKO them and is 2HKOed back.</li> </ul>"
      },
      "Booster Energy (Special Attack)": {
        "description": "<ul> <li>Thunderbolt is Raging Bolt's most consistent STAB attack and beats Primarina, non-Assault Vest Metagross, and Volcanion.</li> <li>Draco Meteor is Raging Bolt's strongest STAB attack and should be used against Skeledirge.</li> <li>Thunderclap allows Raging Bolt to get KOs after using Thunderbolt and Draco Meteor and helps in matchups against some Hoopa-U sets as well as against Custap Berry users like Primarina and the Urshifu formes.</li> <li>Taunt allows Raging Bolt to beat Pecharunt and Ogerpon-W.</li> <li>The HP and Defense EVs allow Raging Bolt to survive the Choice Band Urshifu formes' Close Combat, while the Special Defense EVs allow it to survive Moonblast from Wacan Berry and Assault Vest Primarina. The Speed EVs allow Raging Bolt to outspeed Modest Primarina. The remaining EVs are put in Special Attack to maximize power for best odds against specially defensive Primarina.</li> <li>Draco Meteor into Thunderclap is stronger than Thunderbolt into Thunderclap, so in matchups where there is no recovery from the foe, such as against non-Sitrus Berry Annihilape, it is better to use Draco Meteor into Thunderclap.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 555423, "username": "Akeras"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 563650, "username": "bern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Iron Boulder": {"sets": {"Choice Band": {}, "Booster Energy (Speed)": {}}},
  "Iron Crown": {
    "sets": {
      "Fast Weakness Policy": {
        "description": "<ul> <li>Fast Weakness Policy Iron Crown aims to switch up otherwise disadvantageous matchups such as Haxorus as well as Choice Band Ground-types such as Landorus-T by boosting itself with Iron Defense, then obtaining a Weakness Policy boost to threaten an OHKO on the next turn with Stored Power.</li> <li>Tachyon Cutter is Iron Crown's best Steel-type STAB move, being able to immediately pressure Fairy-Type Pokemon such as Iron Valiant and Sylveon. Tachyon Cutter has other niches in breaking foes' Substitute, such as against SubSeed Ogerpon-W and Serperior.</li> <li>Upon activation of Weakness Policy, Stored Power's Base Power increases by 80. Combined with any prior boosts Iron Crown may have obtained, this makes Stored Power its strongest Psychic-type STAB option.</li> <li>Psyshock can be used to disrupt the matchup versus other Calm Mind users that resist Stored Power such as opposing Iron Crown and Cresselia, albeit using Psyshock may miss out on important KOs that Stored Power would otherwise obtain.</li> <li>Psychic Noise may be used to prevent recovery moves from Pokemon such as Cresselia that would otherwise be able to deal with Iron Crown. Psychic Noise also deals additional damage to Iron Valiant and Alolan Ninetales compared to Iron Crown's other Psychic-type options.</li> <li>Calm Mind is used in matchups versus special attacking Pokemon such as Primarina and Cresselia in order to boost up Iron Crown's Special Attack and Special Defense to a point where it does not take much damage from their attacks while threatening KOs with Tachyon Cutter and Stored Power.</li> <li>The EVs are used to outspeed maximum Speed Haxorus and to tie the mirror matchup versus opposing Iron Crown. The bulk is meant to tank an Adamant Choice Band Great Tusk Headlong Rush after one Iron Defense.</li> <li>An alternative EV spread of 96 HP / 112 Def / 48 SpA / 252 Spe with a Timid Nature can be used to have a slightly better chance against Donphan with Tachyon Cutter after a Weakness Policy boost while still surviving Choice Band Great Tusk's Headlong Rush.</li> </ul>"
      },
      "Defensive Weakness Policy": {
        "description": "<ul> <li>Defensive Weakness Policy Iron Crown uses Iron Defense and Calm Mind to boost its defenses to survive strong hits and KO back with Weakness Policy-boosted Stored Power.</li> <li>Stored Power obtains a massive boost in Base Power when combined with Weakness Policy and stat-boosting moves.</li> <li>Alternatively, Psyshock can be used for matchups Pokemon that have enough Special Defense to not be threatened by Stored Power, such as Cresselia and Pokemon that Iron Crown can't boost in front of like Iron Valiant..</li> <li>Tachyon Cutter is hits Fairy-types such as Sylveon and Iron Valiant, and can break Substitute from Pokemon such as Serperior.</li> <li>Calm Mind is used for matchups where boosting Special Attack and Special Defense is necessary, such as against Assault Vest Ursaluna-B.</li> <li>The HP and Defense EVs allow Iron Crown to have a 75% chance to survive Adamant Choice Band Meowscarada's Knock Off in order to kill it with +2 Tachyon Cutter, as well as having favorable rolls to survive two Choice Band Ursaluna's Earthquake to boost with Iron Defense up to +4 and KO with Stored Power. The remaining EVs are placed in Speed for the mirror matchup and to base 50 speed Pokemon such as Ursaluna.</li> <li>36 Speed EVs can be used instead to outspeed Max Speed Primarina.</li> <li>While this set is able to bulk many attacks, it is notably slower than faster Choice Band users like Landorus-T, making Defensive Iron Crown lose the matchup against them. Faster teammates that can deal with these Pokemon are ideal, such as attackers like Meowscarada.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 149971, "username": "Nuxl"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 563650, "username": "bern"}, {"user_id": 481149, "username": "bea"}, {"user_id": 500233, "username": "RTM"}, {"user_id": 316445, "username": "lost heros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Pecharunt": {
    "sets": {
      "Air Balloon": {},
      "Leftovers": {
        "description": "<ul> <li>Malignant Chain can seriously threaten Iron Valiant and Ogerpon-W. It also has the added bonus of having a high chance of poisoning which can wear down bulky Pokemon without relying on Curse, and it can also trigger Poison Puppeteer to provide decent odds to win otherwise losing matches with confusion.</li> <li>Curse lets Pecharunt whittle down any foe behind Substitute regardless of typing, including Body Press Corviknight, Registeel, and SubSeed Ogerpon-W.</li> <li>The combination of Parting Shot and Recover lets Pecharunt neutralize virtually all non-Taunt, neutrally effective attackers like Gouging Fire, non-Choice Specs Primarina, and Choice Scarf Haxorus while keeping Pecharunt healthy.</li> <li>The Speed investment lets Pecharunt outspeed Body Press and PP stall Corviknight. The remaining EVs are in HP and Special Defense for overall bulk.</li> <li>Leftovers provides consistent healing in every matchup but also lets Pecharunt avoid being PP stalled by Taunt + Body Press Corviknight. Leftovers is also chosen over Black Sludge to continue to provide healing after a Soak from Bellibolt.</li> <li>Against most Pokemon, Parting Shot should be used early to mitigate damage. Even against Encore Primarina, as after a few Parting Shots, Primarina won't be able to do substantial damage and Pecharunt will PP stall Encore out.</li> <li>Against SubSeed Ogerpon-W, Curse shouldn't be used until after Parting Shot has been used to minimize the damage from Ivy Cudgel so that Curse can be used safely.</li> <li>Against Volcarona and other Pokemon that may be able to OHKO Pecharunt, it's better to use Malignant Chain instead and play for a confusion from Poison Puppeteer.</li> </ul>"
      },
      "Maranga Berry": {
        "description": "<ul> <li>This Pecharunt set searches to maximize its weak Special Defense to wall common threats such as Choice Scarf Regidrago and Choice Specs users like Kyurem and Raging Bolt while still dealing with other common threats like Ogerpon-W and Primarina.</li> <li>Malignant Chain threatens all sorts of Fairy- and Grass-type Pokemon like Serperior, Whimsicott, and Sylveon, with the chance of badly poisoning the target being a huge threat for any Pokemon.</li> <li>Curse helps Pecharunt to not get walled by the likes of Registeel, as it often struggles to deal with Steel-types on its own while also helping against Pokemon that set up Substitute like Ogerpon-W and Gouging Fire.</li> <li>Parting Shot helps it deal with special attackers like the previously mentioned Choice Scarf Regidrago and Choice Specs Kyurem while also helping it against physical attackers like Gouging Fire.</li> <li>Recover is a great tool that helps it do everything that was previously mentioned with great longevity. It also helps when it needs to activate Maranga Berry on the first turn when the opposing Pokemon deals too much damage pre-Maranga Berry boost like Choice Scarf Regidrago and Special Attack Booster Energy Raging Bolt.</li> <li>Its Speed EVs are meant to let it outspeed Modest Primarina, while the HP and Special Defense EVs help against Choice Scarf Regidrago.</li> <li>Pecharunt is usually found on teams that value its defensive capabilities, stalling potential, and Poison typing, so it's usually paired with offensive Pokemon like Gouging Fire, Ogerpon-W, and both Urshifu formes.</li> </ul>"
      },
      "Clear Amulet": {
        "description": "<ul> <li>This Pecharunt set makes the best out of its combination of Parting Shot and Clear Amulet to wall any Pokemon with moves that can drop stats, like Fake Tears Sylveon, Acid Spray Hisuian Goodra, and Icy Wind Primarina while still dealing with other common threats like Ogerpon-W.</li> <li>Malignant Chain is capable of threatening Grass- and Fairy-type Pokémon like Ogerpon-W, Whimsicott, and Sylveon, with the 50% chance to badly poison the target being able to work on all sorts of Pokemon when combined with Poison Puppeteer's confusion.</li> <li>Curse helps Pecharunt beat Hisuian Goodra, the common Registeel, and Substitute users like Ogerpon-W and Gouging Fire.</li> <li>Parting Shot helps Pecharunt deal with special attackers like the previously mentioned Hisuian Goodra, Sylveon, and Primarina without fearing Encore from the last one while also helping it against physical attackers like non-Clear Amulet Gouging Fire.</li> <li>Recover is an important tool that helps Pecharunt do everything that was previously mentioned with great consistency.</li> <li>Pecharunt's Speed EVs outspeed Modest Primarina, while the HP and Special Defense EVs help against Choice Scarf Regidrago.</li> <li>Pecharunt is mostly found in teams that value its stalling prowess and important Poison typing, which helps it deal with Fairy-type Pokemon, so it's usually paired with offensive Pokemon like Gouging Fire, Hoopa-U, and Primarina.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 316445, "username": "lost heros"}, {"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 316445, "username": "lost heros"}]}, {"name": "Quality checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 563650, "username": "bern"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 316445, "username": "lost heros"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  }
}