{
  "Charizard": {"sets": [{"name": "Choice Specs"}]},
  "Arcanine": {"sets": [{"name": "Utility"}]},
  "Slowbro": {"sets": [{"name": "Defensive"}]},
  "Cloyster": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Gengar": {"sets": [{"name": "Choice Specs"}]},
  "Chansey": {"sets": [{"name": "Defensive"}]},
  "Tauros-Paldea-Blaze": {"sets": [{"name": "Physically Defensive"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}]},
  "Ditto": {"sets": [{"name": "Imposter"}]},
  "Dragonite": {
    "sets": [
      {
        "name": "Offensive Dragon Dance",
        "description": "<p>Multiscale combined with solid natural bulk, a high Attack stat, and Dragon Dance enable Dragonite become a deadly set-up sweeper. Extreme Speed is an excellent move for any physical sweeper, due to its high power and initiative over other priority users such as Chien-Pao. Earthquake provides coverage against bulky foes such as Toxapex, Garganacl, and Clodsire. Fire Punch OHKOes Scizor and 2HKOes physically defensive Corviknight after a Dragon Dance and Stealth Rock. Alternatively, Ice Spinner hits opposing Dragonite, Great Tusk, and Dragapult super effectively, notably OHKOing Dragapult after a Dragon Dance. Heavy-Duty Boots + Roost improves Dragonite's longevity and possibly enables it to retain Multiscale and obtain multiple boosts; preserving Multiscale is particularly useful for surviving Draco Meteor from Timid Choice Specs Dragapult. However, the loss of coverage against targets such as Corviknight and Air Balloon Gholdengo is noticeable. Tera Normal turns Extreme Speed into an incredibly powerful STAB priority move capable of shredding offensive teams after a single boost, and a timely typing change also removes Dragonite's weaknesses to Ice, Fairy, and Dragon, which can buy a free turn to set up. An Adamant nature is preferred since it maximizes the power of Extreme Speed, which often makes makes Speed stats irrelevant, but a Jolly nature can also be used to outspeed the Normal-immune Dragapult after a Dragon Dance, which is especially useful if Dragonite is running Ice Spinner.</p> <p>Offensive Dragon Dance Dragonite regularly serves as a potent win con on offensive teams that can also act as a revenge killer against fast and frail threats. Multiscale Dragonite's considerable bulk, as well as Ghost immunity with Tera Normal provides significant defensive utility for offensive teams. In particular, teams using frail offensive Pokemon such as Chien-Pao and Iron Valiant appreciate the defensive utility Dragonite brings. In return, these Pokemon can help wallbreak for a late-game Dragonite sweep. Entry hazard support from Great Tusk, Glimmora, or Garchomp is appreciated to weaken Pokemon such as Chien-Pao and Iron Valiant into range of boosted Extreme Speed. Dual screens support from Grimmsnarl and Shed Tail support from Orthworm are potential options that can supplement Dragonite's already great bulk and virtually guarantee the ability to acquire multiple boosts. Since Dragonite struggles against bulky Unaware users such as Dondozo and Skeledirge, a teammate that can switch into and check these Pokemon, such as Rotom-W, is appreciated. Rotom-W can cripple these physical walls with Trick, gain momentum against them with Volt Switch, and absorb Will-O-Wisp from Skeledirge.</p> "
      },
      {
        "name": "Bulky Dragon Dance",
        "description": "<p>With the combination of its solid natural bulk, valuable typing, reliable recovery in Roost, and Multiscale, Dragonite can accrue multiple Dragon Dance boosts and become a dangerous bulky setup sweeper. It can set up on common Pokemon such as Great Tusk lacking Bulk Up or Ice Spinner, non-Will-O-Wisp Volcarona, and even super effective attacks from Iron Valiant and Choice Specs Dragapult thanks to Multiscale. Extreme Speed alongside Tera Normal lets Dragonite clean up late-game, OHKOing faster threats like Meowscarada and potentially Chien-Pao and Cinderace at +1. It also outprioritizes Chien-Pao's Ice Shard and Meowscarada's Sucker Punch as well as Grimmsnarl's Prankster-boosted Reflect and Thunder Wave. Earthquake covers Normal-resistant and -immune Pokemon, including foes like Dragapult, non-Air Balloon Gholdengo, Garganacl, and Kingambit. 144 HP EVs allow Dragonite to survive Tera Fairy Iron Valiant's Moonblast at +1 through Multiscale and Tera Fairy Espathra's Dazzling Gleam after minor chip damage breaking Multiscale. Aside from strengthening Dragonite's Extreme Speed, Tera Normal sheds off its weaknesses to give it setup opportunities against would-be threats like Chien-Pao, Dragapult, and Hatterene. Heavy-Duty Boots keeps Multiscale intact by ignoring Stealth Rock.</p> <p>Bulky Dragon Dance Dragonite fits well on bulky offense. A defensive backbone consisting of Pokemon like Ting-Lu, Gholdengo, and Corviknight is valuable to check threats like Dragapult, Iron Valiant, and Chien-Pao, respectively, which would threaten Dragonite prior to boosting; in return, Dragonite can answer threats like Roaring Moon, Cinderace, and Volcarona for them. Garchomp, Glimmora, and Ting-Lu can reliably set entry hazards, which rack up chip damage onto walls such as Dondozo, Great Tusk, and Garganacl and puts revenge killers like Iron Valiant and Chien-Pao into guaranteed KO range of +1 Tera Normal Extreme Speed. Wallbreakers such as Breloom, Chien-Pao, and Great Tusk can punch holes early-game and overwhelm Dragonite's checks, such as Corviknight, Dondozo, Skeledirge, and defensive Great Tusk. Moreover, Breloom can incapacitate foes with Spore to give setup opportunities for Dragonite, while Great Tusk can use Knock Off to cripple Corviknight and Dondozo and pop Gholdengo's Air Balloon. Other setup sweepers are great partners; Volcarona can threaten Corviknight, use Tera Steel Rotom-W as setup fodder, and spread burns with Flame Body and Will-O-Wisp against physical attackers such as Iron Valiant, Iron Hands, and Roaring Moon to further support Dragonite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 272785, "username": "nimzowitsch"}]}
  },
  "Azumarill": {"sets": [{"name": "Choice Band"}, {"name": "Assault Vest"}]},
  "Umbreon": {"sets": [{"name": "Specially Defensive"}]},
  "Slowking": {"sets": [{"name": "Specially Defensive"}]},
  "Scizor": {"sets": [{"name": "Choice Band"}, {"name": "Offensive"}, {"name": "Offensive Swords Dance"}]},
  "Blissey": {"sets": [{"name": "Defensive"}]},
  "Tyranitar": {"sets": [{"name": "Choice Band"}, {"name": "Defensive"}]},
  "Pelipper": {"sets": [{"name": "Rain Setter"}]},
  "Masquerain": {"sets": [{"name": "Sticky Web"}]},
  "Breloom": {"sets": [{"name": "Focus Sash"}, {"name": "Choice Band"}]},
  "Torkoal": {"sets": [{"name": "Defensive"}]},
  "Salamence": {"sets": [{"name": "Dragon Dance"}]},
  "Floatzel": {"sets": [{"name": "Rain Breaker"}]},
  "Gastrodon": {"sets": [{"name": "Specially Defensive"}]},
  "Garchomp": {"sets": [{"name": "Tank"}, {"name": "Swords Dance"}]},
  "Hippowdon": {"sets": [{"name": "Specially Defensive"}]},
  "Magnezone": {"sets": [{"name": "Choice Specs"}]},
  "Gallade": {"sets": [{"name": "Swords Dance"}]},
  "Rotom-Heat": {"sets": [{"name": "Specially Defensive Pivot"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot"}, {"name": "Trick"}]},
  "Amoonguss": {"sets": [{"name": "Defensive"}]},
  "Alomomola": {"sets": [{"name": "Defensive"}]},
  "Haxorus": {"sets": [{"name": "Swords Dance"}]},
  "Hydreigon": {"sets": [{"name": "Nasty Plot"}]},
  "Volcarona": {"sets": [{"name": "Quiver Dance"}]},
  "Talonflame": {"sets": [{"name": "Defensive Utility"}]},
  "Sylveon": {"sets": [{"name": "Specially Defensive Calm Mind"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Klefki": {"sets": [{"name": "Trick Room Setter"}]},
  "Avalugg": {"sets": [{"name": "Defensive"}]},
  "Toxapex": {"sets": [{"name": "The Pex"}]},
  "Mimikyu": {"sets": [{"name": "Swords Dance"}]},
  "Corviknight": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Physically defensive Corviknight is a fantastic check to dangerous attackers like Garchomp, Roaring Moon, and Dragonite, an effective slow pivot, and one of the few viable entry hazard removers. The choice between Brave Bird and Body Press comes down to team need; Brave Bird nails Great Tusk and has no immunities, while Body Press is Corviknight's best option against Kingambit and Chien-Pao. Leftovers is the preferred item to provide extra longevity, but Rocky Helmet can further punish physical attackers, especially on weak hits like Scizor's and Meowscarada's U-turn. Tera Water serves as an emergency check to dangerous Fire-types like Cinderace, while Tera Ground surprises Iron Hands and Iron Moth.</p> <p>Corviknight is a fantastic slow pivot, making it a great partner for frail-but-powerful teammates like Chien-Pao and Iron Valiant. It is also one of the few viable Defoggers, allowing it to partner up with teammates like Dragonite, Chien-Pao, and Volcarona that loathe Stealth Rock. Be warned, Corviknight is utterly unable to Defog against Gholdengo, so secondary entry hazard removal like Great Tusk and a reliable switch-in like Ting-Lu are recommended. Corviknight is unable to handle powerful physical Fire-types like Cinderace and Ceruledge and Electric-types like Iron Hands. Teammates that can cover these weaknesses like Dondozo and Great Tusk are wonderful partners. Its middling special bulk makes teammates like Slowking and Ting-Lu valuable. Slowking has the added benefit of being another slow pivot as well, while Ting-Lu forms a strong entry hazard core with Corviknight and threatens Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 487308, "username": "BT89"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Barraskewda": {"sets": [{"name": "Rain Sweeper"}]},
  "Polteageist": {"sets": [{"name": "Shell Smash"}]},
  "Hatterene": {"sets": [{"name": "Calm Mind"}, {"name": "Healing Wish"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Pincurchin": {"sets": [{"name": "Terrain Setter"}]},
  "Indeedee": {"sets": [{"name": "Choice Scarf"}, {"name": "Terrain Setter"}]},
  "Dragapult": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Possessing OU's highest unboosted Speed tier makes Choice Specs Dragapult a very remarkable special wallbreaker, revenge killer, and offensive pivot. It outspeeds and threatens common offensive threats like Cinderace, Iron Moth, and even boosted foes like Choice Scarf Rotom-W and Adamant Dragonite after a Dragon Dance. Moreover, it's immune or resistant to common priority attacks like the aforementioned Dragonite's Extreme Speed, Breloom's Mach Punch, and Slither Wing's First Impression, which makes it much harder to revenge kill. A coverage move in either Flamethrower or Thunder lets Dragapult nail Corviknight, with the former also hitting other Steel-types like Kingambit and Iron Treads, while the latter pressures Toxapex and Tera Water Garganacl. Infiltrator allows Dragapult to bypass Grimmsnarl's dual screens, Orthworm's Shed Tail, and Substitute users like Gholdengo, which gives it an edge against hyper offense teams. Tera Ghost maintains an immunity to Dragonite's Extreme Speed and strengthens Shadow Ball—its most spammable attack—notably guaranteeing the 2HKO on Corviknight and Assault Vest Iron Treads after Terastallizing. Tera Fairy prevents Dragapult from being picked off by opposing Dragapult and Sucker Punch from Chien-Pao, Kingambit, and Meowscarada. Finally, Tera Dragon turns Draco Meteor into an even more powerful nuke. This takes advantage of the lack of prominent bulky Steel- and Fairy-types in the metagame, notably chunking answers to Ghost-types like Purifying Salt Garganacl and Ting-Lu and 2HKOing Unaware Clodsire.</p> <p>Choice Specs Dragapult fits perfectly on bulky offense and VoltTurn teams. Physical wallbreakers like Chien-Pao and Great Tusk appreciate Dragapult's U-turn bringing them in safely, and they are able to pressure its switch-ins like Clodsire, Ting-Lu, Blissey, and Garganacl. Entry hazard removers like Corviknight and Great Tusk allow Dragapult to pivot throughout the game unperturbed; the former can also pivot it in safely via U-turn, letting it threaten Gholdengo, which tends to switch into Corviknight to block its Defog. Furthermore, Corviknight and Great Tusk provide the necessary defensive backbone to switch into boosted threats such as Roaring Moon, as well as revenge kill attempts from Sucker Punch users like Kingambit and Chien-Pao. Gholdengo forms a Ghost spam core with Dragapult, as it can overwhelm a shared check in Ting-Lu, use non-Calm Mind Blissey as setup fodder, and either cripple Tera Water Garganacl with Trick or straight up dent Tera Fairy variants. Entry hazards from Ting-Lu, Garchomp, and Garganacl can quickly put foes into Dragapult's KO range, especially as it tends to force a lot of switches; in return, Dragapult spinblocks foes like Great Tusk and Iron Treads in a pinch. Setup sweepers like Volcarona, Iron Valiant, and Swords Dance Chien-Pao appreciate Dragapult wallbreaking early-game for them to clean up late-game easily.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Dragapult utilizes its near-unresisted STAB moves, its blistering Speed stat, and its excellent Attack stat to function as a strong physical wallbreaker. The choice for the second move depends on what Tera type Dragapult chooses. Tera Dragon Dragapult uses Phantom Force for a Ghost-type STAB move, but Tera Ghost uses Tera Blast, since, unlike Phantom Force, it is not a two-turn move. Sucker Punch allows Dragapult to revenge kill weakened sweepers such as opposing Dragapult, as well as Iron Moth and Tera Flying Roaring Moon after some chip damage. However, be careful when using Sucker Punch, since opponents can predict it and set up. An Adamant nature gives Dragapult extra wallbreaking power, at the cost of being outsped by threats like Chien-Pao. Alternatively, a Jolly nature allows Dragapult to outspeed the entirety of the unboosted metagame. With Tera Dragon, Dragapult's Dragon Darts becomes harder to switch into; it 2HKOes walls Dragapult normally struggles with such as Ting-Lu. Tera Dragon Dragapult is also less susceptible to Sucker Punch, albeit at the cost of losing its immunity to Dragonite's Extreme Speed.</p> <p>Iron Valiant is a fantastic partner, since it's able to check Dark-types such as Kingambit and Ting-Lu. Hazard removal from Pokemon like Great Tusk, Cinderace, and Corviknight make for good partners, since Dragapult's lack of longevity makes it difficult to switch in when hazards are up. Great Tusk and Corviknight are able to beat both Scizor and opposing Great Tusk, while Cinderace can threaten bulky Steel-types such as Corviknight. Dragapult benefits from entry hazards from the likes of Great Tusk, Ting-Lu, and Garganacl, since it can more effectively wallbreak with entry hazards up. Other pivots such as Scizor and Rotom-W appreciate that Dragapult's U-turn can bring them in. In return, Scizor can revenge kill Ice-types such as Chien-Pao, while Rotom-W can check both Corviknight and defensive Great Tusk. Paralysis support from Rotom-W can shutdown offensive Pokemon like opposing Dragapult and Roaring Moon. Lastly, Gholdengo makes for a good teammate, since it can spinblock and deny Defog and can help Dragapult overwhelm shared checks like Kingambit and Ting-Lu.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>Unlike its more offensively oriented Choice item sets, this Dragapult set goes for a more multifunctional approach. Dragapult's unmatched Speed tier, in conjunction with STAB Dragon Darts, allows it to snipe key offensive threats such as Roaring Moon, Iron Moth, and Cinderace with some prior chip damage. This often means that Dragapult will force a lot of switches which can be capitalized on with Will-O-Wisp to spread status and power up Hex. Will-O-Wisp also allows Dragapult to avoid Sucker Punch, which can come in handy against Cinderace, Kingambit, and Meowscarada. With a burn and Stealth Rock up, Hex 2HKOs Defensive Corviknight, Amoonguss, and Dondozo, allowing Dragapult to pick apart balanced cores. Finally, U-Turn rounds out the set, letting Dragapult keep momentum up even against hard counters like Ting-Lu and Garganacl. 252 Speed EVs with a Hasty nature ensure that Dragapult outspeeds the entire unboosted tier. 76 Attack EVs ensure an OHKO on Roaring Moon with Dragon Darts, while the rest of the EVs are put into Special Attack. Although Dragapult does not typically find itself needing to Terastallize very often, Ghost is most commonly used to power up Hex even further. For example, Tera Ghost Hex does a minimum of 84% to a burnt Defensive Great Tusk. In a pinch however, Terastallization can be used defensively to avoid OHKOs like from Chien-Pao's Ice Shard.</p> <p>Because of the amount of utility it provides, Dragapult appreciates plentiful chip damage from its teammates, as it lacks immediate power. All forms of entry hazards are greatly appreciated due to Dragapult's ability to force out the opponent, so entry hazard setters like Garganacl, Great Tusk, Glimmora and Ting-Lu form good teammates. Stealth Rock is particularly important since it secures important 2HKOs with Hex. Among the entry hazard setters, Garganacl has fantastic synergy with Dragapult, as it is able to set up Stealth Rock while also chipping down foes with Salt Cure. Partners that can spread status such as Rotom-W and Skeledirge are also excellent teammates. Since Ting-Lu and Garganacl stonewall this set, teammates that scare them out such as Offensive Great Tusk and Banded Meowscarada are great partners. Tera Flying Covert Cloak Gholdengo forms a particularly potent Ghost spam core with Dragapult, as it can turn common counters to Dragapult such as Ting-Lu, Clodsire, and Garganacl into setup fodder. Physical sweepers like Chien-Pao and Kingambit appreciate having their counters like Corviknight and Great Tusk crippled with burns and have solid type synergy with Dragapult. Due to this set being most potent in the mid- to late-game, it's more at home in teams with solid defensive backbones that can sponge hits. Defensive pokemon such as Ting-Lu, Hatterene, Great Tusk, Clodsire, and Amoonguss can all soak damage for Dragapult from common checks like Garganacl, Ting-Lu, and Kingambit while setting up entry hazards, spreading status, or dealing chip damage, allowing Dragapult to clean up later in the game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 518399, "username": "Itchy"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 40598, "username": "hamiltonion"}]}
  },
  "Meowscarada": {"sets": [{"name": "Pivot"}, {"name": "Choice Band"}, {"name": "Choice Scarf"}, {"name": "Lead"}]},
  "Skeledirge": {"sets": [{"name": "Bulky Attacker"}]},
  "Quaquaval": {"sets": [{"name": "Bulk Up"}, {"name": "Swords Dance"}]},
  "Lokix": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Pawmot": {"sets": [{"name": "Utility"}, {"name": "Offensive"}]},
  "Maushold": {"sets": [{"name": "Skill"}]},
  "Garganacl": {
    "sets": [
      {
        "name": "IronPress",
        "description": "<p>The combination of Iron Defense + Body Press lets Garganacl serve as a bulky and dangerous setup sweeper, allowing it to beat Pokemon it otherwise loses to, such as Dragonite, Roaring Moon, and Kingambit. Salt Cure wears down common switch-ins such as Great Tusk, Gholdengo, Rotom-W, and Hatterene, as well as passive Pokemon like Toxapex and Corviknight, and forces them to burn recovery PP more often. Recover keeps Garganacl healthy throughout a game to check Pokemon like Ceruledge and Iron Moth and makes it more sustainable as a wincon. Purifying Salt prevents it from being crippled by Pokemon like Toxapex, Rotom-W, and Clodsire. It also provides a handy Ghost resistance, letting Garganacl potentially switch in on predicted Ghost-type moves from Pokemon like Dragapult and Skeledirge. Leftovers provides valuable passive recovery, reducing Garganacl's reliance on Recover. Maximum Special Defense EVs and a Careful nature maximize Garganacl's bulk, making it easier for Garganacl to switch in on Pokemon such as Iron Moth, Volcarona, and Dragapult and use them as setup fodder. Tera Water provides incredibly valuable resistances, letting Garganacl potentially check Gholdengo and Scizor while retaining its ability to pivot in on Fire-types like Cinderace. Tera Fairy allows Garganacl to turn the tables on Great Tusk and Sacred Sword Chien-Pao while also preventing Breloom from revenge killing it. However, this does remove its resistance to Fire, making it more susceptible to Pokemon like Skeledirge and Ceruledge. Tera Ghost prevents Fighting-types like Iron Hands and Great Tusk from reliably revenge killing Garganacl, letting it use them as setup fodder. It does negate the Ghost resistance provided by Purifying Salt, however, so another switch-in to Dragapult's Shadow Ball should be used.</p> <p>Checks to strong wallbreakers like Iron Valiant, Breloom, and Chien-Pao are good teammates; examples include the likes of Toxapex, Amoonguss, and Corviknight. While Garganacl is given a Ghost resistance from Purifying Salt, it cannot fully check Dragapult and Gholdengo prior to Terastallization, with the latter completely countering it if it uses Covert Cloak. As such, Pokemon like Ting-Lu and Clodsire make for great teammates. Pokemon like Corviknight and Scizor appreciate Garganacl checking Fire-types like Ceruledge and Skeledirge. Corviknight is notable in that it also forms a strong defensive core with Garganacl, checking Meowscarada for it. Entry hazard removers like Great Tusk and the aforementioned Corviknight are appreciated, as Garganacl is heavily pressured by entry hazards and cannot set up reliably if it is worn down. Frail, offensive Pokemon like Cinderace and Chien-Pao appreciate chip damage being forced onto their checks and having a strong defensive Pokemon to fall back on. Pokemon like Ting-Lu, Kingambit, and Iron Valiant can pave the way for Garganacl to clean late-game, wearing down or significantly pressuring its checks in Gholdengo, Meowscarada, and Fighting-types like Iron Hands and Great Tusk.</p> "
      },
      {"name": "Stealth Rock"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}]}
  },
  "Ceruledge": {"sets": [{"name": "Bulk Up"}, {"name": "Swords Dance"}]},
  "Kilowattrel": {"sets": [{"name": "Rain Sweeper"}]},
  "Scovillain": {"sets": [{"name": "Sun Sweeper"}]},
  "Rabsca": {"sets": [{"name": "Trick Room Setter"}]},
  "Espathra": {
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Espathra is a threatening sweeper due to the combination of Stored Power, Calm Mind, and Speed Boost, beating many Pokemon such as Corviknight, Iron Valiant, and Rotom-W. Dazzling Gleam can be used to take down Dark-types such as Chien-Pao and Roaring Moon. Protect can be used to safely secure Speed boosts, increasing Stored Power's damage as well as accruing extra Leftovers recovery. It increases momentum against faster threats such as Dragapult, Chien-Pao, and Meowscarada. Both Roost and Substitute are alternatives that let Espathra capitalize on the switches it forces, and they give it more Calm Mind setup opportunities. They also block Sucker Punch from Chien-Pao and Kingambit. With Tera Fairy, Espathra resists Dark-type attacks alongside powering up Dazzling Gleam. Tera Blast can be run over Dazzling Gleam with Tera Fighting, as it checks Steel-types such as Iron Treads, Kingambit, and Corviknight while also removing its Dark and Ghost weaknesses.</p> <p>Espathra functions best as a late-game cleaner on hyper offense teams. Dual screens support from teammates such as Grimmsnarl is appreciated, due to its poor defensive typing. Common entry hazard setters, such as Glimmora, Great Tusk, and Garganacl, provide Espathra with chip damage, which is vital in ensuring an OHKO on Iron Valiant and Choice Band Chien-Pao. Support from Great Tusk and Iron Treads is also appreciated, as they can check Gholdengo, something Espathra struggles with. Similarly, they also can provide entry hazard removal, which supports it even further. Teammates such as Dragon Dance Roaring Moon and Dragon Dance Dragonite can wear down Pokemon such as defensive Gholdengo and Kingambit to the point where Espathra can clean late-game. Orthworm is a fantastic partner, providing Shed Tail support, alongside entry hazards, the latter of which gives Espathra more setup opportunities. Pokemon such as Breloom and Volcarona can provide utility for Espathra with Spore and Will-O-Wisp, giving it opportunities to set up. Espathra struggles with strong priority moves such as Extreme Speed from Dragonite, Ice Shard and Sucker Punch from Chien-Pao, Bullet Punch from Scizor, and Sucker Punch from Kingambit. Espathra also can be difficult to set up, as it has a rather low power level prior to boosting, and it tends to over-rely on Terastallization in order to sweep, due to its poor defensive typing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 487308, "username": "BT89"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 458971, "username": "NoahDeKnight"}]}
  },
  "Orthworm": {"sets": [{"name": "Shed Tail Support"}]},
  "Glimmora": {"sets": [{"name": "Focus Sash"}, {"name": "Offensive"}]},
  "Cetitan": {"sets": [{"name": "Slush Rush Sweeper"}]},
  "Dondozo": {"sets": [{"name": "Wall"}, {"name": "Curse"}]},
  "Clodsire": {"sets": [{"name": "Defensive"}]},
  "Kingambit": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Supreme Overlord Kingambit is a terrifying revenge killer and sweeper. Dark / Steel is a great offensive typing that can hit Pokemon such as Skeledirge, Gholdengo, Dragapult, Garganacl, Iron Valiant, Chien-Pao, and Espathra super effectively as well as Great Tusk, Ting-Lu, and Corviknight neutrally. Tera Flying completely reverses Kingambit's weaknesses and resistances and can catch Pokemon looking to KO Kingambit with Fighting- and Ground-type moves like Chien-Pao and Iron Valiant, off guard. Alternatively, Kingambit can opt for Tera Ghost to better counter Normal Tera Dragonite, as Earthquake becomes neutral against Kingambit and Extreme Speed is ineffective. Similarly, Tera Fairy can be chosen because Kingambit then resists Chien-Pao and Roaring Moon's Crunch, because with the exception of Tera Steel Roaring Moon, neither can OHKO Kingambit. Kingambit chooses to run 144 Speed EVs to reliably outspeed Corviknight and Swords Dance Iron Hands; the rest of its investment is in HP to maximize bulk.</p> <p>Kingambit fits very well on hyper and bulky offense teams, as it works very well coming in after its teammates have fallen, such as Iron Valiant, Gholdengo, Breloom, and Dragonite. On hyper offense particularly, Grimmsnarl and Glimmora both work as great leads that set up screens and entry hazards, respectively. Kingambit checks opposing offensive Pokemon such as Dragapult, Gholdengo, and Meowscarada thanks to its defensive typing but it loses out against revenge killers such as Chien-Pao and Breloom and other threats like Calm Mind Iron Valiant, Iron Hands, Dodonzo, and Great Tusk; so, Kingambit appreciates defensive support from Great Tusk, Skeledirge, and Rotom-Wash and offensive support from Iron Valiant, Gholdengo and Dragapult.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 5542641, "username": "Coolcodename"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 540138, "username": "Milo"}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Great Tusk has a solid niche as a defensive Pokemon by virtue of its utility, movepool, bulk, and typing. It can adequately check Pokemon like Kingambit, Cinderace, and Iron Hands, threatening them with a strong Earthquake in return. Stealth Rock lets Great Tusk compress even more roles, chipping away at the opposition. If another Stealth Rock user is already on the team, however, Body Press can take advantage of its high Defense stat and better threaten the likes of Ting-Lu and Roaring Moon. Body Press also lets Great Tusk catch Rotom-W with greater chip damage than Knock Off does on the switch. Knock Off provides valuable item removal, getting rid of Leftovers from Pokemon like Dondozo, Corviknight, and Hatterene, as well as Heavy-Duty Boots from Volcarona and Dragonite. Additionally, Knock Off is Great Tusk's only initial way to hit Air Balloon Gholdengo, which can't OHKO this defensive set. Rapid Spin, besides clearing entry hazards, also allows Great Tusk to outspeed faster foes like Focus Sash Glimmora and Gholdengo. Tera Fighting gets rid of Great Tusk's Ground typing, giving it a better matchup against Pokemon like Chien-Pao while also strengthening Body Press if it is used. Alternatively, Tera Steel can give Great Tusk valuable resistances to Fairy, Grass, and Ice, turning the tables on Hatterene and Chien-Pao. Leftovers greatly increases Great Tusk's longevity; however, Rocky Helmet can be used to wear down Pokemon like Scizor and Cinderace over time.</p> <p>After Great Tusk sets Stealth Rock, Corviknight effortlessly switches in and uses Defog to remove entry hazards, so Pokemon like Cinderace, Gholdengo, and Rotom-W that handle it are great partners. With no good way to hit Flying-types and Pokemon that use Tera Flying, Great Tusk can be set up on very quickly, most notably against the likes of Dragonite and Roaring Moon;even though the former dislikes Knock Off. Therefore, checks to these such as Dondozo and Corviknight are appreciated. A different Stealth Rock setter like Garganacl or Ting-Lu lets Great Tusk comfortably run Body Press without losing out on anything major. Ting-Lu also forms a potent entry hazard-stacking core with Great Tusk via Spikes. Further, it takes on the special attackers that Great Tusk struggles with, like Gholdengo, Choice Specs Dragapult, and Volcarona. Great Tusk is forced out by wallbreakers like Iron Valiant and Quaquaval, so teammates that can check them like Amoonguss and Toxapex are welcome. Pokemon like Chien-Pao, Ceruledge, and Iron Moth appreciate the entry hazard removal that Great Tusk provides. Great Tusk's defensive qualities greatly help frail wallbreakers like Dragapult, Iron Valiant, and Chien-Pao, as these Pokemon need strong defensive Pokemon to fall back on very often.</p> "
      },
      {"name": "Offensive"},
      {"name": "Choice Band"},
      {
        "name": "Bulk Up",
        "description": "<p>Bulk Up Great Tusk can act as both a defensive backbone and a potential late game sweeper, able to set up in front of Pokemon such as Dragonite, Iron Treads, Cinderace, Dragon Dance Dragapult, and opposing Great Tusk. Knock Off provides item removal against defensive walls like Dondozo and Corviknight, as well as coverage against Air Balloon Gholdengo that would otherwise wall Great Tusk. Rapid Spin lets Great Tusk provide entry hazard removal for the team in games where it would not be able to win with Bulk Up, while allowing it to boost its Speed in games where it can sweep with Bulk Up. Body Press is another option that gives Great Tusk a way to more immediately hit Dark-types such as Meowscarada, Roaring Moon, and Ting-Lu. Tera Water turns Great Tusk's Water and Ice weaknesses into resistances and thus allowing it to better take hits from Azumarill, Chien-Pao, Quaquaval, and Floatzel. On the other hand, Tera Steel lets Great Tusk take on Grass-type attacks such as Breloom's Bullet Seed and Meowscarada's Flower Trick, Flying-type attacks like Roaring Moon's Acrobatics, and if need be, Fairy-type attacks such as Iron Valiant's Moonblast.</p> <p>Bulk Up Great Tusk appreciates specially defensive teammates like Toxapex and Garganacl that can help play around fast special attackers such as Choice Specs Iron Valiant and Choice Specs Dragapult. In return, Garganacl and Toxapex appreciate the presence of a Terastallized Great Tusk as they can get overwhelmed by Chien-Pao and Belly Drum Azumarill. Teammates such as Gholdengo, Iron Valiant, and Dragapult can help break through physically defensive Pokemon like Rotom-W, Dondozo, and Skeledirge that Bulk Up Great Tusk can struggle against. Gholdengo in particular is a great partner as it can struggle against Cinderace and Dragonite, both of which Great Tusk covers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 277988, "username": "dex"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 109385, "username": "Aurora"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 548068, "username": "SetsuSetsuna"}]}
  },
  "Scream Tail": {"sets": [{"name": "Defensive"}]},
  "Brute Bonnet": {"sets": [{"name": "Offensive"}]},
  "Slither Wing": {"sets": [{"name": "Defensive"}, {"name": "Choice Band"}]},
  "Sandy Shocks": {"sets": [{"name": "Choice Specs"}]},
  "Iron Treads": {"sets": [{"name": "Offensive"}, {"name": "Utility"}, {"name": "Assault Vest"}]},
  "Iron Hands": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Iron Jugulis": {"sets": [{"name": "Choice Specs"}]},
  "Iron Moth": {"sets": [{"name": "Offensive"}, {"name": "Agility"}]},
  "Iron Thorns": {"sets": [{"name": "Offensive"}]},
  "Baxcalibur": {"sets": [{"name": "Offensive"}]},
  "Gholdengo": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Gholdengo utilizes its high Special Attack and its great offensive typing to become a fast revenge killer. Gholdengo can effectively hit offensive threats such as Dragapult, Iron Valiant, and Espathra with its STAB moves. Trick allows Gholdengo to cripple defensive Pokemon such as Dodonzo, Corviknight, and Clodsire. Its typing also allows it to switch into foes such as Iron Valiant and Iron Hands in a pinch, as it either resists or is immune to most of their attacks. Focus Blast is ideal for Gholdengo to hit Kingambit and other foes such as a weakened Ting-Lu, but Nasty Plot can be run instead to take advantage of stopping defensive Pokemon with Trick and having a free turn to set up and do a great amount of damage. Recover can also be run, taking a more defensive approach to give Gholdengo a free turn to heal. Gholdengo prefers Fighting as a Tera type, as it removes its prior weaknesses, meaning it is not threatened by Chien-Pao's and Kingambit's Sucker Punch, or Skeledirge's Torch Song. It also boosts the power of Focus Blast, reliably removing the latter. To counter different foes, Gholdengo can instead opt for Tera Flying to have better ground against Great Tusk and Iron Treads.</p> <p>Teammates such as Kingambit and Iron Valiant appreciate Gholdengo's offensive pressure, as it can help against shared checks such as Great Tusk and Amoonguss. With this role, Gholdengo prefers to have a clean switch after a teammate has fainted in order to pressure the opponent. Similarly, entry hazard setters such as Garchomp, Garganacl, and Ting-Lu appreciate Gholdengo for its Good as Gold ability and its Ghost typing, preventing all forms of hazard removal excluding Court Change. Gholdengo is mainly vulnerable to priority moves such as Kingambit's and Chien-Pao's Sucker Punch. Dragonite also presents an issue for it with Multiscale in conjunction with Earthquake, not to mention it can set up twice in front of Gholdengo. This can be avoided with a carefully timed Trick or help from defensive Great Tusk and Skeledirge. Similarly, depending on its Choice lock, Roaring Moon and Cinderace can take advantage of Gholdengo with Crunch and Sucker Punch, respectively. As a result of this, Garchomp and Garganacl pair well with Gholdengo, acting as a defensive backbone with type advantage and great bulk. Iron Valiant can be a great revenge killer against these threats with great Speed and coverage.</p> "
      },
      {
        "name": "Air Balloon",
        "description": "<p>Thanks to its great typing and Good as Gold, Gholdengo is a setup sweeper that's notably difficult to deal with. Having an additional Ground immunity with Air Balloon further improves Gholdengo's already great typing, letting it switch in on Pokemon that otherwise threaten it, such as Garchomp and Iron Treads. This is especially useful against the latter, as Air Balloon strengthens Gholdengo's ability to block entry hazard removal. Maximum Speed investment is for outspeeding Dragonite and uninvested Great Tusk. 252 Special Attack EVs and Nasty Plot makes Gholdengo's STAB moves very threatening against neutral foes. Fighting and Dark Tera types give Gholdengo the option to Terastallize defensively; notably, Tera Fighting lessens the impact of moves like Crunch from Chien-Pao and Roaring Moon. Tera Dark is useful in a pinch to resist attacks such as Shadow Ball from Dragapult and opposing Gholdengo.</p> <p>Entry hazard setters like Great Tusk and Glimmora are the most profitable teammates for Gholdengo, as its ability and typing ensure that their entry hazards stay around as long as Gholdengo does. Hyper offense staples such as Chien-Pao and Iron Valiant benefit greatly from the constant presence of entry hazards to break down bulkier cores; in return, Gholdengo gets teammates that synergize with its role as a wallbreaker, applying heavy pressure throughout a game to Pokemon like Ting-Lu and Rotom-W. Offensive Pokemon that outspeed and OHKO Gholdengo, such as Cinderace, Chien-Pao, Roaring Moon, and Knock Off variants of Great Tusk, threaten to completely shut down Gholdengo; defensive teammates like Garganacl, Dondozo and Skeledirge can help mitigate some of these weaknesses.</p> "
      },
      {"name": "Defensive"},
      {"name": "Choice Specs"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 487308, "username": "BT89"}, {"user_id": 554264, "username": "Coolcodename"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 359575, "username": "Nichalho"}, {"user_id": 540138, "username": "Milo"}]}
  },
  "Chien-Pao": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band amplifies Chien-Pao's offensive potential, which, in tandem with its fantastic Speed and coverage, allows it to effectively clean weakened teams and break apart common defensive cores. Icicle Crash is Chien-Pao's most powerful physical Ice-type attack and its status as a non-contact move means Chien-Pao can launch it without fear of debilitating effects like those from Rocky Helmet and Flame Body. Its chance to flinch can also help Chien-Pao break down walls, like Corviknight, in a pinch. Ice Spinner, while marginally weaker, may be preferred due to its perfect accuracy. Crunch is another powerful STAB option that conveniently pairs well with Icicle Crash, as it is able to hit common Ice-resistant Pokemon such as Dondozo and Gholdengo. Ice Shard lets Chien-Pao revenge kill sweepers like Roaring Moon and Iron Valiant; Sucker Punch is more powerful, but it can leave Chien-Pao vulnerable to status spreaders like Rotom-W and Hex Dragapult and to sweepers that can take advantage of Chien-Pao if it is Choice-locked into it. Sacred Sword hits Pokemon like Kingambit and Garganacl supereffectively. Tera Dark removes Chien-Pao's Stealth Rock weakness while bolstering the power of its Crunch, notably allowing it to 2HKO walls like Corviknight and Toxapex. Alternatively, Tera Ice boosts the power of Chien-Pao's Ice Shard, making it even harder to check offensively. An Adamant nature grants Chien-Pao enough power to 2HKO physically defensive Dondozo with Crunch after Terastallization, though Jolly prevents it from being outsped by threats like Roaring Moon and Cinderace.</p> <p>Chien-Pao's typing leaves it vulnerable to all forms of entry hazards, especially Stealth Rock, which will greatly limit the number of times it can switch in and launch attacks. For this reason, hazard removers like Great Tusk and Corviknight are great partners for it; they also can cover several of Chien-Pao's checks, such as Scizor and Kingambit. Hazards greatly aid Chien-Pao's ability to clean teams late-game, so hazard setters like Ting-Lu, Garchomp and the aforementioned Great Tusk make for great teammates. Defensive teammates like Corviknight and Dondozo can support Chien-Pao by handling Pokemon that offensively check it, such as Scizor. Pivots like Rotom-, Cinderace, and Dragapult, make for solid teammates, as they give Chien-Pao the ability to prey on their common switch-ins like Amoonguss and Clodsire.</p> "
      },
      {
        "name": "All-out Attacker",
        "description": "<p>By virtue of its high Speed and Attack, excellent offensive STAB combination, and unique ability Sword of Ruin, Chien-Pao is one of the tier's defining wallbreakers and late-game cleaners. Icicle Crash is preferred over Ice Spinner as it avoids Rocky Helmet and Rough Skin chip and boasts higher power and a chance to flinch. However, Ice Spinner can also be used as a guaranteed safe option if your team cannot afford missing. Sacred Sword offers good coverage that hits important metagame threats that resist Chien-Pao's STAB combination, such as Kingambit. Tera Dark is the preferred option to eliminate Chien-Pao's Stealth Rock weakness and power up Crunch and Sucker Punch to monstrous levels, enabling Life Orb Chien-Pao to cleanly 2HKO Toxapex. Tera Ice is an alternative that boosts Ice Shard enough to always OHKO Dragapult after Stealth Rock damage.</p> <p>All-out attacking Chien-Pao is best used as a midgame wallbreaker on offensive teams that can take advantage of its high damage output and wide coverage to punch holes in the opposing defensive core. Late-game cleaners that can take advantage of Chien-Pao's wallbreaking capabilities include Iron Valiant and Dragon Dance Dragonite. Chien-Pao can struggle with bulky Water-types such as Dondozo, Azumarill, and physically defensive Quaquaval. Rotom-Wash is a good partner that can switch into these Water-types and either gain momentum with Volt Switch or cripple them with Will-O-Wisp. If running Life Orb over Heavy-Duty Boots, entry hazard control from Great Tusk or Hatterene is greatly appreciated. Great Tusk and Hatterene can also use their great physical bulk and quadruple resistance, respectively, to switch into Fighting-type attacks aimed at Chien-Pao.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 360720, "username": "ausma"}, {"user_id": 349443, "username": "Tysonslayer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 577920, "username": "tea-guzzler"}]}], "writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}, {"user_id": 197439, "username": "chimp"}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "Defensive Hazards",
        "description": "<p>Ting-Lu is an incredible entry hazard setter for bulky offense and balance teams alike thanks to its combination of gargantuan defensive stats, good utility movepool, and an amazing defensive ability in Vessel of Ruin. It also has a great typing that lets it answer threats such as Gholdengo, Choice Specs Dragapult, Iron Moth, and Ceruledge. Whirlwind is incredibly useful for thwarting setup Pokemon like Roaring Moon and Volcarona. Ruination lets Ting-Lu deal consistent damage to bulky Pokemon like Corviknight, Rotom-W, and Hatterene. Tera Poison lets Ting-Lu act as an answer to Iron Valiant while giving it an immunity to poison damage from Clodsire’s Toxic and letting it absorb Toxic Spikes from the likes of Glimmora and Iron Moth. Meanwhile, Tera Fairy is a generally solid defensive typing, letting it more reliably check Pokemon such as Dragapult and Great Tusk. Maximum Special Defense, in tandem with Ting-Lu's ability, makes it a more consistent check to special attackers such as Choice Specs Dragapult and Volcarona.</p> <p>Ting-Lu’s premier defensive profile makes it most proficient on bulky offense and balance teams that can supply enough offensive momentum to make up for Ting-Lu’s relative passivity. Pokemon that can supplement offensive prowess to make up for Ting-Lu's passivity such as Chien-Pao, Iron Valiant, and Kingambit make for excellent partners, as they can assist against threats like opposing Iron Valiant, Dondozo, and Great Tusk. Without Ruination, Ting-Lu is utterly helpless against Corviknight, so Pokemon that can threaten it such as Gholdengo and Cinderace make for excellent partners. Bulky Water-types like Dondozo and Toxapex appreciate Ting-Lu's immunity to Electric while being quite helpful against Pokemon like Chien-Pao, Kingambit, and Quaquaval in return. Other defensive Pokemon like Garganacl and Corviknight also make for excellent partners, being helpful against Pokemon like Chien-Pao and Scizor while appreciating Ting-Lu’s ability to check Gholdengo and Choice Specs Dragapult. Additional entry hazard setters such as Garganacl and Great Tusk allow Ting-Lu to fit Ruination into its moveset more capably, so it is less passive in the face of Ground-immune threats like Corviknight and Air Balloon Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 487306, "username": "BT89"}]}
  },
  "Roaring Moon": {"sets": [{"name": "Booster Energy"}, {"name": "Bulky Pivot"}, {"name": "Choice Band"}]},
  "Iron Valiant": {
    "sets": [
      {"name": "Choice Specs"},
      {
        "name": "Mixed",
        "description": "<p>High attacking stats and a wide array of coverage moves make Iron Valiant a devastating mixed attacker that can 2HKO common defensive walls physically and specially; Moonblast and Thunderbolt threaten physically defensive Pokemon like Great Tusk, Corviknight, and Dondozo, while Close Combat and Psyshock deal with specially defensive foes like Ting-Lu and Clodsire. Its Quark Drive-boosted Speed from Booster Energy turns it into a potent late-game cleaner, letting it outspeed would-be revenge killers like Dragapult, Chien-Pao, and Choice Scarf Gholdengo, which is further enforced by its unique typing that resists Sucker Punch from Kingambit and Chien-Pao. However, it can also be used to revenge kill boosted threats like Baxcalibur and Dragonite in a pinch, especially since Iron Valiant can take on the latter's +1 Tera Normal Extreme Speed from full health. Tera Fairy boosts Iron Valiant's Moonblast while still retaining its defensive profile to take on Sucker Punch. Alternatively, Tera Electric amplifies Thunderbolt's damage, notably allowing it to 2HKO would-be checks like Toxapex, specially defensive Dondozo and Tera Water Garganacl, and offensive Gholdengo after Stealth Rock, as well as preventing Iron Valiant from being revenge killed by Scizor's Bullet Punch.</p> <p>Mixed Iron Valiant is commonly seen on offense and bulky offense teams. Due to the lack of a damage boosting item or setup move, it can still fall short of threatening bulky Pokemon like Amoonguss, and without Shadow Ball or Knock Off, Skeledirge and defensive Gholdengo as well; thus, Pokemon that can deal with them such as Great Tusk, Chien-Pao, and Kingambit make good teammates. Particularly, the aforementioned Pokemon can overwhelm a shared check in Corviknight and are generally effective as early-game wallbreakers that can open up Iron Valiant to clean up late-game easily. Entry hazards from teammates like Garchomp, Ting-Lu, and Glimmora can chip down foes like Garganacl, Amoonguss, and Tera Grass Dondozo. A sturdy defensive backbone with the likes of Corviknight and Ting-Lu can help check offensive threats that threaten Iron Valiant out, such as a boosted Roaring Moon, opposing Iron Valiant, and Gholdengo. Pivots like Dragapult, Scizor, and Rotom-W can compensate for Iron Valiant's lack of bulk by bringing it in safely on foes like Ting-Lu, Great Tusk, and Blissey, respectively; the latter can also cripple Amoonguss with either Trick or Will-O-Wisp. Gholdengo is a great partner, as it reliably prevents the much-needed entry hazards from being removed by Rapid Spin and Defog, threatens Skeledirge and Tera Fairy Garganacl, and appreciates Iron Valiant dealing with foes like Corviknight and Dark-types like Ting-Lu, Kingambit, and Roaring Moon in return.</p> "
      },
      {"name": "Calm Mind"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  }
}