{
  "Clefairy": {"sets": {"Full Support": {}}},
  "Ninetales-Alola": {"sets": {"Screens Setter": {}}},
  "Arcanine": {"sets": {"Utility": {}, "Assault Vest": {"outdated": true}}},
  "Arcanine-Hisui": {"sets": {"Choice Band": {}, "Assault Vest": {"outdated": true}}},
  "Weezing": {"sets": {"N.Gas support": {}}},
  "Gyarados": {"sets": {"Bulky Pivot": {}, "Support": {"outdated": true}}},
  "Dragonite": {"sets": {"Choice Band": {}, "Assault Vest": {}, "TeraNormal": {"outdated": true}, "TeraFlying": {"outdated": true}, "Lum Berry": {"outdated": true}}},
  "Murkrow": {
    "sets": {
      "Tailwind Support": {},
      "Tailwind": {
        "outdated": true,
        "description": "<ul> <li> <p>Foul Play punishes the metagame's strong physical attackers, most notably 2HKOing Adamant Dragonite and Garchomp. Brave Bird is an alternative option that handles Flying-weak Pokemon such as Meowscarada, Lilligant, and Breloom with ease.</p> </li> <li> <p>Murkrow's Haze allows it to check dangerous threats, such as Dondozo, Nasty Plot Gholdengo, and Swords Dance Garchomp. Haze can also reset its partner's stat drops from the likes of Intimidate, Parting Shot, and Snarl, or attacks that lower the user's stats.</p> </li> <li> <p>Taunt allows it to also disrupt support Pokemon such as Lilligant, Talonflame, and Amoonguss, as well as crippling Pokemon such as Iron Defense Garganacl. Quash is also a viable option to maintain speed control even in Trick Room, and it can neutralize threats such as Maushold and Garchomp in opposing Tailwind.</p> </li> <li> <p>Other viable, but not as prominent, options for Murkrow include Protect and Perish Song. Protect allows it to scout the opponent and block Fake Out. Perish Song is an interesting option that gives Murkrow a win condition alongside its supportive roles and can force switches before that.</p> </li> <li> <p>Eviolite gives Murkrow the bulk needed to stay on the field and disrupt the opponent with Haze and Taunt. Focus Sash can be used when Murkrow is expected to be KOed quickly, for example Murkrow can also hold Covert Cloak to bypass Fake Out.</p> </li> <li> <p>52 Speed EVs allow Murkrow to get the jump on Annihilape in Tailwind, and the overall bulk investment allows Murkrow to survive Tera Normal Dragonite's Extreme Speed and Timid Gholdengo's Thunderbolt.</p> </li> <li> <p>Tera Ghost allows Murkrow to bypass Fake Out on sets not running Covert Cloak, while Tera Dark adds more power to Foul Play in rare late-game one-on-one scenarios and it keeps Murkrow's immunity to Prankster status moves.</p> </li> </ul>"
      }
    }
  },
  "Tyranitar": {"sets": {"Assault Vest": {}}},
  "Pelipper": {
    "sets": {
      "Rain Setter": {},
      "Pelipper": {
        "outdated": true,
        "description": "<ul> <li> <p>Hurricane's full accuracy in Rain makes it mandatory on Pelipper. It provides consistent damage and threatens the Grass-type Pokemon that resist Water.</p> </li> <li> <p>Hydro Pump is Pelipper's best Water-type attack but can be forgone if accuracy is a concern. Helping Hand paired with a fast Water-type Pokemon can compensate for the lack of reliable Water-type damage.</p> </li> <li> <p>Wide Guard can be used over Protect to answer ubiquitous spread moves such as Gholdengo's Make it Rain and Sylveon's Hyper Voice.</p> </li> <li> <p>Focus Sash ensures Pelipper survives attacks from Pokemon that might otherwise outspeed and OHKO it, such as Hydreigon and Annihilape. Damp Rock extends the uptime of Pelipper's rain-reliant teammates, allowing them to beat bulkier teams without requiring repeat switch-ins.</p> </li> <li> <p>252 Speed EVs with a Timid nature allow Pelipper to outspeed the entire metagame with Tailwind, as well as some notable Choice Scarf threats such as Annihilape.</p> </li> <li> <p>A Ground Tera type grants Pelipper an immunity to Electric and a resistance to Rock, which are its main concerns. With a Grass Tera type, it instead resists Electric, but this grants an immunity to Spore and Rage Powder.</p> </li> </ul>"
      },
      "Defensive": {"outdated": true},
      "Offensive": {"outdated": true}
    }
  },
  "Torkoal": {
    "sets": {
      "Trick Room Sweeper": {},
      "Support": {"outdated": true},
      "Trick Room Offense": {
        "outdated": true,
        "description": "<ul> <li> <p>This set makes full use of Torkoal's nuclear power. Eruption vaporizes nearly anything without a resistance or immunity to Fire after Terrastilization. Heat Wave gives it a mostly-reliable spread option after taking damage. Earth Power hits opposing Fire-types and gives Torkoal a single-target option to get around Wide Guard.</p> </li> <li> <p>Tera Fire is the go-to option to maximize Torkoal's damage. Tera Flying and Grass removes its weaknesses, which helps greatly against the ever-frequent Ground-type attacks, but are generally not worth it.</p> </li> <li> <p>Solar Beam is an option to hit Water-types meaningfully and to hit Rock- and Ground-types a little harder than Earth Power. Tera Blast is a niche option if Torkoal is running Tera Flying, turning the tables on Tera Grass Armarouge and Ceruledge attempting to wall it. Choice Specs would push Torkoal's offensive capabilities onto another planet, but it makes Torkoal even easier to exploit with Wide Guard, Flash Fire, and attacks in general—it can't viably run Protect.</p> </li> </ul>"
      }
    }
  },
  "Dusclops": {"sets": {"Trick Room": {}}},
  "Salamence": {"sets": {"Rain Scarfer": {}}},
  "Gastrodon": {"sets": {"Tank": {}}},
  "Garchomp": {"sets": {"Offensive": {}, "Scarf": {}}},
  "Abomasnow": {
    "overview": "<ul> <li> <p>Snow lets Abomasnow carve itself a niche in the current metagame.</p> </li> <li> <p>Abomasnow is a decent offensive support Pokemon with Aurora Veil, which partners well with various Ice-types such as Baxcalibur, Cetitan, and Glaceon, as they gain a Defense boost in snow.</p> </li> <li> <p>Abomasnow's offensive typing is well-suited in a metagame filled with Ground-, Dragon-, and Water-types such as Garchomp, Hydreigon, and Rotom-W.</p> </li> <li> <p>Despite the Defense boost in snow, Abomasnow is still fairly specially frail with a poor set of weaknesses that leave it vulnerable to some of the most common special attackers in the format like Gholdengo and Armarouge.</p> </li> </ul>",
    "sets": {
      "Support": {
        "description": "<ul> <li> <p>Giga Drain gives Abomasnow some longevity when behind Aurora Veil and lets it beat the likes of Rotom-W and Palafin, which resist Blizzard. Earth Power is an alternative that hits Fire- and Steel-types like Torkoal and Gholdengo, notably OHKOing the former when Terastallized.</p> </li> <li> <p>Abomansow runs items that help it overcome its crucial weaknesses. Focus Sash allows it to take any one hit, such as Rotom-H's Overheat, letting it set up Aurora Veil. Babiri Berry serves a similar purpose, allowing it to survive Gholdengo's Make It Rain and Tera Steel Hydreigon's Flash Cannon.</p> </li> <li> <p>The Speed investment allows Abomsnow to outspeed Garchomp while in Tailwind.</p> </li> <li> <p>Water is the primary Tera type used by Abomasnow, turning its Fire and Steel weaknesses into resistances. Ground is an alternative Tera type that allows it to fire off STAB-boosted Earth Powers, catching its common checks by surprise.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "yuki", "user_id": 294287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yourwelcomethanku", "user_id": 541847}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Rotom-Wash": {"sets": {"Bulky Water": {}}},
  "Heatran": {"sets": {"Bulky Attacker": {}, "Assault Vest": {"outdated": true}}},
  "Cresselia": {"sets": {"TR Setter": {}}},
  "Lilligant": {
    "sets": {
      "Sun supporter": {},
      "Chlorophyll Support": {
        "outdated": true,
        "description": "<ul> <li> <p>Leaf Storm is Lilligant's strongest STAB option and gives it some offensive presence, notably checking Water- and Ground-types. Sleep Powder shuts down Pokemon that would otherwise threaten Lilligant or its partner and can punish switch-ins. After You is a phenomenal speed control tool that, with Lilligant's fantastic Speed via Chlorophyll, sets the stage for moves like Torkoal's Eruption.</p> </li> <li> <p>Focus Sash is all but mandatory for Lilligant to function due to its frailty. Wide Lens is an option to shore up Sleep Powder's and Leaf Storm's consistency, but it leaves Lilligant vulnerable to OHKOs from most strong attackers.</p> </li> <li> <p>Timid Lilligant is usually superior due to it outrunning Pokemon like Timid Gholdengo in Tailwind. Modest Lilligant can nab potential OHKOs on the likes of Maushold, bulky Rotom-W, and Tera Ground Garchomp, however, while having a very high chance of 2HKOing Garchomp before Terastallization.</p> </li> <li> <p>Lilligant will rarely Terastallize but still has decent options. Tera Water lets it survive a Fire-type attack without giving it too many weaknesses. Tera Flying allows it to pair with an Earthquake user and continue to provide support. Tera Blast with Tera Ground covers Steel- and Fire-types such as Armarouge, Ceruledge, and Gholdengo but is generally not worth it.</p> </li> <li> <p>Helping Hand gives Lilligant a good priority move to use in Trick Room, boosting Torkoal's spread damage to staggering levels. Quiver Dance allows Lilligant to maintain speed control outside of sun and gives its offense more bite. Energy Ball gives Lilligant a more consistent attack than Leaf Storm and is the attack of choice with Quiver Dance, but its unboosted damage leaves a lot to be desired. Any set using Quiver Dance or Energy Ball should run a Modest nature.</p> </li> </ul>"
      }
    }
  },
  "Lilligant-Hisui": {"sets": {"Sun Abuser": {}}},
  "Gothitelle": {"sets": {"Support Trapper": {}, "Support": {"outdated": true}}},
  "Amoonguss": {"sets": {"Bulky Support": {}, "Support": {"outdated": true}}},
  "Hydreigon": {
    "overview": "<ul> <li> <p>Hydreigon is a strong contender for the title of best Pokemon in the Series 1 metagame thanks to its diverse movepool and high damage output.</p> </li> <li> <p>Terastallization proves to be a boon for Hydreigon, as it can get rid of its ever-burdening Fairy-type weakness by changing to much more beneficial types such as Steel.</p> </li> <li> <p>Hydreigon has a good offensive typing, leaving few Pokemon able to switch in safely. It is one of the best checks to Gholdengo and also pairs well with it, forming a fundamentally powerful core when used with Tailwind support from Murkrow. Armarouge and Garchomp also synergize well with Hydreigon, covering for Steel-types, which it may not be able to damage effectively depending on its Tera type. Hydreigon can, however, struggle against damage reduction such as Snarl and Light Screen, with the latter coming especially from Grimmsnarl, which can easily take its STAB moves and OHKO it back with Spirit Break if Hydreigon is not Terastallized. Repeated usage of Draco Meteor can also make Hydreigon deal unimpressive amounts of damage, but this can be counteracted with Haze from Murkrow, allowing it to continue dealing devastating damage.</p> </li> </ul>",
    "sets": {
      "Life Orb": {
        "description": "<ul> <li> <p>Tailwind allows Hydreigon to support allies such as Armarouge and Sylveon, forming strong offensive combinations. The third moveslot depends on Hydreigon's Tera Type and can be changed accordingly. Protect is utilized on teams with a different primary Tailwind setter such as Murkrow, but Hydreigon can still be kept as a secondary setter.</p> </li> <li> <p>Life Orb lets Hydreigon dish out consistent damage without the need to set up.</p> </li> <li> <p>The Steel Tera type synergizes wonderfully with Hydreigon's original typing and Levitate, allowing it to resist a plethora of common types such as Fairy, Ground, and, Dragon. This makes Hydreigon one of the best checks to Tera Ground Garchomp, which cannot hit Hydreigon with Earthquake and deals minimal damage to it with Dragon Claw and Rock Slide. A Fire Tera type allows Hydreigon to beat opposing Tera Steel Pokemon such as Hydreigon and Salamence. The Poison Tera type lets Hydreigon maintain the resistance to Fairy that Steel and Fire possess while also gaining an additional resistance to Fighting, crucial against the likes of Annihilape, Hariyama, and Close Combat Lycanroc. It is only left with Psychic as a relevant weakness, synergizing well with its original Dark typing. Tera Blast should be used instead of Flash Cannon for coverage against Fairy-types on sets that use Tera Poison.</p> </li> </ul>"
      },
      "Scope Lens": {"description": "<ul> <li> <p>Heat Wave is a great coverage move to deal with Steel-types that can withstand Draco Meteor such as Gholdengo and Kingambit.</p> </li> <li> <p>Scope Lens takes advantage of the +2 critical hit rate from Focus Energy, allowing Hydreigon to always critical hit, especially through Draco Meteor Special Attack drops and other means of damage reduction such as Light Screen.</p> </li> <li> <p>A Timid nature lets Hydreigon speed tie other Hydreigon as the raw power it gains from having the ability to always critical hit is enough. A Modest nature can, however, be utilized on teams with good methods of speed control such as Tailwind from Murkrow.</p> </li> <li> <p>The Fire Tera type powers up Hydreigon's Heat Wave, letting it OHKO Kingambit on a critical hit and nearly OHKO Amoonguss, and gives Hydreigon a Fairy resistance.</p> </li> </ul>"},
      "Assault Vest": {
        "description": "<ul> <li> <p>Snarl is an immensely useful tool for reducing the damage dealt by strong special attackers such as Gholdengo, Psychic Terrain-boosted Expanding Force Armarouge, and opposing Hydreigon.</p> </li> <li> <p>Flash Cannon in combination with the Steel Tera type is used as a way to keep Fairy-types such as Grimmsnarl and Sylveon in check. Heat Wave is used as coverage to hit opposing Steel-types, but Dark Pulse is usually preferred over it for its ability to deal consistent damage to most other types overall.</p> </li> <li> <p>Assault Vest makes Hydreigon a very potent sponge against special moves when combined with its ability to use Snarl for further reduction, especially for its teammates. Its high Special Attack lets it deal respectable damage despite running a more support-oriented set.</p> </li> <li> <p>The Speed EVs allow Hydreigon to outrun maximum Speed Timid Gholdengo, and as a result, Armarouge of all Speed investments, allowing it to immediately use Snarl and lower their damage output. The Special Attack EVs let it always 2HKO maximum HP and 4 Special Defense Armarouge and uninvested Gholdengo with Dark Pulse. The Special Defense EVs make -1 Modest maximum Special Attack Choice Specs Gholdengo's Shadow Ball only a possible 5HKO on Tera Steel Hydreigon, while Make It Rain rocks a petty chance to even 7HKO. -1 Armarouge Aura Sphere also only has about a 50% chance to 4HKO Hydreigon. Note that Hydreigon should not be Terastallized against Armarouge to maintain the Fire resistance and Psychic immunity, as it is still weak to Aura Sphere when Terastallized. Opposing Tera Fire Hydreigon never OHKOes Tera Steel Hydreigon with Life Orb Heat Wave when spread damage is accounted for, allowing Hydreigon to retaliate with Snarl. The physical bulk allows Hydreigon to never be 2HKOed by maximum Attack Adamant Annihilape Drain Punch and Jolly maximum Attack Garchomp Brick Break.</p> </li> <li> <p>Steel Tera type is the best defensive type for Hydreigon, allowing it to hard check most special attackers such as Gholdengo and Sylveon while holding its own against Pokemon such as Grimmsnarl. Poison Tera type, on the other hand, lets Hydreigon maintain the Fairy resistance that Steel gives it while also awarding it an additional resistance to Fighting in the face of Pokemon such as Annihilape and Hariyama. Tera Blast should be used instead of Flash Cannon to hit Fairy-types on Tera Poison sets.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Sole Survivor", "user_id": 518634}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Volcarona": {"sets": {"Quiver Dance Sweeper": {}, "Support": {}}},
  "Tornadus": {"sets": {"Bulky Tailwind": {}, "Bulky Tailwind Setter": {"outdated": true}}},
  "Thundurus": {"sets": {"Support": {}}},
  "Landorus-Therian": {"sets": {"Assault Vest": {}, "Bulky Attacker": {}, "Choice Scarf": {}, "Scarf": {"outdated": true}}},
  "Talonflame": {"sets": {"Support": {}}},
  "Sylveon": {
    "sets": {
      "Bulky Attacker": {},
      "Offensive": {
        "outdated": true,
        "description": "<ul> <li> <p>Tera Blast + Fire Tera type gives Sylveon a strong matchup against Steel-types like Gholdengo and Tera Steel Hydreigon. When not Terastallized, Tera Blast is boosted by Pixiliate and is still useful for dealing damage when faced by Wide Guard users like Armarouge. Fairy Tera type makes Sylveon's Hyper Voice even more powerful, letting it 2HKO even naturally bulky Pokemon like Kingambit and Hatterene; this can be used over Fire Tera type on teams that can afford the loss in effectiveness against Steel-types like Gholdengo. Ground Tera type is an option that lets Sylveon hit opposing Fire-types like Ceruledge and Armarouge hard, retain good damage against Steel-types, and avoid a burdensome weakness to Garchomp, though Sylveon strongly values the resistance to Steel that a Fire Tera type grants.</p> </li> <li> <p>Substitute is good for blocking Amoonguss's Spore, preventing its Clear Smog from resetting Sylveon's stat boosts, and taking advantage of defensive play. Quick Attack is an option that can prove particularly useful against Tailwind teams, picking off Pokemon brought down to their Focus Sash like Murkrow and Kilowattrel, as well as other weakened Pokemon.</p> </li> <li> <p>Calm Mind is an option that can be particularly potent on bulkier teams with damage mitigation from Pokemon like Gyarados and Grimmsnarl to help Sylveon set up.</p> </li> <li> <p>Throat Spray is a no-drawback way of improving Sylveon's offense; a +1 Hyper Voice will 2HKO most offensive Pokemon that do not resist Fairy. Life Orb lets Sylveon immediately 2HKO or nearly 2HKO most offensive Pokemon at the cost of recoil that could put it in range of attacks like Tera Ground Garchomp's Earthquake. Leftovers is good alongside Calm Mind on bulkier teams where Sylveon wants to stick around longer. Safety Goggles grants Sylveon immunity to Amoonguss's Spore.</p> </li> <li> <p>On Tailwind teams Sylveon can run 212 Speed EVs, taken from its HP stat, to outpace Dragapult.</p> </li> </ul>"
      },
      "Choice Specs": {
        "outdated": true,
        "description": "<ul> <li> <p>Choice Specs is Sylveon's most immediately powerful set, it can 2HKO most offensive Pokemon that do not resist Fairy. It's much more immediately powerful than Throat Spray Sylveon and a bit stronger than Life Orb Sylveon without wearing itself down with recoil, helping it stay out of range of attacks like Tera Ground Garchomp's Earthquake.</p> </li> <li> <p>Tera Blast + a Fire Tera Type lets Sylveon hit Fairy-resistant foes like Gholdengo and Amoonguss hard, and the typing is defensively useful against the former. Tera Blast is also useful by itself in the face of Wide Guard, giving Sylveon an option besides Hyper Beam, which has a turn of recharge, for a single target Fairy-type attack.</p> </li> <li> <p>Shadow Ball hits Armarouge, Ceruledge, and Skeledirge, which resist Fairy, and is a strong option against Gholdengo and Gengar if Terastallizing is off the table.</p> </li> <li> <p>Hyper Beam OHKOes bulky Pokemon like Rotom-W and Kingambit that can take Hyper Voice.</p> </li> <li> <p>212 Speed EVs, taken from Sylveon's HP stat, let it outpace Dragapult on Tailwind teams.</p> </li> </ul>"
      }
    }
  },
  "Goodra-Hisui": {"sets": {"Armor Press": {}, "AcidPress": {"outdated": true}}},
  "Mimikyu": {"sets": {"Offensive": {}}},
  "Kommo-o": {"sets": {"Clangorous Soul": {}, "Iron Defence": {}}},
  "Rillaboom": {"sets": {"Offensive Pivot": {}, "Priority Attacker": {}, "Bulky Attacker": {"outdated": true}}},
  "Corviknight": {"sets": {"Bulk Up": {}, "Tailwind Support": {}}},
  "Hatterene": {
    "sets": {
      "Offensive": {},
      "Trick Room Sweeper": {
        "outdated": true,
        "description": "<ul> <li> <p>Mystical Fire lets Hatterene deal decent damage to Steel-types such as Gholdengo and Kingambit, which it would otherwise fail to hit effectively.</p> </li> <li> <p>Covert Cloak renders Hatterene immune to the secondary effects of moves like Snarl and Fake Out, which, combined with Magic Bounce, greatly limits the ways the opponent can deal with it. Life Orb makes Hatterene a far more threatening sweeper but noticeably hinders its longevity, leaving it more vulnerable to revenge killing from powerful priority moves.</p> </li> <li> <p>Tera Fire lets Hatterene turn the tables on Steel-types, such as Gholdengo looking for a quick KO before it sets up Trick Room. Tera Fairy removes Hatterene's weakness to Ghost and makes Dazzling Gleam hit harder. Tera Steel gives Hatterene a slew of resistances and allows it to surprise Fairy-types like Sylveon with a super effective Tera Blast. Steel-type Tera Blast also OHKOes Garganacl, which would otherwise wall it endlessly. Tera Psychic gives Hatterene a boosted STAB option that isn't resisted by Fire-types.</p> </li> <li> <p>Shadow Ball is a niche option to cover common Ghost- and Psychic-types. After You allows Hatterene to support Pokemon with higher Speed during Trick Room, such as Meowscarada and Gengar. Focus Sash is an option if Hatterene doesn't run a defensive Tera type.</p> </li> </ul>"
      }
    }
  },
  "Grimmsnarl": {"sets": {"Screens Setter": {}, "Dual Screens": {"outdated": true}, "Double Screens": {"outdated": true}, "Pivot": {"outdated": true}}},
  "Indeedee-F": {"sets": {"Trick Room Support": {}, "TR Support": {"outdated": true}, "Redirector": {"outdated": true}}},
  "Dragapult": {"sets": {"Choice Band": {}, "Glass Cannon": {"outdated": true}}},
  "Urshifu": {"sets": {"Glass Cannon": {}, "Swords Dance": {}, "Choice Band": {}, "Bulky Attacker": {"outdated": true}}},
  "Urshifu-Rapid-Strike": {"sets": {"Scarf": {}, "Bulky Attacker": {}, "Choice Scarf": {"outdated": true}}},
  "Regidrago": {"sets": {"Tailwind Sweeper": {}, "Tailroom": {"outdated": true}}},
  "Ursaluna": {"sets": {"TR Sweeper": {}}},
  "Ursaluna-Bloodmoon": {"sets": {"Bulky Attacker": {}}},
  "Basculegion": {"sets": {"Rain Abuser": {}}},
  "Meowscarada": {"sets": {"Offensive": {}}},
  "Pawmot": {
    "sets": {
      "Revival Blessing": {},
      "Revival Blessing Support": {
        "outdated": true,
        "description": "<ul> <li> <p>Revival Blessing is an extremely invaluable tool that lets Pawmot revive crucial teammates such as Dondozo and Meowscarada, very likely turning the battle in the user's favor. It is Pawmot's most important move, but an attack is slotted first in case the timer forces Pawmot to use its first move. Double Shock is better here if Pawmot Terastallizes into the Electric typing, which lets it repeatedly use the move without drawback or failure. If running the Fighting Tera type or not Terastallized, Close Combat is better in this moveslot.</p> </li> <li> <p>Focus Sash, in tandem with Pawmot's high Speed, ensures it gets at least two moves off if it is not double targeted.</p> </li> <li> <p>Volt Absorb synergizes with Electric-weak teammates such as Dondozo, while Natural Cure allows Pawmot to brush off status moves such as Amoonguss's Spore.</p> </li> <li> <p>Both the Electric and Fighting Tera types provide offensive benefits to Pawmot, turning an attack into a reliable source of damage against a plethora of common Pokemon such as Murkrow, Dondozo, and/or Hydreigon. The Electric Tera type lets it use Double Shock repeatedly, which avoids the drawback of Close Combat lowering its defenses, turning it into a potent cleaner.</p> </li> </ul>"
      }
    }
  },
  "Maushold": {"sets": {"Friend Guard": {}, "Wide Lens": {"outdated": true}, "Support": {"outdated": true}}},
  "Maushold-Four": {"sets": {"Wide Lens": {}, "Support": {}}},
  "Garganacl": {
    "sets": {
      "Salt Cure": {},
      "IronPress Sweeper": {
        "outdated": true,
        "description": "<ul> <li> <p>Purifying Salt protects Garganacl from status moves like Amoonguss's Spore and Rotom-W's Will-O-Wisp.</p> </li> <li> <p>The EV spread slightly optimizes Special Defense and helps Garganacl against special attackers like Armarouge and Hydreigon. Garganacl isn't outspeeding much of anything, so it might as well aim to underspeed opposing Trick Room Pokemon; minimum Speed lets Garganacl Speed tie Mudsdale while easily underspeeding Kingambit and Hariyama.</p> </li> <li> <p>Tera Ghost gives Garganacl an immunity to Fighting and leaves it with effectively just one weakness, since Purifying Salt halves the power of Ghost-type attacks. Tera Grass prevents Amoonguss from redirecting Garganacl's Body Press via Rage Powder, and its Water and Electric resistances are helpful against Rotom-W. Tera Steel gives Garganacl a plethora of resistances like Dragon, Grass, Fairy, and Steel, which are helpful against Pokemon like Hydreigon, Meowscarada, Gholdengo, and Sylveon, and it makes Garganacl immune to Amoonguss's Clear Smog.</p> </li> </ul>"
      }
    }
  },
  "Armarouge": {
    "sets": {
      "TR Sweeper": {},
      "Trick Room Sweeper": {"outdated": true},
      "Offensive": {"outdated": true},
      "Trick Room": {
        "outdated": true,
        "description": "<ul> <li> <p>Armor Cannon is a nuclear single-target attack that can OHKO Amoonguss, OHKO Kingambit, and even give a good shot to 2HKO Grimmsnarl through Light Screen. Alternatively, Heat Wave is a strong spread move option alongside Life Orb, which compensates for its considerably lower power than Armor Cannon. Being a spread move, it doesn't mind redirection users like Rage Powder Amoonguss or make Armarouge choose between targeting one of two Protect users.</p> </li> <li> <p>Psychic is used when not paired with Indeedee-F. Expanding Force is preferred alongside Indeedee-F, which makes Expanding Force much stronger and a spread move via Psychic Terrain.</p> </li> <li> <p>Wide Guard protects Armarouge and its teammates from attacks like Garchomp's Earthquake and Tyranitar's Rock Slide. Energy Ball lets Armarouge OHKO Rotom-W and TeraGround Garchomp with Tera Grass,and it has a good chance to 2HKO Tyranitar with Life Orb, even without Terastallizing. Aura Sphere 2HKOes Hydreigon and Tyranitar, and with Life Orb, it OHKOes them with minimal damage.</p> </li> <li> <p>Life Orb makes Armarouge very powerful, securing OHKOs against Pokemon like Maushold, slightly chipped Hatterene, and, with Expanding Force in Psychic Terrain, slightly chipped Garchomp and Rotom-W. Safety Goggles grants Armarouge immunity to Amoonguss's Spore and Rage Powder.</p> </li> <li> <p>A Grass Tera type gives Armarouge Ground and Water resistances, which are good against Garchomp and Rotom-W. Tera Dark is a good option to improve matchups against Ghost- and Psychic-types like Ceruledge, Skeledirge, and opposing Armarouge, make Armarouge immune to Prankster Murkrow's Taunt, and give it a resistance to Kingambit's Sucker Punch. Dark Pulse can be used alongside Tera Dark to more heavily damage Ghost- and Psychic-types, though outside of opposing Armarouge, Life Orb Psychic can usually 2HKO them.</p> </li> </ul>"
      }
    }
  },
  "Ceruledge": {"sets": {"Bulk Up Sweeper": {}, "Bulk Up": {"outdated": true, "description": "<ul> <li> <p>Shadow Sneak finishes off weakened Pokemon, Focus Sash users like Kilowattral, hits opposing Ceruledge, and lets Ceruledge revenge kill Ghost-weak Pokemon like Gholdengo. Tera Blast + Tera Grass lets Ceruledge hit Fire-resistant Pokemon like Tyranitar, Rotom-W, and Garchomp.</p> </li> <li> <p>Clear Amulet prevents Ceruledge from being weakened by Intimidate users like Paldean Tauros-A, Arcanine, and Gyarados, as well as Parting Shot Grimmsnarl.</p> </li> <li> <p>Grass is easily Ceruledge's best Tera type, giving it a Water and Ground resistance for the likes of Garchomp and Rotom-W and making it immune to Amoonguss's powder moves. Flash Fire lets Ceruledge do extremely well against opposing Fire-types, especially when Terastallized, as it will shed its weakness to super effective coverage moves like Torkoal's Earth Power and opposing Ceruledge's Shadow Sneak.</p> </li> </ul>"}}},
  "Kilowattrel": {
    "overview": "<ul> <li> <p>Kilowattrel stands out as one of the best Tailwind setters in the current metagame. Its base 125 Speed stat lets it set Tailwind first, with very little Prankster Tailwind Pokemon stopping it from doing so.</p> </li> <li> <p>Kilowattrel has a respectable base 105 Special Attack stat and a good offensive typing, allowing it to tackle the likes of Meowscarada and Gyarados well.</p> </li> <li> <p>Kilowattrel appreciates immediately hard-hitting partners such as Choice Specs Gholdengo and Garchomp to break through opposing teams. Gholdengo is great in particular thanks to its immunity to Dragonite's Extreme Speed.</p> </li> <li> <p>Kilowattrel is particularly frail, meaning it often only gets to set Tailwind and fire off a single attack before it faints. It also means in late-game scenarios, it is unreliable at dueling the meta's most common attackers like Gholdengo and Hydreigon.</p> </li> </ul>",
    "sets": {"Support": {"description": "<ul> <li> <p>Air Slash is Kilowattrel's primary Flying-type STAB move of choice due to its higher accuracy than Hurricane, though the latter may be seen on rain teams.</p> </li> <li> <p>Discharge is a good spread option when next to a Ground- or Electric-type partner like Garchomp or Rotom-F. Volt Switch allows Kilowattrel to use its high base Speed to pivot into a partner that can better use the extra Speed from Tailwind.</p> </li> <li> <p>Competitive acts as an Intimidate-deterrent for physically attacking partners such as Garchomp, Baxcalibur, and Ceruledge.</p> </li> <li> <p>Focus Sash is a must-have, as Kilowattrel is incredibly frail and unable to take any super effective or strong neutral attacks such as Baxcalibur's Icicle Crash and Tera Normal Dragonite's Extreme Speed.</p> </li> <li> <p>Kilowattrel rarely Terastallizes, but when it does, it prefers to use same type Tera to boost the power of one of its STAB moves.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "yuki", "user_id": 294287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yourwelcomethanku", "user_id": 541847}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Tinkaton": {
    "overview": "<ul> <li> <p>Tinkaton is primarily a bulky attacker, but it also has an amazing defensive typing and Fake Out, giving it good defensive utility.</p> </li> <li> <p>Tinkaton does extremely well against Murkrow teams, including Pokemon common on them like Annihilape, Hydreigon, Meowscarada, Maushold, and Murkrow itself. This makes it a very good partner for Dondozo + Tatsugiri teams, which feel pressured by Murkrow's Haze. Many of the aforementioned Pokemon are also very common on teams without Murkrow, so Tinkaton checking them well is broadly useful.</p> </li> <li> <p>Mold Breaker + Fake Out Tinkaton does well against dedicated Trick Room teams because its Fake Out bypasses Oranguru's Inner Focus and Farigiraf's Armor Tail, and it can OHKO Mimikyu through Disguise.</p> </li> <li> <p>Tinkaton struggles with the extremely common Fire-types, as well as Garchomp and Steel-types like Corviknight and Scizor, which wall it entirely. Water-types help deal with the majority of its counters, especially Rotom-W.</p> </li> </ul>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>Knock Off hits Pokemon that resist both its STAB moves like Gholdengo, Armarouge, and Ceruledge and can cripple Pokemon with the item removal, especially Dondozo.</p> </li> <li> <p>Tinkaton has many opportunities to use Swords Dance, especially because opponents will often use Protect consecutively in front of it, expecting a Fake Out or Gigaton Hammer. It's also a good move to use on the Gigaton Hammer recharge turns.</p> </li> <li> <p>Assault Vest turns Tinkaton into a sponge against special attackers, which helps against common Pokemon such as Hydreigon and Gholdengo.</p> </li> <li> <p>Sitrus Berry lets Tinkaton run Protect, which helps it stall out Gigaton Hammer recharge turns. This also pairs well with Swords Dance, which is similarly convenient to have on the recharge turns.</p> </li> <li> <p>Mold Breaker is mainly good when used with Fake Out, as the ability lets Tinkaton flinch Dragonite, Farigiraf, and Oranguru. Mold Breaker also bypasses Mimikyu's Disguise.</p> </li> <li> <p>Own Tempo is valuable because there are multiple good Intimidate users: Arcanine and Gyarados, as well as Paldean Tauros-A, Paldean Tauros-B, and Salamence. If you're not very worried about dedicated Trick Room teams or Dragonite, this is a good way to improve your matchup against bulkier teams.</p> </li> <li> <p>Tera Steel is by far the best Tera type for Tinkaton, as it makes Gigaton Hammer very powerful, even doing good damage to targets that resist it. For example, it 2HKOes maximum HP Talonflame.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "Robbie35646", "user_id": 562330}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yourwelcomethanku", "user_id": 541847}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Palafin": {"sets": {"Bulky Attacker": {}, "Choiced Attacker": {"outdated": true}}},
  "Glimmora": {"sets": {"Specs": {}, "Mortal Spin": {}, "Focus Sash Lead": {"outdated": true}}},
  "Dondozo": {"sets": {"Offensive Commander": {}, "Defensive Solo": {}, "Commander Sweeper": {"outdated": true}}},
  "Tatsugiri": {"sets": {"Scarf Commander": {}, "Choice Item": {"outdated": true}, "Sash": {"outdated": true}}},
  "Annihilape": {
    "sets": {
      "Rage Fist": {},
      "Final Gambit": {"outdated": true},
      "Bulk Up": {
        "outdated": true,
        "description": "<ul> <li> <p>To set up with Bulk Up safely, Annihilape enjoys dual screens and redirection support from Pokemon such as Grimmsnarl and Amoonguss.</p> </li> <li> <p>Tera Blast is used to KO Steel-types Drain Punch does not hit super effectively, such as Gholdengo, without relying on Rage Fist being boosted.</p> </li> <li> <p>The Fire Tera type gives Annihilape an immunity to Will-O-Wisp from Pokemon like Rotom-W and Talonflame and a key resistance to Fairy and neutrality to Ghost and Psychic, useful against opposing Annihilape, Meowscarada, and Armarouge. Furthermore, it lets Annihilape effectively combat Trick Room because, when played under dual screens, Annihilape can counter major Trick Room threats like Hatterene and Tera Fire Torkoal. Alternatively, picking Tera Water focuses on defensive advantages, primarily resistances to Steel- and Fire-type moves such as Gholdengo's Make it Rain and Torkoal's STAB moves.</p> </li> <li> <p>Vital Spirit can be used instead of Defiant for mainly Amoonguss, but also other sleep move users like Yawn Sylveon and Hypnosis Gothitelle.</p> </li> </ul>"
      },
      "Choice Scarf": {
        "outdated": true,
        "description": "<ul> <li> <p>This set is used commonly on Trick Room teams. Annihilape outspeeding most Pokemon, OHKOing them with Final Gambit, and being immune to Fake Out helps teammates like Hatterene and Armarouge set Trick Room, and fainting gives a free switch-in to a slow Trick Room beneficiary such as Tera Fire Torkoal. U-turn provides a switch-in without sacrificing Annihilape, and, while it doesn't OHKO, it hits common Pokemon such as Oranguru and Indeedee-F for large amounts of damage.</p> </li> <li> <p>Shadow Claw is a consistent damage-dealing option that doesn't rely on foes to power it up. However, Rage Fist can still be utilized effectively thanks to Annihilape's bulk. Phantom Force avoids attacks and ignores protecting moves, giving Annihilape opportunities to deal unavoidable damage.</p> </li> <li> <p>While not normally Terastallized, Annihilape can use Tera Ghost to remove its Fairy weakness and give a huge boost to its Ghost-type move, which becomes able to heavily dent much of the metagame.</p> </li> </ul>"
      }
    }
  },
  "Farigiraf": {
    "sets": {
      "TR support": {},
      "Bulky Trick Room": {
        "outdated": true,
        "description": "<ul> <li> <p>Hyper Voice is a decently strong Normal-type STAB move for Farigiraf to spread chip damage that softens up opponents for its allies. Psyshock tackles common Psychic-weak Pokemon such as Amoonguss and Gengar, whereas Dazzling Gleam improves its matchup into common checks like Meowscarada and Hydreigon. Helping Hand allows Farigiraf to supplement a harder hitting teammate's damage output. Imprison is used on fast offensive teams that would otherwise struggle against opposing Trick Room teams.</p> </li> <li> <p>Safety Goggles provides an immunity to Spore from Amoonguss and Breloom, who would otherwise prevent Trick Room from going up with it. Sitrus Berry gives Farigiraf longevity with recovery. Colbur Berry allows Farigiraf to consistently get Trick Room up in the face of Meowscarada and Hydreigon.</p> </li> <li> <p>For other notable items, Mental Herb prevents fast Taunt users like Talonflame from interrupting Farigiraf's Trick Room. Life Orb or Throat Spray are good options to improve Farigiraf's already decent damage output. Rocky Helmet can also be used for an answer to unsuspecting Maushold.</p> </li> <li> <p>180 EVs in HP allow Farigiraf to survive maximum HP Annihilape Final Gambit, and the defensive investment allows it to always survive Tera Steel Choice Specs Gholdengo Make It Rain and Focus Sash Meowscarada Knock Off.</p> </li> <li> <p>Tera Fairy is more of a defensive Tera type, giving it a resistance to all the types that Farigiraf was previously weak to while gaining STAB on Dazzling Gleam. Tera Normal adds damage onto Hyper Voice and removes its Dark weakness.</p> </li> </ul>"
      }
    }
  },
  "Kingambit": {"sets": {"Assault Vest": {}, "Swords Dance": {}}},
  "Great Tusk": {"sets": {"Offensive": {}, "All-Out-Attacker": {}}},
  "Scream Tail": {"sets": {"Support": {}, "Perish Song": {}}},
  "Brute Bonnet": {"sets": {"Loaded Dice": {}, "Support": {}}},
  "Flutter Mane": {"sets": {"Offensive": {}, "Bulky Specs": {}, "Speed Booster": {}, "Choice Specs": {"outdated": true}, "SpA Booster Energy": {"outdated": true}, "SpA Booster": {"outdated": true}, "Glass Cannon": {"outdated": true}}},
  "Iron Bundle": {"sets": {"Glass Cannon": {}, "Snow Abuser": {"outdated": true}}},
  "Iron Hands": {"sets": {"Offensive Pivot": {}, "Setup Sweeper": {"outdated": true}, "Assault Vest": {"outdated": true}, "Setup": {"outdated": true}}},
  "Iron Jugulis": {"sets": {"Tailwind Support": {}}},
  "Iron Moth": {"sets": {"Acid Spray": {}}},
  "Baxcalibur": {"sets": {"Offensive": {}, "Loaded Dice": {}, "Scale Shot": {"outdated": true}, "Assault Vest": {"outdated": true}, "Dragon Dance": {"outdated": true}}},
  "Gholdengo": {
    "sets": {
      "Nasty Plot": {},
      "Choice Specs": {},
      "Choiced Attacker": {"outdated": true, "description": "<ul> <li> <p>Make It Rain and Shadow Ball let Gholdengo take out a wide array of common Pokemon such as Armarouge, Annihilape and Sylveon.</p> </li> <li> <p>Dazzling Gleam allows Gholdengo to fight back against the likes of Hydreigon.</p> </li> <li> <p>Thunderbolt threatens to OHKO the likes of Gyarados and Palafin when equipped with Choice Specs. Trick is a good alternative option to lock Pokemon into undesirable moves, such as Indeedee-F into Trick Room.</p> </li> <li> <p>Choice Specs makes Gholdengo one of the most threatening special attackers in the entire metagame. Choice Scarf lets Gholdengo outspeed Meowscarada, Garchomp, and Dragapult with a Timid nature, which it would otherwise need additional speed control to beat.</p> </li> <li> <p>Steel is Gholdengo's preferred Tera type, boosting the damage output of Make It Rain even further and letting it OHKO Garchomp with ease.</p> </li> </ul>"}
    }
  },
  "Chien-Pao": {"sets": {"Glass Cannon": {}, "Offensive": {"outdated": true}}},
  "Ting-Lu": {"sets": {"Bulky Attacker": {}}},
  "Chi-Yu": {"sets": {"Choice Specs": {}, "Glass Cannon": {}, "Offensive": {}, "Nasty Plot": {"outdated": true}, "Choice Scarf": {"outdated": true}}},
  "Roaring Moon": {"sets": {"Speed Booster": {}, "Attack Booster": {}, "Sun Attacker": {}, "Dragon Dance": {"outdated": true}, "Tailwind Setter": {"outdated": true}}},
  "Sinistcha": {"sets": {"Bulky Support": {}}},
  "Okidogi": {"sets": {"Bulk Up": {}}},
  "Ogerpon": {"sets": {"Swords Dance Sweeper": {}}},
  "Ogerpon-Wellspring": {"sets": {"Setup Sweeper": {}, "Bulky Redirection": {}}},
  "Ogerpon-Hearthflame": {"sets": {"All-out Offense": {}, "Setup Sweeper": {}}},
  "Ogerpon-Cornerstone": {"sets": {"Offensive Redirector": {}}}
}