{
  "Slowbro": {"sets": [{"name": "Defensive", "description": "<p>Tera Fairy helps improve Slowbro's matchup against threats like Slither Wing, Tyranitar, and Mimikyu.</p> "}]},
  "Gengar": {
    "sets": [
      {"name": "Choice Specs", "description": "<p>Tera Ghost is used to power up Shadow Ball, giving Gengar a decent chance to OHKO Quagsire and Talonflame and 2HKO specially defensive Gastrodon. Tera Fairy is an alternative that lets Gengar resist moves such as Sucker Punch from Bisharp and Lokix.</p> "},
      {"name": "Choice Scarf", "description": "<p>Tera Ghost makes up for Choice Scarf Gengar's lack of power, ensuring that it can 2HKO Quagsire. Tera Fairy lets Gengar resist Sucker Punch from Bisharp and Lokix.</p> "},
      {"name": "Substitute + 3 Attacks", "description": "<p>Tera Ghost ensures that Gengar can 2HKO Quagsire. Tera Fairy lets it resist Sucker Punch from Bisharp and Lokix. Leftovers should always be run instead of Black Sludge to prevent self-damage when Terastillizing.</p> "},
      {"name": "Nasty Plot", "description": "<p>Tera Ghost powers up Gengar's Shadow Ball, possibly OHKOing Gastrodon at +2 and maximizing its damage versus Unaware Quagsire, all while removing its Ground weakness. Tera Fairy prevents Sucker Punch users such as Bisharp and Lokix from revenge killing it.</p> "},
      {"name": "Hex", "description": "<p>Tera Ghost powers up Gengar's Hex, 2HKOing a burned Gastrodon and removing its Ground weakness, letting it potentially beat it one-on-one. Tera Fairy  allows Gengar to resist Sucker Punch from Bisharp and Lokix. Leftovers should always be run instead of Black Sludge to prevent self-damage when Terastillizing.</p> "}
    ]
  },
  "Tauros-Paldea-Blaze": {"sets": [{"name": "Utility Attacker"}, {"name": "Bulk Up", "description": "<p>Tera Fighting helps strengthen the power of Close Combat.</p> "}, {"name": "Choice Scarf", "description": "<p>Tera Fighting helps remove the Stealth Rock weakness from Paldean Tauros-F and increases the power of Close Combat.</p> "}]},
  "Tauros-Paldea-Aqua": {"sets": [{"name": "Choice Band"}, {"name": "Bulk Up"}]},
  "Gyarados": {"sets": [{"name": "Dragon Daunce + Taunt"}, {"name": "Offensive Dragon Dance"}]},
  "Quagsire": {"sets": [{"name": "Unaware Wall", "description": "<p>Tera Poison prevents Quagsire from being poisoned by Grafaiai while improving its matchup versus Slither Wing and Lucario. Water Absorb sets also benefit from it improving its matchup versus Tera Grass Barraskewda and Floatzel.</p> <p>Tera Steel also prevents poison, gives Quagsire the opportunity to surprise Toxtricity and Staraptor, and lets it beat Maushold. Water Absorb sets should avoid using this Tera type due to Close Combat Barraskewda beating it.</p> <p>Tera Ghost lets Quagsire spinblock, keeping its entry hazards up while helping versus Lucario regardless of Quagsire's ability, all while providing an immunity to Boomburst from Toxtricity and Noivern.</p> "}]},
  "Slowking": {"sets": [{"name": "Defensive Pivot", "description": "<p>Tera Fairy lets Slowking improve its matchups against Slither Wing, Tyranitar, and Sandy Shocks. Tera Water lets Slowking power up its Surf to better threaten targets like Slither Wing and Unaware Quagsire, and it removes its weakness to Bug- and Dark-type moves from Slither Wing and Bisharp.</p> "}]},
  "Scizor": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Donphan": {"sets": [{"name": "Offensive Utility"}]},
  "Tyranitar": {"sets": [{"name": "Choice Band"}, {"name": "Dragon Dance"}, {"name": "Stealth Rock"}]},
  "Pelipper": {"sets": [{"name": "Rain Setter", "description": "<p>Tera Ground allows Pelipper to be immune to Electric-type attacks from foes like Sandy Shocks, Kilowattrel, and Toxtricity, being able to retaliate with a powerful Hydro Pump, while also removing its Stealth Rock weakness.</p> "}]},
  "Gardevoir": {"sets": [{"name": "Choice Scarf"}]},
  "Salamence": {"sets": [{"name": "Special Attacker", "description": "<p>Tera Fairy removes Salamence's weakness to Stealth Rock and Noivern's Draco Meteor while retaining its good matchup against Slither Wing.</p> <p>Tera Ghost lets Salamence completely counter Lucario and Maushold while retaining its good matchup against Slither Wing.</p> <p>Tera Steel lets it check Grafaiai, Maushold, and Staraptor, and revenge kill Lucario even when weakened.</p> <p>Tera Dragon gives Draco Meteor a huge power boost, letting Salamence put more pressure onto checks like Gastrodon and Slowking in addition to making it resist Pawmot's Double Shock.</p> "}, {"name": "Dragon Dance", "description": "<p>Tera Steel lets Salamence set up against Pokemon like Scream Tail, Grafaiai, and Staraptor.</p> "}]},
  "Staraptor": {"sets": [{"name": "Choice Scarf", "description": "<p>Tera Flying increases Staraptor's damage against targets such as Tinkaton, 2HKOing it. Tera Normal can be used to remove its Stealth Rock weakness. However, Double-Edge isn't as spammable as Brave Bird due to the presence of Ghost-types.</p> "}, {"name": "Choice Band", "description": "<p>Tera Flying increases Staraptor's damage against targets such as Tinkaton and Quagsire, possibly OHKOing the latter. Tera Ground can be used to provide a resistance to Stealth Rock and mitigate chip damage while taking advantage of the fact Choice Band Staraptor already has very little defensive counterplay. It can also turn the tables against Electric-types like Sandy Shocks.</p> "}]},
  "Gastrodon": {"sets": [{"name": "Mixed Wall", "description": "<p>Tera Poison allows Gastrodon to resist Fighting-type attacks from Slither Wing and Hawlucha, as well as Power Whip from Tsareena. It also gains a Toxic immunity, which lets it beat foes like Grafaiai, and it resists other miscellaneous attacks such as Play Rough from Mimikyu and First Impression from Lokix.</p> <p>Tera Ghost allows Gastrodon to stop Rapid Spin users such as Tsareena and Donphan from removing its entry hazards, although it should be wary of the latter's high Attack. It also resists Slither Wing's STAB moves and shuts down Swords Dance Lucario.</p> "}]},
  "Lucario": {"sets": [{"name": "Swords Dance", "description": "<p>Inner Focus prevents Lucario from having its Attack dropped by Salamence's Intimidate. Tera Normal lets Lucario gain a STAB bonus on its Extreme Speed to sweep teams after setting up.</p> "}]},
  "Hippowdon": {"sets": [{"name": "", "description": "<p>Stone Edge can be used over Stealth Rock if the team has another Stealth Rock user such as Tinkaton.</p> "}]},
  "Magnezone": {"sets": [{"name": "Assault Vest"}]},
  "Gallade": {"sets": [{"name": "Choice Band"}, {"name": "Choice Scarf"}]},
  "Rotom-Mow": {"sets": [{"name": "Nasty Plot"}]},
  "Haxorus": {"sets": [{"name": "Dragon Dance"}, {"name": "Swords Dance"}]},
  "Bisharp": {"sets": [{"name": "Swords Dance"}]},
  "Talonflame": {"sets": [{"name": "Taunt"}, {"name": "Utility"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Noivern": {"sets": [{"name": "Pivot", "description": "<p>Tera Fairy lets Noivern check opposing Dragon-types while retaining its important resistances to Fighting and Bug. Tera Dragon boosts the power of Draco Meteor significantly. Tera Steel lets Noivern better handle Pokemon like Scizor, Grafaiai, and Lucario.</p> "}, {"name": "Choice Specs", "description": "<p>Frisk lets Noivern scout for items such as Choice Scarf from Sandy Shocks. Infiltrator can be used to hit Gengar with Draco Meteor through Substitute and be more threatening versus dual screens teams. Tera Normal gives Noivern a huge power boost on Boomburst, letting it guarantee an OHKO versus Quagsire.</p> "}]},
  "Oricorio-Pom-Pom": {"sets": [{"name": "Quiver Dance", "description": "<p>52 Speed EVs allows Oricorio-Pom-Pom to outspeed Talonflame after a Quiver Dance, with the remaining EVs being invested in HP and Defense to take hits more easily from priority users like Lokix, Slither Wing, and Lucario. Tera Ground transforms Revelation Dance into a Ground-type attack, hitting foes like Tinkaton, Tyranitar, and Sandy Shocks for super effective damage.</p> "}]},
  "Oricorio-Sensu": {"sets": [{"name": "Quiver Dance"}]},
  "Lycanroc-Dusk": {"sets": [{"name": "All-out Attacker"}]},
  "Salazzle": {"sets": [{"name": "Offensive", "description": "<p>Salazzle should rarely be Terastillized, as it loses its 4x resistance to First Impression from Slither Wing and Lokix and doesn't notably benefit from any type change. Tera Ghost can be useful for spinblocking, though.</p> "}]},
  "Tsareena": {"sets": [{"name": "Utility", "description": "<p>The given Speed EVs allow Tsareena to outspeed Kilowattrel after a Rapid Spin. Although Tsareena should Terastallize rarely, Tera Steel helps Tsareena act as an emergency check to Staraptor and Gengar by tanking Brave Bird and Sludge Bomb respectively and allowing it to decently chip them.</p> "}]},
  "Mimikyu": {"sets": [{"name": "Swords Dance", "description": "<p>Tera Fire allows Mimikyu to avoid Flame Body and Will-O-Wisp from Talonflame and Coalossal. Tera Ghost powers up Shadow Claw and lets it OHKO Tinkaton after a boost.</p> "}]},
  "Toxtricity": {"sets": [{"name": "Wallbreaker", "description": "<p>Tera Normal boosts the power of Boomburst to insane levels, being able to outright OHKO specially defensive Hippowdon and Gastrodon after only one layer of Spikes.</p> "}, {"name": "Shift Gear", "description": "<p>Tera Normal boosts the power of Boomburst to insane levels, OHKOing Hippowdon and doing massive damage to Gastrodon and Scream Tail.</p> "}, {"name": "Choice Scarf", "description": "<p>Tera Normal boosts the power of Boomburst to make up for the decreased power, being able to still have great odds to OHKO Hippowdon after 1 layer of Spikes and 2HKO Gastrodon with no entry hazards on the field.</p> "}]},
  "Polteageist": {"sets": [{"name": "Shell Smash", "description": "<p>Tera Blast in conjunction with Tera Fighting gives Polteageist the necessary coverage to break past Dark-types like Tyranitar, Bisharp, and Iron Jugulis that wall it otherwise. Tera Fighting also allows Polteageist to resist Sucker Punch from Bisharp and Accelrock from Lycanroc-D as well as take neutral damage from Mimikyu's Shadow Sneak.</p> "}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Lokix": {"sets": [{"name": "Choice Band", "description": "<p>Tera Bug is generally more useful to maximize Lokix's revenge killing capabilities, but Tera Fighting allows Lokix to OHKO Talonflame with Axe Kick.</p> "}]},
  "Pawmot": {"sets": [{"name": ""}, {"name": ""}]},
  "Maushold": {"sets": [{"name": "The Smaller Family"}]},
  "Maushold-Four": {"sets": [{"name": "The Family"}]},
  "Kilowattrel": {"sets": [{"name": "Offensive"}]},
  "Grafaiai": {"sets": [{"name": "Poison Touch Pivot"}, {"name": "Offensive Prankster"}, {"name": "Bulky Prankster", "description": "<p>Alternative spread: 252 HP / 4 Def / 252 SpD. Can be used if not running Gunk Shot to better switch into Gengar.</p> "}]},
  "Brambleghast": {"sets": [{"name": "Utility"}]},
  "Tinkaton": {"sets": [{"name": "Utility"}, {"name": "Swords Dance"}]},
  "Tatsugiri": {"sets": [{"name": "Spinning Sushi", "description": "<p>Commander is chosen to let Tatsugiri have an effective way to hit Gardevoir as it would otherwise copy Storm Drain via Trace and be immune to both Surf and Draco Meteor. Storm Drain can be used in conjunction with Tera Fairy to completely wall opposing Tatsugiri.</p> "}]},
  "Scream Tail": {"sets": [{"name": "Wish Support", "description": "<p>Scream Tail should very rarely be Terastillized, as its typing is needed to check foes like Gallade, Hawlucha, and Noivern and there are far better users of the mechanic. However, Tera Steel can let it check Gardevoir, Grafaiai and Staraptor in a pinch.</p> "}, {"name": "Dual Screens", "description": "<p>Scream Tail should very rarely be Terastillized, as its typing is needed to check foes like Gallade, Hawlucha, and Noivern and there are far better users of the mechanic. Additionally, its sole purpose is to set up dual screens and entry hazards, and changing to another type will not make a massive impact compared to another teammate.</p> "}]},
  "Slither Wing": {"sets": [{"name": "All-Out-Attacker", "description": "<p>Tera Bug powers up Slither Wing's First Impression and U-turn to maximize its revenge killing potential and chip damage.</p> "}, {"name": "Bulky Pivot", "description": "<p>Morning Sun lets Slither Wing use its typing more effectively to check Pokemon such as opposing Slither Wing and Tsareena. Stun Spore instead lets Slither Wing cripple switch-ins like Salamence and Talonflame to create openings for teammates such as Choice Specs Toxtricity.</p> <p>Tera Ghost lets Slither Wing spinblock and check Maushold and Lucario. Tera Bug is an alternative that improves its ability to revenge kill Pokemon.</p> "}]},
  "Sandy Shocks": {"sets": [{"name": "Pivot"}, {"name": "Hazard Lead"}, {"name": "Choice Scarf"}]},
  "Iron Jugulis": {"sets": [{"name": "Choice Specs"}, {"name": "Pivot"}, {"name": "Booster Energy"}]},
  "Wo-Chien": {"sets": [{"name": "Leech Seed + Protect", "description": "<p>Tera Ghost allows Wo-Chien to spinblock and effectively check would-be threats like Maushold and Slither Wing. Tera Poison makes Wo-Chien immune to being poisoned while giving it a Fighting resistance. Alternative spread: 252 HP / 240 Def / 16 SpD</p> "}, {"name": "RestTalk", "description": "<p>Tera Ghost allows Wo-Chien to spinblock and effectively check would-be threats like Maushold and Slither Wing. Tera Poison makes Wo-Chien immune to being poisoned while giving it a Fighting resistance. Alternative spread: 252 HP / 240 Def / 16 SpD</p> "}]}
}