{
  "Charmander": {"sets": {"Sun Wallbreaker": {}}},
  "Sandshrew-Alola": {"sets": {"Snow Sweeper": {}}},
  "Diglett-Alola": {"sets": {"Life Orb": {}}},
  "Meowth": {"sets": {"Revenge Killer": {}}},
  "Psyduck": {"sets": {"Rain Wallbreaker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 330191, "username": "Altariel von Sweep"}]}]}},
  "Mankey": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Mankey is one of the most powerful Choice Scarf users in Little Cup thanks to its high Speed, which allows it to outpace or tie with the entire unboosted metagame. This allows Mankey to beat other common Choice Scarf users such as Magnemite, Mudbray, and Gothita. U-turn allows it to greatly capitalize on the switches it forces. Earthquake is a powerful coverage move that hits Mareanie, Glimmet, and Voltorb. Assurance is used to deal as much damage as possible to Ghost-types, OHKOing Eviolite variants on the switch if Stealth Rock is up, while Ice Punch OHKOes Toedscool and threatens Flying-types like Wattrel. Stone Edge is an uncommon option to hit Larvesta and Flying-types. Vital Spirit can be helpful on teams lacking a Grass-type, as it provides a switch-in to Toedscool's Spore, while Defiant is very useful in matchups against Pokemon such as Sticky Web Surskit and Parting Shot Shroodle, as the Attack boosts make Mankey nigh unwallable. Tera Fighting allows Mankey to hit as hard as possible with Close Combat in situations where an unboosted hit is insufficient. Some of Mankey's best teammates include Toedscool to switch in on Ghost-types and remove entry hazards, which can hamper Mankey's pivoting abilities, and either Gothita or Diglett, which can remove the bulky Poison-types like Mareanie and Foongus that give Mankey trouble. Mankey also performs well as part of a VoltTurn core with Pokemon like Volt Switch Voltorb and U-turn Zorua.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 342456, "username": "Drifting"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Growlithe-Hisui": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Hisuian Growlithe serves as a potent wallbreaker with a Choice Scarf. Its ability to spam high-Base Power moves makes it a difficult Pokemon to switch into, often forcing guessing games between Flare Blitz and Head Smash. Psychic Fangs deters more reliable switch-ins to Hisuian Growlithe's STAB moves, hitting Mienfoo and Mareanie. Psychic Fangs also has the additional benefit of breaking screens, something that may hinder Hisuian Growlithe's wallbreaking. The final slot is flexible, with Rock Blast offering a lower-power alternative to Head Smash, with better accuracy and more PP that also beats Terastalized Weak Armor Vullaby. Stealth Rock allows Growlithe to provide role compression to offensive teams through offering entry hazard support, while Sleep Talk lets it sponge Spore from Foongus and still pose a threat. Tera Fire provides a stronger Flare Blitz to power through other bulky checks like Mudbray and the aforementioned Mienfoo.</p> <p>Much like many other wallbreakers in the tier, Hisuian Growlithe prefers having hazards off the field as much as possible. Defog and Rapid Spin users such as Vullaby and Toedscool enable it to get in frequently, with the former also able to provide pivoting support and the latter providing Spore support. Mienfoo is another good teammate, as it can tank opposing Hisuian Growlithe's attacks and pivot your own in. Partners like Gastly and Gothita also provide offensive synergy, being able to pressure checks such as Mareanie and Glimmet.</p>"
      },
      "Eviolite": {
        "description": "<p>Eviolite Hisuian Growlithe is an amazing wallbreaker that trades the immediate speed of Choice Scarf sets for more utility options and the ability to switch moves, boasting powerful attacks that can 2HKO almost any foe without the drawback of recoil. Stealth Rock helps rack up passive damage on opposing Pokemon, while Flame Charge is sometimes chosen for a more offensive approach to make up for Hisuian Growlithe's middling Speed. Will-O-Wisp helps punish common switch-ins like Mienfoo and Mudbray, while Substitute is a safe way to scout for switches and catch Sucker Punch from opposing Pawniard and Stunky. Tera Fire boosts Flare Blitz's damage, allowing it to 2HKO offensive Mudbray, and removes Hisuian Growlithe's weakness to Fighting, while Tera Flying turns Hisuian Growlithe's weaknesses to Ground and Fighting into resistances.</p> <p>Hisuian Growlithe enjoys VoltTurn support from teammates such as Mienfoo and Hisuian Voltorb, which in turn enjoy Hisuian Growlithe's ability to nuke Pokemon like Foongus and Pawniard. Landing a Will-O-Wisp on prominent physical attackers like Mienfoo and Mudbray is greatly appreciated by setup sweepers such as Shellder, which appreciate not taking as much damage on setup turns. Hisuian Growlithe struggles with Pokemon that can resist its STAB moves and KO it back such as Mienfoo and Glimmet, so it pairs well with trappers like Gothita and Trapinch that can remove them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 205631, "username": "BlackKnight_Gawain"}, {"user_id": 623117, "username": "teamo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 440139, "username": "Éric"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 333742, "username": "modularform"}]}]}
  },
  "Bellsprout": {"sets": {"Sun Sweeper": {}}},
  "Slowpoke": {"sets": {"Defensive": {}}},
  "Magnemite": {"sets": {"Choice Scarf": {}}},
  "Doduo": {"sets": {"Fast Attacker": {}}},
  "Grimer-Alola": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Thanks to a solid typing with one weakness and good defensive stats, Alolan Grimer is able to use Knock Offs consistently throughout a game, weakening the opposing team for its teammates to take advantage of. Gunk Shot is used to hit Pokemon that have already been hit by Knock Off, while Drain Punch OHKOs Pawniard and provides some recovery to increase Grimer's longevity. Drain Punch also allows it to damage other Alolan  Grimer neutrally, making it valuable in matchups against opposing Alolan Grimer. Sleep Talk can be used to make Alolan Grimer a great Foongus check and sleep absorber for the team, while Memento gives sweeper teammates a chance to set up. Imprison, together with a bit of Speed investment, lets Alolan Grimer completely shut down opposing Alolan Grimer. Tera Grass eliminates Grimer's only weakness to Ground and lets it take on opposing Hisuian Voltorb more easily.</p> <p>Alolan Grimer is forced out by Ground-types like Mudbray, Numel, and opposing Toedscool, so checks to those Pokemon like Drifloon, Toedscool, and Shellos are essential. Alolan Grimer pairs well with offensive sweepers like Unburden Shroodle, Shellder, and Numel, which can sweep more easily due to Alolan Grimer weakening the enemy team with Knock Off. Grookey is a good partner as well, since Grassy Terrain gives Alolan Grimer much appreciated passive recovery and cuts damage from Earthquake in half, while Alolan Grimer's Knock Off makes switching into Grookey's Wood Hammer much harder. Volt Switch users like Hisuian Voltorb and Wattrel can help get Alolan Grimer in safely, and they can help pressure and overwhelm Ground-types for each other.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 588203, "username": "Charis_Akins"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "ghost"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Shellder": {
    "sets": {
      "Shell Smash": {
        "description": "<p>Shellder is one of Little Cup's premier setup sweepers, with amazing power allowing it to OHKO many tier staples such as fast Mienfoo after Stealth Rock and the ability to outspeed all Choice Scarf users below 19 Speed after a boost. It also boasts a high Defense stat, allowing it to set up more easily against physical threats like Vullaby or withstand some priority moves, such as Stunky's Sucker Punch. With Skill Link, its coverage options Icicle Spear and Rock Blast can do even more damage than Liquidation to most neutral targets. Icicle Spear allows it to hit Grass-types super effectively, Rock Blast deals neutral damage to Water-types, and both allow it to OHKO Vullaby. If Shellder uses Tera Water, Liquidation can OHKO Pawniard after Stealth Rock and a boost and become Shellder's most powerful attack. If Shellder instead uses Tera Ghost, it will be immune or resistant to many forms of priority, including Mienfoo’s Fake Out, Timburr's Mach Punch, and Trapinch's First Impression.</p> <p>Shellder can fit on either hyper offense or bulky offense teams. Damage mitigation provided by dual screens from Impidimp, Will-O-Wisp from Gastly, and Memento users such as Stunky can ensure safer setup and, in Reflect's case, weaken priority moves. On hyper offense teams with dual screens or multiple Memento users, sweepers such as Magby and Nasty Plot Vullaby can break alongside Shellder, trying to either break common counters like Pawniard, force out opponents Terastallization, or set up on each other's counters such as Mienfoo. A team that can make significant progress for Shellder early- and mid-game is necessary when Shellder is used on a bulky offense team, since it is usually the main late-game wincon on these teams. Pokemon such as Mienfoo and Vullaby are very effective at damaging the enemy team as well as switching into other Pokemon, while Memento Stunky has defensive utility, can break, and can provide safe setup for Shellder. After setup, Shellder is weak to priority moves like Pawniard's Sucker Punch, defensive Terastallization, and the bulkiest Pokemon in the tier that it can't hit for super effective damage, including Mareanie, Snubbull, and more.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568849, "username": "Colin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 387847, "username": "Hacker"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Gastly": {
    "sets": {
      "Life Orb": {
        "description": "<p>The combination of Gastly's amazing Ghost / Poison typing and Levitate, strong offensive stats, an 18 Speed tier, and a diverse movepool make it one of the most threatening wallbreakers in the entire metagame. Gastly's sheer versatility is reflected by its ability to pick coverage to beat what it wants to beat, with Life Orb generally giving it that extra push to rack up KOs. Thunderbolt and Dazzling Gleam hit Vullaby, and the latter also punishes Mienfoo. Psychic hits Mienfoo and Poison-types such as Foongus and Glimmet in one moveslot. Substitute is another option to provide Gastly with a way to force Sucker Punch mind games and ease prediction against switch-ins. Tera Stellar allows Gastly to OHKO Vullaby with Thunderbolt from full HP. Alternatively, Tera Poison or Ghost can be run instead; the former boosts Sludge Wave KOes fast pivot Mienfoo at full health, which Sludge Bomb cannot do.</p> <p>Gastly's lack of defenses and weakness to common moves like Knock Off means it generally wants to avoid switching into most moves to ensure its ability to sweep reliably. Vullaby is a good partner to Gastly, giving it pivot support while providing a Dark resistance to switch into checks like Stunky and Pawniard. Fast Choice Scarf users such as opposing Gastly and naturally faster Pokemon like Hisuian Voltorb and Alolan Diglett also do consistently well in keeping it from going out of control. Therefore, a partner like Stunky that can threaten faster Pokemon with strong priority or a bulky pivot such as Mienfoo to play around faster threats is appreciated. Lastly, if all else fails, defensive Terastallization on Pokemon like Mienfoo and Snubbull can flip the matchup on its head. Hisuian Growlithe makes for a good partner, as it can break or soften checks using defensive Terastalization.</p>"
      },
      "Choice Scarf": {},
      "Hex": {
        "description": "<p>Will-O-Wisp Gastly is a potent utility option, carrying not only the benefit of enhanced bulk with Eviolite but also more notably the ability to weaken most physical attackers. Hex becomes the most powerful STAB option Gastly has access to when enabled by Will-O-Wisp burn or Sludge Bomb poison. Tera Fairy Dazzling Gleam threatens Mienfoo and Vullaby while also removing Gastly's Dark weakness, whereas Tera Blast Ground improves Gastly's matchup against Poison- and Steel-types like Glimmet and Pawniard.</p> <p>Beyond simply amplifying the power of Hex, Gastly's ability to debilitate physical attackers can be highly beneficial to setup sweeper teammates such as Shellder and Magby, which can often take advantage of the burn to set up with little consequence. Likewise, a teammate like Foongus or Thunder Wave Hisuian Voltorb can use its own status to assist Gastly in breaking through opposing teams. Threats to look out for include faster foes, such as Hisuian Voltorb and Choice Scarf Hisuian Growlithe, as even with Eviolite, Gastly is somewhat frail.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 205631, "username": "BlackKnight_Gawain"}, {"user_id": 342456, "username": "Drifting"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 387847, "username": "Hacker"}, {"user_id": 440139, "username": "Éric"}, {"user_id": 255030, "username": "Berks"}, {"user_id": 107567, "username": "gali"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 558636, "username": "zastra"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Voltorb-Hisui": {"sets": {"Special Attacker": {}}},
  "Koffing": {
    "sets": {
      "Tank": {
        "description": "<p>Koffing establishes itself as an excellent physical tank in Little Cup due to its high base Defense stat and Poison typing, which let it check physical attackers like Mienfoo and Timburr. Koffing's best use comes from its ability Neutralizing Gas, which has useful applications, such as denying Mienfoo and Foongus recovery from Regenerator, preventing Snivy from gaining a Special Attack boost from Leaf Storm with Contrary, and denying Hisuian Growlithe the ability to avoid recoil from Head Smash and Flare Blitz. Thunderbolt gives Koffing an option to hit Vullaby and Mareanie for super effective damage. Will-O-Wisp can weaken physical attackers that may switch into Koffing such as Mudbray and Trapinch. Pain Split is Koffing's only good recovery option. Fire Blast can be used over Will-O-Wisp or Pain Split to hit Steel-types and Foongus super effectively. Koffing's EV spread allows it to leverage its already high Defense stat and boost its attacks, letting it 2HKO Pokemon like Foongus with Sludge Bomb if its Eviolite is removed. Koffing uses Tera Water, as it's a generally good defensive type, and it additionally lets Koffing take minimal damage from Shellder's Icicle Spear.</p> <p>Teammates that appreciate Koffing's presence include Mudbray, as Koffing can check Snivy, which can come in easily against Mudbray. Pawniard also makes use of Koffing's ability to deny Mienfoo's Regenerator, making it easier to remove it for Pawniard. Koffing struggles against Glimmet and Hisuian Growlithe, as neither are threatened by any of Koffing's attacks. Mudbray is a good teammate, as it can switch in to both Pokemon and scare them out with Earthquake. Additionally, Gothita can assist Koffing with Glimmet due to Shadow Tag, letting it trap Glimmet for Koffing.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "ghost"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Chinchou": {"sets": {"Pivot": {}}},
  "Snubbull": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Snubbull fills a valuable role in Little Cup as a reliable Fighting- and Dark-type check through the combination of its pure Fairy typing and ability in Intimidate, allowing it to check common offensive threats such as Mienfoo, Timburr, and Vullaby. Psychic Fangs allows Snubbull to hit Poison-types like Gastly and Foongus that otherwise wall it. Thunder Wave is a useful tool to hinder opponents, potentially giving Snubbull and its teammates free turns. Thief is a good option for Snubbull in the case that it loses its Eviolite, which happens in nearly every game due to its defensive profile. Earthquake is an option over Thief to hit Steel-types like Pawniard and Tinkatink, as well as OHKOing Hisuian Growlithe. Temper Flare is worth mentioning as well, as it lets Snubbull hit Steel-types and Foongus in one moveslot. The given EV spread allows Snubbull to effectively check the physical attackers it is tasked with taking on while ensuring it still has good power behind its attacks. Snubbull can Terastallize into the Steel typing to cover its weaknesses to Poison- and Steel-type attacks, additionally letting it both resist Vullaby's Brave Bird if Snubbull gets weakened enough for Brave Bird to otherwise KO and survive Snivy's Leaf Storm if it needs to. However, this has the disadvantage of making Snubbull weak to Mienfoo's High Jump Kick, as well as other powerful moves like Mudbray and Trapinch's Earthquake and Hisuian Growlithe's Flare Blitz.</p> <p>Beneficiaries of Snubbull include Stunky, which struggles into the Fighting-types that Snubbull can easily switch into. Mienfoo enjoys Snubbull checking Vullaby, as Vullaby can come in on all of Mienfoo's attacks and threaten teams with its powerful Brave Bird and Knock Off. Snubbull is a decent partner for Pawniard, as Snubbull can switch into Mienfoo's High Jump Kick for Pawniard. Slow, strong Pokemon like Mudbray and Timburr appreciate Snubbull using Thunder Wave to slow down opposing Pokemon. Snubbull itself is threatened by Poison-types such as Foongus and Gastly, with Foongus being able to tank more than one Psychic Fangs and threaten Snubbull with either Sludge Bomb or Spore, while Gastly can threaten an OHKO with Sludge Bomb. Gothita can cover Foongus by trapping it with Shadow Tag, while Stunky can handle Gastly with its natural typing and Knock Off but should be wary of Will-O-Wisp.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 387847, "username": "Hacker"}, {"user_id": 107567, "username": "gali"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Elekid": {"sets": {"Offensive Pivot": {}}},
  "Magby": {"sets": {"Belly Drum": {}}},
  "Torchic": {"sets": {"Life Orb": {}}},
  "Wingull": {"outdated": true, "sets": {"Offensive": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 107567, "username": "gali"}]}]}},
  "Azurill": {"outdated": true, "sets": {"Belly Drum": {}}},
  "Numel": {"sets": {"Special Attacker": {}}},
  "Trapinch": {
    "sets": {
      "Trapper": {
        "description": "<p>Although it suffers competition from Gothita as a trapper, Trapinch is one of LC's best Pokemon thanks to its decent bulk, good coverage, and sky-high Attack stat. Stone Edge gives Trapinch EdgeQuake coverage and allows it to hit Pokemon like Vullaby and Gastly. Trapinch's third moveslot is very flexible; Crunch is generally preferred, enabling it to hit foes like Gastly for super effective damage. Feint allows Trapinch to have another priority option on top of First Impression, allowing it to reliably revenge kill foes that run Protect like Shellder. Finally, Stealth Rock gives Trapinch utility, allowing it to support its own team. First Impression gives Trapinch the ability to revenge kill Pokemon like Gothita, Hisuian Voltorb, and Toedscool. Tera Bug gives Trapinch a useful boost to First Impression, although it does give it an unfavorable weakness to Stealth Rock. Tera Rock is also an option, as it boosts Stone Edge, provides a useful resistance to Fire- and Flying-type attacks, and helps beat Pokemon like Hisuian Growlithe and Vullaby. The given EV spread allows Trapinch to outspeed and reliably trap Snubbull and Foongus.</p> <p>Trapinch's ability to reliably take on and trap a variety of threats like Hisuian Growlithe, Stunky, and Pawniard enables teammates like Vullaby and Doduo, which struggle against these Pokemon. Trapinch is particularly excellent against Steel-types like Pawniard, Tinkatink, and Alolan Diglett; therefore, Pokemon that enjoy having these foes removed like Foongus, Minccino, and Gastly make good partners. VoltTurn support from Pokemon like Mienfoo, Vullaby, and Hisuian Voltorb can give Trapinch a safe opportunity to switch in and trap a threat.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 387847, "username": "Hacker"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 543620, "username": "Vertigo"}]}]}
  },
  "Corphish": {"sets": {"Dragon Dance": {}}},
  "Buizel": {"sets": {"Rain Wallbreaker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 330191, "username": "Altariel von Sweep"}]}]}},
  "Shellos": {"outdated": true, "sets": {"Defensive": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 588203, "username": "Charis_Akins"}]}]}},
  "Stunky": {
    "sets": {
      "Physical Attacker": {
        "description": "<p>Stunky is a potent offensive Pokemon that compresses a strong STAB Knock Off, STAB priority in Sucker Punch, and a grounded Poison-type into a single team slot. Temper Flare allows Stunky to hit Steel-types like Pawniard, Tinkatink, and defensive Tera users like Mienfoo for super effective damage, and its secondary effect synergizes well with Gunk Shot and Sucker Punch, lessening the need for prediction. Substitute is an alternative option that allows Stunky to block status from Foongus or Snubbull and scout defensive Terastallizations from Snubbull and Mienfoo. Maximum Speed investment and a Jolly nature are invaluable for allowing Stunky to outpace metagame staples like Mienfoo and non-Choice Scarf Snivy, as well as Speed tying with Gastly. Tera Dark gives Stunky a stronger Sucker Punch on teams in need of speed control, while Tera Poison provides more defensive utility against foes like Mienfoo and boosts Stunky's strongest move, Gunk Shot.</p> <p>Stunky's role as a grounded Poison-type means it goes well with teams that use Snubbull as a Fighting resistance or a non-Glimmet Stealth Rock setter. Stunky also has offensive synergy with Vullaby, as the pair of strong STAB Knock Off users can heavily pressure defensive cores. Stunky cannot reliably break through Mudbray, so it appreciates teammates like Eviolite Gastly and Snivy that can switch into it and threaten it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 32350, "username": "ghost"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 150971, "username": "Coconut"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Croagunk": {"outdated": true, "sets": {"Bulky Attacker": {}}},
  "Snover": {"sets": {"Snow Setter": {}}},
  "Timburr": {"sets": {"Physical Attacker": {}}},
  "Sandile": {"sets": {"Bulky Stealth Rock": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 553008, "username": "Quinn"}]}]}},
  "Zorua": {"sets": {"Choice Scarf": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 585065, "username": "TheShoddyStrawman"}]}]}},
  "Zorua-Hisui": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Hisuian Zorua provides excellent utility to a team with its combination of a high Special Attack stat, unique defensive typing, and its ability to spread burns and Knock Off. Thanks to its Normal typing, Hisuian Zorua can use Tera Blast as a STAB move even before Terastallizing to hit threats like Alolan Grimer and Shroodle. Tera Fight let it hit Pawniard and provides defensive value by flipping its Dark-type weakness, while Tera Ground additionally allows it to hit Alolan Grimer, Glimmet, and Tinkatink. Hex in combination with Will-O-Wisp's burns does massive damage to even bulkier foes like Mudbray and Toedscool while cleanly OHKOing Drifloon. Will-O-Wisp helps neutralize physical attackers like Pawniard and Crabrawler and can turn them into setup fodders for other sweepers. Knock Off lets Hisuian Zorua soften up opposing teams and is also its best option for hitting opposing Hisuian Zorua. U-turn is an alternative that lets Hisuian Zorua capitalize on the switches it forces from foes like Drifloon. Nasty Plot is an option on dual screens teams where Hisuian Zorua can become a threatening sweeper.</p> <p>Illusion is a highly unique ability that lets Hisuian Zorua create uncomfortable turns for your opponent by disguising as Pokemon whose checks it might beat, and Glimmet and Mudbray appreciate its ability to chip or beat opposing Mudbray and Drifloon, respectively. Pawniard enjoys Hisuian Zorua checking Crabrawler. Hisuian Zorua is often competing with Drifloon for the team's Ghost-type, so it appreciates teammates like Wattrel and Toedscool that can cover for its lack of Ground-type immunity. Crabrawler and Mudbray check opposing Pawniard for Hisuian Zorua when Tera Fight is not an option, and Alolan Grimer, Mudbray, and Croagunk switch into opposing Alolan Grimer.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 32350, "username": "ghost"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Minccino": {"sets": {"Skill Link Attacker": {}}},
  "Gothita": {"sets": {"Trapper": {}}},
  "Deerling": {"outdated": true, "sets": {"Offensive": {}}},
  "Foongus": {
    "sets": {
      "Defensive": {
        "description": "<p>The combination of its good typing, amazing ability, and Spore makes Foongus an excellent defensive pivot that checks many common offensive staples like Mienfoo, Snivy, and Hisuian Voltorb and fits on most balance teams. Spore prevents foes like Timburr and Pawniard from setting up against Foongus. Tera Ghost prevents Foongus from being trapped by Gothita, while Tera Water enables it to survive Fire-type moves from foes like Hisuian Growlithe and Magby. However, after using Tera, Foongus loses its good matchup against Fighting-, Grass- and Electric-types.</p> <p>Teammates like Pawniard, Hisuian Growlithe, and Tinkatink appreciate Foongus checking Mienfoo for them and can in return take care of Vullaby for it. Dark-types like Vullaby and Stunky can take advantage of Gothita trying to trap Foongus. Foongus struggles against Fire-types such as Hisuian Growlithe. Hence, Mudbray and Chinchou also pair well with Foongus, since they're both good switch-ins to Hisuian Growlithe and Vullaby while benefiting from Foongus checking Grass-types like Snivy and Hisuian Voltorb.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 607310, "username": "Nashrock"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 387847, "username": "Hacker"}, {"user_id": 430377, "username": "Acehunter1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Axew": {"sets": {"Dragon Dance": {}}},
  "Mienfoo": {
    "sets": {
      "Fast Pivot": {
        "description": "<p>Mienfoo is an LC staple thanks to its combination of Speed, utility, and defensive resilience via its Fighting typing and Regenerator. High Jump Kick is the STAB move of choice, as its additional Base Power and lack of defensive stat drops make it a superior option to Close Combat. Knock Off allows Mienfoo to make consistent progress by removing the Eviolites of even Pokemon that check it like Foongus and Koffing. U-turn capitalizes on the switches Mienfoo forces and generates offensive momentum while synergizing with Regenerator recovery to keep Mienfoo healthy. Fake Out is useful priority that can wear down opposing sweepers and Choice Scarf users and chip foes into KO range. Taunt is another option that lets Mienfoo block Foongus's Spore and prevent setup. Maximum Speed is preferred to outrun major threats like Vullaby and Hisuian Growlithe. Tera Steel gives Mienfoo a host of invaluable resistances and immunities, most notably to Vullaby's Brave Bird, Stunky's Gunk Shot, while Tera Fairy is a more niche pick that counters opposing Mienfoo.</p> <p>Mienfoo's utility and versatility mean it fits well on virtually any team, but it pairs especially well with Vullaby thanks to its ability to beat Vullaby's checks like Pawniard and Hisuian Growlithe. Vullaby also handles Foongus, especially if running Overcoat, which Mienfoo otherwise struggles to damage. Snubbull is a great teammate in matches where preserving Mienfoo's Eviolite is necessary, as it can easily switch into opposing Mienfoo's Knock Off and punish it with Thief. Mienfoo can do little to opposing Snubbull, so it appreciates teammates like Mudbray and Diglett-A that do not fear Snubbull's Thunder Wave and can threaten it out. Gastly and Stunky cannot reliably switch into Snubbull, but both threaten it with powerful Poison-type STAB moves off of Mienfoo's U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 32350, "username": "ghost"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 150971, "username": "Coconut"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Pawniard": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Pawniard is a solid defensive Pokemon with the potential to win games. Swords Dance can be used against Pokemon such as on Vullaby, Gastly, and Snubbull. Sucker Punch is a strong STAB priority move that allows Pawniard to hit foes that would otherwise outspeed it such as Gastly and Snivy. Tera Flying lets Pawniard beat common Fighting- and Ground-types such as Mienfoo, Mudbray, and Trapinch that would otherwise stop its sweep; Tera Blast cleaves through common Pokemon such as the aforementioned Mienfoo and Foongus. Inner Focus is preferred over Defiant to avoid being flinched by Mienfoo's Fake Out, especially after Terastallizing.</p> <p>Pawniard's presence helps deal with Gastly and Gothita, assisting teammates such as Snivy, Mienfoo, and Timburr. Vullaby works well with Pawniard due to Pawniard's good matchup against both Snubbull and Glimmet. Mienfoo can U-turn into Pawniard and is a great partner for luring in Vullaby and Snubbull. While Pawniard can Terastallize to remove its Fighting weakness, teammates such as Snubbull, Koffing, and Gothita help against Mienfoo and Timburr without needing to Terastallize themsleves. Snubbull and Gastly can help Pawniard set up with Intimidate and Will-O-Wisp, respectively. Gastly deserves a special mention for often burning Stunky that would otherwise stop a Pawniard sweep.</p>"
      },
      "Stealth Rock": {
        "description": "<p>Pawniard is a solid utility Pokemon, pairing its excellent typing that allows it to check common Pokemon like Vullaby and Gastly with its useful support options in Stealth Rock and Thunder Wave. Thunder Wave keeps Pawniard from being too passive, and it combines well with Iron Head to paraflinch opposing Pokemon. Iron Head lets Pawniard hit both Mienfoo and Vullaby for neutral damage. Sucker Punch is a strong priority move that can pick off setup sweepers such as Shell Smash Shellder or Choice Scarf users like Hisuian Growlithe. Pawniard's EV spread gives it the bulk it needs to handle the aforementioned threats while keeping itself fast and strong enough to deal damage on its own. Pawniard struggles with Fighting- and Ground-type moves from Pokemon like Mienfoo and Mudbray respectively, so Pawniard can use Tera Flying to turn these attacks into a resistance and an immunity, respectively.</p> <p>Pawniard can complement Vullaby-weak Pokemon such as Foongus and Gastly, which struggle to deal with Vullaby's STAB moves. Both of these Pokemon provide useful benefits to Pawniard, with Foongus being able to check Mienfoo while Gastly can switch into the Ground-type moves that give Pawniard trouble. Slow and strong wallbreakers such as Mudbray and Eviolite Hisuian Growlithe can take advantage of Thunder Wave from Pawniard to become more threatening when opposing Pokemon are outpaced by them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 585065, "username": "TheShoddyStrawman"}, {"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "ghost"}, {"user_id": 387847, "username": "Hacker"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Vullaby": {
    "sets": {
      "Physical Attacker": {
        "description": "<p>Vullaby cements itself as an elite option in LC due to its versatility, great STAB combination, and ability to check threats like Gastly, Snivy, and Gothita. Knock Off hits Vullaby's few reliable switch-ins like Pawniard, Hisuian Growlithe, and Mudbray and makes them shakier answers without Eviolite. U-turn allows Vullaby to function as a pivot and provide momentum against Pokemon like Tinkatink and Pawniard. Alternatively, Defog is an option to support its teammates that are weak to entry hazards. Weak Armor is a great ability, as it allows Vullaby to outspeed the entire metagame after one Weak Armor drop, making Vullaby more offensively potent. Tera Electric removes all of Vullaby's weaknesses, notably allowing it to resist opposing Vullaby's Brave Bird and giving it immunity to paralysis from Pokemon like Snubbull.</p> <p>Vullaby basically fits on every teamstyle, but it appreciates wallbreakers like Gastly and Hisuian Growlithe that can deal with its checks like Snubbull and Tinkatink. Other Pokemon with pivot moves like Mienfoo and Hisuian Voltorb can form a potent VoltTurn combination with Vullaby. Mudbray and Mienfoo appreciate Vullaby's ability to check Snivy and Foongus. In return, Mudbray and Mienfoo can switch into Pokemon Vullaby is threatened by like Pawniard, Hisuian Growlithe, and Snubbull in Mudbray's case. If Vullaby is instead running Defog, Pokemon weak to Stealth Rock such as Hisuian Growlithe and Larvesta appreciate Vullaby's ability to remove hazards to support them coming in safely.</p>"
      },
      "Nasty Plot": {}
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "ghost"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Larvesta": {"sets": {"Defensive": {}}},
  "Mareanie": {
    "sets": {"Physically Defensive": {"description": "<p>Mareanie is a great defensive pivot capable of checking many common offensive threats like Mienfoo and Pawniard due to its typing and Regenerator. Iron Defense can shut down physical attackers like Mienfoo, Vullaby, and Stunky, and it also helps against sweepers like Shellder. Tera Dragon provides Mareanie valuable resistances against Electric- and Grass- types like Snivy and Hisuian Voltorb.</p> <p>Teammates like Gastly and Snivy enjoy having Mareanie switching into Stunky for them. Mareanie can be easily exploited by Electric-types like Hisuian Voltorb and Elekid, so it is helpful to have teammates like Snivy and Chinchou. Mienfoo and Mareanie pair well together to scout the move Hisuian Growlithe is Choice-locked into for each other while both taking advantage of Regenerator. Dark-types like Vullaby, Pawniard, and Stunky can be very helpful to take advantage of Gothita trying to trap Mareanie.</p>"}},
    "credits": {"writtenBy": [{"user_id": 607310, "username": "Nashrock"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "ghost"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109835, "username": "rosmith"}]}]}
  },
  "Mudbray": {
    "sets": {
      "Offensive Stealth Rock": {
        "description": "<p>Mudbray is one of the best entry hazard setters in LC with the ability to tank attacks from physical attackers like Vullaby, Mienfoo, and Hisuian Growlithe as well as punch holes into opposing teams. Stone Edge allows it to hit common threats like Vullaby and Larvesta. Heavy Slam hits Pokemon that are resistant to its other moves and is a 100% accurate, low-risk move against most of its switch-ins. Tera Steel helps defensively against common threats like Snivy, Vullaby, and Shellder, while offensively, it boosts the power of Heavy Slam.</p> <p>Vullaby is a great teammate for Mudbray, as it checks Ground-immune and Ground-resistant foes such as Gastly and Snivy. In return, Mudbray threatens the Steel- and Rock-types such as Tinkatink, Glimmet, and Hisuian Growlithe that beat Vullaby. Another common teammate is Snivy, as it appreciates Mudbray's ability to beat Poison- and Steel-types like Stunky, Pawniard, and Tinkatink for it. Finally, Snubbull and Mudbray form a powerful defensive core, as Mudbray takes on both of Snubbull's weaknesses with ease and Snubbull can help against powerful physical threats like Mienfoo and Vullaby.</p>"
      },
      "RestTalk": {}
    },
    "credits": {"writtenBy": [{"user_id": 644309, "username": "genisu"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Sandygast": {"sets": {"Defensive": {}}},
  "Grookey": {"sets": {"Choice Scarf": {}, "Pivot": {}}},
  "Chewtle": {"sets": {"Shell Smash": {}}},
  "Impidimp": {"sets": {"Dual Screens": {}}},
  "Fuecoco": {"outdated": true, "sets": {"Defensive": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 607664, "username": "Joeshh"}]}]}},
  "Quaxly": {
    "sets": {
      "Rapid Spin": {
        "description": "<p>Quaxly is a notable Rapid Spin user in LC due to its access to reliable recovery and good matchup into entry hazard setters like Pawniard and Glimmet; it can also double as a capable sweeper thanks to Moxie. Aqua Cutter gives up some power compared to Liquidation but does not make contact, which avoids activating Greavard's Fluffy and Voltorb's Static, and removes the risk of activating Pawniard's Defiant with a Defense drop. Aqua Jet is STAB priority that OHKOs Hisuian Growlithe, while Brave Bird provides super effective coverage versus Grass- and Fighting-types like Toedscool and Foongus. Encore can lock opposing Pokemon into unfavorable moves, such as weak setup moves, gaining momentum for Quaxly's team. Quaxly can use Tera Grass for a better matchup versus Electric- and Grass-types as well as a valuable immunity to Spore from Foongus and Toedscool. Tera Flying can also be used with Brave Bird to turn Quaxly into a more potent offensive threat. Pokemon weak to Stealth Rock, such as Hisuian Growlithe, Wingull, and Nymble, are great partners for Quaxly, as they appreciate the removal of entry hazards to be used at their full potential. Foongus is another good partner, as it can safely switch into Grass-types and provides valuable Spore support. Pokemon such as Toedscool and Wattrel check Electric-types for Quaxly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 449990, "username": "DC"}, {"user_id": 430377, "username": "Acehunter1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}]}
  },
  "Wattrel": {"sets": {"Pivot": {}}},
  "Maschiff": {"outdated": true, "sets": {"Choice Scarf": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 580548, "username": "Shandeur"}]}]}},
  "Bramblin": {"sets": {"Spinner": {}}},
  "Toedscool": {"sets": {"Utility": {}}},
  "Tinkatink": {"sets": {"Utility": {}}},
  "Glimmet": {
    "sets": {
      "Entry Hazard Setter": {
        "description": "<p>Glimmet stands out as one of the tier's best entry hazard setters, learning both Stealth Rock and Spikes and setting Toxic Spikes via its signature ability Toxic Debris. Its unique typing allows it to switch into common threats such as Vullaby and Hisuian Growlithe and set up hazards for its teammates. Mud Shot complements Glimmet's two STAB moves well, giving it crucial coverage for Steel-types and opposing Glimmet. Sludge Bomb is its most powerful STAB move, but Spikes may be used over it to stack additional hazards for its team. Tera Flying is used to turn the tables on Ground-types and to escape being trapped and OHKOed by Trapinch.</p> <p>Glimmet fits best on hyper offense or bulky offense teams that can make good use of the hazards it sets. Powerful attackers and sweepers such as Stunky and Shellder appreciate the hazards set by Glimmet to wear down their checks. Vullaby pairs well with Glimmet, as it covers its type weaknesses well and can take advantage of hazards with its strong attacks. Toedscool and Mienfoo appreciate Glimmet's ability to switch into Vullaby and other Flying-types, whilst in return, they switch into and threaten opposing Ground- and Steel-types respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604180, "username": "SpoiledBerries"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 440139, "username": "Éric"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  }
}