{
  "Venusaur": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Thanks to its amazing defenses, good coverage, and useful ablilty in Thick Fat, Mega Venusaur functions as a good physically defensive wall on balance and bulky offense teams, being able to wall targets like Tapu Fini, Mega Altaria, and Tapu Bulu. It also has a solid offensive presence due to its very high Special Attack, which lets it 3HKO Pokemon like Keldeo and Iron Hands. Sludge Bomb hits the plethora of Grass- and Fairy-types, most notably Tangrowth, Tapu Fini, Clefable, and Mega Altaria. Earth Power provides coverage against Steel-types like Aegislash and Excadrill, and it can also be useful to hit targets like Iron Moth, Skeledirge, and Mega Tyranitar. Knock Off can cripple switch-ins like Latios and Chansey, and Giga Drain hits Water- and Ground-types, threatening the likes of Slowbro, Hippowdon, and specially defensive Gastrodon. Leech Seed lets Mega Venusaur passively heal from Pokemon like Blissey. Synthesis can keep Mega Venusaur healthy in the face of entry hazards and heal in front of targets like Tangrowth that can't damage it heavily. This given EV spread allows Mega Venusaur to outspeed Choice Band Tyranitar. Mega Venusaur, even with its ability, can have a hard time dealing with most Fire-types like Victini, Ceruledge, and Cinderace that can potentially overwhelm it with their boosted attacks, so it appreciate defensive Pokemon like Gastrodon, Tapu Fini, and Skeledirge. Mega Venusaur also has a hard time dealing with special attackers like Alakazam and Choice Specs Hydreigon, making specially defensive teammates like Celesteela and Chansey good teammates. Entry hazard setters like Ting-Lu, Mew, and Excadrill can appreciate having Mega Venusaur as a teammate, as it can remove Heavy-Duty Boots from Pokemon like Cinderace. Mega Venusaur is very susceptible to being chipped by entry hazards so it appreciate entry hazard removal options like Excadrill, Salamence, and Tapu Fini. It is also chipped by sand and burns, so Pokemon that can take advantage of Tyranitar and Hippowdon, such as Excadrill, Keldeo, and Hisuian Lilligant, as well as Pokemon immune to burn like Cinderace and Iron Moth make good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Beedrill": {
    "sets": {
      "Please Don't Use Mega Beedrill": {
        "description": "<p>Despite Mega Beedrill initially seeming like a good Pokemon thanks to its exceptional Attack and Speed stats, great ability in Adaptability, and access to U-turn, it is completely unviable. While U-turn can grab momentum against foes such as Latios and Mega Latias, and Poison Jab has some utility in targeting Fairy-types like Clefable, Bug and Poison is an atrocious STAB combination that has no way to break through common defensive Pokemon like Hippowdon and Buzzwole, and it notably struggles to even touch Steel-types. Skarmory and Celesteela stonewall Mega Beedrill, and while other Steel-types dislike Drill Run and Knock Off, virtually every Steel-type, from Bisharp to Excadrill, can usually beat Mega Beedrill one-on-one. As a pivot, Mega Beedrill suffers massively due to its Stealth Rock weakness and inability to hold Heavy-Duty Boots, which makes it very over-reliant on hazard control, or else it'd be worn down rapidly. Mega Beedrill's paltry defensive stats and terrible typing give it practically no defensive utility, rendering it extremely vulnerable to Choice Scarf users such as Galarian Zapdos and priority moves like Scizor's Bullet Punch and Bisharp's Sucker Punch. Pursuit is another seemingly useful option, with its ability to outpace the likes of Choice Specs Latios and Mega Latias working well in tandem with Mega Beedrill's ability to hit them super effectively. However, Mega Beedrill is outclassed as a Pursuit trapper by Mega Aerodactyl and Mega Tyranitar, both of which have a much better offensive and defensive presence thanks to their better typings. For teammates, entry hazard removers like Excadrill and Tapu Fini are mandatory. Special attackers that can remove or chip physical walls, such as Iron Moth and Thundurus-T, are necessary to let Mega Beedrill have any hope of threatening the opposing team. Magnezone is notable for its ability to trap and remove Skarmory and Celesteela. Entry hazards from setters like Ting-Lu and Skarmory can chip Mega Beedrill's targets and help it actually KO its targets. Overall, Mega Beedrill is an offensive threat that loses to most foes and requires excessive amounts of support to function properly; thus, it is far too difficult to apply to standard teams to be considered viable.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "nimzowitsch", "user_id": 272785}, {"username": "Runo", "user_id": 568189}]}, {"name": "Grammar checked by", "members": [{"username": "red fintans", "user_id": 637479}]}]}
  },
  "Clefable": {
    "sets": {
      "Utility": {
        "description": "<p>Clefable’s excellent utility, movepool, and defensive typing allow it to function as a powerful defensive piece. Its excellent pure Fairy typing creates favorable matchups versus Pokemon such as Latios, Buzzwole, and Iron Hands. Clefable acts as a Toxic immunity thanks to Magic Guard and also possesses a permanent immunity to Stealth Rock, Spikes, and sandstorm. On offensive teams, Clefable usually fills the role of hazard setter through Stealth Rock. It can use Knock Off to limit the longevity of potential switch-ins such as Celesteela, Amoonguss, and Leftovers variants of Excadrill. Thunder Wave is another useful option, adding the potential to cripple offensive threats such as Cinderace, Iron Moth, Enamorus, and Z-Celebrate Victini. Defensive teams may choose to employ a more passive variant of Clefable using Wish and Protect to provide longevity to Pokemon without access to reliable recovery such as Mega Tyranitar, Excadrill, and Celesteela. Aromatherapy is similarly useful to allow teammates to outlast the opposing team. Additionally, it allows for more aggressive play against Pokemon reliant on status such as Skeledirge, allowing for them to be safely Pursuit trapped by Mega Tyranitar. Clefable’s ability to spread chip damage through utility moves such as Stealth Rock and Knock Off lends it to supporting wallbreakers like Latios, Galarian Zapdos, and Excadrill. Clefable also pairs well with entry hazard users such as Mega Tyranitar, Hippowdon, Skarmory, and Sandy Shocks to wear down the opposition, as it can get rid of items from entry hazard removers such as Excadrill, Tapu Fini, and Cinderace. Clefable struggles with heavy hitters able to trade powerful attacks for the chip damage inflicted by Clefable, such as Iron Moth, Excadrill, and Enamorus. This weakness is mitigated by teammates able to act as revenge killers like Cinderace, Choice Scarf Tapu Fini, and Mega Aerodactyl. Defensive partners such as Slowbro, Celesteela, Mega Tyranitar, and Blissey can beat Steel, Poison, and Fire-types which often beat Clefable. In return, Clefable can beat Dark- and Fighting-types such as Buzzwole, Iron Hands, Hydreigon, and Mandibuzz. Clefable is also a good switch-in to many Knock Off users that might cripple many of its partners, most notably Assault Vest Tangrowth and Chansey.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Clefable is a strong wincon, becoming extremely difficult to threaten once boosted. Magic Guard allows it to set up in the face of defensive Pokemon that would otherwise rely on status moves to threaten it, such as specially oriented Buzzwole, Gastrodon, and Hippowdon. Leftovers is the preferred item to decrease the likelihood of running out of Soft-Boiled PP, but Life Orb can also be used in combination with Magic Guard for a significant increase in damage, helping defeat Pokemon such as specially defensive Celesteela, Taunt Tapu Fini, and Excadrill. Flamethrower is preferred to hit Steel-types such as Excadrill, Aegislash, Celesteela, and Scizor. Thunder can also be used for passable neutral coverage in addition to the chance to paralyze foes such as Iron Moth, Hisuian Arcanine, and Mega Venusaur. Knock Off offers more permanent damage on Steel-types, removing their items such as Leftovers and Heavy-Duty Boots at the cost of being unable to directly break through them. Aromatherapy is often seen on stall teams in addition to Unaware, allowing Clefable to function as both the team’s cleric and wincon. Clefable naturally checking Fighting-types makes it a good teammate for Pokemon such as Excadrill and Bisharp. Mega Tyranitar appreciates this while providing Clefable with crucial Pursuit support, trapping Galarian Slowking and Skeledirge. Offensive pivots such as Cinderace and Choice Scarf Hydreigon appreciate Clefable taking advantage of the defensive walls they might be unable to break through. Calm Mind Clefable is vulnerable to foes able to immediately threaten it such as Excadrill, Celesteela, and Iron Moth. Steel- and Poison-resistant teammates such as Celesteela, Slowbro, and Mega Aerodactyl can cover for Clefable, giving it more opportunities to set up. Unaware Clefable being pressured by entry hazards means it necessitates strong hazard control options, such as Defog Skarmory, Mega Sableye, and Salamence. A relative lack of bulk and initial power means friendly entry hazards are appreciated from teammates including Skarmory, Chansey, Hippowdon, and Jirachi that can help wear down incoming defensive Pokemon more quickly.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "3MoreMinutes", "user_id": 545166}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Alakazam": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Alakazam is a good setup sweeper that utilizes its high Speed, outspeeding foes like Cinderace, Enamorus, and Thundurus, high Special Attack, and unique ablilty in Magic Guard to negate Life Orb's downsides. Psychic is the perferred STAB move of choice, being able to OHKO Buzzwole and Amoonguss, while Psyshock is an alternative that helps deal with walls like Blissey and Gastrodon. Focus Blast helps deal with Dark-types like Mega Tyranitar, Bisharp, and Hydreigon while also being able to threaten foes like Excadrill and Magnezone. Recover gives Alakazam more opportunities to set up on targets like defensive Tapu Fini and Slowking, Shadow Ball deals with Mega Latias, Ceruledge, and Mega Sableye, and Encore can force out other setup sweepers like Thundurus, Azumarill, and Iron Moth. The given EV spread allows Alakazam to survive an Earthquake from Hippowdon. Entry hazard setters such as Ting-Lu, Mega Tyranitar, and Skarmory can be great teammates for Alakazam, as they help it OHKO Mega Venusaur and Enamorus with hazard support. In return, Alakazam can keep hazards up against removal options like Tapu Fini and Will-O-Wisp Rotom-W. Alakazam's poor Defense means it appreciates having good physically defensive teammates like Skarmory, Tapu Fini, and Rocky Helmet Tangrowth. Choice Scarf users and fast Pokemon like Mega Aerodactyl, Galarian Zapdos, and Hydreigon can be problematic for Alakazam, as they can prevent it from setting up, so Pokemon that help against these foes like Celesteela, Skarmory, and Clefable make good teammates. Pivots such as Scizor, Cinderace, and Sandy Shocks can help Alakazam find setup opportunities against targets like Skarmory; in return, Alakazam can pressure Pokemon such as Mega Venusaur for Sandy Shocks and Tapu Fini for Cinderace.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Slowbro": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Slowbro's high physical bulk combined with Regenerator makes it a fantastic defensive pivot, able to check numerous physical attackers such as Cinderace, Excadrill, and Galarian Zapdos. As they're forced out, Slowbro can use Teleport to maintain momentum and stay healthy. Scald serves as a spammable STAB attack that can cripple targets with burns, dissuading otherwise decent checks like Mega Tyranitar from setting up. Even foes that don't rely on physical attacks, like Latios, tend to dislike the chip from burn. Future Sight supports wallbreakers like Choice Band Tyranitar, Buzzwole, and Enamorus in breaking through their checks such as Tangrowth and Skarmory for the former two and Mega Venusaur for the latter. It also synergizes excellently with Teleport. Slack Off serves as reliable recovery that doesn't require Slowbro to switch out. Heavy-Duty Boots allows Slowbro to avoid taking damage from entry hazards, maximizing HP regained from Regenerator, though Rocky Helmet can be held instead to punish contact move users, notably foes that run U-turn like Cinderace. A Relaxed nature and 0 Speed IVs are used to make Slowbro as slow as possible, maximizing its odds of moving slower than opposing Teleport users. Slowbro best fits on bulky offense and balance teams looking for a reliable defensive pivot that can also generate momentum for wallbreakers. Hazard-stacking teammates like Skarmory, defensive Clefable, Ting-Lu, and Hippowdon pair up nicely with Future Sight, further putting pressure on opposing defensive cores. Many hazard-stacking teammates can also double as checks to Pokemon Slowbro struggles against, such as Clefable and Ting-Lu checking Dark-types like Hydreigon, Skarmory handling Bug- and Grass-types like Buzzwole and Tapu Bulu, and Hippowdon and Ting-Lu checking Electric-types like Iron Hands. Similarly, pivots like Scizor also check threats like Clefable while pairing nicely with Slowbro's own pivoting potential to maintain offensive momentum. If it isn't running Heavy-Duty Boots, hazard control from teammates like Hydreigon, Excadrill, and Mega Altaria is necessary.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Aerodactyl": {
    "sets": {
      "Offensive": {
        "description": "<p>Mega Aerodactyl's unrivalled Speed tier, attacking prowess, and decent defensive profile make it a great all-around offensive threat in the metagame, outpacing and forcing out a huge portion of faster threats, such as Cinderace, Ceruledge, Galarian Moltres, and Enamorus lacking Choice Scarf. Earthquake provides Mega Aerodactyl with perfect neutral coverage, hitting Rock-resistant Pokemon as well as targets that are weak to it, such as Tyranitar, Zeraora, and Bisharp, allowing Mega Aerodactyl to threaten them. Dual Wingbeat provides a secondary STAB option that ensures Mega Aerodactyl hits important targets such as Buzzwole, Mega Venusaur, and Amoonguss super effectively. Taunt can be used instead to deny the likes of bulkier targets, such as Clefable, Skarmory, and Hippowdon, from accessing their healing moves, on top of shutting down setup options from specific setup sweepers, such as Mega Latias. Mega Aerodactyl can even serve as an effective Pursuit trapper; with the Tough Claws boost, it makes for an effective option to use against the likes of Iron Moth, Latios, and Alakazam. Roost is mandatory in the last slot to offset Mega Aerodactyl's Stealth Rock weakness while also allowing it to repeatedly switch into foes such as Cinderace and Iron Moth, resisting most of their attacks in the process. Mega Aerodactyl fits best on bulky offense and balance teams in need of an offensive backbone with solid secondary defensive applications. Bulkier Pokemon such as Ting-Lu, Clefable, and Rotom-W appreciate Mega Aerodactyl's ability to relieve pressure in dealing with offensive threats which they may be overwhelmed by, such as Cinderace and Enamorus. In return, the former two provide hazard support to help Mega Aerodactyl secure damage rolls against Pokemon it would otherwise miss out on, such as against Autotomize Celesteela with Stone Edge and Mega Tyranitar with Earthquake, whereas the latter provides additional pivoting support, hazard removal in Defog to offset Mega Aerodactyl’s weakness to Stealth Rock, and the ability to take on several setup sweepers which it struggles to take on, such as Sand Rush Excadrill and Swords Dance Scizor. Similarly, other Pokemon that can remove entry hazards, such as Excadrill and Mandibuzz, are effective at ensuring Mega Aerodactyl isn’t being dug into by Stealth Rock. On the other hand, offensive Pokemon such as Choice Band Galarian Zapdos, Nasty Plot Hydreigon, and Tapu Bulu can benefit from Mega Aerodactyl's ability to check or remove faster Pokemon which they may be dissuaded by, such as Iron Moth, Cinderace, and Keldeo. Mega Aerodactyl's ability to force in defensive Pokemon can also lead to some interesting synergies with other offensive Pokemon, particularly when carrying Taunt; setup sweepers such as Calm Mind Enamorus, Bulk Up Buzzwole, and Swords Dance Iron Hands each benefit from Mega Aerodactyl's ability to lure in and weaken walls such as Skarmory, Tapu Fini, Slowbro, and Mega Venusaur.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Dragon Dance turns Mega Aerodactyl into a threatening sweeper, leveraging its combination of power, Speed, and coverage to great effect. It particularly preys on faster teams that over-rely on using faster speed control options to check most sweepers, such as Choice Scarf users Galarian Zapdos and Keldeo. Earthquake nails several Ground-weak targets in Excadrill, Tyranitar, and Bisharp after a Dragon Dance, OHKOing the latter. Dual Wingbeat, especially with the boost from Tough Claws, flattens many neutral targets after a Dragon Dance, such as Clefable, Slowking, Gastrodon, and Mega Latias, while also allowing it to beat walls such as Buzzwole and Tangrowth. Alternatively, Mega Aerodactyl can run Roost in the last slot to offset its lack of longevity, potentially grabbing multiple setup opportunities against weaker Pokemon such as Ting-Lu and Clefable lacking Thunder Wave. Due to its offensive prowess, this Mega Aerodactyl set fits best on fast-paced teams as an effective mid-to-late game cleaner. Early-game wallbreakers such as Ceruledge and Iron Hands can help Mega Aerodactyl by opening up gaps in the opposition through their numerous offensive applications against walls which the latter may find itself being stopped by, such as Slowbro, Scizor, and Iron Defense Skarmory. Conversely, Mega Aerodactyl’s tendency to find opportunities against specific targets such as Ting-Lu and Mega Venusaur can also work to the benefit of other late-game cleaners, such as Booster Energy Iron Moth and Weakness Policy Latios. As Mega Aerodactyl often finds itself leveraging its bulk to make the most of its setup capabilities, teammates that can prevent entry hazards from going up, such as Taunt Mew, Excadrill, and Tapu Fini, make for excellent partners. Mega Aerodactyl also benefits from entry hazard support provided by the former two, as well as others like Spikes Sandy Shocks, which help it secure OHKOs against Pokemon such as Hydreigon after a Dragon Dance.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Zapdos-Galar": {
    "sets": {
      "Choice Band": {
        "description": "<p>With Choice Band, Galarian Zapdos becomes a fearsome choice for bulky offense or offense teams looking for a threat that is able to destroy even the most bulky physical walls like Skarmory and Hippowdon. Close Combat threatens a huge amount of the tier, such as staples like Mega Tyranitar and Excadrill, and Brave Bird allows Galarian Zapdos to hit defensive staples such as Buzzwole and Clefable that resist Close Combat. U-turn allows Galarian Zapdos to maintain momentum and slam Pokemon like Slowbro that can stomach both Brave Bird and Close Combat. Knock Off hits Ghost-types like Hisuian Zoroark and is also a move that can be spammed in the early game to force progress by removing Leftovers or Rocky Helmet. Defiant is a great offensive ability that allows Galarian Zapdos to punish Defog attempts from Tapu Fini and Skarmory, as well as prevent Salamence from effectively neutering it with Intimidate. Despite Galarian Zapdos's decent typing, which allows it to switch into Earthquake from Excadrill and Knock Off from Mega Tyranitar, it can struggle to switch in against the Psychic- and Fairy-type moves thrown out by Slowbro and Enamorus. Therefore, Steel-type teammates such as Excadrill, Bisharp, and Celesteela are appreciated to help take hits from these foes, and Galarian Zapdos can switch into and pressure threats such as opposing Excadrill and Buzzwole for them. Additionally, Galarian Zapdos can wallbreak for the former two, which can allow for them to sweep after shared checks like Skarmory are removed. Galarian Zapdos also appreciates pivot support to hit the field as often as possible, so Pokemon like Slowbro and Cinderace are good teammates. Galarian Zapdos especially enjoys pivoting in and threatening Mega Tyranitar and Bisharp that switch into Slowbro and Slowking.</p>"
      },
      "Bulk Up": {
        "description": "<p>Bulk Up Galarian Zapdos trades the immediate power of Choice Band for the freedom to switch moves, and can therefore threaten most of the tier after a Bulk Up. Bulk Up allows Galarian Zapdos to break through physical walls such as Skarmory and Hippowdon after a boost. Brave Bird slams the Fighting resists looking to switch into Galarian Zapdos, such as Buzzwole and Slowbro, and with Flyinium Z, it becomes an incredibly powerful Supersonic Skystrike that obliterates neutral targets like Clefable and Tapu Fini and prevents the recoil damage of Brave Bird. Thunderous Kick is a great STAB move that lowers the Defense of the target, which can allow Galarian Zapdos to beat defensive Pokemon with Unaware like Quagsire and otherwise force many switches. Alongside Leftovers, it notably allows Galarian Zapdos to beat Iron Defense Skarmory. Close Combat provides more immediate power at the cost of a worse matchup into Quagsire and Iron Defense Skarmory. Substitute allows Galarian Zapdos to set up on bulky foes looking to neuter it with status, such as Hippowdon and Mega Sableye. It can also scout switches against teams reliant on dealing with Galarian Zapdos through Pokemon that resist Flying and Fighting, as well as allow it to beat faster revenge killers like Choice Scarf Hydreigon and Enamorus. Alternatively, Knock Off is an option to slam Slowking and Slowbro if needed, as well as allow Galarian Zapdos to force progress against bulkier targets like Iron Hands and Clefable. Trailblaze is another option on hyper offense teams that can allow Galarian Zapdos to leverage its Bulk Up boosts to sweep by boosting its Speed. Trailblaze also hits Quagsire harder than Brave Bird, which can allow partners on hyper offense builds like Ceruledge to sweep later in the game. Leftovers is an option on Galarian Zapdos if another teammate is using the Z-crystal, and it grants Galarian Zapdos more longevity. It pairs especially well with Substitute, as Leftovers recovery can allow for Galarian Zapdos to set up Substitute multiple times over the course of the game. Bulk Up Galarian Zapdos is mainly used on hyper offense teams and is especially great alongside Ribombee, as it can punish Defog users attempting to remove Ribombee's Sticky Web. It can also be used on balance or fat teams looking for a wincon that can attempt to set up and wallbreak multiple times in a game. Teammates like Dragon Dance Mega Tyranitar and Dragon Dance Mega Altaria appreciate Galarian Zapdos switching into and breaking foes like Skarmory and Celesteela, respectively, so they can sweep in the late-game. Defensive Pokemon like Clefable and Gastrodon appreciate Galarian Zapdos's ability to beat slower wallbreakers such as Swords Dance Bisharp and Sinistcha, and can switch into attacks from faster threats like Enamorus and Cinderace aimed at Galarian Zapdos.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Galarian Zapdos is a very fast and powerful revenge killer that can threaten many offensive staples such as Cinderace, Enamorus, and Heavy-Duty Boots Iron Moth. Brave Bird threatens common foes that resist Fighting like Clefable and Slowbro. Close Combat is Galarian Zapdos's most powerful Fighting-type STAB attack and allows it to threaten much of the tier, such as Mega Tyranitar and Hydreigon. U-turn allows Galarian Zapdos to pivot out of matchups against defensive foes it cannot break with Choice Scarf, such as Skarmory. Knock Off allows Galarian Zapdos to remove the pesky Rocky Helmet or Heavy-Duty Boots to allow teammates like Cinderace to wallbreak later in the game. The speed control provided by Choice Scarf Galarian Zapdos allows it to fit on a wider range of teams, from offense to balance. Its ability to threaten common offensive threats like Cinderace is appreciated by frail offensive Pokemon like Alakazam and Hisuian Zoroark, and its ability to revenge kill powerful wallbreakers like Iron Moth and Hydreigon is appreciated by passive defensive Pokemon like Gastrodon and Celesteela. Choice Scarf Galarian Zapdos appreciates entry hazard support, as it is able to force more switches with its Speed, and so partners like Clefable are appreciated to set hazards and pressure defensive foes that are able to stomach hits like Slowbro. Choice Scarf Galarian Zapdos cannot wallbreak as effectively, so strong special attackers like Enamorus and Hydreigon appreciate Galarian Zapdos luring in physical walls like Buzzwole for them to set up or launch powerful attacks on, while Galarian Zapdos can threaten special walls like Blissey and Hisuian Goodra for them in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Danbear02", "user_id": 589016}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}, {"username": "Runo", "user_id": 568189}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Moltres-Galar": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Leveraging its excellent defensive profile and bulk, on top of its access to a multitude of boosting moves, Galarian Moltres makes for an excellent mid-to late-game cleaner on more offensive teams. It provides an important buffer against offensive threats such as Hisuian Zoroark and Alakazam while also finding setup opportunities against a large portion of defensive staples, such as Slowbro and Mega Venusaur. Nasty Plot boosts Galarian Moltres's Special Attack to absurd levels, allowing it to reliably pressure specially defensive tanks such Hippowdon and Clefable. Agility allows Galarian Moltres to outspeed common revenge killers such as Mega Aerodactyl and Choice Scarf Keldeo after one round of setup while giving it the opportunity to clean up opposing teams late-game when its wallbreaking prowess with Nasty Plot isn't as necessary. Taunt, on the other hand, can be used to prevent status and healing from Pokemon such as Blissey and specially defensive Hippowdon, allowing Galarian Moltres to wear them down or use them as setup fodder. Hurricane, in conjunction with Flyinium Z, gives Galarian Moltres a powerful one-time nuke in Supersonic Skystrike that can break through neutral targets such as Blissey and Gastrodon, threatening to outright OHKO the latter at +2 while also offsetting Hurricane’s middling accuracy in the process. As Galarian Moltres can struggle to safely find setup opportunities against faster threats such as Cinderace and Enamorus, it pairs best with offensive teammates that can also complement its wallbreaking prowess; late-game cleaners such as Dragon Dance Salamence, Meteor Beam Nihilego, and Booster Energy Iron Moth capitalize on Galarian Moltres's ability to weaken specific answers, such as specially defensive Celesteela and Skeledirge, respectively, allowing them to sweep opposing teams with greater ease late-game. The latter two can also invite in and weaken Rock-types such as both Tyranitar formes and the rare Nihilego, which Galarian Moltres can struggle to break through otherwise. Galarian Moltres's Stealth Rock weakness and inability to run Heavy-Duty Boots necessitates strong anti-hazard options, leads such as Excadrill and Mew can all shut down common entry hazard setters, the former via Rapid Spin and the latter via Taunt.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}]}, {"name": "Grammar checked by", "members": [{"username": "Aera", "user_id": 572981}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Mew": {"sets": {"Utility": {}, "Lead": {}}},
  "Quagsire": {"sets": {"Unaware Wall": {}}},
  "Slowking": {"sets": {"Specially Defensive Pivot": {}}},
  "Scizor": {
    "sets": {
      "Offensive Swords Dance": {
        "description": "<p>Accounting for its diverse movepool, priority options, and huge base Attack, Scizor makes for an incredibly threatening wallbreaker and cleaner on more offensive teams. Furthermore, Scizor's Steel typing and decent bulk also complements its ability to keep many faster threats in check, such as Enamorus, Mega Latias, and Alakazam, while using them as setup fodder. Knock Off allows Scizor to break past Slowbro and Skeledirge while also OHKOing Victini and Ceruledge; it can even prove useful for removing items from several soft checks otherwise reliant on them, such as Heavy-Duty Boots from Cinderace and Leftovers from Iron Hands. Dual Wingbeat is usually preferred in the last slot for its coverage against specific physical walls able to blank its other attacks, such as Buzzwole, Mega Venusaur, and Tangrowth, but Close Combat can be used instead to deal more damage to Steel-types such as Skarmory, Magnezone, and Bisharp, putting immense pressure on the former at +2 while OHKOing the latter two unboosted. Quick Attack can also be used to give Scizor an extra priority attack, allowing it to finish off weakened foes that would otherwise resist Bullet Punch, such as Cinderace, Iron Moth, and Zeraora, although its lack of coverage can leave Scizor to struggle with breaking through the aforementioned defensive targets. Due to its lack of longevity and early- or mid-game prowess, this Scizor set usually fits best on select offensive teams that appreciate its versatility in being able to deal with faster threats. Entry hazard support from the likes of Excadrill and Lead Mew can help push several Pokemon, such as Iron Moth, Tyranitar, and Tapu Fini, into Scizor's KO threshold. Scizor also appreciates specific teammates that can help weaken or take advantage of Fire- and Steel-types, such as Iron Hands, Meteor Beam Nihilego, and Swords Dance Ceruledge, as it can often be dissuaded from sweeping by their presences in a vacuum while they remain healthy. Conversely, other late-game cleaners such as Swords Dance Bisharp, Z-Celebrate Victini, and Dragon Dance Mega Aerodactyl appreciate Scizor's own ability to force damage onto shared checks such as Hippowdon, Skarmory, and Choice Scarf Keldeo while allowing Scizor to forgo its late-game approach if attacking early may be more optimal for enabling the rest of its teammates.</p>"
      },
      "Bulky Swords Dance": {
        "description": "<p>Scizor's excellent defensive typing, longevity with Roost, and priority in Bullet Punch can let it serve as an excellent bulky attacker, allowing it to reliably check Pokemon such as Alakazam and Mega Latias throughout a game while retaining its ability to sweep with Swords Dance once opposing walls are appropriately weakened. U-turn allows Scizor to provide pivoting support for its teammates on a forced switch, and in conjunction with Buginium Z, it even gives Scizor access to a one-time nuke that prevents it from switching out, allowing it to KO the likes of Amoonguss and Mandibuzz at +2 after slight chip damage. Alternatively, Knock Off can be used to remove important items from the likes of Cinderace, Celesteela, Salamence, and Iron Hands, allowing it to finish these Pokemon off more easily. Buginium Z is usually the preferred item for its aforementioned power boost to U-turn, on top of reducing damage taken from Bisharp's Knock Off, but Heavy-Duty Boots is an alternative that offsets Scizor's vulnerability to entry hazards. The given EV spread hits an extra Attack point, allows Scizor to reduce the amount of damage taken from attacks such as Excadrill's Earthquake and Mandibuzz's Foul Play and outspeeds Skeledirge and Skarmory. Scizor's pivoting capabilities in tandem with its ability to check faster threats are appreciated by defensive Pokemon otherwise vulnerable to the overwhelming offensive pressure exerted by them. Walls such as Ting-Lu, Rotom-W, and Slowbro are particularly helpful in this regard; Ting-Lu can check Fire-types such as Ceruledge and Iron Moth while setting up entry hazards to help Scizor cripple the opposing team more effectively, whereas Rotom-W and Slowbro can help maneuver around Fighting-types in Galarian Zapdos and Buzzwole while providing Scizor with additional pivoting support. Wallbreakers such as Choice Specs Enamorus, Choice Specs Latios, and Nasty Plot Hydreigon, each appreciate Scizor's ability to provide safe entry with its U-turn or threaten the removal of items such as Heavy-Duty Boots from Slowking and Assault Vest from Tangrowth if running Knock Off, helping in return by opening up the conditions required for Scizor to successfully sweep teams late-game. While Scizor can help teams out in checking faster threats, its lack of initial power on Bullet Punch outside of super effective hits, particularly against bulkier targets such as Galarian Moltres and Autotomize Celesteela, can leave a lot to be desired. As such, partners that can deal with these specific Pokemon, such as Mega Tyranitar, Thunder Wave Clefable, and defensive Tapu Fini, manage to help out in this regard.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band provides Scizor with immediate power on its attacks, allowing it to be more proficient as a wallbreaker, pivot, and late-game cleaner all at once. Bullet Punch puts substantial pressure on win conditions such as Calm Mind Clefable, Dragon Dance Mega Tyranitar, and Tapu Bulu, outright OHKOing the latter from full HP. Knock Off allows Scizor to remove important items from Pokemon otherwise reliant on them to deter it, such as Heavy-Duty Boots from Salamence and Rocky Helmet from Buzzwole and Amoonguss. Pursuit takes advantage of Scizor's excellent typing against several Psychic-type Pokemon to trap them, most notably Mega Latias, Choice-locked Latios, and Slowking. Alternatively, Close Combat and Dual Wingbeat are options to pose a more immediate threat to their respective targets, such as Excadrill and Magnezone with Close Combat and Buzzwole and Mega Venusaur with Dual Wingbeat. Scizor fits best on bulky offense teams that can best take advantage of its strong momentum-grabbing capabilities and cleanup potential. Pivots such as Rotom-W, Cinderace, and Sandy Shocks can help Scizor by threatening the physical walls used to stifle it, including Skarmory and Buzzwole; in return, Scizor can help force damage onto walls that normally handle these pivots, such as Tangrowth and Blissey. Scizor also appreciates strong entry hazard removal options to avoid being worn down quickly, including Defog from Rotom-W, Tapu Fini, and Volcanion and Rapid Spin from Excadrill; the aforementioned Defog users are also capable of taking advantage of Fire-types that may pose a threat to Scizor, such as Cinderace and Ceruledge. On the other hand, entry hazard support from the likes of Clefable, Ting-Lu, and Sandy Shocks is imperative to increase the overall impact of Scizor's pivoting capabilities as well as extend its capacity to revenge kill threats like Galarian Moltres and Dragon Dance Salamence with Bullet Punch.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Heracross": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Mega Heracross uses its gigantic Attack stat alongside Swords Dance to be a powerful wallbreaker, pressuring common physical walls like Skarmory and Mega Venusaur. Swords Dance boosts Mega Heracross's Attack to incredible heights and lets it OHKO a majority of the Pokemon in the tier, including walls like Skarmory and Hippowdon. Close Combat OHKOes threats like Cinderace and Mega Tyranitar while 2HKOing bulkier Pokemon like Iron Hands and Skarmory. Rock Blast threatens Flying-types such as Enamorus, Salamence, and both Thundurus formes, as well as Fire-types like Iron Moth and Ceruledge that could otherwise take Close Combat and force Mega Heracross out. Pin Missile threatens Slowbro and Mega Venusaur, while Substitute lets Mega Heracross avoid Will-O-Wisp from Mega Sableye, capitalize from the forced switches it generates, and ease prediction against Pokemon it forces out. Physical cleaners like  Swords Dance Scizor appreciate Mega Heracross being able to threaten their switch-ins, such as Skarmory and Mega Venusaur, allowing them to sweep late-game. Mega Heracross is prone to being revenge killed by faster threats like Cinderace, Iron Moth, and Enamorus, so teammates that can deal with them such as Tapu Fini, Mega Tyranitar, and Celesteela, respectively, are appreciated. Fire-type partners like Cinderace and Iron Moth can threaten Buzzwole, which walls Mega Heracross; Poison-types like Amoonguss can threaten Fairy-types like Tapu Fini and Unaware Clefable, which also wall it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Skarmory": {
    "sets": {
      "Defensive": {
        "description": "<p>Skarmory is a great physical wall in the metagame thanks to its impressive defensive typing and great physical bulk allowing it to handle threats such as Excadrill and Scizor among other foes. Skarmory also serves as a valuable Spikes user thanks to it being able to set up against threats such as Buzzwole, Blissey, and non-Flamethrower Clefable. The combination of Iron Defense and Body Press is Skarmory’s preferred choice to make progress against teams, as it allows it to stonewall threats such as Scizor, Bisharp, and Tyranitar while also further pressuring threats such as Blissey and Hippowdon. Dropping Iron Defense and Body Press for Whirlwind or Toxic and Brave Bird respectively is also an option on more offensive teams to pressure threats such as Buzzwole and Mega Venusaur more effectively while also offering extra team support by phasing or spreading poison damage. However, this comes at the cost of being far more passive against Excadrill and lacks a proper response to Bisharp and Dragon Dance Mega Tyranitar. On stall teams, Skarmory has the choice of running Defog in place of either Spikes or Iron Defense and can also run an EV spread of 248 HP / 76 Def / 184 Spe with an Impish nature to outspeed Choice Band Tyranitar, allowing it to boost or safely heal up before Tyranitar can 2HKO it. Skarmory’s main item of choice is Rocky Helmet to get residual damage off against foes with U-turn such as Scizor and Galarian Zapdos while also chipping setup sweepers such as Mega Tyranitar, but it can also run Shed Shell on bulkier playstyles such as balance and stall in order to avoid being trapped by Magnezone. Skarmory can struggle a lot against special attackers such as Latios and Enamorus, so specially defensive walls such as Blissey, Chansey, and specially defensive Skeledirge are good partners to shore up that weakness. Mega Tyranitar is another good partner, since it can switch into and Pursuit trap threats that pressure Skarmory such as Iron Moth and Hisuian Zoroark. Common pivots that take advantage of Skarmory such as Cinderace, Thundurus, and Thundurus-T also hate being Pursuit trapped by Mega Tyranitar. Skarmory also has issues against Fire-types such as Cinderace and Victini, so bulky Water-types such as Slowbro, Slowking, Gastrodon, and Alomomola can help deal with them. Electric-types such as Thundurus, Thundurus-T, Sandy Shocks, and Zeraora can also threaten Skarmory, so bulky Ground-types such as Hippowdon and Gastrodon are good partners to hinder them, but bulky Grass-types such as Tangrowth, Amoonguss, and Mega Venusaur also work as teammates at the cost of being unable to block Volt Switch. The aforementioned Ground-types can also form strong entry hazard stacking cores with Skarmory that bulkier playstyles such as stall enjoy greatly. Offensively, wallbreakers such as Cinderace, Iron Hands, Latios, and Galarian Zapdos make for good partners, since they appreciate Skarmory's Spikes helping them chip their checks so they can wallbreak easier.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Runo", "user_id": 568189}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Tyranitar": {
    "sets": {
      "Stealth Rock": {
        "description": "<p>Mega Tyranitar’s excellent defensive stats, typing, and Pursuit enable it to carve a niche as a reliable entry hazard setter and Pursuit trapper. Stone Edge is a strong STAB option that OHKOes Iron Moth while denting neutral targets such as Celesteela and Tapu Fini. Pursuit enables Mega Tyranitar to trap Psychic- and Ghost-types like Latios and Blacephalon. Knock Off offers a strong STAB move to OHKO bulky Ghost- and Psychic-types like Hisuian Zoroark and Latios. It is also the strongest move Mega Tyranitar has to hit Slowbro. Superpower is an option to snipe opposing Tyranitar and severely damage would-be switch-ins such as Excadrill. 176 Speed EVs enable Mega Tyranitar to outspeed Celesteela. Offensive Fighting-types such as Buzzwole, Iron Hands, and Keldeo appreciate Mega Tyranitar removing bulky Ghost- and Psychic-types. In exchange, Buzzwole covers Mega Tyranitar’s weaknesses to Fighting- and Ground-type attacks, while Keldeo can bring Mega Tyranitar in safely with Flip Turn. Other teammates such as Iron Moth and Tapu Bulu offer some defensive synergy and appreciate Mega Tyranitar’s ability to remove Psychic- and Fire-types, respectively. Mega Tyranitar’s typing gives its weaknesses to prominent attacking types such as Fighting, Water, and Ground, so Pokemon such as Tangrowth and Amoonguss can provide switch-ins to these types. The Future Sight support provided by the latter meshes well with Pursuit and dissuades Buzzwole and Iron Hands from switching in. Celesteela and Skarmory can help check Excadrill and Buzzwole, with Skarmory providing Spikes as a bonus. Clefable and Tapu Fini can check Fighting-types for Mega Tyranitar to some degree. Due to its lack of reliable recovery, Mega Tyranitar is vulnerable to being chipped down, so partners such as Choice Scarf Latias and Choice Band Scizor can ease the burden against frail sweepers such as Polteageist and Nihilego. Finally, Sand Rush Excadrill benefits from Mega Tyranitar’s Sand Stream and its ability to wear down Skarmory and Hippowdon.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Dragon Dance Mega Tyranitar utilizes its solid bulk and versatile offensive coverage to act as a threatening late-game cleaner. Ice Punch synergizes well with Stone Edge, as it chunks physically defensive Ground-types like Hippowdon and physically defensive Tangrowth. Earthquake is a valuable coverage option to hit Excadrill. Knock Off is an alternative STAB option that hits Gastrodon and Slowbro hard. Maximum Speed investment with a Jolly nature is preferred to outspeed Cinderace with a single Dragon Dance. Dragon Dance Mega Tyranitar is usually found on bulky offense or hyper offense since these structures provide adequate tools to facilitate setup. The main hindrances for Mega Tyranitar are physically defensive walls like Hippowdon, Skarmory, and Clefable. Teammates like Mewoscarada, Tapu Fini, Swords Dance Scizor, and Meteor Beam Celesteela can take advantage of these Pokemon. Mega Tyranitar can also be revenge killed by common Fighting-types like Buzzwole, Keldeo, and Iron Hands even after a boost. Teammates such as Polteageist and Latios offer valuable typings and can soft-check Fighting-types. In return, they appreciate Mega Tyranitar’s ability to take advantage of specially defensive walls such as Blissey. Offensive Steel-types such as Sand Rush Excadrill and Scizor can cut a Mega Tyranitar sweep short, and thus Fire-types like Cinderace and Iron Moth are excellent partners. Magnezone deserves a special mention, as it traps Scizor and Skarmory. Sand Rush Excadrill appreciates Mega Tyranitar’s Sand Stream ability and in exchange offers insurance against Unaware Clefable. Mega Tyranitar is vulnerable to chip damage and thus appreciates pivoting support from Cinderace, Magnezone and Scizor. Slowbro and  Slowking can bring in Mega Tyranitar safely with Teleport and offer Future Sight support for Buzzwole. Finally, Spikes from Skarmory and Mew can wear down walls.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Tyranitar is a brutally powerful wallbreaker capable of ripping through common defensive staples such as Clefable, Tapu Fini, and Celesteela. Its absurdly powerful Knock Off and Pursuit combined with its excellent special bulk also make it a premier Pursuit trapper capable of dominating common Psychic-types such as Choice Specs Latios and Slowking as well as physically frail foes like Iron Moth and Blissey. Earthquake targets Rock- and Steel-types such as opposing Tyranitar formes and Excadrill. Aerial Ace is an alternative to hit Fighting-types, notably 2HKOing Buzzwole. Assurance is another option, with it becoming a near-unwallable force when paired with entry hazards and synergizing well with Knock Off removing Heavy-Duty Boots. Tyranitar best fits on offense teams looking for a wallbreaker and Pursuit trapper. It is especially effective at removing special walls such as Blissey, making specially attacking teammates such as Choice Specs Latios and Iron Moth great partners. Pivots, notably specially attacking ones such as Slowbro and the aforementioned Iron Moth, can force in special walls and safely bring in Tyranitar. Entry hazard setters such as Excadrill and Skarmory enjoy Tyranitar's ability to break through most hazard removal options, and it greatly appreciates the chip damage they provide in return, especially if it's running Assurance. Tyranitar is dominated by Fighting-types such as Buzzwole and Iron Hands, making checks to them such as Clefable and Latios mandatory teammates. Sand Stream can notably support Sand Rush variants of Excadrill, and as physical wallbreakers, Tyranitar and Excadrill can weaken their shared physically defensive checks like Skarmory, Buzzwole, and Tangrowth. While Tyranitar matches up well against many special attackers, it falters against a good deal of them such as Alakazam and Thundurus-T due to its weaknesses, making specially defensive tanks such as Assault Vest Tangrowth useful partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Velcroc", "user_id": 391284}, {"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Deezcastforms", "user_id": 423085}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Sableye": {
    "sets": {
      "Magic Bounce": {
        "description": "<p>The combination of solid bulk, incredible utility, and Magic Bounce makes Mega Sableye a near-mandatory addition on stall teams. Thanks to Magic Bounce, Mega Sableye is able to effectively stop entry hazards from the likes of Skarmory and Sand Rush Excadrill from going up on its side of the field, and thanks to its Ghost typing it can block Rapid Spin from Excadrill as well. Knock Off is used for its ability to remove items like Leftovers and Heavy-Duty Boots from targets like Celesteela and Cinderace, causing them to be worn down more easily. Will-O-Wisp allows Mega Sableye to cripple physical attackers such as Excadrill and Iron Hands with a burn. It can also be used against Pokemon unbothered by Knock Off like Mega Venusaur to slowly wear them down. The final moveslot is typically given to Protect, allowing Mega Sableye to safely get its Mega Evolution off as well as scout the intentions of Choice item users like Enamorus and Keldeo. Toxic is an alternative to status Pokemon that do not mind Will-O-Wisp like Cinderace and Nasty Plot Hydreigon. Prankster is chosen as the pre-Mega ability on Sableye, allowing it to burn a boosted physical threat in case of emergency. Mega Sableye struggles with strong special attackers, and as such appreciates specially defensive teammates like Blissey, Ting-Lu, and Gastrodon. Its lack of passive recovery in tandem with Recover’s meagre PP means it can get worn down by repeated hits and chip damage from sand. Therefore, Wish passers like Blissey and Clefable will greatly improve its longevity. Mega Sableye can get statused through Magic Bounce by moves like Sludge Bomb and Scald and thus appreciates cleric support from Chansey or Clefable. Pokemon like Clefable and Mold Breaker Excadrill can effectively set up hazards against Mega Sableye. As such, backup hazard control from Pokemon like Skarmory and Mandibuzz can prove helpful.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Aera", "user_id": 572981}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "red fintans", "user_id": 637479}]}]}
  },
  "Altaria": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Thanks to its good Attack, powerful Pixilate-boosted STAB moves, Speed, and good defenses, Mega Altaria serves as a potent late-game setup sweeper primarily seen on offense and hyper offense teams. It can outspeed foes like Cinderace, Mega Latias, and Thundurus after one boost, and it stands out over other sweepers due to its ability to set up on Choice-locked Latias and Hydreigon. Pixilate-boosted Frustration serves as Mega Altaria's best move due to its power without any drawbacks that helps against the plethora of Fighting-, Dark-, and Dragon-types, OHKOing Hydreigon, Mega Heracross, and Galarian Zapdos and 2HKOing Iron Hands, Buzzwole, Mega Latias, and Mega Tyranitar. Earthquake pairs well with Frustration, as it can help deal with the Steel-types that resist the former, 2HKOing Excadrill, Hisuian Goodra, and Jirachi, and it can also be useful to hit Fire-types like Iron Moth and Skeledirge. Roost lets Mega Altaria set up on defensive targets like Slowbro, Buzzwole, and Skarmory long-term, and it can help to stay healthy in the face of hazards. Mega Altaria perfers to have Natural Cure instead of Cloud Nine to avoid status from targets like Mew and Gastrodon. This given EV spread allows Mega Altaria to outspeed Cinderace and Alakazam at +1. Mega Altaria can have a hard time breaking through some Poison- and Steel-types like Mega Venusaur, Amoonguss, Celesteela, and Skarmory, making offensive Fire-types like Victini, Ceruledge, and Cinderace good supporting teammates. Teammates on offense and hyper offense teams like Iron Moth, Thundurus, and Azumarill make for good partners, being able to threaten out Pokemon like Tapu Bulu, Tapu Fini, and Hippowdon. Offensive pivots such as Cinderace, Sandy Shocks, and Thundurus-T make also good partners for Mega Altaria, as they can bring it in to threaten out Dragon-types, such as Latias and Hydreigon, and pivot it into defensive Pokemon like Buzzwole to give Mega Altaria an opportunity to set up. Mega Altaria appreciates entry hazard removal options and entry hazard setters, notably suicide leads on hyper offense teams like Excadrill, as well as Salamence on offense teams, which can help to keep Mega Altaria healthy and make it easier to sweep. Stealth Rock chip also enables Mega Altaria to guarantee an OHKO like Mega Latias. In return, Mega Altaria can help against their checks like Buzzwole, Mega Latias, Cinderace, and Galarian Zapdos. Mega Altaria can have great synergy with Pokemon like Rotom-W, which can check the Steel-types that threaten it like Celesteela and has the ablilty to pivot Mega Altaria in.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Salamence": {
    "sets": {
      "Defensive Defog": {"description": "<p>240 Speed EVs should be used to outrun Hydreigon and Hisuian Arcanine when using Draco Meteor.</p>"},
      "Dragon Dance": {
        "description": "<p>Thanks to its great Attack, good coverage options, and ability to outpace foes such as Mega Aerodactyl, Alakazam, and Choice Scarf Hydreigon at +1, Salamence is a good setup sweeper on offense and hyper offense teams, being able to serve as both a mid-game wallbreaker and a late-game cleaner. Fly alongside Flyinium Z provides Salamence a powerful one-time nuke that can outright OHKO Flying-weak foes like Mega Venusaur and Buzzwole and neutral targets like Mega Sableye, Tapu Fini, and Gastrodon at +1. Outrage is an alternative when not using Flyinium Z that helps deal with opposing Dragon-types like Mega Latias, Latios, and Hydreigon, though it does have the downside of locking in Salamence, which can allow the opponent to respond with a Fairy-type like Tapu Fini, Clefable, or Enamorus. Earthquake helps against Steel-types like Excadrill, Aegislash, and Bisharp that resist both its STAB moves, and it can also help to chip down other Ground-weak foes like Skeledirge and Mega Tyranitar. Substitute lets Salamence make use of switches it forces against foes like Mega Venusaur and Buzzwole and take advantage of some defensive Pokemon like Hippowdon and Amoonguss; it can also provide a safety net for mispositioning with Fly or Outrage and avoids status from targets like Chansey, Mega Sableye, and Mew. Alternatively Fire Blast hits Skarmory and can also hit Grass- and Steel-types like physically defensive Tangrowth, Celesteela, and Scizor. If Salamence isn't using Fly, Life Orb boosts the damage of all of its moves, OHKOing Mega Latias and Rotom-W with Outrage. Salamence prefers running Moxie as opposed to Intimidate, due to its usefulness on offensively-oriented teams. Salamence has a hard time breaking through Fairy-types like Tapu Fini and Clefable, due to their typing and super effective moves, making it pair well with other offensive Pokemon like Thundurus and Swords Dance Cinderace, which can overwhelm these foes. When not running Fly, Salamence can also struggle to break through Grass-types like Tangrowth and Mega Venusaur, making Fire-types like Ceruledge and Victini also good partners. Salamence can also pair well with entry hazards from setters like Ting-Lu, Mega Tyranitar, and Skarmory, as Fly and Outrage are guaranteed to OHKO foes like Buzzwole and Thundurus-T after Stealth Rock chip. Due to Salamence's Stealth Rock weakness, it appreciates Pokemon that can provide anti-hazard measures, notably dedicated leads like Excadrill, as well as Taunt Mew, while Salamence can deal with Pokemon that can threaten them like Celesteela and Hydreigon. Salamence can be very prone to getting revenge killed by faster targets like Mega Aerodactyl, Alakazam, and Choice Scarf Enamorus, meaning it appreciates bulky partners like Slowbro and Mega Venusaur, appreciating the former's pivoting and the latter's tank-like nature, as well as Pokemon that can set up on the aforementioned targets like Scizor, Mega Latias, and Celesteela.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Latias": {
    "sets": {
      "Mega Calm Mind": {
        "description": "<p>Mega Latias's impressive bulk, speed tier, and defensive typing make for a superb setup sweeper. This also allows it to find points of entry against common offensive threats such as Iron Moth and Keldeo. Calm Mind boosts Mega Latias' naturally high Special Attack and Special Defense to astounding levels, ensuring that it can easily withstand moves such as Clefable's unboosted Moonblast and Choice Scarf Hydreigon's Dark Pulse to sweep weakened teams. Psyshock is crucial to ignore defensive boosts from Calm Mind variants of the aforementioned Clefable while also breaking past special walls such as Blissey and Chansey more easily, preventing them from crippling Mega Latias with status moves. Aura Sphere provides Mega Latias with important coverage against most Dark- and Steel-types, hitting Pokemon such as Tyranitar, Bisharp, and Excadrill super effectively. Alternatively, if Tyranitar is handled adequately by Mega Latias's teammates, Mystical Fire can be used to deal more immediate damage to the likes of Scizor and Celesteela instead. Mega Latias fits best on defensive and balance teams, which can provide it with the longevity needed to gain proper setup opportunities. Entry hazard support from the likes of Skarmory and Gastrodon can help wear down opposing walls that would otherwise be difficult to break through late-game, such as Tapu Fini. Similarly, wallbreakers such as Choice Band Iron Hands can make for good options to take advantage of these Pokemon, especially when Mega Latias lacks Mystical Fire to deal with the former. However, although Mega Latias is able to switch into Pokemon like Iron Hands, its lack of initial power can leave it vulnerable to being overwhelmed by their boosted attacks in return. Thus, Speed control options such as Choice Scarf Hydreigon and Tapu Fini, in addition to certain defensive walls like Unaware Skeledirge are extremely valuable in providing backup against such foes. Conversely, paralysis support from the likes of Clefable is also notable, as they can limit faster Pokemon such as Choice Scarf Hydreigon and Cinderace from being able to overwhelm Mega Latias with super effective hits late-game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Latias is an effective form of speed control that sets itself apart from other Pokemon the same role, such as Choice Scarf Galarian Zapdos, with its unique utility options. Draco Meteor serves as its main STAB attack, letting Latias revenge kill most neutral targets such as Thundurus-T and opposing Latias. Psyshock is a more spammable STAB move that also lets it clean weakened teams and threaten Fighting-types as well as Iron Moth. Psychic is very similar, trading a chance to OHKO Iron Moth for a 2HKO on Iron Hands and a slightly higher damage output against most neutral targets. Healing Wish is especially helpful to bulky Pokemon that lack reliable recovery such as Iron Hands and Tapu Fini. It can also grant offensive Pokemon like Mega Tyranitar another opportunity to sweep or wallbreak. Trick is Latias's preferred fourth move, allowing it to cripple otherwise unbreakable foes such as Blissey and Chansey. An alternative is Mystical Fire, which lets Latias threaten the Steel-types that resist its STAB combination, like Aegislash and Excadrill. Its Special Attack-lowering effect makes it especially useful against certain boosting threats such as Autotomize Celesteela. Defog is another alternative, letting Latias clear hazards for its team; however, the fact that Latias loses to most Stealth Rock users such as Mega Tyranitar and Excadrill makes it somewhat unreliable in this role. Latias fits best on bulky offense and balance teams that want a revenge killer and appreciate Latias's utility. Latias struggles the most against special walls like Blissey and Slowking, making physical wallbreakers such as Bisharpand Galarian Zapdos mandatory partners. Fighting-types such as Buzzwole are useful to threaten Mega Tyranitar, which takes minimal damage from Latias's attacks and can trap it with Pursuit; they can also take out Steel-types like Excadrill, something especially important if Latias forgoes Mystical Fire. Latias's ability to force in and cripple special walls with Trick makes a good partner for special attackers like Clefable.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "StupidFlandrs48", "user_id": 633500}, {"username": "red fintans", "user_id": 637479}]}]}
  },
  "Latios": {
    "sets": {
      "Special Wallbreaker": {
        "description": "<p>Latios is an elite wallbreaker thanks largely to its raw power. Its powerful STAB move in Draco Meteor allows Latios to demolish all but the sturdiest neutral targets, including Tyranitar, Gastrodon, and Hippowdon. It can leverage its solid Speed stat versus common offensive Pokemon such as Victini, Galarian Zapdos, Sandy Shocks, and Blacephalon as well as its numerous useful resistances to create opportunities to unleash devastating moves. Psyshock is preferred over Psychic to defeat specially defensive Pokemon such as Blissey and Chansey more easily. Trick is used on Choice Specs sets to cripple would-be walls such as Jirachi and Clefable, while Roost allows Life Orb variants to offset the item's recoil. Mystical Fire is preferred on Latios to hit Steel-types such as Excadrill, Aegislash, and Celesteela. It can also choose to use Thunderbolt to flip important matchups such as Tapu Fini, Slowking, and physically defensive Clefable while also providing a consistent way to damage most Steel-types. Choice Specs is preferred to maximize damage output, but Life Orb can also be chosen in order to enable switching moves, at the cost of the ability to eliminate Pokemon such as Tyranitar and Hippowdon with Draco Meteor. Latios's ability to blow away physical walls makes it an excellent partner to any physical wallbreaker. Latios appreciates opportunities to fire off powerful attacks, so Pokemon with pivoting moves such as Cinderace, Galarian Zapdos, and Scizor make for good partners. Latios struggles with Choice Scarf users able to force it to switch, such as Tapu Fini, Blacephalon, and Latias, as well as Pokemon able to naturally outspeed it such as Cinderace and Alakazam. These weaknesses can be alleviated with defensive pivots able to switch into these threats, such as Clefable, Celesteela, Hippowdon, and Skarmory, depending on foe. Latios also pairs well with supportive Pokemon like Clefable and Mega Tyranitar that are able to help it break through walls through utility moves such as entry hazards or Knock Off. Latios pairs especially well with Fighting-type wallbreakers such as Buzzwole, Galarian Zapdos, and Iron Hands due to their favorable matchups into the Steel- and Dark-types looking to switch into Latios's STAB moves. In return, Latios offers a Psychic resistance and a favourable matchup into physically defensive Pokemon such as Skarmory, Slowbro, and opposing Buzzwole.</p>"
      },
      "Double Dance": {
        "description": "<p>Access to Calm Mind and Stored Power make Latios an overwhelming setup sweeper. It makes use of the synergy between its boosting moves and Weakness Policy to punish opponents both for choosing to attack it and for choosing not to attack it. Stored Power allows Latios to take advantage of stat boosts even versus Unaware Pokemon such as Clefable and Skeledirge. Aura Sphere is chosen to threaten the only Pokemon able to survive a boosted Stored Power: Dark-types like Bisharp, Tyranitar, and Hydreigon. Latios fits best on hyper offense teams, which require support from Pokemon such as Excadrill and Mew that can set entry hazards for Latios to secure important KOs late-game. It struggles with strategies able to interrupt its setup without activating Weakness Policy, such as phazing moves from Skarmory and specially defensive Pokemon able to trade hits with Latios such as Scizor and Celesteela. Setup sweepers such as Dragon Dance Mega Tyranitar and Scizor aid with overwhelming Steel-types, while Z-Celebrate Victini and Meteor Beam Celesteela can threaten the Steel-types once they have been forced in. Pokemon halted by Unaware users appreciate Latios's ability to boost past them, namely Dragon Dance Mega Aerodactyl and Swords Dance Cinderace.</p>"
      },
      "Mega Attacker": {
        "description": "<p>Mega Latios's gargantuan Special Attack, excellent bulk for an offensive Pokemon, and Speed tier that outpaces common wallbreakers suchas Thundurus-T, Keldeo, and Enamorus make it powerful threat that can terrorize offensive and defensive Pokemon alike. Aura Sphere is essential for its role, targeting Dark-types, notably 2HKOing the Tyranitar formes and OHKOing Bisharp, foes that can otherwise Pursuit trap Mega Latios. It also targets Steel-types such as Excadrill. Shadow Ball hits opposing Psychic-types such as Latios and Latias. Alternatively, Thunderbolt targets Water-types such as Tapu Fini and Flying-types such as Celesteela; additionally, while Mega Latios doesn't need Thunderbolt to threaten Enamorus and Skarmory, it always OHKOes them after Stealth Rock. Both options have the added benefit of pressuring Slowbro and Slowking, which otherwise stonewall and can pivot out on Mega Latios. Recover lets Mega Latios stay healthy, allowing it to check foes such as Keldeo and Iron Hands throughout a game. Mega Latios best fits on bulky offense teams looking for a fast offensive threat that has strong defensive utility. It has massive competition with Mega Latias, which is a much better setup sweeper thanks to its massive bulk, so teams using Mega Latios must utilize the instant offensive power it provides. Mega Latios is helpless against certain special walls such as Chansey and Blissey, making physical wallbreakers such as Scizor and Iron Hands necessary partners. Pursuit trappers like Tyranitar and Bisharp are notably effective at removing these walls. While it isn't helpless against Dark-types, foes like Mega Tyranitar and Bisharp can still easily win the one-on-one thanks to their bulk or access to Sucker Punch, making Fighting-types such as Buzzwole and Galarian Zapdos good partners for their ability to check and remove them. Mega Latios can be revenge killed by faster foes such as Choice Scarf Enamorus and Hydreigon, making bulky teammates such as Amoonguss and Celesteela useful teammates. Based on its choice of coverage, Mega Latios is either walled by Psychic-types like Latios and Latias or certain Water- and Flying-types like Calm Mind Tapu Fini and Celesteela. The aforementioned Pursuit trappers are excellent at removing the former. Ghost-types like Hisuian Zoroark can also work well at KOing these foes. Against the latter group, Electric-types such as Iron Hands and Zeraora can eliminate them. Given that many of Mega Latios's checks lack recovery and don't hold Heavy-Duty Boots, entry hazard setters like Mew, Excadrill, and Mega Tyranitar can help it break through them.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "3MoreMinutes", "user_id": 545166}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}, {"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Gastrodon": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Gastrodon sets itself apart with its excellent Water / Ground typing in combination with Storm Drain. This unique set of traits allows it to flourish on defensive teams, where it is able to check a number of strong special attackers such as Mega Latias and Volcanion while supporting the team with passive damage. Spikes or Stealth Rock allow Gastrodon to support its teammates by wearing down the opposing team. If the team already has entry hazards covered, Clear Smog can be used to stop common setup sweepers such as Victini and Clefable that would otherwise greatly threaten Gastrodon and its teammates. Scald is used to cripple both physical attackers and poison-immune Pokemon with a burn. Earthquake is an alternative for more immediate pressure against Poison- and Steel-types such as Okidogi and Iron Moth, but it leaves Gastrodon unable to punish switch-ins like Celesteela and Skarmory. The final moveslot is usually given to Toxic, which allows Gastrodon to slowly wear down its answers. Alternatively, Protect can be used in tandem with Leftovers to improve its longevity while also scouting common Choice-locked Pokemon such as Latios and Enamorus. Gastrodon's great special bulk and unique resistances allow it to help out Pokemon like Skarmory, Slowbro, and Tangrowth that struggle against strong Fire- or Electric-type attacks from Pokemon like Volcanion, Sandy Shocks, and Zeraora. Gastrodon can get worn down quickly through poison and burn and therefore appreciates cleric support from Pokemon like Clefable and Blissey. Its low Defense also leaves it susceptible to strong physical attackers such as Mega Tyranitar and Bisharp, and therefore, it appreciates physical walls such as Tangrowth and Buzzwole that can handle those threats. Gastrodon is also very weak to Pokemon that use Grass-type moves such as Mega Venusaur and Iron Moth and therefore needs to be wary of coverage from Pokemon it is used to check. Secondary special walls like Blissey and Celesteela are therefore appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Aera", "user_id": 572981}], "teams": [{"name": "Quality checked by", "members": [{"username": "Runo", "user_id": 568189}]}, {"name": "Grammar checked by", "members": [{"username": "Tbolt", "user_id": 555379}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Hippowdon": {"sets": {"Mixed Wall": {"description": "<p>Attack EVs OHKO Excadrill, Defense EVs are adjustable for Pokemon like Cinderace and Mega Tyranitar</p>"}}},
  "Magnezone": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Magnezone combines its ability to trap and remove certain Steel-types with potent special wallbreaking prowess that lets it rip through common defensive staples such as Tapu Fini, Clefable, and Mega Tyranitar. It is an effective pivot with Volt Switch, though it must be wary of Ground-types like Hippowdown and Excadrill switching in. Hidden Power Grass primarily targets Gastrodon and Quagsire, and it also hits other, rarer Pokemon that share their type combination like Swampert. Hidden Power Fire is an alternative to hit Excadrill on the switch and also OHKO Scizor after trapping it. Magnezone best fits on offense teams looking for a means to remove Steel-types, primarily Skarmory and Celesteela. Removing the former enables numerous physical attackers, such as Mega Tyranitar and Scizor while removing the latter enables teammates such as Latios and Enamorus. Pivots such as Slowking can form effective pivoting cores with Magnezone, helping it safely switch into foes like Slowbro and Clefable; physically attacking pivots like Scizor can notably lure Skarmory in. Due to Skarmory possessing Sturdy and Body Press, Stealth Rock support from teammates such as Mega Tyranitar and Clefable greatly aids Magnezone. Magnezone struggles to take on Ground-types such as Hippowdon and Ting-Lu, and depending on its choice of coverage, it's walled by Ground / Water types like Gastrodon or Ground / Steel types like Excadrill, making Grass- and Water-types such as Mega Venusaur and Keldeo useful partners. Magnezone struggles to break through special walls like Chansey and Blissey, making the aforementioned physical wallbreakers useful; Pursuit trappers such as Mega Tyranitar and Bisharp are especially effective at removing these foes, and they appreciate Magnezone's pivoting capabilities.</p>"
      },
      "Substitute + 3 Attacks": {
        "description": "<p>Substitute lets Magnezone take advantage of switches from foes it forces out such as Tapu Fini and Clefable and exploit status moves like Amoonguss's and Celesteela's Leech Seed. Hidden Power Grass targets Gastrodon, Quagsire, and some rare foes like Swampert. Electrium Z powering up Thunderbolt helps Magnezone break through certain foes it traps such as Scizor and specially defensive Celesteela; Steelium Z primarily helps against Ground- and Grass-types such as Hippowdon and Mega Venusaur. Magenzone best fits on offense teams looking to remove certain Steel-types, namely Skarmory and Celesteela. This enables numerous teammates such as Mega Tyranitar and Scizor. Since it fears taking Skarmory's Body Press and Celesteela's Flamethrower upon switching in, a pivot that can lure them in like Galarian Zapdos or Scizor is a great partner. A Stealth Rock setter like Clefable can let Magnezone avoid Sturdy to OHKO Skarmory. Magnezone is completely helpless against Excadrill, so Grass- and Water-types such as Tangrowth and Slowbro can help by dealing with them. After removing opposing Steel-types, Magnezone isn't particularly useful, though it's still a reasonably strong special wallbreaker, especially if it still can use its Z-Move. It struggles with special walls like Blissey and Chansey, so physical wallbreakers, notably Pursuit trappers like Mega Tyranitar, can help by removing them.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Tangrowth": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Tangrowth's excellent natural physical bulk, crucial resistances, and variety of utility options at its disposal come together to make it a solid physical wall, being an effective stop to the likes of Mega Tyranitar, Iron Hands and Excadrill. Regenerator only serves to further complement the aforementioned defensive traits, blessing it with the longevity needed to repeatedly switch into and answer these Pokemon. Knock Off allows Tangrowth to cripple incoming switch-ins by removing important held items, such as Heavy-Duty Boots from Cinderace and Leftovers from Clefable and Celesteela, making them far easier to wear down in the long-term. Hidden Power Fire allows Tangrowth to deal high amounts of damage to Steel and Grass-type Pokemon in a pinch, most notably 2HKOing Scizor. Alternatively, Focus Blast greatly improves Tangrowth's matchup against Dragon Dance variants of Mega Tyranitar, Excadrill, and Bisharp, being able to OHKO the latter, although its lack of accuracy can be somewhat irritating. Sleep Powder allows Tangrowth to neutralize incoming targets it would otherwise be unable to threaten, such as Iron Moth, offensive Celesteela, and Skarmory while also shutting down setup sweepers like Iron Hands, Calm Mind Clefable, and Mega Altaria. However, Toxic can be used instead to permanently cripple Pokemon such as Buzzwole, Salamence, and Slowking, limiting their ability to pivot into Tangrowth throughout the game. Rocky Helmet allows Tangrowth to punish contact moves from the likes of U-turn  as well as Buzzwole, whereas Heavy-Duty Boots can be used to provide Tangrowth with greater longevity against entry hazards, allowing it to take advantage of Regenerator more effectively; it also helps keep Tangrowth out of KO range of wallbreakers it may try to switch in against, such as Iron Hands and Terrakion when entry hazards have been set. Tangrowth fits best on balance teams that appreciate its longevity and diversity in crippling opposing teams via its utility options. Entry hazard setters such as Ting-Lu, Clefable, and Toxic Spikes Iron Moth appreciate Tangrowth's ability to deter opposing hazard removal options such as Tapu Fini and Salamence while further capitalizing on Tangrowth's tendency to remove various items from targets, such as Cinderace and Amoonguss, with Knock Off. Specially defensive teammates such as Slowking, Gastrodon, and Celesteela have excellent defensive synergies with Tangrowth, compensating for its low Special Defense by providing a solid backbone against threats such as Latios, Hydreigon, and Alakazam; Slowking and Gastrodon also help Tangrowth play around with the likes of Keldeo, utility Clefable, and Victini, which can overwhelm it easily. In return, Tangrowth can help check the likes of Iron Hands and Bisharp, which may threaten them. Besides the aforementioned Pokemon, offensive teammates such as Cinderace, Choice Specs Enamorus, and both Thundurus formes appreciate Tangrowth's ability to sponge Knock Off from Pokemon that they may be forced out by, such as Mega Tyranitar, Clefable, and Scizor.</p>"
      },
      "Assault Vest": {}
    },
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "zastra", "user_id": 558636}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Gallade": {
    "sets": {
      "Swords Dance": {
        "description": "<p>With a sky-high Attack stat and a powerful STAB Close Combat, Mega Gallade serves as a potent wallbreaker in the tier, able to pressure common defensive cores featuring Pokemon such as Skarmory, Ting-Lu, and Mega Venusaur. Mega Gallade's good Speed tier also allows it to notably get the jump on threats like non-Choice Scarf Enamorus, Keldeo, and Galarian Zapdos. After a Swords Dance boost, Mega Gallade can OHKO a majority of the tier, including bulky Pokemon like Iron Hands, Hippowdon, and Mega Latias. Close Combat OHKOes threats like Mega Tyranitar, Excadrill, and Hydreigon while 2HKOing bulkier Pokemon like Celesteela and Gastrodon. Zen Headbutt threatens Mega Venusaur, Amoonguss, and Iron Moth while also being its strongest move against Fairy-types like Tapu Fini and Clefable. Triple Axel threatens Flying-types like both Thundurus formes and Enamorus as well as Dragon-types like Salamence, Mega Latias, Mega Latios, and Mega Altaria while also being its strongest move against Mega Sableye. Knock Off threatens switch-ins like Skeledirge, Slowking, and Slowbro while also hindering foes that Mega Gallade struggles to break through like Unaware Clefable. Physical cleaners like Mega Aerodactyl and Scizor appreciate Mega Gallade being able to threaten or weaken their switch-ins such as Mega Venusaur and Skarmory, respectively, potentially allowing them to sweep late-game. Mega Gallade's frailty means it's OHKOed by faster threats like Mega Aerodactyl and Choice Scarf Galarian Zapdos, so teammates that can handle them like Celesteela and Slowbro are appreciated. Mega Gallade struggles to break through Pokemon like Mega Sableye, Skeledirge, and Unaware Clefable, meaning it can struggle versus bulkier teams as a whole. Therefore, teammates that can assist in these matchups while threatening the aforementioned walls such as Enamorus and Ceruledge are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Victini": {
    "sets": {
      "Z-Celebrate": {
        "description": "<p>Z-Celebrate turns Victini into a powerful and difficult to revenge kill setup sweeper capable of setting up against and threatening large portions of the metagame. After using Z-Celebrate, Victini outspeeds the entire unboosted metagame as well as common Choice Scarf users such as Tapu Fini. The boost to Victini's defenses eases setup and makes it more difficult for priority moves such as Shadow Sneak from Ceruledge and Sucker Punch from Bisharp to revenge kill it; in addition, it lets Victini survive attacks such as Earthquake from Excadrill, giving it the option to set up against them. At +1, Victini's Searing Shot OHKOes most Steel-types such as Excadrill. Stored Power pairs nicely with Z-Celebrate, reaching 120 BP after the latter move is used, enabling Victini to deal massive damage to Fire-resistant foes such as Mega Aerodactyl and Tapu Fini, OHKOing the former after Stealth Rock. Stored Power's Base Power rise after setting up also enables Victini to 2HKO Unaware users such as Quagsire and physically defensive Skeledirge. Focus Blast pairs well with Victini's STAB moves, hitting top threats such as Mega Tyranitar, and its poor accuracy is mitigated somewhat by Victory Star. Alternatively, Energy Ball lets Victini destroy specially defensive Gastrodon, which otherwise takes little from even a boosted Stored Power. Z-Celebrate Victini fits best on hyper offense teams as a late-game cleaner. Entry hazard support from Mew and Excadrill can help wear down foes such as Tapu Fini and Slowbro into range of Victini's attacks. Excadrill also offers Rapid Spin to remove hazards for Victini. Good offensive partners for Victini include Swords Dance Scizor and Autotomize Celesteela. Finally, Celesteela and Victini share similar checks in specially bulky Pokemon like Gastrodon and Mega Latias, so they can weaken each other's checks to enable one of them to sweep.</p>"
      },
      "Choice Band": {
        "description": "<p>Victini is a great wallbreaker with Choice Band, packing a V-create strong enough to 2HKO Fire-resistant Pokemon as bulky as Gastrodon, offensive Tyranitar, and Tapu Fini. U-turn generates momentum against foes such as Tyranitar and Mega Latias, wearing them down over the course of a game. Trick lets Victini cripple an opposing physical wall such as Slowbro by giving it a Choice Band. Bolt Strike targets Water-types, notably 2HKOing Slowbro and physically defensive Tapu Fini Choice Band Victini fits best on offensive and bulky offense teams, where it serves as a powerful early- or mid-game wallbreaker. Victini is vulnerable to all forms of entry hazards and therefore appreciates entry hazard removal from Excadrill, Hydreigon, or Tapu Fini. Excadrill and Mega Tyranitar can also set Stealth Rock to weaken Victini's checks such as Slowbro into range of its attacks. Victini also greatly enjoys U-turn or Teleport support to let it hit the field to launch its powerful V-create. Scizor and Slowbro are all good Pokemon that fulfill this role. Scizor can even trap some of Victini's checks, such as Mega Latias, with Pursuit. Since Victini can struggle to reliably pressure some of its aforementioned checks, like Slowbro thanks to Regenerator, a partner that can take advantage of them, such as Nasty Plot Hydreigon, is also appreciated. Finally, a good late-game cleaner such as Autotomize Celesteela can finish off a team weakened by Victini. On sun teams, Venusaur is a good option for a cleaner that pairs well with Victini and enjoys its ability to punish Pokemon used to check it, such as Blissey.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "nimzowitsch", "user_id": 272785}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Excadrill": {
    "sets": {
      "Sand Rush": {
        "description": "<p>Excadrill cements itself as a staple on sand teams thanks to its great offensive capabilities with Swords Dance and Sand Rush. After a Swords Dance boost, it can effectively outspeed and break through a large portion of the metagame with its strong STAB moves. Steelium Z allows Excadrill to eliminate chipped switch-ins such as Buzzwole and Tangrowth after a Swords Dance boost. Rapid Spin supports the team while also making sure that Excadrill can beat other Sand Rush Excadrill and Unburden Hawlucha. If a teammate can remove entry hazards, Rock Slide is an alternative that stops Celesteela and Skarmory from stonewalling Excadrill, as well as handling threats such as both Thundurus formes. As a Sand Rush sweeper, Excadrill needs to partner with Tyranitar or Hippowdon to outpace the entire metagame. Strong wallbreakers like Choice Band Tyranitar, Latios, and Dracozolt form a strong offensive core with Excadrill to help overwhelm its checks such as Slowbro or Skarmory. In return, Excadrill can pressure threats such as Iron Hands and opposing Excadrill for them, respectively. Additionally, Choice Scarf users such as Hydreigon, Latias, and Tapu Fini can help pressure some of Excadrill's checks, such as Buzzwole and Tangrowth, while also acting as secondary speed control options outside of sand. Tapu Fini in particular is a great partner to protect Excadrill from burns while setting up, thanks to its Misty Terrain, while also handling Buzzwole for it. Slowbro and Slowking handle Fighting- and Fire-types for it such as Buzzwole and Victini, as well as providing Future Sight support and safely getting Excadrill on the field with Teleport.</p>"
      },
      "Offensive Utility": {
        "description": "<p>Excadrill is a strong offensive spinner thanks to its ability to pressure common entry hazard setters, such as Clefable and Tyranitar, while serving as a strong check to common foes such as Mega Tyranitar and Iron Hands. The listed EV spread outruns Jolly Mega Tyranitar, and the Attack EVs and nature make Excadrill less passive against threats such as Mega Latias and Scizor; the specific listed arrangement slightly optimizes the stat. The rest of the EVs are dumped into Special Defense to better check threats such as Mega Latias. Toxic is a great option to cripple common switch-ins to Excadrill such as Buzzwole, Tangrowth, and Slowbro while pressuring other threats such as Latias and Mega Sableye, providing more long-term support for its teammates. Iron Head can be used to check threats such as Clefable more easily. Swords Dance is an option, if running Iron Head instead of Toxic, to become a powerful setup sweeper. If running Swords Dance, then a more offensive EV spread of 252 Atk / 4 SpD / 252 Spe with a Jolly nature can be used. Stealth Rock is another option that gives Excadrill additional role compression as a hazard setter. Excadrill can struggle against physical walls such as Slowbro, Buzzwole, Skarmory, and Celesteela. Hydreigon, Latios, and the Thundurus formes can help deal with those defensive checks, and in return, Excadrill can check threats such as Mega Tyranitar and Bisharp for them. Excadrill can be forced out by faster threats such as Galarian Zapdos, Cinderace, Iron Moth, and Blacephalon; defensive Pokemon such as Slowbro and Tapu Fini can help manage them, and these also give Excadrill slow pivoting in Teleport and Misty Terrain, respectively. Other defensive pivots such as Tangrowth and Tapu Bulu can help deal with Ground- and Water-type checks such as Hippowdown, Gastrodon, and Tapu Fini; however, run High Horsepower instead of Earthquake if pairing with Tapu Bulu due to Grassy Terrain cutting Earthquake's power in half. In return, Excadrill can remove threats such as offensive Jirachi and Nihilego for them.</p>"
      },
      "Suicide Lead": {
        "description": "<p>Excadrill can function as a great suicide lead on hyper offense teams, having the unique ability to set up entry hazards against stall teams thanks to Mold Breaker bypassing Mega Sableye's Magic Bounce. Rapid Spin prevents opposing entry hazards from being set. Steel Beam allows Excadrill to go out while generating momentum for its teammates, as well as preventing common Defoggers such as Tapu Fini from clearing its Stealth Rock. Toxic is another option to cripple opposing hazard setters and Mega Sableye long-term. Focus Sash is an important item to ensure that Excadrill can reliably set Stealth Rock. Excadrill can struggle against threats such as Skarmory and Celesteela due to their Ground immunities; strong setup sweepers such as the Thundurus formes, Meteor Beam Celesteela, and Nihilego can pressure them for it. Excadrill's Rapid Spin is especially beneficial for setup sweepers otherwise vulnerable to Stealth Rock, such as Booster Energy Iron Moth and Focus Sash Polteageist.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Runo", "user_id": 568189}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Lilligant-Hisui": {
    "sets": {
      "Offensive Sweeper": {
        "description": "<p>Hisuian Lilligant is a potent setup sweeper thanks to it outspeeding most prominent Choice Scarf users like Galarian Zapdos, Sandy Shocks, and Hydreigon after one boost, ablilty in Hustle, and access to Victory Dance. Leaf Blade 2HKOes Clefable, Mew, and Mega Sableye at +1. Close Combat helps deal with the tier's numerous Dark- and Steel-types, OHKOing Mega Tyranitar and Excadrill. It also OHKOes offensive Celesteela, Scizor, and bulky Cinderace at +1, as well as 2HKOing Scizor and Assault Vest Tangrowth. Encore can lock foes into recovery and setup moves, such as Skarmory with Iron Defense and Roost, forcing them out and giving Hisuian Lilligant an opportunity to set up. Grassium Z provides Hisuian Lilligant with a way to break through most Pokemon in the tier, helping against Clefable, Iron Hands, and Mega Sableye, and it also lets Hisuian Lilligant bypass Hustle lowering its accuracy, while Focus Sash ensures that it can set up at least once. Hisuian Lilligant can pair well with entry hazard setters like Ting-Lu, Mew, and Skarmory, which can help it to guarantee an OHKO on foes such as Galarian Moltres and offensive Scizor with Stealth Rock chip. In return, Hisuian Lilligant can threaten common hazard removers like Tapu Fini and Excadrill, as well as deal with their checks like Gastrodon for Ting-Lu and Hippowdon and Sandy Shocks for Skarmory. Pivots such as Cinderace, Sandy Shocks, and Galarian Zapdos can be great partners for Hisuian Lilligant, bringing it in on defensive Pokemon like Hippowdon and Chansey, providing it with a chance to wallbreak or set up. Hisuian Lilligant can struggle to break through Pokemon such as Mega Venusaur, Buzzwole, and Amoonguss, making teammates like Cinderace and Victini appreciated. On offensive teams, Hisuian Lilligant can pair well with Iron Moth, Ceruledge, and Cinderace, thanks to its ability to threaten Water- and Ground-types. In return, they can help threaten Pokemon like Mega Venusaur.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Zoroark-Hisui": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Hisuian Zoroark's combination of high Special Attack and Speed, access to Nasty Plot, and excellent typing and ability that provide setup opportunities makes it a great wallbreaker and sweeper. Focus Blast primarily targets the Dark- and Normal-types that resist or are immune to Hisuian Zoroark's Shadow Ball, notably OHKOing most variants of Tyranitar and its Mega forme and 2HKOing Hydreigon unboosted. It also targets Steel-types like Excadrill. Fightinium Z serves the dual purpose of letting Hisuian Zoroark avoid having to rely on Focus Blast's shaky accuracy while giving it the power to OHKO foes like Hydreigon unboosted and Galarian Moltres at +2. Grass Knot hits Ground-types like Hippowdon and Gastrodon, OHKOing most of them after Nasty Plot. Hisuian Zoroark fits best on offense teams with other wallbreakers and sweepers. Teammates like Iron Moth can KO or weaken Hisuian Zoroark's checks like specially defensive Celesteela, while it can remove foes like Hippowdon. Despite its good Speed, Hisuian Zoroark is vulnerable to being revenge killed by faster foes like Cinderace and Choice Scarf Hydreigon, making walls such as Skarmory for the former and Tapu Fini for the latter useful partners. Illusion makes Hisuian Zoroak pair nicely with Pokemon weak to Fighting and Ghost, such as Mega Tyranitar and Latios, forcing the opponent into an uneasy guessing game that can allow it or its teammates to set up. Pretending to be a physical attacker can also lure in physical walls like Skarmory and Buzzwole. Hisuian Zoroak's immunity to Ghost and Fighting makes it a powerful check to Ghost-types like Ceruledge. Hazard setters like Excadrill and Mew can weaken checks like Mega Venusaur and Iron Hands into Hisuian Zoroark's KO range.</p>"
      },
      "Choice Specs": {
        "description": "<p>Hisuian Zoroark's high Speed, power, and spammable Shadow Ball make it a potent wallbreaker. Focus Blast OHKOes Dark-types such as Tyranitar, Mega Tyranitar, and Hydreigon and Steel-types such as Excadrill. Grass Knot 2HKOes Ground-types like Hippowdon and Gastrodon; it also 2HKOes or 3HKOes most variants of the Tyranitar formes, easing prediction and letting Hisuian Zoroark sometimes avoid having to rely on the inaccurate Focus Blast. Trick can cripple walls Hisuian Zoroark otherwise can't touch, such as Blissey and Chansey, though it must watch out for Mega Tyranitar, which is immune to Trick and can Pursuit trap the Choice-locked Hisuian Zoroark. Hisuian Zoroark fits best on offense teams. Pivots such as Cinderace and Iron Moth can provide Hisuian Zoroark safe entry for it to wallbreak. Hisuian Zoroark struggles against Dark-types after being locked into Shadow Ball, especially Pursuit users like the Tyranitar formes, making Fighting-types like Buzzwole and Iron Hands great partners for their ability to threaten them. They also work well at threatening Normal-types like Chansey and Blissey. In return, Hisuian Zoroark can eliminate physical walls like Clefable and Skarmory, and can notably lure them in thanks to Illusion. Setup sweepers like Booster Energy Iron Moth and Hydreigon can take advantage of Hisuian Zoroark weakening the opposing team's defensive cores by sweeping late-game. Entry hazard setters like Mew and Excadrill can chip Hisuian Zoroark's targets into KO range, something which notably punishes checks with limited longevity like Tapu Fini, Iron Hands, and the Tyranitar formes.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "red fintans", "user_id": 637479}]}]}
  },
  "Amoonguss": {
    "sets": {
      "Defensive": {
        "description": "<p>Amoonguss serves as a solid defensive pivot that is capable of scouting and checking a range of offensive foes like Zeraora, Keldeo, and Iron Hands while staying healthy with Regenerator. Heavy-Duty Boots allows Amoonguss to maximize Regenerator recovery, while Black Sludge improves Amoonguss's passive recovery, notably offsetting sand as well as punishing Trick users such as Latios with good prediction. Foul Play allows Amoonguss to inflict massive damage to Pokemon such as Scizor and Excadrill; alternatively, Clear Smog shuts down Swords Dance Iron Hands, Calm Mind Clefable, and Calm Mind Enamorus while additionally not being blocked by Taunt, easing the matchup versus Calm Mind Tapu Fini. Amoonguss synergizes well with Pokemon such as Mega Tyranitar and Hippowdon that appreciate its useful defensive profile versus threats like Keldeo. Other teammates lacking in recovery such as Excadrill also appreciate Amoonguss's ability to scout certain offensive Pokemon such as Thundurus-T. Once Amoonguss has successfully used Spore, it becomes quite passive—this can lead to it being exploited by common Steel- and Poison-types such as Celesteela and Iron Moth. Therefore, teammates such as Cinderace, Mega Latias, and Mega Tyranitar that can ease the burden of allowing these foes entry make for very effective partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "sealoo", "user_id": 514772}], "teams": [{"name": "Quality checked by", "members": [{"username": "Runo", "user_id": 568189}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Bisharp": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Thanks to its typing and access to Sucker Punch, Swords Dance Bisharp cements itself as a powerful wallbreaker and late-game cleaner. Knock Off offers high damage output and item removal, which can aid in chipping down checks that rely on their item, such as Leftovers Iron Hands. Sucker Punch offers valuable priority to revenge kill faster threats such as Latios and Alakazam, and, after a boost, Bisharp can thwart revenge killing attempts from faster Pokemon like Cinderace and Thundurus-T. Iron Head is a great complementary STAB move for Fairy-types such as Enamorus and Clefable, which otherwise resist Dark-type attacks, while being Bisharp's best neutral option versus Pokemon such as Mega Venusaur and Buzzwole. An Adamant nature enables Bisharp to threaten an OHKO on Clefable with minimal chip damage. Maximum Speed investment is needed to outspeed Mega Tyranitar, Celesteela, and Scizor and to Speed tie with opposing Bisharp. Swords Dance Bisharp works best on offensive teams with teammates such as Cinderace, Iron Hands, and Swords Dance Scizor that put pressure on shared checks such as defensive Hippowdon, Skarmory, and Buzzwole. Similarly, Bisharp pairs well with special attackers like Thundurus-T and Latios by pressuring specially defensive walls such as Blissey for them. Bisharp struggles to break through bulky Fighting-types like Iron Hands and Okidogi, making partners like Slowbro, Clefable, and Mega Latias beneficial. Future Sight support from Slowbro and Slowking aids Bisharp in whittling down the latter two in range for a boosted Knock Off or Iron Head. Bisharp is an excellent partner for entry hazard setters such as Mew and Excadrill, as Defiant deters Defog from Pokemon like Tapu Fini. In return, Bisharp appreciates hazards chipping down switch-ins like Iron Hands and Leftovers Hippowdon. Similarly, Ribombee appreciates Bisharp pressuring common Defoggers like Tapu Fini. In exchange, Sticky Web from Ribombee enables Bisharp to outspeed and significantly damage Pokemon that otherwise outspeed it, such as Excadrill and Keldeo.</p>"
      },
      "Pursuit Trapper": {
        "description": "<p>Bisharp acts as an offensive answer to common Psychic- and Ghost-types in the tier, such as Ceruledge, Blacephalon and Latios, through the combination of Pursuit and Sucker Punch. Knock Off provides strong, super effective damage to targets that may not switch out immediately, including Mega Latias, Skeledirge, and Slowbro, while removing items from walls like Heavy-Duty Boots from Buzzwole and Amoonguss. Sucker Punch provides valuable priority to pick off frail or weakened faster Pokemon such as Alakazam, Ceruledge, and Hisuian Zoroark. Iron Head is a valuable option to hit Fairy-types like Enamorus and Clefable super effectively and Pokemon like Buzzwole and Tapu Fini neutrally. Investing 184 EVs into Speed enables Bisharp to outspeed fully invested offensive Celesteela prior to Autotomize and Tyranitar. Fighting-types like Okidogi, Galarian Zapdos, Buzzwole, and Mega Heracross benefit immensely from Bisharp trapping Ghost- and Psychic-types, and they also appreciate it wearing down defensive Fairy-types like Tapu Fini. Bisharp can also benefit defensive Pokemon like Skarmory, Hippowdon, and Tangrowth by picking off frail wallbreakers such as Iron Moth and Alakazam. Pursuit Bisharp has a noticeable weakness to bulky physical walls in the tier such as Buzzwole, Hippowdon and Skarmory, so pairing it with sufficient offensive pressure from Enamorus, Mega Latias, Iron Moth, Cinderace, and Galarian Zapdos to take advantage of these foes is appreciated. Without Swords Dance, Bisharp enables offensive Fighting-types such as Keldeo, Iron Hands, Okidogi, and Hawlucha to switch in with relative impunity. Bulky Fighting-resistant partners like Mega Latias, Slowbro, Clefable, Tapu Fini, and Mega Venusaur can help pivot into these offensive threats. Finally, Bisharp can find a place on balanced hazard stack teams alongside Skarmory or Gastrodon. It can dissuade Defog via Defiant and threaten chip damage on Defoggers like Tapu Fini with its STAB moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Velcroc", "user_id": 391284}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Hydreigon": {
    "sets": {
      "Choice Scarf": {},
      "Nasty Plot": {},
      "Choice Specs": {
        "description": "<p>Choice Specs Hydreigon is a potent wallbreaker, being able to threaten common special walls such as Mega Tyranitar and Celesteela with its powerful STAB moves and coverage options. It also has more longevity and defensive utility, including a resistance to Pursuit, at the cost of Speed and more consistent STAB moves compared to other special wallbreakers like Latios. Draco Meteor OHKOes threats like Iron Moth and Mega Heracross while doing significant damage to foes such as Galarian Moltres, Iron Hands, and Mega Sableye. Dark Pulse threatens Slowking and gives Hydreigon a spammable STAB move. Flash Cannon hits Fairy-types like Enamorus, Mega Altaria, and Clefable. Fire Blast threatens Celesteela, Tangrowth, and Bisharp, Roost takes advantage of forced switches and lets Hydreigon stay healthy to switch in several times throughout the match, while U-turn lets it pivot out of foes it can struggle against such as Tapu Fini, Azumarill, and Clefable. A Timid nature lets Hydreigon outspeed Excadrill and Ceruledge, while Modest gives Draco Meteor a high chance of OHKOing Choice Band Iron Hands. Hydreigon struggles to break through Fairy-types such as Tapu Fini, Azumarill, and Clefable, as well as Celesteela if not running Fire Blast, so teammates that can pressure them like both Thundurus formes and Mega Venusaur are helpful. Hydreigon also appreciates pivots such as Cinderace and Slowking that can safely get it onto the field; Cinderace can use U-turn to pivot out of switch-ins that Hydreigon threatens like Slowbro and Mega Venusaur, while Slowking can safely pivot it in with Teleport. Knock Off support from the likes of Mega Vensaur, Clefable, and Thundurus-T is appreciated to help Hydreigon break through Pokemon like Celesteela, Tapu Fini, and Assault Vest Tangrowth. Setup sweepers like Tapu Fini and Galarian Moltres benefit from Hydreigon's longevity and ability to pressure their checks such as Mega Venusaur and Mega Tyranitar, respectively, allowing them to become wincons late-game; fast teammates such as Choice Scarf Enamorus and Keldeo also appreciate Hydreigon for this reason, with it being able to pressure their switch-ins such as Slowking and Assault Vest Tangrowth, which can open the way for them to clean late-game. Hydreigon can also easily be revenge killed by faster Pokemon such as Hawlucha, Latios, and Enamorus; Skarmory can deal with Hawlucha while providing Spikes support, and Slowking can deal with Latios and Enamorus.</p>"
      },
      "Offensive Utility": {}
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Thundurus": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Thundurus is a good setup sweeper and wallbreaker on offensive teams thanks to its great Special Attack and good offensive movepool, which can make it threatening even after one boost. It can be used over Thundurus-T due to its higher Speed, outspeeding foes like Iron Moth, Keldeo, and Enamorus. Thunderbolt helps against the plethora of bulky Water- and Flying-types, 2HKOing Celesteela, Tapu Fini, and Slowbro. It can also threaten 2HKOs on bulky foes like Magic Guard Clefable and Mega Sableye at +2. Focus Blast helps against the tier's numerous Dark- and Steel-types, OHKOing Tyranitar and Excadrill and having good odds to OHKO Hydreigon and Mega Tyranitar after Stealth Rock. Hidden Power Ice hits Dragon-types that resist Thunderbolt, 2HKOing Latios, Mega Altaria, and unboosted Mega Latias at +2, its also more spammable against Grass-types than Focus Blast and can hit Pokemon like Amoonguss super effectively. Psychic is an alternative that helps against Poison- and Fighting-types, 2HKOing foes like Choice Band Iron Hands, Amoonguss, and Buzzwole. Fightinium Z can provide Thundurus a way to OHKO targets like Mega Tyranitar, help break through neutral targets like Gastrodon, and bypass Focus Blast's accuracy. Thundurus can have a hard time breaking through specially defensive Pokemon, notably Mega Latias, which can set up on it even if Thundurus uses Nasty Plot, as well as Tapu Bulu and Mega Venusaur when lacking Hidden Power Ice or Psychic; it pairs well with other offensive Pokemon like Hydreigon, Cinderace, and Ceruledge that can threaten these foes. In return, Thundurus can help to deal with their checks like bulky Scizor, Tapu Fini, and Iron Hands. Thundurus can pair well with pivots like Cinderace, which can bring it in against Water-types it threatens like Tapu Fini as well as help against Pokemon that wall it like Mega Venusaur. Due to Thundurus's Stealth Rock weakness that can make it harder for it sweep, hazard removers like Tapu Fini, Excadrill, and Hydreigon make for good teammates. Thundurus can also pair well with entry hazard setters like Ting-Lu, Mega Tyranitar, and Skarmory, which can help it to guarantee an OHKO on foes like Hydreigon and Tyranitar. In return, Thundurus can threaten out common hazard removal options like Tapu Fini and Excadrill, and it can even set up on some of them like Tapu Fini. Thundurus is very prone to getting revenge killed by faster foes like Mega Aerodactyl, Cinderace, and Choice Scarf Galarian Zapdos, so it pairs well with bulky partners like Slowbro, Tapu Fini, and Clefable.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Thundurus-Therian": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Thundurus-T functions as a powerful offensive pivot, able to capitalize off the forced switches it generates by bringing in its teammates with Volt Switch. Volt Switch threatens Flying-types like Celesteela and Galarian Zapdos while allowing Thundurus-T to pivot out of problematic matchups such as Tangrowth and Mega Altaria. Grass Knot threatens Ground-types like Hippowdon and Gastrodon. Knock Off hinders switch-ins like Clefable, Blissey, and Chansey. Psychic 2HKOes Iron Hands and would-be walls like Mega Venusaur and Amoonguss, while Focus Blast threatens Dark-types like Mega Tyranitar and Hydreigon as well as Steel-types like Excadrill. Thunderbolt better pressures Celesteela, Slowking, Mega Sableye, and Scizor while also providing Thundurus-T a STAB move that doesn't force it out. Special wallbreakers like Latios, Enamorus, and Keldeo appreciate Thundurus-T being able to threaten their switch-ins, such as Mega Tyranitar for the former and Slowking for the latter two. The aforementioned wallbreakers also benefit from Thundurus-T luring in bulkier Pokemon they can deal with, such as Amoonguss, Mega Latias, and Blissey, respectively, in addition to Knock Off's removal of Heavy-Duty Boots and Assault Vest from the likes of Skeledirge and Tangrowth. Thundurus-T is susceptible to being revenge killed by faster threats like Latios and Choice Scarf Hydreigon, so teammates that can check them such as Cinderace and Mega Altaria are appreciated. Entry hazard support from the likes of Ting-Lu and Iron Moth is also appreciated due to the forced switches Thundurus-T generates, letting it better pressure foes like Clefable; in return, it can aid its teammates by using Knock Off to remove Heavy-Duty Boots from foes such as Skeledirge and Amoonguss.</p>"
      },
      "Nasty Plot": {
        "description": "<p>With a sky-high Special Attack stat and access to Nasty Plot, Thundurus-T is a powerful wallbreaker, able to threaten special walls like Mega Tyranitar, Celesteela, and Slowking. After a Nasty Plot boost, Thundurus-T can OHKO many bulkier Pokemon in the tier, including Mega Venusaur, Magic Guard Clefable, and Mega Sableye. Focus Blast hits Dark-types like Mega Tyranitar, Hydreigon, and Ting-Lu as well as Steel-types like Excadrill. Hidden Power Ice hits Dragon-types that resist Thunderbolt like Latios, Mega Latias, and Mega Altaria, while Psychic can 2HKO Iron Hands, Amoonguss, and Mega Venusaur. Fightinium Z turns Focus Blast into All-Out Pummeling, bypassing Focus Blast's low accuracy in a pinch against threats like Tyranitar, OHKOing Hisuian Goodra and Blissey after a boost, and dealing significant damage to walls like Gastrodon and Hippowdon, potentially OHKOing them after slight chip damage. Fast special cleaners like Choice Scarf Hydreigon, Enamorus, and Speed Booster Energy Iron Moth appreciate Thundurus-T's ability to pressure their switch-ins, such as Celesteela, Slowking, and Mega Tyranitar, respectively, potentially allowing them to sweep late-game. Mega Altaria appreciates Thundurus-T's ability to check foes that threaten it, such as Scizor and Celesteela; in return, Mega Altaria can deal with Mega Latias, which outspeeds and 2HKOes Thundurus-T while avoiding a 2HKO from +2 Hidden Power Ice. Thundurus-T's middling Speed leaves it prone to being revenge killed by faster Pokemon like Latios and Mega Aerodactyl; Mega Tyranitar can switch into Latios and trap it with Pursuit, while Slowbro can deal with Mega Aerodactyl. Thundurus-T is also weak to Stealth Rock, so entry hazard removers like Tapu Fini and Hydreigon are beneficial.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Keldeo": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Keldeo is an excellent wallbreaker, utilizing its solid Speed and high Special Attack to break through many defensive Pokemon like Blissey, Jirachi, and Clefable. Hydro Pump is preferred due to its incredible power, giving Keldeo solid odds to 2HKO special walls like Celesteela and Jirachi and guaranteeing an OHKO on offensive threats like Enamorus and Thundurus-T. Alternatively, Surf can be used for its better accuracy, though it significantly hurts Keldeo's damage output against the aforementioned Pokemon. Secret Sword hits the weaker Defense of special walls like Gastrodon and Chansey while also hitting Pokemon that could pivot into Water-type attacks like Volcanion and Hisuian Goodra. Flip Turn allows Keldeo to maintain momentum and switch out of bad matchups like Slowbro and Mega Latias. Alternatively, Toxic can be used to cripple these checks instead. Hidden Power Ice is used in the final slot to hit many Pokemon that resist its STAB combination like Salamence, Latios, and Mega Altaria for super effective damage. Focus Blast can be used instead to deal massive damage to neutral targets like Rotom-W and Assault Vest Tangrowth. Choice Specs Keldeo invites in Pokemon that resist its STAB combination such as Slowking, Mega Latias, and Amoonguss. It therefore pairs well with teammates that can take advantage of these switch-ins such as Bisharp and Ceruledge for the former two and Iron Moth for the latter. Additionally, it can take advantage of Future Sight support from Slowbro or Slowking to limit the ability of Poison-types like Amoonguss and Mega Venusaur to switch in. Pursuit from Pokemon like Mega Tyranitar and Scizor is also helpful for removing Psychic-type checks to Keldeo like Slowbro and Slowking. Keldeo also appreciates entry hazard support from Pokemon like Excadrill and Ting-Lu to push checks like Tapu Fini and Mega Venusaur into range for Hydro Pump to 2HKO. Finally, Keldeo struggles against faster offensive threats like Mega Latias and thus pairs well with partners like Celesteela that can switch into these threats.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Keldeo is a threatening sweeper, thanks to its ability to break past many defensive cores. Scald is usually chosen because of its high PP and burn chance, allowing Keldeo to slowly wear down checks like Mega Venusaur while crippling physical attackers like Iron Hands, Tapu Bulu, and Salamence. Scald is especially potent in tandem with Substitute and Leftovers, as it allows Keldeo to set up on many defensive Pokemon that struggle to break its Substitute like Slowking, Celesteela, and Gastrodon lacking Earthquake while dodging status and Leech Seed. Alternatively, Hydro Pump in combination with Waterium Z allows Keldeo to blow past common answers to itself such as Mega Venusaur, Tapu Fini, and Slowbro if they are weakened. When using Hydro Pump, Taunt is used over Substitute to prevent Pokemon like Mega Venusaur and Unaware Clefable from recovering their HP, though Keldeo must be wary of moves like Giga Drain and Moonblast in return. Secret Sword hits the lower Defense of many common checks to special attackers like Blissey and Gastrodon. Calm Mind Keldeo fits best on balance and bulky offense which appreciate its ability to effectively take on defensive team styles. Keldeo is threatened out by faster offensive Pokemon that can hit it super effectively like Latios and Mega Latias if it does not have a Substitute up. Therefore, it pairs well with Pokemon that can switch into them like Celesteela and Scizor. They are also valuable for their ability to switch into checks to Keldeo like Tapu Fini and Mega Venusaur. Keldeo pairs well with entry hazard support from Pokemon like Mega Tyranitar, Skarmory, and Excadrill that can push its checks into range of a boosted Hydro Vortex.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf allows Keldeo to act as a decent revenge killer with its strong STAB moves and high Speed. Its decent natural bulk and useful typing also allow it to check Dark-types like Tyranitar and Bisharp while also giving it a Stealth Rock resistance. Hydro Pump is chosen for its high power, OHKOing Pokemon like Victini while giving Keldeo a high chance to KO Choice Scarf Enamorus and Nasty Plot Thundurus after Stealth Rock damage. Secret Sword hits the weaker Defense of common special walls like Blissey and Gastrodon. Flip Turn allows Keldeo to pivot out of bad matchups while maintaining momentum for its team. Toxic is used to status common checks to Keldeo such as Mega Altaria and Mega Latias. Hidden Power Ice can be used as an alternative to allow Keldeo to revenge kill threats such as Dragon Dance Salamence while also doing solid damage against Mega Altaria and Latios. Choice Scarf Keldeo struggles against bulkier teams, which take little damage from its attacks with Pokemon like Tapu Fini, Amoonguss, and Slowking. Therefore, it appreciates strong offensive Pokemon like Choice Band Galarian Zapdos and Z-Happy Hour Jirachi that can handle those teamstyles. Furthermore, Keldeo itself is threatened by faster Choice Scarf users like Latios and Hydreigon and therefore requires checks to these Pokemon like Celesteela. Keldeo also appreciates entry hazard setters like Excadrill and Mew that can push Pokemon like Scizor and Enamorus into Hydro Pump range.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Aera", "user_id": 572981}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Aegislash": {
    "sets": {
      "SubToxic": {
        "description": "<p>Aegislash's valuable defensive profile and immense natural bulk in Shield forme make it perfectly capable of forcing out and setting up on passive Pokemon such as Slowking, Jirachi, and Amoonguss. Substitute allows Aegislash to take advantage of the aforementioned Pokemon's inability to deal sufficient damage to it while also protecting it from potential status moves from these Pokemon; it also allows it to safely land Toxic on incoming defensive walls such as Ting-Lu and Gastrodon, stalling them out in conjunction with King's Shield and recovery from Leftovers. Shadow Ball serves as Aegislash's main STAB move, and alongside Aegislash's naturally high Special Attack stat, is useful for putting pressure onto Toxic-immune Pokemon such as Iron Moth, Excadrill, and Mega Sableye. SubToxic Aegislash fits best on bulky offense and balance teams that appreciate its ability to safely set up on and wear down defensive Pokemon while also making use of its ability to simultaneously check offensive threats such as Galarian Zapdos and Latios. Due to Aegislash's fear of status moves, like Scald burns from the likes of Slowking, as well as Spore from Amoonguss, pivots such as Flip Turn Keldeo, U-turn Iron Moth, and Teleport Blissey are helpful to ensure that Aegislash finds safe opportunities against them. Other defensive Pokemon such as Buzzwole, Skarmory, and Clefable can form notable cores with Aegislash; the former two take advantage of Dark- and Ground-types such as Mega Tyranitar and Ting-Lu, while Clefable provides additional support in staving off the likes of Latios and Buzzwole, which can potentially nail Aegislash on the switch with Mystical Fire or Earthquake, respectively. Knock Off users such as the aforementioned Clefable and Assault Vest Tangrowth are also helpful, as they can remove items from checks to Aegislash like Leftovers from Celesteela and Heavy-Duty Boots from Iron Moth and Scizor, giving it an easier time breaking through them in the long-run.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance turns Aegislash into a potent wallbreaker and sweeper, using its fantastic neutral coverage and bulk in Shield forme to set up against and break through defensive cores. Close Combat is Aegislash's strongest move overall, and it threatens the many Dark-types that would otherwise resist its Ghost-type STAB moves, like Mega Tyranitar, Hydreigon, and Ting-Lu. Iron Head is an alternative option that still OHKOes the former two after a boost while also 2HKOing Unaware Clefable. Shadow Sneak is a crucial priority move which at +2 can finish off weakened offensive Pokemon that would normally outspeed and take it out, such as Iron Moth and Keldeo, while also being usable to pick off Latios and Alakazam without a boost. Ghostium Z is usually preferred to power up STAB Shadow Claw, which, when turned into Never Ending Nightmare, threatens to KO physically defensive Pokemon such as Skarmory and Amoonguss after Swords Dance. However, Air Balloon can be run instead if the team already has a different Z-Move user, and this also allows Aegislash to find free setup opportunities against Ground-types such as Excadrill and Hippowdon, potentially spinblocking the former. Aegislash fits best on more offensive teams that appreciate its defensive utility and ability to break open holes for its teammates early-game. Other sweepers such as Dragon Dance Mega Tyranitar can benefit from Ghostium-Z variants of Aegislash forcing in and eliminating Buzzwole, Hippowdon, and Tangrowth; in return, Mega Tyranitar can help Aegislash weaken certain walls like Slowbro and Mandibuzz early-game. Aegislash also suffers from having terrible bulk in Blade forme, so it is easily revenge killed after attacking, making entry hazard support from the likes of Mew, Ting-Lu, and Mega Tyranitar helpful at chipping down offensive threats like Excadrill into Shadow Sneak range while also pressuring other walls such as Tapu Fini.</p>"
      },
      "Mixed Attacker": {
        "description": "<p>Mixed Aegislash makes the most out of its excellent offensive stats accentuated further by Spell Tag to serve as a terrifying early- or mid-game wallbreaker. Close Combat forms perfect neutral coverage with Shadow Ball, notably 2HKOing Blissey and OHKOing Mega Tyranitar after Stealth Rock. Shadow Sneak gives Aegislash additional utility in being able to pick off weakened offensive Pokemon such as Latios and Blacephalon when needed. King's Shield prevents Aegislash from being picked off by Pursuit users like Tyranitar and lets it scout Choice-locked revenge killers such as Keldeo and Hydreigon. 8 Attack EVs with a Mild nature are necessary for Aegislash to 2HKO Chansey with Close Combat after Stealth Rock. Mixed Aegislash commonly features on more offensive teams that appreciate its instant wallbreaking power combined with its utility. Stealth Rock support from Pokemon such as Mega Tyranitar can be very crucial in helping Aegislash secure 2HKOes against Pokemon such as Tapu Fini and Amoonguss on the switch. While Aegislash can find additional opportunities by pivoting directly into attackers such as Latios and Galarian Zapdos, it is often unable to preserve its HP to continue wallbreaking after doing so; as such, pivots like Cinderace are essential to let Aegislash enter the battlefield safely against Pokemon it would like to force out, such as Slowbro. Other setup Pokemon such as Nasty Plot Hydreigon can help overwhelm shared checks to this set, such as Ting-Lu; in return, Hydreigon benefit from Aegislash's ability to keep faster Pokemon like Latios and Alakazam in check.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Hawlucha": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Thanks to its good STAB combination and great ability, Hawlucha functions as a powerful Swords Dance sweeper on offense teams. Its above-average Speed also enables it to outspeed all prominent Choice Scarf users like Hydreigon, Galarian Zapdos, and Sandy Shocks after Unburden. Acrobatics pairs really well with Unburden and is Hawlucha's best move due to its power, notably helping deal with the plethora of Fighting- and Grass-types, 2HKOing Okidogi, Mega Venusaur, and Amoonguss and OHKOing Buzzwole. Close Combat hits Steel-types that resist Acrobatics like Celesteela, Skarmory, and Excadrill, as well as OHKOing Dark-types like Mega Tyranitar, Bisharp, and Hydreigon. Taunt prevents Pokemon like Mega Venusaur, Okidogi, and Mew from using recovery, setup, and status moves, while Roost lets Hawlucha set up in front of defensive Pokemon like Tangrowth, Buzzwole, and Hippowdon. Grassy Seed is used on teams with Tapu Bulu boosting its Defense, while Misty Seed is used on teams with Tapu Fini boosting its Special Defense. The first EV spread lets Hawlucha avoid an OHKO from defensive Clefable's Moonblast and should be run alongside Grassy Seed. The second EV spread is used to let it survive a Moonblast from defensive Clefable after Misty Seed is activated. 124 Speed EVs are used to outspeed Sand Rush Excadrill. Hawlucha functions as a do-or-die sweeper on offense teams. Tapu Bulu and Tapu Fini are mandatory teammates for Hawlucha, as they can allow it to immediately use up its item and active Unburden; offensive variants are perferred when using Hawlucha, helping to threaten targets like Slowbro and Mega Sableye respectively. Hawlucha can have a hard time breaking through Fairy- and Ghost-types like Tapu Fini, Mega Altaria, and Mega Sableye, as well as Skeledirge, which deserves a special mention because of its typing, ability, and good physical bulk. Hawlucha pairs well with general offensive partners like Thundurus, Celesteela, and Enamorus, which can help threaten the aforementioned foes out and can also help against generally physically bulky Pokemon like Slowbro; in return, Hawlucha can help to break Mega Venusaur, Chansey, and Blissey. Hawlucha appreciates entry hazard setters like Ting-Lu and Mega Tyranitar and notably dedicated hyper offense leads like Excadrill, which can also help keep off Stealth Rock. Entry hazard chip which can be useful to help 2HKO bulky Scizor and Mega Altaria. Hawlucha pairs well with pivots like Slowbro, Sandy Shocks, and Galarian Zapdos, which can help to bring it in against foes like Buzzwole, Amoonguss, and Skarmory.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Volcanion": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Volcanion's unique Water / Fire typing allows it to be a very threatening wallbreaker on balance and bulky offense teams with strong defensive utility, capable of checking threats such as Tapu Fini, Cinderace, Scizor, and Clefable while also pressuring the likes of Buzzwole, Skarmory, and Celesteela. Steam Eruption, in addition to being a powerful STAB option, is also very useful at spreading burns in order to weaken potential checks such as Mega Venusaur and Slowking. Sludge Bomb is used in order to break Clefable and Tapu Fini while also heavily damaging switch-ins such as Mega Latias and Hydreigon with a chance to poison them. Alternatively, Hidden Power Grass can be used in order to combat Slowbro and Gastrodon that would otherwise easily switch into Volcanion. Volcanion also offers some utility with Defog, being able to use its offensive capabilities to force out common entry hazard setters such as Mega Tyranitar, Skarmory, and Hippowdon and clear hazards as they flee. Taunt is another utility option that allows Volcanion to shut down the likes of Calm Mind Clefable and Tapu Fini more efficiently while also preventing Slowking and Slowbro from using Teleport and Slack Off. Alternatively, Volcanion can forego its utility options in exchange for Earth Power in order to target threats such as Hisuian Goodra and Iron Hands. Heavy-Duty Boots is Volcanion's main item of choice in order to avoid damage from entry hazards, but it can also run Shuca Berry on more offensive playstyles in order to lure threats attempting to use Ground-type attacks against it, such as Excadrill and Enamorus. Wallbreakers like Hydreigon and Galarian Zapdos make for a solid offensive core with Volcanion, as Volcanion can switch into and pressure their checks in Clefable and Celesteela while they handle its checks in Slowking and Mega Venusaur. Physical attackers such as Mega Aerodactyl also enjoy Volcanion's Water-type immunity, allowing it to absorb Scald from the likes of Slowbro, Tapu Fini, and Gastrodon. Volcanion is capable of pressuring a ton of offensive threats such as Mega Aerodactyl and Sandy Shocks, as they are unable to switch into it properly, but unfortunately the inverse can also be said for it, since its mediocre Speed leaves it outpaced by the aforementioned threats and others, such as Iron Moth and Latios. To mitigate this, speed control options such as Choice Scarf Hydreigon and Enamorus are vital in order to force them out more easily. In return, Volcanion can provide a switch-in to Cinderace and Tapu Fini for them while also pressuring defensive checks such as Amoonguss and Celesteela. Volcanion hates dealing with offensive Ground-types such as Excadrill and Sandy Shocks due to its inability to switch into them, so partners like Skarmory are very useful at keeping them at bay. In return, Volcanion can handle threats that would try to take advantage of Skarmory such as Aegislash and Tapu Fini. Electric-types such as Iron Hands, Thundurus, and Zeraora are also incredibly annoying for Volcanion, so partners such as Gastrodon, Mega Latias, Mega Venusaur, and Tangrowth are good at handling them. In return, Volcanion can pressure threats such as Amoonguss and Celesteela for them. Although Volcanion can beat Rock-types in theory, Tyranitar, Mega Tyranitar, and Mega Aerodactyl can pressure it really easily if on the field. Partners such as Iron Hands and Scizor are great at forcing them out, and in return, Volcanion can deal with Iron Defense Skarmory and Amoonguss for them. Dragon-type wallbreakers such as Hydreigon and Salamence can also take advantage of Volcanion by merit of resisting both its STAB moves. Partners such as Celesteela, Clefable, and Mega Tyranitar can effectively force them out for Hydreigon.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Runo", "user_id": 568189}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Tapu Fini": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Tapu Fini's solid typing, good bulk, and vast utility make it an excellent defensive presence in the metagame, holding the tier together against numerous Pokemon, such as Latios, Mega Tyranitar, and Keldeo. Misty Surge makes it excellent at regaining momentum against status users, such as Clefable and Blissey, allowing setup teammates like Mega Tyranitar to more freely set up against these Pokemon. Scald provides Tapu Fini with a STAB move that can burn the likes of Celesteela and Tapu Bulu attempting to take advantage of it while also letting it apply pressure to targets such as Iron Moth and Victini. Alternatively, Nature's Madness allows Tapu Fini to hit defensive Pokemon it would otherwise be unable to punish for switching in, Mega Venusaur and Amoonguss. Defog keeps entry hazards off against walls that its typing enables it to match up well against, like Skarmory. Taunt, besides preventing the aforementioned Pokemon from relaying hazards in front of Tapu Fini, also denies healing and setup attempts from Pokemon like Clefable and Blissey, particularly when used in combination with Nature's Madness to more quickly wear down said targets. 96 Speed EVs ensure that Tapu Fini outruns Adamant Scizor, letting it shut down potential Swords Dance attempts against it, while the rest is put into Defense to maximize its walling capabilities against Pokemon such as Buzzwole, Psyshock Latios, and Excadrill. Defog Tapu Fini fits onto many bulky offense and balance teams for its valuable role compression. Tapu Fini is prone to being overwhelmed and lacks any form of healing outside of Leftovers, which makes other defensive Pokemon that can support it against the aforementioned threats extremely valuable; these include Pokemon such as Skarmory and Assault Vest Tangrowth. Wish users such as Jirachi and Blissey are also highly noticeable in this regard for their ability to keep Tapu Fini healthy throughout the game in addition to synergizing with it immensely by handling special attackers that can threaten Tapu Fini, such as Alakazam. Other defensive Pokemon like Buzzwole and Mega Aggron benefit from Tapu Fini's ability to clear hazards, allowing them to more safely leverage their HP to check the threats they are meant to deal with. Finally, powerful offensive Pokemon that appreciate Misty Terrain's effects, like Bisharp and Choice Band Tyranitar, also enjoy being able to fall back on Tapu Fini to deal with offensive threats like Keldeo and clear hazards, improving their potential to wallbreak throughout the game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Tapu Fini can outspeed and revenge kill common offensive Pokemon such as Latios and Cinderace. Additionally, Tapu Fini can still uphold its natural defensive qualities and bulk to switch into other threats like Cinderace and Latios when needed, before outspeeding and threatening them too, while also providing Defog support. Hydro Pump is Tapu Fini's strongest move to hit Iron Moth and Excadrill with, OHKOing both after Stealth Rock damage, but Surf can be used instead if accuracy is a concern despite having less power. Trick allows Tapu Fini to cripple an incoming wall that would normally try to take advantage of it, like Blissey and Amoonguss. Defog allows Tapu Fini to clear entry hazards for its team in a pinch, especially once it has Tricked away its Choice Scarf, but if Defog is already found on another Pokemon, Taunt and Nature's Madness are options that can be used instead to further mess with most defensive Pokemon, chipping them down quickly or denying healing attempts. The given EV spread ensures that Tapu Fini survives a +2 Acrobatics from Hawlucha and outspeeds Mega Aerodactyl. Tapu Fini fits best on offensive teams that appreciate its defensive utility and role compression. Wallbreakers that benefit from its ability to check faster offensive threats like Keldeo and Galarian Zapdos include Pokemon such as Choice Band Tyranitar and Mega Heracross, with each additionally benefiting from Misty Terrain's status immunity. On the other hand, Tapu Fini's tendency to lure in defensive Pokemon that it can Trick its Choice Scarf over to, like Blissey and Chansey, can be exploited by Pokemon that normally struggle to break past them, such as Iron Moth and Nasty Plot Hydreigon. As Tapu Fini can struggle to check threats like Latios and Victini in the long run, other Pokemon like Celesteela and Galarian Moltres can help provide extra insurance against these Pokemon.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Tapu Fini's combination of high bulk and Taunt allows it to set up on numerous defensive staples such as Buzzwole, Clefable, and Blissey, making it very adept at punishing the use of common walls and tanks. While Scald cannot burn grounded foes while Misty Terrain is active, it can still annoy and cripple certain foes like Enamorus and Celesteela. While weak, Draining Kiss provides a massive amount of recovery to Tapu Fini, letting it remain healthy as it sweeps through opposing teams. The given EV spread provides enough Special Attack for Tapu Fini to OHKO Excadrill with +1 Scald and lets it outspeed Adamant Bisharp, with the rest maximizing its physical bulk. Tapu Fini best fits on bulky offense and balance teams that want an end-game wincon, supporting wallbreaking teammates such as Iron Hands and Mega Tyranitar. It's overwhelmed by fast offensive foes that can hit it super effectively such as Thundurus-T and Iron Moth. Teammates like Mega Venusaur can check Thundurus-T while Iron Moth checks opposing Iron Moth. Mega Venusaur is another troublesome matchup, and it can be threatened by teammates such as Mega Latias and Latios.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}, {"username": "Pubo", "user_id": 535121}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Buzzwole": {
    "sets": {
      "Defensive": {
        "description": "<p>Buzzwole is a strong tank with the ability to check many of the physical attackers in the tier such as Tyranitar, Excadrill, and Bisharp. Buzzwole sets itself apart from other physical walls with its high Attack stat and strong moves, allowing it to exert immediate pressure against the opposing team. Close Combat is Buzzwole's STAB move of choice, as its high Base Power is preferred over alternatives like Drain Punch against threats such as Scizor and Iron Hands. Earthquake is a solid coverage move that allows Buzzwole to threaten Iron Moth and Ceruledge, which would otherwise be able to switch in for free. The final moveslot offers a bit more flexibility, with Toxic being used the most in order to status common switch-ins such as Latios, Hippowdon, and Tangrowth. Alternatively, Thunder Punch can be utilized for more immediate pressure against Water- and Flying-types such as Tapu Fini and Enamorus. Finally, Bulk Up can be used on defensive teams to allow Buzzwole to act as a wincon. The Defense boosts can also help in one-on-one situations against other Attack-boosting threats such as Iron Hands. The Attack EVs ensure Buzzwole 2HKOs defensive Celesteela with Close Combat after Stealth Rock damage, while 112 Speed EVs allow Buzzwole to outspeed Adamant Tyranitar. This Speed benchmark is largely trivial, however, and can be adjusted to account for other specific threats such as Bisharp and Scizor. Buzzwole’s ability to switch into Ground- and Fighting-type moves is valued by Pokemon such as Excadrill and Tyranitar, and its resistance to Bug and Dark is greatly appreciated by Psychic-types such as Mega Latias and Slowking. Due to its poor special bulk, Buzzwole can quickly be overwhelmed by strong special attackers and Future Sight. Therefore, it appreciates specially defensive teammates such as Blissey and Hippowdon. Physical wallbreakers are often paired with Future Sight support; therefore, Pokemon such as Celesteela and Mega Aggron can prove helpful because of their high Defense paired with a Psychic resistance. Pokemon that can cover Buzzwole's weaknesses to Flying, Fairy, Fire, and Psychic are also greatly appreciated. As such, Mega Latias, Clefable, and Tyranitar are natural partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Aera", "user_id": 572981}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Dead by Daylight", "user_id": 571069}, {"username": "red fintans", "user_id": 637479}]}]}
  },
  "Celesteela": {
    "sets": {
      "Autotomize Sweeper": {
        "description": "<p>Celesteela's high Special Attack, good movepool, and snowballing potential with Beast Boost make it a great sweeper when using Autotomize to shore up its poor Speed. Its naturally great bulk and Steel/Flying typing afford it setup opportunities against foes like Scizor and Excadrill, as well as the ability to easily muscle past them. Meteor Beam combined with Power Herb lets Celesteela boost its Special Attack without needing a KO. Given that it's Celesteela's strongest attack, in some situations it should be saved to instead target a foe Celesteela would otherwise have trouble breaking through like Skeledirge or Victini. Air Slash serves as a spammable STAB attack, 2HKOing most of the tier at +1, though it can OHKO many Bug- and Grass-types like Buzzwole and Hisuian Lilligant unboosted. Its chance to flinch its foes can also come in handy against special walls like Gastrodon and Slowking, which could otherwise stop Celesteela's sweep. Fire Blast primarily targets Steel-types, OHKOing foes like Scizor unboosted and opposing Celesteela after a few boosts. Celesteela best fits on offense teams looking for a cleaner, forming a potent offensive combination with other sweepers like Iron Hands and Bisharp. Alternatively, if the opportunity arises, it can instead be used as a mid-game wallbreaker and have a teammate clean using the holes it creates. However, it has no way to break through certain special walls like Blissey and Chansey on its own, making physical attackers like Bisharp and Iron Hands necessary. While they share some overlapping counterplay, special sweepers like Booster Energy Iron Moth and Galarian Moltres also appreciate Celesteela's support for similar reasons, and they can still support each other by weakening some of each other's shared checks, such as Slowbro, Slowking, Latios, and Latias. Entry hazard setters like Lead Mew and Excadrill are crucial for their ability to weaken Celesteela's checks, making it harder for foes like Gastrodon and Tapu Fini to remain healthy enough to check Celesteela.</p>"
      },
      "Defensive": {
        "description": "<p>Celesteela is a strong defensive staple on balance teams, owing mainly to its fantastic mixed bulk and great type combination, which allow it to check threats such as Excadrill, Clefable, Mega Latias, and Enamorus. Leech Seed is Celesteela’s most defining move, as it is its main way of healing itself and allows it to force progress against would be switch-ins such as Cinderace, Iron Moth, and Blissey while also discouraging threats such as Mega Latias from setting up against it. Heavy Slam is another vital move that allows Celesteela to pressure threats such as Mega Tyranitar, Clefable, and Enamorus. Protect is good when used with Leech Seed to further wear down threats such as Excadrill and Enamorus without Substitute while also letting it scout Choice-locked foes such as Latios and Victini. Toxic can be used over Protect on more offensive teams to make faster progress against threats such as Mega Latias, Mega Tyranitar, Hydreigon, and Galarian Moltres and also wear down bulky Water-types such as Slowbro and Gastrodon. Flamethrower is an important coverage move to tackle Steel- and Grass-types such as Excadrill, Skarmory, Tangrowth, and Amoonguss. Leftovers synergizes very well with Leech Seed and Protect to recover large swaths of HP. Celesteela struggles a lot against Fire-types such as Cinderace, Iron Moth, and Victini, so bulky Fire-resistant teammates such as Slowking, Mega Latias, and Mega Tyranitar are greatly appreciated to keep them at bay. Mega Tyranitar in particular is capable of Pursuit trapping Fire-types to deal with them. Electric-types such as Sandy Shocks and both Thundurus formes also annoy Celesteela greatly with Volt Switch, so Ground-types such as Hippowdon and Gastrodon are important for halting their pivoting, and in return Celesteela can deal with Grass-types such as Tapu Bulu for them. Grass-types such as Tangrowth and Amoonguss are good at handling Water-types that annoy Celesteela such as Slowbro and Tapu Fini while also being secondary checks to Electric-types. Dangerous physical attackers such as Galarian Zapdos and Swords Dance Scizor can easily overwhelm Celesteela, so physical walls such as Slowbro, Buzzwole, and Mega Altaria make for great partners to help deal with them. In return, Celesteela can help cover them against Fairy-types such as Clefable and Enamorus while also providing them with extra longevity via Leech Seed support.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Runo", "user_id": 568189}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}, {"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Zeraora": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>A blistering Speed tier, above-average offenses, and potent offensive typing make Zeraora an effective pivot and revenge killer in the tier, threatening important targets in Cinderace, Latios, Enamorus, and Alakazam. Additionally, Zeraora packs significant utility options in Knock Off and Volt Switch that can capitalize on the aforementioned traits and even allow it to make long-term progress against a majority of defensive targets, such as Ting-Lu and Rotom-W. Toxic is usually Zeraora's preferred move in the last slot, allowing it to stifle specific Pokemon that are otherwise able to heal off and withstand its attacks, such as Mega Latias, Hippowdon, and Iron Hands. Alternatively, Zeraora can also make use of Close Combat to pose an immediate threat to most Steel- and Dark-type Pokemon, such as Excadrill, Hydreigon, and Mega Tyranitar, the latter of which it can also outspeed after a Dragon Dance, making it one of the few revenge killers able to remove it from full without the need for a Choice Scarf. On the other hand, Grass Knot is an alternative that puts immediate pressure on Hippowdon and Quagsire, though it becomes more difficult for Zeraora to break through several of the aforementioned targets in Mega Latias, Hydreigon, and Excadrill. Heavy-Duty Boots ensures Zeraora isn't hampered by entry hazards. Zeraora fits best on bulkier teams that appreciate its proficiency in revenge killing offensive threats while possessing added longevity and the ability to generate momentum. Defensive staples such as Ting-Lu, Slowking, and Amoonguss appreciate Zeraora's ability to force out Pokemon that may threaten them, including the likes of Cinderace, as well as Galarian Zapdos lacking Choice Scarf. In return, Ting-Lu can provide entry hazard support to bolster the effects of Zeraora's pivoting capabilities and Knock Off, whereas Slowking can use Future Sight to pressure Pokemon that would otherwise be able to stave off Zeraora's attacks, such as Buzzwole and Mega Venusaur. Similarly, slower wallbreakers like Choice Specs Enamorus, Nasty Plot Hydreigon, and Choice Band Tyranitar appreciate Zeraora's ability to scare out faster Pokemon while also benefitting from the safe switch-in opportunities provided by Volt Switch. While Zeraora's offensive matchups are impressive, it can struggle to contain many offensive threats that are capable of boosting their Speed, such as Sand Rush Excadrill, Dragon Dance Salamence, and Autotomize Celesteela. Thus, specific defensive checks to these Pokemon such as defensive Celesteela, Slowbro, and Thunder Wave Clefable are highly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "StupidFlandrs48", "user_id": 633500}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Cinderace": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>With its high Attack and Speed stats, good coverage moves, and inability to be worn down by entry hazards thanks to Heavy-Duty Boots, Cinderace is a versatile pivot that is able to outspeed and offensively respond to various threats such as Latios and Clefable. Pyro Ball is Cinderace's main STAB move, allowing it to hit Steel-types such as Celesteela and Excadrill while also dealing significant damage to other defensive Pokemon such as Buzzwole and Amoonguss; it notably preserves Libero's type-changing ability in the process. U-turn, besides allowing Cinderace to maintain momentum by bringing in a teammate like Hydreigon, can also wear down defensive Pokemon such as Slowbro. Gunk Shot gives Cinderace useful coverage for Pokemon such as Tapu Fini and Mega Altaria, and it also lets Cinderace force out Calm Mind Clefable more reliably. Alternatively, High Jump Kick is an option to OHKO Mega Tyranitar and Hydreigon, which U-turn cannot do. Sucker Punch lets Cinderace revenge kill chipped sweepers such as Agility Iron Moth and Z-Celebrate variants of Victini after their respective boosts while also threatening Choice Scarf users such as Blacephalon. Cinderace fits best on offensive teams that can supply it with the tools needed to break through defensive Pokemon; entry hazard setters such as Mega Tyranitar and Excadrill can support Cinderace in this manner, with Mega Tyranitar also being able to trap Slowbro and Skeledirge with Pursuit after Cinderace pivots against them. Similarly, defensive Pokemon such as Celesteela, Slowbro, and Tapu Fini appreciate Cinderace's ability to threaten out the likes of Amoonguss and Scizor; in return, they can help sponge the Water- and Ground-type moves aimed at Cinderace or provide Future Sight or Taunt support in the case of the latter two. Powerful wallbreakers such as Latios and Gengar also appreciate the safe entry Cinderace can facilitate against most physically defensive Pokemon it commonly invites in on top of Cinderace being able to force out the Steel-types that would otherwise threaten them, like Scizor.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance turns Cinderace into a threatening wallbreaker, using its immense power to break through most defensive Pokemon that would otherwise switch into it comfortably. At +2, Breakneck Blitz manages to OHKO the likes of Slowbro after Libero. High Jump Kick is a necessary coverage option to let Cinderace reliably KO Mega Tyranitar. Cinderace fits best on hyper offense teams that benefit from its ability to break open defensive cores; as Cinderace is often revenge killed by faster Pokemon such as Sand Rush Excadrill and Choice Scarf Latias, other Pokemon that can take advantage of these revenge killers like Galarian Moltres, Swords Dance Scizor, and Bulk Up Galarian Zapdos become valuable teammates, as they also appreciate Cinderace's innate ability to threaten common walls such as Buzzwole and Skarmory. Cinderace also appreciates anti-entry hazard options such as Excadrill and Tapu Fini, which can help alleviate Cinderace's crippling Stealth Rock weakness.</p>"
      },
      "Bulky Pivot": {
        "description": "<p>Thanks to its good Speed, outspeeding foes like Thundurus and Enamorus, good Attack, and valuable utility like Court Change, which can be helpful for entry hazard-weak teammates, Cinderace is a good bulky pivot that can help bring in its teammates safely against faster foes. Pyro Ball deals with Steel- and Grass-types, 2HKOing defensive Celesteela, Skarmory, Tangrowth, and Amoonguss; it is also Cinderace's best move, due to its general usability, power, ablilty to OHKO targets like Enamorus, Mega Heracross, and Thundurus-T when boosted by Blaze. Will-O-Wisp can cripple physical attackers, notably setup Pokemon such as Iron Hands, Hawlucha, and Okidogi. This given EV spread allows Cinderace to be as bulky as possible, letting it survive an Earthquake from Salamence, while still outspeeding Latios and being able able to OHKO Enamorus after Stealth Rock chip damage. Cinderace can pair well with other pivots like Rotom-W, Thundurus-T, and Galarian Zapdos, forming a VoltTurn core, being able to pivot each other in to threaten Pokemon that can check each other. Offensive Pokemon like Iron Moth and Galarian Zapdos can be good teammates for Cinderace, being able to threaten its common checks like Tapu Fini, Slowbro, and other Water-types, which generally wall it. In return, Cinderace can keep off hazards, helping them not get chipped, and pivot them in against faster targets like Choice Scarf Keldeo safely. Cinderace can be threatened out by targets like Keldeo, Volcanion, and Sandy Shocks, due to their typing and super effective moves, making it appreciate teammates that can offer a backbone against them like Mega Latias, Latios, and Blissey. Skeledirge is also another Pokemon that can wall Cinderace, forcing it out and using it as an opportunity to setup, making Cinderace pair well with partners like Keldeo, Hydreigon, and Sandy Shocks, which can threaten it. Even though Cinderace can help to keep off hazards, it can still appreciate secondary hazard removers like Tapu Fini and Excadrill.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}, {"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Sulo", "user_id": 528036}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Enamorus": {
    "sets": {
      "Calm Mind Sweeper": {
        "description": "<p>Enamorus is a potent sweeper, capable of beating common defensive staples in Skarmory, Mega Sableye, and Clefable. Its expansive coverage in Earth Power and Mystical Fire allows it to hit every Steel-type in the tier, such as Celesteela, Skarmory, and Scizor, for super effective damage, securing either an OHKO or a 2HKO on them with a Calm Mind boost. It also allows Enamorus to work around other Fairy-resistant foes such as Skeledirge and Iron Moth as well as offensive checks in Hisuian Arcanine and Victini, while its Speed tier allows it to outspeed and OHKO Nihilego. Taunt is an option to potentially beat and deny recovery from status users like Clefable, Hippowdon, and Chansey that try to slow down or stall Enamorus. Similarly, Iron Moth enjoys many of its checks being removed, particularly Mega Tyranitar and Latias. However, Enamorus's frailty and lack of immediate power makes it difficult for it to break past checks such as Mega Venusaur and Celesteela, which threaten to OHKO it with Sludge Bomb and Heavy Slam, respectively, and aren't OHKOed after a Calm Mind boost. Similarly, Chansey can use Toxic and Seismic Toss to take advantage of Enamorus's lack of longevity. This means it appreciates partners such as Tyranitar and Bisharp, which are capable of Pursuit trapping special walls like Chansey, as well as Cinderace, which can break past Celesteela as well as provide pivoting to bring Enamorus in safely. Its Speed tier also means it is pressured by faster threats such as Iron Moth and Latios. This means it enjoys speed control from partners such as Cinderace and Choice Scarf Hydreigon, which are able to outspeed its offensive checks. To compensate for its relative frailty, it also enjoys slow pivots to bring it in safely, such as Slowbro, Slowking, and Scizor, and in return it provides an offensive check to the Dark-types they are threatened by, such as Mega Tyranitar, Bisharp, and Hydreigon.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs allows Enamorus to be more immediately fearsome against bulky teams, now threatening 2HKOs on most Fairy-resistant foes without the need for a turn of setup. In addition to Earth Power and Mystical Fire, Superpower allows it to threaten a 3HKO on Chansey. This also allows Enamorus to potentially snowball through weakened teams once faster foes like Cinderace have been removed. Alternatively, Psychic hits Poison-types that aren't weak to Earth Power, such as Mega Venusaur and Amoonguss. In addition to Pursuit trappers like Mega Tyranitar, speed control from the likes of Cinderace, and slow pivots like Slowbro, Choice Specs Enamorus functions as an excellent partner to special sweepers such as Iron Moth, Keldeo, and Blacephalon due to its ability to remove checks to it without competing for the same team slot. These options can also be used to remove Steel- and Poison-types to allow Enamorus to use its powerful Moonblast more freely. As Enamorus is weak to Stealth Rock, it appreciates being partnered with strong entry hazard removal options, such as Rapid Spin Excadrill, Defog Salamence, Defog Tapu Fini, and Court Change Cinderace, which allow it to more easily work around opposing entry hazard setters such as Hippowdon and suicide leads like Excadrill. Due to its Choice Specs, however, Enamorus becomes prediction-reliant against teams that stack multiple Fairy-resistant foes, so Stealth Rock and Knock Off support from Clefable, Tyranitar, and Scizor allows it to more effectively break down its checks over the course of a game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>With Choice Scarf, its high Special Attack, and the utility of Healing Wish, Enamorus is an effective form of speed control that can also sweep or facilitate another partner's sweep late-game. Earth Power targets Steel-types like Excadrill and Aegislash, Fire-types like Victini, Cinderace, and Iron Moth, and it's also Enamorus's strongest attack against Mega Venusaur. Mystical Fire hits specific Steel-types that don't mind Earth Power, namely Skarmory, Scizor, and Celesteela; its Special Attack-lowering effect also provides some utility against Autotomize variants of the latter. Alternatively, Grass Knot can 2HKO Ground-types like Hippowdon and Gastrodon. Finally, Focus Blast serves as a middle ground option against Steel-types like Excadrill and Skarmory while also OHKOing the Tyranitar formes, though its shaky accuracy combined with Enamorus's frailty makes it risky to use. Enamorus best fits on offense teams looking for a form of speed control that can revenge kill fast threats such as Cinderace. Due to its weakness to Stealth Rock, entry hazard removers such as Excadrill and Tapu Fini are essential teammates. Due to Enamorus's low bulk, pivots such as Cinderace can help it safely get onto the field. Enamorus also appreciates the defensive backbone provided by bulky partners such as Amoonguss, Tangrowth, and Skamory; Pokemon that resist Steel like the latter are important as checks to Scizor and Sand Rush Excadrill. Enamorus lacks the power to OHKO certain foes like Victini and Thundurus-T from full health, while they can often cripple or OHKO it back, making hazard setters like Excadrill and Mew good partners as they can chip these foes into KO range. Enamorus struggles to get past certain Poison-types like Mega Venusaur, making checks to them like Choice Specs Latios useful. Enamorus also has no way of getting past Blissey and Chansey, making physical wallbreakers such as Buzzwole necessary teammates. Healing Wish is best used to either give a sweeper like Dragon Dance Tyranitar or Celesteela a second opportunity to sweep, or a bulky wallbreaker like Iron Hands or Scizor the health needed to continue breaking holes into the opposing team.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "TBIC106", "user_id": 585020}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}, {"username": "Runo", "user_id": 568189}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "red fintans", "user_id": 637479}, {"username": "Milak", "user_id": 262594}]}]}
  },
  "Ceruledge": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ceruledge's fearsome STAB combination and access to Swords Dance make it a great sweeper and wallbreaker in NatDex UU. At +2, Bitter Blade and Poltergeist cleave through common defensive staples like Celesteela, Clefable, and Slowbro; the former's healing also makes Ceruledge much harder to KO with residual damage like sand and Toxic as well as some neutral hits such as Iron Hands's Thunder Punch. Shadow Sneak lets Ceruledge take out faster foes that are chipped such as Enamorus and Galarian Zapdos, and at +2 it can even OHKO some Ghost-weak foes like Latios. Close Combat is an alternative, primarily used to OHKO Tyranitar and its Mega forme as well as 2HKO Hydreigon, which resist Ceruledge's STAB attacks. It is also Ceruledge's strongest option against Normal-types, 2HKOing Blissey and Chansey. Weak Armor allows Ceruledge to boost its Speed by taking advantage of physical attackers that can't OHKO it like Iron Hands and Cinderace. Air Balloon allows Ceruledge to soft check foes that rely on Ground-type moves to threaten it like Buzzwole, Excadrill, and Enamorus; against physical attackers, Air Balloon can force them to use a weak attack to pop it granting, Ceruledge a Weak Armor boost. Focus Sash is an alternative, guaranteeing Ceruledge at least one turn of setup and, against physical attackers, one Weak Armor boost. Ghostium Z is another option that provides Ceruledge the power to OHKO Pokemon it otherwise can't, such as Tapu Fini and Iron Hands at +2; it also lets Ceruledge use a powerful Ghost-type move against targets that lack an item, which is situationally useful against certain foes like itemless Slowbro and Booster Energy Iron Moth because Poltergeist does not work on them. Ceruledge fits best on hyper offense teams, which can stack offensive teammates like Iron Hands, Iron Moth, and Thundurus-T to weaken each other's checks. Ceruledge struggles against bulky Water-types like Tapu Fini and is notably stonewalled by the rare Quagsire, making Grass-types like Tapu Bulu and certain sweepers like Z-Dragon Dance Salamence and Iron Moth natural partners. Ceruledge dislikes Stealth Rock, especially if it's holding Focus Sash, so it enjoys the support of teammates that can remove entry hazards like Excadrill.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "red fintans", "user_id": 637479}]}]}
  },
  "Sandy Shocks": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Sandy Shocks is a valuable form of speed control, outspeeding and revenge killing promient Pokemon like Mega Aerodactyl, Cinderace, and Alakazam, as well as being a great offensive pivot thanks to its high Special Attack and threatening movepool. Thunderbolt is notably effective at targeting the tier's plethora of Water- and Flying-types, OHKOing Galarian Zapdos and Mega Aerodactyl after Stealth Rock and 2HKOing Tapu Fini, Slowbro, and Galarian Moltres. Earth Power targets Rock-, Steel, and Fire-types, OHKOing the likes of Iron Moth and Excadrill while dealing significant damage to foes like Mega Tyranitar. Spikes can be used to chip down foes, though it forces Sandy Shocks out after using it, making it risky against setup sweepers. Alternatively, Power Gem deals super effective damage to Thundurus and Thundurus-T and chips Hydreigon. Sandy Shocks can pair excellently with other entry hazard setters like Ting-Lu, Mega Tyranitar, and Skarmory, as they help it guarantee a 2HKO on foes such as defensive Celesteela after Stealth Rock chip, and they can also wear down checks like Tapu Bulu and Hippowdon for it. In return, Sandy Shocks can spread hazards alongside them while also threatening removal options like Tapu Fini and Excadrill. Offensive pivots such as Cinderace and Galarian Zapdos form a VoltTurn core with Sandy Shocks, being able to pivot each other in to threaten Pokemon that can wall it like Mega Latias, Mega Venusaur, and Blissey. Sandy Shocks's average defenses make it appreciate having bulky teammates like Skarmory, Tapu Fini, and Teleport Blissey that can pivot into foes like Tapu Bulu, Hydreigon, and Mega Latias, and they can offer a backbone to it whenever it locks itself into Spikes.</p>"
      },
      "Offensive Hazard Setter": {}
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Iron Hands": {
    "sets": {
      "Swords Dance": {
        "description": "<p>On account of its enormous stats, offensive typing, and diverse attacking options in conjunction with Swords Dance, Iron Hands makes for a powerful offensive tank on a variety of teams. At high HP, it is bulky enough to survive attacks from faster revenge killers such as Excadrill, Latios, and Psychic Thundurus-T while also being able to trade with defensive Pokemon such as Hippowdon, Magic Guard Clefable, and Gastrodon after a boost. Added onto this, Iron Hands's resistances can also allow it to check physical threats such as both Tyranitar formes and Bisharp when needed. Thunder Punch is normally used for its consistency, but Wild Charge is an alternative with a higher Base Power, most notably improving damage rolls against threats such as Ceruledge and Choice Scarf Tapu Fini unboosted while also allowing it to power through defensive stalwarts such as Mega Sableye more easily at +2, albeit at the cost of recoil. Drain Punch, aside from being a consistent secondary STAB option, also provides recovery against Pokemon that Iron Hands may stay in against, such as Tyranitar and Gastrodon, and avoids dropping Iron Hands's defenses for dealing with subsequent attacks. Alternatively, Close Combat provides a stronger option that has a chance of breaking through specific defensive Pokemon, such as 2HKOing Quagsire after slight chip damage. Ice Punch provides Iron Hands with coverage against targets that would otherwise resist its attacking combination, such as Mega Latias, Thundurus-T, and Amoonguss, while Earthquake can be used to 2HKO Skeledirge, in addition to OHKOing most opposing Iron Hands at +2. Substitute, despite the opportunity cost, is an interesting option that can allow Iron Hands to avoid status from Pokemon otherwise reliant on doing so to cripple it, like Mega Sableye and Gastrodon. The given EVs specifically allow Iron Hands to OHKO Slowbro at +2 with a Punching Glove-boosted Thunder Punch while outspeeding uninvested Clefable, with the rest of the EVs allocated into Special Defense to improve its ability to take special hits from attackers like Iron Moth, Clefable, and Thundurus-T. When using Leftovers, a minimum of 16 Attack EVs with an Adamant nature should be used instead to guarantee an OHKO on Excadrill with Drain Punch. Iron Hands pairs remarkably well with frailer offensive teammates that can take advantage of the gaping holes it can threaten to leave early on; chief among these are fast late-game cleaners such as Autotomize Celesteela, Booster Energy Iron Moth, and Swords Dance Ceruledge, which each appreciate Iron Hands's ability to weaken teams filled with bulky Pokemon such as Gastrodon, Hippowdon lacking Whirlwind, and Mega Tyranitar. In return, these Pokemon can also deal with several of the faster Pokemon used to force out Iron Hands, like Latios and Enamorus, allowing it to preserve its bulk into more useful situations. Similarly, Iron Hands can struggle to preserve its HP when subjected to chip damage overtime, like Spikes from Skarmory. Thus, Pokemon that can prevent or clear entry hazards, such as Tapu Fini and Excadrill are incredibly valuable to have as teammates—Tapu Fini's Misty Terrain support also helps shield Iron Hands from potential status elements. Other pivots such as Cinderace and Slowbro are similarly effective at allowing Iron Hands to have safe switch-in opportunities into Pokemon that it can force out, such as Tyranitar. Slowbro can also utilize Future Sight to compensate for Iron Hands's difficulties getting past faster physical walls, such as Buzzwole and Mega Venusaur.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Iron Hands makes the most of its colorful coverage options to be an effective wallbreaker. Ice Punch cleanly OHKOes Salamence, preventing it from chipping Iron Hands down via Wild Charge recoil and Roost, while also dealing significant damage to other Dragon-types like Latios, Latias, and Mega Altaria. Earthquake severely dents Skeledirge and OHKOes Victini. Alternatively, Heavy Slam can be used to OHKO physically defensive Clefable, preventing it from being able to safely scout Iron Hands. The given EV spread maximizes Iron Hands’s wallbreaking power while allowing it to outrun uninvested Skarmory. Choice Band Iron Hands fits best on bulkier teams that need a strong wallbreaker against defensive cores while also providing residual defensive utility in being able to slow down specific wallbreakers on more offensively-oriented teams, such as Galarian Zapdos and Bisharp, when necessary. Bulky teammates commonly featured on these teams, such as Skarmory, Slowking, and Amoonguss, each appreciate Iron Hands's ability to directly threaten several Pokemon used to take advantage of them, such as Celesteela and Mega Tyranitar. Slowking is also able to use Future Sight to dissuade the likes of Buzzwole and Mega Venusaur for Iron Hands. As Iron Hands lacks the longevity to batter away at and trade with defensive Pokemon such as Amoonguss and Tangrowth and is somewhat prediction-reliant, entry hazard support from the likes of Hippowdon, Jirachi, and Iron Moth can help Iron Hands in breaking through these Pokemon more effectively. More offensive teammates such as Latios and Mega Aerodactyl can be similarly effective in providing additional forms of offensive pressure to punish these Pokemon. Iron Hands's lack of defensive investment also makes it more vulnerable to revenge killers such as Enamorus, Latios, and Excadrill, and it can also struggle to check the likes of Scizor long-term, particularly fearing the loss of its item in the process. Thus, specific answers to these respective Pokemon, such as Cinderace, Celesteela, and Mandibuzz, are highly useful to help keep them in check offensively.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "Runo", "user_id": 568189}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Iron Moth": {
    "sets": {
      "Agility + Booster Energy": {
        "description": "<p>With the Speed boost from Agility and Special Attack Boost from Booster Energy, Iron Moth can effectively serve the role of a cleaner. Fiery Dance and Sludge Wave serve as spammable STAB attacks that hit the majority of the tier for neutral damage; the former has the potential to snowball through teams, thanks to its chance to raise the user's Special Attack further. Energy Ball primarily targets Ground-, Rock-, and Water-types like Hippowdon, Mega Tyranitar, and Slowking. Due to the all-or-nothing nature of this set, Iron Moth best fits on offense teams looking for a cleaner. It struggles against Ground-, Rock- and Water-types, so Grass- and Water-types like Mega Venusaur and Calm Mind Tapu Fini make good partners, as they can handle these threats. Physical wallbreakers like Iron Hands and Buzzwole are also important, as Iron Moth has no way to get past Blissey and Chansey. Skeledirge also walls Iron Moth thanks to their typings and bulk, so Ghost- and Dark-types, and notably Pursuit users like Mega Tyranitar, can eliminate them for it. Iron Moth despises losing 25% of its health to Stealth Rock when switching in, so partners that can remove them, like Excadrill and Tapu Fini, are much appreciated. Stealth Rock support is greatly appreciated, as it can push certain targets like Choice Band Tyranitar outside of Sandstorm and Hydreigon into KO range.</p>"
      },
      "Offensive": {
        "description": "<p>Offensive Iron Moth leverages its high number of resistances and good power to act as a dangerous offensive threat with Heavy-Duty Boots. Fire Blast serves as a powerful STAB move that threatens every neutral target that doesn't have immense special bulk. Fiery Dance is an alternative; it's notably weaker, missing out on the OHKO on Autotomize Celesteela and 2HKO on Iron Hands. However, in exchange, it has perfect accuracy, more PP, and its ability to boost Iron Moth's Special Attack can let it sweep late-game. Sludge Wave is Iron Moth's other STAB attack; besides hitting opposing Dragon- and Fire-types for neutral damage, it also breaks through Fairy-types like Clefable and Tapu Fini. Due to the amount of Pokemon it threatens out, such as Aegislash and Mega Sableye, Iron Moth is an effective setter of Toxic Spikes; Energy Ball is an alternative, serving as coverage against opposing Ground-, Rock-, and Water-types, like Gastrodon and Tyranitar, and finally, U-turn is another alternative, as the switches Iron Moth forces out let it act as an effective offensive pivot. Morning Sun gives Iron Moth reliable recovery, letting it avoid getting worn down by repeated attacks and Stealth Rock if its Heavy-Duty Boots are removed. Iron Moth best fits on balance and offensive teams looking for a fast and powerful special attacker with good utility. While Iron Moth can check most special attackers, even resisted hits from physical attackers like Cinderace can 2HKO it. Thus, physical walls and tanks like Buzzwole and Slowbro can check these foes for Iron Moth. Pivots, like the latter two, can also help Iron Moth find opportunities to switch in. If it is carrying U-turn, wallbreakers like Choice Band Scizor, Choice Specs Latios, and Enamorus appreciate Iron Moth's ability to pivot them in safely, while in return they can smash through the walls and many offensive threats that give Iron Moth trouble. Speed control, namely powerful priority users like Scizor and Choice Scarf users like Tapu Fini and Hydreigon, can also help eliminate physical attackers. Physical wallbreakers like Iron Hands and Buzzwole can help against Blissey and Chansey, which wall Iron Moth. Chansey and Skeledirge also wall Iron Moth, so Ghost- and Dark-types, notably Pursuit users like Mega Tyranitar, can remove them for it.</p>"
      },
      "Booster Energy: Speed": {
        "description": "<p>Iron Moth is a good sweeper primarily seen on hyper offense and offense teams thanks to Booster Energy bolstering its Speed and giving it the immediate ability to outspeed Choice Scarf users like Hydreigon and Sandy Shocks. It also has high Special Attack and access to a threatening movepool. Fiery Dance serves as a spammable Fire-type STAB move that has the power to 2HKO bulky foes like Celesteela, Aegislash, and Amoonguss, and its ability to boost Iron Moth's Special Attack can let it sweep late-game. Sludge Wave helps break through Fire-resistant and Fairy-type Pokemon like Hydreigon, Volcanion, Tapu Fini, and Clefable, and it can help get KOs on neutral targets that Fiery Dance cannot. Substitute lets Iron Moth make use of switches it forces against foes like Celesteela and Buzzwole and take advantage of some defensive Pokemon like Tangrowth lacking Earthquake and Amoonguss. Energy Ball hits Ground-types like Gastrodon, Ting-Lu, and Hippowdon, as well as providing a way to chip Mega Tyranitar. Psychic is an alternative that helps deal with Iron Hands, Mega Venusaur, and opposing Iron Moth. This given EV spread maximizes Special Attack while ensuring that Booster Energy will boost Speed, while the rest is put into Defense to augment its physical bulk and to help against priority moves. Entry hazard setters, notably suicide leads like Excadrill also pair nicely with Iron Moth, being able to chip down targets like Mega Tyranitar and Ting-Lu. Due to Iron Moth's Stealth Rock weakness that can give it a harder time sweeping, hazard removers like Tapu Fini and Excadrill make good teammates. Iron Moth primarily struggles to break through its checks like Chansey, Blissey, and Skeledirge, making fellow physically offensive Pokemon like Ceruledge and Mega Aerodactyl good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "nimzowitsch", "user_id": 272785}, {"username": "Arishem", "user_id": 546157}, {"username": "Gangsta Spongebob", "user_id": 535530}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Okidogi": {"sets": {"Bulk Up": {}}}
}