{
  "Charmander": {"sets": {"Sun Wallbreaker": {}}},
  "Sandshrew-Alola": {"sets": {"Snow Sweeper": {}}},
  "Diglett-Alola": {"sets": {"Life Orb": {}}},
  "Meowth": {"sets": {"Revenge Killer": {}}},
  "Psyduck": {"sets": {"Rain Wallbreaker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"username": "Altariel von Sweep", "user_id": 330191}]}]}},
  "Mankey": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Mankey is one of the most powerful Choice Scarf users in Little Cup thanks to its high Speed, which allows it to outpace or tie with the entire unboosted metagame. This allows Mankey to beat other common Choice Scarf users such as Magnemite, Mudbray, and Gothita. U-turn allows it to greatly capitalize on the switches it forces. Earthquake is a powerful coverage move that hits Mareanie, Glimmet, and Voltorb. Assurance is used to deal as much damage as possible to Ghost-types, OHKOing Eviolite variants on the switch if Stealth Rock is up, while Ice Punch OHKOes Toedscool and threatens Flying-types like Wattrel. Stone Edge is an uncommon option to hit Larvesta and Flying-types. Vital Spirit can be helpful on teams lacking a Grass-type, as it provides a switch-in to Toedscool's Spore, while Defiant is very useful in matchups against Pokemon such as Sticky Web Surskit and Parting Shot Shroodle, as the Attack boosts make Mankey nigh unwallable. Tera Fighting allows Mankey to hit as hard as possible with Close Combat in situations where an unboosted hit is insufficient. Some of Mankey's best teammates include Toedscool to switch in on Ghost-types and remove entry hazards, which can hamper Mankey's pivoting abilities, and either Gothita or Diglett, which can remove the bulky Poison-types like Mareanie and Foongus that give Mankey trouble. Mankey also performs well as part of a VoltTurn core with Pokemon like Volt Switch Voltorb and U-turn Zorua.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Drifting", "user_id": 342456}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "Éric", "user_id": 440139}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Growlithe-Hisui": {"sets": {"Choice Scarf": {}, "Flame Charge": {}}},
  "Bellsprout": {"sets": {"Sun Sweeper": {}}},
  "Slowpoke": {"sets": {"Defensive": {}}},
  "Magnemite": {"sets": {"Choice Scarf": {}}},
  "Grimer-Alola": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Thanks to a solid typing with one weakness and good defensive stats, Alolan Grimer is able to use Knock Offs consistently throughout a game, weakening the opposing team for its teammates to take advantage of. Gunk Shot is used to hit Pokemon that have already been hit by Knock Off, while Drain Punch OHKOs Pawniard and provides some recovery to increase Grimer's longevity. Drain Punch also allows it to damage other Alolan  Grimer neutrally, making it valuable in matchups against opposing Alolan Grimer. Sleep Talk can be used to make Alolan Grimer a great Foongus check and sleep absorber for the team, while Memento gives sweeper teammates a chance to set up. Imprison, together with a bit of Speed investment, lets Alolan Grimer completely shut down opposing Alolan Grimer. Tera Grass eliminates Grimer's only weakness to Ground and lets it take on opposing Hisuian Voltorb more easily.</p> <p>Alolan Grimer is forced out by Ground-types like Mudbray, Numel, and opposing Toedscool, so checks to those Pokemon like Drifloon, Toedscool, and Shellos are essential. Alolan Grimer pairs well with offensive sweepers like Unburden Shroodle, Shellder, and Numel, which can sweep more easily due to Alolan Grimer weakening the enemy team with Knock Off. Grookey is a good partner as well, since Grassy Terrain gives Alolan Grimer much appreciated passive recovery and cuts damage from Earthquake in half, while Alolan Grimer's Knock Off makes switching into Grookey's Wood Hammer much harder. Volt Switch users like Hisuian Voltorb and Wattrel can help get Alolan Grimer in safely, and they can help pressure and overwhelm Ground-types for each other.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Charis_Akins", "user_id": 588203}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "Éric", "user_id": 440139}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Shellder": {"sets": {"Physical Shell Smash": {}}},
  "Gastly": {"sets": {"Life Orb": {}, "Choice Scarf": {}, "Hex": {}}},
  "Voltorb": {
    "outdated": true,
    "sets": {
      "Tera Pivot": {
        "description": "<p>Voltorb's elite Speed tier and STAB Volt Switch make it one of Little Cup's premier pivots, as well as an excellent offensive check to fast threats like Wingull and Crabrawler. Volt Switch lets Voltorb deal solid damage while preserving itself and capitalizing on the switches it forces with its Speed. Thunderbolt deals a stronger blow, invaluable against bulky Water-types like Mareanie, Quaxly, and Shellos, and is valuable for cleaning up weakened fast threats. Tera Blast, once Voltorb has Terastallized, gives it the heralded BoltBeam coverage and turns the tables on would-be checks like Toedscool, Mudbray, Diglett, and Wattrel. Because of Voltorb's limited coverage and the prominence of Ground-types, Voltorb often depends on Terastallization (or the threat of it) to function well in a match. Voltorb leans on a few utility options for its fourth move due to its limited movepool; Protect stops Nymble's First Impression from revenge killing it and can scout defensive Terastallizations, especially Tera Water on Toedscool. Taunt prevents setup and entry hazards from the likes of Pawniard, Surskit, and Glimmet, and Thunder Wave neutralizes setup sweepers and faster threats that Voltorb cannot OHKO. Voltorb pairs well with teammates that can switch into its Ground-type checks when it has not Terastallized. Toedscool is a natural partner thanks to its bulk, Ground resistance, and ability to remove entry hazards for Terastallized Voltorb, given its new Stealth Rock weakness. Drifloon's Ground immunity also supports Voltorb well. As a pivot, Voltorb appreciates the support of other pivots to continually put your opponent on the back foot. Nymble has a powerful STAB U-turn and often invites in Mareanie, which Voltorb can pressure. Wingull not only checks Ground-types with its dual STAB types and Ground immunity, but also appreciates Voltorb handling the bulky Water-types that check it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Voltorb-Hisui": {"sets": {"Special Attacker": {}}},
  "Koffing": {
    "sets": {
      "Tank": {
        "description": "<p>Koffing establishes itself as an excellent physical tank in Little Cup due to its high base Defense stat and Poison typing, which let it check physical attackers like Mienfoo and Timburr. Koffing's best use comes from its ability Neutralizing Gas, which has useful applications, such as denying Mienfoo and Foongus recovery from Regenerator, preventing Snivy from gaining a Special Attack boost from Leaf Storm with Contrary, and denying Hisuian Growlithe the ability to avoid recoil from Head Smash and Flare Blitz. Thunderbolt gives Koffing an option to hit Vullaby and Mareanie for super effective damage. Will-O-Wisp can weaken physical attackers that may switch into Koffing such as Mudbray and Trapinch. Pain Split is Koffing's only good recovery option. Fire Blast can be used over Will-O-Wisp or Pain Split to hit Steel-types and Foongus super effectively. Koffing's EV spread allows it to leverage its already high Defense stat and boost its attacks, letting it 2HKO Pokemon like Foongus with Sludge Bomb if its Eviolite is removed. Koffing uses Tera Water, as it's a generally good defensive type, and it additionally lets Koffing take minimal damage from Shellder's Icicle Spear.</p> <p>Teammates that appreciate Koffing's presence include Mudbray, as Koffing can check Snivy, which can come in easily against Mudbray. Pawniard also makes use of Koffing's ability to deny Mienfoo's Regenerator, making it easier to remove it for Pawniard. Koffing struggles against Glimmet and Hisuian Growlithe, as neither are threatened by any of Koffing's attacks. Mudbray is a good teammate, as it can switch in to both Pokemon and scare them out with Earthquake. Additionally, Gothita can assist Koffing with Glimmet due to Shadow Tag, letting it trap Glimmet for Koffing.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Flou", "user_id": 605215}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "Hacker", "user_id": 387847}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Porygon": {"sets": {"Agility": {}, "Choice Scarf": {}}},
  "Chinchou": {"sets": {"Pivot": {}}},
  "Snubbull": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Snubbull fills a valuable role in Little Cup as a reliable Fighting- and Dark-type check through the combination of its pure Fairy typing and ability in Intimidate, allowing it to check common offensive threats such as Mienfoo, Timburr, and Vullaby. Psychic Fangs allows Snubbull to hit Poison-types like Gastly and Foongus that otherwise wall it. Thunder Wave is a useful tool to hinder opponents, potentially giving Snubbull and its teammates free turns. Thief is a good option for Snubbull in the case that it loses its Eviolite, which happens in nearly every game due to its defensive profile. Earthquake is an option over Thief to hit Steel-types like Pawniard and Tinkatink, as well as OHKOing Hisuian Growlithe. Temper Flare is worth mentioning as well, as it lets Snubbull hit Steel-types and Foongus in one moveslot. The given EV spread allows Snubbull to effectively check the physical attackers it is tasked with taking on while ensuring it still has good power behind its attacks. Snubbull can Terastallize into the Steel typing to cover its weaknesses to Poison- and Steel-type attacks, additionally letting it both resist Vullaby's Brave Bird if Snubbull gets weakened enough for Brave Bird to otherwise KO and survive Snivy's Leaf Storm if it needs to. However, this has the disadvantage of making Snubbull weak to Mienfoo's High Jump Kick, as well as other powerful moves like Mudbray and Trapinch's Earthquake and Hisuian Growlithe's Flare Blitz.</p> <p>Beneficiaries of Snubbull include Stunky, which struggles into the Fighting-types that Snubbull can easily switch into. Mienfoo enjoys Snubbull checking Vullaby, as Vullaby can come in on all of Mienfoo's attacks and threaten teams with its powerful Brave Bird and Knock Off. Snubbull is a decent partner for Pawniard, as Snubbull can switch into Mienfoo's High Jump Kick for Pawniard. Slow, strong Pokemon like Mudbray and Timburr appreciate Snubbull using Thunder Wave to slow down opposing Pokemon. Snubbull itself is threatened by Poison-types such as Foongus and Gastly, with Foongus being able to tank more than one Psychic Fangs and threaten Snubbull with either Sludge Bomb or Spore, while Gastly can threaten an OHKO with Sludge Bomb. Gothita can cover Foongus by trapping it with Shadow Tag, while Stunky can handle Gastly with its natural typing and Knock Off but should be wary of Will-O-Wisp.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Flou", "user_id": 605215}], "teams": [{"name": "Quality checked by", "members": [{"username": "Hacker", "user_id": 387847}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Elekid": {"sets": {"Offensive Pivot": {}}},
  "Magby": {"sets": {"Belly Drum": {}}},
  "Torchic": {"sets": {"Life Orb": {}}},
  "Wingull": {"outdated": true, "sets": {"Offensive": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"username": "gali", "user_id": 107567}]}]}},
  "Azurill": {"outdated": true, "sets": {"Belly Drum": {}}},
  "Numel": {"sets": {"Special Attacker": {}}},
  "Trapinch": {"sets": {"Trapper": {}}},
  "Corphish": {"sets": {"Dragon Dance": {}}},
  "Buizel": {"sets": {"Rain Wallbreaker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"username": "Altariel von Sweep", "user_id": 330191}]}]}},
  "Shellos": {"outdated": true, "sets": {"Defensive": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"username": "Charis_Akins", "user_id": 588203}]}]}},
  "Stunky": {"sets": {"Physical Attacker": {}}},
  "Croagunk": {"sets": {"Bulky Attacker": {}}},
  "Snover": {"sets": {"Snow Setter": {}}},
  "Snivy": {"sets": {"Contrary Wallbreaker": {}, "Choice Scarf": {}}},
  "Timburr": {"sets": {"Physical Attacker": {}}},
  "Sandile": {"sets": {"Bulky Stealth Rock": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"username": "Quinn", "user_id": 553008}]}]}},
  "Zorua": {"sets": {"Choice Scarf": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"username": "TheShoddyStrawman", "user_id": 585065}]}]}},
  "Zorua-Hisui": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Hisuian Zorua provides excellent utility to a team with its combination of a high Special Attack stat, unique defensive typing, and its ability to spread burns and Knock Off. Thanks to its Normal typing, Hisuian Zorua can use Tera Blast as a STAB move even before Terastallizing to hit threats like Alolan Grimer and Shroodle. Tera Fight let it hit Pawniard and provides defensive value by flipping its Dark-type weakness, while Tera Ground additionally allows it to hit Alolan Grimer, Glimmet, and Tinkatink. Hex in combination with Will-O-Wisp's burns does massive damage to even bulkier foes like Mudbray and Toedscool while cleanly OHKOing Drifloon. Will-O-Wisp helps neutralize physical attackers like Pawniard and Crabrawler and can turn them into setup fodders for other sweepers. Knock Off lets Hisuian Zorua soften up opposing teams and is also its best option for hitting opposing Hisuian Zorua. U-turn is an alternative that lets Hisuian Zorua capitalize on the switches it forces from foes like Drifloon. Nasty Plot is an option on dual screens teams where Hisuian Zorua can become a threatening sweeper.</p> <p>Illusion is a highly unique ability that lets Hisuian Zorua create uncomfortable turns for your opponent by disguising as Pokemon whose checks it might beat, and Glimmet and Mudbray appreciate its ability to chip or beat opposing Mudbray and Drifloon, respectively. Pawniard enjoys Hisuian Zorua checking Crabrawler. Hisuian Zorua is often competing with Drifloon for the team's Ghost-type, so it appreciates teammates like Wattrel and Toedscool that can cover for its lack of Ground-type immunity. Crabrawler and Mudbray check opposing Pawniard for Hisuian Zorua when Tera Fight is not an option, and Alolan Grimer, Mudbray, and Croagunk switch into opposing Alolan Grimer.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Minccino": {"sets": {"Skill Link Attacker": {}}},
  "Gothita": {"sets": {"Trapper": {}}},
  "Deerling": {"outdated": true, "sets": {"Offensive": {}}},
  "Foongus": {"sets": {"Defensive": {}}},
  "Axew": {"sets": {"Dragon Dance": {}}},
  "Mienfoo": {
    "sets": {
      "Fast Pivot": {
        "description": "<p>Mienfoo is an LC staple thanks to its combination of Speed, utility, and defensive resilience via its Fighting typing and Regenerator. High Jump Kick is the STAB move of choice, as its additional Base Power and lack of defensive stat drops make it a superior option to Close Combat. Knock Off allows Mienfoo to make consistent progress by removing the Eviolites of even Pokemon that check it like Foongus and Koffing. U-turn capitalizes on the switches Mienfoo forces and generates offensive momentum while synergizing with Regenerator recovery to keep Mienfoo healthy. Fake Out is useful priority that can wear down opposing sweepers and Choice Scarf users and chip foes into KO range. Taunt is another option that lets Mienfoo block Foongus's Spore and prevent setup. Maximum Speed is preferred to outrun major threats like Vullaby and Hisuian Growlithe. Tera Steel gives Mienfoo a host of invaluable resistances and immunities, most notably to Vullaby's Brave Bird, Stunky's Gunk Shot, and Snivy's Leaf Storm, while Tera Fairy is a more niche pick that counters opposing Mienfoo.</p> <p>Mienfoo's utility and versatility mean it fits well on virtually any team, but it pairs especially well with Vullaby thanks to its ability to beat Vullaby's checks like Pawniard and Hisuian Growlithe. Vullaby also handles Foongus, especially if running Overcoat, which Mienfoo otherwise struggles to damage. Snubbull is a great teammate in matches where preserving Mienfoo's Eviolite is necessary, as it can easily switch into opposing Mienfoo's Knock Off and punish it with Thief. Mienfoo can do little to opposing Snubbull, so it appreciates teammates like Mudbray and Diglett-A that do not fear Snubbull's Thunder Wave and can threaten it out. Gastly and Stunky cannot reliably switch into Snubbull, but both threaten it with powerful Poison-type STAB moves off of Mienfoo's U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "Coconut", "user_id": 150971}, {"username": "Hacker", "user_id": 387847}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Pawniard": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Pawniard is a solid defensive Pokemon with the potential to win games. Swords Dance can be used against Pokemon such as on Vullaby, Gastly, and Snubbull. Sucker Punch is a strong STAB priority move that allows Pawniard to hit foes that would otherwise outspeed it such as Gastly and Snivy. Tera Blast Fairy is for Vullaby, Mienfoo, and Timburr that would otherwise stop Pawniard from sweeping while also being strong offensively. Defensively, Tera Fairy lets Pawniard beat Mienfoo, which is otherwise be its most common and worst matchup. Inner Focus is preferred over Defiant to avoid being flinched by Mienfoo's Fake Out.</p> <p>Pawniard's presence helps deal with Gastly and Gothita, assisting teammates such as Snivy, Mienfoo, and Timburr. Vullaby works well with Pawniard due to Pawniard's good matchup against both Snubbull and Glimmet. Mienfoo can U-turn into Pawniard and is a great partner for luring in Vullaby and Snubbull. While Pawniard can Terastallize to remove its Fighting weakness, teammates such as Snubbull, Koffing, and Gothita help against Mienfoo and Timburr without needing to Terastallize themsleves. Snubbull and Gastly can help Pawniard set up with Intimidate and Will-O-Wisp, respectively. Gastly deserves a special mention for often burning Stunky that would otherwise stop a Pawniard sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "TheShoddyStrawman", "user_id": 585065}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "Hacker", "user_id": 387847}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Vullaby": {
    "sets": {
      "Physical Attacker": {
        "description": "<p>Vullaby cements itself as an elite option in LC due to its versatility, great STAB combination, and ability to check threats like Gastly, Snivy, and Gothita. Knock Off hits Vullaby's few reliable switch-ins like Pawniard, Hisuian Growlithe, and Mudbray and makes them shakier answers without Eviolite. U-turn allows Vullaby to function as a pivot and provide momentum against Pokemon like Tinkatink and Pawniard. Alternatively, Defog is an option to support its teammates that are weak to entry hazards. Weak Armor is a great ability, as it allows Vullaby to outspeed the entire metagame after one Weak Armor drop, making Vullaby more offensively potent. Tera Electric removes all of Vullaby's weaknesses, notably allowing it to resist opposing Vullaby's Brave Bird and giving it and gives it immunity to paralysis from Pokemon like Snubbull.</p> <p>Vullaby basically fits on every teamstyle, but it appreciates wallbreakers like Gastly and Hisuian Growlithe that can deal with its checks like Snubbull and Tinkatink. Other Pokemon with pivot moves like Mienfoo and Hisuian Voltorb can form a potent VoltTurn combination with Vullaby. Mudbray and Mienfoo appreciate Vullaby's ability to check Snivy and Foongus. In return, Mudbray and Mienfoo can switch into Pokemon Vullaby is threatened by like Pawniard, Hisuian Growlithe, and Snubbull in Mudbray's case. If Vullaby is instead running Defog, Pokemon weak to Stealth Rock such as Hisuian Growlithe and Larvesta appreciate Vullaby's ability to remove hazards to support them coming in safely.</p>"
      },
      "Nasty Plot": {}
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "goldenghost", "user_id": 32350}, {"username": "Hacker", "user_id": 387847}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Larvesta": {"sets": {"Defensive": {}}},
  "Crabrawler": {
    "sets": {
      "Bulk Up": {
        "description": "<p>Crabrawler is a fantastic bulky attacker that checks dangerous threats such as Hisuian Growlithe and Toedscool, and can sweep teams with Bulk Up. Coverage moves such as Ice Punch, Thunder Punch, and Earthquake offer Crabrawler extreme flexibility in the threats it needs to cover. Ice Punch hits Foongus, Wattrel, and Toedscool, while Thunder Punch hits Mareanie, Wingull, and Quaxly; both options also hit Drifloon super effectively. Earthquake allows Crabrawler to hit Mareanie and Fuecoco and is its strongest neutral option against Hisuian Zorua. Tera Fire makes Crabrawler immune to burns, while Tera Electric makes Thunder Punch stronger against Water-types and gives it defensive utility against threats like Hisuian Voltorb and Wingull. Crabrawler hates dealing with opposing Ghost-types such as Hisuian Zorua, Greavard, and Drifloon, as well as Gothita. Hisuian Growlithe checks these threats and makes an excellent teammate for Crabrawler, as do Ghost-types such as Hisuian Zorua and Drifloon that benefit from the removal of opposing Pawniard.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "TheShoddyStrawman", "user_id": 585065}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Lunaflare", "user_id": 430518}]}]}
  },
  "Mareanie": {"sets": {"Defensive": {}}},
  "Mudbray": {"sets": {"Offensive": {}, "RestTalk": {}}},
  "Sandygast": {"sets": {"Defensive": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"username": "Hacker", "user_id": 387847}]}]}},
  "Grookey": {"sets": {"Choice Scarf": {}, "Pivot": {}}},
  "Chewtle": {"sets": {"Shell Smash": {}}},
  "Impidimp": {"sets": {"Dual Screens": {}}},
  "Fuecoco": {"outdated": true, "sets": {"Defensive": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"username": "Joeshh", "user_id": 607664}]}]}},
  "Quaxly": {
    "sets": {
      "Rapid Spin": {
        "description": "<p>Quaxly is a notable Rapid Spin user in LC due to its access to reliable recovery and good matchup into entry hazard setters like Pawniard and Glimmet; it can also double as a capable sweeper thanks to Moxie. Aqua Cutter gives up some power compared to Liquidation but does not make contact, which avoids activating Greavard's Fluffy and Voltorb's Static, and removes the risk of activating Pawniard's Defiant with a Defense drop. Aqua Jet is STAB priority that OHKOs Hisuian Growlithe, while Brave Bird provides super effective coverage versus Grass- and Fighting-types like Toedscool and Foongus. Encore can lock opposing Pokemon into unfavorable moves, such as weak setup moves, gaining momentum for Quaxly's team. Quaxly can use Tera Grass for a better matchup versus Electric- and Grass-types as well as a valuable immunity to Spore from Foongus and Toedscool. Tera Flying can also be used with Brave Bird to turn Quaxly into a more potent offensive threat. Pokemon weak to Stealth Rock, such as Hisuian Growlithe, Wingull, and Nymble, are great partners for Quaxly, as they appreciate the removal of entry hazards to be used at their full potential. Foongus is another good partner, as it can safely switch into Grass-types and provides valuable Spore support. Pokemon such as Toedscool and Wattrel check Electric-types for Quaxly.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Acehunter1", "user_id": 430377}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Nymble": {
    "sets": {
      "Revenge Killer": {
        "description": "<p>Nymble's unique combination of STAB First Impression and a powerful ability in Tinted Lens allows it to become one of Little Cup's reliable revenge killers, picking off targets such as Toedscool and sweepers such as Shellder. U-turn allows Nymble to pivot on the switches it forces and avoid problematic matchups, such as Wattrel. Sucker Punch revenge kills foes that have Protect or can safely tank a First Impression, such as Drifloon. Tera Bug boosts Nymble's power to absurd levels, letting it OHKO Hisuian Growlithe. Nymble switches out of battle very often, so hazard control from teammates such as Drifloon, Quaxly, and Toedscool are good partners to have. Mareanie and Pawniard can switch into Nymble's common checks such as Hisuian Zorua and Mudbray well. Pokemon weak to Grass- or Dark-types such as Mudbray and Hisuian Zorua appreciate Nymble forcing out or removing their checks. Hisuian Voltorb and Grookey pair well with Nymble, as they can make a deadly VoltTurn combination.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "Drifting", "user_id": 342456}]}, {"name": "Grammar checked by", "members": [{"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Wattrel": {"sets": {"Pivot": {}}},
  "Maschiff": {"outdated": true, "sets": {"Choice Scarf": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"username": "Shandeur", "user_id": 580548}]}]}},
  "Shroodle": {
    "sets": {
      "Prankster Pivot": {
        "description": "<p>With access to a trifecta of amazing qualities in Prankster, a fast speed tier, and a Poison typing, which is near mandatory on many builds, Shroodle serves as an amazing offensive pivot.  At 18 Speed it outspeeds most of the metagame and can cripple foes by removing their Eviolite or Oran Berry. A fast U-turn also lets it pivot on most unboosted Pokemon while forcing some chip damage on key enemies like Gothita and Dark-types like Alolan Grimer to bring a setup sweeper in, while Prankster Parting Shot allows Shroodle to retain momentum in a fast-paced metagame by shutting down potential non Dark-type offensive threats.  Shroodle also excels in an offensive metagame full of setup sweepers, shutting down setup Pokemon  such as Shellder, Crabrawler, and Numel with Encore.  Copycat can be used over Gunk Shot in some situational cases, such as to copy moves like Memento, Stealth Rock, and even damaging moves to potentially revenge kill opponents. Dark-type is the prefered Tera type for its potential to make Shroodle's utility even better. Tera Dark removes the weakness to Psychic and to Gothita's ability to trap and revenge kill it, allowing it to beat Gothita and Unburden Drifloon with STAB Knock Off.</p> <p>Shroodle is incredibly versatile with its utility, ability to absorb Toxic Spikes, and resistance to Grass. It pairs well with Hisuian Voltorb, Grookey, Hisuian Zorua, and other offensive pivots to pressure teams with VoltTurn spamming while also fitting on offensive structures to safely bring setup sweepers in with Prankster Parting Shot. Grookey can also act as a lure from team preview for opponents who might play around this set with the terrain sweeper set in mind. Shroodle's lack of bulk makes it quite frail, making it hard to switch in sometimes and easy to revenge kill by trapper Gothita and opposing priority users. Shroodle also gets shut down by Dark-types as well as opposing setup sweepers that can Terastalize into the Dark typing such as Swords Dance Pawniard, Shellder, and Numel.</p>"
      },
      "Terrain Sweeper": {}
    },
    "credits": {"writtenBy": [{"username": "BlackKnight_Gawain", "user_id": 205631}], "teams": [{"name": "Quality checked by", "members": [{"username": "Éric", "user_id": 440139}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Bramblin": {"sets": {"Spinner": {}}},
  "Toedscool": {"sets": {"Utility": {}}},
  "Tinkatink": {"sets": {"Utility": {}}},
  "Glimmet": {"sets": {"Physically Defensive": {}}},
  "Greavard": {"sets": {"Bulky Spinblocker": {}}}
}