{
  "Ho-Oh": {
    "sets": {
      "Defensive Pivot": {},
      "Offensive": {
        "description": "<p>Ho-Oh is one of the best wallbreakers in the metagame thanks to its high Attack stat, powerful STAB moves, incredible longevity provided by Regenerator, and amazing typing. The prominence of Koraidon and its sun makes Ho-Oh's Sacred Fire incredibly powerful, always OHKOing offensive Necrozma-DM and Calyrex-S with one layer of Spikes, always 2HKOing Arceus, and greatly limiting the capacity of Ting-Lu to switch in while having very high odds of burning switch-ins that aren't Fire-type, such as Eternatus and Arceus-Water. Brave Bird is only resisted by a few Pokemon, like Necrozma-DM, Zacian-C, and Miraidon, which are all threatened by Ho-Oh's other moves. Earthquake is mainly used as a way to hit Miraidon super effectively, but it also 2HKOes Eternatus without recoil. Tera Ground allows Ho-Oh to turn the tables on Miraidon and OHKO it with Earthquake, increase the damage it deals to Eternatus, and 2HKO offensive Tera Fire Arceus-Ground without getting OHKOed by Stone Edge. However, it leaves Ho-Oh weak to Calyrex-S's Grass Knot. Tera Fairy is helpful as a way to deny Dragon-type moves from Koraidon while still surviving any move from Miraidon, although it stops Ho-Oh from checking Necrozma-DM and removes its resistance to and immunity to burn from opposing Ho-Oh's Sacred Fire and Koraidon's Flare Blitz. Tera Flying further bolsters the power of Brave Bird, allowing it to OHKO Calyrex-S, 2HKO bulky Arceus, and 2HKO Ting-Lu with one layer of Spikes. The given EVs are to ensure Ho-Oh outspeeds opposing defensive Ho-Oh, Gliscor, and bulky Necrozma-DM while maximizing its Attack and bulk.</p> <p>Offensive Ho-Oh fits best on balance and bulky offense teams, which greatly benefit from its wallbreaking and high staying power due to Regenerator. Calyrex-S and Miraidon appreciate Ho-Oh taking on opposing Ting-Lu, which can check both of them. Choice Scarf Koraidon also benefits from offensive Ho-Oh switching in freely against most of its checks, such as defensive Arceus-Ground, Arceus-Fairy, and Landorus-T, and it can easily pivot Ho-Oh in with U-turn, also providing sun to bolster Sacred Fire's power. Offensive Ho-Oh appreciates Ting-Lu a lot thanks to its ability to check Miraidon—which would otherwise OHKO Ho-Oh with Electro Drift—and Calyrex-S. Entry hazard setters like Eternatus, Ting-Lu, Arceus-Ground, and Landorus-T are perfect partners, as they enhance Ho-Oh's wallbreaking power with the chip damage provided by hazards. Ho-Oh also greatly values partners that can help check Koraidon, like Arceus-Fairy, Arceus-Ground, and Arceus-Water; the last also checks Necrozma-DM, which can be threatening for Ho-Oh if it's carrying Stone Edge. Offensive Ho-Oh struggles against Calyrex-S; therefore, partners that can check it like Ting-Lu and Arceus are appreciated.</p>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 554093, "username": "RL"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 631210, "username": "Adhiraj8202"}, {"user_id": 584685, "username": "Glory"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Kyogre": {
    "sets": {
      "Offensive": {},
      "Choice Specs": {},
      "Choice Scarf": {
        "outdated": true,
        "description": "<p>Choice Scarf Kyogre is a decent revenge killer and wallbreaker, most notably on bulky offense teams, that threatens Pokemon such as Ting-Lu, Skeledirge, and most defensive Arceus formes. Ice Beam is Kyogre's best move to hit Koraidon and Miraidon, weakening them to potentially let it clean up late-game. Thunder is used for Toxapex and Arceus-Water. Tera Water boosts Water Spout considerably, allowing it to 2HKO Pokemon such as Eternatus and Tera Poison or Steel Ting-Lu, while Tera Ghost prevents Kyogre from being revenge killed by Extreme Killer Arceus. As Kyogre is slower than other Choice Scarf users such as Calyrex-S, Koraidon, Miraidon, and Extreme Speed Arceus, solid checks to them, such as Ting-Lu, Landorus-T and Toxapex for the latter two, are appreciated. Giratina-O checks Arceus too, and it can remove entry hazards for Kyogre to maintain its powerful Water Spout. Offensive teammates such as Calyrex-S and Miraidon can pressure Kyogre's checks such as Eternatus, Toxapex, and Arceus-Water, and they appreciate Kyogre threatening Ting-Lu for them. Partners such as Miraidon and Koraidon, whose checks are pressured by Kyogre can safely pivot it in with U-turn.</p>"
      }
    }
  },
  "Groudon": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Groudon is a decent pick for bulky offense teams thanks to its ability to check Zacian-C, Extreme Killer Arceus, Dragon Dance Arceus-Ground, and Koraidon due to its solid bulk. Access to moves such as Will-O-Wisp and Spikes differentiate it from Landorus-T. Will-O-Wisp allows Groudon to cripple Pokemon that switch into it such as Koraidon and physical variants of Arceus-Ground. Roar is used to phaze foes such as Swords Dance Zacian-C, Swords Dance Koraidon, Extreme Killer Arceus, and Arceus-Ground that may try to set up on it while also racking up chip damage from entry hazards. Protect is an alternative move that can be used to scout moves from the likes of Choice Specs Miraidon and Kyogre and Choice Scarf Koraidon as well as maximize Leftovers recovery. Tera Water allows Groudon to resist Behemoth Blade from Zacian-C, Flare Blitz from Koraidon, and Water Spout and Ice Beam from Kyogre, whereas Tera Fairy makes it immune or resistant to Scale Shot and Low Kick from Koraidon and Draco Meteor from Miraidon. Offensive teammates that benefit from the hazards set up by Groudon such as Calyrex-S, Calm Mind Arceus formes, Miraidon, Koraidon, Zacian-C, and Extreme Killer Arceus are appreciated. As Groudon lacks recovery, revenge killers such as Choice Scarf Koraidon and other physical walls with access to recovery such as defensive Arceus formes are mandatory partners. As Groudon is unable to check special attackers such as Calyrex-S, Miraidon, and Kyogre, checks to them such as Ting-Lu and Clodsire are appreciated; they can set up hazards as well to form a hazard stacking core with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609321, "username": "eavo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys-Attack": {"sets": {"All-Out Attacker": {}}},
  "Deoxys-Speed": {
    "overview": "<p>With incredible Speed and a diverse pool of utility moves, Deoxys-S cements itself as one of the most reliable suicide leads in AG and should be considered on many hyper offense structures. The fast Taunt and entry hazards Deoxys-S provides enable many powerful setup sweepers like Koraidon and Miraidon to break through their usual checks. However, Deoxys-S is quite one dimensional, as it is cramped for moves if it wants to beat some of its many counterleads; for example, it needs Knock Off to threaten Calyrex-S and Psycho Boost to threaten Scale Shot Koraidon. Although it is often considered to be the most reliable suicide lead in the tier, it doesn't match up well against many other hyper offense leads such as Ribombee, Glimmora, and the occasional Grimmsnarl, so teammates like Necrozma-DM are appreciated.</p>",
    "comments": "<h3>Other Options</h3> <p>Skill Swap can be used to beat Magic Bounce Hatterene, but Hatterene is very rare, and Skill Swap has limited uses in other matchups. Tera Dark can be used to beat Grimmsnarl leads, but this is quite situational, and it loses out on the Extreme Killer Arceus matchup. Rocky Helmet with a bulkier EV spread of 252 HP / 192 Def / 16 SpD / 52 Spe can be used to possibly set multiple layers of entry hazards more reliably and beat Focus Sash leads, but it leaves Deoxys-S vulnerable to Choice Scarf Calyrex-S. Counter can be used alongside the aforementioned bulky EV spread to punish U-turn from Choice Scarf Koraidon but has limited other uses.</p> <h3>Checks and Counters</h3> <p><strong>Ribombee</strong>: Ribombee can lower Deoxys-S's Speed with Pounce and follow up by KOing it with Bug Buzz.</p> <p><strong>Calyrex-S</strong>: With its powerful Astral Barrage, Calyrex-S can KO non-Knock Off Deoxys-S and gain a Special Attack boost as a result, which makes it harder to respond to, as hyper offense teams usually do not have any Choice Scarf users.</p> <p><strong>Grimmsnarl</strong>: Deoxys-S cannot deal any meaningful damage to Grimmsnarl, which can use Taunt before Deoxys-S can set entry hazards. However, Grimmsnarl doesn't appreciate losing its Light Clay because of Knock Off.</p>",
    "sets": {
      "Suicide Lead": {
        "description": "<p>Deoxys-S outspeeds every single viable unboosted Pokemon in the metagame, and with utility moves such as Taunt, Stealth Rock, Spikes, and Knock Off, it is often considered to be one of the most reliable and effective dedicated leads in AG. Taunt can prevent other leads from setting up their own entry hazards or boosting, and Psycho Boost OHKOes Koraidon. Knock Off can take out any unsuspecting Calyrex-S, while Stealth Rock can be used if Deoxys-S can survive for multiple turns to set it in addition to Spikes and should be used with an EV spread of 80 HP / 176 SpA / 252 Spe and a Timid nature. Tera Ghost blocks Extreme Speed from Arceus, letting Deoxys-S set up more hazards. 176 Special Attack EVs guarantee that Psycho Boost OHKOes Koraidon, and the leftover EVs are dumped into Attack to guarantee an OHKO on Calyrex-S with Knock Off.</p> <p>The only archetype that Deoxys-S fits on is hyper offense, so setup sweepers like Scale Shot Koraidon, Agility Miraidon, and Nasty Plot Calyrex-S that can take advantage of the entry hazard damage on their checks are great teammates. Since Deoxys-S struggles with Grimmsnarl, Ribombee, and Choice Scarf Calyrex-S, teammates like Trick Room Necrozma-DM and Extreme Killer Arceus can help by dealing with them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 651906, "username": "Pigbeeef"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Gliscor": {"sets": {"Defensive": {}}},
  "Giratina-Origin": {
    "sets": {
      "Offensive": {},
      "Defensive": {
        "outdated": true,
        "description": "<p>Thanks to its bulk, typing, and Levitate ability, defensive Giratina-O checks Pokemon like Arceus, Arceus-Ground, and Choice Scarf Kyogre, and it is the only metagame-relevant Defog user. Will-O-Wisp and Thunder Wave both debilitate physical attackers, but Will-O-Wisp chips away at walls and affects Dragon Dance Arceus-Ground, while Thunder Wave additionally impairs special attackers such as Calm Mind Arceus-Fairy. Poltergeist breaks Arceus-Ground's Substitute, which would otherwise block Will-O-Wisp and Dragon Tail, in one hit; alternatively, running Hex lets Giratina-O hit statused walls harder and makes burn affect it much less. Dragon Tail quickly racks up entry hazard damage on the opposing team and prevents foes from continuously setting up against Giratina-O, which is especially useful against Taunt users. The given EV spread lets Giratina take unboosted Calyrex-S's Astral Barrage and outspeed Taunt Landorus-T. Tera Steel makes Giratina-O immune to poison from foes such as Toxapex and gives it a resistance to moves like Arceus-Fairy's Judgment, Zacian-C's Play Rough and Behemoth Blade, Koraidon's Scale Shot, and Arceus-Ground's Dragon Claw and Ice Beam. Tera Poison similarly removes Giratina-O's Dragon weakness and provides it with an immunity to Toxic and a resistance to Fairy, but it doesn't make Giratina-O weak to Koraidon's Low Kick. Defensive Giratina-O fits best on balance teams that otherwise have trouble dealing with Ground-types such as Dragon Dance Arceus-Ground or need the increased longevity Defog provides. Toxapex and Skeledirge handle Pokemon like Zacian-C and Koraidon for Giratina-O; in return, it handles Ground-types and helps check Arceus. Giratina-O appreciates Ting-Lu and Arceus checking Calyrex-S for it; Ting-Lu also checks Miraidon and helps check Calm Mind Arceus-Ground. Calyrex-S likes Giratina-O being able to deal with its two main switch-ins, Arceus and Ting-Lu, by checking the former and removing the latter's Spikes. Because it lacks recovery, Giratina-O can get overwhelmed by the Pokemon it checks when facing hyper offense teams, so it appreciates revenge killers such as Extreme Killer Arceus and Choice Scarf Koraidon.</p>"
      }
    }
  },
  "Arceus": {
    "sets": {
      "Bulky Swords Dance": {},
      "Bulk Up": {},
      "Offensive Swords Dance": {},
      "Offensive Setup": {
        "outdated": true,
        "description": "<p>Arceus is a potent revenge killer, wallbreaker, and setup sweeper thanks to its excellent movepool and powerful Extreme Speed. Swords Dance can be used to break past Pokemon like Landorus-T, Giratina-O, Toxapex, and defensive Arceus formes and limit revenge killers like Koraidon, while Dragon Dance is a more niche option that lets Arceus outspeed Calyrex-S, Zacian-C, and opposing Arceus formes. Shadow Claw hits Ghost-types like Giratina-O, Skeledirge, and Calyrex-S and provides good neutral coverage. Recover can provide Arceus with more opportunities to set up and makes it harder to revenge kill; alternatively, Earthquake hits Skeledirge harder, as well as hitting Toxapex and Zacian-C, and Taunt can deny opposing recovery, status-inducing moves, and Haze from Pokemon like Arceus formes, Skeledirge, and Toxapex, respectively. Silk Scarf has no drawbacks, but unlike Life Orb, it means +2 Extreme Speed needs a layer of Spikes to 2HKO defensive Arceus formes, OHKO Miriadon, and 2HKO Zacian-C. Additionally, Life Orb lets +2 Extreme Speed OHKO Koraidon after a layer of Spikes, +1 Earthquake OHKO Zacian-C, and unboosted Earthquake 2HKO Skeledirge and Toxapex. Tera Normal OHKOes Koraidon with +2 Extreme Speed and enables Silk Scarf Arceus to achieve the damage thresholds Life Orb sets can. Tera Ghost makes Arceus harder to revenge kill by opposing Arceus and Koraidon and lets Life Orb-boosted Shadow Claw OHKO defensive Giratina-O after Stealth Rock at +2, OHKO Zacian-C after some chip damage at +2, and 2HKO Skeledirge. Tera Fire makes Arceus immune to Will-O-Wisp, helping against Skeledirge and opposing Arceus formes, and lets it resist Zacian-C's STAB moves, Arceus-Fairy's Judgment, and Calyrex-S's Grass Knot. Arceus fits well on offense and bulky offense teams, being able to revenge kill dangerous threats and clean up late-game. Thanks to Arceus's Normal typing, it's immune to Calyrex-S's Astral Barrage, which can help against Choice Specs sets, Koraidon and Zacian-C pair well with Arceus, as they help overwhelm shared checks with Arceus like Landorus-T, Toxapex, and defensive Arceus formes. Pokemon such as Calyrex-S, Miraidon, and Kyogre also threaten its checks and make good teammates. On bulky offense teams, Landorus-T and Ting-Lu make good partners, as Landorus-T can switch into Pokemon that can revenge kill Arceus like Zacian-C and Koraidon, chipping them with Rocky Helmet in the process, and Ting-Lu crucially sets Spikes and helps check Calyrex-S, which offensive Arceus does poorly. On hyper offense teams, Pokemon like Grimmsnarl, Glimmora, and Ribombee support Arceus, and Pokemon like Arceus-Fairy and Arceus-Ground can take advantage of Koraidon and Zacian-C for it.</p>"
      },
      "Bulky Extreme Killer": {
        "outdated": true,
        "description": "<p>Extreme Killer Arceus is a stellar revenge killer, wallbreaker, and cleaner that also crucially checks Calyrex-S thanks to its great defensive profile; this phenomenal combination of traits makes Arceus one of the best Pokemon in the AG metagame, and it should be seriously considered on every team. Swords Dance is the preferred setup move to break through checks like Giratina-O and Landorus-T and limit revenge killers like Koraidon and Zacian-C, while Bulk Up is an alternative on hyper offense with dual screens support from Pokemon like Grimmsnarl, making Arceus a brutal sweeper that stifles common forms of counterplay like Koraidon, Zacian-C, and opposing Extreme Killer Arceus. Shadow Claw OHKOes Calyrex-S, hits Giratina-O, and provides good neutral coverage. The longevity Heavy-Duty Boots provides lets Arceus more reliably check Calyrex-S and more safely set up. Leftovers is an alternative to Heavy-Duty Boots, making Arceus harder to stop once set up. Tera Ghost turns the tables on Koraidon, lets Arceus consistently beat opposing Extreme Killer Arceus, and greatly improves Shadow Claw's damage against Giratina-O and Skeledirge, while Tera Normal boosts Arceus's power to ridiculous levels; at +2, Extreme Speed OHKOes Koraidon after Stealth Rock and 2HKOes Zacian-C. Tera Fire and Steel are more defensive options, blocking status and improving the matchup against threats like Arceus-Fairy, Zacian-C, and Calyrex-S as well as opposing Extreme Killer Arceus in the case of Steel. 236 HP EVs always survive a hit from Choice Specs Miraidon. Alternatively, a spread with 124 HP / 252 Atk / 8 Def / 124 Spe and an Adamant nature outspeeds Timid Kyogre and always avoids a 2HKO from Life Orb Calyrex-S's Psyshock. Arceus can struggle to break through Giratina-O, Skeledirge, Toxapex, and defensive Arceus formes, so teammates that can take advantage of them, like Calyrex-S and Calm Mind Arceus-Ground, or weaken them, like Koraidon and Zacian-C, make for good partners. Choice Scarf Koraidon can also revenge kill Pokemon Arceus cannot like Zacian-C and Calyrex-S. Encore Calyrex-S can switch into any of Arceus's moves besides Shadow Claw and use Encore, so Ting-Lu is a great partner to help check it. Koraidon and Zacian-C highly threaten Arceus, so strong counterplay to them, like Landorus-T on offense or Toxapex or Skeledirge on balance, is crucial.</p>"
      }
    }
  },
  "Arceus-Dark": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Dark is a decent defensive Pokemon that checks Arceus and soft checks Calyrex-S, Dragon Dance Arceus-Ground, and offensive Giratina-O while being immune to Trick. Will-O-Wisp prevents Pokemon like Koraidon and Zacian-C from safely switching in on Arceus-Dark. Foul Play is the main way of hitting physical attackers. Alternatively, Judgment can be ran to ignore Will-O-Wisp's burn to effectively hit the likes of Skeledirge and Giratina-O, allowing Arceus-Dark to switch into Will-O-Wisp from them. Judgment also does decent damage to Terastallized Calyrex-S and Toxapex. Taunt shuts down Pokemon like Ting-Lu and Toxapex from setting up entry hazards, namely that of Spikes and Toxic Spikes, prevents setup sweepers from setting up, and blocks recovery, which Judgment variants appreciate. Tera Poison gives Arceus-Dark a much-needed resistance to Koraidon's Low Kick, Zacian-C's Play Rough, and Calyrex-S's Grass Knot while also letting it absorb tedious Toxic Spikes. Arceus-Dark fits best on balance and bulky offense teams, which appreciate its ability to check Extreme Killer Arceus and soft check Calyrex-S. Arceus-Dark struggles with physical attackers such as Koraidon and Zacian-C, so checks to them such as Landorus-T, Skeledirge, and Toxapex are appreciated. Since Arceus-Dark can't run Heavy-Duty Boots, it fails to effectively check Calyrex-S in the long run, so Ting-Lu and Arceus help check Calyrex-S more effectively throughout the game, which is appreciated. Arceus-Fairy can use Arceus-Dark as setup fodder with Calm Mind, which makes Zacian-C a good teammate to pair with Arceus-Dark.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 631210, "username": "Adhiraj8202"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 511181, "username": "Rose"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Arceus-Fairy": {
    "sets": {
      "Defensive": {},
      "Utility": {
        "outdated": true,
        "description": "<p>Arceus-Fairy provides good utility with Stealth Rock and Taunt while blocking Koraidon from using Scale Shot and also threatening common Pokemon like Ting-Lu, Giratina-O, and Landorus-T. Utility Arceus-Fairy is generally seen on more offense-oriented teams, but it can be ran on balance teams occasionally. Will-O-Wisp prevents Pokemon like Dragon Dance Arceus-Ground, Extreme Killer Arceus, and Zacian-C from safely switching in on Arceus-Fairy. Taunt prevents Pokemon like Ting-Lu and Toxapex from setting up entry hazards and opposing Calm Mind Arceus-Fairy, and Calm Mind Arceus-Ground, and Tera Fire physical attackers such as the aforementioned Will-O-Wisp targets.Both Tera Fire and Tera Water give Arceus-Fairy key resistances to attacks like Koraidon's Flare Blitz and Zacian-C's Behemoth Blade, with Tera Water additionally helping against Kyogre's STAB moves and Tera Fire improving the matchup against opposing Arceus-Fairy. Tera Poison removes Arceus-Fairy's Steel-type weakness, lets it block Toxic from Pokemon like Eternatus and Toxapex, and lets it absorb Toxic Spikes. On hyper offense teams, Arceus-Fairy appreciates Pokemon like Calyrex-S, Arceus-Ground, Swords Dance Koraidon, and Extreme Killer Arceus, which benefit from it countering their checks in Ting-Lu and Landorus-T. On more balance-oriented teams, physical attackers such as Koraidon and Zacian-C can overwhelm Arceus-Fairy, so defensive checks to them in Landorus-T, Toxapex, and Skeledirge are appreciated. Arceus-Fairy also struggles with Calyrex-S, which makes Arceus and Ting-Lu great teammates.</p>"
      },
      "Offensive Calm Mind": {
        "outdated": true,
        "description": "<p>Calm Mind Arceus-Fairy is an excellent, self-sufficient wallbreaker and sweeper that matches up well against Koraidon and Ting-Lu. Earth Power hits foes like Zacian-C, Toxapex, and Skeledirge, as well as Tera Fire Pokemon such as Arceus and Koraidon. Tera Water gives Arceus-Fairy a resistance to attacks like Koraidon's Flare Blitz, Zacian-C's Behemoth Blade, and Choice Scarf Kyogre's Water Spout, making it harder to revenge kill and giving it more opportunities to set up. Tera Poison removes Arceus-Fairy's Steel weakness, provides it with an immunity to Toxic from foes like Toxapex and Eternatus, and lets it absorb bothersome Toxic Spikes. Tera Ground removes Arceus-Fairy's weakness to Behemoth Blade and lets +1 Earth Power OHKO Zacian-C and Toxapex. Calm Mind Arceus-Fairy fits on balance, bulky offense, and hyper offense teams that appreciate its ability to block Koraidon's Scale Shot and be a dangerous setup sweeper. Unlike bulkier Arceus-Fairy sets, Calm Mind Arceus-Fairy is unable to switch into Koraidon, and Pokemon like Zacian-C and Choice Specs Calyrex-S can revenge kill it, so on balance and bulky offense teams, it appreciates teammates such as Toxapex, Skeledirge, Landorus-T, and Ting-Lu checking these foes. On hyper offense teams, teammates like Calyrex-S and Arceus can take advantage of Zacian-C and opposing Calyrex-S for Arceus-Fairy. Hyper offense teams can also run an entry hazard lead like Glimmora or Ribombee to weaken Pokemon for Arceus-Fairy with Spikes or let it outspeed foes such as Choice Specs Calyrex-S, Zacian-C, and Choice Scarf Koraidon via Sticky Web, respectively. On all team playstyles, Calyrex-S appreciates Arceus-Fairy taking advantage of Ting-Lu and Choice Scarf Koraidon.</p>"
      }
    }
  },
  "Arceus-Ground": {
    "sets": {
      "Defensive": {},
      "Calm Mind": {},
      "Bulky Dragon Dance": {},
      "Offensive Dragon Dance": {},
      "Defensive Calm Mind": {
        "outdated": true,
        "description": "<p>Defensive Calm Mind Arceus-Ground is a good sweeper and wallbreaker that also provides solid defensive utility against foes like Koraidon, Zacian-C, and Arceus. Will-O-Wisp improves Arceus-Ground's ability to check physical attackers. Ice beam hits Landorus-T, Giratina-O, Wo-Chien, and Tera Grass and Tera Flying Pokemon such as Calyrex-S and Skeledirge, respectively. Alternatively, Taunt can be run to prevent Pokemon like Ting-Lu and Toxapex from setting up entry hazards, phazing Arceus-Ground, and spreading status, and it also prevents sweepers like Extreme Killer Arceus and Calm Mind Arceus formes from setting up. 16 Speed EVs let Arceus-Ground outspeed Modest Kyogre and Adamant Groudon. Tera Fairy gives Arceus-Ground a much-needed immunity to Koraidon's Dragon-type moves, Miraidon's Draco Meteor, and Giratina-O's Dragon Tail, as well as a resistance to the former's Low Kick, making it more difficult to revenge kill and phaze. On the other hand, Tera Water lets Arceus-Ground resist Water-type attacks from Arceus-Water and Choice-locked Kyogre, allowing it to set up on them with relative ease, resists Flare Blitz from Koraidon, and Behemoth Blade from Zacian-C. Tera Poison allows Arceus-Ground to resist Judgment from Arceus-Fairy, Low Kick from Koraidon, and Grass Knot from Calyrex-S; absorb tedious Toxic Spikes; and become immune to Toxapex's and Eternatus's Toxic. Defensive Calm Mind Arceus-Ground fits best on balance and bulky offense teams that appreciate its ability to soft check physical attackers while being a potent sweeper itself. Ting-Lu is a great check to Arceus-Ground, which makes Calyrex-S a great teammate as they both wear down Ting-Lu for each other, potentially enabling one to sweep. Calyrex-S and Kyogre revenge kill Arceus-Ground, and the physical attackers it checks may overwhelm Arceus-Ground, so checks to them such as Ting-Lu, Eternatus, Toxapex, and Landorus-T are appreciated. Potent revenge killers like Choice Scarf Koraidon and Extreme Killer Arceus are also appreciated. Arceus-Ground struggles with Grass Knot from Calyrex-S, and also struggles with Giratina-O, so Arceus can check Calyrex-S while also pressurizing Giratina-O with Swords Dance boosted-Shadow Claw, which makes it a great teammate for Arceus-Ground.</p>"
      },
      "Dragon Dance": {
        "outdated": true,
        "description": "<p>Arceus-Ground is a powerful setup sweeper that utilizes its good bulk, useful utility moves, and STAB-boosted Earthquake to pressure common defensive Pokemon such as Toxapex, Skeledirge, Eternatus, and Ting-Lu. Ice Beam smashes Landorus-T, which would otherwise wall Arceus-Ground. Dragon Claw is primarily used to hit Giratina-O and Landorus-T, while Gravity is a similar option to hit them as well. Taunt shuts down Skeledirge and Toxapex while preventing Ting-Lu from phazing Arceus-Ground. Substitute eases prediction versus Terastallization while also blocking status from the aforementioned Pokemon. Recover lets Arceus-Ground set up on Pokemon such as Landorus-T and have a longer term presence throughout the game but is generally outclassed by the prior two options. Tera Fairy lets Arceus-Ground take Koraidon's Low Kick and Dragon-type attacks, take Miraidon's Draco Meteor, and, when paired with Substitute or Taunt, use Giratina-O as setup fodder. At +1, Tera Ground lets Earthquake OHKO Koraidon and 2HKO defensive Arceus formes and Ting-Lu. Tera Steel is another option for resisting Calyrex-S's Grass Knot, Miraidon and Koraidon's Dragon-type attacks, both of Zacian-C's STAB attacks, and Extreme Speed from Arceus. However, Tera Steel leaves Arceus-Ground open to Choice Scarf Koraidon. Arceus-Ground acts as a wincon after wallbreakers such as Koraidon, Zacian-C, and Calyrex-S have broken down its checks in Landorus-T and defensive Arceus formes. Extreme Killer Arceus is another solid partner for forcing damage on Giratina-O, opening up Arceus-Ground late-game. Arceus-Ground can be revenge killed by the likes of Choice Scarf Koraidon, Arceus, and Choice Scarf Calyrex-S, so checks to these such as Landorus-T and Arceus formes are appreciated. Support from Pokemon such as Grimmsnarl, Glimmora, and Ribombee can faciliate Arceus-Ground on hyper offense teams.</p>"
      },
      "Offensive Calm Mind": {
        "outdated": true,
        "description": "<p>Calm Mind Arceus-Ground is a excellent wallbreaker and sweeper that leverages its great natural bulk and near-perfect coverage to become extremely hard to stop. Ice Beam is the preferred coverage to hit Giratina-O, Landorus-T, Wo-Chien, and the occasional Tera Grass or Tera Flying Pokemon, such as Zacian-C. Tera Fairy blocks Miraidon's Draco Meteor and gives Arceus-Ground a resistance to Koraidon's Low Kick, making it more difficult to revenge kill. Tera Water instead provides it with a resistance to Water-type attacks from the likes of Kyogre and Arceus-Water—allowing Arceus-Ground to turn the tables against them—and Koraidon's Flare Blitz and Zacian-C's Behemoth Blade. Tera Ground boosts Arceus-Ground's power greatly; with a layer of Spikes, it 2HKOes Ting-Lu at +1 and OHKOes opposing Arceus formes at +2. An alternative spread of 120 HP / 252 SpA / 136 Spe with a Timid nature outspeeds neutral-natured Arceus formes and always survives an attack from Choice Band Koraidon but no longer outspeeds Adamant Koraidon. Arceus-Ground best fits on hyper offense and bulky offense teams that appreciate its ability to check Miraidon while being a dangerous sweeper itself. Ting-Lu is the most effective check to Arceus-Ground, so Calyrex-S is a very potent teammate, as they both wear down Ting-Lu for the other to take advantage of. Zacian-C, Koraidon, and opposing Calyrex-S can all revenge kill Arceus-Ground, so checks to them like Landorus-T and Ting-Lu on bulky offense or teammates that can take advantage of them like Calyrex-S, Arceus-Fairy, and Extreme Killer Arceus on hyper offense are greatly appreciated.</p>"
      }
    }
  },
  "Arceus-Water": {
    "overview": "<p>Arceus-Water is one of the best physical walls in the metagame, being used on balance and bulky offense teams to check top threats like Necrozma-DM, Ho-Oh, and Koraidon with its great bulk, typing, and utility moves such as Will-O-Wisp and Dragon Tail. It can also be a decent wincon with Calm Mind, using its defensive profile to repeatedly set up and avoid revenge killing attempts. However, Pokemon like Miraidon and Eternatus can relatively freely switch into Arceus-Water and threaten it, the omnipresent Koraidon's sun weakens its Judgment, and it is vulnerable to being worn down into KO range of foes it's supposed to check by entry hazards.</p>",
    "comments": "<h3>Other Options</h3> <p>Defensive Arceus-Water can use Calm Mind in the fourth moveslot to turn into a decent wincon, as it can use its bulk to set up on the foes it checks and avoid being revenge killed by Pokemon like Koraidon and Arceus. Draco Meteor is also an option in this moveslot to chip Koraidon, Miraidon, and Eternatus more reliably than Dragon Tail; Miriadon can only switch into it once, and it has a good chance to 2HKO Koraidon. Thunder Wave can be used over Will-O-Wisp to debilitate Calyrex-S, Eternatus, Ho-Oh, and Tera Fire users like Koraidon and Necrozma-DM, but this makes Arceus-Water worse against Arceus and Dragon Dance Arceus-Ground.</p> <h3>Checks and Counters</h3> <p><strong>Miriadon</strong>: Miraidon can switch into any of Arceus-Water's moves bar Dragon Tail with very little consequence to fire off its powerful attacks or grab momentum with U-turn.</p> <p><strong>Eternatus</strong>: Eternatus can repeatedly take Arceus-Water's moves and cripple it with Toxic or lay Toxic Spikes against it, though Tera Poison prevents this.</p> <p><strong>Calyrex-S</strong>: Calyrex-S can pretty safely switch into Arceus-Water, usually at worst taking a chunk from Judgment or being forced out by Dragon Tail, and use this as an opportunity to set up or immediately wallbreak. However, the rare Thunder Wave completely ruins Calyrex-S.</p> <p><strong>Kyogre</strong>: Kyogre is similarly able to use Arceus-Water as an entry point to use Calm Mind, Thunder, or Origin Pulse; it loses to Calm Mind Arceus-Water if it lacks Thunder, however.</p> <p><strong>Sun</strong>: Koraidon's sun severely weakens Arceus-Water's Judgment, making it struggle against foes like Ho-Oh, Ting-Lu, and Arceus-Ground or potentially impeding its sweep.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Water is a good check to dangerous physical attackers like Necrozma-DM, Koraidon, Ho-Oh, Arceus, Arceus-Ground, and Zacian-C, and it soft checks non-Thunder Kyogre. Its resistances to moves like Necrozma-DM's Sunsteel Strike and Koraidon's Flare Blitz and—most importantly—its ability to beat Ho-Oh set it apart from its main competition in Arceus-Ground. Dragon Tail phazes setup sweepers like Necrozma-DM and Arceus formes, as well as chipping Pokemon such as Miraidon and Eternatus on the switch-in and racking up entry hazard damage. Alternatively, Taunt stops setup sweepers from boosting and Pokemon like Ting-Lu from laying entry hazards, and Stealth Rock greatly hinders Choice Band Ho-Oh and weakens defensive Pokemon for Arceus-Water's teammates. Tera Fairy lets Arceus-Water more comfortably take Koraidon's Low Kick and completely block its Scale Shot, denying it a Speed boost; Tera Fairy does make Arceus-Water weak to Necrozma-DM's Sunsteel Strike, however. Tera Poison also gives it a resistance to Low Kick, lets it absorb Toxic Spikes and Toxic from Eternatus, and improves its matchup against Wild Charge Zacian-C, albeit at the cost of leaving it vulnerable to foes like Necrozma-DM and Arceus-Ground. Both Tera types also help by removing Arceus-Water's weaknesses to Miraidon's Electro Drift and Calyrex-S's Grass Knot in a pinch. 16 Speed EVs let Arceus-Water outpace base 90 Speed foes such as Kyogre.</p> <p>Arceus-Water should be used on balance and bulky offense teams, where both offensive Pokemon and walls benefit from its defensive utility. Arceus-Water can switch into walls like Ho-Oh and Arceus-Ground and common revenge killers like Arceus and Choice Scarf Koraidon for offensive teammates such as Calyrex-S, Miraidon, Arceus, and Zacian-C. In return, Calyrex-S and Miraidon can threaten Eternatus, one of Arceus-Water's biggest problems, and Zacian-C can safely switch into Eternatus lacking a Fire-type move. Necrozma-DM appreciates Arceus-Water checking Koraidon and Arceus-Ground; additionally, Necrozma-DM helps handle Wild Charge Zacian-C, can take Choice Band Ho-Oh's Brave Bird—which 2HKOes Arceus-Water with entry hazards up—and is the best Eternatus check in the metagame. Ting-Lu can handle Calyrex-S, Miraidon, and, to a certain extent, Eternatus for Arceus-Water and appreciates it taking on Pokemon like Koraidon, Ho-Oh, and Zacian-C. Eternatus can check Kyogre and absorb Toxic Spikes for Arceus-Water, and Arceus-Water deals with Ground-types like Arceus-Ground and Ting-Lu. Ho-Oh likes that Arceus-Water checks Dragon Dance Arceus-Ground and some Kyogre and helps take on Pokemon like Koraidon and Arceus. Offensive Ho-Oh in particular can also potentially lure in and KO Eternatus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511181, "username": "Rose"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 584685, "username": "Glory"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Landorus-Therian": {
    "outdated": true,
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Landorus-T is an excellent physically defensive pivot that checks foes such as Koraidon, Zacian-C, Arceus, and Dragon Dance Arceus-Ground thanks to its rare Spikes immunity, Intimidate, and U-turn. Taunt denies entry hazards and status from Pokemon such as Ting-Lu and Toxapex and prevents foes like Arceus from continuously setting up in front of Landorus-T. Rocky Helmet punishes foes like Koraidon and Zacian-C for attacking by potentially putting them into range of attacks such as +2 Arceus's Extreme Speed, Calyrex-S's Astral Barrage, and Giratina-O's Shadow Sneak. Tera Water grants a resistance to attacks such as Koraidon's Flare Blitz and Zacian-C's Behemoth Blade, while Tera Fairy grants an immunity to Dragon, denying Scale Shot Koraidon a Speed boost and less importantly blocking moves like Miraidon's Draco Meteor. Landorus-T best fits on bulky offense teams, where it can support offensive teammates such as Calyrex-S, Zacian-C, Arceus, and Miraidon by setting Stealth Rock, safely pivoting them in to wallbreak, and checking revenge killers like Zacian-C and Choice Scarf Koraidon. Ting-Lu checks Pokemon like Calyrex-S, Miraidon, and Calm Mind Arceus-Ground for Landorus-T and provides its offensive teammates with Spikes support; Landorus-T checks strong physical attackers for it in return. Landorus-T lacks recovery, so partners like Arceus-Fairy, Arceus-Ground, and Zacian-C can assist it by checking Koraidon, opposing Zacian-C, and Arceus, respectively, with help from Intimidate; Choice Scarf Koraidon can also revenge kill these foes. Teammates like Koraidon, Giratina-O, and Eternatus deter Kyogre from using its STAB moves to an extent, but Kyogre can still force you to predict whether it will use a Water-type move or Ice Beam in the face of Landorus-T.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511181, "username": "Rose"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 584685, "username": "Glory"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Ribombee": {
    "sets": {
      "Sticky Web": {},
      "Lead": {
        "outdated": true,
        "description": "<p>Ribombee is a metagame-defining Sticky Web lead found in hyper offense teams due to its impressive Speed tier, notably outpacing maximum Speed invested Arceus formes, avoiding Taunt from them. Moonblast allows Ribombee to discourage Ting-Lu from laying entry hazards, Koraidon and Miraidon from setting up, and Giratina-O from using Defog. Stun Spore is used to cripple Pokemon that can otherwise use Ribombee as setup fodder such as Arceus formes and Zacian-C. Psychic is an option to hit Glimmora for super effective damage, deterring it from using Mortal Spin. Charm is also an alternative move that is used to annoy physical attackers, hindering them from setting up. Tera Ghost allows Ribombee to block Rapid Spin from leads like Great Tusk while also providing it with an immunity to Extreme Speed from Arceus. Tera Steel is an alternative option to block Mortal Spin from Glimmora. Teammates such as Koraidon, Zacian-C, Calyrex-S, Arceus-Ground, Extreme Killer Arceus, Miraidon, and Eternatus benefit heavily from Sticky Web being up, as it makes them much more difficult to revenge kill, with some such as Zacian-C and Eternatus also providing utility by blocking Mortal Spin from Glimmora and setting up Toxic Spikes, respectively. As Ribombee gets shut down by Taunt from Calyrex-S and Miraidon, offensive checks to them such as Extreme Killer Arceus and Arceus-Ground are preferred as teammates. As Ribombee lacks Taunt, another lead such as Arceus-Ground or Glimmora can be used to prevent entry hazards from opposing leads.</p>"
      }
    }
  },
  "Toxapex": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Toxapex is a solid physical wall that checks Pokemon such as Arceus, Choice Scarf Koraidon, Zacian-C, and Arceus-Fairy and absorbs annoying Toxic Spikes. Haze stops Pokemon like Swords Dance Arceus and Zacian-C from setting up and easily beating Toxapex. Infestation chips away at foes immune to Toxic, like Zacian-C, while Poison Jab hits Taunt Arceus-Fairy for decent damage and threatens to inflict it with poison. Baneful Bunker is a more niche option for the second moveslot that potentially poisons foes like Koraidon and Arceus at the risk of letting them set up. Toxic is more immediately threatening, but Toxic Spikes can potentially aid offensive teammates and annoy teams in the long term. Rocky Helmet punishes Koraidon for spamming U-turn and gives non-Infestation Toxapex a way of damaging Zacian-C. Tera Fairy provides an immunity to Koraidon's Scale Shot and Outrage and removes Toxapex's weakness to Ground-type moves from foes like Dragon Dance Arceus-Ground. Toxapex is primarily useful on balance teams, where Pokemon like Calyrex-S, Arceus, Arceus-Fairy, Miraidon, and Zacian-C benefit from it being able to switch into opposing Arceus, Zacian-C, and Choice Scarf Koraidon. Choice Specs Calyrex-S is an especially good teammate for Toxic Spikes Toxapex, as it threatens foes that can absorb Toxic Spikes, like Eternatus and opposing Toxapex, and can use Trick to remove a Pokemon's Heavy-Duty Boots. Arceus-Ground similarly threatens Poison-types, and it wears down the only relevant Defog user, Giratina-O. Arceus is also worth highlighting for its ability to check Calyrex-S and revenge kill weakened Scale Shot Koraidon. Ting-Lu appreciates Toxapex checking strong physical attackers, and it checks Calyrex-S, Miraidon, and Calm Mind Arceus-Ground for it in return. Choice Scarf Koraidon can revenge kill the Pokemon Ting-Lu checks as well as Wild Charge Zacian-C and Taunt Arceus, which Toxapex loses to.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511181, "username": "Rose"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 595062, "username": "Taka"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Necrozma-Dusk-Mane": {
    "overview": "<p>Necrozma-DM is the single most potent sweeper in Anything Goes, and it excels on every style of team. A terrific typing backed by Prism Armor and colossal bulk makes Necrozma-DM incredibly difficult to KO, allowing it to effortlessly leverage its immense natural power to set up and to win games on a dime. Necrozma-DM's unique defensive profile makes it the most consistent switch-in to Eternatus and the only Pokemon that can pivot into Choice Band Ho-Oh's Brave Bird; it also lets it check Arceus, Arceus-Fairy, Deoxys-A, and Zacian-C while deterring Dragon-type moves from Koraidon and Miraidon. Unparalleled versatility in choice of moves, EV spreads, and Tera types enables Necrozma-DM to pick and choose its answers like little else in the metagame. Despite this myriad of excellent traits, Necrozma-DM can be taken advantage of by powerful threats like Calyrex-S, Koraidon, Kyogre, and Arceus-Ground, while some common walls like Ting-Lu, Ho-Oh, and Arceus-Water are able to take Necrozma-DM's attacks and respond by crippling or phazing it.</p>",
    "comments": "<h3>Other Options</h3> <p>Bulky Necrozma-DM has many different less consistent options. It can use a specially defensive spread to take less damage from Calyrex-S's Astral Barrage and set up on Miraidon and defensive Arceus formes lacking Will-O-Wisp. However, the lack of physical defense or offensive power leaves Necrozma-DM unable to set up or do meaningful damage against most teams. Swords Dance can be used over Dragon Dance for more immediate power, but it struggles to make an impact in endgame scenarios. Sunsteel Strike can be dropped for Photon Geyser to do more damage to Ho-Oh and Arceus-Water, but this leaves Necrozma-DM walled by Ting-Lu and unable to do much damage to Calyrex-S.</p> <p>A defensive set consisting of Stealth Rock, Knock Off, Sunsteel Strike, and Moonlight might seem enticing, but such a set is extremely passive and fails to make progress against defensive Arceus formes.</p> <p>Necrozma-DM can effectively use nearly any Tera type to fill whatever role its team needs, but most options fail to help against its primary forms of counterplay and thus fail to have much effectiveness outside of niche circumstances.</p> <h3>Checks and Counters</h3> <p><strong>Ho-Oh</strong>: Ho-Oh can comfortably stomach any of Necrozma-DM's attacks besides Stone Edge and respond with a powerful Sacred Fire or by phazing it out with Whirlwind.</p> <p><strong>Calyrex-S</strong>: Calyrex-S can deal massive damage to Necrozma-DM with Astral Barrage and outspeed it even after a Dragon Dance boost, though it is unable to switch in safely and fails to OHKO a healthy Necrozma-DM.</p> <p><strong>Koraidon</strong>: Koraidon massively threatens Necrozma-DM with sun-boosted Flare Blitz, and Choice Scarf variants outspeed it even after it uses Dragon Dance multiple times.</p> <p><strong>Arceus Formes</strong>: Defensive Arceus formes, particularly Arceus-Water and Arceus-Ground, are able to take Necrozma-DM's attacks and respond by burning it with Will-O-Wisp or hitting it with a powerful Judgment. However, they are worn down quickly when switching in with multiple layers of Spikes up, especially if they are also tasked with checking Necrozma-DM's teammates.</p> <p><strong>Kyogre</strong>: Kyogre resists Sunsteel Strike and threatens to do major damage to Necrozma-DM, though it must be wary of Photon Geyser or Tera Water.</p> <p><strong>Ting-Lu</strong>: While unable to seriously threaten Necrozma-DM, Ting-Lu can take boosted hits from Necrozma-DM and use Whirlwind or weaken it with Ruination.</p> <p><strong>Necrozma-DM</strong>: Necrozma-DM is one of its own biggest obstacles. Variants without Earthquake are completely walled by opposing Necrozma-DM, and even those with Earthquake can lose to Tera Water.</p>",
    "sets": {
      "Bulky Dragon Dance": {
        "description": "<p>Necrozma-DM is an incredibly potent sweeper, leveraging its stellar defensive profile to set up on a plethora of common options like Arceus, Zacian-C, and Eternatus. Sunsteel Strike is the preferred STAB move over alternative options like Photon Geyser and Iron Head for its combination of power and coverage, which is especially notably against Ting-Lu, Calyrex-S, and defensive Arceus formes. Earthquake is the go-to coverage move for its ability to hit Miraidon, Zacian-C, and opposing Necrozma-DM for major damage. Entry hazard-stacking teams may get more use from Knock Off, which crucially removes Ho-Oh's and opposing Necrozma-DM's Heavy-Duty Boots while having the helpful property of always OHKOing Calyrex-S. On more offensive teams, Necrozma-DM can opt to run Stone Edge to lure in and OHKO Ho-Oh, though this leaves it floundering against opposing Necrozma-DM. Heavy-Duty Boots provides unrivaled longevity in the face of Ting-Lu's ever-present Spikes, allowing Necrozma-DM to switch in repeatedly without compromising its defensive presence or ability to set up. Tera Fire grants a crucial resistance Fire-type attacks, stymying Choice Scarf Koraidon's revenge killing attempts and turning offensive Ho-Oh into setup fodder; it additionally blocks Will-O-Wisp from the likes of Arceus-Ground and Arceus-Water. Tera Water resists Fire-type attacks too, resists Kyogre's powerful STAB moves, rids Necrozma-DM of its Ground-type weakness, and maintains its Steel-type resistance, letting it always beat opposing Necrozma-DM and defeat Dragon Dance Arceus-Ground one-on-one once boosted; though, this leaves it floundering against Ho-Oh and Will-O-Wisp Arceus formes. Tera Steel is a niche option on offensive sets with Stone Edge, boosting their power to the stratosphere and potentially letting them 2HKO opposing Necrozma-DM at +2, though they need prior chip damage against defensive Necrozma-DM, and it doesn't provide any defensive utility beyond removing their Ghost-type weakness. The given EV spread lets Necrozma-DM outspeed uninvested base 90 Speed Pokemon, non-Choice Scarf Calyrex-S after two Dragon Dances, and Adamant-natured Choice Scarf Koraidon after using Dragon Dance three times; the remaining EVs are put into Defense and used with an Impish nature to maximize its defensive prowess, allowing for ridiculous feats like letting it survive +1 Dragon Dance Arceus-Ground's Earthquake and stalling out Choice Scarf Koraidon's Flare Blitz due to Moonlight's increased healing in sun. Offensive teams can forgo the additional defensive investment for an offensive spread with an Adamant nature to markedly improve damage against Ting-Lu and defensive Arceus formes, though this results in considerably reduced bulk, which is especially noticeable against Koraidon.</p> <p>Few teams bar hyper offense don't appreciate Necrozma-DM's immense versatility as a powerful wincon. On more offensive teams, it works in tandem with other physical wallbreakers like Koraidon, Ho-Oh, Zacian-C, and Dragon Dance Arceus-Ground to overwhelm physical walls. Balance teams benefit greatly from Necrozma-DM's defensive utility—especially against Zacian-C—and provide it with a defensive backbone that enables it to bide its time until it can set up and end the game. Ting-Lu is Necrozma-DM's single best partner on any because it provides refuge from Calyrex-S and Miraidon seeking to take advantage of Necrozma-DM, and the Spikes it easily stacks hinder attempts to revenge kill Necrozma-DM from Choice Scarf Koraidon and Calyrex-S while wearing down common checks to Necrozma-DM in Ting-Lu, Arceus-Ground, and Arceus-Water. Ho-Oh is another wonderful partner for Necrozma-DM, checking Koraidon and Calyrex-S for it; in exchange, Necrozma-DM can switch into Eternatus and deter Choice Scarf Koraidon from using Outrage. Necrozma-DM loves to be paired with powerful wallbreakers like Calyrex-S, Koraidon, and Choice Band Ho-Oh, as these Pokemon excel at beating teams down into position for Necrozma-DM to checkmate them. Calyrex-S supports Necrozma-DM by doing major damage to Ho-Oh with its Choice Specs- or Nasty Plot-boosted attacks and weakening Ting-Lu, which can comfortably take hits from Necrozma-DM and phaze it out with Whirlwind. Koraidon can weaken defensive Arceus formes and force Ho-Oh to Terastallize into the Fairy-type from the threat of being 2HKOed by its Dragon-type moves and thus become weak to Sunsteel Strike. Ho-Oh is the nemesis of any Necrozma-DM lacking Stone Edge, as it can comfortably take most of its attacks and respond with the threat of a Sacred Fire burn or phazing with Whirlwind. As a result, having strong counterplay to Ho-Oh, such as Arceus-Water, Eternatus, or Miraidon, is necessary due to Ho-Oh's propensity for staying healthy. Defensive Arceus-Ground and Arceus-Water are other troublesome defensive checks to Necrozma-DM, so switch-ins to them, such as Ting-Lu or Ho-Oh for the former and Eternatus or Miraidon for the latter, are crucial. Kyogre, though wary of Knock Off or Tera Water, can often take advantage of Necrozma-DM to launch its powerful Water-type attacks, necessitating a Pokemon that can pivot into it like Eternatus, Miraidon, or Koraidon.</p>"
      },
      "Offensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 584685, "username": "Glory"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Grimmsnarl": {
    "outdated": true,
    "sets": {
      "Dual Screens": {
        "description": "<p>Grimmsnarl can reliably set dual screens thanks to Prankster, giving its offensive teammates an easier time setting up and making them harder to revenge kill. Bulkier teams are able to stall for the limited number of turns dual screens are active for, however. Play Rough has a decent chance to 2HKO Ting-Lu, which is immune to Prankster-boosted Taunt, stopping it from freely laying Spikes. Taunt prevents Pokemon such as Arceus formes from using Grimmsnarl as setup fodder; prevents Landorus-T, Glimmora, and Toxapex from setting entry hazards; and prevents Giratina-O from using Defog, while Parting Shot lets a teammate switch in more safely. Tera Ghost makes Grimmsnarl immune to Arceus's Extreme Speed, which has a higher priority than Prankster-boosted moves, and neutral to attacks like Zacian-C's STAB moves. Grimmsnarl is best used on hyper offense teams, where it can block Koraidon's Scale Shot in a pinch, sparingly take hits from Calyrex-S, and—most importantly—support setup sweepers such as Swords Dance Koraidon and setup Arceus formes. Zacian-C and Arceus-Ground can notably switch into Pokemon Grimmsnarl cannot safely stop from setting up such as Arceus-Fairy and opposing Zacian-C, respectively. Additionally, Nasty Plot Calyrex-S and Calm Mind + Agility Miraidon appreciate Grimmsnarl potentially weakening Ting-Lu, their primary defensive check. A hazard lead such as Glimmora can further support Grimmsnarl's offensive teammates by wearing down their checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511181, "username": "Rose"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 532881, "username": "Frozoid"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Zacian-Crowned": {
    "overview": "<p>Thanks to Zacian-C's high base Attack backed by Intrepid Sword, it cements itself as one of the strongest physical attackers in the metagame. Its excellent typing allows it to block Dragon-type attacks from Eternatus, Koraidon, and Miraidon; resist Extreme Speed from Arceus; and be immune to Toxic Spikes. However, Zacian-C is checked by multiple defensive Pokemon, most notably Necrozma-DM and Arceus-Ground, as they can take its attacks and force it to switch out. Furthermore, Calyrex-S is a huge threat because of its high Special Attack and Speed, being able to KO Zacian-C after minor chip damage. Choice Scarf Koraidon is also a threat, as it can OHKO Zacian-C with Flare Blitz.</p>",
    "comments": "<h3>Other Options</h3> <p>Substitute is a niche option that can take advantage of Eternatus and Pokemon Choice-locked into Dragon-type moves, allowing Zacian-C to set up without interruption. Substitute isn't the best choice for Zacian-C though, as losing important coverage moves like Wild Charge and Crunch lets it get walled by checks such as Necrozma-DM, Ho-Oh, and defensive Arceus formes. Tera Fire is a niche option that grants Zacian-C an immunity to burn from Ho-Oh and defensive Arceus formes such as Arceus-Water and Arceus-Fairy while also allowing it to resist Ho-Oh's Sacred Fire and Koraidon's Flare Blitz. However, Tera Fire makes Zacian-C weak to Stealth Rock, allowing Choice Scarf users such as Koraidon and Calyrex-S and priority users in Arceus to revenge kill it with ease. An alternate EV spread of 104 HP / 252 Atk / 152 Spe allows Zacian-C to outspeed both Koraidon and Miraidon, with the remaining EVs being put into HP, allowing it to survive an Earthquake from Necrozma-DM at -1 and making it harder for Calyrex-S to revenge kill it. However, this EV spread might struggle against opposing Zacian-C with maximum Speed and offensive Necromza-DM, so it is not always the best choice.</p> <h3>Checks and Counters</h3> <p><strong>Necrozma-DM</strong>: Physically defensive Necrozma-DM is one of the most common checks to Zacian-C, as it resists both of Zacian-C's main STAB moves and has moves like Earthquake and Sunsteel Strike that can potentially 2HKO it back.</p> <p><strong>Revenge Killers</strong>: Calyrex-S, as well as Choice Scarf users such as Koraidon and Miraidon, are able to outspeed Zacian-C. Calyrex-S can brute force its way through Zacian-C with Astral Barrage after minor chip damage or a Close Combat Special Defense drop, Koraidon is able to OHKO Zacian-C with Flare Blitz, and Miraidon 2HKOes Zacian-C with Electro Drift.</p> <p><strong>Defensive Arceus Formes</strong>: Bulky Arceus formes such as Arceus-Water and Arceus-Ground can be a problem for Zacian-C, as they can take hits from it and reliably heal themselves with Recover while also threatening it with Judgment or Will-O-Wisp.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Play Rough OHKOes Koraidon and Miraidon and 2HKOes Ting-Lu. Alternatively, Behemoth Blade is another high damage STAB move that has 100% accuracy and can hit most Pokemon for neutral damage, such as Arceus-Ground and Eternatus, while doing super effective damage to Arceus-Fairy. Wild Charge hits Ho-Oh, Kyogre, and Arceus-Water, OHKOing or doing major damage to them after Zacian-C uses Swords Dance. Crunch and Close Combat deal with Necrozma-DM, with the former also threatening Calyrex-S and the latter hitting Ting-Lu for Behemoth Blade sets and OHKOing Arceus. Tera Dark boosts Crunch's damage to let it break through Necrozma-DM more easily and prevents Zacian-C from getting 2HKOed by Calyrex-S's Astral Barrage. Tera Fighting increases the damage of Close Combat, which lets Zacian-C OHKO defensive Arceus formes at +3.</p> <p>Zacian-C struggles with Calyrex-S, which outspeeds it and threatens it with Astral Barrage, so Arceus and special walls such as Ho-Oh and Ting-Lu are needed to help check Calyrex-S. It is also weak to Choice Scarf users such as Koraidon and Calyrex-S, so it appreciates teammates that can either outspeed or outprioritize threats, such as Extreme Killer Arceus, Choice Scarf Koraidon, and Choice Scarf Calyrex-S. Bulky walls such as various Arceus formes can also help with Koraidon. Due to Necrozma-DM's high Defense stat, Zacian-C often struggles to break through it, so special attackers like Calyrex-S, Miraidon, Kyogre, and Calm Mind Arceus-Ground are good options to help deal with it. Multiple layers of Spikes significantly hinder Zacian-C's longevity, making it easier for revenge killers to KO it, so Taunt users like Deoxys-S on hyper offense and various Arceus formes can be useful to have on the team. Other good teammates include physical attackers such as Dragon Dance Arceus-Ground, Necrozma-DM, and Swords Dance Koraidon because they can help wear down the checks they share with Zacian-C, allowing them to break through walls more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604042, "username": "Cutecat1122"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 631210, "username": "Adhiraj8202"}, {"user_id": 584685, "username": "Glory"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Eternatus": {
    "sets": {
      "Specially Defensive": {},
      "Defensive": {
        "outdated": true,
        "description": "<p>Eternatus is usually seen on bulky offense and balance teams, as it is a decent check to Pokemon such as Arceus-Fairy and Kyogre, and it can set up and absorb Toxic Spikes. Flamethrower is used to hit Zacian-C, which can otherwise take advantage of Eternatus's inability to damage it. Dragon Tail phazes setup sweepers like Arceus and Calm Mind Kyogre, and it can also annoy switch-ins to Eternatus such as Ting-Lu and Clodsire with Toxic Spikes able to poison the former. Toxic is used to immediately put Pokemon such as Calm Mind Arceus formes on a timer, while Toxic Spikes is used to spread status across the opposing team. Tera Fairy makes Eternatus immune to Dragon-type moves from Pokemon such as Miraidon and Koraidon. Tera Water allows Eternatus to resist both Ice Beam from Kyogre as well as Behemoth Blade from Zacian-C. Tera Steel flips the matchup on Zacian-C, Koraidon, and Miraidon while resisting Arceus's Extreme Speed. 176 Speed EVs are used to outspeed Calm Mind Arceus formes that can otherwise take advantage of Eternatus with Taunt. 96 HP EVs allow Eternatus to live Dragon Claw from Jolly Koraidon at full HP. An alternative, bulkier spead spread of 212 HP / 252 SpD / 44 Spe can be run with a Calm nature, with 44 Speed EVs allowing Eternatus to outspeed Timid Kyogre. This spread, however, makes Eternatus vulnerable to Taunt Arceus formes such as Arceus-Fairy, so teammates that can revenge kill them, such as Zacian-C and Koraidon, or deal with then otherwise, such as Encore Calyrex-S, are appreciated. Eternatus is also able to lure in Ting-Lu and weaken it, so teammates that can take advantage of its ability to do so, such as Calyrex-S and Miraidon, are appreciated. Similarly, Pokemon such as Zacian-C, Extreme Killer Arceus, and Koraidon appreciate Eternatus's ability to take advantage of their checks such as Skeledirge and Arceus-Fairy, and they threaten Ting-Lu and Clodsire for it in return. Eternatus also appreciates teammates such as Landorus-T and Ting-Lu, which can set up additional entry hazards, while also providing Eternatus with refuge from the likes of Miraidon, Koraidon, Arceus-Ground, and Calyrex-S. Eternatus is a great fit for balance and bulky offense teams due to its ability to absorb Toxic Spikes, thus enabling offensive teammates such as Koraidon, Calyrex-S, and Arceus formes without Heavy-Duty Boots.</p>"
      },
      "Offensive": {
        "outdated": true,
        "description": "<p>Life Orb Eternatus is a good wallbreaker and most importantly a Toxic Spikes absorber that is usually seen on hyper offense teams. Both Fire Blast and Flamethrower are used for Zacian-C and Tera Steel Pokemon. Fire Blast is preferred because it OHKOes Zacian-C with one layer of Spikes, but Flamethrower is a more reliable, weaker alternative. Recover allows Eternatus to preserve its HP, allowing it to have its presence for longer in the game. After one Agility, Eternatus outspeeds the whole metagame, making it harder to revenge kill and potentially letting it clean up weakened teams. Since Agility makes Eternatus faster than the whole metagame, a Modest nature can be run for more power. Alternatively, Toxic Spikes can be run to rack up poison damage on foes for teammates. Tera Steel gives Eternatus a much-needed resistance to Dragon-type moves from Koraidon and Miraidon, Extreme Speed from Arceus, Psychic-type moves from Calyrex-S, and Steel- and Fairy-type moves from Zacian-C. Tera Fire also helps against Zacian-C, lets Fire Blast OHKO Tera Steel Giratina-O after Stealth Rock, and lets Flamethrower OHKO Zacian-C. Tera Dragon boosts Dynamax Cannon, 2HKOing bulky Arceus formes, 3HKOing Ting-Lu, and 2HKOing bulky Kyogre. Eternatus appreciates teammates that put pressure on Ting-Lu, which include Pokemon like Swords Dance Koraidon, Nasty Plot Calyrex-S, Extreme Killer Arceus, Arceus-Ground, and Arceus-Fairy. Calyrex-S, Eternatus, and Miraidon weaken Ting-Lu for each other, enabling one of them to potentially sweep. This allows Pokemon like Extreme Killer Arceus, Arceus-Fairy, and Arceus-Ground to use Eternatus getting revenge killed as an opportunity. Extreme Killer Arceus can use Choice-locked Calyrex-S as an opportunity to set up Swords Dance, Arceus-Fairy can use Koraidon to set up Calm Mind, and Arceus-Ground can threaten out Zacian-C, enabling it to set up Dragon Dance or Calm Mind. Hyper offense leads such as Ribombee, which lets Eternatus outspeed the entire unboosted metagame, and Glimmora, which sets up entry hazards to weaken checks such as Ting-Lu, are appreciated.</p>"
      }
    }
  },
  "Calyrex-Shadow": {
    "overview": "<p>Calyrex-S is the most prominent, centralizing threat in Anything Goes by virtue of its nigh-unmatched Speed tier and variety of offensive options. Astral Barrage shreds through neutral targets, and Calyrex-S is able to overcome its defensive checks by using its broad selection of coverage, Tera types, utility, and item options. Additionally, thanks in part to its ability As One, Calyrex-S can snowball late-game when its checks are worn down. However, Calyrex-S's bulk is rather unimpressive, limiting its ability to switch in aggressively or set up on defensive Pokemon. Calyrex-S also struggles early-game against Pokemon resistant to Ghost, such as Arceus, Arceus-Dark, and Ting-Lu, as they are able to halt its momentum by switching in to Astral Barrage. Additionally, Ho-Oh's high Special Defense and access to Regenerator allow it to pivot into Choice item variants of Calyrex-S.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Calyrex-S is a phenomenal speed control option on balance and bulky offense teams. Its Speed stat eclipses that of other Choice Scarf users, such as Koraidon and Miraidon; moreover, it is able to reliably revenge kill 1+ Scale Shot Koraidon, setting it apart from its aforementioned competitors. As One allows Calyrex-S to snowball in endgame scenarios. Grass Knot weakens Ting-Lu, which can otherwise switch in and use Spikes. Psychic lets Calyrex-S OHKO Koraidon while also dealing significant chip damage to bulky Arceus. Lastly, Trick cripples Calyrex-S's main defensive checks in Ting-Lu, Arceus, and Ho-Oh, which its teammates can take advantage of. Tera Ghost furthers the strength of Astral Barrage, which secures KOs on weakened targets such as Miraidon and Zacian-C and allows Calyrex-S to 2HKO Ho-Oh. Alternatively, Calyrex-S can opt for Tera Grass in order to 2HKO Ting-Lu with Grass Knot and OHKO both Kyogre and Arceus-Ground after minimal chip damage.</p> <p>Most forms of balance and bulky offense should consider adding Choice Scarf Calyrex-S, as it provides teams with a reliable option to revenge kill Scale Shot Koraidon. Calyrex-S being a team's Choice Scarf user can give Koraidon the freedom to use a different item. Calyrex-S synergizes well with Pokemon that can take advantage of Astral Barrage switch-ins like Arceus, Arceus-Dark, and Ting-Lu. Powerful wallbreakers such as Koraidon, Zacian-C, and Kyogre are capable of this. Partners that can wear down Ting-Lu throughout the game, such as Eternatus and Miraidon, can help ease the burden on Calyrex-S. Because Ho-Oh can pivot into Calyrex-S's moves, wallbreakers such as Swords Dance Koraidon, offensive Ho-Oh, and Necrozma-DM that can wear Ho-Oh down serve as excellent teammates. Calyrex-S appreciates support from entry hazard setters, namely Ting-Lu and Eternatus, in order to secure KOs late-game. Arceus-Water is a reliable defensive switch-in to Arceus and Ho-Oh, and it can stop any offensive momentum they gain at Calyrex-S's expense.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Calyrex-S is an excellent wallbreaker, independently breaking through most of its usual checks with accurate prediction. Grass Knot most importantly 2HKOes Ting-Lu, as well as pressuring neutral targets like Arceus and OHKOing Arceus-Water and Arceus-Ground after entry hazard damage. Psychic 2HKOes Arceus, while Psyshock 2HKOes offensive Ho-Oh, has a better chance of OHKOing Eternatus, and hits Pokemon such as Blissey. Trick + Choice Specs debilitates Calyrex-S's checks like Ho-Oh, Ting-Lu, and Arceus by removing the longevity their items grant them and forcing them to attack. Tera Ghost allows Astral Barrage to 2HKO Ting-Lu with less chip damage, OHKO Ho-Oh with an As One boost, and OHKO Necrozma-DM with a neutral Tera type, in addition to 2HKOing Ho-Oh and defensive Arceus formes after Calyrex-S loses its Choice Specs because of Trick. Tera Grass gives Grass Knot a good chance of OHKOing Ting-Lu after hazard damage and lets it 2HKO Arceus; Tera Grass also grants Calyrex-S a resistance to Dragon Dance Arceus-Ground's Earthquake. Tera Normal prevents revenge killing attempts from opposing Calyrex-S. All three Tera types also allow Calyrex-S to survive attacks like Ting-Lu's Payback and Arceus's Shadow Claw, though the latter two make it vulnerable to Arceus's Extreme Speed.</p> <p>Calyrex-S is best used on balance and bulky offense teams, where it can pressure various defensive Pokemon and rely on its teammates to deal with revenge killers. Koraidon can threaten Ting-Lu and Arceus for Calyrex-S and use U-turn to safely bring it in against Pokemon it threatens like Arceus-Water and Arceus-Ground; additionally, the pair can wear down Ho-Oh for each other. Similarly, Zacian-C and Calyrex-S can deal with each other's checks and overwhelm Ho-Oh together. Kyogre threatens Ting-Lu and Ho-Oh for Calyrex-S, which can pressure Eternatus for it. Necrozma-DM appreciates Calyrex-S weakening Ting-Lu and Ho-Oh and threatening its checks like Arceus-Water and Arceus-Ground; in return, it can somewhat deal with Arceus and potentially lure in and KO Ho-Oh with Stone Edge. Ho-Oh can switch into Arceus, Choice Scarf Calyrex-S, and Ting-Lu, and Calyrex-S can deal with two of Ho-Oh's primary checks in Eternatus and Arceus-Water. Ting-Lu can also check Choice Scarf Calyrex-S, as well as wearing foes down into Calyrex-S's KO range via Spikes, which it potentially trades with opposing Ting-Lu. Miraidon and Calyrex-S can weaken Ting-Lu for each other, and Miraidon can switch into and threaten Ho-Oh. Defensive Arceus formes—namely Arceus-Water, Arceus-Ground, and Arceus-Fairy—can check Choice Scarf Koraidon and Arceus, and the former can also deal with Ho-Oh.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Nasty Plot Calyrex-S is a superb wallbreaker and sweeper that provides a ton of incredible utility by virtue of its nigh unmatched Speed tier and immense power, keeping an armada of different threats, most notably Necrozma-DM and Koraidon, in check. Grass Knot is crucial coverage that hits Ting-Lu hard, which would otherwise comfortably wall Calyrex-S, and deals extra damage to Arceus-Ground, Arceus-Water, and Kyogre. Psychic OHKOes Koraidon, 2HKOes Eternatus, and is Calyrex-S's strongest option against Arceus. Alternatively, Encore enables Calyrex-S to aggressively switch in on any attempts to heal or set up from nearly any relevant Pokemon in the metagame, generating free turns to use Nasty Plot or fire off powerful attacks. Calyrex-S can also run Psyshock as its strongest move against Eternatus—OHKOing after a boost from As One—and hits Calm Mind users like Kyogre or Arceus-Ground; it's also Calyrex-S's best move for niche walls like Blissey and Clodsire. Heavy-Duty Boots allows Calyrex-S to repeatedly switch in with impunity and bludgeon its checks until it can break through them. Life Orb is an alternative on hyper offense teams that gives Calyrex-S ludicrous power, letting it OHKO supposed answers like Ho-Oh and Ting-Lu after a Nasty Plot. Tera Stellar boosts Calyrex-S's power just enough to hit multiple important thresholds once boosted, OHKOing Ho-Oh and offensive Arceus, as well as Ting-Lu after two layers of Spikes. Sets lacking a Psychic-type attack can run Tera Ghost to 2HKO Eternatus and Ho-Oh while the lessened Ghost- and Dark-type weaknesses enables Calyrex-S to survive Arceus's Shadow Claw and Ting-Lu's Payback. Tera Normal is an option on Life Orb variants to turn the tables on Giratina-O and opposing Choice Scarf Calyrex-S, as these sets do not need the additional firepower provided by an offensive Tera, albeit at the cost of becoming vulnerable to Arceus's Extreme Speed. Tera Grass allows Calyrex-S to survive a boosted Earthquake from Dragon Dance Arceus-Ground and always OHKO Ting-Lu and offensive Arceus at +2.</p> <p>Nasty Plot Calyrex-S is a potent addition to nearly every kind of team. Balance and bulky offense teams love it for its potency as a wallbreaker that provides immense utility as a revenge killer and by potentially using Encore, whereas it is borderline mandatory on hyper offense due to its unmatched explosivity and Speed. Koraidon is Calyrex-S's best partner on every kind of team, terrifying Arceus and Ting-Lu while amplifying the pressure placed upon Ho-Oh; on bulkier teams, it takes the mantle of being the team's Choice Scarf user that Calyrex-S must forfeit by opting for Nasty Plot, whereas on hyper offense, it backs up Calyrex-S as one of the core setup sweepers and wallbreakers. Ting-Lu is a great partner for its overall immense defensive utility and capability to answer Choice Scarf Calyrex-S, and its Spikes can wear down opposing Ting-Lu and defensive Arceus formes into range for Calyrex-S to KO them. Ho-Oh provides refuge from Choice Scarf Calyrex-S and Koraidon, the most common revenge killers of Calyrex-S, as well as checking Arceus and Ting-Lu. Ho-Oh is a major nuisance for Calyrex-S, so switch-ins to it like Eternatus or Arceus-Water are important to have. On hyper offense, suicide leads like Deoxys-S, Ribombee, and Glimmora can set entry hazards to weaken foes for Calyrex-S and its teammates or—in Ribombee's case—hinder revenge killers.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 511181, "username": "Rose"}, {"user_id": 541114, "username": "PrimalKyogre"}, {"user_id": 584685, "username": "Glory"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 584685, "username": "Glory"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 523866, "username": "UT"}, {"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Skeledirge": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Skeledirge is a good physical wall, acting as an important check to Koraidon, Zacian-C, and Extreme Killer Arceus. It can switch into these powerful Swords Dance sweepers, beating them or halting their sweep. Torch Song allows it to potentially sweep a weakened team late-game. Earth Power is an option that chips Miraidon and Eternatus as well as giving it a super effective hit against Tera Fire Zacian-C and Koraidon. Fairy is the ideal Tera type, giving Skeledirge an immunity to Koraidon's Dragon-type attacks and removing its weaknesses to Ground- and Ghost-type attacks from foes like Arceus-Ground, Calyrex-S, and Giratina-O. Tera Flying is a niche option that further improves its matchup against Arceus-Ground while avoiding super effective Behemoth Blade from Zacian-C. Skeledirge is a good fit on balance teams that appreciate it checking common setup threats and carrying teammates that make up for its shortcomings and bad matchups. Skeledirge is very vulnerable to Miraidon, Kyogre, Calyrex-S, and Arceus-Ground, so it appreciates teammates like Ting-Lu, Eternatus, Wo-Chien, and Giratina-O to handle these powerful attackers. Likewise, Skeledirge pairs well with fast attackers and priority users such as Calyrex-S, Choice Scarf Koraidon, and Extreme Killer Arceus, which can threaten the foes that force Skeledirge out and revenge kill Pokemon it checks if it is overwhelmed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540420, "username": "Gimmicky"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 584685, "username": "Glory"}, {"user_id": 511181, "username": "Rose"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Glimmora": {
    "outdated": true,
    "sets": {
      "Entry Hazard Lead": {
        "description": "<p>Glimmora is an excellent entry hazard lead due to its ability Toxic Debris and access to Mortal Spin, which helps it prevent hazards from opposing leads such as Ribombee while also inflicting poison on opposing Pokemon. Dazzling Gleam is used to OHKO Koraidon, which may otherwise use Glimmora as setup fodder, and significantly dent Defog Giratina-O. Memento is used to remove any boosts obtained by Pokemon trying to set up on Glimmora while also gaining momentum. Mud Shot is used to deter setup from the likes of Zacian-C, Calyrex-S, and Calm Mind Arceus formes. Tera Steel enables Glimmora to spinblock opposing Glimmora. Tera Fairy grants an immunity to Scale Shot from Koraidon, which may otherwise break through Glimmora's Focus Sash. Tera Ghost is an alternative option to prevent Rapid Spin from opposing leads such as Great Tusk. A bulky EV spread of 80 Def / 224 SpA / 204 Spe with a Bold nature can be used to prevent Scale Shot Koraidon from OHKOing non-Terastallized Glimmora. Alternatively, maximum Speed investment allows Glimmora to outpace Taunt defensive Arceus formes. As Glimmora fits best on hyper offense teams, teammates that benefit from the hazards set by it such as Calyrex-S, Calm Mind Arceus-Ground, Miraidon, Koraidon, Extreme Killer Arceus, and Zacian-C are appreciated. Grimmsnarl is also a good partner for Glimmora, with Grimmsnarl being able to set dual screens after Glimmora has set up entry hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609321, "username": "eavo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Clodsire": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<p>Clodsire's solid special bulk, access to entry hazards, and ability to absorb Toxic Spikes give it a niche in checking Miraidon, Arceus-Fairy, and some variants of Calyrex-S. However, it faces competition from Ting-Lu, which similarly checks Miraidon and Calyrex-S, has more offensive pressure, and gets Spikes up more easily. Spikes and Toxic Spikes give Clodsire a way to exert offensive pressure, alongside Earthquake which punishes Miraidon and Zacian-C on switch-in. Poison Jab can be used over Toxic or Toxic Spikes to potentially punish Taunt variants of Arceus-Fairy, but it is generally outclassed by the other options. Water Absorb makes Clodsire a more solid check to Miraidon, since Unaware ignores Draco Meteor's Special Attack drop, and lets Clodsire check Arceus-Water and variants of Kyogre without Substitute. Unaware is an alternative checks Calyrex-S more consistently. Tera Steel flips Clodsire's weakness to Ice- and Psychic-type attacks such as Kyogre's Ice Beam and Calyrex-S's Psyshock, while making Clodsire more reliable into Miraidon's Draco Meteor. Tera Dark makes Clodsire weaker to Arceus-Fairy and Miraidon, but checks Calyrex-S without a Fighting- or Fairy-type move, as well as Calm Mind Arceus-Ground. Clodsire's ability to both absorb Toxic Spikes and check various special attackers gives it a niche on balance and stall teams. Clodsire pairs well with physical walls such as Gliscor, Toxapex, Dondozo, and Skeledirge, as they can check Koraidon, physical variants of Arceus formes, and Zacian-C. Secondary special walls such as Blissey are appreciated to ease the burden on Clodsire against Calyrex-S, Calm Mind Arceus-Ground, and Kyogre. Wo-Chien also checks these threats and helps against Dragon Dance variants of Arceus-Ground. Arceus is another partner for Clodsire that can pivot into Calyrex-S on balance teams, and appreciates Clodsire setting Spikes and clearing Toxic Spikes for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595062, "username": "Taka"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 306317, "username": "katerina"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Kingambit": {
    "outdated": true,
    "sets": {
      "Swords Dance": {
        "description": "<p>Thanks to Supreme Overlord, STAB-boosted Sucker Punch acting as vital priority, and its high Attack, Kingambit cements itself as a good late-game cleaner and revenge killer, that offensively checks Arceus and Calyrex-S. Swords Dance-boosted Kowtow Cleave allows Kingambit to 2HKO Toxapex and Landorus-T. Iron head hits Arceus-Fairy and other Tera Fairy Pokemon such as Toxapex and Skeledirge. Dread Plate is the preferred item of choice because it boosts Kingambit's Dark-type moves, allowing Sucker Punch to more effectively clean up late-game. Alternatively, Leftovers provides Kingambit with more longevity throughout the game, allowing it to potentially outlast its checks. 132 Speed EVs allow Kingambit to outspeed Skeledirge. Tera Dark boosts Kingambit's Dark-type moves to horrifying levels, allowing it to OHKO Landorus-T, Eternatus, offensive Arceus-Ground, and Miraidon at +2, and OHKO Toxapex with 1 layer of Spikes at +2. +2 Tera Dark Sucker Punch with 5 allies fainted allows Kingambit to achieve amazing feats, such as OHKOing Extreme Killer Arceus and offensive Arceus-Ground, as well as 2HKOing Koraidon and Zacian-C after 1 layer of Spikes. On the other hand, Tera Flying lets Kingambit set-up against Pokemon such as Ting-Lu, Arceus-Ground, Landorus-T, and Koraidon. Tera Fire makes Kingambit immune to Will-O-Wisp from Skeledirge, Giratina-O, and defensive Arceus formes and gives it a much-needed resistance to attacks like Koraidon's Flare Blitz and Zacian-C's STAB moves. Kingambit struggles with Toxapex, Landorus-T, and defensive Arceus formes, so offensive checks to them such as Arceus-Ground, Calyrex-S, and Miraidon are appreciated. Kingambit also struggles with Koraidon and Arceus-Ground, so checks to them such as Toxapex, Landorus-T, and Ting-Lu are appreciated. Teammates such as Arceus, Koraidon, and Zacian-C weaken physical walls like Skeledirge, Toxapex, and Landorus-T for Kingambit. Arceus in particular shares the burden of checking Calyrex-S alongwith Kingambit. Glimmora as a suicide lead can set up entry hazards, which Kingambit appreciates to break through defensive Arceus formes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 631210, "username": "Adhiraj8202"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 306317, "username": "katerina"}, {"user_id": 511181, "username": "Rose"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Wo-Chien": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<p>Wo-Chien's unique typing and movepool backed by its high, Tablets of Ruin-boosted bulk grants it a solid place in the metagame, checking threats such as Calyrex-S, Arceus-Ground, and Kyogre. Leech Seed reduces Wo-Chien's passivity while allowing teammates to heal after switching in. Ruination hits foes like Arceus-Fairy, Ting-Lu, and Giratina-O. Foul Play is a stronger alternative against physical attackers like Arceus and Dragon Dance Arceus-Ground that also does a decent chunk of damage to Koraidon and Zacian-C and allows Wo-Chien to punish physical attackers that have Taunt. Knock Off gives Wo-Chien more of a niche due relevant Pokemon that learn it being rare, and it is useful against foes like Ting-Lu and Landorus-T. However, Arceus formes, which can absorb Knock Off without losing their items, are quite omnipresent. Protect lets Wo-Chien safely rack up Leftovers and Leech Seed recovery. Alternatively, Taunt shuts down setup and entry hazard Pokemon such as Arceus formes and Ting-Lu on the switch. Tera Poison gives Wo-Chien key resistances to attacks like Koraidon's Low Kick, Zacian-C's Play Rough, Double Dance Miraidon's Dazzling Gleam, and the omnipresent U-turn from foes like Landorus-T, Koraidon, and Miraidon while also offering an immunity to Toxic and letting Wo-Chien absorb Toxic Spikes. However, Tera Poison also makes Wo-Chien weak to Ground-type moves from Arceus-Ground and Psychic-type moves from Calyrex-S, respectively. Wo-Chien fits best on balance and bulky offense teams that appreciate its ability to check Calyrex-S and Arceus-Ground while offering good recovery via Leech Seed to teammates. Wo-Chien benefits from teammates such as Skeledirge, Toxapex, and Landorus-T, which check Koraidon and Zacian-C for it. Special attackers in Arceus-Fairy, Substitute Kyogre, and Eternatus trouble Wo-Chien, so offensive checks to them such as Zacian-C, Choice Scarf Koraidon, Arceus, and Calyrex-S are appreciated. Water Absorb Closdire as a defensive teammate checks Arceus-Fairy, Kyogre, and Eternatus while setting up hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 631210, "username": "Adhiraj8202"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 584685, "username": "Glory"}, {"user_id": 306317, "username": "katerina"}, {"user_id": 595062, "username": "Taka"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ting-Lu": {
    "overview": "<p>Ting-Lu is a dominant presence in Anything Goes, filling the role of the metagame's most crucial defensive glue while simultaneously providing indispensable offensive support. Ting-Lu is blessed with a fantastic typing that—in tandem with its titanic, Vessel of Ruin-boosted bulk—makes it the single best switch-in to Miraidon, one of the most consistent Calyrex-S checks, and a soft check to Necrozma-DM, Eternatus, and a plethora of other threats. This incredible defensive profile grants Ting-Lu many opportunities to set multiple layers of Spikes, making it that much harder for the foes to weather hits from its teammates. This unrivaled combination of traits means that Ting-Lu should be used on nearly every team bar hyper offense ones. Though, as fantastic as Ting-Lu is, its omnipresence means that methods to limit its impact or take advantage of it are common. Koraidon and Kyogre are able to exploit Ting-Lu to facilitate their wallbreaking, and common Pokemon like Miraidon and various Arceus formes can use Taunt to prevent Ting-Lu from setting Spikes. Furthermore, Ting-Lu is entirely reliant on Leftovers for healing, so Knock Off or any status condition greatly reduces its longevity.</p>",
    "comments": "<h3>Other Options</h3> <p>Ting-Lu has plenty of fringe options. Fissure can be used in a similar vein to Ruination, punishing switch-ins and OHKOing bulky sweepers that would typically beat Ting-Lu, though its inherent inconsistency and inability to touch Ho-Oh mean that it is generally inferior. Protect can be used to gain additional healing from Leftovers and scout Choice Scarf Koraidon's attacks, though this means giving up a valuable moveslot for minimal upsides. Stealth Rock can be used to stack additional passive damage on top of Spikes, though the difficulty of fitting it into Ting-Lu's moveset and lack of general effectiveness over Spikes mean that it is usually better delegating Stealth Rock to a partner like Arceus-Water, if it's run at all. Similarly, Taunt can be used, with some extra Speed investment, to gain an advantage over opposing Ting-Lu, though this has minimal other use and struggles to fit into Ting-Lu's cramped moveset. A wide variety of Tera types can be used, such as Steel and Fairy, to fill whatever niche is required; these have far less overall use than Tera Grass or Tera Poison though.</p> <h3>Checks and Counters</h3> <p><strong>Koraidon</strong>: Koraidon heavily threatens Ting-Lu with its powerful Low Kick and can switch into it with relative safety, though it doesn't appreciate getting hit by Ruination or Earthquake.</p> <p><strong>Kyogre</strong>: Kyogre deals massive damage to Ting-Lu and can typically use it as an entry point; Tera Grass Ting-Lu can turn the tables against it though.</p> <p><strong>Ho-Oh</strong>: Ting-Lu is incapable of doing much damage to Ho-Oh, and it can get crippled by a Sacred Fire burn or take a lot of damage from offensive sets. Ho-Oh doesn't immediately force Ting-Lu out though, and it can often allow multiple layers of Spikes to go up.</p>",
    "sets": {
      "Entry Hazard Support": {
        "description": "<p>Massive bulk, a great movepool, and an absolute godsend of a typing cement Ting-Lu as a core part of the metagame, checking key threats like Calyrex-S, Miraidon, and Necrozma-DM. Spikes are an essential part of Ting-Lu's kit, chipping key defensive walls like Arceus-Ground, Arceus-Water, and opposing Ting-Lu into KO range of the powerful wallbreakers that it is often paired with, in addition to limiting common revenge killers like Choice Scarf Calyrex-S and Koraidon; futhermore, the dearth of relevant entry hazard removal means that each layer of Spikes is usually permanent. Earthquake does large amounts of damage to Miraidon and Eternatus and is a decently strong hit on most neutral targets. Ruination is an important tool for limiting Ting-Lu's switch-ins and forcing Arceus formes to use Recover, as well as being the best move to weaken opposing Ting-Lu. Payback can be run over either Earthquake or Ruination to OHKO Calyrex-S for teams that are weaker to it, though this will result in Ting-Lu either struggling against Miraidon or failing to punish switch-ins, depending on which move is replaced. Whirlwind allows Ting-Lu to handle setup sweepers like Necrozma-DM and Arceus-Ground, as well as racking up additional damage from Spikes. Tera Grass can turn the tables on Kyogre and makes Ting-Lu an effective check to Dragon Dance Arceus-Ground. Tera Poison instead lets Ting-Lu resist Koraidon's Low Kick and Fairy-type attacks from Zacian-C and Arceus-Fairy, be immune to Eternatus's Toxic, and remove Eternatus's Toxic Spikes, albeit at the cost of becoming weak to Psychic- and Ground-type attacks from Calyrex-S, Necrozma-DM, and Arceus-Ground. Both Tera types additionally let Ting-Lu resist Calyrex-S's Grass Knot.</p> <p>Ting-Lu is so incredible that it's hard to find reasons not to use it. It can slot into any playstyle besides hyper offense and likely improve the team. That being said, Ting-Lu's glaring weakness to Koraidon necessitates partners that can handle it, such as Ho-Oh and defensive Arceus formes. Kyogre is another troublesome wallbreaker, so teammates that can pivot into it like Eternatus, Koraidon, and Miraidon are greatly appreciated, with Eternatus additionally absorbing Toxic Spikes for Ting-Lu. Reliance on Leftovers for healing means that Ting-Lu can be overwhelmed by Miraidon and Calyrex-S, so backup checks to them like Arceus-Ground for the former and Ho-Oh or Arceus for the latter are very important. Almost every offensive threat benefits from Ting-Lu's Spikes digging into its checks, as well as the backbone it provides against Calyrex-S and Miraidon. Koraidon and Miraidon are especially notable partners, as they can maintain momentum with U-turn to accrue additional entry hazard damage on defensive Arceus formes and Ting-Lu, respectively, with Koraidon also taking advantage of opposing Ting-Lu attempting to trade hazards with Ting-Lu. Necrozma-DM is another teammate that benefits greatly from Ting-Lu's Spikes support weakening opposing teams to the point where it can sweep with Dragon Dance, and it provides additional support as a check to Zacian-C and another pivot for Eternatus, while Ting-Lu can check Calyrex-S for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 584685, "username": "Glory"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Koraidon": {
    "overview": "<p>Koraidon is one of the most dominant and ubiquitous threats in AG thanks to its impressive Speed tier and Attack, which establish it as both a formidable revenge killer and an effective wallbreaker. Koraidon can overcome its defensive checks thanks to its expansive movepool, which gives it the option to run Swords Dance + Scale Shot. However, Koraidon's ability to switch in repeatedly is significantly hindered Spikes and Toxic Spikes. Additionally, Koraidon's reliance on Flare Blitz diminishes its longevity. Nevertheless, Koraidon's versatile movepool and Tera type options cement it as a staple on every offensive team.</p>",
    "comments": "<h3>Other Options</h3> <p>Choice Scarf Koraidon can opt to counter Ribombee with Dual Wingbeat, preventing it from setting up Sticky Web, though this comes at the cost of being heavily matchup reliant. Sacrificing its crucial STAB coverage in Outrage also worsens its effectiveness against Ho-Oh. A Choice Band, when used in conjunction with Close Combat and Tera Fighting, boosts Koraidon's power to monumental levels and allows it to achieve absurd feats such as 2HKOing defensive Ho-Oh and brute forcing through Necrozma-DM and bulky Arceus formes. Alternatively, Koraidon can run Tera Fairy, which enables it to serve as an emergency check to opposing Choice-locked Koraidon.</p> <h3>Checks and Counters</h3> <p><strong>Kyogre</strong>: Kyogre nullifies Koraidon's sun with Drizzle and can 2HKO it with Ice Beam. Additionally, Kyogre can paralyze Koraidon with Thunder Wave, rendering its Choice Scarf ineffective. However, Kyogre cannot switch directly into Outrage or Low Kick.</p> <p><strong>Revenge Killers</strong>: Revenge killers such as Choice Scarf Calyrex-S and Zacian-C can OHKO Koraidon with Psychic and Play Rough, respectively. Zacian-C in particular can easily take down Choice Scarf Koraidon if it locked into Outrage.</p> <p><strong>Bulky Arceus Formes</strong>: If healthy, bulky Arceus formes are not 2HKOed by any of Choice Scarf Koraidon's attacks. Additionally, Arceus-Fairy is immune to Dragon-type attacks and resists Low Kick and U-turn, while Arceus-Water resists Flare Blitz.</p> <p><strong>Ho-Oh</strong>: Ho-Oh can pivot into Koraidon's attacks, bar its Dragon-type STAB moves, and use Tera Fairy to lure in Koraidon and OHKO Koraidon with Brave Bird.</p> <p><strong>Dondozo</strong>: With its tremendous bulk and Unaware, Dondozo can easily switch into Koraidon, recover with Rest, and retaliate with Avalanche.</p> <p><strong>Gliscor</strong>: Gliscor can safely switch into Choice Scarf Koraidon and heal itself thanks to Poison Heal and Protect. However, it must be cautious of Swords Dance sets, as a +2 Flare Blitz or Scale Shot can OHKO Gliscor.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Koraidon is one of the premier speed control options and revenge killers in the metagame. Flare Blitz, when boosted by Orichalcum Pulse's sun, provides excellent neutral coverage against Steel-, Fairy-, and Ghost-types such as Necrozma-DM, Arceus-Fairy, and Calyrex-S. Low Kick, with its 120 Base Power against most of the metagame, avoids the stat drops of Close Combat and OHKOes Arceus and Ting-Lu after one layer of Spikes while reliably damaging Arceus-Ground and Arceus-Water. Outrage is generally preferred over Dragon Claw due to its ability to 2HKO Ho-Oh and OHKO Calyrex-S and Eternatus. However, it makes Koraidon vulnerable to revenge killing attempts by Fairy-types such as Arceus-Fairy, Zacian-C, and Tera Fairy Ho-Oh. U-turn provides essential pivoting capabilities and allows Koraidon to finish off weakened foes without the concern of them Terastallizing into a type that's immune to one of its STAB moves. A Jolly nature can be used to outspeed +1 Jolly Dragon Dance Necrozma-DM after Sticky Web, outspeed +1 Jolly Dragon Dance Arceus-Ground, and Speed tie with opposing Choice Scarf Miraidon and Koraidon. An Adamant nature enables Koraidon to 2HKO bulky Arceus formes after one layer of Spikes or Stealth Rock and secure a guaranteed OHKO on Calyrex-S. Tera Fire allows Flare Blitz to OHKO Necrozma-DM and 2HKO Arceus-Fairy and Arceus-Ground; it also grants Koraidon burn immunity while making it neutral to Psychic-type moves from Calyrex-S and Necrozma-DM. However, Tera Fire flips Koraidon's resistance to Stealth Rock into a weakness, severely limiting its ability to switch in repeatedly. Tera Ghost provides Koraidon with immunities to Fighting- and Normal-type moves, allowing it to turn the tables against opposing Koraidon and Extreme Killer Arceus. Additionally, it allows Koraidon to take neutral damage from Psychic- and Dragon-type attacks from Necrozma-DM, Calyrex-S, and Eternatus. The primary downside of Tera Ghost is its weakness to Calyrex-S's Astral Barrage.</p> <p>Choice Scarf Koraidon is an incredibly powerful asset to balance and bulky offense teams thanks to its game-defining pivoting and wallbreaking abilities. However, Koraidon struggles against bulky Arceus formes like Arceus-Fairy and Arceus-Water, as the former resists Low Kick, (comma) and the latter resists Flare Blitz. Defensive Ho-Oh also poses a challenge for Koraidon to break through. As a result, Kyogre and Ho-Oh make excellent teammates, applying pressure on opposing Ho-Oh and bulky Arceus formes. In return, they greatly benefit from Koraidon's pivoting allowing them to enter the battlefield safely. Koraidon also pairs well with Calyrex-S, whose unmatched Special Attack and Speed stats can dismantle Koraidon's aforementioned checks. Physical attackers in Dragon Dance Arceus-Ground and Necrozma-DM are also invaluable teammates, as they can dispose of Ho-Oh with Stone Edge while continually pressuring bulky Arceus formes. Miraidon is another outstanding partner that complements Koraidon perfectly, as both can safely bring in the other, with Koraidon forcing out Ting-Lu and Miraidon pressuring Ho-Oh. Lastly, Koraidon benefits from being paired with entry hazard setters such as Ting-Lu, Landorus-T, and Eternatus, which not only provide critical support with Spikes, Stealth Rock, and Toxic Spikes but also check significant threats such as Calyrex-S, opposing Koraidon, and Kyogre, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 631210, "username": "Adhiraj8202"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 511624, "username": "Fc"}, {"user_id": 532881, "username": "Frozoid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Miraidon": {
    "overview": "<p>Thanks to Miraidon's outstanding power cementing it as one of the most potent wallbreakers in the metagame, it is a staple on balance and bulky offense, and every team needs to have effective counterplay for it. U-turn makes Miraidon an amazing pivot, allowing it to safely bring in teammates such as Koraidon and Calyrex-S. However, due to the prevalence of the Ground-types Ting-Lu and Arceus-Ground, which can force Miraidon out one-on-one, it has a tough time safely coming in and wallbreaking. Additionally, Calyrex-S and Choice Scarf Koraidon can revenge kill Miraidon. Keeping this in mind, Miraidon really appreciates teammates such as Ho-Oh and Ting-Lu that are able to check Ting-Lu, Arceus-Ground, and offensive wallbreakers such as Koraidon and Calyrex-S.</p>",
    "comments": "<h3>Other Options</h3> <p>Miraidon can opt to use a more niche option in Overheat, which OHKOes Steel-types such as Necrozma-DM and Zacian-C under the sun provided by the omnipresent Koraidon. However, it is heavily prediction reliant and makes Miraidon drop more effective option in Taunt or Calm Mind. Miraidon can also opt for Tera Grass, (comma) which further bolsters the power of Solar Beam, allowing it to OHKO Ting-Lu at +1 and OHKO Arceus-Ground when unboosted. Furthermore, it lets Miraidon serve as a backup check to Arceus-Ground thanks to the Ground resistance it provides.</p> <h3>Checks and Counters</h3> <p><strong>Ting-Lu</strong>: Ting-Lu can effectively switch into Miraidon's Draco Meteor and safely pivot into Electro Drift, making it difficult to break through. However, Ting-Lu lacks recovery, which means it cannot do this repeatedly.</p> <p><strong>Arceus-Ground</strong>: At +1, Arceus-Ground can outspeed Miraidon and threaten it out with Earthquake. Also, Arceus-Ground is able to pivot in on Miraidon's Electro Drift, and it can force Miraidon to switch out in a one-on-one situation.</p> <p><strong>Revenge Killers</strong>: Revenge killers such as Koraidon and Calyrex-S can outspeed Miraidon and potentially KO it with their STAB moves. Additionally, thanks to Arceus's STAB priority in Extreme Speed, it can pick off a low-HP Miraidon.</p> <p><strong>Zacian-C</strong>: Courtesy of Zacian-C's high Speed and Play Rough, it is able to KO Miraidon. Also, Zacian-C is one of the very few Pokemon that blocks Miraidon's Draco Meteor, making it easier for it to safely switch in.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Miraidon's raw natural power backed by Hadron Engine and access to U-turn make it one of the best pivots for balance and bulky offense teams. Heavy-Duty Boots greatly increases Miraidon's longevity by letting it come in multiple times without any consequences from entry hazards while also improving its matchup against Sticky Web. Taunt helps prevent Ting-Lu from using Spikes, Arceus formes and Clodsire from using Recover, and foes such as Arceus and Necrozma-DM from setting up. Calm Mind allows Miraidon to OHKO Necrozma-DM after a single boost and brute force its way through its checks, 2HKOing Ting-Lu and OHKOing Arceus-Ground at +1 after entry hazard damage. Solar Beam is an alternative option that allows Miraidon to 2HKO Ting-Lu and OHKO Arceus-Ground after some minor chip damage, although it requires sun to be up for Miraidon to be able to use it with ease. Tera Fairy gives Miraidon an immunity to Dragon-type moves from Koraidon, Eternatus, and opposing Miraidon, albeit at the cost of making it weak to Necrozma-DM's Sunsteel Strike and removing its resistance to Ho-Oh's STAB moves. Tera Dragon boosts Miraidon's Draco Meteor to absolutely insane levels, allowing it to 2HKO Ting-Lu at +1 and OHKO Arceus-Ground. Tera Ghost grants Miraidon an immunity to Koraidon's Low Kick and Arceus's Extreme Speed, although it makes Miraidon weak to Calyrex-S's Astral Barrage.</p> <p>Miraidon is primarily used on balance and bulky offense teams that benefit from its wallbreaking and pivoting capabilities. Miraidon struggles with revenge killers such as Koraidon and Calyrex-S, so it likes checks to them such as Ho-Oh and defensive Arceus formes for the former and Ting-Lu for the latter. Miraidon appreciates being paired with Choice Scarf Koraidon, (comma) as they can pivot each other in and complement each other really well, with Koraidon being able to pressure Ting-Lu and Arceus-Ground and Miraidon helping against Ho-Oh and Arceus-Water. Miraidon also appreciates special attackers such as Calyrex-S and Arceus-Ground that can pressure and eventually break through Ting-Lu. Lastly, Miraidon greatly benefits from Ting-Lu setting entry hazards to let it effectively break through foes and being a fabulous check to Calyrex-S and Arceus-Ground, which Miraidon struggles with.</p>"
      },
      "Choice Specs": {},
      "Agility": {},
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 631210, "username": "Adhiraj8202"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 584685, "username": "Glory"}, {"user_id": 511624, "username": "Fc"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  }
}