{
  "Syclant": {"sets": [{"name": "Offensive Pivot"}]},
  "Revenankh": {"sets": [{"name": "Bulk Up"}]},
  "Pyroak": {"sets": [{"name": "Contrary Tank"}]},
  "Fidgit": {"sets": [{"name": "Persistent"}]},
  "Stratagem": {"sets": [{"name": "Meteor Beam"}]},
  "Arghonaut": {"sets": [{"name": "Special Wall"}]},
  "Kitsunoh": {"sets": [{"name": "Utility"}]},
  "Cyclohm": {"sets": [{"name": "Physically Defensive"}]},
  "Colossoil": {"sets": [{"name": "Flame Orb"}]},
  "Krilowatt": {"sets": [{"name": "Offensive Pivot"}]},
  "Voodoom": {"sets": [{"name": "Choice Specs Pivot"}]},
  "Tomohawk": {"sets": [{"name": "Physical Wall"}, {"name": "HazeHawk"}]},
  "Necturna": {"sets": [{"name": "Shell Smash"}]},
  "Mollux": {"sets": [{"name": "Utility Wall"}]},
  "Aurumoth": {"sets": [{"name": "Nasty Plot"}]},
  "Malaconda": {"sets": [{"name": "Drought"}]},
  "Cawmodore": {"sets": [{"name": "Belly Drum"}]},
  "Volkraken": {"sets": [{"name": "Choiced Wallbreaker"}]},
  "Plasmanta": {"sets": [{"name": "Rain Wallbreaker"}]},
  "Naviathan": {"sets": [{"name": "Dragon Dance"}]},
  "Crucibelle": {"sets": [{"name": "Utility Pivot"}]},
  "Kerfluffle": {"sets": [{"name": "Valiant At Home"}]},
  "Pajantom": {"sets": [{"name": "Choice Band"}]},
  "Jumbao": {"sets": [{"name": "Drought Wallbreaker"}]},
  "Caribolt": {
    "comments": "<h1>Checks and Counters</h1> <p><strong>Grass-types</strong>: Grass-types like Jumbao, Pyroak, and Amoonguss wall Caribolt's STAB combination, forcing it out.</p> <p><strong>Faster Attackers: Before Caribolt uses Rapid Spin, Pokemon like Cinderace and Ice Beam Greninja can outspeed and OHKO it. Fast Dragon-types like Dragapult, Roaring Moon, and Astrolotl can switch in to check Caribolt once, but they cannot do so if Caribolt reaches both +1 Speed and +2 Attack.</p> <p><strong>Strong Priority Attacks: Strong priority attacks from Kingambit, Dragonite, and Revenankh can circumvent Caribolt's Speed boosts and KO it after it has taken some chip damage from Double-Edge.</p> ",
    "sets": [
      {
        "name": "talahbolt (Swords Dance)",
        "description": "<h1>Set Details</h1> <p>Caribolt is a nuclear wallbreaker for offensive teams. Double-Edge with Galvanize can break through even the tier's most stalwart walls, 2HKOing Pokemon like Skeledirge and Garganacl with ease, especially once Caribolt Terastallizes. Horn Leech provides some modicum of recovery to compensate for Double-Edge's recoil. Rapid Spin both increases Caribolt's Speed, giving it sweeping potential, and supports teammates weak to Stealth Rock like Baxcalibur and Iron Moth, allowing them to forego Heavy-Duty Boots. Leftovers helps make up for Double-Edge's recoil alongside Horn Leech, while Magnet powers up Caribolt's Electric-type attacks even further. A Jolly nature is preferred to outspeed Choice Scarf Jumbao at +1 Speed and Krilowatt at +0, but Adamant is an option to deal as much damage as possible, supporting its hyper offense teammates. Tera Grass is an option to turn Ground-types like Equilibra and Great Tusk into setup fodder, but Caribolt's main focus should be on wallbreaking as much as possible for its teammates.</p> <p>Caribolt is best utilized on hyper offense teams, which appreciate its incredible wallbreaking ability. Stealth Rock-weak Pokemon like Iron Moth, Baxcalibur, and Venomicon-E appreciate Caribolt removing the hazard, allowing Iron Moth and Baxcalibur to run more offensive items over Heavy-Duty Boots. Other physical sweepers like Dragon Dance Roaring Moon and Dragonite love Caribolt powering through Unaware walls like Skeledirge and Arghonaut; Roaring Moon pairs particularly well with Caribolt, as it can threaten the Grass-types like Jumbao and Amoonguss that give Caribolt trouble with Tera Flying + Acrobatics. This love is shared by special sweepers like Iron Valiant and Hatterene, which need Skeledirge off the table before attempting a sweep. Caribolt appreciates entry hazards weakening physically bulky Ground-types like Great Tusk and Ting-Lu—which can beat Caribolt if it Terastallizes—into KO range of its attacks, so pairing it with a dedicated lead like Orthworm, Greninja, or Meowscarada is suggested.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "dex", "user_id": 277988}], "teams": [{"name": "Quality checked by", "members": [{"username": "snake", "user_id": 227784}, {"username": "spoo", "user_id": 251944}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Smokomodo": {"sets": [{"name": "Bone Zone"}]},
  "Snaelstrom": {"sets": [{"name": "Bulky Swords Dance"}]},
  "Equilibra": {"sets": [{"name": "Pivot"}]},
  "Astrolotl": {"sets": [{"name": "Offensive Utility"}]},
  "Miasmaw": {"sets": [{"name": "Swords Dance"}]},
  "Chromera": {"sets": [{"name": "Choice Specs"}]},
  "Venomicon": {"sets": [{"name": "Book"}, {"name": "Utility Wall"}]},
  "Venomicon-Epilogue": {"sets": [{"name": "E-Book"}, {"name": "Stealth Rock Pivot"}]},
  "Saharaja": {"sets": [{"name": "Standard Camel"}]}
}