{
  "Blastoise": {"sets": {"Shell Smash": {}}},
  "Arcanine-Hisui": {
    "sets": {
      "Offensive": {
        "description": "<p>Extreme Speed gets the jump on everything in the tier and backs up Hisuian Arcanine's potent STAB moves by letting it revenge kill frailer offensive Pokemon from high HP like Greninja, Ogerpon, and Latios. Notably, it can even prevent Adamant Lokix from revenge killing Hisuian Arcanine with First Impression. The perfect coverage afforded by these moves lets it fit a utility option into its last moveslot. Hisuian Arcanine is a great Stealth Rock setter thanks to its great matchup against Excadrill and Mandibuzz, the most common entry hazard removers, but it can also use Morning Sun to let its user more recklessly switch it in against foes like Tinkaton and Zapdos. Howl can be used over either choice to boost Hisuian Arcanine's Attack, letting it more easily cleave through offense with a boosted Extreme Speed. A Jolly nature with Tera Normal is chosen to let Hisuian Arcanine get the jump on Excadrill and to give Extreme Speed a much-needed power boost against offensive teams.</p> <p>Hisuian Arcanine best fits on offensive teams and is best supported by offensive teammates that can break through the few things that can take on its STAB attacks. Latios can break through Toxapex, Hippowdon, and Gastrodon, and it can help with some offensive foes that Hisuian Arcanine struggles to revenge kill like Sand Rush Excadrill while also switching into Keldeo for it. Stealth Rock setters like Tinkaton let Hisuian Arcanine more freely run Morning Sun, and in return it relieves some pressure on them to switch into Flying-types like Zapdos and Tornadus-T. Tinkaton can also check some foes Hisuian Arcanine struggles with, like the Normal-resistant faster offensive threats Ogerpon-C. Pivot support from allies like Lokix and Tornadus-T can bring Hisuian Arcanine in on prey like Tinkaton and Zapdos. Strong Water-types like Azumarill and Greninja can help Hisuian Arcanine with bulky Ground-types like Hippowdon and Rhyperior that cause it problems.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 481709, "username": "Lily"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Zapdos-Galar": {"sets": {"Choice Scarf": {}}},
  "Mew": {"sets": {"Hazard Lead": {}}},
  "Azumarill": {
    "sets": {
      "Offensive": {
        "description": "<p>Azumarill functions as a heavy-hitting wallbreaker thanks to Huge Power complementing its excellent Water / Fairy typing, providing Azumarill with a deadly STAB combination against many staples like Excadrill, Lokix, Tyranitar, and Hydrapple while granting it useful short-term defensive utility against foes like Greninja. Aqua Jet allows Azumarill to circumvent its vulnerable Speed tier, letting it hit threats like Thundurus-T, Excadrill, and Hisuian Arcanine without getting damaged by them first. Knock Off allows Azumarill to hit Slowking reliably while also hitting hard into switch-ins to its STAB moves, such as Volcanion, Sinistcha, and Pecharunt. It also lets Azumarill cripple threats like Zapdos and Toxapex by removing their items from them. Choice Band works in tandem with Huge Power to boost Azumarill's Attack stat to absurdly high levels, while Leftovers increases Azumarill's longevity. Tera Water boosts Azumarill's STAB Liquidation and Aqua Jet to even more absurd levels, notably guaranteeing an OHKO on Tornadus-T with Liquidation. Alternatively, Tera Steel can be used to resist Grass-type moves from foes like Hydrapple and Ogerpon-C, and Tera Electric can be used to resist Electric-type moves from foes like Zapdos and Thundurus-T, with the added bonus of also resisting the former's Hurricane and preventing Azumarill from being punished by Static. The second EV spread allows Azumarill to outspeed Skeledirge while giving it more bulk to better check Pokemon like Keldeo and Greninja.</p> <p>Azumarill fits best on offensive teams that appreciate its ability to break massive holes through teams while maintaining an aggressive, fast-paced style to offset Azumarill's low Speed and lack of defensive presence overall compared to other Water-types. Azumarill can easily be worn down by entry hazards, so Excadrill makes for a great partner to remove the hazards that plague it. Azumarill's biggest counter is Toxapex, which can only be hit by Knock Off that Toxapex shrugs off anyway, so ways to pressure it with Pokemon such as the aforementioned Excadrill, Zapdos, Latios, and Okidogi are essential. Other bulky Water-types such as Slowking, Rotom-W, and Volcanion prevent Azumarill from locking into Liquidation or Aqua Jet, so Pokemon like Thundurus-T and Zarude can help handle them. Lokix makes a great partner for Azumarill, acting as a secondary revenge killer to handle threats like Scizor and Latios that Azumarill cannot. Azumarill also struggles against Grass-types like Sinistcha and Ogerpon, so Pokemon like Zapdos, Tornadus-T, and Scizor are helpful teammates, though the former two struggle against Ogerpon-C. All of these Pokemon also provide useful pivot support to bring Azumarill in against many foes like Hisuian Arcanine, Rhyperior, Skeledirge, and Ursaluna to wallbreak.</p>"
      },
      "Belly Drum": {
        "description": "<p>Belly Drum Azumarill serves as a phenomenal setup sweeper on hyper offense teams that is able to KO most Pokemon that do not resist Water with +6 Aqua Jet outright or after slight chip, such as Tornadus-T, offensive Zapdos, and Cobalion. It is also a dangerous wallbreaker that annihilates slower counterplay. Azumarill is vital in providing natural defensive utility against certain sets of Latios and Greninja, in addition to being a countermeasure for hyper offense teams against the sand archetype. Play Rough enables it to KO Water-resistant Pokemon such as Hydrapple and Latios as well as beefier neutral targets like Mandibuzz and Slowking. Knock Off serves as an alternative damage option to hit Toxapex and Pecharunt, 2HKO Skeledirge, and be a more reliable way of taking out Slowking. Sitrus Berry is used to give Azumarill a much-needed health boost after using Belly Drum. The alternate EV spread lets Azumarill outspeed Skeledirge. Tera Water boosts damage from Aqua Jet, enabling it to OHKO Zapdos, as well as OHKOing Greninja and Latios after Stealth Rock. Tera Electric gives Azumarill the ability to set up on Zapdos, Tornadus-T, and Thundurus-T. Both Tera types give Azumarill a Steel resistance, which is useful to set up on Scizor and Metagross. Alternatively, a Jolly nature could be run to outspeed threats such as Mandibuzz, Sinistcha, Metagross, and Pecharunt, but this comes at a cost, as the drop in the power of Aqua Jet is noticeable.</p> <p>Azumarill fits best on hyper offense teams as a late-game sweeper that can take down weakened teams with +6 Aqua Jet. Excadrill and Sandy Shocks provide a key role in breaking Ogerpon-C's Sturdy with entry hazards as well as getting Cobalion, Latios, and Greninja in range of +6 Aqua Jet. Thundurus-T and Ogerpon-C can pressure faster threats such as Rotom-W, Volcanion, and Tera Water Zapdos. Greninja and Bisharp are able to check Pecharunt and Sinistcha, both of which can check Azumarill. Sticky Web from Araquanid is able to slow down threats such as Sinistcha and Pecharunt, bringing them down to a speed where Adamant Azumarill can defeat them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 458971, "username": "NDK"}, {"user_id": 540058, "username": "StarFalcon555"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 617840, "username": "gulch"}, {"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Slowking": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Slowking leverages its good typing and Regenerator to be a great pivot in UU. Scald punishes foes trying to threaten it out such as Lokix and Ogerpon. Thunder Wave slows down foes such as Tornadus-T and Latios. On teams where the speed control is not needed, Future Sight is a good alternative to support its teammates with extra damage. Chilly Recpetion is key for bringing teammates in safely while pairing very well with Future Sight. It can also be used to clear sand. The first EV spread allows it to take on physical attackers like Mamoswine and +2 Excadrill, while the second EV spread lets it survive Choice Specs Tera Dragon Draco Meteor from Latios. 0 Speed IVs make Slowking as slow as possible to ensure that Chilly Reception can pivot in a teammate without taking any damage. Tera Fairy flips its weakness to Dark and Bug while gaining a Dragon immunity, letting it paralyze Greninja and Ogerpon while more safely switching into Hydrapple. Tera Water is a decent alternative that retains its Water resistance so it can still check Azumarill and Keldeo while boosting Scald’s damage, OHKOing Rhyperior and Excadrill with slight chip damage.</p> <p>Slowking fits best on bulky offense and balance teams that appreciate the speed control and consistent pivoting. Hydrapple forms a fantastic Regenerator core with Slowking, as it can easily handle Ogerpon as well as shared checks in Lokix and Latios if it Terastalizes. Slowking can also use Thunder Wave to slow down Tinkaton and opposing Hydrapple. Lokix is another excellent partner for Slowking, as it can be brought in safely by Chilly Reception to revenge kill a foe like Excadrill. It is also able to threaten Dark-types, which are immune to Future Sight, such as Tyranitar, opposing Lokix, and Mandibuzz with Knock Off. Slower wallbreakers like Flame Orb Ursaluna and Mamoswine love Slowking slowing down Cobalion, Tinkaton, and Tornadus-T for them, while in return, they can both break through Zapdos. The latter also appreciates the Defense boost from snow, letting it easily take priority moves from Lokix, Scizor, and Azumarill. Zapdos and Thundurus-T are huge nuisances to Slowking, so Sandy Shocks and Rhyperior help handle them nicely. Slowking also appreciates teammates that handle Grass-types like Hydrapple and Ogerpon. Scizor and Assault Vest Tornadus-T form a good pivot core, with the latter helping on take on Latios for physically defensive variants. Skeledirge appreciates Slowking spreading status for Hex to deal more damage as well. Tinkaton can run Thunder Wave itself, opening up Slowking to use Future Sight while checking Ogerpon-C, Lokix, and Latios. Weather Ball users like Nasty Plot Tornadus-T, Thundurus-T, and Raikou also appreciate the Ice coverage from snow, allowing them to nail Hydrapple and Ogerpon-C.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 524894, "username": "cheru"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Gligar": {"sets": {"Physically Defensive": {}}},
  "Scizor": {
    "sets": {
      "Pivot": {
        "description": "<p>Scizor is a potent threat in the UU metagame due to its combination of Swords Dance + Technician-boosted Bullet Punch providing strong revenge killing and cleaning abilities as well as its access to utility options like Knock Off and U-turn to allow it to function as a bulky pivot. Bullet Punch in tandem with Technician allows Scizor to pressure frailer, faster threats, notably OHKOing Ogerpon-C after Stealth Rock, Mamoswine after little chip damage, and Lokix and Latios at +2. Knock Off helps Scizor cripple common switch-ins like Zapdos and Mandibuzz by removing their Heavy-Duty Boots, as well as dealing super effective damage to Skeledirge and Metagross. U-turn does big damage to Pokemon like Slowking and Hydrapple, as well as allowing Scizor to escape bad matchups from Pokemon like Cobalion and Toxapex. 136 Speed EVs are used for Scizor to outspeed Adamant Azumarill, with the rest pumped into bulk. Tera Steel is used to add extra power to its already impressive Technician-boosted Bullet Punch, notably OHKOing Heavy-Duty Boots Tornadus-T at +2 and 2HKOing Azumarill. Alternatively, Tera Fire is used to flip its matchup versus Skeledirge and Hisuian Arcanine, allowing it to safely hit the former with Knock Off and hindering its ability to consistently switch in. It can also be used to absorb Will-O-Wisp from the aforementioned Skeledirge, as well as resisting Heat Wave from Tornadus-T. However, this gives up Scizor's good defensive typing, resulting in worse matchups against tier staples like Hydrapple, Rhyperior, and Excadrill, as well as taking more entry hazard damage should Scizor's Heavy-Duty Boots get removed. Scizor can also use Tera Electric to avoid getting paralyzed by Static from Zapdos, which would otherwise punish its contact moves.</p> <p>As an offensive pivot, Scizor does best on bulky offense and offense structures, able to use the fast-paced nature of such team styles to pivot around, provide item displacement, and revenge kill key threats. Rhyperior is a phenomenal teammate due to its ability to counter dangerous threats to Scizor like Zapdos, Tornadus-T, and Hisuian Arcanine well as provide key Stealth Rock support to put threats like Ogerpon-C and Mamoswine into range of Bullet Punch more easily. Other entry hazard setters like Sandy Shocks and Cobalion also are good teammates, both forming a VoltTurn core to bring Scizor in against threats like Hydrapple, with Cobalion also being able to offensively check Lokix and Excadrill. Scizor also works well with the Pokemon that appreciate its free switches, such as wallbreakers like Latios, Mamoswine, and Azumarill. These wallbreakers provide the raw power needed to blast past Scizor's defensive checks and counters, like Cobalion, Toxapex, and Zapdos. Once these walls are gone, Scizor can clean up after a Swords Dance. Scizor also forms a potent core with other pivots, such as Zapdos and Slowking, with the latter able to take on the Fire-type moves thrown at it. Defensive partners include Pokemon like the aforementioned Slowking, as well as Rhyperior, Skeledirge, and Tinkaton; the latter acts as a primary check to Latios and Hydrapple so that Scizor doesn't get chipped down trying to switch into their attacks.</p>"
      },
      "Offensive Swords Dance": {
        "description": "<p>Technician-boosted Bullet Punch is a big reason why Scizor is such a great late-game Pokemon and revenge killer once the opposing team is worn down. Close Combat is a great coverage move for Scizor, as it complements Bullet Punch well due to it being super effective against Steel-resistant Pokemon like Excadrill, Cobalion, Empoleon, and Tera Steel Hydrapple. Knock Off allows Scizor to force progress even against foes it cannot do much damage against like defensive Zapdos, Skeledirge, and Toxapex. Tera Fire gives Scizor the advantage against Pokemon that rely on burning it like Skeledirge and Rotom-W while making it so Fire-type attacks bounce off it, although Rotom-W can threaten it with a super effective Hydro Pump. Tera Steel powers up Scizor's Bullet Punch, allowing it to both break through foes and pick off weakened threats more effectively. Tera Electric is a great tool against Zapdos, Tornadus-T, and Thundurus-T, allowing Scizor to beat them one-on-one without being worried about Static, strong Electric-type attacks, and coverage.</p> <p>This Scizor set fits best on hyper offensive teams that can create a path to win late-game by weakening checks like Zapdos, Toxapex, and Rotom-W. Entry hazard support is a great way for Scizor to find itself in a scenario where the foes are weakened enough thanks to the chip damage of hazards from Excadrill, Mew, and Sandy Shocks. Excadrill is a great partner, as it can remove hazards so that Scizor doesn't get worn down by passive damage as quickly as it would otherwise. Alternatively, Mew and Sandy Shocks both provide Spikes alongside Stealth Rock to help wear down Scizor's checks more quickly. Sandy Shocks can also take on Zapdos and Tornadus-T while also luring in Hydrapple and removing it with Tera Blast Ice. Strong Pokemon like Ogerpon-C, Latios, and Thundurus-T can create opportunities for Scizor by punching holes against Pokemon like Zapdos, Hydrapple, and Mandibuzz. Keldeo and Greninja are Pokemon that Scizor might give free turns to fire off powerful attacks thanks to them resisting Bullet Punch, so Azumarill is a great partner, as it helps deal with these threats and pressures checks and counters that it shares with Scizor to help open up a late-game sweep.</p>"
      },
      "Choice Band": {
        "description": "<p>With a Choice Band, excellent STAB moves, good defensive typing, and amazing ability in Technician, Scizor proves to be a threatening pivot, wallbreaker, and revenge killer. Bullet Punch is an incredibly powerful priority move capable of picking off faster attackers like Ogerpon-C and Mienshao after Spikes chip damage, as well as 2HKOing Latios and Lokix. U-turn allows Scizor to switch out of unfavorable matchups such as Zapdos and Toxapex so that it can get a more reliable teammate in to handle them. Close Combat is an excellent coverage move for Scizor, allowing it to break offensive Steel-type Pokemon such as Excadrill, Cobalion, and Magnezone. Lastly, Knock Off is used to cripple and weaken Pokemon reliant on their items, such as Zapdos, Skeledirge, and Hippowdon, making them all easier to target. Tera Steel maximizes the power of Bullet Punch, allowing Scizor to hit even harder. Tera Electric prevents Scizor from getting paralyzed by Zapdos's Static.</p> <p>Scizor fits best on bulky offense and VoltTurn teams to make the most of its offensive capabilities. Offensive teammates like Ogerpon-C, Latios, and Zapdos are  appreciated, as  they can take on threats such as Toxapex and Keldeo for Scizor, as well as being able to dismantle the opposing team for it to begin sweeping. Defensive pivots such as Tornadus-T and Slowking work amazingly with Scizor, helping take on offensive threats it dislikes such as Greninja and Latios while keeping up momentum. Rotom-W is a great teammate, as it forms a VoltTurn core with Scizor that can handle one another's checks, with Scizor taking on the likes of Hydrapple and Ogerpon for Rotom-W, while Rotom-W removes Fire-type Pokemon that can threaten Scizor such as Skeledirge and Hisuian Arcanine. Entry hazard setters like Sandy Shocks and Cobalion help Scizor to get more value out of using Bullet Punch with the help of chip damage, while Tyranitar can set up both Stealth Rock and sand, which chip away at opposing Pokemon even quicker. Excadrill is a very important teammate for Scizor to have, as it can lure in Zapdos and remove it with a +2 Rock Slide and can take pressure off of Scizor by pivoting into Latios so it can preserve its HP.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 655366, "username": "RodentTamer"}, {"user_id": 642289, "username": "mrsuslawl"}, {"user_id": 492518, "username": "HydreigonTheChild"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 540289, "username": "Tidal"}, {"user_id": 617840, "username": "gulch"}, {"user_id": 515132, "username": "Monky25"}, {"user_id": 620325, "username": "ThatOneApple"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Skarmory": {"sets": {"Spikes": {}}},
  "Donphan": {"sets": {"Offensive Utility": {}}},
  "Blissey": {"sets": {"Calm Mind": {}}},
  "Tyranitar": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Tyranitar's unique typing alongside fantastic special bulk under sand allows it to check dangerous threats like Latios and Zapdos well. Tyranitar's ability to remove items with a strong Knock Off and pressure entry hazard removers like Mandibuzz and Excadrill from switching in safely make it an effective Stealth Rock setter. Thunder Wave allows Tyranitar to punish switch-ins like Keldeo, Tinkaton, and Cobalion. It can also be used to cripple Tera Steel Latios to help other teammates deal with them better. Earthquake can be used to do heavy damage to Tinkaton, Excadrill, and Cobalion, but without Attack investment, it does not threaten much else. Ice Punch is an option if Tyranitar is paired with Excadrill to lure in and remove a weakened Hydrapple to help it sweep more easily. Leftovers is the preferred item choice to provide Tyranitar with passive recovery. Smooth Rock can be used to provide Sand Rush Excadrill with more sand turns but is far from necessary. Heavy-Duty Boots can help offset entry hazard damage. Chople Berry is a situational item that allows Tyranitar to check Nasty Plot Tornadus-T and Aura Sphere Latios. The given Speed EVs allow Tyranitar to outpace Skeledirge and hit it hard before potentially being punished by Will-O-Wisp. Tera Fairy removes Tyranitar's glaring weaknesses, particularly to Fighting, allowing it to punish Pokemon like Mienshao. It also allows Tyranitar to deal with a boosted Draco Meteor from Latios and KO it back while improving its matchup against Lokix. Tera Ghost can be used for a similar reason to remove Tyranitar's weaknesses while also potentially preventing Excadrill from being able to remove its Stealth Rock. Tera Water is another option to improve the matchup into Greninja and Choice-locked Keldeo; however, under sand, Tyranitar can take a boosted Surf from them anyway. Tera on Tyranitar should be used in emergencies, as removing its Rock typing takes away the boost to its Special Defense under sand and causes it to take damage from sand as well.</p> <p>Tyranitar fits best on offensive structures that can force progress, as it is susceptible to being worn down quickly. Excadrill is a great partner that can remove entry hazards for Tyranitar, as well as capitalize on the sand with Sand Rush to turn it into a deadly cleaner. Tinkaton pairs nicely with Tyranitar to act as a secondary check to Latios and Tornadus-T, as both are capable of chipping away at Tyranitar or potentially KOing it with Fighting-type coverage. Tinkaton also helps against other threatening wallbreakers like Ogerpon formes and Lokix; pickpocket Tinkaton variants are able to steal their Heavy-Duty Boots, causing them to slowly get whittled down by Tyranitar's Stealth Rock and sand. Other U-turn punishers like Rocky Helmet Cobalion and Zapdos can also support Tyranitar well. Slowking and Tornadus-T can help deal with Cobalion and Keldeo. Tornadus-T can also remove Heavy-Duty Boots from Zapdos, allowing Tyranitar to get meaningful damage on it with Stealth Rock throughout a battle. Toxapex and Hydrapple do not mind having their item removed thanks to Regenerator, so partners like Zapdos and Mamoswine can help threaten them.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Tyranitar is one of the strongest wallbreakers in the tier, with its massive Attack stat, strong spammable STAB combination that hits key threats such as Latios, Tornadus-T, Zapdos, and Slowking, and coverage moves to hit its counterplay. It can also leverage its great natural bulk, especially when combined with its Special Defense boost from sand, to defensively answer special attackers like Zapdos and Latios. Earthquake pairs with Stone Edge very well for near-perfect coverage, hitting many Steel-types that would otherwise take Tyranitar's moves solidly, including Tinkaton and Cobalion. Ice Punch is solely used to OHKO Hydrapple. Tera Dark can boost the sheer strength of Tyranitar's Knock Off, 2HKOing itemless Toxapex and doing greater damage to walls like Hippowdon and Rhyperior. It also lets it avoid super effective hits, such as Greninja's Surf and Hydro Pump and Excadrill's STAB moves, and KO back. However, it leaves it vulnerable to its own sand chip and voids the Special Defense boost from sand. Tera Rock can similarly boost the power of its Stone Edge, letting it 2HKO maximum Defense Hydrapple, which is otherwise its most common switch-in. This also allows it to keep the sand Special Defense boost and avoid the chip damage so it can take on the attacks of Latios and Zapdos more easily. Tera Flying can be used to obtain a resistance and immunity to Fighting- and Ground-type moves, respectively, from offensive checks such as Excadrill, Cobalion, and Mienshao, but gaining a weakness to Stealth Rock can be costly.</p> <p>Tyranitar often appreciates slow pivots to help it enter safely, as it does not have any form of recovery and thus does not like taking many attacks. Slowking does so and offers Future Sight support to help Tyranitar break through some of its checks, such as Okidogi and Toxapex, more easily. It can also help defensively check foes like Cobalion and Keldeo and offers paralysis to let Tyranitar outspeed foes such as Tornadus-T and Latios. Another good partner for Tyranitar is Excadrill, which, even with the limited sand turns, can revenge kill fast threats that may threaten out Tyranitar with OHKOs, such as Keldeo and Cobalion. Excadrill also helps wear down their shared checks in Rhyperior and Hydrapple, and Rapid Spin can allow Tyranitar to live longer and break more due to it no longer taking entry hazard chip damage. Hazard setters can provide support to chip defensive Pokemon like Hydrapple, Hippowdon, and Rhyperior into KO range from Tyranitar's attacks, while Tyranitar can remove the Heavy-Duty Boots that these Pokemon use to avoid hazard damage. Cobalion also helps defensively check revenge killers to Tyranitar like Lokix and both Ogerpon formes while providing the ability to pivot on foes, namely Slowking. Sandy Shocks can offensively check potential Tyranitar switch-ins or revenge killers like Okidogi and Tinkaton and can act as an alternative Zapdos check while blocking Volt Switch. Zapdos can check Tornadus-T, pivot Tyranitar in, and check Ogerpon and Lokix that check Tyranitar. Static paralysis can allow Tyranitar to outspeed would-be faster threats and deal great damage. Tornadus-T can be a great partner for Tyranitar, checking many threats that it may let in and forcing switches of its own, which can let it bring in Tyranitar to wreak havoc. Its Flying typing and solid special bulk with Regenerator can allow it to check Cobalion and Greninja while assisting Tyranitar with checking Latios. Ogerpon and Hydrapple can work well alongside Tyranitar, checking Water-type threats such as Greninja and Azumarill that Tyranitar lets in. Scizor and Lokix can help revenge kill or pressure strong threats to Tyranitar such as Ogerpon, Greninja, Tinkaton, and Hydrapple. They can also remove potential Air Balloons from Tinkaton and Cobalion to make them vulnerable to Tyranitar's Earthquake.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 605413, "username": "Tree69420"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 540289, "username": "Tidal"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 200771, "username": "Rugi"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Gardevoir": {"sets": {"Choice Scarf": {}}},
  "Milotic": {"sets": {"Physically Defensive": {}}},
  "Salamence": {"sets": {"3 Attacks + Roost": {}, "Dragon Dance": {}}},
  "Metagross": {
    "sets": {
      "Bulky Attacker": {
        "description": "<p>Metagross's great typing, stats, and movepool allow it to function as a solid bulky attacker, handling threats like Latios and Ogerpon-C. Heavy Slam is a reliable STAB move, taking advantage of Metagross's large weight to do solid damage to threats like Hydrapple, Mandibuzz, and Greninja. Stealth Rock also allows Metagross to function as an entry hazard setter, while Bullet Punch gives Metagross a STAB priority move to circumvent its below average Speed, hitting foes like Ogerpon-C and Mamoswine. Knock Off can be used to cripple checks like Slowking and Zapdos by removing their items, while Earthquake can be used to hit Steel-types such as Excadrill and Cobalion. Leftovers is crucial for maintaining Metagross's longevity, since it doesn't get a recovery move. 96 Speed EVs allow Metagross to outspeed maximum Speed Adamant Azumarill. Tera Dark allows Metagross to turn its weaknesses to Dark and Ghost into resistances while also boosting the power of its Knock Off, while Tera Water allows it to resist Fire-type attacks from Hisuian Arcanine and Skeledirge and tank Belly Drum Azumarill's boosted Aqua Jet.</p> <p>Metagross does best on bulky offense and balance teams that appreciate its good mix of power and bulk. Teammates like Zapdos, Mandibuzz, and Hydrapple all provide a Ground resistance that covers Metagross's weakness. In return, Metagross answers Ogerpon-C, which is scary for the former two and takes pressure off of Hydrapple. However, it is important to note that Zapdos and Tornadus-T cannot switch into Rhyperior safely, so answers to it like Slowking or the aforementioned Hydrapple are appreciated. Metagross is also weak to Fire-type moves from Pokemon like Hisuian Arcanine and Skeledirge, so Water types like Rotom-W and Slowking can help tank these attacks, both of which can use pivot moves to bring Metagross in safely. In general, Metagross benefits greatly from pivots that can bring it in safely, so U-turn users like Lokix, Tornadus-T, and Scizor also make great teammates. Metagross tends to struggle with bulky Flying-types like Zapdos and Mandibuzz, so it benefits from teammates that can handle these two, such as Rhyperior and Sandy Shocks. These two Pokemon also act as alternate Stealth Rock users, which not only synergizes well with Metagross's Knock Off but also allows it to run Bullet Punch. The latter can also act as a spiker to form a hazard-stacking core with Metagross.</p>"
      },
      "METABOOM": {
        "description": "<p>Explosion Metagross is an offensive Pokemon with some defensive utility and a simple gameplan: set Stealth Rock then use Explosion. Explosion does a lot of damage to the tier's defensive Pokemon like Hydrapple and Slowking. Earthquake lets it hit the Steel-types that resist its Explosion and Heavy Slam, like Empoleon and Excadrill. Stealth Rock gives it excellent utility, setting entry hazards while the foe switches out. Bullet Punch is useful when running an alternative hazard setter, as it can clean up foes at low HP. Metagross can utilize its fantastic typing to defensively check Pokemon like Latios and Hydrapple. Custap Berry alleviates how low Metagross may get in the process by gaining priority on Explosion. Normal Gem can allow it to KO some important targets, such as maximum Defense Hydrapple after Tera Normal.   The given Speed investment allows Metagross to outspeed Mandibuzz, Azumarill, and Ursaluna, but 196 Speed EVs can allow it to outspeed targets like Tinkaton and Choice Band Tyranitar; however, doing so would sacrifice some of the bulk that lets it check Ogerpon-C and Latios. Tera Normal lets Metagross power up its Explosion, letting it OHKO Zapdos and favours it to KO Hydrapple with chip, but beware that most of its defensive utility comes from its typing, so only use Tera if Metagross needs Tera Normal to KO the foe.</p> <p>Metagross fits best on offensive structures, as it lures in Zapdos and Hydrapple and weakens them for the rest of the team to exploit. Excadrill is an amazing partner, especially considering how much it threatens Skeledirge and Rotom-W, Pokemon that Metagross hates. Thundurus and Sandy Shocks also are good partners, as they enjoy Metagross's ability to switch into Latios and weaken Hydrapple. Sandy Shocks can also act as an alternate Stealth Rock setter. Metagross also enjoys Sticky Web support from Araquanid, allowing it to outspeed Pokemon like Tyranitar and Tinkaton while keeping its bulk as well as offensive checks like non-Heavy-Duty Boots Mamoswine and most Okidogi sets. Okidogi is another good partner, as it is great at keeping Lokix in check and uses it as a setup opportunity. Ghost-type Pokemon like Sinistcha and Pecharunt can cause problems, as they block Metagross's Explosion attempts while threatening it with Shadow Ball, so it appreciates offensive Dark-types like Tyranitar and Lokix.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540058, "username": "StarFalcon555"}, {"user_id": 647932, "username": "Goombatower69"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Latios": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With its high Speed and Special Attack, Choice Specs Latios is a very deadly wallbreaker in UU, able to even break past checks such as Metagross, Slowking, and Tyranitar over time with its nuclear Draco Meteor. Surf nails Heatran and Excadrill while having good neutral damage against Scizor and Metagross. Flip Turn allows Latios to preserve momentum off of checks like Empoleon and Tinkaton coming in. Trick hinders Pokemon like Slowking and Tyranitar with a useless item for them but should only be used when Latios's Choice Specs is no longer needed, is not useful in the current matchup, or is more valuable to weaken said checks to open up another teammate to win. Latios can run other coverage moves too; Thunderbolt threatens Mandibuzz and Slowking, Shadow Ball hits Metagross super effectively while retaining coverage for Slowking, while Aura Sphere slams Tyranitar and retains the ability to break Heatran and Excadrill, but they generally are difficult moves to lock into compared to more standard options. Tera Dragon boosts Latios's Draco Meteor to absurd levels, being able to OHKO Assault Vest Tornadus-T after Stealth Rock and Slowking after very little chip damage as well as 2HKO specially defensive walls like Tyranitar. Tera Steel is an alternative that gives Latios greater defensive utility, being able to avoid revenge killing attempts from Pokemon like Greninja, Lokix, Mamoswine, and opposing Latios.</p> <p>Choice Specs Latios is a powerful asset on bulky offense and balance builds for its powerful wallbreaking capabilities. Physical attackers such as Scizor, Okidogi, Excadrill, and Cobalion excel at pressuring checks to Latios such as Metagross, Slowking, Tinkaton, and Tyranitar. Choice Scarf Okidogi also can revenge kill Greninja and swap into Lokix, while Excadrill provides entry hazard removal to keep Stealth Rock from wearing down Latios and switches into Tinkaton reliably. Tornadus-T and Lokix act as pivots that can wear down shared checks like Tyranitar and Tinkaton and enable Latios to wallbreak by bringing it in on other foes like Zapdos and Toxapex. Entry hazard support from Pokemon like Tinkaton, Rhyperior, and Sandy Shocks does a great job at wearing down Metagross and Tyranitar into range of Latios's attacks; the latter two also check Zapdos due to the lower longevity Choice Specs Latios has. Defensive Pokemon like Zapdos, Slowking, and the aforementioned Tornadus-T can defensively solidify Latios's team due to its need to predict correctly or otherwise risk losing momentum, with the latter two being additional checks to threats like Keldeo. Zapdos and Slowking also provide paralysis support to mess with revenge killers like Lokix, Tornadus-T, and Greninja.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Equipped with a Choice Scarf, Latios becomes one of the fastest revenge killers in the tier, taking out the likes of Ogerpon-C, Greninja, opposing Latios, and +1 Quaquaval as well as outpacing other Choice Scarf users like Hoopa-U and Okidogi. Flip Turn lets Latios retain momentum as a revenge killer, especially because its lower power means it can end up as a momentum sink if it locks into the wrong STAB move, not to mention it slightly chips switch-ins like Tinkaton and Excadrill for another teammate. Trick ruins defensive switch-ins like Slowking and Tyranitar but should only be used when Latios's Choice Scarf isn’t needed. Thanks to Latios's ability to still be useful with its STAB moves + Flip Turn, it can still use Trick more liberally than other Choice item users. Tera Dragon is best to get a power boost on Latios's Draco Meteor, being able to KO Assault Vest Tornadus-T in two turns after Stealth Rock as well as guaranteeing an OHKO on Ogerpon-C after Stealth Rock with a singular Draco Meteor.</p> <p>Choice Scarf Latios best fits on offensive builds that appreciate its lightning-fast revenge killing capabilities. Physical attackers like Rhyperior and Excadrill are able to pressure Steel-types like Tinkaton and Metagross for Latios; the former provides Stealth Rock support and a Zapdos switch-in while the latter offers entry hazard removal to keep Latios from being worn down by Stealth Rock, and in return, they enjoy Latios's ability to revenge kill Ogerpon-C, Cobalion, and Greninja. Zapdos, Slowking, and Cobalion can swap into attacks from Pokemon that take advantage of Latios being locked into an attack such as Metagross and Tyranitar. Zapdos, Slowking, and the aforementioned Rhyperior also check Assault Vest Tornadus-T for Latios. Lokix helps act as a secondary revenge killer against threats that don’t fear Latios like Scizor and Excadrill while wearing down Tinkaton and Tornadus-T. Lokix, alongside the aforementioned Slowking and Zapdos, also form pivoting cores with Choice Scarf Latios. Wallbreakers like Hisuian Arcanine and Greninja enjoy Latios's ability to give its Choice Scarf to Slowking and Tinkaton with Trick, in turn pressuring checks like Tyranitar and Metagross.</p>"
      },
      "Soul Dew": {
        "description": "<p>With Soul Dew amplifying the power of its STAB moves, key defensive utility, and longevity, Latios is a formidable wallbreaker that can use its serviceable defensive utility in tandem with Recover to be an offensive threat that has longevity and key traits to bring to a team. Flip Turn allows Latios to gain momentum against and wear down threats like Excadrill, Slowking, and Tyranitar. Recover lets Latios pivot into the likes of Keldeo, Thundurus-T, Cobalion, and Zapdos while not having to worry about being worn down. Soul Dew amplifies Latios's STAB moves while keeping its move flexibility. Tera Steel lets Latios avoid getting revenge killed by Pokemon like Greninja, Mamoswine, and Lokix. It also lets Latios act as a reliable switch-in against Hydrapple and Rhyperior as well as giving it a Poison immunity, although it can no longer switch into Cobalion and Keldeo after Tera Steel.</p> <p>Latios largely fits on offense and bulky offense teams as a useful wallbreaker that provides much-needed defensive utility against foes like Zapdos and Cobalion. Pivots like Lokix and Zapdos can bring Latios in safely to wallbreak while helping it overwhelm shared checks such as Tinkaton and Tyranitar. Zapdos also checks Pokemon that threaten Latios such as Lokix and Excadrill, while Lokix revenge kills faster threats like Greninja and Choice Scarf Zarude. Tornadus-T can also bring Latios in safely while being a good source of defensive utility against the likes of Greninja and can wear down Pokemon like Slowking and Metagross for it. Tinkaton and Rhyperior can provide Stealth Rock support to put threats like Slowking and Assault Vest Tornadus-T in range of KOs more easily. Sandy Shocks can set up Spikes, help wear down Tornadus-T, and bring Latios in against Hydrapple. Araquanid is a good enabler for Latios on Sticky Web teams, slowing down faster threats like Greninja, Choice Scarf Mienshao, and Choice Scarf Okidogi as well as helping it avoid a Speed tie with Ogerpon-C.</p>"
      },
      "Calm Mind + Tera Electric": {
        "description": "<p>Thanks to Terastallization, Latios utilizes Calm Mind in tandem with a STAB Thunderbolt to become an extremely powerful sweeper that plays a defining role in UU. Latios's natural bulk and high Speed allow it to gain setup chances with Calm Mind to snowball against common Pokemon like Zapdos and Rotom-W as well as others like Greninja and Tornadus-T post Tera, working in tandem with Draco Meteor to offset the Special Attack drops. Dragon Pulse is a weaker alternative that offers the benefit of not dropping Latios's Special Attack. Thunderbolt complements Latios's Dragon-type STAB attack to be an unwallable combination outside of Excadrill, targeting many Pokemon such as Azumarill, Toxapex, Tinkaton, and Metagross. Recover allows Latios to maintain longevity throughout the game and gain multiple chances to sweep while simultaneously providing natural defensive utility to its team against foes like Zapdos, Keldeo, and Thundurus-T. The passive recovery of Leftovers allows Latios to set up more easily without relying on Recover, but Ability Shield is an alternative to bypass Excadrill's Mold Breaker, allowing Latios to now set up on its biggest counter. However, this item relies on surprise factor and is vulnerable to being removed via Knock Off from Pokemon like Tornadus-T and Metagross. Maximum investment in Special Attack and Speed allows Latios to be a fast, hard-hitting natural threat that doesn't need to rely on boosts to be effective. Alternatively, 96 Speed EVs to outspeed Hisuian Arcanine, maximum HP investment, and the remaining EVs in Defense let Latios act as a bulkier sweeper to better stand up to foes like Metagross and Lokix at the cost of immediate power. Tera Electric is the driving point of this set, boosting Thunderbolt to powerful levels to get past foes like Tinkaton and Metagross more easily while also making it safer into Lokix and Tornadus-T, not to mention giving Latios no weaknesses thanks to its synergy with Levitate. Latios also gains an immunity to Thunder Wave from foes like Slowking and Tinkaton.</p> <p>Calm Mind + Tera Electric Latios fits on a multitude of archetypes ranging from offense to semi-stall, but it finds itself most at home on bulky offense and balance teams thanks to its role as a reliable sweeper. Latios's biggest obstacle is Mold Breaker Excadrill, which handles its otherwise unresisted move combination, so Slowking and Hydrapple are great teammates to keep Excadrill in line. Slowking also provides slow pivoting support with Chilly Reception to get Latios in safely as well as provide speed control with Thunder Wave or amplify wallbreaking with Future Sight. Pivots like Zapdos and Lokix can bring Latios in to set up for a sweep while wearing down shared checks like Tyranitar and Tinkaton. Zapdos checks dangerous threats to Latios like Lokix, Tornadus-T, and Ogerpon. Meanwhile, Lokix exerts offensive pressure on the likes of Excadrill and Greninja for Latios. Stealth Rock support from Tinkaton and Rhyperior wears down foes like Toxapex and Assault Vest Tornadus-T into range of being KOed more easily. Tinkaton can also wear down Excadrill and Tera Fairy Hydrapple, while Rhyperior can pressure foes like Slowking and Mandibuzz. Skeledirge is another issue for this set, so Pokemon that handle it such as Excadrill, Ogerpon-C, and Mamoswine make great teammates. Latios is quite Tera reliant to function at its very best, so offensive threats that do not use Terastallization often like the aforementioned Excadrill and Mamoswine as well as others like Azumarill and Choice Scarf Okidogi form great offensive cores that can take out checks to Latios such as Tyranitar, Metagross, and Tinkaton.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 617840, "username": "gulch"}, {"user_id": 540289, "username": "Tidal"}, {"user_id": 461329, "username": "Estarossa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Jirachi": {"sets": {"Wish": {}}},
  "Empoleon": {"sets": {"Defensive Pivot": {}}},
  "Gastrodon": {"sets": {"Specially Defensive": {}}},
  "Hippowdon": {
    "sets": {
      "Stealth Rock": {
        "description": "<p>Hippowdon's natural mixed bulk and access to recovery allow it to be a useful defensive piece of sand balance teams, checking numerous threats such as Excadrill, Thundurus-T, and Okidogi. Hippowdon is also an effective Stealth Rock setter, especially due to its matchup against the most common entry hazard removal in Excadrill. Slack Off allows Hippowdon to reliably check foes such as Excadrill, Tyranitar, and Zapdos throughout a game. Stone Edge hits Flying-types such as Zapdos, Tornadus-T, and Thundurus-T and is Hippowdon's best way to hit Latios and Grass-types. Leftovers provides Hippowdon with a means of passive recovery and limits its reliance on Slack Off, but Rocky Helmet is an alternative option to chip down pivots such as Lokix and Scizor as well as other physical attackers like Okidogi and Hoopa-U. 208 Defense EVs with an Impish nature allow Hippowdon to avoid the 2HKO from Choice Band Tyranitar's Ice Punch and Choice Scarf Tera Dark Hoopa-U's Hyperspace Fury, while 48 EVs in Special Defense allow Hippowdon to avoid the 2HKO from Thundurus-T's Focus Blast and defensive Zapdos's Hurricane. Tera Dragon flips Hippowdon's matchup against Water-types such as Greninja, Quaquaval, and Keldeo while retaining a positive matchup against Zapdos and Thundurus-T, though it must still be wary of Greninja's Ice Beam. It also strengthens Hippowdon's response to Ogerpon-C. Tera Rock lets Hippowdon resist Flying-type moves from Zapdos and Nasty Plot Tornadus-T while boosting the power of Stone Edge and using the Special Defense boost from sand to better answer Enamorus-T and Latios. However, the granted weaknesses to Ground- and Fighting-types is very harmful. Hippowdon's base typing is useful, especially for blocking Volt Switch, and its defensive role largely means more offensive Pokemon will make better use of Terastallization, so it isn't desirable to Terastallize Hippowdon unless necessary to dispatch a key threat.</p> <p>Hippowdon largely fits on sand balance teams, where its defensive presence makes it the preferred option to Tyranitar. Excadrill is an essential partner on sand teams, removing troublesome entry hazards that wear down Hippowdon while generally serving as a proactive breaker on the archetype to offset Hippowdon's passivity and take out foes like Greninja, Hoopa-U, and Tornadus-T. Slowking is a massive issue, being able to swap into Hippowdon and reset sand with Chilly Reception, so offensive threats such as Zarude and Serperior are essential teammates. These Grass-types in addition to Hydrapple all provide valuable checks to Water-types like Quaquaval, Keldeo, and Rotom-W and keep Hippowdon from being overwhelmed by the likes of Excadrill. Toxapex can cripple Slowking with Toxic and checks deadly threats to sand such as Greninja, Quaquaval, and Azumarill. Toxapex also serves as a backup check to Okidogi and can notably cripple it with Toxic after it has Terastallized into a Fairy-type to set up on Hippowdon with Bulk Up while potentially setting Toxic Spikes as a means to punish foes like Ogerpon-C. Latios, Volcanion, and Nasty Plot Tornadus-T serve as key progress makers on sand, being able to take out annoying foes such as Hydrapple, Azumarill, and Zarude. Assault Vest Tornadus-T can instead function in a more defensive role to handle foes like Latios, Hydrapple, and Serperior, enjoying Hippowdon’s ability to check Zapdos, Sandy Shocks, and Hisuian Arcanine, and provides item removal with Knock Off. Tinkaton enjoys Hippowdon opening up the Stealth Rock slot for another utility move in Encore or Thunder Wave and takes down foes such as Latios and Hoopa-U while switching into Mandibuzz.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 461329, "username": "Estarossa"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Weavile": {"sets": {"Swords Dance": {}}},
  "Rhyperior": {"sets": {"Stealth Rock": {}}},
  "Mamoswine": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Mamoswine functions as an excellent wallbreaker thanks to its nearly unwallable Ice / Ground STAB combination and high base Attack, allowing it to break through common threats such as Hydrapple, Okidogi, Toxapex, and Zapdos. Ice Shard is a reliable priority move that allows Mamoswine to bypass its below average Speed to revenge kill foes such as Ogerpon-C, Latios, and Thundurus-T. Trailblaze not only raises Mamoswine's otherwise subpar Speed but also allows it to hit Rotom-W, the only Pokemon in the tier that can wall Mamoswine's STAB combination. Knock Off can be used as an alternative to cripple Rotom-W and other checks like Slowking by removing their items, allowing Mamoswine or another teammate to break through them more efficiently later on. Substitute can also be used as an option to force switches and grant Mamoswine a safety net, though it must be used in tandem with Leftovers to preserve Mamoswine's longevity. Never-Melt Ice further boosts the power of Mamoswine's Ice-type STAB attacks. Heavy-Duty Boots can be used instead to prevent Mamoswine from being chipped down by hazards, though it comes at the price of lower power. Thick Fat reduces the damage Mamoswine takes from Hisuian Arcanine's Flare Blitz, allowing it to easily OHKO it back while also allowing it to take Heat Wave from Zapdos and Tornadus-T. Tera Grass boosts the power of Trailblaze while allowing Mamoswine to tank powerful Water-type moves from foes like Greninja, Azumarill, and Quaquaval. It also helps Mamoswine handle Grass-types like Hydrapple and Ogerpon-C better, though it also makes Mamoswine weak to Zapdos and Tornadus-T's Hurricane and Lokix's First Impression. Tera Ice bolsters the power of Mamoswine's Ice-type moves even further, allowing it to score OHKOs with Ice Shard on Ogerpon-C, Latios, and Tornadus-T after Stealth Rock. Tera Fairy can be used to give Mamoswine a resistance to Fighting-type moves, allowing it to better handle Cobalion and Choice Scarf Okidogi while still taking neutral damage from Water-type moves.</p> <p>Mamoswine fits best on bulky offense and offensive teams that appreciate its ability to wallbreak with its powerful STAB combination. Mamoswine's lackluster Speed and poor defenses make it hard for it to get in safely, which can be made easier by pairing it with pivots such as Lokix, Zapdos, Tornadus-T, and Slowking. Lokix also helps revenge kill threats like Hoopa-U and Greninja that cannot be revenge killed with Ice Shard, and the latter three also handle Fighting-types like Okidogi and Cobalion that threaten Mamoswine; Zapdos in particular can handle threats like Azumarill, Scizor, and Metagross, all of which scare Mamoswine out with their super effective STAB priority moves. Mamoswine's biggest checks are Water-types like Rotom-W, Slowking, and Greninja, so Grass- and Electric- types like Hydrapple, Ogerpon, Serperior, and Thundurus-T make great partners to handle these threats. Entry hazard setters such as Cobalion, Tinkaton, and Excadrill help to soften up threats like Latios and Assault Vest Tornadus-T for Mamoswine in the late-game via chip from Stealth Rock. Excadrill in particular makes a great partner, as it can put pressure on Rotom-W with Mold Breaker Earthquake and spin hazards away. In return, Mamoswine handles threats like Hydrapple and Sinistcha, making it easier for Swords Dance Excadrill to clean up teams late in the game. Mamoswine does not like switching into Zapdos and getting chipped by its Hurricane, so Pokemon that can handle Zapdos, such as Sandy Shocks and Latios, make great partners. The former provides hazard support, also checks Cobalion and Scizor, and acts as a pivot with Volt Switch to safely bring Mamoswine in against Hydrapple and Latios, while the latter revenge kills Quaquaval and Cobalion for Mamoswine while working in tandem with it to overwhelm their shared check, Slowking.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540058, "username": "StarFalcon555"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Rotom-Wash": {
    "sets": {
      "Utility Pivot": {
        "description": "<p>Rotom-W thrives as a pivot within the tier thanks to its unique typing, solid bulk in tandem with access to Pain Split, and access to a great ability in Levitate. Hydro Pump gives Rotom-W an excellent STAB option and makes the life of Ground-types wishing to block Volt Switch such as Rhyperior and Excadrill hard. Volt Switch lets Rotom-W generate momentum on Pokemon that would easily take a Hydro Pump such as Azumarill, Tornadus-T, and Slowking. Will-O-Wisp helps Rotom-W cripple physically offensive threats that dislike being burnt such as Ogerpon and Excadrill while slowly chipping down any burnt Pokemon. Thunder Wave, on the other hand, punishes Tornadus-T and Latios by slowing them down while helping teammates take advantage of the Speed cut as well as the chance of paralysis. Pain Split in tandem with Rotom-W's naturally low HP stat allows it to recover a significant amount of health on foes like Hydrapple and Slowking, keeping itself healthy throughout the game. Leftovers is used to increase Rotom-W's longevity over the course of the match, letting it passively recover its health. Rotom-W is able to run two distinct EV spreads, both of which maximize its HP while allowing it to outspeed Adamant Scizor and Tyranitar. Investment into Rotom-W's Defense with a Bold nature lets it handle Sand Rush Excadrill and Metagross while living a Choice Band Hisuian Arcanine Head Smash. Rotom-W with a Calm nature and EVs in Special Defense make it a solid check to Greninja, Tornadus-T, and Zapdos. Tera Steel combined with Levitate removes the Ground weakness it would otherwise gain while gifting Rotom-W a spectacular defensive typing, letting it check Ogerpon-C and Latios better.</p> <p>Rotom-W's traits fit best on bulky offense teams that love its ability to cripple opposing Pokemon while pivoting on and off the field. Wallbreakers such as Ogerpon-C and Metagross fit excellently with it, being able to take advantage of Latios, Hydrapple, and Zapdos, which may want to switch into Rotom-W to block its shenanigans, with Metagross also functioning as a solid Latios check. Other pivots that synergize well with Rotom-W such as Lokix, Scizor, and Tornadus-T are excellent teammates, with Lokix and Scizor forming a strong VoltTurn core while handling Ogerpon, Hydrapple, and Latios for Rotom-W, while Assault Vest Tornadus-T can pivot into Latios and Keldeo for it. Ogerpon specifically both functions as a pivot and a way of punishing setup sweepers like Dragon Dance Salamence and Calm Mind Latios with Encore thanks to Rotom-W's Volt Switch giving it free entry. Entry hazard setters like Tinkaton and Cobalion are fantastic partners for Rotom-W that support it with their strong defensive profiles. Hydrapple is an great check to Excadrill as well as the Ogerpon formes that appreciates Rotom-W's ability to handle Flying- and Ice-type types like Zapdos, Tornadus-T, and Mamoswine. Hisuian Arcanine functions excellently with Rotom-W, being able to maximize its offensive potential thanks to Rotom-W baiting in the likes of Hydrapple and Tinkaton for it, with Will-O-Wisp chipping down opposing checks like Mamoswine and Thunder Wave allowing Hisuian Arcanine to outspeed Pokemon like Latios and Keldeo.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540289, "username": "Tidal"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Heatran": {"sets": {"Offensive": {}, "Defensive": {}}},
  "Manaphy": {"sets": {"Tail Glow": {}}},
  "Serperior": {
    "sets": {
      "Dual Screens": {},
      "Glare": {
        "description": "<p>Thanks to its high Speed and plethora of move choices, Serperior cements itself as a strong utility Pokemon. Glare is a powerful option that can cripple common switch-ins to Serperior like Tornadus-T and Latios. When combined with Contrary, Leaf Storm allows Serperior to threaten foes by launching a powerful STAB attack that also boosts its power at the same time. Tera Blast provides Serperior with a strong, customizable coverage option; Tera Blast Electric nails foes like Tornadus-T and Mandibuzz while providing neutral coverage against Zapdos, Tinkaton, Metagross, and Scizor. Tera Blast Fire deals super effective damage to the aforementioned Steel-types as well as other foes such as Lokix and Zarude while also hitting Thundurus-T for meaningful damage. In addition, even without Tera, Tera Blast can act as strong enough neutral coverage against several foes that resist Leaf Storm. Alternatively, Dragon Pulse bolsters Serperior's coverage without the need for Tera, allowing it to hit foes such as Latios and Hydrapple for meaningful damage. Synthesis allows Serperior to restore its health in order to stick around longer, improving its longevity and helping it against more passive foes such as Slowking and Rotom-W. Knock Off and Substitute are also options to further cripple foes that Serperior has paralyzed and to take advantage of the switches it can force with Leaf Storm, respectively, but are generally not preferable due to being overall more prediction-reliant and less consistently useful than Synthesis. Leftovers increases Serperior's longevity and allows it to take advantage of the extra turns generated by paralysis while also being able to generate more setup opportunities for itself with Leaf Storm. An alternative spread of 252 HP / 4 SpD / 252 Spe can be used to improve Serperior's matchups against foes such as Excadrill and Ogerpon-C but further underscores Serperior's lack of immediate power. Tera Electric is used to provide a resistance to Flying, greatly improving Serperior's matchup against Zapdos and Tornadus-T, while also removing Serperior's weakness to Bug and giving it an additional resistance to Steel, making it less vulnerable to Scizor and Lokix. It also offers a handy immunity to paralysis, making Serperior safer against foes like Slowking, Rotom-W, and Cobalion. Tera Fire allows Serperior to offensively threaten foes it would otherwise be helpless against, such as Scizor and Tinkaton, but should be used with caution, as it does miss out on many of the notable benefits of Tera Electric while also making Serperior weak to Stealth Rock and more vulnerable to revenge killing attempts from Azumarill and Greninja.</p> <p>Glare Serperior fits best on offensive teams with slow and strong wallbreakers that can take advantage of its ability to spread paralysis, such as Mamoswine, Okidogi, and Hoopa-U. In addition, Serperior can soften up checks to these Pokemon such as Toxapex with Leaf Storm and can also clean out weakened foes after these wallbreakers have blown holes in the opposing team. These wallbreakers can also remove problematic foes such as Hydrapple that can shrug off Serperior's attacks with ease and are not overly threatened by paralysis. Tornadus-T also makes for an excellent partner, as it is able to check Latios, Greninja, and Hydrapple and can assist Serperior by pivoting it in against targets like Rhyperior and Slowking with U-turn or harassing its paralysis targets with Knock Off. Many Stealth Rock setters, such as Cobalion and Rhyperior, also greatly appreciate Serperior's ability to slow down their checks and give them more chances to set up the hazard, with the latter also appreciating Serperior's ability to threaten Excadrill. In return, Serperior appreciates the chip damage from Stealth Rock making its Contrary-boosted attacks even more potent and punishing Assault Vest Tornadus-T, which it notably struggles against. The aforementioned Cobalion, as well as Pokemon such as Zapdos and Okidogi, also provides a defensive out to revenge killers such as Lokix and Scizor. Skeledirge is also an extreme nuisance, as Serperior can not break it at all, so teammates that can handle it such as Greninja and Hoopa-U are appreciated. Serperior notably struggles with the tier's multitude of Flying-types without Tera, especially Zapdos, so checks to them such as Ogerpon-C, Thundurus-T, and the aforementioned Rhyperior are greatly appreciated, with Serperior softening up their checks in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "gulch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Excadrill": {
    "sets": {
      "Utility": {},
      "Swords Dance": {
        "description": "<p>When using Swords Dance, Excadrill acts as both an excellent utility Pokemon with Rapid Spin and a dangerous wallbreaker and cleaner all in one set. Rock Slide is preferred over Iron Head to let Excadrill more easily beat Zapdos, Mandibuzz, and Tornadus-T; however, Iron Head allows Excadrill to break past Hydrapple and Sinistcha. Rapid Spin is used both for its ability to remove entry hazards and also the crucial Speed boost it gives that lets Excadrill outrun the unboosted metagame. Tera Dragon lets Excadrill flip weaknesses to common moves used to check it like Greninja's Surf, Azumarill's Aqua Jet, and Hisuian Arcanine's Flare Blitz, while Tera Ground gives it a strong power boost on Earthquake, letting it OHKO Slowking at +2; this also sheds its weakness to opposing Excadrill's Earthquake. Tera Electric is useful on Iron Head sets to let Excadrill beat Zapdos despite lacking coverage to hit it. These are the main choices, but Excadrill can viably run a lot of Tera types; Tera Fire lets it set up on Skeledirge, Tera Fairy and Tera Ghost give it a resistance or immunity to moves like Mienshao's Close Combat while Tera Fairy also lets it resist Mandibuzz's Foul Play, Tera Flying lets it beat opposing Excadrill more consistently, and Tera Water helps with Greninja while retaining a stronger Scizor and Mamoswine matchup. Leftovers lets Excadrill play more flexibly mid-game before it goes for a sweep, but Air Balloon lets Excadrill beat opposing Excadrill and act as a more reliable hazard remover against Spikes teams, particularly those using Sandy Shocks.</p> <p>Excadrill fits on just about any team you can think of thanks to its remarkable offensive capabilities and utility. Hydrapple is a huge roadblock for Excadrill, so Pokemon like Lokix, Tornadus-T, and Enamorus-T make for wonderful partners capable of pressuring it. Excadrill in return is great at supporting these Pokemon if they forgo Heavy-Duty Boots to alleviate their weakness to Stealth Rock by removing them from the field with Rapid Spin. It appreciates support from entry hazard setters like Tinkaton and Hisuian Arcanine; with the help of Knock Off users like the aforementioned Tornadus-T and Lokix, Excadrill can much more easily cleave through checks like Zapdos and Slowking. Tinkaton and Assault Vest Tornadus-T are also great pivots into Latios, which is appreciated by Excadrill because it doesn't take Draco Meteor well without bulk investment. Slowking makes for an effective partner, as it can check Latios, which Excadrill can often struggle with despite its type advantage. Excadrill has few defensive checks, but teammates like Scizor and Mamoswine that can threaten or weaken checks like Hydrapple and Zapdos are extremely appreciated. Excadrill can be revenge killed by foes like Greninja, Azumarill, and Lokix, so checks like Keldeo, Zapdos, and Rotom-W make for helpful teammates.</p>"
      },
      "Sand Rush": {
        "description": "<p>Sand Rush Excadrill is a deadly threat, being a great sweeper, wallbreaker, and revenge killer thanks to the combination of Swords Dance and it outpacing the entire boosted metagame under sand. After a Swords Dance, Rock Slide does heavy damage to Zapdos, Mandibuzz, and Tornadus-T. Rapid Spin is primarily used for the utility it brings with removing entry hazards; however, its Speed boost can potentially prevent Excadrill from being revenge killed once sand has subsided. Iron Head can be used over Rapid Spin if the team is not pressured by hazards as much, which can help it break past Hydrapple and Latios more easily. Iron Head can also be used over Rock Slide, but it should be paired with Tera Electric so Excadrill can get past Zapdos. Air Balloon provides some utility against Sandy Shocks, Rhyperior, and opposing Excadrill, but Leftovers can be used for passive recovery. Life Orb can be considered, as it notably allows Excadrill to OHKO Zapdos and Slowking after a Swords Dance boost, though it will cut into Excadrill's longevity and potentially bring it into range of priority from Lokix and Keldeo. A Jolly nature is primarily used so Excadrill can Speed tie with opposing Excadrill outside of sand. It also lets Excadrill outpace Battle Bond-activated Greninja under sand; however, it would be reliant on a defensive Tera to take Water Shuriken. An Adamant nature can be used to help improve the chances of KOing Pokemon like Slowking after a Swords Dance. Tera Rock increases the damage of Rock Slide to KO Mandibuzz and Zapdos, and the Special Defense boost under sand can help it beat foes like Hydrapple and take priority from Keldeo and Greninja better. Tera Dragon provides many useful resistances, notably letting it take priority hits from Greninja and Azumarill. Tera Ground provides a boost to Earthquake, allowing Excadrill to OHKO Slowking at +2 and remove its weakness to opposing Excadrill's Earthquake. Other Tera options are also great on Excadrill such as Fairy to beat Mandibuzz reliably and Fire to have a better matchup against Skeledirge.</p> <p>Excadrill fits best on offensive teams that can break down defensive structures to help Excadrill sweep more easily. Sand is essential, so Tyranitar or Hippowdon are mandatory partners, both being able to set Stealth Rock to help potentially bring foes into KO range. Tyranitar can help check and pressure Mandibuzz and Zapdos for Excadrill as well as force damage on other common answers like Keldeo. Alternatively, Hippowdon offers a sturdy check to opposing Excadrill and can afford to run Smooth Rock more easily due to having reliable recovery in Slack Off. Lokix can revenge kill Excadrill with minor chip damage, so a partner like Zapdos or Cobalion can keep it in check; the latter can run Stealth Rock to allow Excadrill's partner Tyranitar to run a more offensive set. Azumarill is easily one of the deadliest threats to sand teams, so Pokemon like Volcanion, Rotom-W, and the aforementioned Zapdos are excellent teammates, all also having favorable matchups into rain teams. Rotom-W is a huge roadblock for Excadrill, so it is essential to run partners that can overwhelm it like Latios and Keldeo. Keldeo in particular can force in Excadrill answers like Latios, Hydrapple, and Sinistcha and heavily dent, or in Hydrapple's case OHKO, them with Icy Wind. Hydrapple is another partner that can pressure Rotom-W but also deals with other Pokemon like Slowking, Ogerpon, and Zarude for Excadrill. Mandibuzz can help pivot into Ogerpon and opposing Excadrill as well as provide Defog support, freeing up Excadrill to run Iron Head over Rapid Spin.</p>"
      },
      "Lead": {
        "description": "<p>Excadrill can be a useful lead on hyper offense teams thanks to its ability to enable threats like Ogerpon-C and Greninja that enjoy entry hazards being removed while providing some facet of removal against Sticky Web teams. Excadrill compresses Stealth Rock as a lead and can get it up by forcing out Pokemon such as Metagross, Rotom-W, and Tyranitar. Rock Tomb can slow down Pokemon attempting to set up against Excadrill like Zarude and Thundurus-T as well as general offensive leads like Tornadus-T and Ogerpon. Steel Beam is an alternative so Excadrill can KO itself to deny Mandibuzz and opposing Excadrill from removing its entry hazards, but Excadrill still offers some useful traits like checking Latios and Comfey that make it worth not KOing itself. Focus Sash guarantees that Excadrill can get off at least one attack, often choosing to use Rapid Spin into Stealth Rock into attacking. While Excadrill should not be Terastallized under most common circumstances, as the mechanic is better utilized by a sweeper on the hyper offense team, Tera Ghost can be used in an emergency to block Rapid Spin from opposing Excadrill to guarantee Stealth Rock remains up.</p> <p>Lead Excadrill is exclusively relegated to hyper offense teams as a lead that enables many sweepers to perform effectively. Quaquaval and Ogerpon-C are two of the best sweepers of the archetype, the latter benefitting from Excadrill keeping off Stealth Rock, and they are able to take advantage of threats Excadrill gives entry to such as Keldeo, Slowking, and Zapdos. Mimikyu can block Rapid Spin from opposing Excadrill, allowing Tera to be preserved, and utilizes the entry hazards to take out foes like Tinkaton more easily while providing very valuable defensive utility against Lokix, Latios, and Greninja. Greninja appreciates entry hazard chip damage wearing down Tornadus-T and can offensively check foes like Slowking, Cobalion, and Hydrapple. Threatening sweepers like Comfey and Okidogi are able to set up on and pressure Mandibuzz and Lokix, not to mention they can use Tera themselves to now take out other threats like Metagross and Tinkaton for the former and Zapdos and Excadrill for the latter. Bisharp similarly can punish Mandibuzz attempting to use Defog with Defiant and take advantage of Stealth Rock chip damage to clean with Sucker Punch, while Azumarill takes advantage of Pokemon that lead Excadrill invites in such as Hydrapple, Quaquaval, and Hippowdon while liking hazards up to break Ogerpon-C's Sturdy.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 481709, "username": "Lily"}, {"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 617840, "username": "gulch"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 524894, "username": "cheru"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Krookodile": {"sets": {"Stealth Rock": {}}},
  "Haxorus": {"sets": {"Choice Band": {}}},
  "Mandibuzz": {
    "sets": {
      "Mixed Defensive": {
        "description": "<p>Mandibuzz has a solid niche in the UU metagame thanks to a unique and solid defensive typing, great mixed walling capabilities, and access to rare utility options like Defog and Toxic that make it a valuable addition to bulkier builds. Foul Play lets it threaten out Pokemon like Metagross, Excadrill, Scizor, and Belly Drum Azumarill. Defog lets Mandibuzz remove entry hazards for its teammates, especially against threats like Metagross and Rhyperior, although the latter might require more precise positioning than the former; it must be hit with Toxic first to be worn down, allowing Mandibuzz to utilize its natural bulk to tank Stone Edge, freely use Defog, and then use Roost to heal off the damage while not being trapped in a healing cycle due to the inability to progress against Rhyperior. Roost keeps it healthy throughout a match, allowing it to repeatedly come in and check Latios, Excadrill, Ogerpon, and Scizor. Toxic alleviates Mandibuzz's passivity a bit, threatening opposing bulky Pokemon like Slowking and Zapdos and setup sweepers like Nasty Plot Hydrapple and Calm Mind Tera Electric Latios. U-turn is an alternative to either Defog or Toxic that allows it to act as a slow pivot to maintain momentum against counters like Cobalion and Tinkaton, but Mandibuzz does not usually fit on the offensive structures that necessitate the need of U-turn to keep it from being a momentum sink. Heavy-Duty Boots keeps away the pesky damage from entry hazards. The given Speed investment allows Mandibuzz to outspeed Azumarill, while the Special Defense investment allows it to survive two Soul Dew-boosted Draco Meteors from Latios. Tera Steel helps Mandibuzz better answer foes like Latios and Greninja while flipping the script against foes like Ogerpon-C and shielding it from opposing Toxic. Tera Fairy lets it counter Dragon-types like Latios much more reliably, especially if it chooses to carry Toxic, and allows Mandibuzz to now gain a Fighting resistance while keeping its Ground neutrality against Excadrill.</p> <p>Mandibuzz best fits on balance and stall builds that enjoy its mixed walling and key utility features. Skeledirge is a great partner, as its typing and ability let it handle annoying Pokemon like Hydrapple and Cobalion somewhat consistently, while also helping against Tera Electric Calm Mind Latios. Toxapex also is a great partner, being a fantastic Knock Off absorber against Tornadus-T and Lokix, while also handling threats like Azumarill and Greninja that Mandibuzz struggles against. Tinkaton can not only act as a secondary check to Latios so that Mandibuzz won't get overwhelmed, but also beat the threatening Ogerpon-C. Mandibuzz also struggles a lot against Zapdos, so it synergizes well with Zapdos checks like Rhyperior, Hippowdon, and Bellibolt. In addition, Rhyperior and Hippowdon happen to also check Hisuian Arcanine, another Pokemon that Mandibuzz struggles against. Excadrill is another Pokemon that can give Mandibuzz trouble, so a check like Hydrapple or Slowking is necessary. Slowking also has the benefit of providing more assurance against Latios.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 647932, "username": "Goombatower69"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 617840, "username": "gulch"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Hydreigon": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Cobalion": {
    "sets": {
      "Utility": {
        "description": "<p>Cobalion serves as one of the best Stealth Rock setters in the metagame due to its good matchups into the most common hazard removal options, Excadrill and Mandibuzz, while also being one of the best sponges for Lokix's First Impression. Volt Switch allows Cobalion to pivot out on would-be switch-ins such as Latios and Slowking and bring in a teammate to threaten them out. Thunder Wave can punish Tornadus-T and the aforementioned Latios for switching in, while Stone Edge can be used to hit Flying-types like Thundurus-T super effectively. Leftovers gives Cobalion more longevity, allowing it to check opposing threats for an extended period of time, while Rocky Helmet allows it to punish Lokix more easily and get chip damage on other contact moves users such as Scizor and Tyranitar. Shuca Berry is another option that allows Cobalion to switch into or stay in on Earthquakes from unboosted Excadrill. Tera Dragon gives Cobalion a resistance to Water-type attacks such as Surf from Greninja, which is then OHKOed back with Close Combat, while making it neutral to Ground and preserving its Grass resistance so it can still check Ogerpon. Tera Ghost allows it to preserve Stealth Rock in the event the opposing Excadrill uses its Tera to flip the matchup while also making Cobalion neutral to Ground-type attacks and immune to Fighting-type attacks such as Close Combat from Scizor and opposing Cobalion. Tera Flying gives it an immunity to Ground-type attacks, allowing it to more easily answer even a Speed-boosted Excadrill. However, Cobalion's base typing is very useful for answering threats like Lokix, Scizor, and Tyranitar, so it should usually only Terastalize if there is no other option at the time.</p> <p>Cobalion fits on Volt Turn offense, bulky offense, and balance teams, utilizing its good matchups into the most common hazard removal options to keep Stealth Rock up for a solid portion of the game while using Volt Switch to bring threats onto the field. Unfortunately, Cobalion doesn't resist Flying and Psychic, so alternative checks to threats like Tornadus-T and Latios are needed. Slowking can check both Latios and Tornadus-T while also providing Thunder Wave support so Cobalion is more free to use Taunt. In return, Cobalion can switch into Lokix and Scizor, which can threaten Slowking. Pivot Tornadus-T can act as a check to Latios while using Knock Off so that foes such as Slowking and Skeledirge are susceptible to Cobalion's Stealth Rock and U-turn to continue the pivot chain. Sandy Shocks and Thundurus-T can both switch into Zapdos and block Volt Switch while also applying pressure on Ground-types like Rhyperior, as well as Cobalion checks like Hydrapple and Latios. Cobalion is also threatened by Okidogi, so ways to offensively pressure it like Excadrill, Latios, and the previously mentioned Tornadus-T are appreciated. The latter two, alongside Grass-types like Hydrapple and Zarude, also provide a Ground resistance to help cover Cobalion's weakness. Excadrill, on the other hand, provides a Latios check that can remove hazards while also offensively checking Skeledirge and Toxapex. Choice Specs Greninja offensively pressures everything that can threaten Cobalion, and it appreciates Cobalion's ability to draw in foes and pivot on them alongside Stealth Rock for chipping Assault Vest Tornadus-T into Ice Beam range.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Tornadus-Therian": {
    "sets": {
      "Pivot": {
        "description": "<p>Tornadus-T is a very important pivot in the metagame, making use of its high Speed and Knock Off to help force progress against opposing teams and U-turn to pivot out on switch-ins like Zapdos and Rotom-W while remaining healthy with Regenerator. Hurricane is an option over Bleakwind Storm if one wants to sacrifice accuracy for power and a confusion chance. Heat Wave provides coverage for Steel-types like Scizor, Excadrill, and Tinkaton, while Focus Blast is less accurate but is more powerful and hits Rock-types like Tyranitar and Hisuian Arcanine. Taunt is an option on Heavy-Duty Boots sets that disrupts utility moves like Thunder Wave from Slowking and Defog or Toxic from Mandibuzz, but it is often not worth losing out on coverage. Assault Vest helps Tornadus-T sponge powerful special attacks from threats like Latios, Greninja, and Hydrapple. Alternatively, it can opt for Heavy-Duty Boots to allow it to make the most out of Regenerator without a Stealth Rock weakness. 192 Speed EVs and a Timid nature allow it to outspeed Serperior and base 110 Speed Pokemon like Latios and Ogerpon-C, while 208 HP and 108 Special Defense EVs give it a good chance to withstand Choice Specs Latios's Draco Meteor from full HP, even without an Assault Vest. Tera Steel allows Tornadus-T to more easily switch into Latios and Hydrapple, helps it sponge hits from Ogerpon-C, and gives it a resistance to Stealth Rock. Tera Electric allows Tornadus-T to switch into Flying-types like Zapdos and opposing Tornadus-T while protecting it from Zapdos's Static. However, it is important to note that using these Tera types makes Tornadus-T weak to Ground and susceptible to Spikes, so Terastallization generally shouldn't be used unless needed.</p> <p>Pivot Tornadus-T fits on both offense and balance teams, utilizing its ability to force progress and its high Speed to help wear down the opposing team and bring in its teammates. However, having an Assault Vest means that it is susceptible to Stealth Rock damage, and thus, it appreciates having teammates that can remove entry hazards like Excadrill and Mandibuzz. Heavy-Duty Boots sets do not need as much but require backup checks to foes such as Greninja and Latios. It also appreciates other pivots like Zapdos and Lokix to help it switch in and out more to heal as well as additional Regenerator Pokemon for it to switch into like Hydrapple and Slowking. These Regenerator pivots make it easier for Tornadus-T to make use of its own Regenerator while also helping answer offensive threats it cannot handle like Rhyperior or Hisuian Arcanine. Hydrapple, as well as other Grass-types like Zarude and Sinistcha, also provides a second Ground-resistant team member should Tornadus-T be forced to Terastallize. Tornadus-T also appreciates Ground-types that can absorb Volt Switch from Zapdos such as Rhyperior, Hippowdon, and Sandy Shocks. Tornadus-T can be paired alongside fast offensive threats like Ogerpon to provide a team two fast progress-makers that can overwhelm defensive Pokemon like Hydrapple, Zapdos, and opposing Tornadus-T, and it also fits well alongside wallbreakers such as Mamoswine and Latios, which appreciate its ability to pivot them in.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Tornadus-T's fantastic Speed tier allows it to outspeed and force out many common threats such as Keldeo and Ogerpon, granting it many opportunities to set up a Nasty Plot. This turns it into a powerful wallbreaker that can muscle through standard checks such as Tinkaton, Slowking, and Toxapex. Hurricane's additional power is significant, notably guaranteeing the OHKO on Keldeo, OHKOing bulkier variants of Azumarill at +2, and having a high chance to OHKO Latios after a Nasty Plot boost. Bleakwind Storm can still be considered, as it is slightly more reliable but will require support from entry hazards to make up for the slight drop in power. Heat Wave provides coverage to nail Steel-types like Tinkaton, Excadrill, and Metagross while also being a more reliable move into offensive threats like Lokix and Ogerpon. It is also one of Tornadus-T's best means to hit other Flying-resistant foes like Zapdos and Raikou for neutral damage. Focus Blast provides the necessary coverage to OHKO Pokemon like Tyranitar and Hisuian Arcanine. Weather Ball is an option on weather teams that allows Tornadus-T to OHKO Zapdos and opposing Tornadus-T in sand, as well as threatening the aforementioned Pokemon and Sandy Shocks in snow. U-turn is an alternative that provides some utility, allowing Tornadus-T to switch out of unfavorable matchups against Rhyperior and Empoleon to bring in a partner more capable of dealing with them. The EV spread has enough Speed to outpace base 115s like Raikou and Cinccino, while the bulk prevents it from being OHKOed by Tera Bug Silver Powder-boosted First Impression from Lokix. Tera Electric removes its Electric weakness in a pinch to better deal with Zapdos and Raikou while also avoiding Thunder Wave from Slowking and Tinkaton.</p> <p>Tornadus-T fits best on a variety of playstyles such as hyper offense, which can apply enough offensive pressure to defensive structures, or bulky offense and balance teams that can provide a strong enough backbone to support a more offensive set. Toxapex and Slowking can form a Regenerator core with Tornadus-T, which can help offset the severity of any drawbacks from it potentially missing a move against Pokemon such as Azumarill and Latios. Slowking can also provide Thunder Wave support to cripple faster threats to Tornadus-T such as Greninja and use Chilly Reception to bring Tornadus-T in against Pokemon like Hydrapple while setting snow if using Weather Ball. Skeledirge is a pain for Tornadus-T to break through, so partners like Hisuian Arcanine and Tyranitar can apply pressure to it, the former two also having a great matchup against Zapdos that Tornadus-T can struggle to break without Terastilizing into an Electric-type. Sandy Shocks can also help pressure Zapdos and provide entry hazard support, like the three aforementioned Pokemon, to help wear down Tornadus-T's checks. Rock-types such as Tyranitar, Hisuian Arcanine, and Rhyperior are massive problems for Tornadus-T to break if it lacks Focus Blast, so partners like Keldeo and Greninja are ideal, and they all greatly appreciate being brought in safely against them if Tornadus-T is running U-turn. Lokix and Scizor invite Zapdos in and remove its Heavy-Duty Boots with Knock Off, allowing it to be weakened into range of a Nasty Plot-boosted Heat Wave. They can also bring Tornadus-T in safely against Pokemon such as Mandibuzz and Okidogi to find opportunities to set up a Nasty Plot to start wallbreaking. Their strong priority moves are also extremely beneficial for removing faster foes such as Choice Scarf Latios and Greninja.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 617840, "username": "gulch"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}, {"user_id": 461329, "username": "Estarossa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Thundurus-Therian": {
    "sets": {
      "Pivot": {},
      "Nasty Plot": {
        "description": "<p>Nasty Plot takes Thundurus-T's already monstrous Special Attack and amplifies it to be a destroyer of balance builds, being nigh unwallable after a boost and functioning as a key early-game wallbreaker for its team that also happens to counter Zapdos, enabling physical sweepers like Azumarill and Scizor. At +2, Thundurus-T is able to OHKO numerous bulky foes such as Metagross, Okidogi, Hydrapple, and defensive Zapdos and 2HKO others such as Pecharunt and Tinkaton with Thunderbolt. Sludge Bomb provides key coverage to nail Hydrapple and Serperior while being a strong neutral move against Latios. It also covers Tera Fairy users such as Skeledirge and Okidogi. Focus Blast drops the likes of Excadrill and Mamoswine unboosted and OHKOes Sandy Shocks and Rhyperior at +2. Tera Steel avoids revenge killing attempts from faster threats such as Ogerpon-C and Latios. Meanwhile, Tera Water stops Greninja from using Surf and Ice Beam to nail Thundurus-T and allows Thundurus-T to reactively answer Quaquaval and Belly Drum Azumarill, both of which are threats to the hyper offense teams Nasty Plot Thundurus-T finds itself on.</p> <p>Nasty Plot Thundurus-T best fits on hyper offense teams that enable it to wallbreak early in the game. Entry hazard setters like Mew and Excadrill are key to wear down bulky foes like Pecharunt and Assault Vest Okidogi into range of +2 Thunderbolt. Greninja is a phenomenal teammate, being a constant source of offensive pressure against faster foes like Latios and Serperior while working to overwhelm the likes of Tinkaton and Okidogi. Comfey offensively pressures numerous revenge killers such as Latios, Lokix, and Keldeo. Physical wallbreakers like Ogerpon-C and Azumarill can take out Ground-types such as Hippowdon, Donphan, and Sandy Shocks. Both Ogerpon-C and Greninja also excel at overwhelming Skeledirge or forcing it to Terastallize at least, with Thundurus-T having the ability to get heavy damage on all variants post-Tera. Quaquaval and Mimikyu help out in the opposing offense matchup and break past annoying Pokemon like Greninja and Latios. Grimmsnarl can provide dual screens support, allowing Thundurus-T to boost more freely without fearing revenge killing from Pokemon such as Lokix and Zarude.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 461329, "username": "Estarossa"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Keldeo": {"sets": {"Calm Mind": {}, "Choice Specs": {}}},
  "Chesnaught": {"sets": {"Spikes Utility": {}}},
  "Greninja": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With its wide coverage combined with its excellent ability Protean, Choice Specs Greninja is a scary wallbreaker that hits all of the metagame at least neutrally while outspeeding common offensive Pokemon such as Latios and Ogerpon-C. Surf is the best option to deal strong damage, as Hydro Pump can unfortunately miss and lacks PP. However, Hydro Pump could still be an option to inflict more damage, as it can OHKO defensive Excadrill and 2HKO defensive Tyranitar and Tinkaton, though Surf deals with these Pokemon with entry hazards anyway. Ice Beam is able to hit Tornadus-T, Mandibuzz, Zapdos, and Ogerpon-C super effectively, whereas Sludge Wave can surprise common switch-ins like Azumarill and Keldeo and gives Greninja a resistance to Fighting-type moves, such as Secret Sword, allowing it to 2HKO Keldeo. Spikes chips the opposing team in the long term and punishes switch-ins, helping Greninja and its teammates clean more easily. Greninja naturally finds some good opportunities to set up a layer of Spikes or two thanks to the switches it naturally forces. U-turn is an alternative that grants Greninja some momentum, allowing it to pivot out on Pokemon that can wall it such as Empoleon, Gastrodon, and Toxapex. Tera Water is preferred to boost the power of Greninja's Water-type move, guaranteeing an OHKO on Scizor and Cobalion with Surf and a 2HKO on Keldeo with Hydro Pump, although it shouldn't Terastallize outside of an emergency because it'll lose the boost of Protean.</p> <p>Due to its severe frailty and incapacity to switch in easily, Greninja fits well on bulky offense teams that can afford slow VoltTurn support to bring it safely into battle, and they also provide some defensive backbones for Greninja to rely on. Teammates such as Zapdos, Tornadus-T, and Slowking are thus very appreciated. Zapdos is also a strong answer to Azumarill, while Slowking can be useful to pressure Toxapex and Gastrodon with Future Sight. Excadrill is a helpful partner that can help Greninja by crushing common Water-resistant Pokemon like Rotom-W, allowing Greninja to spam its Water-type move. Also, Excadrill is capable of removing entry hazards, which can be a little overwhelming for Greninja. In the same way, Knock Off support helps Greninja by removing crucial items such as Assault Vest on Tornadus-T and Heavy-Duty Boots on Slowking and Volcanion. Examples of users would be Tornadus-T and Tinkaton. Since Greninja causes a lot of switches, hazard setters like Sandy Shocks and Cobalion are helpful. Cobalion can also check the powerful Lokix. Lastly, offensive teammates such as Calm Mind Latios and Comfey like the opposing team weakened by Greninja's powerful moves so that they can clean up, while others such as Ogerpon-C and Lokix can overwhelm their shared checks with Choice Specs Greninja, with examples of these being Toxapex, Tinkaton, and Empoleon.</p>"
      },
      "Battle Bond": {
        "description": "<p>Battle Bond turns Greninja into one of UU’s deadliest sweepers and revenge killers, as simply getting just one KO alone grants Greninja significant boosts in Special Attack and Speed to become a very difficult-to-wall sweeper that also avoids revenge killing attempts barring priority. Hydro Pump is an option over Surf for greater power, but Surf’s accuracy is much more desirable due to Greninja’s frailty and Hydro Pump's potential to be punished via a miss. Ice Beam allows Greninja to take down Hydrapple, Tornadus-T, and Zapdos. Sludge Wave is a more specific option that helps versus Azumarill, and it hits Quaquaval for neutral damage. Extrasensory is an option for the third moveslot to nail checks like Okidogi, Quaquaval, and Toxapex. Protect allows Greninja to block First Impression from Lokix and scout attacks from Choice item users such as Latios and Okidogi. It also can scout reactive Terastallizations from foes like Skeledirge and Tornadus-T. Water Shuriken allows Greninja to pick off faster targets like Sand Rush Excadrill and Choice Scarf Mienshao as well as beating out priority moves from Scizor and Mamoswine and KOing them when they are at low health. Life Orb is key in granting Greninja the power needed to break past foes such as Rotom-W, Slowking, and Assault Vest Tornadus-T despite reducing Greninja's limited longevity. Tera Water removes Greninja’s weakness to Fighting-type moves and gives it a permanently stronger Surf. Tera Stellar gives all of Greninja's moves extra power to take down Assault Vest Tornadus-T, Tera Steel Hydrapple, and Rotom-W late-game, and it gives Greninja a good shot at taking down Sand Rush Excadrill with Water Shuriken.</p> <p>Greninja best fits on offensive teams and is best supported by teammates that can weaken its checks and counters so that it can have an easier time cleaning up. Latios acts as a secondary wallbreaker, which can force critical damage on foes such as Skeledirge and Toxapex as well as overwhelmed shared checks like Azumarill and Assault Vest Tornadus-T. Mamoswine and Ogerpon-C similarly can punch holes into the opposing team by taking down the likes of Skeledirge and Mandibuzz, and they can wear down checks like Hydrapple for Greninja to clean late-game. Knock Off support from Tinkaton, Tornadus-T, and Ogerpon can cripple checks such as Slowking, Rotom-W, and Assault Vest Tornadus-T to bring them into KO range of Greninja's attacks. Strong Electric-types such as Zapdos and Thundurus-T are essential in punching holes through Water-types such as Keldeo and Azumarill that give Greninja trouble. The former also checks Lokix and can hinder revenge killers like Ogerpon and Okidogi with Static. Entry hazard support is key in putting foes such as Tinkaton, Rotom-W, and Toxapex into KO range, making hazard setters like Sandy Shocks, your own Tinkaton, and Cobalion valuable teammates. Sandy Shocks pressures Tornadus-T and Zapdos, while Tinkaton and Cobalion can punish revenge killers like Ogerpon, Choice Scarf Hoopa-U, and Lokix if Greninja lacks Protect. Cobalion also can bring Greninja in with Volt Switch against Hydrapple and Zapdos to wallbreak while crippling Tornadus-T with Thunder Wave. Excadrill can remove hazards to avoid worsening the damage Greninja takes from Life Orb, and it offensively handles Rotom-W, Toxapex, and Empoleon while also swapping into Tinkaton.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 566724, "username": "Scavet"}, {"user_id": 492518, "username": "HydreigonTheChild"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 617840, "username": "gulch"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Hawlucha": {"sets": {"Unburden Sweeper": {}}},
  "Avalugg": {"sets": {"Rapid Spin": {}}},
  "Hoopa-Unbound": {"sets": {"Choice Scarf": {}}},
  "Volcanion": {"sets": {"Offensive": {}}},
  "Ribombee": {"sets": {"Offensive": {}}},
  "Toxapex": {
    "sets": {
      "Mixed Wall": {
        "description": "<p>Toxapex holds a niche as a strong mixed wall, being able to effectively hold the line against a plethora of strong neutral hits and healing off large portions of damage through a combination of Recover and Regenerator. Compared to Liquidation, Surf allows Toxapex to avoid Zapdos's Static, achieves a 3HKO against Lokix, and does more damage to Rhyperior while also having more PP. Liquidation deals more damage to Tyranitar and bulkier variants of Excadrill, and it also allows Toxapex to utilize its bulk by fishing for Defense drops. Toxic and Haze form a potent combination and prevent Toxapex from being vulnerable to setup sweepers like Hydrapple and Azumarill while also making it a reliable stopgap against Battle Bond Greninja. Toxic also allows it to threaten bulkier foes like Slowking, Tornadus-T, and Hippowdon by putting them on a timer. Heavy-Duty Boots expands Toxapex's longevity, while Rocky Helmet can be used to punish physically oriented pivots like Scizor and Lokix. Leftovers provides passive recovery that compounds with Regenerator and alleviates the need to use Recover. The given EV spread allows Toxapex to avoid being 2HKOed by Hisuian Arcanine's Head Smash as well as avoiding the OHKO from non-Choice Specs Latios's Luster Purge. Toxapex's Tera type is largely customizable based on the needs of the team; Tera Fairy is a strong neutral defensive typing that maintains Toxapex's resistances to Bug and Fighting while giving it an immunity to Dragon, while Tera Ground allows it to function as an emergency check to Zapdos and Thundurus-T. Options such as Tera Steel to maintain Toxapex's Steel and Fairy resistances and immunity to Toxic are also viable.</p> <p>Toxapex fits best on balance teams that appreciate the unique options it provides over Slowking, most notably Haze and Toxic. For this reason, it pairs exceptionally well with Pokemon that struggle against Slowking, such as Rhyperior, Tinkaton, and Tornadus-T, creating a solid defensive backbone with the former two and a Regenerator core with the latter. Tinkaton and Tornadus-T in particular are appreciated due to their ability to check Latios, which can power through Toxapex with ease. Hydrapple is a strong partner thanks to its Ground resistance and its ability to form a Regenerator core with Toxapex. Mandibuzz is a particularly good partner thanks to its ability to remove entry hazards with Defog and function as a backup check to Hoopa-U and Latios while also appreciating Toxapex's ability to stave off Belly Drum Azumarill. In a similar vein, Toxapex is also appreciated on sand teams because it can cut into the longevity of bulkier foes, especially when Toxic is compounded with the chip damage from sand, making it easier for Pokemon like Excadrill and Ogerpon-C to bulldoze the opposing team. In return, these Pokemon can remove troublesome foes like Zapdos and Mamoswine that threaten Toxapex with heavy damage. Cobalion makes a good partner, as it can reliably check Swords Dance Ogerpon-C and Non-Terastillized Swords Dance Zarude, both of which can muscle through Toxapex with relative ease. In addition, Toxapex can struggle against other offensive staples like Hoopa-U and Thundurus-T, so revenge killers such as Lokix and Scizor or bulkier teammates that are not as vulnerable to these foes, such as Hippowdon and Rhyperior, are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "gulch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Comfey": {
    "sets": {
      "Calm Mind": {
        "description": "<p>With access to Triage, Draining Kiss, and Terastallization granting it perfect offensive coverage, Comfey is a formidable sweeper in UU, taking down dangerous offensive foes like Lokix, Hoopa-U, Quaquaval, and Greninja. Calm Mind amplifies the power of Comfey's Draining Kiss while also making it harder to take down, finding setup chances against common foes like Hydrapple, Tornadus-T, and defensive Zapdos. Tera Blast Ground allows Comfey to now target Steel-types, including Metagross, Excadrill, and Tinkaton as well as other Fairy-resistant Pokemon such as Toxapex, Pecharunt, Skeledirge, and Hisuian Arcanine. Tera Ground also grants Comfey the ability to set up on foes like Zapdos and Thundurus-T and resist Poison-type attacks from Okidogi and Pecharunt. Taunt denies recovery chances against foes like Slowking, Zapdos, Toxapex, and Mandibuzz, notably blocking Toxic attempts from the latter two, allowing Comfey to set up Calm Mind more easily and capitalize on forced switches. Giga Drain is an option over Taunt to get heavy damage on Water-types such as Azumarill and Slowking as well as other foes like Mamoswine, Rhyperior, and Hisuian Arcanine. A Life Orb grants Comfey an immediate power boost and works in tandem with the self-healing nature of Draining Kiss. 16 Speed EVs let Comfey outspeed foes such as Volcanion and Metagross, with the remaining investment in HP and Special Attack to maximize bulk and power.</p> <p>Comfey best fits on offense teams that wear down its checks to pave way for a sweep. Entry hazard leads like Mew and Excadrill provide key support in wearing down foes like Azumarill and Assault Vest Tornadus-T into Comfey's KO range. Mew in particular can cripple enemy Excadrill with Will-O-Wisp, allowing Comfey to no longer fear revenge killing attempts, while Excadrill can take out Tera Steel Latios. Ogerpon-C and Mimikyu are great teammates that offensively pressure bulky Pokemon such as Skeledirge and Slowking that trouble Comfey as well as wear down Tinkaton into range of Tera Blast Ground. Greninja and Azumarill are able to put pressure on the likes of Scizor and Hisuian Arcanine and are generally not reliant on Terastallization, meaning Comfey can use the mechanic more easily. Revavroom can take advantage of checks like Toxapex, Scizor, and Pecharunt and power through them while opening up holes against the enemy team for Comfey to clean. Quaquaval and Thundurus-T can take out Steel-types like Tinkaton and Metagross in the event Tera has already been used to still ensure Comfey can sweep; the former switches into Hisuian Arcanine, while the latter powers through Toxapex. Serperior and the aforementioned Quaquaval also threaten annoyances like Excadrill, Mamoswine, and Rhyperior.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Mimikyu": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Mimikyu is a valuable asset to hyper offense teams as a mid- to late-game sweeper with its great type combination and ability to be a one-time check to nearly anything with Disguise, including deadly foes such as Latios, Quaquaval, Greninja, and Lokix. It also serves as an emergency spinblocker to preserve entry hazards on these teams. Drain Punch is an alternative over Shadow Claw to get super effective damage on the likes of Excadrill, Mamoswine, and Cobalion, notably also granting Mimikyu recovery, and offsetting Life Orb recoil. Shadow Sneak picks off faster targets like Latios, Thundurus-T, and Ogerpon-C. Life Orb amplifies Mimikyu's wallbreaking, letting it reliably 2HKO Tinkaton with Shadow Claw at +2 as well as Latios with an unboosted Shadow Sneak. Alternatively, Red Card grants Mimikyu the ability to phaze out sweepers like Ogerpon-C and Greninja in tandem with Disguise and is able to generate a turn of setup with this, but the drop in power is notable even with the Adamant nature. Jolly is the preferred nature to get the jump on Hisuian Arcanine and Excadrill, but Adamant is an alternative for extra power at the cost of now being outsped by these threats. Tera Ghost amplifies the power of Shadow Claw and Shadow Sneak, letting Mimikyu OHKO Latios at +2 with the latter move even with Red Card as well as just offering greater damage in general against walls like Toxapex, Zapdos, and Tinkaton. Alternatively, Tera Fire grants Mimikyu an immunity to Will-O-Wisp from Skeledirge as well as a resistance to Steel-type attacks from Tinkaton, Scizor, and Metagross. It should be noted that only Tera Fire should be used for Drain Punch rather than Tera Ghost with the intended purpose of Tera Ghost largely being to boost the power of Shadow Claw specifically.</p> <p>Mimikyu best fits on hyper offense builds thanks to its unique ability to disrupt other offensive teams with Disguise while also functioning as an emergency spinblocker against Excadrill. Entry hazard support from Mew and Excadrill is essential in softening up foes like Toxapex and Tinkaton to get broken past by Mimikyu; additionally, Excadrill offensively pressures them and provides Rapid Spin support to keep entry hazards from wearing down Life Orb Mimikyu. Tinkaton and Excadrill are Mimikyu's largest issues, being able to take its STAB moves and bypass Disguise with Mold Breaker. As such, powerful sweepers like Quaquaval and Ogerpon-C are useful in dispatching these foes and can overwhelm walls like Skeledirge and Hippowdon for Mimikyu to clean late-game. Quaquaval also handles Scizor, while Ogerpon-C can wear down Okidogi into range of +2 Play Rough. Belly Drum Azumarill can wallbreak to remove foes like Toxapex, take on the likes of Excadrill and Hisuian Arcanine, allowing Mimikyu to afford an Adamant nature, and pressure the sand archetype as a whole as well. Greninja can offensively check threats such as Sandy Shocks and Scizor and wears down Tinkaton to where Mimikyu can bypass it more easily. Skeledirge can help handle opposing offense teams thanks to Unaware and its bulk, being a key teammate Mimikyu can fall back on when handling these teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 620325, "username": "ThatOneApple"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Polteageist": {"sets": {"Shell Smash": {}}},
  "Indeedee": {"sets": {"Terrain Setter": {}}},
  "Zarude": {
    "sets": {
      "Swords Dance": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Zarude provides a solid speed control option with a decent amount of defensive utility. Zarude's Speed grants it the ability to pressure Latios, Greninja, Serperior, and Quaquaval at +1 Speed, while its typing allows it to switch into foes like +1 Speed Excadrill and Choice Scarf Hoopa and threaten them out. U-turn allows Zarude to pivot out against opposing switch-ins like Tinkaton and Okidogi, allowing it to bring in teammates that can threaten them. Close Combat gives Zarude super effective coverage for Ogerpon-C and Cobalion while also OHKOing Excadrill, while Jungle Healing grants Zarude the ability to shrug off status from Slowking, Rotom-W, and Zapdos. However, locking Zarude into Jungle Healing is very risky, due to the fact that the opponent will be able to switch anything in for free. Tera Dark gives Knock Off an extra boost in power, notably 2HKOing Serperior even after its item is removed, while Tera Fighting boosts Close Combat and makes Zarude less susceptible to revenge kill attempts from Lokix. However, Zarude loses its defensive utility when it Terastallizes, so it should only Terastallize when it is necessary to either revenge kill an opposing threat or clean up the rest of the game.</p> <p>Choice Scarf Zarude fits on offense teams that appreciate its compression as a revenge killer and Ground-resistant Pokemon. However, as a Choice item user, Zarude struggles with foes that can sponge its attacks and switch to a resist such as Hydrapple or Toxapex. As a result, it appreciates teammates that it can pivot to to pressure these foes such as Latios and Okidogi. Latios also outspeeds and pressures opposing Okidogi and Cobalion, allowing Zarude to more easily slot Jungle Healing, while Okidogi can sponge hits from Lokix. More offensively capable foes such as Enamorus-T and Okidogi can also switch into Zarude, so it appreciates defensive teammates that can withstand their attacks, like Tornadus-T and Pecharunt. Zarude also appreciates teammates that can handle the tier's Flying-types in Mandibuzz, Zapdos, and opposing Tornadus-T. Rhyperior and Excadrill both help against Zapdos and Tinkaton and provide Stealth Rock to help wear down the aforementioned Flying-types after Zarude removes their Heavy-Duty Boots. Rhyperior also offensively pressures Tornadus-T and Mandibuzz, while Excadrill provides entry hazard removal to prevent Zarude from being worn down by opposing hazards. Zapdos can act as a switch-in to Tornadus-T and Tinkaton while also offensively pressuring Mandibuzz and Okidogi. Zapdos, alongside other potential teammates like Tornadus-T and Slowking, also functions as a pivot that can bring Zarude in on foes it can pressure out such as Latios.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Zarude-Dada": {
    "sets": {
      "Swords Dance": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Zarude provides a solid speed control option with a decent amount of defensive utility. Zarude's Speed grants it the ability to pressure Latios, Greninja, Serperior, and Quaquaval at +1 Speed, while its typing allows it to switch into foes like +1 Speed Excadrill and Choice Scarf Hoopa and threaten them out. U-turn allows Zarude to pivot out against opposing switch-ins like Tinkaton and Okidogi, allowing it to bring in teammates that can threaten them. Close Combat gives Zarude super effective coverage for Ogerpon-C and Cobalion while also OHKOing Excadrill, while Jungle Healing grants Zarude the ability to shrug off status from Slowking, Rotom-W, and Zapdos. However, locking Zarude into Jungle Healing is very risky, due to the fact that the opponent will be able to switch anything in for free. Tera Dark gives Knock Off an extra boost in power, notably 2HKOing Serperior even after its item is removed, while Tera Fighting boosts Close Combat and makes Zarude less susceptible to revenge kill attempts from Lokix. However, Zarude loses its defensive utility when it Terastallizes, so it should only Terastallize when it is necessary to either revenge kill an opposing threat or clean up the rest of the game.</p> <p>Choice Scarf Zarude fits on offense teams that appreciate its compression as a revenge killer and Ground-resistant Pokemon. However, as a Choice item user, Zarude struggles with foes that can sponge its attacks and switch to a resist such as Hydrapple or Toxapex. As a result, it appreciates teammates that it can pivot to to pressure these foes such as Latios and Okidogi. Latios also outspeeds and pressures opposing Okidogi and Cobalion, allowing Zarude to more easily slot Jungle Healing, while Okidogi can sponge hits from Lokix. More offensively capable foes such as Enamorus-T and Okidogi can also switch into Zarude, so it appreciates defensive teammates that can withstand their attacks, like Tornadus-T and Pecharunt. Zarude also appreciates teammates that can handle the tier's Flying-types in Mandibuzz, Zapdos, and opposing Tornadus-T. Rhyperior and Excadrill both help against Zapdos and Tinkaton and provide Stealth Rock to help wear down the aforementioned Flying-types after Zarude removes their Heavy-Duty Boots. Rhyperior also offensively pressures Tornadus-T and Mandibuzz, while Excadrill provides entry hazard removal to prevent Zarude from being worn down by opposing hazards. Zapdos can act as a switch-in to Tornadus-T and Tinkaton while also offensively pressuring Mandibuzz and Okidogi. Zapdos, alongside other potential teammates like Tornadus-T and Slowking, also functions as a pivot that can bring Zarude in on foes it can pressure out such as Latios.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Enamorus-Therian": {"sets": {"Offensive": {}}},
  "Skeledirge": {
    "sets": {
      "Unaware Wall": {
        "description": "<p>Torch Song allows Skeledirge to function dually as not only a defensive wall but also a threat that can overwhelm Pokemon like Tornadus-T and Hydrapple. Will-O-Wisp lets Skeledirge neuter many offensive threats such as Tyranitar and Okidogi, and it works in tandem with Hex to overwhelm defensive Pokemon like Slowking and Zapdos. Heavy-Duty Boots keeps Skeledirge from being worn down by entry hazards, letting it handle Pokemon like Okidogi variants lacking Knock Off and Calm Mind Latios more reliably. Tera Fairy is the most common Tera option, granting Skeledirge a very useful defensive typing that stops many threats like Hydrapple, Quaquaval, Lokix, and Calm Mind Latios, in addition to being a good neutral typing that helps it burn foes like Azumarill and Ogerpon-C. Tera Water lets Skeledirge check Azumarill, Greninja, Mamoswine, and Sand Rush Excadrill more efficiently. Tera Steel helps Skeledirge wall all Latios sets, Ogerpon, and Ogerpon-C while still checking Greninja, and Skeledirge gains a Toxic immunity, which can be useful for switching into Toxapex and Mandibuzz. However, every Tera type has downsides that flip certain matchups that may be unfavorable for Skeledirge. Tera Fairy makes it vulnerable to Metagross and Scizor, Tera Water makes it very weak to Zapdos and Hydrapple, and Tera Steel opens up a nasty weakness to Fighting- and Ground-type attacks that can be unfavorable, especially since it now loses to foes it should check, like Okidogi and Cobalion, ultimately meaning that general caution should be exerted when choosing to Terastallize Skeledirge.</p> <p>Skeledirge fits best on balance and fat builds that cover its defensive weaknesses and accommodate its need to Terastallize in-game. Switch-ins to Knock Off, such as Toxapex and Cobalion, are arguably mandatory teammates, answering critical threats that force Skeledirge out due to the threat of Knock Off such as Azumarill and Lokix. Cobalion offensively checks dangerous wallbreakers like Mamoswine, Ursaluna, and Ogerpon-C that can overwhelm Skeledirge. Slowking, Empoleon, and the aforementioned Toxapex form great cores with Skeledirge, answering annoying Water-types like Keldeo, Greninja, and Azumarill that typically force Skeledirge to Terastallize; not to mention, Toxapex and Slowking do a great job at checking Hisuian Arcanine, which can freely switch into Skeledirge. Slowking and Tinkaton can spread paralysis with Thunder Wave to boost the power of Hex while also being valuable scouts to see if Latios is running Choice Specs, which Skeledirge fails to check, or Calm Mind. Hydrapple and Mandibuzz are great teammates that can handle Mold Breaker Excadrill; both can serve as middle-grounds into Ursaluna while Mandibuzz can also provide support with Defog to clear entry hazards in the event that Skeledirge gets hit with Knock Off. Mandibuzz can also take out Pokemon that might reactively Tera into Fire-resistant Tera types to handle Skeledirge, like Excadrill and Scizor. Setup sweepers such as Swords Dance Excadrill and Calm Mind + Tera Electric Latios can remove annoying Pokemon like Toxapex, Mandibuzz, and Zapdos that stand in the way of a Skeledirge sweep with Torch Song. In return, Skeledirge's ability to spread burns can open up more opportunities for these teammates to set up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 620325, "username": "ThatOneApple"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Quaquaval": {"sets": {"Swords Dance": {}}},
  "Lokix": {
    "sets": {
      "Swords Dance": {},
      "Pivot": {
        "description": "<p>First Impression is key in removing offensive powerhouses such as Ogerpon-C, Greninja, and Latios. Tinted Lens prevents foes from playing around Lokix with defensive Terastallization, meaning they will all be hit for neutral damage at worst. Knock Off punishes common switch-ins like Zapdos and Tornadus-T. Sucker Punch is additional priority that allows Lokix to pick off foes like Assault Vest Tornadus-T after Stealth Rock and First Impression damage. Tera Bug is used to blow past Excadrill and Azumarill, letting Lokix KO the latter after Belly Drum if Stealth Rock is up. Heavy-Duty Boots allows Lokix to dash in and out of the field easily. Silver Powder puts an additional kick into First Impression, OHKOing Choice Scarf Mienshao, Assault Vest Tornadus-T after Stealth Rock, and Excadrill with a layer of Spikes after Tera Bug at the cost of Lokix taking entry hazard damage, limiting the amount of entry points in a game. On such sets, Leech Life can be used over Knock Off to retain longevity, at the cost of forgoing the ability to punish common switch-ins. Adamant should be used most often for maximum damage output, but Jolly allows Lokix to nail Hisuian Arcanine before it uses Extreme Speed and pivot out freely on Excadrill.</p> <p>Lokix fits best on bulky offense and balance teams, acting as a potent revenge killer to offensive threats. Offensive partners like Latios and Ogerpon-C appreciate Lokix's U-turn freely bringing them in on Cobalion and Zapdos. Removing Zapdos in particular is very important to let Lokix more freely pivot around without worry about Static. Slowking forms an excellent pivoting core with Lokix, as slow Chilly Reception can bring Lokix in safely on Pokemon that threaten Slowking such as Greninja and Ogerpon and it can handle the likes of Toxapex and Cobalion. Slowking's Future Sight support can also dissuade Toxapex and Okidogi from wanting to switch into Lokix in the first place. Other pivots like Zapdos and Thunder Wave Rotom-W can handle Tornadus-T through paralysis, giving Lokix more room to pivot in and out. Lokix greatly appreciates entry hazard support to more easily revenge kill Excadrill. Tinkaton appreciates Lokix's Knock Off removing Heavy-Duty Boots for Stealth Rock while in return handling Ogerpon-C and Comfey. Spikes setters such as Sandy Shocks and Ogerpon can take on Zapdos and Hippowdon. Excadrill is a fantastic partner for Silver Powder sets especially, as it removes entry hazards for Lokix to freely pivot around and helps overwhelm Zapdos and Tornadus-T. In return, Lokix nails Hydrapple and can give Excadrill safe entry against Rotom-W and Toxapex. Slower wallbreakers such as Azumarill, Hisuian Arcanine, and Mamoswine appreciate having faster checks like Ogerpon and Sand Rush Excadrill dealt with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 524894, "username": "cheru"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540289, "username": "Tidal"}, {"user_id": 461329, "username": "Estarossa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Bellibolt": {"sets": {"Physically Defensive Static": {}}},
  "Tinkaton": {
    "sets": {
      "Utility": {
        "description": "<p>Tinkaton's good matchup against Mandibuzz makes it a strong Stealth Rock setter that uses its typing to get plenty of entry hazard-setting chances. Certain teams prefer Tinkaton to use Thunder Wave, though, since they can fit another Stealth Rock setter; this can help significantly when dealing with foes like Latios and Spiky Shield Ogerpon-C. Knock Off is excellent utility that prevents Tinkaton from being passive, removing items from Excadrill, Zapdos, and Hisuian Arcanine. Encore is Tinkaton's most useful asset, letting it use its typing and bulk to checkmate foes like Latios and Hydrapple. Leftovers is preferred on Mold Breaker sets so that Tinkaton has some longevity, with Mold Breaker proving useful to let it OHKO Ogerpon-C and Mimikyu despite their abilities. Pickpocket with an Air Balloon can let it steal items from Excadrill, Ogerpon, and Lokix, which can help immensely in fending these threats off. The given EVs allow Tinkaton to KO Latios with Knock Off followed by Gigaton Hammer while surviving a +2 Superpower from Ogerpon-C. Play Rough is a niche option that lets Tinkaton more directly pressure Greninja and Latios, but it is extremely weak against foes it doesn't hit super effectively. Tera Flying lets Tinkaton use Encore after Excadrill's Earthquake. Tera Dark helps Tinkaton against strong Psychic-type attackers like Hoopa-U and Choice Specs Latios, while Tera Dragon lets it check Greninja and Belly Drum Azumarill.</p> <p>Tinkaton's incredible typing and utility let it fit on all kinds of bulky offense and balance teams, using Stealth Rock to support teammates like Tyranitar and Lokix that love to weaken checks with Knock Off. It's also a good partner for teammates like Sandy Shocks and Rotom-W that dislike dealing with Latios. Tinkaton's flexibility lets it use its bulk to tank huge attacks and lock foes into them with Encore; for example, it often needs to lock Greninja into Surf or Okidogi into Drain Punch. As such, teammates that can handle these attacks like Slowking and Hydrapple can be very useful to have. They also help signficantly against Excadrill, which Tinkaton tends to let in for free. Teams that use Tinkaton should aim to make progress fairly quickly; while it's a great stopgap to all kinds of threats, its lack of reliable recovery prevents it from lasting forever, so it needs progress-making teammates like Hisuian Arcanine and Mamoswine, which can help it create favorable game states.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 481709, "username": "Lily"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Revavroom": {"sets": {"Shift Gear": {}}},
  "Clodsire": {"sets": {"Defensive Hazard Setter": {}}},
  "Sandy Shocks": {"sets": {"Pivot": {"description": "<p>Only use Tera Blast with Tera Ice to nail checks like Hydrapple, Sinistcha, and Latios.</p>"}}},
  "Iron Jugulis": {"sets": {"Booster Energy": {}}},
  "Iron Thorns": {"sets": {"Dragon Dance": {}}},
  "Iron Leaves": {"sets": {"Swords Dance": {}}},
  "Sinistcha": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Sinistcha is a potent setup sweeper thanks to a variety of tools at its disposal: high Special Attack, great Defense, Heatproof, Calm Mind to shore up its Special Defense, and access to healing through Matcha Gotcha and Strength Sap, which can both also cripple opposing physical attackers. Strength Sap provides a way to get bigger bursts of recovery while also lowering the opponent's Attack, letting Sinistcha take hits from the likes of Lokix and Hisuian Arcanine and in turn use them to set up Calm Mind. Heatproof provides Sinistcha with a neutrality to Fire-type attacks, which is useful for taking on Hisuian Arcanine. Leftovers provides passive recovery alongside Sinistcha's healing moves, while Heavy-Duty Boots keeps it healthy through repeated switches. 96 Speed EVs let Sinistcha outspeed Adamant Azumarill, with the rest invested to maximize its physical bulk. Tera Poison allows Sinistcha to avoid Toxic from Mandibuzz and Toxapex and resist Okidogi's STAB attacks, as well as preventing Toxic Chain, while Tera Fairy can be used instead to help Sinistcha check Latios and Hydrapple while gaining a resistance to Dark-type moves from Tyranitar and Greninja. However, both of these Tera types take away Sinistcha's ability to spinblock, and Tera Poison makes it significantly weaker to Excadrill, so Sinistcha should only be Terastallized when necessary.</p> <p>Sinistcha fits particularly well on hazard stacking teams, where entry hazard setters like Excadrill, Cobalion, Sandy Shocks, and Rhyperior benefit from its spinblocking and incredible matchup against Excadrill, the tier's best Rapid Spinner. In turn, Excadrill provides an answer to Latios, which can threaten Sinistcha if it doesn't have any Calm Mind boosts yet, especially if it is using Tera Poison. Cobalion also makes an excellent teammate, using Justified to provide a great answer to many Dark-types, like Mandibuzz, which otherwise easily uses Defog in front of Sinistcha, and Zarude, which resists both of Sinistcha's STAB moves and heals off burns with Jungle Healing. Rhyperior and Sandy Shocks are teammates that can both pressure both Zapdos and Tornadus-T, which outspeed and threaten Sinistcha. Tornadus-T takes advantage of unboosted Sinistcha's middling Special Defense to OHKO it after minor chip damage, and Hoopa-U easily 2HKOes Sinistcha with Hyperspace Fury, so teammates like Latios and Lokix that deal significant damage to them are appreciated. Zapdos also makes a great teammate to punish Pokemon like Okidogi and Tornadus-T with Static, letting Sinistcha outspeed them. Skeledirge is a particularly annoying Pokemon for Sinistcha to deal with thanks to Unaware, so it needs teammates like Hisuian Arcanine and Greninja that can handle Skeledirge; these two also pressure the Flying-types that give Sinistcha issues.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Maia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 481709, "username": "Lily"}, {"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Sinistcha-Masterpiece": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Sinistcha is a potent setup sweeper thanks to a variety of tools at its disposal: high Special Attack, great Defense, Heatproof, Calm Mind to shore up its Special Defense, and access to healing through Matcha Gotcha and Strength Sap, which can both also cripple opposing physical attackers. Strength Sap provides a way to get bigger bursts of recovery while also lowering the opponent's Attack, letting Sinistcha take hits from the likes of Lokix and Hisuian Arcanine and in turn use them to set up Calm Mind. Heatproof provides Sinistcha with a neutrality to Fire-type attacks, which is useful for taking on Hisuian Arcanine. Leftovers provides passive recovery alongside Sinistcha's healing moves, while Heavy-Duty Boots keeps it healthy through repeated switches. 96 Speed EVs let Sinistcha outspeed Adamant Azumarill, with the rest invested to maximize its physical bulk. Tera Poison allows Sinistcha to avoid Toxic from Mandibuzz and Toxapex and resist Okidogi's STAB attacks, as well as preventing Toxic Chain, while Tera Fairy can be used instead to help Sinistcha check Latios and Hydrapple while gaining a resistance to Dark-type moves from Tyranitar and Greninja. However, both of these Tera types take away Sinistcha's ability to spinblock, and Tera Poison makes it significantly weaker to Excadrill, so Sinistcha should only be Terastallized when necessary.</p> <p>Sinistcha fits particularly well on hazard stacking teams, where entry hazard setters like Excadrill, Cobalion, Sandy Shocks, and Rhyperior benefit from its spinblocking and incredible matchup against Excadrill, the tier's best Rapid Spinner. In turn, Excadrill provides an answer to Latios, which can threaten Sinistcha if it doesn't have any Calm Mind boosts yet, especially if it is using Tera Poison. Cobalion also makes an excellent teammate, using Justified to provide a great answer to many Dark-types, like Mandibuzz, which otherwise easily uses Defog in front of Sinistcha, and Zarude, which resists both of Sinistcha's STAB moves and heals off burns with Jungle Healing. Rhyperior and Sandy Shocks are teammates that can both pressure both Zapdos and Tornadus-T, which outspeed and threaten Sinistcha. Tornadus-T takes advantage of unboosted Sinistcha's middling Special Defense to OHKO it after minor chip damage, and Hoopa-U easily 2HKOes Sinistcha with Hyperspace Fury, so teammates like Latios and Lokix that deal significant damage to them are appreciated. Zapdos also makes a great teammate to punish Pokemon like Okidogi and Tornadus-T with Static, letting Sinistcha outspeed them. Skeledirge is a particularly annoying Pokemon for Sinistcha to deal with thanks to Unaware, so it needs teammates like Hisuian Arcanine and Greninja that can handle Skeledirge; these two also pressure the Flying-types that give Sinistcha issues.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Maia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 481709, "username": "Lily"}, {"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Okidogi": {
    "sets": {
      "Bulk Up": {
        "description": "<p>Okidogi is a dangerous threat with Bulk Up thanks to its great typing, both offensively and defensively, and fantastic ability in Toxic Chain, allowing it to put walls like Skeledirge, Hippowdon, and Zapdos on a timer and giving it a huge advantage over its competition. Poison Jab is preferred due to being more reliable and also having a higher chance of poisoning the target; however, Gunk Shot is an alternative that has a much higher damage output, which notably has a high chance to both 2HKO Sinistcha after Stealth Rock and a high chance to KO Hydrapple. It also allows Okidogi to avoid making contact with Zapdos, avoiding being punished by Static. Drain Punch provides Okidogi with a strong form of recovery that can make it hard to take down once it accumulates multiple boosts. Psychic Fangs nails opposing Okidogi, Toxapex, and Pecharunt, while Knock Off can be a more utility-favored option to remove key items from Zapdos, Slowking, and Skeledirge. Substitute helps take advantage of passive Pokemon and potentially prevent threats like Latios from revenge killing it. However, it has to give up Poison Jab or coverage, making it easier for Pokemon like Pecharunt and Zapdos to pivot into Okidogi. Leftovers lets Okidogi take advantage of its typing and natural bulk to answer Pokemon like Zarude, Cobalion, and Ogerpon-C. The EV spread lets Okidogi take two Life Orb-boosted Surfs from Greninja and survive an Earthquake from Excadrill from full. It also avoids being OHKOed by Hurricane from defensive Zapdos and avoids the 2HKO from Hurricane if Tera is committed. The Speed investment gets the jump on Tinkaton, preventing it from locking Okidogi into Bulk Up with Encore. The rest of the EVs are invested into Attack, notably allowing Okidogi to OHKO Choice Scarf Okidogi with Psychic Fangs, 2HKO Latios with Poison Jab, and have a high chance to OHKO Excadrill. Okidogi's typing is extremely useful, so Tera should only be used if necessary to KO a dangerous Pokemon or if Okidogi is in a position to create an advantage or outright win the game. Tera is primarily used to shed its weaknesses to better combat Pokemon like Tornadus-T and Excadrill. Tera Fairy retains useful resistances but can help deal with the threat of Draco Meteor from Latios and Hydrapple. Tera Dragon improves Okidogi's ability to take hits from revenge killers like Greninja and Thundurus-T. Tera Electric can be considered, as it allows Okidogi to beat Tornadus-T and Zapdos more reliably, avoiding Static from the latter as well as Thunder Wave from Pokemon like Slowking.</p> <p>Okidogi fits best on bulky offense and balance teams that value the defensive utility its typing brings along with the potency of it as a wincon with Bulk Up. Okidogi is susceptible to many faster threats that can force it out such as Sandy Shocks, Latios, and Choice Scarf Hoopa-U. Hydrapple and Serperior are great answers to Sandy Shocks, as well as pressuring Slowking and other Ground-types like Excadrill and Hippowdon, the latter notably able to force Okidogi out with Whirlwind. Serperior can also provide utility through Glare to punish Pokemon like Latios and Tornadus-T, making them slow enough for Okidogi to nail them with a powerful attack. Mandibuzz and Tinkaton are fantastic defensive answers to the aforementioned Psychic-types, with the former providing Defog support and the latter Stealth Rock support. Lokix and Scizor are also valuable teammates to consider, as their strong priority moves can threaten these faster foes and can bring Okidogi in safely with U-turn against Pokemon like Cobalion and Mandibuzz. Other entry hazard setters like Rhyperior and Sandy Shocks are ideal to help wear down Pokemon such as Pecharunt and Metagross into range of a boosted attack; Okidogi can support this further if opting to run Knock Off. These Ground-types are also able to check Tornadus-T and Zapdos, the premier Flying-types that force Okidogi out. Toxapex and Skeledirge, while vulnerable to Okidogi's coverage and the latter to Toxic Chain, can be troublesome to break through, so Pokemon like Ogerpon-C, Thundurus-T, and Hoopa-U are capable of overwhelming them.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Okidogi serves as a fast wallbreaker in the metagame, outspeeding every unboosted Pokémon in the tier even with an Adamant nature and blasting through foes like Serperior, Ogerpon-C, and Greninja, and its Toxic Chain ability makes it difficult to punish even with bulkier resists. It does this while leveraging its typing and bulk to find entry on foes like the aforementioned Ogerpon-C, Cobalion, and Lokix. Gunk Shot is the preferred Poison-type STAB move on this set, as its higher power allows it to more effectively break while also dodging the chance to be paralyzed by Static. Knock Off acts as coverage for Skeledirge, Slowking, Latios, and Pecharunt while also removing items from foes to gain further progress. Psychic Fangs allows Okidogi to hit Poison-types like Toxapex and opposing Okidogi super effectively. Tera Fighting gives Okidogi's Close Combat an extra kick in power, allowing it to more effectively break through foes, notably 2HKOing Mandibuzz, and clean late-game. However, it should be noted that shedding the Poison typing removes entry points for Okidogi due to it losing resistances, so Tera should only be used if it is absolutely needed to break through a foe or if it is able to clean the rest of the opponent's team.</p> <p>Choice Scarf Okidogi fits on balance and offense teams that appreciate its Speed and breaking power to help get progress in games. However, as a Choice item user, it is hindered by foes like Toxapex, Pecharunt, and Slowking scouting the attack it locks into and switching to something to blank it. As a result, it appreciates teammates that can either pressure them or assist in overwhelming them like Latios, Excadrill, and Zapdos, which, alongside Tornadus-T and Slowking, also provides a pivot that can bring Okidogi in on opponents it can pressure like Latios and Tyranitar. Other teammates that Choice Scarf Okidogi appreciates are ones that can switch into more offensively capable opponents that resist one of its STAB moves like opposing Zapdos and Metagross. Examples of these potential teammates include Rhyperior and Rotom-W, the former of which can also set up Stealth Rock to assist in wearing down Okidogi's checks. While it may outspeed the entire unboosted metagame, it does miss out on some Speed-boosted threats such as Greninja and Quaquaval, so priority users like Lokix and Scizor can be considered in the event a team cannot prevent them from getting a boost.</p>"
      },
      "Assault Vest": {
        "description": "<p>With an Assault Vest, Okidogi is able to strike a perfect balance of offense and defense, using its naturally high Attack and physical bulk combined with the special bulk provided by the Assault Vest to better handle Pokemon like Hydrapple, Greninja, and Thundurus-T. Knock Off synergizes very well with Okidogi's ability Toxic Chain, allowing it to simultaneously remove items and badly poison foes, heavily wearing down bulky Pokemon like Slowking, Skeledirge, Rotom-W, and Mandibuzz. Gunk Shot can be used as an alternative to Poison Jab, offering more power at the cost of less accuracy. Psychic Fangs allows Okidogi to hit Toxapex, which otherwise walls it, while also either outright KOing or heavily damaging opposing Okidogi depending on the set. 16 Speed EVs allow Okidogi to outspeed Azumarill. The HP and Special Defense EVs allow Okidogi to avoid a 2HKO from Battle Bond Greninja's Surf at +1, and the remaining EVs go into Attack to allow it to OHKO Excadrill with Drain Punch. Tera Fairy gives Okidogi a Dragon immunity, allowing it to switch into powerful Draco Meteors from Hydrapple and Latios while maintaining a resistance to Greninja's Dark Pulse. It also allows Okidogi to take neutral damage from Excadrill's Earthquake and Zapdos's and Tornadus-T's Hurricane, giving Okidogi the perfect middle ground to reactively Tera away from its biggest threats. However, Okidogi's base typing is incredible defensively, so it should only be Terastallized when absolutely necessary.</p> <p>Okidogi fits best on balance and bulky offense teams that appreciate its combination of power, bulk, and ability to slowly whittle down foes via Toxic Chain. Lokix makes a great partner for Okidogi, as it is able to reliably revenge kill Pokemon like Hoopa-U, Latios, and Greninja, which otherwise threaten Okidogi, with First Impression. Mandibuzz and Zarude also fufill similar roles, and all three Dark-types also act as pivots to bring Okidogi in safely on Pokemon like Cobalion and Enamorus-T. Mandibuzz also provides entry hazard removal to keep Okidogi from getting worn down over time. Okidogi is also susceptible to Ground- and Flying-type moves, so Pokemon that can handle these attacks, like Zapdos, Rotom-W, Tornadus-T, Hydrapple, and Zarude, make for great partners. Zapdos handles Lokix and Cobalion, absorbing Knock Off from the former and preventing Okidogi from being paralyzed by the latter. Rotom-W and Tornadus-T both handle Greninja for Okidogi, with Rotom-W also handling Mamoswine and Tornadus-T also handling Latios, and Hydrapple and Zarude check Sandy Shocks and Excadrill for Okidogi. Okidogi pairs very well with hazard setters like Excadrill, Rhyperior, and Metagross, as the combination of hazard damage and Toxic damage from Toxic Chain can wear down bulkier opponents incredibly fast. In return, these Pokemon can threaten Pecharunt, Skeledirge, and Toxapex for Okidogi.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 540058, "username": "StarFalcon555"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 461329, "username": "Estarossa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Ogerpon": {
    "sets": {
      "Pivot": {
        "description": "<p>Ogerpon functions as a solid pivot within the tier thanks to an array of excellent utility moves, a powerful STAB move in Ivy Cudgel, and great offensive stats. Knock Off allows Ogerpon to punish many of the Pokemon attempting to switch into it such as Zapdos, Tornadus-T, and Skeledirge. U-turn allows Ogerpon to pivot out of matchups that are unfavorable for it such as Tinkaton, Okidogi, and Skeledirge while doing solid damage to Hydrapple that may want to switch in, and thanks to Heavy-Duty Boots, it is able to remain healthy throughout the match and easily pivot in and out of the field. Encore gives it the ability to take advantage of slower Pokemon that have locked themselves into an awkward move so it can go for a free move the turn after, such as Zapdos using Roost or Mandibuzz clicking Defog, which, when paired with Defiant, gives Ogerpon a free Attack boost. On the other hand, Ogerpon is able to use the pressure it creates as opportunities to set up Spikes for its team, helping its teammates and itself by slowly chipping down the opposing team's checks. Ogerpon's Tera type is locked into Grass, but with Embody Aspect, it is given a boost to its Speed on top of the additional boost to its STAB moves, letting it OHKO Slowking and have a chance to 2HKO Tornadus-T after Stealth Rock. This means that Ogerpon can act not only as a powerful breaker with Tera, but also as an emergency speed control option that can outrun every unboosted Pokemon in the metagame, as well as a number of boosted Pokemon such as Choice Scarf Mienshao and Excadrill after Rapid Spin. Ogerpon's Speed boost also allows it to have unique interactions with Encore, switching in on faster Pokemon to lock them into set up moves such as Calm Mind Latios or Dragon Dance Salamence.</p> <p>Ogerpon's pivoting and utility options are best suited on bulky offense teams that appreciate its ability to disrupt foes while bringing in their own threats. Wallbreakers such as Azumarill, Hisuian Arcanine, and Mamoswine love Ogerpon's ability to pivot them in safely, weaken their checks, and potentially set up Spikes for them to break more easily; In return, they are able to deal with some of Ogerpon's checks such as Zapdos, Tornadus-T, and Hydrapple. Pivots that are able to synergize well with Ogerpon such as Slowking, Tornadus-T, and Zapdos make for excellent partners, being able to form a strong core while relieving Ogerpon of the pressure of taking on threats like Latios, Excadrill, and Lokix. Stealth Rock setters such as Tinkaton and Cobalion mesh well with Ogerpon that opt for Spikes by maximizing the entry hazard stacking potential, with Tinkaton able to fit Encore instead while taking on Greninja and Zapdos, while Cobalion can effectively deal with Excadrill and Lokix for it. Sandy Shocks is an excellent teammate for Ogerpon, being able to take on the Flying-types that it's afraid of, creating a VoltTurn core with it, and being able to set up Stealth Rock for it while Ogerpon handles the Water- and Grass-type attacks aimed at Sandy Shocks well while beating its key checks like Azumarill and Rotom-Wash.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540289, "username": "Tidal"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Ogerpon-Cornerstone": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-C is a terrifying powerhouse, with very few defensive Pokemon able to resist its STAB combination or stand up to its sheer power after a Swords Dance. Ivy Cudgel is the STAB move of choice, capable of nailing even checks like Tinkaton and Hydrapple with a 2HKO after boosting. Power Whip, while inconsistent due to poor accuracy, is also notably stronger, allowing Ogerpon-C to OHKO offensive threats like Keldeo and Azumarill and have a chance at OHKOing Excadrill without boosting. Alternatively, while less immediately powerful, Horn Leech's healing can help Ogerpon-C to survive revenge killing attempts, and in some cases, even allow for multiple uses of Sturdy. However, while it does obtain OHKOs and 2HKOs on most notable targets, especially after a Swords Dance, the drastically lower power can cause Ogerpon-C to miss important OHKOs on targets like Slowking and Tyranitar, especially if unboosted. Ogerpon-C's last moveslot is immensely customizable thanks to its near perfect STAB combination; Stomping Tantrum gets key damage on Tinkaton, Cobalion, and Okidogi, while Spiky Shield helps to prevent being revenge killed by Lokix's First Impression and can allow Ogerpon-C to avoid being hit by Tinkaton's Gigaton Hammer entirely. It also scouts Choice Scarf users like Latios and Okidogi. Sturdy allows Ogerpon-C to be significantly more aggressive, with the ability to live any one hit from full HP allowing it to pose much more of a threat against Pokemon like Latios and Excadrill. Embody Aspect also gives Ogerpon-C unique defensive properties through Terastallization, with the Defense boost helping to improve the odds of living attacks like Scizor's Bullet Punch, and shedding Ogerpon-C's Grass typing can be handy against opposing Lokix, especially if it is not carrying Spiky Shield.</p> <p>Ogerpon-C fits on a wide variety of teams thanks to its high firepower, as well as its access to Sturdy allowing it to serve as an emergency check to certain threats. Entry hazard setters like Tinkaton and Sandy Shocks are valued teammates, with the chip damage they provide helping Ogerpon-C to have an even easier time securing kills. These Pokemon are also capable of helping to manage foes that may annoy Ogerpon-C such as Latios and Tornadus-T. Pivots such as Slowking and Tornadus-T are also valuable for their ability to get Ogerpon-C in safely. Methods of speed control, such as Sticky Web from Araquanid, or Pokemon that can spread paralysis such as Zapdos, Tinkaton, Slowking, and Rotom-W, are also appreciated to help Ogerpon-C get the jump on faster foes. Choice Specs Latios makes a strong partner, as it can help Ogerpon-C to deal with Okidogi, and the two can whittle down shared checks like Tinkaton and Scizor. Excadrill also greatly appreciates Ogerpon-C's ability to smash pesky Flying-types, especially Zapdos, and Ogerpon-C greatly benefits from Excadrill's hazard removal allowing it to keep Sturdy intact, as well as the extra support against Latios and Tinkaton. Powerful revenge killers, such as Lokix, are also appreciated for their ability to deal with Greninja and to pick off weakened Pokemon that Ogerpon-C may not be able to finish off.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>Ogerpon-C is a reliable wallbreaker thanks to its high-power STAB combination, potent coverage, and solid Speed tier, outpacing threats like Thundurus-T and Cobalion. Ogerpon-C's STAB moves have high Base Power and great coverage on the tier, hitting numerous staples such as Zapdos, Excadrill, Slowking, and Scizor for massive damage. Stomping Tantrum is good coverage against Steel-types such as Cobalion, Tinkaton, and Metagross. It is also Ogerpon-C's best option against Okidogi, one of its most prevalent answers. U-turn lets Ogerpon-C develop offensive momentum, pivoting out of bad matchups such as Metagross and Okidogi while doing good damage to other foes such as Hydrapple and Zarude. Alternatively, Spiky Shield scouts revenge killing attempts from Lokix as well as Choice item users like Greninja, Keldeo, and Scizor. After Terastallization, Embody Aspect grants Ogerpon-C a Defense boost, giving it better odds to survive an attack from Pokemon like Scizor and Excadrill and hit hard in return.</p> <p>Ogerpon-C fits best on offensive teams as a strong wallbreaker capable of denting various defensive Pokemon. Offensive pivots such as Tornadus-T, Latios, and Scizor are excellent teammates for it, pivoting out of Pokemon like Rhyperior, Zapdos, and Slowking to provide offensive momentum for Ogerpon-C. Additionally, these Pokemon appreciate Ogerpon-C's efficiency into their checks, namely Rhyperior, Slowking, Tyranitar, and Hisuian Arcanine, while also helping overwhelm shared checks such as Tinkaton and Metagross. Entry hazard setters such as Cobalion, Sandy Shocks, and Tinkaton appreciate Ogerpon-C's good matchups into common hazard removal Pokemon such as Excadrill and Mandibuzz, while the hazards they set make it more difficult to switch into it. In return, these Pokemon can answer Pokemon that would otherwise be able to overwhelm Ogerpon-C such as Lokix, Scizor, and Choice Scarf Hoopa-U, respectively. Ogerpon-C is extremely vulnerable to Okidogi, which resists its STAB combination and can hit hard in return with either of its STAB moves. Thus, Pokemon that can force Okidogi out such as Latios, Choice Scarf Hoopa-U, and Tornadus-T are greatly appreciated, preventing Okidogi from getting either a setup opportunity with Bulk Up or creating offensive momentum off of Ogerpon-C with other sets. Ogerpon-C's Speed, while very high, can leave it vulnerable to Pokemon like Greninja, Tornadus-T, Choice Scarf Hoopa-U, and Choice Scarf Okidogi. It is also vulnerable to Lokix's First Impression. Thus, countermeasures to these foes such as Azumarill, Tinkaton, and Zapdos are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "gulch"}, {"user_id": 487308, "username": "BT89"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540289, "username": "Tidal"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Hydrapple": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Hydrapple serves as a solid balance breaker, using its bulk and offensive prowess to handle threats like Excadrill while also being scary for foes like Tornadus-T and Metagross once is has set up Nasty Plot. It also has Regenerator to heal off any damage taken while checking these threats, allowing it to potentially repeat this process later in the game. Fickle Beam is an alternative move over Draco Meteor so Hydrapple can avoid the Special Attack drop while having a chance to deal more damage than Draco Meteor, allowing it to maintain its Nasty Plot boosts and to remain a big threat after firing it off. However using Fickle Beam means Hydrapple can miss out on KOs against foes like Zapdos and Tornadus-T if the boost doesn't activate. Earth Power provides coverage for Steel-types like Tinkaton and Metagross so that they cannot easily come in to cause issues for Hydrapple. Heavy-Duty Boots serves to make Hydrapple's healing from Regenerator more effective while improving its longevity by removing its vulnerability to entry hazards, as it commonly has to utilize its great typing to switch into powerful wallbreakers like Excadrill and Ogerpon. Maximum HP and maximum Defense make Hydrapple incredibly difficult for physical attackers to break, letting it better soak up U-turn from Scizor, Lokix, and Zarude as well as powerful hits from wallbreakers like Hisuian Arcanine or Tyranitar so that it can more easily set up Nasty Plot. Tera Steel improves its matchup against Ogerpon-C while also giving it a Toxic immunity to help against Toxapex and Mandibuzz, a Flying resistandce so it can set up Nasty Plot in front of Tornadus-T, and a Fairy resistance useful for dodging an OHKO from Choice Band Azumarill's Play Rough in case of emergency. Tera Fairy lets it set up more easily on Latios and opposing Hydrapple without gaining weaknesses to Excadrill and Mamoswine. However, Terastalizing Hydrapple removes its beneficial resistances to Ground and Electric, making it tougher to handle Volt Switch users such as Sandy Shocks and Rotom-W.</p> <p>Hydrapple acts as a solid wallbreaker for balance and bulky offensive playstyles, using its defensive profile to switch into foes that are offensively threatening or tough to break and then becoming a threat of its own. Slowking is a nice partner for it, forming a double Regenerator core that helps work around some problems for Hydrapple such as Tornadus-T and Tinkaton while acting a secondary Water resist in the event Hydrapple needs to Tera. Slowking also slow pivots to Hydrapple with Chilly Reception after soaking up a hit, allowing Hydrapple to either be a bigger threat due to having more HP or get its HP back from Regenerator more easiliy. Additionally, Slowking can use Thunder Wave against foes like Tinkaton and Mandibuzz to make them slower than Hydrapple, allowing it to more easily set up Nasty Plot. Zapdos is also a good teammate, defensively answering Scizor and Lokix, which can pose problems with their strong U-turn should they switch in on Hydrapple when it’s chipped. Hydrapple appreciates teammates that can help wear down Tinkaton into Earth Power range such as Lokix and Tornadus-T. It also appreciates Pokemon that can help pressure or defensively answer Flying-types such as Tyranitar or Rhyperior. Hydrapple apprecieates Stealth Rock setters like Cobalion and the previously mentioned Rhyperior to get targets into range of its boosted attacks more easily. Sand teams appreciate Hydrapple's defensive profile in tandem with Regenerator, it can use an Eject Button to safely bring in Excadrill and act as check to opposing Excadrill and Keldeo, which can be scary for sand teams otherwise.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Hydrapple is a dangerous wallbreaker that provides a lot of defensive utility through its typing to answer threats like Excadrill, Sandy Shocks, and Ogerpon. Leaf Storm and Draco Meteor are powerful and spammable STAB moves despite the Special Attack drop drawback. Earth Power provides coverage against Steel-types like Tinkaton and Metagross. Hydrapple lacks coverage outside of Earth Power, so Fickle Beam is usually preferred to have a secondary Dragon-type STAB move that doesn't have the ramification of lowering its Special Attack. Similarly, Giga Drain is another option to provide a secondary Grass-type STAB move that doesn't force Hydrapple to switch out and provides it with more longevity. Regenerator helps Hydrapple answer Excadrill and the Ogerpon formes and provides ample opportunities for Hydrapple to get into a position to wallbreak by keeping it healthy across a match. The EV spread allows Hydrapple to outspeed Azumarill and Ursaluna while maximizing its damage output. Tera Steel should primarily be used for its defensive value to flip the matchup against threats like Latios, Azumarill, and Scizor. Tera Fairy allows Hydrapple to combat Latios and opposing Hydrapple. However, Hydrapple should only Terastallize when necessary, as giving up its great defensive typing greatly hinders its matchup against Pokemon like Rotom-W and Excadrill.</p> <p>Hydrapple fits best on offensive teams that can help it get in safely and take pressure off it being the sole answer to the likes of Excadrill and Ogerpon. Pivots such as Tornadus-T and Zapdos are fantastic partners for these reasons; the former forms a Regenerator core, while the latter can punish Pokemon like Scizor and Azumarill with Static, crippling them for Hydrapple to outspeed. Steel-types like Tinkaton and Metagross prevent Hydrapple from easily locking into its STAB moves, so Pokemon like Excadrill, Slowking, and Sandy Shocks can help check and apply pressure on them. Excadrill notably provides Rapid Spin support to prevent Hydrapple being worn down by entry hazards and can act as a check to Latios, allowing Hydrapple to preserve the option to Terastallize. Sandy Shocks can provide Spikes support to wear down Pokemon like specially defensive Tyranitar and Toxapex into OHKO range while also checking Tornadus-T and Zapdos. Assault Vest Tornadus-T is a fairly consistent pivot into Hydrapple, so it is essential to have means to overwhelm it. Tyranitar, Tinkaton, and Rhyperior can provide Stealth Rock support to restrict Tornadus-T's ability to pivot into Hydrapple while being great defensive checks to Tornadus-T. Tinkaton can also provide Knock Off support to help remove key items like Tornadus-T's Assault Vest. Other Knock Off users like Scizor and Lokix can also achieve this while also getting Hydrapple in against Pokemon they struggle to get through like Toxapex and Cobalion.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 524894, "username": "cheru"}, {"user_id": 515132, "username": "Monky25"}, {"user_id": 620325, "username": "ThatOneApple"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Pecharunt": {"sets": {"Nasty Plot": {}, "Pivot": {}}}
}