{
  "Slowking-Galar": {
    "comments": "<h3>Other Options</h3> <p>A set utilizing an Assault Vest maximizes Galarian Slowking's special bulk and allows it to run more coverage options such as Flamethrower and Ice Beam, but Chilly Reception has far too many applications to pass up, and the lack of Heavy-Duty Boots makes Galarian Slowking far more susceptible to being worn down by hazards. All of the aforementioned attacks can be run over Scald or Thunder Wave to catch foes off guard, but the utility the latter two provide is usually preferred. A physically defensive set allows Galarian Slowking to more effectively check Hemogoblin, but other bulky Poison-types like Venomicon and Pecharunt simply perform that role much better.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-types like Great Tusk, Gliscor, Equilibra, and Landorus-T can force Galarian Slowking out while switching into Sludge Bomb and Thunder Wave with little fear. None of them appreciate being burned by Scald, however.</p> <p><strong>Knock Off</strong>: Because Galarian Slowking often does not have reliable recovery outside of Regenerator, Knock Off makes it susceptible to hazards and thus, much easier to chip. Foes like Arghonaut, Gliscor, Ogerpon-W, and Roaring Moon can threaten massive damage with Knock Off, forcing Galarian Slowking out. None of them barring Gliscor want to switch into Sludge Bomb, however. Similarly, the threat of Knock Off often dissuades Galarian Slowking from switching into the likes of Malaconda, Pelipper, Deoxys-S, and Clefable, despite having an otherwise favorable matchup.</p> <p><strong>Dark-types</strong>: Darkrai, Kingambit, Meowscarada, and Weavile all threaten Galarian Slowking with their Dark-type STAB moves, but they must be careful when switching into it in fear of Thunder Wave and Scald.</p> <p><strong>Colossoil</strong>: Colossoil, albeit rare, is the closest thing to a hard counter for Galarian Slowking, threatening it with both its Dark- and Ground-type STAB options, not fearing any status ailments and resisting Sludge Bomb.</p> <p><strong>Ghost-types</strong>: Dragapult and Gholdengo both are bulky enough to be able to switch into Dragapult with ease and threaten it out with a Ghost-type attack. Gholdengo even has access to Recover, allowing it to switch into Scald without much worry. Kitsunoh can come in on any move, barring Scald, and force Galarian Slowking out. Revenankh similarly forces it out, but it must be much more careful as to when it comes in while fearing Psychic Noise, Scald, and Thunder Wave.</p> <p><strong>Garganacl</strong>: Garganacl cannot immediately threaten Galarian Slowking but can switch into any of its attacks rather trivially and put pressure on it with Salt Cure.</p> <p><strong>Strong Physical Attackers</strong>: Ogerpon-W, Choice Band Hemogoblin, Dragonite, and Miasmaw can all deal heavy damage on Galarian Slowking and force it out. None of them like the threat of being statused, however.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<h4>Set Details</h4> <p>Galarian Slowking provides a unique function in the metagame by being the best anti-weather option. Its incredible special bulk, decent defensive typing, and access to Regenerator also allow it to function as a very effective slow and bulky pivot. The combination of Future Sight and Chilly Reception allows it to not just safely bring in a teammate but also hammer them with a delayed attack, leaving the foe in an uncomfortable position. Pokemon like Zamazenta, Iron Valiant, Mollux, and Venomicon all struggle to take a Future Sight and often give Galarian Slowking the space it needs to set up its Future Sight. Psychic Noise is an alternative that helps shut down the recovery options that bulky foes such as Gliscor, Arghonaut, and Garganacl have. It also acts as a way to immediately damage Arghonaut, Chuggalong, Venomicon, and Zamazenta. Thunder Wave allows Galarian Slowking to cripple common switch-ins such as Dragapult, Darkrai, Roaring Moon, and Miasmaw. Scald is an alternative option, threatening the Ground-types that might attempt to switch into Sludge Bomb such as Equilibra, Great Tusk, and Gliscor, the latter even more so if its Poison Heal has yet to be activated. Scald also punishes other foes that might try to switch in such as Zamazenta, Revenankh, and Snaelstrom. Slack Off is another option in this slot, providing reliable recovery at the cost of some versatility or coverage. Heavy-Duty Boots allows Galarian Slowking to come into a field riddled with entry hazards without much to worry about, whereas Colbur Berry gives Galarian Slowking a chance to punish foes such as Swords Dance Iron Valiant, Darkrai, Arghonaut, and Knock Off Venomicon. Tera Water makes Galarian Slowking that much sturdier into weather teams, allowing it to heck foes such as Walking Wake, Roaring Moon, and Barraskewda more effectively. This also rids it of its pesky Dark-type weakness, allowing it to threaten Malaconda in sun matchups without fearing Knock Off as much. Tera Fairy is an alternative so as to turn its weakness to Dark into a resistance while also turning it into a decent switch-in against Dragon-types such as Dragapult, Raging Bolt, and Roaring Moon. 16 Defense EVs allow Galarian Slowking to survive a Knock Off from Meowscarada while the rest of the EVs are put into its Special Defense to make it as tanky as possible on the special side.</p> <p>Galarian Slowking fits best on balance and bulky offense teams, where it can support heavy-hitting teammates. Frail but strong attackers such as Hisuian Samurott, Weavile, and Cinderace all appreciate Galarian Slowking bringing them in with relative ease. All of them also pressure physically frail foes while inviting specially frail ones, pairing ever so nicely with Galarian Slowking's Future Sight. Galarian Slowking also appreciates entry hazard support, as its Future Sight forces foes to switch out at inopportune times. Teammates such as Arghonaut, Gliscor, and Heatran all pair quite nicely by covering Galarian Slowking's weaknesses while setting entry hazards. The former two even have access to Knock Off, making every foe's switch-in costly. Gliscor can even act as a Knock Off switch-in once its Poison Heal has activated, keeping Galarian Slowking's item slot intact. Kyurem is one the biggest benefactors of Galarian Slowking's slow pivoting; not only does Galarian Slowking's Future Sight help it break through common revenge killers such as Iron Valiant and Zamazenta and sturdy checks such as Arghonaut and Mollux alike, but its Chilly Reception enables Choice Specs Kyurem to run Blizzard for extra firepower. Equilibra is another good teammate, covering Galarian Slowking's Ground-type weakness while Galarian Slowking can switch into Fighting-type attacks for it. They can also both use delayed attacks with Equilibra's Doom Desire, keeping an unending barrage of damage going, even while double switching. Cresceidon provides a fantastic partner, being able to beat most Ground- and Dark-types that threaten Galarian Slowking, such as Great Tusk and Landorus-T as well as Darkrai, Kingambit, and Weavile. In return, Galarian Slowking can switch into some of the foes that aim to pester Cresceidon such as Mollux, Garganacl, Iron Moth, and Heatran. On bulkier teams, Hydrapple and Alomomola can make nice Regenerator cores with Galarian Slowking, allowing them to switch nigh indefinitely with proper prediction while Future Sight slowly chips at the opposing team. Both of them also deal with any Ground-type attacks thrown in Galarian Slowking's way, with Hydrapple in particular being notable, as it can check Ogerpon-W, a foe that Galarian Slowking often struggles with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 273339, "username": "Lasen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 221710, "username": "Da Pizza Man"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Gliscor": {
    "comments": "<h3>Other Options</h3> <p>Swords Dance Gliscor may find it worth forgoing Earthquake in favor of both Facade and Knock Off on the same set. Doing so allows it to threaten all of Venomicon, Air Balloon Gholdengo, Arghonaut, and Equilibra while retaining Facade's consistency. While dropping Gliscor's only STAB option makes it less immediately threatening towards Galarian Slowking, Chuggalong and Garganacl, it results in a set that combines both the progress making of Knock Off with Facade's ability to hit most targets neutrally regardless of their Tera type, making it a valid alternative as a late-game sweeper. Both Gliscor sets may find it beneficial to run Tera Dragon in order to patch up a team defensively against Ogerpon-W. While not as all-encompassing as Tera Water—notably worsening Gliscor's ability to deal with Hemogoblin and Chuggalong—Tera Dragon ensures Gliscor can safely punish Ogerpon-W with Toxic or Facade without risking a 2HKO from Power Whip or Ivy Cudgel. Entry hazard setter Gliscor has the option of running Poison Jab as its main attacking move to benefit stall teams. This allows Gliscor to punish Hatterene in order to set Spikes while also letting it directly threaten Ogerpon-W and fish for poison throughout a game. Poison Jab is almost exclusively run with Knock Off, due to the former compressing the damage and utility of Gliscor's usual Earthquake + Toxic combination. Another unique benefit is Poison Jab's greater PP count compared to Earthquake and Toxic, allowing it to outlast opposing Gliscor in the event of a PP stall war. Taunt is a flexible option for Gliscor on stall teams that allows Gliscor to deny hazards from opposing Arghonaut, Gliscor, Skarmory, and Ting-Lu, prevent pivoting attempts from Galarian Slowking and Malaconda, and stop Alomomola, Clefable, Venomicon, and others from using their healing moves. While it comes with the opportunity cost of losing Knock Off or Toxic, it can serve as a potent means of denying progress from slower balance teams.</p> <h3>Checks and Counters</h3> <p><strong>Special Wallbreakers</strong>: Even with full special defense investment, Gliscor is unable to stay in versus many of the tier's wallbreakers, including Darkrai, Deoxys-S, Primarina, Walking Wake, and Kyurem.</p> <p><strong>Setup Sweepers</strong>: While Gliscor threatens progress on most Pokemon with its combination of Toxic and Earthquake, many setup sweepers are able to circumvent Gliscor's options by way of their typing, Tera, or item choice. Air Balloon Gholdengo, Taunt Roaring Moon, Cawmodore, and Nasty Plot Venomicon all have the ability to use Gliscor as setup fodder, among others.</p> <p><strong>Ice-type Coverage</strong>: Some Pokemon that could be threatened or walled by Gliscor in theory, such as Great Tusk, Dragonite, and Meowscarada, commonly run coverage to target Gliscor's Ice weakness.</p> <p><strong>Miasmaw</strong>: Miasmaw is a major annoyance for Gliscor, as Neutralizing Gas shuts off Poison Heal and causes Gliscor to take massive poison damage, which usually forces it out. However, Miasmaw cannot consistently switch in on Gliscor due to its physical frailty and hazard weakness.</p> <p><strong>Opposing Gliscor</strong>: Swords Dance Gliscor is able to use opposing hazard setter Gliscor as setup fodder. Additionally, two hazard setter Gliscor facing off often results in a stalemate, where neither is encouraged to switch out and three layers of spikes are set on each side of the field. This can result in a PP stall war between the two Gliscor, resulting in the loss of one Gliscor and the other's resources being greatly limited.</p>",
    "sets": {
      "Defensive Hazard Setter": {
        "description": "<h4>Set Details</h4> <p>Due to its unmatched longevity and myriad utility options, Gliscor establishes itself as one of the most effective hazard setters in the format. Its ability to outlast common defensive Pokemon like Arghonaut and Venomicon and threaten the likes of Galarian Slowking and Garganacl grants Gliscor numerous opportunities to set hazards throughout a game. Spikes is the primary hazard of choice, leveraging Gliscor's ability to generate free turns in order to set more layers of Spikes. Gliscor may choose to run Stealth Rock instead, either when paired with a Spikes setter or with U-turn for a less passive set overall. Toxic allows Gliscor to threaten Pokemon by putting them on a timer, such as Zamazenta, Great Tusk, Cresceidon, Arghonaut, Rillaboom, and Ogerpon-W. This synergizes with Protect, allowing Gliscor to force chip damage on poisoned targets that threaten it out. Note that Gliscor sets running Toxic may find themselves walled and taken advantage of by Pokemon like Equilibra, Venomicon, and Air Balloon Gholdengo. For this reason, Gliscor may run Knock Off or U-turn in order to make progress or regain momentum in these matchups. Gliscor lacking Toxic, however, are unable to effectively threaten bulky setup sweepers like Zamazenta, Dragonite, and Revenankh. Protect is mandatory on every Gliscor set, enabling its longevity by giving it a free turn to recover with Poison Heal and having the benefit of scouting the opponent for coverage that may threaten it. A specially defensive spread grants Gliscor the ability to check special attackers like Raging Bolt, Iron Moth, Iron Crown, and Dragapult while retaining a positive matchup versus physical attackers like Hemogoblin, Cinderace, Zamazenta, and Kingambit by virtue of its typing. A physically defensive spread grants Gliscor more consistency against the physical threats it seeks to punish and notably lets it spread Toxic in the face of poor matchups like Great Tusk, Dragonite, and Ogerpon-W. Water is Gliscor's primary choice of Tera type on specially defensive sets, granting it improved matchups versus Darkrai, Deoxys-S, Cresceidon, Chuggalong, Walking Wake, and Gholdengo. Tera Ghost can be used on physically defensive sets in order to block Rapid Spin from Great Tusk, at the cost of worsening matchups against the likes of Roaring Moon, Gholdengo, and Dragapult. The given physically defensive spread with 16 Special Defense EVs allows Gliscor to take a Life Orb-boosted Psycho Boost from Deoxys-S and a +1 Dragon Pulse from Raging Bolt from full health. It's specially defensive EV spread with 36 Defense EVs allows Gliscor to survive Ivy Cudgel from Ogerpon-W from full health, and both spreads run 244 HP EVs to maximize Gliscor's recovery from Poison Heal.</p> <p>Gliscor can fit on any team style bar hyper offense, but it thrives the most on balance teams that appreciate its ability to soak up hits, set entry hazards, and spread Toxic or Knock Off to whittle down the opposing team. Teams will often partition Spikes and Stealth Rock between Gliscor and another Pokemon, like Stealth Rock on Garganacl or Venomicon or Spikes on Arghonaut and Skarmory. Gliscor may appreciate a spinblocker to secure hazards, with partners like Kitsunoh and Air Balloon Gholdengo denying Rapid Spin from Equilibra or Great Tusk, respectively, and the latter blocking Defog attempts from Corviknight. Other forms of hazard removal, like Cinderace's Court Change and Rapid Spin from Mollux, are easily denied by Gliscor itself, forcing Terastallization from the latter. While it often runs Knock Off itself, teams using Gliscor often use Knock Off from Arghonaut, Weavile, or Roaring Moon to force hazard damage on resilient Heavy-Duty Boots users like Cresceidon and Venomicon. Gliscor is often unable to fully wall or punish wallbreakers on its own, and it appreciates the presence of bulky Water or Ice-resistant Pokemon like Arghonaut, Mollux, and Cresceidon to form a defensive core. Pokemon that are heavily reliant on their items to function, such as Krilowatt, Cresceidon, and Mollux, heavily appreciate Gliscor’s ability to act as a consistent switch-in to Knock Off.</p>"
      },
      "Swords Dance": {
        "description": "<h4>Set Details</h4> <p>Swords Dance Gliscor sets itself apart from other sweepers like Kingambit and Zamazenta with its utility over the course of a game and ability to threaten a sweep multiple times. With its superb defensive profile, Swords Dance Gliscor is able to take advantage of lower-paced teams giving it setup opportunities and trade positively into offensive structures. Being able to set up Swords Dance without risk in the face of opposing Gliscor, Venomicon, Garganacl, Mollux, Clefable, and Alomomola, among others, allows it to punish passive play and break through defensive cores with its near-unresisted coverage. Knock Off is the secondary move of choice for Gliscor, as it allows Gliscor to make progress against Arghonaut and Cresceidon, more easily pressure Equilibra, and break through Air Balloon Gholdengo. Facade is an equally potent choice, allowing Gliscor to break through Venomicon and opposing Gliscor with greater ease, and provide strong neutral coverage as a mid-ground to hit most Tera types seeking to avoid Earthquake, like Tera Grass Iron Moth and Tera Flying Kingambit, Roaring Moon, Chuggalong, and Mollux. Protect is mandatory, as it grants Gliscor a free turn to activate Poison Heal and the ability to safely recover throughout a game. Water is Gliscor's most effective Tera type, flipping its weaknesses to Water and Ice and letting it take most hits neutrally while leveraging its good bulk. Tera Normal is a valid option for sets running Facade, greatly boosting Gliscor's wallbreaking capabilities and removing both of its weaknesses. A specially defensive spread grants Gliscor more opportunities to set up throughout a game and limits the amount of Pokemon that force it out, but a physically defensive spread allows Gliscor to more comfortably take on physical sweepers like Kingambit, Bulk Up Revenankh, and Hemogoblin. The given physically defensive spread with 16 Special Defense EVs allows Gliscor to take a Life Orb-boosted Psycho Boost from Deoxys-S and a +1 Dragon Pulse from Raging Bolt from full health. Its specially defensive EV spread with 36 Defense EVs allows Gliscor to tank Ivy Cudgel from Ogerpon-W from full health, and both spreads run 244 HP EVs to maximize Gliscor's recovery from Poison Heal.</p> <p>Balanced, bulky offense, and even stall teams seeking a bulky late-game sweeper appreciate Swords Dance Gliscor. While it lacks the utility of its Spikes set, Swords Dance Gliscor remains an incredible asset for defensively oriented teams that need a way of breaking down opposing defensive teams. Gliscor pairs well with teammates that can stack hazards and spread Knock Off throughout a game and check the Pokemon that commonly force it out. Arghonaut is an obvious choice for this role, as it covers Gliscor's poor matchups into Weavile, Equilibra, Darkrai, and Hisuian Samurott, but other hazard setters like Ting-Lu, Venomicon, and Clefable are viable companions. Swords Dance Gliscor has a tendency to be forced out by Encore users like Cresceidon and Iron Valiant, so teammates like Mollux, Ogerpon-W, and Gholdengo serve well to punish those particular matchups. Gliscor appreciates offensive teammates to help break down its checks, such as Kyurem, Darkrai, Iron Crown, and Raging Bolt targeting Pokemon such as Arghonaut, Skarmory, and Great Tusk. Much like its hazard setter set, Gliscor provides a reliable absorber of Knock Off to benefit item-reliant teammates like Cresceidon, Galarian Slowking, Moltres, and Mollux. Additionally, Swords Dance Gliscor plays an important role on stall teams, spreading Knock Off and exerting offensive pressure on Pokemon with great longevity, such as Alomomola, Garganacl, Clefable, and opposing Gliscor, which are otherwise difficult for stall teams to remove. Pairing Gliscor with an Ogerpon-W check such as Hydrapple, Sinistcha, or Amoonguss forms a potent core, which should be used alongside stall staples like Dondozo, Blissey, Alomomola, Corviknight, Skarmory, and Clodsire.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583322, "username": "uppa"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 221710, "username": "Da Pizza Man"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Dragapult": {
    "comments": "<h3>Checks and Counters</h3> <p><strong>Garganacl</strong>: Garganacl is immune to any status, and the secondary effect of Purifying Salt makes it take less damage from Ghost-type moves, which forces Dragapult out and allows Garganacl to either use Salt Cure on a teammate or set up Stealth Rock.</p> <p><strong>Fairy-types</strong>: Dragapult can barely touch Fairy-types, as they always threaten it out on the field; notably, bulky defensive Fairy-types like Clefable and Cresceidon can spread paralysis and slow Dragapult down. However, Cresceidon doesn't like to be statused in return. Faster threats like Booster Energy Iron Valiant &amp; Pixilate Extreme Speed Hemogoblin can outspeed and KO Dragapult. Iron Valiant, however, can only check Dragapult one time with Booster Energy, while Hemogoblin's Extreme Speed has limited PP.</p> <p><strong>Dark-types</strong>: Kingambit, Ting-Lu, Darkrai, and Hisuian Samurott are key threats that can hit Dragapult with a super effective attack or be reliable switch-ins to Hex due to their Ghost resistance. Additionally, Knock Off users like Weavile and Choice Scarf Hisuian Samurott can not only get rid of Dragapult's item but also hit it super effectively. However, status can hinder these foes, as Darkrai doesn't enjoy being paralyzed, while Ting-Lu and Hisuian Samurott fear being burned, and all of these Pokemon except Kingambit take a decent chunk of damage from U-turn.</p> <p><strong>Shox</strong>: Shox is one of the best counters to Dragapult, as it has an immunity to Ghost-type moves and Thunder Wave, and it carries moves like Ice Beam, Knock Off, and Encore.</p>",
    "sets": {
      "Hex": {
        "description": "<h4>Set Details</h4> <p>Dragapult is an excellent offensive pivot thanks to U-turn paired with an incredibly high Speed stat alongside powerful status moves such as Will-O-Wisp and Thunder Wave. This deadly combination allows it to maneuver around slower threats and cripple foes consistently over the course of a match. Hex is a great way for Dragapult to check Poison Heal Pokemon like Gliscor and Snaelstrom, using their own status against them while also exploiting its own status moves as well. Will-O-Wisp can be used to neutralize threatening physical attackers such as Kitsunoh, Great Tusk, and Zamazenta, while Thunder Wave can be used to cripple Pokemon that have an immunity to burns like Iron Moth and Mollux and slow down fast attackers like Darkrai, Stratagem, and Cresceidon, allowing its teammates to switch in and effectively deal with them, while also giving Dragapult the ability to set up its own status to empower Hex. Dragon Darts is a reliable and strong STAB attack that can pressure specially defensive Pokemon such as Blissey while also hitting Raging Bolt and Multiscale Dragonite. Alternatively, Draco Meteor nails opposing Dragon-types such as Walking Wake, Miasmaw, and Chuggalong without Clangorous Soul's boosts. Tera Fairy helps with Dragapult's weakness to Dragon-types like Chuggalong by granting a Dragon immunity while also allowing it to become resistant to Dark-type attacks from the likes of Darkrai and Kingambit. Tera Ghost is a great alternative to power up Hex while also dropping Dragapult's weakness to Dragon- and Fairy-types like Hemogoblin. The first given EV spread allows Dragapult to always 2HKO Hisuian Samurott with Dragon Darts.</p> <p>Dragapult is a great pick for offensive balanced teams, being a complement to entry hazard setters such as Arghonaut, Gliscor, and Mollux that can assist it by chipping down foes that don't have Heavy-Duty Boots or reliable hazard removal. In return, Dragapult can assist these Pokemon by being a reliably fast Pokemon with potential speed control that can switch in and spread status or deal good damage then pivot. Knock Off users like Colossoil and Kitsunoh pair greatly with Dragapult to remove Heavy-Duty Boots from opposing Pokemon to help force further chip damage when coupled with Will-O-Wisp alongside hazards. Fairy-type Pokemon like Hemogoblin and Cresceidon threaten Dragapult around every corner, making Pokemon like Venomicon and Galarian Slowking great teammates to let Dragapult safely pivot out. Galarian Slowking pairs well with Dragapult thanks to Chilly Reception, allowing it to form a solid pivot core. In return, Dragapult removes Ghost- and Dragon-type threats to them with its powerful dual STAB moves, though when using Hex, Dragapult needs to spread status first and foremost. Although Dragapult has a Speed tier almost unmatched in the metagame, Booster Energy users like Iron Valiant and Iron Moth can threaten Dragapult, so bulky defensive teammates like Equilibra can efficiently be switched in to take a super effective hit aimed at Dragapult. The aforementioned Fairy-type Pokemon also partner well with Dragapult, as they can help ease pressure against opposing Dragon-types while powering up Dragapult's Hex with their own status moves. Shox is one of Dragapult's struggles, as it is immune to status besides burns and can handle either Dragon Darts or Draco Meteor and recover with Slack Off; Dragapult can't really do much to it and other status-immune Pokemon like Garganacl, so having teammates like Great Tusk and Equilibra that can threaten them out with super effective Fighting-, Steel-, and Ground-type moves is greatly appreciated. Dragapult is threatened out by the likes of Knock Off users like Gliscor, so having teammates such as Arghonaut, which can handle taking Knock Off, and Alomomola, which can defensively handle them, helps Dragapult greatly.</p> <h4>Other Options</h4> <p>An alternative way to utilize Dragapult's power is by using a Choice Specs set to let it act as a wallbreaker, though this typically isn't seen as much, as spreading status is much more preferred.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 635656, "username": "Elvira"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604741, "username": "kenn"}, {"user_id": 221710, "username": "Da Pizza Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Iron Moth": {
    "outdated": true,
    "comments": "<h4>Checks and Counters</h4> <p><strong>Astrolotl and Ceruledge</strong>: Specially defensive Astrolotl is Iron Moth's most common counter, stomaching even its sun-boosted Choice Specs Tera Fire Overheat and threatening to KO it back with Stomping Tantrum. In combination with a Poison-resistant Pokemon like Venomicon, Iron Moth can cede crucial momentum, providing the opponent with an opportunity for a comeback. Flash Fire Ceruledge is Iron Moth's hardest counter, being immune to Overheat and Fiery Dance,  resistant to Solar Beam and Sludge Wave, and able to strike back with a boosted Shadow Sneak. However, Iron Moth can run Tera Ground + Tera Blast specifically to circumvent these counters.</p> <p><strong>Stealth Rock</strong>: Stealth Rock wears down Iron Moth exceptionally quickly. This is particularly notable with its Choice Specs set, which needs to switch out often to reset Overheat's Special Attack drops.</p> <p><strong>Priority</strong>: Sucker Punch Kingambit and Extreme Speed Dragonite can prey on Iron Moth's weak physical defense. Kingambit must be wary of Tera Fairy Iron Moth, however.</p> <p><strong>Faster Foes</strong>: Roaring Moon, Cinderace, Meowscarada, Greninja, and Psyshock Iron Valiant can pick off Iron Moth before it can respond.</p> <p><strong>Special Tanks</strong>: Clodsire, Skeledirge, Arghonaut, and Ting-Lu can easily tank most moves from Booster Energy Iron Moth, but they are 2HKOed by its sun-boosted Choice Specs Overheat with any prior damage or if it Terastallizes.</p> <p><strong>Rain Teams</strong>: Pelipper can override Jumbao's sun with rain, which weakens Iron Moth's best attacks. Floatzel and Quaquaval hit Iron Moth's weak physical defense.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h5>Set Details</h5> <p>Choice Specs Iron Moth is the strongest wallbreaker available for sun teams. Its Tera Fire Overheat under sun can 2HKO Arghonaut and Skeledirge, two of the best special walls in the metagame, and still deal massive damage to frailer targets at -2. Solar Beam more reliably 2HKOes Arghonaut, Toxapex, and Garganacl so that Iron Moth isn't required to Terastallize to be effective. Fiery Dance lets Iron Moth snowball and end games once the opposing team has no remaining Unaware users and is sufficiently weakened. Sludge Wave 2HKOes Astrolotl and Dragonite and OHKOes Cinderace outside of sun, which could otherwise tank an Overheat and pivot around the weakened hit. Ground-type Tera Blast OHKOes Ceruledge, Astrolotl, Skeledirge, and opposing Iron Moth with a surprise hit.</p> <p>Drought Jumbao is a required teammate to set up sun. Healing Wish can help Iron Moth offset Stealth Rock damage and get into battle late-game. Other Protosynthesis users like Roaring Moon and Great Tusk fit fantastically alongside Iron Moth. Roaring Moon's Choice Band-boosted attacks complement Iron Moth's strong special attacks, and its U-turn can bring Iron Moth in safely against a Fairy- or Steel-type switch-in. Great Tusk can remove entry hazards and switch into strong physical attackers like Roaring Moon and Kingambit. In return, Iron Moth very easily switches into Jumbao, one of Great Tusk's hard counters. Eject Button Hatterene is a fantastic teammate that helps keep Stealth Rock off the field and give Iron Moth a crucial free switch.</p>"
      },
      "Booster Energy": {
        "description": "<h5>Set Details</h5> <p>Booster Energy Iron Moth fits best on hyper offense teams where Booster Energy's one-time use can be easily justified. Although it faces some competition  from Quiver Dance Volcarona, its instant power and higher natural Speed tier gives it a niche over Volcarona. Fiery Dance allows Iron Moth to snowball quickly, while Sludge Wave forces Arghonaut and Garganacl to think twice before Terastallizing into a Fairy-type. Energy Ball 2HKOes Arghonaut, Krilowatt, and Garganacl, but Psychic maintains coverage against Arghonaut while pressuring Venomicon, Dragapult, and Clodsire harder. Ground-type Tera Blast allows Iron Moth to push past Skeledirge, Astrolotl, Clodsire, and Ceruledge, which would otherwise give it serious trouble. Dazzling Gleam is best when Iron Moth is Tera Fairy, hitting Roaring Moon and Dragapult more effectively. Tera Fairy allows Iron Moth to stomach Roaring Moon's STAB moves and Kingambit's Sucker Punch, removing them for a surprise KO. Agility helps Iron Moth sweep better, but it displaces a coverage move and is generally outclassed by Volcarona as a setup sweeper. Tera Grass is the best option, turning Iron Moth's severe Ground weakness into a resistance and boosting Energy Ball. An EV spread of 124 Def / 132 SpA / 252 Spe can be used so that Booster Energy raises Iron Moth's Speed, but the drop in power is noticeable. Booster Energy Iron Moth can also fit on sun teams to thwart typical counterplay to its Choice Specs set. Solar Beam should be run to OHKO specially defensive Garganacl at +1 and with Quark Drive active. However, Choice Specs is usually more effective against unprepared teams.</p> <p>Iron Moth fits excellently on hyper offense teams. Entry hazard setters like Meowscarada, Greninja, and Garchomp enable Iron Moth to net KOs more easily. Rapid Spin users like Caribolt and Great Tusk remove Stealth Rock to help Iron Moth leverage its good special bulk. Other hyper offense sweepers like Dragon Dance Roaring Moon, Swords Dance Iron Valiant, Dragon Dance Dragonite, and Scale Shot + Swords Dance Miasmaw tend to struggle with Jumbao, which Iron Moth can help deal with. Supreme Overlord Kingambit can clean up games after Iron Moth has broken holes and fainted.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 227784, "username": "snake"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 251944, "username": "spoo"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493260, "username": "Marnie"}]}]}
  },
  "Syclant": {"sets": {"Tail Glow": {}}},
  "Revenankh": {
    "comments": "<h3>Other Options</h3> <p>Substitute is an option to avoid status conditions if Revenankh does not run Tera Poison or Tera Fire. Taunt can also help against slower Pokemon to not set up alongside Revenankh. Glare can relieve Revenankh from relying on its priority moves and cripple faster foes; however, it is hard to fit alongside the moves Revenankh is forced to run. Choice Band, alongside Trick, gives Revenankh some initial firepower while being able to cripple the opponent; however, Revenankh usually fears being locked into a move that foes can use against it, such as a priority move against Chuggalong.</p> <h3>Checks and Counters</h3> <p><strong>Chuggalong</strong>: Chuggalong is a solid counter to Revenankh, as it takes nothing from Drain Punch and Shadow Sneak thanks to Armor Tail. It also avoids Poltergeist once Throat Spray is used. It only has to worry about Shadow Claw or Earthquake; however, it can revenge kill a weakened Revenankh.</p> <p><strong>Arghonaut</strong>: Thanks to Unaware, Arghonaut does not care about any boosts Revenankh may accrue; however, it cannot make progress against Revenankh as Knock Off does little damage and Arghonaut cannot force it out with Circle Throw.</p> <p><strong>Ghost-types</strong>: Dragapult, Kitsunoh, and Gholdengo are all faster than Revenankh and can nail it with their own Ghost-type STAB moves, or cripple it with Will-O-Wisp in the case of the former two Pokemon. However, they must be relatively healthy to safely deal with Revenankh as they take a lot of damage from Shadow Sneak, and they cannot safely switch in as they are decimated by Poltergeist.</p> <p><strong>Fairy-types</strong>: Hemogoblin can fire off a powerful Pixilate-boosted Extreme Speed before any of Revenankh's Ghost-type attacks, and it resists Drain Punch. Cresceidon can accrue chip damage with Rough Skin in tandem with Rocky Helmet or fire off a powerful Moonblast at Revenankh. Clefable can cripple Revenankh with Thunder Wave or even run Unaware to be unaffected by its boosts.</p> <p><strong>Flying-types</strong>: Gliscor and Venomicon can sit in front of Revenankh and either use Toxic on it or in the latter's case, nail it with Hurricane while taking little damage from Poltergeist. Skarmory can force Revenankh out with Whirlwind while taking minimal damage from any of its moves barring Poltergeist.</p>",
    "sets": {
      "Bulk Up": {
        "description": "<h4>Set Details</h4> <p>Revenankh provides amazing wallbreaking and sweeping capabilities for any playstyle, ranging from hyper offense to balance, thanks to its fantastic ability in conjunction with STAB-boosted Drain Punch, all backed by a primary Ghost typing, allowing Revenankh to hit almost everything in the metagame for heavy neutral damage. Bulk Up is the focus of this set, allowing Revenankh to augment its Attack and Defense, making it harder to be revenge killed. Drain Punch allows Revenankh to keep itself healthy throughout the match and bypass its mediocre Speed, thanks to Triage, to revenge kill faster foes such as Darkrai and Meowscarada. Poltergeist gives Revenankh a heavy-hitting spammable Ghost-type STAB move to break through fatter, slower Pokemon such as Galarian Slowking, Venomicon, and Necturna, but requires Revenankh's teammates to find other means of item manipulation, as Knock Off causes Poltergeist to fail. Shadow Claw is a weaker, albeit more consistent, STAB move option and gives Revenankh a way to hit Chuggalong, which is immune to Drain Punch and Poltergeist after activating Throat Spray. That being said, the power difference is notable, as Shadow Claw requires multiple boosts to OHKO or 2HKO Pokemon that Poltergeist may only need one or no boost for, such as Nasty Plot Venomicon and Arghonaut, even with Tera Ghost. Shadow Sneak gives Revenankh another form of priority to nail faster threats that may be immune to or resist Drain Punch such as Dragapult, Gholdengo, and Deoxys-S. Moonlight can be used, as it interacts with Triage and gives Revenankh a form of reliable recovery, which helps it stay healthier in the long run, as Fighting-resistant foes can deny a good chunk of healing from Drain Punch. Earthquake specifically hits Chuggalong, which is useful should Revenankh run Poltergeist over Shadow Claw. The Speed EVs outpace Arghonaut and other base 75s while maximizing Attack, and the rest are dumped into HP for general bulk. Tera Ghost powers up Revenankh's STAB moves while shedding its more problematic weaknesses such as Psychic, Fairy, and Flying, allowing it to set up on Venomicon lacking Nasty Plot. Tera Poison allows Revenankh to resist Hemogoblin's Extreme Speed while also becoming immune to Toxic from the likes of Gliscor. Tera Fire resists anything Hemogoblin has to offer while avoiding Will-O-Wisp from other Ghost-types such as Dragapult, Kitsunoh, and Necturna.</p> <p>Revenankh pairs extremely well with other bulkier wincons such as Garganacl or Venomicon, as they all have the ability to open up setup opportunities for each other against opposing Pokemon. Garganacl also provides status absorption and resistance to Ghost-type attacks, making it a fantastic partner for Revenankh. Wallbreakers such as Ogerpon-W or Walking Wake can open up holes in the opposing team, allowing Revenankh to come in and clean up. Equilibra provides entry hazard removal, which gives Revenankh multiple opportunities to hit the field and set up. Furthermore, Equilibra also pressures Fairy-types such as Clefable while being a super-solid check to Chuggalong. Cresceidon provides Thunder Wave support, allowing Revenankh to leverage its powerful Ghost-type STAB moves against faster threats such as Kitsunoh and Iron Crown. Other paralysis support from the likes of Galarian Slowking and Clefable can help slow down foes and allow Revenankh to have an easier time using its neutral priority moves. Deoxys-S and Iron Crown are fantastic partners as well thanks to them threatening two of Revenankh's biggest counters, Arghonaut and Chuggalong. In exchange, Revenankh handles most Dark-types such as Darkrai and Kingambit. Gliscor provides entry hazard support, which helps Revenankh clean up lategame, as well as status absorption to prevent wasting Revenankh's Terastallization. Trick users such as Kitsunoh and Gholdengo can manipulate the foe's items without compromising Revenankh's ability to use Poltergeist.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604741, "username": "kenn"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 221710, "username": "Da Pizza Man"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "Lustre"}]}]}
  },
  "Pyroak": {"sets": {"Contrary Tank": {}}},
  "Fidgit": {"sets": {"Persistent": {}}},
  "Stratagem": {
    "comments": "<h3>Other Options</h3> <p>Stratagem can forgo Power Herb and hold a Life Orb instead to be a powerful wallbreaker, notably 2HKOing Arghonaut with Energy Ball without needing Tera Grass. However, Life Orb chip damage makes revenge killing Stratagem easier. Stealth Rock can be run on such a set to give Stratagem some utility, and it often can place entry hazards with the switches it forces. However, Stratagem can struggle to wallbreak without a setup move. Calm Mind is also an option to let Stratagem quickly end games when given a setup opportunity, but Calm Mind is harder to set up with than Meteor Beam due to Stratagem's frailty. Earth Power can be used to OHKO Glimmora and Heatran at the cost of either valuable coverage or a setup move, weakening its ability to wallbreak past a large amount of the metagame.</p> <h3>Checks and Counters</h3> <p><strong>Specially Defensive Foes</strong>: Stratagem struggles to beat special walls such as Galarian Slowking, Cresceidon, Ting-Lu, and Equilibra. The former two can cripple it with Thunder Wave, Ting-Lu is able to remove the +1 boost with Whirlwind, and Equilibra can OHKO Stratagem with Flash Cannon. Stratagem is similarly threatened by Equilibra's Doom Desire sets, but it can often put the opponent in an awkward position due to the time it takes to land.</p> <p><strong>Arghonaut</strong>: Arghonaut is able to easily tank an Energy Ball from Stratagem and deal a large amount of damage with Circle Throw. If Arghonaut burns Tera, it can freely set Spikes on Stratagem.</p> <p><strong>Priority</strong>: Due to Stratagem's frailty, threats such as Hemogoblin, Kingambit, Rillaboom, and Revenankh can easily revenge kill it with Extreme Speed, Sucker Punch, Grassy Glide, and Drain Punch, respectively. However, Hemogoblin has to be wary of Tera Fire.</p> <p><strong>Faster Pokemon</strong>: Although Stratagem outspeeds the vast majority of the metagame, faster threats such as Dragapult, Zamazenta, and Deoxys-S greatly threaten it due to its frailty. Booster Energy threats such as Iron Valiant and Iron Crown can pose similar problems.</p> <p><strong>Defensive Terastallization</strong>: As Stratagem cannot take a hit due to its pitiful bulk, Pokemon that Terastallize to resist Stratagem's attacks can beat it, such as Great Tusk using Tera Steel to survive Energy Ball and Gholdengo using Tera Water to take Fire Blast and then OHKO with Close Combat and Make it Rain, respectively.</p>",
    "sets": {
      "Meteor Beam": {
        "description": "<h4>Set Details</h4> <p>Meteor Beam Stratagem is a terrifying wallbreaker due to its blazing Speed stat, great coverage options, and excellence at breaking holes through walls such as Equilibra and Ting-Lu. It can also serve as an excellent wincon once checks such as Galarian Slowking and Arghonaut have been weakened. Due to its frailty, Stratagem usually needs to come in on a free switch such as when an ally is KOed, although it is able to switch into Landorus-T and Mollux relatively safely. Energy Ball provides coverage against Arghonaut, Cresceidon, and Ting-Lu, although Stratagem is not guaranteed to OHKO these foes. Fire Blast is essential coverage, allowing Stratagem to deal large amounts of damage to the Steel-types that would otherwise wall it such as Equilibra and Gholdengo. Tera Fire strengthens Fire Blast and allows Stratagem to beat Equilibra and Heatran consistently thanks to Levitate while also OHKOing offensive Gholdengo. It also allows Stratagem to resist Pixilate Extreme Speed from Hemogoblin and Grassy Glide from Rillaboom, making it harder to revenge kill. Tera Grass allows Stratagem to 2HKO Arghonaut and Ting-Lu at +1 while also OHKOing Cresceidon at +1 if Multiscale is broken prior.</p> <p>Stratagem fits best on hyper offense teams and can serve different uses depending on the matchup. Against balance structures, Stratagem serves as an excellent wallbreaker and paves the way for teammates such as Chuggalong and Iron Moth to sweep. Against hyper offense teams, Stratagem can easily be a late-game wincon, since it is hard to revenge kill once Booster Energy has been expended from threats such as Iron Valiant and Iron Moth. Entry hazard leads such as Glimmora and Deoxys-S make excellent teammates for it. Glimmora's Toxic Spikes support annoys walls such as Arghonaut and Ting-Lu, while Deoxys-S has an offensive presence with Psycho Boost. In return, Stratagem is able to offensively pressure hazard removers such as Great Tusk and Mollux, although it cannot prevent Equilibra from removing hazards. Deoxys-S can use a Life Orb and pair excellently with Stratagem by cleaning teams after it wallbreaks. Stratagem cannot easily beat special walls such as Equilibra, Heatran, and Galarian Slowking, so Pokemon that can easily defeat these threats such as Great Tusk, Ogerpon-W, and Miasmaw make excellent teammates. Chuggalong can switch into priority for Stratagem, having an especially great matchup against Rillaboom. Iron Moth can also fill a similar role as Chuggalong for Stratagem, but while it lacks the ability to deal with priority, it applies more immediate pressure. Both Chuggalong and Iron Moth appreciate Stratagem's ability to switch into Ground-type moves for them and weaken their checks such as Equilibra, Arghonaut, and Ting-Lu.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652323, "username": "Anchor9"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Arghonaut": {
    "comments": "<h3>Other Options</h3> <p>A set consisting of Bulk Up / Knock Off / Circle Throw / Recover with an EV spread of 248 HP / 224 Def / 18 SpD / 12 Spe can be utilized to turn Arghonaut into a sort of setup sweeper that outspeeds uninvested Mollux, but not only does it loses the mirror even harder, but it also requires the team support Arghonaut would usually provide. Ice Punch can be run to hit Gliscor and Landorus-T, but the utility of Arghonaut's other moves makes it niche at best. Toxic can be used over Spikes if there's another setter on the team, but Venomicon remains a hard counter. Tera Poison is an option that allows Arghonaut to be immune to Toxic and resist Fairy, but keeping the Psychic weakness and obtaining a Ground weakness is not worth it. Finally, Covert Cloak allows Arghonaut to best Garganacl and become a more consistent switch-in to Heatran, Mollux, and Pecharunt, but provides very little otherwise.</p> <h3>Checks and Counters</h3> <p><strong>Fairy-types</strong>: Offensive Fairy-types such as Hemogoblin, Iron Valiant, Primarina, and Enamorus all threaten Arghonaut and have ways to deal with it even if it Terrastalizes. Defensive Fairy-types like Clefable and Cresceidon both can similarly force it out. Only Iron Valiant and Clefable want to switch into Knock Off, however.</p> <p><strong>Flying-types</strong>: Venomicon, Zapdos, Gliscor, and Tomohawk can all shrug off Arghonaut's attacks and threaten it with either a strong STAB move or their utility options. The former two do not appreciate losing their item and so can't mindlessly switch in, and Gliscor's Poison Heal must be activated before it can switch in freely. Skarmory can't immediately threaten Arghonaut but can phaze Arghonaut out with Whirlwind. Venomicon-E threatens huge damage even after Arghonaut Terastallizes.</p> <p><strong>Electric-types</strong>: Krilowatt, Caribolt, Raging Bolt, and Plasmanta can all hit Arghonaut super effectively, with Plasmanta even being able to beat it after Terastallizing. However, Arghonaut can take the others on after it Terastallizes into the Fairy-type, and Krilowatt is scared of switching into Arghonaut, as it gets crippled by Knock Off.</p> <p><strong>Grass-types</strong>: Ogerpon-W, Rillaboom, and Meowscarada all threaten to OHKO Arghonaut and can pivot out with U-turn on a predicted Tera Fairy. They also all can remove Arghonaut's item with their own Knock Off, making it easier to pick off by their teammates. Serperior threatens huge damage with Leaf Storm despite Arghonaut's Unaware and can even paralyze it with Glare.</p> <p><strong>Status</strong>: Gliscor, Snaelstrom, and Pecharunt can all badly poison Arghonaut, while Cresceidon, Gholdengo, and Zapdos can paralyze it through Thunder Wave or Static, making it significantly more passive. Similarly, Heatran, Rotom-W, Mollux, and Volcanion all threaten to burn it, making Arghonaut deal pitiful damage. All of the above also empower Hex users like Dragapult, Gholdengo, and the aforementioned Pecharunt.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Arghonaut is one of the best defensive pivots in CAP thanks to Unaware, strong defenses and a fantastic support movepool. Circle Throw phazes setup sweepers such as Darkrai, Miasmaw, and Stratagem. It also forces out Equilibra, the tier's premier spinner, making it easier to stack layers of Spikes. Knock Off threatens the Ghost-types that try to switch into Circle Throw such as Dragapult and Gholdengo and puts pressure on foes that rely on Heavy-Duty Boots to switch into entry hazards such as Venomicon and Dragonite. 248 HP and 224 Defense EVs with an Impish nature guarantee that Arghonaut survives +2 Miasmaw's five-hit Scale Shot and Kingambit's Tera Blast Fairy with five Supreme Overlord boosts. The remaining 36 EVs are put into Special Defense to better tank special attacks, allowing Arghonaut to survive Krilowatt's Surf and Thunderbolt combination, as well as avoiding being 2HKOed by its Tera Water-boosted Surf after Arghonaut has Terastallized. While Leftovers gives Arghonaut much-appreciated passive recovery, Heavy-Duty Boots can be run instead to ignore Spikes at the cost of being more reliant on Recover. Tera Fairy allows Arghonaut to completely change its defensive profile, letting it beat Hemogoblin and Iron Valiant while stopping Miasmaw's Scale Shot.</p> <p>Arghonaut fits best on balance and stall teams, checking most setup sweepers and gaining momentum through the combination of Circle Throw and Spikes. Stealth Rock setters such as Clefable, Venomicon, and Heatran can aid in stacking hazards. Venomicon in particular is a great partner, taking defensive pressure off Arghonaut by checking Fairy-types like Hemogoblin and Iron Valiant as well as offensive Grass-types like Ogerpon-W and Meowscarada. Bulky Ground-types such as Equilibra, Ting-Lu, and Gliscor can help against offensive Electric-types such as Krilowatt, Caribolt, and Raging Bolt. The former two also help check opposing Psychic-types, while Gliscor can act as a solid Knock Off switch-in once its Poison Heal has activated. Equilibra can also remove hazards with Rapid Spin to keep Leftovers Arghonaut as healthy as possible. Offensive pivots such as Dragapult, Krilowatt, and Rillaboom appreciate the Spikes support and item removal that Arghonaut provides.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 273339, "username": "Lasen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Kitsunoh": {"sets": {"Utility": {}}},
  "Cyclohm": {"sets": {"Physically Defensive": {}}},
  "Colossoil": {"sets": {"Flame Orb": {}}},
  "Krilowatt": {
    "comments": "<h3>Checks and Counters</h3> <p><strong>Knock Off</strong>: Since most of Krilowatt's offensive pressure is because of Life Orb, Pokemon that can remove it greatly cripple Krilowatt's offensive output. Pokemon such as Weavile and Iron Valiant outspeed Krilowatt and can remove its Life Orb with Knock Off while dealing tons of damage.</p> <p><strong>Water-immune Pokemon</strong>: Ogerpon-W can absorb Krilowatt's Surf, not only healing itself but also threatening an OHKO with Power Whip. Mollux and Clodsire can also absorb Surf, allowing them to either threaten heavy damage or set up Stealth Rock.</p> <p><strong>Offensive Grass-types</strong>: Pokemon like Meowscarada and Caribolt can outspeed Krilowatt and threaten to KO it using their strong Grass-type while taking Surf and Thunderbolt rather easily. However, they don't like taking an Ice Beam on the switch in. Rillaboom and Malaconda also give Krilowatt trouble, as they can take an Ice Beam, then either OHKO with Grassy Glide or cripple it with Knock Off, respectively.</p> <p><strong>Special Walls</strong>: Galarian Slowking can easily take Krilowatt's attacks and can deal decent damage with Sludge Bomb, set up Future Sight, or pivot out with Chilly Reception. Equilibra and Ting-Lu can also be a problem because they are immune to Volt Switch and can respond with Earth Power and Earthquake, respectively, but they don't like switching into a Surf.</p> <p><strong>Defensive Terastallization</strong>: Krilowatt relies heavily on threatening super effective damage, so Terastallization that can remove foes' weaknesses, like Tera Dragon Cresceidon and Tera Grass Heatran, can suddenly catch Krilowatt off guard, making these foes harder to deal with.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<h4>Set Details</h4> <p>Krilowatt functions as a good pivot with its good stats, great offensive typing, and exceptional ability in Magic Guard, which allows it to pivot constantly without fear of getting chipped down by entry hazards. Its STAB combination is also amazing in conjunction with Ice Beam, threatening a large portion of the metagame for super effective damage. Ice Beam covers Grass- and Dragon-types such as Caribolt, Rillaboom, Dragapult, Chuggalong, and Miasmaw. Tera Water sheds Krilowatt's weakness to Ground, allowing it to switch into Pokemon like Great Tusk and Ting-Lu without getting OHKOed. Tera Flying flips its Ground and Grass matchups completely, which can catch Pokemon like Ogerpon-W, Caribolt, and Rillaboom off guard.</p> <p>Krilowatt shines best on balance and bulky offense teams that can capitalize on it forcing out foes with its decent offensive presence and bringing in teammates safely using Volt Switch. Krilowatt should always be paired with a Knock Off absorber like Clefable or Gliscor, as most of its offensive presence is due to Life Orb, and both Clefable and Gliscor can provide entry hazards to chip down foes further. Gliscor specifically pairs well with Krilowatt, as it can help wear down Krilowatt's checks with Toxic. Pokemon that can set up Spikes, like the aforementioned Gliscor, Arghonaut, and Skarmory, are amazing teammates for Krilowatt, as its offensive coverage forces a lot of switching. Krilowatt pairs well with sweepers like Hemogoblin and Nasty Plot Gholdengo, as they take advantage of the free switch in  and chip damage that Krilowatt provides with Volt Switch, allowing them to break through their checks. Krilowatt is weak to Grass- and Ground-type attacks from foes like Meowscarada, Ogerpon-W, and Equilibra, so pairing it with Pokemon who can take on these threats such as Kyurem, Ogerpon-W, and Venomicon can really help keep Krilowatt healthy. Dragapult can deal huge damage to special walls like Galarian Slowking and Malaconda and can form a good VoltTurn core with Krilowatt. Krilowatt is a useful option on rain teams, as it can form a VoltTurn core with Pelipper, bringing in rain sweepers like Barraskewda and Raging Bolt in to deal massive damage to foes, as well as benefitting from rain boosting its own Surf.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 591294, "username": "Lightniong"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 221710, "username": "Da Pizza Man"}, {"user_id": 273339, "username": "Lasen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Voodoom": {"sets": {"Choice Specs Pivot": {}}},
  "Tomohawk": {"sets": {"Physical Wall": {}, "HazeHawk": {}}},
  "Necturna": {"sets": {"Protect + Leech Seed": {}, "Victory Dance": {}}},
  "Mollux": {
    "comments": "<h3>Other Options</h3> <p>Calm Mind can be used over Stealth Rock or Rapid Spin to ease the matchup against Substitute Iron Moth and Darkrai while turning Mollux into a potent late-game wincon once checks such as Heatran and Ting-Lu are removed; however, this takes away valuable utility. Thunder Wave can also be used as an option to cripple Chuggalong and unsuspecting physical threats such as Roaring Moon and Miasmaw looking for free setup, but Ground-types are immune to it and it makes Mollux even worse against them. Hydro Pump can be used when Mollux is employed on rain teams to threaten Ting-Lu and Garganacl, but the lack of accuracy can make Mollux more inconsistent, while the lack of PP worsens the matchup against balance teams.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types and Pokemon with Ground-type Coverage</strong>: Great Tusk, Landorus-T, Equilibra, and Gliscor greatly threaten Mollux with their Ground-type STAB moves. Pokemon such as Miasmaw and Roaring Moon can produce similar pressure with Ground-type coverage. Pokemon that Mollux usually checks consistently, such as Hemogoblin, Krilowatt, and Ogerpon-W, can run surprise Ground-type coverage to deal with Mollux.</p> <p><strong>Specially Defensive Pokemon</strong>: Garganacl and Heatran can switch into any move that Mollux can use and are both immune to the burns and poisons that it can threaten other checks with while threatening it with Salt Cure and Earth Power, respectively. Galarian Slowking and Ting-Lu have to worry a bit more about Lava Plume's burn chance, but they take little damage from Mollux and can freely set up Future Sight and Spikes against it, respectively.</p> <p><strong>Knock Off</strong>: Knock Off from Arghonaut and Ogerpon-W cripples Mollux by removing its Heavy-Duty Boots, leaving it extremely vulnerable to entry hazards and jeopardizing its ability to check threats such as Darkrai and Krilowatt.</p> <p><strong>Physical Attackers</strong>: Pokemon such as Roaring Moon, Dragonite, Miasmaw, and Jolly Kingambit can easily wallbreak past Mollux's weaker Defense stat with little risk. Mollux can discourage setup with Clear Smog but otherwise is greatly threatened.</p> <p><strong>Psychic-types</strong>: Deoxys-S can greatly threaten Mollux with Psycho Boost. Iron Crown can quickly wear Mollux down with Psychic Noise and deny recovery or easily 2HKO it with Psyshock. Weakness Policy sets can take advantage of Lava Plume and use Mollux to sweep.</p> <p><strong>Sun</strong>: While Mollux can be useful against sun teams thanks to its ability to threaten Malaconda with a boosted Lava Plume and annoy Walking Wake with its Water immunity, the HP loss from Dry Skin is crippling and severely cuts Mollux's ability to check threats such as Raging Bolt and Hemogoblin.</p>",
    "sets": {
      "Utility Wall": {
        "description": "<h4>Set Details</h4> <p>Mollux's typing combined with recovery and an excellent ability in Dry Skin allows it to be a premium check to a wide variety of threats such as Iron Valiant, Hemogoblin, and Ogerpon-W. Stealth Rock allows Mollux to be an entry hazard setter that discourages Equilibra from switching in to use Rapid Spin. Rapid Spin allows Mollux to serve as a spinner that threatens common spin-blockers like Gholdengo and Necturna. Clear Smog shuts down setup sweepers such as Chuggalong, Raging Bolt, and Hemogoblin. Alternatively, Sludge Bomb can be chosen instead, as the poison chance can cripple Ground-type switch-ins. In addition, the increased Base Power can force out Ogerpon-W. Tera Fairy allows Mollux to be useful against sun by pressuring Walking Wake with its immunities and improves its matchup against Kingambit and Dragapult. Tera Steel gives Mollux a Future Sight resistance, making it a useful switch-in against Galarian Slowking. In addition, it walls non-Flamethrower Chuggalong and resists Stored Power, allowing it to use Clear Smog in a pinch. Tera Flying allows Mollux to flip its matchup against Equilibra, grants an immunity to Spikes, and prevents Ogerpon-W from catching it off guard with Stomping Tantrum. The given EV spread allows Mollux to outspeed Adamant Kingambit and threaten it with a Lava Plume. The remaining EVs are invested in Special Defense to allow Mollux to better switch in against Krilowatt and Gholdengo.</p> <p>Mollux fits best on balance teams, where its role compression and ability to check a large number of threats are appreciated. Its 4x Ground weakness leaves it very vulnerable to threats such as Great Tusk and Gliscor, the latter of which also makes a good teammate thanks to its Ground immunity. Corviknight and Equilibra make excellent partners for similar reasons. In return, Mollux is a solid answer to Pokemon that threaten them such as Ogerpon-W and Walking Wake. Mollux's large weakness to entry hazards if Heavy-Duty Boots is Knocked Off can easily compromise its ability to serve as a spinner. Thus, either a secondary hazard remover such as Equilibra or Corviknight or a Knock Off switch-in such as Gliscor or Clefable is needed. Mollux cannot threaten Garganacl to any degree and is quickly worn down by Salt Cure or KOed by Earthquake. Thus, allies that can offensively pressure Garganacl such as Ogerpon-W and Gholdengo are appreciated. Mollux is unable to hit Heatran and is very vulnerable to being trapped by Magma Storm and KOed by Earth Power, so Pokemon that can threaten Heatran such as Cresceidon and Ogerpon-W are excellent allies. Mollux can struggle to check physical threats such as Roaring Moon and Miasmaw, so physical walls such as Cresceidon, Arghonaut, and Skarmory fit well as teammates. Arghonaut can also help Mollux deal with Chuggalong, specifically its Stored Power sets, which otherwise OHKO Mollux. Psychic-types such as Deoxys-S and Galarian Slowking greatly threaten Mollux. Pokemon that can check these foes such as Equilibra, Kingambit, and Ting-Lu make excellent teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652323, "username": "Anchor9"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 221710, "username": "Da Pizza Man"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Aurumoth": {"sets": {"Tail Glow": {}}},
  "Malaconda": {
    "comments": "<h3>Other Options</h3> <p>Grav Apple can be used to put pressure on Arghonaut and Cresceidon in order to force them to switch. However, due to Malaconda's relatively small damage output, Glare is usually more effective long-term. Sucker Punch can be run to surprise and KO threats. This is especially useful against Dragapult. However, the loss of utility or longevity makes the move niche. Malaconda can opt to invest EVs in Special Defense instead of Defense in order to switch into Galarian Slowking and Mollux more easily. However, this runs the risk of Malaconda getting OHKOed by U-turn from Dragapult and Landorus-T.</p> <h3>Checks and Counters</h3> <p><strong>U-turn</strong>: Malaconda's 4x weakness to Bug can be easily taken advantage of by Pokemon carrying U-turn such as Roaring Moon, Dragapult, and Landorus-T. This often forces Malaconda in awkward positions where it must sacrifice momentum to avoid being OHKOed.</p> <p><strong>Physical Attackers</strong>: Because of Malaconda's low physical bulk, it is easily taken advantage of by strong physical attackers such as Hemogoblin, Great Tusk, and Iron Valiant.</p> <p><strong>Knock Off</strong>: Pokemon such as Gliscor and Ogerpon-W can remove Malaconda's Heat Rock with Knock Off. The loss of Heat Rock greatly limits Walking Wake and Raging Bolt's wallbreaking potential and allows sun turns to more easily be stalled out by Equilibra and Gliscor with Protect.</p> <p><strong>Entry Hazards</strong>: Malaconda is vulnerable to all forms of hazards, often causing it to struggle to set up multiple instances of sun if hazards are down. However, Malaconda can mitigate this threat should it forgo Heat Rock for Heavy-Duty Boots.</p> <p><strong>Miasmaw</strong>: Miasmaw can act as an anti-lead against Malaconda by preventing sun with Neutralizing Gas and threatening to sweep on the spot, usually forcing Malaconda out.</p>",
    "sets": {
      "Sun Setter": {
        "description": "<h4>Set Details</h4> <p>With vast utility, the ability to pivot, and special bulk, Malaconda cements itself as the best Drought user in the tier. Knock Off allows Malaconda to threaten Galarian Slowking and punish potential switch-ins such as Venomicon, Great Tusk, and Hemogoblin with item removal. As Malaconda is often the best switch-in to Dragapult, Knock Off gives Malaconda a way to meaningfully threaten it. In addition, Knock Off heavily deters Galarian Slowking from switching in to change the weather with Chilly Reception. Parting Shot provides essential slow pivoting to safely bring an ally in while weakening the opposing Pokemon's offenses. This makes setting up for sweepers such as Raging Bolt and Chuggalong much easier. Malaconda's last two moveslots are extremely flexible. Glare shuts down setup sweepers such as Chuggalong, Ogerpon-W, Darkrai, and Roaring Moon while crippling Cresceidon. Rapid Spin allows Malaconda to remove entry hazards for its team. This helps allies such as Raging Bolt and Chuggalong set up. Synthesis can be used instead to provide Malaconda longevity, preventing Galarian Slowking from quickly wearing it out while resetting weather. Tera Fairy allows Malaconda to shed its massive weakness to U-turn and pivot against threats such as Dragapult and Roaring Moon. Tera Water prevents Fire-types such as Iron Moth and Heatran from forcing Malaconda out while allowing it to use Glare on Iron Moth and Chuggalong in a pinch. Heat Rock is the preferred item, as it extends sun's duration, allowing Malaconda's teammates to wallbreak more easily. Heavy-Duty Boots can be used instead to increase Malaconda's longevity by ignoring hazards, allowing it to switch in against Galarian Slowking and Krilowatt more consistently.</p> <p>Malaconda's sun-setting ability enables a plethora of excellent teammates such as Walking Wake, Raging Bolt, and Roaring Moon. Walking Wake is synonymous with sun, as its sun-boosted Hydro Steam is able to decimate walls such as Galarian Slowking and Equilibra. Raging Bolt pairs well as a teammate thanks to its ability to easily break through Malaconda's checks such as Mollux and Venomicon. Raging Bolt also has a good matchup against Arghonaut and rain, which sun teams can struggle against. Choice Band Roaring Moon can slot excellently with Malaconda, as it easily pressures threats that check Malaconda such as Galarian Slowking and Mollux while providing excellent speed control with Protosynthesis's Speed boost. Sun structures are extremely vulnerable to threats such as Roaring Moon and Great Tusk, so Hemogoblin is an excellent revenge killer for these threats. In addition, Hemogoblin appreciates its Flare Blitz getting boosted by sun. Hemogoblin itself is a large threat against Malaconda. Therefore, Venomicon and Chuggalong are excellent allies. Great Tusk can slot in as a secondary spinner and a potential wincon with Bulk Up. With Protosynthesis's Speed boost, it is able to revenge kill threats such as Darkrai, while Protosynthesis's Defense boost allows it to counter Kingambit. Heatran is another possible teammate and can provide excellent value by trapping threats such as Arghonaut and Cresceidon with Magma Storm and removing them with Solar Beam. Hatterene is also a good fit, as it provides entry hazard control and Healing Wish support. Both of these qualities increases Malaconda's longevity, allowing it to be used more aggressively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652323, "username": "Anchor9"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 221710, "username": "Da Pizza Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Cawmodore": {"sets": {"Belly Drum": {}}},
  "Volkraken": {"sets": {"Choiced Wallbreaker": {}}},
  "Plasmanta": {"sets": {"Rain Wallbreaker": {}}},
  "Naviathan": {"sets": {"Dragon Dance": {}}},
  "Crucibelle": {"sets": {"Utility Pivot": {}}},
  "Kerfluffle": {"sets": {"Valiant At Home": {}}},
  "Pajantom": {"sets": {"Choice Band": {}}},
  "Jumbao": {
    "outdated": true,
    "comments": "<h4>Checks and Counters</h4> <p><strong>Fire-types</strong>: Jumbao has nothing in its arsenal to meaningfully damage Fire-types such as Skeledirge, Volcarona, Iron Moth, and Ceruledge, all of which can take advantage of it by setting up or firing off a powerful attack. While Cinderace has to be more wary of repeated hits, it can switch into Jumbao at least once with relative impunity and force it out.</p> <p><strong>Poison-types</strong>: Amoonguss switches into Jumbao relatively well and can use Spore as it is forced out but must watch out for Tera Blast Fire. Toxapex, Clodsire, and Venomicon can wall Jumbao and use it as an opportunity to set entry hazards or force progress with Toxic or Knock Off. Venomicon-E outspeeds Jumbao and can take at least one hit and OHKO back with Gunk Shot or Brave Bird.</p> <p><strong>Steel-types</strong>: Steel-types such as Corviknight, Gholdengo, and Bulletproof Equilibra can wall and KO Jumbao with their STAB attacks, but they take significant damage from Tera Blast Fire if Jumbao Terastallizes.</p> <p><strong>Faster Pokemon</strong>: If Jumbao does not hold a Choice Scarf, it is vulnerable to faster attackers with super effective coverage such as Greninja, Dragapult, and Stratagem.</p>",
    "sets": {
      "Drought Wallbreaker": {
        "description": "<h5>Set Details</h5> <p>Jumbao is one of the best Pokemon in the metagame thanks to its excellent offensive stats, defensive utility, and incredible ability in Drought, which enables a host of powerful offensive partners. Tera Blast Fire pressures the Steel- and Poison-types that resist Jumbao's STAB combination, such as Gholdengo, Corviknight, and Venomicon. Alternatively, if Jumbao is paired with teammates that rely on Terastallizing, Focus Blast can be used to retain the OHKO on Kingambit. Synthesis lets Jumbao continuously keep sun up with Heat Rock and outlast Pokemon such as Great Tusk and Roaring Moon. Tera Fire allows Jumbao to take advantage of Tera Blast Fire's coverage and improves its matchup against Steel-types such as Scizor and Gholdengo by removing its Steel weakness.</p> <p>Jumbao can fit comfortably on a variety of playstyles from bulky offense to balance thanks to the team support it provides through Drought. Fire-types such as Skeledirge, Cinderace, Ceruledge, and Iron Moth and Protosynthesis users such as Roaring Moon, Sandy Shocks, and Great Tusk are Jumbao's best offensive partners, as they all become extremely dangerous under sun. Since Jumbao is incredibly vulnerable to opposing Fire-types, defensive Pokemon that can handle them, such as Toxapex, Arghonaut, Ting-Lu, and Garganacl, are excellent partners. The latter three can also set entry hazards to help Jumbao wallbreak, while Toxapex can handle opposing Jumbao and Glimmora. Toxapex and Hatterene can create momentum for sun teams with Eject Button, the latter of which also keeps entry hazards off the field for Fire-type teammates. Bulky Steel-types such as Corviknight and Equilibra can check Poison-types that Jumbao struggles to break such as Amoonguss and Venomicon and appreciate Jumbao handling their checks, such as Krilowatt and Great Tusk.</p>"
      },
      "Choice Scarf": {
        "description": "<h5>Set Details</h5> <p>Choice Scarf Jumbao picks off normally faster threats such as Dragapult, Iron Valiant, and Krilowatt and supports offensive teammates with Healing Wish. Drought allows Jumbao to use Solar Beam quicker and provide sun support for teammates such as Great Tusk and Cinderace. Trace, on the other hand, allows Jumbao to copy valuable abilities such as Toxapex's Regenerator and Venomicon-E's Tinted Lens; however, it requires Jumbao to run Leaf Storm to retain a powerful Grass-type STAB move because of Solar Beam's two-turn wait outside of sun. Tera Fire with Tera Blast grants Jumbao coverage to hit Steel-types such as Corviknight and Gholdengo and resistances to key attacks such as Gholdengo's Make It Rain, Iron Valiant's Moonblast, and Baxcalibur's Ice Shard. Focus Blast, on the other hand, lets Jumbao OHKO Kingambit without Terastallizing.</p> <p>Choice Scarf Jumbao is a strong asset to bulky offense teams, providing them with speed control and incredibly useful Healing Wish support. Defensive pivots that lack reliable recovery, such as Great Tusk, Ting-Lu, Equilibra, and Rotom-W, benefit immensely from Jumbao's ability to bring them back to full health late in the game, which gives them the freedom to take more hits early on. These Pokemon can also handle the Steel- and Fire-types that can take Jumbao's STAB attacks, such as Cinderace, Gholdengo, and Iron Moth. Pivots like Rotom-W, Corviknight, and Cinderace can bring Jumbao in safely against Pokemon it threatens, such as Krilowatt and Hydreigon. Bulky setup sweepers such as Hatterene and Kingambit can break down teams for Jumbao to clean late-game and greatly appreciate Jumbao giving them a second chance to sweep with Healing Wish. Poison-types such as Toxapex, Venomicon, and Clodsire wall Jumbao, so wallbreakers that can threaten them, such as Dragapult, Baxcalibur, and Smokomodo, are good teammates. Lastly, if Jumbao opts to use Drought, it can set sun to support Fire-types such as Skeledirge and Iron Moth and Protosynthesis users such as Great Tusk and Roaring Moon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537558, "username": "memesketch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 221710, "username": "Da Pizza Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 467437, "username": "Dawn of Ares"}]}]}
  },
  "Caribolt": {
    "outdated": true,
    "comments": "<h4>Checks and Counters</h4> <p><strong>Grass-types</strong>: Grass-types like Jumbao, Pyroak, and Amoonguss wall Caribolt's STAB combination, forcing it out.</p> <p><strong>Faster Attackers</strong>: Before Caribolt uses Rapid Spin, Pokemon like Cinderace and Ice Beam Greninja can outspeed and OHKO it. Fast Dragon-types like Dragapult, Roaring Moon, and Astrolotl can switch in to check Caribolt once, but they cannot do so if Caribolt reaches both +1 Speed and +2 Attack.</p> <p><strong>Strong Priority Attacks</strong>: Strong priority attacks from Kingambit, Dragonite, and Revenankh can circumvent Caribolt's Speed boosts and KO it after it has taken some chip damage from Double-Edge.</p>",
    "sets": {
      "talahbolt (Swords Dance)": {
        "description": "<h5>Set Details</h5> <p>Caribolt is a nuclear wallbreaker for offensive teams. Double-Edge with Galvanize can break through even the tier's most stalwart walls, 2HKOing Pokemon like Skeledirge and Garganacl with ease, especially once Caribolt Terastallizes. Horn Leech provides some modicum of recovery to compensate for Double-Edge's recoil. Rapid Spin both increases Caribolt's Speed, giving it sweeping potential, and supports teammates weak to Stealth Rock like Baxcalibur and Iron Moth, allowing them to forego Heavy-Duty Boots. Leftovers helps make up for Double-Edge's recoil alongside Horn Leech, while Magnet powers up Caribolt's Electric-type attacks even further. A Jolly nature is preferred to outspeed Choice Scarf Jumbao at +1 Speed and Krilowatt at +0, but Adamant is an option to deal as much damage as possible, supporting its hyper offense teammates. Tera Grass is an option to turn Ground-types like Equilibra and Great Tusk into setup fodder, but Caribolt's main focus should be on wallbreaking as much as possible for its teammates.</p> <p>Caribolt is best utilized on hyper offense teams, which appreciate its incredible wallbreaking ability. Stealth Rock-weak Pokemon like Iron Moth, Baxcalibur, and Venomicon-E appreciate Caribolt removing the hazard, allowing Iron Moth and Baxcalibur to run more offensive items over Heavy-Duty Boots. Other physical sweepers like Dragon Dance Roaring Moon and Dragonite love Caribolt powering through Unaware walls like Skeledirge and Arghonaut; Roaring Moon pairs particularly well with Caribolt, as it can threaten the Grass-types like Jumbao and Amoonguss that give Caribolt trouble with Tera Flying + Acrobatics. This love is shared by special sweepers like Iron Valiant and Hatterene, which need Skeledirge off the table before attempting a sweep. Caribolt appreciates entry hazards weakening physically bulky Ground-types like Great Tusk and Ting-Lu—which can beat Caribolt if it Terastallizes—into KO range of its attacks, so pairing it with a dedicated lead like Greninja or Meowscarada is suggested.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 277988, "username": "dex"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 227784, "username": "snake"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Smokomodo": {"sets": {"Bone Zone": {}}},
  "Snaelstrom": {
    "comments": "<h3>Other Options</h3> <p>Snaelstrom can use Infestation to lock in Pokemon and deal consistent chip damage, which pairs well with Spiky Shield or Toxic. However, this set is walled and easily taken advantage of by Galarian Slowking or Clefable, and it lacks the utility that often justifies Snaelstrom's slot on teams. Snaelstrom can also use Sticky Web, though Ribombee and Araquanid are more suited to the fast-paced nature of Sticky Web teams.</p> <h3>Checks and Counters</h3> <p><strong>Stealth Rock</strong>: Snaelstrom's inability to hold Heavy-Duty Boots leaves it vulnerable to hazards, hampering its ability to consistently switch in and absorb attacks for its teammates. It is especially susceptible to Stealth Rock due to its Rock weakness.</p> <p><strong>Electric-types</strong>: Strong Electric-type Pokemon like Raging Bolt, Zapdos, and Caribolt can outspeed Snaelstrom and threaten it with super effective attacks. However, they must be wary of a potential boosted Tera Normal Facade.</p> <p><strong>Flying-types</strong>: Strong Flying-type Pokemon such as the aforementioned Zapdos, Moltres, Venomicon-E, or Venomicon with Hurricane can deal significant damage to Snaelstrom. However, Hurricane is a less common option on many defensive Flying-type Pokemon, such as the aforementioned Moltres and Venomicon.</p> <p><strong>Neutralizing Gas</strong>: Neutralizing Gas from Pokemon such as Miasmaw and Galarian Weezing disable Snaelstrom's Poison Heal ability, making it take damage from its self-inflicted poison instead. This is especially dangerous if Snaelstrom has stayed in for a high number of turns.</p> <p><strong>Galarian Slowking</strong>: Galarian Slowking is immune to Toxic, takes minimal damage from Surf, and takes advantage of Snaelstrom to set up Future Sight and pivot into its teammates. It also underspeeds Snaelstrom, allowing it to pivot in an appropriate answer if Snaelstrom opts to use U-turn.</p> <p><strong>Kyurem</strong>: Kyurem resists Snaelstrom's Water-type moves while threatening it with a powerful super effective Freeze-Dry. However, Kyurem has to be wary of Terastallization, as this can remove Snaelstrom's weakness to Freeze-Dry, and Kyurem does not appreciate taking Tera Normal Facade.</p>",
    "sets": {
      "Bulky Swords Dance": {
        "description": "<h4>Set Details</h4> <p>Snaelstrom can act as a bulky physical sweeper with Swords Dance that punishes passive or status-reliant Pokemon such as Clefable, Cresceidon, and Toxic Gliscor. Poison Heal combined with Toxic Orb gives Snaelstrom powerful passive recovery and immunity to other status, which allows it to break past the aforementioned Pokemon that rely on status to stop sweepers. Swords Dance allows Snaelstrom to leverage its bulk and status immunity to boost its modest Attack to threatening levels. Razor Shell allows Snaelstrom to effectively wallbreak due to its 50% chance to lower the foe's defense. However, Liquidation can be used for more immediate power and accuracy. Toxic chips down Unaware Pokemon such as Arghonaut, as well as crippling Pokemon that want to set up alongside Snaelstrom such as Zamazenta and Hemogoblin. Alternatively, Facade threatens Pokemon who resist or are immune to Snaelstrom's Water STAB moves, such as Kyurem, Dragonite, Ogerpon-W, and Mollux. Spiky Shield guarantees Toxic Orb activation and allows Snaelstrom to scout Choice-locked Pokemon, while Recover allows it to better take advantage of weaker attacks and forced switches. Tera Water boosts Snaelstrom's Water-type moves, while Tera Normal boosts Facade's already impressive damage and gives Snaelstrom an immunity to Hex. Alternatively, Tera Fairy is a generically strong defensive typing that allows Snaelstrom to muscle past Pokemon that can hit it super effectively.</p> <p>Swords Dance Snaelstrom is primarily used on balance teams as a late-game wincon. Snaelstrom's ability to threaten common defensive Pokemon like Gliscor and Equilibra makes it a great partner for Shox and Galarian Slowking, which are walled by the aforementioned Pokemon. Snaelstrom also appreciates Ground-type teammates such as Gliscor, Equilibra, Great Tusk, and Ting-Lu, which can take on Electric-type attacks that threaten it. Pairing Snaelstrom with entry hazard removal options like Mollux, Equilibra, or Great Tusk allows it to switch in more freely throughout a battle to make progress. Pokemon such as Landorus-T, Great Tusk, Arghonaut, and Gliscor can provide entry hazards and Knock Off to wear down Pokemon such as Arghonaut and Mollux, which might otherwise halt a Snaelstrom sweep.</p>"
      },
      "Bulky Pivot": {
        "description": "<h4>Set Details</h4> <p>Snaelstrom can act as a bulky utility Pokemon or slow pivot that punishes passive or status-reliant Pokemon such as Clefable, Cresceidon, and Toxic Gliscor. Poison Heal combined with Toxic Orb gives Snaelstrom powerful passive recovery and an immunity to other status, which allows it to freely switch into the aforementioned Pokemon. Additionally, after the initial Toxic Orb activation, Snaelstrom no longer requires its item, allowing it to switch into Pokemon such as Arghonaut, Gliscor, and Great Tusk and absorb Knock Off. The default EV spread maximizes special bulk, which complements Snaelstrom's naturally impressive physical bulk, and allows it to pivot into common meta metagame threats such as Cresceidon, Equilibra, and Darkrai. Alternatively, Snaelstrom can fully invest in Defense, improving its matchup against common Knock Off users like Great Tusk, Hisuian Samurott, and Ogerpon-W; however, this comes at the cost of taking more damage from Cresceidon, Galarian Slowking, and Darkrai, which Snaelstrom otherwise freely switches into. Surf allows Snaelstrom to pressure common Ground-types like Gliscor, Great Tusk, and Equilibra. Toxic lets Snaelstrom punish Pokemon that try to set up on it, while U-turn allows it to act as a slow pivot and gain momentum.</p> <p>Pokemon such as Cresceidon, Kitsunoh, and Equilibra appreciate Snaelstrom's ability to switch into Knock Off once its Toxic Orb has activated. Similarly, status-weak Pokemon such as Great Tusk, Zamazenta, and Dragapult appreciate Snaelstrom's ability to easily switch into status moves. Snaelstrom's resistances make it a good partner for Ground-types such as Gliscor, Equilibra, Great Tusk, and Ting-Lu. Equilibra and Great Tusk are especially great teammates for Snaelstrom due to their ability to remove entry hazards and immunity to Electric-type attacks, which threaten Snaelstrom. Snaelstrom is also a very effective counter to Equilibra, making it a good teammate for Raging Bolt and Galarian Slowking, which are walled by Equilibra. Skeledirge and Arghonaut can handle setup attackers such as Dragonite, Ogerpon-W, and Zamazenta that can muscle past Snaelstrom's natural bulk thanks to Unaware.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 203741, "username": "Spammernoob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 604741, "username": "kenn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Equilibra": {
    "comments": "<h3>Other Options</h3> <p>If using Equilibra on a more offensive team where longevity is less of a priority, it can run an EV spread of 252 HP / 40 SpA / 216 Spe with a Modest nature to outspeed Adamant Hemogoblin and Kingambit, and it can run moves like Healing Wish and Aura Sphere instead of Pain Split to better support its team. It can also run an EV spread of 52 HP / 52 Def / 112 SpA / 40 SpD / 52 Spe with a Modest nature if offensive prowess is preferred over Speed or raw bulk. This spread lets Equilibra avoid the OHKO from Hemogoblin's Flare Blitz and Walking Wake's Hydro Steam out of sun, lets it outspeed Skeledirge, and invests heavily in Special Attack for incredibly powerful Doom Desires. Bulletproof can be run to hard wall every Gholdengo set and, in conjunction with Tera Fairy, also wall Darkrai and Chuggalong.</p> <h3>Checks and Counters</h3> <p><strong>Bulky Flying-types</strong>: Pokemon like Venomicon, Skarmory, Moltres, Zapdos, and Corviknight can all take Equilibra's hits well and retaliate with super efective moves.</p> <p><strong>Item Removal</strong>: Leftovers are essential for Equilibra if it wants to be kept healthy on a match. Knock Off from the likes of Gliscor, Arghonaut, and Clefable as well as Trick from Choice Scarf Gholdengo can make it way harder for it to stay healthy and would make it have to rely on Pain Split for healing.</p> <p><strong>Bulky Water-types</strong>: Pokemon like Arghonaut, Rotom-W, Cresceidon, and Primarina can tank Equilibra's attacks then hit back with super effective STAB moves.</p> <p><strong>Offensive Grass-types</strong>: Rillaboom, Ogerpon-W, and Serperior can sponge Equilibra's hits then strike back with their powerful STAB attacks. The former two can threaten an OHKO with Ivy Cudgel and Wood Hammer, with Ogerpon-W being an especially notable check, since it resists both of Equilibra's STAB attacks.</p> <p><strong>Physical Wallbreakers</strong>: Miasmaw, Zamazenta, and Gouging Fire can all heavily damage Equilibra, as they outpace Equilibra, target its weaker Defense stat, and can hit it super effectively. Greak Tusk can also heavily damage Equilibra while having the option to use Knock Off as a neutral option to remove Equilibra's Leftovers if it stays in or any switch-in's item.</p>",
    "sets": {
      "Defensive Spinner": {
        "description": "<p>Between its amazing defensive typing, high special bulk, and great matchups against common Ghost-types like Gholdengo and Dragapult, Equilibra is one of CAP's most reliable defensive pivots and entry hazard removal options. It fits primarily on balance teams, using its powerful Doom Desire to enable teammates and force checkmate scenarios where it can guarantee damage or a KO. Equilibra makes great use of Leftovers thanks to its many immunities and resilience to hazards, as with its immunity to Spikes, Toxic Spikes, and Sticky Web and 4x resistance to Stealth Rock, Heavy-Duty Boots is completely unnecessary. Pain Split maximizes Equilibra's recovery, which is useful to extend its longevity against bulkier teams; however, Protect can be used instead in order to maximize recovery from Leftovers, stall Doom Desire turns, scout Choice-locked foes and foes attempting to Tera, and block checkmate attempts done with opposing Doom Desire or Future Sight at the cost of leaving Equilibra without recovery if it loses its item. Flash Cannon can be used over Doom Desire if it needs to immediately pressure foes like Iron Valiant, Air Balloon Gholdengo, Enamorus, Gliscor, Rillaboom, and Hatterene. Maximum special bulk allows Equilibra to sponge powerful STAB attacks from special wallbreakers like Dragapult, Kyurem, and Darkrai and avoid being OHKOed by Focus Blast from +2 Gholdengo. Tera Water lets Equilibra take on Water- and Fire-type moves that would otherwise threaten it, whereas Tera Dragon is an alternative that offers a better matchup against Grass- and Electric-type foes like Caribolt and Krilowatt at the cost of a less useful defensive typing as a whole.</p> <p>Cresceidon appreciates Equilibra's ability to take on threatening Poison-types like Galarian Slowking and Chuggalong and to remove entry hazards if Cresceidon loses its Heavy-Duty Boots; in return, Cresceidon deals with strong Fighting-, Fire-, and Water-type wallbreakers that threaten Equilibra like Great Tusk, Gouging Fire, and Walking Wake. Arghonaut is another bulky Water-type that checks powerful physical wallbreakers like Zamazenta and Cinderace, can absorb Knock Off, and appreciates Equilibra checking Gliscor and keeping the field clear of hazards. Wallbreakers like Kyurem, Dragapult, and Ogerpon-W pair well with Equilibra, as the pressure it provides with Doom Desire is very valuable. Venomicon and Equilibra cover each other's weaknesess very well, as Venomicon can switch into the physical wallbreakers like Rillaboom, Hemogoblin, and Ogerpon-W that Equilibra fears, while Equilibra tanks the hits of the special wallbreakers like Stratagem and Kyurem that Venomicon can't take on.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 566431, "username": "Gaboswampert"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 251944, "username": "spoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Astrolotl": {"sets": {"Offensive Utility": {}}},
  "Miasmaw": {
    "comments": "<h3>Other Options</h3> <p>Heavy-Duty Boots can be used over Loaded Dice on teams without much entry hazard control, as it alleviates Miasmaw's weakness to hazards, but it makes Scale Shot far less consistent at dealing damage. Fire Fang is a usable alternative to Tera Blast Fire that gives Miasmaw access to Fire-type coverage without Terastallizing, but it is generally not recommended, as it deals significantly less damage. First Impression allows Miasmaw to double as a revenge killer, but it requires Miasmaw to give up valuable coverage and does next to nothing to help it perform its primary role as a sweeper.</p> <h3>Checks and Counters</h3> <p><strong>Entry Hazards</strong>: Miasmaw's typing leaves it very vulnerable to all forms of entry hazards, which, in conjunction with its low physical bulk, greatly limit the number of opportunities it gets to set up.</p> <p><strong>Skarmory and Corviknight</strong>: Unless Miasmaw is running Tera Blast Fire, it is countered by Skarmory and Corviknight, as they resist Scale Shot, are immune to Miasmaw's other coverage moves, and can offset any boosts Miasmaw gains from Swords Dance by using Iron Defense. However, these Pokemon take massive damage from the aforementioned Tera Blast Fire.</p> <p><strong>Revenge Killers</strong>: If Miasmaw is unable to land a Scale Shot, its middling Speed leaves it very vulnerable to getting revenge killed by faster Pokemon such as Weavile and Dragapult. Even after using Scale Shot, Miasmaw must still be wary of Life Orb Deoxys-S, as it outspeeds and OHKOes Miasmaw with Psycho Boost after Stealth Rock damage. Similarly, Choice Scarf users such as Darkrai and Enamorus can take care of Miasmaw with Ice Beam and Moonblast, respectively, though the former requires that Miasmaw has taken prior damage, and the latter is not a common Pokemon in the tier.</p> <p><strong>Priority</strong>: As Miasmaw is quite frail on the physical side, especially after having its Defense dropped from repeated uses of Scale Shot, it is extremely vulnerable to Sucker Punch from the likes of Kingambit and Hisuian Samurott. Similarly, Extreme Speed users such as Dragonite and Hemogoblin are perfectly capable of revenge killing Miasmaw, but this measure may prove ineffective should Miasmaw Terastallize into a Ghost-type.</p> <p><strong>Physically Bulky Pokemon</strong>: Dondozo, despite having Unaware shut off by Neutralizing Gas, serves as a perfectly serviceable check for Miasmaw, as it takes minimal damage from Scale Shot and OHKOes Miasmaw in return with Avalanche. Arghonaut can switch in when Miasmaw sets up and forces it out with Circle Throw or cripples it with Knock Off. In a similar vein, Great Tusk usually avoids the OHKO from +2 Scale Shot and can easily finish Miasmaw off with Ice Spinner. Zamazenta takes little damage from Miasmaw's attacks after a boost from Iron Defense and deals significant damage with Heavy Slam or forces it out with Roar. However, these Pokemon need to be relatively healthy to safely deal with Miasmaw.</p> <p><strong>Fast Status Spreaders</strong>: Cresceidon can switch in on the turn Miasmaw uses Swords Dance or Scale Shot and cripples it with Thunder Wave or Encore, or it can deal a large amount of damage with Moonblast, but it cannot deal with Miasmaw after it has set up, as it is OHKOed by +2 Gunk Shot. Dragapult can severely limit Miasmaw's effectiveness as a sweeper with Thunder Wave or Will-O-Wisp, or it can outright OHKO it with Dragon Darts. However, Dragapult cannot switch in directly, and it is unable to check Miasmaw at +1 Speed, since it is torn to shreds by Scale Shot.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h4>Set Details</h4> <p>Miasmaw is a deadly physical sweeper, and it owes its success to its sky-high Attack stat, access to Scale Shot, and incredibly powerful ability in Neutralizing Gas. Together, these qualities allow it to circumvent common counterplay for sweepers such as Arghonaut and Pixilate Extreme Speed from Hemogoblin and allow it to easily decimate weakened teams after a single Swords Dance boost. Earthquake serves as Miasmaw's main coverage move, hitting Steel-types that would otherwise take little damage from Scale Shot such as Equilibra, Heatran, and Kingambit. Gunk Shot is the preferred option for the last moveslot, as it allows Miasmaw to dispatch otherwise bothersome Fairy-types such as Cresceidon, Iron Valiant, and Clefable that would attempt to block Scale Shot. However, if Miasmaw is backed by teammates that can deal with these Pokemon, it can instead choose to run Substitute to protect itself from priority moves and harmful status conditions. When used alongside Tera Ghost, it can also generate opportunities to turn Extreme Speed users such as Hemogoblin and Dragonite into setup fodder. Tera Blast can be run alongside Tera Fire to provide coverage against Skarmory and Corviknight, both of which Miasmaw otherwise struggles against. Loaded Dice is generally recommended to ensure that Scale Shot deals consistently strong damage. Tera Ghost prevents Miasmaw from being revenge killed by Extreme Speed from the likes of Hemogoblin and Dragonite while also allowing it to serve as a situational spinblocker. Alternatively, Tera Poison improves Miasmaw's matchups against Fairy-types by patching up its Fairy weakness and strengthening Gunk Shot, notably allowing it to OHKO Cresceidon and Clefable prior to using Swords Dance.</p> <p>Miasmaw finds itself at home on hyper offense teams. Its typing leaves it extremely vulnerable to entry hazards, so running it alongside hazard control such as Caribolt, Great Tusk, or Hatterene is mandatory. Miasmaw struggles to break through Skarmory and Corviknight if it does not have access to Tera Blast Fire, so it appreciates being paired with a Fire-type that can take advantage of these Pokemon such as Iron Moth or Hemogoblin. Other strong Dragon-type sweepers such as Dragonite and Garchomp work well with Miasmaw, as not only do they help wear down each other's checks, but they also heavily appreciate Miasmaw's ability to deal with Hemogoblin, which would otherwise stop these Pokemon dead in their tracks as they take massive damage from Pixilate Extreme Speed. Miasmaw's physical frailty and weakness to hazards mean that it may have trouble finding ample opportunities to set up during a game, and, as a result, it is a good idea to pair it alongside a Pokemon that can set dual screens or Aurora Veil, such as Alolan Ninetales or Deoxys-S. Special wallbreakers such as Stratagem, Chuggalong, and Deoxys-S pair well with Miasmaw, as they can deal with many of the physically bulky Pokemon that may give Miasmaw trouble; in return, Miasmaw demolishes any special walls that would otherwise prevent them from making progress. Finally, Miasmaw gets good value from Spikes to help wear down physical walls, so Pokemon that can set Spikes such as Hisuian Samurott, Deoxys-S, and Glimmora naturally make for good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 221710, "username": "Da Pizza Man"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Chromera": {"sets": {"Calm Mind": {}, "Final Gambit": {}}},
  "Venomicon": {
    "comments": "<h3>Other Options</h3> <p>On defensive sets, U-turn can be used over Stealth Rock or Body Press to allow Venomicon to slowly pivot in frail wallbreakers such as Weavile, Miasmaw, and Deoxys-S on more offensively inclined teams. It also allows it to keep up momentum on sun teams. Tera Fairy allows Venomicon to tank a boosted Knock Off from Roaring Moon, heal off the damage with Roost, and wall Roaring Moon. Tera Steel, however, can surprise Stratagem and KO it with Body Press while also easing the pressure from opposing Future Sights and Doom Desires.</p> <h3>Checks and Counters</h3> <p><strong>Gholdengo and Kitsunoh</strong>: These two are the biggest nuisance for Venomicon, as they resist Hurricane, are immune to Sludge Bomb and Body Press, and are somewhat unbothered by Knock Off. They can both annoy Venomicon by setting up on it in Gholdengo's case or getting rid of its Heavy-Duty Boots in Kitsunoh's case.</p> <p><strong>Special Walls</strong>: Special walls such as Galarian Slowking and Mollux can easily switch into Venomicon and cripple it with Thunder Wave. However, both dislike Knock Off. Garganacl also gives Venomicon trouble due to Salt Cure not only being super effective but also wearing it down over time.</p> <p><strong>Psychic-types</strong>: Deoxys-S and Galarian Slowking can easily threaten Venomicon with their STAB. Iron Crown can also give Venomicon a hard time with Psychic Noise preventing Roost while also being immune to Sludge Bomb and resisting Hurricane.</p> <p><strong>Electric-types</strong>: Raging Bolt and Plasmanta both not only have super effective STAB attacks against Venomicon but are bulky enough to take any unboosted hit Venomicon has to offer. Krilowatt fears Knock Off, as it would lose a good chunk of its power, but if it comes in on any other move, it threatens Venomicon out easily.</p> <p><strong>Kyurem</strong>: Kyurem can threaten Venomicon out with a powerful Ice-type STAB move. However, it does have to worry about Body Press, especially if Venomicon Terastallizes.</p> <p><strong>Knock Off</strong>: Venomicon weak to Stealth Rock makes losing its Heavy-Duty Boots a bad situation, as it wants to stay as healthy as possible. This means Venomicon struggles with checking Pokemon it should that can commonly carry Knock Off such as Arghonaut and Great Tusk.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<h4>Set Details</h4> <p>Venomicon's great typing, solid defensive stats, and powerful ability in Stamina make it one of the metagame's premiere defensive Pokemon. Sludge Bomb allows Venomicon to check Fairy-types such as Hemogoblin, Iron Valiant, and Cresceidon and poison potential switch-ins such as Zapdos and Dragapult. However, Hurricane can help check Fighting-types such as Revenankh and Arghonaut while also hitting Chuggalong neutrally. Body Press hits Steel-types such as Equilibra and Kingambit while also synergizing greatly with Stamina. Stealth Rock is a fantastic choice for the last slot, allowing Venomicon to compress roles within itself even further. That being said, Knock Off is an alternative, should Stealth Rock already be present on another team member. 152 Defense EVs allow Venomicon to OHKO Speed Booster Energy Roaring Moon with Body Press after Stealth Rock damage, with the rest going into Special Defense to cover its weaker defensive stat. Tera Water allows Venomicon to check sun teams, have an easier time versus Heatran, tanks an Ice Beam from Kyurem, and helps Venomicon tank Doom Desire for its teammates. Tera Dragon also helps Venomicon check sun teams and allows it to handle Ogerpon-W. Tera Fighting deserve a mention mainly to nail Kingambit with Body Press, and it also provides a valuable resistance to Stealth Rock, which can be useful should Venomicon lose its Heavy-Duty Boots.</p> <p>Steel-types such as Equilibra and Kingambit appreciate Venomicon's ability to shut down Fighting- and Ground-types such as Great Tusk, Zamazenta, and Landorus-T. In return, they check Gholdengo and Kitsunoh, which can take anything Venomicon throws at them, and Equilibra can provide entry hazard removal should Venomicon lose its Heavy-Duty Boots. Psychic-types such as Deoxys-S and Galarian Slowking can be a pain as well, so Dark-types like Darkrai and Kingambit can be effective at threatening them and absorbing Future Sight. Knock Off absorbers such as Ogerpon-W and Gliscor are fantastic partners because Venomicon wants to keep its Heavy-Duty Boots for as long as possible. Pokemon such as Great Tusk and Raging Bolt appreciate Venomicon's ability to take on Fairy-types such as Hemogoblin and Cresceidon.</p>"
      },
      "Nasty Plot": {
        "description": "<h4>Set Details</h4> <p>Nasty Plot Venomicon takes advantage of its fantastic typing, ability, and Special Attack stat to easily set up and threaten foes such as Rillaboom, Revenankh, and Great Tusk with Hurricane. Sludge Bomb can be used instead to nail Fairy-types such as Hemogoblin and Cresceidon and pressure Venomicon's checks through poison damage. Body Press gets boosted by every hit that lands on Venomicon thanks to Stamina and pairs extremely well with Hurricane and Sludge Bomb, nailing Steel-types such as Kingambit and Equilibra. Tera Water gives Venomicon the ability to check sun teams, beat Heatran one-on-one more easily, tank an Ice Beam from Kyurem, though it still fears Freeze-Dry, and tank Doom Desire for its teammates. Tera Dragon also lets Venomicon check sun teams, but it also grants it the strength to handle Ogerpon-W. Tera Fighting mainly nails Kingambit with Body Press, but it also provides an important resistance to Stealth Rock, which can be helpful should Venomicon lose its Heavy-Duty Boots.</p> <p>Nasty Plot Venomicon fits best on bulky offense teams that appreciate its defensive benefits and ability to act as a late-game sweeper. As a result, Venomicon benefits from having more offensive partners, such as Weavile and Dragapult, that help apply pressure to foes. Ogerpon-W and Great Tusk help ease the matchup against Steel-types such as Equilibra and Gholdengo that Venomicon struggles with. Other good partners such as Iron Valiant, Roaring Moon, and Kingambit that appreciate Venomicon's ability to blow open holes in the opponent's defensive core so they can clean up. Nasty Plot Venomicon suffers against faster threats such as Deoxys-S, so partners such as Cresceidon, Dragapult, and Hatterene that can spread paralysis to slow them down are great choices. Venomicon also has a hard time against Electric- and Steel-types that are immune or neutral to Body Press such as Raging Bolt and Gholdengo so Ground-types such as Equilibra and Ting-Lu are fantastic partners. Pokemon such as Great Tusk and Raging Bolt appreciate Venomicon's ability to eliminate Fairy-types such as Hemogoblin and Cresceidon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604741, "username": "kenn"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 221710, "username": "Da Pizza Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Venomicon-Epilogue": {
    "comments": "<h3>Checks and Counters</h3> <p><strong>Stealth Rock</strong>: Venomicon-E's inability to hold Heavy-Duty Boots leaves it extremely vulnerable to Stealth Rock and, when compounded with recoil damage taken from Brave Bird, puts a severe handicap on its ability to act as a successful wallbreaker.</p> <p><strong>Revenge Killers</strong>: Because of Venomicon-E's middling Speed and tendency to quickly wear itself down over a match, it is very susceptible to being revenge killers by faster threats and Pokemon with strong priority, such as Deoxys-S, Darkrai, Latios, Krilowatt, and Raging Bolt.</p> <p><strong>Physically Bulky Pokemon</strong>: Curse Dondozo completely hard walls Venomicon-E, as after a single Defense boost, it avoids getting 3HKOed by Brave Bird even if Venomicon-E Terastallizes and can heal off any damage it would take with Rest. Similarly, Skarmory easily takes multiple unboosted Brave Birds and can set up Iron Defense to force out Venomicon-E in the process, but it becomes a much shakier check should Venomicon-E use Coil or Terastallize. Zapdos can safely switch in on Venomicon-E, norrwly avoiding a 2HKO from unboosted Brave Bird and threatening to paralyze it with Static, but it can play around this by using Coil or Gunk Shot instead.</p> <p><strong>Status</strong>: Venomicon-E is greatly weakened by both burn and paralysis, which can be taken advantage of by status spreaders such as Dragapult and Kitsunoh, especially if it is not carrying Substitute to block Thunder Wave or Will-O-Wisp. Zapdos and Moltres are especially notable in this regard, as they can take advantage of Venomicon-E's reliance on Brave Bird to inflict paralysis or burn with their respective abilities.</p> <p><strong>Fast Encore Users</strong>: As Venomicon-E is heavily reliant on status moves such as Coil and Roost to act as an effective wallbreaker, it is susceptible to being taken advantage of by fast Encore users such as Cresceidon and Ogerpon-W. However, the latter is unable to safely switch in on Venomicon-E directly.</p>",
    "sets": {
      "Coil": {
        "description": "<h4>Set Details</h4> <p>Venomicon-E serves as a powerful, albeit niche wallbreaker for offensive teams that, with proper support, easily shreds right through unprepared teams. Venomicon-E's excellent defensive typing allows it to turn bulky Ground-types such as Landorus-T, Equilibra, and Gliscor into setup fodder and serve as a soft check to Hemogoblin, which is otherwise a massive annoyance for offensive teams. Furthermore, Venomicon-E's access to Coil and a powerful STAB move in Brave Bird makes dealing with it defensively a daunting task, which is further complicated by Tinted Lens invalidating  Flying-resistant Pokemon such as Garganacl, Gholdengo, and Zapdos that would otherwise be reliable checks. Substitute is generally preferred to allow Venomicon-E to use non-Curse Garganacl as setup fodder as well as protect it from otherwise crippling status conditions. Alternatively, Gunk Shot can be used, granting Venomicon-E a strong secondary STAB move that lets it circumvent contact punishment from the likes of Zapdos and Moltres while also giving it a safe attack to use at low HP. Roost is mandatory to help mitigate the large amount of recoil damage that Venomicon-E takes from constantly spamming Brave Bird over the course of a battle. Tera Flying is recommended to boost the power of its already incredibly strong Brave Bird to obscene levels, as well as to patch up its weakness to Psychic. The given EV spread ensures that unboosted Garganacl is unable to break Venomicon-E's Substitute with Salt Cure. If using Gunk Shot over Substitute, an alternative spread of 252 Atk / 4 Def / 252 Spe can be used instead to maximize Venomicon-E's damage output.</p> <p>Venomicon-E generally works best on offensive teams, as it is capable of supporting its teammates by softening up their checks through its wallbreaking prowess. Because Venomicon-E's typing, inability to hold Heavy-Duty Boots, and reliance on recoil moves leave it with a massive weakness to Stealth Rock, as such, it is imperative that Venomicon-E is supported by teammates with hazard control such as Great Tusk, Equilibra, and Hatterene. The former two also help deal with Electric-types that Venomicon-E struggles with, while the latter two can provide Venomicon-E with Healing Wish support, helping reduce its reliance on Roost to mitigate recoil damage and patch up its weakness to status. Venomicon-E's awkward Speed tier leaves it susceptible to being revenge killed by faster foes like Krilowatt and Darkrai, and as such, Sticky Web support from the likes of Araquanid, Ribombee, and Necturna is heavily appreciated. Special sweepers and wallbreakers such as Iron Moth, Chuggalong, and Nasty Plot Gholdengo appreciate Venomicon-E's ability to break through special walls that they struggle against while providing the same support for Venomicon-E against physical walls in return. Raging Bolt deserves a special mention, as it greatly appreciates Venomicon-E's ability to exploit Ground-types and check Fairy-types, while in return, it decimates Dondozo and Skarmory, both of which would otherwise hard wall Venomicon-E. Finally, Dark-types such as Weavile and Kingambit appreciate Venomicon-E's ability to check Fighting- and Fairy-types such as Zamazenta, Arghonaut, and Hemogoblin, while in return, they bully Pokemon that would otherwise cause problems for Venomicon-E such as Kitsunoh, Deoxys-S, and Iron Crown.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 221710, "username": "Da Pizza Man"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Saharaja": {"sets": {"Standard Camel": {}}},
  "Hemogoblin": {
    "comments": "<h3>Other Options</h3> <p>Explosion allows Hemogoblin to deal one last attack that will significantly dent even Fairy-resistant foes such as Venomicon and Skeledirge. At +2, it will even OHKO Multiscale Cresceidon. Explosion also gives a free switch-in to a teammate, grabbing huge amounts of momentum quickly. However, Explosion is unreliable, as it takes away valuable utility and can be hard to use with Hemogoblin’s low Speed. Will-O-Wisp can also be used to cripple threats like Great Tusk, Venomicon, and Kingambit but is mostly useless against checks such as Gliscor and Krilowatt. Choice Band gives Hemogoblin immediate power, allowing it to sweep with Extreme Speed more easily and break through Unaware Dondozo with Tera Fairy. However, this prevents Hemogoblin from using Bulk Up, leaves Hemogoblin vulnerable to all hazards, and is easily taken advantage of by Venomicon. Trick can be used in conjunction with Choice Band to cripple threats such as Venomicon and Equilibra with a hampering item. However, the lack of Choice Band or a setup move is noticeable, making Hemogoblin’s attacks rather weak. Tera Water allows Hemogoblin to more easily win mirror matchups against opposing Hemogoblin by resisting Flare Blitz, but otherwise is inferior to Tera Ground. Hemogoblin can also choose to run a specially defensive EV spread with a recovery move such as Moonlight or Wish and Tera Poison. This allows it to more easily set up on Venomicon while also making it more resilient into special wallbreakers such as Dragapult and Gholdengo. Wish also provides healing for teammates. However, doing so heavily reduces Hemogoblin's revenge killing potential due to a lack of Attack investment.</p> <h3>Checks and Counters</h3> <p><strong>Bulky Poison-types</strong>: Venomicon, Galarian Slowking, and Mollux can all tank Hemogoblin’s attacks and threaten it with Sludge Bomb. Pecharunt is more rare but does the same and threatens Toxic or Malignant Chain. All of them have to be wary of Hemogoblin Terastallizing, however.</p> <p><strong>Fast Fairy-resistant Pokemon</strong>: Iron Moth, Plasmanta, Venomicon-E, and Heatran can tank a Pixilate-boosted Extreme Speed and threaten back with Poison-type STAB moves and Earth Power for the latter. Heatran has the added danger of trapping Hemogoblin with Magma Storm.</p> <p><strong>Krilowatt</strong>: Krilowatt's great natural bulk lets it take a single Extreme Speed and force Hemogoblin out with the threat of a super effective Surf.</p> <p><strong>Bulky Ground-types</strong>: Gliscor and Landorus-T can absorb an attack from Hemogoblin and immediately threaten it back with Earthquake, while Great Tusk can threaten it with Headlong Rush and tank a hit at the cost of a defensive Tera.</p> <p><strong>Fairy-resistant Tera Users</strong>: Tera Poison and Tera Fire from threats such as Dragapult, Darkrai, and Great Tusk can completely shut down a revenge kill attempt from Hemogoblin, with Tera Fire also heavily reducing Flare Blitz's damage, forcing Hemogoblin to either get KOed itself, or switch out.</p> <p><strong>Unaware Users:</strong> Skeledirge and Dondozo are walls that are nearly impossible for Hemogoblin to break through. Skeledirge can slowly use Torch Song to chip its way through Hemogoblin’s HP, while Dondozo takes chunks of Hemogoblin’s health through Waterfall or Liquidation. Arghonaut can wall Hemogoblin too after burning Tera, freely setting Spikes if Hemogoblin lacks Taunt. Arghonaut can also force Hemogoblin out afterwards with Circle Throw.</p>",
    "sets": {
      "Bulk Up": {
        "description": "<p>Hemogoblin is an amazing late-game sweeper thanks to its combination of strong priority and a great offensive typing. Pixilate-boosted Extreme Speed allows Hemogoblin to easily KO weakened targets and pressure offensive threats. Its strength also lets Hemogoblin sweep through teams with frail offensive cores such as Dragapult and Iron Valiant with particular ease if it finds a setup opportunity. Flare Blitz dents threats that resist Extreme Speed, such as Equilibra and Gholdengo. Bulk Up raises Hemogoblin’s middling Attack, allowing it to always OHKO defensive Equilibra with Flare Blitz at +1 and offensive Great Tusk with Extreme Speed at +2. Bulk Up also makes it harder to revenge kill Hemogoblin, turning offensive Great Tusk’s Headlong Rush into a 2HKO at +1. Taunt stops slower foes such as Venomicon, Arghonaut, and Clefable from recovering their HP, allowing Hemogoblin to slowly wear down its checks throughout the game. Spikes is an option to capitalize on forced switches. Tera Fairy maximizes Extreme Speed’s wallbreaking power, while Tera Poison allows Hemogoblin to beat Cresceidon and turn defensive Venomicon into setup fodder. Tera Ground with Tera Blast allows Hemogoblin to break past threats such as Heatran, Mollux, and Plasmanta, as well as allowing it to win the mirror matchup against opposing Hemogoblin. The EV spread allows Hemogoblin to maximize Attack while outspeeding Adamant Kingambit. Alternatively, Hemogoblin can run 76 Speed EVs to outspeed Venomicon while gaining bulk by investing the remaining EVs in HP.</p> <p>Both Hex and Choice Specs Dragapult provide great synergy with Hemogoblin. Dragapult provides great speed control and can beat Great Tusk and Iron Moth, which Hemogoblin can struggle against. Dragapult’s Will-O-Wisp can wear down Hemogoblin’s checks such as Cresceidon, Venomicon, and Great Tusk over time, allowing it to KO them with Extreme Speed. Ground-immune teammates such as Equilibra and Gliscor greatly assist Hemogoblin by checking threats such as Great Tusk and opposing Gliscor. Ogerpon-W threatens Gliscor and Skeledirge for Hemogoblin while easily switching into Water-types such as Krilowatt. Together they can navigate around Venomicon and overwhelm it. With Taunt from Hemogoblin and Encore from Ogerpon-W, Venomicon quickly gets chipped and cannot easily recover HP without giving Hemogoblin setup opportunities. Plasmanta is also a great teammate, although more niche; it easily breaks through walls such as Venomicon, Cresceidon, Dondozo, and Skeledirge that Hemogoblin would otherwise struggle against. Plasmanta is also a great check to Ogerpon-W, which greatly threatens Hemogoblin. Entry hazards and duel screens leads such as Glimmora and Deoxys-S found on hyper offense greatly benefit Hemogoblin, giving it easier sweeping and setup opportunities.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652323, "username": "Anchor9"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 273339, "username": "Lasen"}, {"user_id": 297859, "username": "quziel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Cresceidon": {
    "comments": "<h3>Other Options</h3> <p>Haze can remove boosts from setup sweepers that are faster than Cresceidon such as Swords Dance Iron Valiant and +1 Speed Caribolt, but Encore and Thunder Wave have broader use cases. Ice Beam is an option to beat Gliscor more consistently, but provides very little coverage otherwise.</p> <h3>Checks and Counters</h3> <p><strong>Bulky Poison-types</strong>: Venomicon, Mollux, and Galarian Slowking can all take advantage of Cresceidon's typing and threaten it with their Poison-type moves. The former two can also use it as an opportunity to set hazards, while the latter can use Future Sight. Plasmanta stonewalls Cresceidon, resisting Moonblast and being immune to Scald and Thunder Wave while simultaneously threatening it out with its STAB options.</p> <p><strong>Krilowatt</strong>: Krilowatt is largely unbothered by Cresceidon's moves and threatens it with Thunderbolt or the opportunity to pivot with Volt Switch into one of its teammates that also threaten Cresceidon.</p> <p><strong>Grass-types</strong>: Offensive Grass-types like Ogerpon-W, Caribolt, and Rillaboom can threaten Cresceidon out with their Grass-type STAB moves or annoy it with Knock Off. Malaconda is bulky enough to set sun and pivot out with Parting Shot, all while threatening to cripple Cresceidon with Knock Off or Glare. None of them appreciate being paralyzed or burned, however, so they cannot switch in completely freely.</p> <p><strong>Snaelstrom</strong>: If Snaelstrom is already poisoned, it can use Cresceidon lacking Encore as setup fodder or at the bare minimum as an opportunity to set or remove hazards. It also threatens it with the somewhat rare Toxic. However, it cannot switch in before its Poison Heal has activated in fear of getting burned by Scald or paralyzed by Thunder Wave, as both render it effectively useless.</p> <p><strong>Status</strong>: Cresceidon despises every status condition, as burn and poison both interfere with its Multiscale, while paralysis undermines its defining characteristic in its great Speed.</p>",
    "sets": {
      "Fast Wall": {
        "description": "<p>Cresceidon is a fantastic wall that can fit on most balance and bulky offense teams thanks to its great defensive typing, incredible base 124 Speed, and two amazing defensive abilities in Multiscale and Rough Skin. Thunder Wave allows it to cripple foes that outspeed it, such as Stratagem, Deoxys-S, and Choice Scarf Enamorus, while Encore punishes setup sweepers and slower Pokemon using their utility moves. The combination of Heavy-Duty Boots and Multiscale allows Cresceidon to withstand practically any hit regardless of entry hazards set on the field, making it an effective defensive pivot. It also allows Cresceidon to be used as a \"Get Out of Jail Free Card\" by being thrown in front of almost any wallbreaker or sweeper and stopping it in its tracks by tanking a hit and paralyzing the foe. Rocky Helmet in conjunction with Rough Skin can be utilized instead to punish foes using contact moves such as Landorus-T's U-turn and Weavile's Triple Axel. It also punishes opponents who try to mindlessly use Knock Off with Pokemon like Arghonaut, Great Tusk, and Weavile. Cresceidon can use Tera Poison to avoid being poisoned by Venomicon and Galarian Slowking's Sludge Bomb and foes using Toxic while also checking Hemogoblin better. Tera Dragon is an option to shed its Electric and Grass weaknesses, becoming a solid check to foes such as Ogerpon-W, Rillaboom, and Caribolt.</p> <p>Hex Dragapult is a fantastic partner, checking the Electric- and Grass-types that threaten Cresceidon and running through paralyzed foes. Despite its commendable bulk and Fairy typing, Cresceidon is not the best Knock Off switch-in, as Heavy-Duty Boots aids it in soft-checking foes like Gholdengo and Stratagem. As such, a second Knock Off switch-in such as Gliscor, Skarmory, or Landorus-T is appreciated. If Rocky Helmet is the preferred item, then hazard removal options such as Equilibra, Great Tusk, and Corviknight help Cresceidon stay healthy. Equilibra is generally a great match with Cresceidon, taking on Electric-types such as Caribolt and Raging Bolt for it, while Cresceidon answers Water- and Fire-types such as Arghonaut, Walking Wake, and Cinderace. Together, they also can effectively check Hemogoblin without needing to expend Terastallization, as Equilibra can outspeed paralyzed Hemogoblin and OHKO most variants with Earth Power. Gliscor, Gholdengo, and Garganacl all alleviate Cresceidon's status weakness by switching into Toxic and Thunder Wave from the opponent's walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 273339, "username": "Lasen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 297859, "username": "quziel"}, {"user_id": 221710, "username": "Da Pizza Man"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Chuggalong": {"sets": {"Clangorous Soul": {}}},
  "Shox": {"sets": {"Special Wall": {}}}
}