{
  "Venusaur": {"sets": {"Sun Sweeper": {}}},
  "Vileplume": {"sets": {"Phyiscally Defensive": {}}},
  "Slowbro": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Calm Mind Slowbro makes for one of the best physical walls and late-game cleaners in the metagame. It acts as an excellent check to a wide variety of Pokemon such as Terrakion, Barraskewda, and Jirachi. Calm Mind allows Slowbro to turn into a threatening late-game cleaner capable of ending games easily. Scald can punish switch-ins to special sponges like Assault Vest Cyclizar and Hisuian Goodra and Dark-type physical attackers like Bisharp and Crawdaunt. Psychic Noise is preferred over Psychic and Psyshock to stop setup Pokemon from recovering, making matchups against Fezandipiti and Suicune more favorable and cancelling Amoonguss's Giga Drain and Conkeldurr's Drain Punch completely. Slack Off and Regenerator give Slowbro incredible longevity and the ability to consistently set up with Calm Mind during the course of the game. Heavy-Duty Boots is an excellent item that allows Slowbro to make full use of its ability in Regenerator to stay healthy throughout the game. Rocky Helmet is also useful, as Slowbro switches into the many Close Combats, Iron Heads, Liquidations while also checking Maushold and dealing damage passively. Tera Poison makes Slowbro immune to Toxic from the likes of Umbreon, Fezandipiti, and Quagsire; keeps its invaluable Fighting resistance while granting it a Fairy resistance and removes its Dark- and Bug- type weaknesses to consistently check Slither Wing, Mienshao, and others. Tera Fairy rids Slowbro of its Ghost-, Bug-, and Dark-type weaknesses</p> <p>Calm Mind Slowbro fits best on balance and bulky offense teams, as they enjoy its ability to check the many physical attackers running around the tier. Cyclizar makes for a great partner because it resists Electric- and Grass-type attacks and is immune to Ghost-type attacks, while Slowbro resists Fighting-type attacks and other strong physical attacks for Cylizar and its teammates. Cyclizar also acts as a sponge for the many special attacks aimed at Slowbro and as entry hazard control. Amoonguss pairs well with Slowbro because it forms a Regenerator core alongside Slowbro while preventing it by getting poisoned from the likes of Fezandipiti and Umbreon. Amoonguss also eases the pressure off of Slowbro by helping in answering the plentiful physical attackers in the tier. Hippowdon acts similarly in checking physical attackers while also aiding Slowbro against Electric-types like Rotom-Heat, whereas Slowbro switches into Water-type attacks for Hippowdon. Krookodile is a good partner for Slowbro, as it enjoys Slowbro's ability to check Fighting- and Water-types like Terrakion and Barraskewda, while Slowbro appreciates Krookodile's ability to set Stealth Rocks, remove items with Knock Off and take care of the Steel- and Ghost-types like Hisuian Goodra and Gengar that threaten Slowbro. Slither Wing is a great offensive partner for Slowbro because it invites Fezandipiti and Galarian Weezing for Slowbro and resists Dark-type attacks for it. Calm Mind Fezandipiti and Slowbro work well together, as they both weaken Steel-types like Empoleon and Jirachi for each other while doubling as Fighting-type answers. Fezandipiti and Jirachi are excellent teammates because they form great synergy with Slowbro and are good Pokemon in general due to their ability to spread status and act as pivots while throttling setup attempts with Taunt and Encore, respectively.</p>"
      },
      "Future Sight": {
        "description": "<p>Slowbro is among the best physically defensive walls in the tier with great bulk, multiple forms of recovery, and the ability to use Terastallization very efficiently against a good portion of the metagame. Scald allows Slowbro to punish switch-ins to Dark-types that come in to stop Future Sight, such as Bisharp and Overqwil while also threatening to burn specially defensive walls like Assault Vest Cyclizar and Empoleon. Future Sight has great damage output and enables Slowbro's teammates to force uncomfortable matchups during a game. Thunder Wave, similarly to Future Sight, can enable teammates to apply offensive pressure through forcing switches. Slack Off, combined with Regenerator, makes Slowbro very difficult to take down. A maximum HP and Defense Slowbro with Bold nature has seemingly unbreakable bulk on the physical side, comfortably switching into some of the premier physical threats like Barraskewda, Terrakion, and Galarian Zapdos. Tera Fairy is used to flip the weaknesses to Bug- and Dark-type, maintain the important Fighting-type resistance, and is generally a good Tera type defensively. Tera Poison keeps the Fighting-type resistance and can prevent Slowbro from becoming poisoned, usually the best means of taking it down, although it does make the matchup into Psychic-types like Reuniclus and opposing Slowbro more difficult.</p> <p>Future Sight Slowbro provides incredible offensive and defensive synergy within many team structures and is especially good on balance or bulky offense teams. Slowbro is often paired with other Regenerator users such as Amoonguss, Cyclizar, and Mienshao to form cores that are very difficult to break and can wear teams down offensively through hazard damage and gradual chip from U-turn and Future Sight. Slowbro can support teams through paralysis spam with other teammates like Bellibolt, Jirachi, and Thundurus, enabling offensive options like Basculegion-F and Gengar to take advantage of the boosted Hex damage or slow wallbreakers like Conkeldurr and Crawdaunt to outspeed most of the metagame. Slowbro generally likes to be paired with teammates that can absorb special attacks and are immune to Poison, such as Fezandipiti and Jirachi. To maximize the use of Future Sight, you often want to run physical attacking Fighting-types like Conkeldurr, Mienshao, and Terrakion, since Future Sight will lure in specially defensive walls such as Assault Vest Cyclizar and Empoleon as well as Dark-types like Bisharp and Alolan Muk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563264, "username": "Forest Guardian"}, {"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 231398, "username": "feen"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Slowbro-Galar": {"sets": {"Defensive": {}}},
  "Muk-Alola": {"sets": {"RestTalk": {}}},
  "Cloyster": {"sets": {"Shell Smash Sweeper": {}}},
  "Gengar": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Gengar is one of the fastest Pokemon in RU, leaving speed demons like Cyclizar and Barraskewda as well as Choice Scarf users like Mienshao and Gardevoir in the dust. Ghost / Poison is an excellent offensive typing that can hit most of the metagame for at least neutral damage, only resisted by Krookodile, Bisharp, Overqwil, and Hisuian Zoroark. Choice Scarf Gengar functions as a revenge killer against Pokemon without priority like Basculegion-F, Armarouge, and slower Choice Scarf users such as Jirachi and Krookodile. Trick gives Gengar a way to incapacitate both setup sweepers like Salamence and Blastoise that it doesn't have the power to reliably OHKO and walls like Hisuian Goodra and Gastrodon that can easily switch into one of Gengar's attacks. Gengar can lean into its utility options, setting Toxic Spikes for more entry hazard-focused teams. Focus Blast allows Gengar to threaten Steel-types like Bisharp, Empoleon, and non-Assault Vest Hisuian Goodra. It can use Thunder Wave as speed control to allow a slower sweeper like Armarouge or Weakness Policy Basculegion-F to outspeed foes. Destiny Bond can be used as a last resort to stop sweepers or when Gengar is weakened and simply needs to trade one-for-one. Tera Ghost boosts Gengar's Shadow Ball and lets it function as a cleaner against teams that are chipped down, notably OHKOing physically defensive Slowbro and having a chance to OHKO maximum HP Jirachi after Stealth Rock damage. Additionally, it removes Gengar's weaknesses to Ground and Psychic, allowing it to survive Psychic-type attacks from Reuniclus or Earthquake from Hippowdon and Salamence. Tera Dark allows Gengar to live a Sucker Punch from even a +2 Bisharp and OHKO it with Focus Blast and turns Gengar's weaknesses to Psychic, Dark, and Ghost into resistances. This lets it switch into Choice-locked Psychic-type attacks from Gardevoir and Armarouge and the strong Psychic-type STAB attacks of Reuniclus, Slowbro, and Necrozma without worry. Tera Dark also allows Gengar to win the mirror match by resisting Shadow Ball and OHKOing back with its own Shadow Ball.</p> <p>Gengar can fit on a wide variety of team structures, from offense to balance, due to its ability to revenge kill, shut down walls like Hisuian Goodra and Empoleon with Trick, use Toxic Spikes to spread hazards, and leverage Thunder Wave to slow down opposing revenge killers like Mienshao and Galarian Zapdos. Gengar is a great addition to hazard stack teams with its ability to leverage hazard chip to meet damage thresholds like OHKOing Hisuian Goodra with Focus Blast after three layers of Spikes and shut down Defog users like Galarian Weezing with Trick. Teammates like Suicune and Armarouge love Gengar's ability to use Trick on special walls and give them its Choice Scarf, letting them set up for late-game sweeps. Cyclizar makes an excellent teammate for Gengar, as it is able to keep the field clear of hazards for it while pivoting into Gengar to absorb pesky Fighting- and Fairy-type moves that threaten the little bike lizard. Strong priority users like Slither Wing and Conkeldurr can threaten Pokemon like Bisharp and Lycanroc-D, switching into their priority attacks while threatening them back with their own priority attacks. Slither Wing and Conkeldurr can also threaten the Steel-types that switch in when Gengar locks into Sludge Wave. Defensively, Gengar loves having a Dark-type that can resist the Dark-, Ghost-, and Psychic-type moves that threaten it, making Pokemon like Krookodile and Umbreon enticing choices. Krookodile can set up Stealth Rock for Gengar to take advantage of, while Umbreon can keep it healthy with Wish and cripple walls with Toxic. Knock Off absorbers like Rocky Helmet Chesnaught and Hippowdon can switch in to prevent Gengar from being heavily damaged and losing its item. Noivern can lure in Pokemon looking to hit it with a strong Moonblast, then U-turn into Gengar, which resists the move. It can also threaten their common checks, Steel-types, with Flamethrower.</p>"
      },
      "Hex + Will-O-Wisp": {},
      "Nasty Plot": {}
    },
    "credits": {"writtenBy": [{"user_id": 574067, "username": "Freya"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 513635, "username": "Rarelyme"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Weezing-Galar": {"sets": {"Defensive": {}}},
  "Chansey": {"sets": {"Defensive": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Ditto": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Imposter": {"description": "<p>Tera Steel makes Ditto immune to Toxic Spikes and take less from Stealth Rock. It also lets Ditto revenge kill Belly Drum Hariyama. A Quiet nature and the Special Attack investment is in case Ditto transforms into a Future Sight user like Slowbro.</p>"}}},
  "Vaporeon": {"sets": {"Defensive": {}}},
  "Zapdos-Galar": {
    "sets": {
      "Choice Item Attacker": {
        "description": "<p>Galarian Zapdos is a unique Fighting-type in the metagame because of its excellent offensive utility and good Speed tier. Knock Off is a staple for offensive Fighting-types to punish switches to Ghost- and Psychic-types like Armarouge, Gengar, Jirachi, Slowbro, and Reuniclus while doubling as item removal to rack up residual damage with entry hazard support. U-turn is an excellent pivot move, as it hits Psychic-types for super effective damage while giving teammates the opportunity to position onto the field safely into favorable matchups. Choice Scarf provides excellent Speed control, notably allowing Galarian Zapdos to outspeed other Choice Scarf users like Basculegion-F, Gardevoir, and Krookodile. Choice Band gives Galarian Zapdos the breaking power to 2HKO would-be defensive checks like Galarian Weezing and Slowbro, which isn't possible using Choice Scarf without supplementing the damage output with Terastallization. Defiant is excellent for taking advantage of Defog attempts from Galarian Weezing and Noivern and Intimidate from Krookodile and Salamence. Tera Flying turns STAB Brave Bird into a practically unwallable attack and has the added benefit of removing weaknesses to Fairy- and Psychic-type attacks from the likes of Fezandipiti, Gardevoir, and Slowbro. Tera Dark provides similar defensive utility to Tera Flying, turning Electric- and Flying-type attacks from super effective to neutral, which is helpful against Thundurus and opposing Galarian Zapdos, while giving an immunity to Psychic and providing a STAB boost to Knock Off, allowing for an OHKO on Armarouge and a 2HKO on Reuniclus. It also provides a key immunity to Prankster, making Thundurus unable to hinder a late-game sweep with Thunder Wave. Tera Steel flips the weaknesses to Fairy-, Flying-, and Psychic-type attacks into resistances, giving defensive utility into Choice Scarf Gardevoir and opposing Galarian Zapdos, and gives an immunity to Poison that helps against Fezandipiti and Gengar. Using Tera Steel allows Choice Band Galarian Zapdos to pick up valuable damage or KOs into Choice Scarf users like Gardevoir and Gengar.</p> <p>Choice Item Galarian Zapdos can function on balance and offense teams as either a fast attacker and pivot with Choice Scarf or a strong breaker with Choice Band. Defensive teammates that can pivot and give Galarian Zapdos safe entry points like Cyclizar, Empoleon, and Jirachi are crucial to maximizing the immediate damage output and offensive pressure that it puts on opponents. Pairing Choice Band Galarian Zapdos's potent breaking power with Pokemon that excel at late-game cleaning, like Bisharp, Maushold, and Mimikyu, can be advantageous. Empoleon and Jirachi are notable teammates for their ability to absorb Fairy- and Psychic-type attacks from Fezandipiti, Gardevoir, and Slowbro and establish entry hazards. Offensive teammates like Basculegion-F and Hisuian Zoroark can threaten physical walls like Hippowdon, Jirachi, Slowbro, and Reuniclus and can form an offensive core that keeps momentum against otherwise strong defensive cores. Other teammates that can form a VoltTurn core with Galarian Zapdos like Barraskewda, Slither Wing, and Thundurus can put immense pressure on teams by forcing considerable chip damage with their strong pivot attacks. Capitalizing on this VoltTurn structure, Galarian Zapdos fits well on hazard stack archetypes, partnering with Chesnaught, Empoleon, Gligar, and Jirachi comfortably, as they provide defensive support and use its offensive pressure to wear down opponents. Galarian Zapdos lacks recovery and often takes a lot of recoil damage using Brave Bird, so Healing Wish and Wish support from teammates like Gardevoir, Jirachi, and Umbreon can improve its longevity and give it the staying power to consistently break through teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 555741, "username": "MachJacob"}, {"user_id": 513635, "username": "Rarelyme"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Mew": {
    "overview": "<p>Mew proves itself as one of the tier's top setup sweepers thanks to its combination of good bulk and an expansive movepool that gives it multiple setup options and unpredictable coverage. Mew's advantageous matchup against many of the tier's defensive Pokemon such as Jirachi and Fezandipiti makes it a good option as a late-game cleaner or mid-game wallbreaker. Mew's unpredictability comes from its set variety, being able to run Nasty Plot, Calm Mind, and Dragon Dance sets, and it can leverage this versatility to swing the game to its advantage once it gets on the field. However, Mew suffers from having only above average Speed that allows it to be outsped and revenge killed by many offensive threats such as Gengar and Maushold, and a Psychic typing gives it a vulnerability to priority moves, which prevents it from cleaning up teams by itself.</p>",
    "comments": "<h3>Other Options</h3> <p>Thanks to having one of the largest movepool among all Pokemon, Mew has the ability to run other sets that a team may need to account for. It can function as a suicide lead for hyper offensive teams, as it can run Spikes, Stealth Rock, and Taunt all in one set. A Double Dance set with Iron Defense, Calm Mind, and Stored Power can also be run on more defensive teams as a wincon. A physical wallbreaker set with either Swords Dance or Dragon Dance and attacking moves such as Psychic Fangs, Earthquake, and Knock Off can be run, but it is not as efficient as the Nasty Plot set with Intimidate and Rocky Helmet being very common in the tier. Shadow Ball on the Nasty Plot set allows Mew to hit Psychic-type Calm Mind sweepers such as Slowbro and Cresselia super effectively.</p> <h3>Checks and Counters</h3> <p><strong>Priority Moves</strong>: Priority moves are rather common in the tier, and Mew is weak to a lot of them, like Slither Wing's First Impression, Bisharp's Sucker Punch, and Mimikyu's Shadow Sneak.</p> <p><strong>Faster Pokemon and Choice Scarf Users</strong>: Mew has relatively good Speed, but the tier has a lot of faster Pokemon that threaten it with an OHKO such as Gengar, Hisuian Zoroark, and Choice Scarf Krookodile.</p> <p><strong>Bulky Dark-types</strong>: Specially defensive Dark-type Pokemon such as Umbreon and Wo-Chien can easily wall Mew, as they are immune to Mew's Psychic-type STAB move and take little damage from Draining Kiss unless Mew Terastallizes into a Fairy-type.</p> <p><strong>Bulky Psychic-types</strong>: Mew struggles to fit Dark- and Ghost-type coverage in its moveset, so Psychic-types such as Slowbro, Cresselia, and Reuniclus can handily beat Mew if it is not running a super effective coverage move. Most of these Psychic-type Pokemon can also boost their Special Defense via Calm Mind to give Mew difficulty in wallbreaking while still being able to resist Psyshock. Cresselia notably can give Mew difficulty thanks to its immunity to Earth Power.</p>",
    "sets": {
      "Nasty Plot": {
        "description": "<h4>Set Details</h4> <p>Nasty Plot Mew functions as a strong and reliable setup sweeper or wallbreaker that helps soften up the opposing team for another sweeper to clean up. Psyshock allows Mew to punish special walls and Assault Vest users such as Cyclizar while also allowing it to beat other Calm Mind users like Suicune and Slowbro after Terastallization. Earth Power gives it super effective coverage against the tier's top Steel- and Fire-types such as Jirachi, Hisuian Goodra, Empoleon, and Armarouge. Draining Kiss rounds out the set and gives Mew super effective coverage against Dark- and Dragon-types such as Krookodile and Salamence and also gives Mew some form of recovery to let it survive hits better and offset recoil damage from Life Orb. Life Orb gives Mew a further boost in power that can potentially allow Mew to turn 2HKOs to OHKOs such as an OHKO on Jirachi, an OHKO on Choice Specs Hisuian Goodra after Stealth Rock, and turning a 3HKO into a 2HKO on Suicune with Psyshock after a Nasty Plot boost. Mew's ability Synchronize has situational use, as it can discourage certain Pokemon from spamming status-inducing moves such as Jirachi's Body Slam and Umbreon's Toxic. Tera Fairy allows Mew to reverse its weakness to Bug and Dark while also giving Draining Kiss a STAB boost.</p> <p>Mew fits well on all types of offensive teams thanks to its bulk and power after setting up. On hyper offensive teams, Mew can act as a soft check to slower offensive Pokémon such as Armarouge, as Mew can threaten those Pokemon out and use it as an opportunity to set up. Other setup sweepers such as Yanmega and Revavroom appreciate Mew wearing down threats such as Hisuian Goodra and Hippowdon that opens them up for a late-game sweep. Mew in particular has an advantageous matchup against the tier's bulky Water-types that its teammates may struggle with, as Psyshock and Earth Power help eliminate Calm Mind Suicune and Empoleon. Entry hazard setters such as Krookodile, Jirachi, and Kleavor also make for good teammates that help Mew wallbreak more efficiently by accruing chip damage on would-be checks like Empoleon and Hisuian Goodra. Physical wallbreakers such as Galarian Zapdos and Bisharp help Mew take down special walls such as Cresselia and Umbreon and overwhelm the opposition. Galarian Zapdos in particular has good synergy with Mew, as it resists priority moves like First Impression and Sucker Punch that heavily threaten Mew, while Mew can check the physical walls that Zapdos struggles against such as Hippowdon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 239648, "username": "MegaFlareon"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 655207, "username": "Sir Tetris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Feraligatr": {"sets": {"Dragon Dance": {}}},
  "Politoed": {"sets": {"Rain Setter": {}}},
  "Quagsire": {"sets": {"Physically Defensive": {}}},
  "Espeon": {"sets": {"Choice Specs": {}, "Calm Mind": {}, "Choice Scarf": {}}},
  "Umbreon": {"sets": {"Wish Support": {}}},
  "Forretress": {"sets": {"Support": {}}},
  "Gligar": {"sets": {"Utility": {}}},
  "Kingdra": {"sets": {"Rain Sweeper": {}}},
  "Raikou": {"sets": {"Calm Mind": {}, "Offensive Pivot": {}}},
  "Entei": {"sets": {"Choice Band": {}}},
  "Suicune": {
    "overview": "<p>Suicune is one of the prominent wincons of the tier. With a great defensive typing in Water and a high base HP stat, Suicune can set up on most bulky Pokemon in the tier. After one Calm Mind, Suicune is tough to revenge kill, as it deters physical attackers from switching in due to a potential burn from Scald, and Special Attackers have to break past the Special Defense boosts from Calm Mind. Pressure is an excellent ability on Suicune, as it allows Suicune to PP stall opposing Pokemon. Suicune's reliance on Leftovers leaves it vulnerable to Knock Off users, especially Cyclizar, as it is crippled for the rest of the game upon losing its Leftovers. Despite having a solid base Speed stat of 85, it is still slower than some common threats such as Fezandipiti, Jirachi, and Cyclizar. Faster Pokemon like Galarian Zapdos, Krookodile, and Thundurus can exploit Suicune's lower Speed and hinder its progress-making or sweeping opportunities.</p>",
    "comments": "<h3>Other Options</h3> <p>Suicune can opt to run RestTalk, giving it a mode of reliable recovery. However, due to the unreliable nature of Sleep Talk, Suicune can be beaten by offensive Pokemon if it fails to get the correct move. Roar is also an option for it to phaze setup sweepers such as Slowbro, opposing Suicune, and Cresselia as well as rack up entry hazard damage on the opponent's side. A more offensive Calm Mind set with Scald, Ice Beam, and Shadow Ball or Tera Blast Electric can be used to threaten the opponent offensively. Tera Blast Electric hits Volcanion, Vaporeon, and Slowbro super effectively, making this set a good lure against common Suicune checks.</p> <h3>Checks and Counters</h3> <p><strong>Knock Off</strong>: Suicune is permanently crippled by Knock Off, as Leftovers is its only source of recovery. Therefore, common Knock Off users like Cyclizar, Krookodile, and Okidogi are threats.</p> <p><strong>Status Conditions</strong>: Suicune's ability to be a wincon is diminished upon getting burned or poisoned, especially from Fezandipiti, as it naturally outspeeds Suicune and can threaten it with Toxic. Suicune should not switch into Galarian Weezing, Slither Wing, and Talonflame because it dislikes getting hit by Will-O-Wisp, which would counteract Leftovers's recovery. Paralysis also cripples Suicune to a lesser extent, as it will be more prone to slower Pokemon such as Conkeldurr and Taunt Volcanion.</p> <p><strong>Strong Special Attackers</strong>: Strong special attackers such as Thundurus, Nasty Plot Rotom-C, and Choice Specs Hisuian Zoroark do great damage to Suicune, making it unable to set up reliably.</p> <p><strong>Sound-based Moves</strong>: Fezandipiti can attempt to poison Suicune with Toxic Chain, as Alluring Voice hits through Substitute. Psychic Noise can deny Leftovers recovery for Suicune from like Reuniclus and Slowbro, and they can outlive Suicune due to having reliable recovery. Throat Spray Yanmega can beat Suicune with prior chip damage.</p>",
    "sets": {
      "Substitute + Calm Mind": {
        "description": "<h4>Set Details</h4> <p>This set focuses on Suicune being a wincon by making use of Pressure and its HP and Speed stats. Substitute + Calm Mind ensures Suicune can set up on bulky but offensively weak Pokemon such as Slowbro, Gastrodon, and Wo-Chien. Protect is excellent for scouting moves on Choice-locked Pokemon, such as Okidogi, Gardevoir, and Magnezone, as well as burning foe's PP with Pressure. Protect also gives Suicune one more turn of Leftovers recovery, which improves its longevity. Ice Beam can be used over Protect to hit Pokemon that are immune to Scald, such as Storm Drain Gastrodon, Volcanion, and Vaporeon, as well as deal super effective damage to Cyclizar. Due to Pressure and Calm Mind, Suicune can beat Pokemon that are unable to boost their offenses, like the aforementioned Water-immune foes and Empoleon, by PP stalling them. Shadow Ball is also a good option to hit Psychic-types like Jirachi, Slowbro, and Gardevoir, making them less of a threat. A maximum Speed stat is required for Suicune to outspeed key threats such as Slither Wing and Okidogi, dealing decent damage to and potentially burning them. Tera Dark is the premier choice for Suicune, as it is immune to Psychic Noise upon Terastallizing. Tera Fairy is also an option, as it is a solid defensive type that resists Close Combat and U-turn from Okidogi, Slither Wing, and Galarian Zapdos. 252 HP EVs ensure Suicune has 101 HP Substitutes, meaning Seismic Toss from Chansey will not be able to break the Substitute.</p> <p>Suicune appreciates entry hazards removal due to running Leftovers, which is its only form of recovery, to minimize chip damage as much as possible. Therefore, hazard control from Cyclizar, Galarian Weezing, and Noivern is much appreciated. Knock Off absorbers such as Chesnaught and Galarian Weezing are good partners, since they can switch into common Knock Off users like Krookodile and Mienshao safely. Suicune is also threatened by strong Electric- and Grass-type Pokemon such as Thundurus, Magnezone, and Rotom-C, so it appreciates the support from special sponges such as Cyclizar, Umbreon, and Fezandipiti. Toxic users such as Umbreon, Fezandipiti, and Quagsire are useful, as they put the checks Suicune usually has, like Cresselia, on a timer. Finally, strong wallbreakers such as Choice Specs Gengar, Choice Specs Hisuian Goodra, and Magnezone can get rid of opposing Calm Mind sweepers like Alluring Voice Fezandipiti and Psychic Noise Slowbro and Reuniclus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231398, "username": "feen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Swampert": {"sets": {"Defensive Utility": {}}},
  "Gardevoir": {"sets": {"Choice Scarf": {}}},
  "Breloom": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Flygon": {"sets": {"Choice Scarf": {}}},
  "Crawdaunt": {
    "overview": "<p>The big bad crawdad of competitive Pokemon, Crawdaunt remains a relevant wallbreaker and stall dismantler several generations after its debut. Choice Band and Adaptability make switching into Crawdaunt nigh impossible, as it fires off massive Knock Offs and Crabhammers. With little regard to physical walls' existence, Crawdaunt excels in taking advantage of safe entry points provided by teammates to force concessions every time it hits the field, as switching into the combination of Dark- and Water-type attacks is difficult for even the bulkiest of walls like Hippowdon and Slowbro. With access to Aqua Jet, Crawdaunt can overcome its relative slowness against offensive foes, picking up KOs and dealing big damage before it can be taken out in return. Unfortunately, Crawdaunt is still a bit slow and frail and competes for a spot against notable faster and bulkier wallbreakers like Volcanion, Slither Wing, and Terrakion. Along with the lack of Speed, Crawdaunt also suffers from a frailness that makes it susceptible to being taken out by the faster Pokemon in the metagame like Gardevoir, Kleavor, and Galarian Zapdos.</p>",
    "comments": "<h3>Other Options</h3> <p>A Jolly nature Crawdaunt Dragon Dance improves Crawdaunt's Speed enough to outpace notable threats like Kleavor and Mienshao after just one boost. Liquidation can be used over Crabhammer for a more accurate attack. Covert Cloak allows Crawdaunt to set up against Scald users, like Slowbro and Suicune, without fear of getting burned.</p> <h3>Checks and Counters</h3> <p><strong>Faster Wallbreakers</strong>: Crawdaunt struggles to keep pace against offensive teams, often relying on Aqua Jet, as it can't outspeed the opposition. Faster wallbreakers like Galarian Zapdos, Slither Wing, and Gardevoir threaten to KO Crawdaunt before it can leverage its absurd offensive output for balance teams reliant on it.</p> <p><strong>Water-type Pokemon</strong>: Gastrodon and Volcanion, because of their abilities Storm Drain and Water Absorb, respectively, prevent Crawdaunt from freely using Crabhammer to power its way through teams. Suicune does not have an immunity to Water but does prevent Crawdaunt from staying in comfortably by threatening Scald burns, while Barraskewda can use the threat of Close Combat to pivot into more favorable matchups.</p> <p><strong>Entry Hazards and Rocky Helmet</strong>: Coming in multiple times throughout a game to fire off massive attacks is Crawdaunt's specialty, which makes it susceptible to getting worn down by entry hazards. Similarly, Rocky Helmet Pokemon like Amoonguss and especially Chesnaught cause problems for Crawdaunt, racking up chip damage while making Crawdaunt far less imposing by recovering their health back.</p> <p><strong>Grass-type Pokemon</strong>: Amoonguss and Chesnaught are two defensive Grass-types that can often switch into Crawdaunt's STAB attacks and recover off most of the damage, with both threatening to KO it back with Giga Drain and Body Press, respectively. Wo-Chien similarly can take many of Crawdaunt's strongest attacks and recover HP back with Leech Seed. Hisuian Lilligant is a niche offensive pick but matches up well into Crawdaunt, using it to set up Victory Dance and threaten a sweep late-game.</p>",
    "sets": {
      "Swords Dance": {},
      "Choice Band": {
        "description": "<h4>Set Details</h4> <p>Choice Band Crawdaunt dishes out massive damage with every attack it uses, making it a seemingly unwallable wallbreaker. Aqua Jet functions as a STAB priority attack that allows Crawdaunt to overcome its relative slowness, picking up valuable revenge kills and chip damage on faster threats like Armarouge, Maushold, and Thundurus. Close Combat gives Crawdaunt additional breaking power against Dark- and Steel-type Pokemon like Bisharp and Hisuian Goodra. Adaptability, in conjunction with Crabhammer and Knock Off, renders physical walls neutral to its STAB attacks like Amoonguss and Galarian Weezing unable to weather the storm as Crawdaunt 2HKOes them with ease. Tera Water does not get much value offensively, as Adaptability offsets a majority of the boost provided by Terastallization, so Crawdaunt does not often Terastallize outside of the rare instances where it can improve a damage roll against a foe. Tera Water does remove Crawdaunt's weaknesses to common priority attacks like First Impression and Mach Punch, though it also eliminates the Adaptability boost for Knock Off, which is a tough concession to make.</p> <p>Balance and bulky offense teams needing a reliable Knock Off user and wallbreaker appreciate Crawdaunt's ability to do both well. Teammates like Cyclizar, Slither Wing, and Galarian Zapdos can pivot to Crawdaunt against incoming physical walls, such as Amoonguss, Hippowdon, and Slowbro, to provide safe opportunities to use its raw power to break holes into the opposition. Cyclizar and Noivern are exceptional teammates, as they can both pivot and remove entry hazards from the field, which Crawdaunt appreciates to retain health throughout a game. Similarly, defensive partners like Bellibolt and Magnezone can slowly pivot to Crawdaunt, providing valuable entry points against bulkier walls like Hisuian Goodra and Umbreon. Choice Scarf users like Gardevoir and Krookodile appreciate Crawdaunt's ability to break through defensive Pokemon like Galarian Weezing, Hisuian Goodra, and Umbreon, enabling them to clean late-game. Slowbro and Thundurus provide speed control in the form of Thunder Wave, giving valuable opportunities for Crawdaunt to break through faster Pokemon like Jirachi, Terrakion, and Volcanion. Defensive teammates that can absorb Fairy- and Fighting-type attacks from revenge killers like Gardevoir and Mienshao are a necessity for Crawdaunt, making Fezandipiti a key teammate that can take attacks and provide safe entry points with U-turn. Hazard stacking cores, with setters like Chesnaught, Jirachi, and Klefki, can use Crawdaunt's Knock Off as a way to remove Heavy-Duty Boots while forcing switches, accruing damage quickly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Milotic": {"sets": {"Defensive": {}}},
  "Salamence": {"sets": {"Special Attacker": {}, "Dragon Dance": {}}},
  "Jirachi": {
    "overview": "<p>Jirachi is one of the most dynamic Pokemon in SV RU with a plethora of sets at its disposal. Its diverse movepool gives it access to fantastic utility options such as Stealth Rock, U-turn, and Encore; potent offensive tools such as Iron Head and Calm Mind; and incredible special coverage including moves like Thunder and Aura Sphere, meaning that Jirachi is able to fit almost any role that its team requires; this has the added benefit of making its set difficult to discern on Team Preview. However, in true \"Jack-of-all-Trades, Master of None\" fashion, Jirachi can sometimes find itself outclassed in the plethora of roles it can fill. Its lack of immediate recovery and unspecialized defenses render it inferior to physical walls like Hippowdon and Chesnaught and specially defensive ones like Empoleon. Jirachi's weakness to Dark, in particular Knock Off, holds it back quite a bit from being a reliable entry hazard setter and defensive sponge. On many teams, Jirachi competes for the Psychic-type position with other potent Pokemon like Slowbro and Reuniclus that may fill roles such as spreading status and sweeping with Calm Mind more effectively; hence, opting for Jirachi incurs a noticeable opportunity cost. As a setup sweeper, Jirachi's inability to boost its Speed can leave it fearful of revenge killers like Hisuian Zoroark, Mienshao, and Terrakion. Lastly, Jirachi's relatively weak offensive power means that it can often struggle to make progress, even with a Choice item.</p>",
    "comments": "<h3>Other Options</h3> <p>Meteor Beam allows Jirachi to compress a setup move and coverage for Pokemon like Volcanion and Thundurus into one moveslot, but it has the drawback of being mostly useless for the rest of the game after Power Herb is used up. Cosmic Power + Weakness Policy is sometimes able to catch opponents off-guard and pull off a devastating sweep; however, it is heavily reliant on the matchup and only works if the opponent doesn't have or has exhausted their anti-setup options such as phazing, Encore, and Trick. Future Sight and Doom Desire can be used alongside wallbreakers such as Slither Wing and Terrakion that appreciate assistance against Poison- and Fairy-type switch-ins. Jirachi can also run a Choice Band set with Meteor Mash, capitalizing on Serene Grace giving it a 40% chance to boost its Attack.</p> <h3>Checks and Counters</h3> <p><strong>Contact Effects</strong>: Being able to fish for flinches, chip damage, and status by freely clicking Iron Head and Body Slam is one of Jirachi's many advantages. Therefore, the presence of Rocky Helmet users such as Hippowdon, Chesnaught, and Amoonguss on practically every bulky team is detrimental to Jirachi, as they prevent it from spamming its physical moves. Static Bellibolt in particular can punish Jirachi greatly by possibly paralyzing it, with Bellibolt itself being immune to Body Slam paralysis and taking practically no damage from Iron Head. Talonflame is similarly able to deter and punish Jirachi's weak attacks with Flame Body.</p> <p><strong>Fast wallbreakers</strong>: Faster offensive Pokemon like Gengar and Choice Scarf users such as Galarian Zapdos and Krookodile can easily threaten Jirachi with their powerful attacks, which gives them an opportunity to take it out or blow holes through its team.</p> <p><strong>Dark-types</strong>: Dark-type Pokemon like Bisharp, Crawdaunt, and Intimidate Krookodile take little damage from Jirachi's Iron Head and threaten it back with a strong Dark-type attack. Umbreon is particularly effective at checking Jirachi thanks to its amazing bulk, Inner Focus, and Foul Play dealing decent damage to even special Jirachi.</p> <p><strong>Fire-types</strong>: Fire-type Pokemon like Armarouge, Rotom-H, and Volcanion can capitalize on Jirachi's inability to deal with them by firing off a devastating attack or setting up to boost their firepower at little risk to themselves. However, they have to be careful not to let Calm Mind Jirachi accrue enough Special Defense boosts such that Jirachi becomes able to survive an attack and take them out.</p>",
    "sets": {
      "Utility": {
        "description": "<p>Utility Jirachi is truly a jack of all trades in RU with its evenly distributed stats, useful part-Steel typing, and access to a litany of support options. Body Slam capitalizes on Serene Grace to spread paralysis at a high rate without being blocked by Taunt. With paralysis and Iron Head flinch chance factored in, Jirachi has a staggering 70% chance to immobilize a foe. Jirachi's final moveslot is flexible and can be fitted to accommodate the specific needs of the team. Encore provides Jirachi with a reliable option to discourage slower setup sweepers such as Slowbro and Fezandipiti from freely boosting while also giving Jirachi a manner of punishing passive play, being able to lock Pokemon such as Hippowdon and Empoleon into a recovery or entry hazard setting move. U-turn provides Jirachi with a pivoting, letting it bring in frailer teammates as well as giving it an out from being trapped by Magnet Pull Magnezone. Wish can be used as a support option to heal up teammates on low health, as well as giving Jirachi a somewhat reliable recovery option itself. Leftovers gives Jirachi a source of passive recovery, improving its longevity. 224 Speed EVs with a Jolly nature ensure that Jirachi can outspeed threats such as Mimikyu and Krookodile. The remaining EVs are invested into Special Defense to better take on Noivern's Flamethrower and Yanmega's Bug Buzz. Jirachi's Tera options are also quite flexible and can be changed to suit the needs of the team. Tera Water is useful, as it can help Jirachi emergency check strong Water-types in the tier such as Volcanion and Barraskewda. Tera Steel provides Jirachi a stronger Iron Head and also removes its weakness to Dark, making it less susceptible to moves such as Cyclizar's Knock Off and Bisharp's Sucker Punch. Tera Fairy can be used to flip Jirachi's weakness to Dark into a key resistance, as well as giving it useful resistances to several forms of priority in the tier like Slither Wing's First Impression. Tera Fairy also removes its weakness to Ground, making matchups into Krookodile and Flygon much more favorable.</p> <p>Utility Jirachi can fit on a slew of both Pokemon and team structures. For example, Jirachi is an excellent fit on an offensive playstyle like rain where it doubles as a Stealth Rock setter as well as a general special sponge, covering for problematic revenge killers like Choice Scarf Gardevoir. Bulky offense and balance teams also appreciate Jirachi, as it brings a host of useful traits such as being a Stealth Rock setter, a pivot, and a great blanket check to common threats such as Fezandipiti, Noivern, and opposing Jirachi. With how Cyclizar covers Jirachi's weaknesses to Ghost and Fire, it is a great partner; in return Jirachi can switch into Fairy-type attacks for it. On top of that, these two in tandem also create a formidable pivot core for. Other teammates that can spread paralysis such as Slowbro and Thundurus also work as great partners with Jirachi, as they can slow down the opposing team giving Jirachi more chances to paraflinch through foes. Slower, frailer wallbreakers like Crawdaunt and Conkeldurr greatly benefit from Jirachi's ability to slow down the opponent's team through paralysis, generate safe entry points with U-turn, and provide support through Wish or Encore. VoltTurn cores with Thundurus and Fezandipiti can help keep up momentum and pressure, helping rack up entry hazard chip damage on the opponent's team.</p>"
      },
      "Offensive Calm Mind": {
        "description": "<p>Calm Mind Jirachi is difficult to take down thanks to its typing and natural bulk, which let it stack Calm Mind boosts easily against a large portion of the tier. Psychic Noise prevents slower defensive Pokemon like Chansey, Reuniclus, and Fezandipiti from healing so Jirachi can eventually beat them. Grass Knot smacks many of the defensive Water- and Ground-type Pokemon that would normally handle other variants of Jirachi well, such as Hippowdon, Quagsire, Slowbro, and Gastrodon. Aura Sphere provides a coverage move that hits Dark- and Steel-type Pokemon like Bisharp, Hisuian Goodra, and Magnezone super effectively. Thunder nails Water-type Pokemon neutral to Grass Knot such as Gyarados, Volcanion, and Empoleon while boasting a nice chance to paralyze the foe and being a great option versus rain teams. Jirachi can usually afford missing a Thunder thanks to its bulk. Shadow Ball hits Psychic-types such as Armarouge, Reuniclus, and opposing Jirachi, which are otherwise safe from Jirachi's other options. Leftovers allows Jirachi to recover health throughout a game thanks to the many switch-in opportunities its bulk and typing offers it. Calm Mind Jirachi will often stay on the field for many turns as it sets up and chips at the opponent's team, so Leftovers recovery will easily pile up. Expert Belt can be used on more aggressive teams to offset the middling immediate power of this set, but be wary that Jirachi will be worn down more quickly. 224 Speed EVs allow Jirachi to outspeed Mimikyu and Krookodile. Tera Water allows Jirachi to remove its Ground, Ghost, and Dark weaknesses, as well as letting it resist Armarouge's Armor Cannon and Volcanion's Flamethrower. Tera Fairy transforms Jirachi's Dark weakness into a resistance to handily tank the likes of Bisharp's Sucker Punch and Krookodile's Knock Off while being an overall fantastic defensive typing. Tera Fighting can be used in conjunction with Expert Belt and Aura Sphere to directly threaten high damage on Steel- and Dark-type Pokemon while being Jirachi's best Tera type against Bisharp.</p> <p>Offensive Calm Mind Jirachi works on a wide variety of teams, from offense to balance teams, looking for a bulky Pokemon that can weaken common balance cores while providing defensive value through its natural bulk coupled with resistances to Fairy- and Psychic-type attacks and an immunity to poison and Poison-type attacks. Levitate Galarian Weezing provides an immunity to Ground and a resistance to Dark coupled with decent physical bulk and spreads burn through Will-O-Wisp to help Jirachi withstand physical attacks much better. Other physical walls, like Hippowdon, Amoonguss, and Gligar, can likewise handle physical breakers such as Galarian Zapdos and Krookodile that Jirachi struggles taking hits from. Krookodile is a great partner, acting as a switch-in to Dark- and Ghost-type attacks, fulfilling the entry hazard setter role, removing Heavy-Duty Boots and Leftovers from defensive Pokemon, and denying recovery attempts from foes with Taunt, which Jirachi can capitalize on. Other more sturdy switch-ins to Ghost-type Pokemon like Basculegion-F and Gengar include Assault Vest Hisuian Goodra and Assault Vest Cyclizar. Fighting-type breakers such as Galarian Zapdos, Slither Wing, and Mienshao pair well with Jirachi due to their ability to threaten Steel- and Dark-type Pokemon that do well against Jirachi, especially if choosing not to run Aura Sphere, while Jirachi can switch into the Psychic- and Fairy-type attacks targeted at them in return. Because this set has difficulty pulling its weight against hyper offense teams, Pokemon strong against the archetype like Bisharp, Slither Wing, and Umbreon are recommended.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Jirachi provides speed control and offensive pivoting for many team structures. Defensively, Jirachi is a great team presence because of its great defensive typing and natural bulk, with 100 base stats across the board providing it with the longevity needed to switch into several attacks for its teammates. Iron Head is the most reliable STAB option for Jirachi to use since it has adequate base power, is neutral into a majority of the metagame, and boasts a high flinch rate. U-turn is a safe pivot move, allowing powerful partners to come in freely. Choice Scarf Jirachi uses Trick to hinder would-be checks like Amoonguss and Hippowdon, which can also greatly help teammates that struggle against these defensive walls like Revavroom and Terrakion. Healing Wish can give a second opportunity to a teammate that may otherwise not have enough health to get back into a game reliably. Using a Jolly nature with max Attack and Speed enables Jirachi to outspeed a majority of the tier, tying with other Choice Scarf users like Galarian Zapdos or Dragon Dance Salamence after a Speed boost. Tera Steel is run to maximize its damage output with Iron Head, which can allow Jirachi to potentially flinch its way through the opponent's physical wall, along with hitting several notable benchmarks like OHKOing Terrakion and 2HKOing Noivern and Galarian Zapdos.</p> <p>Choice Scarf Jirachi is primarily seen in offense and balance structures, where it can pack speed control, support, disruption, and a solid defensive profile into one slot. Jirachi is one of the best switch-ins to Fairy- and Poison-types in the tier, as well as having key resistances to Dragon- and Psychic-type attacks, making it a reliable option to take a Gardevoir or Fezandipiti Moonblast or Salamence Outrage. Teammates weak to Fairy-type moves, such as strong Dragon- or Fighting-types like Salamence and Terrakion, are grateful for Jirachi's presence on the team to fall back on. Taking advantage of Choice Scarf Jirachi's ability to hinder and chip at physically defensive walls like Amoonguss, Hippowdon, and Palossand, teammates such as Revavroom, Mimikyu, and Terrakion can position themselves to set up reliably. Teammates that lack recovery such as Armarouge and Galarian Zapdos can function as both mid-game breakers and late-game cleaners when paired with Healing Wish support from Jirachi.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 305696, "username": "Ming549"}, {"user_id": 614438, "username": "fluff!!"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 655207, "username": "Sir Tetris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 555741, "username": "MachJacob"}, {"user_id": 598717, "username": "Sneakyplanner"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Deoxys-Defense": {"sets": {"Cosmic Power": {}, "Utility": {}}},
  "Torterra": {"sets": {"Shell Smash Sweeper": {}}},
  "Infernape": {"sets": {"Physical Attacker": {}, "Nasty Plot": {}}},
  "Empoleon": {
    "sets": {
      "Offensive": {
        "description": "<p>Offensive Empoleon is uniquely equipped to provide teams with a strong defensive and offensive presence given its natural bulk and exceptional coverage. Its Water / Steel typing and Special Defense is valuable in a metagame with strong Choice Scarf users such as Basculegion-F, Gardevoir, and Gengar threatening to use their strong STAB attacks to clean games. Surf is a reliable STAB option for Empoleon, as it hits a lot of the metagame for neutral damage. Ice Beam gives Empoleon coverage to hit Dragon- and Grass-types such as Cyclizar, Noivern, Salamence, and Amoonguss. Grass Knot hits Water-types like Basculegion-F and Slowbro while also giving it a means to damage Volcanion. Roost assures Empoleon can reliably recover throughout a game. Leftovers gives Empoleon even more longevity and offsets most entry hazard damage. Competitive is useful for getting a boost from Defog attempts, Intimidate Attack drops, and notably from Moonblast Special Attack drops, as Empoleon often switches into Fezandipiti and Gardevoir. Modest is used given Empoleon has great natural bulk without much investment, giving it more wallbreaking power without offsetting the defensive utility it has. The EV spread provided covers a few relevant defensive and offensive benchmarks. The defensive investments allow Empoleon to survive Hippowdon's Earthquake after taking Stealth Rock damage, Conkeldurr's Mach Punch after taking one layer of Spikes damage, and Salamence's Earthquake after taking one layer of Spikes damage. Offensively, Empoleon threatens to 2HKO Assault Vest Cyclizar with Ice Beam after it takes Stealth Rock damage, 2HKO Slowbro with Grass Knot, and has a favorable roll to OHKO both Hippowdon and Palossand with Surf after they take Stealth Rock damage. The Speed investment allows Empoleon to outspeed Adamant Conkeldurr. Tera Fairy flips its Fighting weakness into a resistance while also making Electric- and Ground-type attacks neutral, allowing Empoleon to stay in against Krookodile and Thundurus if needed.</p> <p>Offensive Empoleon fits on balance and bulky offense teams, as it pivots into many of the special attackers in the tier and provides an immediate offensive response. Strong Fighting- and Ground-types like Conkeldurr, Galarian Zapdos, Krookodile, and Mienshao appreciate Empoleon switching into Fairy- and Water-type attacks, namely from Basculegion-F and Gardevoir. Offensive Empoleon fits well on teams that can use alternative entry hazard setters like Hippowdon and Jirachi so that it can maximize its offensive presence. Defensive teammates like Levitate Galarian Weezing and Noivern can switch into to Ground- and Fighting-type attacks while removing entry hazards and pivoting. Physical setup Pokemon like Swords Dance Mienshao, Revavroom, and Terrakion benefit from Empoleon being able to take on Slowbro and other bulky Water-types. Magnet Pull Magnezone can partner with Empoleon to trap and eliminate Steel-type Pokemon like opposing Empoleon and Jirachi, two of the better defensive checks to offensive Empoleon. Salamence is an excellent teammate for Empoleon, as it can threaten to hit most of the metagame with its excellent mixed offensive attacks and provide another bulky defensive presence with reliable recovery. Sticky Web setters like Araquanid and Galvantula can partner with and enable offensive Empoleon, as it outspeeds Adamant Overqwil, Adamant Revavroom, and Jolly Bisharp after they get slowed down.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Specially defensive Empoleon is among the best utility Pokemon in the metagame for its capacity to counter most special attackers, establish entry hazards, remove items, and phaze setup attempts. Roost allows Empoleon to remain healthy enough to switch in against the strong special attackers like Basculegion-F, Gardevoir, and Gengar multiple times throughout a game. Flip Turn can be used to gain switch momentum after switching into an attack, allowing teammates to position into whatever enters the field against Empoleon. Knock Off provides excellent utility in the form of item removal, namely Heavy-Duty Boots, allowing entry hazard damage to rack up as Empoleon forces multiple switches by absorbing attacks. Roar provides similar utility in accruing entry hazard damage while stopping setup attempts from the likes of Calm Mind Cresselia, Slowbro, and Reuniclus. Ice Beam gives Empoleon coverage to hit the Grass- and Dragon-types in the tier like Chesnaught, Cyclizar, Noivern, and Salamence. Leftovers ensures Empoleon can recover off damage taken from entry hazards and switching into special attackers. Competitive gives Empoleon a needed Special Attack boost when activated by Moonblast drops from Fezandipiti and Gardevoir, Intimidate from Krookodile and Salamence, and Defog from Galarian Weezing and Noivern, making even bulky utility sets capable of outputting good damage. Being a Defog deterrent gives Empoleon an advantage in maintaining hazards, as the notable Defog users often struggle to deal with its coverage, especially after a boost from Competitive. A Calm nature with full investment in HP and Special Defense makes Empoleon seemingly impervious to damage from special attacks. Tera Fairy flips the critical weakness to Fighting into a resistance, allowing it to not be as threatened by the likes of Chesnaught, Mienshao, Slither Wing, and Terrakion, while also flipping the Ground and Electric weaknesses into neutrality, making Krookodile and Thundurus much less imposing. Tera Ghost similarly helps with the litany of Fighting-types prevalent in the metagame and gives Empoleon a valuable immunity to Rapid Spin attempts from the primary form of removal in Cyclizar.</p> <p>Empoleon is a staple on balance and bulky offense teams needing to shore up their matchups into the strong special attackers in the tier, a stalwart Steel-type that can establish entry hazards, and another form of item removal or phazing. With access to Roost, Empoleon has instant and reliable recovery, unlike other Steel-types like Jirachi and Hisuian Goodra. Choice Scarf Basculegion-F, Gardevoir, and Gengar pose many problems for Fighting-type breakers like Galarian Zapdos, Conkeldurr, and Mienshao, making Empoleon an excellent choice to support them through defensive switch-ins and subsequent pivots with Flip Turn. Physically defensive teammates that can absorb Fighting- and Ground-type attacks from Krookodile, Slither Wing, and Terrakion like Galarian Weezing, Amoonguss, and Chesnaught are excellent in creating cores that can cause issues for opposing teams, accumulating entry hazard damage and whittling teams down. Chesnaught benefits from Empoleon handling the main forms of removal in the metagame, such as Cyclizar with Ice Beam and Noivern and Galarian Weezing due to Competitive, forming a strong defensive pairing that can remove Heavy-Duty Boots with Knock Off and rack up hazard chip. Slower teammates such as Conkeldurr and Crawdaunt that appreciate Empoleon's ability to sponge special attacks and safely pivot into them can assist in removing items and breaking teams through forcing multiple switches and hitting very hard into Empoleon checks like Cyclizar, Hisuian Goodra, and Jirachi. The combination of Water and Steel gives Empoleon favorable matchups into rain abusers like Basculegion-F and Kingdra, making physically defensive teammates like Amoonguss, Bellibolt, and Chesnaught, which also functions as a Knock Off absorber for Empoleon, valuable for their ability to switch into Barraskewda. Empoleon can gradually get worn down by hazard chip itself, making teammates that can pivot and maintain hazard control like Cyclizar and Noivern excellent partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 555741, "username": "MachJacob"}, {"user_id": 598717, "username": "Sneakyplanner"}, {"user_id": 231398, "username": "feen"}, {"user_id": 513635, "username": "Rarelyme"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Gastrodon": {"sets": {"Defensive": {}}},
  "Lucario": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Nasty Plot": {}}},
  "Hippowdon": {
    "overview": "<p>Hippowdon is one of the best physical walls in the tier, excelling thanks to its high base HP and Defense as well as the difficult to break pure Ground typing. Hippowdon has the best raw physical bulk compared to other physical walls such as Slowbro, Chesnaught, and Amoonguss. This bulk allows it to take neutral hits exceptionally well, making it a safe switch-in to unresisted moves like Terrakion’s Close Combat and Galarian Zapdos’s Brave Bird. As it is taking these hits, it is wearing foes  down through passive damage from the sand it summons. It also has many chances to switch in, giving it plenty of opportunities to set up Stealth Rock. Hippowdon is the anchor for most balance teams in the tier, putting in work and making progress in basically every game. However, Hippowdon can struggle with particularly strong wallbreakers like Choice Band Mienshao or Galarian Zapdos because it does not resist their STAB attacks and struggles to take them effectively, and it is also vulnerable to passive damage such as entry hazards.</p>",
    "comments": "<h3>Other Options</h3> <p>Certain teams such as ones with Pokemon running Synthesis or that have teammates that dislike passive sandstorm chip such as Alolan Muk and Suicune would prefer Sand Force, effectively giving it no ability. Sand Force also makes it easier to Terastallize Hippowdon, since it doesn’t have to worry about its own sandstorm and has a better matchup into other Hippowdon due to its stronger Earthquake. Hippowdon can also run varying amounts of Special Defense in order to better match up against special attackers — for example, 140 Special Defense EVs to survive two Photon Geysers from Necrozma  — but Hippowdon often relies on maximum physical bulk to take neutral physical attacks.</p> <h3>Checks and Counters</h3> <p><strong>Ground-immune Pokemon</strong>: Mono-Earthquake Hippowdon is unable to hit Ground-immune foes at all, making Rotom-H, Thundurus, Salamence, and Noivern incredibly safe switch-ins to it.</p> <p><strong>Grass-types</strong>: Hippowdon with Stone Edge can hit Ground-immune foes but can't do any real damage to Grass-types such as Chesnaught.</p> <p><strong>Special Attackers</strong>: Hippowdon's low Special Defense and reliance on Defense investment means it is vulnerable to special attacks even from uninvested attackers. Pokemon like Gengar and Gardevoir are attackers that Hippowdon does not want to switch in on, and bulky Pokemon with decent special damage such as Slowbro and Reuniclus are able to take Hippowdon's Earthquakes and threaten it in return.</p> <p><strong>Wallbreakers with Entry Hazard Support</strong>: Pokemon like Choice Band Krookodile, Terrakion, and Mienshao can overcome Hippowdon's raw physical bulk with the help of chip damage such as hazard support. Mienshao can for instance get a guaranteed 2HKO on Hippowdon with Close Combat and one layer of Spikes.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<h4>Set Details</h4> <p>The tier is full of threatening physical attackers, and Hippowdon handles most of them with ease, switching into attacks from Pokemon like Terrakion, Revavroom, Kleavor, Krookodile, Maushold, and Bisharp. Hippowdon's sand provides passive damage and helps disarm other weather teams by removing their weather. Stealth Rock is the most common option, as Hippowdon makes a good setter due to its many chances to switch in and good matchup against Cyclizar, the tier's best spinner. Whirlwind gives Hippowdon the option to force out setup sweepers or rack up chip damage against foes trying to switch into Earthquake. Whirlwind is preferred over Roar due to Throat Chop Bisharp blocking the latter move. Stone Edge is a coverage  option to hit Flying-types trying to switch into the normally passive Hippowdon, allowing it to turn the tables on matchups like Thundurus or Noivern. Stone Edge also helps to break Air Balloon on Pokemon such as Revavroom that try to turn Hippowdon into a setup opportunity. Rocky Helmet is the most common item due to its importance in dealing with Maushold, a Pokemon that can otherwise threaten to sweep teams on its own, while also providing chip damage against physical attackers. However, teams with other answers to Maushold or that don’t need the passive damage can instead run Leftovers or Heavy-Duty Boots. Tera Ghost is an all-around strong defensive type that blocks Rapid Spin from Cyclizar, allows it to take on Terrakion even after a Swords Dance boost, and beats other Fighting types like Conkeldurr and Slither Wing. Tera Dragon removes Hippowdon's weaknesses to Grass and Water, being especially helpful against rain teams. Tera Poison gives Hippowdon a resistance to Grass, Fairy, and Fighting and makes Hippowdon immune to Toxic and able to absorb Toxic Spikes, being useful on teams that are otherwise weak to them.</p> <p>Hippowdon is common on bulky offense and balance teams. However, Hippowdon’s weaknesses must be accounted for in teambuilding, especially when considering the set it runs. Whirlwind Hippowdon needs to be paired with something that can handle Ground immune Pokemon like Noivern, Thundurus, and Rotom-H well. Assault Vest Cyclizar and Rotom-H are two Pokemon that can safely switch into them. While Hippowdon is able to switch into strong Fighting-type attacks from Pokemon like Terrakion and Mienshao when fully healthy, it loses this resilience with even just a little bit of chip damage. Therefore, Hippowdon should be paired with a more sturdy Fighting resistant Pokemon such as Slowbro or Reuniclus. Hippowdon without Whirlwind may require extra support for physical setup sweepers. Choice Scarf users faster than Salamence, such as Mienshao, Terrakion, Gengar, and Hisuian Zoroark, can all fill this role. Non-Stealth Rock Hippowdon should be paired with another Stealth Rock setter such as Empoleon or Jirachi.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598717, "username": "Sneakyplanner"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Toxicroak": {"sets": {"Swords Dance": {}}},
  "Magnezone": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Magnezone is a high-voltage wallbreaker that takes advantage of the lack of special tanks in RU to blast holes in teams. Volt Switch lets it keep momentum flowing against switch-ins like Hisuian Goodra, Wo-Chien, and Umbreon. Tera Blast Grass targets Hippowdon, Tera Blast Ground hits opposing Magnezone, and Tera Blast Water helps against Entei. Analytic lets Flash Cannon OHKO Krookodile and gives it a chance to OHKO Hippowdon after Stealth Rock damage while also amping up Volt Switch to chip down switch-ins. Magnet Pull is used to trap Empoleon, Jirachi lacking U-turn, and Choice-locked Hisuian Goodra, enabling Magnezone to remove those checks for its teammates. Tera Grass lets Magnezone OHKO many Ground-types such as Hippowdon and Gastrodon while resisting Ground-type moves like Earthquake, making it able to revenge kill Pokemon like Krookodile and Flygon. Tera Ground is useful on Magnet Pull sets to let it OHKO Hisuian Goodra, Bisharp, and opposing Magnezone. Tera Water is the more defensive Tera type, letting Magnezone resist Volcanion's STAB moves and Armarouge's Fire-type STAB moves and OHKO them back with Thunderbolt while still giving it a way to OHKO Ground-type switch-ins like Hippowdon.</p> <p>Magnezone fits well on balance and bulky offense teams and can be a strong member of a VoltTurn core alongside pivots like Cyclizar, Galarian Zapdos, and Noivern. Magnet Pull sets enable Dragon-type attackers like Salamence and Hisuian Goodra and Fairy-type attackers like Gardevoir to fire off powerful attacks after the opponent's Steel-type check has been trapped and eliminated. Ground-immune Pokemon are natural pairings with Magnezone, as they are able to switch into Earthquake from Hippowdon and Krookodile. Galarian Zapdos, Noivern, and Galarian Weezing fit that role and are also able to take resisted Fighting-type attacks from Mienshao and Conkeldurr for Magnezone. Defensive Grass-types, like Chesnaught and Wo-Chien, take little damage from Earthquake and can force out Ground-types. Cyclizar and Slowbro are able to switch into Fire-type attacks from Armarouge and Volcanion, which look to revenge kill Magnezone. Will-O-Wisp Galarian Weezing, Will-O-Wisp Slither Wing, and Scald Slowbro can all threaten to burn physical attackers like Krookodile and Mienshao that threaten to OHKO Magnezone. Pivot partners like Noivern, Cyclizar, and Galarian Zapdos can use U-turn to let Magnezone safely enter the field and threaten checks like Galarian Weezing and Fezandipiti. Ground-types like Krookodile and Hippowdon can set Stealth Rock to chip down checks to Magnezone like Umbreon and Wo-Chien, while Magnezone threatens Flying- and Water-types like Thundurus and Suicune. They also can switch into the Steel-types that wall Magnezone like Hisuian Goodra, threatening them out with Earthquake. Analytic Magnezone punches holes in defensive Pokemon like Slowbro, Fezandipiti, and Chesnaught, allowing sweepers like Armarouge, Galarian Zapdos, and Choice Scarf Basculegion to clean up weakened teams.</p>"
      },
      "Assault Vest": {
        "description": "<p>Assault Vest Magnezone uses its typing that is filled with key resistances to keep in check many of RU's special attackers and walls, such as Gardevoir, Jirachi, and Galarian Weezing, and turn them into opportunities to fire off its Analytic-boosted STAB moves. Discharge is chosen over Thunderbolt for the increased paralysis chance, as Magnezone will find many opportunities to enter the field and get a shot at paralyzing the foe. Body Press targets the would-be answers Hisuian Goodra, Chansey, and Assault Vest Cyclizar for a super effective hit on their weaker Defense stat; it is also coverage for opposing Magnezone. Tera Blast allows Magnezone to bait out and KO specific Pokemon that might otherwise cause trouble for its teammates. Tera Blast Flying hits Amoonguss and Wo-Chien, Tera Blast Water targets Armarouge, and Tera Blast Fairy nails the many Fighting- and Dragon-type Pokemon in the tier like Conkeldurr and Salamence. Mirror Coat can surprise Pokemon such as Armarouge, Focus Blast Thundurus, and Focus Blast Gengar attacking into Magnezone to KO them back, though it is prediction-reliant. Analytic is used over Magnet Pull, since the Steel-types of the tier either ignore it thanks to their access to pivoting moves or by trading damage well against Magnezone, so the added damage given by Analytic is preferred. Tera Flying turns Magnezone's Ground weakness into an immunity, so Magnezone can stay in against common foes with Ground-type coverage, such as Hippowdon, Krookodile, Revavroom, and Yanmega. It also turns its Fighting weakness into a resistance to retaliate against the likes of Galarian Zapdos and Slither Wing and removes its Fire weakness to help out against Armarouge and Volcanion. Tera Water turns Magnezone into a sturdy switch-in to the Water- and Fire-type attackers of the tier such as Volcanion and Basculegion-F. Tera Fairy is a fantastic defensive typing that grants a resistance to Fighting-type attacks and, unlike Tera Flying, does not give a Stealth Rock weakness. Tera Blast Fairy helps against key matchups such as Bisharp and Mienshao that carry moves that otherwise threaten Tera Flying Magnezone. 136 Speed EVs are needed to outspeed Adamant Conkeldurr. 88 HP EVs coupled with 76 Special Defense EVs guarantees that Magnezone can take an Armor Cannon from Timid Armarouge and retaliate.</p> <p>Magnezone fits well on offense and balance teams looking for a Steel-type Pokemon with great offensive pressure and a pivoting option. It can also bait in key targets and, depending on the fourth move it picks, heavily weaken them and allow a teammate to wreak havoc after their check was taken care of by Magnezone. Examples of this include picking Body Press to hit Hisuian Goodra and help Armarouge getting past it or picking Tera Blast Fairy to KO Cyclizar, allowing Gengar to fire off strong Shadow Balls freely. A VoltTurn core can be formed with the likes of Noivern and Gligar, which can take the Fighting- and Ground-type attacks targeted at Magnezone; in return, Magnezone can handle their counters, such as Choice Scarf Gardevoir and Galarian Weezing, respectively. Magnezone will often force Fighting-weak Pokemon such as Cyclizar, Hisuian Goodra, and Umbreon in to tank Volt Switch, so Fighting-type wallbreakers like Galarian Zapdos and Conkeldurr appreciate having a free entry point and threaten those switch-ins. As a slow offensive Pokemon, Magnezone loves paralysis support from the likes of Thunder Wave Slowbro and Stun Spore Slither Wing. Slowbro and Hippowdon are some of the sturdiest physical walls in the tier and help in providing a safe switch-in to physical wallbreakers, such as Galarian Zapdos and Mienshao, that can easily take out Magnezone. Armarouge and Volcanion are extremely dangerous Pokemon that also threaten Magnezone greatly, so Pokemon such as Umbreon, Hisuian Goodra, and Krookodile are great teammates that help play around those threats. Talonflame and Galarian Weezing both absorb Fighting- and Ground-type attacks for Magnezone and can use Defog to remove the Spikes that prevent Magnezone from entering the field to accomplish its pivoting role many times.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574067, "username": "Freya"}, {"user_id": 614438, "username": "fluff!!"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 513635, "username": "Rarelyme"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Yanmega": {
    "overview": "<p>Yanmega is a Speed Boost setup sweeper with all of the tools necessary to break through even the sturdiest of teams. With Bug Buzz and Throat Spray, it is most threatening when it can position itself to come in and KO a weakened foe, allowing it to rack up a Special Attack and Speed boost in one turn. As one of the few offensive staples that can reliably use Protect, Yanmega is enormously difficult to revenge kill, as it can use Speed Boost to outpace even the fastest Pokemon in the metagame, like Choice Scarf users Gengar and Hisuian Zoroark and Swift Swim sweepers like Barraskewda and Basculegion-F. Using its STAB attacks isn't enough, however, as Yanmega notably struggles to break through Steel-type Pokemon like Empoleon and Hisuian Goodra, though this is circumvented by using Terastallization. Tera Ground gives Yanmega the attacking coverage to hit the entire metagame for at least neutral damage while also removing its 4x weakness to Stealth Rock damage. Without Terastallization, Yanmega struggles to break many of the defensive staples in the metagame, like Empoleon, Fezandipiti, and Jirachi. This 4x weakness does limit Yanmega significantly as a setup sweeper, though it has the bulk needed to survive most priority attacks like Aqua Jet from Barraskewda and Sucker Punch from Bisharp.</p>",
    "comments": "<h3>Other Options</h3> <p>Tera Electric allows Yanmega to KO Pokemon like Basculegion-F and Talonflame at the cost of struggling to break through Hisuian Goodra and Fezandipiti. Heavy-Duty Boots is a consideration for bulkier team structures, allowing Yanmega to enter the field multiple times while still functioning as a competent late-game cleaner.</p> <h3>Checks and Counters</h3> <p><strong>Phazing</strong>: Yanmega relies on Throat Spray to give it the Special Attack boost it needs to function as a late-game cleaner, so Pokemon like Red Card like Mimikyu can force it out and prevent it from wreaking havoc. Dragon Tail Cyclizar and Hisuian Goodra and Roar Empoleon similarly force out Yanmega and, with Stealth Rock support, can prevent it from returning safely.</p> <p><strong>Trace and Imposter</strong>: Choice Scarf Gardevoir is an excellent anti-offense Pokemon, notably using Trace to copy Speed Boost from Yanmega and being able to revenge kill it comfortably, as Yanmega does not threaten to OHKO it back even after a Throat Spray boost. Ditto similarly takes advantage of Yanmega's own boosts to threaten a reverse sweep against offensive structures.</p> <p><strong>Stealth Rock</strong>: Yanmega struggles to enter the field, as it takes significant damage from Stealth Rock, which can be difficult for offensive structures relying on Maushold to remove against setters like Hippowdon. Pokemon like Cyclizar and Hisuian Goodra can take a hit from Yanmega and phaze it, which is enough to prevent it from coming back in, and priority users like Bisharp and Entei threaten to revenge kill it after one round of Stealth Rock damage.</p>",
    "sets": {
      "Speed Boost Sweeper": {
        "description": "<h4>Set Details</h4> <p>Speed Boost Yanmega functions as a nearly unstoppable late-game cleaner, taking advantage of Terastallization to maximize its potency. Bug Buzz is an excellent move for Yanmega, as it activates Throat Spray, which gives an immediate boost to Special Attack while outputting damage. Tera Blast Ground is a great move for Yanmega, giving it the capacity to break through Steel-types like Empoleon, Hisuian Goodra, and Registeel and bulky Poison-types like Fezandipiti and Slowbro. Protect gives Yanmega the ability to scout for opposing Terastallization attempts and accrue Speed boosts while also preventing Slither Wing's First Impression from taking it out post-Terastallization. Tera Ground provides Yanmega with the offensive coverage needed to hit nearly the entire metagame while also eliminating its 4x weakness to Stealth Rock damage. Tera Ground is also useful for preventing Sand Stream Hippowdon from using weather chip damage to take it out and Thunder Wave from Prankster Thundurus.</p> <p>Offense and hyper offense structures use Yanmega to clean games after the mid-game breakers do their part. Maushold is a notable offensive teammate for Yanmega, as it can remove entry hazards with Tidy Up. Armarouge and Thundurus are special setup sweepers that pair well with Yanmega, often forcing Steel-type Pokemon like Hisuian Goodra and Registeel to take damage during games that Yanmega can capitalize on to break through them later. Teams that use pivot options such as Mienshao and Slither Wing can take advantage of incoming physical walls like Amoonguss, Chesnaught, and Slowbro to give Yanmega the turn it needs to activate Throat Spray and accrue its first Speed boost. Cyclizar and Noivern are hazard removal options for bulkier teams that can similarly provide pivots for Yanmega. Froslass and Terrakion are excellent offensive leads that can establish hazards to chip at Pokemon that Yanmega can struggle to break, like Cyclizar and Suicune.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 513635, "username": "Rarelyme"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Porygon-Z": {"sets": {"Agility": {}}},
  "Gallade": {"sets": {"Swords Dance": {}}},
  "Froslass": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Spikes Lead": {}}},
  "Rotom-Heat": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Rotom-Mow": {"sets": {"Nasty Plot": {}}},
  "Azelf": {"sets": {"Expert Belt": {}, "Choice Scarf": {}, "Offensive Stealth Rock": {}}},
  "Cresselia": {"sets": {"Bulky Calm Mind": {"description": "<p>136 Speed EVs allows Cresselia to outspeed Modest Volcanion.</p>"}, "Fast Calm Mind": {"description": "<p>216 Speed EVs with Timid Nature allows Cresselia to outspeed Max Speed positive nature Hoopa-Unbound.</p>"}}},
  "Conkeldurr": {
    "overview": "<p>Conkeldurr menaces the metagame with nigh unparalleled breaking power and late-game cleaning potential. In a tier with a plethora of Fighting-types to choose from, such as Slither Wing, Galarian Zapdos, and Terrakion, Conkeldurr stands out because of its access to priority in Mach Punch and resilience to status, making defensive counterplay limited. Although it relies on a status affliction that wears it down gradually to reach these heights, Conkeldurr functions as a sturdy and reliable wallbreaker that can blow holes through teams with boosted Facade and Close Combat. Bulk Up variants of Conkeldurr are difficult to take down, taking advantage of its enormous HP stat and utilizing Drain Punch for recovery. Despite a low Speed stat rendering it more difficult to maneuver than other Fighting-type wallbreakers, Conkeldurr is fast enough and potent enough to warrant consideration on many team structures. A significant factor keeping Conkeldurr from being the consensus choice for teams as a wallbreaker is its generally slow Speed tier and the rate at which it can be worn down through burn damage and entry hazard chip.</p>",
    "comments": "<h3>Other Options</h3> <p>Defog Conkeldurr is a last-ditch entry hazard removal option for offensive teams that struggle to fit the standard hazard control options. Bulk Up is an exceptional setup move for Conkeldurr that opt for Leftovers over Flame Orb, improving longevity at the cost of immediate damage output.</p> <h3>Checks and Counters</h3> <p><strong>Entry Hazards and Rocky Helmet</strong>: Conkeldurr struggles to retain health due to burn chip damage, and any damage accumulated by entry hazards exacerbates this issue further. Teams that can maintain Stealth Rock and a Spikes layer with hazard setters like Chesnaught, Hippowdon, and Gastrodon force significant damage against Conkeldurr every time it enters the field, making it easier to revenge kill with faster Pokemon like Fezandipiti, Gardevoir, and Thundurus. Rocky Helmet users like Amoonguss, Chesnaught, and Hippowdon give Conkeldurr problems, as it takes recoil damage and accelerates its knockout.</p> <p><strong>Faster Wallbreakers</strong>: After Conkeldurr claims a KO, faster wallbreakers and setup sweepers like Armarouge, Salamence, and Yanmega can take advantage of the free entry point to threaten to revenge kill Conkeldurr, giving them an opportunity to set up on a switch. Similarly, Volcanion and Choice item wallbreakers like Galarian Zapdos and Slither Wing can take the turn to threaten strong STAB attacks on Conkeldurr's team.</p>",
    "sets": {
      "Flame Orb": {
        "description": "<h4>Set Details</h4> <p>Flame Orb Conkeldurr is among the best wallbreakers in the metagame, taking advantage of Guts to elevate its enormous Attack stat to practically unwallable levels. Facade, boosted by Guts and Flame Orb, dishes out enormous damage to bulky Fighting-resistant Pokemon like Amoonguss and Slowbro. Drain Punch can be used to give Conkeldurr improved longevity, as it gets worn down by its burn. Knock Off helps break through Ghost- and Psychic-types like Palossand and Slowbro, removes Rocky Helmet from common checks like Chesnaught and Hippowdon, and is generally a safe attack to use for item removal that enables entry hazard chip damage to accrue. Mach Punch is used to revenge kill setup sweepers like Bisharp, Revavroom, and Terrakion if they're in KO range. Flame Orb is a necessary evil to activate Guts, though it does prevent Conkeldurr from getting paralyzed and allows it to function as a status absorber and Knock Off switch-in after activation if needed. 164 Speed EVs are used to outspeed the likes of Chesnaught, Umbreon, and Galarian Weezing. Tera Steel flips the weaknesses to Fairy-, Flying-, and Psychic-type attacks into important resistances, giving Conkeldurr the needed defensive utility to take out some of its own checks like Fezandipiti, Galarian Zapdos, and Gardevoir. It does, however, make Fighting-types like opposing Conkeldurr, Chesnaught, and Slither Wing more difficult to match up against. Tera Normal similarly has defensive value in removing all of Conkeldurr's weaknesses, with the offensive boost to Facade enabling Conkeldurr to push past any defensive wall in the metagame, notably being able to 2HKO Chesnaught, Slowbro, and Galarian Weezing.</p> <p>Balance and bulky offense teams appreciate Conkeldurr's ability to break through walls and assert dominant offensive pressure, as well as shoring up the matchup against offensive structures with strong priority in the form of Mach Punch. While Conkeldurr has great natural bulk, it does struggle to maintain health, as it gets worn down by burn and affected by entry hazard damage, so teammates that can remove hazards and give it safe entry points by pivoting, like Cyclizar and Noivern, are appreciated immensely. Fezandipiti can similarly give Conkeldurr safe entry points and serves as a defensive partner that can absorb the Fairy-type attacks thrown at it from the likes of opposing Fezandipiti and Galarian Weezing. Steel-type teammates like Jirachi and Assault Vest Magnezone are capable of taking Fairy-, Psychic-, and Flying-type attacks from threats like Gardevoir and Noivern and providing additional pivot support. Offensive structures can use Conkeldurr as a mid-game wallbreaker to free up late-game setup sweepers, like Maushold and Mimikyu, that struggle to break through defensive walls like Amoonguss, Chesnaught, and Galarian Weezing, all of which find it difficult to wall Conkeldurr despite their hefty physical bulk. Reuniclus, Slowbro, and Thundurus are notable teammates that can use Thunder Wave to spread paralysis, slowing down the opposition enough to allow Conkeldurr to outpace and blow through most of the unboosted metagame. Wish support from teammates like Jirachi and Umbreon can provide additional healing to offset the damage Conkeldurr accrues through hazard chip and burn damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Lilligant-Hisui": {"sets": {"Victory Dance": {}}},
  "Krookodile": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Krookodile is a ferocious wallbreaker with its nearly unresisted STAB combination of Earthquake and Knock Off. It is difficult to consistently weather Krookodile's attacks due to its resistance to Stealth Rock and serviceable natural bulk combined with Intimidate giving it many opportunities to hit the field against Pokemon such as Rotom-H, Necrozma, and Reuniclus. Gunk Shot gives Krookodile great coverage, hitting common checks to it like Chesnaught, Slither Wing, and Galarian Weezing for decent damage. Close Combat gives Krookodile the ability to annihilate Dark-types like Umbreon and opposing Krookodile. Crunch can be used to consistently hit Pokemon such as Slowbro and Salamence once their item has been removed. Tera Dark allows for freakishly powerful Dark-type STAB moves, allowing it to OHKO Slowbro with a boosted Knock Off or Crunch after Stealth Rock and 2HKO Amoonguss with Knock Off. It also gives Krookodile the ability to shed its Ground typing, removing its Water- and Grass-type weaknesses and improving matchups into Pokemon such as Amoonguss and Choice Scarf Basculegion-F. Alternatively, Tera Poison can be used to flip its Bug- and Fighting-type weaknesses, giving it better matchups into Pokemon such as Slither Wing and Terrakion. It also strengthens Gunk Shot, allowing Krookodile to completely crush its common checks like Chesnaught and Slither Wing while also dealing very good damage to Galarian Weezing.</p> <p>Krookodile thrives on bulky offense and balance teams where it acts as a wallbreaker that provides defensive utility due to its Electric and Psychic immunities. Krookodile fits well with pivots that allow it to freely switch in without taking any sort of damage such as Magnezone, Noivern, and Fezandipiti, since it lacks recovery. Fezandipiti is a particularly good teammate, as it can lure in and pivot out of Steel- and Poison-type Pokemon like Bisharp, Jirachi, Hisuian Goodra, and Gengar, allowing Krookodile to come in and threaten them with its strong Knock Off and Earthquake. Slowbro pairs well with Krookodile, as it resists the Fighting- and Water-type attacks from Pokemon like Mienshao and Barraskewda aimed at Krookodile, while Krookodile resists the Electric- and Ghost-type attacks from Thundurus and Gengar aimed at Slowbro. Slowbro also spreads paralysis with Thunder Wave, which Krookodile greatly appreciates, as it is slower than most of the unboosted metagame. Future Sight support from Slowbro and Reuniclus can threaten the Poison- and Fighting-types such as Slither Wing, Galarian Weezing, and Chesnaught that switch into Krookodile. Krookodile enjoys entry hazard control from the likes of Cyclizar, Noivern, and Galarian Weezing due to its vulnerability to Spikes. The former two are also pivots that invite in Steel-types for Krookodile, while Galarian Weezing is a great defensive presence capable of switching into a plethora of strong attackers such as Slither Wing, opposing Krookodile, and Mienshao. Balance teams that slowly whittle down the opposition, especially with Spikes support from the likes of Chesnaught and Quagsire, enjoy Krookodile's unique defensive profile as well as strong STAB Knock Off to remove the ever-present Heavy-Duty Boots and Leftovers. Bulky offense teams with multiple switch moves like Volt Switch and U-turn from Pokemon like Thundurus, Fezandipiti, and Jirachi provide Krookodile with many entry points, capitalizing on its offensive and defensive utility to maintain hazards and wear down teams.</p>"
      },
      "Stealth Rock": {
        "description": "<p>Krookodile solidifies its place in the metagame as the premier offensive Ground-type, with access to Stealth Rock and Intimidate giving it great utility for an offensive Pokemon. Krookodile has advantages over other Ground-type entry hazard setters like Flygon and Hippowdon because of its combination of good Speed and access to Knock Off, which helps accumulate hazard chip by removing Heavy-Duty Boots from checks such as Salamence and Slowbro. Taunt helps Krookodile disrupt slower Pokemon trying to setup on it like Air Balloon Revavroom and Gyarados while also being used to prevent other Pokemon like Hippowdon and Galarian Weezing from setting up hazards and using status moves. Gunk Shot helps against switch-ins that would otherwise resist its STAB moves, hitting Chesnaught for super effective damage and Levitate Galarian Weezing for neutral. Leftovers is preferred on Krookodile to passively recover on Pokemon it forces out, giving it more longevity and offsetting Stealth Rock damage. Tera Poison flips the weaknesses to Bug, Fairy, and Fighting into valuable resistances while giving Gunk Shot a STAB boost. Resisting Bug- and Fighting-type attacks is great for Krookodile, allowing it to resist First Impression from Slither Wing and take on Fighting-type Pokemon faster than it such as Galarian Zapdos and Mienshao. Tera Ghost similarly flips the weaknesses to Bug and Fighting, and allows Krookodile to block Rapid Spin from the tier’s most common hazard removal, Cyclizar.</p> <p>Stealth Rock Krookodile fits on balance and bulky offense teams that appreciate having a more offensive entry hazard setter that is able to force progress with Knock Off, stack hazard chip damage on Heavy-Duty Boots users, and threaten common hazard removal options like Cyclizar, Galarian Weezing, and Noivern. Krookodile appreciates teammates that can switch into super effective attacks from Pokemon trying to revenge kill it like Choice Scarf Gardevoir, Galarian Zapdos, Mienshao, and Slither Wing, and defensive switch-ins that threaten it like Amoonguss, Chesnaught, and Galarian Weezing. Steel-types  such as Empoleon and Jirachi make for good teammates, resisting Fairy-type attacks from Gardevoir and Fezandipiti that would otherwise threaten Krookodile. Empoleon also covers its Water-type weakness, and Jirachi appreciates having a teammate that can take Dark-type moves for it. Jirachi relies on Covert Cloak users like Slowbro and Fezandipiti getting their item removed to capitalize on its paralysis and flinch chances with Body Slam and Iron Head, respectively. Galarian Weezing is a great teammate for Krookodile, being able to take on Bug- and Fighting-type attacks from Slither Wing, Terrakion, and Mienshao, while threatening back with Strange Steam and Will-O-Wisp, while Krookodile can take on Psychic-type attacks from Reuniclus and Necrozma that threaten Galarian Weezing. Offensive teammates such as Volcanion and Thundurus benefit from Krookodile removing Assault Vest from their most common switch-in, Cyclizar. Volcanion appreciates Krookodile removing Heavy-Duty Boots from Noivern and Salamence, limiting their ability to switch into it.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Krookodile can fill many roles in a match; it can revenge kill weakened foes, force progress against bulky teams with Knock Off, switch into attacks that it resists to threaten slower foes with a KO, and clean up teams weakened by its teammates. Gunk Shot threatens Grass-types like Wo-Chien and Chesnaught and can poison Slowbro, which is otherwise able to check Krookodile once its item is removed. Stone Edge hits Flying-types like Noivern and Salamence hard and has a chance to OHKO Thundurus. Close Combat can OHKO Cyclizar and provides strong coverage for opposing Krookodile, Wo-Chien, and Crawdaunt. Stealth Rock allows Krookodile to be an entry hazard setter, letting more offensive teams forgo a more defensive hazard setter like Hippowdon or Empoleon. Choice Scarf makes Krookodile outspeed the entire unboosted metagame and other common Choice Scarf users like Basculegion-F and Gardevoir. Intimidate lets Krookodile take hits from physical attackers like Jirachi and Salamence to force them out or revenge kill them. Moxie lets Krookodile be a late-game cleaner and sweeper that makes sacrificing Pokemon to bring others in much riskier for the opponent. Tera Poison lets Krookodile resist normally super effective attacks such as Grass Knot from Thundurus, Moonblast from Fezandipiti, and Close Combat from Mienshao, allowing it to score KOs it may otherwise not have and begin its sweep with Moxie boosts. Tera Poison also empowers Gunk Shot, turning it into Krookodile's strongest STAB attack. Tera Dark is an alternative that boosts Knock Off, letting it OHKO Jirachi and Reuniclus after a bit of chip damage. It also removes Krookodile's weakness to Aqua Jet from Crawdaunt and Feraligatr.</p> <p>Choice Scarf Krookodile fits on more offensive teams that are looking for a sweeper that doesn't need to take time to set up or a revenge killer that can safely switch into or force out physical wallbreakers. Krookodile can switch into predicted Electric- and Psychic-type attacks from Thundurus, Raikou, and Reuniclus and force them out, but it needs to be careful when doing so, as these Pokemon usually carry coverage moves that threaten Krookodile. Spikes stacking teams can benefit immensely from Krookodile due to its ability to get rid of Heavy-Duty Boots with STAB Knock Off and sweep a weakened opposing team with Moxie boosts. Chesnaught can take the Grass- and Water-type attacks that threaten Krookodile while also taking Knock Off handily and setting Spikes. Poison-types like Fezandipiti and Amoonguss can swap into the Fighting-, Fairy-, and Grass-type attacks that Krookodile would rather avoid while also baiting out Psychic-type attacks for Krookodile to freely switch into. Steel-types additionally can easily take the Grass- and Fairy-type attacks that threaten Krookodile, making Jirachi and Magnezone excellent partners. Krookodile is a great partner for Cyclizar, as it is able to threaten Ghost-types that come in and spinblock Cyclizar. It also synergizes with other entry hazard removers like Galarian Weezing, which has an immunity to Ground and a 4x resistance to both Fighting- and Bug-type attacks that threaten Krookodile, and Noivern, which can take Fighting-, Water-, and Grass-type attacks aimed at Krookodile while also removing hazards for it. Bulky wallbreakers like Entei and Guts Conkeldurr can threaten defensive checks to Krookodile like Slowbro and Galarian Weezing, making progress against Pokemon that it struggles with. Defensive checks to Krookodile like Hippowdon and Galarian Weezing can also be threatened by strong special attackers like Armarouge and Basculegion-F. Thundurus can threaten Slowbro and ignores Earthquake from Hippowdon while being a strong pivot with Volt Switch.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563264, "username": "Forest Guardian"}, {"user_id": 574067, "username": "Freya"}, {"user_id": 654208, "username": "Tsuki"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 555741, "username": "MachJacob"}, {"user_id": 614438, "username": "fluff!!"}, {"user_id": 598717, "username": "Sneakyplanner"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Zoroark-Hisui": {
    "sets": {
      "Nasty Plot": {},
      "Choice Specs": {
        "description": "<p>Choice Specs Hisuian Zoroark is an incredibly powerful wallbreaker that enables the art of bluffing with its signature ability Illusion and makes up for its relative frailty by naturally outspeeding most of the unboosted metagame. Tera Blast, while weaker than Hyper Voice before Terastallizing, gives Hisuian Zoroark the ability to blast through Assault Vest Cyclizar and Umbreon in conjunction with Tera Fairy. Flamethrower provides coverage for some of Hisuian Zoroark's checks like Bisharp, Wo-Chien, and Assault Vest Magnezone. Trick is a very useful and, thanks to Illusion, unpredictable move, as it allows Hisuian Zoroark to lock setup sweepers like Revavroom and Mimikyu into their setup moves and drastically decreases the effectiveness of defensive Pokemon like Hippowdon and Amoonguss. Grass Knot can be used as additional coverage to more effectively threaten bulky Ground-types such as Hippowdon and Gastrodon while also reliably OHKOing offensive Pokemon like Krookodile and Terrakion. U-turn serves as an easy escape option when it might not be wise to rely on a prediction and can be used in tandem with other U-turn pivots like Cyclizar and Galarian Zapdos to attempt to confuse the opponent with Illusion. Choice Specs supplements Hisuian Zoroark's wallbreaking power to impressive levels that can even 2HKO naturally bulky Pokemon like offensive Empoleon and Fezandipiti. Tera Ghost boosts the power of Shadow Ball to pick up important KOs on Pokemon like Revavroom, Conkeldurr, and Volcanion after some chip damage. Tera Fairy can be used to flip Hisuian Zoroark's weakness to Dark-type moves into a resistance, which is helpful for taking hits such as Knock Off from Krookodile and Galarian Zapdos and Sucker Punch from Bisharp as well as providing an immunity to Dragon-type moves such as Draco Meteor from Hisuian Goodra.</p> <p>Choice Specs Hisuian Zoroark fits best on offensive structures that appreciate its raw wallbreaking power and great Speed tier that lets it outspeed and exploit common Pokemon in the metagame like Krookodile, Jirachi, and Terrakion. Hisuian Zoroark appreciates entry hazard removal options like Cyclizar and Noivern that allow it to enter the field and attempt to blow holes in the opposing team more often. This can also help to continue disguising Hisuian Zoroark, as differences in entry hazard damage can sometimes be used to determine its identity despite Illusion. Hisuian Zoroark provides unique support to offensive Fighting-weak Pokemon such as Terrakion and Maushold, as its presence can deter Fighting-type moves from Pokemon like Galarian Zapdos and Mienshao. At the same time, physical wallbreakers like the aforementioned Terrakion and Slither Wing can threaten Hisuian Zoroark's defensive checks such as Empoleon, Hisuian Goodra, and Wo-Chien, while they themselves benefit from Hisuian Zoroark being able to lure in and heavily damage physical walls like Hippowdon and Chesnaught with the help of Illusion. Hisuian Zoroark benefits from entry hazards set by Pokemon like Hippowdon, Jirachi, and Chesnaught, as they can help chip down Pokemon like Krookodile, Galarian Weezing, and Amoonguss into guaranteed OHKO range. To support these hazard stacking cores, Hisuian Zoroark can function as a spinblocker in a pinch, though it fears Knock Off from Cyclizar.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 655207, "username": "Sir Tetris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 224685, "username": "cyanize"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Cinccino": {"sets": {"Tidy Up": {}}},
  "Reuniclus": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Calm Mind Reuniclus is a potent late-game cleaner that is difficult to break past for weakened teams. Reuniclus is unable to be dealt with through forms of passive damage such as Spikes, Toxic, and Leech Seed, which many defensive teams rely on to wear down opposing threats. While slow, Reuniclus sports good bulk when invested, allowing it to set up Calm Mind on Pokemon like Chesnaught, Cyclizar, and Slowbro that can't damage it for more than around half of its HP, as it will simply recover off the damage over time and KO them with a boosted STAB move or coverage. Tera complicates this further, as Reuniclus can flip its bad type matchups and set up on Pokemon like Krookodile and Barraskewda that are typically able to threaten it with significant damage. Powerful Pokemon holding boosting items such as Life Orb Mimikyu and Choice Specs Basculegion-F can threaten Reuniclus with strong super effective STAB moves while not being immediately KOed by Reuniclus's own relatively weak attacks before boosting. Reuniclus must also be wary of Encore and Roar from Pokemon such as Jirachi and Empoleon that can switch in and disrupt its boosting before it's strong enough to break the opposing team. Jirachi in particular can flinch Reuniclus down with Iron Head before it has a chance to use Recover. Psychic Noise is chosen as the primary STAB move to thwart both Slowbro and opposing Reuniclus's attempts to heal. It also stops faster defensive walls like Gastrodon and Empoleon from healing for a turn, either letting Reuniclus finish them off or switching to a teammate that forces them out. This keeps special walls from recovering back to full HP, letting Reuniclus outlast them and sweep. Focus Blast hits Dark-types immune to Psychic Noise like Krookodile and Bisharp while slamming Steel-types like Magnezone and Hisuian Goodra. Shadow Ball helps Reuniclus beat variations of Calm Mind Slowbro with Covert Cloak that block Psychic Noise and hits other Psychic-types like Jirachi and opposing Reuniclus. Leftovers helps reduce Reuniclus's reliance on Recover, allowing it to boost more often with Calm Mind or attack once already boosted. Rocky Helmet punishes Jirachi trying to flinch Reuniclus with Iron Head or paralyze it with Body Slam while also wearing down Pokemon with U-turn and Knock Off like Galarian Zapdos and Cyclizar that want to pivot to another teammate or remove Reuniclus's item. Due to Reuniclus having an effective immunity to status like poison, it does not need to use Tera Poison to beat Fezandipiti and Bellibolt and instead can opt for Tera Water or Fairy for their defensive value. Tera Water allows Reuniclus to resist Iron Head from Steel-type checks like Jirachi and Bisharp and rain-boosted Water-type attacks from Barraskewda and Kingdra. Tera Fairy flips Reuniclus's Dark weakness into a resistance, which is helpful for resisting strong Dark-type attacks from Pokemon like Bisharp and Krookodile. Bug-types like Yanmega and Slither Wing can be set up on once Reuniclus resists their most powerful STAB moves as well. Tera Fairy also has the additional benefit of an immunity to Dragon Tail users such as Cyclizar and Hisuian Goodra looking to phaze it out.</p> <p>Calm Mind Reuniclus offers bulky offense and balanced teams good counterplay to the residual damage of entry hazards as well as an absorber of burn and Toxic poison. For example, Reuniclus can help relieve pressure on Cyclizar to spin away entry hazards because Reuniclus itself does not care about their residual damage. This allows Cyclizar to more freely use Knock Off to remove opposing items and use U-turn to pivot out of switch-ins like Hisuian Goodra looking to take advantage of Rapid Spin. Reuniclus is a great switch-in to status spreaders like Slowbro and Galarian Weezing, and as such partners that bait in these Pokemon like Galarian Zapdos and Barraskewda that can use pivoting moves make good partners, allowing Reuniclus to enter the field and set up. Switching in on status moves like Scald is often advantageous for Reuniclus, as burn or Toxic poison prevents Reuniclus from being paralyzed by its most common check, Jirachi. Reuniclus does not appreciate losing its Leftovers to Cyclizar's Knock Off, so teammates like Slither Wing and Terrakion that can switch in on Knock Off and threaten damage on the opponent are good options. Rocky Helmet Chesnaught is another way to punish Knock Off that can set Spikes to chip down Reuniclus's checks while acting as a good check to strong physical attacking Dark-types like Crawdaunt and Bisharp that threaten Reuniclus. Specially defensive Jirachi is a thorn in Reuniclus's side regardless of its coverage option, as it can be flinched down with Iron Head and paralyzed. Basculegion-F, Thundurus, and Magnezone are strong special breakers that don't fear Body Slam paralysis or Iron Head from defensive Jirachi and thus force out the opponent's Jirachi into a teammate that must now absorb a hit from some of the most threatening special attackers in the tier. These three teammates also have pivoting moves in Flip Turn and Volt Switch, letting them choose a teammate to bring in on a predicted Jirachi switch while chipping down the opponent's switch-in in the process.</p>"
      },
      "Defensive Pivot": {
        "description": "<p>Defensive Reuniclus finds a place in a metagame lacking phenomenal Dark-types outside of Krookodile and Bisharp and with a myriad of Fighting- and Psychic- types such as Terrakion, Mienshao, Slowbro and Jirachi. Its bulk and typing allow it to continuously switch into the aforementioned Fighting- and Psychic-types' moves and weaken the opposition while staying healthy with a combination of Recover and Regenerator. It can also act as a crucial member of teams relying on paralysis that enjoy its resistance to Fighting as well as its ability to invite in the likes of Bisharp and Jirachi and cripple them with Thunder Wave. Despite being in competition with Slowbro, Reuniclus's Electric neutrality as well as higher special bulk make it sometimes worth using over Slowbro. Thunder Wave makes it easier for wallbreakers like Volcanion, Conkeldurr, and Crawdaunt to shine. Psychic Noise is used over the stronger Psychic and Psyshock due to the recovery blocking effect. Knock Off is another excellent support move that forces progress by removing the bevy of Heavy-Duty Boots and Leftovers. Focus Blast can be used over Knock Off to deal with Krookodile and Bisharp as well as smacking Empoleon. Tera Water gives Reuniclus an excellent defensive matchup against rain teams and strong Water-type attacks from offensive threats such as Barraskewda, Suicune, and Volcanion while also removing the weakness to Bug- and Dark-type attacks like U-turn and Knock Off. Tera Fairy turns the aforementioned weaknesses into resistances, gives a Dragon-type immunity against strong threats like Salamence and Noivern, and is generally a good defensive Tera type for a bulkier Pokemon like Reuniclus.</p> <p>Reuniclus fits best on balance and bulky offense teams that enjoy its ability to switch into the myriad of Fighting-type moves in the tier and slow down and soften the opposition with Thunder Wave and Knock Off, respectively. Volcanion and Crawdaunt are great offensive partners for Reuniclus, as they enjoy Reuniclus's ability to slow down the opposition. Fighting-types such as Slither Wing and Galarian Zapdos make great offensive and defensive partners for Reuniclus. On the offensive side, they enjoy Reuniclus's Thunder Wave support and its Psychic resistance, while on the defensive side they resist the omnipresent Knock Off and U-turn. Reuniclus also enjoy Palossand, Fezandipiti, Chesnaught and other Fighting-type checks due to its crippling weakness to Knock Off and U-turn. Palossand and Chesnaught are also excellent entry hazard setters and enjoy Reuniclus's Knock Off support. However, since this Reuniclus set doesn't use Magic Guard, it enjoys hazard-removing partners like Cyclizar.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563264, "username": "Forest Guardian"}, {"user_id": 599261, "username": "THE_CHUNGLER"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 224685, "username": "cyanize"}, {"user_id": 231398, "username": "feen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Amoonguss": {"sets": {"Defensive": {}}},
  "Mienshao": {
    "sets": {
      "Life Orb": {
        "description": "<p>Life Orb Mienshao is a menacing threat in the metagame, capitalizing on Regenerator to mitigate the Life Orb recoil while hammering opponents with hard-hitting attacks. Knock Off allows Mienshao to hit Ghost- and Psychic-types that attempt to switch in on Close Combat like Gengar, Armarouge, and Slowbro. U-turn helps keep up momentum by pivoting on switch-ins like Galarian Weezing, Hippowdon, and Salamence while also hitting Psychic-types such as Slowbro for super effective damage. Triple Axel hits Flying- and Grass-types like Salamence, Thundurus, and Amoonguss for super effective damage and threatens a 2HKO on Fezandipiti, which would otherwise wall Mienshao. Ice Spinner trades power for accuracy, making Mienshao more reliable in exchange for missing out on important 2HKOs on Fezandipiti and Hippowdon. Regenerator is an exceptional ability that synergizes well with Life Orb, boosting Mienshao's damage while offsetting any recoil and entry hazards damage on the switch. Tera Steel flips Mienshao's weaknesses to Fairy-, Flying-, and Psychic-type attacks into resistances, giving it great defensive utility against Fairy- and Flying-types like Fezandipiti, Choice Scarf Gardevoir, and Galarian Zapdos. Tera Steel also gives it a useful Dragon resistance that helps Mienshao against Noivern, Salamence, and Cyclizar. Tera Dark provides similar defensive utility, making Flying-type attacks neutral, giving it a key immunity to Psychic and Thunder Wave from Prankster Thundurus, and providing a STAB boost to Knock Off to OHKO Armarouge and Jirachi.</p> <p>Mienshao is an excellent pivot that can double as a wallbreaker thanks to its damage output being boosted by Life Orb and can function on bulky offense and offense teams. Mienshao appreciates entry hazard support that can help it pick up KOs it otherwise would not be able to like Amoonguss, so entry hazard setters such as Empoleon, Chesnaught, and Jirachi make for great teammates. This synergy goes both ways, as Mienshao's Knock Off can remove Heavy-Duty Boots from Pokemon like Slowbro and Fezandipiti to rack up residual damage with entry hazards. Empoleon and Jirachi are notable teammates for their ability to take on Fairy- and Psychic-type attacks from Pokemon like Fezandipiti, Gardevoir, and Slowbro. Slowbro and Reuniclus can provide Future Sight support that punishes Poison-types and physical walls attempting to wall Mienshao like Amoonguss, Galarian Weezing, and Hippowdon; in return, Mienshao threatens Dark- and Steel-types like Krookodile, Empoleon, and Jirachi that try to absorb Future Sight, all while forming strong Regenerator cores with Slowbro and Reuniclus. Mienshao can also form strong VoltTurn cores with a plethora of Pokemon such as Magnezone, Slither Wing, and Thundurus, keeping up momentum and pressuring more passive teams by forcing constant chip damage with their strong pivoting attacks. While possessing a great Speed tier, Mienshao is still very easy to revenge kill with faster Pokemon like Gengar, Noivern, Thundurus, and various Choice Scarf users Gardevoir and Galarian Zapdos, making defensive partners that can switch into these revenge killers very valuable. Steel-types such as Hisuian Goodra and Empoleon resist all of Mienshao's weaknesses, while Poison-types like Fezandipiti can take on Fairy-type attacks from Gardevoir and opposing Fezandipiti. Faster Pokemon such as Choice Scarf Gardevoir and Thunder Wave Thundurus make for great teammates that support Mienshao by providing speed control.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 654208, "username": "Tsuki"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 614438, "username": "fluff!!"}, {"user_id": 655207, "username": "Sir Tetris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Bisharp": {"sets": {"Swords Dance": {}}},
  "Terrakion": {
    "sets": {
      "Stealth Rock": {},
      "Choice Band": {
        "description": "<p>Thanks to its high Attack stat and almost unresisted STAB combination, Choice Band Terrakion makes for an excellent wallbreaker that is very difficult to switch into. Earthquake helps it deal with Poison-types such as Fezandipiti and Revavroom. Quick Attack gives it a form of priority to deal with faster, weakened Pokemon like Cyclizar and Noivern. Justified allows Terrakion to switch into Dark-type attacks and punish moves like Knock Off from Cyclizar to boost its Attack. Tera Blast paired with Tera Ghost gives Terrakion a Ghost-type move that threatens a 2HKO on bulky Psychic-types like Slowbro and Reuniclus. Tera Rock boosts Terrakion's Stone Edge even further, making it very difficult to switch into and guaranteeing a 2HKO on Slowbro. Tera Rock helps Terrakion defensively by removing its weaknesses to Fairy and Psychic and giving it a resistance to Flying-type attacks, making it much better into revenge killers like Choice Scarf Gardevoir and Talonflame. Tera Ghost also removes its weaknesses to Fairy and Psychic, but it also removes its weaknesses to Fighting and Ground, which gives Terrakion an opportunity to take out common Choice Scarf users such as Mienshao, Galarian Zapdos, and Krookodile. Tera Ghost pairs well with Justified, deterring opposing Pokemon from hitting it with super effective Dark-type attacks in fear of boosting its Attack.</p> <p>Choice Band Terrakion can fit on a plethora of balance and bulky offense teams thanks to its great Speed tier and its excellent power as a wallbreaker. Entry hazard support from Pokemon like Chesnaught, Empoleon, and Krookodile can help it pick up 2HKOs on bulky physical walls like Hippowdon and Slowbro and rack up residual damage on revenge killers like Choice Scarf Gengar and Krookodile switching in. Terrakion appreciates pivot support to get it in safely; therefore, Pokemon like Cyclizar, Fezandipiti, and Thundurus can keep up momentum by pivoting on defensive switch-ins like Empoleon and Krookodile and create opportunities for Terrakion to attack. Terrakion appreciates Future Sight support from Pokemon like Slowbro and Reuniclus, as it can use Close Combat more freely while Future Sight punishes Fairy-, Flying- and particularly Poison-types that switch in like Fezandipiti, Noivern, and Galarian Weezing. Lots of common Choice Scarf users such as Gardevoir, Galarian Zapdos, and Mienshao can revenge kill Terrakion, making defensive partners that can switch into the aforementioned Pokemon very valuable. Physical tanks such as Hippowdon and Galarian Weezing and special walls like Empoleon can switch into the revenge killers while offering utility like entry hazards and Rocky Helmet chip damage. Terrakion weakening opposing Pokemon like Hippowdon, Jirachi, and Hisuian Goodra allows teammates like Revavroom, Choice Scarf Krookodile, and Yanmega to come in afterwards and finish the job.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance Terrakion is a powerful setup sweeper, which boasts almost immediate wallbreaking power. Earthquake acts as an excellent coverage move and allows it to deal with targets such as Jirachi and Fezandipiti easily. Substitute is an alternative that lets Terrakion safely choose whether to set up a Swords Dance or fire off a STAB move after forcing out a Pokemon like Cyclizar or Bisharp. Taunt can be used to stop entry hazards from going up, prevent setup sweepers like Blastoise and Revavroom from taking advantage of Terrakion, and take away recovery and other status moves from foes such as Hippowdon and Slowbro. Air Balloon earns Terrakion a free turn against Ground-types such as Krookodile and can be used alongside Taunt to completely shut down Hippowdon without Stone Edge. Leftovers is an alternative that allows Terrakion to take better advantage of its decent natural bulk and synergizes particularly well with Substitute. Tera Flying removes its weaknesses to Ground- and Fighting-type attacks, thus giving it opportunities to set up against as well as break checks like Hippowdon, Chesnaught, and Choice Scarf Krookodile.</p> <p>Swords Dance Terrakion fits best on offense structures, particularly hyper offense, due to its ability to threaten the majority of the metagame after a single Swords Dance. It shares many of its defensive checks, like Hippowdon, with other common setup sweepers such as Revavroom and Mimikyu. This means that Terrakion can often be sacrificed to deal good damage to these checks before fainting, which enables the aforementioned sweepers to capitalize on the weakened physical walls to potentially pull off a sweep. Its great Speed tier strengthens its ability to chunk holes in the opposing team by taking advantage of common Pokemon like Jirachi and Salamence, which can often free up teammates like Choice Scarf Gardevoir and Weak Armor Armarouge to clean up late-game. It pairs well with specially offensive wallbreakers and setup sweepers such as Nasty Plot Thundurus and Throat Spray Yanmega, which can KO common Terrakion checks like Slowbro, Hippowdon, and Chesnaught with ease. Terrakion offers valuable support to teammates like Gengar and Maushold that fear Knock Off greatly, as its ability, Justified, acts as a strong deterrent against it. In addition, Terrakion can work well as a cleaner in entry hazard-stacking team structures, which try to wear down opposing teams, alongside setters such as Jirachi, Gligar, and Chesnaught, as many defensive Pokemon, such as Amoonguss and Suicune, only need to be chipped marginally to be in Terrakion's KO range after a Swords Dance.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Terrakion's high Speed and access to perfect coverage mean that it is an ideal Choice Scarf user that outspeeds most other Choice Scarf users in the tier, making it an excellent revenge killer. Earthquake helps it deal with Poison-types such as Fezandipiti and Revavroom. Rock Slide gives Terrakion a more reliable Rock-type move to use by trading power for accuracy. Stealth Rock allows Terrakion to act as an entry hazard setter that is able to get it up on Pokemon it forces out like Choice Scarf Krookodile locked into Knock Off. Justified allows Terrakion to switch into Dark-type attacks and punish moves like Knock Off from Cyclizar to boost its Attack. Tera Rock helps Terrakion by boosting its Rock-type moves, helping it clean up versus foes that don't resist Rock and threatening a 2HKO on Amoonguss and Galarian Weezing after Stealth Rock. Tera Ground boosts Earthquake's damage and threatens an OHKO on Fezandipti while giving Terrakion an immunity to Electric-type attacks and Thunder Wave from Thundurus.</p> <p>Choice Scarf Terrakion fits best on balance and bulky offense teams, as it is a great revenge killer that can outspeed common Choice Scarf users like Gardevoir and Krookodile. Chesnaught and Hippowdon make for good partners that offer utility like entry hazards and Rocky Helmet chip damage that weaken the opposing Pokemon and make it easier for Terrakion to clean. Sand Stream Hippowdon can also set up sandstorm for Terrakion, giving it a Special Defense boost and allowing it to switch into special attacks it normally shouldn't. Terrakion struggles into strong physical walls like Hippowdon, Slowbro, and Galarian Weezing, which can stop it from cleaning, so bulky partners like Salamence, Talonflame, and Wo-Chien are appreciated, as they can take hits for Terrakion and force these walls out. Wallbreakers like Crawdaunt and special attackers like Magnezone and Hisuian Zoroark can also weaken the aforementioned walls while making it much easier for Terrakion to clean up. Future Sight support from Slowbro and Reuniclus makes it harder for physical walls to switch in and particularly punishes Poison-types such as Amoonguss and Galarian Weezing, allowing Terrakion to use its STAB moves more often instead of locking into Earthquake.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654208, "username": "Tsuki"}, {"user_id": 655207, "username": "Sir Tetris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 655207, "username": "Sir Tetris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Thundurus": {
    "sets": {
      "Offensive Utility": {
        "description": "<p>Thundurus is an incredibly threatening offensive presence due to its wide array of coverage moves and ability to spread paralysis on would-be switch-ins. It benefits from a lack of specially defensive walls in the tier. Focus Blast chunks common Thundurus checks such as Hisuian Goodra and Assault Vest Cyclizar for a good amount of damage. Knock Off is an alternative utility option for making progress in general by taking away Heavy-Duty Boots, Leftovers, and Assault Vest from defensive switch-ins such as Fezandipiti, Umbreon, and Cyclizar and reducing their longevity. Grass Knot is good for punishing Ground-type switch-ins such as Krookodile and Hippowdon attempting to block Volt Switch or Thunder Wave. Psychic covers a different set of checks in Fezandipiti, Amoonguss, and Chesnaught and pairs well with Focus Blast to keep Thundurus from being completely walled by Krookodile. Heavy-Duty Boots allows Thundurus to pivot throughout the game without suffering Stealth Rock damage. Tera Fairy is useful for denying a Dragon-type STAB move from Hisuian Goodra or Cyclizar in a pinch, removing Thundurus's Stealth Rock weakness, and allowing it to comfortably take common Dark-type attacks such as Knock Off and Bisharp's Sucker Punch.</p> <p>Utility Thundurus fits well on a variety of structures, particularly balance and offensive teams that can capitalize on its strong pivot support and paralysis. Useful teammates for Thundurus include Pokemon that can take advantage of paralyzed foes such as Iron Head Jirachi, Hex Gengar, and Hex Basculegion-F as well as setup sweepers like Dragon Dance Gyarados that love getting off extra boosts. Wallbreakers such as Crawdaunt and Conkeldurr pair well with Thundurus, as their middling Speed tiers benefit greatly from paralysis support; moreover, they can comfortably take a hit from and exploit defensive Thundurus checks, particularly Cyclizar, Hisuian Goodra, and Wo-Chien, by coming in after a Volt Switch. Thundurus appreciates partners like Cyclizar, Wo-Chien, and Gastrodon that can absorb hits from Electric-type checks such as Magnezone, while Ground-types like Krookodile and Flygon can threaten these same Electric-types offensively. Other paralysis spreaders like Body Slam Jirachi and Thunder Wave Slowbro can be used alongside Thundurus to cripple as much of the opponent's team as possible and provide additional support to the game plan of taking advantage of paralyzed Pokemon. Structures that rely on entry hazards to chip down the opposing team combine well with Thundurus due to its ability to pivot and remove Heavy-Duty Boots, which is supplemented further by additional U-turn or Volt Switch users. Thundurus also benefits from defensive partners such as Hippowdon, Galarian Weezing, and Chesnaught that can easily come in on a Knock Off.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Nasty Plot Thundurus is among the best setup sweepers in the tier, capitalizing on its great Speed and access to diverse coverage options. Deceptively bulky, Thundurus can often tank a hit from would-be checks before steamrolling through a team with Nasty Plot and three attacks of its choosing. Focus Blast lets Thundurus hit common checks like Cyclizar and Hisuian Goodra but can also heavily punish Pokemon like Bisharp, Wo-Chien, Magnezone, and Umbreon for super effective damage. Grass Knot can be used for Ground-types like Gastrodon, Hippowdon, Krookodile, and Palossand. Tera Blast is usually run on Tera Flying sets that take advantage of the extra boost from Terastallization, giving Thundurus the Flying-type STAB it desperately wants to threaten Grass- and Fighting-types like Amoonguss, Chesnaught, and Slither Wing. Heavy-Duty Boots prevents entry hazards from wearing Thundurus down. Prankster gives priority to Nasty Plot so it can't be stopped from setting up by a faster Taunt from Azelf, Cyclizar, and Noivern. Tera Fairy gives key resistances to attacks like Bisharp Sucker Punch and Cyclizar Draco Meteor and Dragon Tail while retaining the important resistance to Fighting against Pokemon like Galarian Zapdos and Slither Wing. Tera Flying gives Thundurus the capacity to OHKO key threats like Conkeldurr, Amoonguss, and Breloom.</p> <p>Thundurus fits well on most structures and is often found on balance and offensive teams as a setup sweeper that can take advantage of its excellent movepool. Held back partly by its lack of Flying-type coverage, Thundurus can be a bit reliant on Tera to break through teams, meaning Pokemon like Amoonguss and Cyclizar that don't rely on Tera much are great support teammates. Amoonguss is a notable teammate because it can switch into many Choice Scarf physical attackers like Krookodile and Mienshao that threaten to KO Thundurus. Offensive teammates like Mienshao and Terrakion can synergize with Thundurus as Knock Off switch-ins, allowing Thundurus to maintain its Heavy-Duty Boots to preserve health. Defensive partners like Jirachi and Slowbro can spread Paralysis with Body Slam and Thunder Wave, respectively, allowing offensive Thundurus to set up and break its checks more efficiently. Tera Blast Thundurus likes to be a late-game cleaner, so teammates that can pivot like Barraskewda, Jirachi, and Slither Wing are excellent in putting Thundurus checks like Fezandipiti, Hisuian Goodra, and Umbreon into range for it to set up and sweep, especially when paired with entry hazard setters like Chesnaught and Gligar to capitalize on gradual chip damage through the forced switches. Grass Knot and Tera Blast require different team support, so teammates and their coverage options can vary drastically and cover the spectrum of defensive answers to either set. Entry hazard removal helps in the event Thundurus loses its item, so Cyclizar, Galarian Weezing, and Noivern are valuable teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 655207, "username": "Sir Tetris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Chesnaught": {"sets": {"Spikes": {}}},
  "Talonflame": {"sets": {"Utility": {}}},
  "Goodra-Hisui": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Hisuian Goodra is a devastating wallbreaker in RU, leveraging its excellent defensive typing to switch into many attacks while using its diverse movepool to hit a wide range of targets. Thunderbolt allows Hisuian Goodra to consistently hit the Water-types of the tier, such as Slowbro, Empoleon, and Suicune. Flamethrower melts the Steel-types that resist both of Hisuian Goodra's STAB moves such as Jirachi, Magnezone, and Bisharp. Choice Specs boosts Hisuian Goodra's power to stupendous heights, allowing it to pick up OHKOs on the likes of Slowbro and Slither Wing that could otherwise stomach a hit from it. Gooey allows Hisuian Goodra to slow down physical attackers, notably crippling Maushold, which can help against in late-game situations against wallbreakers such as Slither Wing and Terrakion. 136 Speed EVs allow Hisuian Goodra to outspeed Adamant Conkeldurr. Tera Ghost removes Hisuian Goodra's Fighting weakness, allowing it to break through the likes of Terrakion, Slither Wing, and Mienshao. Tera Dragon boosts the power of Draco Meteor to absurd levels, allowing it to surprise an enemy that could otherwise take the hit, like Revavroom. However, this makes Hisuian Goodra weak to Ice, Fairy and Dragon, meaning it cannot switch in as easily against Pokemon such as Ice Beam Empoleon, Fezandipiti, and Noivern, so it's best used in a late-game scenario or once these foes have been KOed.</p> <p>Hisuian Goodra fits best on bulky offense and balance teams that appreciate its ability to check threatening special setup sweepers such as Armarouge and Yanmega while giving them offensive firepower to help against bulkier teams. Fast sweepers such as Choice Scarf Gengar, Choice Scarf Krookodile, and Barraskewda appreciate Hisuian Goodra's ability to wear down defensive pokemon such as Umbreon, Fezandipiti, and Empoleon early-game in order for them to clean up late-game. Wish support from teammates such as Umbreon and Vaporeon are great for Hisuian Goodra, as they are able to heal off the chip damage that Hisuian Goodra has taken and allow it to continue its assault upon the opposing team. Fighting- and Ground-resistant Pokemon such as Galarian Weezing and Talonflame are great partners, as they are able to take on the Fighting- and Ground-types, like Mienshao, Galarian Zapdos, and Krookodile, that threaten Hisuian Goodra and cripple them with Will-O-Wisp, massively increasing Hisuian Goodra's survivability in order for it to chunk the opposition more often. Other physically defensive teammates such as Amoonguss, Chesnaught, and Hippowdon are also great partners for Hisuian Goodra, similarly taking the strong physical hits that are aimed at it while being able to support it by spreading status and setting entry hazards. Fairy-types such as Gardevoir and Fezandipiti are good offensive and defensive partners to Hisuian Goodra, as they are able to switch into the Fighting-type Pokemon that threaten Hisuian Goodra and force them out. In return, Hisuian Goodra is easily able to switch into and take advantage of the Steel-types that check them like Jirachi and Empoleon. Pivots such as Cyclizar and Slither Wing can bait in physical walls like Hippowdon, Galarian Weezing, and Chesnaught and pivot into Hisuian Goodra, which can then freely fire off a powerful attack.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 647728, "username": "Heatranator"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 655207, "username": "Sir Tetris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Klefki": {"sets": {"Spikes": {}}},
  "Noivern": {"sets": {"Offensive Pivot": {}}},
  "Diancie": {"sets": {"Stealth Rock": {}}},
  "Volcanion": {
    "overview": "<p>Volcanion is one of the most potent wallbreakers available, making use of its strong STAB moves and diverse coverage options to rip through bulkier team structures. While it does struggle with longevity and Speed, the pure strength in wallbreaking power that it can provide a team makes up for these issues, with proper teambuilding further patching up these holes. Threatening defensive tier staples like Hippowdon, Jirachi, and Amoonguss, as well as nuking more fragile options with ease, Volcanion's offensive capabilities cannot be understated. Additionally, while mainly used in an offensive manner, Volcanion can also provide an out against rain teams thanks to Water Absorb, which also allows it to be a decent switch-in to Scald users like Slowbro and Suicune. Volcanion most often runs Heavy-Duty Boots, which provides it much-needed tenure in the face of Stealth Rock and entry-hazard stacking playstyles. Although Volcanion is powerful, there is reliable counterplay against it, with options like Knock Off from Cyclizar being able to remove Heavy-Duty Boots. In addition to this, Dragon-types, most notably Salamence and Hisuian Goodra, and bulky Water-types like Gastrodon and Empoleon leverage their utility and advantaged typing against it.</p>",
    "comments": "<h3>Other Options</h3> <p>Volcanion can run more diverse options for its moves and items, though they can either lack power or the longevity that Heavy-Duty Boots provide. Fire Spin can be slotted over Flamethrower to trap specially defensive walls like Chansey and Milotic alongside running Taunt over an offensive option to deny their recovery. Both Choice Specs and Choice Scarf are options to turn Volcanion into a nuke or fix its below-average Speed, respectively. Its Tera types can fluctuate from the norm, slotting Tera Water for more power from Steam Eruption or Tera Ground to boost the power of Earth Power, provide an immunity to Electric, and create a more impactful synergy with Water Absorb. Tera Blast can give Volcanion an additional offensive option that can help it break through previous checks or counters, with examples like Tera Blast Fairy allowing Volcanion to break through Cyclizar and Salamence or Tera Blast Dark to deal with Slowbro and other Psychic-types.</p> <h3>Checks and Counters</h3> <p><strong>Knock Off</strong>: Volcanion doesn't appreciate the loss of Heavy-Duty Boots, which puts it in jeopardy against Stealth Rock and entry hazard stacking playstyles. Cyclizar in particular can switch in on Volcanion that lack Body Press and freely remove its Heavy-Duty Boots.</p> <p><strong>Dragon-types</strong>: Dragon-types resist all of Volcanion's STAB options and can easily threaten it with powerful STAB moves of their own or take advantage of its inability to threaten substantial damage and set up on it. In particular, Cyclizar, Salamence, and Hisuian Goodra only need to dodge the potential threat of a burn if they use physical moves in order to threaten Volcanion back for serious damage.</p> <p><strong>Mirror Matchups and Water-types</strong>: Without Earth Power, Volcanion gets checked well by opposing Volcanion. In a broader view, Water-types as a whole check Volcanion's STAB options well, only fearing a potential burn from Steam Eruption or Flamethrower that might hinder their future longevity. Taunt can assist with this issue, beating walls like Milotic and Empoleon in the long term by denying their recovery options, and it can provide more opportunities for Volcanion to spread burns with Steam Eruption.</p>",
    "sets": {
      "Wallbreaker": {
        "description": "<h4>Set Details</h4> <p>Through options like Body Press, Earth Power, and Sludge Bomb, Volcanion is able to more readily deal with foes that resist its primary STAB moves in Steam Eruption and Flamethrower. Body Press and Earth Power cover very common checks to Volcanion, with Body Press dealing with the omnipresent Cyclizar and Earth Power providing a way to hit opposing Volcanion for super effective damage. While Sludge Bomb is not as noticeably potent against its checks, the value of being able to fish for poison against near stonewall counters like Salamence cannot be understated. Taunt can be slotted in over one of Volcanion's offensive options to break through more defensive foes, denying the option of recovery, including, but not limited to, Slowbro's Slack Off and Empoleon's Roost; these foes are able to absorb Volcanion's attacks naturally with their bulk. Heavy-Duty Boots increases Volcanion's overall longevity in the face of a tier ruled by entry hazards. Water Absorb allows for legitimate utility that isn't usually seen with other wallbreakers, providing a valuable matchup against rain teams, denying pivoting or strong boosted Water-type STAB moves from the likes of Barraskewda, Kingdra, and Basculegion-F. Maximizing Special Attack investment and a Modest nature allows Volcanion to deal huge damage even to Pokemon that resist its attacks, and it runs enough Speed investment to outspeed Adamant Crawdaunt. The rest of the available EVs are allotted towards HP to improve Volcanion's overall bulk. Tera types are flexible on Volcanion, but generally, Ghost and Fairy are the most applicable, as they provide very sound matchups against tier staples like Slither Wing and Krookodile while also providing a neutrality to Stealth Rock. Tera Ghost denies Rapid Spin from Cyclizar, one of Volcanion's primary checks, as well as gaining an immunity to the wide array of Fighting-type moves in the tier. Fairy is a great type defensively and can deny options like Draco Meteor from Cyclizar and Salamence, forcing them to rely on more inaccurate or weaker moves in order to deal meaningful damage to Volcanion. Tera Dark can allow it to stonewall one of the best progress makers in the tier, Slowbro, by not only blocking Scald due to Water Absorb but also any of Slowbro's Psychic-type STAB options like Psyshock and Psychic Noise. Being able to also blank many of the strong Psychic-types in the tier, like Gardevoir and Armarouge, with Tera Dark is always an invaluable trait to have.</p> <p>Most of the time, Volcanion fits on balanced team compositions where it can take advantage of more defensive play in order to keep itself healthy throughout a match. Volcanion struggles with not having any form of reliable recovery, so it benefits from teammates that can pivot it into foes it matches up well against. Additionally, Wish passing is incredibly powerful support for Volcanion, fixing its main weakness of longevity. Jirachi is able to provide pivoting and Wish passing for Volcanion, making it a great teammate for Volcanion; it can also spread paralysis through Body Slam or Thunder Wave, providing a remedy for Volcanion's lackluster Speed. For a more offensive pivot, Galarian Zapdos serves as an option to support Volcanion's offensive presence, creating powerful synergy that can take advantage of each other's weaknesses. Galarian Zapdos is able to pivot out on its checks, primarily those that have extreme physical bulk but are vulnerable to Volcanion's strong special offense, like Hippowdon and Galarian Weezing. Inversely, Galarian Zapdos is immune to Ground-type STAB moves from threats like Krookodile, and it can also take advantage of one of Volcanion's better checks in Salamence by gaining a Defiant boost. Entry hazard stacking teams can also benefit from Volcanion, with the passive chip damage from both Stealth Rock and Spikes creating larger openings for Volcanion's wallbreaking capabilities; as such, pairing it up with Klefki, Chesnaught, or Palossand is beneficial.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 633048, "username": "HoopsspooH"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 598717, "username": "Sneakyplanner"}, {"user_id": 513635, "username": "Rarelyme"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Oricorio-Pom-Pom": {"sets": {"Quiver Dance Sweeper": {}}},
  "Lycanroc-Dusk": {"sets": {"All-Out Attacker": {}, "Swords Dance": {}}},
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Salazzle": {"sets": {"Substitute + Toxic": {}, "Offensive": {}}},
  "Palossand": {"sets": {"Defensive": {}}},
  "Mimikyu": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance Mimikyu occupies a unique place in the metagame as a setup sweeper and late-game cleaner that is used primarily because of the utility provided by its ability, Disguise, rather than purely because of its firepower. Since there are no viable Mold Breaker Pokemon in the tier, Disguise almost always guarantees Mimikyu a free turn to set up Swords Dance, which is incredibly valuable. Life Orb provides Mimikyu with much-needed extra firepower that can come in handy when attempting to dispatch offensive threats such as Galarian Zapdos and Kleavor or sweep after a Swords Dance. Red Card is an alternative that offers insurance by phazing out bulkier threats and setup sweepers that Mimikyu may not be able to easily take out such as Calm Mind Fezandipiti, Shift Gear Revavroom, and Throat Spray Yanmega; it also has the added possibility of bringing in a Pokemon like Cyclizar or Slither Wing that Mimikyu could use as setup fodder, in return for decreasing its damage. A Jolly nature with maximum Speed ensures that Mimikyu can outspeed a large chunk of the tier and, in particular, Kleavor and Krookodile. Tera Ghost strengthens Mimikyu's power as a sweeper and allows it to dish out heavy-hitting Shadow Sneak at +2, which can clean worn-down Pokemon like Noivern, Galarian Zapdos, and Gardevoir.</p> <p>Mimikyu fits best on hyper offense and offensive structures that rely on setup sweepers and strong attackers to overwhelm the opposing team and thus may not have the defensive resources necessary to easily take out a fast revenge killer or prevent a reverse sweep. Other notable setup sweepers such as Bisharp, Nasty Plot Thundurus, and Shift Gear Revavroom pair well with Mimikyu by chunking holes in the opposing team and possibly removing some of its key defensive checks such as Hippowdon and Talonflame, thus bolstering Mimikyu's ability to clean late-game. Mimikyu can act as a decent spinblocker against teams reliant on Cyclizar for entry hazard removal. It also appreciates its own hazards support, thus pairing well with Stealth Rock leads such as Kleavor and Terrakion, as they ease Mimikyu's job as a cleaner by wearing out the opposing team, which brings them closer to KO range after a Swords Dance. Mimikyu synergizes well with Future Sight users such as Slowbro and Reuniclus, as it prevents some of Mimikyu's common Poison-type checks like Galarian Weezing and Fezandipiti from switching in. Status spreader partners such as Thunder Wave Thundurus and Will-O-Wisp Galarian Weezing can cripple offensive threats such as Armarouge, Kleavor, and Galarian Zapdos, which gives Mimikyu more opportunities to pull off a sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 655207, "username": "Sir Tetris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 231398, "username": "feen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Necrozma": {
    "overview": "<p>Necrozma is an outstanding Psychic-type Pokemon that has unique set diversity, capable of running a plethora of coverage and utility moves. Stealth Rock Necrozma is a notable lead for offensive structures, as it can break through a lot of balance staples that other leads like Kleavor and Terrakion might struggle against, like Hippowdon, Hisuian Goodra, Jirachi, and Galarian Weezing. Necrozma has decent natural bulk that is amplified by Prism Armor, minimizing the damage taken from U-turn and Sucker Punch from threats like Slither Wing and Bisharp. Dragon Dance and Calm Mind variants can pick what coverage attacks they need, like Earthquake, Knock Off, Earth Power, and Heat Wave, with Calm Mind sets generally running Moonlight to give Necrozma reliable recovery to stick around after setting up. Necrozma does often struggle to find a slot on teams given the bevy of Psychic-types in the tier it competes with, like Jirachi, Reuniclus, and Slowbro, though it has exceptional offensive capabilities on structures that the other Psychic-types lack like ways to hit Steel-types consistently. While Necrozma is not exactly lacking in Speed, it can be a bit slow at times, failing to outspeed foes that Armarouge and Jirachi do and limiting the number of foes it can KO. Necrozma also struggles to combat the priority in the tier, notably taking super effective damage from Bisharp Sucker Punch and Slither Wing First Impression.</p>",
    "comments": "<h3>Other Options</h3> <p>Calm Mind Necrozma is a viable mid-game wallbreaker and late-game cleaner, capable of hitting most of the metagame for massive damage after just one setup turn. Offensive Trick Room Necrozma is a notable anti-offense tool that can claim multiple KOs in a game by taking advantage of faster threats being relatively frail and susceptible to being OHKOed by many of its attacks. Weakness Policy similarly takes advantage of Necrozma's natural bulk and typing to boost on Knock Off and U-turn attempts, usually from physically weak Pokemon like Cyclizar and Thundurus that otherwise don't threaten it.</p> <h3>Checks and Counters</h3> <p><strong>Encore and Taunt</strong>: Encore users faster than Necrozma, like Gengar, Jirachi, and Maushold, can put a stop to Calm Mind Necrozma's setup attempts, as well as lock Stealth Rock Necrozma into an uncomfortable move. Similarly, fast Taunt users like Krookodile and Mew can shut down attempts at setting up, recovering health, and establishing entry hazards.</p> <p><strong>Psychic-type Pokemon</strong>: While Necrozma has the coverage to threaten most of the other Psychic-types in the tier, like Ground-type attacks for Jirachi and Dark-type attacks for Reuniclus and Slowbro, it still struggles to break through them at times given how bulky they are. Dark Pulse is difficult for Calm Mind Necrozma to fit, as Earth Power is used to handle Jirachi and other Steel-types in one slot, which is usually more valuable. Reuniclus and Slowbro are therefore incredibly good defensive answers to most Necrozma sets, given they can usually take two hits while getting off a Thunder Wave to hinder Necrozma for their teammates or using Calm Mind themselves to set up in a matchup that is favorable for them.</p> <p><strong>Bug-type Pokemon</strong>: Necrozma struggles to keep pace with the offensive Bug-type Pokemon in the metagame, notably flopping as an offensive lead when matching up into Kleavor. Slither Wing threatens to OHKO Necrozma with Choice Band First Impression, and Yanmega can use Bug Buzz to activate Throat Spray and use Necrozma as setup fodder. Other niche hyper offense leads, like Araquanid and Galvantula, also pose problems for Necrozma, making the Offensive Stealth Rock set difficult to use against opposing offensive teams.</p>",
    "sets": {
      "Dragon Dance": {
        "description": "<p>Dragon Dance Necrozma is a strong setup sweeper, making use of its excellent movepool to power through traditional answers like Hisuian Goodra and Umbreon. Photon Geyser allows Necrozma to break through Unaware Pokemon like Quagsire trying to wall it and completely disregard Mimikyu's Disguise. Earthquake allows it to hit Steel-types like Empoleon, Hisuian Goodra, and Jirachi for super effective damage. X-Scissor takes care of Dark- and Psychic-types that would otherwise prove difficult for Necrozma to power through such as Krookodile, Umbreon, and Slowbro. Knock Off hits Psychic-types for super effective damage while doubling as item removal on neutral targets like Hippowdon. With a Lum Berry, Necrozma can set up on Pokemon like Fezandipiti, Body Slam Jirachi, and Scald Slowbro without fear of getting crippled by status. Alternatively, Necrozma's high natural bulk and ability Prism Armor allows it to take weak super effective attacks like Knock Off and U-turn from physically weak pivots like Cyclizar and Fezandipiti to safely activate its Weakness Policy and get a huge boost to its Attack. Tera Fairy flips Necrozma's weaknesses to Bug- and Dark-type attacks into resistances, which is useful for breaking through common revenge killers like Slither Wing and Bisharp. Tera Electric gives Necrozma an immunity to Thunder Wave and other forms of paralysis and the ability to set up on Jirachi by resisting Iron Head. Tera Fire gives Necrozma a resistance to Bug-type attacks while also giving it an immunity to burn from attacks like Slowbro's Scald and Entei's Sacred Fire and allows it to freely set up on any Pokemon using Will-O-Wisp like Rotom-H.</p> <p>Dragon Dance Necrozma best fits on offense teams as a late-game cleaner once its checks have been worn down. Physical walls such as Hippowdon and Slowbro can be problematic for Necrozma, so powerful wallbreakers like Basculegion-F, Thundurus, and special Salamence can open the way for it to clean late-game. Fairy- and Fighting-type partners like Galarian Weezing, Fezandipiti, and Slither Wing are great at checking Dark-types like Krookodile and Umbreon that can stop Necrozma from sweeping if not running X-Scissor. Entry hazard support from Pokemon like Chesnaught and Jirachi can help +1 Attack Necrozma pick up KOs more easily on Pokemon like Hisuian Goodra and Krookodile and gives it a potential 2HKO on Slowbro. Even at +1 Speed, Necrozma is outsped by a plethora of Choice Scarf users like Gengar, Krookodile, and Mienshao and is weak to two of the most common priority moves in Slither Wing's First Impression and Bisharp's Sucker Punch, making speed control and defensive partners that can switch into Pokemon trying to revenge kill very valuable. On the one hand, speed control options like Thunder Wave Thundurus and Slowbro and Body Slam Jirachi can make up for Necrozma's middling Speed by crippling the aforementioned Choice Scarf users that can stop Necrozma from cleaning. On the other hand, physical tanks such as Hippowdon and Amoonguss and special walls like Empoleon switch into the revenge killers while offering utility like entry hazards and Rocky Helmet chip damage.</p>"
      },
      "Offensive Stealth Rock": {
        "description": "<p>Offensive Stealth Rock Necrozma is a competent entry hazard setter that can output tremendous damage with its choice of strong coverage attacks. Meteor Beam increases Necrozma's power while also threatening to OHKO Pokemon like Rotom-H and Salamence. Earth Power gives Necrozma the coverage to break through Steel-types like Empoleon, Hisuian Goodra, and Jirachi. Power Herb doubles as a one-turn solution to Meteor Beam and a way to remove Necrozma's item, weakening Knock Off from Pokemon like Cyclizar, Krookodile, and Galarian Zapdos. This makes Necrozma notable, as it is a Psychic-type that is able to mitigate damage taken by Knock Off. Prism Armor is a great ability, making super effective hits much easier to take as Necrozma establishes entry hazards and racks up damage. Tera Ghost prevents Rapid Spin Cyclizar from removing hazards and weakens Bug-type attacks like First Impression and U-turn from Slither Wing and Galarian Zapdos.</p> <p>Offensive teams use Necrozma as a Stealth Rock lead to capitalize on its unique offensive profile and get an early advantage over balance and bulky offense structures, hitting staples like Cyclizar, Hippowdon, and Jirachi for enough damage to ensure Stealth Rock goes up. Other Stealth Rock leads like Kleavor and Terrakion have limited options and are handled by many balance staples like Galarian Weezing, Jirachi, and Hippowdon, while Necrozma can run multiple sets and has great coverage, letting it threaten a majority of the metagame, including common defensive staples. Necrozma's ability to immediately output damage and get a boost to Special Attack with Meteor Beam makes would-be checks like Empoleon, Hisuian Goodra, and Jirachi susceptible to getting taken out by a boosted Earth Power, as well as threatening Assault Vest Cyclizar enough to ensure Stealth Rock set by Necrozma stay up. Teammates that appreciate these bulky Steel-types and specially defensive walls being worn down, like Armarouge, Thundurus, and Yanmega, all thrive when they're able to set up and clean late-game, especially with Stealth Rock support. Similarly, physical sweepers like Maushold and Revavroom notably appreciate Jirachi being worn down, as they can struggle to beat Jirachi, since it threatens to use Encore to disrupt setup attempts or paralyze with Body Slam.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 654208, "username": "Tsuki"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Barraskewda": {
    "overview": "<p>With one of the fastest natural Speed tiers in the metagame, Barraskewda is an excellent pick for a wallbreaker that can easily pivot out of its checks with Flip Turn, dealing decent chip damage to most Pokemon, and clean up late-game with its stronger attacks. On rain teams, Barraskewda turns into an incredibly powerful threat that is practically impossible to outspeed thanks to Swift Swim. However, Barraskewda suffers from the presence of common Water-resistant Regenerator Pokemon like Slowbro and Amoonguss that can shut it down and render its attempts at wallbreaking useless. Barraskewda is also quite frail and can be easily forced out, which can end up giving strong wallbreakers such as Basculegion-F and Hisuian Lilligant more opportunities to blow holes in Barraskewda's team. Thus, Barraskewda often relies on offensive partners to break through its checks and counters and defensive ones to restrict opposing wallbreakers from taking advantage of it.</p>",
    "comments": "<h3>Other Options</h3> <p>Barraskewda may opt for Psychic Fangs as a coverage move instead of Aqua Jet or Crunch to be able to threaten Amoonguss and Chesnaught. Life Orb is an option over Choice Band and Heavy-Duty Boots that takes away Barraskewda's reliance on predictions while still enabling it to deal quite a bit of damage; however, the recoil damage combined with entry hazard and Rocky Helmet chip will wear it down very quickly. Mystic Water is a safer alternative on rain teams that still improves Barraskewda's ability to spam its STAB moves.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Defensive Water-type Pokemon such as Slowbro and Suicune can easily come in on Barraskewda's STAB moves and proceed to take advantage of it by setting up or firing off a Scald. Thus, their presence on the opposing team can drastically dampen Barraskewda's ability to break walls. In addition, strong Water-types like Basculegion-F and Volcanion can turn Barraskewda into a wallbreaking opportunity.</p> <p><strong>Grass-types</strong>: Defensive Grass-types like Chesnaught and Amoonguss take little damage from Barraskewda's attacks, easily heal up and at the same time deal decent chip damage to it by way of Rocky Helmet, thus decreasing Barraskewda's longevity at a cheap cost. Wo-Chien is able to shrug off most attacks from Barraskewda and its Water-type partners that utilize rain and strike back with Knock Off or Foul Play. Hisuian Lilligant can also take advantage of Barraskewda by using it as setup fodder.</p> <p><strong>Choice Scarf users</strong>: The common presence of Choice Scarf users that can outspeed and capitalize on Barraskewda such as Gardevoir and Galarian Zapdos hinders its reliability as a fast pivot. Gardevoir in particular is incredibly threatening for rain teams due to its ability, Trace, copying the effects of Barraskewda's Swift Swim.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<h4>Set Details</h4> <p>Flip Turn is one Barraskewda's most important moves, as it gives it the ability to pivot out of unfavorable matchups and deal noticeable damage at the same time, especially if rain is active. Close Combat is essential coverage to threaten common Water-resistant or -immune targets such as Cyclizar, Wo-Chien, Empoleon, and Volcanion. Aqua Jet enables Barraskewda to pick off fast sweepers such as Weak Armor Armarouge and Choice Scarf users such as Gardevoir and Krookodile after they are weakened. Crunch can serve as optional coverage to threaten some of Barraskewda's checks like Slowbro and Basculegion-F. Choice Band provides Barraskewda with much-needed offensive firepower that allows it to act as a more threatening wallbreaker. Heavy-Duty Boots can be used to keep Barraskewda from falling in range of strong priority moves like Bisharp's Sucker Punch, although the loss in power is very noticeable. A Jolly nature allows Barraskewda to outspeed key targets such as Cyclizar and Noivern. An Adamant nature trades off some of its Speed for damage and is preferred on rain teams, as Swift Swim already boosts Barraskewda's Speed to incredible levels. Tera Water boosts the power of Barraskewda's STAB moves, which is often all it needs to clean up a chipped opposition. Tera Fighting is used to power up Close Combat, enabling Barraskewda to deal more damage to Water-immune or -resistant foes like Volcanion and Blastoise while also giving it useful resistances to U-turn and Dark-type moves. Tera Dark boosts the power of Crunch, which can allow Barraskewda to pick off Psychic-type Pokemon like Slowbro and Reuniclus after some chip damage and give it resistances to key priority moves like Shadow Sneak from Mimikyu and Sucker Punch from Bisharp as well as an immunity to Thunder Wave from Prankster Thundurus.</p> <p>Barraskewda finds itself at home in offense structures that can utilize its Speed and power to create holes that can be taken advantage of by its partners. It pairs well with special wallbreakers like Gengar, Gardevoir, and Psychic Thundurus that can capitalize on Flip Turn giving them safe entry points against physically defensive Pokemon like Slowbro, Chesnaught, and Amoonguss. On rain teams, Barraskewda synergizes well with other rain exploiters like Basculegion-F and Kingdra to overwhelm Water-resistant foes like Slowbro, Empoleon, and Salamence with brute force. Other pivots can form VoltTurn cores with Barraskewda that aim to accrue chip damage on the opposing team by safely switching in on each other's defensive checks, with strong options like Magnezone, Thundurus, and Slither Wing synergizing particularly well thanks to their ability to threaten defensive Water-types like Slowbro and Empoleon. Barraskewda appreciates the presence of defensive partners such as Hisuian Goodra, Empoleon, and Chesnaught that can keep wallbreakers like Basculegion-F, Volcanion, and Hisuian Lilligant from dealing too much damage after forcing Barraskewda out. Choice Band Barraskewda often relies on entry hazard removal options such as Cyclizar and Galarian Weezing to prevent strong priority moves like Bisharp's Sucker Punch and Conkeldurr's Mach Punch from picking it off after some entry hazard chip.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 655207, "username": "Sir Tetris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Toxtricity": {"sets": {"Wallbreaker": {}, "Offensive Pivot": {}, "Shift Gear": {}}},
  "Regidrago": {"sets": {"Choice Specs": {}, "Dragon Dance": {}, "Choice Scarf": {}}},
  "Kleavor": {"sets": {"Lead": {}, "Choice Scarf": {}}},
  "Basculegion-F": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Basculegion-F is a strong option for speed control thanks to its powerful Adaptability-boosted attacks and good defensive typing. Its bulk and resistances offer it many opportunities to enter the field against common Pokemon like Slowbro, Jirachi, and Galarian Weezing. Choice Scarf enables Basculegion-F to outspeed the entire unboosted metagame, including Jolly Barraskewda and Talonflame. Ice Beam is important to hit the Dragon- and Grass-types that resist Basculegion-F's STAB attacks like Cyclizar and Bulletproof Chesnaught. Flip Turn allows Basculegion-F to pivot out against special walls like Hisuian Goodra and Empoleon while still dealing respectable damage thanks to Adaptability. It is not recommended to Terastallize Basculegion-F, as the damage boost is minimal, and Adaptability will no longer apply to its old typings. For this reason, it uses either Tera Ghost or Water, and it should be Terastallized primarily for the defensive benefits. Tera Ghost means that Basculegion is no longer weak to Electric- and Grass-type attacks from Thundurus, Hisuian Goodra, and Amoonguss, while Tera Water sheds the vulnerability to Sucker Punch from Bisharp and Shadow Sneak from Mimikyu.</p> <p>Choice Scarf Basculegion-F is most comfortable on bulky offense teams that appreciate its speed control while also making use of its defensive qualities to serve as a pivot. Since it is expected to enter the field multiple times, entry hazard removal options such as Cyclizar and Galarian Weezing are valuable allies, with Cyclizar being able to survive Electric- and Grass-type attacks from Thundurus and Amoonguss, while Galarian Weezing can tank physical attacks from faster Choice Scarf users like Krookodile and Galarian Zapdos. Basculegion-F can form a VoltTurn core with teammates like Mienshao and Slither Wing that want to attack the special walls like Umbreon and Hisuian Goodra that answer Basculegion-F. Other bulkier Fighting-types like Chesnaught and Conkeldurr are also excellent teammates for Basculegion-F, as they can take Knock Off from Pokemon like Crawdaunt and Krookodile while threatening the Dark- and Normal-types that can switch into Shadow Ball such as Umbreon and Cyclizar. As Basculegion-F often needs help breaking through bulky Water- and Grass-types like Empoleon, Gastrodon, and Wo-Chien, other special attackers like Armarouge and Thundurus have the power and coverage to create holes in the opposing team for Basculegion-F to exploit. Hazards set by Pokemon such as Krookodile, Chesnaught, and Mew can weaken checks into KO range of Basculegion-F's attacks and rack up extended damage as it forces switches and pivots out.</p>"
      },
      "Choice Specs": {},
      "Agility": {
        "description": "<p>Agility Basculegion-F is a potent special wallbreaker with an excellent and near-unresisted STAB combination for the tier. Ice Beam allows it to break through Dragon-types like Salamence and Noivern and Grass-types like Amoonguss and Chesnaught. Weakness Policy sets are particularly strong against a weak Knock Off from utility Pokemon like Cyclizar, Empoleon, and Chesnaught. On the other hand, Life Orb is a more reliable but less powerful option for powering up Basculegion-F's attacks. Its natural bulk along with this EV spread allows it to survive several key benchmark hits. 52 Defense EVs ensure Basculegion can comfortably survive a Sucker Punch from max Attack Bisharp from full health. Choice Scarf Gengar outspeeds Basculegion-F even after one Agility boost, but with 24 Special Defense EVs, Basculegion-F is guaranteed to take one Shadow Ball from Gengar from full health and fire back with its own Shadow Ball or use Agility a second time. 196 Speed EVs allow unboosted Basculegion-F to outspeed Bisharp. Adaptability makes Basculegion-F a subpar user of Terastallization, as the additional power boost from either Tera Ghost or Water is minimal and comes at the expense of losing its Adaptability boost on its other STAB type. However, Basculegion-F can utilize either Tera Ghost or Water in a pinch to squeeze out some extra damage or remove one of its weaknesses against foes such as Thundurus or Krookodile.</p> <p>Agility Basculegion fits well on offensive structures in search of a powerful special attacker and potential mid- to late-game sweeper. It appreciates rain support from Politoed to boost the power of its Water-type moves. Entry hazard support from Pokemon like Terrakion, Krookodile, and Chesnaught enable Basculegion-F's ability to clean late-game as well. Chesnaught is an excellent partner for Basculegion-F on Spikes-stacking teams, as Chesnaught can tank the Dark- and Electric-type moves that threaten the fish while enjoying Basculegion-F's natural immunity to Rapid Spin from Cyclizar. Weakness Policy Basculegion-F sets can subsequently take advantage of Cyclizar by baiting a careless Knock Off and setting up with Agility or firing back with a boosted Ice Beam. Basculegion-F's ability to deny hazard removal from Cyclizar makes it an excellent addition to Sticky Web teams as well. Specially defensive Pokemon like Empoleon, Wo-Chien, and Hisuian Goodra are problematic for Basculegion-F, as they can comfortably stomach any of its unboosted attacks. Therefore, powerful Fighting-type wallbreakers like Terrakion, Galarian Zapdos, and Conkeldurr pair well with Basculegion-F in helping to eliminate these threatening foes. Basculegion-F in turn aids these Fighting-type wallbreakers by threatening their defensive answers like Hippowdon and Galarian Weezing. Basculegion-F is notably vulnerable to paralysis from status spreaders like Amoonguss and Thundurus, since the speed drop from paralysis neuters its ability to set up and sweep teams. Therefore, partners that can absorb or don't mind paralysis like Magnezone and Conkeldurr can be helpful teammates. If Basculegion-F is unable to use Agility, then Choice Scarf Gardevoir can take advantage of it due to Trace copying Adaptability. As a result, Steel-type stalwarts like Jirachi and Registeel are helpful in keeping Gardevoir at bay. Basculegion-F is also appreciative of teammates like Galarian Zapdos, Hippowdon, and Talonflame that can deal with strong priority users like Sucker Punch Bisharp and Shadow Sneak Mimikyu. Basculegion-F should be paired with allies like Hisuian Goodra, Bisharp, and Krookodile that can manage revenge killers that outspeed and KO a weakened Basculegion-F after one Agility such as Choice Scarf Gengar and Hisuian Zoroark.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 64212, "username": "Seed Sower"}, {"user_id": 555741, "username": "MachJacob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 513635, "username": "Rarelyme"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Overqwil": {"sets": {"Rain Sweeper": {}, "Defensive": {}}},
  "Maushold": {
    "overview": "<p>Boasting the incredibly strong Technician Population Bomb along with the ability to set up and remove hazards in a single turn, Maushold stands out as one of the most threatening setup sweepers in the metagame. Due to its ability to outspeed and OHKO the majority of the tier after a single turn of boosting, it is imperative for every non-hyper offense team to have an answer to Maushold. Unfortunately for Maushold, this can be done incredibly easily by having any decently defensive Pokemon hold Rocky Helmet, as the multihit nature of Population Bomb simultaneously serves as its greatest strength and its Achilles' heel. Maushold's relative frailty also means that it can be easily dealt with by strong priority users and bulkier Pokemon that are able to survive a hit and KO it back.</p>",
    "comments": "<h3>Other Options</h3> <p>Maushold's greatest weakness, contact effects, can be neutralized with Protective Pads, albeit at the cost of drastically decreasing Population Bomb's reliability. Loaded Dice is an alternative to Wide Lens that improves Bullet Seed's reliability while still guaranteeing at least 4 hits with Population Bomb. Tera Fire can be used to prevent Maushold from getting burned by Will-O-Wisp Galarian Weezing and Talonflame and grant it free turns to set up against them.</p> <h3>Checks and Counters</h3> <p><strong>Contact Effects</strong>: Any of the physical walls in the tier, including Hippowdon, Chesnaught, Galarian Weezing, and Slowbro, can eliminate Maushold with the help of Rocky Helmet, with the interaction causing Maushold to faint after hitting just 6 times from full health. Pokemon such as Static Bellibolt and Flame Body Talonflame can also be used to cripple, instead of outright KO, Maushold at a very high probability as punishment for clicking Population Bomb; although they are less reliable, they have an edge over the other physical walls, as their anti-Maushold weapon cannot be neutralized with Knock Off.</p> <p><strong>Faster Wallbreakers</strong>: Faster offensive Pokemon such as Barraskewda and Choice Scarf users such as Galarian Zapdos and Mienshao can revenge kill an unboosted Maushold, though the latter two have to be wary of a possible Tera Ghost from Maushold that could flip the game in its favor in a single turn.</p> <p><strong>Steel-type Wallbreakers</strong>: Powerful Steel-types such as Hisuian Goodra and Choice Specs Magnezone can survive a hit from Maushold and KO it back. Hisuian Goodra in particular can temporarily cripple Maushold with Gooey and therefore allow its teammates to deal with it even if Maushold has accrued several Tidy Up boosts.</p> <p><strong>Mimikyu</strong>: In the hyper offense mirror matchup, Mimikyu is one of the only Pokemon that can consistently deal with Maushold thanks to its immunity to Population Bomb. Mimikyu does, however, need to be wary of Bite that can take it out with enough flinches and Bullet Seed that can potentially KO Mimikyu past Disguise after Maushold gets one or two Attack boosts.</p>",
    "sets": {
      "Tidy Up": {
        "description": "<h4>Set Details</h4> <p>Tidy Up offers incredible utility, as it allows Maushold to set up and unpreventably remove hazards in a single slot. Bite is a go-to coverage option, as it allows Maushold to hit Ghost-types like Basculegion-F and Hisuian Zoroark. Bullet Seed is an alternative that can similarly hit the aforementioned Ghost-types as well as Rocky Helmet Hippowdon, which is one of Maushold's most common checks, at the cost of fizzling against Gengar. Encore can provide Maushold with free turns by locking an opponent into a useless move, which can often be game-winning due to Maushold's unrivaled power. Low Kick is another coverage option that enables Maushold to deal with bulky Steel-types such as Hisuian Goodra, Registeel, and Eviolite Bisharp. Wide Lens is crucial for Maushold to improve Population Bomb's consistency, as otherwise it only has an approximate 35% chance to hit 10 times. Technician boosts all of Population Bomb, Bite, and Bullet Seed, enabling Maushold to be incredibly threatening despite its low Attack stat. Tera Ghost provides Maushold with valuable immunities to Fighting and Normal and a resistance to Bug, which can prevent it from getting revenge killed by Fighting-type attacks, including Body Press from Chesnaught and Close Combat from Choice Scarf Galarian Zapdos, as well as priority attacks such as Conkeldurr's Mach Punch, Entei's Extreme Speed, and Slither Wing's First Impression. This can be capitalized on with Encore to give Maushold incredibly valuable free turns to set up. Tera Normal can be used instead to boost Population Bomb's power, which allows Maushold to OHKO bulky Pokemon like Fezandipiti and specially defensive Umbreon without needing to set up.</p> <p>Maushold fits best on offense, particularly hyper offense, structures, primarily due its ability to remove hazards despite already being an incredibly powerful setup sweeper. Becase of this, it synergizes with other setup sweepers like Throat Spray Yanmega and Lum Berry Salamence that are weak to Stealth Rock. While Maushold can be easily punished with physical walls holding Rocky Helmet such as Hippowdon, Galarian Weezing, and Chesnaught, it can often deal massive amounts of damage to them before fainting, which can give other physically offensive setup sweepers such as Revavroom and Mimikyu the wiggle room to pull off a sweep later in the game. Maushold particularly benefits from specially offensive teammates like Armarouge and Thundurus that can exploit any of the aforementioned physical walls hoping to get rid of Maushold. On generally offensive structures, Maushold can act as the primary setup sweeper and therefore greatly appreciates Knock Off support from Pokemon like Krookodile and Galarian Zapdos to remove Rocky Helmet from opposing physical walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 655207, "username": "Sir Tetris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 555741, "username": "MachJacob"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Maushold-Four": {
    "overview": "<p>Boasting the incredibly strong Technician Population Bomb along with the ability to set up and remove hazards in a single turn, Maushold stands out as one of the most threatening setup sweepers in the metagame. Due to its ability to outspeed and OHKO the majority of the tier after a single turn of boosting, it is imperative for every non-hyper offense team to have an answer to Maushold. Unfortunately for Maushold, this can be done incredibly easily by having any decently defensive Pokemon hold Rocky Helmet, as the multihit nature of Population Bomb simultaneously serves as its greatest strength and its Achilles' heel. Maushold's relative frailty also means that it can be easily dealt with by strong priority users and bulkier Pokemon that are able to survive a hit and KO it back.</p>",
    "comments": "<h3>Other Options</h3> <p>Maushold's greatest weakness, contact effects, can be neutralized with Protective Pads, albeit at the cost of drastically decreasing Population Bomb's reliability. Loaded Dice is an alternative to Wide Lens that improves Bullet Seed's reliability while still guaranteeing at least 4 hits with Population Bomb. Tera Fire can be used to prevent Maushold from getting burned by Will-O-Wisp Galarian Weezing and Talonflame and grant it free turns to set up against them.</p> <h3>Checks and Counters</h3> <p><strong>Contact Effects</strong>: Any of the physical walls in the tier, including Hippowdon, Chesnaught, Galarian Weezing, and Slowbro, can eliminate Maushold with the help of Rocky Helmet, with the interaction causing Maushold to faint after hitting just 6 times from full health. Pokemon such as Static Bellibolt and Flame Body Talonflame can also be used to cripple, instead of outright KO, Maushold at a very high probability as punishment for clicking Population Bomb; although they are less reliable, they have an edge over the other physical walls, as their anti-Maushold weapon cannot be neutralized with Knock Off.</p> <p><strong>Faster Wallbreakers</strong>: Faster offensive Pokemon such as Barraskewda and Choice Scarf users such as Galarian Zapdos and Mienshao can revenge kill an unboosted Maushold, though the latter two have to be wary of a possible Tera Ghost from Maushold that could flip the game in its favor in a single turn.</p> <p><strong>Steel-type Wallbreakers</strong>: Powerful Steel-types such as Hisuian Goodra and Choice Specs Magnezone can survive a hit from Maushold and KO it back. Hisuian Goodra in particular can temporarily cripple Maushold with Gooey and therefore allow its teammates to deal with it even if Maushold has accrued several Tidy Up boosts.</p> <p><strong>Mimikyu</strong>: In the hyper offense mirror matchup, Mimikyu is one of the only Pokemon that can consistently deal with Maushold thanks to its immunity to Population Bomb. Mimikyu does, however, need to be wary of Bite that can take it out with enough flinches and Bullet Seed that can potentially KO Mimikyu past Disguise after Maushold gets one or two Attack boosts.</p>",
    "sets": {
      "Tidy Up": {
        "description": "<h4>Set Details</h4> <p>Tidy Up offers incredible utility, as it allows Maushold to set up and unpreventably remove hazards in a single slot. Bite is a go-to coverage option, as it allows Maushold to hit Ghost-types like Basculegion-F and Hisuian Zoroark. Bullet Seed is an alternative that can similarly hit the aforementioned Ghost-types as well as Rocky Helmet Hippowdon, which is one of Maushold's most common checks, at the cost of fizzling against Gengar. Encore can provide Maushold with free turns by locking an opponent into a useless move, which can often be game-winning due to Maushold's unrivaled power. Low Kick is another coverage option that enables Maushold to deal with bulky Steel-types such as Hisuian Goodra, Registeel, and Eviolite Bisharp. Wide Lens is crucial for Maushold to improve Population Bomb's consistency, as otherwise it only has an approximate 35% chance to hit 10 times. Technician boosts all of Population Bomb, Bite, and Bullet Seed, enabling Maushold to be incredibly threatening despite its low Attack stat. Tera Ghost provides Maushold with valuable immunities to Fighting and Normal and a resistance to Bug, which can prevent it from getting revenge killed by Fighting-type attacks, including Body Press from Chesnaught and Close Combat from Choice Scarf Galarian Zapdos, as well as priority attacks such as Conkeldurr's Mach Punch, Entei's Extreme Speed, and Slither Wing's First Impression. This can be capitalized on with Encore to give Maushold incredibly valuable free turns to set up. Tera Normal can be used instead to boost Population Bomb's power, which allows Maushold to OHKO bulky Pokemon like Fezandipiti and specially defensive Umbreon without needing to set up.</p> <p>Maushold fits best on offense, particularly hyper offense, structures, primarily due its ability to remove hazards despite already being an incredibly powerful setup sweeper. Becase of this, it synergizes with other setup sweepers like Throat Spray Yanmega and Lum Berry Salamence that are weak to Stealth Rock. While Maushold can be easily punished with physical walls holding Rocky Helmet such as Hippowdon, Galarian Weezing, and Chesnaught, it can often deal massive amounts of damage to them before fainting, which can give other physically offensive setup sweepers such as Revavroom and Mimikyu the wiggle room to pull off a sweep later in the game. Maushold particularly benefits from specially offensive teammates like Armarouge and Thundurus that can exploit any of the aforementioned physical walls hoping to get rid of Maushold. On generally offensive structures, Maushold can act as the primary setup sweeper and therefore greatly appreciates Knock Off support from Pokemon like Krookodile and Galarian Zapdos to remove Rocky Helmet from opposing physical walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 655207, "username": "Sir Tetris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 555741, "username": "MachJacob"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Armarouge": {
    "sets": {
      "Calm Mind + 3 Attacks": {
        "description": "<p>Armarouge is a devastating special attacker, capable of breaking holes in teams or taking advantage of opposing physical attackers to boost its Speed with Weak Armor in order to sweep. Armarouge particularly excels against Cyclizar, the most common form of entry hazard removal in the tier, due to the minimal damage received and the fact that most of Cyclizar's moves will activate Weak Armor. Psyshock targets the weaker Defense of opposing Pokemon such as Chansey and Assault Vest Cyclizar. Energy Ball is used to hit Water-types with high Defense like Slowbro and Suicune. Tera Fairy provides valuable resistances to Bisharp's Sucker Punch and Slither Wing's First Impression, as well as allowing Armarouge to shrug off Knock Off from Krookodile, Mienshao, and Galarian Zapdos. Tera Fairy also grants an immunity to Cyclizar's Dragon Tail, preventing Armarouge from being phazed out. Tera Grass grants resistances to Barraskewda's and Crawdaunt's Aqua Jet, Empoleon's Surf, and Krookodile's Earthquake. This also boosts the damage of Energy Ball, allowing Armarouge to threaten OHKOs on Krookodile, Terrakion, and Hippowdon.</p> <p>Calm Mind Armarouge is most comfortable on balance and offense teams, where it can use its wallbreaking ability to open up holes for its team to exploit or threaten a late-game sweep. Pivot support from VoltTurn users such as Cyclizar, Thundurus, and Hisuian Zoroark are important to get Armarouge into favorable matchups against Pokemon like Hippowdon and Amoonguss while preserving its HP. These Pokemon can also bait out weak Knock Off from Cyclizar and Reuniclus, easily allowing Weak Armor to activate. Mienshao and Galarian Zapdos invite physical walls like Hippowdown and Slowbro in, which Armarouge can take advantage of. Opposing special attackers like Gengar, Mew, and Salamence outspeed and threaten Armarouge, so allies like Cyclizar, Hisuian Goodra, and Jirachi, respectively, can switch into their attacks for it. Priority moves are one of the most reliable answers to Armarouge after Weak Armor activates, so pairing it with Psychic Surge Indeedee can nullify this weakness with the added benefit of empowering its Psychic-type moves.</p>"
      },
      "Endure + Weakness Policy": {
        "description": "<p>Weakness Policy Armarouge is a naturally potent wallbreaker and sweeper that can immediately chunk holes in the opposing team thanks to its excellent STAB combination and decent bulk. Armarouge can use the combination of Endure and Weakness Policy to flip situations around at the drop of a hat and threaten a devastating sweep. Armor Cannon is the centerpiece of Armarouge's arsenal as a wallbreaker due to its high Base Power and its drawbacks made negligible by having Endure as an option. Stored Power can deal incredible amounts of damage after a Weakness Policy and Weak Armor activation, with the drawback of initially being very weak. Expanding Force is an option on Psychic Terrain teams that can OHKO most non-resistant foes in the tier while Psychic Terrain is active and is still a decently powerful attack otherwise. Energy Ball provides Armarouge with coverage that is essential for dealing with Water-types such as Slowbro and Suicune. Calm Mind is an optional setup move that allows Armarouge to capitalize on Pokemon that cannot deal much damage to it like Cyclizar, Fezandipiti, and Galarian Weezing and keeps it from being dependent on Weakness Policy for strengthening its attacks. Weak Armor allows Armarouge to outspeed a massive portion of the tier after surviving a physical attack, thus enabling it to act as an excellent late-game cleaner. A Timid nature ensures that Armarouge outspeeds even the fastest Choice Scarf users in the tier, such as Terrakion and Gengar, at +2. Tera Ground makes Armarouge immune to Sandstorm damage and also lets it deny Thunder Wave and Electric-type moves from Pokemon such as Thundurus, Jirachi, and Reuniclus, which gives it time to either setup further or pick up a KO. Tera Normal can be used to turn the tables on a Ghost-type revenge killer like Gengar or Mimikyu. Tera Psychic boosts the damage of Armarouge's strong Psychic-type attacks even further and is particularly useful in Psychic Terrain.</p> <p>Weakness Policy Armarouge fits well on hyper offense and offensive structures that appreciate a safety net that can revenge kill a Choice item user such as Galarian Zapdos or Krookodile if needed and possibly sweep in return. Armarouge can also cover the role of a wallbreaker and cleaner on balance structures that aim to gradually chip away at the opposing team due to its innate firepower and ability to quickly boost its Speed. Armarouge synergizes particularly well with Psychic Terrain and thus partners well with lead Psychic Surge Indeedee; not only does Psychic Terrain power up Armarouge's Psychic-type STAB attacks to unstoppable levels, it also stops Armarouge from being revenge killed with a priority move, which is often its biggest worry after a successful Endure. Armarouge often finds its itself lacking meaningful ways to deal with specially defensive walls such as Chansey, Umbreon, and Hisuian Goodra and therefore benefits from strong physical sweepers such as Swords Dance Terrakion and Shift Gear Revavroom and, on bulkier structures, wallbreakers such as Conkeldurr, as they can help to remove or deal large chunks of damage to Armarouge's checks. Armarouge benefits from hazard removal options such as Tidy Up Maushold and Rapid Spin Cyclizar, as they can prevent it from losing its health to entry hazard chip, thus keeping it from being dependent on Endure for surviving attacks. Armarouge works well with fast pivots such as Choice Scarf Jirachi and Cyclizar that can bait a Knock Off from weak physical attackers such as Cyclizar, Hisuian Goodra, and Chesnaught and use it against them to threaten a devastating sweep by activating Weakness Policy.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 555741, "username": "MachJacob"}, {"user_id": 655207, "username": "Sir Tetris"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 231398, "username": "feen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Bellibolt": {"sets": {"Mr. Belli (Defensive)": {}}},
  "Kilowattrel": {"sets": {"Offensive Pivot": {}}},
  "Revavroom": {
    "overview": "<p>Shift Gear Revavroom is one of the most threatening late-game sweepers in the tier, as with its access to Shift Gear and great defensive typing, all it needs is one boost to offensively overwhelm most of the tier. Setting up is made easier with its ability, Filter, which allows it to take a Flamethrower from Pokemon like Galarian Weezing and Noivern. Revavroom also has access to useful coverage moves that allow it to threaten Steel-, Poison-, and Fire-types. Nevertheless, Revavroom is quite frail, as its poor Special Defense and reliance on Air Balloon to set up can be exploited by Ground-types, especially Hippowdon, Krookodile, Quagsire, and Palossand, as they can take a +1 hit from full HP and OHKO it back.</p>",
    "comments": "<h3>Other Options</h3> <p>Revavroom can opt to run Tera Blast Grass, which threatens Water- and Ground-types such as Slowbro, Quagsire, Hippowdon, and Krookodile. Temper Flare is also an option to take down Steel-types with a Ground immunity such as Bronzong and Tera Steel Rotom-H, as well as helping against opposing Revavroom. Temper Flare can also be boosted with Tera Fire, making Revavroom immune to burn. Finally, Taunt is a solid option to completely wall and set up on Quagsire and Whirlwind Hippowdon with Air Balloon as well as to block Will-O-Wisp from Galarian Weezing. Tera Flying + Taunt is a good combination to completely shut down Whirlwind Hippowdon and Quagsire even after Air Balloon breaks. Revavroom can also opt to run Leftovers + Magnet Rise to get rid of its Ground weakness and set up on Ground-types more easily. Clear Amulet can also be used to block Intimidate from Krookodile and Salamence. Toxic is an option to put bulky Fire- and Water-type switch-ins on a timer. Toxic Spikes allows Revavroom to take advantage of the free turns it generates. Toxic and Toxic Spikes could be used on a Choice Scarf Revavroom set, which could be a decent source of role compression also capable of pivoting using Parting Shot.</p> <h3>Checks and Counters</h3> <p><strong>Levitate Steel-types</strong>: Steel-types with Levitate are immune to Gunk Shot and High Horsepower and resist Iron Head. As such, Pokemon such as Bronzong and Tera Steel Rotom-H are the sturdiest answers to Revavroom.</p> <p><strong>Bulky Ground-types</strong>: Revavroom fails to KO bulky Ground-types such as Hippowdon, Quagsire, and Palossand even after a Shift Gear boost, and they threaten to KO it.</p> <p><strong>Bulky Water-types</strong>: Bulky Water-types such as Slowbro, Quagsire, and Gastrodon deal with Revavroom quite well, potentially burning it with Scald in Slowbro's case or outright KOing it with Ground-type STAB moves in Quagsire and Gastrodon's cases. They do lose to Tera Grass variants, however.</p>",
    "sets": {
      "Shift Gear": {
        "description": "<h4>Set Details</h4> <p>Revavroom is a one-dimensional Pokemon that focuses solely on setting up with Shift Gear and sweeping the opposing team. With an Adamant nature, a single Shift Gear lets Revavroom outspeed all relevant Choice Scarf users. Revavroom has access to Gunk Shot and High Horsepower, which give it excellent coverage; Gunk Shot nearly or straight-out KOes defensive staples like Fezandipiti and Chesnaught after one Shift Gear, while High Horsepower hits Steel- and Poison-types, which resist or are immune to Gunk Shot. Iron Head gives it a reliable STAB move that also hits Ground-types. Tera Ground gives Revavroom an additional STAB move in High Horsepower, which allows it to grab crucial OHKOs such as Bisharp, Volcanion, and Fezandipiti after one Shift Gear boost.</p> <p>Revavroom is a staple on hyper offense teams, and its role is usually to clean late-game. Therefore, it prefers wallbreakers and other setup sweepers such as Terrakion, Basculegion-F, Maushold, and Yanmega as partners. The usual gameplan with Revavroom is wearing down Steel- and Fire-types with it, allowing another sweeper such as Mimikyu or Necrozma to clean. The opposite is also true, as Bisharp and Yanmega can weaken bulky Ground- and Water-types for Revavroom to sweep late-game. Revavroom should usually be brought in after a teammate has been KOed to ensure that Air Balloon remains intact and it is at near full health, as it is frail defensively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231398, "username": "feen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Cyclizar": {
    "overview": "<p>Cyclizar rides in as one of the defining Pokemon of the RU metagame. Its excellent Speed tier, access to Rapid Spin, and ability Regenerator make it the premier entry hazard removal option. It can also break out its utility toolbox, threatening to remove items from common switch-ins like Jirachi and Slowbro with Knock Off; phaze setup Pokemon like Suicune, Cresselia, and Yanmega with Dragon Tail; or pivot into a teammate like Crawdaunt or Entei with U-turn to keep up momentum. U-turn can allow setup sweepers like Thundurus and Reuniclus to freely switch in and start stacking up boosts. Cyclizar is often paired with other Regenerator Pokemon like Slowbro and Amoonguss to form Regenerator cores that can be difficult to break, especially when Cyclizar is removing entry hazards. It can further offer teams a bulky pivot when it straps on the Assault Vest, allowing it to take hits from special wallbreakers like Armarouge, Basculegion-F, and Thundurus. Cyclizar needs to be careful, however, of Choice Scarf users like Galarian Zapdos and Mienshao that are looking to jam up Cyclizar's wheels and OHKO it with STAB Close Combat.</p>",
    "comments": "<h3>Other Options</h3> <p>Body Slam is an option as Cyclizar's STAB move so it can fish for paralysis instead of doing more damage with Draco Meteor or Double-Edge. On teams that may have a hard time dealing with Gastrodon and Swampert, Cyclizar can run Power Whip to threaten a 2HKO on both of them. Overheat is an option for Cyclizars looking to supercharge its matchup against Forretress and Bisharp.</p> <h3>Checks and Counters</h3> <p><strong>Choice Scarf Users and Priority</strong>: Common Choice Scarf users like Mienshao, Krookodile and Terrakion can switch in and threaten to OHKO Cyclizar with Close Combat or take advantage of its need to switch out by using Knock Off or U-turn for free progress. Gardevoir is another common Choice Scarf user that can severely hamper Cyclizar's utility role with Trick. Bisharp can OHKO it at +2 with Sucker Punch, and Slither Wing threatens to KO with First Impression if Cyclizar has taken some chip.</p> <p><strong>Ghost-types</strong>: Ghost-types block Rapid Spin and prevent Cyclizar from doing its most impartant job. Palossand isn't very threatened by Knock Off and can completely roadblock Cyclizar's efforts to remove hazards while setting its own up. Mimikyu is a Ghost-type that isn't weak to Knock Off and is immune to Draco Meteor, meaning it can set up Swords Dance for free while Cyclizar is forced to escape. Basculegion-F is a particular nuisance, as it can spinblock Cyclizar while also taking advantage of Knock Off with its Weakness Policy set. Tera Ghost on hazard setters such as Chesnaught, Empoleon, and Hippowdon can also put Cyclizar in a bind, denying it Rapid Spin removal.</p> <p><strong>Setup Pokemon</strong>: Most setup Pokemon can take advantage of Cyclizar's relative weakness and lack of status to set up in front of it, as long as it isn't running Taunt or Dragon Tail. Bisharp, Revavroom, and Terrakion can take advantage of Cyclizar's passivity and set up in front of it.</p>",
    "sets": {
      "Assault Vest": {
        "description": "<p>Assault Vest Cyclizar can safely switch into most special attackers and provide opportunities for its teammates to enter the game thanks to U-turn. Rapid Spin clears entry hazards while also granting Cyclizar a boost to Speed, which helps it outspeed most Choice Scarf users in the tier like Gardevoir and Gengar. It also gives even a paralyzed Cyclizar the opportunity to pivot out of slower opponents like Empoleon and Hippowdon. Knock Off can hit the tier's Pyschic-types such as Reuniclus and Slowbro for decent damage while also threatening the frail Ghost-types like Gengar and Hisuian Zoroark. Draco Meteor can be used to hit physical walls like Hippowdon and Slowbro. Dragon Tail is great at forcing opposing setup sweepers like Cresselia and Slowbro out. Facade can take advantage of status like burn or paralysis that Cyclizar may be inflicted by throughout the course of a game from opposing Reuniclus, Slowbro, and Thundurus. Assault Vest helps with its otherwise low natural bulk, which is also helped significantly by Regenerator recovery. Timid maximum Speed Cyclizar is faster than the majority of the tier, and the bulk provided allows it to take two Ice Beams or Sludge Waves from threats such as Basculegion-F and Gengar, respectively. Tera Fairy flips Cyclizar's weakness to Dragon-type moves into an immunity and gives a resistance to Fighting-type moves, helping against opposing Cyclizar, Salamence, and Slither Wing. Tera Steel makes Cyclizar resistant to Fairy- and Ice-type moves from the likes of Gardevoir and Empoleon, respectively. Tera Ghost makes it immune to Normal-type, allowing it to stop Rapid Spin attempts from opposing Cyclizar, while adding an immunity to Fighting-type attacks as well.</p> <p>Assault Vest Cyclizar can reliably slot onto balance or bulky offense teams as the main form of entry hazard removal while also providing item removal and pivoting. It can also be used on stall teams, though these structures often want another hazard removal option such as Defog Talonflame to reliably maintain hazard control. Cyclizar pairs well with other Regenerator Pokemon such as Amoonguss, Mienshao, and Slowbro, creating teams that are very difficult to break offensively and can provide pressure through status, hazard chip, and gradual damage. Strong offensive teammates like Crawdaunt, Conkeldurr, and Volcanion appreciate Cyclizar giving them free entry points. While Cyclizar can often keep hazards off the field, it is advised to still run hazard-resilient or Heavy-Duty Boots teammates, such as Amoonguss, Hisuian Goodra, and Mienshao, since Cyclizar may struggle against teams with Ghost-types like Palossand or Mimikyu. Assault Vest Cyclizar can struggle to retain HP against hazard-stacking archetypes, being unable to remove hazards against teams utilizing Tera Ghost on their hazard setters. To mitigate this dynamic, Cyclizar relies on pivoting into teammates who can apply offensive pressure to deny hazards from being established, like Basculegion-F, Gardevoir, and Volcanion.</p>"
      },
      "Heavy-Duty Boots": {
        "description": "<p>While usually overshadowed by the more prevalent Assault Vest set, running Heavy-Duty Boots on Cyclizar can offer meaningful benefits, allowing access to utility moves, while also making Regenerator more beneficial without needing to worry about the passive chip that comes with its usage as a spinner. Cyclizar is a master at providing utility for a team, boasting Knock Off to remove items from foes for other members of a team to take advantage of, with Heavy-Duty Boots users like Fezandipiti or Slowbro being great examples of Knock Off's usefulness over the course of a game. U-turn provides a way for Cyclizar to get out of sketchy matchups, being able to use the move safely against most of the tier with its phenomenal Speed stat. Taunt can shut down recovery or setup from foes that believe they can take advantage of the presumed passivity of Cyclizar, such as Hippowdon and Revavroom. Double-Edge can be slotted over Taunt if more damage is desired from Cyclizar, providing a harder-hitting STAB move than Rapid Spin, and its recoil is also somewhat negated with the HP gained back from Regenerator. Tera Ghost provides a last ditch-effort of escape against Fighting-types, one of Cyclizar's sketchier matchups, which is especially prevalent with the large amount of Fighting-type moves present in the tier, like Close Combat from various abusers including Slither Wing and Zapdos-Galar; however, Cyclizar is generally the last thing you want to Terastalize unless in truly dire straits, as Terastallization is usually far more effective and useful on other members of a team. Tera Ghost can also deny opposing spinners from removing entry hazards, keeping pressure on opposing teams throughout a game and additionally providing momentum through a wasted Rapid Spin.</p> <p>Heavy-Duty Boots Cyclizar fits on almost all team structures, with the main exception being hyper offense, as its role as a spinner with access to Regenerator makes it extremely reliable at removing entry hazards throughout the course of a game. To get the best use out of Cyclizar's utility, pairing it up with a Stealth Rock setter is extremely important, as Cyclizar's Knock Off makes opposing teams weaker to hazards; this can either be with allies like Hippowdon, or it can be run with Palossand on teams dedicated to hazard stacking. Additionally, pairing Cyclizar up with offensive options that can take advantage of the momentum that U-turn provides, with notable wallbreakers including Choice Band Terrakion and Volcanion being perfect teammates. Cyclizar is somewhat frail by itself, so pairing it up with defensive presences like the aforementioned physically defensive Stealth Rock setters, along with more specially defensive options like Empoleon, creates strong defensive cores that can be difficult to break and can wear down teams through a war of attrition. These defensive cores can be furthered with Regenerator cores, constantly keeping teammates healthy throughout a match, with notable teammates being Amoonguss, Slowbro, Mienshao, and Reuniclus. Pairing Cyclizar up with multiple Heavy-Duty Boots users is also wise, as it can have problems against dedicated spinblockers, with Palossand on hazard-stacking teams and Mimikyu on hyper offense builds.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 574067, "username": "Freya"}, {"user_id": 633048, "username": "HoopsspooH"}, {"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 513635, "username": "Rarelyme"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Slither Wing": {
    "sets": {
      "Bulky Pivot": {},
      "Choice Band": {
        "description": "<p>Choice Band Slither Wing functions as an elite offensive pivot and priority revenge killer, comfortably finding a role on many team structures. First Impression is a strong STAB priority attack that capably dismantles setup sweepers like Necrozma, Maushold, and Mew. Earthquake is used to hit Poison-types like Fezandipiti, Gengar, and Slowbro post Tera that otherwise resist Slither Wing's STAB moves. Heavy Slam similarly hits Fezandipiti while also threatening an OHKO on the otherwise best check to Slither Wing in the metagame, Galarian Weezing. A Jolly nature is used to outspeed Adamant Revavroom, Necrozma, and Armarouge. An Adamant nature improves Slither Wing's ability to revenge kill with First Impression, forgoing the Speed advantage to maximize damage output. Tera Bug makes First Impression even more capable against setup sweepers that resist the move, like Revavroom and Salamence, and enhances the damage output of U-turn, as well as converting the weaknesses to Fairy and Psychic to neutralities, helping Slither Wing absorb attacks from faster threats like Fezandipiti, Choice Scarf Gardevoir, and Mimikyu. Tera Steel takes advantage of Slither Wing's deceptive weight offensively with Heavy Slam to OHKO Fezandipiti, and it gives key resistances to Fairy-, Flying-, and Psychic-type attacks from faster threats like Choice Scarf Gardevoir, Galarian Zapdos, and Mew. Tera Steel does, however, make matchups into Fighting- and Ground-types like Chesnaught, Hippowdon, and opposing Slither Wing more difficult.</p> <p>Balance and bulky offense teams appreciate Slither Wing for its ability to mitigate setup sweepers, break through defensive cores, and provide a strong presence as a pivot to support its teammates. VoltTurn cores with Slither Wing and Thundurus are notably difficult to check, as Slither Wing can threaten the specially defensive walls like Assault Vest Cyclizar and Hisuian Goodra that switch into Thundurus, while Thundurus can use moves like Grass Knot to threaten physically defensive walls like Hippowdon and Knock Off to remove Heavy-Duty Boots and Rocky Helmet. Defensive teammates like Amoonguss and Empoleon can support Slither Wing by switching into Fairy-type attacks from Pokemon like Fezandipiti, Gardevoir, and Galarian Weezing, with Empoleon also being capable of using Flip Turn to act as another pivot option. Slither Wing excels on teams that stack entry hazards, forcing switches because of its sheer power and allowing teammates like Chesnaught, Empoleon, and Krookodile to establish hazards and use Knock Off to remove Heavy-Duty Boots and Rocky Helmet on Pokemon that check Slither Wing like opposing Chesnaught, Galarian Weezing, and Salamence. Hazard control is important for Choice Band Slither Wing, as it pivots into the game multiple times and can be worn down by hazard chip damage. Teammates like Cyclizar and Noivern are great for keeping hazards off the field while providing pivot support, and Galarian Weezing can be a bulky teammate with hazard removal and utility. Offensive teams that use Endure Armarouge or Protect Yanmega can make First Impression less reliable as a priority attack, so Pokemon that can handle these threats like Dragon Tail Cyclizar and Empoleon make for great teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Wo-Chien": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Wo-Chien leverages its massive bulk, ability, and utility movepool to serve as an effective wall and disruptor by removing items from and chipping away at the opposing team. Foul Play gives Wo-Chien a means of punishing physical setup sweepers like Maushold, Revavroom, and Salamence, which attempt to exploit its relative passivity. Ruination pressures Wo-Chien's common defensive answers like Galarian Weezing and is generally a useful progress maker against Pokemon lacking reliable recovery like Hisuian Goodra and Suicune. Leech Seed serves as Wo-Chien's secondary source of recovery and pairs nicely with Ruination, allowing Wo-Chien to wear down foes over the course of the match regardless of their Defense. Protect gives Wo-Chien an additional turn to recover health and scout moves from Choice item users like Okidogi, Gardevoir, and Gengar. Leftovers is essential for maximizing Wo-Chien's longevity and make up for its lack of recovery moves. While its defensive EVs are fairly customizable depending on the needs of the team, the Special Defense investment makes Wo-Chien a particularly strong answer to Shell Smash Blastoise and Calm Mind users like Slowbro, Suicune, and Necrozma. 56 Speed EVs allow Wo-Chien to outspeed max Speed Adamant Conkeldurr. Tera Poison patches up Wo-Chien's Fighting-, Fairy- and Bug-type weaknesses while denying poison from Pokemon like Fezandipiti, Okidogi, and Umbreon, which would otherwise threaten Wo-Chien's longevity. Tera Ghost similarly removes Wo-Chien's weaknesses to Bug- and Fighting-type moves but instead allows it to spinblock against Cyclizar and more effectively answer Maushold, Conkeldurr, and Yanmega.</p> <p>Wo-Chien fits nicely on balance teams that enjoy its ability to sponge hits while making progress with Knock Off and Leech Seed. Hazard-stacking teams particularly enjoy Wo-Chien's ability to remove items like Heavy-Duty Boots and Leftovers from opposing Pokemon, thus maximizing damage output from entry hazards over time. Therefore, entry hazard setters like Hippowdon, Gligar, and Gastrodon pair nicely with Wo-Chien. In addition, entry hazards cause Regenerator Pokemon like Slowbro and Cyclizar to take more damage than what they recover with every switch, preventing them from stalling out Wo-Chien. Because of its weakness to Fighting-, Bug-, and Fairy-type moves, Wo-Chien appreciates teammates that complement its defensive profile like Fezandipiti, Galarian Weezing, and Slowbro. Fezandipiti in particular is a strong partner, as it can deny status and recovery moves from Pokemon like Umbreon and Amoonguss via Taunt and safely pivot back into Wo-Chien. Physically defensive teammates like Rocky Helmet Hippowdon and Bellibolt are also useful partners, as they can switch in on and punish U-turns and Knock Offs directed at Wo-Chien. Status moves are especially troublesome for Wo-Chien, as they threaten its ability to sit in on other Pokemon and recover health throughout the battle, so Pokemon that are immune to or don't mind status conditions like Magnezone and Conkeldurr can be helpful as teammates. Pokemon that can spread burn like Will-O-Wisp Galarian Weezing, Scald Slowbro, and Steam Eruption Volcanion are beneficial for Wo-Chien too, allowing it to more comfortably endure physical attacks and retaliate with Foul Play. Wo-Chien benefits greatly from entry hazard removal, as it will likely be switched in and out throughout the course of the battle. Therefore, Pokemon that can remove entry hazards like Cyclizar, Noivern, and Galarian Weezing make for nice partners. Cyclizar is a particularly good partner on hazard-stacking teams, since Rapid Spin does not clear entry hazards on the opponent's side, thus improving Wo-Chien's ability to chip down the opposing team through Knock Off and Leech Seed. Cyclizar also benefits from Wo-Chien's typing, which shuts down Prankster Thunder Wave from Thundurus and Klefki and Stun Spore from Amoonguss. Wo-Chien often lures in Poison- and Fighting-types that can be exploited by Future Sight users like Slowbro and Reuniclus. Because of its relative passivity, Wo-Chien can easily get overwhelmed by opposing wallbreakers and setup sweepers, especially if it's unable to Terastallize. As such, potent revenge killers and priority users like Choice Scarf Galarian Zapdos and Gardevoir and First Impression Slither Wing are appreciated as well.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 64212, "username": "Seed Sower"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 655207, "username": "Sir Tetris"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Munkidori": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Fezandipiti": {
    "overview": "<p>Despite its mediocre offensive stats, Fezandipiti leverages its excellent bulk, good defensive typing, and signature Toxic Chain ability to be a threatening late-game cleaner while also serving as a solid part of its team's defensive backbone. Fezandipiti's 4x resistance to Fighting makes it an excellent answer to Pokemon like Mienshao and Slither Wing, and its immunity to Dragon and great Special Defense make it a great switch-in to Salamence and Noivern, all of which it can take advantage of to set up Calm Mind or fire off its Toxic-spreading attacks. Fezandipiti does have several weaknesses to common types in the tier, however, like the Ground-type Hippowdon and Swampert and the Psychic-type Gardevoir and Armarouge, all of which are able to survive a Moonblast and threaten Fezandipiti back with super effective attacks. There are many Calm Mind users that Fezandipiti can thrive against such as Suicune and Raikou, but Covert Cloak Slowbro and Magic Guard Reuniclus can reliably win the matchup unless Fezandipiti Terastallizes into an advantageous type and uses Taunt to prevent them from boosting.</p>",
    "comments": "<h3>Other Options</h3> <p>Heat Wave allows Fezandipiti to hit the Steel-types that typically wall it for super effective damage, reducing its reliance on teammates to answer them. Nasty Plot boosts Fezandipiti's Special Attack faster than Calm Mind, making it a more immediate threat with maximum Special Attack and Speed EVs as well as Heat Wave. Fezandipiti has other options for Tera types, such as Steel, which allows it to resist Terrakion's Stone Edge and Gardevoir's Psychic. Tera Electric grants Fezandipiti resistances to Thundurus's Thunderbolt and Galarian Zapdos's Brave Bird while also making it immune to the paralysis inflicted by Jirachi and Thundurus. Fezandipiti also has the option to drop Calm Mind and run more bulk to take a utility role with moves such as Toxic, which is more reliable than Toxic Chain, and Alluring Voice, which is weaker than Moonblast but can punish faster setup sweepers.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Steel-types like Empoleon, Magnezone, and Revavroom resist Moonblast, are immune to being poisoned, and can threaten Fezandipiti with super effective STAB moves.</p> <p><strong>Poison-types</strong>: Poison-types like Amoonguss and Tentacruel resist Moonblast, cannot be poisoned, and can use disruptive moves like Clear Smog and Haze to remove Fezandipiti's boosts. Galarian Slowbro can use Psyshock to get around Fezandipiti's Calm Mind boosts.</p> <p><strong>Fast Physical Attackers</strong>: Physical threats like Terrakion and Galarian Zapdos as well as Choice Scarf users like Krookodile and Terrakion can outspeed Fezandipiti and deal significant damage to it or KO if it is not healthy enough.</p> <p><strong>Jirachi</strong>: Jirachi in particular is a threat to Fezandipiti due to a combination of its Steel typing, good stats, and variety of disruptive tools. Flinches from super effective Iron Head, paralysis from Body Slam and Thunder Wave, Psychic Noise, Encore, and Trick can all stop an unprepared Fezandipiti in its tracks. Calm Mind Jirachi also beats non-Taunt Fezandipiti, and Doom Desire and Future Sight can prevent a safe entry.</p>",
    "sets": {
      "Fast Calm Mind": {
        "description": "<h4>Set Details</h4> <p>Roost is used to keep Fezandipiti's HP high while it sets up. U-turn allows Fezandipiti to pivot out of unfavorable matchups while potentially applying Toxic thanks to its ability. Taunt is used to prevent opposing Pokemon from using their own setup or healing moves, taking advantage of Fezandipiti's Speed to act first and deny its foe the chance to move. Heavy-Duty Boots prevents Fezandipiti from being worn down by entry hazards, improving its longevity. Covert Cloak is primarily used to protect Fezandipiti from Jirachi's Iron Head flinches and Body Slam paralysis as well as Psychic Noise from Slowbro and Reuniclus after Terastallizing, but it also appreciates the effect on moves such as Gardevoir's Moonblast and Salamence's Hurricane. With a Timid nature and 200 Speed EVs, Fezandipiti is fast enough to outspeed Krookodile, which threatens it with strong STAB Earthquake but is vulnerable to Fezandipiti's Moonblast. Terastallizing into the Water-type turns Fezandipiti's Steel weakness into a resistance, allowing it to better take on foes like Jirachi, Hisuian Goodra, and Bisharp, and its lack of weaknesses allows Fezandipiti to survive most neutral hits from other threats. Tera Fairy removes Fezandipiti's Ground and Psychic weaknesses, giving it better matchups against Pokemon like Hippowdon and Reuniclus, while maintaining its important resistances to Fighting and Dark so it can still to switch into Close Combat and Knock Off from Pokemon like Mienshao, Slither Wing, and Crawdaunt. The damage boost from Tera Fairy also guarantees that Moonblast can OHKO Pokemon like Galarian Zapdos, Krookodile, and Terrakion after one Calm Mind.</p> <p>Fezandipiti fits best on balance or bulky offense teams that can chip its checks down across the game and enable a sweep. Knock Off from Cyclizar, Mienshao, and Galarian Zapdos can remove Leftovers from Jirachi and Empoleon to make the lower damage of Fezandipiti's attacks more meaningful as well as Covert Cloak from Slowbro, allowing Toxic Chain to affect it. Fezandipiti benefits from a VoltTurn core with teammates like Cyclizar, Slither Wing, and Magnezone, and it can join in if running U-turn. Magnet Pull Magnezone is a useful teammate, capable of forcing damage onto Steel-types like Bisharp and Jirachi that Fezandipiti can struggle to break through, and U-turn pivoting can ensure Magnezone is able to attack these targets. Fezandipiti works best with teammates that can take the super effective Ground-, Psychic-, and Steel-type attacks that threaten it, such as Noivern, Slowbro, and Empoleon. The Pokemon that want to switch in against Fezandipiti are often vulnerable to Spikes, as Jirachi and Hisuian Goodra lack reliable recovery and typically run items other than Heavy-Duty Boots, so setters such as Chesnaught, Klefki, and Quagsire are valuable.</p>"
      },
      "Pivot": {}
    },
    "credits": {"writtenBy": [{"user_id": 555741, "username": "MachJacob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 598717, "username": "Sneakyplanner"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  }
}