{
  "Venusaur": {"sets": {"Sun Sweeper": {}}},
  "Blastoise": {"sets": {"Shell Smash": {}}},
  "Vileplume": {"sets": {"Phyiscally Defensive": {}}},
  "Slowbro": {"sets": {"Defensive": {}, "Calm Mind": {}}},
  "Slowbro-Galar": {"sets": {"Defensive": {}}},
  "Muk-Alola": {"sets": {"RestTalk": {}}},
  "Cloyster": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Shell Smash Sweeper": {}}},
  "Gengar": {"sets": {"Choice Scarf": {}, "Hex + Will-O-Wisp": {}, "Nasty Plot": {}}},
  "Chansey": {"sets": {"Defensive": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Ditto": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Imposter": {"description": "<p>Tera Steel makes Ditto immune to Toxic Spikes and take less from Stealth Rock. It also lets Ditto revenge kill Belly Drum Hariyama. A Quiet nature and the Special Attack investment is in case Ditto transforms into a Future Sight user like Slowbro.</p>"}}},
  "Vaporeon": {"sets": {"Defensive": {}}},
  "Zapdos-Galar": {"sets": {"Choice Scarf": {}, "Choice Band": {}}},
  "Moltres": {
    "overview": "<p>Moltres is a premier defensive pivot in the RU metagame, boasting decent bulk and having some really valuable resistances coming from its Fire / Flying typing. This gives it the capacity to check many of RU's premier threats such as Cobalion, Gardevoir, and Mimikyu. Flame Body allows Moltres to punish physical attackers and U-turn users, such as Cyclizar, Slither Wing, and Galarian Zapdos; it is also a valuable tool for punishing Maushold's Population Bomb and Cinccino lacking Rock Blast. Heavy-Duty Boots provides Moltres with a valuable chance to ignore its 4x Stealth Rock weakness, but it is very reliant on the item and is therefore susceptible to Knock Off from Cyclizar and Galarian Zapdos, among others. Pokemon that are checked by Moltres can often pivot out with U-turn and bring in a teammate that can deal with it, such as Barraskewda, Terrakion, or Basculegion-F.</p>",
    "comments": "<p>Other Options</p> <p>===</p> <p>Moltres can run Brave Bird as an alternative to Flamethrower to punish switch-ins expecting Flamethrower to hit them harder, such as Tera Fire Maushold and Cyclizar. Scorching Sands can be run alongside Tera Ground for a stronger STAB option with a chance to burn. Roar is a good phazing option for Moltres to force out setup sweepers like Armarouge and Okidogi.</p> <p>Checks and Counters</p> <p>===</p> <p><strong>Item Removal</strong>: Moltres is vulnerable to Stealth Rock upon losing its Heavy-Duty Boots. Pokemon like Cyclizar, Deoxys-D, Okidogi, and Galarian Zapdos can often take the opportunity to hit Moltres with Knock Off, thus crippling its ability to switch in. Choice Scarf + Trick users such as Gengar, Jirachi, and Gardevoir can also remove Moltres's Heavy-Duty Boots with Trick.</p> <p><strong>Rock-types and Rock-type Coverage</strong>: Rhyperior, Terrakion, and Lycanroc-D can easily switch in on Flamethrower and retaliate back with strong Rock-type STAB moves, although they fear being burned by Will-O-Wisp. Cobalion and Mienshao, which would supposedly be checked by Moltres, can carry Stone Edge on some of their sets. Hippowdon, Breloom, and Cincinno can also carry Rock-type coverage for Moltres, which it has to watch out for, but the former two fear being burned due to being slower than Moltres, while the latter has to use Rock Blast in order to not activate Flame Body.</p> <p><strong>Electric-types</strong>: Electric-types such as Rotom-H, Raikou, and Magnezone can easily pressure Moltres with Volt Switch or Thunderbolt, while Rotom-H specifically resists Moltres's Fire-type STAB moves.</p> <p><strong>Water-types</strong>: Water types such as Slowbro, Volcanion, and Empoleon can easily tank Moltres's Flamethrower and deal strong super effective damage while often not caring about Will-O-Wisp burns.</p>",
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Set Details</p> <p>===</p> <p>Moltres can make use of its solid typing to be a good utility pivot. U-turn is Moltres's main source of momentum, as it can make use of its resistances to enter the field and pivot into another teammate safely. Will-O-Wisp is good to spread burns to cripple physical attackers and punish foes that try to switch into Moltres, while Roost increases Moltres's longevity. A Timid nature and 184 Speed EVs allow Moltres to hit 288 Speed, which is enough to outspeed maximum Speed Gyarados and Slither Wing; the rest is distributed into its Defense to help out with physical attackers. Heavy-Duty Boots allows Moltres to avoid Stealth Rock, which would be extremely problematic otherwise. Tera Fairy allows Moltres to keep some of its important resistances, such as Fighting, while giving it a new important Dark resistance and a Dragon immunity against foes such as Bisharp, Crawdaunt, and Regidrago. Tera Dragon alternatively gives Moltres a good matchup into Water- and Electric-types, allowing it to check important targets such as Barraskewda, Volcanion, and Thundurus; it is also the best Tera type against rain teams. Tera Ground helps out with Moltres's quadruple weakness to Stealth Rock while also giving it an important immunity to Electric.</p> <p>Moltres fits best on bulky offense or balance structures, which appreciate its capacity to weaken physical attackers and bring in teammates safely thanks to U-turn. Cyclizar is one of Moltres's best partners, as it can remove opposing items with Knock Off for Moltres while packing Rapid Spin to clean the field of entry hazards for Moltres to switch in more easily if Moltres's item has been removed. It is also one of the best switch-ins to for Water- and Electric-type moves and Volcanion checks. Good Knock Off absorbers are also appreciated such as Cobalion, Hippowdon, and Rhyperior, since Moltres hates having its Heavy-Duty Boots removed. Frail wallbreakers also appreciate Moltres's capacity to pivot them in safely. Hex Gengar is a good partner, as it takes advantage of Moltres spreading burns. Breloom and Hisuian Lilligant take advantage of Moltres forcing in Water-, Ground-, and Rock-types such as Basculegion-F, Rhyperior, and Empoleon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 388824, "username": "Ampha"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Mew": {"sets": {"Nasty Plot": {}, "Double Dance": {}}},
  "Typhlosion-Hisui": {"sets": {"3 Attacks + Will-O-Wisp": {}, "Choice Scarf": {}}},
  "Feraligatr": {"sets": {"Dragon Dance": {}}},
  "Politoed": {"sets": {"Rain Setter": {}}},
  "Quagsire": {"sets": {"Physically Defensive": {}}},
  "Espeon": {"sets": {"Choice Specs": {}, "Calm Mind": {}, "Choice Scarf": {}}},
  "Umbreon": {"sets": {"Wish Support": {}}},
  "Forretress": {"sets": {"Support": {}}},
  "Kingdra": {"sets": {"Rain Sweeper": {}}},
  "Raikou": {"sets": {"Calm Mind": {}, "Offensive Pivot": {}}},
  "Entei": {"sets": {"Choice Band": {}}},
  "Suicune": {"sets": {"Calm Mind": {}}},
  "Swampert": {"sets": {"Defensive Utility": {}}},
  "Gardevoir": {"sets": {"Choice Scarf": {}}},
  "Breloom": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Flygon": {"sets": {"Choice Scarf": {}}},
  "Crawdaunt": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Milotic": {"sets": {"Defensive": {}}},
  "Salamence": {"sets": {"Special Attacker": {}, "Dragon Dance": {}}},
  "Jirachi": {
    "sets": {
      "Utility": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Jirachi provides speed control and offensive pivoting for many team structures. Defensively, Jirachi is a great team presence because of its great defensive typing and natural bulk, with 100 base stats across the board providing it with the longevity needed to switch into several attacks for its teammates. Iron Head is the most reliable STAB option for Jirachi to use since it has adequate base power, is neutral into a majority of the metagame, and boasts a high flinch rate. U-turn is a safe pivot move, allowing powerful partners to come in freely. Choice Scarf Jirachi uses Trick to hinder would-be checks like Amoonguss and Hippowdon, which can also greatly help teammates that struggle against these defensive walls like Revavroom and Terrakion. Healing Wish can give a second opportunity to a teammate that may otherwise not have enough health to get back into a game reliably. Using a Jolly nature with max Attack and Speed enables Jirachi to outspeed a majority of the tier, tying with other Choice Scarf users like Galarian Zapdos or Dragon Dance Salamence after a Speed boost. Tera Steel is run to maximize its damage output with Iron Head, which can allow Jirachi to potentially flinch its way through the opponent's physical wall, along with hitting several notable benchmarks like OHKOing Terrakion and 2HKOing Noivern and Galarian Zapdos.</p> <p>Choice Scarf Jirachi is primarily seen in offense and balance structures, where it can pack speed control, support, disruption, and a solid defensive profile into one slot. Jirachi is one of the best switch-ins to Fairy- and Poison-types in the tier, as well as having key resistances to Dragon- and Psychic-type attacks, making it a reliable option to take a Gardevoir or Fezandipiti Moonblast or Salamence Outrage. Teammates weak to Fairy-type moves, such as strong Dragon- or Fighting-types like Salamence and Terrakion, are grateful for Jirachi's presence on the team to fall back on. Taking advantage of Choice Scarf Jirachi's ability to hinder and chip at physically defensive walls like Amoonguss, Hippowdon, and Palossand, teammates such as Revavroom, Mimikyu, and Okidogi can position themselves to set up reliably. Teammates that lack recovery such as Armarouge and Galarian Zapdos can function as both mid-game breakers and late-game cleaners when paired with Healing Wish support from Jirachi.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamingoPokeman"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Deoxys-Defense": {"sets": {"Utility": {}}},
  "Torterra": {"sets": {"Shell Smash Sweeper": {}}},
  "Infernape": {"sets": {"Physical Attacker": {}, "Nasty Plot": {}}},
  "Empoleon": {"sets": {"Specially Defensive": {}}},
  "Floatzel": {"sets": {"Choice Band": {}}},
  "Gastrodon": {"sets": {"Specially Defensive": {}}},
  "Bronzong": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Stealth Rock": {}, "Bulky Setup Sweeper": {}}},
  "Lucario": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Nasty Plot": {}}},
  "Hippowdon": {
    "overview": "<p>Hippowdon is one of the best physical walls in the tier, excelling thanks to its high base HP and Defense as well as the difficult to break pure Ground typing. Hippowdon has the best raw physical bulk compared to other physical walls such as Slowbro, Chesnaught, Cobalion, and Amoonguss. This bulk allows it to take neutral hits exceptionally well, making it a safe switch-in to unresisted moves like Cobalion’s Close Combat and Galarian Zapdos’s Brave Bird. As it is taking these hits, it is wearing foes  down through passive damage from the sand it summons. It also has many chances to switch in, giving it plenty of opportunities to set up Stealth Rock. Hippowdon is the anchor for most balance teams in the tier, putting in work and making progress in basically every game. However, Hippowdon can struggle with particularly strong wallbreakers like Choice Band Okidogi or Galarian Zapdos because does not resist their STAB attacks and struggles to take them effectively, and it is also vulnerable to passive damage such as entry hazards.</p>",
    "comments": "<p>Other Options</p> <p>====</p> <p>Certain teams such as ones with Pokemon running Synthesis or that have teammates that dislike passive sandstorm chip such as Alolan Muk and Suicune would prefer Sand Force, effectively giving it no ability. Sand Force also makes it easier to Terastallize Hippowdon, since it doesn’t have to worry about its own sandstorm and has a better matchup into other Hippowdon due to its stronger Earthquake. Hippowdon can also run varying amounts of Special Defense in order to better match up against special attackers — for example, 140 Special Defense EVs to survive two Photon Geysers from Necrozma  — but Hippowdon often relies on maximum physical bulk to take neutral physical attacks.</p> <p>Checks and Counters</p> <p>====</p> <p><strong>Ground-immune Pokemon</strong>: Mono-Earthquake Hippowdon is unable to hit Ground-immune foes at all, making Rotom-H, Moltres, Salamence, and Noivern incredibly safe switch-ins to it.</p> <p><strong>Grass-types</strong>: Hippowdon with Stone Edge can hit Ground-immune foes but can't do any real damage to Grass-types such as Chesnaught.</p> <p><strong>Special Attackers</strong>: Hippowdon's low Special Defense and reliance on Defense investment means it is vulnerable to special attacks even from uninvested attackers. Pokemon like Gengar and Gardevoir are attackers that Hippowdon does not want to switch in on, and bulky Pokemon with decent special damage such as Slowbro and Reuniclus are able to take Hippowdon's Earthquakes and threaten it in return.</p> <p><strong>Wallbreakers with Entry Hazard Support</strong>: Pokemon like Choice Band Okidogi, Terrakion, and Mienshao can overcome Hippowdon's raw physical bulk with the help of chip damage such as hazard support. Okidogi's Close Combat is favored to 2HKO Hippowdon from full with Stealth Rock up and is guaranteed to 2HKO with a single layer of Spikes.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Set Details</p> <p>===</p> <p>The tier is full of threatening physical attackers, and Hippowdon handles most of them with ease, switching into attacks from Pokemon like Terrakion, Revavroom, Kleavor, Krookodile, Maushold, and Bisharp. Hippowdon's sand provides passive damage and helps disarm other weather teams by removing their weather. Stealth Rock is the most common option, as Hippowdon makes a good setter due to its many chances to switch in and good matchup against Cyclizar, the tier's best spinner. Whirlwind gives Hippowdon the option to force out setup sweepers or rack up chip damage against foes trying to switch into Earthquake. Whirlwind is preferred over Roar due to Throat Chop Bisharp blocking the latter move. Stone Edge is a coverage  option to hit Flying-types trying to switch into the normally passive Hippowdon, allowing it to turn the tables on matchups like Rotom-H, Noivern, and Moltres. Stone Edge also helps to break Air Balloon on Pokemon such as Cobalion and Revavroom that try to turn Hippowdon into a setup opportunity. Rocky Helmet is the most common item due to its importance in dealing with Maushold, a Pokemon that can otherwise threaten to sweep teams on its own, while also providing chip damage against physical attackers such as Cobalion and Kleavor. However, teams with other answers to Maushold or that don’t need the passive damage can instead run Leftovers or Heavy-Duty Boots. Tera Ghost is an all-around strong defensive type that blocks Rapid Spin from Cyclizar, allows it to take on Cobalion even after a Swords Dance or Iron Defense, and beats other Fighting types like Conkeldurr and Slither Wing. Tera Dragon removes Hippowdon's weaknesses to Grass and Water, being especially helpful against rain teams. Tera Poison gives Hippowdon a resistance to Grass, Fairy, and Fighting and makes Hippowdon immune to Toxic and able to absorb Toxic Spikes, being useful on teams that are otherwise weak to them.</p> <p>Hippowdon is common on bulky offense and balance teams. However, Hippowdon’s weaknesses must be accounted for in teambuilding, especially when considering the set it runs. Whirlwind Hippowdon needs to be paired with something that can handle Ground immune Pokemon like Noivern, Moltres, and Rotom-H well. Assault Vest Cyclizar and Rotom-H are two Pokemon that can safely switch into them. While Hippowdon is able to switch into strong Fighting-type attacks from Pokemon like Cobalion and Mienshao when fully healthy, it loses this resilience with even just a little bit of chip damage. Therefore, Hippowdon should be paired with a more sturdy Fighting resistant Pokemon such as Slowbro or Moltres. Hippowdon without Whirlwind may require extra support for physical setup sweepers. Choice Scarf users faster than Salamence, such as Mienshao, Terrakion, Gengar, and Hisuian Zoroark, can all fill this role. Non-Stealth Rock Hippowdon should be paired with another Stealth Rock setter such as Empoleon or Cobalion.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598717, "username": "Sneakyplanner"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Toxicroak": {"sets": {"Swords Dance": {}}},
  "Magnezone": {"sets": {"Choice Specs": {}, "Assualt Vest": {}}},
  "Rhyperior": {"sets": {"Stealth Rock": {}}},
  "Yanmega": {"sets": {"Speed Boost Sweeper": {}}},
  "Porygon-Z": {"sets": {"Choice": {}}},
  "Froslass": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Spikes Lead": {}}},
  "Rotom-Heat": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Azelf": {"sets": {"Expert Belt": {}, "Choice Scarf": {}, "Offensive Stealth Rock": {}}},
  "Cresselia": {"sets": {"Bulky Calm Mind": {"description": "<p>136 Speed EVs allows Cresselia to outspeed Modest Volcanion.</p>"}, "Fast Calm Mind": {"description": "<p>216 Speed EVs with Timid Nature allows Cresselia to outspeed Max Speed positive nature Hoopa-Unbound.</p>"}}},
  "Conkeldurr": {"sets": {"Guts Wallbreaker": {}}},
  "Krookodile": {"sets": {"Choice Scarf": {}, "Stealth Rock": {}, "Bulk Up": {}, "Choice Band": {}}},
  "Zoroark-Hisui": {"sets": {"Choice": {}, "Nasty Plot": {}}},
  "Cinccino": {"sets": {"Tidy Up": {}}},
  "Reuniclus": {"sets": {"Calm Mind Sweeper": {}}},
  "Amoonguss": {"sets": {"Defensive": {}}},
  "Mienshao": {"sets": {"Life Orb": {}, "Choice Scarf": {}}},
  "Bisharp": {"sets": {"Swords Dance": {}}},
  "Cobalion": {
    "sets": {
      "IronPress": {
        "description": "<p>Cobalion is relatively unique in its role and stat spread, being both very physically tanky with a good defensive typing while also being relatively speedy. These attributes allow Cobalion to reliably serve as both a defensive pivot and a setup sweeper at the same time. Cobalion's typing lets it take advantage of common physical attackers like Cyclizar, Bisharp, and Kleavor, setting up Iron Defense in front of them to minimize the damage it takes from them while also threatening them back with a powerful Body Press. Heavy Slam lets Cobalion hit Fairy-types that don't typically mind a Body Press, like Fezandipiti and Gardevoir. Taunt gives Cobalion protection from status moves like Whirlwind from Hippowdon and Stun Spore from Amoonguss, while also preventing bulky setup Pokemon like Slowbro and Tera Water Fezandipiti from setting up against it. Alternatively, Cobalion can reliably set Stealth Rock using its high Speed and imposing offensive presence. Cobalion may choose to forgo Heavy Slam for Stone Edge as a way to effectively lure Moltres, a common Pokemon that gives Cobalion a great amount of trouble. While Leftovers greatly benefits Cobalion in its role as a sand-immune bulky setup sweeper and offsets Stealth Rock damage, Rocky Helmet allows Cobalion to serve as a perfect counter to Maushold while also punishing U-turn from the likes of Cyclizar, Jirachi, and Kleavor. 252 Speed EVs with a Jolly nature lets Cobalion outspeed threats like Mienshao, Fezandipiti, and Galarian Zapdos. Tera Ghost inverts Cobalion's Fighting weakness, letting it take on would-be threats like the aforementioned Fighting-types as well as opposing Cobalion. Tera Ghost also lets Cobalion effectively block Rapid Spin from Cyclizar.</p> <p>Cobalion is often found on balance teams and teams with bulky offenses due to its well-rounded nature and versatility. Amoonguss, Fezandipiti, and Slowbro serve as sturdy long-term counterplay to Fighting-types like Galarian Zapdos and Mienshao. Cobalion also pairs well with Flying-types like Noivern, Salamence, and Moltres, which take on Fire-, Fighting-, and Ground-type attacks aimed at Cobalion. In return, Cobalion can pivot into Rock-type attacks and Knock Off to preserve their Heavy-Duty Boots. Specially defensive Hippowdon can set up Stealth Rock for Cobalion to freely run Taunt, while Rocky Helmet Cobalion can act as a physical wall for it. Specially defensive pivots like Assault Vest Cyclizar and Empoleon are great partners for Cobalion, compensating for its poor Special bulk and offering Knock Off support to remove opposing Rocky Helmet and Heavy-Duty Boots while providing momentum via U-turn and Flip Turn, respectively. Healing Wish from Choice Scarf Gardevoir and Lunar Dance from Cresselia allows Cobalion to serve as a defensive wall early in a game, then receive a new lease on life as a setup sweeper later on. Jirachi is a fellow Steel-type that can take on Special attackers that overwhelm Cobalion over the course of a game like Gardevoir, Fezandipiti, and Reuniclus.</p>"
      },
      "Choice Specs": {
        "description": "<p>While its Special Attack might not seem that threatening at first, Cobalion uses its good Speed stat, natural bulk, and defensive type combination to fire off many hits on metagame staples like Mimikyu, Cyclizar, and Kleavor. Its STAB attacks can hit most Pokemon in the tier for huge neutral or super effective damage. It easily threatens out common Fairy-types like Gardevoir, Fezandipiti, and Mimikyu as well as naturally bulky targets like Volcanion and Jirachi, which it can usually 2HKO. STAB Vacuum Wave lets Cobalion be an effective revenge killer against weakened sweepers like Revavroom and Maushold. Volt Switch allows it to pivot out on checks like Moltres, Slowbro, and Basculegion-F to bring in a teammate that threatens them. With Focus Blast, Cobalion can notably always OHKO Assault Vest Cyclizar with standard EVs and Kleavor. On the other hand, Aura Sphere boasts perfect accuracy; it might miss out on some important OHKOs such as the aforementioned Assault Vest Cyclizar and Kleavor, but it can still OHKO important targets such as opposing Cobalion. Both Focus Blast and Aura Sphere highly weaken one of the best checks to physically oriented Cobalion sets, Hippowdon. Tera Fighting is used for even more damage on its Fighting-type STAB attacks, and Tera Electric grants Cobalion an immunity to paralysis from Pokemon such as Jirachi, lets Cobalion hit even harder with Volt Switch, and removes its weakness to priority Mach Punch from Breloom and Conkeldurr.</p> <p>Choice Specs Cobalion can fit on many archetypes, including hyper offense, bulky offense, and balance. It can bait out the checks to Cobalion's IronPress set such as Hippowdon and Moltres, which clears the way for physical threats like Revavroom and Maushold. It can also provide opportunities to bring in frail teammates like Gengar and Barraskewda through Volt Switch. Cobalion is one of the few special attackers that can threaten Fezandipiti and Chansey for decent immediate damage without setup, forcing them to heal off the damage every time they switch into its attacks, which lets it safely switch into teammates that can threaten them out like Bisharp, Okidogi, and Galarian Zapdos. Special cleaners and sweepers like Jirachi, Gardevoir, and Blastoise enjoy getting their main checks weakened by Cobalion as well. Choice Specs Cobalion enjoys support from entry hazard setters like Forretress, Hippowdon, and Empoleon to chip down its targets as well.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance Cobalion sets itself apart from other physical setup sweepers such as Terrakion and Revavroom by trading sheer breaking power in exchange for a fantastic defensive profile, which lets it also act as an answer to many common Pokemon and find plenty of switch-in opportunities. Stone Edge nails Flying-type Pokemon such as Moltres and Salamence that would normally answer Cobalion's other sets. Leftovers allows it to shrug off Stealth Rock damage, as well as resisted attacks such as Maushold's Population Bomb and Jirachi's Iron Head, which, in conjunction with its good defensive typing and natural bulk, lets Cobalion get many opportunities to enter the field throughout the game. Air Balloon is an option that allows Cobalion to switch aggressively into Ground-type Pokemon such as Hippowdon early in the game. Note that Hippowdon variants without Stone Edge cannot hit Cobalion while its Air Balloon has not been popped yet, which turns them into setup fodder. After its Air Balloon has been popped, Cobalion can act as an excellent Knock Off absorber due to it not having to worry about losing its Leftovers, its Dark resistance, and its Justified ability giving it an Attack boost. Tera Ghost turns the tables against Fighting-type Pokemon such as Mienshao, Terrakion, and opposing Cobalion by turning Cobalion's Fighting weakness into an immunity. Tera Flying follows this idea but turns Cobalion's Fighting weakness into a resistance while also granting an immunity to Ground, which helps against Ground-type attacks such as Hippowdon's and Krookodile's Earthquake or Revavroom's High Horsepower. Tera Fighting elevates Close Combat's power even higher, which can help it break past common answers such as Hippowdon while removing Cobalion's Fighting and Ground weaknesses. Cobalion does not need to Terastallize to function efficiently, but it is a fairly common Tera user, as it appreciates the ability to combine its natural bulk with another typing to answer different matchups and create setup opportunities against would-be checks.</p> <p>This set is one of the cornerstones of the bulky offense archetype due to Cobalion's typing and bulk, which lets it act as a check or counter to a variety of common Pokemon. Thanks to Swords Dance and its great Speed tier, it can threaten KOs or break defensive cores. This set requires the opponent's physical walls to already be chipped decently in order to efficiently break apart balance cores, so Spikes support from Pokemon such as Gastrodon, Deoxys-D, and Forretress is very appreciated. Moltres provides an immunity to Ground-type attacks and a resistance to Fighting-type attacks, acts as a pivot with U-turn, and spreads burn through Flame Body and Will-O-Wisp to further chip at walls. Fezandipiti brings a 4x resistance to Fighting-type attacks and is adept at breaking down walls through poison and Taunt while Cobalion answers the Steel-types that Fezandipiti struggles against, but be wary that both Fezandipiti and Cobalion are weak to Ground-type attacks. Special attackers threaten Cobalion due to its lackluster Special Defense, so Pokemon such as Assault Vest Cyclizar, specially defensive Empoleon, and Gastrodon are good teammates. Grass Knot Jirachi can bait in and smack bulky Ground-types such as Hippowdon and Quagsire while being a solid switch-in against Choice Scarf Gardevoir. Mienshao and Galarian Zapdos are powerful wallbreakers that share checks with Cobalion and help overwhelm said checks. Healing Wish support from teammates such as Gardevoir and Jirachi circumvents Cobalion's lack of a recovery option and can also heal off status, allowing for more aggressive plays and extending its longevity.</p>"
      },
      "Utility": {
        "description": "<p>Cobalion functions well as a team's entry hazard setter because of its natural bulk, excellent Speed tier, and ability to pivot, which can provide safe entry for its teammates. Cobalion makes it difficult for teams with Cyclizar as their spinner to reliably remove entry hazards and pivot notable wallbreakers like Crawdaunt in, unlike other hazard setting options such as Hippowdon and Rhyperior. Cobalion gives teams a reliable switch-in to Knock Off by taking advantage of its physical bulk and ability Justified, which makes it even more imposing against the common Knock Off users like Crawdaunt, Cyclizar, and Alolan Muk. Access to a diverse movepool that is difficult to switch into, including Roar, Taunt, and Thunder Wave, gives Cobalion favorable matchups into would-be checks like Calm Mind Slowbro, Bulk Up Okidogi, and Dragon Dance Salamence, all of which are too slow to setup before a Taunt and susceptible to getting paralyzed. Hyper offense teams notably struggle into Cobalion because of its favorable matchup into most of the setup Pokemon used like Bisharp, Maushold, and Mimikyu, which Cobalion is faster than and can comfortably take multiple hits from while threatening an OHKO in return. Stone Edge is an optional move for Cobalion to run in order to hit Armarouge, Moltres, and Thundurus. Volt Switch allows Cobalion to pivot out of matchups into physical walls like Amoonguss, Moltres, and Slowbro. Cobalion prefers Leftovers, as it does not have access to recovery otherwise and is often used as a Knock Off switch-in. A Jolly nature allows Cobalion to outspeed relevant threats such as Jirachi, Mienshao, and Salamence. The spread provided guarantees Cobalion can OHKO maximum HP Bisharp while also surviving a Choice Scarf Terrakion Close Combat, allowing it to then revenge kill them with Body Press. Tera Flying helps against opposing Choice Scarf users like Krookodile and Galarian Zapdos. Tera Ghost helps against opposing Cobalion and other Fighting-type attacks.</p> <p>Cobalion fits best on balance and bulky offense teams that can take advantage of its notable role compression and utility, as it is capable of acting as a hazard setter, defensive and offensive presence, pivot, and status spreader. Teammates that can mitigate Cobalion's weaknesses, notably to Fairy- and Psychic-type attacks from strong Pokemon like Azelf and Gardevoir, are important to get the most out of the utility Cobalion brings to a team. Pokemon like Fezandipiti, Moltres, and Rotom-H take Fairy-type attacks while forming bulky VoltTurn cores. Alolan Muk, Krookodile, and Reuniclus can absorb Psychic-type attacks comfortably and use Knock Off to help wear down opposing Cobalion checks like Cresselia and Slowbro. Fezandipiti is an especially good teammate for Cobalion because of its ability to set up on Cobalion switch-ins like Amoonguss and Slither Wing while spreading Toxic through its ability Toxic Chain. It can either run a  Calm Mind or U-turn variant that can threaten Moltres and Slowbro. Frail offensive teammates such as Armarouge, Gardevoir, and Gengar can get safe entry points against Pokemon that often switch into Cobalion like Amoonguss, Chesnaught, and Slither Wing, giving them opportunities to use strong STAB attacks that can wear teams down. Teammates such as Bellibolt, Slowbro, and Thundurus work well in forming a paralysis-spam core that can enable setup sweepers like Bisharp, Hex Gengar, and Okidogi. Stone Edge can lure Moltres for physical attacking teammates like Bisharp, Mimikyu, and Slither Wing, though Cobalion without Stone Edge needs support in the form of defensive answers to Moltres like Slowbro and Umbreon. Noivern is a notable teammate for Cobalion, as it provides an immunity to Ground-type attacks while being able to remove hazards, provide additional pivot support, and threaten Cobalion checks such as Armarouge, Okidogi, and Galarian Zapdos.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}, {"user_id": 584113, "username": "Some random guy ya"}, {"user_id": 614438, "username": "fluff!!"}, {"user_id": 654091, "username": "FlamingoPokeman"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 598717, "username": "Sneakyplanner"}, {"user_id": 614438, "username": "fluff!!"}, {"user_id": 359771, "username": "GoldCat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 527276, "username": "Techno"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 356215, "username": "Clouds"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Terrakion": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Stealth Rock": {}}},
  "Thundurus": {"sets": {"Nasty Plot": {}, "Offensive Pivot": {}}},
  "Chesnaught": {"sets": {"Spikes": {}}},
  "Talonflame": {"sets": {"Utility": {}}},
  "Dragalge": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Utility": {"description": "<p>132 Speed EVs are to outrun uninvested Sylveon.</p>"}, "Choice Specs": {"description": "<p>172 Speed EVs are to outrun uninvested Umbreon and Vaporeon.</p>"}}},
  "Klefki": {"sets": {"Spikes": {}}},
  "Noivern": {"sets": {"Offensive Pivot": {}}},
  "Diancie": {"sets": {"Stealth Rock": {}}},
  "Volcanion": {"sets": {"Offensive": {}}},
  "Incineroar": {"sets": {"Defensive Pivot": {}}},
  "Oricorio-Pom-Pom": {"sets": {"Quiver Dance Sweeper": {}}},
  "Lycanroc-Dusk": {"sets": {"Swords Dance": {}, "Choice Band": {}}},
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Salazzle": {"sets": {"Substitute + Toxic": {}, "Offensive": {}}},
  "Tsareena": {"sets": {"Rapid Spin": {}}},
  "Palossand": {"sets": {"Defensive": {}}},
  "Mimikyu": {"sets": {"Swords Dance": {}}},
  "Necrozma": {"sets": {"Stealth Rock": {}, "Offensive Trick Room": {}, "Dragon Dance": {}}},
  "Inteleon": {"sets": {"Choice Specs": {}}},
  "Barraskewda": {"sets": {"Rain Sweeper": {}}},
  "Toxtricity": {"sets": {"Wallbreaker": {}, "Offensive Pivot": {}, "Shift Gear": {}}},
  "Regidrago": {"sets": {"Choice Specs": {}, "Dragon Dance": {}, "Choice Scarf": {}}},
  "Kleavor": {"sets": {"Lead": {}, "Choice Scarf": {}}},
  "Basculegion-F": {"sets": {"Choice Scarf": {}, "Choice Specs": {}, "Rain Wallbreaker": {}}},
  "Overqwil": {"sets": {"Rain Sweeper": {}, "Defensive": {}}},
  "Maushold": {"sets": {"Tidy Up": {}}},
  "Maushold-Four": {"sets": {"Tidy Up": {}}},
  "Armarouge": {"sets": {"Calm Mind": {}, "Weakness Policy": {}}},
  "Bellibolt": {"sets": {"Mr. Belli (Defensive)": {}}},
  "Kilowattrel": {"sets": {"Offensive Pivot": {}}},
  "Revavroom": {
    "overview": "<p>Shift Gear Revavroom is one of the most threatening late-game sweepers in the tier, as with its access to Shift Gear and great defensive typing, all it needs is one boost to offensively overwhelm most of the tier. Setting up is made easier with its ability, Filter, which allows it to take a Flamethrower from defensive Moltres. Revavroom also has access to useful coverage moves that allow it to threaten Steel-, Poison-, and Fire-types. Nevertheless, Revavroom is quite frail, as its poor Special Defense and reliance on Air Balloon to set up can be exploited by Ground-types, especially Hippowdon, Rhyperior, Quagsire, and Krookodile, as they can take a +1 hit from full HP and OHKO it back.</p>",
    "comments": "<h3>Other Options</h3> <p>Revavroom can opt to run Tera Blast Grass, which threatens Water- and Ground-types such as Slowbro, Quagsire, Hippowdon, and Rhyperior. Temper Flare is also an option to take down Steel-types with a Ground immunity such as Bronzong and Tera Steel Rotom-H, as well as helping against opposing Revavroom. Temper Flare can also be boosted with Tera Fire, making Revavroom immune to burn. Finally, Taunt is a solid option to completely wall and set up on Quagsire and Whirlwind Hippowdon with Air Balloon as well as to block Will-O-Wisp from Moltres. Tera Flying + Taunt is a good combination to completely shut down Whirlwind Hippowdon and Quagsire even after Air Balloon breaks. Revavroom can also opt to run Leftovers + Magnet Rise to get rid of its Ground weakness and set up on Ground-types more easily. Clear Amulet can also be used to block Intimidate from Krookodile and Salamence. Toxic is an option to put bulky Fire- and Water-type switch-ins on a timer. Toxic Spikes allows Revavroom to take advantage of the free turns it generates. Toxic and Toxic Spikes could be used on a Choice Scarf Revavroom set, which could be a decent source of role compression also capable of pivoting using Parting Shot.</p> <h3>Checks and Counters</h3> <p><strong>Levitate Steel-types</strong>: Steel-types with Levitate are immune to Gunk Shot and High Horsepower and resist Iron Head. As such, Pokemon such as Bronzong and Tera Steel Rotom-H are the sturdiest answers to Revavroom.</p> <p><strong>Bulky Ground-types</strong>: Revavroom fails to KO bulky Ground-types such as Hippowdon, Quagsire, and Palossand even after a Shift Gear boost, and they threaten to KO it.</p> <p><strong>Cobalion</strong>: Tera Ghost Iron Defense Cobalion is a solid check to it, resisting all of its attacks and threatening Revavroom with Body Press. Even if Cobalion does not Terastallize, a boosted High Horsepower fails to KO it.</p> <p><strong>Moltres</strong>: Bulky Moltres can survive a boosted Gunk Shot and threaten huge damage or burn Revavroom back with Will-O-Wisp. Moltres also commonly runs Tera Steel, which lets it absorb Gunk Shot.</p> <p><strong>Bulky Water-types</strong>: Bulky Water-types such as Slowbro, Quagsire, and Gastrodon deal with Revavroom quite well, potentially burning it with Scald in Slowbro's case or outright KOing it with Ground-type STAB moves in Quagsire and Gastrodon's cases. They do lose to Tera Grass variants, however.</p>",
    "sets": {
      "Shift Gear": {
        "description": "<h4>Set Details</h4> <p>Revavroom is a one-dimensional Pokemon that focuses solely on setting up with Shift Gear and sweeping the opposing team. With an Adamant nature, a single Shift Gear lets Revavroom outspeed all relevant Choice Scarf users. Revavroom has access to Gunk Shot and High Horsepower, which give it excellent coverage; Gunk Shot nearly or straight-out KOes defensive staples like Moltres, Fezandipiti, Chesnaught, and Rotom-H after one Shift Gear, while High Horsepower hits Steel- and Poison-types, which resist or are immune to Gunk Shot. Iron Head gives it a reliable STAB move that also hits Ground-types. Tera Ground gives Revavroom an additional STAB move in High Horsepower, which allows it to grab crucial OHKOs such as Cobalion, Volcanion, and Fezandipiti after one Shift Gear boost.</p> <p>Revavroom is a staple on hyper offense teams, and its role is usually to clean late-game. Therefore, it prefers wallbreakers and other setup sweepers such as Terrakion, Basculegion-F, Shell Smash Blastoise, and Yanmega as partners. The usual gameplan with Revavroom is wearing down Steel- and Fire-types with it, allowing another sweeper such as Mimikyu or Blastoise to clean. The opposite is also true, as Blastoise and Yanmega can weaken bulky Ground- and Water-types for Revavroom to sweep late-game. Revavroom should usually be brought in after a teammate has been KOed to ensure that Air Balloon remains intact and it is at near full health, as it is frail defensively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231398, "username": "feen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Cyclizar": {
    "sets": {
      "Rapid Spin": {},
      "Assault Vest": {
        "description": "<p>Assault Vest Cyclizar can safely switch into most special attackers and provide opportunities for its teammates to enter the game thanks to U-turn. Rapid Spin clears entry hazards while also granting Cyclizar a boost to Speed, which helps it outspeed most Choice Scarf users in the tier like Gardevoir and Gengar. It also gives even a paralyzed Cyclizar the opportunity to pivot out of slower opponents like Empoleon and Hippowdon. Knock Off can hit the tier's Pyschic-types such as Reuniclus and Slowbro for decent damage while also threatening the frail Ghost-types like Gengar and Hisuian Zoroark. Draco Meteor can be used to hit physical walls like Hippowdon and Slowbro. Dragon Tail is great at forcing opposing setup sweepers like Cresselia and Slowbro out. Facade can take advantage of status like burn or paralysis that Cyclizar may be inflicted by throughout the course of a game from opposing Moltres, Slowbro, and Thundurus. Assault Vest helps with its otherwise low natural bulk, which is also helped significantly by Regenerator recovery. Timid maximum Speed Cyclizar is faster than the majority of the tier, and the bulk provided allows it to survive a +2 Modest Blastoise Ice Beam along with taking two Ice Beams or Sludge Waves from other threats such as Basculegion-F and Gengar, respectively. Tera Fairy flips Cyclizar's weakness to Dragon-type moves into an immunity and gives a resistance to Fighting-type moves, helping against opposing Cyclizar, Salamence, and Slither Wing. Tera Steel makes Cyclizar resistant to Fairy- and Ice-type moves from the likes of Gardevoir and Empoleon, respectively. Tera Ghost makes it immune to Normal-type, allowing it to stop Rapid Spin attempts from opposing Cyclizar, while adding an immunity to Fighting-type attacks as well.</p> <p>Assault Vest Cyclizar can reliably slot onto balance or bulky offense teams as the main form of entry hazard removal while also providing item removal and pivoting. It can also be used on stall teams, though these structures often want another hazard removal option such as Defog Talonflame to reliably maintain hazard control. Cyclizar pairs well with other Regenerator Pokemon such as Amoonguss, Mienshao, and Slowbro, creating teams that are very difficult to break offensively and can provide pressure through status, hazard chip, and gradual damage. Strong offensive teammates like Crawdaunt, Conkeldurr, and Volcanion appreciate Cyclizar giving them free entry points. While Cyclizar can often keep hazards off the field, it is advised to still run hazard-resilient or Heavy-Duty Boots teammates, such as Amoonguss, Cobalion, and Mienshao, since Cyclizar may struggle against teams with Ghost-types like Palossand or Mimikyu. Assault Vest Cyclizar can struggle to retain HP against hazard-stacking archetypes, being unable to remove hazards against teams utilizing Tera Ghost on their hazard setters. To mitigate this dynamic, Cyclizar relies on pivoting into teammates who can apply offensive pressure to deny hazards from being established, like Basculegion-F, Gardevoir, and Volcanion.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamingoPokeman"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 513635, "username": "Rarelyme"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Slither Wing": {"sets": {"Bulky Pivot": {}, "Choice Band": {}}},
  "Wo-Chien": {"sets": {"Leech Seed": {}, "RestTalk": {}}},
  "Okidogi": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Munkidori": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Fezandipiti": {"sets": {"Calm Mind": {}, "Pivot": {}}}
}