{
  "Venusaur": {"sets": {"Tank": {}}},
  "Charizard": {
    "sets": {
      "Drought Wallbreaker": {
        "description": "<p>Mega Charizard Y's immense power combined with Drought makes it an extremely dangerous wallbreaker that threatens common defensive staples like Alomomola, Melmetal, and Ferrothorn while also supporting its teammates via sun. Weather Ball is the preferred Fire-type STAB move, as it is perfectly accurate, quite powerful, and 2HKOs Pelipper in the rain after Stealth Rock. However, Fire Blast can be used to get better damage rolls onto Garchomp and defensive Landorus-T while also hitting Kommo-o through Bulletproof. Solar Beam provides crucial coverage for Water-types, such as Alomomola, Slowbro, and Rotom-W. Scorching Sands allows Mega Charizard Y to hit Heatran, Toxapex, and Mega Tyranitar super effectively; it also pressures them with burns, which is also useful against other switch-ins, such as Kommo-o and Garchomp. On the other hand, Focus Blast is far more threatening to Mega Tyranitar and still hits Heatran, but it leaves Mega Charizard Y struggling to pressure Toxapex. Roost allows Mega Charizard Y to stay healthy throughout a match; this is important given its extreme vulnerability to Stealth Rock.</p> <p>Entry hazard removal is absolutely imperative when using Mega Charizard Y due to its 4x weakness to Stealth Rock. Great Tusk is a standout partner that can clear hazards while also benefitting from Mega Charizard Y's sun due to Protosynthesis. It also offensively pressures common Mega Charizard Y switch-ins, like Mega Tyranitar and Toxapex. A secondary form of entry hazard removal, such as Terapagos or Defog Kartana, is required as well. Raging Bolt is another notable beneficiary of Mega Charizard Y, as it appreciates sun boosting its Special Attack and gaining access to a powerful Fire-type Weather Ball that lets it pressure Ferrothorn and Assault Vest Kingambit. Hisuian Samurott is also a good teammate due to it being able to set Spikes to wear down Mega Charizard Y’s checks, such as Toxapex and Garchomp; in return, Mega Charizard Y threatens Clefable and Ferrothorn for Hisuian Samurott. Mega Charizard Y also appreciates Future Sight support from Slowbro and Galarian Slowking. This is especially potent with Focus Blast variants, as common Future Sight switch-in Mega Tyranitar does not want to take a Focus Blast, and it allows these variants to overcome their lack of coverage for Toxapex. They, along with Alomomola, can also function as slow pivots to get Mega Charizard Y in safely. Faster offensive threats such as Dragapult and Zamazenta appreciate Mega Charizard Y wallbreaking for them early so they can potentially clean up late-game; Dragapult notably does not mind Mega Latios and Mega Latias still being in play, as Mega Charizard Y can struggle to break through them, and it appreciates Mega Charizard Y overwhelming foes like Mega Tyranitar and Ting-Lu. Kingambit is another great partner that can Pursuit trap foes that are problematic for Mega Charizard Y, most notably Mega Latios, Mega Latias, and Dragapult, while also removing items from Moltres and Toxapex.</p>"
      },
      "Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Nidoking": {"sets": {"Wallbreaker": {}}},
  "Clefable": {"sets": {"Utility": {}, "Calm Mind": {}}},
  "Ninetales": {"sets": {"Sun Setter": {}}},
  "Slowbro": {"sets": {"Defensive Pivot": {}}},
  "Weezing-Galar": {"sets": {"Defensive": {}}},
  "Chansey": {"sets": {"Little Pink Blob": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Ditto": {"sets": {"Those Who Know:": {}}},
  "Zapdos": {"sets": {"Defensive": {}, "Offensive": {}}},
  "Moltres": {"sets": {"Defensive": {}}},
  "Dragonite": {"sets": {"Dragon Dance + Z-Move": {}, "Offensive Dragon Dance": {}}},
  "Slowking-Galar": {"sets": {"Defensive Pivot": {}, "Assault Vest": {"description": "<p>224 SpD EVs with a Calm nature lets Slowking-Galar live Mega Charizard Y's Fire Blast twice from full HP.</p>"}}},
  "Scizor": {"sets": {"Bulky Swords Dance": {}, "Swords Dance + 3 Attacks": {}}},
  "Skarmory": {"sets": {"Defensive": {}}},
  "Blissey": {"sets": {"Pink Blob": {}}},
  "Tyranitar": {"sets": {"Offensive": {}}},
  "Swampert": {"sets": {"Rain Sweeper": {}}},
  "Pelipper": {"sets": {"Rain Setter": {}}},
  "Shedinja": {"sets": {"Dual Status": {}}},
  "Sableye": {"sets": {"Defensive": {}}},
  "Mawile": {"sets": {"Swords Dance": {}, "All-Out Attacker": {}}},
  "Medicham": {"sets": {"All-Out Attacker": {}}},
  "Torkoal": {"sets": {"Sun Setter": {}}},
  "Latias": {"sets": {"Offensive Utility": {}, "Calm Mind": {}}},
  "Latios": {"sets": {"Wallbreaker": {}}},
  "Lopunny": {"sets": {"Offensive": {}}},
  "Garchomp": {"sets": {"Offensive Swords Dance": {}, "TankChomp": {}, "Swords Dance + Scale Shot": {}, "Mixed Attacker": {}}},
  "Hippowdon": {"sets": {"Defensive": {}}},
  "Weavile": {"sets": {"Choice Band": {}, "Offensive": {}}},
  "Magnezone": {"sets": {"Iron Defense + Body Press": {}}},
  "Tangrowth": {"sets": {"Physically Defensive": {}, "Assault Vest": {}}},
  "Gliscor": {"sets": {"Utility": {}, "Swords Dance": {}}},
  "Rotom-Wash": {"sets": {"Defensive Pivot": {}, "Nasty Plot": {"description": "<p>108 HP EVs lets Rotom-Wash live a +2 Knock Off from Kingambit.</p>"}, "Choice Scarf": {}}},
  "Heatran": {"sets": {"Specially Defensive": {}, "Offensive": {}}},
  "Cresselia": {"sets": {"Trick Room Setter": {}}},
  "Manaphy": {"sets": {"Tail Glow + 3 Attacks": {}, "Rain Wallbreaker": {}}},
  "Victini": {"sets": {"Choice Scarf": {}, "Pivot": {}, "Celebrate + Stored Power": {}}},
  "Serperior": {"sets": {"Substitute Attacker": {}, "Glare + 3 Attacks": {}}},
  "Samurott-Hisui": {"sets": {"Offensive": {}, "Choice Scarf": {}, "Assault Vest": {"description": "<p>176 HP EVs and 72 SpD EVs live a Moonblast from Mega Diancie at full HP. 108 Speed EVs outspeed uninvested Iron Crown.</p>"}}},
  "Excadrill": {"sets": {"Swords Dance": {}}},
  "Alomomola": {
    "sets": {
      "Defensive": {
        "description": "<p>Alomomola's massive HP stat allows it to be an effective user of Wish to support its ability to give teammates safe entry through Flip Turn. It can make use of Toxic to wear down opposing Pokemon that switch in on it and Pokemon that try setting up on it such as Terapgos, Ogerpon-W, and Great Tusk. Alomomola also appreciates Protect as a way to ensure it is able to use Wish and regain its own HP safely, scout opposing Pokemon's moves, notably Choice-locked attackers such as Dragapult and Tapu Lele as well as being able to build up Toxic damage on foes like Garchomp and Terapagos. Heavy-Duty Boots are another great tool for Alomomola, allowing it to safely switch into hazards to gain back health safely with Regenerator and use Wish to support teammates. The EV spread and Relaxed nature used allows Alomomola to comfortably sponge up hits from strong Physical attackers such as Kingambit, Urshifu-R, and Great Tusk, while a Sassy nature allows it to have a more comfortable matchup into Mega-Diancie and Terapagos. Alomomola makes use of 8 HP EVs to remain at an odd number HP stat so it can switch into hazards more optimally if it's Heavy-Duty Boots are removed.</p> <p>Slower Pokemon that lack reliable recovery, like Ursaluna, Kingambit, and Melmetal, appreciate Alomomola's ability to bring them in safely and recover their HP with Wish against bulky Pokemon like Ting-Lu and Ferrothorn. Frail Pokemon such Iron Valiant and Dragapult also appreciate Alomomola's ability to safely get them on the field with Flip Turn. Alomomola's vulnerability to Grass- and Electric-type Pokemon like Rillaboom, Tapu Koko, and Kartana make Raging Bolt and Ferrothorn excellent partners due to their ability to easily shrug them off and regain whatever health is lost through Alomomola's ability to safely Wish pass into these Pokemon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 607465, "username": "EatFoods"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475916, "username": "Sputnik"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Ferrothorn": {"sets": {"Defensive": {}}},
  "Volcarona": {"sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}, "Substitute + Swarm": {}}},
  "Tornadus-Therian": {"sets": {"Pivot": {}, "Nasty Plot": {}, "Assault Vest": {}}},
  "Landorus-Therian": {"sets": {"Defensive Pivot": {}, "Swords Dance": {}, "Choice Scarf": {}, "Lead": {}}},
  "Kyurem": {"sets": {"SubRoost": {}, "Offensive": {}, "Choice Specs": {}}},
  "Greninja": {"sets": {"Battle Bond": {}}},
  "Hawlucha": {"sets": {"Unburden Sweeper": {"description": "<p>176 Speed EVs outspeed a +1 Dragapult after Unburden activates.</p>"}}},
  "Diancie": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Mega Diancie is a very potent wallbreaker that applies a lot of offensive pressure to bulky offense and balance builds, threatening Pokemon such as Zapdos, Raging Bolt, and Great Tusk. Mega Diancie’s coverage further cements its role as a wallbreaker; for example, Earth Power hits foes such as Heatran, Gholdengo, Melmetal, and Toxapex that would otherwise come in safely on its STAB moves. Mystical Fire provides even more coverage, hitting foes such as Ferrothorn and Mega Scizor. Power Gem avoids the drawback of possibly forcing Mega Diancie to run a nature that decreases Defense or Special Defense, improving its ability to take on Pokemon such as Raging Bolt and Dragapult. Diamond Storm can be used as well with 28 Attack EVs to improve the matchup versus Pokemon such as Galarian Slowking, scoring a 2HKO on it. Mega Diancie does well versus common forms of entry hazard removal such as Terapagos lacking Earth Power, Great Tusk, Zapdos, and Tornadus-T. Mega Diancie is a unique hazard setter that can set up hazards while denying common opposing hazard setters in Heatran and Mega Tyranitar.</p> <p>Mega Diancie fits on bulky offense teams and pairs well with Pokemon such as Great Tusk, Ferrothorn, and Landorus-T that appreciate it due to its ability to threaten and force out Pokemon such as Mega Charizard Y, Volcarona, Zapdos, and Hisuian Samurott with its STAB attacks. In return, Great Tusk and Landorus-T check threats such as Mega Lopunny, Iron Head Kingambit, and Assault Vest Melmetal, which threaten Mega Diancie directly. Landorus-T also brings Mega Diancie in safely with a U-turn against Pokemon that like to come in on it such as Tornadus-T, Mega Charizard Y, and Great Tusk, which Mega Diancie punishes. Mega Diancie tends to struggle with fast offensive Water-types such as Ogerpon-W, Choice Scarf Urshifu-R, and Mega Swampert in the rain. Thus, Pokemon such as Dragonite, Raging Bolt, and Ferrothorn can keep these foes in check.</p>"
      },
      "Lead": {}
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 658067, "username": "Ineros"}, {"user_id": 514772, "username": "sealoo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Hoopa-Unbound": {"sets": {"Choice Band": {}, "Assault Vest": {"description": "<p>252 HP EVs and 56 Special Defense EVs lets Hoopa-U live a Never Ending Nightmare from a boosted Gholdengo at full HP. 64 Attack EVs lets Hoopa-U KO a Kingambit after Stealth Rock with Drain Punch, and 16 Speed EVs lets it outspeed Adamant Kingambit.</p>"}}},
  "Volcanion": {"sets": {"Wallbreaker": {}, "Choice Specs": {}}},
  "Primarina": {"sets": {"Offensive Calm Mind": {}, "Bulky Calm Mind": {}, "Assault Vest": {}}},
  "Ribombee": {"sets": {"Sticky Web": {"description": "<p>192 Defense EVs lets Ribombee live a Surging Strikes from a Urshifu-R at full HP.</p>"}}},
  "Toxapex": {"sets": {"The Pex": {"description": "<p>136 Defense EVs let Toxapex live a +2 Power Whip from Ogerpon-Wellspring from full HP.</p>"}}},
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Kommo-o": {"sets": {"Offensive Z-Move": {}, "Defensive": {"description": "<p>32 Defense EVs with an Impish nature let Kommo-o take Mega Lopunny's Close Combat twice from full HP.</p>"}}},
  "Tapu Koko": {"sets": {"Offensive Pivot": {}, "Choice Specs": {}, "Calm Mind": {}, "Dual Screens": {}}},
  "Tapu Lele": {"sets": {"Choice Scarf": {}, "Choice Specs": {}, "Offensive Z-Move": {}, "Assault Vest": {}}},
  "Tapu Bulu": {"sets": {"Offensive Z-Move": {}, "Defensive": {"description": "<p>220 HP EVs maximize Grassy Terrain recovery, and 92 Defense EVs let Tapu Bulu take Return from Mega Lopunny twice at full HP.</p>"}}},
  "Tapu Fini": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Buzzwole": {"sets": {"Physical Wall": {}}},
  "Celesteela": {"sets": {"Defensive": {"description": "<p>16 Defense EVs with a Relaxed Nature lets Celesteela live Mega Lopunny's Combat from full.</p>"}}},
  "Kartana": {"sets": {"Swords Dance": {}, "Choice Scarf": {}, "Synthesis Utility": {}}},
  "Blacephalon": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Melmetal": {"sets": {"Toxic + Protect": {"description": "<p>220 HP EVs lets Melmetal live a +2 Knock Off from Kingambit with Supreme Overlord boosts, along with outspeeding Toxapex.</p>"}, "Thunder Wave": {"description": "<p>92 Speed EVs outspeed a paralyzed Heatran.</p>"}, "Assault Vest": {"description": "<p>72 HP EVs and 252 SpD EVs let Melmetal take two Focus Blasts from Tapu Lele.</p>"}}},
  "Rillaboom": {"sets": {"Choice Band": {}, "Bulky Swords Dance": {}, "Swords Dance": {}}},
  "Cinderace": {"sets": {"Pivot": {}, "Setup Sweeper": {}}},
  "Corviknight": {"sets": {"Physically Defensive": {}, "Bulk Up + Substitute": {}}},
  "Barraskewda": {"sets": {"Rain Wallbreaker": {}}},
  "Hatterene": {"sets": {"Calm Mind": {}, "Healing Wish": {}}},
  "Grimmsnarl": {"sets": {"Dual Screens": {}}},
  "Dragapult": {"sets": {"Choice Specs": {}, "Offensive Pivot": {}, "Dragon Dance": {}}},
  "Zamazenta": {"sets": {"All-Out Attacker": {}, "Iron Defense + Body Press": {}}},
  "Urshifu-Rapid-Strike": {"sets": {"Choice Scarf": {}, "Swords Dance": {}, "Choice Band": {}}},
  "Ursaluna": {"sets": {"Swords Dance": {}}},
  "Enamorus": {"sets": {"Choice Scarf": {}, "Calm Mind": {}}},
  "Meowscarada": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Skeledirge": {"sets": {"Defensive": {"description": "<p>132 Defense EVs let Skeledirge live Zen Headbutt from Mega Medicham twice at full HP.</p>"}}},
  "Garganacl": {"sets": {"Stealth Rock": {}}},
  "Ceruledge": {"sets": {"Swords Dance": {}}},
  "Tinkaton": {"sets": {"Utility": {}}},
  "Glimmora": {"sets": {"Lead": {}, "Meteor Beam": {}}},
  "Dondozo": {"sets": {"Wall": {}}},
  "Clodsire": {"sets": {"Defensive": {}}},
  "Kingambit": {"sets": {"Swords Dance": {}, "Offensive Utility": {}}},
  "Great Tusk": {
    "sets": {
      "Offensive Utility": {},
      "Defensive": {
        "description": "<p>Defensive Great Tusk acts as important glue on teams due to its incredible role compression by acting as a defensive wall, setting entry hazards, and clearing them. Utilizing its high bulk and HP, defensive Great Tusk acts as a great check to many metagame staples such as all-out attacker Zamazenta, Kingambit, Mega Lopunny, and Mega Tyranitar. Earthquake is the preferred STAB move on Great Tusk, but Headlong Rush can also be run for better damage rolls, such as an OHKO on offensive Gholdengo and a 2HKO on Kartana, at the cost of lowering its defenses. Moreover, Headlong Rush isn't weakened by Grassy Terrain. Ice Spinner is used mainly to threaten Landorus-T, Gliscor, and Dragonite while also hitting Zapdos and opposing Great Tusk super effectively. Great Tusk can freely remove hazards, since spinblockers like Dragapult and Gholdengo are threatened by moves such as Ice Spinner and Earthquake, respectively, and Knock Off. The last slot on this set is flexible ; runnning Stealth Rock turns Great Tusk into an effective hazard setter, threatening most hazard removal options such as Landorus-T and opposing Great Tusk with Ice Spinner. Knock Off can also be run to remove key items, like Heavy-Duty Boots from the likes of Zapdos, Tornadus-T, and Moltres as well as Leftovers from Landorus-T and opposing Great Tusk, with the added benefit of being able to hit Air Balloon Gholdengo and Dragapult super effectively. Body Press is an option in the final slot to surprise Ferrothorn, Ting-Lu, and Terapagos that has had its Tera Shell broken. 40 Speed EVs allow defensive Great Tusk to outspeed base 90s like Moltres as well as other prominent threats such as uninvested Landorus-T and bulky Gholdengo. Heavy-Duty Boots prevents Great Tusk from taking too much chip damage from hazards, while Leftovers helps in checking the threats and increases Great Tusk's longevity. Rocky Helmet is another item that can be run on Great Tusk to punish many physical attackers that either attack it recklessly or try to gain momentum like Landorus-T, Zamazenta, and Kingambit.</p> <p>Defensive Great Tusk fits best on balance and bulky offense teams, which value its role compression. The main attributes hindering Great Tusk are its typing and lack of longevity. Thus, Great Tusk appreciates partners like Alomomola, which helps with its lack of longevity by Wish passing; additionally, Alomomola is able to switch into common Water-types like Hisuian Samurott and Urshifu-R. It also appreciates Pokemon such as Volt Switch Raging Bolt and Zapdos that can reliably switch in against common Flying-types such as Zapdos, Tornadus-T, and Mega Charizard Y and Water-types like Ogerpon-W while also threatening them offensively. Steel-type partners like Mega Scizor and Melmetal are greatly valued due to their ability to switch into fast Fairy-type foes like Tapu Lele. Moreover, the hazards set up by Great Tusk pressure many switch-ins on entry, forcing progress over time. Being able to remove the items on checks to Raging Bolt like Leftovers from Ting-Lu and Assault Vest from Melmetal allows Raging Bolt to break through switch-ins with its STAB moves aided by Great Tusk's hazards. Furthermore, these teammates appreciate Great Tusk's ablilty to spin away hazards for them and can continue to check threats to Great Tusk . Defensive Great Tusk also pairs extremely well with Mega Charizard Y, which appreciates Great Tusk removing Stealth Rock and checking Pokemon such as Mega Tyranitar. In return, Mega Charizard Y is able to break through walls like Alomomola, Clefable, Skarmory, and Corviknight. Mega Charizard Y also sets up sun, granting Great Tusk a Defense boost due to Protosynthesis, which allows it to better wall physical attackers.</p>"
      },
      "Bulk Up": {}
    },
    "credits": {"writtenBy": [{"user_id": 674261, "username": "Flames Of Elixir"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 604820, "username": "Sami"}, {"user_id": 571069, "username": "Dead by Daylight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 589016, "username": "Danbear02"}]}]}
  },
  "Iron Treads": {"sets": {"Lead": {}, "Specially Defensive": {}, "Offensive Utility": {}}},
  "Iron Hands": {"sets": {"Swords Dance": {}}},
  "Iron Moth": {"sets": {"Booster Energy": {}, "Offensive Pivot": {}}},
  "Gholdengo": {"sets": {"Nasty Plot": {}, "Bulky Nasty Plot": {}, "Thunder Wave + Hex": {"description": "<p>100 SpD EVs let Gholdengo live Shadow Ball from a Choice Specs Dragapult at full HP.</p>"}}},
  "Ting-Lu": {
    "sets": {
      "Defensive Hazard Setter": {
        "description": "<p>Ting-Lu's enormous HP combined with Vessel of Ruin makes it a fantastic defensive anchor against Pokemon such as Gholdengo, Volcarona, and Raging Bolt. This makes Ting-Lu a strong entry hazard setter as well, since many hazard removal options such as Terapagos and Moltres can't dissuade Ting-Lu from setting up hazards on them due to its bulk. To ensure it isn't completely passive against Flying-types, Ruination is necessary, which combined with hazard support allows Ting-Lu to force recovery from defensive Pokemon like Corviknight and Mega Latias. Spikes can be used instead of Stealth Rock if the team already has a Stealth Rock setter. Spikes also does better long-term damage if all three layers are set, especially to Pokemon that don't run Heavy-Duty Boots such as Gholdengo, Ferrothorn, and Mega Venusaur. Whirlwind is needed to ensure Ting-Lu isn't setup fodder against threats that don't mind taking Ruination such as Volcarona and Swords Dance Gliscor while also helping wear down opposing teams with Ting-Lu's hazards. Finally, Leftovers provides Ting-Lu with passive recovery, healing off weak attacks such as Tornadus-T's U-turn and Dragapult's Shadow Ball while also allowing it to survive attacks it otherwise wouldn't, such as avoiding the 2HKO from Choice Specs Tapu Koko's Dazzling Gleam.</p> <p>A major downside of Ting-Lu is its complete lack of recovery options, making Alomomola a fantastic partner that can also pivot into Water-types such as Urshifu-R and Barraskewda while healing Ting-Lu up with Wish. In return, Ting-Lu makes up for Alomomola's passivity against Gholdengo and Raging Bolt with its defensive profile combined with Whirlwind, wearing them down rapidly. Alomomola also handles Great Tusk for Ting-Lu, which would otherwise threaten Ting-Lu while removing its hazards easily. Another excellent defensive partner is Mega Venusaur, which is able to come in against the Water-, Fighting-, and Grass-types that threaten out Ting-Lu such as Kartana and Iron Valiant while appreciating Ting-Lu's hazard support to wear down opposing teams faster with its wide coverage. On offensive teams where they may not mind Ting-Lu's lack of longevity, Zamazenta, Iron Valiant, and Dragapult all appreciate the chip damage Ting-Lu provides with hazards wearing down defensive switch-ins such as Landorus-T, Mega Venusaur, and Kingambit. Gholdengo in particular is also able to block Defog attempts from Tornadus-T and Corviknight and Rapid Spin from Great Tusk especially if it is holding Air Balloon. Partners like Weavile and Ogerpon-W are also notable, since they can use Knock Off to remove Heavy-Duty Boots from targets like Alomomola and Toxapex, making them much easier to wear down in the long run.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604820, "username": "Sami"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 571069, "username": "Dead by Daylight"}, {"user_id": 475916, "username": "Sputnik"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 637479, "username": "red fintans"}]}]}
  },
  "Iron Valiant": {"sets": {"Choice Specs": {}, "Mixed": {}, "Swords Dance": {}}},
  "Ogerpon-Wellspring": {
    "sets": {
      "Swords Dance": {},
      "Offensive Pivot": {
        "description": "<p>Ogerpon-W is an offensive pivot that threatens common defensive Pokemon like Landorus-T, Gliscor, and Heatran. Courtesy of its ability, Ogerpon-W can answer a plethora of offensive Water-types, such as Mega Swampert and Urshifu-R, while ignoring Scald and Flip Turn from Slowbro, Toxapex, and Alomomola. Power Whip OKHOes Ursaluna and Great Tusk after minor chip damage, whereas Horn Leech provides it with longevity in exchange for power. U-turn allows Ogerpon-W to pivot out of checks such as Raging Bolt, Ferrothorn, and Dragonite. Knock Off is used to cripple switch-ins like Dragonite and Ferrothorn by removing their Heavy-Duty Boots and Leftovers, respectively, and also hits Dragapult super effectively. Alternatively, Encore can lock certain defensive pieces into recovery moves such as Toxapex and Mega Scizor. Encore also helps Ogerpon-W avoid mind games against priority moves from Raging Bolt and Kingambit and denies faster Pokemon like Zamazenta from setting up on it. Taunt is also an option to deny entry hazard-setting attempts from walls such as Ferrothorn and Clefable while ensuring Ogerpon-W walls Toxapex and Alomomola. Spikes can be used to wear down checks such as Ferrothorn and Raging Bolt lacking Heavy-Duty Boots, as it has the remarkable ability to force switches.</p> <p>Ogerpon-W commonly fits on bulky offense and balance teams. Pokemon such as Great Tusk and Landorus-T appreciate its presence due to its ability to threaten foes such as Alomomola, Urshifu-R, and Moltres. In return, these teammates can provide entry hazard removal through Rapid Spin and Defog to prevent Ogerpon-W from being worn down quickly. Additionally, Landorus-T can bring it in with U-turn against Pokemon like Alomomola and Gliscor. Ogerpon-W is vulnerable to faster threats such as Iron Valiant and Dragapult, so it appreciates teammates like bulky Volcarona and Pursuit Kingambit to answer Iron Valiant and trap Dragapult, respectively. Ogerpon-W also loves Spikes support from Pokemon like Mega Diancie to wear down checks such as Ferrothorn and Raging Bolt and help rack up chip damage in combination with U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 542295, "username": "Wildfiree"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 526618, "username": "omarsgarciav"}, {"user_id": 658067, "username": "Ineros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 589016, "username": "Danbear02"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Ogerpon-Cornerstone": {"sets": {"Offensive": {}}},
  "Archaludon": {"sets": {"Rain Wallbreaker": {}}},
  "Hydrapple": {"sets": {"Nasty Plot": {}}},
  "Raging Bolt": {"sets": {"Calm Mind": {}, "Pivot": {}}},
  "Iron Boulder": {"sets": {"Swords Dance": {}}},
  "Iron Crown": {"sets": {"Offensive Pivot": {}, "Assault Vest": {}}},
  "Terapagos": {"sets": {"Offensive Utility": {}}},
  "Pecharunt": {"sets": {"Defensive Pivot": {"description": "<p>104 Special Attack EVs lets Pecharunt break through Zamazenta's Substitute.</p>"}}}
}