{
  "Ninetales-Alola": {"sets": {"Aurora Veil": {}}},
  "Arcanine-Hisui": {
    "sets": {
      "Offensive": {
        "description": "<p>Extreme Speed gets the jump on everything in the tier and backs up Hisuian Arcanine's potent STAB moves by letting it revenge kill frailer offensive Pokemon from high HP like Greninja, Ogerpon, and Latios. Notably, it can even prevent Adamant Lokix from revenge killing Hisuian Arcanine with First Impression. The perfect coverage afforded by these moves lets it fit a utility option into its last moveslot. Hisuian Arcanine is a great Stealth Rock setter thanks to its great matchup against Excadrill and Mandibuzz, the most common entry hazard removers, but it can also use Morning Sun to let its user more recklessly switch it in against foes like Tinkaton and Zapdos. Howl can be used over either choice to boost Hisuian Arcanine's Attack, letting it more easily cleave through offense with a boosted Extreme Speed. A Jolly nature with Tera Normal is chosen to let Hisuian Arcanine get the jump on Excadrill and to give Extreme Speed a much-needed power boost against offensive teams.</p> <p>Hisuian Arcanine best fits on offensive teams and is best supported by offensive teammates that can break through the few things that can take on its STAB attacks. Latios can break through Kommo-o, Hippowdon, and Gastrodon, and it can help with some offensive foes that Hisuian Arcanine struggles to revenge kill like Sand Rush Excadrill while also switching into Keldeo for it. Stealth Rock setters like Tinkaton let Hisuian Arcanine more freely run Morning Sun, and in return it relieves some pressure on them to switch into Flying-types like Zapdos and Tornadus-T. Tinkaton can also check some foes Hisuian Arcanine struggles with, like the Normal-resistant faster offensive threats Ogerpon-C and Iron Boulder. Pivot support from allies like Lokix and Tornadus-T can bring Hisuian Arcanine in on prey like Tinkaton and Zapdos. Strong Water-types like Azumarill and Greninja can help Hisuian Arcanine with bulky Ground-types like Hippowdon and Rhyperior that cause it problems.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 481709, "username": "Lily"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Slowbro": {"sets": {"Defensive": {}}},
  "Gengar": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Weezing-Galar": {"sets": {"Defensive Utility": {}}},
  "Ditto": {"sets": {"Suspicious Imposter": {}}},
  "Zapdos": {
    "sets": {
      "Defensive": {
        "description": "<p>Zapdos is a fantastic defensive pivot, able to punish common contact moves like U-turn from Tornadus-T and Ogerpon, Knock Off from Lokix and Metagross, and Rapid Spin from Excadrill with Static. Heat Wave nails the aforementioned Excadrill, Metagross, and Tera Steel Hydrapple. Volt Switch allows it to pivot out of switch-ins like Hisuian Arcanine and Tyranitar. Zapdos can also run U-turn instead of Volt Switch to paralyze faster foes such as Latios and U-turn to freely pivot out on Ground-types like Sandy Shocks and Hippowdon, and it can run Discharge instead of Heat Wave to paralyze faster foes such as Latios. However, missing out on Heat Wave leaves it much more vulnerable to Swords Dance Excadrill and Nasty Plot Thundurus-T. 96 Speed EVs lets Zapdos outspeed Adamant Mamoswine. Zapdos can alternatively run a specially defensive EV spread and a Calm nature to better check Hydrapple. Tera Steel is preferred to take on Ogerpon-C, Latios, and Ice Beam Greninja. Tera Dragon allows it to better check to Choice Specs Keldeo and opposing Zapdos, as well as taking +6 Aqua Jet from Azumarill in a pinch.</p> <p>Zapdos is able to fit on balance and bulky offense teams thanks to great bulk, pivoting, and Static punishing faster pivots and revenge killers. Excadrill is a great partner for Zapdos, since it appreciates foes such as Tornadus-T, Lokix, Mienshao, and Hydrapple being dealt with for it to easily sweep with Swords Dance. In return, Excadrill can check Latios and remove Stealth Rock for Zapdos, as it often switches into Knock Off, allowing it to retain longevity without needing to use Roost. Rhyperior and Sandy Shocks are major roadblocks for Zapdos, since they can tank Hurricane and block Volt Switch. As such, partners like Greninja and Hydrapple can break through them. Pivots such as Slowking and Lokix can bring Zapdos in on Ogerpon, Cobalion, and Mienshao while checking Latios. Cobalion can switch into Ogerpon-C as well as Knock Off users to retain Zapdos's Heavy-Duty Boots; it can also check Excadrill for non-Heat Wave variants. Tinkaton is a useful partner, as it can wear down Rhyperior and Latios with Stealth Rock, while checking Latios and Ogerpon-C.</p>"
      },
      "Offensive": {"description": "<p>This Speed allows Zapdos to creep Arcanine-Hisui.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 524894, "username": "cheru"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Azumarill": {"sets": {"Belly Drum": {"description": "<p>The second EV spread creeps Skeledirge and the rest pumped into HP for bulk</p>"}, "Offensive": {"description": "<p>The second EV spread creeps Skeledirge and the rest pumped into HP for bulk</p>"}}},
  "Quagsire": {"sets": {"Physically Defensive": {}}},
  "Slowking": {"sets": {"Defensive Pivot": {}}},
  "Scizor": {
    "sets": {
      "Swords Dance": {},
      "Offensive Swords Dance": {},
      "Choice Band": {
        "description": "<p>With a Choice Band, excellent STAB moves, good defensive typing, and amazing ability in Technician, Scizor proves to be a threatening pivot, wallbreaker, and revenge killer. Bullet Punch is an incredibly powerful priority move capable of picking off faster attackers like Ogerpon-C and Mienshao after Spikes chip damage, as well as 2HKOing Latios and Lokix. U-turn allows Scizor to switch out of unfavorable matchups such as Zapdos and Toxapex so that it can get a more reliable teammate in to handle them. Close Combat is an excellent coverage move for Scizor, allowing it to break offensive Steel-type Pokemon such as Excadrill, Cobalion, and Magnezone. Lastly, Knock Off is used to cripple and weaken Pokemon reliant on their items, such as Zapdos, Skeledirge, and Hippowdon, making them all easier to target. Tera Steel maximizes the power of Bullet Punch, allowing Scizor to hit even harder. Tera Electric prevents Scizor from getting paralyzed by Zapdos's Static.</p> <p>Scizor fits best on bulky offense and VoltTurn teams to make the most of its offensive capabilities. Offensive teammates like Ogerpon-C, Latios, and Zapdos are  appreciated, as  they can take on threats such as Toxapex and Keldeo for Scizor, as well as being able to dismantle the opposing team for it to begin sweeping. Defensive pivots such as Tornadus-T and Slowking work amazingly with Scizor, helping take on offensive threats it dislikes such as Greninja, Latios, and Iron Crown while keeping up momentum. Rotom-W is a great teammate, as it forms a VoltTurn core with Scizor that can handle one another's checks, with Scizor taking on the likes of Hydrapple and Ogerpon for Rotom-W, while Rotom-W removes Fire-type Pokemon that can threaten Scizor such as Skeledirge and Hisuian Arcanine. Entry hazard setters like Sandy Shocks and Cobalion help Scizor to get more value out of using Bullet Punch with the help of chip damage, while Tyranitar can set up both Stealth Rock and sand, which chip away at opposing Pokemon even quicker. Excadrill is a very important teammate for Scizor to have, as it can lure in Zapdos and remove it with a +2 Rock Slide and can take pressure off of Scizor by pivoting into Latios so it can preserve its HP.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 655366, "username": "RodentTamer"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 540289, "username": "Rae"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Donphan": {"sets": {"Offensive Utility": {}}},
  "Raikou": {"sets": {"Calm Mind": {}}},
  "Tyranitar": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Tyranitar's unique typing alongside fantastic special bulk under sand allows it to check dangerous threats like Latios and Zapdos well. Tyranitar's ability to remove items with a strong Knock Off and pressure entry hazard removers like Mandibuzz and Excadrill from switching in safely make it an effective Stealth Rock setter. Thunder Wave allows Tyranitar to punish switch-ins like Keldeo, Tinkaton, and Kommo-o. It can also be used to cripple Tera Steel Latios and Double Dance Iron Crown to help other teammates deal with them better. Earthquake can be used to do heavy damage to Tinkaton, Excadrill, and Cobalion, but without Attack investment, it does not threaten much else. Ice Punch is an option if Tyranitar is paired with Excadrill to lure in and remove a weakened Hydrapple to help it sweep more easily. Leftovers is the preferred item choice to provide Tyranitar with passive recovery. Smooth Rock can be used to provide Sand Rush Excadrill with more sand turns but is far from necessary. Heavy-Duty Boots can help offset entry hazard damage. Chople Berry is a situational item that allows Tyranitar to check Nasty Plot Tornadus-T and Aura Sphere Latios. The given Speed EVs allow Tyranitar to outpace Skeledirge and hit it hard before potentially being punished by Will-O-Wisp. Tera Fairy removes Tyranitar's glaring weaknesses, particularly to Fighting, allowing it to punish Pokemon like Kommo-o. It also allows Tyranitar to deal with a boosted Draco Meteor from Latios and KO it back while improving its matchup against Lokix. Tera Ghost can be used for a similar reason to remove Tyranitar's weaknesses while also potentially preventing Excadrill from being able to remove its Stealth Rock. Tera Water is another option to improve the matchup into Greninja and Choice-locked Keldeo; however, under sand, Tyranitar can take a boosted Surf from them anyway. Tera on Tyranitar should be used in emergencies, as removing its Rock typing takes away the boost to its Special Defense under sand and causes it to take damage from sand as well.</p> <p>Tyranitar fits best on offensive structures that can force progress, as it is susceptible to being worn down quickly. Excadrill is a great partner that can remove entry hazards for Tyranitar, as well as capitalize on the sand with Sand Rush to turn it into a deadly cleaner. Tinkaton pairs nicely with Tyranitar to act as a secondary check to Latios and Tornadus-T, as both are capable of chipping away at Tyranitar or potentially KOing it with Fighting-type coverage. Tinkaton also helps against other threatening wallbreakers like Ogerpon formes and Lokix; pickpocket Tinkaton variants are able to steal their Heavy-Duty Boots, causing them to slowly get whittled down by Tyranitar's Stealth Rock and sand. Other U-turn punishers like Rocky Helmet Kommo-o and Zapdos can also support Tyranitar well. Slowking and Tornadus-T can help deal with Kommo-o, Cobalion, and Keldeo. Tornadus-T can also remove Heavy-Duty Boots from Zapdos, allowing Tyranitar to get meaningful damage on it with Stealth Rock throughout a battle. Toxapex and Hydrapple do not mind having their item removed thanks to Regenerator, so partners like Zapdos, Iron Crown, and Mamoswine can help threaten them.</p>"
      },
      "Choice Band": {},
      "Dragon Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 344575, "username": "Twilight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 540289, "username": "Rae"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 200771, "username": "Rugi"}]}]}
  },
  "Salamence": {"sets": {"Dragon Dance": {}}},
  "Metagross": {"sets": {"Bulky Attacker": {}, "METABOOM": {}}},
  "Latios": {"sets": {"Choice Specs": {}, "Calm Mind + Thunderbolt": {"description": "<p>The second EV spread is faster than Arcanine-Hisui and the rest is invested into bulk.</p>"}, "Calm Mind": {}, "Offensive": {}, "Choice Scarf": {}}},
  "Jirachi": {"sets": {"Wish": {}}},
  "Empoleon": {"sets": {"Defensive Pivot": {}, "Offensive": {}}},
  "Gastrodon": {"sets": {"Specially Defensive": {}}},
  "Hippowdon": {
    "sets": {
      "Stealth Rock": {
        "description": "<p>Hippowdon makes for a great mixed wall by virtue of its bulk, typing, and access to reliable recovery. Its superb bulk enables it to check some of the metagame’s most dangerous threats in Pawmot, Salamence, Tyranitar, and Sandy Shocks. It also provides value through Sand Stream to help combat rain teams if given momentum to get in freely, as it can't hard switch into Water-types. Stone Edge enables Hippowdon to pressure Flying-types like Iron Jugulis and Salamence, in addition to being able to beat Taunt Dragon Dance Tyranitar even after it Terastallizes. Roar is also an option, as it allows Hippowdon to phaze setup sweepers like Polteageist in a pinch and synergizes well with entry hazards. Leftovers is the preferred item, as its residual healing improves Hippowdon's overall longevity and preserves Slack Off's PP. The given spread with an Impish nature and Leftovers avoids a 2HKO from Life Orb Pawmot and prevents Hippowdon from being KOed by Hurricane into Draco Meteor from Salamence after Stealth Rock while avoiding a 2HKO from Sandy Shocks without Stealth Rock. Rocky Helmet is also an option to punish physical attackers, primarily U-turn users and Maushold. A specially defensive spread is an option to handle Gengar if Pawmot is less of a concern. Tera Rock pairs well with its sand, as the Special Defense boost it receives gives it a strong matchup versus special attackers like Gengar, Salamence, and Noivern. Additionally, Tera Rock boosts Hippowdon’s Stone Edge to put more pressure on targets like Salamence. After Hippowdon has Terastallized, it is threatened by Pawmot, Sandy Shocks, and Tyranitar, so be careful when Terastallizing. Tera Ghost is an option that makes Hippowdon a strong response versus Slither Wing, Lucario, and Maushold and lets it spinblock against Donphan. Tera Fairy is an option that grants Hippowdon a generally good defensive typing, including a Fighting resistance, and makes it less vulnerable to Greninja. After becoming a Fairy- or a Ghost-type, Hippowdon is unable to check Gengar, and in the case of the latter, Tyranitar sets running Crunch as well. Tera Dragon makes Hippowdon an effective answer to rain teams through the useful Water-type resistance it provides.</p> <p>Hippowdon most commonly fits on bulky offense or balance teams for its walling capabilities. Talonflame and Noivern make for good partners, as they are capable of grabbing momentum with U-turn off of opposing Decidueye and Wo-Chien swapping in to exploit Hippowdon. Hippowdon can in return easily absorb Knock Off from the likes of Tinkaton in order to preserve the Heavy-Duty Boots they both depend on. Wo-Chien is also a solid pick for a partner as a nice fit on most balance teams, as well as an answer to bulky Water-types that may attempt to annoy Hippowdon. In particular, Wo-Chien’s RestTalk set is capable of swapping in on Quagsire easily, as it is able to shrug off Toxic. Wo-Chien can also relieve pressure from Hippowdon, as it can take on Sandy Shocks. Tinkaton also makes for a good partner, as it is able to take a lot of the pressure off of Hippowdon by taking hits from Gengar and specially offensive Flying-types such as Iron Jugulis, Noivern, and Salamence. Tinkaton is also capable of providing useful Knock Off support by removing opposing Leftovers and Heavy-Duty Boots to enable Hippowdon’s Stealth Rock and sandstorm damage to stick. In return, Hippowdon being able to carry Stealth Rock means that Tinkaton does not need to run it itself and can fit a more useful option. Assault Vest Cyclizar is able to check Greninja and Wo-Chien for Hippowdon and keep Spikes or Toxic Spikes off the field from the former.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 630045, "username": "Easter Bliss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 461329, "username": "Estarossa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rhyperior": {"sets": {"Stealth Rock": {}}},
  "Mamoswine": {"sets": {"Wallbreaker": {}}},
  "Rotom-Wash": {
    "sets": {
      "Utility Pivot": {
        "description": "<p>Rotom-W thrives as a pivot within the tier thanks to its unique typing, solid bulk in tandem with access to Pain Split, and access to a great ability in Levitate. Hydro Pump gives Rotom-W an excellent STAB option and makes the life of Ground-types wishing to block Volt Switch such as Rhyperior and Excadrill hard. Volt Switch lets Rotom-W generate momentum on Pokemon that would easily take a Hydro Pump such as Azumarill, Tornadus-T, and Slowking. Will-O-Wisp helps Rotom-W cripple physically offensive threats that dislike being burnt such as Ogerpon, Kommo-o, and Excadrill while slowly chipping down any burnt Pokemon. Thunder Wave, on the other hand, punishes Iron Crown, Tornadus-T, and Latios by slowing them down while helping teammates take advantage of the Speed cut as well as the chance of paralysis. Pain Split in tandem with Rotom-W's naturally low HP stat allows it to recover a significant amount of health on foes like Hydrapple and Slowking, keeping itself healthy throughout the game. Leftovers is used to increase Rotom-W's longevity over the course of the match, letting it passively recover its health. Rotom-W is able to run two distinct EV spreads, both of which maximize its HP while allowing it to outspeed Adamant Scizor and Tyranitar. Investment into Rotom-W's Defense with a Bold nature lets it handle Sand Rush Excadrill and Metagross while living a Choice Band Hisuian Arcanine Head Smash. Rotom-W with a Calm nature and EVs in Special Defense make it a solid check to Greninja, Tornadus-T, and Zapdos. Tera Steel combined with Levitate removes the Ground weakness it would otherwise gain while gifting Rotom-W a spectacular defensive typing, letting it check Ogerpon-C and Latios better.</p> <p>Rotom-W's traits fit best on bulky offense teams that love its ability to cripple opposing Pokemon while pivoting on and off the field. Wallbreakers such as Ogerpon-C and Metagross fit excellently with it, being able to take advantage of Latios, Hydrapple, and Zapdos, which may want to switch into Rotom-W to block its shenanigans, with Metagross also functioning as a solid Latios check. Other pivots that synergize well with Rotom-W such as Lokix, Scizor, and Tornadus-T are excellent teammates, with Lokix and Scizor forming a strong VoltTurn core while handling Ogerpon, Hydrapple, and Latios for Rotom-W, while Assault Vest Tornadus-T can pivot into special Kommo-o, Latios, and Keldeo for it. Ogerpon specifically both functions as a pivot and a way of punishing setup sweepers like Dragon Dance Kommo-o, Calm Mind Latios, and Booster Energy Iron Crown with Encore thanks to Rotom-W's Volt Switch giving it free entry. Entry hazard setters like Tinkaton and Kommo-o are fantastic partners for Rotom-W that support it with their strong defensive profiles. Kommo-o in particular is an excellent option, as it manages to beat Mold Breaker Excadrill, one of Rotom-W's main annoyances. Hydrapple is an even stronger check to Excadrill as well as Dragon Dance Kommo-o that appreciates Rotom-W's ability to handle Flying- and Ice-type types like Zapdos, Tornadus-T, and Mamoswine. Hisuian Arcanine functions excellently with Rotom-W, being able to maximize its offensive potential thanks to Rotom-W baiting in the likes of Hydrapple and Tinkaton for it, with Will-O-Wisp chipping down opposing checks like Kommo-o and Mamoswine and Thunder Wave allowing Hisuian Arcanine to outspeed Pokemon like Latios and Keldeo.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540289, "username": "Rae"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Manaphy": {"sets": {"Tail Glow": {}}},
  "Excadrill": {
    "sets": {
      "Specially Defensive": {},
      "Offensive Swords Dance": {},
      "Lead": {},
      "Sand Rush": {
        "description": "<p>Sand Rush Excadrill is a deadly threat, being a great sweeper, wallbreaker, and revenge killer thanks to the combination of Swords Dance and it outpacing the entire boosted metagame under sand. After a Swords Dance, Rock Slide does heavy damage to Zapdos, Mandibuzz, and Tornadus-T. Rapid Spin is primarily used for the utility it brings with removing entry hazards; however, its Speed boost can potentially prevent Excadrill from being revenge killed once sand has subsided. Iron Head can be used over Rapid Spin if the team is not pressured by hazards as much, which can help it break past Hydrapple and Latios more easily. Iron Head can also be used over Rock Slide, but it should be paired with Tera Electric so Excadrill can get past Zapdos. Air Balloon provides some utility against Sandy Shocks, Rhyperior, and opposing Excadrill, but Leftovers can be used for passive recovery. Life Orb can be considered, as it notably allows Excadrill to OHKO Zapdos and Slowking after a Swords Dance boost, though it will cut into Excadrill's longevity and potentially bring it into range of priority from Lokix and Keldeo. A Jolly nature is primarily used so Excadrill can Speed tie with opposing Excadrill outside of sand. It also lets Excadrill outpace Battle Bond-activated Greninja under sand; however, it would be reliant on a defensive Tera to take Water Shuriken. An Adamant nature can be used to help improve the chances of KOing Pokemon like Slowking after a Swords Dance. Tera Rock increases the damage of Rock Slide to KO Mandibuzz and Zapdos, and the Special Defense boost under sand can help it beat foes like Hydrapple and take priority from Keldeo and Greninja better. Tera Dragon provides many useful resistances, notably letting it take priority hits from Greninja and Azumarill. Tera Ground provides a boost to Earthquake, allowing Excadrill to OHKO Slowking at +2 and remove its weakness to opposing Excadrill's Earthquake. Other Tera options are also great on Excadrill such as Fairy to beat Mandibuzz reliably, Fire to have a better matchup against Skeledirge, and Ghost to wall Ursaluna in conjunction with Air Balloon.</p> <p>Excadrill fits best on offensive teams that can break down defensive structures to help Excadrill sweep more easily. Sand is essential, so Tyranitar or Hippowdon are mandatory partners, both being able to set Stealth Rock to help potentially bring foes into KO range. Tyranitar can help check and pressure Mandibuzz and Zapdos for Excadrill as well as force damage on other common answers like Keldeo. Alternatively, Hippowdon offers a sturdy check to opposing Excadrill and can afford to run Smooth Rock more easily due to having reliable recovery in Slack Off. Lokix can revenge kill Excadrill with minor chip damage, so a partner like Zapdos or Cobalion can keep it in check; the latter can run Stealth Rock to allow Excadrill's partner Tyranitar to run a more offensive set. Azumarill is easily one of the deadliest threats to sand teams, so Pokemon like Volcanion, Rotom-W, and the aforementioned Zapdos are excellent teammates, all also having favorable matchups into rain teams. Rotom-W is a huge roadblock for Excadrill, so it is essential to run partners that can overwhelm it like Latios and Keldeo. Keldeo in particular can force in Excadrill answers like Latios, Hydrapple, and Sinistcha and heavily dent, or in Hydrapple's case OHKO, them with Icy Wind. Hydrapple is another partner that can pressure Rotom-W but also deals with other Pokemon like Slowking, Ogerpon, and Zarude for Excadrill. Mandibuzz can help pivot into Ogerpon and opposing Excadrill as well as provide Defog support, freeing up Excadrill to run Iron Head over Rapid Spin.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 344575, "username": "Twilight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Cinccino": {"sets": {"Tidy Up": {}}},
  "Amoonguss": {"sets": {"Defensive": {}}},
  "Haxorus": {"sets": {"Choice Band": {}}},
  "Mienshao": {"sets": {"Choice Scarf": {}}},
  "Bisharp": {"sets": {"Swords Dance": {}}},
  "Mandibuzz": {"sets": {"Mixed Defensive": {"description": "<p>The given EV spread allows you to take two Soul Dew-boosted Draco Meteor's from Latios and enough Speed to creep Azumarill.</p>"}}},
  "Hydreigon": {"sets": {"Nasty Plot": {}, "Choice Specs": {}, "Choice Scarf": {}}},
  "Cobalion": {"sets": {"Swords Dance": {}, "Utility": {}}},
  "Terrakion": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Swords Dance": {}}},
  "Tornadus-Therian": {
    "sets": {
      "Assault Vest": {
        "description": "<p>Assault Vest Tornadus-T is a very important pivot in the metagame, making use of its high Speed and Knock Off to help force progress against opposing teams and U-turn to pivot out on switch-ins like Zapdos and Rotom-W while remaining healthy with Regenerator. Assault Vest helps Tornadus-T sponge powerful special attacks from threats like Latios, Greninja, and Hydrapple. 168 Speed EVs and a Timid nature allow it to outspeed base 110 Speed Pokemon like Latios and Ogerpon-C, while 208 HP and 132 Special Defense EVs give it a good chance to withstand Choice Specs Latios's Draco Meteor from full HP, even if Assault Vest is removed. Hurricane is an option over Bleakwind Storm that can OHKO Kommo-o after Stealth Rock damage if one wants to sacrifice accuracy for power. Heat Wave provides coverage for Steel-types like Scizor, Excadrill, and Tinkaton, while Focus Blast is less accurate but is more powerful and hits Rock-types like Tyranitar and Hisuian Arcanine. Tera Steel allows Tornadus-T to more easily switch into Latios and Hydrapple, helps it sponge hits from Ogerpon-C, and gives it a resistance to Stealth Rock. Tera Electric allows Tornadus-T to switch into Flying-types like Zapdos and opposing Tornadus-T while protecting it from Zapdos's Static. However, it is important to note that using these Tera types makes Tornadus-T weak to Ground and susceptible to Spikes, so Terastallization generally shouldn't be used unless needed.</p> <p>Assault Vest Tornadus-T fits on both offense and balance teams, utilizing its ability to force progress and its high Speed to help wear down the opposing team and bring in its teammates. However, having an Assault Vest means that it is susceptible to Stealth Rock damage, and thus, it appreciates having teammates that can remove entry hazards like Excadrill and Mandibuzz. It also appreciates other pivots like Zapdos and Lokix to help it switch in and out more to heal as well as additional Regenerator Pokemon for it to switch into like Hydrapple and Slowking. These Regenerator pivots make it easier for Tornadus-T to make use of its own Regenerator while also helping answer offensive threats it cannot handle like Rhyperior or Hisuian Arcanine. Hydrapple, as well as other Grass-types like Zarude and Sinistcha, also provides a second Ground-resistant team member should Tornadus-T be forced to Terastallize. Tornadus-T also appreciates Ground-types that can absorb Volt Switch from Zapdos such as Rhyperior, Hippowdon, and Sandy Shocks. Tornadus-T can be paired alongside fast offensive threats like Ogerpon to provide a team two fast progress-makers that can overwhelm defensive Pokemon like Hydrapple, Zapdos, and opposing Tornadus-T, and it also fits well alongside wallbreakers such as Mamoswine and Latios, which appreciate its ability to pivot them in.</p>"
      },
      "Pivot": {"description": "<p>The given EV spread allows Tornadus-T to outspeed base 110s while limiting the chance of Choice Specs Draco Meteor from Latios KOing.</p>"},
      "Nasty Plot": {"description": "<p>The given EV spread allows Tornadus-T to survive Tera Bug Silver Powder-boosted First Impression from full and outspeed Raikou.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 617840, "username": "gulch"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Thundurus-Therian": {"sets": {"Nasty Plot": {"description": "<p>Only use Tera Blast with Tera Flying</p>"}}},
  "Keldeo": {"sets": {"Choice Specs": {}, "Calm Mind": {}}},
  "Chesnaught": {"sets": {"Spikes Utility": {}}},
  "Greninja": {"sets": {"Battle Bond": {}, "Choice Specs": {}}},
  "Hawlucha": {"sets": {"Unburden Sweeper": {}}},
  "Goodra-Hisui": {"sets": {"Specially Defensive Wall": {}}},
  "Hoopa-Unbound": {"sets": {"Mixed": {}, "Choice Specs": {}}},
  "Volcanion": {"sets": {"Offensive": {}}},
  "Toxapex": {"sets": {"The Pex": {}}},
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Comfey": {"sets": {"Calm Mind + Synthesis": {}}},
  "Barraskewda": {"sets": {"Rain Sweeper": {}}},
  "Polteageist": {"sets": {"Shell Smash": {}}},
  "Grimmsnarl": {"sets": {"Dual Screens": {}}},
  "Indeedee": {"sets": {"Terrain Setter": {}}},
  "Zarude": {"sets": {"Bulk Up": {}}},
  "Ursaluna": {"sets": {"Bulk Up": {}, "Wallbreaker": {}}},
  "Enamorus-Therian": {"sets": {"Offensive": {}}},
  "Skeledirge": {"sets": {"Defensive": {}}},
  "Quaquaval": {"sets": {"Swords Dance": {}}},
  "Lokix": {
    "sets": {
      "Pivot": {
        "description": "<p>First Impression is key in removing offensive powerhouses such as Ogerpon-C, Greninja, and Latios. Tinted Lens prevents foes from playing around Lokix with defensive Terastallization, meaning they will all be hit for neutral damage at worst. Knock Off punishes common switch-ins like Zapdos, Tornadus-T, and Kommo-o. Sucker Punch is additional priority that allows Lokix to pick off foes like Assault Vest Tornadus-T after Stealth Rock and First Impression damage. Tera Bug is used to blow past Excadrill and Azumarill, letting Lokix KO the latter after Belly Drum if Stealth Rock is up. Heavy-Duty Boots allows Lokix to dash in and out of the field easily. Silver Powder puts an additional kick into First Impression, OHKOing Choice Scarf Mienshao, Assault Vest Tornadus-T after Stealth Rock, and Excadrill with a layer of Spikes after Tera Bug at the cost of Lokix taking entry hazard damage, limiting the amount of entry points in a game. On such sets, Leech Life can be used over Knock Off to retain longevity, at the cost of forgoing the ability to punish common switch-ins. Adamant should be used most often for maximum damage output, but Jolly allows Lokix to nail Hisuian Arcanine before it uses Extreme Speed and pivot out freely on Excadrill.</p> <p>Lokix fits best on bulky offense and balance teams, acting as a potent revenge killer to offensive threats. Offensive partners like Latios and Ogerpon-C appreciate Lokix's U-turn freely bringing them in on Kommo-o and Zapdos. Removing Zapdos in particular is very important to let Lokix more freely pivot around without worry about Static. Slowking forms an excellent pivoting core with Lokix, as slow Chilly Reception can bring Lokix in safely on Pokemon that threaten Slowking such as Greninja and Ogerpon and it can handle the likes of Toxapex and mixed Kommo-o. Slowking's Future Sight support can also dissuade Toxapex and defensive Kommo-o from wanting to switch into Lokix in the first place. Other pivots like Zapdos and Thunder Wave Rotom-W can handle Tornadus-T through paralysis, giving Lokix more room to pivot in and out. Lokix greatly appreciates entry hazard support to more easily revenge kill Excadrill. Tinkaton and defensive Kommo-o appreciate Lokix's Knock Off removing Heavy-Duty Boots for Stealth Rock while in return handling Rock-types like Ogerpon-C and Hisuian Arcanine. Spikes setters such as Sandy Shocks and Ogerpon can take on Zapdos and Hippowdon. Excadrill is a fantastic partner for Silver Powder sets especially, as it removes entry hazards for Lokix to freely pivot around and helps overwhelm Zapdos and Tornadus-T. In return, Lokix nails Hydrapple and can give Excadrill safe entry against Rotom-W and Toxapex. Slower wallbreakers such as Azumarill, Hisuian Arcanine, and Mamoswine appreciate having faster checks like Ogerpon and Sand Rush Excadrill dealt with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 524894, "username": "cheru"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540289, "username": "Rae"}, {"user_id": 461329, "username": "Estarossa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Bellibolt": {"sets": {"Physically Defensive Static": {}}},
  "Tinkaton": {"sets": {"Utility": {"description": "<p>The given EV spread allows Tinkaton to OHKO Latios with Knock Off into Gigaton Hammer. The Def EVs allow Tinkaton to live a +2 Superpower from Ogerpon-Cornerstone after Stealth Rock.</p>"}}},
  "Scream Tail": {"sets": {"Wish": {}}},
  "Sandy Shocks": {"sets": {"Pivot": {"description": "<p>Only use Tera Blast with Tera Ice to nail checks like Hydrapple, Sinistcha, and Latios.</p>"}, "Booster Energy": {"description": "<p>Tera Blast should only be used alongside Tera Ice to nail checks like Hydrapple, Sinistcha, and Latios.</p>"}}},
  "Iron Jugulis": {"sets": {"Booster Energy": {}}},
  "Iron Leaves": {"sets": {"Swords Dance": {}}},
  "Sinistcha": {"sets": {"Calm Mind": {}}},
  "Sinistcha-Masterpiece": {"sets": {"Calm Mind": {}}},
  "Okidogi": {"sets": {"Bulk Up": {"description": "<p>The given EV spread allows Okidogi to avoid the 2HKO from Pivot Tornadus-T's Hurricane after Stealth Rock when terastallized into Tera Fairy or Dragon while outspeeding Azumarill. The leftover investment goes into attack along with an Adamant nature.</p>"}, "Choice Scarf": {}}},
  "Ogerpon": {
    "sets": {
      "Swords Dance": {},
      "Pivot": {
        "description": "<p>Ogerpon functions as a solid pivot within the tier thanks to an array of excellent utility moves, a powerful STAB move in Ivy Cudgel, and great offensive stats. Knock Off allows Ogerpon to punish many of the Pokemon attempting to switch into it such as Zapdos, Tornadus-T, and Skeledirge. U-turn allows Ogerpon to pivot out of matchups that are unfavorable for it such as Tinkaton, Okidogi, and Skeledirge while doing solid damage to Hydrapple that may want to switch in, and thanks to Heavy-Duty Boots, it is able to remain healthy throughout the match and easily pivot in and out of the field. Encore gives it the ability to take advantage of slower Pokemon that have locked themselves into an awkward move so it can go for a free move the turn after, such as Zapdos using Roost or Mandibuzz clicking Defog, which, when paired with Defiant, gives Ogerpon a free Attack boost. On the other hand, Ogerpon is able to use the pressure it creates as opportunities to set up Spikes for its team, helping its teammates and itself by slowly chipping down the opposing team's checks. Ogerpon's Tera type is locked into Grass, but with Embody Aspect, it is given a boost to its Speed on top of the additional boost to its STAB moves, letting it OHKO Slowking and have a chance to 2HKO Tornadus-T after Stealth Rock. This means that Ogerpon can act not only as a powerful breaker with Tera, but also as an emergency speed control option that can outrun every unboosted Pokemon in the metagame, as well as a number of boosted Pokemon such as Choice Scarf Mienshao and Excadrill after Rapid Spin. Ogerpon's Speed boost also allows it to have unique interactions with Encore, switching in on faster Pokemon to lock them into set up moves such as Calm Mind Latios or Dragon Dance Kommo-o.</p> <p>Ogerpon's pivoting and utility options are best suited on bulky offense teams that appreciate its ability to disrupt foes while bringing in their own threats. Wallbreakers such as Azumarill, Hisuian Arcanine, and Mamoswine love Ogerpon's ability to pivot them in safely, weaken their checks, and potentially set up Spikes for them to break more easily; In return, they are able to deal with some of Ogerpon's checks such as Zapdos, Tornadus-T, and Hydrapple. Pivots that are able to synergize well with Ogerpon such as Slowking, Tornadus-T, and Zapdos make for excellent partners, being able to form a strong core while relieving Ogerpon of the pressure of taking on threats like Latios, Iron Crown, Excadrill, and Lokix. Stealth Rock setters such as Tinkaton and Kommo-o mesh well with Ogerpon that opt for Spikes by maximizing the entry hazard stacking potential, with Tinkaton able to fit Encore instead while taking on Greninja and Zapdos, while Kommo-o can effectively deal with Excadrill and Lokix for it. Sandy Shocks is an excellent teammate for Ogerpon, being able to take on the Flying-types that it's afraid of, creating a VoltTurn core with it, and being able to set up Stealth Rock for it while Ogerpon handles the Water- and Grass-type attacks aimed at Sandy Shocks well while beating its key checks like Azumarill and Rotom-Wash.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540289, "username": "Rae"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Ogerpon-Cornerstone": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-C is a terrifying powerhouse, with very few defensive Pokemon able to resist its STAB combination or stand up to its sheer power after a Swords Dance. Ivy Cudgel is the STAB move of choice, capable of nailing even checks like Tinkaton and mixed Kommo-o with a 2HKO after boosting. Power Whip, while inconsistent due to poor accuracy, is also notably stronger, allowing Ogerpon-C to OHKO offensive threats like Keldeo and Azumarill and have a chance at OHKOing Excadrill without boosting. Alternatively, while less immediately powerful, Horn Leech's healing can help Ogerpon-C to survive revenge killing attempts, and in some cases, even allow for multiple uses of Sturdy. However, while it does obtain OHKOs and 2HKOs on most notable targets, especially after a Swords Dance, the drastically lower power can cause Ogerpon-C to miss important OHKOs on targets like Slowking and Tyranitar, especially if unboosted. Ogerpon-C's last moveslot is immensely customizable thanks to its near perfect STAB combination; Knock Off allows Ogerpon-C an intersection of additional coverage and utility, notably helping against threats like Metagross and Iron Crown, although one must be wary of Weakness Policy and Booster Energy variants of the latter. Meanwhile, Spiky Shield helps to prevent being revenge killed by Lokix's First Impression and can allow Ogerpon-C to avoid being hit by Tinkaton's Gigaton Hammer entirely. Sturdy allows Ogerpon-C to be significantly more aggressive, with the ability to live any one hit from full HP allowing it to pose much more of a threat against Pokemon like Latios and Excadrill. Embody Aspect also gives Ogerpon-C unique defensive properties through Terastallization, with the Defense boost helping to improve the odds of living attacks like Scizor's Bullet Punch, and shedding Ogerpon-C's Grass typing can be handy against opposing Lokix, especially if it is not carrying Spiky Shield.</p> <p>Ogerpon-C fits on a wide variety of teams thanks to its high firepower, as well as its access to Sturdy allowing it to serve as an emergency check to certain threats. Entry hazard setters like Tinkaton and Sandy Shocks are valued teammates, with the chip damage they provide helping Ogerpon-C to have an even easier time securing kills. These Pokemon are also capable of helping to manage foes that may annoy Ogerpon-C such as Latios or Tornadus-T. Pivots such as Slowking and Tornadus-T are also valuable for their ability to get Ogerpon-C in safely. Methods of speed control, such as Sticky Web from Araquanid, or Pokemon that can spread paralysis such as Zapdos, Tinkaton, Slowking, and Rotom-W, are also appreciated to help Ogerpon-C get the jump on faster foes. Choice Specs Latios makes a strong partner, as it can help Ogerpon-C to deal with Kommo-o, and the two can whittle down shared checks like Tinkaton and Scizor. Excadrill also greatly appreciates Ogerpon-C's ability to smash pesky Flying-types, especially Zapdos, and Ogerpon-C greatly benefits from Excadrill's hazard removal allowing it to keep Sturdy intact, as well as the extra support against Iron Crown, which threatens it even through Sturdy thanks to Tachyon Cutter. Powerful revenge killers, such as Lokix, are also appreciated for their ability to deal with Iron Crown and to pick off weakened Pokemon that Ogerpon-C may not be able to finish off.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "gulch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540289, "username": "Rae"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Hydrapple": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Hydrapple serves as a solid balance breaker, using its bulk and offensive prowess to handle threats like Excadrill while also being scary for foes like Tornadus-T and Metagross once is has set up Nasty Plot. It also has Regenerator to heal off any damage taken while checking these threats, allowing it to potentially repeat this process later in the game. Fickle Beam is an alternative move over Draco Meteor so Hydrapple can avoid the Special Attack drop while having a chance to deal more damage than Draco Meteor, allowing it to maintain its Nasty Plot boosts and to remain a big threat after firing it off. However using Fickle Beam means Hydrapple can miss out on KOs against foes like Zapdos and Tornadus-T if the boost doesn't activate. Earth Power provides coverage for Steel-types like Tinkaton and Metagross so that they cannot easily come in to cause issues for Hydrapple. Heavy-Duty Boots serves to make Hydrapple's healing from Regenerator more effective while improving its longevity by removing its vulnerability to entry hazards, as it commonly has to utilize its great typing to switch into powerful wallbreakers like Excadrill and Ogerpon. Maximum HP and maximum Defense make Hydrapple incredibly difficult for physical attackers to break, letting it better soak up U-turn from Scizor, Lokix, and Zarude as well as powerful hits from wallbreakers like Hisuian Arcanine or Tyranitar so that it can more easily set up Nasty Plot. Tera Steel improves its matchup against Ogerpon-C while also giving it a Toxic immunity to help against Toxapex and Mandibuzz, a Flying resistandce so it can set up Nasty Plot in front of Tornadus-T, and a Fairy resistance useful for dodging an OHKO from Choice Band Azumarill's Play Rough in case of emergency. Tera Fairy lets it set up more easily on Latios and opposing Hydrapple without gaining weaknesses to Excadrill and Mamoswine. However, Terastalizing Hydrapple removes its beneficial resistances to Ground and Electric, making it tougher to handle Volt Switch users such as Sandy Shocks and Rotom-W.</p> <p>Hydrapple acts as a solid wallbreaker for balance and bulky offensive playstyles, using its defensive profile to switch into foes that are offensively threatening or tough to break and then becoming a threat of its own. Slowking is a nice partner for it, forming a double Regenerator core that helps work around some problems for Hydrapple such as Tornadus-T and Tinkaton while acting a secondary Water resist in the event Hydrapple needs to Tera. Slowking also slow pivots to Hydrapple with Chilly Reception after soaking up a hit, allowing Hydrapple to either be a bigger threat due to having more HP or get its HP back from Regenerator more easiliy. Additionally, Slowking can use Thunder Wave against foes like Tinkaton and Mandibuzz to make them slower than Hydrapple, allowing it to more easily set up Nasty Plot. Zapdos is also a good teammate, defensively answering Scizor and Lokix, which can pose problems with their strong U-turn should they switch in on Hydrapple when it’s chipped. Hydrapple appreciates teammates that can help wear down Tinkaton into Earth Power range such as Lokix and Tornadus-T. It also appreciates Pokemon that can help pressure or defensively answer Flying-types such as Tyranitar or Rhyperior. Hydrapple apprecieates Stealth Rock setters like Cobalion and the previously mentioned Rhyperior to get targets into range of its boosted attacks more easily. Sand teams appreciate Hydrapple's defensive profile in tandem with Regenerator, it can use an Eject Button to safely bring in Excadrill and act as check to opposing Excadrill and Keldeo, which can be scary for sand teams otherwise.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 524894, "username": "cheru"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Iron Crown": {
    "sets": {
      "Booster Energy": {
        "description": "<p>Iron Crown is a fearsome sweeper on offense teams, using its access to Calm Mind to become a powerful threat with along the extra Speed supplied by Booster Energy, which allows it to outspeed key threats such as Latios and Greninja. Calm Mind is Iron Crown's best and only boosting move, with just one boost allowing it to secure 2HKOs against Pokemon like Mandibuzz and Hydrapple, as well as a chance to OHKO Toxapex. The added Special Defense also comes in handy, as it allows Iron Crown to survive attacks from and go up against Hydrapple and Assault Vest Tornadus-T. Tachyon Cutter's multi-hit property lets it deal with Pokemon such as Ogerpon-C and Mimikyu effectively. Psychic Noise allows Iron Crown to make up for its dampened attacking power by denying bulkier threats their recovery options, making it especially useful against Pokemon like Toxapex, Slowking, defensive Zapdos, and Calm Mind Latios. Expanding Force is an option on Psychic Terrain teams for more immediate power, but outside of those team structures, it is largely useless compared to other options. If an option against Soundproof Kommo-o is needed, Iron Crown can opt for Psychic over Psychic Noise, but do be wary that allowing foes access to recovery can result in sticky situations. Focus Blast nails Pokemon that naturally resist Iron Crown's STAB moves like Excadrill, Metagross, and Empoleon, and it is also more effective than Tachyon Cutter at breaking through a healthy Tyranitar. It also helps against Pokemon that commonly use Tera Steel such as Zapdos and Hydrapple. Substitute is another option in this slot, as it allows Iron Crown opportunities to set up on foes like Zapdos or Slowking that attempt to status it. The given EV spread ensures that Booster Energy enhances Iron Crown's Speed while still giving it the maximum amount of Special Attack. Tera Dragon is used in conjunction with Psychic Noise to give Iron Crown a workable matchup against Skeledirge, as Calm Mind boosts are ineffective against it thanks to Unaware, and it also eases the matchup against Belly Drum Azumarill for more offensive teams. Meanwhile, Tera Psychic helps give Iron Crown's Psychic-type STAB moves a bit more oomph, although it is generally restricted to Psychic Terrain teams due to making Iron Crown even weaker to opposing priority.</p> <p>Iron Crown finds a home on all manner of offensive teams in need of a powerful sweeper, as well as those in need of a way to reliably deal with Ogerpon-C. Ogerpon-C also makes for an exemplary teammate for Iron Crown thanks to its ability to dispose of Slowking. In addition, alongside Pokemon like Hydrapple, Ogerpon-C can also help wear down shared checks such as Tinkaton and Metagross so that Iron Crown can deal with them more easily. Entry hazard setters like Tinkaton, Kommo-o, and Sandy Shocks make good teammates, as the extra chip damage they provide can alleviate Iron Crown's occasional struggle to secure killing blows. Sticky Web support from Araquanid is also appreciated, as it slows down revenge killers that manage to outspeed Iron Crown even after Booster Energy's Speed boost such as Choice Scarf Mienshao. Iron Crown also benefits from pivots like Lokix, Tornadus, and Zapdos, as it appreciates their ability to bring it in safely, and in turn it can overwhelm nuisances to them like Tinkaton and Tyranitar. Iron Crown also pairs well with Azumarill, Greninja, and Keldeo for their ability to stave off Excadrill. Excadrill also makes a good partner itself, as Iron Crown appreciates its entry hazard removal to alleviate chip damage, making it less vulnerable to opposing revenge killers. Excadrill's ability to deal with Metagross and opposing Iron Crown is also appreciated. Psychic Terrain teams also have an abundance of good partners for Iron Crown, most notably Hawlucha, as the two can very easily overwhelm the opponent with their Speed, setup options, and powerful STAB moves.</p>"
      },
      "Choice Specs": {},
      "Assault Vest": {"description": "<p>The Speed allows Iron Crown to be faster than Adamant Lokix and Jolly Mamoswine. Enough SpA to OHKO offensive Tyranitar and Excadrill.</p>"},
      "Double Dance": {"description": "<p>The Speed allows Iron Crown to be faster than Adamant Lokix and Jolly Mamoswine. The SpA investment with a Modest nature allows Iron Crown to KO Ogerpon-Cornerstone and have a high chance to 2HKO Tinkaton after Stealth Rock at +1.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "gulch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 524894, "username": "cheru"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}, {"user_id": 602431, "username": "CaptainDaimyo"}]}]}
  },
  "Pecharunt": {"sets": {"Nasty Plot": {}}}
}