{
  "Venusaur": {"sets": {"Custap Berry": {}}},
  "Ninetales-Alola": {"sets": {"Encore + Disable": {}, "Sitrus Berry": {}, "Life Orb": {}}},
  "Muk-Alola": {"sets": {"AV": {}}},
  "Zapdos": {
    "sets": {
      "Clear Amulet": {
        "description": "<ul> <li>Eerie Impulse enables Zapdos to beat the likes of Primarina, Sylveon, non-Choice Band Hisuian Goodra, Spectrier, and Volcarona.</li> <li>Clear Amulet helps Zapdos by blocking moves that lower Special Defense like Fake Tears from Sylveon, Acid Spray from Hisuian Goodra and Icy Wind from Primarina.</li> <li>This EV spread allows Zapdos to survive Timid Choice Specs Spectrier's Hyper Beam and grants good chances of surviving Adamant Urshifu-R's Choice Band Surging Strikes.</li> <li>Zapdos should always Eerie Impulse on the first turn against Volcanion, since Choice Scarf Volcanion can outspeed and 2HKO Zapdos if it uses Thunderbolt.</li> <li>Zapdos struggles against physical attackers like Ursaluna, Regidrago and non- Choice Specs Hoopa-U. Pokemon that can outspeed and deal super effective damage to Zapdos like Meowscarada, Chien-Pao, and Jolly Choice Band Landorus-T also beat it. It is advised for Zapdos to be used with a Steel-type Pokemon like Corviknight to tackle these weaknesses.</li> </ul>"
      },
      "Life Orb": {},
      "Pressure Stall": {},
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"user_id": 572752, "username": "recti"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 563650, "username": "bern"}, {"user_id": 149971, "username": "Nuxl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Zapdos-Galar": {"sets": {"Choice Band": {}}},
  "Moltres-Galar": {"sets": {"Custap Berry": {}, "Weakness Policy": {}, "Assault Vest": {}}},
  "Azumarill": {"sets": {"Life Orb": {}, "Kebia Berry": {}, "Choice Band": {}, "AV": {}, "Stall": {"description": "<ul> <li>Chilling Water allows Azumarill to chip the foe down while reducing their Attack, giving it better chances versus Taunt Great Tusk.</li> <li>Sap Sipper lures in Grass-types such as most offensive Choice Band Meowscarada.</li> <li>The HP, Special Defense investment, and Calm nature allow Azumarill to defeat Timid Choice Specs Iron Valiant most of the time.</li> <li>Use Charm or Amnesia to lower the foe's damage output until Azumarill is forced to use Rest.</li> </ul>"}}},
  "Scizor": {
    "sets": {
      "Life Orb": {
        "description": "<ul> <li>Scizor uses its strong defensive typing and unique offensive profile to carve itself a role as a setup pokemon with Swords Dance.</li> <li>By using Life Orb over Choice Band, Scizor can gain important favorable matchups against Pecharunt, Chople Berry Hisuian Goodra, and non-Choice Band Metagross by using Swords Dance before attacking.</li> <li>Bullet Punch is the move to use against foes such as Iron Valiant, Pecharunt, Alolan Ninetales, and Sylveon.</li> <li>Bug Bite is a reliable STAB option, allowing Scizor to beat non-Fire Punch Hoopa-U, Meowscarada, non-Defense invested Ogerpon-W, and Cresselia.</li> <li>Close Combat is used to defeat Hisuian Goodra and non-Speed invested Ursaluna after a Swords Dance as well as Porygon-Z.</li> <li>If Scizor is looking to 2HKO the foe, it is generally better to use Swords Dance and then attack rather than attack twice—such as against Ursaluna and Pecharunt.</li> <li>The defensive EVs allow Scizor to survive two Earthquakes from non-Choice Band Adamant Metagross after one turn of Life Orb recoil. The special bulk lets Scizor survive a Hyper Beam from Choice Specs Modest Porygon-Z.</li> <li>44 Speed EVs let Scizor outspeed uninvested Metagross, which allows it to beat Metagross via the sequence of Swords Dance, Bug Bite, and Bullet Punch without being outsped by Metagross's own Bullet Punch.</li> <li>Scizor needs to be covered for its weaknesses against Fire-types such as Volcarona and Volcanion as well as physically bulky Pokemon such as Landorus-T, Corviknight, and both Urshifu formes. For this, it can be paired with Pokemon such as Primarina, Raging Bolt, and Alolan Ninetales to great effect.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Choice Band Scizor is a strong threat that can deal with some of the biggest metagame threats such as Iron Valiant, Hoopa-U, and Primarina.</li> <li>Bullet Punch hits Alolan Ninetales, Diancie, Iron Valiant, and Primarina.</li> <li>Bug Bite is important for non-Fire Punch Hoopa-U, Ogerpon-W, and Serperior.</li> <li>Close Combat can hit opposing Steel-type Pokemon like non-Chople Berry Hisuian Goodra and Registeel.</li> <li>Knock Off is good coverage for Ghost-type Pokemon such as Spectrier.</li> <li>The HP EVs allow Scizor to survive a Choice Band Hyperspace Fury from Jolly Hoopa-U, while the Special Defense allows it to live a Hex from Life Orb Spectrier after one turn of burn damage and after its Life Orb has been removed by Knock Off.</li> <li>Scizor naturally struggles against Fire-types such as Volcarona, Skeledirge, and Volcanion, as well as physical tanks such as Landorus-T, Ursaluna, and Urshifu-R, so strong special attackers like Walking Wake and Manaphy make for excellent partners.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583189, "username": "LongRat"}, {"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 579035, "username": "glitched"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 670315, "username": "Mentality"}, {"user_id": 583189, "username": "LongRat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Donphan": {"sets": {"Choice Band": {}}},
  "Tyranitar": {"sets": {"Choice Band": {}}},
  "Swampert": {"sets": {"Assault Vest": {}}},
  "Salamence": {"sets": {"Life Orb": {}}},
  "Metagross": {
    "sets": {
      "Weakness Policy": {
        "description": "<ul> <li>Heavy Slam is for Fairy-types like Iron Valiant and Whimsicott as well as light Pokemon such as Meowscarada and Porygon-Z.</li> <li>Meteor Mash can be used for consistent damage, being particularly useful against heavy Rock- and Ice-type Pokemon</li> <li>Bullet Punch is useful for securing KOs on faster Pokemon, Encore + Disable Pokemon such as Iron Valiant and Alolan Ninetales, and pinch Berry users such as Sneasler.</li> <li>Earthquake is for Hisuian Goodra and Metagross mirror matchups.</li> <li>Psychic Fangs is for Pecharunt and some Urshifu-R sets. It also helps break Reflect from Pokemon like Primarina and Kyurem.</li> <li>Hone Claws allows Metagross to set up against Counter users like Hisuian Goodra, which cannot be OHKOed by Metagross's Earthquake, allowing it to OHKO Hisuian Goodra with +1 Earthquake.</li> <li>The bulk EVs let Metagross survive Modest Choice Specs Kyurem's Earth Power and Adamant Choice Band Haxorus's Earthquake. The rest of the EVs are put into Attack for more Regidrago reliability.</li> <li>If Metagross is not running Hone Claws to set up Attack against Counter Hisuian Goodra, it can chip away at Hisuian Goodra's HP with Bullet Punch, since Counter won't do much, then it can KO Hisuian Goodra when it's in Earthquake's KO range.</li> <li>Since Metagross is weak to Fire-, Dark-, and Ground-type moves, a Water- or Fairy-type Pokemon like Manaphy or Primarina makes a good teammate.</li> </ul>"
      },
      "Assault Vest": {
        "description": "<ul> <li>Heavy Slam is for Primarina, Iron Valiant, and Sylveon.</li> <li>Bullet Punch lets Metagross deal with Encore + Disable Iron Valiant and KO Haxorus and Custap or Sitrus Berry Primarina after Heavy Slam.</li> <li>Earthquake beats Iron Crown and is the best option Raging Bolt.</li> <li>Psychic Fangs gives Metagross a better matchup against Pecharunt and Reflect Primarina, while Ice Punch gives Metagross the best odds against non-Choice Band Regidrago, Assault Vest Landorus-T, and Life Orb Landorus.</li> <li>The HP and Defense EVs allow Metagross to survive Knock Off from Jolly Choice Band Meowscarada. The Special Defense EVs allow Metagross to take 2 Thunderbolts from Booster Energy Raging Bolt. The remaining EVs are put into Attack to maximize odds against Choice Band Earthquake Haxorus.</li> <li>Assault Vest Metagross has the most reliable matchups of any Metagross set against Regidrago and Primarina. It is important to note that Choice Band Regidrago can 2HKO Metagross with Earthquake before Metagross can with Ice Punch, so it is recommended to run a partner that can deal with that set.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Heavy Slam is used to defeat non-Custap Berry Primarina, while Meteor Mash allows Metagross to beat Kyurem. Both moves do well into Sylveon, Porygon-Z, and Azumarill.</li> <li>Psychic Fangs is for Pecharunt and Iron Hands.</li> <li>Bullet Punch targets Iron Valiant and Alolan Ninetales.</li> <li>Earthquake hits Iron Crown, Hisuian Goodra, Registeel, and has favorable odds to beat most Raging Bolt sets.</li> <li>The HP investment allows Metagross to survive Earthquake from Choice Band Iron Hands, while the Special Defense EVs allow it to survive Dark Pulse from Choice Specs Porygon-Z. The Attack EVs and an Adamant nature allow it to beat Encore + Disable Iron Valiant due to Struggle 2HKOing after a Bullet Punch.</li> <li>An alternative EV spread of 232 HP / 236 Atk / 40 Def can be used to survive Focus Blast from Timid Choice Specs Iron Valiant and Earthquake from Choice Band Haxorus. The remaining EVs are put in Attack for maximum damage output.</li> <li>Choice Band Metagross should almost always use the move that does the most damage to an opposing Pokemon. Notable exceptions to this rule are Alolan Ninetales and Iron Valiant, as Bullet Punch allows Metagross to beat Encore + Disable variants of these Pokemon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 568493, "username": "ZackPalace"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 563325, "username": "delemon"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}, {"user_id": 500233, "username": "RTM"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Registeel": {"sets": {"Specially Defensive": {}, "Defensive": {}}},
  "Garchomp": {"sets": {"Haban Berry": {}}},
  "Rhyperior": {"sets": {"Choice Band": {}, "Custap Berry": {}, "Assault Vest": {}}},
  "Porygon-Z": {
    "sets": {
      "Choice Specs": {
        "description": "<ul> <li>Porygon-Z is one of the strongest Pokemon in 1v1, being able to output a lot of damage with its Adaptability-boosted Hyper Beam, going through specially bulky Pokemon like non-Assault Vest Ursaluna, Landorus-T, and Sylveon, as long as the last one doesn't predict its Hyper Beam and goes for Endure.</li> <li>Uproar can go through Substitute from Pokemon like Ogerpon-W, Entei, and Whimsicott.</li> <li>Dark Pulse hits Ghost-types like Spectrier and Pecharunt.</li> <li>Thunderbolt is Porygon-Z's best option against Corviknight.</li> <li>Ice Beam damages both Landorus formes and Dragapult.</li> <li>Trick can Choice-lock Pokemon like Pecharunt and Clear Amulet Cresselia and is usually combined with Recover, which helps Porygon-Z at healing off damage from low-damage foes like the previously mentioned Clear Amulet Cresselia.</li> <li>Its HP is made to tank a Modest Volcanion's Overheat, while its Defense bulks an Ogerpon-W's Power Whip. Finally, its Speed lets it outspeed Modest Raging Bolt. The remaining EVs are put into Special Attack.</li> <li>It's important to know when to use a STAB attack or when to use one of Porygon-Z's coverage moves; it's usually recommended to use Hyper Beam against bulky targets like Ursaluna over Ice Beam, since the Adaptability boost means a neutral STAB hit does as much damage as a super effective non-STAB hit.</li> <li>Porygon-Z struggles against strong Fighting- and Steel-types that can easily take its attacks or outspeed it, such as Sneasler and Metagross, so Pokemon that can deal with them, like Landorus-T and Skeledirge, are excellent partners.</li> </ul>"
      },
      "Life Orb": {
        "description": "<ul> <li>Life Orb Porygon-Z uses its freedom of moves to launch powerful attacks, which are backed by Nasty Plot boosts or the defenses from Substitute.</li> <li>Hyper Beam is capable of OHKOing many Pokemon that do not resist it, such as non-Assault Vest Ursaluna, Raging Bolt, and non-Assault Vest Azumarill.</li> <li>Nasty Plot lets Porygon-Z threaten an OHKO versus opposing Pokemon that would be able to tank Porygon-Z's unboosted Hyper Beam and KO it back, such as Maranga Berry Corviknight and Clear Amulet Cresselia.</li> <li>Against Pokemon using the combination of Endure and Custap Berry that would be OHKOed by Porygon-Z's Hyper Beam, like Urshifu-S and Primarina, Porygon-Z can use Substitute when predicting Endure and fire off a Hyper Beam the next turn, while still being protected behind Substitute if Endure happens to work twice. However, it is advisable to be wary of Encore from Primarina.</li> <li>Uproar lets Porygon-Z hit foes behind Substitute, such as Serperior and Whimsicott. It also gives Porygon-Z another Normal-type STAB move when the recharge turn of Hyper Beam is undesirable.</li> <li>The Speed EVs help Porygon-Z outpace Modest Raging Bolt, and the HP and Defense EVs allow it to tank Choice Scarf Volcanion's Overheat and Jolly Ogerpon-W's Power Whip. The rest of the EVs are distributed into Special Attack.</li> <li>This Porygon-Z set can struggle against faster Pokemon that can OHKO it, such as Haxorus, Meowscarada, and Choice Scarf Regidrago, so teammates like Corviknight or Primarina that can handle these Pokemon are well-warranted.</li> <li>Like most Porygon-Z, Pokemon that can tank its Hyper Beam such as Steel-types like Hisuian Goodra, Assault Vest users like Ursaluna, and Ghost-types like Skeledirge are hard counters to it, so Pokemon like Choice Band Meowscarada and Urshifu-S are great partners for it.</li> </ul>"
      },
      "Choice Scarf": {"description": "<ul> <li>A Choice Scarf allows Porygon-Z to outspeed many fast threats, such as non-Choice Scarf Haxorus, Meowscarada, and Chien-Pao, that would otherwise beat it.</li> <li>Trick allows it to beat foes that try to stall it out, such as stall Manaphy and Agility Corviknight.</li> <li>Ice Beam allows Porygon-Z to beat Garchomp and Landorus-T.</li> <li>A Modest nature allows it to get consistent knockouts against slower, non-Assault Vest Regidrago and Alolan Ninetales.</li> <li>However, a Timid nature allows it to outspeed other Choice Scarf users and Speed-boosting threats, such as Choice Scarf Regidrago and Speed Booster Energy Great Tusk.</li> <li>Porygon-Z cannot break through bulky Steel-type Pokemon, like Iron Crown, Metagross and Hisuian Goodra, so its best partners are Pokemon with good matchups against those foes, such as Urshifu-S, Fire-types like Volcarona and Volcanion, and Ground-types like Landorus-T.</li> </ul>"},
      "Custap Berry": {}
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}, {"user_id": 149971, "username": "Nuxl"}, {"user_id": 670315, "username": "Mentality"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 563650, "username": "bern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 567354, "username": "LUSTRE"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Cresselia": {
    "sets": {
      "Clear Amulet": {
        "description": "<ul> <li>Cresselia can opt to run a Clear Amulet to prevent moves such as Hisuian Goodra's Acid Spray, Primarina's Icy Wind, and Sylveon's Fake Tears from disrupting its ability to set up and defeat the foe with Stored Power.</li> <li>Stored Power becomes Cresselia's strongest move after it has used Calm Mind multiple times.</li> <li>Calm Mind allows Cresselia to KO the foe with Stored Power.</li> <li>Moonlight lets Cresselia regain HP when necessary to continue setting up with Calm Mind.</li> <li>Reflect is usually used in the last moveslot to help Cresselia take strong physical attacks from Pokemon like Choice Band Ursaluna.</li> <li>Future Sight can be used instead to defeat Encore + Disable Iron Valiant, which would otherwise be able to beat Cresselia.</li> <li>Cresselia's Special Defense EVs are meant to take Draco Meteor from Choice Specs Kyurem twice with a Calm Mind boost, and its Speed EVs allow it to outspeed base 60 Speed Pokemon like Primarina and Hisuian Goodra. The rest of the EVs are placed in Defense.</li> <li>Cresselia will never win a matchup against Dark-types like Urshifu-S and Meowscarada, while other Pokemon like Ogerpon-W and Alolan Ninetales can lock Cresselia into an unfavorable move with Encore. Fairy-type Pokemon like Diancie and Sylveon can help Cresselia defeat the former foes, while faster Pokemon that do not mind Encore like Iron Moth can help Cresselia with the latter.</li> </ul>"
      },
      "Choice Scarf": {
        "description": "<ul> <li>With use of a Choice Scarf, Cresselia can make use of the additional Speed and ability to disrupt Pokemon with Trick.</li> <li>Cresselia outspeeds and uses Psychic to threaten to 2HKO on Pokemon like Annihilape, Iron Moth, and Urshifu-R.</li> <li>Moonblast lets Cresselia to deal with Haxorus and less bulky variants of Urshifu-S.</li> <li>Trick allows Cresselia to lock foes into a non-damaging move, such as Manaphy, Espathra, Clear Amulet Zapdos, and Serperior.</li> <li>Moonlight allows Cresselia to heal itself in matchups where it can lock foes into a weaker attacking move, such as against Weakness Policy Iron Crown.</li> <li>The defensive EVs allow Cresselia to survive two Choice Band Haxorus Outrages and two non-Choice Specs Volcanion Steam Eruptions with burn chip damage. The Speed EVs allow Cresselia to outpace Iron Moth with a Choice Scarf and Hisuian Goodra after a Trick, and the rest of the EVs are dumped into Special Attack.</li> <li>Choice Scarf Cresselia is a great way to surprise players expecting Clear Amulet Cresselia, but without Reflect,it could struggle versus strong physical attackers like Ursaluna and Haxorus, so teammates like Corviknight and Urshifu-S are great partners.</li> <li>Cresselia will inevitably lose against Dark-types like Meowscarada, Chien-Pao, and Galarian Moltres, so Fairy-type and Steel-type teammates like Alolan Ninetales and Heatran can cover these weaknesses.</li> </ul>"
      },
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"user_id": 149971, "username": "Nuxl"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 563325, "username": "delemon"}]}, {"name": "Quality checked by", "members": [{"user_id": 451287, "username": "Kry"}, {"user_id": 563650, "username": "bern"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Manaphy": {"sets": {"Fast Stall": {}, "Sitrus Berry": {}, "Clear Amulet": {}}},
  "Darkrai": {
    "sets": {
      "Choice Scarf": {},
      "Choice Specs": {
        "description": "<ul> <li>Darkrai uses its high Speed and Special Attack with its vast movepool to blast through a wide range of opposing Pokemon.</li> <li>Dark Pulse is Darkrai's most consistent move, beating Pokemon such as non-Assault Vest Metagross, Pecharunt, Cresselia, and non-specially defensive Iron Crown, with the added benefit of a flinch chance.</li> <li>Ice Beam lets Darkrai defeat Landorus-T, non-Choice Scarf Meowscarada, Garchomp, and Zapdos.</li> <li>Thunder is Darkrai's best option against Corviknight, Urshifu-R, Manaphy, and non-Assault Vest Volcanion.</li> <li>Focus Blast helps Darkrai against non-Choice Scarf Kyurem, Zarude, Roaring Moon, and non-Choice Scarf Porygon-Z.</li> <li>Sludge Bomb assists versus non-specially defensive Ogerpon-W, Whimsicott, and non-Speed Booster Energy Iron Valiant.</li> <li>4 Special Defense EVs give Darkrai slightly better odds against a Hyper Beam from Life Orb Spectrier.</li> <li>Darkrai struggles to break through specially bulky Steel-, Fairy-, and Dragon-types, like Hisuian Goodra, Regidrago, and Sylveon, even when it is using super effective moves. Pokemon that beat these, such as Landorus-T, Sneasler, and Corviknight, are robust partners.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583189, "username": "LongRat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Serperior": {"sets": {"Subseed": {}, "Assault Vest": {}}},
  "Whimsicott": {"sets": {"Babiri Berry": {}, "Occa Berry": {}, "Kebia Berry": {}}},
  "Haxorus": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Bolstering a massive Attack stat, Haxorus uses its natural strength combined with a Choice Band to overwhelm its foes.</li> <li>Outrage is Haxorus's strongest option, threatening KOs on many Pokemon that don't resist it, such as Pecharunt, Volcarona, and Volcanion.</li> <li>Scale Shot allows Haxorus to break through Substitutes created by SubSeed Pokemon such as Serperior.</li> <li>First Impression allows Haxorus to get the jump on Meowscarada and Chien-Pao.</li> <li>For the last move, Close Combat can be used to threaten KOs on Steel-types such as Heatran and Hisuian Goodra. Iron Tail can be used to KO Diancie and Sylveon. Finally, Poison Jab can OHKO Whimsicott.</li> <li>Unnerve is Haxorus's generally preferred ability to prevent Pokemon that use resistance berries such as Haban Berry Raging Bolt and Chople Berry Hisuian Goodra and Urshifu-S from preventing an OHKO. However, Mold Breaker can be used to break through Hisuian Avalugg's Sturdy.</li> <li>As Choice Band Haxorus is locked into a move after it selects one, it is advised to select the move that does the most damage.</li> <li>Steel-types that don't care for  Haxorus's coverage moves such as Corviknight and Iron Crown can defeat Haxorus, while faster Ice- and Fairy-type Pokemon such as Choice Scarf Kyurem and Iron Valiant can threaten a KO on Haxorus.  Good Fire- and Steel-type partners like Volcanion and one's own Iron Crown can help Haxorus in these poor matchups.</li> </ul>"
      },
      "Choice Scarf": {},
      "Roseli Berry": {},
      "Rocky Helmet": {}
    },
    "credits": {"writtenBy": [{"user_id": 149971, "username": "Nuxl"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 563650, "username": "bern"}, {"user_id": 316445, "username": "lost heros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Volcarona": {
    "sets": {
      "Life Orb": {
        "description": "<ul> <li>Volcarona is one of the stronger Pokemon in 1v1 thanks to its powerful STAB moves and access to one of the strongest setup moves in the game in Quiver Dance, which allows it to break past several important Pokemon such as Alolan Ninetales, Porygon-Z, and Iron Crown.</li> <li>Bug Buzz threatens Hoopa-U and Cresselia, and the combination of Swarm and Bug Buzz allows Volcarona to OHKO non-Assault Vest Regidrago after a Quiver Dance. Bug Buzz also goes through Substitute to threaten the likes of Serperior and Whimsicott.</li> <li>Overheat can threaten Scizor, Iron Crown, and Metagross.</li> <li>Substitute is generally helpful against Pokemon that utilize low-accuracy moves to hit Volcarona, like Galarian Moltres and Zapdos, or for letting Volcarona get into Swarm range against Choice Specs Regidrago.</li> <li>The EV spread lets Volcarona outspeed non-Choice Scarf Regidrago and Hoopa-U while surviving the strongest Choice Scarf attacks from these foes; more specifically, the bulk allows it to survive a Modest Regidrago's Dragon Energy as well as an Adamant Hoopa-U's Hyperspace Fury after Life Orb recoil, with the rest of the EVs going into Special Attack.</li> <li>Volcarona tends to struggle against Pokemon that threaten to OHKO it, such as Primarina, Landorus-T, and Ursaluna, so Pokemon like Ogerpon-W and Kyurem make for good partners.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 632691, "username": "happysh"}]}, {"name": "Quality checked by", "members": [{"user_id": 149971, "username": "Nuxl"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Landorus-Therian": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Earthquake is for Raging Bolt, Iron Crown, and non-Choice Scarf Metagross.</li> <li>Outrage is for Haxorus, Dragapult, and Garchomp.</li> <li>U-turn makes the matchup against Hoopa-U reliable, as Earthquake does not OHKO bulkier sets.</li> <li>Rock Tomb lets Landorus-T deal with Volcarona and Choice Specs Zapdos, while Fly allows it to beat offensive Ogerpon-W and gives it another option against specially defensive Encore + Disable Iron Valiant.</li> <li>The HP EVs allow Landorus-T to tank Outrage from Jolly Choice Band Dragapult, while the Special Defense EVs allow it to take Overheat from Timid Life Orb Volcarona. The Speed EVs let Landorus-T outspeed non-Choice Scarf Hoopa-U. The remaining EVs are invested in Attack.</li> <li>Unless trying to outplay Custap Berry foes, such as Custap Berry Hoopa-U, for which Landorus-T has an option between using U-turn and Outrage, it is almost always recommended for Landorus-T to use its strongest attack against its foe.</li> </ul>"
      },
      "Life Orb": {
        "description": "<ul> <li>Earthquake hits Hisuian Goodra, Raging Bolt, Tyranitar, Skeledirge, and non-Air Balloon Pecharunt.</li> <li>Bulk Up helps against Iron Hands, Ursaluna, and Choice Band Annihilape.</li> <li>Hammer Arm is for Ursaluna, Assault Vest Ursaluna-B, and Air Balloon Heatran.</li> <li>Smack Down helps against Corviknight and Air Balloon Pecharunt, while U-turn increases Landorus-T's reliability against Hoopa-U. Protect can be used to prevent Custap Berry Skeledirge's Blast Burn from OHKOing Landorus-T with Blaze. Outrage can be utilized to deal with Haxorus and non-Haban Berry Garchomp.</li> <li>The Speed EVs allow Landorus-T to outspeed Modest Raging Bolt. The remaining EVs are invested in HP.</li> <li>Landorus-T can use an alternative set with an EV spread of 252 Atk / 4 Def / 252 Spe and a Jolly nature. This spread lets Landorus-T outspeed and OHKO most Porygon-Z and Hoopa-U sets, though Landorus-T has to carry U-turn for the latter to ensure an OHKO on bulkier sets.</li> <li>Against Ursaluna, Landorus-T should use Bulk Up until Hammer Arm can OHKO it, as Avalanche does not double in power if Landorus-T does not damage Ursaluna.</li> </ul>"
      },
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest is useful to win against foes that Landorus-T doesn't usually beat, like Regidrago, as it can survive a Dragon Energy and KO it back. Assault Vest can also help it survive attacks from other special attackers like Raging Bolt, non-Ice Beam Porygon-Z, and Steam Eruption from non-Choice Specs Volcanion.</li> <li>Outrage is a coverage move that helps Landorus-T against Dragon-types like Regidrago, Dragapult, and Haxorus.</li> <li>U-turn beats Hoopa-U.</li> <li>Bulldoze allows Landorus-T to lower the Speed of the opposing Pokemon, which can help against Iron Crown.</li> <li>Landorus-T's Special Defense EVs allow it to survive a Modest Choice Specs Dragon Energy from Regidrago, while the Speed EVs  allow it to outspeed Jolly Regidrago and Hoopa-U. The remaining EVs are put into Defense for better rolls against Choice Band Regidrago.</li> <li>Landorus-T struggles against Pokemon that are able to OHKO it, like Ninetales-Alola and  Chien-Pao, as well as  Pokemon that are able to use an Ice-type coverage move like  Choice item Iron Valiant and Meowscarada, and Pokemon that can tank a hit and OHKO it back like Primarina, or ones that aren't affected by any moves it can run, like Corviknight.</li> <li>Thus,  Pokemon such as Iron Crown or Volcanion can be used alongside Landorus-T to cover those threats.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 555423, "username": "Akeras"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 563325, "username": "delemon"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 563650, "username": "bern"}, {"user_id": 500233, "username": "RTM"}, {"user_id": 670315, "username": "Mentality"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Kyurem": {"sets": {"Choice Specs": {}, "Anti-Porygon-Z": {}, "Haban Berry": {}, "Choice Scarf": {}, "Weakness Policy": {}, "Assault Vest": {}}},
  "Greninja": {"sets": {"Life Orb": {}}},
  "Sylveon": {
    "sets": {
      "Life Orb": {
        "description": "<ul> <li>Coupled with Pixilate and Life Orb, Hyper Beam and Hyper Voice both become powerful STAB moves, destroying most Dragon-, Dark- and Fighting-types, such as Regidrago, Raging Bolt, Galarian Moltres, Darkrai, Iron Valiant, and both Urshifu forms. In addition, Hyper Beam OHKOes Landorus, Iron Hands, Assault Vest Great Tusk, and non-Assault Vest Azumarill and Rhyperior; the combination of the two moves can defeat Bellibolt.</li> <li>Thanks to the additional power and the defensive boost offered by Calm Mind, Sylveon can beat Manaphy, Spectrier, Espathra, non-Clear Amulet Zapdos, Assault Vest Ursaluna-B, Weakness Policy Primarina, and Calm Mind Raging Bolt.</li> <li>The Special Defense drop of Fake Tears is useful against Assault Vest Ursaluna and Azumarill, whereas Quick Attack allows Sylveon to finish off Custap Berry users like Primarina, Galarian Moltres, and Porygon-Z.</li> <li>The given EV spread lets Sylveon OHKO Alolan Ninetales with Hyper Beam and improves its matchup against Choice Band Urshifu-R. Indeed, Jolly Urshifu-R variants can't OHKO Sylveon, while Adamant versions only have low chances of KOing it.</li> <li>Sylveon is unable to eliminate Steel-, Poison-, and Fire-types such as Iron Crown, Metagross, Pecharunt, Iron Moth, Volcarona, and Skeledirge. Therefore, teammates with a favorable matchup against them, like the Ursaluna formes and the Landorus formes, are appreciated.</li> <li>Sylveon also can't face strong attackers such as non-Choice Specs Hoopa-U, boosted Porygon-Z, Ursaluna, and Donphan, so it needs partners like Corviknight and Choice Band Meowscarada to handle them.</li> </ul>"
      },
      "Custap Berry": {
        "description": "<ul> <li>Hyper Voice is notably a strong pick for Sylveon against Substitute users such as Whimsicott, Zapdos, and Spectrier, whereas Hyper Beam is a powerful option to get rid of frailer foes, including Raging Bolt, Meowscarada, and Porygon-Z, and offers a great attack on the turn where Sylveon's Custap Berry activates. Against bulkier targets like Primarina, Ursaluna-B, and Ogerpon-W, Sylveon should either use Fake Tears or Hyper Voice, then take enough damage to get into Custap Berry range and finish them with Hyper Beam.</li> <li>Thanks to Fake Tears, Sylveon can win some tricky matchups against Pokemon such as Landorus-T, Bellibolt, and non-Clear Amulet Manaphy.</li> <li>The combination of Endure + Custap Berry lets Sylveon turn the tide against the likes of Ogerpon-W, non-Assault Vest Hoopa-U, Choice Band Meowscarada, and Porygon-Z. Sylveon should usually use Endure on the first turn against the aforementioned Pokemon.</li> <li>Thanks to the given EV spread, Sylveon can tank two Ice Shards from Adamant Choice Band Chien-Pao, allowing it to always be able to use Endure on the first turn against Chien-Pao while still having high enough Special Defense for Timid Choice Specs Landorus. The remaining EVs are put in Special Attack to increase its damage output.</li> <li>Fire- and Water-types such as Volcarona, Volcanion, and Ogerpon-W appreciate Sylveon's ability to deal with Dragon-types, while, in return, they can beat threatening Steel- and Fire-types like Metagross, Iron Crown, Corviknight, Skeledirge, and opposing Volcarona.</li> <li>Sylveon usually struggles against Poison-types, notably Pecharunt, Iron Moth, and Fezandipiti, so it appreciates having Steel- and Psychic-type teammates such as Hisuian Goodra, Iron Crown, and Hoopa-U.</li> </ul>"
      },
      "Weakness Policy": {},
      "Babiri Berry": {}
    },
    "credits": {"writtenBy": [{"user_id": 661113, "username": "Valteyek"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 149971, "username": "Nuxl"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 563650, "username": "bern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Goodra-Hisui": {
    "sets": {
      "Custap Berry": {
        "description": "<ul> <li>Hisuian Goodra is one of the most solid Pokemon in SV 1v1 thanks to its unique typing of Steel and Dragon, allowing to beat Pokemon such as non-Assault Vest Regidrago and Raging Bolt without fearing much back from them, while also dealing with Fairy-type Pokemon such as Primarina.</li> <li>Draco Meteor hits Dragon-type Pokemon like non-Assault Vest Regidrago and Kyurem, on top of targets like Raging Bolt and Volcanion after an Acid Spray.</li> <li>Acid Spray is one of the key points of this set, as its 100% chance of dropping opponents Special Defense helps Hisuian Goodra in boosting its attacks against Pokemon like Haban Berry Regidrago, and Primarina, as long as the first one doesn't carry Dragon Energy.</li> <li>Sludge Wave allows it to deal with Primarina more easily.</li> <li>Flash Cannon can deal with other Fairy-type Pokemon such as Diancie and Alolan Ninetales.</li> <li>Endure allows Hisuian Goodra to live any hit that would've OHKOed it, then activate Custap Berry on the next turn, and fire back with its powerful Draco Meteor.</li> <li>Sap Sipper is a useful tool for Hisuian Goodra as it allows it to easily deal with Whimsicott and Serperior.</li> <li>Its EV spread allows it to live two Moonblasts from Choice Specs Primarina and a Dragon Energy from Choice Specs Regidrago while maximizing HP, with the remaining EVs going into Special Attack.</li> <li>Hisuian Goodra can struggle against Fighting- and Ground-types like both Urshifu formes, Great Tusk, and Ursaluna, so Pokemon that can deal with these, like Primarina, Serperior, and Manaphy make for great partners.</li> </ul>"
      },
      "Chople Berry": {
        "description": "<ul> <li>Draco Meteor is for Dragon-type Pokemon without defensive items like Haban Berry and Assault Vest, such as Regidrago, Raging Bolt, Dragapult, and non-Choice Specs Kyurem.</li> <li>Heavy Slam deals with Fairy-type Pokemon such as Whimsicott, Diancie, and Primarina.</li> <li>Acid Spray is used to drop Special Defense, and the combination of Acid Spray + Draco Meteor can KO Pokemon like Porygon-Z, non-Assault Vest or non-Choice Specs Volcanion, non-Clear Amulet Pecharunt, and Life Orb Spectrier.</li> <li>Counter is for Pokemon with strong physical moves that don't OHKO Hisuian Goodra, usually Choice Band users like Urshifu-R, Iron Valiant, Chien-Pao, and Meowscarada.</li> <li>Hisuian Goodra's EVs maximize HP so that it can tank a Choice Band Close Combat from Iron Valiant and both Urshifu formes while surviving two +1 Life Orb Hexes from Spectrier after chip damage from burn. Its Attack allows it to always OHKO non-bulky sets of Iron Valiant, with the rest of the EVs in Special Attack.</li> <li>Because of Sap Sipper, Hisuian Goodra can win against SubSeed Pokemon such as Whimsicott, Serperior, and Ogerpon-W.</li> <li>Against Encore + Disable Pokemon like Iron Valiant and Alolan Ninetales, it is necessary to use Heavy Slam turn 1 and switch to Acid Spray on turn 2. Using Acid Spray turn 1 will lose the matchup, as it does not threaten a 2HKO on these foes.</li> <li>Since Hisuian Goodra struggles against Ursaluna, Landorus-T, and Donphan, Pokemon like Primarina, Urshifu-R, and Manaphy make good teammates.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Choice Band Hisuian Goodra looks to use its inferior but still solid Attack stat to surprise and defeat foes such as Hoopa-U, opposing Hisuian Goodra, Volcarona, and Assault Vest Regidrago.</li> <li>Heavy Slam deals tons of damage to Diancie, Sylveon, and Primarina.</li> <li>Skitter Smack is extremely useful for the Hoopa-U matchup, as it can OHKO even the most bulky variants of it. It's also helpful for non-Focus Blast Iron Crown, as it means it's difficult for Iron Crown to break through.</li> <li>Earthquake hits important threats such as non-Counter Hisuian Goodra, Volcarona, Metagross, and non-Air Balloon Heatran.</li> <li>The EV spread allows Hisuian Goodra to live a Choice Band Hyperspace Fury from Hoopa-U as well as two Life Orb Moonblasts from Primarina.</li> <li>Since Ground- and Fighting-type attacks are quite common in the metagame from Pokemon like Iron Valiant, Haxorus, Ursaluna, and Landorus-T, Pokemon with typings that are quite good against these like Primarina are advised for teammates.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}, {"user_id": 568493, "username": "ZackPalace"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 563325, "username": "delemon"}]}, {"name": "Quality checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 500233, "username": "RTM"}, {"user_id": 149971, "username": "Nuxl"}, {"user_id": 563650, "username": "bern"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 670315, "username": "Mentality"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 594256, "username": "GraveBee"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Diancie": {"sets": {"Weakness Policy": {}, "Choice Specs": {}}},
  "Hoopa-Unbound": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Hyperspace Fury targets Psychic-types like Iron Crown and Metagross as well as Ghost-types such as Skeledirge and Pecharunt.</li> <li>Gunk Shot deals with Fairy-types such as non-Kebia Berry Azumarill, non-Custap Berry Primarina, and Sylveon.</li> <li>Hoopa-U's last two moveslots are highly customizable. Zen Headbutt can handle Poison-types like Okidogi. Drain Punch allows Hoopa-U to beat Darkrai. Fire Punch beats non-Occa Berry Scizor, while Ice Punch is for non-Weakness Policy Galarian Moltres as well as Landorus; however, it should be noted that both Landorus formes can run U-turn to beat Hoopa-U.</li> <li>Hoopa-U's HP and Special Defense EVs are to survive a Timid Choice Scarf Porygon-Z's Hyper Beam, with the rest put in Attack and Speed.</li> <li>Hoopa-U can utilize an alternative EV spread of 240 HP / 252 Def / 16 Spe with an Impish nature to survive strong physical attacks from Meowscarada while also outspeeding Adamant Donphan and Iron Hands.</li> <li>Hoopa-U struggles against Fairy- and Bug-type foes such as Iron Valiant and Volcarona, so Fire-type teammates such as Skeledirge and Volcanion are appreciated. Fast Choice Band Hoopa-U also struggles against faster physical attackers such as Ogerpon-W and Meowscarada; therefore, physical walls as partners like Pecharunt are helpful.</li> </ul>"
      },
      "Choice Specs": {"description": "<ul> <li>Psychic Noise is used over Psychic, as it allows Hoopa-U to defeat Serperior.</li> <li>Dark Pulse should be used against non-Disable Spectrier and Cresselia.</li> <li>Thunderbolt allows Hoopa-U to beat Corviknight.</li> <li>Grass Knot is for Rhyperior, while Focus Blast is strong into Hisuian Goodra.</li> <li>Choice Specs Hoopa-U can use 52 HP EVs to survive Leaf Storm twice from non-Special Attack-invested Serperior. Additionally, 252 Speed EVs without a boosting nature allow Hoopa-U to outspeed Corviknight while also having the best odds against opposing Choice Specs Hoopa-U. The rest of the EVs and a Modest nature allow for maximum damage output.</li> <li>Choice Specs Hoopa-U can also use an EV spread of 228 HP / 252 Def / 12 SpA / 16 Spe to survive Giga Impact from Assault Vest Ursaluna while outspeeding Adamant Donphan. The remaining EVs and a Modest nature allow for the best damage output while running this spread.</li> </ul>"},
      "Choice Scarf": {"description": "<ul> <li>Hyperspace Fury should be used against Cresselia, Dragapult, Serperior, and Pecharunt.</li> <li>Gunk Shot is for non-defensive Ogerpon-W and Meowscarada.</li> <li>Focus Blast is for Chien-Pao and Porygon-Z.</li> <li>Thunderbolt is for non-Maranga Berry Corviknight, while Rock Tomb is for non-bulky Volcarona.</li> <li>The HP and Special Defense EVs let Hoopa-U survive Timid Choice Scarf Porygon-Z's Hyper Beam. Maximum Speed EVs and a Jolly nature allow Hoopa-U to outspeed Modest Choice Scarf Porygon-Z and Dragapult and Speed tie opposing Choice Scarf Hoopa-U. The remaining EVs are in Attack.</li> <li>Hoopa-U should use the strongest move it has in most cases. Other cases include trying to outplay a potential Custap Berry foe like Custap Berry Porygon-Z, picking a more accurate move in case two moves can KO, and using Hyperspace Fury to bypass Substitute and Protect.</li> </ul>"},
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest Hoopa-U is a strong check to powerful special attackers like Porygon-Z and Volcanion.</li> <li>Psychic Noise deals strong damage to Fighting-types like Iron Valiant, as well as threatening victories against Pokemon that make use of their recovery to win battles, such as stall Azumarill and Pecharunt.</li> <li>Knock Off allows Hoopa-U to damage other Psychic-types like Cresselia and Iron Crown while removing important items like Custap Berry from Sylveon and Life Orb from Porygon-Z that could otherwise threaten Hoopa-U's ability to win the matchup.</li> <li>Gunk Shot threatens KOs against Fairy-type Pokemon like Primarina and Sylveon.</li> <li>Drain Punch is used to defeat various Pokemon that Hoopa-U may want to recover HP from, such as non-Chople Berry Hisuian Goodra and Porygon-Z.</li> <li>The HP and Special Defense EVs are used to bulk +2 Life Orb Porygon-Z's Hyper Beam after Knock Off, and the Speed EVs outspeed neutral-natured maximum investment base 50 speed Pokemon like Donphan. The rest of the EVs are dumped into Attack.</li> <li>This set aims to act as a blanket check to many special attackers in the tier, such as Primarina and Porygon-Z. However, Assault Vest Hoopa-U may lack the immediate fire power to deal enough damage to Pokemon like Corviknight or have enough Speed to defeat other Pokemon like faster Hoopa-U.</li> </ul>"
      },
      "Custap Berry": {
        "description": "<ul> <li>Psychic hits Poison-types like Pecharunt and Fighting-types like Urshifu-R, while Hyperspace Fury hits foes like Dragapult and Skeledirge.</li> <li>Hyperspace Fury is useful because it ignores Spiky Shield from Ogerpon-W and Protect from other Custap Berry Pokemon.</li> <li>Gunk Shot helps against Grass-types like Leech Seed Ogerpon-W and Whimsicott. It can also reliably hit Dark-types like Darkrai.</li> <li>The HP and Defense investment helps Hoopa-U survive a Play Rough from Ogerpon-W, and the Speed EVs let it outspeed Donphan, but be careful because it has a chance to OHKO Hoopa-U with Earthquake. The remaining EVs are in Attack for maximum damage.</li> <li>Against SubSeed Ogerpon-W, always use Gunk Shot until it is in range of Hyperspace Fury.</li> <li>Pair Hoopa-U with something that can win against bulky Steel-types like Corviknight, Hisuian Goodra, and Registeel because Hyperspace Fury doesn't do enough damage, and they can KO it in return or use Iron Defense. Some good Pokemon for role that are Smack Down Landorus, Ursaluna-B, and Volcarona.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620268, "username": "skippergamez"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 149971, "username": "Nuxl"}, {"user_id": 555423, "username": "Akeras"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 517652, "username": "DripLegend"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}, {"user_id": 316445, "username": "lost heros"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Volcanion": {
    "sets": {"Assault Vest": {}, "Choice Specs": {"description": "<ul> <li>Volcanion uses its unique typing and high Special Attack to carve its role as a strong, bulky attacker.</li> <li>Steam Eruption is a strong STAB move to OHKO Pokemon such as Volcarona, Skeledirge, and non-Speed invested Ursaluna.</li> <li>Overheat hits Corviknight, Metagross, Meowscarada, and non-specially defensive Iron Crown.</li> <li>Sludge Wave is solid coverage to use versus Primarina, Ogerpon-W, Sylveon, and non-Encore + Disable Iron Valiant.</li> <li>Hyper Beam hits Haxorus for an OHKO.</li> <li>The defensive EVs allow Volcanion to survive an Earthquake from Choice Band Haxorus while also taking Sylveon's Hyper Beam after Fake Tears.</li> <li>Volcanion struggles to defeat Dragon-types such as Regidrago and Hisuian Goodra. It can therefore be paired with Pokemon such as Iron Valiant, Iron Crown, and Sylveon to cover these weaknesses.</li> </ul>"}, "Specially Defensive": {}, "Choice Scarf": {}},
    "credits": {"writtenBy": [{"user_id": 583189, "username": "LongRat"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 563650, "username": "bern"}, {"user_id": 670315, "username": "Mentality"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Primarina": {
    "sets": {
      "Life Orb": {
        "description": "<ul> <li>This spread allows Primarina to beat Pokemon that it usually can't, such as Timid Weakness Policy Iron Crown and non-Agility Corviknight.</li> <li>Generally, the sequence against Iron Crown is to use Encore on the first turn to lock it into using Calm Mind, then use Icy Wind twice to lower its Speed so Primarina can lock it with Encore back into Calm Mind in the following turn, then use Moonblast once and use Encore once again, then alternate between Hydro Cannon and Encore, keeping the recharge turn and Life Orb damage in mind. In case Iron Crown uses Tachyon Cutter on the first turn, it activates Torrent on turn two, which allows Primarina to OHKO it with Hydro Cannon.</li> <li>This spread allows Primarina to survive a Poison Jab or Sludge Wave from Adamant Choice Band Urshifu formes and Timid Life Orb Landorus and then OHKO them with Moonblast or Icy Wind, respectively.</li> <li>An alternative EV spread of 56 HP / 192 Def / 8 SpA / 252 Spe lets Primarina bulk Jolly Choice Band Urshifu formes' attacks but not Adamant Choice Band variants, dropping that matchup in order to gain a more consistent Iron Crown matchup, since Primarina's higher Speed stat means it can outspeed Iron Crown after a single Icy Wind and threaten Special Attack Booster Energy variants with a Torrent-boosted Hydro Cannon if Iron Crown decides to go for an attack. This spread also allows Primarina to outspeed Ursaluna and OHKO it with Hydro Cannon.</li> <li>Against Spectrier, use Encore on turn one. If Spectrier attacks on turn one, use Hydro Cannon on turn two. If Spectrier uses a status move, use Icy Wind thrice with the main spread or twice with the alternative spread, then use Encore to lock Spectrier into a status move while dealing damage with Moonblast and Hydro Cannon.</li> <li>Moonblast allows Primarina to beat commonly used Dragon- and Fighting-type Pokemon, such as Roaring Moon, Dragapult, the Urshifu formes, and Iron Valiant.</li> <li>Since Primarina is weak to Poison-type or STAB attacks from foes such as Sneasler, Pecharunt, Volcanion, Hoopa, Raging Bolt, and Ogerpon-Wellspring, it is suggested to pair Primarina with Dragon- and Steel-type Pokemon such as Regidrago, Iron Crown, and Metagross to form the well-known Dragon / Fairy / Steel core.</li> </ul>"
      },
      "Weakness Policy": {
        "description": "<ul> <li>Primarina is one of the strongest Pokemon in 1v1 thanks to its unique typing, important role compression, and variety of sets.</li> <li>The combination of Weakness Policy and Charm or Reflect allows Primarina to take care of slower threats that aim to defeat it with their super effective moves, such as Iron Hands with Supercell Slam and Donphan and Ursaluna with Gunk Shot.</li> <li>Charm can work multiple times, which can help if Primarina is trying to stall a foe or to get to Torrent range to fire off an extremely strong Hydro Cannon, while Reflect can take care of Clear Amulet Pokemon, an item these Pokemon can run to be a hard counter to the Charm variant.</li> <li>Hydro Cannon can KO Ursaluna and Donphan after a boost from Weakness Policy on the former and a Draining Kiss on the latter.</li> <li>Draining Kiss and Moonblast can threaten Regidrago and both Urshifu formes, and while Draining Kiss is especially helpful for the Donphan matchup, Moonblast can also be utilized for overall damage against Haxorus.</li> <li>Calm Mind lets it set up in front of potential threats like Clear Amulet Cresselia.</li> <li>Thanks to its huge investment in Speed, Primarina can outrun Ursaluna, Iron Hands, and Donphan while threatening KOs in return, with its Defense and HP maximized for the best rolls against Choice Band Haxorus.</li> <li>Primarina should be used in teams where its weaknesses to Grass, Electric, and Poison are patched up, so it really likes pairing with Dragon-types like Regidrago and Raging Bolt, Steel-types like Corviknight and Hisuian Goodra, or Psychic-types like Hoopa-U and Iron Crown.</li> </ul>"
      },
      "Custap Berry": {
        "description": "<ul> <li>Custap Berry Primarina looks to flip matchups it usually loses, like Choice Specs Kyurem, and provide reliability against Landorus-T; it achieves this by surviving attacks it would normally be OHKOed by with Endure, moving first on the second turn with Custap Berry, and firing back with its extremely strong attacks.</li> <li>Hydro Cannon can hit both Ursaluna formes, Skeledirge, and Great Tusk, and it's boosted by Torrent if Primarina is at or below 1/3rd of its maximum HP, which is often reached when Primarina loses enough health for Custap Berry to activate the following turn, allowing it to outspeed and wash out these Pokemon with little issue.</li> <li>Moonblast hits Haxorus, Iron Valiant, Regidrago, and both Urshifu formes.</li> <li>Encore helps against Pokemon that attempt to set up on or attack Primarina like non-Choice Scarf or Specs Porygon-Z and Weakness Policy Metagross, while Calm Mind helps it boost against the likes of Passho Berry Volcarona.</li> <li>Primarina's HP and Defense EVs help it survive a Timid Life Orb Landorus's Sludge Wave as well as an Adamant Choice Band Urshifu's Poison Jab, with the remaining EVs going into Special Attack.</li> <li>Primarina finds itself struggling against Grass-, Electric- and Poison-types like offensive Ogerpon-W, Raging Bolt, and Pecharunt, so it appreciates having partners that can deal with these threats like Regidrago, Hoopa-U, and Iron Crown.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>Hydro Cannon is Primarina's strongest attack and should be used against both Landorus formes, non-Custap Berry Skeledirge, and non-Substitute Volcarona.</li> <li>Moonblast defeats Regidrago, Haxorus, and Garchomp.</li> <li>Energy Ball should be used against Rhyperior and is Primarina's best way to deal with non-Sap Sipper Azumarill.</li> <li>Liquid Voice + Uproar makes Primarina defeat Registeel and gives it an option to defeat Custap Berry Skeledirge and Substitute Volcarona, while Psychic Noise + Torrent allows it to beat Whimsicott reliably. Torrent Primarina is also more consistent agaisnt bulkier Choice Specs Hoopa sets, as Moonblast does not always OHKO them.</li> <li>The HP and Defense EVs allow Primarina to survive Earthquake from Choice Band Landorus-T, while the Special Defense EVs allow it to survive Sludge Wave from Timid Choice Specs Landorus.</li> <li>Choice Specs Primarina, unlike other Primarina sets, loses to Encore + Disable Iron Valiant sets, so it is important to use a teammate that can defeat the aforementioned sets.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 563650, "username": "bern"}, {"user_id": 566592, "username": "Mcthelegit"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 563325, "username": "delemon"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 536219, "username": "fruan"}, {"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}, {"user_id": 316445, "username": "lost heros"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Rillaboom": {"sets": {"Life Orb": {}, "SubSeed": {}, "Specially Defensive SubSeed": {}, "Assault Vest": {}}},
  "Corviknight": {
    "sets": {
      "Maranga Berry": {
        "description": "<ul> <li>Iron Defense lets Corviknight boost its Defense against physical attackers like non-Thunder Punch Meowscarada, non-Trick Choice Scarf Metagross, and Haxorus to then outheal them with Roost.</li> <li>Taunt lets Corviknight beat setup Pokemon like Iron Crown, Calm Mind Primarina, and Registeel.</li> <li>Running Agility on Corviknight over Body Press can allow it beat Curse Pecharunt, Encore + Disable Alolan Ninetales, and some Icy Wind variants of Primarina.</li> <li>Compared to Agility, Body Press has much less chances of getting hit by a critical hit, allows Corviknight to beat Chien-Pao while reducing the chances of getting flinched, and is less forced to use Roost more than it has to against Ursaluna and Ursaluna-B thanks to not worrying about Roost letting it get hit by a Ground-type move or critical hit.</li> <li>Maranga Berry allows Corviknight to beat Regidrago by using Roost to stall it out with Pressure, as well as helping it against other special attackers such as Kyurem, Primarina, and Espathra.</li> <li>Corviknight can reduce its chances of receiving a critical hit with Pressure, which is valuable on a stall Pokemon because its effect gives foes half as many chances to land a critical hit.</li> <li>The 200 speed EVs allow Corviknight to outspeed neutral-natured base 60 Speed Pokemon such as Choice Specs Primarina and Sylveon and prevent them from setting up with Taunt, the special bulk allows it to beat Choice Specs Regidrago by using Roost on the first turn, and the rest of the EVs are put into Defense.</li> <li>Good partners to Corviknight are Ground- and Dragon-types like Ursaluna and Regidrago that can beat the Fire- and Electric-types that threaten Corviknight super effectively.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 632691, "username": "happysh"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Dragapult": {"sets": {"Choice Band": {}, "Choice Specs": {}}},
  "Urshifu": {
    "sets": {
      "Custap Berry": {
        "description": "<ul> <li>Custap Berry + Reversal allows Urshifu-S to blow past threats that would otherwise be an issue for it such as Choice Scarf Haxorus and Hisuian Goodra.</li> <li>Wicked Blow hits Cresselia, Pecharunt, Spectrier, Iron Crown, and Metagross.</li> <li>Endure is useful against Choice-locked Pokemon such as opposing Urshifu-S, so that your Urshifu-S can survive on 1 HP, go first the next turn thanks to Custap Berry, and fire back with a 200-Base Power Reversal.</li> <li>Bulk Up is useful to set up against Corviknight, since the Defense boost means Urshifu-S doesn't take as much damage from its Body Press or Brave Bird, and the Attack boost means Wicked Blow does more damage; thanks to Wicked Blow's guaranteed critical hit, it also ignores possible Defense boosts from Iron Defense.</li> <li>Sucker Punch can be used over Bulk Up to win against Choice Scarf Cresselia.</li> <li>The EVs allow Urshifu-S to survive a Close Combat from Choice Scarf Haxorus as well as a Hyper Beam from Choice Specs Spectrier while also having enough Speed for non-Jolly Corviknight. The remaining EVs are put into Attack.</li> <li>Urshifu-S can often struggle against Dragon-, Fairy-, and Fighting-type Pokemon such as Regidrago, Sylveon, Iron Valiant, and Urshifu-R, so it appreciates having other Poison- and Fairy-type Pokemon such as Pecharunt and Primarina as teammates.</li> </ul>"
      },
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest helps Urshifu-S to survive special hits from Pokemon that it would usually struggle against, like defensive Iron Crown, Porygon-Z, and Volcarona.</li> <li>Wicked Blow damages Iron Crown, Pecharunt, and Cresselia.</li> <li>Close Combat hits non-Chople Berry Hisuian Goodra, both Ursaluna formes, and Porygon-Z.</li> <li>Sucker Punch allows Urshifu-S to attack first against threats like Custap Berry Skeledirge and Spectrier in case it needs to do so.</li> <li>Rock Tomb is utilized to have a mostly guaranteed matchup against Volcarona.</li> <li>Counter helps against physically defensive Pokemon like Donphan; Urshifu-S can't deal much damage to them, but Counter helps it to mitigate this.</li> <li>Its EV spread is designed so that it can always beat Porygon-Z. Its Speed EVs allow it to outspeed maximum Speed Choice Specs Porygon-Z, while its Special Defense investment enables it to survive a Hyper Beam from Modest Choice Scarf variants. The remaining EVs are invested into Attack.</li> <li>Urshifu-S struggles heavily against Fairy-types like Iron Valiant and Sylveon. Due to this, Steel- and Poison-type Pokemon like Scizor and Iron Moth make for good partners.</li> </ul>"
      },
      "Chople Berry": {}
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 579035, "username": "glitched"}]}, {"name": "Quality checked by", "members": [{"user_id": 149971, "username": "Nuxl"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 655207, "username": "Sir Tetris"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Choice Band": {"description": "<ul> <li>Surging Strikes deals with Landorus-T, Skeledirge, and Volcarona.</li> <li>Close Combat targets Assault Vest Urshifu-S, non-Choice Scarf Porygon-Z, non-Choice Scarf Kyurem, and Registeel.</li> <li>Iron Head is for non-Life Orb Alolan Ninetales, since Urshifu-R can get past Encore + Disable variants by ignoring Protect.</li> <li>Poison Jab is for Whimsicott and non-bulky Primarina.</li> <li>Thunder Punch 2HKOes opposing Urshifu-R without having to drop Urshifu-R's Defense with Close Combat.</li> <li>Against Ursaluna and Ursaluna-B, Surging Strikes is the best option, since both can carry Chople Berry.</li> <li>Since Urshifu-R struggles against Psychic- and Fairy-type Pokemon like Metagross, Iron Crown, and Iron Valiant, Pokemon such as Meowscarada, Volcanion, and Volcarona make for good teammates.</li> </ul>"},
      "IronPress": {
        "description": "<ul> <li>The IronPress combination allows Urshifu-R to wall Pokemon it otherwise wouldn't be able to handle, like Metagross, while also dealing with common physical stalwarts like Ursaluna and Registeel.</li> <li>Surging Strikes hits Volcarona, Landorus-T, and Rhyperior.</li> <li>Taunt can be used to prevent foes like Registeel and non-Brave Bird Corviknight from setting up or using recovery moves.</li> <li>Sitrus Berry allows Urshifu-R to usually survive two Psychic Fangs from Choice Band Metagross after an Iron Defense boost so it can respond with two +2 Body Press in return.</li> <li>Urshifu-R can struggle with Grass- and Electric-type Pokemon like Ogerpon-W and Zapdos, and as a result, partners like Regidrago and Raging Bolt are recommended.</li> <li>Urshifu-R can struggle against special attackers like Spectrier and Porygon-Z due to its poor Special Defense, so Pokemon like Hisuian Goodra and Assault Vest Ursaluna can make for good partners.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}, {"user_id": 568493, "username": "ZackPalace"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 563650, "username": "bern"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 149971, "username": "Nuxl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Regidrago": {
    "sets": {
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest Regidrago looks to tank special hits from important special attackers like Choice Specs Porygon-Z, while also dealing with both Special Attack Booster Energy Raging Bolt and Walking Wake, while firing back with its own Draco Meteor.</li> <li>Scale Shot should be mainly used for boosting Regidrago's Speed against targets like Porygon-Z and Galarian Moltres so it can fire back a 2HKO with Draco Meteor or Outrage.</li> <li>Dragon Energy deals the most damage to slower targets like Skeledirge and non-Choice Scarf Volcanion.</li> <li>Outrage can deal with special walls like Hoopa-U and Assault Vest Galarian Moltres.</li> <li>Breaking Swipe is helpful against Donphan and Hisuian Avalugg, as it can lower their Attack stat, break their Sturdy without fearing an OHKO back, and then fire a Draco Meteor.</li> <li>Its Special Defense EVs are made so it can tank a Special Attack Booster Energy Raging Bolt's Draco Meteor, its HP and Defense EVs let it survive a Close Combat from the Urshifu formes, and its Speed allows it to outspeed non-Choice Scarf Porygon-Z after a Scale Shot. The remaining EVs go into Special Attack.</li> <li>Regidrago likes pairing up with Steel- and Fire-type Pokemon like Metagross, Heatran, and Volcarona quite often due to their great matchups against Fairy- and Steel-type Pokemon, respectively.</li> </ul>"
      },
      "Haban Berry": {
        "description": "<ul> <li>This Regidrago set is made to counter some Dragon-type Pokemon such as Raging Bolt and Dragapult, as Regidrago's Haban Berry allows it to take one Dragon-type move from these Pokemon before KOing them.</li> <li>Breaking Swipe has the advantage of lowering foes' Attack, which helps Regidrago against the likes of Iron Hands and Donphan.</li> <li>Outrage is Regidrago's strongest and most reliable physical attack, whereas Dragon Energy can hit slower Pokemon such as Ursaluna-B and Skeledirge very hard without lowering its Special Attack.</li> <li>Thanks to the EV spread, Regidrago is able to tank any hit from Timid Choice Specs Latios and Choice Band Dragapult, and outspeed every base 110 Speed Pokemon like Ogerpon-W, Latios, and Iron Moth at +1.</li> <li>Poison- and Steel-types such as Pecharunt, Metagross, and Iron Crown make great teammates, as they can beat Fairy-types like Primarina, Sylveon, and Iron Valiant, which completely wall Regidrago.</li> <li>Regidrago also appreciates pairing with Fire- and Ground-types such as Skeledirge, Volcanion, and the Ursaluna formes to handle Steel-types like Corviknight, Metagross, and Iron Crown.</li> </ul>"
      },
      "Choice Scarf": {
        "description": "<ul> <li>Choice Scarf Regidrago can surprise many Pokemon that rely on their Speed to reliably beat it, such as Meowscarada and Chien-Pao.</li> <li>Outrage should be used on most targets, since it is the most reliable of its Dragon-type moves. Thanks to Dragon's Maw, it 2HKOes many neutral targets like Zapdos and OHKOes frail Pokemon like Meowscarada and Greninja.</li> <li>Draco Meteor helps against Pokemon like Chien-Pao and Great Tusk, whose much lower Special Defense can be exploited.</li> <li>Dragon Energy should only be used if it can cleanly OHKO a target, such as against Choice Specs Darkrai, because its high power can significantly decrease after being damaged. This means it should not use it against priority users like Ice Shard Chien-Pao or potentially faster Choice Scarf users like Hisuian Arcanine.</li> <li>Earthquake is Regidrago's only useful coverage move for this set, allowing it to OHKO non-Air Balloon Heatran and 2HKO Sturdy Magnezone.</li> <li>Maximum Speed investment gives the best chances in the mirror matchup, the 132 Attack EVs allow Regidrago to OHKO no bulk Volcarona, and the remaining EVs are put into Special Attack. This set uses a Naive nature because Regidrago is a mixed attacker, and a Defense-lowering nature would make Regidrago occasionally lose to Choice Band Ice Shard from Chien-Pao. The lost Special Defense is rarely relevant.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>Regidrago is one of the strongest attackers in the tier. Boosted by Choice Specs, it can demolish defensive threats such as Pecharunt and Cresselia.</li> <li>Dragon Energy has a whopping 150-Base Power if Regidrago is at full HP. This makes it its best option against Pokemon that normally wouldn't be fast enough to strike it first, such as non-Choice Scarf Cresselia and Ursaluna.</li> <li>Draco Meteor is great against Pokemon that are fast enough to hit Regidrago but aren't tanky enough to survive one attack from it such as both Urshifu formes and non-Endure Sneasler.</li> <li>Dragon Pulse has situational usage as a third Dragon-type STAB move without the drawbacks of the other two moves, and it is useful against Pokemon like Volcarona and SubSeed Ogerpon-W that may use Substitute on the first turn to anticipate Regidrago's Draco Meteor decreasing its Special Attack.</li> <li>Earth Power is Regidrago's best way to hit Steel-types such as non-Air Balloon Heatran and Metagross. However, Regidrago may fail to OHKO most Pokemon that resist its Dragon-type STAB moves, so good partners for it are ones that can handle Steel and Fairy-types, like Ursaluna, Metagross, and Corviknight.</li> <li>The Defense EVs allow Regidrago to bulk Adamant Choice Scarf Landorus-T's Outrage, allowing it to OHKO Landorus-T with Draco Meteor. Regidrago's Speed EVs are to maximize its ability to outspeed other base 80 Pokemon such as opposing Regidrago, and the rest of the EVs are placed in Special Attack.</li> <li>Compared to Regidrago's other sets, Choice Specs allows it to obtain a destructive level of power to blast through bulky Pokémon like Ursaluna and Cresselia. However, it does lose some matchups won by other sets such as Choice Scarf beating faster threats like Play Rough Meowscarada and Assault Vest having the bulk for strong special attacks like Choice Specs Porygon-Z's Hyper Beam, so teammates that can appropriately handle these situations such as Corviknight will help Choice Specs Regidrago flourish.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Outrage is the main attacking move of Regidrago, being able to OHKO threats like Hoopa-U and non-Haban Berry Raging Bolt.</li> <li>Scale Shot is useful to boost Speed and to break Substitute, especially in the Ogerpon-W and Serperior matchups.</li> <li>Earthquake hits foes like non-Air Balloon Heatran, Hisuian Arcanine, and Assault Vest or Choice Band Metagross. It also forces Tinkaton to run Air Balloon.</li> <li>For the 4th moveslot, Fire Fang is an option that helps against Corviknight without Iron Defense, Scizor, and Air Balloon Tinkaton. Regidrago can also use Hammer Arm for Air Balloon Heatran.</li> <li>The bulk EVs allow Regidrago to survive Choice Band Jolly Hoopa-U's attacks, and the Speed EVs are for better odds against opposing Regidrago.</li> <li>If the opposing team is using a Dragon-type without a Fairy- or Steel-type, then it is likely to be holding a Haban Berry. Regidrago can OHKO these Haban Berry Dragon-types such as opposing Regidrago and Raging Bolt with at least four hits from Scale Shot.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 149971, "username": "Nuxl"}, {"user_id": 555423, "username": "Akeras"}, {"user_id": 661113, "username": "Valteyek"}, {"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 500233, "username": "RTM"}, {"user_id": 563650, "username": "bern"}, {"user_id": 579035, "username": "glitched"}, {"user_id": 149971, "username": "Nuxl"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Spectrier": {"sets": {"Life Orb": {}, "Choice Specs": {}, "Sitrus Berry + Disable": {}}},
  "Ursaluna": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Earthquake is for Raging Bolt, Iron Crown, and non-Air Balloon Pecharunt.</li> <li>Giga Impact is used for Choice Scarf Porygon-Z and non-Choice Band Azumarill.</li> <li>Avalanche targets Landorus, Landorus-T, and Garchomp.</li> <li>Gunk Shot is for Sylveon and Azumarill, while Low Kick is the best move against opposing Ursaluna, Ursaluna-B, and Air Balloon Heatran.</li> <li>Bulletproof helps against Choice Specs Iron Valiant and some Hoopa-U sets, while Guts helps against Will-O-Wisp users like Volcarona, Spectrier, and Weakness Policy + Will-O-Wisp Dragapult.</li> <li>The HP and Defense EVs allow Ursaluna to survive Hammer Arm from Choice Band Landorus-T, while the Special Defense EVs allow it to take Hyper Beam from Life Orb Sylveon. The remaining EVs are put in Attack.</li> <li>Choice Band Ursaluna should click the most damaging move against its foe unless multiple moves OHKO, in which case it is best to click the most accurate of said choices. Against Substitute users like Volcarona, it is usually better to use Earthquake to avoid a recharge turn with Giga Impact.</li> </ul>"
      },
      "Guts": {
        "description": "<ul> <li>With Guts, Ursaluna becomes an insanely threatening Pokemon capable of OHKOing a great portion of the metagame upon activation of its Flame Orb. Toxic Orb may alternatively be used to deal with Pokemon that learn Trick such as Cresselia.</li> <li>After being burned, Facade is able to muscle through Pokemon that would otherwise deal with Choice Band Ursaluna such as Kee Berry Cresselia and is capable of OHKOing many frail Pokemon such as Sylveon.</li> <li>Headlong Rush threatens KOs on Pokemon such as Skeledirge and Pecharunt.</li> <li>Avalanche allows Ursaluna to respond to opposing Ground- and Dragon-type Pokemon that would get the first strike, being able to OHKO threats like Choice Band Landorus-T and Choice Scarf Haxorus.</li> <li>Swords Dance allows Ursaluna to boost itself in matchups where it cannot immediately threaten a KO, overwhelming threats that focus on boosting themselves such as Iron Crown.</li> <li>Taunt may be used to shut down matchups that could otherwise outplay Guts Ursaluna, such as against SubSeed Whimsicott.</li> <li>The bulk EVs are used to survive Modest Porygon-Z's Hyper Beam without a boosting item and Choice Band Landorus-T's Hammer Arm. The rest of the EVs maximize Ursaluna's Attack.</li> <li>While Guts Ursaluna has the ability to switch moves and disrupt defensive threats like Iron Crown, the lack of immediate firepower that Choice Band would grant can cause Ursaluna to lose some matchups like against Regidrago and slower non-Custap Berry Primarina.</li> </ul>"
      },
      "Assault Vest": {}
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 149971, "username": "Nuxl"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 563650, "username": "bern"}, {"user_id": 518399, "username": "Itchy"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Ursaluna-Bloodmoon": {"sets": {"Chople Berry": {}, "Choice Scarf": {}, "Assault Vest": {}}},
  "Meowscarada": {
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Flower Trick demolishes Water-types such as Primarina, Urshifu-R, and Manaphy.</li> <li>Knock Off crushes Psychic- and Ghost-types such as Cresselia, Espathra, and Skeledirge.</li> <li>Triple Axel hits Dragon-types like non-Choice Scarf Regidrago and Raging Bolt, Flying-types such as Zapdos and both Landorus formes, and Grass-types like opposing Meowscarada and Whimsicott super effectively.</li> <li>Meowscarada's last moveslot is pretty flexible; Giga Impact is its overall strongest pick, taking down foes such as non-Choice Scarf Porygon-Z and low-invested Ogerpon-W and Walking Wake; Play Rough deals with Fighting-types like Urshifu-S and Annihilape and is a better move against some Dragon-types, notably Walking Wake and Kyurem; Thunder Punch is a great option for Corviknight, against which Meowscarada would otherwise have a hard time; Low Kick hits Hisuian Goodra and Kyurem for more damage.</li> <li>A Jolly nature ensures Meowscarada outspeeds Greninja, Serperior, Ogerpon-W, and non-Speed Booster Energy Iron Valiant, while an Adamant nature provides some additional firepower to this set, allowing feats such as OHKOing Custap Berry Skeledirge and most Metagross variants with Knock Off, Porygon-Z with Triple Axel, and Annihilape with Play Rough.</li> <li>Meowscarada struggles against faster Pokemon like Speed Energy Booster Iron Valiant and Choice Scarf users such as Regidrago and Hoopa-U, so it appreciates partners that can deal with them like Hisuian Goodra, Pecharunt, and Corviknight.</li> </ul>"
      },
      "Choice Scarf": {},
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"user_id": 661113, "username": "Valteyek"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 451287, "username": "Kry"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Skeledirge": {
    "sets": {
      "Custap Berry": {
        "description": "<ul> <li>Skeledirge is a powerful Pokemon in 1v1 thanks to its combination of Custap Berry, Blaze, and Blast Burn, which allows it to melt past threats like Hisuian Goodra and Iron Hands after a Torch Song.</li> <li>Torch Song allows Skeledirge to boost its Special Attack if it can survive a hit while also hitting Pokemon like Serperior and Whimsicott through Substitute.</li> <li>Encore helps Skeledirge against Pokemon like Iron Valiant and Iron Crown, as they can sometimes use Encore on it themselves or start setting up on it. Encore is also helpful for Skeledirge in cases where it can guarantee itself to go into Custap Berry range, such as when opponents choose to use weaker moves against it due to the fear of Endure.</li> <li>Endure allows Skeledirge to survive attacks from Pokemon like non-Assault Vest Landorus-T and offensive Ogerpon-W to then go next the second turn with Custap Berry and fire off a strong Blaze-boosted Blast Burn.</li> <li>The HP and Defense investment allows Skeledirge to survive an Earthquake from Choice Band Iron Hands, the Special Defense investment makes it always tank a Dark Pulse from Choice Specs Porygon-Z, and the rest of the EVs are put into Special Attack.</li> <li>Endure should be used wisely, as there are many Pokemon that can easily OHKO Skeledirge but may choose not to because of the threat of Endure and Blast Burn, like Choice Band Landorus-T and others like Spectrier.</li> <li>Skeledirge may struggle against Dragon- and Water-types like Regidrago, Walking Wake, and Manaphy. Pokemon that can deal with these threats, such as Kyurem, Sylveon, and Meowscarada make for great partners.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 563325, "username": "delemon"}]}, {"name": "Quality checked by", "members": [{"user_id": 149971, "username": "Nuxl"}, {"user_id": 520168, "username": "Murm"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Maushold-Four": {"sets": {"The Maus": {}}},
  "Bellibolt": {"sets": {"Custap Berry": {}, "Life Orb": {}}},
  "Tinkaton": {"sets": {"The Tink": {}}},
  "Annihilape": {"sets": {"Bulky Choice Band": {}, "Fast Choice Band": {}, "Fast Bulk Up": {}, "Defensive Bulk Up": {}, "Weakness Policy": {}}},
  "Great Tusk": {"sets": {"Choice Band": {}, "Bulky Choice Band": {}, "Booster Energy (Attack)": {}, "Choice Scarf": {}, "Booster Energy (Speed)": {}, "Custap Berry": {}, "Assault Vest": {}}},
  "Iron Hands": {"sets": {"Booster Energy (Attack)": {}, "Anti-Gouging Fire": {}}},
  "Iron Moth": {"sets": {"Power Herb": {}}},
  "Baxcalibur": {"sets": {"Fast Choice Band": {}, "Bulky Choice Band": {}, "Chople Berry": {}}},
  "Chien-Pao": {"sets": {"Choice Band": {}}},
  "Iron Valiant": {
    "sets": {
      "Encore + Disable": {
        "description": "<ul> <li>Iron Valiant's main attack is very interchangeable. Moonblast is the most reliable and is usually the one that works in the most matchups like opposing Iron Valiant and Walking Wake, while Low Kick can help it break through Steel-type Pokemon like Hisuian Goodra and Registeel, though, it's scared of Counter from the former.</li> <li>The Speed EVs allow it to outspeed Choice Scarf Porygon-Z, with the remaining EVs going into Defense so it can bulk physical hits and fire back with its Encore + Disable setup.</li> <li>To utilize Encore + Disable effectively, you usually have to use Protect on the first turn to scout the foe's first move. If you are certain it is a Choice-locked Pokemon, you can just use Disable on the second turn and force it to use Struggle, and if it utilizes a status move, you are free to use Encore on its move and attack with your main STAB move; otherwise, it is recommended to use Encore on the second turn to take a hit, then Protect on the third turn, then Disable on the fourth turn, and, once Encore is over, you use Encore again. This ensures 2 turns of Struggle from the foe, at which point Iron Valiant should be able to KO it. On more passive Pokemon that have moves that do little damage like Registeel, it sometimes can be better to opt out of using Protect and just use your main attack.</li> <li>Iron Valiant fits best on teams that can cover their main weakness to Steel-type Pokemon; therefore, Fire-type Pokemon like Volcarona and Skeledirge make great teammates. In return, Iron Valiant can handle threats like Choice Specs Greninja and Choice Band Ursaluna. Iron Valiant also appreciates Pecharunt and Hisuian Goodra being extremely consistent against Fairy-types, as these can easily deal with them while it deals with Ground-type Pokemon like Great Tusk and the previously mentioned Ursaluna.</li> </ul>"
      },
      "Choice Specs": {
        "description": "<ul> <li>Moonblast and Focus Blast are Iron Valiant's main STAB moves, OHKOing targets that are weak to them such as non-Assault Vest Raging Bolt, both Urshifu formes, and Flame Orb Ursaluna.</li> <li>Thunderbolt's main use is to 2HKO Corviknight, which Iron Valiant's usual sets can't do much against, though it has to watch out for Expert Belt Corviknight.</li> <li>Iron Valiant's last move varies depending on what its team needs. Psyshock takes care of Iron Moth, while Icy Wind can usually beat both Landorus formes, though it has to watch out for Assault Vest Landorus-T with Fly.</li> <li>A Modest nature maximizes damage and ensures some OHKOs like non-Chople Berry Hisuian Goodra but for most matchups like non-bulky Ogerpon-W, Iron Moth, and non-Speed Booster Energy Walking Wake, it is better to run a Timid nature.</li> <li>Iron Valiant's HP and Special Defense EVs let it survive a Special Attack Booster Energy Raging Bolt's Thunderclap so it's safe to OHKO back with Moonblast, with the remaining EVs used on Speed and Special Attack to maximize its ability to outspeed and threaten frail threats.</li> <li>Iron Valiant really struggles to put a dent on Fairy-type Pokemon like Sylveon and Primarina, so Poison- and Steel-type Pokemon like Pecharunt and Hisuian Goodra can be really helpful to shut down these threats.</li> <li>Iron Valiant can struggle with Psychic-types like Iron Crown and Metagross, as it can't do much damage to them, so Dark-types like Meowscarada, Darkrai, and Hoopa-U work as good partners for it.</li> </ul>"
      },
      "Choice Band": {
        "description": "<ul> <li>Spirit Break OHKOes Regidrago, Haxorus, Hoopa-U, and both Urshifu formes.</li> <li>Close Combat deals huge damage to non-Chople Berry Hisuian Goodra and Ursaluna, Registeel, Kyurem, non-Choice Scarf Porygon-Z, and non-Brave Bird or Iron Head Corviknight.</li> <li>Ice Punch lets Iron Valiant deal with both Landorus formes, though it has a chance of not beating Fly Landorus-T.</li> <li>Poison Jab helps against non-Kebia Berry Whimsicott and Serperior, while Liquidation can take care of frail and non-Passho Berry Volcarona.</li> <li>Iron Valiant struggles against Psychic- and Fairy-type Pokemon like Iron Crown, Metagross, Primarina, and Sylveon, so Pokemon like Hoopa-U, Darkrai, and Pecharunt are really helpful. In return, Iron Valiant can help them deal with Fighting- and Ground-type Pokemon like Iron Hands, Great Tusk, and Landorus.</li> <li>Iron Valiant also struggles to beat Water-type Pokemon like Manaphy, Azumarill, and bulky Ogerpon-W, so Pokemon like Zapdos and Raging Bolt can help with these threats, while Iron Valiant deals with the previously mentioned Ground-types along with Ice-type Pokemon like Chien-Pao and Kyurem.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 563325, "username": "delemon"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 652656, "username": "Gambit"}]}]}
  },
  "Walking Wake": {"sets": {"Fast Booster Energy (Special Attack)": {}, "Breaking Swipe": {}, "Snarl": {}, "Booster Energy (Speed)": {}}},
  "Fezandipiti": {"sets": {"Life Orb": {}}},
  "Ogerpon-Wellspring": {
    "sets": {
      "Offensive": {
        "description": "<ul> <li>Ogerpon-W is a very strong offensive threat with a wide movepool capable of adapting itself to a variety of threats in 1v1.</li> <li>Power Whip hits opposing Water- and Ground- Types like Primarina and Ursaluna. Wood Hammer may be used to not deal with Power Whip's 85% accuracy, though taking recoil may cause Ogerpon-W to lose some matchups that Power Whip would be a better fit for, such as against opposing Ogerpon-W.</li> <li>Ivy Cudgel muscles through Fire- and Ground-types like Volcarona, Heatran, and Landorus-T.</li> <li>Ogerpon-W's blisteringly fast base 110 Speed allows it to shut down many defensive threats that enjoy boosting their Defense stat such as Corviknight and Iron Crown by locking them into a status move with Encore.</li> <li>Superpower may be used to secure KOs on threats that would otherwise survive Ogerpon-W's STAB attacks such as bulky Choice Specs Porygon-Z and non-Counter Hisuian Goodra.</li> <li>U-Turn can KO bulkier, slower Hoopa-U sets that would survive Ogerpon-Wellspring's other moves.</li> <li>Knock Off can be used to outplay Custap Berry Pokemon such as Skeledirge and faster Choice Scarf users like Metagross.</li> <li>Trailblaze lets Ogerpon-Wellspring to get the jump on faster Pokemon that could potentially outplay it such as Encore + Disable Iron Valiant.</li> <li>Spiky Shield can be used to secure OHKOs against Pokemon like Custap Berry Skeledirge and can stop Fly from Landorus-T.</li> <li>Ogerpon-W's Speed is maximized to outspeed Alolan Ninetales and Speed tie itself in the mirror matchup. The rest of the EVs are placed to maximize its Attack.</li> <li>Because of Ogerpon-W's immense strength, versatility, and Speed, its moveset is completely flexible and can open a myriad of options for its partners. Unfortunately, Offensive Ogerpon-W can be overwhelmed by threats that can survive an attack and KO it back, such as Regidrago, so good partners that help Ogerpon-W overcome this issue like as Sylveon and Iron Crown are helpful.</li> </ul>"
      },
      "Charm": {
        "description": "<ul> <li>Charm + Synthesis allows Ogerpon-W to outlast slower physical attackers like Haxorus and Iron Hands. Synthesis can also help defeat Draco Meteor users like Speed Booster Energy Walking Wake.</li> <li>Ivy Cudgel is a reliable Water-type STAB move used to chip down the likes of Metagross and Skeledirge.</li> <li>Power Whip is used primarily to take down other Water-types, most notably Primarina and Urshifu-R.</li> <li>If some of these Pokemon are already well-covered by a partner, Encore is worth considering. Encore can foil the plans of some setup Pokemon, such as Swords Dance Iron Hands, that would otherwise outlast Charm and then KO Ogerpon-W. Encore also allows for it to break through some stall Pokemon, such as Reflect + Calm Mind Cresselia.</li> <li>152 Speed EVs and a Jolly nature allow Ogerpon-W to outspeed Haxorus and Urshifu. The defensive investment gives the best chances to survive a Close Combat from Choice Band Urshifu, allowing Ogerpon-W to be sent in against both of its formes without having to guess at Team Preview.</li> </ul>"
      },
      "Specially Defensive": {
        "description": "<ul> <li>Power Whip is for Primarina and non-Sap Sipper Azumarill and is the best option against non-Defense boosting natured Sylveon.</li> <li>Ivy Cudgel is for non-Passho Berry Volcarona and Rhyperior.</li> <li>Knock Off should be used against Spectrier and Porygon-Z.</li> <li>Superpower guarantees the matchup against both Hisuian Goodra and bulkier Porygon-Z sets after Knock Off, while Encore allows Ogerpon-W to defeat Pokemon like Registeel.</li> <li>The Speed EVs allow Ogerpon-W to outspeed non-Choice Scarf Porygon-Z, while the HP and Special Defense EVs give it the best roll to survive Hyper Beam from Modest Porygon-Z after Ogerpon-W's Knock Off.</li> <li>If Power Whip and another move both KO an opposing Pokemon, it is best to use the other move due to accuracy.</li> <li>Against slower Pokemon that attempt to stall out Ogerpon-W, Encore can be used to lock them into a status move.</li> <li>Knock Off can also be used in some matchups to remove an opposing Custap Berry on the turn that Pokemon like Custap Berry Sylveon use Endure.</li> </ul>"
      },
      "SubSeed": {
        "description": "<ul> <li>Maximum speed is to outspeed everything Ogerpon-W can, including non-Choice Scarf Landorus-T, and Manaphy.</li> <li>The Defense EVs let Ogerpon-W survive Choice Band Metagross's Psychic Fangs, while the Special Defense EVs let it take Ursaluna-Bloodmoon's combo of Blood Moon and Vacuum Wave.</li> <li>Ogerpon-W should use Leech Seed turn one, then alternate between Spiky Shield and Substitute until the foe is KOed or is within range of Ogerpon-W's attacks.</li> <li>Without Spiky Shield, Ogerpon-W relies more on its offensive capabilities. After using Leech Seed, it should use Substitute until it's able to KO foes with either Power Whip or Ivy Cudgel.</li> <li>Leech Seed and Substitute are standard for the strategy. While Spiky Shield isn't mandatory, it is usually used to increase healing from Leech Seed and to stall out the foe's HP.</li> <li>One or two attacking moves are used; Ivy Cudgel is better for hitting Fire-, Ground-, and Rock-types like Lando-T, Skeledirge, and Rhyperior for super effective damage and is better against IronPress sets from Pokemon like Registeel and Corviknight because of Ivy Cudgel's higher crit rate. Power Whip's main advantage is that it is better against Water-types, like Primarina and Manaphy.</li> </ul>"
      },
      "Defensive": {
        "description": "<ul> <li>This Ogerpon-W takes a more defensive route thanks to its decent bulk and access to Counter in order to flip otherwise losing matchups, such as against non-Triple Axel Meowscarada.</li> <li>Power Whip hits Water-type Pokemon such as Primarina super effectively and is Ogerpon-W's best option against neutral matchups like Sylveon.</li> <li>Ivy Cudgel threatens Fire- and Ground-type Pokemon such as Skeledirge and Landorus-T.</li> <li>Counter is the main focal point of this set, allowing defensive Ogerpon-W to retaliate against physical foes that would threaten to KO or feel that a physical attack is their best move against offensive Ogerpon-W sets, such as non-Triple Axel Choice Band Meowscarada and opposing Ogerpon-W. Alternatively, Knock Off may be used to remove Custap Berry from Pokemon such as Skeledirge.</li> <li>U-turn is Ogerpon-W's best option against non-defensive Hoopa-U, which gets OHKOd by U-turn. Alternatively, Encore is useful to lock down a slower foe focused on boosting their stats, such as Cresselia and defensive Iron Crown, or to outplay Endure Custap Berry sets from Pokemon such as Sylveon and Skeledirge.</li> <li>The Speed EVs allow Ogerpon-W to outspeed Hoopa-U, whereas the HP and Defense EVs give Ogerpon-W the best rolls against Adamant Choice Band Meowscarada.</li> <li>Defensive Ogerpon-W won't have the firepower to threaten Pokemon like Fast Choice Specs Porygon-Z, Bulky Hoopa-U, and Ursaluna, so teammates that can cover this weakness such as Corviknight are appreciated.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 669997, "username": "Spenceair"}, {"user_id": 149971, "username": "Nuxl"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 493772, "username": "Lumii"}]}, {"name": "Quality checked by", "members": [{"user_id": 579035, "username": "glitched"}, {"user_id": 563650, "username": "bern"}, {"user_id": 316445, "username": "lost heros"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 518399, "username": "Itchy"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Hydrapple": {"sets": {"Haban Berry": {}, "Yache Berry": {}}},
  "Raging Bolt": {
    "sets": {
      "Haban Berry": {
        "description": "<ul> <li>Thunderbolt is the main Electric-type STAB move, but Thunder makes Raging Bolt more reliable against Primarina, as Thunder can OHKO it, so you don't have to worry about potential Weakness Policy or Encore after using Calm Mind or Charge. Thunderbolt should be used when it does neutral or super effective damage against frailer foes like Primarina, Corviknight, and Metagross without an Assault Vest. Against foes that can survive Draco Meteor followed by Thunderclap like Hoopa-U and Urshifu-S, it is safer to use Thunderbolt or Thunder into Draco Meteor.</li> <li>Draco Meteor hits Electric-resistant foes like Rillaboom and should be used against bulkier foes like Hoopa-U and Skeledirge. It also 2HKOes Unaware Skeledirge.</li> <li>Thunderclap is a priority move that helps to KO low HP Pokemon like non-Assault Vest Metagross after one use of Thunderbolt. Draco Meteor into Thunderclap does slightly more damage than Thunderbolt into Thunderclap against neutral targets, but Thunder into Thunderclap does more. Thunderclap also counters Custap Berry users like Primarina and Hoopa-U by attacking on the turn they use their Custap Berry.</li> <li>Calm Mind and Charge are both here to boost Raging Bolt's power and special bulk. Both moves especially help against Primarina, though Charge is more reliable against it and Calm Mind is useful in more matchups like against Rillaboom, Iron Hands, and Spectrier.</li> <li>Haban Berry allows Raging Bolt to win against Dragon-types such as Regidrago and Walking Wake, as it can OHKO them after surviving a Dragon-type move. However, if those Dragon-types are holding a Haban Berry, Raging Bolt can't OHKO them and is 2HKOed back.</li> </ul>"
      },
      "Booster Energy (Special Attack)": {
        "description": "<ul> <li>Thunderbolt is Raging Bolt's most consistent STAB attack and beats Primarina, non-Assault Vest Metagross, and Volcanion.</li> <li>Draco Meteor is Raging Bolt's strongest STAB attack and should be used against Skeledirge.</li> <li>Thunderclap allows Raging Bolt to get KOs after using Thunderbolt and Draco Meteor and helps in matchups against some Hoopa-U sets as well as against Custap Berry users like Primarina and the Urshifu formes.</li> <li>Taunt allows Raging Bolt to beat Pecharunt and Ogerpon-W.</li> <li>The HP and Defense EVs allow Raging Bolt to survive the Choice Band Urshifu formes' Close Combat, while the Special Defense EVs allow it to survive a Hyper Beam from Timid Porygon-Z. The Speed EVs allow Raging Bolt to outspeed Modest Primarina. The remaining EVs are put in Special Attack to maximize power for best odds against specially defensive Primarina.</li> <li>Draco Meteor into Thunderclap is stronger than Thunderbolt into Thunderclap, so in matchups where there is no recovery from the foe, such as against non-Sitrus Berry Annihilape, it is better to use Draco Meteor into Thunderclap.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 555423, "username": "Akeras"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 546922, "username": "bo_bobson27"}]}, {"name": "Quality checked by", "members": [{"user_id": 518399, "username": "Itchy"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 563650, "username": "bern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Iron Boulder": {"sets": {"Choice Band": {}, "Booster Energy (Speed)": {}}},
  "Iron Crown": {
    "sets": {
      "Fast Weakness Policy": {
        "description": "<ul> <li>Fast Weakness Policy Iron Crown aims to switch up otherwise disadvantageous matchups such as Haxorus as well as Choice Band Ground-types such as Landorus-T by boosting itself with Iron Defense, then obtaining a Weakness Policy boost to threaten an OHKO on the next turn with Stored Power.</li> <li>Tachyon Cutter is Iron Crown's best Steel-type STAB move, being able to immediately pressure Fairy-Type Pokemon such as Iron Valiant and Sylveon. Tachyon Cutter has other niches in breaking foes' Substitute, such as against SubSeed Ogerpon-W and Serperior.</li> <li>Upon activation of Weakness Policy, Stored Power's Base Power increases by 80. Combined with any prior boosts Iron Crown may have obtained, this makes Stored Power its strongest Psychic-type STAB option.</li> <li>Psyshock can be used to disrupt the matchup versus other Calm Mind users that resist Stored Power such as opposing Iron Crown and Cresselia, albeit using Psyshock may miss out on important KOs that Stored Power would otherwise obtain.</li> <li>Psychic Noise may be used to prevent recovery moves from Pokemon such as Cresselia that would otherwise be able to deal with Iron Crown. Psychic Noise also deals additional damage to Iron Valiant and Alolan Ninetales compared to Iron Crown's other Psychic-type options.</li> <li>Calm Mind is used in matchups versus special attacking Pokemon such as Primarina and Cresselia in order to boost up Iron Crown's Special Attack and Special Defense to a point where it does not take much damage from their attacks while threatening KOs with Tachyon Cutter and Stored Power.</li> <li>The EVs are used to outspeed maximum Speed Haxorus and to tie the mirror matchup versus opposing Iron Crown. The bulk is meant to tank an Adamant Choice Band Great Tusk Headlong Rush after one Iron Defense.</li> <li>An alternative EV spread of 96 HP / 112 Def / 48 SpA / 252 Spe with a Timid Nature can be used to have a slightly better chance against Donphan with Tachyon Cutter after a Weakness Policy boost while still surviving Choice Band Great Tusk's Headlong Rush.</li> </ul>"
      },
      "Defensive Weakness Policy": {
        "description": "<ul> <li>Defensive Weakness Policy Iron Crown uses Iron Defense and Calm Mind to boost its defenses to survive strong hits and KO back with Weakness Policy-boosted Stored Power.</li> <li>Stored Power obtains a massive boost in Base Power when combined with Weakness Policy and stat-boosting moves.</li> <li>Alternatively, Psyshock can be used for matchups Pokemon that have enough Special Defense to not be threatened by Stored Power, such as Cresselia and Pokemon that Iron Crown can't boost in front of like Iron Valiant..</li> <li>Tachyon Cutter is hits Fairy-types such as Sylveon and Iron Valiant, and can break Substitute from Pokemon such as Serperior.</li> <li>Calm Mind is used for matchups where boosting Special Attack and Special Defense is necessary, such as against Assault Vest Ursaluna-B.</li> <li>The HP and Defense EVs allow Iron Crown to have a 75% chance to survive Adamant Choice Band Meowscarada's Knock Off in order to kill it with +2 Tachyon Cutter, as well as having favorable rolls to survive two Choice Band Ursaluna's Earthquake to boost with Iron Defense up to +4 and KO with Stored Power. The remaining EVs are placed in Speed for the mirror matchup and to base 50 speed Pokemon such as Ursaluna.</li> <li>36 Speed EVs can be used instead to outspeed Max Speed Primarina.</li> <li>While this set is able to bulk many attacks, it is notably slower than faster Choice Band users like Landorus-T, making Defensive Iron Crown lose the matchup against them. Faster teammates that can deal with these Pokemon are ideal, such as attackers like Meowscarada.</li> </ul>"
      },
      "Specially Defensive Weakness Policy": {
        "description": "<ul> <li>This specially defensive EV spread allows Weakness Policy Iron Crown to take special hits from very powerful special attackers such as Timid Choice Specs Darkrai, Raging Bolt, and Choice Specs Dragapult.</li> <li>Psyshock is vital for matchups such as Calm Mind Raging Bolt, Iron Valiant, and Alolan Ninetales, as it helps hit the weaker physical side on the former and assists against Disable variants on the latter two.</li> <li>The Defense EVs let Iron Crown survive Adamant Choice Band Knock Off from Meowscarada, while the Special Defense is enough to survive two Thunderbolts into a Thunderclap from Raging Bolt after a Calm Mind boost, since it would use Taunt on Iron Crown on the first turn. The Special Attack investment is enough to OHKO Haxorus with Tachyon Cutter after the Special Defense drop from Close Combat.</li> <li>This Iron Crown set can struggle a lot against opposing Iron Crown due to the lack of Stored Power and matches up poorly against common Fire- and Ground-types and other miscellaneous threats like Hoopa-U and Corviknight, so it's recommended to utilize strong partners such as Air Balloon Volcanion and Ogerpon-W.</li> </ul>"
      },
      "Special Attack Booster Energy": {
        "description": "<ul> <li>Calm Mind allows Iron Crown to compete with Pokemon like Raging Bolt, Cresselia, and opposing Iron Crown.</li> <li>Psyshock enables Iron Crown to hit specially defensive foes, empowers it against Calm Mind users such as Weakness Policy Iron Crown and Clear Amulet Cresselia, and is important against Alolan Ninetales.</li> <li>Tachyon Cutter exerts pressure on Fairy-type foes like Iron Valiant and Sylveon.</li> <li>Focus Blast lets Iron Crown take on foes including Ursaluna-B and Hisuian Goodra. Alternatively, Psychic Noise can be used to check foes that rely on recovery moves, especially Pecharunt and Clear Amulet Cresselia. Moreover, Stored Power + Calm Mind allows Iron Crown to handle foes like Manaphy. Finally, Psychic allows Iron Crown to deal increased damage to foes such as Iron Hands and Speed Booster Energy Walking Wake.</li> <li>The bulk EVs allow Iron Crown to survive Knock Off from Adamant Choice Band Meowscarada and Hydro Cannon from Timid Choice Specs Primarina, with the rest of the EVs being put into Special Attack.</li> <li>Primarina is a great partner for Iron Crown, since Iron Crown is weak to Ground- Fire- and Dark-type attacks from foes like Landorus, Volcarona, and Urshifu-S; in return, Iron Crown provides an immunity to Poison. On top of this, Iron Crown's weakness to Ghost-type attacks can be remedied by using other Dark-types, such as Roaring Moon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 149971, "username": "Nuxl"}, {"user_id": 563650, "username": "bern"}, {"user_id": 667394, "username": "AhmedxWaleed"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 546922, "username": "bo_bobson27"}, {"user_id": 519863, "username": "Blanched"}, {"user_id": 503725, "username": "clerica"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Quality checked by", "members": [{"user_id": 563650, "username": "bern"}, {"user_id": 481149, "username": "bea"}, {"user_id": 500233, "username": "RTM"}, {"user_id": 670315, "username": "Mentality"}, {"user_id": 316445, "username": "lost heros"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 527157, "username": "Kiwi"}]}]}
  },
  "Pecharunt": {
    "sets": {
      "Air Balloon": {
        "description": "<ul> <li>Malignant Chain can threaten common Fairy- and Grass-type Pokemon like Iron Valiant and Ogerpon-W. Its high poison chance can also wear down bulky Pokemon without relying on Curse.</li> <li>Curse lets Pecharunt whittle down any foe behind Substitute regardless of typing, including Registeel and SubSeed Ogerpon-W.</li> <li>The combination of Parting Shot and Recover lets Pecharunt neutralize virtually all non-Taunt, neutrally effective attackers like Iron Hands and non-Choice Specs Primarina while keeping itself healthy.</li> <li>The Speed investment lets Pecharunt outspeed neutral-natured base 60 Speed Pokemon like Primarina and Maximum investment base 50 Speed Pokemon like Donphan and Ursaluna. The remaining investment is in HP and Defense for maximum bulk for powerful Ground-type attackers like Assault Vest Landorus-T.</li> <li>Air Balloon prevents an opposing Ground-type move from being used on Pecharunt once , which can completely shut down Choice-locked Ground-types like Choice Band Landorus-T and Choice Band Ursaluna or can provide an opportunity for a Parting Shot to be used on Pokemon like Assault Vest Ursaluna.</li> <li>Against SubSeed Ogerpon-W, Curse shouldn't be used until after Parting Shot to minimize the damage from Ivy Cudgel so that Curse can be used safely.</li> <li>Despite Air Balloon, Pecharunt still struggles with Ground-types like Landorus-I, Life Orb Landorus-T, and or Attack Booster Great Tusk, so pairing it with a Water- or Ice-type like Primarina or Chien-Pao can be helpful.</li> </ul>"
      },
      "Leftovers": {
        "description": "<ul> <li>Malignant Chain can seriously threaten Iron Valiant and Ogerpon-W. It also has the added bonus of having a high chance of poisoning which can wear down bulky Pokemon without relying on Curse, and it can also trigger Poison Puppeteer to provide decent odds to win otherwise losing matches with confusion.</li> <li>Curse lets Pecharunt whittle down any foe behind Substitute regardless of typing, including Body Press Corviknight, Registeel, and SubSeed Ogerpon-W.</li> <li>The combination of Parting Shot and Recover lets Pecharunt neutralize virtually all non-Taunt, neutrally effective attackers like non-Choice Specs Primarina and Choice Scarf Haxorus while keeping Pecharunt healthy.</li> <li>The Speed investment lets Pecharunt outspeed Body Press and PP stall Corviknight. The remaining EVs are in HP and Special Defense for overall bulk.</li> <li>Leftovers provides consistent healing in every matchup but also lets Pecharunt avoid being PP stalled by Taunt + Body Press Corviknight. Leftovers is also chosen over Black Sludge to continue to provide healing after a Soak from Bellibolt.</li> <li>Against most Pokemon, Parting Shot should be used early to mitigate damage. Even against Encore Primarina, as after a few Parting Shots, Primarina won't be able to do substantial damage and Pecharunt will PP stall Encore out.</li> <li>Against SubSeed Ogerpon-W, Curse shouldn't be used until after Parting Shot has been used to minimize the damage from Ivy Cudgel so that Curse can be used safely.</li> <li>Against Volcarona and other Pokemon that may be able to OHKO Pecharunt, it's better to use Malignant Chain instead and play for a confusion from Poison Puppeteer.</li> </ul>"
      },
      "Maranga Berry": {
        "description": "<ul> <li>This Pecharunt set searches to maximize its weak Special Defense to wall common threats such as Choice Scarf Regidrago and Choice Specs users like Kyurem and Raging Bolt while still dealing with other common threats like Ogerpon-W and Primarina.</li> <li>Malignant Chain threatens all sorts of Fairy- and Grass-type Pokemon like Serperior, Whimsicott, and Sylveon, with the chance of badly poisoning the target being a huge threat for any Pokemon.</li> <li>Curse helps Pecharunt to not get walled by the likes of Registeel, as it often struggles to deal with Steel-types on its own while also helping against Pokemon that set up Substitute like Ogerpon-W.</li> <li>Parting Shot helps it deal with special attackers like the previously mentioned Choice Scarf Regidrago and Choice Specs Kyurem while also helping it against physical attackers like Iron Hands.</li> <li>Recover is a great tool that helps it do everything that was previously mentioned with great longevity. It also helps when it needs to activate Maranga Berry on the first turn when the opposing Pokemon deals too much damage pre-Maranga Berry boost like Choice Scarf Regidrago and Special Attack Booster Energy Raging Bolt.</li> <li>Its Speed EVs are meant to let it outspeed Modest Primarina, while the HP and Special Defense EVs help against Choice Scarf Regidrago.</li> <li>Pecharunt is usually found on teams that value its defensive capabilities, stalling potential, and Poison typing, so it's usually paired with offensive Pokemon like Ogerpon-W and both Urshifu formes.</li> </ul>"
      },
      "Clear Amulet": {
        "description": "<ul> <li>This Pecharunt set makes the best out of its combination of Parting Shot and Clear Amulet to wall any Pokemon with moves that can drop stats, like Fake Tears Sylveon, Acid Spray Hisuian Goodra, and Icy Wind Primarina while still dealing with other common threats like Ogerpon-W.</li> <li>Malignant Chain is capable of threatening Grass- and Fairy-type Pokémon like Ogerpon-W, Whimsicott, and Sylveon, with the 50% chance to badly poison the target being able to work on all sorts of Pokemon when combined with Poison Puppeteer's confusion.</li> <li>Curse helps Pecharunt beat Hisuian Goodra, the common Registeel, and Substitute users like Ogerpon-W.</li> <li>Parting Shot helps Pecharunt deal with special attackers like the previously mentioned Hisuian Goodra, Sylveon, and Primarina without fearing Encore from the last one while also helping it against physical attackers like Iron Hands.</li> <li>Recover is an important tool that helps Pecharunt do everything that was previously mentioned with great consistency.</li> <li>Pecharunt's Speed EVs outspeed Modest Primarina, while the HP and Special Defense EVs help against Choice Scarf Regidrago.</li> <li>Pecharunt is mostly found in teams that value its stalling prowess and important Poison typing, which helps it deal with Fairy-type Pokemon, so it's usually paired with offensive Pokemon like Hoopa-U and Primarina.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 316445, "username": "lost heros"}, {"user_id": 563650, "username": "bern"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 520168, "username": "Murm"}, {"user_id": 316445, "username": "lost heros"}]}, {"name": "Quality checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 563650, "username": "bern"}, {"user_id": 520168, "username": "Murm"}, {"user_id": 316445, "username": "lost heros"}, {"user_id": 579035, "username": "glitched"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  }
}