{
  "Arcanine-Hisui": {"sets": {"Altarianite Revenge Killer": {}, "Pinsirite Revenge Killer": {}}},
  "Dragonite": {"sets": {"Altarianite Dragon Dance": {}, "Aerilate Dragon Dance": {}}},
  "Slowking-Galar": {"sets": {"Special Wall": {}}},
  "Ho-Oh": {"sets": {"Defensive": {}}},
  "Hippowdon": {"sets": {"Specially Defensive": {}}},
  "Arceus": {"sets": {"Extreme Killer": {}}},
  "Arceus-Fairy": {"sets": {"Calm Mind": {}}},
  "Arceus-Ghost": {"sets": {"Calm Mind": {}}},
  "Arceus-Ground": {
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Ground boasts amazing defensive capabilities, effectively checking wallbreakers such as Great Tusk and Raging Bolt, while also maintaining a formidable offensive presence. Ice Beam offers a valuable coverage option that deals significant damage to opposing Arceus-Ground, Great Tusk, and Dragonite. Alternatively, Power Gem can be employed to counter foes like Ho-Oh, which would otherwise force Arceus-Ground to switch out. Gravity may also be used to enable Arceus-Ground to neutralize common Latiasite users, such as Magearna, Garganacl, and Pecharunt, as well as Flying-types like Ho-Oh and Corviknight, rendering them vulnerable to Judgment. Calm Mind amplifies Arceus-Ground's potential as a setup sweeper, whereas Will-O-Wisp enhances its defensive utility by crippling physical attackers. It can also be employed as a Stealth Rock user, as most Sablenite foes such as Magearna, Garganacl, and Pecharunt find it really difficult to switch into. The Speed EVs allow Arceus-Ground to outspeed Hearthflame Mask Great Tusk. Arceus-Ground's versatility as both an offensive and defensive Pokemon makes it an excellent addition to all team archetypes. Pairing it with other defensive partners like Magearna, Corviknight, and Pecharunt creates a robust defensive core, allowing them to check each other's weaknesses, such as the former two being able to check Ice-types like Weavile and Baxcalibur, while Arceus-Ground switches into Fire-type foes. Arceus-Ground struggles to counter Water-type Pokemon such as Arceus-Water and Urshifu-R, making Pokemon like Raging Bolt, Eternatus, and Regieleki valuable partners, with the latter also providing entry hazard removal support.</p>"
      },
      "Calm Mind": {},
      "Dragon Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 641598, "username": "Solosis"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 545372, "username": "Clas"}, {"user_id": 558636, "username": "zastra"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Water": {"sets": {"Defensive": {}}},
  "Samurott-Hisui": {"sets": {"Offensive Spiker": {}}},
  "Mandibuzz": {"sets": {"Specially Defensive": {}, "Gyaradosite Utility": {}}},
  "Lunala": {"sets": {"Power Herb": {}, "Physically Defensive": {}}},
  "Magearna": {"sets": {"Utility": {}, "Physical Setup": {}}},
  "Corviknight": {"sets": {"Defensive": {}, "Bulky Setup": {}}},
  "Eternatus": {"sets": {"Physical Wall": {}, "Life Orb": {}, "Meteor Beam": {}}},
  "Urshifu-Rapid-Strike": {"sets": {"Metagrossite Wallbreaker": {}, "Aerodactylite Wallbreaker": {}}},
  "Regieleki": {"sets": {"-ate Speed": {}, "Dual Screens": {}}},
  "Spectrier": {"sets": {"Offensive Setup": {}}},
  "Garganacl": {"sets": {"Specially Defensive": {}, "Physically Defensive": {}}},
  "Ceruledge": {"sets": {"Swords Dance": {}}},
  "Kilowattrel": {"sets": {"Blue Orb": {}, "Offensive Pivot": {}}},
  "Great Tusk": {"sets": {"Pinsirite": {}, "Stealth Rock": {}, "Wallbreaker": {}}},
  "Sandy Shocks": {"sets": {"Offensive Pivot": {}, "Glalitite": {}}},
  "Baxcalibur": {"sets": {"Heracronite": {}}},
  "Raging Bolt": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Raging Bolt stands out as one of the premier special wallbreakers in the tier, boasting exceptional offensive stats and a formidable STAB combination. Lucarionite further amplifies its breaking power by granting it Adaptability and substantial stat boosts, whereas Diancite can be used to significantly raise its Speed stat, albeit at the cost of some firepower, and thus is only preferred when another better teammate has Lucarionite equipped, like Ceruledge or Kingambit. Timid nature helps Diancite Raging Bolt outspeed Great Tusk, Arceus formes, and Eternatus; a Modest nature allows Lucarionite Raging Bolt to reach feats like OHKOing offensive Arceus-Ground after minimal entry hazard chip damage. Raging Bolt utilizes Draco Meteor for its immense firepower and hit-and-run potential with Volt Switch. Thunderbolt and Discharge provide options for either dealing more damage or fishing for paralysis, respectively. Additionally, Thunderclap allows Raging Bolt to reverse kill Pokemon such as Urshifu-R and Basculegion formes, and Volt Switch enables it go function as a strong pivot. Raging Bolt may also utilize moves such as Calm Mind and Substitute to serve as a devastating progress maker at the cost of Volt Switch's utility or Thunderclap's priority. It synergizes exceptionally well with pivots like Urshifu-R, Magearna, and Pecharunt to form incredible VoltTurn cores; Urshifu-R and the Latiasite versions of the latter two also deal with Ground-types such as Arceus-Ground and Great Tusk, with the former being able to check Blissey as well. Offensive partners such as Spectrier, Calm Mind Arceus formes, and Zamazenta also aid in dismantling opposing defensive cores and thus synergize well with Raging Bolt. Pairing Raging Bolt with hazard setters such as Hearthflame Mask Great Tusk and Magearna helps it secure KOs more efficiently, especially against foes such as Arceus formes. It faces troubles against Pixilate Extreme Speed users such as Dragonite and Regieleki; thus, it is usually paired with Pokemon such as Pecharunt and Arceus-Ground to deal with them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641598, "username": "Solosis"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 545372, "username": "Clas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}]}]}
  },
  "Iron Boulder": {"sets": {"Pinsirite": {}, "Wallbreaker": {}}},
  "Pecharunt": {
    "sets": {
      "Physically Defensive": {},
      "Gyaradosite": {
        "description": "<p>Pecharunt, bolstered by its impressive Defense stats and Dark typing thanks of Gyaradosite, emerges as an amazing physical wall in the metagame, and it is arguably the best check to formidable physical attackers like Ceruledge. Mold Breaker further enhances Pecharunt's utility, granting it the capability to use Toxic against defensive Sablenite users, such as Garganacl and Milotic, and Parting Shot against Magic Bounce users. Malignant Chain can be used in place of Toxic to inflict decent damage to specific targets, including Altarianite Dragonite and Hisuian Arcanine, while also being able to poison common Taunt users such as Arceus and non-Substitute Arceus-Ghost, although the reduced chance of poisoning and the limited PP may render this choice suboptimal. Foul Play enables Pecharunt to deal significant damage to foes like Ceruledge and Lunala, while Parting Shot amplifies its utility as a pivot. Gyaradosite Pecharunt is a valuable addition to balance and bulky offense teams, forming an immaculate core with specially defensive Latiasite Magearna, as they cover each other's checks excluding Hearthflame Mask Great Tusk; Pecharunt is able to deal with Ceruledge, while Magearna provides a Ground immunity with Levitate as well as the ability to set up Spikes and establishes a formidable pivot core. Arceus formes such as Arceus-Ground also solidify the defensive backbone as well as provide an offensive presence to the team with Calm Mind. Entry Hazards can compromise Pecharunt's efficacy as a wall and may force it to use Recover more often, necessitating hazard removers in the team like Regieleki and Great Tusk. Pecharunt can be paired with offensive teammates such as Ceruledge, Raging Bolt, and Urshifu-R as it can easily provide them a safe switch.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641598, "username": "Solosis"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 545372, "username": "Clas"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  }
}