{
  "Ivysaur": {"sets": {"Defensive": {}, "Offensive": {}}},
  "Wartortle": {"sets": {"Shell Smash": {}, "Defensive": {}}},
  "Pikachu": {"sets": {"Special Attacker": {}}},
  "Clefairy": {"sets": {"Defensive": {}}},
  "Gloom": {"sets": {"Defensive Utility": {}}},
  "Weepinbell": {"sets": {"Utility": {}}},
  "Grimer-Alola": {"sets": {"Defensive": {}}},
  "Koffing": {"sets": {"Defensive": {}}},
  "Seadra": {"sets": {"RestTalk Pivot": {}}},
  "Dragonair": {"sets": {"Dragon Dance": {}}},
  "Murkrow": {"sets": {"Nasty Plot": {}}},
  "Misdreavus": {"sets": {"Utility": {}}},
  "Girafarig": {"sets": {"Nasty Plot": {}, "Choice Item": {}}},
  "Dunsparce": {"sets": {"Calm Mind": {}, "Utility": {}, "Coil": {}}},
  "Piloswine": {
    "overview": "<p>With its impressive stats, versatile movepool, good typing, and notable ability, Piloswine cements itself as one of the premier staples of the metagame. All these traits allow it to function as an excellent wallbreaker, entry hazard setter, revenge killer, and Thunder Wave absorber. As a hazard setter, being unsusceptible to Taunt owing to its ability is a major plus point. While Eviolite provides bulk and flexibility, Choice Band enables Piloswine to capitalize on its unresisted STAB combination to dismantle opposing teams. However, despite its strength and bulk, it lacks longevity due to the absence of non-Rest recovery moves and faces competition from other Stealth Rock setters like Tinkatuff and Dunsparce, which have relatively better longevity, better matchup against the tier's premier hazard removal option in Quaxwell, and greater overall utility.</p>",
    "comments": "<h3>Other Options</h3> <p>Trailblaze over Ice Shard or Stealth Rock with more Speed EVs is an option for Piloswine. For instance, it outspeeds Frogadier at +2 with 104 Speed EVs. Trailblaze transforms Piloswine into a good late-game cleaner, potentially bypassing checks like Thwackey at low HP and finishing off foes like Misdreavus. This alternative also helps it in winning mirror matchups. However, if you drop Stealth Rock, it's advisable to run another setter like Tinkatuff, or if you drop Ice Shard, consider other revenge killers like Thwackey and Choice Scarf Frogadier. Similarly, Curse is an option over Stealth Rock, making Piloswine a dangerous late-game cleaner and enabling it to beat its former checks such as Thwackey and Raboot.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Quaxwell can switch into any move from Piloswine and use Rapid Spin to remove Stealth Rock. It can do so multiple times thanks to Roost and threatens Piloswine out with its STAB moves. Other Water-types like Wartortle and Frogadier can check Piloswine with their STAB attacks too. Wartortle also has Rapid Spin to remove Stealth Rock and is bulky enough to switch into Piloswine once or twice; Frogadier is relatively frailer but stronger.</p> <p><strong>Misdreavus</strong>: Misdreavus is immune to Piloswine's Ground-type moves, can take its Ice-type moves thanks to its bulk, and has Pain Split for longevity. Will-O-Wisp renders Piloswine ineffective.</p> <p><strong>Wallbreakers and Revenge Killers</strong>: Thwackey can check Piloswine, but it usually needs support to get Piloswine weakened to Grassy Glide range, generally with Knock Off, strong super effective moves, or pivoting moves, as it would rather not risk Wood Hammer. Raboot, Monferno, and Pignite heavily damage Piloswine with their Fighting-type moves. Pokemon such as Choice Specs Girafarig, Servine, and Pawniard do a decent job in picking Piloswine off.</p> <p><strong>Normal-types</strong>: Dunsparce and Vigoroth are physically bulky enough to easily take all of Piloswine's STAB moves. Dunsparce cripples Piloswine with Toxic, while Vigoroth can turn Piloswine into setup fodder or use its utility and STAB moves to hinder Piloswine.</p>",
    "sets": {
      "Offensive Stealth Rock": {
        "description": "<p>Piloswine's strong matchups against the tier's other dominant entry hazard setters, such as Tinkatuff and Koffing, and the tier's premier Defogger, Vullaby, allow it to excel as a highly effective Stealth Rock setter. As a wallbreaker, its unresisted STAB combination is extremely threatening to unprepared teams and those that have been weakened by Knock Off, hazards, or other residual damage. High Horsepower allows Piloswine to work effectively even in Grassy Terrain, but Earthquake is also a viable alternative due to its extra power and accuracy. Ice Shard allows Piloswine to pick off weakened threats like Girafarig and Fraxure.</p> <p>Piloswine is a strong fit for most archetypes, and it's especially effective on bulky offense and balance teams. Misdreavus is a stellar teammate for Piloswine; its spinblocking ability, which allows it to handle Quaxwell, complements Piloswine's Stealth Rock setting perfectly. In addition, Misdreavus can spread status to support Piloswine's wallbreaking or work in tandem with it to dismantle the opposing team through setup and cleaning. Frogadier is also a superb partner, forming an entry hazard-stacking core with Piloswine; moreover, it provides pivoting support to Piloswine, creating valuable entry opportunities. In a similar vein, Koffing sets Toxic Spikes to maximize hazard pressure; it also acts as a great switch-in to many foes that Piloswine is weak to, handling Grass-types like Thwackey and Servine and absorbing Fighting-type moves from threats like Raboot, Monferno, and Pignite. In general, wallbreakers and cleaners appreciate Piloswine's Stealth Rock support and offensive pressure; Thwackey, Girafarig, Fraxure, and Raboot synergize extremely well with Piloswine, working hand in hand with it to dismantle defensive cores, which may include Pokemon like Dunsparce, Ivysaur, Quaxwell, and Koffing. Thwackey, in particular, is an excellent teammate for Piloswine, dealing with pesky Water-types that check Piloswine, namely Quaxwell, Wartortle, and Frogadier. Thwackey also offers invaluable Knock Off, pivoting, and passive recovery support, bolstering Piloswine's wallbreaking prowess and longevity. In return, Piloswine deals with foes that can prove to be problematic for Thwackey, such as Koffing, Vullaby, and Tinkatuff. Piloswine appreciates Knock Off support a ton; thus, Knock Off users such as Monferno, Pignite, and Vigoroth make amazing teammates, pairing nicely with Piloswine and amplifying its offensive pressure, even allowing it to reach thresholds like 2HKOing maximum Defense Quaxwell that has lost its Eviolite with minimum chip damage. Piloswine is vulnerable to Misdreavus, particularly Will-O-Wisp variants, so Normal-types such as Dunsparce as well as the aforementioned Vigoroth, Monferno, and Pignite are exemplary partners. Defensively, Quaxwell is a remarkable teammate, providing Rapid Spin support to ensure Piloswine's side of the field is free of hazards, thus maximizing hazard pressure on the opposing team. Quaxwell also acts as a switch-in to multiple Pokemon that Piloswine can struggle against, especially if it's chipped or if its Eviolite has been removed by Knock Off, such as Frogadier, Pignite, Monferno, and Raboot; in exchange, Piloswine can deal with foes that Quaxwell is weak to, like Drakloak, Fraxure, and Girafarig. Wartortle is also a good teammate in this regard, though it has less longevity, which is a fair trade for the added offensive pressure. Ivysaur defensively takes care of Grass- and Water-types like Thwackey and Quaxwell for Piloswine, while Piloswine takes care of threats like Girafarig and Tinkatuff.</p>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 558636, "username": "zastra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Stantler": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Calm Mind": {}}},
  "Marshtomp": {"sets": {"Offensive Stealth Rock": {}, "Defensive": {}}},
  "Vigoroth": {"sets": {"Bulk Up": {}}},
  "Meditite": {"sets": {"Wallbreaker": {}, "Choice Scarf": {}}},
  "Dusclops": {"sets": {"Defensive": {}}},
  "Grotle": {"sets": {"Shell Smash": {}}},
  "Monferno": {"sets": {"Swords Dance": {}, "All-Out Attacker": {}, "Nasty Plot": {}}},
  "Prinplup": {"sets": {"Defensive Pivot": {}}},
  "Gabite": {
    "overview": "<p>Gabite uses its powerful Dragon and Ground typing in conjunction with Swords Dance to become a potentially devastating setup sweeper in the NFE metagame. Sitting at a comfortable speed tier ahead of other offensive threats like Monferno and Thwackey, Gabite is a solid choice for teams that need a powerful wallbreaker and setup option. On top of this, Gabite can establish Stealth Rock for its team and use its Ground typing to absorb paralysis attempts from the likes of Hattrem and Tinkatuff. While these traits are quite tantalizing, Gabite does suffer from having poor matchups into other NFE staples like Misdreavus, which can threaten to burn Gabite with Will-O-Wisp, and Piloswine, which can revenge kill Gabite with Ice Shard after minor chip damage.</p>",
    "comments": "<h3>Other Options</h3> <p>Scale Shot can be used to provide a Speed boost, helping outpace Frogadier, Girafarig, and Misdreavus, though it does mean Gabite is much less threatening offensively, as it relies on the multi-hit nature of the move. Similarly, Gabite can opt for a fully offensive set, using a Choice Scarf to outspeed the aforementioned Pokemon without needing to rely on Scale Shot and coverage moves like Iron Head to hit Fairy-types harder, like Clefairy.</p> <h3>Checks and Counters</h3> <p><strong>Faster Wallbreakers</strong>: Gabite is slower than notable revenge killers like Drakloak and Frogadier, both of which can threaten an OHKO with Draco Meteor and Ice Beam, respectively.</p> <p><strong>Piloswine</strong>: Piloswine's Ice Shard threatens an OHKO after Gabite takes minor chip damage.</p> <p><strong>Defensive Misdreavus</strong>: Misdreavus can outpace Gabite with ease, thus threatening a Will-O-Wisp to neutralize Gabite offensively.</p> <p><strong>Dunsparce</strong>: Dunsparce is quite difficult for Gabite to break through and can use Ice Beam to threaten an OHKO.</p> <p><strong>Wartortle</strong>: Wartortle can be problematic for Gabite, as it can use the threat of Ice Beam to get a free Shell Smash opportunity.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Gabite is a solid choice as an offensive setup option that also offers excellent utility in Stealth Rock and its Ground typing, which helps against notable entry hazard setters like Koffing and Tinkatuff. Substitute can be used to block status attempts from slower foes like Body Slam Dunsparce and Will-O-Wisp Koffing, allowing Gabite to use Swords Dance more freely; alternatively, Gabite can use Stealth Rock to free up a moveslot for teammates like Dunsparce and Tinkatuff. The given EV spread maximizes its damage output, with Adamant granting more immediate wallbreaking power at the expense of being slower than Monferno and Thwackey.</p> <p>Gabite is a fine addition to many team structures, notably finding a role on balance and bulky offense teams as an offensive setup sweeper and wallbreaker. While Gabite can use its Ground typing to find setup opportunities against common foes like Koffing, Monferno, and Tinkatuff, it struggles with capitalizing on its boosts with the abundance of threats that can OHKO it, like Drakloak, Frogadier, and Piloswine. Teammates like Tinkatuff can help handle these threats by providing Knock Off support while sponging attacks from Drakloak and Frogadier. Quaxwell can also help handle them by providing slow pivots with Flip Turn, entry hazard removal with Rapid Spin, and it can take hits from Frogadier. Misdreavus makes an excellent partner too, as it can threaten Will-O-Wisp on Piloswine to limit the damage output of Ice Shard while acting as a spinblocker against opposing Quaxwell. Ivysaur, Monferno, and Pignite are fine teammates for Gabite as well, offering Knock Off support to help remove Eviolite from physical walls, like opposing Ivysaur and Vullaby, to make wallbreaking easier for Gabite. Paralysis spreaders like Dunsparce, Misdreavus, and Tinkatuff can enable Gabite offensively, allowing it to use Substitute to set up against paralyzed foes a bit more safely. Frogadier, as a partner to Stealth Rock Gabite, can create powerful hazard-stacking cores with Misdreavus as the spinblocker. Girafarig and Vigoroth are great teammates to help Gabite get through Misdreavus, with Girafarig providing a special wallbreaker to go with Gabite's physical wallbreaking. Raboot can help Gabite set up by providing safe entry points against common switch-ins like Koffing.</p>"
      },
      "Choice Scarf": {},
      "Defensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 558636, "username": "zastra"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Hippopotas": {"sets": {"Defensive Stealth Rock": {}}},
  "Servine": {"sets": {"Offensive Contrary": {}, "Bulky Contrary": {}}},
  "Pignite": {"sets": {"All-Out Attacker": {}}},
  "Dewott": {"sets": {"Swords Dance": {}, "Special Pivot": {}}},
  "Krokorok": {"sets": {"Offensive Stealth Rock": {}, "Choice Item": {}}},
  "Scraggy": {"sets": {"Bulk Up": {}, "Dragon Dance": {}}},
  "Duosion": {"sets": {"Double Dance": {}, "Defensive Pivot": {}}},
  "Eelektrik": {"sets": {"Defensive Pivot": {}}},
  "Lampent": {"sets": {"Choice Item": {}, "Calm Mind": {}}},
  "Fraxure": {"sets": {"Setup Sweeper": {}, "Choice Band": {}}},
  "Mienfoo": {"sets": {"Offensive Pivot": {}}},
  "Pawniard": {"sets": {"Swords Dance": {}, "Stealth Rock": {}}},
  "Rufflet": {"sets": {"Choice Band": {}, "Choice Scarf": {}, "Bulk Up": {}}},
  "Vullaby": {"sets": {"Defensive Utility": {}}},
  "Zweilous": {"sets": {"Wallbreaker": {}}},
  "Quilladin": {"sets": {"Spikes": {}, "Bulk Up": {}}},
  "Braixen": {"sets": {"Calm Mind": {}}},
  "Frogadier": {"sets": {"Offensive Pivot": {}, "Choice Specs": {}, "Choice Scarf": {}}},
  "Fletchinder": {"sets": {"Utility": {}, "Swords Dance": {}}},
  "Sliggoo-Hisui": {"sets": {"Choice Specs": {}, "Acid Spray": {}}},
  "Dartrix": {"sets": {"Physically Defensive": {}, "Swords Dance": {}}},
  "Charjabug": {"sets": {"Sticky Web": {}}},
  "Cutiefly": {"sets": {"Sticky Web Lead": {}}},
  "Mareanie": {"sets": {"Utility": {}}},
  "Hakamo-o": {"sets": {"Double Dance": {}, "Defensive": {}}},
  "Thwackey": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Raboot": {"sets": {"Offensive Pivot": {}, "Swords Dance Sweeper": {}}},
  "Carkol": {"sets": {"Physically Defensive": {}}},
  "Hattrem": {"sets": {"Physically Defensive": {}, "Fast Utility": {}}},
  "Morgrem": {"sets": {"Dual Screens": {}, "Choice Specs": {}}},
  "Drakloak": {"sets": {"RestTalk": {}, "Choice Specs": {}}},
  "Crocalor": {"sets": {"Physically Defensive": {}, "Specially Defensive": {}}},
  "Quaxwell": {"sets": {"Defensive": {}}},
  "Naclstack": {"sets": {"Stealth Rock": {}, "Iron Defense": {}}},
  "Toedscool": {"sets": {"Utility": {}}},
  "Tinkatuff": {"sets": {"Defensive Utility": {}, "Offensive Utility": {}}},
  "Varoom": {"sets": {"Defensive Pivot": {}}},
  "Glimmet": {"sets": {"Hazard Lead": {}, "Physically Defensive": {}}},
  "Arctibax": {"sets": {"Swords Dance": {}}}
}