{
  "Arcanine-Hisui": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Hisuian Arcanine is a strong wallbreaker, capable of denting many physically defensive Pokemon such as Scream Tail while taking advantage of Magic Guard by using Head Smash and Flare Blitz in combination with Life Orb without any drawbacks. Close Combat allows Hisuian Arcanine to hit Ting-Lu and Well-Baked Body Iron Treads, while Will-O-Wisp threatens burns on checks like physically defensive Quaquaval and Garchomp. Extreme Speed is useful priority that picks off weakened targets, Stealth Rock allows Hisuian Arcanine to act as an offensive entry hazard setter that pressures Corviknight and Iron Treads, and Flame Charge boosts its Speed to thwart potential revenge killers. As Hisuian Arcanine places a lot of pressure on physical walls, other physical cleaners like Meowscarada and Chien-Pao can be partnered with Hisuian Arcanine to clean up after it has broken those walls while providing speed control. Since Hisuian Arcanine is checked by Garchomp and bulky Water-types like Quaquaval, Refrigerate Regieleki makes a good partner for it by forcing these Pokemon out, pivoting Hisuian Arcanine in, and helping to deal with faster threats through its raw Speed. Hisuian Arcanine's middling Speed makes slow pivots like Corviknight good partners due to their ability to bring it in safely; alternatively, Corviknight's dual screens set allows Arcanine to take a hit and strike back.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Muk-Alola": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>With a great defensive typing, solid special bulk, and Knock Off, Alolan Muk is a great RegenVest user, repeatedly entering the battle and disrupting fierce special attackers like Iron Moth and Zapdos. Knock Off provides critical utility and disruption, deters potential answers from switching into it, and provides decent uninvested damage output against neutral targets. Poison Fang semi-reliably spreads Toxic poison onto opposing walls, while Poison Jab can 2HKO Enamorus-T and Meowscarada. Rock Slide hits Zapdos, Volcanion, Talonflame, and Volcarona hard, punishing them for switching in. Ice Punch nails common switch-ins like Landorus-T and Garchomp, while Thunderbolt snipes Corviknight. Physical walls like Corviknight, Unaware Scream Tail, and Quaquaval are a natural pairing, as they can better deal with the physical attackers that threaten Alolan Muk like Garchomp, Chien-Pao, and Galarian Zapdos. Mixed attackers like Magic Guard Volcanion and Heatran threaten Alolan Muk out, so offensive answers to these like Sword of Ruin Garchomp, Chien-Pao, and Galarian Zapdos are recommended. Entry hazards wear down Alolan Muk over the course of the game and prevent it from properly dealing with repeated attacks from threats like Iron Moth and Iron Jugulis, so hazard removers like Iron Treads, Quaquaval, and Corviknight are all recommended teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Cloyster": {"outdated": true, "sets": {"Technician": {}}},
  "Gengar": {
    "outdated": true,
    "sets": {
      "Sheer Force": {
        "description": "<p>Gengar is a powerful offensive threat thanks to its high Special Attack, good Speed, and great coverage. Focus Blast provides perfect coverage with Shadow Ball and threatens RegenVest Roaring Moon and Hisuian Goodra. Nasty Plot makes Gengar even more threatening, as at +2, it can OHKO special walls like RegenVest Hisuian Goodra, being guaranteed to do so after a layer of Spikes, and Roaring Moon with Focus Blast, as well as OHKOing specially defensive Garchomp with Shadow Ball after two layers of Spikes. Gengar has a number of options for its last moveslot, such as Sludge Bomb—which helps against Volt Absorb Mandibuzz, as well as OHKOing Ogerpon-H and Ogerpon-W; Thunderbolt, which threatens Water- and Flying-types like Manaphy and Corviknight; and Knock Off to cripple opponents, especially RegenVest Pokemon like Manaphy and Roaring Moon that can switch into Gengar, by removing their items. Gengar still struggles against certain special walls like Unaware Blissey and RegenVest Goodra, so it pairs well with physically offensive teammates like Dragonite and Chien-Pao that can handle these Pokemon. Additionally, due to its defensive frailty, Gengar appreciates teammates like Corviknight and Hisuian Goodra that can switch in and take hits for it, as well as pivots like Meowscarda and Barraskewda that can safely bring it in on physical walls. Gengar also benefits from entry hazard setters, like Heatran and Garchomp which can chip down foes and make them easier for Gengar to OHKO.</p>"
      },
      "Hadron Engine": {
        "description": "<p>Hadron Engine Gengar uses its excellent Special Attack, good Speed, and good coverage options to function as a dangerous wallbreaker, pressuring physical and special walls alike. Hadron Engine-boosted Thunderbolt threatens an OHKO on Water- and Flying-types such as Empoleon and Mandibuzz and 2HKOes RegenVest Manaphy, while Focus Blast threatens an OHKO on Heatran and a 2HKO on Blissey, RegenVest Hisuian Goodra, and Roaring Moon. Trick can be used to cripple more defensive switch-ins such as Blissey and RegenVest users, while Sludge Bomb threatens an OHKO on Primordial Sea Zapdos and Ogerpon-C while also potentially crippling switch-ins with poison. Fast wallbreakers such as Barraskewda, Azelf, and Meowscarada appreciate Gengar's ability to pressure their walls like Kommo-o, Empoleon, and Corviknight, allowing them to clean late-game, while in return they can safely let in Gengar by pivoting out of such walls as they switch in. Azelf's Psychic Terrain blocking priority is appreciated by Gengar, as it allows it to avoid an OHKO from Dragonite's Extreme Speed and 2HKO it back with Sludge Bomb. Gengar's ability to absorb Toxic Spikes is greatly appreciated by offensive teams especially, as they can otherwise be crippled by them. Gengar is OHKOed by most Pokemon faster than it, such as Azelf, Barraskewda, and Roaring Moon, and takes takes heavy damage from most priority moves, so defensive teammates such as Corviknight, Great Tusk, and Empoleon are appreciated, with Corviknight and Great Tusk being able to remove the entry hazards that Gengar is prone to being chipped down by. Gengar also appreciates Corviknight and Empoleon being able to safely pivot it in due to their low Speed.</p>"
      },
      "Normalize": {
        "description": "<p>Normalize Gengar reliably sets Toxic Spikes, forces a bevy of switches including against slower setup sweepers, and can trap and remove opposing special walls for fast cleaners like Azelf. Skill Swap, which has the added benefit of going through Substitute, renders Gengar immune to most attacks; this either forces the foe to switch no matter how much setup it has accrued, giving Gengar a free turn, or if Gengar successfully landed Mean Look first, spells its foe's doom. Toxic Spikes forces progress even in situations where it is unable to reliably trap the opponent's special switch-in, such as against Roaring Moon, and forces Defoggers like Corviknight into a catch-22: stay in to remove Toxic Spikes and risk getting trapped, or switch out and accept that entry hazards stay up. Taunt and Trick are alternatives that allow Gengar to trap and remove targets it otherwise could not like Meloetta, Mandibuzz, and Blissey but relegate it to a trap-or-bust option. Gengar pairs exceptionally well with physical pivots that get it in on slow physical walls it can scare out; if the opponent then switches to their special wall, they risk losing it to Mean Look + Skill Swap. Fast special cleaners like Azelf appreciate both Toxic Spikes and opposing special walls being trapped and removed; Azelf also appreciates Gengar's ability to lure and trap most Dark-types. Gengar is unable to reliably trap and remove Roaring Moon, so robust checks to it like Great Tusk and Intimidate Corviknight are strongly recommended.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}, {"username": "UT", "user_id": 523866}, {"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "cat", "user_id": 580765}, {"username": "UT", "user_id": 523866}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "LordBox", "user_id": 611238}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Electrode-Hisui": {"sets": {"Magic Guard": {}}},
  "Gyarados": {"outdated": true, "sets": {"Dragon Dance": {}}},
  "Vaporeon": {"outdated": true, "sets": {"Defensive": {}}},
  "Zapdos": {
    "sets": {
      "Primordial Sea": {},
      "Defensive": {
        "outdated": true,
        "description": "<p>Zapdos serves as a valuable defensive pivot, checking many of the tier's physical wallbreakers and pivots like Dragonite, Great Tusk, and its Galarian counterpart. Discharge's nasty paralysis chance further increases the utility Zapdos provides and cripples switch-ins like Blissey and Hisuian Goodra. Heat Wave is an option over Hurricane to hit Iron Treads and Volt Absorb Corviknight while 2HKOing non-Well-Baked Body Kingambit. U-turn allows Zapdos to switch in on the aforementioned physical threats and pivot out to a wallbreaker that threatens them. Intimidate is an option to weaken hits even after Zapdos switches out and also allow it to act as a check to Fire-types like Cinderace and Ceruledge. 108 Speed EVs notably allow it to outspeed Timid Volcanion and Adamant Slither Wing. Zapdos's inability to check Ice-types like Mamoswine and Chien-Pao and tendency to get worn down quickly makes other physical walls like Corviknight and Quaquaval great partners that can additionally switch into Knock Off from the likes of Great Tusk and Roaring Moon. Wallbreakers and pivots like Ogerpon-C, Azelf, and Barraskewda appreciate Zapdos's ability to switch into revenge killers like Roaring Moon, Choice Scarf Meowscarada, and opposing Barraskewda and pivot out, generating momentum for the team. If Zapdos is using Fluffy, a sturdy Fire-type check like Quaquaval or physically defensive Garchomp, which can switch into Pokemon like Cinderace and Ceruledge, pairs well with it.</p>"
      },
      "No Guard": {
        "outdated": true,
        "description": "<p>No Guard Zapdos is a potent offensive pivot that can reliably spread status with Zap Cannon. U-turn allows Zapdos to pivot while also gaining momentum for its team and can form a VoltTurn core with pivots such as Azelf and Barraskewda, although Heat Wave can be used instead to hit Steel-types such as Iron Treads and non-Well-Baked Body Kingambit. Pivots such as Roaring Moon, Iron Moth, and Meowscarada form a strong pivoting core with Zapdos, as Zapdos baits in Hisuian Goodra and Volt Absorb Empoleon allowing for free switch-in opportunities for these allies. Physical wallbreakers such as Great Tusk and Barraskewda are notable partners for Zapdos, as Zapdos threatens out Corviknight and Kommo-o while pivoting these teammates into Zapdos's checks such as Hisuian Goodra and Heatran, putting the opponent in a unfavorable position. Slow wallbreakers such as Great Tusk and Ceruledge benefit from Zapdos using Zap Cannon to paralyze opposing Pokemon. Slow pivots such as Corviknight switch in on strong offensive threats that Zapdos is scared of such as Ogerpon-C and Chien-Pao while providing Zapdos switch-in opportunities via U-turn. Zapdos struggles against strong special walls such as Garchomp and Volt Absorb Empoleon, so Pokemon that can threaten them out such as Great Tusk make excellent partners.</p>"
      }
    }
  },
  "Zapdos-Galar": {
    "sets": {
      "Choice Band": {},
      "Magic Guard": {
        "outdated": true,
        "description": "<p>Magic Guard Galarian Zapdos serves as a strong wallbreaker with immense longevity, capable of outlasting checks like its Kantonian counterpart, Corviknight, and Scream Tail. Magic Guard allows Galarian Zapdos to switch into passive foes like Garganacl and Toxapex scot-free while allowing it to use Brave Bird and Life Orb without drawback. U-turn allows Galarian Zapdos to pivot out on switch-ins like defensive Zapdos and Corviknight, while Bulk Up allows it to set up on passive foes like Quaquaval, Mandibuzz, and Empoleon. Knock Off cripples those aforementioned checks, notably forcing Zapdos to take Stealth Rock chip every time it switches in while being Galarian Zapdos's best move against Gholdengo; however, Agility is an option, especially in conjunction with Bulk Up, that allows Galarian Zapdos to clean late-game and outspeed the entire metagame. Revenge killers like Dragonite, Azelf, and Barraskewda can force Galarian Zapdos out, making defensive pivots like Corviknight, RegenVest Manaphy, and Meloetta great partners that can switch into them Galarian Zapdos's wallbreaking ability is appreciated by other physical wallbreakers like Chien-Pao and Barraskewda, which appreciate its ability to remove their checks like Quaquaval and defensive Kommo-o. Special wallbreakers and pivots like Walking Wake, Azelf, and Sandy Shocks appreciate Galarian Zapdos's ability to threaten their checks like RegenVest Manaphy and Roaring Moon, while they threaten its checks like defensive Zapdos and Corviknight in return.</p>"
      }
    }
  },
  "Moltres": {"outdated": true, "sets": {"Magic Guard": {}, "Desolate Land": {}}},
  "Moltres-Galar": {"outdated": true, "sets": {"Double Dance": {}}},
  "Dragonite": {"sets": {"Dragon Dance": {}}},
  "Mew": {
    "outdated": true,
    "sets": {
      "Choice Scarf Regenerator": {
        "description": "<p>Choice Scarf Regenerator Mew is a strong utility pivot that checks fast physical attackers with the combination of Will-O-Wisp + Volt Switch while still pressuring defensive cores with entry hazards and Trick. Ice Beam can be used as an alternative to Spikes to pressure Pokemon like Garchomp and Landorus-T. Trick can be used to neutralize support Pokemon and defensive pivots like Corviknight while serving as an emergency stop to bulky setup sweepers like Calm Mind Enamorus-T. 136 Speed EVs with a Timid nature ensure that Mew outspeeds Chien Pao, Hisuian Electrode, and +1 Jolly Quaquaval, as well as positive natured Slither Wing and Heatran after Trick. Bulky teammates like Corviknight, Garganacl, Zapdos, and Skeledirge benefit from Mew's ability to spread burns and set hazards, allowing them to absorb more hits from physical attackers and whittle down these attackers more quickly; Mew can also pressure fast attackers like Meowscarada and Talonflame that they struggle with. Additionally, late-game cleaners like Chien-Pao, Hisuian Arcanine, and Quaquaval benefit from Mew's ability to chip defensive switch-ins and hinder walls by giving them a Choice Scarf.</p>"
      },
      "Prankster": {
        "description": "<p>Prankster Mew is a good dual screens lead for hyper offense teams thanks to its good bulk, Speed, and movepool. Taunt blocks foes such as Garchomp, Landorus-T, and Iron Treads from setting entry hazards, Corviknight from clearing screens with Defog, and opposing setup sweepers like Volcarona from taking advantage of free turns. U-turn lets it pivot into its teammates and potentially re-set screens later in the game. Stealth Rock or Spikes can be used over U-turn to chip foes for teammates to KO. 96 Speed EVs and a Jolly Nature ensure that Mew always moves first against opposing leads like Prankster Corviknight and Masquerain, allowing Mew to hinder them with Taunt. Prankster Mew should only be used as a dual screens lead on hyper offense teams. Teammates such as Chien-Pao, Polteageist, Volcarona, and Roaring Moon all appreciate screens, which allow them to easily set up and make them less susceptible to revenge killers. The aforementioned Pokemon also provide good options for Mew to pivot into and gain momentum. Dark-type Pokemon such as Ting-Lu, Meowscarada, and Chien-Pao are immune to Prankster Taunt and can take advantage of Mew, so counters to them such as Zamazenta-C and Triage users, like Enamorus-T and Ursaluna, are good teammates.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>Life Orb Mew is a very dangerous mixed wallbreaker that can decimate various walls with its colorful coverage. Ice Beam hits Ground- and Flying-types such as Garchomp, Landorus-T, and Zapdos. Gunk Shot 2HKOes Scream Tail, which otherwise switches into Mew freely. Close Combat takes care of Blissey and Steel-types such as Hisuian Goodra, Kingambit, and Heatran. Flamethrower 2HKOes non-Well-Baked Body Corviknight and Zamazenta-C, dissuading the latter from using Mew as setup fodder. A Mild nature helps Mew exert as much pressure as possible with Ice Beam and Flamethrower, while a Hasty nature most notably lets it outspeed Hydreigon and Speed tie Zapdos. Magic Guard negates chip damage from Life Orb and entry hazards, helping Mew stay healthy for longer and allowing it to better utilize its natural bulk to come into play. Sheer Force is an alternative particularly if Mew is used alongside a teammate with Magic Guard, such as Hisuian Electrode. It greatly increases Mew's power, notably letting it OHKO Garchomp and Iron Treads and pressure otherwise solid checks such as Meloetta, at the cost of its longevity. Bulky pivots such as Corviknight, Quaquaval, Iron Treads, and Meloetta can take on fast threats to Mew such as Chien-Pao, Roaring Moon, and Iron Moth and switch Mew in safely. Fast offensive pivots such as Meowscarada and Sandy Shocks are also strong partners that can give Mew opportunities to come into play and clean up late-game after it softens up their checks. Garchomp and Ting-Lu can set entry hazards to help Mew break down its checks over time.</p>"
      },
      "Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}, {"username": "Frozoid", "user_id": 532881}, {"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Adeleine", "user_id": 517429}, {"username": "Tea Guzzler", "user_id": 577920}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Typhlosion-Hisui": {
    "outdated": true,
    "sets": {
      "Desolate Land": {
        "description": "<p>Hisuian Typhlosion is a solid wallbreaker, exerting great offensive pressure with its great typing and offensive STAB move combinations. Eruption is Hisuian Typhlosion's go-to move, as Choice Specs boosts it enough to 2HKO common specially defensive walls such as Meloetta, Blissey, and Hisuian Goodra. Shadow Ball hits Fire-immune foes like Well-Baked Body Corviknight as well as Primordial Sea users like Volcanion, Zapdos, and Kilowattrel. Focus Blast notably 2HKOes RegenVest Roaring Moon and OHKOes Well-Baked Body Steel-types like Kingambit and Iron Treads. A Modest nature guarantees that Choice Specs Hisuian Typhlosion can 2HKO the previously mentioned special walls, but Timid can be used to outspeed max speed Quaquaval and Ceruledge. Choice Scarf and a Timid nature can turn Hisuian Typhlosion from a wallbreaker into a potent revenge killer that outspeeds and OHKOes other fast targets like Chien-Pao, Meowscarada, and Hisuian Electrode. Hisuian Typhlosion is very frail and struggles greatly against entry hazards, which also reduce Eruption's base power, so teammates that can clear hazards and pivot into it safely like Corviknight and Iron Treads are essential. Hisuian Typhlosion also has a mediocre Speed stat without Choice Scarf, so partners that can provide speed control like Regieleki, Chien-Pao, and Hisuian Electrode are also appreciated.</p>"
      },
      "Magic Guard": {}
    },
    "credits": {"writtenBy": [{"username": "I am BONK", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Slowking": {"outdated": true, "sets": {"Defensive Pivot": {}}},
  "Slowking-Galar": {"outdated": true, "sets": {"Specially Defensive Pivot": {}}},
  "Donphan": {"outdated": true, "sets": {"Fluffy": {}, "RegenVest": {"outdated": true, "description": "<p>Assault Vest Donphan is a solid special pivot that can check the likes of Sandy Shocks while also removing entry hazards with Rapid Spin. Knock Off cripples switch-ins and can support offensive teammates. Body Press is used as a coverage option for Earth Eater Kingambit and Iron Treads, which would otherwise wall Donphan. Offensive Pokemon susceptible to hazards such as Chien-Pao and Dragonite appreciate Donphan's spinning capabilities. Physically defensive Pokemon like Corviknight and Garganacl also pair well with Donphan, as it can handle special attackers like Sandy Shocks that threaten them. Donphan can be prone to residual damage, so it's recommended to pair it with a Wish user like Scream Tail or Florges to extend its longevity.</p>"}}},
  "Smeargle": {"sets": {"Sticky Web": {}}},
  "Blissey": {
    "outdated": true,
    "sets": {
      "Unaware": {},
      "Special Wall": {
        "outdated": true,
        "description": "<p>Magic Guard Blissey is a solid wall and utility Pokemon that can effectively shrug off most viable special attackers, but it struggles against the tier's premier physically offensive options. Although it excels at switching into special attacks, it is left with rather passive options mainly chosen to maximize the potential of its teammates. Soft-Boiled is its essential recovery option that keeps it healthy to continue absorbing damage in the future. Heal Bell, Stealth Rock, and Thunder Wave are Blissey's utility options, allowing it to act as a cleric, entry hazard setter, or status spreader, respectively, to set up its teammates for success. Finally, Shadow Ball is a niche option that prevents Blissey from being passive against Ghost-types like Skeledirge, Hisuian Typhlosion, and Ceruledge. Well-Baked Body can be used instead of Magic Guard, improving its matchup against Fire-types like Magic Guard Volcanion and Heatran, as well as completely walling Skeledirge. Teams that use Blissey should also opt to carry a physical wall like Corviknight, Quaquaval, or Fluffy Landorus-T, as their ability to absorb physical attacks is valuable for preserving it as a special wall. Blissey can offer offensive teammates the ability to thwart their revenge killers with its switching unimpeded by entry hazards and damaging status conditions.</p>"
      }
    }
  },
  "Swampert": {"sets": {"RegenVest": {}}},
  "Gardevoir": {"outdated": true, "sets": {"Tinted Lens": {}, "Prankster": {}, "Hadron Engine": {}}},
  "Masquerain": {"outdated": true, "sets": {"Sticky Web Lead": {}}},
  "Salamence": {"outdated": true, "sets": {"Aerilate": {}}},
  "Deoxys-Defense": {"sets": {"Physical Wall": {}}},
  "Deoxys-Speed": {"sets": {"Sheer Force": {}, "Choice Specs": {}, "Dual Screens": {}, "Entry Hazard Lead": {}}},
  "Empoleon": {
    "outdated": true,
    "sets": {
      "Special Wall": {
        "description": "<p>Empoleon is a fantastic special wall and bulky slow pivot thanks to its bevy of resistances and great Special Defense, giving it a plethora of switch-in opportunities. Defensive abilities enhance Empoleon's utility, with Bulletproof letting it wall Gengar and Gholdengo, Volt Absorb allowing it to switch into Zapdos and Regieleki, and Earth Eater letting it wall Garchomp, as well as Great Tusk lacking Close Combat. Flip Turn allows Empoleon to take a hit and pivot out, Stealth Rock lets it rack up passive damage, and Knock Off allows it to hinder switch-ins such as Manaphy and Kommo-o. Ice Beam is an option over Surf, giving Empoleon a super effective move against Dragonite, Kommo-o, and Garchomp, while Earthquake can threaten Iron Moth and Heatran. 0 Speed IVs let Empoleon pivot out as slow as possible, maximizing its defensive utility. Empoleon has average physical bulk, so it appreciates physically defensive teammates like Corviknight, Zapdos, and Kommo-o that can take on physical foes like Great Tusk, Galarian Zapdos, and Ogerpon-H that otherwise threaten it, while Empoleon takes on special attackers like Gholdengo, Azelf, and Manaphy. Offensive teammates such as Walking Wake, Gengar, and Ogerpon-C all appreciate Empoleon's slow pivoting to bring them onto the field safely, giving them a natural synergy with Empoleon, which is relatively passive on its own. Empoleon is vulnerable to being overwhelmed by special attackers like Sandy Shocks and, depending on its ability, Gengar, Zapdos, and Landorus, so a secondary special wall like Blissey, Garchomp, or RegenVest Manaphy can make a good teammate.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Kinetic", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Gastrodon": {"outdated": true, "sets": {"Fluffy": {}}},
  "Mismagius": {"outdated": true, "sets": {"Normalize": {}, "Triage": {}}},
  "Garchomp": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<p>With solid defensive stats, a great defensive typing, and powerful phazing in Dragon Tail, Garchomp is a choice entry hazard setter and special wall, capable of switching into and pivoting around powerful attackers like Iron Moth, Zapdos, Sandy Shocks, and Gengar. Stealth Rock is an option over Spikes if a teammate like Ogerpon-H or Sandy Shocks is already running the latter move. Swords Dance can turn Garchomp into a potential wallbreaking threat, notably OHKOing unboosted Zamazenta-C and threatening a 2HKO on defensive Kommo-o and RegenVest Manaphy at +2, while Fire Blast chips Corviknight and Earth Eater Gholdengo. A Sassy Nature is preferred if running Fire Blast, sacrificing Speed to avoid a cut to Special Attack. Regenerator allows Garchomp to come in repeatedly over the course of a game. Strong attackers like Tail Glow Manaphy, Dragonite, and Zamazenta-C appreciate the entry hazards set by Garchomp softening up foes to be more vulnerable to their powerful attacks while also appreciating the defensive backbone Garchomp provides. Corviknight is an ideal partner for Garchomp, handling monstrous physical threats like Chien-Pao and Roaring Moon, while Garchomp handles special attackers like Iron Moth, Zapdos, and Heatran in return. Garchomp is vulnerable to being overwhelmed by foes such as Walking Wake, Manaphy, and Hisuian Electrode, especially without Regenerator, so Pokemon that can handle these powerful special attackers like Blissey, Empoleon, and Hisuian Goodra make great teammates.</p>"
      },
      "Mixed Attacker": {
        "description": "<p>Mixed Attacker Garchomp is a reliable entry hazard setter that packs enough power and Speed to consistently deter common hazard removal options like Corviknight and Great Tusk from safely switching in. Draco Meteor is the STAB move of choice, surprising offensive Great Tusk with a 2HKO, while Fire Blast 2HKOes Corviknight. Download is a niche option over Regenerator, letting it secure a 2HKO on Mandibuzz and offensive Manaphy with Draco Meteor while also freeing your Regenerator slot for a teammate like Kommo-o or Great Tusk, but it comes at the cost of cutting into Garchomp's longevity. Life Orb notably guarantees the 2HKO on specially defensive Garchomp with Draco Meteor. Offensive threats like Manaphy, Azelf, and Iron Moth appreciate Garchomp for its entry hazards and ability to threaten common defensive foes, chipping them down to be picked off later in the game. Defensive pivots such as Corviknight, Zapdos, and RegenVest Manaphy appreciate Garchomp outspeeding and threatening powerful offensive threats such as Great Tusk, Ceruledge, and Sandy Shocks, while Garchomp appreciates these defensive partners handling the faster attackers like Azelf and Chien-Pao that force Garchomp out. Garchomp is worn down very easily by hazards and appreciates Rapid Spin users like Great Tusk and Quaquaval and Wish support from Scream Tail, allowing it to come in repeatedly over the course of the game while greatly improving its longevity, especially if running Download. Garchomp also struggles to break through common defensive foes like Scream Tail and Earth Eater Empoleon, so it appreciates teammates such as Gengar and Zamazenta-C, which can break down these walls.</p>"
      },
      "Physically Defensive": {
        "description": "<p>Garchomp is an excellent entry hazard setter that checks many of the tier's Fire-types like Cinderace, Talonflame, and Ogerpon-H lacking Play Rough. Stealth Rock is an option over Spikes if a teammate like Ogerpon-H is carrying the move. Swords Dance allows Garchomp to threaten hazard removers like Quaquaval and act as a potential wincon late-game, while Dragon Tail forces switches, racking up entry hazard chip damage and preventing setup, and Liquidation hits both Landorus formes and Levitate Iron Treads and chips Corviknight. Regenerator allows it to switch in more times throughout a game to find opportunities to set up entry hazards or Swords Dance, while Well-Baked Body punishes Fire-types like Cinderace and Ceruledge for clicking their strong STAB moves and increases its walling capabilities. Garchomp's inability to check threats like Chien-Pao and Galarian Zapdos facilitates another physical wall like Corviknight or Zapdos, which can switch into them and pivot out. Garchomp's inability to check special threats like Azelf, Gengar, and Walking Wake makes special walls like RegenVest Manaphy and Goodra great partners if Garchomp is not using Regenerator; if Garchomp is using Regenerator, Blissey and Empoleon are alternative options as special walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Kinetic", "user_id": 552227}, {"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Lucario": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Lucario is a devastating mixed wallbreaker, capable of tearing apart most defensive cores with ease thanks to its strong STAB moves and great mixed attacking stats. Close Combat and Steel Beam have excellent neutral coverage together and hit common walls like Hisuian Goodra and Scream Tail on their weaker defensive stat. Focus Blast 2HKOes standard Corviknight, while Aura Sphere provides a more consistent special attack. In the final moveslot, Nasty Plot allows Lucario to overwhelm slower teams, while Stone Edge provides coverage for Skeledirge and Zapdos. Bullet Punch is also an option that can turn the tables on would-be revenge killers such as Chien-Pao and Meowscarada after some chip damage. Naive is the recommended nature due to its ability to always outspeed Quaquaval and at worst Speed tie with Hisuian Arcanine. Lucario is best used as a mid-game wallbreaker that can pave the way for sweepers like Zamazenta-C and Hisuian Electrode by breaking through Pokemon like Corviknight and Garchomp. Lucario also heavily benefits from slow pivots like Meloetta, Corviknight, and Landorus-T; in return, they switch into Pokemon that threaten Lucario out, like Zapdos, Iron Treads, and Cinderace. While Lucario has limited switch-ins, the ones it does have, like Toxapex and Skeledirge, are very effective without using niche coverage options, so partners that can threaten them, like Zapdos and Quaquaval, are recommended; they can also bring Lucario in on their checks, like Goodra and Corviknight, with U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Hippowdon": {"outdated": true, "sets": {"Defensive": {}, "Fluffy": {"outdated": true, "description": "<p>Fluffy Hippowdon is a remarkable physical wall thanks to its defensive stats, reliable recovery in Slack Off, and pure Ground typing, letting it check offensive threats like Ceruledge, Kingambit, and Slither Wing. Whirlwind prevents foes like Talonflame from setting up. Rocky Helmet punishes the physical attackers it checks and lets it pseudo-spinblock Cyclizar and Iron Treads; alternatively, Leftovers gives it extra recovery without having to waste Slack Off PP. 25 Speed IVs let it underspeed Corviknight, allowing it to punish its Roost with Earthquake. Specially defensive walls like Corviknight, Florges, and Blissey can compensate for Hippowdon's poor Special Defense and check foes like Chi-Yu and Greninja. In return, they appreciate Hippowdon dealing with Ceruledge, Kingambit, and Slither Wing.</p>"}}},
  "Rotom-Wash": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<p>Rotom-W can act as a good offensive pivot and revenge killer with Choice Scarf or as a wallbreaker with Choice Specs, as its formidable typing allows it to threaten a plethora of Pokemon including Ground-types such as Iron Treads, Landorus-T, and Garchomp with its Water-type moves while dealing with Desolate Land users such as Heatran, Skeledirge, and Ceruledge with its Electric-type moves. Hadron Engine boosts Rotom-W's Special Attack and Electric-type moves, while Primordial Sea provides an immunity to Fire-type moves and makes Thunder perfectly accurate. Will-O-Wisp and Trick provide good utility and cripple switch-ins such as Garchomp and Hisuian Goodra for teammates by burning them or removing their Assault Vest. However, Rotom-W can get worn out quickly due to entry hazards, so hazard removal options such as Iron Treads and Corviknight are good teammates. These two also provide slow pivoting support to Rotom-W. Similarly, hazard setters such as Garchomp, Ting-Lu, and Clodsire are good teammates, as Rotom-W can take advantage of chipped foes such as Garchomp and RegenVest users such as Meloetta, Goodra, and Hisuian Goodra. Rotom-W struggles a lot against specially defensive walls such as Goodra, Meloetta, and Hisuian Goodra, so threats to them in physical attackers such as Chien-Pao, Slither Wing, and Galarian Zapdos are good teammates, with the latter two also forming a good VoltTurn core with Rotom-W to put pressure on each other's checks.</p>"
      },
      "Nasty Plot": {},
      "Defensive": {}
    },
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Azelf": {
    "sets": {
      "Choice Scarf": {},
      "Choice Specs": {
        "outdated": true,
        "description": "<p>A combination of excellent Special Attack, high Speed, Psychic Surge, Expanding Force, and good coverage allows Choice Specs Azelf to function as a powerful threat that can OHKO many of the tier's dangerous offensive threats and sweep weakened teams with ease. Knock Off lets Azelf reliably 2HKO RegenVest Manaphy with Expanding Force and cripple switch-ins such as Empoleon, Heatran, and RegenVest Hisuian Goodra, while U-turn allows Azelf to pivot out of the aforementioned switch-ins. Dazzling Gleam threatens an OHKO on RegenVest Roaring Moon after a Knock Off and 2HKOes Mandibuzz. Trick can be used instead to more permanently cripple defensive switch-ins such as Blissey, Empoleon, and Mandibuzz, while Flamethrower can be used to threaten Steel-types, allowing Azelf to OHKO Kingambit and 2HKO Corviknight. Choice Specs allows Azelf to threaten an OHKO against Pokemon such as Dragonite, Primordial Sea Zapdos, and non-specially defensive Garchomp. Azelf pairs up well with fast and frail offensive Pokemon such as Barraskewda, Meowscarada, and Hisuian Electrode, as they appreciate the Psychic Terrain Azelf sets up. Azelf also appreciates pivots such as the previously mentioned teammates, Galarian Zapdos, and Roaring Moon, as they help pressure switch-ins such as Empoleon, Heatran, and RegenVest Hisuian Goodra, while also forming a VoltTurn core with Azelf to generate momentum. Defensive teammates such as Corviknight, RegenVest Manaphy, and Kommo-o are appreciated as they can check the faster threats that force Azelf out such as Roaring Moon, Meowscarada, and Chien-Pao. Pokemon that can remove the entry hazards Azelf is prone to, such as the aforementioned Corviknight, make great teammates as well.</p>"
      }
    }
  },
  "Heatran": {"sets": {"Desolate Land": {}, "Magic Guard": {"outdated": true}}},
  "Cresselia": {
    "outdated": true,
    "sets": {
      "Unaware": {
        "description": "<p>Unaware Cresselia is an effective mixed wall and unorthodox setup sweeper with the ability to surprise opponents with its combination of Calm Mind and Stored Power. Cresselia is a reliable stop to powerful setup sweepers like Zamazenta-C and Garchomp, which can even be setup fodder for Cresselia. Once set up, Stored Power is Cresselia's main offensive option, dealing ridiculous damage against any non-Psychic-immune foes after two or three Calm Mind boosts. Additionally, Moonblast lets Cresselia threaten Dark- and Dragon-types like Chien-Pao and Garchomp. Because of Cresselia's passive stature and inability to make progress early-game, it shouldn't attempt to set up Calm Mind and sweep until physical attackers with super effective moves like Chien-Pao, Kingambit, and Slither Wing have been removed from play. Additionally, Cresselia fails to effectively defeat some special walls like Unaware Scream Tail and RegenVest Meloetta and Alolan Muk, making offensive teammates that threaten a 2HKO on either of these foes like Kingambit necessary to create openings for Cresselia to sweep. In addition to offensive pairings, this Pokemon appreciates defensive teammates like Intimidate Corviknight that can prevent it from being overwhelmed by Choice item users. Finally, Cresselia appreciates entry hazard removal from teammates like Corviknight, letting it preserve Moonlight's PP for the late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Manaphy": {"sets": {"RegenVest": {}, "Tail Glow": {}}},
  "Samurott-Hisui": {
    "outdated": true,
    "sets": {
      "Choice Band": {
        "description": "<p>Hisuian Samurott is a decent wallbreaker due to Adaptability, Choice Band, and a great STAB combination that also pressures the ever-present Corviknight to choose between recovery and Defogging. Ceaseless Edge is a versatile move that deals good damage to foes while also setting up Spikes, helping Hisuian Samurott's teammates or even itself to pick off chipped foes later in the game. Knock Off provides utility by removing items from switch-ins such as Corviknight and Quaquaval. Sucker Punch is a good priority move that lets Hisuian Samurott deal heavy damage to faster foes such as Cinderace, Iron Moth, and Zapdos. Brick Break can be used instead to deal with dual screens leads such as Corviknight and Mew. Hisuian Samurott's ability to set up Spikes and pester defensive Pokemon such as Corviknight and Scream Tail by removing their items is appreciated by various offensive teammates such as Chien-Pao and Galarian Zapdos that can take advantage of chipped foes. Fluffy and Intimidate Quaquaval wall Hisuian Samurott very easily, so spinblockers such as Desolate Land Skeledirge and Ceruledge are good partners as they can pressure Quaquaval and block it from removing Spikes set by Hisuian Samurott. Hisuian Samurott is susceptible to getting revenge killed due to low Speed and bulk, so robust walls such as Corviknight and Meloetta that can pivot and provide safe switch in opportunities to it are appreciated.</p>"
      },
      "Swords Dance": {"description": "<p>After a Swords Dance boost, Hisuian Samurott becomes a terrifying wallbreaker that can dent physically defensive walls like Corviknight. Sucker Punch acts as speed control against Pokemon like Zapdos and Iron Moth. Ceaseless Edge forces defensive Pokemon, such as Corviknight, to switch in and choose between entry hazard removal or healing. Black Glasses is the item of choice, boosting its Dark-type moves without the recoil of Life Orb. Pokemon like Thundurus and Iron Moth are very useful teammates, as they compensate for Hisuian Samurott's average Speed tier and can heavily damage physical walls that counter Hisuian Samurott like Quaquaval and Zamazenta-C. In return, Hisuian Samurott wears down special walls with its ability to set up a layer of Spikes. Additionally, due to its unimpressive bulk, Hisuian Samurott relies on walls such as Corviknight and Hisuian Goodra to compensate for the lack of defensive utility it brings.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}, {"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Atha", "user_id": 450411}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Lilligant-Hisui": {"outdated": true, "sets": {"Fluffy": {}, "Sword of Ruin": {}}},
  "Haxorus": {"outdated": true, "sets": {"Protean": {}}},
  "Mandibuzz": {
    "sets": {
      "Physically Defensive": {},
      "Volt Absorb": {
        "outdated": true,
        "description": "<p>Volt Absorb Mandibuzz acts as an excellent special wall, checking some of the tier's best pivots like Zapdos, Sandy Shocks, and Azelf. Knock Off cripples switch-ins like Corviknight and Great Tusk, while U-turn allows it to pivot out after switching into the aforementioned threats. Defog further increases Mandibuzz's utility by removing entry hazards, allowing teammates like Chien-Pao and Barraskewda to switch in safely, while Toxic cripples its switch-ins like Great Tusk and Garchomp. A Sassy nature and 0 Speed IVs allow Mandibuzz to pivot out as slowly as possible. Mandibuzz's defensive utility and slow pivoting is appreciated by wallbreakers and pivots like Chien-Pao, Dragonite, and Meowscarada. Mandibuzz also appreciates teammates like Scream Tail and Corviknight that can switch into Knock Off and handle threats like Chien-Pao and Galarian Zapdos. In return, Mandibuzz can check Pokemon that threaten these teammates such as Sandy Shocks and Hisuian Electrode. Mandibuzz is prone to getting worn down quickly by special threats like Walking Wake and Iron Moth, making other specially defensive teammates like Empoleon and RegenVest Manaphy good partners.</p>"
      }
    }
  },
  "Hydreigon": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {},
      "The Clicker (Choice Specs)": {
        "description": "<p>Utilizing its high Special Attack, Beads of Ruin, powerful STAB attacks, and solid coverage options, Hydreigon is a formidable wallbreaker that can tear down the tier’s most robust special walls like Hisuian Goodra, Meloetta, and Blissey over the course of a game. Focus Blast is a powerful option to muscle past Hisuian Goodra, Blissey and Zamazenta-C. U-turn allows Hydreigon to provide additional utility as a pivot, ease prediction, and maintain momentum against switch-ins like Blissey and Diancie, while Flash Cannon serves as an option to handle the Fairy-type switch-ins like Enamorus-T and Diancie that Hydreigon would otherwise struggle to beat. Hydreigon has unimpressive Speed and can be revenge killed quite easily by threats such as Slither Wing, Chien-Pao, and Pixilate Scream Tail, so walls that can handle these like RegenVest users, Corviknight, and Quaquaval are appreciated, with the latter two being able to pivot Hydreigon in. Powerful physical wallbreakers like Galarian Zapdos and Slither Wing are appreciated, forming a potent VoltTurn core with Hydreigon if it opts for U-turn, handling the special walls that Hydreigon can struggle against, and pivoting in Hydreigon to break the physical walls they may struggle with.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Volcarona": {
    "outdated": true,
    "sets": {
      "Quiver Dance": {},
      "Fast Support": {
        "outdated": true,
        "description": "<p>Volcarona serves as a solid support pokemon with valuable defensive utility to check the likes of Hariyama and Glaceon. Fiery Dance lets Volcarona increase its Special Attack without having to setup, while Flamethrower has more PP and immediate power. U-turn allows Volcarona to maintain momentum, while Quiver Dance serves as an option to go for a potential late-game sweep. Will-O-Wisp cripples switch-ins like Garganacl and is generally great for weakening physical attackers like Quaquaval. Teammates such as Meowscarada and Roaring Moon appreciate Volcarona's ability to sponge priority moves from Slither Wing and Hatterene. Bulky Ground-types like Ting-Lu and Donphan also benefit from Volcarona ability to somewhat safely switch into offensive Water-types such as Inteleon and non-Brave Bird Quaquaval. Volcarona is walled by common Well-Baked Body users like Kingambit and Corviknight, so attackers like Quaquaval and Sandy Shocks are helpful for breaking through them. Volcarona can also have trouble getting past Fire-resistant specially defensive walls that resist fire like Roaring Moon and Garganacl, so a physical wallbreaker such as Slither Wing is recommended.</p>"
      },
      "Offensive": {
        "outdated": true,
        "description": "<p>Volcarona serves as a passable late-game sweeper after checks such as Well-Baked Body Corviknight and special walls such as Garganacl, Blissey, and Clodsire have been eliminated from the game. Volcarona wants to quickly rack up stat boosts with Quiver Dance and Fiery Dance to sweep the enemy team while also providing a Water immunity in the form of Desolate Land. Alternatively, Volcarona can opt for Storm Drain to turn fast Primordial Sea users such as Greninja and Barraskewda into setup fodder. Will-O-Wisp is preferred on the last slot to cripple physical attackers such as Garchomp and Quaquaval, which seek to exploit Volcarona's low Defense, but Volcarona can run Bug Buzz to threaten bulky phazers such as Ting-Lu and RegenVest Roaring Moon or Psychic to chunk Haze users such as Toxapex and Clodsire. Volcarona is completely walled by Well-Baked Body Steel-types such as Corviknight and Kingambit; thus, partners such as Sandy Shocks help to eliminate them in the early-game. While Giga Drain can hurt Garganacl, Volcarona's massive weakness to Rock means it doesn't want to stay into Garganacl at all; thus, teammates such as Magic Guard Quaquaval are particularly helpful. Lastly, Volcarona appreciates entry hazard setters such as Garchomp and Clodsire, as the chip damage allows Volcarona to sweep more effectively.</p>"
      }
    }
  },
  "Thundurus": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<p>Thundurus's excellent Special Attack, good Speed and coverage, and access to Nasty Plot allow it to function as a great wallbreaker. Focus Blast threatens RegenVest Roaring Moon, Hisuian Goodra, and Volt Absorb Empoleon. Psychic threatens Kommo-o, Great Tusk, and Iron Moth, while Sludge Bomb threatens Scream Tail. Sheer Force offers more power, letting Thundurus OHKO Garganacl with Focus Blast. Magic Guard lets Thundurus avoid chip damage and lets Sludge Bomb potentially poison switch-ins such as Kommo-o, specially defensive Garchomp, and Volt Absorb Mandibuzz; however, the drop in power significantly compromises its ability as a wallbreaker in exchange for utility. Fast cleaners like Meowscarada and Roaring Moon appreciate Thundurus being able to pressure their walls like Corviknight and Great Tusk, opening up the way for them to sweep late-game. Thundurus appreciates entry hazard support from the likes of Empoleon, Garchomp, and Sandy Shocks, as the chip damage from hazards allows Thundurus to secure OHKOs against Pokemon such as Hisuian Goodra and specially defensive Garchomp after a Nasty Plot, as well as Kommo-o, Iron Moth, and Volt Absorb Empoleon. Thundurus's poor bulk means it's OHKOed by most Pokemon faster than it, so walls such as Corviknight and Manaphy that can take hits for it and pivot it in are appreciated. Thundurus is prone to being worn down by Stealth Rock if not running Magic Guard, so entry hazard removers such as Great Tusk and the aforementioned Corviknight are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Thundurus-Therian": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<p>A sky-high Special Attack stat combined with powerful coverage moves boosted by Sheer Force and access to Nasty Plot makes Thundurus-T a dangerous wallbreaker, able to threaten many common special walls such as Empoleon, RegenVest Manaphy, and Roaring Moon. Focus Blast threatens an OHKO on Volt Absorb Empoleon and a 2HKO on Blissey, RegenVest Roaring Moon, and Hisuian Goodra. Psychic threatens an OHKO on Kommo-o, Great Tusk, and Iron Moth. Fast cleaners like Azelf and Hisuian Electrode appreciate Thundurus-T being able to pressure their walls like Empoleon and Hisuian Goodra, respectively, opening up the way for them to sweep late-game. Thundurus-T appreciates entry hazard support from the likes of Kommo-o, Garchomp, and Sandy Shocks letting it more reliably OHKO specially defensive Garchomp and Hisuian Goodra after a Nasty Plot. Thundurus-T is prone to being chipped down by Stealth Rock and put in KO range of strong priority moves from threats like Dragonite and Ceruledge, so hazard removers like Great Tusk and Corviknight are appreciated. Thundurus-T is also easily revenge killed by most Pokemon that are faster than it like Chien-Pao and Meowscarada due to its low bulk and middling Speed, so walls such as Manaphy and the aforementioned Corviknight that can take a hit for it and safely pivot it in are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Landorus": {"outdated": true, "sets": {"Sheer Force": {}, "Desolate Land": {}}},
  "Landorus-Therian": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Landorus-T is a specially defensive pivot with respectable offensive power to boot. Earthquake is its main STAB move, threatening offensive Steel- and Fire-types like Heatran and Iron Moth that fail to OHKO Landorus-T. U-turn allows Landorus-T to gain momentum and switch out, giving powerful-but-frail attackers like Chien-Pao and Iron Moth the ability to switch in for free. Rock Tomb and Sludge Bomb are used to whittle down Earth Eater Fire-types like Skeledirge and defensive Fairy-types like Scream Tail, respectively, with Rock Tomb being able to heavily damage Zapdos. Alternatively, Smack Down can be used to threaten switch-ins like Corviknight, (add comma) while Sandsear Storm can burn pivots like Garchomp. A Sassy nature with 0 Speed IVs lets Landorus-T underspeed defensive pivots like Garchomp, Scream Tail, and non-minimum Speed Corviknight with U-turn. RegenVest Landorus-T can form a powerful defensive VoltTurn core with physically defensive pivots like Corviknight and Iron Treads. Additionally, fast revenge killers and late-game sweepers like Chien-Pao and Hisuian Electrode benefit from slow pivots that can get them on the field without having to absorb an attack themselves. Due to its typing, Landorus-T does not act as an adequate switch-in to Water-type attackers like Volcanion; Water-resistant teammates like Dondozo and Water Absorb Iron Treads help mitigate this weakness.</p>"
      },
      "Fluffy": {
        "description": "<p>Fluffy makes Landorus-T a decent defensive pivot that can take hits from physical attackers such as Slither Wing, Kingambit, and Ursaluna. Stealth Rock + Smack Down makes Landorus-T a decent entry hazard setter against Corviknight, the most common hazard removal option; Smack Down also ensures that Talonflame can't use Landorus-T as setup fodder. Taunt can also be used to deny recovery to Corviknight and Scream Tail and setup opportunities to foes, such as Talonflame and Roaring Moon. Landorus-T best fits on balance and bulky offense teams, where it can provide defensive support against the aforementioned physical attackers. Common defensive Pokemon such as Corviknight, Hisuian Goodra, and Scream Tail are good teammates that can switch into Pokemon that threaten Landorus-T, such as Chien-Pao, Zapdos, and Quaquaval; Scream Tail can also provide Wish support. Landorus-T struggles to beat offensive Pokemon one-on-one, but its ability to safely pivot into teammates benefits fast offensive Pokemon such as Iron Moth, Greninja, and Chien-Pao.</p>"
      },
      "Well-Baked Body": {
        "description": "<p>With an added immunity to Fire, Landorus-T becomes a fantastic check to many of the Fire-types in the tier such as Cinderace, Ceruledge, and Iron Moth that also doubles as an entry hazards setter and a pivot. It differentiates itself from Garchomp as a Fire-type answer with its immunity to Will-O-Wisp as well as access to U-turn and Smack Down, allowing it to generate momentum and pressure Corviknight and other Flying-types. It can further capitalize on this added offensive presence with Swords Dance, especially if it has activated Well-Baked Body beforehand. Alternatively, running Hammer Arm over Smack Down allows it to still beat Earth Eater Heatran by itself and potentially hit Earth Eater Iron Treads hard on the switch. As a Fire-type answer, it makes a fantastic partner for Corviknight, which also appreciates its Fighting resistance to help against Pokemon like Slither Wing and in turn can handle many strong wallbreakers such as Roaring Moon and Chien-Pao that Landorus-T lacks the bulk and recovery to answer. Landorus-T also benefits RegenVest Pokemon such as Hisuian Goodra and Meloetta by preventing them from getting overwhelmed by strong Fire-type attacks and, in the case of Hisuian Goodra, helping against Ground-types such as Sandy Shocks and Landorus, while in return they handle the many special attackers in the tier. Water-immune partners, such as Desolate Land Heatran and Ceruledge, make good teammates for Landorus-T as well. Frail wallbreakers such as Chien-Pao and Cinderace also benefit from its pivoting ability to enter the battlefield safely as well as the hazards its sets to wear down their checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}, {"username": "Don Vascus", "user_id": 322272}, {"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "UT", "user_id": 523866}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Meloetta": {"sets": {"RegenVest": {}}},
  "Chesnaught": {"outdated": true, "sets": {"Triage": {}, "Well-Baked Body": {}}},
  "Greninja": {
    "outdated": true,
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Greninja is a powerful offensive threat and pivot that uses its rain-boosted attacks to break past most neutral foes. Dark Pulse helps deal with common Desolate Land users like Iron Moth and Cinderace. Ice Beam provides coverage against Dragon-types like Goodra and Roaring Moon, while Surf lets Greninja clean up weakened teams without relying on the low PP and accuracy of Hydro Pump. U-turn lets Greninja switch out from its checks while still maintaining momentum, forming a VoltTurn core with physical wallbreakers like Galarian Zapdos and Cinderace that can threaten the specially defensive Pokemon that wall Greninja like Blissey and Hisuian Goodra. Greninja pairs well with entry hazard setters such as Ting-Lu and Garchomp, which can help it wear down its checks. Greninja also appreciates hazard removal from Pokemon like Corviknight and Iron Treads to avoid getting worn down when switching in; these two Pokemon can also pivot in Greninja.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Talonflame": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Talonflame is a fast late-game sweeper that uses its good Speed tier, powerful Brave Bird, and bevy of utility options to pick and choose its counters. With Swords Dance, it's able to set up and clean up games while being able to and take on pokemon Pokemon that would normally take its Brave Bird like Corviknight, physically defensive Manaphy, and Ogerpon-C, while Flare Blitz can be used as a way to break through other foes that would otherwise take on its Brave Bird such as Fluffy Zapdos and Heatran. Taunt allows Talonflame to set up on Pokemon with Unaware that would usually slow it down or wall it with healing like Blissey, Scream Tail, and Cresselia, while Will-O-Wisp can be used to cripple switch-ins, support teammates, and wear down checks to Talonflame like Garganacl, Primordial Sea Zapdos, and Garchomp. Pivots such as Corviknight, Barraskewda, and Manaphy like being able to pivot into Talonflame for it to set up a sweep or to take down certain threats and walls for them like Ogerpon-H, Ogerpon-W, and Kommo-o. Talonflame is forced out by Pokemon that are faster than it or have strong priority such as Barraskewda, Chien-Pao, Dragonite, and Choice Scarf Azelf, which can be taken on with teammates like Corviknight, Scream Tail, and Gholdengo.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hiusi guy", "user_id": 603640}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Florges": {"outdated": true, "sets": {"Defensive": {}}},
  "Sylveon": {"outdated": true, "sets": {"Unaware": {}}},
  "Hawlucha": {"outdated": true, "sets": {"Magic Guard": {}}},
  "Goodra": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>Goodra serves as a solid special wall, leveraging its massive bulk and pure Dragon typing to properly check dangerous threats like Hadron Engine Sandy Shocks, and Sheer Force Thundurus and Gengar its Hisuian counterpart falters against. Knock Off provides utility and a reliable way to threaten Ghost-types like Gholdengo and Gengar, and Dragon Tail enables Goodra to accumulate chip damage and force out threatening setup sweepers like Volcarona and Manaphy. Draco Meteor provides a powerful neutral STAB move, Ice Beam allows Goodra to better threaten Zapdos and both Thundurus formes, and Scald provides an option to spread chip damage and potential burns to dissuade switch-ins. Thunderbolt allows Goodra to threaten Corviknight directly, while Earthquake allows it to OHKO Iron Moth and Heatran. Goodra suffers from having low physical bulk, meaning physically defensive teammates like Corviknight and Intimidate Quaquaval are recommended to handle them; these teammates also provide entry hazard removal, which is greatly beneficial for its survivability. Goodra also fails to check Walking Wake and Enamorus-T as a special wall, meaning it pairs well with teammates like Empoleon and Well-Baked Body or Earth Eater Gholdengo to handle these threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "LordBox", "user_id": 611238}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Kinetic", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Goodra-Hisui": {"sets": {"RegenVest": {}}},
  "Diancie": {"outdated": true, "sets": {"Defensive": {}, "Triage": {}}},
  "Hoopa": {
    "outdated": true,
    "sets": {
      "Special Wallbreaker": {
        "description": "<p>Hoopa is a passable wallbreaker that fits on offensive teams, particularly when paired with Sticky Web support from Masquerain and Spidops and teammates that can pivot it in safely. Psyshock allows Hoopa to hit special walls like Blissey on their weaker physical bulk, while Knock Off cripples RegenVest users like Alolan Muk and Meloetta that can otherwise take a hit and threaten a KO or pivot out to a faster offensive threat like Chien-Pao. Focus Blast 2HKOes Hisuian Goodra and KOes Kingambit that would attempt to switch in. Defensive pivots that can take a hit and pivot out like Corviknight and Meloetta can get Hoopa in safely. Dual screens setters like Prankster Corviknight and Mew also make for a good partner, as they allow Hoopa to have an easier time setting up with Nasty Plot or tank a hit in a pinch and retaliate. Offensive pivots like Slither Wing and Galarian Zapdos pair well with Hoopa with their ability to bait in and pivot out on checks like Corviknight and defensive Zapdos, allowing Hoopa to set up and threaten a KO; faster offensive threats like Chien-Pao and Barraskewda also pair well with it by making up for its lackluster Speed while Hoopa threatens out their checks like defensive Quaquaval.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Volcanion": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Primordial Sea Volcanion excels as a fantastic wallbreaker with its great Special Attack and offensive typing. Rain-boosted Steam Eruption combined with Choice Specs allows Volcanion to 2HKO most Pokemon in tier, including most specially defensive walls such as RegenVest Garchomp, Meloetta, and Alolan Muk. Weather Ball dissuades promient Desolate Land users that might want to switch in to Volcanion such as Cinderace and Iron Moth. Earth Power is a more reliable way to deal with Desolate Land users like Iron Moth and Heatran, and it's a reliable way to hit Hisuian Goodra without missing. Focus Blast 2HKOes a would-be check in RegenVest Roaring Moon, as well as Hisuian Goodra after Spikes chip. Volcanion pairs well with entry hazard setters like Ting-Lu and Garchomp, which help wear down common RegenVest Pokemon like Goodra and Hisuian Goodra, and hazards also guarantee a 2HKO on Meloetta. Due to Volcanion's Stealth Rock weakness it pairs well with hazard removers like Corviknight and Quaquaval, which can also help pivot it in safely. Volcanion also pairs well with offensive pivots like Zapdos and Roaring Moon, which can help bring it in on targets like Corviknight.</p>"
      },
      "Magic Guard": {
        "description": "<p>Magic Guard Volcanion serves as a great mixed wallbreaker with a typing that also offers defensive utility. Flare Blitz is notably able to 2HKO RegenVest users like Hisuian Goodra and Meloetta, and Steam Eruption's burn chance deters would-be switch-ins like defensive Quaquaval and Garchomp. Earth Power reliably threatens Toxapex and Desolate Land users such as Iron Moth, Skeledirge, and Cinderace. Taunt can be used to hinder defensive walls with recovery such as Scream Tail and Quaquaval, while Will-O-Wisp is able to reliably burn switch-ins like defensive Quaquaval and Garchomp. Flame Charge is also a niche option to outspeed common revenge killers to Volcanion like Zapdos, Hisuian Arcanine, and Choice Band Galarian Zapdos. Magic Guard helps Volcanion with its weakness to entry hazards while also negating recoil from Flare Blitz and Life Orb. Offensive pivots such as Slither Wing and Iron Moth can bring Volcanion in against defensive cores featuring staples like Intimidate Corviknight and RegenVest users. Fast late-game cleaners like Chien-Pao and Regieleki also appreciate Volcanion's ability to weaken defensive checks like Quaquaval and common RegenVest users, which can allow them to take over games, while also providing speed control against faster threats to Volcanion like Zapdos, Hisuian Electrode, and Roaring Moon. Volcanion's susceptibility to being revenge killed by aformetioned threats makes defensive partners such as Corviknight and Meloetta essential, as they can tank hits and also help pivot to bring in Volcanion safely. Despite being immune to hazards, Volcanion still lacks recovery, so a teammate that can grant it longevity like Wish Scream Tail is also appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "I am BONK", "user_id": 603931}, {"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "LordBox", "user_id": 611238}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Decidueye": {"outdated": true, "sets": {"Defensive": {}}},
  "Lycanroc": {"outdated": true, "sets": {"Rocky Payload": {}}},
  "Toxapex": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<p>Toxapex is a stout physically defensive wall that deters common physical attackers like Galarian Zapdos and Ceruledge. Toxic targets foes that commonly run Heavy-Duty Boots or are Ground immune like Cinderace and Galarian Zapdos, while Toxic Spikes provides excellent team support; Corrosion variants should always run Toxic to punish common switch-ins like Corviknight and Hisuian Goodra that otherwise might use Toxapex as free recovery. Prankster + Haze, on the other hand, is an excellent tool to frustrate hyper offense teams and stop dangerous setup sweepers like Chien-Pao, Polteageist, and Chesnaught. While the consistent recovery of Black Sludge is generally preferred, Rocky Helmet allows Toxapex to annoy non-Magic Guard Galarian Zapdos and Chien-Pao even when it is forced to use Recover. Toxapex is utterly unable to threaten most Magic Guard users, like Galarian Zapdos and especially Water-resistant ones like Hisuian Electrode and Quaquaval, so reliable checks to them like Hisuian Goodra and Fluffy Corviknight are recommended. Toxic Spikes variants appreciate spinners like Iron Treads, as they can provide entry hazard removal without removing Toxic Spikes as well. Toxapex can easily be overwhelmed by multiple attackers, so it should always have a secondary physically defensive teammate, especially one that handles Ground-types, like Intimidate Corviknight; this also relieves some of the pressure off of Toxapex of checking pivots without Regenerator.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Kommo-o": {
    "sets": {
      "Triage": {},
      "Defensive": {
        "outdated": true,
        "description": "<p>Kommo-o uses its unique typing and excellent bulk to serve as an fantastic physical wall, taking on the likes of Barraskewda, Meowscarada, and Roaring Moon while also taking advantage of the turns it generates by forcing these wallbreakers out to set up Stealth Rock. Body Press chips hazard removal options like Corviknight and Quaquaval, while Dragon Tail forces foes out, quickly racking up entry hazard chip on the opposing team. Iron Defense bolsters Kommo-o's walling capabilities and Body Press's damage output, turning it into a potential late-game wincon. Intimidate Corviknight is a good partner for Kommo-o, taking on the Ice-, Flying-, and Dragon-types that threaten it like Chien-Pao, Galarian Zapdos, and Dragonite, while Kommo-o takes on the Electric- and Fire-types like Hisuian Electrode, Ogerpon-H, and Ceruledge that Corviknight struggles with. Empoleon particularly makes for another good partner with its ability to check Fairy- and Psychic-types like Enamorus-T and Azelf. Offensive pivots like Azelf and Barraskewda appreciate Kommo-o wearing down their checks like Corviknight and Roaring Moon, allowing them to form powerful a VoltTurn core that takes advantage of Kommo-o's Stealth Rock to quickly wear down those checks.</p>"
      },
      "Galvanize": {
        "outdated": true,
        "description": "<p>Galvanize Kommo-o stands out as one of the tier's few mixed attackers while being flexible in its role as a Stealth Rock setter or setup sweeper depending on what its team requires. Boomburst denies Corviknight, Mandibuzz, and Quaquaval from removing hazards by unexpectedly OHKOing them, while Clanging Scales 2HKOes Great Tusk. Close Combat allows Kommo-o to threaten special walls like Hisuian Goodra and Blissey looking to switch into it and tank its special moves freely. With Kommo-o's ability to maintain Stealth Rock, it becomes an extremely effective offensive Stealth Rock setter when running it as its 4th move; alternatively, Clangorous Soul improves its bulk, damage output, and Speed, making it harder to revenge kill and allowing it to clean teams late-game. A Life Orb is preferred on Stealth Rock variants for consistency, while Throat Spray is better for Clangorous Soul variants to reduce the chip taken by Kommo-o while still increasing its damage output. Wallbreakers like Meowscarada and Chien-Pao appreciate Kommo's ability to remove checks like Corviknight and Quaquaval, allowing them to clean up after. Faster offensive pivots like Azelf and Barraskewda appreciate Kommo-o's Stealth Rock when forming a VoltTurn core, which wears down the opposing team quickly, or Kommo-o's ability to clean up with Clangorous Soul after they have heavily chipped the opposing team. Kommo-o requires good defensive pivots like Corviknight and RegenVest Manaphy as teammates, with their ability to switch into revenge killers that threaten Kommo-o like Chien-Pao, Dragonite, and Enamorus-T and pivot out.</p>"
      }
    }
  },
  "Cinderace": {
    "outdated": true,
    "sets": {
      "Swords Dance": {
        "description": "<p>Cinderace's high Attack and Speed combined with great coverage options and Swords Dance turn it into a powerful wallbreaker and cleaner. High Jump Kick threatens Roaring Moon and OHKOes Well-Baked Body Kingambit, while Gunk Shot threatens to cripple switch-ins such as Manaphy, Zapdos, Kommo-o, and physically defensive Garchomp. Life Orb lets High Jump Kick OHKO RegenVest Roaring Moon and lets Gunk Shot 2HKO Primordial Sea Zapdos, while Heavy-Duty Boots increases Cinderace's longevity. Desolate Land lets Cinderace come in on and force out Primordial Sea users like Zapdos if safely pivoted in by a teammate while also letting +2 Life Orb-boosted Pyro Ball OHKO defensive Great Tusk. Sword of Ruin + Heavy-Duty Boots provides more damage on Cinderace's coverage moves at the cost of a worse matchup into Primordial Sea and lowered damage on Pyro Ball. Fast cleaners such as Barraskewda and Dragonite appreciate Cinderace's ability to pressure their walls like Corviknight and Scream Tail, opening up the way for them to sweep late-game. Special pivots like Azelf, Zapdos, and Walking Wake are appreciated, as they can pivot Cinderace in against their switch-ins, such as Empoleon and Hisuian Goodra. Cinderace's frailty means it's easily revenge killed by most Pokemon faster than it like Chien-Pao and Choice Scarf Azelf, so teammates that can take a hit for it and pivot it in such as Corviknight and Manaphy are appreciated. Cinderace is also completely walled by Well-Baked Body Gholdengo, so teammates that can threaten it like Garchomp and Roaring Moon are appreciated.</p>"
      },
      "Utility": {
        "description": "<p>Cinderace is a good utility pivot thanks to its high Speed and great supporting movepool. U-turn lets it pivot out against Well-Baked Body Pokemon like Corviknight, Gholdengo, and Kingambit, as well as Primordial Sea users like Zapdos, Walking Wake, and Manaphy. Court Change punishes opposing teams for setting entry hazards or dual screens. Super Fang can be used instead to chip switch-ins like Kommo-o, Garganacl, and Quaquaval that Cinderace cannot meaningfully damage otherwise. Taunt prevents status moves, entry hazards, and recovery, which can help against foes like Scream Tail, while Will-O-Wisp cripples checks like Garchomp, Kommo-o, and Primordial Sea Zapdos. Cinderace is threatened by Primordial Sea users like Barraskewda, Ogerpon-W, and Walking Wake, which force it out, making walls like defensive Zapdos, Kommo-o, and Empoleon pair well with it. Offensive pivots such as Galarian Zapdos, Meowscarada, and Sandy Shocks pair well with Cinderace, as they form a VoltTurn core with it, being able to pivot it in to threaten walls like Corviknight, Meloetta, Hisuian Goodra. In return, Cinderace can pivot these teammates in to threaten its switch-ins like Kommo-o, Garaganacl, and Quaquaval.</p>"
      },
      "Magic Guard": {
        "description": "<p>Magic Guard Cinderace provides a blend of utility and firepower in a single teamslot; this in combination with its excellent Speed tier lets it serve as either a strong pivot or wallbreaker. Magic Guard allows Cinderace to fire off its strong Flare Blitz and use Life Orb without recoil while negating entry hazard chip damage. High Jump Kick forces out Garganacl and Well-Baked Body Kingambit as well as being the strongest move against neutral targets like Quaquaval and Mandibuzz. U-turn allows Cinderace to pivot out on switch-ins like Well-Baked Body Corviknight and Quaquaval, while Swords Dance changes its role from a pivot to a wallbreaker and late-game cleaner. Gunk Shot further increases its coverage, preying on Fairy-types like Scream Tail and Enamorus-T and threatening switch-ins like Primordial Sea Zapdos and Dragonite, while Will-O-Wisp allows it to cripple its switch-ins like Regenerator Great Tusk and physically defensive Garchomp, and Court Change allows it to control hazards in a pinch. Cinderace's ability to force out Steel-types like Corviknight is greatly appreciated by other physical wallbreakers like Chien-Pao and Galarian Zapdos, which in return can remove Corviknight if it is running Well-Baked Body for Cinderace so it can clean up afterwards. Cinderace is vulnerable to revenge killers like Dragonite, Barraskewda, and Azelf, making walls like Corviknight, defensive Zapdos, and RegenVest Manaphy good partners that can switch into these revenge killers and pivot out. Well-Baked Body Gholdengo completely shuts down Cinderace, so teammates that can remove it like Gengar and offensive Roaring Moon make for great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}, {"username": "cat", "user_id": 580765}, {"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Kinetic", "user_id": 552227}, {"username": "LordBox", "user_id": 611238}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Inteleon": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Inteleon is a strong wallbreaker that fits well on balance and bulky offense teams. U-turn allows it to pivot out on switch-ins like Hisuian Goodra and Blissey while also forming strong VoltTurn cores with other pivots like Galarian Zapdos and Slither Wing that can wear down each other's checks with entry hazards up. Mud Shot allows it to threaten Desolate Land Fire-types like Iron Moth and Cinderace that would otherwise switch into Inteleon freely. Ice Beam allows it to chip specially bulky Dragon-types like RegenVest Roaring Moon and Goodra, while Surf acts as a more reliable option late-game when the opposing team has been heavily chipped or to snipe frailer or slower targets like Azelf and both Zapdos formes. Physical wallbreakers like Chien-Pao and Roaring Moon appreciate Inteleon pivoting into them on its switch-ins like the aforementioned Hisuian Goodra and Blissey as well as Inteleon's ability to threaten physical walls like Corviknight and defensive Quaquaval. Inteleon brings close to no defensive utility bar a Fire-type move immunity, which means that walls like Corviknight and Goodra are a must-have to make up for the lack of defensive utility; these Pokemon also switch into revenge killing attempts from Slither Wing and Regieleki. Inteleon appreciates Spikes support from Pokemon like Garchomp and Ting-Lu that helps it to wear down RegenVest Pokemon like Meloetta and Alolan Muk.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Tranquility", "user_id": 475288}]}]}
  },
  "Corviknight": {"sets": {"Physically Defensive": {}, "Volt Absorb": {}}},
  "Drednaw": {"outdated": true, "sets": {"Shell Smash": {}}},
  "Barraskewda": {"sets": {"Primordial Sea": {}}},
  "Toxtricity": {"outdated": true, "sets": {"Shift Gear": {}, "Choiced Attacker": {}}},
  "Polteageist": {
    "outdated": true,
    "sets": {
      "Queenly Majesty": {},
      "Fluffy": {},
      "Shell Smash": {
        "outdated": true,
        "description": "<p>Polteageist is a dangerous setup sweeper and cleaner thanks to Shell Smash, Stored Power, and its excellent Special Attack, allowing it to sweep with a single turn of setup. Giga Drain provides coverage for Ting-Lu and Garganacl, Strength Sap gives Polteageist a way to restore its Focus Sash after chip damage and set up on weaker physical attackers, while Substitute allows for safe setup on status-reliant walls like Blissey. Focus Sash the preferred item to safely ensure Polteageist can use Shell Smash. Polteageist can often struggle to get itself onto the field safely, so it appreciates a slow pivot from Corviknight or Shed Tail Cyclizar who can also facilitate Polteageist's setup with screens or a passed Substitute. Polteageist pairs well with physical wallbreakers like Swords Dance Cinderace that can break through opposing walls. Due to its reliance on Focus Sash, Polteageist needs reliable entry hazard removal like Cyclizar and Iron Treads.</p>"
      }
    }
  },
  "Hatterene": {"outdated": true, "sets": {"Triage": {}}},
  "Zamazenta-Crowned": {
    "outdated": true,
    "sets": {
      "IronPress": {
        "description": "<p>Zamazenta-C leverages its high bulk and Speed to be an excellent setup sweeper with Iron Defense + Body Press while also being able to check many of the tier's dangerous offensive threats with its excellent defensive typing. Zamazenta-C can only use Dauntless Shield, which increases its potency as a setup sweeper while boosting Body Press. Stone Edge threatens an OHKO on Iron Moth while 2HKOing Dragonite, Ceruledge, and Primordial Sea Zapdos. Substitute can be used to block status and phazing moves, notably surviving a Scald from defensive Manaphy and a Dragon Tail from Garchomp, as well as pivoting moves from defensive Pokemon such as Corviknight, Empoleon, Mandibuzz, and Manaphy. Special wallbreakers such as Gengar, Azelf, and Walking Wake appreciate Zamazenta-C being able to threaten switch-ins to them such as Empoleon, Hisuian Goodra, and RegenVest Roaring Moon, as well as offensive checks such as Chien-Pao, Roaring Moon, and Ogerpon-C, as the aforementioned teammates are otherwise forced out by the threat of an OHKO; in return, they can remove Zamazenta-C's checks, such as defensive Kommo-o and Zapdos. Zamazenta-C struggles with physically defensive Pokemon that can counter it by setting up on their own, such as Iron Defense Kommo-o and Corviknight, as well as Bulk Up Great Tusk, so teammates that can check them such as Zapdos and Scream Tail are appreciated, with the latter being able to pass Wishes to Zamazenta-C. Zamazenta-C is also weak to entry hazards, so teammates that can remove hazards such as Corviknight and Great Tusk are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Zarude": {"outdated": true, "sets": {"Adaptability": {}, "Fluffy": {}}},
  "Regieleki": {
    "outdated": true,
    "sets": {
      "Refrigerate": {
        "description": "<p>An amazing Speed stat combined with Refrigerate earns Regieleki a niche as a spinner that cannot be spinblocked and a pivot that can threaten common Pokemon that block Volt Switch such as Garchomp and Great Tusk. Extreme Speed OHKOes Dragonite and offensive Garchomp and 2HKOes Roaring Moon and offensive Zapdos. Tera Blast 2HKOes defensive Great Tusk and chips defensive Kommo-o and Zapdos, while Thunderbolt can be used to better pressure Corviknight and Ice-resistant foes such as Manaphy, Iron Moth, and Heatran attempting to switch in. Heavy-Duty Boots lets Regieleki ignore the entry hazards it removes, while Never-Melt Ice lets Extreme Speed OHKO Hisuian Electrode and specially defensive Garchomp and lets Tera Blast 2HKO defensive Zapdos. Wallbreakers such as Ceruledge and Ogerpon-H appreciate Regieleki being able to safely pivot them in on Pokemon they threaten such as Iron Moth and Heatran while also removing the entry hazards they're weak to; in return, they can threaten the bulky Pokemon that Regieleki struggles to break through such as Scream Tail, Hisuian Goodra, and Volt Absorb Empoleon. Additionally, Regieleki's ability to outspeed and threaten Choice Scarf Azelf is valuable, as Azelf can OHKO the aforementioned wallbreakers after Stealth Rock chip. Regieleki's poor bulk makes it an unreliable entry hazard remover on its own; therefore it's recommended to pair it with another hazard remover such as Great Tusk, Corviknight, or Mandibuzz, with the latter two forming a VoltTurn core with the momentum they generate from their pivoting moves. Physical pivots such as Barraskewda, Roaring Moon, and Meowscarada are also recommended teammates, as they also create a VoltTurn core, while Regieleki lures in special walls such as Heatran, Meloetta, and Manaphy that they can force out.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Enamorus-Therian": {"sets": {"Triage": {}}},
  "Meowscarada": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<p>Meowscarada serves as a strong pivot and revenge killer that leverages its excellent STAB combination to threaten some of the tier's strongest physical walls like Quaquaval, Great Tusk, and Garganacl. U-turn allows Meowscarada to pivot out on its switch-ins like Corviknight and defensive Kommo-o. With Choice Band, Low Kick OHKOes Zamazenta-C on the switch and forces out Hiusian Goodra, Play Rough threatens to OHKO Kommo-o while chipping Sap Sipper Great Tusk, and Lash Out punishes chipped Intimidate Corviknight switching in. Choice Scarf is an option over Choice Band that trades the ability to OHKO defensive Kommo-o and 2HKO Scream Tail and Sap Sipper Great Tusk for being an exceptional Speed control option and having the ability to revenge kill slower Choice Scarf users like Azelf and Roaring Moon, as well as unboosted, naturally faster targets like Barraskewda and Hisuian Electrode. Meowscarada's ability to force out special walls like Hisuian Goodra, RegenVest Manaphy, and Roaring Moon is greatly appreciated by special wallbreakers and pivots like Walking Wake, Iron Moth, and Choice Specs Azelf, which in return force out the physical walls that wall Meowscarada like Corviknight and defensive Zapdos. Meowscarada is vulnerable to revenge killers like Dragonite, Zamazenta-C, and Chien-Pao, so teammates that can switch into these threats like Corviknight and Quaquaval make good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Skeledirge": {
    "outdated": true,
    "sets": {
      "Spinblocker": {
        "description": "<p>Thanks to its typing and good physical bulk, Skeledirge serves as an excellent spinblocker that can wall common spinners such as Iron Treads with Earth Eater and Quaquaval with Desolate Land. It also walls threats like Choice Band Cinderace and Zamazenta-C and, depending on its ability, Garchomp and Primordial Sea Zapdos. Skeledirge can then use Torch Song to set up on passive opponents like Scream Tail and non-Well-Baked Body Blissey or Will-O-Wisp to burn an incoming foe, including switch-ins like Hisuian Goodra and Alolan Muk. Hex alongside Will-O-Wisp does more damage, but Shadow Ball can be used for more consistent damage. Skeledirge pairs well with hazard setters such as Garchomp and Iron Treads, as it allows them to keep their hazards on the field, and they can in turn handle opposing Well-Baked Body Pokemon. Due to its middling Special Defense, Skeledirge appreciates specially defensive teammates like Blissey and Hisuian Goodra. Additionally, a teammate that covers the type that Skeledirge chooses not to be immune to, such as Quaquaval for Earth Eater variants and Corviknight for Desolate Land variants, helps form a strong defensive core. Dark-types like Meowscarada and Chien-Pao also OHKO Skeledirge with a bit of chip damage, so Pokemon like Galarian Zapdos and Slither Wing that can threaten them are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Quaquaval": {
    "outdated": true,
    "sets": {
      "Intimidate": {},
      "Magic Guard": {},
      "Defensive": {
        "outdated": true,
        "description": "<p>Defensive Quaquaval uses its good physical bulk and typing to act as a physically defensive pivot, checking dangerous threats like Kingambit, Chien-Pao, and Hisuian Arcanine. Intimidate allows Quaquaval to weaken foes like Chien-Pao and Cinderace for its teammates, while Fluffy grants better bulk to better check Slither Wing and Roaring Moon. U-turn allows Quaquaval to maintain momentum and allows frailer teammates like Slither Wing and Hydreigon to pivot in safely while Rapid Spin offers role compression by allowing it to remove hazards while having a good matchup against entry hazard setters like Iron Treads and Garchomp. A Relaxed nature and 0 Speed IVs allow it to pivot out as slow as possible. Meloetta is a valuable teammate that can switch in on special threats such as Iron Moth and Zapdos that force Quaquaval out. Physical wallbreakers like Meowscarada and Talonflame have a good type matchup against Quaquaval, hence teammates that can force them out like Zamazenta-C and Regieleki make solid partners.</p>"
      }
    }
  },
  "Spidops": {"outdated": true, "sets": {"Sticky Web Setter": {}}},
  "Pawmot": {"outdated": true, "sets": {"Offensive": {}}},
  "Garganacl": {
    "outdated": true,
    "sets": {
      "Immunity Ability": {},
      "Specially Defensive": {
        "outdated": true,
        "description": "<p>Garganacl finds itself as a Stealth Rock setter that fits on balance and stall teams with its ability to force progress through passive damage and maintain entry hazards by annoying popular hazard removal options with Salt Cure. Toxic Debris allows Garganacl to punish weak physical attacks like U-turn from Corviknight and Meloetta, while Earth Eater allows it to check and set up with Iron Defense or Curse on Ground-types like Iron Treads, Landorus-T, and Garchomp, and Water Absorb allows it to check Greninja, Inteleon, and Quaquaval lacking Close Combat. Stealth Rock pairs well with Salt Cure, as Salt Cure heavily chips common hazard removal options like Iron Treads and Corviknight, while Iron Defense and Curse allow Garganacl to act as a bulky cleaner late-game. Protect allows Garganacl to scout the opponent's move, heal with Leftovers, and force more passive damage on foes, while Earthquake and Body Press hit Magic Guard Pokemon like Quaquaval and Heatran that otherwise switch in freely. Garganacl's inability to check common special wallbreakers like Sheer Force Iron Moth and Enamorus-T makes pivots like Regieleki and Slither Wing and physical wallbreakers like Chien-Pao great partners; in return, they appreciate Garganacl's ability to maintain Stealth Rock on the field and annoy their checks like Hisuian Goodra and Corviknight with Salt Cure. Garganacl gets rapidly worn down by entry hazards when carrying Leftovers, making physically defensive hazard removal options like Corviknight and defensive Quaquaval good partners; these Pokemon also check physical wallbreakers that threaten Garganacl like Galarian Zapdos, while it checks the special wallbreakers that threaten them. The aforementioned Magic Guard Quaquaval checks Garganacl lacking Iron Defense + Body Press and can spin away Garganacl's Stealth Rock; Desolate Land Skeledirge can spinblock Quaquaval effectively, making it a good partner for Garganacl.</p>"
      }
    }
  },
  "Ceruledge": {"sets": {"Desolate Land": {}, "Sword of Ruin": {}, "Triage": {}}},
  "Kilowattrel": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Choice Specs Primordial Sea Kilowattrel is an explosive special attacker that takes advantage of Hurricane's and Thunder's accuracy buff in rain to rain down terror on unprepared while also checking Desolate Land users like Iron Moth and Cinderace. Weather Ball is Kilowattrel's best option against Ground-types like Iron Treads and Landorus-T which shrug off its other offensive options while also chipping Desolate Land Heatran and Cinderace. Pivoting partners like Landorus-T and Corviknight pair with Killowattrel to create a potent VoltTurn core, constantly creating momentum to easily bring each other in and deal big damage. Because of its ability to force switches, Kilowattrel appreciates teammates like Garchomp and Scream Tail that can both set entry hazards and mitigate its own frailty by switching in. Additionally, because of its weakness to Stealth Rock and inability to heal itself, hazard removers like Corviknight and Iron Treads are required to prolong its life and maximize the amount of times it can switch in. Finally, RegenVest users like Hisuian Goodra and Meloetta both comfortably shrug off Kilowattrel's attacks, so physically offensive teammates like Slither Wing and Chien-Pao can chip or remove them, escalating Kilowattrel's potency as a sweeper.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Brambleghast": {"outdated": true, "sets": {"Physically Defensive": {}}},
  "Tinkaton": {
    "outdated": true,
    "sets": {
      "Well-Baked Body": {},
      "Tinted Lens": {
        "description": "<p>Tinted Lens Tinkaton is a solid physical wallbreaker that provides utility while using Tinted Lens to bypass resistances to Gigaton Hammer, turning the tables on defensive Quaquaval and Corviknight, activating teammates like Choice Band Chien-Pao that are hindered by these Pokemon. Metal Coat can be considered as it grants Tinkaton a boosting option for Gigaton Hammer without recoil, granting good odds of OHKOing frailer offensive Pokemon like Ceruledge and Magic Guard Quaquaval after minor chip. Swords Dance allows Tinkaton to more effectively wallbreak, Knock Off is excellent utility that cripples switch-ins like Magic Guard Heatran and Volcanion while annoying switch-ins like Corviknight and Iron Treads, Stealth Rock allows it to act as an offensive entry hazard setter, Protect allows it to gain more Leftovers recovery on Gigaton Hammer's cooldown turn, and Thunder Wave cripples setup sweepers that may try to capitalize on Gigaton Hammer's cooldown turn. Tinkaton appreciates slow pivots like Corviknight and Meloetta that can live a hit and pivot in Tinkaton safely. Tinkaton also appreciates faster teammates that make up for its lackluster Speed like Roaring Moon and Hisuian Electrode. Entry hazard setters like Garchomp and Ting-Lu pair well with Tinkaton, as it forces numerous switches and removes Heavy-Duty Boots.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Palafin": {
    "outdated": true,
    "sets": {
      "Palafin": {
        "description": "<p>Palafin's powerful priority offense and pivoting make it a dangerous threat even with its standard ability. Jet Punch from Palafin-H easily revenge kills dangerous threats like Kilowattrel, Sandy Shocks, and Talonflame, as well as Chien-Pao after minor chip damage. Palafin is heavily hampered by Desolate Land; to take down their users, Zen Headbutt from Palafin-H easily OHKOes Iron Moth and 2HKOes Ceruledge, while Close Combat flings Cinderace into the sun. Pivoting teammates such as Kilowattrel, Meowscarada, and Corviknight not only form dangerous pivoting cores with Palafin, but also position it to both activate Zero to Hero and fire off its powerful Jet Punch. Due to its frequent need to switch and reliance on a recoil move to wallbreak, Palafin requires effective entry hazard removers like Corviknight and Donphan; WishPass Scream Tail is also a great teammate to heal off chip damage. Even with its strong coverage moves, Palafin struggles mightily against opposing Desolate Land, so reliable switch-ins like Well-Baked Body Slither Wing are strongly recommended. Palafin struggles against Dondozo, making teammates that can punish it like Meowscarada and Spikes Garchomp good additions.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Glimmora": {"outdated": true, "sets": {"Defensive": {}}},
  "Dondozo": {"outdated": true, "sets": {"Curse": {}}},
  "Clodsire": {"outdated": true, "sets": {"Specially Defensive": {}}},
  "Kingambit": {
    "outdated": true,
    "sets": {
      "Immunity Ability": {},
      "Swords Dance": {
        "outdated": true,
        "description": "<p>Swords Dance Kingambit excels as a mid-game wallbreaker that can boost on passive foes and tear through the opponent's team with its Adaptability-boosted STAB attacks. Kowtow Cleave and Iron Head are Kingambit's main attacks, heavily damaging defensive pivots like Corviknight, Hisuian Goodra, Scream Tail, and Garganacl. Sucker Punch lets it predict and punish faster attackers like Quaquaval, Volcarona, and Slither Wing that try and come in to revenge kill. 140 Speed EVs let Kingambit outspeed uninvested Corviknight and Skeledirge. Black Glasses lets Kingambit OHKO Iron Moth with Sucker Punch. Immunity abilities like Well-Baked Body and Earth Eater are options to pick up additional setup chances. Fast endgame sweepers like Chien-Pao, Meowscarada, and Hisuian Electrode benefit from Kingambit's early-game presence, capitalizing on chipped foes and scoring easy KOs. Defensive pivots like Intimidate Corviknight, RegenVest Meloetta, and Fluffy Landorus-T can thwart revenge killers targeting Kingambit and use U-turn to bring it in safely again. Finally, Primordial Sea Zapdos can help Kingambit by forcing Corviknight and Quaquaval, two of its most consistent checks, letting it chip them on their switch-in repeatedly.</p>"
      }
    }
  },
  "Great Tusk": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<p>Great Tusk is a premier defensive wall thanks to its high physical bulk and access to utility such as Knock Off and Rapid Spin. Ice Spinner threatens Flying-type Pokemon like Landorus-T, Gliscor, and Dragonite. Bulk Up is used to boost Great Tusk's offensive and defensive presence, while Knock Off cripples switch-ins like Corviknight and Earth Eater Skeledirge. Regenerator provides reliable recovery and allows Great Tusk to switch back in to take hits from multiple threats, but Fluffy can be used to reduce damage taken from contact move users like Roaring Moon and physical Kommo-o. Leftovers can be used for small but valuable recovery, while Rocky Helmet can be used to punish contact attackers. Frailer Pokemon that are weak to entry hazards such as Azelf and Chien-Pao appreciate Great Tusk's ability to reliably remove hazards. Great Tusk's abysmal special bulk makes it susceptible to special attackers like Manaphy and Azelf. Therefore, Pokemon like Hisuian Goodra and RegenVest Manaphy can form a defensive core with Great Tusk, being able to switch into those wallbreakers and force them out with utility like Dragon Tail and Knock Off, respectively.</p>"
      },
      "Offensive Bulk Up": {
        "description": "<p>A solid offensive typing, a high Attack stat, and wide coverage make Great Tusk a potent wallbreaker. Bulk Up is the main source of Great Tusk's power, increasing its tanking capabilities and offensive prowess. Great Tusk's typing and coverage allow it to set up in front of multiple physical attackers like Roaring Moon, Kingambit, and Zamazenta-C. Ice Spinner OHKOes Primordial Sea Zapdos after a Bulk Up, OHKOes Dragonite and 2HKOes Landorus-Therian, while Knock Off threatens Skeledirge and Ceruledge if not running Headlong Rush and cripples defensive Pokemon like Corviknight, Quaquaval, and Earth Eater Gholdengo looking to switch in. Close Combat threatens Earth Eater Kingambit and Empoleon, as well as Roaring Moon, while Headlong Rush threatens Iron Moth, Skeledirge and Ceruledge. Fluffy helps Great Tusk set up Bulk Up more easily with its heightened physical bulk, making it a powerful tank. Great Tusk is a potent wallbreaker and entry hazard remover, so Pokemon that are vulnerable to entry hazards like Ogerpon-H and Chien-Pao benefit from its presence. In return, they threaten common defensive Pokemon that wall Great Tusk, such as Manaphy and Corviknight. Great Tusk has terrible special bulk and appreciates pivoting, so special walls like RegenVest Roaring Moon and the aforementioned Manaphy make for great teammates. Despite Great Tusk's high Attack stat, it still requires entry hazard chip damage to pick up KOes, Stealth Rock to OHKO itemless Zapdos at +1 and Stealth Rock and three layers of Spikes to OHKO Toxapex. Therefore, teammates like Sandy Shocks and Garchomp, which can set up Stealth Rock and Spikes, are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Kinetic", "user_id": 552227}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "deetah", "user_id": 297659}]}]}
  },
  "Scream Tail": {"sets": {"Pixilate": {}, "Unaware": {}}},
  "Slither Wing": {
    "outdated": true,
    "sets": {
      "Choice Band": {
        "description": "<p>With a terrifyingly high Attack stat and access to strong STAB moves, Slither Wing stands out as a strong wallbreaker, being able to break through some of the tier's most common physical walls, including Corviknight, Great Tusk, and Quaquaval. First Impression is able to snipe common revenge killers, OHKOing the likes of Chien-Pao, Barraskewda, and all Ogerpon formes. Flare Blitz allows Slither Wing to hit Fluffy users like Zapdos and Great Tusk as well as non-Well-Baked Body Gholdengo, while Earthquake hits the likes of Ceruledge, Skeledirge, and Well-Baked Body Gholdengo, which otherwise resist or are immune to its moves. Sword of Ruin allows Slither Wing to safely 2HKO Corviknight and defensive Great Tusk with Close Combat, while Tinted Lens helps it OHKO offensive Zapdos with First Impression after slight chip damage and also deal solid damage against foes that resist Bug such as Dragonite and Great Tusk. Scrappy is a niche alternative that lets Slither Wing easily OHKO Gholdengo and Gengar and still 2HKO Corviknight. Slither Wing pairs well with fast cleaners like Chien-Pao and Barraskewda, as they can easily take over games after it has chipped down physically defensive walls like Corviknight, defensive Quaquaval, and Great Tusk. Slither Wing is fairly slow and susceptible to being OHKOed from the likes of Dragonite, Iron Moth, and Azelf, so defensive pivots like Corviknight and Manaphy are greatly appreciated, and they can also bring it in safely. Slither Wing also dislikes entry hazards, so hazard removal from the likes of Great Tusk or Corviknight is helpful, as this allows it to come in more often.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "I am BONK", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Sandy Shocks": {
    "outdated": true,
    "sets": {
      "Hadron Engine": {
        "description": "<p>Sandy Shocks functions as a great offensive pivot thanks to its excellent offensive typing and ability to set entry hazards. Volt Switch lets Sandy Shocks pivot out of problematic matchups such as RegenVest Roaring Moon and Meloetta. Stealth Rock and Spikes allow Sandy Shocks to set up hazards against foes like Corviknight, Manaphy, and Zapdos, which are normally forced to switch out. Choice Scarf helps Sandy Shocks with its average Speed, turning it into a revenge killer and letting it outpace and OHKO other revenge killers like Barraskewda, Chien-Pao, and Iron Moth, while Heavy-Duty Boots lets it come in safely more often and also does not lock it into a move. Sandy Shocks forms great VoltTurn cores, so other offensive pivots such as Barraskewda, Meowscarada, and Choice Scarf Roaring Moon are great teammates. Stronger wallbreakers like Walking Wake and Gengar appreciate Sandy Shocks's ability to chip down special walls such as Empoleon, RegenVest Manaphy, and Hisuian Goodra, which gives them an easier time breaking through these foes. Sandy Shocks is completely walled by the likes of Landorus, Iron Treads, and Volt Absorb Corviknight, so physical wallbreakers like Ogerpon-C and Chien-Pao are helpful in order to pressure them. Sandy Shocks is vulnerable to faster revenge killers like Barraskewda and Chien-Pao if it's not running Choice Scarf, meaning that defensive pivots like Corviknight and Manaphy are appreciated as well.</p>"
      },
      "Immunity Ability": {
        "description": "<p>Immunity ability Sandy Shocks is a decent physical tank when it gets going due to its access to Iron Defense + Body Press and utility like Spikes. Iron Defense allows it to defend itself from common physical attackers like Great Tusk and Ogerpon-H, and Body Press threatens Electric-immune Pokemon like Volt Absorb Empoleon and Corviknight, as well as Motor Drive Manaphy. However, Spikes + Earth Power is an alternative to Iron Defense + Body Press, as it provides entry hazard utility and a secondary STAB move option. Substitute takes advantage of the free turns it can generate with its immunity ability and can block status from slower walls. Since Sandy Shocks doesn't have any form of reliable recovery, Leftovers is the preferred item. The ability choice comes down to team need; Earth Eater punishes Great Tusk, Iron Treads, and Garchomp, while Water Absorb is an excellent check to Barraskewda and Zapdos that also can block pivoting from Empoleon. Sandy Shocks works well on hyper and bulky offense, as it can set up easier and can counter passive walls. Therefore, Pokemon that appreciate this ability like Chien-Pao and Dragonite make for good teammates. Despite its ability to increase its physical bulk, it is very vulnerable on the special side, making Pokemon like Gengar and Iron Moth threatening foes. Because of this, Pokemon like RegenVest Roaring Moon and Manaphy make for good teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "I am BONK", "user_id": 603931}, {"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "cat", "user_id": 580765}, {"username": "Kinetic", "user_id": 552227}, {"username": "LordBox", "user_id": 611238}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "Tea Guzzler", "user_id": 577920}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Iron Treads": {
    "outdated": true,
    "sets": {
      "Ground Immunity": {
        "description": "<p>Iron Treads is an excellent spinner that is able to switch into common entry hazard setters such as Garchomp and Landorus-T with its own Levitate while also being able to use Knock Off on common switch-ins such as Corviknight. Iron Treads can opt to be a hazard setter itself with Stealth Rock, keep up momentum with Volt Switch on targets like Corviknight, or use Heavy Slam as a strong STAB option for Scream Tail and Chien-Pao. Levitate allows Iron Treads to be immune to Spikes while also being able to spin them away, whereas Earth Eater can be used as an alternative for better longevity against hazard setters like Garchomp and Smack Down Landorus-T. Offensive Pokemon that are weak to hazards such as Chien-Pao and Thundurus-T appreciate Iron Treads's ability to keep hazards off the field, as well as being able to pivot them in safely with Volt Switch. Strong physical attackers like Galarian Zapdos and Kingambit also are good teammates for Iron Treads, as they can more easily break through Corviknight with Knock Off support from Iron Treads. Iron Treads can be overwhelmed by coverage options from hazard setters such as Liquidation Garchomp, so running Wish Scream Tail, which can increase Iron Treads's longevity, or a secondary hazard remover like Corviknight and Quaquaval, which can also stave off hits, is recommended. Iron Treads is also vulnerable to strong Fighting-type attackers such as Galarian Zapdos and Slither Wing, so it is advised to pair it with a Fighting-resistant teammate such as Scream Tail or Fluffy Zapdos.</p>"
      },
      "Fire Immunity": {
        "description": "<p>Well-Baked Body Iron Treads is a spinner with a great defensive typing in addition to a Fire immunity and ability to compress several roles such as item and entry hazard removal into one Pokemon. It is notably able to threaten the tier's premier spinblocker in Skeledirge, allowing it to remove hazards freely. If there is already a Stealth Rock user on the team, Iron Treads can instead use Heavy Slam to check Calm Mind Scream Tail and Enamorus-T, Rock Slide to OHKO Talonflame and Volcarona, or Volt Switch to bring in teammates safely. 236 Speed EVs are used to outspeed and threaten an OHKO on Jolly Hisuian Arcanine. Pixilate Scream Tail and Primordial Sea users like Inteleon, Greninja, and Quaquaval all appreciate Iron Treads switching into their checks in Desolate Land Fire-types like Iron Moth and Ceruledge. Physical wallbreakers like Chien-Pao and Hisuian Arcanine appreciate Iron Treads removing items from shared switch-ins like Corviknight and Quaquaval. Fighting- and Ground- types like Galarian Zapdos, Slither Wing, and Garchomp threaten Iron Treads, so defensive partners like Scream Tail, Quaquaval, and Corviknight are recommended. Iron Treads's Rapid Spin also supports the hazard stacking effort from partners like Garchomp and Ting-Lu. Certain Fire-types like Cinderace and Ceruledge can still threaten Iron Treads with their coverage moves, so it appreciates a secondary check to them like Primordial Sea Zapdos.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "LordBox", "user_id": 611238}, {"username": "Tranquility", "user_id": 475288}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "Lumari", "user_id": 232216}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Iron Jugulis": {
    "outdated": true,
    "sets": {"Sheer Force": {"description": "<p>With high-Base Power moves and decent Special Attack and Speed, Iron Jugulis is a solid wallbreaker that can outspeed and threaten common specially defensive foes, like Garchomp and Garganacl. Iron Jugulis offers a notable niche, as Hurricane + Dark Pulse + Focus Blast can hit every viable Pokemon for neutral damage. Taunt disrupts attempts to heal, set up, or set entry hazards, allowing Iron Jugulis to better handle Pokemon such as Blissey and Clodsire. Iron Jugulis struggles against special walls like Florges and Scream Tail, so physically offensive teammates like Cinderace and Ceruledge are necessary to break through them. Due to its frailty, it enjoys teammates like Slither Wing and Corviknight that can pivot it in, the latter of which can also remove hazards with Defog. Iron Jugulis also appreciates entry hazard setters such as Ting-Lu, which can enable it to secure KOs that it would typically miss, such as Garganacl.</p>"}},
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Iron Moth": {"sets": {"Desolate Land": {}}},
  "Iron Thorns": {"outdated": true, "sets": {"Dragon Dance": {}}},
  "Gholdengo": {
    "sets": {
      "Defensive": {},
      "Magic Guard": {
        "outdated": true,
        "description": "<p>Magic Guard Gholdengo is an extremely powerful special wallbreaker that takes advantage of Nasty Plot, Life Orb, and Steel Beam, the latter two without recoil, to overwhelm special walls. Shadow Ball provides excellent neutral coverage, hitting Manaphy, Hisuian Goodra, and Empoleon. Hex is an alternative with Toxic Spikes or other status support and bypasses Bulletproof. Recover gives Gholdengo the ability to heal off damage taken while setting up, as well as simply giving it the longevity to attack the opponent's team throughout the battle. Alternatively, Focus Blast hits Steel-types like Heatran and Hisuian Goodra, while Thunder Wave slows down faster attackers like Iron Moth and Roaring Moon that try to threaten Gholdengo while powering up Hex to break down bulkier Pokemon like Manaphy. Gholdengo's ability to beat down balanced cores with the sheer strength of Steel Beam benefits faster cleaners like Barraskewda, Chien-Pao, and Choice Scarf Azelf and Walking Wake. If Gholdengo runs Thunder Wave, it can also support other offensive Pokemon that appreciate faster attackers getting slowed down, such as Great Tusk, Ceruledge, and Dragonite. However, Gholdengo is vulnerable to faster Dark-types like Chien-Pao, so Pokemon that can check them like Corviknight and Quaquaval are appreciated. Corviknight can even safely bring in Gholdengo with its U-turn. Additionally, if Gholdengo is not using Thunder Wave and Hex, RegenVest users like Manaphy and Meloetta completely wall it, so Pokemon that beat them with super effective STAB moves or physical attacks like Desolate Land Ogerpon-H and Roaring Moon are appreciated.</p>"
      },
      "Offensive": {
        "outdated": true,
        "description": "<p>With Nasty Plot, a fantastic offensive and defensive typing, and solid coverage, Gholdengo is a terrifying wallbreaker that threatens to tear apart teams after a single free turn. Hex can be used over Shadow Ball with Thunder Wave or Toxic Spikes support, with Life Orb sets 2HKOing badly poisoned RegenVest Manaphy while also threatening Bulletproof Gholdengo. Recover gives Gholdengo significant longevity and multiple opportunities to use Nasty Plot, while Substitute gives it a free turn to set up Nasty Plot or Thunder Wave against foes like Corviknight and Kommo-o and dodges phazing attempts from Dragon Tail users like Hisuian Goodra and Roaring Moon. Focus Blast hits Roaring Moon, Kingambit, and Hisuian Goodra, while Thunder Wave can boost the power of Hex and spread useful paralysis against threats like Manaphy, Roaring Moon, and Ogerpon-C. Leftovers and Colbur Berry both boost its longevity, with the latter letting Gholdengo survive Knock Off from Roaring Moon or +2 Ogerpon-C, while Life Orb boosts Gholdengo's power significantly, granting it feats such as guaranteeing a 2HKO on specially defensive Garchomp with Make It Rain. If running Focus Blast, Beads of Ruin is an option over Adaptability, boosting Focus Blast's power at the cost of revealing Gholdengo's ability and slightly decreasing the power of its STAB moves. Gholdengo can struggle to break through common special walls like Blissey, Bulletproof Empoleon, and RegenVest users like Hisuian Goodra and Meloetta, so it appreciates powerful offensive teammates like Roaring Moon, Ogerpon-C, and Galarian Zapdos that can handle these walls while Gholdengo picks off physical walls like Corviknight, Great Tusk, and Kommo-o. Gholdengo appreciates defensive pivots like Corviknight, Manaphy, and Empoleon that can take a hit and bring Gholdengo in against foes it forces out such as Kommo-o, Pixilate Scream Tail, and Galarian Zapdos.</p>"
      }
    }
  },
  "Chien-Pao": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Ting-Lu": {
    "outdated": true,
    "sets": {
      "Regenerator": {},
      "Specially Defensive": {"outdated": true, "description": "<p>Ting-Lu's absurd mixed bulk and unusual typing make it a formidable mixed wall, capable of checking several key threats such as Kingambit, Ceruledge, and Iron Moth. Ting-Lu's best entry hazard depends on its team, as it can form a strong hazard-stacking core with Stealth Rock and/or Spikes setters like Garganacl and Glimmora. Ruination spreads consistent damage, especially against Ground-immune foes like Earth Eater Kingambit, and forces defensive Pokemon like Corviknight, Hippowdon, and Blissey to waste their recovery PP. Whirlwind forces entry hazard damage onto foes and ensures Ting-Lu isn't setup fodder for threats like Talonflame and Quaquaval. The Speed IVs let it underspeed Corviknight to punish its Roost with Earthquake. Foes like Scream Tail and Lucario can endanger Ting-Lu by targeting its weaknesses, so Corviknight is a good teammate that also provides Defog.</p>"},
      "RegenVest Wall": {"outdated": true, "description": "<p>Ting-Lu's excellent defensive stats and useful typing let it check a plethora of special attackers such as Hydreigon and Iron Moth. Throat Chop provides STAB damage and lets it beat Boomburst users, Ruination + Sand Tomb traps and eliminates opposing Ting-Lu and Skeledirge, while also draining recovery PP from Hippowdon and Blissey. Some special attackers like Scream Tail can prove dangerous, so pairing Ting-Lu with Corviknight and Desolate Land Iron Moth are good options. Ting-Lu can switch into weaker physical attackers like Roaring Moon, but it should be used as help for the main physical wall on the team. Ting-Lu is vulnerable to opposing setup sweepers, so teammates like Unaware Corviknight are greatly appreciated. Corviknight can also reduce Ting-Lu's weakness to entry hazards.</p>"}
    }
  },
  "Chi-Yu": {
    "outdated": true,
    "sets": {
      "Choice Item Attacker": {
        "description": "<p>Chi-Yu's strong base stats and excellent STAB coverage make it a flexible offensive threat. Choice Specs provides maximum wallbreaking power, notably allowing it to OHKO physically defensive Ting-Lu with Desolate Land + Overheat, whereas Choice Scarf gives it the Speed to clean late-game and chase out faster threats like Cinderace and Chien-Pao. Desolate Land provides the most damage amplification and comes with an immunity to Water, whereas No Guard enables Chi-Yu to liberally spread burns with Inferno. Psychic is useful coverage to hit Clodsire and Iron Moth super effectively; alternatively, Will-O-Wisp allows Desolate Land sets to reliably spread burn, however Chi-Yu's poor bulk means it can be dangerous to use. Chi-Yu's best fit is on balance and offense teams that appreciate its high damage output, as well as its good matchups against common special walls like RegenVest Iron Treads. Bulky pivots, like the aforementioned Corviknight and Iron Treads, make particularly good Chi-Yu partners because both can clear entry hazards, particularly Stealth Rock.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Thanks to its high Special Attack and decent Speed, Chi-Yu is a potent wallbreaker that makes use of Nasty Plot and its unresisted STAB combination to tear through common walls like Sand Stream Garganacl and non-Unaware Florges. Chi-Yu generally prefers to run Heavy-Duty Boots to avoid entry hazard damage, but Life Orb can be run on Sheer Force sets for extra power. Chi-Yu also has several Fire-type STAB moves to choose from: Fire Blast is the most powerful, Flamethrower is the most consistent option, and Inferno is used on No Guard sets to punish switch-ins like Garganacl and Ting-Lu with a burn. Chi-Yu does struggle against special walls like Clodsire and Blissey, so physically offensive Pokemon like Meowscarada and Kingambit make good teammates. Chi-Yu is also physically frail, so it appreciates teammates like Corviknight and Avalugg that can switch into strong physical attacks and Wish passers like Florges and Scream Tail that can help it stay healthy.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Roaring Moon": {
    "sets": {
      "Choice Item": {},
      "RegenVest": {
        "outdated": true,
        "description": "<p>Roaring Moon is an excellent user of RegenVest with a typing that plays well into the tier's special setup sweepers and pivots like Iron Moth, Sandy Shocks, and all variants of Zapdos. Knock Off cripples switch-ins like Great Tusk and Corviknight while also threatening a 2HKO on offensive Gholdengo and an OHKO on Gengar and Azelf. U-turn allows Roaring Moon to pivot out on these switch-ins, and Dragon Tail allows Roaring Moon to force out setup sweepers such as Manaphy, which Roaring Moon cannot meaningfully damage, while letting it rack up entry hazard damage. Stone Edge allows Roaring Moon to threaten the plethora of Flying- and Fire-types that the tier has, such as Thundurus, Iron Moth, and Zapdos, while Iron Head allows it to chip Fairy-types like Scream Tail and Diancie that otherwise can switch in freely. Roaring Moon appreciates physically defensive walls like Corviknight, Great Tusk, and Quaquaval that can remove entry hazards which limit Roaring Moon's walling capabilities, while it checks the special Electric- and Fire-types that threaten them like Hisuian Electrode and Iron Moth in return. Roaring Moon's presence is appreciated by pivots and wallbreakers like Galarian Zapdos and Sword of Ruin Ceruledge due to its ability to switch into revenge killing attempts from the likes of Hisuian Electrode, Sandy Shocks, and Azelf. Roaring Moon deathly fears Dragon- and Fairy-types like Hydreigon, Walking Wake, and Enamorus-T, making Earth Eater Empoleon a notable partner with its ability to pivot into these Pokemon.</p>"
      }
    }
  },
  "Walking Wake": {"sets": {"Choice Item": {}}},
  "Ogerpon-Wellspring": {"sets": {"Swords Dance": {}}},
  "Ogerpon-Hearthflame": {
    "outdated": true,
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-H is a strong wallbreaker that is able to beat many of the tier's premier walls, such as Corviknight, Scream Tail, and Great Tusk thanks to its high Attack, excellent STAB moves, and good Speed tier. Power Whip can be used to get massive damage on Ground- and Water-types, including securing the KO on Intimidate Quaquaval and physically defensive Great Tusk after Swords Dance, while Horn Leech can be run instead to give Ogerpon-H more longevity. Ogerpon-H has a number of options for its last moveslot, such as Play Rough to hit Kommo-o and Roaring Moon, OHKOing both after a Swords Dance, and Knock Off to cripple foes, especially switch-ins like Primordial Sea Zapdos, which gets 2HKOed after Stealth Rock, as well as 2HKOing Well-Baked Body Gholdengo with Sword of Ruin. Desolate Land provides the most power to Ivy Cudgel and lets Ogerpon-H offensively check Water-types like Manaphy and Barraskewda, while Sword of Ruin allows Play Rough to OHKO Kommo-o and 2HKO Garchomp. Due to its average defenses and lack of recovery if not running Horn Leech, Ogerpon-H benefits both from entry hazard removers like Great Tusk and Quaquaval and slow pivots like Corviknight and Empoleon that can get it on the field safely. Ogerpon-H also appreciates hazard setters like Garchomp and Heatran, which can chip down walls like Scream Tail for it to more easily KO.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Kinetic", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Ogerpon-Cornerstone": {
    "outdated": true,
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-C, with the combination of Swords Dance + Ivy Cudgel that is further boosted by Rocky Payload and its signature item Cornerstone Mask, is a devastating physical wallbreaker that is able to threaten common physical walls in Corviknight, Zapdos, Great Tusk, and defensive Quaquaval. Power Whip is a more powerful Grass-type STAB move, while Horn Leech is more reliable and provides better longevity. Knock Off hits Gholdengo and wears down Corviknight, Play Rough 2HKOes defensive Kommo-o and chips Sap Sipper Great Tusk, while Trailblaze is an option to make Ogerpon-C a potential sweeping threat. Fast physical attackers like Barraskewda, Roaring Moon, and Meowscarda appreciate Ogerpon-C being able to apply constant offensive pressure to help break down Corviknight, Zapdos, and if running Play Rough, Kommo-o, allowing them to be more efficient cleaners. Ogerpon-C has a poor defensive typing and can be vulnerable to chip damage or entry hazards, thus slow pivots like Corviknight, which can remove hazards, and Manaphy, on balance or more offensive-oriented dual screens teams, are recommended so that Ogerpon-C can come in safely. Ogerpon-C is also vulnerable to faster offensive Pokemon like Chien-Pao, Roaring Moon, and Barraskewda, so speed control like Choice Scarf Azelf and Roaring Moon are also good teammates for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "LordBox", "user_id": 611238}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Gouging Fire": {"sets": {"Magic Guard": {}, "Desolate Land": {}, "Earth Eater": {}}},
  "Iron Boulder": {"sets": {"Choice Band": {}}}
}