{
  "Venusaur": {"sets": {"Sun Sweeper": {}}},
  "Blastoise": {"sets": {"Shell Smash": {}}},
  "Vileplume": {"sets": {"Phyiscally Defensive": {}}},
  "Slowbro": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Calm Mind Slowbro makes for one of the best physical walls and late-game cleaners in the metagame. It acts as an excellent check to a wide variety of Pokemon such as Terrakion, Barraskewda, and Jirachi. Calm Mind allows Slowbro to turn into a threatening late-game cleaner capable of ending games easily. Scald can punish switch-ins to special sponges like Assault Vest Cyclizar and Hisuian Goodra and Dark-type physical attackers like Bisharp and Crawdaunt. Psychic Noise is preferred over Psychic and Psyshock to stop setup Pokemon from recovering, making matchups against Fezandipiti and Suicune more favorable and cancelling Amoonguss's Giga Drain and Okidogi's Drain Punch completely. Slack Off and Regenerator give Slowbro incredible longevity and the ability to consistently set up with Calm Mind during the course of the game. Heavy-Duty Boots is an excellent item that allows Slowbro to make full use of its ability in Regenerator to stay healthy throughout the game. Rocky Helmet is also useful, as Slowbro switches into the many Close Combats, Iron Heads, Liquidations while also checking Maushold and dealing damage passively. Tera Fairy rids Slowbro of its Ghost-, Bug-, and Dark-type weaknesses. Tera Poison makes Slowbro immune to Toxic from the likes of Okidogi, Fezandipiti, and Quagsire; keeps its invaluable Fighting resistance while granting it a Fairy resistance and removes its Dark- and Bug- type weaknesses to consistently check Okidogi, Mienshao, and others.</p> <p>Calm Mind Slowbro fits best on balance and bulky offense teams, as they enjoy its ability to check the many physical attackers running around the tier. Cyclizar makes for a great partner because it resists Electric- and Grass-type attacks and is immune to Ghost-type attacks, while Slowbro resists Fighting-type attacks and other strong physical attacks for Cylizar and its teammates. Cyclizar also acts as a sponge for the many special attacks aimed at Slowbro and as entry hazard control. Amoonguss pairs well with Slowbro because it forms a Regenerator core alongside Slowbro while preventing it by getting poisoned from the likes of Fezandipiti and Okidogi. Amoonguss also eases the pressure off of Slowbro by helping in answering the plentiful physical attackers in the tier. Hippowdon acts similarly in checking physical attackers while also aiding Slowbro against Electric-types like Rotom-Heat, whereas Slowbro switches into Water-type attacks for Hippowdon. Krookodile is a good partner for Slowbro, as it enjoys Slowbro's ability to check Fighting- and Water-types like Terrakion and Barraskewda, while Slowbro appreciates Krookodile's ability to set Stealth Rocks, remove items with Knock Off and take care of the Steel- and Ghost-types like Hisuian Goodra and Gengar that threaten Slowbro. Slither Wing is a great offensive partner for Slowbro because it invites Fezandipiti and Okidogi for Slowbro and resists Dark-type attacks for it. Calm Mind Fezandipiti and Slowbro work well together, as they both weaken Steel-types like Empoleon and Jirachi for each other while doubling as Fighting-type answers. Fezandipiti and Jirachi are excellent teammates because they form great synergy with Slowbro and are good Pokemon in general due to their ability to spread status and act as pivots while throttling setup attempts with Taunt and Encore, respectively.</p>"
      },
      "Future Sight": {
        "description": "<p>Slowbro is among the best physically defensive walls in the tier with great bulk, multiple forms of recovery, and the ability to use Terastallization very efficiently against a good portion of the metagame. Scald allows Slowbro to punish switch-ins to Dark-types that come in to stop Future Sight, such as Bisharp and Overqwil while also threatening to burn specially defensive walls like Assault Vest Cyclizar and Empoleon. Future Sight has great damage output and enables Slowbro's teammates to force uncomfortable matchups during a game. Thunder Wave, similarly to Future Sight, can enable teammates to apply offensive pressure through forcing switches. Slack Off, combined with Regenerator, makes Slowbro very difficult to take down. A maximum HP and Defense Slowbro with Bold nature has seemingly unbreakable bulk on the physical side, comfortably switching into some of the premier physical threats like Barraskewda, Terrakion, and Galarian Zapdos. Tera Fairy is used to flip the weaknesses to Bug- and Dark-type, maintain the important Fighting-type resistance, and is generally a good Tera type defensively. Tera Poison keeps the Fighting-type resistance and can prevent Slowbro from becoming poisoned, usually the best means of taking it down, although it does make the matchup into Psychic-types like Reuniclus and opposing Slowbro more difficult.</p> <p>Future Sight Slowbro provides incredible offensive and defensive synergy within many team structures and is especially good on balance or bulky offense teams. Slowbro is often paired with other Regenerator users such as Amoonguss, Cyclizar, and Mienshao to form cores that are very difficult to break and can wear teams down offensively through hazard damage and gradual chip from U-turn and Future Sight. Slowbro can support teams through paralysis spam with other teammates like Bellibolt, Jirachi, and Thundurus, enabling offensive options like Basculegion-F and Gengar to take advantage of the boosted Hex damage or slow wallbreakers like Conkeldurr and Crawdaunt to outspeed most of the metagame. Slowbro generally likes to be paired with teammates that can absorb special attacks and are immune to Poison, such as Fezandipiti and Jirachi. To maximize the use of Future Sight, you often want to run physical attacking Fighting-types like Conkeldurr, Mienshao, and Terrakion, since Future Sight will lure in specially defensive walls such as Assault Vest Cyclizar and Empoleon as well as Dark-types like Bisharp and Alolan Muk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563264, "username": "Forest Guardian"}, {"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 231398, "username": "feen"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Slowbro-Galar": {"sets": {"Defensive": {}}},
  "Muk-Alola": {"sets": {"RestTalk": {}}},
  "Cloyster": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Shell Smash Sweeper": {}}},
  "Gengar": {"sets": {"Choice Scarf": {}, "Hex + Will-O-Wisp": {}, "Nasty Plot": {}}},
  "Weezing-Galar": {"sets": {"Defensive": {}}},
  "Chansey": {"sets": {"Defensive": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Ditto": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Imposter": {"description": "<p>Tera Steel makes Ditto immune to Toxic Spikes and take less from Stealth Rock. It also lets Ditto revenge kill Belly Drum Hariyama. A Quiet nature and the Special Attack investment is in case Ditto transforms into a Future Sight user like Slowbro.</p>"}}},
  "Vaporeon": {"sets": {"Defensive": {}}},
  "Zapdos-Galar": {"sets": {"Choice Scarf": {}, "Choice Band": {}}},
  "Mew": {"sets": {"Nasty Plot": {}, "Double Dance": {}}},
  "Typhlosion-Hisui": {"sets": {"3 Attacks + Will-O-Wisp": {}, "Choice Scarf": {}}},
  "Feraligatr": {"sets": {"Dragon Dance": {}}},
  "Politoed": {"sets": {"Rain Setter": {}}},
  "Quagsire": {"sets": {"Physically Defensive": {}}},
  "Espeon": {"sets": {"Choice Specs": {}, "Calm Mind": {}, "Choice Scarf": {}}},
  "Umbreon": {"sets": {"Wish Support": {}}},
  "Forretress": {"sets": {"Support": {}}},
  "Gligar": {"sets": {"Utility": {}}},
  "Kingdra": {"sets": {"Rain Sweeper": {}}},
  "Raikou": {"sets": {"Calm Mind": {}, "Offensive Pivot": {}}},
  "Entei": {"sets": {"Choice Band": {}}},
  "Suicune": {"sets": {"Calm Mind": {}}},
  "Swampert": {"sets": {"Defensive Utility": {}}},
  "Gardevoir": {"sets": {"Choice Scarf": {}}},
  "Breloom": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Flygon": {"sets": {"Choice Scarf": {}}},
  "Crawdaunt": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Milotic": {"sets": {"Defensive": {}}},
  "Salamence": {"sets": {"Special Attacker": {}, "Dragon Dance": {}}},
  "Jirachi": {
    "sets": {
      "Utility": {},
      "Offensive Calm Mind": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Jirachi provides speed control and offensive pivoting for many team structures. Defensively, Jirachi is a great team presence because of its great defensive typing and natural bulk, with 100 base stats across the board providing it with the longevity needed to switch into several attacks for its teammates. Iron Head is the most reliable STAB option for Jirachi to use since it has adequate base power, is neutral into a majority of the metagame, and boasts a high flinch rate. U-turn is a safe pivot move, allowing powerful partners to come in freely. Choice Scarf Jirachi uses Trick to hinder would-be checks like Amoonguss and Hippowdon, which can also greatly help teammates that struggle against these defensive walls like Revavroom and Terrakion. Healing Wish can give a second opportunity to a teammate that may otherwise not have enough health to get back into a game reliably. Using a Jolly nature with max Attack and Speed enables Jirachi to outspeed a majority of the tier, tying with other Choice Scarf users like Galarian Zapdos or Dragon Dance Salamence after a Speed boost. Tera Steel is run to maximize its damage output with Iron Head, which can allow Jirachi to potentially flinch its way through the opponent's physical wall, along with hitting several notable benchmarks like OHKOing Terrakion and 2HKOing Noivern and Galarian Zapdos.</p> <p>Choice Scarf Jirachi is primarily seen in offense and balance structures, where it can pack speed control, support, disruption, and a solid defensive profile into one slot. Jirachi is one of the best switch-ins to Fairy- and Poison-types in the tier, as well as having key resistances to Dragon- and Psychic-type attacks, making it a reliable option to take a Gardevoir or Fezandipiti Moonblast or Salamence Outrage. Teammates weak to Fairy-type moves, such as strong Dragon- or Fighting-types like Salamence and Terrakion, are grateful for Jirachi's presence on the team to fall back on. Taking advantage of Choice Scarf Jirachi's ability to hinder and chip at physically defensive walls like Amoonguss, Hippowdon, and Palossand, teammates such as Revavroom, Mimikyu, and Okidogi can position themselves to set up reliably. Teammates that lack recovery such as Armarouge and Galarian Zapdos can function as both mid-game breakers and late-game cleaners when paired with Healing Wish support from Jirachi.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Deoxys-Defense": {"sets": {"Utility": {}}},
  "Torterra": {"sets": {"Shell Smash Sweeper": {}}},
  "Infernape": {"sets": {"Physical Attacker": {}, "Nasty Plot": {}}},
  "Empoleon": {"sets": {"Specially Defensive": {}}},
  "Floatzel": {"sets": {"Choice Band": {}}},
  "Gastrodon": {"sets": {"Specially Defensive": {}}},
  "Bronzong": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Stealth Rock": {}, "Bulky Setup Sweeper": {}}},
  "Lucario": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Nasty Plot": {}}},
  "Hippowdon": {
    "overview": "<p>Hippowdon is one of the best physical walls in the tier, excelling thanks to its high base HP and Defense as well as the difficult to break pure Ground typing. Hippowdon has the best raw physical bulk compared to other physical walls such as Slowbro, Chesnaught, and Amoonguss. This bulk allows it to take neutral hits exceptionally well, making it a safe switch-in to unresisted moves like Terrakion’s Close Combat and Galarian Zapdos’s Brave Bird. As it is taking these hits, it is wearing foes  down through passive damage from the sand it summons. It also has many chances to switch in, giving it plenty of opportunities to set up Stealth Rock. Hippowdon is the anchor for most balance teams in the tier, putting in work and making progress in basically every game. However, Hippowdon can struggle with particularly strong wallbreakers like Choice Band Okidogi or Galarian Zapdos because does not resist their STAB attacks and struggles to take them effectively, and it is also vulnerable to passive damage such as entry hazards.</p>",
    "comments": "<p>Other Options</p> <p>====</p> <p>Certain teams such as ones with Pokemon running Synthesis or that have teammates that dislike passive sandstorm chip such as Alolan Muk and Suicune would prefer Sand Force, effectively giving it no ability. Sand Force also makes it easier to Terastallize Hippowdon, since it doesn’t have to worry about its own sandstorm and has a better matchup into other Hippowdon due to its stronger Earthquake. Hippowdon can also run varying amounts of Special Defense in order to better match up against special attackers — for example, 140 Special Defense EVs to survive two Photon Geysers from Necrozma  — but Hippowdon often relies on maximum physical bulk to take neutral physical attacks.</p> <p>Checks and Counters</p> <p>====</p> <p><strong>Ground-immune Pokemon</strong>: Mono-Earthquake Hippowdon is unable to hit Ground-immune foes at all, making Rotom-H, Thundurus, Salamence, and Noivern incredibly safe switch-ins to it.</p> <p><strong>Grass-types</strong>: Hippowdon with Stone Edge can hit Ground-immune foes but can't do any real damage to Grass-types such as Chesnaught.</p> <p><strong>Special Attackers</strong>: Hippowdon's low Special Defense and reliance on Defense investment means it is vulnerable to special attacks even from uninvested attackers. Pokemon like Gengar and Gardevoir are attackers that Hippowdon does not want to switch in on, and bulky Pokemon with decent special damage such as Slowbro and Reuniclus are able to take Hippowdon's Earthquakes and threaten it in return.</p> <p><strong>Wallbreakers with Entry Hazard Support</strong>: Pokemon like Choice Band Okidogi, Terrakion, and Mienshao can overcome Hippowdon's raw physical bulk with the help of chip damage such as hazard support. Okidogi's Close Combat is favored to 2HKO Hippowdon from full with Stealth Rock up and is guaranteed to 2HKO with a single layer of Spikes.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Set Details</p> <p>===</p> <p>The tier is full of threatening physical attackers, and Hippowdon handles most of them with ease, switching into attacks from Pokemon like Terrakion, Revavroom, Kleavor, Krookodile, Maushold, and Bisharp. Hippowdon's sand provides passive damage and helps disarm other weather teams by removing their weather. Stealth Rock is the most common option, as Hippowdon makes a good setter due to its many chances to switch in and good matchup against Cyclizar, the tier's best spinner. Whirlwind gives Hippowdon the option to force out setup sweepers or rack up chip damage against foes trying to switch into Earthquake. Whirlwind is preferred over Roar due to Throat Chop Bisharp blocking the latter move. Stone Edge is a coverage  option to hit Flying-types trying to switch into the normally passive Hippowdon, allowing it to turn the tables on matchups like Thundurus or Noivern. Stone Edge also helps to break Air Balloon on Pokemon such as Revavroom that try to turn Hippowdon into a setup opportunity. Rocky Helmet is the most common item due to its importance in dealing with Maushold, a Pokemon that can otherwise threaten to sweep teams on its own, while also providing chip damage against physical attackers. However, teams with other answers to Maushold or that don’t need the passive damage can instead run Leftovers or Heavy-Duty Boots. Tera Ghost is an all-around strong defensive type that blocks Rapid Spin from Cyclizar, allows it to take on Terrakion even after a Swords Dance boost, and beats other Fighting types like Conkeldurr and Slither Wing. Tera Dragon removes Hippowdon's weaknesses to Grass and Water, being especially helpful against rain teams. Tera Poison gives Hippowdon a resistance to Grass, Fairy, and Fighting and makes Hippowdon immune to Toxic and able to absorb Toxic Spikes, being useful on teams that are otherwise weak to them.</p> <p>Hippowdon is common on bulky offense and balance teams. However, Hippowdon’s weaknesses must be accounted for in teambuilding, especially when considering the set it runs. Whirlwind Hippowdon needs to be paired with something that can handle Ground immune Pokemon like Noivern, Thundurus, and Rotom-H well. Assault Vest Cyclizar and Rotom-H are two Pokemon that can safely switch into them. While Hippowdon is able to switch into strong Fighting-type attacks from Pokemon like Terrakion and Mienshao when fully healthy, it loses this resilience with even just a little bit of chip damage. Therefore, Hippowdon should be paired with a more sturdy Fighting resistant Pokemon such as Slowbro or Reuniclus. Hippowdon without Whirlwind may require extra support for physical setup sweepers. Choice Scarf users faster than Salamence, such as Mienshao, Terrakion, Gengar, and Hisuian Zoroark, can all fill this role. Non-Stealth Rock Hippowdon should be paired with another Stealth Rock setter such as Empoleon or Jirachi.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598717, "username": "Sneakyplanner"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 614438, "username": "fluff!!"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Toxicroak": {"sets": {"Swords Dance": {}}},
  "Magnezone": {"sets": {"Choice Specs": {}, "Assualt Vest": {}}},
  "Yanmega": {"sets": {"Speed Boost Sweeper": {}}},
  "Porygon-Z": {"sets": {"Choice": {}}},
  "Froslass": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Spikes Lead": {}}},
  "Rotom-Heat": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Azelf": {"sets": {"Expert Belt": {}, "Choice Scarf": {}, "Offensive Stealth Rock": {}}},
  "Cresselia": {"sets": {"Bulky Calm Mind": {"description": "<p>136 Speed EVs allows Cresselia to outspeed Modest Volcanion.</p>"}, "Fast Calm Mind": {"description": "<p>216 Speed EVs with Timid Nature allows Cresselia to outspeed Max Speed positive nature Hoopa-Unbound.</p>"}}},
  "Conkeldurr": {"sets": {"Guts Wallbreaker": {}}},
  "Krookodile": {"sets": {"Choice Scarf": {}, "Stealth Rock": {}, "Bulk Up": {}, "Choice Band": {}}},
  "Zoroark-Hisui": {"sets": {"Choice": {}, "Nasty Plot": {}}},
  "Cinccino": {"sets": {"Tidy Up": {}}},
  "Reuniclus": {
    "sets": {
      "Calm Mind": {},
      "Defensive Pivot": {
        "description": "<p>Defensive Reuniclus finds a place in a metagame lacking phenomenal Dark-types outside of Krookodile and Bisharp and with a myriad of Fighting- and Psychic- types such as Okidogi, Mienshao, and Slowbro. Its bulk and typing allow it to continuously switch into the aforementioned Fighting- and Psychic-types' moves and weaken the opposition while staying healthy with a combination of Recover and Regenerator. It can also act as a crucial member of teams relying on paralysis that enjoy its resistance to Fighting as well as its ability to invite in the likes of Bisharp and Jirachi and cripple them with Thunder Wave. Despite being in competition with Slowbro, Reuniclus's Electric neutrality as well as higher special bulk make it sometimes worth using over Slowbro. Thunder Wave makes it easier for wallbreakers like Volcanion, Okidogi, and Crawdaunt to shine. Psychic Noise is used over the stronger Psychic and Psyshock due to the recovery blocking effect. Knock Off is another excellent support move that forces progress by removing the bevy of Heavy-Duty Boots and Leftovers. Focus Blast can be used over Knock Off to deal with Krookodile and Bisharp as well as smacking Empoleon. Tera Water gives Reuniclus an excellent defensive matchup against rain teams and strong Water-type attacks from offensive threats such as Barraskewda, Blastoise, and Volcanion while also removing the weakness to Bug- and Dark-type attacks like U-turn and Knock Off. Tera Fairy turns the aforementioned weaknesses into resistances, gives a Dragon-type immunity against strong threats like Salamence and Noivern, and is generally a good defensive Tera type for a bulkier Pokemon like Reuniclus.</p> <p>Reuniclus fits best on balance and bulky offense teams that enjoy its ability to switch into the myriad of Fighting-type moves in the tier and slow down and soften the opposition with Thunder Wave and Knock Off, respectively. Volcanion and Crawdaunt are great offensive partners for Reuniclus, as they enjoy Reuniclus's ability to slow down the opposition. Fighting-types such as Slither Wing and Okidogi make great offensive and defensive partners for Reuniclus. On the offensive side, they enjoy Reuniclus's Thunder Wave support and its Psychic resistance, while on the defensive side they resist the omnipresent Knock Off and U-turn. Reuniclus also enjoy Palossand, Fezandipiti, Chesnaught and other Fighting-type checks due to its crippling weakness to Knock Off and U-turn. Palossand and Chesnaught are also excellent entry hazard setters and enjoy Reuniclus's Knock Off support. However, since this Reuniclus set doesn't use Magic Guard, it enjoys hazard-removing partners like Cyclizar.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 563264, "username": "Forest Guardian"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 513635, "username": "Rarelyme"}, {"user_id": 231398, "username": "feen"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Amoonguss": {"sets": {"Defensive": {}}},
  "Mienshao": {"sets": {"Life Orb": {}, "Choice Scarf": {}}},
  "Bisharp": {"sets": {"Swords Dance": {}}},
  "Terrakion": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Stealth Rock": {}}},
  "Thundurus": {"sets": {"Nasty Plot": {}, "Offensive Pivot": {}}},
  "Chesnaught": {"sets": {"Spikes": {}}},
  "Talonflame": {"sets": {"Utility": {}}},
  "Dragalge": {"overview": "<p>The tier is still in its infancy and the metagame develops with each passing day. The sample set(s) provided below will be regularly updated until proper analyses are in the works. See it as a rough outline to get started and accustomed to what sets are commonly used.</p>", "sets": {"Utility": {"description": "<p>132 Speed EVs are to outrun uninvested Sylveon.</p>"}, "Choice Specs": {"description": "<p>172 Speed EVs are to outrun uninvested Umbreon and Vaporeon.</p>"}}},
  "Goodra-Hisui": {"sets": {"Choice Specs": {}}},
  "Klefki": {"sets": {"Spikes": {}}},
  "Noivern": {"sets": {"Offensive Pivot": {}}},
  "Diancie": {"sets": {"Stealth Rock": {}}},
  "Volcanion": {"sets": {"Offensive": {}}},
  "Incineroar": {"sets": {"Defensive Pivot": {}}},
  "Oricorio-Pom-Pom": {"sets": {"Quiver Dance Sweeper": {}}},
  "Lycanroc-Dusk": {"sets": {"Swords Dance": {}, "Choice Band": {}}},
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Salazzle": {"sets": {"Substitute + Toxic": {}, "Offensive": {}}},
  "Tsareena": {"sets": {"Rapid Spin": {}}},
  "Palossand": {"sets": {"Defensive": {}}},
  "Mimikyu": {"sets": {"Swords Dance": {}}},
  "Necrozma": {"sets": {"Stealth Rock": {}, "Offensive Trick Room": {}, "Dragon Dance": {}}},
  "Inteleon": {"sets": {"Choice Specs": {}}},
  "Barraskewda": {"sets": {"Rain Sweeper": {}}},
  "Toxtricity": {"sets": {"Wallbreaker": {}, "Offensive Pivot": {}, "Shift Gear": {}}},
  "Regidrago": {"sets": {"Choice Specs": {}, "Dragon Dance": {}, "Choice Scarf": {}}},
  "Kleavor": {"sets": {"Lead": {}, "Choice Scarf": {}}},
  "Basculegion-F": {"sets": {"Choice Scarf": {}, "Choice Specs": {}, "Rain Wallbreaker": {}}},
  "Overqwil": {"sets": {"Rain Sweeper": {}, "Defensive": {}}},
  "Maushold": {"sets": {"Tidy Up": {}}},
  "Maushold-Four": {"sets": {"Tidy Up": {}}},
  "Armarouge": {"sets": {"Calm Mind": {}, "Weakness Policy": {}}},
  "Bellibolt": {"sets": {"Mr. Belli (Defensive)": {}}},
  "Kilowattrel": {"sets": {"Offensive Pivot": {}}},
  "Revavroom": {
    "overview": "<p>Shift Gear Revavroom is one of the most threatening late-game sweepers in the tier, as with its access to Shift Gear and great defensive typing, all it needs is one boost to offensively overwhelm most of the tier. Setting up is made easier with its ability, Filter, which allows it to take a Flamethrower from Pokemon like Galarian Weezing and Noivern. Revavroom also has access to useful coverage moves that allow it to threaten Steel-, Poison-, and Fire-types. Nevertheless, Revavroom is quite frail, as its poor Special Defense and reliance on Air Balloon to set up can be exploited by Ground-types, especially Hippowdon, Krookodile, Quagsire, and Palossand, as they can take a +1 hit from full HP and OHKO it back.</p>",
    "comments": "<h3>Other Options</h3> <p>Revavroom can opt to run Tera Blast Grass, which threatens Water- and Ground-types such as Slowbro, Quagsire, Hippowdon, and Krookodile. Temper Flare is also an option to take down Steel-types with a Ground immunity such as Bronzong and Tera Steel Rotom-H, as well as helping against opposing Revavroom. Temper Flare can also be boosted with Tera Fire, making Revavroom immune to burn. Finally, Taunt is a solid option to completely wall and set up on Quagsire and Whirlwind Hippowdon with Air Balloon as well as to block Will-O-Wisp from Galarian Weezing. Tera Flying + Taunt is a good combination to completely shut down Whirlwind Hippowdon and Quagsire even after Air Balloon breaks. Revavroom can also opt to run Leftovers + Magnet Rise to get rid of its Ground weakness and set up on Ground-types more easily. Clear Amulet can also be used to block Intimidate from Krookodile and Salamence. Toxic is an option to put bulky Fire- and Water-type switch-ins on a timer. Toxic Spikes allows Revavroom to take advantage of the free turns it generates. Toxic and Toxic Spikes could be used on a Choice Scarf Revavroom set, which could be a decent source of role compression also capable of pivoting using Parting Shot.</p> <h3>Checks and Counters</h3> <p><strong>Levitate Steel-types</strong>: Steel-types with Levitate are immune to Gunk Shot and High Horsepower and resist Iron Head. As such, Pokemon such as Bronzong and Tera Steel Rotom-H are the sturdiest answers to Revavroom.</p> <p><strong>Bulky Ground-types</strong>: Revavroom fails to KO bulky Ground-types such as Hippowdon, Quagsire, and Palossand even after a Shift Gear boost, and they threaten to KO it.</p> <p><strong>Bulky Water-types</strong>: Bulky Water-types such as Slowbro, Quagsire, and Gastrodon deal with Revavroom quite well, potentially burning it with Scald in Slowbro's case or outright KOing it with Ground-type STAB moves in Quagsire and Gastrodon's cases. They do lose to Tera Grass variants, however.</p>",
    "sets": {
      "Shift Gear": {
        "description": "<h4>Set Details</h4> <p>Revavroom is a one-dimensional Pokemon that focuses solely on setting up with Shift Gear and sweeping the opposing team. With an Adamant nature, a single Shift Gear lets Revavroom outspeed all relevant Choice Scarf users. Revavroom has access to Gunk Shot and High Horsepower, which give it excellent coverage; Gunk Shot nearly or straight-out KOes defensive staples like Fezandipiti and Chesnaught after one Shift Gear, while High Horsepower hits Steel- and Poison-types, which resist or are immune to Gunk Shot. Iron Head gives it a reliable STAB move that also hits Ground-types. Tera Ground gives Revavroom an additional STAB move in High Horsepower, which allows it to grab crucial OHKOs such as Bisharp, Volcanion, and Fezandipiti after one Shift Gear boost.</p> <p>Revavroom is a staple on hyper offense teams, and its role is usually to clean late-game. Therefore, it prefers wallbreakers and other setup sweepers such as Terrakion, Basculegion-F, Shell Smash Blastoise, and Yanmega as partners. The usual gameplan with Revavroom is wearing down Steel- and Fire-types with it, allowing another sweeper such as Mimikyu or Blastoise to clean. The opposite is also true, as Blastoise and Yanmega can weaken bulky Ground- and Water-types for Revavroom to sweep late-game. Revavroom should usually be brought in after a teammate has been KOed to ensure that Air Balloon remains intact and it is at near full health, as it is frail defensively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231398, "username": "feen"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Cyclizar": {
    "sets": {
      "Assault Vest": {
        "description": "<p>Assault Vest Cyclizar can safely switch into most special attackers and provide opportunities for its teammates to enter the game thanks to U-turn. Rapid Spin clears entry hazards while also granting Cyclizar a boost to Speed, which helps it outspeed most Choice Scarf users in the tier like Gardevoir and Gengar. It also gives even a paralyzed Cyclizar the opportunity to pivot out of slower opponents like Empoleon and Hippowdon. Knock Off can hit the tier's Pyschic-types such as Reuniclus and Slowbro for decent damage while also threatening the frail Ghost-types like Gengar and Hisuian Zoroark. Draco Meteor can be used to hit physical walls like Hippowdon and Slowbro. Dragon Tail is great at forcing opposing setup sweepers like Cresselia and Slowbro out. Facade can take advantage of status like burn or paralysis that Cyclizar may be inflicted by throughout the course of a game from opposing Reuniclus, Slowbro, and Thundurus. Assault Vest helps with its otherwise low natural bulk, which is also helped significantly by Regenerator recovery. Timid maximum Speed Cyclizar is faster than the majority of the tier, and the bulk provided allows it to survive a +2 Modest Blastoise Ice Beam along with taking two Ice Beams or Sludge Waves from other threats such as Basculegion-F and Gengar, respectively. Tera Fairy flips Cyclizar's weakness to Dragon-type moves into an immunity and gives a resistance to Fighting-type moves, helping against opposing Cyclizar, Salamence, and Slither Wing. Tera Steel makes Cyclizar resistant to Fairy- and Ice-type moves from the likes of Gardevoir and Empoleon, respectively. Tera Ghost makes it immune to Normal-type, allowing it to stop Rapid Spin attempts from opposing Cyclizar, while adding an immunity to Fighting-type attacks as well.</p> <p>Assault Vest Cyclizar can reliably slot onto balance or bulky offense teams as the main form of entry hazard removal while also providing item removal and pivoting. It can also be used on stall teams, though these structures often want another hazard removal option such as Defog Talonflame to reliably maintain hazard control. Cyclizar pairs well with other Regenerator Pokemon such as Amoonguss, Mienshao, and Slowbro, creating teams that are very difficult to break offensively and can provide pressure through status, hazard chip, and gradual damage. Strong offensive teammates like Crawdaunt, Conkeldurr, and Volcanion appreciate Cyclizar giving them free entry points. While Cyclizar can often keep hazards off the field, it is advised to still run hazard-resilient or Heavy-Duty Boots teammates, such as Amoonguss, Hisuian Goodra, and Mienshao, since Cyclizar may struggle against teams with Ghost-types like Palossand or Mimikyu. Assault Vest Cyclizar can struggle to retain HP against hazard-stacking archetypes, being unable to remove hazards against teams utilizing Tera Ghost on their hazard setters. To mitigate this dynamic, Cyclizar relies on pivoting into teammates who can apply offensive pressure to deny hazards from being established, like Basculegion-F, Gardevoir, and Volcanion.</p>"
      },
      "Heavy-Duty Boots": {
        "description": "<p>While usually overshadowed by the more prevalent Assault Vest set, running Heavy-Duty Boots on Cyclizar can offer meaningful benefits, allowing access to utility moves, while also making Regenerator more beneficial without needing to worry about the passive chip that comes with its usage as a spinner. Cyclizar is a master at providing utility for a team, boasting Knock Off to remove items from foes for other members of a team to take advantage of, with Heavy-Duty Boots users like Fezandipiti or Slowbro being great examples of Knock Off's usefulness over the course of a game. U-turn provides a way for Cyclizar to get out of sketchy matchups, being able to use the move safely against most of the tier with its phenomenal Speed stat. Taunt can shut down recovery or setup from foes that believe they can take advantage of the presumed passivity of Cyclizar, such as Hippowdon and Revavroom. Double-Edge can be slotted over Taunt if more damage is desired from Cyclizar, providing a harder-hitting STAB move than Rapid Spin, and its recoil is also somewhat negated with the HP gained back from Regenerator. Tera Ghost provides a last ditch-effort of escape against Fighting-types, one of Cyclizar's sketchier matchups, which is especially prevalent with the large amount of Fighting-type moves present in the tier, like Close Combat from various abusers including Okidogi and Zapdos-Galar; however, Cyclizar is generally the last thing you want to Terastalize unless in truly dire straits, as Terastallization is usually far more effective and useful on other members of a team. Tera Ghost can also deny opposing spinners from removing entry hazards, keeping pressure on opposing teams throughout a game and additionally providing momentum through a wasted Rapid Spin.</p> <p>Heavy-Duty Boots Cyclizar fits on almost all team structures, with the main exception being hyper offense, as its role as a spinner with access to Regenerator makes it extremely reliable at removing entry hazards throughout the course of a game. To get the best use out of Cyclizar's utility, pairing it up with a Stealth Rock setter is extremely important, as Cyclizar's Knock Off makes opposing teams weaker to hazards; this can either be with allies like Hippowdon, or it can be run with Palossand on teams dedicated to hazard stacking. Additionally, pairing Cyclizar up with offensive options that can take advantage of the momentum that U-turn provides, with notable wallbreakers including Choice Band Okidogi and Volcanion being perfect teammates. Cyclizar is somewhat frail by itself, so pairing it up with defensive presences like the aforementioned physically defensive Stealth Rock setters, along with more specially defensive options like Empoleon, creates strong defensive cores that can be difficult to break and can wear down teams through a war of attrition. These defensive cores can be furthered with Regenerator cores, constantly keeping teammates healthy throughout a match, with notable teammates being Amoonguss, Slowbro, Mienshao, and Reuniclus. Pairing Cyclizar up with multiple Heavy-Duty Boots users is also wise, as it can have problems against dedicated spinblockers, with Palossand on hazard-stacking teams and Mimikyu on hyper offense builds.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 633048, "username": "HoopsspooH"}, {"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 614438, "username": "fluff!!"}, {"user_id": 513635, "username": "Rarelyme"}, {"user_id": 555741, "username": "MachJacob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Slither Wing": {"sets": {"Bulky Pivot": {}, "Choice Band": {}}},
  "Wo-Chien": {"sets": {"Leech Seed": {}, "RestTalk": {}}},
  "Okidogi": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Munkidori": {"sets": {"Offensive Pivot": {}, "Choice Scarf": {}}},
  "Fezandipiti": {
    "overview": "<p>Despite its mediocre offensive stats, Fezandipiti leverages its excellent bulk, good defensive typing, and signature Toxic Chain ability to be a threatening late-game cleaner while also serving as a solid part of its team's defensive backbone. Fezandipiti's 4x resistance to Fighting makes it an excellent answer to Pokemon like Mienshao and Slither Wing, and its immunity to Dragon and great Special Defense make it a great switch-in to Salamence and Noivern, all of which it can take advantage of to set up Calm Mind or fire off its Toxic-spreading attacks. Fezandipiti does have several weaknesses to common types in the tier, however, like the Ground-type Hippowdon and Swampert and the Psychic-type Gardevoir and Armarouge, all of which are able to survive a Moonblast and threaten Fezandipiti back with super effective attacks. There are many Calm Mind users that Fezandipiti can thrive against such as Suicune and Raikou, but Covert Cloak Slowbro and Magic Guard Reuniclus can reliably win the matchup unless Fezandipiti Terastallizes into an advantageous type and uses Taunt to prevent them from boosting.</p>",
    "comments": "<h3>Other Options</h3> <p>Heat Wave allows Fezandipiti to hit the Steel-types that typically wall it for super effective damage, reducing its reliance on teammates to answer them. Nasty Plot boosts Fezandipiti's Special Attack faster than Calm Mind, making it a more immediate threat with maximum Special Attack and Speed EVs as well as Heat Wave. Fezandipiti has other options for Tera types, such as Steel, which allows it to resist Terrakion's Stone Edge and Gardevoir's Psychic. Tera Electric grants Fezandipiti resistances to Thundurus's Thunderbolt and Galarian Zapdos's Brave Bird while also making it immune to the paralysis inflicted by Jirachi and Thundurus. Fezandipiti also has the option to drop Calm Mind and run more bulk to take a utility role with moves such as Toxic, which is more reliable than Toxic Chain, and Alluring Voice, which is weaker than Moonblast but can punish faster setup sweepers.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Steel-types like Empoleon, Magnezone, and Revavroom resist Moonblast, are immune to being poisoned, and can threaten Fezandipiti with super effective STAB moves.</p> <p><strong>Poison-types</strong>: Poison-types like Amoonguss and Tentacruel resist Moonblast, cannot be poisoned, and can use disruptive moves like Clear Smog and Haze to remove Fezandipiti's boosts. Galarian Slowbro can use Psyshock to get around Fezandipiti's Calm Mind boosts.</p> <p><strong>Fast Physical Attackers</strong>: Physical threats like Terrakion and Galarian Zapdos as well as Choice Scarf users like Krookodile and Okidogi can outspeed Fezandipiti and deal significant damage to it or KO if it is not healthy enough.</p> <p><strong>Jirachi</strong>: Jirachi in particular is a threat to Fezandipiti due to a combination of its Steel typing, good stats, and variety of disruptive tools. Flinches from super effective Iron Head, paralysis from Body Slam and Thunder Wave, Psychic Noise, Encore, and Trick can all stop an unprepared Fezandipiti in its tracks. Calm Mind Jirachi also beats non-Taunt Fezandipiti, and Doom Desire and Future Sight can prevent a safe entry.</p>",
    "sets": {
      "Fast Calm Mind": {
        "description": "<h4>Set Details</h4> <p>Roost is used to keep Fezandipiti's HP high while it sets up. U-turn allows Fezandipiti to pivot out of unfavorable matchups while potentially applying Toxic thanks to its ability. Taunt is used to prevent opposing Pokemon from using their own setup or healing moves, taking advantage of Fezandipiti's Speed to act first and deny its foe the chance to move. Heavy-Duty Boots prevents Fezandipiti from being worn down by entry hazards, improving its longevity. Covert Cloak is primarily used to protect Fezandipiti from Jirachi's Iron Head flinches and Body Slam paralysis as well as Psychic Noise from Slowbro and Reuniclus after Terastallizing, but it also appreciates the effect on moves such as Gardevoir's Moonblast and Salamence's Hurricane. With a Timid nature and 200 Speed EVs, Fezandipiti is fast enough to outspeed Krookodile, which threatens it with strong STAB Earthquake but is vulnerable to Fezandipiti's Moonblast. Terastallizing into the Water-type turns Fezandipiti's Steel weakness into a resistance, allowing it to better take on foes like Jirachi, Hisuian Goodra, and Bisharp, and its lack of weaknesses allows Fezandipiti to survive most neutral hits from other threats. Tera Fairy removes Fezandipiti's Ground and Psychic weaknesses, giving it better matchups against Pokemon like Hippowdon and Reuniclus, while maintaining its important resistances to Fighting and Dark so it can still to switch into Close Combat and Knock Off from Pokemon like Okidogi, Mienshao, Slither Wing, and Crawdaunt. The damage boost from Tera Fairy also guarantees that Moonblast can OHKO Pokemon like Galarian Zapdos, Krookodile, and Terrakion after one Calm Mind.</p> <p>Fezandipiti fits best on balance or bulky offense teams that can chip its checks down across the game and enable a sweep. Knock Off from Cyclizar, Mienshao, and Galarian Zapdos can remove Leftovers from Jirachi and Empoleon to make the lower damage of Fezandipiti's attacks more meaningful as well as Covert Cloak from Slowbro, allowing Toxic Chain to affect it. Fezandipiti benefits from a VoltTurn core with teammates like Cyclizar, Slither Wing, and Magnezone, and it can join in if running U-turn. Magnet Pull Magnezone is a useful teammate, capable of forcing damage onto Steel-types like Bisharp and Jirachi that Fezandipiti can struggle to break through, and U-turn pivoting can ensure Magnezone is able to attack these targets. Fezandipiti works best with teammates that can take the super effective Ground-, Psychic-, and Steel-type attacks that threaten it, such as Noivern, Slowbro, and Empoleon. The Pokemon that want to switch in against Fezandipiti are often vulnerable to Spikes, as Jirachi and Hisuian Goodra lack reliable recovery and typically run items other than Heavy-Duty Boots, so setters such as Chesnaught, Klefki, and Quagsire are valuable.</p>"
      },
      "Pivot": {}
    },
    "credits": {"writtenBy": [{"user_id": 555741, "username": "MachJacob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 598717, "username": "Sneakyplanner"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  }
}