{
  "Charizard": {"sets": {"Special Attacker": {}}},
  "Sandslash": {"sets": {"Defensive Spinner": {}}},
  "Sandslash-Alola": {"sets": {"Defensive Spinner": {}}},
  "Arcanine": {"sets": {"Curse": {}}},
  "Poliwrath": {"sets": {"Bulk Up": {}}},
  "Slowbro-Galar": {
    "sets": {
      "Defensive": {},
      "Assault Vest": {"description": "<p>4 Special Attack EVs ensure that Shell Side Arm is always a special attack and thus makes no contact unless the foe has lower Defense. The bulk investment lets Galarian Slowbro tank +2 Wave Crash from Paldean Tauros-W after Stealth Rock while maximizing its Special Defense. Alternatively, Galarian Slowbro can run an EV spread of 248 HP / 16 Def / 4 SpA / 240 SpD to tank two successive Boombursts from Throat Spray Toxtricity while still hitting a jump point in Defense.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Calm Mind": {"description": "<p>Psyshock is better for dealing with special walls like Gastrodon and Goodra as well as opposing Calm Mind users, but Psychic can be used to deal with physical walls like Mudsdale and opposing Galarian Slowbro. Sludge Bomb is another option that can help Galarian Slowbro wear down nuisances like Delphox, Wo-Chien, and Bombirdier. Flamethrower nails Steel-types like Alolan Sandslash, Bronzong, and Tera Steel Paldean Tauros-W, while Surf hits Ground-types like Gligar hard and has good neutral coverage. Nasty Plot gives Galarian Slowbro more breaking power than Calm Mind but doesn't boost its Special Defense, making it easier for foes like Rotom-H and Tatsugiri to overwhelm.</p> <p>Sample set. Stay tuned for updates!</p>"}
    }
  },
  "Dodrio": {"sets": {"Swords Dance": {}, "Choice": {}}},
  "Muk": {"sets": {"Utility": {}}},
  "Electrode-Hisui": {"sets": {"Pivot": {}}},
  "Exeggutor-Alola": {"sets": {"Choice Specs": {}, "Eject Pack": {}}},
  "Weezing": {"sets": {"Physically Defensive": {}}},
  "Rhydon": {"sets": {"Stealth Rock": {}, "Offensive Swords Dance": {"description": "<p>Megahorn is a niche option that hits Wo-Chien and Uxie harder than Heat Crash while being more reliable against Alolan Exeggutor. However, it is generally less useful coverage than Heat Crash, since it's worse against Bronzong and Hisuian Decidueye.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Scyther": {"sets": {"Swords Dance": {}, "Pivot": {}}},
  "Tauros-Paldea-Blaze": {"sets": {"Bulk Up": {}, "Choice": {}}},
  "Tauros-Paldea-Aqua": {"sets": {"Bulk Up": {}, "Choice": {}}},
  "Jolteon": {"sets": {"Calm Mind": {}}},
  "Snorlax": {"sets": {"Tank": {}, "Curse": {}}},
  "Articuno-Galar": {"sets": {"Offensive Pivot": {}}},
  "Lanturn": {"sets": {"Defensive Pivot": {"description": "<p>36 Speed EVs allow Lanturn to outspeed Sandaconda. While Volt Absorb is generally the better ability, Water Absorb is viable on teams that are particularly weak to Water-types like Floatzel.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Gligar": {"sets": {"Physically Defensive": {"description": "<p>With the Special Defense investment, Gligar avoids the 2HKO from Rotom-C’s Leaf Storm after Stealth Rock. 16 Speed EVs let Gligar outrun Adamant Golurk.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Heracross": {"sets": {"Wallbreaker": {}}},
  "Sneasel": {"outdated": true, "sets": {"Swords Dance": {"description": "<p>Life Orb compensates for Sneasel’s naturally middling damage output and makes taking its hits more difficult. Eviolite augments Sneasel’s bulk, which can translate to setup opportunities against threats like Morpeko. However, both options are generally less consistent than Heavy-Duty Boots, which lets Sneasel freely switch in and out to wear foes down or revenge kill weakened targets like Skuntank and Tauros. Tera Ghost makes Sneasel immune to Fighting-type attacks from the likes of Hisuian Sneasel and Passimian, allowing it to either retaliate with a strong attack or set up on them.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Band": {}}},
  "Hitmontop": {"sets": {"Rapid Spin": {}}},
  "Sceptile": {"sets": {"Terrain Sweeper": {}, "Special Attacker": {}}},
  "Hariyama": {"sets": {"Bulk Up": {}, "Assault Vest": {}, "Belly Drum": {}}},
  "Grumpig": {"sets": {"Nasty Plot": {"description": "<p>Grumpig is not viable in PU, but this is considered its best set.</p> <p>136 Speed EVs let Grumpig outspeed Modest Glaceon. 44 SpA EVs allow unboosted Tera Ground Grumpig to KO offensive Skuntank with Earth Power after Stealth Rock damage.</p>"}}},
  "Altaria": {"sets": {"Defensive Defog": {}}},
  "Milotic": {"sets": {"Physically Defensive": {"description": "<p>Haze more reliably stops setup sweepers, but Dragon Tail can’t be blocked by Taunt and helps rack up chip damage if entry hazards are up. Flip Turn can be used to generate momentum for a teammate, but opting for it leaves Milotic totally helpless against either Grass-, Dragon-, and Water-types or setup sweepers.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Regirock": {"sets": {"Stealth Rock": {}}},
  "Staraptor": {"sets": {"Choice": {"description": "<p>Quick Attack should only be used on Choice Band Staraptor, since the move is pitifully weak otherwise. In addition, Choice Scarf Staraptor is fast enough already and really needs the coverage that Close Combat offers.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Floatzel": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Gastrodon": {"sets": {"Specially Defensive": {}}},
  "Ambipom": {"sets": {"Offensive Pivot": {}}},
  "Mismagius": {"sets": {"Nasty Plot": {}, "Choice": {}}},
  "Skuntank": {"sets": {"Utility": {"description": "<p>Memento can support setup sweepers like Paldean Tauros-W and Oricorio-G, which hyper offensive teams especially appreciate. Toxic is an option over Taunt to more quickly wear down walls like Mudsdale, Bellibolt, and physically defensive Gastrodon. Toxic Spikes punish teams that are mostly grounded or lack Heavy-Duty Boots, though it can be inconsistent with how common Poison-types, notably Galarian Slowbro, Salazzle, and opposing Skuntank, are.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Scarf": {}}},
  "Bronzong": {"sets": {"Utility": {"description": "<p>Trick should only be used in tandem with Toxic Orb to punish foes like Wo-Chien on the switch. Heatproof is better if Bronzong's team is particularly weak to Delphox and Salazzle.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Bulky Setup Sweeper": {}}},
  "Toxicroak": {"sets": {"Nasty Plot": {}, "Swords Dance": {}, "Choice": {}}},
  "Froslass": {"sets": {"Spikes Lead": {}, "Utility": {}, "Choice Band": {}}},
  "Rotom-Heat": {"sets": {"Nasty Plot": {}}},
  "Rotom-Mow": {"sets": {"Choice Scarf": {}, "Utility": {}}},
  "Uxie": {"sets": {"Utility": {}, "Terrain Sweeper": {}}},
  "Mesprit": {"sets": {"Setup Sweeper": {"description": "<p>Substitute allows for easier setup against passive foes like Sandaconda. Thunderbolt offers strong neutral coverage and stops Steel-types like Registeel and Alolan Sandslash from walling Mesprit. Shadow Ball is weaker than Thunderbolt but hits Bronzong super effectively. Mesprit should only use Grassy Seed if it's being paired with Thwackey.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Scarf": {}, "Choice Specs": {}, "Utility": {}}},
  "Emboar": {"sets": {"Wallbreaker": {}, "Choice Scarf": {}}},
  "Whimsicott": {"sets": {"Choice Specs": {"description": "<p>Shadow Ball threatens Delphox and Bronzong and hits Alolan Sandslash slightly harder than Moonblast. Pranskter should only be used alongside Switcheroo, since this makes the move better at disrupting teams.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Scrafty": {"sets": {"Bulky Dragon Dance": {"description": "<p>212 Speed EVs let +1 Scrafty outspeed Flamigo. This is particularly important against Choice Scarf Flamigo, which will likely switch into Scrafty’s Knock Off. An EV spread of 252 Atk / 4 Def / 252 Spe with a Jolly nature can be used to make Scrafty more immediately threatening at the cost of bulk and longevity.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Bulk Up": {}}},
  "Zoroark": {"sets": {"Choice Specs": {}, "Choice Scarf": {}, "Nasty Plot": {}, "Swords Dance": {}}},
  "Golurk": {
    "sets": {
      "Choice Band": {
        "description": "<p>Golurk is a potent wallbreaker with limited switch-ins thanks to its incredible STAB combination, which is resisted by only a few Pokemon in the tier. Golurk excels at dismantling common defensive cores thanks to its high Attack and great typing, which let it switch into and force out defensive staples like Galarian Slowbro and Bellibolt. Dynamic Punch lets Golurk 2HKO Wo-Chien while also hitting other Dark- and Normal-types like Scrafty and Snorlax and threatening confusion against everything else. Close Combat can be used as an alternative due to its higher Base Power, which lets it guarantee a 2HKO on Wo-Chien after Leech Seed recovery; however, Golurk misses out on the confusion, and the Defense and Special Defense drops make it more susceptible to being revenge killed. Ice Punch lets Golurk OHKO Bombirdier and Staraptor while also serving as a good middle ground into Gligar. Stone Edge can be used as an alternative that's stronger versus neutral targets and has a higher chance to land a critical hit; although, Golurk loses out on the ability to deal with Gligar. Tera Dark flips Golurk's Ghost and Dark weaknesses while also removing its Water and Ice weaknesses, allowing it to avoid revenge kill attempts from Pokemon like Skuntank, Bombirdier, and opposing Golurk. Tera Ghost can be used instead to further boost Golurk's power, letting it 2HKO Pokemon like Gligar and guaranteeing OHKOs against Pokemon like Rotom-H with Poltergeist while still removing its susceptibility to Water- and Ice-type moves to avoid revenge killing attempts from Pokemon like Paldean Tauros-W.</p> <p>Golurk works best alongside Pokemon that benefit from its wallbreaking abilities such as Choice Scarf Staraptor and Curse Arcanine, which struggle with Bellibolt and Gastrodon, respectively. While Golurk has the coverage to hit the likes of Staraptor, Bombirdier, and Wo-Chien, their presence on the opposing team hurts its ability to freely use its STAB moves and forces it to make more predictions, so teammates that can handle these Pokemon like Bellibolt, which checks Staraptor and Bombirdier, and Paldean Tauros-F, which helps against Wo-Chien, make excellent partners. Furthermore, Paldean Tauros-F offensively and defensively checks the Dark-types that threaten Golurk, and other Fighting-types like Paldean Tauros-W and Flamigo are similarly good partners for this purpose. Golurk is also forced out by Water- and Grass-types, so teammates that can switch into these Pokemon, like Milotic and Gastrodon for Inteleon and Tatsugiri as well as Skuntank for Decidueye, are incredible partners for Golurk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626934, "username": "Morge"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 414072, "username": "Hera"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "sapphiree"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Braviary-Hisui": {"sets": {"Agility": {}}},
  "Virizion": {"sets": {"Swords Dance": {"description": "<p>Stone Edge can be used instead of Zen Headbutt to nail Flying-types like Articuno and Charizard; it also hits foes like Decidueye and Vikavolt harder. However, without Zen Headbutt, Virizion is helpless against defensive Poison-types like Vileplume and Tera Poison users like Wo-Chien.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Calm Mind": {}}},
  "Meloetta": {"sets": {"Choice Specs": {}, "Choice Scarf": {}, "Assault Vest": {}}},
  "Delphox": {"sets": {"Nasty Plot": {}}},
  "Florges": {"sets": {"Wish": {}, "Calm Mind": {"description": "<p>Tera Blast Ground lets Florges break through Galarian Slowbro and Steel- and Fire-types like Heatproof Bronzong and Delphox, though Florges should run Tera Poison if it doesn’t use Tera Blast. The Speed investment lets Florges outrun Adamant Golurk as well as opposing walls, notably Gligar, Wo-Chien, and Milotic.</p> <p>Sample set. Stay tuned for updates.</p>"}, "Choice Scarf": {}}},
  "Clawitzer": {"outdated": true, "sets": {"Choice Specs": {"description": "<p>Aura Sphere 2HKOes Cryogonal and threatens common Tera Steel users like Poliwrath and Appletun. Dark Pulse hits Pokemon like Farigiraf, Veluza, and Trevenant harder than Clawitzer's other moves while also being decent neutral coverage. A Modest nature is generally preferred to maximize Clawitzer’s damage output, but a Timid nature can be used to outspeed threats like defensive Articuno. Tera Dragon further powers up Dragon Pulse and helps against Grass- and Electric-types like Arboliva and Rotom.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Goodra": {"sets": {"Heavy-Duty Boots": {}, "Choice Specs": {}}},
  "Avalugg-Hisui": {"sets": {"Entry Hazard Lead": {}, "Offensive": {}}},
  "Hoopa": {"sets": {"Choice": {}, "Substitute": {}}},
  "Decidueye": {"sets": {"Defensive Defog": {}, "Physical Attacker": {"description": "<p>Decidueye should use Spirit Shackle if it’s being paired with Knock Off users to increase its reliability. Knock Off punishes bulky foes like Dudunsparce and Braviary on the switch, though STAB coverage in Leaf Blade and pivoting are both generally more useful.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Swords Dance": {"description": "<p>Decidueye should use Spirit Shackle if it’s being paired with Knock Off users to increase its reliability. Knock Off punishes bulky foes like Dudunsparce and Braviary on the switch, though STAB coverage in Leaf Blade and pivoting are both generally more useful.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Decidueye-Hisui": {"sets": {"Defensive Defog": {}, "Choice Band": {}}},
  "Lycanroc": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Entry Hazard Lead": {}}},
  "Mudsdale": {"sets": {"Stealth Rock": {"description": "<p>Body Press lets Mudsdale fully capitalize on Stamina and makes trading with physical attackers like Scrafty and Tera Normal Arcanine easier. Heavy Slam hits most Flying-types neutrally and deals more damage to Florges and Scream Tail than Earthquake. Stone Edge nails Flying-types like Kilowattrel as well as Rotom-H.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Salazzle": {"sets": {"Offensive": {}, "Nasty Plot": {}}},
  "Palossand": {"sets": {"Physically Defensive": {"description": "<p>Scorching Sands generally shouldn't be used alongside Sludge Bomb. Doing so makes Palossand more prediction reliant to avoid inducing foes like Wo-Chien with the less useful status.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Minior": {"sets": {"Shell Smash": {}}},
  "Bruxish": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Swords Dance": {}}},
  "Thwackey": {"outdated": true, "sets": {"Choice": {}}},
  "Inteleon": {"sets": {"Choice Specs": {}}},
  "Coalossal": {"sets": {"Defensive": {}}},
  "Sandaconda": {"sets": {"Stealth Rock": {}}},
  "Cramorant": {"sets": {"Defog": {"description": "<p>Tera Ground lets Cramorant turn the tables on Electric-types like Eelektross and Rotom, block Volt Switch, and potentially tank coverage moves like Hisuian Sneasel's Gunk Shot in a pinch. Tera Fairy is another option to deal with Tera Dragon Clawitzer as well as check Dark-types like Spiritomb. EV spreads with more physical bulk are also valid to improve Cramorant's matchup against foes like Floatzel, Tera Fighting Passimian, and Poliwrath.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Toxtricity": {
    "sets": {
      "Shift Gear": {
        "description": "<p>Toxtricity offers the liberty to swap between the roles of a Shift Gear cleaner and Throat Spray + Boomburst wallbreaker with the same set. Very few walls can take its Punk Rock-boosted attacks after Throat Spray activates––Ghost / Ground-type Pokemon like Golurk and Palossand being the only exceptions––making the likes of Gastrodon, Coalossal, and Assault Vest Galarian Slowbro shoddy switch-ins at best. This threat creates setup opportunities for Toxtricity, which can then outspeed most of the metagame at +2 and clean late-game. Tera Blast Ghost is its best coverage move, nailing would-be checks like Decidueye, Golurk, Palossand, and Bronzong; importantly, the defensive benefits of Tera Ghost include more setup opportunities for Toxtricity and immunity to common priority attacks from Ambipom and Arcanine. Alternatively, Tera Normal offers a nuke of a Boomburst that outright OHKOes foes like Bellibolt and Mudsdale at +1. This comes at the cost of running the weaker Snarl to hit Ghost-types, and while Snarl offers good coverage without Terastallizing, it fails to reliably OHKO any of the metagame's Ghost-types and also makes Toxtricity completely walled by Soundproof Pokemon like Hisuian Electrode. A last alternative is Sludge Bomb, and in the same vein as Snarl, it can be a stronger option versus some walls like Wo-Chien without having to use Tera Normal Boomburst, but it fails to address some targets such as Golurk and Palossand.</p> <p>Sweepers such as Paldean Tauros-W and Decidueye alleviate some offensive tension that Toxtricity suffers from by targeting foes that could otherwise check it like Golurk, Goodra, and Gligar. Knock Off users like Skuntank and Scrafty help wear down walls like Mudsdale and Bellibolt so that they are KOed by a +1 Boomburst late-game. Specially offensive Knock Off users like Goodra and Salazzle also work for weakening special walls like Galarian Slowbro and Gastrodon; the former is in OHKO range from +1 Boomburst after Stealth Rock if it loses its Assault Vest. Toxtricity is often vulnerable to priority attackers after it takes damage when setting up, so teammates like Paldean Tauros-F and Staraptor are valid checks to the likes of Skuntank and Decidueye, respectively. This way, Toxtricity can be preserved and return the favor to these physically offensive teammates by putting pressure on physical walls like Mudsdale and Milotic.</p>"
      },
      "Choice Specs": {
        "description": "<p>The raw power of Choice Specs, Punk Rock-boosted Boomburst, and strong STAB moves, with the option to be even stronger with Terastallization, is hard to stomach. That power, along with the opportunity to pivot with Volt Switch on the few checks Toxtricity has like Decidueye, makes Toxtricity an effective wallbreaker and pivot. Ghost-types like Golurk and Palossand are not safe switch-ins to Toxtricity given that Snarl 2HKOes them, albeit locking into Snarl can be prediction reliant. Sludge Bomb offers chances to OHKO walls like Wo-Chien and Florges, although its damage is equal to Tera Normal Boomburst and its coverage fails to nail anything notable bar Soundproof Hisuian Electrode. Due to relying heavily on prediction and Terastallization, this set sees less use and is harder to fit on teams in comparison to Toxtricity's Shift Gear set.</p> <p>One of Toxtricity's shortcomings is its frailty, so it relies on pivots such as Scyther, Staraptor, and Ambipom to get in safely. These teammates make an offensive VoltTurn core with Toxtricity, which returns the favor by positioning them through Volt Switch on some of its potential switch-ins like Decidueye and Galarian Slowbro. Dark-types like Bombirdier and Skuntank are necessary to punish opposing Ghost-types once Toxtricity is locked into Boomburst. Similarly, teammates such as Decidueye and Kilowattrel are important to defeat Ground-types like Gligar and Gastrodon. Toxtricity's wallbreaking can pave the way for specially offensive teammates like Calm Mind Scream Tail and Choice Scarf Florges to clean late-game. Spikes support from Alolan Sandslash and Qwilfish is noteworthy in supporting Toxtricity's wallbreaking, as a single layer of Spikes creates favorable chances to OHKO walls like Gastrodon and Assault Vest Galarian Slowbro with +1 Tera Normal Boomburst.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Grimmsnarl": {"sets": {"Bulk Up": {}}},
  "Alcremie": {"sets": {"Double Dance": {"description": "<p>If Alcremie is not being used on Grassy Terrain, it should hold Leftovers to maximize its recovery. 64 Speed EVs allow Alcremie to outspeed Sandaconda and Wo-Chien; this lets it attack before these foes can slow it down with Glare or either Leech Seed or Ruination, respectively.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Frosmoth": {"sets": {"Quiver Dance": {}}},
  "Duraludon": {"sets": {"Defensive": {}, "Choice": {}}},
  "Glastrier": {"sets": {"Swords Dance": {"description": "<p>Running more bulk investment is an option to make Glastrier harder to take down, which can be especially annoying for opponents if it opts for Substitute.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Calyrex": {"sets": {"Double Dance": {"description": "<p>Calyrex is not viable in PU, but this is considered its best set.</p> <p>The Speed investment lets +2 Calyrex outspeed Choice Scarf Alolan Dugtrio.</p>"}}},
  "Pawmot": {"sets": {"Offensive": {}}},
  "Naclstack": {"sets": {"Special Wall": {}}},
  "Bellibolt": {"sets": {"Physically Defensive": {}}},
  "Kilowattrel": {"sets": {"Offensive Pivot": {"description": "<p>Volt Absorb lets Kilowattrel serve as an effective check to Rotom-C, opposing Kilowattrel, Hisuian Electrode, and non-Ice Punch Pawmot. Competitive punishes Defog attempts from foes like Altaria and Scyther as well as Intimidate. Tera Ghost can be used to block Arcanine's Extreme Speed and, in tandem with Volt Absorb, help pivot around Toxtricity.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Grafaiai": {"sets": {"Utility": {}, "Terrain Sweeper": {"description": "<p>With 64 Speed EVs, +2 Grafaiai outspeeds Choice Scarf Floatzel and Hisuian Sneasel. Running less Speed is also viable if you want Grafaiai to be bulkier.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Scarf": {}}},
  "Bombirdier": {"sets": {"Offensive": {}}},
  "Orthworm": {
    "outdated": true,
    "sets": {
      "Coil": {"description": "<p>Iron Tail is stronger than Heavy Slam but less accurate before Orthworm uses Coil. Substitute is an option to protect Orthworm from status and weaker attackers as it sets up. The Speed investment lets Orthworm outrun Modest Clawitzer, but more Defense investment can be used if Clawitzer isn’t a concern. Tera Ghost helps against Fighting-types like Passimian and Hisuian Sneasel, but Tera Electric gives Orthworm no weaknesses due to Earth Eater.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Utility": {"description": "<p>Protect lets Orthworm scout and gain extra Leftovers recovery, while Coil reduces its passivity and also lets it serve as a wincon. Spikes is an option if Orthworm's team wants to set as many entry hazards as possible or already has a Stealth Rock user. Iron Defense boosts Body Press faster than Coil and also lets Orthworm more easily trade with physical attackers like Passimian and Floatzel. The Speed investment lets Orthworm outrun Modest Clawitzer, but more Defense investment can be used if Clawitzer isn’t a concern.</p> <p>Sample set. Stay tuned for updates!</p>"}
    }
  },
  "Houndstone": {"sets": {"Defensive": {"description": "<p>Rest and Sleep Talk should almost always be used alongside one another. While Houndstone can forgo Sleep Talk and gain an extra moveslot, this leaves it completely helpless while it's asleep. Poltergeist makes Houndstone less passive against foes like Lurantis but is generally less consistent than Night Shade due to its lower PP and accuracy. If Houndstone does use Poltergeist, though, it should run an Impish nature and maximum Attack IVs. Roar prevents bulky setup sweepers like Braviary, Poliwrath, and Farigiraf from exploiting Houndstone.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Offensive": {}}},
  "Flamigo": {"sets": {"Choice Scarf": {}, "Choice Band": {}}},
  "Tatsugiri": {"sets": {"Offensive": {}}},
  "Farigiraf": {"sets": {"Offensive Trick Room": {}, "Double Dance": {}, "Wish": {}}},
  "Dudunsparce": {"sets": {"Utility": {}, "Calm Mind": {"description": "<p>Serene Grace can be used to give Dudunsparce better odds of breaking through walls via Special Defense drops or status. Rattled is more consistent, though, and punishes the use of moves like U-turn and Knock Off, the latter being easier to bait if Dudunsparce runs Tera Ghost.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Coil": {}}},
  "Scream Tail": {"sets": {"Wish": {}, "Calm Mind": {}}},
  "Wo-Chien": {"sets": {"RestTalk": {}, "Leech Seed": {}}}
}