{
  "Slowbro": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Slowbro's high physical bulk combined with Regenerator makes it a fantastic defensive pivot, able to check numerous physical attackers such as Cinderace, Excadrill, and Galarian Zapdos. As they're forced out, Slowbro can use Teleport to maintain momentum and stay healthy. Scald serves as a spammable STAB attack that can cripple targets with burns, dissuading otherwise decent checks like Mega Tyranitar and physically-centric Aegislash sets from setting up. Even foes that don't rely on physical attacks, like Serperior and Latios, tend to dislike the chip from burn. Future Sight supports wallbreakers like Choice Band Tyranitar, Buzzwole, and Enamorus in breaking through their checks such as Tangrowth and Skarmory for the former two and Galarian Slowking for the latter. It also synergizes excellently with Teleport. Slack Off serves as reliable recovery that doesn't require Slowbro to switch out. Heavy-Duty Boots allows Slowbro to avoid taking damage from entry hazards, maximizing HP regained from Regenerator, though Rocky Helmet can be held instead to punish contact move users, notably foes that run U-turn like Cinderace. A Relaxed nature and 0 Speed IVs are used to make Slowbro as slow as possible, maximizing its odds of moving slower than opposing Teleport users. Slowbro best fits on bulky offense and balance teams looking for a reliable defensive pivot that can also generate momentum for wallbreakers. Hazard-stacking teammates like Skarmory, defensive Clefable, and Hippowdon pair up nicely with Future Sight, further putting pressure on opposing defensive cores. Many hazard-stacking teammates can also double as checks to Pokemon Slowbro struggles against, such as Clefable checking Dark-types like Hydreigon, Skarmory handling Bug- and Grass-types like Buzzwole and Meowscarada, and Hippowdon checking Electric-types like Iron Hands as well as Galarian Slowking. Similarly, pivots like Scizor and Iron Treads also check threats like Galarian Slowking while pairing nicely with Slowbro's own pivoting potential to maintain offensive momentum. If it isn't running Heavy-Duty Boots, hazard control from teammates like Hydreigon, Choice Scarf Serperior, and Iron Treads is necessary.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Gyarados": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Gyarados's high Attack and good coverage make it a dangerous sweeper with Dragon Dance and Moxie. Bounce must be used alongside Flyinium Z to cleave through would-be counters in Grass-types such as Amoonguss and Tangrowth as well as Buzzwole. Even checks that aren't weak to Flying, like Latios, Latias, and Tapu Fini, are often taken out after one to two boosts. Ice Fang is an alternative if Gyarados isn't running Flyinium Z, providing it with the means to threaten Grass- and Dragon-types. Life Orb should be held if Gyarados isn't using Bounce, helping Gyarados OHKO foes such as Serperior with +1 Ice Fang and Tapu Fini with +1 Power Whip. Substitute can be used to take advantage of Pokemon that struggle to threaten Gyarados outside of status, like Mega Sableye. Power Whip is an alternative to threaten Water-types like Slowbro, Quagsire, and Tapu Fini, which it otherwise struggles to break through if it doesn't have access to Supersonic Skystrike. Gyarados best fits on offense teams, enjoying being paired with other sweepers like Iron Hands and Swords Dance Scizor. It supports these physical attackers by luring in and KOing common physical walls such as Buzzwole and Tangrowth with Supersonic Skystrike. Gyarados lacks the means to break through certain physical walls like Skarmory, and based on its choice of coverage it will lack the means to break through certain foes like Tangrowth and Iron Hands, making special attackers like Latios and Galarian Moltres important partners. In return, it can take advantage of some of Steel-types they tend to get picked off by like Celesteela and Scizor. Hazard support, notably from dedicated leads such as Mew and Excadrill, is very useful for chipping Gyarados's checks like Iron Hands and Choice Scarf Latias into KO range of its attacks. Conversely, Gyarados's Stealth Rock weakness means it greatly appreciates partners that can remove them or stop them from being set up, like Iron Treads and the aforementioned Mew and Excadrill. Grimmsnarl is another notable partner, as its dual screens support gives Gyarados a much easier time setting up.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Quagsire": {"sets": [{"name": "Unaware Wall"}]},
  "Slowking-Galar": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Galarian Slowking is an excellent pivot owing to its combination of Regenerator and Chilly Reception, which gives it some of the best longevity in the tier. With its unique defensive typing and good bulk, it can check a wide variety of foes, notably Fairy-types like Clefable and Tapu Fini and Grass-types such as Serperior and Tapu Bulu. Sludge Bomb serves as a spammable STAB move that can hurt the longevity of targets such as Gastrodon and Mega Sableye by poisoning them. Slack Off provides instant recovery Galarian Slowking can use without needing to switch out. Future Sight lets Galarian Slowking support wallbreakers and threaten Pokemon switching in to check it. Maximizing Galarian Slowking's physical bulk improves its ability to check physical attackers and lets it usually survive at least one Pursuit from an opposing Dark-type. 0 Speed IVs let Galarian Slowking move after its foes when using Chilly Reception, improving its pivoting capabilities. Galarian Slowking best fits on offensive teams looking for a splashable pivot and Future Sight support for wallbreakers that have difficulty coming onto the field, like Meowscarada and Mega Gallade. It struggles the most against Dark-types, which can absorb its Future Sight and threaten it. Tyranitar is a notable example due to its powerful Pursuit and Galarian Slowking's inability to hit it for neutral damage. Thus, bulky Fighting-types like Iron Hands and Buzzwole make good partners. Steel-types such as Aegislash, Iron Treads, and Celesteela also wall Galarian Slowking due to its lack of coverage, so the aforementioned Fighting-types and other checks to Steel-types, such as Fire-types like Iron Moth, are effective support. Entry hazard stackers like Skarmory pair well with Galarian Slowking's ability to spread damage and pivot in offensive threats.</p> "
      },
      {
        "name": "Assault Vest",
        "description": "<p>Assault Vest Galarian Slowking is an effective special wall that uses its unique typing and wide coverage to act as a versatile tank. The overwhelming majority of special attackers in the tier, including difficult-to-wall foes like Serperior and Iron Moth, lack the means to effectively break through it. Meanwhile, Galarian Slowking's good Special Attack and coverage mean few Pokemon are not threatened by it. Regenerator lets Galarian Slowking have a form of healing while holding Assault Vest. Sludge Bomb is a spammable STAB move that can cripple switch-ins with poison. Future Sight lets Galarian Slowking support wallbreakers while also punishing Pokemon such as Dragon Dance Gyarados that would otherwise try and set up on it. Flamethrower primarily targets Steel-types like Aegislash and Celesteela. Scald hits Ground-types and potentially cripples physical attackers and walls like Skarmory and Mega Tyranitar. This EV spread is used to guarantee that Galarian Slowking will not be 2HKOed by Latios's Choice Specs-boosted Draco Meteor after Stealth Rock and one layer of Spikes, with the remaining EVs being used to augment Galarian Slowking's Special Attack. Galarian Slowking best fits on bulky teams looking for a versatile tank that serves as a blanket check to most of the tier's special attackers. Examples of partners that appreciate this include Clefable, SubToxic Aegislash, and Gastrodon. Entry hazard removers like Tapu Fini are crucial support, as even one layer of entry hazards significantly cuts into Galarian Slowking's recovery. Galarian Slowking struggles the most against Pursuit trappers like Tyranitar, as while no physical attacker enjoys switching into its Scald or Sludge Bomb, they can easily trap it once they're on the field. Bulky Fighting-types like Iron Hands and Buzzwole and defensive walls such as Skarmory and Tangrowth can handle these foes for Galarian Slowking. Aegislash is another notable issue for Galarian Slowking, as its Ghost typing combined with its huge bulk and offenses lets it easily win one-on-one. Ground-types like Iron Treads can serve as effective checks to it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Tyranitar": {
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Mega Tyranitar’s excellent defensive stats, typing, and Pursuit enable it to carve a niche as a reliable entry hazard setter and Pursuit trapper. Stone Edge is a strong STAB option that OHKOes Iron Moth while denting neutral targets such as Celesteela and Tapu Fini. Pursuit enables Mega Tyranitar to trap Psychic- and Ghost-types, like Latios and Blacephalon. Crunch offers a strong STAB move to hit bulky Ghost- and Psychic-types, like Aegislash and Mega Latias. It is also the strongest move Mega Tyranitar has to hit Galarian Slowking. Superpower is an option to snipe opposing Tyranitar and severely damage would-be switch-ins such as Excadrill and Iron Treads. 176 Speed EVs enable Mega Tyranitar to outspeed Aegislash and Celesteela. Offensive Fighting-types such as Buzzwole, Blaziken and Keldeo, appreciate Mega Tyranitar removing bulky Ghost- and Psychic-types. In exchange, Buzzwole covers Mega Tyranitar’s weaknesses to Fighting- and Ground-type attacks, while Keldeo can bring Mega Tyranitar in safely with Flip Turn. Other teammates such as Iron Moth and Serperior offer some defensive synergy and appreciate Mega Tyranitar’s ability to remove Psychic- and Fire-types, respectively. Mega Tyranitar’s typing gives its weaknesses to prominent attacking types such as Fighting, Water and Ground, so Pokemon such as Tangrowth and Galarian Slowking can provide switch-ins to these types. The Future Sight support provided by the latter meshes well with Pursuit and dissuades Buzzwole and Iron Hands from switching in. Celesteela and Skarmory can help check Excadrill, Iron Treads, and Buzzwole, with Skarmory providing Spikes as a bonus. Clefable, Tapu Fini, and Aegislash can all check Fighting-types to some degree. Aegislash’s immunity to Fighting-type moves makes it an excellent partner to Mega Tyranitar, and it also eases the burden of checking Mega Latias, enabling Mega Tyranitar to run Superpower. Together they can wear down shared checks like Ting-Lu. Due to its lack of reliable recovery, Mega Tyranitar is vulnerable to being chipped down, so partners such as Choice Scarf Latias and Choice Band Scizor can ease the burden against frail sweepers such as Polteageist and Nihilego. Finally, Sand Rush Excadrill benefits from Mega Tyranitar’s Sand Stream and its ability to wear down Skarmory and Hippowdon.</p> "
      },
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance Mega Tyranitar utilizes its solid bulk and versatile offensive coverage to act as a threatening late-game cleaner. Ice Punch synergizes well with Stone Edge, as it chunks physically defensive Ground-types like Hippowdon, Ting-Lu, and physically defensive Tangrowth. Earthquake is a valuable coverage option to hit Excadrill, Iron Treads, and non-Air Balloon Aegislash. Crunch is an alternative STAB option for Air Balloon Aegislash that also hits Mega Latias, Gastrodon, and Slowbro hard. Maximum Speed investment with a Jolly nature is preferred to outspeed non-Choice Scarf Meowscarada and Cinderace with a single Dragon Dance. Dragon Dance Mega Tyranitar is usually found on bulky offense or hyper offense since these structures provide adequate tools to facilitate setup. The main hindrances for Mega Tyranitar are physically defensive walls like Hippowdon, Skarmory, and Clefable. Teammates like Serperior, Tapu Fini, Swords Dance Scizor, and Meteor Beam Celesteela can take advantage of these Pokemon. Serperior can lure in and use Glare against faster Pokemon that can outspeed +1 Mega Tyranitar, such as Choice Scarf Meowscarada and Mega Aerodactyl. Mega Tyranitar can also be revenge killed by common Fighting-types like Buzzwole, Keldeo, and Iron Hands even after a boost. Teammates such as Polteageist, Latios, and Aegislash offer valuable typings and can soft-check Fighting-types. In turn, they appreciate Mega Tyranitar’s ability to take advantage of specially defensive walls such as Blissey. Offensive Steel-types such as Iron Treads and Scizor can cut a Mega Tyranitar sweep short, and thus Fire-types like Blaziken, Cinderace, and Iron Moth are excellent partners. Magnezone deserves a special mention, as it traps Scizor and Skarmory. Sand Rush Excadrill appreciates Mega Tyranitar’s Sand Stream ability and in exchange offers insurance against Unaware Clefable. Mega Tyranitar is vulnerable to chip damage and thus appreciates pivoting support from Cinderace, Magnezone, Scizor, and Meowscarada. Slowbro and Galarian Slowking can bring in Mega Tyranitar safely with Teleport and Chilly Reception and offer Future Sight support for Buzzwole. Finally, dual screens support from Grimmsnarl and Alolan Ninetales eases setup, while Spikes from Ting-Lu, Meowscarada, and Mew wear down walls.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Velcroc", "user_id": 391284}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "Deezcastforms", "user_id": 423085}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Cinderace": {
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>With its high Attack and Speed stats, good coverage moves, and inability to be worn down by entry hazards thanks to Heavy-Duty Boots, Cinderace is a versatile pivot that is able to outspeed and offensively respond to various threats such as Latios and Clefable. Pyro Ball is Cinderace's main STAB move, allowing it to hit Steel-types such as Celesteela and Excadrill while also dealing significant damage to other defensive Pokemon such as Buzzwole and Amoonguss; it notably preserves Libero's type-changing ability in the process. U-turn, besides allowing Cinderace to maintain momentum by bringing in a teammate like Hydreigon, can also wear down defensive Pokemon such as Slowbro. Gunk Shot gives Cinderace useful coverage for Pokemon such as Tapu Fini and Mega Altaria, and it also lets Cinderace force out Calm Mind Clefable more reliably. Alternatively, High Jump Kick is an option to OHKO Mega Tyranitar and Hydreigon, as well as 2HKO physically defensive Ting-Lu, which U-turn cannot do. Sucker Punch lets Cinderace revenge kill chipped sweepers such as Agility Iron Moth and Z-Celebrate variants of Victini after their respective boosts while also threatening Choice Scarf users such as Blacephalon. Cinderace fits best on offensive teams that can supply it with the tools needed to break through defensive Pokemon; entry hazard setters such as Mega Tyranitar, Ting-Lu, and Iron Treads can support Cinderace in this manner, with Mega Tyranitar also being able to trap Slowbro and Skeledirge with Pursuit after Cinderace pivots against them. Similarly, defensive Pokemon such as Celesteela, Slowbro, and Tapu Fini appreciate Cinderace's ability to threaten out the likes of Aegislash, Meowscarada, and Scizor; in return, they can help sponge the Water- and Ground-type moves aimed at Cinderace or provide Future Sight or Taunt support in the case of the latter two. Powerful wallbreakers such as Latios and Gengar also appreciate the safe entry Cinderace can facilitate against most physically defensive Pokemon it commonly invites in on top of Cinderace being able to force out the Steel-types that would otherwise threaten them, like Aegislash and Scizor.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance turns Cinderace into a threatening wallbreaker, using its immense power to break through most defensive Pokemon that would otherwise switch into it comfortably. At +2, Breakneck Blitz manages to OHKO the likes of Slowbro after Libero. High Jump Kick is a necessary coverage option to let Cinderace reliably KO Mega Tyranitar and Ting-Lu. Cinderace fits best on hyper offense teams that benefit from its ability to break open defensive cores; as Cinderace is often revenge killed by faster Pokemon such as Sand Rush Excadrill and Choice Scarf Latias, other Pokemon that can take advantage of these revenge killers like Galarian Moltres, Swords Dance Scizor, and Bulk Up Galarian Zapdos become valuable teammates, as they also appreciate Cinderace's innate ability to threaten common walls such as Buzzwole and Skarmory. Cinderace also appreciates having dual screens support from Grimmsnarl to improve its setup opportunities, while anti-entry hazard options such as Excadrill and Iron Treads can help alleviate Cinderace's crippling Stealth Rock weakness.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Grimmsnarl": {
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>Grimmsnarl is an incredibly valuable dual screens setter thanks to Prankster giving its status moves priority, allowing it to enable popular setup sweepers on hyper offense teams. Spirit Break prevents Grimmsnarl from being shut down by prominent Dark-types such as Mega Tyranitar, Hydreigon, and Mega Sableye and also helps prevent it from being too passive against threats such as Iron Hands and Buzzwole. Taunt denies entry hazards from foes such as Skarmory, Gastrodon, and Chansey; prevents Defog attempts from Tapu Fini; and stops setup sweepers such as Gyarados and Blaziken from using Grimmsnarl as setup fodder. Parting Shot can be used over Spirit Break or Taunt to generate momentum for Grimmsnarl's team while also weakening a foe, but dropping Spirit Break or Taunt leaves Grimmsnarl vulnerable to Dark-types or entry hazard setters and setup sweepers, respectively. The given EVs let Grimmsnarl avoid an OHKO from Life Orb Scizor's Bullet Punch, with the rest dumped into Special Defense. Grimmsnarl fits best on hyper offense teams, which enjoy the dual screens support it can provide. Fighting-type setup sweepers such as Galarian Zapdos and Iron Hands make for good partners to take care of Dark- and Steel-types such as Mega Tyranitar, Bisharp, and Iron Treads for it. Other setup sweepers and late-game cleaners such as Gyarados, Iron Moth, Autotomize Celesteela, and Dragon Dance Mega Tyranitar appreciate the support provided by Grimmsnarl's dual screens to set up easier. Entry hazard setters such as Excadrill and Mew also pair well with Grimmsnarl to further support their teammates while also using it's dual screens support to place hazards more consistently.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Runo", "user_id": 568189}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Meowscarada": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Meowscarada leverages its excellent power and Speed tier to act as one of the tier's premier revenge killers, outspeeding boosted offensive threats like Dragon Dance Mega Tyranitar, Rapid Spin Excadrill, and Sandy Shocks, while also blazing past opposing Choice Scarf users such as Enamorus and Latias. Protean increases the damage output of its coverage moves, making them better suited at pressuring targets such as Mega Latias, Galarian Zapdos, and Hydreigon. Knock Off allows Meowscarada to remove important items from walls such as Clefable, Celesteela, and physically defensive Tangrowth, allowing it to break through them more easily. U-turn gives Meowscarada the ability to keep up momentum and in conjunction with Protean, severely dents opposing Meowscarada and Serperior that may try to stay in on it. Thunder Punch is critical for allowing Meowscarada to revenge kill targets like Autotomize Celesteela and Double Dance Galarian Moltres after their respective boosts, especially if the former has already used up its Power Herb; it also OHKOes Gyarados. Alternatively, Play Rough can be used to hit other Fighting- and Dragon-types, most notably Buzzwole, Iron Hands, and Dragon Dance Mega Altaria, while retaining its ability to take out Galarian Moltres. If several of the aforementioned Pokemon are adequately covered by Meowscarada's teammates, Trick can be used to cripple an incoming wall, such as Buzzwole or Amoonguss. Choice Scarf Meowscarada fits best on balance and offensive teams. Pokemon such as Sandy Shocks and Skarmory are appreciated partners for laying entry hazards that capitalize on Meowscarada's ability to force switches and remove items such as Heavy-Duty Boots and Leftovers from the opponent. Defensive pivots such as Galarian Slowking and Utility Jirachi also appreciate Meowscarada's ability to keep threats like Swords Dance Aegislash and Keldeo in check and can opt to safely bring it in against these Pokemon, as Meowscarada's poor defensive attributes often means it cannot switch into them directly. While Meowscarada is able to hit many of them super effectively, it can still struggle to deal lasting damage against walls such as Skarmory and Amoonguss, making offensive teammates that can take advantage of them, such as SubToxic Aegislash, Choice Band Victini, and Choice Specs Latios extremely valuable, all of which benefit from the opportunities provided by Meowscarada's U-turn in return.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Meowscarada packs colorful coverage in conjunction with Protean and its naturally high Speed tier, letting it serve as a powerful offensive pivot. Choice Band allows Meowscarada to OHKO several offensive Pokemon that it otherwise wouldn't, such as Aegislash and Iron Moth. In addition to this, Knock Off cripples defensive walls such as Scizor and Amoonguss by removing their respective items, while also serving as Meowscarada's most common move to use against neutral targets. U-turn allows Meowscarada to rack up momentum against Pokemon it forces out, such as Tyranitar, Hippowdon, and Tapu Fini. Thunder Punch is usually preferred for its ability to 2HKO Skarmory outright, on top of hitting other crucial Flying-type checks such as Enamorus. However, Play Rough can be used instead to provide super effective coverage against other answers, 2HKOing the likes of physically defensive Buzzwole, Mega Sableye, and Mega Altaria. Sucker Punch is also a passable option in the last slot as a priority move that can finish off weakened offensive threats such as Autotomize Celesteela, Z-Celebrate Victini, and Sand Rush Excadrill. Choice Band Meowscarada fits best on more offensive teams, particularly those that appreciate its unique mix of wallbreaking and pivoting capabilities. Frailer offensive teammates that also benefit from Meowscarada's U-turn, such as Mixed Aegislash, Hisuian Zoroark, and Alakazam, can make for good teammates to pressure some of Meowscarada's checks, like Buzzwole and Mega Venusaur. Hisuian Zoroark in particular synergizes especially well, as disguising as Meowscarada with its Illusion ability can help force mindgames with the opponent; the threat of Hisuian Zoroark luring in and eliminating walls such as Buzzwole with Flamethrower can make the opponent much less eager to try and switch them into Meowscarada. Defensive pivots such as Scizor, Galarian Slowking, and Blissey, are also essential to let Meowscarada enter the field safely against more preferable targets, while also being great Pokemon to fall back on when faced with opposing revenge killers, such as Choice Scarf Latias and Enamorus. Galarian Slowking can also use Future Sight to remedy Meowscarada's lack of coverage against Fighting-types such as Buzzwole and Iron Hands. Entry hazard support from the likes of Clefable and Sandy Shocks benefit from Meowscarada's Knock Off removing items such as Heavy-Duty Boots and Leftovers from defensive Pokemon like Clefable, on top of making it easier to break past them.</p> "
      },
      {
        "name": "Lead",
        "description": "<p>Lead Meowscarada is one of the fastest leads in the entire tier, which makes it highly effective at getting the jump on opposing leads. It also matches up very well against Grimmsnarl, as its Dark typing makes it immune to Prankster. Due to Meowscarada's insane Speed tier, Taunt allows it to dominate other leads by outspeeding and preventing them from getting their own entry hazards up, most notably Excadrill, Mew, and Hydreigon, while also blocking Defog from foes like Tapu Fini and Mandibuzz. Flower Trick, especially in conjunction with Overgrow, allows Meowscarada to deal significant damage to neutral foes before fainting, most notably 2HKOing Stealth Rock Clefable. Knock Off, on top of 2HKOing Lead Mew, can also remove items such as Skarmory's Rocky Helmet and Celesteela's Leftovers, making them easier to break through. Lead Meowscarada's extensive utility and positive matchups against similar archetypes make it a natural fit for hyper offense teams. Offensive Pokemon such as Swords Dance Scizor, Meteor Beam Celesteela, and Calm Mind Latios each appreciate Spikes' ability to wear down several of their grounded checks into range, like Mega Tyranitar and SubToxic Aegislash. Offensive Stealth Rock users, such as Sandy Shocks and Nihilego, can also synergize well with Meowscarada's Spikes to create even more offensive pressure for the opponent. As Lead Meowscarada tends to struggle against Mega Sableye due to Magic Bounce, Pokemon that can take advantage of it, such as Nasty Plot Galarian Moltres and Booster Energy Iron Moth, make for crucial offensive teammates that can fulfill this role effectively. In return, they favor Meowscarada's ability to remove their crippling weakness to Stealth Rock by shutting down the majority of Stealth Rock setters.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Arishem", "user_id": 546157}], "teams": [{"name": "Quality checked by", "members": [{"username": "Pubo", "user_id": 535121}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Iron Moth": {
    "sets": [
      {
        "name": "Agility + Booster Energy",
        "description": "<p>With stat boosts from Agility and Booster Energy, Iron Moth can effectively serve the role of a cleaner. Fiery Dance and Sludge Wave serve as spammable STAB attacks that hit the majority of the tier for neutral damage; the former has the potential to snowball through teams, thanks to its chance to raise the user's Special Attack further. Energy Ball primarily targets Ground-, Rock-, and Water-types like Ting-Lu, Mega Tyranitar, and Slowking. Due to the all-or-nothing nature of this set, Iron Moth best fits on offense teams looking for a cleaner. It struggles against Ground-, Rock- and Water-types, so Grass- and Water-types like Serperior, Calm Mind Tapu Fini, and Gyarados make good partners, as they can handle these threats. Physical wallbreakers like Iron Hands and Swords Dance Aegislash are also important, as Iron Moth has no way to get past Blissey and Chansey. Assault Vest Galarian Slowking and Skeledirge also wall Iron Moth thanks to their typings and bulk, so Ghost- and Dark-types, and notably Pursuit users like Mega Tyranitar, can eliminate them for it. Iron Moth despises losing 25% of its health to Stealth Rock when switching in, so partners that can remove them, like Excadrill and Iron Treads, are much appreciated. Stealth Rock support is greatly appreciated, as it can push certain targets like Choice Band Tyranitar outside of Sandstorm and Hydreigon into KO range.</p> "
      },
      {
        "name": "Offensive",
        "description": "<p>Offensive Iron Moth leverages its high number of resistances and good power to act as a dangerous offensive threat with Heavy-Duty Boots. Fire Blast serves as a powerful STAB move that threatens every neutral target that doesn't have immense special bulk. Fiery Dance is an alternative; it's notably weaker, missing out on the OHKO on Autotomize Celesteela and 2HKO on Iron Hands. However, in exchange, it has perfect accuracy, more PP, and its ability to boost Iron Moth's Special Attack can let it sweep late-game. Sludge Wave is Iron Moth's other STAB attack; besides hitting opposing Dragon- and Fire-types for neutral damage, it also breaks through Fairy-types like Clefable and Tapu Fini. Due to the amount of Pokemon it threatens out, such as Aegislash and Mega Sableye, Iron Moth is an effective setter of Toxic Spikes; Energy Ball is an alternative, serving as coverage against opposing Ground-, Rock-, and Water-types, like Gastrodon and Tyranitar, and finally, U-turn is another alternative, as the switches Iron Moth forces out let it act as an effective offensive pivot. Morning Sun gives Iron Moth reliable recovery, letting it avoid getting worn down by repeated attacks and Stealth Rock if its Heavy-Duty Boots are removed. Iron Moth best fits on balance and offensive teams looking for a fast and powerful special attacker with good utility. While Iron Moth can check most special attackers, even resisted hits from physical attackers like Cinderace can 2HKO it. Thus, physical walls and tanks like Buzzwole, Slowbro, and Galarian Slowking can check these foes for Iron Moth. Pivots, like the latter two, can also help Iron Moth find opportunities to switch in. If it is carrying U-turn, wallbreakers like Choice Band Meowscarada and Choice Specs Latios and Enamorus appreciate Iron Moth's ability to pivot them in safely, while in return they can smash through the walls and many offensive threats that give Iron Moth trouble. Speed control, namely powerful priority users like Scizor and Choice Scarf users like Tapu Fini and Hydreigon, can also help eliminate physical attackers. Physical wallbreakers like Iron Hands and Aegislash can help against Blissey and Chansey, which wall Iron Moth. Assault Vest Galarian Slowking and Skeledirge both wall Iron Moth, so Ghost- and Dark-types, notably Pursuit users like Mega Tyranitar, can remove them for it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gangsta Spongebob", "user_id": 535530}], "teams": [{"name": "Quality checked by", "members": [{"username": "Arishem", "user_id": 546157}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  }
}