{
  "Charizard": {
    "sets": [
      {
        "name": "Drought Wallbreaker",
        "description": "<p>Thanks to its superb coverage and high Special Attack stat, Mega Charizard Y is a terrifying wallbreaker. Drought + Solar Beam allows Mega Charizard Y to subdue Water-types such Rotom-W, Gastrodon, and Tapu Fini, further restricting its defensive counterplay. Fire Blast is preferred to hit as hard as possible, though Flamethrower's perfect accuracy and greater PP make it worth consideration. Weather Ball is an interesting option, as it presents a challenge to rain teams by dealing considerable damage to Pelipper on the switch, but it comes at the cost of Mega Charizard Y losing its primary STAB move outside of sun. Scorching Sands pressures Heatran, Toxapex, and Skeledirge, while Focus Blast threatens Mega Tyranitar. Mega Charizard Y's tremendous wallbreaking prowess allows late-game sweepers such as Dragon Dance Dragapult, Dragonite, and Volcarona to take advantage of Unaware walls that have been compromised, such as Skeledirge and Clodsire. Mega Charizard Y's sun support benefits Protosynthesis users such as Great Tusk. Mega Charizard Y appreciates entry hazard control from teammates such as Great Tusk, Landorus-T, and Kartana, as it is extremely susceptible to Stealth Rock. It also struggles to break bulky Dragon-types such as Dragonite and Mega Latias as well as special walls like Clodsire and Hippowdon. Weavile, Tyranitar, and Kingambit subsequently form strong offensive cores with Mega Charizard Y, as they are able to Pursuit trap its aforementioned checks, with the former being able to deal with Hippowdon as well. Mega Charizard Y's middling Speed tier and unremarkable physical bulk leave it prone to being revenge killed by faster threats such as Dragapult, Mega Lopunny, and Tapu Koko. Therefore, bulky switch-ins such as Assault Vest Tangrowth, Ting-Lu, and Landorus-T make for good teammates.</p> "
      },
      {"name": "Dragon Dance"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515767, "username": "Ryuji"}, {"user_id": 589564, "username": "hidin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 385157, "username": "2020 idm boomer"}]}
  },
  "Slowbro": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Slowbro's valuable defensive typing, solid physical bulk, and remarkable longevity between Slack Off + Regenerator make it a very reliable defensive pivot, capable of consistently checking dangerous physical attackers like Urshifu-R, Mega Medicham, Mega Lopunny, and Mega Swampert. The combination of Teleport + Future Sight lets Slowbro support its offensive teammates by providing them free entry while forcing immense pressure on a prospective switch-in. Heavy-Duty Boots allows Slowbro to switch freely in spite of any entry hazards. Tera Steel can be used in a pinch to check foes like Kingambit, Mega Tyranitar, and Tapu Lele, letting it either cripple them with a Scald burn or use Teleport into a revenge killer. Wallbreakers such as Kingambit, Iron Valiant, and Zamazenta appreciate Slowbro's FuturePort to bring them in safely on foes like Ferrothorn and Garganacl and subsequently pressure their switch-ins like Great Tusk, Clodsire, and Toxapex with the impending Future Sight. Specially defensive Pokemon such as Ting-Lu, Clodsire, and Heatran help cover threats like Tapu Koko, Volcarona, and Gholdengo, respectively; in return, Slowbro deals with Ground- and Fighting-types like Great Tusk, Garchomp, and Urshifu-R. Corviknight, Tornadus-T, and Buzzwole cover other physical attackers such as Kartana, Kingambit, and Weavile that Slowbro struggles with; the former two remove entry hazards with Defog in case Slowbro is forced to take a Knock Off, while the latter can make use of Future Sight to wallbreak easier.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 385157, "username": "2020 idm boomer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Chansey": {
    "sets": [
      {
        "name": "Pink Blob (Defensive)",
        "description": "<p>Thanks to its gargantuan Eviolite-boosted special bulk alongside a lack of relevant weaknesses, Chansey stands firmly as a formidable wall that blanket checks the metagame's special attackers, including Dragapult, Mega Charizard Y, and Volcarona. Toxic lets Chansey whittle them down, especially in conjunction with repeated Seismic Tosses, while Thunder Wave punishes poison-immune foes like Heatran and Toxapex and cripples switch-ins such as Mega Lopunny and Kingambit. Chansey can provide cleric support with Aromatherapy, especially since it can switch into status users like Clodsire and Rotom-W thanks to Natural Cure. However, Stealth Rock can be used if the team lacks another user, and Chansey can do it sufficiently by outlasting common entry hazard removers such as Great Tusk, Tornadus-T, and Landorus-T. Tera Steel allows it to reliably check Tapu Lele, Hatterene, and Tornadus-T, and it prevents Chansey from being poisoned. Chansey is generally reserved for bulkier builds that appreciate its defensive profile and can tolerate its overall passivity. Sturdy walls like Skeledirge, Buzzwole, Skarmory, and Corviknight can cover physical attackers like Zamazenta, Mega Lopunny, and Kartana for Chansey. Skeledirge's Unaware helps against setup sweepers like Mega Scizor and Mega Charizard X that attempt to use Chansey as setup fodder, while Corviknight's Defog alleviates Chansey from entry hazard pressure that would overwhelm it easily. Knock Off and Trick absorbers like Clefable, Toxapex, Mega Scizor, and Gholdengo make sure that Chansey can keep its valuable Eviolite; Additionally, Mega Scizor helps deal with Psyshock Tapu Lele, Gholdengo threatens Calm Mind Hatterene, and Calm Mind Clefable overwhelms Heatran—especially if it's paralyzed—all of which are special attackers that can beat Chansey one-on-one.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 589564, "username": "hidin"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Gyarados": {"sets": [{"name": "Dragon Dance"}, {"name": "Dragon Dance + Flyinium Z"}]},
  "Ditto": {"sets": [{"name": "SUS"}]},
  "Dragonite": {
    "sets": [
      {
        "name": "Extreme Killer (Dragon Dance)",
        "description": "<p>Dragonite's high Attack stat, Dragon Dance, and Tera Normal make it a good user of Extreme Speed, being able to effectively clean late-game. Earthquake helps Dragonite eliminate Normal-resistant Pokemon such as Gholdengo, Kingambit, and Heatran. Roost improves Dragonite's longevity and enables it to acquire multiple boosts against passive opponents. Roost lets Dragonite check Volcarona and rain sweepers such as Barraskewda throughout the entire match. Ice Spinner is another choice that clears the priority-blocking Psychic Terrain and hits Great Tusk, Landorus-T, and Dragapult super effectively. Fire Punch can be used to hit bulky Steel-types not weak to Ground such as Corviknight, Mega Scizor, and Ferrothorn. An Adamant nature is usually preferred to maximize Extreme Speed's damage output, but a Jolly nature enables Dragonite to outspeed Tapu Koko and the Normal-immune Dragapult after a single Dragon Dance. Heavy-Duty Boots ensures that Dragonite will always retain Multiscale even if entry hazards are up, but if the team's entry hazard control is good, Silk Scarf is another option that boosts Extreme Speed's power. Dragonite fits well on offensive teams as a priority-using revenge killer and late-game cleaner. Entry hazard support from Great Tusk and Garchomp can help chip down bulky targets such as opposing Great Tusk into range of its attacks. Tapu Lele poses a serious threat to Dragonite, as not only does its Psychic Terrain block Extreme Speed on grounded targets, but with a Choice Scarf it can also outspeed and deal massive damage to Dragonite even after setup, especially if Dragonite has not Terastallized yet. Gholdengo is a good partner, as it can switch in on and threaten Tapu Lele and prevent the opponent from removing entry hazards. Dragonite often struggles against Unaware users such as Dondozo and Skeledirge, so Pokemon that can grab momentum against them are appreciated teammates. Rotom-W and Tapu Koko can come relatively freely on Dondozo and threaten it with a Volt Switch while Heatran and Mega Diancie can switch into and set up Stealth Rock against Skeledirge. Strong wallbreakers like Mega Medicham, Mega Charizard Y, and Zamazenta all take advantage of Pokemon that Dragonite tends to struggle with, such as Dondozo, allowing it to sweep more easily late-game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515767, "username": "Ryuji"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}]}
  },
  "Slowking": {"sets": [{"name": "Defensive Pivot", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Scizor": {
    "sets": [
      {
        "name": "Bulky Swords Dance",
        "description": "<p>Mega Scizor leverages its great bulk and solid defensive typing to serve as a sturdy check to many Pokemon—including Weavile, Kartana, and Tapu Lele—and a solid wincon as well. U-turn allows it to serve as a pivot: easily switching it out of checks such as Gholdengo, Urshifu-R, and Mega Charizard Y, it brings in teammates like Tapu Koko and Dragapult to deal with them. Close Combat can be used to dispose of Steel-types like Ferrothorn and Heatran much more quickly, greatly denting them on the switch. The given EV spread allows Mega Scizor to survive two Close Combats from Mega Lopunny after Stealth Rock and outspeed uninvested Heatran, with the HP and Special Defense EVs helping it check Tapu Lele. Mega Scizor's pivot support is extremely valuable to Pokemon such as Tapu Koko, Rotom-W, and Zamazenta, which all also appreciate how well it exploits defensive Pokemon such as Clodsire, Ferrothorn, and Landorus-T. Rotom-W forms a strong VoltTurn core with Mega Scizor as well, with both pivoting out on their checks and racking up solid chip damage over time. Nasty Plot Tornadus-T appreciates Mega Scizor pressuring specially defensive walls and offensive Pokemon like Weavile and Clodsire, letting it go all-in as an offensive wallbreaker with ease. Mega Scizor wearing down Rotom-W and Heatran is also particularly useful for Tornadus-T, as these Pokemon can heavily damage or cripple Tornadus-T in one way or another. Mega Scizor being completely countered by Gholdengo mandates a Pursuit trapper like Weavile or Kingambit to pressure it. Skeledirge also hard counters Mega Scizor, encouraging the aforementioned teammates as well as Garganacl and Heatran.</p> "
      },
      {
        "name": "Swords Dance + 3 Attacks",
        "description": "<p>This set takes on a much more offensive role, using its solid defensive typing for easy entry points against Pokemon like Weavile and Kingambit, setting up, and threatening the vast majority of the metagame with its strong Technician-boosted attacks. Close Combat KOes Steel-types like Heatran and Ferrothorn, as well as providing a strong neutral hit against Rotom-W. Dual Wingbeat hits Clodsire and Toxapex for reliable neutral damage, hits Zamazenta super effectively, and breaks Substitute against Shed Tail hyper offense teams and Dragon Dance Dragapult. Knock Off is an alternative to hit Gholdengo reliably and remove items like Leftovers from Rotom-W and Heavy-Duty Boots from Tornadus-T, Skeledirge, and Volcarona. This allows a teammate or Mega Scizor to wear them down much more easily. Knock Off is especially relevant in Rotom-W's case, as removing Leftovers makes it easier to put into KO range of +2 Close Combat. Running Knock Off makes Toxapex a much worse matchup, however, so Pokemon like Great Tusk and Tapu Koko that can pressure it are appreciated. Sand Tomb can be used to reliably beat Clodsire, Toxapex, and Gholdengo, preventing them from reliably checking it. Offensive Mega Scizor fits much better on hyper offense teams, which appreciate its incredibly valuable—though short-term—defensive utility. Grimmsnarl is a perfect teammate, providing dual screens to let it set up against foes like Great Tusk, Dragonite, and Landorus-T; it also pivots Mega Scizor in and appreciates it baiting in Gholdengo, which prevents Grimmsnarl from pivoting as effectively. Gholdengo itself is also a notable partner, as it appreciates Mega Scizor dispatching the most popular Dark-types in Weavile and Kingambit. Entry hazards from suicide leads like Landorus-T and Garchomp allow Mega Scizor to clean late-game, as its foes must be chipped before any sweeping is done. Entry hazards particularly help in wearing down checks like Urshifu-R and bulkier Garchomp sets. Mega Scizor struggles against bulky Steel-resistant Pokemon like Rotom-W and Volcarona; Dragonite and Dragapult can take care of the latter, switching into Volcarona to set up as it switches into Mega Scizor, whereas Great Tusk can remove Leftovers from the former, making it easier for Mega Scizor to dispatch with +2 Close Combat. Physically defensive Unaware walls in Skeledirge and Dondozo completely wall Mega Scizor, so offensive Pokemon that can bait in or wear down these foes, including Iron Valiant, make for solid partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 515767, "username": "Ryuji"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}]}
  },
  "Blissey": {"sets": [{"name": "Pink Blob (Defensive)"}]},
  "Tyranitar": {
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Mega Tyranitar serves as a valuable Stealth Rock setter and Pursuit trapper due to its powerful STAB moves, great bulk, and Rock / Dark typing, allowing it to handle Ghost- and Flying-types well. Stone Edge threatens common Defoggers in Tornadus-T, Zapdos, and Rotom-W to ensure its Stealth Rock stays on the field. Crunch dents Pokemon like Dragapult and Gholdengo while doing sizable damage to Gastrodon and Ferrothorn. Alternatively, Superpower can be used over Crunch to immediately threaten Kingambit, Ting-Lu, and Ferrothorn, but it leaves Mega Tyranitar unable to pressure Pokemon like Gholdengo, Clodsire, and Reuniclus. Pursuit traps Pokemon like Tapu Lele, Dragapult, Tornadus-T, and Gholdengo. 108 Speed EVs allow Mega Tyranitar to outspeed Gholdengo. Mega Tyranitar's middling defensive typing leaves it extremely vulnerable to Pokemon such as Mega Lopunny, Great Tusk, and Zamazenta. As such, defensive Pokemon like Zapdos, Gholdengo, and Toxapex pair well with Mega Tyranitar, as they cover the threats it would struggle with. Toxapex in particular appreciates Mega Tyranitar trapping Heatran and Gholdengo with Pursuit, after which it can then stack Toxic Spikes. This, along with Mega Tyranitar's Stealth Rock, wears down each other's checks like Great Tusk, Landorus-T, and Zamazenta. Mega Tyranitar also appreciates Pokemon that can deal with Ground-types, such as Zapdos, Tornadus-T, and Tangrowth. Fighting-type partners such as Iron Valiant and Zamazenta greatly appreciate Mega Tyranitar removing Pokemon like Gholdengo and Reuniclus. Mega Tyranitar's sand enables Excadrill, which is a great offensive partner for it. Excadrill is able to snipe Pokemon like Mega Diancie and Kingambit, while Tyranitar deals with Flying-types like Zapdos and Mega Charizard Y in return. Mega Tyranitar can also chip Pokemon like Rotom-W and Landorus-T, which enables Excadrill break past them more easily.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 544502, "username": "ChrisPBacon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 589564, "username": "hidin"}]}
  },
  "Pelipper": {
    "sets": [
      {
        "name": "Rain Setter",
        "description": "<p>Pelipper is a staple pick on rain teams thanks to its ability, Drizzle. Its physical bulk combined with Scald lets it check and potentially cripple foes such as Mega Lopunny, Mega Scizor, and Great Tusk. Hurricane is an alternative to Defog on teams that use Tornadus-T for entry hazard control, which offers better neutral coverage and the ability to hit foes such as Tangrowth and Tera Grass Heatran. Pelipper also operates as a slow pivot with U-turn, which is greatly appreciated by the team's wallbreakers to ensure that they can enter the field safely. Tera Ground offers an Electric immunity for threats such as Tapu Koko, whereas Tera Steel offers a strong defensive typing, letting Pelipper check Pokemon like Extreme Speed Dragonite in a pinch. As the premier rain setter, Pokemon that rely on rain to boost their power or operate effectively within it, such as Mega Swampert, Floatzel, Barraskewda, and Urshifu-R, make for common teammates. Mega Swampert offers a valuable Electric immunity for Pelipper, checking foes such as Tapu Koko. Tornadus-T can provide entry hazard control with Defog, letting Pelipper enter the field and summon rain without having to fear taking hazard damage. Ferrothorn takes advantage of Pelipper's typing and ability to form a solid defensive core and provide a robust blanket check for opposing rain. In return, Pelipper alleviates Ferrothorn's massive Fire weakness by setting rain, and it can check threats that Ferrothorn fails to cover, such as Mega Lopunny.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 385157, "username": "2020 idm boomer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 580037, "username": "TheSorcer3r"}]}
  },
  "Sableye": {"sets": [{"name": "Defensive Magic Bounce", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Medicham": {
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Mega Medicham is a tremendously strong wallbreaker due to Pure Power, strong STAB moves, and coverage. Fake Out lets Mega Medicham chip down and revenge kill Pokemon like Mega Lopunny, Iron Valiant, and Tapu Koko. It also can let Mega Medicham stall out rain, Toxic, and Terrain on foes, all while putting opponents into range for one of its stronger attacks safely. Ice Punch lets Mega Medicham get rid of Landorus-T and Dragonite, which can enable it to freely use its STAB moves. Bullet Punch can be used to snipe Pokemon like Iron Valiant, Mega Diancie, and Weavile, and it also removes revenge killers like Tapu Koko and Mega Lopunny after chip damage. Thunder Punch can be used to hit Slowbro, and in tandem with Electric Terrain, it can 2HKO Pokemon like Gholdengo and Victini. Alternatively, Thief can be used to immediately damage the aforementioned Pokemon, so it can use its STAB moves more. Due to Mega Medicham’s frailty and mediocre Speed tier, it is easily revenge killed. Defensive partners like Gholdengo, Ting-Lu, and Ferrothorn help check threats like Choice Scarf Tapu Lele and Dragapult. Knock Off and Pursuit users like Kingambit and Weavile also support Mega Medicham, as they break through Psychic- and Ghost-type Pokemon Mega Medicham struggle with, such as Slowbro, Victini, Gholdengo and Skeledirge, allowing it to consistently use its STAB attacks. Entry hazard support from Pokemon like Ting-Lu, Garchomp, and Ferrothorn benefit Mega Medicham, as it forces a lot of switches and entry hazards wear down checks quickly. Tapu Koko is a good partner for Mega Medicham, as it handles Pokemon like Tornadus-T and Slowbro reliably and powers up Mega Medicham's Thunder Punch. Tapu Lele can also be a good partner for Mega Medicham, as it powers up Zen Headbutt to insane levels, but blocking Fake Out and Bullet Punch from being used can be problematic. Pokemon like Volcarona and Kartana appreciate Torandus-T, Skeledirge, Clodsire, and Gholdengo being pressured constantly by Mega Medicham, enabling them to wreak havoc once the checks are removed or chipped.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 483087, "username": "Kaede"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 620268, "username": "SKIPPERGAMEZ"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidin"}]}
  },
  "Torkoal": {"sets": [{"name": "Sun Setter"}]},
  "Altaria": {"sets": [{"name": "Dragon Dance", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Floatzel": {
    "sets": [
      {
        "name": "Rain Wallbreaker",
        "description": "<p>Floatzel is an incredible wallbreaker on rain teams, making use of its decent Attack stat powered by its Choice Band. Low Kick hits Ferrothorn and Ice Spinner hits Dragapult and Dragonite more reliably. However, because of Tera Water, its Water-type moves are all boosted considerably, so coverage is often unnecessary. Aqua Jet gives Floatzel priority outside of rain against weakened targets such as Tapu Koko, Iron Valiant, and Mega Lopunny, and it bypasses Kingambit's Sucker Punch. Tornadus-T and Zapdos all appreciate Floatzel's offensive capabilities, as it deals with wallbreakers such as Dragapult, Mega Diancie, Gholdengo, Zamazenta, Mega Lopunny, and Iron Valiant. Zapdos can reliably check Water-types that counter Floatzel like Slowbro and Dodonzo. Tornadus-T can weaken and cripple Floatzel checks in Rotom-W, Dondozo, and Ferrothorn, as Knock Off removes Leftovers from them, making it easier for Floatzel to wallbreak. Offensive partners like Manaphy and Mega Swampert can overwhelm those same Water-resistant Pokemon as well as Dragonite. Ferrothorn can check priority users such as the aforementioned Dragonite and Kingambit, alleviating Floatzel's weakness to them.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 580037, "username": "TheSorcer3r"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 540138, "username": "Milo"}]}
  },
  "Gastrodon": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Gastrodon finds itself a valuable role in National Dex primarily off its invaluable Water and Electric immunities, allowing it to handle terrifying rain sweepers such as Floatzel and Mega Swampert and answer Rotom-W perfectly. Scald lets Gastrodon threaten a burn against otherwise safe switch-ins such as Ferrothorn and Dragonite. Toxic better threatens defensive Pokemon such as opposing Gastrodon, Skeledirge, and Tornadus-T. Earthquake threatens Pokemon like Heatran, Clodsire, and Gholdengo. Relaxed should be selected as Gastrodon's nature if using Earthquake to not lower its damage output; Bold should be used otherwise. Tera Fairy can be used in a pinch to grant Gastrodon a resistance to Fighting against Urshifu-R and Barraskweda and a Dark resistance against Kingambit. The given EV spread maximizes Gastrodon's physical bulk to better take on the likes of Floatzel, Mega Swampert, and Urshifu-R. Gastrodon fits best on balance and bulky offense teams, which appreciate its defensive qualities while being able to supplement its passivity with offensive wallbreakers. Pokemon such as Tornadus-T and Gholdengo can switch into Grass-type coverage from Pokemon like Kartana and Ferrothorn; In return, Gastrodon provides entry hazard support to wear down answers such as Mega Tyranitar, Kingambit, and Clodsire. Strong, fast wallbreakers like Mega Diancie, Iron Valiant, and Zamazenta love having Gastrodon as a fallback measure against the myriad of Water-type revenge killers on rain such as Floatzel and Mega Swampert. If Gastrodon opts to use Spikes, it likes having Stealth Rock setters such as Heatran and Mega Diancie as partners to form an effective entry hazard-stacking core.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 589564, "username": "hidin"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 544502, "username": "ChrisPBacon"}]}
  },
  "Garchomp": {
    "sets": [
      {
        "name": "Offensive Stealth Rock",
        "description": "<p>Garchomp serves as an excellent wallbreaker that possesses great defensive utility, having an Electric-type immunity and being a check to Pokemon like Heatran and Volcarona. Outrage with Dragonium Z muscles through Pokemon like Great Tusk, Tangrowth, and Ting-Lu. Garchomp fits best on offensive teams; Pokemon like Volcarona, Mega Charizard Y, and Tapu Koko benefit from it breaking through Pokemon like Toxapex, Clodsire, and Dragonite. Tapu Koko makes a stellar partner because it can pivot on Garchomp targets in Clodsire, Gastrodon, and Gliscor. In return, Tapu Koko threatens Corviknight and Slowbro, two major roadblocks for Garchomp. Pokemon like Mega Scizor and Kingambit can pressure revenge killers such as Iron Valiant, Weavile, and Dragapult thanks to their strong priority while taking several attacks from them. Rotom-W switches into Pokemon that threaten Garchomp such as Great Tusk and Tornadus-T. Garchomp can take care of Pokemon Rotom-W pivots out on such as Gastrodon, Ferrothorn, and Gholdengo.</p> "
      },
      {
        "name": "TankChomp",
        "description": "<p>Garchomp possesses great role compression and is a good check to contact attackers like Mega Scizor, Dragonite, and Mega Lopunny. Toxic can cripple switch-ins such as Landorus-T, Tangrowth, and Rotom-W. Dragon Tail can stop any setup attempts from Volcarona, Mega Scizor, and Dragonite lacking Ice Spinner and can wear down Pokemon like Corviknight, Rotom-W, and Landorus-T. Alternatively, Flamethrower can rip through Pokemon like Kartana, Mega Scizor, and Ferrothorn. Tera Ghost lets Garchomp spinblock Great Tusk and switch into Fighting-type moves from Pokemon like Mega Medicham and Zamazenta, while Tera Water grants resistances to Gholdengo's Make It Rain and Ice- and Water-type moves from Weavile, Floatzel, and Urshifu-R as well as neutrality to Fairy-type attacks from Iron Valiant and Mega Diancie. Tera Steel gives it a Toxic immunity and improves Garchomp's matchup against Tapu Lele, Kartana, and Dragapult. The given Speed EVs with a Jolly Nature allows Garchomp to outspeed Timid Gholdengo, while maximizing its physical bulk. Teammates like Mega Scizor, Gholdengo, and Volcarona can cover Garchomp's Ice and Fairy weaknesses and threaten out a majority of Garchomp checks such as Iron Valiant, Weavile, and Mega Diancie. In return, Garchomp can switch into Rock- and Fire-type Pokemon like Heatran, Mega Tyranitar, and Volcarona. Knock Off Kingambit and Weavile support Garchomp by crippling common Defoggers like Tornadus-T and Landorus-T.</p> "
      },
      {"name": "Swords Dance", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515767, "username": "Ryuji"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 589564, "username": "hidin"}]}
  },
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Weavile": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Thanks to its high Speed, great Attack stat, and good STAB combination, Weavile is able to tear apart offensive teams and set itself apart from other Pursuit trappers in Kingambit and Mega Tyranitar. It can easily trap Pokemon like Gholdengo, Tapu Lele, and Choice Specs Dragapult with Pursuit. Triple Axel has good neutral coverage and threatens a KO on foes like Kartana, Mega Charizard Y, and Iron Valiant, while Knock Off removes items from the likes of Toxapex and Ferrothorn and provides good utility. Ice Shard helps revenge kill Dragapult and faster foes that have been weakened like Mega Lopunny and Tapu Koko. Tera Dark propels Weavile's Knock Off to stellar levels of damage, possibly 2HKOing defensive Toxapex, Corviknight, and Ferrothorn after Stealth Rock while also removing its own weakness to Stealth Rock. Alternatively, Tera Ice allows Weavile to more easily revenge kill Dragapult, Mega Lopunny, and Tapu Koko while also boosting its Triple Axel to insane levels. Although it can safely take unresisted hits from full, Weavile is really frail, so it appreciates being brought onto the field by pivots like Landorus-T, Rotom-W, and Slowbro. The latter also provides Future Sight support, which allows Weavile to beat its most common checks, being Toxapex, Corviknight, and Urshifu-R. It also works well with Pokemon that like having Psychic- and Ghost-types like Gholdengho, Dragapult, and Tapu Lele being removed, like Mega Medicham and Zamazenta. Weavile also appreciates Spikes support from setters like Ting-Lu and Ferrothorn to weaken opposing Ferrothorn and Toxapex, as well as Defoggers like Tornadus-T and Rotom-W to prevent it from being worn down by entry hazards.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Weavile's great Speed and Attack paired with Swords Dance makes it one of the most versatile Pokemon in the metagame, being able to wallbreak, revenge kill, and clean late-game. Most of Weavile's checks, such as Urshifu-R, Kingambit, and Heatran, aren't long-term checks and don't like losing their item. It also requires a minimal amount of chip damage on Pokemon like Buzzwole, Iron Hands, and Toxapex to effectively break them. Triple Axel is used for the larger damage output, but Ice Spinner can be used for a consistent and accurate STAB move. Icicle Crash avoids residual damage from contact abilities like Iron Barbs while also avoiding Static, Flame Body, and Rocky Helmet. Knock Off is usually preferred, as it can remove items from Toxapex and Ferrothorn and support Weavile's team, but Darkinium Z paired with Throat Chop allows Weavile to nuke its checks, mainly Toxapex, Corviknight, and Ferrothorn. Tera Dark removes Weavile's weakness to Bullet Punch from Mega Scizor while also propelling Knock Off's damage to nearly unstoppable levels. Pivot support from the likes of Landorus-T, Tornadus-T, and Tapu Koko helps Weavile by bringing it safely onto the field while also allowing it to set up, making it more consistent. Magnezone works well with Weavile, as it can trap and remove Mega Scizor, Ferrothorn, and Corviknight for it. In return, Weavile pressures Ground-types like Landorus-T and Garchomp. Weavile also appreciates being paired with strong wallbreakers that share checks with it such as Kartana, Tapu Lele, and Mega Mawile, as they can overwhelm them throughout the game. Weavile enjoys Spikes support from Ferrothorn, Ting-Lu, and Garchomp, as it forces chip damage on its checks, such as Mega Scizor, Toxapex, and Iron Hands.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 589564, "username": "hidin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 515767, "username": "Ryuji"}]}
  },
  "Magnezone": {"sets": [{"name": "Choice Scarf", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Rotom-Wash": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Rotom-W is a stupendously effective pivot on teams because its great defensive profile allows it to check a laundry list of threats like Mega Swampert, Tornadus-T, and Mega Scizor. Volt Switch lets Rotom-W start the spin cycle, pivoting out on opposing threats that it lures in like Ferrothorn and Dragapult, helping to position teammates favorably. Hydro Pump is a fantastic complement to Volt Switch, leaving Ground-types like Great Tusk and Landorus-T out to dry. Will-O-Wisp neutralizes physical sweepers like Mega Scizor, Kingambit, and Dragonite, hampering their hopes to use Rotom-W as setup fodder. Pain Split provides Rotom-W longevity in conjunction with Leftovers, but Defog can be used for entry hazard control, as Rotom-W easily folds common Stealth Rock setters like Great Tusk and Ting-Lu. Despite this, Rotom-W struggles to remove entry hazards against offensive setters like Garchomp and often misses the recovery that Pain Split offers. Tera Ghost improves Rotom-W’s matchup against the likes of Zamazenta, Great Tusk, and Mega Medicham while letting it spinblock against Great Tusk. Tera Steel gives Rotom-W a Toxic immunity and valuable resistances, improving its prospects against the likes of Kartana, Clodsire, and Toxapex. Strong wallberakers like Dragapult, Heatran, and Nasty Plot Tornadus-T all appreciate Rotom-W positioning them against walls like Ferrothorn, Gholdengo, and Dragonite. Iron Valiant likes Rotom-W luring out Dragon-types like Dragapult and Dragonite. Teammates such as Volcarona, Zamazenta, and Mega Scizor can check Grass-types for Rotom-W as well. Notably, Mega Scizor forms a great VoltTurn core with Rotom-W, as Mega Scizor irons out threats that Rotom-W has trouble with like Kartana, Weavile, and Tapu Lele, while Rotom-W can deal with common Mega Scizor checks such as Zapdos and Skeledirge.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Rotom-W functions as a shockingly potent pivot, as a lightning-quick Volt Switch allows it to reliably create big surges of momentum for teammates. Will-O-Wisp reliably chips down bulkier threats like Mega Scizor and Garchomp while also surprising faster physical attackers such as Mega Lopunny. Thunder Wave is an option that can pour a cold water onto a sea of speedy sweepers such as Dragon Dance Dragapult and Swords Dance Kartana, slowing them down. Trick stifles walls like Ferrothorn and Gastrodon who could otherwise stem the tide of Rotom-W’s momentum. Choice Scarf Rotom-W should not be Terastalizing in most cases, but a Steel or Ghost typing can be situationally useful against prominent metagame forces such as Great Tusk and Tapu Lele. Other pivots such as Mega Scizor, Tornadus-T, and Victini can create formidable VoltTurn cores with Rotom-W. Victini in particular deals with Grass-types like Ferrothorn and Kartana, while Rotom-W can threaten physically defensive walls such as Landorus-T and Great Tusk. Strong wallbreakers like Heatran, Iron Valiant, and Mega Medicham pair swimmingly with Rotom-W, as they plow through common defensive staples such as Gastrodon and Ferrothorn and benefit from Rotom-W pivoting them into advantageous positions.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 241308, "username": "sanguine"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidin"}]}
  },
  "Zoroark-Hisui": {
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Hisuian Zoroark plays as a terrifying setup sweeper with its Nasty Plot set, as it has an amazing STAB combination and can bait Pokemon with Illusion. It can break through Heatran, Ferrothorn, Ting-Lu, and Kingambit with Focus Blast, which in tandem with Tera Fighting allows Hisuian Zoroark to strengthen its Focus Blast to break the aforementioned threats more easily while also baiting Sucker Punch from Kingambit. Setup sweepers and wallbreakers like Mega Scizor and Iron Valiant appreciate Hisuian Zoroark baiting Skeledirge and Gholdengo. In return, Mega Scizor deals with Weavile and Kartana while Iron Valiant threatens Ting-Lu and Kingambit. Great Tusk is also a valuable teammate, as it deals with threats like Kingambit and Mega Lopunny while also providing general utility. While Hisuian Zoroark is powerful, it is vulernable to revenge killers such as Mega Lopunny, Dragapult, and Tapu Koko. As such, Pokemon like Zapdos, Slowbro, Ferrothorn, Kingambit and Great Tusk are good partners. Checks to revenge killers like Choice Scarf Tapu Lele and Dragapult are recommend; these include Mega Scizor, Gholdengo, Ting-Lu, Kingambit, and Heatran.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 589564, "username": "hidin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 590164, "username": "georgebowserjr"}]}
  },
  "Amoonguss": {"sets": [{"name": "Defensive", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Alomomola": {"sets": [{"name": "Defensive"}]},
  "Hydreigon": {"sets": [{"name": "Choice Specs"}, {"name": "Fire Spin", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Volcarona": {
    "sets": [
      {
        "name": "Offensive Quiver Dance",
        "description": "<p>Volcarona makes for a threatening late-game sweeper thanks to Quiver Dance, strong coverage moves, and a decent defensive profile. Fire Blast can be slotted over Flamethrower to hit much harder, notably OHKOing most variants of Gholdengo, but Flamethrower is usually better because of its consistency. Volcarona can utilize Giga Drain with Tera Grass to hit a plethora of Water-type Pokemon like Gastrodon, Rotom-W, and Urshifu-R hard, in addition to Ground- and Rock-types such as Great Tusk and Garganacl. Hidden Power Ground and Tera Ground help Volcarona bypass checks like Toxapex and Heatran after slight chip damage while also removing Volcaronra’s glaring Rock weakness. Psychic with Tera Psychic allows Volcarona to break through Clodsire and Toxapex more reliably, but it is inferior to either of the previously mentioned Tera types due to its greater vulnerability to being revenge killed, and it leaves Volcarona completely stonewalled by Heatran. Flame Body can threaten to burn physical attackers like Mega Lopunny and Zamazenta, crippling them. Maximum Speed investment and a Timid Nature lets Volcarona outrun Choice Scarf users such as Tapu Lele and Urshifu-R after a boost. Modest can be run to hit walls like Clodsire and Toxapex harder, but it leaves Volcarona much more vulnerable to the aforementioned Choice Scarf users. Volcarona’s defensive utility is appreciated by allies such as Urshifu-R and Kingambit, as it can check dangerous Fighting-types like Iron Valiant and Zamazenta in a pinch. Bulky Dragon-types like Dragonite and Garchomp can use it as setup fodder—with the latter additionally threatening Volcarona’s longevity with Toxic—so allies that can handle them such as Ferrothorn and Rotom-W are great partners to support Volcarona in its sweep. Heatran and Toxapex wall Volcarona if it doesn’t have Hidden Power Ground, so teammates like that can check them such as Garchomp and the aforementioned Rotom-W are much appreciated. Heatran also makes for a great ally, as it can eliminate or cripple Toxapex, Clodsire, and Skeledirge, which clears the way for Volcarona to clean up late-game.</p> "
      },
      {
        "name": "Bulky Quiver Dance",
        "description": "<p>Volcarona distinguishes itself as a bulky setup sweeper by boasting reliable recovery, Quiver Dance, and being able to check Zamazenta and Iron Valiant with its unique typing. Bug Buzz can hit Mega Gyarados, Garchomp, and Mega Latias harder, but Giga Drain can be run to hit Water-types such as Urshifu-R, Gastrodon, and Rotom-W. Psychic can also be ran to threaten Clodsire and Toxapex. Will-O-Wisp makes Volcarona more utility-oriented, threatening physical attackers like Zamazenta and Dragonite with a burn more reliably, crippling them. However, the lack of coverage leaves Volcarona walled easily by most Fire-resistant Pokemon. The given Speed EVs allow Volcarona to outspeed Dragapult after a Quiver Dance, with the rest invested in HP and Defense so that it will always be 3HKOed by Zamazenta and defensive Great Tusk’s Earthquake. Volcarona struggles with status conditions, as they can hinder its ability to check threats like Zamazenta and Iron Valiant in the long term, thus status absorbers like Gliscor and Toxapex make good partners; the former provides Defog support, a Knock Off absorber, and a Heatran check, and the latter helps prepare Volcarona’s sweep with Knock Off and status inducement. Volcarona can be easily exploited by setup sweepers like Garchomp, Dragapult, Mega Tyranitar, and Dragonite, and so checks like Rotom-W, Kingambit, Ferrothorn, and Tapu Lele can help to alleviate these matchups.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 589564, "username": "hidin"}, {"user_id": 241308, "username": "sanguine"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 603814, "username": "SoBalancedGuys"}]}
  },
  "Greninja": {"sets": [{"name": "Choice Scarf"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Toxapex": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Toxapex acts as a fantastic defensive pivot on bulkier playstyles courtesy of its excellent bulk and Regenerator. This allows it to scout Choice-locked Pokemon such as Dragapult and Zamazenta and pivot around powerful attackers such as Iron Valiant. Scald and Knock Off allow Toxapex to meaningfully threaten foes and make progress by either causing crippling status or removing the foe's item respectively, while Toxic takes advantage of Toxapex's excellent bulk and Regenerator, putting foes on a timer for its teammates. Haze removes boosts from the likes of Dragon Dance Dragapult and Espathra. Other options such as Toxic Spikes and Baneful Bunker can be explored over either Toxic or Haze, with the intent to cripple offensive teams or maximize Toxapex's ability to scout and pivot, respectively. However, removing Toxic leaves Toxapex worse off against common Pokemon such as Skeledirge and Rotom-W, while removing Haze makes it harder to handle setup sweepers. Although Toxapex rarely Terastallizes, Tera Dragon ensures Rotom-W's Volt Switch never outdamages Regenerator while also removing its Ground and Electric weaknesses against the likes of Great Tusk and Tapu Koko. The EV spread maximizes Toxapex's physical Bulk while allowing it to survive two Scorching Sands from Mega Charizard Y. Toxapex fits best on defensively oriented teams, which don't mind its passivity and can make up for any of its defensive shortcomings. Toxapex pairs well with Unaware Pokemon such as Skeledirge and Clodsire, which can handle setup sweepers that Toxapex falters to such as Kingambit and Gholdengo. In return, Toxapex sponges various weaker attacks using Regenerator from the likes of Gastrodon and Rotom-W. Toxapex dislikes losing its item, as it can easily be pushed into KO range against wallbreakers such as Zamazenta and Dragapult alongside entry hazards. As such, Pokemon that can generally withstand Knock Off well, such as Flyinium Z Tornadus-T and Gliscor, pair excellently with it. Tornadus-T in particular makes for a great partner, as it can use Regenerator alongside Toxapex, pivoting between each other to handle Pokemon such as Great Tusk and Garganacl. Toxapex appreciates extra insurance against strong special attackers such as Tapu Lele and Iron Valiant. As such, Steel-types such as Gholdengo and Heatran pair well, especially since Toxapex can switch into the Shadow Balls and Focus Blasts aimed that them respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 589564, "username": "hidin"}, {"user_id": 515767, "username": "Ryuji"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 544502, "username": "ChrisPBacon"}]}
  },
  "Cinderace": {"sets": [{"name": "Swords Dance"}, {"name": "Offensive Pivot"}]},
  "Corviknight": {"sets": [{"name": "Defensive Pivot"}]},
  "Barraskewda": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Thanks to its high offensive stats alongside Swift Swim, Choice Band Barraskewda is a premier wallbreaker, offensive pivot, late-game cleaner, and revenge killer on rain teams. Its blistering Speed tier allows it to nearly outpace the entire metagame under rain, including boosted foes like Dragon Dance Dragapult and Mega Swampert. Liquidation's Defense drop lets it potentially 2HKO Pokemon such as Dragapult and Pelipper, while Waterfall's flinches gives Barraskewda slightly better odds to muscle past the likes of Slowbro and Toxapex. Flip Turn keeps up momentum by providing free entry for its teammates while chipping down switch-ins like Dondozo and Tangrowth. Close Combat hits Water-resistant foes such as Ferrothorn, Kartana, and Mega Gyarados, and it provides strong neutral coverage against the likes of Tera Water Great Tusk, Tera Grass Volcarona, and Gastrodon. Aqua Jet prevents Barraskewda from being revenge killed by priority attacks like Kingambit and Mega Mawile's Sucker Punch and—if rain is not active—lets it pick off faster threats such as Sand Rush Excadrill and boosted Volcarona and Iron Valiant. Alternatively, Psychic Fangs pressures Toxapex, Amoonguss, and Water Absorb Clodsire better. Tera Water skyrockets Barraskewda's rain-boosted STAB moves further, potentially 2HKOing even Water-resistant Pokemon like Ferrothorn and Rotom-W. Pelipper is a necessary teammate that spearheads rain teams by reliably summoning rain with Drizzle. Mega Swampert is a fantastic offensive partner that can overwhelm shared checks like Rotom-W, Dondozo, and Slowbro and appreciates Barraskewda's Flip Turn to bring it in safely on foes such as Toxapex, Dragapult, and Dragonite. Tornadus-T and Ferrothorn are rain team staples that support Barraskewda with Knock Off, crippling walls such as Rotom-W and opposing Ferrothorn; Ferrothorn in particular helps threaten Gastrodon with Power Whip and sets entry hazards to soften up foes. The aforementioned Pelipper and Tornadus-T also provide Defog support for Barraskewda to pivot throughout the game unperturbed, bring it in safely via U-turn, and threatens problematic Grass-types like Tangrowth and Tera Grass Heatran.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 580037, "username": "TheSorcer3r"}, {"user_id": 515767, "username": "Ryuji"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Polteageist": {"sets": [{"name": "Shell Smash", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Hatterene": {"sets": [{"name": "Calm Mind", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Dragapult": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance Dragapult is one of the most dangerous setup sweepers in the tier due to its blazing Speed and immense power. After a Dragon Dance, Dragapult outspeeds all Choice Scarf and Booster Energy users, such as Kartana, Greninja, and Iron Valiant, making it extremely hard to stop if it sets up successfully. Ghostium Z-powered Phantom Force enables a boosted Dragapult to blast through bulky Steel-types such as Corviknight, Ferrothorn, and Heatran after slight chip damage. Dragapult's typing gives it opportunities to switch in and set up against certain Pokemon such as Volcarona, non-Ice Spinner Dragonite, and Urshifu-R locked into a Fighting-type move. Substitute is the preferred option in the last moveslot to ease prediction and facilitate setup while also avoiding priority. Substitute also allows Dragapult to play mind games with Kingambit. Fire Blast is another option that allows Dragapult to deal massive damage to physically defensive Ferrothorn and Mega Scizor, both of which can survive a boosted Never-Ending Nightmare at full health. Clear Body is the preferred ability to avoid stat drops from Intimidate, but Infiltrator can also be used to improve the matchup against dual screens and Shed Tail teams. A Jolly nature lets Dragapult outspeed Mega Lopunny and Tapu Koko prior to setting up. Dragon Dance Dragapult fits best on offensive teams, where it can function as a potent late-game cleaner with its Z-Move. Entry hazard support from Great Tusk, Garchomp, and Glimmora can help chip bulky foes such as Mega Tyranitar and Kingambit into range of Dragapult's attacks. Gholdengo can block attempts to remove entry hazards, as well as pressure certain physical walls that give Dragapult a hard time, such as Ferrothorn. Dragapult can struggle with bulky physical walls such as Dondozo, Garganacl, and post-Tera Skeledirge, so powerful special wallbreakers that can take advantage of these Pokemon, such as Tapu Lele and Mega Charizard Y, are greatly appreciated. Tapu Lele also provides Psychic Terrain, which thwarts revenge killing attempts from priority moves. A late-game cleaner such as Dragonite or Booster Energy Iron Valiant can take advantage of the holes Dragapult left behind in the enemy defensive core.</p> "
      },
      {
        "name": "Hex",
        "description": "<p>Despite Hex Dragapult's lack of immediate offensive presence, it can be a very annoying threat; it excels in getting around many of Dragapult's normal checks and counters, pivoting to dangerous teammates, and spreading status. Against common checks like Ting-Lu, Clodsire, and Toxapex, it can bring in Pokemon like Urshifu-R, Great Tusk, and Tapu Koko, respectively, to punish the opponent. Will-O-Wisp boosts Hex to monstrous levels and threatens to pacify physical attackers like Mega Lopunny, Zamazenta, and Kingambit. Dragon Darts is a strong physical move to better hit special walls like Clodsire, forcing it to recover lest Dragapult's teammates like Iron Valiant break through. With Tera Ghost, it can muscle through specially defensive Toxapex after burn and entry hazard damage with Hex, though Tera Fairy helps it tank hits from opposing Dragapult and Dark-type moves like Pursuit, and it can still check Zamazenta. Infiltrator allows it to check threats behind Substitutes, most notably Iron Defense Zamazenta and Shed Tail receivers like Dragonite. Dragapult struggles to break through Heatran, so Pokemon that can pressure it such as Garchomp and Rotom-W are great partners. It also must be careful around Pursuit trappers like Kingambit and Mega Tyranitar, as even after a burn they heavily chip it; teammates like Urshifu-R, Iron Valiant, and Great Tusk are thus mandatory to threaten said trappers. Pokemon like Tapu Lele and Mega Charizard Y very much appreciate Dragapult crippling and weakening Kingambit and Tyranitar, respectively, as this aids in the process of removing them. In return, Dragapult can clean up the opposing team after its checks are gone. Pivots like Rotom-W and Corviknight bring Dragapult in, with the former checking Heatran and forming a nice VoltTurn core with it, and the latter tanking Dragon- and Fairy-type moves for it. Entry hazards and Knock Off from the likes of Ferrothorn and Great Tusk weaken the opposition for Dragapult to clean, notably its checks like Toxapex and Clodsire.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Dragapult is a menacing wallbreaker, being able to threaten many teams with its STAB Shadow Ball and Draco Meteor. The former in particular is very spammable, as only a limited pool of Pokemon can switch into it. U-turn takes advantage of this limited pool, pressuring Shadow Ball switch-ins like Kingambit and Mega Tyranitar while bringing in teammates such as Urshifu-R and Zamazenta. Flamethrower hits Kingambit for massive damage, while Hydro Pump helps against Mega Tyranitar and Ting-Lu. Finally, Thunder pressures would-be checks, such as Toxapex. Ghost is the best Tera type for Dragapult, as it propels its Shadow Ball to a near-unstoppable level, making it even more spammable. Dragon boosts Draco Meteor's damage while making Dragapult less susceptible to Pursuit, while Tera Fairy purely helps it defensively: not only does it not fear Pursuit, but it's also not weak to Ice Shard or Sucker Punch from Weavile and Kingambit, respectively. Finally, it gives Dragapult a Dragon immunity, which allows you to beat Dragon Dance Dragapult after it burns the Z-Move. Dragapult must be wary of Pursuit from Mega Tyranitar and Kingambit, as they can both shrug off multiple Shadow Balls and remove it from the game. However, it can pivot around its checks, so Pokemon that can take advantage of and remove them make great partners, such as Urshifu-R, Zamazenta, and Iron Valiant. The latter two also share checks with Dragapult, like Clodsire and Toxapex, meaning they can overwhelm these checks. Dragapult also greatly appreciates Knock Off support from Tornadus-T, Weavile, or Ferrothorn, as its checks such as Ting-Lu, Kingambit, and Garganacl all rely a lot on their items. Finally, since checks such as the aforementioned Mega Tyranitar and Kingambit are very susceptible to Spikes, Dragapult appreciates its setters such as Ting-Lu, Ferrothorn, and Gastrodon.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 515767, "username": "Ryuji"}, {"user_id": 529732, "username": "adem"}, {"user_id": 385157, "username": "2020 idm boomer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 603814, "username": "SoBalancedGuys"}, {"user_id": 272785, "username": "nimzowitsch"}, {"user_id": 515767, "username": "Ryuji"}]}
  },
  "Meowscarada": {"sets": [{"name": "Offensive Pivot"}, {"name": "Choice Band"}]},
  "Skeledirge": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>When it comes to Unaware Pokemon, Skeledirge is one of the best available; it has great physical bulk and a solid move in Torch Song, which boosts its already good Special Attack. These traits make it a hard-to-break physical wall and a potential wincon as well. Will-O-Wisp lets it cripple physical attackers such as Mega Tyranitar, Garchomp, Great Tusk, and Landorus-T while also punishing Water-types such as Rotom-W. Combined with Will-O-Wisp, Hex helps it overwhelm passive checks in Toxapex, Gastrodon, and Clodsire while also allowing Skeledirge to sweep statused teams. While not as strong as Hex, Shadow Ball is a decent option as it's more consistent. Tera Water allows Skeledirge to beat rain teams by spreading burns against rain sweepers such as Mega Swampert, Barraskewda, and Floatzel. On the other hand, Tera Fairy allows it to counter Dragon Dance Dragapult and avoid Pursuit from Kingambit, Mega Tyranitar, and Weavile while also keeping a Fighting resistance, meaning it can still check Zamazenta. It also removes Skeledirge's Ground weakness, allowing it to comfortably burn Pokemon like Garchomp, Great Tusk, and Landorus-T. Skeledirge struggles against Heatran and Garganacl, as it can't burn them nor deal significant damage to them. Therefore, Pokemon that pressure them like Garchomp and Rotom-W for the former and Cover Cloak Gholdengo for the latter make good partners. Skeledirge also hates losing its item, so Knock Off absorbers like Flyinium Z Tornadus-T and Gliscor make for good teammates. The former can also weaken Heatran for it while Skeledirge can burn Mega Tyranitar. Special sponges like Gastrodon, Clodsire, and Toxapex all appreciate Skeledirge's ability to cripple physical attackers such as Kartana, Mega Lopunny, and Kingambit, alleviating the pressure these Pokemon exert on them. In return, they can all handle special attackers like Gholdengo, Choice Specs Dragapult, and Mega Charizard Y.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 385157, "username": "2020 idm boomer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 515767, "username": "Ryuji"}]}
  },
  "Quaquaval": {"sets": [{"name": "Swords Dance"}, {"name": "Bulk Up", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Garganacl": {
    "sets": [
      {
        "name": "IronPress",
        "description": "<p>Garganacl is an astounding wincon due to the combination of Iron Defense + Body Press allowing it to beat Pokemon like Dragonite, Kingambit, and Great Tusk. Salt Cure makes easy progress and accrues chip damage on switch-ins like Gholdengo, Rotom-W, Heatran, and Great Tusk while also forcing Pokemon like Gastrodon and Mega Scizor to burn their recovery PP more often, making them passive and more easily worn down. Recover allows Garganacl to check Pokemon like Tornadus-T and Dragapult long-term and increasess its sustainability as a wincon. Tera Water allows Garganacl to check Pokemon like Gholdengo and Urshifu-R while providing valuable resistances to Steel- and Water-type moves. Notably, It allows Garganacl to stave off rain attackers such as Mega Swampert and Barraskewda. Alternatively, Tera Fairy lets Garganacl reliably set up in front of Pokemon like Great Tusk and Zamazenta while also being a near hard check to Dragapult. Maximum Special Defense investment allows Garganacl to deal with Pokemon like Tapu Koko and Choice Specs Dragapult reliably. Pokemon like Toxapex, Clodsire, and Gholdengo pair well with Garganacl as they serve as reliable defensive checks to strong wallbreakers like Urshifu-R, Iron Valiant, and Tapu Lele, respectively. Entry hazard removers like Tornadus-T and Great Tusk are also appreciated, as Garganacl is susceptible to chip damage from entry hazard. Garganacl mandates Knock Off support to serve as an effective wincon, as it can be pivoted around with Regenerator Pokemon holding Heavy-Duty Boots such as Toxapex and Slowbro without it. As such, partners such as the aforementioned Tornadus-T and Kingambit are useful. It additionally needs entry hazard support from Pokemon such as Clodsire and Heatran to outdamage Regenerator. Wallbreakers like Iron Valiant and Kartana appreciate their checks in Skeledirge and Gholdengo from being worn down by Salt Cure; these Pokemon also appreciate having Garganacl as a wall to fall back on. like Weavile, Tapu Lele, and Kingambit pair well with it, as they can immediately remove Pokemon that Garganacl would struggle with, such as Covert Cloak Gholdengo and Urshifu-R, letting it clean late-game.</p> "
      },
      {
        "name": "Stealth Rock",
        "description": "<p>Garganacl is a great entry hazard setter, as it takes advantage of the myriad of switches it forces with Salt Cure and ability to exploit passive Pokemon such as Toxapex and Clodsire. Salt Cure aggressively accumulates chip damage on switch-ins such as Urshifu-R and Kartana, and it punishes entry hazard removers like Great Tusk, Rotom-W, and Tornadus-T. Protect allows Garganacl to accrue more recovery from Leftovers and scout Pokemon like Great Tusk, Iron Valiant, and Dragapult, all while accruing chip damage on them with Salt Cure. Recover maintains Garganacl's longevity against Pokemon like Dragapult and Tapu Koko. Tera Water gives it neat resistances to Gholdengo's Make It Rain and Urshifu-R's Surging Strikes while also improving its matchup against rain wallbreakers such as Mega Swampert and Floatzel. Tera Fairy lets it handle Pokemon like Tera Grass Volcarona and Zamazenta safely, and it renders Dragapult useless against it. Maximum Special Defense investment allows Garganacl to deal with Pokemon like Volcarona, Tornadus-T, and Tapu Lele reliably. Pokemon like Toxapex, Kingambit, and Gholdengo support Garganacl as they deal with strong wallbreakers like Urshifu-R, Gholdengo, and Tapu Lele; Gholdengo in particular makes an amazing teammate as it prevents Defog and Rapid Spin from clearing Garganacl's Stealth Rock while also dealing with Pokemon like Mega Scizor and Kartana. Garganacl appreciates Knock Off users such as Tornadus-T and Toxapex, as they let it beat Regenerator Pokemon such as Slowbro and Toxapex with its own entry hazards. Pokemon that like their defensive checks being worn down due to Stealth Rock and Salt Cure such as Tapu Lele and Mega Medicham appreciate Garganacl's presence, as it wears down Pokemon like Tornadus-T and Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515767, "username": "Ryuji"}, {"user_id": 544502, "username": "ChrisPBacon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidin"}]}
  },
  "Armarouge": {"sets": [{"name": "Stored Power", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Ceruledge": {"sets": [{"name": "Swords Dance"}, {"name": "Bulk Up", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Cyclizar": {
    "sets": [
      {
        "name": "Support",
        "description": "<p>Cyclizar provides invaluable utility on hyper offense with Rapid Spin, Knock Off, and Shed Tail. Rapid Spin removes entry hazards, which are detrimental to allies like Dragonite lacking Heavy-Duty Boots and Mega Gyarados. Taunt can be used over Draco Meteor to stifle passive foes like Gastrodon and Ferrothorn, preventing them from laying entry hazards or using recovery. Knock Off removes items from the likes of Ferrothorn, Ting-Lu, and Clodsire, crippling them. Shed Tail gives allies a free switch-in, allowing them to avoid status conditions and boost safely if the Substitute stays intact. Sitrus Berry allows Cyclizar to reliably pass Shed Tail against priority moves from the likes of Mega Scizor and Dragonite, and it helps ensure it can pass multiple Substitutes during a game. Cyclizar typically doesn’t use Tera, as its more offensive teammates such as Dragonite and Annihilape take advantage of Tera much more effectively. However, Tera Fairy gives Cyclizar crucial resistances, allowing it to survive hits from Zamazenta and Dragapult and turn the tables on them. Sweepers like Dragonite, Mega Gyarados, and Dragapult utilize dual screens and Shed Tail support to set up safely and survive potential revenge killers such as Mega Lopunny and Kingambit. Either Tapu Koko or Grimmsnarl is a mandatory partner for Cyclizar; they help enable sweepers by setting up dual screens for them and make the Substitutes that Cyclizar passes harder to break. Tapu Koko notably provides Electric Terrain for Iron Valiant, increasing its effectiveness. Faster threats like Mega Lopunny, Dragapult, and Iron Valiant can force Cyclizar out; thus, Pokemon like Kingambit and Volcarona make great partners that cover for Cyclizar and exploit its checks.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Cyclizar provides utility and Speed control to ones team, able to pass fast Substitute to teammates and to revenge kill weakened opponents. Overheat, Thunderbolt, and Power Whip provide excellent coverage to hit many Pokemon like Gholdengo, Mega Charizard Y, and Mega Swampert, respectively. Knock Off and Rapid Spin can be utilized for a more supportive role, though it will increase Cyclizar’s passivity. A Naive nature should be used with Power Whip to have a high chance of OKHOing Mega Swampert after Stealth Rocks. Cyclizar can pack Tera Fairy to check Dragapult while Tera Steel can give it many resistances, helping it check the likes of Mega Scizor and Weavile. Strong wallbreakers and setup sweepers like Zamazenta, Iron Valiant, and Mega Gyarados greatly appreciate Cyclizar’s Shed Tail granting them free switch ins. Teammates like Zamazenta appreciate avoiding crippling status and getting more opportunities to set up with Howl. Gholdengo and Iron Valiant love the opportunities to switch in safely and help exploit Cyclizar’s checks in Iron Valiant and Zamazenta. Mega Gyarados and Volcarona benefit from Shed Tail while also threatening Great Tusk and Mega Lopunny, who seek to take advantage of Cyclizar. Tapu Koko also is a great ally that provides support with dual screens, making the Substitutes Cyclizar passes harder to break.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 580037, "username": "TheSorcer3r"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 603814, "username": "SoBalancedGuys"}]}
  },
  "Glimmora": {
    "sets": [
      {
        "name": "Suicide Lead",
        "description": "<p>Glimmora is a valuable dedicated lead on hyper offense teams that can reliably set up multiple entry hazards in Stealth Rock, Toxic Spikes, and potentially Spikes, as well as remove opposing ones with Mortal Spin. It can make use of its solid coverage options and remarkable Special Attack to pose a noticeable offensive threat itself, especially against common entry hazard setters, removers, and other dedicated leads. Power Gem threatens the metagame's best Defogger in Tornadus-T, while Sludge Bomb dents screens setters such as Grimmsnarl and Tapu Koko and—if Focus Sash is still intact—Tapu Lele and Iron Valiant as well, which can be problematic against offensive teams. Earth Power pressures Steel-types like Heatran, Gholdengo, and Kingambit that would otherwise block Glimmora's Mortal Spin, while Energy Ball deals with other entry hazard setters and removers such as Great Tusk, Gastrodon, Mega Swampert, and Rotom-W. Focus Sash guarantees that Glimmora can set at least one layer of entry hazards, potentially letting Toxic Debris trigger twice as well. Tera Ghost is used in a pinch to spinblock foes such as Great Tusk, Cyclizar, and Excadrill and remove its Ground weakness to set up multiple entry hazards in the face of other setters like Landorus-T, Garchomp, and Gastrodon. Gholdengo is a near-mandatory teammate to keep up entry hazards by blocking every attempts to remove them, such as Defog and Rapid Spin. Setup sweepers like Kingambit, Volcarona, Dragapult, Annihilape, and Iron Valiant appreciate entry hazards wearing down foes such as Dondozo and Clodsire and not being chipped down by opposing ones themselves; particularly, Kingambit's Knock Off can remove Heavy-Duty Boots from the likes of Tornadus-T, Toxapex, and Volcarona to make them vulnerable to Glimmora's entry hazards.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515767, "username": "Ryuji"}, {"user_id": 589564, "username": "hidin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Dondozo": {
    "sets": [
      {
        "name": "Curse",
        "description": "<p>Thanks to its massive physical bulk and ability, Unaware, Dondozo serves as a wall for physical setup sweepers, such as Dragonite, Kingambit, and Dragon Dance Dragapult. Dondozo also annoys rain teams, shutting down wallbreakers such as Floatzel, Barraskewda, and Mega Swampert. With Curse, Dondozo can also function as a late-game sweeper. Liquidation is preferred to Wave Crash given that it has more PP and does not incur recoil. However, Wave Crash can also be considered for its greater power. Leftovers is preferred to maximize longevity; however, Heavy-Duty Boots is worth consideration to fortify switches into entry hazards. Tera Grass transforms Dondozo's Electric and Grass weaknesses into resistances, turning common threats in Tapu Koko and Kartana into fodder and avoiding Leech Seed from Ferrothorn. Dondozo fits best on bulky offense and balance teams, as they greatly appreciate its ability to wall physical setup sweepers. Given its mediocre special bulk, special walls such as Clodsire and Ting-Lu make for good teammates, as they can switch into special attackers such as Tapu Koko, Tera Grass Volcarona, and Choice Specs Dragapult. Gholdengo is another good teammate since it checks dangerous special wallbreakers such as Tapu Lele and Iron Valiant that can play around Dondozo's commonly paired special walls. Other Pokemon that can beat these threats include Mega Scizor and Clodsire.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 385157, "username": "2020 idm boomer"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}]}
  },
  "Annihilape": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Annihilape's amazing bulk and the fantastic Rage Fist make it an amazing late-game wincon and wallbreaker. Bulk Up makes it harder for foes such as Great Tusk and Dragonite to break through it, as well as allowing it to break through defensive Pokemon like Buzzwole and Mega Scizor. Taunt prevents status, recovery, and set up from Pokemon like Skeledirge, Mega Scizor, and Landorus-T while also forcing foes to damage Annihilape, boosting the power of Rage Fist. Rage Fist lacks no switch-in once boosted up and allows Annihilape to demolish Pokemon that wouldn't mind it unboosted, such as Gholdengo and Mega Scizor. It also notably invalidates Unaware, enabling it to break through Pokemon like Clodsire and Skeledirge. Drain Punch provides Annihilape with some additional recovery, preventing it from being worn down quickly. Rest combined with Chesto Berry can be used over Taunt, as it provides Annihilape with a one-time way to recover HP and status, as well as being the premier way to heal from strong incoming hits, but it can be easily exploited if the foe is able to chip down Annihilape enough. Tera Water is the premier option, as it boosts Annihilape's defensive profile, giving it resists to moves like Urshifu-R's Surging Strikes and Gholdengo's Make It Rain. Fairy is another option that gives Annihilape nice resistances to moves like Mega Lopunny's Close Combat and an immunity to Draco Meteor or Dragon Darts from Dragapult. Tera Fire gives Annihilape an immunity to Will-O-Wisp from Pokemon like Skeledirge and Rotom-W while giving it a Fairy resistance as well, preventing the likes of Mega Diancie and Iron Valiant from revenge killing it. Notably, all of these types give Annihilape a Flying- and Ghost-type neutrality, preventing Pokemon such as Tornadus-T, Dragapult, and Gholdengo from revenge killing it as easily. 28 Speed EVs help Annihilape outspeed Pokemon such as Mega Tyranitar, Gholdengo, and Rotom-W. The other EVs maximize its special bulk, letting it take hits comfortably from Pokemon like Heatran and Volcarona. Dual screens setters like Tapu Koko and Grimmsnarl let Annihilape tank hits more easily. Entry hazard support from Pokemon like Ting-Lu, Ferrothorn, and Heatran to wear down Pokemon like Iron Valiant and Tapu Lele is appreciated. Allies like Heatran and Tyranitar handle Pokemon such as Tapu Lele, Iron Valiant, and Tornadus-T, with Annihilape cleaning up once the aformentioned threats are removed.</p> "
      },
      {
        "name": "Entry Hazard Lead",
        "description": "<p>Annihilape carves a niche in being a Stealth Rock user that is immune to Rapid Spin from foes like Great Tusk and Iron Treads. Annihilape being a Defog deterrent due to Defiant, as well as its bulk and Final Gambit picking up easy KOs also strengthens this niche. Final Gambit lets Annihilape safely bring in a teammate while dealing massive damage due to its large HP stat. Taunt denies other entry hazards from being set up by Pokemon like Ting-Lu and preventing the use of Defog from Pokemon like Rotom-W and Tornadus-T on the switch. Defog can also activate Defiant, giving Annihilape way more offensive output for Rage Fist and making it easier to pick up a KO. Annihilape won't be Terastallizing often, but Tera Ghost can be used to boost the power of Rage Fist in scenarios where it is boosted, and it gives Annihilape neutralities to moves like Mega Diancie's Moonblast and Tornadus-T's Hurricane or Bleakwind Storm. Annihilape fits on hyper offense exclusively, so Pokemon that benefit from entry hazards being simultaneously denied and set up, such as Iron Valiant and Dragonite, are good partners. Pokemon like Tornadus-T and Mega Diancie are very big problems for Annihilape, so partners like Gholdengo and Mega Scizor are very valuable. Final Gambit removing Pokemon like Great Tusk and Tornadus-T can also be a big help to teammates like Kingambit and Dragonite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidingflames"}]}
  },
  "Clodsire": {
    "sets": [
      {
        "name": "Unaware Wall",
        "description": "<p>Clodsire serves as a fantastic special wall, able to take on powerful attackers such as Dragapult and Mega Diancie while simultaneously stopping setup sweepers such as Gholdengo and Volcarona. Spikes are preferred on Clodsire, as the move has more limited distribution and Clodsire enters the field commonly enough to have the opportunity to use the move. However, Stealth Rock can be used if Clodsire's team requires it. Toxic is used to cripple common switch-ins to Clodsire, such as Landorus-T, Tornadus-T, and Great Tusk. Poison Jab can be used to poison post-Tera Gholdengo attempting to remove its Ground weakness, and it forces damage on Tornadus-T faster. Heavy-Duty Boots are preferred on Clodsire to negate its weakness to opposing Spikes teams, although Leftovers are also viable to increase Clodsire's longevity. Unaware is preferred over Water Absorb to negate Clodsire's passivity against setup sweepers, and Water Absorb does little to help against the likes of Mega Swampert and Gastrodon. Tera Dark grants Clodsire a Ghost resistance, which helps against Choice Specs Dragapult and Gholdengo, especially if using Poison Jab against the latter. It also grants Clodsire with a Pursuit resistance against the likes of Kingambit and Mega Tyranitar, which can both exploit its physical frailty. Clodsire fits best on defensively oriented teams that appreciate its special walling and entry hazard support. As Clodsire is weak to most physical attackers such as Kingambit, Great Tusk, and Dragonite, teammates that can cover them, such as Toxapex, Skeledirge, and Buzzwole, make for good partners. In return, Clodsire can switch into Electric-type attacks for the former, and powerful special attackers such as Dragapult for the latter two. Pokemon that benefit from Spikes support, such as Tornadus-T and Gholdengo, also pair well with Clodsire, as Spikes puts pressure on checks to them such as Ting-Lu and Mega Tyranitar. In return, Clodsire appreciates these teammates being able to make more immediate progress. Knock Off users such as the aforementioned Tornadus-T as well as Weavile and Mega Scizor pair well with Clodsire, crippling Heavy-Duty Boots users such as opposing Clodsire and Toxapex, giving Clodsire's entry hazards support a greater impact.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 515767, "username": "Ryuji"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 544502, "username": "ChrisPBacon"}]}
  },
  "Kingambit": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Kingambit positions itself as a wallbreaker and late-game sweeper thanks to its signature ability in Supreme Overlord. Sucker Punch allows Kingambit to threaten faster opponents and would-be revenge killers such as Tornadus-T, Volcarona, and Mega Medicham. Tera Dark lets Kingambit strengthen its wallbreaking capabilities against bulkier teams. Tera Flying instead lets it play around potential revenge killers, putting them in checkmate situations by turning its Fighting and Ground weaknesses into resistances. 140 Speed EVs let Kingambit outspeed Skeledirge. Entry hazard leads such as Glimmora, Landorus-T, and Annihilape help Kingambit power through its checks by punishing switches. Kingambit is susceptible to faster Fighting-type Pokemon such as Great Tusk, Mega Lopunny, and Urshifu-R, as they will not succumb to a boosted Sucker Punch. Thus, wallbreakers like Dragapult, Dragonite, and Iron Valiant that punish foes for using Fighting-type moves help form solid offensive cores; they can also pressure bulky Steel-types that check Kingambit, such as Ferrothorn, Corviknight, and Heatran. In return, Kingambit helps check Psychic-, Ghost-, and Fairy-types, such as Dragapult, Tapu Lele, and Gholdengo.</p> "
      },
      {
        "name": "Pursuit",
        "description": "<p>Kingambit is a potent Pursuit trapper, utilizing its great bulk to defensively check and trap Ghost- and Psychic-types such as Dragapult, Gholdengo, and Tapu Lele, as well as accrue chip damage on Pokemon like Tornadus-T and Clodsire that are forced out by it. Knock Off allows Kingambit to function as a decent wallbreaker while crippling switch-ins like Ting-Lu and Ferrothorn. Sucker Punch makes up for Kingambit's poor Speed tier, letting it revenge kill faster threats such as Volcarona and Mega Charizard Y, and it can potentially clean late-game if it acquires multiple Supreme Overlord boosts. Tera Dark boosts Kingambit's damage output, letting it threaten post-Tera Dragapult and Gholdengo and clean late-game with Sucker Punch. Defiant is an option to punish Defog attempts from Tornadus-T and Gliscor and punish Intimidate from Landorus-T, letting it wallbreak better, but it is less consistent. Black Glasses boosts Kingambit's already threatening STAB Dark-type moves, allowing it to break more easily, while Leftovers gives Kingambit passive recovery, patching up its lack of longevity. The given EV spread allows Kingambit to outspeed Skeledirge to Knock Off, with the rest in bulk in order to take hits from Dragapult and Gholdengo better. Due to its trapping capabilities, partners that appreciate Ghost- and Psychic-types gone such as Zamazenta, Iron Valiant, and Dragapult work really well with it. While its bulk is great, its lack of longevity leaves it easily worn down in the long-term, so having a solid defensive core utilizing Pokemon such as Toxapex, Slowking-G, Gastrodon, and Rotom-W to help it check threats is key. Entry hazard setters such as Ferrothorn, Mega Diancie, and Garchomp have great synergy with Kingambit, as it removes items from common defensive Pokemon, wearing them down quickly by the entry hazards set. Defiant sets in particular work extremely well, as they are able to punish Defog attempts, threatening to turn Kingambit into a dangerous wallbreaker.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501070, "username": "peap"}, {"user_id": 241308, "username": "sanguine"}, {"user_id": 515767, "username": "Ryuji"}, {"user_id": 589564, "username": "hidin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 385157, "username": "2020 idm boomer"}, {"user_id": 529732, "username": "adem"}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<p>Great Tusk is an excellent Pokemon due to its amazing physical bulk, defensive typing, role compression, and movepool. It also has a very strong offensive presence and has utility moves in Rapid Spin and Stealth Rock to back it up. Headlong Rush is an amazing STAB move, letting Great Tusk force out Pokemon such as Heatran, Gholdengo, and Skeledirge very well. Earthquake can be used for a no-drawback STAB move, but the lack in power is certainly noticeable. Close Combat allows Great Tusk to annihilate Pokemon like Kingambit, and Ferrothorn, and it does a nice chunk to Rotom-W on the switch. Rapid Spin provides reliable entry hazard control, which is especially useful because Great Tusk forces out common Stealth Rock users like Heatran and Mega Tyranitar. It also lets Great Tusk outspeed foes like Iron Valiant, non-Choice Scarf Tapu Lele, and Tornadus-T. Ice Spinner lets Great Tusk hit Landorus-T, Dragonite, and Tornadus-T for good damage. Heavy-Duty Boots gives Great Tusk an entry hazard immunity and allows it to safely Rapid Spin, while Leftovers gives it passive recovery and lets it reliably check Pokemon like Kingambit and Garchomp. Booster Energy can be used to improve Great Tusk's already great offensive output, but since it is a one-time use item, it can be quite unreliable. Tera Water improves the matchup into Pokemon like Urshifu-R and Floatzel. Tera Ground removes Great Tusk's Fairy and Psychic weakness and bolsters its offensive output, letting it OHKO Pokemon like Iron Valiant, Choice Scarf Tapu Lele, and Volcarona. Tera Steel gives Great Tusk resistances to the majority of its weaknesses, letting it KO Pokemon such as Tornadus-T, Iron Valiant, Tapu Lele, and Tapu Koko after luring them. Gholdengo and Kingambit make excellent partners for Great Tusk, as Gholdengo safely handles Pokemon like Tapu Lele and Iron Valiant while Kingambit can force out and Pursuit Pokemon like Tornadus-T and Dragapult. Great Tusk is commonly used as setup fodder against Pokemon like Iron Valiant and Volcarona, so partners like Clodsire and Dragonite can support it in that case. Entry hazard setters like Ferrothorn appreciate Rapid Spin support from Great Tusk, as it lets them keep entry hazards up while removing opposing ones, preventing the team from being worn down quickly. Stealth Rock-weak wallbreakers like Nasty Plot Tornadus-T and Mega Charizard Y also appreciate entry hazard removal from Great Tusk, as it lets them come in multiple times and poke holes in the opposition.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208105, "username": "Jho"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidingflames"}]}
  },
  "Slither Wing": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>STAB U-turn and First Impression combined with a massive Attack stat make Slither Wing a solid wallbreaker, revenge killer, and pivot. First Impression clears Pokemon such as Kartana and Walking Wake while also denting Bug-resistant Pokemon such as Dragapult and Mega Lopunny. U-turn lets Slither Wing obtain momentum while also chipping switch-ins like Tornadus-T and Landorus-T. Flare Blitz tears through Gholdengo and is Slither Wing's strongest attack against Landorus-T and Gliscor, while Earthquake hits Pokemon like Toxapex and Skeledirge while still threatening Gholdengo as well. Tera Bug bolsters First Impression's power to high levels, maximizing Slither Wing's revenge killing potential and enabling it to spread much more chip damage with U-turn; however, it gains a Stealth Rock weakness. Slither Wing pairs well with Mega Charizard Y, as it enables Protosynthesis, which lets Slither Wing threaten the opposition more often. It also boosts Flare Blitz, letting it dent Landorus-T and Gliscor better. In return, Mega Charizard Y threatens Landorus-T, Tornadus-T, and Gholdengo. Special wallbreakers that wear down Slither Wing checks such as Mega Diancie, Tapu Koko, and Walking Wake pair well with it; they also benefit from Slither Wing breaking their checks. Slither Wing lures in Flying-types such as Landorus-T, Tornadus-T, and Dragonite, so Pokemon such as Weavile and Tapu Koko pair well with it, both notably forcing Dragonite to Terastallize into the Normal-type and making it prone to First Impression.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 544502, "username": "ChrisPBacon"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidin"}]}
  },
  "Sandy Shocks": {"sets": [{"name": "Choice Specs"}, {"name": "Offensive Pivot", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Iron Treads": {"sets": [{"name": "Utility"}, {"name": "Assault Vest"}]},
  "Iron Hands": {
    "sets": [
      {
        "name": "Bulky Swords Dance",
        "description": "<p>Swords Dance Iron Hands is a potent wincon, using its amazing bulk in conjunction with its perfect coverage to punch holes in faster teams that lack the means to consistently wall it and trade extremely well. Wild Charge and Close Combat are higher power options over Thunder Punch and Drain Punch that allow for a few notable benchmarks, such as having a chance to 2HKO Tera Water Skeledirge and OHKOing defensive Rotom-W after Stealth Rock and a Swords Dance, but they both greatly sacrifice longevity. Ice Punch lets it nail Ground-, Flying- and Dragon-types that resist its STAB combination such as Landorus-T, Dragonite, Zapdos, and Great Tusk. Tera Water lets Iron Hands gain a much stronger defensive type overall, preventing Ground-, Psychic-, and Fairy-types from revenge killing it while improving the rain matchup significantly. The given EV spread allows Iron Hands to KO Tapu Lele with Thunder Punch after a Swords Dance and outspeed Chansey, with the rest dumped into Special Defense to maximize its lower special bulk. Entry hazard support from Garchomp, Gastrodon, Ferrothorn, and Mega Diancie is crucial to Iron Hands, as it quickly wears down all of its checks for it to clean late-game. Future Sight support is also notable, as it allows Iron Hands to bypass would-be checks such as Buzzwole and Skeledirge. Pivots such as Tapu Koko, Tornadus-T, and Landorus-T also work well with Iron Hands, as they bring it in safely and prevent it from being worn down quickly. Tapu Koko's Electric Terrain also activates Iron Hands's Quark Drive, boosting its Attack even further. Due to its great defensive utility, it partners well with Pokemon like Slowbro and Dragapult, as it takes advantage of Dark-types that pressure these two out, with Slowbro providing Future Sight support and Dragapult taking advantage of Iron Hands’s checks like Buzzwole and Skeledirge. Due to its lack of longevity, it is a poor singular check to threats such as Kingambit, Weavile, and Kartana, so pairing it up with Pokemon like tank Garchomp, Tapu Fini, and Rotom-W to form defensive a defensive core works wonders.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 515767, "username": "Ryuji"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Iron Moth": {"sets": [{"name": "Offensive"}]},
  "Baxcalibur": {"sets": [{"name": "Dragon Dance"}, {"name": "Choice Band"}]},
  "Gholdengo": {
    "sets": [
      {
        "name": "Defensive Nasty Plot",
        "description": "<p>Gholdengo uses its great typing and decent bulk to switch into Pokemon such as Tapu Lele, Hawlucha, most Mega Medicham, most Iron Valiant, and Zamazenta. Gholdengo's typing and unique ability in Good as Gold make it the premier stopgap to entry hazard removal and a good asset for entry hazard-stacking teams. Gholdengo can switch in on Defoggers like Rotom-W and Tornadus-T—the tier's top Defogger—and can switch in on status moves like Leech Seed from Ferrothorn and Toxic from Clodsire after Gholdengo Terastallizes. A STAB combination of Ghost / Steel hits many targets neutrally, with Shadow Ball being incredibly spammable and Make It Rain hitting Ghost-resistant Pokemon like Garganacl, Tyranitar, and Weavile; the former two are otherwise able to switch in freely. Tera Fairy lets Gholdengo switch out of otherwise crippling Pursuit, and Water lets it stay in on four attacks Kingambit and begin setting up. The removal of a Ground weakness also allows it to take advantage of Heatran, Ting-Lu, and Clodsire. 128 Special Defense EVs let Gholdengo survive two Heat Waves from offensive Tornadus-T from maximum HP, while the Special Attack allows it to OHKO bulky Tornadus-T with Make It Rain after a Nasty Plot; the remaining are put in Defense to take hits from the likes of Kingambit and Mega Tyranitar much better after Terastallizing. Entry hazard setters like Ting-Lu, Clodsire, Gastrodon, and Mega Diancie appreciate their hazards staying up for as long as possible. Pokemon like Mega Lopunny appreciate Gholdengo beating common revenge killers in Choice Scarf Tapu Lele and Zamazenta. Rotom-W is notable in that it checks Pokemon like Mega Swampert, Heatran, and Victini, and it appreciates Gholdengo providing entry hazard control. Gholdengo struggles against Kingambit, which it lets in for free and struggles to switch out of due to Pursuit. Kingambit is punished by Fighting-type teammates such as Urshifu-R, Zamazenta, Iron Valiant, and Mega Lopunny. Gholdengo also struggles against Mega Lopunny, which can switch in on stray Shadow Balls and bypass its Fighting immunity with Scrappy. Gholdengo also struggles against Clodsire and opposing Ghost-types, such as Dragapult and opposing Gholdengo. These can be checked by Pursuit users such as Weavile, Kingambit, and Mega Tyranitar.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 585800, "username": "gamer but swag"}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Ting-Lu is an outstanding wall, utilizing its immense bulk, Vessel of Ruin, and useful defensive typing to check threats such as Dragapult, Espathra, and Tapu Koko well. With access to both Stealth Rock and Spikes, Ting-Lu is a flexible entry hazard setter that supports its teammates well. Ruination allows Ting-Lu to pressure Pokemon such as Rotom-W, Tornadus-T, Great Tusk, and Landorus-T, which don't care about its Earthquake. Rest is an option for more longevity across the length of a game, but it renders Ting-Lu useless for a few turns. Whirlwind works exceptionally well with other hazard setters like Ferrothorn and Mega Diancie, as it lets Ting-Lu wear down Pokemon quickly for its teammates, as well as phazing setup sweepers such as Espathra and Dragonite easily. Water is the primary Tera type for Ting-Lu, being overall solid defensively and letting it switch into Barraskewda and Weavile easily. Ghost is also a solid Tera type, as it lets Ting-Lu check Fighting-types like Zamazenta and Iron Valiant, as well as blocking Rapid Spin attempts from Great Tusk. Water-types such as Barraskewda, Urshifu-R, and Floatzel easily force Ting-Lu out, making Water-resistant teammates such as Ferrothorn, Slowbro, and Dragonite great partners. Due to Ting-Lu's susceptibility to Fighting-types like Mega Medicham, Great Tusk, and Zamazenta, Pokemon like Gholdengo, Tornadus-T, and Skeledirge work really well alongside it. Gholdengo in particular forms a potent defensive core with Ting-Lu, preventing its entry hazards from being Defogged. Wallbreakers such as Urshifu-R, Dragapult, and Iron Valiant all pair amazingly with Ting-Lu's hazard support. Lastly, due to Ting-Lu's susceptibility to hazard chip damage, entry hazard removers like Tornadus-T, Rotom-W, and Great Tusk are invaluable partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 515767, "username": "Ryuji"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 529732, "username": "adem"}]}
  },
  "Iron Valiant": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Iron Valiant is a threatening wallbreaker, punching holes in teams with its good offensive stats and wide special movepool. Iron Valiant can't fit all its desired options, but its versatility means opponents must scout it. Thunderbolt helps deal with Pokemon like Toxapex and Corviknight. Psyshock dents Clodsire,which usually hard counters Iron Valiant otherwise, while Shadow Ball helps against Gholdengo and Skeledirge. Trick can cripple Iron Valiant's switch-ins such as Toxapex, Clodsire, and Corviknight. Fairy is the premier Tera type to boost its Moonblast to extreme levels, with it even denting resistant foes like Gholdengo and Victini. Electric is also a good choice, as it helps against Bullet Punch from Mega Scizor and Hurricane from Tornadus-T and Zapdos, and Thunderbolt becomes an extra STAB move. Steel works in the same vein, but it doesn't have any offensive utility, although it provides Iron Valiant a Toxic immunity and more resistances. This set appreciates pivots like Landorus-T, Tapu Koko, and Slowbro to pressure the opponent's team and bring it in. In particular, Tapu Koko also boosts Iron Valiant's Speed thanks to Electric Terrain activating Quark Drive, while Slowbro provides Future Sight support, helping Iron Valiant to push through Toxapex and Clodsire. Entry hazards from Pokemon like Ting-Lu, Garchomp, and Gastrodon help wear down Iron Valiant's checks, such as Gholdengo, Clodsire, and Toxapex. They also can switch into faster Pokemon that threaten Iron Valiant, such as Tapu Koko, Choice Scarf Rotom-W, and Choice Scarf Victini. Pursuit Kingambit, Weavile, and Mega Tyranitar can trap and remove Pokemon that Iron Valiant struggles to break through, like Gholdengo and Victini.</p> "
      },
      {
        "name": "Mixed Attacker",
        "description": "<p>Iron Valiant has the stats to be a good mixed attacker. The given EV spread allows it to OHKO Blissey with Close Combat. Psyshock helps deal with Clodsire, and Thunderbolt hits Corviknight and Toxapex. Knock Off is a good option, as it helps beat Gholdengo while usefully removing items from the likes of Skeledirge, Volcarona, and Corviknight. Fairy is the best Tera type for this set, as it lets Moonblast's damage skyrocket. Steel can make up for Iron Valiant's atrocious bulk, which is even worsened by the Naive nature, and Electric also brings some defensive use while giving Thunderbolt STAB. Both also help Iron Valiant against Tornadus-T and Mega Scizor, as it can resist Hurricane and Bullet Punch. Iron Valiant appreciates slow pivots like Landorus-T, Slowbro, and Corviknight bringing it in safely. Entry hazard control is required to ensure Iron Valiant's survivability. Therefore, Defoggers like Corviknight and Tornadus-T, Rapid Spin users like Great Tusk and Cyclizar, and even Magic Bounce users such as Mega Diancie are good partners.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Iron Valiant is a strong wallbreaker and a potent wincon due to its offensive pressure and Speed boost from Booster Energy. It already possesses a high base Speed, meaning it outpaces every relevant Choice Scarf user besides itself. Calm Mind helps it pressure supposed checks such as Toxapex, Corviknight, and Mega Scizor, although you'll need to Terastallize Iron Valiant to beat the latter. Thunderbolt helps it hit these threats, while Psyshock allows Iron Valiant to properly beat Clodsire and the aforementioned Toxapex. Steel is the best Tera type, as it lets Iron Valiant block poison and resist strong priority moves, such as Fake Out from Mega Lopunny and Bullet Punch from Mega Scizor. Electric is also a very strong option, as it still helps against Bullet Punch and allows Iron Valiant to bash through Skeledirge and the aforementioned Mega Scizor. Since Booster Energy only activates once, this set requires a lot of support before coming in and setting up. Therefore, it's limited to very offensive playstyles. Entry hazards from Garchomp, Ting-Lu, and Landorus-T are needed to weaken Iron Valiant's checks such as Toxapex, Clodsire, and Mega Scizor, helping it punch through them. Pokemon that share checks with Iron Valiant are also valuable teammates, like Dragon Dance Dragonite, Weavile, and Volcarona, as together they can overwhelm common checks like Corviknight and Toxapex. Iron Valiant also appreciates dual screens from Grimmsnarl or Tapu Koko. The latter brings Electric Terrain, which can be useful for Quark Drive and Thunderbolt in extended endgame scenarios. Finally, Swords Dance Kingambit and Sword Swords Dance Garchomp can deal with its checks like Toxapex and Clodsire.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Thanks to its high Speed and capable offensive stats, Iron Valiant is a very potent Choice Scarf user, revenge killing Dragonite and Zamazenta and cleaning up weakened teams. Close Combat and Moonblast hit a large variety of Pokemon, and Knock Off cripples foes while hitting Gholdengo and Skeledirge hard. Trick can be worth it over Thunderbolt's coverage, as it cripples checks like Toxapex and Clodsire. Tera Fairy helps Iron Valiant clean through weakened teams, and Steel allows it to reliably beat Dragonite while resisting priority moves from the likes of Mega Lopunny and Mega Scizor. Entry hazards from setters like Garchomp and Ting-Lu are heavily recommended to weaken Iron Valiant's checks such as Mega Scizor, Toxapex, and Clodsire. Trappers can remove Pokemon it tends to struggle against, such as Toxapex and Gholdengo. Therefore, Heatran, Kingambit, and Weavile are good teammates. Mega Charizard Y, Heatran, and the aforementioned Kingambit can break through Iron Valiant's aforementioned checks. Finally, defensive Pokemon, such as Mega Scizor, Gholdengo, and Heatran can cover for Iron Valiant once it gets forced out after revenge killing.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 589564, "username": "hidin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 515767, "username": "Ryuji"}]}
  }
}