{
  "Charizard": {"sets": {"Special Attacker": {}}},
  "Sandslash": {"sets": {"Defensive Spinner": {}}},
  "Sandslash-Alola": {
    "sets": {
      "Specially Defensive Spinner": {
        "description": "<p>Alolan Sandslash is a great role compressor, as it can remove entry hazards and set up its own, and on top of this, it can also check threats like Meloetta, Florges, and Rotom-C. While Triple Axel is more powerful than Ice Spinner, it must land all three times to do so, making the latter a more accurate alternative. Ice Spinner also removes Terrain, meaning it can also help out in more fringe cases versus Terrain setters like Indeedee-F and Thwackey to prevent Terrain sweepers such as Sceptile and Hitmonlee from gaining a Speed boost. Knock Off allows Alolan Sandslash to remove items like Heavy-Duty Boots and Choice Scarf from Pokemon like Altaria, Milotic, Paldean Tauros-F, and Flamigo. Removing Heavy-Duty Boots allows it to take advantage of its entry hazards to chip away at the aforementioned walls so that teammates like Paldean Tauros-W and Delphox can break through them. Spikes is preferred, as they can be stacked, and there are many more Stealth Rock users in PU compared to the number of Pokemon that learn Spikes. However, if there are no Stealth Rock users on a team or if Spikes are covered somewhere else, Stealth Rock can be run instead. Leftovers provides passive recovery for Alolan Sandslash, as it lacks any form of it, but Heavy-Duty Boots makes it be a more reliable spinner. The Speed investment helps Alolan Sandslash outpace Sandaconda. 20 Attack EVs, allows Alolan Sandslash to always OHKO Golurk from full health if all three Triple Axel hits land. Tera Water both lets Alolan Sandslash take a Fire-type attack from Delphox, Salazzle, and Arcanine in a pinch and gives it a strong defensive Tera type. Tera Ghost, on the other hand, helps Alolan Sandslash act as an emergency spinblocker against Tatsugiri, Coalossal, and opposing Alolan Sandslash while also helping it take super effective coverage in Body Press from Mudsdale and Bronzong and Close Combat from Scyther.</p> <p>Although Alolan Sandslash easily fits on a lot of teams thanks to its good general utility, it fits best on entry hazard stacking teams that can utilize Spikes to great use alongside offensive pressure to chip away at and break through walls. This means wallbreaking partners like Zoroark, Heracross, and Delphox greatly appreciate Alolan Sandslash's support. Alolan Sandslash is easily beat by Fighting- and Fire-types like Hariyama, Paldean Tauros-F, and Arcanine, so teammates that can check these threats like Bellibolt, Milotic, and Mudsdale make for great partners and create a strong defensive backbone with Alolan Sandslash. Other Knock Off users like Heracross, Ambipom, and Scrafty pair well alongside Alolan Sandslash, as it can then fully utilize its entry hazards. Alolan Sandslash's lack of recovery can be quite detrimental versus Galarian Articuno and Florges, so a second specially defensive wall, like Goodra or Assault Vest Galarian Slowbro, or a Wish-passing partner, such as Scream Tail or Florges, makes for a great teammate. Alolan Sandslash struggles against Steel-types like Bronzong, Duraludon, and opposing Alolan Sandslash, so Pokemon like Skuntank, Flamigo, and Paldean Tauros-F can all pressure them so they can't take advantage of Alolan Sandslash. Wallbreakers weak to Stealth Rock and walls worn down by Spikes that also prefer to run other items instead like Staraptor, Arcanine, Gastrodon, and Galarian Slowbro have strong synergy with Alolan Sandslash because it can remove entry hazards for them. The former two pair especially well, as Alolan Sandslash can chip away at their checks like Mudsdale and Milotic with Knock Off and entry hazards. In return, Staraptor and Arcanine threaten out Fighting- and Fire-types like Flamigo and Delphox, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Arcanine": {
    "sets": {
      "Curse": {
        "description": "<p>Arcanine is one of PU's strongest and most threatening sweepers and cleaners thanks to its great natural bulk, decent defensive typing, great ability in Intimidate, and Curse + Extreme Speed naturally synergizing together. Curse boosts Arcanine's physical stats, making it a stronger threat and a bulkier attacker while also naturally synergizing with Extreme Speed and Intimidate. Morning Sun provides recovery, allowing Arcanine to alleviate its Stealth Rock weakness and recover against more passive walls like Altaria and Wo-Chien. An alternative to Morning Sun is Close Combat, which prevents Arcanine from being walled by Coalossal and does more damage to Water-types than Extreme Speed before Terastallization; however, it severely cuts into Arcanine's longevity. Leftovers aids with Flare Blitz recoil, although it does leave Arcanine extremely weak to entry hazards. Heavy-Duty Boots is another viable option to make it completely immune to Stealth Rock and other entry hazards, although it does come at the cost of Arcanine solely relying on Morning Sun to recover off damage. The given EV spread allows Arcanine to outspeed Modest Toxtricity before a Curse. Tera Normal removes all of Arcanine's weaknesses, allowing it to set up on Pokemon like Decidueye and non-Clear Smog Gastrodon while also boosting Extreme Speed, enabling it to pick off faster attackers like Kilowattrel and Staraptor after a Curse.</p> <p>Arcanine fits on a variety of teams but most commonly finds itself on hyper offense and balance teams looking for a powerful sweeper and setup threat. Arcanine struggles to deal with bulky physically defensive walls that can cripple it with status or phaze it like Bellibolt, Mudsdale, and Galarian Slowbro, so checks to these Pokemon like Golurk and Tatsugiri make excellent partners. Other physical attackers like Decidueye and Flamigo also make great partners, as they work together with Arcanine to chip away at their shared checks like Bellibolt and Houndstone. If Arcanine is using Leftovers as its item, entry hazard control from Pokemon like Tastugiri, Scyther, and Altaria can help alleviate Arcanine's Stealth Rock weakness to make it a more potent sweeper. As Arcanine struggles to set up against special attackers like Toxtricity and Scream Tail, special walls like Assault Vest Galarian Slowbro and Milotic can provide a defensive backbone for Arcanine to fall back on.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 414072, "username": "Hera"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Slowbro-Galar": {
    "sets": {
      "Assault Vest": {
        "description": "<p>Galarian Slowbro makes for an effective mixed wall and bulky pivot when equipped with an Assault Vest thanks to its good natural bulk and typing that enables it to check prominent threats like Florges and Paldean Tauros-W. Regenerator is an incredible ability that allows Galarian Slowbro to remain healthy throughout a game while maintaining momentum, which, when paired with its good coverage, lets it soft check most Pokemon in the tier, from setup sweepers like Calm Mind Scream Tail and Curse Arcanine to other walls like Bellibolt and Coalossal. Flamethrower gives Galarian Slowbro important coverage to hit Steel-types like Alolan Sandslash and Bronzong. Surf lets Galarian Slowbro punish Ground-types that threaten it on the switch, such as Mudsdale and Gligar, while also letting it hit Fire-types like Coalossal and Rotom-H. Earthquake gives Galarian Slowbro an advantage versus other Galarian Slowbro while also letting it hit Skuntank on the switch, which otherwise resists its STAB attacks and heavily threatens it with Knock Off. 4 Special Attack EVs mean that Shell Side Arm will always be special against targets with equal Defense and Special Defense, avoiding contact effects like Rocky Helmet. 128 Defense EVs let Galarian Slowbro tank a +2 Wave Crash from Jolly Paldean Tauros-W. An alternative EV spread of 248 HP / 16 Def / 4 SpA / 240 SpD can be used instead to allow Galarian Slowbro to tank two consecutive Boombursts from Throat Spray Toxtricity. Both Tera Water and Tera Fairy let Galarian Slowbro shed all of its regular weaknesses, letting it deal with Pokemon such as Mudsdale, Houndstone, Zoroark, and Bombirdier. Tera Fairy completely reverses Galarian Slowbro's Dark weakness and enables it to better handle Dark-types like Scrafty and Zoroark compared to Tera Water while retaining its ability to handle Fighting-types like Flamigo and Pawmot. Tera Water lets Galarian Slowbro better handle Water- and Fire-types such as Kingdra and Delphox, allows Surf to 2HKO Ground-types like Gligar and Golurk, and does better into Skuntank compared to Tera Fairy due to lack of a Poison weakness.</p> <p>Assault Vest Galarian Slowbro fits excellently on balance and bulky offense teams due to its ability to serve as a reliable pivot into Fighting- and Fairy-type attackers for teammates like Alolan Sandslash and Paldean Tauros-W. Galarian Slowbro is particularly susceptible to Knock Off due to its Dark weakness and reliance on its item to check special attackers, so teammates like Scrafty, Mudsdale, and Bellibolt that can switch in on Knock Off users like Skuntank and Zoroark make for good partners. Scrafty in particular makes for a great partner, as while it can defensively and offensively deal with Dark- and Ghost-types, Galarian Slowbro deals with the Fairy- and Fighting-types that threaten Scrafty, such as Flamigo and Paldean Tauros-W. Galarian Slowbro is also threatened by Ground-types like Mudsdale, so Ground-resistant and -immune teammates like Decidueye and Gligar are appreciated. Bombirdier and Staraptor both make for strong partners for their ability to deter Ground-type attacks while offensively checking Decidueye, Golurk, and Scrafty that all threaten Galarian Slowbro. Galarian Slowbro is greatly hurt by entry hazards, as it switches frequently to recover health with Regenerator, so teammates that can remove these hazards such as Coalossal and Altaria make for excellent partners, and in return, Galarian Slowbro can check Paldean Tauros-W and Paldean Tauros-F for Coalossal and Florges for Altaria.</p>"
      },
      "Defensive": {
        "description": "<p>Galarain Slowbro is a premier defensive pivot thanks to its solid defensive typing, which checks Pokemon like Flamigo and both Paldean Tauros formes; strong physical bulk; wide movepool to deal with switch-ins; Regenerator to heal off residual damage; and Slack Off so it can stay on the field. Psyshock is occasionally used over Psychic because it hits specially defensive Pokemon like Gastrodon, Tera Poison Florges, and Snorlax harder. Flamethrower synergizes well with its other moves, letting it hit Steel-types that would usually come in on Galarian Slowbro like Alolan Sandslash and Levitate Bronzong, as well as Dark-types like Skuntank. Toxic is great at putting switch-ins like Mudsdale, Golurk, and Bellibolt on a timer. Thunder Wave is occasionally useful as a stopgap for faster sweepers like Trailblaze Paldean Tauros-W; however, this gives Ground-types like Golurk and Mudsdale free entry compared to Toxic. Surf is also an option that hits Ground- and Fire-types like Golurk and Delphox, which are otherwise annoying for Galarian Slowbro while being a solid midground option versus Dark-types like Bombirdier; however, it often struggles to fit this move in practice. Heavy-Duty Boots is the more consistent option to avoid taking troublesome damage from entry hazards, while Rocky Helmet punishes contact moves from Pokemon like Staraptor and Flamigo while deterring U-turn from Pokemon like Scyther. Tera Water and Tera Fairy are both useful for shedding its poor Ghost-, Dark-, and Ground-type weaknesses, letting Galarian Slowbro switch into Pokemon like Houndstone, Bombirdier, and Sandaconda; however, while Tera Water gives it a better matchup against Fire- and Water-types like Arcanine and Kingdra, Tera Fairy reverses its Dark weakness and lets it handle foes like Zoroark and Bombirdier while keeping its good matchup against Fighting-types like Flamigo and Pawmot.</p> <p>Galarian Slowbro fits best on balance and bulky offense teams that appreciate its ability to pivot in and out of tier staples like Flamigo and Ambipom. While bulky, Galarian Slowbro appreciates a fellow physical wall to pivot to so it doesn't have to take every hit. Pokemon like Bellibolt, Milotic, and Wo-Chien are all solid options; Bellibolt and Milotic can bring Galarian Slowbro in with pivot moves to regain health, while Wo-Chien and Bellibolt can directly switch into Galarian Slowbro's poor matchups like Swords Dance Decidueye and Zoroark, respectively; Bellibolt specifically is a great switch-in to Knock Off, which Galarian Slowbro hates. In return, Galarian Slowbro can block Toxic for them, which all of these defensive Pokemon hate. Wallbreakers that are weak to Fighting-types like Zoroark and Duraludon also appreciate having a strong Fighting resistant teammate to fall back on. Specially defensive Pokemon like Florges and Scrafty can help Galarian Slowbro deal with the special attackers it struggles with like Tatsugiri and Delphox. Galarian Slowbro struggles with Dark-, Ground-, and Ghost-types like Scrafty, Mudsdale, and Golurk, so Pokemon that can come in on them like Grimmsnarl and Wo-Chien are heavily appreciated. Pokemon that threaten Steel-types and Gligar, such as Paldean Tauros-W, are also greatly appreciated, as due to their Toxic immunity, Galarian Slowbro struggles to make progress against them even when running Flamethrower, unless it is running Surf for Gligar.</p>"
      },
      "Calm Mind": {
        "description": "<p>Utilizing its bulk and plethora of strong defensive matchups against tier staples like Bellibolt and Florges, Galarian Slowbro can become a threatening setup sweeper, pairing Calm Mind with its naturally high Defense and immunity to Toxic. Psyshock allows Galarian Slowbro to deal consistent damage to special walls such as Goodra and Gastrodon, as well as opposing Calm Mind users, while Psychic has a higher Base Power and is more effective against physical walls such as Mudsdale and opposing Galarian Slowbro. Sludge Bomb is also an option that deals more consistent damage to Scream Tail and Grimmsnarl while also chipping down nuisances such as Bombirdier, Meloetta, and Wo-Chien. Sludge Bomb is also appreciated for its ability to spread poison on these foes, making it much more difficult for them to function as checks. Flamethrower nails Steel-types like Copperajah and Alolan Sandslash, as well as common users of Tera Steel such as Paldean Tauros-W and Altaria, while Surf has strong neutral coverage and punishes common switch-ins in Coalossal and Ground-types like Gligar and Mudsdale. Nasty Plot is an option over Calm Mind that boosts Galarian Slowbro's power even further, but this makes it more vulnerable to being worn down by special wallbreakers like Delphox and Rotom-H. Tera Water shores up Galarian Slowbro's matchup against both Paldean Tauros formes while also increasing the power of Surf, notably netting an unboosted 2HKO on Ground-types like Mudsdale, Golurk, Palossand, and even Gligar with Eviolite intact. However, this comes at the cost of a weakness to Volt Switch and the loss of Galarian Slowbro's ability to deal with Grass-types such as Hisuian Electrode, Virizion, and Rotom-C. Tera Fairy is a strong neutral defensive typing that shores up Galarian Slowbro's matchups against Bombirdier and Goodra and even allows it to set up on them, but it also makes it much more vulnerable to opposing Galarian Slowbro and further worsens its matchup versus Steel-types. Both also remove Galarian Slowbro's pesky weaknesses to Ground and Ghost but should be used with caution, as they notably remove its immunity to Toxic, allowing foes like Bellibolt to more effectively put it on a timer.</p> <p>Calm Mind Galarian Slowbro fits best on bulkier teams that can utilize its strong defensive profile to turn common foes into setup fodder. Strong special wallbreakers like Toxtricity and Choice Specs Goodra can pose a danger to Galarian Slowbro, as its Special Defense leaves something to be desired without Calm Mind boosts, so partners like Florges and Goodra are appreciated to help absorb hits from these Pokemon. The latter can also use its strong STAB moves to help whittle down shared checks like Copperajah and Gastrodon, and both Pokemon form a strong defensive backbone with Galarian Slowbro. Offensive Dark-types nearly always have a tool to harass Galarian Slowbro, so checks to these foes like Scrafty and fast wallbreakers like Paldean Tauros-W and Choice Scarf Flamigo are vastly appreciated. Haze users such as Altaria and Milotic are also problematic, so Taunt users like Bombirdier or offensive checks like Alolan Sandslash or Hisuian Electrode to stop or remove them are appreciated. The tier's common Ground-types also pose a significant threat to Galarian Slowbro, as it is slower than all of them and only Gligar fails to 2HKO it. Furthermore, with the exception of Golurk, Galarian Slowbro needs at least two Calm Mind boosts to reliably 2HKO them without Surf. Gastrodon in particular is an exceptional nuisance thanks to Storm Drain granting it an immunity to Surf as well as a chance to OHKO Galarian Slowbro with Earth Power thanks to the Special Attack boost. Therefore, teammates that can deal with these foes like Virizion, Milotic, and Rotom-C are vastly appreciated, and Galarian Slowbro can deal with opposing Grass-types that pose an annoyance to these Pokemon in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 414072, "username": "Hera"}, {"user_id": 617840, "username": "gulch"}, {"user_id": 626934, "username": "Morge"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 400292, "username": "asa"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Electrode-Hisui": {"sets": {"Pivot": {}}},
  "Exeggutor-Alola": {"sets": {"Choice Specs": {}, "Eject Pack": {}}},
  "Hitmonlee": {"sets": {"Terrain Sweeper": {}}},
  "Rhydon": {"sets": {"Stealth Rock": {}, "Offensive Swords Dance": {"description": "<p>Megahorn is a niche option that hits Wo-Chien and Uxie harder than Heat Crash while being more reliable against Alolan Exeggutor. However, it is generally less useful coverage than Heat Crash, since it's worse against Bronzong and Hisuian Decidueye.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Scyther": {
    "sets": {
      "Pivot": {
        "description": "<p>Scyther is a great pivot thanks to its role compression of an offensive pivot, a Defogger, and a utility Pokemon all into one. U-turn allows it to gain momentum for its team, rack up chip damage on the likes of Galarian Slowbro and Gastrodon, and pivot out of Pokemon that it has issues with, like Bronzong. Close Combat lets Scyther deal with entry hazard setters like Alolan Sandslash and Coalossal while also providing good coverage into Pokemon like Dudunsparce and Abomasnow. Defog allows it to capitalize on the Pokemon it forces out like Wo-Chien and Paldean Tauros-W and subsequently remove entry hazards. Scyther has a variety of viable Tera types; most commonly, it runs Tera Ground, as it is an excellent defensive Tera type that lets it take on Pokemon like Kilowattrel, Rotom-H, Toxtricity, and Coalossal while also blocking Volt Switch. An alternative to this is Tera Flying, boosting the power of Dual Wingbeat while still removing Scyther's Bug typing to take on Fire-types like Delphox and Arcanine. Finally, Tera Fighting boosts the power of Close Combat while giving Scyther a decent defensive Tera type, helping it handle Dark-types like Skuntank and Zoroark and changing its Rock weakness to a resistance.</p> <p>Scyther most commonly finds itself on bulkier balance teams looking to compress multiple roles into one Pokemon. Scyther makes an excellent VoltTurn core with Pokemon like Rotom-H and Zoroark, which can threaten physical walls such as Altaria, Bronzong, and Galarian Slowbro that can make Scyther's job difficult. As Scyther threatens Decidueye, Florges, and Wo-Chien, Pokemon checked by these threats, like Paldean Tauros-W and Toxtricity, can make good partners with it, and Scyther can help them get on the battlefield with U-turn and Defog. Scyther makes a good defensive backbone with Pokemon like Galarian Slowbro and Houndstone thanks to its ability to counter their few checks like Skuntank and Decidueye. In turn, they operate as a fallback for Scyther after it pivots out with U-turn against its problematic matchups. Coalossal and Bellibolt are issues for Scyther, as it can't reliably pivot on them due to Flame Body and Static, so checks to these threats like Golurk, Goodra, and Mudsdale are good partners.</p>"
      },
      "Swords Dance": {
        "description": "<p>Thanks to a great Attack and Speed stat, wide array of coverage moves, Technician, and powerful boosting moves in Swords Dance and Trailblaze, Scyther is one of PU's strongest setup sweepers and attackers. U-turn allows Scyther to pivot out of bad matchups such as Bronzong and Houndstone, can bring a teammate onto the field safely, and can let Scyther gain momentum for its team. In contrast, Close Combat is a valuable coverage move to target Rock- and Steel-types like Coalossal, Regirock, and Alolan Sandslash. Trailblaze allows Scyther to operate as a dual setup sweeper, making it a bigger offensive threat by outspeeding faster Pokemon such as Salazzle and Choice Scarf Paldean Tauros-F. Finally, Quick Attack is a valuable priority move, letting Scyther pick off setup sweepers such as Shift Gear Toxtricity and Nasty Plot Salazzle. Scyther's Tera type is extremely flexible; Tera Grass should be paired with Trailblaze, as it boosts the move while also giving it a useful defensive typing to set up on threats like Rotom-M and Paldean Tauros-W. Tera Normal lacks defensive advantages but boosts Quick Attack to great levels of power after a Swords Dance, achieving rolls such as a chance to OHKO Salazzle and Staraptor after Stealth Rock. Finally, Tera Ground is a purely defensive Tera Type type that allows Scyther to get setup opportunities against Pokemon it usually would not like Bellibolt, Toxtricity, Delphox, and Galarian Slowbro.</p> <p>Scyther finds itself primarily on hyper offense and balance teams looking for a consistent setup sweeper. Scyther struggles to break though physical walls like Bellibolt, Bronzong, and Coalossal if it does not run Close Combat, so checks to these threats like Golurk and Tatsugiri make excellent partners. Other offensive pivots like Staraptor and Rotom-H make a powerful VoltTurn core with Scyther, which can be difficult to stop and can bring Scyther in to safely set up. Scyther's ability to pivot can also be helpful for other frailer setup sweepers, like Decidueye and Zoroark, to get in safely and attempt a sweep of their own. If Scyther does not opt for Trailblaze or Quick Attack, it is extremely susceptible to getting revenge killed by Choice Scarf Flamigo and Staraptor as well as naturally faster Pokemon like Tornadus and Ambipom; checks to these threats like Bellibolt, Dudunsparce, and Duraludon make excellent partners. Pokemon like Virizion and Scrafty can switch into Knock Off for Scyther, as it needs Heavy-Duty Boots to be a capable sweeper.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 414072, "username": "Hera"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Tauros-Paldea-Blaze": {"sets": {"Bulk Up": {}, "Choice": {}}},
  "Tauros-Paldea-Aqua": {
    "sets": {
      "Bulk Up": {
        "description": "<p>Paldean Tauros-W uses Intimidate and Bulk Up to find setup opportunities versus physical attackers like Skuntank and Arcanine, functioning as an effective physical sweeper. This is also thanks to its solid Speed, which is bolstered further by boosts from Trailblaze. Its STAB attacks are not only high in base power, they also are complimentary in coverage, hitting virtually everything in the metagame for at least neutral damage and nailing some physical walls like Mudsdale, Gligar, and Wo-Chien. Wave Crash is the preferred Water-type attack because the extra power is essential for netting OHKOs at +1 against Flamigo, Scyther, and Heracross. The weaker Raging Bull sometimes works better due to the lack of recoil, and it is more suitable for sweeping with multiple Bulk Up boosts to make up for the lack of power. Tera Steel turns all of Paldean Tauros-W's weaknesses into neutralities at worst, helping it out versus Psychic- and Fairy-types like Galarian Slowbro and Florges, and it offers an immunity to Toxic and Clear Smog from foes such as Gligar and Gastrodon. It can even flip the matchup versus faster Flying-types like Scyther, Staraptor, and Kilowattrel by making them vulnerable to Bulk Up + Trailblaze sweeps. Tera Grass is another Tera type worth considering for its defensive benefits while also boosting the damage of Trailblaze, as Tera Grass Trailblaze is a guaranteed OHKO on Gastrodon and improves the matchups into the likes of Milotic, Bellibolt, and opposing Paldean Tauros-W.</p> <p>Skuntank and Bombirdier make some of the best offensive teammates to Paldean Tauros-W, as they can switch into Galarian Slowbro and Decidueye for it and use Knock Off on physical walls like Milotic and Mudsdale. Bellibolt is a solid defensive teammate thanks Rocky Helmet + and Static punishing the faster Flying-types like Scyther and Staraptor that may try to revenge kill Paldean Tauros-W, and it offers a slow Volt Switch to create setup opportunities. The same can be said about Flame Body Coalossal, and while it has to worry about Fighting-type coverage from these foes, it can also be a useful switch-in to the likes of Delphox and Choice Scarf Florges. In return, these two rely on Paldean Tauros-W to put offensive pressure on Ground-types like Gastrodon and Golurk. While Paldean Tauros-W may not always be able to get past some foes like Bellibolt and Milotic by itself, it can soften them up for additional physical attackers such as Arcanine and Scrafty to then come in and have an easier time sweeping. An early Bulk Up or revenge kill opportunity may encourage its counters like Bellibolt and Galarian Slowbro to come in, so having wallbreakers that can come in on these walls like Golurk and Choice Specs Duraludon may make for a rewarding play.</p>"
      },
      "Choice Band": {
        "description": "<p>With a solid speed tier and access to great STAB attacks, it's no wonder how Paldean Tauros-W can pull off a Choice Band set. This set is notable for revenge killing the likes of Arcanine, Scrafty, and Golurk, in part thanks to Intimidate helping it get in versus these threats, all while being more threatening to its usual checks; Decidueye and Assault Vest Galarian Slowbro are now 2HKOed by Wave Crash, no longer making them safe switch-ins. Aqua Jet also increases the number of revenge killing opportunities, as it can finish off sweepers such as Shift Gear Toxtricity and Nasty Plot Delphox, which often take enough chip damage when setting up to be jeopardy of going down to this attack. Earthquake is Paldean Tauros-W's best coverage for Bellibolt, 2HKOing it while also avoiding its adverse contact effects. It also nails other foes like Skuntank, Coalossal, and Galarian Slowbro with little consequences, though it may trigger Terastallization from these targets and encourage opposing Flying-types like Scyther to come in freely. Raging Bull can be considered as well for a less consequential Water-type attack in comparison to Wave Crash, and it pairs well when sweeping with Tera Water. Another consideration is Stone Edge, as it can also avoid contact like Earthquake and is the best coverage move for Altaria. Tera Water's extra power for Wave Crash allows Paldean Tauros-W to reliably 2HKO some walls like Bellibolt without having to rely on a well-predicted Earthquake, meaning it can spam its strongest attack with more confidence when revenge killing. Tera Water also removes some of Paldean Tauros-W's more common weaknesses, so that potential revenge killers such as Scyther will fail to OHKO it. Otherwise, Tera Fighting will similarly buff Close Combat enough to 2HKO Bellibolt and with no recoil attached, though it is less popular due to the prevalence of Ghost-types and the inability to buff Paldean Tauros-W's priority.</p> <p>Defensive pivots such as Bellibolt and Gligar are some of the best options to pair with Paldean Tauros-W. They offer natural synergy by checking faster foes like Choice Scarf Staraptor and Flamigo and can position Paldean Tauros-W into the field against threats like Golurk and Goodra. Dark-types like Bombirdier and Scrafty are great so that if Paldean Tauros-W is locked into Close Combat, these teammates can pressure incoming Ghost- and Psychic-types like Palossand and Galarian Slowbro. Similarly, when it is locked into Water-type attacks, then special walls like Assault Vest Galarian Slowbro and Bronzong are great to pivot into when matched up against Storm Drain foes like Tatsugiri and Gastrodon, respectively. Salazzle is notable for coming in relatively freely versus Houndstone, one of this set's counters, and then following up with its strong coverage and disruptive movepool; even if Salazzle cannot pin down Houndstone, its access to Toxic and Knock Off is great for wearing down walls like Gastrodon and Milotic so that Paldean Tauros-W can spam its Water-type attacks more effectively. Other offensive checks to Water-types such as Rotom-C and Kilowattrel also work to this degree, and with Volt Switch, they can also help with positioning Paldean Tauros-W into special walls like Alolan Sandslash and Coalossal. Speed control, like from Sticky Web users such as Vikavolt and Smeargle, will make it so more foes like Wish Scream Tail and Choice item Zoarark are vulnerable to Paldean Tauros-W's revenge killing.</p>"
      },
      "Choice Scarf": {
        "description": "<p>As a revenge killer, Choice Scarf Paldean Tauros-W is capable of OHKOing important threats in the metagame like Delphox, Ambipom, and Dragon Dance Scrafty with its strong STAB attacks. Its good defensive typing means that it could potentially switch into some of the attacks from the aforementioned foes relatively safely, and its ability Intimidate also comes into play when coming in against foes like Ambipom and Paldean Tauros-F. However, Terastallization does not always work in Paldean Tauros-W's favor, as the aforementioned sweepers can easily create resistances to Paldean Tauros-W's attacks and finish it off after surviving its hit, making it a risky revenge killer to rely on. Paldean Tauros-W's coverage is also limited to Earthquake, which is a mere 3HKO versus its most relevant target in Bellibolt, and Stone Edge, which is only for Altaria and is a risky 2HKO due to both damage rolls and inaccuracy. Choice Scarf Paldean Tauros-W is thus best reserved as a dedicated revenge killer, and the lack of pivoting and utility means it struggles to compete with other Choice Scarf users in the tier like Staraptor and Florges. Tera Water is its best option so that it can guarantee a OHKO on Scyther, as well as offer a chance to sweep with both Raging Bull and Wave Crash late-game. Alternatively, sweeping with Tera Fighting Close Combat has its merits against defensive cores with Gastrodon, as well as guaranteeing the Close Combat OHKO on foes such as Tatsugiri, and, after Stealth Rock, Rotom-C.</p> <p>Grass-types like Decidueye and Wo-Chien are complimentary teammates due to them being good checks to Water- and Electric-types like Gastrodon, Milotic, and Rotom-C. They also rely on Paldean Tauros-W to revenge kill the likes of Arcanine and Delphox for them. Given the lack of utility options to effectively deal with walls, this set relies on double switching into special wallbreakers like Toxtricity and Goodra to put pressure on its safe switch-ins like Bellibolt and Galarian Slowbro. Fire-types like Delphox and Salazzle are notable special attackers that will also help deal with foes like Houndstone and Altaria. Defensive cores like Galarian Slowbro + Bombirdier and Altaria + Gastrodon are required for this set to have a backbone to switch into after locking into coverage that makes it vulnerable to its own list of revenge killers like Tatsugiri, Decidueye, and Duraladon. These cores then rely on Paldean Tauros-W to check some of the stronger setup sweepers and wallbreakers like Scrafty and Rotom-H, as it can get in freely when these threats attempt to set up on a passive teammate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Jolteon": {"sets": {"Calm Mind": {}}},
  "Snorlax": {"sets": {"Tank": {}, "Curse": {}}},
  "Articuno-Galar": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Though it has competition from other Psychic-types such as Galarian Slowbro and Delphox and a bad defensive typing, Galarian Articuno is an extremely threatening, albeit niche, offensive pivot and special attacker thanks to a high Special Attack stat, strong STAB moves, great ability in Competitive, and reliable recovery. Future Sight is used over other Psychic-type attacks like Freezing Glare and Psyshock, as it synergizes well with U-turn and can make playing against Galarian Articuno difficult even when it's off the battlefield. Tera Steel provides Galarian Articuno with a valuable defensive typing, allowing it to better take on Pokemon like Skuntank and Decidueye, resist Rock- and Ice-type coverage from Pokemon like Paldean Tauros-F and Ambipom, resist Stealth Rock, be immune to Toxic, and remove all of its original weaknesses. However, this comes at a cost of being unable to check Fighting- and Ground-types such as Paldean Tauros-W and Mudsdale.</p> <p>Galarian Articuno finds itself fitting mostly on balance and offense teams looking for a powerful special attacker and pivot. It struggles heavily against special walls like Bronzong, Assault Vest Galarian Slowbro, and Florges, so checks to these threats like Skuntank and Arcanine make excellent partners. In turn, Galarian Articuno can use Future Sight to deter their checks like Mudsdale and Milotic from switching in. Other wallbreakers like Paldean Tauros-F, Golurk, and Goodra appreciate Galarian Articuno's ability to deter their checks like Milotic and Galarian Slowbro from switching in thanks to Future Sight and the fact that it can pivot them in. As Dark- and Steel-types like Zoroark and Copperajah will commonly switch into Galarian Articuno's Future Sight, Pokemon that take these threats on and deter them from switching in like Paldean Tauros-W, Scrafty, and Florges all make excellent partners. Galarian Articuno's weakness to Knock Off can be extremely crippling, so Knock Off switch-ins like Wo-Chien and Scrafty can make excellent partners, and these two can use Knock Off of their own to remove valuable items like Leftovers and Heavy-Duty Boots from Galarian Articuno's switch-ins like Bronzong, Grimmsnarl, and Meloetta. Galarian Articuno's ability to deter Defog attempts thanks to Competitive makes it an excellent partner for hazard setters such as Mudsdale and Gligar; this quality also makes it work on Sticky Web teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Gligar": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Gligar breaks into the scene as one of PU's top utility Pokemon, able to support a variety of teams with entry hazards and serviceable bulk. In addition, its excellent defensive typing allows it to stand up to many key threats, such as Flamigo and Golurk. Stealth Rock is generally preferred but can be swapped for Spikes if the team already has another Stealth Rock user. Toxic prevents bulkier foes like Bellibolt and Mudsdale from sticking around for too long while also putting setup sweepers like Delphox and Florges on a timer. Knock Off gives Gligar an extra layer of utility by removing items from foes like Galarian Slowbro, Flamigo, Florges, and opposing Gligar, while U-turn is an alternative that allows it to function as a slow pivot that can bring in powerful wallbreakers like Toxtricity and Flamigo and also lets it exit poor matchups without having to switch directly. The added momentum also pairs well with Gligar's reliable ability to set entry hazards. The given EV spread allows Gligar to outspeed Adamant Golurk and avoid a 2HKO from Rotom-C's Leaf Storm after Stealth Rock while still having the maximum amount of physical bulk possible. Tera Water gives it key resistances to STAB moves from foes such as Bruxish and Paldean Tauros-W, while Tera Steel shores up Gligar's matchup into Toxtricity and Galarian Slowbro. Both also remove Gligar's large weakness to Ice. Tera should be used with caution, however, as Tera Water turns Gligar's Electric immunity into a weakness, while Tera Steel removes many of the positives of Gligar's defensive typing, such as its resistance to Fighting and immunity to Ground.</p> <p>Gligar fits best on bulkier offense and balance teams that appreciate its ability to consistently set entry hazards and assist in making long-term progress. Pokemon such as Staraptor, Delphox, and Arcanine that can capitalize on Gligar's ability to cut into bulky foes through status and item removal make great partners for this reason, with the utility options Gligar provides making it much easier for them to find opportunities to close out games. Gligar also appreciates pivots such as Scyther, Rotom-H, and Milotic to help bring it in safely, and it can form a VoltTurn core with these Pokemon if it chooses to carry U-turn. Due to relying on Eviolite for a large portion of its bulk, Gligar is quite weak to Knock Off and therefore appreciates teammates like Scrafty and Virizion that can dissuade or switch into it. In return, Gligar can utilize its immunities to poison and paralysis to absorb any status conditions that may stop these Pokemon from sweeping effectively. This status absorption also comes in handy when paired with Wish users such as Scream Tail and Florges, as Gligar lacks any form of recovery and appreciates having teammates that can provide this for continued use as an effective stopgap. Florges, as well as other special walls such as Assault Vest Galarian Slowbro, can also partner with Gligar to form a strong defensive backbone and wear down each other's checks. Gligar is also almost entirely useless against opposing Gligar, especially if it opts to carry U-turn over Knock Off, so Pokemon that can threaten it such as Tatsugiri and Alolan Sandslash are appreciated. Gligar's matchup into hazard removers is also very poor, so Ghost-types to block Rapid Spin, like Decidueye, and Taunt users to stop Defog, like Bombirdier and Skuntank, also make great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "gulch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Qwilfish": {"sets": {"Defensive Spikes": {"description": "<p>The Speed investment lets Qwilfish move before Adamant Golurk. Haze is another option for the last slot, slowing down setup sweepers like Arcanine and Scrafty. Toxic Spikes may seem appealing, wearing foes down even quicker alongside Spikes, but grounded Poison-types like Galarian Slowbro and Skuntank are too common for the move to be consistently effective.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Swords Dance": {}}},
  "Qwilfish-Hisui": {"sets": {"Specially Defensive": {"description": "<p>The Speed investment lets Hisuian Qwilfish move before Adamant Golurk. Haze is another option for the last slot, slowing down setup sweepers like Florges. Toxic Spikes may seem appealing, wearing foes down even quicker alongside Spikes, but grounded Poison-types like Galarian Slowbro and Skuntank are too common for the move to be consistently effective.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Swords Dance": {}}},
  "Heracross": {"sets": {"Wallbreaker": {}}},
  "Sneasel": {"outdated": true, "sets": {"Swords Dance": {"description": "<p>Life Orb compensates for Sneasel’s naturally middling damage output and makes taking its hits more difficult. Eviolite augments Sneasel’s bulk, which can translate to setup opportunities against threats like Morpeko. However, both options are generally less consistent than Heavy-Duty Boots, which lets Sneasel freely switch in and out to wear foes down or revenge kill weakened targets like Skuntank and Tauros. Tera Ghost makes Sneasel immune to Fighting-type attacks from the likes of Hisuian Sneasel and Passimian, allowing it to either retaliate with a strong attack or set up on them.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Band": {}}},
  "Kingdra": {"sets": {"CritDra": {}, "Rain Sweeper": {}}},
  "Smeargle": {"sets": {"Hazard Setter": {"description": "<p>Silk Trap is chosen over similar moves like Burning Bulwark for its ability to slow down foes like Paldean Tauros-W and Scyther; this gives Smeargle an easier time setting entry hazards or denying Defog attempts.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Hitmontop": {"sets": {"Rapid Spin": {"description": "<p>Hitmontop generally is outclassed as a Fighting-type by other Pokemon such as Paldean Tauros-F, Hariyama, and Pawmot and as a form of offense entry hazard control by the likes of Tatsugiri and Scyther, so it's generally not viable.</p>"}}},
  "Sceptile": {"sets": {"Terrain Sweeper": {}}},
  "Hariyama": {"sets": {"Bulk Up": {}, "Assault Vest": {}, "Belly Drum": {}}},
  "Grumpig": {"sets": {"Nasty Plot": {"description": "<p>Grumpig is not viable in PU, but this is considered its best set.</p> <p>136 Speed EVs let Grumpig outspeed Modest Glaceon. 44 SpA EVs allow unboosted Tera Ground Grumpig to KO offensive Skuntank with Earth Power after Stealth Rock damage.</p>"}}},
  "Altaria": {
    "sets": {
      "Defensive": {
        "description": "<p>Altaria's wide variety of utility options like Defog, Will-O-Wisp, Haze, and Roar, great defensive stats, useful ability in Natural Cure, and excellent typing allowing it to check a wide variety of Pokemon like Paldean Tauros-W, Golurk, Bruxish, and Hariyama make it one of PU's few forms of entry hazard control and a decent wall, although it needs to watch out for Ice-type coverage from Pokemon like Golurk and Scrafty. Brave Bird allows Altaria to not be completely passive and helpless against Taunt from Pokemon like Bombirdier and Skuntank while also doing more damage than Hurricane against specially defensive Pokemon like Florges and Delphox. Altaria's choice of its final move is flexible; Will-O-Wisp cripples physical attackers Altaria switches into like Paldean Tauros-W, Scrafty, and Decidueye. Haze allows Altaria to prevent setup sweepers like Nasty Plot Delphox and Zoroark as well as Curse Arcanine from using it as setup fodder, while Roar does the same but also functions better against Substitute users such as Scream Tail, although it can be counterintuitive with Defog due to not being able to accrue chip damage from hazards that Defog removes. The given EV spread allows Altaria to outspeed Golurk and Adamant Emboar while still providing as much bulk as possible, although a spread of 252 HP / 252 Def / 4 SpD can be used to be bulkier if outspeeding these two is not needed. An alternative spread of 252 HP / 120 SpD / 136 Spe can allow Altaria to become a better special wall, checking Pokemon like Kilowattrel and Meloetta better. Tera Steel flips all of Altaria's weaknesses, allowing it to more safely threaten Pokemon like Alolan Sandslash, Florges, and Scream Tail, although Terastallizing does make it unable to check Fighting- and Fire-types like Flamigo and Delphox as well as removing Altaria's Ground immunity, making the matchup against hazard setters like Gligar and Mudsdale harder.</p> <p>Due to its relative passivity, Altaria fits mostly on bulky balance teams needing a Defogger that can also compress multiple roles. Altaria's ability to absorb status moves like Toxic and Thunder Wave is appreciated by other walls like Wo-Chien and Gastrodon as well as setup sweepers like Delphox and Virizion. In turn, Pokemon like Wo-Chien and Virizion can be reliable Knock Off absorbers for Altaria, so it does not lose its Heavy-Duty Boots. Altaria finds itself extremely susceptible to Ice- and Fairy-types like Alolan Sandslash, Froslass, and Florges as well as coverage moves like Triple Axel from Ambipom; checks to these threats like Bronzong, Skuntank, and Rotom-H thus make excellent partners. Specially defensive walls like Bronzong, Assault Vest Galarian Slowbro, and Florges create a defensive backbone with Altaria. Altaria's ability to check and burn physical attackers like Paldean Tauros-W, Zoroark, and Flamigo allows Pokemon that are checked by these threats like Arcanine and Houndstone become more potent attackers. Altaria's ability to remove entry hazards allows Pokemon particularly weak to them like Choice Scarf Staraptor, Arcanine, and Galarian Slowbro to become bigger threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 617840, "username": "gulch"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Milotic": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Milotic ensures its place as a defensive staple thanks to its ability to stop setup sweepers, take advantage of otherwise debilitating status ailments with Marvel Scale, and take on common threats like Paldean Tauros-W and Salazzle. Haze is preferred, as it can clear stat boosts on Fairy-type Pokemon like Grimmsnarl, Florges, and Tera Fairy Galarian Slowbro and even go through Substitute, which can help versus the former and Scream Tail. However, Dragon Tail can be used to bypass Taunt from Pokemon such as Oricorio-G while still phazing foes. Ice Beam lets Milotic hit incoming Grass-types like Decidueye, Hisuian Electrode, and Rotom-C while also preventing it from being useless against Water-resistant or -immune Pokemon like Altaria, Goodra, Tatsugiri, and Gastrodon. Alluring Voice more directly pressures boosting threats like Scrafty, Paldean Tauros-W, and Tatsugiri, all of which can otherwise exploit Milotic. Flip Turn can be used to turn Milotic into a pivot, but it either has to give up its matchup versus setup sweepers or Water-resistant and -immune Pokemon, making it hard to justify. If Milotic runs Dragon Tail, it can opt to use Mirror Coat over Ice Beam to still threaten Fairy-types that like to set up, such as Florges and Tera Fairy Galarian Slowbro, while also letting it do damage to Pokemon it couldn't touch otherwise like Duraludon. Heavy-Duty Boots allows Milotic to circumvent being chipped by entry hazards while Leftovers can counteract Milotic's need to heal as often and make it less vulnerable to chip damage from status. Marvel Scale allows Milotic to take advantage of status ailments such as the burn from Altaria's and Coalossal's Will-O-Wisp as well as Gastrodon's Scald, paralysis from Duraludon's Thunder Wave, and poison from Skuntank's Poison Jab. Competitive can be used to take advantage of Defog users like Altaria and Scyther as well as Pokemon with stat-dropping moves like Parting Shot Grimmsnarl and Memento Tatsugiri, but in general, it tends to be quite niche and very situational. The given EV spread makes Milotic as physically defensive as possible while outspeeding Adamant Golurk. Tera Dragon gifts Milotic Grass and Electric resistances while maintaining key resistances to Water and Fire, letting it better take on Decidueye and Rotom-H.</p> <p>Due to Milotic's ability to phaze Pokemon with Dragon Tail, entry hazards from setters like Alolan Sandslash, Coalossal, and Gligar work well alongside it, helping Milotic wear down the opposing team more easily. Choice Scarf users like Flamigo, Zoroark, and Paldean Tauros-F greatly appreciate Milotic's ability to spread chip damage with Dragon Tail and ensure setup sweepers like Toxtricity, Virizion, and Scrafty don't get out of hand, as it makes late-game cleaning easier for them. Grass- and Electric-types like Wo-Chien, Pawmot, and Kilowattrel easily threaten Milotic, so teammates like Rotom-H, Mudsdale, and Assault Vest Goodra act as good switch-ins that can still threaten these Pokemon offensively. Special tanks like Bronzong, Wo-Chien, and Assault Vest Galarian Slowbro help create a defensive backbone alongside Milotic. While Milotic can switch into Water-types like Paldean Tauros-W and Gastrodon and easily tank their attacks, it can't do much back, making it a stalemate. Pairing Milotic with offensive threats like Rotom-C, Kilowattrel, and Decidueye helps to circumvent this issue. As Milotic can't easily carry Flip Turn, it can be a momentum sink at times, so other pivots are valuable partners. In addition, pivots like Scyther, Rotom-H, and Decidueye match up well against the Grass- and Electric-types like Virizion and Bellibolt that threaten Milotic. On top of that, these pivots enjoy bringing in Milotic on their checks like Mudsdale, Gastrodon, and Coalossal. Thanks to Milotic's ability to switch in to Water- and Fire-type attacks from Paldean Tauros-W and Arcanine, it can support Pokemon like Delphox, Golurk, and Rotom-C greatly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Regirock": {"sets": {"Stealth Rock": {}}},
  "Staraptor": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Staraptor is one of PU's strongest and most consistent revenge killers and cleaners thanks to its Reckless-boosted STAB attacks and high Speed , which allows it to outspeed other Choice Scarf Pokemon like Flamigo and Florges. U-turn allows Staraptor to pivot out of bad matchups like Bronzong and Houndstone, as well as being good to revenge kill Pokemon like Decidueye and Scrafty while still keeping momentum for the team. Close Combat is extremely important coverage, allowing Staraptor to hit Steel- and Rock-types that would otherwise completely wall it like Alolan Sandslash, Duraludon, and Coalossal. Tera Normal removes Staraptor's Stealth Rock weakness, gives it a better matchup against Pokemon like Bellibolt, Pawmot, and Rotom-H, and allows Staraptor to 2HKO Bellibolt and Galarian Slowbro. Tera Normal also keeps its Ghost immunity. Tera Flying boosts Staraptor's more reliable STAB move in Brave Bird while still 2HKOing Galarian Slowbro and keeping its Ground immunity.</p> <p>Staraptor fits primarily on balance and offense teams looking for a reliable revenge killer that can also operate as a pivot if need be. Staraptor can struggle to break through physical walls such as Milotic, Bellibolt, and Bronzong; checks to these threats like Golurk and Skuntank make excellent partners. Other pivots like Bellibolt, Gligar, and Rotom-H can pair with Staraptor to make a powerful VoltTurn core. Staraptor requires entry hazard control to operate as a revenge killer, so Rapid Spin support from Tatsugiri and Alolan Sandslash and Defog from Scyther are extremely appreciated. Staraptor's main problems arise from its frailty and ability to be easily taken advantage of by Ghost-types like Houndstone and Golurk as well as priority from Zoroark, Arcanine, and especially Skuntank due to Sucker Punch and Aftermath. Pairing it with both special walls like Assault Vest Galarian Slowbro and Bronzong and physical walls like Coalossal and Wo-Chien that Staraptor can fall back on is very important to have</p>"
      },
      "Choice Band": {
        "description": "<p>In terms of sheer power, few Pokemon outclass Choice Band Staraptor's STAB options; however, its weakness to Stealth Rock and its constant recoil often limit it to making trades or forcing damage on Pokemon like Bellibolt, Regirock, and Bronzong. Brave Bird and Double-Edge are boosted by Reckless, letting Staraptor 2HKO Pokemon like Galarian Slowbro and Gligar. U-turn lets it pivot out of poor matchups like Houndstone and gives it more flexibility, while Close Combat is used for the Rock- and Steel-types that resist its STAB moves like Coalossal and Alolan Sandslash. Quick Attack is also useful for picking off faster foes like Salazzle and Choice Scarf Flamigo as well as slower priority users like Skuntank and Toxicroak. Tera Flying is recommended because even though both of Staraptor's STAB moves have the same base power, Tera Flying Brave Bird is more spammable than Tera Normal Double-Edge; however, Staraptor can be Tera Normal if the team it's on would prefer a stronger Normal-type STAB attack. A Jolly nature lets it outspeed targets like Galarian Articuno and non-Choice Scarf Meloetta as well as speed tie with most other Staraptor and Paldean Tauros-W in a pinch.</p> <p>Staraptor's weakness to Stealth Rock requires entry hazard removal for it to be at its max effectiveness, so Pokemon like Decidueye and Coalossal are recommended to support it. They also have the benefit of switching into common revenge killers like Virizion, Salazzle, and Ambipom, while Decidueye specifically can bring in Staraptor with a slow U-turn. Other pivots like Bellibolt and Meloetta can bring Staraptor in on their switch-ins like Wo-Chien and Gastrodon; in return, Staraptor can pivot on Pokemon like Regirock and Arcanine for them, making a strong VoltTurn core. Choice Specs Zoroark is also a notable partner, as many of Staraptor's switch-ins like Bronzong cannot take a Dark Pulse and many of Choice Specs Zoroark's switch-ins like Hariyama fall to a Brave Bird, so both can pivot to the other to create further mindgames. However, any form of entry hazards reveal the ruse quickly. Late-game cleaners like Arcanine and Paldean Tauros-W also appreciate Staraptor wearing down shared checks like Coalossal and Houndstone.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 414072, "username": "Hera"}, {"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 527276, "username": "Techno"}]}]}
  },
  "Gastrodon": {
    "sets": {
      "Physical Wall": {},
      "Special Wall": {
        "description": "<p>Gastrodon's great typing, ability, and utility movepool allow it to fit on many teamstyles from stall to balance, checking threats like Tatsugiri and Rotom-H. Ice Beam in tandem with Earth Power provodes near-unresisted coverage with only Rotom-H and Levitate Bronzong able to switch into this combination of moves, and it also hits common switch-ins to Earth Power like Rotom-C, Decidueye, and Staraptor super effectively. Clear Smog, however, works best on bulkier teams, as it both stops Gastrodon from being setup fodder and lets it check setup sweepers that these teams struggle with such as Bulk Up Scrafty, Calm Mind Florges, and Curse Arcanine. Surf targets Rotom-H, which Gastrodon walls but has issues with taking out, gives it a useful secondary STAB move and hits Flying-types neutrally. Gastrodon usually runs Stealth Rock is usually ran, but if a team already has a Stealth Rock user like Bronzong, Bombirdier, or Coalossal, Spikes could be used instead so it can help out its team entry hazard-wise no matter what. Leftovers prevents Gastrodon from having to heal as often, while Heavy-Duty Boots alleviates pressure from entry hazards during switches. Storm Drain allows Gastrodon to wall Water-type wallbreakers like Tatsugiri and also stop Qwilfish from pivoting with Flip Turn. Sticky Hold can be used on more defensive teams that require a Knock Off switch-in. Tera Poison helps Gastrodon check Fighting-types like Paldean Tauros-W, Hariyama, and Heracross while also turning its 4x weakness to Grass-type attacks into a resistance, letting it take hits from Rotom-C and Decidueye in a pinch. On top of this, it becomes immune to Toxic from Salazzle. Tera Fairy also helps Gastrodon versus the aforementioned Fighting-types, gifting it a more well-rounded defensive typing that allows it to check Scrafty, Zoroark, and Scyther better. Alternatively, a physically defensive EV spread can be used to better handle threats like Paldean Tauros-W, Skuntank, and Pawmot.</p> <p>While Gastrodon is a strong specially defensive wall, its Defense is lacking. In order to patch up this issue, Gastrodon pairs well with Bellibolt, Galarian Slowbro, and Altaria, as they can handle Staraptor, Flamigo, Paldean Tauros-W, and Hariyama more reliably. Gastrodon consistently checks Fire-, Poison-, and Steel-type Pokemon like Rotom-H, Skuntank, and Duraludon, so Pokemon that can benefit from this like Rotom-C, Flamigo, and Choice Specs Florges make for great teammates. Grass-types like Hisuian Electrode, Decidueye, and Rotom-C easily threaten Gastrodon; therefore, it should have partners like Arcanine, Paldean Tauros-F, and Rotom-H that can scare out these foes. In turn, Gastrodon handles threatening Water-types like Tatsugiri and Kingdra amazingly. With entry hazard support from Gastrodon, wallbreakers like Toxtricity, Zoroark, and Emboar break through their checks like Bronzong, Wo-Chien, and Milotic more effectively. Gastrodon also tends to drain momentum, so to circumvent this, partners like Rotom-H, Scyther, and Flamigo can check common switch-ins to Gastrodon like Rotom-C and Wo-Chien and also pivot to regain momentum.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ambipom": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Ambipom is a capable offensive pivot that can create momentum as an anti-offense lead, or it can revenge kill foes and clean up late-game with its Technician-boosted Fake Out and impressive Speed tier. Opposing sweepers, other revenge killers, and fast pivots such as Shift Gear Toxtricity, Choice Scarf Staraptor, and Kilowattrel, whose Speed tiers make them otherwise hard to deal with, can be picked off or forced out by using Fake Out. U-turn allows Ambipom to escape after dealing Fake Out chip or maintain pressure on an anticipated switch. Knock Off serves as coverage for Ghost-types such as Decidueye and Golurk while also making progress by removing key items like Heavy-Duty Boots from users such as Bombirdier and Eviolite from foes such as Hisuian Qwilfish. Triple Axel provides Technician-boosted coverage for potential switch-ins, being most effective against Gligar and Altaria. Alternatively, Double-Edge provides a more accurate and STAB-boosted option that has a chance to OHKO frailer offensive Pokemon—Tatsugiri and Salazzle being two examples. Double Hit is another STAB-boosted option that trades accuracy and some power for longevity, especially when paired with Protective Pads. Because of its frequent pivoting, Ambipom often uses Heavy-Duty Boots for greater longevity throughout games, avoiding chip damage from entry hazards. Protective Pads guards Ambipom from contact effects like Flame Body burns and Rocky Helmet chip damage, which are most inhibiting to sets with Triple Axel and Double Hit. Silk Scarf and Tera Normal achieve a similar effect for Ambipom, improving key Fake Out rolls in a pinch by consistently 2HKOing Kilowattrel and Salazzle, whose high Speed can mandate trading Pokemon for Fake Out hits. Tera Normal or Silk Scarf Double-Edge and Double Hit also have respectable damage outputs, OHKOing Tatsugiri and Zoroark. When used together, Ambipom gains legitimate wallbreaking potential: Tera Normal Silk Scarf Double-Edge has a favorable roll to 2HKO Galarian Slowbro and Bellibolt, the two best physical walls in the tier.</p> <p>Ambipom is well suited for bulky or fast offense and balance teams susceptible to fast threats and opposing setup. Sweepers such as Dragon Dance Scrafty and Calm Mind Scream Tail that have fewer chances to set up may be picked off by speed control or trade damage with bulkier Pokemon like Goodra and Meloetta. Thus, Ambipom's ability to apply pressure after they faint and prevent counter sweeps is a helpful addition. Entry hazard users like Gastrodon and Gligar also synergize with Ambipom, taking advantage of Knock Off removing Heavy-Duty Boots to wear down susceptible foes—removal options like Alolan Sandslash and Defog Scyther rely on Heavy-Duty Boots to switch in several times. Hazards also allow Ambipom to wear down teams by repeated switching and enable Silk Scarf sets to break through chipped switch-ins like Assault Vest Galarian Slowbro, which it 2HKOes with Stealth Rock up. Unfortunately, without Protective Pads, Ambipom is very susceptible to contact abilities like Static and Flame Body, and it struggles to break common physical walls like Bellibolt and defensive Galarian Slowbro that it cannot consistently 2HKO after Terastallizing without Silk Scarf. As such, it benefits from wallbreakers such as Toxtricity and Golurk that clear through these checks. Ambipom also appreciates bulky teammates with recovery such as Milotic and Florges, allowing a safe switch in after using U-turn. Finally, variants of Ambipom not using Heavy-Duty Boots are easily worn down by opposing hazards and appreciate removal from teammates like Coalossal and Altaria, which in turn appreciate Ambipon providing more opportunities for them to be brought in on favorable matchups and remove hazards or make progress with other utility moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641532, "username": "bleahey"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 414072, "username": "Hera"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Mismagius": {"sets": {"Nasty Plot": {}}},
  "Skuntank": {
    "sets": {
      "Utility": {
        "description": "<p>Skuntank's unique typing, ability in Aftermath, and movepool tailored for both stallbreaking and revenge killing establish it as a solid glue Pokemon in the metagame for a variety of team structures. Its typing allows it to check a variety of threats, such as Galarian Slowbro and Decidueye, which creates reliable opportunities to debuff walls like Mudsdale, Gligar, and Bellibolt on the switch, as not much in the metagame can resist its STAB combination of Gunk Shot and Knock Off. Sucker Punch is able to pick off weakened offensive threats such as Delphox and Toxtricity as well as Choice Scarf users like Staraptor and Rotom-C. Taunt is useful to stop the likes of Bellibolt and Milotic from healing freely and also inhibits setup sweepers such as Scrafty. Toxic can be used instead to cripple and wear down switch-ins like Mudsdale and Gastrodon. Rocky Helmet is useful to punish opposing Knock Off users like Scrafty, Bombirdier, and other Skuntank, as Skuntank is often the designated Knock Off absorber for many teams. Rocky Helmet also synergizes well with Aftermath to allow Skuntank to trade with contact-attacking threats like Arcanine and Paldean-Tauros W as needed. The boost from Black Glasses works exceptionally well with an Adamant nature and Tera Dark, as Skuntank can break through walls like Gastrodon and Altaria with these boosts stacked while also notably giving Adamant variants a guaranteed chance to OHKO Delphox from full with Sucker Punch. Some teams may opt for Heavy-Duty Boots, as it can be used to more reliably handle Decidueye for teams that need that support, avoiding the 3HKO from Spirit Shackle after Stealth Rock chip damage. A Jolly nature is useful to outspeed the likes of Goodra, Tatsugiri, and Jolly Bombirdier, while an Adamant nature can be used for additional power, for example, guaranteeing an OHKO against Golurk with Knock Off even without Black Glasses. Tera Ghost can be used over Tera Dark for its defensive merits versus certain Hyper Offensive sweepers; for example, Skuntank becomes immune to Boomburst from Toxtricity and Scream Tail as well as Curse Arcanine's Extreme Speed in a pinch and can then fire back with Gunk Shot or Knock Off.</p> <p>Skuntank functions well on entry hazard-stacking archetypes thanks to its ability to lure in and remove Heavy-Duty Boots from the likes of Bellibolt, Arcanine, and Milotic. Spikes setters such as Gastrodon and Coalossal are able to wear down offensive threats like Tatsugiri and Salazzle into range of Skuntank's Sucker Punch as well. Additionally, Skuntank is a valuable asset for hyper offense teams, providing role compression by being able to defensively check problematic threats like Decidueye while also supporting setup sweepers such as Calm Mind Scream Tail, Curse Arcanine, and Bulk Up Paldean Tauros-W by wearing down shared checks such as Coalossal, Mudsdale, and Milotic with Toxic and Knock Off support. These offensive threats also appreciate Skuntank's ability to pivot into one of their best answers, Galarian Slowbro, fairly reliably. Decidueye is another great partner with solid synergy, appreciating Skuntank's ability to take on checks like Scrafty and Wo-Chien and even wear down opposing Skuntank while Decidueye directly takes on Mudsdale, Gastrodon, and Paldean Tauros-W. Offensive Water-types such as Tatsugiri and Paldean Tauros-W appreciate Skuntank's ability to pressure Grass-types like Wo-Chien and Decidueye, while in return, they can switch into Ground-types like Mudsdale and Gligar immediately after Skuntank has crippled them with Knock Off. Skuntank's ability to offensively check the likes of Delphox, Decidueye, and Staraptor can also be beneficial for defensive pieces such as Wo-Chien and Bellibolt to not become overwhelmed, which can allow them to return the favor by better handling threats to Skuntank such as Mudsdale and Flamigo, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 435539, "username": "BloodAce"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Bronzong": {
    "sets": {
      "Utility": {
        "description": "<p>Bronzong utilizes its defensive profile and typing to be a solid switch-in for special attackers like Florges and Kilowattrel and Stealth Rock setter. Earthquake pressures Poison-, Fire-, and Steel-type Pokemon like Skuntank, which it 2HKOes, Galarian Slowbro, and notable spinners like Coalossal and Alolan Sandslash. Alternatively, Night Shade provides consistent damage into Steel-resistant foes like Milotic and boosted setup sweepers like the Paldean Tauros formes. Bronzong may use a wide variety of moves in its fourth moveslot. Protect pairs with Leftovers to improve Bronzong's passive recovery. Psychic Noise is another option that disrupts common recovery users like Gastrodon and Galarian Slowbro switching in. Tera Water allows Bronzong to improve its matchup against Fire-types like Salazzle and Delphox on sets without Heatproof. Meanwhile, Tera Ground allows Earthquake to offensively pressure threats like Fire-types and Skuntank and shut down seemingly safe Volt Switch attempts from Pokemon like Choice Specs Toxtricity. Instead of Leftovers and Protect, Bronzong may use no item on Levitate variants, becoming immune to Poltergeist from powerful Ghost-type Pokemon like Decidueye and walling Golurk's STAB moves. Bronzong may opt for a niche set with Toxic Orb and Trick to punish switch-ins by disrupting walls like Bellibolt and Florges and impair offensive threats like Decidueye and Arcanine whose items help them sweep or switch in to set up. Heatproof may be used instead of Levitate on teams that struggle against Fire-types like Salazzle and Delphox.</p> <p>Bronzong is a great defensive backbone for bulky balance teams. Fairy-types make good defensive partners, switching into Dark-type attacks, especially Knock Off, while they gain a fallback against Toxic and Poison-type attacks. Fairy- and Dark-types like Grimmsnarl and Skuntank that can safely switch in on Knock Off relieve pressure on Bronzong and its defensive partners. Florges and Scream Tail make particularly good partners, providing Wish support to assuage Bronzong's limited recovery. Physically defensive Pokemon like Bellibolt and Gligar or Dragon-types like Altaria and Goodra round off these defensive cores, and these Pokemon appreciate Bronzong's Ground immunity or Ice and Dragon resistance, respectively, as well as the fact that it is a specially defensive switch-in. On Protect variants, Bronzong can also take advantage of status like Bellibolt, Gligar, and Goodra's Toxic and Altaria's Will-O-Wisp. In return, Bronzong appreciates teammates that cover for its lack of physical investment. Given these team structures, Bronzong cores can feel passive and susceptible to Knock Off. However, PU has many powerful Dark- and Fighting-types that alleviate this issue through their offensive presence and typing synergy. Paldean Tauros-W and Scrafty appreciate a switch-in to Fairy-types like Florges and Scream Tail and are potent sweepers with the longevity to threaten Dark-types throughout games. Finally, Heatproof Bronzong's ability to switch into Salazzle and Delphox and threaten them with Earthquake aids other sweepers like Virizion and Scyther, granting them more opportunities to set up.</p>"
      },
      "Bulky Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"user_id": 641532, "username": "bleahey"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Toxicroak": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Unlike other Fighting-types, which can be easily checked by bulky Water-types like Milotic and Qwilfish, Toxicroak, thanks to its ability, can use these Pokemon as setup fodder. Toxicroak also has the benefit of not being able to be hit by priority in Aqua Jet from Bruxish and Paldean Tauros-W, letting it check them in a pinch with its Sucker Punch, and its STAB combination is quite good due to how it dissuades Steel-types, like Copperajah and Duraludon, with its Fighting-type STAB moves, which might've switched into its Gunk Shot otherwise. However, Toxicroak is generally weaker and slower than the other Fighting-types it competes with, making it much more niche. Drain Punch provides Toxicroak with a form of longevity and can counteract Life Orb chip damage, but unlike Drain Punch, Close Combat can OHKO Copperajah from full and after minimal chip, Skuntank as well. Sucker Punch allows Toxicroak to pick off faster threats like Delphox, Meloetta, and Choice Scarf Hoopa. However, Knock Off is a more reliable coverage move that lets Toxicroak hit Bronzong and Galarian Slowbro harder while also crippling item-dependent Pokemon like Gligar. Earthquake instead gives Toxicroak a means to hit Poison-types like Toxtricity, Galarian Slowbro, and Tera Poison Florges and Wo-Chien. Ice Punch could also be run as a last move to hit Altaria and Gligar, but the former doesn't take Gunk Shot too well, while the latter can be worn down over time with its lack of recovery. Leftovers allows Toxicroak to switch in repeatedly and reliably check Milotic and Paldean Tauros-W over the course of a battle; however, more offensive builds can opt for Life Orb to maximize Toxicroak's damage output, as at +2, Toxicroak can OHKO Altaria with Gunk Shot, Meloetta with Sucker Punch, Gligar with Ice Punch, and, after Stealth Rock chip, Galarian Slowbro with Knock Off. Tera Dark gifts Toxicroak the ability to blank Psychic-type attacks, and it simultaneously boosts Sucker Punch and Knock Off. It also removes Toxicroak's Ground weakness, helping it versus Gastrodon, but instead of being resistant to Fighting-type attacks, Toxicroak is now weak to them, and it can be hit by Toxic. Jolly is preferred to outpace Goodra and Bombirdier and to Speed tie with Duraludon, but Adamant can be used to always OHKO Wo-Chien with Gunk Shot and Close Combat and Meloetta with Sucker Punch when Toxicroak is at +2.</p> <p>Toxicroak fits best on offense and balance teams that like having a Pokemon that can consistently come in on defensive Water-types like Milotic and Qwilfish and take advantage of them. Because of this, teammates that like the aforementioned bulky Water-types gone like Bruxish, Arcanine, and Ambipom have good synergy with Toxicroak. While Toxicroak can take a hit or two from Fighting-types like Flamigo, Heracross, and Paldean Tauros-W to then finish them off, it is a poor long-term check, as most of them carry coverage for it or can simply overwhelm it with their repeated high-Base Power attacks, meaning switch-ins for these Pokemon like Galarian Slowbro and Milotic are greatly appreciated. Psychic- and Ghost-types like Galarian Articuno, Hoopa, and Decidueye enjoy Toxicroak's presence, as it reliably switches into and takes care of Dark-types like Skuntank, Zoroark, and Wo-Chien for them. Toxicroak can struggle when up against defensive Ground- and Poison-types like Mudsdale, Gligar, Galarian Slowbro, and Tera Poison Florges, so Pokemon like Decidueye, Rotom-C, Golurk, and Delphox that can threaten these checks pair excellently. If not running Sucker Punch, Toxicroak fears faster Psychic-types like Galarian Articuno, Meloetta, and Bruxish, so it likes Steel- and Dark-type partners such as Bronzong, Wo-Chien, and Bombirdier that can alleviate this weakness. In return, Toxicroak can weaken checks it shares with the first like Mudsdale and Gligar, and Toxicroak can take care of Fairy-types like Florges and Tera Fairy Galarian Slowbro for the latter two. Due to Toxicroak's frailty, it enjoys slow pivots that can get it into battle safely, such as Gligar, Bellibolt, and Flip Turn Milotic.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Abomasnow": {"sets": {"Aurora Veil": {}}},
  "Froslass": {
    "sets": {
      "Spikes Lead": {
        "description": "<p>Froslass's rare combination of high Speed, vast utility movepool, and its typing, which lets it take advantage of spinners like Tatsugiri and Alolan Sandslash and aids it in beating the Defoggers such as Scyther and Altaria one-on-one, helps it solidify a niche as a dedicated hyper offense lead that can beat common Ground-type entry hazard setters like Mudsdale and Golurk. Ice Beam is Froslass's preferred STAB move for its power, but Icy Wind could be run instead to slow down foes like Salazzle and Choice Scarf Meloetta for its teammates. Taunt stops Pokemon like Coalossal and Gastrodon from setting up their entry hazards on Froslass as well as Pokemon such as Bronzong from using it as setup fodder. On the other hand, Will-O-Wisp cripples physical attackers like Paldean Tauros-W and messes with Sucker Punch users such as Skuntank and Bombirdier. Destiny Bond lets Froslass get either a KO or an extra turn to set up another layer of Spikes unharmed due to its threat. Thunder Wave can be used over Taunt or Will-O-Wisp so that Froslass can cripple special attackers like Delphox and Florges better, but its matchups into the aforementioned Sucker Punch users worsen a bit. Avalanche could also be run as Froslass's STAB move because its negative priority means Destiny Bond might get a surprise KO on a foe, but it misses out on the power of Ice Beam and the utility of Icy Wind, and it can be played around easily once revealed. Since Froslass's goal is to set up hazards and then provide an entry point for its partners when it faints, its Tera types are for the niche situations in which it has difficulty achieving this, and therefore, Froslass should be Terastallized sparingly. Tera Fairy gives Froslass a strong defensive typing that provides a Dark resistance, helping it against Sucker Punch Bombirdier and Skuntank. Alternatively, Tera Dark gifts Froslass a Dark resistance as well alongside a Ghost resistance, which helps it versus Decidueye and Golurk, and it blocks status moves like Encore and Taunt from Prankster users such as Sableye and Grimmsnarl. However, Froslass gains a Fighting weakness.</p> <p>Froslass works exclusively as a dedicated lead on hyper offensive teams, which enjoy Spikes weakening checks. As Froslass's Spikes can be easily removed after it's KOed, a Defog deterrent like Competitive Kilowattrel, Pokemon such as Toxtricity and Skuntank that threaten out Defoggers, and spinblockers like Oricorio-G and Tera Ghost Salazzle are vital partners to help keep up pressure. Pokemon like Arcanine, Salazzle, and Minior, which prefer to run other items like Leftovers, Focus Sash, and White Herb instead of Heavy-Duty Boots, appreciate Froslass's ability to deny opposing hazards from being set up. Teammates like Bulk Up Paldean Tauros-W and -F, both Nasty Plot and Swords Dance Zoroark, and Throat Spray Toxtricity all benefit greatly from their checks like Gastrodon, Wo-Chien, and Golurk being whittled into range of a 2HKO or OHKO. Fighting-type teammates like Paldean Tauros-W and Scrafty that can take advantage of common switch-ins to Froslass such as Coalossal and Dark-types like Skuntank and Zoroark are greatly appreciated, as Froslass fails to effectively threaten the latter two otherwise, barring status conditions from moves like Will-O-Wisp and Thunder Wave.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Rotom-Heat": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Rotom-H is a solid wallbreaker that offers a lot of utility, both offensively and defensively, in comparison to stronger special attackers like Delphox and bulkier pivots like Bellibolt. With its typing, bulk, and access to Levitate, Rotom-H can easily switch into walls like Mudsdale and Bronzong as well as offensive threats like Arcanine and either set up on them or pivot with Volt Switch. Pain Split makes Rotom-H more adept at dismantling defensive teams, simultaneously keeping it healthy and helping it overwhelm special walls like Assault Vest Galarian Slowbro and Florges. The move is an inconsistent source of recovery, though, so Rotom-H shouldn't rely on it too heavily. Investing in HP maximizes the mileage Rotom-H gets from its defensive profile and also gives it an easier time setting up and sticking around. Overheat's high Base Power means that it hits hard even without Special Attack investment. Thunderbolt and Discharge are alternatives to Volt Switch that are better suited for wallbreaking, don't force Rotom-H to switch out, and can paralyze foes, but pivoting with Volt Switch is a huge part of Rotom-H's viability. Tera Steel makes Rotom-H immune to poison, letting it set up on Toxic users like Bellibolt and Gligar, and resist Stealth Rock in case it loses its Heavy-Duty Boots. It also helps Rotom-H stomach Normal-, Psychic-, and Dragon-type attacks from the likes of Toxtricity, Meloetta, and Duraludon while keeping most of its natural resistances. Tera Poison maintains the Toxic immunity in addition to flipping the script on Fighting-types like Paldean Tauros-F and Pawmot. Both options synergize well with Levitate, though Tera Poison leaves Rotom-H open to Psychic-type moves from the likes of Galarian Slowbro and Calm Mind Florges.</p> <p>Rotom-H shines on bulky offense and balance teams, which best leverage its unique blend of offense and defense and benefit from it breaking through opposing bulky builds early- or mid-game. Gastrodon is nearly impossible for Rotom-H to break on its own and must be accounted for when using it. Strong physical attackers like Decidueye and Flamigo are good at pressuring Gastrodon as well as other special walls like Florges and Goodra. In return, Rotom-H covers these wallbreakers against revenge killers like Kilowattrel and Scyther; exploits nuisances like Bombirdier, Wo-Chien, and Houndstone; and gets them in safely against other walls like Scream Tail and Coalossal. A lure like Toxic Skuntank or Power Whip Goodra can either gradually or immediately get rid of Gastrodon, with the former also softening foes like Gligar and Naclstack with Knock Off and the latter making up for Rotom-H's bad matchup against offense by scaring out threats like Paldean Tauros-W. Additional pivots like Flamigo, Zoroark, and Bruxish form strong VoltTurn cores with Rotom-H, which can be difficult for foes to withstand. While Rotom-H's bulk is good, it benefits from having proper defensive walls like Mudsdale, Galarian Slowbro, and Gastrodon to fall back on against stronger attackers while making up for their occasional passivity. Florges and Scream Tail are walls that also offer Wish support, which can reduce Rotom-H's reliance on Pain Split for recovery. Finally, Pokemon like Skuntank, Flamigo, and Mudsdale can absorb Knock Off for Rotom-H, ensuring that it doesn't lose its Heavy-Duty Boots while playing around foes like Scrafty and Copperajah.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rotom-Mow": {"sets": {"Choice Scarf": {}, "Utility": {}}},
  "Uxie": {"sets": {"Utility": {"description": "<p>Thunder Wave is an option over Encore, Knock Off, or U-turn to allow Uxie to cripple faster attackers such as Paldean Tauros-W and Zoroark; however, it generally provides less utility than other options.</p>"}, "Terrain Sweeper": {}}},
  "Mesprit": {"sets": {"Utility": {"description": "<p>Mesprit can opt not to hold an item to reduce the damage it takes from Knock Off and, thanks to Levitate, wall Golurk. However, Mesprit generally prefers having an item to increase its overall reliability.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Emboar": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Despite facing tight competition from other Fighting-types like Flamigo, Scrafty, and the Paldean Tauros formes, which are faster, more useful defensively, or both, Emboar is still a solid wallbreaker. Emboar's sheer strength, coverage, and access to Reckless-boosted STAB Flare Blitz let it easily cleave through physical walls like Galarian Slowbro and Bellibolt without requiring Choice Band or setup, making it hard for balance to pivot around. Sucker Punch makes up for Emboar's low Speed, picking off weakened foes such as Delphox and Salazzle; be mindful of utility moves like Encore and Toxic when trying to revenge kill these Pokemon, though. Knock Off punishes walls like Gligar and Altaria that are reliant on their items and can otherwise annoy Emboar, while Earthquake provides coverage for Bellibolt, Skuntank, and Qwilfish that doesn't trigger Static, Aftermath, and Rocky Helmet. Emboar can run additional Reckless-boosted coverage in Head Smash and Wild Charge to destroy Altaria and Tera Water Gligar, respectively, but these moves aren't particularly useful against most teams. These moves also wear Emboar down even faster, especially Head Smash, which limits its offensive capabilities. Even though a Jolly nature lets Emboar outspeed neutral-natured threats like Decidueye and Toxtricity, an Adamant nature allows it to potentially 2HKO Galarian Slowbro, Milotic, and physically defensive Gastrodon from full HP with the appropriate STAB move. Heavy-Duty Boots is preferred for increasing Emboar's longevity and giving it more flexibility in its approach to wallbreaking, but Choice Band can be used if Emboar wishes to go all in on decimating the opposition, letting Flare Blitz 2HKO even Mudsdale and Palossand.</p> <p>Emboar can't afford to switch directly into most Pokemon, since it's quite slow and already on a timer due to Flare Blitz's recoil; as such, it benefits a lot from being paired with pivots. Scyther, Rotom-C, and Meloetta are some offensive Pokemon that fulfill this role, baiting in walls like Coalossal and Wo-Chien for Emboar to clobber while picking up the slack for it against faster teams. Rotom-C is also notable for checking Water- and Ground-types like Milotic, Mudsdale, and Gastrodon. Slower pivots like Bellibolt, Gligar, and Milotic also generate momentum for Emboar while using their bulk and typing to stave off revenge killers like Paldean Tauros-W and Skuntank. Bellibolt can also potentially slow down faster physical attackers with Static, giving Emboar even more opportunities to fire off its strong attacks. Other paralysis spreaders like Duraludon and Dudunsparce can supply additional speed control, effectively nullifying Emboar's main flaw. Psychic- and Fairy-type sweepers such as Galarian Slowbro and Florges benefit from the immense pressure Emboar puts on Dark- and Steel-types. In return, these Pokemon offer Emboar safety from faster foes like Flamigo and Kilowattrel and can use moves like Toxic and Psychic Noise to quickly wear down nuisances like Mudsdale and Scream Tail. In addition, physical setup sweepers like Scrafty, Zoroark, and Scyther have an easier time finishing teams off with Emboar ripping through walls like Florges, Coalossal, and Houndstone early-game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Emboar makes use of Choice Scarf to counteract its middling Speed stat, becoming a terrifying revenge killer. Its main advantages over other revenge killers are its surprise factor and, more importantly, its incredible attacking power compounded by Reckless, with Reckless-boosted Flare Blitz making light work of threats like Scyther and Florges as well as breaking past common walls such as Wo-Chien and Bronzong. Knock Off complements Emboar's dual STAB moves well; it can slice through the likes of Delphox and Golurk with no drawbacks, as well as remove items from the likes of Gligar and Galarian Slowbro switching into it. Knock Off is usually the safest move to lock into due to its complete lack of drawbacks and its guarantee of progress with item removal. Earthquake is a useful mid-ground that can hit Fire-resistant Pokemon like Delphox and Arcanine and Fighting-resistant Pokemon like Toxtricity and Galarian Slowbro in the same slot while additionally avoiding negative contact effects like Bellibolt's Static, Skuntank's Aftermath, and chip damage from the various Rocky Helmet users in the tier. Head Smash is a risky coverage option that allows Emboar to hit Altaria super effectively while cleanly OHKOing Hisuian Braviary and making light work of Arcanine. Additionally, it retains some of the benefits of Earthquake by hitting Fire-types super effectively, and, as it's a Rock-type move, it has no immunities, unlike Earthquake. Head Smash is still a risky option because the recoil damage is a huge drawback, and its accuracy is poor. Wild Charge is another midground option that lets Emboar hit Water-types like Paldean Tauros-W and Milotic and, like Head Smash, is boosted by Reckless. Tera Dark sharpens Knock Off into a strong STAB attack that can cleanly OHKO Delphox and 2HKO physically defensive Galarian Slowbro. Additionally, Tera Dark gives Emboar a relevant Psychic immunity in the face of Choice Scarf Meloetta and Galarian Articuno. Tera Fighting and Tera Fire can be used to bolster the already great power of Emboar's STAB attacks, letting it 2HKO Milotic and Arcanine with Tera Fighting Close Combat and 2HKO physically defensive Bellibolt and Gligar with Tera Fire Flare Blitz. Emboar's Choice Scarf-boosted Speed allows it to outrun even base 120 Speed Pokemon like Minior; however, Kilowattrel and various faster Choice Scarf users still outspeed and threaten Emboar.</p> <p>Emboar fits well on balance teams, where it can act as a physical attacker and revenge killer, taking the pressure off of potential defensive teammates like Florges and Duraludon in the face of threats like Delphox, Heracross, and Salazzle. In order to get the most out of Emboar, it should be paired with pivoting support, bringing it in without it taking unnecessary chip damage against offensive threats like Tatsugiri and Delphox. Good examples of partners that can provide this are Kilowattrel, Gligar, and Bellibolt. Florges appreciates Emboar's ability to threaten Steel-types like Bronzong and Alolan Sandslash. In return, it can either pass Wish, which is incredibly helpful due to Emboar's tendency to be worn down quickly, or clean up games with Calm Mind after Emboar has broken a hole in the opposing team. Healing Wish support from the likes of Mesprit is useful to not only give Emboar a second wind after it's chipped down by recoil and attacks but also clear potential status like paralysis to allow it to clean. Other physical attackers like Decidueye and Golurk can beat Milotic and Galarian Slowbro, respectively, additionally working with Emboar to take chunks out of Bellibolt. Entry hazard removal is important because Emboar already has enough issues being worn down by its own attacks; spinners like Alolan Sandslash and Hitmontop and Defoggers like Altaria and Scyther can fill this role. Kilowattrel is a good naturally fast speed control option to help round out Emboar's team and prevents over-reliance on Emboar to force out opposing threats. Choice Scarf Emboar should be used over its Heavy-Duty Boots and Choice Band variants on slower teams that rely on Emboar to outspeed and force out threats for them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 569291, "username": "zinnias"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Whimsicott": {"sets": {"Choice Specs": {"description": "<p>Shadow Ball threatens Delphox and Bronzong and hits Alolan Sandslash slightly harder than Moonblast. Pranskter should only be used alongside Switcheroo, since this makes the move better at disrupting teams.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Scrafty": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Scrafty is one of the PU tier's most potent sweepers, finding ample setup opportunities thanks to its high bulk coupled with Shed Skin's chance to remove status conditions. Its defensive typing is also excellent, allowing it to shrug off attacks from foes such as Galarian Slowbro, Zoroark, and Bronzong. This is pushed even further thanks to Terastillization, allowing Scrafty to force opponents into guessing games over what moves will be effective. Dragon Dance boosts Scrafty's power while shoring up its rather poor Speed, alleviating the risk of being revenge killed by slow wallbreakers such as Rotom-H and Golurk. Drain Punch is used over Close Combat due to its ability to considerably extend Scrafty's longevity while maintaining reasonable power after a boost. Poison Jab allows Scrafty to threaten Florges with meaningful damage, while Ice Punch allows it to flip the script against Altaria and Gligar. Rest is an option in the last slot to give Scrafty a more direct means of recovery, but it generally does not want to drop its coverage option, and if Shed Skin does not activate, Scrafty becomes prone to being easily removed. The given EV spread allows Scrafty to outspeed Adamant Golurk while also avoiding the OHKO from Decidueye's +2 Leaf Blade after Stealth Rock. A spread of 252 Atk / 4 Def / 252 Speed with a Jolly nature can also be used to make Scrafty more immediately threatening at the cost of longevity and allows it to be less wary of opposing revenge killers without the need for multiple boosts. Tera Poison boosts the power of Poison Jab and flips Scrafty's otherwise poor matchup into Fairy-types such as Florges and Grimmsnarl, though one must be wary of Psychic Noise on the former, and other Fighting-types like Paldean Tauros-W alongside giving it an immunity to Toxic. However, the newfound weaknesses to Psychic and Ground make Scrafty much more vulnerable to foes it can otherwise defeat handily such as Delphox, Bruxish, and Galarian Slowbro. Therefore, it should only be used in situations where it would guarantee Scrafty a setup opportunity or to prevent an attempt at revenge killing it after it has accumulated several boosts already.</p> <p>Scrafty functions as a potent win condition on nearly any team, utilizing the additional speed from Dragon Dance to limit offensive counterplay more effectively than Bulk Up variants. However, despite its snowballing potential, it does have a good few matchups it struggles with. Notably, Milotic and Altaria can shrug off Scrafty's attacks and dispel its boosts with Haze. In a similar vein, Mudsdale can keep up with Scrafty's onslaught thanks to the Defense boosts from Stamina, dissuade setup attempts by dealing respectable damage with Body Press, phaze it out with Roar, and punish Tera Poison with Earthquake. Therefore, Pokemon like Decidueye and Kilowattrel make excellent partners, weakening or outright removing these foes before Scrafty attempts to close out the game. In return, Scrafty offers a 4x resistance to Knock Off and can utilize its bulk in an emergency to shrug off weaker neutral hits that would cripple these frailer teammates. Scrafty also struggles considerably with Fairy-types due to needing to utilize Tera to have any sort of defensive matchup against them. Therefore, checks to these Pokemon such as Salazzle and Copperajah are greatly appreciated. Entry hazard support from Gligar, Coalossal, and Alolan Sandslash is also extremely helpful and pairs especially well with Knock Off's ability to remove Heavy-Duty Boots from opposing Pokemon. Faster revenge killers are also problematic, as even after a Dragon Dance, Scrafty is still somewhat slow, so partners that can stifle these foes defensively such as Bellibolt and Coalossal and priority users like Decidueye that can pick them off are extremely valuable.</p>"
      },
      "Bulk Up": {
        "description": "<p>Scrafty utilizes Bulk Up in conjunction with Rest, Shed Skin, and good natural bulk to become a strong setup sweeper that also provides valuable defensive utility as a special wall. Drain Punch and Knock Off are solid STAB moves that give it longevity, utility, and the ability to weaken Pokemon that like their items such as Gligar and Arcanine, all while forcing out special attackers like Galarian Slowbro and Delphox. Poison Jab is a fringe option that sees use mainly to hit Florges as it switches in, making it a shakier check; however, dropping one of Knock Off or Drain Punch can cause problems for Scrafty's ability to hit Ghost-types and its longevity, respectively, while dropping Rest means Scrafty lacks immediate recovery. Rest also synergizes well with Shed Skin, buffing Rest's recovery while giving it setup opportunites on status users like Bellibolt and Altaria, which is preferable to Intimidate. Tera Poison is mainly used for flipping Scrafty's otherwise horrible 4x Fairy weakness into a resistance, letting it set up on foes like Scream Tail and Grimmsnarl, as well as giving it a useful Fighting resistance for foes like Virizion and Flamigo. This is mainly a defensive Terastallization, though, and Scrafty is unable to properly threaten these Pokemon without outside support or some chip damage accrued beforehand.</p> <p>Being a specially defensive Pokemon, Scrafty appreciates physically defensive bulwarks like Bellibolt and Galarian Slowbro that can also take on Flying- and Fighting-types like Staraptor, Flamigo, and Paldean Tauros-W for it. In return, Scrafty helps check strong special attackers like Delphox and Zoroark. Offensive partners like Staraptor and Decidueye can wear down shared checks like Mudsdale and Bombirdier for Scrafty, and in return, they appreciate Scrafty removing items from these checks. Florges also deserves a special mention, as every set can OHKO Scrafty before it Terastallizes, and Psychic Noise sets can hit Scrafty even after Terastallization, so checks like Galarian Slowbro and Alolan Sandslash to help deal with it are heavily appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 414072, "username": "Hera"}, {"user_id": 617840, "username": "gulch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Zoroark": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Zoroark is a powerful wallbreaker that, unlike others, can surprise opponents thanks to Illusion and net KOs, paving the way for partners like Galarian Slowbro and Paldean Tauros-F. Sludge Bomb hits incoming Fairy-types that plan on taking a Dark Pulse like Scream Tail and Grimmsnarl. Trick allows Zoroark to maintain utility, as it can then cripple bulkier Pokemon like Wo-Chien and Florges and bulky setup sweepers like Scrafty and Arcanine. Focus Blast punishes Dark-types that try to take on Zoroark's Dark Pulse like Skuntank and Bombirdier. U-turn can also be run to give extra utility to Zoroark, allowing it to gain momentum. Tera Dark is preferred to boost Zoroark's wallbreaking capabilities to insane levels, allowing it to 2HKO Gastrodon after a layer of Spikes and non-Assault Vest Goodra, but Tera Poison gifts Zoroark a boost to its Sludge Bomb and a resistance to Fighting-type attacks, letting it survive a hit from Heracross and Paldean Tauros-F. However, Tera Fighting can also be used to boost Focus Blast's damage output, preventing Pokemon like Skuntank and Wo-Chien from taking on Zoroark as well as they could otherwise. Though, with the latter two Tera types, Zoroark's Psychic-type immunity turns into a weakness, worsening its matchup against Delphox, Meloetta, and Galarian Articuno.</p> <p>Zoroark's access to Illusion allows it to pair well with Paldean Tauros-W and Calm Mind Florges, as it can disguise as them to lure in and beats Pokemon such as Decidueye, Bronzong, and Assault Vest Galarian Slowbro, which tend to switch in to check them. Some of Zoroark's checks, namely Milotic and Assault Vest Hariyama, are open to getting chipped away at by entry hazards, so Spikes setters like Gastrodon, Alolan Sandslash, and Heracross pair well alongside it. When paired with physical wallbreakers like Emboar and Hariyama, Zoroark can have its specially defensive checks like Scrafty and Gastrodon overpowered while together they can chip away at shared checks like Milotic and Scream Tail. Fairy- and Fighting-types like Grimmsnarl and Flamigo force Zoroark out, so checks to these Pokemon like Salazzle and Bellibolt make for strong teammates. In return, Zoroark can chip away at bulky Water- and Ground-types they struggle against, such as Qwilfish and Gligar. While Zoroark can play mind games with Illusion, how healthy a Pokemon is can easily give away who's out on the battlefield, so it must be paired with teammates that have access to entry hazard removal like Altaria, Alolan Sandslash, and Tatsugiri.</p>"
      },
      "Choice Scarf": {},
      "Nasty Plot": {
        "description": "<p>Zoroark's high Speed and Special Attack alongside decent coverage allow it to serve as a threatening Nasty Plot sweeper. However, what allows Zoroark to excel in this field is its unpredictability, with its wide variety of sets and unique ability in Illusion giving it a definite niche over other Nasty Plot users such as Delphox and Salazzle. Sludge Bomb provides coverage for Fairy-types such as Florges and Grimmsnarl, as well as hitting other Dark-resistant foes such as Emboar, Hariyama, and Bombirdier neutrally. Flamethrower hits any remaining threats, OHKOing Skuntank and Heracross at after a Nasty Plot. Focus Blast is another option that hits many of the same neutral targets harder and, after using Nasty Plot, OHKOes some of Zoroark's largest roadblocks, such as Snorlax, Assault Vest Copperajah, Bulk Up Scrafty, and specially defensive Wo-Chien. However, this extra power is often not needed once boosted, and Focus Blast missing can put an end Zoroark's sweep instantly. While vast, Zoroark's special movepool falls short in power, so the extra boost from Life Orb is greatly appreciated and needed for many of the previously mentioned KOes. Heavy-Duty Boots can help Zoroark set up more safely and further help it bluff the opponent via Illusion, but losing out on the power boost from Life Orb is suboptimal. Tera Dark further helps with the lacking power, giving Dark Pulse its much-needed boost to KO bulky threats such as Milotic, Goodra, and Gastrodon with little previous damage. Tera Poison boosts Sludge Bomb to further its reliability against neutral targets and grants resistances to all of Dark's weaknesses, allowing Zoroark to tank a hit from threats like Florges, Flamigo, and Pawmot. Tera Ghost supplies similar resistances while giving up any offensive prowess for the useful immunity to priority moves like Arcanine's Extreme Speed and Pawmot's Mach Punch, and it can punish Choice-locked Pokemon like Emboar and Paldean Tauros-F. However, this also leaves Zoroark weak to previously resisted priority moves like Decidueye's Shadow Sneak and Skuntank's Sucker Punch. The defensive utility and surprise factor of Tera Poison and Ghost can also give Zoroark a chance to start setting up.</p> <p>Nasty Plot Zoroark is ideally run on offensive teams seeking a late-game special sweeper rather than the utility ran on Zoroark's other sets such as item control, pivoting, and speed control. As such, it should have teammates that can take out common revenge killers like Ambipom, Choice Scarf Staraptor, and Choice Scarf Paldean Tauros-F. Bellibolt and Mudsdale make for good defensive checks to these revenge killers, with the former notably being able to paralyze these faster threats with Static and safely bring Zoroark in with its slow Volt Switch. Knock Off users like Copperajah and Gligar can also be helpful with this due to being able to remove a foe's Choice Scarf. Smeargle or Vikavolt's Sticky Web is a niche option to slow down foes but is rarely run outside of teams centered around it. Fighting-types like Pawmot, Flamigo, and Hariyama pair well with Zoroark, simultaneously luring Psychic-type moves that it can take advantage of while benefitting from the opponent's hesitance to use them. Furthermore, they are able to check special walls like Scrafty and Snorlax for Zoroark. Psychic- and Ghost-types like Delphox, Hoopa, and Golurk can accomplish similar feats alongside Zoroark while keeping Fighting-types in line. The former two pair especially well with Zoroark due to also being able to run sets with both Choice items and boosting moves, leading to more mind games with the opponent. Wallbreakers like Goodra and Choice Specs Toxtricity can wear down special walls like Wo-Chien and Gastrodon to put them in KO range for a boosted Zoroark. Florges is an especially notable threat to Zoroark due to its bulk and Fairy typing, so checks to it such as Copperajah, Galarian Slowbro, and Arcanine are much appreciated.</p>"
      },
      "Swords Dance": {
        "description": "<p>Zoroark stands out as a very strong Swords Dance user, leveraging the lack of defensive Dark-resistant Pokemon; the various Dark-weak staples like Galarian Slowbro, Delphox, and Golurk; and Illusion allowing it to disguise itself as other Swords Dance users to give it setup opportunities and tear holes in the opposing team. Knock Off and Sucker Punch are great STAB options that give Zoroark a devastating mix of wallbreaking power and priority, with Sucker Punch allowing it to pick off weakened Choice Scarf users like Staraptor and Rotom-C. Aerial Ace allows Zoroark to hit Fighting-types like Heracross and Emboar that would survive a +2 Knock Off as well as weakening all Paldean Tauros formes, while Low Kick removes Coalossal, Regirock, and Duraladon consistently; both of these options let it remove or severely weaken Scrafty and Wo-Chien. A Life Orb in conjunction with Tera Dark gives Zoroark outstanding power at +2; it gains great odds to OHKO physically defensive bulwarks like Bellibolt and Mudsdale after a single layer of Spikes, as well as always OHKOing Milotic, Altaria, and specially defensive Alolan Sandslash. Heavy-Duty Boots forgoes the power on Life Orb in favor of more bluffing potential and less chip damage, getting more setup opportunities as a result. Black Glasses can be used to hit similar damage benchmarks compared to Life Orb without taking recoil; however, it misses out on the guaranteed OHKOs stated above and has worse odds to OHKO Bellibolt and Mudsdale under the same circumstances.</p> <p>Swords Dance Zoroark is an effective wallbreaker but struggles with faster Pokemon that resist Sucker Punch and slower priority users that resist Sucker Punch, like Skuntank, Paldean Tauros-W, and Choice Scarf users like Flamigo, so checks to these Pokemon are highly recommended. Bellibolt and Houndstone are solid switch-ins on bulkier playstyles, while Paldean Tauros-F and Decidueye can use Skuntank and Paldean Tauros-W, respectively, as setup fodder or can easily revenge kill them with priority after Zoroark has weakened them. Zoroark heavily appreciates partners that it can disguise itself as effectively; some notable ones include Bruxish, Scyther, and Delphox, since Zoroark disguised as them can take advantage of their switch-ins like Milotic and Meloetta. Bruxish and Scyther's access to Swords Dance as well as Scyther's and Delphox's Speed tiers make it hard to tell if it's Zoroark or not.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 414072, "username": "Hera"}, {"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}, {"user_id": 400292, "username": "asa"}, {"user_id": 414072, "username": "Hera"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 400292, "username": "asa"}]}]}
  },
  "Golurk": {
    "sets": {
      "Choice Band": {
        "description": "<p>Golurk is a potent wallbreaker with limited switch-ins thanks to its incredible STAB combination, which is resisted by only a few Pokemon in the tier. Golurk excels at dismantling common defensive cores thanks to its high Attack and great typing, which let it switch into and force out defensive staples like Galarian Slowbro and Bellibolt. Dynamic Punch lets Golurk 2HKO Wo-Chien while also hitting other Dark- and Normal-types like Scrafty and Snorlax and threatening confusion against everything else. Close Combat can be used as an alternative due to its higher Base Power, which lets it guarantee a 2HKO on Wo-Chien after Leech Seed recovery; however, Golurk misses out on the confusion, and the Defense and Special Defense drops make it more susceptible to being revenge killed. Ice Punch lets Golurk OHKO Bombirdier and Staraptor while also serving as a good middle ground into Gligar. Stone Edge can be used as an alternative that's stronger versus neutral targets and has a higher chance to land a critical hit; although, Golurk loses out on the ability to deal with Gligar. Tera Dark flips Golurk's Ghost and Dark weaknesses while also removing its Water and Ice weaknesses, allowing it to avoid revenge kill attempts from Pokemon like Skuntank, Bombirdier, and opposing Golurk. Tera Ghost can be used instead to further boost Golurk's power, letting it 2HKO Pokemon like Gligar and guaranteeing OHKOs against Pokemon like Rotom-H with Poltergeist while still removing its susceptibility to Water- and Ice-type moves to avoid revenge killing attempts from Pokemon like Paldean Tauros-W.</p> <p>Golurk works best alongside Pokemon that benefit from its wallbreaking abilities such as Choice Scarf Staraptor and Curse Arcanine, which struggle with Bellibolt and Gastrodon, respectively. While Golurk has the coverage to hit the likes of Staraptor, Bombirdier, and Wo-Chien, their presence on the opposing team hurts its ability to freely use its STAB moves and forces it to make more predictions, so teammates that can handle these Pokemon like Bellibolt, which checks Staraptor and Bombirdier, and Paldean Tauros-F, which helps against Wo-Chien, make excellent partners. Furthermore, Paldean Tauros-F offensively and defensively checks the Dark-types that threaten Golurk, and other Fighting-types like Paldean Tauros-W and Flamigo are similarly good partners for this purpose. Golurk is also forced out by Water- and Grass-types, so teammates that can switch into these Pokemon, like Milotic and Gastrodon for Paldean Tauros-W and Tatsugiri as well as Skuntank for Decidueye, are incredible partners for Golurk.</p>"
      },
      "Stealth Rock": {"description": "<p>84 Speed EVs let Golurk outrun -1 Arcanine and uninvested Alolan Sandslash. The bulk investment helps Golurk tank two consecutive Overheats from Rotom-H and Moonblasts from defensive Florges.</p> <p>Sample set. Stay tuned for updates!</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 626934, "username": "Morge"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 414072, "username": "Hera"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Braviary-Hisui": {"sets": {"Agility": {}}},
  "Virizion": {"sets": {"Swords Dance": {"description": "<p>Stone Edge can be used instead of Zen Headbutt to nail Flying-types like Altaria and Scyther; it also hits foes like Decidueye harder. However, without Zen Headbutt, Virizion is helpless against defensive Poison-types like Galarian Slowbro and Venusaur and Tera Poison users like Wo-Chien.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Meloetta": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Due to its high Special Attack stat and decent Speed, alongside its range of coverage options and useful defensive typing, Choice Specs Meloetta is one of the tier's most potent wallbreakers. Hyper Voice is preferred, as it is stronger, but Tera Blast allows Meloetta to use Terastallization to flip matchups versus targets that typically comfortably switch into its Normal STAB move such as Copperajah with Tera Fighting while still being a functional Normal-type STAB move before Terastallizing. Psyshock is preferred, as it allows Meloetta to put pressure on Calm Mind users such as Florges and 3HKO Assault Vest Copperajah, which otherwise walls non-Focus Blast Meloetta. On the other hand, Psychic allows Meloetta to deal more damage to physically defensive targets such as Gligar and Bellibolt. Shadow Ball hits Galarian Slowbro and Bronzong while OHKOing Decidueye after Stealth Rock and also takes advantage of Serene Grace to put more pressure on foes with Special Defense drops. Alluring Voice OHKOes Scrafty and Bombirdier while also 2HKOing Wo-Chien; alternatively, Focus Blast also hits Scrafty and Wo-Chien, while OHKOing Alolan Sandslash and puts huge dents in checks like Copperajah, Naclstack, and Coalossal at the cost of inconsistency, though if Meloetta opts for Focus Blast, Hyper Voice should be used as its Normal-type STAB move. Tera Ghost lets Meloetta 2HKO Alolan Sandslash and OHKO Houndstone with Shadow Ball while preventing it from being revenge killed by Arcanine's Extreme Speed and allowing it to spinblock versus checks like Coalossal and the aforementioned Alolan Sandslash, though making it susceptible to Decidueye's Shadow Sneak. Tera Normal boosts the power of Hyper Voice, 2HKOing Florges and Assault Vest Galarian Slowbro while also making Meloetta less susceptible to being revenge killed by Sucker Punch from Skuntank and Bombirdier. Tera Fighting also helps versus Sucker Punch users and lets Meloetta function as an emergency check to +1 Scrafty and should be used in conjunction with Tera Blast to allow Meloetta to take on checks such as Copperajah and Alolan Sandslash, though it could also be used with Focus Blast to outright OHKO checks such as Coalossal and Assault Vest Copperajah; however, this is usually less useful than Tera Ghost or Normal on Focus Blast variants.</p> <p>Meloetta's potent wallbreaking capabilities make it a strong pick on bulky offense teams. Bellibolt is a good partner, as it can take on Skuntank and Bombirdier for Meloetta while being able to pivot to generate opportunities for Meloetta; in return, Meloetta's natural special bulk allows it to take on threats such as Toxtricity and Hoopa. Other pivots such as Scyther and Flamigo are also appreciated, as they force in targets such as Bellibolt, Galarian Slowbro, and Houndstone, which Meloetta can exploit while also matching up well into offensive threats to Meloetta such as Scrafty and Paldean Tauros-W and some defensive answers such as Wo-Chien. Meloetta's natural bulk facilitates wallbreaking opportunities; to utilize this effectively, entry hazards should ideally be off its side of the field, so teammates such as Alolan Sandslash and Coalossal are appreciated. Arcanine is a good partner, as it appreciates Meloetta's ability to weaken shared checks such as Coalossal to facilitate it sweeping late-game; in return, Arcanine can take on physical threats such as Scrafty and Decidueye, which could otherwise use Meloetta as setup fodder, depending on which move it is locked into. Choice Scarf Staraptor is a partner that appreciates Meloetta overwhelming foes such as Bronzong, Copperajah, and Coalossal, allowing Staraptor to use Brave Bird or Double-Edge more freely; in return, Staraptor revenge kills faster threats to Meloetta such as Paldean Tauros-W and Choice Scarf Flamigo.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 477404, "username": "sufys"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Delphox": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Delphox casts a spell on PU as an effective sweeper and wallbreaker, having a plethora of good matchups thanks to its high power and relatively high Speed tier. At +2, Fire Blast is able to 2HKO Assault Vest Galarian Slowbro, OHKO Bronzong, and even OHKO Bellibolt after Stealth Rock. While Flamethrower can be more consistent in terms of accuracy, its lower damage output will often lead to Delphox missing important benchmarks. Psyshock gives Delphox a way to reliably damage frailer foes that resist Fire Blast such as Salazzle as well as an option to muscle through special walls such as Florges. It also provides a reliable option to damage Pokemon that may not be hit super effectively by Delphox's other coverage moves, such as Tatsugiri and Coalossal, as well as a way to secure KOs in cases where Fire Blast missing would result in a sticky situation. Delphox's last moveslot is adjustable; Encore allows Delphox to lock foes into undesirable moves like Gastrodon's Stealth Rock and Scrafty's Bulk Up and generate setup opportunities. Grass Knot is a reliable coverage option against bulky Ground-types that may not crumble to a Fire Blast such as Gastrodon, Mudsdale, and Golurk, while Dazzling Gleam deals consistent damage to Bulk Up Paldean Tauros-W and lets Delphox beat Scrafty without prior chip damage. Tera Fairy provides Delphox with a resistance to Dark and prevents it from being revenge killed by Sucker Punch users such as Skuntank and Bombirdier while also removing other problematic weaknesses to Water, Ground, and Ghost and boosting the power of Dazzling Gleam.</p> <p>Delphox is rather frail, so it needs teammates that can pivot it in safely such as Milotic, Rotom-C, and Gligar. Spikes setters such as Alolan Sandslash and Coalossal can help Delphox to secure damage benchmarks more easily, lessening the number of opportunities Fire Blast has to miss and helping to break through Scream Tail and Arcanine. Sticky Web support from Vikavolt is also valued, allowing Delphox to remedy its sometimes awkward Speed tier. Pokemon that can discourage or absorb Knock Off, like Virizion and Scrafty, also make good partners, as Delphox largely relies on Heavy-Duty Boots to find opportunities to switch in. Checks to Decidueye, such as Ambipom and Bombirdier, are also highly valued, as Delphox is 2HKOed by a Spell Tag-boosted Shadow Sneak. Decidueye itself, alongside Pokemon like Paldean Tauros-W and Scrafty, are also valuable for their ability to take on a myriad of other foes that can threaten Delphox offensively, such as Golurk and Zoroark. Faster revenge killers like Kilowattrel and Salazzle are also threatening, so Pokemon with priority moves like Sucker Punch Zoroark, Aqua Jet Paldean Tauros-W, and Shadow Sneak Decidueye make excellent partners. Choice Scarf users such as Duraludon, Staraptor, and Flamigo can also fulfill this role. In return, Delphox can blow holes in the opposing team, allowing these Pokemon to clean up once their checks have been weakened.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "gulch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Florges": {
    "sets": {
      "Wish": {},
      "Calm Mind": {
        "description": "<p>Florges finds itself used over other Calm Mind sweepers like Scream Tail and is one of PU's best bulky setup sweepers thanks to its great defensive typing, wide range of utility options, reliable recovery, and immunity to Dragon Tail. Florges has a wide variety of options for its third moveslot; Psychic Noise is coverage for Poison-types like Salazzle when Florges would want to avoid Terastallizing, and it also prevents Specially Defensive walls like Gastrodon and Wish Scream Tail from attempting to stall out Florges with their recovery. Tera Blast should be paired with Tera Ground, which allows Florges to break through Poison- and Fire-types like Galarian Slowbro, Coalossal, and Arcanine. Finally, Wish allows Florges to provide support for its team and gives it extra PP for recovery to pair with Synthesis; it is primarily used as a wall rather than a primary win condition, although it comes at the cost of not having coverage. The given EV spread allows Florges to obtain as much physical bulk as possible while also outspeeding Adamant Golurk as well as opposing walls such as Wo-Chien and Milotic. When not running Tera Blast, Tera Poison is ideal for a strong defensive typing, allowing Florges to set up against Pokemon like Galarian Slowbro and Bellibolt. Tera Ground should be paired with Tera Blast, and although it provides a worse defensive typing, it allows Florges to set up against Pokemon like Salazzle as well as Pokemon like Kilowattrel and Delphox.</p> <p>Florges is most commonly used on bulky balance teams looking for a secondary wincon that, when teamed with a primary wincon like Arcanine and Decidueye, can also function as a special wall or a Wish passer if need be. Even with investment, Florges's physical bulk is not good enough to set up against physical attackers like Paldean Tauros-F and Scyther, so physical walls like Bellibolt, Mudsdale, and Altaria make excellent partners. Likewise, in order for Florges to attempt a sweep without Tera Blast Ground, Fire- and Steel-types like Arcanine, Delphox, and Alolan Sandslash must be chipped or KOed, which can be achieved by Pokemon like Golurk, Bruxish, and Rotom-H. In return, Florges can soft check and threaten out their offensive checks like Zoroark and Goodra. Florges's ability to soft check and threaten Dark- and Fighting-types like Grimmsnarl, Zoroark, Scrafty, and Hariyama makes the likes of Galarian Slowbro, Galarian Articuno, and one's own Scrafty amazing partners. In return, these three can defensively or offensively check some of Florges's own checks like an opposing Galarian Slowbro and Bronzong. If Florges opts for Wish, the ability to pass Wish is extremely beneficial to offensive partners like Staraptor and Decidueye, which chip away at opposing walls like Milotic and Gastrodon that can phaze out Florges, allowing Florges to sweep; Wish is also beneficial for partner walls lacking reliable recovery like Mudsdale, Houndstone, and Gligar.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Goodra": {
    "sets": {
      "Heavy-Duty Boots": {
        "description": "<p>Goodra finds a home in PU as a bulky attacker with exceptional offensive coverage, utility, and natural bulk. Flamethrower hits Steel-type walls like Bronzong and Copperajah for super effective damage, limiting the amount of times they can come in and try to absorb Draco Meteors. Sludge Bomb hits Florges, Grimmsnarl, and Scream Tail hard while also providing opportunities to fish for poisons against bulky Pokemon that don't immediately threaten Goodra like Coalossal, Gastrodon, Milotic, and Wo-Chien. Knock Off is a great utility move for Goodra, as it can remove Eviolite from Gligar and Heavy-Duty Boots from specially defensive walls like Coalossal and opposing Goodra, allowing entry hazards to hinder their ability to switch in later in the game. Toxic can more reliably hinder defensive walls like Bellibolt and Gastrodon than Sludge Bomb at the cost of not providing immediate damage. Acid Spray can be used to limit the ability of specially defensive walls like Coalossal and Gastrodon from absorbing attacks and stacking hazards. Both Toxic and Acid Spray can dissuade Pokemon like Hisuian Braviary and Rotom-H from setting up. Dragon Tail is an excellent utility move to phaze setup attempts, notably preventing Curse Arcanine, Scrafty, and Throat Spray Toxtricity from getting too comfortable, while accruing hazard chip damage. Scald is an optional move for Goodra that can hit Coalossal hard and fish for burns. Tera Poison gives Goodra a resistance to Fairy and Fighting, allowing it to more reliably match up into Florges, Scream Tail, and Paldean Tauros-W while also preventing Goodra from getting worn down by poison. Tera Poison does, however, limit Goodra as a switch-in to Ground-type attacks, notably making Gastrodon, Gligar, and Mudsdale much more difficult to switch into. Tera Fairy helps into opposing Goodra, Nasty Plot Tatsugiri, and Fighting-types like Hariyama and Paldean Tauros-W. Tera Dragon can be used to boost the damage output of Draco Meteor, allowing for notable OHKOs into Arcanine and Houndstone after Stealth Rock damage and 2HKOs into Bellibolt, Galarian Slowbro, and Gligar, though it doesn't provide defensive utility like Tera Poison and Fairy do.</p> <p>Heavy-Duty Boots Goodra fits best on balance and bulky offense structures that can maximize its ability to both defensively and offensively apply pressure throughout a game. Goodra appreciates support from physically defensive teammates, such as Bellibolt, Galarian Slowbro, and Houndstone, that can switch into the litany of wallbreakers in the tier that threaten it like Staraptor and Paldean Tauros-W. Goodra can form defensive cores with entry hazard setters like Coalossal, Gastrodon, and Gligar to create difficult-to-break pairings that force switches and accumulate gradual chip. Offensive teammates that try to set up and clean late-game, like Curse Arcanine and Bulk Up Scrafty, can benefit from Goodra switching into and wearing down faster special attackers like Toxtricity and Zoroark. VoltTurn cores with teammates such as Ambipom, Kilowattrel, and Staraptor can pivot Goodra into favorable matchups safely and keep offensive pressure on. Poison- and Steel-types that can handle Fairy-types like Calm Mind Florges and Scream Tail, like Salazzle, Bronzong, and Copperajah, are excellent teammates to keep Goodra from needing to Tera to deal with them reliably. Choice Scarf users like Flamigo, Staraptor, and Toxtricity especially appreciate the gradual wear-and-tear that Knock Off Goodra and hazards can put on defensive foes, making their late-game cleaning or mid-game breaking much easier.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Goodra functions as a competent wallbreaker in PU, utilizing its respectable Special Attack and excellent coverage to shred through foes. Sap Sipper is also extremely helpful, allowing Goodra to not fear Wo-Chien's Leech Seed, as well as letting it more easily come in against foes such as Rotom-C and Hisuian Electrode and retailiate with a devastating blow. Flamethrower gives Goodra the means to hit Steel-types like Alolan Sandslash and Levitate Bronzong for meaningful damage. Fire Blast is less reliable but does ensure the 2HKO on Bronzong after Leftovers recovery. However, Flamethrower is generally preferred, as it does not miss out on any important damage benchmarks, and Goodra's Fire-type coverage is most often used to punish Steel-types as they switch in. Sludge Bomb allows Goodra to catch Fairy-types expecting a Draco Meteor by surprise, such as Scream Tail and Florges. Goodra's last moveslot is customizable; Dragon Pulse offers a reliable alternative to Draco Meteor that exchanges power for perfect accuracy and the ability to secure 2HKOs against foes like Gastrodon and Bellibolt without worrying about being stalled out by Recover, while Scald offers a handy OHKO against Coalossal after Stealth Rock as well as the ability to bully physical wallbreakers like Paldean Tauros-W with the threat of a burn should they attempt to switch in on it. Tera Poison helps shore up Goodra's defensive matchup against Fairy-types like Grimmsnarl and Florges while boosting the power of Sludge Bomb, even giving Goodra a chance to OHKO Grimmsnarl after Stealth Rock. Tera Fairy also somewhat helps Goodra's defensive matchup against Fairy-types, helps it check foes like Paldean Tauros-W and Zoroark, and provides it with an immunity to opposing Goodra's STAB moves. Tera Dragon is also an option to boost the power of Draco Meteor to absurd levels, and it nets certain damage rolls such as OHKOing Bellibolt and having a chance to 2HKO Assault Vest Meloetta. It also bolsters Dragon Pulse's rather mediocre power but offers absolutely no additional defensive utility. A Modest nature can also be used for additional power, but this does notably make Goodra slower than Timid Hoopa and Adamant Heracross, Skuntank, and Bombirdier.</p> <p>Choice Specs Goodra is a powerful wallbreaker on balance teams, offering an intersection of power and unique defensive utility that can keep opponents guessing. Checks to Steel-types, such as Delphox and Paldean Tauros-F, are valued for their ability to make Goodra less prediction reliant, and Pokemon like Skuntank and Copperajah that can easily remove Fairy-types are immensely valuable due to making Draco Meteor much safer. Although it acts as a soft check to a large number of special attackers, Goodra can be worn down rather easily. For this reason, Florges and Scream Tail are also notable partners thanks to their ability to take some of the burden off of Goodra as a special wall while also compensating for its lack of recovery with Wish. Teammates like Gastrodon, Mudsdale, and Milotic greatly appreciate Goodra's immunity to Grass and can take the brunt of attacks that would otherwise wear it down quickly. While Goodra's special bulk is exceptional, the lack of Heavy-Duty Boots and recovery makes it difficult to get in safely, so pivots like Gligar, Rotom-H, and Scyther are greatly appreciated. In return, Goodra can whittle down checks to these Pokemon like Coalossal, Mudsdale, and Bellibolt with ease.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "gulch"}, {"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 355061, "username": "UberSkitty"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Avalugg-Hisui": {"sets": {"Entry Hazard Lead": {}}},
  "Hoopa": {"sets": {"Choice": {}, "Substitute": {}}},
  "Decidueye": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Thanks to a great STAB combination that only a few Pokemon resist, a great boosting move in Swords Dance, a useful ability in Long Reach, and a good defensive typing, Decidueye is one of PU's strongest physical wallbreakers and sweepers. While Spirit Shackle is generally preferred for its increased accuracy, Poltergeist can be opted instead for its higher power, allowing Decidueye to OHKO Bellibolt with Tera Ghost after a Swords Dance, although its anti-synergy with Knock Off can make it unappealing. Leaf Blade targets Pokemon such as Mudsdale and Milotic, but if these aren't issues, then Low Kick can allow Decidueye to not be walled by Coalossal while also dealing with Alolan Sandslash and Copperajah. Shadow Sneak is useful priority to pick off faster weakened threats like Salazzle and Delphox. Knock Off can be used to give Decidueye extra utility and punish common switch-ins like Staraptor and Wo-Chien, but it is very hard to justify using it over other moves, and it does not work well with Poltergeist. Spell Tag lets Decidueye OHKO Toxtricity with unboosted Poltergeist and Tatsugiri with +2 Shadow Sneak after Stealth Rock. Decidueye's choice of Tera type is flexible; Tera Ghost boosts the power of its Ghost-type STAB moves and gives Decidueye a better defensive typing, allowing it to spinblock Alolan Sandslash and set up on Pokemon like Delphox and Salazzle, while Tera Fairy allows Decidueye to take on Dark-type Pokemon like Zoroark and Scrafty.</p> <p>Decidueye excels on offensive or balance teams looking for a strong wallbreaker with sweeping and cleaning potential. Faster Normal-types like Staraptor, Meloetta, and Ambipom cannot be swept by Shadow Sneak and can threaten Decidueye in return, so checks to these Pokemon like Bellibolt and Gligar make good partners. Decidueye is also relatively frail, so slow pivots like Bellibolt, Gligar, and Milotic can help bring it in safely. Florges, Mudsdale, Paldean Tauros-W, and Skuntank can help switch into Decidueye's checks like opposing Skuntank, Bombirdier, Scrafty, and Galarian Articuno. Decidueye can struggle against offensive Fire-types like Arcanine and Paldean Tauros-F, so Pokemon like Mudsdale and Milotic make excellent partners. Decidueye's ability to beat common physical walls like Mudsdale, Galarian Slowbro, and Bellibolt make other physical sweepers like Arcanine, Ambipom, and Paldean Tauros-W valuable teammates. In turn, these three can take out Decidueye's offensive checks, like Staraptor and Zoroark, with priority to complement Decidueye's Shadow Sneak.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>Although suffering competition from other Ghost-type wallbreakers such as Golurk, Decidueye's great STAB combo, ability to pivot thanks to U-turn, great ability in Long Reach, and good Attack stat make it a great all-out attacker in PU. Spirit Shackle is generally preferred for its better accuracy and lack of conflict with Knock Off, although Poltergeist is an option if the extra power is preferred, allowing Decidueye to OHKO Assault Vest Galarian Slowbro with Spell Tag and Stealth Rock chip damage. Shadow Sneak is valuable priority, allowing Decidueye to pick off faster threats and setup sweepers such as Salazzle, Delphox, and Flamigo. U-turn allows Decidueye to operate as a pivot, allowing it to safely escape unfavorable matchups such as Bellibolt, Bombirdier, Coalossal, and Wo-Chien. Leaf Blade is a secondary STAB move that targets Ground-types such as Gastrodon and Mudsdale, but if these aren't an issue, Low Kick allows Decidueye to hit Steel-types such as Copperajah and Alolan Sandslash as well as Coalossal. On Heavy-Duty Boots variants, Sucker Punch is a viable option to target Pokemon like Hoopa while still doing good damage to Pokemon like Golurk and opposing Decidueye; however, Leaf Blade and Low Kick normally provide more value. Spell Tag boosts Decidueye's Ghost-type STAB moves, although if this is not needed, Heavy-Duty Boots is an alternative to not take entry hazard damage, which is especially useful with U-turn. Just like Spell Tag, Tera Ghost boosts Decidueye's Ghost-type STAB moves, allowing it to achieve rolls such as 2HKOing Florges with Spirit Shackle, potentially OHKOing Delphox with Spell Tag-boosted Shadow Sneak, and 2HKOing Bellibolt with Spell Tag-boosted Poltergeist. Alternatively, Tera Fairy is a purely defensive Tera type that allows Decidueye to live Dark-type attacks like Sucker Punch and Knock Off from Pokemon like Skuntank, Scrafty, and Emboar and threaten them back.</p> <p>Decidueye finds itself on offensive and bulky offensive teams that appreciate its unique ability to function as a wallbreaker, spinblocker, and pivot all in one. Even with Low Kick and U-turn, Decidueye can struggle against Dark-types such as Skuntank, Bombirdier, and Wo-Chien that it can't reliably beat, so Pokemon that can check these threats such as Mudsdale, Florges, and Flamigo all make excellent partners. Other pivots such as Bellibolt, Milotic, and Gligar make a great pivot core with Decidueye and can be fallbacks for it against Pokemon such as Coalossal, Bombirdier, and Scyther. If Decidueye opts to not run Heavy-Duty Boots, entry hazard control from Pokemon like Altaria, Coalossal, and Alolan Sandslash allows Decidueye to be a better pivot and wallbreaker. In turn, Decidueye beats their checks such as Gastrodon and Bronzong. Decidueye's ability to pressure common defensive cores such as Galarian Slowbro and Wo-Chien as well as Gastrodon and Bellibolt allows teammates like Arcanine and Toxtricity to set up and sweep. Decidueye's Ghost typing allows it to be a failsafe against Pokemon like Arcanine and Quick Attack Scyther, making it a decent teammate for the likes of Wo-Chien and Paldean Tauros-F. Likewise, if it's running Spirit Shackle, Decidueye can trap and revenge kill Pokemon like Scyther and Florges, enabling teammates like Zoroark and Goodra.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 414072, "username": "Hera"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "LUSTRE"}, {"user_id": 649096, "username": "a blue banana"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Decidueye-Hisui": {"sets": {"Choice Band": {}}},
  "Vikavolt": {"sets": {"Sticky Web Setter": {}}},
  "Lycanroc": {"sets": {"Entry Hazard Lead": {}}},
  "Mudsdale": {
    "sets": {
      "Physical Wall": {
        "description": "<p>With a great ability in Stamina and access to helpful utility moves such as Stealth Rock and Roar, Mudsdale cements itself as a helpful wall in PU that keeps physically offensive Pokemon like Paldean Tauros-F, Flamigo, Zoroark, Emboar, and Arcanine in check. Body Press lets Mudsdale put Stamina to good use, allowing it to get good damage off on Zoroark, Scrafty, and Tera Normal Arcanine. Heavy Slam, on the other hand, hits Flying-types neutrally while also letting Mudsdale hit Fairy-types that could otherwise easily set up in front of it like Scream Tail, Florges, and Grimmsnarl. However, Stone Edge hits Flying-types like Staraptor and Bombirdier super effectively while also threatening Rotom-H. Roar deters setup sweepers like Bulk Up Scrafty, Hariyama, and Calm Mind Galarian Slowbro before they get out of hand. Leftovers improves Mudsdale's longevity, while Rocky Helmet punishes physical attackers like Staraptor and Scyther. Tera Water allows Mudsdale to take on Water-type wallbreakers like Paldean Tauros-W and Tatsugiri in a pinch, but it can no longer check Pawmot and Bellibolt as easily as before. On the other hand, Tera Steel grants Mudsdale the ability to check Fairy-types like Florges and Scream Tail, boosts Heavy Slam's damage output, and helps its matchup versus Galarian Articuno, Goodra, and Decidueye. However, this leaves Mudsdale open to being preyed on by Ground-, Fire-, and Fighting-types like Golurk, Arcanine, and Heracross, which it checked beforehand.</p> <p>When paired with a specially defensive Pokemon like Bronzong, Assault Vest Galarian Slowbro, or Milotic, Mudsdale can form a strong defensive core that's quite difficult to break through. Mudsdale easily checks Fire- and Fighting-types like Arcanine, Emboar, and Flamigo, so Pokemon weak to those types like Rotom-C, Duraludon, and Scrafty can take advantage of its defensive capabilities. Mudsdale tends to falter against Water- and Grass-types like Tatsugiri, Decidueye, and Rotom-C, making partners that can take on these threats like Milotic, Wo-Chien, and Goodra strong defensive options. With Mudsdale's lack of reliable recovery, it greatly appreciates Wish support from Pokemon like Scream Tail and Florges to circumvent this issue. Entry hazards also highlight Mudsdale's lack of reliable recovery, so partners like Defog Altaria, Decidueye, and Rapid Spin Alolan Sandslash help work around this weakness.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 414072, "username": "Hera"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 262594, "username": "Milak"}]}]}
  },
  "Salazzle": {
    "sets": {
      "Utility": {
        "description": "<p>With Salazzle's deep utility movepool, it can act as great support Pokemon that lacks passivity thanks to its high Speed and its nearly unresisted STAB combination's damage output. Fire Blast is preferred for pure damage, but Flamethrower can be used instead for higher accuracy. Toxic + Corrosion allow Salazzle to break through bulkier Pokemon in the tier that other Pokemon simply can't like Galarian Slowbro, Qwilfish, and Gastrodon. Encore helps Salazzle take advantage of Pokemon that would otherwise wall it like Milotic, Gastrodon, and Mudsdale; however, Knock Off can be used instead to cripple item-reliant Pokemon like Assault Vest Galarian Slowbro, Gligar, and Duraludon. Tera Grass allows Salazzle to check Paldean Tauros-W and Golurk in a pinch. On the other hand, Tera Steel helps when facing Galarian Slowbro, Galarian Articuno, and Meloetta. Tera Ghost can also be used to ignore Fake Out and Extreme Speed from Ambipom and Arcanine, respectively, and in tandem with Encore, it can force them to continually do no damage to it, letting Salazzle attack freely.</p> <p>Salazzle easily handles Steel-types like Bronzong and Alolan Sandslash, so Pokemon that are checked by these walls work well alongside it like Florges, Galarian Articuno, and Grimmsnarl. If running Knock Off, Salazzle can help to chip away at opposing teams alongside entry hazard setters like Gligar, Gastrodon, and Alolan Sandslash. On top of this, Salazzle is also quite easily revenge killed by Choice Scarf users and naturally fast Pokemon like Staraptor, Flamigo, and Kilowattrel, so walls like Bellibolt and Gastrodon help it defensively.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Nasty Plot Salazzle is one of PU's most threatening setup sweepers and wallbreakers thanks to its great STAB combo, ability to outspeed naturally fast attackers such as Delphox, Zoroark, and Scyther, and wide variety of utility moves to benefit its sweep. Fire Blast is used over Flamethrower due to the higher Base Power allowing Salazzle to achieve rolls such as OHKOing Bellibolt after a Nasty Plot and Stealth Rock. Salazzle's final moveslot is very flexible; most commonly, it runs Encore to turn opposing setup sweepers like Decidueye and Paldean Tauros-F and walls such as Bronzong and Bellibolt into setup fodder and potentially deter them. Toxic cripples potential switch-ins like Gastrodon and Milotic as well as the aforementioned setup sweepers and walls. Finally, Substitute allows Salazzle to capitalize on the switches it forces on Pokemon like Wo-Chien and Alolan Sandslash, letting it either set up safely or fire off a strong attack. Like Encore, it also allows Salazzle to work around its mediocre bulk. Both Trailblaze to boost Salazzle's Speed and Tera Blast Grass to allow Salazzle to hit Gastrodon are options as well, but they are niche due to not providing as much value compared to other moves. Tera Dark allows Salazzle to gain a valuable defensive typing, allowing it to more easily set up on Psychic-types like Delphox and Galarian Slowbro. Alternatively, Tera Ghost also provides Salazzle setup opportunities—particularly against Choice-locked Fighting-types like Paldean Tauros-F and Emboar—and can allow it to be immune to priority from Arcanine and Scyther, although it comes at a cost of being weak to other priority such as Shadow Sneak from Decidueye and Sucker Punch from Bombirdier.</p> <p>Nasty Plot Salazzle finds itself on offense and hyper offense teams as well as on balance teams looking for a reliable wincon and attacker that can be valuable before setting up by spreading Toxic or enabling other setup sweepers with Encore. While strong, Salazzle can find itself struggling to break against offensive and defensive Water-types. like Qwilfish, Gastrodon, and Milotic, so checks to these threats like one's own Gastrodon, Kilowattrel, and Decidueye make good partners. In return, Salazzle can aid these Pokemon by chipping down their checks like Wo-Chien and Bronzong. Salazzle's relative frailty means that slow pivots like Bellibolt and Gligar that can sponge a hit for it and bring it onto the battlefield safely are also valued. Other offensive teammates that can struggle to reliably break through Water-types like Arcanine and Scream Tail can form a solid backbone with Salazzle, as they work together to take down their shared checks. Although fast, Salazzle itself can still be revenge killed by faster threats such as Kilowattrel and priority from Arcanine and Decidueye; thus, checks to these threats such as Gastrodon, Paldean Tauros-W, and Wo-Chien all make good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}, {"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355061, "username": "UberSkitty"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 527276, "username": "Techno"}]}]}
  },
  "Passimian": {"sets": {"Choice Scarf": {}}},
  "Palossand": {"sets": {"Physically Defensive": {"description": "<p>Scorching Sands generally shouldn't be used alongside Sludge Bomb. Doing so makes Palossand more prediction reliant to avoid inducing foes like Wo-Chien with the less useful status.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Minior": {"sets": {"Shell Smash": {"description": "<p>30 HP IVs allows Shields Down to activate after two Substitutes or Stealth Rock damage.</p>"}}},
  "Bruxish": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Bruxish is a great choice for a mid-game wallbreaker or late-game cleaner because of its dynamic STAB combination, access to priority, excellent Speed tier, and exceptional coverage that is largely boosted by Strong Jaw. Choice Scarf Bruxish notably outpaces other Choice Scarf users in the tier like Rotom-H, Rotom-C, Flamigo, and Meloetta. Flip Turn is a great momentum move, as Bruxish uses its fast pivoting abilities to allow slower teammates like Golurk to enter the field safely and wear down its checks like Bronzong, Galarian Slowbro, and Wo-Chien. Crunch hits Ghost- and Psychic-types like Bronzong, Decidueye, Galarian Slowbro, and Galarian Articuno for massive damage. Aqua Jet is a strong STAB priority option that allows Choice Scarf Bruxish to reliably revenge kill other Choice Scarf users like Staraptor and Paldean Tauros-F. Ice Fang is a strong coverage option to chunk Dragon- and Grass-types like Altaria, Goodra, and Rotom-C. Strong Jaw is an outstanding ability for Bruxish, as a lot of its attacks like Psychic Fangs, Ice Fang, and Crunch are benefitted by the large boost it provides. Dazzling is a secondary choice for ability on Bruxish and prevents priority against it, stopping Sucker Punch and Shadow Sneak from the likes of Skuntank and Decidueye, respectively, along with Extreme Speed from Curse Arcanine and Quick Attack from Scyther. While Dazzling is a solid ability and prevents Bruxish from being taken out with priority, it does miss potential rolls that Strong Jaw provides such as a 2HKO on Bronzong with Crunch, a 2HKO on Gastrodon with Psychic Fangs, and an OHKO on Altaria with Ice Fang. Tera Psychic boosts Psychic Fangs to nearly unwallable levels when combined with Strong Jaw, providing 2HKOs into Bellibolt, Galarian Slowbro, and Milotic after minimal chip. Tera Water can be run to bolster Wave Crash, Flip Turn, and Aqua Jet damage, notably giving Wave Crash the boost needed to 2HKO Goodra and OHKO Paldean Tauros-F after an Intimidate drop while also removing the weaknesses to Dark and Ghost, which is especially important on Strong Jaw sets.</p> <p>Choice Scarf Bruxish can fit on all sorts of teams, being found mainly on balance and offense as a form of Speed control and breaking power. With access to Flip Turn, VoltTurn cores with teammates like Kilowattrel, Rotom-H, and Scyther can be incredibly difficult for teams to manage throughout a game. Entry hazard stacking teams similarly use the threat of Flip Turn and strong breaking power to rack up hazard chip, appreciating support from Knock Off users like Bombirdier, Gligar, and Skuntank to remove Heavy-Duty Boots. Bombirdier is a notable teammate for Bruxish because of its access to Stealth Rock and U-turn, and it is usually easy to slot one of these on Bombirdier. Bombirdier also resists Dark- and Ghost-type attacks, so the duo has immense upside as a capable VoltTurn duo that has a lot of utility and coverage. Other teammates like Flamigo and Staraptor can help break through bulky checks to Bruxish, such as Duraludon and Wo-Chien, and can provide another mid-game breaker or late-game cleaner for teams that strive to keep offensive pressure up. To break through physical walls more efficiently, teams using Choice Scarf Bruxish can often slot a strong special attacker like Hoopa, Zoroark, or Toxtricity to support its endeavors to break teams down, with the latter two having access to pivot moves to further build off the VoltTurn structure. Bruxish's ability to threaten every Ground-type in the tier is also important for teammates like Arcanine and Salazzle, which become very threatening late-game when Ground-types are removed.</p>"
      },
      "Choice Band": {},
      "Swords Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Thwackey": {"outdated": true, "sets": {"Choice": {}}},
  "Coalossal": {"sets": {"Defensive": {}}},
  "Sandaconda": {"sets": {"Stealth Rock": {}}},
  "Toxtricity": {
    "sets": {
      "Shift Gear": {
        "description": "<p>Toxtricity offers the liberty to swap between the roles of a Shift Gear cleaner and Throat Spray + Boomburst wallbreaker with the same set. Very few walls can take its Punk Rock-boosted attacks after Throat Spray activates––Ghost / Ground-type Pokemon like Golurk and Palossand being the only exceptions––making the likes of Gastrodon, Coalossal, and Assault Vest Galarian Slowbro shoddy switch-ins at best. This threat creates setup opportunities for Toxtricity, which can then outspeed most of the metagame at +2 and clean late-game. Tera Blast Ghost is its best coverage move, nailing would-be checks like Decidueye, Golurk, Palossand, and Bronzong; importantly, the defensive benefits of Tera Ghost include more setup opportunities for Toxtricity and immunity to common priority attacks from Ambipom and Arcanine. Alternatively, Tera Normal offers a nuke of a Boomburst that outright OHKOes foes like Bellibolt and Mudsdale at +1. This comes at the cost of running the weaker Snarl to hit Ghost-types, and while Snarl offers good coverage without Terastallizing, it fails to reliably OHKO any of the metagame's Ghost-types and also makes Toxtricity completely walled by Soundproof Pokemon like Hisuian Electrode. A last alternative is Sludge Bomb, and in the same vein as Snarl, it can be a stronger option versus some walls like Wo-Chien without having to use Tera Normal Boomburst, but it fails to address some targets such as Golurk and Palossand.</p> <p>Sweepers such as Paldean Tauros-W and Decidueye alleviate some offensive tension that Toxtricity suffers from by targeting foes that could otherwise check it like Golurk, Goodra, and Gligar. Knock Off users like Skuntank and Scrafty help wear down walls like Mudsdale and Bellibolt so that they are KOed by a +1 Boomburst late-game. Specially offensive Knock Off users like Goodra and Salazzle also work for weakening special walls like Galarian Slowbro and Gastrodon; the former is in OHKO range from +1 Boomburst after Stealth Rock if it loses its Assault Vest. Toxtricity is often vulnerable to priority attackers after it takes damage when setting up, so teammates like Paldean Tauros-F and Staraptor are valid checks to the likes of Skuntank and Decidueye, respectively. This way, Toxtricity can be preserved and return the favor to these physically offensive teammates by putting pressure on physical walls like Mudsdale and Milotic.</p>"
      },
      "Choice Specs": {
        "description": "<p>The raw power of Choice Specs, Punk Rock-boosted Boomburst, and strong STAB moves, with the option to be even stronger with Terastallization, is hard to stomach. That power, along with the opportunity to pivot with Volt Switch on the few checks Toxtricity has like Decidueye, makes Toxtricity an effective wallbreaker and pivot. Ghost-types like Golurk and Palossand are not safe switch-ins to Toxtricity given that Snarl 2HKOes them, albeit locking into Snarl can be prediction reliant. Sludge Bomb offers chances to OHKO walls like Wo-Chien and Florges, although its damage is equal to Tera Normal Boomburst and its coverage fails to nail anything notable bar Soundproof Hisuian Electrode. Due to relying heavily on prediction and Terastallization, this set sees less use and is harder to fit on teams in comparison to Toxtricity's Shift Gear set.</p> <p>One of Toxtricity's shortcomings is its frailty, so it relies on pivots such as Scyther, Staraptor, and Ambipom to get in safely. These teammates make an offensive VoltTurn core with Toxtricity, which returns the favor by positioning them through Volt Switch on some of its potential switch-ins like Decidueye and Galarian Slowbro. Dark-types like Bombirdier and Skuntank are necessary to punish opposing Ghost-types once Toxtricity is locked into Boomburst. Similarly, teammates such as Decidueye and Kilowattrel are important to defeat Ground-types like Gligar and Gastrodon. Toxtricity's wallbreaking can pave the way for specially offensive teammates like Calm Mind Scream Tail and Choice Scarf Florges to clean late-game. Spikes support from Alolan Sandslash and Qwilfish is noteworthy in supporting Toxtricity's wallbreaking, as a single layer of Spikes creates favorable chances to OHKO walls like Gastrodon and Assault Vest Galarian Slowbro with +1 Tera Normal Boomburst.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Toxtricity-Low-Key": {"sets": {"Choice Specs": {"description": "<p>Toxtricity-Low-Key has no advantage over Base Toxtricity and also lacks Shift Gear, meaning it can't bluff its set and is incredibly predictable. As such, using Toxtricity-Low-Key isn't recommended.</p>"}}},
  "Grimmsnarl": {
    "sets": {
      "Bulky Pivot": {},
      "Bulk Up": {
        "description": "<p>Grimmsnarl is a threatening sweeper thanks to its ability to set up and use Substitute with priority because of Prankster. Thanks to its ability, Grimmsnarl can invest fully in its bulk, allowing it to take multiple hits before fainting. Grimmsnarl's STAB combination is also difficult to switch into, as it's unresisted by the entire tier. Sucker Punch helps Grimmsnarl pick off fast frail Pokemon like Kilowattrel and Salazzle. Substitute allows it to take advantage of walls like Milotic, Gastrodon, and Bellibolt, letting it ignore status and set up freely. On top of this, it also helps Grimmsnarl scout Choice-locked Pokemon like Florges and Duraludon. Tera Steel grants it a resistance to Fairy-type attacks, as well as gaining a multitude of other resistances, notably helping Grimmsnarl versus Toxtricity's Boomburst, Staraptor's Brave Bird, and Bronzong's Heavy Slam. Similarly, Tera Poison helps Grimmsnarl take on Fairy-type attacks from Florges, but it trades Tera Steel's wide array of resistances for a resistance to common Fighting-type attacks from faster Pokemon like Heracross and Flamigo. However, it now has to deal with super effective Psychic Noise from both Scream Tail and Florges.</p> <p>Due to having to rely on Sucker Punch to hit Steel-types like Alolan Sandslash, Grimmsnarl commonly struggles against them; because of this, Grimmsnarl appreciates teammates that can pressure them like Salazzle, Delphox, and Golurk. Grimmsnarl's Substitute is easily broken by powerful wallbreakers like Paldean Tauros-F and Staraptor, or it can be ignored by Toxtricity. So, Milotic, Bellibolt, and Bronzong make for great partners, being able to check these strong offensive threats. Grimmsnarl easily takes advantage of and sets up against special attacking walls like Gastrodon and Bellibolt. In order to get Grimmsnarl in against these Pokemon, it must be paired with teammates that force these walls in and can pivot like Grafaiai and Flamigo. Grimmsnarl, due to being slow and having to rely on Sucker Punch to take care of faster threats, likes to have cleaners alongside it such as Choice Scarf users like Staraptor, Rotom-C, and Bruxish to finish up games after it's beaten the bulkier Pokemon. Grimmsnarl also struggles with sweeping early-game, so wallbreakers like Meloetta, Paldean Tauros-F, and Hariyama pair well to overwhelm shared checks such as Coalossal, Mudsdale, and Qwilfish. Scream Tail and Florges are both annoyances for Grimmsnarl, as they can both lock it into a move with Encore and Trick, respectively. In order to deal with these threats, partners like Skuntank, Salazzle, and Toxtricity work well in tandem with Grimmsnarl.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Alcremie": {"sets": {"Double Dance": {"description": "<p>If Alcremie is not being used on Grassy Terrain, it should hold Leftovers to maximize its recovery. 64 Speed EVs allow Alcremie to outspeed Sandaconda and Wo-Chien; this lets it attack before these foes can slow it down with Glare or either Leech Seed or Ruination, respectively.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Frosmoth": {"sets": {"Quiver Dance": {}}},
  "Indeedee-F": {"sets": {"Terrain Setter": {"description": "<p>Indeedee-F can viably run Special Attack investment to reduce its passivity and better wear foes down for its teammates. Doing so comes at the cost of bulk, though, which tends to make Indeedee-F less reliable.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Copperajah": {"sets": {"Assault Vest": {"description": "<p>124 Speed EVs lets Copperajah outrun Bellibolt. Copperajah can use an EV spread of 252 Atk / 4 SpD / 252 Spe to maximize its offensive potential, though doing so seriously cuts into the bulk Assault Vest provides and often isn't necessary. Heavy Metal in tandem with moves like Heavy Slam and Heat Crash may seem appealing, but these options are generally unreliable, especially against common foes like Mudsdale.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Specially Defensive": {}}},
  "Duraludon": {"sets": {"Tank": {}, "Choice": {}}},
  "Glastrier": {"sets": {"Swords Dance": {"description": "<p>Substitute, potentially in tandem with Leftovers, can be used over Stomping Tantrum to protect Glastrier from status and weaker attacks, improving its matchup against bulkier teams. Heavy-Duty Boots prevents Glastrier from being worn down by entry hazards, allowing it more chances to set up and otherwise leverage its great bulk. On hyper offensive teams, Custap Berry is an option to let a weakened Glastrier turn the tables on unsuspecting revenge killers. 124 Speed EVs let Glastrier move before Bellibolt.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Calyrex": {"sets": {"Double Dance": {"description": "<p>Calyrex is not viable in PU, but this is considered its best set.</p> <p>The Speed investment lets +2 Calyrex outspeed Choice Scarf Alolan Dugtrio.</p>"}}},
  "Pawmot": {
    "sets": {
      "Offensive": {
        "description": "<p>Pawmot finds a niche over other Fighting-type wallbreakers such as both Paldean Tauros formes and Flamigo thanks to its great STAB combination that hits Pokemon like Galarian Articuno, Paldean Tauros-W, and Milotic; wide variety of coverage and utility options; great Speed; and useful abilities. It is also the only physical Electric-type in the tier. Knock Off provides utility by removing items from Pokemon like Galarian Slowbro and Gligar while also providing coverage for Ghost-types such as Decidueye and Golurk; however, Ice Punch provides coverage for the aforementioned Decidueye, Golurk, and Gligar while also doing more damage to other Pokemon like Colbur Berry or itemless Palossand and Altaria. Pawmot has a wide variety of options in for its final moveslot; Mach Punch gives Pawmot valuable priority against weakened setup sweepers and Choice Scarf users such as Zoroark, Paldean Tauros-W, and Staraptor. Rest should be paired with Natural Cure takes advantage of Pokemon that Pawmot forces to switch out like Bombirdier and Milotic. Finally, Volt Switch allows Pawmot to pivot against Pokemon like Goodra and Rotom-H and should be run with Heavy-Duty Boots. Life Orb allows Pawmot to achieve rolls such as having a chance to 2HKO Assault Vest Galarian Slowbro with Knock Off and OHKOing Delphox with Double Shock, but Heavy-Duty Boots lets it switch in more safely. Iron Fist boosts the power of Ice Punch and Mach Punch, but Natural Cure naturally pairs well with Rest and can allow Pawmot to recover from burn and poison. It should should be used when not running Ice Punch or Mach Punch. Volt Absorb can allow Pawmot to operate as an Electric immunity for its team, but this is generally not needed, and its other abilities are more viable. Tera Electric boosts the power of Double Shock, allowing Pawmot to OHKO Skuntank and Milotic, and makes the move spammable thanks to cancelling out the type loss from Double Shock. It also provides a useful Flying resistance, which is helpful against Pokemon like Scyther and Kilowattrel.</p> <p>Pawmot finds itself on offense and balance teams looking for a strong wallbreaker that can also function as a utility Pokemon with Knock Off, pivoting, and revenge killing. Pawmot struggles to break through certain physical walls such as Bellibolt and Mudsdale, so checks to these threats like Galarian Slowbro and Decidueye make excellent partners. Pawmot appreciates entry hazard control from Pokemon like Coalossal, Altaria, and Tatsugiri due to it switching out often due to Double Shock, especially if it is running Life Orb. Coalossal and Altaria can also sponge hits from faster foes that threaten Pawmot such as Galarian Slowbro and Ambipom, while Tatsugiri can form a potent wallbreaking core with Pawmot. In turn, Pawmot takes cares of their checks such as Paldean Tauros-W and Goodra. Pawmot's ability to revenge kill Pokemon like both Paldean Tauros formes, Delphox, and Bruxish means that walls checked by these threats like Bronzong, Copperajah, and Florges are excellent partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Naclstack": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Specially defensive Naclstack is a formidable defensive pivot and wall, checking many of PU's best offensive options like Arcanine, Salazzle, and Florges while being capable of absorbing attempts at status. Salt Cure accrues massive amounts of residual damage, and nothing wants to stay in and get worn down by its effect. Protect scouts attacks from Choice-locked Pokemon like Flamigo and Staraptor while racking up Salt Cure damage. Curse can be used to bolster its already excellent Defense, giving Naclstack the ability to excel in late-game situations as an impenetrable wall and counter to Curse Arcanine. Stealth Rock is an option for Naclstack, as it can use its defensive utility to establish hazards repeatedly throughout a game while freeing up a slot for teammates that prefer other options over Stealth Rock, like Spikes Gastrodon and Gligar. Tera Water is generally a good Tera type for defensive walls and works especially well for Naclstack, giving it much better matchups into the strong Fighting- and Water-types in the tier like Emboar, Flamigo, Paldean Tauros-W, and Tatsugiri. Tera Ghost similarly helps with Fighting-type attacks and can prevent attempts at Rapid Spin from Coalossal and Tatsugiri, though it comes at the expense of becoming much weaker to Knock Off and its inability to boost with Curse.</p> <p>Balance and bulky offense teams appreciate Naclstack greatly as a specially defensive wall capable of sponging hits, absorbing status, and functioning as an entry hazard setter that can get them up multiple times a game. Hazard stacking cores with teammates like Gastrodon and Gligar are incredibly efficient in wearing teams down with gradual chip damage, though they need support in the form of Knock Off from offensive teammates like Ambipom and Skuntank to help remove Heavy-Duty Boots. With Salt Cure, Naclstack can often prevent defensive walls like Bronzong, Coalossal, and Copperajah from getting too comfortable against it, allowing teammates to get momentum through forcing multiple switches. Once it is able to get a Salt Cure off, Naclstack will often force switches, and to avoid it being face-to-face with a wallbreaker like Golurk or Decidueye, it's a good idea to double switch into an offensive teammate like Staraptor and Paldean Tauros-W. These two also appreciate Naclstack for its ability to stack chip damage to the walls that may switch into Naclstack, like Mudsdale and Houndstone. Naclstack can sometimes be reliant on Tera to function as the immovable object it desires to be, so pairing it with teammates that can use their natural defensive typing well, like Decidueye, Rotom-C, and Skuntank, is important to get the most out of Naclstack.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 654091, "username": "FlamPoke"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Bellibolt": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Bellibolt is a fantastic physically defensive wall and utility pivot thanks to its decent defensive typing, great abilities in Static and Electromorphosis, reliable recovery in Slack Off, and access to useful utility moves like Volt Switch and Toxic. Toxic prevents Pokemon such as Gastrodon and Golurk from coming in freely to take advantage of Bellibolt while also putting setup sweepers such as Decidueye and Florges on a timer. Volt Switch allows Bellibolt to be an effective slow pivot and generate momentum for its team. Muddy Water can be used to directly threaten Ground-types such as Golurk, Mudsdale, and Gligar while also hitting the likes of Coalossal and Rotom-H. Parabolic Charge can be used in lieu of Volt Switch or Muddy Water, dealing damage while also functioning as a source of recovery that reduces Bellibolt's reliance on Slack Off. It should, however, only be used with the Electromorphosis ability, as it is fairly weak and unreliable without the Charge boost. Soak, while a more niche and hard-to-fit option, has benefits such as nullifying foes' STAB attacks and notably allowing Bellibolt to turn the tables on Ground-types; it can also work well in tandem with Parabolic Charge and removes the immunity to Toxic from the likes of Alolan Sandslash, Bronzong, and Galarian Slowbro, which can be invaluable in making progress against them. However, Soak is extremely niche and very hard to fit over Volt Switch or Muddy Water. Bellibolt generally prefers utilizing Static over Electromorphosis to hinder contact attackers like Arcanine, Paldean Tauros-W, and Scyther with paralysis. However, Electromorphosis can boost Bellibolt's Electric-type STAB attacks after taking a hit and works especially well when combined with Parabolic Charge. Heavy-Duty Boots is Bellibolt's preferred item, which can be useful to increase longevity against entry hazard-stacking teams. Alternatively, Rocky Helmet synergizes with Static to further punish contact attackers such as Staraptor, Paldean Tauros-W, and Ambipom. Another option is Leftovers to grant Bellibolt residual healing, reducing its reliance on Slack Off at the cost of its ability to prevent hazard chip or wear down contact attackers as effectively. Tera Water removes Bellibolt's weakness to Ground-types, allows it to better take on attackers like Arcanine and Bruxish, and also boosts the power of Muddy Water when targeting Ground-types.</p> <p>Bellibolt pairs well with frail offensive threats such as Bruxish, Flamigo, and Salazzle that appreciate its slow pivot support to get them onto the field safely. It can also form pivot cores with the aforementioned Bruxish and Flamigo as well as the likes of Scyther, which can handle Pokemon like Wo-Chien. Specially defensive walls such as Bronzong, Gastrodon, and Assault Vest Galarian Slowbro synergize well to handle the likes of Meloetta, Tatsugiri, and Toxtricity, respectively. Secondary physical walls such as Mudsdale, Milotic, and Galarian Slowbro can be useful to prevent Bellibolt from becoming overwhelmed by threats such as Skuntank, Paldean Tauros-W, and Flamigo. Mudsdale and Milotic can also help into setup sweepers like Scrafty and non-Taunt Grimmsnarl thanks to Roar and Haze, respectively. Powerful Ground-types such as Golurk can pressure Bellibolt, so switch-ins to these Ground-types such as Wo-Chien and Bombirdier are appreciated. Wo-Chien also helps into Nasty Plot Rotom-C and Swords Dance Decidueye. In return, Bellibolt is able to handle Pokemon like Scyther and Staraptor that it struggles with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 435539, "username": "BloodAce"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 414072, "username": "Hera"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Kilowattrel": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Kilowattrel is one of PU's best pivots and revenge killers able to revenge kill Pokemon like Paldean Tauros-W, Tornadus, and Scrafty thanks to a strong offensive typing in tandem with an amazing Speed stat, letting it outpace the entire unboosted metagame bar Hisuian Electrode, as well as its spammable STAB moves. U-turn allows Kilowattrel to pivot away from problematic matchups like Gastrodon, Coalossal, and Florges, and it is used over Volt Switch to reliably pivot away from Ground-types like Mudsdale and Gligar. Roost allows Kilowattrel to recover off damage against the switches it forces on Pokemon like Scrafty and Wo-Chien or against Pokemon it walls like Rotom-C and opposing Kilowattrel; Roost also lets it recover Toxic and Will-O-Wisp damage from Pokemon like Gligar and Altaria, respectively, although it removes Kilowattrel's Ground-type immunity, which can be unfavorable against Pokemon like Mudsdale. Kilowattrel's choice of ability is flexible; Competitive punishes Defog from Altaria and Scyther while also potentially allowing Kilowattrel to use Intimidate drops from Arcanine and Paldean Tauros-F to become a more threatening Special Attacker. Alternatively, Volt Absorb allows Kilowattrel to wall Pokemon like Hisuian Electrode, opposing Kilowattrel, and Pawmot lacking Ice Punch while also blocking Volt Switch from Pokemon like Bellibolt and Rotom-H. Kilowattrel's Tera Types are also flexible; both Tera Electric and Tera Flying boost Kilowattrel's STAB moves, allowing Kilowattrel to achieve rolls such as the OHKO on Zoroark and Galarian Articuno with Tera Electric Thunderbolt as well as the 2HKO and OHKO on Altaria and Wo-Chien, respectively, with Tera Flying Hurricane after Stealth Rock. Tera Ghost is an alternative option that can block Extreme Speed from Arcanine and Quick Attack from Scyther and let it function as an emergency spinblocker, it should also be run with Volt Absorb to pivot around Toxtricity if needed.</p> <p>Kilowattrel finds itself succeeding on offensive teams looking for a solid pivot that also operates as great speed control and a decent special attacker. Kilowattrel's ability to use U-turn relatively safely makes it an excellent partner for wallbreakers that can struggle to get themselves onto the battlefield like Golurk, Paldean Tauros-W, and Goodra. Kilowattrel can struggle against Ground-types like Gastrodon and Mudsdale as well as bulky special walls like Bronzong and Florges; therefore, checks to these threats like Decidueye and Grass Knot Delphox all make excellent partners. Kilowattrel's ability to revenge kill other faster attackers like Scyther and Salazzle allows for Pokemon checked by these threats like Delphox and Decidueye to be good teammates. Decidueye in particular makes an excellent partner, as it can deal with all of the aforementioned walls especially well; in turn, Kilowattrel can chip away at Pokemon like Skuntank, Bombirdier, and Wo-Chien for Decidueye. Other pivots like Scyther, Gligar, and Ambipom can create a powerful VoltTurn core, pivoting often on balance staples like Galarian Slowbro, Bellibolt, and Mudsdale.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Grafaiai": {"sets": {"Terrain Sweeper": {"description": "<p>While investing more in Speed maximizes Grafaiai's odds of success against opposing Terrain teams, investing in bulk gives it an easier time setting up.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Bombirdier": {
    "sets": {
      "Offensive": {
        "description": "<p>Bombirdier is one of PU's best offensive pivots and Knock Off spreaders thanks to its great offensive typing, spammable STAB moves, wide variety of utility options, and a great defensive profile allowing it to take advantage of Pokemon like Decidueye, Golurk, and Gastrodon. Sucker Punch allows Bombirdier to pick off weakened faster threats and setup sweepers such as Choice Scarf Staraptor, Delphox, and Toxtricity. Bombirdier has a wide variety of options in its final slot; Taunt allows Bombirdier to deny setup attempts from Pokemon like Arcanine and Scream Tail, hazard-setting attempts from Mudsdale and Gligar, Defog from Altaria, and recovery attempts from Pokemon like the beforementioned Altaria, Milotic, and Palossand. Stealth Rock allows Bombirdier to support its team with entry hazards and allows it to free up a moveslot for teammates like Alolan Sandslash and Gastrodon. Roost allows Bombirdier to capitalize on the switches it forces on Pokemon like Bronzong and Decidueye and recover off damage and Brave Bird recoil. U-turn or Parting Shot allows Bombirdier to safely pivot into teammates, but both moves can be hard to fit over other options. Tera Dark boosts the power of Knock Off and Sucker Punch, allowing Bombirdier to achieve rolls such as OHKOing Bronzong and Toxtricity with minimal chip and 2HKOing Altaria while also removing its weakness to Electric- and Rock-type attacks, which is valuable against Pokemon like Kilowattrel and Minior.</p> <p>Bombirdier finds itself on a wide variety of teams ranging from bulky balance to hyper offense. Although it resists Knock Off, Bombirdier appreciates fellow Dark-resistant Pokemon such as Scrafty and Paldean Tauros-F that can switch into Knock Off for it, as Bombirdier requires Heavy-Duty Boots to be an effective pivot. Bombirdier's ability to take out walls like Galarian Slowbro, Gastrodon, and Wo-Chien allows for Pokemon checked by these threats such as Calm Mind Florges, Tatsugiri, and Decidueye to become much more potent offensive threats. Bombirdier struggles with bulkier walls who can cripple it with status like Bellibolt and Coalossal, so Pokemon who can check these threats like Mudsdale, Goodra, and Tatsugiri make good partners. While it is immune to Ground-type attacks, Bombirdier should be paired with other Pokemon that resist Ground such as Decidueye and Bronzong because it cannot reliably take on Ground-types such as Gligar and Mudsdale on its own.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 414072, "username": "Hera"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Houndstone": {
    "sets": {
      "Defensive": {
        "description": "<p>Houndstone is a stellar physical wall courtesy of its immense bulk with Fluffy. Its vast array of disruptive utility moves and its great typing lets it check common physical attackers such as Paldean Tauros-W, Flamigo, Staraptor, and Pawmot, as well as letting it act as an excellent spinblocker. Night Shade is Houndstone's most reliable form of making progress thanks to its fixed damage, wearing down physical setup Pokemon such as Bulk Up Paldean Tauros-W and Bulk Up Hariyama. Body Press capitalizes on Houndstone's gargantuan Defense, targeting Dark-types like Zoroark, Wo-Chien, and Scrafty as well as Steel-types like Copperajah and Duraludon. Additionally, it lets non-Will-O-Wisp variants touch Normal-types such as Staraptor and Ambipom. Houndstone's last two slots are quite versatile; Will-O-Wisp lets it cripple a large variety of physical attackers, namely Paldean Tauros-W, Flamigo, Ambipom, and Staraptor, while also punishing Ghost-types such as Golurk and Decidueye that attempt to capitalize off of Houndstone's passivity. Protect synergizes amazingly with Will-O-Wisp, wearing down foes while helping maintain longevity with Leftovers. It can also assist in scouting attacks from foes like Choice Scarf Florges and Paldean Tauros-F. Alternatively, the combination of Rest and Sleep Talk offers Houndstone a form of semi-reliable recovery, letting it capitalize on the presence of Pokemon that are unable to do very much damage to it, namely foes like Choice Scarf Flamigo and Ambipom, to heal to full health. However, the unreliable nature of Sleep Talk may leave Houndstone open to being taken advantage of by offensive Pokemon like Arcanine and Scrafty, giving them a prime opportunity to use it as setup bait. Pain Split is a niche alternative, acting as a less committal option for recovery compared to Rest, although it is more unreliable due to its reliance on foe's HP. Charm is another niche alternative option, heavily halting the momentum of physical setup sweepers such as Bulk Up Scrafty, Curse Arcanine, and Bulk Up Paldean Tauros-W. Roar similarly dissuades setup Pokemon while having more utility against special attackers and synergizing well with entry hazards. Houndstone has a solid array of viable Tera types; Tera Water turns its Fire weakness into a neutrality, which can prove vital against the likes of Arcanine and Paldean Tauros-F. Tera Fighting powers up Houndstone's Body Press, letting it 2HKO Skuntank after Stealth Rock while alleviating its weakness to Dark so it can more easily handle the likes of Skuntank and Scrafty. Tera Fairy also gives Houndstone a Dark resistance as well as a Fighting resistance, opening it up to completely wall the likes of Hariyama and Bombirdier.</p> <p>Defensive Houndstone fits best on a variety of balance and bulky offense teams as a reliable physically defensive wall. Entry hazard setters such as Bronzong, Gligar, and Gastrodon make for excellent partners, heavily appreciating Houndstone's ability to block Rapid Spin attempts while in return offering their own great utility; Bronzong's Psychic Noise further bolsters burn damage from Houndstone's Will-O-Wisp. Gligar can use Toxic to stall out and wear down foes that Houndstone may not do as well against. Additionally, Earthquake and Knock Off can threaten Fire-types such as Arcanine, Emboar, and Paldean Tauros-F that Houndstone is weak to. Bulky setup Pokemon such as Curse Arcanine, Iron Defense Bronzong, and Calm Mind Florges appreciate Houndstone burning foes that could otherwise overwhelm them, making it easier for them to find opportunities to set up and sweep. Specially defensive Pokemon such as Florges, Gastrodon, and Wo-Chien can handle the special attackers that Houndstone may otherwise struggle with such as Kilowattrel, Inteleon, and Hoopa, respectively. Scream Tail is another great defensive partner that can provide Wish support, which can open Houndstone up to more easily run Will-O-Wisp and Protect. Pokemon that can check Dark-types such as Florges, Skuntank, and Paldean Tauros-W are good partners for Houndstone, being able to switch in on Dark-type moves from the likes of Scrafty, Zoroark, and Bombirdier. In return, Florges can provide valuable Wish support, Skuntank can use useful utility moves like Knock Off and Taunt to assist Houndstone in wearing down foes, and Paldean Tauros-W can capitalize off of Dark-types for offensive momentum.</p>"
      },
      "Offensive": {
        "description": "<p>While it faces tight competition from Decidueye and Golurk, which are both stronger, Houndstone dual functions as an effective wallbreaker and spinblocker. Fluffy is a noteworthy niche over the aforementioned Ghost-types, preventing Houndstone from being immediately ruined by moves like Knock Off and letting it trade more easily with physical attackers like Pawmot and Flamigo. Houndstone also has access to Play Rough, which hits Staraptor and Dark-types like Scrafty and Bombirdier harder than Decidueye often can, in addition to Shadow Sneak, which Golurk notably lacks. Roar prevents setup sweepers like Paldean Tauros-W, Arcanine, Scream Tail, and Dudunsparce from exploiting Houndstone or getting out of hand and spreads chip damage if entry hazards are up. Pain Split can be used instead of Roar to improve Houndstone's longevity, which bulkier teams may find more useful. Will-O-Wisp is another option that wears down walls like Wo-Chien while still punishing threats like Skuntank and slowing setup sweepers like Paldean Tauros-W down. Both options are less consistent than Roar, though, due to being predictable and having imperfect accuracy, respectively. Body Press nails Normal-types like Tera Normal Scream Tail and offers accurate coverage for Dark-types, but it's not very useful otherwise. Spell Tag allows Poltergeist to 2HKO Florges and OHKO Galarian Slowbro after Stealth Rock and one layer of Spikes. It also turns Shadow Sneak a better revenge killing tool. Spell Tag is generally better than Choice Band, even with the added power and Houndstone's access to Trick, since it gives Houndstone more room for error against Dark-types. Either Heavy-Duty Boots or Leftovers can be used to give Houndstone more staying power, which may be desirable on bulkier teams, but it loses quite a bit of power without Spell Tag. Tera Fairy removes Houndstone's weaknesses to Dark and Ghost, allowing it to get past threats like Bombirdier and Decidueye. It also boosts Play Rough and blocks Tatsugiri's Draco Meteor, which gives Houndstone an easier time denying its Rapid Spin. Tera Ghost gives Spell Tag-boosted Poltergeist the strength to 2HKO physical walls like Bellibolt after Stealth Rock and makes up for the power Houndstone loses if it forgoes Spell Tag.</p> <p>Houndstone's great matchup against entry hazard removers like Alolan Sandslash and Scyther make it a good fit on hazard-stacking teams, though its wallbreaking potential and Fluffy-boosted bulk are valuable traits for bulky offense in general. Gastrodon is an amazing partner, blanking special Fire-types like Delphox and Salazzle and standing up to spinners that can pressure Houndstone out of switching in, such as Tatsugiri and Coalossal. Sturdier physical walls like Mudsdale and Gligar can cover Houndstone against threats like Arcanine, Bombirdier, and Paldean Tauros-F while still offering hazard support to help it push past bulky foes like Duraludon. Gligar should strongly consider not running Knock Off when pairing with Houndstone, though, since the move synergizes poorly with Poltergeist. Houndstone is virtually helpless against Normal-types like Dudunsparce and also struggles with Dark-types like Skuntank and Zoroark, which makes Fighting-types like Paldean Tauros-W and Flamigo excellent offensive teammates. In return, Houndstone offers these Pokemon some safety against revenge killers like Scyther and Ambipom, pressures physical walls like Bellibolt, and threatens Psychic-types like Galarian Slowbro and Scream Tail. Sticky Web teams love the role compression that Houndstone provides and are more than capable of punishing the spinners that do threaten it, with the best setters being Vikavolt and Smeargle.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 487308, "username": "BT89"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 617840, "username": "gulch"}, {"user_id": 355061, "username": "UberSkitty"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Flamigo": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>With its good Attack stat, spammable strong STAB moves in Brave Bird and Scrappy Close Combat, and the ability to pivot to facilitate opportunities for teammates, Choice Scarf Flamigo cements itself as the tier's premier revenge killer. Scrappy provides Flamigo with a handy Intimidate immunity, helping it versus the likes of Paldean Tauros-W and Arcanine. Roost gives it longevity, allowing it to function as a long-term check to Scrafty before Tera, as well as healing off Stealth Rock damage and recoil damage from Brave Bird. However, Roost is prediction reliant and is unreliable to lock into. A Jolly nature is preferred, but Flamigo can also opt for an Adamant nature to enhance its power, only losing out on Timid Hisuian Electrode and other Choice Scarf users with similar Speed tiers such as Rotom-C, Meloetta, and opposing Flamigo. Tera Fighting is used to augment Close Combat's power, most notably allowing it to 2HKO Bellibolt after Stealth Rock damage. This also gives Flamigo a Stealth Rock resistance, potentially giving it more opportunities to come in. Alternatively, Tera Flying can be used to boost Brave Bird, letting Flamigo 2HKO Galarian Slowbro after Stealth Rock, as well as OHKOing neutral targets such as Golurk, Delphox, and Goodra. However, Tera Flying gives Flamigo a Stealth Rock weakness, somewhat limiting its revenge killing capabilities.</p> <p>Choice Scarf Flamigo is best suited for bulky offense or balance teams that appreciate the speed control and revenge killing it provides, and it can leverage its pivoting ability to generate opportunities for wallbreakers such as Golurk and Choice Specs Meloetta. These two are good partners, as Flamigo's U-turn allows them to safely take advantage of common Flamigo switch-ins such as Bellibolt, Houndstone, and Galarian Slowbro and apply offensive pressure. Golurk is a particularly good partner, as it can directly switch into and take advantage of contact punishers such as Bellibolt and Coalossal without Flamigo needing to use U-turn, avoiding the risk of Static or Flame Body. Bellibolt forms a VoltTurn core with Flamigo while also handling faster threats such as Choice Scarf Staraptor and Choice Scarf Paldean Tauros-W that would revenge kill Flamigo. In return, Flamigo is able to check Scrafty, which would otherwise turn Bellibolt into setup fodder. Knock Off users such as Ambipom and Skuntank are good partners, as they force items such as Heavy-Duty Boots to be removed from targets like Bellibolt and Houndstone, making them susceptible to hazard chip damage so they are more easily overwhelmed by the pressure Flamigo puts on them. Ambipom forms a pivoting core with Flamigo and is able to revenge kill faster threats with its Fake Out. Paldean Tauros-W and Scyther are also good partners; when paired with Flamigo, they can easily overwhelm shared checks like Bellibolt, Bronzong, and Galarian Slowbro.</p>"
      },
      "Choice Band": {
        "description": "<p>Flamigo's unique traits of a powerful ability in Scrappy, an incredibly high Attack stat, the ability to pivot thanks to U-turn, and strong powerful STAB moves make it one of the strongest wallbreakers and physical attackers in the tier, although it is easily revenge killed. Close Combat is extremely spammable in tandem with Scrappy, targeting Pokemon like Golurk, Alolan Sandslash, and Duraludon. Brave Bird is a useful alternative STAB move that targets Pokemon like Heracross, Galarian Slowbro, and Florges. U-turn allows Flamigo to pivot out of awkward matchups like Bellibolt and Houndstone. Roost allows Flamigo to capitalize on the switches it forces against Pokemon like Scrafty and Wo-Chien and recover off damage from Stealth Rock and Brave Bird recoil, although its prediction reliance makes it risky to use. Tera Flying boosts Flamigo's more spammable Flying-type STAB move and achieves rolls like 2HKOing Gligar, whereas Tera Fighting boosts Close Combat, allowing it to OHKO Rotom-H and Bronzong with minimal chip damage. Tera Fighting also does not make Flamigo weak to Stealth Rock.</p> <p>Flamigo fits on offensive teams that want to have a powerful wallbreaker that can also bluff as a revenge killer. Flamigo's ability to OHKO Pokemon like Skuntank, both Paldean Tauros formes, and Scrafty means Pokemon threatened by these foes like Delphox, Galarian Articuno, Salazzle, and Ambipom all make stellar partners. Flamigo appreciates having the likes of Gligar and Gastrodon set up entry hazards to chip away at its few switch-ins like Bellibolt and Mudsdale and make it more difficult for revenge killers like Pawmot and Delphox to switch in, while in turn Flamigo can KO both Wo-Chien and Paldean Tauros-W, which would threaten these two. Other offensive pivots like Kilowattrel and Bruxish can make a stellar pivot core with Flamigo that can be hard to stop. Choice Scarf users like Zoroark and Florges make good partners, as most people assume Flamigo will be Choice Scarf, allowing these more niche options to become a surprise.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 477404, "username": "sufys"}, {"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 567354, "username": "LUSTRE"}]}]}
  },
  "Veluza": {"sets": {"Fillet Away": {}}},
  "Tatsugiri": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Tatsugiri is a Nasty Plot sweeper that compresses offensive utility in its access to both Rapid Spin and Storm Drain. The former is not only a valid option for entry hazard removal but also one way that Tatsugiri may clean late-game when setting up on more passive foes like Bronzong and Coalossal. That being said, Tatsugiri is very frail, which limits its potential to set up both Nasty Plot and Rapid Spin, making it easier to revenge kill with priority and diminishes the impact of Storm Drain when Water-types like Paldean Taurus-W and Bruxish can OHKO it with their stronger coverage. Eject Pack is ran over Heavy-Duty Boots on some offensive VoltTurn teams, as the sacrifice to Tatsugiri's bulk and consistency in removing entry hazards could be worth it to preserve momentum and bring in a wallbreaker after using Draco Meteor. A Timid nature ensures Tatsugiri may revenge kill Adamant Skuntank and Bombirdier, but on teams where its revenge killing purposes are not as necessary, Tatsugiri may opt for a Modest nature, which enjoys some extra liberties like 2HKOing Decidueye with Draco Meteor. Tatsugiri's Tera typings are defensive, as they offer the strongest sweeping chances by limiting its revenge killers; Tera Fairy is generally the best, allowing Tatsugiri to wall opposing Tatsugiri and Paldean Tauros-W and resist Sucker Punch. Tera Ghost is another option to wall Paldean Tauros-W, and it also allowsTatsugiri to reliably revenge kill—or prevent the revenge kill from—Curse Arcanine. Lastly, Tera Normal is a niche option to avoid relevant Ghost-type attacks like Decidueye's Shadow Sneak and Choice Scarf Hoopa's Shadow Ball, with the minor benefit of buffing Rapid Spin.</p> <p>Tatsugiri may easily fit on a variety of teams due to its offensive utility, with a predilection for offensive structures, but it ultimately always needs careful positioning for it to get on the field due to its frailty. It will best offensively check entry hazard users like Mudsdale, Gligar, and Coalossal, so pivots like Staraptor, Scyther, and Kilowattrel are great at getting Tatsugiri in safely against these walls. Arcanine and Skuntank may lure these walls in as well, making for riskier albeit just as rewarding, positioning plays for Tatsugiri to double switch or simply come in on their Stealth Rock and Spikes. In return, these two offensive teammates put pressure on some of the specially defensive walls that Tatsugiri struggles with, like Florges and Copperajah. Fire- and Ground-types such as Paldean Tauros-F and Golurk will enjoy Tatsugiri's ability to deter Water-type attacks from walls and revenge killers alike, such as Milotic, Gastrodon, and Choice Scarf Paldean Tauros-W; use these matchups as setup opportunities for Tatsugiri. Defensive cores with walls such as Mudsdale, Galarian Slowbro, and Copperajah are good to rely on when Tatsugiri is forced out by faster revenge killers like Staraptor and Choice Scarf Florges. With Eject Pack, Tatsugiri will have a one-time switch on special walls like Copperajah and Gastrodon, so physical wallbreakers that enjoy the free switch-in like Flame Orb Heracross and Choice Band Paldean Tauros-F will make the most out of this interaction.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 231074, "username": "S1nn0hC0nfirm3d"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400292, "username": "asa"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Farigiraf": {"sets": {"Offensive Trick Room": {}}},
  "Dudunsparce": {"sets": {"Calm Mind": {"description": "<p>Serene Grace can be used to give Dudunsparce better odds of breaking through walls via Special Defense drops or status. Rattled is more consistent, though, and punishes the use of moves like U-turn and Knock Off, the latter being easier to bait if Dudunsparce runs Tera Ghost.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Utility": {}}},
  "Scream Tail": {
    "sets": {
      "Wish": {
        "description": "<p>Against common Fighting- and Dark-types like Paldean Tauros-F, Zoroark, and Bombirdier, Scream Tail can take advantage of them by leveraging its strong defensive typing to make for a great Wish passer that still carries utility with a fast Encore. Scream Tail also has advantages over other Wish passers like Florges; while it isn't as specially defensive, it can pass larger Wishes thanks to its higher HP, and its higher Defense means it isn't 2HKOed by Flamigo. Psychic Noise helps wear down walls like Gastrodon and Altaria, as it stops their means of recovery. However, Dazzling Gleam can be used to ensure Scream Tail isn't walled by Dark-types like Bombirdier and Scrafty. Encore allows Scream Tail to take advantage of walls and bulky setup sweepers alike such as Gastrodon and Grimmsnarl, granting teammates a free switch. Heavy-Duty Boots is preferred as to not be worn down by entry hazards because Scream Tail doesn't have reliable recovery, but Leftovers can be used with Protect to slowly regain HP over the course of a battle without being forced to use Wish as much. Tera Steel gifts Scream Tail many great resistances, helps it take attacks from Duraludon and Skuntank, and allows it to ignore Toxic from the latter. On the other hand, Tera Water allows Scream Tail to take on Delphox and Arcanine while still granting it a Steel resistance, letting it take on Heavy Slam Mudsdale and Bronzong. Unlike Tera Steel, it doesn't throw away Scream Tail's matchup against Fighting-types like Flamigo and Scrafty.</p> <p>Scream Tail fits best on balance teams that aim to keep their walls and wallbreakers, such as Bronzong, Mudsdale, Staraptor, and Paldean Tauros-F healthy. Scream Tail's access to utility Wish and Encore allows these walls to be continuously useful and also helps bring in big threats safely and repeatedly. While Psychic Noise can help Scream Tail take care of walls, it then becomes taken advantage of by Dark-types like Scrafty and Zoroark, so Fighting-types like Emboar, Paldean Tauros-W, and Hariyama help to check these Pokemon, and they appreciate Scream Tail's Wish passing abilities in return. Pokemon like Skuntank and Duraludon appreciate Scream Tail's ability to beat their Fighting-type checks, such as Heracross and Paldean Tauros-W, and can take advantage of its Wish, making them great partners. In return, they handle pesky Fairy- and Psychic-types Scream Tail has trouble taking down by itself like Florges and Galarian Slowbro. Scream Tail is also walled by Steel-types like Bronzong and Duraludon; in order to threaten these Pokemon, partners that can put pressure on them like Arcanine, Salazzle, and Golurk are required. Scream Tail is preferably used as a secondary wall, as it can't take too many attacks itself well. So, a physical wall like Bellibolt or Gligar or a special wall like Wo-Chien or Bronzong helps to alleviate pressure from Scream Tail to take hits. Scream Tail's passivity can also be used against it, so pivots like Flamigo, Coalossal, and Skuntank that can match up well against its checks, such as Duraludon, Salazzle, and Decidueye, and regain momentum are great teammates.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Scream Tail is a fearsome sweeper that also doubles as an effective revenge killer thanks to its high Speed, with Speed Booster Energy letting it outrun the entire unboosted metagame. Scream Tail compensates for its meager Special Attack with its impressive natural bulk, which often gives it multiple chances to boost and makes it difficult to take down. Boomburst being so immediately strong also helps, which can 2HKO neutral targets like Galarian Slowbro, Bellibolt, and Gligar at +1 with Stealth Rock chip damage. Flamethrower threatens Steel-types like Alolan Sandslash and Bronzong and offers coverage for Ghost-types like Decidueye and Houndstone. Substitute lets Scream Tail exploit passive foes like Bellibolt and Gastrodon and protects it against priority from threats like Arcanine. It is generally better at creating setup opportunities for Scream Tail than moves like Encore and Disable, since they don't block status or Clear Smog. Psychic Noise is a more proactive alternative that puts greater pressure on walls like Florges, Milotic, and Altaria in exchange for easier setup. It also gives Scream Tail a STAB option before Terastallizing and hits foes like Toxtricity, Golurk, and Coalossal harder than its other moves. 208 Speed EVs let Scream Tail outrun +2 Toxtricity and Choice Scarf users such as Paldean Tauros-W and Staraptor after using Booster Energy. Tera Normal boosts Boomburst, removes Scream Tail's weaknesses, and lets it potentially set up on Ghost-type attacks from the likes of Decidueye and Palossand.</p> <p>Hyper offense benefits a lot from Scream Tail pressuring incredibly fast threats like Salazzle, Kilowattrel, and Choice Scarf Staraptor and excels at paving the way for it to sweep. Scream Tail has a place on bulky offensive teams as well, where its set might not be immediately clear. Rock- and Steel-types like Coalossal and Copperajah are incredibly difficult for Scream Tail to bypass, making Water- and Fighting-types like Tatsugiri, Paldean Tauros-W, and Flamigo useful partners to have. In return, Scream Tail punishes Dragon- and Psychic-types like Goodra and Bruxish for them and can capitalize on their switch-ins, such as Gastrodon and Altaria. Arcanine naturally matches up well against Steel-types, puts pressure on specially bulky threats like Grimmsnarl and Dudunsparce, and can handle early- or mid-game revenge killing so that Scream Tail can conserve its Booster Energy. Pokemon like Toxtricity and Decidueye are great at threatening phazers like Milotic and Mudsdale, which can easily cut Scream Tail's sweep short, and they can bait in frail Pokemon like Salazzle and Zoroark for Scream Tail to revenge kill or set up on. Residual damage goes a long way in securing Scream Tail's sweep, since it is not strong enough to brute force its way through most Pokemon. For example, after one layer of Spikes, +1 Tera Normal Boomburst OHKOes Skuntank and can even 2HKO Florges and Assault Vest Galarian Slowbro. As such, Spikers like Smeargle on hyper offense and Gligar on balance can be very beneficial teammates. Pokemon like Skuntank, Salazzle, and the aforementioned Gligar can gradually wear walls like Mudsdale, Coalossal, and Florges down with Toxic and are good at pressuring other nuisances like Assault Vest Galarian Slowbro, Copperajah, and Duraludon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 231074, "username": "S1nn0hC0nfirm3d"}, {"user_id": 400292, "username": "asa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Wo-Chien": {
    "sets": {
      "Leech Seed": {
        "description": "<p>With its staggering Tablets of Ruin-bolstered bulk and disruptive utility options, Wo-Chien serves as a sturdy physical wall that can be difficult for teams to maneuver around. Wo-Chien's typing also provides it with multiple valuable resistances, such as Ghost, Ground, and Psychic, helping it both stave off deadly wallbreakers like Decidueye, Golurk, and Meloetta and punish opposing walls like Mudsdale and Gastrodon. On top of scouting what move Choice-locked foes like Flamigo go for, Protect maximizes the health Wo-Chien regains from Leftovers and the progress it makes with Leech Seed. Ruination consistently puts immense pressure on Pokemon looking to exploit Wo-Chien, such as Florges, Skuntank, and Coalossal, especially if they lack recovery like the latter two or have already been hit by Leech Seed. Foul Play more directly deals with physical attackers like Decidueye and Copperajah and lets Wo-Chien trade damage with setup sweepers like Zoroark and Scyther after it Terastallizes. While Heavy-Duty Boots seem appealing to protect Wo-Chien from entry hazards, especially if its team opts not to run removal, Leftovers is generally better for making Wo-Chien more durable. Tera Poison removes all of Wo-Chien's weaknesses; this notably makes it much less vulnerable to U-turn while also letting it wall the likes of Paldean Tauros-W, Skuntank, and Scrafty and punishing foes like Hoopa for using coverage. It also improves Wo-Chien's longevity by preventing it from being poisoned by moves like Bellibolt's Toxic and Gastrodon's Sludge Bomb. Wo-Chien can be tough to break after it Terastallizes, which is why it's often a team's Tera user; upon doing so, though, it becomes weak to Ground- and Psychic-type moves from foes like Golurk and Hoopa and easier to overwhelm with threats like Decidueye. Wo-Chien's massive Special Defense also makes running specially bulky sets a viable option, letting it more easily sponge attacks from Goodra and non-Sludge Bomb Toxtricity and virtually function as a mixed wall thanks to Tablets of Ruin.</p> <p>Balance teams benefit a lot from Wo-Chien's unique defensive profile and the amount of progress it can potentially force, all without being too bothered by its occasional passivity. Galarian Slowbro is an excellent teammate; on top of absorbing Toxic, Assault Vest variants stifle special sweepers like Florges and Salazzle, while physically defensive sets more reliably answer Fighting-types like Flamigo. Special walls, such as Florges, Gastrodon, and the aforementioned Assault Vest Galarian Slowbro, keep threats like Tatsugiri, Rotom-H, and Scream Tail at bay while forming robust defensive cores with Wo-Chien. Florges can also run Wish to reduce Wo-Chien's reliance on Leech Seed for recovery, while Gastrodon and Galarian Slowbro are good at wearing down nuisances like Coalossal. Entry hazard removers like Altaria and Coalossal give Wo-Chien more opportunities to switch in and help it stay healthy without needing to play predictably. Both examples deal with physical Fire-types like Paldean Tauros-F and Arcanine, respectively, and can give Wo-Chien an easier time outlasting both physical attackers and opposing walls by spreading burns. Setup sweepers like Scrafty, Paldean Tauros-F, and Grimmsnarl pose a threat to Wo-Chien, particularly if it can't Terastallize, mandating offensive teammates that can either revenge kill them or scare them out; good examples include Choice Scarf users like Florges, Bruxish, and Flamigo and tanks like Arcanine and Assault Vest Copperajah.</p>"
      },
      "RestTalk": {}
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 617840, "username": "gulch"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  }
}