{
  "Cloyster": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/cloyster.3712158/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Super Smash Sweeper",
        "description": "<ul> <li> <p>Shell Smash and Skill Link more than make up for Cloyster's weak Attack stat, making it a formidable sweeper that Focus Sash and Mimikyu can't easily stop.</p> </li> <li> <p>Ice Shard may seem like overkill, but it helps for not only picking off weakened threats, but getting around priority attacks from Breloom, Dragapult, and Meowscarada.</p> </li> <li> <p>Rock Blast is Closyer's best shot at dealing with the many Tera Fires that will attempt to deal with Icicle Spear, as well as OHKOing Volcarona.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ice: The increased damage from Tera Ice makes it very difficult for Pokemon to wall Cloyster without resisting it, with even Corviknight getting OHKOed by +2 Adamant Icicle Spear after Stealth Rock damage.</p> </li> <li> <p><strong>Fire: While boosted Tera Blast actually does less damage to Corviknight than Tera Ice Icicle Spear, Tera Fire otherwise helps Cloyster muscle past Steel-types it traditionally struggles to beat, such as Scizor.</p> </li> <li> <p><strong>Ghost: Since Cloyster will often be at extremely low health after Shell Smash, Tera Ghost helps it avoid getting revenge killed by Breloom's Mach Punch. It also provides coverage against Gholdengo with Tera Blast.</p> </li> <li> <p><strong>Normal: Tera Normal offers no offensive benefits to Cloyster, but it does prevent Mimikyu from revenge killing it with Shadow Sneak.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Focus Sash</strong>: Considering Cloyster's paper thin Special Defense, Focus Sash gives Cloyster by far the most set up opportunities.</p> </li> <li> <p><strong>King's Rock</strong>: King's Rock is a risky option for making Cloyster difficult to set up, but it does give Icicle Spear a 41% chance of flinching.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Gengar": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/gengar-gp-0-1.3713197/\">This analysis is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> ", "sets": [{"name": "Disruptor"}]},
  "Tauros-Paldea-Fire": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/thicc-boy-tauros-gp-0-1.3713481/\">This analysis is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> ", "sets": [{"name": "FIREFIGHTER (Physically Defensive)"}, {"name": "Offensive Screen Smasher"}]},
  "Gyarados": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/gyarados-gp-0-1.3712818/\">This analysis is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> ", "sets": [{"name": "Dragon Dance Sweeper"}]},
  "Dragonite": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/dragonite.3712161/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Extreme Killernite",
        "description": "<ul> <li> <p>With Tera Normal, Dragonite can do its best impression of Arceus, with a powerful Extreme Speed that makes Dragonite a great revenge killer and sweeper in one!</p> </li> <li> <p>Earthquake is Dragonite's strongest tool against most Steel-types, but Fire Punch is worth considering to hit Corviknight.</p> </li> <li> <p>While a Dragon-type STAB move is useful against opposing Dragons and is Dragonite's best shot at picking off weakened Dondozo, it's not strictly needed on this Dragonite.</p> </li> <li> <p>A Jolly nature allows Dragonite to outspeed Dragapult after one use of Dragon Dance, but Adamant is a reasonable consideration if revenge killing with Extreme Speed is more important.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Lum Berry: Lum Berry gives Dragonite more set up opportunities against status moves and pairs particularly well with Outrage to cure confusion.</p> </li> <li> <p><strong>Silk Scarf</strong>: This item goes all in on Extreme Speed's revenge killing power, without conflicting with Multiscale.</p> </li> <li> <p><strong>Life Orb</strong>: Life Orb doesn't pair well with Multiscale on paper, but the power boost it gives Extreme Speed can let Dragonite clean teams up earlier.</p> </li> </ul> "
      },
      {
        "name": "Dragon Dance",
        "description": "<ul> <li>Dragonite uses both Multiscale and the unpredictability of Terastallization to become an extremely dangerous sweeper!</li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel</strong>: Dragonite has superb synergy with Tera Steel, resisting most of its weaknesses, and particularly helping against Fairy-types and opposing Dragon-types. When paired with Safety Goggles, this Dragonite can take advantage of Amoonguss effectively as well.</p> </li> <li> <p><strong>Fire: With Tera Fire, Dragonite deals massive damage to Corviknight with +1 Fire Punch, in addition to gaining a useful Fairy-type resistance.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Lum Berry: With a Lum Berry, Dragonite can set up against status moves and use Outrage with less risk late game.</p> </li> <li> <p><strong>Safety Goggles</strong>: Safety Goggles blocks Spore from Breloom and Amoonguss, though it is less versatile than Lum Berry.</p> </li> <li> <p><strong>Life Orb: Life Orb doesn't fit well with Multiscale, but it's notable for allowing Tera Fire Dragonite a 75% chance to OHKO Corviknight after Dragon Dance.</p> </li> </ul> "
      },
      {"name": "Choice Band", "description": "<ul> <li> <p>Choice Band makes Dragonite both an effective late-game cleaner with Tera Normal Extreme Speed and effective at breaking through many defensive Pokemon.</p> </li> <li> <p>Outrage is strong enough to potentially 2HKO Impish Dondozo after Stealth Rock damage, though it leaves Dragonite very vulnerable to getting revenge killed.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Azumarill": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/azumarill.3712746/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With a fantastic typing and priority, Azumarill makes a good choice for a team's bulky Water-type.</p> </li> <li> <p>Superpower often forces Azumarill to switch out, but its reliability against common Hydreigon Tera types is very valuable, in addition to OHKOing Kingambit.</p> </li> <li> <p>Ice Spinner is Azumarill's best option against Amoonguss.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fire: Tera Fire gives Azumarill a vital immunity to Will-O-Wisp, as well as letting it deal massive damage to Corviknight with Tera Blast.</p> </li> <li> <p><strong>Water: While it won't help Azumarill much in direct matchups, Tera Water will make it easier to clean weakened teams with Aqua Jet.</p> </li> <li> <p><strong>Grass</strong>: Tera Grass lets Azumarill beat Breloom and Rotom-W.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Assault Vest: Assault Vest lets Azumarill act as a Hydreigon check; even Choice Specs-boosted Tera Electric Tera Blast fails to OHKO it.</p> </li> <li> <p><strong>Choice Band</strong>: The big power boost from Choice Band gives Azumarill an 81.3% chance to OHKO Rotom-H with Aqua Jet.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Umbreon": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/umbreon-gp-0-1.3713520/\">This analysis is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> ", "sets": [{"name": "Wish Tank"}]},
  "Scizor": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/scizor.3713209/\">This analysis is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> ", "sets": [{"name": "Pivot"}]},
  "Blissey": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/blissey.3713059/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Calm Mind Support",
        "description": "<ul> <li> <p>The old reliable special wall is still relevant, but with a twist: Blissey uses Calm Mind so it isn't entirely passive and fully takes advantage of Tera Blast giving it STAB no matter what type it is.</p> </li> <li> <p>Shadow Ball is still a reasonable option for dealing good damage to Gholdengo and Dragapult regardless of Blissey's Tera type, and also breaks Mimikyu's Disguise.</p> </li> <li> <p>Thunder Wave is Blissey's most consistent way of spreading paralysis, though it's vulnerable to Taunt and Gholdengo switch-ins.</p> </li> <li> <p>With Fling and Light Ball, Blissey can paralyze Gholdengo, Ground-types, and users of Taunt alike, though Covert Cloak holders are immune to the effect. Fling also gets rid of Choice items from Trick users.</p> </li> <li> <p>Trick with Lagging Tail cripples even Electric-types and is a more direct way of getting rid of troublesome Choice items that Blissey would normally succumb to.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost: The Fighting-type immunity comes in handy for Blissey, though it does become more vulnerable to Gholdengo.</p> </li> <li> <p><strong>Dark</strong>: Dark Tera type not only gives Blissey a less exploitable STAB move against Gholdengo, but it also ruins Espathra's attempts to break through Blissey with Stored Power, at least forcing a Calm Mind war instead of a total loss.</p> </li> <li> <p><strong>Flying: Under Flying Tera type, Blissey gains a handy resistance to Fighting and no longer has to worry about Fissure from Dondozo.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Breloom": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/breloom.3712152/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {"name": "Focus Sash Spore", "description": "<ul> <li> <p>Since it can sleep foes without restriction, Breloom is a monstrous Focus Sash foe that every team needs to prepare for!</p> </li> <li> <p>Bulldoze is Breloom's best option against Gholdengo and provides valuable speed control.</p> </li> <li> <p>Close Combat lets Breloom muscle past bulkier threats more easily, such as Tera Steel Garganacl.</p> </li> <li> <p>Rock Tomb provides speed control and ensures that Breloom is not walled by Flying-types such as Dragonite.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fighting: Breloom doesn't Terastallize often, but Fighting Tera is a good choice for picking off foes more easily with Mach Punch.</p> </li> <li> <p><strong>Ground</strong>: Tera Ground-boosted Bulldoze has a 93.8% chance to OHKO 4 HP Gholdengo, making Breloom a situational lure. It also severely punishes Rotom-W that attempt to Volt Switch out, and Hippowdon that don't Terastallize.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 534158, "username": "Kiby"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Salamence": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/salamence.3712162/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Specsmence Returns",
        "description": "<ul> <li> <p>Salamence finds a niche for itself among other Dragon-types due to outspeeding Hydreigon, the most prominent special attacking Dragon-type. It also has a useful typing that provides a handy Fissure immunity, and it has an incredible ability in Intimidate.</p> </li> <li> <p>Hurricane's accuracy may not be very reliable, but the sheer damage output makes it worth it.</p> </li> <li> <p>Air Slash is much weaker than Hurricane, but the more reliable accuracy and flinch chance make it a reasonable alternative. It becomes especially attractive if using Tera Flying.</p> </li> <li> <p>If not using Tera Fairy, Hydro Pump is a reasonable choice that deals massive damage to Hippowdon and Fire-types without risking Draco Meteor.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: Not only does Tera Fairy give Salamence an edge against many Dragon-types, but it also pairs extremely well with Intimidate, transforming Salamence into an effective hit-and-run threat.</p> </li> <li> <p><strong>Steel</strong>: Tera Steel comes in handy against Dragon- and Fairy-types alike, though the added weaknesses to Ground and Fighting make it less effective at taking physical hits with Intimidate.</p> </li> <li> <p><strong>Flying</strong>: Air Slash becomes much easier to justify with Tera Flying, and if you're willing to risk it, Hurricane can be used to become almost impossible to wall with Choice Specs.</p> </li> <li> <p><strong>Fire</strong>: Tera Fire doesn't offer as much defensive utility, but the powerful STAB attacks come in handy against Steel-types like Corviknight.</p> </li> <li> <p><strong>Dragon: Tera Dragon trades defensive advantages for an extremely powerful Draco Meteor that catches defensive foes like Dondozo by surprise.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Specs: With Salamence already standing at a decent Speed tier, it can get away with Choice Specs, making it extremely difficult to wall outside of using Blissey.</p> </li> <li> <p><strong>Choice Scarf: Choice Scarf trades wallbreaking power for the ability to get the jump on major offensive threats, such as Dragapult, Meowscarada, and Garchomp.</p> </li> <li> <p><strong>Life Orb: Life Orb provides more flexibility than Choice items, but the recoil makes it less effective at hit-and-run attacks with Draco Meteor.</p> </li> </ul> "
      },
      {"name": "Dragon Dance", "description": "<ul> <li> <p>Salamence is somewhat overshadowed by other Dragon-types, but it has a trick up its claws: with a Flying Tera type, a boosted Dual Wingbeat has a 75% chance to OHKO offensive Mimikyu through its disguise! It also comes in handy for OHKOing Breloom through its Focus Sash.</p> </li> <li> <p>Earthquake is the best option for hitting Steel-types such as Gholdengo hard, but Fire Blast is Salamence's best shot at 2HKOing Corviknight.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Intimidate: While Salamence isn't particularly bulky, Intimidate makes setting up far easier when paired with a Flying Tera type that removes Salamence's common weaknesses.</p> </li> <li> <p><strong>Moxie</strong>: With Moxie, Salamence has the potential to seriously punish Breloom leads or snowball through teams even without Dragon Dance.</p> </li> </ul> "},
      {
        "name": "Mixed Attacker",
        "description": "<ul> <li> <p>Salamence can have trouble standing apart from all the dangerous Dragon-types, but its great mixed offenses and Moxie give it a niche.</p> </li> <li> <p>Dual Wingbeat lets Salamence OHKO Breloom regardless of its Focus Sash, something very few Pokemon can do.</p> </li> <li> <p>Earthquake is the more reliable option for Steel-types, but Fire Blast does get a 2HKO on Corviknight.</p> </li> <li> <p>Draco Meteor deals massive damage to Dondozo, usually doing more than 50% to physically defensive ones.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel: A Steel Tera type covers a lot of Salamence's weaknesses and makes dealing with Mimikyu much easier.</p> </li> <li> <p><strong>Fire: With a Fire Tera type, not only does Salamence gain a resistance to Fairy-type attacks, but it also has an 87.5% chance of OHKOing Corviknight when Fire Blast hits.</p> </li> <li> <p><strong>Dragon</strong>: While this Tera type fails to help Salamence much defensively, it makes Draco Meteor 2HKO physically defensive Dondozo.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Garchomp": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/garchomp.3712154/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Swords Dance Sweeper",
        "description": "<ul> <li> <p>The classic Swords Dance sweeper is still a big threat, thanks to its good bulk, unique Speed tier, and excellent use of Terastallization.</p> </li> <li> <p>Outrage is by far Garchomp's strongest STAB move, but the lock-in effect makes it very vulnerable to Fairy-types such as Mimikyu.</p> </li> <li> <p>Despite its low base power, Fire Fang is Garchomp's best shot at breaking past Corviknight after a Swords Dance. If Garchomp is almost always Terastallized on your team, Tera Blast can be used instead.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel: A Steel Tera type has excellent synergy with Garchomp's typing, letting it more effectively tackle faster Dragon-types, Mimikyu, and Ice Shard from the likes of Baxcalibur and Cloyster.</p> </li> <li> <p><strong>Fire: While the Stealth Rock weakness is unfortunate against bulkier teams, a Fire Tera type lets Life Orb Garchomp OHKO Corviknight with a +2 Fire Fang 93.8% of the time.</p> </li> <li> <p><strong>Ground</strong>: While the defensive synergy with Garchomp's former typing isn't that strong, a Ground Tera type lets Garchomp become more of a hit-and-run attacker with Earthquake, dealing good damage to Dondozo before being forced out by Yawn.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Life Orb: This is the best option for damage output.</p> </li> <li> <p><strong>Lum Berry</strong>: Lum Berry lets Garchomp deal with major status users more easily, such as Dragapult and Breloom.</p> </li> <li> <p><strong>Mirror Herb: Mirror Herb gives Garchomp the potential to severely punish set-up sweepers such as Dragapult and Dragonite, with the right Tera type.</p> </li> <li> <p><strong>Focus Sash: Surviving shocking attacks with Focus Sash gives Garchomp new sweeping and revenge killing potential.</p> </li> </ul> "
      },
      {
        "name": "Entry Hazard Setter",
        "description": "<ul> <li> <p>While Garchomp is known for its offensive prowess, it can also support its teammates with entry hazards and phazing.</p> </li> <li> <p>Bulldoze brings utility against Choice Scarf and naturally fast grounded opponents, but its lower Base Power makes Garchomp more passive against bulkier Pokemon.</p> </li> <li> <p>Sitrus Berry prevents Choice Band Dragapult from OHKOing Garchomp, as it activates after the first hit, and the HP recovered doesn't allow the second one to get the KO, unless Dragapult is Terastallized into a Dragon-type.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel: Terastallizing into a Steel-type makes Garchomp resist Dragon-, Ice- and Fairy-type attacks, making it a safer lead against opposing Dragon-type leads, at the cost of being vulnerable to Tera Fire Dragons and Fighting- and Ground-types.</p> </li> <li> <p><strong>Fairy</strong>: Fairy Tera type provides Garchomp with an immunity to Dragon while making it weak to Tera Steel Dragons and Gholdengo.</p> </li> </ul> <h1>EV spreads</h1> <ul> <li> <p><strong>188 HP / 236 Def / 84 Spe with Impish: This EV spread lets Garchomp survive Adamant Dragonite's Outrage while also outspeeding it.</p> </li> <li> <p><strong>252 HP / 124 Def / 132 Spe with Jolly: While this spread doesn't take physical hits as well, it lets Garchomp outspeed Gholdengo, Glimmora, and Rotom-W. This allows for scouting Rotom-W's item, as a Choice Scarf variant of it will be faster.</p> </li> </ul> "
      },
      {"name": "Choice Item", "description": "<p><a href=\"https://www.smogon.com/forums/threads/garchomp-choice-item-gp-0-1.3713521/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 330577, "username": "Thick Fat Azumarill"}]}
  },
  "Hippowdon": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/hippowdon.3712159/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Stealth Rock Support",
        "description": "<ul> <li> <p>Few Pokemon are more reliable at setting up Stealth Rock and phazing than Hippowdon.</p> </li> <li> <p>Roar is a more direct phazing option than Yawn, and it is helpful against dangerous setup sweepers that may run Lum Berry, such as Dragonite and Garchomp.</p> </li> <li> <p>Slack Off may seem like an obvious choice to make a defensive Pokemon last longer, but Hippowdon is often more focused on support than walling, so Slack Off doesn't fit every team.</p> </li> <li> <p>Rock Tomb not only provides helpful speed control, but also pops Air Balloon on foes Hippowdon would otherwise struggle with, such as Gholdengo.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Grass</strong>: Hippowdon doesn't Terastallize often, but a Grass Tera type does help it against Breloom and Water-types such as Rotom-W.</li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Def / 252 SpD with Careful: Patching up Hippowdon's weaker Special Defense is quite useful against special attackers, such as having a 6.3% chance of surviving Gholdengo's +2 Make It Rain, and Choice Specs Hydreigon no longer being able to 2HKO Sitrus Berry Hippowdon. </li> <li> <p><strong>252 HP / 252 Def / 4 SpD with Impish: A physically defensive spread means not even Choice Band Tera Dragon Dragapult will be able to 2HKO Sitrus Berry Hippowdon.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Magnezone": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/magnezone.3713246/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Choice Specs Attacker",
        "description": "<ul> <li> <p>In a metagame with very few special attackers, Magnezone carves a strong niche as an Electric-type attacker that can take out the common physical walls, such as Dondozo and Corviknight.</p> </li> <li> <p>Magnezone’s STAB combination is difficult to switch into, especially with Choice Specs. Clodsire, the most noteworthy special wall in the format, can fall to an Analytic-boosted Flash Cannon or Steel Beam.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: A Fairy-type Tera Blast is very useful against common Dragon-types, most notably Garchomp.</p> </li> <li> <p><strong>Fighting: Gaining a resistance to Dark allows Magnezone to surprise and defeat Kingambit and Hydreigon, ignoring the former's Sucker Punch.</p> </li> <li> <p><strong>Grass: Grass has excellent defensive and offense synergy with Magnezone, especially through its utility against Ground-type attackers and Spore immunity. Most notably, Tera Blast Grass can OHKO max SpD Hippowdon with Choice Specs. However, many Pokemon tend to run Tera Fire, such as Azumarill and Garchomp, so Grass is less popular.</p> </li> <li> <p><strong>Flying: Flying has wonderful defensive synergy with Magnezone, reversing its Ground and Fighting weaknesses, and lets Tera Blast hit Grass-types harder.</p> </li> <li> <p><strong>Water</strong>: Offensively, Water serves a similar role to Grass, letting Tera Blast nail Ground-types. Water lacks a Ground resistance or a Spore immunity, but it gives Magnezone a much-appreciated Fire resistance for Pokemon like Skeledirge. Much like in the case of Grass, Tera Blast Water can OHKO Hippowdon, while also having the possibility of KOing Unaware Clodsire, although the risk it runs when considering Water Absorb should be noted.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 SpA / 4 SpD / 252 Spe with Modest: Running at least some Speed investment lets Magnezone outspeed critical Pokemon like Azumarill, Corviknight, Skeledirge, and Kingambit. 252 EVs give Magnezone a chance at outspeeding slow Mimikyu, Dragonite, Gholdengo, and Annihilape.</p> </li> <li> <p><strong>188 HP / 252 SpA / 60 Spe with Modest: Magnezone's excellent typing means you often switch it into attacks, especially if you aren’t using Sturdy as an ability. This spread sacrifices some of Magnezone's Speed to raise its capabilities as a pivot. However, reducing the Speed EVs below 60 is not recommended, as it is the minimum required line to outspeed an uninvested Corviknight.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Analytic</strong>: A Magnezone boosted by both Choice Specs and Analytic is incredibly hard to switch into, making it easier for Magnezone to generate momentum.</p> </li> <li> <p><strong>Sturdy</strong>: With Sturdy's guaranteed survivability and Magnezone's high damage output, Magnezone will very likely take down at least one Pokemon per game. Sturdy also helps Magnezone play around Dondozo, as it can safely come in on Fissure and use Volt Switch against it, which renders Yawn moot. However, if Magnezone switches into a Yawn and not Fissure, it should be noted that Dondozo often runs Protect to block Volt Switch and ensure Magnezone falls asleep.</p> </li> <li> <p><strong>Magnet Pull</strong>: Magnet Pull ensures Magnezone can eliminate Corviknight. In the case Magnezone uses Fighting as its Tera Type, Magnet Pull also allows it to beat both Kingambit and Tera Steel Hydreigon with more reliability.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 613881, "username": "Tachipoyo"}]}
  },
  "Rotom-Heat": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/rotom-h.3712160/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Choice Attacker",
        "description": "<ul> <li> <p>Rotom-H sets itself apart from other Fire-types, with its Ground immunity and Volt Switch pivoting.</p> </li> <li> <p>Trick gives Rotom-H an excellent tool against defensive foes, such as Dondozo and Skeledirge.</p> </li> <li> <p>Make sure to get a Rotom-H with a neutral nature and then use a Timid Mint on it. This way, it can't be confused by any Berries given with Trick.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Electric: Electric is an easy Tera type to recommend, as it increases damage output and removes all of Rotom-H's weaknesses.</p> </li> <li> <p><strong>Fairy</strong>: A Fairy Tera typing with Tera Blast makes Rotom-H much better equipped to handle normally problematic Dragon-types, such as Garchomp and Dragapult.</p> </li> <li> <p><strong>Fire: When paired with Tera Blast, Rotom-H now has a much more reliable Fire-type STAB move than Overheat, at the cost of retaining several problematic weaknesses.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Rotom-Wash": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/rotom-w.3712166/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Choice Attacker",
        "description": "<ul> <li> <p>Rotom-W's Speed, which notably allows it to outpace Gholdengo, access to Volt Switch, and great typing make it an excellent pivot and revenge killer.</p> </li> <li> <p>Trick is seriously worth considering for its ability to cripple defensive Pokemon such as Garganacl and Dondozo.</p> </li> <li> <p>If using Trick, make sure Rotom-W is a neutral nature that has had a Timid Mint used on it. This way, Rotom-W can eat any Berry without getting confused.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Electric: Not only does the damage boost from Tera Electric come in handy, but it also removes any weaknesses Rotom-W has.</p> </li> <li> <p><strong>Fairy</strong>: When combined with Tera Blast, a Fairy Tera type lets Rotom-W take on Dragon-types such as Dragapult and Hydreigon far more effectively.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Scarf: Choice Scarf lets Rotom-W outspeed major threats such as Dragapult and Meowscarada.</p> </li> <li> <p><strong>Choice Specs: Choice Specs tends to be safer to Trick than Choice Scarf, and it gives a big power boost.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 SpA / 252 Spe</strong>: Maximizing Rotom-W's Special Attack is part of what makes it an effective revenge killer.</p> </li> <li> <p><strong>252 HP / 4 SpD / 252 Spe</strong>: This spread sacrifices Rotom-W's revenge killing potential, but, in exchange, it makes it a better pivot, and the better bulk makes Rotom-W more suited to finding the right time to cripple a wall with Trick.</p> </li> </ul> "
      },
      {
        "name": "Nasty Plot",
        "description": "<ul> <li> <p>With a great typing, ability, and good bulk, Rotom-W makes for an effective user of Nasty Plot.</p> </li> <li> <p>Tera Blast is usually used with Terastallization, but even beforehand, it provides a neutral attack to hit most Dragon-types with.</p> </li> <li> <p>If using an Electric Tera type, Dark Pulse is Rotom-W's best option against Dragapult.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: With a Fairy Tera type, Rotom-W can turn the tables on its Dragon-type adversaries.</p> </li> <li> <p><strong>Electric</strong>: In addition to boosting the power of Electric-type attacks, all of Rotom-W's weaknesses are removed.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Lum Berry</strong>: Lum Berry lets Rotom-W easily set up on Hippowdon, and avoid getting put to sleep by Dondozo.</p> </li> <li> <p><strong>Sitrus Berry: If Sleep isn't a big issue, Rotom-W appreciates the burst recovery Sitrus Berry provides.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 SpA / 252 Spe</strong>: Maximizing Speed with a Timid nature gives Rotom-W the jump on Gholdengo. If Gholdengo isn't an issue, a Modest nature will still outspeed Jolly Breloom.</p> </li> <li> <p><strong>252 HP / 252 SpA / 4 SpD with Modest: Rotom-W's good bulk can be maximized instead of outspeeding Breloom; this spread avoids the 2HKO from Timid Gholdengo's Shadow Ball.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Amoonguss": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/amoonguss.3712208/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<ul> <li> <p>With good bulk, a solid defensive typing, and access to Spore, Clear Smog, and Regenerator, Amoonguss is a fantastic support and disruptor option.</p> </li> <li> <p>Clear Smog prevents Amoonguss from getting set up on unless the opponent is Steel-type or has a Substitute up.</p> </li> <li> <p>Hex both punishes foes put to sleep by Spore and hits Air Balloon Gholdengo.</p> </li> <li> <p>Stomping Tantrum gets around Assault Vest Gholdengo.</p> </li> </ul> <h1>Items</h1> <p><strong>Leftovers</strong>: Leftovers gives Amoonguss longevity outside of Synthesis and Regenerator.</p> <ul> <li> <p><strong>Black Sludge: Black Sludge is a great way to get around Item Clause if Leftovers is already in use. Note, if Amoonguss Terastallizes into a type that isn't Poison, it will take damage instead.</p> </li> <li> <p><strong>Sitrus Berry</strong>: Sitrus Berry is an alternative form of recovery, and it can be used regardless of Amoonguss's Tera type.</p> </li> <li> <p><strong>Rocky Helmet</strong>: Rocky Helmet punishes contact moves with residual damage, potentially breaking Focus Sash in the process.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dark</strong>: While Amoonguss doesn't Terastallize often, Dark removes its weakness to Psychic-type attacks and makes Foul Play stronger, at the cost of gaining new weaknesses.</p> </li> <li> <p><strong>Poison</strong>: Poison removes Grass-type weaknesses, but makes Amoonguss weak to Ground-type attacks.</p> </li> <li> <p><strong>Steel</strong>: While it makes Amoonguss weak to Ground- and Fighting-type attacks, it also grants Amoonguss with a plethora of resistances, and it can be a tough Pokemon to break once foes like Breloom are KOed.</p> </li> </ul> "
      },
      {"name": "Pivot", "description": "<p><a href=\"https://www.smogon.com/forums/threads/pivot-amoonguss-gp-0-1.3713158/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 330577, "username": "Thick Fat Azumarill"}]}
  },
  "Haxorus": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/haxorus.3713233/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Mold Breaker Funny Moments Compilation",
        "description": "<ul> <li> <p>With its workable Speed, sky-high Attack stat, and the ever-valuable Mold Breaker, Haxorus is notable as one of the few setup sweepers not bothered by Mimikyu or Unaware.</p> </li> <li> <p>With one Dragon Dance, it can outspeed most unboosted foes, but Choice Scarf users still cause issues, notably Hydreigon and Play Rough Meowscarada.</p> </li> <li> <p>Dragon Claw may be worth using in place of Outrage to avoid locking Haxorus in.</p> </li> <li> <p>Earthquake is extremely valuable on Haxorus due to Mold Breaker nullifying Levitate and Earth Eater, allowing Haxorus to hit foes like Rotom-W and Hydreigon hard without the need to lock into Outrage, and giving it a way to hit Orthworm hard at all</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Life Orb: Life Orb lets Haxorus deal damage much more effectively at the cost of recoil</p> </li> <li> <p><strong>Lum Berry</strong>: Lum Berry lets Haxorus safely set up against a foe that may use crippling status moves such as Will-O-Wisp and Spore.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel</strong>: Steel grants good security against opposing Ice-, Fairy-, and Dragon-types.</p> </li> <li> <p><strong>Fairy</strong>: Fairy maximizes Haxorus's security against opposing Dragon-types, specifically.</p> </li> <li> <p><strong>Electric</strong>: Electric provides a surefire way of dealing with Dondozo thanks to Tera Blast.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality Checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar Checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 505592, "username": "smushedtomato"}]}
  },
  "Hydreigon": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/hydreigon.3712183/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "HARBINGER",
        "description": "<ul> <li> <p>With its high power and great STAB combination, Hydreigon makes for a formidable attacker.</p> </li> <li> <p>Tera Blast can be used in tandem with an Electric Tera type to deal heavy damage to Dondozo.</p> </li> <li> <p>Flamethrower is useful for hitting Steel-types such as Scizor and otherwise decent Dark Pulse switch-ins like Meowscarada.</p> </li> <li> <p>Flash Cannon is Hydreigon’s best option to hit Fairy-types such as Mimikyu.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Scarf: Choice Scarf patches up Hydreigon’s somewhat lackluster Speed, allowing it to threaten a wider portion of the metagame with its high-powered attacks.</p> </li> <li> <p><strong>Choice Specs</strong>: If your team has another Scarf user, Choice Specs Hydreigon is a nuclear wallbreaker that can pummel unsuspecting teams.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Electric</strong>: Thanks to Levitate and a Tera type of Electric, Hydreigon lacks any sort of weaknesses, and gains a powerful Tera Blast to hit Dondozo with, being able to break past it without fearing Fissure.</p> </li> <li> <p><strong>Dark</strong>: Tera-boosted Dark Pulse is an absurdly powerful weapon, and when coupled with its flinch rate, Tera Dark Hydreigon can potentially muscle its way out of otherwise hopeless situations.</p> </li> <li> <p><strong>Steel</strong>: A Steel Tera type can be used to get around the many Dragon and Fairy-types that try to revenge kill Hydreigon, though it is still vulnerable to Mach Punch from Breloom.</p> </li> <li> <p><strong>Fire: Terastallizing into the fire typing will grant Hydreigon a resistance to Fairy-types while removing its weakness to Fighting-types and giving it a good move to hit Steel-types with. However, unlike Tera Steel it does not grant a resistance to Dragon, and it also gives Hydreigon a few new weaknesses.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Volcarona": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/volcarona.3712196/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Quiver Dance Sweeper",
        "description": "<ul> <li> <p>With Flame Body, several physical attackers like Annihilape, Meowscarada, and Mimikyu can be crippled on contact, which helps a lot.</p> </li> <li> <p>Quiver Dance lets Volcarona sweep, alongside the possibility of Fiery Dance further boosting Special Attack. Fire Blast can be used if greater damage output is wanted.</p> </li> <li> <p>Giga Drain is the best coverage option for Volcarona, as it helps it deal with Water-type Pokémon, as well as recover a good amount of HP.</p> </li> <li> <p>Water-type Tera Blast helps Volcarona deal with Pokemon like Skeledirge, Ceruledge, and other Volcarona. Volcarona with Bug Buzz can also be used, as it is a very powerful STAB move and helps Volcarona deal with Hydreigon.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Water: Terastallizing into the Water typing nullifies Volcarona's most common weakness in Rock-type. Tera Blast damages Hydreigon decently prior to Terastallizing. Water-type Tera Blast is also the best option Volcarona has to hit Skeledirge.</p> </li> <li> <p><strong>Grass</strong>: The Grass typing strengthens Giga Drain and nullifies Volcarona's weakness to Water-types, most notably helping against Dondozo and Rotom-W.</p> </li> <li> <p><strong>Fire: Terastallizing into Fire typing makes Volcarona's Fire Blast even more powerful.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Heavy-Duty Boots</strong>: It is the best option on Volcarona, as it circumvents its crippling Stealth Rock weakness.</p> </li> <li> <p><strong>Sitrus Berry</strong>: Sitrus Berry helps Volcarona accrue boosts more easily with Quiver Dance and lets it avoid being 2HKOed by Mimikyu and Dragonite.</p> </li> <li> <p><strong>Life Orb: This is the most reliable tool for helping Volcarona sweep in the late-game.</p> </li> </ul> "
      },
      {"name": "Bulkarona", "description": "<p><a href=\"https://www.smogon.com/forums/threads/bulky-volcarona-gp-0-1.3712860/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> "},
      {"name": "SOLAR FLARE (choice item)", "description": "<p><a href=\"https://www.smogon.com/forums/threads/volcarona-choice.3712974/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 469498, "username": "luisin"}]}
  },
  "Sylveon": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/sylveon.3712370/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "CUTESY CRUSADER (Defensive)",
        "description": "<ul> <li> <p>With its good bulk and Special Attack, Sylveon is quite a dangerous threat and is also hard to take down.</p> </li> <li> <p>With the boost from Pixilate, Hyper Voice becomes Sylveon’s best option for STAB, notably bypassing Substitute.</p> </li> <li> <p>A Fire-type Tera Blast provides excellent coverage against the many Steel-types that try to take advantage of Sylveon.</p> </li> <li> <p>Wish can be used to keep Sylveon healthy, as well as its teammates.</p> </li> <li> <p>Shadow Ball offers important coverage on Gholdengo without demanding that Sylveon Terastallize.</p> </li> <li> <p>Quick Attack, though weak, can be very helpful for finishing off foes that have hung on against Sylveon or its teammates, and thanks to Pixilate, Ghost-types cannot safely switch in to absorb the move.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Fire</strong>: Beyond improving Tera Blast, a Fire Tera type grants Sylveon resistances to Steel and Fairy, allowing it to take on foes it would otherwise have to run from, such as Gholdengo.</li> </ul> "
      },
      {
        "name": "Offensive",
        "description": "<ul> <li> <p>With its good natural bulk, Sylveon can serve as a potent attacker and decent revenge killer.</p> </li> <li> <p>Thanks to Pixilate, Hyper Voice is Sylveon’s best STAB option, notably bypassing Substitute.</p> </li> <li> <p>Tera Blast serves as a good alternate STAB attack once Sylveon has Terastallized, providing highly valuable coverage against the Steel-types that could otherwise exploit it, like Scizor.</p> </li> <li> <p>Shadow Ball hits foes such as Mimikyu and Gholdengo super effectively, and it means Sylveon does not have to Terastallize to hit Gholdengo for good damage.</p> </li> <li> <p>Though it is weak, Quick Attack gives valuable priority for picking off weakened threats, and thanks to Pixilate, surprise users of Tera Ghost aren't able to absorb it.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Assault Vest: Assault Vest lets even offensive Sylveon be specially resilient, but it doesn't allow Wish or Yawn to be used.</p> </li> <li> <p><strong>Choice Specs</strong>: With the boost from Choice Specs, Sylveon is a surprisingly potent wallbreaker, making the most out of its many opportunities to switch in.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Def / 252 SpA</strong>: This spread capitalizes on Sylveon's good natural bulk while maximizing its power.</p> </li> <li> <p><strong>4 Def / 252 SpA / 252 Spe</strong>: While no bulk investment makes Sylveon more difficult to safely get in, Speed investment allows it to outrun and threaten a wider range of foes, such as Scizor and Corviknight.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Mimikyu": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/mimikyu.3712157/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<ul> <li> <p>Thanks to Disguise, Mimikyu is a premier revenge killer and sweeper in Battle Stadium Singles!</p> </li> <li> <p>Tera Blast is a risky option due to making your team commit to Terastallizing Mimikyu, but it can be worth it for muscling through Mimikyu's usual checks, such as Corviknight and Tera Steel Pokemon.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost: The extra damage on Shadow Sneak gives Mimikyu an easier time sweeping late-game.</p> </li> <li> <p><strong>Fire</strong>: With Tera Blast, Jolly Mimikyu has a 75% chance to OHKO Corviknight after Swords Dance, which means most other Steel-types will have a far more difficult time dealing with Mimikyu.</p> </li> <li> <p><strong>Electric</strong>: While not as effective against Steel-types as Tera Fire, it still deals massive damage to Corviknight, comma and gives Mimikyu better chip damage to Dondozo.</p> </li> <li> <p><strong>Normal: Tera Normal doesn't help Mimikyu offensively and makes Mimikyu vulnerable to Mach Punch and Dragon Darts, making it a niche option. However, it does severely punish Dragapult if it uses Phantom Force.</p> </li> </ul> "
      },
      {"name": "Curse Stall", "description": "<ul> <li> <p>The combination of Curse, Substitute, and Pain Split is devastating against key defensive Pokemon such as Garganacl and Dondozo.</p> </li> <li> <p>Shadow Claw is Mimikyu's best shot at dealing damage to Gholdengo, at the cost of doing poorly against Normal-types.</p> </li> <li> <p>Play Rough is Mimikyu's strongest STAB move, though it will make Mimikyu nearly helpless against Gholdengo.</p> </li> <li> <p>Taunt does an even better job of shutting down defensive foes, but makes Mimikyu totally useless against Gholdengo.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost or Fairy: Terastallizing this Mimikyu for extra damage output is fairly situational, but getting a bit of extra power can help late game.</p> </li> <li> <p><strong>Flying</strong>: Against common users of Fissure such as Dondozo, this gives Mimikyu a situational way to stall them out more easily while healthy.</p> </li> </ul> "},
      {
        "name": "Trick Scarf",
        "description": "<ul> <li> <p>Mimikyu might seem like an odd user of Choice Scarf with its low offenses, but with Trick and Disguise, it becomes a very disruptive Pokemon against defensive foes like Dondozo and Corviknight.</p> </li> <li> <p>Shadow Sneak is a reasonable option to give Mimikyu priority after using Trick.</p> </li> <li> <p>Wood Hammer hits Water-types such as Rotom-W very hard.</p> </li> <li> <p>Thunder Wave or Will-O-Wisp let Mimikyu further disrupt Pokemon after using Trick, or can be used as an emergency way to stop a sweeper while still holding Choice Scarf.</p> </li> <li> <p>Mimikyu should have a neutral nature with a Jolly Mint used on it. This way, Mimikyu can't be confused by eating any Berry after using Trick.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost: Tera Ghost gives Mimikyu a good chance to OHKO Dragapult with Shadow Claw.</p> </li> <li> <p><strong>Grass: With Wood Hammer being boosted, Mimikyu OHKOes offensive Rotom-W.</p> </li> <li> <p><strong>Normal</strong>: While this makes Mimikyu far more vulnerable to Breloom, it is useful for catching other Ghost-types off guard.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Corviknight": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/corviknight.3712164/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Pivot Knight",
        "description": "<ul> <li> <p>Corviknight's fantastic typing makes it one of the best pivots in the metagame; it easily gets dangerous teammates such as Hydreigon and Dragapult in.</p> </li> <li> <p>Brave Bird's damage output generally justifies the recoil.</p> </li> <li> <p>Body Press deals much more damage to Kingambit and Electric-types such as Rotom-W but makes Dragapult a problem.</p> </li> <li> <p>Rocky Helmet lets Corviknight wear down physical threats more quickly while pivoting.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p>Corviknight's defensive typing is fantastic, so don't Terastallize too hastily and lose to more threats.</p> </li> <li> <p><strong>Dragon: Dragon and Fairy weaknesses are devastating, but in the late-game, resisting Electric and Fire can give Corviknight new win conditions against old foes such as Rotom-W.</p> </li> <li> <p><strong>Flying</strong>: Boosting Brave Bird's damage output is nice, but the secret to the Flying Tera type is that Corviknight will no longer be vulnerable to Fissure while it uses Roost.</p> </li> <li> <p><strong>Grass</strong>: Grass improves matchups against Rotom-W and Breloom significantly.</p> </li> </ul> "
      },
      {
        "name": "IronPress",
        "description": "<ul> <li> <p>Corviknight stands out as one of the best choices around for a defensive Steel-type, thanks to recovery and Body Press.</p> </li> <li> <p>Taunt lets Corviknight effectively shut down slower defensive Pokemon, such as Dondozo.</p> </li> <li> <p>Iron Head helps Corviknight check Mimikyu more easily, especially if not running Rocky Helmet.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p>Corviknight has a fantastic defensive typing, so only Terastallize if you need to win certain matchups, especially since it becomes vulnerable to Toxic.</p> </li> <li> <p><strong>Flying: A Flying Tera type lets Corviknight retain its Flying typing even when using Roost, making it a more reliable check to Fissure users such as Dondozo and Garganacl.</p> </li> <li> <p><strong>Fighting: With a Fighting Tera type, Body Press is easier to sweep with, as long as troublesome Fairy-types such as Mimikyu are removed.</p> </li> <li> <p><strong>Grass</strong>: Tera Grass Corviknight not only handles Rotom-W better, but can set up on Breloom.</p> </li> <li> <p><strong>Dragon: A Dragon Tera type lets Corviknight resist common attacks aimed at it, such as Electric- and Fire-type attacks. However, the new weaknesses to Fairy and Dragon make this a reactive Terastallization.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Rocky Helmet</strong>: The passive damage from Rocky Helmet against Mimikyu gives Corviknight a much easier time using Taunt over Iron Head.</p> </li> <li> <p><strong>Leftovers</strong>: Corviknight tends to stick around, so Leftovers recovery makes sense over a Berry.</p> </li> </ul> "
      },
      {
        "name": "Bulk Up",
        "description": "<ul> <li> <p>With Bulk Up giving an Attack boost, Corviknight is free from having to use Body Press for good damage output.</p> </li> <li> <p>Taunt is highly recommended for shutting down Garganacl and Dondozo.</p> </li> <li> <p>Iron Head is chosen for both reliable damage output and hitting Fairy-types hard.</p> </li> <li> <p>Power Trip takes several boosts to get powerful, but it's Corviknight's best shot at dealing decent damage to Gholdengo, being able to break its Substitute after Bulk Up.</p> </li> <li> <p>Covert Cloak makes Corviknight immune to Salt Cure's residual damage, making Corviknight a good check to Garganacl.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p>Remember that most of Corviknight's good Tera types leave it vulnerable to Toxic, so Terastallize carefully.</p> </li> <li> <p><strong>Dark: While it doesn't help Corviknight much defensively, a Dark Tera type lets it 2HKO 4 HP Gholdengo with Power Trip after one use of Bulk Up.</p> </li> <li> <p><strong>Flying</strong>: This Tera type lets Corviknight retain its Flying typing while using Roost, meaning Fissure users such as Dondozo are much easier to handle.</p> </li> <li> <p><strong>Steel</strong>: A Steel Tera type boosts Iron Head and removes Corviknight's Electric weakness, at the cost of making it vulnerable to Earthquake.</p> </li> <li> <p><strong>Dragon</strong>: Once Fairy- and Dragon-types are out of the way, the Dragon Tera type allows Corviknight to get around Electric- and Fire-type attacks.</p> </li> <li> <p><strong>Grass-type</strong>: A Grass Tera type is Corviknight's best way of setting up on Breloom and handling Rotom-W.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 534158, "username": "Kiby"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 517429, "username": "Adeleine"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Grimmsnarl": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/grimmsnarl.3712163/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<ul> <li> <p>With Prankster and the movepool to use it, Grimmsnarl is one of the best dual screens setters, as it is useful for setting up dangerous sweepers such as Dragonite.</p> </li> <li> <p>Parting Shot is not only useful for dropping stats, but the pivoting action can let Grimmsnarl come in later to set up screens if it's in a bad matchup.</p> </li> <li> <p>Thunder Wave is a reasonable alternative for crippling fast foes that may be problematic for sweeps.</p> </li> <li> <p>Taunt shuts down phazers and opposing Taunts that could stop the dual screens from being set up.</p> </li> <li> <p>Spirit Break hits Dragon-types, making it a good offensive move.</p> </li> <li> <p>Alternatively, Foul Play is notable for breaking Gholdengo's Substitute and punishing physical setup sweepers.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Grass</strong>: Grimmsnarl should almost never Terastallize, since it's trying to support sweepers rather than deal serious damage on its own. Still, a Grass Tera type is a reasonable choice for blocking Spore from Breloom and Amoonguss.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Dragapult": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/dragapult.3712153/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Physical Attacker",
        "description": "<ul> <li> <p>Dragapult's incredible Speed makes it a very effective hit-and-run attacker.</p> </li> <li> <p>Phantom Force is risky due to the two turns making Dragapult vulnerable to Normal-types and surprise Terastallization, but lack of many strong Ghost-resistant foes makes it an effective late-game cleaning move.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dragon and Ghost</strong>: Terastallizing into either of Dragapult's STAB types makes it even more difficult to wall, with Ghost being notable for letting Dragapult use a less risky STAB move in Tera Blast.</p> </li> <li> <p><strong>Fire</strong>: Tera Fire gives a valuable Fairy-type resistance and is a more powerful tool against Steel-types at the cost of a Stealth Rock weakness.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Band</strong>: Choice Band guarantees that Breloom is OHKOed through its Focus Sash with Dragon Darts.</p> </li> <li> <p><strong>Life Orb: Life Orb makes Sucker Punch a less risky option.</p> </li> <li> <p><strong>Choice Scarf</strong>: This may seem like overkill, but Choice Scarf gives Dragapult the edge over other Choice Scarf foes, such as Hydreigon and Gholdengo.</p> </li> </ul> "
      },
      {
        "name": "Dragon Dance",
        "description": "<ul> <li> <p>Despite Dragapult's insane Speed stat, Dragon Dance insulates it from popular Choice Scarf revenge killers such as Gholdengo, making it a great sweeper.</p> </li> <li> <p>Phantom Force's drawback can be an issue when Normal-types are potentially around, but its great coverage still makes it good way to clean teams.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dragon: Not only does this make Dragon Darts difficult to wall, but it clinches a OHKO on Breloom regardless of the item.</p> </li> <li> <p><strong>Steel: Steel covers a lot of Dragapult's former weaknesses, letting it set up on new foes such as Mimikyu.</p> </li> <li> <p><strong>Fire: Not only does this make Fairy-types easier to deal with, but it can help Dragapult sweep through defensive Steel-types such as Corviknight with Tera Blast.</p> </li> <li> <p><strong>Ghost: Terastallizing into a Ghost-type gives Dragapult the option for a much more reliable STAB move in Tera Blast, at the cost of not helping it set up against new threats.</p> </li> </ul> "
      },
      {"name": "Special Attacker", "description": "<ul> <li> <p>Draco Meteor and Shadow Ball give Dragapult high-powered and reliable STAB attacks, respectively.</p> </li> <li> <p>Thunderbolt is the recommended coverage move for hitting Corviknight and Dondozo hard.</p> </li> <li> <p>Even though it's weak, U-turn is a reasonable consideration for pivoting and breaking Mimikyu's Disguise.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost: The stronger Shadow Ball makes this Dragapult difficult to wall outside of Normal-types and Ghost resistant foes such as Garganacl.</p> </li> <li> <p><strong>Fire: The Fairy-type resistance and powerful Flamethrower can make the Stealth Rock weakness worth it.</p> </li> <li> <p><strong>Electric</strong>: Tera Electric Dragapult still deals plenty of damage to Corviknight, while being less vulnerable to Dondozo's Water-type attacks compared to a Fire Tera type.</p> </li> </ul> "},
      {
        "name": "Bulky Status",
        "description": "<ul> <li> <p>With usable bulk bolstered by Will-O-Wisp, this Dragapult can severely punish its weaker offensive checks.</p> </li> <li> <p>Disable makes Dragapult rely on Will-O-Wisp for Normal-types, but when combined with Substitute, it defeats Choice-locked foes and those that rely on one specific move to beat Dragapult.</p> </li> <li> <p>Draco Meteor improves Dragapult against other Dragon-types, particularly Hydreigon and itself.</p> </li> <li> <p>Flamethrower lets Dragapult deal decent unconditional damage to Steel-types, with Kingambit being the biggest target.</p> </li> <li> <p>Surf is decent coverage, but its main niche is with Tera Water to hit foes that may Terastallize into a Fire-type to block Will-O-Wisp, such as Garchomp, Annihilape, and Azumarill.</p> </li> <li> <p>Dragon Darts with a Naive nature gives Dragapult a consequence-free Dragon-type attack and decent mixed attacking potential.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel: Steel Tera type is great for general defense and Fairy-types such as Azumarill and Mimikyu.</p> </li> <li> <p><strong>Fairy: With a Fairy Tera type, Dragapult preforms better against most Dragon-types.</p> </li> <li> <p><strong>Water</strong>: Besides being a good defensive typing, a Water Tera type lets Dragapult hit common Tera Fire foes such as Garchomp much harder.</p> </li> </ul> "
      },
      {
        "name": "Dual Screens",
        "description": "<ul> <li> <p>Dragapult's high Speed combined with Reflect and Light Screen make it an effective dual screens lead.</p> </li> <li> <p>Curse reduces Dragapult's HP to get it off the field quickly once it has set up screens. It also forces opponents to use recovery moves or switch out, allowing Dragapult's teammates to get in and set up safely. Curse is Dragapult’s best option to bypass Substitute, Protect, and Mimikyu.</p> </li> <li> <p>Shadow Ball breaks Focus Sash, hits Ghosts like Gholdengo and opposing Dragapult that normally threaten it, and breaks Mimikyu's Disguise. Notably Gholdengo stops Curse with Good as Gold, making Dragapult totally helpless against it if it does not carry Shadow Ball.</p> </li> <li> <p>Alternatively, Dragon Darts can be used for more power to make Dragapult more self-sufficient when it has to stay on the field, and breaks Focus Sash as well. Its dual-hit nature makes it bypass most Substitutes.</p> </li> <li> <p>Will-O-Wisp can be used to cripple physical attackers. In tandem with Reflect, this can be a potent strategy to allow the next Pokemon to set up nearly risk-free.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Ghost / Dragon: Dragapult, as a screens supporter, should not normally Terastallize, but if you are in a bad spot, Ghost and Dragon power up its STAB move of choice.</p> </li> <li> <p><strong>Steel</strong>: A defensive typing like Steel can allow Dragapult to survive certain moves like boosted Cloyster's Icicle Spear and boosted Baxcalibur's Glaive Rush and retaliate.</p> </li> <li> <p><strong>Fairy: A Fairy Tera type is useful for enemy Infiltrator Dragapult's Dragon Darts. However, Dragapult should rarely Tera, as dual screens are best used to support a different Tera Pokemon.</p> </li> </ul> <h1>Items</h1> <ul> <li><strong>Focus Sash</strong>: While Light Clay is standard, Focus Sash nearly guarantees setting at least one screen without having to Terastallize, in the event Dragapult leads off against Choice Scarf users like Gholdengo, Hydreigon, and Meowscarada.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}, {"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}, {"user_id": 619905, "username": "Anchiceratops"}]}
  },
  "Meowscarada": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/meowscarada.3712182/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "CRITTY CAT",
        "description": "<ul> <li> <p>With its good Attack, Speed, and access to Flower Trick and Knock Off, Meowscarada is a potent cleaner cleaner that is also hard to switch into.</p> </li> <li> <p>With its guaranteed critical hit, Flower Trick is a dangerous cleaning move once resistances to it have been sufficiently chipped.</p> </li> <li> <p>Trick can help Choice-locked sets incapacitate an annoying wall, such as Dondozo or Amoonguss, by locking them into a single move. Make sure to use a neutral nature and use a Jolly Mint on Meowscarada, so it won't get confused by eating any Berry after Trick.</p> </li> <li> <p>Low Kick OHKOs Hydreigon and Kingambit if using Protean.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Protean: Protean’s type-shifting allows Meowscarada to make the most of its colorful movepool, particularly on Choice-locked sets, where the limitation to only changing types once is effectively nullified.</p> </li> <li> <p><strong>Overgrow</strong>: If you intend to make use of a Tera type other than Grass or switch moves often, Overgrow is worth considering, as it allows Meowscarada more flexibility with its moves by not changing type and removing STAB from Flower Trick or Knock Off.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Band</strong>: Choice Band boosted Meowscarada hits incredibly hard, and with its naturally high Speed it can serve as a cleaner and a potential wallbreaker.</p> </li> <li> <p><strong>Choice Scarf</strong>: With the Speed offered via Choice Scarf, Meowscarada can threaten otherwise faster foes, such as Dragapult, potentially putting more pressure on offensive teams.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Grass</strong>: While Terastallizing does override Protean, Tera Grass Meowscarada can be used to power through teams ill-prepared for it. Dual screens teams in particular are especially vulnerable to the sheer power of Choice Band-boosted Tera Grass Flower Trick.</li> </ul> "
      },
      {"name": "Focus Sash", "description": "<p><a href=\"https://www.smogon.com/forums/threads/meowscarada-focus-sash.3713165/\">This set is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here</a></p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 528485, "username": "DerpySuX"}]}
  },
  "Skeledirge": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/skeledirge.3712172/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Defensive Gator",
        "description": "<ul> <li> <p>Thanks to Will-O-Wisp, instant recovery, and Unaware, Skeledirge distinguishes itself as one of the premier physical walls.</p> </li> <li> <p>Torch Song is a powerful STAB move that allows Skeledirge to become a potential win condition.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy</strong>: Terastallizing into the Fairy typing removes Skeledirges glaring weakness to Dark and provides an overall superior defensive typing. It also provides a neutral typing for the inevitable Shadow Balls that will be thrown at Skeledirge. With proper timing, Skeledirge can defeat counters meant to deal with it, most notably Gholdengo and Dragapult.</p> </li> <li> <p><strong>Water: A Water Tera type lets Skeledirge take on formerly super effective attacks such as Liquidation, providing a valuable turn to burn the offender. It should be noted that Tera Water tends to be a safer option versus the ubiquitous Gholdengo, as it does not often run Thunderbolt.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 244 Def / 12 Spe with Bold</strong>: The EVs are set to maximize physical bulk with just enough Speed to outpace uninvested Corviknight.</p> </li> <li> <p><strong>220 HP / 164 Def / 4 SpA / 108 Spd / 12 Spe with Calm: This EV spread allows both Tera Fairy and Water Skeledirge to avoid a 2HKO from a plethora of offensive threats, such as Modest Gholdengo, Adamant Azumarill, and Choice Specs Dragapult, while still boasting significant physical bulk. With this spread, alternative move slot choices such as Encore and Substitute become viable and allow Skeledirge to wreak havoc on slower defensive and balance teams.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 62165, "username": "StarkGod"}]}
  },
  "Lokix": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/lokix-gp-0-1.3713436/\">This analysis is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> ", "sets": [{"name": "Tinted Offense"}]},
  "Pawmot": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/pawmot.3712965/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Offensive Revival Blessing",
        "description": "<ul> <li> <p>Pawmot has high offensive stats and the revolutionary power to revive a teammate, giving it unique utility in an offensive Pokemon.</p> </li> <li> <p>Double Shock and Close Combat are its most important attacks, but note that it can only use Double Shock once without Terastalizing. Once Terastilized, Pawmot you can use Double Shock continuously for big damage, even on foes that resist it.</p> </li> <li> <p>Mach Punch allows Pawmot to revenge kill better, hitting Meowscarada, Choice Scarf Hydreigon, and Tera Steel Dragapult super effectively.</p> </li> <li> <p>Ice Punch gives Pawmot coverage against Ground-types, most notably Clodsire and Garchomp, in addition to hitting Dragapult for lots of damage.</p> </li> <li> <p>Nuzzle paralyzes foes, and it's notably one of the few ways to inflict paralysis on Gholdengo. This move is best when used with a Focus Sash, as Pawmot can paralyze the foe and outspeed it the next turn, getting another move off before it faints.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Iron Fist: This boosts the power of Mach Punch and Ice Punch, giving Pawmot more powerful priority and coverage.</p> </li> <li> <p><strong>Volt Absorb</strong>: Volt Absorb's Electric immunity stops Magnezone, Rotom-W, and Rotom-H from using Volt Switch to create safe switch-ins.</p> </li> <li> <p><strong>Natural Cure: This allows Pawmot to take status moves more freely, such as Yawn from Dondozo or Will-o-Wisp from Skeledirge.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Life Orb: Life Orbs enables easier revenge kills at the cost of recoil.</p> </li> <li> <p><strong>Magnet</strong>: Magnet will power up Double Shock without the recoil from Life Orb, and it also frees up Life Orb for a teammate to use instead.</p> </li> <li> <p><strong>Focus Sash</strong>: Focus Sash trades the damage boost from the other items for better opportunities to use Revival Blessing and Nuzzle.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Electric</strong>: An Electric Tera Type allows Pawmot to continuously use Double Shock, making it an effective late-game cleaner.</li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality Checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 11020, "username": "Blackbeltsam"}]}
  },
  "Garganacl": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/garganacl.3712150/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Defensive",
        "description": "<ul> <li> <p>With Purifying Salt making it immune to status and Salt Cure providing useful chip damage, especially against Water- and Steel-types, Garganacl is a dangerous defensive setup Pokemon.</p> </li> <li> <p>Body Press is the best option for consistency against offensive teams.</p> </li> <li> <p>Fissure severely punishes passive play against Garganacl, at the cost of forcing it to rely on Salt Cure residual damage against offensive teams.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying</strong>: A Flying typing lets Garganacl take on formerly super effective attacks such as Earthquake and Close Combat while making it a reasonable check to most Breloom.</p> </li> <li> <p><strong>Steel: Terastallizing into a Steel-type stops Amoonguss from clearing its boosts with Clear Smog and makes Garganacl a decent check to Fairy-types such as offensive Mimikyu and Substitute + Calm Mind Flutter Mane.</p> </li> <li> <p><strong>Ghost: A Ghost Tera type gives Garganacl an immunity to Body Press, giving it the edge against Corviknight and opposing Garganacl, especially when paired with Leftovers.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 SpD / 4 Spe with Careful: If using Tera Flying Garganacl, maximizing Special Defense is the best choice for easier setup.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe with Impish</strong>: In addition to powering up Body Press, a focus on Defense makes setting up on powerful setup sweepers such as Dragonite an easier task.</p> </li> <li> <p><strong>252 HP / 84 Def / 172 SpD with Careful: This EV spread allows Tera Steel Garganacl to avoid a 2HKO from Breloom's Mach Punch after Iron Defense.</p> </li> </ul> "
      },
      {
        "name": "Salty Stall",
        "description": "<ul> <li> <p>With some entry hazard support, this Garganacl can be very difficult to outstall, thanks to the constant passive damage from Salt Cure.</p> </li> <li> <p>Protect not only scouts for surprise Tera types, but it also goes well with the passive healing from Leftovers.</p> </li> <li> <p>Substitute makes Garganacl even more difficult to properly switch into, providing protection against Trick, OHKO moves, and opposing Salt Cure.</p> </li> <li> <p>Garganacl's great bulk makes it a prime candidate for fishing with Fissure itself, though its low PP can be an issue in mirror matches.</p> </li> <li> <p>Since this set benefits so much from Stealth Rock support, running it on its own is a reasonable sacrifice if Garganacl needs to be more self-sufficient.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying</strong>: Tera Flying gets rid of the Ground and Fighting weaknesses, and it makes Fissure no longer an issue.</p> </li> <li> <p><strong>Ghost</strong>: While removing Purifying Salt's Ghost resistance is a shame, Tera Ghost does wonderfully against Corviknight and opposing Garganacl due to the Body Press immunity.</p> </li> <li> <p><strong>Steel: Tera Steel gives Garganacl a better matchup against Gholdengo thanks to the Make It Rain resistance.</p> </li> <li> <p><strong>Grass: Tera Grass gives Garganacl a much easier time against Rotom-W and Palafin-H.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 330577, "username": "Thick Fat Azumarill"}, {"user_id": 534158, "username": "Kiby"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Ceruledge": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/ceruledge-gp-0-1.3713072/\">This analysis is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> ", "sets": [{"name": "Sash Attacker"}, {"name": "Bulk Up Sweeper"}]},
  "Bellibolt": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/bellibolt-gp-0-1.3713522/\">This analysis is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> ", "sets": [{"name": "Fat Belli"}, {"name": "Tactical Belli"}, {"name": "Bespectacled Belli"}]},
  "Espathra": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/espathra.3712914/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<ul> <li> <p>With Calm Mind and Speed Boost rapidly increasing Stored Power's damage output, Espathra is a dangerous wincon against bulkier teams, as it even overwhelms Unaware foes.</p> </li> <li> <p>Dazzling Gleam provides coverage against Dark-types such as Hydreigon.</p> </li> <li> <p>Protect is the most reliable way to get a free turn of Speed Boost.</p> </li> <li> <p>Substitute is a riskier option for Speed Boost stalling, but it severely punishes passive Pokemon and works extremely well on dual screen teams.</p> </li> <li> <p>Lumina Crash with Life Orb or Focus Sash is an alternative option for dealing with Unaware foes much more quickly, giving Dondozo fewer chances to use Fissure and sweeping far more quickly, at the cost of being less reliable to set up.</p> </li> <li> <p>The given EV spread allows Espathra to outspeed Meowscarada after one turn of Speed Boost.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy: Fairy Tera type makes setting up on Hydreigon a much more realistic scenario and severely punishes Choice-locked Dragon-types like Dragapult.</p> </li> <li> <p><strong>Fighting: When paired with Tera Blast, Tera Fighting is Espathra's only hope of defeating Kingambit.</p> </li> <li> <p><strong>Dark: Tera Dark provides gives Espathra a valuable Shadow Sneak resistance and does a better shot of defeating weakened Gholdengo.</p> </li> </ul> "
      },
      {
        "name": "Speed Passer",
        "description": "<ul> <li> <p>Espathra is the only option for the coveted Speed Boost + Baton Pass combination, which can be extremely deadly for setting up sweeps!</p> </li> <li> <p>Lumina Crash ensures that Espathra isn't totally shut down by Taunt, and the guaranteed -2 Special Defense drop helps against Unaware walls.</p> </li> <li> <p>While most Pokemon love getting Baton Pass boosts, especially consider Pokemon that resist Espathra's common weaknesses, such as Hydreigon, Sylveon, and Kingambit.</p> </li> <li> <p>The given EV spread outspeeds Choice Scarf Hydreigon after one turn of Speed Boost.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p>Espathra should usually avoid Terastallizing if possible, since its point is to help other Pokemon sweep. Consider these two options as fairly situational.</p> </li> <li> <p><strong>Ghost: Ghost Tera type makes Espartha immune to Extreme Speed, making passing against Dragonite much easier.</p> </li> <li> <p><strong>Normal: With a Normal Tera type, Espartha can set up against its Ghost types and isn't worried about Shadow Sneak anymore.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers</strong>: Leftovers is the easy option to recommend since it pairs well with Protect and Substitute.</p> </li> <li> <p><strong>Sitrus Berry</strong>: Sitrus Berry should be used if Espathra is planning on passing Speed to teammates that want Leftovers, such as Skeledirge and Garganacl.</p> </li> <li> <p><strong>Focus Sash: Focus Sash is the best way to guarantee passing at least one Speed boost, though it's a lackluster option for passing multiple boosts compared to other items.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Palafin": {"overview": "<p><a href=\"https://www.smogon.com/forums/threads/palafin-gp-0-1.3712813/\">This analysis is currently undergoing copyediting. If you would like to see the analysis in its current state, check it out here.</a></p> ", "sets": [{"name": "This looks like a job for Palafin"}]},
  "Glimmora": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/glimmora.3712171/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [{"name": "Debris Lead", "description": "<ul> <li> <p>With a solid early-game Speed tier, utility, high Special Attack, and decent coverage options, Glimmora can set the tone of a battle, sometimes scoring KOs before fulfilling its main role of setting entry hazards.</p> </li> <li> <p>Mud Shot will fail to KO many foes—most notably other Glimmora—but it is a valuable form of speed control that can immediately turn the game in your favor.</p> </li> <li> <p>Memento is a key piece of Glimmora's potential utility, as it immediately makes way for a devastating sweeper to set up against foes with halved offensive stats and potentially lowered Speed.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li><strong>Grass</strong>: A Grass Tera type is an option to absorb Spore from Breloom, but given the set's purpose, this is generally not recommended.</li> </ul> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 62165, "username": "StarkGod"}]}
  },
  "Dondozo": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/dondozo.3712156/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "OHKO Fisher",
        "description": "<ul> <li> <p>With immense bulk, Yawn, and Unaware, Dondozo is not only an impressive defensive Pokemon, but one of the most dangerous OHKO fishers in the game.</p> </li> <li> <p>Despite the recoil, Wave Crash is the prefered option over Liquidation in most cases, purely for the damage output.</p> </li> <li> <p>Protect is not only useful for scouting for unexpected Tera types, but pairs well with Yawn and Leftovers to give Dondozo more longevity.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy</strong>: A Fairy Tera type lets Dondozo take on powerful Dragon-type attacks much more easily, and is just a good defensive typing in general.</p> </li> <li> <p><strong>Grass</strong>: A Grass Tera type is useful enough for covering Dondozo's weaknesses, and the Spore immunity makes it capable of beating Breloom too.</p> </li> <li> <p><strong>Flying: Flying may seem like an odd Tera type, but it can lead to your Dondozo winning mirror matches thanks to the Fissure immunity.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 Def / 252 SpD / 4 Spe</strong>: With Dondozo's massive HP stat, it's still able to take physical hits fairly well with this spread, while making it feasible to Yawn against special attacking threats such as Choice Scarf Hydreigon.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe: This more extreme spread helps against powerful Tera users, with the ability to avoid a 2HKO from Choice Band Tera Dragon Dragapult's Dragon Darts with Leftovers. This comes at the cost of being much more vulnerable to weaker special attackers.</p> </li> </ul> "
      },
      {"name": "Curse", "description": "<ul> <li> <p>With Unaware, Dondozo becomes an effective and difficult to break Curse user.</p> </li> <li> <p>Even with Curse being the point of this set, Dondozo can still effectively fish for OHKOs with Fissure when it's not in a favorable set-up position.</p> </li> <li> <p>Many foes will Terrastallize into a Flying-type to avoid an expected Fissure, which makes Avalanche a particularly useful coverage move.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fairy</strong>: The Dragon immunity that Tera Fairy provides makes setting up on powerful foes like Choice Band Dragapult much easier.</p> </li> <li> <p><strong>Grass: With a Grass Tera Type, Dondozo can effectively set up on Breloom.</p> </li> <li> <p><strong>Flying: If using Fissure, Tera Flying is a good choice for potentially beating other Dondozo.</p> </li> </ul> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Annihilape": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/annihilape.3712195/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Bulky Taunt",
        "description": "<ul> <li> <p>With Vital Spirit, Annihilape can absorb Breloom's Spore; in addition to being immune to Breloom's Mach Punch, it can set up with Bulk Up and then recover the damage taken from Bullet Seed with Drain Punch.</p> </li> <li> <p>Taunt helps you deal with annoying Pokemon like Curse Dondozo, Will-O-Wisp Skeledirge, and Hippowdon, to mention a few, forcing them to attack and boost Rage Fist.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Steel Steel turns Annihilape's Psychic and Fairy weakness into resistances, as well as being an excellent defensive type overall. It lets Annihilape set up freely on Amoonguss, and resisting Flower Trick means Meowscarada has a much harder time revenge killing it.</p> </li> <li> <p><strong>Water: Water doesn't let Annihilape resist one of its weaknesses, but Water is the better general-purpose defensive type. It notably reduces damage from the powerful Choice Band Palafin-H.</p> </li> <li> <p><strong>Flying</strong>: Flying helps a lot to avoid Dondozo's Fissure, forcing it to attack with moves that boost Rage Fist.</p> </li> <li> <p><strong>Fire</strong>: In addition to giving a useful resistance to Fairy attacks, Tera Fire also prevents Will-O-Wisp from hitting.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Covert Cloak</strong>: Covert Cloak makes Annihilape immune to being Salt Cured, making it a great check against Garganacl. It also gives peace of mind, removing potential flinches from Hydreigon's Dark Pulse.</p> </li> <li> <p><strong>Leftovers: Leftovers's residual recovery comes in handy if a different Pokemon is using Covert Cloak.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 4 Def / 252 Spe with Jolly</strong>: Maximum Speed mainly helps Annihilape outspeed Gholdengo and Breloom. With Bulk Up and Rage Fist improving its offense, Annihilape can invest in HP over Attack.</p> </li> <li> <p><strong>252 HP / 252 SpD / 4 Spe with Careful: More special bulk can make it much more difficult for special attackers to revenge kill Annihilape.</p> </li> <li> <p><strong>252 HP / 156 SpD / 100 Spe with Careful</strong>: This EV spread outspeeds Adamant Breloom and Cloyster while still giving Annihilape good special bulk.</p> </li> </ul> "
      },
      {
        "name": "Choice Scarf",
        "description": "<ul> <li> <p>Annihilape has enough Speed to surprise important threats with Choice Scarf, such as Dragapult and Meowscarada.</p> </li> <li> <p>Shadow Claw is weak, but it's a reliable Ghost-type STAB move. If you can manage to get Annihilape into a weak attack, though, Rage Fist has much more reward associated with it.</p> </li> <li> <p>Ice Punch deals massive damage to Garchomp and Dragonite, making them easier to pick off or pressuring them to Terastallize.</p> </li> <li> <p>If using maximum HP, Final Gambit can potentially OHKO major defensive threats if Annihilape is healthy, such as Garganacl and Corviknight.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Fighting: With a Fighting Tera type, Close Combat does outrageous damage, with Rotom-W in particular taking over 90% from it.</p> </li> <li> <p><strong>Ghost: A Ghost Tera type makes Shadow Claw OHKO Dragapult, as well as giving it a 56.3% chance of OHKOing 4 HP Gholdengo.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>4 HP / 252 Atk / 252 Spe: This simple EV spread is best when not using Final Gambit to maximize offensive power.</p> </li> <li> <p><strong>252 HP / 4 Atk / 252 Spe</strong>: While maximizing HP makes Annihilape a less reliable revenge killer, it can effectively sacrifice itself with Final Gambit to get surprise KOs on certain defensive foes, like Corviknight and Garganacl.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Vital Spirit</strong>: The immunity to Spore gives Annihilape a good opportunity to switch into Breloom, and it need not worry about Yawn.</p> </li> <li> <p><strong>Defiant: While Intimidate is not particularly common, punishing that and Speed drops can lead to devastating surprise sweeps.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 29010, "username": "Theorymon"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 469498, "username": "luisin"}, {"user_id": 29010, "username": "Theorymon"}]}
  },
  "Clodsire": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/clodsire.3712165/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>While Clodsire is lacking in physical bulk compared to Dondozo and Skeledirge, it makes up for it in having a fantastic support movepool.</p> </li> <li> <p>Yawn is very effective at forcing switches, which is especially dangerous if Stealth Rock is set up.</p> </li> <li> <p>Poison Jab is Clodsire's best move against Tera Fairy Rotom-W, which is an especially important target when using Water Absorb.</p> </li> <li> <p>Protect, in addition to benefiting from Leftovers, pairs well with Yawn.</p> </li> <li> <p>Body Press isn't particularly strong, but it does prevent Clodsire from being totally walled by Tera Steel Hydreigon if using a physically defensive spread.</p> </li> <li> <p>Black Sludge may seem appealing, but it punishes Clodsire for Terastalliizing unless it becomes Tera Poison, so Leftovers is preferred unless Leftovers is already on something else.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: With a Flying Tera type, Clodsire no longer has to worry about Earthquake or Fissure.</p> </li> <li> <p><strong>Steel</strong>: A Steel Tera type allows Clodsire to take on powerful Dragon-type attacks, without the worry of Gholdengo dealing massive damage.</p> </li> <li> <p><strong>Poison: With Tera Poison, Clodsire not only becomes a better check to Grass- and Water-types such as Meowscarda and Rotom-W, but it can also safely run Black Sludge to punish users of Trick.</p> </li> <li> <p><strong>Fairy</strong>: A Fairy Tera type will stop powerful Dragon-type attacks cold without making Clodsire weak to Earthquake, but it comes at the cost of compromising its ability to check Gholdengo.</p> </li> <li> <p><strong>Dark</strong>: Espathra's Stored Power is a big issue for Clodsire, so Tera Dark can flip the tables on it.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Unaware: If you're planning to use Clodsire to its fullest defensive potential, Unaware is the best bet against setup foes.</p> </li> <li> <p><strong>Water Absorb</strong>: Water Absorb sacrifices overall defensive potential in exchange for being able to wall Rotom-W without needing to Terastallize. If setting up Stealth Rock is important, this can be worth it.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 SpD / 4 Spe with Careful</strong>: Maximizing Special Defense is Clodsire's best hope for handling powerful special attackers such as Choice Specs Hydreigon.</p> </li> <li> <p><strong>252 HP / 252 Def / 4 Spe with Impish</strong>: Clodsire's Defense may be mediocre, but with maximum investment, it can pull stunts such as usually avoiding a 2HKO from Jolly Dragonite's Outrage with Leftovers.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 265677, "username": "Butch Hardnight"}, {"user_id": 528485, "username": "DerpySuX"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Kingambit": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/kingambit.3712328/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<ul> <li> <p>Kingambit sets itself apart from most other Dark-types with its bulk and typing, which make it a reasonable check against Gholdengo that lack Focus Blast.</p> </li> <li> <p>Guillotine makes Kingambit far more difficult to wall with foes such as Dondozo.</p> </li> <li> <p>Brick Break is rather weak, but it helps against opposing Kingambit.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dark: A Dark Tera type makes Kingambit even harder to wall and removes its irritating Ground weakness.</p> </li> <li> <p><strong>Flying</strong>: This Tera type covers Kingambit's issues with Fighting- and Ground-type attacks very well.</p> </li> <li> <p><strong>Fairy</strong>: With a Fairy Tera type, Kingambit gains a resistance to Fighting and can still deal with Dragon-types, but it becomes vulnerable to Gholdengo.</p> </li> </ul> <h1>Abilities</h1> <ul> <li> <p><strong>Supreme Overload</strong>: This is generally the more consistent ability since Intimidate foes are not very common.</p> </li> <li> <p><strong>Defiant</strong>: Defiant is still useful for punishing speed control options such as Rock Tomb, especially alongside Sucker Punch.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 Atk / 4 Spe</strong>: This simple spread maximizes bulk and power.</p> </li> <li> <p><strong>108 HP / 252 Atk / 148 Spe</strong>: This EV spread has enough Speed to outspeed most Corviknight and Skeledirge, and it still has enough bulk to survive one unboosted Body Press from Corviknight. Since this is a fairly congested Speed range, feel free to move some Attack EVs to Speed.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Black Glasses: While its boost to Dark-type attacks isn't as high as Life Orb's, Black Glasses is a better fit for Kingambit's bulk due to the lack of recoil.</p> </li> <li> <p><strong>Sitrus Berry</strong>: The burst of recovery helps Kingambit check Gholdengo better.</p> </li> <li> <p><strong>Assault Vest</strong>: Assault Vest makes Kingambit a better check against Gholdengo and Hydreigon.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 330577, "username": "Thick Fat Azumarill"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Baxcalibur": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/baxcalibur.3712151/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<ul> <li> <p>With good bulk, an immunity to burn, and just enough Speed to work, Baxcalibur is a powerful Dragon Dance sweeper.</p> </li> <li> <p>Icicle Spear KOes Breloom and Mimikyu through Focus Sash and Disguise respectively.</p> </li> <li> <p>While Glaive Rush is valuable for late-game sweeping, it does make Baxcalibur very vulnerable to bulky OHKO move users such as Dondozo and Garganacl.</p> </li> <li> <p>Alternatively, Ice Shard means Baxcalibur will have a difficult time breaking past bulky Steel-types early-game, but it makes it an effective cleaner otherwise.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Dragon: This makes Glaive Rush deal obscene damage and removes weaknesses to Mach Punch and Bullet Punch.</p> </li> <li> <p><strong>Electric</strong>: When paired with Tera Blast, this is Life Orb Baxcalibur's best shot at dealing damage to Dondozo switch-ins. The paralysis immunity also helps Baxcalibur set up against Chansey with less risk.</p> </li> <li> <p><strong>Steel: With a Tera type of Steel, Baxcalibur can set up on Mimikyu and Dragon-type attacks.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Life Orb</strong>: This helps Baxcalibur sweep reliably and ensures Icicle Spear OHKOes Breloom through Focus Sash.</p> </li> <li> <p><strong>Loaded Dice</strong>: With a guaranteed 4 hits from Icicle Spear, Baxcalibur is able to always OHKO offensive Mimikyu after Dragon Dance.</p> </li> </ul> "
      },
      {
        "name": "Bulky Assault Vest",
        "description": "<ul> <li> <p>Baxcalibur's bulk and the wonderful Ice Shard make it a good user of Assault Vest, making it especially effective against the Rotom formes.</p> </li> <li> <p>Icicle Spear is recommended despite its inconsistent damage, as it deals damage through Mimikyu's disguise and potentially KOes Focus Sash users like Breloom and Meowscarada.</p> </li> <li> <p>Glaive Rush makes Baxcalibur very vulnerable to getting KOed the next turn, but it is still the least risky Dragon-type STAB move. Remember that Ice Shard will remove Glaive Rush's negative effects as well.</p> </li> <li> <p>A Ground Tera type gives Baxcalibur a reliable STAB move in Earthquake, resistance to Stealth Rock, and removes a ton of weaknesses, all at the cost of losing to Water-types such as Rotom-W.</p> </li> </ul> <h1>EV Spreads</h1> <ul> <li> <p><strong>252 HP / 252 Atk / 4 Spe with Adamant: This simple EV spread maximizes Baxcalibur's bulk and power.</p> </li> <li> <p><strong>116 HP / 252 Atk / 140 Spe with Jolly</strong>: The Speed investment here outspeeds Modest Gholdengo and Adamant Dragonite.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 534158, "username": "Kiby"}, {"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  },
  "Gholdengo": {
    "overview": "<p>Welcome to the next generation of Battle Stadium Singles! In this new and exciting metagame, new ideas are constantly developing, so this analysis will constantly be updated to reflect metagame trends.</p> <p>If you feel this analysis is not up to date, <a href=\"https://www.smogon.com/forums/threads/gholdengo.3712149/\">feel free to check out the thread for this Pokemon and post suggestions</a>. For more discussion and resources on Series 1 in general, <a href=\"https://www.smogon.com/forums/threads/battle-stadium-singles-series-1-a-land-free-of-ruins-and-paradoxes.3711710/\">check out this thread</a>.</p> ",
    "sets": [
      {
        "name": "Choice Item",
        "description": "<ul> <li> <p>With Trick and an immunity to status moves, Gholdengo is a dangerous Choice item attacker for offensive and stall teams alike!</p> </li> <li> <p>Thunderbolt 2HKOes Dondozo and deals serious damage to Tera Flying Garganacl.</p> </li> <li> <p>Dazzling Gleam deals massive damage to Meowscarada and Hydreigon.</p> </li> <li> <p>Nasty Plot can be used to give Gholdengo more bite against defensive, slower teams after using Trick.</p> </li> <li> <p>Focus Blast is an option to ruin Kingambit, though its accuracy can be an issue.</p> </li> <li> <p>Use a neutral nature Gholdengo that has a Timid Mint used on it. This way, Gholdengo can eat any Berry without being confused after Trick.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Water: In addition to giving Gholdengo a valuable resistance to Fire, this makes Gholdengo deal much more damage to Volcarona and common Tera Fire users such as Dragapult.</p> </li> <li> <p><strong>Ghost: The extra damage from Shadow Ball can make Gholdengo a more effective late-game cleaner.</p> </li> <li> <p><strong>Flying</strong>: With a Flying Tera type, Gholdengo gains an extremely useful immunity to Ground, which is especially useful on Choice Specs sets and against users of Fissure such as Dondozo.</p> </li> <li> <p><strong>Steel</strong>: Make It Rain becomes very powerful with a Tera boost, at the cost of making Gholdengo vulnerable to Mach Punch from Breloom.</p> </li> <li> <p><strong>Normal: A Normal Tera type gives Gholdengo the edge against opposing Ghost-types, at the cost of becoming very vulnerable to Breloom.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Choice Scarf</strong>: With this, Gholdengo outspeeds key threats such as Dragapult, Meowscarada, and Hydreigon.</p> </li> <li> <p><strong>Choice Specs</strong>: Choice Specs make Gholdengo much more difficult to wall, with foes such as Dondozo getting 2HKOed.</p> </li> </ul> "
      },
      {
        "name": "Nasty Plot",
        "description": "<ul> <li> <p>Nasty Plot makes Gholdengo a terror against slower teams, especially with its good bulk, unpredictable coverage, and diverse Tera Types.</p> </li> <li> <p>Substitute lets Gholdengo avoid residual damage from Garganacl's Salt Cure and ease prediction in general.</p> </li> <li> <p>Psyshock lets Gholdengo break through Chansey and Clodsire more easily.</p> </li> <li> <p>Despite its reliability issues, Focus Blast lets Gholdengo defeat Kingambit.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Flying: Flying Gholdengo gets the jump on dangerous Earthquake users such as Garchomp and Dragonite.</p> </li> <li> <p><strong>Water: With this Tera type, Volcarona and Skeledirge are far less likely to stop Gholdengo from sweeping.</p> </li> <li> <p><strong>Normal: While it's a much worse defensive typing, Tera Normal does let Gholdengo surprise faster Ghost-types like Mimikyu and Dragapult, at the cost of being weak to Mach Punch.</p> </li> </ul> <h1>Items</h1> <ul> <li> <p><strong>Leftovers: This is the most reliable option for keeping Gholdengo healthy and pairs especially well with Substitute.</p> </li> <li> <p><strong>Covert Cloak</strong>: Covert Cloak prevents Salt Cure from chipping down Gholdengo, making it far easier for it to run Recover against Garganacl.</p> </li> <li> <p><strong>Air Balloon</strong>: Air Balloon ruins Breloom's chances of winning the lead war against Gholdengo and makes Hippowdon easy setup bait.</p> </li> </ul> "
      },
      {
        "name": "Assault Vest",
        "description": "<ul> <li> <p>Gholdengo's good bulk and unpredictable Tera types make it a great user of Assault Vest.</p> </li> <li> <p>Dazzling Gleam punishes Dark-type revenge killers such as Hydreigon and Meowscarada when combined with Tera.</p> </li> <li> <p>Thunderbolt is Gholdengo's best shot at muscling past Dondozo and also deals good damage to Corviknight and Tera Flying Garganacl.</p> </li> <li> <p>Focus Blast is Gholdengo's best hope of getting past Kingambit.</p> </li> </ul> <h1>Tera Types</h1> <ul> <li> <p><strong>Water: With Assault Vest, Gholdengo can tank most Fire-type attacks against it and deal good damage to Volcarona. Watch out for its Giga Drain after Quiver Dance, though.</p> </li> <li> <p><strong>Flying: A Flying-type makes Gholdengo much more difficult to revenge kill with common Earthquake users such as Garchomp and Dragonite.</p> </li> <li> <p><strong>Normal: With a Normal Tera type, Gholdengo can defeat several faster Ghost-types such as Dragapult and Mimikyu, at the cost of a worse defensive typing and losing to Breloom.</p> </li> </ul> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 62165, "username": "StarkGod"}, {"user_id": 265677, "username": "Butch Hardnight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 29010, "username": "Theorymon"}]}
  }
}