{
  "Venusaur": {"sets": {"Sun Sweeper": {}}},
  "Blastoise": {"sets": {"Shell Smash": {}}},
  "Ninetales": {"sets": {"Sun Setter": {}}},
  "Arcanine-Hisui": {
    "sets": {
      "Offensive": {
        "description": "<p>Extreme Speed gets the jump on everything in the tier and backs up Hisuian Arcanine's potent STAB moves by letting it revenge kill frailer offensive Pokemon from high HP like Greninja, Ogerpon, and Latios. Notably, it can even prevent Adamant Lokix from revenge killing Hisuian Arcanine with First Impression. The perfect coverage afforded by these moves lets it fit a utility option into its last moveslot. Hisuian Arcanine is a great Stealth Rock setter thanks to its great matchup against Excadrill and Mandibuzz, the most common entry hazard removers, but it can also use Morning Sun to let its user more recklessly switch it in against foes like Tinkaton and Skarmory. Howl can be used over either choice to boost Hisuian Arcanine's Attack, letting it more easily cleave through offense with a boosted Extreme Speed. A Jolly nature with Tera Normal is chosen to let Hisuian Arcanine get the jump on Excadrill and to give Extreme Speed a much-needed power boost against offensive teams.</p> <p>Hisuian Arcanine best fits on offense teams and is best supported by offensive teammates that can break through the few things that can take on its STAB attacks. Latios can break through Toxapex, Hippowdon, and Gastrodon, and it can help with some offensive foes that Hisuian Arcanine struggles to revenge kill like Sand Rush Excadrill while also switching into Keldeo for it. Stealth Rock setters like Tinkaton let Hisuian Arcanine more freely run Morning Sun, and in return it relieves some pressure on them to switch into Flying-types like Thundurus-T and Tornadus-T. Tinkaton can also check some foes Hisuian Arcanine struggles with, such as the Normal-resistant faster offensive threat Ogerpon-C. Pivot support from allies like Lokix and Tornadus-T can bring Hisuian Arcanine in on prey like Tinkaton and Heatran. Strong Water-types like Azumarill and Greninja can help Hisuian Arcanine with bulky Ground-types like Hippowdon and Rhyperior that cause it problems.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 481709, "username": "Lily"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Slowbro": {"sets": {"Calm Mind": {}}},
  "Gyarados": {"sets": {"Dragon Dance": {}}},
  "Zapdos-Galar": {"sets": {"Pivot": {}}},
  "Mew": {
    "sets": {
      "Suicide Lead": {
        "description": "<p>Mew is a premier entry hazard setter for hyper offense thanks to having both Spikes and Stealth Rock, various utility options, and respectable bulk to get up multiple layers of hazards. Taunt allows Mew to shut down Pokemon attempting to hinder its ability to set hazards or take advantage of its passivity, such as preventing Mandibuzz from using Defog, Tinkaton from locking it into a move with Encore or getting its hazards up, and offensive threats like Sinistcha and Comfey from using it as a free chance to set up. Will-O-Wisp is used to punish physical threats like Scizor, Tyranitar, and Excadrill. Flare Blitz is an option with a Jolly nature that nails Steel-types like the aforementioned Scizor and Excadrill while helping KO itself in the process to get its teammates in faster. Misty Explosion at allows Mew to KO itself and keep its hazards up against hazard removers and hits Pokemon like Lokix and Latios for super effective damage. Red Card is usually the preferred item, as Mew's bulk allows it to survive a hit from the vast majority of the tier. This can potentially force out a target like Greninja into something slower, giving Mew another turn to get additional hazards up. Mew also be used in an emergency to force out a dangerous setup sweeper like Comfey, Quaquaval, or Serperior if its Red Card is preserved; however, this scenario is less likely, as you should be leading with Mew in most games. Mental Herb helps Mew in mirror matchups and other Taunt users like Cobalion and Tornadus-T. Colbur Berry is an option to survive a hit from Choice Scarf Hoopa, one of the few Pokemon capable of leading against Mew and preventing it from getting a single hazard up. The EV spread allows Mew to outspeed Excadrill and Taunt it to prevent Stealth Rock being set or status it with Will-O-Wisp. The remaining EVs are used to maximize its bulk, which allows it to take a Tera Bug First Impression from Lokix. Tera Ghost is solely used to prevent Excadrill and Donphan from using Rapid Spin against Mew; however, Terastallizing with your suicide lead is a massive commitment for hyper offense teams, so it should only ever be used if the opposing team looks extremely vulnerable to hazards.</p> <p>Mew is solely used on hyper offense, so it is best paired alongside powerful wallbreakers and sweepers. Mimikyu and Polteageist are essential partners thanks to their Ghost typing preventing Excadrill and Donphan from removing entry hazards with Rapid Spin. Naturally, they appreciate hazards wearing down Pokemon like Heatran and Tinkaton. Polteageist also appreciates Mew preventing most Stealth Rock setters from getting their hazards up, keeping its Focus Sash intact to reliably use Shell Smash. Comfey and Quaquaval are capable of taking advantage of offensive Dark-types like Greninja and Hoopa-U that are typically used to KO Mew. Fast Taunt users like Cobalion and Tornadus-T are problematic for Mew, so partners that take advantage of them like Thundurus-T are appreciated. Thundurus-T's raw power also applies a lot of pressure on Mandibuzz, preventing it from easily removing hazards for its team. Battle Bond Greninja loves having hazards to wear down Tinkaton and Assault Vest Tornadus-T, giving it an easier time to activate Battle Bond and sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 344575, "username": "Twilight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 540289, "username": "Tidal"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Azumarill": {
    "sets": {
      "Belly Drum": {
        "description": "<p>Belly Drum Azumarill serves as a phenomenal setup sweeper on hyper offense teams that is able to KO most Pokemon that do not resist Water with +6 Aqua Jet outright or after slight chip, such as Tornadus-T, Weavile, and Cobalion. It is also a dangerous wallbreaker that annihilates slower counterplay. Azumarill is vital in providing natural defensive utility against certain sets of Latios and Greninja, in addition to being a countermeasure for hyper offense teams against the sand archetype. Play Rough enables it to KO Water-resistant Pokemon such as Hydrapple and Latios as well as beefier neutral targets like Mandibuzz and Slowking. Knock Off serves as an alternative damage option to hit Toxapex and Pecharunt, 2HKO Skeledirge, and be a more reliable way of taking out Slowking. Sitrus Berry is used to give Azumarill a much-needed health boost after using Belly Drum. The alternate EV spread lets Azumarill outspeed Skeledirge. Tera Water boosts damage from Aqua Jet, OHKOing Greninja and Latios after Stealth Rock. Tera Electric gives Azumarill the ability to set up on Tornadus-T and Thundurus-T. Both Tera types give Azumarill a Steel resistance, which is useful to set up on Scizor and Metagross. Alternatively, a Jolly nature could be run to outspeed threats such as Mandibuzz, Sinistcha, Metagross, and Pecharunt, but this comes at a cost, as the drop in the power of Aqua Jet is noticeable.</p> <p>Azumarill fits best on hyper offense teams as a late-game sweeper that can take down weakened teams with +6 Aqua Jet. Excadrill and Sandy Shocks provide a key role in breaking Ogerpon-C's Sturdy with entry hazards as well as getting Cobalion, Latios, and Greninja in range of +6 Aqua Jet. Thundurus-T and Ogerpon-C can pressure faster threats such as Rotom-W, Volcanion, and Tera Water Zapdos. Greninja and Bisharp are able to check Pecharunt and Sinistcha, both of which can check Azumarill. Sticky Web from Araquanid is able to slow down threats such as Sinistcha and Pecharunt, bringing them down to a speed where Adamant Azumarill can defeat them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 458971, "username": "more like DK"}, {"user_id": 540058, "username": "StarFalcon555"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 617840, "username": "eeriespell"}, {"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 567354, "username": "sappheiros"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Politoed": {"sets": {"Rain Setter": {}}},
  "Quagsire": {
    "sets": {
      "Unaware Wall": {
        "description": "<p>Quagsire is a notable physical wall thanks to its ability Unaware, which allows it to ignore boosts from setup sweepers like Salamence and Scizor. Toxic puts many notable Pokemon in the tier on a timer such as Hippowdon and Gastrodon. Quagsire ideally wants Spikes over Stealth Rock to force more chip damage on potential switch-ins; however, Stealth Rock is fine as an alternative if none of its other teammates can afford to fit it into their moveset. Alternatively, Ice Beam with a Relaxed nature allows Quagsire to 2HKO Hawlucha after Stealth Rock and lets it beat Substitute + Dragon Dance Tera Flying Tyranitars. The passive recovery of Leftovers allows Quagsire to check Choice Band Tyranitar and Mimikyu more easily; however, if the team can not fit entry hazard removal, Heavy-Duty Boots is much more appealing. Quagsire only uses Terastallization defensively to check certain dangerous offensive threats. Tera Poison grants Quagsire a perfectly accurate Toxic and a poison immunity while also allowing it to handle Grass-types and offensive threats that use Grass-type moves such as Tsareena, Trailblaze Scizor, and Seed Bomb Pawmot. Tera Ghost allows Quagsire to beat Maushold by becoming immune to Population Bomb as well as check Slither Wing and Lucario more easily. Tera Ghost also has the added benefit of letting Quagsire serve as a spinblocker against spinners such as Tsareena.</p> <p>Quagsire primarily fits on balance, stall, and bulky offense teams as a defensive glue that holds these teams together. Common teammates for Quagsire include Stealth Rock setters such as Tinkaton and Tyranitar, which can allow Quagsire to run Spikes. Both can check Gengar, special Salamence, and Iron Jugulis, which pose a threat to Quagsire. Tinkaton can also use Knock Off on Heavy-Duty Boots users such as Sticky Hold Gastrodon, Scream Tail, and Wo-Chien to rack up more damage from Quagsire's Spikes. Scream Tail is another Pokemon that complements Quagsire, as it is able to handle special Salamence as well as Gallade, while Quagsire is able to keep Bisharp and non-Trailblaze Scizor in check. Talonflame is another ideal partner for Quagsire as it can check Tsareena and Giga Drain variants of Wo-Chien. Blissey on stall teams is also a strong partner for Quagsire by virtue of walling almost every special attacker in the tier such as Iron Jugulis, Noivern, and Sandy Shocks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 327020, "username": "TyCarter"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Slowking": {
    "sets": {
      "Utility Pivot": {
        "description": "<p>Slowking leverages its good typing and Regenerator to be a great pivot in UU. Scald punishes foes trying to threaten it out such as Lokix and Ogerpon. Thunder Wave slows down foes such as Tornadus-T and Latios. On teams where the speed control is not needed, Future Sight is a good alternative to support its teammates with extra damage. Chilly Reception is key for bringing teammates in safely while pairing very well with Future Sight. It can also be used to clear sand. The first EV spread allows it to take on physical attackers like Mamoswine and +2 Excadrill, while the second EV spread lets it survive Choice Specs Tera Dragon Draco Meteor from Latios. 0 Speed IVs make Slowking as slow as possible to ensure that Chilly Reception can pivot in a teammate without taking any damage. Tera Fairy flips its weakness to Dark and Bug while gaining a Dragon immunity, letting it paralyze Greninja and Ogerpon while more safely switching into Hydrapple. Tera Water is a decent alternative that retains its Water resistance so it can still check Azumarill and Keldeo while boosting Scald’s damage, OHKOing Rhyperior and Excadrill with slight chip damage.</p> <p>Slowking fits best on bulky offense and balance teams that appreciate the speed control and consistent pivoting. Hydrapple forms a fantastic Regenerator core with Slowking, as it can easily handle Ogerpon as well as shared checks in Lokix and Latios if it Terastalizes. Slowking can also use Thunder Wave to slow down Tinkaton and opposing Hydrapple. Lokix is another excellent partner for Slowking, as it can be brought in safely by Chilly Reception to revenge kill a foe like Excadrill. It is also able to threaten Dark-types, which are immune to Future Sight, such as Tyranitar, opposing Lokix, and Mandibuzz with Knock Off. Slower wallbreakers like Choice Specs Hydrapple and Mamoswine love Slowking slowing down Cobalion, Tinkaton, and Tornadus-T for them. The latter also appreciates the Defense boost from snow, letting it easily take priority moves from Lokix, Scizor, and Azumarill. Slowking also appreciates teammates that handle Grass-types like Hydrapple and Ogerpon. Scizor and Assault Vest Tornadus-T form a good pivot core, with the latter helping on take on Latios for physically defensive variants. Skeledirge appreciates Slowking spreading status for Hex to deal more damage as well. Tinkaton can run Thunder Wave itself, opening up Slowking to use Future Sight while checking Ogerpon-C, Lokix, and Latios. Weather Ball users like Nasty Plot Tornadus-T, Thundurus-T, and Raikou also appreciate the Ice coverage from snow, allowing them to nail Hydrapple and Ogerpon-C.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 524894, "username": "cheru"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Gligar": {"sets": {"Physically Defensive": {}}},
  "Skarmory": {
    "sets": {
      "Wall": {
        "description": "<p>Skarmory leverages its incredible defensive typing and physical bulk to act as an effective entry hazard setter and blanket check to physical attackers like Excadrill, Lokix, and Ogerpon. Body Press lets it target the aforementioned Excadrill as well as Scizor and Tyranitar, preventing them from using it as setup fodder. Brave Bird lets it hit Hydrapple, Conkeldurr, and Lokix for solid damage while letting it check Clodsire better. Whirlwind can instead be used to stop setup sweepers like Zarude and Revavroom in their tracks, as well as accrue chip damage from Spikes on the opposing team. Iron Defense bolsters the power of Body Press while also making Skarmory nigh-impossible to KO with physical attacks. Roost keeps Skarmory healthy, notably letting it retain Sturdy in case it needs to revenge kill or phaze a threat. 48 Speed EVs allow Skarmory to outrun max Speed Modest Hydrapple, letting it punish Choice Specs sets with Brave Bird. Rocky Helmet wears down the physical attackers it checks and punishes U-turns from Pokemon like Mandibuzz and Zarude. Tera Dragon grants Skarmory several useful resistances, including to Fire and Water; this lets it take on the likes of Hisuian Arcanine and Keldeo in a pinch.</p> <p>Skarmory provides bulky offense and balance teams a reliable Spikes setter and physical wall. Slowking is an incredible defensive partner for Skarmory due to its ability to take on special attackers like Keldeo and Heatran as well as its ability to spread burn with Scald, letting Skarmory wall physical threats better. In return, Skarmory takes on Pokemon that offensively threaten Slowking, like Lokix and Tyranitar, as well as Grass-types like Hydrapple. Hydrapple itself is another bulky pivot that pairs nicely with Skarmory, helping keep dangerous physical attackers that can be too much for Skarmory to handle, like Ogerpon-C, in check. It also appreciates the chip damage provided by Spikes, letting it sweep teams with Nasty Plot easier. Other cleaners, like Thundurus-T, Choice Scarf Latios, and Battle Bond Greninja, appreciate Skarmory chipping away at opposing offensive threats with entry hazard damage and Rocky Helmet. Offensive pivots like Choice Scarf Zarude, Keldeo, and Sandy Shocks also enjoy the additional chip damage provided by Spikes, letting them muscle through foes better. Sandy Shocks in particular appreciates the Ground immunity provided by Skarmory as well as its ability to check Grass-types like Zarude; in return, Sandy Shocks can set Stealth Rock on top of Skarmory's Spikes while providing a useful Volt Switch immunity. Excadrill is another excellent Ground-type partner due to its ability to remove Stealth Rock, letting Skarmory preserve Sturdy. Additionally, it can keep dangerous special attackers like Latios in check while appreciating Skarmory's ability to stop opposing Excadrill as well as check priority users like Lokix and non-Belly Drum Azumarill.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 236507, "username": "Bice"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 540289, "username": "Tidal"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Donphan": {"sets": {"Defensive": {}}},
  "Blissey": {"sets": {"Defensive Tank": {}}},
  "Tyranitar": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Tyranitar's unique typing alongside fantastic special bulk under sand allows it to check dangerous threats like Latios and Heatran well. Tyranitar's ability to remove items with a strong Knock Off and pressure entry hazard removers like Mandibuzz and Excadrill from switching in safely makes it an effective Stealth Rock setter. Thunder Wave allows Tyranitar to punish switch-ins like Quaquaval, Tinkaton, and Cobalion. It can also be used to cripple Tera Steel Latios to help other teammates deal with them better. Earthquake can be used to do heavy damage to Tinkaton, Excadrill, and Cobalion, but without Attack investment, it does not threaten much else. Ice Punch is an option if Tyranitar is paired with Excadrill to lure in and remove a weakened Hydrapple to help it sweep more easily. Leftovers is the preferred item choice to provide Tyranitar with passive recovery. Smooth Rock can be used to provide Sand Rush Excadrill with more sand turns but is far from necessary. Heavy-Duty Boots can help offset entry hazard damage. Chople Berry is a situational item that allows Tyranitar to check Nasty Plot Tornadus-T and Aura Sphere Latios. The given Speed EVs allow Tyranitar to outpace Skeledirge and hit it hard before potentially being punished by Will-O-Wisp. Tera Fairy removes Tyranitar's glaring weaknesses, particularly to Fighting, allowing it to punish Pokemon like Mienshao. It also allows Tyranitar to deal with a boosted Draco Meteor from Latios and KO it back while improving its matchup against Lokix. Tera Ghost can be used for a similar reason to remove Tyranitar's weaknesses while also potentially preventing Excadrill from being able to remove its Stealth Rock. Tera Water is another option to improve the matchup into Greninja and Choice-locked Keldeo; however, under sand, Tyranitar can take a boosted Surf from them anyway. Tera on Tyranitar should be used in emergencies, as removing its Rock typing takes away the boost to its Special Defense under sand and causes it to take damage from sand as well.</p> <p>Tyranitar fits best on offensive structures that can force progress, as it is susceptible to being worn down quickly. Excadrill is a great partner that can remove entry hazards for Tyranitar, as well as capitalize on the sand with Sand Rush to turn it into a deadly cleaner. Tinkaton pairs nicely with Tyranitar to act as a secondary check to Latios and Tornadus-T, as both are capable of chipping away at Tyranitar or potentially KOing it with Fighting-type coverage. Tinkaton also helps against other threatening wallbreakers like the Ogerpon formes and Lokix; Pickpocket Tinkaton variants are able to steal their Heavy-Duty Boots, causing them to slowly get whittled down by Tyranitar's Stealth Rock and sand. Other U-turn punishers like Rocky Helmet Cobalion can also support Tyranitar well. Slowking and Tornadus-T can help deal with Cobalion and Keldeo. Tornadus-T can also remove Heavy-Duty Boots from opposing Tornadus-T, allowing Tyranitar to get meaningful damage on it with Stealth Rock throughout a battle. Toxapex and Hydrapple do not mind having their item removed thanks to Regenerator, so partners like Thundurus-T and Mamoswine can help threaten them.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Tyranitar is one of the strongest wallbreakers in the tier, with its massive Attack stat, strong spammable STAB combination that hits key threats such as Latios, Tornadus-T, Pecharunt, and Slowking, and coverage moves to hit its counterplay. It can also leverage its great natural bulk, especially when combined with its Special Defense boost from sand, to defensively answer special attackers like Heatran and Latios. Earthquake pairs with Stone Edge very well for near-perfect coverage, hitting many Steel-types that would otherwise take Tyranitar's moves solidly, including Tinkaton and Cobalion. Ice Punch is solely used to OHKO Hydrapple. Tera Dark can boost the sheer strength of Tyranitar's Knock Off, 2HKOing itemless Toxapex and doing greater damage to walls like Hippowdon and Rhyperior. It also lets it avoid super effective hits, such as Greninja's Surf and Hydro Pump and Excadrill's STAB moves, and KO back. However, it leaves it vulnerable to its own sand chip and voids the Special Defense boost from sand. Tera Rock can similarly boost the power of its Stone Edge, letting it 2HKO maximum Defense Hydrapple, which is otherwise its most common switch-in. This also allows it to keep the sand Special Defense boost and avoid the chip damage so it can take on the attacks of Latios and Heatran more easily. Tera Flying can be used to obtain a resistance and immunity to Fighting- and Ground-type moves, respectively, from offensive checks such as Excadrill, Cobalion, and Keldeo, but gaining a weakness to Stealth Rock can be costly.</p> <p>Tyranitar often appreciates slow pivots to help it enter safely, as it does not have any form of recovery and thus does not like taking many attacks. Slowking does so and offers Future Sight support to help Tyranitar break through some of its checks, such as Skarmory and Toxapex, more easily. It can also help defensively check foes like Cobalion and Keldeo and offers paralysis to let Tyranitar outspeed foes such as Tornadus-T and Latios. Another good partner for Tyranitar is Excadrill, which, even with the limited sand turns, can revenge kill fast threats that may threaten out Tyranitar with OHKOs, such as Keldeo and Cobalion. Excadrill also helps wear down their shared checks in Rhyperior and Hydrapple, and Rapid Spin can allow Tyranitar to live longer and break more due to it no longer taking entry hazard chip damage. Hazard setters can provide support to chip defensive Pokemon like Hydrapple, Hippowdon, and Rhyperior into KO range from Tyranitar's attacks, while Tyranitar can remove the Heavy-Duty Boots that these Pokemon use to avoid hazard damage. Cobalion also helps defensively check revenge killers to Tyranitar like Lokix and both Ogerpon formes while providing the ability to pivot on foes, namely Slowking. Sandy Shocks can offensively check potential Tyranitar switch-ins or revenge killers like unboosted Quaquaval and Tinkaton. Heatran can check Tornadus-T, Ogerpon and Lokix that check Tyranitar while setting Stealth Rock up and offensively checking walls such as Skarmory. Tornadus-T can be a great partner for Tyranitar, checking many threats that it may let in and forcing switches of its own, which can let it bring in Tyranitar to wreak havoc. Its Flying typing and solid special bulk with Regenerator can allow it to check Cobalion and Greninja while assisting Tyranitar with checking Latios. Ogerpon and Hydrapple can work well alongside Tyranitar, checking Water-type threats such as Greninja and Azumarill that Tyranitar lets in. Scizor and Lokix can help revenge kill or pressure strong threats to Tyranitar such as Ogerpon, Greninja, Tinkaton, and Hydrapple. They can also remove potential Air Balloons from Tinkaton and Cobalion to make them vulnerable to Tyranitar's Earthquake.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 605413, "username": "Tree69420"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 540289, "username": "Tidal"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 200771, "username": "Rugi"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Gardevoir": {"sets": {"Choice Scarf": {}}},
  "Crawdaunt": {"sets": {"Choice Band": {}}},
  "Salamence": {"sets": {"Offensive": {}}},
  "Metagross": {
    "sets": {
      "Choice Band": {
        "description": "<p>Metagross's great typing, stats, and movepool allow it to function as a solid bulky attacker, handling threats like Latios and Ogerpon-C. Heavy Slam is a reliable STAB move, taking advantage of Metagross's large weight to do solid damage to threats like Hydrapple, Mandibuzz, and Greninja. Stealth Rock also allows Metagross to function as an entry hazard setter, while Bullet Punch gives Metagross a STAB priority move to circumvent its below average Speed, hitting foes like Ogerpon-C and Mamoswine. Knock Off can be used to cripple checks like Slowking and Hydrapple by removing their items, while Earthquake can be used to hit Steel-types such as Excadrill, Heatran, and Cobalion. Leftovers is crucial for maintaining Metagross's longevity, since it doesn't get a recovery move. 96 Speed EVs allow Metagross to outspeed maximum Speed Adamant Azumarill. Tera Dark allows Metagross to turn its weaknesses to Dark and Ghost into resistances while also boosting the power of its Knock Off, while Tera Water allows it to resist Fire-type attacks from Hisuian Arcanine and Skeledirge and tank Belly Drum Azumarill's boosted Aqua Jet.</p> <p>Metagross does best on bulky offense and balance teams that appreciate its good mix of power and bulk. Teammates like Tornadus-T, Mandibuzz, and Hydrapple all provide a Ground resistance that covers Metagross's weakness. In return, Metagross answers Ogerpon-C, which is scary for the former two and takes pressure off of Hydrapple. However, it is important to note that Tornadus-T cannot switch into Rhyperior safely, so answers to it like Slowking or the aforementioned Hydrapple are appreciated. Metagross is also weak to Fire-type moves from Pokemon like Hisuian Arcanine and Skeledirge, so Water types like Rotom-W and Slowking can help tank these attacks, both of which can use pivot moves to bring Metagross in safely. In general, Metagross benefits greatly from pivots that can bring it in safely, so U-turn users like Lokix, Ogerpon, and Scizor also make great teammates. Metagross tends to struggle with bulky Flying-types like Skarmory and Mandibuzz, so it benefits from teammates that can handle these two, such as Rhyperior and Sandy Shocks. These two Pokemon also act as alternate Stealth Rock users, which not only synergizes well with Metagross's Knock Off but also allows it to run Bullet Punch. The latter can also act as a spiker to form a hazard-stacking core with Metagross.</p>"
      },
      "Suicide Lead": {
        "description": "<p>Explosion Metagross is an offensive Pokemon with some defensive utility and a simple gameplan: set Stealth Rock then use Explosion. Explosion does a lot of damage to the tier's defensive Pokemon like Hydrapple and Slowking. Earthquake lets it hit the Steel-types that resist its Explosion and Heavy Slam, like Heatran and Excadrill. Stealth Rock gives it excellent utility, setting entry hazards while the foe switches out. Bullet Punch is useful when running an alternative hazard setter, as it can clean up foes at low HP. Metagross can utilize its fantastic typing to defensively check Pokemon like Latios and Hydrapple. Custap Berry alleviates how low Metagross may get in the process by gaining priority on Explosion. Normal Gem can allow it to KO some important targets, such as maximum Defense Hydrapple after Tera Normal. The given Speed investment allows Metagross to outspeed Mandibuzz and Azumarill but 196 Speed EVs can allow it to outspeed targets like Tinkaton and Choice Band Tyranitar; however, doing so would sacrifice some of the bulk that lets it check Ogerpon-C and Latios. Tera Normal lets Metagross power up its Explosion, letting it potentially OHKO Slowking and Hydrapple with chip, but beware that most of its defensive utility comes from its typing, so only use Tera if Metagross needs Tera Normal to KO the foe.</p> <p>Metagross fits best on offensive structures, as it lures in Skarmory and Hydrapple and weakens them for the rest of the team to exploit. Excadrill is an amazing partner, especially considering how much it threatens Skeledirge and Rotom-W, Pokemon that Metagross hates. Thundurus and Sandy Shocks also are good partners, as they enjoy Metagross's ability to switch into Latios and weaken Hydrapple. Sandy Shocks can also act as an alternate Stealth Rock setter. Metagross also enjoys Sticky Web support from Araquanid, allowing it to outspeed Pokemon like Tyranitar and Tinkaton while keeping its bulk as well as offensive checks like non-Heavy-Duty Boots Mamoswine. Ghost-type Pokemon like Sinistcha and Pecharunt can cause problems, as they block Metagross's Explosion attempts while threatening it with Shadow Ball, so it appreciates offensive Dark-types like Tyranitar and Lokix.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540058, "username": "StarFalcon555"}, {"user_id": 647932, "username": "Goombatower69"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Latios": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With its high Speed and Special Attack, Choice Specs Latios is a very deadly wallbreaker in UU, able to even break past checks such as Metagross, Slowking, and Tyranitar over time with its nuclear Draco Meteor. Surf nails Heatran and Excadrill while having good neutral damage against Scizor and Metagross. Flip Turn allows Latios to preserve momentum off of checks like Blissey and Tinkaton coming in. Trick hinders Pokemon like Slowking and Tyranitar with a useless item for them but should only be used when Latios's Choice Specs is no longer needed, is not useful in the current matchup, or is more valuable to weaken said checks to open up another teammate to win. Latios can run other coverage moves too; Thunderbolt threatens Mandibuzz and Slowking, Shadow Ball hits Metagross super effectively while retaining coverage for Slowking, while Aura Sphere slams Tyranitar and retains the ability to break Heatran and Excadrill, but they generally are difficult moves to lock into compared to more standard options. Tera Dragon boosts Latios's Draco Meteor to absurd levels, being able to OHKO Assault Vest Tornadus-T after Stealth Rock and Slowking after very little chip damage as well as 2HKO specially defensive walls like Tyranitar. Tera Steel is an alternative that gives Latios greater defensive utility, being able to avoid revenge killing attempts from Pokemon like Greninja, Lokix, Mamoswine, and opposing Latios.</p> <p>Choice Specs Latios is a powerful asset on bulky offense and balance builds for its powerful wallbreaking capabilities. Physical attackers such as Scizor, Weavile, Excadrill, and Cobalion excel at pressuring checks to Latios such as Metagross, Slowking, Tinkaton, and Tyranitar. Excadrill also provides entry hazard removal to keep Stealth Rock from wearing down Latios and switches into Tinkaton reliably. Tornadus-T and Lokix act as pivots that can wear down shared checks like Tyranitar and Tinkaton and enable Latios to wallbreak by bringing it in on other foes like Hydrapple and Toxapex. Entry hazard support from Pokemon like Tinkaton, Heatran, and Sandy Shocks does a great job at wearing down Metagross and Tyranitar into range of Latios's attacks. Defensive Pokemon like Slowking and the aforementioned Tornadus-T can defensively solidify Latios's team due to its need to predict correctly or otherwise risk losing momentum while the being additional checks to threats like Keldeo. Slowking can also provide paralysis support to mess with revenge killers like Lokix, Tornadus-T, and Greninja.</p>"
      },
      "Soul Dew 3a": {
        "description": "<p>With Soul Dew amplifying the power of its STAB moves, key defensive utility, and longevity, Latios is a formidable wallbreaker that can use its serviceable defensive utility in tandem with Recover to be an offensive threat that has longevity and key traits to bring to a team. Flip Turn allows Latios to gain momentum against and wear down threats like Excadrill, Slowking, and Tyranitar. Recover lets Latios pivot into the likes of Keldeo, Thundurus-T, Cobalion, and Sandy Shocks while not having to worry about being worn down. Soul Dew amplifies Latios's STAB moves while keeping its move flexibility. Tera Steel lets Latios avoid getting revenge killed by Pokemon like Greninja, Weavile, and Lokix. It also lets Latios act as a reliable switch-in against Hydrapple, Clodsire, and Gastrodon as well as giving it a Poison immunity, although it can no longer switch into Cobalion and Keldeo after Tera Steel.</p> <p>Latios largely fits on offense and bulky offense teams as a useful wallbreaker that provides much-needed defensive utility against foes like Keldeo and Cobalion. Pivots like Lokix and Tornadus-T can bring Latios in safely to wallbreak while helping it overwhelm shared checks such as Tinkaton and Tyranitar. Tornadus-T also checks Pokemon that threaten Latios such as Lokix and Excadrill, while Lokix revenge kills faster threats like Greninja and Choice Scarf Zarude. Tornadus-T can also bring Latios in safely while being a good source of defensive utility against the likes of Greninja and can wear down Pokemon like Slowking and Metagross for it. Tinkaton and Cobalion can provide Stealth Rock support to put threats like Slowking and Assault Vest Tornadus-T in range of KOs more easily. Sandy Shocks can set up Spikes, help wear down Tornadus-T, and bring Latios in against Hydrapple. Araquanid is a good enabler for Latios on Sticky Web teams, slowing down faster threats like Greninja and Choice Scarf Mienshao, as well as helping it avoid a Speed tie with Ogerpon-C.</p>"
      },
      "Calm Mind": {
        "description": "<p>Thanks to Terastallization, Latios utilizes Calm Mind in tandem with a STAB Thunderbolt to become an extremely powerful sweeper that plays a defining role in UU. Latios's natural bulk and high Speed allow it to gain setup chances with Calm Mind to snowball against common Pokemon like Heatran and Rotom-W as well as others like Greninja and Tornadus-T post Tera, working in tandem with Draco Meteor to offset the Special Attack drops. Dragon Pulse is a weaker alternative that offers the benefit of not dropping Latios's Special Attack. Thunderbolt complements Latios's Dragon-type STAB attack to be an unwallable combination outside of Excadrill, targeting many Pokemon such as Azumarill, Toxapex, Tinkaton, and Heatrann. Recover allows Latios to maintain longevity throughout the game and gain multiple chances to sweep while simultaneously providing natural defensive utility to its team against foes like Rotom-W, Keldeo, and Thundurus-T. The passive recovery of Leftovers allows Latios to set up more easily without relying on Recover, but Ability Shield is an alternative to bypass Excadrill's Mold Breaker, allowing Latios to now set up on its biggest counter. However, this item relies on surprise factor and is vulnerable to being removed via Knock Off from Pokemon like Tornadus-T and Weavile. Maximum investment in Special Attack and Speed allows Latios to be a fast, hard-hitting natural threat that doesn't need to rely on boosts to be effective. Alternatively, 96 Speed EVs to outspeed Hisuian Arcanine, maximum HP investment, and the remaining EVs in Defense let Latios act as a bulkier sweeper to better stand up to foes like Metagross and Lokix at the cost of immediate power. Tera Electric is the driving point of this set, boosting Thunderbolt to powerful levels to get past foes like Tinkaton and Metagross more easily while also making it safer into Lokix and Tornadus-T, not to mention giving Latios no weaknesses thanks to its synergy with Levitate. Latios also gains an immunity to Thunder Wave from foes like Slowking and Tinkaton.</p> <p>Calm Mind + Tera Electric Latios fits on a multitude of archetypes ranging from offense to semi-stall, but it finds itself most at home on bulky offense and balance teams thanks to its role as a reliable sweeper. Latios's biggest obstacle is Mold Breaker Excadrill, which handles its otherwise unresisted move combination, so Slowking and Hydrapple are great teammates to keep Excadrill in line. Slowking also provides slow pivoting support with Chilly Reception to get Latios in safely as well as provide speed control with Thunder Wave or amplify wallbreaking with Future Sight. Pivots like Tornadus-T and Lokix can bring Latios in to set up for a sweep while wearing down shared checks like Tyranitar and Tinkaton. Tornadus-T checks dangerous threats to Latios like Lokix and Ogerpon, whereas Lokix exerts offensive pressure on the likes of Excadrill and Greninja for Latios. Stealth Rock support from Tinkaton and Cobalion wears down foes like Toxapex and Assault Vest Tornadus-T into range of being KOed more easily. Tinkaton can also wear down Excadrill and Tera Fairy Hydrapple, while Cobalion can pressure foes like Zarude and Mandibuzz. Skeledirge is another issue for this set, so Pokemon that handle it such as Excadrill, Ogerpon-C, and Greninja make great teammates. Latios is quite Tera reliant to function at its very best, so offensive threats that do not use Terastallization often like the aforementioned Excadrill and Weavile as well as others like Keldeo and Quaquaval form great offensive cores that can take out checks to Latios such as Tyranitar, Clodsire, and Tinkaton.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 617840, "username": "eeriespell"}, {"user_id": 540289, "username": "Tidal"}, {"user_id": 461329, "username": "Estarossa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Jirachi": {"sets": {"Specially Defensive": {}}},
  "Gastrodon": {"sets": {"Mixed Defense": {}}},
  "Hippowdon": {
    "sets": {
      "Tank": {
        "description": "<p>Hippowdon's natural mixed bulk and access to recovery allow it to be a useful defensive piece of sand balance teams, checking numerous threats such as Excadrill, Thundurus-T, and Okidogi. Hippowdon is also an effective Stealth Rock setter, especially due to its matchup against the most common entry hazard removal in Excadrill. Slack Off allows Hippowdon to reliably check foes such as Excadrill, Tyranitar, and Zapdos throughout a game. Stone Edge hits Flying-types such as Zapdos, Tornadus-T, and Thundurus-T and is Hippowdon's best way to hit Latios and Grass-types. Leftovers provides Hippowdon with a means of passive recovery and limits its reliance on Slack Off, but Rocky Helmet is an alternative option to chip down pivots such as Lokix and Scizor as well as other physical attackers like Okidogi and Hoopa-U. 208 Defense EVs with an Impish nature allow Hippowdon to avoid the 2HKO from Choice Band Tyranitar's Ice Punch and Choice Scarf Tera Dark Hoopa-U's Hyperspace Fury, while 48 EVs in Special Defense allow Hippowdon to avoid the 2HKO from Thundurus-T's Focus Blast and defensive Zapdos's Hurricane. Tera Dragon flips Hippowdon's matchup against Water-types such as Greninja, Quaquaval, and Keldeo while retaining a positive matchup against Zapdos and Thundurus-T, though it must still be wary of Greninja's Ice Beam. It also strengthens Hippowdon's response to Ogerpon-C. Tera Rock lets Hippowdon resist Flying-type moves from Zapdos and Nasty Plot Tornadus-T while boosting the power of Stone Edge and using the Special Defense boost from sand to better answer Enamorus-T and Latios. However, the granted weaknesses to Ground- and Fighting-types is very harmful. Hippowdon's base typing is useful, especially for blocking Volt Switch, and its defensive role largely means more offensive Pokemon will make better use of Terastallization, so it isn't desirable to Terastallize Hippowdon unless necessary to dispatch a key threat.</p> <p>Hippowdon largely fits on sand balance teams, where its defensive presence makes it the preferred option to Tyranitar. Excadrill is an essential partner on sand teams, removing troublesome entry hazards that wear down Hippowdon while generally serving as a proactive breaker on the archetype to offset Hippowdon's passivity and take out foes like Greninja, Hoopa-U, and Tornadus-T. Slowking is a massive issue, being able to swap into Hippowdon and reset sand with Chilly Reception, so offensive threats such as Zarude and Serperior are essential teammates. These Grass-types in addition to Hydrapple all provide valuable checks to Water-types like Quaquaval, Keldeo, and Rotom-W and keep Hippowdon from being overwhelmed by the likes of Excadrill. Toxapex can cripple Slowking with Toxic and checks deadly threats to sand such as Greninja, Quaquaval, and Azumarill. Toxapex also serves as a backup check to Okidogi and can notably cripple it with Toxic after it has Terastallized into a Fairy-type to set up on Hippowdon with Bulk Up while potentially setting Toxic Spikes as a means to punish foes like Ogerpon-C. Latios, Volcanion, and Nasty Plot Tornadus-T serve as key progress makers on sand, being able to take out annoying foes such as Hydrapple, Azumarill, and Zarude. Assault Vest Tornadus-T can instead function in a more defensive role to handle foes like Latios, Hydrapple, and Serperior, enjoying Hippowdon’s ability to check Zapdos, Sandy Shocks, and Hisuian Arcanine, and provides item removal with Knock Off. Tinkaton enjoys Hippowdon opening up the Stealth Rock slot for another utility move in Encore or Thunder Wave and takes down foes such as Latios and Hoopa-U while switching into Mandibuzz.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 461329, "username": "Estarossa"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Rhyperior": {"sets": {"Offensive": {}}},
  "Mamoswine": {
    "sets": {
      "Substitute": {
        "description": "<p>Mamoswine functions as an excellent wallbreaker thanks to its nearly unwallable Ice / Ground STAB combination and high base Attack, allowing it to break through common threats such as Hydrapple, Heatran, Toxapex, and Skeledirge. Ice Shard is a reliable priority move that allows Mamoswine to bypass its below average Speed to revenge kill foes such as Ogerpon-C, Latios, and Thundurus-T. Trailblaze not only raises Mamoswine's otherwise subpar Speed but also allows it to hit Rotom-W, the only Pokemon in the tier that can wall Mamoswine's STAB combination. Knock Off can be used as an alternative to cripple Rotom-W and other checks like Slowking by removing their items, allowing Mamoswine or another teammate to break through them more efficiently later on. Substitute can also be used as an option to force switches and grant Mamoswine a safety net, though it must be used in tandem with Leftovers to preserve Mamoswine's longevity. Never-Melt Ice further boosts the power of Mamoswine's Ice-type STAB attacks. Heavy-Duty Boots can be used instead to prevent Mamoswine from being chipped down by hazards, though it comes at the price of lower power. Thick Fat reduces the damage Mamoswine takes from Hisuian Arcanine's Flare Blitz and Heatran's Magma Storm, allowing it to easily OHKO them back while also allowing it to take Heat Wave from Tornadus-T better. Tera Grass boosts the power of Trailblaze while allowing Mamoswine to tank powerful Water-type moves from foes like Greninja, Azumarill, and Quaquaval. It also helps Mamoswine handle Grass-types like Hydrapple and Ogerpon-C better, though it also makes Mamoswine weak to Tornadus-T's Hurricane and Lokix's First Impression. Tera Ice bolsters the power of Mamoswine's Ice-type moves even further, allowing it to score OHKOs with Ice Shard on Ogerpon-C, Latios, and Tornadus-T after Stealth Rock. Tera Fairy can be used to give Mamoswine a resistance to Fighting-type moves, allowing it to better handle Cobalion and Quaquaval while still taking neutral damage from Water-type moves.</p> <p>Mamoswine fits best on bulky offense and offensive teams that appreciate its ability to wallbreak with its powerful STAB combination. Mamoswine's lackluster Speed and poor defenses make it hard for it to get in safely, which can be made easier by pairing it with pivots such as Lokix, Thundurus-T, Tornadus-T, and Slowking. Lokix also helps revenge kill threats like Weavile and Greninja that cannot be revenge killed with Ice Shard, and the latter three also handle checks like Quaquaval and Cobalion that threaten Mamoswine. Mamoswine's biggest checks are Water-types like Rotom-W, Slowking, and Greninja, so Grass- and Electric- types like Hydrapple, Ogerpon, Serperior, and the aforementioned Thundurus-T make great partners to handle these threats. Entry hazard setters such as Cobalion, Tinkaton, and Excadrill help to soften up threats like Latios and Assault Vest Tornadus-T for Mamoswine in the late-game via chip from Stealth Rock. Excadrill in particular makes a great partner, as it can put pressure on Rotom-W with Mold Breaker Earthquake and spin hazards away. In return, Mamoswine handles threats like Hydrapple and Sinistcha, making it easier for Swords Dance Excadrill to clean up teams late in the game. Offensive teammates such as Sandy Shocks and Latios make for great partners, with the former providing hazard support, an offensive check to Cobalion and Scizor, and pivot support with Volt Switch to safely bring Mamoswine in against Hydrapple and Latios, while the latter revenge kills Quaquaval and Cobalion for Mamoswine while working in tandem with it to overwhelm their shared check, Slowking.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540058, "username": "StarFalcon555"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Rotom-Wash": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Rotom-W thrives as a pivot within the tier thanks to its unique typing, solid bulk in tandem with access to Pain Split, and access to a great ability in Levitate. Hydro Pump gives Rotom-W an excellent STAB option and makes the life of Ground-types wishing to block Volt Switch such as Rhyperior and Excadrill hard. Volt Switch lets Rotom-W generate momentum on Pokemon that would easily take a Hydro Pump such as Azumarill, Tornadus-T, and Slowking. Will-O-Wisp helps Rotom-W cripple physically offensive threats that dislike being burnt such as Ogerpon and Excadrill while slowly chipping down any burnt Pokemon. Thunder Wave, on the other hand, punishes Tornadus-T and Latios by slowing them down while helping teammates take advantage of the Speed cut as well as the chance of paralysis. Pain Split in tandem with Rotom-W's naturally low HP stat allows it to recover a significant amount of health on foes like Hydrapple and Slowking, keeping itself healthy throughout the game. Leftovers is used to increase Rotom-W's longevity over the course of the match, letting it passively recover its health. Rotom-W is able to run two distinct EV spreads, both of which maximize its HP while allowing it to outspeed Adamant Scizor and Tyranitar. Investment into Rotom-W's Defense with a Bold nature lets it handle Sand Rush Excadrill and Metagross while living a Choice Band Hisuian Arcanine Head Smash. Rotom-W with a Calm nature and EVs in Special Defense make it a solid check to Greninja, Tornadus-T, and Heatran. Tera Steel combined with Levitate removes the Ground weakness it would otherwise gain while gifting Rotom-W a spectacular defensive typing, letting it check Ogerpon-C and Latios better.</p> <p>Rotom-W's traits fit best on bulky offense teams that love its ability to cripple opposing Pokemon while pivoting on and off the field. Wallbreakers such as Ogerpon-C and Metagross fit excellently with it, being able to take advantage of Latios, Hydrapple, and Clodsire, which may want to switch into Rotom-W to block its shenanigans, with Metagross also functioning as a solid Latios check. Other pivots that synergize well with Rotom-W such as Lokix, Scizor, and Tornadus-T are excellent teammates, with Lokix and Scizor forming a strong VoltTurn core while handling Ogerpon, Hydrapple, and Latios for Rotom-W, while Assault Vest Tornadus-T can pivot into Latios and Keldeo for it. Ogerpon specifically both functions as a pivot and a way of punishing setup sweepers like Dragon Dance Salamence and Calm Mind Latios with Encore thanks to Rotom-W's Volt Switch giving it free entry. Clodsire is particularly annoying for Rotom-W, blocking both of its STAB options with Water Absorb while giving it an opportunity to throw off a nasty Toxic, so teammates like Metagross and Air Balloon Tinkaton work amazingly with it. Entry hazard setters like the aforementioned Skarmory and Tinkaton, as well as Cobalion, are fantastic partners for Rotom-W that support it with their strong defensive profiles. Hydrapple is an great check to Excadrill as well as the Ogerpon formes that appreciates Rotom-W's ability to handle Flying- and Ice-type types like Tornadus-T, Weavile, and Mamoswine. Hisuian Arcanine functions excellently with Rotom-W, being able to maximize its offensive potential thanks to Rotom-W baiting in the likes of Hydrapple and Tinkaton for it, with Will-O-Wisp chipping down opposing checks like Mamoswine and Thunder Wave allowing Hisuian Arcanine to outspeed Pokemon like Latios and Keldeo.</p>"
      },
      "Specially Defensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 540289, "username": "Tidal"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Manaphy": {"sets": {"Tail Glow": {}}},
  "Serperior": {
    "sets": {
      "Glare": {
        "description": "<p>Thanks to its high Speed and plethora of move choices, Serperior cements itself as a strong utility Pokemon. Glare is a powerful option that can cripple common switch-ins to Serperior like Tornadus-T and Latios. When combined with Contrary, Leaf Storm allows Serperior to threaten foes by launching a powerful STAB attack that also boosts its power at the same time. Tera Blast provides Serperior with a strong, customizable coverage option; Tera Blast Electric nails foes like Tornadus-T and Mandibuzz while providing neutral coverage against Cobalion, Tinkaton, Metagross, and Scizor. Tera Blast Fire deals super effective damage to the aforementioned Steel-types as well as other foes such as Lokix and Zarude while also hitting Thundurus-T for meaningful damage, and Tera Blast Ground allows it to still hit Steel-types super-effectively, especially Heatran. In addition, even without Tera, Tera Blast can act as strong enough neutral coverage against several foes that resist Leaf Storm. Alternatively, Dragon Pulse bolsters Serperior's coverage without the need for Tera, allowing it to hit foes such as Latios and Hydrapple for meaningful damage. Synthesis allows Serperior to restore its health in order to stick around longer, improving its longevity and helping it against more passive foes such as Slowking and Rotom-W. Knock Off and Substitute are also options to further cripple foes that Serperior has paralyzed and to take advantage of the switches it can force with Leaf Storm, respectively, but are generally not preferable due to being overall more prediction-reliant and less consistently useful than Synthesis. Leftovers increases Serperior's longevity and allows it to take advantage of the extra turns generated by paralysis while also being able to generate more setup opportunities for itself with Leaf Storm. An alternative spread of 252 HP / 4 SpD / 252 Spe can be used to improve Serperior's matchups against foes such as Excadrill and Ogerpon-C but further underscores Serperior's lack of immediate power. Tera Electric is used to provide a resistance to Flying, greatly improving Serperior's matchup against Tornadus-T, while also removing Serperior's weakness to Bug and giving it an additional resistance to Steel, making it less vulnerable to Scizor and Lokix. It also offers a handy immunity to paralysis, making Serperior safer against foes like Slowking, Rotom-W, and Cobalion. Tera Ground allows Serperior to OHKO Heatran after a Leaf Storm, which is its largest check, whereas Tera Fire allows Serperior to offensively threaten foes it would otherwise be helpless against, such as Scizor and Tinkaton, but should be used with caution, as it does miss out on many of the notable benefits of Tera Electric while also making Serperior weak to Stealth Rock and more vulnerable to revenge killing attempts from Azumarill and Greninja.</p> <p>Glare Serperior fits best on offensive teams with slow and strong wallbreakers that can take advantage of its ability to spread paralysis, such as Mamoswine, Azumarill, and Enamorus-T. In addition, Serperior can soften up checks to these Pokemon such as Toxapex with Leaf Storm and can also clean out weakened foes after these wallbreakers have blown holes in the opposing team. These wallbreakers can also remove problematic foes such as Hydrapple that can shrug off Serperior's attacks with ease and are not overly threatened by paralysis. Tornadus-T also makes for an excellent partner, as it is able to check Latios, Greninja, and Hydrapple and can assist Serperior by pivoting it in against targets like Rhyperior and Slowking with U-turn or harassing its paralysis targets with Knock Off. Many Stealth Rock setters, such as Cobalion and Rhyperior, also greatly appreciate Serperior's ability to slow down their checks and give them more chances to set up the hazard, with the latter also appreciating Serperior's ability to threaten Excadrill. In return, Serperior appreciates the chip damage from Stealth Rock making its Contrary-boosted attacks even more potent and punishing Assault Vest Tornadus-T, which it notably struggles against. The aforementioned Cobalion, as well as Pokemon such as the aforementioned Cobalion and Tinkaton, also provides a defensive out to revenge killers such as Lokix and Scizor. Skeledirge is also an extreme nuisance, as Serperior can not break it at all, so teammates that can handle it such as Greninja and Keldeo are appreciated. Serperior notably struggles with the tier's multitude of Flying-types without Tera, especially Assault Vest Tornadus-T, so checks to them such as Ogerpon-C, Thundurus-T, and the aforementioned Rhyperior are greatly appreciated, with Serperior softening up their checks in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 617840, "username": "eeriespell"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 540289, "username": "Tidal"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Excadrill": {
    "sets": {
      "Utility": {},
      "Swords Dance": {
        "description": "<p>When using Swords Dance, Excadrill acts as both an excellent utility Pokemon with Rapid Spin and a dangerous wallbreaker and cleaner all in one set. Iron Head is preferred over Rock Slide to let Excadrill break past Hydrapple and Sinistcha, while Rock Slide is useful for Mandibuzz and Skarmory. Rapid Spin is used both for its ability to remove entry hazards and also the crucial Speed boost it gives that lets Excadrill outrun the unboosted metagame. Tera Dragon lets Excadrill flip weaknesses to common moves used to check it like Greninja's Surf, Azumarill's Aqua Jet, and Hisuian Arcanine's Flare Blitz, while Tera Ground gives it a strong power boost on Earthquake, letting it OHKO Slowking at +2; this also sheds its weakness to opposing Excadrill's Earthquake. These are the main choices, but Excadrill can viably run a lot of Tera types; Tera Fire lets it set up on Skeledirge, Tera Fairy and Tera Ghost give it a resistance or immunity to moves like Quaquaval's Close Combat while Tera Fairy also lets it resist Mandibuzz's Foul Play, Tera Flying lets it beat opposing Excadrill more consistently, and Tera Water helps with Greninja while retaining a stronger Scizor and Mamoswine matchup. Leftovers lets Excadrill play more flexibly mid-game before it goes for a sweep, but Air Balloon lets Excadrill beat opposing Excadrill and act as a more reliable hazard remover against Spikes teams, particularly those using Sandy Shocks.</p> <p>Excadrill fits on just about any team you can think of thanks to its remarkable offensive capabilities and utility. Hydrapple is a huge roadblock for Excadrill, so Pokemon like Lokix, Tornadus-T, and Enamorus-T make for wonderful partners capable of pressuring it. Excadrill in return is great at supporting these Pokemon if they forgo Heavy-Duty Boots to alleviate their weakness to Stealth Rock by removing them from the field with Rapid Spin. It appreciates support from entry hazard setters like Tinkaton and Hisuian Arcanine; with the help of Knock Off users like the aforementioned Tornadus-T and Lokix, Excadrill can much more easily cleave through checks like Sinistcha and Slowking. Tinkaton and Assault Vest Tornadus-T are also great pivots into Latios, which is appreciated by Excadrill because it doesn't take Draco Meteor well without bulk investment. Slowking makes for an effective partner, as it can check Latios, which Excadrill can often struggle with despite its type advantage. Excadrill has few defensive checks, but teammates like Scizor and Thundurus-T that can threaten or weaken checks like Hydrapple and Skarmory are extremely appreciated. Excadrill can be revenge killed by foes like Greninja, Azumarill, and Lokix, so checks like Keldeo and Rotom-W make for helpful teammates.</p>"
      },
      "Sand Rush": {
        "description": "<p>Sand Rush Excadrill is a deadly threat, being a great sweeper, wallbreaker, and revenge killer thanks to the combination of Swords Dance and it outpacing the entire boosted metagame under sand. After a Swords Dance, Iron Head does heavy damage to Hydrapple, Mandibuzz, and Tornadus-T. Rapid Spin is primarily used for the utility it brings with removing entry hazards; however, its Speed boost can potentially prevent Excadrill from being revenge killed once sand has subsided. Rock Slide can be used over Rapid Spin if the team is not pressured by hazards as much, which can help it break past Mandibuzz. Air Balloon provides some utility against Sandy Shocks, Rhyperior, and opposing Excadrill, but Leftovers can be used for passive recovery. Life Orb can be considered, as it notably allows Excadrill to OHKO Choice Specs Hydrapple and Slowking after a Swords Dance boost and Stealth Rock, though it will cut into Excadrill's longevity and potentially bring it into range of priority from Lokix and Keldeo. A Jolly nature is primarily used so Excadrill can Speed tie with opposing Excadrill outside of sand. It also lets Excadrill outpace Battle Bond-activated Greninja under sand; however, it would be reliant on a defensive Tera to take Water Shuriken. An Adamant nature can be used to help improve the chances of KOing Pokemon like Slowking after a Swords Dance. Tera Rock increases the damage of Rock Slide to KO Mandibuzz, and the Special Defense boost under sand can help it beat foes like Hydrapple and take priority from Keldeo and Greninja better. Tera Dragon provides many useful resistances, notably letting it take priority hits from Greninja and Azumarill. Tera Ground provides a boost to Earthquake, allowing Excadrill to OHKO Slowking at +2 and remove its weakness to opposing Excadrill's Earthquake. Other Tera options are also great on Excadrill such as Fairy to beat Mandibuzz reliably and Fire to have a better matchup against Skeledirge.</p> <p>Excadrill fits best on offensive teams that can break down defensive structures to help Excadrill sweep more easily. Sand is essential, so Tyranitar or Hippowdon are mandatory partners, both being able to set Stealth Rock to help potentially bring foes into KO range. Tyranitar can help check and pressure Mandibuzz and Tornadus-T for Excadrill as well as force damage on other common answers like Keldeo. Alternatively, Hippowdon offers a sturdy check to opposing Excadrill and can afford to run Smooth Rock more easily due to having reliable recovery in Slack Off. Lokix can revenge kill Excadrill with minor chip damage, so a partner like Skarmory or Cobalion can keep it in check; the latter can run Stealth Rock to allow Excadrill's partner Tyranitar to run a more offensive set. Azumarill is easily one of the deadliest threats to sand teams, so Pokemon like Volcanion, Rotom-W, and Zarude are excellent teammates, all also having favorable matchups into rain teams. Rotom-W is a huge roadblock for Excadrill, so it is essential to run partners that can overwhelm it like Latios and Keldeo. Keldeo in particular can force in Excadrill answers like Latios, Hydrapple, and Sinistcha and heavily dent, or in Hydrapple's case OHKO, them with Icy Wind. Hydrapple is another partner that can pressure Rotom-W but also deals with other Pokemon like Slowking, Ogerpon, and Zarude for Excadrill. Mandibuzz can help pivot into Ogerpon and opposing Excadrill as well as provide Defog support, freeing up Excadrill to run Iron Head over Rapid Spin.</p>"
      },
      "Lead": {
        "description": "<p>Excadrill can be a useful lead on hyper offense teams thanks to its ability to enable threats like Ogerpon-C and Greninja that enjoy entry hazards being removed while providing some facet of removal against Sticky Web teams. Excadrill compresses Stealth Rock as a lead and can get it up by forcing out Pokemon such as Metagross, Rotom-W, and Tyranitar. Rock Tomb can slow down Pokemon attempting to set up against Excadrill like Zarude and Thundurus-T as well as general offensive leads like Tornadus-T and Ogerpon. Steel Beam is an alternative so Excadrill can KO itself to deny Mandibuzz and opposing Excadrill from removing its entry hazards, but Excadrill still offers some useful traits like checking Latios and Comfey that make it worth not KOing itself. Focus Sash guarantees that Excadrill can get off at least one attack, often choosing to use Rapid Spin into Stealth Rock into attacking. While Excadrill should not be Terastallized under most common circumstances, as the mechanic is better utilized by a sweeper on the hyper offense team, Tera Ghost can be used in an emergency to block Rapid Spin from opposing Excadrill to guarantee Stealth Rock remains up.</p> <p>Lead Excadrill is exclusively relegated to hyper offense teams as a lead that enables many sweepers to perform effectively. Quaquaval and Ogerpon-C are two of the best sweepers of the archetype, the latter benefitting from Excadrill keeping off Stealth Rock, and they are able to take advantage of threats Excadrill gives entry to such as Keldeo and Slowking. Mimikyu can block Rapid Spin from opposing Excadrill, allowing Tera to be preserved, and utilizes the entry hazards to take out foes like Tinkaton more easily while providing very valuable defensive utility against Lokix, Latios, and Greninja. Greninja appreciates entry hazard chip damage wearing down Tornadus-T and can offensively check foes like Slowking, Cobalion, and Hydrapple. Threatening sweepers like Comfey and Azumarill are able to set up on and pressure Mandibuzz and Lokix, not to mention they can use Tera themselves to now take out other threats like Metagross and Tinkaton for the former and Greninja and Zarude for the latter. Bisharp similarly can punish Mandibuzz attempting to use Defog with Defiant and take advantage of Stealth Rock chip damage to clean with Sucker Punch, while Azumarill takes advantage of Pokemon that lead Excadrill invites in such as Hydrapple, Quaquaval, and Hippowdon while liking hazards up to break Ogerpon-C's Sturdy.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 481709, "username": "Lily"}, {"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 617840, "username": "eeriespell"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 524894, "username": "cheru"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Conkeldurr": {"sets": {"Flame Orb Guts": {}, "Bulk Up": {}}},
  "Lilligant-Hisui": {"sets": {"Sun Sweeper": {}}},
  "Krookodile": {"sets": {"Stealth Rock": {}}},
  "Zoroark-Hisui": {"sets": {"Nasty Plot": {}}},
  "Reuniclus": {"sets": {"Calm Mind": {}}},
  "Haxorus": {"sets": {"Choice Band": {}}},
  "Golurk": {"sets": {"Choice Band": {}}},
  "Mandibuzz": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Mandibuzz has a solid niche in the UU metagame thanks to a unique and solid defensive typing, great mixed walling capabilities, and access to rare utility options like Defog and Toxic that make it a valuable addition to bulkier builds. Foul Play lets it threaten out Pokemon like Metagross, Excadrill, Scizor, and Belly Drum Azumarill. Defog lets Mandibuzz remove entry hazards for its teammates, especially against threats like Metagross and Rhyperior, although the latter might require more precise positioning than the former; it must be hit with Toxic first to be worn down, allowing Mandibuzz to utilize its natural bulk to tank Stone Edge, freely use Defog, and then use Roost to heal off the damage while not being trapped in a healing cycle due to the inability to progress against Rhyperior. Roost keeps it healthy throughout a match, allowing it to repeatedly come in and check Latios, Excadrill, Ogerpon, and Scizor. Toxic alleviates Mandibuzz's passivity a bit, threatening opposing bulky Pokemon like Slowking and Tornadus-T and setup sweepers like Nasty Plot Hydrapple and Calm Mind Tera Electric Latios. U-turn is an alternative to either Defog or Toxic that allows it to act as a slow pivot to maintain momentum against counters like Cobalion and Tinkaton, but Mandibuzz does not usually fit on the offensive structures that necessitate the need of U-turn to keep it from being a momentum sink. Heavy-Duty Boots keeps away the pesky damage from entry hazards. The given Speed investment allows Mandibuzz to outspeed Azumarill, while the Special Defense investment allows it to survive two Soul Dew-boosted Draco Meteors from Latios. Tera Steel helps Mandibuzz better answer foes like Latios and Greninja while flipping the script against foes like Ogerpon-C and shielding it from opposing Toxic. Tera Fairy lets it counter Dragon-types like Latios much more reliably, especially if it chooses to carry Toxic, and allows Mandibuzz to now gain a Fighting resistance while keeping its Ground neutrality against Excadrill.</p> <p>Mandibuzz best fits on balance and stall builds that enjoy its mixed walling and key utility features. Skeledirge is a great partner, as its typing and ability let it handle annoying Pokemon like Hydrapple and Cobalion somewhat consistently, while also helping against Tera Electric Calm Mind Latios. Toxapex also is a great partner, being a fantastic Knock Off absorber against Tornadus-T and Lokix, while also handling threats like Azumarill and Greninja that Mandibuzz struggles against. Tinkaton can not only act as a secondary check to Latios so that Mandibuzz won't get overwhelmed, but also beat the threatening Ogerpon-C. Rhyperior and Hippowdon can check Hisuian Arcanine, which Mandibuzz struggles against. Excadrill is another Pokemon that can give Mandibuzz trouble, so a check like Hydrapple or Slowking is necessary. Slowking also has the benefit of providing more assurance against Latios.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Mandibuzz has a solid niche in the UU metagame thanks to a unique and solid defensive typing, great mixed walling capabilities, and access to rare utility options like Defog and Toxic that make it a valuable addition to bulkier builds. Foul Play lets it threaten out Pokemon like Metagross, Excadrill, Scizor, and Belly Drum Azumarill. Defog lets Mandibuzz remove entry hazards for its teammates, especially against threats like Metagross and Rhyperior, although the latter might require more precise positioning than the former; it must be hit with Toxic first to be worn down, allowing Mandibuzz to utilize its natural bulk to tank Stone Edge, freely use Defog, and then use Roost to heal off the damage while not being trapped in a healing cycle due to the inability to progress against Rhyperior. Roost keeps it healthy throughout a match, allowing it to repeatedly come in and check Latios, Excadrill, Ogerpon, and Scizor. Toxic alleviates Mandibuzz's passivity a bit, threatening opposing bulky Pokemon like Slowking and Tornadus-T and setup sweepers like Nasty Plot Hydrapple and Calm Mind Tera Electric Latios. U-turn is an alternative to either Defog or Toxic that allows it to act as a slow pivot to maintain momentum against counters like Cobalion and Tinkaton, but Mandibuzz does not usually fit on the offensive structures that necessitate the need of U-turn to keep it from being a momentum sink. Heavy-Duty Boots keeps away the pesky damage from entry hazards. The given Speed investment allows Mandibuzz to outspeed Azumarill, while the Special Defense investment allows it to survive two Soul Dew-boosted Draco Meteors from Latios. Tera Steel helps Mandibuzz better answer foes like Latios and Greninja while flipping the script against foes like Ogerpon-C and shielding it from opposing Toxic. Tera Fairy lets it counter Dragon-types like Latios much more reliably, especially if it chooses to carry Toxic, and allows Mandibuzz to now gain a Fighting resistance while keeping its Ground neutrality against Excadrill.</p> <p>Mandibuzz best fits on balance and stall builds that enjoy its mixed walling and key utility features. Skeledirge is a great partner, as its typing and ability let it handle annoying Pokemon like Hydrapple and Cobalion somewhat consistently, while also helping against Tera Electric Calm Mind Latios. Toxapex also is a great partner, being a fantastic Knock Off absorber against Tornadus-T and Lokix, while also handling threats like Azumarill and Greninja that Mandibuzz struggles against. Tinkaton can not only act as a secondary check to Latios so that Mandibuzz won't get overwhelmed, but also beat the threatening Ogerpon-C. Rhyperior and Hippowdon can check Hisuian Arcanine, which Mandibuzz struggles against. Excadrill is another Pokemon that can give Mandibuzz trouble, so a check like Hydrapple or Slowking is necessary. Slowking also has the benefit of providing more assurance against Latios.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 647932, "username": "Goombatower69"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 617840, "username": "eeriespell"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Hydreigon": {"sets": {"Nasty Plot": {}, "Choice Scarf": {}}},
  "Cobalion": {
    "sets": {
      "Setter": {
        "description": "<p>Cobalion serves as one of the best Stealth Rock setters in the metagame due to its good matchups into the most common hazard removal options, Excadrill and Mandibuzz, while also being one of the best sponges for Lokix's First Impression. Volt Switch allows Cobalion to pivot out on would-be switch-ins such as Latios and Slowking and bring in a teammate to threaten them out. Thunder Wave can punish Tornadus-T and the aforementioned Latios for switching in, while Stone Edge can be used to hit Flying-types like Thundurus-T super effectively. Leftovers gives Cobalion more longevity, allowing it to check opposing threats for an extended period of time, while Rocky Helmet allows it to punish Lokix and Weavile more easily and get chip damage on other contact moves users such as Scizor and Tyranitar. Shuca Berry is another option that allows Cobalion to switch into or stay in on Earthquakes from unboosted Excadrill. Tera Dragon gives Cobalion a resistance to Water-type attacks such as Surf from Greninja, which is then OHKOed back with Close Combat, while making it neutral to Ground and preserving its Grass resistance so it can still check Ogerpon. Tera Ghost allows it to preserve Stealth Rock in the event the opposing Excadrill uses its Tera to flip the matchup while also making Cobalion neutral to Ground-type attacks and immune to Fighting-type attacks such as Low Kick from Weavile and Close Combat from Scizor and opposing Cobalion. Tera Flying gives it an immunity to Ground-type attacks, allowing it to more easily answer even a Speed-boosted Excadrill. However, Cobalion's base typing is very useful for answering threats like Lokix, Weavile, Scizor, and Tyranitar, so it should usually only Terastalize if there is no other option at the time.</p> <p>Cobalion fits on Volt Turn offense, bulky offense, and balance teams, utilizing its good matchups into the most common hazard removal options to keep Stealth Rock up for a solid portion of the game while using Volt Switch to bring threats onto the field. Unfortunately, Cobalion doesn't resist Flying and Psychic, so alternative checks to threats like Tornadus-T and Latios are needed. Slowking can check both Latios and Tornadus-T while also providing Thunder Wave support so Cobalion is more free to use Taunt. In return, Cobalion can switch into Lokix and Scizor, which can threaten Slowking. Pivot Tornadus-T can act as a check to Latios while using Knock Off so that foes such as Slowking and Skeledirge are susceptible to Cobalion's Stealth Rock and U-turn to continue the pivot chain. Sandy Shocks and Thundurus-T can help apply pressure on Ground-types like Rhyperior and Excadrill, as well as Cobalion checks like Hydrapple and Latios. Teammates that love Cobalion's ability to check threats like Weavile and Lokix such as Excadrill, Latios, and the previously mentioned Tornadus-T are appreciated. The latter two, alongside Grass-types like Hydrapple and Zarude, also provide a Ground resistance to help cover Cobalion's weakness. Excadrill, on the other hand, provides a Latios check that can remove hazards while also offensively checking Skeledirge and Toxapex. Choice Specs Greninja offensively pressures everything that can threaten Cobalion, and it appreciates Cobalion's ability to draw in foes and pivot on them alongside Stealth Rock for chipping Assault Vest Tornadus-T into Ice Beam range.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Thundurus-Therian": {
    "sets": {
      "Pivot": {},
      "Nasty Plot": {
        "description": "<p>Thundurus-T's extremely high Special Attack is elevated to terrifying levels using Nasty Plot, such as OHKOing offensive Heatran after Stealth Rock. Agility complements this by letting Thundurus-T outspeed the entire unboosted metagame. Tera Blast Flying allows Thundurus-T to break past Grass-types like Hydrapple and Zarude, whereas Focus Blast can be used to hit and remove Excadrill, as well as OHKO specially defensive Heatran and Tyranitar after a Nasty Plot. 100 Speed EVs allow Thundurus-T to avoid being revenge killed by threats like Choice Scarf Latios and Ogerpon-C after an Agility. The HP and Special Defense EVs let it survive Soul Dew Latios's Draco Meteor from full HP, with the remaining  the EVs invested into Special Attack. Together with Sitrus Berry’s crucial recovery, the bulk investments also enhance Thundurus-T's survivability, ensuring it can safely reach the ideal sweeping position and begin breaking through the opponent’s team. Tera Steel is an alternative to Tera Flying that prevents threats such as Ogerpon-C and Latios from interrupting Thundurus-T's sweep.</p> <p>Nasty Plot Thundurus-T is a staple of hyper offense teams, which specialize in pressuring the opponent's resources into opening an opportunity for Thundurus-T and other threats to wreak havoc on foes.  Thundurus-T is greatly complemented by entry hazard setters, such as Excadrill, which help weaken foes that would tank a +2 Thunderbolt such as bulky Heatran and Fezandipiti. Excadrill and Donphan provide Rapid Spin support, which prevents Thundurus-T from taking Stealth Rock damage. Taunt users such as Heatran and Grimmsnarl pair well with Thundurus-T, as they can also prevent Stealth Rock. Additionally, Grimmsnarl can set up dual screens to provide easier boosting opportunities. Thundurus-T has excellent synergy with fast offensive threats such as Greninja, which can help overwhelm common checks like Latios, Clodsire, and Tinkaton while appreciating Thundurus-T’s ability to pressure bulky Water-type Pokemon like Toxapex. Physical attackers such as Azumarill, Ogerpon, and Ogerpon-C help overpower Ground-types such as Excadrill and Sandy Shocks as well as Unaware users such as Clodsire. Alternatively, setup sweepers like Take Heart Manaphy and Air Balloon Revavroom can capitalize on Clodsire.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 638175, "username": "lonk"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 650155, "username": "OceanicGamer"}, {"user_id": 530118, "username": "Mystras"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 697682, "username": "earthfromthefuture"}]}]}
  },
  "Keldeo": {"sets": {"Pivot": {}, "Calm Mind": {}, "Choice Specs": {}}},
  "Chesnaught": {"sets": {"Physically Defensive": {}}},
  "Greninja": {
    "sets": {
      "Choice Specs": {
        "description": "<p>With its wide coverage combined with its excellent ability Protean, Choice Specs Greninja is a scary wallbreaker that hits all of the metagame at least neutrally while outspeeding common offensive Pokemon such as Latios and Ogerpon-C. Surf is the best option to deal strong damage, as Hydro Pump can unfortunately miss and lacks PP. However, Hydro Pump could still be an option to inflict more damage, as it can OHKO defensive Excadrill and 2HKO defensive Tyranitar and Tinkaton, though Surf deals with these Pokemon with entry hazards anyway. Ice Beam is able to hit Tornadus-T, Mandibuzz, and Ogerpon-C super effectively, whereas Sludge Wave can surprise common switch-ins like Azumarill and Keldeo and gives Greninja a resistance to Fighting-type moves, such as Secret Sword, allowing it to 2HKO Keldeo. Spikes chips the opposing team in the long term and punishes switch-ins, helping Greninja and its teammates clean more easily. Greninja naturally finds some good opportunities to set up a layer of Spikes or two thanks to the switches it naturally forces. U-turn is an alternative that grants Greninja some momentum, allowing it to pivot out on Pokemon that can wall it such as Empoleon, Gastrodon, and Toxapex. Tera Water is preferred to boost the power of Greninja's Water-type move, guaranteeing an OHKO on Scizor and Cobalion with Surf and a 2HKO on Keldeo with Hydro Pump, although it shouldn't Terastallize outside of an emergency because it'll lose the boost of Protean.</p> <p>Due to its severe frailty and incapacity to switch in easily, Greninja fits well on bulky offense teams that can afford slow VoltTurn support to bring it safely into battle, and they also provide some defensive backbones for Greninja to rely on. Teammates such as Cobalion, Tornadus-T, and Slowking are thus very appreciated, especially since Slowking can be useful to pressure Toxapex and Gastrodon with Future Sight. Excadrill is a helpful partner that can help Greninja by crushing common Water-resistant Pokemon like Rotom-W, allowing Greninja to spam its Water-type move. Also, Excadrill is capable of removing entry hazards, which can be a little overwhelming for Greninja. In the same way, Knock Off support helps Greninja by removing crucial items such as Assault Vest on Tornadus-T and Heavy-Duty Boots on Slowking and Volcanion. Examples of users would be Tornadus-T and Tinkaton. Since Greninja causes a lot of switches, hazard setters like Sandy Shocks and the aforementioned Cobalion are helpful. Cobalion can also check the powerful Lokix. Lastly, offensive teammates such as Calm Mind Latios and Comfey like the opposing team weakened by Greninja's powerful moves so that they can clean up, while others such as Ogerpon-C and Lokix can overwhelm their shared checks with Choice Specs Greninja, with examples of these being Toxapex, Tinkaton, and Empoleon.</p>"
      },
      "Battle Bond": {
        "description": "<p>Battle Bond turns Greninja into one of UU’s deadliest sweepers and revenge killers, as simply getting just one KO alone grants Greninja significant boosts in Special Attack and Speed to become a very difficult-to-wall sweeper that also avoids revenge killing attempts barring priority. Hydro Pump is an option over Surf for greater power, but Surf’s accuracy is much more desirable due to Greninja’s frailty and Hydro Pump's potential to be punished via a miss. Ice Beam allows Greninja to take down Hydrapple, Tornadus-T, and Ogerpon. Sludge Wave is a more specific option that helps versus Azumarill and Quaquaval, hitting them for neutral damage. Extrasensory is an option for the third moveslot to nail checks like Quaquaval and Toxapex. Protect allows Greninja to block First Impression from Lokix and scout attacks from Choice item users such as Latios and Hydrapple. It also can scout reactive Terastallizations from foes like Skeledirge and Tornadus-T. Water Shuriken allows Greninja to pick off faster targets like Sand Rush Excadrill and Choice Scarf Mienshao as well as beating out priority moves from Scizor and Mamoswine and KOing them when they are at low health. Life Orb is key in granting Greninja the power needed to break past foes such as Rotom-W, Slowking, and Assault Vest Tornadus-T despite reducing Greninja's limited longevity. Tera Water removes Greninja’s weakness to Fighting-type moves and gives it a permanently stronger Surf. Tera Stellar gives all of Greninja's moves extra power to take down Assault Vest Tornadus-T, Tera Steel Hydrapple, and Rotom-W late-game, and it gives Greninja a good shot at taking down Sand Rush Excadrill with Water Shuriken.</p> <p>Greninja best fits on offensive teams and is best supported by teammates that can weaken its checks and counters so that it can have an easier time cleaning up. Latios acts as a secondary wallbreaker, which can force critical damage on foes such as Skeledirge and Toxapex as well as overwhelmed shared checks like Azumarill and Assault Vest Tornadus-T. Mamoswine and Ogerpon-C similarly can punch holes into the opposing team by taking down the likes of Skeledirge and Mandibuzz, and they can wear down checks like Hydrapple for Greninja to clean late-game. Knock Off support from Tinkaton, Tornadus-T, and Ogerpon can cripple checks such as Slowking, Rotom-W, and Assault Vest Tornadus-T to bring them into KO range of Greninja's attacks. Strong Electric-types such as Sandy Shocks and Thundurus-T are essential in punching holes through Water-types such as Keldeo and Azumarill that give Greninja trouble. Entry hazard support is key in putting foes such as Tinkaton, Rotom-W, and Toxapex into KO range, making hazard setters like the aforentioned Sandy Shocks, your own Tinkaton, and Cobalion valuable teammates. Sandy Shocks pressures Tornadus-T while Tinkaton and Cobalion can punish revenge killers like Ogerpon, Choice Scarf Zarude, and Lokix if Greninja lacks Protect. Cobalion also can bring Greninja in with Volt Switch against Hydrapple and Mandibuzz to wallbreak while crippling Tornadus-T with Thunder Wave. Excadrill can remove hazards to avoid worsening the damage Greninja takes from Life Orb, and it offensively handles Rotom-W, Toxapex, and Empoleon while also swapping into Tinkaton.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 566724, "username": "Scavet"}, {"user_id": 492518, "username": "HydreigonTheChild"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 617840, "username": "eeriespell"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Hawlucha": {"sets": {"Sweeper": {}}},
  "Goodra-Hisui": {"sets": {"Offensive Tank": {}}},
  "Avalugg": {"sets": {"Rapid Spin": {}}},
  "Volcanion": {
    "sets": {
      "Offensive / Trapper": {
        "description": "<p>Volcanion is a powerful wallbreaker with phenomenal coverage, making it extremely difficult to switch into, that provides great defensive utility by checking threats like Skeledirge and Scizor. Sludge Bomb nails Azumarill and Hydrapple for super effective damage. It is also Volcanion's best way to wear down Slowking, Latios, and Assault Vest Tornadus-T, especially with the high chance to inflict poison. Taunt allows Volcanion to shut down Pokemon like Toxapex and Slowking, preventing recovery from both, Toxic from the former, and the ability to pivot with Chilly Reception from the latter. Tera Blast Fairy helps Volcanion threaten Quaquaval and Latios better. Earth Power is an alternative that can 2HKO Toxapex and Fezandipiti and also hits the rarer Empoleon hard, too. Heavy-Duty Boots allows Volcanion to capitalize on its typing and ability to check Pokemon like Greninja and Azumarill. A Modest nature is generally preferred for the increased damage output, though a Timid nature can be considered if Volcanion needs to outspeed Mamoswine or offensive Heatran. Tera Fairy allows Volcanion to take a Dark Pulse or Close Combat from Greninja and Quaquaval, respectively, allowing it to check both of them in a pinch while punishing Choice-locked Latios and Hydrapple.</p> <p>Volcanion fits best on bulky offense and balance teams that value its ability to check dangerous foes like Greninja and Azumarill while being a powerful wallbreaker itself. Although it is a solid answer to the Pokemon mentioned previously, Volcanion does appreciate having partners such as Tornadus-T, Mandibuzz, and Skarmory. Tornadus-T and Mandibuzz can also allow Volcanion to fire off powerful attacks by bringing it in safely against Pokemon like Heatran and Tinkaton. Cobalion and Sandy Shocks are other pivots that can be paired with Volcanion but also can provide entry hazard support, which is key to wearing down Assault Vest Tornadus-T. Cobalion can also provide Thunder Wave support to cripple Tornadus-T and Latios, making it easier for Volcanion to pressure them; it is also an excellent check to Ogerpon-C, which threatens Volcanion. Despite beating Slowking and Toxapex, breaking through them is a slow process, so partners like Thundurus-T, Zarude, and Hydrapple are appreciated for removing them. Thundurus-T can act as a strong offensive pivot to get Volcanion in on the likes of Hydrapple and defensive Heatran; the last two are able to force out Latios, with Zarude in particular also being a strong response to Greninja and Rotom-W, which can pressure Volcanion. Due to Volcanion commonly wanting to pivot into Azumarill and Scizor, it has the tendency to get hit by Knock Off, leaving it susceptible to hazards. Excadrill pairs well to remove them. Excadrill is also a great check to Latios and can apply pressure to Electric-types like Rotom-W that typically threaten Volcanion.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 344575, "username": "Twilight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 540289, "username": "Tidal"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Oricorio-Pom-Pom": {"sets": {"Quiver Dance": {}}},
  "Ribombee": {"sets": {"Setter": {}}},
  "Toxapex": {
    "sets": {
      "Mixed Defense": {
        "description": "<p>Toxapex holds a niche as a strong mixed wall, being able to effectively hold the line against a plethora of strong neutral hits and healing off large portions of damage through a combination of Recover and Regenerator. Compared to Liquidation, Surf allows Toxapex to achieve a 3HKO against Lokix, and does more damage to Rhyperior while also having more PP. Liquidation deals more damage to Tyranitar and bulkier variants of Excadrill, and it also allows Toxapex to utilize its bulk by fishing for Defense drops. Toxic and Haze form a potent combination and prevent Toxapex from being vulnerable to setup sweepers like Hydrapple and Quaquaval while also making it a reliable stopgap against Battle Bond Greninja. Toxic also allows it to threaten bulkier foes like Slowking, Tornadus-T, and Hippowdon by putting them on a timer. Heavy-Duty Boots expands Toxapex's longevity, while Rocky Helmet can be used to punish physically oriented pivots like Scizor and Lokix. Leftovers provides passive recovery that compounds with Regenerator and alleviates the need to use Recover. The given EV spread allows Toxapex to avoid being 2HKOed by Hisuian Arcanine's Head Smash as well as avoiding the OHKO from non-Choice Specs Latios's Luster Purge. Toxapex's Tera type is largely customizable based on the needs of the team; Tera Fairy is a strong neutral defensive typing that maintains Toxapex's resistances to Bug and Fighting while giving it an immunity to Dragon, while Tera Ground gives Toxapex an immunity to Electric-type moves from Sandy Shocks and Thundurus-T. Options such as Tera Steel to maintain Toxapex's Steel and Fairy resistances and immunity to Toxic are also viable.</p> <p>Toxapex fits best on balance teams that appreciate the unique options it provides over Slowking, most notably Haze and Toxic. For this reason, it pairs exceptionally well with Pokemon that struggle against Slowking, such as Rhyperior, Tinkaton, and Tornadus-T, creating a solid defensive backbone with the former two and a Regenerator core with the latter. Tinkaton and Tornadus-T in particular are appreciated due to their ability to check Latios, which can power through Toxapex with ease. Hydrapple is a strong partner thanks to its Ground resistance and its ability to form a Regenerator core with Toxapex. Mandibuzz is a particularly good partner thanks to its ability to remove entry hazards with Defog and function as a backup check to Quaquaval and Latios while also appreciating Toxapex's ability to stave off Belly Drum Azumarill. In a similar vein, Toxapex is also appreciated on sand teams because it can cut into the longevity of bulkier foes, especially when Toxic is compounded with the chip damage from sand, making it easier for Pokemon like Excadrill and Ogerpon-C to bulldoze the opposing team. In return, these Pokemon can remove troublesome foes like Thundurus-T and opposing Excadrill that threaten Toxapex with heavy damage. Cobalion makes a good partner, as it can reliably check Swords Dance Ogerpon-C and Non-Terastillized Swords Dance Zarude, both of which can muscle through Toxapex with relative ease. In addition, Toxapex can struggle against other offensive staples like Zarude and Thundurus-T, so revenge killers such as Lokix and Scizor or bulkier teammates that are not as vulnerable to these foes, such as Hippowdon and Rhyperior, are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "eeriespell"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Comfey": {
    "sets": {
      "Calm Mind": {
        "description": "<p>With access to Triage, Draining Kiss, and Terastallization granting it perfect offensive coverage, Comfey is a formidable sweeper in UU, taking down dangerous offensive foes like Lokix, Quaquaval, and Greninja. Calm Mind amplifies the power of Comfey's Draining Kiss while also making it harder to take down, finding setup chances against common foes like Hydrapple, Tornadus-T, and Rotom-W. Tera Blast Ground allows Comfey to now target Steel-types, including Metagross, Excadrill, and Tinkaton as well as other Fairy-resistant Pokemon such as Toxapex, Pecharunt, Skeledirge, and Hisuian Arcanine. Tera Ground also grants Comfey the ability to set up on foes like Sandy Shocks and Thundurus-T and resist Poison-type attacks from Pecharunt. Taunt denies recovery chances against foes like Slowking, Toxapex, and Mandibuzz, notably blocking Toxic attempts from the latter two, allowing Comfey to set up Calm Mind more easily and capitalize on forced switches. Giga Drain is an option over Taunt to get heavy damage on Water-types such as Azumarill and Slowking as well as other foes like Mamoswine, Rhyperior, and Hisuian Arcanine. A Life Orb grants Comfey an immediate power boost and works in tandem with the self-healing nature of Draining Kiss. 16 Speed EVs let Comfey outspeed foes such as Volcanion and Metagross, with the remaining investment in HP and Special Attack to maximize bulk and power.</p> <p>Comfey best fits on offense teams that wear down its checks to pave way for a sweep. Entry hazard leads like Mew and Excadrill provide key support in wearing down foes like Azumarill and Assault Vest Tornadus-T into Comfey's KO range. Mew in particular can cripple enemy Excadrill with Will-O-Wisp, allowing Comfey to no longer fear revenge killing attempts, while Excadrill can take out Tera Steel Latios. Ogerpon-C and Mimikyu are great teammates that offensively pressure bulky Pokemon such as Skeledirge and Slowking that trouble Comfey as well as wear down Tinkaton into range of Tera Blast Ground. Greninja and Azumarill are able to put pressure on the likes of Scizor and Hisuian Arcanine and are generally not reliant on Terastallization, meaning Comfey can use the mechanic more easily. Revavroom can take advantage of checks like Toxapex, Scizor, and Pecharunt and power through them while opening up holes against the enemy team for Comfey to clean. Quaquaval and Thundurus-T can take out Steel-types like Tinkaton and Metagross in the event Tera has already been used to still ensure Comfey can sweep; the former switches into Hisuian Arcanine, while the latter powers through Toxapex. Serperior and the aforementioned Quaquaval also threaten annoyances like Excadrill, Mamoswine, and Rhyperior.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Mimikyu": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Mimikyu is a valuable asset to hyper offense teams as a mid- to late-game sweeper with its great type combination and ability to be a one-time check to nearly anything with Disguise, including deadly foes such as Latios, Quaquaval, Greninja, and Lokix. It also serves as an emergency spinblocker to preserve entry hazards on these teams. Drain Punch is an alternative over Shadow Claw to get super effective damage on the likes of Excadrill, Mamoswine, and Cobalion, notably also granting Mimikyu recovery, and offsetting Life Orb recoil. Shadow Sneak picks off faster targets like Latios, Thundurus-T, and Ogerpon-C. Life Orb amplifies Mimikyu's wallbreaking, letting it reliably 2HKO Tinkaton with Shadow Claw at +2 as well as Latios with an unboosted Shadow Sneak. Alternatively, Red Card grants Mimikyu the ability to phaze out sweepers like Ogerpon-C and Greninja in tandem with Disguise and is able to generate a turn of setup with this, but the drop in power is notable even with the Adamant nature. Jolly is the preferred nature to get the jump on Hisuian Arcanine and Excadrill, but Adamant is an alternative for extra power at the cost of now being outsped by these threats. Tera Ghost amplifies the power of Shadow Claw and Shadow Sneak, letting Mimikyu OHKO Latios at +2 with the latter move even with Red Card as well as just offering greater damage in general against walls like Toxapex, Zapdos, and Tinkaton. Alternatively, Tera Fire grants Mimikyu an immunity to Will-O-Wisp from Skeledirge as well as a resistance to Steel-type attacks from Tinkaton, Scizor, and Metagross. It should be noted that only Tera Fire should be used for Drain Punch rather than Tera Ghost with the intended purpose of Tera Ghost largely being to boost the power of Shadow Claw specifically.</p> <p>Mimikyu best fits on hyper offense builds thanks to its unique ability to disrupt other offensive teams with Disguise while also functioning as an emergency spinblocker against Excadrill. Entry hazard support from Mew and Excadrill is essential in softening up foes like Toxapex and Tinkaton to get broken past by Mimikyu; additionally, Excadrill offensively pressures them and provides Rapid Spin support to keep entry hazards from wearing down Life Orb Mimikyu. Tinkaton and Excadrill are Mimikyu's largest issues, being able to take its STAB moves and bypass Disguise with Mold Breaker. As such, powerful sweepers like Quaquaval and Ogerpon-C are useful in dispatching these foes and can overwhelm walls like Skeledirge and Hippowdon for Mimikyu to clean late-game. Quaquaval also handles Scizor, while Ogerpon-C can wear down Okidogi into range of +2 Play Rough. Belly Drum Azumarill can wallbreak to remove foes like Toxapex, take on the likes of Excadrill and Hisuian Arcanine, allowing Mimikyu to afford an Adamant nature, and pressure the sand archetype as a whole as well. Greninja can offensively check threats such as Sandy Shocks and Scizor and wears down Tinkaton to where Mimikyu can bypass it more easily. Skeledirge can help handle opposing offense teams thanks to Unaware and its bulk, being a key teammate Mimikyu can fall back on when handling these teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 515132, "username": "Monky25"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 620325, "username": "ThatOneApple"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Necrozma": {"sets": {"Calm Mind": {}}},
  "Thwackey": {"sets": {"Terrain Setter": {}}},
  "Barraskewda": {"sets": {"Rain Menace": {}}},
  "Grimmsnarl": {"sets": {"Screens Setter": {}}},
  "Indeedee": {"sets": {"Terrain Setter": {}}},
  "Zarude": {
    "sets": {
      "Swords Dance": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Zarude provides a solid speed control option with a decent amount of defensive utility. Zarude's Speed grants it the ability to pressure Latios, Greninja, and Serperior. U-turn allows Zarude to pivot out against opposing switch-ins like Tinkaton and Cobalion, allowing it to bring in teammates that can threaten them. Close Combat gives Zarude super effective coverage for Ogerpon-C and Cobalion and an option to consistently hit Skarmory, while also OHKOing Excadrill, whereas Jungle Healing grants Zarude the ability to shrug off status from Slowking, Rotom-W, and Skeledirge. However, locking Zarude into Jungle Healing is very risky, due to the fact that the opponent will be able to switch anything in for free. Tera Dark gives Knock Off an extra boost in power, notably 2HKOing Serperior even after its item is removed, while Tera Fighting boosts Close Combat and makes Zarude less susceptible to revenge kill attempts from Lokix. However, Zarude loses its defensive utility when it Terastallizes, so it should only Terastallize when it is necessary to either revenge kill an opposing threat or clean up the rest of the game.</p> <p>Choice Scarf Zarude fits on offense teams that appreciate its compression as a revenge killer and Ground-resistant Pokemon. However, as a Choice item user, Zarude struggles with foes that can sponge its attacks and switch to a resist such as Hydrapple or Toxapex. As a result, it appreciates teammates that it can pivot to to pressure these foes such as Latios and Thundurus-T. Latios also outspeeds and pressures Skarmory and Cobalion, allowing Zarude to more easily slot Jungle Healing, while Thundurus-T can form a powerful pivoting core with Zarude. More offensively capable foes such as Enamorus-T can also switch into Zarude, so it appreciates defensive teammates that can withstand their attacks, like Tornadus-T and Skarmory. Zarude also appreciates teammates that can handle the tier's Flying-types in Mandibuzz and opposing Tornadus-T. Heatran and Excadrill help against these Pokemon, as well as Tinkaton, and can provide Stealth Rock to help wear down the aforementioned Flying-types after Zarude removes their Heavy-Duty Boots. Heatran also offensively pressures Tornadus-T and Mandibuzz, while Excadrill provides entry hazard removal to prevent Zarude from being worn down by opposing hazards. Sandy Shocks can act as a switch-in to Tornadus-T and Tinkaton while also offensively pressuring Mandibuzz and Enamorus-T. Sandy Shocks, alongside other potential teammates like Tornadus-T, Rotom-W, and Slowking, also functions as a pivot that can bring Zarude in on foes it can pressure out such as Latios.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Magnus Carlsen"}, {"user_id": 197240, "username": "sunny"}]}]}
  },
  "Zarude-Dada": {
    "sets": {
      "Swords Dance": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Zarude provides a solid speed control option with a decent amount of defensive utility. Zarude's Speed grants it the ability to pressure Latios, Greninja, and Serperior. U-turn allows Zarude to pivot out against opposing switch-ins like Tinkaton and Cobalion, allowing it to bring in teammates that can threaten them. Close Combat gives Zarude super effective coverage for Ogerpon-C and Cobalion and an option to consistently hit Skarmory, while also OHKOing Excadrill, whereas Jungle Healing grants Zarude the ability to shrug off status from Slowking, Rotom-W, and Skeledirge. However, locking Zarude into Jungle Healing is very risky, due to the fact that the opponent will be able to switch anything in for free. Tera Dark gives Knock Off an extra boost in power, notably 2HKOing Serperior even after its item is removed, while Tera Fighting boosts Close Combat and makes Zarude less susceptible to revenge kill attempts from Lokix. However, Zarude loses its defensive utility when it Terastallizes, so it should only Terastallize when it is necessary to either revenge kill an opposing threat or clean up the rest of the game.</p> <p>Choice Scarf Zarude fits on offense teams that appreciate its compression as a revenge killer and Ground-resistant Pokemon. However, as a Choice item user, Zarude struggles with foes that can sponge its attacks and switch to a resist such as Hydrapple or Toxapex. As a result, it appreciates teammates that it can pivot to to pressure these foes such as Latios and Thundurus-T. Latios also outspeeds and pressures Skarmory and Cobalion, allowing Zarude to more easily slot Jungle Healing, while Thundurus-T can form a powerful pivoting core with Zarude. More offensively capable foes such as Enamorus-T can also switch into Zarude, so it appreciates defensive teammates that can withstand their attacks, like Tornadus-T and Skarmory. Zarude also appreciates teammates that can handle the tier's Flying-types in Mandibuzz and opposing Tornadus-T. Heatran and Excadrill help against these Pokemon, as well as Tinkaton, and can provide Stealth Rock to help wear down the aforementioned Flying-types after Zarude removes their Heavy-Duty Boots. Heatran also offensively pressures Tornadus-T and Mandibuzz, while Excadrill provides entry hazard removal to prevent Zarude from being worn down by opposing hazards. Sandy Shocks can act as a switch-in to Tornadus-T and Tinkaton while also offensively pressuring Mandibuzz and Enamorus-T. Sandy Shocks, alongside other potential teammates like Tornadus-T, Rotom-W, and Slowking, also functions as a pivot that can bring Zarude in on foes it can pressure out such as Latios.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Magnus Carlsen"}, {"user_id": 197240, "username": "sunny"}]}]}
  },
  "Enamorus-Therian": {"sets": {"3 Attacks": {}, "Choice Specs": {}, "Calm Mind": {}}},
  "Skeledirge": {
    "sets": {
      "Defensive": {
        "description": "<p>Hex can be used on sets packing Will-O-Wisp to deal massive damage to burned foes, notably letting Skeledirge OHKO Slowking at +1 after burn damage, while also helping put a lot of pressure on Pokemon such as Tornadus-T and Rotom-W that may try to pivot around Skeledirge once they have been burned. Shadow Ball is a more reliable option to deal consistent damage early-game. Will-O-Wisp allows Skeledirge to put pressure on physical attackers such as Lokix and Donphan, while Earth Power can hit Heatran for large damage as well as forcing Fezandipiti to expend Roost's PP, allowing Skeledirge to safely get teammates in. Heavy-Duty Boots allows Skeledirge to ignore its otherwise ruinous Stealth Rock weakness. The EV spread allows Skeledirge to take on a wide variety of both physical and special attackers; for example, it has good odds to survive two Earth Powers from Gastrodon and has a chance to survive two High Horsepowers from Revavroom. Tera Fairy allows Skeledirge to take on Dark-types such as Lokix and Zarude while also giving it an immunity to Latios's and Hydrapple's Draco Meteors. Tera Poison gives Skeledirge an immunity to Toxic from both Fezandipiti and Toxapex; the typing lets it check Ogerpon-C and Greninja and helps it check Dark-types such as Lokix and Hydreigon. However, Tera Fairy makes Skeledirge unable to check Revavroom, while Tera Poison leaves it unable to check Latios. Both Tera types also make Skeledirge unable to block Rapid Spin from Excadrill and Donphan in a pinch.</p> <p>Skeledirge primarily fits best on a variety of playstyles ranging from bulky offense to stall teams, which appreciate its ability to soft check a wide array of Pokemon such as Thundurus-T, Latios, and Revavroom. Knock Off absorbers such as Skarmory and Fezandipiti are great for Skeledirge, as they can take on Pokemon such as Zarude and Lokix that Skeledirge may not be comfortable switching into for fear of losing its Heavy-Duty Boots. Water-type switch-ins such as Slowking, Hydrapple, and Rotom-W are perfect partners for Skeledirge, as they can take on Water-types such as Greninja and Keldeo that Skeledirge might struggle with, while in return, Skeledirge can take on Pokemon such as Thundurus-T that said Water-type switch-ins might struggle against. Slowking and Rotom-W in particular are great partners, as they can spread burns or paralysis to boost the power of Hex. Flying-types such as Skarmory and Tornadus-T are great for Skeledirge, as they can take on Ground-types such as Excadrill that Skeledirge may not be comfortable staying in on, while in return, Skeledirge can check Pokemon such as Thundurus-T said Flying-types can struggle against. Pivot Pokemon such as Tornadus-T and Choice Scarf Zarude are heavily enjoyed by Skeledirge, as they can safely get it in against Pokemon such as Skarmory and Slowking so that it can start pressuring opposing teams' defensive cores. Paralysis spreaders such as Slowking, Tinkaton, and Bellibolt allow Skeledirge to outspeed foes such as Fezandipiti and Manaphy while also boosting the power of Hex.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 647728, "username": "Heatraneater"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 461329, "username": "Estarossa"}, {"user_id": 620325, "username": "ThatOneApple"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Lokix": {
    "sets": {
      "Swords Dance": {},
      "Boots Pivot": {
        "description": "<p>Lokix uses First Impression to effectively remove offensive Pokemon like Ogerpon-C, Greninja, Latios, and Zarude. Tinted Lens prevents some of the aforementioned threats from Terastallizing to survive First Impression and lets Lokix still do considerable damage to Bug-resistant foes such as Thundurus-T. For example, Tera Bug First Impression will still be able to KO Tera Steel Latios after a bit of chip damage. Knock Off is good for punishing common switch-ins such as Skarmory, and Sucker Punch allows Lokix to pick off faster threats even after its first turn on the field. This can be important for many fast defensive Pokemon that can sponge a First Impression, like Tornadus-T. Tera Bug is crucial in order to effectively KO threats such as Excadrill and Thundurus-T. Heavy-Duty Boots is important, as it allows Lokix to come in multiple times even in the presence of Stealth Rock. An Adamant nature is used to maximize First Impression damage.</p> <p>Lokix fits very well on balance and offense structures, playing the important role of revenge killing many threats. Pokemon like Latios and Greninja appreciate Lokix using U-turn to safely bring them in versus Cobalion, Skarmory, and Heatran. Lokix enjoys being paired with Slowking, as Slowking is able to use Chilly Reception to safely bring Lokix in on Pokemon that threaten Slowking, like Zarude and Greninja. In return, Slowking can help handle Pokemon that Lokix struggles with, like Heatran and Keldeo. Lokix, in general, likes to pair with other pivots. Heavy-Duty Boots Thundurus-T and Tornadus-T are able to check Skarmory and Cobalion for Lokix. Defensive pivots such as Slowking and Rotom-W can check threats such as Tornadus-T for Lokix and bring it in on Pokemon like Zarude. Entry hazard setters, such as Skarmory and Gastrodon, appreciate Lokix's ability to remove foes' Heavy-Duty Boots, and they can check Pokemon like opposing Lokix, Revavroom, and Heatran.</p>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 650155, "username": "OceanicGamer"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 461329, "username": "Estarossa"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 391343, "username": "EthanLac"}]}]}
  },
  "Bellibolt": {"sets": {"Physically Defensive": {}}},
  "Tinkaton": {
    "sets": {
      "Bulky Wall": {
        "description": "<p>Tinkaton's good matchup against Mandibuzz makes it a strong Stealth Rock setter that uses its typing to get plenty of entry hazard-setting chances. Certain teams prefer Tinkaton to use Thunder Wave, though, since they can fit another Stealth Rock setter; this can help significantly when dealing with foes like Latios and Spiky Shield Ogerpon-C. Knock Off is excellent utility that prevents Tinkaton from being passive, removing items from Excadrill, Tornadus-T, and Rotom-W. Encore is Tinkaton's most useful asset, letting it use its typing and bulk to checkmate foes like Latios and Hydrapple. Leftovers is preferred on Mold Breaker sets so that Tinkaton has some longevity, with Mold Breaker proving useful to let it OHKO Ogerpon-C and Mimikyu despite their abilities. Pickpocket with an Air Balloon can let it steal items from Excadrill, Ogerpon, and Lokix, which can help immensely in fending these threats off. The given EVs allow Tinkaton to KO Latios with Knock Off followed by Gigaton Hammer while surviving a +2 Superpower from Ogerpon-C. Play Rough is a niche option that lets Tinkaton more directly pressure Greninja and Latios, but it is extremely weak against foes it doesn't hit super effectively. Tera Flying lets Tinkaton use Encore after Excadrill's Earthquake, While Tera Ghost can Encore Excadrill and Quaquaval into a failed attempt to remove hazards with Rapid Spin. Tera Dark helps Tinkaton against strong Psychic-type attackers like Choice Specs Latios, while Tera Dragon lets it check Greninja and Belly Drum Azumarill.</p> <p>Tinkaton's incredible typing and utility let it fit on all kinds of bulky offense and balance teams, using Stealth Rock to support teammates like Zarude and Lokix that love to weaken checks with Knock Off. It's also a good partner for teammates like Sandy Shocks and Rotom-W that dislike dealing with Latios. Tinkaton's flexibility lets it use its bulk to tank huge attacks and lock foes into them with Encore; for example, it often needs to lock Greninja into Surf. As such, teammates that can handle these attacks like Slowking and Hydrapple can be very useful to have. They also help signficantly against Excadrill, which Tinkaton tends to let in for free. Teams that use Tinkaton should aim to make progress fairly quickly; while it's a great stopgap to all kinds of threats, its lack of reliable recovery prevents it from lasting forever, so it needs progress-making teammates like Tornadus-T and Weavile, which can help it create favorable game states.</p>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 617840, "username": "eeriespell"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Revavroom": {
    "sets": {
      "The Car: Shift Gear": {
        "description": "<p>Revavroom is a solid setup sweeper, outspeeding the entire unboosted metagame after using Shift Gear. Revavroom's typing helps it find setup opportunities against Pokemon like Ogerpon-C and Scizor, and it carries helpful resistances against the priority moves of revenge killers like Lokix, Weavile, and Scizor. High Horsepower is Revavroom's strongest coverage move against Steel-types like Excadrill, Cobalion, and Heatran. Revavroom can alternatively run Temper Flare over Iron Head to roll past Skarmory and Air Balloon Steel-types like Excadrill and Tinkaton. Doing this also improves Revavroom's coverage against Scizor. However, dropping Iron Head makes Revavroom more reliant on Gunk Shot for its STAB move, hurting its consistency when it aims to drop threats like Tornadus-T, Latios, and Enamorus-T. Air Balloon creates windows for Revavroom to set up against Pokemon with Ground-type moves, including Excadrill, Hydrapple, the Ogerpon formes, and Tyranitar. It can also turn Clodsire into setup fodder for Revavroom. Filter enables Revavroom to stomach super effective attacks, like Heat Wave from Tornadus-T, while it sets up. Tera Ground powers up High Horsepower, making +1 Revavroom overwhelmingly likely to OHKO Cobalion without any prior chip damage. Skeledirge can be 2HKOed by Tera Ground High Horsepower, making it an unsafe switch-in to Revavroom.</p> <p>Revavroom is a great feature on hyper offense teams, where its capacity to set up and sweep is most appreciated. Revavroom's good defensive typing gives more offensive and fast-paced teams some more resilience. Fellow setup sweeper teammates like Scizor and Thundurus-T can join Revavroom in offensive cores that overload foes like Skarmory, Slowking, and Heatran. Greninja can take advantage of Skeledirge entering the field to stop Revavroom from sweeping, while Revavroom can use Pokemon Greninja struggles against, such as Assault Vest Tornadus-T and Choice Scarf Zarude, as setup opportunities. Deoxys-S's entry hazards break Ogerpon-C's Sturdy, enabling Revavroom to more reliably sweep Ogerpon-C variants that have Stomping Tantrum in case its Air Balloon has been popped.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 540289, "username": "Tidal"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Houndstone": {"sets": {"Sand Sweeper": {}}},
  "Clodsire": {"sets": {"Unaware": {}, "Water Absorb": {}}},
  "Slither Wing": {"sets": {"Pivot": {}, "Booster Energy": {}}},
  "Sandy Shocks": {"sets": {"Pivot": {}, "Lead": {}}},
  "Iron Jugulis": {"sets": {"Booster Energy": {}}},
  "Iron Leaves": {"sets": {"Swords Dance": {}}},
  "Sinistcha": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Sinistcha is a potent setup sweeper thanks to a variety of tools at its disposal: high Special Attack, great Defense, Heatproof, Calm Mind to shore up its Special Defense, and access to healing through Matcha Gotcha and Strength Sap, which can both also cripple opposing physical attackers. Strength Sap provides a way to get bigger bursts of recovery while also lowering the opponent's Attack, letting Sinistcha take hits from the likes of Lokix and Hisuian Arcanine and in turn use them to set up Calm Mind. Heatproof provides Sinistcha with a neutrality to Fire-type attacks, which is useful for taking on Hisuian Arcanine. Leftovers provides passive recovery alongside Sinistcha's healing moves, while Heavy-Duty Boots keeps it healthy through repeated switches. 96 Speed EVs let Sinistcha outspeed Adamant Azumarill, with the rest invested to maximize its physical bulk. Tera Poison allows Sinistcha to avoid Toxic from Mandibuzz and Toxapex while still maintaining a resistance to Fighting-type attacks, as well as preventing Toxic Chain, while Tera Fairy can be used instead to help Sinistcha check Latios and Hydrapple while gaining a resistance to Dark-type moves from Tyranitar and Greninja. However, both of these Tera types take away Sinistcha's ability to spinblock, and Tera Poison makes it significantly weaker to Excadrill, so Sinistcha should only be Terastallized when necessary.</p> <p>Sinistcha fits particularly well on hazard stacking teams, where entry hazard setters like Excadrill, Cobalion, Sandy Shocks, and Rhyperior benefit from its spinblocking and incredible matchup against Excadrill, the tier's best Rapid Spinner. In turn, Excadrill provides an answer to Latios, which can threaten Sinistcha if it doesn't have any Calm Mind boosts yet, especially if it is using Tera Poison. Cobalion also makes an excellent teammate, using Justified to provide a great answer to many Dark-types, like Mandibuzz, which otherwise easily uses Defog in front of Sinistcha, and Zarude, which resists both of Sinistcha's STAB moves and heals off burns with Jungle Healing. Rhyperior and Sandy Shocks are teammates that can both pressure both Heatran and Tornadus-T, which outspeed and threaten Sinistcha. Tornadus-T takes advantage of unboosted Sinistcha's middling Special Defense to OHKO it after minor chip damage, and Zarude easily 2HKOes Sinistcha with Knock Off, so teammates like Latios and Lokix that deal significant damage to them are appreciated. Skeledirge is a particularly annoying Pokemon for Sinistcha to deal with thanks to Unaware, so it needs teammates like Hisuian Arcanine and Greninja that can handle Skeledirge; these two also pressure the Flying-types that give Sinistcha issues.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Maia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 481709, "username": "Lily"}, {"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}]}]}
  },
  "Sinistcha-Masterpiece": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Sinistcha is a potent setup sweeper thanks to a variety of tools at its disposal: high Special Attack, great Defense, Heatproof, Calm Mind to shore up its Special Defense, and access to healing through Matcha Gotcha and Strength Sap, which can both also cripple opposing physical attackers. Strength Sap provides a way to get bigger bursts of recovery while also lowering the opponent's Attack, letting Sinistcha take hits from the likes of Lokix and Hisuian Arcanine and in turn use them to set up Calm Mind. Heatproof provides Sinistcha with a neutrality to Fire-type attacks, which is useful for taking on Hisuian Arcanine. Leftovers provides passive recovery alongside Sinistcha's healing moves, while Heavy-Duty Boots keeps it healthy through repeated switches. 96 Speed EVs let Sinistcha outspeed Adamant Azumarill, with the rest invested to maximize its physical bulk. Tera Poison allows Sinistcha to avoid Toxic from Mandibuzz and Toxapex and resist Okidogi's STAB attacks, as well as preventing Toxic Chain, while Tera Fairy can be used instead to help Sinistcha check Latios and Hydrapple while gaining a resistance to Dark-type moves from Tyranitar and Greninja. However, both of these Tera types take away Sinistcha's ability to spinblock, and Tera Poison makes it significantly weaker to Excadrill, so Sinistcha should only be Terastallized when necessary.</p> <p>Sinistcha fits particularly well on hazard stacking teams, where entry hazard setters like Excadrill, Cobalion, Sandy Shocks, and Rhyperior benefit from its spinblocking and incredible matchup against Excadrill, the tier's best Rapid Spinner. In turn, Excadrill provides an answer to Latios, which can threaten Sinistcha if it doesn't have any Calm Mind boosts yet, especially if it is using Tera Poison. Cobalion also makes an excellent teammate, using Justified to provide a great answer to many Dark-types, like Mandibuzz, which otherwise easily uses Defog in front of Sinistcha, and Zarude, which resists both of Sinistcha's STAB moves and heals off burns with Jungle Healing. Rhyperior and Sandy Shocks are teammates that can both pressure both Zapdos and Tornadus-T, which outspeed and threaten Sinistcha. Tornadus-T takes advantage of unboosted Sinistcha's middling Special Defense to OHKO it after minor chip damage, and Hoopa-U easily 2HKOes Sinistcha with Hyperspace Fury, so teammates like Latios and Lokix that deal significant damage to them are appreciated. Zapdos also makes a great teammate to punish Pokemon like Okidogi and Tornadus-T with Static, letting Sinistcha outspeed them. Skeledirge is a particularly annoying Pokemon for Sinistcha to deal with thanks to Unaware, so it needs teammates like Hisuian Arcanine and Greninja that can handle Skeledirge; these two also pressure the Flying-types that give Sinistcha issues.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 439018, "username": "Maia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 481709, "username": "Lily"}, {"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}]}]}
  },
  "Fezandipiti": {"sets": {"Pivot": {}}},
  "Ogerpon": {
    "sets": {
      "Pivot": {
        "description": "<p>Ogerpon functions as a solid pivot within the tier thanks to an array of excellent utility moves, a powerful STAB move in Ivy Cudgel, and great offensive stats. Knock Off allows Ogerpon to punish many of the Pokemon attempting to switch into it such as Heatran, Tornadus-T, and Skeledirge. U-turn allows Ogerpon to pivot out of matchups that are unfavorable for it such as Tinkaton, Cobalion, and Skeledirge while doing solid damage to Hydrapple that may want to switch in, and thanks to Heavy-Duty Boots, it is able to remain healthy throughout the match and easily pivot in and out of the field. Encore gives it the ability to take advantage of slower Pokemon that have locked themselves into an awkward move so it can go for a free move the turn after, such as Skarmory using Roost or Mandibuzz clicking Defog, which, when paired with Defiant, gives Ogerpon a free Attack boost. On the other hand, Ogerpon is able to use the pressure it creates as opportunities to set up Spikes for its team, helping its teammates and itself by slowly chipping down the opposing team's checks. Ogerpon's Tera type is locked into Grass, but with Embody Aspect, it is given a boost to its Speed on top of the additional boost to its STAB moves, letting it OHKO Slowking and have a chance to 2HKO Tornadus-T after Stealth Rock. This means that Ogerpon can act not only as a powerful breaker with Tera, but also as an emergency speed control option that can outrun every unboosted Pokemon in the metagame, as well as a number of boosted Pokemon such as Quaquaval after Aqua Step, Choice Scarf Mienshao and Excadrill after Rapid Spin. Ogerpon's Speed boost also allows it to have unique interactions with Encore, switching in on faster Pokemon to lock them into set up moves such as Calm Mind Latios or Nasty Plot Tornadus-T.</p> <p>Ogerpon's pivoting and utility options are best suited on bulky offense teams that appreciate its ability to disrupt foes while bringing in their own threats. Wallbreakers such as Azumarill, Hisuian Arcanine, and Mamoswine love Ogerpon's ability to pivot them in safely, weaken their checks, and potentially set up Spikes for them to break more easily; In return, they are able to deal with some of Ogerpon's checks such as Heatran, Tornadus-T, and Hydrapple. Pivots that are able to synergize well with Ogerpon such as Slowking, Tornadus-T, and Rotom-W make for excellent partners, being able to form a strong core while relieving Ogerpon of the pressure of taking on threats like Latios, Excadrill, and Quaquaval. Stealth Rock setters such as Tinkaton and Cobalion mesh well with Ogerpon that opt for Spikes by maximizing the entry hazard stacking potential, with Tinkaton able to fit Encore instead while taking on Greninja and Weavile, while Cobalion can effectively deal with Excadrill and Lokix for it. Sandy Shocks is an excellent teammate for Ogerpon, being able to take on the Flying-types that it's afraid of, creating a VoltTurn core with it, and being able to set up Stealth Rock for it while Ogerpon handles the Water- and Grass-type attacks aimed at Sandy Shocks well while beating its key checks like Azumarill and Rotom-Wash.</p>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 540289, "username": "Tidal"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 515132, "username": "Monky25"}, {"user_id": 344575, "username": "Twilight"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Ogerpon-Cornerstone": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-C is a terrifying powerhouse, with very few defensive Pokemon able to resist its STAB combination or stand up to its sheer power after a Swords Dance. Ivy Cudgel is the STAB move of choice, capable of nailing even checks like Tinkaton and Hydrapple with a 2HKO after boosting. Power Whip, while inconsistent due to poor accuracy, is also notably stronger, allowing Ogerpon-C to OHKO offensive threats like Keldeo and Azumarill and have a chance at OHKOing Excadrill without boosting. Alternatively, while less immediately powerful, Horn Leech's healing can help Ogerpon-C to survive revenge killing attempts, and in some cases, even allow for multiple uses of Sturdy. However, while it does obtain OHKOs and 2HKOs on most notable targets, especially after a Swords Dance, the drastically lower power can cause Ogerpon-C to miss important OHKOs on targets like Slowking and Tyranitar, especially if unboosted. Ogerpon-C's last moveslot is immensely customizable thanks to its near perfect STAB combination; Stomping Tantrum gets key damage on Tinkaton, Cobalion, and Heatran, while Spiky Shield helps to prevent being revenge killed by Lokix's First Impression and can allow Ogerpon-C to avoid being hit by Tinkaton's Gigaton Hammer entirely. It also scouts Choice Scarf users like Latios and Zarude. Sturdy allows Ogerpon-C to be significantly more aggressive, with the ability to live any one hit from full HP allowing it to pose much more of a threat against Pokemon like Latios and Excadrill. Embody Aspect also gives Ogerpon-C unique defensive properties through Terastallization, with the Defense boost helping to improve the odds of living attacks like Scizor's Bullet Punch, and shedding Ogerpon-C's Grass typing can be handy against opposing Lokix, especially if it is not carrying Spiky Shield.</p> <p>Ogerpon-C fits on a wide variety of teams thanks to its high firepower, as well as its access to Sturdy allowing it to serve as an emergency check to certain threats. Entry hazard setters like Tinkaton and Sandy Shocks are valued teammates, with the chip damage they provide helping Ogerpon-C to have an even easier time securing kills. These Pokemon are also capable of helping to manage foes that may annoy Ogerpon-C such as Latios and Tornadus-T. Pivots such as Slowking and Tornadus-T are also valuable for their ability to get Ogerpon-C in safely. Methods of speed control, such as Sticky Web from Araquanid, or Pokemon that can spread paralysis such as Cobalion, Tinkaton, Slowking, and Rotom-W, are also appreciated to help Ogerpon-C get the jump on faster foes. Choice Specs Latios makes a strong partner, as it can help Ogerpon-C to deal with Skarmory, and the two can whittle down shared checks like Tinkaton and Scizor. Excadrill also greatly appreciates Ogerpon-C's ability to smash pesky Flying-types while Ogerpon-C greatly benefits from Excadrill's hazard removal allowing it to keep Sturdy intact, as well as the extra support against Latios and Tinkaton. Powerful revenge killers, such as Lokix, are also appreciated for their ability to deal with Greninja and to pick off weakened Pokemon that Ogerpon-C may not be able to finish off.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>Ogerpon-C is a reliable wallbreaker thanks to its high-power STAB combination, potent coverage, and solid Speed tier, outpacing threats like Thundurus-T, Keldeo, and Cobalion. Ogerpon-C's STAB moves have high Base Power and great coverage on the tier, hitting numerous staples such as Zapdos, Excadrill, Slowking, and Scizor for massive damage. Stomping Tantrum is good coverage against Steel-types such as Cobalion, Tinkaton, and Metagross. U-turn lets Ogerpon-C develop offensive momentum, pivoting out of bad matchups such as Metagross and Skarmory while doing good damage to other foes such as Hydrapple and Zarude. Alternatively, Spiky Shield scouts revenge killing attempts from Lokix as well as Choice item users like Greninja, Keldeo, and Scizor. After Terastallization, Embody Aspect grants Ogerpon-C a Defense boost, giving it better odds to survive an attack from Pokemon like Scizor and Excadrill and hit hard in return.</p> <p>Ogerpon-C fits best on offensive teams as a strong wallbreaker capable of denting various defensive Pokemon. Offensive pivots such as Tornadus-T, Latios, and Scizor are excellent teammates for it, pivoting out of Pokemon like Rotom-W, Skarmory, and Slowking to provide offensive momentum for Ogerpon-C. Additionally, these Pokemon appreciate Ogerpon-C's efficiency into their checks, namely Rhyperior, Slowking, Tyranitar, and Hisuian Arcanine, while also helping overwhelm shared checks such as Tinkaton and Metagross. Entry hazard setters such as Cobalion, Sandy Shocks, and Tinkaton appreciate Ogerpon-C's good matchups into common hazard removal Pokemon such as Excadrill and Mandibuzz, while the hazards they set make it more difficult to switch into it. In return, these Pokemon can answer Pokemon that would otherwise be able to overwhelm Ogerpon-C such as Lokix, Scizor, and Choice Scarf Hoopa-U, respectively.Ogerpon-C's Speed, while very high, can leave it vulnerable to Pokemon like Greninja, Tornadus-T, and Weavile It is also vulnerable to Lokix's First Impression. Thus, countermeasures to these foes such as Azumarill, Tinkaton, and Heatran are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617840, "username": "eeriespell"}, {"user_id": 487308, "username": "BT89"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 540289, "username": "Tidal"}, {"user_id": 344575, "username": "Twilight"}, {"user_id": 515132, "username": "Monky25"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Hydrapple": {
    "sets": {
      "Offensive Nasty Plot": {
        "description": "<p>Hydrapple serves as a solid balance breaker, using its bulk and offensive prowess to handle threats like Excadrill while also being scary for foes like Tornadus-T and Metagross once it has set up Nasty Plot. It also has Regenerator to heal off any damage taken while checking these threats, allowing it to potentially repeat this process later in the game. Fickle Beam is an alternative move over Draco Meteor so Hydrapple can avoid the Special Attack drop while having a chance to deal more damage than Draco Meteor, allowing it to maintain its Nasty Plot boosts and to remain a big threat after firing it off. However using Fickle Beam means Hydrapple can miss out on KOs against foes like Zarude and Tornadus-T if the boost doesn't activate. Earth Power provides coverage for Steel-types like Tinkaton and Heatran so that they cannot easily come in to cause issues for Hydrapple. Heavy-Duty Boots serves to make Hydrapple's healing from Regenerator more effective while improving its longevity by removing its vulnerability to entry hazards, as it commonly has to utilize its great typing to switch into powerful wallbreakers like Excadrill and Ogerpon. Maximum HP and 92 Defense lets Hydrapple avoid the 2HKO from Choice Specs Keldeo's Secret Sword as well as making it incredibly difficult for physical attackers to break, letting it better soak up U-turn from Scizor, Lokix, and Zarude as well as powerful hits from wallbreakers like Ogerpon-C or Excadrill so that it can more easily set up Nasty Plot. Tera Steel improves its matchup against Ogerpon-C while also giving it a Toxic immunity to help against Toxapex and Mandibuzz, a Flying resistance so it can set up Nasty Plot in front of Tornadus-T, and a Fairy resistance useful for dodging an OHKO from Choice Band Azumarill's Play Rough in case of emergency. Tera Fairy lets it set up more easily on Latios and opposing Hydrapple without gaining weaknesses to Quaquaval and Weavile. However, Terastallizing Hydrapple removes its beneficial resistances to Ground and Electric, making it tougher to handle Volt Switch users such as Sandy Shocks and Rotom-W.</p> <p>Hydrapple acts as a solid wallbreaker for balance and bulky offensive playstyles, using its defensive profile to switch into foes that are offensively threatening or tough to break and then becoming a threat of its own. Slowking is a nice partner for it, forming a double Regenerator core that helps work around some problems for Hydrapple such as Tornadus-T and Tinkaton while acting a secondary Water resist in the event Hydrapple needs to Tera. Slowking also slow pivots to Hydrapple with Chilly Reception after soaking up a hit, allowing Hydrapple to either be a bigger threat due to having more HP or get its HP back from Regenerator more easiliy. Additionally, Slowking can use Thunder Wave against foes like Tinkaton and Mandibuzz to make them slower than Hydrapple, allowing it to more easily set up Nasty Plot. Cobalion is also a good teammate, defensively answering Scizor and Lokix, which can pose problems with their strong U-turn should they switch in on Hydrapple when it’s chipped. Hydrapple appreciates teammates that can help wear down Tinkaton into Earth Power range such as Lokix and Tornadus-T. It also appreciates Pokemon that can help pressure or defensively answer Flying-types such as Tyranitar or Rhyperior. Hydrapple appreciates Stealth Rock setters like the previously mentioned Cobalion and Rhyperior to get targets into range of its boosted attacks more easily. Sand teams appreciate Hydrapple's defensive profile in tandem with Regenerator, it can use an Eject Button to safely bring in Excadrill and act as check to opposing Excadrill and Keldeo, which can be scary for sand teams otherwise.</p>"
      },
      "ThatBoldApple: Defensive Nasty Plot": {
        "description": "<p>Hydrapple serves as a solid balance breaker, using its bulk and offensive prowess to handle threats like Excadrill while also being scary for foes like Tornadus-T and Metagross once it has set up Nasty Plot. It also has Regenerator to heal off any damage taken while checking these threats, allowing it to potentially repeat this process later in the game. Fickle Beam is an alternative move over Draco Meteor so Hydrapple can avoid the Special Attack drop while having a chance to deal more damage than Draco Meteor, allowing it to maintain its Nasty Plot boosts and to remain a big threat after firing it off. However using Fickle Beam means Hydrapple can miss out on KOs against foes like Zarude and Tornadus-T if the boost doesn't activate. Earth Power provides coverage for Steel-types like Tinkaton and Heatran so that they cannot easily come in to cause issues for Hydrapple. Heavy-Duty Boots serves to make Hydrapple's healing from Regenerator more effective while improving its longevity by removing its vulnerability to entry hazards, as it commonly has to utilize its great typing to switch into powerful wallbreakers like Excadrill and Ogerpon. Maximum HP and 92 Defense lets Hydrapple avoid the 2HKO from Choice Specs Keldeo's Secret Sword as well as making it incredibly difficult for physical attackers to break, letting it better soak up U-turn from Scizor, Lokix, and Zarude as well as powerful hits from wallbreakers like Ogerpon-C or Excadrill so that it can more easily set up Nasty Plot. Tera Steel improves its matchup against Ogerpon-C while also giving it a Toxic immunity to help against Toxapex and Mandibuzz, a Flying resistance so it can set up Nasty Plot in front of Tornadus-T, and a Fairy resistance useful for dodging an OHKO from Choice Band Azumarill's Play Rough in case of emergency. Tera Fairy lets it set up more easily on Latios and opposing Hydrapple without gaining weaknesses to Quaquaval and Weavile. However, Terastallizing Hydrapple removes its beneficial resistances to Ground and Electric, making it tougher to handle Volt Switch users such as Sandy Shocks and Rotom-W.</p> <p>Hydrapple acts as a solid wallbreaker for balance and bulky offensive playstyles, using its defensive profile to switch into foes that are offensively threatening or tough to break and then becoming a threat of its own. Slowking is a nice partner for it, forming a double Regenerator core that helps work around some problems for Hydrapple such as Tornadus-T and Tinkaton while acting a secondary Water resist in the event Hydrapple needs to Tera. Slowking also slow pivots to Hydrapple with Chilly Reception after soaking up a hit, allowing Hydrapple to either be a bigger threat due to having more HP or get its HP back from Regenerator more easiliy. Additionally, Slowking can use Thunder Wave against foes like Tinkaton and Mandibuzz to make them slower than Hydrapple, allowing it to more easily set up Nasty Plot. Cobalion is also a good teammate, defensively answering Scizor and Lokix, which can pose problems with their strong U-turn should they switch in on Hydrapple when it’s chipped. Hydrapple appreciates teammates that can help wear down Tinkaton into Earth Power range such as Lokix and Tornadus-T. It also appreciates Pokemon that can help pressure or defensively answer Flying-types such as Tyranitar or Rhyperior. Hydrapple appreciates Stealth Rock setters like the previously mentioned Cobalion and Rhyperior to get targets into range of its boosted attacks more easily. Sand teams appreciate Hydrapple's defensive profile in tandem with Regenerator, it can use an Eject Button to safely bring in Excadrill and act as check to opposing Excadrill and Keldeo, which can be scary for sand teams otherwise.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Hydrapple is a dangerous wallbreaker that provides a lot of defensive utility through its typing to answer threats like Excadrill, Sandy Shocks, and Ogerpon. Leaf Storm and Draco Meteor are powerful and spammable STAB moves despite the Special Attack drop drawback. Earth Power provides coverage against Steel-types like Tinkaton and Heatran. Hydrapple lacks coverage outside of Earth Power, so Fickle Beam is usually preferred to have a secondary Dragon-type STAB move that doesn't have the ramification of lowering its Special Attack. Similarly, Giga Drain is another option to provide a secondary Grass-type STAB move that doesn't force Hydrapple to switch out and provides it with more longevity. Regenerator helps Hydrapple answer Excadrill and the Ogerpon formes and provides ample opportunities for Hydrapple to get into a position to wallbreak by keeping it healthy across a match. The EV spread allows Hydrapple to outspeed Azumarill and Ursaluna while maximizing its damage output. Tera Steel should primarily be used for its defensive value to flip the matchup against threats like Latios, Weavile, and Scizor. Tera Fairy allows Hydrapple to combat Latios and opposing Hydrapple. However, Hydrapple should only Terastallize when necessary, as giving up its great defensive typing greatly hinders its matchup against Pokemon like Rotom-W and Excadrill.</p> <p>Hydrapple fits best on offensive teams that can help it get in safely and take pressure off it being the sole answer to the likes of Excadrill and Ogerpon. Pivots such as Tornadus-T and Cobalion are fantastic partners for these reasons; the former forms a Regenerator core, while the latter can punish Pokemon like Scizor and Lokix with Thunder Wave, crippling them for Hydrapple to outspeed. Steel-types like Tinkaton and Metagross prevent Hydrapple from easily locking into its STAB moves, so Pokemon like Excadrill, Slowking, and Sandy Shocks can help check and apply pressure on them. Excadrill notably provides Rapid Spin support to prevent Hydrapple being worn down by entry hazards and can act as a check to Latios, allowing Hydrapple to preserve the option to Terastallize. Sandy Shocks can provide Spikes support to wear down Pokemon like specially defensive Tyranitar and Toxapex into OHKO range while also checking Tornadus-T. Assault Vest Tornadus-T is a fairly consistent pivot into Hydrapple, so it is essential to have means to overwhelm it. Tyranitar, Tinkaton, and Rhyperior can provide Stealth Rock support to restrict Tornadus-T's ability to pivot into Hydrapple while being great defensive checks to Tornadus-T. Tinkaton can also provide Knock Off support to help remove key items like Tornadus-T's Assault Vest. Other Knock Off users like Scizor and Lokix can also achieve this while also getting Hydrapple in against Pokemon they struggle to get through like Toxapex and Cobalion.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620325, "username": "ThatOneApple"}, {"user_id": 344575, "username": "Twilight"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 344575, "username": "Twilight"}, {"user_id": 524894, "username": "cheru"}, {"user_id": 515132, "username": "Monky25"}, {"user_id": 620325, "username": "ThatOneApple"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  }
}