{
  "Dragonite": {"sets": {"Choice Band": {}}},
  "Porygon2": {"sets": {"Mixed Support": {}}},
  "Entei": {"sets": {"Choice Band": {}, "Bulky Attacker": {}}},
  "Registeel": {"sets": {"IronPress": {}}},
  "Latias": {
    "overview": "<ul> <li> <p>Latias is an exceptional Tailwind setter thanks to its great bulk, defensive typing, Levitate, and solid Speed. It also checks common threats such as Landorus and Urshifu-R.</p> </li> <li> <p>Assault Vest Kingambit is a great partner, beating most of Latias's counters like Flutter Mane, Gholdengo, and, to an extent, Incineroar. It also makes great use of Tailwind, and Latias beats most of its counters as well.</p> </li> <li> <p>Latias can be very tough to remove especially if it Terastallizes into a Poison-type, which, when combined with Levitate, has only one weakness and many valuable resistances. This becomes extra apparent when using Recover, which lets it clean up late-game when positioned well, especially if Mist Ball gets some Special Attack drops.</p> </li> </ul>",
    "sets": {"Bulky Tailwind Setter": {"description": "<ul> <li> <p>Ice Beam is great coverage in general and very important for OHKOing Landorus, one of Latias's best and most important matchups.</p> </li> <li> <p>Rocky Helmet lets Latias punish common and important moves like Fake Out and U-turn. It also breaks Chien-Pao's Focus Sash if it opts to run Ice Spinner and heavily discourages the prevalent Urshifu-R from attacking it.</p> </li> <li> <p>The Speed EVs allow it to outspeed max Speed Landorus, the Special Attack EVs let it OHKO Urshifu-R and Landorus more consistently, and the rest of the EVs are used to optimize its bulk.</p> </li> <li> <p>Tera Poison, when paired with Levitate, makes Latias very difficult to break, as Psychic-types, besides opposing Latias, are not common, and the Poison typing offers resistances to many relevant offensive types, the most important of which being Fairy, because of Flutter Mane.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"username": "Robbie35646", "user_id": 562330}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sole Survivor", "user_id": 518634}]}, {"name": "Grammar checked by", "members": [{"username": "yoko", "user_id": 617542}, {"username": "Tbolt", "user_id": 555379}]}]}
  },
  "Whimsicott": {"sets": {"Offensive Utility": {}, "Sun Setter": {}}},
  "Amoonguss": {"sets": {"Bulky Support": {}}},
  "Tornadus": {"sets": {"Offensive Tailwind": {}, "Bulky": {}}},
  "Landorus": {"sets": {"Life Orb": {}}},
  "Landorus-Therian": {"sets": {"Choice Scarf": {}}},
  "Incineroar": {"sets": {"Support": {}}},
  "Rillaboom": {"sets": {"Offensive Pivot": {}, "Priority Attacker": {}}},
  "Indeedee-F": {"sets": {"Psyspam Support": {}}},
  "Urshifu": {"sets": {"Glass Cannon": {}}},
  "Urshifu-Rapid-Strike": {"sets": {"Choice Scarf": {}, "Mystic Water": {}}},
  "Regidrago": {"sets": {"Offensive": {}}},
  "Kingambit": {"sets": {"Swords Dance": {}, "Assault Vest": {}}},
  "Flutter Mane": {"sets": {"Offensive": {}, "Bulky Specs": {}, "Offensive Support": {}}},
  "Iron Bundle": {"sets": {"Glass Cannon": {}}},
  "Iron Hands": {"sets": {"Offensive": {}}},
  "Gholdengo": {"sets": {"Nasty Plot": {}}},
  "Chien-Pao": {
    "overview": "<ul> <li> <p>Chien-Pao is an excellent offensive Pokemon bearing a great offensive typing and a fantastic Speed tier. Chien-Pao is capable of taking on the majority of the format, and it's especially strong against Tornadus and Landorus thanks to its typing and Sword of Ruin.</p> </li> <li> <p>Incineroar has Intimidate and resists both of Chien-Pao's STAB attacks, which makes it difficult for Chien-Pao to deal with, therefore Urshifu-R is a strong partner as it utilizes Sword of Ruin and pressures Incineroar.</p> </li> <li> <p>Chien-Pao also struggles to take on Urshifu-R and Iron Hands, which take any of its attacks comfortably and threaten it in return.</p> </li> </ul>",
    "sets": {
      "Glass Cannon": {
        "description": "<ul> <li> <p>Ice Spinner is an alternative Ice-type STAB move that provides increased accuracy and a way for teams to handle Rillaboom and Indeedee-F in exchange for higher power and a flinch chance. However, it prevents Chien-Pao from attacking Rocky Helmet Amoonguss and Latias as freely.</p> </li> <li> <p>Chien-Pao uses Sacred Sword as coverage for relevant Pokemon such as Incineroar and Kingambit.</p> </li> <li> <p>Chien-Pao utilizes Focus Sash to make up for its poor defensive typing combined with its lackluster bulk, as it allows it to stay an extra turn on the field to help partners exploit Sword of Ruin, which is significant for offensive compositions.</p> </li> <li> <p>With Tera Stellar, Chien-Pao has the option to pick up OHKOs on Pokemon it usually wouldn't be able to OHKO, such as Flutter Mane and Amoonguss. However, it has to be wary of pivots and foes using Protect, the power boost is temporary. Chien-Pao can also use Tera Ghost to remove its Fighting weakness and become immune to priority moves like Fake Out, which is crucial for Focus Sash.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"username": "LameLiarLeo", "user_id": 641287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Robbie35646", "user_id": 562330}]}, {"name": "Grammar checked by", "members": [{"username": "yoko", "user_id": 617542}, {"username": "Clouds", "user_id": 356215}]}]}
  },
  "Chi-Yu": {"sets": {"Choice Specs": {}}},
  "Walking Wake": {"sets": {"Life Orb": {}}},
  "Ogerpon-Wellspring": {"sets": {"Follow Me Support": {}}},
  "Archaludon": {"sets": {"Rain Bulky Attacker": {}}},
  "Raging Bolt": {"sets": {"Bulky Attacker": {}}}
}