{
  "Ninetales-Alola": {"sets": {"Aurora Veil": {"description": "<ul> <li>40 SpA EVs allow Ninetales to OHKO Deoxys-A with Blizzard or 2HKO with Icy Wind, especially useful after the speed drop.</li> </ul>"}}},
  "Dragonite": {
    "outdated": true,
    "overview": "<p>Thanks to the sheer power of Tera Normal Extreme Speed, Dragonite is one of DOU’s biggest threats, threatening to KO a large portion of the metagame. Dragonite also has excellent coverage, allowing it to hit any Pokémon that aren't afraid of Extreme Speed, such as Gholdengo and Iron Treads. Dragonite’s Dragon/Flying allows it to take attacks such as Chi-Yu's Heat Wave and Palafin's Jet Punch while also granting it immunity to Earthquakes from Garchomp and Great Tusk. Tera Normal also allows it to survive threatening Dragon- and Ice-type attacks. Inner Focus lets Dragonite avoid Attack drops from Intimidate and flinches from Fake Out. Dragonite is most commonly paired with Chien-Pao, as Sword of Ruin lowers the Defense of foes, allowing Extreme Speed to deal more damage. This pairing is preferred by offensive teams but can fit on other archetypes appreciate Dragonite's power and priority. Due to Dragonite's heavy dependence on Extreme Speed, Pokemon that can block priority moves such as Farigiraf, Tsareena, and Indeedee-F limit its effectiveness. Dragonite also struggles against Pokémon with high physical bulk that can take an Extreme Speed and threaten it in return such as Great Tusk, Iron Hands, Amoonguss, and Garganacl. Additionally, Dragonite is greatly hindered by Stealth Rock, which nullifies Multiscale and limits its longevity.</p>",
    "comments": "<h4>Other Options</h4> <ul> <li>Life Orb can be used on offensive teams that need Dragonite to be capable of switching moves while still dealing lots of damage.</li> <li>A mixed Life Orb set with Hurricane is a viable set on rain teams. Life Orb or Sharp Beak allows Dragonite to threaten an OHKO on Amoonguss.</li> <li>Iron Head Dragonite is useful on teams that want increased damage against Fairy-types such as Grimmsnarl and Sylveon.</li> <li>Running an Assault Vest on Dragonite gives it more bulk and allows it to switch between moves at the cost of decreasing its offensive presence.</li> <li>Weakness Policy Tailwind Dragonite can use Multiscale to tank a hit and leverage speed control while dealing increased damage.</li> </ul>",
    "sets": {
      "Choice Band": {
        "description": "<ul> <li>Extreme Speed allows Dragonite to KO opposing priority users such as Murkrow and Palafin before they can move.</li> <li>Dragon Claw gives Dragonite a strong STAB move in positions where using Extreme Speed is undesirable. It also threatens an OHKO on opposing Dragonite and Garchomp.</li> <li>Ice Spinner allows Dragonite to remove the priority-blocking Psychic Terrain, threaten an OHKO on opposing Dragonite and Garchomp, and hit the many Ground-types in the tier super effectively.</li> <li>Alternatively, Facade allows Dragonite to avoid the damage reduction from being burned and is boosted by Tera Normal.</li> <li>One of Fire Punch, Stomping Tantrum, or Earthquake is wanted to damage Steel-types. Fire Punch allows Dragonite to hit Grass- and Ice-types such as Amoonguss, Abomasnow, and Chien-Pao, while Earthquake allows it to hit Rock-, Electric-, and Fire-type Pokemon such as Glimmora, Iron Hands, and Armarouge. Earthquake is most useful on teams with teammates that are immune to Ground-type attacks.</li> <li>The given EV spread maximizes Dragonite's damage and bulk, as it does not need to invest in Speed thanks to Extreme Speed's priority.</li> <li>Multiscale can be used over Inner Focus on teams that want additional bulk and have a method of entry hazard removal.</li> <li>Choice Band lets Dragonite focus on spamming Extreme Speed and boosts its damage immensely.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 554572, "username": "Lemurro"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 586432, "username": "big pichu"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Porygon2": {"sets": {"Trick Room": {"description": "<ul> <li>This EV Spread survives two Deoxys-A Expanding Forces in Psychic Terrain, as well as two Iron Hands Drain Punches.</li> </ul>"}}},
  "Tyranitar": {"outdated": true, "sets": {"Bulky Attacker": {}}},
  "Pelipper": {"sets": {"Rain Setter": {"description": "<ul> <li>This EV Spread survives Choice Specs Flutter Mane Moonblast and outspeeds Iron Bundle in Tailwind.</li> </ul>"}}},
  "Torkoal": {"outdated": true, "sets": {"TR Attacker": {}}},
  "Heatran": {
    "sets": {
      "Bulky": {},
      "Assault Vest": {
        "outdated": true,
        "description": "<p>Assault Vest Heatran uses its unique typing and defensive stats to match up well against common special attackers such as Flutter Mane and Gholdengo and threaten them back with its great offensive stats and wide coverage. While Heatran boasts an innately good defensive typing, Tera Grass allows it to turn its common weaknesses to Ground and Water into resistances, letting it match up better against the likes of Landorus-T and Palafin-H. Heat Wave is a spread STAB attack that chips away at foes, notably 2HKOing Amoonguss. Flash Cannon is Heatran's best way of hitting Fairy-types, as it OHKOes Diancie and 2HKOes Flutter Mane. Heavy Slam OHKOes Flutter Mane but is generally less reliable because it can be weakened by Intimidate and does less damage to Diancie and opposing Tera Grass Heatran mirror. Tera Blast hits Water- and Ground-types super effectively once Heatran has Terastallized, notably OHKOing Great Tusk and 2HKOing Bulk Up Palafin-H. Earth Power hits the Fire-types such as Volcanion, Chi-Yu, and opposing Heatran that otherwise resists all of Heatran's attacks. Heatran's base resistances let it take common Fairy-, Ice-, and Steel-type attacks such as Flutter Mane's Moonblast, Chien-Pao's Ice Spinner, and Gholdengo's Make It Rain much better. After Terastallization, Heatran matches up better against Palafin-H, Volcanion, and Iron Hands at the cost of receiving more damage from the aforementioned attacks. Heatran has a lot of defensive responsibilities on most teams, so Terastallization should not be used too frivolously. Heatran commonly finds itself in Fire / Water / Grass cores with Rillaboom and Palafin, as they complement each other offensively and defensively, with Rillaboom eradicating Water-types and Palafin punching through Fire-types. Iron Hands is a common Heatran partner that can pressure Palafin and Volcanion with Wild Charge and Chi-Yu and Tera Dark Kingambit with Drain Punch. Heatran has no form of recovery, so it appreciates teammates that can extend its longevity, such as Cresselia with Lunar Blessing and Amoonguss with Pollen Puff.</p>"
      }
    }
  },
  "Cresselia": {"outdated": true, "sets": {"Trick Room": {"description": "<p>This EV spread survives a Dark Pulse from Timid Choice Specs Chi-Yu.</p>"}}},
  "Whimsicott": {"sets": {"Tailwind Support": {"description": "<ul> <li>This EV Spread outspeeds Timid Glimmora and neutral nature Base 100s such as Chi-Yu.</li> </ul>"}, "Focus Sash Support": {"description": "<ul> <li>This set is more useful for Beat Up support, however if Moonblast is chosen, 36 HP / 220 SpA / 252 Spe can be used to OHKO Chien-Pao with Moonblast.</li> </ul>"}}},
  "Lilligant-Hisui": {"outdated": true, "sets": {"Sun Support": {}}},
  "Amoonguss": {
    "sets": {
      "Redirection Support": {
        "description": "<ul> <li> <p>Amoonguss is the tier’s premier redirector, neutralizing foes with Spore and sustaining its teammates with Pollen Puff. Its defensive prowess, coupled with Regenerator, provides the sustainability to soak up hits while supporting its team. Amoonguss pairs incredibly well with setup attackers such as Bulk Up Palafin-H and Swords Dance Iron Hands, which appreciate its redirection and healing capabilities and make up for its near-nonexistent offensive pressure. While Amoonguss is a great support Pokemon, it struggles against Fire-types like Heatran and Volcanion, and its utility is diminished by Cresselia's Lunar Blessing and Safety Goggles users.</p> </li> <li> <p>As the most consistent sleep user in the tier, Amoonguss's Spore forces switches to powder-immune foes. This is especially powerful in Trick Room, as Amoonguss can utilize its low Speed to render foes immobile before they can act.</p> </li> <li> <p>Rage Powder makes it easier for teammates to use setup moves like Swords Dance and Bulk Up or set field conditions such as Trick Room or Tailwind safely. In addition, it can draw attacks away from frail attackers like Chien-Pao and Flutter Mane, generating space for them.</p> </li> <li> <p>Pollen Puff heals teammates and damages foes in a pinch, allowing Amoonguss to provide value even during the effects of Taunt.</p> </li> <li> <p>Clear Smog enables Amoonguss to check setup threats like Bulk Up Palafin-H and Belly Drum Iron Hands. Protect is helpful in scouting foes’ moves, blocking Fake Out, and improving overall survivability.</p> </li> <li> <p>244 HP and 136 Special Defense EVs ensure that Amoonguss can take two Shadow Balls from Choice Specs Flutter Mane after Sitrus Berry recovery. The remaining EVs are dumped into Defense.</p> </li> <li> <p>28 Speed IVs let Amoonguss underspeed Iron Hands and Kingambit under Trick Room.</p> </li> <li> <p>Sitrus Berry improves Amoonguss's survivability when redirecting multiple attacks. Rocky Helmet can be used to rack up damage upon redirecting contact attacks such as Palafin-H's Jet Punch and punish U-turn from Rillaboom and Landorus-T.</p> </li> <li> <p>Tera Water turns Amoonguss's weaknesses to Fire- and Ice-type moves from foes such as Volcanion and Chien-Pao into resistances. Tera Dark can be used to improve its matchup against Indeedee-F and Armarouge teams and gain immunity to Prankster Taunt from Tornadus and Grimmsnarl.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 512635, "username": "AIRedzone"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 531334, "username": "zoe"}]}]}
  },
  "Volcarona": {"outdated": true, "sets": {"Quiver Dance": {}}},
  "Tornadus": {
    "sets": {
      "Defensive Tailwind": {},
      "Offensive Tailwind": {
        "description": "<ul> <li> <p>Tornadus is an incredibly effective Tailwind user in DOU thanks to Prankster and its high Speed stat, ensuring that it can give its team a speed boost on demand. It pairs best with mid-speed attackers, such as Gholdengo and Landorus, which appreciate the immediate speed boost to knock out fast threats before they can respond with their own attacks.</p> </li> <li> <p>Bleakwind Storm is Tornadus's best attack, dealing relatively consistent damage to both opponents. While it won't win any awards for damage output, it allows Tornadus to stay on the field without losing too much momentum after using Tailwind.</p> </li> <li> <p>Taunt is used primarily to stop Pokemon like Cresselia and Diancie from setting up Trick Room. It can also prevent Protect, most entry hazards, setup moves, and redirection from the likes of Amoonguss, allowing you to make the most of Tailwind's limited duration.</p> </li> <li> <p>Protect lets Tornadus avoid powerful attacks that might KO it or faster moves like Fake Out or an opposing Taunt that would stop it from using Tailwind. Protect can also be used to stall out field effects like weather and Trick Room.</p> </li> <li> <p>Focus Sash is Tornadus's go-to item and lets it survive any one hit in spite of its mediocre bulk. Covert Cloak can be used instead to set Tailwind against Fake Out users.</p> </li> <li> <p>Tera Ghost grants Tornadus an immunity to both Fake Out and Dragonite's Extreme Speed, which both have higher priority than Tornadus's Prankster-boosted moves and can prevent Tailwind from going up. However, Tornadus should usually not Terastallize, as it is unlikely to represent a game-ending threat. Tornadus should only Terastallize when it will directly lead to winning a game.</p> </li> <li> <p>Tornadus has several other options over Taunt in the third moveslot. Rain Dance and Sunny Day can help support Pokemon like Palafin and Flutter Mane, respectively. Icy Wind, meanwhile, can double down on speed control while dealing some chip damage and is very helpful against opposing Tailwind teams.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 27554, "username": "Arcticblast"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 550367, "username": "Smudge"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Landorus": {
    "sets": {
      "Special Attacker": {
        "description": "<ul> <li> <p>Landorus is one of the strongest offensive Pokemon in the metagame with its powerful Sheer Force- and Life Orb-boosted attacks, which threaten much of the tier for super effective damage, including many metagame staples such as Archaludon, Incineroar, and Raging Bolt. It excels at forcing the opponent into defensive positions, creating opportunities to play aggressively with Landorus and its teammates.</p> </li> <li> <p>Earth Power annihilates targets weak to it and puts massive dents in most neutral targets. Sludge Bomb allows Landorus to hit Grass- and Flying-types such as Rillaboom, Ogerpon-W, and Tornadus, which resist or are immune to its Ground-type moves. Tera Poison elevates Sludge Bomb to a STAB move, which secures the OHKO on Assault Vest Rillaboom, bulky Ogerpon-W, and Alolan Ninetales as long as Aurora Veil is not active.</p> </li> <li> <p>Sandsear Storm gives Landorus the option of a strong spread move, making it even more difficult to play around and preventing foes with Follow Me or Rage Powder from redirecting its attacks. This move is especially potent when used in the rain, as it becomes a 100% accurate spread move, allowing Landorus to reliably apply offensive pressure to both targets simultaneously.</p> </li> <li> <p>Alternatively, Substitute gives Landorus the ability to safely fire off strong Earth Powers and Sludge Bombs while attracting attention to itself, which can supply its teammates with opportunities to set up or attack on their own. Substitute guarantees that Landorus will survive at least one attack while behind it, which it appreciates given its mediocre bulk that ordinarily leaves it vulnerable to getting OHKOed by super effective attacks or getting KOed by priority moves when weakened. Landorus's offensive pressure forces the opponent to switch and use Protect a lot, creating many opportunities for it to set up a Substitute. This is especially true when it is paired with Pokemon that can apply Fake Out pressure such as Rillaboom and Incineroar.</p> </li> <li> <p>While Tera Poison increases Landorus's offensive capabilities, a more defensive route can also be taken with Tera Steel, which turns its glaring 4x Ice weakness into a resistance, allowing it to flip the script on foes that would normally force it out such as Chien-Pao, Kyurem, and Alolan Ninetales. Additionally, Steel is a generally useful defensive typing with many miscellaneous resistances, including ones to common attacks such as Rillaboom's Grassy Glide and Tornadus's Bleakwind Storm, among others.</p> </li> <li> <p>Landorus appreciates teammates that can set up Tailwind such as Tornadus and Whimsicott, as it is naturally outsped and threatened with super effective damage by common Pokemon such as Ogerpon-W, Chien-Pao, and Alolan Ninetales. Effective speed control and positioning can allow Landorus to gain the advantage on these foes and others, making Pokemon that supply redirection support useful teammates as well, including Indeedee-F, Ogerpon-W, and Sinistcha. Teammates that struggle either offensively or defensively against Fire- and Steel-types, such as Gholdengo, Kingambit, and Kyurem, appreciate Landorus's ability to neutralize those threats.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609101, "username": "Iceberg77"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 550367, "username": "Smudge"}, {"user_id": 608134, "username": "bagel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "I'M A' FIRIN' MAH SOLARBEAM!!"}]}]}
  },
  "Landorus-Therian": {"outdated": true, "sets": {"Support": {}, "Assault Vest": {}}},
  "Diancie": {
    "sets": {
      "Trick Room Sweeper": {
        "description": "<ul> <li> <p>Diancie is an effective offensive Trick Room setter due to its low Speed and high Attack, allowing it to punch holes in the opposing team. Its high defensive stats make it very difficult to take out in a single attack and demands whittling it down with multiple neutral attacks instead of super effective attacks, out of fear of activating Weakness Policy.</p> </li> <li> <p>Diamond Storm hits a lot of top threats, notably 2HKOing Chien-Pao, Dragonite, and Volcanion. Gaining Defense boosts from it also helps Diancie against physical attackers such as Rillaboom and Palafin.</p> </li> <li> <p>Body Press synergizes very well with Defense boosts from Diamond Storm, giving Diancie useful coverage to hit foes it would normally have a tough matchup against such as Kingambit and Hisuian Goodra.</p> </li> <li> <p>Trick Room allows Diancie to support itself and its teammates such as Iron Hands and Torkoal by turning their low Speed into an advantage. Diancie is an effective Trick Room setter as it is hard to remove and, unlike other Trick Room setters such as Cresselia, has the offensive capabilities to make the most of it.</p> </li> <li> <p>Foes must always be wary of Weakness Policy, as activating it turns Diancie into a fearsome sweeper. As such, Diancie forces opponents to either OHKO it or whittle it down with multiple neutral attacks, as a weak super effective attack into the bulky Diancie will put it in a commanding position. This is especially effective once Diancie has accrued enough Defense boosts, as even Rillaboom's Wood Hammer and Palafin's Wave Crash may not OHKO it anymore. Diancie can also use Mental Herb to guarantee it sets up Trick Room once against Taunt users such as Tornadus and Landorus-T.</p> </li> <li> <p>Tera Grass allows Diancie to resist the Grass-, Water-, and Ground-type attacks that would otherwise OHKO it before a Defense boost such as Rillaboom's Wood Hammer, Palafin's Wave Crash, and Landorus's Earth Power. It also removes Diancie's 4x Steel-type weakness, which helps it matchup better against Steel-type foes like Heatran and Gholdengo and Pokemon with Steel-type coverage such as Iron Hands. Tera Grass also grants Diancie an immunity to powder moves, preventing Amoonguss's Spore from affecting it and circumventing Rage Powder.</p> </li> <li> <p>Clear Body notably makes Diancie immune to Landorus-T's Intimidate and Grimmsnarl's Parting Shot, allowing Diancie to maintain a constant offensive presence on the field during its valuable Trick Room turns.</p> </li> <li> <p>A Sassy Nature and maximum HP investment allow Diancie to survive a Steam Eruption from Volcanion. 24 Defense EVs allow Diancie to survive a Jolly Ogerpon-Wellspring Ivy Cudgel.</p> </li> <li> <p>Diancie enables Trick Room attackers like Kingambit, Torkoal, and Glastrier to sweep alongside it. Diancie wants Fake Out support to help set up Trick Room more easily. Rillaboom is a Fake Out user that can eliminate Palafin and provide Grassy Terrain recovery , while Iron Hands functions better under Trick Room specifically and deals with Volcanion and Kingambit better. Amoonguss also acts as a great partner for Diancie, with its Rage Powder and Spore protecting it from the Ground, Water, and Steel attacks that would threaten it. Pollen Puff also helps to increase its longevity.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552611, "username": "NinjaSnapple"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 550367, "username": "Smudge"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Volcanion": {"outdated": true, "sets": {"Assault Vest": {"description": "<p>A Quiet Nature instead of a Modest Nature allows Volcanion to OHKO Flutter Mane without bulk investment with Heavy Slam.</p>"}, "Substitute": {}}},
  "Incineroar": {
    "sets": {
      "Defensive Pivot": {
        "description": "<ul> <li>Incineroar's combination of Intimidate, Fake Out, and Parting Shot is one of the strongest utility toolkits in the tier, facilitating both defensive and offensive play by maintaining good positioning and increasing the longevity of its teammates. While it is a top-tier supportive piece, Incineroar lacks strong damage output against neutral targets and relies on the teammates it supports to win the game.</li> <li>Fake Out generates free turns for teammates, providing opportunities for a teammate like Kingambit to set up with Swords Dance. Alternatively, it can allow a teammate to safely switch in, take a KO, or use a supportive move like Tailwind or Trick Room.</li> <li>Flare Blitz and Knock Off are strong, consistent damaging options. Flare Blitz offers more immediate damage that can OHKO Chien-Pao and threatens common Pokemon like Gholdengo and Rillaboom. On the other hand, Knock Off adds to Incineroar's utility, removing items like Clear Amulet, Porygon2's Eviolite, and Choice items. With Incineroar's low Speed stat, Parting Shot will often go last, so teammates can enter the field without the risk of being hit.</li> <li>The given EV spread allows Incineroar to survive Volcanion's Steam Eruption and Ogerpon-W's Tera Water Ivy Cudgel after Intimidate. However, Incineroar's EV spreads are extremely flexible depending on the needs of a team, whether it be offensive investment, more defensive EVs, or a higher Speed tier.</li> <li>Tera Ghost stops opposing Fake Out and grants an immunity to Fighting-type moves such as Archaludon's Body Press and Iron Hands's Close Combat. Tera Grass flips matchups against threatening  foes such as Ogerpon-W and Landorus and grants a Spore immunity.</li> <li>Incineroar fits easily on any team, but it is quite commonly paired with Rillaboom to have constant Fake Out and repositioning options or Ogerpon-W, which provides redirection support and further adds to the team's defensive capabilities while maintaining a strong offensive presence on its own. Strong attackers such as Landorus,Chien-Pao, and slower, setup-based teammates like Swords Dance Kingambit greatly appreciate Incineroar's utility.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 550367, "username": "Smudge"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 608134, "username": "bagel"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Tsareena": {"outdated": true, "sets": {"Assault Vest": {"description": "<ul> <li>The given EV spread and nature allow Tsareena to outspeed Iron Bundle under Tailwind, retain enough Attack to OHKO 252 HP Palafin-Hero with Power Whip, then invests the remaining EVs in HP.</li> </ul> <p>This is a sample set as we work on proper analyses. Stay tuned!</p>"}}},
  "Kommo-o": {"sets": {"Iron Defense": {}, "Clangorous Soul": {"description": "<ul> <li>This EV Spread survives a Chien-Pao Ice Spinner and outspeeds Dragapult after Clangorous Soul.</li> </ul>"}}},
  "Rillaboom": {
    "sets": {
      "Assault Vest": {
        "description": "<ul> <li> <p>Rillaboom is a strong offensive pivot that can threaten large amounts of damage; it also provides Fake Out support for setup users like Kingambit, Gholdengo, and Raging Bolt and creates free turns for Pokemon such as Tornadus and Diancie to use their speed control options.</p> </li> <li> <p>Grassy Glide is a priority option that lets Rillaboom pick up KOs on chipped foes throughout the game and notably 2HKOes Chien-Pao and Ursaluna-B. Wood Hammer 2HKOes foes that do not resist Grass, including bulky Pokemon such as Volcanion, Landorus-T, and Iron Hands, as well as OHKOing non-Defense boosted Diancie and potentially uninvested Landorus.</p> </li> <li> <p>U-turn provides Rillaboom with an opportunity to pivot throughout the game and make heavy use of its support options. This allows it to keep Grassy Terrain in play as well as cycle Fake Out turns to support its teammates. Rillaboom's offensive presence and Fake Out support enable it to force more defensive plays from opponents, allowing it to pivot and flip matchups.</p> </li> <li> <p>High Horsepower can be brought instead of Wood Hammer or U-turn, which allows Rillaboom to hit Pokemon that often wall it, such as Archaludon, Gholdengo, Volcanion, and Chi-Yu. However, losing Wood Hammer or U-turn comes at the cost of being able to threaten fewer OHKOs and pivot less, respectively.</p> </li> <li> <p>Rillaboom's Grassy Terrain provides recovery for bulky partners like Raging Bolt and Volcanion, enables setup sweepers like Grassy Seed Chi-Yu and Kingambit, and removes Psychic Terrain for priority attackers like Chien-Pao and Kingambit. Due to Rillaboom's immense bulk and U-turn pivoting, its Terrain is able to be set up multiple times per battle easily.</p> </li> <li> <p>Assault Vest boosts Rillaboom's Special Defense, allowing it to switch in often and making it more effective against Pokemon like Gholdengo and Archaludon. Assault Vest allows Rillaboom to survive one Sludge Bomb from Landorus as well as one Bleakwind Storm from offensive Tornadus.</p> </li> <li> <p>Tera Fire allows Rillaboom to flip matchups against prolific Fire-, Ice- and Grass-types, such as Chi-Yu, Incineroar, Ogerpon-H, and Chien-Pao, which it struggles to combat defensively without using Tera. Tera Grass can also be used on teams where Rillaboom is needed to perform more offensively, boosting its STAB Grassy Glide and Wood Hammer. Tera Grass guarantees an OHKO with Wood Hammer and a 2HKO with Grassy Glide against Ting-Lu, Ogerpon-W, Landorus, and Walking Wake.</p> </li> <li> <p>Rillaboom has the flexibility to fit on almost any team because of its immense utility, power, and bulk. Key teammates include bulky setup Pokemon such as Kingambit, Raging Bolt, and Gholdengo, which appreciate its Grassy Terrain and Fake Out support, providing opportunities to set up and additional recovery. Priority attackers like Chien-Pao, Kingambit, and Dragonite appreciate Rillaboom's ability to remove Psychic Terrain. Landorus and Chi-Yu appreciate Rillaboom's offensive presence to threaten their common checks like Ogerpon-W as well as Fake Out support to deliver more turns of devastating attacks.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 617069, "username": "LogIce"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 608134, "username": "bagel"}, {"user_id": 619632, "username": "Schister"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Grimmsnarl": {"outdated": true, "sets": {"Dual Screens": {"description": "<ul> <li>The given EV spread and nature allow Grimmsnarl to survive a Swords of Ruin-boosted Extreme Speed from a Choice Band Tera Normal Dragonite, then invests the remaining EVs into Special Defense.</li> </ul> <p>This is a sample set as we work on proper analyses. Stay tuned!</p>"}}},
  "Indeedee-F": {"sets": {"Redirection Support": {"description": "<ul> <li>The given EV Spread survives a Rillaboom Wood Hammer in Grassy Terrain.</li> </ul>"}}},
  "Dragapult": {"outdated": true, "sets": {"Choice Band": {}, "Special Attacker": {}}},
  "Ursaluna": {"sets": {"Trick Room Attacker": {}}},
  "Ursaluna-Bloodmoon": {"sets": {"Trick Room Attacker": {"description": "<ul> <li>Maximum Speed investment can be used on teams with Tailwind instead to outspeed Flutter Mane.</li> </ul>"}}},
  "Garganacl": {
    "outdated": true,
    "overview": "<p>With solid defenses and access to reliable recovery, Garganacl can perform well in a utility role or with setup in Iron Defense. Its biggest selling points are its unique move and ability: Salt Cure offers valuable passive damage, synergizing well with its natural bulk, while Purifying Salt provides a useful immunity to status moves such as Spore and Toxic. Garganacl is difficult to break for many Pokemon, but it matches up notably well into Fire-types such as Chi-Yu and Arcanine, Flying-types like Dragonite and Iron Jugulis, and Amoonguss due to Purifying Salt. As one of the best Wide Guard users, Garganacl can block the format's many powerful spread attacks such as Gholdengo's Make It Rain, Chi-Yu's Heat Wave, and Armarouge's Expanding Force. Iron Defense lets Garganacl play as a potent wincon instead, increasing its Defense whilst simultaneously strengthening its offensive presence through Body Press. These sets can be very difficult to take down, though they often rely on using up Terastallization to be most effective. Garganacl's abysmal Speed means it will usually be relegated to moving last. Rock typing also leaves Garganacl with countless weaknesses, including to Water-, Steel-, and Fighting-type moves, meaning common Pokemon such as Palafin, Gholdengo, Iron Bundle, Iron Hands, and Great Tusk all significantly threaten it. Amoonguss is one of the best partners for Garganacl, being helpful against several of the aforementioned threats, while Garganacl checks Fire-types like Chi-Yu in return, with redirection support and healing being especially critical for Iron Defense sets. Garganacl also appreciates teammates that can check Gholdengo, especially if not using Wide Guard, so Pokemon like Chi-Yu, Arcanine, Ting-Lu, and Kingambit are other desirable additions.</p>",
    "comments": "<h4>Other Options</h4> <p>Other defensive Tera types are also usable depending on team needs. For example, Tera Poison still provides a Fighting-type resistance but doesn't gain the Dark-type weakness that Tera Ghost does. This means after Terastallization, Garganacl will still be good against Chi-Yu and gains immunity to Toxic Spikes, at the cost of not losing its Ground-type weakness. Tera Water is another alternative, offering helpful resists against Water-types like Palafin and Steel-types like Gholdengo.</p>",
    "sets": {
      "Bulky Utility": {
        "description": "<ul> <li> <p>Salt Cure forms Garganacl's offensive presence, dealing insignificant damage directly but leaving a powerful residual effect that lasts even after Garganacl leaves the field.</p> </li> <li> <p>Recover complements Garganacl's bulk, allowing it to outheal most attacks while Salt Cure passively whittles down foes.</p> </li> <li> <p>Wide Guard stops powerful spread attacks such as Make It Rain, Heat Wave, Expanding Force, and Earthquake. Stealth Rock alternatively offers chip damage throughout the match, breaking Focus Sashes and punishing attempts to remove Salt Cure's effect through switches.</p> </li> <li> <p>Protect lets Garganacl rack up Leftovers recovery and Salt Cure damage. This is especially effective against the Water- and Steel-types that threaten Garganacl, as they take increased damae from Salt Cure's effect.</p> </li> <li> <p>The given EV spread and nature patch up Garganacl's lower Special Defense, making it difficult to break through with both physical and special attacks, which is further aided by Leftovers for even more healing.</p> </li> <li> <p>Purifying Salt provides an invaluable immunity to Amoonguss's Spore and a notable resistance to Gholdengo's Shadow Ball, which assists in stalling it out with Wide Guard.</p> </li> <li> <p>Tera Ghost turns Garganacl's weakness to Fighting-types like Iron Hands and Great Tusk into an immunity, effectively leaving it with a single weakness with Purifying Salt.</p> </li> </ul>"
      },
      "Iron Defense": {
        "description": "<ul> <li> <p>Salt Cure provides passive damage, which is especially useful on this set for Pokemon that resist or are immune to Body Press, such as Gholdengo and Amoonguss.</p> </li> <li> <p>Iron Defense makes Garganacl even more difficult to knock out, while Body Press lets the boosts double as an offensive bonus too.</p> </li> <li> <p>Recover enhances Garganacl's staying power, increasing its effectiveness as a wincon.</p> </li> <li> <p>EVs and nature are used to maximize special bulk, as Iron Defense covers the physical side. Leftovers tops out Garganacl's survivability with some passive healing.</p> </li> <li> <p>Purifying Salt confers immunity to Spore and prevents a traditional form of setup counterplay in Toxic.</p> </li> <li> <p>Tera Ghost gives a valuable Fighting-type immunity, notably including Sacred Sword, which will ignore the Defense boosts, and leaves Garganacl with effectively just one weakness in combination with Purifying Salt.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 243662, "username": "Yoda2798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 531334, "username": "zoe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Armarouge": {"outdated": true, "sets": {"TR Attacker": {}}},
  "Palafin": {
    "sets": {
      "Choice Band": {},
      "Bulk Up": {
        "outdated": true,
        "description": "<p>Bulk Up Palafin builds upon its natural bulk and Attack, letting it function as a strong priority attacker who uses its Defense to brazenly set up and become a threatening sweeper that is difficult to KO for common physical attackers like Chien-Pao, Landorus-T, and Kingambit. Jet Punch circumvents common speed control and is threatening against the frailer metagame, notably OHKOing Chi-Yu and Landorus at +1. Drain Punch is a reliable means of recovery in addition to Leftovers while also hitting popular Dark-types like Kingambit and Chien-Pao, as well as common Water-resistant or immune foes such as Rillaboom and Volcanion harder. Tera Grass provides an immunity to Amoonguss's Spore and Rage Powder, as well as resistances to Grass- and Electric-type attacks such as Rillaboom's Wood Hammer and Iron Hands's Wild Charge, which would otherwise OHKO Palafin. Palafin's base forme has poor damage output and bulk, so it is often ideal for it to lead and pivot out immediately to activate Zero to Hero. This is so crucial to Palafin's functioning that it is very telegraphed and easily exploitable with powerful attacks directed at it. To cover for this, Palafin may lead together with a Fake Out user or a redirector to reduce incoming damage. Bulk Up Palafin pairs well with partners that can remove Psychic Terrain, use Fake Out to generate free turns for Palafin to set up, and extend Palafin's longevity. Rillaboom fulfills all of these roles, with Grassy Terrain granting additional passive recovery. Cresselia is another good partner, as its Lunar Blessing heals Palafin and cures burn and poison, which would otherwise severely limit Palafin's offensive output or the turns it can stay on field. Amoonguss's Rage Powder redirects threatening attacks such as Iron Hands's Wild Charge, removes Toxic Spikes that reduce Palafin's longevity, and provides a major source of recovery for Palafin with Pollen Puff. Iron Hands is a Fake Out user whose Electric-type attacks eliminate opposing Water-types that resist Jet Punch. Grimmsnarl can also increase Palafin's bulk and create setup opportunities with its dual screens. As Amoonguss effortlessly walls Palafin and undoes its progress with Clear Smog, Palafin requires partners that deal with it effectively, like Heatran, Chien-Pao, and Chi-Yu.</p>"
      }
    }
  },
  "Glimmora": {
    "sets": {
      "Meteor Beam": {
        "description": "<ul> <li> <p>Meteor Beam is one of the most powerful single-turn attacks in the tier when used in conjunction with Power Herb to remove the charge turn and immediately get a +1 Special Attack increase.</p> </li> <li> <p>Sludge Bomb is a more reliable STAB attack that threatens Rillaboom, Ogerpon-W, and Ogerpon-H. Earth Power provides solid coverage that hits Steel-types like Kingambit and Gholdengo, which its STAB moves fail to hit effectively. Spiky Shield serves as an enhanced Protect that keeps Glimmora safe from damage while damaging foes that target it with contact moves.</p> </li> <li> <p>Glimmora's ability, Toxic Debris, serves as a way of punishing the foe for landing physical attacks on Glimmora by setting a layer of Toxic Spikes on their side.</p> </li> <li> <p>Both Toxic Debris and Spiky Shield discourage foes from targeting Glimmora with physical moves, as the chip damage from either of them can break Focus Sash and allow Glimmora and its teammates to nab KOs that would be missed otherwise.</p> </li> <li> <p>Tera Grass turns Glimmora's Ground and Water weaknesses into resistances while also giving it Rage Powder and Spore immunity. Tera Flying can be used instead to provide Glimmora with a full Ground-type immunity.</p> </li> <li> <p>While there may be some instances where it is better to be cautious in using Meteor Beam, as it can only be used once reliably, Glimmora generally wants to use it as soon as possible to get the Special Attack boost and allow for more powerful attacks on subsequent turns.</p> </li> <li> <p>Prankster Tailwind users like Tornadus and Whimsicott are great teammates for providing immediate speed control to make up for Glimmora's mediocre Speed. Pokemon that outspeed and OHKO Landorus before it can OHKO Glimmora like Ogerpon-W and Chien-Pao are also greatly appreciated partners. Chi-Yu also works well alongside Glimmora, boosting its damage output with Beads of Ruin and using Fire-type moves to hit Steel-types hard.</p> </li> </ul>"
      },
      "Hazards Setter": {}
    },
    "credits": {"writtenBy": [{"user_id": 154787, "username": "KennyJ"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 608134, "username": "bagel"}, {"user_id": 228280, "username": "DaAwesomeDude1"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Farigiraf": {"outdated": true, "sets": {"TR Attacker": {}}},
  "Kingambit": {
    "sets": {
      "Swords Dance": {},
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest Kingambit leverages its great bulk and defensive typing to take attacks from some of the metagame's most common special attackers, such as Raging Bolt and Gholdengo, and threaten significant damage in return with its high Attack and excellent offensive movepool. Its wide array of coverage and relative lack of weaknesses make it scary for foes to trade with, and Defiant deters common Intimidate users such as Incineroar and Hisuian Arcanine from switching in lest Kingambit become too powerful and take over games with its Sucker Punch pressure, though it is not as potentially game-ending as its Swords Dance set.</li> <li>Kowtow Cleave does a great deal of consistent damage and notably OHKOes Indeedee-F and bulkless Gholdengo. Sucker Punch circumvents Kingambit's middling Speed tier by pressuring weakened faster foes such as Landorus, and it becomes especially threatening after a Defiant boost. Iron Head OHKOes Fairy-types such as Diancie and Alolan Ninetales as well as hitting common Ice-types like Baxcalibur and Kyurem for a lot of damage. Low Kick is Kingambit's best means to hit opposing Steel-types such as opposing Kingambit and Heatran, as well as opposing Dark-types like Incineroar and Chi-Yu. Brick Break is another option that does more damage to Chi-Yu and has the advantage of breaking screens.</li> <li>Kingambit has a great deal of flexibility in its Tera type, allowing it to cover a wide variety of team-specific weaknesses both offensively and defensively, although some Tera types have greater offensive potential than others. Tera Fairy, for example, lets Kingambit resist Iron Hands's Fighting-type attacks and 2HKO it in return with Tera Blast. Tera Flying grants Kingambit immunity to Landorus's Earth Power and a way to OHKO Ogerpon-W and 2HKO Amoonguss and Rillaboom. Tera Ghost leaves it immune to Fake Out and common Fighting-type attacks from Iron Hands and Body Press users such as Archaludon and Diancie.</li> <li>With an Assault Vest, Kingambit is able to soak up moves from common special attackers such as Gholdengo, Raging Bolt, and Glimmora and beat them with its own powerful attacks. It is particularly good against Tornadus as it resists Bleakwind Storm, which can also trigger Defiant. As such, Kingambit boasts a great deal of defensive responsibility, but it must remain wary of being whittled down too much, as accumulated damage over time and a lack of recovery means it can eventually get picked off by faster attackers with even neutral coverage.</li> <li>Teammates like Landorus which have more consistent ways of threatening Steel-types like Heatran and Archaludon are required for Kingambit. Conversely, Landorus is one of the biggest threats to Kingambit, and as such it appreciates support from faster attackers that can OHKO it like Ogerpon-W and Chien-Pao. To make up for its low Speed, pivots like Incineroar and Rillaboom can help Kingambit get into attacking positions.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 192134, "username": "ryo yamada2001"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 550367, "username": "Smudge"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Iron Bundle": {
    "overview": "<p>Boasting a blistering base 136 Speed stat, outrun only by Dragapult, and impressive Special Attack, Iron Bundle is truly a force to be reckoned with in DOU. Its offense especially shines when paired with Chi-Yu, which greatly increases Iron Bundle's damage output with Beads of Ruin. Iron Bundle has excellent speed control with Icy Wind, which, when combined with its high Speed, can easily ensure that it and its allies outspeed the enemy team. However, Iron Bundle is a fairly fragile Pokemon, especially against powerful special attackers such as Chi-Yu and Gholdengo.</p>",
    "comments": "<h3>Other Options</h3> <p>Iron Bundle can run Encore over Icy Wind or Protect, easily locking most Pokemon into a move such as Protect or Fake Out thanks to its high Speed. On a snow team with Abomasnow, Iron Bundle can run Blizzard as a powerful spread attack, and it also can maximize its damage output with Tera Ice. Snow also boosts Iron Bundle's Defense, making it particularly more effective against priority spam teams with Dragonite and Palafin. 252 HP and 64 Special Defense EVs can be used with Assault Vest to survive an Overheat from Choice Scarf Chi-Yu, and Iron Bundle still has above 152 Speed EVs left for outspeeding Meowscarada. 40 HP EVs allow Iron Bundle to avoid a potential OHKO from Chien-Pao's Sacred Sword if Chien-Pao lacks a damage-boosting item, so an EV spread of 40 HP / 216 SpA / 252 Spe on less bulky sets could be used instead.</p>",
    "sets": {
      "Fast Sweeper": {
        "description": "<ul> <li> <p>Hydro Pump is by far Iron Bundle's strongest STAB move. Tera Water can further amplify its power.</p> </li> <li> <p>STAB Freeze-Dry allows Iron Bundle to hit Water-types hard. It is effective against rain teams, being able to OHKO Pelipper, OHKO Barraskewda, and hit Palafin hard.</p> </li> <li> <p>Icy Wind benefits Iron Bundle's slower allies. It functions well against fast Focus Sash Pokemon such as Chien-Pao and Meowscarada, both dealing damage to nullify the Focus Sash and lowering their Speed, which allows Iron Bundle's ally to KO the foe.</p> </li> <li> <p>Protect is used to predict and avoid attacks that threaten to KO Iron Bundle, extending its longevity. It can also help Iron Bundle stall out Trick Room and Tailwind turns.</p> </li> <li> <p>Tera Water increases the power of Hydro Pump and gives Iron Bundle a better defensive typing against Fire- and Steel-type Pokemon such as Chi-Yu and Gholdengo. Tera Ghost avoids Fake Out and Extreme Speed, letting Bundle act more freely. Both Tera types also reduce the damage taken from Stealth Rock.</p> </li> <li> <p>Booster Energy activates Iron Bundle's Quark Drive, making it among the very fastest Pokemon in Doubles OU. Boosted Iron Bundle outspeeds Gholdengo and Great Tusk in Tailwind, Choice Scarf Chi-Yu, and Weak Armor-boosted Armarouge. It also Speed ties Chlorophyll Lilligant in sun.</p> </li> <li> <p>Focus Sash complements Iron Bundle's lacking bulk, letting it survive attacks that would OHKO it.</p> </li> <li> <p>Life Orb increases Iron Bundle's overall damage output, enabling it to OHKO a few Pokemon such as Dragapult with Freeze-Dry. However, it doesn't help Iron Bundle preempt foes or take hits, making it far riskier than other items. Life Orb's recoil damage can also put Iron Bundle into KO range from Dragonite's Extreme Speed.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 216286, "username": "Fangame10"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 471503, "username": "YoBuddy"}, {"user_id": 230771, "username": "qsns"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Iron Hands": {"comments": "<ul> <li>This EV spread outspeeds Landorus in Tailwind and OHKOs Max HP Ogerpon-Wellspring with Wild Charge.</li> </ul>", "sets": {"Assault Vest": {}}},
  "Baxcalibur": {"sets": {"Dragon Dance": {"description": "<ul> <li>188 Speed EVs outspeeds Dragapult after a Dragon Dance.</li> </ul>"}}},
  "Gholdengo": {
    "sets": {
      "Choice Specs": {
        "description": "<ul> <li> <p>Choice Specs Gholdengo provides more immediate offense compared to Nasty Plot variants. Choice Specs-boosted Tera Steel Make It Rain can quickly overwhelm the opposing team, leaving the opponent scrambling to bring in their few Steel-resistant Pokemon. Shadow Ball acts as the secondary STAB move, hitting key targets such as Archaludon and opposing Gholdengo.</p> </li> <li> <p>Power Gem and Focus Blast provide answers to some of the common foes that resist Gholdengo's STAB coverage. Both moves hit Incineroar and Chi-Yu super effectively, while Focus Blast specifically lets it threaten Kingambit. Power Gem is usually the preferred option because of its consistency. Trick is able to severely disrupt the opponent's support or setup-oriented Pokemon such as Amoonguss. Trick can also be utilized against Sucker Punch users, causing their attack to fail and locking them down with a Choice item.</p> </li> <li> <p>Tera Steel is the Tera type of choice to push Make It Rain's damage even further. It also provides defensive benefits in removing Gholdengo's weakness to Ghost- and Dark-type attacks, notably opposing Gholdengo's Shadow Ball and the Sucker Punches coming from Chien-Pao and Kingambit.</p> </li> <li> <p>The EV spread maximizes Gholdengo’s Special Attack to focus on heavy damage output. The HP and Defense investment allow it to survive Jolly Chien-Pao's Sucker Punch without the need to Terastallize defensively. The Speed makes Gholdengo faster than Booster Energy Gouging Fire and Modest Choice Scarf Chi-Yu under Tailwind.</p> </li> <li> <p>Good as Gold allows Gholdengo to switch in against status-reliant Pokemon almost completely unthreatened by them. This most notably includes Amoonguss, as its presence in the metagame often demands teams to have Spore-immune answers.</p> </li> <li> <p>Gholdengo's Speed leaves it outpaced by many of the metagame's major threats, such as Landorus and Ogerpon-H; because of this, it is very frequently paired with Tailwind users to support it. Tornadus and Whimsicott both have the Prankster ability that make them particularly ideal in this role.</p> </li> <li> <p>Pokemon that can assist Gholdengo in breaking down the tougher Steel-resistant Pokemon are helpful. For instance, Landorus is particularly effective at taking down the Fire-, Electric-, and Steel-types with its powerful Ground-type STAB moves. Ogerpon-W is another strong partner for Gholdengo, offering Follow Me for redirection support in addition to being able to offensively threaten Landorus and many Fire- and Water-types. Rillaboom is also a fantastic partner, as it's efficient in removing Water-types. In addition, it's effective at luring in the Fire- and Steel-types that resist its Terrain-boosted Grass-type moves, wearing them down for Gholdengo to break through. Further still, Rillaboom is an effective pivot that can help secure Gholdengo's safe entrance onto the field.</p> </li> </ul>"
      },
      "Nasty Plot": {"description": "<ul> <li>This EV spread survives a Sucker Punch from Adamant Chien-Pao and outspeeds Modest Scarf Chi-Yu in Tailwind.</li> </ul>"},
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 159382, "username": "Charlotte"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 550367, "username": "Smudge"}, {"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 608134, "username": "bagel"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Chien-Pao": {
    "outdated": true,
    "sets": {
      "Cheems Pao": {
        "description": "<ul> <li> <p>Chien-Pao is a fantastic physical attacker that can improve its and its teammates' physical damage through Sword of Ruin. It is very effective with priority attackers such as Dragonite and Palafin, as well as other fast physical attackers such as Choice Band Dragapult and Choice Scarf Basculegion-F.</p> </li> <li> <p>Ice Spinner is a STAB option that easily grabs OHKOs on Dragonite and Landorus-T while clearing Psychic Terrain for its own Sucker Punch and teammates' priority moves. Icicle Crash can be used for a slight increase in power, a sizeable flinch chance, and avoiding Rocky Helmet damage, however it comes with a chance to miss and cannot clear Psychic Terrain. If used with Rillaboom, Icicle Crash is recommended to avoid clearing your own Grassy Terrain.</p> </li> <li> <p>Sucker Punch allows Chien-Pao to pick off faster threats such as Booster Energy Flutter Mane and Booster Energy Iron Bundle. Sucker Punch is also crucial to keeping Chien-Pao relevant against Tailwind or Trick Room, and pressures opposing priority users such as Palafin.</p> </li> <li> <p>Sacred Sword OHKOs many relevant Pokemon that resist Chien-Pao's STAB combination such as Kingambit, Chi-Yu, and opposing Chien-Pao. Crunch is a more consistent option for Dark-type STAB, knocking out Indeedee-F through Psychic Terrain and threatening Pokemon such as Cresselia that are using status moves.</p> </li> <li> <p>Life Orb is used to push Chien-Pao's offenses to dizzying heights, OHKOing bulky Rillaboom and Flutter Mane with Ice Spinner and Sucker Punch, respectively. Focus Sash gets around Chien-Pao's poor defenses and allows it to survive a hit against strong, fast attackers such as Flutter Mane and Choice Scarf Chi-Yu. However, the item is rendered useless by Stealth Rock, a relatively common sight.</p> </li> <li> <p>Jolly nature Chien-Pao speed ties Flutter Mane and opposing Chien-Pao. An Adamant nature can be used for more power, giving Life Orb Chien-Pao a chance to OHKO Cresselia with Crunch.</p> </li> <li> <p>Tera Dark boosts the damage of Sucker Punch, allowing it to more effectively pick off weakened foes and score an OHKO on all variants of Flutter Mane. Tera Ghost provides an immunity to Fighting-type moves, improving its matchup into Iron Hands, as well as priority such as Fake Out and Extreme Speed that would otherwise threaten Chien-Pao.</p> </li> <li> <p>In addition to other physical attackers, Chien-Pao appreciates partners that can cover its defensive shortcomings, notably to Fire-, Fairy-, and Fighting-types. Volcanion and Heatran perform well against Fairy-types such as Flutter Mane and can hold off opposing Fire-types. Amoonguss and Landorus-T can be used to switch into Fighting-type attacks from Iron Hands aimed at Chien-Pao.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 230771, "username": "qsns"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Chi-Yu": {
    "outdated": true,
    "overview": "<p>Chi-Yu poses itself as one of the most menacing special attackers in DOU, with its high Special Attack, near unresisted STAB combination, and Beads of Ruin allowing it to hit the majority of the metagame extremely hard. Beads of Ruin also not only indirectly makes Chi-Yu hit harder but also empowers its special attacking teammates, with Iron Bundle and Gholdengo in particular being excellent partners due to their ability to either overwhelm shared checks like Ting-Lu or outright beat some of Chi-Yu's checks, such as Garchomp for the former and Glimmora for the latter. Furthermore, Chi-Yu has very good Speed, allowing it to naturally outspeed a considerable portion of the metagame. However, Chi-Yu is not without glaring weaknesses, as its HP and Defense are absurdly low, which leaves it vulnerable to common priority moves such as Palafin's Jet Punch and Dragonite's Extreme Speed. In addition, despite Dark / Fire being a good type combination offensively, it leaves Chi-Yu vulnerable defensively, as its weaknesses to Ground-, Rock- and Water-type moves in addition to Stealth Rock compromise its ability to switch in and fire off more attacks. Finally, Pokemon such as Glimmora, Ting-Lu, and Garchomp have the ability to potentially switch into Chi-Yu and threaten it out, with Ting-Lu's Tablets of Ruin being a particular annoyance due to it offsetting Beads of Ruin. However, it is important to note that Chi-Yu's strength is still to the magnitude that it can 2HKO all the aforementioned Pokemon under the right circumstances.</p>",
    "comments": "<h4>Other Options</h4> <p>EV investment into Chi-Yu's HP and Defense allows it to survive a significant number of moves it would normally be OHKOd by, notably Dragonite's Extreme Speed, while a Modest nature can be used on both sets to further increase the amount of damage Chi-Yu can do overall. However both options can cut into Chi-Yu's Speed, with the former also potentially lowering the amount of damage Chi-Yu can do depending on the amount of investment.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li> <p>Heat Wave allows Chi-Yu to pick off Pokemon like Choice Scarf Gholdengo and Chien-Pao, as well as being a good method of spreading damage.</p> </li> <li> <p>Dark Pulse can hit Ghost- and Psychic-types like Dragapult and Armarouge, as well as Pokemon that resist Fire-type moves, like Glimmora.</p> </li> <li> <p>Flamethrower and Overheat both give Chi-Yu the ability to focus its damage on a singular Pokemon, with Overheat being significantly stronger but far more punishing than Flamethrower.</p> </li> <li> <p>Snarl is useful for spread damage when both Pokemon on the field can take Heat Wave, as well as supporting its team.</p> </li> <li> <p>Choice Scarf lets Chi-Yu outrun almost the entire tier, allowing it to either threaten out Pokemon like Dragapult and Chien-Pao and pick off weakened targets.</p> </li> <li> <p>The EV spread and a Timid nature both maximizes the number of Pokemon Chi-Yu can outspeed along with its damage output.</p> </li> <li> <p>Tera Fire allows Chi-Yu to pick up KOs it normally wouldn't be able to otherwise, such as Amoonguss with Heat Wave, while Tera Ghost grants an immunity to Fake Out and Extreme Speed, blocking two common methods to stop Chi-Yu, as well as making it immune to Fighting-type moves, which it would normally be weak to, like Drain Punch from Iron Hands.</p> </li> </ul>"
      },
      "All Out Attacker": {
        "description": "<ul> <li> <p>Heat Wave provides excellent spread damage severely threatening Steel- and Grass-types like Gholdengo and Amoonguss while still being able to scorch neutral targets.</p> </li> <li> <p>Dark Pulse hits several Pokemon that resist Heat Wave, such as Glimmora, as well as Ghost- and Psychic-types like Armarouge and Dragapult hard, as well as just being a solid STAB move</p> </li> <li> <p>Flamethrower and Overheat deal more damage to a single target than Heat Wave, which can allow Chi-Yu break past Pokemon it normally wouldn't be able to, such as Ting-Lu. Overheat allows Chi-Yu to deal an insane amount of damage, accomplishing feats such as OHKOing Tera Normal Dragonite, while Flamethrower is weaker than Overheat by a significant margin but doesn't have the Special Attack drop and imperfect accuracy.</p> </li> <li> <p>Snarl provides a secondary spread attack that can hit deceptively hard, in addition to debuffing the opposing team, while Tera Blast can be utilized with Tera Grass in order to give Chi-Yu an option to hit Pokemon like Palafin and Iron Bundle. Protect should only be used with Life Orb, but can keep Chi-Yu safe for a turn while a teammate either repositions or sets speed control to assist it.</p> </li> <li> <p>Choice Specs and Life Orb both boost Chi-Yu's damage output to absurd levels, with the former allowing Chi-Yu to switch moves in exchange for the recoil and loss of power.</p> </li> <li> <p>Tera Fire exponentially increases the strength of Fire-type moves for Chi-Yu, while Tera Grass patches up Chi-Yu's weakness to Water-type moves, and Tera Ghost prevents Fake Out and Extreme Speed from slowing down or picking off Chi-Yu, in addition to turning the Fighting-type weakness to an immunity.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 531334, "username": "zoe"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 550367, "username": "Smudge"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Roaring Moon": {
    "outdated": true,
    "sets": {
      "Offensive Tailwind Setter": {
        "description": "<ul> <li>Roaring Moon has grown into the role of DOU's premier offensive Tailwind setter, using its blazing Speed to provide both damage and team support.</li> <li>Booster Energy lets Roaring Moon outspeed every other Pokemon in the format besides Booster Energy Iron Bundle. This ensures Roaring Moon is able to set Tailwind before being KOed and may even allow its partner to KO opposing threats instead.</li> <li>Breaking Swipe offers survivability for Roaring Moon and its partner as well as chip damage that can break the Focus Sash of Pokemon such as Chien-Pao and Iron Bundle.</li> <li>Acrobatics is immediately activated when Booster Energy is consumed and offers strong damage, nearly matching Roaring Moon's best STAB options, Throat Chop and Dragon Claw. With Tera Flying, it becomes Roaring Moon's best damage-dealing option, threatening massive damage on Pokemon such as Amoonguss and Great Tusk.</li> <li>Throat Chop can be used over either Breaking Swipe or Acrobatics as a consistent STAB option that hits Indeedee-F and Armarouge for super effective damage.</li> <li>Roaring Moon's defenses are decent, but both Dragon / Dark and Flying have notable weaknesses, especially to opposing Ice-types like Iron Bundle and Chien-Pao; Protect gives Roaring Moon the opportunity to avoid these attacks while its partner removes such threats. Protect can also be used to stall out field effects like weather, Trick Room, and an opponent's Tailwind.</li> <li>The listed EVs will boost Roaring Moon's Speed with Booster Energy. If an Attack boost is desired instead, 32 HP EVs can be moved into Attack.</li> <li>If being used on sun teams, Life Orb is preferred as the item. Sun will activate Protosynthesis without consuming Booster Energy, keeping Acrobatics at a measly 55 Base Power. Keep this in mind while facing sun teams as well.</li> <li>Taunt is an option to prevent opposing forms of speed control such as Tailwind and Trick Room.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 27554, "username": "Arcticblast"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 243662, "username": "Yoda2798"}, {"user_id": 531334, "username": "zoe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Walking Wake": {
    "outdated": true,
    "sets": {
      "Sun Attacker": {
        "description": "<ul> <li>Walking Wake is a powerful special attacker and can function as a Water-type attacker on sun teams thanks to Hydro Steam and Protosynthesis.</li> <li>Hydro Steam is Walking Wake's primary STAB move. While it's simply good outside sun, there are very few things that can switch in on it in sun.</li> <li>Draco Meteor is Walking Wake's strongest move and can slam common Water-resistant Pokemon such as opposing Walking Wake and Palafin.</li> <li>Flamethrower is a strong sun-boosted coverage move that deals super effective damage to Pokemon like Amoonguss and Kingambit, which otherwise resist Walking Wake's STAB moves.</li> <li>Protect keeps Walking Wake safe against faster threats and through field effects and should always be used with Life Orb. Choice Specs Walking Wake should run Dragon Pulse as a consistent Dragon-type STAB option to lock into.</li> <li>Tera Fairy is chosen to remove Walking Wake's weaknesses to Dragon and Iron Bundle's Freeze-Dry. Tera Dragon can also be run to increase Draco Meteor's damage and grant Walking Wake an important Electric resistance against Iron Hands. Tera Water greatly increases Hydro Steam's damage while removing Walking Wake's weaknesses to Dragon- and Fairy-type moves.</li> <li>The EVs listed boost Walking Wake's Speed in sun. If a Special Attack boost is desired, move 8 EVs from Special Defense into Special Attack.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 27554, "username": "Arcticblast"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 230771, "username": "qsns"}, {"user_id": 531334, "username": "zoe"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Sinistcha": {"sets": {"Hospitality Support": {"description": "<ul> <li>This EV Spread survives a Chien-Pao Ice Spinner and Gholdengo Shadow Ball.</li> </ul>"}}},
  "Ogerpon-Wellspring": {
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li>Ivy Cudgel is a strong STAB option that hits common threats like Landorus, Incineroar, and Diancie super effectively and threatens an OHKO on Flutter Mane while also dealing solid damage to neutral targets.</li> <li>Ogerpon-W has quite a few options for its Grass-type STAB attack to hit Water-resistant foes like Palafin, Volcanion, and opposing Ogerpon-W. Horn Leech has respectable power in addition to giving Ogerpon-W a way to sustain itself, which can be helpful considering how crucial its health is. Power Whip a stronger option, allowing Ogerpon-W to hit some targets harder than it would with Ivy Cudgel such as Tyranitar and Ursaluna.</li> <li>Follow Me leverages Ogerpon-W's good typing to support its team and shield its teammates from threatening attacks and status moves, with Water Absorb allowing it to heal from Water-type attacks such as Palafin's Jet Punch and Volcanion's Steam Eruption. Encore punishes Fake Out, Protect, and speed control moves, forcing the Encore target to switch out or repeatedly use a detrimental move, generating momentum for Ogerpon-W's team.</li> <li>Ogerpon-W usually uses Spiky Shield, but on faster-paced teams it might opt drop this for Encore due to the utility of Follow Me being desired in addition to Encore's potential to swing the momentum of a game.</li> <li>In addition to the usual benefits, Ogerpon-W gains +1 Special Defense upon Terastallizing, considerably improving its matchups against Flutter Mane and Deoxys-A.</li> <li>The given EV spread lets Ogerpon-W outspeed Landorus and survive a Tera Stellar Chien-Pao Icicle Crash, with the rest of the EVs going into Attack to allow Power Whip to OHKO maximum HP Flutter Mane. Alternatively, an EV spread of 252 HP / 28 Atk / 84 Def / 72 SpD / 72 Spe with an Adamant nature can be used to survive a Choice Band Tera Normal Extreme Speed from Dragonite with Sword of Ruin active or a Choice Specs Tera Fairy Moonblast from maximum Special Attack Flutter Mane while still outspeeding Smeargle and Modest Glimmora.</li> <li>Tornadus makes a great partner for Ogerpon-W, as it provides Prankster Tailwind support it and threatens Grass-types Ogerpon-W can't touch such as Rillaboom and opposing Ogerpon-W with Bleakwind Storm, and it can even strengthen Ivy Cudgel with Rain Dance. Flutter Mane threatens out Dragon-types like Baxcalibur and Raging Bolt that resist Ogerpon-W's STAB combination, and it appreciates the potential Follow Me support Ogerpon-W provides to draw strong priority attacks like Kingambit's Sucker Punch and Rillaboom's Grassy Glide away from it. Setup Pokemon such as Swords Dance Kingambit appreciate Ogerpon-W providing both Follow Me and Encore support to generate setup opportunities for them by either redirecting attacks or shutting down an opposing Pokemon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 531334, "username": "zoe"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 192134, "username": "ryo yamada2001"}, {"user_id": 230771, "username": "qsns"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Ogerpon-Hearthflame": {"sets": {"Cudgel Bonk": {}}},
  "Archaludon": {"sets": {"Assault Vest": {}}},
  "Raging Bolt": {"sets": {"Assault Vest": {"description": "<ul> <li>This EV spread survives Icicle Crash from Adamant Chien Pao, OHKOes Max HP Tornadus with Thunderbolt, and outspeeds uninvested Rillaboom and Chien-Pao in Tailwind.</li> </ul>"}, "Calm Mind": {"description": "<ul> <li>This EV Spread survives a Life Orb Ice Spinner from Chien-Pao and +2 Kowtow Cleave from Kingambit.</li> </ul>"}}},
  "Iron Crown": {"sets": {"Psychic Terrain Attacker": {}, "Booster Speed": {"description": "<ul> <li>84 EVs have been allocated to HP instead of Special Attack to get the Speed boost from Booster Energy.</li> </ul>"}}}
}