{
  "Muk": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Muk serves as a great tank and Haze user in SV NU, checking various special attackers such as Vivillon and Zoroark and threatening them with Poison Jab and Drain Punch respectively. Poison Touch and Poison Jab let Muk effortlessly spread poison, even on Pokemon immune to Toxic Spikes such as Drifblim and Eelektross. Drain Punch hits Steel-types such as Copperajah and Terastallized Appletun that would otherwise wall Muk. Haze stops setup sweepers such as Vivillon and Calm Mind Vaporeon from setting up. Toxic Spikes lets Muk take advantage of free turns and cripple the opposing team with poison. Tera Dark allows Muk to beat threats like Bruxish and Zoroark after baiting them into their powerful Dark- and Psychic-type attacks and retaliate back while also being able to use Haze against boosted Stored Power users like Veluza and Farigiraf. Alternatively, Tera Water provides an overall better defensive typing, more specifically easing the matchup against offensive Water-types like Calm Mind Vaporeon and Choice Specs Clawitzer. Muk struggles with Pokemon such as Sandaconda, which does not fear its poison due to Shed Skin and can threaten it back with Earthquake. As a result, Muk appreciates teammates such as Rotom, Eelektross, and Cacturne, which can switch into Sandaconda and force it out. Muk is physically frail, making physical walls such as Sandaconda and Drifblim great partners, with the latter also getting rid of entry hazards, which chip Muk down throughout a game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 595639, "username": "plznostep"}]}
  },
  "Electrode": {"sets": [{"name": "Offensive Pivot"}]},
  "Chansey": {"sets": [{"name": "Utility"}]},
  "Scyther": {"sets": [{"name": "Pivot"}, {"name": "Swords Dance"}]},
  "Vaporeon": {"sets": [{"name": "Defensive"}]},
  "Jolteon": {
    "sets": [
      {
        "name": "Calm Mind Sweeper",
        "description": "<p>The fastest Pokemon available in the tier, Jolteon is an amazing setup sweeper thanks to Calm Mind and its great coverage found through Terastallization. Volt Switch whittles down special walls like Chansey and Muk while safely bringing in a teammate better suited to taking them on such as Bruxish or Sandaconda. An Ice-type Tera Blast gives Jolteon a move to hit Ground- and Grass-types like Sandaconda and Appletun super effectively. Heavy-Duty Boots allows Jolteon to safely pivot in and out of battle without being worn down by entry hazards, especially if it's Terastallized, although it may also use a Life Orb for extra damage output. Jolteon is quite frail, making it vulnerable to revenge killing from Choice Scarf users like Passimian, Bruxish, and Mabosstiff. Passimian, Mabosstiff and Bruxish are also great offensive partners that hit Jolteon's defensive checks in Chansey and Muk. A great defensive partner is Drifblim; it switches into Ground- and, when Jolteon has Terastallized, Fighting-type moves.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 399621, "username": "outbackrabbit"}]}
  },
  "Umbreon": {
    "overview": "<p>Umbreon's amazing utility movepool and peerless bulk make it a top-notch support Pokemon and check to many top tier threats, like Bruxish, Zoroark, and Mabosstiff. Despite its great bulk, Umbreon's offenses are quite lackluster, though this can be somewhat alleviated by STAB Foul Play to punish setup sweepers attempting to exploit Umbreon's passivity, like Coil Eelektross and Bulk Up Ursaring. Setup sweepers that don't mind taking a Foul Play, like Calm Mind Dudunsparce and Quiver Dance Oricorio, can easily take advantage of it. Umbreon also dislikes the plethora of Fighting-types in the tier, like Passimian, Medicham, and Paldean Tauros.</p> ",
    "comments": "<h1>Other Options</h1> <p>Umbreon has a myriad of utility options at its disposal, including being able to set up with Calm Mind. Unfortunately, due to Umbreon's terrible Special Attack, a Calm Mind set typically requires too many boosts to be effective. Umbreon can fit two utility moves if it chooses to use Moonlight instead of Wish and Protect, but the limited PP can become a detriment in longer games. Umbreon can beat setup sweepers that typically take advantage of it, such as Quiver Dance Oricorio and Calm Mind Vaporeon, with Tera Ghost and Curse. Umbreon can also use Taunt and a few extra Speed EVs to stop setup sweepers like Sandaconda and Vaporeon or other support Pokemon like Vespiquen and Muk from using their own status moves. Lastly, Umbreon can trap an unsuspecting foe with Mean Look and wear it down with Foul Play or even drop its stats with Tickle to more easily take it out.</p> <h1>Checks and Counters</h1> <p><strong>Fighting-types: NU has a plethora of Fighting-types, such as Crabominable, Medicham, and Passimian. Umbreon can Terastallize to reverse this weakness, but that always comes with a new set of weaknesses and removes the option to Terastallize later. Other Pokemon like Scyther and Zangoose have a powerful Close Combat that can threaten Umbreon as well.</p> <p><strong>Opposing Utility Moves: Regardless of Synchronize, a poisoned Umbreon, whether by Toxic or Toxic Spikes, is extremely impaired and struggles to fulfill its role. Trick from a Choice Scarf Haunter or Rotom can completely ruin Umbreon despite it being a suitable check to them otherwise. Taunt from Pokemon like Bombirdier, Qwilfish, and opposing Umbreon can limit Umbreon to only an exploitable Foul Play.</p> <p><strong>Special Setup Sweepers: Setup sweepers that don't mind Foul Play, mainly special attackers like Oricorio, Vivillon, and a Terastallized Farigiraf can easily boost against Umbreon.</p> ",
    "sets": [
      {
        "name": "Wish Support",
        "description": "<h1>Set Details</h1> <p>Foul Play is surprisingly powerful with STAB, letting Umbreon threaten even neutral physical attackers. Umbreon's immense bulk lets it spread status with Thunder Wave or Yawn to support its teammates, and Wish can keep teammates that lack reliable recovery such as Perrserker and Eelektross healthy. While Pokemon like Tera Ground Oricorio and Coil Eelektross are immune to Thunder Wave, Yawn can shut down their setup attempts nicely. Synchronize can deter or punish careless status moves used by the likes of Dudunsparce and Drifblim. Umbreon prefers a Poison or Fairy Tera type to turn the tables on Fighting-types and take U-turn better. Tera Poison also provides a Fairy resistance and an immunity to Toxic and Toxic Spikes from common users like Muk, Qwilfish, and Vespiquen.</p> <p>Umbreon appreciates Drifblim and Qwilfish for their Fighting resistance. Drifblim can remove entry hazards and take advantage of Umbreon's status moves with Hex, while Qwilfish can consistently punish Fighting-type moves and U-turn from Pokemon like Passimian and Scyther with Poison Point and Rocky Helmet. Bruxish and Rotom appreciate Umbreon's resistance to Ghost- and Dark-type attacks and its ability to inflict paralysis and sleep.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 509790, "username": "Pokeslice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 400664, "username": "Togkey"}]}
  },
  "Qwilfish": {
    "sets": [
      {
        "name": "Physical Wall",
        "description": "<p>Qwilfish is a premier physical wall in the tier owing to its great defensive typing and abilities, as well as a bevy of amazing utility moves including the highly coveted Spikes and Toxic. Qwilfish can wear down the opposition with its combination of Spikes and Toxic and even prevent Defog and recovery moves with Taunt. Waterfall is used over Liquidation to potentially cause flinching, which works wonders in conjunction with Toxic, although Surf can be used for a 2HKO on Sandaconda and more damage on other physically bulky Pokemon like Drifblim and Klawf. Despite Intimidate being such a high-value ability, Qwilfish typically prefers Poison Point to punish U-turn from the likes of Passimian and Scyther while not activating Passimian's Defiant in the process. Protect can be used with Leftovers for some extra recovery and also to scout moves from Choice item users like Rotom, Bruxish, and Zoroark. Upon scouting these Pokemon, Qwilfish can invert its weakness to Electric- or Psychic-type moves with a timely Terastallization to a respective Ground or Dark typing, letting it spread more poison and set more Spikes. Umbreon is a great defensive partner, sponging general special attacks while boasting an immunity to Psychic. In return, Qwilfish heavily punishes Fighting-type attacks and U-turn, while also resisting Fairy. Phasers like Dragon Tail Dudunsparce and Eelektross make great use of the Spikes Qwilfish sets up, racking up damage for a faster Pokemon to more easily sweep. Choice Scarf Passimian takes advantage of hazard damage while also punishing Defog with its Defiant ability.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 400664, "username": "Togkey"}]}
  },
  "Medicham": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Medicham is a solid revenge killer and late-game cleaner. Pure Power gives Medicham an edge over Passimian, one of its main sources of competition, by allowing its Close Combat to 2HKO bulky foes like Vaporeon before Terastallization. Zen Headbutt's Base Power is good against foes like Tera Fairy Chansey, but Psycho Cut is an alternative that doesn't make contact, which helps against Rocky Helmet users, Drifblim, and Poison Point Qwilfish. Thunder Punch hits Bruxish and Flying-types like Drifblim and Oricorio-F. Trick punishes defensive switch-ins like Sandaconda and is especially beneficial to use against bulky teams, since they are generally slower than Medicham anyway. Tera Fighting enhances Medicham's wallbreaking and cleaning potential by powering up Close Combat, and it lets Medicham resist Toxicroak and Bombirdier's Sucker Punch. Partners that commonly run Choice Scarf, such as Zoroark and Rotom, can revenge kill foes instead of Medicham early-on, keeping its set a mystery. Zoroark can also use Illusion to lure in and eliminate Ghost-types, which reduces how many predictions Medicham needs to make, while Rotom checks Flying-types and blanks Sandaconda and Choice Scarf Toxicroak.</p> "
      },
      {"name": "All-Out Attacker"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Camerupt": {"sets": [{"name": "Defensive Utility", "description": "<p>Fire Spin and Grass Tera Blast can effectively lure otherwise undesirable matchups like Sandaconda and Vaporeon. 88 Speed allows Camerupt to outspeed the likes of Muk, Crocalor, and Perrserker</p> "}]},
  "Cacturne": {"sets": [{"name": "Offensive Spikes"}, {"name": "Swords Dance Sweeper"}]},
  "Zangoose": {"sets": [{"name": "Swords Dance"}]},
  "Vespiquen": {"sets": [{"name": "Pivot"}]},
  "Drifblim": {
    "sets": [
      {
        "name": "Drifblim",
        "description": "<p>Drifblim is one of the best Defoggers in SV NU, with reliable recovery in Strength Sap and a great defensive typing allowing it to check many of the tier's best physical attackers like Toxicroak, Zangoose, and Sandaconda. Hex is a great STAB option to hit Psychic- and Ghost-types such as Bruxish, Medicham, and Rotom, and it has great synergy with Drifblim's status moves. Air Slash allows Drifblim to hit Normal-types and Dark-types neutrally while also potentially wearing down defensive Pokemon like Umbreon and Chansey with a combination of flinches and paralysis. Will-O-Wisp can help discourage physical attackers from switching in, such as Bombirdier and Lycanroc, and is useful to burn dangerous setup sweepers such as Coil Eelektross and Curse Muk. Thunder Wave is another status option, notably improving Drifblim's matchup into Pokemon such as Pyroar and Oricorio. Defog allows Drifblim to keep hazards off the field from Pokemon such as Qwilfish and Sandaconda, and with maximum Defense investment, Drifblim can even take a Defiant-boosted Knock Off from Passimian. Tera Fairy can improve Drifblim's matchup against Dark-types like Mabosstiff and Zoroark while retaining its matchup versus Fighting-types; it can also be useful for getting rid of Drifblim's Stealth Rock weakness if it has lost its Heavy-Duty Boots. However, this makes Drifblim's matchup into Poison-types such as Toxicroak much worse. Tera Ground can block a Volt Switch and allow Drifblim to hit Rotom and Eelektross hard before forcing them to switch out.</p> <p>Drifblim can struggle with powerful special attackers such as Eelektross, Pyroar, and Zoroark, which can switch in thanks to Drifblim's passivity and threaten it. As a result, special walls such as Chansey, Muk, and Umbreon can be great partners. Sticky Hold Muk can also absorb Knock Off for Drifblim from physical attackers such as Passimian.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 595639, "username": "plznostep"}]}
  },
  "Spiritomb": {"sets": [{"name": "Calm Mind"}]},
  "Toxicroak": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Toxicroak stands out as a very potent late-game sweeper thanks to Swords Dance and Dry Skin, which allow it to switch in and set up on common Water-types like Vaporeon and Qwilfish. Its access to Sucker Punch allows it to revenge kill threats like Choice Scarf Medicham, Bruxish, and Rotom, though it has to be aware of the former two's Tera types and the latter's Will-O-Wisp. Tera Dark gives it a useful Psychic immunity to better the odds versus opposing Bruxish while increasing the power of Sucker Punch. Alternatively, Tera Fighting Toxicroak is able to OHKO Sandaconda, which usually checks it, after a Swords Dance. Toxicroak struggles against the aforementioned Drifblim and Rotom and, without Tera Fighting, Sandaconda. Teammates such as Vaporeon, Eelektross, and Rotom can switch in on its checks and bring it into battle safely. Pokemon that appreciate Toxicroak's presence include Oricorio, Clawitzer, and Bruxish, as they struggle against bulky Pokemon that lose to Toxicroak like Vaporeon, Umbreon, and Chansey.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Thanks to its access to Nasty Plot, Toxicroak can threaten Pokemon like Sandaconda and Drifblim that beat physical variations of it. Dark Pulse enables it to get around Pokemon that resist its STAB combination, including Ghost-types like Drifblim, Rotom, and Spiritomb as well as Poison-types like Muk and Qwilfish. Alternatively, Vacuum Wave is a solid STAB move with priority to help it revenge kill faster threats like Zoroark, Lycanroc, and Tera Ice Jolteon. Tera Fighting heavily increases Focus Blast's already high damage output, allowing Toxicroak to rip through bulkier teams. Tera Fighting Toxicroak can run a Modest nature to give it a favorable chance to 2HKO Muk at +2 with Focus Blast; however, it becomes noticeably slower, getting outpaced by Mabosstiff, Bombirdier, and Braviary. Tera Dark Toxicroak better checks Bruxish while also boosting Dark Pulse's power.</p> <p>Without the use of its Tera type, Toxicroak struggles against bulkier teams that often include Muk or Crocalor, so Pokemon that put pressure on them like Sandaconda and Bruxish pair well with it. Bruxish, as well as other Water-types like Clawitzer, appreciate Toxicroak checking bulky Water-types like Vaporeon and Qwilfish. Toxicroak often relies on Spikes from users such as Qwilfish, Vespiquen, and Cacturne to chip away at foes that it can't handle on its own. Since Toxicroak can lure in and remove Ghost-types like Rotom and Drifblim, Pokemon like Scyther and Coil Eelektross appreciate its support.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Toxicroak differentiates itself from other Choice Scarf users, such as Passimian, by virtue of its defensive utility, being immune to Water-type attacks and absorbing Toxic Spikes. It also doesn't Speed tie with other common Choice Scarf attackers, namely Passimian and Medicham. Close Combat and Gunk Shot can sweep through even remotely weakened teams, especially with a Tera-Fighting Close Combat. Gunk Shot hits Fairy-types that resist Close Combat such as Dachsbun, Florges, and Tera Fairy Drifblim. Earthquake threatens Poison-types such as Muk and Qwilifish. Rock Slide hits Pokemon such as Drifblim and Vespiquen, which may otherwise be troublesome for Toxicroak to deal with. Despite its low-Base Power, Ice Punch is a relatively safe midground option that lacks the type immunities Toxicroak's other moves have while hitting common checks like Sandaconda, Drifblim, and Scyther for decent damage.</p> <p>Toxicroak struggles with Pokemon that are not threatened by its STAB combination, such as Rotom, Drifblim, and other physical walls such as Sandaconda. Powerful special attackers like Eelektross, Zoroark, and Pyroar can alleviate this issue.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 509790, "username": "Pokeslice"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 595639, "username": "plznostep"}]}
  },
  "Rotom": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Rotom stands out as a fantastic user of Choice Scarf thanks to its nearly unresisted STAB combination, high Speed tier, and three immunities. Will-O-Wisp lets Rotom cripple opposing physical sweepers such as Passimian, Medicham, and Scyther on top of Toxicroak using Sucker Punch. Trick is very useful to dismantle walls that rely on their item like Sandaconda, Eelektross, and Chansey. Tera Electric and Tera Ghost boost Rotom's STAB attacks even further with no drawbacks, though note that Tera Ghost exposes Rotom to Sandaconda's Glare. Tera Dark is useful for beating Sucker Punch Toxicroak and making Rotom a good lure for Zoroark. Thanks to Rotom's ease switching into opposing Sandaconda, teammates weak to it like Toxicroak, Lycanroc, Perrserker, and Scyther make for great partners; the latter two can even form a VoltTurn core with it. Bruxish, Medicham, and Mabosstiff help Rotom get around common special walls like Umbreon, Muk, and Chansey. Some walls that Rotom benefits from teaming up with include Umbreon, Vaporeon, and Muk thanks to their ability to take on common wallbreakers that can revenge kill Rotom such as Mabosstiff, Bruxish, and Pyroar.</p> "
      },
      {"name": "Utility"},
      {"name": "Nasty Plot"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 298730, "username": "poh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 189361, "username": "Lucario"}]}
  },
  "Rotom-Frost": {"sets": [{"name": "Choice Scarf"}, {"name": "Nasty Plot"}]},
  "Basculin": {"sets": [{"name": "Choice Band"}]},
  "Eelektross": {
    "sets": [
      {
        "name": "Coil",
        "description": "<p>Eelektross makes for one of the most potent bulky setup sweepers in the tier due to its lack of weaknesses and access to the highly coveted Coil. Eelektross' defensive profile, notably boasting a paralysis and Ground immunity, grants it safe entry against tier staples like Sandaconda, Chansey, and Jolteon, and it can even set up Coil in front of them. Drain Punch allows Eelektross to maintain its health while boosting. Dragon Tail lets Eelektross beat opposing setup sweepers like Coil Sandaconda, Bulk Up Ursaring, and Curse Muk. Instead of Dragon Tail, Eelektross can use a move like Substitute or Rest to greatly help against status inducers such as Rotom, Drifblim, and Qwilfish. The former two can otherwise easily outspeed and burn Eelektross and eventually beat it down with boosted Hex. Tera Steel prevents Toxic from Muk, Qwilfish, and Vespiquen and retains an amazing defensive profile thanks to Levitate. Entry hazards set by the likes of Qwilfish and Sandaconda allow Eelektross to rack up damage against incoming checks like Rotom and Lurantis with Dragon Tail. Drifblim and the aforementioned Qwilfish also appreciate Eelektross's Electric resistance.</p> "
      },
      {
        "name": "Assault Vest",
        "description": "<p>Assault Vest Eelektross is a premier defensive pivot. Its lack of weaknesses, immunity to Spikes and Toxic Spikes, and excellent Assault Vest-boosted special bulk allow it to check common special attackers like Jolteon, Zoroark, and Oricorio. Its low Speed tier paired with 0 Speed IVs allows it to take hits and then safely bring in frailer teammates like Haunter, Zoroark, and Bruxish with U-turn. As such, it fits well on VoltTurn cores with the likes of Bombirdier, Passimian, and Scyther, wearing down the opposing team with pivot moves. Discharge is prefered over Thunderbolt due to the increased paralysis chance. Giga Drain threatens Sandaconda while providing some recovery. Dragon Tail phazes foes, pairing well with Spikes support from the likes of Qwilfish and Cacturne, and keeps Tera Ground Quiver Dance users such as Oricorio and Vivillon in check despite their Discharge immunity. Drain Punch is an alternative that still allows Eelektross to defeat Tera Ground Quiver Dance users while hitting common special attackers like Zoroark and Pyroar super effectively. Acid Spray is a viable alternative that lets Eelektross defeat setup sweepers even when they are the only remaining opposing Pokemon. Tera Steel is preferred, as it improves Eelektross's matchup against common special attackers like Indeedee-F and non-Tera Fire Vivillon while gaining an immunity to Qwilfish's Toxic.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}, {"user_id": 298730, "username": "poh"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 400664, "username": "Togkey"}, {"user_id": 369076, "username": "Tuthur"}]}
  },
  "Clawitzer": {"sets": [{"name": "Specs Wallbreaker"}]},
  "Crabominable": {"sets": [{"name": "Assault Vest Tank"}]},
  "Lycanroc": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Passimian": {
    "sets": [{"name": "Choice Scarf", "description": "<p>Choice Scarf Passimian is an elite revenge killer and pivot in NU thanks to its great Speed and excellent offensive prowess. Knock Off cripples item-reliant Pokemon like Oricorio-F, Scyther, and Chansey while also targeting Ghost-types like Haunter and Rotom. U-turn pivots out of bad matchups, such as Sandaconda, Qwilfish, and Terastallized Vespiquen. Earthquake targets Poison-types like Qwilfish, Muk, and Toxicroak, while Rock Slide hits Rotom-S and Vivillon. Defiant allows Passimian to capitalize on Defog users like Drifblim and Braviary. Passimian is quite vulnerable to contact effects from Pokemon like Qwilfish, Rocky Helmet Sandaconda, and Drifblim; special attackers like Jolteon, Rotom, and Zoroark can discourage them from switching in while also forming VoltTurn cores with it.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493260, "username": "royalfluxh"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Bruxish": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Bruxish's Speed tier coupled with Strong Jaw-boosted Psychic Fangs lends it great wallbreaking capability. Its high Base Power STAB moves are nearly unresisted, and it has enough coverage moves to get around potential checks like Cacturne and Vaporeon. Poison Fang hits Grass-types like Cacturne and Appletun while also badly poisoning common walls like Vaporeon and Umbreon. Crunch targets Psychic-types like Hattrem and Oricorio-P while also securing the OHKO on Farigiraf. Tera Dark further boosts Strong Jaw-boosted Crunch and helps Bruxish get past the aforementioned Cacturne and Vaporeon. Tera Fairy coupled with Tera Blast helps its matchup versus Cacturne while also resisting Sucker Punch from Pokemon like Toxicroak and Honckrow. Teammates should be pivots that bring Bruxish safely on the field like Eelektross, Passimian, and Rotom. Pokemon like Oricorio and Clawitzer appreciate Bruxish targeting their checks like Chansey and Eelektross.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Strong Jaw-boosted Psychic Fangs and Crunch turn Bruxish into a dominant offensive force in NU. It also has Aqua Jet, which lets it revenge kill weakened faster threats like Zoroark and Choice Scarf Passimian and sweep after boosting with Swords Dance. Bruxish's Speed tier is also great, allowing it to outspeed Rotom, Mabosstiff, and Bombirdier. Tera Blast can be used in the fourth moveslot in conjunction with Tera Fairy to give Bruxish a better defensive typing while also being able to beat common walls to it like Cacturne and Tera Dark Toxicroak and Vaporeon. Tera Dark combined with Strong Jaw, however, gives Crunch a deadly bite with it becoming a third STAB move to nail opposing Bruxish and Veluza. Alternatively, Tera Water makes Aqua Jet even more dangerous for the aforementioned faster threats. If Bruxish is not running Tera Fairy + Tera Blast, having a partner like Toxicroak or Rotom to deal with Tera Dark Toxicroak and Vaporeon is appreciated.</p> "
      },
      {"name": "Choice Scarf", "description": "<p>Choice Scarf Bruxish outspeeds other common Choice Scarf users like Passimian and Rotom, making it a very effective late-game cleaner. While it forgoes boosting elements like Choice Band and Swords Dance, Bruxish still boasts a good offensive presence with its powerful STAB moves. Tera Dark further boosts its Strong Jaw-boosted Crunch, and prevents Bruxish from being revenge killed by Sucker Punch users like Toxicroak and Zoroark. Choice Scarf Bruxish can surprise and OHKO common Choice Scarf users like Passimian and Rotom that expect to be faster, so teammates that appreciate their removal like Pyroar, Lycanroc, and Vivillon make good partners.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 589564, "username": "hidin"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}, {"user_id": 298730, "username": "poh"}]}
  },
  "Appletun": {"sets": [{"name": "Defensive Phazer"}]},
  "Sandaconda": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Sandaconda is one of the best Pokemon in NU and provides teams with several forms of useful utility, including blocking Volt Switch, setting Stealth Rock, spreading paralysis, and sponging Knock Off. Shed Skin lets Sandaconda absorb status and, in combination with Rest, support its team and take on physical attackers like Toxicroak throughout the game. Stone Edge threatens Defoggers and Flying-types like Drifblim and Vivillon and hits Eelektross and Rotom neutrally. Rocky Helmet wears physical attackers like Passimian and Muk down and discourages the use of moves like U-turn, while Leftovers provides Sandaconda passive recovery and makes it less reliant on Rest. Tera Ghost lets Sandaconda completely wall most Fighting-types and other threats such as Zangoose. Tera Dragon is another option that keeps Water- and Grass-types like Bruxish and Lurantis from immediately overwhelming Sandaconda. 80 Speed EVs allow Sandaconda to outrun Drifblim.</p> <p>Sandaconda can fit well on many different playstyles and will almost always do something for its team. Sandaconda's main flaw is its mediocre special bulk, which, coupled with its weakness to Eelektross's Giga Drain, means it shouldn't be a team's sole response to Electric-types. Pokemon like Chansey, Muk, and Umbreon can serve as backup checks to such foes and also check other special attackers like Cacturne and Zoroark. In addition, Chansey can run Stealth Rock for Sandaconda, thus allowing it to make room for both Glare and EdgeQuake coverage; Muk puts Sandaconda's grounded switch-ins on a timer with Toxic Spikes and annoys setup sweepers like Dudunsparce and Coil Eelektross with Haze; and Umbreon can keep Sandaconda healthy with Wish so it doesn't have to spend as much time asleep. Slower wallbreakers like Medicham and Clawitzer very much appreciate Glare slowing teams down and making them harder to play around.</p> "
      },
      {"name": "Coil", "description": "<p>With rock-solid physical bulk, Shed Skin, and good offensive power, Sandaconda makes for a deadly mid- and late-game Coil sweeper, setting up on Pokemon like Passimian, Muk, and Umbreon. Stone Edge targets Pokemon resistant or immune to Earthquake, like Rotom, Drifblim, and Oricorio. Rest keeps Sandaconda healthy and works well with Shed Skin. Tera Dragon lets Sandaconda set up on Water-types like Vaporeon, Bruxish, and Floatzel as well as Lurantis, while Tera Ghost blanks Fighting-types like Toxicroak and Medicham. Prior to Terastallization, Sandaconda is vulnerable to Water- and Grass-types like Vaporeon, Bruxish, and Cacturne, so checks to them like Toxicroak, your own Cacturne, and Muk can help. Other special attackers like special Dudunsparce and Eelektross can exploit Sandaconda's low special bulk, so special walls like Crabominable and Chansey are good teammates.</p> "}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 543866, "username": "5Dots"}]}
  },
  "Crocalor": {"sets": [{"name": "Defensive"}]},
  "Dachsbun": {"sets": [{"name": "Defensive"}]},
  "Mabosstiff": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}]},
  "Bombirdier": {"sets": [{"name": "Dedicated Lead"}, {"name": "Choice user"}]},
  "Farigiraf": {"sets": [{"name": "Stored Power"}]},
  "Dudunsparce": {
    "sets": [
      {"name": "Coil"},
      {
        "name": "Calm Mind",
        "description": "<p>Dudunsparce's solid bulk, access to Roost, and relative lack of type weaknesses make it a dangerous Calm Mind sweeper. The sheer power of STAB Boomburst makes up for Dudunsparce's mediocre Special Attack and tends to dissuade Fighting-types and other offensive checks from switching directly into it. Shadow Ball targets Ghost-types such as Drifblim and Rotom. Alternatively, Flamethrower hits Frosmoth and Steel-types like Copperajah, Magneton, and Tera Steel Eelektross harder; however, since these Pokemon lack recovery, it is often better to simply wear them down before trying to sweep. Rattled punishes weaker Dark- and Ghost-type attacks, which foes will likely use if they expect Dudunsparce to Terastallize or if it already has, as well as U-turn and Paldean Tauros's Intimidate. 84 Speed EVs allow Dudunsparce to outrun Umbreon and Haze Vaporeon, thus easing setup versus them; make sure the former does not have Thunder Wave before committing to this, though. Tera Ghost gives Dudunsparce an edge against Fighting-types and powers up Shadow Ball. Dudunsparce seriously struggles against special walls like Muk, Copperajah, and Assault Vest Crabominable, so it should be paired with strong physical attackers like Mabosstiff and Passimian that can pressure them. Zoroark is another option that goes even further in baiting in special walls, as well as Ghost-types, thanks to Illusion. Paralysis support from Pokemon like Sandaconda, Qwilfish, and Umbreon improves Dudunsparce's matchup against offense and decreases the number of hits it has to take while setting up. Sandaconda and Qwilfish also set up entry hazards to wear down Dudunsparce's switch-ins and can punish Fighting-types like Medicham and Passimian with Rocky Helmet, while Umbreon can use Wish to help it stay healthy and conserve Roost's limited PP.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  }
}