{
  "Arcanine-Hisui": {"sets": [{"name": "Offensive Utility"}]},
  "Slowbro": {"sets": [{"name": "Defensive"}]},
  "Slowbro-Galar": {"sets": [{"name": "Calm Mind"}, {"name": "Quick Claw + Quick Draw"}]},
  "Muk-Alola": {"sets": [{"name": "Poison Touch + Protect"}]},
  "Gengar": {
    "sets": [
      {
        "name": "Hex",
        "description": "<p>Gengar's strong utility movepool allows it to potentially take on a longer term approach, spreading a variety of status options to wear down checks such as Gastrodon and Tyranitar and using Hex for strong damage without item-based downsides. Gengar's movepool when running Hex sets is fairly flexible based on its team. It can spread status very well with Will-O-Wisp + Sludge Bomb, but Toxic Spikes can also let it help wear down its own future switch-ins, like Gastrodon, or Pokemon such as Scream Tail and Wo-Chien as they switch into its teammates. Focus Blast can be a good option to avoid letting Tyranitar switch in freely, while Substitute lets Gengar punish switches it forces against Pokemon like Wo-Chien to provide free turns and protect itself from revenge killers. Will-O-Wisp should preferably not be dropped to run a combination of these other moves, as it is fantastic for crippling Tinkaton and Tyranitar and can ensure an immediate status against Heavy-Duty Boots Gastrodon too. Tera Ghost lets Gengar significantly power up its Hex to pressure Pokemon like Gastrodon even more while removing its Ground weakness, but Gengar is often not a priority Terastallization user.</p> <p>This set fits best on bulkier teams that like to take their time wearing down the opposing team. Quagsire is an excellent teammate for this set, as it can threaten Tyranitar and Grafaiai while also spreading Toxic and entry hazards in order to wear down other Pokemon, such as Gastrodon and TInkaton. Teammates such as Wo-Chien and Cyclizar that can remove Heavy-Duty Boots from foes like Gastrodon, Wo-Chien, and Sandy Shocks are highly appreciated if Gengar is running Toxic Spikes. Wo-Chien can also help check Pokemon such as Greninja and Sandy Shocks for Gengar, while Cyclizar can help keep entry hazards off Gengar's side without removing its Toxic Spikes and give it switch-in opportunities against Decideueye and Slither Wing with U-turn. Gengar also appreciates defensive support against Pokemon such as Noivern, Scizor, and Talonflame, so teammates like Gastrodon and Talonflame are valuable. Offensive teammates, such as Pawmot and Tyranitar, appreciate Gengar's Toxic Spikes support to pressure checks like Hippowdon. Espeon can help check Gastrodon and deny it from setting Spikes against Gengar; it can also wear down Tinkaton, and it appreciates Toxic Spikes to prevent Pokemon like Scream Tail from checking it. Tinkaton can check Noivern, provide Stealth Rock, and use Knock Off to remove Heavy-Duty Boots from Gastrodon and Slowbro. Sandy Shocks  can provide Spikes to help pressure switch-ins like Tinkaton, and it can offer entry points against Decideueye and Wo-Chien with Volt Switch. In return, it appreciates Gengar pressuring Gastrodon.</p>"
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Gengar is an adept revenge killer and late-game cleaner thanks to its blazing Speed tier alongside solid offensive presence between its remarkable Special Attack and offensive movepool. It can outspeed boosted threats like Polteageist, Toxtricity, Salamence, and opposing Choice Scarf users like Sandy Shocks, Pawmot, and Staraptor. Energy Ball blows away Gastrodon and Sandy Shocks while doing servicable damage to Tyranitar and Hippowdon. On the other hand, Focus Blast hits Grafaiai and Dark-types like Tyranitar and Bisharp, and it lets Gengar revenge kill foes like Tera Normal Lucario and Lycanroc-D, although Gengar likes the ability to immediately KO Gastrodon. Thunderbolt allows Gengar to nail Dragon Dance Gyarados and Booster Energy Iron Jugulis super effectively. Trick improves its matchup against defensive teams by crippling switch-ins like Tinkaton, Hippowdon, and Tera Poison Wo-Chien, as well as shutting down bulky setup sweepers like Oricorio-E. Tera Ghost amplifies Shadow Ball damage, notably 2HKOing Quagsire and OHKOing Gallade, Gardevoir, and Slowbro, while still maintaining Gengar's immunity to Lucario's Extreme Speed.</p> <p>Gengar finds a place on bulky offense and offense teams. Early-game wallbreakers like Scizor, Slither Wing, Tyranitar, and Bisharp can severely weaken or overwhelm Tinkaton, Hippowdon, and Dark-types for Gengar to clean up late-game. Tyranitar and Bisharp also provide a solid defensive backbone against opposing Choice Scarf Gengar to avoid risking Speed ties, with the latter switching into Lokix and opposing Bisharp's Sucker Punch as well. In return, Gengar matches up well against offensive threats like Pawmot, Lucario, and Choice Scarf Gallade that would pose a threat to them. Offensive pivots like Sandy Shocks, Tsareena, and the aforementioned Scizor and Slither Wing can bring Gengar in safely on foes such as opposing Tsareena, Talonflame, Paldean Tauros-W, and Scream Tail, respectively. Moreover, Sandy Shocks provides entry hazards to chip down Gengar's checks, while Tsareena threatens bulky Ground-types like Hippowdon and Gastrodon, the latter of which is especially problematic since its Sticky Hold prevents Gengar's Trick.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Sulo", "user_id": 528036}, {"username": "royalfluxh", "user_id": 493260}, {"username": "Slip", "user_id": 566907}], "teams": [{"name": "Quality checked by", "members": [{"username": "Estarossa", "user_id": 461329}, {"username": "Lily", "user_id": 481709}, {"username": "Monky25", "user_id": 515132}, {"username": "Twilight", "user_id": 344575}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Sulo", "user_id": 528036}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Weezing-Galar": {"sets": [{"name": "Defensive Utility"}]},
  "Tauros-Paldea-Aqua": {"sets": [{"name": "Choice Band"}, {"name": "Bulk Up"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance + Taunt"}]},
  "Ditto": {"sets": [{"name": "Suspicious Imposter"}]},
  "Zapdos-Galar": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}]},
  "Moltres": {"sets": [{"name": "Offensive"}, {"name": "Bulky Pivot"}]},
  "Moltres-Galar": {"sets": [{"name": "Double Dance"}]},
  "Azumarill": {"sets": [{"name": "Belly Drum"}, {"name": "Choice Band"}, {"name": "Assault Vest"}]},
  "Quagsire": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Quagsire is a notable physical wall thanks to its ability Unaware, which allows it to ignore boosts from setup sweepers like Salamence and Scizor. Toxic puts many notable Pokemon in the tier on a timer such as Hippowdon and Gastrodon. Quagsire ideally wants Spikes over Stealth Rock to force more chip damage on potential switch-ins; however, Stealth Rock is fine as an alternative if none of its other teammates can afford to fit it into their moveset. Alternatively, Ice Beam with a Relaxed nature allows Quagsire to 2HKO Hawlucha after Stealth Rock and lets it beat Substitute + Dragon Dance Tera Flying Tyranitars. The passive recovery of Leftovers allows Quagsire to check Choice Band Tyranitar and Mimikyu more easily; however, if the team can not fit entry hazard removal, Heavy-Duty Boots is much more appealing. Quagsire only uses Terastallization defensively to check certain dangerous offensive threats. Tera Poison grants Quagsire a perfectly accurate Toxic and a poison immunity while also allowing it to handle Grass-types and offensive threats that use Grass-type moves such as Tsareena, Trailblaze Scizor, and Seed Bomb Pawmot. Tera Ghost allows Quagsire to beat Maushold by becoming immune to Population Bomb as well as check Slither Wing and Lucario more easily. Tera Ghost also has the added benefit of letting Quagsire serve as a spinblocker against spinners such as Tsareena.</p> <p>Quagsire primarily fits on balance, stall, and bulky offense teams as a defensive glue that holds these teams together. Common teammates for Quagsire include Stealth Rock setters such as Tinkaton and Tyranitar, which can allow Quagsire to run Spikes. Both can check Gengar, special Salamence, and Iron Jugulis, which pose a threat to Quagsire. Tinkaton can also use Knock Off on Heavy-Duty Boots users such as Sticky Hold Gastrodon, Scream Tail, and Wo-Chien to rack up more damage from Quagsire's Spikes. Scream Tail is another Pokemon that complements Quagsire, as it is able to handle special Salamence as well as Gallade, while Quagsire is able to keep Bisharp and non-Trailblaze Scizor in check. Talonflame is another ideal partner for Quagsire as it can check Tsareena and Giga Drain variants of Wo-Chien. Blissey on stall teams is also a strong partner for Quagsire by virtue of walling almost every special attacker in the tier such as Iron Jugulis, Noivern, and Sandy Shocks.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "TyCarter", "user_id": 327020}], "teams": [{"name": "Quality checked by", "members": [{"username": "Twilight", "user_id": 344575}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Slowking": {"sets": [{"name": "Defensive Pivot"}]},
  "Scizor": {"sets": [{"name": "Swords Dance"}, {"name": "Offensive Swords Dance"}, {"name": "Choice Band"}]},
  "Donphan": {"sets": [{"name": "Offensive Utility"}]},
  "Tyranitar": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Tyranitar is a formidable wallbreaker courtesy of its remarkable Attack and good offensive movepool. Its solid natural bulk further boosted by sand grants it plenty of opportunities to enter the field and wallbreak, such as in the face of offensive threats like Gengar, Noivern, Iron Jugulis, and special Salamence. Offensively, the sand helps further chip down defensive foes like Wo-Chien, Tera Fairy Slowking, and Scream Tail, and it diminishes Tsareena and Florges's Synthesis. Earthquake hits Pokemon like Tinkaton, Bisharp, Pawmot, and opposing Tyranitar super effectively. Ice Punch threatens Ground-types like Hippowdon and Donphan as well as various Pokemon like Salamence, Noivern, and Wo-Chien without risking a Stone Edge miss. Tera Flying allows Tera Blast to OHKO would-be checks like defensive Slither Wing and Paldean Tauros-W, and it gets rid of most of Tyranitar's weaknesses, allowing it to sit on Hippowdon and Quagsire and take on potential revenge killers like Scizor, Slither Wing, Lucario, and Gyarados. Aside from maintaining the sand boost, Tera Rock further skyrockets Stone Edge's power, granting significant odds to OHKO Scream Tail after Stealth Rock and 2HKOing physically defensive Wo-Chien. Tera Blast can still be run for a more reliable Rock-type attack when Stone Edge's power isn't necessary, such as against Talonflame and Iron Jugulis.</p> <p>Tyranitar is perfectly suited for offense and bulky offense teams. Pivots like Slowking, Talonflame, and Noivern can bring Tyranitar in safely on the field to wreak absolute havoc, especially as they tend to invite in Pokemon such as opposing Slowking and Slowbro. Additionally, Slowking’s Future Sight enhances Tyranitar's wallbreaking, while Noivern can overwhelm a shared check in Tinkaton; both of which pressure the likes of Paldean Tauros-W, Slither Wing, Quagsire, and Donphan for it. Slowking and Talonflame also switch into offensive threats that beat Tyranitar, such as Slither Wing, Lucario, and Tinkaton, with Slowking handling Paldean Tauros-W as well. Entry hazards from Pokemon such as Tinkaton and Sandy Shocks take advantage of Tyranitar's forced switches and chip down its checks easily. Setup sweepers like Salamence, Lucario, and Gyarados enjoy Tyranitar wallbreaking early-game; it helps pressure Talonflame and Slowbro and overwhelm shared checks like Quagsire, Hippowdon, and Scream Tail for them to sweep more easily.</p>"
      },
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance Tyranitar can sweep by leveraging its bulk, particularly its high Special Defense in sand to find setup opportunities against special attackers such as Noivern, Salamence, and Choice-locked Gengar. Earthquake takes out Rock-resistant foes such as Tinkaton and Sandy Shocks. Substitute provides Tyranitar cover to strengthen its advantage when granted free turns, making it even more difficult to take out, especially with Leftovers keeping it healthy. It also protects Tyranitar against certain status moves, notably Will-O-Wisp from Talonflame and Paldean Tauros-F as well as Toxic from Quagsire. It also provides Tyranitar with protection against priority moves from Scizor and Slither Wing to remove the need to Terastallize versus them. Taunt can be used over Substitute to shut down defensive Pokemon that would otherwise prevent Tyranitar from sweeping such as Roar Hippowdon while still beating Quagsire. Tera Flying Tyranitar beats Quagsire and, if running Taunt, Hippowdon while removing its weakness to priority users such as Slither Wing and Scizor. It can also let Tyranitar gain potential setup opportunities and generate mind games versus Pokemon like Decidueye, Gastrodon, and Pawmot. A Jolly nature ensures Tyranitar can outspeed Gengar, Pawmot, and Sandy Shocks at +1.</p> <p>Dragon Dance Tyranitar fits on a variety of teams, which range from hyper offense to semi-stall. It generally struggles to make progress against bulky Ground-types, as Hippowdon can force it out with Roar or threaten it with Stone Edge, while Quagsire can PP stall it if healthy. Since Iron Defense + Body Press Slowbro is also a problem for it, Tyranitar appreciates support from Grass-types such as Decidueye and Rotom-C. Rotom-C and Decidueye can also bring Tyranitar in on Pokemon such as Noivern and Salamence for setup opportunities. Entry hazard setters such as Sandy Shocks and Gastrodon can help wear down Tyranitar's checks such as Wo-Chien. Sandy Shocks can also provide Tyranitar with setup opportunities against Pokemon like Decidueye, while Gastrodon can provide a secondary check to Pokemon like Salamence and Gengar to help preserve Tyranitar's HP. Sandy Shocks can also potentially use Tera Ice to wear down and pressure RestTalk Wo-Chien for Tyranitar. Scream Tail can provide Tyranitar with Wish support to more consistently check such Pokemon and can deal with Pokemon such as Bulk Up Quaquaval and Paldean Tauros-W that might try to set up against Tyranitar. Wallbreakers such as Paldean Tauros-W and Gengar can wear down checks to Tyranitar like Wo-Chien and Hippowdon. On hyper offense teams, dual screens setters like Grimmsnarl or Psychic Terrain setters such as Indeedee-M can support Tyranitar with setup opportunities and negate revenge killers, while Indeedee-M can also provide Healing Wish support.</p>"
      },
      {
        "name": "Stealth Rock",
        "description": "<p>Tyranitar is a great Stealth Rock setter with ample defensive utility, checking dangerous special attackers like Gengar, Noivern, and Salamence. Rock Blast is an alternative to Stone Edge that breaks Mimikyu's Disguise and opposing Tyranitar's Substitute, but it is overall less powerful. Earthquake hits would-be switch-ins such as Tinkaton and Bisharp. Dragon Tail can be used over Earthquake to phaze setup sweepers like Oricorio-E and Polteageist, though Tyranitar loses against the aforementioned Earthquake targets. Tera Ground provides an Electric immunity, which is particularly useful against Sandy Shocks; the given Ground typing also provides a stronger Earthquake and allows it to beat opposing Dragon Dance Tyranitar. Tera Flying provides an emergency Ground immunity and a Fighting resistance, both of which help against Pawmot, opposing Tyranitar, and Slither Wing. The Stealth Rock weakness given by Tera Flying also makes Heavy-Duty Boots worth considering; this lets it avoid otherwise crippling entry hazard damage and stay heatlhy longer. Tera Fairy gives Tyranitar a crucial resistance to Fighting, letting it bait the aforementioned foes and shedding its Ground weakness. It also helps Tyranitar to survive Ground-type coverage from faster foes like Haxorus and Salamence. However, Tera Fairy and Flying remove the Special Defense boost given by sand, as well as Tyranitar's immunity to its own sand, making Tyranitar worse against threats such as Gengar, Maushold, and Prankster Grafaiai, so it must be careful when Terastallizing.</p> <p>Tyranitar's excellent defensive utility makes it fit well on bulky offense and balance teams. Tyranitar's weakness to strong physical attackers like Slither Wing and Pawmot makes checks to them like Salamence and Quagsire great teammates; the latter can also form an entry hazard-stacking core with Tyranitar, making it easier to wear down foes like Tinkaton and Wo-Chien. Salamence provides a safer switch-in into Talonflame, preventing it from taking a burn or U-turn chip. Scream Tail appreciates Tyranitar checking Gengar and taking pressure off of it as a check to certain special attackers like Salamence and Iron Jugulis. It can also check the aforementioned physical attackers alongside others like Gallade, and it can provide Wish support to keep Tyranitar healthy as well. Tinkaton can remove Heavy-Duty Boots from Pokemon like Talonflame, Slowking, and Sandy Shocks, making Stealth Rock more effective in wearing down the opposition, especially if Tyranitar is paired with a Spikes setter like Sandy Shocks. Tyranitar being checked by bulky Ground-types like Quagsire, Hippowdon, and Donphan makes the likes of Tsareena and Wo-Chien desirable as teammates; Tsareena in particular also gives Tyranitar free entry against Noivern and Gengar via U-turn.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}, {"username": "Sulo", "user_id": 528036}, {"username": "SamuelIsono", "user_id": 519223}], "teams": [{"name": "Quality checked by", "members": [{"username": "Twilight", "user_id": 344575}, {"username": "Sulo", "user_id": 528036}, {"username": "Estarossa", "user_id": 461329}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "autumn", "user_id": 384270}, {"username": "YashGreninja", "user_id": 383911}]}]}
  },
  "Pelipper": {"sets": [{"name": "Rain Setter"}, {"name": "Offensive"}]},
  "Gardevoir": {"sets": [{"name": "Choice Scarf"}]},
  "Breloom": {"sets": [{"name": "Offensive"}]},
  "Salamence": {
    "sets": [
      {
        "name": "Special Wallbreaker",
        "description": "<p>Salamence stands out as one of the premier Pokemon in the tier thanks to its defensive and offensive presence. Its typing, bulk, and ability in Intimidate make it one of the best responses to physical threats like Slither Wing, Lucario, and Scizor. Hydro Pump blows away foes like Hippowdon, Tyranitar, and Sandy Shocks while providing a strong neutral hit on Tinkaton and Scizor. Flamethrower hits the aforementioned Steel-types, alongside others like Bisharp and Tinkaton. Flamethrower also hits Brambleghast without reaping the downsides of using Draco Meteor. Heavy-Duty Boots removes Salamence's Stealth Rock weakness, which allows it to switch in more freely against threats it needs to check. Terastallizing is primarily used defensively to improve its matchups against common offensive Pokemon. Tera Water allows Salamence to resist Bullet Punch from Scizor and still retain a Water-type resistance against Floatzel. Tera Steel improves the matchup against Tinkaton, turns Salamence into a decent Staraptor and Maushold check, and provides a resist to many forms of priority in the tier such as Accelerock from Lycanroc-D and Bullet Punch from Scizor. Tera Dragon should be used to help break through sturdier Pokemon like Gastrodon and Slowking more easily.</p> <p>Pawmot and Scizor can help remove Gastrodon, Tyranitar, and Scream Tail— all of which Salamence struggles to break past—while also serving as more reliable checks to Bisharp. Faster Pokemon such as Pawmot, Sandy Shocks, and Lycanroc-D can revenge kill or force Salamence out, so partners like Hippowdon and Quagsire are appreciated, both also acting as decent Knock Off absorbers against Grafaiai and Tinkaton. Quagsire can also provide Spikes support to help wear down some of the aforementioned special walls as well as put them on a timer with Toxic, as well as reliably check most Swords Dance Scizor and Lucario if Salamence isn't Tera Steel.</p>"
      },
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance makes Salamence one of the scariest sweepers in the tier thanks to its great offensive typing. Outrage is a powerful STAB move that helps muscle through sturdier walls like Gastrodon and Hippowdon after a boost; however, Dragon Claw is a weaker alternative that doesn't have the downside of being locked in. Earthquake provides perfect coverage to deal with Tyranitar, Tinkaton, and Bisharp. Dual Wingbeat helps break through Scream Tail better and can pick off weakened Flying-types like Noivern and Iron Jugulis without locking into Outrage. Roost is an alternative that provides longevity against Pokemon like Slither Wing and Lokix. It is best used alongside Intimidate on bulkier teams that need the defensive utility of Salamence's typing. Otherwise, Moxie is preferred, as it can easily let Salamence snowball through a team. Tera Steel lets Salamence set up on Tinkaton—though it must be wary of Encore—and provides needed resists to many priority moves like Accelerock, Bullet Punch, Ice Shard, and Extreme Speed from Lycanroc-D, Scizor, Weavile, and Lucario.</p> <p>Quagsire is very problematic due to Unaware ignoring any Dragon Dance and Moxie boosts. Pawmot can remove Quagsire with Seed Bomb, Scizor can lure it in and remove it with Trailblaze, and Sandy Shocks can threaten to OHKO with Tera Blast after Terastallizing into a Grass-type. Sandy Shocks can also help remove physically defensive Hippowdon, which is especially helpful if it's running Roar. Sandy Shocks and other entry hazard setters such as Tyranitar can wear down Pokemon like opposing Tyranitar and Scream Tail into range of its attacks. Gengar is a fantastic wallbreaker to pair with Salamence, as it can forcefully remove Grafaiai, which can be a massive hindrance due to Prankster Encore limiting setup opportunities. Gengar also spinblocks alongside the aforementioned entry hazard setters and weakens Tyranitar and Tinkaton into Earthquake range.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Twilight", "user_id": 344575}], "teams": [{"name": "Quality checked by", "members": [{"username": "Monky25", "user_id": 515132}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Jirachi": {"sets": [{"name": "Calm Mind + Wish"}, {"name": "Choice Scarf"}]},
  "Infernape": {"sets": [{"name": "Nasty Plot"}]},
  "Gastrodon": {"sets": [{"name": "Specially Defensive"}]},
  "Hippowdon": {
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Hippowdon makes for a great mixed wall by virtue of its bulk, typing, and access to reliable recovery. Its superb bulk enables it to check some of the metagame’s most dangerous threats in Pawmot, Salamence, Tyranitar, and Sandy Shocks. It also provides value through Sand Stream to help combat rain teams if given momentum to get in freely, as it can't hard switch into Water-types. Stone Edge enables Hippowdon to pressure Flying-types like Iron Jugulis and Salamence, in addition to being able to beat Taunt Dragon Dance Tyranitar even after it Terastallizes. Roar is also an option, as it allows Hippowdon to phaze setup sweepers like Polteageist in a pinch and synergizes well with entry hazards. Leftovers is the preferred item, as its residual healing improves Hippowdon's overall longevity and preserves Slack Off's PP. The given spread with an Impish nature and Leftovers avoids a 2HKO from Life Orb Pawmot and prevents Hippowdon from being KOed by Hurricane into Draco Meteor from Salamence after Stealth Rock while avoiding a 2HKO from Sandy Shocks without Stealth Rock. Rocky Helmet is also an option to punish physical attackers, primarily U-turn users and Maushold. A specially defensive spread is an option to handle Gengar if Pawmot is less of a concern. Tera Rock pairs well with its sand, as the Special Defense boost it receives gives it a strong matchup versus special attackers like Gengar, Salamence, and Noivern. Additionally, Tera Rock boosts Hippowdon’s Stone Edge to put more pressure on targets like Salamence. After Hippowdon has Terastallized, it is threatened by Pawmot, Sandy Shocks, and Tyranitar, so be careful when Terastallizing. Tera Ghost is an option that makes Hippowdon a strong response versus Slither Wing, Lucario, and Maushold and lets it spinblock against Donphan. Tera Fairy is an option that grants Hippowdon a generally good defensive typing, including a Fighting resistance, and makes it less vulnerable to Greninja. After becoming a Fairy- or a Ghost-type, Hippowdon is unable to check Gengar, and in the case of the latter, Tyranitar sets running Crunch as well. Tera Dragon makes Hippowdon an effective answer to rain teams through the useful Water-type resistance it provides.</p> <p>Hippowdon most commonly fits on bulky offense or balance teams for its walling capabilities. Talonflame and Noivern make for good partners, as they are capable of grabbing momentum with U-turn off of opposing Decidueye and Wo-Chien swapping in to exploit Hippowdon. Hippowdon can in return easily absorb Knock Off from the likes of Tinkaton in order to preserve the Heavy-Duty Boots they both depend on. Wo-Chien is also a solid pick for a partner as a nice fit on most balance teams, as well as an answer to bulky Water-types that may attempt to annoy Hippowdon. In particular, Wo-Chien’s RestTalk set is capable of swapping in on Quagsire easily, as it is able to shrug off Toxic. Wo-Chien can also relieve pressure from Hippowdon, as it can take on Sandy Shocks. Tinkaton also makes for a good partner, as it is able to take a lot of the pressure off of Hippowdon by taking hits from Gengar and specially offensive Flying-types such as Iron Jugulis, Noivern, and Salamence. Tinkaton is also capable of providing useful Knock Off support by removing opposing Leftovers and Heavy-Duty Boots to enable Hippowdon’s Stealth Rock and sandstorm damage to stick. In return, Hippowdon being able to carry Stealth Rock means that Tinkaton does not need to run it itself and can fit a more useful option. Assault Vest Cyclizar is able to check Greninja and Wo-Chien for Hippowdon and keep Spikes or Toxic Spikes off the field from the former.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Easter Bliss", "user_id": 630045}], "teams": [{"name": "Quality checked by", "members": [{"username": "Twilight", "user_id": 344575}, {"username": "Estarossa", "user_id": 461329}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Weavile": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Magnezone": {"sets": [{"name": "Magnet Pull Trapper"}]},
  "Mamoswine": {"sets": [{"name": "Wallbreaker"}]},
  "Rotom-Wash": {"sets": [{"name": "Utility Pivot"}, {"name": "Nasty Plot"}]},
  "Heatran": {"sets": [{"name": "Specially Defensive"}, {"name": "Offensive"}]},
  "Cresselia": {"sets": [{"name": "Calm Mind"}]},
  "Zoroark-Hisui": {"sets": [{"name": "Choice Specs"}]},
  "Amoonguss": {"sets": [{"name": "Defensive", "description": "<p>The given EV spread allows Amoonguss to avoid the 2HKO from Modest Choice Scarf Basculegion-F's Shadow Ball.</p>"}]},
  "Alomomola": {"sets": [{"name": "Wish + Protect"}]},
  "Haxorus": {"sets": [{"name": "Swords Dance"}]},
  "Mienshao": {"sets": [{"name": "Wallbreaker"}, {"name": "Choice Scarf"}]},
  "Mandibuzz": {"sets": [{"name": "Defensive"}]},
  "Hydreigon": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Nasty Plot"}]},
  "Tornadus-Therian": {"sets": [{"name": "Nasty Plot"}, {"name": "Pivot"}, {"name": "Assault Vest", "description": "<p>The given EV spread allows Tornadus-Therian to outspeed Maushold as well as survive a Draco Meteor from Modest Choice Specs Hydreigon after Stealth Rock.</p>"}]},
  "Thundurus": {"sets": [{"name": "Pivot"}]},
  "Thundurus-Therian": {"sets": [{"name": "Pivot"}, {"name": "Nasty Plot"}]},
  "Chesnaught": {"sets": [{"name": "Spikes Utility"}]},
  "Talonflame": {"sets": [{"name": "Utility"}]},
  "Sylveon": {"sets": [{"name": "Calm Mind + Wish"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Goodra-Hisui": {"sets": [{"name": "Specially Defensive Wall"}, {"name": "Choice Specs"}]},
  "Hoopa-Unbound": {"sets": [{"name": "Choice Scarf"}, {"name": "Assault Vest"}]},
  "Volcanion": {"sets": [{"name": "Offensive"}]},
  "Lycanroc-Dusk": {"sets": [{"name": "All-out Attacker"}]},
  "Mimikyu": {"sets": [{"name": "Swords Dance", "description": "<p>Tera Fire allows Mimikyu to avoid Flame Body and Will-O-Wisp from Talonflame and Coalossal. Tera Ghost powers up Shadow Claw and lets it OHKO Tinkaton after a boost.</p>"}]},
  "Barraskewda": {"sets": [{"name": "Choice Band"}]},
  "Polteageist": {"sets": [{"name": "Shell Smash", "description": "<p>Tera Blast in conjunction with Tera Fighting gives Polteageist the necessary coverage to break past Dark-types like Tyranitar, Bisharp, and Iron Jugulis that wall it otherwise. Tera Fighting also allows Polteageist to resist Sucker Punch from Bisharp and Accelrock from Lycanroc-D as well as take neutral damage from Mimikyu's Shadow Sneak.</p>"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Regidrago": {"sets": [{"name": "Choice Specs"}, {"name": "Dragon Dance"}]},
  "Kleavor": {"sets": [{"name": "Choice Scarf"}, {"name": "Swords Dance"}]},
  "Ursaluna": {"sets": [{"name": "Bulk Up"}, {"name": "Wallbreaker"}]},
  "Basculegion-F": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Substitute + 3 Attacks"}]},
  "Overqwil": {"sets": [{"name": "Rain Sweeper"}]},
  "Enamorus-Therian": {"sets": [{"name": "Offensive"}, {"name": "Calm Mind + Iron Defense"}]},
  "Meowscarada": {"sets": [{"name": "Pivot"}, {"name": "Choice Scarf"}, {"name": "Choice Band"}, {"name": "Lead"}]},
  "Skeledirge": {"sets": [{"name": "Unaware Wall"}, {"name": "3 Attacks + Slack Off"}]},
  "Quaquaval": {"sets": [{"name": "Swords Dance"}, {"name": "Rapid Spin"}]},
  "Lokix": {"sets": [{"name": "Pivot"}, {"name": "Wallbreaker"}]},
  "Pawmot": {
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Thanks to its high Speed, unique typing, and powerful Electric-type STAB move in Double Shock, Pawmot sets itself apart as one of the premier wallbreakers in UU. Seed Bomb allows Pawmot to lure common checks such as Quagsire and Gastrodon and OHKO them handily. Alternatively, Ice Punch provides a solid middle ground against Ground- and Flying-types, in cases where losing Pawmot's Electric typing via Double Shock is not ideal, as well as allowing Pawmot to hit Brambleghast effectively, although this does require backup for Gastrodon and Quagsire. Natural Cure allows it to not worry about Talonflame's Flame Body and use Rest to improve its longevity, offsetting the damage from Life Orb and entry hazards. Tera Electric allows for Pawmot to continuously use Double Shock without switching out and increases its power, making it even more difficult to handle. This also helps Pawmot's defensive matchup against threats such as Gardevoir, Noivern, and Brave Bird Talonflame; although, one should still be aware of losing important resistances to strong priority attacks such as Slither Wing's First Impression and Bisharp's Sucker Punch. Heavy-Duty Boots is also an option over Life Orb to preserve Pawmot's longevity.</p> <p>Pawmot fits well on teams that benefit from its ability to handle common threats such as Tinkaton, Slowking, and Tyranitar by breaking through them with raw power, as well as offensive teams that appreciate its excellent Speed. Reliable entry hazard setters such as Tinkaton and Sandy Shocks are worth considering, as the chip damage they provide makes it even easier for Pawmot to break through defensive threats, with the former also boasting Encore to help generate free turns. Grass-types such as Wo-Chien, Brambleghast, and Tsareena are also appreciated to handle Gastrodon and Quagsire, especially if Pawmot chooses Ice Punch, with the latter two also offering reliable hazard removal. Rock-types such as Tyranitar and Lycanroc-D that handle Talonflame as well as other Flying-types such as Iron Jugulis and Noivern are also appreciated. Scream Tail is also a teammate worth considering, as it has access to Stealth Rock and Encore, as well as Wish to keep Pawmot healthy and Thunder Wave to cripple fast threats like Grafaiai and Gengar while also having a strong matchup against revenge killers such as Noivern and Iron Jugulis. Pawmot also appreciates teammates with pivoting moves, such as Scizor, Tsareena, Noivern, and Grafaiai, to allow it to come in safely, especially against targets such as Tinkaton and Slowking.</p>"
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Pawmot is a solid threat in the UU metagame and becomes an excellent revenge killer when paired with Choice Scarf, threatening Pokemon like Talonflame, Wo-Chien, and Salamence. Pawmot's last moveslot can be either Revival Blessing or Seed Bomb. Revival Blessing allows Pawmot to revive a teammate on a forced switch, while Seed Bomb can threaten Pokemon like Quagsire and Gastrodon better. Revival Blessing is more commonly run, as Close Combat can usually do enough damage to break these walls with some entry hazard assistance. An Electric Tera type is vital for Pawmot, as it allows Pawmot to spam Double Shock without repercussion. Natural Cure allows Pawmot to shrug off burns from the likes of Talonflame and Altaria, as they would otherwise hinder Pawmot's offensive presence.</p> <p>Choice Scarf Pawmot best fits on Spikes stacking teams in need of speed control. This makes Pokemon like Quagsire and Gastrodon good teammates, as they enjoy setting up Stealth Rock or Spikes, and the former can also use Toxic to chip teams down more efficiently for Pawmot. Pawmot struggles to deal with bulky Ground-types like Hippowdon, making teammates like Brambleghast and Wo-Chien appreciated due to their ability to soak up Earthquake while also removing hazards or removing Heavy-Duty Boots to rack up entry hazard damage, respectively. Pokemon that can outspeed Pawmot, like Choice Scarf Gengar and +2 Polteageist, can cause major issues, making priority users like Scizor and Lycanroc-D good partners to KO these threats.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Melt Gibson", "user_id": 617840}, {"username": "Slip", "user_id": 566907}], "teams": [{"name": "Quality checked by", "members": [{"username": "Mystras", "user_id": 530118}, {"username": "Twilight", "user_id": 344575}, {"username": "Queen of Bean", "user_id": 587685}]}, {"name": "Grammar checked by", "members": [{"username": "Band", "user_id": 301217}, {"username": "Lumii", "user_id": 493772}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Maushold": {"sets": [{"name": "The Smaller Family"}]},
  "Maushold-Four": {"sets": [{"name": "The Family"}]},
  "Armarouge": {"sets": [{"name": "Endure + Weakness Policy"}, {"name": "Calm Mind"}]},
  "Bellibolt": {"sets": [{"name": "Physically Defensive Static"}]},
  "Grafaiai": {
    "outdated": true,
    "sets": [
      {
        "name": "Offensive Prankster",
        "description": "<p>Grafaiai is one of the most infuriating pivots to play around when using its signature Prankster set, and it's not hard to see why. Thanks to Encore, Grafaiai can lock any non-Dark-type Pokemon it wants into its move, a trait particularly deadly against setup sweepers like Dragon Dance Haxorus, Quiver Dance Oricorio-E, and Swords Dance Scizor. Its unique typing also lets it act as a serviceable check to Pokemon like Gengar, Mimikyu, and Polteageist despite its mediocre bulk. Gunk Shot provides an excellent STAB option that hits very hard despite Grafaiai's only decent base 95 Attack, and Knock Off is great for crippling switch-ins like Tinkaton, Bisharp and Tyranitar. Parting Shot is very useful when paired with Prankster, allowing Grafaiai to freely pivot out and easing pressure on its defensive teammates when weathering incoming attacks. Tera Poison is usually the preferred option, but Grafaiai is usually not going to Terastallize anyway; if it does, then it prefers to have a strong Gunk Shot to threaten the foe with.</p> <p>Grafaiai works well with offensive teammates that appreciate its ability to bring them in safely on Pokemon like Tinkaton and Gastrodon, particularly strong Fighting-types that can bust through the weaker Defense of these Pokemon. Good examples include Paldean Tauros-W and Pawmot. Pivot cores with the likes of Choice Band Scizor, Noivern, Sandy Shocks, and Kilowattrel are also effective. Defensively, it is important to have good checks to Tinkaton, Tyranitar, and Bisharp, making Hippowdon, Quagsire, and physically defensive Gastrodon good teammates. Pokemon that sometimes struggle in matchups against hyper offense like Tinkaton and Talonflame appreciate Grafaiai's Encore support. Talonflame can also form a very obnoxious U-turn cycling core with Grafaiai.</p>"
      },
      {
        "name": "Bulky Prankster",
        "description": "<p>Specially defensive Grafaiai is a much better check to some Pokemon it's usually tasked with handling, like Gengar, Oricorio-E, Polteageist and, thanks to the HP investement, Mimikyu. Gunk Shot is an excellent STAB move still, but without Speed EVs, Grafaiai is slower than Pokemon like Pawmot, Tatsugiri, and Iron Jugulis. As such, Grafaiai can swap it out for Toxic to cripple defensive switch-ins like Hippowdon and Quagsire in addition to being a great panic button against Pokemon like Oricorio-E, Dragon Dance Salamence, and Gyarados, or run Low Kick to deal with Dark-types that block Prankster moves such as Bisharp and Tyranitar. If needed, Grafaiai can still run maximum Speed investment on this set if necessary, letting it offensively check Pawmot and Iron Jugulis, though it doesn't hit them too hard without offensive investment. It is generally preferred to maximise its bulk, though.</p> <p>Grafaiai needs good defensive support, as it can struggle to be self-sufficient due to its inability to do much immediate damage. This makes it a better fit on defensive teams that appreciate its reliability in handling Gengar and the utility provided by its Prankster moves. Good checks to Dark-types like Iron Jugulis, Tyranitar, and Bisharp are the most mandatory teammates, as Grafaiai typically cannot do anything to them save for a weak Knock Off; good options include Tinkaton, Hippowdon, and Paldean Tauros-W, but do note that it is important to check Iron Jugulis and the physical Dark-type Pokemon differently. Scream Tail makes for a great partner too, healing Grafaiai with Wish against Pokemon like Gengar that would typically use Scream Tail as a free switch-in opportunity. It can also handle the likes of Pawmot decently. Teammates like Talonflame can make it easier for Grafaiai to pivot around through burning physical threats, making it a bit easier for Grafaiai to use its typing to handle the likes of Lokix and Slither Wing.</p>"
      },
      {
        "name": "Poison Touch Pivot",
        "description": "<p>Poison Touch Grafaiai is a very difficult Pokemon to switch into, as the combination of Knock Off, Poison Touch, and expanded coverage in U-turn and Low Kick makes typical answers like Hippowdon and Gastrodon lacking Covert Cloak much less happy to switch in. With its boosted coverage, it is much more difficult to wall Grafaiai with the likes of Tinkaton, Tyranitar, and Bisharp, making it a challenge to find Pokemon that can halt it from making progress over the course of a game. Grafaiai can also opt to use Switcheroo over Low Kick with Black Sludge to cripple Pokemon like Hippowdon and Tinkaton even further; while it prefers Heavy-Duty Boots, it can certainly make do with their stolen Leftovers. Tera Poison is chosen to boost Grafaiai's Gunk Shot, while Tera Fighting is also an option for a stronger Low Kick, although neither are particularly great choices, and Grafaiai should rarely be Terastalized anyway.</p> <p>Poison Touch Grafaiai makes for an excellent pairing with Hex Gengar. Not only does Grafaiai spread poison to boost Hex to meteoric levels of power, but it also weakens Tinkaton and Tyranitar very quickly, two Pokemon Gengar doesn't like dealing with. An important thing to keep in mind when building with Poison Touch Grafaiai is that it can struggle a bit with hyper offense squads; partners that have a strong matchup against those like Kilowattrel, Mimikyu, and Scizor can be very helpful. Taunt Talonflame eases Grafaiai's matchup against offense while also taking great advantage of all the residual damage Grafaiai spreads, notably being a capable check to Scizor if it isn't running Tera Fire. These Pokemon all appreciate Grafaiai's ability to weaken bulky Ground-types, too. Grafaiai loves entry hazard support. since it's so good at removing Heavy-Duty Boots with Knock Off; setters like Gastrodon, Sandy Shocks and Tinkaton make for great partners.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "Lily", "user_id": 481709}], "teams": [{"name": "Quality checked by", "members": [{"username": "Estarossa", "user_id": 461329}, {"username": "Queen of Bean", "user_id": 587685}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Tinkaton": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Tinkaton is a solid Pokemon in UU thanks to its amazing typing, good bulk, and coveted utility movepool. It’s a good Stealth Rock setter due to its typing letting it set up on Tyranitar, Grafaiai, and Scream Tail. Knock Off removes crucial items such as Talonflame's Heavy-Duty Boots and Bisharp's Eviolite. Encore shuts down setup sweepers such as Quiver Dance Oricorio-E and can lock Quagsire and Gastrodon into Toxic, Ice Beam, and Recover. Thunder Wave can catch Talonflame attempting to switch into it to clear Stealth Rock, but Encore is more consistent overall. Mold Breaker lets Tinkaton ignore Mimikyu's Disguise, letting it force progress on offensive teams. Tera Dark allows Tinkaton to better check Gengar while giving Knock Off a boost. Tera Ghost turns Tinkaton into an emergency check to Slither Wing and Lucario while also spinblocking against Tatsugiri. However, it's not recommended to use since it makes it weak to Pokemon that it is supposed to check such as Gengar and Tyranitar.</p> <p>Utility Tinkaton fits on every single playstyle except hyper offense thanks to its good typing and movepool. Spikes users like Quagsire and Gastrodon can form entry hazard stack cores with Tinkaton while also handling Pawmot, Quaquaval, Scizor, and non-Tera Grass Sandy Shocks. Quagsire is able to spread Toxic against hazard removers such as Defog Talonflame and Donphan, while Tinkaton can use Knock Off to remove Heavy-Duty Boots and Leftovers from Salamence and Wo-Chien to wear down foes further. Gengar is a fantastic partner, since Tinkaton is able to handle opposing Gengar and Grafaiai for it and remove Gastrodon's Heavy-Duty Boots. This helps Gengar break down Gastrodon more easily without having to use Energy Ball. Hippowdon appreciates Tinkaton running Stealth Rock and checking Decideueye, allowing it to run both Stone Edge and Roar. In return, it checks Pokemon that take advantage of Tinkaton, such as Sandy Shocks and Iron Jugulis.</p>"
      }
    ],
    "credits": {"writtenBy": [], "teams": [{"name": "Utility set written by", "members": [{"username": "romanji", "user_id": 524894}]}, {"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Queen of Bean", "user_id": 587685}, {"username": "Estarossa", "user_id": 461329}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Cyclizar": {"sets": [{"name": "Utility", "description": "<p>The given Speed EVs allows Cyclizar to outspeed Hisuian Zoroark. If running Draco Meteor or Overheat, Cyclizar should be run with a Timid Nature, 80 Special Attack EVs, and 176 Speed EVs in order to outspeed Maushold.</p>"}]},
  "Clodsire": {"sets": [{"name": "Defensive"}]},
  "Scream Tail": {"sets": [{"name": "Wish Support"}]},
  "Slither Wing": {
    "sets": [
      {
        "name": "Bulky Pivot",
        "description": "<p>Slither Wing's solid bulk gives it a unique niche as an offensive pivot that provides useful defensive utility. It's good typing and bulk allow it to check a lot of Pokemon such as Bisharp, Tsareena, Tyranitar, and Wo-Chien. Morning Sun provides recovery and lets Slither Wing use its typing more effectively to check Pokemon such as opposing Sandy Shocks and Tyranitar. In matchups where sand is present, Slither Wing becomes much easier to wear down as a result of its weakened recovery. First Impression lets Slither Wing act as a great revenge killer, as it still packs plenty of power behind it to revenge kill frail, fast Pokemon such as Lycanroc-D, Gardevoir, Dragon Dance Tyranitar, and Haxorus. Stun Spore instead of Morning Sun lets Slither Wing cripple switch-ins like Salamence and Talonflame to create openings for teammates such as Choice Specs Toxtricity. Tera Bug improves Slither Wing's ability to revenge kill Pokemon with First Impression and boosts the power of its U-turn. Tera Ghost lets Slither Wing spinblock and check Maushold and Lucario. Protective Pads is run to help against Flame Body Talonflame as it otherwise can threaten Slither Wing with Will-O-Wisp, which limits its offensive potential. Heavy-Duty Boots can be ran when the team lacks hazard control and keeping Slither Wing healthy is important for the team and Slither Wing teammates that are capable of taking advantage of Talonflame. Maximum HP EVs allow Slither Wing to more comfortably switch into hits and utilize it to force out opponents. The Special Defense EVs allows it to avoid the 2HKO from Noivern's Flamethrower while also reliably surviving its Draco Meteor. The speed EV's are for Jolly Tyranitar.</p> <p>Slither Wing works best on teams that are able to capitalize on its ability to pivot, which makes it effective on VoltTurn cores with Pokemon such as Iron Jugulis, Sandy Shocks, and Rotom-H. Slither Wing without Protective Pads is easily victim to burns from Flame Body Talonflame, which also forces it out easily, making the aforementioned Sandy Shocks and Rotom-H excellent partners that also force out Talonflame and use it to generate momentum. They are also both able to help Slither Wing by checking Salamence and Gengar. Tinkaton is a great teammate, as it can remove Talonflame's Heavy-Duty Boots to pressure Non-defog variants making it be harder to switch in under hazards. Wallbreakers like Choice Specs Toxtricity and Gengar like Slither Wing pressuring Tyranitar, Tinkaton, and Gastrodon and are able to pressure threats to Slither Wing like Salamence and Talonflame in return.</p>"
      }
    ],
    "credits": {"writtenBy": [{"username": "HydreigonTheChild", "user_id": 492518}], "teams": [{"name": "Quality checked by", "members": [{"username": "Twilight", "user_id": 344575}, {"username": "Monky25", "user_id": 515132}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Lumii", "user_id": 493772}]}]}
  },
  "Sandy Shocks": {"sets": [{"name": "Pivot"}, {"name": "Booster Energy"}]},
  "Iron Treads": {"sets": [{"name": "Offensive Utility"}, {"name": "Booster Energy"}, {"name": "Bulky Utility"}]},
  "Iron Hands": {"sets": [{"name": "Swords Dance"}]},
  "Iron Jugulis": {"sets": [{"name": "Booster Energy"}]},
  "Iron Leaves": {"sets": [{"name": "Swords Dance"}]},
  "Sinistcha": {"sets": [{"name": "Calm Mind"}]},
  "Okidogi": {"sets": [{"name": "Choice Band"}]},
  "Fezandipiti": {"sets": [{"name": "Bulky Pivot"}, {"name": "Calm Mind"}]},
  "Ogerpon": {"sets": [{"name": "Swords Dance"}, {"name": "Pivot"}]}
}